{"mid": [{"value": 35612}], "uuid": [{"value": "7fb15227-024b-4fc8-8a47-e7ae3d0b0137"}], "vid": [{"value": 35612}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12160-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "At)<br />\n<br />\n11./P& VER,4 ./900<br />\n<br />\n-+.010.+•.•.•••<br />\n<br />\n•PRESS Or STONEBRAKER<br />\n<br />\nBROS., BALTIMORE<br />\n<br />\n\fJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br />\nEnsmonominnem<br />\n<br />\nTwenty-Fifth Year.<br />\n<br />\n13eginning October 1st, 1900.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nDANIEL C. GILMAN<br />\nWM. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\n<br />\n95.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\nDirectors.<br />\n<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks,<br />\nFranklin P. Mall.<br />\nWilliam It. Howell.<br />\nWilliam II. Welch.<br />\nJohnJ. Abel.<br />\nJohnJ. Abel.<br />\nWilliam Os/cr.<br />\n<br />\nSeminaries.<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames IN. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the'Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\nG. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXII.)<br />\nChemistry (vol XXIV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XVIII.)<br />\nModern Languages (vol. XV.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nEditors.<br />\nFrank Moreley.<br />\nIra Remsen.<br />\nBasil L.Gildersleeve.<br />\nHerbert B. Adams.<br />\nA. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. II. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br />\n<br />\nThe Julius Hopkins<br />\nI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nS NEWCOMB,Editor. Quarterly. 4to. Volume XXII..<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXIV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. AnAms, Editor. Monthly. 8vo. Series XVIII<br />\nIII progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXI in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nX.<br />\n<br />\nXl.<br />\n<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nXIV.<br />\nXV.<br />\n<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV in progress. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELmorr, Editor. Monthly. 4to. Volume XV<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. II. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nV ill progress. $5 per volume.<br />\nAmerican Journal of insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\n<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc., of the University. Published at the<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to, 56 plates. $7.50, cloth.<br />\nTHE TEACHING'OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br />\n<br />\n\fCbe newsr= Letter. *<br />\nVol. V.<br />\n<br />\nJanuary 10, 1901.<br />\n<br />\nA VISIT TO ETON COLLEGE.<br />\nwas a gray day when we first saw Eton ColITlege.<br />\nWe did not have that bright sunniness<br />\n<br />\n•<br />\n<br />\nwhich decks the sward with wild flowers and<br />\ngives to the whole the joyous warmth of color<br />\ngenerally held as characteristic of a true English<br />\nlandscape; but the heaviness of the atmosphere<br />\nwas conducive to quiet contemplation and serious thought, and the external aspect of the<br />\ncollege surroundings inspired regard for the<br />\nantiquity of its foundation and the glory of its<br />\nachievements.<br />\nFrom the summit of the great tower of Windsor, from which one can see into thirteen counties in clear weather, we looked across the river<br />\nand saw a number of men and boys running<br />\nabout in an open field playing at the English<br />\ngame offoot-ball. Down in the town we met a<br />\ndozen or more of these men. Great, stalwart<br />\nfellows they were, their thin running suits, with<br />\ngolf stockings rolled down below a bare knee,<br />\nand their light, vertically striped jackets, devoid<br />\nof all padding, marking them in vivid contrast<br />\nto the foot-ball warriors on this side of the<br />\nwater. Though apparently very young, they<br />\nnearly all wore moustaches, and their stocky<br />\nbuild and sturdy demeanor as they swung in a<br />\nbody through the midst of thc town and across<br />\nthe bridge leading to the college,impressed us as<br />\ntypifying the physical glory of young English<br />\nmanhood. Followed by a crowd of admiring<br />\ntownsboys, they tramped up one of the streets<br />\nof the little town and finally disappeared behind<br />\nthe doors of a wine shop, leaving me with the<br />\nsudden recollection that these men had been<br />\nclothed in shirts of black and blue, the first time<br />\nthat I had ever seen or heard of that combination of colors as a college emblem outside of<br />\nJohns Hopkins.<br />\nAll along the street leading up to the college<br />\nlittle shops displayed pictures offoot-ball teams,<br />\nand winning eights, and views of college ceremonies and entertainments, together with lots<br />\nof little painted jugs and mantel ornaments all<br />\n<br />\nNo. 6,<br />\n<br />\nbearing the motto, Floreat Etona, and little<br />\nboys in tall hats and round collars and wearing<br />\nthose same \"Eton jackets,\" that we see sometimes a part of ladies' dresses, looked in at the<br />\nwindows from time to time as they walked in<br />\ngroups with their hands in their pockets or<br />\ntwisting the enormous watch chains which<br />\nhung down over their waistcoats.<br />\nPassing from the road through an archway<br />\nwe come to the quadrangle, called the schoolyard, although it is roughly paved with cobblestones and its only ornamentation is a statue of<br />\nHenry VI. in the centre. One of the gloomy<br />\ndoorways around this yard was open, and a<br />\ngroup of students, some wearing gowns, were<br />\npassing in very slowly to recitation, nearly every<br />\none taking a last fond look at his page as he<br />\ncrossed the forbidding threshold. I was overcome with emotion. It was so like home!<br />\nBack in the great hall where the meals are<br />\nserved to the whole school, and in parts of the<br />\nupper school, may be seen carved deeply into<br />\nthe panels or the tops of desks among a perfect<br />\nwilderness of letters and ciphers, the initials of<br />\nShelley, and Charles James Fox, and Eton men<br />\nguard with pride the memory of Lord Byron's<br />\ncricket playing, Gladstone's youthful writings<br />\nfor the \"Etonian,\" and George Canning's<br />\nschool boy popularity.<br />\nBeyond the cloisters lie the playing fields.<br />\nAnd such an expanse of soft velvet verdure as<br />\nwould ravish the sight of a Hopkins man!<br />\nThink of a beautiful grassy plain finely kept and<br />\ntrimmed, and stretching away along the river<br />\nwith space enough for three enclosed gridirons,<br />\nwhile beyond, across the slough road is another<br />\nopen field large enough fora half dozen more contests! Passing through a stile in the hedge, we<br />\ncame out upon this second field, where four simultaneous foot-ball games were then in progress among the younger boys. Here was surely<br />\nthe paradise of the athlete,open air exercise free<br />\nand unconfined at a short walk from the college<br />\nbuildings and in the purest of atmospheres.<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nBut the joy to the studious and the contemCHRISTMAS TRIP OF THE MUSICAL<br />\nplative, to those who love nature and the comCLUBS.<br />\npanionship of the woods and running waters, is<br />\nthe river. Here the Thames flows gently through<br />\nT last the much talked of Christmas trip of<br />\nthe pleasant meadow, a cool limpid brook, savthe Musical Clubs is over,and the men who<br />\ning its strength for the present. Soon it must were fortunate enough to be taken away have<br />\nbear upon its broad bosom the shipping of the resigned themselves, and their five dollars cau•<br />\nnations. Now it is a modest country stream, tion money to fate and Manager Bird.<br />\nand as it glides softly at our feet, kissing the<br />\nFrom start to finish the trip was a success.<br />\noverhanging branches of the trees, and gurgling Every man had an excellent time and came back<br />\nwith laughter around some projecting root or showing that he had made the most of the recepobstructing rock, it filled the soul with peace tions and late dances given to the Clubs after<br />\nand inward joy.<br />\nthe concerts. The Clubs all assembled at CamOn the bank is a great tree, whose interlacing den Station Wednesday afternoon,December 26,<br />\nroots form a natural seat right down on the and after a two-hour ride in their private car<br />\nedge of the water. Here we sat ourselves down hitched, however, to an accommodation train,<br />\nand liked to imagine that in the centuries that arrived in Washington at 7 o'clock.<br />\nEnglish boys have attended this school doubtThe concert was given in the National Rifles'<br />\nless many whose names appear upon the roll of Armory, and although the hall was large and<br />\nhistory had frequently sat in this same place. there.was plenty of room, the audience was, to<br />\nHere perhaps Shelley resorted to escape the com- say the least, small. Tears were seen to trickle<br />\npanionship of his mates; here Byron may have down the faces of many of the men as they<br />\nnursed his griefs: here Arthur Wellesley may thought of their five dollars helping to pay for<br />\nhave read his history, and looking over to where the privilege of playing to empty seats. But the<br />\nthe great white castle shone through the trees, audience(if so large a word is allowable)inspired<br />\nperhaps have dreamed of a splendid career as by the vigorous applause of several Hopkins<br />\nEngland's foremost soldier. It cannot have alumni, succeeded in rallying the spirits of the<br />\nbeen far from this place that Spenser walked<br />\nClubs, and an excellent concert was given.<br />\n\"Alcmg the shoare of silver streaming Themmes;<br />\nThen the Clubs retired to their hotel and after<br />\nWhose rutty bank, the which his river hemmes,<br />\na sumptuous repast (this is fine writing, for<br />\nWas paynted all with variable flowers<br />\nthere was nothing but sandwiches and coffee)<br />\nAnd all the meades adorn'd with dainty gemmes.<br />\n•<br />\n•<br />\nretired to the rapid moving and dangerous<br />\nSweet Themmes run softly, till I end my song.\"<br />\nfolding beds. During the night several men had<br />\nto be rescued from different parts of these beds,<br />\nCA CA<br />\nbut otherwise nothing of importance happened.<br />\nEIIOLD,<br />\nYe Seniors grave and Juniors bold,<br />\nThe next morning before the city was awake<br />\nThis is the time of the essay man,<br />\nthe private car was again side-tracked, and the<br />\nThe awful, terrible essay man,<br />\nmen clambered aboard and continued their disWho hates to give good marks, and flunks all he can.<br />\nturbed nap.<br />\nLIST, ALL.<br />\nThe trip from Washington to Charlestown,<br />\nThe subjects are hung on the study-room wall,<br />\nW.<br />\nVa., was delightful, for the railroad passes<br />\nThere's no time to tarry: the call is to work,<br />\nIn the months that are coming there's danger that<br />\nthrough some of the most beautiful country of<br />\nlurks<br />\nVirginia and the day was superb. At Harper's<br />\nIn the path of the man who his plain duty shirks.<br />\nFerry the Clubs aroused themselves sufficiently<br />\nTHE DEAN.<br />\nto leave the car and be photographed. Then<br />\nAnd his worthy confrere, our esteemed Dr. Green,<br />\nthe train continued its way to Charlestown.<br />\nhave concocted a plan to make every one bow<br />\nHere the men after enjoying a true Virginia<br />\nAt the altar of labor, and you will allow<br />\ndinner prepared to give the afternoon concert.<br />\nThat good marks must he earned by the sweat of the Realizing that an audience was desirable to make<br />\nbrow.<br />\nthe concert entirely successful, the Clubs deter-<br />\n<br />\nB<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nmined to go en masse to a foot-ball game<br />\nbeing played between the Charlestown eleven<br />\nand a team from Summit Point. The men then<br />\nproceeded to show by their vigorous and welldirected rooting how much they loved the<br />\nCharlestown people and admired their team.<br />\nThis manner of advertising had the desired effect<br />\nand the concert hall was well filled.<br />\nFrom Charlestown the Clubs went to Winchester, Va., where they were received by a full<br />\nhouse. Many of.those in the audience were<br />\ninclined to be very sparing in their applause, but<br />\nafter hearing \"Dixie,\" by the Banjo Club, and a<br />\nfew of Swindell's songs, they became much more<br />\nenthusiastic. The reason for this apparent lack<br />\nof interest was because two years ago the Hopkins Clubs had given a very poor concert and<br />\nthe audience feared a repetition. But this year's<br />\nconcert has entirely changed their opinion of the<br />\nClubs and the audience next year will no doubt<br />\nbe much larger and more appreciative. Then<br />\nfollowed a dance with refreshments given by the<br />\nyouth and beauty of Winchester. The next<br />\nmorning or rather the same morning, for the<br />\ndance did not stop till 2 a. in., the men took the<br />\nsix o'clock train for Hagerstown. The concert<br />\nthere was also far better than was ever given<br />\nbefore and yill help to increase the audience the<br />\nnext time the Hopkins Clubs go to Hagerstown.<br />\nImmediately after the concert the hall was<br />\ncleared and the men enjoyed the last dance of the<br />\nChristmas trip. The next morning, December<br />\n29, found the Clubs once more on the train<br />\njourneying toward home.<br />\nThe whole trip was a thorough success, and<br />\nnot a man on the Clubs would have missed it,<br />\nno matter if it had cost twice as much.<br />\nE. C. H.<br />\nTHE Board of Trustees has not yet made any<br />\nselection of a man to succeed Dr. Gilman in the<br />\npresidency of the University. At their regular January meeting on Monday, they reelected Mr. James L. McLane, President; Mr.<br />\nFrancis A. White, Treasurer, and Mr. Lewis N.<br />\nHopkins, Secretary of the board,and transacted<br />\nroutine work. President Gilman's official resignation is to be announced on Commemoration<br />\nDay, February 22d.<br />\n<br />\n111111.—<br />\n<br />\n3<br />\n<br />\nA LA SAN TOY.<br />\n<br />\n44 WE will imitate the styles of the western<br />\nBritish Isles,<br />\nThough the reason isn't easy to devine—ah;<br />\nBut they do it in the West, so ofcourse it must behest,<br />\nAnd I mean to introduce it into China.\"<br />\n0 there was a Hopkins boy, and he went to hear<br />\nSan Toy,<br />\nAnd he got that giddy music in his head—ah.<br />\nEvery time the wheels went 'round, that same chorus<br />\nwould resound,<br />\nTill his comrades almost wished that boy were<br />\ndead—ah.<br />\n<br />\no<br />\n<br />\nhe took the Christmas trip, and each morn he'd<br />\nwake us up.<br />\n\"Though the reason is not easy to del-lite-1th.<br />\nHe would shout it through the hall, and he wouldn't<br />\nstop at all,<br />\nThough the manager imposed a heavy fine—ah,<br />\n\"But they do it in the West, so ofcourse it it must he<br />\nbest,\"<br />\nSo he told us, lint we couldn't see it quite—ah.<br />\nHe might \"imitate the styles of the western British<br />\nIsles,\"<br />\nIf he only wouldn't do it in the night—ah.<br />\nFriday night at Hagerstown (that's the night our<br />\nluck was down)<br />\nWe had done one number on the programme fine—ah.<br />\nFor an encore we fell in—\"Steeny\" muttered to begin,<br />\n\"0 I mean to introduce it into China!<br />\nIf he imitates this style, in a very little while<br />\nHe'll perhaps discover that it is not well—ah;<br />\nHe will meet untimely end,down to Hades he'll descend,<br />\nThen perhaps he'll introduce it into * * * *—ah.<br />\nW. B. C.<br />\n<br />\nMr. Frederick Harrison, the well-known<br />\nEnglish Philosopher and literary man, who<br />\noriginated the movement for the celebration of<br />\none-thousandth anniversary of the death of<br />\nKing Alfred the Great, of which Prof. J. W.<br />\nBright is one of the American Secretaries, has<br />\naccepted the invitation of President Gilman to<br />\nlecture at the University. He will appear before<br />\nthe students early in March, and will probably<br />\ngive from two to four lectures on historical<br />\nsubjects.<br />\nHe will speak before the students of Howard<br />\nUniversity before coming here, and will later<br />\nvisit other educational centers of the country.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\n'Ube 14ewo.1Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nJANUARY 10, 1901.<br />\nzo cents a single copy.<br />\n<br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br />\n<br />\nNORMAN BOYER, 1901.<br />\n<br />\n.<br />\n<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\n.<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n.<br />\n<br />\npossess forensic spell-binders, both tried and<br />\nuntried; the Lacrosse team has still the nucleus<br />\nof last year's champion twelve, and the Track<br />\norganization counts among its available material men able fully to make up the losses of the<br />\npast year. There is every reason why we should<br />\nmake this first year of the new century better<br />\nthan the closing years of the last.<br />\n<br />\nJOHN M. BOOKER, 1901.<br />\n<br />\n( WILLIAM B. HILL, 1902.<br />\nEBEN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br />\nJOHN A. SLEMONS, 1902.<br />\nI 4YMAN C. MURPHY, 1902.<br />\nJOHN M. BANDEL, 1901.<br />\n.<br />\n. AUBREY PEARRE,JR., 1902<br />\n<br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns liopkins Hospital.<br />\n-<br />\n<br />\nthe beginning of the new term everyWITH<br />\nthing starts up with the renewed vigor<br />\nborn of the holidays of the previous weeks. The<br />\nundergraduate mind disburdens itself of about<br />\nthree-fourths of the knowledge hastily acquired<br />\nduring the two or three days prior to the examinations, and begins once more to occupy itself<br />\nwith the more pressing interests of the lounging<br />\nroom, the slot machine and Walter's tonsorial<br />\nclinics in the basement.<br />\nMeanwhile a considerable element twangs the<br />\nmelodious guitar every afternoon in McCoy<br />\nHall,and craves the indulgentfavor of the whole<br />\nUniversity on Friday night. Lately returned<br />\nfrom the joys of Western Virginia and the plaudits of the fair, they feel the inspiration of success. A less considerable number, perhaps, has<br />\nbegun to cast its mental vision along the southern lands where oceans lie close together, and<br />\nnot long hence will advise a waiting nation<br />\nwhether or not to make the waters one.<br />\nUpon another field the captains urge their men<br />\nto struggle for the flying ball, and strain to<br />\nreach the distant goal beyond theirfellows. All<br />\nthis is good, and should be as it is.<br />\nThe prospect is as good as it ever was for success in every branch of University endeavor.<br />\nHigh scholarship will, of course, maintain itself<br />\nwithout the necessity of any comment. The<br />\nMusical Clubs have been tried and have not<br />\nbeen found wanting; the Senate and the House<br />\n<br />\nThis is the season, too, for the annual public<br />\nlectures, which will be given in McCoy Hall from<br />\ntime to time during the next two months or<br />\nmore. This is one of the features of the University year which is of greatest interest to educated people of the city, and should be to the<br />\nstudents here. But strangely this is not the<br />\ncase. Lecturers from famous centres of learning<br />\nin this and foreign lands pass through our midst,<br />\npause for a while and give us of their best<br />\nthoughts, and lo, the mind of the averages<br />\nstudent knoweth not that it was so.<br />\nThe men miss a great deal often by their<br />\nneglect of these opportunities. This neglect is<br />\noften without any valid excuse. A few,perhaps,<br />\ncannot leave duties at or awayfrom the University; but there are some men who would prefer<br />\nto sit in the barber shop with nothing to do but<br />\nsmoke a pipe and watch the victim in the chair<br />\nthan listen for a few minutes to a lecture<br />\nupstairs, which many are perhaps paying a<br />\ngood price to hear. Every man should have<br />\nsome acquaintance with at least the names of<br />\nthe distinguished scholars of the country, and<br />\nwhen one of them comes to our own University,<br />\nwe should go into the hall, if for no other purpose than to see what he looks like. It is something of profitfrom a college education to be able<br />\nto point out an eminent scholar on the street.<br />\nThe NEWS-LETTER has harped upon this old<br />\nstring before, but there may he some who have<br />\nnot heard it, or having heard, have not remembered, or having remembered, have not heeded,<br />\nor having heeded, have not profited thereby.<br />\nTo all these we say:<br />\n\"Do not delay;<br />\nDo not delay; the golden moments fly.\"<br />\n<br />\nsnow<br />\nDR. Bernard C. Steiner has recovered from his<br />\nlate hospital experience and has resumed charge<br />\nof his class in American Politics.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nHOPKINS DRAMATIC SOCIETY.<br />\n<br />\n5<br />\n<br />\ninterest toward the higher purposes of a univer<br />\nsity, and in this manner are of great value. The<br />\nANY kinds of clubs have been formed at public come to a debate, find it interesting and<br />\nHopkins—in fact we have every sort of enjoyable, look for something else to happen in<br />\norganization common to colleges except one that McCoy Hall, and discover a lecture list or an<br />\nfor some reason or other has never made its ap- announcement of a scientific meeting; some think<br />\npearance here. Thatis a dramatic society, whose they will try the experiment further, and thus<br />\naims shall be to develop the histrionic ability we have interest. On the assumption of a sucof its members, and, if possible, produce a play. cessful dramatic production, interest in other<br />\nWe do not know why the organization of such affairs should increase, for a play by collegians<br />\na society has never been attempted; now is the is bound to draw a crowd.<br />\ntime to start to investigate the matter, and disThe question of a dramatic society has been<br />\ncover any desire on the part of the students to<br />\norganize. There are difficulties in the way, but freely discussed by several students,and the only<br />\nthe difficulties are ones which, with a little sound objection urged against the formation is<br />\nenthusiasm and work, ought easily to be over- lack of students to engage in all the interests of<br />\nthe University. The claim that with such a<br />\ncome.<br />\nsmall<br />\nnumber of students the individual must<br />\nThere are numerous benefits to be derived from<br />\nengage<br />\nin several interests, any one of which<br />\nsuch a society both by the students individually<br />\nwould<br />\nrequire<br />\nall his spare time is strong, but<br />\nwhole.<br />\nIn<br />\nthe<br />\nfirst<br />\nand by the University as a<br />\nconclusive,<br />\nfor the time required of each pernot<br />\nplace, it will develop any latent talent to act<br />\nsociety is only minimum. It<br />\nfor<br />\na<br />\ndramatic<br />\nson<br />\nthat may exist among the students,and thereby<br />\nnumber of men seen around<br />\nalso<br />\nseems<br />\nfrom<br />\nthe<br />\nthe<br />\npower<br />\nwhich<br />\nwill<br />\nbring to<br />\nsurface a<br />\nalways<br />\ndoing<br />\nabsolutely no more work<br />\nthe<br />\nbuildings<br />\nbe of some service to a man in his course through<br />\nstudy<br />\nto \"pull through\"<br />\nnecessary<br />\nthe<br />\nthan<br />\nbring<br />\nthe fellows tolife. It will necessarily<br />\nathletics<br />\nor men without<br />\ntoo<br />\nstrong<br />\nfor<br />\n—men<br />\nrehearsals<br />\nand<br />\nmeetings,and be a close<br />\ngether in<br />\nlacksomething<br />\nthere<br />\nis<br />\nstill<br />\nears—that<br />\nmusical<br />\nbond of union between them,just as the athletic<br />\nwhat<br />\ndramatic<br />\nsociety<br />\nis<br />\nthese<br />\nPerhaps<br />\na<br />\ning.<br />\nclubs<br />\nunite<br />\nteams and the musical<br />\ntheir members<br />\nin alliance of good fellowship. Every one at men need to employ their spare time! Even<br />\ncollege tries to get as close a view of his neighbor among those who are interested otherwise there<br />\nas possible; and, therefore, a dramatic society, should be some men with time to devote to such<br />\nwith its many chances of fraternity, should be a society. What is necessary for the experiment<br />\nis enthusiasm on the part of some, and assisthailed with delight.<br />\nS., '02.<br />\nby others.<br />\nance<br />\nreason<br />\nfor<br />\na<br />\nthe<br />\ngreatest<br />\ndramatic<br />\nclub<br />\nBy far<br />\nAk6<br />\na<br />\nplay,<br />\nthe<br />\nproduction<br />\nof<br />\nlies in the fact that, by<br />\nDr. Guy Canton Lee began his series of lec<br />\nthe University is brought before the public, or<br />\nintroducing English History on Friday<br />\ntures,<br />\nbrought<br />\nto<br />\nthe<br />\nUniversity.<br />\nrather the public is<br />\nJanuary 4th.<br />\nthe<br />\ninter-class<br />\nThe crowded hall on the night of<br />\nThe first lecture \"Source Method in Teaching<br />\ndebate testifies that what interests the public<br />\nHistory,\" was well attended.<br />\nmost in a university is an exhibition of student<br />\nSubjects for remaining lectures are:<br />\npowers. Every one must confess to the great<br />\n\"The Earliest Inhabitants of Britain,\" Janulack of municipal interest in the doings of our ary 11th.<br />\nUniversity—caused doubtless by our situation<br />\n\"The Anglo-Saxon Invasion,\" January 18th.<br />\nin a large city more than by anything else, but<br />\n\"Social Life Before the Norman Conquest,\"<br />\nnevertheless existent—and most of us have a January 25th.<br />\ndesire tO be better known by the general public.<br />\n\"Laws and Customs of the Anglo-Saxons,',<br />\nWe do not expect, nor does the public consider February 1st.<br />\n\"The English People,\" February 8th.<br />\ndebates and plays to be genuine specimens of<br />\n\"England Under the Normans,\" February 15th<br />\nhowever,<br />\nstart<br />\ndo,<br />\ntrue college work; they<br />\n<br />\nM<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\nA LITTLE TALK WITH MARS.<br />\n<br />\nRE-ECHOINGS OF THE MUSICAL<br />\nCLUBS TRIP.<br />\n<br />\nthe dawn of the twentieth century, the BR-R-R-R-R-ING!!<br />\nUPON<br />\nscientific world is shaken to its veryfoundaIt was Friday afternoon, and the noise<br />\ntions by the report ofProf. Nikola Tesla relative<br />\nto his work along astronomical lines. From his<br />\nobservatory perched upon the top of the mountains of Colorado, comes the startling information that the learned professor has put himself<br />\nin communication with the planet Mars! The<br />\nnineteenth century has witnessed the birth of<br />\nmany inventions and discoveries, but lo! the<br />\ncoming era is to surpass them all.<br />\nHow our ideas will broaden by -coming into<br />\ncontact with the minds of the men of Mars, provided they are a people of advanced civilization,<br />\nbut if, on the other hand, they are benighted<br />\nheathens, it will be our plain duty to benevolently assimilate them, and introduce them to<br />\nthe two great blessings of our advanced civilization—fire water and gunpowder.<br />\nApropos of the present situation, a question<br />\ncomes up that we find difficult to answer. We<br />\nobserve that when an astronomer gives out<br />\ndefinite information regarding the neighboring<br />\nplanets, Mars is always the one chosen. When<br />\nan author has exhausted every other topic he<br />\ncan think of (to say nothing of his readers) he<br />\nmixes up a bit of whisky and absinthe, and the<br />\nresult is a story about Mars. This is manifestly<br />\nunjust, for we believe that some of the other<br />\nplanets should come in for a share of this attention. For instance, Venus, whom we imagine,<br />\nwould be equally as interesting (if not more so)<br />\nthan the fiery god of war.<br />\nBut we anticipate; let us wait a kw weeks<br />\nlonger and perhaps the next communication<br />\nfrom Tesla will tell us that his invention has<br />\neliminated space and that we may proceed to<br />\nbecome acquainted with the inhabitants of the<br />\nsurrounding planets.<br />\nAt times we shall be awakened from our contemplations by the merry tinkle of the planetophone bell, and then—\"John, dear, come to the<br />\n'phone. Someone in Mars has rung you up.\"<br />\nAfter all, the universe is a small place.<br />\n<br />\n.46 .46 .46<br />\nDR. Henry S. West, who was recently elected<br />\nprincipal of the Western High School, has assumed his duties and announces several contemplated reforms.<br />\n<br />\nwas being made by the elevator bell in the Hamilton House, at Hagerstown. The dusky son<br />\nof Africa who ran the thing failed to appear,<br />\nand we grew impatient. But we had Manager<br />\nBird with us, and Manager Bird is a very versatile young man. The natural grace with which<br />\nhe glides through the dreamy waltz is only excelled by the good-natured sangfroid with which<br />\nhe peddles ginger ale at ten cents per bottle. So<br />\nwhy shouldn't he run an elevator? Why, indeed?<br />\nHe seized a rope and gave a mighty pull. No<br />\nresult. Then he gave a great haul in the other<br />\ndirection. If the thing wouldn't go up,it would<br />\nhave to go down, but go it must. It went!! —<br />\n* * —! If there hadn't been a cellar to that<br />\nhotel, we would be going yet. Bird lost his<br />\nJo!).<br />\nslf sli<br />\nZzzzzzzz! It was really scandalous. He<br />\nneeded a shave so badly,that when he played his<br />\nmandolin, it sounded like an aeolian harp, and<br />\nhis singing had the wheezy quality of a jewsharp. Things had reached a point where desperate measures were necessary. So,as we strolled<br />\nalong Charlestown's quiet streets, we informed<br />\nhim that he must go with us to a barber, dead<br />\nor alive, and get a shave. He bolted, and<br />\nstarted to run for the hotel, with the same natural instinct that prompted his eloquent namesake to run twice for the presidency—and with<br />\nthe same success.<br />\nAfter we had carried him half a square in the<br />\ngraceful and easy position of the summer girl's<br />\nhammock,he agreed to go peaceably,if we would<br />\nput him on his feet. The barber's pleasant greeting faded into a sad sweet smile when he saw<br />\nhis customer, but he set bravely to work. He<br />\nhas laid aside the razor to hone up on the first<br />\nrainy (lay.<br />\nor or or<br />\nOf course, we all felt rather sore at Bird when,<br />\nafter scarcely two hours' sleep, we must needs<br />\nrise at five o'clock in the morning, and eat one<br />\nof his breakfasts(patent applied for)in our cold,<br />\n<br />\n\fTHE NEWS-LETTER<br />\ndirty car. But still we thought that it was<br />\nhardly in accord with the respect due to a senior,<br />\nwhen a Freshman referred to him vindictively as<br />\na \"Little Early Riser.\"<br />\n.1115<br />\n<br />\nThere was a drawn, desperate look about the<br />\ncorner of Walter's mouth, as he stood on the<br />\nrear platform gazing gloomily at the track,rushing away from him a mile a minute. It was the<br />\nsame old familiar story. He had left home with<br />\ntwenty-five dollars in his pocket. Some one had<br />\nproposed a \"quiet little game\" of poker, and he<br />\nhad joined them. The rest can easily be guessed.<br />\nAt first the stakes were low,but-in this game<br />\nthey remained low, and after a half day of<br />\nintensely exciting play, Walter found himself<br />\nloser-thirteen cents!<br />\nW. B. C.<br />\n_44.A6 .44<br />\n<br />\nBALTIMORE CONCERT.<br />\nmost important Concert of the Johns<br />\nTHE<br />\nHopkins Musical Clubs will be given in Lehmann's Hall Friday, January 11th, at 8 o'clock.<br />\nFrom present indications and from the success<br />\nof the Christmas trip, this will no doubt be one<br />\nof the best concerts ever given during the history<br />\nof the clubs. The Glee Club pieces have been selected with the greatest care, and the \"1901<br />\nmedley,\" contains some of the most catchy<br />\nmusic of the year. The Banjo and Mandolin<br />\nClubs have also been most fortunate in choosing<br />\ntheir pieces, and will most assuredly please all<br />\nlovers of good, snappy music. Then Mr. Swindell has added several new pieces to his repetoure, so that the audience will no longer have<br />\nto applaud in vain for more of his funny songs.<br />\nIn fact everything points to a most successful<br />\nand jolly concert, and everyone who is so unfortunate as to miss it will lose more than is<br />\nusually lost by absence from college concerts,for<br />\nthe Johns Hopkins can now boast that their<br />\nmusical clubs take the same standing among the<br />\nclubs of other colleges that the Johns Hopkins<br />\nUniversity does among the leading Universities<br />\nof the country.<br />\nThe men on the clubs this year are:President, John Hendricken King, '99; Manager, Andrew Reid Bird,'01; Assistant Managers,<br />\n<br />\n7<br />\n<br />\nStevens Thompson Mason, '02; Eben Charles<br />\nHill, '02.<br />\nGLEE CLUB.<br />\nLeader, J. A. English Eyster, G.<br />\nFiinsT TENORS:-j. A. E. Eyster, G.-W. B.<br />\nCarver, G.-H. H. Humrichouse, '02. Alan<br />\nHaughton,'OS.<br />\n<br />\nSECOND TENORS:-Roger Vaun, M. S. A. Marshall, M. Wm. B. Cornell, M. M. N. Smull, G.<br />\nE. C. Hill, '02, J. M. Nelson,'03.<br />\nFIRST BASSOS:-.1. H. King, G. J. H. Eager, G.<br />\nPaton Rouse, M. W. B. Swindell, '01. W. B.<br />\nSneeringer,'02. J. W. Bryan,'03.<br />\nSF:cox!) BAssos:-F. L. Critchlow, G. V. E.<br />\nSmith, G. S. T. Mason,'02. J. G. Campbell,'02.<br />\nR. T. Pagan,'03. J. R. B. Branch,'03.<br />\nBANJO CLUB.<br />\nLeader, Edgeworth Smith, G.<br />\nBANJEAURINES:-V. E. Smith, G. J. S. Briscoe,<br />\n'01. L. G. Fishack, '01. J. G. Machen, '01. F.<br />\nR. Dapprich,'01. S. T. Mason,'02. C. Marshall,<br />\n'03, R. S. Lanier,'03, W. J. Snowden,'03.<br />\nBANJOS:-M. W. Hendry,'03. W.U. Murkland,<br />\n'03. W. W. Simmons, G. J. W. Bryan,'03.<br />\nGUITARS:-H. A. Converse. G. J. A. E. Eyster,<br />\nG., L. C. Murphy,'02. E. C. Hill,'02. F. Hazleburst,'03.<br />\nBASS BANJO:-R. J. Pagon,'03.<br />\nTRAPS:-S. T. Mason,'02.<br />\nMANDOLIN CLUB.<br />\nLeader, Eben Charles Hill, '02.<br />\nMANDoLms:-H.W.Cook, M. W.B. Moulton,<br />\nM. F. R. Dapprich,'01. A. R. Bird, '01. B. C.<br />\nHill, '02. J. W.Nelson,'03. R.J. Pagon,'03. W.<br />\nSnowden,'03. J. W. Bryan,'03.<br />\nGUITARS:-V. E. Smith, G. H. A. Converse, G.<br />\nJ. A. E. Eyster, G. F. Hazlehurst,'03 L. C.<br />\nMurphy,'03.<br />\nVIOLINS:-W. B. Swindell,'01, II. C. Miller,'03.<br />\nVIOLA:-R. S. Lanier,'03.<br />\nCELLO:-Byard Turnbull,'00.<br />\nMANDOLA :-V. E. Smith, G.<br />\nCLARINETTE:-H. Dudley, M.<br />\n<br />\nTRAPS:-S.J. Mason,'02, J. IL King,'99.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n8<br />\nATHLETICS.<br />\n<br />\nOWING to the Christmas holidays, work in all<br />\nbranches of athletics during the past two<br />\nweeks came almost to a standstill, but since the<br />\nreturn of the men to their studies, both the<br />\nLacrosse men and the Track and Field squad<br />\nare working with renewed vigor.<br />\nThe outlook for both teams grows more hopeful day by day. Notwithstanding the losses,<br />\nalready spoken of in the NEWS-LETTER, caused<br />\nby graduation, the prospects for winning teams<br />\nagain this year are very bright.<br />\nAmong the candidates for the lacrosse team,<br />\nseveral of the men are showing up remarkably<br />\nwell under the able coaching of Maddren and<br />\nAbercrombie, who are doing their best to get the<br />\nmen in shape for outdoor practice which begins<br />\nas soon as spring opens up.<br />\nThe Track and Field squad numbers about<br />\nthirty men, who are being put through a regular<br />\ncourse of preliminary training by Physical<br />\nDirector Mackdermott, assisted by Capt. Hoffman and Manager Wroth. As yet no \"wonders\"<br />\nhave been developed, but it is safe to say that<br />\nere long \"Father Bill\" will make several<br />\nvaluable finds among the many new candidates<br />\nwho will take prizes for \"Old Tom Hopkins\"<br />\nin the Spring games.<br />\nDirector Mackdermott informs us that he will<br />\nhave teams ready to enter the coming Baltimore<br />\nAthletic Club and the St. Leo's Gymnasium<br />\ngames, to be held soon,and is confident that the<br />\nglorions showing at the Fifth Regiment armory<br />\nwill he duplicated. Mr. Mackdermott also says<br />\nthat he is arranging for an indoor meet to be<br />\ngiven this spring under the auspices of the Johns<br />\nHopkins Athletic Association.<br />\nannual convention of the Inter-University<br />\nTHE<br />\nLacrosse League was held at the Hotel St.<br />\nCloud, in New York, on January the 2nd. Hopkist was invited to send delegates, and Messrs.<br />\nR.lie Abercrombie and Wm. H. Maddren were<br />\nappointed. But owing to other engagements<br />\nneither of the new men were able to attend the<br />\nconvention. However, a letter was written by<br />\nour delegates advising certain changes in the<br />\nexisting rules of the Association. After some<br />\n<br />\nconsideration these changes were adopted and<br />\nwill be used by the Inter-University League during the coming season.<br />\nWhen questioned in regard to what the Black<br />\nand Blue would do when the Lacrosse season<br />\nopened: Mr. Abercrombie stated that although<br />\nthe policy had not been fully determined upon<br />\nyet, he thought thatthe Hopkins team would be<br />\na sort of \"free lance\" this year, watching the<br />\ndevelopments of the other teams and playing<br />\nany good team, irrespective of the League to<br />\nwhich it belongs. This means, then, that Hopkins will not belong to any Association this<br />\nspring, although several tempting offers for the<br />\nformation of a new League have been made to<br />\nour management.<br />\nA meeting of the General Athletic Association<br />\nof the University will be held this week, at which<br />\nthe policy of the present Lacrosse management<br />\nwill be determined.<br />\n<br />\nIA JO ,110<br />\nINDOOR MEET AT PHILADELPHIA.<br />\nMcDermott has recently received<br />\nMaANAGER<br />\nletter from Mr. Crowherst, secretary of<br />\nthe intercollegiate and interscholastic indoor<br />\nathletic meet which will be held in the Academy<br />\nof Music at Philadelphia, Saturday evening,<br />\nMarch 2d. Mr. McDermott says he will enter<br />\nthe members of our team in all of the events for<br />\nwhich they are eligible, if possible.<br />\nWe know no reason why our track team<br />\nshould not take part in this meet and bring<br />\nback some prizes for our trophy room. All candidates who are ambitious for the success of the<br />\nteam, should now put their best foot foremost<br />\nin order that we may enter some winners. Our<br />\nlater successes or failures will depend upon the<br />\namount of earnest work now shown from day<br />\nto day. Let every man come out and do his<br />\nbest.<br />\nFurther announcement of this meet will be<br />\nmade later.<br />\nW or se\"<br />\n<br />\nDr. Warren, of Adelbert College, will deliver a<br />\ncourse of six public lectures upon French authors:<br />\n1, J. J. Roussem ; 2, Chateaubrand, Mme. de<br />\nStael ; 3, Nod ier Lamartine; 4, Victor Hugo; 5,<br />\nDebigmy, De Musset ; 6, George Land, Alex.<br />\nDuma's Pere.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nMr. Editor:,<br />\nN the general satisfaction over the result of the<br />\nsubject which the members of our athletic<br />\nfoot-ball season it may seem out of place to call<br />\nboard seem to have lost sight of is the attention to one feature of our work this year,<br />\nannual \"feed,\" which should be forthcomirg in that was not in keeping with the rest of Hopview of our late successful foot ball season. We kins doings; but on the principle that the Lord<br />\nhad one last year,and a very good time together chasteneth whom he loveth,a word or two may<br />\nwith some good 4hings to eat, which were en- serve to correct this little flaw in an otherwise<br />\njoyed by those who were present. President magnificent record. The point to which I refer<br />\nGilman delivered a short address apropos of was the listlessness and indifference manifested<br />\nlast year's championship, which fact reminds us by some of our rooters in the St. John's game,<br />\nthat he will not be with us much longer, and we and, to a less extent in the the Thanksgiving<br />\nshould not miss this chance—provided he will Day contest. At Annapolis, with the score<br />\nspeak—of hearing a final address on our athlet- against us, and the ball deep in Hopkins<br />\nics. This love-feast undoubtedly serves to im- territory—just the moment when the rooting<br />\npress upon the student-body the progress we should have been strongest and most bracing—<br />\nare making in athletics. And awakens a livelier Chief Rooter Swindell had the greatest difficulty<br />\ninterest in the successes of our teams than would in getting a dozen or so of the crowd to open<br />\notherwise be done, and with proper manage- their mouths at all, having to resort in some<br />\nment a very pleasant evening can be had. Let cases to a personal appeal.<br />\nthe athletic board think over this matter and<br />\nI would not have it understood that this is a<br />\nand form some definite plan of procedure, with criticism of the general body of rooters, who<br />\nan eye to another \"Fitzgibbons and Sharkey\" were, indeed, vigorous and united in their efforts.<br />\naffair.<br />\nThere were, however, some men who apparently<br />\n9/<br />\n9 961. W<br />\ndeemed it too undignified and \"decidedly rude\"<br />\nARCHAEOLOGICAL LECTURES.<br />\nto show,their enthusiasm for their Alma Mater<br />\nmanner as yelling, who sat<br />\nArrangements have been made for the delivery in so boyish a<br />\nexpressions<br />\nof preternatural wisaround<br />\nwith<br />\nof the following lectures on archfeological subreserve,<br />\nalways<br />\nready<br />\nto tender valuadom<br />\nand<br />\nects during the current winter.<br />\nto<br />\nhow<br />\nrooting<br />\nshould<br />\nbe done,<br />\nble<br />\nadvice<br />\nas<br />\nThey will be given in McCoy Hall.<br />\nProf. Louis DYER, Lecturer in Balliol College, but really too bored to take part themselves.<br />\nOxford. The Cretan Alpabet, Tuesday, January This is not written in the spirit ofhard reproof,or<br />\n8th, 5 p. in. Mycencean Gems,Wednesday, Jan- on the assumption that I have any right to administer a \"call down\" at all; but it certainly seems<br />\nuary 9th, 5 p. m.<br />\nIn this lecture attention will be called to the only reasonable, that a man who is sufficiently<br />\nremarkable collection of ancient gems and other interested to go to a game, should contribute<br />\nantiquities from Cyprus, presented to the Johns whatever aid he may by joining heartily in the<br />\nHopkins University by Mr. Theodore Marburg. rooting.<br />\nThe rooting means much to the success or<br />\nOld Knossos and the Labyrinth of Minos.<br />\nThursday, January 10, 5 p. m. Mr. Howard failure of a team, and the success of the rooting<br />\nCrosby Butler, Lecturer on Architecture,Prince- depends on each man's earnest efforts. We have<br />\nton University. The Deserted Cities of Syria. a splendid leader, but the leader cannot do it all;<br />\nFriday,January 18, 5 p. m. Professor Samuel he must be supported. And I should think that<br />\nB. Platner, Professor of Latin, Western Reserve the fellows would take pride in yelling their<br />\nUniversity. Recent Excavations in the Roman loudest. Even a freshman may exercise hislungs<br />\npermanent detriment<br />\nForum, Friday, February 1, 5 p. m. Professor in a good cause, without<br />\nto the massive repose of his dignity. Let everyMartin L.D'Ooge,Professor of Greek, University one who goes to the Track and Lacrosse games<br />\nof Michigan. Delphi and the French Excava- be useful, as well as ornamental.<br />\nH. R. V.<br />\ntions. Friday, March 8, 5 p. m.<br />\n<br />\nOUR ANNUAL FOOT BALL FEED.<br />\n<br />\nA<br />\n<br />\nI<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nBEGGING VERSES.<br />\nI beg you grant to me<br />\nO FATE,<br />\nThat I may look life in the eyes,<br />\nNor drop my own, nor show surprise<br />\nAt anything it holds for me.<br />\nA faith in man which men can't break,—<br />\nA double faith in woman-kind—<br />\nThe easy trust thou ga.v'st the blind—<br />\nFor here my faith must never shake.<br />\nGive me a hope which soars so high<br />\nThat it mily lead my wand'ring soul<br />\nToward the ever-distant goal;—<br />\nMy earthly body need not fly.<br />\nA charity, so long that I<br />\nIt 'round my little world may wrap<br />\nA thousand times, with over-lap<br />\nEnough to knot and fasten by.<br />\nAnd gentleness, and sympathy;<br />\nA readiness of heart and hand<br />\nWhich makes me brother to my land—<br />\nWhich makes my land a home to me.<br />\nA courage such that it will suit<br />\nTo tide me o'er my life; and when<br />\nI'm called by Captain Death, why then,<br />\nWill hold me—standing—at salute.<br />\n* • * •<br />\n•<br />\nOne asking more, for now I see<br />\nI've asked for naught but what is nice.<br />\nPray, hold, throw in a dash of vice,<br />\nLest I'd become a Pharisee.<br />\nW.W W<br />\n<br />\nFROM GERMAN MINOR.<br />\nit's joyful when the dentist<br />\nOil,Sets<br />\nyou free from trembling fear,<br />\nWith his \"Well, I find there's nothing,<br />\nI can do for you this year.<br />\nIt's joyful when you find that little<br />\nBill you simply cannot pay,<br />\nWill be settled by dear Papa,<br />\nWith his \"Oh, boys will be boys, they say.\"<br />\nAnd it's joyful when the paper,<br />\nThat you know was so d— bad,<br />\nThrough sonic error gets the 1<br />\nAnother fellow should have had.<br />\nBut than all these things more gladsome<br />\nTis' to hear B.J. V. say:<br />\n\"Dr. Wood, then, bier ist, noch nicht,<br />\nThere will be no class to-day!\"<br />\nR. S. I,.<br />\n<br />\nVALUABLE COLLECTION OF<br />\nANTIQUES.<br />\n<br />\nHE Johns Hopkins University is much indebted to Mr. Theodore Marburg, of this<br />\ncity, for a rare collection of antiquities which he<br />\nrecently presented.<br />\nThe collection numbers about ninety pieces,<br />\ncollected by Col. Warren during his thirteen<br />\nyears' residence on the Island of Cyprus, and<br />\nhas been greatly admired bv savants, who<br />\nhave endeavored to purchase some of the gems<br />\nfor Cambridge University and the Berlin<br />\nMuseum.<br />\nThe collection comprises gold ornaments,rings<br />\nand bracelets of Greek, Syrian, Etruscan and<br />\nPhoenician workmanship. Hittile, Egyptian<br />\nand Grecian Scarabs and cylinders adorned with<br />\ncurious carvings and inscriptions also Greek<br />\nCAmeos and Intaglios.<br />\nThe most beautiful of all the collection is an<br />\nintaglio head of Alexander the Great, cut in<br />\nred sard, and supposed to be a likeness from life,<br />\nby the Greek intaglio cutter Pergotoles.<br />\nThe workmanship is superb, Alexander being<br />\nrepresented as an ideal Greek study in art.<br />\nProf. Richter was especially anxious to secure<br />\nthis gem, but finding this impossible, obtained<br />\nan impression from it in wax.<br />\nOf special interest to students of archtelogy,<br />\nare the ancient Egyption and Hittite cylinders<br />\nand scarabs, especially two of the latter, one of<br />\nblack hemmatite and the other of white quartz,<br />\ninscribed with early Cypriot charactes.<br />\nThey are believed to be entirely unige as nothing<br />\nlike them is known in any of the European museums.<br />\nProf. Joyce of Cambridge remarked there especial value to investigators. Judging from their<br />\ngeneral appearance and inscriptions, he said,<br />\n\"they could hardly be of a later date than 1200<br />\nB. C., which was about the time blind Homer<br />\nwas singing the songs which were to make his<br />\nname immortal.\"<br />\nIt is impossible to place a monetary value on<br />\nMr. Marburg's gift, but aside from this we value<br />\nit because it bespeaks an interest in our university, and demonstrates that there are some Baltimoreans who evidently have the welfare of old<br />\nHopkins at heart.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nEXCHANGE PLACE.<br />\n<br />\nfollowing are three All-American FootTHE<br />\nBall Teams selected by:<br />\n<br />\nMUTE POETS.<br />\n<br />\nCoach, Dibble.<br />\nCoach, Woodrum Captain, Pell.<br />\nHarvard.<br />\nPCIlnsy.<br />\nPrincton.<br />\nR. E. IIallowell, H. Hallowell, H.<br />\nH.<br />\nI,. E. Campbell, H. Coy well, Y.<br />\nSmith, W.Pt.<br />\nR. 1'. Lawrence, H. Wallace, Pa.<br />\nWallace, Pa.<br />\nL. T. Skillman, Y. Bloomer, Y.<br />\nSkillman, Y.<br />\nR. G. Sheldon, Y. Sheldon, Y.<br />\nHare,<br />\nPa.<br />\nL. G. Brown,<br />\nY. Brown,<br />\nY.<br />\nBrown,<br />\nY.<br />\nOlcott,<br />\nC.<br />\nY. Bachman, I,.<br />\nOlcott,<br />\nV.<br />\nQ.<br />\nDaly,<br />\nH. Daly,<br />\nH.<br />\nDaly,<br />\nR. H. Hare,<br />\nPa. Hare,<br />\nPa.<br />\nReiter,<br />\nP.<br />\nL. H. Fincke,<br />\nY. Weeks, Col.<br />\nY.<br />\nHale,<br />\nF.<br />\nHale,<br />\nY. McCracken, Pa. Starbuck. C.<br />\nFrom The Inlander,<br />\n<br />\nnot, oh wise men of this later day, •<br />\nDREAM<br />\nBecause a man be slow and plain of speech<br />\nThat poetry, and all the arts ye teach,<br />\nAnd all the golden thoughts that ebb and sway,<br />\nAnd sing and laugh and sob and melt away<br />\nWithin your minds, be far beymad his reach.<br />\nAll fruits have not the luster of the peach,<br />\nYet some there grow more honeyed far than they.<br />\nTo some men God gives thoughts, but does not add<br />\nThe rhythmic word to body li)rth mind;<br />\nBut, think not that they never have nor had<br />\nThe sense that hears a music in the wind.<br />\nThoughts rise and die away in human wit—<br />\nYour grandest lines are some ye never writ.<br />\nW. F. BARRON,'04.<br />\n(;eorgeto IV11 College Journal.<br />\nOar<br />\n<br />\n141r 9r or<br />\n<br />\nChess Tournament which was begun last<br />\nTHE<br />\nfall has now been decided. The championship has been awarded to Mr.Edgeworth Smith,<br />\nGrad. The standing of the members at the close<br />\nof the tournament was as follows:<br />\n<br />\nThis is the second time Mr. Barron has broken<br />\ninto our exchange column with verse, and<br />\nWon,<br />\nLost.<br />\nPer Cent.<br />\nachieved an honor Which is reserved for very few.<br />\nEdgeworth Smith,<br />\n10<br />\n2<br />\n.833<br />\nHis first coming was a poem in our Christmas Chas. Markel!, Jr.<br />\n8/<br />\n1<br />\n2<br />\n31/2<br />\n.708<br />\n7/<br />\n1<br />\n2<br />\n.625<br />\n4/<br />\n1<br />\n2<br />\nissue: \"To the Men who Bold the Line,\" in our Lloyd 1-1. Shippen,<br />\nRalph C. Sharrets,<br />\n4<br />\n5<br />\n.444<br />\nopinion, the best foot-ball verse of this season, Louis S. Hutzler,<br />\n4<br />\n8<br />\n.333<br />\n3<br />\n6<br />\n.333<br />\nthough we have perused over twenty efforts. J. Gresham NI achen,<br />\nFrederick K. Dapprich,<br />\n2<br />\n9<br />\n.180<br />\nWe congratulate the Journa/upon the possession<br />\nThe Chess Club has decided to inaugurate a<br />\nof such a promising young writer.<br />\ncontinuous tournament, entirely different from<br />\nthe tournament just decided, to be conducted in<br />\nthe following manner. The standing at the outNOVEMBER.<br />\nset of the new tournament will be the standing<br />\nat the close of the old, as given above; any new<br />\nQuiet, at peace, in silent strength she stands,<br />\nThe dull wind blowing on her rugged face,<br />\nmembers entering the tournament will begin at<br />\nRoughing her heavy hair; with somber grace<br />\nthe end of the list. During the first week of the<br />\nTall, leafless branches sway in her strong hands;<br />\ntournament each ofthe players who stand second,<br />\nThe rude burrs catch her dress, and thorny vines<br />\nfourth, sixth, etc., will have the privilege of<br />\nTouched with the last deep color of the year<br />\nchallenging the player immediately above him;<br />\nCling to its hem, faded and frayed and seared,<br />\nFringing the coarse, dusk folds with fragile spines.<br />\nif the challenger wins he changes places on the<br />\nA look far-seeing fills her wide, deep eyes,<br />\nlist with the player he has defeated. During the<br />\nAnd the still light of long gray afternoon.<br />\nsecond week the players in the odd places will<br />\nBravely she waits the future, asks no boon,<br />\nchallenge in a similar manner;and so on throughHers the years precious past, its golden memories.<br />\nout the remainder of the college year. The<br />\nLETITIA JEAN SMITH.<br />\nVassar Miscellany.<br />\ntournament will be discontinued for two weeks<br />\nor var w<br />\nbefore the Easter examinations, and will close<br />\nThe seven richest colleges of America with en- about the middle of May. Any new players<br />\ndownments are: Girad, $15,250,000; Leland who desire to enter this contest, are requested<br />\nStanford, Jr., $13,500,000; Harvard, $10,000, to send their names to Chas. Markel!, Jr., secre000; Columbia,$9,500,000; Cornell,$8,000,000; tary of the Chess Club, who will also give any<br />\nChicago, $6,500,000; Yale, $4,200,000,<br />\nAdditional information which may be necessary.<br />\n<br />\n\fMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE<br />\nCHICAGO BOARD OF TRADE,<br />\n<br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br />\n<br />\nCALI, I)\\<br />\n<br />\nJAS. H. DOWNS,<br />\n229 N. eHARLES ST.<br />\n<br />\nBANKERS AND<br />\n<br />\nFOR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nSMOKE UP!<br />\n<br />\nRAH! RAH! RAH! HOPKINS!!<br />\n<br />\nMINIMMIIIIIIIMM111111=1<br />\nGO TO<br />\n<br />\n& Co,<br />\nBROKERS,<br />\n<br />\n217 EAST GERMAN STREET,<br />\n<br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nIF ITS<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\nThe Chas, Willms Surgical Instrument Co,<br />\n•ENJ• A. NELSON, GI WI_<br />\n<br />\nI. D. LANG, TOBACCONIST,<br />\nBOX TRADE A SPECIALTY<br />\n<br />\nAND PERIODICALS.<br />\n<br />\nDrovers & Mechanics National Bank of Baltimore.<br />\nSurplus 1111(1 Profits, $350,000<br />\n<br />\nCapital.Stock $300,000.<br />\nTRANSACTS<br />\n<br />\nMANAGER.<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n<br />\n833 MADISON AVENUE<br />\nSTATIONERY SUPPLIES<br />\n<br />\nSala<br />\n<br />\nTEMPLE•<br />\n<br />\nMASONIC<br />\n<br />\nCLINTON P. PAINE<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nMUELLER,<br />\n<br />\n5 WEST LEXINGTON ST.<br />\n( LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br />\n<br />\nA GENERAL BANKING BUSINESS.<br />\n<br />\naa and<br />\n<br />\naio.res<br />\n<br />\nWayward:<br />\n<br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br />\n<br />\n1/<br />\n'<br />\ne.<br />\n'AO?<br />\n<br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, Assit Cashier.<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nMANUFACTUFIER OF<br />\n<br />\nA. H. FETTING,<br />\n14 AND<br />\n<br />\n16<br />\n<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br />\n<br />\n6reelt teller 'fraternity<br />\nJewelry.<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\n\"It has it full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br />\n<br />\nST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\nC.<br />\n<br />\nNEW YORK TO BREMEN,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nor<br />\n<br />\nw<br />\n<br />\nFor particulars apply to<br />\n<br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\n<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nBALTIMORE TO BREMEN<br />\nDIRECT,.<br />\n<br />\niat<br />\n<br />\nie SURETY BONDS<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nH. Hildebrandt & Son, Sole Agts.<br />\n<br />\nthe<br />\n<br />\nKranz-Smith<br />\n<br />\n'Fidelity and Deposit Company of Maryland,<br />\n<br />\npiano CO.<br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br />\n<br />\nChickering, Bradbury and Webster<br />\n*it Pianos. *It<br />\nC. &P. Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nBARTL,E11-1\", 1-11AYWAFZID etc CO.<br />\n<br />\n• founders and Engineers, ••<br />\nWorks. Pratt and Scott Sts.<br />\n<br />\nOffice Calvert and German Ste.<br />\n<br />\nManufacturers ofCust and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Arest Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, PuriBeams and Beam<br />\nfiers, Condensers, etc. Columns, Plates, Girders,<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br />\n<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES,<br />\n<br />\nEDWIN WARFIELD,['rest.<br />\nmet Viee-Presit, H. Crawford 111111k.<br />\nJos. It. Stonebraker.<br />\n\"<br />\n2nd<br />\nThos, A. Whelan.<br />\n\"<br />\n3rd<br />\n<br />\nII. B. DOSI.diR, See'y-Trea,.<br />\nharry Nicodemus,<br />\nAsN't Seey-Treas<br />\n<br />\nBOOKS<br />\n<br />\nOld and<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. PIPPEN.<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\nAttachments for<br />\nAutomatic<br />\n,<br />\n44 Angelus'<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br />\n201-203 N. CHARLES STREET<br />\n<br />\n\"Washburn\"<br />\n<br />\nLUNCH ROOMS!<br />\n<br />\nHARRY T. IVIUDD'S<br />\n<br />\nTHE DRuip<br />\n1..10 HT LUNCH ROOM,<br />\n<br />\n122 NORTH HOWARD STREET,<br />\nOYSTER<br />\n<br />\nIN ALL STYLES,<br />\n<br />\nYouft PATRONAGE SOLICITED.<br />\n<br />\n\fSMITH, DIXON & CO.<br />\n<br />\nL<br />\n<br />\noc PAPER oe<br />\n29-31<br />\n<br />\n311 N.CHARLES<br />\nitlZatie<br />\n<br />\nB.. CHARLES BIT._<br />\n<br />\nLAGER BEERS<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\nOoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market<br />\n<br />\nJ. \\N'in. Middendorf.<br />\n<br />\nIt.(di,<br />\n<br />\nMIDDENDORF OLIVER & CO.<br />\n<br />\nBankers and Brokers,<br />\n<br />\ne<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Telephone 2060<br />\n<br />\n1'. Telephone 1060<br />\n<br />\n6ifts for<br />\nBrides<br />\n<br />\nSilversmiths.<br />\n<br />\nI INS,<br />\n<br />\nBohemian<br />\nROCHESTER BEER- Bavarian<br />\nTRADE MARS.<br />\nBALTIMORE<br />\nfnaerzen Brau<br />\n• BRANCH -f<br />\n217-239 SAENTRAL AVE<br />\nApollo<br />\nU CRO • IA<br />\nis THE<br />\n<br />\n• ORIGINALAND FAMOUS e<br />\n<br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\nMD.<br />\n<br />\nIN GREAT VARIETY<br />\n<br />\n218 N. CHARLES ST.<br />\n<br />\nBARTHOLOMAY'S<br />\n<br />\n-• MANAGER • •• •<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\n.11AC01131 .1* ./ I<br />\n<br />\nROCHESTER,N. Y.<br />\n<br />\nGEO •C•S<br />\n<br />\n2015 EAST GERMAN SMRSEI',<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br />\n<br />\nWedding SilverII<br />\n<br />\nBartholomay Brewery eo.<br />\n<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\nATLANTIC TRANSPORT CO.<br />\n<br />\n4.03-409 WATER ST.<br />\n<br />\n1 BROADWAY<br />\n<br />\nBALTIMORE.<br />\n<br />\nHENDERSON'S<br />\n<br />\nNEW YORK,<br />\n<br />\nLawrence It. Kemp, President .<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nC0111111ERCIfIL & FARMERS NRTIONRL BANK,<br />\nHOWARD<br />\n<br />\nAND<br />\n<br />\nGERMAN<br />\n<br />\nSTREETS,<br />\n<br />\nBALTIMORE, MD<br />\n<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLI ES.<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS,<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTHEO. WARNER,<br />\n<br />\nJAMES<br />\n<br />\nUMBRELLAS, CO HATTERS, CD<br />\nHIGH GRADE<br />\n<br />\nGooDs Low<br />\n<br />\nPRIeES.<br />\n<br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\nphotographs<br />\nimmimmisom<br />\n<br />\nSUCCESSOR TO CUMMINS<br />\n<br />\n20<br />\n<br />\nWEST<br />\n<br />\nL.,1 T. X IINOTOIN<br />\n<br />\nSTREET.<br />\n<br />\n•PLCIAL DISCOUNT TO STUDENTS.<br />\n<br />\nPAINE.<br />\n<br />\nCANES, ETC<br />\n<br />\nAgents for Lincoln & Sennett and Walter Barnard,s London Hats.<br />\n324 W. BALM MORE STREET.<br />\nMANUFACTURERS OF<br />\n<br />\nOPKINS CAPS.<br />\n<br />\nSilk and Cassimere Hats.<br />\n<br />\nligenfritz<br />\nStudio.<br />\n<br />\nR.<br />\n<br />\nWARNER.8c CO.<br />\n<br />\ncompanu<br />\n<br />\ng, BOOKSELLERS At,.<br />\n9<br />\n<br />\nSTATION ERS.<br />\n<br />\n34 W. BALTIMORE STREET<br />\nSCHOOL, LAW. MEDICAL. CLASSICAL AND MISCELLANEOUS BOOKS.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman's College of Balt°.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\n111ELJEIN M. HOL,L,YDAY,<br />\n600 N.<br />\n<br />\n1.4.:,u^r...kw<br />\n<br />\n•ALTIMORE, MD.<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks 'Bought, Sold, and Exchanged.<br />\n<br />\nAnheuser-Busch<br />\n- Brewing Ass'n<br />\n<br />\n-nu<br />\n<br />\nYou get the benefit of<br />\nall thislabor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logne.<br />\nC.:HAS. M. STIERIP.<br />\nN. Liberty St., Baltimore, Md. 521 nt 11 St. , N. W., Washington, 1). C.<br />\n<br />\nPiANos<br />\n<br />\nB. G. EICHELBERGER,<br />\n<br />\nSt. Louis, Mo.<br />\n<br />\nBOOKS ANL) STATIONERY,<br />\n<br />\nBrew the Best Beers<br />\nin the World.<br />\n<br />\nENGRAVING AND STAMPING<br />\nNo. 308 North C1-1,<br />\nStre.et,<br />\nY. M. C. A. BUILDING,<br />\n<br />\nSALTIMOI, SRANCH:<br />\n<br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. & P. Telephone<br />\n2314.<br />\n<br />\nC.& P. Telephone 2351.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n21? E. Baltimore St.<br />\n<br />\nBALTIMORE, MIL<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fFORD'S!<br />\n<br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br />\n<br />\n-THEgr<br />\n<br />\nTHEATRE OF BALTIMORE.-10<br />\n<br />\nJAN. 7,<br />\nONE<br />\nWEEK<br />\n<br />\nBERTHA OALLAND<br />\nIN TILE \"PRIDE OF JENNICO.\"<br />\n<br />\nJAN. 14.<br />\nONE<br />\nWEEK.<br />\n<br />\nLEM M ERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br />\n<br />\n'doC<br />\n.<br />\n<br />\nNIXON &<br />\nZIMMERMAN'S<br />\n<br />\nANDREW NIA46:4C<br />\nIN HIS NEW PLAY \"THE REBEL.\"<br />\n<br />\nACADEMY OF MUSIC!<br />\n<br />\nWEEK OF<br />\nJAN. T.<br />\n<br />\n•••••<br />\n<br />\nyee,<br />\n<br />\n1-712AN4.:18 WILSON<br />\nIN \"THE MONKS ()I: MALABAR.\"<br />\n<br />\nWEEK OF<br />\nJAN. 14.<br />\n<br />\notr<br />\n;<br />\n4:<br />\n11<br />\n<br />\nJOHN DREW<br />\nIN \"RICHARD CARVE!..\"<br />\n<br />\nLEM M ERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br />\n<br />\nLEM M ERT.<br />\n<br />\n14 E. FAYETTE STREET.<br />\n<br />\nS<br />\n<br />\nPECIAL<br />\n<br />\nSPACE TO LET.<br />\n<br />\nDISCOUNT!<br />\n<br />\no<br />\no<br />\no<br />\n0<br />\n<br />\nTo the Students and Nurses of Johns Hopkins we will make a<br />\n<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n9Y, JEPPRES ,STUDIO, w<br />\n<br />\nl.0<br />\nOS<br />\n<br />\nvioLiikpFEL e Bk.-17,EL<br />\n<br />\n,s the<br />\n<br />\nnoblest part of your %<br />\n<br />\ne,Parn°1v<br />\nocrtitls)ya=r<br />\n1.)<br />\n1(ri)c<br />\ni--- \\<br />\nCi,:.441<br />\ndeYarnilm<br />\ning OUR HATS.<br />\n0<br />\n<br />\nMINOR'S,<br />\n<br />\nUP-TO-DATE,<br />\n<br />\n*<br />\n<br />\nco:<br />\n<br />\nB.<br />\n<br />\nII<br />\n<br />\n* Mandolins *<br />\n<br />\nSIR,<br />\n<br />\nVA 218 NORTH EUTAW STREET,<br />\n'4t't<br />\nONE PRICE.<br />\n‘...<br />\n0<br />\nrOZZi..,<br />\n,<br />\ne<br />\n4eZe..-,e.,,<br />\ne,zzz,»:._<br />\n,,<br />\n,<br />\n,i,,azezazezzzrzezawazise<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n108 N. CHARLES STREET.<br />\n<br />\notni HEAD<br />\n<br />\nMANDOLINS, GUITARS anal BANJOS<br />\n\"have a tone<br />\nThat's all their own.\"<br />\n<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\nNEAR SARATOGA ST.<br />\nOPEN<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nINSTRUMENTS TAKEN IN<br />\n<br />\nEVENINGS.<br />\n<br />\nEXCHANGE.<br />\n<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nJ. SMITH,<br />\nNMUNATROHNSONMESIEWNWANTOMME,TRWROSTMT<br />\nOunler Iii<br />\n<br />\nBOOI<S<br />\n<br />\nOld sitic.1 IN'<br />\n<br />\nMURIZONOTROSMENVONTATAMPANNMETOMMETO<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br />\n<br />\n125 EAST, NEAR CALVERT STREET.<br />\n<br />\nCHRCASCCC000[11“);<br />\nCOLLARS.<br />\n<br />\nGLOVES.<br />\n<br />\nCUFFS<br />\n<br />\nS<br />\n<br />\nBRACES.<br />\n<br />\nTON E Bppoi r,<br />\n-77711- ;-7, 401.11,- L.•-<br />\n<br />\n. , ip<br />\n<br />\nio,<br />\n.<br />\n<br />\n: r, 4.,<br />\n<br />\n• ,,,),/ ,c,-)<br />\ni ' , •.<br />\n<br />\n, n , \\I<br />\n<br />\nu<br />\ns<br />\n.<br />\n,:<br />\ny<br />\n<br />\nzI7E.BALTO.E,.<br />\n--MD.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nUMBRELLAS.<br />\n<br />\nCANES.<br />\n<br />\nEORE<br />\nTIES.<br />\n<br />\nETC.<br />\n<br />\nNovember 7th, Iwo.<br />\nWhile visiting the Paris Exposition of 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by ouf•representative, who secured some very fine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lalitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard & Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all OfIley Forrester & Co.'s exhibit; it very old, strictly<br />\nIflue, rich, medicinal Port mine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br />\n<br />\nt) /<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\n<br />\nIG\"----<br />\n<br />\nBALTIN10RL<br />\n99<br />\ni<br />\n'<br />\nC5- ----=----5)(4--------,)---- 1<br />\nCs----_—.0<br />\n<br />\nSTONEBRAKER BROTHERS,<br />\n0.-------9q--J<br />\n<br />\n217 E. BALTIMORE ST.,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n\f", "format": "basic_html", "processed": "At)<br /><br />\n11./P&amp; VER,4 ./900<br /><br />\n-+.010.+•.•.•••<br /><br />\n•PRESS Or STONEBRAKER<br /><br />\nBROS., BALTIMORE<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br />\nEnsmonominnem<br /><br />\nTwenty-Fifth Year.<br /><br />\n13eginning October 1st, 1900.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nDANIEL C. GILMAN<br />\nWM. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br /><br />\n95.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\nDirectors.<br /><br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks,<br />\nFranklin P. Mall.<br />\nWilliam It. Howell.<br />\nWilliam II. Welch.<br />\nJohnJ. Abel.<br />\nJohnJ. Abel.<br />\nWilliam Os/cr.<br /><br />\nSeminaries.<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames IN. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the'Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\nG. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXII.)<br />\nChemistry (vol XXIV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XVIII.)<br />\nModern Languages (vol. XV.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nEditors.<br />\nFrank Moreley.<br />\nIra Remsen.<br />\nBasil L.Gildersleeve.<br />\nHerbert B. Adams.<br />\nA. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. II. Welch.<br /><br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br /><br />\nThe Julius Hopkins<br />\nI.<br /><br />\nAmerican Journal of Mathematics.<br />\nS NEWCOMB,Editor. Quarterly. 4to. Volume XXII..<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXIV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. AnAms, Editor. Monthly. 8vo. Series XVIII<br />\nIII progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXI in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nX.<br /><br />\nXl.<br /><br />\nXII.<br /><br />\nXIII.<br /><br />\nXIV.<br />\nXV.<br /><br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV in progress. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELmorr, Editor. Monthly. 4to. Volume XV<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. II. WELCH, Editor. Hi-monthly. 8vo. Volume<br />\nV ill progress. $5 per volume.<br />\nAmerican Journal of insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br /><br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc., of the University. Published at the<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to, 56 plates. $7.50, cloth.<br />\nTHE TEACHING'OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br /><br />\nCbe newsr= Letter. *<br />\nVol. V.<br /><br />\nJanuary 10, 1901.<br /><br />\nA VISIT TO ETON COLLEGE.<br />\nwas a gray day when we first saw Eton ColITlege.<br />\nWe did not have that bright sunniness<br /><br />\n•<br /><br />\nwhich decks the sward with wild flowers and<br />\ngives to the whole the joyous warmth of color<br />\ngenerally held as characteristic of a true English<br />\nlandscape; but the heaviness of the atmosphere<br />\nwas conducive to quiet contemplation and serious thought, and the external aspect of the<br />\ncollege surroundings inspired regard for the<br />\nantiquity of its foundation and the glory of its<br />\nachievements.<br />\nFrom the summit of the great tower of Windsor, from which one can see into thirteen counties in clear weather, we looked across the river<br />\nand saw a number of men and boys running<br />\nabout in an open field playing at the English<br />\ngame offoot-ball. Down in the town we met a<br />\ndozen or more of these men. Great, stalwart<br />\nfellows they were, their thin running suits, with<br />\ngolf stockings rolled down below a bare knee,<br />\nand their light, vertically striped jackets, devoid<br />\nof all padding, marking them in vivid contrast<br />\nto the foot-ball warriors on this side of the<br />\nwater. Though apparently very young, they<br />\nnearly all wore moustaches, and their stocky<br />\nbuild and sturdy demeanor as they swung in a<br />\nbody through the midst of thc town and across<br />\nthe bridge leading to the college,impressed us as<br />\ntypifying the physical glory of young English<br />\nmanhood. Followed by a crowd of admiring<br />\ntownsboys, they tramped up one of the streets<br />\nof the little town and finally disappeared behind<br />\nthe doors of a wine shop, leaving me with the<br />\nsudden recollection that these men had been<br />\nclothed in shirts of black and blue, the first time<br />\nthat I had ever seen or heard of that combination of colors as a college emblem outside of<br />\nJohns Hopkins.<br />\nAll along the street leading up to the college<br />\nlittle shops displayed pictures offoot-ball teams,<br />\nand winning eights, and views of college ceremonies and entertainments, together with lots<br />\nof little painted jugs and mantel ornaments all<br /><br />\nNo. 6,<br /><br />\nbearing the motto, Floreat Etona, and little<br />\nboys in tall hats and round collars and wearing<br />\nthose same \"Eton jackets,\" that we see sometimes a part of ladies' dresses, looked in at the<br />\nwindows from time to time as they walked in<br />\ngroups with their hands in their pockets or<br />\ntwisting the enormous watch chains which<br />\nhung down over their waistcoats.<br />\nPassing from the road through an archway<br />\nwe come to the quadrangle, called the schoolyard, although it is roughly paved with cobblestones and its only ornamentation is a statue of<br />\nHenry VI. in the centre. One of the gloomy<br />\ndoorways around this yard was open, and a<br />\ngroup of students, some wearing gowns, were<br />\npassing in very slowly to recitation, nearly every<br />\none taking a last fond look at his page as he<br />\ncrossed the forbidding threshold. I was overcome with emotion. It was so like home!<br />\nBack in the great hall where the meals are<br />\nserved to the whole school, and in parts of the<br />\nupper school, may be seen carved deeply into<br />\nthe panels or the tops of desks among a perfect<br />\nwilderness of letters and ciphers, the initials of<br />\nShelley, and Charles James Fox, and Eton men<br />\nguard with pride the memory of Lord Byron's<br />\ncricket playing, Gladstone's youthful writings<br />\nfor the \"Etonian,\" and George Canning's<br />\nschool boy popularity.<br />\nBeyond the cloisters lie the playing fields.<br />\nAnd such an expanse of soft velvet verdure as<br />\nwould ravish the sight of a Hopkins man!<br />\nThink of a beautiful grassy plain finely kept and<br />\ntrimmed, and stretching away along the river<br />\nwith space enough for three enclosed gridirons,<br />\nwhile beyond, across the slough road is another<br />\nopen field large enough fora half dozen more contests! Passing through a stile in the hedge, we<br />\ncame out upon this second field, where four simultaneous foot-ball games were then in progress among the younger boys. Here was surely<br />\nthe paradise of the athlete,open air exercise free<br />\nand unconfined at a short walk from the college<br />\nbuildings and in the purest of atmospheres.<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nBut the joy to the studious and the contemCHRISTMAS TRIP OF THE MUSICAL<br />\nplative, to those who love nature and the comCLUBS.<br />\npanionship of the woods and running waters, is<br />\nthe river. Here the Thames flows gently through<br />\nT last the much talked of Christmas trip of<br />\nthe pleasant meadow, a cool limpid brook, savthe Musical Clubs is over,and the men who<br />\ning its strength for the present. Soon it must were fortunate enough to be taken away have<br />\nbear upon its broad bosom the shipping of the resigned themselves, and their five dollars cau•<br />\nnations. Now it is a modest country stream, tion money to fate and Manager Bird.<br />\nand as it glides softly at our feet, kissing the<br />\nFrom start to finish the trip was a success.<br />\noverhanging branches of the trees, and gurgling Every man had an excellent time and came back<br />\nwith laughter around some projecting root or showing that he had made the most of the recepobstructing rock, it filled the soul with peace tions and late dances given to the Clubs after<br />\nand inward joy.<br />\nthe concerts. The Clubs all assembled at CamOn the bank is a great tree, whose interlacing den Station Wednesday afternoon,December 26,<br />\nroots form a natural seat right down on the and after a two-hour ride in their private car<br />\nedge of the water. Here we sat ourselves down hitched, however, to an accommodation train,<br />\nand liked to imagine that in the centuries that arrived in Washington at 7 o'clock.<br />\nEnglish boys have attended this school doubtThe concert was given in the National Rifles'<br />\nless many whose names appear upon the roll of Armory, and although the hall was large and<br />\nhistory had frequently sat in this same place. there.was plenty of room, the audience was, to<br />\nHere perhaps Shelley resorted to escape the com- say the least, small. Tears were seen to trickle<br />\npanionship of his mates; here Byron may have down the faces of many of the men as they<br />\nnursed his griefs: here Arthur Wellesley may thought of their five dollars helping to pay for<br />\nhave read his history, and looking over to where the privilege of playing to empty seats. But the<br />\nthe great white castle shone through the trees, audience(if so large a word is allowable)inspired<br />\nperhaps have dreamed of a splendid career as by the vigorous applause of several Hopkins<br />\nEngland's foremost soldier. It cannot have alumni, succeeded in rallying the spirits of the<br />\nbeen far from this place that Spenser walked<br />\nClubs, and an excellent concert was given.<br />\n\"Alcmg the shoare of silver streaming Themmes;<br />\nThen the Clubs retired to their hotel and after<br />\nWhose rutty bank, the which his river hemmes,<br />\na sumptuous repast (this is fine writing, for<br />\nWas paynted all with variable flowers<br />\nthere was nothing but sandwiches and coffee)<br />\nAnd all the meades adorn'd with dainty gemmes.<br />\n•<br />\n•<br />\nretired to the rapid moving and dangerous<br />\nSweet Themmes run softly, till I end my song.\"<br />\nfolding beds. During the night several men had<br />\nto be rescued from different parts of these beds,<br />\nCA CA<br />\nbut otherwise nothing of importance happened.<br />\nEIIOLD,<br />\nYe Seniors grave and Juniors bold,<br />\nThe next morning before the city was awake<br />\nThis is the time of the essay man,<br />\nthe private car was again side-tracked, and the<br />\nThe awful, terrible essay man,<br />\nmen clambered aboard and continued their disWho hates to give good marks, and flunks all he can.<br />\nturbed nap.<br />\nLIST, ALL.<br />\nThe trip from Washington to Charlestown,<br />\nThe subjects are hung on the study-room wall,<br />\nW.<br />\nVa., was delightful, for the railroad passes<br />\nThere's no time to tarry: the call is to work,<br />\nIn the months that are coming there's danger that<br />\nthrough some of the most beautiful country of<br />\nlurks<br />\nVirginia and the day was superb. At Harper's<br />\nIn the path of the man who his plain duty shirks.<br />\nFerry the Clubs aroused themselves sufficiently<br />\nTHE DEAN.<br />\nto leave the car and be photographed. Then<br />\nAnd his worthy confrere, our esteemed Dr. Green,<br />\nthe train continued its way to Charlestown.<br />\nhave concocted a plan to make every one bow<br />\nHere the men after enjoying a true Virginia<br />\nAt the altar of labor, and you will allow<br />\ndinner prepared to give the afternoon concert.<br />\nThat good marks must he earned by the sweat of the Realizing that an audience was desirable to make<br />\nbrow.<br />\nthe concert entirely successful, the Clubs deter-<br /><br />\nB<br /><br />\nTHE NEWS-LETTER.<br />\nmined to go en masse to a foot-ball game<br />\nbeing played between the Charlestown eleven<br />\nand a team from Summit Point. The men then<br />\nproceeded to show by their vigorous and welldirected rooting how much they loved the<br />\nCharlestown people and admired their team.<br />\nThis manner of advertising had the desired effect<br />\nand the concert hall was well filled.<br />\nFrom Charlestown the Clubs went to Winchester, Va., where they were received by a full<br />\nhouse. Many of.those in the audience were<br />\ninclined to be very sparing in their applause, but<br />\nafter hearing \"Dixie,\" by the Banjo Club, and a<br />\nfew of Swindell's songs, they became much more<br />\nenthusiastic. The reason for this apparent lack<br />\nof interest was because two years ago the Hopkins Clubs had given a very poor concert and<br />\nthe audience feared a repetition. But this year's<br />\nconcert has entirely changed their opinion of the<br />\nClubs and the audience next year will no doubt<br />\nbe much larger and more appreciative. Then<br />\nfollowed a dance with refreshments given by the<br />\nyouth and beauty of Winchester. The next<br />\nmorning or rather the same morning, for the<br />\ndance did not stop till 2 a. in., the men took the<br />\nsix o'clock train for Hagerstown. The concert<br />\nthere was also far better than was ever given<br />\nbefore and yill help to increase the audience the<br />\nnext time the Hopkins Clubs go to Hagerstown.<br />\nImmediately after the concert the hall was<br />\ncleared and the men enjoyed the last dance of the<br />\nChristmas trip. The next morning, December<br />\n29, found the Clubs once more on the train<br />\njourneying toward home.<br />\nThe whole trip was a thorough success, and<br />\nnot a man on the Clubs would have missed it,<br />\nno matter if it had cost twice as much.<br />\nE. C. H.<br />\nTHE Board of Trustees has not yet made any<br />\nselection of a man to succeed Dr. Gilman in the<br />\npresidency of the University. At their regular January meeting on Monday, they reelected Mr. James L. McLane, President; Mr.<br />\nFrancis A. White, Treasurer, and Mr. Lewis N.<br />\nHopkins, Secretary of the board,and transacted<br />\nroutine work. President Gilman's official resignation is to be announced on Commemoration<br />\nDay, February 22d.<br /><br />\n111111.—<br /><br />\n3<br /><br />\nA LA SAN TOY.<br /><br />\n44 WE will imitate the styles of the western<br />\nBritish Isles,<br />\nThough the reason isn't easy to devine—ah;<br />\nBut they do it in the West, so ofcourse it must behest,<br />\nAnd I mean to introduce it into China.\"<br />\n0 there was a Hopkins boy, and he went to hear<br />\nSan Toy,<br />\nAnd he got that giddy music in his head—ah.<br />\nEvery time the wheels went 'round, that same chorus<br />\nwould resound,<br />\nTill his comrades almost wished that boy were<br />\ndead—ah.<br /><br />\no<br /><br />\nhe took the Christmas trip, and each morn he'd<br />\nwake us up.<br />\n\"Though the reason is not easy to del-lite-1th.<br />\nHe would shout it through the hall, and he wouldn't<br />\nstop at all,<br />\nThough the manager imposed a heavy fine—ah,<br />\n\"But they do it in the West, so ofcourse it it must he<br />\nbest,\"<br />\nSo he told us, lint we couldn't see it quite—ah.<br />\nHe might \"imitate the styles of the western British<br />\nIsles,\"<br />\nIf he only wouldn't do it in the night—ah.<br />\nFriday night at Hagerstown (that's the night our<br />\nluck was down)<br />\nWe had done one number on the programme fine—ah.<br />\nFor an encore we fell in—\"Steeny\" muttered to begin,<br />\n\"0 I mean to introduce it into China!<br />\nIf he imitates this style, in a very little while<br />\nHe'll perhaps discover that it is not well—ah;<br />\nHe will meet untimely end,down to Hades he'll descend,<br />\nThen perhaps he'll introduce it into * * * *—ah.<br />\nW. B. C.<br /><br />\nMr. Frederick Harrison, the well-known<br />\nEnglish Philosopher and literary man, who<br />\noriginated the movement for the celebration of<br />\none-thousandth anniversary of the death of<br />\nKing Alfred the Great, of which Prof. J. W.<br />\nBright is one of the American Secretaries, has<br />\naccepted the invitation of President Gilman to<br />\nlecture at the University. He will appear before<br />\nthe students early in March, and will probably<br />\ngive from two to four lectures on historical<br />\nsubjects.<br />\nHe will speak before the students of Howard<br />\nUniversity before coming here, and will later<br />\nvisit other educational centers of the country.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\n'Ube 14ewo.1Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nJANUARY 10, 1901.<br />\nzo cents a single copy.<br /><br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br /><br />\nNORMAN BOYER, 1901.<br /><br />\n.<br /><br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\n.<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n.<br /><br />\npossess forensic spell-binders, both tried and<br />\nuntried; the Lacrosse team has still the nucleus<br />\nof last year's champion twelve, and the Track<br />\norganization counts among its available material men able fully to make up the losses of the<br />\npast year. There is every reason why we should<br />\nmake this first year of the new century better<br />\nthan the closing years of the last.<br /><br />\nJOHN M. BOOKER, 1901.<br /><br />\n( WILLIAM B. HILL, 1902.<br />\nEBEN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br />\nJOHN A. SLEMONS, 1902.<br />\nI 4YMAN C. MURPHY, 1902.<br />\nJOHN M. BANDEL, 1901.<br />\n.<br />\n. AUBREY PEARRE,JR., 1902<br /><br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns liopkins Hospital.<br />\n-<br /><br />\nthe beginning of the new term everyWITH<br />\nthing starts up with the renewed vigor<br />\nborn of the holidays of the previous weeks. The<br />\nundergraduate mind disburdens itself of about<br />\nthree-fourths of the knowledge hastily acquired<br />\nduring the two or three days prior to the examinations, and begins once more to occupy itself<br />\nwith the more pressing interests of the lounging<br />\nroom, the slot machine and Walter's tonsorial<br />\nclinics in the basement.<br />\nMeanwhile a considerable element twangs the<br />\nmelodious guitar every afternoon in McCoy<br />\nHall,and craves the indulgentfavor of the whole<br />\nUniversity on Friday night. Lately returned<br />\nfrom the joys of Western Virginia and the plaudits of the fair, they feel the inspiration of success. A less considerable number, perhaps, has<br />\nbegun to cast its mental vision along the southern lands where oceans lie close together, and<br />\nnot long hence will advise a waiting nation<br />\nwhether or not to make the waters one.<br />\nUpon another field the captains urge their men<br />\nto struggle for the flying ball, and strain to<br />\nreach the distant goal beyond theirfellows. All<br />\nthis is good, and should be as it is.<br />\nThe prospect is as good as it ever was for success in every branch of University endeavor.<br />\nHigh scholarship will, of course, maintain itself<br />\nwithout the necessity of any comment. The<br />\nMusical Clubs have been tried and have not<br />\nbeen found wanting; the Senate and the House<br /><br />\nThis is the season, too, for the annual public<br />\nlectures, which will be given in McCoy Hall from<br />\ntime to time during the next two months or<br />\nmore. This is one of the features of the University year which is of greatest interest to educated people of the city, and should be to the<br />\nstudents here. But strangely this is not the<br />\ncase. Lecturers from famous centres of learning<br />\nin this and foreign lands pass through our midst,<br />\npause for a while and give us of their best<br />\nthoughts, and lo, the mind of the averages<br />\nstudent knoweth not that it was so.<br />\nThe men miss a great deal often by their<br />\nneglect of these opportunities. This neglect is<br />\noften without any valid excuse. A few,perhaps,<br />\ncannot leave duties at or awayfrom the University; but there are some men who would prefer<br />\nto sit in the barber shop with nothing to do but<br />\nsmoke a pipe and watch the victim in the chair<br />\nthan listen for a few minutes to a lecture<br />\nupstairs, which many are perhaps paying a<br />\ngood price to hear. Every man should have<br />\nsome acquaintance with at least the names of<br />\nthe distinguished scholars of the country, and<br />\nwhen one of them comes to our own University,<br />\nwe should go into the hall, if for no other purpose than to see what he looks like. It is something of profitfrom a college education to be able<br />\nto point out an eminent scholar on the street.<br />\nThe NEWS-LETTER has harped upon this old<br />\nstring before, but there may he some who have<br />\nnot heard it, or having heard, have not remembered, or having remembered, have not heeded,<br />\nor having heeded, have not profited thereby.<br />\nTo all these we say:<br />\n\"Do not delay;<br />\nDo not delay; the golden moments fly.\"<br /><br />\nsnow<br />\nDR. Bernard C. Steiner has recovered from his<br />\nlate hospital experience and has resumed charge<br />\nof his class in American Politics.<br /><br />\nTHE NEWS-LETTER.<br />\nHOPKINS DRAMATIC SOCIETY.<br /><br />\n5<br /><br />\ninterest toward the higher purposes of a univer<br />\nsity, and in this manner are of great value. The<br />\nANY kinds of clubs have been formed at public come to a debate, find it interesting and<br />\nHopkins—in fact we have every sort of enjoyable, look for something else to happen in<br />\norganization common to colleges except one that McCoy Hall, and discover a lecture list or an<br />\nfor some reason or other has never made its ap- announcement of a scientific meeting; some think<br />\npearance here. Thatis a dramatic society, whose they will try the experiment further, and thus<br />\naims shall be to develop the histrionic ability we have interest. On the assumption of a sucof its members, and, if possible, produce a play. cessful dramatic production, interest in other<br />\nWe do not know why the organization of such affairs should increase, for a play by collegians<br />\na society has never been attempted; now is the is bound to draw a crowd.<br />\ntime to start to investigate the matter, and disThe question of a dramatic society has been<br />\ncover any desire on the part of the students to<br />\norganize. There are difficulties in the way, but freely discussed by several students,and the only<br />\nthe difficulties are ones which, with a little sound objection urged against the formation is<br />\nenthusiasm and work, ought easily to be over- lack of students to engage in all the interests of<br />\nthe University. The claim that with such a<br />\ncome.<br />\nsmall<br />\nnumber of students the individual must<br />\nThere are numerous benefits to be derived from<br />\nengage<br />\nin several interests, any one of which<br />\nsuch a society both by the students individually<br />\nwould<br />\nrequire<br />\nall his spare time is strong, but<br />\nwhole.<br />\nIn<br />\nthe<br />\nfirst<br />\nand by the University as a<br />\nconclusive,<br />\nfor the time required of each pernot<br />\nplace, it will develop any latent talent to act<br />\nsociety is only minimum. It<br />\nfor<br />\na<br />\ndramatic<br />\nson<br />\nthat may exist among the students,and thereby<br />\nnumber of men seen around<br />\nalso<br />\nseems<br />\nfrom<br />\nthe<br />\nthe<br />\npower<br />\nwhich<br />\nwill<br />\nbring to<br />\nsurface a<br />\nalways<br />\ndoing<br />\nabsolutely no more work<br />\nthe<br />\nbuildings<br />\nbe of some service to a man in his course through<br />\nstudy<br />\nto \"pull through\"<br />\nnecessary<br />\nthe<br />\nthan<br />\nbring<br />\nthe fellows tolife. It will necessarily<br />\nathletics<br />\nor men without<br />\ntoo<br />\nstrong<br />\nfor<br />\n—men<br />\nrehearsals<br />\nand<br />\nmeetings,and be a close<br />\ngether in<br />\nlacksomething<br />\nthere<br />\nis<br />\nstill<br />\nears—that<br />\nmusical<br />\nbond of union between them,just as the athletic<br />\nwhat<br />\ndramatic<br />\nsociety<br />\nis<br />\nthese<br />\nPerhaps<br />\na<br />\ning.<br />\nclubs<br />\nunite<br />\nteams and the musical<br />\ntheir members<br />\nin alliance of good fellowship. Every one at men need to employ their spare time! Even<br />\ncollege tries to get as close a view of his neighbor among those who are interested otherwise there<br />\nas possible; and, therefore, a dramatic society, should be some men with time to devote to such<br />\nwith its many chances of fraternity, should be a society. What is necessary for the experiment<br />\nis enthusiasm on the part of some, and assisthailed with delight.<br />\nS., '02.<br />\nby others.<br />\nance<br />\nreason<br />\nfor<br />\na<br />\nthe<br />\ngreatest<br />\ndramatic<br />\nclub<br />\nBy far<br />\nAk6<br />\na<br />\nplay,<br />\nthe<br />\nproduction<br />\nof<br />\nlies in the fact that, by<br />\nDr. Guy Canton Lee began his series of lec<br />\nthe University is brought before the public, or<br />\nintroducing English History on Friday<br />\ntures,<br />\nbrought<br />\nto<br />\nthe<br />\nUniversity.<br />\nrather the public is<br />\nJanuary 4th.<br />\nthe<br />\ninter-class<br />\nThe crowded hall on the night of<br />\nThe first lecture \"Source Method in Teaching<br />\ndebate testifies that what interests the public<br />\nHistory,\" was well attended.<br />\nmost in a university is an exhibition of student<br />\nSubjects for remaining lectures are:<br />\npowers. Every one must confess to the great<br />\n\"The Earliest Inhabitants of Britain,\" Janulack of municipal interest in the doings of our ary 11th.<br />\nUniversity—caused doubtless by our situation<br />\n\"The Anglo-Saxon Invasion,\" January 18th.<br />\nin a large city more than by anything else, but<br />\n\"Social Life Before the Norman Conquest,\"<br />\nnevertheless existent—and most of us have a January 25th.<br />\ndesire tO be better known by the general public.<br />\n\"Laws and Customs of the Anglo-Saxons,',<br />\nWe do not expect, nor does the public consider February 1st.<br />\n\"The English People,\" February 8th.<br />\ndebates and plays to be genuine specimens of<br />\n\"England Under the Normans,\" February 15th<br />\nhowever,<br />\nstart<br />\ndo,<br />\ntrue college work; they<br /><br />\nM<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nA LITTLE TALK WITH MARS.<br /><br />\nRE-ECHOINGS OF THE MUSICAL<br />\nCLUBS TRIP.<br /><br />\nthe dawn of the twentieth century, the BR-R-R-R-R-ING!!<br />\nUPON<br />\nscientific world is shaken to its veryfoundaIt was Friday afternoon, and the noise<br />\ntions by the report ofProf. Nikola Tesla relative<br />\nto his work along astronomical lines. From his<br />\nobservatory perched upon the top of the mountains of Colorado, comes the startling information that the learned professor has put himself<br />\nin communication with the planet Mars! The<br />\nnineteenth century has witnessed the birth of<br />\nmany inventions and discoveries, but lo! the<br />\ncoming era is to surpass them all.<br />\nHow our ideas will broaden by -coming into<br />\ncontact with the minds of the men of Mars, provided they are a people of advanced civilization,<br />\nbut if, on the other hand, they are benighted<br />\nheathens, it will be our plain duty to benevolently assimilate them, and introduce them to<br />\nthe two great blessings of our advanced civilization—fire water and gunpowder.<br />\nApropos of the present situation, a question<br />\ncomes up that we find difficult to answer. We<br />\nobserve that when an astronomer gives out<br />\ndefinite information regarding the neighboring<br />\nplanets, Mars is always the one chosen. When<br />\nan author has exhausted every other topic he<br />\ncan think of (to say nothing of his readers) he<br />\nmixes up a bit of whisky and absinthe, and the<br />\nresult is a story about Mars. This is manifestly<br />\nunjust, for we believe that some of the other<br />\nplanets should come in for a share of this attention. For instance, Venus, whom we imagine,<br />\nwould be equally as interesting (if not more so)<br />\nthan the fiery god of war.<br />\nBut we anticipate; let us wait a kw weeks<br />\nlonger and perhaps the next communication<br />\nfrom Tesla will tell us that his invention has<br />\neliminated space and that we may proceed to<br />\nbecome acquainted with the inhabitants of the<br />\nsurrounding planets.<br />\nAt times we shall be awakened from our contemplations by the merry tinkle of the planetophone bell, and then—\"John, dear, come to the<br />\n'phone. Someone in Mars has rung you up.\"<br />\nAfter all, the universe is a small place.<br /><br />\n.46 .46 .46<br />\nDR. Henry S. West, who was recently elected<br />\nprincipal of the Western High School, has assumed his duties and announces several contemplated reforms.<br /><br />\nwas being made by the elevator bell in the Hamilton House, at Hagerstown. The dusky son<br />\nof Africa who ran the thing failed to appear,<br />\nand we grew impatient. But we had Manager<br />\nBird with us, and Manager Bird is a very versatile young man. The natural grace with which<br />\nhe glides through the dreamy waltz is only excelled by the good-natured sangfroid with which<br />\nhe peddles ginger ale at ten cents per bottle. So<br />\nwhy shouldn't he run an elevator? Why, indeed?<br />\nHe seized a rope and gave a mighty pull. No<br />\nresult. Then he gave a great haul in the other<br />\ndirection. If the thing wouldn't go up,it would<br />\nhave to go down, but go it must. It went!! —<br />\n* * —! If there hadn't been a cellar to that<br />\nhotel, we would be going yet. Bird lost his<br />\nJo!).<br />\nslf sli<br />\nZzzzzzzz! It was really scandalous. He<br />\nneeded a shave so badly,that when he played his<br />\nmandolin, it sounded like an aeolian harp, and<br />\nhis singing had the wheezy quality of a jewsharp. Things had reached a point where desperate measures were necessary. So,as we strolled<br />\nalong Charlestown's quiet streets, we informed<br />\nhim that he must go with us to a barber, dead<br />\nor alive, and get a shave. He bolted, and<br />\nstarted to run for the hotel, with the same natural instinct that prompted his eloquent namesake to run twice for the presidency—and with<br />\nthe same success.<br />\nAfter we had carried him half a square in the<br />\ngraceful and easy position of the summer girl's<br />\nhammock,he agreed to go peaceably,if we would<br />\nput him on his feet. The barber's pleasant greeting faded into a sad sweet smile when he saw<br />\nhis customer, but he set bravely to work. He<br />\nhas laid aside the razor to hone up on the first<br />\nrainy (lay.<br />\nor or or<br />\nOf course, we all felt rather sore at Bird when,<br />\nafter scarcely two hours' sleep, we must needs<br />\nrise at five o'clock in the morning, and eat one<br />\nof his breakfasts(patent applied for)in our cold,<br /><br />\nTHE NEWS-LETTER<br />\ndirty car. But still we thought that it was<br />\nhardly in accord with the respect due to a senior,<br />\nwhen a Freshman referred to him vindictively as<br />\na \"Little Early Riser.\"<br />\n.1115<br /><br />\nThere was a drawn, desperate look about the<br />\ncorner of Walter's mouth, as he stood on the<br />\nrear platform gazing gloomily at the track,rushing away from him a mile a minute. It was the<br />\nsame old familiar story. He had left home with<br />\ntwenty-five dollars in his pocket. Some one had<br />\nproposed a \"quiet little game\" of poker, and he<br />\nhad joined them. The rest can easily be guessed.<br />\nAt first the stakes were low,but-in this game<br />\nthey remained low, and after a half day of<br />\nintensely exciting play, Walter found himself<br />\nloser-thirteen cents!<br />\nW. B. C.<br />\n_44.A6 .44<br /><br />\nBALTIMORE CONCERT.<br />\nmost important Concert of the Johns<br />\nTHE<br />\nHopkins Musical Clubs will be given in Lehmann's Hall Friday, January 11th, at 8 o'clock.<br />\nFrom present indications and from the success<br />\nof the Christmas trip, this will no doubt be one<br />\nof the best concerts ever given during the history<br />\nof the clubs. The Glee Club pieces have been selected with the greatest care, and the \"1901<br />\nmedley,\" contains some of the most catchy<br />\nmusic of the year. The Banjo and Mandolin<br />\nClubs have also been most fortunate in choosing<br />\ntheir pieces, and will most assuredly please all<br />\nlovers of good, snappy music. Then Mr. Swindell has added several new pieces to his repetoure, so that the audience will no longer have<br />\nto applaud in vain for more of his funny songs.<br />\nIn fact everything points to a most successful<br />\nand jolly concert, and everyone who is so unfortunate as to miss it will lose more than is<br />\nusually lost by absence from college concerts,for<br />\nthe Johns Hopkins can now boast that their<br />\nmusical clubs take the same standing among the<br />\nclubs of other colleges that the Johns Hopkins<br />\nUniversity does among the leading Universities<br />\nof the country.<br />\nThe men on the clubs this year are:President, John Hendricken King, '99; Manager, Andrew Reid Bird,'01; Assistant Managers,<br /><br />\n7<br /><br />\nStevens Thompson Mason, '02; Eben Charles<br />\nHill, '02.<br />\nGLEE CLUB.<br />\nLeader, J. A. English Eyster, G.<br />\nFiinsT TENORS:-j. A. E. Eyster, G.-W. B.<br />\nCarver, G.-H. H. Humrichouse, '02. Alan<br />\nHaughton,'OS.<br /><br />\nSECOND TENORS:-Roger Vaun, M. S. A. Marshall, M. Wm. B. Cornell, M. M. N. Smull, G.<br />\nE. C. Hill, '02, J. M. Nelson,'03.<br />\nFIRST BASSOS:-.1. H. King, G. J. H. Eager, G.<br />\nPaton Rouse, M. W. B. Swindell, '01. W. B.<br />\nSneeringer,'02. J. W. Bryan,'03.<br />\nSF:cox!) BAssos:-F. L. Critchlow, G. V. E.<br />\nSmith, G. S. T. Mason,'02. J. G. Campbell,'02.<br />\nR. T. Pagan,'03. J. R. B. Branch,'03.<br />\nBANJO CLUB.<br />\nLeader, Edgeworth Smith, G.<br />\nBANJEAURINES:-V. E. Smith, G. J. S. Briscoe,<br />\n'01. L. G. Fishack, '01. J. G. Machen, '01. F.<br />\nR. Dapprich,'01. S. T. Mason,'02. C. Marshall,<br />\n'03, R. S. Lanier,'03, W. J. Snowden,'03.<br />\nBANJOS:-M. W. Hendry,'03. W.U. Murkland,<br />\n'03. W. W. Simmons, G. J. W. Bryan,'03.<br />\nGUITARS:-H. A. Converse. G. J. A. E. Eyster,<br />\nG., L. C. Murphy,'02. E. C. Hill,'02. F. Hazleburst,'03.<br />\nBASS BANJO:-R. J. Pagon,'03.<br />\nTRAPS:-S. T. Mason,'02.<br />\nMANDOLIN CLUB.<br />\nLeader, Eben Charles Hill, '02.<br />\nMANDoLms:-H.W.Cook, M. W.B. Moulton,<br />\nM. F. R. Dapprich,'01. A. R. Bird, '01. B. C.<br />\nHill, '02. J. W.Nelson,'03. R.J. Pagon,'03. W.<br />\nSnowden,'03. J. W. Bryan,'03.<br />\nGUITARS:-V. E. Smith, G. H. A. Converse, G.<br />\nJ. A. E. Eyster, G. F. Hazlehurst,'03 L. C.<br />\nMurphy,'03.<br />\nVIOLINS:-W. B. Swindell,'01, II. C. Miller,'03.<br />\nVIOLA:-R. S. Lanier,'03.<br />\nCELLO:-Byard Turnbull,'00.<br />\nMANDOLA :-V. E. Smith, G.<br />\nCLARINETTE:-H. Dudley, M.<br /><br />\nTRAPS:-S.J. Mason,'02, J. IL King,'99.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br />\nATHLETICS.<br /><br />\nOWING to the Christmas holidays, work in all<br />\nbranches of athletics during the past two<br />\nweeks came almost to a standstill, but since the<br />\nreturn of the men to their studies, both the<br />\nLacrosse men and the Track and Field squad<br />\nare working with renewed vigor.<br />\nThe outlook for both teams grows more hopeful day by day. Notwithstanding the losses,<br />\nalready spoken of in the NEWS-LETTER, caused<br />\nby graduation, the prospects for winning teams<br />\nagain this year are very bright.<br />\nAmong the candidates for the lacrosse team,<br />\nseveral of the men are showing up remarkably<br />\nwell under the able coaching of Maddren and<br />\nAbercrombie, who are doing their best to get the<br />\nmen in shape for outdoor practice which begins<br />\nas soon as spring opens up.<br />\nThe Track and Field squad numbers about<br />\nthirty men, who are being put through a regular<br />\ncourse of preliminary training by Physical<br />\nDirector Mackdermott, assisted by Capt. Hoffman and Manager Wroth. As yet no \"wonders\"<br />\nhave been developed, but it is safe to say that<br />\nere long \"Father Bill\" will make several<br />\nvaluable finds among the many new candidates<br />\nwho will take prizes for \"Old Tom Hopkins\"<br />\nin the Spring games.<br />\nDirector Mackdermott informs us that he will<br />\nhave teams ready to enter the coming Baltimore<br />\nAthletic Club and the St. Leo's Gymnasium<br />\ngames, to be held soon,and is confident that the<br />\nglorions showing at the Fifth Regiment armory<br />\nwill he duplicated. Mr. Mackdermott also says<br />\nthat he is arranging for an indoor meet to be<br />\ngiven this spring under the auspices of the Johns<br />\nHopkins Athletic Association.<br />\nannual convention of the Inter-University<br />\nTHE<br />\nLacrosse League was held at the Hotel St.<br />\nCloud, in New York, on January the 2nd. Hopkist was invited to send delegates, and Messrs.<br />\nR.lie Abercrombie and Wm. H. Maddren were<br />\nappointed. But owing to other engagements<br />\nneither of the new men were able to attend the<br />\nconvention. However, a letter was written by<br />\nour delegates advising certain changes in the<br />\nexisting rules of the Association. After some<br /><br />\nconsideration these changes were adopted and<br />\nwill be used by the Inter-University League during the coming season.<br />\nWhen questioned in regard to what the Black<br />\nand Blue would do when the Lacrosse season<br />\nopened: Mr. Abercrombie stated that although<br />\nthe policy had not been fully determined upon<br />\nyet, he thought thatthe Hopkins team would be<br />\na sort of \"free lance\" this year, watching the<br />\ndevelopments of the other teams and playing<br />\nany good team, irrespective of the League to<br />\nwhich it belongs. This means, then, that Hopkins will not belong to any Association this<br />\nspring, although several tempting offers for the<br />\nformation of a new League have been made to<br />\nour management.<br />\nA meeting of the General Athletic Association<br />\nof the University will be held this week, at which<br />\nthe policy of the present Lacrosse management<br />\nwill be determined.<br /><br />\nIA JO ,110<br />\nINDOOR MEET AT PHILADELPHIA.<br />\nMcDermott has recently received<br />\nMaANAGER<br />\nletter from Mr. Crowherst, secretary of<br />\nthe intercollegiate and interscholastic indoor<br />\nathletic meet which will be held in the Academy<br />\nof Music at Philadelphia, Saturday evening,<br />\nMarch 2d. Mr. McDermott says he will enter<br />\nthe members of our team in all of the events for<br />\nwhich they are eligible, if possible.<br />\nWe know no reason why our track team<br />\nshould not take part in this meet and bring<br />\nback some prizes for our trophy room. All candidates who are ambitious for the success of the<br />\nteam, should now put their best foot foremost<br />\nin order that we may enter some winners. Our<br />\nlater successes or failures will depend upon the<br />\namount of earnest work now shown from day<br />\nto day. Let every man come out and do his<br />\nbest.<br />\nFurther announcement of this meet will be<br />\nmade later.<br />\nW or se\"<br /><br />\nDr. Warren, of Adelbert College, will deliver a<br />\ncourse of six public lectures upon French authors:<br />\n1, J. J. Roussem ; 2, Chateaubrand, Mme. de<br />\nStael ; 3, Nod ier Lamartine; 4, Victor Hugo; 5,<br />\nDebigmy, De Musset ; 6, George Land, Alex.<br />\nDuma's Pere.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nMr. Editor:,<br />\nN the general satisfaction over the result of the<br />\nsubject which the members of our athletic<br />\nfoot-ball season it may seem out of place to call<br />\nboard seem to have lost sight of is the attention to one feature of our work this year,<br />\nannual \"feed,\" which should be forthcomirg in that was not in keeping with the rest of Hopview of our late successful foot ball season. We kins doings; but on the principle that the Lord<br />\nhad one last year,and a very good time together chasteneth whom he loveth,a word or two may<br />\nwith some good 4hings to eat, which were en- serve to correct this little flaw in an otherwise<br />\njoyed by those who were present. President magnificent record. The point to which I refer<br />\nGilman delivered a short address apropos of was the listlessness and indifference manifested<br />\nlast year's championship, which fact reminds us by some of our rooters in the St. John's game,<br />\nthat he will not be with us much longer, and we and, to a less extent in the the Thanksgiving<br />\nshould not miss this chance—provided he will Day contest. At Annapolis, with the score<br />\nspeak—of hearing a final address on our athlet- against us, and the ball deep in Hopkins<br />\nics. This love-feast undoubtedly serves to im- territory—just the moment when the rooting<br />\npress upon the student-body the progress we should have been strongest and most bracing—<br />\nare making in athletics. And awakens a livelier Chief Rooter Swindell had the greatest difficulty<br />\ninterest in the successes of our teams than would in getting a dozen or so of the crowd to open<br />\notherwise be done, and with proper manage- their mouths at all, having to resort in some<br />\nment a very pleasant evening can be had. Let cases to a personal appeal.<br />\nthe athletic board think over this matter and<br />\nI would not have it understood that this is a<br />\nand form some definite plan of procedure, with criticism of the general body of rooters, who<br />\nan eye to another \"Fitzgibbons and Sharkey\" were, indeed, vigorous and united in their efforts.<br />\naffair.<br />\nThere were, however, some men who apparently<br />\n9/<br />\n9 961. W<br />\ndeemed it too undignified and \"decidedly rude\"<br />\nARCHAEOLOGICAL LECTURES.<br />\nto show,their enthusiasm for their Alma Mater<br />\nmanner as yelling, who sat<br />\nArrangements have been made for the delivery in so boyish a<br />\nexpressions<br />\nof preternatural wisaround<br />\nwith<br />\nof the following lectures on archfeological subreserve,<br />\nalways<br />\nready<br />\nto tender valuadom<br />\nand<br />\nects during the current winter.<br />\nto<br />\nhow<br />\nrooting<br />\nshould<br />\nbe done,<br />\nble<br />\nadvice<br />\nas<br />\nThey will be given in McCoy Hall.<br />\nProf. Louis DYER, Lecturer in Balliol College, but really too bored to take part themselves.<br />\nOxford. The Cretan Alpabet, Tuesday, January This is not written in the spirit ofhard reproof,or<br />\n8th, 5 p. in. Mycencean Gems,Wednesday, Jan- on the assumption that I have any right to administer a \"call down\" at all; but it certainly seems<br />\nuary 9th, 5 p. m.<br />\nIn this lecture attention will be called to the only reasonable, that a man who is sufficiently<br />\nremarkable collection of ancient gems and other interested to go to a game, should contribute<br />\nantiquities from Cyprus, presented to the Johns whatever aid he may by joining heartily in the<br />\nHopkins University by Mr. Theodore Marburg. rooting.<br />\nThe rooting means much to the success or<br />\nOld Knossos and the Labyrinth of Minos.<br />\nThursday, January 10, 5 p. m. Mr. Howard failure of a team, and the success of the rooting<br />\nCrosby Butler, Lecturer on Architecture,Prince- depends on each man's earnest efforts. We have<br />\nton University. The Deserted Cities of Syria. a splendid leader, but the leader cannot do it all;<br />\nFriday,January 18, 5 p. m. Professor Samuel he must be supported. And I should think that<br />\nB. Platner, Professor of Latin, Western Reserve the fellows would take pride in yelling their<br />\nUniversity. Recent Excavations in the Roman loudest. Even a freshman may exercise hislungs<br />\npermanent detriment<br />\nForum, Friday, February 1, 5 p. m. Professor in a good cause, without<br />\nto the massive repose of his dignity. Let everyMartin L.D'Ooge,Professor of Greek, University one who goes to the Track and Lacrosse games<br />\nof Michigan. Delphi and the French Excava- be useful, as well as ornamental.<br />\nH. R. V.<br />\ntions. Friday, March 8, 5 p. m.<br /><br />\nOUR ANNUAL FOOT BALL FEED.<br /><br />\nA<br /><br />\nI<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nBEGGING VERSES.<br />\nI beg you grant to me<br />\nO FATE,<br />\nThat I may look life in the eyes,<br />\nNor drop my own, nor show surprise<br />\nAt anything it holds for me.<br />\nA faith in man which men can't break,—<br />\nA double faith in woman-kind—<br />\nThe easy trust thou ga.v'st the blind—<br />\nFor here my faith must never shake.<br />\nGive me a hope which soars so high<br />\nThat it mily lead my wand'ring soul<br />\nToward the ever-distant goal;—<br />\nMy earthly body need not fly.<br />\nA charity, so long that I<br />\nIt 'round my little world may wrap<br />\nA thousand times, with over-lap<br />\nEnough to knot and fasten by.<br />\nAnd gentleness, and sympathy;<br />\nA readiness of heart and hand<br />\nWhich makes me brother to my land—<br />\nWhich makes my land a home to me.<br />\nA courage such that it will suit<br />\nTo tide me o'er my life; and when<br />\nI'm called by Captain Death, why then,<br />\nWill hold me—standing—at salute.<br />\n* • * •<br />\n•<br />\nOne asking more, for now I see<br />\nI've asked for naught but what is nice.<br />\nPray, hold, throw in a dash of vice,<br />\nLest I'd become a Pharisee.<br />\nW.W W<br /><br />\nFROM GERMAN MINOR.<br />\nit's joyful when the dentist<br />\nOil,Sets<br />\nyou free from trembling fear,<br />\nWith his \"Well, I find there's nothing,<br />\nI can do for you this year.<br />\nIt's joyful when you find that little<br />\nBill you simply cannot pay,<br />\nWill be settled by dear Papa,<br />\nWith his \"Oh, boys will be boys, they say.\"<br />\nAnd it's joyful when the paper,<br />\nThat you know was so d— bad,<br />\nThrough sonic error gets the 1<br />\nAnother fellow should have had.<br />\nBut than all these things more gladsome<br />\nTis' to hear B.J. V. say:<br />\n\"Dr. Wood, then, bier ist, noch nicht,<br />\nThere will be no class to-day!\"<br />\nR. S. I,.<br /><br />\nVALUABLE COLLECTION OF<br />\nANTIQUES.<br /><br />\nHE Johns Hopkins University is much indebted to Mr. Theodore Marburg, of this<br />\ncity, for a rare collection of antiquities which he<br />\nrecently presented.<br />\nThe collection numbers about ninety pieces,<br />\ncollected by Col. Warren during his thirteen<br />\nyears' residence on the Island of Cyprus, and<br />\nhas been greatly admired bv savants, who<br />\nhave endeavored to purchase some of the gems<br />\nfor Cambridge University and the Berlin<br />\nMuseum.<br />\nThe collection comprises gold ornaments,rings<br />\nand bracelets of Greek, Syrian, Etruscan and<br />\nPhoenician workmanship. Hittile, Egyptian<br />\nand Grecian Scarabs and cylinders adorned with<br />\ncurious carvings and inscriptions also Greek<br />\nCAmeos and Intaglios.<br />\nThe most beautiful of all the collection is an<br />\nintaglio head of Alexander the Great, cut in<br />\nred sard, and supposed to be a likeness from life,<br />\nby the Greek intaglio cutter Pergotoles.<br />\nThe workmanship is superb, Alexander being<br />\nrepresented as an ideal Greek study in art.<br />\nProf. Richter was especially anxious to secure<br />\nthis gem, but finding this impossible, obtained<br />\nan impression from it in wax.<br />\nOf special interest to students of archtelogy,<br />\nare the ancient Egyption and Hittite cylinders<br />\nand scarabs, especially two of the latter, one of<br />\nblack hemmatite and the other of white quartz,<br />\ninscribed with early Cypriot charactes.<br />\nThey are believed to be entirely unige as nothing<br />\nlike them is known in any of the European museums.<br />\nProf. Joyce of Cambridge remarked there especial value to investigators. Judging from their<br />\ngeneral appearance and inscriptions, he said,<br />\n\"they could hardly be of a later date than 1200<br />\nB. C., which was about the time blind Homer<br />\nwas singing the songs which were to make his<br />\nname immortal.\"<br />\nIt is impossible to place a monetary value on<br />\nMr. Marburg's gift, but aside from this we value<br />\nit because it bespeaks an interest in our university, and demonstrates that there are some Baltimoreans who evidently have the welfare of old<br />\nHopkins at heart.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nEXCHANGE PLACE.<br /><br />\nfollowing are three All-American FootTHE<br />\nBall Teams selected by:<br /><br />\nMUTE POETS.<br /><br />\nCoach, Dibble.<br />\nCoach, Woodrum Captain, Pell.<br />\nHarvard.<br />\nPCIlnsy.<br />\nPrincton.<br />\nR. E. IIallowell, H. Hallowell, H.<br />\nH.<br />\nI,. E. Campbell, H. Coy well, Y.<br />\nSmith, W.Pt.<br />\nR. 1'. Lawrence, H. Wallace, Pa.<br />\nWallace, Pa.<br />\nL. T. Skillman, Y. Bloomer, Y.<br />\nSkillman, Y.<br />\nR. G. Sheldon, Y. Sheldon, Y.<br />\nHare,<br />\nPa.<br />\nL. G. Brown,<br />\nY. Brown,<br />\nY.<br />\nBrown,<br />\nY.<br />\nOlcott,<br />\nC.<br />\nY. Bachman, I,.<br />\nOlcott,<br />\nV.<br />\nQ.<br />\nDaly,<br />\nH. Daly,<br />\nH.<br />\nDaly,<br />\nR. H. Hare,<br />\nPa. Hare,<br />\nPa.<br />\nReiter,<br />\nP.<br />\nL. H. Fincke,<br />\nY. Weeks, Col.<br />\nY.<br />\nHale,<br />\nF.<br />\nHale,<br />\nY. McCracken, Pa. Starbuck. C.<br />\nFrom The Inlander,<br /><br />\nnot, oh wise men of this later day, •<br />\nDREAM<br />\nBecause a man be slow and plain of speech<br />\nThat poetry, and all the arts ye teach,<br />\nAnd all the golden thoughts that ebb and sway,<br />\nAnd sing and laugh and sob and melt away<br />\nWithin your minds, be far beymad his reach.<br />\nAll fruits have not the luster of the peach,<br />\nYet some there grow more honeyed far than they.<br />\nTo some men God gives thoughts, but does not add<br />\nThe rhythmic word to body li)rth mind;<br />\nBut, think not that they never have nor had<br />\nThe sense that hears a music in the wind.<br />\nThoughts rise and die away in human wit—<br />\nYour grandest lines are some ye never writ.<br />\nW. F. BARRON,'04.<br />\n(;eorgeto IV11 College Journal.<br />\nOar<br /><br />\n141r 9r or<br /><br />\nChess Tournament which was begun last<br />\nTHE<br />\nfall has now been decided. The championship has been awarded to Mr.Edgeworth Smith,<br />\nGrad. The standing of the members at the close<br />\nof the tournament was as follows:<br /><br />\nThis is the second time Mr. Barron has broken<br />\ninto our exchange column with verse, and<br />\nWon,<br />\nLost.<br />\nPer Cent.<br />\nachieved an honor Which is reserved for very few.<br />\nEdgeworth Smith,<br />\n10<br />\n2<br />\n.833<br />\nHis first coming was a poem in our Christmas Chas. Markel!, Jr.<br />\n8/<br />\n1<br />\n2<br />\n31/2<br />\n.708<br />\n7/<br />\n1<br />\n2<br />\n.625<br />\n4/<br />\n1<br />\n2<br />\nissue: \"To the Men who Bold the Line,\" in our Lloyd 1-1. Shippen,<br />\nRalph C. Sharrets,<br />\n4<br />\n5<br />\n.444<br />\nopinion, the best foot-ball verse of this season, Louis S. Hutzler,<br />\n4<br />\n8<br />\n.333<br />\n3<br />\n6<br />\n.333<br />\nthough we have perused over twenty efforts. J. Gresham NI achen,<br />\nFrederick K. Dapprich,<br />\n2<br />\n9<br />\n.180<br />\nWe congratulate the Journa/upon the possession<br />\nThe Chess Club has decided to inaugurate a<br />\nof such a promising young writer.<br />\ncontinuous tournament, entirely different from<br />\nthe tournament just decided, to be conducted in<br />\nthe following manner. The standing at the outNOVEMBER.<br />\nset of the new tournament will be the standing<br />\nat the close of the old, as given above; any new<br />\nQuiet, at peace, in silent strength she stands,<br />\nThe dull wind blowing on her rugged face,<br />\nmembers entering the tournament will begin at<br />\nRoughing her heavy hair; with somber grace<br />\nthe end of the list. During the first week of the<br />\nTall, leafless branches sway in her strong hands;<br />\ntournament each ofthe players who stand second,<br />\nThe rude burrs catch her dress, and thorny vines<br />\nfourth, sixth, etc., will have the privilege of<br />\nTouched with the last deep color of the year<br />\nchallenging the player immediately above him;<br />\nCling to its hem, faded and frayed and seared,<br />\nFringing the coarse, dusk folds with fragile spines.<br />\nif the challenger wins he changes places on the<br />\nA look far-seeing fills her wide, deep eyes,<br />\nlist with the player he has defeated. During the<br />\nAnd the still light of long gray afternoon.<br />\nsecond week the players in the odd places will<br />\nBravely she waits the future, asks no boon,<br />\nchallenge in a similar manner;and so on throughHers the years precious past, its golden memories.<br />\nout the remainder of the college year. The<br />\nLETITIA JEAN SMITH.<br />\nVassar Miscellany.<br />\ntournament will be discontinued for two weeks<br />\nor var w<br />\nbefore the Easter examinations, and will close<br />\nThe seven richest colleges of America with en- about the middle of May. Any new players<br />\ndownments are: Girad, $15,250,000; Leland who desire to enter this contest, are requested<br />\nStanford, Jr., $13,500,000; Harvard, $10,000, to send their names to Chas. Markel!, Jr., secre000; Columbia,$9,500,000; Cornell,$8,000,000; tary of the Chess Club, who will also give any<br />\nChicago, $6,500,000; Yale, $4,200,000,<br />\nAdditional information which may be necessary.<br /><br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE<br />\nCHICAGO BOARD OF TRADE,<br /><br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br /><br />\nCALI, I)\\<br /><br />\nJAS. H. DOWNS,<br />\n229 N. eHARLES ST.<br /><br />\nBANKERS AND<br /><br />\nFOR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nBALTIMORE, MD.<br /><br />\nSMOKE UP!<br /><br />\nRAH! RAH! RAH! HOPKINS!!<br /><br />\nMINIMMIIIIIIIMM111111=1<br />\nGO TO<br /><br />\n&amp; Co,<br />\nBROKERS,<br /><br />\n217 EAST GERMAN STREET,<br /><br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br /><br />\nIF ITS<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\nThe Chas, Willms Surgical Instrument Co,<br />\n•ENJ• A. NELSON, GI WI_<br /><br />\nI. D. LANG, TOBACCONIST,<br />\nBOX TRADE A SPECIALTY<br /><br />\nAND PERIODICALS.<br /><br />\nDrovers &amp; Mechanics National Bank of Baltimore.<br />\nSurplus 1111(1 Profits, $350,000<br /><br />\nCapital.Stock $300,000.<br />\nTRANSACTS<br /><br />\nMANAGER.<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br /><br />\n833 MADISON AVENUE<br />\nSTATIONERY SUPPLIES<br /><br />\nSala<br /><br />\nTEMPLE•<br /><br />\nMASONIC<br /><br />\nCLINTON P. PAINE<br /><br />\nBALTIMORE, MD.<br /><br />\n300 N. HOWARD ST.<br /><br />\nMUELLER,<br /><br />\n5 WEST LEXINGTON ST.<br />\n( LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br /><br />\nA GENERAL BANKING BUSINESS.<br /><br />\naa and<br /><br />\naio.res<br /><br />\nWayward:<br /><br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br /><br />\n1/<br />\n'<br />\ne.<br />\n'AO?<br /><br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, Assit Cashier.<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\nMORITZ MOSZKOWSKI,<br />\nMANUFACTUFIER OF<br /><br />\nA. H. FETTING,<br />\n14 AND<br /><br />\n16<br /><br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br /><br />\n6reelt teller 'fraternity<br />\nJewelry.<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br />\n\"It has it full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br /><br />\nST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\nC.<br /><br />\nNEW YORK TO BREMEN,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nor<br /><br />\nw<br /><br />\nFor particulars apply to<br /><br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br /><br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nBALTIMORE TO BREMEN<br />\nDIRECT,.<br /><br />\niat<br /><br />\nie SURETY BONDS<br /><br />\n321 N. Howard Street.<br /><br />\nH. Hildebrandt &amp; Son, Sole Agts.<br /><br />\nthe<br /><br />\nKranz-Smith<br /><br />\n'Fidelity and Deposit Company of Maryland,<br /><br />\npiano CO.<br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br /><br />\nChickering, Bradbury and Webster<br />\n*it Pianos. *It<br />\nC. &amp;P. Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nBARTL,E11-1\", 1-11AYWAFZID etc CO.<br /><br />\n• founders and Engineers, ••<br />\nWorks. Pratt and Scott Sts.<br /><br />\nOffice Calvert and German Ste.<br /><br />\nManufacturers ofCust and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Arest Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, PuriBeams and Beam<br />\nfiers, Condensers, etc. Columns, Plates, Girders,<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br /><br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES,<br /><br />\nEDWIN WARFIELD,['rest.<br />\nmet Viee-Presit, H. Crawford 111111k.<br />\nJos. It. Stonebraker.<br />\n\"<br />\n2nd<br />\nThos, A. Whelan.<br />\n\"<br />\n3rd<br /><br />\nII. B. DOSI.diR, See'y-Trea,.<br />\nharry Nicodemus,<br />\nAsN't Seey-Treas<br /><br />\nBOOKS<br /><br />\nOld and<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. PIPPEN.<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\nAttachments for<br />\nAutomatic<br />\n,<br />\n44 Angelus'<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br />\n201-203 N. CHARLES STREET<br /><br />\n\"Washburn\"<br /><br />\nLUNCH ROOMS!<br /><br />\nHARRY T. IVIUDD'S<br /><br />\nTHE DRuip<br />\n1..10 HT LUNCH ROOM,<br /><br />\n122 NORTH HOWARD STREET,<br />\nOYSTER<br /><br />\nIN ALL STYLES,<br /><br />\nYouft PATRONAGE SOLICITED.<br /><br />\nSMITH, DIXON &amp; CO.<br /><br />\nL<br /><br />\noc PAPER oe<br />\n29-31<br /><br />\n311 N.CHARLES<br />\nitlZatie<br /><br />\nB.. CHARLES BIT._<br /><br />\nLAGER BEERS<br /><br />\nGlobe<br />\nBrewery<br /><br />\nOoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market<br /><br />\nJ. \\N'in. Middendorf.<br /><br />\nIt.(di,<br /><br />\nMIDDENDORF OLIVER &amp; CO.<br /><br />\nBankers and Brokers,<br /><br />\ne<br /><br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Telephone 2060<br /><br />\n1'. Telephone 1060<br /><br />\n6ifts for<br />\nBrides<br /><br />\nSilversmiths.<br /><br />\nI INS,<br /><br />\nBohemian<br />\nROCHESTER BEER- Bavarian<br />\nTRADE MARS.<br />\nBALTIMORE<br />\nfnaerzen Brau<br />\n• BRANCH -f<br />\n217-239 SAENTRAL AVE<br />\nApollo<br />\nU CRO • IA<br />\nis THE<br /><br />\n• ORIGINALAND FAMOUS e<br /><br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\nMD.<br /><br />\nIN GREAT VARIETY<br /><br />\n218 N. CHARLES ST.<br /><br />\nBARTHOLOMAY'S<br /><br />\n-• MANAGER • •• •<br /><br />\nESTABLISHED 1879.<br /><br />\n.11AC01131 .1* ./ I<br /><br />\nROCHESTER,N. Y.<br /><br />\nGEO •C•S<br /><br />\n2015 EAST GERMAN SMRSEI',<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br /><br />\nWedding SilverII<br /><br />\nBartholomay Brewery eo.<br /><br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\nATLANTIC TRANSPORT CO.<br /><br />\n4.03-409 WATER ST.<br /><br />\n1 BROADWAY<br /><br />\nBALTIMORE.<br /><br />\nHENDERSON'S<br /><br />\nNEW YORK,<br /><br />\nLawrence It. Kemp, President .<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br /><br />\nWilson Keyser, Cashier.<br /><br />\nC0111111ERCIfIL &amp; FARMERS NRTIONRL BANK,<br />\nHOWARD<br /><br />\nAND<br /><br />\nGERMAN<br /><br />\nSTREETS,<br /><br />\nBALTIMORE, MD<br /><br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLI ES.<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS,<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTHEO. WARNER,<br /><br />\nJAMES<br /><br />\nUMBRELLAS, CO HATTERS, CD<br />\nHIGH GRADE<br /><br />\nGooDs Low<br /><br />\nPRIeES.<br /><br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\nphotographs<br />\nimmimmisom<br /><br />\nSUCCESSOR TO CUMMINS<br /><br />\n20<br /><br />\nWEST<br /><br />\nL.,1 T. X IINOTOIN<br /><br />\nSTREET.<br /><br />\n•PLCIAL DISCOUNT TO STUDENTS.<br /><br />\nPAINE.<br /><br />\nCANES, ETC<br /><br />\nAgents for Lincoln &amp; Sennett and Walter Barnard,s London Hats.<br />\n324 W. BALM MORE STREET.<br />\nMANUFACTURERS OF<br /><br />\nOPKINS CAPS.<br /><br />\nSilk and Cassimere Hats.<br /><br />\nligenfritz<br />\nStudio.<br /><br />\nR.<br /><br />\nWARNER.8c CO.<br /><br />\ncompanu<br /><br />\ng, BOOKSELLERS At,.<br />\n9<br /><br />\nSTATION ERS.<br /><br />\n34 W. BALTIMORE STREET<br />\nSCHOOL, LAW. MEDICAL. CLASSICAL AND MISCELLANEOUS BOOKS.<br /><br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman's College of Balt°.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\n111ELJEIN M. HOL,L,YDAY,<br />\n600 N.<br /><br />\n1.4.:,u^r...kw<br /><br />\n•ALTIMORE, MD.<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks 'Bought, Sold, and Exchanged.<br /><br />\nAnheuser-Busch<br />\n- Brewing Ass'n<br /><br />\n-nu<br /><br />\nYou get the benefit of<br />\nall thislabor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logne.<br />\nC.:HAS. M. STIERIP.<br />\nN. Liberty St., Baltimore, Md. 521 nt 11 St. , N. W., Washington, 1). C.<br /><br />\nPiANos<br /><br />\nB. G. EICHELBERGER,<br /><br />\nSt. Louis, Mo.<br /><br />\nBOOKS ANL) STATIONERY,<br /><br />\nBrew the Best Beers<br />\nin the World.<br /><br />\nENGRAVING AND STAMPING<br />\nNo. 308 North C1-1,<br />\nStre.et,<br />\nY. M. C. A. BUILDING,<br /><br />\nSALTIMOI, SRANCH:<br /><br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. &amp; P. Telephone<br />\n2314.<br /><br />\nC.&amp; P. Telephone 2351.<br /><br />\nSTONEBRAKER BROS.,<br />\n21? E. Baltimore St.<br /><br />\nBALTIMORE, MIL<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br /><br />\nFORD'S!<br /><br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br /><br />\n-THEgr<br /><br />\nTHEATRE OF BALTIMORE.-10<br /><br />\nJAN. 7,<br />\nONE<br />\nWEEK<br /><br />\nBERTHA OALLAND<br />\nIN TILE \"PRIDE OF JENNICO.\"<br /><br />\nJAN. 14.<br />\nONE<br />\nWEEK.<br /><br />\nLEM M ERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br /><br />\n'doC<br />\n.<br /><br />\nNIXON &amp;<br />\nZIMMERMAN'S<br /><br />\nANDREW NIA46:4C<br />\nIN HIS NEW PLAY \"THE REBEL.\"<br /><br />\nACADEMY OF MUSIC!<br /><br />\nWEEK OF<br />\nJAN. T.<br /><br />\n•••••<br /><br />\nyee,<br /><br />\n1-712AN4.:18 WILSON<br />\nIN \"THE MONKS ()I: MALABAR.\"<br /><br />\nWEEK OF<br />\nJAN. 14.<br /><br />\notr<br />\n;<br />\n4:<br />\n11<br /><br />\nJOHN DREW<br />\nIN \"RICHARD CARVE!..\"<br /><br />\nLEM M ERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br /><br />\nLEM M ERT.<br /><br />\n14 E. FAYETTE STREET.<br /><br />\nS<br /><br />\nPECIAL<br /><br />\nSPACE TO LET.<br /><br />\nDISCOUNT!<br /><br />\no<br />\no<br />\no<br />\n0<br /><br />\nTo the Students and Nurses of Johns Hopkins we will make a<br /><br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n9Y, JEPPRES ,STUDIO, w<br /><br />\nl.0<br />\nOS<br /><br />\nvioLiikpFEL e Bk.-17,EL<br /><br />\n,s the<br /><br />\nnoblest part of your %<br /><br />\ne,Parn°1v<br />\nocrtitls)ya=r<br />\n1.)<br />\n1(ri)c<br />\ni--- \\<br />\nCi,:.441<br />\ndeYarnilm<br />\ning OUR HATS.<br />\n0<br /><br />\nMINOR'S,<br /><br />\nUP-TO-DATE,<br /><br />\n*<br /><br />\nco:<br /><br />\nB.<br /><br />\nII<br /><br />\n* Mandolins *<br /><br />\nSIR,<br /><br />\nVA 218 NORTH EUTAW STREET,<br />\n'4t't<br />\nONE PRICE.<br />\n‘...<br />\n0<br />\nrOZZi..,<br />\n,<br />\ne<br />\n4eZe..-,e.,,<br />\ne,zzz,»:._<br />\n,,<br />\n,<br />\n,i,,azezazezzzrzezawazise<br /><br />\nBALTIMORE, MD.<br /><br />\n108 N. CHARLES STREET.<br /><br />\notni HEAD<br /><br />\nMANDOLINS, GUITARS anal BANJOS<br />\n\"have a tone<br />\nThat's all their own.\"<br /><br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br />\nNEAR SARATOGA ST.<br />\nOPEN<br /><br />\nGUITARS AND BANJOS.<br /><br />\nINSTRUMENTS TAKEN IN<br /><br />\nEVENINGS.<br /><br />\nEXCHANGE.<br /><br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nJ. SMITH,<br />\nNMUNATROHNSONMESIEWNWANTOMME,TRWROSTMT<br />\nOunler Iii<br /><br />\nBOOI\n<br />\nOld sitic.1 IN'<br /><br />\nMURIZONOTROSMENVONTATAMPANNMETOMMETO<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br /><br />\n125 EAST, NEAR CALVERT STREET.<br /><br />\nCHRCASCCC000[11“);<br />\nCOLLARS.<br /><br />\nGLOVES.<br /><br />\nCUFFS<br /><br />\nS<br /><br />\nBRACES.<br /><br />\nTON E Bppoi r,<br />\n-77711- ;-7, 401.11,- L.•-<br /><br />\n. , ip<br /><br />\nio,<br />\n.<br /><br />\n: r, 4.,<br /><br />\n• ,,,),/ ,c,-)<br />\ni ' , •.<br /><br />\n, n , \\I<br /><br />\nu<br />\ns<br />\n.<br />\n,:<br />\ny<br /><br />\nzI7E.BALTO.E,.<br />\n--MD.<br /><br />\nBALTIMORE, MD.<br /><br />\nUMBRELLAS.<br /><br />\nCANES.<br /><br />\nEORE<br />\nTIES.<br /><br />\nETC.<br /><br />\nNovember 7th, Iwo.<br />\nWhile visiting the Paris Exposition of 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by ouf•representative, who secured some very fine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lalitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard &amp; Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all OfIley Forrester &amp; Co.'s exhibit; it very old, strictly<br />\nIflue, rich, medicinal Port mine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br /><br />\nt) /<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br /><br />\nIG\"----<br /><br />\nBALTIN10RL<br />\n99<br />\ni<br />\n'<br />\nC5- ----=----5)(4--------,)---- 1<br />\nCs----_—.0<br /><br />\nSTONEBRAKER BROTHERS,<br />\n0.-------9q--J<br /><br />\n217 E. BALTIMORE ST.,<br /><br />\nBALTIMORE, MD.<br /><br />"}], "field_media_file": [{"target_id": 36170, "display": null, "description": null, "target_type": "file", "target_uuid": "fdd1ed73-3f75-4b4f-bece-933cabd40e38", "url": "http://digital.library.jhu.edu/system/files/2022-03/12160-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12160, "target_type": "node", "target_uuid": "559d5bbf-4df3-49fc-be58-57619fa02638", "url": "/node/12160"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "893213ba-031a-4173-abc3-ea37e113c269"}]}