{"mid": [{"value": 35674}], "uuid": [{"value": "599ec069-182f-4276-9262-d3cbc0adef38"}], "vid": [{"value": 35674}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12214-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ".<br />\n<br />\nt<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORK, MD.<br />\n1.<br />\n<br />\nTwenty Shah Year.<br />\n<br />\nBen Inning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n<br />\n.<br />\n<br />\nI It A REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Phitosophy and the Arts. (Courses for eltIlli{(1ates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;coursm for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n04<br />\n<br />\n•<br />\n<br />\n100,000 volumes.<br />\n115,000 colonies.<br />\n21,0.001 volumes.<br />\n<br />\n•<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy.<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,Physiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\n<br />\nDirectors.<br />\nIra Bentsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mat.<br />\nWilliam II. HmeciI.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\nIflreetore.<br />\nBasil L. Gildersleeve.<br />\nKirby to. Smith.<br />\nMaurice Bloonviefel<br />\nPaul Haupt.<br />\nHenry'Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent,<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nHistory,:<br />\n<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n<br />\ns.<br />\n4.<br />\n5.<br />\n6.<br />\n/.<br />\n<br />\nClassical (the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Biological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(leading up to Law.)<br />\nModern Languages.<br />\n<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics (vol. X XIV.)<br />\nIra Benisen.<br />\nChemistry (vol. X X VII.)<br />\nBasil L. Gildersleeve.<br />\nPhilolog (vol. XXIII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XX.)<br />\nModern 1.angliages (vol. XVII.) A. Marshall Elliott.<br />\nWittiam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt..<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. VI.)W.H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate Btudents in Philosophy and the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY. Editor. Quarterly. 4to. Volume XXIV<br />\nIn progress. $5. per volume.<br />\nII American Chemical Journal.<br />\nI. ItEMSEN,Editor. Monthly. 8yo. Volume XX VII<br />\nin progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\n13.<br />\n'<br />\nB. L. GILD KRSLICEVE, Editor. Quarterly. 81<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5, per volume.<br />\nV.<br />\nStudies in Historical and Politleal Science.<br />\nMonthly live<br />\nSeries XX in progress. $3. P°1volume<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin prog-ess ii Baltimore. 4to. Vol X X1 in progress. $1. per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly 4t0.<br />\nVolume XIII in progress. $1. per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume I<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,et°1<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. r.50<br />\nper volume.<br />\nX I. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volfline<br />\nXVII in progress. $1.50 per volume.<br />\nX I. Journal of Experimental Medicine.<br />\nW. Ii. WELCH., Editor. Hi-monthly. 8v0. VolU<br />\nVi in progress. $5 per volume.<br />\nXIII. American Journal of' Insanity.<br />\nHENRY M. HURL), Editor. Quarterly. 4to.,0 Per<br />\nvolume.<br />\nIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nN. V. Terrestrial Magnetism and Atmospheric Elee\"<br />\n.<br />\ntrinity.<br />\nL. A. BAITER, Editor. Quarter'''<br />\n8v0. VolumeVI Fin progress. V.60 per volume.<br />\nxV11. Annual Report.<br />\nPresented by the President of the Board of<br />\ntees, reviewing the operationm of the UniveraitY<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and statiny<br />\nthe regulations, etc., of the University.<br />\nRated at the close of the academic year.<br />\nIn addition to the serials above named,copies Mal be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the<br />\nTestament. Edited by Prof. Paul Haupt. Prospe°<br />\ntus on application.<br />\nRowland's Photograph of the Normal Solar Speetrniii•<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. .T. S. Billings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the A postlem. Complete Pic-simile °di1.0<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4i'°'<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by t. H. Hall. $8.00<br />\n.<br />\nparts<br />\nRibliographia Hopkinsienais. Part I. Philology. ,<br />\nThrts<br />\n11-111. Chemistry, Mineralogy and Geology. \"<br />\nIV-V-V I.Physics, Astronomy and Mathematic.'<br />\n8 vo. 30 cents per part.<br />\nIl full list of publications will he sent on application.<br />\nCommunications In respW to exchanges and ramikt4n045<br />\nmay be sent to Johls tiookins Press, Baltimore. rtld•<br />\n<br />\n\fLit-GROSSE NUMBER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nMAY 21, 1902.<br />\n<br />\nNo, 16.<br />\n<br />\nTHE MODERN THEORY AND TREATMENT OF TUBERCULOSIS.<br />\nEW persons outside of the medical profession appreciate the great devastation wrought annually by the one disease, pulmonary tuberculosis, or<br />\nconsumption, rightfully termed by Oliver Wendell Holmes as ''the great<br />\nwhite plague.\" It is estimated that about a million of persons are suffering<br />\nwith consumption in this country alone, of whom at least one hundred and fifty<br />\nthousand die annually. In our own city there are at present, according to the<br />\nmost reliable calculations, at least ten thousand persons suffering from consumption, with an annual death rate averaging over one thousand. Quotations<br />\nsuch as these, however, fail to make much of an impression upon the public,<br />\nbecause the average layman regards tuberculosis as a disease with which some<br />\nfamilies are unfortunate enough to be tainted; he thinks that its development is<br />\nsimply a family predisposition, that its prevention is impossible and that a<br />\nfatal result is always inevitable.<br />\nPresent facts, however, teach us that consumption is a dangerous, contagious or communicable disease, and that it is also a very curable disease<br />\nwhen properly treated in its incipient stage. We know now that consumption<br />\nis not of an hereditary nature, passed down from generation to generation. but<br />\nthat it is a directly communicable disease, being transmitted from one individual<br />\nto another, through the widespread dissemination of the germs known as tubercle bacilli. An individual suffering from consumption is estimated to expectorate as many as seven billions of bacilli in twenty-four hours. As long as<br />\nthe expectorations remain in the liquid state, there is little danger from them,<br />\nBut matter expectorated on the floor, in the street, or in a handkerchief, usually<br />\ndries very rapidly, and, becoming pulverized, finds its way into the respiratory<br />\ntract of any one who chances to inhale the air in which is floating this dust<br />\nfrom expectorations. Doubtless, each one of us every day of our lives inhale<br />\ntubercle bacilli in countless numbers; but when we are in good health, our<br />\nnasal muceous secretion possesses bactericidal qualities sufficient to destroy the<br />\nbacilli and prevent them from doing any harm. But if we allow ourselves to<br />\nbecome run down, with our powers of resistance lowered, the nasal secretion<br />\nloses its bactericidal powers and the inhalation of particles of dried and pulver-<br />\n<br />\n5<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nized tuberculous expectorations would result in a great risk of contracting pulmonary tuberculosis. It would seem, therefore, that any measures adopted by<br />\nthe Board of Public Health towards the proper care of and control of<br />\nthe poor, careless, and ignorant consumptive would be of inculcable benefit<br />\nto the public health and general hygiene of the community. I say careless and<br />\nignorant consumptives, because undoubtedly the chief sources of infection and<br />\nspread of the disease is due to the thousands of poor who are either too ill, too<br />\nignorant, or too indifferent to properly dispose of their sputum and thus render<br />\nthemselves no longer sources of contagion. Every municipality has seen fit to<br />\nprovide suitable accommodations for the unfortunate sick poor suffering from<br />\nvarious disorders. City hospitals afford them a fair opportunity for recovery,<br />\nor if the chance for this has passed, a decent place in which to die, with the one<br />\nexception of consumptives.<br />\nEvery general municipal hospital in the<br />\ncountry at present declines to admit consumptives to their wards, with<br />\nthe result that the multitude of unfortunates suffering from phthisis are<br />\neither left alone in their own homes to die from want and neglect,<br />\npitiable objects for both private and public charity, or else sent to further<br />\ncongest the already overcrowded almshouse. It is an unfair and unjust<br />\ndistinction of the equally worthy poor patients to afford one all the benefits of<br />\nour magnificent hospitals because he is fortunate enough to have any other disease than consumption, and to relegate the other to the pauper's home because<br />\nhe is unfortunate enough to have consumption. It is the purpose of every<br />\nmunicipal government to make generous provisions for whatever may be conducive to the well-being, protection and health of its people. Hence the erection of hospitals, asylums, and almshouse for the care and detention of sick,<br />\npoor, inebriates, and lunatics.<br />\nIn spite of these estimable institutions, does it not seem remarkable that<br />\nup to the present time, with few exceptions, no effort has been made on the<br />\npart of the Board of Health to care for or aid that class of sufferers whose affliction is unquestionably of the greatest possible menace to the health of the community, inasmuch as it is the cause of about one-tenth of the total annual mortality?<br />\nPersons interested in this subject have long ago agreed that proper care and<br />\nisolation of the poor consumptive is a most pressing and urgent need. The<br />\nerection of especial hospitals for the isolation of advanced cases, and the establishing of country homes for the treatment of those in the early stages of the<br />\ndisease, seem to be the only remedy. Every large city should have one or more<br />\nhospitals where hopeless cases could be taken, with the idea, not only of making<br />\ntheir last days on earth as peaceful as possible, but also of rendering them no<br />\nlonger sources of danger to their family and friends and a drawback to the<br />\nwage-earning capacity of the, remaining members of their families.<br />\nOf no less importance would be the building of several country sanatorio,<br />\neither in the suburbs, or else in some region of moderate altitude, where the<br />\nincipient cases could be sent and given a chance to recover their lost health.<br />\nAt present, physicians working in the free dispensaries, where the great major-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nity of pauper consumptives seek treatment, are absolutely powerless to do anything for them with the hope of affording permanent relief. We may prescribe<br />\nand often alleviate their most prominent symptoms; we may instruct them how<br />\nto properly dispose of their sputum and thus make themselves lesi dangerous<br />\nto their families. But we cannot give them the treatment they need, and we<br />\nare thus forced to see useful lives sacrificed which might be saved had we the<br />\nproper means at our disposal. To my mind, the multiple creation of institutions devoted especially to the consumptive will solve more than anything else,<br />\nthe difficult problem of how to reduce the mortality from tuberculosis and prevent its spread in general.<br />\nPrivate philanthropy has made a good beginning in Baltimore, but can<br />\naccomplish relatively little without further financial assistance, either from individual donation or from the city and state treasuries. The little hospital at<br />\nTowson is doing on a small scale what might be done on a very much larger<br />\none if more funds were forthcoming. The distressingly large waiting-list in<br />\nthe hands of the resident physician is the best evidence that larger institutions<br />\nof this character are sorely needed in Baltimore. During the past year, of fortynine cases admitted in all stages of the disease, fourteen were discharged with<br />\ntheir disease arrested and were able to resume work. These figures speak very<br />\nwell for what may be done in the very suburbs of our city in a small institution<br />\ncramped for money and struggling to care for as many unfortunates as possible.<br />\nMany sanatorio claim as many as 70 per cent. of cures when patients are admitted to treatment in the incipient stages; and I have reason to believe that these<br />\nfigures are correct; for pulmonary tuberculosis in the earlier stages is indeed one<br />\nof the most curable of diseases. The charitably disposed contribute considerable amounts yearly in one form or another for the destitute sick in their<br />\nmidst. The destitute consumptive, especially the advanced case, is the most<br />\nfrequent applicant for such aid as his is the most common disease. Is it good<br />\njudgment? is it economical, to expend the money in keeping him at his home, a<br />\nmenace to all around him, send him to the poorhouse already overcrowded and<br />\nunfitted for the hopeful treatment of such cases, or expend the same amount,<br />\npossibly less, in placing him in a properly equipped consumptive hospital?<br />\nSurely, here is a great chance for our philanthropists to aid their poor fellow<br />\ncitizens by the speedy erection of consumptive hospitals or by contributing to<br />\nthose already in operation- They will then not only help safely these unfortunates suffering from tuberculosis, but will render to the community at large<br />\nan incalculable service by thus inaugurating means for the prevention of the<br />\ndisease to which at present old and young, rich and poor, are falling victims<br />\nby thousands every year.<br />\n<br />\nWhy is it that a girl must have<br />\nA dried-up, dreary chaperon?<br />\nMuch better times she would enjoy<br />\nIn going with a chap alone.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nSOME EXPERT OPINION OF THE '02 LACROSSE TEAM AND<br />\nMAY 10th.<br />\nCOACH :—Hopkins never had a better team as a team. It was the best<br />\ngame, played by the best all-round team, I have ever seen. The work was<br />\nbrilliantly even; it took great team work to win, and that meant every man had<br />\nto be a star. If any one stood out above the rest, it was Abercrombie. His<br />\nvery presence gave the men confidence; and when he went into a \"mix-up,\"<br />\nHopkins was sure to get the ball. It will be many a year, I am afraid, before<br />\nHopkins can hope to duplicate the team of 1902.<br />\nWM. HARVEY MADDREN.<br />\nCAPTAIN OP THE '98 vARSITY:—The game with Swarthmore was certainly<br />\na rare treat for the spectators, and the team deserve much praise for the great<br />\ngame they played, one and all.<br />\nIt seemed to me that the catching of the attack men when closely covered<br />\nwas a noticeable feature, and all who have followed lacrosse at Johns Hopkins<br />\nmust have felt proud to see our team out-last the always well-trained Swarthmore men. The two points that seem to bear criticism are the fact that the<br />\nattack did not draw the defense men out when closely covered, and that there<br />\nwas too much throwing at random by some of the players in mid field positions.<br />\nI think the team is the most evenly balanced we have ever had, and one of<br />\nwhich every Johns Hopkins man should feel truly proud.<br />\nG. CANny ROBINSON, '99.<br />\n<br />\nCAPTAIN OF THE '00 VARSITY:—There was the fastest game of lacrosse at<br />\nAmerican League Park with Swarthmore on Saturday that we have seen for at<br />\nleast five years of my experience. It was game from beginning to finish.<br />\nSwarthmore was in the very best shape for team play, but Hopkins proved a<br />\nlittle better, The play through, was hard and quick.<br />\nIn fact, Baltimore has never enjoyed a keener contest.<br />\nRONALD T. ABERCROMBIE.<br />\n'00 ALUMNUS ATHLETIC DELEGATE:—Please extend to our lacrosse team<br />\nand to all friends of athletics at Hopkins my hest congratulations on the magnificent work of the season. I have followed the work of the lacrosse Men as<br />\nclosely as I could, at this long range, and it seems to me that the team must be<br />\nthe best in the history of Hopkins lacrosse.<br />\nI was greatly disappointed at the loss of the Relay, but that disappointment is now forgotten.<br />\nIf Hopkins can win such victories without her new campus or athletic<br />\nfield, what will she not be able to do at Homewood? Let the good work go on!<br />\nThe \"Has-beens\" are watching you.<br />\nALBERT M. REESE,<br />\nAlumnus Delegate to Athletic Board, 1900.<br />\nA CANADIAN AUTHORITY:—It was the best amateur game I ever saw.<br />\nNot even in a professional game have I seen cleaner passing. Then, too, there<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nwas no exhibition of selfishness. There is usually a desire on the part of one<br />\nor two star players to keep the ball most of the time, but the Hopkins team was<br />\nnoticeably free from such plays. I do not mean to say that the university boys<br />\ncould defeat the professional Canadian teams. The men on the professional<br />\nteams are much heavier, and all their time is devoted to lacrosse. But there is<br />\nthe same relation between the fastest college base ball and professional ball, as<br />\nbetween the Hopkins lacrosse team and the professional teams of Canada. The<br />\ngoal shooting did not seem to be as clean as it might have been; there was a<br />\ntendency to shoot too low. Instead of bringing the ball down the side of the<br />\nfield and then have one man lob it into the goal, as is the Canadian custom, the<br />\nHopkins men played more in the center of the field. Vet there can be no doubt<br />\nbut that the Hopkins team is the best in its class. I don't think I ever saw a<br />\ncleaner, better game.<br />\nREV. DONALD G. GUTHRIE.<br />\n<br />\nBETWEEN BELLS.<br />\n<br />\nAccording to rumor, a new organization will be the outcome of the base<br />\nball game with Georgetown. The object of the society will be to perpetuate<br />\nthe loyalty and unselfish devotion of the twenty-five students—graduate, mediical, and undergraduate—who attended the game.<br />\nThe seniors of the Woman's College last evening began their twilight singing on the steps of Goucher Hall. This will continue each evening until commencement day. (Daily paper.)<br />\nThe students of the University last week began their between-class \"nickel<br />\nPitching\" on the sidewalk of Little Ross Street. This will continue every day<br />\nuntil after examinations.<br />\nFriday of last week the Freshmen held a class meeting, at which it was<br />\ndecided to award numerals to LeCron and Porter for track work. A committee<br />\nwas appointed to arrange for a class entertainment at the end of the year. After<br />\nthe meeting dark rumors were set afloat that stringent measures were to be<br />\ntaken concerning hazing next year.<br />\nThe musical clubs made their last appearance of the season at the concert<br />\non Monday night of last week, when a benefit for the Lawrence House was<br />\ngiven in conjunction with the Woman's College Clubs. A substantial sum<br />\nwas realized from the 459 paid admissions.<br />\n<br />\nMATTHEW WOOD—Let me tell you a good story, about a man with a false<br />\nleg,<br />\nWALTER SHEARER —Cut it Out; no stump speech for me.<br />\nMATTHEW WOOD —Yes, but it's a corker.—Penn. Punch Bowl.<br />\n<br />\n\fTHE NEWS—LaTTUR.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of TEE JORWS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nMAY 21, 1902.<br />\nSubscription $1.50 per year.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\nEditor in Chief<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n.<br />\n<br />\nROBERT S. LANIER, 1903.<br />\n. HA.nliv K. TOOTLE, 1908.<br />\n<br />\n.<br />\n<br />\neut,omoN &um, 1908.<br />\nGEORUE A. FOSTER, 1904.<br />\nREGINALD S OpiE, 1904.<br />\nW. S. .BIRD, 1908.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n.<br />\n<br />\nAUBREY FEARER, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hop-<br />\n<br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to Aunta:v FEARER, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n011•1111MIMNOwntsrm<br />\n<br />\nUR COMMENCEMENT ISSUE, which follows this number, is the last appearance of the NEWS-LETTER for the scholastic year. There will be cuts of<br />\n<br />\nO<br />\n<br />\nthe athletic teams and their captains, and a next year's directory of the<br />\nBesides, a photograph<br />\nwill<br />\nboard<br />\ngrace<br />\nthe<br />\npages.<br />\nWith<br />\nthese<br />\nspecial features,<br />\nthe<br />\nNEWS-LETTER<br />\nof<br />\nwill<br />\nbe<br />\na<br />\nreview<br />\nUniversity, in<br />\nof<br />\nthe<br />\nyear's<br />\nachievements<br />\nat<br />\nthe<br />\nnumber<br />\nthe<br />\ncompact form and at small cost.<br />\nSome changes are contemplated in the make-up of the paper for next year.<br />\nSuggestions banded in to the editor will be thankfully received.<br />\ngraduating class, with portraits of the prominent men.<br />\n<br />\nARMONY<br />\n<br />\ng<br />\n<br />\nAMONG THE ATHLETIC TRAMS at the University has developed<br />\n<br />\nwonderfully in the past few years. At the City Championship meet, half<br />\nthe lacrosse team were running shoulder to shoulder with the track men,<br />\ntrying to gain an extra point for the 'Varsity By the nature of things, these<br />\ntwo teams have greatly conflicting interests, and it is encouraging to see Hopkins spirit on top. The third spring team is the base ball. Its attitude may<br />\nbest be seen by a reference .to Captain Campbell's letter, which appears on<br />\nanother page. Lest it should seem to be a little out of touch with its companion teams, the reader should remember the \"condition of probation,\" as the<br />\n'02 Hullabaloo puts it, in which the team finds itself. The Athletic board, at<br />\nits late meeting, did not overlook the faithful and hard work done by the pro-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\nmoters of the game; but it held that its own scanty financial resources, coupled<br />\nwith the lack of wide-spread interest among the students themselves, rendered<br />\nit impossible that the national game should be recognized at present in the<br />\nUniversity.<br />\n<br />\ne<br />\n<br />\nLIE OVERWHELMING DEFEAT OF HARVARD by the Hopkins Lacrosse<br />\n<br />\nTeam has always seemed to us a fact calling for more explanation than<br />\nhas yet been given. And here it is, from the Harvard Crimson:<br />\n\"Of the four games played by the lacrosse team during its southern trip,<br />\nthree were lost and one was tied. The showing made by the squad, however,<br />\nwas not so unfavorable as this would seem to indicate, because new men only<br />\nwere taken on the trifi, and also because in the game with Johns Hopkins University three players were unable to play on account of injuries. The score in<br />\nthis game was 11 to 1. * * On the basis of the work done during the trip, a<br />\nUniversity team will be picked this week, and on Saturday will play the first<br />\nregular game of the season with the College of the City of New York. * * \"<br />\nThe italics in this quotation are our own. It was with a sense of temerity<br />\nthat we set about correcting the statements of a college paper so far outdistancing us in age and size; but the occasion is tempting, and the evidence at hand.<br />\nIn last year's game with Harvard, we find, among the names of the twelve<br />\ncrimson wearers, the following six: Chaffee, Stevenson, Hoquet, Alvord,<br />\nMichell, Goddard. In this year's game with Harvard, we find, among the<br />\nnames of the crimson wearers, the following six: Chaffee, Stevenson, Hoquet,<br />\nAlvord, Michell, Goddard. At the same time, five Hopkins men played against<br />\nHarvard this year who did not appear in last year's line-up.<br />\nLest there should be errors in the reports of fair Harvard's \"regular\"<br />\nrlacrosse games, just begun, we advise the editor of our great contemporary to<br />\ntad the daily papers before proceeding to nail the Crimson to the mast.<br />\n,<br />\n<br />\n'<br />\nZ HE 1902 HULLABALOO, which the careworn Editor-in-Chief announces for<br />\nThursday (to-morrow), shows the result of much lively \"hustling,\" and<br />\nis a very creditable piece of work. The aim of the editors has been t<br />\nas much representative of the whole college as possible—a book of<br />\nit<br />\nmake<br />\nreference for every phase of Hopkins life. In this connection, they have given<br />\na list of Hopkins songs much fuller than in preceding editions, which constitute<br />\na welcome feature.<br />\nThe cover is a pleasing combination of University and class colors; the<br />\nbody black and blue, the lettering in white, making the blue and white of '02.<br />\nThe University seal in gold is also shown. The leading article, by President<br />\nRemsen, is entitled \"Reminiscences of Dr. Rowland,\" and contains some<br />\namusing tales of their intimacy on fishing expeditions and the like. Ex-President Gilman also contributes an article on research at the University.<br />\nThese and the other stock features of the book, are, of course, less interesting to the undergrad than the \"stunts.\" Among these will be noticed the<br />\nfurther development of the Hopkins Girl. She is shown as a Class Girl, an<br />\n<br />\n\f8<br />\n<br />\nTHE<br />\n<br />\nNEWS-LETTER.<br />\n<br />\nAthletic Girl—in seven roles altogether, and attractive in all. The series of<br />\n\"Trophy Room Talks\" will be enjoyed by all who fancy they recognize the<br />\n\"kicker,\" the \"poet,\" and the \"chronic jollier.\" The editors consider, indeed,<br />\nthat the \"roasts\" and \"grinds\" have been distributed so universally and impartially that no one can have cause of complaint.<br />\nThere are minor defects in the book, such as the use of a quotation \"the<br />\nmildest-mannered man,\" cribbed from the '01 book, or slips in proofreading<br />\n(the Hopkins-Gettysburg game is given: \"J. H. U., 0; Gettysburg, 2.\") But it<br />\nis a production worthy of the University, and an improvement over its<br />\npredecessors, as every class book should be.<br />\n<br />\nTo the Editor of the NEWS- LETTER :<br />\nThe base ball season of 1902 has closed. Doubters and scoffers had said<br />\nthat it was impossible to maintain a team. It was found, however, to be comparatively easy. The chief obstacle that was encountered was the prevalence<br />\nof wet weather for a time around Easter. The promoters and members of the<br />\nteam are delighted with their success. The organization was complete, the<br />\ntraining and practice iegular, obligations were met, engagements fulfilled,<br />\nand<br />\na creditable showing made. The team played three games against competit<br />\nors<br />\nthat were quite out of its class, and thereby subjected itself to defeats in a manner that is usually avoided by Hopkins teams. But only satisfaction can be expressed at the re establishment of intercourse between Hopkins and<br />\nthe Naval<br />\nAcademy. This is an accomplishment of the base ball team. Because<br />\nof the<br />\nfaithfulness and devotion of the men, and the heroic efforts that they<br />\nhad made,<br />\nit was proposed before the Athletic Board to give the team recognition,<br />\nthe claim<br />\nbeing made (which is unquestionably true) that they had done<br />\nquite as much<br />\nhard work for Hopkins as a foot ball team does. The Board, however<br />\n, was<br />\ndisinclined to take any favorable action. This, many think, was a<br />\nmistake.<br />\nThe base ball team had certainly earned recognition. And further,<br />\nthe action,<br />\nor want of action, would indicate that Hopkins does not encourage her sons<br />\nto<br />\nexert themselves in her behalf. But this surely cannot be true;<br />\nthe injustice<br />\nwill soon be corrected.<br />\nR. J. G. McKnight has been named by the men as captain for next<br />\nyear,<br />\nand J. N. Numsen as manager. At least five, and probably seven,<br />\nof this years'<br />\nplayers will return. These men will form a splendid nucleus. Quite<br />\na little<br />\ninterest was manifested in the undertaking this year, and by next spring<br />\nthe<br />\nmovement will have gained more momentum and more intrinsic attractio<br />\nn.<br />\nThose who uphold the \"cause\" are alive to their duties and their opportun<br />\nities.<br />\nThey are ready patiently to contend against obstacles, prejudices,<br />\nindifference,<br />\nopen and secret antagonism. It appears that Hopkins will no longer<br />\nhave to<br />\nbear the reproach of not being able to support a base ball team.<br />\nTo all those who during these strenuous times have given their good<br />\nwill,<br />\nor friendly aid, I express a sincere gratitude.<br />\nJOHN G. CAMPBELL, '02.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n'<br />\n,:li,11111111111111111i11011111:1111111iiiiii11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111i111111111111111111111111111111111111111111111111111111111t111111114:<br />\n. ,.yii :•,.... _......- ,.,...;t:!.,,,, ,,,,:..4,7„:,:,.,<br />\n.: ?:,-,,...,-kf.....:-..- ....J....,4-,<br />\n,<br />\n•','<br />\n-:-._.<br />\n-s a<br />\n;. .,.<br />\n<br />\n'...<br />\n<br />\no 11401.°-`11allazia\".4...am 0<br />\n,<br />\n0<br />\n1. 1210i3[161ellaii<br />\nIti............-0..—.....<br />\n<br />\ncm<br />\n<br />\nP<br />\nCC'<br />\n<br />\nIliliiiiii<br />\n<br />\n'A110111111111111111111114 1'11111,11M 1111111.111111111111111111111111'1,1 ,1,11111111111111111111111111111111 1111111111111 1111111111111111111111111=1111111;i1;111111i111-11.1:;'.. ,rd.;<br />\n<br />\nR. PAUL HAUPT sailed for Europe on the 7th of this month. He will<br />\nspend most of the summer pursuing his oriental studies at Oxford and<br />\nCambridge, and later will attend the meeting of the International Society of<br />\nOrientalists at Hamburg as a delegate from the American Oriental Society, and<br />\nfrom the Hopkins. During his stay in Germany, Dr. Haupt, together with<br />\nDr. Gilman, will attend the wedding of Prof. Henry Wood.<br />\nA new surgical building, costing $100,000, will soon be erected at the<br />\nMedical School on the ground upon which the amphitheatre now stands.<br />\nMaryland's industrial geological exhibit at the Charleston Exposition received twenty-two prizes. This fact is of interest on account of Dr. William B.<br />\nClark's close connection with the exhibit.<br />\nDr. J. W. Bright, director of the English department, will shortly have<br />\npublished a revised second edition of his '`Anglo Saxon Reader.\" This book<br />\nis conceded, not only by American, but also by English universities, to be the<br />\nbest work on Anglo-Saxon grammar which exists.<br />\n\"The Role of the Toxins in Inflammations of the Eye,\" is the title of the<br />\nessay for which Dr. Robert L. Randolph, associate professor of ophthalmology<br />\nand otology at the Medical School, has been awarded the Boylston prize by<br />\nHarvard University.<br />\n<br />\nALUMNI NOTES.<br />\n<br />\ne<br />\n<br />\n014. Ned Arden Flood, '90, is president of the Western Pennsylvania<br />\nAlumni Association, which held its banquet at the Hotel Henry, Pittsburg, on May 3.<br />\n<br />\nMr. Noel deL. Purcell, '00, will sail for Europe on the 7th of next<br />\nmonth.<br />\nDr. N. F. Dorsey, formerly instructor in the physics department and now<br />\nin the government service at Washington, paid a short visit to the University<br />\non the 7th.<br />\nThe class of '99 held its reunion at the Johns Hopkins Club on May 10.<br />\nIt was decided to erect a tablet to Joshua Levering and Charles Gaddess, two<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\n<br />\nmembers of the class who have died since graduation. The following class<br />\nofficers were elected: President, W. M. Kruger; vice president, Geo. W. Knapp,<br />\nJr.; secretary and treasurer, Chas. C. Downes.<br />\n\"Under Two Flags,\" Miss Blanche Bates's play, is of especial interest to<br />\nHopkins men owing to fact that the part of Rake, the valet, was taken by an<br />\nold Hopkins student, Mr. Parkin Duvall. Mr. Duvall studied at the Hopkins<br />\nfrom '85 to '87. He has played with several prominent companies of this<br />\ncountry, and at one time was dramatic critic in London for the New York<br />\nHerald and World.<br />\nDr. John Montgomery West, who graduated at the Hopkins Medical School<br />\nlast June, and Mr. Augustus P. West, at present a graduate student in chemistry, sailed for Germany on the 13th. Dr. West will study for a year and a<br />\nhalf at some of the leading German universities, but Mr. West will return to<br />\nthe University in October.<br />\n<br />\nTO INVESTIGATE LABOR CONDITIONS.<br />\nCITIZEN of Baltimore, who desires that his name shall not be made public, has given a sum of money to the University to be devoted to a systematic investigation of the history, activities and influence of labor<br />\norganization in the United States. The sum of five hundred dollars is given for<br />\nthe immediate purchase by the University library of additional books, journals<br />\nand reports relating to this subject. The further sum of one thousand dollars<br />\nis made available to meet the expenses incident to carrying on the inquiry for<br />\nthe next academic year.<br />\nThe investigation will be conducted by the Economic Seminary, under the<br />\ndirection of Dr. J. H. Hollander, Associate Professor of Finance. It will begin<br />\nin October, 1902, and extend over such period of time as may be warranted by<br />\nthe extent of the inquiry and the definiteness of the results attained.<br />\nA preliminary organization of the Seminary will be effected before the close<br />\nof the present academic term; certain preparatory work will be assigned its<br />\nmembers for the summer recess, and a working plan will be prepared and<br />\nadopted—so that the investigation may proceed promptly when actually begun.<br />\nIt is proposed that the investigation shall start with an inquiry into certain<br />\nof the more concrete aspects of the labor question. The immediate environment<br />\nwill first be studied, after which conditions in other typical communities will be<br />\nexamined until sufficient data for reasonably safe generalizations have been<br />\nattained. A number of such specific inquiries will ultimately prepare the way<br />\nfor a more comprehensive survey of the nature and functions of labor orga n<br />\nizatious in the United States. '<br />\n<br />\n4<br />\n<br />\nSua—\"Ping Pong is such a noisy game.\"<br />\nH*—\"Well, you simply can't play it without a racquet.\"—Princeton 74er..<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nTrack and Field.<br />\nInvitation games of the Washington Y. M. C. A.<br />\nMAY 24.<br />\nMAY 30-31. Intercollegiate Amateur Athletic Association (championship) at New York.<br />\nWestern Maryland College Games at Westminster.<br />\nJUNE 7.<br />\n<br />\nLacrosse.<br />\nAfter JUNE 4. Cornell (?)<br />\nAfter JUNE 11. University of Toronto (?)<br />\n<br />\nTRACK AND FIELD TEAM WINS THE NEWS CUP.<br />\nHE victory of our lacrosse team over Swarthmore on May 10 seemed to<br />\nshow the track and field men just how a championship should be won,<br />\nfor on the following Wednesday, May 14, they carried off the Baltimore<br />\nNews Championship Cup in great style. The complete victory over the Maryland Athletic Club, whose members, by the way, were predicting the downfall<br />\nof Hopkins, may best be shown by the following figures:<br />\nJohns Hopkins, 60 points; Maryland Athletic Club, 36 points; Central Y.<br />\nM. C. A., 8 points; St. Leo's Gymnasium, 6 points; Baltimore Athletic Club,<br />\n<br />\nt<br />\n<br />\nU points.<br />\nThe foregoing statistics plainly show what Hopkins accomplished in open<br />\nscratch games against the fastest athletes in Maryland. Our men scored more<br />\npoints than all the other competitors combined, and won the surprisingly large<br />\nnumber of twenty-four places in the ten events on the program. In two events,<br />\nthe 220 yard dash and the running high jump, Hopkins won all four places,<br />\nwhile three wearers of Black and Blue made points in several others.<br />\nThe quarter mile run, in which \"Joe\" England clipped 2 1-5 seconds off<br />\nthe State record, was undoubtedly the prettiest race of the day. Our captain<br />\ntook the lead at a furious pace from the start, and was never headed. The speed<br />\nwith which the men rounded the curve before reaching the home stretch caused<br />\nmany of the spectators to predict a slow finish, but \"Joe\" had calculated his<br />\npowers of endurance to a nicety, and held the pace until he broke the string.<br />\n\"Billy\" Weedon stepped up with a big surprise for even his fellow athletes.<br />\n\"Bill\" has always been calculated to win medals for \"Tom Hopkins,\" but his<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ngraduate work made it impossible for him to train to any extent for the games,<br />\nand when he catne in for two gold medals and a bronze one, probably nobody<br />\nwas more surprised than \"Billy\" himself. He \"made Rome howl\" on the<br />\nhome stretch in the 220 yard dash, and outdid George Scholl in the high jump,<br />\nbesides following Klinefelter and Green closely in the running broad jump.<br />\nIn the mile run, Porter started off at a nice pace, and held it throughout.<br />\nHad he not sprinted quite so soon, it is likely that he would have outdone Randall after all.<br />\nPessagno and Tootle gained first and second places in the 100 yard dash in<br />\ngreat style, more than holding their own against old, experienced men like<br />\nBlome and Requardt. They will both he with us next year, and promise to<br />\ncontinue the good work for the University.<br />\nHarvey Stone gained us three points in the shot put, and deserves a sound<br />\nslap on the back for outdistancing such men as Heyden, Kell and Barrett.<br />\nThe NEWS-LETTER wishes to congratulate both Captain England and<br />\nPhysical Director Mackdermott, for the success of our team. To them the victory is largely due, for the men were all in top-notch condition and not a single<br />\nHopkins runner made a ragged finish. Good work!<br />\nThe summary, showing how Hopkins stood in the contests, is as follows:<br />\nOne hundred yard dash—Pessagno, first; Tootle second. Time, 10 3-5<br />\nseconds.<br />\nFour hundred and forty yard run—England, first; R. C. Hoffman, third;<br />\nRosenheim, fourth. Time, 51 4-5 seconds.<br />\nMile run—Porter, second; Rosenheim, fourth. Time, 5 min. 1 2-5 sec.<br />\nHalf mile run—England, first; Abercrombie, third; Riggs, fourth<br />\nTime,<br />\n2 minutes 11 seconds.<br />\nTwo hundred and twenty yard dash—Weedon, first; Pessagno, second; R.<br />\nC. Hoffman, third; Tootle, fourth. Time, 23 2-5 seconds.<br />\nShot put (16 pound)—Stone, second.<br />\nRunning high jump—Weedon, first, Scholl, second; Pessagno, third; Lawson, fourth. Height, 5 feet 84 inches.<br />\nHammer throw—Lawson, fourth.<br />\nRunning broad jump—Weedon, third; Pessagno, fourth.<br />\nPole Vault—Emig, third; Lawson, fourth.<br />\nIn only two events—the shot put and the hammer throw—did Hopkins<br />\nhave but one man placed, and in five out of the ten contests our men carried off<br />\nfirst honors. \"Not half so bad!\"<br />\n<br />\nHOPKINS 8, SWARTHMORE 2.<br />\n<br />\nZ<br />\n<br />\nHE game in which we won the intercollegiate championship from Swarthmore may almost be said to mark an epoch in the history of Hopkins<br />\nlacrosse, for never before has such an immense crowd shouted in such an<br />\ninspiringly vociferous manner in order to help the 'Varsity win another pennant.<br />\nThe very day for which every man, and Manager Slemons, in particular,<br />\nhad prayed, dawned on May 10, and at 1.30 o'clock the next morning when the<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nteam was giving \"Billy\" Maddren a rousing send-off at Union Station, it was<br />\ndelightful to note that everything else that day had been in keeping with the<br />\nweather.<br />\nOld and new men alike agreed in declaring the game the best they had ever<br />\nseen in Baltimore. Swarthmore was trained to the hour, and for the Hopkins<br />\nmen \"Father Bill's\" various remedies, and '`Mother Bill\" Schmeisser's black<br />\npills certainly did the work.<br />\n. As was predicted, there was no let-up from start to finish, and had Hopkins<br />\nnot been prepared to more than hold the terrific pace which Swarthmore set, the<br />\ntale might have been different. The result was that Hopkins slightly outdid<br />\nthe visitors, even in that heart-breaking first half, and in the second the<br />\nQuakers were downed decisively. At one time particularly, the 'Varsity took<br />\nthings on the jump and scored four goals in 5 minutes and 37 seconds. Such<br />\nwork against a team like Swarthmore has certainly never been equaled in the<br />\nhistory of Hopkins lacrosse.<br />\nIn speaking of the game upon the return of the team to the University,<br />\n\"Billy' Maddren said: \"By golly, boys, I'm glad I wasn't in that game, and<br />\ndo you know why? Just this, the pace was too fast. I could never have held<br />\nit.\"<br />\nApparently there was not a weak spot on the team, and every man con<br />\ntributed a generous share toward carrying off the honors.<br />\nThe first half started with a grand rush, and for 25 minutes the rooters and<br />\nor<br />\nenthusiastic friends were wholly unable to tell whether nervous prostration<br />\nbroke<br />\n'Bernie\"<br />\nlittle<br />\nlast,<br />\nAt<br />\ndeath.<br />\ntheir<br />\nof<br />\nexcessive joy would be the cause<br />\nthe terrible suspense by driving the first goal into the net. A few minutes<br />\nlater Putts repeated the operation, and, before the whistle blew, Beans scored<br />\none for the visitors, making the standing two goals to one.<br />\nThe second half found Hopkins thoroughly aggressive and somewhat faster<br />\nthan Swarthmore. The same rush marked the start, and in less than three<br />\nin genminutes Putts tipped the third goal into the net. Then things woke up<br />\nthan<br />\nless<br />\nin<br />\ngoals<br />\nfour<br />\nof<br />\nn<br />\nphenomeno<br />\nthe<br />\neral. Every man \"got busy,\" and<br />\nfine<br />\nthe<br />\nbut<br />\ngame,<br />\nfast<br />\na<br />\nplay<br />\nto<br />\ncontinued<br />\nsix minutes resulted. Swarthmore<br />\ncovered<br />\nBlanck<br />\nand<br />\nTough<br />\neffectively.<br />\nwork of our defense held them back<br />\nhack like race-horses, and both Schmeissers and Henry Straus did such terrific<br />\nbody checking that Swarthmore's home men literally lost their nerve. Briscoe<br />\nplayed a star game at goal, and handled with wonderful skill all kinds of fancy<br />\nshots which happened to escape the others. On the attack \"Aber\" was much<br />\nin evidence, and got off his usual clever \"stunts\" with little \"Bernie.\" Putts,<br />\nB. Bernheim and Sayler did remarkably clever work on the infield,<br />\n\"Did you win a prize at the Horse Show?\"<br />\n\"You bet I did. Will you he my best man.\"<br />\nJINGO — What's caused the row in the Younghub family?<br />\nhalf<br />\nBINGO —The better half discovered that she didn't know how the other<br />\nlived.—Harvard Lamfioon.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nBASE BALL.<br />\nHOPKINS 6, W. M. C. 1.<br />\n<br />\nt<br />\n<br />\nHE game of May 7th against Georgetown. in which Hopkins lost by the<br />\noverwhelming score of 24 to 1, served as an excellent preparation for the<br />\ncontest of the following Saturday at Westminster. In that game the playing of the Black and Blue reached the proper standard,—a consummation that<br />\nshould have been effected earlier and was hindered only by unavoidable obstacles. Western Maryland was fortunate in scoring. With Whipple pitching like<br />\nclock-work and Hopkins playing an errorless game, the result seemed never<br />\nin doubt.<br />\nThe first runs came in the third inning. McKnight reached first on a fumble by Henry. The next three men drew passes, and McKnight was forced in.<br />\nWright drove a hard one through Simpson and two more runs scored. In the<br />\nfifth inning with Moore and McKnight on bases, Campbell hit a safe one to left<br />\nwhich sent them both home. One more came in the seventh. Whipple singled<br />\nand advanced to second on Crozier's neat sacrifice. From there he scored on<br />\nMoore's beautiful two-bagger to center field.<br />\nWestern Maryland was saved from a shut-out in the eighth inning. Roberts was served up the wrong sort of a curve, and he promptly dropped the ball<br />\nover in the left field garden-patch. McKnight quickly leaped the fence, recovered the ball, and made an astonishing throw all the way into Moore's hand at<br />\nshort stop. Never before had such a feat been accomplished, and Roberts was<br />\nheld on third. From there he ran in on Brown's slow one to short. Brown died<br />\ntrying to steal second, and with him Maryland's hopes.<br />\nThe features of the game for Hopkins were McKnight's throw in the eighth,<br />\nand Moore's remarkable play at short stop. He accepted eleven chances without an error. Whipple pitched in his customary steady way and kept the hits<br />\nharmlessly scattered. For Western Maryland, Brown made the star play in the<br />\nninth inning when he scooped up with one hand a fast grounder past second<br />\nbase, and robbed Marine of a hit. Aydelotte pitched well, except for his wildness in one inning. Hopkins hits, however, came when they were needed, and<br />\nthereby clinched the game.<br />\nHOPKIN8.—Moore, Ft. R ; Marine, 3rd b.; McKnight, 1. f.; Campbell, c.; Constantine,<br />\n1st b.;<br />\nOgle, 2d b.; Wright, c. f.; Whipple, p.; Crozier, r. f.<br />\nW. AL c.—Williams, c. f.; Carman, r. f.; Roberts, c.; Brown,<br />\n2d b.; Simpson, 1st b<br />\nAydelotte, p.; Henry, 3d b.; Turpin, 1. f.; Moore, R. R.<br />\n<br />\nScore by innings:<br />\nJ H U<br />\n<br />\na.<br />\n<br />\nH.<br />\n<br />\nB.<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n3<br />\n<br />\n0<br />\n<br />\n2<br />\n<br />\n0<br />\n<br />\n1<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n(1<br />\n<br />\n4<br />\n<br />\n0<br />\n<br />\nW. M. 0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\n1<br />\n<br />\n0<br />\n<br />\n1<br />\n<br />\n9<br />\n<br />\n4<br />\n<br />\nUmpires, Prof. Holton, W. M. C., and N. F. Near, Jr.<br />\nAt the championship games of the Athletic Association at New York, May<br />\n30-31, the following wearers of the Black and Blue will probably participate:<br />\nJ. T. England, '02, (captain); Geo. B. Scholl, M.; W. E Hoffman, '02; R. C.<br />\nHoffman, '03; J. E. Pessagno, '03; W. S. Weedon, G.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nNEXT! CORNELL AND TORONTO!<br />\n<br />\nHERE is a possibility that our lacrosse season is not yet ended. News<br />\ncomes from Ithaca to the effect that Cornell returned home with the<br />\ninteruniversity championship cup, and that the next victim will he<br />\nHopkins.<br />\nFor the present, our men will be busily engaged in training for the game<br />\nwhich will begin in McCoy Hall, on May 30, and last until June 4. Should it<br />\nbe found possible to arrange a contest with the Ithacans after this ordeal,<br />\nanother victory may be added to our list.<br />\nThe most important contest in view, however, and in fact what would he<br />\nundoubtedly the greatest lacrosse game ever seen in Baltimore, is that which<br />\nmay possibly he arranged with the University of Toronto immediately after the<br />\nJune examinations. Toronto holds the intercollegiate championship of Canada<br />\nfor 1902, and is coming to New York about June 3 to play the Crescent Athletic<br />\nClub. Manager Slemons has received a letter from the management of the<br />\nCanadian twelve, congratulating Hopkins upon its success during the season,<br />\nchallenging us to a contest which shall decide the intercollegiate championship<br />\nof America, the game to be played either here or in New York immediately<br />\nafter the contest with the Crescents.<br />\nAt the dinner given the members of the lacrosse team by Captain Schmeisser on May 14, the question of playing Toronto was brought up and given<br />\nfavorable consideration. Manager Slemons was instructed to make enquiries as<br />\nto whether we shall be able to secure the American League grounds. On<br />\naccount of base ball, these cannot be gotten before June 11. If the Canadians<br />\ncan he persuaded to play the Crescents about June 9, and come to Baltimore<br />\nseveral days later, the game is not only possible but very probable.<br />\nShould we win or lose, such a contest would give a wonderful stimulus to<br />\nthe popularity of the sport among Baltimoreans Our team is acknowledged as<br />\nbeing the strongest ever turned out by Hopkins, and there is a bare possibility<br />\nthat we might. beat the Canadians at their own game. It is at least worth a<br />\ntrial.<br />\n<br />\nZ<br />\n<br />\nATHLETIC NOTES.<br />\nThe lacrosse team has elected for next year H. P. Straus, '01, as captain;<br />\nJ. A. Addison, '03, manager; J. R. B. Branch, '04, assistant manager.<br />\nAt the last meeting of the Athletic Association, held on Tuesday of last<br />\nweek, an \"H\" was awarded to W. S. Bird, '03, and the secondary honor, \"H.<br />\nA. A.\" was given to S. Smith. '02, I R. PeIs, '02, and J. B. G. Custis, '03.<br />\nA committee was appointed to take charge of all remaining business, as<br />\nfollows: Dr. Renouf, faculty delegate; R. T. Abercrombie, prsident; J. T.<br />\nSmith, secretary; S. Smith, treasurer.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nPING PONG PANGS.<br />\nSing a song of ping pong,<br />\nTable and a net,<br />\nBoy and girl are playing;<br />\nIt is a deuce set.<br />\nWhen the game is finished<br />\nShe has won the thing.<br />\nDon't tell me the artful boy<br />\nDon't know how to ping.<br />\nOld Mother Hubbard went to the cupboard<br />\nTo get her poor dog a jacket.<br />\nComing back before long, he was playing ping pong,<br />\nAnd using a bone for a racquet.<br />\nTom Strong could never pong,<br />\nHis wife could never ping,<br />\nAnd so, 'tis true, betwixt the two<br />\nThey cussed the silly thing.<br />\nLittle Boy Blue, come blow your gong,<br />\nSister's beau and she are playing ping pong.<br />\nWhere go the. lovers? To the dark hall.<br />\nWhat are they doing? Hunting the ball.<br />\n<br />\nLACROSSE RUL1 S.<br />\nDe rules ov de goime is:<br />\nDon't hit so hard dat you break your net—for dey cost money.<br />\nIf yer can't reach de guy what is runnin wid de ball hit de feller who is<br />\nstandin clost to yer.<br />\nAlways hit de long thin fellers, for the fat ones bleed so much on the net<br />\ndat de handle is apt to git too slippery. If de man won't drop de ball after yer<br />\nhave pounded him for five minutes, git de strangle hold onter him and give him<br />\na dint between the eyes.<br />\nDe Marquis of Queensbury Rules goes in de fight, hut if yer has any up yer<br />\nsleeve dat yer likes better, it don't make no difference.<br />\nOn de whole de goime is de best whatever and makes foot ball look like<br />\nparlor croquet; and if yer wants to see a fine gentle sport dat reminds yer of de<br />\nChicago slaughter house go to de next Lacrosse Goime.—The Widow.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nIA a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN, M. D., D. 0.,<br />\nProst. & Mgr.<br />\nESTABLISHED 1879.<br />\n<br />\nedding Silver rig\"<br />\n11111111111111111.1111111111<br />\nIN GREAT VARIETY.<br />\n<br />\nei* slLiNKINS.<br />\n21e N. CHARLES ST.<br />\n<br />\nSilversmiths.<br />\n_<br />\n<br />\ntienderson's<br />\ndent'_s Supplies.<br />\n<br />\nWETtFR &<br />\n<br />\nJic<br />\n<br />\nMadison&HowardSts.<br />\n<br />\nAgent for Lincoln & Bennett and<br />\nWalter Bernard's London Mts.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere Hats. or<br />\n<br />\n34 W. BALTIMORE ST.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nST A TIONERV—For School, Family, Office and Bank.<br />\n<br />\nII. R. E1SENBRANDT SONS,<br />\n<br />\nfor<br />\n<br />\n4ORDAN STRBLER GO. blials:rN\"IvE.<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n'201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\n<br />\nr<br />\n<br />\nNix Ground Spices —no adulteration, all strictly pure.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\nF3oohsellers and<br />\nStationers.<br />\n<br />\nSCHOOL, LAW MEDICAL• CLASSICAL AND MISCELLANEOUS BOOKS<br />\n<br />\nProfs. G. W. Lehman it Son,<br />\nReads as follows: Samples submitted of<br />\nPreneli Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nhorry—no coloring or adulterants, absolutely pure wine.<br />\ntYe %Vhlskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\n(Hive 011—all tests show pure olive oil.<br />\n•krong. VInegar—natural cider vinegar, strictly pure and<br />\n<br />\nO.<br />\n<br />\nHATTERS, CANES, ETC.<br />\n<br />\nUMBRELLAS,<br />\n<br />\nCertificate of Analysis from<br />\n<br />\nOtto H. NVilliarns,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br />\n<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital, $650,000<br />\n<br />\nSurplus and Profits $450,000.<br />\n<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\n•4P\\ORTII GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nJAMRS R. PA INK.<br />\n<br />\nTHRO. WARNIIR.<br />\n<br />\nCUSH:NG & COMPANY,<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\ntzt Books. Note Books,<br />\n<br />\nH. MOIA ENS, D.0..<br />\nSoe'y. & Treas.<br />\n<br />\nMARIA BUIE, D.0.,<br />\nV.-Prot.& Asst. Seciy.<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nDIRECT.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Erns!<br />\n<br />\n'BALTIMORE, MD.<br />\n1.<br />\n<br />\nTweotg-Sixth Tear.<br />\n<br />\nBeginning October lt,t, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n•<br />\n•<br />\nDenn of the Medical School,<br />\nDean of the College,<br />\n.<br />\n.<br />\n<br />\nIRA BEMSEN.<br />\nWM.II. HOWELL<br />\nEDW. H. GRIFFl c.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. 1).)<br />\n(b) In Medicine. (Courses for candidates for the de<br />\ngree of M. D.; coursos for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates tor the llogree f B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody institilte<br />\nPratt Library<br />\n<br />\n10(1,000 volumes.<br />\nrg.1,000 vol iTO.<br />\n200.000 votilines.<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries,<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nItems rice,<br />\nEnglish,<br />\nII istory,'<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirecters.<br />\nIra Reinsert.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin<br />\nWilliam H. Howell.<br />\nWilnam If. Welch.<br />\nJohn.). Abel.<br />\nJohn,.1. Abel.<br />\nWilliam Order.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirbu F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHelm, Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\n.1. H. Hollander.<br />\nPrank Morley.<br />\njiisepti S. Antes.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\nClassical (the \"Old College Course.\")<br />\nMathematical Physiea<br />\n(leading up IA l Engineering.)<br />\na.(chemical- Biological.<br />\n(leading tip to Medicine.)<br />\n4. Geological- Biological.<br />\n6. Latin Mathematical.<br />\n11. Historietti-P(diticat.<br />\n(leading up to Law.)<br />\nI. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics (vol. X XIV.)<br />\nFrank Morley.<br />\nChemistry (vol. XXVII.)<br />\nIra Remsen.<br />\nPhilology (vol. XXIII.)<br />\nBasil L. Gildersleeve.<br />\nHistory (vol. XX.)<br />\nJ. M. Vincent,.<br />\nModern Language.(vol. XVII.) A. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nMaryrioiogy (vol. Iv.)<br />\nPaul Hauptrat)erialental Medicine (vol. VI.) W.B. Welch..<br />\n<br />\nAmerican Journal of Ilatheaaatica.<br />\nP. MOH.LEY. Editor. Quarterly. Ito. Volume X XIV<br />\nin progress. $5. per volume.<br />\nii American Chemical Joarnal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXVII<br />\nIn progress. $5. per volume.<br />\nIli. American Journal of Philology.<br />\nB. L. GI IMERSLKEVE, Editor. Quarterly. 8v0.<br />\nVolume XXIII in progress. $a per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5. per volume.<br />\nStudies in Historical and Political Science.<br />\nMonthly 8vo. Series XX in progress. sa. per<br />\nvolume<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol X X I in progress. $1. per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly Ito.<br />\nVolume XIII in progress. $1. per year.<br />\nv Ill Johns Hopkins Hospital Reports. 4to. Volume X<br />\nIn progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A ssyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. H7•50<br />\nper volume.<br />\nX I. Modern Language-Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8v0. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. Ito.,<br />\nPer<br />\nvolume.<br />\nx i V. Reports of Maryland Geological Survey.<br />\nWILLIAM T1. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Mee'<br />\ntrinity.<br />\nL. A. BATTER, Editor. Quarterly.<br />\nave. VolurneVIlin progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Tree\"<br />\ntefiS, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of oilleerm end students, and stating<br />\nthe regulations, etc., of the University. l'ulr\"<br />\nUMW at the close of the academic<br />\nIn addition to the serials above named,copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospeetus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. 13111\"<br />\nlegs, Editor. 110 pp. Ito. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. Ito. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegornena.EpistIes. Edited by I. H. Hall. MOO.<br />\nIlibliographia Hopkinalemils. Part I. Philology. Parte<br />\nII-Ill. Chemistry, Mineralogy and Geology. ra.rtg<br />\nIV-V-VI.Physics, Astronomy and Mathematics.<br />\n8 vo. 110 cents per part.<br />\nfull list of publications will be sent on application.<br />\nGommesiestions in respeet to exchasges and renal** vow*<br />\nslag bosom% te Jokes 'Hopkins Press, Baltimore,<br />\n<br />\nProgrammes of the Courses offered to graduate innciente in Philosophy told the Arts, and in the School of<br />\nMedicine, and also of 3,110 Undergraduate or Collegiate<br />\nVourees, will be sent on application to the Registrar.<br />\n<br />\n\f", "format": "basic_html", "processed": ".<br /><br />\nt<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORK, MD.<br />\n1.<br /><br />\nTwenty Shah Year.<br /><br />\nBen Inning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br /><br />\n.<br /><br />\nI It A REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Phitosophy and the Arts. (Courses for eltIlli{(1ates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;coursm for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n04<br /><br />\n•<br /><br />\n100,000 volumes.<br />\n115,000 colonies.<br />\n21,0.001 volumes.<br /><br />\n•<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy.<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,Physiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br /><br />\nDirectors.<br />\nIra Bentsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mat.<br />\nWilliam II. HmeciI.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\nIflreetore.<br />\nBasil L. Gildersleeve.<br />\nKirby to. Smith.<br />\nMaurice Bloonviefel<br />\nPaul Haupt.<br />\nHenry'Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent,<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nHistory,:<br /><br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br /><br />\ns.<br />\n4.<br />\n5.<br />\n6.<br />\n/.<br /><br />\nClassical (the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Biological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(leading up to Law.)<br />\nModern Languages.<br /><br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics (vol. X XIV.)<br />\nIra Benisen.<br />\nChemistry (vol. X X VII.)<br />\nBasil L. Gildersleeve.<br />\nPhilolog (vol. XXIII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XX.)<br />\nModern 1.angliages (vol. XVII.) A. Marshall Elliott.<br />\nWittiam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt..<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. VI.)W.H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate Btudents in Philosophy and the Arts, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY. Editor. Quarterly. 4to. Volume XXIV<br />\nIn progress. $5. per volume.<br />\nII American Chemical Journal.<br />\nI. ItEMSEN,Editor. Monthly. 8yo. Volume XX VII<br />\nin progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\n13.<br />\n'<br />\nB. L. GILD KRSLICEVE, Editor. Quarterly. 81<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5, per volume.<br />\nV.<br />\nStudies in Historical and Politleal Science.<br />\nMonthly live<br />\nSeries XX in progress. $3. P°1volume<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin prog-ess ii Baltimore. 4to. Vol X X1 in progress. $1. per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly 4t0.<br />\nVolume XIII in progress. $1. per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume I<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,et°1<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. r.50<br />\nper volume.<br />\nX I. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volfline<br />\nXVII in progress. $1.50 per volume.<br />\nX I. Journal of Experimental Medicine.<br />\nW. Ii. WELCH., Editor. Hi-monthly. 8v0. VolU<br />\nVi in progress. $5 per volume.<br />\nXIII. American Journal of' Insanity.<br />\nHENRY M. HURL), Editor. Quarterly. 4to.,0 Per<br />\nvolume.<br />\nIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nN. V. Terrestrial Magnetism and Atmospheric Elee\"<br />\n.<br />\ntrinity.<br />\nL. A. BAITER, Editor. Quarter'''<br />\n8v0. VolumeVI Fin progress. V.60 per volume.<br />\nxV11. Annual Report.<br />\nPresented by the President of the Board of<br />\ntees, reviewing the operationm of the UniveraitY<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and statiny<br />\nthe regulations, etc., of the University.<br />\nRated at the close of the academic year.<br />\nIn addition to the serials above named,copies Mal be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the<br />\nTestament. Edited by Prof. Paul Haupt. Prospe°<br />\ntus on application.<br />\nRowland's Photograph of the Normal Solar Speetrniii•<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. .T. S. Billings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the A postlem. Complete Pic-simile °di1.0<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4i'°'<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by t. H. Hall. $8.00<br />\n.<br />\nparts<br />\nRibliographia Hopkinsienais. Part I. Philology. ,<br />\nThrts<br />\n11-111. Chemistry, Mineralogy and Geology. \"<br />\nIV-V-V I.Physics, Astronomy and Mathematic.'<br />\n8 vo. 30 cents per part.<br />\nIl full list of publications will he sent on application.<br />\nCommunications In respW to exchanges and ramikt4n045<br />\nmay be sent to Johls tiookins Press, Baltimore. rtld•<br /><br />\nLit-GROSSE NUMBER.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nMAY 21, 1902.<br /><br />\nNo, 16.<br /><br />\nTHE MODERN THEORY AND TREATMENT OF TUBERCULOSIS.<br />\nEW persons outside of the medical profession appreciate the great devastation wrought annually by the one disease, pulmonary tuberculosis, or<br />\nconsumption, rightfully termed by Oliver Wendell Holmes as ''the great<br />\nwhite plague.\" It is estimated that about a million of persons are suffering<br />\nwith consumption in this country alone, of whom at least one hundred and fifty<br />\nthousand die annually. In our own city there are at present, according to the<br />\nmost reliable calculations, at least ten thousand persons suffering from consumption, with an annual death rate averaging over one thousand. Quotations<br />\nsuch as these, however, fail to make much of an impression upon the public,<br />\nbecause the average layman regards tuberculosis as a disease with which some<br />\nfamilies are unfortunate enough to be tainted; he thinks that its development is<br />\nsimply a family predisposition, that its prevention is impossible and that a<br />\nfatal result is always inevitable.<br />\nPresent facts, however, teach us that consumption is a dangerous, contagious or communicable disease, and that it is also a very curable disease<br />\nwhen properly treated in its incipient stage. We know now that consumption<br />\nis not of an hereditary nature, passed down from generation to generation. but<br />\nthat it is a directly communicable disease, being transmitted from one individual<br />\nto another, through the widespread dissemination of the germs known as tubercle bacilli. An individual suffering from consumption is estimated to expectorate as many as seven billions of bacilli in twenty-four hours. As long as<br />\nthe expectorations remain in the liquid state, there is little danger from them,<br />\nBut matter expectorated on the floor, in the street, or in a handkerchief, usually<br />\ndries very rapidly, and, becoming pulverized, finds its way into the respiratory<br />\ntract of any one who chances to inhale the air in which is floating this dust<br />\nfrom expectorations. Doubtless, each one of us every day of our lives inhale<br />\ntubercle bacilli in countless numbers; but when we are in good health, our<br />\nnasal muceous secretion possesses bactericidal qualities sufficient to destroy the<br />\nbacilli and prevent them from doing any harm. But if we allow ourselves to<br />\nbecome run down, with our powers of resistance lowered, the nasal secretion<br />\nloses its bactericidal powers and the inhalation of particles of dried and pulver-<br /><br />\n5<br /><br />\nTHE NEWS—LETTER.<br />\nized tuberculous expectorations would result in a great risk of contracting pulmonary tuberculosis. It would seem, therefore, that any measures adopted by<br />\nthe Board of Public Health towards the proper care of and control of<br />\nthe poor, careless, and ignorant consumptive would be of inculcable benefit<br />\nto the public health and general hygiene of the community. I say careless and<br />\nignorant consumptives, because undoubtedly the chief sources of infection and<br />\nspread of the disease is due to the thousands of poor who are either too ill, too<br />\nignorant, or too indifferent to properly dispose of their sputum and thus render<br />\nthemselves no longer sources of contagion. Every municipality has seen fit to<br />\nprovide suitable accommodations for the unfortunate sick poor suffering from<br />\nvarious disorders. City hospitals afford them a fair opportunity for recovery,<br />\nor if the chance for this has passed, a decent place in which to die, with the one<br />\nexception of consumptives.<br />\nEvery general municipal hospital in the<br />\ncountry at present declines to admit consumptives to their wards, with<br />\nthe result that the multitude of unfortunates suffering from phthisis are<br />\neither left alone in their own homes to die from want and neglect,<br />\npitiable objects for both private and public charity, or else sent to further<br />\ncongest the already overcrowded almshouse. It is an unfair and unjust<br />\ndistinction of the equally worthy poor patients to afford one all the benefits of<br />\nour magnificent hospitals because he is fortunate enough to have any other disease than consumption, and to relegate the other to the pauper's home because<br />\nhe is unfortunate enough to have consumption. It is the purpose of every<br />\nmunicipal government to make generous provisions for whatever may be conducive to the well-being, protection and health of its people. Hence the erection of hospitals, asylums, and almshouse for the care and detention of sick,<br />\npoor, inebriates, and lunatics.<br />\nIn spite of these estimable institutions, does it not seem remarkable that<br />\nup to the present time, with few exceptions, no effort has been made on the<br />\npart of the Board of Health to care for or aid that class of sufferers whose affliction is unquestionably of the greatest possible menace to the health of the community, inasmuch as it is the cause of about one-tenth of the total annual mortality?<br />\nPersons interested in this subject have long ago agreed that proper care and<br />\nisolation of the poor consumptive is a most pressing and urgent need. The<br />\nerection of especial hospitals for the isolation of advanced cases, and the establishing of country homes for the treatment of those in the early stages of the<br />\ndisease, seem to be the only remedy. Every large city should have one or more<br />\nhospitals where hopeless cases could be taken, with the idea, not only of making<br />\ntheir last days on earth as peaceful as possible, but also of rendering them no<br />\nlonger sources of danger to their family and friends and a drawback to the<br />\nwage-earning capacity of the, remaining members of their families.<br />\nOf no less importance would be the building of several country sanatorio,<br />\neither in the suburbs, or else in some region of moderate altitude, where the<br />\nincipient cases could be sent and given a chance to recover their lost health.<br />\nAt present, physicians working in the free dispensaries, where the great major-<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nity of pauper consumptives seek treatment, are absolutely powerless to do anything for them with the hope of affording permanent relief. We may prescribe<br />\nand often alleviate their most prominent symptoms; we may instruct them how<br />\nto properly dispose of their sputum and thus make themselves lesi dangerous<br />\nto their families. But we cannot give them the treatment they need, and we<br />\nare thus forced to see useful lives sacrificed which might be saved had we the<br />\nproper means at our disposal. To my mind, the multiple creation of institutions devoted especially to the consumptive will solve more than anything else,<br />\nthe difficult problem of how to reduce the mortality from tuberculosis and prevent its spread in general.<br />\nPrivate philanthropy has made a good beginning in Baltimore, but can<br />\naccomplish relatively little without further financial assistance, either from individual donation or from the city and state treasuries. The little hospital at<br />\nTowson is doing on a small scale what might be done on a very much larger<br />\none if more funds were forthcoming. The distressingly large waiting-list in<br />\nthe hands of the resident physician is the best evidence that larger institutions<br />\nof this character are sorely needed in Baltimore. During the past year, of fortynine cases admitted in all stages of the disease, fourteen were discharged with<br />\ntheir disease arrested and were able to resume work. These figures speak very<br />\nwell for what may be done in the very suburbs of our city in a small institution<br />\ncramped for money and struggling to care for as many unfortunates as possible.<br />\nMany sanatorio claim as many as 70 per cent. of cures when patients are admitted to treatment in the incipient stages; and I have reason to believe that these<br />\nfigures are correct; for pulmonary tuberculosis in the earlier stages is indeed one<br />\nof the most curable of diseases. The charitably disposed contribute considerable amounts yearly in one form or another for the destitute sick in their<br />\nmidst. The destitute consumptive, especially the advanced case, is the most<br />\nfrequent applicant for such aid as his is the most common disease. Is it good<br />\njudgment? is it economical, to expend the money in keeping him at his home, a<br />\nmenace to all around him, send him to the poorhouse already overcrowded and<br />\nunfitted for the hopeful treatment of such cases, or expend the same amount,<br />\npossibly less, in placing him in a properly equipped consumptive hospital?<br />\nSurely, here is a great chance for our philanthropists to aid their poor fellow<br />\ncitizens by the speedy erection of consumptive hospitals or by contributing to<br />\nthose already in operation- They will then not only help safely these unfortunates suffering from tuberculosis, but will render to the community at large<br />\nan incalculable service by thus inaugurating means for the prevention of the<br />\ndisease to which at present old and young, rich and poor, are falling victims<br />\nby thousands every year.<br /><br />\nWhy is it that a girl must have<br />\nA dried-up, dreary chaperon?<br />\nMuch better times she would enjoy<br />\nIn going with a chap alone.<br /><br />\nTHE NEWS-LETTER.<br />\nSOME EXPERT OPINION OF THE '02 LACROSSE TEAM AND<br />\nMAY 10th.<br />\nCOACH :—Hopkins never had a better team as a team. It was the best<br />\ngame, played by the best all-round team, I have ever seen. The work was<br />\nbrilliantly even; it took great team work to win, and that meant every man had<br />\nto be a star. If any one stood out above the rest, it was Abercrombie. His<br />\nvery presence gave the men confidence; and when he went into a \"mix-up,\"<br />\nHopkins was sure to get the ball. It will be many a year, I am afraid, before<br />\nHopkins can hope to duplicate the team of 1902.<br />\nWM. HARVEY MADDREN.<br />\nCAPTAIN OP THE '98 vARSITY:—The game with Swarthmore was certainly<br />\na rare treat for the spectators, and the team deserve much praise for the great<br />\ngame they played, one and all.<br />\nIt seemed to me that the catching of the attack men when closely covered<br />\nwas a noticeable feature, and all who have followed lacrosse at Johns Hopkins<br />\nmust have felt proud to see our team out-last the always well-trained Swarthmore men. The two points that seem to bear criticism are the fact that the<br />\nattack did not draw the defense men out when closely covered, and that there<br />\nwas too much throwing at random by some of the players in mid field positions.<br />\nI think the team is the most evenly balanced we have ever had, and one of<br />\nwhich every Johns Hopkins man should feel truly proud.<br />\nG. CANny ROBINSON, '99.<br /><br />\nCAPTAIN OF THE '00 VARSITY:—There was the fastest game of lacrosse at<br />\nAmerican League Park with Swarthmore on Saturday that we have seen for at<br />\nleast five years of my experience. It was game from beginning to finish.<br />\nSwarthmore was in the very best shape for team play, but Hopkins proved a<br />\nlittle better, The play through, was hard and quick.<br />\nIn fact, Baltimore has never enjoyed a keener contest.<br />\nRONALD T. ABERCROMBIE.<br />\n'00 ALUMNUS ATHLETIC DELEGATE:—Please extend to our lacrosse team<br />\nand to all friends of athletics at Hopkins my hest congratulations on the magnificent work of the season. I have followed the work of the lacrosse Men as<br />\nclosely as I could, at this long range, and it seems to me that the team must be<br />\nthe best in the history of Hopkins lacrosse.<br />\nI was greatly disappointed at the loss of the Relay, but that disappointment is now forgotten.<br />\nIf Hopkins can win such victories without her new campus or athletic<br />\nfield, what will she not be able to do at Homewood? Let the good work go on!<br />\nThe \"Has-beens\" are watching you.<br />\nALBERT M. REESE,<br />\nAlumnus Delegate to Athletic Board, 1900.<br />\nA CANADIAN AUTHORITY:—It was the best amateur game I ever saw.<br />\nNot even in a professional game have I seen cleaner passing. Then, too, there<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nwas no exhibition of selfishness. There is usually a desire on the part of one<br />\nor two star players to keep the ball most of the time, but the Hopkins team was<br />\nnoticeably free from such plays. I do not mean to say that the university boys<br />\ncould defeat the professional Canadian teams. The men on the professional<br />\nteams are much heavier, and all their time is devoted to lacrosse. But there is<br />\nthe same relation between the fastest college base ball and professional ball, as<br />\nbetween the Hopkins lacrosse team and the professional teams of Canada. The<br />\ngoal shooting did not seem to be as clean as it might have been; there was a<br />\ntendency to shoot too low. Instead of bringing the ball down the side of the<br />\nfield and then have one man lob it into the goal, as is the Canadian custom, the<br />\nHopkins men played more in the center of the field. Vet there can be no doubt<br />\nbut that the Hopkins team is the best in its class. I don't think I ever saw a<br />\ncleaner, better game.<br />\nREV. DONALD G. GUTHRIE.<br /><br />\nBETWEEN BELLS.<br /><br />\nAccording to rumor, a new organization will be the outcome of the base<br />\nball game with Georgetown. The object of the society will be to perpetuate<br />\nthe loyalty and unselfish devotion of the twenty-five students—graduate, mediical, and undergraduate—who attended the game.<br />\nThe seniors of the Woman's College last evening began their twilight singing on the steps of Goucher Hall. This will continue each evening until commencement day. (Daily paper.)<br />\nThe students of the University last week began their between-class \"nickel<br />\nPitching\" on the sidewalk of Little Ross Street. This will continue every day<br />\nuntil after examinations.<br />\nFriday of last week the Freshmen held a class meeting, at which it was<br />\ndecided to award numerals to LeCron and Porter for track work. A committee<br />\nwas appointed to arrange for a class entertainment at the end of the year. After<br />\nthe meeting dark rumors were set afloat that stringent measures were to be<br />\ntaken concerning hazing next year.<br />\nThe musical clubs made their last appearance of the season at the concert<br />\non Monday night of last week, when a benefit for the Lawrence House was<br />\ngiven in conjunction with the Woman's College Clubs. A substantial sum<br />\nwas realized from the 459 paid admissions.<br /><br />\nMATTHEW WOOD—Let me tell you a good story, about a man with a false<br />\nleg,<br />\nWALTER SHEARER —Cut it Out; no stump speech for me.<br />\nMATTHEW WOOD —Yes, but it's a corker.—Penn. Punch Bowl.<br /><br />\nTHE NEWS—LaTTUR.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of TEE JORWS<br /><br />\nHOPKINS UNIVERSITY.<br /><br />\nMAY 21, 1902.<br />\nSubscription $1.50 per year.<br /><br />\n10 Cents a single copy.<br /><br />\n.<br />\nEditor in Chief<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n.<br /><br />\nROBERT S. LANIER, 1903.<br />\n. HA.nliv K. TOOTLE, 1908.<br /><br />\n.<br /><br />\neut,omoN &amp;um, 1908.<br />\nGEORUE A. FOSTER, 1904.<br />\nREGINALD S OpiE, 1904.<br />\nW. S. .BIRD, 1908.<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n.<br /><br />\nAUBREY FEARER, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hop-<br /><br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to Aunta:v FEARER, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n011•1111MIMNOwntsrm<br /><br />\nUR COMMENCEMENT ISSUE, which follows this number, is the last appearance of the NEWS-LETTER for the scholastic year. There will be cuts of<br /><br />\nO<br /><br />\nthe athletic teams and their captains, and a next year's directory of the<br />\nBesides, a photograph<br />\nwill<br />\nboard<br />\ngrace<br />\nthe<br />\npages.<br />\nWith<br />\nthese<br />\nspecial features,<br />\nthe<br />\nNEWS-LETTER<br />\nof<br />\nwill<br />\nbe<br />\na<br />\nreview<br />\nUniversity, in<br />\nof<br />\nthe<br />\nyear's<br />\nachievements<br />\nat<br />\nthe<br />\nnumber<br />\nthe<br />\ncompact form and at small cost.<br />\nSome changes are contemplated in the make-up of the paper for next year.<br />\nSuggestions banded in to the editor will be thankfully received.<br />\ngraduating class, with portraits of the prominent men.<br /><br />\nARMONY<br /><br />\ng<br /><br />\nAMONG THE ATHLETIC TRAMS at the University has developed<br /><br />\nwonderfully in the past few years. At the City Championship meet, half<br />\nthe lacrosse team were running shoulder to shoulder with the track men,<br />\ntrying to gain an extra point for the 'Varsity By the nature of things, these<br />\ntwo teams have greatly conflicting interests, and it is encouraging to see Hopkins spirit on top. The third spring team is the base ball. Its attitude may<br />\nbest be seen by a reference .to Captain Campbell's letter, which appears on<br />\nanother page. Lest it should seem to be a little out of touch with its companion teams, the reader should remember the \"condition of probation,\" as the<br />\n'02 Hullabaloo puts it, in which the team finds itself. The Athletic board, at<br />\nits late meeting, did not overlook the faithful and hard work done by the pro-<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\nmoters of the game; but it held that its own scanty financial resources, coupled<br />\nwith the lack of wide-spread interest among the students themselves, rendered<br />\nit impossible that the national game should be recognized at present in the<br />\nUniversity.<br /><br />\ne<br /><br />\nLIE OVERWHELMING DEFEAT OF HARVARD by the Hopkins Lacrosse<br /><br />\nTeam has always seemed to us a fact calling for more explanation than<br />\nhas yet been given. And here it is, from the Harvard Crimson:<br />\n\"Of the four games played by the lacrosse team during its southern trip,<br />\nthree were lost and one was tied. The showing made by the squad, however,<br />\nwas not so unfavorable as this would seem to indicate, because new men only<br />\nwere taken on the trifi, and also because in the game with Johns Hopkins University three players were unable to play on account of injuries. The score in<br />\nthis game was 11 to 1. * * On the basis of the work done during the trip, a<br />\nUniversity team will be picked this week, and on Saturday will play the first<br />\nregular game of the season with the College of the City of New York. * * \"<br />\nThe italics in this quotation are our own. It was with a sense of temerity<br />\nthat we set about correcting the statements of a college paper so far outdistancing us in age and size; but the occasion is tempting, and the evidence at hand.<br />\nIn last year's game with Harvard, we find, among the names of the twelve<br />\ncrimson wearers, the following six: Chaffee, Stevenson, Hoquet, Alvord,<br />\nMichell, Goddard. In this year's game with Harvard, we find, among the<br />\nnames of the crimson wearers, the following six: Chaffee, Stevenson, Hoquet,<br />\nAlvord, Michell, Goddard. At the same time, five Hopkins men played against<br />\nHarvard this year who did not appear in last year's line-up.<br />\nLest there should be errors in the reports of fair Harvard's \"regular\"<br />\nrlacrosse games, just begun, we advise the editor of our great contemporary to<br />\ntad the daily papers before proceeding to nail the Crimson to the mast.<br />\n,<br /><br />\n'<br />\nZ HE 1902 HULLABALOO, which the careworn Editor-in-Chief announces for<br />\nThursday (to-morrow), shows the result of much lively \"hustling,\" and<br />\nis a very creditable piece of work. The aim of the editors has been t<br />\nas much representative of the whole college as possible—a book of<br />\nit<br />\nmake<br />\nreference for every phase of Hopkins life. In this connection, they have given<br />\na list of Hopkins songs much fuller than in preceding editions, which constitute<br />\na welcome feature.<br />\nThe cover is a pleasing combination of University and class colors; the<br />\nbody black and blue, the lettering in white, making the blue and white of '02.<br />\nThe University seal in gold is also shown. The leading article, by President<br />\nRemsen, is entitled \"Reminiscences of Dr. Rowland,\" and contains some<br />\namusing tales of their intimacy on fishing expeditions and the like. Ex-President Gilman also contributes an article on research at the University.<br />\nThese and the other stock features of the book, are, of course, less interesting to the undergrad than the \"stunts.\" Among these will be noticed the<br />\nfurther development of the Hopkins Girl. She is shown as a Class Girl, an<br /><br />\n8<br /><br />\nTHE<br /><br />\nNEWS-LETTER.<br /><br />\nAthletic Girl—in seven roles altogether, and attractive in all. The series of<br />\n\"Trophy Room Talks\" will be enjoyed by all who fancy they recognize the<br />\n\"kicker,\" the \"poet,\" and the \"chronic jollier.\" The editors consider, indeed,<br />\nthat the \"roasts\" and \"grinds\" have been distributed so universally and impartially that no one can have cause of complaint.<br />\nThere are minor defects in the book, such as the use of a quotation \"the<br />\nmildest-mannered man,\" cribbed from the '01 book, or slips in proofreading<br />\n(the Hopkins-Gettysburg game is given: \"J. H. U., 0; Gettysburg, 2.\") But it<br />\nis a production worthy of the University, and an improvement over its<br />\npredecessors, as every class book should be.<br /><br />\nTo the Editor of the NEWS- LETTER :<br />\nThe base ball season of 1902 has closed. Doubters and scoffers had said<br />\nthat it was impossible to maintain a team. It was found, however, to be comparatively easy. The chief obstacle that was encountered was the prevalence<br />\nof wet weather for a time around Easter. The promoters and members of the<br />\nteam are delighted with their success. The organization was complete, the<br />\ntraining and practice iegular, obligations were met, engagements fulfilled,<br />\nand<br />\na creditable showing made. The team played three games against competit<br />\nors<br />\nthat were quite out of its class, and thereby subjected itself to defeats in a manner that is usually avoided by Hopkins teams. But only satisfaction can be expressed at the re establishment of intercourse between Hopkins and<br />\nthe Naval<br />\nAcademy. This is an accomplishment of the base ball team. Because<br />\nof the<br />\nfaithfulness and devotion of the men, and the heroic efforts that they<br />\nhad made,<br />\nit was proposed before the Athletic Board to give the team recognition,<br />\nthe claim<br />\nbeing made (which is unquestionably true) that they had done<br />\nquite as much<br />\nhard work for Hopkins as a foot ball team does. The Board, however<br />\n, was<br />\ndisinclined to take any favorable action. This, many think, was a<br />\nmistake.<br />\nThe base ball team had certainly earned recognition. And further,<br />\nthe action,<br />\nor want of action, would indicate that Hopkins does not encourage her sons<br />\nto<br />\nexert themselves in her behalf. But this surely cannot be true;<br />\nthe injustice<br />\nwill soon be corrected.<br />\nR. J. G. McKnight has been named by the men as captain for next<br />\nyear,<br />\nand J. N. Numsen as manager. At least five, and probably seven,<br />\nof this years'<br />\nplayers will return. These men will form a splendid nucleus. Quite<br />\na little<br />\ninterest was manifested in the undertaking this year, and by next spring<br />\nthe<br />\nmovement will have gained more momentum and more intrinsic attractio<br />\nn.<br />\nThose who uphold the \"cause\" are alive to their duties and their opportun<br />\nities.<br />\nThey are ready patiently to contend against obstacles, prejudices,<br />\nindifference,<br />\nopen and secret antagonism. It appears that Hopkins will no longer<br />\nhave to<br />\nbear the reproach of not being able to support a base ball team.<br />\nTo all those who during these strenuous times have given their good<br />\nwill,<br />\nor friendly aid, I express a sincere gratitude.<br />\nJOHN G. CAMPBELL, '02.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n'<br />\n,:li,11111111111111111i11011111:1111111iiiiii11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111i111111111111111111111111111111111111111111111111111111111t111111114:<br />\n. ,.yii :•,.... _......- ,.,...;t:!.,,,, ,,,,:..4,7„:,:,.,<br />\n.: ?:,-,,...,-kf.....:-..- ....J....,4-,<br />\n,<br />\n•','<br />\n-:-._.<br />\n-s a<br />\n;. .,.<br /><br />\n'...<br /><br />\no 11401.°-`11allazia\".4...am 0<br />\n,<br />\n0<br />\n1. 1210i3[161ellaii<br />\nIti............-0..—.....<br /><br />\ncm<br /><br />\nP<br />\nCC'<br /><br />\nIliliiiiii<br /><br />\n'A110111111111111111111114 1'11111,11M 1111111.111111111111111111111111'1,1 ,1,11111111111111111111111111111111 1111111111111 1111111111111111111111111=1111111;i1;111111i111-11.1:;'.. ,rd.;<br /><br />\nR. PAUL HAUPT sailed for Europe on the 7th of this month. He will<br />\nspend most of the summer pursuing his oriental studies at Oxford and<br />\nCambridge, and later will attend the meeting of the International Society of<br />\nOrientalists at Hamburg as a delegate from the American Oriental Society, and<br />\nfrom the Hopkins. During his stay in Germany, Dr. Haupt, together with<br />\nDr. Gilman, will attend the wedding of Prof. Henry Wood.<br />\nA new surgical building, costing $100,000, will soon be erected at the<br />\nMedical School on the ground upon which the amphitheatre now stands.<br />\nMaryland's industrial geological exhibit at the Charleston Exposition received twenty-two prizes. This fact is of interest on account of Dr. William B.<br />\nClark's close connection with the exhibit.<br />\nDr. J. W. Bright, director of the English department, will shortly have<br />\npublished a revised second edition of his '`Anglo Saxon Reader.\" This book<br />\nis conceded, not only by American, but also by English universities, to be the<br />\nbest work on Anglo-Saxon grammar which exists.<br />\n\"The Role of the Toxins in Inflammations of the Eye,\" is the title of the<br />\nessay for which Dr. Robert L. Randolph, associate professor of ophthalmology<br />\nand otology at the Medical School, has been awarded the Boylston prize by<br />\nHarvard University.<br /><br />\nALUMNI NOTES.<br /><br />\ne<br /><br />\n014. Ned Arden Flood, '90, is president of the Western Pennsylvania<br />\nAlumni Association, which held its banquet at the Hotel Henry, Pittsburg, on May 3.<br /><br />\nMr. Noel deL. Purcell, '00, will sail for Europe on the 7th of next<br />\nmonth.<br />\nDr. N. F. Dorsey, formerly instructor in the physics department and now<br />\nin the government service at Washington, paid a short visit to the University<br />\non the 7th.<br />\nThe class of '99 held its reunion at the Johns Hopkins Club on May 10.<br />\nIt was decided to erect a tablet to Joshua Levering and Charles Gaddess, two<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br /><br />\nmembers of the class who have died since graduation. The following class<br />\nofficers were elected: President, W. M. Kruger; vice president, Geo. W. Knapp,<br />\nJr.; secretary and treasurer, Chas. C. Downes.<br />\n\"Under Two Flags,\" Miss Blanche Bates's play, is of especial interest to<br />\nHopkins men owing to fact that the part of Rake, the valet, was taken by an<br />\nold Hopkins student, Mr. Parkin Duvall. Mr. Duvall studied at the Hopkins<br />\nfrom '85 to '87. He has played with several prominent companies of this<br />\ncountry, and at one time was dramatic critic in London for the New York<br />\nHerald and World.<br />\nDr. John Montgomery West, who graduated at the Hopkins Medical School<br />\nlast June, and Mr. Augustus P. West, at present a graduate student in chemistry, sailed for Germany on the 13th. Dr. West will study for a year and a<br />\nhalf at some of the leading German universities, but Mr. West will return to<br />\nthe University in October.<br /><br />\nTO INVESTIGATE LABOR CONDITIONS.<br />\nCITIZEN of Baltimore, who desires that his name shall not be made public, has given a sum of money to the University to be devoted to a systematic investigation of the history, activities and influence of labor<br />\norganization in the United States. The sum of five hundred dollars is given for<br />\nthe immediate purchase by the University library of additional books, journals<br />\nand reports relating to this subject. The further sum of one thousand dollars<br />\nis made available to meet the expenses incident to carrying on the inquiry for<br />\nthe next academic year.<br />\nThe investigation will be conducted by the Economic Seminary, under the<br />\ndirection of Dr. J. H. Hollander, Associate Professor of Finance. It will begin<br />\nin October, 1902, and extend over such period of time as may be warranted by<br />\nthe extent of the inquiry and the definiteness of the results attained.<br />\nA preliminary organization of the Seminary will be effected before the close<br />\nof the present academic term; certain preparatory work will be assigned its<br />\nmembers for the summer recess, and a working plan will be prepared and<br />\nadopted—so that the investigation may proceed promptly when actually begun.<br />\nIt is proposed that the investigation shall start with an inquiry into certain<br />\nof the more concrete aspects of the labor question. The immediate environment<br />\nwill first be studied, after which conditions in other typical communities will be<br />\nexamined until sufficient data for reasonably safe generalizations have been<br />\nattained. A number of such specific inquiries will ultimately prepare the way<br />\nfor a more comprehensive survey of the nature and functions of labor orga n<br />\nizatious in the United States. '<br /><br />\n4<br /><br />\nSua—\"Ping Pong is such a noisy game.\"<br />\nH*—\"Well, you simply can't play it without a racquet.\"—Princeton 74er..<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nTrack and Field.<br />\nInvitation games of the Washington Y. M. C. A.<br />\nMAY 24.<br />\nMAY 30-31. Intercollegiate Amateur Athletic Association (championship) at New York.<br />\nWestern Maryland College Games at Westminster.<br />\nJUNE 7.<br /><br />\nLacrosse.<br />\nAfter JUNE 4. Cornell (?)<br />\nAfter JUNE 11. University of Toronto (?)<br /><br />\nTRACK AND FIELD TEAM WINS THE NEWS CUP.<br />\nHE victory of our lacrosse team over Swarthmore on May 10 seemed to<br />\nshow the track and field men just how a championship should be won,<br />\nfor on the following Wednesday, May 14, they carried off the Baltimore<br />\nNews Championship Cup in great style. The complete victory over the Maryland Athletic Club, whose members, by the way, were predicting the downfall<br />\nof Hopkins, may best be shown by the following figures:<br />\nJohns Hopkins, 60 points; Maryland Athletic Club, 36 points; Central Y.<br />\nM. C. A., 8 points; St. Leo's Gymnasium, 6 points; Baltimore Athletic Club,<br /><br />\nt<br /><br />\nU points.<br />\nThe foregoing statistics plainly show what Hopkins accomplished in open<br />\nscratch games against the fastest athletes in Maryland. Our men scored more<br />\npoints than all the other competitors combined, and won the surprisingly large<br />\nnumber of twenty-four places in the ten events on the program. In two events,<br />\nthe 220 yard dash and the running high jump, Hopkins won all four places,<br />\nwhile three wearers of Black and Blue made points in several others.<br />\nThe quarter mile run, in which \"Joe\" England clipped 2 1-5 seconds off<br />\nthe State record, was undoubtedly the prettiest race of the day. Our captain<br />\ntook the lead at a furious pace from the start, and was never headed. The speed<br />\nwith which the men rounded the curve before reaching the home stretch caused<br />\nmany of the spectators to predict a slow finish, but \"Joe\" had calculated his<br />\npowers of endurance to a nicety, and held the pace until he broke the string.<br />\n\"Billy\" Weedon stepped up with a big surprise for even his fellow athletes.<br />\n\"Bill\" has always been calculated to win medals for \"Tom Hopkins,\" but his<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\ngraduate work made it impossible for him to train to any extent for the games,<br />\nand when he catne in for two gold medals and a bronze one, probably nobody<br />\nwas more surprised than \"Billy\" himself. He \"made Rome howl\" on the<br />\nhome stretch in the 220 yard dash, and outdid George Scholl in the high jump,<br />\nbesides following Klinefelter and Green closely in the running broad jump.<br />\nIn the mile run, Porter started off at a nice pace, and held it throughout.<br />\nHad he not sprinted quite so soon, it is likely that he would have outdone Randall after all.<br />\nPessagno and Tootle gained first and second places in the 100 yard dash in<br />\ngreat style, more than holding their own against old, experienced men like<br />\nBlome and Requardt. They will both he with us next year, and promise to<br />\ncontinue the good work for the University.<br />\nHarvey Stone gained us three points in the shot put, and deserves a sound<br />\nslap on the back for outdistancing such men as Heyden, Kell and Barrett.<br />\nThe NEWS-LETTER wishes to congratulate both Captain England and<br />\nPhysical Director Mackdermott, for the success of our team. To them the victory is largely due, for the men were all in top-notch condition and not a single<br />\nHopkins runner made a ragged finish. Good work!<br />\nThe summary, showing how Hopkins stood in the contests, is as follows:<br />\nOne hundred yard dash—Pessagno, first; Tootle second. Time, 10 3-5<br />\nseconds.<br />\nFour hundred and forty yard run—England, first; R. C. Hoffman, third;<br />\nRosenheim, fourth. Time, 51 4-5 seconds.<br />\nMile run—Porter, second; Rosenheim, fourth. Time, 5 min. 1 2-5 sec.<br />\nHalf mile run—England, first; Abercrombie, third; Riggs, fourth<br />\nTime,<br />\n2 minutes 11 seconds.<br />\nTwo hundred and twenty yard dash—Weedon, first; Pessagno, second; R.<br />\nC. Hoffman, third; Tootle, fourth. Time, 23 2-5 seconds.<br />\nShot put (16 pound)—Stone, second.<br />\nRunning high jump—Weedon, first, Scholl, second; Pessagno, third; Lawson, fourth. Height, 5 feet 84 inches.<br />\nHammer throw—Lawson, fourth.<br />\nRunning broad jump—Weedon, third; Pessagno, fourth.<br />\nPole Vault—Emig, third; Lawson, fourth.<br />\nIn only two events—the shot put and the hammer throw—did Hopkins<br />\nhave but one man placed, and in five out of the ten contests our men carried off<br />\nfirst honors. \"Not half so bad!\"<br /><br />\nHOPKINS 8, SWARTHMORE 2.<br /><br />\nZ<br /><br />\nHE game in which we won the intercollegiate championship from Swarthmore may almost be said to mark an epoch in the history of Hopkins<br />\nlacrosse, for never before has such an immense crowd shouted in such an<br />\ninspiringly vociferous manner in order to help the 'Varsity win another pennant.<br />\nThe very day for which every man, and Manager Slemons, in particular,<br />\nhad prayed, dawned on May 10, and at 1.30 o'clock the next morning when the<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nteam was giving \"Billy\" Maddren a rousing send-off at Union Station, it was<br />\ndelightful to note that everything else that day had been in keeping with the<br />\nweather.<br />\nOld and new men alike agreed in declaring the game the best they had ever<br />\nseen in Baltimore. Swarthmore was trained to the hour, and for the Hopkins<br />\nmen \"Father Bill's\" various remedies, and '`Mother Bill\" Schmeisser's black<br />\npills certainly did the work.<br />\n. As was predicted, there was no let-up from start to finish, and had Hopkins<br />\nnot been prepared to more than hold the terrific pace which Swarthmore set, the<br />\ntale might have been different. The result was that Hopkins slightly outdid<br />\nthe visitors, even in that heart-breaking first half, and in the second the<br />\nQuakers were downed decisively. At one time particularly, the 'Varsity took<br />\nthings on the jump and scored four goals in 5 minutes and 37 seconds. Such<br />\nwork against a team like Swarthmore has certainly never been equaled in the<br />\nhistory of Hopkins lacrosse.<br />\nIn speaking of the game upon the return of the team to the University,<br />\n\"Billy' Maddren said: \"By golly, boys, I'm glad I wasn't in that game, and<br />\ndo you know why? Just this, the pace was too fast. I could never have held<br />\nit.\"<br />\nApparently there was not a weak spot on the team, and every man con<br />\ntributed a generous share toward carrying off the honors.<br />\nThe first half started with a grand rush, and for 25 minutes the rooters and<br />\nor<br />\nenthusiastic friends were wholly unable to tell whether nervous prostration<br />\nbroke<br />\n'Bernie\"<br />\nlittle<br />\nlast,<br />\nAt<br />\ndeath.<br />\ntheir<br />\nof<br />\nexcessive joy would be the cause<br />\nthe terrible suspense by driving the first goal into the net. A few minutes<br />\nlater Putts repeated the operation, and, before the whistle blew, Beans scored<br />\none for the visitors, making the standing two goals to one.<br />\nThe second half found Hopkins thoroughly aggressive and somewhat faster<br />\nthan Swarthmore. The same rush marked the start, and in less than three<br />\nin genminutes Putts tipped the third goal into the net. Then things woke up<br />\nthan<br />\nless<br />\nin<br />\ngoals<br />\nfour<br />\nof<br />\nn<br />\nphenomeno<br />\nthe<br />\neral. Every man \"got busy,\" and<br />\nfine<br />\nthe<br />\nbut<br />\ngame,<br />\nfast<br />\na<br />\nplay<br />\nto<br />\ncontinued<br />\nsix minutes resulted. Swarthmore<br />\ncovered<br />\nBlanck<br />\nand<br />\nTough<br />\neffectively.<br />\nwork of our defense held them back<br />\nhack like race-horses, and both Schmeissers and Henry Straus did such terrific<br />\nbody checking that Swarthmore's home men literally lost their nerve. Briscoe<br />\nplayed a star game at goal, and handled with wonderful skill all kinds of fancy<br />\nshots which happened to escape the others. On the attack \"Aber\" was much<br />\nin evidence, and got off his usual clever \"stunts\" with little \"Bernie.\" Putts,<br />\nB. Bernheim and Sayler did remarkably clever work on the infield,<br />\n\"Did you win a prize at the Horse Show?\"<br />\n\"You bet I did. Will you he my best man.\"<br />\nJINGO — What's caused the row in the Younghub family?<br />\nhalf<br />\nBINGO —The better half discovered that she didn't know how the other<br />\nlived.—Harvard Lamfioon.<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nBASE BALL.<br />\nHOPKINS 6, W. M. C. 1.<br /><br />\nt<br /><br />\nHE game of May 7th against Georgetown. in which Hopkins lost by the<br />\noverwhelming score of 24 to 1, served as an excellent preparation for the<br />\ncontest of the following Saturday at Westminster. In that game the playing of the Black and Blue reached the proper standard,—a consummation that<br />\nshould have been effected earlier and was hindered only by unavoidable obstacles. Western Maryland was fortunate in scoring. With Whipple pitching like<br />\nclock-work and Hopkins playing an errorless game, the result seemed never<br />\nin doubt.<br />\nThe first runs came in the third inning. McKnight reached first on a fumble by Henry. The next three men drew passes, and McKnight was forced in.<br />\nWright drove a hard one through Simpson and two more runs scored. In the<br />\nfifth inning with Moore and McKnight on bases, Campbell hit a safe one to left<br />\nwhich sent them both home. One more came in the seventh. Whipple singled<br />\nand advanced to second on Crozier's neat sacrifice. From there he scored on<br />\nMoore's beautiful two-bagger to center field.<br />\nWestern Maryland was saved from a shut-out in the eighth inning. Roberts was served up the wrong sort of a curve, and he promptly dropped the ball<br />\nover in the left field garden-patch. McKnight quickly leaped the fence, recovered the ball, and made an astonishing throw all the way into Moore's hand at<br />\nshort stop. Never before had such a feat been accomplished, and Roberts was<br />\nheld on third. From there he ran in on Brown's slow one to short. Brown died<br />\ntrying to steal second, and with him Maryland's hopes.<br />\nThe features of the game for Hopkins were McKnight's throw in the eighth,<br />\nand Moore's remarkable play at short stop. He accepted eleven chances without an error. Whipple pitched in his customary steady way and kept the hits<br />\nharmlessly scattered. For Western Maryland, Brown made the star play in the<br />\nninth inning when he scooped up with one hand a fast grounder past second<br />\nbase, and robbed Marine of a hit. Aydelotte pitched well, except for his wildness in one inning. Hopkins hits, however, came when they were needed, and<br />\nthereby clinched the game.<br />\nHOPKIN8.—Moore, Ft. R ; Marine, 3rd b.; McKnight, 1. f.; Campbell, c.; Constantine,<br />\n1st b.;<br />\nOgle, 2d b.; Wright, c. f.; Whipple, p.; Crozier, r. f.<br />\nW. AL c.—Williams, c. f.; Carman, r. f.; Roberts, c.; Brown,<br />\n2d b.; Simpson, 1st b<br />\nAydelotte, p.; Henry, 3d b.; Turpin, 1. f.; Moore, R. R.<br /><br />\nScore by innings:<br />\nJ H U<br /><br />\na.<br /><br />\nH.<br /><br />\nB.<br /><br />\n0<br /><br />\n0<br /><br />\n3<br /><br />\n0<br /><br />\n2<br /><br />\n0<br /><br />\n1<br /><br />\n0<br /><br />\n0<br /><br />\n(1<br /><br />\n4<br /><br />\n0<br /><br />\nW. M. 0<br /><br />\n0<br /><br />\n0<br /><br />\n0<br /><br />\n0<br /><br />\n0<br /><br />\n0<br /><br />\n0<br /><br />\n1<br /><br />\n0<br /><br />\n1<br /><br />\n9<br /><br />\n4<br /><br />\nUmpires, Prof. Holton, W. M. C., and N. F. Near, Jr.<br />\nAt the championship games of the Athletic Association at New York, May<br />\n30-31, the following wearers of the Black and Blue will probably participate:<br />\nJ. T. England, '02, (captain); Geo. B. Scholl, M.; W. E Hoffman, '02; R. C.<br />\nHoffman, '03; J. E. Pessagno, '03; W. S. Weedon, G.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nNEXT! CORNELL AND TORONTO!<br /><br />\nHERE is a possibility that our lacrosse season is not yet ended. News<br />\ncomes from Ithaca to the effect that Cornell returned home with the<br />\ninteruniversity championship cup, and that the next victim will he<br />\nHopkins.<br />\nFor the present, our men will be busily engaged in training for the game<br />\nwhich will begin in McCoy Hall, on May 30, and last until June 4. Should it<br />\nbe found possible to arrange a contest with the Ithacans after this ordeal,<br />\nanother victory may be added to our list.<br />\nThe most important contest in view, however, and in fact what would he<br />\nundoubtedly the greatest lacrosse game ever seen in Baltimore, is that which<br />\nmay possibly he arranged with the University of Toronto immediately after the<br />\nJune examinations. Toronto holds the intercollegiate championship of Canada<br />\nfor 1902, and is coming to New York about June 3 to play the Crescent Athletic<br />\nClub. Manager Slemons has received a letter from the management of the<br />\nCanadian twelve, congratulating Hopkins upon its success during the season,<br />\nchallenging us to a contest which shall decide the intercollegiate championship<br />\nof America, the game to be played either here or in New York immediately<br />\nafter the contest with the Crescents.<br />\nAt the dinner given the members of the lacrosse team by Captain Schmeisser on May 14, the question of playing Toronto was brought up and given<br />\nfavorable consideration. Manager Slemons was instructed to make enquiries as<br />\nto whether we shall be able to secure the American League grounds. On<br />\naccount of base ball, these cannot be gotten before June 11. If the Canadians<br />\ncan he persuaded to play the Crescents about June 9, and come to Baltimore<br />\nseveral days later, the game is not only possible but very probable.<br />\nShould we win or lose, such a contest would give a wonderful stimulus to<br />\nthe popularity of the sport among Baltimoreans Our team is acknowledged as<br />\nbeing the strongest ever turned out by Hopkins, and there is a bare possibility<br />\nthat we might. beat the Canadians at their own game. It is at least worth a<br />\ntrial.<br /><br />\nZ<br /><br />\nATHLETIC NOTES.<br />\nThe lacrosse team has elected for next year H. P. Straus, '01, as captain;<br />\nJ. A. Addison, '03, manager; J. R. B. Branch, '04, assistant manager.<br />\nAt the last meeting of the Athletic Association, held on Tuesday of last<br />\nweek, an \"H\" was awarded to W. S. Bird, '03, and the secondary honor, \"H.<br />\nA. A.\" was given to S. Smith. '02, I R. PeIs, '02, and J. B. G. Custis, '03.<br />\nA committee was appointed to take charge of all remaining business, as<br />\nfollows: Dr. Renouf, faculty delegate; R. T. Abercrombie, prsident; J. T.<br />\nSmith, secretary; S. Smith, treasurer.<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br /><br />\nPING PONG PANGS.<br />\nSing a song of ping pong,<br />\nTable and a net,<br />\nBoy and girl are playing;<br />\nIt is a deuce set.<br />\nWhen the game is finished<br />\nShe has won the thing.<br />\nDon't tell me the artful boy<br />\nDon't know how to ping.<br />\nOld Mother Hubbard went to the cupboard<br />\nTo get her poor dog a jacket.<br />\nComing back before long, he was playing ping pong,<br />\nAnd using a bone for a racquet.<br />\nTom Strong could never pong,<br />\nHis wife could never ping,<br />\nAnd so, 'tis true, betwixt the two<br />\nThey cussed the silly thing.<br />\nLittle Boy Blue, come blow your gong,<br />\nSister's beau and she are playing ping pong.<br />\nWhere go the. lovers? To the dark hall.<br />\nWhat are they doing? Hunting the ball.<br /><br />\nLACROSSE RUL1 S.<br />\nDe rules ov de goime is:<br />\nDon't hit so hard dat you break your net—for dey cost money.<br />\nIf yer can't reach de guy what is runnin wid de ball hit de feller who is<br />\nstandin clost to yer.<br />\nAlways hit de long thin fellers, for the fat ones bleed so much on the net<br />\ndat de handle is apt to git too slippery. If de man won't drop de ball after yer<br />\nhave pounded him for five minutes, git de strangle hold onter him and give him<br />\na dint between the eyes.<br />\nDe Marquis of Queensbury Rules goes in de fight, hut if yer has any up yer<br />\nsleeve dat yer likes better, it don't make no difference.<br />\nOn de whole de goime is de best whatever and makes foot ball look like<br />\nparlor croquet; and if yer wants to see a fine gentle sport dat reminds yer of de<br />\nChicago slaughter house go to de next Lacrosse Goime.—The Widow.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br /><br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nIA a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW.D. BOWEN, M. D., D. 0.,<br />\nProst. &amp; Mgr.<br />\nESTABLISHED 1879.<br /><br />\nedding Silver rig\"<br />\n11111111111111111.1111111111<br />\nIN GREAT VARIETY.<br /><br />\nei* slLiNKINS.<br />\n21e N. CHARLES ST.<br /><br />\nSilversmiths.<br />\n_<br /><br />\ntienderson's<br />\ndent'_s Supplies.<br /><br />\nWETtFR &amp;<br /><br />\nJic<br /><br />\nMadison&amp;HowardSts.<br /><br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Bernard's London Mts.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere Hats. or<br /><br />\n34 W. BALTIMORE ST.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nST A TIONERV—For School, Family, Office and Bank.<br /><br />\nII. R. E1SENBRANDT SONS,<br /><br />\nfor<br /><br />\n4ORDAN STRBLER GO. blials:rN\"IvE.<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n'201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br /><br />\nr<br /><br />\nNix Ground Spices —no adulteration, all strictly pure.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\nF3oohsellers and<br />\nStationers.<br /><br />\nSCHOOL, LAW MEDICAL• CLASSICAL AND MISCELLANEOUS BOOKS<br /><br />\nProfs. G. W. Lehman it Son,<br />\nReads as follows: Samples submitted of<br />\nPreneli Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nhorry—no coloring or adulterants, absolutely pure wine.<br />\ntYe %Vhlskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\n(Hive 011—all tests show pure olive oil.<br />\n•krong. VInegar—natural cider vinegar, strictly pure and<br /><br />\nO.<br /><br />\nHATTERS, CANES, ETC.<br /><br />\nUMBRELLAS,<br /><br />\nCertificate of Analysis from<br /><br />\nOtto H. NVilliarns,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br /><br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital, $650,000<br /><br />\nSurplus and Profits $450,000.<br /><br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\n•4P\\ORTII GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nJAMRS R. PA INK.<br /><br />\nTHRO. WARNIIR.<br /><br />\nCUSH:NG &amp; COMPANY,<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\ntzt Books. Note Books,<br /><br />\nH. MOIA ENS, D.0..<br />\nSoe'y. &amp; Treas.<br /><br />\nMARIA BUIE, D.0.,<br />\nV.-Prot.&amp; Asst. Seciy.<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nDIRECT.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Erns!<br /><br />\n'BALTIMORE, MD.<br />\n1.<br /><br />\nTweotg-Sixth Tear.<br /><br />\nBeginning October lt,t, 1901.<br /><br />\nPresident,<br />\n.<br />\n•<br />\n•<br />\nDenn of the Medical School,<br />\nDean of the College,<br />\n.<br />\n.<br /><br />\nIRA BEMSEN.<br />\nWM.II. HOWELL<br />\nEDW. H. GRIFFl c.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. 1).)<br />\n(b) In Medicine. (Courses for candidates for the de<br />\ngree of M. D.; coursos for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates tor the llogree f B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody institilte<br />\nPratt Library<br /><br />\n10(1,000 volumes.<br />\nrg.1,000 vol iTO.<br />\n200.000 votilines.<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries,<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nItems rice,<br />\nEnglish,<br />\nII istory,'<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirecters.<br />\nIra Reinsert.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin<br />\nWilliam H. Howell.<br />\nWilnam If. Welch.<br />\nJohn.). Abel.<br />\nJohn,.1. Abel.<br />\nWilliam Order.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirbu F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHelm, Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\n.1. H. Hollander.<br />\nPrank Morley.<br />\njiisepti S. Antes.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\nClassical (the \"Old College Course.\")<br />\nMathematical Physiea<br />\n(leading up IA l Engineering.)<br />\na.(chemical- Biological.<br />\n(leading tip to Medicine.)<br />\n4. Geological- Biological.<br />\n6. Latin Mathematical.<br />\n11. Historietti-P(diticat.<br />\n(leading up to Law.)<br />\nI. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics (vol. X XIV.)<br />\nFrank Morley.<br />\nChemistry (vol. XXVII.)<br />\nIra Remsen.<br />\nPhilology (vol. XXIII.)<br />\nBasil L. Gildersleeve.<br />\nHistory (vol. XX.)<br />\nJ. M. Vincent,.<br />\nModern Language.(vol. XVII.) A. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nMaryrioiogy (vol. Iv.)<br />\nPaul Hauptrat)erialental Medicine (vol. VI.) W.B. Welch..<br /><br />\nAmerican Journal of Ilatheaaatica.<br />\nP. MOH.LEY. Editor. Quarterly. Ito. Volume X XIV<br />\nin progress. $5. per volume.<br />\nii American Chemical Joarnal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXVII<br />\nIn progress. $5. per volume.<br />\nIli. American Journal of Philology.<br />\nB. L. GI IMERSLKEVE, Editor. Quarterly. 8v0.<br />\nVolume XXIII in progress. $a per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5. per volume.<br />\nStudies in Historical and Political Science.<br />\nMonthly 8vo. Series XX in progress. sa. per<br />\nvolume<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol X X I in progress. $1. per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly Ito.<br />\nVolume XIII in progress. $1. per year.<br />\nv Ill Johns Hopkins Hospital Reports. 4to. Volume X<br />\nIn progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A ssyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. H7•50<br />\nper volume.<br />\nX I. Modern Language-Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Hi-monthly. 8v0. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. Ito.,<br />\nPer<br />\nvolume.<br />\nx i V. Reports of Maryland Geological Survey.<br />\nWILLIAM T1. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Mee'<br />\ntrinity.<br />\nL. A. BATTER, Editor. Quarterly.<br />\nave. VolurneVIlin progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Tree\"<br />\ntefiS, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of oilleerm end students, and stating<br />\nthe regulations, etc., of the University. l'ulr\"<br />\nUMW at the close of the academic<br />\nIn addition to the serials above named,copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospeetus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. 13111\"<br />\nlegs, Editor. 110 pp. Ito. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. Ito. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegornena.EpistIes. Edited by I. H. Hall. MOO.<br />\nIlibliographia Hopkinalemils. Part I. Philology. Parte<br />\nII-Ill. Chemistry, Mineralogy and Geology. ra.rtg<br />\nIV-V-VI.Physics, Astronomy and Mathematics.<br />\n8 vo. 110 cents per part.<br />\nfull list of publications will be sent on application.<br />\nGommesiestions in respeet to exchasges and renal** vow*<br />\nslag bosom% te Jokes 'Hopkins Press, Baltimore,<br /><br />\nProgrammes of the Courses offered to graduate innciente in Philosophy told the Arts, and in the School of<br />\nMedicine, and also of 3,110 Undergraduate or Collegiate<br />\nVourees, will be sent on application to the Registrar.<br /><br />"}], "field_media_file": [{"target_id": 36232, "display": null, "description": null, "target_type": "file", "target_uuid": "810803bb-9c11-44cf-bbe5-fcb646b63393", "url": "http://digital.library.jhu.edu/system/files/2022-03/12214-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12214, "target_type": "node", "target_uuid": "298128b5-8788-4208-a631-753034684430", "url": "/node/12214"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "70b2234c-9c3e-40eb-86df-2865bac04d5c"}]}