{"mid": [{"value": 37115}], "uuid": [{"value": "93fc90e5-233d-4457-b6d9-965ac8a5f294"}], "vid": [{"value": 37115}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:59:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13192-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:59:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:59:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXX, No. 23<br />\nTRIP OFFERED TO JAY'S<br />\nLEADING BUSINESS<br />\n• CANDIDATE<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 22, 1925.<br />\n<br />\nRifle Team Easily<br />\n•Beats Dartmouth<br />\n<br />\n\"LOCARNO AND AFTER,\"<br />\nSUBJECT OF TALK BY<br />\nMR. ZIMMERN<br />\n<br />\nContinuing its recent record-<br />\n<br />\nSwimming Will Begin<br />\nAfter Holidays<br />\n<br />\nPRICE 5 CENTS<br />\nSOPHOMORES BEAT FROSH<br />\nIN ANNUAL CLASS<br />\nDEBATE<br />\n<br />\nAlthough the schedule for the<br />\n<br />\nQuestion Of Junior College And<br />\nCups To Be Awarded Best Members breaking feat, the Rifle Team last Speaker Describes Conference And<br />\nSwimming Team is not as yet enDiscusses Europe's Present<br />\nCollege Of Arts And Sciences<br />\nOf Art, Editorial, And<br />\nweek defeated Dartmouth Univertirely complete, the team will beFinancial Status<br />\nDiscussed At Assembly<br />\nBusiness Staffs<br />\n<br />\nsity by 1914 points to 1834 pointS<br />\n-The importance of national<br />\nout of a possible 2000. Newcomb,<br />\nis a minor matter compared<br />\ndebts<br />\nagain leader with a total of 387,<br />\nand Reiblich, Garis, Baird, and with that of the vast flow of priGlantz made the five high scores vate credits passing • from this<br />\nwhich counted.<br />\ncountry to Europe,\" asserted Mr.<br />\nRawlins was not prevented by Alfred Zimmern, in his lecture,<br />\nAlthough no definite date has<br />\nhis bad hand from firing, and he<br />\nbeen set, the trip will probably missed fifth place by only a single -Locarno and After,\" last Wednesday.<br />\nbe taken during the Easter holi- point.<br />\nMr. Zimmern is Chief of the Inday. This decision_ was made at<br />\nAn interesting fact is that the<br />\nthe meeting of the Board of Con- second five men shot a total of ternational Institute for Intellectrol of the Black and Blue Jay, just two points more than Dart- tual Co-operation, at Paris, and<br />\nmouth. The combined score of came to Johns Hopkins as a lecheld last Wednesday.<br />\ntile first ten men, to be counted<br />\nturer of the George Huntington<br />\n• Three Silver'Cups<br />\nagainst West Virginia, was 3770.<br />\nA silver cup is to be given to<br />\nMemorial Lectureship.<br />\nThe latter has not yet been heard Williams<br />\nthe member of the Editorial Staff,<br />\nSecond -Visit<br />\nfrom.<br />\nAt the beginning of his talk,<br />\nthe Art Staff, and the Business<br />\nA four-day trip to New York,<br />\nWith all expenses, is the reward<br />\noffered to the candidate for the<br />\nBusiness Staff of the Black and<br />\nBlue Jay doing the best work.<br />\n<br />\ngin practice in the brand-new<br />\nKnights of Columbus pool as soon<br />\nas it is filled with water. An organization meeting will be held<br />\non the first Wednesday after the<br />\nChristmas holidays, and it is expected that a big turn-out will appear. Besides the new men available in the freshmen and sophomore classeS, there are eight men<br />\nout of twelve left from the 1924<br />\nteam. Captain Welsh is waiting<br />\nonly for the announcement of the<br />\nresults of the meeting of the Eastern Collegiate Swimming Association, held last Sunday, to begin<br />\n<br />\nimi a contest that was featured<br />\nby good arguments and bad, the<br />\nsophomore class defeated the freshmen in their anual debate at the<br />\nassembly last Thursday. The victorious team defended the argument that -The American College<br />\nof Arts and Sciences should be<br />\nabandoned, the first two years being combined with the preparatory course and last two years<br />\nwith graduate and professional<br />\ncourses.\" The judges, Mr. Paul M.<br />\nWagner, Capt. P. 0. Strong D. 0.<br />\nL., and Mr. R. C. McDaniel, were<br />\nunanimous in their decision.<br />\nThompson Speaks First<br />\n<br />\nCary Thompson, the initial<br />\nspeaker, explained some well made<br />\nserious work with this year's ma- graphs which illustrated the featerial.<br />\nsibility of the Junior College. He<br />\nstressed the rapid growth of this<br />\nFOR<br />\nOUTLINED<br />\nnew institution in America. He<br />\nNEW PLAN<br />\nHULLABALOO AT<br />\nalso pointed out that nearly fifty<br />\nMEETING<br />\n•<br />\nper cent. of the men who entered<br />\ncollege leave at the end of the sophMethod Proposed By Turnbull Would<br />\nFrom this, he<br />\nomore year.<br />\nBegin With Sophomore Class<br />\nthe<br />\nonly men who<br />\nthat<br />\ngathered<br />\nHenry R. Turnbull, Editor-instayed after this time were the<br />\nChief of the 1926 Hullabaloo, at a professionally inclined, so there<br />\nmeeting of the freshman class yes- should be given the chance to work<br />\nterday gave a short talk on a pro- under the improved conditions<br />\nposed plan for the election of the which the Junior College plan<br />\nstaffs of future Hullabaloos. He offered.<br />\n<br />\nStaff doing the best work in his ALUMNI GIVE $400,000 IN Mr. Zimmern expressed pleasure<br />\nHALF-CENTURY FUND<br />\nupon again visiting Hopkins, after<br />\nfield. The awards will be made<br />\nDRIVE<br />\nin one of the last assembles of the<br />\nan absence of three years. He reReport<br />\nAs<br />\nChairmen<br />\nTo<br />\n225<br />\nDistrict<br />\nhow, during his previous<br />\ncalled<br />\nscholastic year.<br />\nGraduates' Effort Ends _<br />\nvisit in January, 1922, he had sent<br />\nThe subscription campaign has<br />\nThe Alumni drive for the Half- the manuscript to England for his<br />\nprogressed rapidly. A fierce strugDegle is being waged by the subscrip- Century Fund officially ended<br />\nbook, \"Europe in Convalescence.\"<br />\ncember 15. The district chairmen,<br />\nThe Locarno Treaty, said Mr.<br />\ntion solicitors for the coveted ten<br />\nof which there are about 225, situ- Zimmern, is the result of Europe's<br />\ndollars, to be given to the man<br />\nin the major cities of the<br />\n• xecuring the greatest number of ated<br />\nattempt to create political and<br />\nworld, have been ordered tc turn<br />\neconomic stability without help<br />\nsubscriptions. At present, a man<br />\nin official reports of the amounts either from outside or revolution<br />\nWho has secured seven subscripthey have solicited. However, within. Delegates came to Locartions is leading the field.<br />\ntwenty-two<br />\nof these chairmen have no with an entirely different spirit<br />\nService Department<br />\nOther Talks<br />\nThe establishment of a Service been granted permission _to solicit from that of the Paris Conference. proposed that all Hullabaloo ofThe argument for the negative<br />\nDepartment -seems quite likely. funds as long as they continue to They came with a determination fices be competitive, for three or was started by Carroll N. Rill. He<br />\nta—coffea-tile-faults of Enrope four years' work, just as the NEWSThe functions of this department obtain good results.<br />\nwas of the opinion that, in some<br />\nand<br />\nthey met together in a genial LETTER and the Black and Blue<br />\nvague way, the present college syswould be to relieve the Business Approximately $400,000 has been<br />\nand sympathetic manner.<br />\nJay are now.<br />\ntem is the best that could possibly<br />\nstaff of some of the advertising raised from the Alumni and much<br />\nHe gave as his reasons that the<br />\nSteadying Influence<br />\nbe desired. Donald Niles conWork. The Service Department more than this amount from their<br />\nThere are seven elements, de- new plan would take the offices<br />\ncluded the affirmative argument<br />\nwould attend to handbills, postfriends. About 2,000 of the Alum- clared Mr. Zimmern, that have re- out of politics, it would insure an<br />\nwith an explanation of another<br />\ners, and bulletins. Such things<br />\nestablished the stability of Europe. experienced staff, and the result chart. This one announced that<br />\nas the. automobile Census would ni have already contributed, and<br />\nThe first of these elements is the would be a better book. He cited the average of Junior College stucome under the work of this de- from 1,000 to 1,500 mor'e are exhealing<br />\npower of time which has Columbia's experience with the dents for a number of years was<br />\npected to have contributed when<br />\nPartm ent.<br />\nallowed<br />\npeople<br />\nof different nations same method, and said that the 81%, while that of regular univerA most interesting talk was the complete report comes in.<br />\nColumbian is one of the best an- sity men was 79%. The negative<br />\nto forget their former hatreds.<br />\ngiven by Maxwell Cone on the<br />\nThis Means that one in every<br />\nnuals<br />\nproduced. By the method argument was completed in a<br />\nPrinceton. Tiger. Cone, while at three of the Alumni has contribu- • The second is the growth of the<br />\nColumbia the officers of vivid burst of oratory by John B.<br />\nused<br />\nat<br />\nthe convention of colleges for ted to-the fund, a record which has influence of democracy. At the<br />\nthe<br />\nbook<br />\nare elected by the retir- Littlefield. His stirring defense<br />\nWorld Court discussion, was never been approached before. The present time, democracy has being<br />\nstaff.<br />\nof fraternities, athletics, and actshown through the offices of the Committee has received contribu- come the principle of the majority<br />\nIf the freshmen and sophomores ivities as the training ground for<br />\nof<br />\nEuropean<br />\npeople.<br />\nTiger, and was able to thoroughly tions from India, Japan, and a<br />\nboth agree on this matter, he will stalwart Americans drew<br />\nrounds<br />\nThe improvement in the politifamiliarize himself with its func- great many from China; in fact<br />\nthe matter before the Stu- of applause from the<br />\ntake<br />\ntions.<br />\nfreshmen.<br />\nfrom every nation in the world. cal and economic condition of the<br />\ndent Activities Council and the<br />\nRebuttals<br />\nIt was announced that Sher- These countries have all felt the peasants is another great factor.<br />\nFaculty Oommittee on Student<br />\nAfter a short intermissiOn, Louis<br />\nwood, Gibbs, and Levi had been influence of the Johns Hopkins The war enormously increased the<br />\nAffairs, and if his plan is adopted, M. Volansky, chairman of the<br />\nelected to the Business Staff of University. The first returns from value of agriculture, and the high<br />\nit would start with the present freshmen debaters, presented the<br />\nthe Jay.<br />\nprices caused by the demand for<br />\n(Cont. on p. 2, col. 3)<br />\nsophomore class.<br />\n(Cont. on p. 3, col. 3)<br />\nfood. allowed the peasants to pay<br />\noff mortgages.<br />\nPROFS TO SPEND YULETIDE AT<br />\nMUSTY RELICS OF PAST FASHIONS<br />\nNational Debts<br />\nVARIOUS SOCIETY. CONVENTIONS<br />\nSTAGE COMEBACK ON CAMPUS<br />\nA fraternal feeling has developed<br />\nThe general exodus of faculty<br />\nDr. Robinson will also speak be- among the nations of Europe, Reminiscent of '9S when HopFrance and England have had<br />\nMembers to meetings of various fore the Archmological Institute caused. by their common indebted- kins seniors were be-whiskered their influence on Homewood,<br />\nSocieties over the country during of America, convening at Cornell ness to the United States of Amerand be-derbied, the campus has which has already become accusthe Christmas holidays has be- the same week.<br />\nica. Mr. Zimmern also believes<br />\ntomed to the melodious French<br />\ncome an annual event, and this The largest representative gather- that America is creating a bad blossomed forth with the stiff horn and is fast adjusting itself<br />\nYear is no exception to the rule.<br />\ning of Hopkins men will attend a feeling by examining the budgets black representatives of hatdom. to the derby, so universally worn<br />\nProfessors from every depart- joint meeting of the middle west- of European countries in order to It is to be assumed that the whis- in England. But Europe is not<br />\nnient in the university will repre- ern and eastern sections of the determine how much they are real- kers will follow.<br />\nalone in- contributions to campus<br />\nsent Hopkins in their respective Modern Language Association to ly able to pay. Creditor relationAlthough few have chosen to vogue. There is the great Amerilines of work.<br />\nbe held at the University of Chi- ship should not give the :United display their derbies in daytime, can suggestion—the wild and<br />\nAt a meeting of the Philological cago, December 29-31.<br />\nStates the right to examine the dances, it is reported, are quite woolly fur coat. What with fur<br />\nAssociation at Cornell December Dr. George W. Small, instructor budgets of other nations. Regard- universally derbyized.<br />\ncoats, French horns, and derbies,<br />\n29-31, Dr. David M. Robinson, in English, will read a paper on ing war debts, Mr. Zimmern added<br />\nSummoned from the grave in the campus reminds one of a midProfessor oi Archwology, will lec- \"The Old English Particle 'The.'\" that it is normal for young coun- which it has been interned for summer night's dream in January.<br />\nture on an -inscription describing<br />\nDr. Kemp Malone, lecturer in tries to borrow from old countries many years, it would seem that<br />\nWeather long ceased to exert<br />\nthe deeds of the Roman Emperor English, is to talk on -The Finn since the young country has un- the derby is coming back into its the slightest bit of influence on coldeveloped natural resources and own in collegiate styles. Down- lege styles, judging from recent<br />\nAugustuf,. Dr. Robinson pieced Episode in Beowulf.\"<br />\ntogether ,the inscription from 300 \"The Immortality of Beauty in is capable of soon paying off the town stores report record sales of display of campus apparel. Great,<br />\nfragments of stone found in the Keats' Poetry\".is the subject to be debt. It is, however, a complete the long forgotten head-piece. grisly, bear-like hulks lumbering<br />\nexcavatims in Pisidian Antioch. presented by Dr. Raymond Dex- reversal of precedent when old Whole groups are said to have down the Barn drive<br />\nare now but<br />\n-Dr. Charles W. E. Miller, Profes- ter Havens, ,<br />\nnations borrow from younger ones. invested in the bats, while Charles common spectacles. More than<br />\n80r of Greek, will read a paper on<br />\nMr. Zimmern. also stated that Street is.: co-nsiderably toned • by 'one of the lumbermen have that<br />\nDr. Herman Collitz, Professor<br />\nldiersl, eve.<br />\nderby black-. (Cont. on p. 4, col. 3)<br />\n(Cont. on p. 2, col. 5)<br />\n(Cont. on p. 3, col. 3)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925 •<br />\n<br />\n2<br />\n<br />\nMR. ZIMMERN SPEAKS<br />\n(Cont. from p. 1, col. 3)<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1807<br />\n<br />\nYES and NO<br />\nTWO NOTES ON ACTIVITIES<br />\n<br />\n$9.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nHomewood 0100<br />\n<br />\n'Telephone.<br />\n<br />\nLast Friday we spied a Blue Jay in a friend's pocket.<br />\n\"Ah-h-h! The Jay's out!\" we exclaimed rapturously.<br />\n\"So to speak,\" we were told.<br />\n\"Now, what?\"<br />\n\"I mistook it for Life,\" explained our friend.<br />\n\"Pretty good, is it?\"<br />\n\"Well . . . You see, Friday's my day for a haircut, so I'd<br />\njust been reading the Florida number of Life before I got my<br />\nBlue Jay. The first pages I opened to had two big cuts . . .<br />\nAnyway, I turned back to the cover wondering who had sent<br />\nme a copy of Life.\"<br />\n*<br />\n<br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br />\n<br />\nBusiness Manager<br />\nOTHO J. KELLER III, '26<br />\n<br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\nCHARLES F. REESE, '27<br />\n<br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, 926<br />\n<br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nA. RISLEY ENSOR, '26<br />\nRICHARD R. GRIFFITH, '28<br />\nMORTON HAMBURGER, JR., '28<br />\nJunior Editors<br />\nW. BARNES HALL, '26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nBRINTON STONE,'27<br />\nDONALD NILES, '28<br />\nLAWRENCE KATZENSTEIN, '28<br />\nCORNELIUS S. FRAN CKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\n<br />\nCirculation Manager<br />\nROBERT T. SAUERWEIN, '26<br />\n<br />\nAssistant Business Managers<br />\nHEYWARD E. BOYCE, JR., '27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, '27<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN,'28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br />\n<br />\nMember Southern, Intercollegiate Newspaper Association<br />\nPrinted,by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 22, 1925.<br />\n<br />\nDOLLAR DIPLOMACY<br />\nAt the beginning of the holidays, that brief period of the<br />\nyear when Christmas cheer and a spirit of good-will toward<br />\nmen is prevalent, the most recent philanthropy of the Interfraternity Board should not be overlooked. Their reduction<br />\nof a five-dollar fine to one dollar shows a lack of bitter fraternity feeling which is commendable, but, viewing the action<br />\nfrom other angles, the NEWS-LETTER is doubtful as to whether<br />\nthe policy is a wise one.<br />\nWhat is significant in the reduction is that it was not a<br />\nspontaneous display of generosity in a special instance, but a<br />\nconsistent folloWing out of a policy which has been pursued all<br />\nyear. Three times this fall, fraternities have been duly convicted of a breach of the Rushing Agreement, and in all three<br />\ncases the fines have reached the staggering amount of a dollar.<br />\nNo one need be surprised at the results. Punishment by<br />\nthe Board has assumed a somewhat farcical nature, and this<br />\nin turn leads to hasty convictions. For, Ns/lien the punishment<br />\nis so light, an accused fraternity is convicted on trivial grounds<br />\nwithout causing the jury of its peers much mental exertion in<br />\nconsidering the case. If conviction is regarded as a blot on<br />\nthe 'scutcheon, such liasty verdicts are had; if it comes to be<br />\npractically disregarded, matters are worse.<br />\nThe NEWS-LETTER IS in. favor of bigger fines.<br />\nJ. H. J.<br />\n<br />\nSEASON'S GREETINGS<br />\nToday this column should be draped with holly; it should<br />\nbe printed in green ink with red borders. But since our<br />\nprinter cannot cope with our orders in this particular respect,<br />\nwe have to do without, and wish all of our readers, both constant and casual, a very merry Christmas and an exceedingly<br />\nprosperous New Year in cold, colorless print.<br />\nOur heart overflows with righteous and perfectly legal<br />\nspirits. The tang of the season is in the air; the crowds on the<br />\ndownton streets remind one of the approaching holidays, and<br />\nthe vacant, longing expression of the students heralds the<br />\nexpected advent of a short vacation. We feel at peace with the<br />\nworld.<br />\nIf we keep up at this pace much longer, the leading ladies'<br />\npublications will be on our trail to write seasonal leaders for<br />\nthem. We are so darn mellow that we almost weep at the<br />\nthought of any distraction that would interfere with our jovial<br />\nmood. So we shudder at the idea of studies, and add to our<br />\nwishes: A holiday free from work of any sort, kind or description.<br />\nTo all of our subscribers, and any others who feel as if<br />\nthey could stand it, we extend our very best wishes for a merry<br />\nChristmas and a happy New Year. In fact, we repeat that wish<br />\nfor the third time: Pleasant holiday to all!<br />\n<br />\nFrom our outside-looking-in viewpoint, we can't help marvelling at the importance that 0. D. K. attaches to class offices.<br />\nTo have been a class officer is a real distinction in the eyes of<br />\nthat influential body. Or, we are very much mistaken.<br />\nThat such an attitude toward .class honors is the heighth of<br />\nthe absurd becomes plain if one reduces it to fact in a simple<br />\nstatement. Take, for example \"Smith is a real man. Why,<br />\nhe's vice-president of his class!\" Again: \"If Brown hasn't a<br />\nlot of ability, why did his class elect him president? Answer<br />\nme that!\" Or: \"Sure, he's very popular with those who know<br />\nhim. He was secretary of his class in his junior year!\"<br />\nIs anyone ever guilty of such remarks? Certainly not,—<br />\nexcept freshmen, and alumni in their dotage. What we actually<br />\nhear are such remarks as these: \"Yeah, some Mu Cow Mu'll be<br />\npresident.\" \"Oh, one of the Engineers is sure to get that job.\"<br />\n\"Of course, everybody admits that he's the best man; but do<br />\nyou think there's any use for him to run?\" \"The hell he will<br />\nhe secretary! Why, he's a damned Jew!\" \"One of those -locals is sure to get treasurer!\" And so on, and so forth,<br />\nad nauseam.<br />\nAfter all, what difference does it make?• With the unfortunate exception of the treasurer, the functions and duties of<br />\nany given class officer are so simple ,any child can play them<br />\n(italics ours). We have yet to hear a discussion of whether<br />\nso-iand-so was, or will be., a \"good\" or \"bad\" class officer.<br />\nAnd yet class honors have found favor in the eyes of the<br />\nHopkins campus, and, in particular, in the voice of its glorified mouthpiece, Omicron Delta Kappa. The reason is hard<br />\nto find. Perhaps it is an outgrown convention of the good old<br />\ncollege days when men were men. Perhaps it is the persistence of a kotowing habit, acquired to excess in our high school<br />\ndays. More than likely, however, it is an atavism dating from<br />\nour early worship of the Rover Boys.<br />\n<br />\nGET UP AND BOW<br />\n<br />\n(Cont. from p. 1, col. 2)<br />\n<br />\ninstrument for carrying on the<br />\naffairs of Europe.<br />\nGreat Britain has also 'thrown<br />\nin her lot with the continental nations and is risking her empire<br />\nupon the power of the League of<br />\nNations. Lastly, there has developed a new consciousness in European youth who declare that they<br />\nnever again will endure the horrors of war. The veteran soldiers<br />\nof the war are uniting themselves<br />\nwith their younger brothers with<br />\na firm determination that war<br />\nshall never come again.<br />\n<br />\nFriday's Lecture<br />\nOn Internationalism<br />\nIn the second lecture at Homewood this week on \"International-ism and Education,\" delivered at<br />\nthe Civil Engineering Building<br />\nlast Friday, Mr. Alfred Zimmern<br />\nexpressed the desire to have a better international understanding so<br />\nthat each nation might more readily see the point of view of the<br />\nother.<br />\nMr. Zimmern spoke of this country as being well fitted to carry<br />\nout the work of international understanding. He said that this<br />\ncountry is the most highly organized nation in the world. He mentioned the proposed Walter Hines<br />\nPage School of Diplomacy as an<br />\ninstitution calculated to further<br />\ninternational understanding.<br />\nMr. Zimmern then spoke of national culture. Whether there is<br />\na place for it or not, the various<br />\nnations feel that by developing a<br />\nculture of their own they are expressing their personality.<br />\nDON'T FORGET!<br />\n<br />\nWe ask the staff of the Blue Jay to get up and bow, for<br />\nwe are about to throw verbal bouquets their way. The boys<br />\nare getting good,—they are fast becoming professional in touch;<br />\nthey are actually humorous. The last two issues are the evidence in the case.<br />\nThe \"Faculty Number,\" although it had little to do with<br />\nthe faculty,—roasted them little, praised them none,—was,<br />\nnevertheless, a pretty good sample of a college humorous publication. It had jokes that were really spicy; it verged at times<br />\nupon the risque; it was as pure as a censored play in places,—<br />\nbut no matter what type of matter it contained, it was funny,<br />\nthe jokes were good.<br />\nNow we 'have just been given a glimpse or two at the<br />\n\"Christmas in Florida\" number. It is a big edition, but it is<br />\nfunny enough to suit us, and that's funny as the deuce. Yes;<br />\nit is a bigger and better Jay.<br />\nSome time ago, the editor of the Black and Blue Jay; while<br />\non a flying trip to the NEWS-LETTER office, promised us that the<br />\nJay would be-humorous when-the NEWS-LETTER was_aecnrate.<br />\nWe have noticed no change in our sheet, but we thank the bird<br />\nfor the implied compliment. •<br />\nStand up, Black and Blue Jay, and take the applause!<br />\nALUMNI DRIVE ENDED<br />\n<br />\nthe growth of the influence of the<br />\nLeague of Nations is causing that<br />\norganization to become the main<br />\n<br />\ncANFORDS<br />\ngieI<br />\ne Oi<br />\n<br />\nFlorida were received last week,<br />\nbut they averaged above $300 per<br />\n<br />\niJ FOUNTAIN PEN<br />\n<br />\ncontributor.<br />\nSeveral days ago a beautifully<br />\nengraved check for fifty lira was<br />\nreceived from an Italian contributor. It was an impressive check<br />\nto present to the bank, its dimensions being five inches by fourteen.<br />\nThe Committee suffered considerable disappointment when it was<br />\ninformed by the bank officers that<br />\nthe check totaled $1.98 in American money.<br />\n<br />\nINK<br />\n<br />\n—clothes that are tailored to<br />\n<br />\nyour measure fit you best. I<br />\n—they have the right cut..<br />\n—they make you feel well.<br />\ndressed.<br />\n<br />\nrirA11,43]Ft$<br />\nc;t/firkt ore<br />\nSee \"GARD\" MALLONEE & FRAMK MEREDITH at the Barn<br />\nDowntown at 407 N. GAY St.<br />\n<br />\nfiirrru Tilimmao<br />\nTO YOU ALL<br />\n1VAMTAMX<br />\n<br />\nST. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\nJust Below<br />\nNorth Avenue<br />\nAlways Open<br />\n<br />\nALWAYS GOOD<br />\nALWAYS THE SAME<br />\n<br />\nNICHOLAS BROWN.(41ang.<br />\n<br />\n'<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925<br />\n<br />\nDeveloping<br />\nThe other two examples, how- gone through the Hopkins R. 0. T. Kodaks<br />\nLET US SUGGEST<br />\nPrinting<br />\nCameras<br />\ncommissions<br />\nC.<br />\nhold<br />\nand<br />\nin<br />\nnow<br />\never, are more serious. In these<br />\nMAILBAG<br />\nHIS CHRISTMAS GIFTEnlarging<br />\nSupplies<br />\nthe Editor, ostensibly and accord- the Officers' Reserve Corps of the<br />\nAll letters intended for publication<br />\nU. S. Army, will agree ivith me.<br />\n-at the—<br />\ning to general belief, interpreting<br />\nmust be concise, written in ink on<br />\nZepp Photo Supply Co.<br />\nAnd<br />\nonce more I regret that we<br />\nregular letter size paper, on one side<br />\nand voicing the opinion of the unonly.<br />\nmust differ.<br />\nCOLLEGIATE SHOP<br />\nNo attention will be paid to anony3044 Greenmount Ave.<br />\ndergraduate<br />\nbody,<br />\ngave<br />\nwhat<br />\nI<br />\nI suppose I am only another of<br />\nmous letters, but names signed as an<br />\nevidence of good faith will not be<br />\ncannot help but feel to be personal these alumni who come back after<br />\nprinted if request is made that they be<br />\nop;nions. It may be true that-the several years and decide that the<br />\nLet Us Develop Your Films<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nLeave Them Today—<br />\npresent undergraduates are doing<br />\nCHARLES ST., BALTIMORE<br />\nundergraduates<br />\nare<br />\nheartily<br />\nin<br />\nbe taken as an indorsement of its views<br />\nTomorrow<br />\nThem<br />\nGet<br />\neverything<br />\nwrong.<br />\nHow<br />\nI<br />\nused<br />\nto<br />\nby the \"News-Letter,\" which invites the<br />\nfavor of Dr. Goodnow's new plan.<br />\nfreest discussion of matters of general<br />\nhate them! But, Mr. Editor, I just<br />\nIt may be true also, that everyone<br />\ninterest.<br />\nhad one attack of boils too many.<br />\nVernon 2355<br />\nis as antagonistic to the R. 0. T. Although the sound may be deBANNER AND PENNANT SHOP<br />\nECHOS FROM THE PAST<br />\nFLAG,<br />\nTHE<br />\nPrinters of<br />\nC. as the Editor, through his col- ceiving, my name is not spelt or<br />\nSUCCESSORS TO SISCO BROS.<br />\nTo the Editor-in-Chief of the Xews- umns and those of the<br />\nPHILOLOGICAL<br />\n& SCIENTIFIC<br />\nBands,<br />\nArm<br />\nPennants,<br />\nBanners,<br />\nFlags,<br />\nBaltimore pronounced \"Job\" and my patience<br />\nSchools,<br />\nBanners<br />\nfor<br />\nSilk<br />\nNovelties.<br />\nPUBLICATIONS<br />\nLetter.<br />\n-Et-ening Sun,\" gave us to believe. just gave out. I am sorry.<br />\nSocieties and Fraternities.<br />\nVery respectfully,<br />\nDear Sir:<br />\n23 S. Hanover St., Baltimore.<br />\nIt may be that conditions on the<br />\nR. H. TAYLOR<br />\nJOE LEOPOLD, '24. 302 PARK AVENUE, BALTIMORE.<br />\nIf Job himself were back on Hopkins campus have changed<br />\nearth now, and could have the that much in two years. But, I<br />\nPhone: Homewood 9621<br />\nprivilege of scanning the editorial hope the Editor will forgive me if<br />\nENGLISH OVERCOATS<br />\nI doubt it.<br />\nFROSH-SOPH DEBATE<br />\ncolumns of your :esteemed publi$30.00 to $75.00<br />\nOne more word in defense of the<br />\n(Cont. from p. 1, col. 6)<br />\nFANCY DELICATESSEN<br />\ncation, I fear the old boy would Hopkins<br />\nR. 0. T. C., that auto-. rebuttal. Vernon Scheidt, chair2022 N. Charles St., Balto., Md.<br />\nlose one perfectly good reputation. cratic, militaristic and<br />\nentirely in- man of the sophomore team, con- Mc PHERSON'S SPECIAL RATES FOR HOPKINS STUDENTS<br />\nMr. Editor, I was on the NEws- defensible body. I had four years cluded the debate with a number<br />\n1<br />\n1 E. BALTIMORE ST.<br />\nLETTER Board very recently, and of it at Homewood, in addition of well-planned arguments. He<br />\nhad ample opportunity to observe to six weeks at Plattsburgh and showed many instances where the<br />\nsix more at Camp Meade. I un- negative team had contradicted its<br />\nat first hand its advantages, its<br />\nPhone: Calvert 4835<br />\ndoubtedly swore at it; in fact, I own arguments. In general, his<br />\ndefects, and its I:Mk-res. I doubt<br />\nCARL J. DOEDERLEIN<br />\nwouldn't be really surprised if I delivery and sensible thought enwhether these policies could have had gone as far as<br />\nWATCHES,<br />\nabled<br />\nhim<br />\nto<br />\nstand<br />\nout among the<br />\nto term it the<br />\n\"THE WONDER MOTOR FUEL<br />\nchanged materially in such a short -damn army,\"<br />\nJEWELRY<br />\nDIAMONDS,<br />\nspeakers.<br />\nwhich epithet the<br />\ntime. My impression then was Editor sees fit to<br />\nconsider a term<br />\nFINE WATCH, CLOCK & JEWELRY<br />\nthat the function of the editor of of the most vile<br />\nPOPULARITY<br />\nREPAIRING A SPECIALTY<br />\nopprobiuni. But<br />\nan undergraduate publication was then I probably<br />\nOF<br />\nFRATERNITY<br />\nGOODS<br />\nFOR<br />\nMFRS.<br />\nSPEAKS<br />\nOF<br />\nswore at a lot of DERBY STAGES COME-BACK<br />\nto include the expression of the things and hope I<br />\nALL KINDS<br />\nITSELF!!<br />\nalways will.<br />\n(Cont. from p. 1, col. 5)<br />\nsentiments of the student body;. Here's one thing I<br />\nknow, I was not 'Dawson by Sundown\" pose. Many 504 PARK BANK BUILDING<br />\nhe was an interpreter for and the coerced into joining<br />\nthe R. 0. T. of the fur specimens look like their<br />\nLexington at Liberty Sts.<br />\nSHERWOOD BROS., INC.<br />\nmouthpiece of student opinion. C.; I was not<br />\npresumed against as original owners died of natural<br />\nThere were times, of'course, when a member. I feel, and<br />\nfeel sincere- causes.<br />\nhe might take advantage of the ly, that I obtained<br />\nmore from the<br />\nWhen fur meets derby as in a<br />\nobvious dignity of his position to R. 0. T. C. than I put<br />\ninto it; that, few instances has actually happenadminister a few stern admonish- from a standpoint of<br />\npracticality, ed on the campus, the resulting<br />\nments. There were other times, it is one of the most<br />\nvaluable combination is a reminder of the<br />\nN. W. COR. EUTAW & FAYETTE STS.<br />\ntoo, when he might attempt to courses offered in the<br />\nHopkins cur- days when Daniel Boone collected<br />\nmould student opinion in the di- riculum; that it has<br />\nmade me bet- incoming arrows for firewood.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nrection he, or others, saw fit. Aft- ter fitted in every<br />\n.way to become Notwithstanding, campus ,opinion<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\ner turning the searchlight of my -a—be<br />\n-tter citizen\" as well as -a has it that such reeking combina- GOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nmemory back over a number of better soldier.\" And<br />\nI hin abso- tions are inevitable. Albeit, may<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nyears, however. I fail to recall the lutely sure, Mr.<br />\nEditor, that the the skinned raccoons repose in<br />\ntime. when it was the privilege of large majority of men<br />\nHEYWARD E. BOYCE, President<br />\nwho have peace.<br />\nthe Editor of the NEWS-LETTER,<br />\nor of any similar publication, to<br />\nexpress through the editorial columns an entirely personal—and,<br />\nperhaps, bigoted—viewpoint.<br />\nThree specific editorials come to<br />\nmy mind now. I am sorry I<br />\nhaven't them here so that I could<br />\nbe absolutely sure of what I am<br />\nabout to say. These three impressed me so vividly, however,<br />\nthat I feel my memory will stand<br />\nme in good stead.<br />\nThe first of them dealt with Dr.<br />\nGoodnow's new plan and concluded, as well as I can remember, \"If<br />\nyou want to know where we<br />\nWHEN the thrilling second act has<br />\nstand, we're for it,\" which was uncome to an end. And you join the<br />\ndoubtedly a very vigorous statecrowds outside just as pleased and<br />\nment. The second editorial, which<br />\nthrilled as yourself—have a Camel!<br />\nappeared, by the way, on the eve<br />\nFor no other friend is so cheerful, so<br />\nof Rushing Season, gave certain<br />\nresting between acts as Camel. Camel<br />\nand apparently well-thought-out<br />\nadds its own romantic glamour to the<br />\nreasons why freshmen should conbrightness of memorable occasions.<br />\nsider a local fraternity-as equal if<br />\nother cigarette ever made — and<br />\nNo<br />\nnot superior to a national. The<br />\nkept—so<br />\nmany friends. Camels never<br />\nthird, and more recent, vigorously<br />\ntire<br />\nyour<br />\ntaste,<br />\nno matter how liberally<br />\nattacked the Hopkins R. 0. T. C.,<br />\nyou<br />\nsmoke<br />\nthem.<br />\nCamels never leave<br />\ndenounced it in no uncertain<br />\na<br />\ncigaretty<br />\nafter-taste.<br />\nterms, called it a \"bugbear,\" and<br />\nSo when you leave the theatre<br />\nneglected to find anything whatsopleased<br />\nand inspired for greater things<br />\never in its favor.<br />\n—taste the mellowest smoke that ever<br />\nThe second of the instances citcame from a cigarette.<br />\ned above may be dismissed as<br />\nHave a Camel!<br />\nmerely an evidence of poor taste,<br />\nInto the making of this one cigarette goes all of the ability of the<br />\nOur highest wish, if you do not yet<br />\ninasmuch as the Editor, supposworld's largest organization of expert tobacco men. Nothing is too<br />\nknow Camel quality, is that you try<br />\nedly a loyal member of a local fragood for Camels. The choicest Turkish and domestic tobaccos. The<br />\nthem. We invite you to compare Camels<br />\nmost skilful blenders. The most scientific package. No other cigarette<br />\nwith any cigarette made at any price.<br />\nternity, \"tooted his own horn\" at<br />\nmade is like Camels. No finer cigarette can be made. Camels are the<br />\nR. J. Reynolds Tobacco Co.<br />\na very critical moment. It was,<br />\noverwhelming choice of experienced smokers.<br />\nas one of the members of the present Senior Class recently pointed<br />\nout so aptly, about the same thing<br />\nas if the worthy Editor had heartily endorsed himself for president<br />\nof his class through the columns<br />\nC925<br />\nof the NEWS-LETTER.<br />\nNEWS-LETTER<br />\n<br />\nLie<br />\nat<br />\nin<br />\nLie<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nBOULEVARD RESTAURANT<br />\n<br />\nBETHOLINE<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nWhen the second act has come to an<br />\n<br />\nto<br />\nest.<br />\n<br />\nell.<br />\n<br />\nBarn<br />\n<br />\nf.<br />\n<br />\nend—and the curtain is rung dawn amidst<br />\nwhirling applause—rwhen you mingle outside with the excited throngs in the lobby<br />\nhave a Camel!<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925<br />\nEUROPEANS MUST FOSTER<br />\nAFRICAN CULTURE—<br />\nWESTERMANN<br />\nSingular Social System Is Well<br />\nAdapted To Tribal Mode<br />\nOf Life, Ile Says<br />\n<br />\nDORM<br />\nDOINGS<br />\n<br />\nMagazine Hopes To Be As Successful<br />\nIn Uncoi ering College Wits<br />\nAs In Past Contests<br />\nA Christmas dance was held in<br />\n<br />\nthe Commons Room of the Alum\"If the European wish to eduni Memorial Dormitory last Fricate the African, they must first<br />\nday evening, December 18. This<br />\nrealize that he has a culture, and<br />\nwas the second dance held at the<br />\nbase their education upon it,\" was<br />\ndormitory this year.<br />\nthe belief expressed by Dr. DiedThere was just 'a desirable numrich H. Westermann, Professor of<br />\nber of couples on the floor. The<br />\nAfrican Languages at the UniverCommons Room was trimmed<br />\nsity of Berlin, in a lecture on \"Powith the conventional red and<br />\nlitical Problems of Modern Afgreen and an elaborately decoratrica,\" delivered Friday afternoon<br />\ned Christmas tree occupied one<br />\nat the Civil Engineering Building.<br />\ncorner. No refreshments were<br />\nThe social system of Africa,<br />\nsaid Dr. Westermann, is primi- served, but a punch bowl was contive; yet it is singularly, well<br />\nadapted to their mode of life. The<br />\nclan Cr tribe is the principal unit<br />\nof society. Their idea of father<br />\nand mother is somewhat different<br />\nfrom ours, for they call all .the<br />\nmembers of the preceding generation \"father\" or \"mother.\"<br />\nFraternalism In Africa<br />\n<br />\n\"VANITY FAIR\" OFFERS<br />\n$1000 IN HUMOROUS<br />\nESSAY CONTEST<br />\n<br />\nTo encourage American undergraduates of literary ability, Vanity Fair will hold a $1000 essay<br />\ncontest. The nature of the essays<br />\nshould be humorous or semi-humorous theses based on university<br />\nMr. Frank Croninshield,<br />\nlife.<br />\nmanager of the contest, has announced that the judges are<br />\nGeorge S. Chappell, Anita Loos,<br />\nand John V. A. Reaver, three authors who have long been Identified with the type of writing Vanity Fair is now seeking.<br />\nIn connection, with this contest,<br />\nthe manager has also pointed out<br />\nthat \"it represents in no sense a<br />\nnew policy of departure for the<br />\nmagazine, for Vanity Fair has al-<br />\n<br />\nstantly refilled.<br />\nDr. and Mrs. Evans, Mrs. Vanaman, and Dr. Hulbert were the<br />\nchaperones of this colorful affair.<br />\nFive pieces of the Blue Jay Orchestra lured the thoughts of the<br />\nmost industrious graduate stu- ways believed in the Undergradudent far from the contents of his ate, admired his viewpoint, and<br />\ntext-book. It is of interest to note encouraged his artistic endeavthat many graduate students pat- ors.\" He also points out that<br />\nronize the dormitory dances, and -Vanity Fair\" was the first to<br />\nseem' actually to enjoy mingling recognize the talents of Robert C.<br />\nBenchley, Robert E. Sherwood,<br />\nwith the other boys.<br />\nThe Social Committee has re- Donald Ogden Stewart, George<br />\nChappell, E. E. Cummings, and<br />\nceived such favorable comment S.<br />\nmany. others, all of whom first<br />\nupon the dorthitory -dances that<br />\nwrote for college publications.<br />\nthey plan to have -several dances<br />\nfollowing the mid-year examinaPROFS' HOLIDAY PLANS<br />\ntions.<br />\n<br />\nLearn the economy of wearing<br />\nStetson hats. They pay for themselves in long service.<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n•<br />\n<br />\n. A fellowship, the Tabou, exists<br />\nin each tribe. This Tabou is a<br />\nsymbol of the tribe. All of the<br />\nsame symbol are treated like<br />\nbrothers, protecting and fighting<br />\nfor one another.<br />\nTheir medical science is curious. In all their medicines they<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nplace stones, iron, or nail, or any<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nalmost indestructible substance<br />\nyour Problems efficiently.<br />\nwhich they believe to be strengthYou should get the benefit of our Expert Knowledge and Ability.<br />\ngiving.<br />\nHowever, the Doctor pointed<br />\n(Cont. from p. 1, col. 2)<br />\nout, these institutions, upon which<br />\nof Germanic Philology, is PresiDRAPERIES<br />\nall African morals are based, is Frosh Awarded<br />\nDECORATIONS<br />\nFURNITURE<br />\nof the society and will deliver<br />\ndent<br />\nbreaking down under the EuroClass Numerals the presidential address. Dr.<br />\n343 NORTH CHARLES STREET<br />\npean flood. Without the Tabou<br />\nForty numerals were awarcled Greenhill- is a member of the counfellowship they would be lost.<br />\nis preThe Europeans should treat them the members of the victorious cil, and Dr. Kurrelmeyer<br />\nGerman II.<br />\nsection<br />\nof<br />\nofficer<br />\nsiding<br />\nwell; build upon their culture and freshman football and baseball<br />\nAt the thirty-fourth annual<br />\nnot overthrow it, a method which teams at a class meeting held yesmight prove disastrous.<br />\nterday. Thirteen of these men meeting of the American Psychowere members of the baseball logical Association at Ithaca, N.<br />\nEducation<br />\nInvestment Bankers Since 1871<br />\nDr. Knight Dunlap,•Pikifes-sor<br />\nAlthough missionary schools team that beat the—Sophomores'4-3.<br />\nwill<br />\nof Experimental Psychology,<br />\narf* doing good work, explained The other twenty-seven football<br />\nread a paper on -The Effect of the<br />\n6 S. Calvert Street<br />\nindirectly<br />\nor<br />\ndirectly<br />\nDr. W ,termann, they are, never- players were<br />\nPost-Rotaon<br />\nRetardation<br />\nof<br />\nRate<br />\nover<br />\nvictory<br />\n2-0<br />\ntheless, trying to educate the Ne- responsible for<br />\ntion Nystagmus.\" Dr. Dunlap deBALTIMORE, MARYLAND<br />\ngro from the Wrong point of view. 1928. Four managers were rethis is not so formidable as<br />\nclares<br />\nThe<br />\neach<br />\nsport.<br />\nin<br />\ntwo<br />\nwarded,<br />\nThe African system of education,<br />\nit sounds.<br />\nalthough primitive, is sufficient three and a half inch letters were<br />\nDr. Jennings is official delegate<br />\nfor their needs. Several clans given out by President Ness.<br />\nYOUR MONEY GETS INTO THE BANK WHETHER<br />\nfrom Hopkins to the annual conhave together a school in the for- Wearers of the 1929 are: Baseball:<br />\nthe American Associa- YOU PUT IT THERE OR NOT. IF YOU SPEND ALL, THE<br />\nest, where they train their boys G. Banks, Lausch, Ness, Hersper- vention of<br />\nof Sci- OTHER FELLOW BANKS YOUR MONEY.<br />\nand girls, preparatory to their be- ger (captain), Plummer, Dowell tion for the Advancement<br />\nin Kansas- City from<br />\ning admitted into the full life of (manager), Fishman, Hammond, ence, meeting<br />\nMAKE YOUR MONEY WORK FOR YOU AT 4% INto January 2nd.<br />\n28th<br />\nDenliecember<br />\nVooges,<br />\nDe<br />\nPurdy,<br />\nMurphy,<br />\nthe tribe. This school is held<br />\nA SAVINGS ACCOUNT WITH<br />\nof the Zoolog- TEREST BY OPENING<br />\nevery ten years, lasting seven nison (asst. manager), Driver. He is vice-president<br />\nB. ical Section.<br />\nyears, four for the boys and three Football: Ends, Loizeaux,<br />\nHeinz;<br />\nTodd,<br />\nWelch,<br />\nStorrs,<br />\nDr. Mast will lecture on '.`Strucfor the girls. Here they are<br />\nSchmiedLeckie,<br />\nKeiser,<br />\ntackles,<br />\nture of Protoplasm\" at a meeting<br />\ntaught all their duties as men and<br />\nDriver,<br />\nguards,<br />\nHegbst;<br />\nRoy,<br />\nicke,<br />\nof the American Society of Zoology Charles and Fayette Streets<br />\nBaltimore, Maryland<br />\nwomen. The boys take up one of<br />\nSpraBarnes,<br />\nLoizeaux,<br />\nDowns,<br />\nat New Haven, Conn., December<br />\nthree careers,—private life, tribal<br />\nMayer; 28-30.<br />\nmedicine, or politics. They are gue; center, Medenbach,<br />\nDeitz,<br />\nBrockman,<br />\nFinn,<br />\nDr. Joseph T. Singewald, H. F.<br />\ninitiated into the secret society of backs,<br />\nFriz, Reid, and Dr. Edward B. Mathews,<br />\nMerriken,<br />\nChapman,<br />\nthe tribe, and take full part in Allen,<br />\nthe councils of the tribe. Mission- Nyburg; managers, Eldridge, of the geological department, will<br />\nattend' a meeting of the Geological<br />\nary schools are important, but Banks, W. (asst.).<br />\nSociety of America at Cornell Unithey must not ignore this educaversity.<br />\ntion of the Negroes which is a<br />\nHold<br />\nto<br />\nA.<br />\nM.<br />\nC.<br />\nY.<br />\nfundamental factor in their life.<br />\nDean Ames will represent HopParty<br />\nChristmas<br />\nat the convention of the<br />\nkins<br />\nProgress<br />\nPhysical Society which<br />\nAmerican<br />\nThere will be an International<br />\nThe natives, said the speaker,<br />\nCity, December<br />\nKansas<br />\nin<br />\nmeets<br />\nshould be helped, not subjugated. Christmas Party at the Friends'<br />\n28-30:<br />\nThey have proved themselves good Meeting House, 3107 N. Charles<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nSTEIN BROS. & BOYCE<br />\n<br />\nUNION TRUST COMPANY<br />\n<br />\nHUPMOBILE<br />\n<br />\nfarmers, for they have greatly developed the cocoa and peanut industry. They are attaining more<br />\nand niore freedom in the government and have a few .papers of<br />\ntheir own. However, the great<br />\nmajority of them are unorganized,<br />\nand it is these who must be cared<br />\nfor. \"For,\" said Dr. Westermann,<br />\n\"we must realize the value of their<br />\nculture, and help build it; not ignore and overthrow it.\"<br />\n<br />\nStreet, Thursday evening, December 24, at 8.00 P. M. Invitations<br />\nhave been sent out, and E. A.<br />\nSchaal, Collegiate Secretary of the<br />\nHopkins Y. M. C. A., expects a<br />\nlarge attendance.<br />\nTo add to the Christmas spirit,<br />\neach visitor will bring a little<br />\npresent costing not more than ten<br />\ncents, for the „tree. All foreign<br />\nstudents from any schools in Baltimore are cordiall,x invited.<br />\n<br />\nNOTICE<br />\nBARNSTORMERS<br />\nThere will be a meeting of<br />\nthe business candidates for the<br />\nBarnstormers today at 12:45 in<br />\nthe News-Letter office.<br />\nNEWS-LETTER<br />\nThere will be a meeting of<br />\nthe News-Letter Staff today at<br />\n12:30 at the News-Letter Office.<br />\n<br />\nvon SCHLEGELL-FOX MOTORS,Inc.<br />\n317 FALLSWAY Near Gay Street<br />\nTelephone Plaza 4963<br />\n<br />\nAPPROPRIATE APPAREL FOR THOSE OF<br />\nCONSERVATIVE AND COLLEGIATE TASTES.<br />\n<br />\nHOCHSCHILD,KOHN &CO.<br />\nLEXINGTON AND HOWARD<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXX, No. 23<br />\nTRIP OFFERED TO JAY'S<br />\nLEADING BUSINESS<br />\n• CANDIDATE<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 22, 1925.<br /><br />\nRifle Team Easily<br />\n•Beats Dartmouth<br /><br />\n\"LOCARNO AND AFTER,\"<br />\nSUBJECT OF TALK BY<br />\nMR. ZIMMERN<br /><br />\nContinuing its recent record-<br /><br />\nSwimming Will Begin<br />\nAfter Holidays<br /><br />\nPRICE 5 CENTS<br />\nSOPHOMORES BEAT FROSH<br />\nIN ANNUAL CLASS<br />\nDEBATE<br /><br />\nAlthough the schedule for the<br /><br />\nQuestion Of Junior College And<br />\nCups To Be Awarded Best Members breaking feat, the Rifle Team last Speaker Describes Conference And<br />\nSwimming Team is not as yet enDiscusses Europe's Present<br />\nCollege Of Arts And Sciences<br />\nOf Art, Editorial, And<br />\nweek defeated Dartmouth Univertirely complete, the team will beFinancial Status<br />\nDiscussed At Assembly<br />\nBusiness Staffs<br /><br />\nsity by 1914 points to 1834 pointS<br />\n-The importance of national<br />\nout of a possible 2000. Newcomb,<br />\nis a minor matter compared<br />\ndebts<br />\nagain leader with a total of 387,<br />\nand Reiblich, Garis, Baird, and with that of the vast flow of priGlantz made the five high scores vate credits passing • from this<br />\nwhich counted.<br />\ncountry to Europe,\" asserted Mr.<br />\nRawlins was not prevented by Alfred Zimmern, in his lecture,<br />\nAlthough no definite date has<br />\nhis bad hand from firing, and he<br />\nbeen set, the trip will probably missed fifth place by only a single -Locarno and After,\" last Wednesday.<br />\nbe taken during the Easter holi- point.<br />\nMr. Zimmern is Chief of the Inday. This decision_ was made at<br />\nAn interesting fact is that the<br />\nthe meeting of the Board of Con- second five men shot a total of ternational Institute for Intellectrol of the Black and Blue Jay, just two points more than Dart- tual Co-operation, at Paris, and<br />\nmouth. The combined score of came to Johns Hopkins as a lecheld last Wednesday.<br />\ntile first ten men, to be counted<br />\nturer of the George Huntington<br />\n• Three Silver'Cups<br />\nagainst West Virginia, was 3770.<br />\nA silver cup is to be given to<br />\nMemorial Lectureship.<br />\nThe latter has not yet been heard Williams<br />\nthe member of the Editorial Staff,<br />\nSecond -Visit<br />\nfrom.<br />\nAt the beginning of his talk,<br />\nthe Art Staff, and the Business<br />\nA four-day trip to New York,<br />\nWith all expenses, is the reward<br />\noffered to the candidate for the<br />\nBusiness Staff of the Black and<br />\nBlue Jay doing the best work.<br /><br />\ngin practice in the brand-new<br />\nKnights of Columbus pool as soon<br />\nas it is filled with water. An organization meeting will be held<br />\non the first Wednesday after the<br />\nChristmas holidays, and it is expected that a big turn-out will appear. Besides the new men available in the freshmen and sophomore classeS, there are eight men<br />\nout of twelve left from the 1924<br />\nteam. Captain Welsh is waiting<br />\nonly for the announcement of the<br />\nresults of the meeting of the Eastern Collegiate Swimming Association, held last Sunday, to begin<br /><br />\nimi a contest that was featured<br />\nby good arguments and bad, the<br />\nsophomore class defeated the freshmen in their anual debate at the<br />\nassembly last Thursday. The victorious team defended the argument that -The American College<br />\nof Arts and Sciences should be<br />\nabandoned, the first two years being combined with the preparatory course and last two years<br />\nwith graduate and professional<br />\ncourses.\" The judges, Mr. Paul M.<br />\nWagner, Capt. P. 0. Strong D. 0.<br />\nL., and Mr. R. C. McDaniel, were<br />\nunanimous in their decision.<br />\nThompson Speaks First<br /><br />\nCary Thompson, the initial<br />\nspeaker, explained some well made<br />\nserious work with this year's ma- graphs which illustrated the featerial.<br />\nsibility of the Junior College. He<br />\nstressed the rapid growth of this<br />\nFOR<br />\nOUTLINED<br />\nnew institution in America. He<br />\nNEW PLAN<br />\nHULLABALOO AT<br />\nalso pointed out that nearly fifty<br />\nMEETING<br />\n•<br />\nper cent. of the men who entered<br />\ncollege leave at the end of the sophMethod Proposed By Turnbull Would<br />\nFrom this, he<br />\nomore year.<br />\nBegin With Sophomore Class<br />\nthe<br />\nonly men who<br />\nthat<br />\ngathered<br />\nHenry R. Turnbull, Editor-instayed after this time were the<br />\nChief of the 1926 Hullabaloo, at a professionally inclined, so there<br />\nmeeting of the freshman class yes- should be given the chance to work<br />\nterday gave a short talk on a pro- under the improved conditions<br />\nposed plan for the election of the which the Junior College plan<br />\nstaffs of future Hullabaloos. He offered.<br /><br />\nStaff doing the best work in his ALUMNI GIVE $400,000 IN Mr. Zimmern expressed pleasure<br />\nHALF-CENTURY FUND<br />\nupon again visiting Hopkins, after<br />\nfield. The awards will be made<br />\nDRIVE<br />\nin one of the last assembles of the<br />\nan absence of three years. He reReport<br />\nAs<br />\nChairmen<br />\nTo<br />\n225<br />\nDistrict<br />\nhow, during his previous<br />\ncalled<br />\nscholastic year.<br />\nGraduates' Effort Ends _<br />\nvisit in January, 1922, he had sent<br />\nThe subscription campaign has<br />\nThe Alumni drive for the Half- the manuscript to England for his<br />\nprogressed rapidly. A fierce strugDegle is being waged by the subscrip- Century Fund officially ended<br />\nbook, \"Europe in Convalescence.\"<br />\ncember 15. The district chairmen,<br />\nThe Locarno Treaty, said Mr.<br />\ntion solicitors for the coveted ten<br />\nof which there are about 225, situ- Zimmern, is the result of Europe's<br />\ndollars, to be given to the man<br />\nin the major cities of the<br />\n• xecuring the greatest number of ated<br />\nattempt to create political and<br />\nworld, have been ordered tc turn<br />\neconomic stability without help<br />\nsubscriptions. At present, a man<br />\nin official reports of the amounts either from outside or revolution<br />\nWho has secured seven subscripthey have solicited. However, within. Delegates came to Locartions is leading the field.<br />\ntwenty-two<br />\nof these chairmen have no with an entirely different spirit<br />\nService Department<br />\nOther Talks<br />\nThe establishment of a Service been granted permission _to solicit from that of the Paris Conference. proposed that all Hullabaloo ofThe argument for the negative<br />\nDepartment -seems quite likely. funds as long as they continue to They came with a determination fices be competitive, for three or was started by Carroll N. Rill. He<br />\nta—coffea-tile-faults of Enrope four years' work, just as the NEWSThe functions of this department obtain good results.<br />\nwas of the opinion that, in some<br />\nand<br />\nthey met together in a genial LETTER and the Black and Blue<br />\nvague way, the present college syswould be to relieve the Business Approximately $400,000 has been<br />\nand sympathetic manner.<br />\nJay are now.<br />\ntem is the best that could possibly<br />\nstaff of some of the advertising raised from the Alumni and much<br />\nHe gave as his reasons that the<br />\nSteadying Influence<br />\nbe desired. Donald Niles conWork. The Service Department more than this amount from their<br />\nThere are seven elements, de- new plan would take the offices<br />\ncluded the affirmative argument<br />\nwould attend to handbills, postfriends. About 2,000 of the Alum- clared Mr. Zimmern, that have re- out of politics, it would insure an<br />\nwith an explanation of another<br />\ners, and bulletins. Such things<br />\nestablished the stability of Europe. experienced staff, and the result chart. This one announced that<br />\nas the. automobile Census would ni have already contributed, and<br />\nThe first of these elements is the would be a better book. He cited the average of Junior College stucome under the work of this de- from 1,000 to 1,500 mor'e are exhealing<br />\npower of time which has Columbia's experience with the dents for a number of years was<br />\npected to have contributed when<br />\nPartm ent.<br />\nallowed<br />\npeople<br />\nof different nations same method, and said that the 81%, while that of regular univerA most interesting talk was the complete report comes in.<br />\nColumbian is one of the best an- sity men was 79%. The negative<br />\nto forget their former hatreds.<br />\ngiven by Maxwell Cone on the<br />\nThis Means that one in every<br />\nnuals<br />\nproduced. By the method argument was completed in a<br />\nPrinceton. Tiger. Cone, while at three of the Alumni has contribu- • The second is the growth of the<br />\nColumbia the officers of vivid burst of oratory by John B.<br />\nused<br />\nat<br />\nthe convention of colleges for ted to-the fund, a record which has influence of democracy. At the<br />\nthe<br />\nbook<br />\nare elected by the retir- Littlefield. His stirring defense<br />\nWorld Court discussion, was never been approached before. The present time, democracy has being<br />\nstaff.<br />\nof fraternities, athletics, and actshown through the offices of the Committee has received contribu- come the principle of the majority<br />\nIf the freshmen and sophomores ivities as the training ground for<br />\nof<br />\nEuropean<br />\npeople.<br />\nTiger, and was able to thoroughly tions from India, Japan, and a<br />\nboth agree on this matter, he will stalwart Americans drew<br />\nrounds<br />\nThe improvement in the politifamiliarize himself with its func- great many from China; in fact<br />\nthe matter before the Stu- of applause from the<br />\ntake<br />\ntions.<br />\nfreshmen.<br />\nfrom every nation in the world. cal and economic condition of the<br />\ndent Activities Council and the<br />\nRebuttals<br />\nIt was announced that Sher- These countries have all felt the peasants is another great factor.<br />\nFaculty Oommittee on Student<br />\nAfter a short intermissiOn, Louis<br />\nwood, Gibbs, and Levi had been influence of the Johns Hopkins The war enormously increased the<br />\nAffairs, and if his plan is adopted, M. Volansky, chairman of the<br />\nelected to the Business Staff of University. The first returns from value of agriculture, and the high<br />\nit would start with the present freshmen debaters, presented the<br />\nthe Jay.<br />\nprices caused by the demand for<br />\n(Cont. on p. 2, col. 3)<br />\nsophomore class.<br />\n(Cont. on p. 3, col. 3)<br />\nfood. allowed the peasants to pay<br />\noff mortgages.<br />\nPROFS TO SPEND YULETIDE AT<br />\nMUSTY RELICS OF PAST FASHIONS<br />\nNational Debts<br />\nVARIOUS SOCIETY. CONVENTIONS<br />\nSTAGE COMEBACK ON CAMPUS<br />\nA fraternal feeling has developed<br />\nThe general exodus of faculty<br />\nDr. Robinson will also speak be- among the nations of Europe, Reminiscent of '9S when HopFrance and England have had<br />\nMembers to meetings of various fore the Archmological Institute caused. by their common indebted- kins seniors were be-whiskered their influence on Homewood,<br />\nSocieties over the country during of America, convening at Cornell ness to the United States of Amerand be-derbied, the campus has which has already become accusthe Christmas holidays has be- the same week.<br />\nica. Mr. Zimmern also believes<br />\ntomed to the melodious French<br />\ncome an annual event, and this The largest representative gather- that America is creating a bad blossomed forth with the stiff horn and is fast adjusting itself<br />\nYear is no exception to the rule.<br />\ning of Hopkins men will attend a feeling by examining the budgets black representatives of hatdom. to the derby, so universally worn<br />\nProfessors from every depart- joint meeting of the middle west- of European countries in order to It is to be assumed that the whis- in England. But Europe is not<br />\nnient in the university will repre- ern and eastern sections of the determine how much they are real- kers will follow.<br />\nalone in- contributions to campus<br />\nsent Hopkins in their respective Modern Language Association to ly able to pay. Creditor relationAlthough few have chosen to vogue. There is the great Amerilines of work.<br />\nbe held at the University of Chi- ship should not give the :United display their derbies in daytime, can suggestion—the wild and<br />\nAt a meeting of the Philological cago, December 29-31.<br />\nStates the right to examine the dances, it is reported, are quite woolly fur coat. What with fur<br />\nAssociation at Cornell December Dr. George W. Small, instructor budgets of other nations. Regard- universally derbyized.<br />\ncoats, French horns, and derbies,<br />\n29-31, Dr. David M. Robinson, in English, will read a paper on ing war debts, Mr. Zimmern added<br />\nSummoned from the grave in the campus reminds one of a midProfessor oi Archwology, will lec- \"The Old English Particle 'The.'\" that it is normal for young coun- which it has been interned for summer night's dream in January.<br />\nture on an -inscription describing<br />\nDr. Kemp Malone, lecturer in tries to borrow from old countries many years, it would seem that<br />\nWeather long ceased to exert<br />\nthe deeds of the Roman Emperor English, is to talk on -The Finn since the young country has un- the derby is coming back into its the slightest bit of influence on coldeveloped natural resources and own in collegiate styles. Down- lege styles, judging from recent<br />\nAugustuf,. Dr. Robinson pieced Episode in Beowulf.\"<br />\ntogether ,the inscription from 300 \"The Immortality of Beauty in is capable of soon paying off the town stores report record sales of display of campus apparel. Great,<br />\nfragments of stone found in the Keats' Poetry\".is the subject to be debt. It is, however, a complete the long forgotten head-piece. grisly, bear-like hulks lumbering<br />\nexcavatims in Pisidian Antioch. presented by Dr. Raymond Dex- reversal of precedent when old Whole groups are said to have down the Barn drive<br />\nare now but<br />\n-Dr. Charles W. E. Miller, Profes- ter Havens, ,<br />\nnations borrow from younger ones. invested in the bats, while Charles common spectacles. More than<br />\n80r of Greek, will read a paper on<br />\nMr. Zimmern. also stated that Street is.: co-nsiderably toned • by 'one of the lumbermen have that<br />\nDr. Herman Collitz, Professor<br />\nldiersl, eve.<br />\nderby black-. (Cont. on p. 4, col. 3)<br />\n(Cont. on p. 2, col. 5)<br />\n(Cont. on p. 3, col. 3)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925 •<br /><br />\n2<br /><br />\nMR. ZIMMERN SPEAKS<br />\n(Cont. from p. 1, col. 3)<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1807<br /><br />\nYES and NO<br />\nTWO NOTES ON ACTIVITIES<br /><br />\n$9.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nHomewood 0100<br /><br />\n'Telephone.<br /><br />\nLast Friday we spied a Blue Jay in a friend's pocket.<br />\n\"Ah-h-h! The Jay's out!\" we exclaimed rapturously.<br />\n\"So to speak,\" we were told.<br />\n\"Now, what?\"<br />\n\"I mistook it for Life,\" explained our friend.<br />\n\"Pretty good, is it?\"<br />\n\"Well . . . You see, Friday's my day for a haircut, so I'd<br />\njust been reading the Florida number of Life before I got my<br />\nBlue Jay. The first pages I opened to had two big cuts . . .<br />\nAnyway, I turned back to the cover wondering who had sent<br />\nme a copy of Life.\"<br />\n*<br /><br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br /><br />\nBusiness Manager<br />\nOTHO J. KELLER III, '26<br /><br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\nCHARLES F. REESE, '27<br /><br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, 926<br /><br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nA. RISLEY ENSOR, '26<br />\nRICHARD R. GRIFFITH, '28<br />\nMORTON HAMBURGER, JR., '28<br />\nJunior Editors<br />\nW. BARNES HALL, '26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nBRINTON STONE,'27<br />\nDONALD NILES, '28<br />\nLAWRENCE KATZENSTEIN, '28<br />\nCORNELIUS S. FRAN CKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br /><br />\nCirculation Manager<br />\nROBERT T. SAUERWEIN, '26<br /><br />\nAssistant Business Managers<br />\nHEYWARD E. BOYCE, JR., '27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, '27<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN,'28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br /><br />\nMember Southern, Intercollegiate Newspaper Association<br />\nPrinted,by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 22, 1925.<br /><br />\nDOLLAR DIPLOMACY<br />\nAt the beginning of the holidays, that brief period of the<br />\nyear when Christmas cheer and a spirit of good-will toward<br />\nmen is prevalent, the most recent philanthropy of the Interfraternity Board should not be overlooked. Their reduction<br />\nof a five-dollar fine to one dollar shows a lack of bitter fraternity feeling which is commendable, but, viewing the action<br />\nfrom other angles, the NEWS-LETTER is doubtful as to whether<br />\nthe policy is a wise one.<br />\nWhat is significant in the reduction is that it was not a<br />\nspontaneous display of generosity in a special instance, but a<br />\nconsistent folloWing out of a policy which has been pursued all<br />\nyear. Three times this fall, fraternities have been duly convicted of a breach of the Rushing Agreement, and in all three<br />\ncases the fines have reached the staggering amount of a dollar.<br />\nNo one need be surprised at the results. Punishment by<br />\nthe Board has assumed a somewhat farcical nature, and this<br />\nin turn leads to hasty convictions. For, Ns/lien the punishment<br />\nis so light, an accused fraternity is convicted on trivial grounds<br />\nwithout causing the jury of its peers much mental exertion in<br />\nconsidering the case. If conviction is regarded as a blot on<br />\nthe 'scutcheon, such liasty verdicts are had; if it comes to be<br />\npractically disregarded, matters are worse.<br />\nThe NEWS-LETTER IS in. favor of bigger fines.<br />\nJ. H. J.<br /><br />\nSEASON'S GREETINGS<br />\nToday this column should be draped with holly; it should<br />\nbe printed in green ink with red borders. But since our<br />\nprinter cannot cope with our orders in this particular respect,<br />\nwe have to do without, and wish all of our readers, both constant and casual, a very merry Christmas and an exceedingly<br />\nprosperous New Year in cold, colorless print.<br />\nOur heart overflows with righteous and perfectly legal<br />\nspirits. The tang of the season is in the air; the crowds on the<br />\ndownton streets remind one of the approaching holidays, and<br />\nthe vacant, longing expression of the students heralds the<br />\nexpected advent of a short vacation. We feel at peace with the<br />\nworld.<br />\nIf we keep up at this pace much longer, the leading ladies'<br />\npublications will be on our trail to write seasonal leaders for<br />\nthem. We are so darn mellow that we almost weep at the<br />\nthought of any distraction that would interfere with our jovial<br />\nmood. So we shudder at the idea of studies, and add to our<br />\nwishes: A holiday free from work of any sort, kind or description.<br />\nTo all of our subscribers, and any others who feel as if<br />\nthey could stand it, we extend our very best wishes for a merry<br />\nChristmas and a happy New Year. In fact, we repeat that wish<br />\nfor the third time: Pleasant holiday to all!<br /><br />\nFrom our outside-looking-in viewpoint, we can't help marvelling at the importance that 0. D. K. attaches to class offices.<br />\nTo have been a class officer is a real distinction in the eyes of<br />\nthat influential body. Or, we are very much mistaken.<br />\nThat such an attitude toward .class honors is the heighth of<br />\nthe absurd becomes plain if one reduces it to fact in a simple<br />\nstatement. Take, for example \"Smith is a real man. Why,<br />\nhe's vice-president of his class!\" Again: \"If Brown hasn't a<br />\nlot of ability, why did his class elect him president? Answer<br />\nme that!\" Or: \"Sure, he's very popular with those who know<br />\nhim. He was secretary of his class in his junior year!\"<br />\nIs anyone ever guilty of such remarks? Certainly not,—<br />\nexcept freshmen, and alumni in their dotage. What we actually<br />\nhear are such remarks as these: \"Yeah, some Mu Cow Mu'll be<br />\npresident.\" \"Oh, one of the Engineers is sure to get that job.\"<br />\n\"Of course, everybody admits that he's the best man; but do<br />\nyou think there's any use for him to run?\" \"The hell he will<br />\nhe secretary! Why, he's a damned Jew!\" \"One of those -locals is sure to get treasurer!\" And so on, and so forth,<br />\nad nauseam.<br />\nAfter all, what difference does it make?• With the unfortunate exception of the treasurer, the functions and duties of<br />\nany given class officer are so simple ,any child can play them<br />\n(italics ours). We have yet to hear a discussion of whether<br />\nso-iand-so was, or will be., a \"good\" or \"bad\" class officer.<br />\nAnd yet class honors have found favor in the eyes of the<br />\nHopkins campus, and, in particular, in the voice of its glorified mouthpiece, Omicron Delta Kappa. The reason is hard<br />\nto find. Perhaps it is an outgrown convention of the good old<br />\ncollege days when men were men. Perhaps it is the persistence of a kotowing habit, acquired to excess in our high school<br />\ndays. More than likely, however, it is an atavism dating from<br />\nour early worship of the Rover Boys.<br /><br />\nGET UP AND BOW<br /><br />\n(Cont. from p. 1, col. 2)<br /><br />\ninstrument for carrying on the<br />\naffairs of Europe.<br />\nGreat Britain has also 'thrown<br />\nin her lot with the continental nations and is risking her empire<br />\nupon the power of the League of<br />\nNations. Lastly, there has developed a new consciousness in European youth who declare that they<br />\nnever again will endure the horrors of war. The veteran soldiers<br />\nof the war are uniting themselves<br />\nwith their younger brothers with<br />\na firm determination that war<br />\nshall never come again.<br /><br />\nFriday's Lecture<br />\nOn Internationalism<br />\nIn the second lecture at Homewood this week on \"International-ism and Education,\" delivered at<br />\nthe Civil Engineering Building<br />\nlast Friday, Mr. Alfred Zimmern<br />\nexpressed the desire to have a better international understanding so<br />\nthat each nation might more readily see the point of view of the<br />\nother.<br />\nMr. Zimmern spoke of this country as being well fitted to carry<br />\nout the work of international understanding. He said that this<br />\ncountry is the most highly organized nation in the world. He mentioned the proposed Walter Hines<br />\nPage School of Diplomacy as an<br />\ninstitution calculated to further<br />\ninternational understanding.<br />\nMr. Zimmern then spoke of national culture. Whether there is<br />\na place for it or not, the various<br />\nnations feel that by developing a<br />\nculture of their own they are expressing their personality.<br />\nDON'T FORGET!<br /><br />\nWe ask the staff of the Blue Jay to get up and bow, for<br />\nwe are about to throw verbal bouquets their way. The boys<br />\nare getting good,—they are fast becoming professional in touch;<br />\nthey are actually humorous. The last two issues are the evidence in the case.<br />\nThe \"Faculty Number,\" although it had little to do with<br />\nthe faculty,—roasted them little, praised them none,—was,<br />\nnevertheless, a pretty good sample of a college humorous publication. It had jokes that were really spicy; it verged at times<br />\nupon the risque; it was as pure as a censored play in places,—<br />\nbut no matter what type of matter it contained, it was funny,<br />\nthe jokes were good.<br />\nNow we 'have just been given a glimpse or two at the<br />\n\"Christmas in Florida\" number. It is a big edition, but it is<br />\nfunny enough to suit us, and that's funny as the deuce. Yes;<br />\nit is a bigger and better Jay.<br />\nSome time ago, the editor of the Black and Blue Jay; while<br />\non a flying trip to the NEWS-LETTER office, promised us that the<br />\nJay would be-humorous when-the NEWS-LETTER was_aecnrate.<br />\nWe have noticed no change in our sheet, but we thank the bird<br />\nfor the implied compliment. •<br />\nStand up, Black and Blue Jay, and take the applause!<br />\nALUMNI DRIVE ENDED<br /><br />\nthe growth of the influence of the<br />\nLeague of Nations is causing that<br />\norganization to become the main<br /><br />\ncANFORDS<br />\ngieI<br />\ne Oi<br /><br />\nFlorida were received last week,<br />\nbut they averaged above $300 per<br /><br />\niJ FOUNTAIN PEN<br /><br />\ncontributor.<br />\nSeveral days ago a beautifully<br />\nengraved check for fifty lira was<br />\nreceived from an Italian contributor. It was an impressive check<br />\nto present to the bank, its dimensions being five inches by fourteen.<br />\nThe Committee suffered considerable disappointment when it was<br />\ninformed by the bank officers that<br />\nthe check totaled $1.98 in American money.<br /><br />\nINK<br /><br />\n—clothes that are tailored to<br /><br />\nyour measure fit you best. I<br />\n—they have the right cut..<br />\n—they make you feel well.<br />\ndressed.<br /><br />\nrirA11,43]Ft$<br />\nc;t/firkt ore<br />\nSee \"GARD\" MALLONEE &amp; FRAMK MEREDITH at the Barn<br />\nDowntown at 407 N. GAY St.<br /><br />\nfiirrru Tilimmao<br />\nTO YOU ALL<br />\n1VAMTAMX<br /><br />\nST. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\nJust Below<br />\nNorth Avenue<br />\nAlways Open<br /><br />\nALWAYS GOOD<br />\nALWAYS THE SAME<br /><br />\nNICHOLAS BROWN.(41ang.<br /><br />\n'<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925<br /><br />\nDeveloping<br />\nThe other two examples, how- gone through the Hopkins R. 0. T. Kodaks<br />\nLET US SUGGEST<br />\nPrinting<br />\nCameras<br />\ncommissions<br />\nC.<br />\nhold<br />\nand<br />\nin<br />\nnow<br />\never, are more serious. In these<br />\nMAILBAG<br />\nHIS CHRISTMAS GIFTEnlarging<br />\nSupplies<br />\nthe Editor, ostensibly and accord- the Officers' Reserve Corps of the<br />\nAll letters intended for publication<br />\nU. S. Army, will agree ivith me.<br />\n-at the—<br />\ning to general belief, interpreting<br />\nmust be concise, written in ink on<br />\nZepp Photo Supply Co.<br />\nAnd<br />\nonce more I regret that we<br />\nregular letter size paper, on one side<br />\nand voicing the opinion of the unonly.<br />\nmust differ.<br />\nCOLLEGIATE SHOP<br />\nNo attention will be paid to anony3044 Greenmount Ave.<br />\ndergraduate<br />\nbody,<br />\ngave<br />\nwhat<br />\nI<br />\nI suppose I am only another of<br />\nmous letters, but names signed as an<br />\nevidence of good faith will not be<br />\ncannot help but feel to be personal these alumni who come back after<br />\nprinted if request is made that they be<br />\nop;nions. It may be true that-the several years and decide that the<br />\nLet Us Develop Your Films<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nLeave Them Today—<br />\npresent undergraduates are doing<br />\nCHARLES ST., BALTIMORE<br />\nundergraduates<br />\nare<br />\nheartily<br />\nin<br />\nbe taken as an indorsement of its views<br />\nTomorrow<br />\nThem<br />\nGet<br />\neverything<br />\nwrong.<br />\nHow<br />\nI<br />\nused<br />\nto<br />\nby the \"News-Letter,\" which invites the<br />\nfavor of Dr. Goodnow's new plan.<br />\nfreest discussion of matters of general<br />\nhate them! But, Mr. Editor, I just<br />\nIt may be true also, that everyone<br />\ninterest.<br />\nhad one attack of boils too many.<br />\nVernon 2355<br />\nis as antagonistic to the R. 0. T. Although the sound may be deBANNER AND PENNANT SHOP<br />\nECHOS FROM THE PAST<br />\nFLAG,<br />\nTHE<br />\nPrinters of<br />\nC. as the Editor, through his col- ceiving, my name is not spelt or<br />\nSUCCESSORS TO SISCO BROS.<br />\nTo the Editor-in-Chief of the Xews- umns and those of the<br />\nPHILOLOGICAL<br />\n&amp; SCIENTIFIC<br />\nBands,<br />\nArm<br />\nPennants,<br />\nBanners,<br />\nFlags,<br />\nBaltimore pronounced \"Job\" and my patience<br />\nSchools,<br />\nBanners<br />\nfor<br />\nSilk<br />\nNovelties.<br />\nPUBLICATIONS<br />\nLetter.<br />\n-Et-ening Sun,\" gave us to believe. just gave out. I am sorry.<br />\nSocieties and Fraternities.<br />\nVery respectfully,<br />\nDear Sir:<br />\n23 S. Hanover St., Baltimore.<br />\nIt may be that conditions on the<br />\nR. H. TAYLOR<br />\nJOE LEOPOLD, '24. 302 PARK AVENUE, BALTIMORE.<br />\nIf Job himself were back on Hopkins campus have changed<br />\nearth now, and could have the that much in two years. But, I<br />\nPhone: Homewood 9621<br />\nprivilege of scanning the editorial hope the Editor will forgive me if<br />\nENGLISH OVERCOATS<br />\nI doubt it.<br />\nFROSH-SOPH DEBATE<br />\ncolumns of your :esteemed publi$30.00 to $75.00<br />\nOne more word in defense of the<br />\n(Cont. from p. 1, col. 6)<br />\nFANCY DELICATESSEN<br />\ncation, I fear the old boy would Hopkins<br />\nR. 0. T. C., that auto-. rebuttal. Vernon Scheidt, chair2022 N. Charles St., Balto., Md.<br />\nlose one perfectly good reputation. cratic, militaristic and<br />\nentirely in- man of the sophomore team, con- Mc PHERSON'S SPECIAL RATES FOR HOPKINS STUDENTS<br />\nMr. Editor, I was on the NEws- defensible body. I had four years cluded the debate with a number<br />\n1<br />\n1 E. BALTIMORE ST.<br />\nLETTER Board very recently, and of it at Homewood, in addition of well-planned arguments. He<br />\nhad ample opportunity to observe to six weeks at Plattsburgh and showed many instances where the<br />\nsix more at Camp Meade. I un- negative team had contradicted its<br />\nat first hand its advantages, its<br />\nPhone: Calvert 4835<br />\ndoubtedly swore at it; in fact, I own arguments. In general, his<br />\ndefects, and its I:Mk-res. I doubt<br />\nCARL J. DOEDERLEIN<br />\nwouldn't be really surprised if I delivery and sensible thought enwhether these policies could have had gone as far as<br />\nWATCHES,<br />\nabled<br />\nhim<br />\nto<br />\nstand<br />\nout among the<br />\nto term it the<br />\n\"THE WONDER MOTOR FUEL<br />\nchanged materially in such a short -damn army,\"<br />\nJEWELRY<br />\nDIAMONDS,<br />\nspeakers.<br />\nwhich epithet the<br />\ntime. My impression then was Editor sees fit to<br />\nconsider a term<br />\nFINE WATCH, CLOCK &amp; JEWELRY<br />\nthat the function of the editor of of the most vile<br />\nPOPULARITY<br />\nREPAIRING A SPECIALTY<br />\nopprobiuni. But<br />\nan undergraduate publication was then I probably<br />\nOF<br />\nFRATERNITY<br />\nGOODS<br />\nFOR<br />\nMFRS.<br />\nSPEAKS<br />\nOF<br />\nswore at a lot of DERBY STAGES COME-BACK<br />\nto include the expression of the things and hope I<br />\nALL KINDS<br />\nITSELF!!<br />\nalways will.<br />\n(Cont. from p. 1, col. 5)<br />\nsentiments of the student body;. Here's one thing I<br />\nknow, I was not 'Dawson by Sundown\" pose. Many 504 PARK BANK BUILDING<br />\nhe was an interpreter for and the coerced into joining<br />\nthe R. 0. T. of the fur specimens look like their<br />\nLexington at Liberty Sts.<br />\nSHERWOOD BROS., INC.<br />\nmouthpiece of student opinion. C.; I was not<br />\npresumed against as original owners died of natural<br />\nThere were times, of'course, when a member. I feel, and<br />\nfeel sincere- causes.<br />\nhe might take advantage of the ly, that I obtained<br />\nmore from the<br />\nWhen fur meets derby as in a<br />\nobvious dignity of his position to R. 0. T. C. than I put<br />\ninto it; that, few instances has actually happenadminister a few stern admonish- from a standpoint of<br />\npracticality, ed on the campus, the resulting<br />\nments. There were other times, it is one of the most<br />\nvaluable combination is a reminder of the<br />\nN. W. COR. EUTAW &amp; FAYETTE STS.<br />\ntoo, when he might attempt to courses offered in the<br />\nHopkins cur- days when Daniel Boone collected<br />\nmould student opinion in the di- riculum; that it has<br />\nmade me bet- incoming arrows for firewood.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nrection he, or others, saw fit. Aft- ter fitted in every<br />\n.way to become Notwithstanding, campus ,opinion<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\ner turning the searchlight of my -a—be<br />\n-tter citizen\" as well as -a has it that such reeking combina- GOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nmemory back over a number of better soldier.\" And<br />\nI hin abso- tions are inevitable. Albeit, may<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nyears, however. I fail to recall the lutely sure, Mr.<br />\nEditor, that the the skinned raccoons repose in<br />\ntime. when it was the privilege of large majority of men<br />\nHEYWARD E. BOYCE, President<br />\nwho have peace.<br />\nthe Editor of the NEWS-LETTER,<br />\nor of any similar publication, to<br />\nexpress through the editorial columns an entirely personal—and,<br />\nperhaps, bigoted—viewpoint.<br />\nThree specific editorials come to<br />\nmy mind now. I am sorry I<br />\nhaven't them here so that I could<br />\nbe absolutely sure of what I am<br />\nabout to say. These three impressed me so vividly, however,<br />\nthat I feel my memory will stand<br />\nme in good stead.<br />\nThe first of them dealt with Dr.<br />\nGoodnow's new plan and concluded, as well as I can remember, \"If<br />\nyou want to know where we<br />\nWHEN the thrilling second act has<br />\nstand, we're for it,\" which was uncome to an end. And you join the<br />\ndoubtedly a very vigorous statecrowds outside just as pleased and<br />\nment. The second editorial, which<br />\nthrilled as yourself—have a Camel!<br />\nappeared, by the way, on the eve<br />\nFor no other friend is so cheerful, so<br />\nof Rushing Season, gave certain<br />\nresting between acts as Camel. Camel<br />\nand apparently well-thought-out<br />\nadds its own romantic glamour to the<br />\nreasons why freshmen should conbrightness of memorable occasions.<br />\nsider a local fraternity-as equal if<br />\nother cigarette ever made — and<br />\nNo<br />\nnot superior to a national. The<br />\nkept—so<br />\nmany friends. Camels never<br />\nthird, and more recent, vigorously<br />\ntire<br />\nyour<br />\ntaste,<br />\nno matter how liberally<br />\nattacked the Hopkins R. 0. T. C.,<br />\nyou<br />\nsmoke<br />\nthem.<br />\nCamels never leave<br />\ndenounced it in no uncertain<br />\na<br />\ncigaretty<br />\nafter-taste.<br />\nterms, called it a \"bugbear,\" and<br />\nSo when you leave the theatre<br />\nneglected to find anything whatsopleased<br />\nand inspired for greater things<br />\never in its favor.<br />\n—taste the mellowest smoke that ever<br />\nThe second of the instances citcame from a cigarette.<br />\ned above may be dismissed as<br />\nHave a Camel!<br />\nmerely an evidence of poor taste,<br />\nInto the making of this one cigarette goes all of the ability of the<br />\nOur highest wish, if you do not yet<br />\ninasmuch as the Editor, supposworld's largest organization of expert tobacco men. Nothing is too<br />\nknow Camel quality, is that you try<br />\nedly a loyal member of a local fragood for Camels. The choicest Turkish and domestic tobaccos. The<br />\nthem. We invite you to compare Camels<br />\nmost skilful blenders. The most scientific package. No other cigarette<br />\nwith any cigarette made at any price.<br />\nternity, \"tooted his own horn\" at<br />\nmade is like Camels. No finer cigarette can be made. Camels are the<br />\nR. J. Reynolds Tobacco Co.<br />\na very critical moment. It was,<br />\noverwhelming choice of experienced smokers.<br />\nas one of the members of the present Senior Class recently pointed<br />\nout so aptly, about the same thing<br />\nas if the worthy Editor had heartily endorsed himself for president<br />\nof his class through the columns<br />\nC925<br />\nof the NEWS-LETTER.<br />\nNEWS-LETTER<br /><br />\nLie<br />\nat<br />\nin<br />\nLie<br /><br />\nJ. H. FURST CO.<br /><br />\nBOULEVARD RESTAURANT<br /><br />\nBETHOLINE<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nWhen the second act has come to an<br /><br />\nto<br />\nest.<br /><br />\nell.<br /><br />\nBarn<br /><br />\nf.<br /><br />\nend—and the curtain is rung dawn amidst<br />\nwhirling applause—rwhen you mingle outside with the excited throngs in the lobby<br />\nhave a Camel!<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1925<br />\nEUROPEANS MUST FOSTER<br />\nAFRICAN CULTURE—<br />\nWESTERMANN<br />\nSingular Social System Is Well<br />\nAdapted To Tribal Mode<br />\nOf Life, Ile Says<br /><br />\nDORM<br />\nDOINGS<br /><br />\nMagazine Hopes To Be As Successful<br />\nIn Uncoi ering College Wits<br />\nAs In Past Contests<br />\nA Christmas dance was held in<br /><br />\nthe Commons Room of the Alum\"If the European wish to eduni Memorial Dormitory last Fricate the African, they must first<br />\nday evening, December 18. This<br />\nrealize that he has a culture, and<br />\nwas the second dance held at the<br />\nbase their education upon it,\" was<br />\ndormitory this year.<br />\nthe belief expressed by Dr. DiedThere was just 'a desirable numrich H. Westermann, Professor of<br />\nber of couples on the floor. The<br />\nAfrican Languages at the UniverCommons Room was trimmed<br />\nsity of Berlin, in a lecture on \"Powith the conventional red and<br />\nlitical Problems of Modern Afgreen and an elaborately decoratrica,\" delivered Friday afternoon<br />\ned Christmas tree occupied one<br />\nat the Civil Engineering Building.<br />\ncorner. No refreshments were<br />\nThe social system of Africa,<br />\nsaid Dr. Westermann, is primi- served, but a punch bowl was contive; yet it is singularly, well<br />\nadapted to their mode of life. The<br />\nclan Cr tribe is the principal unit<br />\nof society. Their idea of father<br />\nand mother is somewhat different<br />\nfrom ours, for they call all .the<br />\nmembers of the preceding generation \"father\" or \"mother.\"<br />\nFraternalism In Africa<br /><br />\n\"VANITY FAIR\" OFFERS<br />\n$1000 IN HUMOROUS<br />\nESSAY CONTEST<br /><br />\nTo encourage American undergraduates of literary ability, Vanity Fair will hold a $1000 essay<br />\ncontest. The nature of the essays<br />\nshould be humorous or semi-humorous theses based on university<br />\nMr. Frank Croninshield,<br />\nlife.<br />\nmanager of the contest, has announced that the judges are<br />\nGeorge S. Chappell, Anita Loos,<br />\nand John V. A. Reaver, three authors who have long been Identified with the type of writing Vanity Fair is now seeking.<br />\nIn connection, with this contest,<br />\nthe manager has also pointed out<br />\nthat \"it represents in no sense a<br />\nnew policy of departure for the<br />\nmagazine, for Vanity Fair has al-<br /><br />\nstantly refilled.<br />\nDr. and Mrs. Evans, Mrs. Vanaman, and Dr. Hulbert were the<br />\nchaperones of this colorful affair.<br />\nFive pieces of the Blue Jay Orchestra lured the thoughts of the<br />\nmost industrious graduate stu- ways believed in the Undergradudent far from the contents of his ate, admired his viewpoint, and<br />\ntext-book. It is of interest to note encouraged his artistic endeavthat many graduate students pat- ors.\" He also points out that<br />\nronize the dormitory dances, and -Vanity Fair\" was the first to<br />\nseem' actually to enjoy mingling recognize the talents of Robert C.<br />\nBenchley, Robert E. Sherwood,<br />\nwith the other boys.<br />\nThe Social Committee has re- Donald Ogden Stewart, George<br />\nChappell, E. E. Cummings, and<br />\nceived such favorable comment S.<br />\nmany. others, all of whom first<br />\nupon the dorthitory -dances that<br />\nwrote for college publications.<br />\nthey plan to have -several dances<br />\nfollowing the mid-year examinaPROFS' HOLIDAY PLANS<br />\ntions.<br /><br />\nLearn the economy of wearing<br />\nStetson hats. They pay for themselves in long service.<br /><br />\nSTETSON HATS<br />\nStyled for young men<br />\n•<br /><br />\n. A fellowship, the Tabou, exists<br />\nin each tribe. This Tabou is a<br />\nsymbol of the tribe. All of the<br />\nsame symbol are treated like<br />\nbrothers, protecting and fighting<br />\nfor one another.<br />\nTheir medical science is curious. In all their medicines they<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nplace stones, iron, or nail, or any<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nalmost indestructible substance<br />\nyour Problems efficiently.<br />\nwhich they believe to be strengthYou should get the benefit of our Expert Knowledge and Ability.<br />\ngiving.<br />\nHowever, the Doctor pointed<br />\n(Cont. from p. 1, col. 2)<br />\nout, these institutions, upon which<br />\nof Germanic Philology, is PresiDRAPERIES<br />\nall African morals are based, is Frosh Awarded<br />\nDECORATIONS<br />\nFURNITURE<br />\nof the society and will deliver<br />\ndent<br />\nbreaking down under the EuroClass Numerals the presidential address. Dr.<br />\n343 NORTH CHARLES STREET<br />\npean flood. Without the Tabou<br />\nForty numerals were awarcled Greenhill- is a member of the counfellowship they would be lost.<br />\nis preThe Europeans should treat them the members of the victorious cil, and Dr. Kurrelmeyer<br />\nGerman II.<br />\nsection<br />\nof<br />\nofficer<br />\nsiding<br />\nwell; build upon their culture and freshman football and baseball<br />\nAt the thirty-fourth annual<br />\nnot overthrow it, a method which teams at a class meeting held yesmight prove disastrous.<br />\nterday. Thirteen of these men meeting of the American Psychowere members of the baseball logical Association at Ithaca, N.<br />\nEducation<br />\nInvestment Bankers Since 1871<br />\nDr. Knight Dunlap,•Pikifes-sor<br />\nAlthough missionary schools team that beat the—Sophomores'4-3.<br />\nwill<br />\nof Experimental Psychology,<br />\narf* doing good work, explained The other twenty-seven football<br />\nread a paper on -The Effect of the<br />\n6 S. Calvert Street<br />\nindirectly<br />\nor<br />\ndirectly<br />\nDr. W ,termann, they are, never- players were<br />\nPost-Rotaon<br />\nRetardation<br />\nof<br />\nRate<br />\nover<br />\nvictory<br />\n2-0<br />\ntheless, trying to educate the Ne- responsible for<br />\ntion Nystagmus.\" Dr. Dunlap deBALTIMORE, MARYLAND<br />\ngro from the Wrong point of view. 1928. Four managers were rethis is not so formidable as<br />\nclares<br />\nThe<br />\neach<br />\nsport.<br />\nin<br />\ntwo<br />\nwarded,<br />\nThe African system of education,<br />\nit sounds.<br />\nalthough primitive, is sufficient three and a half inch letters were<br />\nDr. Jennings is official delegate<br />\nfor their needs. Several clans given out by President Ness.<br />\nYOUR MONEY GETS INTO THE BANK WHETHER<br />\nfrom Hopkins to the annual conhave together a school in the for- Wearers of the 1929 are: Baseball:<br />\nthe American Associa- YOU PUT IT THERE OR NOT. IF YOU SPEND ALL, THE<br />\nest, where they train their boys G. Banks, Lausch, Ness, Hersper- vention of<br />\nof Sci- OTHER FELLOW BANKS YOUR MONEY.<br />\nand girls, preparatory to their be- ger (captain), Plummer, Dowell tion for the Advancement<br />\nin Kansas- City from<br />\ning admitted into the full life of (manager), Fishman, Hammond, ence, meeting<br />\nMAKE YOUR MONEY WORK FOR YOU AT 4% INto January 2nd.<br />\n28th<br />\nDenliecember<br />\nVooges,<br />\nDe<br />\nPurdy,<br />\nMurphy,<br />\nthe tribe. This school is held<br />\nA SAVINGS ACCOUNT WITH<br />\nof the Zoolog- TEREST BY OPENING<br />\nevery ten years, lasting seven nison (asst. manager), Driver. He is vice-president<br />\nB. ical Section.<br />\nyears, four for the boys and three Football: Ends, Loizeaux,<br />\nHeinz;<br />\nTodd,<br />\nWelch,<br />\nStorrs,<br />\nDr. Mast will lecture on '.`Strucfor the girls. Here they are<br />\nSchmiedLeckie,<br />\nKeiser,<br />\ntackles,<br />\nture of Protoplasm\" at a meeting<br />\ntaught all their duties as men and<br />\nDriver,<br />\nguards,<br />\nHegbst;<br />\nRoy,<br />\nicke,<br />\nof the American Society of Zoology Charles and Fayette Streets<br />\nBaltimore, Maryland<br />\nwomen. The boys take up one of<br />\nSpraBarnes,<br />\nLoizeaux,<br />\nDowns,<br />\nat New Haven, Conn., December<br />\nthree careers,—private life, tribal<br />\nMayer; 28-30.<br />\nmedicine, or politics. They are gue; center, Medenbach,<br />\nDeitz,<br />\nBrockman,<br />\nFinn,<br />\nDr. Joseph T. Singewald, H. F.<br />\ninitiated into the secret society of backs,<br />\nFriz, Reid, and Dr. Edward B. Mathews,<br />\nMerriken,<br />\nChapman,<br />\nthe tribe, and take full part in Allen,<br />\nthe councils of the tribe. Mission- Nyburg; managers, Eldridge, of the geological department, will<br />\nattend' a meeting of the Geological<br />\nary schools are important, but Banks, W. (asst.).<br />\nSociety of America at Cornell Unithey must not ignore this educaversity.<br />\ntion of the Negroes which is a<br />\nHold<br />\nto<br />\nA.<br />\nM.<br />\nC.<br />\nY.<br />\nfundamental factor in their life.<br />\nDean Ames will represent HopParty<br />\nChristmas<br />\nat the convention of the<br />\nkins<br />\nProgress<br />\nPhysical Society which<br />\nAmerican<br />\nThere will be an International<br />\nThe natives, said the speaker,<br />\nCity, December<br />\nKansas<br />\nin<br />\nmeets<br />\nshould be helped, not subjugated. Christmas Party at the Friends'<br />\n28-30:<br />\nThey have proved themselves good Meeting House, 3107 N. Charles<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nSTEIN BROS. &amp; BOYCE<br /><br />\nUNION TRUST COMPANY<br /><br />\nHUPMOBILE<br /><br />\nfarmers, for they have greatly developed the cocoa and peanut industry. They are attaining more<br />\nand niore freedom in the government and have a few .papers of<br />\ntheir own. However, the great<br />\nmajority of them are unorganized,<br />\nand it is these who must be cared<br />\nfor. \"For,\" said Dr. Westermann,<br />\n\"we must realize the value of their<br />\nculture, and help build it; not ignore and overthrow it.\"<br /><br />\nStreet, Thursday evening, December 24, at 8.00 P. M. Invitations<br />\nhave been sent out, and E. A.<br />\nSchaal, Collegiate Secretary of the<br />\nHopkins Y. M. C. A., expects a<br />\nlarge attendance.<br />\nTo add to the Christmas spirit,<br />\neach visitor will bring a little<br />\npresent costing not more than ten<br />\ncents, for the „tree. All foreign<br />\nstudents from any schools in Baltimore are cordiall,x invited.<br /><br />\nNOTICE<br />\nBARNSTORMERS<br />\nThere will be a meeting of<br />\nthe business candidates for the<br />\nBarnstormers today at 12:45 in<br />\nthe News-Letter office.<br />\nNEWS-LETTER<br />\nThere will be a meeting of<br />\nthe News-Letter Staff today at<br />\n12:30 at the News-Letter Office.<br /><br />\nvon SCHLEGELL-FOX MOTORS,Inc.<br />\n317 FALLSWAY Near Gay Street<br />\nTelephone Plaza 4963<br /><br />\nAPPROPRIATE APPAREL FOR THOSE OF<br />\nCONSERVATIVE AND COLLEGIATE TASTES.<br /><br />\nHOCHSCHILD,KOHN &amp;CO.<br />\nLEXINGTON AND HOWARD<br /><br />"}], "field_media_file": [{"target_id": 38005, "display": null, "description": null, "target_type": "file", "target_uuid": "ba4c42b9-dcab-4cf9-9281-7ccb7503eaa7", "url": "http://digital.library.jhu.edu/system/files/2022-03/13192-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13192, "target_type": "node", "target_uuid": "ed167eb2-0334-4b2c-b84c-371479f3dabe", "url": "/node/13192"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c8b4e1c5-93f9-4485-b148-4445568b8843"}]}