{"mid": [{"value": 38233}], "uuid": [{"value": "b18bc39a-f984-441e-9819-ce8d7947bbca"}], "vid": [{"value": 38233}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:51:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12800-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:51:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:51:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Nriurt-iErttrr<br />\n<br />\nJUNIORS!<br />\nVOTE TODAY<br />\n<br />\nFRATS AND SENIORS!<br />\nYour Picture Now<br />\n<br />\nZ 275<br />\nVOL. XLII, No. 6<br />\n<br />\naPRICE 5 CENTS<br />\n<br />\nHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br />\n<br />\nJay' Makes Appearance,<br />\n'STORMER RALLY 'Blue<br />\nInterest Of Article<br />\nFESTIVITIES AT Varying<br />\nPLAYSIOP, 7:30<br />\n<br />\nHOPKINS AND O'KEEFE]<br />\nVIE FOR PRESIDENCY,<br />\nEditors Make Attempt To Fashion Literary Magazine Wit4 IN JUNIOR ELECTION'<br />\nPoetry, Reviews Of Books, Fiction, And Music<br />\nNotes Of Popular Appeal<br />\n<br />\nl'NEWS-LETTER'<br />\nINITIATES VOTE<br />\nNEXT TUESDAY<br />\n<br />\nPlan Put To Test<br />\n<br />\nWard And Lill Only Candidates Nominated For<br />\nVice-Presidency<br />\n<br />\nStudent Body To Voice<br />\nOpinion Of New<br />\nAthletic Plan<br />\n<br />\nBy DANIEL COHEN<br />\nRwytr Expects Large EnthuThe first issue of the IS137-38 Blue Jay has appeared. Under the<br />\nsiastic Crowd; Interesting editorship of Victor M. Victoroff, '40 the revived humor magazine was<br />\nProgram Arranged<br />\npresented yesterday to the, waiting students of the Johns Hopkins Uni- Of Fourteen Candidates Four<br />\nversity. Running the gamut from satire to hobbies, the Blue Jay can<br />\nMen Lose Out In<br />\nhardly fail to please those for whom it was intended.<br />\nFIVE PRODUCTIONS<br />\nThe aim of the Blue Jay says EdiVoting<br />\ndespondent soul is revealed to the<br />\nBEING CONSIDERED tor Victoroff in this first issue is \"to<br />\n<br />\nYear Marks Seventeenth Anniversary Of Dramatic<br />\nOrganization<br />\nThe Barnstormer Club will hold its<br />\nannual fall rally tonight at 7.30 p.m.<br />\nat the Homewood Playshop. \"An interesting program as been arranged<br />\nand we expect a large and enthusiastic crowd,\" said Louis Swyer, president of the organization.<br />\n<br />\nreader in a story by Victoroff which<br />\nserve you more effectively and in- is entitled \"Defy the Gods!\" It is an<br />\ntrestingly than ever before.\" That is attempt to paint a true picture of a<br />\nundoubtedly the purpose of Jacob's young man who has been deserted by<br />\n\"Small—Bore his inconstant love.<br />\nHandelsman's<br />\nC.<br />\nShooting,\" or \"For All Nimrods.\" It<br />\nThe _Poetry in the first issue must<br />\ntreats of guns and how to shoot them be rated inferior. Sholem Waif*<br />\nand is the first of a series ofarticles makes a try at free verse in his poem<br />\n\"Stop\" but falls short of creating<br />\nfor the amateur marksman.<br />\npoetry. \"Saps\" by Merlin Lass is a<br />\nVariety Of Subjects<br />\nThe reader of the first issue is vain attempt to ape successfully Joyconfronted with musical columns, an Ice Kilmer's beautiful poem, \"Trees\".<br />\nexcellent book column department, The policy of including poetry, howan ironic piece of supposed irony, and ever, is a step in the right direction.<br />\nThe Blue Jay on the whole represome poorly written poetry. Without<br />\ndoubt, though, he should find some- I sents a real attempt, and by its conthing to his- liking, read it, and then tinued efforts to give Hopkins a real<br />\nmagazine is should gain quickly the<br />\ntell his best friend about it.<br />\nThe biting irony of the tale of a sincere support of the student body.<br />\n<br />\nCONSENSUS OF<br />\nOPINION DESIRED<br />\n<br />\nThe Junior Class primary election<br />\n<br />\nFinkel Makes Plea For Support Of Ballot By<br />\nStudents<br />\n<br />\nyesterday resulted in the naming of<br />\nHarry Hopkins and Arthur O'Keefe<br />\nas the presidential nominees who will<br />\nbattle it out in the finals today. There<br />\n<br />\nThe NEws-Lerrot will ask the<br />\nopinion of the student body on the<br />\nnew athletic policy when it hold its<br />\n<br />\nwas no contest for the office of vice1)11. WILSON G. SHAPTER<br />\n<br />\npresident, Robert S. Ward and John<br />\nR. Lill being the only two candidates \"<br />\nnominated.<br />\nFor the post of treasurer, the Jun-<br />\n<br />\nCHANNING POLLACK<br />\nFORESEES CRASH<br />\n<br />\nfirst poll of the year next Tuesday.<br />\nBecause the first real test of the pol-<br />\n<br />\nicy has already taken place it is felt<br />\niors nominated for the finals J. Henry l<br />\nthat the reaction of the student to<br />\nBlucher and Irving Milberg. Albert t<br />\nThe nature of the rally will be twothe plan will he worthwhile and to<br />\nHecht was the other candidate. Of<br />\nfold. It will introduce the Club to<br />\nAddresses<br />\nAudience<br />\nOf<br />\n500<br />\nthre Candidates for the office of secthe best interests of the University.<br />\nthe student body and will be the first<br />\nUnder Sponsorship Of<br />\nretary Norman C. Melvin and James<br />\nofficial call for candidates to the<br />\nThe ballot will be distributed with<br />\nT.<br />\nHarrington<br />\nwere<br />\nnominated;<br />\nZoel<br />\nthree Barnstormer staffs: acting,<br />\nY.M.C.A.<br />\nthe NEWS-LETTER when it is disRadner was the loser. Millard Kaufproduction and business. There is<br />\nAn audience of 500 people in the tributed on Tuesday. The idea of free<br />\nman and Jack Wetzler were successplenty of room in all three departful in the race for sergeant-at-arms, University Baptist Church last Tues- admission to athletic contests in a<br />\nments of the club for interested newCharles<br />\nMoxley being the defeated day night heard Charming Pollack highly controversial<br />\ncomers.<br />\none, and it has<br />\ncandidate<br />\nwarn that \"America, with ice ahead, been given wide<br />\nThe program that has been arpublicity by various<br />\nCandidates<br />\nVersatile<br />\nIs<br />\ndancing,<br />\nsinging<br />\nand<br />\nskit,<br />\nplaying 'handranged includes a three-act<br />\nHopkins was, in his freshman year, Jere.\" Pollack spoke tinder the au- joKralistic organs of the country and<br />\n-The Fatal Quest,\" parts in which<br />\nof coltects<br />\n,..,<br />\n, ,Asnong these may be<br />\nvice-president of his class. He is a spices of the University Y.M.C.A.<br />\nwill be taken by members of the<br />\nEducaLinks<br />\nNoted Rabbi,Speakes On Secmember of the musical club and last<br />\nThe speaker opened his address by cited the Associated Press and the<br />\nClub. Louis SwSTer will outline the<br />\ntion And Decline of Crime, year was chairman of the combined comparing the state of<br />\nond Series Of \"The<br />\nAmerica with Daily Maroon of the University of<br />\nhistory and aims of the organization<br />\nsophomore and freshman dance and that of the \"supposedly unsinkable\" Chicago. It is 'therefore evident that<br />\nViolations<br />\nand Paul Itlinrichs, this years direcHistory Of Judaism<br />\nbanquet committee. O'Keefe, the S.S. Titanic<br />\n'which crashed into an the issue is a highly important one to<br />\ntor, will tell about the plans for the<br />\nWilliam P. Lawson, Police Com- second<br />\nthe students of Johns Hopkins Unicandidate, is a former member iceberg in the year 1912.<br />\nfirst play of the year. The name of<br />\nDr. Louis Finkelstein, prominent missioner of Baltimore, who will<br />\nof<br />\nthe<br />\nwrestling<br />\nteam.<br />\n\"The<br />\ncountry is singing The Music versity.<br />\nthis year's production has been withscholar and rabbi, delivered the sec- speak at the student assembly at the<br />\nWard, has, been for the last two, Goes 'Round and 'Round right up to<br />\nFinkel Urges Voting<br />\nheld up to the present, but will be<br />\nond in his series of three lectures on Hopkins on next Thursday, Novem- years president of his class. He is Nearer My God to Thee.<br />\nannounced tonight. Plays under conStanley M. Finkel, '38, editor-inber<br />\n4,<br />\nhas<br />\nchosen<br />\nas<br />\nhis<br />\ntopic<br />\nfor<br />\nthat<br />\nalso on the football squad. Lill is in<br />\nHe then cited instances of what he chief of the NEWS<br />\nsideration were \"The Tavern,\" \"Three \"The History of Judaism\", Monday, assembly \"The<br />\n-LETTER, urges<br />\nNecessity of Educa- the engineering school.<br />\ncalled \"moral decay\", about which I everyone to participate<br />\nMen On A Horse,\" Whistling in the October 24, at Latrobe Hall at 8.30 tion In The<br />\nin the voting.<br />\nP vention of Traffic<br />\nMilberg<br />\nis<br />\na<br />\nmember<br />\nof<br />\nthe<br />\nhandnobody<br />\ngives<br />\na<br />\nhang.\"<br />\nOxamples were He said:<br />\nDark,\" \"Seven Keys to Baldpate,\" p.m.. The third and last of Dr. Fink- Accidents And<br />\nme\". The Commis- ball team.<br />\nBlucher was treasurer of the expenditures of the 'Roosevelt adand \"What Price Glory.\"<br />\n\"I hope that the poll will have your<br />\nelstein's lectures will be presented sioner will discuss the education of<br />\nhis Class last year, is a niember of ministration, the recent' activities at<br />\nThis year marks the seventeenth<br />\nsupport. It is to the 'rawest of the<br />\nnext Monday evening at Latrobe Hall policemen Vis well as of those who are the Y.M.C.A. cabinet, is on the swim- the committee<br />\nfor Industrial Organi- Hopkins students to vote on the new<br />\nanniversary of the Barnstormers and<br />\nnot<br />\nengaged<br />\nin<br />\nany police work.<br />\nming team, and assistant manager of zation including the general motors<br />\nplans are being made to produce two at 8.15 p. in.<br />\nathletic policy which was inaugurated<br />\nContrary to a previous announcethe musical club. Melvin is a former strike and the alleged dynamiting of two<br />\nDr. Finkelstein has traced to date<br />\nmajor plays and several smaller proweeks ago at the football game<br />\nment, attendance at the assembly will'<br />\nmember of the student council and the Bethlehem Steel plant in Johns- between<br />\nductions. If this plan is carried out, from \"the group of nomads who wor- not be compulsory<br />\nHopkins and Washington<br />\nfor either Fresha, member Of the basketball and la- town, Pa.<br />\nit will mean more activity in under- shipped at Mt. Sinai, thirty or forty men or Sophomores.<br />\nCollege.<br />\nOur aim is to find out how<br />\nWilliam B.<br />\ncrosse<br />\nsquads.<br />\nHarrington<br />\nwas<br />\ntreas\"Every<br />\ndemocracy<br />\nin history has the students of the University feel<br />\ngraduate dramatics than has ever<br />\ncenturies ago,\" to the Pharasees or Kempton, '38, president of the Stu- urer of his Class in his Sophomore ended<br />\nup in the hands of a Caligula, about the matter.\"<br />\nbeen seen at the University before.<br />\ndent Council, in announcing a conyear and is a former member of the a Mussolini, a Hitler, or a Franco.<br />\nThe fall production will be a mod- temple group,\" the first group in tinued policy<br />\nThe NEWS-LETTER polls of last year<br />\nof non-compulsion in<br />\nstudent council. Kaufman is one of It is softening of the spine which has were successful,<br />\nern comedy and present plans call for history to hold a scientific approach connection with<br />\nthe student body restudent assemblies,<br />\nI:he<br />\nreferees<br />\nof<br />\nthe<br />\nlead<br />\ninterfraterruty<br />\nthe<br />\ncollapse.\"<br />\neither a revival of a classic or a mu- to the truth.\" He quoted Dr. Allbright<br />\nsponding very well to the call to take<br />\nstated, \"Student attendance at the<br />\nfootball league. Wetzler is 'a memPollack announced himself as pre- part in the voting on the<br />\nsicale in the spring. The idea has of the Hopkins occasionally, naming first assembly<br />\ncandidates<br />\nof the year, which was<br />\nber of the lacrosse team and was sec- ferring democracy to the \"iron In the election<br />\nbeen broached to combine the iMuof 1936 and the issue<br />\nhim \"one of -the foremost authorities entirely voluntary, and which was retary of<br />\nhis class last year.<br />\nswastika\" or the \"hammer and of the Supreme Court. The<br />\nsical Club and the Barru3tormers in<br />\npolls, a.s<br />\nlarge, shows that there is no present<br />\non Semities in the world.\"<br />\nsickle.\" Under the present system, he compared to what actually<br />\nan effort to put on a production of<br />\nhappened,<br />\nneed for making students attend the<br />\nFinkelstein,<br />\nDr.<br />\nLouis<br />\nat<br />\npresent<br />\nsaid,<br />\nthe<br />\nstandard<br />\nof<br />\nof<br />\nliving of the proved to be very accurate. Roosethe latter type, and it is possible that<br />\nTUDOR AND STUART<br />\nProfessor of Theology and Provost at assemblies.\"<br />\npeople had reached the greatest velt received a majority<br />\nthis will be done.<br />\nfrom the<br />\nBy securing as 'speakers such inthe Jewish Theological' Seminary, is<br />\nTonight at 7:30 thirty members of height in world history. He defend- student body and the<br />\nIn addition to President Swyer, the<br />\nchange in the<br />\nteresting public figures as Commisthe Tudor and Stuart Club will hold ed the so-called \"economic royalist\" Supreme Court was<br />\nofficers of the club are William L. the first of the lecturers to appear sioner Lawson,<br />\nvoted<br />\ndown.<br />\nWilliam Kempton<br />\na smoker in their rooms in Gilman as one without whom suoh a thing<br />\nSnyder, secretary-treasurer, Frank under the joint sponsorship of the hopes to remove<br />\nall need for compulHall, the features of which are to be would not have been possible.<br />\nCrist, business manager, and Daniel University and the Baltimore Round sion in<br />\nthe future attendance at stuTable of the National Conference of<br />\n\"The<br />\nTudor and Stuart Boys<br />\nPollack also blamed much the presGidinsky, production manager.<br />\nJews and Christians. The latter is a dent assemblies. Mr. Lawson was se- Abroad\" Paul Berge and Jack Cham- ent state of the nation<br />\nupon the polilected<br />\nto speak because of his posia national organization for encouragbliss, who plan to regale the clubmen tician, \"the lowest form of insect<br />\ning good will and propagating more tion as a Republican leader, and be- with anecdote and pictures of the life.\"<br />\nMen To Be Taken In During<br />\naccurate knowledge about various re- cause of the attention he has attract- Vaterland and the Tyrol.<br />\nNext<br />\nAmerican education was also deemSix<br />\ned as Police Commissioner. In his<br />\nligious groups.<br />\nAlso on the program of speakers ed responsible for the situation. \"We<br />\nWeeks<br />\nS. P. E. 's Have First Crack<br />\nwork as head of the Baltimore Police<br />\nLectures Follow<br />\nare Dr. Raymond Dexter Harens, are turning out an amazing number<br />\nAt Freshmen, Ten Next<br />\nA series of fifteen lectures on sub- Force, he has instituted many re- Caroline Donavan, professor of Eng- of boys and girls who by<br />\nAt its regular weekly meeting on<br />\nnot stretch<br />\nWeek<br />\njects pertaining to Catholicism and forms in traffic regulations and po- lish Literature, who returned recently of the imagination can<br />\nbe called edu- Monday, October 25, Company I, Seclice equipment. Although present<br />\nscheduled<br />\nto<br />\nProtestantism<br />\nis<br />\nfollow<br />\niron' a six month's travel in Europe cated.\" He cited examples of \"apall- ond Regiment at Hopkins announced<br />\nTomorrow Sigma Phi Epsilon and<br />\nplans as to details of his speech are i<br />\nand the Near East, working on a ing\" ignorance on the part of appli- the names of the cadet officers who<br />\ntheir freshmen rushees will celebrate Dr. Finkelstein. These lectures will<br />\nonly tentative, Commissioner Lawwill be, taken into the .Military- Honstuy of Wordswith during most of cants for various positions.<br />\nthe beginning of the fraternity Open be presented by Dr. William H. Russon<br />\nwill<br />\nprobably<br />\ntell<br />\nsomething<br />\norary Fraternity within the next six<br />\nthe time.<br />\nHouse season at the Hopkins. No sel of the Catholic University, who<br />\n( Continued on -Page 4, Col. 1)<br />\nabout the Work of educating members<br />\nwill<br />\noutlook;<br />\nCatholic<br />\ndeal<br />\nwith<br />\nthe<br />\n.<br />\nweeks. .Scabbard and Blade pledgees<br />\none shares the day with the S. P. Es<br />\nof the police force in the new work<br />\ninclude the following: M. J. Hartke,<br />\nbut next week ten other affiliates of and Professor Cyril C. Richardson<br />\nwhich has resulted from the many<br />\nsecond in command- of- \"A\" Company;<br />\nthe Interfraternity Board divide five of Union Theological Seminary, who<br />\nchanges.<br />\nwill discuss Protestantism.<br />\nStanley R. Kramer, Captain of \"C\"<br />\ndays of open house.<br />\nArthur Garfield Hayes, who will<br />\nThe Johns Hopkins University is<br />\nCompany; John D. Carper, first LieutSaturday, November 6, is catchspeak at the assembly on November<br />\nthe<br />\ncofirst<br />\nits<br />\ninstitution<br />\ntype<br />\nto<br />\nof<br />\nenant of \"A\" Company; Hugh H.<br />\nas-catch can as far as the Modern<br />\n11, was also chosen as a speaker beJohnston, first Leiutenant of \"C\"<br />\nGreeks are concerned, though it has operate with the Conference in precause of the attention he has recentMembers<br />\nThirty<br />\nOf<br />\nFaculty<br />\nAttend<br />\nDinner<br />\nIn<br />\nCompany; Charles It. Foard, first<br />\nbeen customary for freshmen to senting a series of lectures, and the<br />\nOf<br />\nHonor<br />\nly<br />\nattracted<br />\nby<br />\nhis<br />\nBaltimore<br />\nAdverLeiutenant of \"C\" Company; B. L<br />\nvisit lodges of their choice on this Conference aims to bring the out<br />\nThirty-Five Years' Service Of Library In<br />\ntising Club address and by the reHarris, Captain of \"C\" Company.<br />\nday. At 3 p. m, the following after- standing scholars in each of the recall of an invitation for him to speak<br />\nCharge<br />\nOf<br />\nMain<br />\nligious<br />\nlecReading<br />\nHopkins'<br />\nRoom<br />\nthe<br />\ngroups<br />\nto<br />\nCharles<br />\nC. Councilman, Captain of<br />\nnoon bids will be presented by the fraat the Constitution Day exercises at<br />\nture platforms.<br />\n\"B\"<br />\nCompany; and C. J. Merril, first<br />\nternities.<br />\nThirty-five years of faithful service frcac condimc n I,, rubmcundo perat<br />\nBaltimore<br />\nstadium.<br />\nMr.<br />\nHayes<br />\nis<br />\nThe lectures ale open to students,<br />\nLieutenant of \"B\" ompany.<br />\nMonday next Alpha Tau Omega and<br />\na national officer of Pi Lambda Phi Tuesday night at the Johns Hop- fusac. This, however, was only a<br />\nDelta Upsilon will entertain \"desir- faculty, and the general public. They<br />\nThe present officers of the society<br />\nFraternity, which has a chapter on kins University. Miss Frieda Thies small part of the fancy dishes that<br />\nconsecutive<br />\nare<br />\nto<br />\non<br />\nbe<br />\ndeliverad<br />\nable\" first.yz•ar men; Tuesday, Phi<br />\nIn recognition of this service was -were served; the rest came soon aft- are: Major C. T. Mewshaw, Captain;<br />\nthe Hopkins campus.<br />\nGamma Delta and Kappa Sigma are Mondays throughout the series.<br />\nLieutenant W. G. Keir, first Lieutentendered a dinner fit for a Roman em- er.<br />\nhosts; Wednesday, Phi Kappa Psi and<br />\nHULLABALOO PHOTOS peror by grateful professors of GI- Then there was luscious melagris ant; Captain J. Alexander, second<br />\nBeta Theta Pi share the spotlight;<br />\nman Hall. The scene of the festivi- gallopav, which precided some fine Lieutenant, and Lieutenant W. H. C.<br />\nThursday belongs to Alpha Delta Phi Science Club To Hear<br />\nThe Hullabaloo photographer arrived ties was the Faculty Club where *3a saliva. And what meal is com- Ruggelburg, find Sergeant. Other<br />\nand Alpha Chi Rho, and the last<br />\nDr. Tracy Sonneborn yesterday, and is taking picture of about 30 of Hoplcins's premier pro- plete without something with Which members are R. B. Stagmler, W. B.<br />\ncrack on Friday, if any of the feted<br />\nall fraternity men and non-fraternity fessors gathered to pay homeage to to top it all off? So, the assembled Kempton, W. Griffin, and J. Hranicka.<br />\nones can resist alumni and pep talks<br />\nseniors. Be will photograph all a loyal servant.<br />\ndiners were served either lactua or<br />\nThe society was founded here at<br />\nDr. Tracy M. Sonneborn, assothrough today and Monday, at rewill be administered by Delta Phi and<br />\nUpholding the Hopkins academic roffea arahica elixa.<br />\nHopkins in 1920. Its purpose is to imciate in Zoology at the Hopkins<br />\nAlpha.<br />\nduced rates. Photographs taken at a tradition and world-renowned thirst<br />\nKappa<br />\nThe names of these foods were list- prove the R. 0. T. O. on the campus<br />\nwill speak at the first open meetAccording to John J. Ghinger, '38,<br />\nlater date will be taken with new for learning, the dinner was provided ed in the menu for the dinner. They and to equip the unit with more effiing of the Johns Hopkins Science<br />\nInterfraternity Board Head, who<br />\nrates effective.<br />\nwith<br />\na<br />\nInstead<br />\nnovel<br />\nfeature.<br />\nof<br />\nbewere<br />\nprinted in Latin in the bill of cient and better trained officers. Off<br />\nClub today at 7.15 p.m., in RemTheodore Schad, managing editor ing offered the ordinary victuals of fare which had the format of a Uni- the campus its purpose is to keep<br />\nmailed party bids to freshmen on<br />\nsen 301.<br />\nof the Hullabaloo, has expressed his the routine American cuisine, the versity Circular. Perhaps it has been alive the ideals set forth in<br />\nWednesday, a \"strictly enforced sothe naDr. Sonneborn's subject will be<br />\nregret that the same unfortunate diners were treatetd to some deli- found that Latin is more easily di- tional Constitution and to enlighten<br />\n-lent period,\" will exist between 1 a. m.<br />\nSex in Paremeciiiin, dealing with<br />\nsituation, wherein fraternity pledgese cious selinon with some equally as gestible for university professors than the public with intelligent informaand 3 p. m. Sunday. Violations durDr. Sonneborn's recent discovery<br />\ncannot take advantage of the reduced delectable olivaeinuriaticae, which Is the En4lish of our contemporary tion concerning the militaryrequireing those hours are counted as being<br />\nof sex in these protozoa.<br />\nof a grave character.<br />\nrates, has arisen as it did last year.<br />\nwas followed by some exqusite os- lAmerica.<br />\nments of our country.<br />\n<br />\nDR. L. FINKELSTEIN LAWSON TO NOTE<br />\nDELIVERS 2ND TALK EDUCATION WEEK<br />\n<br />\n-••<br />\n<br />\nScabbard And Blade<br />\nTo Induct Members<br />\n<br />\nOpen House Season<br />\nBegun By Fraternities<br />\n<br />\nMiss Frieda Thies Honored For<br />\nLong-Time Service In Library<br />\n<br />\n411.<br />\n<br />\n-<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br />\n2<br />\nSpain Hitler and Mussolini are every day adding a bit<br />\nmore property to their personal holdings. And, in the<br />\nEast, Japan is advancing to miltary glory over an ,opposition bereft of all save courage.<br />\nPerhaps public opinion is indifferent to these outrages.<br />\nThere is comparatively little articulate expression<br />\nagainst them. But in the streets countless individuals<br />\nare expressing their now-Isolated protest.<br />\nHope for our salvaton rests with this now-divided<br />\nmajority. The real ask for the future is• not so much<br />\n82.00<br />\nto make speeches about returning to the pre-war era as<br />\nSubscription per year<br />\n42.00<br />\nit is to organize a progressive American people to light<br />\nBy Mail ....<br />\nthe impending doom.<br />\nRemit subscription fres to Treasurer, Student Activities Council,<br />\nAnd when this is done, it will be found that \"almost<br />\nUniversity.<br />\nRemsen Hall, Postoffiec, John Hopkins<br />\n-- everybody gives a hang.\"<br />\npostoffice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\nmatter<br />\nclass<br />\nEntered as second<br />\nin Baltimore Md., under the Act of Congress. November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins<br />\n<br />\nVie 3obn5 j)ophins<br />\n<br />\nletter<br />\n<br />\nNew Blue Jay<br />\n<br />\nEDITORIAL STAFF<br />\n• Editor-in-Chief<br />\nStanley -Finkel<br />\nManaging Editors<br />\nJ. Murray Kempton, Wethered Bae,oII, Jr.<br />\nAssociate Editor<br />\nBenjamin Root<br />\nManaging Editors<br />\nAssistant<br />\nVictoroff<br />\nM.<br />\nVictor<br />\nJ. C. Handelsman,<br />\n• Sports Editor<br />\nHarold Zheutlin<br />\nFeature Editor<br />\nSeymour Sacks....<br />\nExchange Editor<br />\nMal Boshnack, '39<br />\nREPORTERS<br />\nMel Taymor, '40; Morris Wessel, .'39; Charles Diggs, '40<br />\n-Leonard Unitt, '40; Daniel Stone, '39; Zeana Baum. '38;<br />\nCarl Resin, '38; .1.ester Rosenthal, '38; Lcimard<br />\ngee. '38<br />\nBUSINESS STAFF<br />\nBusiness Manager<br />\nMeli1le Locker<br />\nFounded 1897<br />\n<br />\npotpourri<br />\nBy BUDDY MACHT<br />\n<br />\nFamous Phonies<br />\nLooking up a phone number the<br />\nother day, We, as usual, got mixed up<br />\nand landed in the sh's instead of the<br />\n<br />\nFOR MODERN GREEKS<br />\nand dr-biking clups, everybody had a<br />\nFor the benefit of you rushmen<br />\nfor- good time.<br />\nhave<br />\nmay<br />\nwho<br />\nfreshmen,<br />\nyou<br />\nAt least six of the Kappa Sigs will<br />\ngotten that next week is the begin'be in an embarrassing position, if<br />\nopen<br />\nthe<br />\nprint<br />\nwe<br />\nend,<br />\nning of the<br />\nthey happen to violate interfraternity<br />\nhouse schedule released recently by<br />\nrushing rules. Those six are members<br />\nthe inter-fraternity bored.<br />\nof the Student Council. Or didn't you<br />\nMonday:<br />\nknow?<br />\nAlpha Tau Omega, Delta Upsilon<br />\n<br />\ns.'s. We were about to turn the page<br />\nwhen our eye was caught by a famil- Tuesday: , Kappa Sigma, Phi Gamma Delta<br />\niar name. We looked again and it<br />\n<br />\nwas still there, George Bernard Shaw Wednesday:<br />\nPhi Kappa Psi, Beta Theta Pi<br />\n—TU-1565-W. We had • heard of<br />\nThursday:<br />\nthings like this but they had always<br />\nRho, Alpha Delta Phi<br />\nAlpha<br />\nsounded fishy to us, so we did a little<br />\nFriday:<br />\nexploring. The results were illumDelta Phi, Kappa Alpha<br />\ninating to say the least.<br />\nYellen Alpha Delta Phi's Barron<br />\nIt seems that Baltimore possesses<br />\nand company attempted to stria a<br />\nquite a few celebrities—by proxy.<br />\nrushee's house the other night, they<br />\nWe found a Shakespeare, a couple<br />\nfound a corps of Phi Psis dominating<br />\nof Hamlets and Macbeths, quite a<br />\nthings in the kid's room. When the<br />\nfew Dickenses and .Wordsworths,<br />\nA.D.'s left they found their jalopie<br />\nnot<br />\nbut<br />\nByrons,<br />\nand<br />\nloalliaCei--taelleys<br />\nsoaped to the gills. Wedgy ain't the<br />\nthat<br />\na single Keats. The only thing<br />\none to talk, but he suspects foul play.<br />\n<br />\nChi<br />\n<br />\nHO'<br />\nAN.'<br />\nCL<br />\n<br />\nA current dispatch tiy the ACP<br />\nfrom Columbus reports that cooperative purchase of supplies by fraternities and sororities at the Ohio<br />\nState University saved them 16% on<br />\n$90,000 worth of provisions during<br />\nthe last year. Forty-six of the 58<br />\nfraternities now have \"A\" credit ratings. When the auditing division was<br />\nestablished on its.present basis four<br />\nyears ago, fraternities 'owed creditors approximately $65,000. This has<br />\nnow been reduced to $15,000. We<br />\ndon't have any statistics on the credit<br />\nrating- of lippkiae. fraternities, but<br />\n'certainly they don't have any trouble<br />\nreducing debts below $15,000 without<br />\nthe need of cooperative purchases.<br />\n<br />\nBlue<br />\n<br />\nThe first of the revived Blue Jay issues has made its<br />\ndebut to the campus. Banned officially now for over<br />\nthree years, this literary magazine has had a varied<br />\n.career<br />\nmost very dull.<br />\nThis year, it appears that the Blue Jay is fluttering its<br />\nweakened wings and promises to fly to the heights of<br />\nyesteryear. The campus, like us, is just looking over<br />\nthe new issue and starting an &valuation.<br />\nWhether the University has the place for a literary<br />\nmagazine of the Blue Jay's type will be partially<br />\npuzzles us is the fact that there are Wonder who?<br />\nanswered by the success of this year's issues.<br />\nseventy Edwards and 'only fifty-one<br />\n'—<br />\nMonroe Sarezky claims, although<br />\nThe Phi Sigs pray the night before<br />\nSimpsons. If you don't believe us,<br />\nnobody asked him, that he prefers each of their football games. Their<br />\ncount 'em yourself.<br />\ncourse<br />\nI9311<br />\nOf<br />\n1937<br />\nMember<br />\nGoucher gels to local color.<br />\nprayers must have been heard, since<br />\nJust for fun we called up Joe Monroe is now wallowing in one of all of their games for the past three<br />\nShakespeare. Joe wasn't home, but them thar eternal triangles. Monroe weeks, have been cancelled due to<br />\nDisiribuox of<br />\n.<br />\nWe are pleased at the initial response to our call for his wife was. She told us that Shake- loves her; she loves Monroe; and rain. By the way, why does Brother<br />\nletters. Each of the writers will find that his words are speare was down at the barber shop Monroe has been alienating his own Handelsman cherish a shotgun that<br />\naffections for years.<br />\nhe keeps stored at the Phi Sig house?<br />\nprinted on the same page as our opinions.<br />\nplaying pinochle. We said, thanks,<br />\nPerhaps is to, make sure that his fuTo the others who are hesitant we urge you to put<br />\nwe'd call again. And we will, too.<br />\naaaaaaaaa row NAlsoN•L ASSRIWIIIINCI ST<br />\npracinvited<br />\nhave<br />\nPhi's<br />\nDelta<br />\nThe<br />\nture heirs enjoy the advantages of a<br />\nyour thoughts in writing. You will soon discover how<br />\ntically the whole freshman class, en quiet home life, which he doesn't<br />\nyour opinions bear up under public scrutiny. You will<br />\nCOIft Publishers' Representative<br />\nmasse, to their open house next Fri- have. At any rate the boys are prefind the outlet for influencing others with your comNEW YORK, N. Y.<br />\n420 MADISON Ave.<br />\nday night. In case any one wes over- paring for their first fall formal on<br />\n•<br />\nERIcsso %Boss. - Los Most\", • SSA EMIICISCO<br />\nments or at least pointing out your side of an issue.<br />\nstar spangled banner, 0 looked, 'twas due to negligence — November 6th. Dorm boys please<br />\nThat<br />\nRemember, if you do not want your name printed,<br />\nmerely indicate this desire, and we will honor your long may it wave . .. Last Saturday pure negligence. See Bill McFeeley note.<br />\nthat,<br />\nrequest.<br />\nthe football team of the University for a personal invite. It is said<br />\nthis widespread rushing is taking' With new raised gold backed glass<br />\n• Now that the ice is broken, we expect a steady sire<br />\nMaryland played that of the Unione lettering adorning the front door,<br />\nleast<br />\nat<br />\nthat<br />\nhope<br />\nthe<br />\nin<br />\nplace<br />\nof \"Letters to the Editor.\"<br />\nversity ef Syracuse. One of the stars man will be snagged who has a<br />\nand a real housemother gracing the<br />\nboy,<br />\nHindu<br />\na<br />\nis<br />\nof the Syracuse team<br />\nchalice of graduating some day.<br />\nkitchen, the Beta boys feel slick. The<br />\nFRIDAY, OCPOBER 29, 1937<br />\nHudat-Singh, but for some reason or<br />\nfact that Jimmy Coady has a new<br />\nformal<br />\nits<br />\nheld<br />\nDelta<br />\nBeta<br />\nPhi<br />\nFord and Bill Staub has a new Ponother when the game started, he was<br />\n'dance at Levering Hall last Saturday tiac doesn't make the Betas weep<br />\non the bench. He stayed there all<br />\nnight. Jewett Goldsmith, the eminent either. Must have struck a gold mine<br />\nafternoon.- The local newspapers lover and whispering baritone, lived<br />\nin the cellar.<br />\nThroughout the country comments are being made on<br />\nof<br />\nout<br />\nkept<br />\nbeen<br />\nhad<br />\nhe<br />\nthat<br />\nstated<br />\nelecup to his reputation. Myra Bender,<br />\nclass<br />\nin<br />\nballoting<br />\n--There is no pretense at secret<br />\nour athletic program. The Daily Princetonian reflects<br />\nof<br />\nconsent\"<br />\nmutual<br />\ncampus<br />\n\"by<br />\nredemoiselle,<br />\npopular<br />\nwas<br />\ngame<br />\nthe<br />\nMerel Hormel, head of the local<br />\ntions here, because you must sign your ballot, thereby for the most part the attitude of the outsiders. This<br />\nin a red satin gown and Phi Hp house, has a brother who<br />\nsplendent<br />\nsure<br />\nquite<br />\nweren't<br />\nWe<br />\nteams.<br />\nboth<br />\nallowing members of the Student Council to know how newspaper states:<br />\nattracted all the wolves at the affair hopes to be head of the Pi Lam house<br />\n\"Johns Hopkins University. always a pioneer and a just what \"mutual consent\" meant,<br />\nyou voted.<br />\n—including Bert,,Hecht (the rat). at Michigan. The same frat wasn't<br />\nleader, paves the way for complete abolition of athletics as we decided to find out.<br />\nIn spite of having to pay for paper big enough to hold them both.<br />\nIt la silly to say they are disinterested, because fra—the inter-collegiate species—with the elimination of<br />\nWe did.<br />\nternity brothers of some of them are candidates for the paying customers from its football program.<br />\noffice.<br />\n\"The boy did not play,\" they told<br />\n\"Last week the Daily Princetonian advocated the<br />\n• However, it seems bad taste for candidates to hover complete elimination of admission charges to football us, \"because we weren't sure whether<br />\naround the box in the manner some, one, a former games, charging that 'some of the boys can't afford to he was a Hindu or a negro, and,<br />\nbuy tickets.'<br />\nWe Present Unc's Brother, priation, as do all other campus activcouncilman, did at times yesterday, and look over stusince we were in doubt about the Herewith<br />\n\". . . .Princeton could make the change to the free<br />\nAs Both Writer And<br />\nities.<br />\nfrom the<br />\ndents' shoulders or at their ballots while they were votgate and de-emphasize her intercollegiate athletics too, matter, he was withdrawn<br />\nWrites<br />\nAs to the question raised about<br />\ning. Even the ethical conscience of some would fore- and it wouuldn't hurt her enrollment. . . . So could the game. .The University of Maryland<br />\nTo the Editor of The NEWS-LETTER:<br />\norchestras, it is impossible to subUniversity of Chicago, whose student Daily Maroon is wile not play against a team with a<br />\nstall such action.<br />\nDear Sir:<br />\nmit bands to the students for their<br />\nWhy have the ballots signed, anyway? A member campaigning for the university's withdrawal from the negro on it.\"<br />\nYou asked for letters to the NewsBig Ten and the reduction of student athletics to an<br />\napproval. We always get in touch<br />\nof the council is constantly on duty at the box to hand<br />\nWe felt like yelling, fighting. Who LEirrea—well print this—<br />\nbasis.... With the present day trend towards<br />\nintramural<br />\nwith the five largest musical bookout ballots and check men off as they cast their votes.<br />\nUniversity of Maryland<br />\nTo Judge Mehling and members of<br />\niprofessiorializing college football in order to produce in hell is the<br />\ning agencies. in the country—RockIn this way no one can vote twice, and precautions as winning teams and pull the alma mater out of the finan- to decide whether or not a person the Cotilion Board—<br />\nwell-O'Keefe, Music Corporation of<br />\nto voter eligibility are presumably taken care of in cial dumps, such,moves are gratifying to one who still is inferior because he's not white, but<br />\nWhy is it the students of Hopkins<br />\n<br />\nDR1S<br />\nMeet<br />\n<br />\nAfte<br />\nweeks,<br />\nsend h<br />\nThe m<br />\nHome<br />\n<br />\nGood Response<br />\n<br />\n!Associated Collet5iate Press<br />\n<br />\nOn .<br />\n<br />\nColletSiate Di6est<br />\n<br />\nweaker<br />\nyear t.<br />\nfair su<br />\n..classm:<br />\n<br />\nNationalAthertisingService,Inc.<br />\n<br />\nhopes<br />\n<br />\nColor Scheme<br />\n...<br />\n<br />\n1937<br />\n<br />\nMEMBER<br />\n<br />\nson. ,<br />\n. Carl,<br />\nlast y.<br />\n<br />\n1.939<br />\n<br />\nport<br />\nJay<br />\nThe<br />\n<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\n<br />\nJunior Primaries<br />\n<br />\nSholtefresh<br />\nis expe<br />\n<br />\nJohns Hopkins, Pioneer<br />\n<br />\nLETTERS TO THE EDITOR<br />\n<br />\nblack, yellow or brown. We felt like never have a voice In the selection of America, Associated Artists, Mills<br />\nArtists, and Consolidated Artists,<br />\nyelling, but we didn't. We walked bands for our dances? After all don't<br />\nand choose the best band available<br />\nout slowly: We felt very tired.<br />\nyou depend on them to support your of those submitted. It so happens<br />\nthat<br />\nsure the majority of the Thanksgiving Cotillion<br />\n. . . O'er the land of the free and cotillions. I am<br />\nhas bethe students are not in favor of col- come a tradition at the Hopkins.<br />\n.<br />\n.<br />\n.<br />\nbrave.<br />\n'the<br />\nthe home of<br />\nored bands playing for us, when Naturally, it is harder to get bands<br />\nthere are so many good white bands for this date than for later in the<br />\navailable. I know you do not like to winter, because it is the beginning of<br />\nrepeat the same orchestras over and the business hotel season of the year<br />\nHeard in the lobby on the opening over again. Tommy Dorsey and Hal<br />\nin most large cities. Now, the booknight 'of the George M. Cohan play: Kemp in mind; but what is wrong ing agencies will not<br />\nsign a contract<br />\n\"You've got to take what he tells with such bands as Glen Gray, Will for a big band anymore<br />\nthan four or<br />\nWe must admit that on analysis 'most of what Mr.<br />\nyou with a dose 'of salts\" . . . Bert Osborne, Jan Savitt, Mal Hallett, five, possible six, weeks<br />\nprior to the<br />\nlecture<br />\nuniversity<br />\nhis<br />\nin<br />\nperpetrated<br />\nPollack<br />\nChanning<br />\nMargolis, one of the swellest mugs Bunny Berigan, Horace Heidt, and engagement. When the<br />\ntime is ripe,<br />\nlast Tuesday night seems pretty definitely hogwash.<br />\nthe campus, is leaving school be- Hudson Delange. I could name many one just'grabs the best thing<br />\non<br />\nthat<br />\nIn what ..we believe to be a fine gesture of sympaBut there was one statement of his with which we are in<br />\ncause of a death in his family. The more you could select from.<br />\ncomes along, and that's that. These<br />\nthetic understanding, the Johns Hopkins Club of New<br />\nbest of everything, Bert, we hate<br />\nreceived a 'so-called 'Popularity Contests\" for<br />\ncomplete agreement.<br />\nhave<br />\nyou<br />\nafter<br />\nthink<br />\nI<br />\nE.<br />\nChanning<br />\nMrs.<br />\n'to<br />\nletter<br />\nfollowing<br />\nthe<br />\nsent<br />\nhas<br />\nYork<br />\ngo... . The building which list of the bands available from the orchestras are simply<br />\nThe speaker had been outlining a series of incidents, iSweitzer, widow of the late, honored Johns Hopkins to see you<br />\nadvertising<br />\nis now used by the Hopkins playA. , you should present them schemes, and mean nothing when it<br />\nwhich, in his mind, showed the moral'decay of our alumnus:<br />\nwas once an R.O.T.C. store- to the student body and select the one conies to getting a band.<br />\nshop<br />\nAt a meeting of the Board of Directors of the Johns<br />\ncivilization: • ,And, at the conclusion of each, he would<br />\nroom and the gym for a private that is most favored by them. Do aThe Cotillion Board has signed<br />\nHopkins Club held last night, the following resolutions<br />\nenunciate sadly; \"And nobody gives a hang.\"<br />\nschool '. . . Maybe our fillip to the way with this one man selection, Claude Hopkins for the<br />\nfirst Cotillion<br />\nwere adopted:<br />\ndid some good. Maybe meaning you, Judge. After all, we because he is the<br />\nBarnstormers<br />\nThat, at least, is perfectly true. What Mr. Pollack<br />\nbest band available<br />\n\"Whereas, CHANNING E. SWEITZER, the founder<br />\nSwyer, are the ones who must support those<br />\nLew<br />\nrate,<br />\nany<br />\nat<br />\nbut<br />\ndidn't,<br />\nit<br />\ndays,<br />\nthese<br />\nfix<br />\nbad<br />\npretty<br />\na<br />\nin<br />\nis<br />\ncivilization\"<br />\n\"white<br />\ncalls<br />\nfor that date. Hal Kemp, Glen Gray,<br />\nand guiding spirit of the Johns Hopkins Club, died on<br />\n'Stormer president, announced three social affairs, and I am sure there Bunny Berigan, Will Osborne, Hudand most people-are pretty bored about it all. ,<br />\nOctober 5, 1937; and<br />\ndays later that !here will definitely were better' bands available than son DeLange, Tommy Dorsey, and<br />\n1937<br />\n27,<br />\nOctober<br />\nof<br />\nresult<br />\nthe<br />\nbe<br />\nNow, this indifference may very well<br />\nbe two plays thiseYear. Ho hum. .. Claude Hopkins.<br />\nbrother Jimmy, Duke Ellington, HorSweitzer:<br />\none too many mid-term Republican conventions or My dear Mrs.<br />\nHere's hoping we get a choice in ace Heidt, and others, are not availWhereas, the members of the Johns Hopkins Club<br />\neven one too many of Mr. Pollack's efforts in the AmenFebruary.<br />\ndue to previous engagements.<br />\nable<br />\nmatter—come<br />\nthe<br />\nwill deeply feel the loss of his untiring efforts, his many<br />\n'can Mercury. But we don't think so.<br />\nsacrifices, and hs fine sense of loyalty to Johns Hopkins<br />\nB. H., Student For that matter, there are many,<br />\ndon't<br />\nnovels,<br />\nIf you enjoy historical<br />\nunlike 'B. H.\" who consider the band<br />\nThe truth is, of course, that we've all been sitting on University,<br />\nfail to read Heinrich Mann's Henry<br />\ngood as<br />\nNow, therefore, be it<br />\nTo the Editor of The NEWS-Lerree: of Claude Hopkins to be<br />\na powder keg too long. There is hardly a college stuof the<br />\none<br />\nUndoubtedly<br />\nNavarre.<br />\nof<br />\nany<br />\nin the country today.<br />\nResolved. That the Johns Hopkins Club has sustained<br />\nDear Sir:<br />\ndent today whose articulations have not been spent in.a<br />\nbooks of its type to appear in<br />\nbest<br />\nof<br />\ndeath<br />\nthe<br />\nits<br />\nby<br />\nloss<br />\nirreparable<br />\nand<br />\nfriend<br />\nIn closing. I should like to say only<br />\nan<br />\nIn reply to the letter from \"B. H.\",<br />\nperiod through which the threat of war was imminent.<br />\nmakes fascinating<br />\nfounder, Channing E. Sweitzer, whose lovable personal- recent years it<br />\nthat there is no \"one man selection\" in<br />\na copy of which you were considerate<br />\nAs a result a sort of purblind fatalism has come over ity and influence will be deeply missed and mourned reading.<br />\nthe<br />\nCotillion Board. There is no one<br />\nenough to send me, I submit the folmost of us. \"Hell hasn't popped yet, so why worry.\"<br />\nby all its members; and further<br />\nperson on the Board with more<br />\nIf You appreciate better music, hear lowing:<br />\nThen, again, there is a desperate kind of cynicism in<br />\nhereby<br />\ndoes<br />\nSymClub<br />\nHopkins<br />\nJohns<br />\nthe<br />\nResolved, That<br />\nHans Kindler and the National<br />\nauthority than any other, all memThe Cotillion Board does depend upour attitude towards the future. We make feeble jokes extend to the members of the immediate family of Chaq- phony Orchestra at the Lyric two<br />\nbers having one vote. If there needs<br />\non the Student Body to support its<br />\nabout spending next winter in China—\"saving the world ning E. Sweitzer its deepest sympathy and understand- weeks hence.<br />\nto be a delegation of authority for<br />\nnon-students<br />\nmany<br />\nare<br />\nThere<br />\ndances.<br />\nfar J. P. Morgan.\"<br />\ning in their recent bereavement; and further<br />\nIf you like to laugh, get a ticket who regularly attend the Cotillions, any reason, naturally such a delegaResolved, that copy of these minutes is hereby orAnd, so, \"nobody gives a hang.\" But, it isn't so<br />\nby hook or crook for You Can't Take but since the Board is primarily an tion falls upon a Senior, preferably<br />\nindividthat<br />\nChanning<br />\nMrs.<br />\nE.<br />\nis<br />\nit<br />\nas<br />\nto<br />\nindifferent,<br />\nsent<br />\nbe<br />\nSweitzer.\"<br />\nis<br />\nworld<br />\nto<br />\ndered<br />\nthe<br />\nthat<br />\nthe President, since he has had more<br />\nmuch<br />\nit TVith You, the funniest comedy activity of 'the Hopkins, we habitually<br />\nVery truly yours,<br />\nuals are too weak to take up what looks like an imexperience that the lower classmen.<br />\nwe've ever seen.<br />\nsolicit student support before going<br />\nJ. R. BARTELS,<br />\npossible task.<br />\nYour ticket, \"B. H.\", will be regeneral<br />\nThe<br />\nthe<br />\npublic.<br />\nto<br />\nfact'<br />\nthat<br />\nthings<br />\nsee<br />\nHallowto<br />\nwant<br />\nyou<br />\nIf<br />\nJOHNS<br />\nHOPKINS CLUB.<br />\nPresident, THE:<br />\nThe job, it is true, is getting harder every day. Cerserved at the door.<br />\ne'en eve start at the negro Royal we do invite the public is made necSweitzer,<br />\ntanly the vigilante movements of last summer brought Mrs. Channing E.<br />\nSincerely,<br />\nTheatre. \"You checks youah razor essary because the Board does not refascism nearer to America than it has ever before been. 227 Hamilton Road<br />\nceive one cent of money as an approJ. Judge Mehling<br />\nat the box office.\"<br />\nJersey.<br />\nAnd, abroad, the \"impending\" war is an actuality. In Ridgewood, New<br />\n<br />\nadvance of elections. The Council might argue that believes in the glory of the old college try. . . . Johns<br />\nparticipate in the paid-player<br />\nthey can \"double-cheek\"' voters by having his signa- Hopkins, not wishing to<br />\nphase of the game, is challengng other schools to show<br />\nture. Being politicians, members of the Council know<br />\ntheir abhorrence of the pro system, with this 'free gate'<br />\nmost of the student body, and it ix very unlikely that —and our guess is that she'll have some imitators soon.\"<br />\na man would vote another's ballot.<br />\nWe are pleased to note that our contemporaries are<br />\nIt's in refreshing<br />\ntaking this progressive attitude.<br />\ncontrast to the rah-rah attitude of the average unthinking bench-warmer.<br />\n<br />\nNobody Gives A Hang<br />\n<br />\nThings<br />\n<br />\n\"<br />\n<br />\nIncid<br />\nmile<br />\n21 min<br />\nis hel.<br />\nform '<br />\nHop<br />\nn.<br />\nseveral<br />\ntrick.<br />\nLast<br />\na 32-2<br />\nthe Bl<br />\nvenge<br />\nown<br />\nhave o<br />\nmore<br />\nharrie<br />\nBlue f<br />\na vict.<br />\nThis<br />\nHambl<br />\nof th:<br />\nlowing<br />\nJays<br />\nclelp<br />\nThen t<br />\ngage<br />\nAno<br />\nCham.<br />\nington<br />\n<br />\nHop<br />\n<br />\nA Fine Gesture<br />\n<br />\n24.-e.<br />\n<br />\nDo<br />\n<br />\n•<br />\n<br />\nTom<br />\ntravel<br />\nTerps<br />\nHop<br />\nburg .<br />\nera 1-I<br />\nmen<br />\nMaryl.<br />\n4-2 co<br />\nIn<br />\nBlue<br />\nMaryl:<br />\nkins i<br />\ndefeat.<br />\nTo<br />\nlied o<br />\nwere<br />\nUnder<br />\nfense<br />\nLyons.<br />\nJeri_<br />\nthe m.<br />\nTarag*<br />\nAt<br />\nwill fi<br />\nwill b<br />\nat the<br />\n<br />\nAlt<br />\ngame,<br />\nto his<br />\nand H<br />\nflank.<br />\nFoll:<br />\nsoccer<br />\nturn<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br />\n<br />\n3<br />\n<br />\nSP oRT<br />\nHOPKINS HARRIERS<br />\nAND SWARTHMORE<br />\nCLASH TOMORROW<br />\n<br />\nBOOTERS DEFEAT<br />\nTOWS'N TEACHERS<br />\nWITH 1-0 SCORE<br />\n<br />\nHarrier Hurrier<br />\n<br />\nSPEAKING OF ...<br />\n.... Haverford, It'll Be Traditional<br />\n<br />\nFENCING<br />\nSaturday, at 1..30 p.m., the fencing team will hold an organization<br />\nmeeting in the Barn. With Captain<br />\nR. Reeds<br />\n<br />\nback<br />\n<br />\nalong<br />\n<br />\nwith<br />\n<br />\nPhil<br />\n<br />\nSmall, Ken Silvers, and Harris, Hopkins will point to the Maryland Con-<br />\n<br />\nBlue Jays Out To Avenge<br />\nLast Year's 32-23<br />\nDefeat<br />\n<br />\nBlue Jay Soccermen Take<br />\nSecond Consecutive<br />\nVictory<br />\n<br />\nDRISCOLL LEADS JAYS<br />\n<br />\nBRIGGS MAKES J. H. U.<br />\nSINGLE TALLY<br />\n<br />\ndrills for<br />\n<br />\nTeam<br />\n<br />\nseveral<br />\n<br />\nweeks, Coach Waldo Hambleton wlll<br />\nsend his squad against Swathmore.<br />\n<br />\nThe Hopkins'-soccer team gained<br />\ntheir second successive victory last<br />\n<br />\nCOACH WALDO HAMBLETON<br />\n<br />\nThe met will be held tomorrow at<br />\nHomewood over the Hopkins course.<br />\nDriscoll, Pointgetter<br />\nOn the whole, Hopkins skuad is<br />\nweaker than in formes years. Last<br />\nyear the seniors experienced only a<br />\nfair success, but with seven underclassmen<br />\n<br />\non<br />\n<br />\nthe<br />\n<br />\nTuesday<br />\n<br />\nSIGMA PHI EPSILON<br />\nSCORES VICTORY<br />\nOVER KAPPA SIGMA<br />\n<br />\nteam, . returning<br />\n<br />\nhopes were high for the present season.<br />\n. Carl,Sharpf, Lyman and several of<br />\n<br />\nRain Causes Frostponement<br />\nOf Several Games;<br />\nTeams Strong<br />\n<br />\nlast year's lettermen failed to report this year hus weaking the Blue - ALPHA DELTS WIN<br />\nJay runners.<br />\nIn the games played Tuesday and<br />\nThe main hope of Harnibleton is<br />\nJohnny. Driscoll, who succeedp<br />\nWednesday, S.P.E. won its second<br />\nSholtes as captain. Driscoll as a game of the season by defeating the<br />\nfreshman performed well and much<br />\nKappa Sigs. The other game was a<br />\nis expected of him this year.<br />\nclose contest between Alpha Delta<br />\nRecord By King<br />\nIncidentally, the record for the VA and A.T.O. with tlie\"D.'s winning.<br />\nmile run over the Hopkins course is This was the first victory for Alpha<br />\n21 minutes and 58 seconds. This mark Delta and was featured by the playis held by John A. King, who pering of Billy Kempton and Page Edformed back in 1933.<br />\nmunds for the victors.<br />\nHopkins with its present squad'<br />\nWeather Delay<br />\nWill not chalk up many records, but<br />\nBecause of the bad weather of the<br />\nseveral individuals may turn this<br />\ntrick.<br />\n1 past week, four teams haven't as<br />\nSwarthmore Won<br />\nyet played. These games will be<br />\nLast year Swathmore edged out<br />\nplayed off very soon in the future.<br />\na 32-23 win over the home boys, and<br />\nthe Blue Jays will attempt to re- Reuben Baer has arranged for thre<br />\nvenge themselves. This year on their new fields about the school and all<br />\nown ground, Hopkins runners will teams are to contact earns other to<br />\nhave one point in their favor. Swarth- establish the dates of the postponed<br />\n'more is the pre-race favorite, but the<br />\ngames. The captains of each team are<br />\nharriers representing the Black and<br />\nrequested to get in touch with Mr.<br />\nBlue far from concede the visitors<br />\na victory.<br />\nThis will be the opening clash for<br />\nHambleton's thin clads as a .result<br />\nof the Lehigh postponement. Following the Swarthmore clash; the<br />\nJays meet Drexel Institute of Philadelphia on Saturday, November 6.<br />\nThen they travel to Haverford to engage the Scarlet and Black.<br />\nAnother big event will- be the D. C.<br />\nChampionships to be held in Washington near Thansiciving.<br />\n<br />\n•<br />\nHopkins Booters<br />\nBattle Maryland<br />\nTomorrow, the Hopkins booters<br />\ntravel to College Park to meet the<br />\nTerps in a soccer clash.<br />\nHopkins, to date, has topped Gettysburg 2-1 and Towson State Teachers 1-0. The only contest the Lyonsmen have dropped was to Western<br />\nMaryland in the season opener by a<br />\n4-2 count.<br />\nIn their only battle last year, the<br />\nBlue Jays downed the Terps, 2-1.<br />\nMaryland has been gunning for Hopkins in an attempt to revenge that<br />\ndefeat.<br />\nStrength Offense<br />\nTo date, Hopkins rivals have tallied only five goals. Four of these<br />\nwere made by Western Maryland.<br />\nMader this condition, the Hopkins offense is being stressed by Coach<br />\nLyons.<br />\nBriggs and Braysham have been<br />\nthe main offensive threats with Price,<br />\nTaragin, and Phillips helping out.<br />\nAt the goalie position, Maryland<br />\nwill find Romanofsky. The defense<br />\nwill be Captain Gough and Stout<br />\nat the fullback positions.<br />\nHartke Back<br />\nAlthough injured in the Towson<br />\ngame, Hartke is expected to return<br />\nto his center half position. Kephart<br />\nand Hooper will perform on Hartke'S<br />\nflank.<br />\nFollowing the Maryland clash, the<br />\nsoccer team meets Towson in a return match.<br />\n<br />\nManager Lipnick requests that all<br />\ninterested attend this meeting.<br />\n<br />\nINTRAMURALS FEATURE<br />\nWINS BY FAVORITES<br />\nHartke's Return To Help<br />\nStrengthen The '<br />\nIN CLOSE CONTESTS<br />\n<br />\nMeets Set With Drexel,<br />\nHaverford, And D. C.<br />\nChampionships<br />\nAfter staging<br />\n<br />\nference Trophy meet.<br />\n<br />\nBaer in order to secure a field.<br />\nThe present standings of the teams,<br />\nbecause of the postponments, is only<br />\na little indication of the balance of<br />\npower in the leagues. \"Boots\" Kaufman, Bert Margolts,, Johnny Sause<br />\nand other leaders of intramural teams<br />\nhave commented on the high calibre<br />\nof this year's touch football. Surprises have been forthcoming this<br />\nyear. Delta Phi, Beta Theta Pi, and<br />\nPhi Alpha are the new stroilige tearns<br />\nthis year with the old standbyes, Phi<br />\nSi, Pi Lam, D. U., and S.P.E. battling<br />\nthese newcomers for first honors.<br />\n<br />\nSPIKED SHOE<br />\n<br />\nI<br />\n<br />\nTowson<br />\n<br />\nwhen<br />\nState<br />\n<br />\nthey<br />\n<br />\ndefeated<br />\n<br />\nthe<br />\n<br />\nTeachers .1-0. The<br />\n<br />\nLyonsmen scored in the first period<br />\non a well placed kick by Briggs,<br />\ncenter forward, and played well to<br />\nprotect their lead for the remainder<br />\nof the contest.<br />\nRomanofsky Stars<br />\nThe contest was hard-fought with<br />\n<br />\nSeven Jays Show Championship Form In Downing<br />\nSenior Mechanics<br />\nBITSACK<br />\n<br />\nREAL<br />\n<br />\nSTAR<br />\n<br />\nClose, hard - fought touch football<br />\ngames once more were witnessed on<br />\nthe lower athletic field, south of<br />\nLevering Hall. True to fashion, the<br />\nfavorites came through again to add<br />\nanother victory that will put them<br />\n<br />\ncarestanding play on both sides. The<br />\n<br />\nin the play-offs. However, it wasn't<br />\nTeachers, last year's State Cham- until the final whistle was blown<br />\npions, were unable to find any\"openthat the winner was certain of clinching in the defense of Goalie Roman- ing the contest.<br />\nofsky, who played outstandingly for<br />\nIn the Thursday% league, two fine<br />\nthe Hopkins..The ball see-sawed back teams played a nip-and-tuck battle<br />\nand forth for the greater part of the on field 1. They were the Pick-Ups<br />\nsecond and third quarters, with he and the Cadets, with the for<br />\nfullbacks of both elevens playing mer finally leaving the gridiron with<br />\nwell. The latter part of the fray was a 12-0 decision. It was due to the<br />\n<br />\nDRIBBLERS HOLD I WE TWARD HO!<br />\nINITIAL PRACTICE<br />\nOF NEW SEASON<br />\nDear Mr. Sports Editor:<br />\n<br />\nCapt. Carl Rasin Leads Veteran And Newcomers;<br />\nZheutlin Ill<br />\n<br />\nDrilling under the supervision of<br />\nmarked by rough and tumble play superb all-around playing of Paster- Captain Carl Rasin, candidates for<br />\nthe<br />\nHopkins' 1937-38 basketball squad<br />\nnak, Rasin, and Patten that enabled<br />\n'for the Pick-Ups to add another victory held their initial drill.<br />\nA return contest is scheduled<br />\nAlthough only fifteen men reNovember 5, and from the looks of to their record.<br />\nported, hopes for the coming year are<br />\nLiterati Victorious<br />\nthings right now a very hard and<br />\nhigh. The quintet will be built around<br />\nexciting contest is expected. It is<br />\nThe Literati eeked out a 6-0 win Captain Rasin, star guard, Shorty<br />\nhoped that Hartke, regular center over the Tech Hawks in the only Cross and^ Melvin. Suffritutes Len<br />\nhalfback, will be back in the line-up, other game of the day. However it Rubinger, Les Rosenthal, and Jerry<br />\nCarlton also attended this session.<br />\nfully recovered from the leg injury wasn't until they overcame a bit<br />\nNew Prospects<br />\nhe sustained in the first stanza of of intensive strife and confusion that<br />\nAfter football terminates, several<br />\nthe winners managed to push over<br />\nTuesday's encounter. The return of<br />\nmore are expected to turn out. Freshtheir score in the closing minutes<br />\nmen, members of interclass squads<br />\nHartke will•'greatly ,strengthen the<br />\nof the fray. Bitsack proved to be<br />\nand<br />\ntransfer students will strengthen<br />\nBlack and Blue aggregation. If the. the winners starring light.<br />\nthe courtmen. McNally, star of<br />\naction of the. final period of TuesGood football was., again on tap<br />\nWashington's basketeers has enrolled<br />\nday's game carries any weight, his in the Friday games, when the Enat the Hopkins. It is hoped that his<br />\nwon a close contest from<br />\nreturn will be of the greatest benefit gineers A<br />\npresence will reinforce the Black and<br />\nseven. The final score<br />\nand necessity to the Hopkins' booters. the Tri State<br />\nBlue: Incidentally McNally opposed<br />\nshowing only one touchdown differMelvin in the Washington. Hopkins<br />\nThe line-up:<br />\nence. In the same league the Cardiacs<br />\nConflict last year, and gave a good<br />\nHOPKINS<br />\nTOWSON<br />\nscored an expected triump by handaccount of himself.<br />\nRomanofsky<br />\nWilde ing the Engineers B a 18-8 defeat.<br />\ng.<br />\nZheutlin Last<br />\nFrosh A.B. Lose<br />\nGough<br />\nr.f.<br />\nL. Cox<br />\nThe only replacements in Hopkins'<br />\nA 12-6 win was posted by the Liline-up Will be those of Herb Seigel<br />\nStout<br />\n1 f.<br />\nCernik brary team against the Blue Bears.<br />\nand Harold Zheutlin. Seigel was lost<br />\nB, team<br />\nHartke<br />\nWheeler Time after time the double<br />\nC. h.<br />\nthrough graduation while illness will<br />\ntithe the<br />\nthreatened<br />\nbut each<br />\nHoops<br />\n1 h.,<br />\nW. Cox \"breaks\" of the game turned against prevent Zheutlin from joining the<br />\nsquad.<br />\nKephart<br />\nBennett them. The Cement Mixers recorded<br />\nr h.<br />\nConfined to the Hopkins' hospital,<br />\na win over the Frosh A. B. in the<br />\nBriggs<br />\nC.f.<br />\n.Garamerncen<br />\nZheutlin probably will be lost for<br />\nlast game of the day.<br />\nthe<br />\nentire season. Playing varsity<br />\nStern<br />\nBrayshaw<br />\ni r.<br />\nThe Seven Jays, last year's winball for three years. Zheutlin's abLinthicum<br />\nShock ners, looked like the champions they sence will be felt.<br />\ni 1.<br />\nare, when they turned back the SenIn drills to date fundamentals have<br />\nor.<br />\nPrice<br />\nGordon<br />\nior Mechanics by a 12-0 count in a<br />\nbeen,stressed with ball...handling and<br />\nPhillips<br />\n0.1.<br />\nLoenstein Tuesday league contest.<br />\nfootwork as the essentials.<br />\n<br />\non the part of both teams.<br />\n<br />\nThere will be a meeting of the<br />\nSpiked Shoe members on Monday<br />\nevening at 6 o'clock in Levering Hall.<br />\nThe gathering will consist of a<br />\nBy The Associated Collegiate Press<br />\ndinner followed by an election of a<br />\nniw president •due to the fact that<br />\nPaul Castelle, former president, is They Finally Caught On<br />\nBaltimore, Md. ACP)—\"De-emphasized\" football is a reality at the<br />\nnot back at school. Secretary LehnJohns Hopkins University. The football financing problem has been solved<br />\neis asks that all members be present<br />\nto the joy of fans by allowing everybody to go to the games on pisses.<br />\nto help formulate plans for the sponTicket takers, hereafter5, will only glance at \"guest cards.\" The cards are<br />\nsorship of high school track meet.<br />\navailable to all askers and cost nothing.<br />\nEach card will be good for \"bearer\" and all comers—the card Owner can<br />\n<br />\nHITHER AND YONJ<br />\n<br />\nFRAT STANDINGS<br />\n<br />\nBy LEN RUBINGER<br />\nLast week's hair-breadth gridiron victory. gave our Blue Jays their<br />\nsecond consecutive triumph over Haverford—one of the two colleges with<br />\nwhom we seem destined to establish new traditional rivalries.<br />\nit has been interesting to observe, these past few years, the gradual<br />\ncementing and shaping of our relationships with Haverford and Swarthmore,<br />\ninstitutions which, between themselves, enjoy a competition,easily as intense<br />\nand bitter as caws with St. Johns. Perhaps, as a result of our newly established sports policy—a plan which had been in the process of development for<br />\na number of years, we have been influenced in our scheduling of teams more<br />\nby scholastic reputations than by athletic abilities. Hence our present leaning<br />\ntoward the Pennsylvania schools.<br />\nThere is no doubt in anyone's mind that Haverford and Swarthmore<br />\nare more our scholastic equals than any of the establishments with whom<br />\nwe have had dealings in recent years. And now it appears that those same<br />\nschools are more our athletic „equals than some of our past opponents have<br />\nproved to be. Where-once we Pound ourselves anxiously awaiting contests<br />\nwith such teams as Maryland and Washington, now we discover that our<br />\ncompetition with the Terps has almost entirely ceased, while that with<br />\nWashington College is on the way to depletion.<br />\nInstead we are aware of the increasing interest and excitement evident<br />\nin preparation for games with our new Philadelphia rivals. Our pigskin representatives are at present, besides rejoicing over their latest football experience, anticipating their coming battle with the maroon-clad warriors of<br />\nSwarthmore. The fact that they cannot'forget last year's 40-19 defeat up<br />\nat the Swarthmore field is further proof of their newly acquired spirit.<br />\nBy the way, in reviewing that mad football,scramble of last year, it is<br />\nwell to be reminded that the two squads were not as far apart as the score<br />\nindicates. Swarthmore's forty points were run up in a moment of our weakness— so to speak; and during the second pair, in which our heroes managed<br />\nto find themselves, Swarthmore not only returned nineteen of her points, but<br />\ndeposited at least twe or three gallons of cold sweat as well.<br />\nThe next few years will see whether there will be a shift in our traditional attachments. It is the opinion of the writer that more is to be gotten<br />\nout of our coanections with Haverford and Swarthmore, than with the other<br />\nteams with which sye carry out our athletic skirmishes.<br />\n<br />\nplay host to his relatives and friends at will.<br />\nUnder the new plan—never before attempted by a modern-day university<br />\n—Johns Hopkins will never pay nor accept guarantees, will finance its own<br />\ntrips away and expect visiting teams to do the same.<br />\n<br />\nDIVISION A<br />\nWon Lost Tied What A Situation!<br />\n0<br />\n0<br />\n2<br />\nPhi Alpha<br />\nThe fate of the Spearfish Normal football team, from Spearfish, S.D.;'<br />\n0<br />\n0<br />\nSigma Phi Epsilon 2<br />\nhung on a pair of football pants, two weeks ago.<br />\n0<br />\n1<br />\nDelta Phi<br />\nThe team had come to-A-berdeen to play the Northern. State Teachers<br />\n0- College. The Spearfish team had an \"All-American\" tackle, according to its<br />\n1<br />\n:1<br />\nBeta Theta Pi<br />\n0<br />\n1<br />\n1<br />\nDelta Upsilon<br />\ncoach, but he couldn't play because they couldn't find a pair of pants to fit<br />\n0<br />\n2<br />\n1Kappa Sigma<br />\nhis 260 pounds of brawn and muscle.<br />\n0<br />\n2<br />\n1<br />\nAlpha Delta Phi<br />\n. \"I've wired every sporting goods company and if a pair arrives in time<br />\n0<br />\n3<br />\nAlpha Tau Omega 0<br />\nfor the game so I can use him, we'll have a good chance to win,\" said the<br />\nDIVISION B<br />\ncoach.<br />\nWon Lost<br />\nTriple-Tongued Football<br />\n0<br />\n1<br />\nPi Lambda Phi<br />\nSuccess story of the week is that of Bandmaster Hor,ace Heidt now<br />\n0<br />\n1<br />\nAlpha Chi Rho<br />\nat the Biltmore . . carried off a West\" Coast gridiron with a broken back<br />\n0<br />\n1<br />\nPhi Kappa Psi<br />\nin the early twenties. The former University of California gridster and box1<br />\n0<br />\nAlpha Epsilon Pi<br />\ning champion has surmounted several other physical handicaps to establish<br />\n1<br />\n0<br />\nKappa Alpha<br />\nhimself as one of the most popular entertaining bandleaders in the country.<br />\n1<br />\n0<br />\nTau Alpha Omega<br />\n<br />\nThere has been a great deal said<br />\nabout the glory that is, and was<br />\nthe Hopkins, along athletic lines, I<br />\nmean. Once again J. H. U. is in the<br />\nlimelight because of her new \"free<br />\ngate\" policy.<br />\nIt seems to me—and I hope you<br />\ndon't mind—that the Hopkins Board<br />\nof Control in this matter, knows how<br />\nto take advantage of opportunities.<br />\nYears ago, when we had a good<br />\nteam<br />\n<br />\nin comparison to the other<br />\nschools, there was no talk of \"free<br />\ngate.\" Now the other schools have<br />\n<br />\nforged<br />\n<br />\nahead<br />\nathleticly, leaving<br />\nJ. H. U. to muddle about for some six<br />\nor seven years until an idea strikes.<br />\n<br />\nAnd what an idea!! One that upholds all that is fair and square to<br />\nthe college man--Intramurals for all<br />\nand all varsity games for nothing!<br />\nNot a joker in the deck!<br />\nLiberal collegiate papers in other<br />\nschools, sports editors east and west,<br />\nand expectant observers laud the<br />\nHopkins—It's a New Deal in Sports!<br />\nThe point is, suppose tke....licopirrns<br />\nhad had a team or a number of<br />\nteams. comparing in size, strength,<br />\nand record, with teams such as Pitt,<br />\nL.S.U., etc. What with the financial<br />\nslump the schoo,1 was in I wonder<br />\nif a \"free gate\" would have been<br />\nproposed then? I wonder??<br />\n—Analyzer<br />\n<br />\nDear-Mr:<br />\n<br />\n-.4 Editor:<br />\n<br />\nIn view of the, interest which the<br />\n<br />\nSPORTS CALENDAR<br />\n—<br />\nIntercollegiateSOCCER—October 30<br />\nHopkins vs, University of<br />\nMaryland, at College Park<br />\nCROSS COUNTRY—October 30<br />\nHopkins vs. Swarthmore, at<br />\nHopkins<br />\nFRATERNITY SCHEDULE<br />\nTuesday—November 2<br />\nPhi Sigma Delta vs. Kappa<br />\nAlpha<br />\n.<br />\nPhi Gamma Delta vs. Alpha<br />\nChi Rho<br />\nWednesday—November 3<br />\nAlpha Tau Omega vs, Sigma<br />\nPhi Epsilon<br />\nDelta Phi vs. Kappa Sigma<br />\nPhi Alpha vs. Alpha Delta Phi<br />\nDelta Epsilon vs. Beta Theta<br />\nPi<br />\nINTERCLASS SCHEDULE<br />\nToday<br />\nCardiacs vs. TO-State<br />\n,Engineers A vs. Engineers B<br />\nBlue Bears vs Pick Ups<br />\nFrosh AB vs Library<br />\nTuesday, November 2<br />\nSeven Jays vs. Nightraiders<br />\nSenior Mechs vs Jay Frosh<br />\n<br />\nNEws-Lerrea of last week claims is<br />\ndisplayed<br />\n<br />\nby the student body in<br />\n<br />\nbadminton, a team should be organized.<br />\n<br />\nsee no reason, since last year<br />\n<br />\nsixty in>„.aerITON41 in the badminton ladder, why badminton should<br />\nnot be made a minor sport.<br />\nA badminton squad should be selected from the first four in each of<br />\nthe smaller ladders in each of which<br />\nthere are fifteen 'Competitors. This<br />\nsquad should elect a captain, a manager, and '.select a coach. Again a<br />\ntournament should be run off, this<br />\ntime among members of the squad,<br />\nin order to select a team. After the<br />\nteam is organized this year, the selection of new members should rest<br />\nWith the poach, as it does in every<br />\nother varsity team.<br />\n'<br />\n'There are a great many college<br />\n'badminton teams in the country,<br />\nmost of them superior to whatever<br />\nteam we could produce this year;<br />\nbut there are years ahead. What if<br />\nwe are defeated for awhile? We have<br />\ngood material—let's make a start.<br />\n—The Bird<br />\n<br />\n\fHOMEVAOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br />\n<br />\nHOPKINS'Y'FORUM1<br />\nFOR FRESHMEN'<br />\nTO STARTINOV..)<br />\n<br />\nSecond Lecture<br />\n<br />\nCAMPUS CAVORTINGS.<br />\nNew York City ( ACP) —A de- I just lost a 113-year old boy who was<br />\npartment in manners—the first in a doing his own plowing every day.\"<br />\npublicly supported unpersity — has<br />\nIf you want to live to be 100, here's<br />\nbeen created at Huntrer College. It<br />\nthe prescription:<br />\n,<br />\nwill be known as \"the ABC of Liv1. Eat three light meals a day and<br />\ning, or Conversation in the Amenities,<br />\nonly alkaline foods.<br />\nBehavior and Customs.\"<br />\n2. Have a job you like.<br />\nMn<br />\nKatherine Bleecker Meigs,<br />\n3. Have lots of friends and read the<br />\nwho heads the course, has prepared<br />\nnewspapers for current affairs.<br />\na set of commandments for the busi4. Stop grumbling and don't talk<br />\nness woman. They are:<br />\nabout old age or pains. Don't<br />\nOne—Thou<br />\nshalt not ever use<br />\npreach against the younger genscented powder as a substitute for<br />\neration. Get out with the young<br />\nsoap and water.<br />\n---- people Dance a jig.<br />\n5. Don't sleep mare than six hours<br />\nTwo—Thou shalt not wear flashy<br />\na day. Have so many interests<br />\nclothes, or screaming colors.<br />\nthat you need the extra time to<br />\nThree—Thou shalt not put on<br />\n• pursue them.<br />\nmake-up like Theda Sara, nor per-<br />\n<br />\nWOLMAN TO SPEAK<br />\nAT FIRST FORUM<br />\nFour Freshman Meetings To<br />\nBe Held In<br />\nNovember<br />\n<br />\nman Again\", six prominent Hopkins<br />\nalumni will inaugurate the series of<br />\nFreitunen Forums on Tuesday, Noveiriber 2. Those Forums will be held<br />\nIn the Sherwood Room of Levering<br />\nHall every Tuesday night through<br />\nNovember. All freshmen will receive<br />\ninvitations to attend.<br />\nLaurie Dickson, chairman Of the<br />\nFreshman Committee, has announced<br />\nthat the speakers at the first Forum<br />\nwill include Guy Hollyday, '16, who<br />\nplayed lacrosse for three years, was<br />\nbusiness manager of the News-LETTER, and was president of his class<br />\nin 1912; and Robert Merrick, '17, who<br />\nis now president of the Equitable<br />\nTrust. Another speaker on the panel<br />\nwill be Stuart Smith, '30, Baltimore<br />\nlawyer; E. Guy Stapleton,'17, the As-<br />\n<br />\nhis 80's who runs a goat farm, and<br />\n<br />\nBiz Babes Get Laws<br />\n<br />\nAlumni<br />\nOf<br />\nProminent<br />\nUniversity To Talk At<br />\nPanel Discussions<br />\n<br />\na<br />\nAs speakers in a panel discussion<br />\non the topic of \"If I were a Fresh-<br />\n<br />\nDR. LOUIS FINKELSTEIN<br />\n<br />\nDr. Finkelstein has delivered the second of his interesting lectures on \"The History<br />\nof Judaism.' His third and<br />\nconcluding lecture will be delivered this coming Monday,<br />\nNovember 1.<br />\n<br />\nNEW DEAL SATIRE<br />\nHIT AT FORD'S<br />\n_<br />\n<br />\nfume thyself so strong that strong<br />\n'<br />\n;<br />\n/Ifoo Like A Cow\"<br />\nmen reel when you pass.<br />\nStudents at Columbia University<br />\nFour --Thou must not talk too<br />\nwho take the psychology tests find<br />\nfreely—keep gossip for thy private<br />\nit pays to talk back.<br />\nlife.•<br />\nIf they're asked to \"moo like a<br />\nFive--Thou muSt keep thy love life<br />\ncow\", they're given a high rating if<br />\noutside the office.<br />\nthey nonchalantly moo, toss back<br />\nSix---Thou must not leap like a fire some flippant comment. Getting<br />\nemhorse. at the alarm when five o'clock barrased gives them a pcior<br />\nmark.<br />\ncomes.<br />\nAnd an occasional \"what-Ur-hell\"<br />\nSeven—Thou must speak clearly during the examination rated better<br />\nand directly—accurately.<br />\nthan \"Yes, sir.\"<br />\nThe idea is to measure self-conEight --Thou must not be emofidence, aggressiveness and domitional or oversensitive or get thy<br />\nnance.<br />\nfeelings, hurt. .<br />\nNine—Thou must do thy work thoroughly. Fear not to say, \"I don't<br />\n<br />\nGeorge M. Cohan's Burlesque Of Roosevelt Playing<br />\nTo Capacity Audiences<br />\n<br />\nknow.\"<br />\nTen -Thou' must not think men in<br />\nthe office are making -passes ,,when<br />\nthey are only being civil; do not<br />\nBy WILLIAM L. SNYDR<br />\nIt is no wonder that \"I'd Rather Be make passes thyself.<br />\nMrs. Meigs believes manners are<br />\nRight,\" the latest opus of George S.<br />\ntaught, not inherited.<br />\nKaufman and Moss Hart, is playing<br />\n<br />\nsistant Superintendent of Schools for<br />\nBaltimore County; Dr. Alan Woods, to capacity audiences at Ford's theaprofessor at the Hopkins Medical ter this week.<br />\n<br />\n97 Year Old Kids<br />\n<br />\nOklah,oma City, Okla. (ACP)..-_.<br />\nSchool; and Abel Wolman,'13, who is<br />\nFirstly, the play has received one There are 950 students at the School<br />\non the National Resources Committee of the greatest publicity build-ups in of Maturates in yOklahoma City, a<br />\nschool which trains boys and girls<br />\nand is professor of Sanitary Engin- recent years, and secondly, this deover 70 years of age to live on past<br />\neering ere Dickson stated, \"Their lightful lampoon of the present ad- their<br />\ninsurance ,maturity dates.<br />\ntopic, 'If I were a Freshman ministration can stand on its own<br />\n\"Our most important course is how<br />\nAgain', Ethould be of interest to every merits as was evidenced by the way to eat,\" said Dr. W. A. McKeever,<br />\nfreshman because it-ean give valuable in which it was received by the audi- head of the school. \"Every one of<br />\nthe students must major in diet.<br />\nsuggestions for getting the most out ence.<br />\nYou'd be surprised how they perk<br />\nof his first year.\"<br />\nGeorge M. Cohan, rarely a song and<br />\nup when you get all the acidity out<br />\nThe Y.M.C.A. has also announced dance man, proves his versatality by of them.<br />\n\"Then we teach our boys and girls<br />\nplans for future Forums during Nov- giving an hilarious burlesque of Presiember. All of these Forums will be dent Roosevelt. He has the chief to find something to occupy their<br />\nminds. They can select anything they<br />\nfree, and open to all freshmen. Every executive eat ice cream in Central<br />\nwant under this heading.<br />\nTuesday night in November there will Park, sing about balancing the bud\"I have a boy of 97 who swings 10<br />\nbe a Forum except November 9, on get, and dictatorially say to the attor- pound dumbbells ten minutes a day<br />\nney general, \"Cummings, take a and takes a three<br />\nwhich night Rabbi Rosenzweig will<br />\nmile walk. I have<br />\nlaw.\"<br />\na girl past 80 who sings and another<br />\nspeak at the Supper Club. The second<br />\nBut Mr. Cohhan is not the only at- in the 90's who<br />\nis a good artist.<br />\nForum will feature Dr. Alan Gutt- trlbute of \"I'd Rather Be Right.\"<br />\n\"Then there's another student in<br />\nmacher whom upper-classmen will There is a group of talented dancers<br />\nremember as the man who gave sev- led by Georgie Tapps who contribute<br />\neral sex lectures at Hopkins last year. greatly to the enjoyment of the show.<br />\nMasters of tap, soft shoe, and ballet<br />\nAs his topic for the Forum Dr. Guttdancing, they breezily put pep into<br />\nmacher has chosen \"Men and Women the performance whenever it<br />\nthreatin a Changing World.\" For the third ens to let down.<br />\nCommendable performances are<br />\nmeeting Miss Irene Davis, the Hopkins Registrar, will speak on \"Hop! Hodges and Austin Marshall, and<br />\nkins and Baltimore\". For the fourth<br />\nTaylor Holmes as the Secretary of<br />\nForum Dr., Shaffer, Director of Ath- the Treasury.<br />\nletics, will speak on the development<br />\nRichard Rodgers and Lorenz Hart<br />\nof personality. The purpose of the picked up where they left off when<br />\nForums will be to help the freshman they left Broadway for Hollywood<br />\nwith an excellent new musical score.<br />\nto adapt himself to and familiarize<br />\nThere are quite a few novelty numhimself with Hopkins life.<br />\nbers;the best of which are \"I'd Rather<br />\nBe Right,\" and \"Qff The Record,\" The<br />\none ballad in the show, \"Have You<br />\nMet Miss Jones,\" in the reviewer's<br />\nopinion, will be among the nation's<br />\n!, top<br />\nfavorites within a short while.<br />\nThe play does, however, have one<br />\nrather obvious shortcoming, and that<br />\n( Continued from Page 1, Col. 5)<br />\nis the dialogue: It is, we must con- 6<br />\n\"Education today is ruining a lot<br />\nfess, very trite in spots. Although<br />\nof awfully good truck drivers. Every several<br />\nscenes are really very funnny,<br />\nbody wants to sell insurance. . . As others get laughs not because of the<br />\na result we have built up a tremendous author's cleverness,<br />\nbut<br />\nbecause<br />\nfamiliar political personages are readcollection of middlemen.\"<br />\ning the lines.. In this particular asPollack then described the \"madpect, the play does not come up to<br />\nness\" of 1929, when my barber was \"Of Thee I Sing\" or \"Let 'Em Eat<br />\nmore interested in Baldwin Loco- Cake.\"<br />\nNevertheless, the assets of the promotive than in barbering, and my<br />\nduction fat_<br />\nits liabilities,<br />\ngardener in General Electric' than in<br />\nand \"I'd Rather Be Right\" should go<br />\ngardening.\"<br />\non to be one of the best successes of<br />\nThe trouble with us then, and to- the current season.<br />\n•<br />\nday, was not soil erosion but soul<br />\n<br />\nCHANNING POLLACK<br />\nDEPLORES \"DECAY<br />\n<br />\nPollack closed with the exhortation,<br />\n\"Wake Up America.\" He quoted<br />\nfrom Lincoln's Gettysburg Address.<br />\nHazleton Spencer, associate professor of English at the Hopkins, introduced the speaker as \"a playwright<br />\nto say.\"<br />\nThe speaker previously addressed a<br />\nMeeting of the University Supper<br />\nClub,<br />\n<br />\n111131r.<br />\nTONIGHT AT THE PLAYSHOP<br />\n<br />\n(;et In On It While The Gettin\"s<br />\nGood, Fella !!!<br />\n<br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF,<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever<br />\n<br />\nmay _thus be given.<br />\n<br />\nson, Reardon Fusselbaugh, and PhilLouis Streb will play<br />\nthe role of George Dandin.<br />\nlip Poulster,<br />\n<br />\nIn connection with a study of Molime, of which the play will be a part,<br />\nProfessor H. Carrington Lancaster,<br />\n,<br />\nhead of the Hopkins French Department, will deliver a lecture on the<br />\nFrench dramatist on November 16.<br />\nThe 1937-38 schedule of the Play.<br />\nshop contains. many modern as well<br />\nas classical plays.<br />\n<br />\npr. Fagin will<br />\ndirect all' the productions. During<br />\nthe week beginning February 22, a<br />\n<br />\nHOPKINS<br />\nMEN<br />\n<br />\nLearn the where, how,<br />\nand why of shopping!<br />\nPATRONIZE OUR<br />\nADVERTISERS<br />\n—<br />\n<br />\nYou Get the Best Raw Bar Oysters<br />\n<br />\nat<br />\n<br />\nHARRY L. HASSLINGER CO.,<br />\nniNtm; ROOM AND BAR<br />\nNORTH AVE. & ST. PAUL STREET<br />\n<br />\n—KIBLER'S<br />\nJewelers and Opticians<br />\nParker Pens and Pencils<br />\n<br />\nLock Repairing Shop<br />\nHardware—Paints<br />\nKeys Mode W hile Y,, Waste<br />\nPhone UNniyersity 0202<br />\n<br />\n3002 Greenmount Ave.<br />\n<br />\nJewelry and Watches<br />\nEyes Examined<br />\nLens Repaired<br />\n<br />\nis what you get in a suit, topcoat or overcoat at Jos. Schloss<br />\n& Son. ,,„Schloss creations give<br />\n,,;:<br />\nyou ev.0,<br />\nlearned<br />\nto expect 7Fam clothing—plus<br />\nthat extra style and distinction that assures you an exclusive air.<br />\n<br />\nReady-to-Wear Suits, Top.<br />\ncoats, Overcoats<br />\n<br />\n$435<br />\n<br />\nTO $470<br />\n<br />\nThis Ad Entitles You<br />\n<br />\nTo 5% Discount Card<br />\n<br />\nST. PAUL AT 33RD STREET<br />\n<br />\nOn All<br />\nLiquors, Wines, and Beers<br />\n<br />\nPreocriptions—School Supplies<br />\nSandwiches<br />\n<br />\nPhone University 4251<br />\nFor Prompt Service<br />\n<br />\nUnexcelled Fountain Service<br />\n•<br />\n<br />\nde<br />\n<br />\nby<br />\nan<br />\nbe<br />\n<br />\nInc<br />\n<br />\nPh<br />\n<br />\nse/<br />\n<br />\nma<br />\n<br />\nyer<br />\n<br />\nthe<br />\n<br />\nma<br />\n<br />\nWa<br />\n<br />\nwh,<br />\n<br />\nJ<br />\n<br />\nstri<br />\n<br />\nvict<br />\nbe<br />\n<br />\nhe 1<br />\n<br />\nal<br />\n<br />\nmar<br />\nber<br />\nthe<br />\n<br />\nmar<br />\nelm<br />\nHat<br />\nSr<br />\ncros<br />\nPhi<br />\n<br />\nlit<br />\nwon<br />\nship<br />\n<br />\nC<br />\n<br />\nHop<br />\ning<br />\nNI<br />\nMlle,<br />\nnest<br />\noffici<br />\npres.<br />\nnour<br />\nduct<br />\n<br />\nOR<br />\n<br />\nCHAS. MALL<br />\n<br />\nThat Extra<br />\nSomething<br />\n<br />\nPHARMACY<br />\n<br />\nfor three years' service-in their<br />\nactivity. Credit for Varsity Seals<br />\n<br />\nIncluded in the cast are Louis Streb,<br />\nDolly Ashley, Elsie Kane, Mary Albey, Theodore George, Joseph Addi-<br />\n<br />\nROETH<br />\nJeweler<br />\n<br />\n3120 Greenmount Ave.<br />\nWatch Repairing<br />\n<br />\nNORTH INN<br />\n<br />\n, All hreads of activities are reErlanger, head of the SAC., the<br />\nnames of all men having credit<br />\n<br />\nIndividual 'Brush and Comb For<br />\nEvery Customer<br />\n<br />\n3222 Greenmount Ave.<br />\n<br />\n11111 E LEV'S<br />\n<br />\nWilliam<br />\n<br />\nDORMITORY DANCE<br />\nFOR NOVEMBER j8<br />\n<br />\nHours: 8 a. m. to 7:30 p. m. Sat.<br />\n8'a. m. to 9:30 p. m. Manicuring<br />\n<br />\n3204 Greenmount Ave.<br />\nBaltimore, Maryland<br />\n<br />\nto<br />\n<br />\nLOUIS SVVYER<br />\n<br />\nSpeaking of the rally planned .for tonight, President<br />\nSwyer said \"An interesting<br />\nprogram has been arranged<br />\nand we expect a large and enthusiastic crowd.\"<br />\n<br />\nS. W..Con. St. Paul and 33rd Sts,<br />\n1st Floor, next to Drug Store<br />\n<br />\nBoulevard Liquor Co.<br />\n<br />\nin<br />\n<br />\nHopkins Playshop this year. Dr. N.<br />\nBryllion Fagin, director of the group,<br />\nhas announced that the play will come<br />\nduring the week of November 23.<br />\n<br />\nTHEODORE'S<br />\nBARBER SHOP<br />\n<br />\nStCO X'XilL<br />\n<br />\na<br />\n<br />\nGeorge Dandirit, by the seventeenth<br />\ncentury dramatist Moliere, will be<br />\nthe first presentation of the Johns<br />\n<br />\nReserving November 13 as the open\"The educational spoon in Amerplay by the Swedish author and draica is handled by Competent and un- ing date for their social affairs, the<br />\nmatist, Strindberg, will be given..<br />\nderstaiding teachers, but the stu- Alumni Memorial<br />\nHall dorm.tory so- Bgienning<br />\nApril 19, 'and for the Week<br />\ndents should do the feeding themcial committee will lead o with a following, The Dance<br />\nof Death will be<br />\nselves.\" Dr. Alexis Carrel, ranking<br />\nnew<br />\ninnovation,<br />\npresented.'<br />\nwhich<br />\nplans<br />\nThis play will be sponto be perscientist, is interviewed by the Dartsored<br />\nby<br />\nWe<br />\nMaryland<br />\nmanent.<br />\nConference of<br />\nThe<br />\noccasion<br />\nwill be the Anmouth student newspaper,<br />\nOrganization.<br />\nLectures<br />\n\"It may seem strange, but all great nual Frosh Turkey Trot and will take Dramatic<br />\nmen striped off their pedestals as place hi the Commons Room of the on noteworthy dramatists and the<br />\nproduction<br />\nof<br />\none-act plays will comsoon as they began to beat a path dormitory.<br />\nto the bathtub.\" Dr. -Sanders, a pro- _ .The committee led-by Arthur Katz, plete the Playshop's schedule.<br />\nAll members of the Hopkins Playfessor in education at De Paul Uni- '40 and assisted by Zoel R.adner, '39,<br />\nversity, saw this lecture remark Carl Speck,- '41, Norman Silverstein, shop group are either students or<br />\n'40, Laurie Dickson, '40, Carl Rasin, alumni of thk university. Six faculpicked up by a campus -columnist.<br />\nAn English professor in the Massa- '38, and Lyman Mauk„40, has an- ty members' make up the Board of<br />\nchusetts Institute of Technology is nounced that the gratifying pledges Governors. Dr. John C. French, Hopby the residents point to a successful kins librarian, is chairman of the<br />\n\"taking it all back.\"<br />\nboard. Other members are Dr. Kemp<br />\nIn 1929 he told the Institute's grad- affair.<br />\nuating class to \"Be a snob; marry<br />\nAlthough the conunitte has as yet Malone, Dr. Ernest Feise, Dr. Hazleton<br />\nSpencer, Dr. Florence Bambernot named an orchestra, appropriate<br />\nthe boss's daughter.\"<br />\nberger, and Dr. H. Carrington Lan\"Now,\" he declares, \"I've decided music for the occasion is promised.<br />\nthe advice didn't work out as well<br />\nThe affair will bear a tariff of caster.<br />\nThis<br />\n$2.10 drag and $1.50 stag. Starting Death will be presented.<br />\nas I expected.<br />\n\"By marrying the boss's daughter, at nine in the evening the baton will play will be sponsored by the Marythe young men took the chance of close the session at one the following land Conference of Dramatic Organiacquiring the boss's liabilities along mornrng. Tickets will not be solicited zation. Lectures on noteworthy draoutside of the dormitory. The com- matists and the production of onewith his assets.\"<br />\nBesides, it seems that the young mittee, however, extends its welcome act plays will complete the Playshop's schedule..<br />\nmen so advised were asked by the to all former residents.<br />\nfair—and wealthy—objects of their<br />\nGet<br />\nTo<br />\nKnow<br />\nUs<br />\naffections if the offers of marriage<br />\nYOUR CREDIT IS GOOD!<br />\nwere inspired- by lor or their professor's advice.<br />\nEXPERT HAIRCUTTING, 40c<br />\n<br />\nVARSITY SEALS<br />\n<br />\nquested to turn<br />\n<br />\nPLAYSHOP CAST<br />\nOF MOLIERE WORK<br />\nCHOSEN BY FAWN<br />\nGorge Dandin To Be Presented During Week<br />\nOf Npvmber 23<br />\n<br />\nQuotable Quotes<br />\n<br />\nATTEND<br />\nTHE<br />\n<br />\nerosion.\"<br />\n<br />\n'Stormer Head<br />\n<br />\nJos. Schloss<br />\n& Son<br />\n<br />\n5 East Lexington St.<br />\n<br />\nBoulevard Hardware Co.<br />\nHOUSE FURNISHEINGS<br />\nELECTRICAL SUPPLIES<br />\n<br />\n430 E. Thirty Second St.<br />\nUn. 0749<br />\n<br />\nONLY DOWN TOWN STAGE SHOW<br />\n<br />\n-FaROME-NOW<br />\n<br />\nDi<br />\ncyclo<br />\nat tt<br />\n4 p.<br />\nLaw.<br />\nthe 1<br />\ntopic<br />\n/aria;<br />\nDr.<br />\ntron,<br />\nhas 1<br />\nexper<br />\nnude<br />\nrecen<br />\nhas<br />\nFol<br />\nbe 11,<br />\nrence<br />\nhis la<br />\nbody<br />\nthe I<br />\n<br />\nfjIST<br />\n<br />\nHeld Over! 2nd Big Week!!<br />\nRead These Raves!!<br />\n\"One of the Best Photoplays of the<br />\nYear.\"<br />\n—Donald Kirkley, Mom. Sun.<br />\nRtbbon with Pahns. Outstanding<br />\nComedy Drama.\"<br />\n—Gilbert Kanour, Eve. Sun.<br />\n\"One of the Year's Screen Topnochers.\"<br />\n—Norman Clark, News, Post.<br />\n<br />\nSTAGE DOOR<br />\nSTARRING<br />\n<br />\nKatharine HEPBLTRN<br />\nGinger ROGERS<br />\nAdolphe MENJOU<br />\nPI US<br />\n<br />\nAn All Ne%Nktage Sho.<br />\n<br />\nThe<br />\na w<<br />\nmone:<br />\ntest a<br />\ntorica<br />\ntwo I<br />\nas th<br />\nAdam<br />\nIn ad<br />\ndollar<br />\nwill b<br />\nbest<br />\nwith'i<br />\nmast.<br />\n<br />\n\f", "format": "basic_html", "processed": "Nriurt-iErttrr<br /><br />\nJUNIORS!<br />\nVOTE TODAY<br /><br />\nFRATS AND SENIORS!<br />\nYour Picture Now<br /><br />\nZ 275<br />\nVOL. XLII, No. 6<br /><br />\naPRICE 5 CENTS<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br /><br />\nJay' Makes Appearance,<br />\n'STORMER RALLY 'Blue<br />\nInterest Of Article<br />\nFESTIVITIES AT Varying<br />\nPLAYSIOP, 7:30<br /><br />\nHOPKINS AND O'KEEFE]<br />\nVIE FOR PRESIDENCY,<br />\nEditors Make Attempt To Fashion Literary Magazine Wit4 IN JUNIOR ELECTION'<br />\nPoetry, Reviews Of Books, Fiction, And Music<br />\nNotes Of Popular Appeal<br /><br />\nl'NEWS-LETTER'<br />\nINITIATES VOTE<br />\nNEXT TUESDAY<br /><br />\nPlan Put To Test<br /><br />\nWard And Lill Only Candidates Nominated For<br />\nVice-Presidency<br /><br />\nStudent Body To Voice<br />\nOpinion Of New<br />\nAthletic Plan<br /><br />\nBy DANIEL COHEN<br />\nRwytr Expects Large EnthuThe first issue of the IS137-38 Blue Jay has appeared. Under the<br />\nsiastic Crowd; Interesting editorship of Victor M. Victoroff, '40 the revived humor magazine was<br />\nProgram Arranged<br />\npresented yesterday to the, waiting students of the Johns Hopkins Uni- Of Fourteen Candidates Four<br />\nversity. Running the gamut from satire to hobbies, the Blue Jay can<br />\nMen Lose Out In<br />\nhardly fail to please those for whom it was intended.<br />\nFIVE PRODUCTIONS<br />\nThe aim of the Blue Jay says EdiVoting<br />\ndespondent soul is revealed to the<br />\nBEING CONSIDERED tor Victoroff in this first issue is \"to<br /><br />\nYear Marks Seventeenth Anniversary Of Dramatic<br />\nOrganization<br />\nThe Barnstormer Club will hold its<br />\nannual fall rally tonight at 7.30 p.m.<br />\nat the Homewood Playshop. \"An interesting program as been arranged<br />\nand we expect a large and enthusiastic crowd,\" said Louis Swyer, president of the organization.<br /><br />\nreader in a story by Victoroff which<br />\nserve you more effectively and in- is entitled \"Defy the Gods!\" It is an<br />\ntrestingly than ever before.\" That is attempt to paint a true picture of a<br />\nundoubtedly the purpose of Jacob's young man who has been deserted by<br />\n\"Small—Bore his inconstant love.<br />\nHandelsman's<br />\nC.<br />\nShooting,\" or \"For All Nimrods.\" It<br />\nThe _Poetry in the first issue must<br />\ntreats of guns and how to shoot them be rated inferior. Sholem Waif*<br />\nand is the first of a series ofarticles makes a try at free verse in his poem<br />\n\"Stop\" but falls short of creating<br />\nfor the amateur marksman.<br />\npoetry. \"Saps\" by Merlin Lass is a<br />\nVariety Of Subjects<br />\nThe reader of the first issue is vain attempt to ape successfully Joyconfronted with musical columns, an Ice Kilmer's beautiful poem, \"Trees\".<br />\nexcellent book column department, The policy of including poetry, howan ironic piece of supposed irony, and ever, is a step in the right direction.<br />\nThe Blue Jay on the whole represome poorly written poetry. Without<br />\ndoubt, though, he should find some- I sents a real attempt, and by its conthing to his- liking, read it, and then tinued efforts to give Hopkins a real<br />\nmagazine is should gain quickly the<br />\ntell his best friend about it.<br />\nThe biting irony of the tale of a sincere support of the student body.<br /><br />\nCONSENSUS OF<br />\nOPINION DESIRED<br /><br />\nThe Junior Class primary election<br /><br />\nFinkel Makes Plea For Support Of Ballot By<br />\nStudents<br /><br />\nyesterday resulted in the naming of<br />\nHarry Hopkins and Arthur O'Keefe<br />\nas the presidential nominees who will<br />\nbattle it out in the finals today. There<br /><br />\nThe NEws-Lerrot will ask the<br />\nopinion of the student body on the<br />\nnew athletic policy when it hold its<br /><br />\nwas no contest for the office of vice1)11. WILSON G. SHAPTER<br /><br />\npresident, Robert S. Ward and John<br />\nR. Lill being the only two candidates \"<br />\nnominated.<br />\nFor the post of treasurer, the Jun-<br /><br />\nCHANNING POLLACK<br />\nFORESEES CRASH<br /><br />\nfirst poll of the year next Tuesday.<br />\nBecause the first real test of the pol-<br /><br />\nicy has already taken place it is felt<br />\niors nominated for the finals J. Henry l<br />\nthat the reaction of the student to<br />\nBlucher and Irving Milberg. Albert t<br />\nThe nature of the rally will be twothe plan will he worthwhile and to<br />\nHecht was the other candidate. Of<br />\nfold. It will introduce the Club to<br />\nAddresses<br />\nAudience<br />\nOf<br />\n500<br />\nthre Candidates for the office of secthe best interests of the University.<br />\nthe student body and will be the first<br />\nUnder Sponsorship Of<br />\nretary Norman C. Melvin and James<br />\nofficial call for candidates to the<br />\nThe ballot will be distributed with<br />\nT.<br />\nHarrington<br />\nwere<br />\nnominated;<br />\nZoel<br />\nthree Barnstormer staffs: acting,<br />\nY.M.C.A.<br />\nthe NEWS-LETTER when it is disRadner was the loser. Millard Kaufproduction and business. There is<br />\nAn audience of 500 people in the tributed on Tuesday. The idea of free<br />\nman and Jack Wetzler were successplenty of room in all three departful in the race for sergeant-at-arms, University Baptist Church last Tues- admission to athletic contests in a<br />\nments of the club for interested newCharles<br />\nMoxley being the defeated day night heard Charming Pollack highly controversial<br />\ncomers.<br />\none, and it has<br />\ncandidate<br />\nwarn that \"America, with ice ahead, been given wide<br />\nThe program that has been arpublicity by various<br />\nCandidates<br />\nVersatile<br />\nIs<br />\ndancing,<br />\nsinging<br />\nand<br />\nskit,<br />\nplaying 'handranged includes a three-act<br />\nHopkins was, in his freshman year, Jere.\" Pollack spoke tinder the au- joKralistic organs of the country and<br />\n-The Fatal Quest,\" parts in which<br />\nof coltects<br />\n,..,<br />\n, ,Asnong these may be<br />\nvice-president of his class. He is a spices of the University Y.M.C.A.<br />\nwill be taken by members of the<br />\nEducaLinks<br />\nNoted Rabbi,Speakes On Secmember of the musical club and last<br />\nThe speaker opened his address by cited the Associated Press and the<br />\nClub. Louis SwSTer will outline the<br />\ntion And Decline of Crime, year was chairman of the combined comparing the state of<br />\nond Series Of \"The<br />\nAmerica with Daily Maroon of the University of<br />\nhistory and aims of the organization<br />\nsophomore and freshman dance and that of the \"supposedly unsinkable\" Chicago. It is 'therefore evident that<br />\nViolations<br />\nand Paul Itlinrichs, this years direcHistory Of Judaism<br />\nbanquet committee. O'Keefe, the S.S. Titanic<br />\n'which crashed into an the issue is a highly important one to<br />\ntor, will tell about the plans for the<br />\nWilliam P. Lawson, Police Com- second<br />\nthe students of Johns Hopkins Unicandidate, is a former member iceberg in the year 1912.<br />\nfirst play of the year. The name of<br />\nDr. Louis Finkelstein, prominent missioner of Baltimore, who will<br />\nof<br />\nthe<br />\nwrestling<br />\nteam.<br />\n\"The<br />\ncountry is singing The Music versity.<br />\nthis year's production has been withscholar and rabbi, delivered the sec- speak at the student assembly at the<br />\nWard, has, been for the last two, Goes 'Round and 'Round right up to<br />\nFinkel Urges Voting<br />\nheld up to the present, but will be<br />\nond in his series of three lectures on Hopkins on next Thursday, Novem- years president of his class. He is Nearer My God to Thee.<br />\nannounced tonight. Plays under conStanley M. Finkel, '38, editor-inber<br />\n4,<br />\nhas<br />\nchosen<br />\nas<br />\nhis<br />\ntopic<br />\nfor<br />\nthat<br />\nalso on the football squad. Lill is in<br />\nHe then cited instances of what he chief of the NEWS<br />\nsideration were \"The Tavern,\" \"Three \"The History of Judaism\", Monday, assembly \"The<br />\n-LETTER, urges<br />\nNecessity of Educa- the engineering school.<br />\ncalled \"moral decay\", about which I everyone to participate<br />\nMen On A Horse,\" Whistling in the October 24, at Latrobe Hall at 8.30 tion In The<br />\nin the voting.<br />\nP vention of Traffic<br />\nMilberg<br />\nis<br />\na<br />\nmember<br />\nof<br />\nthe<br />\nhandnobody<br />\ngives<br />\na<br />\nhang.\"<br />\nOxamples were He said:<br />\nDark,\" \"Seven Keys to Baldpate,\" p.m.. The third and last of Dr. Fink- Accidents And<br />\nme\". The Commis- ball team.<br />\nBlucher was treasurer of the expenditures of the 'Roosevelt adand \"What Price Glory.\"<br />\n\"I hope that the poll will have your<br />\nelstein's lectures will be presented sioner will discuss the education of<br />\nhis Class last year, is a niember of ministration, the recent' activities at<br />\nThis year marks the seventeenth<br />\nsupport. It is to the 'rawest of the<br />\nnext Monday evening at Latrobe Hall policemen Vis well as of those who are the Y.M.C.A. cabinet, is on the swim- the committee<br />\nfor Industrial Organi- Hopkins students to vote on the new<br />\nanniversary of the Barnstormers and<br />\nnot<br />\nengaged<br />\nin<br />\nany police work.<br />\nming team, and assistant manager of zation including the general motors<br />\nplans are being made to produce two at 8.15 p. in.<br />\nathletic policy which was inaugurated<br />\nContrary to a previous announcethe musical club. Melvin is a former strike and the alleged dynamiting of two<br />\nDr. Finkelstein has traced to date<br />\nmajor plays and several smaller proweeks ago at the football game<br />\nment, attendance at the assembly will'<br />\nmember of the student council and the Bethlehem Steel plant in Johns- between<br />\nductions. If this plan is carried out, from \"the group of nomads who wor- not be compulsory<br />\nHopkins and Washington<br />\nfor either Fresha, member Of the basketball and la- town, Pa.<br />\nit will mean more activity in under- shipped at Mt. Sinai, thirty or forty men or Sophomores.<br />\nCollege.<br />\nOur aim is to find out how<br />\nWilliam B.<br />\ncrosse<br />\nsquads.<br />\nHarrington<br />\nwas<br />\ntreas\"Every<br />\ndemocracy<br />\nin history has the students of the University feel<br />\ngraduate dramatics than has ever<br />\ncenturies ago,\" to the Pharasees or Kempton, '38, president of the Stu- urer of his Class in his Sophomore ended<br />\nup in the hands of a Caligula, about the matter.\"<br />\nbeen seen at the University before.<br />\ndent Council, in announcing a conyear and is a former member of the a Mussolini, a Hitler, or a Franco.<br />\nThe fall production will be a mod- temple group,\" the first group in tinued policy<br />\nThe NEWS-LETTER polls of last year<br />\nof non-compulsion in<br />\nstudent council. Kaufman is one of It is softening of the spine which has were successful,<br />\nern comedy and present plans call for history to hold a scientific approach connection with<br />\nthe student body restudent assemblies,<br />\nI:he<br />\nreferees<br />\nof<br />\nthe<br />\nlead<br />\ninterfraterruty<br />\nthe<br />\ncollapse.\"<br />\neither a revival of a classic or a mu- to the truth.\" He quoted Dr. Allbright<br />\nsponding very well to the call to take<br />\nstated, \"Student attendance at the<br />\nfootball league. Wetzler is 'a memPollack announced himself as pre- part in the voting on the<br />\nsicale in the spring. The idea has of the Hopkins occasionally, naming first assembly<br />\ncandidates<br />\nof the year, which was<br />\nber of the lacrosse team and was sec- ferring democracy to the \"iron In the election<br />\nbeen broached to combine the iMuof 1936 and the issue<br />\nhim \"one of -the foremost authorities entirely voluntary, and which was retary of<br />\nhis class last year.<br />\nswastika\" or the \"hammer and of the Supreme Court. The<br />\nsical Club and the Barru3tormers in<br />\npolls, a.s<br />\nlarge, shows that there is no present<br />\non Semities in the world.\"<br />\nsickle.\" Under the present system, he compared to what actually<br />\nan effort to put on a production of<br />\nhappened,<br />\nneed for making students attend the<br />\nFinkelstein,<br />\nDr.<br />\nLouis<br />\nat<br />\npresent<br />\nsaid,<br />\nthe<br />\nstandard<br />\nof<br />\nof<br />\nliving of the proved to be very accurate. Roosethe latter type, and it is possible that<br />\nTUDOR AND STUART<br />\nProfessor of Theology and Provost at assemblies.\"<br />\npeople had reached the greatest velt received a majority<br />\nthis will be done.<br />\nfrom the<br />\nBy securing as 'speakers such inthe Jewish Theological' Seminary, is<br />\nTonight at 7:30 thirty members of height in world history. He defend- student body and the<br />\nIn addition to President Swyer, the<br />\nchange in the<br />\nteresting public figures as Commisthe Tudor and Stuart Club will hold ed the so-called \"economic royalist\" Supreme Court was<br />\nofficers of the club are William L. the first of the lecturers to appear sioner Lawson,<br />\nvoted<br />\ndown.<br />\nWilliam Kempton<br />\na smoker in their rooms in Gilman as one without whom suoh a thing<br />\nSnyder, secretary-treasurer, Frank under the joint sponsorship of the hopes to remove<br />\nall need for compulHall, the features of which are to be would not have been possible.<br />\nCrist, business manager, and Daniel University and the Baltimore Round sion in<br />\nthe future attendance at stuTable of the National Conference of<br />\n\"The<br />\nTudor and Stuart Boys<br />\nPollack also blamed much the presGidinsky, production manager.<br />\nJews and Christians. The latter is a dent assemblies. Mr. Lawson was se- Abroad\" Paul Berge and Jack Cham- ent state of the nation<br />\nupon the polilected<br />\nto speak because of his posia national organization for encouragbliss, who plan to regale the clubmen tician, \"the lowest form of insect<br />\ning good will and propagating more tion as a Republican leader, and be- with anecdote and pictures of the life.\"<br />\nMen To Be Taken In During<br />\naccurate knowledge about various re- cause of the attention he has attract- Vaterland and the Tyrol.<br />\nNext<br />\nAmerican education was also deemSix<br />\ned as Police Commissioner. In his<br />\nligious groups.<br />\nAlso on the program of speakers ed responsible for the situation. \"We<br />\nWeeks<br />\nS. P. E. 's Have First Crack<br />\nwork as head of the Baltimore Police<br />\nLectures Follow<br />\nare Dr. Raymond Dexter Harens, are turning out an amazing number<br />\nAt Freshmen, Ten Next<br />\nA series of fifteen lectures on sub- Force, he has instituted many re- Caroline Donavan, professor of Eng- of boys and girls who by<br />\nAt its regular weekly meeting on<br />\nnot stretch<br />\nWeek<br />\njects pertaining to Catholicism and forms in traffic regulations and po- lish Literature, who returned recently of the imagination can<br />\nbe called edu- Monday, October 25, Company I, Seclice equipment. Although present<br />\nscheduled<br />\nto<br />\nProtestantism<br />\nis<br />\nfollow<br />\niron' a six month's travel in Europe cated.\" He cited examples of \"apall- ond Regiment at Hopkins announced<br />\nTomorrow Sigma Phi Epsilon and<br />\nplans as to details of his speech are i<br />\nand the Near East, working on a ing\" ignorance on the part of appli- the names of the cadet officers who<br />\ntheir freshmen rushees will celebrate Dr. Finkelstein. These lectures will<br />\nonly tentative, Commissioner Lawwill be, taken into the .Military- Honstuy of Wordswith during most of cants for various positions.<br />\nthe beginning of the fraternity Open be presented by Dr. William H. Russon<br />\nwill<br />\nprobably<br />\ntell<br />\nsomething<br />\norary Fraternity within the next six<br />\nthe time.<br />\nHouse season at the Hopkins. No sel of the Catholic University, who<br />\n( Continued on -Page 4, Col. 1)<br />\nabout the Work of educating members<br />\nwill<br />\noutlook;<br />\nCatholic<br />\ndeal<br />\nwith<br />\nthe<br />\n.<br />\nweeks. .Scabbard and Blade pledgees<br />\none shares the day with the S. P. Es<br />\nof the police force in the new work<br />\ninclude the following: M. J. Hartke,<br />\nbut next week ten other affiliates of and Professor Cyril C. Richardson<br />\nwhich has resulted from the many<br />\nsecond in command- of- \"A\" Company;<br />\nthe Interfraternity Board divide five of Union Theological Seminary, who<br />\nchanges.<br />\nwill discuss Protestantism.<br />\nStanley R. Kramer, Captain of \"C\"<br />\ndays of open house.<br />\nArthur Garfield Hayes, who will<br />\nThe Johns Hopkins University is<br />\nCompany; John D. Carper, first LieutSaturday, November 6, is catchspeak at the assembly on November<br />\nthe<br />\ncofirst<br />\nits<br />\ninstitution<br />\ntype<br />\nto<br />\nof<br />\nenant of \"A\" Company; Hugh H.<br />\nas-catch can as far as the Modern<br />\n11, was also chosen as a speaker beJohnston, first Leiutenant of \"C\"<br />\nGreeks are concerned, though it has operate with the Conference in precause of the attention he has recentMembers<br />\nThirty<br />\nOf<br />\nFaculty<br />\nAttend<br />\nDinner<br />\nIn<br />\nCompany; Charles It. Foard, first<br />\nbeen customary for freshmen to senting a series of lectures, and the<br />\nOf<br />\nHonor<br />\nly<br />\nattracted<br />\nby<br />\nhis<br />\nBaltimore<br />\nAdverLeiutenant of \"C\" Company; B. L<br />\nvisit lodges of their choice on this Conference aims to bring the out<br />\nThirty-Five Years' Service Of Library In<br />\ntising Club address and by the reHarris, Captain of \"C\" Company.<br />\nday. At 3 p. m, the following after- standing scholars in each of the recall of an invitation for him to speak<br />\nCharge<br />\nOf<br />\nMain<br />\nligious<br />\nlecReading<br />\nHopkins'<br />\nRoom<br />\nthe<br />\ngroups<br />\nto<br />\nCharles<br />\nC. Councilman, Captain of<br />\nnoon bids will be presented by the fraat the Constitution Day exercises at<br />\nture platforms.<br />\n\"B\"<br />\nCompany; and C. J. Merril, first<br />\nternities.<br />\nThirty-five years of faithful service frcac condimc n I,, rubmcundo perat<br />\nBaltimore<br />\nstadium.<br />\nMr.<br />\nHayes<br />\nis<br />\nThe lectures ale open to students,<br />\nLieutenant of \"B\" ompany.<br />\nMonday next Alpha Tau Omega and<br />\na national officer of Pi Lambda Phi Tuesday night at the Johns Hop- fusac. This, however, was only a<br />\nDelta Upsilon will entertain \"desir- faculty, and the general public. They<br />\nThe present officers of the society<br />\nFraternity, which has a chapter on kins University. Miss Frieda Thies small part of the fancy dishes that<br />\nconsecutive<br />\nare<br />\nto<br />\non<br />\nbe<br />\ndeliverad<br />\nable\" first.yz•ar men; Tuesday, Phi<br />\nIn recognition of this service was -were served; the rest came soon aft- are: Major C. T. Mewshaw, Captain;<br />\nthe Hopkins campus.<br />\nGamma Delta and Kappa Sigma are Mondays throughout the series.<br />\nLieutenant W. G. Keir, first Lieutentendered a dinner fit for a Roman em- er.<br />\nhosts; Wednesday, Phi Kappa Psi and<br />\nHULLABALOO PHOTOS peror by grateful professors of GI- Then there was luscious melagris ant; Captain J. Alexander, second<br />\nBeta Theta Pi share the spotlight;<br />\nman Hall. The scene of the festivi- gallopav, which precided some fine Lieutenant, and Lieutenant W. H. C.<br />\nThursday belongs to Alpha Delta Phi Science Club To Hear<br />\nThe Hullabaloo photographer arrived ties was the Faculty Club where *3a saliva. And what meal is com- Ruggelburg, find Sergeant. Other<br />\nand Alpha Chi Rho, and the last<br />\nDr. Tracy Sonneborn yesterday, and is taking picture of about 30 of Hoplcins's premier pro- plete without something with Which members are R. B. Stagmler, W. B.<br />\ncrack on Friday, if any of the feted<br />\nall fraternity men and non-fraternity fessors gathered to pay homeage to to top it all off? So, the assembled Kempton, W. Griffin, and J. Hranicka.<br />\nones can resist alumni and pep talks<br />\nseniors. Be will photograph all a loyal servant.<br />\ndiners were served either lactua or<br />\nThe society was founded here at<br />\nDr. Tracy M. Sonneborn, assothrough today and Monday, at rewill be administered by Delta Phi and<br />\nUpholding the Hopkins academic roffea arahica elixa.<br />\nHopkins in 1920. Its purpose is to imciate in Zoology at the Hopkins<br />\nAlpha.<br />\nduced rates. Photographs taken at a tradition and world-renowned thirst<br />\nKappa<br />\nThe names of these foods were list- prove the R. 0. T. O. on the campus<br />\nwill speak at the first open meetAccording to John J. Ghinger, '38,<br />\nlater date will be taken with new for learning, the dinner was provided ed in the menu for the dinner. They and to equip the unit with more effiing of the Johns Hopkins Science<br />\nInterfraternity Board Head, who<br />\nrates effective.<br />\nwith<br />\na<br />\nInstead<br />\nnovel<br />\nfeature.<br />\nof<br />\nbewere<br />\nprinted in Latin in the bill of cient and better trained officers. Off<br />\nClub today at 7.15 p.m., in RemTheodore Schad, managing editor ing offered the ordinary victuals of fare which had the format of a Uni- the campus its purpose is to keep<br />\nmailed party bids to freshmen on<br />\nsen 301.<br />\nof the Hullabaloo, has expressed his the routine American cuisine, the versity Circular. Perhaps it has been alive the ideals set forth in<br />\nWednesday, a \"strictly enforced sothe naDr. Sonneborn's subject will be<br />\nregret that the same unfortunate diners were treatetd to some deli- found that Latin is more easily di- tional Constitution and to enlighten<br />\n-lent period,\" will exist between 1 a. m.<br />\nSex in Paremeciiiin, dealing with<br />\nsituation, wherein fraternity pledgese cious selinon with some equally as gestible for university professors than the public with intelligent informaand 3 p. m. Sunday. Violations durDr. Sonneborn's recent discovery<br />\ncannot take advantage of the reduced delectable olivaeinuriaticae, which Is the En4lish of our contemporary tion concerning the militaryrequireing those hours are counted as being<br />\nof sex in these protozoa.<br />\nof a grave character.<br />\nrates, has arisen as it did last year.<br />\nwas followed by some exqusite os- lAmerica.<br />\nments of our country.<br /><br />\nDR. L. FINKELSTEIN LAWSON TO NOTE<br />\nDELIVERS 2ND TALK EDUCATION WEEK<br /><br />\n-••<br /><br />\nScabbard And Blade<br />\nTo Induct Members<br /><br />\nOpen House Season<br />\nBegun By Fraternities<br /><br />\nMiss Frieda Thies Honored For<br />\nLong-Time Service In Library<br /><br />\n411.<br /><br />\n-<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br />\n2<br />\nSpain Hitler and Mussolini are every day adding a bit<br />\nmore property to their personal holdings. And, in the<br />\nEast, Japan is advancing to miltary glory over an ,opposition bereft of all save courage.<br />\nPerhaps public opinion is indifferent to these outrages.<br />\nThere is comparatively little articulate expression<br />\nagainst them. But in the streets countless individuals<br />\nare expressing their now-Isolated protest.<br />\nHope for our salvaton rests with this now-divided<br />\nmajority. The real ask for the future is• not so much<br />\n82.00<br />\nto make speeches about returning to the pre-war era as<br />\nSubscription per year<br />\n42.00<br />\nit is to organize a progressive American people to light<br />\nBy Mail ....<br />\nthe impending doom.<br />\nRemit subscription fres to Treasurer, Student Activities Council,<br />\nAnd when this is done, it will be found that \"almost<br />\nUniversity.<br />\nRemsen Hall, Postoffiec, John Hopkins<br />\n-- everybody gives a hang.\"<br />\npostoffice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\nmatter<br />\nclass<br />\nEntered as second<br />\nin Baltimore Md., under the Act of Congress. November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins<br /><br />\nVie 3obn5 j)ophins<br /><br />\nletter<br /><br />\nNew Blue Jay<br /><br />\nEDITORIAL STAFF<br />\n• Editor-in-Chief<br />\nStanley -Finkel<br />\nManaging Editors<br />\nJ. Murray Kempton, Wethered Bae,oII, Jr.<br />\nAssociate Editor<br />\nBenjamin Root<br />\nManaging Editors<br />\nAssistant<br />\nVictoroff<br />\nM.<br />\nVictor<br />\nJ. C. Handelsman,<br />\n• Sports Editor<br />\nHarold Zheutlin<br />\nFeature Editor<br />\nSeymour Sacks....<br />\nExchange Editor<br />\nMal Boshnack, '39<br />\nREPORTERS<br />\nMel Taymor, '40; Morris Wessel, .'39; Charles Diggs, '40<br />\n-Leonard Unitt, '40; Daniel Stone, '39; Zeana Baum. '38;<br />\nCarl Resin, '38; .1.ester Rosenthal, '38; Lcimard<br />\ngee. '38<br />\nBUSINESS STAFF<br />\nBusiness Manager<br />\nMeli1le Locker<br />\nFounded 1897<br /><br />\npotpourri<br />\nBy BUDDY MACHT<br /><br />\nFamous Phonies<br />\nLooking up a phone number the<br />\nother day, We, as usual, got mixed up<br />\nand landed in the sh's instead of the<br /><br />\nFOR MODERN GREEKS<br />\nand dr-biking clups, everybody had a<br />\nFor the benefit of you rushmen<br />\nfor- good time.<br />\nhave<br />\nmay<br />\nwho<br />\nfreshmen,<br />\nyou<br />\nAt least six of the Kappa Sigs will<br />\ngotten that next week is the begin'be in an embarrassing position, if<br />\nopen<br />\nthe<br />\nprint<br />\nwe<br />\nend,<br />\nning of the<br />\nthey happen to violate interfraternity<br />\nhouse schedule released recently by<br />\nrushing rules. Those six are members<br />\nthe inter-fraternity bored.<br />\nof the Student Council. Or didn't you<br />\nMonday:<br />\nknow?<br />\nAlpha Tau Omega, Delta Upsilon<br /><br />\ns.'s. We were about to turn the page<br />\nwhen our eye was caught by a famil- Tuesday: , Kappa Sigma, Phi Gamma Delta<br />\niar name. We looked again and it<br /><br />\nwas still there, George Bernard Shaw Wednesday:<br />\nPhi Kappa Psi, Beta Theta Pi<br />\n—TU-1565-W. We had • heard of<br />\nThursday:<br />\nthings like this but they had always<br />\nRho, Alpha Delta Phi<br />\nAlpha<br />\nsounded fishy to us, so we did a little<br />\nFriday:<br />\nexploring. The results were illumDelta Phi, Kappa Alpha<br />\ninating to say the least.<br />\nYellen Alpha Delta Phi's Barron<br />\nIt seems that Baltimore possesses<br />\nand company attempted to stria a<br />\nquite a few celebrities—by proxy.<br />\nrushee's house the other night, they<br />\nWe found a Shakespeare, a couple<br />\nfound a corps of Phi Psis dominating<br />\nof Hamlets and Macbeths, quite a<br />\nthings in the kid's room. When the<br />\nfew Dickenses and .Wordsworths,<br />\nA.D.'s left they found their jalopie<br />\nnot<br />\nbut<br />\nByrons,<br />\nand<br />\nloalliaCei--taelleys<br />\nsoaped to the gills. Wedgy ain't the<br />\nthat<br />\na single Keats. The only thing<br />\none to talk, but he suspects foul play.<br /><br />\nChi<br /><br />\nHO'<br />\nAN.'<br />\nCL<br /><br />\nA current dispatch tiy the ACP<br />\nfrom Columbus reports that cooperative purchase of supplies by fraternities and sororities at the Ohio<br />\nState University saved them 16% on<br />\n$90,000 worth of provisions during<br />\nthe last year. Forty-six of the 58<br />\nfraternities now have \"A\" credit ratings. When the auditing division was<br />\nestablished on its.present basis four<br />\nyears ago, fraternities 'owed creditors approximately $65,000. This has<br />\nnow been reduced to $15,000. We<br />\ndon't have any statistics on the credit<br />\nrating- of lippkiae. fraternities, but<br />\n'certainly they don't have any trouble<br />\nreducing debts below $15,000 without<br />\nthe need of cooperative purchases.<br /><br />\nBlue<br /><br />\nThe first of the revived Blue Jay issues has made its<br />\ndebut to the campus. Banned officially now for over<br />\nthree years, this literary magazine has had a varied<br />\n.career<br />\nmost very dull.<br />\nThis year, it appears that the Blue Jay is fluttering its<br />\nweakened wings and promises to fly to the heights of<br />\nyesteryear. The campus, like us, is just looking over<br />\nthe new issue and starting an &amp;valuation.<br />\nWhether the University has the place for a literary<br />\nmagazine of the Blue Jay's type will be partially<br />\npuzzles us is the fact that there are Wonder who?<br />\nanswered by the success of this year's issues.<br />\nseventy Edwards and 'only fifty-one<br />\n'—<br />\nMonroe Sarezky claims, although<br />\nThe Phi Sigs pray the night before<br />\nSimpsons. If you don't believe us,<br />\nnobody asked him, that he prefers each of their football games. Their<br />\ncount 'em yourself.<br />\ncourse<br />\nI9311<br />\nOf<br />\n1937<br />\nMember<br />\nGoucher gels to local color.<br />\nprayers must have been heard, since<br />\nJust for fun we called up Joe Monroe is now wallowing in one of all of their games for the past three<br />\nShakespeare. Joe wasn't home, but them thar eternal triangles. Monroe weeks, have been cancelled due to<br />\nDisiribuox of<br />\n.<br />\nWe are pleased at the initial response to our call for his wife was. She told us that Shake- loves her; she loves Monroe; and rain. By the way, why does Brother<br />\nletters. Each of the writers will find that his words are speare was down at the barber shop Monroe has been alienating his own Handelsman cherish a shotgun that<br />\naffections for years.<br />\nhe keeps stored at the Phi Sig house?<br />\nprinted on the same page as our opinions.<br />\nplaying pinochle. We said, thanks,<br />\nPerhaps is to, make sure that his fuTo the others who are hesitant we urge you to put<br />\nwe'd call again. And we will, too.<br />\naaaaaaaaa row NAlsoN•L ASSRIWIIIINCI ST<br />\npracinvited<br />\nhave<br />\nPhi's<br />\nDelta<br />\nThe<br />\nture heirs enjoy the advantages of a<br />\nyour thoughts in writing. You will soon discover how<br />\ntically the whole freshman class, en quiet home life, which he doesn't<br />\nyour opinions bear up under public scrutiny. You will<br />\nCOIft Publishers' Representative<br />\nmasse, to their open house next Fri- have. At any rate the boys are prefind the outlet for influencing others with your comNEW YORK, N. Y.<br />\n420 MADISON Ave.<br />\nday night. In case any one wes over- paring for their first fall formal on<br />\n•<br />\nERIcsso %Boss. - Los Most\", • SSA EMIICISCO<br />\nments or at least pointing out your side of an issue.<br />\nstar spangled banner, 0 looked, 'twas due to negligence — November 6th. Dorm boys please<br />\nThat<br />\nRemember, if you do not want your name printed,<br />\nmerely indicate this desire, and we will honor your long may it wave . .. Last Saturday pure negligence. See Bill McFeeley note.<br />\nthat,<br />\nrequest.<br />\nthe football team of the University for a personal invite. It is said<br />\nthis widespread rushing is taking' With new raised gold backed glass<br />\n• Now that the ice is broken, we expect a steady sire<br />\nMaryland played that of the Unione lettering adorning the front door,<br />\nleast<br />\nat<br />\nthat<br />\nhope<br />\nthe<br />\nin<br />\nplace<br />\nof \"Letters to the Editor.\"<br />\nversity ef Syracuse. One of the stars man will be snagged who has a<br />\nand a real housemother gracing the<br />\nboy,<br />\nHindu<br />\na<br />\nis<br />\nof the Syracuse team<br />\nchalice of graduating some day.<br />\nkitchen, the Beta boys feel slick. The<br />\nFRIDAY, OCPOBER 29, 1937<br />\nHudat-Singh, but for some reason or<br />\nfact that Jimmy Coady has a new<br />\nformal<br />\nits<br />\nheld<br />\nDelta<br />\nBeta<br />\nPhi<br />\nFord and Bill Staub has a new Ponother when the game started, he was<br />\n'dance at Levering Hall last Saturday tiac doesn't make the Betas weep<br />\non the bench. He stayed there all<br />\nnight. Jewett Goldsmith, the eminent either. Must have struck a gold mine<br />\nafternoon.- The local newspapers lover and whispering baritone, lived<br />\nin the cellar.<br />\nThroughout the country comments are being made on<br />\nof<br />\nout<br />\nkept<br />\nbeen<br />\nhad<br />\nhe<br />\nthat<br />\nstated<br />\nelecup to his reputation. Myra Bender,<br />\nclass<br />\nin<br />\nballoting<br />\n--There is no pretense at secret<br />\nour athletic program. The Daily Princetonian reflects<br />\nof<br />\nconsent\"<br />\nmutual<br />\ncampus<br />\n\"by<br />\nredemoiselle,<br />\npopular<br />\nwas<br />\ngame<br />\nthe<br />\nMerel Hormel, head of the local<br />\ntions here, because you must sign your ballot, thereby for the most part the attitude of the outsiders. This<br />\nin a red satin gown and Phi Hp house, has a brother who<br />\nsplendent<br />\nsure<br />\nquite<br />\nweren't<br />\nWe<br />\nteams.<br />\nboth<br />\nallowing members of the Student Council to know how newspaper states:<br />\nattracted all the wolves at the affair hopes to be head of the Pi Lam house<br />\n\"Johns Hopkins University. always a pioneer and a just what \"mutual consent\" meant,<br />\nyou voted.<br />\n—including Bert,,Hecht (the rat). at Michigan. The same frat wasn't<br />\nleader, paves the way for complete abolition of athletics as we decided to find out.<br />\nIn spite of having to pay for paper big enough to hold them both.<br />\nIt la silly to say they are disinterested, because fra—the inter-collegiate species—with the elimination of<br />\nWe did.<br />\nternity brothers of some of them are candidates for the paying customers from its football program.<br />\noffice.<br />\n\"The boy did not play,\" they told<br />\n\"Last week the Daily Princetonian advocated the<br />\n• However, it seems bad taste for candidates to hover complete elimination of admission charges to football us, \"because we weren't sure whether<br />\naround the box in the manner some, one, a former games, charging that 'some of the boys can't afford to he was a Hindu or a negro, and,<br />\nbuy tickets.'<br />\nWe Present Unc's Brother, priation, as do all other campus activcouncilman, did at times yesterday, and look over stusince we were in doubt about the Herewith<br />\n\". . . .Princeton could make the change to the free<br />\nAs Both Writer And<br />\nities.<br />\nfrom the<br />\ndents' shoulders or at their ballots while they were votgate and de-emphasize her intercollegiate athletics too, matter, he was withdrawn<br />\nWrites<br />\nAs to the question raised about<br />\ning. Even the ethical conscience of some would fore- and it wouuldn't hurt her enrollment. . . . So could the game. .The University of Maryland<br />\nTo the Editor of The NEWS-LETTER:<br />\norchestras, it is impossible to subUniversity of Chicago, whose student Daily Maroon is wile not play against a team with a<br />\nstall such action.<br />\nDear Sir:<br />\nmit bands to the students for their<br />\nWhy have the ballots signed, anyway? A member campaigning for the university's withdrawal from the negro on it.\"<br />\nYou asked for letters to the NewsBig Ten and the reduction of student athletics to an<br />\napproval. We always get in touch<br />\nof the council is constantly on duty at the box to hand<br />\nWe felt like yelling, fighting. Who LEirrea—well print this—<br />\nbasis.... With the present day trend towards<br />\nintramural<br />\nwith the five largest musical bookout ballots and check men off as they cast their votes.<br />\nUniversity of Maryland<br />\nTo Judge Mehling and members of<br />\niprofessiorializing college football in order to produce in hell is the<br />\ning agencies. in the country—RockIn this way no one can vote twice, and precautions as winning teams and pull the alma mater out of the finan- to decide whether or not a person the Cotilion Board—<br />\nwell-O'Keefe, Music Corporation of<br />\nto voter eligibility are presumably taken care of in cial dumps, such,moves are gratifying to one who still is inferior because he's not white, but<br />\nWhy is it the students of Hopkins<br /><br />\nDR1S<br />\nMeet<br /><br />\nAfte<br />\nweeks,<br />\nsend h<br />\nThe m<br />\nHome<br /><br />\nGood Response<br /><br />\n!Associated Collet5iate Press<br /><br />\nOn .<br /><br />\nColletSiate Di6est<br /><br />\nweaker<br />\nyear t.<br />\nfair su<br />\n..classm:<br /><br />\nNationalAthertisingService,Inc.<br /><br />\nhopes<br /><br />\nColor Scheme<br />\n...<br /><br />\n1937<br /><br />\nMEMBER<br /><br />\nson. ,<br />\n. Carl,<br />\nlast y.<br /><br />\n1.939<br /><br />\nport<br />\nJay<br />\nThe<br /><br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br /><br />\nJunior Primaries<br /><br />\nSholtefresh<br />\nis expe<br /><br />\nJohns Hopkins, Pioneer<br /><br />\nLETTERS TO THE EDITOR<br /><br />\nblack, yellow or brown. We felt like never have a voice In the selection of America, Associated Artists, Mills<br />\nArtists, and Consolidated Artists,<br />\nyelling, but we didn't. We walked bands for our dances? After all don't<br />\nand choose the best band available<br />\nout slowly: We felt very tired.<br />\nyou depend on them to support your of those submitted. It so happens<br />\nthat<br />\nsure the majority of the Thanksgiving Cotillion<br />\n. . . O'er the land of the free and cotillions. I am<br />\nhas bethe students are not in favor of col- come a tradition at the Hopkins.<br />\n.<br />\n.<br />\n.<br />\nbrave.<br />\n'the<br />\nthe home of<br />\nored bands playing for us, when Naturally, it is harder to get bands<br />\nthere are so many good white bands for this date than for later in the<br />\navailable. I know you do not like to winter, because it is the beginning of<br />\nrepeat the same orchestras over and the business hotel season of the year<br />\nHeard in the lobby on the opening over again. Tommy Dorsey and Hal<br />\nin most large cities. Now, the booknight 'of the George M. Cohan play: Kemp in mind; but what is wrong ing agencies will not<br />\nsign a contract<br />\n\"You've got to take what he tells with such bands as Glen Gray, Will for a big band anymore<br />\nthan four or<br />\nWe must admit that on analysis 'most of what Mr.<br />\nyou with a dose 'of salts\" . . . Bert Osborne, Jan Savitt, Mal Hallett, five, possible six, weeks<br />\nprior to the<br />\nlecture<br />\nuniversity<br />\nhis<br />\nin<br />\nperpetrated<br />\nPollack<br />\nChanning<br />\nMargolis, one of the swellest mugs Bunny Berigan, Horace Heidt, and engagement. When the<br />\ntime is ripe,<br />\nlast Tuesday night seems pretty definitely hogwash.<br />\nthe campus, is leaving school be- Hudson Delange. I could name many one just'grabs the best thing<br />\non<br />\nthat<br />\nIn what ..we believe to be a fine gesture of sympaBut there was one statement of his with which we are in<br />\ncause of a death in his family. The more you could select from.<br />\ncomes along, and that's that. These<br />\nthetic understanding, the Johns Hopkins Club of New<br />\nbest of everything, Bert, we hate<br />\nreceived a 'so-called 'Popularity Contests\" for<br />\ncomplete agreement.<br />\nhave<br />\nyou<br />\nafter<br />\nthink<br />\nI<br />\nE.<br />\nChanning<br />\nMrs.<br />\n'to<br />\nletter<br />\nfollowing<br />\nthe<br />\nsent<br />\nhas<br />\nYork<br />\ngo... . The building which list of the bands available from the orchestras are simply<br />\nThe speaker had been outlining a series of incidents, iSweitzer, widow of the late, honored Johns Hopkins to see you<br />\nadvertising<br />\nis now used by the Hopkins playA. , you should present them schemes, and mean nothing when it<br />\nwhich, in his mind, showed the moral'decay of our alumnus:<br />\nwas once an R.O.T.C. store- to the student body and select the one conies to getting a band.<br />\nshop<br />\nAt a meeting of the Board of Directors of the Johns<br />\ncivilization: • ,And, at the conclusion of each, he would<br />\nroom and the gym for a private that is most favored by them. Do aThe Cotillion Board has signed<br />\nHopkins Club held last night, the following resolutions<br />\nenunciate sadly; \"And nobody gives a hang.\"<br />\nschool '. . . Maybe our fillip to the way with this one man selection, Claude Hopkins for the<br />\nfirst Cotillion<br />\nwere adopted:<br />\ndid some good. Maybe meaning you, Judge. After all, we because he is the<br />\nBarnstormers<br />\nThat, at least, is perfectly true. What Mr. Pollack<br />\nbest band available<br />\n\"Whereas, CHANNING E. SWEITZER, the founder<br />\nSwyer, are the ones who must support those<br />\nLew<br />\nrate,<br />\nany<br />\nat<br />\nbut<br />\ndidn't,<br />\nit<br />\ndays,<br />\nthese<br />\nfix<br />\nbad<br />\npretty<br />\na<br />\nin<br />\nis<br />\ncivilization\"<br />\n\"white<br />\ncalls<br />\nfor that date. Hal Kemp, Glen Gray,<br />\nand guiding spirit of the Johns Hopkins Club, died on<br />\n'Stormer president, announced three social affairs, and I am sure there Bunny Berigan, Will Osborne, Hudand most people-are pretty bored about it all. ,<br />\nOctober 5, 1937; and<br />\ndays later that !here will definitely were better' bands available than son DeLange, Tommy Dorsey, and<br />\n1937<br />\n27,<br />\nOctober<br />\nof<br />\nresult<br />\nthe<br />\nbe<br />\nNow, this indifference may very well<br />\nbe two plays thiseYear. Ho hum. .. Claude Hopkins.<br />\nbrother Jimmy, Duke Ellington, HorSweitzer:<br />\none too many mid-term Republican conventions or My dear Mrs.<br />\nHere's hoping we get a choice in ace Heidt, and others, are not availWhereas, the members of the Johns Hopkins Club<br />\neven one too many of Mr. Pollack's efforts in the AmenFebruary.<br />\ndue to previous engagements.<br />\nable<br />\nmatter—come<br />\nthe<br />\nwill deeply feel the loss of his untiring efforts, his many<br />\n'can Mercury. But we don't think so.<br />\nsacrifices, and hs fine sense of loyalty to Johns Hopkins<br />\nB. H., Student For that matter, there are many,<br />\ndon't<br />\nnovels,<br />\nIf you enjoy historical<br />\nunlike 'B. H.\" who consider the band<br />\nThe truth is, of course, that we've all been sitting on University,<br />\nfail to read Heinrich Mann's Henry<br />\ngood as<br />\nNow, therefore, be it<br />\nTo the Editor of The NEWS-Lerree: of Claude Hopkins to be<br />\na powder keg too long. There is hardly a college stuof the<br />\none<br />\nUndoubtedly<br />\nNavarre.<br />\nof<br />\nany<br />\nin the country today.<br />\nResolved. That the Johns Hopkins Club has sustained<br />\nDear Sir:<br />\ndent today whose articulations have not been spent in.a<br />\nbooks of its type to appear in<br />\nbest<br />\nof<br />\ndeath<br />\nthe<br />\nits<br />\nby<br />\nloss<br />\nirreparable<br />\nand<br />\nfriend<br />\nIn closing. I should like to say only<br />\nan<br />\nIn reply to the letter from \"B. H.\",<br />\nperiod through which the threat of war was imminent.<br />\nmakes fascinating<br />\nfounder, Channing E. Sweitzer, whose lovable personal- recent years it<br />\nthat there is no \"one man selection\" in<br />\na copy of which you were considerate<br />\nAs a result a sort of purblind fatalism has come over ity and influence will be deeply missed and mourned reading.<br />\nthe<br />\nCotillion Board. There is no one<br />\nenough to send me, I submit the folmost of us. \"Hell hasn't popped yet, so why worry.\"<br />\nby all its members; and further<br />\nperson on the Board with more<br />\nIf You appreciate better music, hear lowing:<br />\nThen, again, there is a desperate kind of cynicism in<br />\nhereby<br />\ndoes<br />\nSymClub<br />\nHopkins<br />\nJohns<br />\nthe<br />\nResolved, That<br />\nHans Kindler and the National<br />\nauthority than any other, all memThe Cotillion Board does depend upour attitude towards the future. We make feeble jokes extend to the members of the immediate family of Chaq- phony Orchestra at the Lyric two<br />\nbers having one vote. If there needs<br />\non the Student Body to support its<br />\nabout spending next winter in China—\"saving the world ning E. Sweitzer its deepest sympathy and understand- weeks hence.<br />\nto be a delegation of authority for<br />\nnon-students<br />\nmany<br />\nare<br />\nThere<br />\ndances.<br />\nfar J. P. Morgan.\"<br />\ning in their recent bereavement; and further<br />\nIf you like to laugh, get a ticket who regularly attend the Cotillions, any reason, naturally such a delegaResolved, that copy of these minutes is hereby orAnd, so, \"nobody gives a hang.\" But, it isn't so<br />\nby hook or crook for You Can't Take but since the Board is primarily an tion falls upon a Senior, preferably<br />\nindividthat<br />\nChanning<br />\nMrs.<br />\nE.<br />\nis<br />\nit<br />\nas<br />\nto<br />\nindifferent,<br />\nsent<br />\nbe<br />\nSweitzer.\"<br />\nis<br />\nworld<br />\nto<br />\ndered<br />\nthe<br />\nthat<br />\nthe President, since he has had more<br />\nmuch<br />\nit TVith You, the funniest comedy activity of 'the Hopkins, we habitually<br />\nVery truly yours,<br />\nuals are too weak to take up what looks like an imexperience that the lower classmen.<br />\nwe've ever seen.<br />\nsolicit student support before going<br />\nJ. R. BARTELS,<br />\npossible task.<br />\nYour ticket, \"B. H.\", will be regeneral<br />\nThe<br />\nthe<br />\npublic.<br />\nto<br />\nfact'<br />\nthat<br />\nthings<br />\nsee<br />\nHallowto<br />\nwant<br />\nyou<br />\nIf<br />\nJOHNS<br />\nHOPKINS CLUB.<br />\nPresident, THE:<br />\nThe job, it is true, is getting harder every day. Cerserved at the door.<br />\ne'en eve start at the negro Royal we do invite the public is made necSweitzer,<br />\ntanly the vigilante movements of last summer brought Mrs. Channing E.<br />\nSincerely,<br />\nTheatre. \"You checks youah razor essary because the Board does not refascism nearer to America than it has ever before been. 227 Hamilton Road<br />\nceive one cent of money as an approJ. Judge Mehling<br />\nat the box office.\"<br />\nJersey.<br />\nAnd, abroad, the \"impending\" war is an actuality. In Ridgewood, New<br /><br />\nadvance of elections. The Council might argue that believes in the glory of the old college try. . . . Johns<br />\nparticipate in the paid-player<br />\nthey can \"double-cheek\"' voters by having his signa- Hopkins, not wishing to<br />\nphase of the game, is challengng other schools to show<br />\nture. Being politicians, members of the Council know<br />\ntheir abhorrence of the pro system, with this 'free gate'<br />\nmost of the student body, and it ix very unlikely that —and our guess is that she'll have some imitators soon.\"<br />\na man would vote another's ballot.<br />\nWe are pleased to note that our contemporaries are<br />\nIt's in refreshing<br />\ntaking this progressive attitude.<br />\ncontrast to the rah-rah attitude of the average unthinking bench-warmer.<br /><br />\nNobody Gives A Hang<br /><br />\nThings<br /><br />\n\"<br /><br />\nIncid<br />\nmile<br />\n21 min<br />\nis hel.<br />\nform '<br />\nHop<br />\nn.<br />\nseveral<br />\ntrick.<br />\nLast<br />\na 32-2<br />\nthe Bl<br />\nvenge<br />\nown<br />\nhave o<br />\nmore<br />\nharrie<br />\nBlue f<br />\na vict.<br />\nThis<br />\nHambl<br />\nof th:<br />\nlowing<br />\nJays<br />\nclelp<br />\nThen t<br />\ngage<br />\nAno<br />\nCham.<br />\nington<br /><br />\nHop<br /><br />\nA Fine Gesture<br /><br />\n24.-e.<br /><br />\nDo<br /><br />\n•<br /><br />\nTom<br />\ntravel<br />\nTerps<br />\nHop<br />\nburg .<br />\nera 1-I<br />\nmen<br />\nMaryl.<br />\n4-2 co<br />\nIn<br />\nBlue<br />\nMaryl:<br />\nkins i<br />\ndefeat.<br />\nTo<br />\nlied o<br />\nwere<br />\nUnder<br />\nfense<br />\nLyons.<br />\nJeri_<br />\nthe m.<br />\nTarag*<br />\nAt<br />\nwill fi<br />\nwill b<br />\nat the<br /><br />\nAlt<br />\ngame,<br />\nto his<br />\nand H<br />\nflank.<br />\nFoll:<br />\nsoccer<br />\nturn<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br /><br />\n3<br /><br />\nSP oRT<br />\nHOPKINS HARRIERS<br />\nAND SWARTHMORE<br />\nCLASH TOMORROW<br /><br />\nBOOTERS DEFEAT<br />\nTOWS'N TEACHERS<br />\nWITH 1-0 SCORE<br /><br />\nHarrier Hurrier<br /><br />\nSPEAKING OF ...<br />\n.... Haverford, It'll Be Traditional<br /><br />\nFENCING<br />\nSaturday, at 1..30 p.m., the fencing team will hold an organization<br />\nmeeting in the Barn. With Captain<br />\nR. Reeds<br /><br />\nback<br /><br />\nalong<br /><br />\nwith<br /><br />\nPhil<br /><br />\nSmall, Ken Silvers, and Harris, Hopkins will point to the Maryland Con-<br /><br />\nBlue Jays Out To Avenge<br />\nLast Year's 32-23<br />\nDefeat<br /><br />\nBlue Jay Soccermen Take<br />\nSecond Consecutive<br />\nVictory<br /><br />\nDRISCOLL LEADS JAYS<br /><br />\nBRIGGS MAKES J. H. U.<br />\nSINGLE TALLY<br /><br />\ndrills for<br /><br />\nTeam<br /><br />\nseveral<br /><br />\nweeks, Coach Waldo Hambleton wlll<br />\nsend his squad against Swathmore.<br /><br />\nThe Hopkins'-soccer team gained<br />\ntheir second successive victory last<br /><br />\nCOACH WALDO HAMBLETON<br /><br />\nThe met will be held tomorrow at<br />\nHomewood over the Hopkins course.<br />\nDriscoll, Pointgetter<br />\nOn the whole, Hopkins skuad is<br />\nweaker than in formes years. Last<br />\nyear the seniors experienced only a<br />\nfair success, but with seven underclassmen<br /><br />\non<br /><br />\nthe<br /><br />\nTuesday<br /><br />\nSIGMA PHI EPSILON<br />\nSCORES VICTORY<br />\nOVER KAPPA SIGMA<br /><br />\nteam, . returning<br /><br />\nhopes were high for the present season.<br />\n. Carl,Sharpf, Lyman and several of<br /><br />\nRain Causes Frostponement<br />\nOf Several Games;<br />\nTeams Strong<br /><br />\nlast year's lettermen failed to report this year hus weaking the Blue - ALPHA DELTS WIN<br />\nJay runners.<br />\nIn the games played Tuesday and<br />\nThe main hope of Harnibleton is<br />\nJohnny. Driscoll, who succeedp<br />\nWednesday, S.P.E. won its second<br />\nSholtes as captain. Driscoll as a game of the season by defeating the<br />\nfreshman performed well and much<br />\nKappa Sigs. The other game was a<br />\nis expected of him this year.<br />\nclose contest between Alpha Delta<br />\nRecord By King<br />\nIncidentally, the record for the VA and A.T.O. with tlie\"D.'s winning.<br />\nmile run over the Hopkins course is This was the first victory for Alpha<br />\n21 minutes and 58 seconds. This mark Delta and was featured by the playis held by John A. King, who pering of Billy Kempton and Page Edformed back in 1933.<br />\nmunds for the victors.<br />\nHopkins with its present squad'<br />\nWeather Delay<br />\nWill not chalk up many records, but<br />\nBecause of the bad weather of the<br />\nseveral individuals may turn this<br />\ntrick.<br />\n1 past week, four teams haven't as<br />\nSwarthmore Won<br />\nyet played. These games will be<br />\nLast year Swathmore edged out<br />\nplayed off very soon in the future.<br />\na 32-23 win over the home boys, and<br />\nthe Blue Jays will attempt to re- Reuben Baer has arranged for thre<br />\nvenge themselves. This year on their new fields about the school and all<br />\nown ground, Hopkins runners will teams are to contact earns other to<br />\nhave one point in their favor. Swarth- establish the dates of the postponed<br />\n'more is the pre-race favorite, but the<br />\ngames. The captains of each team are<br />\nharriers representing the Black and<br />\nrequested to get in touch with Mr.<br />\nBlue far from concede the visitors<br />\na victory.<br />\nThis will be the opening clash for<br />\nHambleton's thin clads as a .result<br />\nof the Lehigh postponement. Following the Swarthmore clash; the<br />\nJays meet Drexel Institute of Philadelphia on Saturday, November 6.<br />\nThen they travel to Haverford to engage the Scarlet and Black.<br />\nAnother big event will- be the D. C.<br />\nChampionships to be held in Washington near Thansiciving.<br /><br />\n•<br />\nHopkins Booters<br />\nBattle Maryland<br />\nTomorrow, the Hopkins booters<br />\ntravel to College Park to meet the<br />\nTerps in a soccer clash.<br />\nHopkins, to date, has topped Gettysburg 2-1 and Towson State Teachers 1-0. The only contest the Lyonsmen have dropped was to Western<br />\nMaryland in the season opener by a<br />\n4-2 count.<br />\nIn their only battle last year, the<br />\nBlue Jays downed the Terps, 2-1.<br />\nMaryland has been gunning for Hopkins in an attempt to revenge that<br />\ndefeat.<br />\nStrength Offense<br />\nTo date, Hopkins rivals have tallied only five goals. Four of these<br />\nwere made by Western Maryland.<br />\nMader this condition, the Hopkins offense is being stressed by Coach<br />\nLyons.<br />\nBriggs and Braysham have been<br />\nthe main offensive threats with Price,<br />\nTaragin, and Phillips helping out.<br />\nAt the goalie position, Maryland<br />\nwill find Romanofsky. The defense<br />\nwill be Captain Gough and Stout<br />\nat the fullback positions.<br />\nHartke Back<br />\nAlthough injured in the Towson<br />\ngame, Hartke is expected to return<br />\nto his center half position. Kephart<br />\nand Hooper will perform on Hartke'S<br />\nflank.<br />\nFollowing the Maryland clash, the<br />\nsoccer team meets Towson in a return match.<br /><br />\nManager Lipnick requests that all<br />\ninterested attend this meeting.<br /><br />\nINTRAMURALS FEATURE<br />\nWINS BY FAVORITES<br />\nHartke's Return To Help<br />\nStrengthen The '<br />\nIN CLOSE CONTESTS<br /><br />\nMeets Set With Drexel,<br />\nHaverford, And D. C.<br />\nChampionships<br />\nAfter staging<br /><br />\nference Trophy meet.<br /><br />\nBaer in order to secure a field.<br />\nThe present standings of the teams,<br />\nbecause of the postponments, is only<br />\na little indication of the balance of<br />\npower in the leagues. \"Boots\" Kaufman, Bert Margolts,, Johnny Sause<br />\nand other leaders of intramural teams<br />\nhave commented on the high calibre<br />\nof this year's touch football. Surprises have been forthcoming this<br />\nyear. Delta Phi, Beta Theta Pi, and<br />\nPhi Alpha are the new stroilige tearns<br />\nthis year with the old standbyes, Phi<br />\nSi, Pi Lam, D. U., and S.P.E. battling<br />\nthese newcomers for first honors.<br /><br />\nSPIKED SHOE<br /><br />\nI<br /><br />\nTowson<br /><br />\nwhen<br />\nState<br /><br />\nthey<br /><br />\ndefeated<br /><br />\nthe<br /><br />\nTeachers .1-0. The<br /><br />\nLyonsmen scored in the first period<br />\non a well placed kick by Briggs,<br />\ncenter forward, and played well to<br />\nprotect their lead for the remainder<br />\nof the contest.<br />\nRomanofsky Stars<br />\nThe contest was hard-fought with<br /><br />\nSeven Jays Show Championship Form In Downing<br />\nSenior Mechanics<br />\nBITSACK<br /><br />\nREAL<br /><br />\nSTAR<br /><br />\nClose, hard - fought touch football<br />\ngames once more were witnessed on<br />\nthe lower athletic field, south of<br />\nLevering Hall. True to fashion, the<br />\nfavorites came through again to add<br />\nanother victory that will put them<br /><br />\ncarestanding play on both sides. The<br /><br />\nin the play-offs. However, it wasn't<br />\nTeachers, last year's State Cham- until the final whistle was blown<br />\npions, were unable to find any\"openthat the winner was certain of clinching in the defense of Goalie Roman- ing the contest.<br />\nofsky, who played outstandingly for<br />\nIn the Thursday% league, two fine<br />\nthe Hopkins..The ball see-sawed back teams played a nip-and-tuck battle<br />\nand forth for the greater part of the on field 1. They were the Pick-Ups<br />\nsecond and third quarters, with he and the Cadets, with the for<br />\nfullbacks of both elevens playing mer finally leaving the gridiron with<br />\nwell. The latter part of the fray was a 12-0 decision. It was due to the<br /><br />\nDRIBBLERS HOLD I WE TWARD HO!<br />\nINITIAL PRACTICE<br />\nOF NEW SEASON<br />\nDear Mr. Sports Editor:<br /><br />\nCapt. Carl Rasin Leads Veteran And Newcomers;<br />\nZheutlin Ill<br /><br />\nDrilling under the supervision of<br />\nmarked by rough and tumble play superb all-around playing of Paster- Captain Carl Rasin, candidates for<br />\nthe<br />\nHopkins' 1937-38 basketball squad<br />\nnak, Rasin, and Patten that enabled<br />\n'for the Pick-Ups to add another victory held their initial drill.<br />\nA return contest is scheduled<br />\nAlthough only fifteen men reNovember 5, and from the looks of to their record.<br />\nported, hopes for the coming year are<br />\nLiterati Victorious<br />\nthings right now a very hard and<br />\nhigh. The quintet will be built around<br />\nexciting contest is expected. It is<br />\nThe Literati eeked out a 6-0 win Captain Rasin, star guard, Shorty<br />\nhoped that Hartke, regular center over the Tech Hawks in the only Cross and^ Melvin. Suffritutes Len<br />\nhalfback, will be back in the line-up, other game of the day. However it Rubinger, Les Rosenthal, and Jerry<br />\nCarlton also attended this session.<br />\nfully recovered from the leg injury wasn't until they overcame a bit<br />\nNew Prospects<br />\nhe sustained in the first stanza of of intensive strife and confusion that<br />\nAfter football terminates, several<br />\nthe winners managed to push over<br />\nTuesday's encounter. The return of<br />\nmore are expected to turn out. Freshtheir score in the closing minutes<br />\nmen, members of interclass squads<br />\nHartke will•'greatly ,strengthen the<br />\nof the fray. Bitsack proved to be<br />\nand<br />\ntransfer students will strengthen<br />\nBlack and Blue aggregation. If the. the winners starring light.<br />\nthe courtmen. McNally, star of<br />\naction of the. final period of TuesGood football was., again on tap<br />\nWashington's basketeers has enrolled<br />\nday's game carries any weight, his in the Friday games, when the Enat the Hopkins. It is hoped that his<br />\nwon a close contest from<br />\nreturn will be of the greatest benefit gineers A<br />\npresence will reinforce the Black and<br />\nseven. The final score<br />\nand necessity to the Hopkins' booters. the Tri State<br />\nBlue: Incidentally McNally opposed<br />\nshowing only one touchdown differMelvin in the Washington. Hopkins<br />\nThe line-up:<br />\nence. In the same league the Cardiacs<br />\nConflict last year, and gave a good<br />\nHOPKINS<br />\nTOWSON<br />\nscored an expected triump by handaccount of himself.<br />\nRomanofsky<br />\nWilde ing the Engineers B a 18-8 defeat.<br />\ng.<br />\nZheutlin Last<br />\nFrosh A.B. Lose<br />\nGough<br />\nr.f.<br />\nL. Cox<br />\nThe only replacements in Hopkins'<br />\nA 12-6 win was posted by the Liline-up Will be those of Herb Seigel<br />\nStout<br />\n1 f.<br />\nCernik brary team against the Blue Bears.<br />\nand Harold Zheutlin. Seigel was lost<br />\nB, team<br />\nHartke<br />\nWheeler Time after time the double<br />\nC. h.<br />\nthrough graduation while illness will<br />\ntithe the<br />\nthreatened<br />\nbut each<br />\nHoops<br />\n1 h.,<br />\nW. Cox \"breaks\" of the game turned against prevent Zheutlin from joining the<br />\nsquad.<br />\nKephart<br />\nBennett them. The Cement Mixers recorded<br />\nr h.<br />\nConfined to the Hopkins' hospital,<br />\na win over the Frosh A. B. in the<br />\nBriggs<br />\nC.f.<br />\n.Garamerncen<br />\nZheutlin probably will be lost for<br />\nlast game of the day.<br />\nthe<br />\nentire season. Playing varsity<br />\nStern<br />\nBrayshaw<br />\ni r.<br />\nThe Seven Jays, last year's winball for three years. Zheutlin's abLinthicum<br />\nShock ners, looked like the champions they sence will be felt.<br />\ni 1.<br />\nare, when they turned back the SenIn drills to date fundamentals have<br />\nor.<br />\nPrice<br />\nGordon<br />\nior Mechanics by a 12-0 count in a<br />\nbeen,stressed with ball...handling and<br />\nPhillips<br />\n0.1.<br />\nLoenstein Tuesday league contest.<br />\nfootwork as the essentials.<br /><br />\non the part of both teams.<br /><br />\nThere will be a meeting of the<br />\nSpiked Shoe members on Monday<br />\nevening at 6 o'clock in Levering Hall.<br />\nThe gathering will consist of a<br />\nBy The Associated Collegiate Press<br />\ndinner followed by an election of a<br />\nniw president •due to the fact that<br />\nPaul Castelle, former president, is They Finally Caught On<br />\nBaltimore, Md. ACP)—\"De-emphasized\" football is a reality at the<br />\nnot back at school. Secretary LehnJohns Hopkins University. The football financing problem has been solved<br />\neis asks that all members be present<br />\nto the joy of fans by allowing everybody to go to the games on pisses.<br />\nto help formulate plans for the sponTicket takers, hereafter5, will only glance at \"guest cards.\" The cards are<br />\nsorship of high school track meet.<br />\navailable to all askers and cost nothing.<br />\nEach card will be good for \"bearer\" and all comers—the card Owner can<br /><br />\nHITHER AND YONJ<br /><br />\nFRAT STANDINGS<br /><br />\nBy LEN RUBINGER<br />\nLast week's hair-breadth gridiron victory. gave our Blue Jays their<br />\nsecond consecutive triumph over Haverford—one of the two colleges with<br />\nwhom we seem destined to establish new traditional rivalries.<br />\nit has been interesting to observe, these past few years, the gradual<br />\ncementing and shaping of our relationships with Haverford and Swarthmore,<br />\ninstitutions which, between themselves, enjoy a competition,easily as intense<br />\nand bitter as caws with St. Johns. Perhaps, as a result of our newly established sports policy—a plan which had been in the process of development for<br />\na number of years, we have been influenced in our scheduling of teams more<br />\nby scholastic reputations than by athletic abilities. Hence our present leaning<br />\ntoward the Pennsylvania schools.<br />\nThere is no doubt in anyone's mind that Haverford and Swarthmore<br />\nare more our scholastic equals than any of the establishments with whom<br />\nwe have had dealings in recent years. And now it appears that those same<br />\nschools are more our athletic „equals than some of our past opponents have<br />\nproved to be. Where-once we Pound ourselves anxiously awaiting contests<br />\nwith such teams as Maryland and Washington, now we discover that our<br />\ncompetition with the Terps has almost entirely ceased, while that with<br />\nWashington College is on the way to depletion.<br />\nInstead we are aware of the increasing interest and excitement evident<br />\nin preparation for games with our new Philadelphia rivals. Our pigskin representatives are at present, besides rejoicing over their latest football experience, anticipating their coming battle with the maroon-clad warriors of<br />\nSwarthmore. The fact that they cannot'forget last year's 40-19 defeat up<br />\nat the Swarthmore field is further proof of their newly acquired spirit.<br />\nBy the way, in reviewing that mad football,scramble of last year, it is<br />\nwell to be reminded that the two squads were not as far apart as the score<br />\nindicates. Swarthmore's forty points were run up in a moment of our weakness— so to speak; and during the second pair, in which our heroes managed<br />\nto find themselves, Swarthmore not only returned nineteen of her points, but<br />\ndeposited at least twe or three gallons of cold sweat as well.<br />\nThe next few years will see whether there will be a shift in our traditional attachments. It is the opinion of the writer that more is to be gotten<br />\nout of our coanections with Haverford and Swarthmore, than with the other<br />\nteams with which sye carry out our athletic skirmishes.<br /><br />\nplay host to his relatives and friends at will.<br />\nUnder the new plan—never before attempted by a modern-day university<br />\n—Johns Hopkins will never pay nor accept guarantees, will finance its own<br />\ntrips away and expect visiting teams to do the same.<br /><br />\nDIVISION A<br />\nWon Lost Tied What A Situation!<br />\n0<br />\n0<br />\n2<br />\nPhi Alpha<br />\nThe fate of the Spearfish Normal football team, from Spearfish, S.D.;'<br />\n0<br />\n0<br />\nSigma Phi Epsilon 2<br />\nhung on a pair of football pants, two weeks ago.<br />\n0<br />\n1<br />\nDelta Phi<br />\nThe team had come to-A-berdeen to play the Northern. State Teachers<br />\n0- College. The Spearfish team had an \"All-American\" tackle, according to its<br />\n1<br />\n:1<br />\nBeta Theta Pi<br />\n0<br />\n1<br />\n1<br />\nDelta Upsilon<br />\ncoach, but he couldn't play because they couldn't find a pair of pants to fit<br />\n0<br />\n2<br />\n1Kappa Sigma<br />\nhis 260 pounds of brawn and muscle.<br />\n0<br />\n2<br />\n1<br />\nAlpha Delta Phi<br />\n. \"I've wired every sporting goods company and if a pair arrives in time<br />\n0<br />\n3<br />\nAlpha Tau Omega 0<br />\nfor the game so I can use him, we'll have a good chance to win,\" said the<br />\nDIVISION B<br />\ncoach.<br />\nWon Lost<br />\nTriple-Tongued Football<br />\n0<br />\n1<br />\nPi Lambda Phi<br />\nSuccess story of the week is that of Bandmaster Hor,ace Heidt now<br />\n0<br />\n1<br />\nAlpha Chi Rho<br />\nat the Biltmore . . carried off a West\" Coast gridiron with a broken back<br />\n0<br />\n1<br />\nPhi Kappa Psi<br />\nin the early twenties. The former University of California gridster and box1<br />\n0<br />\nAlpha Epsilon Pi<br />\ning champion has surmounted several other physical handicaps to establish<br />\n1<br />\n0<br />\nKappa Alpha<br />\nhimself as one of the most popular entertaining bandleaders in the country.<br />\n1<br />\n0<br />\nTau Alpha Omega<br /><br />\nThere has been a great deal said<br />\nabout the glory that is, and was<br />\nthe Hopkins, along athletic lines, I<br />\nmean. Once again J. H. U. is in the<br />\nlimelight because of her new \"free<br />\ngate\" policy.<br />\nIt seems to me—and I hope you<br />\ndon't mind—that the Hopkins Board<br />\nof Control in this matter, knows how<br />\nto take advantage of opportunities.<br />\nYears ago, when we had a good<br />\nteam<br /><br />\nin comparison to the other<br />\nschools, there was no talk of \"free<br />\ngate.\" Now the other schools have<br /><br />\nforged<br /><br />\nahead<br />\nathleticly, leaving<br />\nJ. H. U. to muddle about for some six<br />\nor seven years until an idea strikes.<br /><br />\nAnd what an idea!! One that upholds all that is fair and square to<br />\nthe college man--Intramurals for all<br />\nand all varsity games for nothing!<br />\nNot a joker in the deck!<br />\nLiberal collegiate papers in other<br />\nschools, sports editors east and west,<br />\nand expectant observers laud the<br />\nHopkins—It's a New Deal in Sports!<br />\nThe point is, suppose tke....licopirrns<br />\nhad had a team or a number of<br />\nteams. comparing in size, strength,<br />\nand record, with teams such as Pitt,<br />\nL.S.U., etc. What with the financial<br />\nslump the schoo,1 was in I wonder<br />\nif a \"free gate\" would have been<br />\nproposed then? I wonder??<br />\n—Analyzer<br /><br />\nDear-Mr:<br /><br />\n-.4 Editor:<br /><br />\nIn view of the, interest which the<br /><br />\nSPORTS CALENDAR<br />\n—<br />\nIntercollegiateSOCCER—October 30<br />\nHopkins vs, University of<br />\nMaryland, at College Park<br />\nCROSS COUNTRY—October 30<br />\nHopkins vs. Swarthmore, at<br />\nHopkins<br />\nFRATERNITY SCHEDULE<br />\nTuesday—November 2<br />\nPhi Sigma Delta vs. Kappa<br />\nAlpha<br />\n.<br />\nPhi Gamma Delta vs. Alpha<br />\nChi Rho<br />\nWednesday—November 3<br />\nAlpha Tau Omega vs, Sigma<br />\nPhi Epsilon<br />\nDelta Phi vs. Kappa Sigma<br />\nPhi Alpha vs. Alpha Delta Phi<br />\nDelta Epsilon vs. Beta Theta<br />\nPi<br />\nINTERCLASS SCHEDULE<br />\nToday<br />\nCardiacs vs. TO-State<br />\n,Engineers A vs. Engineers B<br />\nBlue Bears vs Pick Ups<br />\nFrosh AB vs Library<br />\nTuesday, November 2<br />\nSeven Jays vs. Nightraiders<br />\nSenior Mechs vs Jay Frosh<br /><br />\nNEws-Lerrea of last week claims is<br />\ndisplayed<br /><br />\nby the student body in<br /><br />\nbadminton, a team should be organized.<br /><br />\nsee no reason, since last year<br /><br />\nsixty in&gt;„.aerITON41 in the badminton ladder, why badminton should<br />\nnot be made a minor sport.<br />\nA badminton squad should be selected from the first four in each of<br />\nthe smaller ladders in each of which<br />\nthere are fifteen 'Competitors. This<br />\nsquad should elect a captain, a manager, and '.select a coach. Again a<br />\ntournament should be run off, this<br />\ntime among members of the squad,<br />\nin order to select a team. After the<br />\nteam is organized this year, the selection of new members should rest<br />\nWith the poach, as it does in every<br />\nother varsity team.<br />\n'<br />\n'There are a great many college<br />\n'badminton teams in the country,<br />\nmost of them superior to whatever<br />\nteam we could produce this year;<br />\nbut there are years ahead. What if<br />\nwe are defeated for awhile? We have<br />\ngood material—let's make a start.<br />\n—The Bird<br /><br />\nHOMEVAOOD, BALTIMORE, FRIDAY, OCTOBER 29, 1937<br /><br />\nHOPKINS'Y'FORUM1<br />\nFOR FRESHMEN'<br />\nTO STARTINOV..)<br /><br />\nSecond Lecture<br /><br />\nCAMPUS CAVORTINGS.<br />\nNew York City ( ACP) —A de- I just lost a 113-year old boy who was<br />\npartment in manners—the first in a doing his own plowing every day.\"<br />\npublicly supported unpersity — has<br />\nIf you want to live to be 100, here's<br />\nbeen created at Huntrer College. It<br />\nthe prescription:<br />\n,<br />\nwill be known as \"the ABC of Liv1. Eat three light meals a day and<br />\ning, or Conversation in the Amenities,<br />\nonly alkaline foods.<br />\nBehavior and Customs.\"<br />\n2. Have a job you like.<br />\nMn<br />\nKatherine Bleecker Meigs,<br />\n3. Have lots of friends and read the<br />\nwho heads the course, has prepared<br />\nnewspapers for current affairs.<br />\na set of commandments for the busi4. Stop grumbling and don't talk<br />\nness woman. They are:<br />\nabout old age or pains. Don't<br />\nOne—Thou<br />\nshalt not ever use<br />\npreach against the younger genscented powder as a substitute for<br />\neration. Get out with the young<br />\nsoap and water.<br />\n---- people Dance a jig.<br />\n5. Don't sleep mare than six hours<br />\nTwo—Thou shalt not wear flashy<br />\na day. Have so many interests<br />\nclothes, or screaming colors.<br />\nthat you need the extra time to<br />\nThree—Thou shalt not put on<br />\n• pursue them.<br />\nmake-up like Theda Sara, nor per-<br /><br />\nWOLMAN TO SPEAK<br />\nAT FIRST FORUM<br />\nFour Freshman Meetings To<br />\nBe Held In<br />\nNovember<br /><br />\nman Again\", six prominent Hopkins<br />\nalumni will inaugurate the series of<br />\nFreitunen Forums on Tuesday, Noveiriber 2. Those Forums will be held<br />\nIn the Sherwood Room of Levering<br />\nHall every Tuesday night through<br />\nNovember. All freshmen will receive<br />\ninvitations to attend.<br />\nLaurie Dickson, chairman Of the<br />\nFreshman Committee, has announced<br />\nthat the speakers at the first Forum<br />\nwill include Guy Hollyday, '16, who<br />\nplayed lacrosse for three years, was<br />\nbusiness manager of the News-LETTER, and was president of his class<br />\nin 1912; and Robert Merrick, '17, who<br />\nis now president of the Equitable<br />\nTrust. Another speaker on the panel<br />\nwill be Stuart Smith, '30, Baltimore<br />\nlawyer; E. Guy Stapleton,'17, the As-<br /><br />\nhis 80's who runs a goat farm, and<br /><br />\nBiz Babes Get Laws<br /><br />\nAlumni<br />\nOf<br />\nProminent<br />\nUniversity To Talk At<br />\nPanel Discussions<br /><br />\na<br />\nAs speakers in a panel discussion<br />\non the topic of \"If I were a Fresh-<br /><br />\nDR. LOUIS FINKELSTEIN<br /><br />\nDr. Finkelstein has delivered the second of his interesting lectures on \"The History<br />\nof Judaism.' His third and<br />\nconcluding lecture will be delivered this coming Monday,<br />\nNovember 1.<br /><br />\nNEW DEAL SATIRE<br />\nHIT AT FORD'S<br />\n_<br /><br />\nfume thyself so strong that strong<br />\n'<br />\n;<br />\n/Ifoo Like A Cow\"<br />\nmen reel when you pass.<br />\nStudents at Columbia University<br />\nFour --Thou must not talk too<br />\nwho take the psychology tests find<br />\nfreely—keep gossip for thy private<br />\nit pays to talk back.<br />\nlife.•<br />\nIf they're asked to \"moo like a<br />\nFive--Thou muSt keep thy love life<br />\ncow\", they're given a high rating if<br />\noutside the office.<br />\nthey nonchalantly moo, toss back<br />\nSix---Thou must not leap like a fire some flippant comment. Getting<br />\nemhorse. at the alarm when five o'clock barrased gives them a pcior<br />\nmark.<br />\ncomes.<br />\nAnd an occasional \"what-Ur-hell\"<br />\nSeven—Thou must speak clearly during the examination rated better<br />\nand directly—accurately.<br />\nthan \"Yes, sir.\"<br />\nThe idea is to measure self-conEight --Thou must not be emofidence, aggressiveness and domitional or oversensitive or get thy<br />\nnance.<br />\nfeelings, hurt. .<br />\nNine—Thou must do thy work thoroughly. Fear not to say, \"I don't<br /><br />\nGeorge M. Cohan's Burlesque Of Roosevelt Playing<br />\nTo Capacity Audiences<br /><br />\nknow.\"<br />\nTen -Thou' must not think men in<br />\nthe office are making -passes ,,when<br />\nthey are only being civil; do not<br />\nBy WILLIAM L. SNYDR<br />\nIt is no wonder that \"I'd Rather Be make passes thyself.<br />\nMrs. Meigs believes manners are<br />\nRight,\" the latest opus of George S.<br />\ntaught, not inherited.<br />\nKaufman and Moss Hart, is playing<br /><br />\nsistant Superintendent of Schools for<br />\nBaltimore County; Dr. Alan Woods, to capacity audiences at Ford's theaprofessor at the Hopkins Medical ter this week.<br /><br />\n97 Year Old Kids<br /><br />\nOklah,oma City, Okla. (ACP)..-_.<br />\nSchool; and Abel Wolman,'13, who is<br />\nFirstly, the play has received one There are 950 students at the School<br />\non the National Resources Committee of the greatest publicity build-ups in of Maturates in yOklahoma City, a<br />\nschool which trains boys and girls<br />\nand is professor of Sanitary Engin- recent years, and secondly, this deover 70 years of age to live on past<br />\neering ere Dickson stated, \"Their lightful lampoon of the present ad- their<br />\ninsurance ,maturity dates.<br />\ntopic, 'If I were a Freshman ministration can stand on its own<br />\n\"Our most important course is how<br />\nAgain', Ethould be of interest to every merits as was evidenced by the way to eat,\" said Dr. W. A. McKeever,<br />\nfreshman because it-ean give valuable in which it was received by the audi- head of the school. \"Every one of<br />\nthe students must major in diet.<br />\nsuggestions for getting the most out ence.<br />\nYou'd be surprised how they perk<br />\nof his first year.\"<br />\nGeorge M. Cohan, rarely a song and<br />\nup when you get all the acidity out<br />\nThe Y.M.C.A. has also announced dance man, proves his versatality by of them.<br />\n\"Then we teach our boys and girls<br />\nplans for future Forums during Nov- giving an hilarious burlesque of Presiember. All of these Forums will be dent Roosevelt. He has the chief to find something to occupy their<br />\nminds. They can select anything they<br />\nfree, and open to all freshmen. Every executive eat ice cream in Central<br />\nwant under this heading.<br />\nTuesday night in November there will Park, sing about balancing the bud\"I have a boy of 97 who swings 10<br />\nbe a Forum except November 9, on get, and dictatorially say to the attor- pound dumbbells ten minutes a day<br />\nney general, \"Cummings, take a and takes a three<br />\nwhich night Rabbi Rosenzweig will<br />\nmile walk. I have<br />\nlaw.\"<br />\na girl past 80 who sings and another<br />\nspeak at the Supper Club. The second<br />\nBut Mr. Cohhan is not the only at- in the 90's who<br />\nis a good artist.<br />\nForum will feature Dr. Alan Gutt- trlbute of \"I'd Rather Be Right.\"<br />\n\"Then there's another student in<br />\nmacher whom upper-classmen will There is a group of talented dancers<br />\nremember as the man who gave sev- led by Georgie Tapps who contribute<br />\neral sex lectures at Hopkins last year. greatly to the enjoyment of the show.<br />\nMasters of tap, soft shoe, and ballet<br />\nAs his topic for the Forum Dr. Guttdancing, they breezily put pep into<br />\nmacher has chosen \"Men and Women the performance whenever it<br />\nthreatin a Changing World.\" For the third ens to let down.<br />\nCommendable performances are<br />\nmeeting Miss Irene Davis, the Hopkins Registrar, will speak on \"Hop! Hodges and Austin Marshall, and<br />\nkins and Baltimore\". For the fourth<br />\nTaylor Holmes as the Secretary of<br />\nForum Dr., Shaffer, Director of Ath- the Treasury.<br />\nletics, will speak on the development<br />\nRichard Rodgers and Lorenz Hart<br />\nof personality. The purpose of the picked up where they left off when<br />\nForums will be to help the freshman they left Broadway for Hollywood<br />\nwith an excellent new musical score.<br />\nto adapt himself to and familiarize<br />\nThere are quite a few novelty numhimself with Hopkins life.<br />\nbers;the best of which are \"I'd Rather<br />\nBe Right,\" and \"Qff The Record,\" The<br />\none ballad in the show, \"Have You<br />\nMet Miss Jones,\" in the reviewer's<br />\nopinion, will be among the nation's<br />\n!, top<br />\nfavorites within a short while.<br />\nThe play does, however, have one<br />\nrather obvious shortcoming, and that<br />\n( Continued from Page 1, Col. 5)<br />\nis the dialogue: It is, we must con- 6<br />\n\"Education today is ruining a lot<br />\nfess, very trite in spots. Although<br />\nof awfully good truck drivers. Every several<br />\nscenes are really very funnny,<br />\nbody wants to sell insurance. . . As others get laughs not because of the<br />\na result we have built up a tremendous author's cleverness,<br />\nbut<br />\nbecause<br />\nfamiliar political personages are readcollection of middlemen.\"<br />\ning the lines.. In this particular asPollack then described the \"madpect, the play does not come up to<br />\nness\" of 1929, when my barber was \"Of Thee I Sing\" or \"Let 'Em Eat<br />\nmore interested in Baldwin Loco- Cake.\"<br />\nNevertheless, the assets of the promotive than in barbering, and my<br />\nduction fat_<br />\nits liabilities,<br />\ngardener in General Electric' than in<br />\nand \"I'd Rather Be Right\" should go<br />\ngardening.\"<br />\non to be one of the best successes of<br />\nThe trouble with us then, and to- the current season.<br />\n•<br />\nday, was not soil erosion but soul<br /><br />\nCHANNING POLLACK<br />\nDEPLORES \"DECAY<br /><br />\nPollack closed with the exhortation,<br />\n\"Wake Up America.\" He quoted<br />\nfrom Lincoln's Gettysburg Address.<br />\nHazleton Spencer, associate professor of English at the Hopkins, introduced the speaker as \"a playwright<br />\nto say.\"<br />\nThe speaker previously addressed a<br />\nMeeting of the University Supper<br />\nClub,<br /><br />\n111131r.<br />\nTONIGHT AT THE PLAYSHOP<br /><br />\n(;et In On It While The Gettin\"s<br />\nGood, Fella !!!<br /><br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF,<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever<br /><br />\nmay _thus be given.<br /><br />\nson, Reardon Fusselbaugh, and PhilLouis Streb will play<br />\nthe role of George Dandin.<br />\nlip Poulster,<br /><br />\nIn connection with a study of Molime, of which the play will be a part,<br />\nProfessor H. Carrington Lancaster,<br />\n,<br />\nhead of the Hopkins French Department, will deliver a lecture on the<br />\nFrench dramatist on November 16.<br />\nThe 1937-38 schedule of the Play.<br />\nshop contains. many modern as well<br />\nas classical plays.<br /><br />\npr. Fagin will<br />\ndirect all' the productions. During<br />\nthe week beginning February 22, a<br /><br />\nHOPKINS<br />\nMEN<br /><br />\nLearn the where, how,<br />\nand why of shopping!<br />\nPATRONIZE OUR<br />\nADVERTISERS<br />\n—<br /><br />\nYou Get the Best Raw Bar Oysters<br /><br />\nat<br /><br />\nHARRY L. HASSLINGER CO.,<br />\nniNtm; ROOM AND BAR<br />\nNORTH AVE. &amp; ST. PAUL STREET<br /><br />\n—KIBLER'S<br />\nJewelers and Opticians<br />\nParker Pens and Pencils<br /><br />\nLock Repairing Shop<br />\nHardware—Paints<br />\nKeys Mode W hile Y,, Waste<br />\nPhone UNniyersity 0202<br /><br />\n3002 Greenmount Ave.<br /><br />\nJewelry and Watches<br />\nEyes Examined<br />\nLens Repaired<br /><br />\nis what you get in a suit, topcoat or overcoat at Jos. Schloss<br />\n&amp; Son. ,,„Schloss creations give<br />\n,,;:<br />\nyou ev.0,<br />\nlearned<br />\nto expect 7Fam clothing—plus<br />\nthat extra style and distinction that assures you an exclusive air.<br /><br />\nReady-to-Wear Suits, Top.<br />\ncoats, Overcoats<br /><br />\n$435<br /><br />\nTO $470<br /><br />\nThis Ad Entitles You<br /><br />\nTo 5% Discount Card<br /><br />\nST. PAUL AT 33RD STREET<br /><br />\nOn All<br />\nLiquors, Wines, and Beers<br /><br />\nPreocriptions—School Supplies<br />\nSandwiches<br /><br />\nPhone University 4251<br />\nFor Prompt Service<br /><br />\nUnexcelled Fountain Service<br />\n•<br /><br />\nde<br /><br />\nby<br />\nan<br />\nbe<br /><br />\nInc<br /><br />\nPh<br /><br />\nse/<br /><br />\nma<br /><br />\nyer<br /><br />\nthe<br /><br />\nma<br /><br />\nWa<br /><br />\nwh,<br /><br />\nJ<br /><br />\nstri<br /><br />\nvict<br />\nbe<br /><br />\nhe 1<br /><br />\nal<br /><br />\nmar<br />\nber<br />\nthe<br /><br />\nmar<br />\nelm<br />\nHat<br />\nSr<br />\ncros<br />\nPhi<br /><br />\nlit<br />\nwon<br />\nship<br /><br />\nC<br /><br />\nHop<br />\ning<br />\nNI<br />\nMlle,<br />\nnest<br />\noffici<br />\npres.<br />\nnour<br />\nduct<br /><br />\nOR<br /><br />\nCHAS. MALL<br /><br />\nThat Extra<br />\nSomething<br /><br />\nPHARMACY<br /><br />\nfor three years' service-in their<br />\nactivity. Credit for Varsity Seals<br /><br />\nIncluded in the cast are Louis Streb,<br />\nDolly Ashley, Elsie Kane, Mary Albey, Theodore George, Joseph Addi-<br /><br />\nROETH<br />\nJeweler<br /><br />\n3120 Greenmount Ave.<br />\nWatch Repairing<br /><br />\nNORTH INN<br /><br />\n, All hreads of activities are reErlanger, head of the SAC., the<br />\nnames of all men having credit<br /><br />\nIndividual 'Brush and Comb For<br />\nEvery Customer<br /><br />\n3222 Greenmount Ave.<br /><br />\n11111 E LEV'S<br /><br />\nWilliam<br /><br />\nDORMITORY DANCE<br />\nFOR NOVEMBER j8<br /><br />\nHours: 8 a. m. to 7:30 p. m. Sat.<br />\n8'a. m. to 9:30 p. m. Manicuring<br /><br />\n3204 Greenmount Ave.<br />\nBaltimore, Maryland<br /><br />\nto<br /><br />\nLOUIS SVVYER<br /><br />\nSpeaking of the rally planned .for tonight, President<br />\nSwyer said \"An interesting<br />\nprogram has been arranged<br />\nand we expect a large and enthusiastic crowd.\"<br /><br />\nS. W..Con. St. Paul and 33rd Sts,<br />\n1st Floor, next to Drug Store<br /><br />\nBoulevard Liquor Co.<br /><br />\nin<br /><br />\nHopkins Playshop this year. Dr. N.<br />\nBryllion Fagin, director of the group,<br />\nhas announced that the play will come<br />\nduring the week of November 23.<br /><br />\nTHEODORE'S<br />\nBARBER SHOP<br /><br />\nStCO X'XilL<br /><br />\na<br /><br />\nGeorge Dandirit, by the seventeenth<br />\ncentury dramatist Moliere, will be<br />\nthe first presentation of the Johns<br /><br />\nReserving November 13 as the open\"The educational spoon in Amerplay by the Swedish author and draica is handled by Competent and un- ing date for their social affairs, the<br />\nmatist, Strindberg, will be given..<br />\nderstaiding teachers, but the stu- Alumni Memorial<br />\nHall dorm.tory so- Bgienning<br />\nApril 19, 'and for the Week<br />\ndents should do the feeding themcial committee will lead o with a following, The Dance<br />\nof Death will be<br />\nselves.\" Dr. Alexis Carrel, ranking<br />\nnew<br />\ninnovation,<br />\npresented.'<br />\nwhich<br />\nplans<br />\nThis play will be sponto be perscientist, is interviewed by the Dartsored<br />\nby<br />\nWe<br />\nMaryland<br />\nmanent.<br />\nConference of<br />\nThe<br />\noccasion<br />\nwill be the Anmouth student newspaper,<br />\nOrganization.<br />\nLectures<br />\n\"It may seem strange, but all great nual Frosh Turkey Trot and will take Dramatic<br />\nmen striped off their pedestals as place hi the Commons Room of the on noteworthy dramatists and the<br />\nproduction<br />\nof<br />\none-act plays will comsoon as they began to beat a path dormitory.<br />\nto the bathtub.\" Dr. -Sanders, a pro- _ .The committee led-by Arthur Katz, plete the Playshop's schedule.<br />\nAll members of the Hopkins Playfessor in education at De Paul Uni- '40 and assisted by Zoel R.adner, '39,<br />\nversity, saw this lecture remark Carl Speck,- '41, Norman Silverstein, shop group are either students or<br />\n'40, Laurie Dickson, '40, Carl Rasin, alumni of thk university. Six faculpicked up by a campus -columnist.<br />\nAn English professor in the Massa- '38, and Lyman Mauk„40, has an- ty members' make up the Board of<br />\nchusetts Institute of Technology is nounced that the gratifying pledges Governors. Dr. John C. French, Hopby the residents point to a successful kins librarian, is chairman of the<br />\n\"taking it all back.\"<br />\nboard. Other members are Dr. Kemp<br />\nIn 1929 he told the Institute's grad- affair.<br />\nuating class to \"Be a snob; marry<br />\nAlthough the conunitte has as yet Malone, Dr. Ernest Feise, Dr. Hazleton<br />\nSpencer, Dr. Florence Bambernot named an orchestra, appropriate<br />\nthe boss's daughter.\"<br />\nberger, and Dr. H. Carrington Lan\"Now,\" he declares, \"I've decided music for the occasion is promised.<br />\nthe advice didn't work out as well<br />\nThe affair will bear a tariff of caster.<br />\nThis<br />\n$2.10 drag and $1.50 stag. Starting Death will be presented.<br />\nas I expected.<br />\n\"By marrying the boss's daughter, at nine in the evening the baton will play will be sponsored by the Marythe young men took the chance of close the session at one the following land Conference of Dramatic Organiacquiring the boss's liabilities along mornrng. Tickets will not be solicited zation. Lectures on noteworthy draoutside of the dormitory. The com- matists and the production of onewith his assets.\"<br />\nBesides, it seems that the young mittee, however, extends its welcome act plays will complete the Playshop's schedule..<br />\nmen so advised were asked by the to all former residents.<br />\nfair—and wealthy—objects of their<br />\nGet<br />\nTo<br />\nKnow<br />\nUs<br />\naffections if the offers of marriage<br />\nYOUR CREDIT IS GOOD!<br />\nwere inspired- by lor or their professor's advice.<br />\nEXPERT HAIRCUTTING, 40c<br /><br />\nVARSITY SEALS<br /><br />\nquested to turn<br /><br />\nPLAYSHOP CAST<br />\nOF MOLIERE WORK<br />\nCHOSEN BY FAWN<br />\nGorge Dandin To Be Presented During Week<br />\nOf Npvmber 23<br /><br />\nQuotable Quotes<br /><br />\nATTEND<br />\nTHE<br /><br />\nerosion.\"<br /><br />\n'Stormer Head<br /><br />\nJos. Schloss<br />\n&amp; Son<br /><br />\n5 East Lexington St.<br /><br />\nBoulevard Hardware Co.<br />\nHOUSE FURNISHEINGS<br />\nELECTRICAL SUPPLIES<br /><br />\n430 E. Thirty Second St.<br />\nUn. 0749<br /><br />\nONLY DOWN TOWN STAGE SHOW<br /><br />\n-FaROME-NOW<br /><br />\nDi<br />\ncyclo<br />\nat tt<br />\n4 p.<br />\nLaw.<br />\nthe 1<br />\ntopic<br />\n/aria;<br />\nDr.<br />\ntron,<br />\nhas 1<br />\nexper<br />\nnude<br />\nrecen<br />\nhas<br />\nFol<br />\nbe 11,<br />\nrence<br />\nhis la<br />\nbody<br />\nthe I<br /><br />\nfjIST<br /><br />\nHeld Over! 2nd Big Week!!<br />\nRead These Raves!!<br />\n\"One of the Best Photoplays of the<br />\nYear.\"<br />\n—Donald Kirkley, Mom. Sun.<br />\nRtbbon with Pahns. Outstanding<br />\nComedy Drama.\"<br />\n—Gilbert Kanour, Eve. Sun.<br />\n\"One of the Year's Screen Topnochers.\"<br />\n—Norman Clark, News, Post.<br /><br />\nSTAGE DOOR<br />\nSTARRING<br /><br />\nKatharine HEPBLTRN<br />\nGinger ROGERS<br />\nAdolphe MENJOU<br />\nPI US<br /><br />\nAn All Ne%Nktage Sho.<br /><br />\nThe<br />\na w&lt;<br />\nmone:<br />\ntest a<br />\ntorica<br />\ntwo I<br />\nas th<br />\nAdam<br />\nIn ad<br />\ndollar<br />\nwill b<br />\nbest<br />\nwith'i<br />\nmast.<br /><br />"}], "field_media_file": [{"target_id": 39124, "display": null, "description": null, "target_type": "file", "target_uuid": "ef4ebdeb-0b3b-47cd-aea0-f323637ab696", "url": "http://digital.library.jhu.edu/system/files/2022-03/12800-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12800, "target_type": "node", "target_uuid": "e5ac5e73-9f14-4dc0-9de9-c9e518e11df0", "url": "/node/12800"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "1ec13b79-f5ea-4f10-a332-66dcc2cbb0d5"}]}