{"mid": [{"value": 36541}], "uuid": [{"value": "76c6a370-a83e-4711-93c0-801a1de642f9"}], "vid": [{"value": 36541}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:48:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12905-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:48:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:48:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "crrri<br />\n<br />\nJLEES \"EIS MEStgATI<br />\n<br />\nVOL. XXIV, NO. 11.<br />\n<br />\nBALTIMORE, MD., DECEMBER 23, 1919.<br />\n<br />\nr<br />\n<br />\nPRICE, FIVE CENTS<br />\n<br />\nREFERENDUM ON TREATY<br />\n<br />\nMURPHY TO REPRESENT HOPKINS<br />\n<br />\nPUBLIC INITIATION HELD<br />\n<br />\nORGANIZATION MEETING HELD<br />\n<br />\nMass-meeting on Jan. 8—Study Treaty<br />\n<br />\nMany Famous Men to Speak at National<br />\n<br />\nDuring Holidays.<br />\n<br />\nCollegiate Athletic Convention.<br />\n<br />\nNine New Men Taken Into Honorary<br />\nFraternity—Announcements Made.<br />\n<br />\nMany Ex-Lacrosse Players Address Candidates Good Schedule Procured.<br />\n<br />\nA mass-meeting has been ar\"Bobby\" Hoffman opened the<br />\nAt the annual meeting of the<br />\nThe lacrosse organization meetranged by THE NEWS-LETTER, in National Collegiate Athletic As- meeting by protesting against the ing was held last Wednesday<br />\nco-operation with the Y. M. C. A., sociation, to be held in New York unrestrained way in which the in the Mechanical<br />\nfor Thursday, January 8, at which December 30, Johns Hopkins will walks have been decorated with Building at 4.30 P. Engineering<br />\nM. The meettwo prominent men will discuss be represented by Athletic Direc- numerous 22's and 23's. He ing was attended by<br />\na<br />\nthe Peace Treaty and League of tor R. B. Murphy as the accredit- warned that unless these works of and enthusiastic audience, large<br />\namong<br />\nNations Covenant from different ed delegate and probably several art were speedily erased something which were many of our former<br />\nangles.<br />\nmembers of the 'Varsity Club as stronger than a protest from the crack lacrosse men now lending<br />\nIn the, meantime it is hoped visiting delegates.<br />\nStudent Council would be forth- their hearty support in the buildthat every student will endeavor<br />\nThe association held its first coming. Then the list of the win- ing up of a championship team.<br />\nto study the Treaty and the Cove- meeting in 1905, and was com- ners of the \"H\" in football was<br />\nThe •meeting was opened by<br />\nnant during the holidays, so that posed of representatives appoint- read. Those who won their \"H\" Capt. \"Ferdie\" Meyer, who<br />\nmade<br />\nhe will be in a position to give ed by the presidents of the col- are: Captain Jones, ,Calkins, a brief statement as to<br />\nthe pres• an intelligent vote on January 13, leges in the United States. The Tome, Hoffman, Barchet, Cashell, ent difficulties which<br />\nbeset the<br />\nTHE NEWS-LETTER Would be glad purpose of the organization is to W. WOod,-E. Wood,Watson, Eger- team by the loss of the cage, but<br />\nto receive any letters upon this promote clean sports, act as ar- ton. Landy and Randall. \"H. A. maintained, as did all<br />\nfollowing<br />\nsubject for the Mail Bag from bitrators in matters of great im- A.'s\" were awarded to Dodson, speakers, that the misfortune<br />\nmembers of the faculty, students portance to athletics, and to keep Cromwell, Barrett, Butler, Ow- could • be overcome by hard and<br />\nor from such outsiders as might the rules of all college sports up ings, chas, Morgan and Reed. persevering work on Homewood<br />\nbe interested. Such letters should to date.<br />\nManager Evans received his \"H. Field.<br />\nbe addressed to the \"Manager of<br />\nAt the afternoon session the Nu, •<br />\nHe then introduced successively<br />\nTreaty Referendum, Johns Hop- presidential address will be deliv\"Charlie\" Leber then put in a • Goalkeeper Daugherty—\"the nidn<br />\nkins University, Baltimore, Md.\" ere(l by Lieut.-Col. Palmer E. word for the Dramatic Club. He I with the iron gut\"—and \"Shorty\"<br />\nIn co-operation with the Com- Pierce, U. S. A., and will sum up stated that reserve seats are now Defandorf. Both of these<br />\nmen<br />\nmittee on Intercollegiate Treaty the work accomplished by the as- on sale and requested every fresh- emphasized their love for the<br />\nReferendum, THE NEWS - LETTER sociation during the year. It is man to bring his girl.<br />\ngame, the good fellowship which<br />\nhas arranged to have a ballot on expected that the Hon. Newton I)<br />\nThe real purpose of the meet- is found on the lacrosse field and<br />\nTuesday, January 13, on the fol- Baker Secretary of War, will ing, however, was the public initi- the comradeship which links the<br />\nlowing six propositions:<br />\nmake'<br />\nthe keynote of the conven- ation of the new members to the players and coaches.<br />\n1. I favor the ratification of tion, \"Physical Efficiency as a Na- Omicron Delta Kappa fraternity.<br />\nThe next speaker, a man well<br />\nthe League and Treaty without tional Asset,\" the general subject Dr. French made a short address known at.Hopkins, was<br />\nDi. Aberamendments or reservations.<br />\nof his remarks.<br />\nin which he said that the two out- crombie, who won his lacrosse<br />\n2. I am opposed to the ratifiDr. J. H. McCurdy, of the standing features of American \"II\" in 1898. Dr. Abercrombie<br />\ncation of the League and the Springfield Training School, and college life are democracy and told how lacrosse, while<br />\nfundaTreaty in any form.<br />\nRev. Henry Phillips, chaplain of competition, and that it is these mentally depending on the<br />\n3. I am in favor of the ratifica- the University of the South and two points which this fraternity viduality of the players,<br />\nis suction of the Treaty,and the League, president of the Southern Inter- stands for. It is not an exclusive cessful only when the<br />\nco-ordinabut only with the specific reserva- collegiate Athletic Association, fraternity, where wealth and good tion of this individuality<br />\nis setions as voted by the majority of will also speak along the same looks might count for something, cured in building up a compact<br />\nthe Senate.<br />\ngeneral lines. The opinion of the but membership in it is not gained body. He talked especially to the<br />\n4. I favor any compromise un- business man will be given by Mr. only by those who excel to a very new men, urging them to<br />\ncome<br />\nder reservations which will.make Frank H. Scott, vice-president of marked degree in the different col- out for the team regardless<br />\nof<br />\npossible the immediate ratifica- the Warner-Swasey Company, of lege activities, and it is the high- their lack of experience or phytion of the Treaty and the League. Cleveland. During the war, Mr. est honor to be obtained in the sical ability.<br />\n5. I favor the Government pro- _ Scott was chairman of the Gen- University. The men who have re\"Johnny\" Knipp, a former star<br />\nceeding to make peace with Ger- eral Munition Board, and later of ceived this sought-after distinc- man in laCrosse, followed with a<br />\nmany at once and leaving the the War industries Board.<br />\ntion of merit are: Ferdinand My- few words_ of advice to the new<br />\nquestion of a League of Nations<br />\nCapt. .1. L. Griffith, who was er, John Lewin, Warren Driver, men, emphasizing the need of<br />\nto be settled afterwards.<br />\ninstrumental in seeuring a revi- Millard Foard, George Wagner, hard work and perseverance in or6. I favor a compromise of time sion of the revenue laws affecting Harold Townsend, Graham Hein- der to win distinction in this<br />\nreservations of such a character taxes on, admission to college er, Norman Keyes and George sport. \"Johnny\" sounded the<br />\nas will avoid the danger of de- games, will explain his work for Goetz. After the meeting the pri- watchword of the whole meeting;<br />\nfeating ratification, while still that committee.<br />\nvate initiation was held • at the when he closed with the exhortaDr. R. Tait McKenzie has been Johns Hopkins Club.<br />\nmaking clear that America can<br />\ntion, \"Beat Navy!\"<br />\nonly be involve! in war by a dec- asked to speak on the question of<br />\nMr. Murphy brought the meetNobody but the freshmen could<br />\nlaration of Congress, that domes- encouraging boxing in the col- ing to a close ,with announcements be mistaken in the identity of the<br />\ntic questions and the Monroe Doc- leges. Reports from standing concerning the two winter sports next speaker, when<br />\nhe began with,<br />\ntrine are entirely outside of the committees on football, track, —basket-ball and swimming. The \"Well. I tell you.\" \"Tiff\" Willjurisdiction of the League, that basket-ball, swimming and wres- athle4ic ticket will admit all stu- iams was certainly \"in form,\" but<br />\nplural votes of any member, are tling will also be made.<br />\ndents to the games, and season he claimed he had come to receive<br />\nall disqualified in the event of a<br />\nWith Hopkins coming forward tickets may be obtained for their \"dope,\" not to disseminate it, and<br />\ndispute wherein we are disquali- in athletics, this meeting should sweethearts at the cut price of retired after amusing the audience<br />\nfied from voting, and that on de- be of great interest to the coach $3.rc0 (cash). After receiving the with some of his ever-ready jokes.<br />\nciding to withdraw we are to be and the members of the teams.<br />\nstaggering news that next year<br />\nManager Keyes announced the<br />\nthe judge of whether our obligathe athletic fee will be $15 (again schedule as arranged to date, which<br />\nvote is estimated to be 1,300.<br />\ntions have been met.<br />\ncash), everybody hurried outside will be found at the end of this<br />\nOn the same day every college to get the air.<br />\nThese propositions will be voted<br />\narticle. He also said that pracUpon by the faculty, medical stu- and university in the country will<br />\ntice would be started soon after<br />\ndents, graduates and undergradu- likewise present these propositions<br />\nEven the type feels set up to be the holidays, and urged the men<br />\nates of the University. The sum to their students and faculty. In in the same boat (or is it galley?) to watch for its<br />\nannouncement.<br />\ntotal of the number eligible to<br />\n(Continued on page 4, col. 2)<br />\nwith us.<br />\n(Continued on page 6, col. 3)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\n<br />\n2<br />\n<br />\nHarvard, Vale and Columbia<br />\ncontemplating the introducare<br />\nNew Haven, Dec. 17.—By a vote<br />\nof 856 to 841, Yale undergradu- tion of intercollegiate aerial racates, in a straw ballot counted ing as a fixed sport. At a meetlast night, favored discontinuance ing of the Columbia Aero Club,<br />\nof the old Yale song, \"Bright Col- held recently, Major G. D. Lamer,<br />\nlege Years,\" as it has been sung flight commander of the One Hunby Yale men for decades to the dred and Third Aero Squadron,<br />\nGerman tune, \"Die Wacht am A. E. F., was elected president.<br />\nInvitations are soon to be sent to<br />\nRhein.\" s<br />\ncolleges and universities to<br />\nother<br />\nThere were 732 ballots cast on<br />\nintercollegiate aerial asan<br />\njoin<br />\nthe proposition favoring the retention of the words_ of the old sociation designed to govern the<br />\nsong with a neW tune, while 124 sport and to conduct dual and<br />\nvoted for new words and a new general meets between its memtune. The song will not be sung.in bers. The University of Pennsylthe future at undergraduate vania and Johns Hopkins were<br />\ngatherings, according to a decision mentioned as probable members.<br />\n* * *<br />\nof the Student Council.<br />\nBrown tried out pyschologieal<br />\nAt least 5,000 Princeton men entrance exams on the Freshman<br />\nserved in the late world war. Class this year. Candidates for<br />\nThree thousand of them became the various degrees received the<br />\nofficers, including four brigadierfollowing averages: A. B., 73.7;<br />\ngenerals. Two hundred and thirand<br />\nty were decorated for bravery, Ph. B., 68.7; B. S., 66.11;<br />\n65.21.<br />\nstudents.<br />\nspecial<br />\nand 137 were killed.<br />\n•<br />\n<br />\nOld Yale Song Dropped.<br />\n<br />\narfrrbrrirk<br />\n<br />\nilippg To.<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nHIGH GRADE CHOCOLATES.<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br />\n<br />\nJohn C. Knipp & Sons<br />\nDRAPERIES<br />\n<br />\nDECORATIONS<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nATTENTION! J. H. U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br />\n<br />\nPRINTERS<br />\n<br />\nPUBLISHERS<br />\n<br />\nM EY-Fad-1ElM ER<br />\nThe Big Stationery Store<br />\n10-12 N. HOWARD STREET<br />\n<br />\nCommittee Praises Undergraduates—<br />\nExpect to Break Ground For New<br />\nBuilding in the Spring.<br />\n<br />\nIn an interview with Mr.George<br />\nL. Radcliffe, chairman of the<br />\nDormitory Campaign Committee,•<br />\ngreat satisfaction with the result<br />\nof the drive among the undergraduates was expressed. The<br />\namount given by the four collegiate classes is nearly $15,000. He<br />\nsaid that the spirit shown here<br />\nwill be used as an argument with<br />\nthe alumni for the campaign. Mr.<br />\nRadcliffe believes that the fund<br />\nwill be raised in time to. break<br />\nground for the new building next<br />\nspring. Although the amount subscribed so far is only $114,000, he<br />\nthinks with the returns of classes<br />\nnot yet completely canvassed, and<br />\nsubscriptions from a few men not<br />\nconnected with the University, the<br />\nfund can be raised to the necessary $300,000.<br />\nOf the alumni classes, '00 lends<br />\nin donations with $10,960. The<br />\nclass holding the runner-up position is '03; but since it has a subscription of $5,000 from a nonmember of the class, its position<br />\nis disputed by '92, who has raised<br />\na larger sum from among its members, but whose total does not<br />\nequal that of '03, including the<br />\n$5,000 subscription from an outsider.<br />\nSwimming Team Has Good Practice.<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nFURNITURE<br />\n<br />\nFUND FAR FROM COMPLETE<br />\n<br />\nBALTIMORE<br />\n<br />\nAlthough only 14 men were<br />\npresent for, swimming practice<br />\nlast Thursday night at the Baltimore Athletic Club, some very<br />\nfast swimming made up for the<br />\nlack in numbers. Under the direction of Coach Ortland and<br />\nCaptain Hall, the candidates practiced starts and turns, and then<br />\ntried some competition at various<br />\ndistances. The men were divided<br />\ninto groups of three. The winners in the 100-yard dash were:<br />\nBuhrer, Johnston and Henry<br />\nRowland. Davidge Rowland won<br />\nthe 100-yard breast-stroke, while<br />\nHall finished first in the 300<br />\nyards. Buhrer and Johnston, new<br />\nmen on the squad, showed exceptionally good form and gave promise of soon developing into 'Varsity material.<br />\nThe following men were present: Coach Ortland, Captain Hall,<br />\nReins, D. Rowland, H. Rowland,<br />\nBuhrer, Powell, Parsons, Johnston, Call, Lord, Seitz, Kinnamon,<br />\nMarden and Assistant Manager<br />\nMiller.<br />\nManager Gould announces that<br />\nall candidates will be notified<br />\nshortly of practice to take place<br />\nduring the holidays.<br />\nDartmouth started compulsory<br />\nathletics for freshmen this fall.<br />\nGolf, tennis, regular track work<br />\nand hiking are on the list of approved sports.<br />\n<br />\nJohns Hopkins Press<br />\nI.—American Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLI in progress. $6 per volume. (Foreign postage 50 cts:)<br />\nIL—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors. Quarterly. 8vo.<br />\nVolume XL in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVII in progress.<br />\n$3.50 per volume.<br />\nIV.—Johns Hopkins University Circular<br />\nIncluding Annual Report. Register,<br />\netc. 8vo. Volume XXXVIII in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br />\nVIII.— Modern Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRIJENBAUM, W. KURRELMEYER and H. C. LANCASTER.<br />\nMonthly. 4to. Volume XXXIV in<br />\nprogress. $3 per volume. (Foreign<br />\npostage 50 cts.)<br />\nIX.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXIV in progregs. $3<br />\nper volume. tForeign postage 25 cts.)<br />\nXL—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\nSeries in progress, $2.<br />\nXIL—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nXIII—Elliott Monograph in the Romance<br />\nLanguages and Literatures.<br />\nEDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. Reports of the Maryland Geological Survey.<br />\nE: B. MATHEWS, Editor.<br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of. publications will be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\n<br />\n3<br />\n<br />\nJudging now by the War facts—<br />\n<br />\nThe American Smoke<br />\nis a cigarette<br />\nOTonly because they proved<br />\nsuch a necessity with our<br />\nN<br />\nfighting men on land and sea, but<br />\n<br />\ninent citizens,the cigarette is more<br />\npopular than cigar or pipe and as<br />\nhighly respected as either.<br />\n<br />\nalso because they are the mildest<br />\nOne cigarette in particularseems,<br />\nform of smoking cigarettes have as the following facts show,to have<br />\nat last come into their own.<br />\nwon a position as America's first<br />\nToday, among young men as choice in smoking, East and West,<br />\nwell as old, plain men and prom- North and South— nation-wide.<br />\n<br />\n-<br />\n<br />\nYOUNG MAN<br />\nYour Suit or Overcoat<br />\nwill have those smart dapper kinks if<br />\nit comes:from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br />\n<br />\nPrices, ;$25.00 to $65.00<br />\n<br />\nTEWART&G,<br />\nS,<br />\nCOMPerfIon WWI&C,N.<br />\nIn York.<br />\n<br />\nHOWARD AND LEXINGTON STS.<br />\n<br />\nTHE HATTERIE<br />\n—and one cigarette in particular:<br />\nAt Washington<br />\nA fact:<br />\n<br />\n:<br />\n<br />\nEach day the Nation's capitol secs a new<br />\nthrong of big professional and business'<br />\nmen from every state in the Union. These<br />\nchanging hundreds of men buy more<br />\nFatimas than any other cigarette.<br />\n<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of light Street<br />\n<br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br />\n<br />\nIn the Army<br />\nA fact:<br />\n<br />\nAt the big army training camps during the<br />\nwar were thousands of soldiers from each<br />\nState and Territory. At every one of<br />\nthese camps, Fatima was a leader.<br />\n<br />\nSHIRTS<br />\n<br />\nIn the Navy<br />\nA fact:<br />\n<br />\nThe officers in our Navy come, of courLe,<br />\nfrom every part of America. Of all the<br />\ncigarettes sold in Officers' Mess throughout the whole Navy, over 90% arc Fatimas.<br />\n<br />\nQuality<br />\n<br />\nWith our NC<br />\nOcean Fliers<br />\nA fact:<br />\n<br />\nThe 15 American men who flcw en the<br />\nNC-1, NC-3 and NC-4 hailed p,ihcps<br />\nIrons 15 different states. Of the 15, twelve<br />\nchose Fatimas for that long, lonely, daring<br />\nflight.<br />\n<br />\n)<br />\n<br />\nEN keep switching<br />\nfrom straight.TurkM<br />\nish cigarettes because they<br />\n<br />\nFAT<br />\n!<br />\nA Sensible Cioarette<br />\n<br />\ncontain too much Turkish.<br />\nThey seem over-rich and<br />\nheavy.<br />\nMen keep switching to<br />\nFatimas because Fatimas<br />\ncontain ;rust enoughTurkish<br />\n—just enough to taste right<br />\nand just enough to leave a<br />\nman feeling right, even<br />\nwhen he smokes more<br />\nthan usual.<br />\nAre you smoking too<br />\nmuch Turkish?<br />\n<br />\nC°.<br />\n<br />\nr 0611<br />\n:es S``t6<br />\nv. 00<br />\n',<br />\n?1<br />\nNO 1.1.<br />\n30<br />\n10°`<br />\nMerchandise<br />\nHATS<br />\n<br />\n\"Just enough Turkish\"<br />\n<br />\nARROW COLLARS<br />\n<br />\nHOSIERY<br />\n<br />\nTHE HOSIERY SHOP<br />\n215 N. CHARLES<br />\nST.<br />\n<br />\n(Baltimore's (Best Shop For<br />\nMen's Sox and Ties.<br />\n75 Cents and Up.<br />\n<br />\nBOOK BINDING<br />\nJoseph Ruzicka<br />\n106-108 CLAY ST.<br />\n<br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nti. pkins Seals in Silver and<br />\nGold,<br />\n<br />\nCollege Jewelry r Specialty<br />\n<br />\n28 E BALTIMORE STREL<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\n<br />\n4<br />\n<br />\nshort to allow sufficient public<br />\ndiscussion at the University. It is<br />\nE<br />\ntherefore necessary that every student, during the holidays; en$2.00<br />\nSubscription<br />\ndeavor- to learn as much as posEntered as second-class matter De- sible concerning the matter. Look<br />\ncember 3, 1909, at the Post Office at at the proposition from every<br />\nBaltimore, Md., under Act of Congress,<br />\nangle and, whenever possible, disNovember 3, 1879.<br />\ncuss it.<br />\nPublished weekly, from October to .<br />\nThe referendum will only be a<br />\nJune, by the students of Johns Hopsuccess if supported by every stukins University.<br />\ndent. ALL must vote, and vote<br />\nBusiness communications should be<br />\naddressed to the BUSINESS MANAGER, intelligently.<br />\n<br />\nfile J01111310.1113ji0W3-[01101<br />\n<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should<br />\ne sent to the EDITOR-IN-CHIEF.<br />\nHomewood 100<br />\nTelephcne<br />\nEditor-in-Chief.<br />\nJohn H. Lewin, '20.<br />\nManaging Editor.<br />\nFrederick F. Torsch, '20.<br />\nAssociate Editors.<br />\nJames R. Lornauro, '20.<br />\nyertrees J. Wyckoff, '20.<br />\nMitchell B. Carroll, '20.<br />\nCarroll Stansbury, '21.<br />\nHenry E. Niles, '21.<br />\nLlewellyn W. Lord, '21.<br />\nJunior Editors.<br />\nEdward Huey, '22.<br />\nH. Douglas Cotton, '22.<br />\nBusiness Manager.<br />\nGeorge W. Wagner, '20.<br />\nCirculation Manager.<br />\nHenry H. Morriss, '20.<br />\nAssistant Business Managers.<br />\nVernon E. Stuart, '20.<br />\nGeorge Deichman, '21.<br />\nBALTIMORE, MD.,<br />\n<br />\nDEC. 23, 1919<br />\n<br />\nBe Prepared To Vote.<br />\n<br />\nTHE NEWS-LETTER'S MAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br />\n<br />\nAll letters intended for publication<br />\nmust be concise.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be printed<br />\nif request is made that they be omitted.<br />\nThe publication of a letter is not to be<br />\ntaken as an indorsement of its views by<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nREFERENDUM ON TREATY<br />\n<br />\nAdvocates Change in Class Contest.<br />\nTo the Editor of THE'NEWS-LETTER:<br />\n<br />\n(Continued from page 1)<br />\n<br />\nSir—Last Saturday it was<br />\nclearly shown that the freshman<br />\nand sophomore classes are becoming too large in numbers to allow<br />\nthe traditional sort of flag rush<br />\nto be carried on safely and fairly. The plan of having but one<br />\nreal point of attack for the sophomores to concentrate upon—namely, the freshman holding the banner—naturally enough causes the<br />\nparticipants to criwd into the<br />\nsmallest possible area. And when<br />\nsome two or three hundred fighting students are tightly bunched<br />\naround the few .men in direct contl:ct with the banner it is not unreasonable to suppose that serious casualties may result. In<br />\nfact, when once a man is thrown<br />\nto the ground in the midst of the<br />\nstruggling mass of fresinnen and<br />\nsophomores, he is indeed lucky<br />\nto be-able to rise before his arms,<br />\nlegs,.face and sundry other portions of his anatomy have been<br />\nnone too gently trod- upon by the<br />\nsurrounding combatants.<br />\nBut to abolish the traditional<br />\nrush would be to destroy one of<br />\nthe oldest of University customs.<br />\nMy plan is merely to change the<br />\nnature of the rush and to so make<br />\ntime contest much safer and considerably more fair, and at the<br />\nsame time detract in no way from<br />\nits proper roughness. I suggest<br />\nthat this system, which is used<br />\nat a limber of large colleges, be<br />\nadopted at Hopkins: A large field<br />\n—about the size and shape of a<br />\nfootball gridiron, for instance—<br />\nis marked with definite boundary<br />\nlines. Time contesting classes line<br />\nup at opposite ends of the field<br />\nand, at the signal, rush toward<br />\neach other. The object, then, is to<br />\nthrow all the opposing class' men<br />\n,out of the field boundaries. The<br />\nclass which accomplishes this is<br />\nclearly the winner; there can thus<br />\nbe no disputes about both classes<br />\npossessing parts of the banner or<br />\nabout the banner's being captured<br />\nafter the final whistle, and so on.<br />\nThe method of branding the men<br />\nwho have been thrown off the field<br />\nand who are therefore ineligible<br />\nfor further fighting, is to neatly<br />\ncoat them with green water-color<br />\npaint. This sort of a rush, I believe, gives each man a chance to<br />\nbe definitely useful in bringing<br />\nvictory to his class. According to<br />\nthe present style of rushes at<br />\nHopkins, more than three-fourths<br />\nof the men do not even get a<br />\n<br />\nthis way the opinion of academic<br />\ncircles throughout the country<br />\nwill be procured. The results will<br />\nbe wired to the committee in New<br />\nYork, and from there will be published as soon as possible. The<br />\nlocal results will be made known<br />\nthe following day.<br />\nThe following is an extract from<br />\na letter to the Editor of THE<br />\n<br />\nNEW S-LETTER:<br />\n\"Experience shows that relatively a small number of people<br />\nhave even read the League of<br />\nNations part of the Peace Treaty,<br />\nlet alone the Treaty as a whole.<br />\nEveryone must agree that it is<br />\nof supreme importance that this<br />\nissue be intelligently discussed by<br />\nthe whole American .public. In<br />\nno centers should .this discussion<br />\nbe more fruitful or valuable than<br />\nin the academic communities. It<br />\nis, therefore, very much to be<br />\nhoped that the utmost discussion<br />\nwill be stimulated,that the student<br />\nbody will'be encouraged to study<br />\nthe matter, to debate it and to<br />\ntalk it over with their friends and<br />\nfamilies at home during the<br />\nChristmas holidays. Then when<br />\nthe academic body reassembles after the holidays, plans should be<br />\nmade to take the vote in a way<br />\nwhich will secure as neftrly as<br />\npossible a complete representation<br />\nof the faculty, on one hand, and<br />\nthe student body on the other.\"<br />\n<br />\nThe action of the leading colleges in organizing a referendum<br />\non the Peace Treaty among the<br />\nstudents of all the universities<br />\nand colleges in the country, deserves a great deal of attention.<br />\nSince Congress completely failed<br />\nto reach a definite decision and<br />\nmerely \"passed the buck\" in regard to the Peace Treaty, it is<br />\nup to the individual citizens in<br />\nthis country to express their<br />\nopinion.<br />\nWe college students, from whom<br />\nthe future professional and business men of the country will for<br />\nthe most part be drawn, should<br />\nAn \"IF\" for Contribs.<br />\nhave a particularly large share in If you can sling a line like J. M.<br />\ninfluencing public opinion. We<br />\nBarrie,<br />\nAnd fool the Campus with a line of<br />\nare, or should be, well informed in<br />\ntime history of the world in gen- *If youguff;<br />\ncan think of puns like the old<br />\neral and of our own country in<br />\nHarry,<br />\nparticular. We are, presumably,<br />\nAnd make us take an interest in your<br />\nstuff;<br />\ninterested in and informed conIf<br />\nyou<br />\ncan get the point that you are<br />\nOur<br />\nevents.<br />\ncurrent<br />\ncerning<br />\nafter<br />\nknowledge of political economy,<br />\nAnd yet not plagiarize some other's<br />\nhistory, political science and kin• line,<br />\ndred subjects, together with our If 'you can rouse some ancient prof to<br />\nlaughter<br />\nunprejudiced political opinions,<br />\nAnd send the wrinkles running down<br />\nshould enable us to cast an intellihis spine.<br />\ngent and unbiased ballot.<br />\nyou can be an idiot in thinking<br />\nIn taking this matter up An If Yet<br />\nkeep your sanity in fact the<br />\nconcert with the other colleges,<br />\nwhile,<br />\nTHE NEWS-LETTER wishes to im- If you can preach the happiness of<br />\ndrinking,<br />\npress its readers with the importAnd yet meet Hank and greet him<br />\nance of the decision and the newith a smile,<br />\ncessity for a careful consideration If you can write until your quip's comof the subject. It has endeavored<br />\npleted,<br />\nAnd feel a wholesome joy when it<br />\nto procure some well-known men<br />\nIs done,<br />\nto express their views upon the Then take<br />\nyour \"Prince\" and find the<br />\nTreaty before the student body,<br />\n. point deleted,<br />\nbut the time, before and after the<br />\nYet write again, you'll get Job's job,<br />\nmy son.<br />\nChristmas vacation, is. far too<br />\n<br />\nQUACKS FROM A QUACK<br />\n• Boys, as long as Christmas isn't<br />\nvery far off, I Won't say anything<br />\nmean about my friends in this issue because, as you all doubtless<br />\nnoticed, thy pedal extremities<br />\n. need recovering. But shoes ain't<br />\nthe only things that would come in<br />\nhandy right now. Just the other<br />\nday Dr. Hulburt said to me,<br />\n\"Which would you'rather have,<br />\nGeorge a ton of coal or a bottle<br />\nof Old Rock Rye?\" \"I burns<br />\nwood, Boss,\" I told him, \"I burns<br />\nwood.\" There's a gentle hint for<br />\nsome of the quality folks to take<br />\nto heart; of course, I don't expect nothing from the codfish aristocracy.<br />\nBut to change the subject, this<br />\nthing of the fellers having to wear<br />\nI heir Sunday-go-to-meeting overcoats with their uniforms isn't<br />\nanything like as bad as the poor<br />\nchap Dr.- French tells about who<br />\nwas traveling through Europe in<br />\ntime garbage of a monk.<br />\nAnd speaking of clothing, they<br />\ntell me that after time \"rush\" one<br />\nof the sophomores returned home<br />\nwearing , a sweet smile. Pretty<br />\nchilly for that kind of raiment,<br />\ndon't you say so?<br />\nAgain to change time subject.<br />\nCome with me, gentle readers, to<br />\nthe basement of the M. E. Building. The scene is supposed to represent a chem. lab. in full blast.<br />\nOver there hear the hood stands<br />\nDr. Gilpin with his right-hand<br />\nman, Freshman Gwyn. A large<br />\ncrowd is gathered to absorb the<br />\ngolden words as they drop from<br />\nthe mouth of the learned one.<br />\n\"Gentlemen,\" says the professor,<br />\n\"if anything should happen to go<br />\nwrong with this experiment the<br />\nlaboratory and I would be blown<br />\nto kingdom come. • Stand close, in<br />\norder that you may follow me.\"<br />\nEverything nowadays is spoken<br />\nof in automobile terms. If you<br />\nwant a prof to move a trifle swifter in the course of the lecture, you<br />\ntell hini to tread on it, and if the<br />\nprof wants you to make a little<br />\nlesa noise talking on the back row<br />\nhe entreats you to close your cutout. The other day I heard someone address Harry Morris with<br />\nthese words:\"That was a new girl<br />\nI saw you with last Sunday,<br />\nwasn't it, Harry?\" \"No,\" Harry<br />\nreplied, \"that was only last year's<br />\npainted up.\" I guess I'll put on<br />\ntime brake now, because you know<br />\nI'm a member of the union labor,<br />\nif you please, and it's quitting<br />\ntime. But don't forget to tell<br />\nSanta Claus to rerhember your<br />\nold Uncle George, and what a<br />\nfaithful janitor he has been.<br />\nglimpse of the banner during the<br />\ncontest, and therefore fight aimlessly and half-heartedly on the<br />\nedge of the struggling edge of students. Furthermore, less risk of<br />\ninjury would be incurred by men<br />\nparticipating in the sort of rush<br />\nwhich I advocate, because bunch(Continued on pace 7, col. 2)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\n<br />\n5<br />\n<br />\nJUDGE NILES MAKES ADDRESS<br />\nAdvocates Single Tax Before Social<br />\nScience Club.<br />\n<br />\nA good guess for<br />\nyou would be—<br />\n<br />\nlarirtu<br />\nTgrattb<br />\nCo:tilts<br />\n—There's style<br />\nto them<br />\n<br />\nflub<br />\nBaltimore, Charles and Fayette<br />\n<br />\n— AMUSEMENTS —<br />\n<br />\nAUDITORIUM<br />\nShubert- Attractions<br />\nMats. Thurs.,. Fri. and Sat.<br />\nTonight at 8:15<br />\nSpecially Chosen Xmas Attraction.<br />\nArthur Hammerstein's<br />\nMerry, Melodious, Musical Romance<br />\n<br />\n“Sorne 'Time\"<br />\nBy Ricia Johnson. Young.<br />\nRudolf Friml.<br />\n<br />\nMusic by<br />\n<br />\nWith<br />\n<br />\nFRANK TINNEY<br />\nand Supporting Cast.<br />\nChorus of Brilliance and Merit.<br />\n39 Weeks at Casino Theatre, N. Y.<br />\nMon., Tues., Wed. Eves., 50c to $2.00<br />\nXmas, Fri., and Sat. Eves., 50c to $2.50<br />\nMats. Thurs., Fri. & Sat., 50c to $1.50<br />\nNext Week—Seats Tomorrow.<br />\n\"SHUBERT GAIETIES OF 1919.\" '<br />\n<br />\nLatin Teacher—The tenses .of<br />\nverbs expressing prohibition must<br />\nnot be past.<br />\nSleepy One (who has heard only<br />\nlast five words)—And I thought<br />\nhe was a temperate man.—Ex.<br />\n<br />\nJudge Alfred S. Niles, in addressing the third meeting of the<br />\nSocial Science Club on \"Single<br />\nTax,\" said that the single-taxer<br />\nbelieves that it is °Lily fair. that<br />\nthe money for the support of the<br />\ncommunity should be derived from<br />\nthe values that the community as<br />\na whole creates. The greater part<br />\nof these values are those created<br />\nin land, in the form of unearned<br />\nincrement and economic rent. This<br />\neconomic rent is the tribute that<br />\nmust be paid before capital and<br />\nlabor can begin to work, and co<br />\nital and labor share what is left<br />\nafter rent is taken out.<br />\nLand increases in value as people move near it and as industries, schools, churches, stores,<br />\netc., are established near it. It<br />\nis not fair to tax the improvements<br />\nthat cause the land about them<br />\nto increase in value, but the land<br />\nwhose value is increased should<br />\nbe taxed on the basis of its increased value. It should be taxed<br />\nirrespective of the improvements<br />\nupon it. The single tax will make<br />\nit unprofitable to hold land out of<br />\nuse<br />\nuse, to get the unearned increment<br />\nland. of<br />\nAll the canons of -taxation are<br />\n.confirmed to by the single tax:<br />\n(1) It is economical and easy of<br />\ncollection; a tax on land values<br />\ncannot be shifted in the easy way<br />\na tax on manufactures and imports can. (2) It is certain, land<br />\nis not easily concealed, but personal property is. (3) It is equal<br />\nfor all, in that each pays according to what lie gets from the corntriunity. (4) It is free from any<br />\nharmful effects upon production.<br />\nAs it is at present we relieve factories, shops, etc., from taxation<br />\nin order to get them. The single<br />\ntax would not impose upon the<br />\nman who wants to-build a factory<br />\nand incidentally benefit the community.<br />\nThe main argument against<br />\nsingle tax is. conservatism. \"It<br />\nisn't the way we've been doing.\"<br />\nBut it has been tried successfully<br />\nin New.Zealand, Western Canada,<br />\nScranton and Pittsburgh. Wh6re<br />\nthe single tax has once been tried,<br />\nthe old system of taxation has<br />\nnever been zone back to.<br />\nJudge Niles' talk was based<br />\nlargely<br />\non Henry George's \"Prog,-,<br />\n<br />\nTHE \"PLYMOUTH\" OVERCOAT<br />\nIn brown and green mixtures; with naval muff pockets<br />\nand tailored lower pockets; extra-large convertible<br />\ncollar.<br />\n<br />\nAla/hoc/ma,.irc-bilde<br />\nPROMOTION MANAGER<br />\nA University student with energy and business<br />\nability to assist in securing boys for Summer Camp.<br />\n'Excellent opportunity for wide awake man. Minimum compensation is $500. For information address Director's Office, Lake Placid Camp, 27 Ware<br />\nStreet, Cambridge, Mass.<br />\n<br />\nVIRGINIA HOLDS BACK<br />\nDebating Council Delayed in Arranging<br />\nContest—Freshman-Sophomore<br />\nDebate Planned.<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nLefranc & Ault<br />\n421 N. Noward St.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br />\n<br />\nLuncheon<br />\n<br />\nAfternoon Tea<br />\n<br />\nMUSIC<br />\nThe attention of the Debating SODAS AND SUNDAES<br />\nCouncil until recently has been<br />\nfully occupied with trying to determine more satisfactory arrangements for the inter-collegiate<br />\n1 W. UNIVERSITY PARKWAY<br />\ntriangle debate with North CaroOPPOSITE J. H. U. ATHLETIC FIELD<br />\nlina and Virginia. Virginia seems<br />\nto be the disturbing factor, since-S<br />\nshe is dissatisfied with past con- Drug Store for J. H. U. Boys<br />\nditions and rather hard to please<br />\nPHONE HOMEWOOD 2121<br />\nin forming new rules for the conduct and judging of these traditional contests. Unless some Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nagreement ,is reached very shortly, the council will probably negotiate with North Carolina to<br />\ndrop Virginia from the triangle<br />\nand substitute Washington and<br />\nLee. This step, however, will only<br />\nMADE TO ORDER<br />\nbe taken after careful consideration,,for tradition has made the<br />\nAND<br />\nannual Hopkins-Virginia debate<br />\nalmost a permanent fixture.<br />\nFINISHED CLOTHES<br />\nThe- council also decided in its<br />\nlast meeting to start the debating<br />\nPLAZA BUILDING<br />\nball rolling by arranging for the<br />\nfreshman-sophomore contest. It 19 AND 21 EAST FAYETTE STREET<br />\nwas decided that the subject under discussion should be: \"Resolved, that the city manager plan<br />\nORTMAN'S<br />\nshould be adopted in Baltimore.\"<br />\n\"Queen<br />\nQuality\" Home-Made Candies<br />\nThe debate will probably take<br />\n80c. a pound<br />\nplace the second or third week in<br />\nJanuary.<br />\nVISIT OUR ICE CREAM PARLORS<br />\n<br />\nR.G.LOY & COMPANY<br />\n<br />\nLEMMERT<br />\n<br />\nress and Poverty,\" a book which<br />\nlie said should make a profound<br />\nimpression upon anyone who reads<br />\nit.<br />\nEconomic rent is all right and<br />\nhas to be, but it is now paid to<br />\n(Continued on page 8, col. I)<br />\n<br />\n227 N. HOWARD STREET<br />\n<br />\nARTISTIC<br />\n<br />\nPHOTOGRAPHS<br />\n<br />\nIlgenfritz<br />\n319 North Charles Street<br />\nSPECIAL DISCOUNT TO I. H.U. STUDENT.)<br />\n<br />\nROBERT PAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br />\n<br />\nORCHESTRA DE LUXE<br />\n<br />\nCharles and Lafayette Ave.<br />\n<br />\n524 N. Charles St.<br />\n<br />\n/v\\US1C<br />\nTELEPHONE. GILMOR 2929<br />\n<br />\nTHE ARCADE<br />\nTEA R 00P\\<br />\n<br />\nFOR DANCES, RECEPTIONS, ETC.<br />\nRESIDENCE, 614 FULTON AVENUE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\n<br />\n6<br />\n<br />\nSale Deposit and Crust<br />\nCompany of Baltimore<br />\n<br />\nCapital, $600,000<br />\nSurplus and Profits, $2,750,000<br />\n<br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent for Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository under plans of reorganization.<br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, Attorney and<br />\nAgent, being especially organized for careful management and settlement of estates<br />\nof every character.<br />\nOne-story fireproof building, with latest and best equipment for safety • of<br />\ncontents.<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welllighted coupon rooms for use of patrons.<br />\nSecurities held on deposit for Gut-of-Town Corporations and persons.<br />\n<br />\nTHE TURKISH<br />\n<br />\nH. WALTERS, Chairman of Board.<br />\n<br />\nMURADS<br />\n<br />\n13 SOUTH STREET<br />\n<br />\nare as different from<br />\n<br />\nordinary cigarettes as morning is from<br />\nmidnight.<br />\nIf you want to economize you'd better do<br />\nit in some other way than by smoking cheap<br />\ncigarettes.<br />\nThe trifling additional cost of Murads will<br />\nbring bigger returns in Quality than any investment you ever made.<br />\nBecause Murads are<br />\nI00\" PURE TURKISH—THE WORLD'S MOST<br />\nFAMOUS TOBACCO FOR CIGARETTES.<br />\n<br />\nJOHN J. NELL1GAN, Pres.<br />\n<br />\nJ. W. BREEDLOVE & CO.<br />\nWilbur F. Parker<br />\n<br />\nCarl H. Nocke<br />\n<br />\nMerchant Tailors<br />\nGAITHER BUILDIt G, 111 N. CHARLES ST.<br />\nPhone St. Paul 2625<br />\n<br />\nFine Goods at Moderate Prices<br />\n<br />\nWAGNER'S<br />\n<br />\nTRAYER'S<br />\nSBusiness<br />\nColleae<br />\n<br />\nIncorporated<br />\n<br />\nCharles andyayette Sts., Baltimore, Md.<br />\nA distinctive business school<br />\nDay and night<br />\nclasses now open. You are cotdiaily invited to<br />\ncall and talk with us.Phone St. Paul 6626.<br />\n<br />\nCORONA<br />\nThe Persotud II'citing 11,1riehirte<br />\n<br />\n. .. very<br />\n• • • best<br />\n<br />\nJudge for<br />\nyourself—.<br />\n<br />\nJOHN W. MARSHALL, Vice-Pros.<br />\n<br />\nCANNED FOODS<br />\n,111111211111111i<br />\n<br />\nSo light you can hold in<br />\none hand but heavy<br />\nenough for the hardest<br />\nkind of work.<br />\nLet us prove it here in<br />\nour office.<br />\n<br />\nM. W. LUCY & CO.<br />\n.4gents<br />\n<br />\n118 NV. Fayette St.<br />\n<br />\nanal<br />\nFORM FIT<br />\n<br />\nBERWICK — 24 in.<br />\nGORDON—<br />\n<br />\nRROW<br />\nA<br />\n5rnigitCOLLARS<br />\n<br />\ncurve cut toftshoulders pej-ice .<br />\nCLUETT,PEABODY &COIINC%liters<br />\n<br />\nBACON DRUG STORE<br />\nCalvert and Thirtieth Sts.<br />\nAllows J. H.U.students special discounts<br />\n<br />\nCollege Text-Books SECaDjDNUN D<br />\n<br />\nSMITH'S BOOK STORE<br />\n805 N. HOWARD ST.<br />\n2 Doors Above Madison<br />\nAgent for the Harvard Loose-Leaf Note Book<br />\n<br />\nORGANIZATION MEE rING HELD<br />\n(Continuedfrom page I)<br />\n<br />\nMr. Murphy spoke of the'financial success of the football season<br />\nand promised all possible aid in<br />\nequipping the lacrosse team. He<br />\nmade clear his position in regard<br />\nto lacrosse, which was somewhat<br />\n• a<br />\n\\\\\\,‘<br />\nMr.<br />\nmisunderstood last year.<br />\nMurphy is heartily in favor of<br />\n,Alakars gethe Ilgitcs! elide Turkish<br />\nlacrosse at Hopkins and wishes<br />\nand bripdan Cigarettes the<br />\nHopkins to urge its adoption as a<br />\nmajor sport as at other colleges.<br />\nInstructor (to Class)—HereTwo hundred and eleven men,<br />\nDr. \"Eddie\" Hulburt, another<br />\na record number, entered the after, all students will please former star, reminded the meeting<br />\nYale undergraduate tennis tour- \"park\" their gum outside before of the advantages derived from<br />\nclass.—Ex.<br />\nnament.<br />\n\\.\\,::\\\\\\,<br />\n<br />\n•<br />\n<br />\na<br />\n<br />\n20<br />\nCents<br />\n<br />\nthe nearness of the field, which<br />\nwould somewhat compensate the<br />\nsquad for the loss of the cage. He<br />\nalso told how Reaney Wolfe had<br />\nbeen persuaded to coach the Hopkins lacrosse team for another<br />\nyear, despite his plea of business<br />\nties.<br />\nCoach Wolfe, well known and<br />\nbeloved by all lacrosse men, outlined the plans for the coming<br />\nyear, gave words of reassurance<br />\nto the new men by emphasizing<br />\nthe fact that experience is not<br />\nnecessary in making the 'Varsity<br />\nand commented favorably upon<br />\nthe corps of assistants, both of<br />\nlast year and this.<br />\nAnd last, but not least, \"Bill\"<br />\nSchrneissdr, \"father of lacrosse,\"<br />\ngave the meeting a short talk.<br />\n\"Father Bill\" is president of the<br />\nIntercollegiate Lacrosse Board,<br />\nand for many years has been an<br />\nadvisory coach at Hopkins. He<br />\ntalked of the \"old days,\" when<br />\nHopkins was about the only college in this country with a lacrosse team; told of the beating<br />\nwe gave 'the Crescents in 1901<br />\nand again in 1919. and closed with<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\nCHESS CLUB PLANS MATCHES<br />\nTeam Will Probably Consist of Saiontz<br />\nZubin, and Taylor.<br />\n<br />\nSatisfies the national<br />\ndemand for a wholesome, pure and appetizing beverage—at the<br />\nsoda fountain or with<br />\n<br />\nPlans for holding chess matches with the University of Pennsylvania and two other leading<br />\nEastern colleges are being made<br />\nby the executive committee of the<br />\nHopkins Chess Club. This committee, consisting of R. L. Saiontz,<br />\nKurrelmeyer, and Levin, was appointed by temporary chairman J.<br />\nZubin at the first formal meeting of the club, Tuesday, December 9.<br />\nThe team which will represent<br />\nHopkins in these inter-collegiate<br />\ncontests will be selected at the<br />\nclose of the undergraduate chess<br />\ntournament now in progress. It is<br />\nTHE<br />\nn<br />\nprobable that this team will inleM7<br />\nclude R. L. Saiontz, J. Zubin, and<br />\nIC. R. Taylor, all of whom have<br />\nCollar Hug Clothes<br />\nhad some considerable experience<br />\nBaltimore dill Iihe_r_p/Streets<br />\nas chess players.<br />\nTwenty-seven students have entered the chess tournament and<br />\nthus far five games have been<br />\nplayed with the following results:<br />\nR. L. Saiontz defeated Kurrelmeyer, Shaw, awl Douglas, and<br />\nFor nten Who<br />\nKurrelmeyer also won from Shaw<br />\nand Douglas. The other entrants<br />\nThink<br />\nare: M. B. Essers, P. C. Williams,<br />\nFeder, Yursick, Bowen, Cohen, C.<br />\nB. Saiontz, Hettleman, Zubin,<br />\nFeldman, Shortess, ben, Mallalieu, Taylor, Falkoff, M. Levin, P.<br />\n8 E. Baltimore St.<br />\nLevin, Schiayo, Latanel, Kabinofsky, Cromwell, B. S. Levin, and<br />\nD. T. Rosenthal.<br />\nhi the future, regular meetings<br />\nwill be held on Friday morning<br />\nStationers Engravers Printers<br />\nat 10.30 in one of Dr. Dunlap's<br />\nrooms on the fourth floor of Gil- Fountain Pens<br />\nI. P. Note Books<br />\nman Hall. The executive commit- 229<br />\nPark Avenue - Baltimore<br />\ntee has charge of the purchasing<br />\nof the necessary chessmen and<br />\nchecker boards. To pay for this<br />\nequipment. each member will be<br />\nassessed a proportionate amount.<br />\nTemporary chairman Zubin, in<br />\noutlining the plans of the club,<br />\nextended an invitation to all<br />\nstudents, with or without a knowledge of the game; to become members of the organization. He<br />\nfurther said that the chess club<br />\nhoped to revive the old interest<br />\nin the game and to thus make it<br />\npossible for Hopkins to maintain The Chas. Willms Surgical<br />\nInstrument Co.<br />\na representative team. The chair300 N. Howard St., Baltimore, Md.<br />\nman expressed the opinion that if<br />\nSURGICAL INSTRUMENTS<br />\n‘sufficient enthusiasm was shown<br />\nHospital, Invalid and Microscopic<br />\nby the club 'Members, the Student<br />\nSupplies.<br />\nCouncil would provide the money<br />\nORTHOPEDIC APPLIANCES.<br />\nto §pnd a tearti to play matches at<br />\nCollege and Fraternity Stationery<br />\nother colleges. Mr. Zubin also<br />\nstated that an effort would be Banquet and Dance Cards—Invitations<br />\nmade to have some of the counJAS. H. DOWNS<br />\ntry's best chess players speak beENGRAVER — PRINTER — STATIONER<br />\nfore the club during the year.<br />\n<br />\nDistinction in Style<br />\n<br />\nUALITY SHOP<br />\n<br />\nBevo will more than<br />\nsatisfy your thirst.<br />\n<br />\nHESS SHOES<br />\n<br />\nN. HESS' SONS<br />\n<br />\nJ. H.SAUMENIG & CO.<br />\n<br />\n• Visitors to St.Louis aro invitod<br />\n<br />\nto inspoct this mammoth institution.<br />\n-<br />\n<br />\na word of praise for last year's<br />\ncoaches.<br />\nThe schedule is as follows:<br />\nApril 3—Cornell.<br />\nApril 10—Alumni.<br />\nApril 17—Harvard.<br />\nApril 24—Yale at New -Haven.<br />\nMay 1—Open.<br />\nMay 8—S wa r thin ore at<br />\nSwarthmore.<br />\nMay 15—Stevens.<br />\nMay 22-1'enn at Philadelphia.<br />\nMay 29—Lehigh.<br />\nNot fixed—Crescents.<br />\nPrinceton and Yale athletic<br />\ncommittees have voted to grant<br />\ntheir tennis players a major letter,<br />\nprovided plans for an inter-collegiate league.are successful. Harvard, Pennsylvania and Cornell,<br />\nthe other colleges which have been<br />\nproposed as members, have yet to<br />\ndetermine their stand in the recognition of the game.<br />\n<br />\nTHE NEWS-LEI TEK'S MAILBAG<br />\n<br />\n(Continuedfrom page 4)<br />\n<br />\nlug, and the consequent trampling<br />\nupon fallen men,would be avoided.<br />\nPerhaps it seems foolish for one<br />\nto write on the highly enlightening subject of class rushes, but<br />\nnevertheless the purpose of such<br />\nrushes is far more deeply seated<br />\nthan the chance observer of the<br />\nbattling freshmen and sophomores<br />\nwould at once imagine. In the<br />\ninterests of safety and fairness,<br />\nthen, it seems to me that it would<br />\nbe well for the persons in authority to alter the nature of the anN. M<br />\nnual class rushes.<br />\n<br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br />\n<br />\nE. E. ADAMS<br />\n<br />\n229 N. Charles Street<br />\n<br />\nCollars—Dozens of Styles—and Other Furnishings<br />\n<br />\nTHE STORE HUTZLER 131QTI1EIt5 E<br />\n<br />\nHoward Street<br />\nNear Saratoga<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER<br />\n<br />\n6<br />\n<br />\nStreet Car Proverbs.<br />\nHe who spreads himself out<br />\n(Continued from page 5)<br />\nacross the aisle shall be humbled,<br />\nthe wrong people. The single- and he who strives to make room<br />\ntaxer does not intend to take from for'all shall be exalted.<br />\nBlessed be he who giveth up his<br />\na man alL the upearned increunto a lady, but scorned shall<br />\nseat<br />\nment in a lump sum, but by taxes<br />\nfellow who hideth behind<br />\nthe<br />\nbe<br />\nhe proposes to make the holding<br />\nout of use of land or natural his newspaper.<br />\nHe that standeth upon the platmonopolies an unprofitable thing.<br />\nand emitteth poison gas from<br />\nform<br />\n\"The single tax should be introduced gradually,\" said Judge a noxious weed is an abomination<br />\nNiles, \"in order that no hardships unto his fellow passengers.<br />\nThe wrath of many who wait<br />\nmay be placed upon land owners.\"<br />\nA 5 per cent. decrease for 20 years shall descend upon the head of<br />\non the taxes upon improvements him who hath not his fare ready.<br />\nA wise one is he who goeth foron land would introduce the single<br />\ntax; or a 2 per cent. decrease for ward in the car, for he shall be<br />\n50 years would do it perhaps as rewarded with a seat.<br />\nAnd he that standeth in the<br />\nwell. The thing for us to do is<br />\nto educate ourselves and other aisle, blocking the passage of other<br />\npeople into time frame of mind in patrons, shall merit the disdain of<br />\nwhich all will be ready to attack his fellows.<br />\nBlessed are those who hand<br />\nthe problem of unwilling poverty<br />\nand to introduce the single tax, transfers unfolded, for by such is<br />\nif that still seems to be a remedy, the service improved.—Reading<br />\nas Judge Niles believes it will be. (Pa.) Railway Bulletin.<br />\nJUDGE NILES MAKES ADDRESS<br />\n<br />\n10TIOTJOTfOg0::<br />\n0::0::0::0::0=foltoga-g0::0::0::0::0::0:fortog0::0::0:--x<br />\n0::0::011<br />\n<br />\nYou can't see a Show by reading the Program<br />\nNeither can you tell the quality of our garments<br />\nby reading this ad. Let us show you!<br />\n<br />\n$32 and up<br />\n<br />\nTATe<br />\n<br />\nClothes of Custom Quality<br />\n1411V. CHARLES ST.<br />\n<br />\nOPONOE:OrfOr:OrPOCOMONOCOROLEtOHONOCOC301301710M0E0t Icit0A0g0A0ifORIOrg<br />\nCOME<br />\n<br />\nTO<br />\n<br />\nNorthinitaitrr Prtghgtrriatt<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass<br />\nin front of door)<br />\n<br />\nServices, 11 A. M. and R P.M.<br />\nMen's Bible Class. 9.45 A. M.<br />\n<br />\nCORDIAL WELCOME<br />\nTO ALL STUDENTS<br />\n<br />\nRev. David Carson Bayless<br />\nMinister<br />\n<br />\nThe Men of johns Hopkins University Are Most Cordially Invited to Attend the Services t<br />\n<br />\n(Starr &<br />\n<br />\ntirtrt'ti Epirirnpal<br />\n<br />\nMONUMENT ST. AND PARK AVE.<br />\nII The services on Sunday are at I I o'clock and 8 o'clock<br />\nSeats will<br />\nreserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege be<br />\nof having you associated with us in our worship, and we hope that the benefit may be<br />\nreciprocal.<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\n23, 1919.<br />\n<br />\n1<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE<br />\n<br />\nBOOK<br />\n<br />\nMART)<br />\n<br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br />\nIMPORTERS AND DEALERS IN<br />\nFINE BOOKS<br />\n<br />\n1111[111 1<br />\nMARK<br />\n<br />\n.',111 111111111<br />\n<br />\n1 11111 '11,<br />\n<br />\n-„„„,<br />\n11<br />\n11111iIIIII<br />\n<br />\nI<br />\n<br />\nIN<br />\n'1'11Iluill7<br />\n,111,<br />\n1,<br />\nI<br />\n<br />\n,111<br />\n<br />\nThe<br />\nNorman Remington Col<br />\n<br />\n,111,17.<br />\n<br />\n11 1111111111;1'1;1 1111<br />\n1111111<br />\n11 '1.11,11111<br />\n<br />\n,1<br />\n<br />\nSTREET<br />\n<br />\nBaltimore, Md.<br />\n<br />\n1...,1111111111liii 110,111 JIL11<br />\nj1111.li 1l 1111 1 111 kr,' HI<br />\n<br />\nh<br />\n<br />\nN. CHARLES<br />\n<br />\n30<br />\nill<br />\n<br />\n\\I<br />\n<br />\nBOOKS<br />\n<br />\nI '<br />\n1111<br />\n<br />\n•••••••<br />\n<br />\nYou're Interested In<br />\nEvery Student Should Own<br />\n<br />\n`MOW'<br />\n<br />\nSend Your Name for Monthly List<br />\n<br />\nCharles Street, at Mulberry<br />\n<br />\nJ. H. FURST CO.<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br />\n<br />\nON'T take a fellow's pipe. Take some other possession.<br />\nBecause wrapped up in his pipe is a 'fellow's peace of<br />\nmind, his relaxation, his contentment. This is more than<br />\ntrue if it's aWDC Pipe, because then a good smoke is multiplied many times over. Our special seasoning process takes<br />\ncare of this by bringing out all the sweetness and mellowness<br />\nof the genuine French briar. Just you go to any good dealer<br />\nand select several good shapes. Put them in your rack.<br />\nSmoke a cool one every time, and you'll be well on your<br />\nway to pipe-happiness.<br />\n<br />\nD<br />\n<br />\nWm. DEMUTH 8c CO., NEW YORK<br />\nWORLD'S<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\nLARGEST<br />\n<br />\nPIPE<br />\n<br />\nMANUFACTURERS<br />\n<br />\n1 1 1<br />\n<br />\n11<br />\n<br />\n1<br />\n<br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\" -Modern Language Notes,\"\"Maryland Historical Magazine,\" \"University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br />\n<br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages<br />\n<br />\nWyman's<br />\nMen's<br />\nShoes<br />\n19 Lexington St.<br />\n<br />\nThe Largest &<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\nSole Agent for<br />\nthe Johnston &<br />\nMurphy Shoes.<br />\n<br />\n\f", "format": "basic_html", "processed": "crrri<br /><br />\nJLEES \"EIS MEStgATI<br /><br />\nVOL. XXIV, NO. 11.<br /><br />\nBALTIMORE, MD., DECEMBER 23, 1919.<br /><br />\nr<br /><br />\nPRICE, FIVE CENTS<br /><br />\nREFERENDUM ON TREATY<br /><br />\nMURPHY TO REPRESENT HOPKINS<br /><br />\nPUBLIC INITIATION HELD<br /><br />\nORGANIZATION MEETING HELD<br /><br />\nMass-meeting on Jan. 8—Study Treaty<br /><br />\nMany Famous Men to Speak at National<br /><br />\nDuring Holidays.<br /><br />\nCollegiate Athletic Convention.<br /><br />\nNine New Men Taken Into Honorary<br />\nFraternity—Announcements Made.<br /><br />\nMany Ex-Lacrosse Players Address Candidates Good Schedule Procured.<br /><br />\nA mass-meeting has been ar\"Bobby\" Hoffman opened the<br />\nAt the annual meeting of the<br />\nThe lacrosse organization meetranged by THE NEWS-LETTER, in National Collegiate Athletic As- meeting by protesting against the ing was held last Wednesday<br />\nco-operation with the Y. M. C. A., sociation, to be held in New York unrestrained way in which the in the Mechanical<br />\nfor Thursday, January 8, at which December 30, Johns Hopkins will walks have been decorated with Building at 4.30 P. Engineering<br />\nM. The meettwo prominent men will discuss be represented by Athletic Direc- numerous 22's and 23's. He ing was attended by<br />\na<br />\nthe Peace Treaty and League of tor R. B. Murphy as the accredit- warned that unless these works of and enthusiastic audience, large<br />\namong<br />\nNations Covenant from different ed delegate and probably several art were speedily erased something which were many of our former<br />\nangles.<br />\nmembers of the 'Varsity Club as stronger than a protest from the crack lacrosse men now lending<br />\nIn the, meantime it is hoped visiting delegates.<br />\nStudent Council would be forth- their hearty support in the buildthat every student will endeavor<br />\nThe association held its first coming. Then the list of the win- ing up of a championship team.<br />\nto study the Treaty and the Cove- meeting in 1905, and was com- ners of the \"H\" in football was<br />\nThe •meeting was opened by<br />\nnant during the holidays, so that posed of representatives appoint- read. Those who won their \"H\" Capt. \"Ferdie\" Meyer, who<br />\nmade<br />\nhe will be in a position to give ed by the presidents of the col- are: Captain Jones, ,Calkins, a brief statement as to<br />\nthe pres• an intelligent vote on January 13, leges in the United States. The Tome, Hoffman, Barchet, Cashell, ent difficulties which<br />\nbeset the<br />\nTHE NEWS-LETTER Would be glad purpose of the organization is to W. WOod,-E. Wood,Watson, Eger- team by the loss of the cage, but<br />\nto receive any letters upon this promote clean sports, act as ar- ton. Landy and Randall. \"H. A. maintained, as did all<br />\nfollowing<br />\nsubject for the Mail Bag from bitrators in matters of great im- A.'s\" were awarded to Dodson, speakers, that the misfortune<br />\nmembers of the faculty, students portance to athletics, and to keep Cromwell, Barrett, Butler, Ow- could • be overcome by hard and<br />\nor from such outsiders as might the rules of all college sports up ings, chas, Morgan and Reed. persevering work on Homewood<br />\nbe interested. Such letters should to date.<br />\nManager Evans received his \"H. Field.<br />\nbe addressed to the \"Manager of<br />\nAt the afternoon session the Nu, •<br />\nHe then introduced successively<br />\nTreaty Referendum, Johns Hop- presidential address will be deliv\"Charlie\" Leber then put in a • Goalkeeper Daugherty—\"the nidn<br />\nkins University, Baltimore, Md.\" ere(l by Lieut.-Col. Palmer E. word for the Dramatic Club. He I with the iron gut\"—and \"Shorty\"<br />\nIn co-operation with the Com- Pierce, U. S. A., and will sum up stated that reserve seats are now Defandorf. Both of these<br />\nmen<br />\nmittee on Intercollegiate Treaty the work accomplished by the as- on sale and requested every fresh- emphasized their love for the<br />\nReferendum, THE NEWS - LETTER sociation during the year. It is man to bring his girl.<br />\ngame, the good fellowship which<br />\nhas arranged to have a ballot on expected that the Hon. Newton I)<br />\nThe real purpose of the meet- is found on the lacrosse field and<br />\nTuesday, January 13, on the fol- Baker Secretary of War, will ing, however, was the public initi- the comradeship which links the<br />\nlowing six propositions:<br />\nmake'<br />\nthe keynote of the conven- ation of the new members to the players and coaches.<br />\n1. I favor the ratification of tion, \"Physical Efficiency as a Na- Omicron Delta Kappa fraternity.<br />\nThe next speaker, a man well<br />\nthe League and Treaty without tional Asset,\" the general subject Dr. French made a short address known at.Hopkins, was<br />\nDi. Aberamendments or reservations.<br />\nof his remarks.<br />\nin which he said that the two out- crombie, who won his lacrosse<br />\n2. I am opposed to the ratifiDr. J. H. McCurdy, of the standing features of American \"II\" in 1898. Dr. Abercrombie<br />\ncation of the League and the Springfield Training School, and college life are democracy and told how lacrosse, while<br />\nfundaTreaty in any form.<br />\nRev. Henry Phillips, chaplain of competition, and that it is these mentally depending on the<br />\n3. I am in favor of the ratifica- the University of the South and two points which this fraternity viduality of the players,<br />\nis suction of the Treaty,and the League, president of the Southern Inter- stands for. It is not an exclusive cessful only when the<br />\nco-ordinabut only with the specific reserva- collegiate Athletic Association, fraternity, where wealth and good tion of this individuality<br />\nis setions as voted by the majority of will also speak along the same looks might count for something, cured in building up a compact<br />\nthe Senate.<br />\ngeneral lines. The opinion of the but membership in it is not gained body. He talked especially to the<br />\n4. I favor any compromise un- business man will be given by Mr. only by those who excel to a very new men, urging them to<br />\ncome<br />\nder reservations which will.make Frank H. Scott, vice-president of marked degree in the different col- out for the team regardless<br />\nof<br />\npossible the immediate ratifica- the Warner-Swasey Company, of lege activities, and it is the high- their lack of experience or phytion of the Treaty and the League. Cleveland. During the war, Mr. est honor to be obtained in the sical ability.<br />\n5. I favor the Government pro- _ Scott was chairman of the Gen- University. The men who have re\"Johnny\" Knipp, a former star<br />\nceeding to make peace with Ger- eral Munition Board, and later of ceived this sought-after distinc- man in laCrosse, followed with a<br />\nmany at once and leaving the the War industries Board.<br />\ntion of merit are: Ferdinand My- few words_ of advice to the new<br />\nquestion of a League of Nations<br />\nCapt. .1. L. Griffith, who was er, John Lewin, Warren Driver, men, emphasizing the need of<br />\nto be settled afterwards.<br />\ninstrumental in seeuring a revi- Millard Foard, George Wagner, hard work and perseverance in or6. I favor a compromise of time sion of the revenue laws affecting Harold Townsend, Graham Hein- der to win distinction in this<br />\nreservations of such a character taxes on, admission to college er, Norman Keyes and George sport. \"Johnny\" sounded the<br />\nas will avoid the danger of de- games, will explain his work for Goetz. After the meeting the pri- watchword of the whole meeting;<br />\nfeating ratification, while still that committee.<br />\nvate initiation was held • at the when he closed with the exhortaDr. R. Tait McKenzie has been Johns Hopkins Club.<br />\nmaking clear that America can<br />\ntion, \"Beat Navy!\"<br />\nonly be involve! in war by a dec- asked to speak on the question of<br />\nMr. Murphy brought the meetNobody but the freshmen could<br />\nlaration of Congress, that domes- encouraging boxing in the col- ing to a close ,with announcements be mistaken in the identity of the<br />\ntic questions and the Monroe Doc- leges. Reports from standing concerning the two winter sports next speaker, when<br />\nhe began with,<br />\ntrine are entirely outside of the committees on football, track, —basket-ball and swimming. The \"Well. I tell you.\" \"Tiff\" Willjurisdiction of the League, that basket-ball, swimming and wres- athle4ic ticket will admit all stu- iams was certainly \"in form,\" but<br />\nplural votes of any member, are tling will also be made.<br />\ndents to the games, and season he claimed he had come to receive<br />\nall disqualified in the event of a<br />\nWith Hopkins coming forward tickets may be obtained for their \"dope,\" not to disseminate it, and<br />\ndispute wherein we are disquali- in athletics, this meeting should sweethearts at the cut price of retired after amusing the audience<br />\nfied from voting, and that on de- be of great interest to the coach $3.rc0 (cash). After receiving the with some of his ever-ready jokes.<br />\nciding to withdraw we are to be and the members of the teams.<br />\nstaggering news that next year<br />\nManager Keyes announced the<br />\nthe judge of whether our obligathe athletic fee will be $15 (again schedule as arranged to date, which<br />\nvote is estimated to be 1,300.<br />\ntions have been met.<br />\ncash), everybody hurried outside will be found at the end of this<br />\nOn the same day every college to get the air.<br />\nThese propositions will be voted<br />\narticle. He also said that pracUpon by the faculty, medical stu- and university in the country will<br />\ntice would be started soon after<br />\ndents, graduates and undergradu- likewise present these propositions<br />\nEven the type feels set up to be the holidays, and urged the men<br />\nates of the University. The sum to their students and faculty. In in the same boat (or is it galley?) to watch for its<br />\nannouncement.<br />\ntotal of the number eligible to<br />\n(Continued on page 4, col. 2)<br />\nwith us.<br />\n(Continued on page 6, col. 3)<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br /><br />\n2<br /><br />\nHarvard, Vale and Columbia<br />\ncontemplating the introducare<br />\nNew Haven, Dec. 17.—By a vote<br />\nof 856 to 841, Yale undergradu- tion of intercollegiate aerial racates, in a straw ballot counted ing as a fixed sport. At a meetlast night, favored discontinuance ing of the Columbia Aero Club,<br />\nof the old Yale song, \"Bright Col- held recently, Major G. D. Lamer,<br />\nlege Years,\" as it has been sung flight commander of the One Hunby Yale men for decades to the dred and Third Aero Squadron,<br />\nGerman tune, \"Die Wacht am A. E. F., was elected president.<br />\nInvitations are soon to be sent to<br />\nRhein.\" s<br />\ncolleges and universities to<br />\nother<br />\nThere were 732 ballots cast on<br />\nintercollegiate aerial asan<br />\njoin<br />\nthe proposition favoring the retention of the words_ of the old sociation designed to govern the<br />\nsong with a neW tune, while 124 sport and to conduct dual and<br />\nvoted for new words and a new general meets between its memtune. The song will not be sung.in bers. The University of Pennsylthe future at undergraduate vania and Johns Hopkins were<br />\ngatherings, according to a decision mentioned as probable members.<br />\n* * *<br />\nof the Student Council.<br />\nBrown tried out pyschologieal<br />\nAt least 5,000 Princeton men entrance exams on the Freshman<br />\nserved in the late world war. Class this year. Candidates for<br />\nThree thousand of them became the various degrees received the<br />\nofficers, including four brigadierfollowing averages: A. B., 73.7;<br />\ngenerals. Two hundred and thirand<br />\nty were decorated for bravery, Ph. B., 68.7; B. S., 66.11;<br />\n65.21.<br />\nstudents.<br />\nspecial<br />\nand 137 were killed.<br />\n•<br /><br />\nOld Yale Song Dropped.<br /><br />\narfrrbrrirk<br /><br />\nilippg To.<br /><br />\nMANUFACTURERS OF<br /><br />\nHIGH GRADE CHOCOLATES.<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br /><br />\nJohn C. Knipp &amp; Sons<br />\nDRAPERIES<br /><br />\nDECORATIONS<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nATTENTION! J. H. U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br /><br />\nPRINTERS<br /><br />\nPUBLISHERS<br /><br />\nM EY-Fad-1ElM ER<br />\nThe Big Stationery Store<br />\n10-12 N. HOWARD STREET<br /><br />\nCommittee Praises Undergraduates—<br />\nExpect to Break Ground For New<br />\nBuilding in the Spring.<br /><br />\nIn an interview with Mr.George<br />\nL. Radcliffe, chairman of the<br />\nDormitory Campaign Committee,•<br />\ngreat satisfaction with the result<br />\nof the drive among the undergraduates was expressed. The<br />\namount given by the four collegiate classes is nearly $15,000. He<br />\nsaid that the spirit shown here<br />\nwill be used as an argument with<br />\nthe alumni for the campaign. Mr.<br />\nRadcliffe believes that the fund<br />\nwill be raised in time to. break<br />\nground for the new building next<br />\nspring. Although the amount subscribed so far is only $114,000, he<br />\nthinks with the returns of classes<br />\nnot yet completely canvassed, and<br />\nsubscriptions from a few men not<br />\nconnected with the University, the<br />\nfund can be raised to the necessary $300,000.<br />\nOf the alumni classes, '00 lends<br />\nin donations with $10,960. The<br />\nclass holding the runner-up position is '03; but since it has a subscription of $5,000 from a nonmember of the class, its position<br />\nis disputed by '92, who has raised<br />\na larger sum from among its members, but whose total does not<br />\nequal that of '03, including the<br />\n$5,000 subscription from an outsider.<br />\nSwimming Team Has Good Practice.<br /><br />\nFURNITURE OF QUALITY<br /><br />\nFURNITURE<br /><br />\nFUND FAR FROM COMPLETE<br /><br />\nBALTIMORE<br /><br />\nAlthough only 14 men were<br />\npresent for, swimming practice<br />\nlast Thursday night at the Baltimore Athletic Club, some very<br />\nfast swimming made up for the<br />\nlack in numbers. Under the direction of Coach Ortland and<br />\nCaptain Hall, the candidates practiced starts and turns, and then<br />\ntried some competition at various<br />\ndistances. The men were divided<br />\ninto groups of three. The winners in the 100-yard dash were:<br />\nBuhrer, Johnston and Henry<br />\nRowland. Davidge Rowland won<br />\nthe 100-yard breast-stroke, while<br />\nHall finished first in the 300<br />\nyards. Buhrer and Johnston, new<br />\nmen on the squad, showed exceptionally good form and gave promise of soon developing into 'Varsity material.<br />\nThe following men were present: Coach Ortland, Captain Hall,<br />\nReins, D. Rowland, H. Rowland,<br />\nBuhrer, Powell, Parsons, Johnston, Call, Lord, Seitz, Kinnamon,<br />\nMarden and Assistant Manager<br />\nMiller.<br />\nManager Gould announces that<br />\nall candidates will be notified<br />\nshortly of practice to take place<br />\nduring the holidays.<br />\nDartmouth started compulsory<br />\nathletics for freshmen this fall.<br />\nGolf, tennis, regular track work<br />\nand hiking are on the list of approved sports.<br /><br />\nJohns Hopkins Press<br />\nI.—American Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLI in progress. $6 per volume. (Foreign postage 50 cts:)<br />\nIL—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors. Quarterly. 8vo.<br />\nVolume XL in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVII in progress.<br />\n$3.50 per volume.<br />\nIV.—Johns Hopkins University Circular<br />\nIncluding Annual Report. Register,<br />\netc. 8vo. Volume XXXVIII in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br />\nVIII.— Modern Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRIJENBAUM, W. KURRELMEYER and H. C. LANCASTER.<br />\nMonthly. 4to. Volume XXXIV in<br />\nprogress. $3 per volume. (Foreign<br />\npostage 50 cts.)<br />\nIX.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXIV in progregs. $3<br />\nper volume. tForeign postage 25 cts.)<br />\nXL—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\nSeries in progress, $2.<br />\nXIL—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nXIII—Elliott Monograph in the Romance<br />\nLanguages and Literatures.<br />\nEDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. Reports of the Maryland Geological Survey.<br />\nE: B. MATHEWS, Editor.<br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of. publications will be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br /><br />\n3<br /><br />\nJudging now by the War facts—<br /><br />\nThe American Smoke<br />\nis a cigarette<br />\nOTonly because they proved<br />\nsuch a necessity with our<br />\nN<br />\nfighting men on land and sea, but<br /><br />\ninent citizens,the cigarette is more<br />\npopular than cigar or pipe and as<br />\nhighly respected as either.<br /><br />\nalso because they are the mildest<br />\nOne cigarette in particularseems,<br />\nform of smoking cigarettes have as the following facts show,to have<br />\nat last come into their own.<br />\nwon a position as America's first<br />\nToday, among young men as choice in smoking, East and West,<br />\nwell as old, plain men and prom- North and South— nation-wide.<br /><br />\n-<br /><br />\nYOUNG MAN<br />\nYour Suit or Overcoat<br />\nwill have those smart dapper kinks if<br />\nit comes:from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br /><br />\nPrices, ;$25.00 to $65.00<br /><br />\nTEWART&amp;G,<br />\nS,<br />\nCOMPerfIon WWI&amp;C,N.<br />\nIn York.<br /><br />\nHOWARD AND LEXINGTON STS.<br /><br />\nTHE HATTERIE<br />\n—and one cigarette in particular:<br />\nAt Washington<br />\nA fact:<br /><br />\n:<br /><br />\nEach day the Nation's capitol secs a new<br />\nthrong of big professional and business'<br />\nmen from every state in the Union. These<br />\nchanging hundreds of men buy more<br />\nFatimas than any other cigarette.<br /><br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of light Street<br /><br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br /><br />\nIn the Army<br />\nA fact:<br /><br />\nAt the big army training camps during the<br />\nwar were thousands of soldiers from each<br />\nState and Territory. At every one of<br />\nthese camps, Fatima was a leader.<br /><br />\nSHIRTS<br /><br />\nIn the Navy<br />\nA fact:<br /><br />\nThe officers in our Navy come, of courLe,<br />\nfrom every part of America. Of all the<br />\ncigarettes sold in Officers' Mess throughout the whole Navy, over 90% arc Fatimas.<br /><br />\nQuality<br /><br />\nWith our NC<br />\nOcean Fliers<br />\nA fact:<br /><br />\nThe 15 American men who flcw en the<br />\nNC-1, NC-3 and NC-4 hailed p,ihcps<br />\nIrons 15 different states. Of the 15, twelve<br />\nchose Fatimas for that long, lonely, daring<br />\nflight.<br /><br />\n)<br /><br />\nEN keep switching<br />\nfrom straight.TurkM<br />\nish cigarettes because they<br /><br />\nFAT<br />\n!<br />\nA Sensible Cioarette<br /><br />\ncontain too much Turkish.<br />\nThey seem over-rich and<br />\nheavy.<br />\nMen keep switching to<br />\nFatimas because Fatimas<br />\ncontain ;rust enoughTurkish<br />\n—just enough to taste right<br />\nand just enough to leave a<br />\nman feeling right, even<br />\nwhen he smokes more<br />\nthan usual.<br />\nAre you smoking too<br />\nmuch Turkish?<br /><br />\nC°.<br /><br />\nr 0611<br />\n:es S``t6<br />\nv. 00<br />\n',<br />\n?1<br />\nNO 1.1.<br />\n30<br />\n10°`<br />\nMerchandise<br />\nHATS<br /><br />\n\"Just enough Turkish\"<br /><br />\nARROW COLLARS<br /><br />\nHOSIERY<br /><br />\nTHE HOSIERY SHOP<br />\n215 N. CHARLES<br />\nST.<br /><br />\n(Baltimore's (Best Shop For<br />\nMen's Sox and Ties.<br />\n75 Cents and Up.<br /><br />\nBOOK BINDING<br />\nJoseph Ruzicka<br />\n106-108 CLAY ST.<br /><br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nti. pkins Seals in Silver and<br />\nGold,<br /><br />\nCollege Jewelry r Specialty<br /><br />\n28 E BALTIMORE STREL<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br /><br />\n4<br /><br />\nshort to allow sufficient public<br />\ndiscussion at the University. It is<br />\nE<br />\ntherefore necessary that every student, during the holidays; en$2.00<br />\nSubscription<br />\ndeavor- to learn as much as posEntered as second-class matter De- sible concerning the matter. Look<br />\ncember 3, 1909, at the Post Office at at the proposition from every<br />\nBaltimore, Md., under Act of Congress,<br />\nangle and, whenever possible, disNovember 3, 1879.<br />\ncuss it.<br />\nPublished weekly, from October to .<br />\nThe referendum will only be a<br />\nJune, by the students of Johns Hopsuccess if supported by every stukins University.<br />\ndent. ALL must vote, and vote<br />\nBusiness communications should be<br />\naddressed to the BUSINESS MANAGER, intelligently.<br /><br />\nfile J01111310.1113ji0W3-[01101<br /><br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should<br />\ne sent to the EDITOR-IN-CHIEF.<br />\nHomewood 100<br />\nTelephcne<br />\nEditor-in-Chief.<br />\nJohn H. Lewin, '20.<br />\nManaging Editor.<br />\nFrederick F. Torsch, '20.<br />\nAssociate Editors.<br />\nJames R. Lornauro, '20.<br />\nyertrees J. Wyckoff, '20.<br />\nMitchell B. Carroll, '20.<br />\nCarroll Stansbury, '21.<br />\nHenry E. Niles, '21.<br />\nLlewellyn W. Lord, '21.<br />\nJunior Editors.<br />\nEdward Huey, '22.<br />\nH. Douglas Cotton, '22.<br />\nBusiness Manager.<br />\nGeorge W. Wagner, '20.<br />\nCirculation Manager.<br />\nHenry H. Morriss, '20.<br />\nAssistant Business Managers.<br />\nVernon E. Stuart, '20.<br />\nGeorge Deichman, '21.<br />\nBALTIMORE, MD.,<br /><br />\nDEC. 23, 1919<br /><br />\nBe Prepared To Vote.<br /><br />\nTHE NEWS-LETTER'S MAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br /><br />\nAll letters intended for publication<br />\nmust be concise.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be printed<br />\nif request is made that they be omitted.<br />\nThe publication of a letter is not to be<br />\ntaken as an indorsement of its views by<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nREFERENDUM ON TREATY<br /><br />\nAdvocates Change in Class Contest.<br />\nTo the Editor of THE'NEWS-LETTER:<br /><br />\n(Continued from page 1)<br /><br />\nSir—Last Saturday it was<br />\nclearly shown that the freshman<br />\nand sophomore classes are becoming too large in numbers to allow<br />\nthe traditional sort of flag rush<br />\nto be carried on safely and fairly. The plan of having but one<br />\nreal point of attack for the sophomores to concentrate upon—namely, the freshman holding the banner—naturally enough causes the<br />\nparticipants to criwd into the<br />\nsmallest possible area. And when<br />\nsome two or three hundred fighting students are tightly bunched<br />\naround the few .men in direct contl:ct with the banner it is not unreasonable to suppose that serious casualties may result. In<br />\nfact, when once a man is thrown<br />\nto the ground in the midst of the<br />\nstruggling mass of fresinnen and<br />\nsophomores, he is indeed lucky<br />\nto be-able to rise before his arms,<br />\nlegs,.face and sundry other portions of his anatomy have been<br />\nnone too gently trod- upon by the<br />\nsurrounding combatants.<br />\nBut to abolish the traditional<br />\nrush would be to destroy one of<br />\nthe oldest of University customs.<br />\nMy plan is merely to change the<br />\nnature of the rush and to so make<br />\ntime contest much safer and considerably more fair, and at the<br />\nsame time detract in no way from<br />\nits proper roughness. I suggest<br />\nthat this system, which is used<br />\nat a limber of large colleges, be<br />\nadopted at Hopkins: A large field<br />\n—about the size and shape of a<br />\nfootball gridiron, for instance—<br />\nis marked with definite boundary<br />\nlines. Time contesting classes line<br />\nup at opposite ends of the field<br />\nand, at the signal, rush toward<br />\neach other. The object, then, is to<br />\nthrow all the opposing class' men<br />\n,out of the field boundaries. The<br />\nclass which accomplishes this is<br />\nclearly the winner; there can thus<br />\nbe no disputes about both classes<br />\npossessing parts of the banner or<br />\nabout the banner's being captured<br />\nafter the final whistle, and so on.<br />\nThe method of branding the men<br />\nwho have been thrown off the field<br />\nand who are therefore ineligible<br />\nfor further fighting, is to neatly<br />\ncoat them with green water-color<br />\npaint. This sort of a rush, I believe, gives each man a chance to<br />\nbe definitely useful in bringing<br />\nvictory to his class. According to<br />\nthe present style of rushes at<br />\nHopkins, more than three-fourths<br />\nof the men do not even get a<br /><br />\nthis way the opinion of academic<br />\ncircles throughout the country<br />\nwill be procured. The results will<br />\nbe wired to the committee in New<br />\nYork, and from there will be published as soon as possible. The<br />\nlocal results will be made known<br />\nthe following day.<br />\nThe following is an extract from<br />\na letter to the Editor of THE<br /><br />\nNEW S-LETTER:<br />\n\"Experience shows that relatively a small number of people<br />\nhave even read the League of<br />\nNations part of the Peace Treaty,<br />\nlet alone the Treaty as a whole.<br />\nEveryone must agree that it is<br />\nof supreme importance that this<br />\nissue be intelligently discussed by<br />\nthe whole American .public. In<br />\nno centers should .this discussion<br />\nbe more fruitful or valuable than<br />\nin the academic communities. It<br />\nis, therefore, very much to be<br />\nhoped that the utmost discussion<br />\nwill be stimulated,that the student<br />\nbody will'be encouraged to study<br />\nthe matter, to debate it and to<br />\ntalk it over with their friends and<br />\nfamilies at home during the<br />\nChristmas holidays. Then when<br />\nthe academic body reassembles after the holidays, plans should be<br />\nmade to take the vote in a way<br />\nwhich will secure as neftrly as<br />\npossible a complete representation<br />\nof the faculty, on one hand, and<br />\nthe student body on the other.\"<br /><br />\nThe action of the leading colleges in organizing a referendum<br />\non the Peace Treaty among the<br />\nstudents of all the universities<br />\nand colleges in the country, deserves a great deal of attention.<br />\nSince Congress completely failed<br />\nto reach a definite decision and<br />\nmerely \"passed the buck\" in regard to the Peace Treaty, it is<br />\nup to the individual citizens in<br />\nthis country to express their<br />\nopinion.<br />\nWe college students, from whom<br />\nthe future professional and business men of the country will for<br />\nthe most part be drawn, should<br />\nAn \"IF\" for Contribs.<br />\nhave a particularly large share in If you can sling a line like J. M.<br />\ninfluencing public opinion. We<br />\nBarrie,<br />\nAnd fool the Campus with a line of<br />\nare, or should be, well informed in<br />\ntime history of the world in gen- *If youguff;<br />\ncan think of puns like the old<br />\neral and of our own country in<br />\nHarry,<br />\nparticular. We are, presumably,<br />\nAnd make us take an interest in your<br />\nstuff;<br />\ninterested in and informed conIf<br />\nyou<br />\ncan get the point that you are<br />\nOur<br />\nevents.<br />\ncurrent<br />\ncerning<br />\nafter<br />\nknowledge of political economy,<br />\nAnd yet not plagiarize some other's<br />\nhistory, political science and kin• line,<br />\ndred subjects, together with our If 'you can rouse some ancient prof to<br />\nlaughter<br />\nunprejudiced political opinions,<br />\nAnd send the wrinkles running down<br />\nshould enable us to cast an intellihis spine.<br />\ngent and unbiased ballot.<br />\nyou can be an idiot in thinking<br />\nIn taking this matter up An If Yet<br />\nkeep your sanity in fact the<br />\nconcert with the other colleges,<br />\nwhile,<br />\nTHE NEWS-LETTER wishes to im- If you can preach the happiness of<br />\ndrinking,<br />\npress its readers with the importAnd yet meet Hank and greet him<br />\nance of the decision and the newith a smile,<br />\ncessity for a careful consideration If you can write until your quip's comof the subject. It has endeavored<br />\npleted,<br />\nAnd feel a wholesome joy when it<br />\nto procure some well-known men<br />\nIs done,<br />\nto express their views upon the Then take<br />\nyour \"Prince\" and find the<br />\nTreaty before the student body,<br />\n. point deleted,<br />\nbut the time, before and after the<br />\nYet write again, you'll get Job's job,<br />\nmy son.<br />\nChristmas vacation, is. far too<br /><br />\nQUACKS FROM A QUACK<br />\n• Boys, as long as Christmas isn't<br />\nvery far off, I Won't say anything<br />\nmean about my friends in this issue because, as you all doubtless<br />\nnoticed, thy pedal extremities<br />\n. need recovering. But shoes ain't<br />\nthe only things that would come in<br />\nhandy right now. Just the other<br />\nday Dr. Hulburt said to me,<br />\n\"Which would you'rather have,<br />\nGeorge a ton of coal or a bottle<br />\nof Old Rock Rye?\" \"I burns<br />\nwood, Boss,\" I told him, \"I burns<br />\nwood.\" There's a gentle hint for<br />\nsome of the quality folks to take<br />\nto heart; of course, I don't expect nothing from the codfish aristocracy.<br />\nBut to change the subject, this<br />\nthing of the fellers having to wear<br />\nI heir Sunday-go-to-meeting overcoats with their uniforms isn't<br />\nanything like as bad as the poor<br />\nchap Dr.- French tells about who<br />\nwas traveling through Europe in<br />\ntime garbage of a monk.<br />\nAnd speaking of clothing, they<br />\ntell me that after time \"rush\" one<br />\nof the sophomores returned home<br />\nwearing , a sweet smile. Pretty<br />\nchilly for that kind of raiment,<br />\ndon't you say so?<br />\nAgain to change time subject.<br />\nCome with me, gentle readers, to<br />\nthe basement of the M. E. Building. The scene is supposed to represent a chem. lab. in full blast.<br />\nOver there hear the hood stands<br />\nDr. Gilpin with his right-hand<br />\nman, Freshman Gwyn. A large<br />\ncrowd is gathered to absorb the<br />\ngolden words as they drop from<br />\nthe mouth of the learned one.<br />\n\"Gentlemen,\" says the professor,<br />\n\"if anything should happen to go<br />\nwrong with this experiment the<br />\nlaboratory and I would be blown<br />\nto kingdom come. • Stand close, in<br />\norder that you may follow me.\"<br />\nEverything nowadays is spoken<br />\nof in automobile terms. If you<br />\nwant a prof to move a trifle swifter in the course of the lecture, you<br />\ntell hini to tread on it, and if the<br />\nprof wants you to make a little<br />\nlesa noise talking on the back row<br />\nhe entreats you to close your cutout. The other day I heard someone address Harry Morris with<br />\nthese words:\"That was a new girl<br />\nI saw you with last Sunday,<br />\nwasn't it, Harry?\" \"No,\" Harry<br />\nreplied, \"that was only last year's<br />\npainted up.\" I guess I'll put on<br />\ntime brake now, because you know<br />\nI'm a member of the union labor,<br />\nif you please, and it's quitting<br />\ntime. But don't forget to tell<br />\nSanta Claus to rerhember your<br />\nold Uncle George, and what a<br />\nfaithful janitor he has been.<br />\nglimpse of the banner during the<br />\ncontest, and therefore fight aimlessly and half-heartedly on the<br />\nedge of the struggling edge of students. Furthermore, less risk of<br />\ninjury would be incurred by men<br />\nparticipating in the sort of rush<br />\nwhich I advocate, because bunch(Continued on pace 7, col. 2)<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br /><br />\n5<br /><br />\nJUDGE NILES MAKES ADDRESS<br />\nAdvocates Single Tax Before Social<br />\nScience Club.<br /><br />\nA good guess for<br />\nyou would be—<br /><br />\nlarirtu<br />\nTgrattb<br />\nCo:tilts<br />\n—There's style<br />\nto them<br /><br />\nflub<br />\nBaltimore, Charles and Fayette<br /><br />\n— AMUSEMENTS —<br /><br />\nAUDITORIUM<br />\nShubert- Attractions<br />\nMats. Thurs.,. Fri. and Sat.<br />\nTonight at 8:15<br />\nSpecially Chosen Xmas Attraction.<br />\nArthur Hammerstein's<br />\nMerry, Melodious, Musical Romance<br /><br />\n“Sorne 'Time\"<br />\nBy Ricia Johnson. Young.<br />\nRudolf Friml.<br /><br />\nMusic by<br /><br />\nWith<br /><br />\nFRANK TINNEY<br />\nand Supporting Cast.<br />\nChorus of Brilliance and Merit.<br />\n39 Weeks at Casino Theatre, N. Y.<br />\nMon., Tues., Wed. Eves., 50c to $2.00<br />\nXmas, Fri., and Sat. Eves., 50c to $2.50<br />\nMats. Thurs., Fri. &amp; Sat., 50c to $1.50<br />\nNext Week—Seats Tomorrow.<br />\n\"SHUBERT GAIETIES OF 1919.\" '<br /><br />\nLatin Teacher—The tenses .of<br />\nverbs expressing prohibition must<br />\nnot be past.<br />\nSleepy One (who has heard only<br />\nlast five words)—And I thought<br />\nhe was a temperate man.—Ex.<br /><br />\nJudge Alfred S. Niles, in addressing the third meeting of the<br />\nSocial Science Club on \"Single<br />\nTax,\" said that the single-taxer<br />\nbelieves that it is °Lily fair. that<br />\nthe money for the support of the<br />\ncommunity should be derived from<br />\nthe values that the community as<br />\na whole creates. The greater part<br />\nof these values are those created<br />\nin land, in the form of unearned<br />\nincrement and economic rent. This<br />\neconomic rent is the tribute that<br />\nmust be paid before capital and<br />\nlabor can begin to work, and co<br />\nital and labor share what is left<br />\nafter rent is taken out.<br />\nLand increases in value as people move near it and as industries, schools, churches, stores,<br />\netc., are established near it. It<br />\nis not fair to tax the improvements<br />\nthat cause the land about them<br />\nto increase in value, but the land<br />\nwhose value is increased should<br />\nbe taxed on the basis of its increased value. It should be taxed<br />\nirrespective of the improvements<br />\nupon it. The single tax will make<br />\nit unprofitable to hold land out of<br />\nuse<br />\nuse, to get the unearned increment<br />\nland. of<br />\nAll the canons of -taxation are<br />\n.confirmed to by the single tax:<br />\n(1) It is economical and easy of<br />\ncollection; a tax on land values<br />\ncannot be shifted in the easy way<br />\na tax on manufactures and imports can. (2) It is certain, land<br />\nis not easily concealed, but personal property is. (3) It is equal<br />\nfor all, in that each pays according to what lie gets from the corntriunity. (4) It is free from any<br />\nharmful effects upon production.<br />\nAs it is at present we relieve factories, shops, etc., from taxation<br />\nin order to get them. The single<br />\ntax would not impose upon the<br />\nman who wants to-build a factory<br />\nand incidentally benefit the community.<br />\nThe main argument against<br />\nsingle tax is. conservatism. \"It<br />\nisn't the way we've been doing.\"<br />\nBut it has been tried successfully<br />\nin New.Zealand, Western Canada,<br />\nScranton and Pittsburgh. Wh6re<br />\nthe single tax has once been tried,<br />\nthe old system of taxation has<br />\nnever been zone back to.<br />\nJudge Niles' talk was based<br />\nlargely<br />\non Henry George's \"Prog,-,<br /><br />\nTHE \"PLYMOUTH\" OVERCOAT<br />\nIn brown and green mixtures; with naval muff pockets<br />\nand tailored lower pockets; extra-large convertible<br />\ncollar.<br /><br />\nAla/hoc/ma,.irc-bilde<br />\nPROMOTION MANAGER<br />\nA University student with energy and business<br />\nability to assist in securing boys for Summer Camp.<br />\n'Excellent opportunity for wide awake man. Minimum compensation is $500. For information address Director's Office, Lake Placid Camp, 27 Ware<br />\nStreet, Cambridge, Mass.<br /><br />\nVIRGINIA HOLDS BACK<br />\nDebating Council Delayed in Arranging<br />\nContest—Freshman-Sophomore<br />\nDebate Planned.<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nLefranc &amp; Ault<br />\n421 N. Noward St.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br /><br />\nLuncheon<br /><br />\nAfternoon Tea<br /><br />\nMUSIC<br />\nThe attention of the Debating SODAS AND SUNDAES<br />\nCouncil until recently has been<br />\nfully occupied with trying to determine more satisfactory arrangements for the inter-collegiate<br />\n1 W. UNIVERSITY PARKWAY<br />\ntriangle debate with North CaroOPPOSITE J. H. U. ATHLETIC FIELD<br />\nlina and Virginia. Virginia seems<br />\nto be the disturbing factor, since-S<br />\nshe is dissatisfied with past con- Drug Store for J. H. U. Boys<br />\nditions and rather hard to please<br />\nPHONE HOMEWOOD 2121<br />\nin forming new rules for the conduct and judging of these traditional contests. Unless some Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nagreement ,is reached very shortly, the council will probably negotiate with North Carolina to<br />\ndrop Virginia from the triangle<br />\nand substitute Washington and<br />\nLee. This step, however, will only<br />\nMADE TO ORDER<br />\nbe taken after careful consideration,,for tradition has made the<br />\nAND<br />\nannual Hopkins-Virginia debate<br />\nalmost a permanent fixture.<br />\nFINISHED CLOTHES<br />\nThe- council also decided in its<br />\nlast meeting to start the debating<br />\nPLAZA BUILDING<br />\nball rolling by arranging for the<br />\nfreshman-sophomore contest. It 19 AND 21 EAST FAYETTE STREET<br />\nwas decided that the subject under discussion should be: \"Resolved, that the city manager plan<br />\nORTMAN'S<br />\nshould be adopted in Baltimore.\"<br />\n\"Queen<br />\nQuality\" Home-Made Candies<br />\nThe debate will probably take<br />\n80c. a pound<br />\nplace the second or third week in<br />\nJanuary.<br />\nVISIT OUR ICE CREAM PARLORS<br /><br />\nR.G.LOY &amp; COMPANY<br /><br />\nLEMMERT<br /><br />\nress and Poverty,\" a book which<br />\nlie said should make a profound<br />\nimpression upon anyone who reads<br />\nit.<br />\nEconomic rent is all right and<br />\nhas to be, but it is now paid to<br />\n(Continued on page 8, col. I)<br /><br />\n227 N. HOWARD STREET<br /><br />\nARTISTIC<br /><br />\nPHOTOGRAPHS<br /><br />\nIlgenfritz<br />\n319 North Charles Street<br />\nSPECIAL DISCOUNT TO I. H.U. STUDENT.)<br /><br />\nROBERT PAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br /><br />\nORCHESTRA DE LUXE<br /><br />\nCharles and Lafayette Ave.<br /><br />\n524 N. Charles St.<br /><br />\n/v\\US1C<br />\nTELEPHONE. GILMOR 2929<br /><br />\nTHE ARCADE<br />\nTEA R 00P\\<br /><br />\nFOR DANCES, RECEPTIONS, ETC.<br />\nRESIDENCE, 614 FULTON AVENUE<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br /><br />\n6<br /><br />\nSale Deposit and Crust<br />\nCompany of Baltimore<br /><br />\nCapital, $600,000<br />\nSurplus and Profits, $2,750,000<br /><br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent for Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository under plans of reorganization.<br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, Attorney and<br />\nAgent, being especially organized for careful management and settlement of estates<br />\nof every character.<br />\nOne-story fireproof building, with latest and best equipment for safety • of<br />\ncontents.<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welllighted coupon rooms for use of patrons.<br />\nSecurities held on deposit for Gut-of-Town Corporations and persons.<br /><br />\nTHE TURKISH<br /><br />\nH. WALTERS, Chairman of Board.<br /><br />\nMURADS<br /><br />\n13 SOUTH STREET<br /><br />\nare as different from<br /><br />\nordinary cigarettes as morning is from<br />\nmidnight.<br />\nIf you want to economize you'd better do<br />\nit in some other way than by smoking cheap<br />\ncigarettes.<br />\nThe trifling additional cost of Murads will<br />\nbring bigger returns in Quality than any investment you ever made.<br />\nBecause Murads are<br />\nI00\" PURE TURKISH—THE WORLD'S MOST<br />\nFAMOUS TOBACCO FOR CIGARETTES.<br /><br />\nJOHN J. NELL1GAN, Pres.<br /><br />\nJ. W. BREEDLOVE &amp; CO.<br />\nWilbur F. Parker<br /><br />\nCarl H. Nocke<br /><br />\nMerchant Tailors<br />\nGAITHER BUILDIt G, 111 N. CHARLES ST.<br />\nPhone St. Paul 2625<br /><br />\nFine Goods at Moderate Prices<br /><br />\nWAGNER'S<br /><br />\nTRAYER'S<br />\nSBusiness<br />\nColleae<br /><br />\nIncorporated<br /><br />\nCharles andyayette Sts., Baltimore, Md.<br />\nA distinctive business school<br />\nDay and night<br />\nclasses now open. You are cotdiaily invited to<br />\ncall and talk with us.Phone St. Paul 6626.<br /><br />\nCORONA<br />\nThe Persotud II'citing 11,1riehirte<br /><br />\n. .. very<br />\n• • • best<br /><br />\nJudge for<br />\nyourself—.<br /><br />\nJOHN W. MARSHALL, Vice-Pros.<br /><br />\nCANNED FOODS<br />\n,111111211111111i<br /><br />\nSo light you can hold in<br />\none hand but heavy<br />\nenough for the hardest<br />\nkind of work.<br />\nLet us prove it here in<br />\nour office.<br /><br />\nM. W. LUCY &amp; CO.<br />\n.4gents<br /><br />\n118 NV. Fayette St.<br /><br />\nanal<br />\nFORM FIT<br /><br />\nBERWICK — 24 in.<br />\nGORDON—<br /><br />\nRROW<br />\nA<br />\n5rnigitCOLLARS<br /><br />\ncurve cut toftshoulders pej-ice .<br />\nCLUETT,PEABODY &amp;COIINC%liters<br /><br />\nBACON DRUG STORE<br />\nCalvert and Thirtieth Sts.<br />\nAllows J. H.U.students special discounts<br /><br />\nCollege Text-Books SECaDjDNUN D<br /><br />\nSMITH'S BOOK STORE<br />\n805 N. HOWARD ST.<br />\n2 Doors Above Madison<br />\nAgent for the Harvard Loose-Leaf Note Book<br /><br />\nORGANIZATION MEE rING HELD<br />\n(Continuedfrom page I)<br /><br />\nMr. Murphy spoke of the'financial success of the football season<br />\nand promised all possible aid in<br />\nequipping the lacrosse team. He<br />\nmade clear his position in regard<br />\nto lacrosse, which was somewhat<br />\n• a<br />\n\\\\\\,‘<br />\nMr.<br />\nmisunderstood last year.<br />\nMurphy is heartily in favor of<br />\n,Alakars gethe Ilgitcs! elide Turkish<br />\nlacrosse at Hopkins and wishes<br />\nand bripdan Cigarettes the<br />\nHopkins to urge its adoption as a<br />\nmajor sport as at other colleges.<br />\nInstructor (to Class)—HereTwo hundred and eleven men,<br />\nDr. \"Eddie\" Hulburt, another<br />\na record number, entered the after, all students will please former star, reminded the meeting<br />\nYale undergraduate tennis tour- \"park\" their gum outside before of the advantages derived from<br />\nclass.—Ex.<br />\nnament.<br />\n\\.\\,::\\\\\\,<br /><br />\n•<br /><br />\na<br /><br />\n20<br />\nCents<br /><br />\nthe nearness of the field, which<br />\nwould somewhat compensate the<br />\nsquad for the loss of the cage. He<br />\nalso told how Reaney Wolfe had<br />\nbeen persuaded to coach the Hopkins lacrosse team for another<br />\nyear, despite his plea of business<br />\nties.<br />\nCoach Wolfe, well known and<br />\nbeloved by all lacrosse men, outlined the plans for the coming<br />\nyear, gave words of reassurance<br />\nto the new men by emphasizing<br />\nthe fact that experience is not<br />\nnecessary in making the 'Varsity<br />\nand commented favorably upon<br />\nthe corps of assistants, both of<br />\nlast year and this.<br />\nAnd last, but not least, \"Bill\"<br />\nSchrneissdr, \"father of lacrosse,\"<br />\ngave the meeting a short talk.<br />\n\"Father Bill\" is president of the<br />\nIntercollegiate Lacrosse Board,<br />\nand for many years has been an<br />\nadvisory coach at Hopkins. He<br />\ntalked of the \"old days,\" when<br />\nHopkins was about the only college in this country with a lacrosse team; told of the beating<br />\nwe gave 'the Crescents in 1901<br />\nand again in 1919. and closed with<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 23, 1919.<br />\nCHESS CLUB PLANS MATCHES<br />\nTeam Will Probably Consist of Saiontz<br />\nZubin, and Taylor.<br /><br />\nSatisfies the national<br />\ndemand for a wholesome, pure and appetizing beverage—at the<br />\nsoda fountain or with<br /><br />\nPlans for holding chess matches with the University of Pennsylvania and two other leading<br />\nEastern colleges are being made<br />\nby the executive committee of the<br />\nHopkins Chess Club. This committee, consisting of R. L. Saiontz,<br />\nKurrelmeyer, and Levin, was appointed by temporary chairman J.<br />\nZubin at the first formal meeting of the club, Tuesday, December 9.<br />\nThe team which will represent<br />\nHopkins in these inter-collegiate<br />\ncontests will be selected at the<br />\nclose of the undergraduate chess<br />\ntournament now in progress. It is<br />\nTHE<br />\nn<br />\nprobable that this team will inleM7<br />\nclude R. L. Saiontz, J. Zubin, and<br />\nIC. R. Taylor, all of whom have<br />\nCollar Hug Clothes<br />\nhad some considerable experience<br />\nBaltimore dill Iihe_r_p/Streets<br />\nas chess players.<br />\nTwenty-seven students have entered the chess tournament and<br />\nthus far five games have been<br />\nplayed with the following results:<br />\nR. L. Saiontz defeated Kurrelmeyer, Shaw, awl Douglas, and<br />\nFor nten Who<br />\nKurrelmeyer also won from Shaw<br />\nand Douglas. The other entrants<br />\nThink<br />\nare: M. B. Essers, P. C. Williams,<br />\nFeder, Yursick, Bowen, Cohen, C.<br />\nB. Saiontz, Hettleman, Zubin,<br />\nFeldman, Shortess, ben, Mallalieu, Taylor, Falkoff, M. Levin, P.<br />\n8 E. Baltimore St.<br />\nLevin, Schiayo, Latanel, Kabinofsky, Cromwell, B. S. Levin, and<br />\nD. T. Rosenthal.<br />\nhi the future, regular meetings<br />\nwill be held on Friday morning<br />\nStationers Engravers Printers<br />\nat 10.30 in one of Dr. Dunlap's<br />\nrooms on the fourth floor of Gil- Fountain Pens<br />\nI. P. Note Books<br />\nman Hall. The executive commit- 229<br />\nPark Avenue - Baltimore<br />\ntee has charge of the purchasing<br />\nof the necessary chessmen and<br />\nchecker boards. To pay for this<br />\nequipment. each member will be<br />\nassessed a proportionate amount.<br />\nTemporary chairman Zubin, in<br />\noutlining the plans of the club,<br />\nextended an invitation to all<br />\nstudents, with or without a knowledge of the game; to become members of the organization. He<br />\nfurther said that the chess club<br />\nhoped to revive the old interest<br />\nin the game and to thus make it<br />\npossible for Hopkins to maintain The Chas. Willms Surgical<br />\nInstrument Co.<br />\na representative team. The chair300 N. Howard St., Baltimore, Md.<br />\nman expressed the opinion that if<br />\nSURGICAL INSTRUMENTS<br />\n‘sufficient enthusiasm was shown<br />\nHospital, Invalid and Microscopic<br />\nby the club 'Members, the Student<br />\nSupplies.<br />\nCouncil would provide the money<br />\nORTHOPEDIC APPLIANCES.<br />\nto §pnd a tearti to play matches at<br />\nCollege and Fraternity Stationery<br />\nother colleges. Mr. Zubin also<br />\nstated that an effort would be Banquet and Dance Cards—Invitations<br />\nmade to have some of the counJAS. H. DOWNS<br />\ntry's best chess players speak beENGRAVER — PRINTER — STATIONER<br />\nfore the club during the year.<br /><br />\nDistinction in Style<br /><br />\nUALITY SHOP<br /><br />\nBevo will more than<br />\nsatisfy your thirst.<br /><br />\nHESS SHOES<br /><br />\nN. HESS' SONS<br /><br />\nJ. H.SAUMENIG &amp; CO.<br /><br />\n• Visitors to St.Louis aro invitod<br /><br />\nto inspoct this mammoth institution.<br />\n-<br /><br />\na word of praise for last year's<br />\ncoaches.<br />\nThe schedule is as follows:<br />\nApril 3—Cornell.<br />\nApril 10—Alumni.<br />\nApril 17—Harvard.<br />\nApril 24—Yale at New -Haven.<br />\nMay 1—Open.<br />\nMay 8—S wa r thin ore at<br />\nSwarthmore.<br />\nMay 15—Stevens.<br />\nMay 22-1'enn at Philadelphia.<br />\nMay 29—Lehigh.<br />\nNot fixed—Crescents.<br />\nPrinceton and Yale athletic<br />\ncommittees have voted to grant<br />\ntheir tennis players a major letter,<br />\nprovided plans for an inter-collegiate league.are successful. Harvard, Pennsylvania and Cornell,<br />\nthe other colleges which have been<br />\nproposed as members, have yet to<br />\ndetermine their stand in the recognition of the game.<br /><br />\nTHE NEWS-LEI TEK'S MAILBAG<br /><br />\n(Continuedfrom page 4)<br /><br />\nlug, and the consequent trampling<br />\nupon fallen men,would be avoided.<br />\nPerhaps it seems foolish for one<br />\nto write on the highly enlightening subject of class rushes, but<br />\nnevertheless the purpose of such<br />\nrushes is far more deeply seated<br />\nthan the chance observer of the<br />\nbattling freshmen and sophomores<br />\nwould at once imagine. In the<br />\ninterests of safety and fairness,<br />\nthen, it seems to me that it would<br />\nbe well for the persons in authority to alter the nature of the anN. M<br />\nnual class rushes.<br /><br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br /><br />\nE. E. ADAMS<br /><br />\n229 N. Charles Street<br /><br />\nCollars—Dozens of Styles—and Other Furnishings<br /><br />\nTHE STORE HUTZLER 131QTI1EIt5 E<br /><br />\nHoward Street<br />\nNear Saratoga<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER<br /><br />\n6<br /><br />\nStreet Car Proverbs.<br />\nHe who spreads himself out<br />\n(Continued from page 5)<br />\nacross the aisle shall be humbled,<br />\nthe wrong people. The single- and he who strives to make room<br />\ntaxer does not intend to take from for'all shall be exalted.<br />\nBlessed be he who giveth up his<br />\na man alL the upearned increunto a lady, but scorned shall<br />\nseat<br />\nment in a lump sum, but by taxes<br />\nfellow who hideth behind<br />\nthe<br />\nbe<br />\nhe proposes to make the holding<br />\nout of use of land or natural his newspaper.<br />\nHe that standeth upon the platmonopolies an unprofitable thing.<br />\nand emitteth poison gas from<br />\nform<br />\n\"The single tax should be introduced gradually,\" said Judge a noxious weed is an abomination<br />\nNiles, \"in order that no hardships unto his fellow passengers.<br />\nThe wrath of many who wait<br />\nmay be placed upon land owners.\"<br />\nA 5 per cent. decrease for 20 years shall descend upon the head of<br />\non the taxes upon improvements him who hath not his fare ready.<br />\nA wise one is he who goeth foron land would introduce the single<br />\ntax; or a 2 per cent. decrease for ward in the car, for he shall be<br />\n50 years would do it perhaps as rewarded with a seat.<br />\nAnd he that standeth in the<br />\nwell. The thing for us to do is<br />\nto educate ourselves and other aisle, blocking the passage of other<br />\npeople into time frame of mind in patrons, shall merit the disdain of<br />\nwhich all will be ready to attack his fellows.<br />\nBlessed are those who hand<br />\nthe problem of unwilling poverty<br />\nand to introduce the single tax, transfers unfolded, for by such is<br />\nif that still seems to be a remedy, the service improved.—Reading<br />\nas Judge Niles believes it will be. (Pa.) Railway Bulletin.<br />\nJUDGE NILES MAKES ADDRESS<br /><br />\n10TIOTJOTfOg0::<br />\n0::0::0::0::0=foltoga-g0::0::0::0::0::0:fortog0::0::0:--x<br />\n0::0::011<br /><br />\nYou can't see a Show by reading the Program<br />\nNeither can you tell the quality of our garments<br />\nby reading this ad. Let us show you!<br /><br />\n$32 and up<br /><br />\nTATe<br /><br />\nClothes of Custom Quality<br />\n1411V. CHARLES ST.<br /><br />\nOPONOE:OrfOr:OrPOCOMONOCOROLEtOHONOCOC301301710M0E0t Icit0A0g0A0ifORIOrg<br />\nCOME<br /><br />\nTO<br /><br />\nNorthinitaitrr Prtghgtrriatt<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass<br />\nin front of door)<br /><br />\nServices, 11 A. M. and R P.M.<br />\nMen's Bible Class. 9.45 A. M.<br /><br />\nCORDIAL WELCOME<br />\nTO ALL STUDENTS<br /><br />\nRev. David Carson Bayless<br />\nMinister<br /><br />\nThe Men of johns Hopkins University Are Most Cordially Invited to Attend the Services t<br /><br />\n(Starr &amp;<br /><br />\ntirtrt'ti Epirirnpal<br /><br />\nMONUMENT ST. AND PARK AVE.<br />\nII The services on Sunday are at I I o'clock and 8 o'clock<br />\nSeats will<br />\nreserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege be<br />\nof having you associated with us in our worship, and we hope that the benefit may be<br />\nreciprocal.<br /><br />\n1<br /><br />\n1<br /><br />\n23, 1919.<br /><br />\n1<br /><br />\nThe Medical Standard Book Co.<br />\n(THE<br /><br />\nBOOK<br /><br />\nMART)<br /><br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br />\nIMPORTERS AND DEALERS IN<br />\nFINE BOOKS<br /><br />\n1111[111 1<br />\nMARK<br /><br />\n.',111 111111111<br /><br />\n1 11111 '11,<br /><br />\n-„„„,<br />\n11<br />\n11111iIIIII<br /><br />\nI<br /><br />\nIN<br />\n'1'11Iluill7<br />\n,111,<br />\n1,<br />\nI<br /><br />\n,111<br /><br />\nThe<br />\nNorman Remington Col<br /><br />\n,111,17.<br /><br />\n11 1111111111;1'1;1 1111<br />\n1111111<br />\n11 '1.11,11111<br /><br />\n,1<br /><br />\nSTREET<br /><br />\nBaltimore, Md.<br /><br />\n1...,1111111111liii 110,111 JIL11<br />\nj1111.li 1l 1111 1 111 kr,' HI<br /><br />\nh<br /><br />\nN. CHARLES<br /><br />\n30<br />\nill<br /><br />\n\\I<br /><br />\nBOOKS<br /><br />\nI '<br />\n1111<br /><br />\n•••••••<br /><br />\nYou're Interested In<br />\nEvery Student Should Own<br /><br />\n`MOW'<br /><br />\nSend Your Name for Monthly List<br /><br />\nCharles Street, at Mulberry<br /><br />\nJ. H. FURST CO.<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br /><br />\nON'T take a fellow's pipe. Take some other possession.<br />\nBecause wrapped up in his pipe is a 'fellow's peace of<br />\nmind, his relaxation, his contentment. This is more than<br />\ntrue if it's aWDC Pipe, because then a good smoke is multiplied many times over. Our special seasoning process takes<br />\ncare of this by bringing out all the sweetness and mellowness<br />\nof the genuine French briar. Just you go to any good dealer<br />\nand select several good shapes. Put them in your rack.<br />\nSmoke a cool one every time, and you'll be well on your<br />\nway to pipe-happiness.<br /><br />\nD<br /><br />\nWm. DEMUTH 8c CO., NEW YORK<br />\nWORLD'S<br /><br />\n1<br /><br />\n1<br /><br />\nLARGEST<br /><br />\nPIPE<br /><br />\nMANUFACTURERS<br /><br />\n1 1 1<br /><br />\n11<br /><br />\n1<br /><br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\" -Modern Language Notes,\"\"Maryland Historical Magazine,\" \"University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br /><br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages<br /><br />\nWyman's<br />\nMen's<br />\nShoes<br />\n19 Lexington St.<br /><br />\nThe Largest &amp;<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\nSole Agent for<br />\nthe Johnston &amp;<br />\nMurphy Shoes.<br /><br />"}], "field_media_file": [{"target_id": 37431, "display": null, "description": null, "target_type": "file", "target_uuid": "ffa16d89-4763-4945-be3a-25e8215b0abc", "url": "http://digital.library.jhu.edu/system/files/2022-03/12905-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12905, "target_type": "node", "target_uuid": "88f65b1b-e9f7-4a4d-9721-7e2a4020ca16", "url": "/node/12905"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c06b69e4-3c35-4488-bcc4-a90b29926263"}]}