{"mid": [{"value": 38145}], "uuid": [{"value": "13daefc3-dc82-4836-b2ba-05b79fde45db"}], "vid": [{"value": 38145}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12714-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "art<br />\non<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\n10011tts<br />\n<br />\nteam,<br />\ntitles,<br />\n.ce In<br />\n<br />\nBarnstormers<br />\nDecide On'Once<br />\nIn A Life Time'<br />\n<br />\niedule<br />\n<br />\nRally — Thursday Eve.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br />\n<br />\nrOLUME XLI, No. 6<br />\n<br />\nuted<br />\n<br />\nNriusrffirtirr<br />\n<br />\nAttend Barnstormer<br />\n<br />\nGlee Club Practices<br />\nTunes For First Concert<br />\nIn its preparations for the coming season, the Johns Hopkins<br />\nGlee Club has been practicing several selections.<br />\nThese include Shenandoah, a<br />\ntraditional chanty, freely arranged by Marshall Bartholomew; and<br />\nThe Lord's Prayer, music by Albert<br />\nHay Molotte and arranged by Carl<br />\nDeis.<br />\nTuesday night rehearsals are<br />\nheld for first and second tenors;<br />\nThursday night rehearsals, for first<br />\nand second bass voices.<br />\nThe first Music Club concert is<br />\nscheduled for the early part of December.<br />\n<br />\nSmall Fly Disobeys Menders<br />\nLaws; Cousin Of Drosophila<br />\n)Kept In Sterilized Glass Vials And Fed Mushrooms And<br />\nYeast So As To \"Eat, Grow Fat, And Reproduce\"<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n'Stormers To Hold Rally<br />\nIn Playshop Thursday<br />\nThe annual Barnstormer's rally<br />\nwill be held on Thursday evening,<br />\nOctober 22, in the Playshop. The<br />\nentire 'student body is invited to<br />\nattend.<br />\nThere will be plenty of talks,<br />\n,skits, and fun. John E. Desch, the<br />\n'Stormers new coach will be introduced, and Barnstormer comedians<br />\nwill perform.<br />\nAll students interested in any<br />\nbranch of dramatics work are urged to attend the rally.<br />\n<br />\nCampus Straw<br />\nVote Conducted<br />\nBy News-Letter<br />\n<br />\nBy Morris A. Wessel<br />\n'Ballots<br />\nNow that all of the Biology 1C<br />\nBeing<br />\nBut in Sciara, there is a sexual difPlaced<br />\nondistudents are struggling with their ference. The female fly behaves in perIn<br />\nPost<br />\nOffice<br />\nconfruit flies and attempting to uncover fectly normal Mendelian fashion,<br />\nBoxes Today<br />\nrulars<br />\nthe mysteries of their life history, this transmitting the characters which she<br />\npense<br />\nNews-Letter reporter decided to inves- received from both parents. Then male<br />\ntigate another fly, known as Sciara, a however, transmits only those charand<br />\ndistant cousin of the Biology 1C Droc- acters which he received from his<br />\nophila melanogaster. In Gilman Hall, mother. .<br />\nTo Be Part<br />\nSatire On Hollywood Among<br />\nLet us take the example of curly<br />\na building which houses representatives of many different fields of wings. Suppose that a normal female<br />\nNational<br />\nPoll Of<br />\nTen Best Of<br />\nknowledge, there is a carefully cared was crossed to a curly winged male,<br />\nCampuses<br />\nIts Season<br />\nfor society of these flies.. In fact which had received this character<br />\nthey are kept in sterilized bottles, from his father, all of the offspring<br />\nBallots in the NEWS-LETTER'S straw<br />\nThe selection of Once in a Lifetime,<br />\ngrown on sterile agar cultures, and would be normal; that is, have straight<br />\nvote of the campus on the coming<br />\nthe Hollywood satire by George S.<br />\nfed mushroom and yeast mixtures. wings.<br />\nTO THE<br />\nt(aufman and Moss Hart, as this seapresideatitl elect:on will be found<br />\nUnder the watchful and scientific eyes<br />\nMonosexual Progeny<br />\nkon's first Barnstormer production,<br />\nof Dr. Charles W. Metz, Professor of<br />\nAnother peculiar thing about cerwith today's issue. —They resemble<br />\nwas announced yesterday by Marty<br />\nAt Homewood the bona filk ha:lots of this state,\"<br />\nCytology, Miss Helen Crouse, Re- tain species of Sciara, for example Branches<br />\nLevine, president of the campus thessearch Assistant, Miss Gene Coul- in Sciara copraphila, all of the offFall $71,000 Under Esti- and are to be filled in and returned by<br />\npian organization.<br />\nThis year, as you are probably bourne, and one ambitions NYA as- spring from one female are either all<br />\nmated Figures<br />\nWedne:-day cv nn: at the latest. The<br />\n\"We have piced, I think, one of aware, the Hullabaloo has embarked sistant, Sciara are given every op- male, or all female. Under the Mendelballot bo:: is to be lec-if ed just outside<br />\nthe cleverest comedies produced on<br />\nportunity to \"eat, grow fat, and re- ian Laws, the proportion should be<br />\nupon a new financial plan. This pro,Income<br />\nproduce.\"<br />\napproximately a one-to-one ration.<br />\nOf<br />\nroadway in recent years,\" said LevUniversity the Post (JIi,2ii G1ci in Hall, and will<br />\nne. \"Once in a Lifetime enjoyed a cedure has been undertaken with sevEspecially interesting are these orDoes Not Follow Mendels Laws<br />\nbe opc n until<br />\non Wednesday.<br />\nAlso<br />\nHere is the reason for all this atten- ganisms to Dr. Metz from the cytolhenomenal run in New York several eral aims in view: first with the aim<br />\nluacer.zate In Past<br />\nUnexpectedly<br />\nears ago, showing for 305 consecu- of making the Hullabaloo a financially tion. Sciara is one of the few organ- ogical point of view, as they provide<br />\n--- •<br />\nAlthough the Johns Hopkins stutive performances in the Music Box solvent activity, second, with the aim isms which does not follow the Men- excellent material for the study of<br />\nFinancial conditions of The Johns derr.s and lacur4 have<br />\ndelian Laws of heridity. However, this salivary gland chromosmal structure.<br />\nnever yet<br />\n!Theatre.\"<br />\nof enlarging and elaborating the many<br />\nHopkins<br />\nUniversity have taken a<br />\nlarval<br />\nIn<br />\nthe<br />\nstage,<br />\nchromosomes<br />\nthese<br />\nthey<br />\nmean<br />\nnot<br />\nin<br />\ndoes<br />\nthat<br />\nway<br />\nany<br />\nr..'<br />\nI<br />\ncc<br />\nThe Kaufman-Hart play was placed<br />\nforecasters of<br />\nfeatures of the book in order to give follow no set laws. They have are very large, and are easily obtain- turn<br />\nfor the better for the first time thic<br />\np.triong the ten best shows of its sea, t!,ey are to<br />\nmore to both seniors and lower classa set of hereditary laws all of their able for diSsection and smearing.<br />\nbon and was highly praised by New<br />\nin the past several years. In the last<br />\nc•<br />\nigh this<br />\nmen.<br />\nLast year several new mutations,<br />\nown, and a very easy one to follow<br />\nYork critics. The New York Times dereport, Henry S. Baker, University local vote, v. a::<br />\na part<br />\nIn the course of making this policy once it is understood. Dr. Metz and that is heritable differences in body<br />\nscribed Once in a Lifetime as \"a hard,<br />\nTreasurer, announced that for the of a national tabwatien<br />\ncharacters,<br />\nan<br />\nwere<br />\nactuality,<br />\nproduced<br />\ndifficulties<br />\nexposmany<br />\nby<br />\nhave<br />\nto<br />\nSciara<br />\nstudying<br />\nto<br />\nCrouse<br />\nMiss<br />\nare<br />\ndetermine<br />\nwift satire, fantastic and deadly, and<br />\ncoming year ending June 30, the defi- the sentiments of<br />\nthe campuses<br />\null of highly charged comedy lines.\" been encountered, and numerous mis- find out exactly what it is in the fly ing the insects to radium. These mutacit had fallen $71,000 below the figure<br />\narose<br />\ntions<br />\ntakes<br />\nnot<br />\nindividuals<br />\nhave<br />\nin<br />\nthe<br />\nbeen<br />\nexmade.<br />\nThat<br />\nabnormal<br />\nthis<br />\nhas<br />\nresponsible<br />\nis<br />\nthis<br />\nthat<br />\nfor<br />\nThe script of Once in a Lifetime rethroughout the country. These reestimated for the Homewood branches<br />\nposed, but in their off-spring.<br />\n• uires a cast of about sixty charac- been so is regretable and none will genetic behavior.<br />\nof the University. The market value turns are to be published as soon as<br />\ntempted<br />\nOne<br />\nis<br />\nto<br />\nmore<br />\nphilobecome<br />\nbe<br />\nready<br />\nthan<br />\nto<br />\nerror<br />\nadmit<br />\nslightly<br />\nfly,<br />\nsmall<br />\nSciara<br />\nis<br />\na<br />\ners, many of them being important<br />\nof the University investments has they can be counted and, if past peroles,\" said John E. Desch, new di- 1those directly concerned with its °e- smaller than the common fruit fly, sophical when observing these flies.<br />\nrisen<br />\npossible<br />\nquite<br />\nfrom about $27,000,000 to $29,- formances are to be considered, will<br />\nthat<br />\nis<br />\nIt<br />\nfuture<br />\ncurrence.<br />\nscienthe<br />\nremains<br />\nBut<br />\nfact<br />\nthat<br />\nfor<br />\nregions<br />\nand is know in mushroom<br />\nector of the Barnstormers. \"There<br />\npoint to the man not to'be elected<br />\nre seven complete changes of seen- the Hullabaloo must have the sup- the damage which it does to the young tists may find out that there are many 000,000.<br />\nAlthough the sustaining fund drive<br />\nNo Signed Ballots<br />\n• ry, necessitating, besides the cast, port of the majority of the Senior mushroom plants. In the larval stage, organisms which inherit in this mat,Class in order to be successfully ex- similar to the caterpillar stage of but- ner and that our own human scheme which was put through last year to<br />\n• large production staff.<br />\nWith a canipuz nearly one-half demecuted.<br />\nterflies, except that these are much of Mendelian inheritance is only an account for the expected deficit, yield\"So much has already been said<br />\nocratic in party leanings, and a small<br />\nsmaller,<br />\nthe larvae devour over their off-shoot of this particular \"maternal ed $512,000 at the time of the last<br />\nThe support solicited is of a finanbout this exceptionally good play,\"<br />\ngroup<br />\nof vociferous socialist and other<br />\ninheritance<br />\nscheme\"<br />\nas<br />\nit is called by report, the need is still felt for more<br />\ncial nature and is entirely within the own weight in mushrooms.<br />\ncontinued Mr. Desch, \"that it is almost<br />\ngeneticists.<br />\nThat<br />\nthe<br />\nis<br />\nfunds.<br />\nthe<br />\nleftist<br />\nThe<br />\nMendelquestion<br />\nsympathizers, it has been depermanent<br />\norganisms<br />\nthe<br />\nendowment<br />\nall<br />\nnearly<br />\nIn<br />\nlike gilding the golden eagle to say limits of that obtained in past years.<br />\nEach Senior will be asked in the ian Laws of inheritance hold. In short upon which many scientists, and fund of an additional $10,000,000, is cided to provide space on the ballots<br />\nanything else. But it is an hilarious<br />\n,next two weeks in October to sign a this means that both parents have an scientific philosophers will be working still badly needed, if the activities of for unnamed candidates. The ballots<br />\natire in the typical Kaufman-Hart<br />\npledge of $10 in return for which he equal opportunity to transmit any one in years to come, and all that we can the University are to continue unmood and I guarantee that it will<br />\nare othei wise to be th4plicates of the<br />\nsay is \"More power to them.\"<br />\nhampered. Although severe economies<br />\nwill receive his photograph and his character to their off-spring.<br />\n'provide an evening of unfaltering enhave been effected in the operating Maryland official ballot, which will be<br />\nwrite-up in the Hullabaroo and also a<br />\ntertainment.\"<br />\nexpenses, to account for half the dif- used in the general election, listing<br />\ncopy of the annual. If necessary this<br />\nStage Door, George S. Kaufman's lat- fee may be paid from caution<br />\nference<br />\nin the estimated and the act- Alfred M.Landon, Republican; Frankmoney.<br />\neSt \"dig\" at Hollywood written in colual deficit, these have in sonic cases lin<br />\nThe need for a short subscription<br />\nD. Roosevelt, Democrat; Norman<br />\nlaboration with Edna Ferber showed<br />\nreflected adversely on the school, and<br />\ncampaign cannot be emphasized. BeThomas, Socialist; John M. Aiken;<br />\nat the Maryland Theatre last week.<br />\nthere is still need for additional decause of contract commitments, the<br />\nThe Barnstormers are holding a<br />\nvelopments in some departments of and Earl Browder, Communist; in the<br />\ntaking of formal photographs must<br />\nrally this Thursday evening to welorder named.<br />\nUniversity.<br />\nthe<br />\nTicket Holders To Hopkins<br />\nbegin November 2. Should any senior 225<br />\nVoices<br />\nHead<br />\ncome and entertain prospective memNo ballots are to be signed, since<br />\nIncreased Income<br />\nstill be uncertain at that date as to<br />\nProtest At New York<br />\nHear Dorothy Thompson<br />\nbers and to show them what the orthis is to be a poll conducted in the<br />\nAdditional<br />\nimprovement<br />\nsprang<br />\nwhether or not he will subscribe to the<br />\nganization is like. Shortly afterward<br />\n,from the unexpectedly increased in- manner, so far as possible, of the<br />\n0414/ Speak Tonight<br />\nAlumni Banquet<br />\n,Hullabaloo, he may have his picture<br />\nthe first try outs will be held.<br />\ncome of the University. The endow- national election, on a strictly non'taken for $1.00. This fee will be deWell over 225 members will attend<br />\nment of $4,636,000, was $8,000 more partisan basis. Of course, mutilated<br />\nteacher's<br />\nAssailing<br />\noath<br />\nthe<br />\nmoveducted from his pledge before Dethe first of a series of lectures given ment as a threat not only to the than was expected, while the actual ,ballots will be voided, since to concember 15 to appear in the book.<br />\nvalue of the endowment can be as- sider them would be unfair to the<br />\nIt should be realized by every sen- by the University Supper Club this independence of American universicribed to an increase through actions nature of the poll.<br />\nior that every attempt has been made evening in Levering Hall, at 6.00 P. ties but also to the nation as a<br />\nThe NEWS-LETTER, through its ediof the Treasurer's office in June 1935,<br />\nto present a fair, honest and equit- Miss Dorothy Thompson of the whole, Dr. Isaiah Bowman, President<br />\nwhen it was decided to write down torial and news columns has been<br />\nOver One-Fourth Of Senior Class able plan. Because seniors derive more<br />\nof the Johns Hopkins University,spoke<br />\nNew York Herald Tribune and wife of<br />\nthe securities to actual market values. active in placing before the student<br />\nlast Friday evening in the Hotel Pennfrom the Hullabaloo, they are asked<br />\nSubscribes In First<br />\nThis decreased the value of the en- body the various major issues in this<br />\nthe speaker.<br />\nwill<br />\nLewis<br />\nbe<br />\n'Sinclair<br />\nto contribute more to its budget than<br />\nsylvania before a group of over 500<br />\nHour<br />\nowment from $31,000,000 to $27,000,- election. With particular emphasis on<br />\nAccording<br />\nto<br />\nannouncement<br />\nan<br />\nlower classmen. Such an arrangement<br />\nHopkins alumni attending the annual<br />\n000, and absorbed a large part of the the problems of the students which<br />\nAccording to an announcement appears too logical to warrant fur- made by W. L. Hammaker, Executive banquet of the New York, New Jersey,<br />\nfind place in the campaign, there have<br />\naccumulated deficits.<br />\nmade yesterday by Henry Kramer, ther elaboration. At this point we can 'Secretary of the University Y. M. C. Connecticut Alumni Association.<br />\nBut with the market value back on ,been numerous articles and letters<br />\nfurther<br />\nItusiness Manager of the Hullabaloo, #o no<br />\nwithout some concrete<br />\n\"I wish you could view this oath,<br />\nA., the lecture will take place in the<br />\na higher level, the fund is up by as well as editorials, published to give<br />\nthe new financial plan under which the index of your support. The 1937 Hulmovement as a symptom with broad1<br />\n$2,000,000, about half of which can ,as complete a picture as possible for<br />\nfaculty dining room in Levering Hall<br />\nannual is working this year has labaloo is your book and if you would<br />\nest implications,\" Dr. Bowman said.<br />\nbe attributed to bonds, and the rest to the readers to consider.<br />\n4larted off quite successfully. Yesterit a credit to the graduating so that this large group may be ac- \"Universities have made their contririses in stock values. This will go a<br />\nday when various members of the staff class of 1937 and to the Hopkins, it commodated comfortably.<br />\nbutions to the life of their times and<br />\nlong ways toward easing the condi,iPpealed to Seniors for the year- resides largely in your power to have<br />\nFollowing the Supper Club lecture, also to the corpus of useful knowledge tion, but<br />\nthe drive is still to be pushbook they succeeded in obtaining 40 it so. The decision rests with you, the Miss<br />\nThompson will give a lecture at and to the philoosophy of living, by ed for the sustaining and other ensubscriptions in about one hour.<br />\nhaving and keeping that independence<br />\nsenior class, and we hope, that upoia<br />\n8.15 in the Wilson Memorial Church<br />\ndowment fund. Out of deference to<br />\nwithout which there can be no endurThe slip which the Seniors are asked due consideration, your answer will be<br />\nthe Community Fund Drive in the<br />\nat University Parkway and Charles<br />\nt 0 sign states: \"I hereby promise<br />\nAlumnus Presents Books Through<br />\ning vitality of thought. It is necessary<br />\nto a favorable one.<br />\nStreet. This will be the first in a series to underscore the need for alertness city, activities will be slowed down<br />\n\"Friensti Of The<br />\nPay $10.00 for my appearance in the<br />\nSigned,<br />\nhere, pending a new opening later. In<br />\nLibrary\"<br />\nof University lectures also sponsored in reference to this movement and to<br />\nSenior section and one copy of the<br />\n-Robert Austrian<br />\nthe late fall, there will be an intens1937 Hullabaloo.\" This sum may be<br />\nby the \"Y\". At this lecture Mark S. every other sign of invansion of univer- ive drive in the Chicago and St. Louis<br />\n\"The University library,\" announcsity independence, for without indePaid at any time and may be taken<br />\nWatson, editor of the Sunday Sun,<br />\nareas, with the Alumni Association<br />\ned Dr. John C. French, librarian, \"has<br />\nout of the caution money.<br />\npendence good work cannot be done<br />\npreparing to shift its attention to the<br />\nwill introduce Miss Thompson. Over in<br />\nreceived from Dr. Lawnson Brown,<br />\nthe fields of social sciences and<br />\nWith over one-fourth of the Seniors<br />\nnew fields.<br />\n500 tickets have been sold for this humanities.\"<br />\nA.B., '95, M.D., '00, of Saranac Lake,<br />\nalready signed up, Kramer said, \"The<br />\nlecture series, and it is expected that<br />\nNew York, some twenty-odd addi\"If we are to keep the university as<br />\noutlook is very bright\". However, any- Figures Show<br />\nLanguage And the final sale will reach<br />\ntional<br />\nitems for the expansion of the<br />\nlast year's a symbol of man's aspirations toward<br />\none else wishin gto sign up may do so<br />\nNYA<br />\nDeadlines Given<br />\nEducation Courses Most In<br />\n,the highest realizable powers, we must<br />\nOliver Wendell Holmes Collection,<br />\nat the<br />\ntotal.<br />\n---from<br />\nday<br />\nany<br />\nHullabaloo office<br />\nFavor<br />\ntake into account also the emotions<br />\n1 2.20 to<br />\nGraduate NYA time reports must which he presented to the University<br />\n1.00<br />\nHuntley Lloyd, '38, will be chairman<br />\nof men, their aesthetic satisfactions, ,be in the office of the Bureau of Ap- in 1932 through the Friends of the<br />\n1t. was also announced that there<br />\nExceeding last year's enrollment of of the University lecture, while Lawwhat men can do with free time at pointments on , Wednesday, October ,Library.\" It is this group, the Friends<br />\nwill be a meeting of the business staff students to the same date by a large<br />\nrence Hanawalt, '38, will act as chair- each level of achievement. The col21, and undergraduate reports on of the Library, which contributes the<br />\nat 12.20<br />\nnumber, there were 1,170 registrants man for the Supper Club.<br />\ntomorrow.<br />\nleges are one agency of society, not Thursday, October, 22. No payment greater part of the annual new addiCollege<br />\nfor Teachers by October<br />\nin the<br />\nIt is of general interest to note that the whole of society, and they can<br />\nfor the month can be made if report (dons to the University library.<br />\n15 this year, as compared to the 1,105 about 60, or well over one-fourth of only rise<br />\na little above the level of is turned in late.<br />\nThis collection, said to be one of<br />\nGym Opened To Women<br />\nof last year, according to the state- the total membership of the Supper available material.\"<br />\nthe best of its kind, is made up of<br />\nStudents And Employees ment issued by Dr. Florence Bamber- Club, are from Goucher. Because of At the banquet the Alumni Associamanuscripts, quiz questions from Dr.<br />\nFraternity Heads<br />\nger, head of the College of Teachers. the large membership subscriptions tion elected its officers<br />\nfor the coming<br />\n,Holmes' classes in anatomy, rare<br />\nThe gymnasium will be open for Enrollments last year reached a sum for<br />\nsingle lectures will be extremely year. the list of new officers follows:<br />\nTo Sign Contracts phamplets, letters and first editions.<br />\nWomen members of the University on total<br />\nof 1,418 students. It may be limited, but a few may be obtained<br />\nDr.<br />\nDorsey<br />\nRichardson,<br />\nPresident,<br />\n\"Oliver Wendell Holmes, over a<br />\nWednesday Evenings, beginning toAll heads of social fraternities<br />\nexpected that the totals this year at the single price of 50 cents.<br />\nA.B. '15, A.M. '17, Ph.D. '20 (Pol. Scilong<br />\nperiod, played so large a part<br />\ntilorrow night, announced Dr. Willson<br />\nare requested to be in the office of<br />\nwill therefore exceed by far that numIn conjunction with the University ence); Dr. Edward M Armstrong, Vice<br />\nin the literary history of New EngSchaffer, Associate Director of the ber, the assumption being based<br />\nHullabaloo<br />\nthe<br />\nWednesday<br />\non,<br />\non lectures a display at the Pratt Free President, MD. '10; Mr. Frank G.<br />\nland that a rich collection of his<br />\nAPhysical Education department.<br />\nThursday, or Friday of this week<br />\nthe aforementioned statistics. Con- Library began yesterday. It contains 'Breyer, Vice President, A.B.<br />\n'08, A.M.<br />\nworks constitutes a valuable basis<br />\n'. This will be the third year that the sidering these figures it is significant pictures<br />\n12.30 to 1 o'clock to sign<br />\nof all of the speakers for this ,'10 (Chemistry); Mr. Edmund C. from<br />\nfor the students of our University in<br />\ncontracts for fraternity photos<br />\ntYrn has been open to women. Last that the College of Arts & Sciences, year and displays<br />\nseveral of their Lynch, Vice President, A.B. '07; Mr.<br />\nthe study of his time and his conYear several \"games\" of basketball too, this year has enrolled its largest<br />\nand places in the 1936-37 Year<br />\nworks which may be obtained at the Carl S. Stern, Vice President, A.B. '05;<br />\ntemporaries in literature,\" added Dr.<br />\niind,<br />\nBook.<br />\ninton were played.<br />\nentering freshman class.<br />\nlibrary.<br />\nContinued on page 3, col. 1)<br />\nFrench.<br />\nceive<br />\n<br />\nKaufman - Hart Play Chosen<br />\nGroup<br />\nFrom<br />\nOf Four<br />\n<br />\n'Sixty In Cast<br />\n<br />\nUniversity Deficit<br />\nLess Than Expected<br />\nLast Fiscal Year<br />\n<br />\nOPEN LETTER<br />\n<br />\nPoll Ends Wed.<br />\nReturns<br />\n<br />\nOf<br />\n<br />\nSENIOR CLASS<br />\n<br />\nIncreases<br />\n<br />\nFirst Supper Club Bowman Assails<br />\nLecture Tonight Teacher's Pledge<br />\n<br />\nNew HullabalooPlan<br />\nProves Sucessful<br />\n<br />\nhave<br />\n<br />\nLibrary Increases<br />\nHolmes Collection<br />\n<br />\nOver 1170 Enrolled<br />\nIn Teachers College<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br />\n<br />\n2<br />\n<br />\nObe jo1jni5 TOoptiiroS<br />\n<br />\nVote, Vote Vote<br />\n<br />\nWHY NOT THOMAS?<br />\n<br />\nOnce again the students and<br />\nfaculty of the Johns Hopkins Uni-<br />\n<br />\nPews<br />\n<br />\nfatter<br />\n<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council, RemDen Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to -June. except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL STAFF<br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan<br />\nManaging Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nBenjamin Root<br />\nAssistant Managing Editor<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors<br />\nIsadore Gertnian, Wethered Barron<br />\nNews Editors<br />\nReporters Max Iskowitz, Nathaniel,<br />\nFinkelstein, Jewett Goldsmith, Howard Reizenstein, Julian Adler, Carl<br />\nResin, Floyd<br />\nKatske, Leonard<br />\nRubinger, Morris Wessel, Arthur<br />\nKatz, Martin Krieger, Lester Rosenthal, Sidney Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Kempton....<br />\nBusiness Manager<br />\nMelville Locker<br />\nAssistant Business Manager<br />\nWm. C. Erlanger<br />\nAdvertising Manager<br />\nGerald WiIlen<br />\nCirculation Manager<br />\nHoward Linkoff<br />\nOffice Manager<br />\nNathaniel Soifer<br />\nCopy and Filing Manager<br />\n1936<br />\n<br />\nMember<br />\n<br />\n1q37<br />\n<br />\nPissociated Galle6icie Press<br />\nDistributors co<br />\n<br />\nColie6iak)Dieest<br />\nTuesday, October 20, 1936<br />\n<br />\nEddy On .Russia<br />\n.Dr. Sherwood Eddy's all too brief<br />\naddress in Maryland Hall last Thursday should emphasize, more than ever<br />\nbelore, the fact that, whether friend<br />\nor foe, all must realize the significance of what is going on in Russia<br />\ntoday. And that realization can be<br />\nbrought about only by adopting a<br />\nsympathetic attitude toward Russia.<br />\nThe importance of the economic and<br />\nsocial revolution undertaken by the<br />\nSoviets must not be underestimated.<br />\n,it is, certainly, \"one of the boldest<br />\nexperiments in the history of civilization,\" and much a the future of<br />\ncivilization depends upon the results<br />\nef that experiment.<br />\nThe \"Y\" should be congratulated<br />\nfor bringing Dr. Eddy to the Hopkins<br />\nduring the assembly hour. Perhaps<br />\nthis action will be an inspiration to<br />\ntne Student Council.<br />\n<br />\nVs.<br />\nThursday night a meeting was held<br />\nIn New York City. it was called by<br />\nvarious liberal groups of the metropons as a mass protest against the<br />\nreelection to the State Senate of one<br />\nJohn J. MeNaboe. Mr. McNaboe, it<br />\nseems, has built up for himself quite<br />\na reputation for Americanism.<br />\nHe has, among other things, advocated Leachers' oath bills; he has requested and received from the State<br />\nSenate $1.5,000 for the investigation of<br />\n\"unarnerican activities;\" he has encouraged the legislation of numerous<br />\nacts restricting education freedom.<br />\nAnother American was in New<br />\nYork Friday evening--one Isaiah<br />\nBowman, president of an enlightened<br />\nUniversity. This one had other ideas<br />\non academic freedom. Among the remarks which he made on teachers'<br />\nbilis were the following:<br />\n\"I wish you could see this oath<br />\nmovement as a symptom with<br />\nbroadest implications,\" he said.<br />\n\"Universities have made their<br />\ncontributions to the life of their<br />\ntimes, and also to the corpus of<br />\nuseful knowledge and to the philosophy of living, by having and<br />\nkeeping that independence without which there can be no enduring vitality of thought.<br />\n\"It is necessary to underscore<br />\nthe need for alertness in reference to this movement and to<br />\nevery other sign of invasion of<br />\nfor<br />\nindependence,<br />\nuniversity<br />\nwithout independence good work<br />\ncannot be done in the fields of the<br />\nsocial sciences and humanities.\"<br />\n<br />\nidency of the United States. It has<br />\n<br />\nThis is the fourth and last of a series of articles by students of the Johns<br />\nHopkins University in connection with the presidential election.<br />\nEX CATHEDRA<br />\nOnce, for their defense and main- profit of these articles. While people<br />\n<br />\nbecome of late a habit of the<br />\n<br />\ntenance of Socialism and democracy, cry for work, he gives them a business<br />\n<br />\nversity have the opportunity to<br />\nexpress their choice for the pres-<br />\n<br />\nSocialists<br />\n<br />\nwere<br />\n<br />\ncalled<br />\n<br />\nNEWS-LETTER to attempt to read<br />\n<br />\nthe<br />\n<br />\nthe<br />\n<br />\nCommunists 'social fascists,\" \"petit<br />\n<br />\npolitical<br />\n<br />\nCampus<br />\n<br />\nbarometer of the<br />\n<br />\nand<br />\n<br />\nthe<br />\n<br />\nresults, one<br />\n<br />\nway or the other, are always in-<br />\n<br />\nbourgeois\"<br />\n<br />\nand<br />\n<br />\nany<br />\n<br />\nother<br />\n<br />\nwith the dis-<br />\n<br />\nSimultaneously<br />\n<br />\nThe October tenth issue of Time<br />\n<br />\nwhich might come into mind. Today, ding for business' aid to the DemoJoe Stalin down who have turned profits have been derived under Rooseineir backs on the Socialist ideals and velt. While Roosevelt waxes hot be-<br />\n<br />\nNEWS-LETTER blank ballots are<br />\n<br />\nwait their turn to vote \"aye\" on any fore the labor element, the labor hat-<br />\n<br />\nbeing distributed in the Post Of-<br />\n<br />\nreform, which the capitalists might ing element in the Party is in search<br />\n<br />\nfices boxes of all undergraduate<br />\n<br />\ngrudgingly give to the people to cov- of support from<br />\n<br />\nstudents. Needles to say, unless<br />\n<br />\ner, if they can, their black trail of New Deal. Not forgetting that Gar-<br />\n<br />\na large percentage of these bal-<br />\n<br />\npoverty and disaster.<br />\n<br />\nlots are returned, the purpose of<br />\n<br />\nbusiness for the<br />\n<br />\nner was Hearst's man for president<br />\n<br />\nSo it has come about that the word in 1932, he is a typical bit of the conof God, Joe Stalin (not Father Di- servative quorum in the Party.<br />\n<br />\nthis poll will be defeated.<br />\nThe NEWS-LETTER is trying not<br />\n<br />\nvine) has been \"If you can't vote<br />\n<br />\nonly to measure tendencies on the<br />\n<br />\nCommunist, vote Democratic:\" Social- and cold not only on economic mat-<br />\n<br />\nOur \"Little Boy Blue\" blows hot<br />\n<br />\nlocal Campus, but it is as well, by<br />\n<br />\nists haven't forsaken Lee workers and ters but also on peace. While he in-<br />\n<br />\ncooperating in a national poll of<br />\n<br />\nstudents.<br />\n<br />\nstudent opinion, attempting to<br />\ndiscover<br />\n<br />\nthe<br />\n<br />\nopinions<br />\n<br />\nof<br />\n<br />\nthat<br />\n<br />\ngroup into whose hands the government of America will soon fall.<br />\nOf late years, the voice of the<br />\nAmerican<br />\n<br />\nstudent<br />\n<br />\nhas<br />\n<br />\nbecome<br />\n<br />\nheard far and wide; and it has<br />\nbecome loud enough to begin to<br />\n<br />\nvokes the blessed guardian angel, Pax,<br />\n<br />\nIt is not because of the fascist with the left hand, with the right he<br />\nscare that I am against Landon and signs the appropriation<br />\n<br />\nbills of a<br />\n<br />\nthe Republican Party and all that they biiiion dollars for the militarization<br />\nmight represent. We are living under of the country. Not only has he spikCapitalism. As such we must accept ed every conference for world peace<br />\nit or, if we don't, then attempt to but also has steadfastly refused to<br />\ncnange the existing order.<br />\n<br />\nforsake the traditional policy of na-<br />\n<br />\nLiberalism has been advanced as tionalism and isolation.<br />\n<br />\nexert some effect upon public pol-<br />\n<br />\ntile battle cry of the Democrats (or at<br />\n<br />\nicies and opinion.<br />\n<br />\nleast of some of them.) Franklin saken all to defend capitalism from<br />\n<br />\nSeveral weeks ago, in stress-<br />\n<br />\nThough Communists may have for-<br />\n<br />\nDelano Roosevelt has been pictured the big bad wolf, Socialists still re-<br />\n<br />\ning the importance of the 1936<br />\n<br />\nto us by his cohort6 and the Commun- main the vanguard of worker's and<br />\n<br />\npresidential election to the stu-<br />\n<br />\nists as wreathed in a golden halo of student's movements for a classless<br />\n<br />\ndent<br />\n<br />\nbodies<br />\n<br />\nof<br />\n<br />\nAmerica,<br />\n<br />\nthe<br />\n<br />\nNews-LETTEa said that \"never be-<br />\n<br />\nvirtue. But more of that later.<br />\n<br />\nsociety. The theories of Socialsm have<br />\n<br />\nLandon also is a representative of been expounded in much fullness, but<br />\n<br />\nfore have the issues involved in a<br />\n<br />\nlioeralism.<br />\n<br />\nnational election been so vital to<br />\n<br />\ntnat archaic liberalism, which lived ploited, workers of hand and brain,<br />\n<br />\nthe college student.\" Throughout<br />\n<br />\nonly in the minds of theorists and to unite and take over the means of<br />\n<br />\nthe country students are awaken-<br />\n<br />\nnever lived to see the Light of day. production and distribution, running<br />\n<br />\ning to that fact. Throughout the<br />\n<br />\nIt is his contention that laissez-faire, inustry not for profit but for the com-<br />\n<br />\ncountry students are preparing to<br />\n<br />\nthe pure capitalism, and therefore, the mon good.<br />\n<br />\nexpress their opinion on one of<br />\n<br />\ntrue liberalism, can be established in<br />\n<br />\nthe most critical presidential elections in many years. A negligiole<br />\npercentage of these will actually<br />\nbe able to vote on November .:.<br />\nBut upon the results of the numerous unofficial Campus polls<br />\nwill, from many points of view,<br />\ndepend the lulu'e of America.<br />\nIn a very few years, the students will be the governors of<br />\nAmerica. To a great extent their<br />\npresent training and their present<br />\ntendencies will shape ,the direction of future action. It has been<br />\npointed out in previous issues of<br />\nthe News-LETTER that this is a<br />\ncritical election because it represents the point at which one of<br />\ntwo diverging trains of thought<br />\nwill take over the domination of<br />\nour national life.<br />\nWhich will the students of the<br />\nHopkins, and of America, choose?<br />\n* * * *<br />\n<br />\nAmerica, even after monopolies have italism, nor do they want any more<br />\n<br />\nA few remarks of historical interest are here in order. Herbert<br />\nHoover won the student poll in<br />\n1932. Albert Ritchie won the gubernatorial poll of the faculty in<br />\n1934. The mere fact that both of<br />\ntnese men were ultimately defeated is of little consequence.<br />\nWhat is more important is this:<br />\nin 1932 Hopkins sentiment chose<br />\na good old-fashioned, \"do-nothing\" Republican; two years later<br />\nit selected a consei vative Democratid reformer. Last spring at<br />\na preliminary student poll of the<br />\nCampus President Roosevelt was<br />\nchosen to succeed nimself.<br />\nThe change of opinion is interesting. The results of today's poll<br />\nwill probably agree with last<br />\nSpring's. If it does, it would be an<br />\ninteresting study for some historian or sociologist to attempt to<br />\nexplain why undergraduate Hopkins evolved as it did from reaction to liberalism.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nFive names appear on the balott which is being distributed by<br />\nthe NEWS-LETTER. Two of them<br />\nare capitalists; three are socialists, of one kind or another. Most<br />\nof the discussion which has appeared in these columns and in<br />\nthis paper during the past three<br />\nweeks has centered aout the two<br />\ncapitalists.<br />\nThe NEWS-LETTER has presented .<br />\nits case for Mr. Roosevelt, as well<br />\nas its case against Mr. Landon. It<br />\nis still convinced that in Mr.<br />\nRoosevelt's direction lies the path<br />\nof liberalism and economic freedom. It still believes that Mr.<br />\nRoosevelt's record is good enough<br />\nto warrant his reelection. It still<br />\nbelleVes tnat the tendencies and<br />\nbasic philosophy of the Roosevelt<br />\nAdministration assures a bright<br />\nfuture for America.<br />\n<br />\nHowever, he<br />\n<br />\nC AMPUS<br />\nwith<br />\nSTANLEY MORTON FINKEL<br />\n<br />\nepithet carries a full page advertisement, bid-<br />\n<br />\nof this issue of the<br />\n<br />\ntribution<br />\n<br />\nrflJ E<br />\n<br />\nby the index of 103.<br />\n<br />\nit is these same Communists from cratic Party, pointing out that huge<br />\n<br />\nteresting.<br />\n<br />\no<br />\n0K<br />\nI RCLI N' B REVIEW Ci<br />\n<br />\nadvocates briefly it calls upon all who are ex-<br />\n<br />\nSocialists want no patching of Cap-<br />\n<br />\ngobbled up the little man and com- \"square deals\" or \"new deals.\" They<br />\npetition is a thing of the past, except demand, rather, the calling for a new<br />\nfor all good Republicans to rant about. deck and a game played over the<br />\nHe continues this advocacy in the table with no aces and trumps hidlight of the facts that his campaign den up the sleeves.<br />\nfunds are coming from those monopolies he some times condemns.<br />\nEnough rabid articles have appeared in the NEWS-LETTER against the<br />\nRepublicans and Landon, assuring me<br />\ntout my choice bit need not be added<br />\nto the others. It is to Roosevelt to<br />\nwhom I wish to turn and then to give<br />\nthe Socialist plan for America.<br />\nI stated above that F.D.R. has been<br />\npictured as the Shiloh of American<br />\ntioeralism, the benefactor of the workers and the guardian and leader of<br />\nour salvation. Without resort to insane ravings but rather with an examination of the facts let us look at the<br />\nDemocratic party, its principles and<br />\nits leader today.<br />\nIf the Democratic Party has changed overnight to a Farmer-Labor<br />\ngroup, I have still to see the result. I<br />\nstill see in its party's council chambers<br />\nGlass, Robinson, Farley, et al; all<br />\nwho personify and glorify our system<br />\nof exploitation of humans for indivual profits. Nor have I yet seen where<br />\nNegroes have received political and<br />\neconomic equality. It is in the Democratic states where the lynch law is<br />\nused, where in the solid South the<br />\nNegroes are kept in utter ignorance<br />\nwhile Roosevelt does nothing about it.<br />\nIt is in Joe Robinson's state of<br />\nArkansas that share croppers live in<br />\nmoral, economic, and political degradation. Because of him and his Democratic administration back home no<br />\nlegislation can be ventured in Congress for the relief of Tobacco Road.<br />\nOr remember the time relief cases<br />\nin Massachusetts as well as in other<br />\nparts of the country, where people<br />\nwere taken off the relief rolls and<br />\nforced into privately owened sweatshops, in which the maximum pay was<br />\n$3 a week. 'today, dispite the oaths<br />\nto the contrary, relief rolls are still<br />\nbeing managed by political wags,<br />\nwhose interest lies not in the unemployed, but the maintenance of fat<br />\nrelief jobs for the \"boys\" in the party.<br />\nNeedless to say, collective bargaining<br />\non relief strikes is squelched.<br />\nBecause of his insistence for a conservative Social Security Bill, Roosevelt has given us a sample of what a<br />\nSecurity Bill is not. It is more like<br />\n.the game of \"now you see it, now<br />\nyou don't.\" Its benefits are negligible<br />\ndanger for the workand fraught<br />\ner. No greater farce has come out of<br />\nCongress unless it might be the program for the slaughter of cows and<br />\npigs, for the extermination of farm<br />\nproduce, and for restriction of the<br />\nmanufacture of the necessities of life<br />\nin order to maintain the price and<br />\n<br />\nTo those who fear another war,<br />\nbrought about by individual greed<br />\nfor markets and raw materials, to<br />\nthose who desire social and economic<br />\nsecurity and justice for all, to all those<br />\nwho believe that the way out is not<br />\nthrough the destruction of the necessities of life, that freedom is a virtue,<br />\nthat fascism is a threat, that we can<br />\nbuild a world which will supply our<br />\nwants -I say -Vote Socialist.<br />\n<br />\nFrom a certain teacher of a certain<br />\nsubject in a certain way comes the<br />\nregular repetition of history when it<br />\nis learned that someone translated<br />\n<br />\nHalf Way With Roosevelt, by<br />\nErnest K. Lindley. Viking Press.<br />\n$2.75.<br />\nHalf Way With Roosevelt, writteill<br />\nby the star political observor of the<br />\n.New York Herald Tributne, is one of'<br />\nthe finest bits of contemporary history written in recent years. It is, in<br />\n,brief, an objective history of the first<br />\nthree years of the Roosevelt administration.<br />\n<br />\nAd.<br />\n<br />\nSe<br />\n<br />\nhauslich as \"homely.\"<br />\n<br />\nThis is the third book of its kind<br />\n\"I am not the executioner in this written by Mr. Lindley. Five years<br />\n,je<br />\nitlasb.<br />\nclass; I merely watch you commit ago appeared Franklin D. Roosevelt:<br />\nsuicide,\" came the reverberating A Career in Progressive Democracy;<br />\nand in 1932 The Roosevelt Revolution:<br />\n.comment, \"You're sitting on the fence<br />\ndifirst Phase was pulbished.<br />\nfe A<br />\nand leaning the wrong way!\"<br />\nMr. Lindley's opus is certainly ones<br />\nHeard from one of two nocturnal of the clearest and most intelligent'<br />\nhap:<br />\nstrollers walking through the Gilman analyses of the New Deal. The vol-1 plati<br />\nHall path: You know, Stan, holding ume not only analyzes the basic phil-,<br />\nosophy of the New Deal, but attemptsi erin:<br />\nhands is more of a precaution than a<br />\nball<br />\nto show to what extent it has been<br />\npleasure.\"<br />\npractised, and weighs it in relation<br />\nThis story shows a-Peale of Hop- to the needs of a democracy under<br />\nJohnpeaf th'<br />\ncapitalism.<br />\nkins to the rest of the country.<br />\nIt<br />\ntreats<br />\ncomprehensively<br />\nwith<br />\nOn the license plate of his car,<br />\nPeale 1)aci a black and blue \"Johns every phase of the Roosevelt admin'<br />\nS<br />\nu. de<br />\nHopkirfs\" plate. No less than three istration. Mr. Lindley explains the<br />\nowe r'<br />\ngold<br />\npolicy<br />\nand<br />\nits<br />\ninfluence<br />\non<br />\nrecovcompanions<br />\nachis<br />\ntimes were he and<br />\ntee<br />\ncosted with the query \"Which fo you ery; the attitude toward labor; the<br />\n,various<br />\nrelief<br />\nprograms;<br />\nthe<br />\nhousing<br />\nguys is Johns Hopkins?\"<br />\nriot.<br />\n‘viauh<br />\n'<br />\npolicy; the possibility of war and<br />\nCast in the role of a shrewd and<br />\nP<br />\nRoosevelt's probable attitude towards<br />\nwily Rajah, George Arliss uses his<br />\nyNew<br />\nit. Openly and intelligently Mr. Lindsuave, incomparable performance in<br />\nicy discusses the rumors of Roosethe leading role of \"East Meets West\"<br />\nvelt's \"socialism.\"<br />\nw<br />\nTheater.<br />\nnow at the Little<br />\ntP<br />\nariea<br />\ni.d<br />\nHalf Way With Roosevelt is cerand<br />\nThis film will be reviewed next week<br />\ntainly a relief after the accumulated<br />\nLo g<br />\nIn this column.<br />\nfog of one of the thickest campaigns<br />\nIt was curious how much Earl in American presidential history. For<br />\nDr<br />\nBrowder impressed the guardian of the open minded reader, it is a boon<br />\nInSt<br />\nthe law when the Communist candi- of information and clear thinking.<br />\nhe<br />\ndate addressed 1,447 people (yes, we<br />\nMr. Lindley is one of America's<br />\np un<br />\ncounted them) last Sunday.<br />\nace political observers. He covered<br />\ncora<br />\n\"Say, that was some swell speech,\" Roosevelt from the time he went to<br />\nniti•<br />\nsaid a lieutenant who voiced the opin- Albany as Governor of New York unor<br />\nion of most of ha colleagues.<br />\ntil the summer of 1936, when his<br />\nmeti<br />\n,paper assigned him to Governor LanSMOKE GETS IN OUR EYES<br />\ndon.<br />\niesti.i<br />\nIn one of our more enlightened<br />\n,link<br />\nc<br />\nau<br />\nclasses at the beginning of the year<br />\nthe instructor said, \"Fellows, we will<br />\nPindar, A Poet of Eternal Ideas.<br />\n1 D<br />\npermit smoking in this class— that is,<br />\nBy David M. Robinson, Ph.D.,<br />\n(he turned to the sole feminine memLl.D., Lett.D., 117 pp. $3.50 Johns<br />\nber of the class) if you don't object.\"<br />\nHopkins Press, Baltimore.<br />\n<br />\nHer<br />\n<br />\nt<br />\n<br />\nShe shook her head as she proved<br />\nAny work written by Professor<br />\nto be the first to take advantage of Robinson will interest Greeks; any<br />\nthe new ruling, soon smoking four iword spoken will command the atcigarettes that period.<br />\ntentions of Hellenes. Professor Robinson is known in Greece and among<br />\n, There are plenty of former City<br />\nAmericans of Greek descent not only<br />\nCollege students now at Hopkins who<br />\nas a great authority on all things<br />\nwere in the cast of \"Once in a LifeHellenic, but also as a true and valutime,\" Eddie Bauernschmidt took the<br />\n,leading role; Dianiond was an artist; able friend.<br />\nand we were several voices and noises<br />\noffstage.<br />\n<br />\nProfessor' Robinson, we have said,<br />\n<br />\nc<br />\nt'iri.si<br />\nforti<br />\nothc<br />\n<br />\nst<br />\nb°acit:.<br />\n<br />\neati<br />\nAillf<br />\nOf<br />\niel<br />\n<br />\n(Continued on page $, col. 2)<br />\n<br />\n1ami<br />\nGal<br />\nLou<br />\nlad;<br />\n<br />\nVICT016\\Y<br />\nDANCE<br />\n<br />\n4<br />\n1L.17e<br />\nm<br />\n,wh<br />\n,bet<br />\nEa<br />\nha.<br />\n0.1<br />\nm<br />\nwI<br />\n<br />\npri<br />\n<br />\nSATURDAY NIGHT 9 to 1<br />\n<br />\nPt<br />\n<br />\nFollowing The Haverford Game<br />\n<br />\nSi<br />\nki<br />\nIc<br />\nof<br />\nam<br />\n<br />\n-* THE TOWNSMEN<br />\n<br />\n•<br />\n<br />\nLEVERING HALL<br />\nPRICE $1 STAG<br />\nOR DRAG<br />\n<br />\nSponsored By The Cotillon Board<br />\n<br />\nAt(<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1986<br />\n<br />\nby<br />\n'ess.<br />\n<br />\nrittefl<br />\nof thei<br />\n•ne of<br />\ny hisis, in<br />\ne first<br />\ndrnin: kind<br />\nyears<br />\nemit:<br />\n'racy;<br />\nution:<br />\ny one<br />\nligent<br />\n• volphilernpts<br />\nbeen<br />\nlation<br />\nunder<br />\nwith<br />\ndininthe<br />\n•ecov; the<br />\nusing<br />\nand<br />\nards<br />\nLindoosecerlated<br />\naigns<br />\n. For<br />\nboon<br />\ng.<br />\nrica's<br />\nered<br />\nnt to<br />\nunhis<br />\nLan-<br />\n<br />\nas.<br />\nD.,<br />\nns<br />\n<br />\nessor<br />\nany<br />\n3 atobinnong<br />\nonly<br />\ntings<br />\nfalu-<br />\n<br />\nsaid,<br />\n<br />\n'asa<br />\n<br />\n6s,<br />\n<br />\nBuffet Supper<br />\nGiven By O.D.K.<br />\nTo Freshmen<br />\nAddresses Given By Mr.<br />\nThomas Hubbard And Dr.<br />\nMark Secrist<br />\n<br />\nSee Football Game<br />\nHershner Cross, Aided By<br />\nJerry Branower, Conducts<br />\nMeeting<br />\nAbout 150 freshmen attended a buffet supper presented by the Hopkins<br />\nChapter of Omicron Delta Kappa,<br />\n,National Honorary Fraternity last<br />\nFriday night. The supper, held in Levering Hall, preceeded the night foot(ball game between Washington and<br />\nJohns Hopkins.. Several prominent<br />\nespeakers both of the student body and<br />\nof the faculty addressed the group.<br />\nBowman Sends Greetings<br />\nHershner Cross, president of the<br />\nOi.udent Council, aided by Jerry Branuwer, served as Master of Ceremonies.<br />\ne.rreetings to the Freshman class from<br />\niL Isaiah Bowman, who w.,<br />\npot able to come in person because of<br />\nfa previous dinner engagement in<br />\n4:,lew York, were read by 13ranower.<br />\npresident Bowman said, in short, \"I<br />\nwish to express my cordial greetings<br />\nand good wishes to the entering class<br />\nand the hope that I may soon be able<br />\n,10 greet it in person.\"<br />\nPrinciples Of 0. D. K.<br />\nDr. Mark Howard Secrist, Geology<br />\n(Instructor at the Hopkins, addressed<br />\nthe group next, setting forth three<br />\nprimary principles of the O.D.K. A.<br />\n,oluing to Dr. Secrist, they are recognition of men who are active in one<br />\nor more activities on the campus, a<br />\nfnethod for bringing such men together so that they may serve the<br />\ninstitution as a unit, anti a means of<br />\nlinking the student body and the<br />\nfaculty.<br />\nDr. Thomas Hubbard of the Engineering School, the next speaker,<br />\n.turther developed the concepts set<br />\nforth by Dr. Secrist. He expressed the<br />\n;belief that O.D.K. performs two basic services: one to the University, the<br />\nOther to individuals of the student<br />\nbody. He explained that the five<br />\nstars on the Society's pin represented:<br />\nathletics, forensics, publications, educational entertainment, and scholarship. Men who possess a high degree<br />\nof ability in one or more of .those<br />\nitields get their reward in recognition<br />\nO.D.K.<br />\nHere Doctor Hubbard cited the<br />\namusing parable of the Order of the<br />\nGarter, when, in days of old, men<br />\nfought for the privilege of having a<br />\nlady give him her garter. This honor<br />\nsociety recognizes the contribution of<br />\nitune, energy and ambition of those<br />\nwho have left Hopkins as good as, or<br />\n(better than, when they entered it.<br />\nEach student should try just a little<br />\nharder to fulfill the requireents of<br />\nO.D.K. and, even if all do not reach<br />\nmembership, at least O.D.K. served as<br />\niin incentive to greater heights, a fact<br />\nwhich, in itself, justifies its existence.<br />\nInvited To Rally<br />\nLeaders of student activities were<br />\npresent and Martin Levine, president<br />\npf the Barnstormers, issued a hearty<br />\nnvitation to all to attend the Barnstormers' rally at the Playshop next<br />\n;Mursday.<br />\nThe meeting was climaxed by the<br />\nsinging of \"Dear Old Johnny Hopkins\" and \"On the Line\" under the<br />\nleadership of Holt Maulsby, chairman<br />\nof the Student Activities Committee,<br />\nand shortly afterwards the group adjourned to the football field.<br />\n<br />\n:-: BOOK REVIEWS :-:<br />\n(Continued from page 2, col. 6)<br />\ncan have the ear on Hellas any time<br />\nhe wishes. But when he writes on<br />\nGreece there is quickened attention;<br />\nhis work, in advance, is acknowledged<br />\nas authoritative and sympathetic.<br />\nPindar will continue the great reputation of the scholarly Philhellens. It<br />\nis the work of an archaeologist, philospher, litterateur--and humanist. It<br />\nwill be welcomed by all students of<br />\nthe great Greek poet; by all lovers of<br />\npoetry.<br />\nProfessor .mobinson's Pindar is a<br />\nbrilliant critique of the Theban poet.<br />\nIt is a work that shows the influence<br />\nof Pindar on the literature of many<br />\nlands and ages. The professor is a<br />\nforceful apologist and he establishes<br />\nthe fact that Pindar was not bare of<br />\nthought, philosophy, and human interest, as some have maintained. \"It is<br />\ngood,\" quotes Professor Robinson<br />\nfrom Fame!!, \"to have lived long with<br />\nPindar.\"<br />\nExcerpts from the N.Y. Herald Trib.<br />\n<br />\nMexico, A Revolution by Education, by George I. Sanchez, The<br />\nViking Press. 1936. $2.75. pp. 211<br />\nMexico has been studied and described in recent years by innumerable<br />\ntravelers, historians, economists. They<br />\nhave almost invariably reported a<br />\nstrange new spirit which seems to<br />\nhave pervaded the land; but in general these accounts have been confusing and often coflicting. In Mr.<br />\nSanchez' volume, we have Mexico<br />\npresented for the first time as an<br />\nexperiment in education; and for the<br />\nfirst time we have a clear and coherent story.<br />\nLast year, the Julius Rosenwald<br />\nFund decided to study the new school<br />\nmovement in Mexico and to study<br />\nthe way in which Mexico's revolutionary governments have been slowly<br />\nbut steadily removing obstacles in an<br />\n<br />\n:-: LETTERS TO THE EDITOR :-:<br />\n<br />\nattempt to secure some measure of To the Editor of the NEws-LErma:<br />\nsocial and economic progress for that Sir:<br />\nFirst I want to thank Mr. Fuchs<br />\nimmense portion of its population<br />\nfor his \"few words of criticism\"<br />\nwhich had been living in extreme povwhich he thought my article deerty and ignorance. Mexico, A Rev- served. It is impossible to deny his<br />\nolution by Education is the result of point, namely that I neglected to<br />\nmention the fact that the Depression<br />\nthat Investigation.<br />\naccompanied the unbalancing of the<br />\nexbeen<br />\nFor centuries Mexico had<br />\nNew York budget when F.D.R. was<br />\nmost<br />\nploited; its people held in the<br />\nGovernor. But succeeding happenings<br />\nextreme ignorance. Fifteen years ago<br />\nseem to indicate that the Governor<br />\n,the new government became estab- had more to do with it than the Delished politically. Lacking all the ne- pression, especially when the case is<br />\ncessary facilities--teachers, buildings, compared wiLh that of Kansas under<br />\nmark<br />\ntraining--hindered by differences in Landon. Though the low-water<br />\nof the Depression had been reached belanguage and custom, it nevertheless<br />\nfore the latter assumed office, the two<br />\nlaid the groundwork for a system of years, '34 and '36, of drought and deschools which could be an active force vastation make the conditions in the<br />\nin the life of each community. No two cases comparable. For depression<br />\nordinary pedagogical methods would hit the East no harder (if as hard)<br />\nthe West.<br />\nthan drought<br />\nhave sufficed in this crisis.<br />\n\"The Hoover spending, my friends<br />\nThe work in Mexico is by no means<br />\n. . . is the most reckless and extravacompleted. It will go on for many<br />\ngant pace I have been able to discover<br />\nyears; but what progress it has made in the statistical record of any peaceis sufficient to show the world the time government anywhere, any<br />\npart education may play in establish- time,\" said Candidate Roosevelt in<br />\ning a new social order. This book is 1932. Also, \"We advocate an immedian educator's account of a great ad- ate and drastic reduction of expendiventure. It is probably the best avail- tures by abolishing useless commisable survey of Mexican history and sions and offices, consolidating deculture and the meaning of the re- partments and bureaus, and eliminatcent revolution.<br />\ning extravagance, to accomplish a<br />\nMr. Sanchez closes his volume in the saving of not less than 25% in the<br />\nfollowing words:<br />\ncost of Federal Government\" (Democratic Platform, 1932.) Such inconThe people have tasted the fruits<br />\nsistencies, and especially his divertof knowledge, they are learning<br />\ning denunciations of \"economic royalthe fundamentads of economic seists\"— himself having spent fifty<br />\ncurity and of social justice. The<br />\nyears in luxury on land and sea, part<br />\nparty that is in power today may<br />\nof the time as a corporation lawyer<br />\nfall . . . yet no one can take<br />\nand Wall Street official (as Al Smith<br />\naway what the masses of people<br />\nsays) -force us to the conclusion that<br />\nhave already learned . . . They<br />\n\"the budget is not the only thing in<br />\nare conducted in an education not<br />\nWashington that is unbalanced.\"<br />\nby violence but by education.<br />\nBut now to answer Mr. Kempton.<br />\nWhat they have learned so far<br />\nI am unable at present to answer his<br />\nconvinces them that Educar es<br />\ncharge against Landon's civil servredimir.<br />\n<br />\nice policy. But on this point Mr. Kempton lives in a glass house: \"Between<br />\nJune 30, 1932, and June 30, 1936, the<br />\npercentage of employees in the Exe04tive branch of the Federal Government not under civil service increased<br />\nfrom 19.9% to 39.5%.\" A specific example is the President's abolition<br />\nof a Federal Reemployment Bureau<br />\nunder civil service laws, and the creation of a new one not so restricted.<br />\nAs the minimum wage law which<br />\nwas declared unconsututional in 1925,<br />\nand Landon's failure to \"force\" any<br />\nsustitute legislation, this, like his procedure after the Farm Moratorium act<br />\nwas thrown out of the Court, showed<br />\n\"his devotion to the spirit of the Constitution,\" Mr. Kemptom to the contarary regardless. Landon advocated<br />\nan amendment to the state Constitution which would permit the moratorium act; that the legislature turned<br />\nit down is nothing against him. But<br />\nhow different was the procedure at<br />\nWashington after a like fate overcame the Guffy Coal Bill!<br />\nAs for the confidential report about<br />\nwnich Mr. Kernpton writes, Landon<br />\nsays that it was not confidential and<br />\nthat he was therefore not violating<br />\nany confidence in quoting it. And I<br />\nwould think twice before I disbelieved<br />\na man who, in his own community and<br />\nstate, has the reputation of never<br />\nhaving broken a pledge.<br />\nTo the resolution of the Kansas<br />\nFederation of Labor excoriating Lan- ,<br />\ndon for calling out the militia in the<br />\nlead and zinc workers' strike, that<br />\nwas due entirely to misinformation.<br />\nDick Heiman, under Sheriff of Cherokee County, and C. E. Shouse, County<br />\nAttorney, wired the Governor during<br />\nthe strike as follows: \"We do not<br />\nfeel that our local police strength is<br />\nsufficient to cope with the situation.<br />\nUnless immediate assistance reaches<br />\nus we do not believe we can avoid<br />\n<br />\nThe<br />\nhoney in<br />\nthe briar<br />\nkeeps the pip*<br />\nsweet.<br />\n11.1ligh-efficiency<br />\nCondensor cleans, purifies<br />\nsmoke.Trapsmoisture.Noclogging.Notrouble.Proveityoursom<br />\n<br />\nAt Your Dealers<br />\n•<br />\n<br />\nIt's a Light Smoke!<br />\nIn Harmony with Your Throat<br />\nMore marvelous than any invention is the \"music<br />\nbox\" inside your throat. But so delicate ... with<br />\nits maze of membranes! No wonder so many stars of the movies and radio say that for them a light<br />\nsmoke is the right smoke. Luckies are a light smoke<br />\nof rich, ripe-bodied tobacco. Luckies hit the right<br />\nnote with your taste! The only cigarette with the<br />\ntender center leaves of the highest-priced tobacco<br />\nplus the all-important throat protection of the<br />\n\"Toasting\"process. Remember—the only cigarette.<br />\nSo reach for a Lucky and be kind to your throat!<br />\n<br />\n* * NEWS FLASH! * *<br />\n205 Guests at Ritz Carlton in Atlantic City<br />\nPlay \"Sweepstakes\"!<br />\nPeople on vacation play the \"Sweepstakes,\"<br />\ntoo. In one week alone 205 guests at the<br />\nfashionable Ritz Canton in Atlantic City<br />\nremembered to send in their entries for<br />\nYour Lucky Strike \"Sweepstakes.\" We say<br />\nthat's combining fun with fun!<br />\n<br />\nBowman Assails<br />\nTeacher's Pledge<br />\n(Continued from page I, col. 4)<br />\nDr. Leo Wolman, Vice President, A.B.<br />\n'11, Ph.D. '14 (Political Economy);<br />\nDr. Thomas De C. Ruth, Secretary,<br />\nA.B. '06, Ph.D. '16 (Latin); Mr. Clarence M. Guggenheimer, Treasurer,<br />\nA.I3. '99.<br />\nThe list of members of the executive<br />\nboard follows:<br />\nColonel Oliver F. Allen, Arts '93-94;<br />\nMr. Edgar S. Bamberger, A.B. '03;<br />\nMr. William S. Bird, A.B. '03; Reverend Doctor Allan K Chalmers, A.B.<br />\n'17; Mr. J. Albert Durgom, AB. '27.<br />\n<br />\ninjury and loss of life.\" So Landon<br />\nhad no choice but to send militia.<br />\nDuring the controversy over the<br />\nresolution against Landon, Elmer<br />\nDean, president of the Union in Galena, Kan., said, \"This crime against<br />\norganized labor should be placed<br />\nsquarely on the shoulders of Dick<br />\nHeiman and C. E. Shouse.\" Whereupon Mr. Ed Cassell, the originator of<br />\nthe resolution in question, made this<br />\nstatement: \"I know Elmer Dean personally and his unquestioned sincerity is a thing admired by all the laborite of southeastern Kansas. . . . I<br />\nam glad to see a leader whose feelings and honesty and sincerity toward<br />\nlabor is unquestioned, who has the<br />\ncourage to pin the injustices heaped<br />\nupon labor squarely upon the shoulders of those who are to blame.\"<br />\nAnd now, Mr. Editor, to pick a bone<br />\nwith you. In the last issue you said<br />\nthat the Alumni Memorial Hall is<br />\nentering its New Deal period. 'Taint<br />\nso. We are not leaving any huge debts<br />\n,for posterity: the dance last spring<br />\nnetted only a dollar in the red. We're<br />\ncareful of our money, so please don't<br />\nInsult us any more.<br />\n—Merton Fales<br />\n<br />\nHave you entered yet? Have you won<br />\nyour delicious LuckyStrikes? There's music<br />\non the air. Tune in \"Your Hit Parade\"—<br />\nWednesday and Saturday evenings. Listen,<br />\njudge, and compare the tunes—then try<br />\nYour Lucky Strike \"Sweepstakes.\"<br />\n<br />\nA CLEAR VOICE<br />\n—A Light Smoke<br />\nWhether you sing in the<br />\nparlor—or just hum in your<br />\nmorning tub, be kind to<br />\nyour throat. A clear voice,<br />\na light smoke—they go togather. Guard those delicate<br />\nmembranes. Select a light<br />\nsmoke—o Lucky.<br />\n<br />\nAnd if you're not already smoking<br />\nLuckies, buy a pack today and try them.<br />\nMaybe you've been missing something.<br />\nYou'll appreciate the advantages of<br />\nLuckies — a Light Smoke of rich, ripe.<br />\nbodied tobacco.<br />\n<br />\nH. FURST CO.<br />\ngYn<br />\nYear<br />\nfld<br />\n<br />\nPrinters of<br />\n.LOLOGICAL and<br />\nI FIC PUBLICATIONS<br />\nikiss Plane Baltimore<br />\n<br />\nOF RICH, RIPE-BODIED<br />\nClupyristat 1558. The American Tobacro Company<br />\n<br />\nTOBACCO<br />\n<br />\n\"IT'S TOASTED\"<br />\n<br />\n\f4<br />\n<br />\nFIOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br />\n<br />\nShoremen Beat<br />\nJays By Narrow<br />\nMarginOfSalety<br />\n<br />\nSport Schedule<br />\nINTERCOLLEGIATE<br />\nFootball<br />\nJohns Hopkins vs. Hayeffort!, Saturday, at Homewood.<br />\nSoccer -- Johns Hopkins vs. University of Maryland, Saturday, at<br />\nHomewood.<br />\nCross-Country---Johns Hopkins vs.<br />\nLehigh University, on Saturday,<br />\nat Homewood.<br />\n<br />\nSigma Phi Epsilon, Phi Psi,<br />\nTouch Football Rooters<br />\nO.K.O. Win League Contests Rules Announced<br />\n<br />\nScore<br />\nOver Salisbury<br />\nBy 3-1 Count<br />\n<br />\nThe following are the rules for all<br />\nintramural and interfrat games:<br />\n1.--The field shall be 35 by 50 yards.<br />\n2.---A team shall consist of seven<br />\nThe fraternity touch football league<br />\nScoring as many points as 0.K.O., men.<br />\ngot under way last Tuesday with Sig- Phi Psi conquered Tau Alpha Omega<br />\n3.—There are no end zones.<br />\nma Phi Epsilon, Phi Psi, and Omicron 32-6. Lody made the losers only score<br />\n4.—A touch shall constitute a<br />\nINTERFRATERNITY<br />\nKappa Omicron copping games. The<br />\n,which Himes, Davis, Lamble added tackle.<br />\nTuesday--Phi Sigma Delta vs. Phi<br />\nlosing team managed to score only<br />\na.--The referee shall have the<br />\nsingle scores for Phi Psi. Maulsby<br />\nAlpha; Kappa Sigma vs. Phi Ep12 points while the victors tallied a<br />\nsole power to determine if a<br />\nmade a safety, and Dukehart tabbed<br />\nsilon Pi.<br />\ncombined total of 88 markers.<br />\ntouch<br />\nwas<br />\nunnecessarily<br />\nWednesday -Omicron Kappa OmiHaving N. Lloyd leading on the of- twice. Dukehart played only the first<br />\nrough. A foul shall be penalcron vs. Kappa Alpha; Alpha<br />\nfense with three touchdowns to his half, .but made a fine impression. Alized by giving the opposing<br />\nDelta Phi vs. Delta Upsilon.<br />\ncredit, the O.K.O. seven downed Pi though defeated, T.A.O. loaked promteam an extra down, or by<br />\nThursday -Pi Lambda Phi vs. AlAlpha 32-0. J. Alexander added to<br />\ntaking one down from the deising,<br />\nand<br />\nonly<br />\nlack<br />\nof<br />\npractice<br />\nand<br />\npha Epsilon; Tau Alpha Omega<br />\nthe five scores on a pass while R.<br />\nfending team.<br />\ninternal dissension kept it from makThe Johns Hopkins soccer team<br />\nvs. Delta Phi.<br />\nHartman made a six - pointer and<br />\n5. .Blocking shall be done with<br />\nking<br />\na<br />\nbetter<br />\nshowing.<br />\n.clinched their first victory in the<br />\nFriday -Sigma Phi Epsilon vs. Tau<br />\nWashington College managed to<br />\nsafety.<br />\nIn the remaining game, Sigma Phi both feet remaining on the ground. Maryland collegiate soccer<br />\nAlpha Phi, Phi Psi vs. Beta Theta<br />\nchampnose out a fighting Hopkins eleven<br />\nHartman, O.K.O. player, played an Epsilon topped Alpha Epsilon Pi 24- Flying blocks may be penalized by ionship<br />\nrace defeating the Salisbury<br />\nPi.<br />\nFriday night at Homewood by a<br />\nexcellent game throughout and was 6. D. Erck, J. Lyle, R. Reigner, and sending the offender from the game. ,tate<br />\nTeachers' College by a score of<br />\nscore of 8-7. The Shore team's win6. -There shall be no blocking by the<br />\noutstanding on running plays. Gor- ,C. Deitz made touchdowns for S.P.E.<br />\n3-1<br />\nat<br />\nHomewood Saturday.<br />\nping margin was supplied by a safety<br />\ndon, freshman, made the best show.- while A.E. Pi lone score was made by pffensive team when returning a punt<br />\nThe Blue Jay booters were outand a touchdown—both coming in<br />\nor kick-off. (This is to avoid any<br />\n,ing for Pi Alpha.<br />\nChibnik.<br />\nplayed by the visitors in the first<br />\nthe third period. It wasn't until the<br />\nblocking on plays where players can<br />\nhalf when the Teachers assumed the<br />\nfinal quarter that George Kahl, Jay<br />\n(have some distance in which to get<br />\nlead as Wheatley, playing outside<br />\nfullback, intercepted an enemy pass<br />\na, running start. Contact as such<br />\nLast Tuesday the 1937 tennis season<br />\niright, sank a beautiful boot into the<br />\nand ran 70 yards for the Hopkins'<br />\ntimeshas proved to be dangerous.)<br />\ninaugurated<br />\nwas<br />\nby<br />\nmeisHoff<br />\nCoach<br />\nnet.<br />\nonly tally.<br />\n7.- The ball is dead wherever a latter in a special fall organization<br />\nBucking the wind in the third period<br />\nThe comparatively light Blue line<br />\neral pass is dropped, or wherever a<br />\nmeeting, the first held in several years.<br />\nheld the huskier Washington squad<br />\nball is fumbled. This does not apply of the game, the Jays, by a series of<br />\nr all racquet practice has started, and<br />\nplays worked the ball to a centered<br />\nThe opening drill of the Blue la- on akick-off.<br />\nsurprisingly well in the first stanza.<br />\nDue to an alteration in schedules,<br />\nManager Snyder has set into motion<br />\niposition and Targin on a straight<br />\nBeginning with a rush, the Shoremen<br />\ncrossemen<br />\nwas<br />\n8.<br />\nstaged<br />\nA<br />\npass<br />\nlast<br />\nweek<br />\ncan<br />\nunder<br />\nbe<br />\nthrown<br />\nfrom<br />\nany<br />\n(the<br />\nHopkins-Lehigh Cross Country<br />\nthe ladder tournament which will de„punt<br />\nsank the tieing tally.<br />\nlaunched a powerful drive starting at<br />\nplace back of the line of scrimmage.<br />\ntermine the Spring berths on both Meet will be staged this Saturday,24th, the guidance of Coach Kelso Morrill<br />\nBradshaw, substitute outside right,<br />\nmidfield and bearing on down to the<br />\n9.-In<br />\noff-side<br />\nplays,<br />\nthere<br />\nshall<br />\nbe<br />\nthe Varsity and Junior Varsity teams. between the halves of the Hopkins- Due to the continuous downpour of<br />\nput the Blue team in the lead with a<br />\nflays' 4 yard marker. But here the<br />\nrain the candidates gave up any hope a penalization of five (5) yards. The<br />\nIn just the first few days of prac- Haverford<br />\nfootball clash, instead of<br />\nwell directed boot, centered in Phildefenders dug in and staved off an<br />\nplay<br />\ngoes<br />\nover.<br />\nof actual scrimmage and spent the<br />\ntice, many promising newcomers have<br />\n/lips on an outside kicks. Incidentally,<br />\n.dmost certain score.<br />\n,the 17th as had been planned. The<br />\n10<br />\n--Each<br />\nteam<br />\nshall<br />\nhave<br />\nfive<br />\n(5)<br />\nentire two hours at the concrete wall.<br />\nbeen putting the finishing touches onIn the second period Kahl made the' to their Summer form. In addition starting lineup given is still uncer- At that place they practiced various downs in which to make a touchdown, .Bradshaw shares the ranking honors<br />\nof the victory since he turned in one<br />\nafter which they lose the ball.<br />\nfirst threatening gesture for the Jays to these new men, the team is strong tain as varsity positions are being breaks and shots.<br />\nof the most outstanding performances<br />\nby spearing a Washington forward in top-rankers who have had last<br />\nAs soon as the aspirants have<br />\n.strongly contested by a well-balanced<br />\never witnessed on the Homewood field.<br />\npass and galloping 50 yards down .year's experience on the Varsity. The<br />\nand conditioned squad, but will be enough warm-up drills, Dr. Morrill inHis tally rallied the Blue Jays after a<br />\nthe field, before being forced out on standbys are headed by Captain-Elect<br />\nannounced during this week. How- tends to divide them up into teams<br />\nseemingly losing fight.<br />\nthe visiting team's 20 yard stripe. Bob Brown (who was chosen to take<br />\never, the probable starters will be and stage real box - lacrosse games<br />\nrhe Hopkins revamped offense finBut the Hopkins running attack was ithe place of Captain Carl Hartman,<br />\nBrown, Warminsky, Lyman, Discal, at the newly built enclosure on the<br />\nAll those intending to come out for ally clicked in the last twenty minstopped dead in its tracks, and on pingles star of last season) and inCastelle, and Norton and Scharpf, two ,lower field.<br />\nvarsity basketball are urged to at- iutes of play as they repeatdely threatthe fourth down Baetjer attempted a clude Cramer, Ratchiffe, Lamble,<br />\nThose who wish to turn out for the tend basketball practices being held ened<br />\npromising<br />\nfrosh.<br />\nthe Salisury net. Price easily<br />\nplacement kick from the 30 yard line,' Leonard, and Branower.<br />\nBoth the Blue Jay and Brown End drills may report Tuesdays and Fri- at the gym on Wednesday afternoons dented the net<br />\nthe ball falling just a few years short<br />\nwith the final score<br />\nWhite Warriors are evenly matched, days at the gymnasium and receive at 4 P.M. The drills are under the di- of the game.<br />\nof the crossbar.<br />\nNOTICE<br />\ngoing for a close meet. It will be their equipment.<br />\nrection of Captain Herb Siegel, inas- •<br />\nHopkins<br />\nYoung, the short-team's star tripleFreshmen and Sophomores inter0 0 1 2 3<br />\nremembered that last year Lehigh<br />\nIt is hoped that this year's squad much as Coach Malonee is at present<br />\nSalisbury<br />\nthreat man, started things rolling for<br />\nested in a position on the manager0 1 0 0-1<br />\nbarely squeezed a victory by one will be able to improve on the record occupied with footall. The purpose<br />\nGoals: Salisbury—Wheatley; HopWashington in the second half by<br />\nial staff of the Tennis Team are repoints, giving Capt. Scholtes and his made by the team last year. They of these practices is to get the candi- kins -Price,<br />\n,puntin^; out of bounds on the Blue Jay<br />\nLargin, Bradshaw. Subquested to get in touch with Mana- ;<br />\nrecruits all the more reason for re- lost games to St. John's, B. A. C., and dates into condition before the more stitutes: Hopkins<br />\nfive yard line. When hail tried to<br />\n--Price, Mace, Hahn,<br />\nger William Snyder.<br />\nvenge.<br />\nMt. Washington.<br />\nlintensive work is started.<br />\nBracLshaw, Allen, Kemp.<br />\nimtaliate, Salters broke through to<br />\nplock the boot, Ward, of the Jays, re•<br />\n•<br />\ncovering the ball in his own end-zone,<br />\nthereby scoring a safety for Washington.<br />\nHopkins kicked off on its own 20<br />\nyard line, and the visitors, adding<br />\nmuch yardage by a favorable exchange of punts, marched 30 yards to<br />\ntheir only touchdown. Huffman's<br />\nplacement try was foiled by a had<br />\npass from center.<br />\nIn the final chucker the Shoremen<br />\n/again bore down toward their oppoenent's goal until stopped by Kahl's<br />\nAnterception of Young's toss and 70yard sprint behind splendid interference. Once in the clear Kahl couldn't<br />\nhe caught. Baetjer place-kicked the<br />\n,extra point to give the final score.<br />\nKahl was undoubtedly the Blue Jay<br />\nbackfield star, while Baetjer, Royster<br />\n(anu Hopkins were outstanding in line<br />\nplay. Vincenti played his usually fine<br />\nsecondary defense game.<br />\nWith Green out and Graziano nursing a sore hand, Hopkins' offense was<br />\nat a sorry disadvantage, but the eleven showed plenty of stuff in holding<br />\na more powerful eleven to a one<br />\npoint victory.<br />\n<br />\nSuperior Power And Young's<br />\nGreat Punting Give<br />\nShoremen Victory<br />\n<br />\nPhi Alpha Downed 32-0 By 0. K. 0.; T. A: U: Whipped<br />\nBy Phi Psi; A. E. P. Loses 24-6 To S. P: E:<br />\n<br />\nSoccer Team Wins First<br />\nOf Maryland Collegiate<br />\nContest<br />\n<br />\nBradshaw Shines<br />\n<br />\nJays Fight To End<br />\n<br />\nEntire Squad Shows Excellent<br />\nForm Against<br />\nTeachers<br />\n<br />\nKahl Totes Ball 70 Yards<br />\nIn Final Period For<br />\nHopkins' Only Tally<br />\n<br />\nTennis Team Holds<br />\nSpecial Meeting<br />\n<br />\nDistance Men Set Jay Lacrossmen<br />\nFor Lehigh Clash Hold Initial Drill<br />\n<br />\nSiegel Calls Drills For<br />\nCourtmen At Gym Wed.<br />\n<br />\n...than- the<br />\nwhaleman's signal<br />\nor a smohe<br />\n<br />\nSide Lines<br />\n<br />\nAnd on land and sea,<br />\nfrom coast to coast...with<br />\nmillions of smokers, men<br />\nand women...when they<br />\ntake time out to enjoy a<br />\ncigarette it's<br />\n\"Smoke-O...<br />\npass the Chesterfields\"<br />\nChesterfields are milder...<br />\nand what's more they've<br />\ngot a hearty good taste that<br />\nleaves a man satisfied.<br />\n<br />\nOur sympathies to those boys who<br />\nwere unfortunate enough to have<br />\ndates for the game. Even more sympathy to the girls who had to sit<br />\nthrough the rain in their football best.<br />\n« * * *<br />\nHow many of you noticed the female cheerleader of the Washington<br />\ncheering squad? And incidentally<br />\ntiTere were more women than men in<br />\nthe visiting stands.<br />\n* * * *<br />\n\"Dena\" Traggis seemed to he awfully close to the earth when he stood<br />\nalong side the big Washington men<br />\nIncidentally it was 'Trag\" who made<br />\nthe first tackle after he got into the<br />\ngame.<br />\nThe Washington team went into a<br />\npuddle, I mean huddle, fifteen yards<br />\nbehind the line of scrimmage. I guess<br />\nthe shore school has no cross country<br />\nteam, so the football squad has to<br />\ndouble up.<br />\n* *<br />\nTom Ellis says \"those boys were<br />\nplenty big\" and if he says so we can<br />\n;take his word fo it.<br />\nThe cheering could have been a lot<br />\nlouder and snappier. Come on, frosh,<br />\nilearn those yells. And seniors needn't<br />\nibe too dignified, even when with a<br />\nwoman, to make some use of their<br />\nlungs.<br />\n<br />\nC 1936, LIGWIT1'& MYtItS TOBACCO C.C.,<br />\n<br />\n\f", "format": "basic_html", "processed": "art<br />\non<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\n10011tts<br /><br />\nteam,<br />\ntitles,<br />\n.ce In<br /><br />\nBarnstormers<br />\nDecide On'Once<br />\nIn A Life Time'<br /><br />\niedule<br /><br />\nRally — Thursday Eve.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br /><br />\nrOLUME XLI, No. 6<br /><br />\nuted<br /><br />\nNriusrffirtirr<br /><br />\nAttend Barnstormer<br /><br />\nGlee Club Practices<br />\nTunes For First Concert<br />\nIn its preparations for the coming season, the Johns Hopkins<br />\nGlee Club has been practicing several selections.<br />\nThese include Shenandoah, a<br />\ntraditional chanty, freely arranged by Marshall Bartholomew; and<br />\nThe Lord's Prayer, music by Albert<br />\nHay Molotte and arranged by Carl<br />\nDeis.<br />\nTuesday night rehearsals are<br />\nheld for first and second tenors;<br />\nThursday night rehearsals, for first<br />\nand second bass voices.<br />\nThe first Music Club concert is<br />\nscheduled for the early part of December.<br /><br />\nSmall Fly Disobeys Menders<br />\nLaws; Cousin Of Drosophila<br />\n)Kept In Sterilized Glass Vials And Fed Mushrooms And<br />\nYeast So As To \"Eat, Grow Fat, And Reproduce\"<br /><br />\nPRICE 5 CENTS<br /><br />\n'Stormers To Hold Rally<br />\nIn Playshop Thursday<br />\nThe annual Barnstormer's rally<br />\nwill be held on Thursday evening,<br />\nOctober 22, in the Playshop. The<br />\nentire 'student body is invited to<br />\nattend.<br />\nThere will be plenty of talks,<br />\n,skits, and fun. John E. Desch, the<br />\n'Stormers new coach will be introduced, and Barnstormer comedians<br />\nwill perform.<br />\nAll students interested in any<br />\nbranch of dramatics work are urged to attend the rally.<br /><br />\nCampus Straw<br />\nVote Conducted<br />\nBy News-Letter<br /><br />\nBy Morris A. Wessel<br />\n'Ballots<br />\nNow that all of the Biology 1C<br />\nBeing<br />\nBut in Sciara, there is a sexual difPlaced<br />\nondistudents are struggling with their ference. The female fly behaves in perIn<br />\nPost<br />\nOffice<br />\nconfruit flies and attempting to uncover fectly normal Mendelian fashion,<br />\nBoxes Today<br />\nrulars<br />\nthe mysteries of their life history, this transmitting the characters which she<br />\npense<br />\nNews-Letter reporter decided to inves- received from both parents. Then male<br />\ntigate another fly, known as Sciara, a however, transmits only those charand<br />\ndistant cousin of the Biology 1C Droc- acters which he received from his<br />\nophila melanogaster. In Gilman Hall, mother. .<br />\nTo Be Part<br />\nSatire On Hollywood Among<br />\nLet us take the example of curly<br />\na building which houses representatives of many different fields of wings. Suppose that a normal female<br />\nNational<br />\nPoll Of<br />\nTen Best Of<br />\nknowledge, there is a carefully cared was crossed to a curly winged male,<br />\nCampuses<br />\nIts Season<br />\nfor society of these flies.. In fact which had received this character<br />\nthey are kept in sterilized bottles, from his father, all of the offspring<br />\nBallots in the NEWS-LETTER'S straw<br />\nThe selection of Once in a Lifetime,<br />\ngrown on sterile agar cultures, and would be normal; that is, have straight<br />\nvote of the campus on the coming<br />\nthe Hollywood satire by George S.<br />\nfed mushroom and yeast mixtures. wings.<br />\nTO THE<br />\nt(aufman and Moss Hart, as this seapresideatitl elect:on will be found<br />\nUnder the watchful and scientific eyes<br />\nMonosexual Progeny<br />\nkon's first Barnstormer production,<br />\nof Dr. Charles W. Metz, Professor of<br />\nAnother peculiar thing about cerwith today's issue. —They resemble<br />\nwas announced yesterday by Marty<br />\nAt Homewood the bona filk ha:lots of this state,\"<br />\nCytology, Miss Helen Crouse, Re- tain species of Sciara, for example Branches<br />\nLevine, president of the campus thessearch Assistant, Miss Gene Coul- in Sciara copraphila, all of the offFall $71,000 Under Esti- and are to be filled in and returned by<br />\npian organization.<br />\nThis year, as you are probably bourne, and one ambitions NYA as- spring from one female are either all<br />\nmated Figures<br />\nWedne:-day cv nn: at the latest. The<br />\n\"We have piced, I think, one of aware, the Hullabaloo has embarked sistant, Sciara are given every op- male, or all female. Under the Mendelballot bo:: is to be lec-if ed just outside<br />\nthe cleverest comedies produced on<br />\nportunity to \"eat, grow fat, and re- ian Laws, the proportion should be<br />\nupon a new financial plan. This pro,Income<br />\nproduce.\"<br />\napproximately a one-to-one ration.<br />\nOf<br />\nroadway in recent years,\" said LevUniversity the Post (JIi,2ii G1ci in Hall, and will<br />\nne. \"Once in a Lifetime enjoyed a cedure has been undertaken with sevEspecially interesting are these orDoes Not Follow Mendels Laws<br />\nbe opc n until<br />\non Wednesday.<br />\nAlso<br />\nHere is the reason for all this atten- ganisms to Dr. Metz from the cytolhenomenal run in New York several eral aims in view: first with the aim<br />\nluacer.zate In Past<br />\nUnexpectedly<br />\nears ago, showing for 305 consecu- of making the Hullabaloo a financially tion. Sciara is one of the few organ- ogical point of view, as they provide<br />\n--- •<br />\nAlthough the Johns Hopkins stutive performances in the Music Box solvent activity, second, with the aim isms which does not follow the Men- excellent material for the study of<br />\nFinancial conditions of The Johns derr.s and lacur4 have<br />\ndelian Laws of heridity. However, this salivary gland chromosmal structure.<br />\nnever yet<br />\n!Theatre.\"<br />\nof enlarging and elaborating the many<br />\nHopkins<br />\nUniversity have taken a<br />\nlarval<br />\nIn<br />\nthe<br />\nstage,<br />\nchromosomes<br />\nthese<br />\nthey<br />\nmean<br />\nnot<br />\nin<br />\ndoes<br />\nthat<br />\nway<br />\nany<br />\nr..'<br />\nI<br />\ncc<br />\nThe Kaufman-Hart play was placed<br />\nforecasters of<br />\nfeatures of the book in order to give follow no set laws. They have are very large, and are easily obtain- turn<br />\nfor the better for the first time thic<br />\np.triong the ten best shows of its sea, t!,ey are to<br />\nmore to both seniors and lower classa set of hereditary laws all of their able for diSsection and smearing.<br />\nbon and was highly praised by New<br />\nin the past several years. In the last<br />\nc•<br />\nigh this<br />\nmen.<br />\nLast year several new mutations,<br />\nown, and a very easy one to follow<br />\nYork critics. The New York Times dereport, Henry S. Baker, University local vote, v. a::<br />\na part<br />\nIn the course of making this policy once it is understood. Dr. Metz and that is heritable differences in body<br />\nscribed Once in a Lifetime as \"a hard,<br />\nTreasurer, announced that for the of a national tabwatien<br />\ncharacters,<br />\nan<br />\nwere<br />\nactuality,<br />\nproduced<br />\ndifficulties<br />\nexposmany<br />\nby<br />\nhave<br />\nto<br />\nSciara<br />\nstudying<br />\nto<br />\nCrouse<br />\nMiss<br />\nare<br />\ndetermine<br />\nwift satire, fantastic and deadly, and<br />\ncoming year ending June 30, the defi- the sentiments of<br />\nthe campuses<br />\null of highly charged comedy lines.\" been encountered, and numerous mis- find out exactly what it is in the fly ing the insects to radium. These mutacit had fallen $71,000 below the figure<br />\narose<br />\ntions<br />\ntakes<br />\nnot<br />\nindividuals<br />\nhave<br />\nin<br />\nthe<br />\nbeen<br />\nexmade.<br />\nThat<br />\nabnormal<br />\nthis<br />\nhas<br />\nresponsible<br />\nis<br />\nthis<br />\nthat<br />\nfor<br />\nThe script of Once in a Lifetime rethroughout the country. These reestimated for the Homewood branches<br />\nposed, but in their off-spring.<br />\n• uires a cast of about sixty charac- been so is regretable and none will genetic behavior.<br />\nof the University. The market value turns are to be published as soon as<br />\ntempted<br />\nOne<br />\nis<br />\nto<br />\nmore<br />\nphilobecome<br />\nbe<br />\nready<br />\nthan<br />\nto<br />\nerror<br />\nadmit<br />\nslightly<br />\nfly,<br />\nsmall<br />\nSciara<br />\nis<br />\na<br />\ners, many of them being important<br />\nof the University investments has they can be counted and, if past peroles,\" said John E. Desch, new di- 1those directly concerned with its °e- smaller than the common fruit fly, sophical when observing these flies.<br />\nrisen<br />\npossible<br />\nquite<br />\nfrom about $27,000,000 to $29,- formances are to be considered, will<br />\nthat<br />\nis<br />\nIt<br />\nfuture<br />\ncurrence.<br />\nscienthe<br />\nremains<br />\nBut<br />\nfact<br />\nthat<br />\nfor<br />\nregions<br />\nand is know in mushroom<br />\nector of the Barnstormers. \"There<br />\npoint to the man not to'be elected<br />\nre seven complete changes of seen- the Hullabaloo must have the sup- the damage which it does to the young tists may find out that there are many 000,000.<br />\nAlthough the sustaining fund drive<br />\nNo Signed Ballots<br />\n• ry, necessitating, besides the cast, port of the majority of the Senior mushroom plants. In the larval stage, organisms which inherit in this mat,Class in order to be successfully ex- similar to the caterpillar stage of but- ner and that our own human scheme which was put through last year to<br />\n• large production staff.<br />\nWith a canipuz nearly one-half demecuted.<br />\nterflies, except that these are much of Mendelian inheritance is only an account for the expected deficit, yield\"So much has already been said<br />\nocratic in party leanings, and a small<br />\nsmaller,<br />\nthe larvae devour over their off-shoot of this particular \"maternal ed $512,000 at the time of the last<br />\nThe support solicited is of a finanbout this exceptionally good play,\"<br />\ngroup<br />\nof vociferous socialist and other<br />\ninheritance<br />\nscheme\"<br />\nas<br />\nit is called by report, the need is still felt for more<br />\ncial nature and is entirely within the own weight in mushrooms.<br />\ncontinued Mr. Desch, \"that it is almost<br />\ngeneticists.<br />\nThat<br />\nthe<br />\nis<br />\nfunds.<br />\nthe<br />\nleftist<br />\nThe<br />\nMendelquestion<br />\nsympathizers, it has been depermanent<br />\norganisms<br />\nthe<br />\nendowment<br />\nall<br />\nnearly<br />\nIn<br />\nlike gilding the golden eagle to say limits of that obtained in past years.<br />\nEach Senior will be asked in the ian Laws of inheritance hold. In short upon which many scientists, and fund of an additional $10,000,000, is cided to provide space on the ballots<br />\nanything else. But it is an hilarious<br />\n,next two weeks in October to sign a this means that both parents have an scientific philosophers will be working still badly needed, if the activities of for unnamed candidates. The ballots<br />\natire in the typical Kaufman-Hart<br />\npledge of $10 in return for which he equal opportunity to transmit any one in years to come, and all that we can the University are to continue unmood and I guarantee that it will<br />\nare othei wise to be th4plicates of the<br />\nsay is \"More power to them.\"<br />\nhampered. Although severe economies<br />\nwill receive his photograph and his character to their off-spring.<br />\n'provide an evening of unfaltering enhave been effected in the operating Maryland official ballot, which will be<br />\nwrite-up in the Hullabaroo and also a<br />\ntertainment.\"<br />\nexpenses, to account for half the dif- used in the general election, listing<br />\ncopy of the annual. If necessary this<br />\nStage Door, George S. Kaufman's lat- fee may be paid from caution<br />\nference<br />\nin the estimated and the act- Alfred M.Landon, Republican; Frankmoney.<br />\neSt \"dig\" at Hollywood written in colual deficit, these have in sonic cases lin<br />\nThe need for a short subscription<br />\nD. Roosevelt, Democrat; Norman<br />\nlaboration with Edna Ferber showed<br />\nreflected adversely on the school, and<br />\ncampaign cannot be emphasized. BeThomas, Socialist; John M. Aiken;<br />\nat the Maryland Theatre last week.<br />\nthere is still need for additional decause of contract commitments, the<br />\nThe Barnstormers are holding a<br />\nvelopments in some departments of and Earl Browder, Communist; in the<br />\ntaking of formal photographs must<br />\nrally this Thursday evening to welorder named.<br />\nUniversity.<br />\nthe<br />\nTicket Holders To Hopkins<br />\nbegin November 2. Should any senior 225<br />\nVoices<br />\nHead<br />\ncome and entertain prospective memNo ballots are to be signed, since<br />\nIncreased Income<br />\nstill be uncertain at that date as to<br />\nProtest At New York<br />\nHear Dorothy Thompson<br />\nbers and to show them what the orthis is to be a poll conducted in the<br />\nAdditional<br />\nimprovement<br />\nsprang<br />\nwhether or not he will subscribe to the<br />\nganization is like. Shortly afterward<br />\n,from the unexpectedly increased in- manner, so far as possible, of the<br />\n0414/ Speak Tonight<br />\nAlumni Banquet<br />\n,Hullabaloo, he may have his picture<br />\nthe first try outs will be held.<br />\ncome of the University. The endow- national election, on a strictly non'taken for $1.00. This fee will be deWell over 225 members will attend<br />\nment of $4,636,000, was $8,000 more partisan basis. Of course, mutilated<br />\nteacher's<br />\nAssailing<br />\noath<br />\nthe<br />\nmoveducted from his pledge before Dethe first of a series of lectures given ment as a threat not only to the than was expected, while the actual ,ballots will be voided, since to concember 15 to appear in the book.<br />\nvalue of the endowment can be as- sider them would be unfair to the<br />\nIt should be realized by every sen- by the University Supper Club this independence of American universicribed to an increase through actions nature of the poll.<br />\nior that every attempt has been made evening in Levering Hall, at 6.00 P. ties but also to the nation as a<br />\nThe NEWS-LETTER, through its ediof the Treasurer's office in June 1935,<br />\nto present a fair, honest and equit- Miss Dorothy Thompson of the whole, Dr. Isaiah Bowman, President<br />\nwhen it was decided to write down torial and news columns has been<br />\nOver One-Fourth Of Senior Class able plan. Because seniors derive more<br />\nof the Johns Hopkins University,spoke<br />\nNew York Herald Tribune and wife of<br />\nthe securities to actual market values. active in placing before the student<br />\nlast Friday evening in the Hotel Pennfrom the Hullabaloo, they are asked<br />\nSubscribes In First<br />\nThis decreased the value of the en- body the various major issues in this<br />\nthe speaker.<br />\nwill<br />\nLewis<br />\nbe<br />\n'Sinclair<br />\nto contribute more to its budget than<br />\nsylvania before a group of over 500<br />\nHour<br />\nowment from $31,000,000 to $27,000,- election. With particular emphasis on<br />\nAccording<br />\nto<br />\nannouncement<br />\nan<br />\nlower classmen. Such an arrangement<br />\nHopkins alumni attending the annual<br />\n000, and absorbed a large part of the the problems of the students which<br />\nAccording to an announcement appears too logical to warrant fur- made by W. L. Hammaker, Executive banquet of the New York, New Jersey,<br />\nfind place in the campaign, there have<br />\naccumulated deficits.<br />\nmade yesterday by Henry Kramer, ther elaboration. At this point we can 'Secretary of the University Y. M. C. Connecticut Alumni Association.<br />\nBut with the market value back on ,been numerous articles and letters<br />\nfurther<br />\nItusiness Manager of the Hullabaloo, #o no<br />\nwithout some concrete<br />\n\"I wish you could view this oath,<br />\nA., the lecture will take place in the<br />\na higher level, the fund is up by as well as editorials, published to give<br />\nthe new financial plan under which the index of your support. The 1937 Hulmovement as a symptom with broad1<br />\n$2,000,000, about half of which can ,as complete a picture as possible for<br />\nfaculty dining room in Levering Hall<br />\nannual is working this year has labaloo is your book and if you would<br />\nest implications,\" Dr. Bowman said.<br />\nbe attributed to bonds, and the rest to the readers to consider.<br />\n4larted off quite successfully. Yesterit a credit to the graduating so that this large group may be ac- \"Universities have made their contririses in stock values. This will go a<br />\nday when various members of the staff class of 1937 and to the Hopkins, it commodated comfortably.<br />\nbutions to the life of their times and<br />\nlong ways toward easing the condi,iPpealed to Seniors for the year- resides largely in your power to have<br />\nFollowing the Supper Club lecture, also to the corpus of useful knowledge tion, but<br />\nthe drive is still to be pushbook they succeeded in obtaining 40 it so. The decision rests with you, the Miss<br />\nThompson will give a lecture at and to the philoosophy of living, by ed for the sustaining and other ensubscriptions in about one hour.<br />\nhaving and keeping that independence<br />\nsenior class, and we hope, that upoia<br />\n8.15 in the Wilson Memorial Church<br />\ndowment fund. Out of deference to<br />\nwithout which there can be no endurThe slip which the Seniors are asked due consideration, your answer will be<br />\nthe Community Fund Drive in the<br />\nat University Parkway and Charles<br />\nt 0 sign states: \"I hereby promise<br />\nAlumnus Presents Books Through<br />\ning vitality of thought. It is necessary<br />\nto a favorable one.<br />\nStreet. This will be the first in a series to underscore the need for alertness city, activities will be slowed down<br />\n\"Friensti Of The<br />\nPay $10.00 for my appearance in the<br />\nSigned,<br />\nhere, pending a new opening later. In<br />\nLibrary\"<br />\nof University lectures also sponsored in reference to this movement and to<br />\nSenior section and one copy of the<br />\n-Robert Austrian<br />\nthe late fall, there will be an intens1937 Hullabaloo.\" This sum may be<br />\nby the \"Y\". At this lecture Mark S. every other sign of invansion of univer- ive drive in the Chicago and St. Louis<br />\n\"The University library,\" announcsity independence, for without indePaid at any time and may be taken<br />\nWatson, editor of the Sunday Sun,<br />\nareas, with the Alumni Association<br />\ned Dr. John C. French, librarian, \"has<br />\nout of the caution money.<br />\npendence good work cannot be done<br />\npreparing to shift its attention to the<br />\nwill introduce Miss Thompson. Over in<br />\nreceived from Dr. Lawnson Brown,<br />\nthe fields of social sciences and<br />\nWith over one-fourth of the Seniors<br />\nnew fields.<br />\n500 tickets have been sold for this humanities.\"<br />\nA.B., '95, M.D., '00, of Saranac Lake,<br />\nalready signed up, Kramer said, \"The<br />\nlecture series, and it is expected that<br />\nNew York, some twenty-odd addi\"If we are to keep the university as<br />\noutlook is very bright\". However, any- Figures Show<br />\nLanguage And the final sale will reach<br />\ntional<br />\nitems for the expansion of the<br />\nlast year's a symbol of man's aspirations toward<br />\none else wishin gto sign up may do so<br />\nNYA<br />\nDeadlines Given<br />\nEducation Courses Most In<br />\n,the highest realizable powers, we must<br />\nOliver Wendell Holmes Collection,<br />\nat the<br />\ntotal.<br />\n---from<br />\nday<br />\nany<br />\nHullabaloo office<br />\nFavor<br />\ntake into account also the emotions<br />\n1 2.20 to<br />\nGraduate NYA time reports must which he presented to the University<br />\n1.00<br />\nHuntley Lloyd, '38, will be chairman<br />\nof men, their aesthetic satisfactions, ,be in the office of the Bureau of Ap- in 1932 through the Friends of the<br />\n1t. was also announced that there<br />\nExceeding last year's enrollment of of the University lecture, while Lawwhat men can do with free time at pointments on , Wednesday, October ,Library.\" It is this group, the Friends<br />\nwill be a meeting of the business staff students to the same date by a large<br />\nrence Hanawalt, '38, will act as chair- each level of achievement. The col21, and undergraduate reports on of the Library, which contributes the<br />\nat 12.20<br />\nnumber, there were 1,170 registrants man for the Supper Club.<br />\ntomorrow.<br />\nleges are one agency of society, not Thursday, October, 22. No payment greater part of the annual new addiCollege<br />\nfor Teachers by October<br />\nin the<br />\nIt is of general interest to note that the whole of society, and they can<br />\nfor the month can be made if report (dons to the University library.<br />\n15 this year, as compared to the 1,105 about 60, or well over one-fourth of only rise<br />\na little above the level of is turned in late.<br />\nThis collection, said to be one of<br />\nGym Opened To Women<br />\nof last year, according to the state- the total membership of the Supper available material.\"<br />\nthe best of its kind, is made up of<br />\nStudents And Employees ment issued by Dr. Florence Bamber- Club, are from Goucher. Because of At the banquet the Alumni Associamanuscripts, quiz questions from Dr.<br />\nFraternity Heads<br />\nger, head of the College of Teachers. the large membership subscriptions tion elected its officers<br />\nfor the coming<br />\n,Holmes' classes in anatomy, rare<br />\nThe gymnasium will be open for Enrollments last year reached a sum for<br />\nsingle lectures will be extremely year. the list of new officers follows:<br />\nTo Sign Contracts phamplets, letters and first editions.<br />\nWomen members of the University on total<br />\nof 1,418 students. It may be limited, but a few may be obtained<br />\nDr.<br />\nDorsey<br />\nRichardson,<br />\nPresident,<br />\n\"Oliver Wendell Holmes, over a<br />\nWednesday Evenings, beginning toAll heads of social fraternities<br />\nexpected that the totals this year at the single price of 50 cents.<br />\nA.B. '15, A.M. '17, Ph.D. '20 (Pol. Scilong<br />\nperiod, played so large a part<br />\ntilorrow night, announced Dr. Willson<br />\nare requested to be in the office of<br />\nwill therefore exceed by far that numIn conjunction with the University ence); Dr. Edward M Armstrong, Vice<br />\nin the literary history of New EngSchaffer, Associate Director of the ber, the assumption being based<br />\nHullabaloo<br />\nthe<br />\nWednesday<br />\non,<br />\non lectures a display at the Pratt Free President, MD. '10; Mr. Frank G.<br />\nland that a rich collection of his<br />\nAPhysical Education department.<br />\nThursday, or Friday of this week<br />\nthe aforementioned statistics. Con- Library began yesterday. It contains 'Breyer, Vice President, A.B.<br />\n'08, A.M.<br />\nworks constitutes a valuable basis<br />\n'. This will be the third year that the sidering these figures it is significant pictures<br />\n12.30 to 1 o'clock to sign<br />\nof all of the speakers for this ,'10 (Chemistry); Mr. Edmund C. from<br />\nfor the students of our University in<br />\ncontracts for fraternity photos<br />\ntYrn has been open to women. Last that the College of Arts &amp; Sciences, year and displays<br />\nseveral of their Lynch, Vice President, A.B. '07; Mr.<br />\nthe study of his time and his conYear several \"games\" of basketball too, this year has enrolled its largest<br />\nand places in the 1936-37 Year<br />\nworks which may be obtained at the Carl S. Stern, Vice President, A.B. '05;<br />\ntemporaries in literature,\" added Dr.<br />\niind,<br />\nBook.<br />\ninton were played.<br />\nentering freshman class.<br />\nlibrary.<br />\nContinued on page 3, col. 1)<br />\nFrench.<br />\nceive<br /><br />\nKaufman - Hart Play Chosen<br />\nGroup<br />\nFrom<br />\nOf Four<br /><br />\n'Sixty In Cast<br /><br />\nUniversity Deficit<br />\nLess Than Expected<br />\nLast Fiscal Year<br /><br />\nOPEN LETTER<br /><br />\nPoll Ends Wed.<br />\nReturns<br /><br />\nOf<br /><br />\nSENIOR CLASS<br /><br />\nIncreases<br /><br />\nFirst Supper Club Bowman Assails<br />\nLecture Tonight Teacher's Pledge<br /><br />\nNew HullabalooPlan<br />\nProves Sucessful<br /><br />\nhave<br /><br />\nLibrary Increases<br />\nHolmes Collection<br /><br />\nOver 1170 Enrolled<br />\nIn Teachers College<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br /><br />\n2<br /><br />\nObe jo1jni5 TOoptiiroS<br /><br />\nVote, Vote Vote<br /><br />\nWHY NOT THOMAS?<br /><br />\nOnce again the students and<br />\nfaculty of the Johns Hopkins Uni-<br /><br />\nPews<br /><br />\nfatter<br /><br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council, RemDen Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to -June. except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL STAFF<br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan<br />\nManaging Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nBenjamin Root<br />\nAssistant Managing Editor<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors<br />\nIsadore Gertnian, Wethered Barron<br />\nNews Editors<br />\nReporters Max Iskowitz, Nathaniel,<br />\nFinkelstein, Jewett Goldsmith, Howard Reizenstein, Julian Adler, Carl<br />\nResin, Floyd<br />\nKatske, Leonard<br />\nRubinger, Morris Wessel, Arthur<br />\nKatz, Martin Krieger, Lester Rosenthal, Sidney Baum.<br />\nBUSINESS STAFF<br />\nWilliam B. Kempton....<br />\nBusiness Manager<br />\nMelville Locker<br />\nAssistant Business Manager<br />\nWm. C. Erlanger<br />\nAdvertising Manager<br />\nGerald WiIlen<br />\nCirculation Manager<br />\nHoward Linkoff<br />\nOffice Manager<br />\nNathaniel Soifer<br />\nCopy and Filing Manager<br />\n1936<br /><br />\nMember<br /><br />\n1q37<br /><br />\nPissociated Galle6icie Press<br />\nDistributors co<br /><br />\nColie6iak)Dieest<br />\nTuesday, October 20, 1936<br /><br />\nEddy On .Russia<br />\n.Dr. Sherwood Eddy's all too brief<br />\naddress in Maryland Hall last Thursday should emphasize, more than ever<br />\nbelore, the fact that, whether friend<br />\nor foe, all must realize the significance of what is going on in Russia<br />\ntoday. And that realization can be<br />\nbrought about only by adopting a<br />\nsympathetic attitude toward Russia.<br />\nThe importance of the economic and<br />\nsocial revolution undertaken by the<br />\nSoviets must not be underestimated.<br />\n,it is, certainly, \"one of the boldest<br />\nexperiments in the history of civilization,\" and much a the future of<br />\ncivilization depends upon the results<br />\nef that experiment.<br />\nThe \"Y\" should be congratulated<br />\nfor bringing Dr. Eddy to the Hopkins<br />\nduring the assembly hour. Perhaps<br />\nthis action will be an inspiration to<br />\ntne Student Council.<br /><br />\nVs.<br />\nThursday night a meeting was held<br />\nIn New York City. it was called by<br />\nvarious liberal groups of the metropons as a mass protest against the<br />\nreelection to the State Senate of one<br />\nJohn J. MeNaboe. Mr. McNaboe, it<br />\nseems, has built up for himself quite<br />\na reputation for Americanism.<br />\nHe has, among other things, advocated Leachers' oath bills; he has requested and received from the State<br />\nSenate $1.5,000 for the investigation of<br />\n\"unarnerican activities;\" he has encouraged the legislation of numerous<br />\nacts restricting education freedom.<br />\nAnother American was in New<br />\nYork Friday evening--one Isaiah<br />\nBowman, president of an enlightened<br />\nUniversity. This one had other ideas<br />\non academic freedom. Among the remarks which he made on teachers'<br />\nbilis were the following:<br />\n\"I wish you could see this oath<br />\nmovement as a symptom with<br />\nbroadest implications,\" he said.<br />\n\"Universities have made their<br />\ncontributions to the life of their<br />\ntimes, and also to the corpus of<br />\nuseful knowledge and to the philosophy of living, by having and<br />\nkeeping that independence without which there can be no enduring vitality of thought.<br />\n\"It is necessary to underscore<br />\nthe need for alertness in reference to this movement and to<br />\nevery other sign of invasion of<br />\nfor<br />\nindependence,<br />\nuniversity<br />\nwithout independence good work<br />\ncannot be done in the fields of the<br />\nsocial sciences and humanities.\"<br /><br />\nidency of the United States. It has<br /><br />\nThis is the fourth and last of a series of articles by students of the Johns<br />\nHopkins University in connection with the presidential election.<br />\nEX CATHEDRA<br />\nOnce, for their defense and main- profit of these articles. While people<br /><br />\nbecome of late a habit of the<br /><br />\ntenance of Socialism and democracy, cry for work, he gives them a business<br /><br />\nversity have the opportunity to<br />\nexpress their choice for the pres-<br /><br />\nSocialists<br /><br />\nwere<br /><br />\ncalled<br /><br />\nNEWS-LETTER to attempt to read<br /><br />\nthe<br /><br />\nthe<br /><br />\nCommunists 'social fascists,\" \"petit<br /><br />\npolitical<br /><br />\nCampus<br /><br />\nbarometer of the<br /><br />\nand<br /><br />\nthe<br /><br />\nresults, one<br /><br />\nway or the other, are always in-<br /><br />\nbourgeois\"<br /><br />\nand<br /><br />\nany<br /><br />\nother<br /><br />\nwith the dis-<br /><br />\nSimultaneously<br /><br />\nThe October tenth issue of Time<br /><br />\nwhich might come into mind. Today, ding for business' aid to the DemoJoe Stalin down who have turned profits have been derived under Rooseineir backs on the Socialist ideals and velt. While Roosevelt waxes hot be-<br /><br />\nNEWS-LETTER blank ballots are<br /><br />\nwait their turn to vote \"aye\" on any fore the labor element, the labor hat-<br /><br />\nbeing distributed in the Post Of-<br /><br />\nreform, which the capitalists might ing element in the Party is in search<br /><br />\nfices boxes of all undergraduate<br /><br />\ngrudgingly give to the people to cov- of support from<br /><br />\nstudents. Needles to say, unless<br /><br />\ner, if they can, their black trail of New Deal. Not forgetting that Gar-<br /><br />\na large percentage of these bal-<br /><br />\npoverty and disaster.<br /><br />\nlots are returned, the purpose of<br /><br />\nbusiness for the<br /><br />\nner was Hearst's man for president<br /><br />\nSo it has come about that the word in 1932, he is a typical bit of the conof God, Joe Stalin (not Father Di- servative quorum in the Party.<br /><br />\nthis poll will be defeated.<br />\nThe NEWS-LETTER is trying not<br /><br />\nvine) has been \"If you can't vote<br /><br />\nonly to measure tendencies on the<br /><br />\nCommunist, vote Democratic:\" Social- and cold not only on economic mat-<br /><br />\nOur \"Little Boy Blue\" blows hot<br /><br />\nlocal Campus, but it is as well, by<br /><br />\nists haven't forsaken Lee workers and ters but also on peace. While he in-<br /><br />\ncooperating in a national poll of<br /><br />\nstudents.<br /><br />\nstudent opinion, attempting to<br />\ndiscover<br /><br />\nthe<br /><br />\nopinions<br /><br />\nof<br /><br />\nthat<br /><br />\ngroup into whose hands the government of America will soon fall.<br />\nOf late years, the voice of the<br />\nAmerican<br /><br />\nstudent<br /><br />\nhas<br /><br />\nbecome<br /><br />\nheard far and wide; and it has<br />\nbecome loud enough to begin to<br /><br />\nvokes the blessed guardian angel, Pax,<br /><br />\nIt is not because of the fascist with the left hand, with the right he<br />\nscare that I am against Landon and signs the appropriation<br /><br />\nbills of a<br /><br />\nthe Republican Party and all that they biiiion dollars for the militarization<br />\nmight represent. We are living under of the country. Not only has he spikCapitalism. As such we must accept ed every conference for world peace<br />\nit or, if we don't, then attempt to but also has steadfastly refused to<br />\ncnange the existing order.<br /><br />\nforsake the traditional policy of na-<br /><br />\nLiberalism has been advanced as tionalism and isolation.<br /><br />\nexert some effect upon public pol-<br /><br />\ntile battle cry of the Democrats (or at<br /><br />\nicies and opinion.<br /><br />\nleast of some of them.) Franklin saken all to defend capitalism from<br /><br />\nSeveral weeks ago, in stress-<br /><br />\nThough Communists may have for-<br /><br />\nDelano Roosevelt has been pictured the big bad wolf, Socialists still re-<br /><br />\ning the importance of the 1936<br /><br />\nto us by his cohort6 and the Commun- main the vanguard of worker's and<br /><br />\npresidential election to the stu-<br /><br />\nists as wreathed in a golden halo of student's movements for a classless<br /><br />\ndent<br /><br />\nbodies<br /><br />\nof<br /><br />\nAmerica,<br /><br />\nthe<br /><br />\nNews-LETTEa said that \"never be-<br /><br />\nvirtue. But more of that later.<br /><br />\nsociety. The theories of Socialsm have<br /><br />\nLandon also is a representative of been expounded in much fullness, but<br /><br />\nfore have the issues involved in a<br /><br />\nlioeralism.<br /><br />\nnational election been so vital to<br /><br />\ntnat archaic liberalism, which lived ploited, workers of hand and brain,<br /><br />\nthe college student.\" Throughout<br /><br />\nonly in the minds of theorists and to unite and take over the means of<br /><br />\nthe country students are awaken-<br /><br />\nnever lived to see the Light of day. production and distribution, running<br /><br />\ning to that fact. Throughout the<br /><br />\nIt is his contention that laissez-faire, inustry not for profit but for the com-<br /><br />\ncountry students are preparing to<br /><br />\nthe pure capitalism, and therefore, the mon good.<br /><br />\nexpress their opinion on one of<br /><br />\ntrue liberalism, can be established in<br /><br />\nthe most critical presidential elections in many years. A negligiole<br />\npercentage of these will actually<br />\nbe able to vote on November .:.<br />\nBut upon the results of the numerous unofficial Campus polls<br />\nwill, from many points of view,<br />\ndepend the lulu'e of America.<br />\nIn a very few years, the students will be the governors of<br />\nAmerica. To a great extent their<br />\npresent training and their present<br />\ntendencies will shape ,the direction of future action. It has been<br />\npointed out in previous issues of<br />\nthe News-LETTER that this is a<br />\ncritical election because it represents the point at which one of<br />\ntwo diverging trains of thought<br />\nwill take over the domination of<br />\nour national life.<br />\nWhich will the students of the<br />\nHopkins, and of America, choose?<br />\n* * * *<br /><br />\nAmerica, even after monopolies have italism, nor do they want any more<br /><br />\nA few remarks of historical interest are here in order. Herbert<br />\nHoover won the student poll in<br />\n1932. Albert Ritchie won the gubernatorial poll of the faculty in<br />\n1934. The mere fact that both of<br />\ntnese men were ultimately defeated is of little consequence.<br />\nWhat is more important is this:<br />\nin 1932 Hopkins sentiment chose<br />\na good old-fashioned, \"do-nothing\" Republican; two years later<br />\nit selected a consei vative Democratid reformer. Last spring at<br />\na preliminary student poll of the<br />\nCampus President Roosevelt was<br />\nchosen to succeed nimself.<br />\nThe change of opinion is interesting. The results of today's poll<br />\nwill probably agree with last<br />\nSpring's. If it does, it would be an<br />\ninteresting study for some historian or sociologist to attempt to<br />\nexplain why undergraduate Hopkins evolved as it did from reaction to liberalism.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nFive names appear on the balott which is being distributed by<br />\nthe NEWS-LETTER. Two of them<br />\nare capitalists; three are socialists, of one kind or another. Most<br />\nof the discussion which has appeared in these columns and in<br />\nthis paper during the past three<br />\nweeks has centered aout the two<br />\ncapitalists.<br />\nThe NEWS-LETTER has presented .<br />\nits case for Mr. Roosevelt, as well<br />\nas its case against Mr. Landon. It<br />\nis still convinced that in Mr.<br />\nRoosevelt's direction lies the path<br />\nof liberalism and economic freedom. It still believes that Mr.<br />\nRoosevelt's record is good enough<br />\nto warrant his reelection. It still<br />\nbelleVes tnat the tendencies and<br />\nbasic philosophy of the Roosevelt<br />\nAdministration assures a bright<br />\nfuture for America.<br /><br />\nHowever, he<br /><br />\nC AMPUS<br />\nwith<br />\nSTANLEY MORTON FINKEL<br /><br />\nepithet carries a full page advertisement, bid-<br /><br />\nof this issue of the<br /><br />\ntribution<br /><br />\nrflJ E<br /><br />\nby the index of 103.<br /><br />\nit is these same Communists from cratic Party, pointing out that huge<br /><br />\nteresting.<br /><br />\no<br />\n0K<br />\nI RCLI N' B REVIEW Ci<br /><br />\nadvocates briefly it calls upon all who are ex-<br /><br />\nSocialists want no patching of Cap-<br /><br />\ngobbled up the little man and com- \"square deals\" or \"new deals.\" They<br />\npetition is a thing of the past, except demand, rather, the calling for a new<br />\nfor all good Republicans to rant about. deck and a game played over the<br />\nHe continues this advocacy in the table with no aces and trumps hidlight of the facts that his campaign den up the sleeves.<br />\nfunds are coming from those monopolies he some times condemns.<br />\nEnough rabid articles have appeared in the NEWS-LETTER against the<br />\nRepublicans and Landon, assuring me<br />\ntout my choice bit need not be added<br />\nto the others. It is to Roosevelt to<br />\nwhom I wish to turn and then to give<br />\nthe Socialist plan for America.<br />\nI stated above that F.D.R. has been<br />\npictured as the Shiloh of American<br />\ntioeralism, the benefactor of the workers and the guardian and leader of<br />\nour salvation. Without resort to insane ravings but rather with an examination of the facts let us look at the<br />\nDemocratic party, its principles and<br />\nits leader today.<br />\nIf the Democratic Party has changed overnight to a Farmer-Labor<br />\ngroup, I have still to see the result. I<br />\nstill see in its party's council chambers<br />\nGlass, Robinson, Farley, et al; all<br />\nwho personify and glorify our system<br />\nof exploitation of humans for indivual profits. Nor have I yet seen where<br />\nNegroes have received political and<br />\neconomic equality. It is in the Democratic states where the lynch law is<br />\nused, where in the solid South the<br />\nNegroes are kept in utter ignorance<br />\nwhile Roosevelt does nothing about it.<br />\nIt is in Joe Robinson's state of<br />\nArkansas that share croppers live in<br />\nmoral, economic, and political degradation. Because of him and his Democratic administration back home no<br />\nlegislation can be ventured in Congress for the relief of Tobacco Road.<br />\nOr remember the time relief cases<br />\nin Massachusetts as well as in other<br />\nparts of the country, where people<br />\nwere taken off the relief rolls and<br />\nforced into privately owened sweatshops, in which the maximum pay was<br />\n$3 a week. 'today, dispite the oaths<br />\nto the contrary, relief rolls are still<br />\nbeing managed by political wags,<br />\nwhose interest lies not in the unemployed, but the maintenance of fat<br />\nrelief jobs for the \"boys\" in the party.<br />\nNeedless to say, collective bargaining<br />\non relief strikes is squelched.<br />\nBecause of his insistence for a conservative Social Security Bill, Roosevelt has given us a sample of what a<br />\nSecurity Bill is not. It is more like<br />\n.the game of \"now you see it, now<br />\nyou don't.\" Its benefits are negligible<br />\ndanger for the workand fraught<br />\ner. No greater farce has come out of<br />\nCongress unless it might be the program for the slaughter of cows and<br />\npigs, for the extermination of farm<br />\nproduce, and for restriction of the<br />\nmanufacture of the necessities of life<br />\nin order to maintain the price and<br /><br />\nTo those who fear another war,<br />\nbrought about by individual greed<br />\nfor markets and raw materials, to<br />\nthose who desire social and economic<br />\nsecurity and justice for all, to all those<br />\nwho believe that the way out is not<br />\nthrough the destruction of the necessities of life, that freedom is a virtue,<br />\nthat fascism is a threat, that we can<br />\nbuild a world which will supply our<br />\nwants -I say -Vote Socialist.<br /><br />\nFrom a certain teacher of a certain<br />\nsubject in a certain way comes the<br />\nregular repetition of history when it<br />\nis learned that someone translated<br /><br />\nHalf Way With Roosevelt, by<br />\nErnest K. Lindley. Viking Press.<br />\n$2.75.<br />\nHalf Way With Roosevelt, writteill<br />\nby the star political observor of the<br />\n.New York Herald Tributne, is one of'<br />\nthe finest bits of contemporary history written in recent years. It is, in<br />\n,brief, an objective history of the first<br />\nthree years of the Roosevelt administration.<br /><br />\nAd.<br /><br />\nSe<br /><br />\nhauslich as \"homely.\"<br /><br />\nThis is the third book of its kind<br />\n\"I am not the executioner in this written by Mr. Lindley. Five years<br />\n,je<br />\nitlasb.<br />\nclass; I merely watch you commit ago appeared Franklin D. Roosevelt:<br />\nsuicide,\" came the reverberating A Career in Progressive Democracy;<br />\nand in 1932 The Roosevelt Revolution:<br />\n.comment, \"You're sitting on the fence<br />\ndifirst Phase was pulbished.<br />\nfe A<br />\nand leaning the wrong way!\"<br />\nMr. Lindley's opus is certainly ones<br />\nHeard from one of two nocturnal of the clearest and most intelligent'<br />\nhap:<br />\nstrollers walking through the Gilman analyses of the New Deal. The vol-1 plati<br />\nHall path: You know, Stan, holding ume not only analyzes the basic phil-,<br />\nosophy of the New Deal, but attemptsi erin:<br />\nhands is more of a precaution than a<br />\nball<br />\nto show to what extent it has been<br />\npleasure.\"<br />\npractised, and weighs it in relation<br />\nThis story shows a-Peale of Hop- to the needs of a democracy under<br />\nJohnpeaf th'<br />\ncapitalism.<br />\nkins to the rest of the country.<br />\nIt<br />\ntreats<br />\ncomprehensively<br />\nwith<br />\nOn the license plate of his car,<br />\nPeale 1)aci a black and blue \"Johns every phase of the Roosevelt admin'<br />\nS<br />\nu. de<br />\nHopkirfs\" plate. No less than three istration. Mr. Lindley explains the<br />\nowe r'<br />\ngold<br />\npolicy<br />\nand<br />\nits<br />\ninfluence<br />\non<br />\nrecovcompanions<br />\nachis<br />\ntimes were he and<br />\ntee<br />\ncosted with the query \"Which fo you ery; the attitude toward labor; the<br />\n,various<br />\nrelief<br />\nprograms;<br />\nthe<br />\nhousing<br />\nguys is Johns Hopkins?\"<br />\nriot.<br />\n‘viauh<br />\n'<br />\npolicy; the possibility of war and<br />\nCast in the role of a shrewd and<br />\nP<br />\nRoosevelt's probable attitude towards<br />\nwily Rajah, George Arliss uses his<br />\nyNew<br />\nit. Openly and intelligently Mr. Lindsuave, incomparable performance in<br />\nicy discusses the rumors of Roosethe leading role of \"East Meets West\"<br />\nvelt's \"socialism.\"<br />\nw<br />\nTheater.<br />\nnow at the Little<br />\ntP<br />\nariea<br />\ni.d<br />\nHalf Way With Roosevelt is cerand<br />\nThis film will be reviewed next week<br />\ntainly a relief after the accumulated<br />\nLo g<br />\nIn this column.<br />\nfog of one of the thickest campaigns<br />\nIt was curious how much Earl in American presidential history. For<br />\nDr<br />\nBrowder impressed the guardian of the open minded reader, it is a boon<br />\nInSt<br />\nthe law when the Communist candi- of information and clear thinking.<br />\nhe<br />\ndate addressed 1,447 people (yes, we<br />\nMr. Lindley is one of America's<br />\np un<br />\ncounted them) last Sunday.<br />\nace political observers. He covered<br />\ncora<br />\n\"Say, that was some swell speech,\" Roosevelt from the time he went to<br />\nniti•<br />\nsaid a lieutenant who voiced the opin- Albany as Governor of New York unor<br />\nion of most of ha colleagues.<br />\ntil the summer of 1936, when his<br />\nmeti<br />\n,paper assigned him to Governor LanSMOKE GETS IN OUR EYES<br />\ndon.<br />\niesti.i<br />\nIn one of our more enlightened<br />\n,link<br />\nc<br />\nau<br />\nclasses at the beginning of the year<br />\nthe instructor said, \"Fellows, we will<br />\nPindar, A Poet of Eternal Ideas.<br />\n1 D<br />\npermit smoking in this class— that is,<br />\nBy David M. Robinson, Ph.D.,<br />\n(he turned to the sole feminine memLl.D., Lett.D., 117 pp. $3.50 Johns<br />\nber of the class) if you don't object.\"<br />\nHopkins Press, Baltimore.<br /><br />\nHer<br /><br />\nt<br /><br />\nShe shook her head as she proved<br />\nAny work written by Professor<br />\nto be the first to take advantage of Robinson will interest Greeks; any<br />\nthe new ruling, soon smoking four iword spoken will command the atcigarettes that period.<br />\ntentions of Hellenes. Professor Robinson is known in Greece and among<br />\n, There are plenty of former City<br />\nAmericans of Greek descent not only<br />\nCollege students now at Hopkins who<br />\nas a great authority on all things<br />\nwere in the cast of \"Once in a LifeHellenic, but also as a true and valutime,\" Eddie Bauernschmidt took the<br />\n,leading role; Dianiond was an artist; able friend.<br />\nand we were several voices and noises<br />\noffstage.<br /><br />\nProfessor' Robinson, we have said,<br /><br />\nc<br />\nt'iri.si<br />\nforti<br />\nothc<br /><br />\nst<br />\nb°acit:.<br /><br />\neati<br />\nAillf<br />\nOf<br />\niel<br /><br />\n(Continued on page $, col. 2)<br /><br />\n1ami<br />\nGal<br />\nLou<br />\nlad;<br /><br />\nVICT016\\Y<br />\nDANCE<br /><br />\n4<br />\n1L.17e<br />\nm<br />\n,wh<br />\n,bet<br />\nEa<br />\nha.<br />\n0.1<br />\nm<br />\nwI<br /><br />\npri<br /><br />\nSATURDAY NIGHT 9 to 1<br /><br />\nPt<br /><br />\nFollowing The Haverford Game<br /><br />\nSi<br />\nki<br />\nIc<br />\nof<br />\nam<br /><br />\n-* THE TOWNSMEN<br /><br />\n•<br /><br />\nLEVERING HALL<br />\nPRICE $1 STAG<br />\nOR DRAG<br /><br />\nSponsored By The Cotillon Board<br /><br />\nAt(<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1986<br /><br />\nby<br />\n'ess.<br /><br />\nrittefl<br />\nof thei<br />\n•ne of<br />\ny hisis, in<br />\ne first<br />\ndrnin: kind<br />\nyears<br />\nemit:<br />\n'racy;<br />\nution:<br />\ny one<br />\nligent<br />\n• volphilernpts<br />\nbeen<br />\nlation<br />\nunder<br />\nwith<br />\ndininthe<br />\n•ecov; the<br />\nusing<br />\nand<br />\nards<br />\nLindoosecerlated<br />\naigns<br />\n. For<br />\nboon<br />\ng.<br />\nrica's<br />\nered<br />\nnt to<br />\nunhis<br />\nLan-<br /><br />\nas.<br />\nD.,<br />\nns<br /><br />\nessor<br />\nany<br />\n3 atobinnong<br />\nonly<br />\ntings<br />\nfalu-<br /><br />\nsaid,<br /><br />\n'asa<br /><br />\n6s,<br /><br />\nBuffet Supper<br />\nGiven By O.D.K.<br />\nTo Freshmen<br />\nAddresses Given By Mr.<br />\nThomas Hubbard And Dr.<br />\nMark Secrist<br /><br />\nSee Football Game<br />\nHershner Cross, Aided By<br />\nJerry Branower, Conducts<br />\nMeeting<br />\nAbout 150 freshmen attended a buffet supper presented by the Hopkins<br />\nChapter of Omicron Delta Kappa,<br />\n,National Honorary Fraternity last<br />\nFriday night. The supper, held in Levering Hall, preceeded the night foot(ball game between Washington and<br />\nJohns Hopkins.. Several prominent<br />\nespeakers both of the student body and<br />\nof the faculty addressed the group.<br />\nBowman Sends Greetings<br />\nHershner Cross, president of the<br />\nOi.udent Council, aided by Jerry Branuwer, served as Master of Ceremonies.<br />\ne.rreetings to the Freshman class from<br />\niL Isaiah Bowman, who w.,<br />\npot able to come in person because of<br />\nfa previous dinner engagement in<br />\n4:,lew York, were read by 13ranower.<br />\npresident Bowman said, in short, \"I<br />\nwish to express my cordial greetings<br />\nand good wishes to the entering class<br />\nand the hope that I may soon be able<br />\n,10 greet it in person.\"<br />\nPrinciples Of 0. D. K.<br />\nDr. Mark Howard Secrist, Geology<br />\n(Instructor at the Hopkins, addressed<br />\nthe group next, setting forth three<br />\nprimary principles of the O.D.K. A.<br />\n,oluing to Dr. Secrist, they are recognition of men who are active in one<br />\nor more activities on the campus, a<br />\nfnethod for bringing such men together so that they may serve the<br />\ninstitution as a unit, anti a means of<br />\nlinking the student body and the<br />\nfaculty.<br />\nDr. Thomas Hubbard of the Engineering School, the next speaker,<br />\n.turther developed the concepts set<br />\nforth by Dr. Secrist. He expressed the<br />\n;belief that O.D.K. performs two basic services: one to the University, the<br />\nOther to individuals of the student<br />\nbody. He explained that the five<br />\nstars on the Society's pin represented:<br />\nathletics, forensics, publications, educational entertainment, and scholarship. Men who possess a high degree<br />\nof ability in one or more of .those<br />\nitields get their reward in recognition<br />\nO.D.K.<br />\nHere Doctor Hubbard cited the<br />\namusing parable of the Order of the<br />\nGarter, when, in days of old, men<br />\nfought for the privilege of having a<br />\nlady give him her garter. This honor<br />\nsociety recognizes the contribution of<br />\nitune, energy and ambition of those<br />\nwho have left Hopkins as good as, or<br />\n(better than, when they entered it.<br />\nEach student should try just a little<br />\nharder to fulfill the requireents of<br />\nO.D.K. and, even if all do not reach<br />\nmembership, at least O.D.K. served as<br />\niin incentive to greater heights, a fact<br />\nwhich, in itself, justifies its existence.<br />\nInvited To Rally<br />\nLeaders of student activities were<br />\npresent and Martin Levine, president<br />\npf the Barnstormers, issued a hearty<br />\nnvitation to all to attend the Barnstormers' rally at the Playshop next<br />\n;Mursday.<br />\nThe meeting was climaxed by the<br />\nsinging of \"Dear Old Johnny Hopkins\" and \"On the Line\" under the<br />\nleadership of Holt Maulsby, chairman<br />\nof the Student Activities Committee,<br />\nand shortly afterwards the group adjourned to the football field.<br /><br />\n:-: BOOK REVIEWS :-:<br />\n(Continued from page 2, col. 6)<br />\ncan have the ear on Hellas any time<br />\nhe wishes. But when he writes on<br />\nGreece there is quickened attention;<br />\nhis work, in advance, is acknowledged<br />\nas authoritative and sympathetic.<br />\nPindar will continue the great reputation of the scholarly Philhellens. It<br />\nis the work of an archaeologist, philospher, litterateur--and humanist. It<br />\nwill be welcomed by all students of<br />\nthe great Greek poet; by all lovers of<br />\npoetry.<br />\nProfessor .mobinson's Pindar is a<br />\nbrilliant critique of the Theban poet.<br />\nIt is a work that shows the influence<br />\nof Pindar on the literature of many<br />\nlands and ages. The professor is a<br />\nforceful apologist and he establishes<br />\nthe fact that Pindar was not bare of<br />\nthought, philosophy, and human interest, as some have maintained. \"It is<br />\ngood,\" quotes Professor Robinson<br />\nfrom Fame!!, \"to have lived long with<br />\nPindar.\"<br />\nExcerpts from the N.Y. Herald Trib.<br /><br />\nMexico, A Revolution by Education, by George I. Sanchez, The<br />\nViking Press. 1936. $2.75. pp. 211<br />\nMexico has been studied and described in recent years by innumerable<br />\ntravelers, historians, economists. They<br />\nhave almost invariably reported a<br />\nstrange new spirit which seems to<br />\nhave pervaded the land; but in general these accounts have been confusing and often coflicting. In Mr.<br />\nSanchez' volume, we have Mexico<br />\npresented for the first time as an<br />\nexperiment in education; and for the<br />\nfirst time we have a clear and coherent story.<br />\nLast year, the Julius Rosenwald<br />\nFund decided to study the new school<br />\nmovement in Mexico and to study<br />\nthe way in which Mexico's revolutionary governments have been slowly<br />\nbut steadily removing obstacles in an<br /><br />\n:-: LETTERS TO THE EDITOR :-:<br /><br />\nattempt to secure some measure of To the Editor of the NEws-LErma:<br />\nsocial and economic progress for that Sir:<br />\nFirst I want to thank Mr. Fuchs<br />\nimmense portion of its population<br />\nfor his \"few words of criticism\"<br />\nwhich had been living in extreme povwhich he thought my article deerty and ignorance. Mexico, A Rev- served. It is impossible to deny his<br />\nolution by Education is the result of point, namely that I neglected to<br />\nmention the fact that the Depression<br />\nthat Investigation.<br />\naccompanied the unbalancing of the<br />\nexbeen<br />\nFor centuries Mexico had<br />\nNew York budget when F.D.R. was<br />\nmost<br />\nploited; its people held in the<br />\nGovernor. But succeeding happenings<br />\nextreme ignorance. Fifteen years ago<br />\nseem to indicate that the Governor<br />\n,the new government became estab- had more to do with it than the Delished politically. Lacking all the ne- pression, especially when the case is<br />\ncessary facilities--teachers, buildings, compared wiLh that of Kansas under<br />\nmark<br />\ntraining--hindered by differences in Landon. Though the low-water<br />\nof the Depression had been reached belanguage and custom, it nevertheless<br />\nfore the latter assumed office, the two<br />\nlaid the groundwork for a system of years, '34 and '36, of drought and deschools which could be an active force vastation make the conditions in the<br />\nin the life of each community. No two cases comparable. For depression<br />\nordinary pedagogical methods would hit the East no harder (if as hard)<br />\nthe West.<br />\nthan drought<br />\nhave sufficed in this crisis.<br />\n\"The Hoover spending, my friends<br />\nThe work in Mexico is by no means<br />\n. . . is the most reckless and extravacompleted. It will go on for many<br />\ngant pace I have been able to discover<br />\nyears; but what progress it has made in the statistical record of any peaceis sufficient to show the world the time government anywhere, any<br />\npart education may play in establish- time,\" said Candidate Roosevelt in<br />\ning a new social order. This book is 1932. Also, \"We advocate an immedian educator's account of a great ad- ate and drastic reduction of expendiventure. It is probably the best avail- tures by abolishing useless commisable survey of Mexican history and sions and offices, consolidating deculture and the meaning of the re- partments and bureaus, and eliminatcent revolution.<br />\ning extravagance, to accomplish a<br />\nMr. Sanchez closes his volume in the saving of not less than 25% in the<br />\nfollowing words:<br />\ncost of Federal Government\" (Democratic Platform, 1932.) Such inconThe people have tasted the fruits<br />\nsistencies, and especially his divertof knowledge, they are learning<br />\ning denunciations of \"economic royalthe fundamentads of economic seists\"— himself having spent fifty<br />\ncurity and of social justice. The<br />\nyears in luxury on land and sea, part<br />\nparty that is in power today may<br />\nof the time as a corporation lawyer<br />\nfall . . . yet no one can take<br />\nand Wall Street official (as Al Smith<br />\naway what the masses of people<br />\nsays) -force us to the conclusion that<br />\nhave already learned . . . They<br />\n\"the budget is not the only thing in<br />\nare conducted in an education not<br />\nWashington that is unbalanced.\"<br />\nby violence but by education.<br />\nBut now to answer Mr. Kempton.<br />\nWhat they have learned so far<br />\nI am unable at present to answer his<br />\nconvinces them that Educar es<br />\ncharge against Landon's civil servredimir.<br /><br />\nice policy. But on this point Mr. Kempton lives in a glass house: \"Between<br />\nJune 30, 1932, and June 30, 1936, the<br />\npercentage of employees in the Exe04tive branch of the Federal Government not under civil service increased<br />\nfrom 19.9% to 39.5%.\" A specific example is the President's abolition<br />\nof a Federal Reemployment Bureau<br />\nunder civil service laws, and the creation of a new one not so restricted.<br />\nAs the minimum wage law which<br />\nwas declared unconsututional in 1925,<br />\nand Landon's failure to \"force\" any<br />\nsustitute legislation, this, like his procedure after the Farm Moratorium act<br />\nwas thrown out of the Court, showed<br />\n\"his devotion to the spirit of the Constitution,\" Mr. Kemptom to the contarary regardless. Landon advocated<br />\nan amendment to the state Constitution which would permit the moratorium act; that the legislature turned<br />\nit down is nothing against him. But<br />\nhow different was the procedure at<br />\nWashington after a like fate overcame the Guffy Coal Bill!<br />\nAs for the confidential report about<br />\nwnich Mr. Kernpton writes, Landon<br />\nsays that it was not confidential and<br />\nthat he was therefore not violating<br />\nany confidence in quoting it. And I<br />\nwould think twice before I disbelieved<br />\na man who, in his own community and<br />\nstate, has the reputation of never<br />\nhaving broken a pledge.<br />\nTo the resolution of the Kansas<br />\nFederation of Labor excoriating Lan- ,<br />\ndon for calling out the militia in the<br />\nlead and zinc workers' strike, that<br />\nwas due entirely to misinformation.<br />\nDick Heiman, under Sheriff of Cherokee County, and C. E. Shouse, County<br />\nAttorney, wired the Governor during<br />\nthe strike as follows: \"We do not<br />\nfeel that our local police strength is<br />\nsufficient to cope with the situation.<br />\nUnless immediate assistance reaches<br />\nus we do not believe we can avoid<br /><br />\nThe<br />\nhoney in<br />\nthe briar<br />\nkeeps the pip*<br />\nsweet.<br />\n11.1ligh-efficiency<br />\nCondensor cleans, purifies<br />\nsmoke.Trapsmoisture.Noclogging.Notrouble.Proveityoursom<br /><br />\nAt Your Dealers<br />\n•<br /><br />\nIt's a Light Smoke!<br />\nIn Harmony with Your Throat<br />\nMore marvelous than any invention is the \"music<br />\nbox\" inside your throat. But so delicate ... with<br />\nits maze of membranes! No wonder so many stars of the movies and radio say that for them a light<br />\nsmoke is the right smoke. Luckies are a light smoke<br />\nof rich, ripe-bodied tobacco. Luckies hit the right<br />\nnote with your taste! The only cigarette with the<br />\ntender center leaves of the highest-priced tobacco<br />\nplus the all-important throat protection of the<br />\n\"Toasting\"process. Remember—the only cigarette.<br />\nSo reach for a Lucky and be kind to your throat!<br /><br />\n* * NEWS FLASH! * *<br />\n205 Guests at Ritz Carlton in Atlantic City<br />\nPlay \"Sweepstakes\"!<br />\nPeople on vacation play the \"Sweepstakes,\"<br />\ntoo. In one week alone 205 guests at the<br />\nfashionable Ritz Canton in Atlantic City<br />\nremembered to send in their entries for<br />\nYour Lucky Strike \"Sweepstakes.\" We say<br />\nthat's combining fun with fun!<br /><br />\nBowman Assails<br />\nTeacher's Pledge<br />\n(Continued from page I, col. 4)<br />\nDr. Leo Wolman, Vice President, A.B.<br />\n'11, Ph.D. '14 (Political Economy);<br />\nDr. Thomas De C. Ruth, Secretary,<br />\nA.B. '06, Ph.D. '16 (Latin); Mr. Clarence M. Guggenheimer, Treasurer,<br />\nA.I3. '99.<br />\nThe list of members of the executive<br />\nboard follows:<br />\nColonel Oliver F. Allen, Arts '93-94;<br />\nMr. Edgar S. Bamberger, A.B. '03;<br />\nMr. William S. Bird, A.B. '03; Reverend Doctor Allan K Chalmers, A.B.<br />\n'17; Mr. J. Albert Durgom, AB. '27.<br /><br />\ninjury and loss of life.\" So Landon<br />\nhad no choice but to send militia.<br />\nDuring the controversy over the<br />\nresolution against Landon, Elmer<br />\nDean, president of the Union in Galena, Kan., said, \"This crime against<br />\norganized labor should be placed<br />\nsquarely on the shoulders of Dick<br />\nHeiman and C. E. Shouse.\" Whereupon Mr. Ed Cassell, the originator of<br />\nthe resolution in question, made this<br />\nstatement: \"I know Elmer Dean personally and his unquestioned sincerity is a thing admired by all the laborite of southeastern Kansas. . . . I<br />\nam glad to see a leader whose feelings and honesty and sincerity toward<br />\nlabor is unquestioned, who has the<br />\ncourage to pin the injustices heaped<br />\nupon labor squarely upon the shoulders of those who are to blame.\"<br />\nAnd now, Mr. Editor, to pick a bone<br />\nwith you. In the last issue you said<br />\nthat the Alumni Memorial Hall is<br />\nentering its New Deal period. 'Taint<br />\nso. We are not leaving any huge debts<br />\n,for posterity: the dance last spring<br />\nnetted only a dollar in the red. We're<br />\ncareful of our money, so please don't<br />\nInsult us any more.<br />\n—Merton Fales<br /><br />\nHave you entered yet? Have you won<br />\nyour delicious LuckyStrikes? There's music<br />\non the air. Tune in \"Your Hit Parade\"—<br />\nWednesday and Saturday evenings. Listen,<br />\njudge, and compare the tunes—then try<br />\nYour Lucky Strike \"Sweepstakes.\"<br /><br />\nA CLEAR VOICE<br />\n—A Light Smoke<br />\nWhether you sing in the<br />\nparlor—or just hum in your<br />\nmorning tub, be kind to<br />\nyour throat. A clear voice,<br />\na light smoke—they go togather. Guard those delicate<br />\nmembranes. Select a light<br />\nsmoke—o Lucky.<br /><br />\nAnd if you're not already smoking<br />\nLuckies, buy a pack today and try them.<br />\nMaybe you've been missing something.<br />\nYou'll appreciate the advantages of<br />\nLuckies — a Light Smoke of rich, ripe.<br />\nbodied tobacco.<br /><br />\nH. FURST CO.<br />\ngYn<br />\nYear<br />\nfld<br /><br />\nPrinters of<br />\n.LOLOGICAL and<br />\nI FIC PUBLICATIONS<br />\nikiss Plane Baltimore<br /><br />\nOF RICH, RIPE-BODIED<br />\nClupyristat 1558. The American Tobacro Company<br /><br />\nTOBACCO<br /><br />\n\"IT'S TOASTED\"<br /><br />\n4<br /><br />\nFIOMEWOOD, BALTIMORE, MD., OCTOBER, 20, 1936<br /><br />\nShoremen Beat<br />\nJays By Narrow<br />\nMarginOfSalety<br /><br />\nSport Schedule<br />\nINTERCOLLEGIATE<br />\nFootball<br />\nJohns Hopkins vs. Hayeffort!, Saturday, at Homewood.<br />\nSoccer -- Johns Hopkins vs. University of Maryland, Saturday, at<br />\nHomewood.<br />\nCross-Country---Johns Hopkins vs.<br />\nLehigh University, on Saturday,<br />\nat Homewood.<br /><br />\nSigma Phi Epsilon, Phi Psi,<br />\nTouch Football Rooters<br />\nO.K.O. Win League Contests Rules Announced<br /><br />\nScore<br />\nOver Salisbury<br />\nBy 3-1 Count<br /><br />\nThe following are the rules for all<br />\nintramural and interfrat games:<br />\n1.--The field shall be 35 by 50 yards.<br />\n2.---A team shall consist of seven<br />\nThe fraternity touch football league<br />\nScoring as many points as 0.K.O., men.<br />\ngot under way last Tuesday with Sig- Phi Psi conquered Tau Alpha Omega<br />\n3.—There are no end zones.<br />\nma Phi Epsilon, Phi Psi, and Omicron 32-6. Lody made the losers only score<br />\n4.—A touch shall constitute a<br />\nINTERFRATERNITY<br />\nKappa Omicron copping games. The<br />\n,which Himes, Davis, Lamble added tackle.<br />\nTuesday--Phi Sigma Delta vs. Phi<br />\nlosing team managed to score only<br />\na.--The referee shall have the<br />\nsingle scores for Phi Psi. Maulsby<br />\nAlpha; Kappa Sigma vs. Phi Ep12 points while the victors tallied a<br />\nsole power to determine if a<br />\nmade a safety, and Dukehart tabbed<br />\nsilon Pi.<br />\ncombined total of 88 markers.<br />\ntouch<br />\nwas<br />\nunnecessarily<br />\nWednesday -Omicron Kappa OmiHaving N. Lloyd leading on the of- twice. Dukehart played only the first<br />\nrough. A foul shall be penalcron vs. Kappa Alpha; Alpha<br />\nfense with three touchdowns to his half, .but made a fine impression. Alized by giving the opposing<br />\nDelta Phi vs. Delta Upsilon.<br />\ncredit, the O.K.O. seven downed Pi though defeated, T.A.O. loaked promteam an extra down, or by<br />\nThursday -Pi Lambda Phi vs. AlAlpha 32-0. J. Alexander added to<br />\ntaking one down from the deising,<br />\nand<br />\nonly<br />\nlack<br />\nof<br />\npractice<br />\nand<br />\npha Epsilon; Tau Alpha Omega<br />\nthe five scores on a pass while R.<br />\nfending team.<br />\ninternal dissension kept it from makThe Johns Hopkins soccer team<br />\nvs. Delta Phi.<br />\nHartman made a six - pointer and<br />\n5. .Blocking shall be done with<br />\nking<br />\na<br />\nbetter<br />\nshowing.<br />\n.clinched their first victory in the<br />\nFriday -Sigma Phi Epsilon vs. Tau<br />\nWashington College managed to<br />\nsafety.<br />\nIn the remaining game, Sigma Phi both feet remaining on the ground. Maryland collegiate soccer<br />\nAlpha Phi, Phi Psi vs. Beta Theta<br />\nchampnose out a fighting Hopkins eleven<br />\nHartman, O.K.O. player, played an Epsilon topped Alpha Epsilon Pi 24- Flying blocks may be penalized by ionship<br />\nrace defeating the Salisbury<br />\nPi.<br />\nFriday night at Homewood by a<br />\nexcellent game throughout and was 6. D. Erck, J. Lyle, R. Reigner, and sending the offender from the game. ,tate<br />\nTeachers' College by a score of<br />\nscore of 8-7. The Shore team's win6. -There shall be no blocking by the<br />\noutstanding on running plays. Gor- ,C. Deitz made touchdowns for S.P.E.<br />\n3-1<br />\nat<br />\nHomewood Saturday.<br />\nping margin was supplied by a safety<br />\ndon, freshman, made the best show.- while A.E. Pi lone score was made by pffensive team when returning a punt<br />\nThe Blue Jay booters were outand a touchdown—both coming in<br />\nor kick-off. (This is to avoid any<br />\n,ing for Pi Alpha.<br />\nChibnik.<br />\nplayed by the visitors in the first<br />\nthe third period. It wasn't until the<br />\nblocking on plays where players can<br />\nhalf when the Teachers assumed the<br />\nfinal quarter that George Kahl, Jay<br />\n(have some distance in which to get<br />\nlead as Wheatley, playing outside<br />\nfullback, intercepted an enemy pass<br />\na, running start. Contact as such<br />\nLast Tuesday the 1937 tennis season<br />\niright, sank a beautiful boot into the<br />\nand ran 70 yards for the Hopkins'<br />\ntimeshas proved to be dangerous.)<br />\ninaugurated<br />\nwas<br />\nby<br />\nmeisHoff<br />\nCoach<br />\nnet.<br />\nonly tally.<br />\n7.- The ball is dead wherever a latter in a special fall organization<br />\nBucking the wind in the third period<br />\nThe comparatively light Blue line<br />\neral pass is dropped, or wherever a<br />\nmeeting, the first held in several years.<br />\nheld the huskier Washington squad<br />\nball is fumbled. This does not apply of the game, the Jays, by a series of<br />\nr all racquet practice has started, and<br />\nplays worked the ball to a centered<br />\nThe opening drill of the Blue la- on akick-off.<br />\nsurprisingly well in the first stanza.<br />\nDue to an alteration in schedules,<br />\nManager Snyder has set into motion<br />\niposition and Targin on a straight<br />\nBeginning with a rush, the Shoremen<br />\ncrossemen<br />\nwas<br />\n8.<br />\nstaged<br />\nA<br />\npass<br />\nlast<br />\nweek<br />\ncan<br />\nunder<br />\nbe<br />\nthrown<br />\nfrom<br />\nany<br />\n(the<br />\nHopkins-Lehigh Cross Country<br />\nthe ladder tournament which will de„punt<br />\nsank the tieing tally.<br />\nlaunched a powerful drive starting at<br />\nplace back of the line of scrimmage.<br />\ntermine the Spring berths on both Meet will be staged this Saturday,24th, the guidance of Coach Kelso Morrill<br />\nBradshaw, substitute outside right,<br />\nmidfield and bearing on down to the<br />\n9.-In<br />\noff-side<br />\nplays,<br />\nthere<br />\nshall<br />\nbe<br />\nthe Varsity and Junior Varsity teams. between the halves of the Hopkins- Due to the continuous downpour of<br />\nput the Blue team in the lead with a<br />\nflays' 4 yard marker. But here the<br />\nrain the candidates gave up any hope a penalization of five (5) yards. The<br />\nIn just the first few days of prac- Haverford<br />\nfootball clash, instead of<br />\nwell directed boot, centered in Phildefenders dug in and staved off an<br />\nplay<br />\ngoes<br />\nover.<br />\nof actual scrimmage and spent the<br />\ntice, many promising newcomers have<br />\n/lips on an outside kicks. Incidentally,<br />\n.dmost certain score.<br />\n,the 17th as had been planned. The<br />\n10<br />\n--Each<br />\nteam<br />\nshall<br />\nhave<br />\nfive<br />\n(5)<br />\nentire two hours at the concrete wall.<br />\nbeen putting the finishing touches onIn the second period Kahl made the' to their Summer form. In addition starting lineup given is still uncer- At that place they practiced various downs in which to make a touchdown, .Bradshaw shares the ranking honors<br />\nof the victory since he turned in one<br />\nafter which they lose the ball.<br />\nfirst threatening gesture for the Jays to these new men, the team is strong tain as varsity positions are being breaks and shots.<br />\nof the most outstanding performances<br />\nby spearing a Washington forward in top-rankers who have had last<br />\nAs soon as the aspirants have<br />\n.strongly contested by a well-balanced<br />\never witnessed on the Homewood field.<br />\npass and galloping 50 yards down .year's experience on the Varsity. The<br />\nand conditioned squad, but will be enough warm-up drills, Dr. Morrill inHis tally rallied the Blue Jays after a<br />\nthe field, before being forced out on standbys are headed by Captain-Elect<br />\nannounced during this week. How- tends to divide them up into teams<br />\nseemingly losing fight.<br />\nthe visiting team's 20 yard stripe. Bob Brown (who was chosen to take<br />\never, the probable starters will be and stage real box - lacrosse games<br />\nrhe Hopkins revamped offense finBut the Hopkins running attack was ithe place of Captain Carl Hartman,<br />\nBrown, Warminsky, Lyman, Discal, at the newly built enclosure on the<br />\nAll those intending to come out for ally clicked in the last twenty minstopped dead in its tracks, and on pingles star of last season) and inCastelle, and Norton and Scharpf, two ,lower field.<br />\nvarsity basketball are urged to at- iutes of play as they repeatdely threatthe fourth down Baetjer attempted a clude Cramer, Ratchiffe, Lamble,<br />\nThose who wish to turn out for the tend basketball practices being held ened<br />\npromising<br />\nfrosh.<br />\nthe Salisury net. Price easily<br />\nplacement kick from the 30 yard line,' Leonard, and Branower.<br />\nBoth the Blue Jay and Brown End drills may report Tuesdays and Fri- at the gym on Wednesday afternoons dented the net<br />\nthe ball falling just a few years short<br />\nwith the final score<br />\nWhite Warriors are evenly matched, days at the gymnasium and receive at 4 P.M. The drills are under the di- of the game.<br />\nof the crossbar.<br />\nNOTICE<br />\ngoing for a close meet. It will be their equipment.<br />\nrection of Captain Herb Siegel, inas- •<br />\nHopkins<br />\nYoung, the short-team's star tripleFreshmen and Sophomores inter0 0 1 2 3<br />\nremembered that last year Lehigh<br />\nIt is hoped that this year's squad much as Coach Malonee is at present<br />\nSalisbury<br />\nthreat man, started things rolling for<br />\nested in a position on the manager0 1 0 0-1<br />\nbarely squeezed a victory by one will be able to improve on the record occupied with footall. The purpose<br />\nGoals: Salisbury—Wheatley; HopWashington in the second half by<br />\nial staff of the Tennis Team are repoints, giving Capt. Scholtes and his made by the team last year. They of these practices is to get the candi- kins -Price,<br />\n,puntin^; out of bounds on the Blue Jay<br />\nLargin, Bradshaw. Subquested to get in touch with Mana- ;<br />\nrecruits all the more reason for re- lost games to St. John's, B. A. C., and dates into condition before the more stitutes: Hopkins<br />\nfive yard line. When hail tried to<br />\n--Price, Mace, Hahn,<br />\nger William Snyder.<br />\nvenge.<br />\nMt. Washington.<br />\nlintensive work is started.<br />\nBracLshaw, Allen, Kemp.<br />\nimtaliate, Salters broke through to<br />\nplock the boot, Ward, of the Jays, re•<br />\n•<br />\ncovering the ball in his own end-zone,<br />\nthereby scoring a safety for Washington.<br />\nHopkins kicked off on its own 20<br />\nyard line, and the visitors, adding<br />\nmuch yardage by a favorable exchange of punts, marched 30 yards to<br />\ntheir only touchdown. Huffman's<br />\nplacement try was foiled by a had<br />\npass from center.<br />\nIn the final chucker the Shoremen<br />\n/again bore down toward their oppoenent's goal until stopped by Kahl's<br />\nAnterception of Young's toss and 70yard sprint behind splendid interference. Once in the clear Kahl couldn't<br />\nhe caught. Baetjer place-kicked the<br />\n,extra point to give the final score.<br />\nKahl was undoubtedly the Blue Jay<br />\nbackfield star, while Baetjer, Royster<br />\n(anu Hopkins were outstanding in line<br />\nplay. Vincenti played his usually fine<br />\nsecondary defense game.<br />\nWith Green out and Graziano nursing a sore hand, Hopkins' offense was<br />\nat a sorry disadvantage, but the eleven showed plenty of stuff in holding<br />\na more powerful eleven to a one<br />\npoint victory.<br /><br />\nSuperior Power And Young's<br />\nGreat Punting Give<br />\nShoremen Victory<br /><br />\nPhi Alpha Downed 32-0 By 0. K. 0.; T. A: U: Whipped<br />\nBy Phi Psi; A. E. P. Loses 24-6 To S. P: E:<br /><br />\nSoccer Team Wins First<br />\nOf Maryland Collegiate<br />\nContest<br /><br />\nBradshaw Shines<br /><br />\nJays Fight To End<br /><br />\nEntire Squad Shows Excellent<br />\nForm Against<br />\nTeachers<br /><br />\nKahl Totes Ball 70 Yards<br />\nIn Final Period For<br />\nHopkins' Only Tally<br /><br />\nTennis Team Holds<br />\nSpecial Meeting<br /><br />\nDistance Men Set Jay Lacrossmen<br />\nFor Lehigh Clash Hold Initial Drill<br /><br />\nSiegel Calls Drills For<br />\nCourtmen At Gym Wed.<br /><br />\n...than- the<br />\nwhaleman's signal<br />\nor a smohe<br /><br />\nSide Lines<br /><br />\nAnd on land and sea,<br />\nfrom coast to coast...with<br />\nmillions of smokers, men<br />\nand women...when they<br />\ntake time out to enjoy a<br />\ncigarette it's<br />\n\"Smoke-O...<br />\npass the Chesterfields\"<br />\nChesterfields are milder...<br />\nand what's more they've<br />\ngot a hearty good taste that<br />\nleaves a man satisfied.<br /><br />\nOur sympathies to those boys who<br />\nwere unfortunate enough to have<br />\ndates for the game. Even more sympathy to the girls who had to sit<br />\nthrough the rain in their football best.<br />\n« * * *<br />\nHow many of you noticed the female cheerleader of the Washington<br />\ncheering squad? And incidentally<br />\ntiTere were more women than men in<br />\nthe visiting stands.<br />\n* * * *<br />\n\"Dena\" Traggis seemed to he awfully close to the earth when he stood<br />\nalong side the big Washington men<br />\nIncidentally it was 'Trag\" who made<br />\nthe first tackle after he got into the<br />\ngame.<br />\nThe Washington team went into a<br />\npuddle, I mean huddle, fifteen yards<br />\nbehind the line of scrimmage. I guess<br />\nthe shore school has no cross country<br />\nteam, so the football squad has to<br />\ndouble up.<br />\n* *<br />\nTom Ellis says \"those boys were<br />\nplenty big\" and if he says so we can<br />\n;take his word fo it.<br />\nThe cheering could have been a lot<br />\nlouder and snappier. Come on, frosh,<br />\nilearn those yells. And seniors needn't<br />\nibe too dignified, even when with a<br />\nwoman, to make some use of their<br />\nlungs.<br /><br />\nC 1936, LIGWIT1'&amp; MYtItS TOBACCO C.C.,<br /><br />"}], "field_media_file": [{"target_id": 39036, "display": null, "description": null, "target_type": "file", "target_uuid": "0defc764-0f9d-457f-a804-d966c11f6deb", "url": "http://digital.library.jhu.edu/system/files/2022-03/12714-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12714, "target_type": "node", "target_uuid": "28402798-ff47-4e17-b27c-08c7ccaeeac6", "url": "/node/12714"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "5dbfba58-c865-4c55-8ae0-e82ebda43971"}]}