{"mid": [{"value": 36669}], "uuid": [{"value": "88670f60-9f0d-445b-b56d-a013bbaf2607"}], "vid": [{"value": 36669}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12969-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "r<br />\nId<br />\nVOL. XXVI. No. 15<br />\n<br />\nBALTIMORE, MD., NOVEMBER 23, 1921<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS WINS STATE<br />\nFOOTBALL CHAMPIONSHIP<br />\nMARSHAL FOCH VISITS<br />\nWILL<br />\nL.<br />\nGAME WITH W.&<br />\nJOHNS HOPKINS AND VICTORY OVER ST.JOHNS<br />\nRECEIVES DEGREE<br />\nGIVES UNDISPUTED TITLE<br />\nCLOSE HOME SEASON<br />\n<br />\nFamous Generalissimo Honored<br />\nHopkins By His Presence<br />\nJ. H. U. Wins Thrilling Victory by a 17-3 Score. Both Teams<br />\nGenerals to Present Experienced Lineup. Hopkins Chances<br />\nYesterday.<br />\nPlay Well, But Black and Blue Proved Superior<br />\nof Victory Considered Good<br />\nBefore a large crowd which<br />\nhad gathered to witness the event,<br />\nAfter much anxious expectation and preparation the great day<br />\nthe degree of Doctor of Laws was came. Saturday, November 19, had been looked forward to<br />\nby the<br />\nProbable Line-up<br />\nconferred on Marshal Ferdinand student bodies of both Johns Hopkins and St. John's. It was not all in<br />\nWASHINGTON AND LEE<br />\nFoch of France yesterday at 3.30<br />\nJOHNS HOPKINS<br />\nvain for the followers of J. H. U., for they are now state football<br />\nin<br />\nfront of Gilman Hall. With champions. For<br />\nBemis 10<br />\nL E<br />\nmany days \"Beat St. John's\" has been the byword<br />\n1 Middleton<br />\nthe faculty in academic dress as•<br />\nMoore (c) 1<br />\nL T<br />\n21 Westerman<br />\nof every Hopkins student. This is what the Hopkins team did on<br />\nVogel 13 sembled on the north portico with<br />\nL G<br />\n13 Magill<br />\nCollins<br />\n18 students, both graduate and un- Saturday at Homewood and the undergraduate body is happy<br />\n0 Totterdale<br />\nRangely 12 dergraduate, gathered on the right because of it. To the team, of course, foremost credit is due, but on<br />\nR G<br />\n8 Landy<br />\nthe coaches, cheer leaders and student body at large there rebounds<br />\nPotts 11<br />\nT<br />\nR<br />\n4 Knecht<br />\nand with the general public on all<br />\n.<br />\n•<br />\nHerndon<br />\n16<br />\nR<br />\nE<br />\nno little part of the reward of the victory which they helped to<br />\n11 Rich<br />\nFrew (2) or Wingo 7 sides, the Allied Generalissimo re- achieve. In celebrating with a bonfire and parade Friday night and<br />\nQ B<br />\n6 Darley<br />\nTucker 6 ceived a welcome worthy of his with an elaborate, parade in downtown Baltimore on Saturday the<br />\nL H B<br />\n12 Bonner<br />\nMattox 3 fame. The Marshal arrived in<br />\nR H B<br />\n14 Calkins<br />\nstudent body gave vent to its splendid spirit, and demanded the at. McDonald 4<br />\nF B<br />\n•<br />\n19 Markell<br />\nBaltimore about 2 o'clock, but<br />\ntention which it so justly deserves. It remained for the Black and<br />\ntook part in ceremonies on City<br />\nSUBSTITUTIONS<br />\nBlue gridiron warriors to complete the task later in the day and they<br />\nHall Plaza before his visit to the<br />\nit nobly. Van Orman's men played in excellent form and left the<br />\ndid<br />\n5<br />\nCameron<br />\nBarton<br />\n5<br />\nUniversity. Upon his arrival,<br />\nDawson 8<br />\nfield with another state championship for Johnny Hopkins. Enter7 Spinney<br />\nMarshal Foch was introduced by<br />\nHall 9<br />\ning the game perhaps slightly favored to win, but outweighed by<br />\n9 Coady<br />\nDean<br />\nJ. H. Latane in an able presTilson 14<br />\n15 Brumble<br />\nSt. John's team, the Black and Blue boys proved very decisively they<br />\nTerry 15<br />\nentation speech. The degree of<br />\n20 Wilson<br />\nwere the better team. Hopkins completely outplayed her opponents<br />\nArbogast 17<br />\n22 Council<br />\nDoctor of Laws in Johns Hopkins<br />\nin<br />\nevery part of the game except perhaps the second quarter, when<br />\nHamilton 21<br />\n29 Willis<br />\nUniversity was then conferred by<br />\nJohn's rallied. It would be useless to name the Hopkins players<br />\nSt.<br />\nThomas<br />\n22<br />\n31 Cromwell<br />\nPresident Frank J. Goodnow, who<br />\nwho starred. Every man on the lineup did stellar work. Each one of<br />\nsaid:<br />\nthe linesmen held when and where necessary and broke through in<br />\nNUMBER OF VETERANS IN SOUTH ATLANTIC CROSSFerdinand Foch, Marshal of<br />\ncustomary fashion.<br />\nCOUNTRY MEET TO BE<br />\nVISITORS' LINEUP<br />\nFrance, Soldier, Statesman, ScholHELD TOMORROW<br />\nInvaders Have Heavy Line. Reserve<br />\nar, Defender of Civilization: By<br />\nDarley's generalship was all that could have been asked. Bonner<br />\nStrength As Strong as Regulars.<br />\nBlack and Blue Prospects Are Good. Md. authority of the State of Mary- was fast around ends as usual and Calkins and Markell were able to<br />\nState Claims to Have First<br />\nHopkins' third \"Big League\"<br />\nland, conferred upon the Board of plunge the cadets' line in good style. Perhaps those players whose<br />\nPlace Sewed.<br />\nopponent of the season will be the<br />\nTrustees and by them entrusted in work stood out for, St. John's were: Fox, Kirkpatrick, Feinberg,<br />\nattraction at Homewood tomorThe annual South Atlantic Cross me, I admit you to the degree of Brown and Tickey. It was a nip and tuck contest from start to<br />\nrow, when the eleven delegates Country meet will be held tomor- Doctor of Laws to this University finish with Hopkins having the edge. Probably the largest crowd<br />\nfrom Washington and Lee Uni- row afternoon at Homewood dur- and do declare you entitled to all which has ever been on Homewood Field turned out to witness the<br />\nversity turn their backs upon tur- ing the first half of the Hopkins- the rights and privileges there- St. John's game and they saw good football. The Cadets marched on<br />\nkey dinners and try to tuck beneath Washington and Lee football game. unto appertaining. In token the field about 2 P. M.and were followed a little later by the Hopkins<br />\ntheir belts the scalps of the cham- The colleges which will be repre- whereof I hand you this diploma.\" student body. There were many trick demonstrations, which kept the<br />\npion football eleven of Maryland. sented are Virginia Military InstiMarshal Foch was escorted by huge crowd amused.<br />\nHopkins has had but a half tute, Virginia Polytechnic Insti- a picked bodyguard of the local R.<br />\nNo one will be averse to hearing about this game in more detail.<br />\nweek's rest since its biggest game tute, Wahsington and Lee, Mary- 0. T. C. unit. After the conferring<br />\nrespect<br />\nof the season, but in this<br />\nland State and Johns Hopkins. In of the degree, the band played the<br />\nUpon winning the toss, Captain Totterdale, of Hopkins, elected<br />\n\"has nothing\" on the generals. addition to these it is probable that \"Marseillaise\" while the great to defend the East goal. Tickey kicked off to Bonner, who ran back<br />\nThose weary soldiers tottered back several other Southern colleges will crowd stood reverently in salute 25 yards. Calkins plunged for four yards and Markell added two<br />\nto the Virginia college last Mon- send teams and while the compe- to the national anthem of our<br />\nmor,:. St. John's was penalized five yards for being offside. After<br />\nday, after a hard battle with Cen- tition will not be as keen as that great sister republic.<br />\ngain -1g three yards on a fake, Bonner and Calkins added one yard<br />\ntre College and after but a day's at the Middle Atlantic States meet<br />\neach and it was fourth down with five yards to go. Calkins kicked<br />\nrest started Homewoodwards. They on November 12, a spirited race PRESIDENT HARDING TO VISIT US to Tickey who shortly returned the punt as St. John's could not<br />\nFOR BIG ARMY-MARINE GAME<br />\nare due to arrive here today and af- will certainly be forthcoming.<br />\nmake the distance. After three attempts by the Hopkins backs had<br />\nAT HOMEWOOD, DEC. 3<br />\nter a light signal practice this afterImmediately before the first half<br />\nWhen the Army-Marine football failed to advance the ball ten yards Calkins punted for 60 yards. On<br />\nnoon hope to put in about twelve of the football game commences, game is played at Homewood on St. John's second play Knecht broke through and nabbed Anderson,<br />\nhours of rest.<br />\nthe starting gun will be fired. The December 3, President Harding who fumbled. Rich recovered for Hopkins on St. John's 20-yard line.<br />\nThe visitors have had a fairly runners will start with one lap will grace the field by his presence After short gains by Markell and Darley had worked the ball into<br />\nsuccessful season, having in six around the field and then go on the for the first time. Accompanying position, Marken made a pretty placement kick from the 22-yard<br />\ngames scored 121 points to 74. cross country course. While the him will be a number of his official line for the first score of the game. Tickey received the next kickoff<br />\nMost of these, however, resulted in first half of the game is in progress guests, representing various for- returning 25 yards and Fox immediately afterward lost five yards.<br />\nthe first two games—shutouts by the marathon men will be doing eign governments at the Disarma- Tickey's return kick to Darley was fumbled. Banfield recovering on<br />\ngood margins for the victors. Ran- two laps around the course and dur- ment Conference.<br />\nHopkins' 45-yard line. Failing to gain, Tickey attempted a dropdolph-Macon fell victim in the first ing the intermission the finish of<br />\nThis fact was made public last kick which failed. Starting with the ball on their 20-yard mark, Marconflict, 41-0, followed a week later the race will be held with one more week by Captain Leroy P. Hunt, kell and Calkins each made three-yard gains and then on a fake kick<br />\nby Emory and Henry, who were time around the track. The entire U. S. M. C., who is commanding formation Bonner broke away for a 30-yard run, without interferblanked 27-0.<br />\ndistance will be about five and a the company of marines stationed ence, around left end. Calkins added five yards, but Hopkins was<br />\nHaving cleaned up fairly well half miles and the race should temporarily on Hopkins Field for penalized for holding. Calkins punted to Fox who was downed by<br />\non the home-lot by that time, the take about thirty-five minutes.<br />\nthe purpose of building additional Middleton. St. John's was penalized and Tickey kicked back to Darcocky ones set out for the North<br />\nSince the last meet the Hopkins seats and boxes for the use of the ley in midfield just as the quarter ended. Score: Hopkins 3, St.<br />\nfor larger game, selecting Rutgers squad has put in many hours of official celebrities. He also an- John's 0.<br />\nas the first victim. But by the hard training and it should be able nounced that the Fifth Marine RegHopkins has the ball on St. St. John's had slightly the best of<br />\nthickness of an eyelash, or more to give a good account of itself. iment, of Belleau Wood and Chatruly, by the shortness of a toe- Booth, although he was ineligible teau Thierry fame, would act as an John's 35-yard line. Markell it the Cadets found themselves on<br />\nlength, the invaders were defeated in the Middle Atlantics, entered the escort to the Marine's football gained five yards and Bonner the locals'43-yard line. Here Tickmade it first down. Marken at- ey tried another drop-kick, but<br />\n14-13, the failure to kick goal de- race and walked away from the ex- team.<br />\ntempt<br />\nat a placement from the 33- missed narrowly. The half soon<br />\nAmong the notables who will fill<br />\ntermining the loser.<br />\nceptionally strong field. He will<br />\nline<br />\nfailed.<br />\nAfter an ex- ended with Hopkins in possession<br />\nyard<br />\nThey were revenged, though, the be eligible for this meet, however, the boxes at the game are Vicechange<br />\nof<br />\nCashell<br />\nbroke of the ball on her own 12-yard<br />\nkicks<br />\nfollowing week, back on their own and unless some dark horse shows President Coolidge, Secretary of<br />\naway<br />\nfor<br />\na<br />\n24-yard<br />\ndash<br />\naround<br />\nline.<br />\nfield, Morris-Harvey feeling the up from another college, he should the Navy Denby, Assistant Secreend.<br />\nBy<br />\nthe<br />\nFox<br />\nand<br />\npenalty<br />\nright<br />\nSECOND HALF<br />\nfull force of a 37-7 defeat.<br />\nnever be headed after he is once tary of the Navy Roosevelt, Adworked the ball<br />\nCalkins kicked off to Kirkpat•The University of West Vir- under way. Captain Somerville miral Coontz, chief of Naval oper- method St. John's<br />\nto Hopkins' 38-yard line where rick, who advanced to the 30-yard<br />\nginia, who last Saturday met de- gave a good account of himself in ations; Major General Lejeune,<br />\nfeat at the hands of Rutgers, met the Middle Atlantics and he should Governor Albert Ritchie and May- Tickey booted a neat drop-kick. line before he was downed by TotAfter a brace of plays in which<br />\nor Broening.<br />\nContinued on page 4, col. 4<br />\nContinued on page 5, col. 3<br />\nContinued on page 4, col. 2<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br />\n<br />\n2<br />\n<br />\nHopkins News-Letter<br />\n<br />\nThe Johns<br />\n<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\n<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F.. ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\n.BALTIMORE, MD., NOVEMBER 23, 1921<br />\nA TRIBUTE TO FRANCE AND MARSHAL FOCH<br />\nIn conferring the degree of Doctor of Laws upon Marshal Foch,<br />\nJohns Hopkins University paid tribute to our sister republic across<br />\nthe sea and to the foremost general of the age. The act of the University was another recognition of the great debt which we owe to<br />\nour allies and which it will be impossible to repay for years to come.<br />\nIt is particularly appropriate that this tribute should have been<br />\nmade through the medium of Marshal Foch, who lead the allied<br />\narmies to victory. His presence upon our campus will long be remembered and yesterday will go down in the annals of the present<br />\nundergraduate body as a red-lettered day.<br />\nTHE STATE CHAMPIONSHIP<br />\nFor the first time in several years Johns Hopkins will be able to<br />\nclose the football season with the title \"Champions of the State of<br />\nMaryland\" after its name. Pleasanter still is the realization of the<br />\nfact that the claim is clear-cut, undisputed and respected by all.<br />\nBut now that the honor is ours, let us not forget to place the<br />\ncredit where credit is due.<br />\nFirst and foremost, too much credit cannot be given to Coaches<br />\nVan Orman and O'Rourke, whose untiring efforts of two years finally<br />\naccomplished the results which others were unable to obtain.<br />\nCaptain Bill Totterdale deserves a world of praise for the morale<br />\nwith which he kept his mates instilled. To the team itself, of course,<br />\ngoes our unanimous vote of appreciation. Lacking individual stars,<br />\nit has played a steady fighting machinelike game throughout its schedule.<br />\nOne of the most deserving elements, but one which generally<br />\nslips the mind of the enthusiastic rooter, is the forgotten, maltreated<br />\nindividual ordinarily dignified by the name \"Scrub.\" Those reserves<br />\nwho daily gave their time and energies that a winning outfit might<br />\nbe produced should share honors equally with the \"first team.\"<br />\nLast but not least, the team owes its success to the generous<br />\nsupport of those never-tiring, loyal rooters who followed the squad<br />\nin its defeats and its victories, lending their lungs as a bolster to<br />\ncourage.<br />\nWithout any one of these elements, the team would not have<br />\nsucceeded so well. To team work on and off the field we owe our<br />\nsuccess.<br />\nOTHERS TO WHOM CREDIT IS DUE<br />\nThe old Black and Blue eleven did itself proud last Saturday<br />\nand we feel that they are directly responsible for that satisfied smile<br />\nwhich has been so much in evidence on the campus this week. To<br />\nthe student body at large may be attributed a spirit which would be<br />\nhard to duplicate in any other college in the country. F-7ery one did<br />\ntheir part and helped to consummate the victory of the season. It is<br />\nappropriate that an appreciation of special value should be voted to<br />\nsome whose efforts have shown them to be worthy of special comment. Those committees who made arrangements for the various<br />\nevents are to be complimented on the excellence of their work. The<br />\nefforts of a smiling corps of ushers brought cheer on a gloomy afternoon.<br />\nThe students owe their thanks to Major Garey and his staff, on<br />\naccount of their whole-hearted co-operation. And last, but far from<br />\nleast, much credit is due to Gilson Engel for his spirited work as a<br />\ncheer leader and organizer and also to his assistants, Joe Thompson<br />\nand Don Vanneman. Without the hearty aid of all these loyal supporters of Johnny Hopkins it might have been a different story.<br />\nANNOUNCEMENT<br />\nOn account of the Thanksgiving holiday the present issue of the<br />\nNews-Letter is appearing Wednesday, and the next issue will not<br />\nappear until Thursday, December first.<br />\n<br />\nDR. BRIDGMAN'S LETTER<br />\nIt is with great pleasure that the News-Letter publishes Dr.<br />\nBridgeman's letter on the Varsity Club. We believe that co-operation between the Varsity Club and the undergraduate body is necessary and that the best way that this co-operation can be obtained is<br />\nby perfect and complete understanding on both sides. It is to be<br />\nhoped that the undergraduate members of the club and the representatives to the Holding Company will take an active interest in<br />\nthese organizations.<br />\nThe Varsity Club exists solely for the good of the University<br />\nand has already accomplished a great deal. We extend it our heartiest<br />\ncongratulations and express our willingness to be called upon at any<br />\ntime for any aid within our power.<br />\n<br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 1 1 o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br />\n<br />\nFRESH-SOPH DEBATE ARRANGED<br />\nAN APPEAL FOR<br />\nDISARMAMENT<br />\nThe Debating Council has arThe<br />\nDisarmament<br />\nConfer- ranged to have the annual Freshence at Washington is at last in man-Sophomore Debate in the Civil<br />\nsession. This meeting together Engineering Hall, Friday evening,<br />\nof delegates of the powers of the<br />\nDecember 16th. It promises to be<br />\nA T $8.00, made<br />\nworld is significant in itself. For<br />\nAT<br />\npeppy affair, as the Undergrada<br />\nthis conference will differ from<br />\ngrain leather,<br />\nevery one that has ever gone before uate Orchestra has agreed to furin tan or black,<br />\nit. These men do not come here for nish music for the dance which folwith square toe and<br />\nglory or personal achievement. lows the debate. This form of jazz<br />\nheavy<br />\nperforations,<br />\nThey do not come to jockey with debate proved a tremendous 'sucthis is an oxford<br />\nother 'nations in the race for develcess last year when the two upper<br />\nany<br />\ncollege man<br />\nopment. They do not come to<br />\nclasses<br />\nmatched<br />\nwits.<br />\nDr.<br />\nFrench<br />\nbicker and squabble greedily for<br />\ncan be proud of.<br />\nthe spoils of war—the hollow husks has consented to hold the tryouts<br />\nIn high shoe the<br />\nof victory. They come because the for the teams in Room 112, Gilman<br />\nsame<br />\nstyle is $8.50.<br />\npeoples of the world sent them. Hall, Monday and Tuesday, at<br />\nThis conference is not optional. It 12.30. The Freshman team will be<br />\nis not at the behest of any minor<br />\nselected Monday and Sophomore<br />\nnation. It is but the result of uncontrollable. forces. The world has team on Tuesday.<br />\nCharles Street, 210 North<br />\ndecided that war must stop.<br />\nA few—a frightful minority— VOCATIONAL EDUCATION PROOWINGS TO CAPTAIN BASstill labor under the delusion that<br />\nGRESSING IN MAINE<br />\nKETBALL<br />\narmaments are a safeguard against<br />\nBackwoodsmen attend vocawar. That delusion was exploded<br />\nChosen at First Meeting Last Monday.<br />\nOrganization Meeting Held.<br />\nfor most of us by the conflict which tional night schools in Portland,<br />\nAt<br />\nthe first practice of the Basjust shattered Europe and shook Me., some of them walking 7 and<br />\nketball Team held last Monday<br />\nthe universe. For forty years be- 8 miles to attend the classes.<br />\nat Friends' School gymnasium.<br />\nfore 1914 the nations of Europe There are now 26 schools in Maine<br />\n\"Bobby\" Owings, last year's. star<br />\nraced to keep pace with Germany giving vocational<br />\nagriculture, 87 performer, was elected captain for<br />\nin the marathon toward war prephome economics and 65 industrial the coming season.<br />\naration. France, with the fear of<br />\nEarlier in the day an organizathe Black Eagle clutching 'at her work, besides 70 evening and<br />\nmeeting was held in the.M. E.<br />\ntion<br />\nheart, impoverished herself. She Americanization schools. VocaBuilding and a large squad signineglected education, public im- tional education in the state has<br />\nfied their intention of trying for<br />\nprovements, everything to which grown from making small things<br />\nthe team. Plans for the coming<br />\nher people had a right. What hap- to building houses, machines and<br />\nseason were discussed and it was<br />\npened in France happened in every automobiles. Boys of the<br />\nDexter announced that practice would be<br />\nstate in Europe. The cause of this<br />\nHigh School have built a new shop continued this week at Friends'<br />\nwe all know—Kruppism and Junfor their vocational work. The School and thereafter at the Richkerism.<br />\nmond Market Armory. Owing to<br />\nIn 1910 the people of the United number of centers where the state the small capacity of the Park<br />\nStates were taxed $6.50 per capita. department carries on extension avenue gymnasium 15 men were<br />\nToday every man, woman and child courses for industrial teachers selected to practice there this<br />\npays out $54.00 a year. Of this will be doubled soon to meet<br />\nthe week.<br />\nsum, $50 goes to war, past and fuAs yet no coach has been apdemands.—School Life.<br />\nture. The remaining $4 goes to<br />\nproved by the Varsity Club, allegislative and executive expenses,<br />\nthough it is rumored that the<br />\neducation, public works, etc. And WHARTON SCHOOL .ABANDONS names of several men, well known<br />\nEXAMS<br />\nyet there are people who are opin local circles, are under considposed to disarmament. ' If there<br />\nDean Emory R. Johnscin, of the eration. No announcement will be<br />\nactually are, they never were in the Wharton School, announces that made regarding this matter until<br />\nmuck and blood of Flanders; they the faculty of that department of it is definitely decided to put a<br />\nnever had relatives or friends who the University of Pennsylvania team on the floor this season. This<br />\nwent out and never came back, they has decided to abolish the usual depends upon the financial outcannot appreciate what it means to midyear and final examinations. come of the football season.<br />\nhave nine millions of men wiped Such a step will affect about 2,000<br />\nManager Powell has arranged<br />\noff the earth and millions more students in all Wharton School an attractive tentative schedule<br />\ncrippled or destitute; they cannot courses.<br />\nfor his charges, but this, too, will<br />\nappreciate the hideous thing which<br />\nIn late years the proposal to be withheld until the Varsity Club<br />\nravaged Europe for four years. eliminate the final semester ex- takes action on the matter. CapEither this, or they are the para- aminations has been the subject tain Owings and \"Jack\" Bauernsites of war—the leeches of death, of considerable discussion in col- schmidt are the only undergradwho forge the weapons with which legiate circles, and the adoption uates surviving from last year's<br />\nman may slay and maim his fellow of the step by the Wharton School team, but there is promising maman.<br />\nfaculty marks a new era in mod- terial in the Medical School. The<br />\nArmaments are not only fright- ern educational methods. It is a members of last year's Freshman<br />\nful in themselves, but they under- development which follows nat- team should make a strong bid for<br />\nmine the ideals and innermost urally on the heels of the psycho- places and several men who<br />\nthoughts of men. What did mili- logical examinations which have starred in prep school are numtarism do for Germany? It turned already replaced old-fashioned ex- bered among the members of the<br />\na peace-loving, lovable race into a aminations for entrance require- present Freshman Class.<br />\nbrutal, obnoxious people. The ments in many higher institutions<br />\nWorld War was not fought to con- of learning.<br />\nAN APPEAL FOR DISARMAMENT<br />\nIn doing away with the usual<br />\nquer the German people but it was<br />\nContinued from col. 3<br />\nfought to rid the world of an idea— examination period the Wharton preparedness, and reaped the harto destroy not a race, but a system School faculty will save two vest which it had sown. Now it is<br />\n—to crush Kaiserism and Krupp- weeks of each semester. Such time going to try disarmament. It can<br />\nit is thought can be used more not fail. No objections, no obism for ever and ever.<br />\nThe world has decided that war advantageously in continuing stacles can stop it. There is but<br />\nmust cease. It tried armaments, class discussions and lectures.— one end to be hoped for. May the<br />\nContinued on col. 5<br />\nPhiladelphia Public Ledger.<br />\nWashington Conference succeed.<br />\n<br />\ntgeb<br />\n<br />\n\fTHE JOHN HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br />\nDR. BRIDGMAN EXPLAINS ATH0. D. K. HAS SEVEN<br />\nLETIC SITUATION AND THE ORCHAPTERS<br />\nGANIZATION AND AIMS OF<br />\nThree Other Colleges Under ConsideraTHE VARSITY CLUB<br />\nA Column in Which the Correspondents<br />\ntion. Annual Convention to Be<br />\nAre Allowed Latitude, But ShoulHeld at Pittsburgh.<br />\nIn<br />\nthe<br />\nfollowing<br />\nletter<br />\nDr.<br />\nEvder the Responsibility.<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\n3<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\n<br />\nOmicron Delta Kappa, the unelith W. Bridgman, president of<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\ndergraduate<br />\nhonorary fraternity<br />\nthe Varsity Club, - explains the<br />\nSUNDAY SERVICES<br />\nfounded<br />\nat<br />\nWashington<br />\nand Lee<br />\nfunction of this organization.<br />\n8<br />\nA.<br />\nM.—Holy<br />\nCommunion<br />\nUniversity<br />\nin 1914, has been exEvery Hopkins man ought to<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\nknow of the unselfish service panding rapidly and it now inthat Hopkins alumni are perform- pludes circles in seven colleges and<br />\ning through the medium of this universities. The following are<br />\nclub and for those who do not, the institutions at which circles<br />\nBONDS<br />\nENVELOPES<br />\nLEDGERS<br />\nthis letter should provide much en have been established: Washington<br />\nand Lee University, Johns HopEditor-in-Chief the News-Letter: lig-htenment:<br />\nkins Univerity, University of<br />\nreading<br />\nof<br />\nroom<br />\nmain<br />\nIs the<br />\nTo the Students of the Johns Hop- Pittsburgh, Davidson College, Unithe library to become a place for<br />\nkins University.<br />\nversity of Richmond, Center Colgeneral conversation and discusIt is only fair that the students lege and William and Mary Col205 W.CAMDEN STREET<br />\nsion? That is the impression a of the University should be kept lege. It was at the latter college<br />\ninformed<br />\nof<br />\nthe<br />\nvarious<br />\nactivities that Phi Beta Kappa, the parent of<br />\nstranger would naturally receive<br />\nupon going into the reading room. directed towards the improvement all American Greek letter frater- COTILLON BOARD ARRANGING<br />\nDOINGS OF THE SOPHOMORES<br />\nThe recently appointed \"pep\"<br />\nCHRISTMAS DANCE<br />\nIn spite of the fact that Silence is of the Johns Hopkins University, nities, was founded in 1776.<br />\nit<br />\nis<br />\non<br />\nand<br />\nthis<br />\naccount<br />\nthat<br />\nI<br />\nam<br />\nprinted in bold black letters in<br />\nAt present, further extension in<br />\nAt a meeting of the CotilIon committee was .commended by<br />\nseveral places around the room, taking the liberty to outline the different parts of the country is Board which was held last Thurs- President Callard at the Soph class<br />\nstudents (freshmen particularly) purposes and efforts of the alum- under the consideration of the fra- day the arrangements for the meeting held last Thursday. The<br />\npersist in carrying on conversa- ni organization, the Varsity Club. ternity. A college in Western Christmas cotillon were discussed. work of the committee has been<br />\ntions.<br />\nIn spite of the valued efforts of Pennsylvania, a state university in Louis Fisher has been secured to very much in evidence during the<br />\nSuch violation of the rules of Dr. Abercrombie, of Mr. Kistler, the Southwest, and a university in take charge of the music which past few days. They made it a<br />\nthe library is not becoming col- and of various interested alumni the far South are among the insti- assures the best Baltimore can special point to see that all Freshlege men nor is it giving the other and professors, and primarily be- tutions at which new circles may furnish for this occasion. Bids for men were at the Barn to learn the<br />\nfellow who wishes to read and cause of the lack of funds, the ath- be established in the near future. the refreshments will be secured yells and songs used at the St.<br />\nstudy a square deal. If you must letic activities at Johns Hopkins<br />\nThe annual convention for this during the week-end and reports John's game. Numerous scraps rethe<br />\nlibrary to do it. have not been commensurate with college year will be held at the Uni- ,made at the next meeting on Mon- sulted from attempting to persuade<br />\ntalk get out of<br />\nDon't disturb the many students the standards established by the versity of Pittsburgh sometime in day. It is planned this year to have some Freshmen to come to these<br />\nand strangers -with your chatter. University in other fields. The late February or early March. The more simple refreshments and meetings, but \"force\" being the<br />\nC. M. University could only afford about society publishes a small paper spend more money on programs watchword of the committee, they<br />\n$3,000 a year to athletics and pro- known as the Omicron Delta Kap- and favors. The Board will meet usually succeeded in accomplishing their purpose.<br />\nTo the Editor of the News-Letter, ceeds of the sale of the Cage on pa News-Letter, the autumn issue several men who are agents for<br />\nPresident Callard, however, reLittle Ross Street had to be de- of which will soon appear.<br />\nleather novelties and programs on<br />\nDear Sir:<br />\nminded<br />\nthe remainder of the class<br />\nMonday and decide on the type<br />\nReferring at this rather late date voted to scientific buildings, and the<br />\nthat<br />\ntheir<br />\nsupport was also essensports. His salary is very much which they will use. No subscripto a letter in your edition of Oc- students themselves being unable<br />\ntial<br />\nto<br />\nthe<br />\napplying of \"pep.\"<br />\nto finance athletics, were forced to higher than that of any preceding tion price has been set as yet, but<br />\ntober 25 signed \"Anti-Disarmacoach, and he is regarded as a per- it is planned to make December 21<br />\nFACULTY NOTE<br />\nment,\" I wish to take exception to train under very adverse condimanent man, whose policies in dif- remembered as the night of the<br />\ntions.<br />\nIt<br />\nwas<br />\nthat<br />\nbelieved<br />\nif<br />\nIt<br />\nwas<br />\nrecently made public<br />\ntwo statements there made, namemoney could be accumulated from ferent sports shall be constantly biggest and best cotillon Hopkins that Professor<br />\nly, that \"the idea of preventing<br />\nW.W.Willoughby<br />\nprogressive. The advertisement of has ever known at a price which of this<br />\nUniversity was in the main<br />\nwars by disarmament is hopeless\" the alumni, sufficient to meet the<br />\nthe sports and athletic activities is will compete with prices of for- author of<br />\nthe ten points which<br />\nand that \"The way to prevent war primary expenses, that athletics<br />\na problem that is being worked out, mer years.<br />\nChina presented to the Disarmais to be ready to fight when the could be made to pay and that the<br />\nand althrgh not yet satisfactory, Tea dances will be given after ment<br />\ntime comes, not by laying down interest of the students and alumni<br />\nConference.<br />\nin athletics would be increased. To there is constant improvement.<br />\nthe St. John's and Washington<br />\nall means of defense,—to do that<br />\nThe Varsity Club is now engaged and Lee games, the affair after<br />\nthis end, a number of \"H\" men<br />\nThe young man walked down<br />\nis to invite war.\"<br />\nin furthering the interest of the the Haverford game having the street one shoe off and his coat<br />\nthe<br />\namong<br />\nalumni<br />\nundertook<br />\nto<br />\nNow as a matter of historical<br />\nalumni in the establishment of proved such a success. Tickets turned inside out. A policeman<br />\nfact, the nations that have built help out in the financial managealumni<br />\nscholarships, which are to can be secured from any member stopped him.<br />\nment<br />\nof<br />\nathletics.<br />\nThey<br />\nare<br />\nworkup their military forces have<br />\nbe<br />\nawarded<br />\ning<br />\nalong the requirements of the Board.<br />\nonly<br />\nfor<br />\nUnithe<br />\ninterest<br />\nof<br />\nthe<br />\n\"What's the idea?\" he debeen the ones to engage in war.<br />\nof<br />\nthe<br />\nversity,<br />\nRhodes<br />\nScholarship.<br />\nIt<br />\nendeavoring<br />\nis<br />\nto<br />\ninterfere<br />\nmanded.<br />\nThe recent conflict is but one of<br />\nmany to prove that. Apparently, only so far as concerns monetary felt that such a type of man will cut according to the size of the \"Well, you see, it's this way,\"<br />\nreplied the young man. \"I'm takas soon as a nation arms exces- matters, and they stand primarily stand for the alumni's opinion of an cloth. •<br />\nfor<br />\nuniversal<br />\nall-around<br />\ncollege<br />\nman,<br />\nand<br />\nwill<br />\nrather<br />\nathletics<br />\nthan<br />\ning<br />\na course at a correspondence<br />\nI do not believe that the students<br />\nsively, its intercourse and relaindividual<br />\nimprove<br />\nsports,<br />\nthe<br />\nhelp<br />\nto<br />\nin<br />\nstudent<br />\nthe<br />\nhope<br />\nperthat<br />\nappreciate the great amount of, de- school and yesterday those darn<br />\ntions with other nations are based<br />\nthe<br />\nphysical<br />\nsonnel.<br />\ndevelopment<br />\nattained<br />\ntail involved in all this work. The sophomores wrote to me and told<br />\nconsciousness<br />\non the<br />\nof greater<br />\nthe<br />\nJohns<br />\nat<br />\nHopkins<br />\nMonies<br />\nbear<br />\nmight<br />\nobtained<br />\nabove<br />\nthe<br />\nexnumber of meetings that are held, me to haze myself.\"—The Owl.<br />\nforce, rather than on the feeling<br />\nits<br />\nturning<br />\npart<br />\npenses<br />\nto<br />\nin<br />\nout<br />\nbe<br />\nare<br />\nthe<br />\nbest<br />\ndevoted<br />\ntowards<br />\nnight work by individuals, and<br />\nthe<br />\nof justice and fair-dealing. Naman.<br />\ncollege<br />\ntype<br />\nof<br />\nathletics,<br />\nprimarily<br />\nwith<br />\nthe<br />\nidea<br />\nof<br />\ncontributions<br />\nthe<br />\nby alumni, all rep- stand.<br />\nRepresentation on the<br />\ntional pride — patriotism — bea<br />\ngetting<br />\ngymnasium<br />\nat<br />\nHomeThere<br />\ngreat<br />\nwere<br />\nmany<br />\na<br />\nprobunselfish<br />\nresent<br />\ninterest<br />\nand should Homewood Company exists for all<br />\ncomes developed to an extreme<br />\npitch,—national \"honor\" is in- lems_to be met, and they had to be wood, which lack is acutely a hand- be met by the students with the the parts, and the Homewood<br />\nvolved, or the chip is in some way met, not only from the point of icap to athletic progress. The ex- same reward in view—the interest Company endeavors to act only<br />\nknocked from the shoulder,—and view of the alumni, but with re- penses of athletics are considerable. of the University. In the distri- after all sides of the question<br />\nthe nation runs amuck, dragging gard to the Trustees, Faculty, and Football is the only paying sport. bution of alumni money the stu- have been represented. May the<br />\nothers with it. Our own country the students. There was no idea Last year the deficit in lacrosse dents have part control, and every Varsity Club count on the poshas not been as free as we might of prolonged control on the part was in the neighborhood of $2,500; effort is made by the Varsity Club itive co-operation of the members<br />\nwish from the taint of power of the alumni, for they are work- of baseball, $2,000; of basket-ball, to know- and further the students' of the University? May they hope<br />\nthat all criticism will be construcrather than right in our relations ing, all of them, with absolutely no $1,500, and other teams altogether, interests.<br />\npersonal gain, and at the same about $750. The training camp<br />\nThe Varsity Club has a five-year tive? Many of the faults in the<br />\nwith other nations.<br />\nAs a preventive of war, prep- time at a great loss to themselves cost $1,500. In addition, $1,500 contract with the Trustees, and system are well recognized and<br />\naration for war has been tried and in the point of view oi time given, was spent last year for interest on they hope that at the end of that they are endeavoring to meet them.<br />\nhas failed: fair-dealing and jus- not to speak of their financial do- the investment heretofore made by time, athletics will be on a success- Criticise among yourselves, but<br />\ntice, with their consequent lack of nations. With the consent of the the Trustees in the Homewood ful financial basis and that they can until you find out all reasons, do<br />\nneed for armament, have been Trustees, the Faculty, and students, field, and, of course, the general ex- have established an athletic depart- not go out into the world at large<br />\ntried and have succeeded. After they agreed to do what they could penses of athletics, salaries, equip- ment with its staff of instructors, and find fault. Very soon it will<br />\nthe Boxer uprising we returned to meet the different problems. ment, etc., have been unusually which shall be regarded on the be you students who will have to<br />\nto China a part of the indemnity Having organized the Varsity high. It is, therefore, deemed same plane as the department of take the places of those alumni who<br />\nexacted of her. I feel safe in say- Club, they established a Holding reasonable to expect that the stu- Chemistry, French, or any other are working at present. Keep foring that if China were now armed Company with the purpose of es- dents will be careful as possible developmental part of the student's ward the idea of helping and not<br />\nto the teeth we should have no tablishing a stock company, to with equipment, etc., given them by life. The interest and support of tearing down.<br />\nI cannot close without commentneed to fear her. Total disarma- which the \"H\" men might take the alumni, and it is evident that, the Trustees, the President, the<br />\ninent, even, without other cause shares. Some $13,000 was accum- until expenses can be met, that Dean, and other Faculty members, ing most favorably and appreciatively on the improvement and infor good will, has proved its pow- ulated in this way. The control of money should be distributed for has been excellent.<br />\nIt is sometimes felt that the stu- terest of the great mass of the stuer for peace and harmony; there the Hbmewood Company is vested those teams which represent the inis our Canadian frontier—not a in a Board of Directors, consisting terests of the largest number of dents are assuming a critical point dents. It is only by watching the<br />\nfort, not a war vessel, for a hun- of representatives from the Trus- students. The swimming team, of view. It is true also of some of students from year to year that one<br />\ndred years—and yet Canada has tees, Faculty, Alumni and students. which only interests 10 students the alumni. In this work the co- appreciates the general developnot once during that time invaded Under their supervision $8,000 was and is financially unsuccessful, operation of every part of the Uni- ment. The rooting, the student<br />\nour country. You may say that spent for stands. An unusually ca- should not rank with football, versity is essential, and where an band, the college spirit, and the<br />\npeople of the same race and lan- pable and interested Director of which directly or indirectly, inter- individual feels that an action taken different teams are all most comguage were involved, and so they Athletics was obtained in the per- ests the majority of students, and by the Varsity Club is wrong, it plimentary to the students.<br />\nSincerely yours,<br />\nwere, but the same thing has hap- son of Dr. Ray Van Orman. He which is financially successful. The should be his place, not to criticise,<br />\nE. W. BRIDGMAN,<br />\npened between differing peoples. is primarily the football coach, but Varsity Club wants to encourage but to seek information about the<br />\nalso has charge of all the various all athletics, but the suit must be action before he takes a permanent<br />\nPresident of the Varsity Club.<br />\nContinued on page 5, co/. 4<br />\nAll letters intended for publication<br />\nmust be concise, written id ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but dames signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nThe W. H. Moore, Jr. Paper Co.<br />\n<br />\n\fTHE JOHNS,H OPKINS LEW S-LETTER, NOVEMBER 23, 1921<br />\n<br />\n4<br />\nMR. PLUMB ADDRESSES SOCIAL SCIENCE CLUB<br />\nOutlines Plumb Plan and Answers Questions. Mr. Fenneman Explains the<br />\nPurposes of the Club.<br />\n<br />\nMr. Plumb, originator of the<br />\n<br />\nY. M. C. A. ACTIVITIES<br />\n<br />\nThe Deputation Team started<br />\nwork Sunday, at Easton M. E.<br />\nChurch, near Ananpolis. The team<br />\nis expected to visit a church each<br />\nSunday and will make several trips<br />\naround the city. It is made up of<br />\nHenry Callard, '24, chairman; Leroy Baughman, '22; Paul Stevens,<br />\n'23, and William Roberts, '24. An<br />\ninvitation was extended to those<br />\nwho wish to be on the team, and if<br />\nenough men are obtained another<br />\nteam will be formed. Callard did<br />\nfine work last year and it is expected that he will be one of the<br />\nbest chairmen that Hopkins has<br />\nhad.<br />\nA few weeks ago a conference<br />\nwas held at the Central Branch,<br />\nCathedral and Franklin Streets, on<br />\nstudent delegates from the colleges<br />\nof Maryland, in the interest of the<br />\nStudent Friendship Fund. About<br />\ntwenty colleges were represented,<br />\nand they drew up a resolution to<br />\nput in a campaign for said fund on<br />\nthe various college campuses.<br />\n<br />\nHARRY KING TOOTLE,'03,<br />\nVISITS THE UNIVERSITY<br />\nAlumnus Envies the Good Fortune of<br />\nthe College Men Who Have<br />\nHomewood.<br />\n<br />\nHarry King Tootle, '03, paid his<br />\nfirst visit to Homewood last Monday since the war. Before going<br />\nabroad he had made occasional<br />\ntripS to the University from Camp<br />\nMeade, where he was stationed for<br />\na time. Mr. Tootle now spends<br />\nmost of the year on his country<br />\nplace, near Bethany, W. Va. He<br />\nwas in Baltimore to see two new<br />\nplays here before they reached the<br />\nmetropolis. His interest in the<br />\ntheatrical world is due to the fact<br />\nthat he is himself a playright.<br />\n\"Cheated,\" his first play written<br />\nsince the Nvar, had its successful<br />\nstock tryout last summer, and Mr.<br />\nTootle visited Baltimore on his way<br />\nto New York to arrange for its<br />\nBroadway production when theatrical conditions improve.<br />\n<br />\nFRESHMAN CLASS MEETING<br />\n<br />\nImmediately following the General Assembly, the Freshman Class<br />\nwas called to order by President<br />\nO'Connor. He insisted that the<br />\nFreshmen must live up to the regulations if they wish to avoid a<br />\nfight. He said, in part, \"If you fellows persist in breaking the regulations, there is bound to be a fight<br />\nand you can't expect your fellow<br />\nFreshmen to help you out if you<br />\nbreak regulations. We do not want<br />\nto fight. There will be plenty of<br />\n<br />\nMUSICAL CLUBS TO START<br />\nSEASON SHORTLY<br />\nSeason to Open November 28 With<br />\nConcert at Evergreen<br />\n<br />\nThe final selection of candidates<br />\nfor membership in the Glee and<br />\nMandolin Clubs has been made recently and work is well under way<br />\ntowards perfecting an organization<br />\nof which every Hopkins man may<br />\nwell be proud. With the Glee Club<br />\nunder the able directorship of<br />\n\"Doug\" Coulter, '21, and the Mandolin Club under that of President<br />\nWaldo Hambleton, this season<br />\nneed for fighting strength at the promises to be the best yet. One<br />\nFresh-Soph football game. You of the most attractive schedules<br />\nmust obey the regulations. Also, ever attempted at J. H. U. will bedo not forget the new rule passed gin with the opening concert at the<br />\nby the Student Council, which re- Evergreen Hospital for blind solquires all Freshmen to wear both diers on November 28. Following<br />\ntheir Freshman button and their ac- this there will be another given at<br />\ntivities button, except with their the Franklin High School, Reistersuniform, when only the Freshman town, on December 17. Similar entertainments are planned to be held<br />\nbutton is needed.\"<br />\n,The members of the class were at State Normal, Eastern High,<br />\nalso urged by Treasurer Norris to Western High, Goucher, Tome,<br />\npay their class dues. These dues Annapolis, and Washington, while<br />\nhave to be paid before the first of in addition a tour will be made during the Easter holidays through<br />\nthe year.<br />\n\"Western Maryland, visiting en<br />\nroute Cumberland, Frederick, HaVICTORY OVER ST. JOHNS<br />\ngerstown and Westminster.<br />\nBesides an unusually attractive<br />\nContinued from page 1<br />\nof musical selections other<br />\nchoice<br />\nterdale. Tickey was forced to punt<br />\nfeatures, including a quarspecial<br />\nto Darley. Markell made five<br />\nbe presented. Those sewill<br />\ntette,<br />\nyards and Calkins gained first<br />\ntheir University<br />\nrepresent<br />\nto<br />\nlected<br />\ndown. Calkins, Bonner and Marin<br />\nas follows:<br />\nare<br />\nclubs<br />\nthese<br />\nhell together annexed another<br />\n<br />\nPlumb Plan and well known in industrial circles as an advocate of<br />\na square deal for everyone, addressed the Social Science Club last<br />\nWednesday.<br />\nIn presenting his speech, Mr.<br />\nPlumb went back to the early government and the Bill of Rights that<br />\nwas formulated to protect each citizen in his liberties. From this bill,<br />\nhe claims that the American people get three great industrial principles. First, that the government<br />\nis for the common good of all and<br />\nnot for the interest of a small and<br />\nfavored class. Second, that no man,<br />\ncorporation or group of men can<br />\nget more for a service than is fair<br />\nto the public. Third, that men have<br />\nthe right to enjoy the gains their<br />\nindustry produces. These three<br />\nprinciples are violated in their entirety by the modern corporation,<br />\n\"The Hopkins students of today<br />\nwhich by killing competition is able,<br />\nGAME WITH W. & L.<br />\nmilmaking<br />\nare to be congratulated on beautieven though it may be<br />\nContinued from page 1<br />\nlions, to fix prices to suit itself and<br />\nful Homewood,\" said Mr. Tootle, in<br />\nWashington and Lee on November<br />\nto keep wages at a low level. Labor.<br />\n12th and forced them to accept a expressing his pleasure at what has<br />\nwhich in the last ten years has inbeen done and will be done here.<br />\n28-7 beating.<br />\ncreased tremendously in efficiency,<br />\nLast Saturday the most interest- \"The realization was not for the<br />\nhas the right to expect at least a<br />\ning<br />\ngame of all from a local point students of my day, but at least we<br />\nmoderate increase in wages from<br />\nhad the dream of what was to be.<br />\nthat time to this; yet at present, in of view, the Blue and the Gray<br />\nthe old-timers know the<br />\nOnly<br />\n\"wonthe<br />\nCollege,<br />\nspite of the untold wealth and enor- played Centre<br />\nlife of the cobble stones, the<br />\ncampus<br />\nyears,<br />\nlast<br />\nfew<br />\nthe<br />\nof<br />\nmous resources of America, there der team\"<br />\nunyielding<br />\npavement of Little Ross first down and then came a pass,<br />\ndowned<br />\nago<br />\nweeks<br />\nare five million unemployed; and who but a few<br />\nGLEE CLUB<br />\nA<br />\nStreet.<br />\nclass<br />\nfracas in those days Calkins to Bonner, who ran 25<br />\nthe great laboring body, instead of Harvard in her first intersectional<br />\nFirst Tenors—Harwood, Moehle,<br />\njust outside the 'cage' was as realyards to the visitors' one-foot line. Gould, Jacobson, F. W. Wilson,<br />\nenjoying the gains of industry, is defeat in thirty years. For the first<br />\nistic as a riot in a street-car strike. Markell carried the ball through<br />\nthe<br />\nsecond<br />\nthe<br />\nof<br />\nmost<br />\nand<br />\nquarter<br />\npoverty<br />\nof<br />\npinch<br />\nthe<br />\nexperiencing<br />\nCarper.<br />\ntwo teams battled fiercely, neither Going back to look at what remains right tackle for a touchdown and<br />\nand actual want.<br />\nSecond Tenors—Kessler, Simon,<br />\nBo McMillin, who will be of a college in a city is about as Calkins kicked goal. After a dou- Belt, Hopkins, Thomas, Hall,<br />\nAs a solution to the present in- scoring.<br />\nremembered by all Hopkins basket- satisfying to the emotions as gazing ble exchange of kicks we find the Houston.<br />\ndustrial situation, Mr. Plumb proball fans of last year, finally draw- upon a hospital which happened to ball in St. John's possession on her<br />\nFirst Basses—Parsons, Regester,<br />\nposes a new form for corporations<br />\nblood for the first touchdown. be the birthplace of a great man. own 43-yard line, as the quarter Morrell, Tilghman, Roher.<br />\ning<br />\nlaborer<br />\nand<br />\ncapitalist<br />\nthe<br />\nwhich<br />\nin<br />\nThe game was played in ankle-deep Therefore, I am transferring my ends.<br />\nSecond Basses — Eichelberger,<br />\nwould each have a voice in proporand most of the gaining of the .emotional allegiance to Homewood,<br />\nmud<br />\nforby<br />\nthe<br />\nperiod<br />\nlast<br />\nwhich<br />\nthe<br />\nstarts<br />\nBrown<br />\nCrider, Sherwood, Gross, Ruoff,<br />\ntion to the interest<br />\nresulted from a passing but without sacrificing a single one<br />\nwinners<br />\nseven<br />\ninvestfor<br />\nend<br />\nhis<br />\nright<br />\non<br />\nElgent.<br />\ngoing outside<br />\nmer should receive<br />\ngame which the Generals were un- of the happy memories of the goodTickey makes five more<br />\nyards.<br />\nment and the value of the wages<br />\nMANDOLIN CLUB<br />\nly men who were my professors,<br />\nable to stop.<br />\nadvancing<br />\nAfter<br />\ndown.<br />\nfirst<br />\na<br />\nand<br />\nwhich the latter would receive for<br />\nSimon, Connor, Holsopple, Elmy college mates and my<br />\nOur visitors tomorrow will averball into position Tickey at- gert, Hall, Kan Morrel, Mullikin,<br />\nthe<br />\nhis services. In this way the two<br />\nfriends.\"<br />\ntempts a drop-kick almost in mid- Frau, Sietz, Williams, Chambers,<br />\nbodies would act as a check upon age 174 pounds, the line from tackle<br />\nMr. Tootle was president of his<br />\nfield. Hopkins gets the ball on her<br />\neach other, and no fictitious or wa- to tackle averaging 197. The backFranzkiwisch, Kuder,<br />\nfast, class his Senior year. That same own 20-yard line. Bonner first Kinnamon,<br />\ntered stock could be issued. One- field is unusually light and<br />\nHamburger, Ruoff, WilThe year he was also editor-in-chief of makes five and then ten yards. Siegrist,<br />\nhalf of the profits would be divided averaging but 160 per man.<br />\nCerofano, Torsch, Lewis.<br />\nthe the NEWS-LETTER and associate ed- Darley goes through center for son,<br />\namong the shareholders, and the players are all experienced in<br />\nhaving itor-in-chief of the Hullabaloo. He five yards. He is hurt but continother half would be devoted to the game, most of the team<br />\nthree was .the first Hopkins sprinter to ues to play. Markell breaks SERGEANT FERRIS TRAPS TRUANT<br />\nor<br />\ntwo<br />\nestablishment of new plants or the played together for<br />\n\"PREPPER\"<br />\ncover the dashes in ten seconds and through for 12 yards. Here Calretiring of the capitalists, the next years. According to the ages subis not a. safe haven for<br />\nBarn<br />\nThe<br />\n2 twenty-two seconds flat. These kins dropped back and threw a<br />\n/<br />\n221<br />\nyear the price would be lowered. mitted, the average age is<br />\nThis was demschoolboys.<br />\ntruant<br />\nrecords still stand. In France, Mr. )eautiful pass to Darley who raced<br />\nGreater efficiency would be ob- years, the oldest being 25; the<br />\nwhen SerThursday,<br />\nlast<br />\ncnstrated<br />\nTootle was aide-de-camp to Gen18 yards for a touchdown. Mar- geant \"Tom.\" Ferris, the vigilant<br />\nobtained and the decrease in oper- youngest, 19.<br />\nCole, and later acting adjutant<br />\nWingo, according to the list, is eral<br />\nhell kicked goal. A few moments police force of Homewood, brought<br />\n-tting expenses would be reflected<br />\nArtillery BriField<br />\n167th<br />\nthe<br />\nof<br />\nfirst<br />\nhis<br />\nlater on a pass from Tickey, Fox to an end the alleged truancy of<br />\nin all business. The books would 25 years old and is playing<br />\nSherburne.<br />\nGeneral<br />\nunder<br />\ngade<br />\ngot away off left end for a 50-yard Harry E. Jackins, Jr., 2731 Marybe open to some representative of year at the game. From all acrun that was the feature of the<br />\nthe public and in this way the peo- counts of his present prowess, he<br />\nAvenue.<br />\nUniversity of West Virginia, game. Captain Totterdale man- land<br />\nple would be protected. Mr. Plumb should be a fair quarter-back by the The<br />\nso the story goes, was a<br />\nHarry,<br />\nwho defeated them 28-7, barely aged to overtake him on Hopkins'<br />\nadvocated that this plan should be time he reaches his senior year.<br />\nat Poly. .Nearly every day<br />\nmanaged to down Virginia 7-0. Ac- 18-yard line and thus ended the student<br />\nworked by all corporations, but<br />\nThe team is well provided with<br />\nweeks, it is said, the boy,<br />\nior<br />\nseven<br />\ncording to this, Hopkins, who Cadets' best effort to score again.<br />\npointed out that individual busi- reserve strength, having three quartrousers, came to<br />\nshort<br />\nearing<br />\nplayed Virginia to a standstill, has On gains by Markell and Bonner,<br />\nness would be stimulated rather terbacks and a half dozen halfHomewood at school time and<br />\nthe edge.<br />\nOrman's machine had spent his time in the Barn until the<br />\nVan<br />\nthan depressed. In this way, he backs of high calibre. On the line,<br />\nreano<br />\nhas<br />\nBlue<br />\nand<br />\nBlack<br />\nThe<br />\nscales<br />\nthe<br />\ntips<br />\nwho<br />\nwhat<br />\nMoore,<br />\nthe ball up to St. John's Poly classes were dismissed. He<br />\nworked<br />\nCaptain<br />\nget<br />\nwould<br />\nclaims, the people<br />\nhowever,<br />\nent,<br />\nover-confid<br />\nfeel<br />\nto<br />\nson<br />\nstar,<br />\nhaving<br />\nthe<br />\nis<br />\nwhen the final whistle ate in the dining room, read the<br />\nbill<br />\nline<br />\npounds,<br />\n10-yard<br />\n205<br />\nthe<br />\nat<br />\nthey are entitled to under<br />\nhavgentlemen,<br />\nSouthern<br />\nthe<br />\nfor<br />\nboth<br />\nseason,<br />\nall<br />\nwork<br />\nthe 1921 Maryland magazines in the club room and<br />\nto<br />\nput a stop<br />\nof rights of the various states, a done brilliant<br />\nand<br />\nlost<br />\ngames<br />\ntheir<br />\nhalf<br />\nwon<br />\ning<br />\nWingo,<br />\ndefensive.<br />\nfootball classic.<br />\nsquare deal for all, no profiteering, offensive and<br />\nmingled with Hopkins students on<br />\neffort to come<br />\nLineup and summary:<br />\nand a chance for every laborer to Hall, Cameron, Mattox and Hamil- half, will exert every<br />\nthe best of terms. It is said that<br />\nof the card.<br />\nJOHN'S<br />\nST.<br />\nenjoy to the full the profits of his ton have done consistent work out on the right side<br />\nHOPKINS<br />\nlie even smoked cigarettes.<br />\nDell<br />\nL.E<br />\nA number of Washington and Middleton<br />\nindustry. Mr. Plumb very kindly throughout the season in the backSergeant Ferris saw Harry, but<br />\nBrown<br />\nL.<br />\nWesterman<br />\nSachs took him for a Hopkins prodigy.<br />\nconsented to answer the questions field. It is probable that numerous Lee alumni will be present at the Magill<br />\nL.G<br />\nFeinberg<br />\nof the audience after his address, substitutions will be made through- game and will give a banquet for Totterdale (c) RCG<br />\n. Beatty Finally, he \"smelled a rat,' as he<br />\nLandy<br />\nthe team thereafter. Having less Knecht<br />\nand some very interesting points out the (Tame.<br />\nAlexander said, and decided to interview the<br />\nR.T<br />\nBanfield (c)<br />\nR.E<br />\ncompetition in other branches of Rich<br />\nintroducing<br />\nIn<br />\nout.<br />\nbrought<br />\nfull<br />\nwere<br />\nHopkins will probably go the<br />\nQB<br />\nFox boy. Several times, he says, Harry<br />\nDarley<br />\nthe speaker, Mr. Fenneman, the four periods without substitution, sport, and the day calling forth the Markell<br />\nF.H<br />\nCashell eluded him by hiding.<br />\nAt last,<br />\nL.H<br />\nAnderson<br />\npresident of the club, in a very able as has been the coach's practice usual number of annual attenders. Bonner<br />\nable<br />\nFerris<br />\nSergeant<br />\nwas<br />\nhowever,<br />\nR.B<br />\nTickey<br />\nCalkins<br />\ntalk, outlined briefly the program whenever possible. Not a substi- a larger crowd than Saturday's is<br />\nhim.<br />\nrefused<br />\nThe<br />\nboy<br />\nquestion<br />\nto<br />\nSubstitutions: St. John's—Bassett<br />\nand purposes of the organization. tution was necessary Saturday and expected.<br />\nfor Anderson, Kirkpatrick for Bassett, to tell his name, but said he was a<br />\nEverstein for Dell, Dell for Beatty,<br />\nno serious injuries resulted. The<br />\nKelso for Kirkpatrick, Smith for Kel- Poly student, and that he was sick.<br />\nfirst team should be in condition<br />\nso, Everstein for Dell. Touchdowns—<br />\nFurther investigation by the \"poJUDGING BY HIS HABITS<br />\nSmith—Did you know that to last the contest, Westerman havMarkell, Darley. Goals from touchVisitor—Does Mr. Crawford, a downs—Calkins, Markell. Goals from lice department\" located the boy's<br />\nScott's education is still in its in- ing apparently recovered sufficientReferee— parents, and Mr. Jackins, Sr., mofield—Markell, Tickey.<br />\nlive here?<br />\nstudent,<br />\nly to operate at tackle.<br />\nfancy?<br />\nCutts, Harvard. Umpire—O'Brien,<br />\nCrawford<br />\nMr.<br />\n,<br />\nLandlady—Well<br />\nPhiladelphia Central High. Head lines- tored to the Barn and carried his<br />\nAccording to the misleading<br />\nHadden—No, why?<br />\nDartmouth. Field judge son home to the friendly shelter of<br />\nman—Hogsett,<br />\na<br />\nwas<br />\nhe<br />\nthought<br />\nI<br />\nbut<br />\nhere,<br />\nlives<br />\nHarbison—Oh, it rests on a method of comparing scores, Hop—Hoban, Dartmouth. Time of quarthe woodshed.<br />\nGoblin.<br />\ne<br />\nwatchman.—Th<br />\nnight<br />\nters-15 minutes.<br />\nkins has the edge on her visitors.<br />\ncrib.—Lampoon.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br />\n<br />\n5<br />\n<br />\nMAILBAG<br />\nneed of a musket for \"protection.\"<br />\nCHINESE STUDENTS PUBLISH GREAT INTEREST AT THURSDAY'S THE STUDENT FRIENDSHIP FUND<br />\nMASS<br />\n-MEETING<br />\nMAGAZINE<br />\nThe campaign for the Student<br />\nHuman nature is pretty much<br />\nContinued from page 3<br />\nThe mass-meeting held last Friendship Fund will close officialOriental Graduates Also Members of<br />\nWhen the \"Quakers\" settled in the same all over the world. If you<br />\nThursday in the C. E. Hall was deDisarmament Conference<br />\nly on December 3, when all pledges Pennsylvania they treated the In- treat your neighbor right he will<br />\nFew Hopkins students realize voted almost entirely to prepara- are due. The response to this<br />\ndians justly and did not arm reciprocate, be he Jap or Greek,<br />\nwhen thinking of the men who tion for the celebrations before and<br />\nworthy<br />\nwork<br />\nhas<br />\nbeen<br />\nvery<br />\npoor<br />\nso<br />\nGilson<br />\nagainst them. So Ion.<br />\n- as the white German or Hindu. The same prin6<br />\nhave achieved greatness after after the St. John's game.<br />\nEngel took charge of the meeting far. If there are any students who man did not outrage or threaten ciple applies between nations:<br />\nleaving the University that Hopand<br />\ndescribed the various parts that still desire to subscribe, the Y. M. the Indian, he was far safer<br />\nkins has been developing leaders<br />\nthan gun-toting is as poor a policy for<br />\ngo<br />\nto<br />\nwould<br />\nparade<br />\nmake<br />\nup<br />\nthe<br />\nC. A. will be glad to receive their his cousins in Virginia or Massa- nations as it is for individuals.<br />\nof countries other than the United<br />\nbefore the game. As each sep- subscriptions.<br />\nAll those who have chusetts. The state of peace and<br />\nStates. Especially is the Chinese<br />\nSincerely yours,<br />\nstudent at Hopkins developing arate stunt or part was taken up already pledged are asked to turn<br />\nfriendliness was continuous until<br />\nthe<br />\nman<br />\nwho<br />\nhad<br />\ncharge<br />\nannounced<br />\nRichard R. Taylor.<br />\nPowers that are to make him a<br />\nthe progress he had made in prep- in their contributions by the close a misguided white man felt the<br />\nrace;<br />\nhis<br />\nmen<br />\nof<br />\namong<br />\nleader<br />\nof the campaign.<br />\nand it throws interesting light on aration for it. John Sherwood rebonfire,<br />\nEmil<br />\nSmith<br />\nported<br />\nfor<br />\nthe<br />\nHopkins' standing as a worldfor the band, Buchner for the morenowned seat of learning to reMt. Vernon 4999<br />\n\"Queen Quality\" Home Made<br />\nflect on the number of. young tor-cycle brigade. The coffin to<br />\nparade was on the<br />\nChocolates<br />\nCROSS COUNTRY<br />\nChinese graduates of our Alma be used in the<br />\nand<br />\nwhen<br />\nit<br />\nplatform<br />\nwas<br />\nopened<br />\nVISIT<br />\nOUR<br />\nICE CREAM PARLORS<br />\nMater who have made a name for<br />\nContinued from page 1, col. 2<br />\n518 N. CHARLES ST.<br />\nout.<br />\npopped<br />\nTed<br />\nHuey<br />\nthemselves in the last few years.<br />\nCommercial Photography<br />\nBill Totterdale, Dick Wood and finish well up with the leaders on<br />\nOf course, the average student<br />\nThompson<br />\nJoe<br />\nmade<br />\nshort<br />\ntalks<br />\nCircuit Photography<br />\nat Homewood knows of the<br />\nThanksgiving Day. The other men<br />\nFlash Lights<br />\nViews<br />\nProminent part played by Presi- after Dean Latane had made sev- who will represent Hopkins are<br />\nGroups<br />\nEnlargements<br />\ndent Goodnow in Chinese affairs eral announcements very impor- Milligan, Edwards, Fenton, Seitz,<br />\nCharles and 22nd Sts.<br />\nKODAK FINISHING<br />\nand the equally prominent posi- tant to those concerned. A course<br />\nDelicious<br />\nSodas and Sundaes<br />\nCronin<br />\nand Ginther. Due to the<br />\nThe Best of Candies<br />\ntion held by Professor Willough- cannot be changed or dropped or<br />\n325 N. Howard St.<br />\nfact that they know every inch of<br />\nPrompt & Efficient Service<br />\nby. But does the average student a new course taken by a student<br />\nat Homewood know, for instance, without his first seeing his advisor the course and are competing on<br />\nthat two Hopkins graduates are and then the Dean. Any course home ground, all of these men can<br />\nworking as attaches to the Chines dropped without this procedure will be counted to finish much higher<br />\ndelegation at the Armaments Con- count a failure. Students are not up than they did two weeks ago.<br />\n1 W. University Parkway<br />\nference? Their names are Hsin- allowed to take courses not listed<br />\nST. PAUL & 24th STS.<br />\ncatalogue.<br />\nundergraduate<br />\nin<br />\nthe<br />\nOpposite J. H. U. Athletic Field<br />\nOne<br />\nof<br />\nthe<br />\nmost<br />\ninteresting<br />\nasHai Chang, '19, and Kwang-Lai<br />\nC. D. Wolfe, Prop.<br />\ntrainquestion<br />\nof<br />\nThe<br />\nold<br />\nphysical<br />\nLou, '20. Or does he know that<br />\npects of the race will be the ability<br />\nDRUG STORE for J. H. U. BOYS<br />\nthe President of the Chinese Stu- ing was again brought up and the shown by the Maryland State run- DELICIOUS SODAS & SUNDAES<br />\nMade<br />\nWith<br />\nPHONE, HOMEWOOD 2121<br />\ndents' Alliance, Dr. M. J. Bau, Dean warned those half dozen men ners. They claim they have a man<br />\nJersey Special Ice Cream<br />\nare<br />\nand<br />\ncutting<br />\nwho<br />\nstill<br />\npersist<br />\nin<br />\ntook his Ph.D. degree at this Uni\"The Velvet Finish\"<br />\nwho can beat any man Hopkins puts<br />\nversity in 1921 ; that P. C. Hsieh, insensible to notes in their postKODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\n20, C. E. Lim, D.P.H., '21, T. V. office box. \"All those who do not up but probably they have never<br />\nfor the Boys<br />\nWhitman's Chocolates and Bon Bons<br />\nSze, '21, and S. H. Lin, '21, are see me immediately will be liable heard of Booth and Somerville.<br />\ngeneral manager, assistant to gen- to suspension,\" said Dr. Latane,<br />\neral manager, advertising man- \"and all who have not seen me by<br />\nager and circulation manager, re- Friday at 12.30 will be positively<br />\nspectively, of The Chinese Stu- suspended.\"<br />\nJJP<br />\ndents' Monthly, a magazine devoted to the interests of the 2,500<br />\nFUTURE PROSPECT OF HOPKINS<br />\nChinese students in United States<br />\nATHLETICS<br />\ncolleges and the more than 4,000<br />\nAthletics at Hopkins have a dim<br />\nWho have studied in America and<br />\nand cheerless future unless there is<br />\n1<br />\ngone back to China?<br />\nfrom<br />\nco-operation<br />\nfinancial<br />\nmore<br />\nThe November issue of this<br />\nmagazine is known as the Con- the students, asserted Mr. Theodore<br />\nference Number and should prove Kistler in an interview last week.<br />\na help to a serious study of the Mr. Kistler, besides his familiar<br />\nFar Eastern questions in connec- role of business manager of athlettion with the Conference for the ics, is also a member of the finance<br />\nLimitation of Armaments and the committee of the Homewood Comrecent intercollegiate meeting at pany and, therefore, speaks with authority.<br />\nPrinceton.<br />\nIn this issue there is an article<br />\nHe repeated his statement made<br />\nhY Professor Willoughby entitled before a recent assembly that the<br />\n\"China at the Conference.\"<br />\nminor sports depend for their funds<br />\nTHE TURKISH CIGARETTE<br />\nlargely upon the receipts from the<br />\nfootball games played at Homewood<br />\nSUBJECT CHOSEN FOR SOPH-FRESH<br />\nEvery day MURADS are held<br />\nand the toll from the three home<br />\nDEBATE<br />\nhigher<br />\nin the estimation of the men<br />\ngames which have already been<br />\nThe Freshman and Sophomore<br />\nwho smoke them.<br />\nplayed is less than that of last year's<br />\ndebating committees got together<br />\nthird game.<br />\nThursday and decided that the<br />\nThey are the standard of Taste.<br />\nsubject for the annual Freshman- \"True,\" he said, \"the opponent<br />\nThey never disappoint—never<br />\nSophomore debate would be \"Re- of that game was Virginia, which<br />\nsolved. That a national system of in itself was a big drawing card,<br />\nfail—never change—<br />\ninsurance against unemployment<br />\nbut that by no means excuses the<br />\nShould be adopted in the United<br />\nThey are 100% pure Turkish tolaxity of the student body this<br />\nStates.\" The committees drew<br />\nbacco—ofthe finest varieties grown.<br />\nlots to determine which side of the year.\"<br />\nCIGARteiT\"Tii\"'\"'\":<br />\nIt is from the sale of season ticksubject would be upheld by their<br />\nYou are proud to smoke them<br />\nESPECAALL'i FOR<br />\nrespective classes. The Freshmen<br />\nADE<br />\nEXPERIEVIC<br />\nM<br />\nWi<br />\nARE<br />\nis<br />\nmoney<br />\nin any company—on any occasion.<br />\nets that a great part of the<br />\n111SCRINOMAG OD GAD<br />\n111Gli<br />\ndrew the affirmative. The tryouts,<br />\nSMOKER OF CAGARETTES<br />\nderived, and had the students re.<br />\nA L°A<br />\nIk)Ft105ti<br />\nwhich are to decide who shall<br />\nThey are the largest selling highsponded to the appeal to aid in sellcompose the teams, will be held<br />\n1hebleMVAaril 1114:0,<br />\ngrade<br />\ncigarette in the world.<br />\nIse/Tat-0k<br />\nas soon as Dr. French or one of ing them, it is certain that much of<br />\niiiiii<br />\n--oitoomitiooloovoiiiiiiiolopo§4444<br />\nIns assistants can arrange to hold the present anxiety would have<br />\nThe cigarette smokers<br />\n<br />\nORTMAN'S<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nThe College Drug Store R.G.by & Company<br />\n<br />\nMURAD<br />\n<br />\njIw<br />\n<br />\nchem. Each team will consist of<br />\ntwo presentation speakers and a<br />\nInan to handle rebuttal. The<br />\nspeakers will be allowed ten minutes each. It is hoped that there<br />\nluaY be a large number of men<br />\nout for the teams, so that the debate may come up to the standard<br />\nset by the lower class contests<br />\n°f the last few years.<br />\n<br />\nThe fact that the A. A. tickets are<br />\nstrictly nontransferrable should be<br />\nremembered. By the illegal lending<br />\nof these cards, many cash admis-<br />\n<br />\nsions are lost at every game.<br />\nAsked if he favored the petition<br />\nnow being circulated regarding the<br />\nBarn, Mr. Kistler replied that the<br />\nHomewood Company had several<br />\nAckerman (sentimentally)<br />\nyears ago made an identical suggeswhy did you fall for me?<br />\nSmith—Your line was just low tion, but the sort of reception it<br />\nenough to trip me.—Lampoon.<br />\nreceived is all too evident.<br />\n<br />\nToni,<br />\n<br />\nofAmerica<br />\nDO prefer Quality to Quantity.<br />\n<br />\nbeen avoided.<br />\n<br />\n\"Judge for Yourself—!\"<br />\n10)))))}3 111)))))))11)<br />\n<br />\nMOO<br />\n<br />\n20<br />\n<br />\n\"fro.,<br />\n<br />\nIlk II<br />\n<br />\n&darkish<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br />\n<br />\n6<br />\n<br />\nRIFLE CLUB TO ORGANIZE<br />\nMARYLAND COLLEGES TO<br />\nWithin the next week the Rifle<br />\nGIVE VIEWS ON DISARM(THE BOOK MART)<br />\nAMENT CONFERENCE<br />\nClub will be organized for the_comComplete Stock of<br />\nHopkins.<br />\nat<br />\nDelegates to Assemble<br />\ning season.<br />\nMedical Books and College<br />\nCommittee Appointed to Present<br />\nNew rifles have been -purchased<br />\nRequisites<br />\nMatter.<br />\nfor the use of the club in matches.<br />\nAt a recent meeting of the StuImporters and Dealers in Fine Books<br />\nThese are Winchester .22, bolt acdent Council \"Dick\" Wood, the<br />\n301 N. CHARLES ST.<br />\ntion, Cadwell match rifles. In the<br />\nPresident, appointed a committee<br />\nBaltimore, Md.<br />\nopinion of Captain McMurray, this<br />\nconsisting of H. D. Cotton, chairis the best rifle obtainable for work<br />\nman; Gilson Engel, Randall, Eli<br />\nof this. sort.<br />\nFrank, Jr., and Davidge Rowland<br />\nTwo matches have been arranged<br />\nto arrange for a meeting at Homefor. A challenge from the Yale<br />\nwood, of the representatives from<br />\nrifle team has been accepted for<br />\nthe various colleges of Maryland<br />\na dual meet in January 21st. On<br />\nto give their views on the DisarmFebruary 15th, the intercollegiate<br />\n°A MES H.& OSCAR G.L5\\rf<br />\nament Conference. It is expected<br />\nmatches will be held. Other meets<br />\noWN ERS<br />\nthat this \"Maryland Conference\"<br />\nVeic<br />\nare pending.<br />\nr4PI<br />\nthe resolutions<br />\napprove<br />\neither<br />\nwill<br />\nThe team for these matches will<br />\n29 Baltimore St., East<br />\ndrawn up by the recent Princeton be made up of men selected by comOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE Conference or will draw up a new<br />\npetition. Any man in college is<br />\nFor College Fraternity Bands<br />\nset of resolutions.<br />\n(Greek Letter Societies)<br />\neligible.<br />\nThis action of the Student<br />\nThe Chas. Willms Surgical<br />\nWork on a new range was startInstrument Co.<br />\nCouncil is the direct result of a<br />\ned today on the top floor of Gilman<br />\n300 N. HOWARD ST., Baltimore, Md. letter received recently from the<br />\nHall. There will be at least five<br />\nSURGICAL INSTRUMENTS<br />\nEastern Collegiate Committee for<br />\nMicroscopes and Supplies,<br />\ntargets at a range of fifty feet.<br />\nStethoscopes<br />\nBlood Lancets Limitation of Armament of which<br />\nBlood Counters<br />\nThe Rifle Club will incur an exCharles Denby of Princeton is<br />\npense, this year, of over five hunchairman. At the Princeton Condred dollars. The Athletic CounPrinters of Philological and<br />\nference this committe of ten men cil has not the money to meet this<br />\nMEN'S SHOES<br />\nScientific Works<br />\nLIBERTY ST. at SARATOGA<br />\nthe<br />\nperpetuate<br />\nto<br />\nappointed<br />\nwas<br />\nOf the Better Class<br />\n(Opposite Hotel Rennert)<br />\n23 S. HANOVER ST.<br />\ndeficit and Captain Murray hopes<br />\nmovement inaugurated at this<br />\nBaltimore, Md.<br />\nto make the sum up by popular<br />\nLUNCHEON—:—DINNER<br />\nconference and Gilson Engel was<br />\n11:30 until 7:30<br />\nsubscription. Personal contribuappointed as the representative tions will be welcome, if turned in<br />\nDANCES<br />\nBANQUETS<br />\nSMOKERS<br />\nURNER BROTHERS<br />\nBy Arrangement<br />\nfrom the State of Maryland. The to Mr.<br />\nWilkinson.<br />\n111 E. BALTIMORE STREET<br />\nTelephone St. Paul 6987<br />\nletter suggested that Hopkins<br />\nBALTIMORE<br />\nIf this money is collected no inishould assemble the Maryland col- tiation fee will be charged, thus<br />\nleges with the view of determining<br />\nDo you know how best to provide<br />\nputting this activity within the<br />\nORDERS RECEIVED FOR<br />\nan income for your old age?<br />\nthe attitude of the student bodies<br />\nmeans of each member of the UniS'<br />\nCOGGIN<br />\nConsult with<br />\nof the said colleges toward the versity. The Rifle Club is a recogTransfer and Baggage Express<br />\nW. W. WALKER<br />\nWashington Conference.<br />\n17 E. Baltimore St.<br />\nnized organization and it is up to<br />\nAUTOMOBILE SERVICE<br />\n909 Calvert Bldg. St. Paul 2581<br />\nWhen this opinion is obtained it us to put it over.<br />\nPHONE, HOMEWOOD 2645-W<br />\nExecthe<br />\nto<br />\nforwarded<br />\nbe<br />\nshall<br />\nPrinters of the<br />\nutive Committee. The representaJohns Hopkins News-Letter<br />\ntives of Maryland shall meet the<br />\nrepresentatives of other states. in<br />\nWashington on a specified date<br />\nand present their views to the Disarmament Conference at to what<br />\nthey think will constitute success.<br />\nDecember 3 or January 14 have<br />\nbeen selected as tentative dates<br />\nfor this presentation.<br />\nThe committee appointed has<br />\nalready taken definite action. A<br />\nletter has been sent to the various<br />\nMaryland colleges, including University of Maryland, St. John's,<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS Western Maryland, Mt. St. Mary<br />\nand Washington College, suggesting that the matter be presented<br />\nto the student bodies of said inEN you get out into the medical world, you'll find<br />\nstitutions and that two delegates<br />\n7oung<br />\ndoctors are judged by something more than<br />\nTeach a Lesson in Style<br />\nbe selected to present these views<br />\ndiagnostic ability and knowledge of their subject. The atto the conference at Hopkins. The<br />\nThey possess the \"dash\" that<br />\nmosphere of success plays its part—the evidence that you<br />\nappeals to college men, toned<br />\ncolleges in question have not been<br />\n\"arrived.\" And among the little details that indicate<br />\nhave<br />\ndown to distinctiveness. And<br />\nthat<br />\nbelieved<br />\nthere's the habit of preferring<br />\nis<br />\nsuccess,<br />\nit<br />\nbut<br />\nfrom<br />\nheard<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\nthe conference will be held' some<br />\ntime the latter part of next week.<br />\nN. HESS' SONS<br />\nPlans are already being form8 E. BALTIMORE ST.<br />\nulated for the receiving and the<br />\nentertainment of the delegates. A<br />\nluncheon will be served at the<br />\nHopkins Club and after the luncheon the conference will be called<br />\nMADE TO ORDER<br />\nto order and will proceed to the<br />\nRemember that Melachrino is a masterblend<br />\nAND<br />\nbusiness at hand. For dinner it is<br />\nof the finest Turkish Tobaccos as originated<br />\nout-of-town<br />\nthe<br />\nthat<br />\nexpected<br />\nby Miltiades Melachrino.Egyptian cigarettes<br />\nFINISHED CLOTHES<br />\nare simply those that originated in Egypt.<br />\nrepresentatives will be entertained<br />\nBut the tobacco is what you want to know<br />\nPLAZA BUILDING<br />\nat the Hopkins Club or at the<br />\nabout—and if it's Melachrino— it's right.<br />\nvarious fraternity houses. They<br />\n19 and 21 EAST FAYETTE ST.<br />\nwill probably be quartered at the<br />\nfraternity houses overnight.<br />\nSHOES<br />\nAt the time this copy goes to<br />\nfor<br />\npress the consent of the Dean has<br />\nUNIVERSITY MEN<br />\nnot been obtained, but it is not bethat any difficulty will arise<br />\nlieved<br />\nFor Sport Wear<br />\nFor Dress<br />\nsource. The selection of<br />\nthis<br />\nfrom<br />\nSmart Styles—Best Leathers<br />\nthe representative of<br />\nas<br />\nHopkins<br />\nModerate Prices<br />\nthe colleges of Maryland is a big<br />\nhonor and the coming Maryland<br />\nConference promises to be a big<br />\nthing for Hopkins.<br />\n19 W. LEXINGTON ST.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nIt's time for a<br />\n<br />\nFALL SUIT<br />\n<br />\nWe're ready<br />\n$30 up<br />\n<br />\nCe4eXatterie<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nHess Shoes<br />\n<br />\nLEMMERT<br />\n<br />\nIn Medicine<br />\n<br />\nW-1;1<br />\n<br />\netachrino<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nWYMAN<br />\n<br />\n\f", "format": "basic_html", "processed": "r<br />\nId<br />\nVOL. XXVI. No. 15<br /><br />\nBALTIMORE, MD., NOVEMBER 23, 1921<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS WINS STATE<br />\nFOOTBALL CHAMPIONSHIP<br />\nMARSHAL FOCH VISITS<br />\nWILL<br />\nL.<br />\nGAME WITH W.&amp;<br />\nJOHNS HOPKINS AND VICTORY OVER ST.JOHNS<br />\nRECEIVES DEGREE<br />\nGIVES UNDISPUTED TITLE<br />\nCLOSE HOME SEASON<br /><br />\nFamous Generalissimo Honored<br />\nHopkins By His Presence<br />\nJ. H. U. Wins Thrilling Victory by a 17-3 Score. Both Teams<br />\nGenerals to Present Experienced Lineup. Hopkins Chances<br />\nYesterday.<br />\nPlay Well, But Black and Blue Proved Superior<br />\nof Victory Considered Good<br />\nBefore a large crowd which<br />\nhad gathered to witness the event,<br />\nAfter much anxious expectation and preparation the great day<br />\nthe degree of Doctor of Laws was came. Saturday, November 19, had been looked forward to<br />\nby the<br />\nProbable Line-up<br />\nconferred on Marshal Ferdinand student bodies of both Johns Hopkins and St. John's. It was not all in<br />\nWASHINGTON AND LEE<br />\nFoch of France yesterday at 3.30<br />\nJOHNS HOPKINS<br />\nvain for the followers of J. H. U., for they are now state football<br />\nin<br />\nfront of Gilman Hall. With champions. For<br />\nBemis 10<br />\nL E<br />\nmany days \"Beat St. John's\" has been the byword<br />\n1 Middleton<br />\nthe faculty in academic dress as•<br />\nMoore (c) 1<br />\nL T<br />\n21 Westerman<br />\nof every Hopkins student. This is what the Hopkins team did on<br />\nVogel 13 sembled on the north portico with<br />\nL G<br />\n13 Magill<br />\nCollins<br />\n18 students, both graduate and un- Saturday at Homewood and the undergraduate body is happy<br />\n0 Totterdale<br />\nRangely 12 dergraduate, gathered on the right because of it. To the team, of course, foremost credit is due, but on<br />\nR G<br />\n8 Landy<br />\nthe coaches, cheer leaders and student body at large there rebounds<br />\nPotts 11<br />\nT<br />\nR<br />\n4 Knecht<br />\nand with the general public on all<br />\n.<br />\n•<br />\nHerndon<br />\n16<br />\nR<br />\nE<br />\nno little part of the reward of the victory which they helped to<br />\n11 Rich<br />\nFrew (2) or Wingo 7 sides, the Allied Generalissimo re- achieve. In celebrating with a bonfire and parade Friday night and<br />\nQ B<br />\n6 Darley<br />\nTucker 6 ceived a welcome worthy of his with an elaborate, parade in downtown Baltimore on Saturday the<br />\nL H B<br />\n12 Bonner<br />\nMattox 3 fame. The Marshal arrived in<br />\nR H B<br />\n14 Calkins<br />\nstudent body gave vent to its splendid spirit, and demanded the at. McDonald 4<br />\nF B<br />\n•<br />\n19 Markell<br />\nBaltimore about 2 o'clock, but<br />\ntention which it so justly deserves. It remained for the Black and<br />\ntook part in ceremonies on City<br />\nSUBSTITUTIONS<br />\nBlue gridiron warriors to complete the task later in the day and they<br />\nHall Plaza before his visit to the<br />\nit nobly. Van Orman's men played in excellent form and left the<br />\ndid<br />\n5<br />\nCameron<br />\nBarton<br />\n5<br />\nUniversity. Upon his arrival,<br />\nDawson 8<br />\nfield with another state championship for Johnny Hopkins. Enter7 Spinney<br />\nMarshal Foch was introduced by<br />\nHall 9<br />\ning the game perhaps slightly favored to win, but outweighed by<br />\n9 Coady<br />\nDean<br />\nJ. H. Latane in an able presTilson 14<br />\n15 Brumble<br />\nSt. John's team, the Black and Blue boys proved very decisively they<br />\nTerry 15<br />\nentation speech. The degree of<br />\n20 Wilson<br />\nwere the better team. Hopkins completely outplayed her opponents<br />\nArbogast 17<br />\n22 Council<br />\nDoctor of Laws in Johns Hopkins<br />\nin<br />\nevery part of the game except perhaps the second quarter, when<br />\nHamilton 21<br />\n29 Willis<br />\nUniversity was then conferred by<br />\nJohn's rallied. It would be useless to name the Hopkins players<br />\nSt.<br />\nThomas<br />\n22<br />\n31 Cromwell<br />\nPresident Frank J. Goodnow, who<br />\nwho starred. Every man on the lineup did stellar work. Each one of<br />\nsaid:<br />\nthe linesmen held when and where necessary and broke through in<br />\nNUMBER OF VETERANS IN SOUTH ATLANTIC CROSSFerdinand Foch, Marshal of<br />\ncustomary fashion.<br />\nCOUNTRY MEET TO BE<br />\nVISITORS' LINEUP<br />\nFrance, Soldier, Statesman, ScholHELD TOMORROW<br />\nInvaders Have Heavy Line. Reserve<br />\nar, Defender of Civilization: By<br />\nDarley's generalship was all that could have been asked. Bonner<br />\nStrength As Strong as Regulars.<br />\nBlack and Blue Prospects Are Good. Md. authority of the State of Mary- was fast around ends as usual and Calkins and Markell were able to<br />\nState Claims to Have First<br />\nHopkins' third \"Big League\"<br />\nland, conferred upon the Board of plunge the cadets' line in good style. Perhaps those players whose<br />\nPlace Sewed.<br />\nopponent of the season will be the<br />\nTrustees and by them entrusted in work stood out for, St. John's were: Fox, Kirkpatrick, Feinberg,<br />\nattraction at Homewood tomorThe annual South Atlantic Cross me, I admit you to the degree of Brown and Tickey. It was a nip and tuck contest from start to<br />\nrow, when the eleven delegates Country meet will be held tomor- Doctor of Laws to this University finish with Hopkins having the edge. Probably the largest crowd<br />\nfrom Washington and Lee Uni- row afternoon at Homewood dur- and do declare you entitled to all which has ever been on Homewood Field turned out to witness the<br />\nversity turn their backs upon tur- ing the first half of the Hopkins- the rights and privileges there- St. John's game and they saw good football. The Cadets marched on<br />\nkey dinners and try to tuck beneath Washington and Lee football game. unto appertaining. In token the field about 2 P. M.and were followed a little later by the Hopkins<br />\ntheir belts the scalps of the cham- The colleges which will be repre- whereof I hand you this diploma.\" student body. There were many trick demonstrations, which kept the<br />\npion football eleven of Maryland. sented are Virginia Military InstiMarshal Foch was escorted by huge crowd amused.<br />\nHopkins has had but a half tute, Virginia Polytechnic Insti- a picked bodyguard of the local R.<br />\nNo one will be averse to hearing about this game in more detail.<br />\nweek's rest since its biggest game tute, Wahsington and Lee, Mary- 0. T. C. unit. After the conferring<br />\nrespect<br />\nof the season, but in this<br />\nland State and Johns Hopkins. In of the degree, the band played the<br />\nUpon winning the toss, Captain Totterdale, of Hopkins, elected<br />\n\"has nothing\" on the generals. addition to these it is probable that \"Marseillaise\" while the great to defend the East goal. Tickey kicked off to Bonner, who ran back<br />\nThose weary soldiers tottered back several other Southern colleges will crowd stood reverently in salute 25 yards. Calkins plunged for four yards and Markell added two<br />\nto the Virginia college last Mon- send teams and while the compe- to the national anthem of our<br />\nmor,:. St. John's was penalized five yards for being offside. After<br />\nday, after a hard battle with Cen- tition will not be as keen as that great sister republic.<br />\ngain -1g three yards on a fake, Bonner and Calkins added one yard<br />\ntre College and after but a day's at the Middle Atlantic States meet<br />\neach and it was fourth down with five yards to go. Calkins kicked<br />\nrest started Homewoodwards. They on November 12, a spirited race PRESIDENT HARDING TO VISIT US to Tickey who shortly returned the punt as St. John's could not<br />\nFOR BIG ARMY-MARINE GAME<br />\nare due to arrive here today and af- will certainly be forthcoming.<br />\nmake the distance. After three attempts by the Hopkins backs had<br />\nAT HOMEWOOD, DEC. 3<br />\nter a light signal practice this afterImmediately before the first half<br />\nWhen the Army-Marine football failed to advance the ball ten yards Calkins punted for 60 yards. On<br />\nnoon hope to put in about twelve of the football game commences, game is played at Homewood on St. John's second play Knecht broke through and nabbed Anderson,<br />\nhours of rest.<br />\nthe starting gun will be fired. The December 3, President Harding who fumbled. Rich recovered for Hopkins on St. John's 20-yard line.<br />\nThe visitors have had a fairly runners will start with one lap will grace the field by his presence After short gains by Markell and Darley had worked the ball into<br />\nsuccessful season, having in six around the field and then go on the for the first time. Accompanying position, Marken made a pretty placement kick from the 22-yard<br />\ngames scored 121 points to 74. cross country course. While the him will be a number of his official line for the first score of the game. Tickey received the next kickoff<br />\nMost of these, however, resulted in first half of the game is in progress guests, representing various for- returning 25 yards and Fox immediately afterward lost five yards.<br />\nthe first two games—shutouts by the marathon men will be doing eign governments at the Disarma- Tickey's return kick to Darley was fumbled. Banfield recovering on<br />\ngood margins for the victors. Ran- two laps around the course and dur- ment Conference.<br />\nHopkins' 45-yard line. Failing to gain, Tickey attempted a dropdolph-Macon fell victim in the first ing the intermission the finish of<br />\nThis fact was made public last kick which failed. Starting with the ball on their 20-yard mark, Marconflict, 41-0, followed a week later the race will be held with one more week by Captain Leroy P. Hunt, kell and Calkins each made three-yard gains and then on a fake kick<br />\nby Emory and Henry, who were time around the track. The entire U. S. M. C., who is commanding formation Bonner broke away for a 30-yard run, without interferblanked 27-0.<br />\ndistance will be about five and a the company of marines stationed ence, around left end. Calkins added five yards, but Hopkins was<br />\nHaving cleaned up fairly well half miles and the race should temporarily on Hopkins Field for penalized for holding. Calkins punted to Fox who was downed by<br />\non the home-lot by that time, the take about thirty-five minutes.<br />\nthe purpose of building additional Middleton. St. John's was penalized and Tickey kicked back to Darcocky ones set out for the North<br />\nSince the last meet the Hopkins seats and boxes for the use of the ley in midfield just as the quarter ended. Score: Hopkins 3, St.<br />\nfor larger game, selecting Rutgers squad has put in many hours of official celebrities. He also an- John's 0.<br />\nas the first victim. But by the hard training and it should be able nounced that the Fifth Marine RegHopkins has the ball on St. St. John's had slightly the best of<br />\nthickness of an eyelash, or more to give a good account of itself. iment, of Belleau Wood and Chatruly, by the shortness of a toe- Booth, although he was ineligible teau Thierry fame, would act as an John's 35-yard line. Markell it the Cadets found themselves on<br />\nlength, the invaders were defeated in the Middle Atlantics, entered the escort to the Marine's football gained five yards and Bonner the locals'43-yard line. Here Tickmade it first down. Marken at- ey tried another drop-kick, but<br />\n14-13, the failure to kick goal de- race and walked away from the ex- team.<br />\ntempt<br />\nat a placement from the 33- missed narrowly. The half soon<br />\nAmong the notables who will fill<br />\ntermining the loser.<br />\nceptionally strong field. He will<br />\nline<br />\nfailed.<br />\nAfter an ex- ended with Hopkins in possession<br />\nyard<br />\nThey were revenged, though, the be eligible for this meet, however, the boxes at the game are Vicechange<br />\nof<br />\nCashell<br />\nbroke of the ball on her own 12-yard<br />\nkicks<br />\nfollowing week, back on their own and unless some dark horse shows President Coolidge, Secretary of<br />\naway<br />\nfor<br />\na<br />\n24-yard<br />\ndash<br />\naround<br />\nline.<br />\nfield, Morris-Harvey feeling the up from another college, he should the Navy Denby, Assistant Secreend.<br />\nBy<br />\nthe<br />\nFox<br />\nand<br />\npenalty<br />\nright<br />\nSECOND HALF<br />\nfull force of a 37-7 defeat.<br />\nnever be headed after he is once tary of the Navy Roosevelt, Adworked the ball<br />\nCalkins kicked off to Kirkpat•The University of West Vir- under way. Captain Somerville miral Coontz, chief of Naval oper- method St. John's<br />\nto Hopkins' 38-yard line where rick, who advanced to the 30-yard<br />\nginia, who last Saturday met de- gave a good account of himself in ations; Major General Lejeune,<br />\nfeat at the hands of Rutgers, met the Middle Atlantics and he should Governor Albert Ritchie and May- Tickey booted a neat drop-kick. line before he was downed by TotAfter a brace of plays in which<br />\nor Broening.<br />\nContinued on page 4, col. 4<br />\nContinued on page 5, col. 3<br />\nContinued on page 4, col. 2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br /><br />\n2<br /><br />\nHopkins News-Letter<br /><br />\nThe Johns<br /><br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br /><br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI F.. ANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEIPOLD, '24.<br />\nDONALD H. KIRKLEY, '25.<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\n.BALTIMORE, MD., NOVEMBER 23, 1921<br />\nA TRIBUTE TO FRANCE AND MARSHAL FOCH<br />\nIn conferring the degree of Doctor of Laws upon Marshal Foch,<br />\nJohns Hopkins University paid tribute to our sister republic across<br />\nthe sea and to the foremost general of the age. The act of the University was another recognition of the great debt which we owe to<br />\nour allies and which it will be impossible to repay for years to come.<br />\nIt is particularly appropriate that this tribute should have been<br />\nmade through the medium of Marshal Foch, who lead the allied<br />\narmies to victory. His presence upon our campus will long be remembered and yesterday will go down in the annals of the present<br />\nundergraduate body as a red-lettered day.<br />\nTHE STATE CHAMPIONSHIP<br />\nFor the first time in several years Johns Hopkins will be able to<br />\nclose the football season with the title \"Champions of the State of<br />\nMaryland\" after its name. Pleasanter still is the realization of the<br />\nfact that the claim is clear-cut, undisputed and respected by all.<br />\nBut now that the honor is ours, let us not forget to place the<br />\ncredit where credit is due.<br />\nFirst and foremost, too much credit cannot be given to Coaches<br />\nVan Orman and O'Rourke, whose untiring efforts of two years finally<br />\naccomplished the results which others were unable to obtain.<br />\nCaptain Bill Totterdale deserves a world of praise for the morale<br />\nwith which he kept his mates instilled. To the team itself, of course,<br />\ngoes our unanimous vote of appreciation. Lacking individual stars,<br />\nit has played a steady fighting machinelike game throughout its schedule.<br />\nOne of the most deserving elements, but one which generally<br />\nslips the mind of the enthusiastic rooter, is the forgotten, maltreated<br />\nindividual ordinarily dignified by the name \"Scrub.\" Those reserves<br />\nwho daily gave their time and energies that a winning outfit might<br />\nbe produced should share honors equally with the \"first team.\"<br />\nLast but not least, the team owes its success to the generous<br />\nsupport of those never-tiring, loyal rooters who followed the squad<br />\nin its defeats and its victories, lending their lungs as a bolster to<br />\ncourage.<br />\nWithout any one of these elements, the team would not have<br />\nsucceeded so well. To team work on and off the field we owe our<br />\nsuccess.<br />\nOTHERS TO WHOM CREDIT IS DUE<br />\nThe old Black and Blue eleven did itself proud last Saturday<br />\nand we feel that they are directly responsible for that satisfied smile<br />\nwhich has been so much in evidence on the campus this week. To<br />\nthe student body at large may be attributed a spirit which would be<br />\nhard to duplicate in any other college in the country. F-7ery one did<br />\ntheir part and helped to consummate the victory of the season. It is<br />\nappropriate that an appreciation of special value should be voted to<br />\nsome whose efforts have shown them to be worthy of special comment. Those committees who made arrangements for the various<br />\nevents are to be complimented on the excellence of their work. The<br />\nefforts of a smiling corps of ushers brought cheer on a gloomy afternoon.<br />\nThe students owe their thanks to Major Garey and his staff, on<br />\naccount of their whole-hearted co-operation. And last, but far from<br />\nleast, much credit is due to Gilson Engel for his spirited work as a<br />\ncheer leader and organizer and also to his assistants, Joe Thompson<br />\nand Don Vanneman. Without the hearty aid of all these loyal supporters of Johnny Hopkins it might have been a different story.<br />\nANNOUNCEMENT<br />\nOn account of the Thanksgiving holiday the present issue of the<br />\nNews-Letter is appearing Wednesday, and the next issue will not<br />\nappear until Thursday, December first.<br /><br />\nDR. BRIDGMAN'S LETTER<br />\nIt is with great pleasure that the News-Letter publishes Dr.<br />\nBridgeman's letter on the Varsity Club. We believe that co-operation between the Varsity Club and the undergraduate body is necessary and that the best way that this co-operation can be obtained is<br />\nby perfect and complete understanding on both sides. It is to be<br />\nhoped that the undergraduate members of the club and the representatives to the Holding Company will take an active interest in<br />\nthese organizations.<br />\nThe Varsity Club exists solely for the good of the University<br />\nand has already accomplished a great deal. We extend it our heartiest<br />\ncongratulations and express our willingness to be called upon at any<br />\ntime for any aid within our power.<br /><br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 1 1 o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br /><br />\nFRESH-SOPH DEBATE ARRANGED<br />\nAN APPEAL FOR<br />\nDISARMAMENT<br />\nThe Debating Council has arThe<br />\nDisarmament<br />\nConfer- ranged to have the annual Freshence at Washington is at last in man-Sophomore Debate in the Civil<br />\nsession. This meeting together Engineering Hall, Friday evening,<br />\nof delegates of the powers of the<br />\nDecember 16th. It promises to be<br />\nA T $8.00, made<br />\nworld is significant in itself. For<br />\nAT<br />\npeppy affair, as the Undergrada<br />\nthis conference will differ from<br />\ngrain leather,<br />\nevery one that has ever gone before uate Orchestra has agreed to furin tan or black,<br />\nit. These men do not come here for nish music for the dance which folwith square toe and<br />\nglory or personal achievement. lows the debate. This form of jazz<br />\nheavy<br />\nperforations,<br />\nThey do not come to jockey with debate proved a tremendous 'sucthis is an oxford<br />\nother 'nations in the race for develcess last year when the two upper<br />\nany<br />\ncollege man<br />\nopment. They do not come to<br />\nclasses<br />\nmatched<br />\nwits.<br />\nDr.<br />\nFrench<br />\nbicker and squabble greedily for<br />\ncan be proud of.<br />\nthe spoils of war—the hollow husks has consented to hold the tryouts<br />\nIn high shoe the<br />\nof victory. They come because the for the teams in Room 112, Gilman<br />\nsame<br />\nstyle is $8.50.<br />\npeoples of the world sent them. Hall, Monday and Tuesday, at<br />\nThis conference is not optional. It 12.30. The Freshman team will be<br />\nis not at the behest of any minor<br />\nselected Monday and Sophomore<br />\nnation. It is but the result of uncontrollable. forces. The world has team on Tuesday.<br />\nCharles Street, 210 North<br />\ndecided that war must stop.<br />\nA few—a frightful minority— VOCATIONAL EDUCATION PROOWINGS TO CAPTAIN BASstill labor under the delusion that<br />\nGRESSING IN MAINE<br />\nKETBALL<br />\narmaments are a safeguard against<br />\nBackwoodsmen attend vocawar. That delusion was exploded<br />\nChosen at First Meeting Last Monday.<br />\nOrganization Meeting Held.<br />\nfor most of us by the conflict which tional night schools in Portland,<br />\nAt<br />\nthe first practice of the Basjust shattered Europe and shook Me., some of them walking 7 and<br />\nketball Team held last Monday<br />\nthe universe. For forty years be- 8 miles to attend the classes.<br />\nat Friends' School gymnasium.<br />\nfore 1914 the nations of Europe There are now 26 schools in Maine<br />\n\"Bobby\" Owings, last year's. star<br />\nraced to keep pace with Germany giving vocational<br />\nagriculture, 87 performer, was elected captain for<br />\nin the marathon toward war prephome economics and 65 industrial the coming season.<br />\naration. France, with the fear of<br />\nEarlier in the day an organizathe Black Eagle clutching 'at her work, besides 70 evening and<br />\nmeeting was held in the.M. E.<br />\ntion<br />\nheart, impoverished herself. She Americanization schools. VocaBuilding and a large squad signineglected education, public im- tional education in the state has<br />\nfied their intention of trying for<br />\nprovements, everything to which grown from making small things<br />\nthe team. Plans for the coming<br />\nher people had a right. What hap- to building houses, machines and<br />\nseason were discussed and it was<br />\npened in France happened in every automobiles. Boys of the<br />\nDexter announced that practice would be<br />\nstate in Europe. The cause of this<br />\nHigh School have built a new shop continued this week at Friends'<br />\nwe all know—Kruppism and Junfor their vocational work. The School and thereafter at the Richkerism.<br />\nmond Market Armory. Owing to<br />\nIn 1910 the people of the United number of centers where the state the small capacity of the Park<br />\nStates were taxed $6.50 per capita. department carries on extension avenue gymnasium 15 men were<br />\nToday every man, woman and child courses for industrial teachers selected to practice there this<br />\npays out $54.00 a year. Of this will be doubled soon to meet<br />\nthe week.<br />\nsum, $50 goes to war, past and fuAs yet no coach has been apdemands.—School Life.<br />\nture. The remaining $4 goes to<br />\nproved by the Varsity Club, allegislative and executive expenses,<br />\nthough it is rumored that the<br />\neducation, public works, etc. And WHARTON SCHOOL .ABANDONS names of several men, well known<br />\nEXAMS<br />\nyet there are people who are opin local circles, are under considposed to disarmament. ' If there<br />\nDean Emory R. Johnscin, of the eration. No announcement will be<br />\nactually are, they never were in the Wharton School, announces that made regarding this matter until<br />\nmuck and blood of Flanders; they the faculty of that department of it is definitely decided to put a<br />\nnever had relatives or friends who the University of Pennsylvania team on the floor this season. This<br />\nwent out and never came back, they has decided to abolish the usual depends upon the financial outcannot appreciate what it means to midyear and final examinations. come of the football season.<br />\nhave nine millions of men wiped Such a step will affect about 2,000<br />\nManager Powell has arranged<br />\noff the earth and millions more students in all Wharton School an attractive tentative schedule<br />\ncrippled or destitute; they cannot courses.<br />\nfor his charges, but this, too, will<br />\nappreciate the hideous thing which<br />\nIn late years the proposal to be withheld until the Varsity Club<br />\nravaged Europe for four years. eliminate the final semester ex- takes action on the matter. CapEither this, or they are the para- aminations has been the subject tain Owings and \"Jack\" Bauernsites of war—the leeches of death, of considerable discussion in col- schmidt are the only undergradwho forge the weapons with which legiate circles, and the adoption uates surviving from last year's<br />\nman may slay and maim his fellow of the step by the Wharton School team, but there is promising maman.<br />\nfaculty marks a new era in mod- terial in the Medical School. The<br />\nArmaments are not only fright- ern educational methods. It is a members of last year's Freshman<br />\nful in themselves, but they under- development which follows nat- team should make a strong bid for<br />\nmine the ideals and innermost urally on the heels of the psycho- places and several men who<br />\nthoughts of men. What did mili- logical examinations which have starred in prep school are numtarism do for Germany? It turned already replaced old-fashioned ex- bered among the members of the<br />\na peace-loving, lovable race into a aminations for entrance require- present Freshman Class.<br />\nbrutal, obnoxious people. The ments in many higher institutions<br />\nWorld War was not fought to con- of learning.<br />\nAN APPEAL FOR DISARMAMENT<br />\nIn doing away with the usual<br />\nquer the German people but it was<br />\nContinued from col. 3<br />\nfought to rid the world of an idea— examination period the Wharton preparedness, and reaped the harto destroy not a race, but a system School faculty will save two vest which it had sown. Now it is<br />\n—to crush Kaiserism and Krupp- weeks of each semester. Such time going to try disarmament. It can<br />\nit is thought can be used more not fail. No objections, no obism for ever and ever.<br />\nThe world has decided that war advantageously in continuing stacles can stop it. There is but<br />\nmust cease. It tried armaments, class discussions and lectures.— one end to be hoped for. May the<br />\nContinued on col. 5<br />\nPhiladelphia Public Ledger.<br />\nWashington Conference succeed.<br /><br />\ntgeb<br /><br />\nTHE JOHN HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br />\nDR. BRIDGMAN EXPLAINS ATH0. D. K. HAS SEVEN<br />\nLETIC SITUATION AND THE ORCHAPTERS<br />\nGANIZATION AND AIMS OF<br />\nThree Other Colleges Under ConsideraTHE VARSITY CLUB<br />\nA Column in Which the Correspondents<br />\ntion. Annual Convention to Be<br />\nAre Allowed Latitude, But ShoulHeld at Pittsburgh.<br />\nIn<br />\nthe<br />\nfollowing<br />\nletter<br />\nDr.<br />\nEvder the Responsibility.<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\n3<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br /><br />\nOmicron Delta Kappa, the unelith W. Bridgman, president of<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\ndergraduate<br />\nhonorary fraternity<br />\nthe Varsity Club, - explains the<br />\nSUNDAY SERVICES<br />\nfounded<br />\nat<br />\nWashington<br />\nand Lee<br />\nfunction of this organization.<br />\n8<br />\nA.<br />\nM.—Holy<br />\nCommunion<br />\nUniversity<br />\nin 1914, has been exEvery Hopkins man ought to<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\nknow of the unselfish service panding rapidly and it now inthat Hopkins alumni are perform- pludes circles in seven colleges and<br />\ning through the medium of this universities. The following are<br />\nclub and for those who do not, the institutions at which circles<br />\nBONDS<br />\nENVELOPES<br />\nLEDGERS<br />\nthis letter should provide much en have been established: Washington<br />\nand Lee University, Johns HopEditor-in-Chief the News-Letter: lig-htenment:<br />\nkins Univerity, University of<br />\nreading<br />\nof<br />\nroom<br />\nmain<br />\nIs the<br />\nTo the Students of the Johns Hop- Pittsburgh, Davidson College, Unithe library to become a place for<br />\nkins University.<br />\nversity of Richmond, Center Colgeneral conversation and discusIt is only fair that the students lege and William and Mary Col205 W.CAMDEN STREET<br />\nsion? That is the impression a of the University should be kept lege. It was at the latter college<br />\ninformed<br />\nof<br />\nthe<br />\nvarious<br />\nactivities that Phi Beta Kappa, the parent of<br />\nstranger would naturally receive<br />\nupon going into the reading room. directed towards the improvement all American Greek letter frater- COTILLON BOARD ARRANGING<br />\nDOINGS OF THE SOPHOMORES<br />\nThe recently appointed \"pep\"<br />\nCHRISTMAS DANCE<br />\nIn spite of the fact that Silence is of the Johns Hopkins University, nities, was founded in 1776.<br />\nit<br />\nis<br />\non<br />\nand<br />\nthis<br />\naccount<br />\nthat<br />\nI<br />\nam<br />\nprinted in bold black letters in<br />\nAt present, further extension in<br />\nAt a meeting of the CotilIon committee was .commended by<br />\nseveral places around the room, taking the liberty to outline the different parts of the country is Board which was held last Thurs- President Callard at the Soph class<br />\nstudents (freshmen particularly) purposes and efforts of the alum- under the consideration of the fra- day the arrangements for the meeting held last Thursday. The<br />\npersist in carrying on conversa- ni organization, the Varsity Club. ternity. A college in Western Christmas cotillon were discussed. work of the committee has been<br />\ntions.<br />\nIn spite of the valued efforts of Pennsylvania, a state university in Louis Fisher has been secured to very much in evidence during the<br />\nSuch violation of the rules of Dr. Abercrombie, of Mr. Kistler, the Southwest, and a university in take charge of the music which past few days. They made it a<br />\nthe library is not becoming col- and of various interested alumni the far South are among the insti- assures the best Baltimore can special point to see that all Freshlege men nor is it giving the other and professors, and primarily be- tutions at which new circles may furnish for this occasion. Bids for men were at the Barn to learn the<br />\nfellow who wishes to read and cause of the lack of funds, the ath- be established in the near future. the refreshments will be secured yells and songs used at the St.<br />\nstudy a square deal. If you must letic activities at Johns Hopkins<br />\nThe annual convention for this during the week-end and reports John's game. Numerous scraps rethe<br />\nlibrary to do it. have not been commensurate with college year will be held at the Uni- ,made at the next meeting on Mon- sulted from attempting to persuade<br />\ntalk get out of<br />\nDon't disturb the many students the standards established by the versity of Pittsburgh sometime in day. It is planned this year to have some Freshmen to come to these<br />\nand strangers -with your chatter. University in other fields. The late February or early March. The more simple refreshments and meetings, but \"force\" being the<br />\nC. M. University could only afford about society publishes a small paper spend more money on programs watchword of the committee, they<br />\n$3,000 a year to athletics and pro- known as the Omicron Delta Kap- and favors. The Board will meet usually succeeded in accomplishing their purpose.<br />\nTo the Editor of the News-Letter, ceeds of the sale of the Cage on pa News-Letter, the autumn issue several men who are agents for<br />\nPresident Callard, however, reLittle Ross Street had to be de- of which will soon appear.<br />\nleather novelties and programs on<br />\nDear Sir:<br />\nminded<br />\nthe remainder of the class<br />\nMonday and decide on the type<br />\nReferring at this rather late date voted to scientific buildings, and the<br />\nthat<br />\ntheir<br />\nsupport was also essensports. His salary is very much which they will use. No subscripto a letter in your edition of Oc- students themselves being unable<br />\ntial<br />\nto<br />\nthe<br />\napplying of \"pep.\"<br />\nto finance athletics, were forced to higher than that of any preceding tion price has been set as yet, but<br />\ntober 25 signed \"Anti-Disarmacoach, and he is regarded as a per- it is planned to make December 21<br />\nFACULTY NOTE<br />\nment,\" I wish to take exception to train under very adverse condimanent man, whose policies in dif- remembered as the night of the<br />\ntions.<br />\nIt<br />\nwas<br />\nthat<br />\nbelieved<br />\nif<br />\nIt<br />\nwas<br />\nrecently made public<br />\ntwo statements there made, namemoney could be accumulated from ferent sports shall be constantly biggest and best cotillon Hopkins that Professor<br />\nly, that \"the idea of preventing<br />\nW.W.Willoughby<br />\nprogressive. The advertisement of has ever known at a price which of this<br />\nUniversity was in the main<br />\nwars by disarmament is hopeless\" the alumni, sufficient to meet the<br />\nthe sports and athletic activities is will compete with prices of for- author of<br />\nthe ten points which<br />\nand that \"The way to prevent war primary expenses, that athletics<br />\na problem that is being worked out, mer years.<br />\nChina presented to the Disarmais to be ready to fight when the could be made to pay and that the<br />\nand althrgh not yet satisfactory, Tea dances will be given after ment<br />\ntime comes, not by laying down interest of the students and alumni<br />\nConference.<br />\nin athletics would be increased. To there is constant improvement.<br />\nthe St. John's and Washington<br />\nall means of defense,—to do that<br />\nThe Varsity Club is now engaged and Lee games, the affair after<br />\nthis end, a number of \"H\" men<br />\nThe young man walked down<br />\nis to invite war.\"<br />\nin furthering the interest of the the Haverford game having the street one shoe off and his coat<br />\nthe<br />\namong<br />\nalumni<br />\nundertook<br />\nto<br />\nNow as a matter of historical<br />\nalumni in the establishment of proved such a success. Tickets turned inside out. A policeman<br />\nfact, the nations that have built help out in the financial managealumni<br />\nscholarships, which are to can be secured from any member stopped him.<br />\nment<br />\nof<br />\nathletics.<br />\nThey<br />\nare<br />\nworkup their military forces have<br />\nbe<br />\nawarded<br />\ning<br />\nalong the requirements of the Board.<br />\nonly<br />\nfor<br />\nUnithe<br />\ninterest<br />\nof<br />\nthe<br />\n\"What's the idea?\" he debeen the ones to engage in war.<br />\nof<br />\nthe<br />\nversity,<br />\nRhodes<br />\nScholarship.<br />\nIt<br />\nendeavoring<br />\nis<br />\nto<br />\ninterfere<br />\nmanded.<br />\nThe recent conflict is but one of<br />\nmany to prove that. Apparently, only so far as concerns monetary felt that such a type of man will cut according to the size of the \"Well, you see, it's this way,\"<br />\nreplied the young man. \"I'm takas soon as a nation arms exces- matters, and they stand primarily stand for the alumni's opinion of an cloth. •<br />\nfor<br />\nuniversal<br />\nall-around<br />\ncollege<br />\nman,<br />\nand<br />\nwill<br />\nrather<br />\nathletics<br />\nthan<br />\ning<br />\na course at a correspondence<br />\nI do not believe that the students<br />\nsively, its intercourse and relaindividual<br />\nimprove<br />\nsports,<br />\nthe<br />\nhelp<br />\nto<br />\nin<br />\nstudent<br />\nthe<br />\nhope<br />\nperthat<br />\nappreciate the great amount of, de- school and yesterday those darn<br />\ntions with other nations are based<br />\nthe<br />\nphysical<br />\nsonnel.<br />\ndevelopment<br />\nattained<br />\ntail involved in all this work. The sophomores wrote to me and told<br />\nconsciousness<br />\non the<br />\nof greater<br />\nthe<br />\nJohns<br />\nat<br />\nHopkins<br />\nMonies<br />\nbear<br />\nmight<br />\nobtained<br />\nabove<br />\nthe<br />\nexnumber of meetings that are held, me to haze myself.\"—The Owl.<br />\nforce, rather than on the feeling<br />\nits<br />\nturning<br />\npart<br />\npenses<br />\nto<br />\nin<br />\nout<br />\nbe<br />\nare<br />\nthe<br />\nbest<br />\ndevoted<br />\ntowards<br />\nnight work by individuals, and<br />\nthe<br />\nof justice and fair-dealing. Naman.<br />\ncollege<br />\ntype<br />\nof<br />\nathletics,<br />\nprimarily<br />\nwith<br />\nthe<br />\nidea<br />\nof<br />\ncontributions<br />\nthe<br />\nby alumni, all rep- stand.<br />\nRepresentation on the<br />\ntional pride — patriotism — bea<br />\ngetting<br />\ngymnasium<br />\nat<br />\nHomeThere<br />\ngreat<br />\nwere<br />\nmany<br />\na<br />\nprobunselfish<br />\nresent<br />\ninterest<br />\nand should Homewood Company exists for all<br />\ncomes developed to an extreme<br />\npitch,—national \"honor\" is in- lems_to be met, and they had to be wood, which lack is acutely a hand- be met by the students with the the parts, and the Homewood<br />\nvolved, or the chip is in some way met, not only from the point of icap to athletic progress. The ex- same reward in view—the interest Company endeavors to act only<br />\nknocked from the shoulder,—and view of the alumni, but with re- penses of athletics are considerable. of the University. In the distri- after all sides of the question<br />\nthe nation runs amuck, dragging gard to the Trustees, Faculty, and Football is the only paying sport. bution of alumni money the stu- have been represented. May the<br />\nothers with it. Our own country the students. There was no idea Last year the deficit in lacrosse dents have part control, and every Varsity Club count on the poshas not been as free as we might of prolonged control on the part was in the neighborhood of $2,500; effort is made by the Varsity Club itive co-operation of the members<br />\nwish from the taint of power of the alumni, for they are work- of baseball, $2,000; of basket-ball, to know- and further the students' of the University? May they hope<br />\nthat all criticism will be construcrather than right in our relations ing, all of them, with absolutely no $1,500, and other teams altogether, interests.<br />\npersonal gain, and at the same about $750. The training camp<br />\nThe Varsity Club has a five-year tive? Many of the faults in the<br />\nwith other nations.<br />\nAs a preventive of war, prep- time at a great loss to themselves cost $1,500. In addition, $1,500 contract with the Trustees, and system are well recognized and<br />\naration for war has been tried and in the point of view oi time given, was spent last year for interest on they hope that at the end of that they are endeavoring to meet them.<br />\nhas failed: fair-dealing and jus- not to speak of their financial do- the investment heretofore made by time, athletics will be on a success- Criticise among yourselves, but<br />\ntice, with their consequent lack of nations. With the consent of the the Trustees in the Homewood ful financial basis and that they can until you find out all reasons, do<br />\nneed for armament, have been Trustees, the Faculty, and students, field, and, of course, the general ex- have established an athletic depart- not go out into the world at large<br />\ntried and have succeeded. After they agreed to do what they could penses of athletics, salaries, equip- ment with its staff of instructors, and find fault. Very soon it will<br />\nthe Boxer uprising we returned to meet the different problems. ment, etc., have been unusually which shall be regarded on the be you students who will have to<br />\nto China a part of the indemnity Having organized the Varsity high. It is, therefore, deemed same plane as the department of take the places of those alumni who<br />\nexacted of her. I feel safe in say- Club, they established a Holding reasonable to expect that the stu- Chemistry, French, or any other are working at present. Keep foring that if China were now armed Company with the purpose of es- dents will be careful as possible developmental part of the student's ward the idea of helping and not<br />\nto the teeth we should have no tablishing a stock company, to with equipment, etc., given them by life. The interest and support of tearing down.<br />\nI cannot close without commentneed to fear her. Total disarma- which the \"H\" men might take the alumni, and it is evident that, the Trustees, the President, the<br />\ninent, even, without other cause shares. Some $13,000 was accum- until expenses can be met, that Dean, and other Faculty members, ing most favorably and appreciatively on the improvement and infor good will, has proved its pow- ulated in this way. The control of money should be distributed for has been excellent.<br />\nIt is sometimes felt that the stu- terest of the great mass of the stuer for peace and harmony; there the Hbmewood Company is vested those teams which represent the inis our Canadian frontier—not a in a Board of Directors, consisting terests of the largest number of dents are assuming a critical point dents. It is only by watching the<br />\nfort, not a war vessel, for a hun- of representatives from the Trus- students. The swimming team, of view. It is true also of some of students from year to year that one<br />\ndred years—and yet Canada has tees, Faculty, Alumni and students. which only interests 10 students the alumni. In this work the co- appreciates the general developnot once during that time invaded Under their supervision $8,000 was and is financially unsuccessful, operation of every part of the Uni- ment. The rooting, the student<br />\nour country. You may say that spent for stands. An unusually ca- should not rank with football, versity is essential, and where an band, the college spirit, and the<br />\npeople of the same race and lan- pable and interested Director of which directly or indirectly, inter- individual feels that an action taken different teams are all most comguage were involved, and so they Athletics was obtained in the per- ests the majority of students, and by the Varsity Club is wrong, it plimentary to the students.<br />\nSincerely yours,<br />\nwere, but the same thing has hap- son of Dr. Ray Van Orman. He which is financially successful. The should be his place, not to criticise,<br />\nE. W. BRIDGMAN,<br />\npened between differing peoples. is primarily the football coach, but Varsity Club wants to encourage but to seek information about the<br />\nalso has charge of all the various all athletics, but the suit must be action before he takes a permanent<br />\nPresident of the Varsity Club.<br />\nContinued on page 5, co/. 4<br />\nAll letters intended for publication<br />\nmust be concise, written id ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but dames signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nThe W. H. Moore, Jr. Paper Co.<br /><br />\nTHE JOHNS,H OPKINS LEW S-LETTER, NOVEMBER 23, 1921<br /><br />\n4<br />\nMR. PLUMB ADDRESSES SOCIAL SCIENCE CLUB<br />\nOutlines Plumb Plan and Answers Questions. Mr. Fenneman Explains the<br />\nPurposes of the Club.<br /><br />\nMr. Plumb, originator of the<br /><br />\nY. M. C. A. ACTIVITIES<br /><br />\nThe Deputation Team started<br />\nwork Sunday, at Easton M. E.<br />\nChurch, near Ananpolis. The team<br />\nis expected to visit a church each<br />\nSunday and will make several trips<br />\naround the city. It is made up of<br />\nHenry Callard, '24, chairman; Leroy Baughman, '22; Paul Stevens,<br />\n'23, and William Roberts, '24. An<br />\ninvitation was extended to those<br />\nwho wish to be on the team, and if<br />\nenough men are obtained another<br />\nteam will be formed. Callard did<br />\nfine work last year and it is expected that he will be one of the<br />\nbest chairmen that Hopkins has<br />\nhad.<br />\nA few weeks ago a conference<br />\nwas held at the Central Branch,<br />\nCathedral and Franklin Streets, on<br />\nstudent delegates from the colleges<br />\nof Maryland, in the interest of the<br />\nStudent Friendship Fund. About<br />\ntwenty colleges were represented,<br />\nand they drew up a resolution to<br />\nput in a campaign for said fund on<br />\nthe various college campuses.<br /><br />\nHARRY KING TOOTLE,'03,<br />\nVISITS THE UNIVERSITY<br />\nAlumnus Envies the Good Fortune of<br />\nthe College Men Who Have<br />\nHomewood.<br /><br />\nHarry King Tootle, '03, paid his<br />\nfirst visit to Homewood last Monday since the war. Before going<br />\nabroad he had made occasional<br />\ntripS to the University from Camp<br />\nMeade, where he was stationed for<br />\na time. Mr. Tootle now spends<br />\nmost of the year on his country<br />\nplace, near Bethany, W. Va. He<br />\nwas in Baltimore to see two new<br />\nplays here before they reached the<br />\nmetropolis. His interest in the<br />\ntheatrical world is due to the fact<br />\nthat he is himself a playright.<br />\n\"Cheated,\" his first play written<br />\nsince the Nvar, had its successful<br />\nstock tryout last summer, and Mr.<br />\nTootle visited Baltimore on his way<br />\nto New York to arrange for its<br />\nBroadway production when theatrical conditions improve.<br /><br />\nFRESHMAN CLASS MEETING<br /><br />\nImmediately following the General Assembly, the Freshman Class<br />\nwas called to order by President<br />\nO'Connor. He insisted that the<br />\nFreshmen must live up to the regulations if they wish to avoid a<br />\nfight. He said, in part, \"If you fellows persist in breaking the regulations, there is bound to be a fight<br />\nand you can't expect your fellow<br />\nFreshmen to help you out if you<br />\nbreak regulations. We do not want<br />\nto fight. There will be plenty of<br /><br />\nMUSICAL CLUBS TO START<br />\nSEASON SHORTLY<br />\nSeason to Open November 28 With<br />\nConcert at Evergreen<br /><br />\nThe final selection of candidates<br />\nfor membership in the Glee and<br />\nMandolin Clubs has been made recently and work is well under way<br />\ntowards perfecting an organization<br />\nof which every Hopkins man may<br />\nwell be proud. With the Glee Club<br />\nunder the able directorship of<br />\n\"Doug\" Coulter, '21, and the Mandolin Club under that of President<br />\nWaldo Hambleton, this season<br />\nneed for fighting strength at the promises to be the best yet. One<br />\nFresh-Soph football game. You of the most attractive schedules<br />\nmust obey the regulations. Also, ever attempted at J. H. U. will bedo not forget the new rule passed gin with the opening concert at the<br />\nby the Student Council, which re- Evergreen Hospital for blind solquires all Freshmen to wear both diers on November 28. Following<br />\ntheir Freshman button and their ac- this there will be another given at<br />\ntivities button, except with their the Franklin High School, Reistersuniform, when only the Freshman town, on December 17. Similar entertainments are planned to be held<br />\nbutton is needed.\"<br />\n,The members of the class were at State Normal, Eastern High,<br />\nalso urged by Treasurer Norris to Western High, Goucher, Tome,<br />\npay their class dues. These dues Annapolis, and Washington, while<br />\nhave to be paid before the first of in addition a tour will be made during the Easter holidays through<br />\nthe year.<br />\n\"Western Maryland, visiting en<br />\nroute Cumberland, Frederick, HaVICTORY OVER ST. JOHNS<br />\ngerstown and Westminster.<br />\nBesides an unusually attractive<br />\nContinued from page 1<br />\nof musical selections other<br />\nchoice<br />\nterdale. Tickey was forced to punt<br />\nfeatures, including a quarspecial<br />\nto Darley. Markell made five<br />\nbe presented. Those sewill<br />\ntette,<br />\nyards and Calkins gained first<br />\ntheir University<br />\nrepresent<br />\nto<br />\nlected<br />\ndown. Calkins, Bonner and Marin<br />\nas follows:<br />\nare<br />\nclubs<br />\nthese<br />\nhell together annexed another<br /><br />\nPlumb Plan and well known in industrial circles as an advocate of<br />\na square deal for everyone, addressed the Social Science Club last<br />\nWednesday.<br />\nIn presenting his speech, Mr.<br />\nPlumb went back to the early government and the Bill of Rights that<br />\nwas formulated to protect each citizen in his liberties. From this bill,<br />\nhe claims that the American people get three great industrial principles. First, that the government<br />\nis for the common good of all and<br />\nnot for the interest of a small and<br />\nfavored class. Second, that no man,<br />\ncorporation or group of men can<br />\nget more for a service than is fair<br />\nto the public. Third, that men have<br />\nthe right to enjoy the gains their<br />\nindustry produces. These three<br />\nprinciples are violated in their entirety by the modern corporation,<br />\n\"The Hopkins students of today<br />\nwhich by killing competition is able,<br />\nGAME WITH W. &amp; L.<br />\nmilmaking<br />\nare to be congratulated on beautieven though it may be<br />\nContinued from page 1<br />\nlions, to fix prices to suit itself and<br />\nful Homewood,\" said Mr. Tootle, in<br />\nWashington and Lee on November<br />\nto keep wages at a low level. Labor.<br />\n12th and forced them to accept a expressing his pleasure at what has<br />\nwhich in the last ten years has inbeen done and will be done here.<br />\n28-7 beating.<br />\ncreased tremendously in efficiency,<br />\nLast Saturday the most interest- \"The realization was not for the<br />\nhas the right to expect at least a<br />\ning<br />\ngame of all from a local point students of my day, but at least we<br />\nmoderate increase in wages from<br />\nhad the dream of what was to be.<br />\nthat time to this; yet at present, in of view, the Blue and the Gray<br />\nthe old-timers know the<br />\nOnly<br />\n\"wonthe<br />\nCollege,<br />\nspite of the untold wealth and enor- played Centre<br />\nlife of the cobble stones, the<br />\ncampus<br />\nyears,<br />\nlast<br />\nfew<br />\nthe<br />\nof<br />\nmous resources of America, there der team\"<br />\nunyielding<br />\npavement of Little Ross first down and then came a pass,<br />\ndowned<br />\nago<br />\nweeks<br />\nare five million unemployed; and who but a few<br />\nGLEE CLUB<br />\nA<br />\nStreet.<br />\nclass<br />\nfracas in those days Calkins to Bonner, who ran 25<br />\nthe great laboring body, instead of Harvard in her first intersectional<br />\nFirst Tenors—Harwood, Moehle,<br />\njust outside the 'cage' was as realyards to the visitors' one-foot line. Gould, Jacobson, F. W. Wilson,<br />\nenjoying the gains of industry, is defeat in thirty years. For the first<br />\nistic as a riot in a street-car strike. Markell carried the ball through<br />\nthe<br />\nsecond<br />\nthe<br />\nof<br />\nmost<br />\nand<br />\nquarter<br />\npoverty<br />\nof<br />\npinch<br />\nthe<br />\nexperiencing<br />\nCarper.<br />\ntwo teams battled fiercely, neither Going back to look at what remains right tackle for a touchdown and<br />\nand actual want.<br />\nSecond Tenors—Kessler, Simon,<br />\nBo McMillin, who will be of a college in a city is about as Calkins kicked goal. After a dou- Belt, Hopkins, Thomas, Hall,<br />\nAs a solution to the present in- scoring.<br />\nremembered by all Hopkins basket- satisfying to the emotions as gazing ble exchange of kicks we find the Houston.<br />\ndustrial situation, Mr. Plumb proball fans of last year, finally draw- upon a hospital which happened to ball in St. John's possession on her<br />\nFirst Basses—Parsons, Regester,<br />\nposes a new form for corporations<br />\nblood for the first touchdown. be the birthplace of a great man. own 43-yard line, as the quarter Morrell, Tilghman, Roher.<br />\ning<br />\nlaborer<br />\nand<br />\ncapitalist<br />\nthe<br />\nwhich<br />\nin<br />\nThe game was played in ankle-deep Therefore, I am transferring my ends.<br />\nSecond Basses — Eichelberger,<br />\nwould each have a voice in proporand most of the gaining of the .emotional allegiance to Homewood,<br />\nmud<br />\nforby<br />\nthe<br />\nperiod<br />\nlast<br />\nwhich<br />\nthe<br />\nstarts<br />\nBrown<br />\nCrider, Sherwood, Gross, Ruoff,<br />\ntion to the interest<br />\nresulted from a passing but without sacrificing a single one<br />\nwinners<br />\nseven<br />\ninvestfor<br />\nend<br />\nhis<br />\nright<br />\non<br />\nElgent.<br />\ngoing outside<br />\nmer should receive<br />\ngame which the Generals were un- of the happy memories of the goodTickey makes five more<br />\nyards.<br />\nment and the value of the wages<br />\nMANDOLIN CLUB<br />\nly men who were my professors,<br />\nable to stop.<br />\nadvancing<br />\nAfter<br />\ndown.<br />\nfirst<br />\na<br />\nand<br />\nwhich the latter would receive for<br />\nSimon, Connor, Holsopple, Elmy college mates and my<br />\nOur visitors tomorrow will averball into position Tickey at- gert, Hall, Kan Morrel, Mullikin,<br />\nthe<br />\nhis services. In this way the two<br />\nfriends.\"<br />\ntempts a drop-kick almost in mid- Frau, Sietz, Williams, Chambers,<br />\nbodies would act as a check upon age 174 pounds, the line from tackle<br />\nMr. Tootle was president of his<br />\nfield. Hopkins gets the ball on her<br />\neach other, and no fictitious or wa- to tackle averaging 197. The backFranzkiwisch, Kuder,<br />\nfast, class his Senior year. That same own 20-yard line. Bonner first Kinnamon,<br />\ntered stock could be issued. One- field is unusually light and<br />\nHamburger, Ruoff, WilThe year he was also editor-in-chief of makes five and then ten yards. Siegrist,<br />\nhalf of the profits would be divided averaging but 160 per man.<br />\nCerofano, Torsch, Lewis.<br />\nthe the NEWS-LETTER and associate ed- Darley goes through center for son,<br />\namong the shareholders, and the players are all experienced in<br />\nhaving itor-in-chief of the Hullabaloo. He five yards. He is hurt but continother half would be devoted to the game, most of the team<br />\nthree was .the first Hopkins sprinter to ues to play. Markell breaks SERGEANT FERRIS TRAPS TRUANT<br />\nor<br />\ntwo<br />\nestablishment of new plants or the played together for<br />\n\"PREPPER\"<br />\ncover the dashes in ten seconds and through for 12 yards. Here Calretiring of the capitalists, the next years. According to the ages subis not a. safe haven for<br />\nBarn<br />\nThe<br />\n2 twenty-two seconds flat. These kins dropped back and threw a<br />\n/<br />\n221<br />\nyear the price would be lowered. mitted, the average age is<br />\nThis was demschoolboys.<br />\ntruant<br />\nrecords still stand. In France, Mr. )eautiful pass to Darley who raced<br />\nGreater efficiency would be ob- years, the oldest being 25; the<br />\nwhen SerThursday,<br />\nlast<br />\ncnstrated<br />\nTootle was aide-de-camp to Gen18 yards for a touchdown. Mar- geant \"Tom.\" Ferris, the vigilant<br />\nobtained and the decrease in oper- youngest, 19.<br />\nCole, and later acting adjutant<br />\nWingo, according to the list, is eral<br />\nhell kicked goal. A few moments police force of Homewood, brought<br />\n-tting expenses would be reflected<br />\nArtillery BriField<br />\n167th<br />\nthe<br />\nof<br />\nfirst<br />\nhis<br />\nlater on a pass from Tickey, Fox to an end the alleged truancy of<br />\nin all business. The books would 25 years old and is playing<br />\nSherburne.<br />\nGeneral<br />\nunder<br />\ngade<br />\ngot away off left end for a 50-yard Harry E. Jackins, Jr., 2731 Marybe open to some representative of year at the game. From all acrun that was the feature of the<br />\nthe public and in this way the peo- counts of his present prowess, he<br />\nAvenue.<br />\nUniversity of West Virginia, game. Captain Totterdale man- land<br />\nple would be protected. Mr. Plumb should be a fair quarter-back by the The<br />\nso the story goes, was a<br />\nHarry,<br />\nwho defeated them 28-7, barely aged to overtake him on Hopkins'<br />\nadvocated that this plan should be time he reaches his senior year.<br />\nat Poly. .Nearly every day<br />\nmanaged to down Virginia 7-0. Ac- 18-yard line and thus ended the student<br />\nworked by all corporations, but<br />\nThe team is well provided with<br />\nweeks, it is said, the boy,<br />\nior<br />\nseven<br />\ncording to this, Hopkins, who Cadets' best effort to score again.<br />\npointed out that individual busi- reserve strength, having three quartrousers, came to<br />\nshort<br />\nearing<br />\nplayed Virginia to a standstill, has On gains by Markell and Bonner,<br />\nness would be stimulated rather terbacks and a half dozen halfHomewood at school time and<br />\nthe edge.<br />\nOrman's machine had spent his time in the Barn until the<br />\nVan<br />\nthan depressed. In this way, he backs of high calibre. On the line,<br />\nreano<br />\nhas<br />\nBlue<br />\nand<br />\nBlack<br />\nThe<br />\nscales<br />\nthe<br />\ntips<br />\nwho<br />\nwhat<br />\nMoore,<br />\nthe ball up to St. John's Poly classes were dismissed. He<br />\nworked<br />\nCaptain<br />\nget<br />\nwould<br />\nclaims, the people<br />\nhowever,<br />\nent,<br />\nover-confid<br />\nfeel<br />\nto<br />\nson<br />\nstar,<br />\nhaving<br />\nthe<br />\nis<br />\nwhen the final whistle ate in the dining room, read the<br />\nbill<br />\nline<br />\npounds,<br />\n10-yard<br />\n205<br />\nthe<br />\nat<br />\nthey are entitled to under<br />\nhavgentlemen,<br />\nSouthern<br />\nthe<br />\nfor<br />\nboth<br />\nseason,<br />\nall<br />\nwork<br />\nthe 1921 Maryland magazines in the club room and<br />\nto<br />\nput a stop<br />\nof rights of the various states, a done brilliant<br />\nand<br />\nlost<br />\ngames<br />\ntheir<br />\nhalf<br />\nwon<br />\ning<br />\nWingo,<br />\ndefensive.<br />\nfootball classic.<br />\nsquare deal for all, no profiteering, offensive and<br />\nmingled with Hopkins students on<br />\neffort to come<br />\nLineup and summary:<br />\nand a chance for every laborer to Hall, Cameron, Mattox and Hamil- half, will exert every<br />\nthe best of terms. It is said that<br />\nof the card.<br />\nJOHN'S<br />\nST.<br />\nenjoy to the full the profits of his ton have done consistent work out on the right side<br />\nHOPKINS<br />\nlie even smoked cigarettes.<br />\nDell<br />\nL.E<br />\nA number of Washington and Middleton<br />\nindustry. Mr. Plumb very kindly throughout the season in the backSergeant Ferris saw Harry, but<br />\nBrown<br />\nL.<br />\nWesterman<br />\nSachs took him for a Hopkins prodigy.<br />\nconsented to answer the questions field. It is probable that numerous Lee alumni will be present at the Magill<br />\nL.G<br />\nFeinberg<br />\nof the audience after his address, substitutions will be made through- game and will give a banquet for Totterdale (c) RCG<br />\n. Beatty Finally, he \"smelled a rat,' as he<br />\nLandy<br />\nthe team thereafter. Having less Knecht<br />\nand some very interesting points out the (Tame.<br />\nAlexander said, and decided to interview the<br />\nR.T<br />\nBanfield (c)<br />\nR.E<br />\ncompetition in other branches of Rich<br />\nintroducing<br />\nIn<br />\nout.<br />\nbrought<br />\nfull<br />\nwere<br />\nHopkins will probably go the<br />\nQB<br />\nFox boy. Several times, he says, Harry<br />\nDarley<br />\nthe speaker, Mr. Fenneman, the four periods without substitution, sport, and the day calling forth the Markell<br />\nF.H<br />\nCashell eluded him by hiding.<br />\nAt last,<br />\nL.H<br />\nAnderson<br />\npresident of the club, in a very able as has been the coach's practice usual number of annual attenders. Bonner<br />\nable<br />\nFerris<br />\nSergeant<br />\nwas<br />\nhowever,<br />\nR.B<br />\nTickey<br />\nCalkins<br />\ntalk, outlined briefly the program whenever possible. Not a substi- a larger crowd than Saturday's is<br />\nhim.<br />\nrefused<br />\nThe<br />\nboy<br />\nquestion<br />\nto<br />\nSubstitutions: St. John's—Bassett<br />\nand purposes of the organization. tution was necessary Saturday and expected.<br />\nfor Anderson, Kirkpatrick for Bassett, to tell his name, but said he was a<br />\nEverstein for Dell, Dell for Beatty,<br />\nno serious injuries resulted. The<br />\nKelso for Kirkpatrick, Smith for Kel- Poly student, and that he was sick.<br />\nfirst team should be in condition<br />\nso, Everstein for Dell. Touchdowns—<br />\nFurther investigation by the \"poJUDGING BY HIS HABITS<br />\nSmith—Did you know that to last the contest, Westerman havMarkell, Darley. Goals from touchVisitor—Does Mr. Crawford, a downs—Calkins, Markell. Goals from lice department\" located the boy's<br />\nScott's education is still in its in- ing apparently recovered sufficientReferee— parents, and Mr. Jackins, Sr., mofield—Markell, Tickey.<br />\nlive here?<br />\nstudent,<br />\nly to operate at tackle.<br />\nfancy?<br />\nCutts, Harvard. Umpire—O'Brien,<br />\nCrawford<br />\nMr.<br />\n,<br />\nLandlady—Well<br />\nPhiladelphia Central High. Head lines- tored to the Barn and carried his<br />\nAccording to the misleading<br />\nHadden—No, why?<br />\nDartmouth. Field judge son home to the friendly shelter of<br />\nman—Hogsett,<br />\na<br />\nwas<br />\nhe<br />\nthought<br />\nI<br />\nbut<br />\nhere,<br />\nlives<br />\nHarbison—Oh, it rests on a method of comparing scores, Hop—Hoban, Dartmouth. Time of quarthe woodshed.<br />\nGoblin.<br />\ne<br />\nwatchman.—Th<br />\nnight<br />\nters-15 minutes.<br />\nkins has the edge on her visitors.<br />\ncrib.—Lampoon.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br /><br />\n5<br /><br />\nMAILBAG<br />\nneed of a musket for \"protection.\"<br />\nCHINESE STUDENTS PUBLISH GREAT INTEREST AT THURSDAY'S THE STUDENT FRIENDSHIP FUND<br />\nMASS<br />\n-MEETING<br />\nMAGAZINE<br />\nThe campaign for the Student<br />\nHuman nature is pretty much<br />\nContinued from page 3<br />\nThe mass-meeting held last Friendship Fund will close officialOriental Graduates Also Members of<br />\nWhen the \"Quakers\" settled in the same all over the world. If you<br />\nThursday in the C. E. Hall was deDisarmament Conference<br />\nly on December 3, when all pledges Pennsylvania they treated the In- treat your neighbor right he will<br />\nFew Hopkins students realize voted almost entirely to prepara- are due. The response to this<br />\ndians justly and did not arm reciprocate, be he Jap or Greek,<br />\nwhen thinking of the men who tion for the celebrations before and<br />\nworthy<br />\nwork<br />\nhas<br />\nbeen<br />\nvery<br />\npoor<br />\nso<br />\nGilson<br />\nagainst them. So Ion.<br />\n- as the white German or Hindu. The same prin6<br />\nhave achieved greatness after after the St. John's game.<br />\nEngel took charge of the meeting far. If there are any students who man did not outrage or threaten ciple applies between nations:<br />\nleaving the University that Hopand<br />\ndescribed the various parts that still desire to subscribe, the Y. M. the Indian, he was far safer<br />\nkins has been developing leaders<br />\nthan gun-toting is as poor a policy for<br />\ngo<br />\nto<br />\nwould<br />\nparade<br />\nmake<br />\nup<br />\nthe<br />\nC. A. will be glad to receive their his cousins in Virginia or Massa- nations as it is for individuals.<br />\nof countries other than the United<br />\nbefore the game. As each sep- subscriptions.<br />\nAll those who have chusetts. The state of peace and<br />\nStates. Especially is the Chinese<br />\nSincerely yours,<br />\nstudent at Hopkins developing arate stunt or part was taken up already pledged are asked to turn<br />\nfriendliness was continuous until<br />\nthe<br />\nman<br />\nwho<br />\nhad<br />\ncharge<br />\nannounced<br />\nRichard R. Taylor.<br />\nPowers that are to make him a<br />\nthe progress he had made in prep- in their contributions by the close a misguided white man felt the<br />\nrace;<br />\nhis<br />\nmen<br />\nof<br />\namong<br />\nleader<br />\nof the campaign.<br />\nand it throws interesting light on aration for it. John Sherwood rebonfire,<br />\nEmil<br />\nSmith<br />\nported<br />\nfor<br />\nthe<br />\nHopkins' standing as a worldfor the band, Buchner for the morenowned seat of learning to reMt. Vernon 4999<br />\n\"Queen Quality\" Home Made<br />\nflect on the number of. young tor-cycle brigade. The coffin to<br />\nparade was on the<br />\nChocolates<br />\nCROSS COUNTRY<br />\nChinese graduates of our Alma be used in the<br />\nand<br />\nwhen<br />\nit<br />\nplatform<br />\nwas<br />\nopened<br />\nVISIT<br />\nOUR<br />\nICE CREAM PARLORS<br />\nMater who have made a name for<br />\nContinued from page 1, col. 2<br />\n518 N. CHARLES ST.<br />\nout.<br />\npopped<br />\nTed<br />\nHuey<br />\nthemselves in the last few years.<br />\nCommercial Photography<br />\nBill Totterdale, Dick Wood and finish well up with the leaders on<br />\nOf course, the average student<br />\nThompson<br />\nJoe<br />\nmade<br />\nshort<br />\ntalks<br />\nCircuit Photography<br />\nat Homewood knows of the<br />\nThanksgiving Day. The other men<br />\nFlash Lights<br />\nViews<br />\nProminent part played by Presi- after Dean Latane had made sev- who will represent Hopkins are<br />\nGroups<br />\nEnlargements<br />\ndent Goodnow in Chinese affairs eral announcements very impor- Milligan, Edwards, Fenton, Seitz,<br />\nCharles and 22nd Sts.<br />\nKODAK FINISHING<br />\nand the equally prominent posi- tant to those concerned. A course<br />\nDelicious<br />\nSodas and Sundaes<br />\nCronin<br />\nand Ginther. Due to the<br />\nThe Best of Candies<br />\ntion held by Professor Willough- cannot be changed or dropped or<br />\n325 N. Howard St.<br />\nfact that they know every inch of<br />\nPrompt &amp; Efficient Service<br />\nby. But does the average student a new course taken by a student<br />\nat Homewood know, for instance, without his first seeing his advisor the course and are competing on<br />\nthat two Hopkins graduates are and then the Dean. Any course home ground, all of these men can<br />\nworking as attaches to the Chines dropped without this procedure will be counted to finish much higher<br />\ndelegation at the Armaments Con- count a failure. Students are not up than they did two weeks ago.<br />\n1 W. University Parkway<br />\nference? Their names are Hsin- allowed to take courses not listed<br />\nST. PAUL &amp; 24th STS.<br />\ncatalogue.<br />\nundergraduate<br />\nin<br />\nthe<br />\nOpposite J. H. U. Athletic Field<br />\nOne<br />\nof<br />\nthe<br />\nmost<br />\ninteresting<br />\nasHai Chang, '19, and Kwang-Lai<br />\nC. D. Wolfe, Prop.<br />\ntrainquestion<br />\nof<br />\nThe<br />\nold<br />\nphysical<br />\nLou, '20. Or does he know that<br />\npects of the race will be the ability<br />\nDRUG STORE for J. H. U. BOYS<br />\nthe President of the Chinese Stu- ing was again brought up and the shown by the Maryland State run- DELICIOUS SODAS &amp; SUNDAES<br />\nMade<br />\nWith<br />\nPHONE, HOMEWOOD 2121<br />\ndents' Alliance, Dr. M. J. Bau, Dean warned those half dozen men ners. They claim they have a man<br />\nJersey Special Ice Cream<br />\nare<br />\nand<br />\ncutting<br />\nwho<br />\nstill<br />\npersist<br />\nin<br />\ntook his Ph.D. degree at this Uni\"The Velvet Finish\"<br />\nwho can beat any man Hopkins puts<br />\nversity in 1921 ; that P. C. Hsieh, insensible to notes in their postKODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\n20, C. E. Lim, D.P.H., '21, T. V. office box. \"All those who do not up but probably they have never<br />\nfor the Boys<br />\nWhitman's Chocolates and Bon Bons<br />\nSze, '21, and S. H. Lin, '21, are see me immediately will be liable heard of Booth and Somerville.<br />\ngeneral manager, assistant to gen- to suspension,\" said Dr. Latane,<br />\neral manager, advertising man- \"and all who have not seen me by<br />\nager and circulation manager, re- Friday at 12.30 will be positively<br />\nspectively, of The Chinese Stu- suspended.\"<br />\nJJP<br />\ndents' Monthly, a magazine devoted to the interests of the 2,500<br />\nFUTURE PROSPECT OF HOPKINS<br />\nChinese students in United States<br />\nATHLETICS<br />\ncolleges and the more than 4,000<br />\nAthletics at Hopkins have a dim<br />\nWho have studied in America and<br />\nand cheerless future unless there is<br />\n1<br />\ngone back to China?<br />\nfrom<br />\nco-operation<br />\nfinancial<br />\nmore<br />\nThe November issue of this<br />\nmagazine is known as the Con- the students, asserted Mr. Theodore<br />\nference Number and should prove Kistler in an interview last week.<br />\na help to a serious study of the Mr. Kistler, besides his familiar<br />\nFar Eastern questions in connec- role of business manager of athlettion with the Conference for the ics, is also a member of the finance<br />\nLimitation of Armaments and the committee of the Homewood Comrecent intercollegiate meeting at pany and, therefore, speaks with authority.<br />\nPrinceton.<br />\nIn this issue there is an article<br />\nHe repeated his statement made<br />\nhY Professor Willoughby entitled before a recent assembly that the<br />\n\"China at the Conference.\"<br />\nminor sports depend for their funds<br />\nTHE TURKISH CIGARETTE<br />\nlargely upon the receipts from the<br />\nfootball games played at Homewood<br />\nSUBJECT CHOSEN FOR SOPH-FRESH<br />\nEvery day MURADS are held<br />\nand the toll from the three home<br />\nDEBATE<br />\nhigher<br />\nin the estimation of the men<br />\ngames which have already been<br />\nThe Freshman and Sophomore<br />\nwho smoke them.<br />\nplayed is less than that of last year's<br />\ndebating committees got together<br />\nthird game.<br />\nThursday and decided that the<br />\nThey are the standard of Taste.<br />\nsubject for the annual Freshman- \"True,\" he said, \"the opponent<br />\nThey never disappoint—never<br />\nSophomore debate would be \"Re- of that game was Virginia, which<br />\nsolved. That a national system of in itself was a big drawing card,<br />\nfail—never change—<br />\ninsurance against unemployment<br />\nbut that by no means excuses the<br />\nShould be adopted in the United<br />\nThey are 100% pure Turkish tolaxity of the student body this<br />\nStates.\" The committees drew<br />\nbacco—ofthe finest varieties grown.<br />\nlots to determine which side of the year.\"<br />\nCIGARteiT\"Tii\"'\"'\":<br />\nIt is from the sale of season ticksubject would be upheld by their<br />\nYou are proud to smoke them<br />\nESPECAALL'i FOR<br />\nrespective classes. The Freshmen<br />\nADE<br />\nEXPERIEVIC<br />\nM<br />\nWi<br />\nARE<br />\nis<br />\nmoney<br />\nin any company—on any occasion.<br />\nets that a great part of the<br />\n111SCRINOMAG OD GAD<br />\n111Gli<br />\ndrew the affirmative. The tryouts,<br />\nSMOKER OF CAGARETTES<br />\nderived, and had the students re.<br />\nA L°A<br />\nIk)Ft105ti<br />\nwhich are to decide who shall<br />\nThey are the largest selling highsponded to the appeal to aid in sellcompose the teams, will be held<br />\n1hebleMVAaril 1114:0,<br />\ngrade<br />\ncigarette in the world.<br />\nIse/Tat-0k<br />\nas soon as Dr. French or one of ing them, it is certain that much of<br />\niiiiii<br />\n--oitoomitiooloovoiiiiiiiolopo§4444<br />\nIns assistants can arrange to hold the present anxiety would have<br />\nThe cigarette smokers<br /><br />\nORTMAN'S<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nThe College Drug Store R.G.by &amp; Company<br /><br />\nMURAD<br /><br />\njIw<br /><br />\nchem. Each team will consist of<br />\ntwo presentation speakers and a<br />\nInan to handle rebuttal. The<br />\nspeakers will be allowed ten minutes each. It is hoped that there<br />\nluaY be a large number of men<br />\nout for the teams, so that the debate may come up to the standard<br />\nset by the lower class contests<br />\n°f the last few years.<br /><br />\nThe fact that the A. A. tickets are<br />\nstrictly nontransferrable should be<br />\nremembered. By the illegal lending<br />\nof these cards, many cash admis-<br /><br />\nsions are lost at every game.<br />\nAsked if he favored the petition<br />\nnow being circulated regarding the<br />\nBarn, Mr. Kistler replied that the<br />\nHomewood Company had several<br />\nAckerman (sentimentally)<br />\nyears ago made an identical suggeswhy did you fall for me?<br />\nSmith—Your line was just low tion, but the sort of reception it<br />\nenough to trip me.—Lampoon.<br />\nreceived is all too evident.<br /><br />\nToni,<br /><br />\nofAmerica<br />\nDO prefer Quality to Quantity.<br /><br />\nbeen avoided.<br /><br />\n\"Judge for Yourself—!\"<br />\n10)))))}3 111)))))))11)<br /><br />\nMOO<br /><br />\n20<br /><br />\n\"fro.,<br /><br />\nIlk II<br /><br />\n&amp;darkish<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 23, 1921<br /><br />\n6<br /><br />\nRIFLE CLUB TO ORGANIZE<br />\nMARYLAND COLLEGES TO<br />\nWithin the next week the Rifle<br />\nGIVE VIEWS ON DISARM(THE BOOK MART)<br />\nAMENT CONFERENCE<br />\nClub will be organized for the_comComplete Stock of<br />\nHopkins.<br />\nat<br />\nDelegates to Assemble<br />\ning season.<br />\nMedical Books and College<br />\nCommittee Appointed to Present<br />\nNew rifles have been -purchased<br />\nRequisites<br />\nMatter.<br />\nfor the use of the club in matches.<br />\nAt a recent meeting of the StuImporters and Dealers in Fine Books<br />\nThese are Winchester .22, bolt acdent Council \"Dick\" Wood, the<br />\n301 N. CHARLES ST.<br />\ntion, Cadwell match rifles. In the<br />\nPresident, appointed a committee<br />\nBaltimore, Md.<br />\nopinion of Captain McMurray, this<br />\nconsisting of H. D. Cotton, chairis the best rifle obtainable for work<br />\nman; Gilson Engel, Randall, Eli<br />\nof this. sort.<br />\nFrank, Jr., and Davidge Rowland<br />\nTwo matches have been arranged<br />\nto arrange for a meeting at Homefor. A challenge from the Yale<br />\nwood, of the representatives from<br />\nrifle team has been accepted for<br />\nthe various colleges of Maryland<br />\na dual meet in January 21st. On<br />\nto give their views on the DisarmFebruary 15th, the intercollegiate<br />\n°A MES H.&amp; OSCAR G.L5\\rf<br />\nament Conference. It is expected<br />\nmatches will be held. Other meets<br />\noWN ERS<br />\nthat this \"Maryland Conference\"<br />\nVeic<br />\nare pending.<br />\nr4PI<br />\nthe resolutions<br />\napprove<br />\neither<br />\nwill<br />\nThe team for these matches will<br />\n29 Baltimore St., East<br />\ndrawn up by the recent Princeton be made up of men selected by comOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE Conference or will draw up a new<br />\npetition. Any man in college is<br />\nFor College Fraternity Bands<br />\nset of resolutions.<br />\n(Greek Letter Societies)<br />\neligible.<br />\nThis action of the Student<br />\nThe Chas. Willms Surgical<br />\nWork on a new range was startInstrument Co.<br />\nCouncil is the direct result of a<br />\ned today on the top floor of Gilman<br />\n300 N. HOWARD ST., Baltimore, Md. letter received recently from the<br />\nHall. There will be at least five<br />\nSURGICAL INSTRUMENTS<br />\nEastern Collegiate Committee for<br />\nMicroscopes and Supplies,<br />\ntargets at a range of fifty feet.<br />\nStethoscopes<br />\nBlood Lancets Limitation of Armament of which<br />\nBlood Counters<br />\nThe Rifle Club will incur an exCharles Denby of Princeton is<br />\npense, this year, of over five hunchairman. At the Princeton Condred dollars. The Athletic CounPrinters of Philological and<br />\nference this committe of ten men cil has not the money to meet this<br />\nMEN'S SHOES<br />\nScientific Works<br />\nLIBERTY ST. at SARATOGA<br />\nthe<br />\nperpetuate<br />\nto<br />\nappointed<br />\nwas<br />\nOf the Better Class<br />\n(Opposite Hotel Rennert)<br />\n23 S. HANOVER ST.<br />\ndeficit and Captain Murray hopes<br />\nmovement inaugurated at this<br />\nBaltimore, Md.<br />\nto make the sum up by popular<br />\nLUNCHEON—:—DINNER<br />\nconference and Gilson Engel was<br />\n11:30 until 7:30<br />\nsubscription. Personal contribuappointed as the representative tions will be welcome, if turned in<br />\nDANCES<br />\nBANQUETS<br />\nSMOKERS<br />\nURNER BROTHERS<br />\nBy Arrangement<br />\nfrom the State of Maryland. The to Mr.<br />\nWilkinson.<br />\n111 E. BALTIMORE STREET<br />\nTelephone St. Paul 6987<br />\nletter suggested that Hopkins<br />\nBALTIMORE<br />\nIf this money is collected no inishould assemble the Maryland col- tiation fee will be charged, thus<br />\nleges with the view of determining<br />\nDo you know how best to provide<br />\nputting this activity within the<br />\nORDERS RECEIVED FOR<br />\nan income for your old age?<br />\nthe attitude of the student bodies<br />\nmeans of each member of the UniS'<br />\nCOGGIN<br />\nConsult with<br />\nof the said colleges toward the versity. The Rifle Club is a recogTransfer and Baggage Express<br />\nW. W. WALKER<br />\nWashington Conference.<br />\n17 E. Baltimore St.<br />\nnized organization and it is up to<br />\nAUTOMOBILE SERVICE<br />\n909 Calvert Bldg. St. Paul 2581<br />\nWhen this opinion is obtained it us to put it over.<br />\nPHONE, HOMEWOOD 2645-W<br />\nExecthe<br />\nto<br />\nforwarded<br />\nbe<br />\nshall<br />\nPrinters of the<br />\nutive Committee. The representaJohns Hopkins News-Letter<br />\ntives of Maryland shall meet the<br />\nrepresentatives of other states. in<br />\nWashington on a specified date<br />\nand present their views to the Disarmament Conference at to what<br />\nthey think will constitute success.<br />\nDecember 3 or January 14 have<br />\nbeen selected as tentative dates<br />\nfor this presentation.<br />\nThe committee appointed has<br />\nalready taken definite action. A<br />\nletter has been sent to the various<br />\nMaryland colleges, including University of Maryland, St. John's,<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS Western Maryland, Mt. St. Mary<br />\nand Washington College, suggesting that the matter be presented<br />\nto the student bodies of said inEN you get out into the medical world, you'll find<br />\nstitutions and that two delegates<br />\n7oung<br />\ndoctors are judged by something more than<br />\nTeach a Lesson in Style<br />\nbe selected to present these views<br />\ndiagnostic ability and knowledge of their subject. The atto the conference at Hopkins. The<br />\nThey possess the \"dash\" that<br />\nmosphere of success plays its part—the evidence that you<br />\nappeals to college men, toned<br />\ncolleges in question have not been<br />\n\"arrived.\" And among the little details that indicate<br />\nhave<br />\ndown to distinctiveness. And<br />\nthat<br />\nbelieved<br />\nthere's the habit of preferring<br />\nis<br />\nsuccess,<br />\nit<br />\nbut<br />\nfrom<br />\nheard<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\nthe conference will be held' some<br />\ntime the latter part of next week.<br />\nN. HESS' SONS<br />\nPlans are already being form8 E. BALTIMORE ST.<br />\nulated for the receiving and the<br />\nentertainment of the delegates. A<br />\nluncheon will be served at the<br />\nHopkins Club and after the luncheon the conference will be called<br />\nMADE TO ORDER<br />\nto order and will proceed to the<br />\nRemember that Melachrino is a masterblend<br />\nAND<br />\nbusiness at hand. For dinner it is<br />\nof the finest Turkish Tobaccos as originated<br />\nout-of-town<br />\nthe<br />\nthat<br />\nexpected<br />\nby Miltiades Melachrino.Egyptian cigarettes<br />\nFINISHED CLOTHES<br />\nare simply those that originated in Egypt.<br />\nrepresentatives will be entertained<br />\nBut the tobacco is what you want to know<br />\nPLAZA BUILDING<br />\nat the Hopkins Club or at the<br />\nabout—and if it's Melachrino— it's right.<br />\nvarious fraternity houses. They<br />\n19 and 21 EAST FAYETTE ST.<br />\nwill probably be quartered at the<br />\nfraternity houses overnight.<br />\nSHOES<br />\nAt the time this copy goes to<br />\nfor<br />\npress the consent of the Dean has<br />\nUNIVERSITY MEN<br />\nnot been obtained, but it is not bethat any difficulty will arise<br />\nlieved<br />\nFor Sport Wear<br />\nFor Dress<br />\nsource. The selection of<br />\nthis<br />\nfrom<br />\nSmart Styles—Best Leathers<br />\nthe representative of<br />\nas<br />\nHopkins<br />\nModerate Prices<br />\nthe colleges of Maryland is a big<br />\nhonor and the coming Maryland<br />\nConference promises to be a big<br />\nthing for Hopkins.<br />\n19 W. LEXINGTON ST.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nIt's time for a<br /><br />\nFALL SUIT<br /><br />\nWe're ready<br />\n$30 up<br /><br />\nCe4eXatterie<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nHess Shoes<br /><br />\nLEMMERT<br /><br />\nIn Medicine<br /><br />\nW-1;1<br /><br />\netachrino<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nWYMAN<br /><br />"}], "field_media_file": [{"target_id": 37559, "display": null, "description": null, "target_type": "file", "target_uuid": "dfb4f872-8de1-4d52-bc4d-c49aa5016027", "url": "http://digital.library.jhu.edu/system/files/2022-03/12969-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12969, "target_type": "node", "target_uuid": "b2c4eae4-7add-43d2-adff-3b549181fc54", "url": "/node/12969"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f1178c4c-6d71-4790-b93d-c57d6d3cbd3b"}]}