{"mid": [{"value": 39330}], "uuid": [{"value": "83924413-e5a5-4286-8802-10149bf73bb4"}], "vid": [{"value": 39330}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:27:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13925-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:27:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:27:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "18Truto rattrr<br />\nVOL. LXXI, NO. 14-<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, MARCH 17, 1967<br />\n<br />\n71ST YEAR<br />\n<br />\nStudents Favor<br />\nHopkins-Goucher Merger<br />\nDraft Deferments Deemed Unlikely At Present<br />\nIn a poll recently conducted those who plan to pursue careers<br />\nA News-Letter investigation \"highly rated\" music and fine<br />\nThe major purpose of this and<br />\nby the News-Letter on the Selec- in critical areas should be de- has revealed that recent rumors arts programs of Goucher would future<br />\ndiscussions are to explore<br />\ntive Service System, a significant ferred for post-graduate work. concerning an increase in the de- improve \"two areas in which methods for greater<br />\ncooperation<br />\nmajority of these students re- Surprisingly, Ys of the respond- gree of academic exchanges be- Hopkins could stand strengthen- between the two schools.<br />\nThe<br />\nsponding (550) voted for the ents said that no college grad- tween Hopkins and Goucher Col- ing.\" Goucher. he added, offers Baltimore Sun article completely<br />\nMaintenance of the present sys- uate should have to enter the lege are exaggerated.<br />\na full major in Russian \"while misinterpreted their significance<br />\ntem of student deferments.<br />\nGoucher President Otto the Hopkins program is limited.\" and mistakenly compared this<br />\nservices.<br />\n57% of the students answering<br />\nKraushaar, in a recent Baltimore<br />\nmeeting with the recently publiNon-Military Service Supported<br />\nMeeting Only Preliminary<br />\nthe poll felt that deferments<br />\nSun article, offered what he concized Yale-Vassar negotiations.<br />\nstudents<br />\nnumber<br />\nof<br />\nlarge<br />\nA<br />\nA single meeting has been held<br />\nshould be awarded to all students<br />\nsidered to be substantial reasons<br />\nNo Merger Planned<br />\ncollege sturegardless of university status. favored the option of<br />\nfor the increased need for co- between Dr. Milton Eisenhower,<br />\nThe Sun article stated that Dr.<br />\nmilitary<br />\ntheir<br />\nfulfilling<br />\ndents<br />\nOnly 18% desired the abolition<br />\nbetween the two President of Hopkins. and Dr. Kraushaar foresaw \"a<br />\noperation<br />\nsharing<br />\nOf across-the-board deferments. obligation through such organi- schools. The article cited the fact Otto Kraushaar, President of arrangement<br />\nnot unlike that<br />\nzations as the Peace Corps, that Hopkins is strong in the Goucher. This meeting was conStudents Favor Deferments<br />\nVISTA or the National Teacher sciences, while Goucher offers sidered very preliminary, with no contemplated by Yale University<br />\nIn regard to the awarding of<br />\nCorps. 73% voted for such a non- certain science courses that Hop- constructive programs or policies and Vassar College.\" Dr. KrauUndergraduate deferments, only<br />\nshaar was unavailable for comkins does not. He felt that the being formulated.<br />\n(Continued on Page 6)<br />\n44% voted for a deferment rement on this point.<br />\ngardless of class rank or achieveHopkins officials have emphament on the student selective<br />\nsized that there is no plan to<br />\nservice exam.<br />\nmerge the University and GouchOf those who felt that some<br />\ner College, and that any action<br />\nSort of criteria should be used in<br />\ntaken as a result of the present<br />\nthe deferment of college students,<br />\n1<br />\n2 million miles of the until the particles are small meetings would not change the<br />\nStudies by a Hopkins astro- within 2/<br />\nthere was an even split between<br />\nenough to be blown out of the status quo.<br />\nphysicist have resulted in the dis- sun.<br />\nthose favoring the use of class<br />\nRing Position<br />\nsolar system by radiation presa<br />\nbe<br />\nto<br />\nappears<br />\nwhat<br />\nHandholding in Library<br />\nrank as criteria and those voting covery of<br />\nThe halos, each estimated to be sure from the sun.<br />\nIOU the continued use of the se- series of, at least, four concentric about 100,000 miles thick; are<br />\nDr.<br />\nKraushaar emphasized that,<br />\nThis theory also implies that<br />\naective service exam as the basis dust-free rings, or halos, around spaced at irregular distances<br />\nhe was against a merger. He felt<br />\nonly<br />\nbodies<br />\nthat<br />\nare<br />\nof<br />\nthe<br />\norder<br />\nof deferment.<br />\nthe sun.<br />\nthat co-educational institutions<br />\nfrom the sun.<br />\nof several yards thick can be as<br />\nare endangered by the threat of<br />\nThe innermost-and hottest- old<br />\nFavor Johnson's Proposal<br />\nThe finding was made by Roas the solar system.<br />\nromance to education. \"Hand<br />\nPresident Johnson's recent bert H. MacQueen, a 29 year-old halo found thus far is located<br />\n1<br />\n2 million miles from the 4. The MacQueen experiment holding in the library,\" he obproposal that 19 year olds be postgraduate student at Hopkins, about 1/<br />\ndrafted first received support and has created great excitement sun. The outer-most, and coolest might indicate how the Poynting- served, impeded the major purfrom '70% of those responding. among solar physicists.<br />\nof the four halos, is located about Robertson effect works in prac- pose of the institution of higher<br />\ntice. Presumably various dust education.<br />\nWith the institution of such a<br />\n4<br />\nmillion miles from the sun.<br />\nSome solar experts are speThe tremendous number of difparticles containing some chemsystem, and the automatic defer- culating that some of the \"rings<br />\nInfra-Red Studies<br />\nment of all full-time college stuicals would vaporize at distances ferences between the two schools<br />\naround the sun\" detected by MacThe discovery of the rings was greater from the sun than dust has always loomed as a barrier<br />\ndents the Problem of whether or<br />\nQueen might be from the vapor- made during infra-red studies of<br />\nto really close cooperation. Adnot college students would ever<br />\nparticles of metallic iron.<br />\nization of debris carried into the the solar corona from a campmission standards for entering<br />\nserve was presented.<br />\nsystem by the Ikeya-Seki site atop a 13,000-foot-high mounThe experiments were carried freshmen and faculty require48% felt that college graduates solar<br />\nComet.<br />\ntain in the jungles of Bolivia dur- out as part of a program of the ments stand as the principal difshould have the option of furThat comet, named after the ing the eclipse of the sun, Novem- Hopkins Astrophysics and Physi- ferences.<br />\nthering their education or enlistThe Goucher Weekly in an aring. And should they do neither, two Japanese amateur astronom- ber 12.<br />\ncal Meteorology Department. Dr.<br />\nticle on the possibility of an<br />\nInfra-red studies made during John H. Strong is head<br />\nthey would be subject to the ers who discovered it, was visible<br />\nof<br />\nthat alliance, pointed out<br />\nthat Goucndraft. Only 12% supported the in the Baltimore area during Oc- the 21-mile-high flight of an un- department. Funds for<br />\nthe ex- er had closer ties<br />\nto the local<br />\nPresident's proposal that only tober of 1965 when it swept to manned balloon confirmed the periment were granted<br />\nby the community; while<br />\n\"Hopkins, on<br />\nrings' existence. The balloon was National Aeronautics and<br />\nSpace<br />\nlaunched January 12 from Pales- Administration. Two Hopkins the other hand, would rather be<br />\nbig with the State and Defense<br />\ntine, Texas.<br />\nstaff men, William Dalton and Departments of the<br />\nFederal GovDuring these two experiments, Donald McLeod,<br />\naccompanied ernment, ignoring the local Bab.<br />\nMacQueen said, infra-red equip- MacQueen to<br />\nBolivia.<br />\ntimore community.\"<br />\nment detected evidence of four<br />\n\"vaporization rings around the<br />\nsun.\"<br />\nMaybe Others<br />\nMacQueen<br />\nsuspects that there<br />\nStudents<br />\ndormitories<br />\neither<br />\nthe<br />\nwould be<br />\nThe Johns Hopkins<br />\nmay be other dust-free rings in<br />\nfor a Democratic Society released psychologically or emotionally<br />\nthe sun's corona which is now<br />\na report on March 15 calling for disadvantageous. The SDS proUniversity<br />\nposals<br />\nwould only require incom- thought to extend at least as far<br />\nthe abolition of the<br />\nas the earth's orbit—some 93<br />\nrequirement for freshmen to live ing freshmen to live in the dormillion miles from the sun. CurBy BRUCE DRAKE<br />\ndesire of a white pastor to build<br />\nin the dormitories. SDS sub- mitories during Orientation Week<br />\nrently, however, he has no idea<br />\nHopkins<br />\nwas the subject of a bridges between his all-white<br />\nstudent<br />\nthem<br />\nallow<br />\nother<br />\nmeet<br />\nto<br />\nreport<br />\nto<br />\nto<br />\nmitted the<br />\nhow such rings might be de- harsh attack in the<br />\ndiscnssions congregation and the Negro<br />\nleaders and Administration of- freshmen.<br />\ntected.<br />\nfollowing the showing of two community. The action centered<br />\nficials, including Dr. Eisenhower.<br />\nThere are many reasons why films dealing with the Negro on a militant black barber<br />\nThe Student Survey<br />\nThe report emphasized two<br />\nMacQueen's discovery has ex- crisis—A Time for Burning, and arguing with an uncommitted<br />\n139 dormitory residents replied cited<br />\nmain points: that students have<br />\nsolar physicists:<br />\nwhite who is eventually \"con,5/<br />\n1<br />\n2—Reflection of an Age.<br />\nthe right to influence University to the survey distributed the<br />\nThe participants Dr. Harris verted.\"<br />\nReasons<br />\nFor<br />\nExcitement<br />\npolicy, and that the University's week of March 6. While 65%<br />\n5V2 concerned a young boy,<br />\n1. It sheds new information on Chaiklin, Walter Carter, Rev.<br />\nrequirements are an infringe- felt that the dormitories had<br />\nthe distribution of \"matter\" in Robert Meisner, and Rev. Frank from a happy, middle-class<br />\nvalue<br />\nteaching<br />\nin<br />\none<br />\nto<br />\nlive<br />\nwith<br />\nment of the student's freedom of<br />\nwhat was until recently thought Williams criticized Hopkins for home, who faces the differences<br />\nchoice. The report's conclusions others, 53% stated that the overnot taking an active part in caused by his color. Walter<br />\nto<br />\nbe empty space.<br />\nwere based on interviews with all effects of the dorms were<br />\nbettering<br />\nsocial and racial re- Carter, a Baltimore social work2.<br />\nThe observed data suggests<br />\nthreeDean Shaffer, Dr. Desoto of So- disadvantageous. Over<br />\nlations.<br />\nIt<br />\nwas also observed that er, however, felt that the film's<br />\nthat<br />\nall<br />\nof<br />\nthe<br />\nsix<br />\nto<br />\neight<br />\nlaboricial Psychology, Dr. Stinchoombe quarters of the students in- ously<br />\nBaltimore<br />\nhad hosted no sub- failing was due to the fact that<br />\ncalculated<br />\ntheoretical<br />\nof Sociology, and a survey of dicated. that the dorm atmos- models<br />\nstantial<br />\ncivil<br />\nrights movement. the boy was atypical of the<br />\nof \"thermal emission<br />\nphere was depressing and 59%<br />\ndormitory students.<br />\nSome<br />\nfelt that Hopkins, as a Negro community since he came<br />\nfelt their social life was re- characteristics of the sun's<br />\nleading institution, had a duty to from a middle-class family.<br />\nShaffer Defends Policy<br />\nhave<br />\ncorona\"<br />\nwill<br />\nto<br />\nbe<br />\nrevised.<br />\nstricted.<br />\nMeisner Analyses Reasons<br />\n3. The MacQueen experiments meet such challenges.<br />\nWhile conceding that there is<br />\nAnother guest, Irev. Robert<br />\na \"psychological advantage\" in If a choice was given, 48% in- offer observational verification<br />\nHopkins Criticized<br />\nmaking one's own choice, Dr. dicated that they would have of what is called the \"PoyntingBoth the Administration and Meisner, who is currently tryShaffer felt that the requirement lived off-campus. About three- Robertson\" theory of solar phy- the student body were scored. ing to integrate an all-white<br />\noffered a \"decided advantage in quarters of those who replied sics, named after John H. Poyn- The University was charged with church here, suggested two reathe introduction of boys to an claimed that they could have ting and H. P. Robertson—two only taking action when pressure sons underlying the Negro<br />\ncrisis; that white people do not<br />\nacademic scene.\" Dr. Stinch- lived off-campus without detract- British physicists,<br />\nwas placed. Others observed that<br />\ntry to know Negroes personally,<br />\ncotnbe and Dr. DeSoto disagreed ing from academic performance<br />\nPredicts<br />\nShrinkage<br />\nthe<br />\nHopkins<br />\ntook<br />\nstudent<br />\nbody<br />\nand that the distinctions of soon the alleged sociological and or having any adjustment probIt predicts that as particles little interest in these affairs outpsychological benefits of the lems. 58% believed that the re- of dust, presumably brought into side of the tutoring project now cial class aggravate the problems<br />\nquirement<br />\nshould<br />\nof race.<br />\nbe<br />\nabolished.<br />\ndorms.<br />\nthe solar system by comets or operating.<br />\nDr. Harris Chaiklin is from<br />\nA major SDS contention was<br />\nA limited number of the SDS meteors, spiral toward the sun<br />\nA Time for Burning, filmed on the University of Maryland. and<br />\nthat the policy discriminated report will be made available to the particles will gradually<br />\nthe spot while the action was Rev. Frank William is of the Itsagainst the minority for whom students today.<br />\nshrink in size due to heating happening, originated with the<br />\nterdenominational Alliance.<br />\n<br />\nSolar Rings Detected<br />\n<br />\nS. D. S. Challenges<br />\nBinding Dorm Rule<br />\n<br />\nHopkins Scored<br />\nFor Race Attitude<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH t7, 1967<br />\n<br />\nNEWS -LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\n11 SA C ilmbines<br />\n[ Fun Nith Films<br />\n<br />\nCAMPUS NOTES<br />\nHill is an expert on the history<br />\nSC Elections<br />\nand sociology of American rePetitions for the Student<br />\nAt 8:30 p.m. tomorrow night<br />\nCouncil Presidential Elections<br />\nShe JHU Concert Band under ligious thought and indigenous<br />\nwill be available on April 3 and<br />\nthe direction of Conrad \"Gebby\" American religious bodies.<br />\n4 at the SAC office from noon<br />\nGebelin will present its 1967<br />\ntill one. They will be due back<br />\nSpring Concert in Shriver Hall.<br />\nOrientation Chairman at<br />\nthe office by one o'clock on<br />\nWhere will be no admission fee.<br />\nAny Sophomore or Junior April 7. Two elections will take<br />\nFeatured in the concert will be wishing to serve as the Orienta- place on April 13 and 14.<br />\nthe first public performance of a tion Chairman for 1967, please<br />\nnew concert march, Homewood, contact Bill Reinsch by note Discount Books Available<br />\ncomposed by \"Gebby\" and dedi- (Box 1190). Include your name,<br />\nThe Student Council Discount<br />\ncated to Dr. W. Kelso Morrill, re- box number, and telephone cards and booklets for the<br />\nthing Dean of Students on the number.<br />\nWashington, D.C. area are now<br />\nHomewood Campus.<br />\non sale for 25 cents. They can<br />\nSA Film Series<br />\nbe purchased from Student<br />\nFreshman Jay Brown will be<br />\ncoronet soloist in Bugler's HoliSunday night the SA .film Council Representatives, dorm<br />\nday.<br />\nseries will present \"Mary's Day\". presidents, fraternity presidents,<br />\nThe film, made by Sister Mary and at Levering Hall from<br />\nReligion Discuss;On<br />\nCorita, and Baylis Glascock, de- 11:30 to 1 P.M.<br />\nThe offer is open to both gradDr. Samuel Hill, Chairman of picts the celebration of Mary's<br />\nthe Department of Religion, Day in California. Dr. Wickwire uate and undergraduate stuUniversity of North Carolina, has said that \"It's a swinging dents. Included are discounts<br />\nwill discuss \"Ferment in Con- film,\" and added that it con- ranging from ten to twenty-five<br />\ntemporary Religious Life,\" March trasted the Beatles to the Gre- per cent on such items as liquor,<br />\nmovie tickets, food, records and<br />\n22 at 4 p.m. in Levering Hall. Dr. gorian Chant.<br />\n<br />\nBond Concert<br />\n<br />\ngasoline, as well as special<br />\ncoupons that entitle the bearer<br />\nto free meals at some of Washington's better restaurants.<br />\nThis bargain is meant as an<br />\nintroduction to the discount program that will be available to<br />\nHopkins students in the Fall.<br />\n<br />\nThe SA will sponsor a moviemixer tonight with the prize<br />\nwinning films from the Maryland Institute of Art's student<br />\nart festival. The movies will start<br />\nat '7:30 p.m. and the mixer at<br />\n9 p.m.<br />\n<br />\nAdmission to the mixer will<br />\nbe free to SA members and girls<br />\nThe Fifth Annual High School with<br />\ncollege IDs. Others will be<br />\nDebate Tournament sponsored<br />\ncharged fifty cents. The movies<br />\nby the Johns Hopkins University will<br />\nbe free.<br />\nwill be held on March 18 at<br />\nAvant-Garde Films<br />\nLevering Hall from 9' am to 5<br />\nThe films will be: 1) Last<br />\np.m.<br />\nIt will be the largest tourna- Thursday Night by John Strickment in Hopkins' history, with ler of New York University. a<br />\nforty-four schools represented motorcycle romp through New<br />\nfrom Pennsylvania, Maryland, York City and the first prize<br />\nVirginia, and the District of Co- winner in the 16 mm category;<br />\nlumbia. The topic of debate will Chantilly Lace by Jean Dellan,<br />\nbe. Resolved: \"That the foreign a hand drawn animated filni!<br />\naid program of the United States creating image patterns and secshould be limited to non-military ond place in 16 mm; Pretty Face<br />\nwith live shots and photos creatassistance..\"<br />\ning a collage of a woman's face;<br />\nMM by Robert Farquharson, a<br />\nfilm dedicated to Marilyn Monroe; all from Rhode Island Institute; Images front Space by<br />\nDale McKinney. Professor ot<br />\nArt, Oklahoma State University,<br />\nImages for space symbolizing the<br />\nlife and death of a planet and<br />\nfirst prize winner in 8 mm; and<br />\nassorted shorts.<br />\n<br />\nDebate Tournament<br />\n<br />\nIf Mexico and Bermuda send you,<br />\n<br />\nwe'll send you posters of Mexico and Bermuda.<br />\n3 for $1.50.<br />\nThe diver of Acapulco. The torero of Mexico.<br />\nThe sleek racing craft of Bermuda.<br />\nAll three 30\" x 40\" posters are beautifully<br />\nreproduced in color. And they're all yours for<br />\nonly $1.50.<br />\nWe think you'll like them so much, you'll<br />\n<br />\n\"GRANTED THE PROPRIETY of CIA activity in the field of international student affairs,it might still have seemed<br />\nto the public and to Congress, if the<br />\n, facts had been openly before them,<br />\nMat some other campus organizations<br />\nbesides NSA should have shared in<br />\nthe largesse,and that among the young<br />\nLochinvars sent to do battle in the international conclaves a few hard antiCommunists and even an occasional<br />\nenthusiastic proAmerican might<br />\nFor a free copy of tho<br />\ncurrent issue of NA.<br />\nhave been inTIONAL<br />\nREVIEW, write<br />\ncluded.\"<br />\nto Dept. CP-1, 150 E.<br />\n35 St., N. Y. 16, N.Y.<br />\n<br />\nwant to go to Mexico and Bermuda some day.<br />\nAnd when you do, we hope you'll go on<br />\nEastern.<br />\nSo don't just sit there staring at four blank<br />\nwalls. Fill in the coupon below and send for<br />\nyour colorful posters now.<br />\n<br />\nCOMING TO<br />\nNEW YORK?<br />\n<br />\nEASTERN<br />\nWe want everyone to fly.<br />\n<br />\n1 .<br />\n<br />\n835<br />\n<br />\nTo: Eastern Airlines, Inc., Poster Offer, Box 4211, Grand Central Station, New York, N.Y. 10017<br />\nPlease send me the Bermuda, Acapulco, and Mexico posters, for which I enclose a $1.50 money<br />\norder or check (payable to Eastern Air Lines, Inc. Poster Offer).<br />\nMARE WILLIAM SLOANE HOUSE YMCA<br />\nYOUR HEADQUARTERS IN N.Y.C.<br />\n<br />\nAddress<br />\nCity<br />\n<br />\nState<br />\n<br />\nI would also be interested in receiving a Youth Fare Applic‘6on.<br />\n<br />\nCode<br />\n<br />\nREASONABLE • COMFORTABLE • CONVENIENT<br />\nSave money. Go further. Stay<br />\nlonger. The William Sloane House<br />\nYMCA has 1491 rooms available<br />\nto men, women and groups, sensibly priced at $3.15-$4.60 single;<br />\n$5.00-$5.20 double. Rates include<br />\nYMCA membership. Enjoy conven•<br />\nient transportation to everything.<br />\nCoffee Shop • Cafeteria • Laundry<br />\nBarber Shop • Check Room<br />\nTailor • Sightseeing • TV Room<br />\nInformation<br />\nREQUEST BOOK LET<br />\n<br />\nE3<br />\n<br />\n354 WEST 34th ST<br />\nNEW YORK. Mr.1000L<br />\nOX 55133<br />\nON 34th STREET 1 BLOCK FROM<br />\nPENN STATION<br />\n<br />\nWILLIAM<br />\nSLOANE<br />\nHOUSE<br />\nYMCA<br />\nNOW COED<br />\n<br />\nJOHN P. NUGENT, JR.<br />\nLife & Health<br />\nInsurance<br />\nCompare<br />\n<br />\n243-7961<br />\nWe need your bead In our<br />\nbusiness<br />\n<br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie'.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nNEWS -LETTER<br />\n<br />\nPAGE THREE<br />\n<br />\nHopkins'QuestFor Culture;<br />\nLinkletter ToSpeak in April<br />\nBy STEPHEN SHRIVER<br />\nArt Linkletter. the renowned<br />\nradio and television personality,<br />\nWill speak here on April 4th as<br />\npart of his continuing \"dialogue\"<br />\nwith American college students.<br />\nLinkletter will appear at Shriver<br />\nHall at 4 p.m. under the sponsorship of the Hopkins Student As-,<br />\n<br />\nsociation.<br />\nThe topic of his talk, to be<br />\nfollowed by a question-and-answer session, will be \"The Entertainer And Politics.\" It will be<br />\nopen to all students and the public without admission.<br />\nLinkletter Tour<br />\nLinkletter is touring the na-<br />\n<br />\nSex Talk To Come<br />\nDr. Graham B. BlaMe, Chief<br />\nof Psychiatry, Health Service,<br />\nHarvard University, will speak<br />\non \"Stress and Distress in College\" this afternoon in Levering<br />\nHall at 4 p.m. The lecture is<br />\nsponsored by the Student Association.<br />\nDr. Blaine will stress sex behavior, identity formation, and<br />\nindependence vs. dependence in<br />\nhis address. He will have an informal dinner discussion afterwards with members of the administration, faculty, and clergy<br />\nconcerning the responsibility of<br />\nthe University and the Church<br />\nto the college student.<br />\nExpert in Student Behavior<br />\nThe psychiatrist, an expert in<br />\n<br />\nthe field of student behavior, has<br />\nrecently published articles on<br />\n\"College Students and Moral<br />\nValues\", \"Motivation and Attitudes of Youth\", and \"Emotional<br />\nProblems of the Students.\"<br />\nBlaine took his M.D. from Columbia College of Psychiatrists<br />\nand Surgeons in 1943 after attending Harvard as an undergraduate. He is a member of the<br />\nNew York Academy of Medicine.<br />\nChairman of the Professional<br />\nPolicy Board, the Academy of<br />\nReligion and Mental Health, a<br />\nmember of the American Psychiatry Association and the<br />\nMental Hygiene Committee of<br />\nthe American College Health Association.<br />\n<br />\nSUMMER COUNSELORS<br />\n<br />\nSENIOR LIFE GUARDS<br />\n<br />\nFOR WESTERN Y.M.C.A.<br />\n<br />\nNeeded at Western Y.M.C.A.<br />\nSat. from 9 A.M. to 4 P.M.<br />\nApril, May and June.<br />\nContact:<br />\nMr. Kaufman, Room 108, Md.<br />\n<br />\nContact:<br />\nMr. KAUFMAN, Room 108<br />\nMaryland Hall<br />\n<br />\ntion's colleges wider the auspices<br />\nof the Royal Crown (Cola) University Series. The series is described as \"Art Linkletter and<br />\nthe American Student: A Dialogue.\"<br />\nThe \"free-wheeling\" questionand-answer sessions provide the<br />\ngist for the \"dialogue.\" Mr. Linkletter finds these both challenging and heartening.<br />\nThe 1962 \"Grandfather of the<br />\nYear\" (he is responsible for five)<br />\nis an expert speaker. For twenty<br />\nyears he has regularly moved millions through such formidable<br />\nprograms as \"People Are Funny\"<br />\nand \"Art Linkletter's House<br />\nParty.\"<br />\nHe is also a political activist. A<br />\nstaunch defender of the actor's<br />\nright to turn politician, he<br />\nstresses the importance of television in \"making\" a politician.<br />\nUnafraid to express his political<br />\nopinions, Mr. Linkletter is also<br />\nwell suited to follow his tubeteasers, Lightfoot Murphy and<br />\nTough Ronnie. into the political<br />\nHouse Party.<br />\nBiC Medium Point 194<br />\n<br />\nif she doesn't give it to you...<br />\n—get it yourself!<br />\n<br />\nA WEEK<br />\nOR MORE<br />\nTHIS SUMMER* WITH<br />\n<br />\nINC Fine Point as.<br />\n<br />\nJADE E45t,<br />\n.•<br />\n<br />\n•<br />\n<br />\nJr E' EAST<br />\n\"<br />\n<br />\nCologne. see.. 64.50<br />\nAfter Share.6 or, $3.50<br />\nDeodorant Stick. $1.75<br />\nBuddha Cologne Gift Package, 12 oz.,$430<br />\nSpray Cologne. $3.50<br />\nBuddha Soap Gift Set, $4.00<br />\nCologne,4 oz.. $3.00<br />\n—<br />\nAfter Shave.4 oz., $2.50<br />\nSWANK, NEW YORK - 30LE DISTRMOTOR<br />\n<br />\nDespite<br />\nfiendish torture<br />\ndynamic BIC Duo<br />\nwrites first time,<br />\nevery time!<br />\n<br />\n2<br />\n<br />\nGood Humor<br />\n<br />\ntuc's rugged pair of<br />\nstick pens wins again<br />\nin unending war<br />\nagainst ball-point<br />\nskip, clog and smear.<br />\nDespite horrible<br />\npunishment by mad<br />\nscientists, Bic still<br />\nwrites first time, every<br />\ntime. And no wonder.<br />\nBies \"Dyamite\" Ball<br />\nis the hardest metal<br />\nmade, encased in a<br />\nsolid brass nose cone.<br />\nWill not skip, clog<br />\nor smear no matter<br />\nwhat devilish abuse<br />\nis devised for them<br />\nby sadistic students.<br />\nGet the dynamic<br />\nSIC Duo at your<br />\ncampus store now.<br />\n<br />\n,<br />\n<br />\nThese Colleges<br />\nHad Students<br />\nWith Even<br />\nHigher Earnings:<br />\n<br />\nSW'<br />\nS<br />\n<br />\n•<br />\n5:<br />\n:<br />\n:0<br />\n4 14<br />\n53C<br />\nj:<br />\n..vs<br />\n:::<br />\n16<br />\ns:::::$144:141::::1:<br />\nto.••‘‘‘<br />\n<br />\nN. Of. 16%1<br />\n4144<br />\n<br />\n-uretr<br />\n<br />\nCot,ect::::: sr*: c-0,<br />\nE ssry**4 162 5:GAN<br />\nla .:<br />\nsee<br />\n;.•<br />\n<br />\n000641 OC<br />\nbi<br />\n<br />\nU I y of<br />\n- f701051<br />\nsui_fp,<br />\nst.<br />\n10 $14\"i<br />\n:<br />\n.<br />\n5083<br />\n\"<br />\nscis o<br />\nC 4<br />\n07<br />\n31<br />\nCU<br />\n1G% $.9.1\"<br />\n.<br />\nSfrUtil:<br />\n:<br />\n\"<br />\n40\"<br />\nUIN<br />\nIII: (<br />\n:1<br />\nt .<br />\n64<br />\n2.2$114671\":<br />\nil:<br />\nlb:<br />\nC1'<br />\n.<br />\n<br />\n.<br />\n•<br />\n00.0„4. ot • cc,c -s<br />\nt<br />\n040._<br />\n,<br />\n10<br />\nu'e\" 0 co<br />\n<br />\nfrf-r<br />\n4.1;c<br />\n<br />\n.<br />\nPots<br />\n<br />\n'QM%<br />\n<br />\ncot<br />\nJOHN'S ViviveRsirY-$1574111<br />\n<br />\n5 LOYOLA UMW. ItkicAC01::.741103-46,<br />\nca<br />\n<br />\n\"cikl:i:4‘.°Li‘fikC'°4<br />\n<br />\nt<br />\npo 4<br />\n$1012 • •-• g,34<br />\n%UMW.:1151.35 •<br />\nImitytims- $2111 II • $N11.14<br />\nOf<br />\nUkiv.<br />\n\"<br />\nfer<br />\nwinvot6<br />\ns1<br />\n::::4c4;°* ref. 61. 1167<br />\n41::<br />\n<br />\nNo experience needed. You are<br />\nfully trained and work on routes<br />\nwith proven high earnings.<br />\n<br />\nh.i.s. classic corduroy<br />\ncampus casual sport coat<br />\nIn the new bronze or<br />\nwhiskey shades.<br />\n22.95<br />\n<br />\nNothing to invest ... everything you need is supplied free.<br />\n<br />\nHOW TO QUALIFY FOR INTERVIEW<br />\n1. Minimum age 18.<br />\n2. Need a valid driver's license and be willing to drive a<br />\nclutch transmission.<br />\n3. Be in good physical condition.<br />\n<br />\nCHARGE YOURS!<br />\n<br />\nREGISTER NOW<br />\nAsk your Summer Placement Director or Student Aid Officer<br />\nto show you Good Humor's folder explaining this high paying<br />\njob and to schedule you for our campus visit.<br />\n<br />\n•<br />\n<br />\nopen thurs., fri., & sat.'<br />\ntil 9<br />\n-<br />\n<br />\ntt/Z:v* c'r Ft<br />\n:•••<br />\n<br />\n,00f•<br />\n<br />\ntadei<br />\n<br />\nMEN'S WEAR<br />\n516 S. Broadway<br />\n<br />\ntirr .11<br />\n/<br />\n4<br />\n<br />\ntrn<br />\nr W<br />\n<br />\nWATERMAN-SIC PEN CORP.<br />\nMILFORD. COWS<br />\n<br />\nhen's<br />\n<br />\n.<br />\n:<br />\n:11.:<br />\n1:<br />\n1.3t:::<br />\n::<br />\n,;<br />\n°<br />\n1<br />\nv<br />\n:1<br />\n:<br />\n4<br />\n!<br />\n115.<br />\n;<br />\nE<br />\nrt<br />\n,rs.t. :<br />\n13* .3<br />\n4114<br />\n1<br />\n.1*<br />\n,:-•<br />\n';\":<br />\n,<br />\n1.4:<br />\n0‘:<br />\n4.<br />\n....<br />\n;<br />\n1-1<br />\n•<br />\n°<br />\n:i<br />\n<br />\n,<br />\n<br />\nAvailable at<br />\n<br />\nI<br />\n<br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\n1<br />\nGILMAN HALL<br />\n<br />\n*Earnings for females have not approximated this average in most<br />\ncases<br />\ndue to legal restrictions on working hours for women.<br />\nAn Equal Opportunity Employer-(M/F)<br />\n<br />\n\fPAGE FOUR<br />\n<br />\nSweetie Pie<br />\n<br />\n01le 31ollus inpkiiis Nem-triter<br />\nEditors-in-Chief<br />\nRoger C. Toll<br />\nPeter J. Koper<br />\nTHE BOARD OF CONTROL<br />\nManagers<br />\nBusiness<br />\nJames N. Franke<br />\nDavid S. Cooper<br />\nExecutive Editor<br />\nManaging Editor<br />\nM. Hocherma.n<br />\nHenry<br />\nJoseph A. Weinberg<br />\nAssociate Editors<br />\nMichael J. Phillips<br />\nLuchow<br />\nP.<br />\nJed<br />\nElla J. Katz<br />\nSports Editor<br />\nFeatures Editor<br />\nNews Editor<br />\nJames C. Sloan<br />\nMurray J. Rudnick<br />\nDavid A. Schneiderman<br />\nng Editor<br />\nContributi<br />\nCopy Editor<br />\nNeil A. Grauer<br />\nDennis A. Estis<br />\nPhotography Editor<br />\nRichard Hammond<br />\nAssociate Staff<br />\nChief<br />\nJohn Thornton_ . •<br />\nGerald<br />\nReporters<br />\nDrake, William Patten. Howard<br />\nNews: Michael Abrams, James Davis, Bruce<br />\nBond.<br />\nR. Clarke: Features: Kenneth W. Jeff<br />\nGraeme<br />\nShriver,<br />\nStevens, Stephen<br />\nBaron Wormser: Sports:<br />\nSeth Feldrnap, Ron Teeter, Doug Wanken,<br />\nPeter Harnik, Menacham<br />\nLauren, Steve Putnarni Steve 01love; Copy:<br />\nRosensaft.<br />\n<br />\nEnjoy, Enjoy<br />\ncome to our<br />\nWe are the new News-Letter staff. We<br />\ns concepts<br />\npositions knowing the existence of nebulou<br />\nvity\" and \"good<br />\nsuch as \"responsibility\" and \"objecti<br />\nconcepts.<br />\ntaste.\" We will not attempt to define these<br />\nbe the \"rewill<br />\nRather, our collective consciences<br />\nwill be the<br />\nsponsibility\" we carry, our existential virtue<br />\nwill be<br />\ning<br />\n\"objectivity\" we perceive, and our upbring<br />\nthe \"good taste\" we employ.<br />\nMacDonald's<br />\nWe will adhere to the spirit of Dwight<br />\nis done by<br />\nthat<br />\n-writing<br />\nism<br />\njournal<br />\ndefinition of amateur<br />\nents. We will<br />\ntemperm<br />\nsimilar<br />\nwith<br />\npeople<br />\nfor<br />\npeople<br />\nit should be<br />\nserve our community in the way we think<br />\nserved.<br />\npolitics.<br />\nWe have no policy and indulge little in<br />\nand ince,<br />\nignoran<br />\ne,<br />\ninjustic<br />\nat<br />\nd<br />\nWe will be outrage<br />\nmotto,<br />\nty<br />\nUniversi<br />\nflexibility. Because we subscribe to the<br />\ns—<br />\nhappen<br />\nwhat<br />\nprint<br />\nwill<br />\nVeritas %roe Liberabit, we<br />\nbribes.<br />\nor<br />\npleas,<br />\ne,<br />\npressur<br />\nregardless of<br />\nas<br />\nWe will create constructive chaos with humorand<br />\ncharm,<br />\nshock,<br />\ntickle,<br />\n,<br />\n'enrage<br />\nour tool. We hope to<br />\nactivate our readers.<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nNEWS -LETTER<br />\n<br />\nSheep's Time To Awaken<br />\nBy GERALD BRECHER<br />\nProfessor John Roche, President Johnson's Egghead-in-residence at the White House, once<br />\nremarked that we would have<br />\nno real opposition to the war in<br />\nViet Nam if we'd only stop drafting sons of the upper-middle<br />\nclass. This is a remark that<br />\nmakes a great deal more sense<br />\nthan it would seem, once we<br />\nrealize that virtually all the<br />\nadult opposition to the war<br />\ncomes from the afore-mentioned<br />\nsocial class, and that of the<br />\nyounger people from their children. Prof. Roche is merely suggesting, and correctly, I would<br />\nsubmit, tha•t one of the greatest<br />\ncomponents of the dissent over<br />\nthe war is the fear of the draft<br />\nby a group of people who have<br />\nthe most to fear from it.<br />\nIt's really quite simple. Without the war in Viet Nam, the<br />\ndraft is really not a factor in<br />\ntoo many people's lives. With the<br />\nwar being maintained at its present level, however, no one is<br />\nreally immune from draft pressures. Now with the poorer segments of the population, the<br />\nArmy has always been a healthful and welcome respite from the<br />\ndrudgery of a marginal existence. It's for damn sure that the<br />\naverage Black from South Baltimore isn't about to get the opportunity to travel to places like<br />\nOkinawa or Seoul, or Stuttgart<br />\nwithout the kind services of the<br />\nG.I. travel agency.<br />\n<br />\nWe admit that the pay is not<br />\nall that great. But, then again,<br />\nthe bulk of the draftees weren't<br />\ndoing all that better on the outside anyway; and besides, the<br />\nfringe benefits, as we have<br />\npointed out, are well worth the<br />\ncut in cash pay.<br />\nThis is all very nice: very nice<br />\nthat is, if your future isn't about<br />\nto be too very exciting—you<br />\nknow, sort of the same shoddy<br />\nlife your folks have been living for generations. Very nice—<br />\nif your ambitions don't run any<br />\nfurther than a 'good' job at a<br />\nhundred and a half a week, a<br />\ncheap house in a lousy suburb,<br />\nand the same for your kids, and<br />\nhopefully theirs as well.The Army<br />\ncan't hurt you then; except<br />\nmaybe you might get killed. But<br />\nthat's the risk you run, and<br />\nyou'll be defending our country—<br />\nall that jazz. It'll be a good experience.<br />\n<br />\nBroadening Experience<br />\n<br />\nUniversal Unfairness ...<br />\ngreat<br />\nThe draft has proven to be one of the<br />\ns to<br />\npurport<br />\nwhich<br />\nanachronisms of our time. hi a nation<br />\nall,<br />\nfor<br />\nrights<br />\nequal<br />\nand<br />\ncy<br />\ndemocra<br />\nbe the strongbed of<br />\ndraft in<br />\nthe<br />\nof<br />\nbias<br />\nnatural<br />\nthe<br />\nthat<br />\nshown<br />\nbeen<br />\nit has<br />\nlower class<br />\nthe past is against negroes, youths of the<br />\nor finanmental<br />\nfor<br />\ncollege<br />\nattend<br />\nto<br />\nunable<br />\nand others<br />\ncial reasons.<br />\nwe<br />\nWe abhor the fact that this has existed, and<br />\nsteps to<br />\ntaking<br />\nfor<br />\nsion<br />\nCommis<br />\nl<br />\nMarshal<br />\nthe<br />\napplaud<br />\nmethod<br />\ninitiate a random selection system, \"the only<br />\nnt<br />\nPreside<br />\nas<br />\n,\"<br />\nfairness<br />\ne<br />\ncomplet<br />\nhes<br />\nhieh approac<br />\non<br />\ndefiniti<br />\nby<br />\nwhich<br />\nJohnson has said. Any draft system,<br />\nhis<br />\nwithout<br />\nservices<br />\narmed<br />\nthe<br />\nforces a person to enter<br />\nng<br />\npersonal volition, is naturally unfair. But this reasoni<br />\nnoning<br />\ndemand<br />\nvery<br />\na<br />\nserves little purpose; we are in<br />\nwar, and as long as the government wishes to pursue<br />\nin it, we are but their pawns.<br />\nThe most significant problem of the draft which<br />\nfaces Congress now is what to do with undergraduates.<br />\nEveryone seems to agree that the best soldier—which we<br />\nand<br />\ntake to mean he who can be most easily molded<br />\nwho values his life the highest—is the 19 year old. This<br />\nwe agree with, not for the above reasons, but rather because it would cause the least interruption of his life.<br />\nHopefully, after his two year service he would be ind him through the<br />\nclined to use the scholarship afforde'<br />\nG.L Bill to further his education.<br />\nBut there are many 18 and 19 year olds—presumably the bulk of Hopkins students are or were in<br />\nthis category—who plan to earn Ph.D.'s, a goal which<br />\ndemands 8 to 10 years of their lives. They are the one<br />\npercent of our population, the mentally privileged. They<br />\ncan not afford an added two years of what would be<br />\nwasted time.<br />\nIf this one percent elite should in fact be deferred<br />\nfrom the draft, the only feasible way to achieve it is<br />\nthrough a challenging and demanding set of exams.<br />\nThis does not mean the infamous and fatuous \"war<br />\nboards\" of the last two years, but rather something in<br />\nthe line of comprehensive exams in a person's major<br />\narea of stiffly, whether it be medicine, dentistry, or<br />\nEnglish.<br />\nThis is an \"elitist\" view, but applicable only for<br />\nthose capable of earning a Ph.D. degree. Educational<br />\ndeferments are now held by 1.7 million students. Under<br />\nthe suggested system above, only about 200,000 deferments would be awarded. Everyone else would be included in the pool of eligible men at 19, and would have<br />\nto serve if chosen. Only after their two years were<br />\nfinished would they be able to pursue the luxury of a<br />\ncollege education.<br />\n<br />\ncan look forward to the fabled<br />\n'year off' anymore? A guy can't<br />\neven ski bum for six months<br />\nwithout his draft board sending<br />\nhim friendly greetings and pesky<br />\ninduction notices. Really, if a<br />\nguy can't enjoy the greatest asset of economic well being, leisure time, then what's the point<br />\nof having the dough to begin<br />\nwith?<br />\nOur beloved President makes<br />\na big deal of making the draft<br />\nFAIR. But let's just realize who<br />\nthe draft is really unfair to. It's<br />\nnot the slum kid who's getting<br />\nthe raw deal out of the Army.<br />\nHell, the Army can't be any<br />\nworse than where he came from<br />\nin the first place. But for the Big<br />\nNoise from Winetka or Shaker<br />\nHeights or Grosse Pointe or<br />\nGreat Neck, the draft is a royal<br />\nshaft. The Army is very simply,<br />\na drag. You don't get anything<br />\nout of it. You don't really do<br />\nanyone any good by being in it,<br />\nand conceivably, you could really<br />\nget screwed up by the whole<br />\nthing. Who needs it, really?<br />\n<br />\nthe two years just for themselves.<br />\nAnd don't forget, when you get<br />\nout, the uniform is just the<br />\nthing to wear around the gas<br />\nstation or the warehouse. The<br />\nmilitary look and all that; tres<br />\nchic, you know.<br />\n<br />\nIt's Unfair<br />\n<br />\nPain in the Neck<br />\nHowever, there are a few people in the country for whom the<br />\ndraft is a giant sized pain in<br />\nthe neck. And these are the<br />\npeople about whom Prof. Roche<br />\nIs talking. You see, these kids<br />\nhave already done their traveling abroad. They've already had<br />\ntheir share of dormitory living—<br />\nor at least they've gone to sleep<br />\naway camp, for God's sake. They<br />\nhave lots of nice clothes; and<br />\nif they need to look military.<br />\nthey can bop down to Limbo, or<br />\nup to the attic and cull from<br />\nDaddy's old officer's uniforms.<br />\n(What is this enlist man jazz,<br />\nanyhow?)<br />\n<br />\nThe Army is, if you come from<br />\na pretty dull background to start<br />\nwith, a real broadening experience. I mean, if you haven't gone<br />\nto boarding school, where else<br />\nwill you learn the virtues of<br />\ncommunal living? Army uniFor these kids the draft ruins<br />\nforms are glamourous additions<br />\nto any man's wardrobe, and as their education, and worse, ruins<br />\nfree items are definitely worth their vacations. After all, who<br />\ni<br />\n<br />\n71-1E NEW<br />\nDRAFT PLAN—<br />\not:t.\"viET KAM<br />\n<br />\no<br />\nil)0<br />\n<br />\n,•;•;;;t!ii,ii!N;((,,11.1,<br />\n<br />\n(A).2 muted<br />\n<br />\nIQ- YEAR-ot-PS woo/.Co<br />\n8E1644r Et 1 Gi BIC FOn<br />\nYNE DRAFT Mil YEAR<br />\n<br />\nA<br />\noY<br />\n<br />\n5oo,o00<br />\n144Dut.t) pe<br />\nPisquAlIF/ED<br />\n&IR PN'AS C t.<br />\nR<br />\nTA !—<br />\nREA'S<br />\n<br />\n(0)<br />\nbF Ti<br />\n<br />\npid /0<br />\n<br />\n(E)<br />\n<br />\n1-14E<br />\n<br />\ntr,11, t,<br />\n<br />\n/-7-:<br />\n<br />\nRoOLETTE it<br />\n<br />\nLEAkitt46goctoos<br />\nSUBJECI To<br />\n<br />\n'1,;(11,<br />\n<br />\nIt's obvious to anyone with<br />\nhalf a brain that the whole idea<br />\nof a draft at all is unfair. You<br />\nknow, involuntary servitude and<br />\nall that. If the President thinks<br />\nthat extending the draft to get<br />\njust about anyone with some hit<br />\nor miss lottery is making the<br />\nthing FAIR, he has got his<br />\nhead. ...<br />\nThere is an answer to it all,<br />\na rather extreme answer to be<br />\nsure—but in this case, it seems<br />\nwarranted. The only reason the<br />\ndraft exists, in any form at all,<br />\nis because you sheep out there<br />\njust resignedly go off and accept it. Rather than sit and bitch<br />\nlike a bunch of cry-babies about<br />\nyour damn deferments, if Lord<br />\nHelp Us, you should get a nasty<br />\ninduction notice, just quote then<br />\nin reply what dear Stokely said<br />\non National T.V. \"Hell, no!\"<br />\n<br />\ntif14 4(<br />\n<br />\nvim<br />\n<br />\nHE)) A *AR<br />\nr(11<br />\n<br />\nNELDO) MC411<br />\n<br />\n401 root<br />\nIELECTI\"<br />\n<br />\nC°01-1<br />\n'<br />\nFE ExPEcTED To<br />\nBC voLuoitcR5<br />\nPR P.C5(\"515<br />\n100100D<br />\n<br />\npurr<br />\n<br />\nC)isAvn461.5 miwoo<br />\n<br />\n/)<br />\n147<br />\n(03oo,000<br />\nWOULD HAVE.<br />\n-113<br />\nDRAM,<br />\nTh SATiSFY nir<br />\n<br />\nQuer/1<br />\n<br />\n(C.T)LeAv 0165'00,000<br />\nup roocsit).<br />\n6r cauksc,<br />\n(<br />\n°NC OF 111101)<br />\n<br />\n11000101011011111111(141(0111(SHitinhitilittigNIIIVAIS11111(1114rilltirT;m1111. • •<br />\n<br />\n11111114414110111411401(0110114141(11441111(111441001(41111401141Wilaili11111(141111410141101111110111111114(1141111ilit141100111110111111i11111<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nNEWS -LETTER<br />\n<br />\nI The Near Great University<br />\n<br />\n4<br />\n<br />\n•<br />\n<br />\nPAGE FIVE<br />\n<br />\nGreenwood<br />\nHomewood<br />\nSchemewood<br />\n<br />\nBy SETH FELDMAN<br />\nings as well as outside. Lecture freshman before he be allowed<br />\nJeremey Richards found that halls were used as warehouses to attend classes. A workable<br />\nIt was possible to fall asleep for pennants, pins and beer honor code was pressed into<br />\nunder a tree in Keyser quad. And mugs. Soon classes were su- effect and so respected that soon<br />\ndid.<br />\nspended altogether so as not to one third of the student body<br />\nOnce upon a time the dream- interrupt school activities. Soon found itself accused of cheating off a second third—the aced) there was a near great uni- everyone was drafted.<br />\n\"Another failure,\" said the cuser being the third third.<br />\nversity in the heart of a great<br />\nBy MURRAY RUDNICK &<br />\nscenes abounded.<br />\nrun down city. One reflective king. \"Bring on the third re- Courtroom<br />\nELIA KATZ<br />\nGreat legal minds, in their dark<br />\nafternoon, the king of the near form.\"<br />\nmagdrew<br />\ndarker<br />\nvests<br />\nand<br />\nsuits<br />\nInteresting<br />\nto note that there<br />\ngreat university looked about<br />\nEnlisting a new student body,<br />\nhim and thundered: \"why is my the university - was moved from nificent hair-splitting, loophole- was a proposal in the March 10<br />\nuniversity only near great? How its run down city to a real live finding briefs from the black- issue of \"The News-Letter\" for an<br />\ncan I make it great?\" To which city, a mecca of culture, enter- ness of their elegant attache incisive THREE POINT PROthere was no lack of enthusi- tainment, ideas. All were imbued cases. The university came to a GRAM to remedy the communiastic reply.<br />\nwith the sophisticated urban spellbound standstill as the end- cations problem at Hopkins. 1)<br />\noratory echoed and re- CAMPUS PUBLICATIONS?<br />\n\"Your university is not great, environment. The Liberal Arts less<br />\nthrough everyone's mind. There are some already. 2)<br />\nsire, because there is no mean- students spent their time be- echoed<br />\nFinal exam time found the tests SPEAKERS, FILMS, & SPECIAL<br />\ncoming<br />\nmore<br />\nliberal, chasing<br />\ningful communication on cammore art. The Engineering stu- cancelled. Nobody had gone to EVENTS. A call for free Friday<br />\npus,\" stated one reformer.<br />\ncl, ss for weeks. All were pack- and Saturday night movies. Is<br />\n\"Your university lacks spirit,\" dents found more and better<br />\nshapes to study. The hick stu- ing the courtroom, breathlessly, 25c really much more than free.<br />\ncheered another.<br />\ntensely waiting as the great mo- 3) GOUCHER WOMEN AT HOP\"Your university is in the dents got lost on the subways. ment seemed<br />\nto be drawing KINS. A Positive Action Council<br />\nOnce<br />\nagain the king found himWrong city,\" offered a third.<br />\nclose—the end of the prelimi- to invite the girls to our free<br />\n\"Your university lacks well or- self on an empty campus.<br />\nnaries of the first trial under the Friday and Saturday night movganized, effective student gov\"More students, another re- university's<br />\nnew rules.<br />\nies. A group of enthusiastic unernment and especially lacks a form,\" his majesty gloomily de\"Oh,\"<br />\nmoaned<br />\nthe king, now dergraduates with orchids and a<br />\nmeaningful honor code\" elo- manded.<br />\nFor the fourth reform the so finally crushed,\" how, by station wagon to bus all this tail<br />\nquently stated the student orDuke of Admissions wisely pro- what reform will my near great back.<br />\nganizer.<br />\nOn and on went the sugges- cured a few students noted for university become a great one?<br />\nOr: What \"Proponents of<br />\ntions, until the now hopelessly their abilities in student gov- What must be done? What must Communications\" seem to be<br />\nconfused king turned to his ernment and the remainder of be grabbed and changed or dis- suggesting is that Johns Hopkins,<br />\nboard of .sorcerers for advice. the student body noted for its guarded? What systems, what a great American University for<br />\nThe sorcerers told the king to tendancy to take laws and or- plans must be instituted? What, over 90 years, has somehow been<br />\ntry each different suggestion and ganizations seriously. Within what, what.\"<br />\nexisting without \"communicato select the most successful days a ruling asembly had been<br />\nAt which Jeremey Richards tions.\" We have been a massive.<br />\nreform that would create a great formed and a series of legal doc- awoke from under the tree in thick intellectual masturbatorium.<br />\numents had been drawn up, ap- Keyser quad and taking his Well. And he proposes, as far<br />\nuniversity.<br />\nFirst then, he ordered the en- proved and sworn to by all. textbook pillow with its ob- as his proposals can be deteractment of an experimental These documents were immedi- scenely defaced Hopkins book- mined, to turn the masturbatorcommunications plan under ately compiled into one easy-to- cover, headed for the atrociously ium into a daisy chain of the<br />\nWhich communications between understand 27 volume student decorated Hutzler reading room, mind and mouth. The paint<br />\nmembers of the academic com- handbook which was to be di- which should be improved— being, \"communications\" is an<br />\nabstraction, having little of anymunity would not be hampered gested and regurgitated by every somehow, sometime.<br />\nby such outmoded institutions as<br />\nlectures, grades, tests, conferences or papers.- Students would<br />\nbe able to meet randomly with<br />\ntheir professors and instructors,<br />\neach of whom was assigned his<br />\nown tree on campus. Soon the<br />\nBy BARON WORMSER<br />\nGenet) has a lot of money. He 1 our image abroad. Instead one of<br />\nentire near great university was<br />\nBeach movies are potentially owns the South. He likes the: the 'bad' teenagers is impaled<br />\nbuzzing with true free intellecwith a water ski.<br />\ntual activity. Students discov- nice things. They are pure enter- American code of honor and lives I<br />\nered that the evenly spaced tainment pre-supposing that life by a lake. He likes his daughter<br />\nCream Judge IV<br />\ntrees made fine football goals, is nothing more than a series of even though she has crawly white<br />\nSo it is Gary Lewis and the<br />\nout<br />\nred<br />\nicky<br />\nis<br />\nhair.<br />\nand<br />\nHe<br />\nskin<br />\nbaseball bases and were perfect vignettes filled with music, girls,<br />\nPlayboys conducting World War<br />\nfor mounting basketball hoops. and sand. There is no death nor to kill Stevie Wonder and AnII, The Righteous Brothers singThe professors discovered that sickness nor even ugliness in a nette. \"Imagine,\" he says, loading<br />\ning 'Justine— as mortars go off.<br />\nCarnage<br />\nParty<br />\nBeach<br />\nin<br />\nhis<br />\ngun<br />\nbeautiful<br />\nmovie.<br />\nbeach<br />\nOnly<br />\nthere is no finer place than a<br />\nDancing to the rhythms of subtree for reading books that tanned bodies and bikinis. Fur- \"letting a blind Negro on a white machine<br />\ngun fire. John Foster<br />\nYou've previously secreted among thermore the beach movie is un- folks beach.\"<br />\nDulles gunning down Oriental<br />\nthe leaves. In no time at all the contaminated by such encumWipe Out Gang<br />\nlearned were nested in the brances as plot, message, charof John Foster Dulles,<br />\nBecause<br />\nbranches while the learners acter, or art. Rather the beach<br />\nSummer is a terrible movie. The<br />\nPlayed around the tree trunks movie is a phenomenon in which<br />\nbeneath them—truely meaning- as in the movie under review. mindless fun of Annette has been<br />\nful communications had been Swingin' Summer, the time of transformed into seriousness. Do<br />\none summer is superimposed on not, oh moviemakers, ever take<br />\nestablished.<br />\n\"A farce,\" said the king. \"On one day as in a classical French yourselves seriously. Right away<br />\nwith the second reform.\"<br />\ndrama and action is limited to plot creeps in. The hero wants to<br />\nA great new athletic field was pelvic gyrations and guttural earn money for dental school.<br />\nThe heroine wants her daddy<br />\nconstructed, in an effort to rouse wailings.<br />\nJohn Foster Dulles to give him<br />\nSavage Rose<br />\nschool spirit. Non-athletes were<br />\nBut even such classics as Beach the money. But the hero doesn't<br />\nexpelled as the high schools were<br />\nscoured for potential talent, Party Blanket and Blanket Party want it. He says \"Luci Baines I<br />\nwhich was brought to the uni- Beach are now disgraced. Great don't want no charity.\" No welversity at all costs. Attendance Americans like the Righteous fare for this pre-med. just lots<br />\nat games became mandatory (no Brothers & Gary Lewis and the of white toothed absurdity.<br />\neasy requirement, now that Playboys, are being debased by<br />\nAn accurate count of violent<br />\ngames in 36 major sports and the moralistic passions of John scenes in Summer revealed three<br />\ncountless minor ones were being Foster DuIles.<br />\nabductions, four fist fights, one<br />\nheld daily). Everybody became<br />\nThe father of the heroine of boat race, one water ski duel,<br />\nsaturated with the fullness of this movie is John Foster Dulles. and three robberies. John Foster<br />\nschool spirit. Cheers were writ- He is head but so is Jean Genet Dulles asked for a lynching but<br />\nten, ivy grew inside the build- and he is alive. He not Jean the producer vetoed it as bad for<br />\n<br />\nthing at all, to do with FacultyStudent Coffee Hours and Free<br />\nMovies and Pajama Parties.<br />\n<br />\nRoy Orbison<br />\nThis week<br />\n<br />\nThe Annette Funieello Award<br />\nfor<br />\n<br />\nChild-Bearing<br />\ngoes to<br />\nRoy Orbison<br />\nfor his song<br />\n\"Communications Breakdown\"<br />\n<br />\nSwingin' Summer and Savage Rose<br />\nteeny hoppers. He sings ''Kids<br />\nI've<br />\npaid/to stop<br />\nthrowing<br />\nparties/and throw instead<br />\ngrenades.<br />\nVery sad. I hope Annette and<br />\nStevie Wonder get back in the<br />\nmovie business soon. Until then<br />\nI hope John Foster Dulles and<br />\nSally Jane, his husband hunting<br />\ndaughter stay in Texas and leave<br />\nour blue eyed soul brothers<br />\nalone.<br />\n<br />\nFor Springtime Frolicking<br />\n<br />\nUniversity<br />\nSportswear<br />\n<br />\nJAY'S<br />\nSMOKE SHOP<br />\n408 West Cold Spring Lone<br />\n<br />\n•Pipes<br />\n•Imported Cigars<br />\n•Imported<br />\nCigarettes<br />\n• Custom Blends<br />\n<br />\nFRATERNITY JACKETS<br />\nAND T. SHIRTS<br />\nORDER NOW FOR<br />\nQUICK DELIVEalt AND<br />\nLOWEST PRICES<br />\n<br />\nC AMPLE<br />\nJTORE<br />\nOPEN EVERY EVENING<br />\n'TIL 9 P.M.<br />\n<br />\nJust A Few Blocks<br />\nFrom The Hopkins Campus<br />\nAt 31s1 & Creenmount Ave.<br />\nHO. 7-2719<br />\n<br />\nZelan Jackets ......... 6.95<br />\nNylon Jackets...... .. 9.95<br />\nSweatshirts (all colors)... 2.95<br />\nShort Sleeve Sweatshirts. . 2.95<br />\nHopkins \"T\" Shirts .... . 1.98<br />\n<br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\nIN THE HEART OF GILMAN HALL<br />\n<br />\n\fPAGE SIX<br />\n<br />\n.4<br />\n<br />\nChernick Places First<br />\nThe Varsity swimming team<br />\nplaced fifth in a field of<br />\neleven schools in the Middle<br />\nAtlantic Championships at<br />\nHomewood on March 3 and 4.<br />\nHoward Chernick copped a<br />\nfirst in the 100 and 200 yard<br />\nbutterfly and Richard Wilson<br />\ntook the one meter diving<br />\ncompetition.<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nEWS-LETTER<br />\n<br />\nDeferments Favored Swordsmen Gain Stickers<br />\nTourney Crown Face Mt.<br />\n<br />\n(Continued from Page 1)<br />\nmilitary option to serving in the<br />\narmed forces. Also, 59% of the students favored the maintenance of the<br />\npresent priority system for drafting and rejected President Johnson's proposal for a random lottery system.<br />\nDraft Women<br />\nOf the additional comments by<br />\n<br />\nJob Opportunity<br />\nAirlines Sales Representative<br />\nfor<br />\nTRANS WORLD AIRLINES<br />\nInteresting Work, Good Pay<br />\nWrite:<br />\n<br />\nthe students, one of the most<br />\ninteresting proposals was to draft<br />\n(Continued from Page 8)<br />\nwomen and use them in desk jobs<br />\nsecond place behind<br />\nanother<br />\nthat are now being manned by<br />\nCornell with 18.<br />\nmen.<br />\nFinally in the sabre competiSignificantly, most of those re- tion, Mike Gross was impressive<br />\nsponding seemed to feel that the in the A pool as he won nine of<br />\nVietnam War was the cause for his bouts. Bernie Tawfik was also<br />\nhis pool, and he went<br />\nthese problems concerning the powerful in<br />\n7-4. Capturing their third second<br />\ndraft, and numerous expressed place with 16 points, the Blue<br />\nthe belief that an end to the Jays followed Patterson State<br />\nWar would end the current de- with 18.<br />\nbate on the draft and restore a<br />\nAfter the team competition,<br />\nstatus quo ante bellum.<br />\nthe bop four fencers in pool A<br />\nand the two standouts in pool B<br />\nSA Cabinet Positions participated in a final individual<br />\ntournament. Lam placed third<br />\nPositions are open on the<br />\nwith three wins and two losses<br />\nSA cabinet for next year. ApIn foil. Gross took a second with<br />\nare<br />\nplications for interviews<br />\na 3-2 record, and Leedom copped<br />\nnow being accepted from ina fifth with two victories.<br />\nstudents. Submit<br />\nterested<br />\nAn exuberant Coach, Dick<br />\nname, address, box number,<br />\nOles, who celebrated his birthday<br />\nSA<br />\nno.<br />\nto<br />\nand phone<br />\nCabinet,<br />\nlast Saturday, was very pleased<br />\nBox 461.<br />\nby the victory.'<br />\n<br />\nThe CRACK of DOOM<br />\nA NEW COFFEE HOUSE<br />\n<br />\nT. W.A.<br />\n<br />\nWrestling Banquet<br />\n<br />\nAT THE FOGHORN LOCATION<br />\n1031/2 W. 22nd ST.<br />\nOPEN 9 to 1:30 FRI., SAT.<br />\n<br />\n826 Munsey Building<br />\nBaltimore, Maryland<br />\n<br />\n21202<br />\n<br />\n(Continued from Page 8)<br />\nthe team's performance in last<br />\nSaturday's 14-9 scrimmage win<br />\nover the University Club, the<br />\nvarsity mentor was not anxious<br />\nto single out individuals, but did<br />\nmanage some words of praise for<br />\nthe attack. He emphasized that<br />\nhis starting threesome has jelled<br />\nvery well, a development that<br />\nhas proven beneficial to crease<br />\noperator Kneip.<br />\nKneip Praised<br />\n\"Phil's scored well so far,\" he<br />\ncommented, \"and having good<br />\nfeeders like Cowan and Feely<br />\naround has helped him a lot. But<br />\nhe's improved in lots of ways—<br />\nat this stage he's a better, more<br />\nversatile all-around player than<br />\never before.\"<br />\nCowan, who had two goals and<br />\nfour assists when a fourth quarter thunderstorm hastened this<br />\nwriter's departure, also stood out,<br />\nand the midfield crew—adding at<br />\nleast three scores—lent balance<br />\nto the Jay offensive effort.<br />\n<br />\nFRIDAY: THE DULANEY VALLEY BOYS,<br />\nA FAST MOVING BLUE GRASS GROUP<br />\n<br />\nSATURDAY: BEAUTIFUL LIZ MILLER<br />\nSINGS BALLADS AND FOLK SONGS<br />\nCover MOO<br />\n<br />\nThe varsity wrestling team<br />\nheld its banquet on Wednesday, March 15. Co-captain<br />\nBill Swartz received the most<br />\ntake-downs award; John Gale<br />\nwas voted the most improved<br />\nwrestler; Joe Griggs was<br />\nawarded the unsung hero's<br />\ntrophy.<br />\n<br />\nFast-talking your parents<br />\nis the hard way<br />\nto get to Britain.<br />\nFact-talk instead.<br />\nTell them exactly what your trip will cost. Our free booklets help you calculate it.<br />\nOne lists prices of organized student tours. They start<br />\naround $650. If you want to travel on your own and take<br />\npotluck on meeting people —which may be the most fun<br />\nof all—add things up for yourself.<br />\nStart with a charter flight if your school has one. Or see<br />\nour booklet on group flights, student ships, and the bargain airline.<br />\nAdd low costs for getting around Britain. Our booklets<br />\ntell you about 3¢-per-mile buses and the rail-and-boat<br />\npass that takes you up to 1,000 miles for $30. Consider<br />\nhiking too. Wordsworth did.<br />\nMultiply the number of your nights in Britain by cost<br />\nof bed and breakfast or a room in a college residence hall.<br />\nIf you're hiking or biking, count on about 70¢ for youth<br />\nhostels. At this rate you may be able to stay all summer.<br />\nAllow about $1 a meal in London, less in the country.<br />\nThe booklets say which restaurants and pubs are popular<br />\n<br />\nwith convivial British students.<br />\nAnd the booklets mention the fantastically low cost of<br />\nconcerts and plays in Britain. You can sit in \"the gods-galleries up near Heaven—for 75.A lot of outdoor entertainment, like concerts and folk-singing, is free.<br />\nClip the coupon. Add everything up. And tell your<br />\nparents you can spend this summer in Britain for about<br />\nwhat it costs to hang around the house.<br />\n<br />\nBritish Travel<br />\nBo:923,New York,N.Y. WM<br />\n<br />\nName<br />\n<br />\n(Pleaae print dead')<br />\n<br />\nCollege<br />\nAddress<br />\nCity<br />\n<br />\nSlate—Zip—<br />\n<br />\n><br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nNEWS-LETT!R<br />\n<br />\nEvening Before<br />\n<br />\nT<br />\n<br />\nThe Big Year<br />\n<br />\nBy STEVE PUTNAM<br />\n<br />\n.1<br />\n<br />\nI<br />\n<br />\nmentum more or breaks an op'Pomorrow, the Jays face the ponent's rally quicker than a<br />\nMounts in what could be the crucial goal. If<br />\nthe attack can<br />\nWorld lacrosse<br />\nchampionship<br />\ngame of the season. Of course keep coming up with the big<br />\nthis is the big year for the Jays, play, we'll be all right.<br />\nand there's sort of an<br />\nMounts Professional<br />\nurgency<br />\nto our cause. We haven't<br />\nseen a<br />\nThe Mounts. of course, are the<br />\nchampionship since 1959.<br />\nclosest thing to professional that<br />\nThis year we sport outstanding<br />\ntalent combined with good speed, lacrosse produces. They will score<br />\nsize (a new innovation) and 10 goals no matter what. The<br />\ndepth (another new innovation). Jays can stay on top of ground<br />\nLast Saturday many fans saw a balls and<br />\nkeep constant pressure<br />\ngood brand of lacrosse as the on the defense, but<br />\nif we don't<br />\nJays beat the University Club consistently score — we'll never<br />\n14-9. The Club, although reputed make it.<br />\nto be out of shape, sported<br />\nEveryone tp<br />\nsome excellent talent (Homer<br />\nThe psychological factor is imSchwartz, etc.) and were a good portant<br />\n. We all have to be up<br />\nhustling team. They whipped in for<br />\nthis thing tomorrow. This<br />\nthree straight goals near the end year<br />\nwe're too good to fade in<br />\nOf the first half and<br />\nhopeful fans the last quarter. Momentum is<br />\nbegan to shudder.<br />\non our side, we're coming up in<br />\nMost observers feel that we the lacrosse world. With big faith<br />\ncan't improve enough from last and few breaks, the young<br />\nupYear to take it all. Even the Sun starts can beat the professionals<br />\nexpressed its usual skepticism and bring the title back where<br />\nabout our chances tomorrow.<br />\nIt belongs—Hopkins, the home of<br />\nlacrosse!<br />\nAttack<br />\nAs I see it, much depends on<br />\nthe attack. Navy, in<br />\npast years,<br />\nsported an almost score-at-will<br />\nbrand of lacrosse, which, combined with ball control, was unbeatable. The Jays have always<br />\nbeen good on ball control Several<br />\n.<br />\ngames we lost last year we controlled the ball almost twice as<br />\nmuch as our opponents. The<br />\nteam must be able to make<br />\nthe<br />\nbig Play, however, and score in<br />\nthe clutch. Nothing adds<br />\nto mo-<br />\n<br />\nPAGE SEVEN<br />\n<br />\nBaby Jays Strong, Virile<br />\n(Continued from Page 8)<br />\nCoach Sotir plans to run some<br />\nof the attackmen at mid-field so<br />\nas not to waste their abilities.<br />\nDoug Honig, the All-Long Island<br />\nTeam star from Manhassett, is<br />\nsure to lead this unit. Honig was<br />\nthe top scorer on Long Island<br />\nlast year with 92 points, with<br />\ntwenty-two goals and 70 assists<br />\nto his credit.<br />\nOther attackmen demonstrating potential include Stu Kahl,<br />\n1st Team All-Maryland, Russ<br />\nMoore, All-League star from<br />\nMineola, New York, and Dave<br />\nRoberts, another top Maryland<br />\n<br />\nprospect.<br />\nThe midfield contingent should<br />\ncount heavily on Jim Lotto, who<br />\nscored thirty-three goals for<br />\nUniondale, New York last year<br />\nand Andy Fisher. Other top prospects include footballer Paul<br />\nWeiss, who never played lacrosse<br />\nbefore, Dan Rosenfeld and Stu<br />\nFogel.<br />\nDefense Helped<br />\nThe defense will probably be<br />\nanchored by Dick Billows, an<br />\nAll-League player from Garden<br />\nCity, New York, Bob MacCool,<br />\nAll-Maryland; and Chip Hicks,<br />\nwho is also back-up goalie. The<br />\n<br />\nCHUNG'S<br />\n<br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY & FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br />\n<br />\nCARRY-OUT<br />\n<br />\ndefensive unit is learning much<br />\nfrom Assistant Coach Steve Levy,<br />\na standout on last year's varsity<br />\nsquad.<br />\nCommenting on the progress<br />\nof his team so far, Coach Scitir<br />\nfeels that it is an aggressive,<br />\nhard hitting group with some<br />\nfine stickhandlers but that lack<br />\nof depth could hurt. Sotir added,<br />\n\"Certainly the coaches want victories, but the prime objective of<br />\nthe freshmen team is to 'indoctrinate' the freshmen into the<br />\nHopkins' style and system of lacrosse.\"<br />\n<br />\nSTUDENT-PART TIME<br />\n<br />\nFine Chinese and<br />\nPolynesian Food<br />\n<br />\nWork 3 evenings 3-10 or<br />\n2 evenings & Saturday 9-5.<br />\n<br />\nOpen Doily 11 A.M. -10 P.M.<br />\nFriday & Sat. 11 A.M. -12 P.M.<br />\nSunday 1 P.M. -11 P.M.<br />\n<br />\n$60<br />\n<br />\n508 W. Cold Spring Lane<br />\n<br />\nCALL 837-8152<br />\n<br />\n889-3428<br />\n<br />\nHow would you fit into Du Pont's Project X?<br />\n<br />\n$ $ $<br />\nHOPKINS UNDERGRADUATES ARE NEEDED to<br />\nserve as subjects for Psychological Research. Pay $1.50 per<br />\nhour. Please come to Room<br />\n230, Ames Hall.<br />\n<br />\nVOLUNTEERS<br />\nWANTED FOR VISTA<br />\nCultural Enrichment Program People needed with<br />\nskills in the arts.<br />\nCall or Write:<br />\nMARIANE HENDERSON<br />\n110 South Exeter St.<br />\n685-1056<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\nP4<br />\n<br />\nEASTER TIME<br />\n<br />\n• Friends and Relatives<br />\nAppreciate<br />\n<br />\nCards and Candies<br />\nrosta<br />\n<br />\n4 Greenway Pharmacy<br />\nCharles and 34th St.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br />\n<br />\n* * * * * * * *<br />\n<br />\n'When hunger starts in these<br />\nhere parts, it will stop al a<br />\n'lorry Little Shop.\"<br />\n<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br />\n<br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br />\n<br />\nYou are the only person who can answer<br />\nthat question.<br />\nTo do it, you should know as much as possible about<br />\nthe 150 new plant units Du Pont has built since<br />\nthe end of World War II. You'd then choose from one of<br />\nthe many lively fields of interest at Du Pont:<br />\ndesign, construction, production, marketing, research<br />\nand process improvement (to name just a few).<br />\nInvolvement starts the day you join. There is no<br />\ntraining period. You go into responsible work right away.<br />\nYour professional development is stimulated by<br />\nreal problems and by opportunities to continue your<br />\nacademic studies under a tuition refund program.<br />\nYou work in small groups where individual<br />\ncontributions are quickly noted and appreciated.<br />\nThe work is significant, and of benefit to society.<br />\nYou're part of the most exciting technical environment<br />\navailable today and tomorrow, and facilities and<br />\nassociates are the best.<br />\nHow could you fit in? Why not sign up for a chat with<br />\na Du Pont interviewer and find out? The coupon will<br />\nalso bring you more information about us.<br />\nFinally, what is Project X?<br />\nWe don't know yet. Could be we're<br />\nwaiting for you to tell us.<br />\n<br />\n°U..P0<br />\n<br />\nE. I. du Pont de Nemours & Co. (Inc.)<br />\nNemours Building 2500-2<br />\nWilmington, Delaware 19898<br />\nPlease send me the Du Pont Magazine along with<br />\nthe other magazines I have checked below.<br />\nLII Chemical Engineers at Du Pont<br />\nO Mechanical Engineers at Du Pont<br />\nLI Engineers at Du Pont<br />\nEj Du Pont and the College Graduate<br />\nName<br />\nClaw<br />\n<br />\nMajor<br />\n<br />\nDegree expected<br />\n<br />\nCollege<br />\nMy addreHa<br />\nCity<br />\n<br />\nState<br />\n<br />\nZip Code<br />\n<br />\n\fJP<br />\n<br />\nNEWS<br />\n<br />\nit<br />\n<br />\nT<br />\n<br />\nNEWS -LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nACROSSE<br />\n<br />\nLETTER<br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br />\n<br />\nE<br />\n<br />\nT<br />\n<br />\nJays Open Against Wolfpack;<br />\nFrosh Lacrosse<br />\nSuccess<br />\nTo<br />\nn<br />\nKey<br />\nSee<br />\nack<br />\nAtt<br />\nBoasts Good Attack<br />\n<br />\nthat pinned the Jays 11-5 in '66, Gorcyzk and defenders Bob<br />\nand, possessed of a surfeit of tal- Crutchley and Ted Leach (both<br />\nent and depth (five full strength of whom went all the way in<br />\nmidfields employed in previous last week's University,Club scrimscrimmages), would appear, as mage) are likely to be the chief<br />\nreserves at their respective poalways, to be favored.<br />\nHopkins — several intervening sitions.<br />\nA further manifestation of the<br />\ncollegiate championships notwithstanding — has not beaten Injury jinx — sophomore Phil<br />\nthe perennial club pacesetter (a Buck's collapsed lung—has upset<br />\nrecent 12-10 scrimmage victor the midfield situation somewhat.<br />\nover Maryland) since 1941, al- At this writing, Bob Carter,<br />\nthough this year's group should teaming with captain Jerry<br />\nnot be without the resources to Schnyclman and Wayne Towns,<br />\npull an upset, a fact concurred is chief candidate for Buck's spot,<br />\nupon by Jay mentor Bob Scott, with injured (muscle tear) soph<br />\nwho regards such an occurrence Charlie Goodell a possibility. Phil<br />\nParthmore will fill Carter's vaas \"not impossible.\"<br />\ncant third unit post.<br />\nStarters<br />\nScott Comments<br />\nVirtually certain to open in atScott, for his part, has not<br />\ntack spots for the Jays tomorrow<br />\nwill be Joe Cowan, Phil Kneip, been intimidated by the group's<br />\nof his eleven bouts. Al Bottle and Jim Feely, while the defen- physical problems, opining that<br />\nwent four and seven in the B sive alignment—more doubtful— its \"good depth could compenpool to give the Jays a total of will probably position sophi Mike sate\" for such losses. \"The same<br />\n15 points. Syracuse copped the Clark and John Cardillo with All- thing happened last year.\" he<br />\ntop honors with 17.<br />\nAmerican Hank Kaestner and continued,\"and, because we were<br />\nIn the epee contests Joe Mull- goalie Geoff Berlin. Although thin, it did hurt—but that's not<br />\nnare won seven and lost four in attackman Downy McCarty true now. Anyway, most of the<br />\n'm<br />\nthe A pool, and Bob Leedom (sprained ankle) and defense- injuries aren't really serious—I<br />\nposted an excellent performance man Joe Carlton (muscle pull) hopeful we'll have everybody<br />\nand was 10-1 in the B division. could be sufficiently recovered ready for the big games.\"<br />\nWhile generally pleased with<br />\nTheir total of 17 gave Hopkins from injuries to see action Sat(Continued on Paae 6)<br />\nurday, reserve scorer John<br />\n(Continued on Page 6)<br />\n<br />\nBy MIKE PHILLIPS<br />\nFresh from a set of fairly encouraging pre-season performances, the injury-annoyed varsity lacrosse team will kick off<br />\nits 1967 campaign in customary<br />\nfashion tomorrow, when it hosts<br />\nclub power Mount Washington at<br />\n2:30 p.m.<br />\nThe Wolfpack, last year's undefeated open (club and collegiate) champion, has incurred no<br />\nserious losses from the group<br />\n<br />\n•<br />\n<br />\nweek's scrimmages against GilBy JEFF LAUREN<br />\nman School and B.J.C. looking to<br />\nman<br />\nven<br />\ntwenty-se<br />\nPosting a<br />\nthe top stickmen and to defind<br />\nroster, the freshman lacrosse<br />\nother starting units.<br />\nvelop<br />\nteam opened practice three weeks<br />\nAttack Strongest<br />\nAlex<br />\ncoach<br />\nfirst-year<br />\nunder<br />\nago<br />\nMost observers agree that the<br />\nSotir.<br />\nBaby Jays are overloaded with<br />\nSotir, the Bluejays' varsity<br />\nfine attackmen and that the<br />\nHopkins<br />\nto<br />\ncame<br />\nfootball mentor,<br />\noffense is the Jay's greatest<br />\nlast, year from Wesleyan College<br />\nstrength. Tesifying to this fact,<br />\nwhere he was head varsity la(Continued on Page 7)<br />\ncrosse coach. He has had plenty<br />\nof experience with lacrosse and<br />\nwas one of the North's coaches<br />\nin last year's North-South All<br />\nStar Game. Nonetheless he will<br />\nfind it difficult to replace Wilson<br />\nFewster.<br />\nFewster, who coached the<br />\nfreshmen for over ten years at<br />\nHopkins, led last year's, Baby<br />\nBy JIM SLOAN<br />\nJays to an impressive 11-1 record<br />\nswordsmen conloss<br />\nvarsity<br />\ngame<br />\nThe<br />\nwith only an opening<br />\nto Virginia. However, Coach Sotir cluded their victorious 1967 camwill not have as strong a frosh paign by copping the championcontingent as did Fewster. Last ship honors in the North Atlantic<br />\nyear's freshmen stickers, sporting Conference last Saturday at<br />\ngreat individual performers in Syracuse.<br />\nTwelve schools participated in<br />\nevery position as well as remarkable depth, were considered one the tournament, and each sent<br />\nof the finest teams in many sea- two fencers in the three divisions.<br />\nThe Jays captured the team honsons.<br />\nors with 48 points. Cornell folFirst Game Tomorrow<br />\nlowed with 43, and third place<br />\nseatheir<br />\nbegin<br />\nJays<br />\nBaby<br />\nThe<br />\nwent to Syracuse. Last year's dethe<br />\non<br />\nson tomorrow at 12 noon<br />\nchamps, Patterson State<br />\nfending<br />\npractice field against Virginia. University, tied for fifth place<br />\nThe line-up will be determined<br />\nwith 35 points.<br />\nfrom the results of this past<br />\nLam Undefeated<br />\nThe<br />\ns.<br />\nscrimmage<br />\nweek's two<br />\nThe competition in foil. epee,<br />\nfreshmen are out-to avenge last<br />\ninto two<br />\nyear's close opening game loss. and sabre was divided<br />\nreceived<br />\nPeter Conti, the team's sole ex- pools—A and B. Hopkins<br />\nfoil division<br />\nthe<br />\nin<br />\nplace<br />\nsecond<br />\na<br />\nposionly<br />\nthe<br />\nis<br />\ngoalie,<br />\nperienced<br />\nperfect performance<br />\ntive starter against Virginia. The behind the<br />\nwho captured each<br />\nBluejay coaches entered this of Jerry Lam,<br />\n<br />\nFencers Place First<br />\nEdging Out Cornell<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\nfor she finest Italian food in town<br />\n3320 Greenmount Ave.<br />\n<br />\nThe upbeat buttondown.<br />\nEverything about this Arrow<br />\nDecton Permadron shirt<br />\nis traditional — except the<br />\nfact that it refuses to<br />\nwrinkle. And that may<br />\nstart a whole new tradition.<br />\nNote the wide stripes, the<br />\njust-so roll of the collar.<br />\nIt's in a blend of Dacron<br />\npolyester and cotton that's<br />\n\"Sanforized-Plus\". In<br />\nother stripes, solids and<br />\nwhites, too. A winner<br />\nat $7.00.<br />\n<br />\nCARRY OUT SERVICE<br />\n<br />\nSPAGHETTI M E A LS<br />\n<br />\nCALL 889-38M<br />\n<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\n-ARROW-c-<br />\n<br />\nNEWMAN HOUSE<br />\nThe C-atholic Center for Johns Hopkins<br />\nBE 5-9271<br />\n2941 N. Charles<br />\n<br />\nHoly Week Services:<br />\nPALM SUNDAY MASS<br />\n<br />\nMARCH 19TH<br />\n<br />\n10:30 A.M. Levering Hall<br />\n•<br />\n<br />\nHOLY THURSDAY MASS<br />\n<br />\nMARCH 23RD<br />\n<br />\n12:00 Noon Levering Hall<br />\n<br />\n•<br />\nMonday, Tuesday. and Wednesday of Holy Week<br />\nMass at Newman House 4:30 P.M.<br />\n•<br />\nNewman House will be closed for Easter Vacation<br />\nFriday. March 24th through Sunday, April 2nd.<br />\n<br />\nL._<br />\n<br />\n\f", "format": "basic_html", "processed": "18Truto rattrr<br />\nVOL. LXXI, NO. 14-<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, MARCH 17, 1967<br /><br />\n71ST YEAR<br /><br />\nStudents Favor<br />\nHopkins-Goucher Merger<br />\nDraft Deferments Deemed Unlikely At Present<br />\nIn a poll recently conducted those who plan to pursue careers<br />\nA News-Letter investigation \"highly rated\" music and fine<br />\nThe major purpose of this and<br />\nby the News-Letter on the Selec- in critical areas should be de- has revealed that recent rumors arts programs of Goucher would future<br />\ndiscussions are to explore<br />\ntive Service System, a significant ferred for post-graduate work. concerning an increase in the de- improve \"two areas in which methods for greater<br />\ncooperation<br />\nmajority of these students re- Surprisingly, Ys of the respond- gree of academic exchanges be- Hopkins could stand strengthen- between the two schools.<br />\nThe<br />\nsponding (550) voted for the ents said that no college grad- tween Hopkins and Goucher Col- ing.\" Goucher. he added, offers Baltimore Sun article completely<br />\nMaintenance of the present sys- uate should have to enter the lege are exaggerated.<br />\na full major in Russian \"while misinterpreted their significance<br />\ntem of student deferments.<br />\nGoucher President Otto the Hopkins program is limited.\" and mistakenly compared this<br />\nservices.<br />\n57% of the students answering<br />\nKraushaar, in a recent Baltimore<br />\nmeeting with the recently publiNon-Military Service Supported<br />\nMeeting Only Preliminary<br />\nthe poll felt that deferments<br />\nSun article, offered what he concized Yale-Vassar negotiations.<br />\nstudents<br />\nnumber<br />\nof<br />\nlarge<br />\nA<br />\nA single meeting has been held<br />\nshould be awarded to all students<br />\nsidered to be substantial reasons<br />\nNo Merger Planned<br />\ncollege sturegardless of university status. favored the option of<br />\nfor the increased need for co- between Dr. Milton Eisenhower,<br />\nThe Sun article stated that Dr.<br />\nmilitary<br />\ntheir<br />\nfulfilling<br />\ndents<br />\nOnly 18% desired the abolition<br />\nbetween the two President of Hopkins. and Dr. Kraushaar foresaw \"a<br />\noperation<br />\nsharing<br />\nOf across-the-board deferments. obligation through such organi- schools. The article cited the fact Otto Kraushaar, President of arrangement<br />\nnot unlike that<br />\nzations as the Peace Corps, that Hopkins is strong in the Goucher. This meeting was conStudents Favor Deferments<br />\nVISTA or the National Teacher sciences, while Goucher offers sidered very preliminary, with no contemplated by Yale University<br />\nIn regard to the awarding of<br />\nCorps. 73% voted for such a non- certain science courses that Hop- constructive programs or policies and Vassar College.\" Dr. KrauUndergraduate deferments, only<br />\nshaar was unavailable for comkins does not. He felt that the being formulated.<br />\n(Continued on Page 6)<br />\n44% voted for a deferment rement on this point.<br />\ngardless of class rank or achieveHopkins officials have emphament on the student selective<br />\nsized that there is no plan to<br />\nservice exam.<br />\nmerge the University and GouchOf those who felt that some<br />\ner College, and that any action<br />\nSort of criteria should be used in<br />\ntaken as a result of the present<br />\nthe deferment of college students,<br />\n1<br />\n2 million miles of the until the particles are small meetings would not change the<br />\nStudies by a Hopkins astro- within 2/<br />\nthere was an even split between<br />\nenough to be blown out of the status quo.<br />\nphysicist have resulted in the dis- sun.<br />\nthose favoring the use of class<br />\nRing Position<br />\nsolar system by radiation presa<br />\nbe<br />\nto<br />\nappears<br />\nwhat<br />\nHandholding in Library<br />\nrank as criteria and those voting covery of<br />\nThe halos, each estimated to be sure from the sun.<br />\nIOU the continued use of the se- series of, at least, four concentric about 100,000 miles thick; are<br />\nDr.<br />\nKraushaar emphasized that,<br />\nThis theory also implies that<br />\naective service exam as the basis dust-free rings, or halos, around spaced at irregular distances<br />\nhe was against a merger. He felt<br />\nonly<br />\nbodies<br />\nthat<br />\nare<br />\nof<br />\nthe<br />\norder<br />\nof deferment.<br />\nthe sun.<br />\nthat co-educational institutions<br />\nfrom the sun.<br />\nof several yards thick can be as<br />\nare endangered by the threat of<br />\nThe innermost-and hottest- old<br />\nFavor Johnson's Proposal<br />\nThe finding was made by Roas the solar system.<br />\nromance to education. \"Hand<br />\nPresident Johnson's recent bert H. MacQueen, a 29 year-old halo found thus far is located<br />\n1<br />\n2 million miles from the 4. The MacQueen experiment holding in the library,\" he obproposal that 19 year olds be postgraduate student at Hopkins, about 1/<br />\ndrafted first received support and has created great excitement sun. The outer-most, and coolest might indicate how the Poynting- served, impeded the major purfrom '70% of those responding. among solar physicists.<br />\nof the four halos, is located about Robertson effect works in prac- pose of the institution of higher<br />\ntice. Presumably various dust education.<br />\nWith the institution of such a<br />\n4<br />\nmillion miles from the sun.<br />\nSome solar experts are speThe tremendous number of difparticles containing some chemsystem, and the automatic defer- culating that some of the \"rings<br />\nInfra-Red Studies<br />\nment of all full-time college stuicals would vaporize at distances ferences between the two schools<br />\naround the sun\" detected by MacThe discovery of the rings was greater from the sun than dust has always loomed as a barrier<br />\ndents the Problem of whether or<br />\nQueen might be from the vapor- made during infra-red studies of<br />\nto really close cooperation. Adnot college students would ever<br />\nparticles of metallic iron.<br />\nization of debris carried into the the solar corona from a campmission standards for entering<br />\nserve was presented.<br />\nsystem by the Ikeya-Seki site atop a 13,000-foot-high mounThe experiments were carried freshmen and faculty require48% felt that college graduates solar<br />\nComet.<br />\ntain in the jungles of Bolivia dur- out as part of a program of the ments stand as the principal difshould have the option of furThat comet, named after the ing the eclipse of the sun, Novem- Hopkins Astrophysics and Physi- ferences.<br />\nthering their education or enlistThe Goucher Weekly in an aring. And should they do neither, two Japanese amateur astronom- ber 12.<br />\ncal Meteorology Department. Dr.<br />\nticle on the possibility of an<br />\nInfra-red studies made during John H. Strong is head<br />\nthey would be subject to the ers who discovered it, was visible<br />\nof<br />\nthat alliance, pointed out<br />\nthat Goucndraft. Only 12% supported the in the Baltimore area during Oc- the 21-mile-high flight of an un- department. Funds for<br />\nthe ex- er had closer ties<br />\nto the local<br />\nPresident's proposal that only tober of 1965 when it swept to manned balloon confirmed the periment were granted<br />\nby the community; while<br />\n\"Hopkins, on<br />\nrings' existence. The balloon was National Aeronautics and<br />\nSpace<br />\nlaunched January 12 from Pales- Administration. Two Hopkins the other hand, would rather be<br />\nbig with the State and Defense<br />\ntine, Texas.<br />\nstaff men, William Dalton and Departments of the<br />\nFederal GovDuring these two experiments, Donald McLeod,<br />\naccompanied ernment, ignoring the local Bab.<br />\nMacQueen said, infra-red equip- MacQueen to<br />\nBolivia.<br />\ntimore community.\"<br />\nment detected evidence of four<br />\n\"vaporization rings around the<br />\nsun.\"<br />\nMaybe Others<br />\nMacQueen<br />\nsuspects that there<br />\nStudents<br />\ndormitories<br />\neither<br />\nthe<br />\nwould be<br />\nThe Johns Hopkins<br />\nmay be other dust-free rings in<br />\nfor a Democratic Society released psychologically or emotionally<br />\nthe sun's corona which is now<br />\na report on March 15 calling for disadvantageous. The SDS proUniversity<br />\nposals<br />\nwould only require incom- thought to extend at least as far<br />\nthe abolition of the<br />\nas the earth's orbit—some 93<br />\nrequirement for freshmen to live ing freshmen to live in the dormillion miles from the sun. CurBy BRUCE DRAKE<br />\ndesire of a white pastor to build<br />\nin the dormitories. SDS sub- mitories during Orientation Week<br />\nrently, however, he has no idea<br />\nHopkins<br />\nwas the subject of a bridges between his all-white<br />\nstudent<br />\nthem<br />\nallow<br />\nother<br />\nmeet<br />\nto<br />\nreport<br />\nto<br />\nto<br />\nmitted the<br />\nhow such rings might be de- harsh attack in the<br />\ndiscnssions congregation and the Negro<br />\nleaders and Administration of- freshmen.<br />\ntected.<br />\nfollowing the showing of two community. The action centered<br />\nficials, including Dr. Eisenhower.<br />\nThere are many reasons why films dealing with the Negro on a militant black barber<br />\nThe Student Survey<br />\nThe report emphasized two<br />\nMacQueen's discovery has ex- crisis—A Time for Burning, and arguing with an uncommitted<br />\n139 dormitory residents replied cited<br />\nmain points: that students have<br />\nsolar physicists:<br />\nwhite who is eventually \"con,5/<br />\n1<br />\n2—Reflection of an Age.<br />\nthe right to influence University to the survey distributed the<br />\nThe participants Dr. Harris verted.\"<br />\nReasons<br />\nFor<br />\nExcitement<br />\npolicy, and that the University's week of March 6. While 65%<br />\n5V2 concerned a young boy,<br />\n1. It sheds new information on Chaiklin, Walter Carter, Rev.<br />\nrequirements are an infringe- felt that the dormitories had<br />\nthe distribution of \"matter\" in Robert Meisner, and Rev. Frank from a happy, middle-class<br />\nvalue<br />\nteaching<br />\nin<br />\none<br />\nto<br />\nlive<br />\nwith<br />\nment of the student's freedom of<br />\nwhat was until recently thought Williams criticized Hopkins for home, who faces the differences<br />\nchoice. The report's conclusions others, 53% stated that the overnot taking an active part in caused by his color. Walter<br />\nto<br />\nbe empty space.<br />\nwere based on interviews with all effects of the dorms were<br />\nbettering<br />\nsocial and racial re- Carter, a Baltimore social work2.<br />\nThe observed data suggests<br />\nthreeDean Shaffer, Dr. Desoto of So- disadvantageous. Over<br />\nlations.<br />\nIt<br />\nwas also observed that er, however, felt that the film's<br />\nthat<br />\nall<br />\nof<br />\nthe<br />\nsix<br />\nto<br />\neight<br />\nlaboricial Psychology, Dr. Stinchoombe quarters of the students in- ously<br />\nBaltimore<br />\nhad hosted no sub- failing was due to the fact that<br />\ncalculated<br />\ntheoretical<br />\nof Sociology, and a survey of dicated. that the dorm atmos- models<br />\nstantial<br />\ncivil<br />\nrights movement. the boy was atypical of the<br />\nof \"thermal emission<br />\nphere was depressing and 59%<br />\ndormitory students.<br />\nSome<br />\nfelt that Hopkins, as a Negro community since he came<br />\nfelt their social life was re- characteristics of the sun's<br />\nleading institution, had a duty to from a middle-class family.<br />\nShaffer Defends Policy<br />\nhave<br />\ncorona\"<br />\nwill<br />\nto<br />\nbe<br />\nrevised.<br />\nstricted.<br />\nMeisner Analyses Reasons<br />\n3. The MacQueen experiments meet such challenges.<br />\nWhile conceding that there is<br />\nAnother guest, Irev. Robert<br />\na \"psychological advantage\" in If a choice was given, 48% in- offer observational verification<br />\nHopkins Criticized<br />\nmaking one's own choice, Dr. dicated that they would have of what is called the \"PoyntingBoth the Administration and Meisner, who is currently tryShaffer felt that the requirement lived off-campus. About three- Robertson\" theory of solar phy- the student body were scored. ing to integrate an all-white<br />\noffered a \"decided advantage in quarters of those who replied sics, named after John H. Poyn- The University was charged with church here, suggested two reathe introduction of boys to an claimed that they could have ting and H. P. Robertson—two only taking action when pressure sons underlying the Negro<br />\ncrisis; that white people do not<br />\nacademic scene.\" Dr. Stinch- lived off-campus without detract- British physicists,<br />\nwas placed. Others observed that<br />\ntry to know Negroes personally,<br />\ncotnbe and Dr. DeSoto disagreed ing from academic performance<br />\nPredicts<br />\nShrinkage<br />\nthe<br />\nHopkins<br />\ntook<br />\nstudent<br />\nbody<br />\nand that the distinctions of soon the alleged sociological and or having any adjustment probIt predicts that as particles little interest in these affairs outpsychological benefits of the lems. 58% believed that the re- of dust, presumably brought into side of the tutoring project now cial class aggravate the problems<br />\nquirement<br />\nshould<br />\nof race.<br />\nbe<br />\nabolished.<br />\ndorms.<br />\nthe solar system by comets or operating.<br />\nDr. Harris Chaiklin is from<br />\nA major SDS contention was<br />\nA limited number of the SDS meteors, spiral toward the sun<br />\nA Time for Burning, filmed on the University of Maryland. and<br />\nthat the policy discriminated report will be made available to the particles will gradually<br />\nthe spot while the action was Rev. Frank William is of the Itsagainst the minority for whom students today.<br />\nshrink in size due to heating happening, originated with the<br />\nterdenominational Alliance.<br /><br />\nSolar Rings Detected<br /><br />\nS. D. S. Challenges<br />\nBinding Dorm Rule<br /><br />\nHopkins Scored<br />\nFor Race Attitude<br /><br />\nHOMEWOOD, BALTIMORE, MARCH t7, 1967<br /><br />\nNEWS -LETTER<br /><br />\nPAGE TWO<br /><br />\n11 SA C ilmbines<br />\n[ Fun Nith Films<br /><br />\nCAMPUS NOTES<br />\nHill is an expert on the history<br />\nSC Elections<br />\nand sociology of American rePetitions for the Student<br />\nAt 8:30 p.m. tomorrow night<br />\nCouncil Presidential Elections<br />\nShe JHU Concert Band under ligious thought and indigenous<br />\nwill be available on April 3 and<br />\nthe direction of Conrad \"Gebby\" American religious bodies.<br />\n4 at the SAC office from noon<br />\nGebelin will present its 1967<br />\ntill one. They will be due back<br />\nSpring Concert in Shriver Hall.<br />\nOrientation Chairman at<br />\nthe office by one o'clock on<br />\nWhere will be no admission fee.<br />\nAny Sophomore or Junior April 7. Two elections will take<br />\nFeatured in the concert will be wishing to serve as the Orienta- place on April 13 and 14.<br />\nthe first public performance of a tion Chairman for 1967, please<br />\nnew concert march, Homewood, contact Bill Reinsch by note Discount Books Available<br />\ncomposed by \"Gebby\" and dedi- (Box 1190). Include your name,<br />\nThe Student Council Discount<br />\ncated to Dr. W. Kelso Morrill, re- box number, and telephone cards and booklets for the<br />\nthing Dean of Students on the number.<br />\nWashington, D.C. area are now<br />\nHomewood Campus.<br />\non sale for 25 cents. They can<br />\nSA Film Series<br />\nbe purchased from Student<br />\nFreshman Jay Brown will be<br />\ncoronet soloist in Bugler's HoliSunday night the SA .film Council Representatives, dorm<br />\nday.<br />\nseries will present \"Mary's Day\". presidents, fraternity presidents,<br />\nThe film, made by Sister Mary and at Levering Hall from<br />\nReligion Discuss;On<br />\nCorita, and Baylis Glascock, de- 11:30 to 1 P.M.<br />\nThe offer is open to both gradDr. Samuel Hill, Chairman of picts the celebration of Mary's<br />\nthe Department of Religion, Day in California. Dr. Wickwire uate and undergraduate stuUniversity of North Carolina, has said that \"It's a swinging dents. Included are discounts<br />\nwill discuss \"Ferment in Con- film,\" and added that it con- ranging from ten to twenty-five<br />\ntemporary Religious Life,\" March trasted the Beatles to the Gre- per cent on such items as liquor,<br />\nmovie tickets, food, records and<br />\n22 at 4 p.m. in Levering Hall. Dr. gorian Chant.<br /><br />\nBond Concert<br /><br />\ngasoline, as well as special<br />\ncoupons that entitle the bearer<br />\nto free meals at some of Washington's better restaurants.<br />\nThis bargain is meant as an<br />\nintroduction to the discount program that will be available to<br />\nHopkins students in the Fall.<br /><br />\nThe SA will sponsor a moviemixer tonight with the prize<br />\nwinning films from the Maryland Institute of Art's student<br />\nart festival. The movies will start<br />\nat '7:30 p.m. and the mixer at<br />\n9 p.m.<br /><br />\nAdmission to the mixer will<br />\nbe free to SA members and girls<br />\nThe Fifth Annual High School with<br />\ncollege IDs. Others will be<br />\nDebate Tournament sponsored<br />\ncharged fifty cents. The movies<br />\nby the Johns Hopkins University will<br />\nbe free.<br />\nwill be held on March 18 at<br />\nAvant-Garde Films<br />\nLevering Hall from 9' am to 5<br />\nThe films will be: 1) Last<br />\np.m.<br />\nIt will be the largest tourna- Thursday Night by John Strickment in Hopkins' history, with ler of New York University. a<br />\nforty-four schools represented motorcycle romp through New<br />\nfrom Pennsylvania, Maryland, York City and the first prize<br />\nVirginia, and the District of Co- winner in the 16 mm category;<br />\nlumbia. The topic of debate will Chantilly Lace by Jean Dellan,<br />\nbe. Resolved: \"That the foreign a hand drawn animated filni!<br />\naid program of the United States creating image patterns and secshould be limited to non-military ond place in 16 mm; Pretty Face<br />\nwith live shots and photos creatassistance..\"<br />\ning a collage of a woman's face;<br />\nMM by Robert Farquharson, a<br />\nfilm dedicated to Marilyn Monroe; all from Rhode Island Institute; Images front Space by<br />\nDale McKinney. Professor ot<br />\nArt, Oklahoma State University,<br />\nImages for space symbolizing the<br />\nlife and death of a planet and<br />\nfirst prize winner in 8 mm; and<br />\nassorted shorts.<br /><br />\nDebate Tournament<br /><br />\nIf Mexico and Bermuda send you,<br /><br />\nwe'll send you posters of Mexico and Bermuda.<br />\n3 for $1.50.<br />\nThe diver of Acapulco. The torero of Mexico.<br />\nThe sleek racing craft of Bermuda.<br />\nAll three 30\" x 40\" posters are beautifully<br />\nreproduced in color. And they're all yours for<br />\nonly $1.50.<br />\nWe think you'll like them so much, you'll<br /><br />\n\"GRANTED THE PROPRIETY of CIA activity in the field of international student affairs,it might still have seemed<br />\nto the public and to Congress, if the<br />\n, facts had been openly before them,<br />\nMat some other campus organizations<br />\nbesides NSA should have shared in<br />\nthe largesse,and that among the young<br />\nLochinvars sent to do battle in the international conclaves a few hard antiCommunists and even an occasional<br />\nenthusiastic proAmerican might<br />\nFor a free copy of tho<br />\ncurrent issue of NA.<br />\nhave been inTIONAL<br />\nREVIEW, write<br />\ncluded.\"<br />\nto Dept. CP-1, 150 E.<br />\n35 St., N. Y. 16, N.Y.<br /><br />\nwant to go to Mexico and Bermuda some day.<br />\nAnd when you do, we hope you'll go on<br />\nEastern.<br />\nSo don't just sit there staring at four blank<br />\nwalls. Fill in the coupon below and send for<br />\nyour colorful posters now.<br /><br />\nCOMING TO<br />\nNEW YORK?<br /><br />\nEASTERN<br />\nWe want everyone to fly.<br /><br />\n1 .<br /><br />\n835<br /><br />\nTo: Eastern Airlines, Inc., Poster Offer, Box 4211, Grand Central Station, New York, N.Y. 10017<br />\nPlease send me the Bermuda, Acapulco, and Mexico posters, for which I enclose a $1.50 money<br />\norder or check (payable to Eastern Air Lines, Inc. Poster Offer).<br />\nMARE WILLIAM SLOANE HOUSE YMCA<br />\nYOUR HEADQUARTERS IN N.Y.C.<br /><br />\nAddress<br />\nCity<br /><br />\nState<br /><br />\nI would also be interested in receiving a Youth Fare Applic‘6on.<br /><br />\nCode<br /><br />\nREASONABLE • COMFORTABLE • CONVENIENT<br />\nSave money. Go further. Stay<br />\nlonger. The William Sloane House<br />\nYMCA has 1491 rooms available<br />\nto men, women and groups, sensibly priced at $3.15-$4.60 single;<br />\n$5.00-$5.20 double. Rates include<br />\nYMCA membership. Enjoy conven•<br />\nient transportation to everything.<br />\nCoffee Shop • Cafeteria • Laundry<br />\nBarber Shop • Check Room<br />\nTailor • Sightseeing • TV Room<br />\nInformation<br />\nREQUEST BOOK LET<br /><br />\nE3<br /><br />\n354 WEST 34th ST<br />\nNEW YORK. Mr.1000L<br />\nOX 55133<br />\nON 34th STREET 1 BLOCK FROM<br />\nPENN STATION<br /><br />\nWILLIAM<br />\nSLOANE<br />\nHOUSE<br />\nYMCA<br />\nNOW COED<br /><br />\nJOHN P. NUGENT, JR.<br />\nLife &amp; Health<br />\nInsurance<br />\nCompare<br /><br />\n243-7961<br />\nWe need your bead In our<br />\nbusiness<br /><br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie'.<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nNEWS -LETTER<br /><br />\nPAGE THREE<br /><br />\nHopkins'QuestFor Culture;<br />\nLinkletter ToSpeak in April<br />\nBy STEPHEN SHRIVER<br />\nArt Linkletter. the renowned<br />\nradio and television personality,<br />\nWill speak here on April 4th as<br />\npart of his continuing \"dialogue\"<br />\nwith American college students.<br />\nLinkletter will appear at Shriver<br />\nHall at 4 p.m. under the sponsorship of the Hopkins Student As-,<br /><br />\nsociation.<br />\nThe topic of his talk, to be<br />\nfollowed by a question-and-answer session, will be \"The Entertainer And Politics.\" It will be<br />\nopen to all students and the public without admission.<br />\nLinkletter Tour<br />\nLinkletter is touring the na-<br /><br />\nSex Talk To Come<br />\nDr. Graham B. BlaMe, Chief<br />\nof Psychiatry, Health Service,<br />\nHarvard University, will speak<br />\non \"Stress and Distress in College\" this afternoon in Levering<br />\nHall at 4 p.m. The lecture is<br />\nsponsored by the Student Association.<br />\nDr. Blaine will stress sex behavior, identity formation, and<br />\nindependence vs. dependence in<br />\nhis address. He will have an informal dinner discussion afterwards with members of the administration, faculty, and clergy<br />\nconcerning the responsibility of<br />\nthe University and the Church<br />\nto the college student.<br />\nExpert in Student Behavior<br />\nThe psychiatrist, an expert in<br /><br />\nthe field of student behavior, has<br />\nrecently published articles on<br />\n\"College Students and Moral<br />\nValues\", \"Motivation and Attitudes of Youth\", and \"Emotional<br />\nProblems of the Students.\"<br />\nBlaine took his M.D. from Columbia College of Psychiatrists<br />\nand Surgeons in 1943 after attending Harvard as an undergraduate. He is a member of the<br />\nNew York Academy of Medicine.<br />\nChairman of the Professional<br />\nPolicy Board, the Academy of<br />\nReligion and Mental Health, a<br />\nmember of the American Psychiatry Association and the<br />\nMental Hygiene Committee of<br />\nthe American College Health Association.<br /><br />\nSUMMER COUNSELORS<br /><br />\nSENIOR LIFE GUARDS<br /><br />\nFOR WESTERN Y.M.C.A.<br /><br />\nNeeded at Western Y.M.C.A.<br />\nSat. from 9 A.M. to 4 P.M.<br />\nApril, May and June.<br />\nContact:<br />\nMr. Kaufman, Room 108, Md.<br /><br />\nContact:<br />\nMr. KAUFMAN, Room 108<br />\nMaryland Hall<br /><br />\ntion's colleges wider the auspices<br />\nof the Royal Crown (Cola) University Series. The series is described as \"Art Linkletter and<br />\nthe American Student: A Dialogue.\"<br />\nThe \"free-wheeling\" questionand-answer sessions provide the<br />\ngist for the \"dialogue.\" Mr. Linkletter finds these both challenging and heartening.<br />\nThe 1962 \"Grandfather of the<br />\nYear\" (he is responsible for five)<br />\nis an expert speaker. For twenty<br />\nyears he has regularly moved millions through such formidable<br />\nprograms as \"People Are Funny\"<br />\nand \"Art Linkletter's House<br />\nParty.\"<br />\nHe is also a political activist. A<br />\nstaunch defender of the actor's<br />\nright to turn politician, he<br />\nstresses the importance of television in \"making\" a politician.<br />\nUnafraid to express his political<br />\nopinions, Mr. Linkletter is also<br />\nwell suited to follow his tubeteasers, Lightfoot Murphy and<br />\nTough Ronnie. into the political<br />\nHouse Party.<br />\nBiC Medium Point 194<br /><br />\nif she doesn't give it to you...<br />\n—get it yourself!<br /><br />\nA WEEK<br />\nOR MORE<br />\nTHIS SUMMER* WITH<br /><br />\nINC Fine Point as.<br /><br />\nJADE E45t,<br />\n.•<br /><br />\n•<br /><br />\nJr E' EAST<br />\n\"<br /><br />\nCologne. see.. 64.50<br />\nAfter Share.6 or, $3.50<br />\nDeodorant Stick. $1.75<br />\nBuddha Cologne Gift Package, 12 oz.,$430<br />\nSpray Cologne. $3.50<br />\nBuddha Soap Gift Set, $4.00<br />\nCologne,4 oz.. $3.00<br />\n—<br />\nAfter Shave.4 oz., $2.50<br />\nSWANK, NEW YORK - 30LE DISTRMOTOR<br /><br />\nDespite<br />\nfiendish torture<br />\ndynamic BIC Duo<br />\nwrites first time,<br />\nevery time!<br /><br />\n2<br /><br />\nGood Humor<br /><br />\ntuc's rugged pair of<br />\nstick pens wins again<br />\nin unending war<br />\nagainst ball-point<br />\nskip, clog and smear.<br />\nDespite horrible<br />\npunishment by mad<br />\nscientists, Bic still<br />\nwrites first time, every<br />\ntime. And no wonder.<br />\nBies \"Dyamite\" Ball<br />\nis the hardest metal<br />\nmade, encased in a<br />\nsolid brass nose cone.<br />\nWill not skip, clog<br />\nor smear no matter<br />\nwhat devilish abuse<br />\nis devised for them<br />\nby sadistic students.<br />\nGet the dynamic<br />\nSIC Duo at your<br />\ncampus store now.<br /><br />\n,<br /><br />\nThese Colleges<br />\nHad Students<br />\nWith Even<br />\nHigher Earnings:<br /><br />\nSW'<br />\nS<br /><br />\n•<br />\n5:<br />\n:<br />\n:0<br />\n4 14<br />\n53C<br />\nj:<br />\n..vs<br />\n:::<br />\n16<br />\ns:::::$144:141::::1:<br />\nto.••‘‘‘<br /><br />\nN. Of. 16%1<br />\n4144<br /><br />\n-uretr<br /><br />\nCot,ect::::: sr*: c-0,<br />\nE ssry**4 162 5:GAN<br />\nla .:<br />\nsee<br />\n;.•<br /><br />\n000641 OC<br />\nbi<br /><br />\nU I y of<br />\n- f701051<br />\nsui_fp,<br />\nst.<br />\n10 $14\"i<br />\n:<br />\n.<br />\n5083<br />\n\"<br />\nscis o<br />\nC 4<br />\n07<br />\n31<br />\nCU<br />\n1G% $.9.1\"<br />\n.<br />\nSfrUtil:<br />\n:<br />\n\"<br />\n40\"<br />\nUIN<br />\nIII: (<br />\n:1<br />\nt .<br />\n64<br />\n2.2$114671\":<br />\nil:<br />\nlb:<br />\nC1'<br />\n.<br /><br />\n.<br />\n•<br />\n00.0„4. ot • cc,c -s<br />\nt<br />\n040._<br />\n,<br />\n10<br />\nu'e\" 0 co<br /><br />\nfrf-r<br />\n4.1;c<br /><br />\n.<br />\nPots<br /><br />\n'QM%<br /><br />\ncot<br />\nJOHN'S ViviveRsirY-$1574111<br /><br />\n5 LOYOLA UMW. ItkicAC01::.741103-46,<br />\nca<br /><br />\n\"cikl:i:4‘.°Li‘fikC'°4<br /><br />\nt<br />\npo 4<br />\n$1012 • •-• g,34<br />\n%UMW.:1151.35 •<br />\nImitytims- $2111 II • $N11.14<br />\nOf<br />\nUkiv.<br />\n\"<br />\nfer<br />\nwinvot6<br />\ns1<br />\n::::4c4;°* ref. 61. 1167<br />\n41::<br /><br />\nNo experience needed. You are<br />\nfully trained and work on routes<br />\nwith proven high earnings.<br /><br />\nh.i.s. classic corduroy<br />\ncampus casual sport coat<br />\nIn the new bronze or<br />\nwhiskey shades.<br />\n22.95<br /><br />\nNothing to invest ... everything you need is supplied free.<br /><br />\nHOW TO QUALIFY FOR INTERVIEW<br />\n1. Minimum age 18.<br />\n2. Need a valid driver's license and be willing to drive a<br />\nclutch transmission.<br />\n3. Be in good physical condition.<br /><br />\nCHARGE YOURS!<br /><br />\nREGISTER NOW<br />\nAsk your Summer Placement Director or Student Aid Officer<br />\nto show you Good Humor's folder explaining this high paying<br />\njob and to schedule you for our campus visit.<br /><br />\n•<br /><br />\nopen thurs., fri., &amp; sat.'<br />\ntil 9<br />\n-<br /><br />\ntt/Z:v* c'r Ft<br />\n:•••<br /><br />\n,00f•<br /><br />\ntadei<br /><br />\nMEN'S WEAR<br />\n516 S. Broadway<br /><br />\ntirr .11<br />\n/<br />\n4<br /><br />\ntrn<br />\nr W<br /><br />\nWATERMAN-SIC PEN CORP.<br />\nMILFORD. COWS<br /><br />\nhen's<br /><br />\n.<br />\n:<br />\n:11.:<br />\n1:<br />\n1.3t:::<br />\n::<br />\n,;<br />\n°<br />\n1<br />\nv<br />\n:1<br />\n:<br />\n4<br />\n!<br />\n115.<br />\n;<br />\nE<br />\nrt<br />\n,rs.t. :<br />\n13* .3<br />\n4114<br />\n1<br />\n.1*<br />\n,:-•<br />\n';\":<br />\n,<br />\n1.4:<br />\n0‘:<br />\n4.<br />\n....<br />\n;<br />\n1-1<br />\n•<br />\n°<br />\n:i<br /><br />\n,<br /><br />\nAvailable at<br /><br />\nI<br /><br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\n1<br />\nGILMAN HALL<br /><br />\n*Earnings for females have not approximated this average in most<br />\ncases<br />\ndue to legal restrictions on working hours for women.<br />\nAn Equal Opportunity Employer-(M/F)<br /><br />\nPAGE FOUR<br /><br />\nSweetie Pie<br /><br />\n01le 31ollus inpkiiis Nem-triter<br />\nEditors-in-Chief<br />\nRoger C. Toll<br />\nPeter J. Koper<br />\nTHE BOARD OF CONTROL<br />\nManagers<br />\nBusiness<br />\nJames N. Franke<br />\nDavid S. Cooper<br />\nExecutive Editor<br />\nManaging Editor<br />\nM. Hocherma.n<br />\nHenry<br />\nJoseph A. Weinberg<br />\nAssociate Editors<br />\nMichael J. Phillips<br />\nLuchow<br />\nP.<br />\nJed<br />\nElla J. Katz<br />\nSports Editor<br />\nFeatures Editor<br />\nNews Editor<br />\nJames C. Sloan<br />\nMurray J. Rudnick<br />\nDavid A. Schneiderman<br />\nng Editor<br />\nContributi<br />\nCopy Editor<br />\nNeil A. Grauer<br />\nDennis A. Estis<br />\nPhotography Editor<br />\nRichard Hammond<br />\nAssociate Staff<br />\nChief<br />\nJohn Thornton_ . •<br />\nGerald<br />\nReporters<br />\nDrake, William Patten. Howard<br />\nNews: Michael Abrams, James Davis, Bruce<br />\nBond.<br />\nR. Clarke: Features: Kenneth W. Jeff<br />\nGraeme<br />\nShriver,<br />\nStevens, Stephen<br />\nBaron Wormser: Sports:<br />\nSeth Feldrnap, Ron Teeter, Doug Wanken,<br />\nPeter Harnik, Menacham<br />\nLauren, Steve Putnarni Steve 01love; Copy:<br />\nRosensaft.<br /><br />\nEnjoy, Enjoy<br />\ncome to our<br />\nWe are the new News-Letter staff. We<br />\ns concepts<br />\npositions knowing the existence of nebulou<br />\nvity\" and \"good<br />\nsuch as \"responsibility\" and \"objecti<br />\nconcepts.<br />\ntaste.\" We will not attempt to define these<br />\nbe the \"rewill<br />\nRather, our collective consciences<br />\nwill be the<br />\nsponsibility\" we carry, our existential virtue<br />\nwill be<br />\ning<br />\n\"objectivity\" we perceive, and our upbring<br />\nthe \"good taste\" we employ.<br />\nMacDonald's<br />\nWe will adhere to the spirit of Dwight<br />\nis done by<br />\nthat<br />\n-writing<br />\nism<br />\njournal<br />\ndefinition of amateur<br />\nents. We will<br />\ntemperm<br />\nsimilar<br />\nwith<br />\npeople<br />\nfor<br />\npeople<br />\nit should be<br />\nserve our community in the way we think<br />\nserved.<br />\npolitics.<br />\nWe have no policy and indulge little in<br />\nand ince,<br />\nignoran<br />\ne,<br />\ninjustic<br />\nat<br />\nd<br />\nWe will be outrage<br />\nmotto,<br />\nty<br />\nUniversi<br />\nflexibility. Because we subscribe to the<br />\ns—<br />\nhappen<br />\nwhat<br />\nprint<br />\nwill<br />\nVeritas %roe Liberabit, we<br />\nbribes.<br />\nor<br />\npleas,<br />\ne,<br />\npressur<br />\nregardless of<br />\nas<br />\nWe will create constructive chaos with humorand<br />\ncharm,<br />\nshock,<br />\ntickle,<br />\n,<br />\n'enrage<br />\nour tool. We hope to<br />\nactivate our readers.<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nNEWS -LETTER<br /><br />\nSheep's Time To Awaken<br />\nBy GERALD BRECHER<br />\nProfessor John Roche, President Johnson's Egghead-in-residence at the White House, once<br />\nremarked that we would have<br />\nno real opposition to the war in<br />\nViet Nam if we'd only stop drafting sons of the upper-middle<br />\nclass. This is a remark that<br />\nmakes a great deal more sense<br />\nthan it would seem, once we<br />\nrealize that virtually all the<br />\nadult opposition to the war<br />\ncomes from the afore-mentioned<br />\nsocial class, and that of the<br />\nyounger people from their children. Prof. Roche is merely suggesting, and correctly, I would<br />\nsubmit, tha•t one of the greatest<br />\ncomponents of the dissent over<br />\nthe war is the fear of the draft<br />\nby a group of people who have<br />\nthe most to fear from it.<br />\nIt's really quite simple. Without the war in Viet Nam, the<br />\ndraft is really not a factor in<br />\ntoo many people's lives. With the<br />\nwar being maintained at its present level, however, no one is<br />\nreally immune from draft pressures. Now with the poorer segments of the population, the<br />\nArmy has always been a healthful and welcome respite from the<br />\ndrudgery of a marginal existence. It's for damn sure that the<br />\naverage Black from South Baltimore isn't about to get the opportunity to travel to places like<br />\nOkinawa or Seoul, or Stuttgart<br />\nwithout the kind services of the<br />\nG.I. travel agency.<br /><br />\nWe admit that the pay is not<br />\nall that great. But, then again,<br />\nthe bulk of the draftees weren't<br />\ndoing all that better on the outside anyway; and besides, the<br />\nfringe benefits, as we have<br />\npointed out, are well worth the<br />\ncut in cash pay.<br />\nThis is all very nice: very nice<br />\nthat is, if your future isn't about<br />\nto be too very exciting—you<br />\nknow, sort of the same shoddy<br />\nlife your folks have been living for generations. Very nice—<br />\nif your ambitions don't run any<br />\nfurther than a 'good' job at a<br />\nhundred and a half a week, a<br />\ncheap house in a lousy suburb,<br />\nand the same for your kids, and<br />\nhopefully theirs as well.The Army<br />\ncan't hurt you then; except<br />\nmaybe you might get killed. But<br />\nthat's the risk you run, and<br />\nyou'll be defending our country—<br />\nall that jazz. It'll be a good experience.<br /><br />\nBroadening Experience<br /><br />\nUniversal Unfairness ...<br />\ngreat<br />\nThe draft has proven to be one of the<br />\ns to<br />\npurport<br />\nwhich<br />\nanachronisms of our time. hi a nation<br />\nall,<br />\nfor<br />\nrights<br />\nequal<br />\nand<br />\ncy<br />\ndemocra<br />\nbe the strongbed of<br />\ndraft in<br />\nthe<br />\nof<br />\nbias<br />\nnatural<br />\nthe<br />\nthat<br />\nshown<br />\nbeen<br />\nit has<br />\nlower class<br />\nthe past is against negroes, youths of the<br />\nor finanmental<br />\nfor<br />\ncollege<br />\nattend<br />\nto<br />\nunable<br />\nand others<br />\ncial reasons.<br />\nwe<br />\nWe abhor the fact that this has existed, and<br />\nsteps to<br />\ntaking<br />\nfor<br />\nsion<br />\nCommis<br />\nl<br />\nMarshal<br />\nthe<br />\napplaud<br />\nmethod<br />\ninitiate a random selection system, \"the only<br />\nnt<br />\nPreside<br />\nas<br />\n,\"<br />\nfairness<br />\ne<br />\ncomplet<br />\nhes<br />\nhieh approac<br />\non<br />\ndefiniti<br />\nby<br />\nwhich<br />\nJohnson has said. Any draft system,<br />\nhis<br />\nwithout<br />\nservices<br />\narmed<br />\nthe<br />\nforces a person to enter<br />\nng<br />\npersonal volition, is naturally unfair. But this reasoni<br />\nnoning<br />\ndemand<br />\nvery<br />\na<br />\nserves little purpose; we are in<br />\nwar, and as long as the government wishes to pursue<br />\nin it, we are but their pawns.<br />\nThe most significant problem of the draft which<br />\nfaces Congress now is what to do with undergraduates.<br />\nEveryone seems to agree that the best soldier—which we<br />\nand<br />\ntake to mean he who can be most easily molded<br />\nwho values his life the highest—is the 19 year old. This<br />\nwe agree with, not for the above reasons, but rather because it would cause the least interruption of his life.<br />\nHopefully, after his two year service he would be ind him through the<br />\nclined to use the scholarship afforde'<br />\nG.L Bill to further his education.<br />\nBut there are many 18 and 19 year olds—presumably the bulk of Hopkins students are or were in<br />\nthis category—who plan to earn Ph.D.'s, a goal which<br />\ndemands 8 to 10 years of their lives. They are the one<br />\npercent of our population, the mentally privileged. They<br />\ncan not afford an added two years of what would be<br />\nwasted time.<br />\nIf this one percent elite should in fact be deferred<br />\nfrom the draft, the only feasible way to achieve it is<br />\nthrough a challenging and demanding set of exams.<br />\nThis does not mean the infamous and fatuous \"war<br />\nboards\" of the last two years, but rather something in<br />\nthe line of comprehensive exams in a person's major<br />\narea of stiffly, whether it be medicine, dentistry, or<br />\nEnglish.<br />\nThis is an \"elitist\" view, but applicable only for<br />\nthose capable of earning a Ph.D. degree. Educational<br />\ndeferments are now held by 1.7 million students. Under<br />\nthe suggested system above, only about 200,000 deferments would be awarded. Everyone else would be included in the pool of eligible men at 19, and would have<br />\nto serve if chosen. Only after their two years were<br />\nfinished would they be able to pursue the luxury of a<br />\ncollege education.<br /><br />\ncan look forward to the fabled<br />\n'year off' anymore? A guy can't<br />\neven ski bum for six months<br />\nwithout his draft board sending<br />\nhim friendly greetings and pesky<br />\ninduction notices. Really, if a<br />\nguy can't enjoy the greatest asset of economic well being, leisure time, then what's the point<br />\nof having the dough to begin<br />\nwith?<br />\nOur beloved President makes<br />\na big deal of making the draft<br />\nFAIR. But let's just realize who<br />\nthe draft is really unfair to. It's<br />\nnot the slum kid who's getting<br />\nthe raw deal out of the Army.<br />\nHell, the Army can't be any<br />\nworse than where he came from<br />\nin the first place. But for the Big<br />\nNoise from Winetka or Shaker<br />\nHeights or Grosse Pointe or<br />\nGreat Neck, the draft is a royal<br />\nshaft. The Army is very simply,<br />\na drag. You don't get anything<br />\nout of it. You don't really do<br />\nanyone any good by being in it,<br />\nand conceivably, you could really<br />\nget screwed up by the whole<br />\nthing. Who needs it, really?<br /><br />\nthe two years just for themselves.<br />\nAnd don't forget, when you get<br />\nout, the uniform is just the<br />\nthing to wear around the gas<br />\nstation or the warehouse. The<br />\nmilitary look and all that; tres<br />\nchic, you know.<br /><br />\nIt's Unfair<br /><br />\nPain in the Neck<br />\nHowever, there are a few people in the country for whom the<br />\ndraft is a giant sized pain in<br />\nthe neck. And these are the<br />\npeople about whom Prof. Roche<br />\nIs talking. You see, these kids<br />\nhave already done their traveling abroad. They've already had<br />\ntheir share of dormitory living—<br />\nor at least they've gone to sleep<br />\naway camp, for God's sake. They<br />\nhave lots of nice clothes; and<br />\nif they need to look military.<br />\nthey can bop down to Limbo, or<br />\nup to the attic and cull from<br />\nDaddy's old officer's uniforms.<br />\n(What is this enlist man jazz,<br />\nanyhow?)<br /><br />\nThe Army is, if you come from<br />\na pretty dull background to start<br />\nwith, a real broadening experience. I mean, if you haven't gone<br />\nto boarding school, where else<br />\nwill you learn the virtues of<br />\ncommunal living? Army uniFor these kids the draft ruins<br />\nforms are glamourous additions<br />\nto any man's wardrobe, and as their education, and worse, ruins<br />\nfree items are definitely worth their vacations. After all, who<br />\ni<br /><br />\n71-1E NEW<br />\nDRAFT PLAN—<br />\not:t.\"viET KAM<br /><br />\no<br />\nil)0<br /><br />\n,•;•;;;t!ii,ii!N;((,,11.1,<br /><br />\n(A).2 muted<br /><br />\nIQ- YEAR-ot-PS woo/.Co<br />\n8E1644r Et 1 Gi BIC FOn<br />\nYNE DRAFT Mil YEAR<br /><br />\nA<br />\noY<br /><br />\n5oo,o00<br />\n144Dut.t) pe<br />\nPisquAlIF/ED<br />\n&amp;IR PN'AS C t.<br />\nR<br />\nTA !—<br />\nREA'S<br /><br />\n(0)<br />\nbF Ti<br /><br />\npid /0<br /><br />\n(E)<br /><br />\n1-14E<br /><br />\ntr,11, t,<br /><br />\n/-7-:<br /><br />\nRoOLETTE it<br /><br />\nLEAkitt46goctoos<br />\nSUBJECI To<br /><br />\n'1,;(11,<br /><br />\nIt's obvious to anyone with<br />\nhalf a brain that the whole idea<br />\nof a draft at all is unfair. You<br />\nknow, involuntary servitude and<br />\nall that. If the President thinks<br />\nthat extending the draft to get<br />\njust about anyone with some hit<br />\nor miss lottery is making the<br />\nthing FAIR, he has got his<br />\nhead. ...<br />\nThere is an answer to it all,<br />\na rather extreme answer to be<br />\nsure—but in this case, it seems<br />\nwarranted. The only reason the<br />\ndraft exists, in any form at all,<br />\nis because you sheep out there<br />\njust resignedly go off and accept it. Rather than sit and bitch<br />\nlike a bunch of cry-babies about<br />\nyour damn deferments, if Lord<br />\nHelp Us, you should get a nasty<br />\ninduction notice, just quote then<br />\nin reply what dear Stokely said<br />\non National T.V. \"Hell, no!\"<br /><br />\ntif14 4(<br /><br />\nvim<br /><br />\nHE)) A *AR<br />\nr(11<br /><br />\nNELDO) MC411<br /><br />\n401 root<br />\nIELECTI\"<br /><br />\nC°01-1<br />\n'<br />\nFE ExPEcTED To<br />\nBC voLuoitcR5<br />\nPR P.C5(\"515<br />\n100100D<br /><br />\npurr<br /><br />\nC)isAvn461.5 miwoo<br /><br />\n/)<br />\n147<br />\n(03oo,000<br />\nWOULD HAVE.<br />\n-113<br />\nDRAM,<br />\nTh SATiSFY nir<br /><br />\nQuer/1<br /><br />\n(C.T)LeAv 0165'00,000<br />\nup roocsit).<br />\n6r cauksc,<br />\n(<br />\n°NC OF 111101)<br /><br />\n11000101011011111111(141(0111(SHitinhitilittigNIIIVAIS11111(1114rilltirT;m1111. • •<br /><br />\n11111114414110111411401(0110114141(11441111(111441001(41111401141Wilaili11111(141111410141101111110111111114(1141111ilit141100111110111111i11111<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nNEWS -LETTER<br /><br />\nI The Near Great University<br /><br />\n4<br /><br />\n•<br /><br />\nPAGE FIVE<br /><br />\nGreenwood<br />\nHomewood<br />\nSchemewood<br /><br />\nBy SETH FELDMAN<br />\nings as well as outside. Lecture freshman before he be allowed<br />\nJeremey Richards found that halls were used as warehouses to attend classes. A workable<br />\nIt was possible to fall asleep for pennants, pins and beer honor code was pressed into<br />\nunder a tree in Keyser quad. And mugs. Soon classes were su- effect and so respected that soon<br />\ndid.<br />\nspended altogether so as not to one third of the student body<br />\nOnce upon a time the dream- interrupt school activities. Soon found itself accused of cheating off a second third—the aced) there was a near great uni- everyone was drafted.<br />\n\"Another failure,\" said the cuser being the third third.<br />\nversity in the heart of a great<br />\nBy MURRAY RUDNICK &amp;<br />\nscenes abounded.<br />\nrun down city. One reflective king. \"Bring on the third re- Courtroom<br />\nELIA KATZ<br />\nGreat legal minds, in their dark<br />\nafternoon, the king of the near form.\"<br />\nmagdrew<br />\ndarker<br />\nvests<br />\nand<br />\nsuits<br />\nInteresting<br />\nto note that there<br />\ngreat university looked about<br />\nEnlisting a new student body,<br />\nhim and thundered: \"why is my the university - was moved from nificent hair-splitting, loophole- was a proposal in the March 10<br />\nuniversity only near great? How its run down city to a real live finding briefs from the black- issue of \"The News-Letter\" for an<br />\ncan I make it great?\" To which city, a mecca of culture, enter- ness of their elegant attache incisive THREE POINT PROthere was no lack of enthusi- tainment, ideas. All were imbued cases. The university came to a GRAM to remedy the communiastic reply.<br />\nwith the sophisticated urban spellbound standstill as the end- cations problem at Hopkins. 1)<br />\noratory echoed and re- CAMPUS PUBLICATIONS?<br />\n\"Your university is not great, environment. The Liberal Arts less<br />\nthrough everyone's mind. There are some already. 2)<br />\nsire, because there is no mean- students spent their time be- echoed<br />\nFinal exam time found the tests SPEAKERS, FILMS, &amp; SPECIAL<br />\ncoming<br />\nmore<br />\nliberal, chasing<br />\ningful communication on cammore art. The Engineering stu- cancelled. Nobody had gone to EVENTS. A call for free Friday<br />\npus,\" stated one reformer.<br />\ncl, ss for weeks. All were pack- and Saturday night movies. Is<br />\n\"Your university lacks spirit,\" dents found more and better<br />\nshapes to study. The hick stu- ing the courtroom, breathlessly, 25c really much more than free.<br />\ncheered another.<br />\ntensely waiting as the great mo- 3) GOUCHER WOMEN AT HOP\"Your university is in the dents got lost on the subways. ment seemed<br />\nto be drawing KINS. A Positive Action Council<br />\nOnce<br />\nagain the king found himWrong city,\" offered a third.<br />\nclose—the end of the prelimi- to invite the girls to our free<br />\n\"Your university lacks well or- self on an empty campus.<br />\nnaries of the first trial under the Friday and Saturday night movganized, effective student gov\"More students, another re- university's<br />\nnew rules.<br />\nies. A group of enthusiastic unernment and especially lacks a form,\" his majesty gloomily de\"Oh,\"<br />\nmoaned<br />\nthe king, now dergraduates with orchids and a<br />\nmeaningful honor code\" elo- manded.<br />\nFor the fourth reform the so finally crushed,\" how, by station wagon to bus all this tail<br />\nquently stated the student orDuke of Admissions wisely pro- what reform will my near great back.<br />\nganizer.<br />\nOn and on went the sugges- cured a few students noted for university become a great one?<br />\nOr: What \"Proponents of<br />\ntions, until the now hopelessly their abilities in student gov- What must be done? What must Communications\" seem to be<br />\nconfused king turned to his ernment and the remainder of be grabbed and changed or dis- suggesting is that Johns Hopkins,<br />\nboard of .sorcerers for advice. the student body noted for its guarded? What systems, what a great American University for<br />\nThe sorcerers told the king to tendancy to take laws and or- plans must be instituted? What, over 90 years, has somehow been<br />\ntry each different suggestion and ganizations seriously. Within what, what.\"<br />\nexisting without \"communicato select the most successful days a ruling asembly had been<br />\nAt which Jeremey Richards tions.\" We have been a massive.<br />\nreform that would create a great formed and a series of legal doc- awoke from under the tree in thick intellectual masturbatorium.<br />\numents had been drawn up, ap- Keyser quad and taking his Well. And he proposes, as far<br />\nuniversity.<br />\nFirst then, he ordered the en- proved and sworn to by all. textbook pillow with its ob- as his proposals can be deteractment of an experimental These documents were immedi- scenely defaced Hopkins book- mined, to turn the masturbatorcommunications plan under ately compiled into one easy-to- cover, headed for the atrociously ium into a daisy chain of the<br />\nWhich communications between understand 27 volume student decorated Hutzler reading room, mind and mouth. The paint<br />\nmembers of the academic com- handbook which was to be di- which should be improved— being, \"communications\" is an<br />\nabstraction, having little of anymunity would not be hampered gested and regurgitated by every somehow, sometime.<br />\nby such outmoded institutions as<br />\nlectures, grades, tests, conferences or papers.- Students would<br />\nbe able to meet randomly with<br />\ntheir professors and instructors,<br />\neach of whom was assigned his<br />\nown tree on campus. Soon the<br />\nBy BARON WORMSER<br />\nGenet) has a lot of money. He 1 our image abroad. Instead one of<br />\nentire near great university was<br />\nBeach movies are potentially owns the South. He likes the: the 'bad' teenagers is impaled<br />\nbuzzing with true free intellecwith a water ski.<br />\ntual activity. Students discov- nice things. They are pure enter- American code of honor and lives I<br />\nered that the evenly spaced tainment pre-supposing that life by a lake. He likes his daughter<br />\nCream Judge IV<br />\ntrees made fine football goals, is nothing more than a series of even though she has crawly white<br />\nSo it is Gary Lewis and the<br />\nout<br />\nred<br />\nicky<br />\nis<br />\nhair.<br />\nand<br />\nHe<br />\nskin<br />\nbaseball bases and were perfect vignettes filled with music, girls,<br />\nPlayboys conducting World War<br />\nfor mounting basketball hoops. and sand. There is no death nor to kill Stevie Wonder and AnII, The Righteous Brothers singThe professors discovered that sickness nor even ugliness in a nette. \"Imagine,\" he says, loading<br />\ning 'Justine— as mortars go off.<br />\nCarnage<br />\nParty<br />\nBeach<br />\nin<br />\nhis<br />\ngun<br />\nbeautiful<br />\nmovie.<br />\nbeach<br />\nOnly<br />\nthere is no finer place than a<br />\nDancing to the rhythms of subtree for reading books that tanned bodies and bikinis. Fur- \"letting a blind Negro on a white machine<br />\ngun fire. John Foster<br />\nYou've previously secreted among thermore the beach movie is un- folks beach.\"<br />\nDulles gunning down Oriental<br />\nthe leaves. In no time at all the contaminated by such encumWipe Out Gang<br />\nlearned were nested in the brances as plot, message, charof John Foster Dulles,<br />\nBecause<br />\nbranches while the learners acter, or art. Rather the beach<br />\nSummer is a terrible movie. The<br />\nPlayed around the tree trunks movie is a phenomenon in which<br />\nbeneath them—truely meaning- as in the movie under review. mindless fun of Annette has been<br />\nful communications had been Swingin' Summer, the time of transformed into seriousness. Do<br />\none summer is superimposed on not, oh moviemakers, ever take<br />\nestablished.<br />\n\"A farce,\" said the king. \"On one day as in a classical French yourselves seriously. Right away<br />\nwith the second reform.\"<br />\ndrama and action is limited to plot creeps in. The hero wants to<br />\nA great new athletic field was pelvic gyrations and guttural earn money for dental school.<br />\nThe heroine wants her daddy<br />\nconstructed, in an effort to rouse wailings.<br />\nJohn Foster Dulles to give him<br />\nSavage Rose<br />\nschool spirit. Non-athletes were<br />\nBut even such classics as Beach the money. But the hero doesn't<br />\nexpelled as the high schools were<br />\nscoured for potential talent, Party Blanket and Blanket Party want it. He says \"Luci Baines I<br />\nwhich was brought to the uni- Beach are now disgraced. Great don't want no charity.\" No welversity at all costs. Attendance Americans like the Righteous fare for this pre-med. just lots<br />\nat games became mandatory (no Brothers &amp; Gary Lewis and the of white toothed absurdity.<br />\neasy requirement, now that Playboys, are being debased by<br />\nAn accurate count of violent<br />\ngames in 36 major sports and the moralistic passions of John scenes in Summer revealed three<br />\ncountless minor ones were being Foster DuIles.<br />\nabductions, four fist fights, one<br />\nheld daily). Everybody became<br />\nThe father of the heroine of boat race, one water ski duel,<br />\nsaturated with the fullness of this movie is John Foster Dulles. and three robberies. John Foster<br />\nschool spirit. Cheers were writ- He is head but so is Jean Genet Dulles asked for a lynching but<br />\nten, ivy grew inside the build- and he is alive. He not Jean the producer vetoed it as bad for<br /><br />\nthing at all, to do with FacultyStudent Coffee Hours and Free<br />\nMovies and Pajama Parties.<br /><br />\nRoy Orbison<br />\nThis week<br /><br />\nThe Annette Funieello Award<br />\nfor<br /><br />\nChild-Bearing<br />\ngoes to<br />\nRoy Orbison<br />\nfor his song<br />\n\"Communications Breakdown\"<br /><br />\nSwingin' Summer and Savage Rose<br />\nteeny hoppers. He sings ''Kids<br />\nI've<br />\npaid/to stop<br />\nthrowing<br />\nparties/and throw instead<br />\ngrenades.<br />\nVery sad. I hope Annette and<br />\nStevie Wonder get back in the<br />\nmovie business soon. Until then<br />\nI hope John Foster Dulles and<br />\nSally Jane, his husband hunting<br />\ndaughter stay in Texas and leave<br />\nour blue eyed soul brothers<br />\nalone.<br /><br />\nFor Springtime Frolicking<br /><br />\nUniversity<br />\nSportswear<br /><br />\nJAY'S<br />\nSMOKE SHOP<br />\n408 West Cold Spring Lone<br /><br />\n•Pipes<br />\n•Imported Cigars<br />\n•Imported<br />\nCigarettes<br />\n• Custom Blends<br /><br />\nFRATERNITY JACKETS<br />\nAND T. SHIRTS<br />\nORDER NOW FOR<br />\nQUICK DELIVEalt AND<br />\nLOWEST PRICES<br /><br />\nC AMPLE<br />\nJTORE<br />\nOPEN EVERY EVENING<br />\n'TIL 9 P.M.<br /><br />\nJust A Few Blocks<br />\nFrom The Hopkins Campus<br />\nAt 31s1 &amp; Creenmount Ave.<br />\nHO. 7-2719<br /><br />\nZelan Jackets ......... 6.95<br />\nNylon Jackets...... .. 9.95<br />\nSweatshirts (all colors)... 2.95<br />\nShort Sleeve Sweatshirts. . 2.95<br />\nHopkins \"T\" Shirts .... . 1.98<br /><br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\nIN THE HEART OF GILMAN HALL<br /><br />\nPAGE SIX<br /><br />\n.4<br /><br />\nChernick Places First<br />\nThe Varsity swimming team<br />\nplaced fifth in a field of<br />\neleven schools in the Middle<br />\nAtlantic Championships at<br />\nHomewood on March 3 and 4.<br />\nHoward Chernick copped a<br />\nfirst in the 100 and 200 yard<br />\nbutterfly and Richard Wilson<br />\ntook the one meter diving<br />\ncompetition.<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nEWS-LETTER<br /><br />\nDeferments Favored Swordsmen Gain Stickers<br />\nTourney Crown Face Mt.<br /><br />\n(Continued from Page 1)<br />\nmilitary option to serving in the<br />\narmed forces. Also, 59% of the students favored the maintenance of the<br />\npresent priority system for drafting and rejected President Johnson's proposal for a random lottery system.<br />\nDraft Women<br />\nOf the additional comments by<br /><br />\nJob Opportunity<br />\nAirlines Sales Representative<br />\nfor<br />\nTRANS WORLD AIRLINES<br />\nInteresting Work, Good Pay<br />\nWrite:<br /><br />\nthe students, one of the most<br />\ninteresting proposals was to draft<br />\n(Continued from Page 8)<br />\nwomen and use them in desk jobs<br />\nsecond place behind<br />\nanother<br />\nthat are now being manned by<br />\nCornell with 18.<br />\nmen.<br />\nFinally in the sabre competiSignificantly, most of those re- tion, Mike Gross was impressive<br />\nsponding seemed to feel that the in the A pool as he won nine of<br />\nVietnam War was the cause for his bouts. Bernie Tawfik was also<br />\nhis pool, and he went<br />\nthese problems concerning the powerful in<br />\n7-4. Capturing their third second<br />\ndraft, and numerous expressed place with 16 points, the Blue<br />\nthe belief that an end to the Jays followed Patterson State<br />\nWar would end the current de- with 18.<br />\nbate on the draft and restore a<br />\nAfter the team competition,<br />\nstatus quo ante bellum.<br />\nthe bop four fencers in pool A<br />\nand the two standouts in pool B<br />\nSA Cabinet Positions participated in a final individual<br />\ntournament. Lam placed third<br />\nPositions are open on the<br />\nwith three wins and two losses<br />\nSA cabinet for next year. ApIn foil. Gross took a second with<br />\nare<br />\nplications for interviews<br />\na 3-2 record, and Leedom copped<br />\nnow being accepted from ina fifth with two victories.<br />\nstudents. Submit<br />\nterested<br />\nAn exuberant Coach, Dick<br />\nname, address, box number,<br />\nOles, who celebrated his birthday<br />\nSA<br />\nno.<br />\nto<br />\nand phone<br />\nCabinet,<br />\nlast Saturday, was very pleased<br />\nBox 461.<br />\nby the victory.'<br /><br />\nThe CRACK of DOOM<br />\nA NEW COFFEE HOUSE<br /><br />\nT. W.A.<br /><br />\nWrestling Banquet<br /><br />\nAT THE FOGHORN LOCATION<br />\n1031/2 W. 22nd ST.<br />\nOPEN 9 to 1:30 FRI., SAT.<br /><br />\n826 Munsey Building<br />\nBaltimore, Maryland<br /><br />\n21202<br /><br />\n(Continued from Page 8)<br />\nthe team's performance in last<br />\nSaturday's 14-9 scrimmage win<br />\nover the University Club, the<br />\nvarsity mentor was not anxious<br />\nto single out individuals, but did<br />\nmanage some words of praise for<br />\nthe attack. He emphasized that<br />\nhis starting threesome has jelled<br />\nvery well, a development that<br />\nhas proven beneficial to crease<br />\noperator Kneip.<br />\nKneip Praised<br />\n\"Phil's scored well so far,\" he<br />\ncommented, \"and having good<br />\nfeeders like Cowan and Feely<br />\naround has helped him a lot. But<br />\nhe's improved in lots of ways—<br />\nat this stage he's a better, more<br />\nversatile all-around player than<br />\never before.\"<br />\nCowan, who had two goals and<br />\nfour assists when a fourth quarter thunderstorm hastened this<br />\nwriter's departure, also stood out,<br />\nand the midfield crew—adding at<br />\nleast three scores—lent balance<br />\nto the Jay offensive effort.<br /><br />\nFRIDAY: THE DULANEY VALLEY BOYS,<br />\nA FAST MOVING BLUE GRASS GROUP<br /><br />\nSATURDAY: BEAUTIFUL LIZ MILLER<br />\nSINGS BALLADS AND FOLK SONGS<br />\nCover MOO<br /><br />\nThe varsity wrestling team<br />\nheld its banquet on Wednesday, March 15. Co-captain<br />\nBill Swartz received the most<br />\ntake-downs award; John Gale<br />\nwas voted the most improved<br />\nwrestler; Joe Griggs was<br />\nawarded the unsung hero's<br />\ntrophy.<br /><br />\nFast-talking your parents<br />\nis the hard way<br />\nto get to Britain.<br />\nFact-talk instead.<br />\nTell them exactly what your trip will cost. Our free booklets help you calculate it.<br />\nOne lists prices of organized student tours. They start<br />\naround $650. If you want to travel on your own and take<br />\npotluck on meeting people —which may be the most fun<br />\nof all—add things up for yourself.<br />\nStart with a charter flight if your school has one. Or see<br />\nour booklet on group flights, student ships, and the bargain airline.<br />\nAdd low costs for getting around Britain. Our booklets<br />\ntell you about 3¢-per-mile buses and the rail-and-boat<br />\npass that takes you up to 1,000 miles for $30. Consider<br />\nhiking too. Wordsworth did.<br />\nMultiply the number of your nights in Britain by cost<br />\nof bed and breakfast or a room in a college residence hall.<br />\nIf you're hiking or biking, count on about 70¢ for youth<br />\nhostels. At this rate you may be able to stay all summer.<br />\nAllow about $1 a meal in London, less in the country.<br />\nThe booklets say which restaurants and pubs are popular<br /><br />\nwith convivial British students.<br />\nAnd the booklets mention the fantastically low cost of<br />\nconcerts and plays in Britain. You can sit in \"the gods-galleries up near Heaven—for 75.A lot of outdoor entertainment, like concerts and folk-singing, is free.<br />\nClip the coupon. Add everything up. And tell your<br />\nparents you can spend this summer in Britain for about<br />\nwhat it costs to hang around the house.<br /><br />\nBritish Travel<br />\nBo:923,New York,N.Y. WM<br /><br />\nName<br /><br />\n(Pleaae print dead')<br /><br />\nCollege<br />\nAddress<br />\nCity<br /><br />\nSlate—Zip—<br /><br />\n&gt;<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nNEWS-LETT!R<br /><br />\nEvening Before<br /><br />\nT<br /><br />\nThe Big Year<br /><br />\nBy STEVE PUTNAM<br /><br />\n.1<br /><br />\nI<br /><br />\nmentum more or breaks an op'Pomorrow, the Jays face the ponent's rally quicker than a<br />\nMounts in what could be the crucial goal. If<br />\nthe attack can<br />\nWorld lacrosse<br />\nchampionship<br />\ngame of the season. Of course keep coming up with the big<br />\nthis is the big year for the Jays, play, we'll be all right.<br />\nand there's sort of an<br />\nMounts Professional<br />\nurgency<br />\nto our cause. We haven't<br />\nseen a<br />\nThe Mounts. of course, are the<br />\nchampionship since 1959.<br />\nclosest thing to professional that<br />\nThis year we sport outstanding<br />\ntalent combined with good speed, lacrosse produces. They will score<br />\nsize (a new innovation) and 10 goals no matter what. The<br />\ndepth (another new innovation). Jays can stay on top of ground<br />\nLast Saturday many fans saw a balls and<br />\nkeep constant pressure<br />\ngood brand of lacrosse as the on the defense, but<br />\nif we don't<br />\nJays beat the University Club consistently score — we'll never<br />\n14-9. The Club, although reputed make it.<br />\nto be out of shape, sported<br />\nEveryone tp<br />\nsome excellent talent (Homer<br />\nThe psychological factor is imSchwartz, etc.) and were a good portant<br />\n. We all have to be up<br />\nhustling team. They whipped in for<br />\nthis thing tomorrow. This<br />\nthree straight goals near the end year<br />\nwe're too good to fade in<br />\nOf the first half and<br />\nhopeful fans the last quarter. Momentum is<br />\nbegan to shudder.<br />\non our side, we're coming up in<br />\nMost observers feel that we the lacrosse world. With big faith<br />\ncan't improve enough from last and few breaks, the young<br />\nupYear to take it all. Even the Sun starts can beat the professionals<br />\nexpressed its usual skepticism and bring the title back where<br />\nabout our chances tomorrow.<br />\nIt belongs—Hopkins, the home of<br />\nlacrosse!<br />\nAttack<br />\nAs I see it, much depends on<br />\nthe attack. Navy, in<br />\npast years,<br />\nsported an almost score-at-will<br />\nbrand of lacrosse, which, combined with ball control, was unbeatable. The Jays have always<br />\nbeen good on ball control Several<br />\n.<br />\ngames we lost last year we controlled the ball almost twice as<br />\nmuch as our opponents. The<br />\nteam must be able to make<br />\nthe<br />\nbig Play, however, and score in<br />\nthe clutch. Nothing adds<br />\nto mo-<br /><br />\nPAGE SEVEN<br /><br />\nBaby Jays Strong, Virile<br />\n(Continued from Page 8)<br />\nCoach Sotir plans to run some<br />\nof the attackmen at mid-field so<br />\nas not to waste their abilities.<br />\nDoug Honig, the All-Long Island<br />\nTeam star from Manhassett, is<br />\nsure to lead this unit. Honig was<br />\nthe top scorer on Long Island<br />\nlast year with 92 points, with<br />\ntwenty-two goals and 70 assists<br />\nto his credit.<br />\nOther attackmen demonstrating potential include Stu Kahl,<br />\n1st Team All-Maryland, Russ<br />\nMoore, All-League star from<br />\nMineola, New York, and Dave<br />\nRoberts, another top Maryland<br /><br />\nprospect.<br />\nThe midfield contingent should<br />\ncount heavily on Jim Lotto, who<br />\nscored thirty-three goals for<br />\nUniondale, New York last year<br />\nand Andy Fisher. Other top prospects include footballer Paul<br />\nWeiss, who never played lacrosse<br />\nbefore, Dan Rosenfeld and Stu<br />\nFogel.<br />\nDefense Helped<br />\nThe defense will probably be<br />\nanchored by Dick Billows, an<br />\nAll-League player from Garden<br />\nCity, New York, Bob MacCool,<br />\nAll-Maryland; and Chip Hicks,<br />\nwho is also back-up goalie. The<br /><br />\nCHUNG'S<br /><br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY &amp; FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br /><br />\nCARRY-OUT<br /><br />\ndefensive unit is learning much<br />\nfrom Assistant Coach Steve Levy,<br />\na standout on last year's varsity<br />\nsquad.<br />\nCommenting on the progress<br />\nof his team so far, Coach Scitir<br />\nfeels that it is an aggressive,<br />\nhard hitting group with some<br />\nfine stickhandlers but that lack<br />\nof depth could hurt. Sotir added,<br />\n\"Certainly the coaches want victories, but the prime objective of<br />\nthe freshmen team is to 'indoctrinate' the freshmen into the<br />\nHopkins' style and system of lacrosse.\"<br /><br />\nSTUDENT-PART TIME<br /><br />\nFine Chinese and<br />\nPolynesian Food<br /><br />\nWork 3 evenings 3-10 or<br />\n2 evenings &amp; Saturday 9-5.<br /><br />\nOpen Doily 11 A.M. -10 P.M.<br />\nFriday &amp; Sat. 11 A.M. -12 P.M.<br />\nSunday 1 P.M. -11 P.M.<br /><br />\n$60<br /><br />\n508 W. Cold Spring Lane<br /><br />\nCALL 837-8152<br /><br />\n889-3428<br /><br />\nHow would you fit into Du Pont's Project X?<br /><br />\n$ $ $<br />\nHOPKINS UNDERGRADUATES ARE NEEDED to<br />\nserve as subjects for Psychological Research. Pay $1.50 per<br />\nhour. Please come to Room<br />\n230, Ames Hall.<br /><br />\nVOLUNTEERS<br />\nWANTED FOR VISTA<br />\nCultural Enrichment Program People needed with<br />\nskills in the arts.<br />\nCall or Write:<br />\nMARIANE HENDERSON<br />\n110 South Exeter St.<br />\n685-1056<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\nP4<br /><br />\nEASTER TIME<br /><br />\n• Friends and Relatives<br />\nAppreciate<br /><br />\nCards and Candies<br />\nrosta<br /><br />\n4 Greenway Pharmacy<br />\nCharles and 34th St.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br /><br />\n* * * * * * * *<br /><br />\n'When hunger starts in these<br />\nhere parts, it will stop al a<br />\n'lorry Little Shop.\"<br /><br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br /><br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br /><br />\nYou are the only person who can answer<br />\nthat question.<br />\nTo do it, you should know as much as possible about<br />\nthe 150 new plant units Du Pont has built since<br />\nthe end of World War II. You'd then choose from one of<br />\nthe many lively fields of interest at Du Pont:<br />\ndesign, construction, production, marketing, research<br />\nand process improvement (to name just a few).<br />\nInvolvement starts the day you join. There is no<br />\ntraining period. You go into responsible work right away.<br />\nYour professional development is stimulated by<br />\nreal problems and by opportunities to continue your<br />\nacademic studies under a tuition refund program.<br />\nYou work in small groups where individual<br />\ncontributions are quickly noted and appreciated.<br />\nThe work is significant, and of benefit to society.<br />\nYou're part of the most exciting technical environment<br />\navailable today and tomorrow, and facilities and<br />\nassociates are the best.<br />\nHow could you fit in? Why not sign up for a chat with<br />\na Du Pont interviewer and find out? The coupon will<br />\nalso bring you more information about us.<br />\nFinally, what is Project X?<br />\nWe don't know yet. Could be we're<br />\nwaiting for you to tell us.<br /><br />\n°U..P0<br /><br />\nE. I. du Pont de Nemours &amp; Co. (Inc.)<br />\nNemours Building 2500-2<br />\nWilmington, Delaware 19898<br />\nPlease send me the Du Pont Magazine along with<br />\nthe other magazines I have checked below.<br />\nLII Chemical Engineers at Du Pont<br />\nO Mechanical Engineers at Du Pont<br />\nLI Engineers at Du Pont<br />\nEj Du Pont and the College Graduate<br />\nName<br />\nClaw<br /><br />\nMajor<br /><br />\nDegree expected<br /><br />\nCollege<br />\nMy addreHa<br />\nCity<br /><br />\nState<br /><br />\nZip Code<br /><br />\nJP<br /><br />\nNEWS<br /><br />\nit<br /><br />\nT<br /><br />\nNEWS -LETTER<br /><br />\nPAGE EIGHT<br /><br />\nACROSSE<br /><br />\nLETTER<br />\nHOMEWOOD, BALTIMORE, MARCH 17, 1967<br /><br />\nE<br /><br />\nT<br /><br />\nJays Open Against Wolfpack;<br />\nFrosh Lacrosse<br />\nSuccess<br />\nTo<br />\nn<br />\nKey<br />\nSee<br />\nack<br />\nAtt<br />\nBoasts Good Attack<br /><br />\nthat pinned the Jays 11-5 in '66, Gorcyzk and defenders Bob<br />\nand, possessed of a surfeit of tal- Crutchley and Ted Leach (both<br />\nent and depth (five full strength of whom went all the way in<br />\nmidfields employed in previous last week's University,Club scrimscrimmages), would appear, as mage) are likely to be the chief<br />\nreserves at their respective poalways, to be favored.<br />\nHopkins — several intervening sitions.<br />\nA further manifestation of the<br />\ncollegiate championships notwithstanding — has not beaten Injury jinx — sophomore Phil<br />\nthe perennial club pacesetter (a Buck's collapsed lung—has upset<br />\nrecent 12-10 scrimmage victor the midfield situation somewhat.<br />\nover Maryland) since 1941, al- At this writing, Bob Carter,<br />\nthough this year's group should teaming with captain Jerry<br />\nnot be without the resources to Schnyclman and Wayne Towns,<br />\npull an upset, a fact concurred is chief candidate for Buck's spot,<br />\nupon by Jay mentor Bob Scott, with injured (muscle tear) soph<br />\nwho regards such an occurrence Charlie Goodell a possibility. Phil<br />\nParthmore will fill Carter's vaas \"not impossible.\"<br />\ncant third unit post.<br />\nStarters<br />\nScott Comments<br />\nVirtually certain to open in atScott, for his part, has not<br />\ntack spots for the Jays tomorrow<br />\nwill be Joe Cowan, Phil Kneip, been intimidated by the group's<br />\nof his eleven bouts. Al Bottle and Jim Feely, while the defen- physical problems, opining that<br />\nwent four and seven in the B sive alignment—more doubtful— its \"good depth could compenpool to give the Jays a total of will probably position sophi Mike sate\" for such losses. \"The same<br />\n15 points. Syracuse copped the Clark and John Cardillo with All- thing happened last year.\" he<br />\ntop honors with 17.<br />\nAmerican Hank Kaestner and continued,\"and, because we were<br />\nIn the epee contests Joe Mull- goalie Geoff Berlin. Although thin, it did hurt—but that's not<br />\nnare won seven and lost four in attackman Downy McCarty true now. Anyway, most of the<br />\n'm<br />\nthe A pool, and Bob Leedom (sprained ankle) and defense- injuries aren't really serious—I<br />\nposted an excellent performance man Joe Carlton (muscle pull) hopeful we'll have everybody<br />\nand was 10-1 in the B division. could be sufficiently recovered ready for the big games.\"<br />\nWhile generally pleased with<br />\nTheir total of 17 gave Hopkins from injuries to see action Sat(Continued on Paae 6)<br />\nurday, reserve scorer John<br />\n(Continued on Page 6)<br /><br />\nBy MIKE PHILLIPS<br />\nFresh from a set of fairly encouraging pre-season performances, the injury-annoyed varsity lacrosse team will kick off<br />\nits 1967 campaign in customary<br />\nfashion tomorrow, when it hosts<br />\nclub power Mount Washington at<br />\n2:30 p.m.<br />\nThe Wolfpack, last year's undefeated open (club and collegiate) champion, has incurred no<br />\nserious losses from the group<br /><br />\n•<br /><br />\nweek's scrimmages against GilBy JEFF LAUREN<br />\nman School and B.J.C. looking to<br />\nman<br />\nven<br />\ntwenty-se<br />\nPosting a<br />\nthe top stickmen and to defind<br />\nroster, the freshman lacrosse<br />\nother starting units.<br />\nvelop<br />\nteam opened practice three weeks<br />\nAttack Strongest<br />\nAlex<br />\ncoach<br />\nfirst-year<br />\nunder<br />\nago<br />\nMost observers agree that the<br />\nSotir.<br />\nBaby Jays are overloaded with<br />\nSotir, the Bluejays' varsity<br />\nfine attackmen and that the<br />\nHopkins<br />\nto<br />\ncame<br />\nfootball mentor,<br />\noffense is the Jay's greatest<br />\nlast, year from Wesleyan College<br />\nstrength. Tesifying to this fact,<br />\nwhere he was head varsity la(Continued on Page 7)<br />\ncrosse coach. He has had plenty<br />\nof experience with lacrosse and<br />\nwas one of the North's coaches<br />\nin last year's North-South All<br />\nStar Game. Nonetheless he will<br />\nfind it difficult to replace Wilson<br />\nFewster.<br />\nFewster, who coached the<br />\nfreshmen for over ten years at<br />\nHopkins, led last year's, Baby<br />\nBy JIM SLOAN<br />\nJays to an impressive 11-1 record<br />\nswordsmen conloss<br />\nvarsity<br />\ngame<br />\nThe<br />\nwith only an opening<br />\nto Virginia. However, Coach Sotir cluded their victorious 1967 camwill not have as strong a frosh paign by copping the championcontingent as did Fewster. Last ship honors in the North Atlantic<br />\nyear's freshmen stickers, sporting Conference last Saturday at<br />\ngreat individual performers in Syracuse.<br />\nTwelve schools participated in<br />\nevery position as well as remarkable depth, were considered one the tournament, and each sent<br />\nof the finest teams in many sea- two fencers in the three divisions.<br />\nThe Jays captured the team honsons.<br />\nors with 48 points. Cornell folFirst Game Tomorrow<br />\nlowed with 43, and third place<br />\nseatheir<br />\nbegin<br />\nJays<br />\nBaby<br />\nThe<br />\nwent to Syracuse. Last year's dethe<br />\non<br />\nson tomorrow at 12 noon<br />\nchamps, Patterson State<br />\nfending<br />\npractice field against Virginia. University, tied for fifth place<br />\nThe line-up will be determined<br />\nwith 35 points.<br />\nfrom the results of this past<br />\nLam Undefeated<br />\nThe<br />\ns.<br />\nscrimmage<br />\nweek's two<br />\nThe competition in foil. epee,<br />\nfreshmen are out-to avenge last<br />\ninto two<br />\nyear's close opening game loss. and sabre was divided<br />\nreceived<br />\nPeter Conti, the team's sole ex- pools—A and B. Hopkins<br />\nfoil division<br />\nthe<br />\nin<br />\nplace<br />\nsecond<br />\na<br />\nposionly<br />\nthe<br />\nis<br />\ngoalie,<br />\nperienced<br />\nperfect performance<br />\ntive starter against Virginia. The behind the<br />\nwho captured each<br />\nBluejay coaches entered this of Jerry Lam,<br /><br />\nFencers Place First<br />\nEdging Out Cornell<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br />\nfor she finest Italian food in town<br />\n3320 Greenmount Ave.<br /><br />\nThe upbeat buttondown.<br />\nEverything about this Arrow<br />\nDecton Permadron shirt<br />\nis traditional — except the<br />\nfact that it refuses to<br />\nwrinkle. And that may<br />\nstart a whole new tradition.<br />\nNote the wide stripes, the<br />\njust-so roll of the collar.<br />\nIt's in a blend of Dacron<br />\npolyester and cotton that's<br />\n\"Sanforized-Plus\". In<br />\nother stripes, solids and<br />\nwhites, too. A winner<br />\nat $7.00.<br /><br />\nCARRY OUT SERVICE<br /><br />\nSPAGHETTI M E A LS<br /><br />\nCALL 889-38M<br /><br />\nPIZZA PIE A SPECIALTY<br /><br />\n-ARROW-c-<br /><br />\nNEWMAN HOUSE<br />\nThe C-atholic Center for Johns Hopkins<br />\nBE 5-9271<br />\n2941 N. Charles<br /><br />\nHoly Week Services:<br />\nPALM SUNDAY MASS<br /><br />\nMARCH 19TH<br /><br />\n10:30 A.M. Levering Hall<br />\n•<br /><br />\nHOLY THURSDAY MASS<br /><br />\nMARCH 23RD<br /><br />\n12:00 Noon Levering Hall<br /><br />\n•<br />\nMonday, Tuesday. and Wednesday of Holy Week<br />\nMass at Newman House 4:30 P.M.<br />\n•<br />\nNewman House will be closed for Easter Vacation<br />\nFriday. March 24th through Sunday, April 2nd.<br /><br />\nL._<br /><br />"}], "field_media_file": [{"target_id": 40222, "display": null, "description": null, "target_type": "file", "target_uuid": "be233cb6-484f-4cad-a0fa-86b5046d4be1", "url": "http://digital.library.jhu.edu/system/files/2022-03/13925-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13925, "target_type": "node", "target_uuid": "6133ee82-d396-4865-bdcf-b2620a9b4edc", "url": "/node/13925"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "8c5f6f45-6667-4e70-a9cb-d410ec71cf8d"}]}