{"mid": [{"value": 36681}], "uuid": [{"value": "9a8dfd3d-7003-4161-8e32-270ab9d9bc86"}], "vid": [{"value": 36681}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12975-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 21<br />\nVALUE OF DORMITORY<br />\nQUESTIONNAIRE DOUBTED<br />\n<br />\nBALTIMORE, MD., DECEMBER 20, 1921<br />\nHOPKINS TO HAVE SWIMMING TEAM<br />\n<br />\nDR. BIRCKHEAD ADDRESSES<br />\nASSEMBLY ON PALESTINE<br />\n<br />\nTAU BETA PI INITIATES<br />\nEIGHT NEW MEN<br />\n<br />\nPRICE 5 CENTS<br />\nANSWERS TO STADIUM<br />\nQUESTIONNAIRES RECEIVED<br />\n<br />\n0. D. K. Circle Expresses Belief That To Be Financed by Sale of Minor Sport Pastor of Emmanuel Church Makes Honorary Engineering Fraternity Holds Ohio State Building Million-dollar<br />\nStand. Illinois to Spend Two Million.<br />\nTickets. Six Meets Scheduled.<br />\nFormal Initiation.<br />\nLittle Weight Should Be Attached<br />\nInteresting Talk.<br />\nto Returns from Cards Recently<br />\nAs soon as the proposition of<br />\nJohns Hopkins will have a swim- i Dr. Hugh Birckhead, rector of<br />\nTuesday evening the formal iniDistributed in Boxes.<br />\nbuilding a stadium at Homewood<br />\n<br />\nming team this year in spite of the<br />\nThe returns to the questionnaire total lack of funds available for the<br />\nconcerning the dormitory sent out support of minor sports. Although<br />\nby the Treasurer's office were very<br />\nhandicapped greatly by the fact<br />\npoor, a very low percentage of the that only last week was the official<br />\nstudents signifying their inten- sanction of the Varsity Club setion of living in the proposed cured, Manager Davidg-e Rowland<br />\nbuilding. Commenting upon the has arranged a very attractive<br />\nresults the secretary of Omicron schedule which calls for dual meets<br />\nDelta Kappa, speaking for the cir- with every member of the Middle<br />\ncle, expressed the opinion that the Atlantic Swimming Association.<br />\ndistribution of these cards was not The tentative schedule is as folunfortunate, for it is possible that lows:<br />\nwhile little or no weight should be<br />\nJanuary 21—Swarthmmore, at<br />\nattached to them, the:returns will<br />\nSwarthmore.<br />\nhave a detrimental influence on<br />\nFebruary 4—Syracuse (tentathe trustees with whom the final<br />\ntive).<br />\ndecision now rests.<br />\nFebruary 11—Lehigh.<br />\nHe said in part: \"The- chief obFebruary 18—George Washingject in building a dormitory is to ton (tentative).<br />\ndraw to Hopkins a class of stuFebruary 25—Rutgers, at Rutdents which she does not now get. gers.<br />\nThe dormitory will be s-upported<br />\nMarch 11—Eastern Intercolleby these students and an attempt giate<br />\n(tentatiVe).<br />\nsuch as was recently made to atThe whole program, however,<br />\ntam n an idea of the revenues to be<br />\nhinges on the Lehigh meet on Satreceived from the building from a urday, February 11. After this<br />\ncensus of the present students is meet a large dance will be given in<br />\ntherefore worthless. The students the gymnasium of the Baltimore<br />\nWho received the cards were for Athletic Club.<br />\nTickets will be<br />\nthe most part local boys, while tl$1.50, and at least 100 must be sold<br />\nothers were already located in fra- to insure the success of the swimternity houses or convenient ming season. If $150 can be raised<br />\nboarding houses, and although the in this way the Varsity Club will<br />\nreturns, considering the out-c\" add enough to put the season<br />\ntown students alone, were encour- across.<br />\naging, they could not begin, even<br />\nLast year Hopkins finished secif a favorable reply from out-of- ond in<br />\nthe league, defeating all<br />\ntown students had been received teams but<br />\nRutgers, who won the<br />\nto guarantee sufficient revenue.<br />\nchampionship. In spite of the loss<br />\n\"Thus, until the dormitory is of several men from last year's<br />\nactually erected, it will be difficult team, Hopkins should ,do as well,<br />\nto estimate the demand which will if not better, this winter. Among<br />\nbe made for rooms. The 0. D. r those who remain from last year's<br />\ncircle believes, however, that once squad is Captain Paul Buhrer, a<br />\nthe building is erected, it will be capable performer in the dashes and<br />\na matter of a few years at most be- on the relay team. The one best<br />\nfore the demand for —<br />\nrooms will bet will probably be Davvy Rowexceed the supply. Our scholastic land, captain and star of last year's<br />\nstanding is unquestioned, our team. He is almost unbeatable in<br />\nathletic teams are displaying the dashes up to 100 yards and<br />\nsteadily increasing prowess and in the breast stroke. Coady can be<br />\nnon-athletic activities compare fa- counted on to win his share of the<br />\nvorably with those of other col- distance events while Johnson and<br />\nleges. The one thing that we lac__ Morrell will fill out the relay team.<br />\nis the proper housing facilities and Bob Hall will take care of the backadequate center of college life. stroke and Hambleton should exWith a definite assurance that this cel in the plunge. The only new<br />\nlack will be remedied by next Oc- man with any previous experience<br />\ntober the 0. D. K. deputations is Betts Slingluff, captain of the<br />\nWill be in an excellent position to City College team last year. Only<br />\nPersuade students from out of in the fancy diving and plunge will<br />\ntown prep schools to come to the team be weak and unless some<br />\nRopkins.<br />\nman is found to handle the dive<br />\n\"Now is the time to act. If the the rest of the team will be greatly<br />\ndormitory is not ready by next handicapped.<br />\nfall another year is lost. If it will<br />\nPractice will begin immediately<br />\nbe ready in October a definite ad- after the Christmas holidays and<br />\nvertising campaign can be organ- will be held in the pool of the Balized and with the alumni and fac- timore Athletic Club. On account<br />\nulty back of it and the students of lack of funds no coach has been<br />\nco-operating with the splendid secured, but Captain Buhrer and<br />\nSpirit they have shown this fall, it Manager Rowland will instruct all<br />\nis probable that the building could candidates and will pick the team.<br />\nbe made almost a paying propisi- But the real success of the team will<br />\ntion next year and certainly a fin- depend on the support accorded the<br />\nancial success by the following dance after the Lehigh game; if<br />\nOctober.\"<br />\nthe money for financing the team<br />\nAt the private initiation of the cannot be secured in this way the<br />\neight members elected to the circle succeeding meets must be cancelled<br />\nthis fall, which was held Monday and the swimming season will fall<br />\nnight at the Hopkins Club, the through.<br />\nfollowing committee: H. D. Cot- I<br />\nt°n, chairman; R. M. Wood and<br />\nNOTICE<br />\nbavidge Rowland, was appointed<br />\nAn important meeting of<br />\nto bring the student sentiment<br />\nthe NEWS-LETTER Board Will<br />\nConcerning the erection of a dorbe held today at 12.30.<br />\nulitory before the trustees.<br />\n<br />\nEmmanuel Protestant Episcopal tiation of new members of the Tau<br />\nBeta Pi, honorary engineering so- was considered seriously by the<br />\nChurch, addressed an interested<br />\nciety, was held in the Mechanical Varsity Club steps were taken to<br />\naudience last Thursday at the Engineering Building. Dr. John find out the methods of financing<br />\nweekly assembly on his recent trip Boswell Whitehead, Dean of the employed by other universities.<br />\nto Palestine. He spoke of the pos- Engineering School, was taken in Dr. Van Orman sent questionsibility and practicability of the as an honorary member. Charles naires to a number of colleges<br />\nowning stadiums and has received<br />\nZionist movement and advised Bryant, David Thomas, William<br />\nWiekel, Charles Rudel and Andrew answers from four of them.<br />\nthat all Jews study. the question<br />\nThe big Ohio State stadium at<br />\nKnecht, members of the Senior<br />\nvery carefully before they decide<br />\nClass, were taken in at the same Columbus is now under construcwhether or not the coming Ziontime, along with Calvin Warfield, tion and will be finished for the<br />\nist campaign is a feasible project.<br />\na Junior, who has the highest aver- football season next year. This<br />\nDr. Birckhead was accompanied age in his class.<br />\nstadium is in the form of a horseon his trip by Rabbi Lazaron, of<br />\nFollowing the initiation cere- shoe and has a permanent seating<br />\nthe Baltimore Hebrew Congrega- monies, a banquet was served at capacity of 63,000. It will cost<br />\ntion. They left Baltimore the early the Hopkins Club. The speaker of $1,341,000, all of which has been<br />\nraised by subscription among the<br />\npart of last summer and proceed- the evening, Colonel Procter, of<br />\nthe Maryland Casualty Company, alumni and students.<br />\ned by way of the Mediterranean<br />\nThe Harvard stadium, one of<br />\nwas introduced by Davidge RowSea to Cairo, Egypt, where they land, president of the chapter. Col- the oldest in the country, also has<br />\ntook a train for Palestine. At the onel Procter spoke of the position the shape of a horseshoe. Its perSuez Canal they had to get off and of the engineer in society, stating manent seating capacity is 30,000<br />\nwalk across a shaky pontoon that the<br />\nengineer's present status and 20,000 more can be aCcommobridge over the canal. On the was wholly due to the engineer dated if necessary. When erected<br />\nother side they boarded another himself. Dr. Whitehead also de- in 1902 this structure cost $295,train which took them along the livered a short talk.<br />\n000, which was given by the class<br />\ncoast of the Mediterranean on the<br />\nThe first eight of the present of 1879 and friends. In 1911 a colleft and the great desert on the Junior Class will be eligible for onnade roof and extra wooden<br />\nright, until they reached their des- election into the chapter this com- stands were built at a cost of $44,tination.<br />\ning spring. The choice of new 000. Only football games and<br />\nHe said that this country, in members will be based partially on track meets are held inside this<br />\nshape, was not unlike an irregular the results of the mid-year exam- stadium.<br />\nparallelogram, with the Dead Sea, inations.<br />\nThe famous Yale bowl is built<br />\nthe Sea of Galilee and two points<br />\nhalf<br />\nabove and half below ground.<br />\npurpose<br />\nof<br />\nthe<br />\nTau<br />\nBeta<br />\nThe<br />\non the Mediterranean as its ver- Pi, which is the engineering Phi The field is entirely surrounded by<br />\ntices. Some sections of it are far Beta Kappa, is to group together seats to which access is obtained<br />\nbelow sea level, while other parts men who are vitally interested in through openings in the aisles<br />\nare very mountainous.<br />\nthe development of the engineering about one-third the way from the<br />\nDr. Birckhvad gave a short but world and in their Alma Mater, and bottom. The stands will seat<br />\nvivid description of the life and this opportunity is taken to bring 65,000 permanently and an extra<br />\nactivities of the people. The condi- before the students of the univer- 15,000 can be taken care of. Figtions of the men as a whole are sity the purport of the /society with uring on the basis of the cost per<br />\nvery good, but that of the women the hope that there will result a seat this stadium was built at beis deplorable. They are looked keen and friendly rivalry between tween $7 and $10 for each seat.<br />\nupon and treated with little more the engineering students for adWord has just been received<br />\nrespect than slaves. This is espe- mittance.<br />\nfrom the University of Illinois<br />\ncially true among the Mohammethat they have successfully comdans who are ruled by the laws<br />\npleted a campaign for $2,000,000<br />\nSOPHS TO HOLD PROM<br />\nof the Koran.<br />\nAt a meeting of the Sophomore with which to build a memorial<br />\nDr. Birckhead recounted the Class held last Thursday in the stadium—the largest in the counstory of the English-Jewish chem-. M. E. Hall, President Callard try. This immense structure will<br />\nist who invented a poisonous gas suggested a Sophomore Prom and have a seating capacity of 75,000<br />\nduring the World War which was as the class enthusiastically ap- and a total capacity of 100,000.<br />\nmore deadly than the German proved, he appointed a commit- The field will not only be used,for<br />\nmustard gas, and presented the tee, consisting of G. M. Shriver, football, but also for all other<br />\nformula to the British War Office Jr., Chairman; Mount, Leopold sports.<br />\nThese reports should surely be<br />\non condition that after the war the and Harwood, to take charge of<br />\nencouraging<br />\nfor our own prosJews be allowed to return to Pal- the arrangements. No date was<br />\npects.<br />\nThey<br />\nshow<br />\nthat athletics is<br />\nestine. England promised this and selected, this detail being left to<br />\ngetting<br />\na<br />\ntremendous<br />\ngrip on the<br />\nwhen the war was over took over the discretion of the committee,<br />\npublic<br />\nand<br />\nthat<br />\nthey are willing to<br />\nthe country as a protectorate. Im- but it is proposed to hold the affair<br />\nmediately the Jews began to flood some time after the mid-year ex- patronize college games. With a<br />\ninto the country. They came most- aminations. Presidnt Callard stip- stadium of fifty or sixty thousand<br />\nly from Russia and other Eu- ulated that the men who are seating capacity, Hopkins would<br />\nropean countries. Those in Ameri- dropped from the University may be able to make her sports pay<br />\nfor themselves in a short while.<br />\nca, Dr. Birckhead said, had be- attend.<br />\ncome good American citizens and<br />\nIt was decided that owing to the FIELD CLUB TO MAKE STUDY OF<br />\ndid not wish to return. This great negligence of last year's class in<br />\nBIRDS AT HOMEWOOD<br />\ninflux stirred up trouble among awarding numerals, men who In the next few days the Field<br />\nthe Jews and Mohammedans and played either last year or in the Club will make a trip to the westcaused considerable rioting. The game last Satu<br />\n. rday would be re- ern part of the city to study the<br />\nJews, outnumbered seven to one, warded. The following men were crow roost, which has been there<br />\nwere treated with much severity. voted their 24's: Coady, Harwood, for many years. Mr. Douglas will<br />\nThe British authorities could not Tatum, Ohrenschall, Ross, A., be in charge of the trip.<br />\nlet this rioting continue and they Smallwood, Dorsey, W. H., Mar- During the Christmas holidays<br />\nstopped it by forbidding any more chetti, Ellicott, Limbach, Homer, the Field Club will make a study<br />\nJews to immigrate. This .has Shriver, J. S., Dunning, Marino, of the birds at Homewood. A recaused much dissatisfaction, but Wilgis, Shriver, G. M. ,Jr., Mc- port will then be sent to Washingit was the only thing the English Daniel, Hutzler, Barton Strause, ton. This is a national affair, because it is at this time that reports<br />\ncould do to save the jews, Dr. Raleigh, Ashton and Gluck.<br />\nBirckhead signified.<br />\nAll members of the class were of the birds in all sections of the<br />\nOf the future of Palestine, he urged to attend the Freshman- country are sent in to Washington<br />\nsaid, no one can prophesy, but it Sophomore debate held in the C. for the tabulation of statistics.<br />\nis a country without many nat- E. Hall last Friday and it was asCORRECTION<br />\nural resources and must conse- sured that music would be furThe Delta Phi representative to<br />\nquently depend on neighboring nished for dancing after the de- the Interfraternity Smoker Combate.<br />\ncountries for its many needs.<br />\nmittee was C. Tilghman.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br />\n<br />\n2<br />\n<br />\nNOTICE<br />\nlis and Wilson—four of the shin-' FOOTBALL BANQUET TO BE<br />\nTHURSDAY<br />\nHELD<br />\nDecember 13, 1921.<br />\ning lights of the backfield. _<br />\nCaptain to Be Elected.<br />\nFrederick Russell Calkins, Jr.<br />\nThere will be no drill Thursday,<br />\nFOUNDED 1897.<br />\n\"Eric,\" is twenty-four years old and<br />\nNext Thursday night, at 7.30 the 22nd inst. The unit as a whole<br />\n$2.50<br />\nSubscription<br />\nweighs 175 pounds. Not satisfied P. M., the football banquet will be has done such satisfactory work up<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at with playing all through his under- held, and at that time the captain to date that it is a pleasure to exBaltimore, Md., under Act of Congress, November 3, 1879.<br />\ngraduate years, he returned to the for next year's team will be elected. tend this privilege.<br />\nCaptain Paul desires to extend a<br />\nPublished semi-weekly from October to June by the students of Johns team as one of the few medical At the present time there seems to<br />\nHopkins University.<br />\nschool representatives. Watertown be only two candidates for the po- Christmas greeting to the FreshBusiness communications should be addressed to the BUSINESS MAN- High School was the early alma sition. Tom Landy and \"Happy\" man Class. He appreciates the fine<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nmater which harbored \"Eric\" in his Middleton. Tom has been on the work that the class as a whole has<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100 tender years. Calkins has played Varsity for three years and has done to date. I would like to add<br />\nTelephone<br />\non the team at fullback for lour been a star every year, making the my appreciation to that of Captain<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nyears. He is now in the Medical All-Maryland Team his first and Paul's and to state to the Freshman<br />\nH. DOUGLAS COTTON,'22.<br />\nFREDERICK W. LIPPS, '22.<br />\nSchool and if his•duties will permit second years. He seems to be able Class that its work to date is easily<br />\nManaging Editor:<br />\nhe will continue at the game for the to keep up his own and the whole fifty per cent. better than the work<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nnext three years. Eight games this line's fighting spirit at all times, and of any other Freshman Class in the<br />\nGLOVER P. FALLON, '23.<br />\nAssociate Editors:<br />\nseason have seen \"Eric\" starting at is a very likely candidate. \"Happy\" Military Department since the R.<br />\nELI FRANK, JR., '22.<br />\nAdvertising Manager:<br />\nhis old position. In addition to broke into the limelight this year 0. T. C. was started in this UniDONALD K. VANNEMAN, '23.<br />\nJunior Editors:<br />\nlacrosse, track and base- at left end. He was speedy, a sure versity.<br />\nfootball,<br />\nCHARLES C. MARBURY, '22.<br />\nAssistant Business Managers:<br />\nhis athletic accom- tackler and showed ability in diagcompose<br />\nball<br />\nJ. BRENTNALL POWELL, '23.<br />\nCaptains Long and Atwater give<br />\nBERNARD C. HEARN, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nplishments.<br />\nsatisfactory<br />\nreports of the Sophothe<br />\nall<br />\nLEWIS,<br />\n'23.<br />\nHe<br />\nC.<br />\nshows<br />\nplays.<br />\nJOHN<br />\nnosing<br />\nJ. HUDSON HUFFARD,'23<br />\nFITZGERALD DUNNING, '24.<br />\nJohn Usher Markell. John is 22 qualities of a good leader and if more Class as a whole.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nyears old and weighs 170 pounds elected will undoubtedly make a<br />\nCaptain McMurray reports that<br />\nick<br />\n.<br />\nthe<br />\nFreder<br />\ngridiron.<br />\nfor<br />\nclad<br />\nJunior Class is taking keen inthe<br />\ngood captain.<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nis his home town, but he \"prepped\"<br />\nThe final decision in the matter terest in field engineering, and is<br />\nof<br />\nHagersSchool<br />\nJames'<br />\nSt.<br />\nat<br />\nlies with those men who received making very satisfactory progress.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntown. Markell has been on the the \"H\" this season—Totterdale, The Senior Class as a whole' is<br />\nsquad four years. He prefers the Markell, Bonner, Calkins, Darley, doing satisfactory work.<br />\nBALTIMORE, MD., DECEMBER 20; 1921<br />\nbackfield positions, and has always, Wilson, Knecht, Landy, Magill, With the exception of the Freshplayed there in every game of Middleton, Westerman, Rich and man Class, which holds a unique<br />\nCHRISTMAS GREETINGS<br />\nrecord, and which if it keeps up<br />\nThe News-Letter wishes to take this opportunity to wish the which he has been a participant. Brawner.<br />\nJohn played in six of the games this<br />\nits present rate of progress, will<br />\nFaculty, Alumni and Students a very Merry Christmas.<br />\nachieve an astounding record, there<br />\nIt also wishes to announce that the next issue of the News-Letter year and always succeeded in proLACROSSE PRACTICE BEING<br />\nfor<br />\nthe<br />\nreal<br />\nthrills<br />\nsome<br />\nducing<br />\nFriday<br />\nissue<br />\nthe<br />\nas<br />\ntenth,<br />\nthe<br />\na few members in each class<br />\nare<br />\nJanuary<br />\nTuesday,<br />\nuntil<br />\nwill not appear<br />\nHELD DAILY<br />\nthat<br />\nsorrow<br />\nIt<br />\nwith<br />\nis<br />\nspectators.<br />\nare lagging behind. These<br />\nholidays.<br />\nwho<br />\nthe<br />\nof<br />\naccount<br />\nwill be dropped on<br />\nthe sttylent body learns that he will<br />\nThe inclement weather of the men are again warned that the milBOOST HOPKINS!<br />\nnot return next year for post-grad- past week has not prevented la- itary tests are clean-cut this year<br />\nChristmas vacation will soon be with us, and temporarily, at<br />\nuate work. In addition to football, cross practice and Head Coach and unless the conditions are fulleast, we can forget our informals, and live only for the present. Alis a track man of no mean \"Johnny\" Knipp asserts that his filled a student will not be passed<br />\nJohn<br />\nthough, at our own risk, we can forget the unpleasant features of our ability.<br />\nsquad is rapidly rounding into as satisfactory.<br />\nexistence,' we should remember to spend our time in the interest of<br />\nBeauford Willis. \"Mike\" is one form. A board wall has been conOver 95 per cent, of the students<br />\nthe University. Vacation time is the time for every student to boost of the football finds of the 1921 seaconthe<br />\nof<br />\nthe<br />\nrear<br />\nstructed in<br />\nin the Military Department deserve<br />\nHopkins. A well placed word here or there is an excellent advertiseson. Baltimore City College was crete stand and when the weather every encouragement and appreciament for the University, and is not to be deplored. It is the student his prep school, but he did not enprohibits practice on the field the tion. I hope that the entire unit<br />\nwho is always ready with a good word and never knocks the Uniter Hopkins until after he had done squad holds forth under the will have a most delightful Christversity who boost the institution.<br />\nservice in the Navy. Twenty-four stand.<br />\nmas and will return prepared to<br />\nWe believe that Hopkins possesses many students of this kind. years of age and weighing 165<br />\narhas<br />\nCollins<br />\nActing<br />\nManager<br />\nup the important work that<br />\ntake<br />\nWe believe that the splendid spirit displayed this fall is not mere pounds,.' Mike\" is not a backfield<br />\nthe<br />\nbut<br />\na<br />\nschedule<br />\ndifficult<br />\nranged<br />\nfollows.<br />\nfroth, but is a surface indication of genuine feeling. The Christmas man to be trifled with. He has<br />\nE. B. GAREY,<br />\ncoaches feel that if the squad convacation offers an opportunity to prove that our opinion is correct. played in four games this year in<br />\nwill<br />\nInfantry.<br />\nMajor,<br />\nit<br />\nprogress<br />\npresent<br />\ntinues<br />\nits<br />\nMake good use of your vacation and talk Hopkins.<br />\nthe backfield and hopes to return be well-qualified to take care of<br />\nfor more next year. As \"Mike\" is it. There are many of last year's<br />\nWORK IN TIME,AND GET A NINE<br />\nEach semester the black list takes its toll at the expense of almost only a Freshman, he can be de- team back at college to act as a<br />\nADMIRAL TSAI TING-KAU LECevery activity on the campus, and each semester hears the com- pended upon for a long period of nucleus. Benedict, Zoller, MurTURES AT HOPKINS<br />\nplaints and laments of the students Who are directly affected.<br />\nplay in the future. When not en- phy, Huey, Parsons, Griffiss, Mctied<br />\nWhy should the black list create such havoc? The scholastic gaged in some phase of football, Daniel, Coady, Bauernschmidt \"China is a sleeping giant,<br />\nmanipuforeign<br />\nby<br />\nfoot<br />\nand<br />\nhand<br />\nrequirements are more strict than at many other colleges to be sure, Mike will play baseball—a sport and Bachman are men who played<br />\nbut they are well known, and with a reasonable amount of work are in which he has had much experi- on the Varsity last year. Routzan, lation,\" said Admiral Tsai Tingeasily fulfilled. The informals give us timely warning, and if taken ence.<br />\na substitute on last year's team, Kau at the third Huntington Wilin the right spirit, should save us many regrets.<br />\nCharles Pearson Wilson—Carl is expected to make a strong bid liams Memorial lecture on ThursAlthough from a selfish standpoint alone, we should put forth is twenty-two years old, weighs for the goal position. There are<br />\nday afternoon. He then went on to<br />\nour best efforts to stay off the \"honor roll,\" we should also remember 152 pounds and is in his second many Freshmen who are showbeing rethat we owe something to the activity or activities that we are out year of residence at the Medical ing up well among whom are say that China is slowly<br />\nfor. This is especially true if any difficulty would be found in filling School. He probably plays farther Turnbull, Watson, Knipp, Town- leased, due particularly to the efour place. It is not fair to handicap the activities by pure laziness or from home than any other man er, Panetti, Darley and O'Connor. forts of the United States, and<br />\nshort-sightedness on our part.<br />\non the team, as his home town is Nearly all of these men have had that his ultimate hope is that the<br />\nOre. Before coming to prep school experience and the Arms Conference will wholly free<br />\nPortland,<br />\nA QUESTION OF HONESTY<br />\nSchool \"Carl\" a' coaches are watching these and it.<br />\nMedical<br />\nthe<br />\nlocated<br />\nis<br />\neveryone<br />\nknows,<br />\nThe Lost and Found Bureau, as most<br />\nAcademy. He has others carefully.<br />\nPortland<br />\ntended<br />\nin the Y. M. C. A. and conducted only by the efforts of one or two<br />\nThe Admiral then attempted to<br />\ngames this<br />\nthree<br />\nonly<br />\nin<br />\nplayed<br />\nPractice will continue, rain or<br />\nundergraduates. Any thing at all which is found should be taken to<br />\nclear up the general misapprehenthe Y. M. C. A. any day between 12 and 12.30. If an article is not year, but still the Athletic Asso- shine, throughout the most of the<br />\nsion concerning the state of<br />\nclaimed by its owner within two weeks, it is returned to the finder. ciation awarded him a letter on winter. The loss of the cage is<br />\nThis bureau is undertaking a necessary and needful work, al- the grounds of special merit. He keenly felt and extreme measures Chinese political affairs. There<br />\nthough it is getting practically no support from the students. Not expects to return next year and must be taken in order to get the are nominally two governments—<br />\none-third of the number of articles which are found are being turned be a regular backfield man team in condition for their early one in the north, one in the south<br />\nin. This is purely a question of honesty and honor. The men run- \"Carl's\" most spectacular play this games which are among the most —but contrary to general opinion,<br />\nning this bureau are doing so solely because of college spirit. There year was receiving a forward pass difficult on the schedule.<br />\nthe civil war, often talked about<br />\nbetween these two, is confined alis nothing lucrative, there is no prestige and there is but little thanks in the Washington and Lee game<br />\nand following up a thrilling run<br />\nattached to the job. They deserve your co-operation.<br />\ntogether to paper. There is no<br />\nwhich looked as if he must surely FIooker, in charge of the affair. bloodshed, there is no turmoil,<br />\nHOPKINS ELEVEN RICH IN through the opposing eleven. It is break away for a touchdown. In The dance was preceded by several there is no friction. China is abaddition to football, Wilson plays fiery<br />\nspeeches urging co-operation solutely united except for some<br />\n•<br />\nBACKFIELD MEN<br />\nfirmly believed that each of the<br />\nbasketball—when there is a team. in<br />\nthe co-operative stores of the political extremists.<br />\nCalkins to Return for Sixth Season men whose athletic histories are<br />\nIn regard to Shantung, he said<br />\nThe students, girls,<br />\nneighborhood.<br />\nNext Year.<br />\ngiven below is worthy of holding<br />\nthe driving out of the Gerthen<br />\nthat<br />\nto<br />\nMitchell<br />\nadjourned<br />\nDr.<br />\nand<br />\nThe individual biographies of the down a position in a Hopkins back- POLITICAL ECONOMY STUDENTS<br />\nhad meant only the rushing<br />\nmans<br />\nice<br />\nthe<br />\nand<br />\nwas<br />\nbroken<br />\nballroom<br />\nthe<br />\nAT<br />\n\"SHAKE A MEAN LEG\"<br />\nmembers of our championship foot- field and would do himself and his<br />\nother peoples, and in no way<br />\nof<br />\nin<br />\nHAMPDEN<br />\nThen<br />\nJones.\"<br />\ndance<br />\naf\"Paul<br />\na<br />\nby<br />\nball team will be continued with the university credit at any time on the<br />\nWith local talent furnishing the ter dance, encore after encore, was did China profit. The idea of Shanpresentation of four backfield men gridiron. Every one of these men<br />\nin order, Dr. Mitchell often being tung being returned seemed to<br />\nwho were awarded the •\"H\" for have distinguished themselves at music, and with local maidens as<br />\nquite vociferous in his applause. him absurd and ridiculous. But an<br />\ntheir valiant efforts this season. It different times during the past sea- partners, some thirty-five students<br />\nWhen Mrs. Hooker announced effort is now being made to buy<br />\nis a well-known fact that no mat- son, and three of them may be de- of Political Economy danced until<br />\n(about 11 P. M.) that festivities it back at almost any price.<br />\nter how good the line may be and pended upon to show up even more a late hour on Thursday last at<br />\nTing-Kau's<br />\nAdmiral<br />\nTsai<br />\nmust be brought to a close, everyhow well it may open up holes and brillantly next season.<br />\nCenRecreation<br />\nRoosevelt Park<br />\none expressed their reluctance at speech was filled with anecdotes<br />\nIn previous issues, brief accounts<br />\nscatter its opponents, all efforts will<br />\nleaving and all voted \"a pleasant and comparisons, and it was enter, in the wilds of Hampden.<br />\nbe in vain unless the team has alert, of nine regulars have been pubevening.\" According to all avail- joyed not only for what he had to<br />\ninthe<br />\nat<br />\nattended<br />\nThe<br />\nstudents<br />\nshifty backfield men who can grasp lished. We will now present the<br />\nof Dr. Broadus Mitchell, able reports everyone had \"hit the say, but especially because of his<br />\nthe golden opportunities and take past, present and future athletic vitation<br />\npleasing personality.<br />\non the part of Mrs. hay\" at a reasonable hour.<br />\nadvantage of every opening torn histories of Calkins, Markell, Wil- who spoke<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nA<br />\n<br />\n\f1.<br />\nlay,<br />\naole<br />\n: up<br />\nex-<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nCASH PRIZES ARE OFFERED FOR<br />\nESSAYS ON FAR EAST<br />\n<br />\n3<br />\n<br />\nPEP COMMITTEE APPOINTED AT<br />\nFRESHMAN CLASS MEETING<br />\n<br />\nThree prizes of $150, $100, and<br />\nA Freshman class meeting was<br />\n$50, respectively, have been offerheld<br />\nat noon last Wednesday for<br />\ned by the Institute of International<br />\nthe purpose of reminding the<br />\nAll letters intended for publication Education for essays on the genmust be concise, written in ink on<br />\nregular letter size paper, on one side eral subject of \"The Far East— Freshmen that they must obey regonly.<br />\nThe Key to the Armament Prob- ulations. Page O'Connor, class<br />\nNo attention will be paid to anonymous letters, but names signed as an lem.\" This contest, which will be<br />\npresident, pointed out how the<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be judged by a number of prominent<br />\nFreshman class had made a joke of<br />\nomitted.<br />\nEnglish Clothes Tailored in America<br />\nThe publication of a letter is not to university professors in this counFOR SPORT, DRESS, SOCIETY<br />\nitself<br />\nby<br />\nfor<br />\nturned<br />\nthe<br />\nway<br />\nout<br />\nit<br />\nbe taken as an indorsement of its views<br />\nHABERDASHERY<br />\nby the \"News-Letter,\" which invites the try, is open to every undergraduate<br />\nfreest discussion of matters of general<br />\nthe \"rush.\" \"When the class first<br />\nuniversity<br />\nstudent<br />\nin<br />\nor<br />\nany<br />\ncollege<br />\ninterest.<br />\nMt. Vernon 4999<br />\nin the United States. It will close came to Hopkins,\" he said, \"it was<br />\nJanuary 1, 1922. Essays may be regarded as the best Freshman class \"Queen Quality\" Home Made<br />\nChocolates<br />\nwritten on any of the following sub- which had ever come here. Now,<br />\nMr. H. DOUGLAS COTTON,<br />\nVISIT OUR ICE CREAM PARLORS<br />\nrelative to the main<br />\nwhich<br />\nare<br />\njects<br />\nEditor-in-Chief,<br />\nafter the way we acted at the<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\ntopic:<br />\nJohns Hopkins NEWS-LETTER,<br />\n\"rush,\" we are a joke. The upper<br />\n(1) \"The open door policy in<br />\nCircuit Photography<br />\nHomewood, Baltimore.<br />\nChina considered from an historic classmen are disgusted with us. A<br />\nFlash Lights<br />\nViews<br />\nDear Sir: Will you please pub- point of view and in relation to few of you fellows had to work<br />\nCharles and 22nd Sts.<br />\nGroups<br />\nEnlargements<br />\nDelicious Sodas and Sundaes<br />\nlish the following letter in your col- its conflict with the practice of in- on Saturday, but in the majority<br />\nKODAK FINISHING<br />\nThe Best of Candies<br />\numns, as an expression of the ap- terest in China.\" (2) \"How may<br />\n325 N. Howard St.<br />\nof cases there is no excuse.\"<br />\nPrompt 8z Efficient Service<br />\npreciation of the members of the Japan provide for its increasing<br />\nGeorge Darley, Freshman deleVarsity Club of the efforts made by population without violating the<br />\nvarious groups of men to make rights of other states?\" (3) \"The gate to the Student Council, said:<br />\nYoung Men's Clothing<br />\n1921 the best football year in Hop- relation of East and West with ref- \"At the last meeting of the Student<br />\n1 W. University Parkway<br />\nand Furnishings<br />\nkins' history.<br />\nerence to the colonies and settle- Council a good deal was said about<br />\nOpposite J. H. U. Athletic Field<br />\nTo the Editor of the NEWS-LETTER. ments of western nations in the the Freshmen breaking regulations. Are made a special feature of<br />\nNow that the 1921 football sea- Orient and its influence on the deDRUG STORE for J. H. U. BOYS<br />\nhere.<br />\nThese regulations are not Sophoson is over, it is fitting that a few velopment of oriental peoples.\"<br />\nPHONE, HOMEWOOD 2121<br />\nmore regulations. They are Fresh- Give us a call and<br />\nlet us become<br />\nwords should be said by the Var- Further information may be obman regulations for the Freshmen<br />\nsity Club in appreciation of the ef- obtained from the Secretary of the<br />\nbetter acquainted for mutual<br />\nand must be obeyed by the<br />\nforts of those who contributed to International Relations Club, InstiBuy an (II) Pipe made special<br />\nbenefit.<br />\nFreshmen. Only a few Freshmen<br />\nits success. Our thanks go, first of tute of International Education,<br />\nfor the Boys<br />\nall, to the team itself, and to the 407 West 117th St., New York break them, but the class as a whole<br />\nis judged by the action of these<br />\nORDERS RECEIVED FOR<br />\ncoaches. These men, by their con- City.<br />\nfew,<br />\nwho haven't enough spirit to<br />\nstant self-denial and indefatigable<br />\nCOGGINS'<br />\nlive up to the regulations. They<br />\nW1111 James S tem G.NM net<br />\nenergy, have achieved a truly re- no small measure responsible for<br />\nTransfer<br />\nand Baggage Express<br />\nmarkable result. We wish also to this. We also congratulate \"Mike\" didn't even think enough of their<br />\nAUTOMOBILE SERVICE<br />\nHoward<br />\nat<br />\nLexington<br />\nPHONE, HOMEWOOD 2645-W<br />\ncommend the student body for reg- Bowers and his bandsmen on the class to come out to the rush and<br />\nhelp lift these regulations. Some<br />\nular attendance and consistent success of one of the best and most<br />\nmethod must be found to see that Do you know how best to provide<br />\nElkridge Farms Dairy<br />\ncheering at practice and at games. pleasing undertakings ever conan income for your old age?<br />\nthe<br />\nregulations are enforced.\"<br />\nNo one hesitates in saying that no ceived in connection with HopSTRICTLY FRESH MILK<br />\nConsult with<br />\nTo carry out this idea, ten ablebetter cheering has ever been heard kins sports.<br />\nProduced, Pasteurized and Bottled<br />\nW. W. WALKER<br />\nin Howard County<br />\nH. H. LLOYD, Secretary, bodied men were appointed to comon Homewood Field. We venture<br />\npose<br />\na<br />\nFreshman<br />\n\"pep\"<br />\ncommittee.<br />\nCLARK<br />\nBROS.<br />\nEllicott City 231-R<br />\n909<br />\nCalvert<br />\nBldg.<br />\nSt.<br />\nPaul<br />\n2581<br />\nJohns Hopkins Varsity Club.<br />\na guess that Gilson Engle was in<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\n<br />\n14 N,CharlesS reet,<br />\n<br />\nORTMAN'S<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nR.G. by & Company<br />\n<br />\nSTEWART&CI.<br />\n<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you —Of all the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\n<br />\nT<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\ns:1<br />\n<br />\nIf an Accident Occurs<br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\n<br />\n'<br />\n<br />\n.•<br />\n<br />\n.N<br />\n:.-----,-,..-T:<br />\n:<br />\n- ..<br />\n-----------. ,-J-----------,--,:----------,-,--.......<br />\n,,,,,„A,<br />\ni:aIiMrAr.h.Aro<br />\nl<br />\nValett,<br />\n•........ at<br />\n<br />\nS.I •ill<br />\n'',.. I<br />\n•• •'.....<br />\n.iV tillcaV<br />\nIi 1 II.<br />\n• • ••11:1 ..<br />\n• • si a I<br />\n<br />\n:IA -,:illaipp.al<br />\n<br />\nf,<br />\n<br />\nIlia<br />\n<br />\n(<br />\n<br />\nMURAD.<br />\n<br />\nIV r<br />\n<br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br />\n<br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br />\n<br />\nMURAD—<br />\n<br />\nS. ANARGYR0S.<br />\nand individuality is offered here at prices that are not<br />\n<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\n..........2<br />\n6:7.41<br />\n<br />\n- ,<br />\nair:: :<br />\n<br />\n. AZI.<br />\n<br />\nTHINK OF<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nNone has the delicious<br />\nFLAVOR of the finestTurkish—<br />\nNone gives the ENJOYMENT of the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\n...:<br />\n-.,,,,<br />\n•<br />\nNone but the highest grade<br />\ntii if 1<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\n<br />\nTry IVIURAD today and<br />\n<br />\nCAPITAL STOCK OWNED BY P. LORILLARD CO.<br />\n<br />\n\"Judge for<br />\nYourself—!\"<br />\n<br />\n(IOC 11000PW II<br />\n.r..;re.<br />\n<br />\n151Dindr.ffirMrcirWVieraZt,Witar<br />\n<br />\n20c<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nOur -prep- room on the<br />\nthird floor specializes in<br />\n<br />\nclothes for young men.<br />\nndina<br />\n<br />\nilie<br />\n<br />\nHub<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\n40,1<br />\n<br />\nr<br />\n''°4<br />\n*<br />\n- 164<br />\nEisti.nuplZaintiettbrii<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nHOPKINS SONG BOOK WILL<br />\n<br />\nSOPHS WIN DEBATE<br />\n<br />\nAPPEAR AFTER CHRISTMAS<br />\nBefore a fairly large audience in<br />\n(THE BOOK MART)<br />\nVACATION<br />\nthe C. D. Hall last Friday night,<br />\nComplete Stock of<br />\nTo Include Many Forgotten Favorites. the Sophomore Debating Team<br />\nMedical Books and College<br />\nThe Hopkins Song Book, which downed their Freshmen rivals.<br />\nRequisites<br />\nDr. John C. French presided,<br />\nhas been so eagerly awaited, will<br />\nand<br />\nthe judges were Mr. Thach,<br />\nImporters and Dealers in Fine Books make its appearance immediately<br />\nCapt. Atwater and Dr. Cowles.<br />\n301 N. CHARLES ST.<br />\nafter the Christmas holidays. DeThe subject of the debate was,<br />\nBaltimore, Md.<br />\nsirable as such a song book has \"Resolved: That a Policy of Naalways been, it has remained for tional Insurance Against Unemthe Omicron Delta Kappa to ployment Should Be Adopted.\"<br />\nmake it a reality. Douglas Coulter and the winning team was comand H. D. Cotton are editor and posed of Eisenberg, Bamberger<br />\nbusiness manager, respectively, of and Terlitzky. The Freshmen repeV<br />\n\"<br />\nresentatives were Moehle, Schlutthe book.<br />\nThe volume will contain all of ter and A. Levene.<br />\nv<br />\ne<br />\n41<br />\ntLabeXatteri<br />\nA delightful dance followed, at<br />\nthe college songs popular at Hop-\"M tS H.& OSCAR G.1-0•44:1<br />\nwhich<br />\nthe University Jazz Band<br />\nkins now, and many of the old<br />\nOWN ERS<br />\nrendered<br />\nthe music.<br />\nsongs which are not so well known<br />\netel4<br />\n1.14413Zt<br />\nat present.<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nCoulter has let none of these old DR. HULBURT INJURED IN<br />\nSOLE AGENTS FOR BALTIMORE favorites slip by. Songs included<br />\nACCIDENT<br />\nFor College Fraternity Bands •<br />\n\"Uni\"University<br />\nOde,\"<br />\nare<br />\nthe<br />\n(Greek Letter Societies)<br />\nDr. Lorraine S. Hulburt, profesversity Alma Mater,\" \"Grave sor of Mathematics at the UniThe Chas. Willms Surgical<br />\nYard,\" \"To Win,\" Everybody versity, is at the Maryland GenInstrument Co.<br />\nBets<br />\non Hopkins,\" \"We Have eral Hospital with a fractured<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSand<br />\nin<br />\nOur Makeup,\" \"On the skull resulting from an automobile<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nLine,\" \"Alma -Mater in Dixie- accident last Saturday night. In an<br />\nStethoscopes<br />\nBlood Lancets land,\" \"The Black and Blue,\"\"To attempt to cross the street at<br />\nBlood Counters<br />\nSt. John's,\" \"Ain!t They Neat, corner of Charles and 29th streets,<br />\nHa!<br />\nHa!\"\"Johnny Hopkins on to Dr. Hulburt was knocked down by<br />\nJ. H. Furst & Co.<br />\nVictory,\"<br />\n\"The Freshie,\" \"Hulla- a speeding machine. Reports from<br />\nPrinters of Philological and<br />\nbaloo<br />\nBoys,\"<br />\n\"The Toast We the hospital late last night showed<br />\nScientific Works<br />\nDrink,\"<br />\nand<br />\n\"The<br />\nMarch of Vic- his condition to be improved.<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\ntory.\"<br />\nIt is interesting to note that we<br />\nWEDNESDAY BIBLE CLASS<br />\nare in possession of an Alma Ma109 M. E. AT 12.30<br />\nter song after all the commotion<br />\nChaplain F. C. Reynolds, of the<br />\nthat was raised over the supposed 115th Infantry, will be leader at<br />\nlack of one. When the Song Book the Bible Class<br />\ntomorrow. The<br />\nappears the Alma Mater song will discussion will center<br />\nabout the<br />\nprobably be the center of inter- first part of the<br />\nOld Testament<br />\nest, while a great deal of cu- and its application to<br />\npresent-day<br />\nriosity has been aroused .concern- affairs.<br />\ning that called \"The Freshie.\"<br />\nThis promises to be a very in17 E. Baltimore St.<br />\nThere is also a great deal of teresting meeting and<br />\nevery one is<br />\nlively speculation concerning the urged to<br />\nattend.<br />\nidentity of the well known friend<br />\nPrinters of the<br />\nof the University to whom it is<br />\nJohns Hopkins News-Letter<br />\nannounced the book will be dedicated.<br />\n\"ex/zetioVitecle\"<br />\nThe general makeup of the book<br />\n-v\"<br />\nwill be most attractive. A handRt<br />\n4r<br />\n/S<br />\nsome leatherette cover of a very<br />\nl<br />\ni i0R<br />\nbeautiful shade of dark blue<br />\nstamped<br />\nin gold with a cut of Gilk\\/1<br />\nman Hall showing the driveway<br />\nand trees around the building will<br />\nii<br />\ngive the book a pleasing appearance.<br />\nThe book will cost only a dol134419<br />\nlar and a quarter and from an inspection of its appearance and<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS contents it should be well worth<br />\nit.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nZW<br />\n<br />\nThe Home of<br />\n<br />\nThe Overcoat<br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchable values!<br />\n$35 and up<br />\n<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\n<br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\n<br />\nMEN'S SHOES<br />\n<br />\nST. PAUL and TWENTIETH STS.<br />\n<br />\nOf the Better Class<br />\n<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 11 o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br />\n<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nJ 'NIKIINS<br />\nSILVERWARE<br />\n<br />\nJ<br />\nDIAMONDS<br />\n<br />\nJEWELRY<br />\n<br />\nLA TAUSCA PEARLS<br />\nSOLD ON VERY CLOSE MARGIN OWING TO OUR LOW EXPENSES<br />\n<br />\n12 CLAY STREET<br />\n(3 Doors from Charles Street)<br />\nSee Our Latest Designs in Bureau Silver<br />\n<br />\n9'<br />\n<br />\nIn Architecture<br />\n<br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\n<br />\nCHRISTMAS COTILLON TO BE<br />\nELABORATE AFFAIR<br />\n<br />\nAt a meeting of the Cotillon<br />\nBoard, held on Thursday, December 21st, final preparations were<br />\nmade .for the Christmas Cotillon to<br />\nbe held in the C. E. Hall tomorrow<br />\nN. HESS' SONS<br />\nnight. Due to the large number<br />\n8 E. BALTIMORE ST.<br />\nwishing to attend the cotillon, it<br />\nwas found necessary by the board<br />\nto issue a few more tickets to each<br />\nmember, and to compensate for this<br />\nincrease a supplementary order for<br />\nMADE TO ORDER<br />\nthirty additional programs was sent<br />\nAND<br />\nto the printer. It is especially announced<br />\nby the board, however,<br />\nFINISHED CLOTHES<br />\nthat due to this increase in the tickPLAZA BUILDING<br />\net sale absolutely no one will be ad19 and 21 EAST FAYETTE ST.<br />\nmitted without a ticket. It is regretted that everyone who wishes<br />\nto attend cannot be accommodated.<br />\nSHOES<br />\nbut the size of the hall makes it abfor<br />\nsolutely necessary to limit the numUNIVERSITY MEN<br />\nber.<br />\nThe hall is to be decorated with<br />\nFor Sport Wear<br />\nFor Dress<br />\nChristmas<br />\ngreens, and with FishSmart Styles—Best Leathers<br />\nOrchestra<br />\nsupplying the muer's<br />\nModerate Prices<br />\nsic, and the new plan inaugurated<br />\nby the board this year the cotillon<br />\nis expected to be the most successful ever held at Hopkins.<br />\n19 W. LEXINGTON ST.<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\n<br />\nLEMMERT<br />\n<br />\nWYMAN<br />\n<br />\nEN you go after your first big commission, you'll<br />\n/<br />\n1<br />\n4<br />\nV 71<br />\nreed<br />\nsomething more than a knowledge of stresses<br />\nand strains,periods and piping. You'll need the atmosphere<br />\nof success, and the air of knowing your way 'round. One<br />\n<br />\nevidence of this familiarity with the world's good things is<br />\nthe habit of preferring that citizen of the world—<br />\n<br />\nelachrino<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nRemember that Melachrino is the master blend<br />\nof only the finest Turkish Tobaccos as originated by Miltiades Melachrino. Egyptian cigarettes are simply those that originated in Egypt.<br />\nBut the tobacco is what you want to know<br />\nabout—and if it's Melachrino —it's right.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 21<br />\nVALUE OF DORMITORY<br />\nQUESTIONNAIRE DOUBTED<br /><br />\nBALTIMORE, MD., DECEMBER 20, 1921<br />\nHOPKINS TO HAVE SWIMMING TEAM<br /><br />\nDR. BIRCKHEAD ADDRESSES<br />\nASSEMBLY ON PALESTINE<br /><br />\nTAU BETA PI INITIATES<br />\nEIGHT NEW MEN<br /><br />\nPRICE 5 CENTS<br />\nANSWERS TO STADIUM<br />\nQUESTIONNAIRES RECEIVED<br /><br />\n0. D. K. Circle Expresses Belief That To Be Financed by Sale of Minor Sport Pastor of Emmanuel Church Makes Honorary Engineering Fraternity Holds Ohio State Building Million-dollar<br />\nStand. Illinois to Spend Two Million.<br />\nTickets. Six Meets Scheduled.<br />\nFormal Initiation.<br />\nLittle Weight Should Be Attached<br />\nInteresting Talk.<br />\nto Returns from Cards Recently<br />\nAs soon as the proposition of<br />\nJohns Hopkins will have a swim- i Dr. Hugh Birckhead, rector of<br />\nTuesday evening the formal iniDistributed in Boxes.<br />\nbuilding a stadium at Homewood<br /><br />\nming team this year in spite of the<br />\nThe returns to the questionnaire total lack of funds available for the<br />\nconcerning the dormitory sent out support of minor sports. Although<br />\nby the Treasurer's office were very<br />\nhandicapped greatly by the fact<br />\npoor, a very low percentage of the that only last week was the official<br />\nstudents signifying their inten- sanction of the Varsity Club setion of living in the proposed cured, Manager Davidg-e Rowland<br />\nbuilding. Commenting upon the has arranged a very attractive<br />\nresults the secretary of Omicron schedule which calls for dual meets<br />\nDelta Kappa, speaking for the cir- with every member of the Middle<br />\ncle, expressed the opinion that the Atlantic Swimming Association.<br />\ndistribution of these cards was not The tentative schedule is as folunfortunate, for it is possible that lows:<br />\nwhile little or no weight should be<br />\nJanuary 21—Swarthmmore, at<br />\nattached to them, the:returns will<br />\nSwarthmore.<br />\nhave a detrimental influence on<br />\nFebruary 4—Syracuse (tentathe trustees with whom the final<br />\ntive).<br />\ndecision now rests.<br />\nFebruary 11—Lehigh.<br />\nHe said in part: \"The- chief obFebruary 18—George Washingject in building a dormitory is to ton (tentative).<br />\ndraw to Hopkins a class of stuFebruary 25—Rutgers, at Rutdents which she does not now get. gers.<br />\nThe dormitory will be s-upported<br />\nMarch 11—Eastern Intercolleby these students and an attempt giate<br />\n(tentatiVe).<br />\nsuch as was recently made to atThe whole program, however,<br />\ntam n an idea of the revenues to be<br />\nhinges on the Lehigh meet on Satreceived from the building from a urday, February 11. After this<br />\ncensus of the present students is meet a large dance will be given in<br />\ntherefore worthless. The students the gymnasium of the Baltimore<br />\nWho received the cards were for Athletic Club.<br />\nTickets will be<br />\nthe most part local boys, while tl$1.50, and at least 100 must be sold<br />\nothers were already located in fra- to insure the success of the swimternity houses or convenient ming season. If $150 can be raised<br />\nboarding houses, and although the in this way the Varsity Club will<br />\nreturns, considering the out-c\" add enough to put the season<br />\ntown students alone, were encour- across.<br />\naging, they could not begin, even<br />\nLast year Hopkins finished secif a favorable reply from out-of- ond in<br />\nthe league, defeating all<br />\ntown students had been received teams but<br />\nRutgers, who won the<br />\nto guarantee sufficient revenue.<br />\nchampionship. In spite of the loss<br />\n\"Thus, until the dormitory is of several men from last year's<br />\nactually erected, it will be difficult team, Hopkins should ,do as well,<br />\nto estimate the demand which will if not better, this winter. Among<br />\nbe made for rooms. The 0. D. r those who remain from last year's<br />\ncircle believes, however, that once squad is Captain Paul Buhrer, a<br />\nthe building is erected, it will be capable performer in the dashes and<br />\na matter of a few years at most be- on the relay team. The one best<br />\nfore the demand for —<br />\nrooms will bet will probably be Davvy Rowexceed the supply. Our scholastic land, captain and star of last year's<br />\nstanding is unquestioned, our team. He is almost unbeatable in<br />\nathletic teams are displaying the dashes up to 100 yards and<br />\nsteadily increasing prowess and in the breast stroke. Coady can be<br />\nnon-athletic activities compare fa- counted on to win his share of the<br />\nvorably with those of other col- distance events while Johnson and<br />\nleges. The one thing that we lac__ Morrell will fill out the relay team.<br />\nis the proper housing facilities and Bob Hall will take care of the backadequate center of college life. stroke and Hambleton should exWith a definite assurance that this cel in the plunge. The only new<br />\nlack will be remedied by next Oc- man with any previous experience<br />\ntober the 0. D. K. deputations is Betts Slingluff, captain of the<br />\nWill be in an excellent position to City College team last year. Only<br />\nPersuade students from out of in the fancy diving and plunge will<br />\ntown prep schools to come to the team be weak and unless some<br />\nRopkins.<br />\nman is found to handle the dive<br />\n\"Now is the time to act. If the the rest of the team will be greatly<br />\ndormitory is not ready by next handicapped.<br />\nfall another year is lost. If it will<br />\nPractice will begin immediately<br />\nbe ready in October a definite ad- after the Christmas holidays and<br />\nvertising campaign can be organ- will be held in the pool of the Balized and with the alumni and fac- timore Athletic Club. On account<br />\nulty back of it and the students of lack of funds no coach has been<br />\nco-operating with the splendid secured, but Captain Buhrer and<br />\nSpirit they have shown this fall, it Manager Rowland will instruct all<br />\nis probable that the building could candidates and will pick the team.<br />\nbe made almost a paying propisi- But the real success of the team will<br />\ntion next year and certainly a fin- depend on the support accorded the<br />\nancial success by the following dance after the Lehigh game; if<br />\nOctober.\"<br />\nthe money for financing the team<br />\nAt the private initiation of the cannot be secured in this way the<br />\neight members elected to the circle succeeding meets must be cancelled<br />\nthis fall, which was held Monday and the swimming season will fall<br />\nnight at the Hopkins Club, the through.<br />\nfollowing committee: H. D. Cot- I<br />\nt°n, chairman; R. M. Wood and<br />\nNOTICE<br />\nbavidge Rowland, was appointed<br />\nAn important meeting of<br />\nto bring the student sentiment<br />\nthe NEWS-LETTER Board Will<br />\nConcerning the erection of a dorbe held today at 12.30.<br />\nulitory before the trustees.<br /><br />\nEmmanuel Protestant Episcopal tiation of new members of the Tau<br />\nBeta Pi, honorary engineering so- was considered seriously by the<br />\nChurch, addressed an interested<br />\nciety, was held in the Mechanical Varsity Club steps were taken to<br />\naudience last Thursday at the Engineering Building. Dr. John find out the methods of financing<br />\nweekly assembly on his recent trip Boswell Whitehead, Dean of the employed by other universities.<br />\nto Palestine. He spoke of the pos- Engineering School, was taken in Dr. Van Orman sent questionsibility and practicability of the as an honorary member. Charles naires to a number of colleges<br />\nowning stadiums and has received<br />\nZionist movement and advised Bryant, David Thomas, William<br />\nWiekel, Charles Rudel and Andrew answers from four of them.<br />\nthat all Jews study. the question<br />\nThe big Ohio State stadium at<br />\nKnecht, members of the Senior<br />\nvery carefully before they decide<br />\nClass, were taken in at the same Columbus is now under construcwhether or not the coming Ziontime, along with Calvin Warfield, tion and will be finished for the<br />\nist campaign is a feasible project.<br />\na Junior, who has the highest aver- football season next year. This<br />\nDr. Birckhead was accompanied age in his class.<br />\nstadium is in the form of a horseon his trip by Rabbi Lazaron, of<br />\nFollowing the initiation cere- shoe and has a permanent seating<br />\nthe Baltimore Hebrew Congrega- monies, a banquet was served at capacity of 63,000. It will cost<br />\ntion. They left Baltimore the early the Hopkins Club. The speaker of $1,341,000, all of which has been<br />\nraised by subscription among the<br />\npart of last summer and proceed- the evening, Colonel Procter, of<br />\nthe Maryland Casualty Company, alumni and students.<br />\ned by way of the Mediterranean<br />\nThe Harvard stadium, one of<br />\nwas introduced by Davidge RowSea to Cairo, Egypt, where they land, president of the chapter. Col- the oldest in the country, also has<br />\ntook a train for Palestine. At the onel Procter spoke of the position the shape of a horseshoe. Its perSuez Canal they had to get off and of the engineer in society, stating manent seating capacity is 30,000<br />\nwalk across a shaky pontoon that the<br />\nengineer's present status and 20,000 more can be aCcommobridge over the canal. On the was wholly due to the engineer dated if necessary. When erected<br />\nother side they boarded another himself. Dr. Whitehead also de- in 1902 this structure cost $295,train which took them along the livered a short talk.<br />\n000, which was given by the class<br />\ncoast of the Mediterranean on the<br />\nThe first eight of the present of 1879 and friends. In 1911 a colleft and the great desert on the Junior Class will be eligible for onnade roof and extra wooden<br />\nright, until they reached their des- election into the chapter this com- stands were built at a cost of $44,tination.<br />\ning spring. The choice of new 000. Only football games and<br />\nHe said that this country, in members will be based partially on track meets are held inside this<br />\nshape, was not unlike an irregular the results of the mid-year exam- stadium.<br />\nparallelogram, with the Dead Sea, inations.<br />\nThe famous Yale bowl is built<br />\nthe Sea of Galilee and two points<br />\nhalf<br />\nabove and half below ground.<br />\npurpose<br />\nof<br />\nthe<br />\nTau<br />\nBeta<br />\nThe<br />\non the Mediterranean as its ver- Pi, which is the engineering Phi The field is entirely surrounded by<br />\ntices. Some sections of it are far Beta Kappa, is to group together seats to which access is obtained<br />\nbelow sea level, while other parts men who are vitally interested in through openings in the aisles<br />\nare very mountainous.<br />\nthe development of the engineering about one-third the way from the<br />\nDr. Birckhvad gave a short but world and in their Alma Mater, and bottom. The stands will seat<br />\nvivid description of the life and this opportunity is taken to bring 65,000 permanently and an extra<br />\nactivities of the people. The condi- before the students of the univer- 15,000 can be taken care of. Figtions of the men as a whole are sity the purport of the /society with uring on the basis of the cost per<br />\nvery good, but that of the women the hope that there will result a seat this stadium was built at beis deplorable. They are looked keen and friendly rivalry between tween $7 and $10 for each seat.<br />\nupon and treated with little more the engineering students for adWord has just been received<br />\nrespect than slaves. This is espe- mittance.<br />\nfrom the University of Illinois<br />\ncially true among the Mohammethat they have successfully comdans who are ruled by the laws<br />\npleted a campaign for $2,000,000<br />\nSOPHS TO HOLD PROM<br />\nof the Koran.<br />\nAt a meeting of the Sophomore with which to build a memorial<br />\nDr. Birckhead recounted the Class held last Thursday in the stadium—the largest in the counstory of the English-Jewish chem-. M. E. Hall, President Callard try. This immense structure will<br />\nist who invented a poisonous gas suggested a Sophomore Prom and have a seating capacity of 75,000<br />\nduring the World War which was as the class enthusiastically ap- and a total capacity of 100,000.<br />\nmore deadly than the German proved, he appointed a commit- The field will not only be used,for<br />\nmustard gas, and presented the tee, consisting of G. M. Shriver, football, but also for all other<br />\nformula to the British War Office Jr., Chairman; Mount, Leopold sports.<br />\nThese reports should surely be<br />\non condition that after the war the and Harwood, to take charge of<br />\nencouraging<br />\nfor our own prosJews be allowed to return to Pal- the arrangements. No date was<br />\npects.<br />\nThey<br />\nshow<br />\nthat athletics is<br />\nestine. England promised this and selected, this detail being left to<br />\ngetting<br />\na<br />\ntremendous<br />\ngrip on the<br />\nwhen the war was over took over the discretion of the committee,<br />\npublic<br />\nand<br />\nthat<br />\nthey are willing to<br />\nthe country as a protectorate. Im- but it is proposed to hold the affair<br />\nmediately the Jews began to flood some time after the mid-year ex- patronize college games. With a<br />\ninto the country. They came most- aminations. Presidnt Callard stip- stadium of fifty or sixty thousand<br />\nly from Russia and other Eu- ulated that the men who are seating capacity, Hopkins would<br />\nropean countries. Those in Ameri- dropped from the University may be able to make her sports pay<br />\nfor themselves in a short while.<br />\nca, Dr. Birckhead said, had be- attend.<br />\ncome good American citizens and<br />\nIt was decided that owing to the FIELD CLUB TO MAKE STUDY OF<br />\ndid not wish to return. This great negligence of last year's class in<br />\nBIRDS AT HOMEWOOD<br />\ninflux stirred up trouble among awarding numerals, men who In the next few days the Field<br />\nthe Jews and Mohammedans and played either last year or in the Club will make a trip to the westcaused considerable rioting. The game last Satu<br />\n. rday would be re- ern part of the city to study the<br />\nJews, outnumbered seven to one, warded. The following men were crow roost, which has been there<br />\nwere treated with much severity. voted their 24's: Coady, Harwood, for many years. Mr. Douglas will<br />\nThe British authorities could not Tatum, Ohrenschall, Ross, A., be in charge of the trip.<br />\nlet this rioting continue and they Smallwood, Dorsey, W. H., Mar- During the Christmas holidays<br />\nstopped it by forbidding any more chetti, Ellicott, Limbach, Homer, the Field Club will make a study<br />\nJews to immigrate. This .has Shriver, J. S., Dunning, Marino, of the birds at Homewood. A recaused much dissatisfaction, but Wilgis, Shriver, G. M. ,Jr., Mc- port will then be sent to Washingit was the only thing the English Daniel, Hutzler, Barton Strause, ton. This is a national affair, because it is at this time that reports<br />\ncould do to save the jews, Dr. Raleigh, Ashton and Gluck.<br />\nBirckhead signified.<br />\nAll members of the class were of the birds in all sections of the<br />\nOf the future of Palestine, he urged to attend the Freshman- country are sent in to Washington<br />\nsaid, no one can prophesy, but it Sophomore debate held in the C. for the tabulation of statistics.<br />\nis a country without many nat- E. Hall last Friday and it was asCORRECTION<br />\nural resources and must conse- sured that music would be furThe Delta Phi representative to<br />\nquently depend on neighboring nished for dancing after the de- the Interfraternity Smoker Combate.<br />\ncountries for its many needs.<br />\nmittee was C. Tilghman.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br /><br />\n2<br /><br />\nNOTICE<br />\nlis and Wilson—four of the shin-' FOOTBALL BANQUET TO BE<br />\nTHURSDAY<br />\nHELD<br />\nDecember 13, 1921.<br />\ning lights of the backfield. _<br />\nCaptain to Be Elected.<br />\nFrederick Russell Calkins, Jr.<br />\nThere will be no drill Thursday,<br />\nFOUNDED 1897.<br />\n\"Eric,\" is twenty-four years old and<br />\nNext Thursday night, at 7.30 the 22nd inst. The unit as a whole<br />\n$2.50<br />\nSubscription<br />\nweighs 175 pounds. Not satisfied P. M., the football banquet will be has done such satisfactory work up<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at with playing all through his under- held, and at that time the captain to date that it is a pleasure to exBaltimore, Md., under Act of Congress, November 3, 1879.<br />\ngraduate years, he returned to the for next year's team will be elected. tend this privilege.<br />\nCaptain Paul desires to extend a<br />\nPublished semi-weekly from October to June by the students of Johns team as one of the few medical At the present time there seems to<br />\nHopkins University.<br />\nschool representatives. Watertown be only two candidates for the po- Christmas greeting to the FreshBusiness communications should be addressed to the BUSINESS MAN- High School was the early alma sition. Tom Landy and \"Happy\" man Class. He appreciates the fine<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nmater which harbored \"Eric\" in his Middleton. Tom has been on the work that the class as a whole has<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100 tender years. Calkins has played Varsity for three years and has done to date. I would like to add<br />\nTelephone<br />\non the team at fullback for lour been a star every year, making the my appreciation to that of Captain<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nyears. He is now in the Medical All-Maryland Team his first and Paul's and to state to the Freshman<br />\nH. DOUGLAS COTTON,'22.<br />\nFREDERICK W. LIPPS, '22.<br />\nSchool and if his•duties will permit second years. He seems to be able Class that its work to date is easily<br />\nManaging Editor:<br />\nhe will continue at the game for the to keep up his own and the whole fifty per cent. better than the work<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nnext three years. Eight games this line's fighting spirit at all times, and of any other Freshman Class in the<br />\nGLOVER P. FALLON, '23.<br />\nAssociate Editors:<br />\nseason have seen \"Eric\" starting at is a very likely candidate. \"Happy\" Military Department since the R.<br />\nELI FRANK, JR., '22.<br />\nAdvertising Manager:<br />\nhis old position. In addition to broke into the limelight this year 0. T. C. was started in this UniDONALD K. VANNEMAN, '23.<br />\nJunior Editors:<br />\nlacrosse, track and base- at left end. He was speedy, a sure versity.<br />\nfootball,<br />\nCHARLES C. MARBURY, '22.<br />\nAssistant Business Managers:<br />\nhis athletic accom- tackler and showed ability in diagcompose<br />\nball<br />\nJ. BRENTNALL POWELL, '23.<br />\nCaptains Long and Atwater give<br />\nBERNARD C. HEARN, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\nplishments.<br />\nsatisfactory<br />\nreports of the Sophothe<br />\nall<br />\nLEWIS,<br />\n'23.<br />\nHe<br />\nC.<br />\nshows<br />\nplays.<br />\nJOHN<br />\nnosing<br />\nJ. HUDSON HUFFARD,'23<br />\nFITZGERALD DUNNING, '24.<br />\nJohn Usher Markell. John is 22 qualities of a good leader and if more Class as a whole.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nyears old and weighs 170 pounds elected will undoubtedly make a<br />\nCaptain McMurray reports that<br />\nick<br />\n.<br />\nthe<br />\nFreder<br />\ngridiron.<br />\nfor<br />\nclad<br />\nJunior Class is taking keen inthe<br />\ngood captain.<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nis his home town, but he \"prepped\"<br />\nThe final decision in the matter terest in field engineering, and is<br />\nof<br />\nHagersSchool<br />\nJames'<br />\nSt.<br />\nat<br />\nlies with those men who received making very satisfactory progress.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntown. Markell has been on the the \"H\" this season—Totterdale, The Senior Class as a whole' is<br />\nsquad four years. He prefers the Markell, Bonner, Calkins, Darley, doing satisfactory work.<br />\nBALTIMORE, MD., DECEMBER 20; 1921<br />\nbackfield positions, and has always, Wilson, Knecht, Landy, Magill, With the exception of the Freshplayed there in every game of Middleton, Westerman, Rich and man Class, which holds a unique<br />\nCHRISTMAS GREETINGS<br />\nrecord, and which if it keeps up<br />\nThe News-Letter wishes to take this opportunity to wish the which he has been a participant. Brawner.<br />\nJohn played in six of the games this<br />\nits present rate of progress, will<br />\nFaculty, Alumni and Students a very Merry Christmas.<br />\nachieve an astounding record, there<br />\nIt also wishes to announce that the next issue of the News-Letter year and always succeeded in proLACROSSE PRACTICE BEING<br />\nfor<br />\nthe<br />\nreal<br />\nthrills<br />\nsome<br />\nducing<br />\nFriday<br />\nissue<br />\nthe<br />\nas<br />\ntenth,<br />\nthe<br />\na few members in each class<br />\nare<br />\nJanuary<br />\nTuesday,<br />\nuntil<br />\nwill not appear<br />\nHELD DAILY<br />\nthat<br />\nsorrow<br />\nIt<br />\nwith<br />\nis<br />\nspectators.<br />\nare lagging behind. These<br />\nholidays.<br />\nwho<br />\nthe<br />\nof<br />\naccount<br />\nwill be dropped on<br />\nthe sttylent body learns that he will<br />\nThe inclement weather of the men are again warned that the milBOOST HOPKINS!<br />\nnot return next year for post-grad- past week has not prevented la- itary tests are clean-cut this year<br />\nChristmas vacation will soon be with us, and temporarily, at<br />\nuate work. In addition to football, cross practice and Head Coach and unless the conditions are fulleast, we can forget our informals, and live only for the present. Alis a track man of no mean \"Johnny\" Knipp asserts that his filled a student will not be passed<br />\nJohn<br />\nthough, at our own risk, we can forget the unpleasant features of our ability.<br />\nsquad is rapidly rounding into as satisfactory.<br />\nexistence,' we should remember to spend our time in the interest of<br />\nBeauford Willis. \"Mike\" is one form. A board wall has been conOver 95 per cent, of the students<br />\nthe University. Vacation time is the time for every student to boost of the football finds of the 1921 seaconthe<br />\nof<br />\nthe<br />\nrear<br />\nstructed in<br />\nin the Military Department deserve<br />\nHopkins. A well placed word here or there is an excellent advertiseson. Baltimore City College was crete stand and when the weather every encouragement and appreciament for the University, and is not to be deplored. It is the student his prep school, but he did not enprohibits practice on the field the tion. I hope that the entire unit<br />\nwho is always ready with a good word and never knocks the Uniter Hopkins until after he had done squad holds forth under the will have a most delightful Christversity who boost the institution.<br />\nservice in the Navy. Twenty-four stand.<br />\nmas and will return prepared to<br />\nWe believe that Hopkins possesses many students of this kind. years of age and weighing 165<br />\narhas<br />\nCollins<br />\nActing<br />\nManager<br />\nup the important work that<br />\ntake<br />\nWe believe that the splendid spirit displayed this fall is not mere pounds,.' Mike\" is not a backfield<br />\nthe<br />\nbut<br />\na<br />\nschedule<br />\ndifficult<br />\nranged<br />\nfollows.<br />\nfroth, but is a surface indication of genuine feeling. The Christmas man to be trifled with. He has<br />\nE. B. GAREY,<br />\ncoaches feel that if the squad convacation offers an opportunity to prove that our opinion is correct. played in four games this year in<br />\nwill<br />\nInfantry.<br />\nMajor,<br />\nit<br />\nprogress<br />\npresent<br />\ntinues<br />\nits<br />\nMake good use of your vacation and talk Hopkins.<br />\nthe backfield and hopes to return be well-qualified to take care of<br />\nfor more next year. As \"Mike\" is it. There are many of last year's<br />\nWORK IN TIME,AND GET A NINE<br />\nEach semester the black list takes its toll at the expense of almost only a Freshman, he can be de- team back at college to act as a<br />\nADMIRAL TSAI TING-KAU LECevery activity on the campus, and each semester hears the com- pended upon for a long period of nucleus. Benedict, Zoller, MurTURES AT HOPKINS<br />\nplaints and laments of the students Who are directly affected.<br />\nplay in the future. When not en- phy, Huey, Parsons, Griffiss, Mctied<br />\nWhy should the black list create such havoc? The scholastic gaged in some phase of football, Daniel, Coady, Bauernschmidt \"China is a sleeping giant,<br />\nmanipuforeign<br />\nby<br />\nfoot<br />\nand<br />\nhand<br />\nrequirements are more strict than at many other colleges to be sure, Mike will play baseball—a sport and Bachman are men who played<br />\nbut they are well known, and with a reasonable amount of work are in which he has had much experi- on the Varsity last year. Routzan, lation,\" said Admiral Tsai Tingeasily fulfilled. The informals give us timely warning, and if taken ence.<br />\na substitute on last year's team, Kau at the third Huntington Wilin the right spirit, should save us many regrets.<br />\nCharles Pearson Wilson—Carl is expected to make a strong bid liams Memorial lecture on ThursAlthough from a selfish standpoint alone, we should put forth is twenty-two years old, weighs for the goal position. There are<br />\nday afternoon. He then went on to<br />\nour best efforts to stay off the \"honor roll,\" we should also remember 152 pounds and is in his second many Freshmen who are showbeing rethat we owe something to the activity or activities that we are out year of residence at the Medical ing up well among whom are say that China is slowly<br />\nfor. This is especially true if any difficulty would be found in filling School. He probably plays farther Turnbull, Watson, Knipp, Town- leased, due particularly to the efour place. It is not fair to handicap the activities by pure laziness or from home than any other man er, Panetti, Darley and O'Connor. forts of the United States, and<br />\nshort-sightedness on our part.<br />\non the team, as his home town is Nearly all of these men have had that his ultimate hope is that the<br />\nOre. Before coming to prep school experience and the Arms Conference will wholly free<br />\nPortland,<br />\nA QUESTION OF HONESTY<br />\nSchool \"Carl\" a' coaches are watching these and it.<br />\nMedical<br />\nthe<br />\nlocated<br />\nis<br />\neveryone<br />\nknows,<br />\nThe Lost and Found Bureau, as most<br />\nAcademy. He has others carefully.<br />\nPortland<br />\ntended<br />\nin the Y. M. C. A. and conducted only by the efforts of one or two<br />\nThe Admiral then attempted to<br />\ngames this<br />\nthree<br />\nonly<br />\nin<br />\nplayed<br />\nPractice will continue, rain or<br />\nundergraduates. Any thing at all which is found should be taken to<br />\nclear up the general misapprehenthe Y. M. C. A. any day between 12 and 12.30. If an article is not year, but still the Athletic Asso- shine, throughout the most of the<br />\nsion concerning the state of<br />\nclaimed by its owner within two weeks, it is returned to the finder. ciation awarded him a letter on winter. The loss of the cage is<br />\nThis bureau is undertaking a necessary and needful work, al- the grounds of special merit. He keenly felt and extreme measures Chinese political affairs. There<br />\nthough it is getting practically no support from the students. Not expects to return next year and must be taken in order to get the are nominally two governments—<br />\none-third of the number of articles which are found are being turned be a regular backfield man team in condition for their early one in the north, one in the south<br />\nin. This is purely a question of honesty and honor. The men run- \"Carl's\" most spectacular play this games which are among the most —but contrary to general opinion,<br />\nning this bureau are doing so solely because of college spirit. There year was receiving a forward pass difficult on the schedule.<br />\nthe civil war, often talked about<br />\nbetween these two, is confined alis nothing lucrative, there is no prestige and there is but little thanks in the Washington and Lee game<br />\nand following up a thrilling run<br />\nattached to the job. They deserve your co-operation.<br />\ntogether to paper. There is no<br />\nwhich looked as if he must surely FIooker, in charge of the affair. bloodshed, there is no turmoil,<br />\nHOPKINS ELEVEN RICH IN through the opposing eleven. It is break away for a touchdown. In The dance was preceded by several there is no friction. China is abaddition to football, Wilson plays fiery<br />\nspeeches urging co-operation solutely united except for some<br />\n•<br />\nBACKFIELD MEN<br />\nfirmly believed that each of the<br />\nbasketball—when there is a team. in<br />\nthe co-operative stores of the political extremists.<br />\nCalkins to Return for Sixth Season men whose athletic histories are<br />\nIn regard to Shantung, he said<br />\nThe students, girls,<br />\nneighborhood.<br />\nNext Year.<br />\ngiven below is worthy of holding<br />\nthe driving out of the Gerthen<br />\nthat<br />\nto<br />\nMitchell<br />\nadjourned<br />\nDr.<br />\nand<br />\nThe individual biographies of the down a position in a Hopkins back- POLITICAL ECONOMY STUDENTS<br />\nhad meant only the rushing<br />\nmans<br />\nice<br />\nthe<br />\nand<br />\nwas<br />\nbroken<br />\nballroom<br />\nthe<br />\nAT<br />\n\"SHAKE A MEAN LEG\"<br />\nmembers of our championship foot- field and would do himself and his<br />\nother peoples, and in no way<br />\nof<br />\nin<br />\nHAMPDEN<br />\nThen<br />\nJones.\"<br />\ndance<br />\naf\"Paul<br />\na<br />\nby<br />\nball team will be continued with the university credit at any time on the<br />\nWith local talent furnishing the ter dance, encore after encore, was did China profit. The idea of Shanpresentation of four backfield men gridiron. Every one of these men<br />\nin order, Dr. Mitchell often being tung being returned seemed to<br />\nwho were awarded the •\"H\" for have distinguished themselves at music, and with local maidens as<br />\nquite vociferous in his applause. him absurd and ridiculous. But an<br />\ntheir valiant efforts this season. It different times during the past sea- partners, some thirty-five students<br />\nWhen Mrs. Hooker announced effort is now being made to buy<br />\nis a well-known fact that no mat- son, and three of them may be de- of Political Economy danced until<br />\n(about 11 P. M.) that festivities it back at almost any price.<br />\nter how good the line may be and pended upon to show up even more a late hour on Thursday last at<br />\nTing-Kau's<br />\nAdmiral<br />\nTsai<br />\nmust be brought to a close, everyhow well it may open up holes and brillantly next season.<br />\nCenRecreation<br />\nRoosevelt Park<br />\none expressed their reluctance at speech was filled with anecdotes<br />\nIn previous issues, brief accounts<br />\nscatter its opponents, all efforts will<br />\nleaving and all voted \"a pleasant and comparisons, and it was enter, in the wilds of Hampden.<br />\nbe in vain unless the team has alert, of nine regulars have been pubevening.\" According to all avail- joyed not only for what he had to<br />\ninthe<br />\nat<br />\nattended<br />\nThe<br />\nstudents<br />\nshifty backfield men who can grasp lished. We will now present the<br />\nof Dr. Broadus Mitchell, able reports everyone had \"hit the say, but especially because of his<br />\nthe golden opportunities and take past, present and future athletic vitation<br />\npleasing personality.<br />\non the part of Mrs. hay\" at a reasonable hour.<br />\nadvantage of every opening torn histories of Calkins, Markell, Wil- who spoke<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nA<br /><br />\n1.<br />\nlay,<br />\naole<br />\n: up<br />\nex-<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nCASH PRIZES ARE OFFERED FOR<br />\nESSAYS ON FAR EAST<br /><br />\n3<br /><br />\nPEP COMMITTEE APPOINTED AT<br />\nFRESHMAN CLASS MEETING<br /><br />\nThree prizes of $150, $100, and<br />\nA Freshman class meeting was<br />\n$50, respectively, have been offerheld<br />\nat noon last Wednesday for<br />\ned by the Institute of International<br />\nthe purpose of reminding the<br />\nAll letters intended for publication Education for essays on the genmust be concise, written in ink on<br />\nregular letter size paper, on one side eral subject of \"The Far East— Freshmen that they must obey regonly.<br />\nThe Key to the Armament Prob- ulations. Page O'Connor, class<br />\nNo attention will be paid to anonymous letters, but names signed as an lem.\" This contest, which will be<br />\npresident, pointed out how the<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be judged by a number of prominent<br />\nFreshman class had made a joke of<br />\nomitted.<br />\nEnglish Clothes Tailored in America<br />\nThe publication of a letter is not to university professors in this counFOR SPORT, DRESS, SOCIETY<br />\nitself<br />\nby<br />\nfor<br />\nturned<br />\nthe<br />\nway<br />\nout<br />\nit<br />\nbe taken as an indorsement of its views<br />\nHABERDASHERY<br />\nby the \"News-Letter,\" which invites the try, is open to every undergraduate<br />\nfreest discussion of matters of general<br />\nthe \"rush.\" \"When the class first<br />\nuniversity<br />\nstudent<br />\nin<br />\nor<br />\nany<br />\ncollege<br />\ninterest.<br />\nMt. Vernon 4999<br />\nin the United States. It will close came to Hopkins,\" he said, \"it was<br />\nJanuary 1, 1922. Essays may be regarded as the best Freshman class \"Queen Quality\" Home Made<br />\nChocolates<br />\nwritten on any of the following sub- which had ever come here. Now,<br />\nMr. H. DOUGLAS COTTON,<br />\nVISIT OUR ICE CREAM PARLORS<br />\nrelative to the main<br />\nwhich<br />\nare<br />\njects<br />\nEditor-in-Chief,<br />\nafter the way we acted at the<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\ntopic:<br />\nJohns Hopkins NEWS-LETTER,<br />\n\"rush,\" we are a joke. The upper<br />\n(1) \"The open door policy in<br />\nCircuit Photography<br />\nHomewood, Baltimore.<br />\nChina considered from an historic classmen are disgusted with us. A<br />\nFlash Lights<br />\nViews<br />\nDear Sir: Will you please pub- point of view and in relation to few of you fellows had to work<br />\nCharles and 22nd Sts.<br />\nGroups<br />\nEnlargements<br />\nDelicious Sodas and Sundaes<br />\nlish the following letter in your col- its conflict with the practice of in- on Saturday, but in the majority<br />\nKODAK FINISHING<br />\nThe Best of Candies<br />\numns, as an expression of the ap- terest in China.\" (2) \"How may<br />\n325 N. Howard St.<br />\nof cases there is no excuse.\"<br />\nPrompt 8z Efficient Service<br />\npreciation of the members of the Japan provide for its increasing<br />\nGeorge Darley, Freshman deleVarsity Club of the efforts made by population without violating the<br />\nvarious groups of men to make rights of other states?\" (3) \"The gate to the Student Council, said:<br />\nYoung Men's Clothing<br />\n1921 the best football year in Hop- relation of East and West with ref- \"At the last meeting of the Student<br />\n1 W. University Parkway<br />\nand Furnishings<br />\nkins' history.<br />\nerence to the colonies and settle- Council a good deal was said about<br />\nOpposite J. H. U. Athletic Field<br />\nTo the Editor of the NEWS-LETTER. ments of western nations in the the Freshmen breaking regulations. Are made a special feature of<br />\nNow that the 1921 football sea- Orient and its influence on the deDRUG STORE for J. H. U. BOYS<br />\nhere.<br />\nThese regulations are not Sophoson is over, it is fitting that a few velopment of oriental peoples.\"<br />\nPHONE, HOMEWOOD 2121<br />\nmore regulations. They are Fresh- Give us a call and<br />\nlet us become<br />\nwords should be said by the Var- Further information may be obman regulations for the Freshmen<br />\nsity Club in appreciation of the ef- obtained from the Secretary of the<br />\nbetter acquainted for mutual<br />\nand must be obeyed by the<br />\nforts of those who contributed to International Relations Club, InstiBuy an (II) Pipe made special<br />\nbenefit.<br />\nFreshmen. Only a few Freshmen<br />\nits success. Our thanks go, first of tute of International Education,<br />\nfor the Boys<br />\nall, to the team itself, and to the 407 West 117th St., New York break them, but the class as a whole<br />\nis judged by the action of these<br />\nORDERS RECEIVED FOR<br />\ncoaches. These men, by their con- City.<br />\nfew,<br />\nwho haven't enough spirit to<br />\nstant self-denial and indefatigable<br />\nCOGGINS'<br />\nlive up to the regulations. They<br />\nW1111 James S tem G.NM net<br />\nenergy, have achieved a truly re- no small measure responsible for<br />\nTransfer<br />\nand Baggage Express<br />\nmarkable result. We wish also to this. We also congratulate \"Mike\" didn't even think enough of their<br />\nAUTOMOBILE SERVICE<br />\nHoward<br />\nat<br />\nLexington<br />\nPHONE, HOMEWOOD 2645-W<br />\ncommend the student body for reg- Bowers and his bandsmen on the class to come out to the rush and<br />\nhelp lift these regulations. Some<br />\nular attendance and consistent success of one of the best and most<br />\nmethod must be found to see that Do you know how best to provide<br />\nElkridge Farms Dairy<br />\ncheering at practice and at games. pleasing undertakings ever conan income for your old age?<br />\nthe<br />\nregulations are enforced.\"<br />\nNo one hesitates in saying that no ceived in connection with HopSTRICTLY FRESH MILK<br />\nConsult with<br />\nTo carry out this idea, ten ablebetter cheering has ever been heard kins sports.<br />\nProduced, Pasteurized and Bottled<br />\nW. W. WALKER<br />\nin Howard County<br />\nH. H. LLOYD, Secretary, bodied men were appointed to comon Homewood Field. We venture<br />\npose<br />\na<br />\nFreshman<br />\n\"pep\"<br />\ncommittee.<br />\nCLARK<br />\nBROS.<br />\nEllicott City 231-R<br />\n909<br />\nCalvert<br />\nBldg.<br />\nSt.<br />\nPaul<br />\n2581<br />\nJohns Hopkins Varsity Club.<br />\na guess that Gilson Engle was in<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br /><br />\n14 N,CharlesS reet,<br /><br />\nORTMAN'S<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nR.G. by &amp; Company<br /><br />\nSTEWART&amp;CI.<br /><br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you —Of all the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br /><br />\nT<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\ns:1<br /><br />\nIf an Accident Occurs<br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br /><br />\n'<br /><br />\n.•<br /><br />\n.N<br />\n:.-----,-,..-T:<br />\n:<br />\n- ..<br />\n-----------. ,-J-----------,--,:----------,-,--.......<br />\n,,,,,„A,<br />\ni:aIiMrAr.h.Aro<br />\nl<br />\nValett,<br />\n•........ at<br /><br />\nS.I •ill<br />\n'',.. I<br />\n•• •'.....<br />\n.iV tillcaV<br />\nIi 1 II.<br />\n• • ••11:1 ..<br />\n• • si a I<br /><br />\n:IA -,:illaipp.al<br /><br />\nf,<br /><br />\nIlia<br /><br />\n(<br /><br />\nMURAD.<br /><br />\nIV r<br /><br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br /><br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br /><br />\nMURAD—<br /><br />\nS. ANARGYR0S.<br />\nand individuality is offered here at prices that are not<br /><br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\n..........2<br />\n6:7.41<br /><br />\n- ,<br />\nair:: :<br /><br />\n. AZI.<br /><br />\nTHINK OF<br /><br />\nFURNITURE OF QUALITY<br /><br />\nNone has the delicious<br />\nFLAVOR of the finestTurkish—<br />\nNone gives the ENJOYMENT of the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\n...:<br />\n-.,,,,<br />\n•<br />\nNone but the highest grade<br />\ntii if 1<br />\nand personally selected<br />\nTurkish tobaccos is used in<br /><br />\nTry IVIURAD today and<br /><br />\nCAPITAL STOCK OWNED BY P. LORILLARD CO.<br /><br />\n\"Judge for<br />\nYourself—!\"<br /><br />\n(IOC 11000PW II<br />\n.r..;re.<br /><br />\n151Dindr.ffirMrcirWVieraZt,Witar<br /><br />\n20c<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nOur -prep- room on the<br />\nthird floor specializes in<br /><br />\nclothes for young men.<br />\nndina<br /><br />\nilie<br /><br />\nHub<br /><br />\nBaltimore. Charles and Fayette<br /><br />\n40,1<br /><br />\nr<br />\n''°4<br />\n*<br />\n- 164<br />\nEisti.nuplZaintiettbrii<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 20, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br /><br />\nHOPKINS SONG BOOK WILL<br /><br />\nSOPHS WIN DEBATE<br /><br />\nAPPEAR AFTER CHRISTMAS<br />\nBefore a fairly large audience in<br />\n(THE BOOK MART)<br />\nVACATION<br />\nthe C. D. Hall last Friday night,<br />\nComplete Stock of<br />\nTo Include Many Forgotten Favorites. the Sophomore Debating Team<br />\nMedical Books and College<br />\nThe Hopkins Song Book, which downed their Freshmen rivals.<br />\nRequisites<br />\nDr. John C. French presided,<br />\nhas been so eagerly awaited, will<br />\nand<br />\nthe judges were Mr. Thach,<br />\nImporters and Dealers in Fine Books make its appearance immediately<br />\nCapt. Atwater and Dr. Cowles.<br />\n301 N. CHARLES ST.<br />\nafter the Christmas holidays. DeThe subject of the debate was,<br />\nBaltimore, Md.<br />\nsirable as such a song book has \"Resolved: That a Policy of Naalways been, it has remained for tional Insurance Against Unemthe Omicron Delta Kappa to ployment Should Be Adopted.\"<br />\nmake it a reality. Douglas Coulter and the winning team was comand H. D. Cotton are editor and posed of Eisenberg, Bamberger<br />\nbusiness manager, respectively, of and Terlitzky. The Freshmen repeV<br />\n\"<br />\nresentatives were Moehle, Schlutthe book.<br />\nThe volume will contain all of ter and A. Levene.<br />\nv<br />\ne<br />\n41<br />\ntLabeXatteri<br />\nA delightful dance followed, at<br />\nthe college songs popular at Hop-\"M tS H.&amp; OSCAR G.1-0•44:1<br />\nwhich<br />\nthe University Jazz Band<br />\nkins now, and many of the old<br />\nOWN ERS<br />\nrendered<br />\nthe music.<br />\nsongs which are not so well known<br />\netel4<br />\n1.14413Zt<br />\nat present.<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nCoulter has let none of these old DR. HULBURT INJURED IN<br />\nSOLE AGENTS FOR BALTIMORE favorites slip by. Songs included<br />\nACCIDENT<br />\nFor College Fraternity Bands •<br />\n\"Uni\"University<br />\nOde,\"<br />\nare<br />\nthe<br />\n(Greek Letter Societies)<br />\nDr. Lorraine S. Hulburt, profesversity Alma Mater,\" \"Grave sor of Mathematics at the UniThe Chas. Willms Surgical<br />\nYard,\" \"To Win,\" Everybody versity, is at the Maryland GenInstrument Co.<br />\nBets<br />\non Hopkins,\" \"We Have eral Hospital with a fractured<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSand<br />\nin<br />\nOur Makeup,\" \"On the skull resulting from an automobile<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nLine,\" \"Alma -Mater in Dixie- accident last Saturday night. In an<br />\nStethoscopes<br />\nBlood Lancets land,\" \"The Black and Blue,\"\"To attempt to cross the street at<br />\nBlood Counters<br />\nSt. John's,\" \"Ain!t They Neat, corner of Charles and 29th streets,<br />\nHa!<br />\nHa!\"\"Johnny Hopkins on to Dr. Hulburt was knocked down by<br />\nJ. H. Furst &amp; Co.<br />\nVictory,\"<br />\n\"The Freshie,\" \"Hulla- a speeding machine. Reports from<br />\nPrinters of Philological and<br />\nbaloo<br />\nBoys,\"<br />\n\"The Toast We the hospital late last night showed<br />\nScientific Works<br />\nDrink,\"<br />\nand<br />\n\"The<br />\nMarch of Vic- his condition to be improved.<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\ntory.\"<br />\nIt is interesting to note that we<br />\nWEDNESDAY BIBLE CLASS<br />\nare in possession of an Alma Ma109 M. E. AT 12.30<br />\nter song after all the commotion<br />\nChaplain F. C. Reynolds, of the<br />\nthat was raised over the supposed 115th Infantry, will be leader at<br />\nlack of one. When the Song Book the Bible Class<br />\ntomorrow. The<br />\nappears the Alma Mater song will discussion will center<br />\nabout the<br />\nprobably be the center of inter- first part of the<br />\nOld Testament<br />\nest, while a great deal of cu- and its application to<br />\npresent-day<br />\nriosity has been aroused .concern- affairs.<br />\ning that called \"The Freshie.\"<br />\nThis promises to be a very in17 E. Baltimore St.<br />\nThere is also a great deal of teresting meeting and<br />\nevery one is<br />\nlively speculation concerning the urged to<br />\nattend.<br />\nidentity of the well known friend<br />\nPrinters of the<br />\nof the University to whom it is<br />\nJohns Hopkins News-Letter<br />\nannounced the book will be dedicated.<br />\n\"ex/zetioVitecle\"<br />\nThe general makeup of the book<br />\n-v\"<br />\nwill be most attractive. A handRt<br />\n4r<br />\n/S<br />\nsome leatherette cover of a very<br />\nl<br />\ni i0R<br />\nbeautiful shade of dark blue<br />\nstamped<br />\nin gold with a cut of Gilk\\/1<br />\nman Hall showing the driveway<br />\nand trees around the building will<br />\nii<br />\ngive the book a pleasing appearance.<br />\nThe book will cost only a dol134419<br />\nlar and a quarter and from an inspection of its appearance and<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS contents it should be well worth<br />\nit.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nZW<br /><br />\nThe Home of<br /><br />\nThe Overcoat<br />\nYouthful novelty o'coats, with<br />\nstylish raglan shoulders, roomy<br />\narmholes, of soft, warm materials<br />\nUnmatchable values!<br />\n$35 and up<br /><br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br /><br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br /><br />\nMEN'S SHOES<br /><br />\nST. PAUL and TWENTIETH STS.<br /><br />\nOf the Better Class<br /><br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 11 o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br /><br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nJ 'NIKIINS<br />\nSILVERWARE<br /><br />\nJ<br />\nDIAMONDS<br /><br />\nJEWELRY<br /><br />\nLA TAUSCA PEARLS<br />\nSOLD ON VERY CLOSE MARGIN OWING TO OUR LOW EXPENSES<br /><br />\n12 CLAY STREET<br />\n(3 Doors from Charles Street)<br />\nSee Our Latest Designs in Bureau Silver<br /><br />\n9'<br /><br />\nIn Architecture<br /><br />\nHess Shoes<br />\nTeach a Lesson in Style<br /><br />\nCHRISTMAS COTILLON TO BE<br />\nELABORATE AFFAIR<br /><br />\nAt a meeting of the Cotillon<br />\nBoard, held on Thursday, December 21st, final preparations were<br />\nmade .for the Christmas Cotillon to<br />\nbe held in the C. E. Hall tomorrow<br />\nN. HESS' SONS<br />\nnight. Due to the large number<br />\n8 E. BALTIMORE ST.<br />\nwishing to attend the cotillon, it<br />\nwas found necessary by the board<br />\nto issue a few more tickets to each<br />\nmember, and to compensate for this<br />\nincrease a supplementary order for<br />\nMADE TO ORDER<br />\nthirty additional programs was sent<br />\nAND<br />\nto the printer. It is especially announced<br />\nby the board, however,<br />\nFINISHED CLOTHES<br />\nthat due to this increase in the tickPLAZA BUILDING<br />\net sale absolutely no one will be ad19 and 21 EAST FAYETTE ST.<br />\nmitted without a ticket. It is regretted that everyone who wishes<br />\nto attend cannot be accommodated.<br />\nSHOES<br />\nbut the size of the hall makes it abfor<br />\nsolutely necessary to limit the numUNIVERSITY MEN<br />\nber.<br />\nThe hall is to be decorated with<br />\nFor Sport Wear<br />\nFor Dress<br />\nChristmas<br />\ngreens, and with FishSmart Styles—Best Leathers<br />\nOrchestra<br />\nsupplying the muer's<br />\nModerate Prices<br />\nsic, and the new plan inaugurated<br />\nby the board this year the cotillon<br />\nis expected to be the most successful ever held at Hopkins.<br />\n19 W. LEXINGTON ST.<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br /><br />\nLEMMERT<br /><br />\nWYMAN<br /><br />\nEN you go after your first big commission, you'll<br />\n/<br />\n1<br />\n4<br />\nV 71<br />\nreed<br />\nsomething more than a knowledge of stresses<br />\nand strains,periods and piping. You'll need the atmosphere<br />\nof success, and the air of knowing your way 'round. One<br /><br />\nevidence of this familiarity with the world's good things is<br />\nthe habit of preferring that citizen of the world—<br /><br />\nelachrino<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nRemember that Melachrino is the master blend<br />\nof only the finest Turkish Tobaccos as originated by Miltiades Melachrino. Egyptian cigarettes are simply those that originated in Egypt.<br />\nBut the tobacco is what you want to know<br />\nabout—and if it's Melachrino —it's right.<br /><br />"}], "field_media_file": [{"target_id": 37571, "display": null, "description": null, "target_type": "file", "target_uuid": "893029b0-fac0-4583-b401-159c9f7e454c", "url": "http://digital.library.jhu.edu/system/files/2022-03/12975-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12975, "target_type": "node", "target_uuid": "27b6e977-bd7f-40c6-929b-27150b942f8f", "url": "/node/12975"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cc503534-6098-4d94-9eb8-3dc0dd96e6b9"}]}