{"mid": [{"value": 35828}], "uuid": [{"value": "10ffcd55-066f-4615-acef-439badb6030e"}], "vid": [{"value": 35828}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:14:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12354-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:14:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:14:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "voe,<br />\nHmoilarim<br />\n<br />\nTHE-JOMIS-HOFKIRS-UNIVERSITY<br />\nBALTIMORE<br />\n<br />\n\fThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nThirty-Second Year. Beginning October 1, 1907.<br />\nIRA REMSRN, President.<br />\nDean of the College Faculty.<br />\nWILLIAM H. HOWELL,<br />\nDean of the Medical Faculty.<br />\n<br />\nEDWARD H. GRIPPIN,<br />\n<br />\nINSTRUCTION.<br />\n<br />\nH.<br />\n<br />\nIII.<br />\n<br />\nIV.<br />\n<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\n(a)<br />\ncandidates for the degree of Ph. D.)<br />\n(b)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c)<br />\nAs candidates for the degree of B. A.<br />\n(d)<br />\nAs special students.<br />\n<br />\n.<br />\n<br />\nV<br />\n<br />\nVI.<br />\nVII.<br />\nVIII.<br />\n<br />\nLibraries.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\nvolumes<br />\nibi,000 volumes<br />\n244,000 volumes<br />\n<br />\n135,000<br />\n<br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br />\n<br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nGeorge M. Stratton.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance,<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nC. M. Andrews.<br />\nJ. Ii. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\nGROUPS.<br />\nz.<br />\nAncient Languages.<br />\n2.<br />\nModern Languages.<br />\n3.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\n4.<br />\nChemistry, Biology and Geology.<br />\n5Serial Publications.<br />\nAmerican Journal of Mathematics (vol. XXX).<br />\nAmerican Chemical Journal (vol. XXXIX).<br />\nAmerical Journal of Philology (vol. XXIX).<br />\nStudies in Historical and Political Science (vol. XXVI).<br />\nModern Language Notes (vol. XXIII).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XII).<br />\nUniversity Circular (vol. XXVII).<br />\nProgrammes of the courses offered to graduate students<br />\nis Philosophy and the Arta and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br />\n<br />\nIX.<br />\nX.<br />\n<br />\nXI.<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nXIV.<br />\n<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXX in progress. $5 per volume. (Forcing<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. RE,MSEN, Editor. Monthly. 8vo. Volume<br />\nXXXIX in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE,'Editor. Quarterly. 8vo.<br />\nVolume XXIX in progress. $3 per volume.<br />\n(Foreign postage 5o cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVI in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVII in progress. $: per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4t0.<br />\nVolume XXIX in progress. $2 per year. (Foreign<br />\npostage 50 cents).<br />\nJohns Hopkins Hospital Reports. 4t0. Volume<br />\nXV in progress. $5 per volume. (Foreign postage 5o cents).<br />\nContributions to Assyriology and Semitic Philology (13eitr4e zur Assyriologie, etc.) PAUL<br />\nHAUPT and FRIEDRICH DELITZSCH, Editors Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXIII in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, $5. Third Series in progress, 2.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland. $7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland'a Photographs of the Normal Solar Spectrum. zo<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. 51.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoeina de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.5o.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $1.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br />\n<br />\n\fUNIVERSITY DEBATING TEAM-1908<br />\n<br />\n\fTHE NEWS-LETTER<br />\nVOL. XII.<br />\nSubscriptions, $1.50 per year.<br />\n<br />\nMARCH 27, 1908.<br />\nPublished Fortnightly.<br />\nBOARD<br />\n<br />\nOF<br />\n<br />\nNO. 11<br />\nio Cents per copy<br />\n<br />\nEDITORS.<br />\n<br />\nSamuel Claggett Chew, Jr., 1909, Editor-in-Chief.<br />\nWalter V. Johnson, i9o9, Athletic Editor.<br />\nFranklin 13. Pedrick, 1909, Ass't Editor-in-Chief.<br />\nJ. Purdon Wright, t908, Business Manager.<br />\nGeorge W. Corner, 3d, 1909, News Editor.<br />\nBoyd Wylie, 1910, Ass't Business Manager.<br />\nJ. H. Owens, 1909,<br />\nA. C. Woods, 1910, Ass't News Editors.<br />\nG. R. Veazey, 1910,<br />\n•<br />\nAddress all articles, communications, etc., to Samuel C. Chew, Jr., Box 134, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to J. Pardon Wright, Box 689, Johns<br />\nHopkins University, Baltimore, Md.<br />\n<br />\nEDITORIAL.<br />\nwIc<br />\n<br />\nV V<br />\n<br />\nI E very gladly give space to the frank letter on the Fraternity question<br />\nsent to us by Mr. John M. Booker, an Alumus and graduate student<br />\nhere, and an afore-time Editor-in-chief of this paper.<br />\nV<br />\nV<br />\nThe questions discussed in his letter are just-those which are at<br />\nV<br />\nV<br />\npresent<br />\nunder the consideration of the Inter-Fraternity Conference,<br />\nV.<br />\nwhich is now holding regular meetings. This conference began as<br />\nV.<br />\nthe unofficial gathering together of some six or seven men. More<br />\nIIVVVVVVVVVI:<br />\nrecently two men have been chosen by each fraternity to represent<br />\n- a their chapters officially and to lay before the several fraternities in<br />\nchapter meeting the several articles in the agreement under consideration.<br />\nAs Mr. Booker strikes right at the root of the matter, as the plans of the conference are<br />\nin no way secret, and as such plans will be of interest to all students who are not as yet<br />\nacquainted with them, it may be well to state briefly the agreements at which the originators of the present conference aimed—agreements to which it is but fair to say that three fraternities at least are not yet ready to consent.<br />\n\"ICIO *An. OW- UV<br />\n<br />\n(1)<br />\n(2)<br />\n(3)<br />\n(4)<br />\n<br />\nThat no man shall be invited to join a fraternity prior to a fixed, though as yet, uncertain date.<br />\nThat no fraternity shall entertain on the night of the Y. M. C. A. reception.<br />\nThat no upper-classman shall for fraternity reasons protect a freshman from hazing.<br />\nThat a general inter-fraternity meeting shall be arranged at least once a year.<br />\n<br />\nThere is no reason why propositions 2, 3, and 4 should not receive immediate and general acceptance. The rub lies in the first article of the agreement. In an ideal condition of<br />\naffairs such an arrangement, would of course, be in vogue now. But conditions are not Utopian here, and if we wish to approach anywhere near the suburbs of the city of our ideals we<br />\nmust be careful. \"Run slow through switches, curves and over crossings\"—and the proposition to enact a date prior to which no man can be pledged is a most decided switch from the<br />\npresent fraternity track.<br />\nIn one point in particular we believe everyone will agree that Mr. Booker is wrong.<br />\nHe says, \"Set a date, say toward the end of the Freshman year, upon which all the fraternities<br />\nindividually offer election to the men they have selected.\" At a large college, with Freshman<br />\nClubs, and distinctly drawn class lines, such a suggestion is feasible and practicable. Here it<br />\nis almost certainly not.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\n,futtur<br />\nluitanip<br />\nA AI<br />\n<br />\nACROSSE and Track are of course the two great athletic interests of<br />\nthe spring here at Hopkins. But there must be a good many men<br />\n. NujItiggfigirtollgg<br />\n. who for one reason or another, or for no reason in particular, do not<br />\nplay lacrosse or enter in track and field events, and yet would be<br />\n4<br />\nmore than glad to enter into a tennis tournament were such an one<br />\nf S*.<br />\narranged. Of course, a good many lacrosse men and, we suppose,<br />\nall the track men would find time to enter. This year the courts at<br />\ngigirgE2.1111*<br />\nHomewood will not be laid out, but it is to be hoped that it will not<br />\nn<br />\n61:1&no,•<br />\nbe long before Hopkins will have several courts there. In the meantime, if a tennis tournament can be arranged—and we trust that it<br />\ncan—matches could be played at the Baltimore Country Club, by those who are members<br />\nthere; at Catonsville; or, if necessary, at Druid Hill Park.<br />\n•<br />\n<br />\nINT3•<br />\n<br />\nTF,MPORA! 0 Mores! We hear with sorrow that the trustees have<br />\nsent forth the word denying to us the congregation in the barber•<br />\nshop.<br />\nNo longer are the wits of the day to gather in solemn conclave<br />\nAt<br />\n*<br />\n*<br />\n*<br />\ndebate<br />\non Walter's Hair Tonic, or to recall sweet memories of the<br />\nto<br />\nv<br />\nAv. *<br />\n11,<br />\nv •<br />\ndaily<br />\ntoil.<br />\nWhy does the worthy successor of Will's Coffee House<br />\n*.<br />\n*<br />\nof<br />\nthe<br />\ntime<br />\nof Addison and Steele feel the restraining touch of the<br />\nIF<br />\n*<br />\niw<br />\n*<br />\nhand?<br />\nIn the time of Haroun al Raschid the barber was<br />\ntrustee's<br />\n*<br />\n7*<br />\n• noryvvri V:<br />\noften the center of attraction and still today do we feel the mystic influence of the barber's throne, the charm of the arm-chairs ranged<br />\nf\\TA<br />\nalong the wall—the tiltable sort that makes one feel true relief at<br />\nhis escape from the hard-board bench. Here were discussed the leading Scottish poets of the<br />\nRenaissance, the elements of Philosophy, the latest play of the day, and even character study<br />\namong the faculty. Trustees! Would you deprive us of the pleasure to which we look forward<br />\nduring the last ten minutes of every hour, would you take from us the sparkling wit, the<br />\nguileful pun, the satirical tongue, the mimic's jest and the freshman's wond'ring gaze? Come<br />\nand listen to the keen wits of the matriculates, developed as is possible under no circumstances<br />\nas well as under Walter's eye, and hasten to tear down with your own puissant hands the bull<br />\nwhich takes from the duller brain, the chance to glean a sharper wit, and more brilliant mind.<br />\nV V<br />\ns_. 1010.1010 V V. V lif 1.V V<br />\n<br />\nHE announcement that the Trustees have appropriated money for the<br />\nerection of a grand stand at Homewood is being received by everyone with pleasure. All signs which point homeward are welcome!<br />\nBut the stand will not be ready until the fall, and in the meanwhile<br />\nwe have before us what promises to be the greatest lacrosse season<br />\never experienced in Baltimore. There are not enough benches at<br />\nthe field. They are temporary, to be sure, but were several more<br />\nplaced there this spring, certainly some use could be found for all the<br />\nbenches somewhere after the permament stand has been built.<br />\n<br />\nAN OPEN LETTER ON THE FRATERNITY QUESTION.<br />\n. of the NEWS-LETTER:<br />\nTo the Editor<br />\nDEAR SIR:—I am glad to see the movement for an understanding between the fraternities in regard to 'pledging.\" It should rid them of the greatest hindrance to their healthy<br />\ngrowth here—the too early pledging.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LrIVER.<br />\n<br />\nThat this evil is as universal as it is detrimental, is evidenced by a letter recently published in The Nezt;s,in which a prep-school teacher complains of the harm done his pupils' work<br />\nby the incessant fraternity campaigning.<br />\nThis is only one side of the medallion. Constant campaigning keeps the brother so<br />\nbusy developing his chapter, that there is no time left for him to be developed by his fraternity. He literally exists for the fraternity. This is the reverse of what was meant to be.<br />\nThe fraternity should exist for him. It is not like relations or like large families. It<br />\nis not sent from heaven. It was created by the \"student\" to fill a student's needs. The<br />\nmoment it ceases to do this, that moment it has ceased to be a functional part of the student's<br />\nlife,—and it has lost its right to exist.<br />\nBut, so far, the situation is in the hands of the fraternity men. Any future condition<br />\nthat does away with fraternities here will arise from their present inability to regulate their<br />\nrelations.<br />\nFor that regulation is possible, I have not the least doubt. Of course, the men .delegated to shape it must have an average amount of self-colltrol and imagination, and every<br />\none of them must be capable of the conviction that any attempt to make an arrangement<br />\nspecially favorable to his crowd—which, from its very nature, could be only a temporary one<br />\n—would jeopardize a permanent improvement in the condition of all alike. Given men up to<br />\nthese requirements, any plan, as first adopted, would probably be all wrong. Like railroad<br />\nlegislation, it must have time to grow. It may never he quite perfected—no laws anywhere<br />\nare ever up-to-date—but give it a chance, and it will not only improve the conditions of chapter life, it will also insure the continuance of fraternities in good odor and forestall a feeling<br />\nagainst them on the part of parents and teachers which has already begun to manifest itself.<br />\nIn approaching such an attempt, three things at once occur to me as of paramount<br />\nimportance; first, provide sufficient time for the school boy to realize conditions here; Second,<br />\nprevent the tender of an election until a day set by all; third, prevent the acceptance of an<br />\nelection until some day following.<br />\nFirst, of course, a committee of delegates from each fraternity, ultimately to become a<br />\npermanent court. Let it set a date, say toward the end of the Freshman year—upon which<br />\nall the fraternities individually offer election to the men they have selected; let it set a date<br />\nclosely following this upon which every freshman who has received a notice of election meets<br />\nthe delegates in a body and declares openly his acceptance of election into this or that fraternity,—at the same time, taking oath that he has neither been offered an election, nor has he<br />\naccepted one until the dates agreed upon by all. Whereupon, the delegate representing the<br />\nfraternity whose invitation he has accepted, then steps forward on the part of the fraternity<br />\nand takes an oath to the same effect. And let no candidate be initiated until he has announced his acceptance of election through the delegates assembled in a body.<br />\nSuch an oath would prevent any fraternity from secretly violating the treaty. Of<br />\ncourse, open violation would mean a rupture of relations. Whether or not, a fraternity would<br />\nwant to go back upon its agreement, is a matter of reasonable doubt. Whether or not it<br />\ncould afford to do so, is a matter of reasonable certainty. This agreement, or a similar one<br />\nwould carry with it benefits which would be both immediate and far-reaching. It would first<br />\nof all do away with the indignified scramble known as \"robbing the cradle\" and the consequent indignation of parents and teachers such as we have recently had evidence of.<br />\nIt would prevent the bad feeling resulting from \"tampering with pledged men,\"—<br />\nwhich never finds expression, and is more intense than if it did.<br />\nIt would put the fraternities in a dignified position toward the incoming men, and<br />\nenable them to exercise a disciplinary effect corresponding to that at Princeton, and at other<br />\nplaces where the honor is held before the freshman, at the formative time of his college life.<br />\nIt would give everybody time to realize what he was about, which would in turn pre\"mistakes.\"<br />\nAs a result, the student-body would settle into place easily and naturally<br />\nvent<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\n=7\"<br />\n<br />\nand, most to be desired, unself-consciously. Everybody would be where he belonged, and,<br />\nbetter still, nobody would be where he did not belong.<br />\nBut above all, it would mitigate the evil of the time-devouring campaign, which has<br />\nalways stunted the growth of real fraternity life here,—protests to the contrary, notwithstanding. This is an unnatural state of affairs, the outgrowth of the abnormal position of a college<br />\nin a big city. And it can be bettered only by a treaty fair to all, and squarely lived up to.<br />\nJOHN M. BOOKER, 1901.<br />\n<br />\nTHE 'CONFERENCE.\"<br />\nBoth our Editorial and Mr. Booker's letter in this issue of the NEWS-LETTER have lost<br />\nmost of their point since the final decision of the Inter-Fraternity Conference that no definite<br />\nagreement in the matter of pledges should be entered upon. Notwithstanding the fact that<br />\nseveral fraternities felt that it would be wise to have an inter-fraternity agreement minus the<br />\npledging clause, nothing was done regarding the remaining articles of the agreement and the<br />\nconference adjourned, apparently sine die.<br />\n<br />\nJOINT CONCERT.<br />\nThe Joint Concert by the Woman's College<br />\nand Hopkins proved to be a great success.<br />\nEveryone who attended was very much<br />\npleased with the entire performance. Many<br />\npronounced it the best concert that they had<br />\nheard for several years. Every number on<br />\nthe program was enjoyable and well rendered.<br />\nThe features which were most popular with<br />\nthe audience were the solos, all of which were<br />\nexceptionally go od ; the medley by the<br />\nWoman's College Glee Club; and the \"Song<br />\nof the Vikings,\" which was sung by the two<br />\nGlee Clubs—a chorus of about fifty voices.<br />\nThis was, indeed, a splendid number. It was<br />\na beautiful sight to see the girls in their caps<br />\nand gowns, each wearing a bouquet of flowers,<br />\nand the men in evening dress with a spray of<br />\nlillies of the valley in their lapels.<br />\nThe decorations of the hall added to the<br />\nfestivity of the occasion. The stage was<br />\nbanked with palms, above which were hung<br />\nin the center the Woman's College flag and<br />\nthe Hopkins flag. Around the sides of the<br />\nhall were tastefully draped the class banners<br />\nof the two colleges. Very pretty programs<br />\nwere made for the concert. They contained<br />\nthe picture of each club, a list of the<br />\nmembers of the clubs, and also the<br />\npatronesses.<br />\nEverything went off without a hitch and<br />\nconsequently the concert did not drag in a<br />\n<br />\nsingle place. Although they began at halfpast eight, and although there were no waits<br />\nbetween numbers, the concert was not over<br />\nuntil eleven o'clock. A proof that the concert was not boring was that everyone sat<br />\nthrough to the end.<br />\nAside from the concert being such a success<br />\nin a musical and social way, it was just as<br />\nmuch so from the financial side. While the<br />\nmanager is unwilling to state the exact<br />\namount of profit that each club made, he says<br />\nhe is perfectly satisfied with the results, and<br />\nthat now the clubs will be able to take an<br />\nEaster trip for three days down the Eastern<br />\nShore. Heretofore the clubs have been<br />\ngreatly hampered by lack of funds and for<br />\nthis reason they have not been able to take<br />\nany extended trips, as it is impossible to do<br />\nso without having any capital. After taking<br />\nthe Easter trip, the management hopes to have<br />\nmore than enough to pay off the debt incurred<br />\nthree years ago. During that year the clubs<br />\nwere very fine and they took several long trips,<br />\nand the season was considered to be very successful and prosperotth, but it is not generally<br />\nknow that the manager left the clubs with a<br />\ndebt of over two hundred dollars. This debt<br />\nhas, however, been reduced by Manager T.<br />\nPoole Maynard to about one-half. The management hopes to be able to wipe out this<br />\ndebt, and to let the clubs start next year unencumbered by any debts.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\n11<br />\n<br />\n1=11<br />\n<br />\nOUR YELLS.<br />\nThe matter of yells and yelling and yellleader is one of considerable importance right<br />\nnow. The yelling at the games this spring<br />\nmust be better than at the foot-ball games last<br />\nautumn. We must have regular practice and<br />\nwe must pitch in pell-mell and yell like—<br />\nwell, who can tell? Every student here does<br />\nnot know the yells, but every one ought to.<br />\nWe give you an opportunity here. Perhaps<br />\nYOU have no Y. M.C. A. hand-book, wherein<br />\nthe yells are printed. At any rate, you have<br />\na copy of this NEWS-LUTTER in your hand<br />\nnow. Sit down and learn them now. The<br />\nfirst one is not in the \"Freshman's Bible,\"<br />\nand it's the one you'll need after your last<br />\nrecitations this year, when you give a \"Geebee !\" for Ma Greene and Doc. Vos and the<br />\ngenial Murray P.<br />\nGee-bee!<br />\nGee-ha!!<br />\nGee-ha, ha, ha, ha!<br />\n!<br />\n!*<br />\nHe's a daisy!<br />\nHe's a la-la!<br />\nHe gets there every time !<br />\nLet's all evoke a facial ripple!<br />\nH-A ! H-A !! HA !!!<br />\nHullabaloo! Canuck ! Canuck !<br />\nHullabaloo! Canuck ! Canuck !<br />\n*—These blanks have no reference to Walter or<br />\ndamnation.<br />\n<br />\nIJJTAIJNIKI<br />\nHurrah! Hurrah!<br />\nJ. H. U.!<br />\nRah, Johnny! Rah, Hop.!<br />\nRah, Johnny Hopkins!<br />\nHurrah! Hurrah!<br />\nBlack! Blue!<br />\nHopkins!<br />\nHoo! Wah ! Hoo !<br />\nHoo! Wah ! Hoo !<br />\nHoo! Wah ! Hoo! Wah<br />\nJ. H. U.!<br />\nRa—a—a !<br />\nRa—a—a!<br />\nRa—a—a !<br />\nRah! Rah! Rah! Rah!<br />\nRah! Rah! Rah! Rah! Rah!<br />\nJohns Hopkins!<br />\nWe should learn, also, \"Seniors, wise and<br />\nlearned,\" and \"A Rousing Hullabaloo,\" both<br />\ncontained in the hand-book. And we should<br />\nnot forget a song known now to too few of us,<br />\nwhich runs—<br />\n''To win ! To win !<br />\nWe'd like, like—to win!<br />\nBut you'll have to wait 'till the moon turns<br />\ngreen,<br />\nAnd the brass band plays 'God Shave the<br />\nDean.'<br />\nHa.ha! Ho-ho!<br />\nIt's plain as A. B. C.<br />\nIf anybody's going to win to-day<br />\nIt's we, we, WE!\"<br />\n<br />\n\fTHE NEWS-LETTER.-<br />\n<br />\n7<br />\n<br />\nThere is just one more point to remind<br />\nevery one of. We must have a first-rate, big,<br />\nenthusiastic yell-leader this spring; one like<br />\nGriswold of old (minus Bob's flip-flop hands!)<br />\n<br />\nsuch an important athletic meet. The University of Pennsylvania hopes that you will be<br />\nrepresented by a team. If an invitation is desired, a note to Geo. W. Orton, Franklin<br />\nField, Philadelphia, will get a speedy reply.<br />\n<br />\nUNIVERSITY OF PENNSYLVANIA RELAY RACE CARNIVAL, LAST<br />\nSATURDAY IN APRIL.<br />\n<br />\nGRAND STAND AT HOMEWOOD.<br />\n<br />\nAt a recent meeting of the Board of Trustees of this University, $12,000 was approThe Fourteenth Annual Relay Races given priated for the erection of a grand stand on<br />\nby fhe University of Pennsylvania will be held the athletic field at Homewood.<br />\nas usual on the last Saturday in April. InviThe stand will be an imposing affair, over a<br />\ntations have been sent to all the leading edu- hundred feet long, and of an aesthetic quality<br />\ncational institutions in , the country, and entirely in keeping with the dignity of the<br />\nalready entries are pouring in, guaranteeing University. It will be built entirely of conthe success of this year's meet. The Relay crete, and the seats will be arranged somewhat<br />\nRaces are probably the best known set of after the fashion of the old Greek theatre.<br />\nsports, held annually, in the world. They are The stand at Tome Institute, Port Deposit, is<br />\nlikewise the largest. Last year over 200 scho- very similar to the proposed one at Homewood.<br />\nlastic and college teams faced the starter.<br />\nThe space originally set apart for the build1500 competitors' tickets were necessary to ing was deemed unsuited, because it faced the<br />\nsupply the large number of athletes that com- west. The plans as now completed place the<br />\npeted in the different events. Yale, Cornell, building on the Charles street side of the club<br />\nPrinceton, Chicago, Michigan, Dartmouth, house, so that the sun will be, in the evening,<br />\nSyracuse, in fact, all the leading colleges almost directly behind the spectators. The<br />\nwere present, while the schools were just as ground left vacant on the other side will be<br />\nwell represented. The institutions having utilized for three or four tennis courts, on<br />\nteams in these races come from districts as far which work has already been commenced.<br />\ndistant as west of Chicago, south of Richmond,<br />\nWork on the new stand will begin at once.<br />\nand north of Boston. Every intercollegiate Indeed, the location is already staked out, and<br />\nchampion, both Western and Eastern, then in the contractors will endeavor to have the<br />\ncollege, with but one exception, competed in stand ready for use for next football season.<br />\nthe special events. It is thus no wonder that<br />\nthese games attract to themselves such wonTHE CROSS. COUNTY RUN.<br />\nderful entries. Each year the best college<br />\nThe first cross county run, held last Saturand scholastic athletes of the country are at<br />\nweek, was not as successful from a Uniday<br />\neducathe Relay Races, and it is an athletic<br />\nstandpoint as it might have been, for,<br />\nversity<br />\nrelay<br />\nA<br />\ntion in itself to attend this meet.<br />\nteam banner came to us, the indithe<br />\nwhile<br />\nso<br />\nteam is composed of but four members,<br />\nwas not as good as had been exwork<br />\nvidual<br />\nor<br />\nthat it is within the power of any school<br />\npected.<br />\na.<br />\ncollege to send their athletes to Philadelphi<br />\nIt was a pity that. Breyer should have misThis is done in many schools by popular subthe pace at the start and have climbed<br />\njudged<br />\nAthletic<br />\nscription where the finances of the<br />\nhill on Charles Street avenue at the<br />\nlong<br />\nthe<br />\nAssociation are not sufficient for the purpose.<br />\nand that Brenton should have foldid,<br />\nhe<br />\nrate<br />\nto<br />\nThis year's meet needs only fair weather<br />\nlead. The result showed<br />\nhis<br />\npartner's<br />\nlowed<br />\nthe<br />\nmake it the most successful to date. All<br />\nmuch. Griffith, howtoo<br />\nwas<br />\nstrain<br />\nthe<br />\nthat<br />\nbig colleges have sent assurances that they<br />\nfinished strong in<br />\nand<br />\nit<br />\nto<br />\nequal<br />\nwas<br />\never,<br />\nwill be represented. Because of the Olympic<br />\nplace.<br />\nsecond<br />\nbe<br />\nSports in London, all the star athletes will<br />\nFrom a spectator's point of view, the race<br />\nin fine shape, and they will all.be on hand at<br />\na magnificent one. The men started off<br />\nwas<br />\nbe<br />\nFranklin Field on April 25th. It will<br />\none-mile clip, and' kept it up until the<br />\na<br />\nat<br />\nworth a long journey to see and be present at<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nfoot of the Notre Dame hill. By that time<br />\ntheir first wind was gone, and it was evident<br />\nthat all but those in pink of condition suffered<br />\ngreatly. Several men dropped out along here.<br />\nThe course across field to Falls road was a<br />\ndifficult one, for several of the hills were so<br />\nsteep that running up them was a practical<br />\nimpossibility. Then, too, the course was not<br />\nproperly-placarded, and several men lost their<br />\nway.<br />\nHowever, the majority kept well<br />\nbunched, and even in the run over the<br />\nCounty Club's links and up the Falls road, it<br />\nwas the long grind up Cold Spring lane that<br />\ntried the mettle. Some of the men walked all<br />\nthe distance, some alternated creeping and<br />\nsprinting; and here more dropped out.<br />\nThe crowd gathered around the tape at the<br />\nfinish was surprised when the figure down at the<br />\nfoot of the hill resolved itself into Elphinstone,<br />\nof the Cross County Club. Soon followed<br />\n\"Mitch\" Griffith and then another Cross<br />\nCounty Club man. So two of the three places<br />\nwent to outsiders. However, two freshmen,<br />\nWolf and Reeside, finished fourth and fifth,<br />\nand they, with Russell, who finished a little<br />\nlater, formed the team that won the race.<br />\nBreyer had given out a long way back, and<br />\nBrenton was some distance from first also.<br />\nHowever, with a single exception, every Hopkins man entered finished the complete six<br />\nmiles.<br />\n<br />\nINTER-CLASS LACROSSE.<br />\n<br />\nably be composed of the following: Gutman,<br />\nWhitcraft, Lowndes, Baily, Hopkins, Owens,<br />\nSmith, Stewart, Vogeler and Bassett.<br />\nWe would like to recommend very heartily<br />\nthe project of having spring football practice<br />\nthis year. Princeton and other colleges of<br />\nathletic reputation have found it worth while<br />\nto have this practice in the last part of the<br />\nyear, and it seems that Hopkins will have peculiarly favorable conditions for taking this<br />\nmatter up during this spring. There will be<br />\nno recognized baseball team, and the field will<br />\nbe open for football, except during lacrosse<br />\npractice. As lacrosse is the main form of<br />\nathletics for which Hopkins is known, it<br />\nseems that football practice should be undertaken only - when the two will not conflict.<br />\nThe lacrosse men, however, might make arrangements for practicing at different hours;<br />\nor, if this should not prove feasible, could<br />\nsurely use the cage several days in the week.<br />\nHopkins has plenty of material for a good<br />\nfootball team next year, and work right at<br />\nthis time will surely count. Neither the lacrosse nor football men, however, ought to<br />\nexpect to monopolize the field every afternoon<br />\nin the week. We suggest that the managers<br />\nof the teams concerned make some arrangements for giving up the field to each other certain days in the week, the men to go to Homewood or practice in the cage, according to<br />\nsome definite agreement.<br />\nThe University Played good football this<br />\nyear, and greater spirit was shown in supporting the team than ever before. Next year the<br />\nspirit on the sidelines proposes to be still better. Moreover, the football playing itself can<br />\nbe improved. To this end men will surely be<br />\nfound willing to give time for practicing this<br />\nspring. Why not give spring practice a fair<br />\ntrial?<br />\n<br />\nThe inter-class lacrosse games promise to<br />\nbe very close this year. Both the freshmen<br />\nand juniors have been holding practices for<br />\nseveral weeks, and are now in pretty good<br />\nshape. Both of the games will be held at<br />\nHomewood; the first, Monday, April 6th,<br />\nand the second on Monday, April 20th.<br />\nThe juniors, although tbey have a number<br />\nof good men on the squad, recognize the fact<br />\nthat they are up against a tough proposition,<br />\nand are determined to win. On the other<br />\nNow that the lockers are in place at Homehand, the freshmen, with Clary, Stockett, wood, the manner of their apportionment to<br />\nWilson and Tappan as a nucleus, undoubtedly the students is being discussed. At the last<br />\nwill have a fast team, and they are equally meeting of the trustees a scheme was proposed<br />\ndetermined to win.<br />\nby which the regular gymnasium fee, inA practice game will be played by the ju- creased to $10.00, was to include a locker in<br />\nniors with the Baltimore City College on Sat- both the gymnasium and the club house, and<br />\nurday, April 4th. The junior team will prob- a ticket of admission to all games under the<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nauspices of . the Athletic Association. This<br />\nplan, however much it may appeal to<br />\nthe student body, appears to have been opposed by several members of the board, who<br />\nobject to increasing the gymnasium fee. And<br />\nas the matter stands at present, it seems that<br />\na nominal rent, sufficient to cover the possible<br />\nloss of the key, will be charged for the use of<br />\na locker for the remainder of the season.<br />\n<br />\n9<br />\n<br />\nProfessor Buchner's appointment marks a<br />\nnew departure in the work of the University.<br />\nHe will devote his attention chiefly to instruction in the theory and principles of education, and it is believed that his work will have<br />\nan important influence in the advancement of<br />\neducation in the City, and throughout the<br />\nState.<br />\n<br />\n--0<br />\n<br />\nAt a recent meeting of the Swarthmore Athletic Council, it was decided that of the two<br />\nbranches of athletics—lacrosse and baseball—<br />\nthe latter should be left to take care of itself,<br />\nwhile lacrosse should be fostered with the idea<br />\nof making Swathmore famous in that game.<br />\nColumbia has started lacrosse practice with<br />\nseven of last year's team as a nucleus.<br />\n<br />\nMr. J. R. Syer, of Hamilton, Ontario, has<br />\nbeen appointed coach of the University lacrosse<br />\nteam, and will take charge of the squad this<br />\nafternoon. Mr. Syer was a member of several<br />\nof the best amateur teams of Canada, and for<br />\nthe last few years has played on professional<br />\nteams in the Senior League of Canada.<br />\nThe inter-class lacrosse series will be held<br />\non April 1, April 2 and April 4, on Soldiers'<br />\nField. On Wednesday, April 1, the seniors<br />\nwill play the juniors; on April 2, the sophomores will play the freshmen, and the final<br />\ngame will be played on Saturday, April 4.<br />\nCups will be given to the members of the winning team. On Monday, April, 6, the training table will be started at Memorial, and the<br />\nUniversity squad will be selected.'—Harvard<br />\nCrimson.<br />\n<br />\nTHE NEW APPOINTMENTS IN THE<br />\nFACULTY.<br />\nDr. Edward Franklin Buchner, who has<br />\nbeen recently appointed Professor of Education and Philosophy, is a graduate of Yale,<br />\nreceiving the degree of Doctor of Philosophy at<br />\nthat institution in 1893. He has since then<br />\nheld positions at Yale, New York University,<br />\nBrooklyn Institute, Clark, and the University<br />\nof Alabama, from whence he is called here.<br />\n<br />\nDr. John Broadus Watson has been chosen<br />\nProfessor of Experimental and Comparative<br />\nPsychology to succeed Prof. Stratton, who has<br />\nbeen recalled to the University of California.<br />\nHe is a graduate of Furman University, South<br />\nCarolina. He received the degree of Doctor<br />\nof Philosophy from the -University of Chicago<br />\nin 1903, since when he has instituted at that<br />\nDr. Watson represents both<br />\ninstitution.<br />\nExperimental and Comparative Psychology,<br />\nhaving made important contributions in both<br />\nfields, especially the latter. He ranks among<br />\nthe best-known authorities on the relation of<br />\nanimal to human intelligence and in the new<br />\nscience of animal behavior.<br />\n<br />\nUNIVERSITY NOTES.<br />\nPresident Remsen, of the Johns Hopkins<br />\nUniversity, as President of the National<br />\nAcademy of Sciences, has been invited by<br />\nPresident Roosevelt to take part in a conference on the Conservation of Natural Resources, to be held in the White House, May 13th,<br />\n14th, and 15th, 1908. The Governors of all<br />\nthe States and Territories have been invited to<br />\nattend, and they will each be accompanied by<br />\nthree special advisers.<br />\nThe Senators and Representatives of the<br />\nSixtieth Congress, the Justices of the Supreme<br />\nCourt, and the members of the Cabinet have<br />\nalso been invited to take part. The Inland<br />\nWaterways Commission, which suggested<br />\nthe conference, will be present to reply to<br />\ninquiries and make record of the proceedings.<br />\nA limited number of leading associations of<br />\nnational scope concerned with the natural<br />\nresources of this country will be invited to<br />\nsend one representative each to take part in<br />\nthe discussions.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nVirginia will be unable to send a team to<br />\nt h e University of Pennsylvania's annual<br />\nspring inter-collegiate and inter-scholastic<br />\nmeet on April 26th. We shall hold a dual<br />\nmeet on that day with the University of<br />\nNorth Carolina, and our baseball team will<br />\nhave a game here with Davidson College.<br />\nThis double attraction will no doubt draw a<br />\nlarge crowd.—College Topics, W. Va.<br />\nWHAT'S DOING AT HOPKINS.<br />\nDr. W. Max Miller, the eminent Egyptologist, of Philadelphia, delighted two large<br />\naudiences on March 17th and 18th, in McCoy<br />\nHall. A fair sprinkling of University men<br />\nwere present. Dr. Miller's learning is supplemented by a strong sense of humor, the effect<br />\nof which is heightened by his pleasant German accent.<br />\n<br />\nA fine set of Durand steel lockers has been<br />\nset up at Homewood. This about completes<br />\nthe appointments of the neat little field-house.<br />\n<br />\nFOR LUNCH<br />\nTHE MADISON, Cor. Madison<br />\n<br />\nand Eutaw<br />\n<br />\nCentral Lunch Rooms<br />\n26 souTH CHARLES STREET<br />\nWM. F. HAYWOOD, Manager<br />\n(Formerly at Y. M. C. A.)<br />\n<br />\nIF<br />\n<br />\nW<br />\n<br />\nY•<br />\n<br />\n“REFINED\"<br />\nIS THE<br />\n<br />\nMOST HARMLESS TOBACCO<br />\nFOR SMOKERS<br />\nBecause the intense heat, used in the toasting<br />\nor refining process, purifies tobacco and preserves the full cheering qualties of the high<br />\nclass tobaccos used for the brand,\"REFINED.\"<br />\nProdess patented July 30th, 1907<br />\nAwarded Gold rledal at the Jamestown<br />\nExposition<br />\nOn sale by dealers who cater for patronage of<br />\nsmokers who care<br />\n<br />\nC. & P.. St. Paul 256.256<br />\n<br />\nMd., Courtland 1156-1157<br />\n<br />\nBaltimore Coupe Company<br />\nCOUPES, LANDAUS, VICTORIAS<br />\nOPEN COACHES,PHAETONS, BUSSES<br />\n<br />\nMain Office, - - 315 West Fayette Street<br />\n<br />\nARTISTIC PHOTOGRAPHS<br />\n<br />\nLONDON STUDIO<br />\n112 W. LEXINGTON STREET<br />\nSpecial Discount to Students<br />\n<br />\nP(E:<br />\n<br />\nCONFECTIONER AND CATERER<br />\n<br />\nUnion Theological Seminary<br />\n700 PARK AVENUE, NEW YORK<br />\n<br />\n701 West North Avenue<br />\n<br />\n8 A. M. TO 9 P. M.<br />\n<br />\nOFFICE. HOURS:<br />\nSUNDAYS, 10 A M. TO 4 1'. M.<br />\n<br />\nPhiladelphia Dental Parlors<br />\nScientific Dentistry at Moderate Prices<br />\n123 N. HOWARD STREET,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nFully equipped for scholarly and practical work, in<br />\nthe midst of the Christian enterprises of a great city,<br />\nin close academic relations with Columbia and New<br />\nYork Universities, offers opportunities for the degrees<br />\nof B. D., A. M., and Ph. 1). Open on equal terms to<br />\nstudents of all Christian bodies.<br />\nSEVENTY-THIRD YEAR begins September 3oth,<br />\n1908. For Catalogue, address the President of the<br />\nFaculty, the<br />\nREV CHARLES CUTHBERT HALL, D. D.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nThe new field and house have already resulted<br />\nin increased interest in lacrosse among the<br />\nalumni, many of whom come out every<br />\nSaturday.<br />\n<br />\n11<br />\n<br />\n\"The Men's Store.\"<br />\n<br />\nHUTZLER BFOTHM<br />\n210 to 218 NORTH HOWARD ST.<br />\n<br />\nThe Scientific Association held its March<br />\nmeeting in the Physical Laboratory on March<br />\n19th. Professor J. S. Ames read a paper on<br />\nSome Recent Theories of Matter,\" and Mr.<br />\nW. D. Hoyt discussed \"Periodicity in the<br />\nFruiting of an Alga.\" About 150 were<br />\npresent.<br />\nThe new Archeological collection will be<br />\nopened formally on Friday evening, March<br />\n27th. Public exercises will be held in McCoy<br />\nHall. Illustrated addresses will be made by<br />\nProfessor Wilson, Dr. Robinson and Mr.<br />\nMagoffin.<br />\nPresident Remsen has been made the head<br />\nof a Board of Chemists who are to take up<br />\nproblems in connection with the enforcement<br />\nof the Pure Food and Drugs Act.<br />\n<br />\nOfficial<br />\nAthletic Outfitters<br />\nBALTIMORE<br />\n<br />\nC. & P.'Phone, St. Paul 3725-M<br />\n<br />\nESTABLISSIRD<br />\n<br />\n1872<br />\n<br />\nGEO. GOETZ' SONS, Tailors<br />\n215 E. FAYETTE ST., 2nd Floor<br />\nQUALITY<br />\n<br />\nSTYLE<br />\n<br />\nPRICE<br />\n<br />\nCARL C. HOLZAPFEL<br />\nBRITECL)<br />\nMaker of MUSICAL INSTRUMENTS<br />\n(Successor to HoLzAPPAL &<br />\n<br />\nExpert Repairer of all String Instruments<br />\n<br />\n306 N. HOWARD STREET<br />\nSHEET MUSIC .AND STRINGS<br />\n<br />\nChas. E. Smith & Co.<br />\n<br />\n...jnortsts...<br />\n121 N. Liberty Street, Baltimore<br />\nGive us the Style and Quantity<br />\nof Printing you require and we<br />\nwill do the rest<br />\n::<br />\nADAI1S & CROWLEY<br />\n<br />\n610 North Eutaw Street<br />\n<br />\nR.<br />\n<br />\nCHASE, HARVEY & KERR<br />\n8 W. FAYETTE ST.,<br />\n<br />\nMd.'Phone, 371-B<br />\n<br />\nQ. TAYLOR (Sc<br />\n<br />\nCO.<br />\n<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11 NORTH CHARLES STREET<br />\n<br />\nCOLLEGE POSTERS<br />\nare just the \"stunt\" to make your den attractive.<br />\nOur line of posters is unsurpassed in the city.<br />\nSomething new every minute. We can supply on<br />\nshort notice, special designs to suit the college. We<br />\nhave many odd subjects in pictures .<br />\n.<br />\n..<br />\n<br />\nHoward<br />\nSIZE 14x22<br />\nTHREE COLORS<br />\n26 CTS. EACH<br />\n<br />\nNovelty Company<br />\n<br />\n323 N. Howard Street<br />\nSTATIONERY<br />\n<br />\nBALTIMORE, MO.<br />\n<br />\nPOST-CARDS<br />\n<br />\nSIZE, 14x.22<br />\nTHREE COLORS<br />\n25 CTS. EACH<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n12<br />\n<br />\nPURNELL ART CO.<br />\n<br />\nVARSITY LACROSSE.<br />\nCome on, fellows, lets get together for the<br />\nLacrosse games. Everybody must get out<br />\nand help our team to win the championship,<br />\nand then to beat Mt. Washington, and finally<br />\nToronto.<br />\nTomorrow, Saturday the 28th, we play the<br />\nAlumni, and it isn't going to be slow either.<br />\nThe same afternoon the Freshman play the<br />\nCity College. Then on the fourth of April<br />\nthe team goes down to Annapolis. Let's get<br />\nup a big crowd to go along. There will be a<br />\nbaseball game there .the same afternoon.<br />\nApril 11th is the date of the first game at<br />\nHomewood. It will be a good sight to see<br />\nthe team come out on the field in their entirely new uniforms, to line up against the<br />\nblue and white boys from Columbia. This<br />\ngame will undoubtedly be something snappy.<br />\nColumbia has not been down here for years,<br />\nand she intends to make a particular good<br />\nshowing this time.<br />\n<br />\n224 North Howard Street<br />\n<br />\nPICTURE MERCHANTS<br />\nPictures Framed Correctly at Moderate Prices<br />\n• Once a Customer—Always a Customer<br />\nA Trial is All We Ask<br />\n<br />\nTHE A. RUPERTI COMPANY<br />\nBOOKBINDERS<br />\n238 PARK AVENUE<br />\n<br />\nC.& P., St. Paul 3346<br />\n<br />\nWaterman's Ideal FountainPen<br />\nTHE<br />\n<br />\nAND THE<br />\n<br />\nSPOON FEED<br />\n<br />\nCLIP7(:,<br />\n<br />\n/1‘,<br />\n<br />\nc; A<br />\n<br />\nA Monumental Success<br />\nSTANDING ON A REPUTATION<br />\nOF MANY YEARS AND LOOKED<br />\nUP TO BY ALL WRITERS AS<br />\nA NECESSITY, OF PERMANENT<br />\nUSE AND SUPERIOR QUALITY.<br />\n• DEALERS THE WORLD OVER<br />\nSELL THEM<br />\n<br />\nSuitable for Weddings, Commencements,Banquets, Etc. Menus,Dance<br />\nPrograms, Calling Cards and Class<br />\nStationery. Our prices are right.<br />\nWorkmanship unexcelled. Sample. mailed upon request.<br />\n<br />\nInvitations<br />\n<br />\nOTT ENGRAVING COMPANY<br />\nPHILADELPHIA, PA.<br />\n<br />\n1021 CHESTNUT STREET<br />\n<br />\nREPUTATION<br />\n<br />\nIT'S SKILL THAT COUNTS<br />\nIn making Shirts; you want a lit, we make them fit.<br />\n<br />\nOur Specials 1 sSi x<br />\n<br />\n1e6 $9.00<br />\nirtas raans y$S1t0y5<br />\nWohlioteredShm<br />\nC<br />\n<br />\nFull Line Men's Furnishings<br />\nSTRATTON'S, 226 NORTH LIBERTY STREET<br />\n<br />\n14Liourr attb<br />\n<br />\nTompattp<br />\n<br />\n616 CHESTNUT STREET<br />\n<br />\nDIAMOND MERCHANTS<br />\nJEWELERS AND SILVERSMITHS<br />\n<br />\nMilirial 3frattruitg AntirIrr<br />\nSPECIALISTS IN<br />\nFRATERNITY BADGES<br />\nFOBS, NOVELTIES<br />\nRINGS, CHARMS<br />\nWALL-PLAQUES<br />\n<br />\nMEDALS<br />\n<br />\nPRIZES<br />\nTROPHIES<br />\n<br />\nCOLLEGE PINS<br />\nFOBS, SEALS<br />\nRINGS, CHARMS<br />\nWALL-PLAQUES<br />\n<br />\n\fMd.'Phone, B-300a<br />\n<br />\nC. & P., St. Paul 3954<br />\n<br />\nBaltimore Book Company<br />\n<br />\nlit p<br />\n<br />\nSECOND-HAND BOOKS BOUGHT<br />\n<br />\n8 E. Lexington Street,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br />\n805 N. Howard Street<br />\n<br />\nSMITH'S BOOK STORE9<br />\n<br />\nTHE ALPHA<br />\n<br />\nPlICITO ENGRAVING COMPANY<br />\n<br />\n3rd door above Madison<br />\n<br />\nISTEIDENT'S ElITATIONICIRT<br />\n<br />\nARTISTS 6.1P',1<br />\n<br />\n-ACE Cornef-91-MtparrM4yetz'ed29<br />\n11AL 77M0IS\"tk..;) MA R YI,A NO. .,<br />\n<br />\nJ.H.U. Stationery a Specialty. Menu,Banquet and Dance Cards<br />\nA.Nr 1F:.<br />\nStationer and<br />\n<br />\nAirr4\"<br />\n3ENGRAVERS<br />\n<br />\nMAKERS -4- 0r 4- PRINTING .- PLATES 4* FOR 4- ALL,<br />\nARTISTIC -4- AND 4- MERCANTILE 4- PURPOSES<br />\n<br />\nFOSNOT and WILLIAMS CO.<br />\n<br />\n()-VSTIVS<br />\nEngraver<br />\n<br />\n'PRINTERS<br />\n514-16 WEST FRANKLIN STREET<br />\n<br />\n229 NORTH CHARLES STREET<br />\n<br />\nTI,. flows-Letter,• product of our plant<br />\n<br />\nPRINTING<br />\n<br />\nSISCO 13R4DS.<br />\n<br />\nENGRAVING<br />\n<br />\nNUNN & COMPANY<br />\n<br />\nFLAGS<br />\n<br />\nBOOKSELLERS and STATIONERS<br />\n<br />\n.pt<br />\n<br />\nBANNERS<br />\n<br />\n13 WEST LEXINGTON STREET,<br />\n<br />\n.4<br />\n<br />\n-<br />\n<br />\nBADGES<br />\nBALTIMORE, MD.<br />\n<br />\nCarry a complete line of School Books and College<br />\n<br />\nrerigrmargo-.1...muanua<br />\n<br />\nText Books, Miscellaneous,Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br />\n<br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n227 North Howard Street<br />\nSTATIONERY<br />\n<br />\nBINDING<br />\n<br />\nLet Us Handle Your<br />\nProperty<br />\n<br />\nILGENFRITZ STUDIO<br />\nSuccessor to Cusamiss<br />\n<br />\n1<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20<br />\n<br />\nWest Lexington Street<br />\n<br />\nBALTIMORE<br />\n<br />\nSpecial Discount to Students<br />\n...4.4.4<br />\n1<br />\n1111.1.01.10.111•••••••••••=61<br />\n,<br />\n<br />\nN. HESS' SONS<br />\nShoes for All Occasians<br />\n<br />\n$3.50 to $8.00<br />\n<br />\n8 Baltimore Street, East of Charles<br />\n<br />\nWe buy, sell, build, and loan money<br />\non real estate. If you want a house<br />\nor business location in any part of the<br />\ncity or suburbs, we will supply your<br />\nwants. Small payment down and<br />\neasy terms. Call or write for full<br />\nparticulurs .<br />\n<br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br />\nNear the University<br />\n<br />\nAGENTS FOR<br />\n<br />\n18 and 20 E. Baltimore St., Baltimore. Md.<br />\n<br />\nEvergreen Lawn<br />\n<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold sad Eashaspd<br />\nBALTIflORIS'S LARGEST OLD DOOR STORE<br />\n••••••••••<br />\n<br />\nChocolates<br />\n<br />\nBonbons<br />\n<br />\nBaltimore's Prettiest and Most Up-to-date Suburb<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\n<br />\nHamilton Ave. and Hartford Road<br />\n<br />\nCABIN PASSAGE AT LOW RATES<br />\nNew York to Bremen, London<br />\nParis, Gibraltar, Naples, Genoa,etc.<br />\n<br />\nCITY and SUBURBAN REALTY CO.<br />\n305 and 307 Calvert Building<br />\n<br />\nBaltimore<br />\n<br />\nto<br />\n<br />\nBremen<br />\n<br />\nDirect<br />\n<br />\nFor Particulars apply to A.SCHUMACHER & CO.<br />\nGeneral Agents, 7 South Gay Street<br />\n<br />\nWhen making your purchases, kindly remember our advertisers<br />\n<br />\n\fLEMMER'r<br />\n<br />\nrg.<br />\n<br />\nBAurimORE<br />\nYOU CANNOT SAY YOU HAVE WORN GOOD<br />\nCLOTHES UNTIL YOU TRY OURS.<br />\n<br />\nDON'T THINK OUR CLOTHES HIGH UNTIL<br />\nYOU SEE WHAT WE OFFER AT $25<br />\nMADE TO ORDER.<br />\n<br />\nOUR READY-TO-WEAR (LEMMERT - OWNMAKE)CLOTHES RANGE FROM $18 UP.<br />\n<br />\nHands off cheap gloves<br />\nif you want well-gloved<br />\nhands. Hand ott<br />\n<br />\nFOWNES<br />\nGLOVES<br />\n<br />\nTRY THIS DEPARTMENT ON YOUR NEXT SUIT.<br />\n<br />\n10 E. FAYETTE STREET<br />\nI-1. IPETT\"JPIN<br />\nManufacturer of<br />\n<br />\nGreek Letter Fraternity Jewelery<br />\n218 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br />\n<br />\nDo you like stylish Clothes? If so,<br />\nwhy not place your next order with<br />\n<br />\nFRITZ & BIEREN<br />\n4 W. SARATOGA ST., at Charles<br />\n<br />\nInsist upon Getting<br />\n<br />\nWe are tailors of experience and know<br />\nhow to make stylish Clothes<br />\n<br />\nThis Red Woven Label<br />\n<br />\nSuits and Overcoats, - $20.00 Up<br />\n<br />\nCOTRELL & LEONARD<br />\nALBANY, N. Y.<br />\n<br />\n1-<br />\n<br />\n1<br />\n<br />\nMADE FOlk,Thits<br />\n'<br />\n<br />\n- B.V. Dd<br />\nBEST RETAIL TRADE<br />\n.<br />\n,<br />\nOn Your<br />\n<br />\nMAKERS OP<br />\n<br />\nCAPS and<br />\nCOWNS<br />\n<br />\nCoat Cut Undershirts<br />\nand<br />\n<br />\nTo the American Colleges and<br />\nUniversities<br />\n<br />\nClass Contracts a Specialty<br />\n<br />\nCorrect Hoods for Degrees<br />\n<br />\nJirtistic 6ifts ••<br />\nWe offer the best in China, Glass, Art<br />\nPottery. Fine Color Prints, perfectly<br />\nframed, Smart Leather and Brass<br />\nNovelties.<br />\n<br />\nKnee Length Drawers<br />\nIt means Satisfaction and Comfort to You<br />\nACCEPT NO IMITATIONS<br />\n<br />\nErlanger Bros., New York<br />\n<br />\nLYCETT STATIONERS<br />\n317 NORTH CHARLES STREET<br />\n<br />\nWhen making your purchases, kindly remember our advertiseno<br />\n<br />\n\f", "format": "basic_html", "processed": "voe,<br />\nHmoilarim<br /><br />\nTHE-JOMIS-HOFKIRS-UNIVERSITY<br />\nBALTIMORE<br /><br />\nThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nThirty-Second Year. Beginning October 1, 1907.<br />\nIRA REMSRN, President.<br />\nDean of the College Faculty.<br />\nWILLIAM H. HOWELL,<br />\nDean of the Medical Faculty.<br /><br />\nEDWARD H. GRIPPIN,<br /><br />\nINSTRUCTION.<br /><br />\nH.<br /><br />\nIII.<br /><br />\nIV.<br /><br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\n(a)<br />\ncandidates for the degree of Ph. D.)<br />\n(b)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c)<br />\nAs candidates for the degree of B. A.<br />\n(d)<br />\nAs special students.<br /><br />\n.<br /><br />\nV<br /><br />\nVI.<br />\nVII.<br />\nVIII.<br /><br />\nLibraries.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\nvolumes<br />\nibi,000 volumes<br />\n244,000 volumes<br /><br />\n135,000<br /><br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br /><br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nGeorge M. Stratton.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance,<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\nMathematics.<br />\nPhysics.<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby P. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nC. M. Andrews.<br />\nJ. Ii. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\nGROUPS.<br />\nz.<br />\nAncient Languages.<br />\n2.<br />\nModern Languages.<br />\n3.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\n4.<br />\nChemistry, Biology and Geology.<br />\n5Serial Publications.<br />\nAmerican Journal of Mathematics (vol. XXX).<br />\nAmerican Chemical Journal (vol. XXXIX).<br />\nAmerical Journal of Philology (vol. XXIX).<br />\nStudies in Historical and Political Science (vol. XXVI).<br />\nModern Language Notes (vol. XXIII).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XII).<br />\nUniversity Circular (vol. XXVII).<br />\nProgrammes of the courses offered to graduate students<br />\nis Philosophy and the Arta and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br /><br />\nIX.<br />\nX.<br /><br />\nXI.<br />\nXII.<br /><br />\nXIII.<br /><br />\nXIV.<br /><br />\nXV.<br /><br />\nXVI.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXX in progress. $5 per volume. (Forcing<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. RE,MSEN, Editor. Monthly. 8vo. Volume<br />\nXXXIX in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE,'Editor. Quarterly. 8vo.<br />\nVolume XXIX in progress. $3 per volume.<br />\n(Foreign postage 5o cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVI in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVII in progress. $: per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4t0.<br />\nVolume XXIX in progress. $2 per year. (Foreign<br />\npostage 50 cents).<br />\nJohns Hopkins Hospital Reports. 4t0. Volume<br />\nXV in progress. $5 per volume. (Foreign postage 5o cents).<br />\nContributions to Assyriology and Semitic Philology (13eitr4e zur Assyriologie, etc.) PAUL<br />\nHAUPT and FRIEDRICH DELITZSCH, Editors Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume VI in progress.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXXIII in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, $5. Third Series in progress, 2.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland. $7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland'a Photographs of the Normal Solar Spectrum. zo<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. 51.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoeina de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.5o.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $1.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br /><br />\nUNIVERSITY DEBATING TEAM-1908<br /><br />\nTHE NEWS-LETTER<br />\nVOL. XII.<br />\nSubscriptions, $1.50 per year.<br /><br />\nMARCH 27, 1908.<br />\nPublished Fortnightly.<br />\nBOARD<br /><br />\nOF<br /><br />\nNO. 11<br />\nio Cents per copy<br /><br />\nEDITORS.<br /><br />\nSamuel Claggett Chew, Jr., 1909, Editor-in-Chief.<br />\nWalter V. Johnson, i9o9, Athletic Editor.<br />\nFranklin 13. Pedrick, 1909, Ass't Editor-in-Chief.<br />\nJ. Purdon Wright, t908, Business Manager.<br />\nGeorge W. Corner, 3d, 1909, News Editor.<br />\nBoyd Wylie, 1910, Ass't Business Manager.<br />\nJ. H. Owens, 1909,<br />\nA. C. Woods, 1910, Ass't News Editors.<br />\nG. R. Veazey, 1910,<br />\n•<br />\nAddress all articles, communications, etc., to Samuel C. Chew, Jr., Box 134, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to J. Pardon Wright, Box 689, Johns<br />\nHopkins University, Baltimore, Md.<br /><br />\nEDITORIAL.<br />\nwIc<br /><br />\nV V<br /><br />\nI E very gladly give space to the frank letter on the Fraternity question<br />\nsent to us by Mr. John M. Booker, an Alumus and graduate student<br />\nhere, and an afore-time Editor-in-chief of this paper.<br />\nV<br />\nV<br />\nThe questions discussed in his letter are just-those which are at<br />\nV<br />\nV<br />\npresent<br />\nunder the consideration of the Inter-Fraternity Conference,<br />\nV.<br />\nwhich is now holding regular meetings. This conference began as<br />\nV.<br />\nthe unofficial gathering together of some six or seven men. More<br />\nIIVVVVVVVVVI:<br />\nrecently two men have been chosen by each fraternity to represent<br />\n- a their chapters officially and to lay before the several fraternities in<br />\nchapter meeting the several articles in the agreement under consideration.<br />\nAs Mr. Booker strikes right at the root of the matter, as the plans of the conference are<br />\nin no way secret, and as such plans will be of interest to all students who are not as yet<br />\nacquainted with them, it may be well to state briefly the agreements at which the originators of the present conference aimed—agreements to which it is but fair to say that three fraternities at least are not yet ready to consent.<br />\n\"ICIO *An. OW- UV<br /><br />\n(1)<br />\n(2)<br />\n(3)<br />\n(4)<br /><br />\nThat no man shall be invited to join a fraternity prior to a fixed, though as yet, uncertain date.<br />\nThat no fraternity shall entertain on the night of the Y. M. C. A. reception.<br />\nThat no upper-classman shall for fraternity reasons protect a freshman from hazing.<br />\nThat a general inter-fraternity meeting shall be arranged at least once a year.<br /><br />\nThere is no reason why propositions 2, 3, and 4 should not receive immediate and general acceptance. The rub lies in the first article of the agreement. In an ideal condition of<br />\naffairs such an arrangement, would of course, be in vogue now. But conditions are not Utopian here, and if we wish to approach anywhere near the suburbs of the city of our ideals we<br />\nmust be careful. \"Run slow through switches, curves and over crossings\"—and the proposition to enact a date prior to which no man can be pledged is a most decided switch from the<br />\npresent fraternity track.<br />\nIn one point in particular we believe everyone will agree that Mr. Booker is wrong.<br />\nHe says, \"Set a date, say toward the end of the Freshman year, upon which all the fraternities<br />\nindividually offer election to the men they have selected.\" At a large college, with Freshman<br />\nClubs, and distinctly drawn class lines, such a suggestion is feasible and practicable. Here it<br />\nis almost certainly not.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\n,futtur<br />\nluitanip<br />\nA AI<br /><br />\nACROSSE and Track are of course the two great athletic interests of<br />\nthe spring here at Hopkins. But there must be a good many men<br />\n. NujItiggfigirtollgg<br />\n. who for one reason or another, or for no reason in particular, do not<br />\nplay lacrosse or enter in track and field events, and yet would be<br />\n4<br />\nmore than glad to enter into a tennis tournament were such an one<br />\nf S*.<br />\narranged. Of course, a good many lacrosse men and, we suppose,<br />\nall the track men would find time to enter. This year the courts at<br />\ngigirgE2.1111*<br />\nHomewood will not be laid out, but it is to be hoped that it will not<br />\nn<br />\n61:1&amp;no,•<br />\nbe long before Hopkins will have several courts there. In the meantime, if a tennis tournament can be arranged—and we trust that it<br />\ncan—matches could be played at the Baltimore Country Club, by those who are members<br />\nthere; at Catonsville; or, if necessary, at Druid Hill Park.<br />\n•<br /><br />\nINT3•<br /><br />\nTF,MPORA! 0 Mores! We hear with sorrow that the trustees have<br />\nsent forth the word denying to us the congregation in the barber•<br />\nshop.<br />\nNo longer are the wits of the day to gather in solemn conclave<br />\nAt<br />\n*<br />\n*<br />\n*<br />\ndebate<br />\non Walter's Hair Tonic, or to recall sweet memories of the<br />\nto<br />\nv<br />\nAv. *<br />\n11,<br />\nv •<br />\ndaily<br />\ntoil.<br />\nWhy does the worthy successor of Will's Coffee House<br />\n*.<br />\n*<br />\nof<br />\nthe<br />\ntime<br />\nof Addison and Steele feel the restraining touch of the<br />\nIF<br />\n*<br />\niw<br />\n*<br />\nhand?<br />\nIn the time of Haroun al Raschid the barber was<br />\ntrustee's<br />\n*<br />\n7*<br />\n• noryvvri V:<br />\noften the center of attraction and still today do we feel the mystic influence of the barber's throne, the charm of the arm-chairs ranged<br />\nf\\TA<br />\nalong the wall—the tiltable sort that makes one feel true relief at<br />\nhis escape from the hard-board bench. Here were discussed the leading Scottish poets of the<br />\nRenaissance, the elements of Philosophy, the latest play of the day, and even character study<br />\namong the faculty. Trustees! Would you deprive us of the pleasure to which we look forward<br />\nduring the last ten minutes of every hour, would you take from us the sparkling wit, the<br />\nguileful pun, the satirical tongue, the mimic's jest and the freshman's wond'ring gaze? Come<br />\nand listen to the keen wits of the matriculates, developed as is possible under no circumstances<br />\nas well as under Walter's eye, and hasten to tear down with your own puissant hands the bull<br />\nwhich takes from the duller brain, the chance to glean a sharper wit, and more brilliant mind.<br />\nV V<br />\ns_. 1010.1010 V V. V lif 1.V V<br /><br />\nHE announcement that the Trustees have appropriated money for the<br />\nerection of a grand stand at Homewood is being received by everyone with pleasure. All signs which point homeward are welcome!<br />\nBut the stand will not be ready until the fall, and in the meanwhile<br />\nwe have before us what promises to be the greatest lacrosse season<br />\never experienced in Baltimore. There are not enough benches at<br />\nthe field. They are temporary, to be sure, but were several more<br />\nplaced there this spring, certainly some use could be found for all the<br />\nbenches somewhere after the permament stand has been built.<br /><br />\nAN OPEN LETTER ON THE FRATERNITY QUESTION.<br />\n. of the NEWS-LETTER:<br />\nTo the Editor<br />\nDEAR SIR:—I am glad to see the movement for an understanding between the fraternities in regard to 'pledging.\" It should rid them of the greatest hindrance to their healthy<br />\ngrowth here—the too early pledging.<br /><br />\n4<br /><br />\nTHE NEWS-LrIVER.<br /><br />\nThat this evil is as universal as it is detrimental, is evidenced by a letter recently published in The Nezt;s,in which a prep-school teacher complains of the harm done his pupils' work<br />\nby the incessant fraternity campaigning.<br />\nThis is only one side of the medallion. Constant campaigning keeps the brother so<br />\nbusy developing his chapter, that there is no time left for him to be developed by his fraternity. He literally exists for the fraternity. This is the reverse of what was meant to be.<br />\nThe fraternity should exist for him. It is not like relations or like large families. It<br />\nis not sent from heaven. It was created by the \"student\" to fill a student's needs. The<br />\nmoment it ceases to do this, that moment it has ceased to be a functional part of the student's<br />\nlife,—and it has lost its right to exist.<br />\nBut, so far, the situation is in the hands of the fraternity men. Any future condition<br />\nthat does away with fraternities here will arise from their present inability to regulate their<br />\nrelations.<br />\nFor that regulation is possible, I have not the least doubt. Of course, the men .delegated to shape it must have an average amount of self-colltrol and imagination, and every<br />\none of them must be capable of the conviction that any attempt to make an arrangement<br />\nspecially favorable to his crowd—which, from its very nature, could be only a temporary one<br />\n—would jeopardize a permanent improvement in the condition of all alike. Given men up to<br />\nthese requirements, any plan, as first adopted, would probably be all wrong. Like railroad<br />\nlegislation, it must have time to grow. It may never he quite perfected—no laws anywhere<br />\nare ever up-to-date—but give it a chance, and it will not only improve the conditions of chapter life, it will also insure the continuance of fraternities in good odor and forestall a feeling<br />\nagainst them on the part of parents and teachers which has already begun to manifest itself.<br />\nIn approaching such an attempt, three things at once occur to me as of paramount<br />\nimportance; first, provide sufficient time for the school boy to realize conditions here; Second,<br />\nprevent the tender of an election until a day set by all; third, prevent the acceptance of an<br />\nelection until some day following.<br />\nFirst, of course, a committee of delegates from each fraternity, ultimately to become a<br />\npermanent court. Let it set a date, say toward the end of the Freshman year—upon which<br />\nall the fraternities individually offer election to the men they have selected; let it set a date<br />\nclosely following this upon which every freshman who has received a notice of election meets<br />\nthe delegates in a body and declares openly his acceptance of election into this or that fraternity,—at the same time, taking oath that he has neither been offered an election, nor has he<br />\naccepted one until the dates agreed upon by all. Whereupon, the delegate representing the<br />\nfraternity whose invitation he has accepted, then steps forward on the part of the fraternity<br />\nand takes an oath to the same effect. And let no candidate be initiated until he has announced his acceptance of election through the delegates assembled in a body.<br />\nSuch an oath would prevent any fraternity from secretly violating the treaty. Of<br />\ncourse, open violation would mean a rupture of relations. Whether or not, a fraternity would<br />\nwant to go back upon its agreement, is a matter of reasonable doubt. Whether or not it<br />\ncould afford to do so, is a matter of reasonable certainty. This agreement, or a similar one<br />\nwould carry with it benefits which would be both immediate and far-reaching. It would first<br />\nof all do away with the indignified scramble known as \"robbing the cradle\" and the consequent indignation of parents and teachers such as we have recently had evidence of.<br />\nIt would prevent the bad feeling resulting from \"tampering with pledged men,\"—<br />\nwhich never finds expression, and is more intense than if it did.<br />\nIt would put the fraternities in a dignified position toward the incoming men, and<br />\nenable them to exercise a disciplinary effect corresponding to that at Princeton, and at other<br />\nplaces where the honor is held before the freshman, at the formative time of his college life.<br />\nIt would give everybody time to realize what he was about, which would in turn pre\"mistakes.\"<br />\nAs a result, the student-body would settle into place easily and naturally<br />\nvent<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\n=7\"<br /><br />\nand, most to be desired, unself-consciously. Everybody would be where he belonged, and,<br />\nbetter still, nobody would be where he did not belong.<br />\nBut above all, it would mitigate the evil of the time-devouring campaign, which has<br />\nalways stunted the growth of real fraternity life here,—protests to the contrary, notwithstanding. This is an unnatural state of affairs, the outgrowth of the abnormal position of a college<br />\nin a big city. And it can be bettered only by a treaty fair to all, and squarely lived up to.<br />\nJOHN M. BOOKER, 1901.<br /><br />\nTHE 'CONFERENCE.\"<br />\nBoth our Editorial and Mr. Booker's letter in this issue of the NEWS-LETTER have lost<br />\nmost of their point since the final decision of the Inter-Fraternity Conference that no definite<br />\nagreement in the matter of pledges should be entered upon. Notwithstanding the fact that<br />\nseveral fraternities felt that it would be wise to have an inter-fraternity agreement minus the<br />\npledging clause, nothing was done regarding the remaining articles of the agreement and the<br />\nconference adjourned, apparently sine die.<br /><br />\nJOINT CONCERT.<br />\nThe Joint Concert by the Woman's College<br />\nand Hopkins proved to be a great success.<br />\nEveryone who attended was very much<br />\npleased with the entire performance. Many<br />\npronounced it the best concert that they had<br />\nheard for several years. Every number on<br />\nthe program was enjoyable and well rendered.<br />\nThe features which were most popular with<br />\nthe audience were the solos, all of which were<br />\nexceptionally go od ; the medley by the<br />\nWoman's College Glee Club; and the \"Song<br />\nof the Vikings,\" which was sung by the two<br />\nGlee Clubs—a chorus of about fifty voices.<br />\nThis was, indeed, a splendid number. It was<br />\na beautiful sight to see the girls in their caps<br />\nand gowns, each wearing a bouquet of flowers,<br />\nand the men in evening dress with a spray of<br />\nlillies of the valley in their lapels.<br />\nThe decorations of the hall added to the<br />\nfestivity of the occasion. The stage was<br />\nbanked with palms, above which were hung<br />\nin the center the Woman's College flag and<br />\nthe Hopkins flag. Around the sides of the<br />\nhall were tastefully draped the class banners<br />\nof the two colleges. Very pretty programs<br />\nwere made for the concert. They contained<br />\nthe picture of each club, a list of the<br />\nmembers of the clubs, and also the<br />\npatronesses.<br />\nEverything went off without a hitch and<br />\nconsequently the concert did not drag in a<br /><br />\nsingle place. Although they began at halfpast eight, and although there were no waits<br />\nbetween numbers, the concert was not over<br />\nuntil eleven o'clock. A proof that the concert was not boring was that everyone sat<br />\nthrough to the end.<br />\nAside from the concert being such a success<br />\nin a musical and social way, it was just as<br />\nmuch so from the financial side. While the<br />\nmanager is unwilling to state the exact<br />\namount of profit that each club made, he says<br />\nhe is perfectly satisfied with the results, and<br />\nthat now the clubs will be able to take an<br />\nEaster trip for three days down the Eastern<br />\nShore. Heretofore the clubs have been<br />\ngreatly hampered by lack of funds and for<br />\nthis reason they have not been able to take<br />\nany extended trips, as it is impossible to do<br />\nso without having any capital. After taking<br />\nthe Easter trip, the management hopes to have<br />\nmore than enough to pay off the debt incurred<br />\nthree years ago. During that year the clubs<br />\nwere very fine and they took several long trips,<br />\nand the season was considered to be very successful and prosperotth, but it is not generally<br />\nknow that the manager left the clubs with a<br />\ndebt of over two hundred dollars. This debt<br />\nhas, however, been reduced by Manager T.<br />\nPoole Maynard to about one-half. The management hopes to be able to wipe out this<br />\ndebt, and to let the clubs start next year unencumbered by any debts.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\n11<br /><br />\n1=11<br /><br />\nOUR YELLS.<br />\nThe matter of yells and yelling and yellleader is one of considerable importance right<br />\nnow. The yelling at the games this spring<br />\nmust be better than at the foot-ball games last<br />\nautumn. We must have regular practice and<br />\nwe must pitch in pell-mell and yell like—<br />\nwell, who can tell? Every student here does<br />\nnot know the yells, but every one ought to.<br />\nWe give you an opportunity here. Perhaps<br />\nYOU have no Y. M.C. A. hand-book, wherein<br />\nthe yells are printed. At any rate, you have<br />\na copy of this NEWS-LUTTER in your hand<br />\nnow. Sit down and learn them now. The<br />\nfirst one is not in the \"Freshman's Bible,\"<br />\nand it's the one you'll need after your last<br />\nrecitations this year, when you give a \"Geebee !\" for Ma Greene and Doc. Vos and the<br />\ngenial Murray P.<br />\nGee-bee!<br />\nGee-ha!!<br />\nGee-ha, ha, ha, ha!<br />\n!<br />\n!*<br />\nHe's a daisy!<br />\nHe's a la-la!<br />\nHe gets there every time !<br />\nLet's all evoke a facial ripple!<br />\nH-A ! H-A !! HA !!!<br />\nHullabaloo! Canuck ! Canuck !<br />\nHullabaloo! Canuck ! Canuck !<br />\n*—These blanks have no reference to Walter or<br />\ndamnation.<br /><br />\nIJJTAIJNIKI<br />\nHurrah! Hurrah!<br />\nJ. H. U.!<br />\nRah, Johnny! Rah, Hop.!<br />\nRah, Johnny Hopkins!<br />\nHurrah! Hurrah!<br />\nBlack! Blue!<br />\nHopkins!<br />\nHoo! Wah ! Hoo !<br />\nHoo! Wah ! Hoo !<br />\nHoo! Wah ! Hoo! Wah<br />\nJ. H. U.!<br />\nRa—a—a !<br />\nRa—a—a!<br />\nRa—a—a !<br />\nRah! Rah! Rah! Rah!<br />\nRah! Rah! Rah! Rah! Rah!<br />\nJohns Hopkins!<br />\nWe should learn, also, \"Seniors, wise and<br />\nlearned,\" and \"A Rousing Hullabaloo,\" both<br />\ncontained in the hand-book. And we should<br />\nnot forget a song known now to too few of us,<br />\nwhich runs—<br />\n''To win ! To win !<br />\nWe'd like, like—to win!<br />\nBut you'll have to wait 'till the moon turns<br />\ngreen,<br />\nAnd the brass band plays 'God Shave the<br />\nDean.'<br />\nHa.ha! Ho-ho!<br />\nIt's plain as A. B. C.<br />\nIf anybody's going to win to-day<br />\nIt's we, we, WE!\"<br /><br />\nTHE NEWS-LETTER.-<br /><br />\n7<br /><br />\nThere is just one more point to remind<br />\nevery one of. We must have a first-rate, big,<br />\nenthusiastic yell-leader this spring; one like<br />\nGriswold of old (minus Bob's flip-flop hands!)<br /><br />\nsuch an important athletic meet. The University of Pennsylvania hopes that you will be<br />\nrepresented by a team. If an invitation is desired, a note to Geo. W. Orton, Franklin<br />\nField, Philadelphia, will get a speedy reply.<br /><br />\nUNIVERSITY OF PENNSYLVANIA RELAY RACE CARNIVAL, LAST<br />\nSATURDAY IN APRIL.<br /><br />\nGRAND STAND AT HOMEWOOD.<br /><br />\nAt a recent meeting of the Board of Trustees of this University, $12,000 was approThe Fourteenth Annual Relay Races given priated for the erection of a grand stand on<br />\nby fhe University of Pennsylvania will be held the athletic field at Homewood.<br />\nas usual on the last Saturday in April. InviThe stand will be an imposing affair, over a<br />\ntations have been sent to all the leading edu- hundred feet long, and of an aesthetic quality<br />\ncational institutions in , the country, and entirely in keeping with the dignity of the<br />\nalready entries are pouring in, guaranteeing University. It will be built entirely of conthe success of this year's meet. The Relay crete, and the seats will be arranged somewhat<br />\nRaces are probably the best known set of after the fashion of the old Greek theatre.<br />\nsports, held annually, in the world. They are The stand at Tome Institute, Port Deposit, is<br />\nlikewise the largest. Last year over 200 scho- very similar to the proposed one at Homewood.<br />\nlastic and college teams faced the starter.<br />\nThe space originally set apart for the build1500 competitors' tickets were necessary to ing was deemed unsuited, because it faced the<br />\nsupply the large number of athletes that com- west. The plans as now completed place the<br />\npeted in the different events. Yale, Cornell, building on the Charles street side of the club<br />\nPrinceton, Chicago, Michigan, Dartmouth, house, so that the sun will be, in the evening,<br />\nSyracuse, in fact, all the leading colleges almost directly behind the spectators. The<br />\nwere present, while the schools were just as ground left vacant on the other side will be<br />\nwell represented. The institutions having utilized for three or four tennis courts, on<br />\nteams in these races come from districts as far which work has already been commenced.<br />\ndistant as west of Chicago, south of Richmond,<br />\nWork on the new stand will begin at once.<br />\nand north of Boston. Every intercollegiate Indeed, the location is already staked out, and<br />\nchampion, both Western and Eastern, then in the contractors will endeavor to have the<br />\ncollege, with but one exception, competed in stand ready for use for next football season.<br />\nthe special events. It is thus no wonder that<br />\nthese games attract to themselves such wonTHE CROSS. COUNTY RUN.<br />\nderful entries. Each year the best college<br />\nThe first cross county run, held last Saturand scholastic athletes of the country are at<br />\nweek, was not as successful from a Uniday<br />\neducathe Relay Races, and it is an athletic<br />\nstandpoint as it might have been, for,<br />\nversity<br />\nrelay<br />\nA<br />\ntion in itself to attend this meet.<br />\nteam banner came to us, the indithe<br />\nwhile<br />\nso<br />\nteam is composed of but four members,<br />\nwas not as good as had been exwork<br />\nvidual<br />\nor<br />\nthat it is within the power of any school<br />\npected.<br />\na.<br />\ncollege to send their athletes to Philadelphi<br />\nIt was a pity that. Breyer should have misThis is done in many schools by popular subthe pace at the start and have climbed<br />\njudged<br />\nAthletic<br />\nscription where the finances of the<br />\nhill on Charles Street avenue at the<br />\nlong<br />\nthe<br />\nAssociation are not sufficient for the purpose.<br />\nand that Brenton should have foldid,<br />\nhe<br />\nrate<br />\nto<br />\nThis year's meet needs only fair weather<br />\nlead. The result showed<br />\nhis<br />\npartner's<br />\nlowed<br />\nthe<br />\nmake it the most successful to date. All<br />\nmuch. Griffith, howtoo<br />\nwas<br />\nstrain<br />\nthe<br />\nthat<br />\nbig colleges have sent assurances that they<br />\nfinished strong in<br />\nand<br />\nit<br />\nto<br />\nequal<br />\nwas<br />\never,<br />\nwill be represented. Because of the Olympic<br />\nplace.<br />\nsecond<br />\nbe<br />\nSports in London, all the star athletes will<br />\nFrom a spectator's point of view, the race<br />\nin fine shape, and they will all.be on hand at<br />\na magnificent one. The men started off<br />\nwas<br />\nbe<br />\nFranklin Field on April 25th. It will<br />\none-mile clip, and' kept it up until the<br />\na<br />\nat<br />\nworth a long journey to see and be present at<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nfoot of the Notre Dame hill. By that time<br />\ntheir first wind was gone, and it was evident<br />\nthat all but those in pink of condition suffered<br />\ngreatly. Several men dropped out along here.<br />\nThe course across field to Falls road was a<br />\ndifficult one, for several of the hills were so<br />\nsteep that running up them was a practical<br />\nimpossibility. Then, too, the course was not<br />\nproperly-placarded, and several men lost their<br />\nway.<br />\nHowever, the majority kept well<br />\nbunched, and even in the run over the<br />\nCounty Club's links and up the Falls road, it<br />\nwas the long grind up Cold Spring lane that<br />\ntried the mettle. Some of the men walked all<br />\nthe distance, some alternated creeping and<br />\nsprinting; and here more dropped out.<br />\nThe crowd gathered around the tape at the<br />\nfinish was surprised when the figure down at the<br />\nfoot of the hill resolved itself into Elphinstone,<br />\nof the Cross County Club. Soon followed<br />\n\"Mitch\" Griffith and then another Cross<br />\nCounty Club man. So two of the three places<br />\nwent to outsiders. However, two freshmen,<br />\nWolf and Reeside, finished fourth and fifth,<br />\nand they, with Russell, who finished a little<br />\nlater, formed the team that won the race.<br />\nBreyer had given out a long way back, and<br />\nBrenton was some distance from first also.<br />\nHowever, with a single exception, every Hopkins man entered finished the complete six<br />\nmiles.<br /><br />\nINTER-CLASS LACROSSE.<br /><br />\nably be composed of the following: Gutman,<br />\nWhitcraft, Lowndes, Baily, Hopkins, Owens,<br />\nSmith, Stewart, Vogeler and Bassett.<br />\nWe would like to recommend very heartily<br />\nthe project of having spring football practice<br />\nthis year. Princeton and other colleges of<br />\nathletic reputation have found it worth while<br />\nto have this practice in the last part of the<br />\nyear, and it seems that Hopkins will have peculiarly favorable conditions for taking this<br />\nmatter up during this spring. There will be<br />\nno recognized baseball team, and the field will<br />\nbe open for football, except during lacrosse<br />\npractice. As lacrosse is the main form of<br />\nathletics for which Hopkins is known, it<br />\nseems that football practice should be undertaken only - when the two will not conflict.<br />\nThe lacrosse men, however, might make arrangements for practicing at different hours;<br />\nor, if this should not prove feasible, could<br />\nsurely use the cage several days in the week.<br />\nHopkins has plenty of material for a good<br />\nfootball team next year, and work right at<br />\nthis time will surely count. Neither the lacrosse nor football men, however, ought to<br />\nexpect to monopolize the field every afternoon<br />\nin the week. We suggest that the managers<br />\nof the teams concerned make some arrangements for giving up the field to each other certain days in the week, the men to go to Homewood or practice in the cage, according to<br />\nsome definite agreement.<br />\nThe University Played good football this<br />\nyear, and greater spirit was shown in supporting the team than ever before. Next year the<br />\nspirit on the sidelines proposes to be still better. Moreover, the football playing itself can<br />\nbe improved. To this end men will surely be<br />\nfound willing to give time for practicing this<br />\nspring. Why not give spring practice a fair<br />\ntrial?<br /><br />\nThe inter-class lacrosse games promise to<br />\nbe very close this year. Both the freshmen<br />\nand juniors have been holding practices for<br />\nseveral weeks, and are now in pretty good<br />\nshape. Both of the games will be held at<br />\nHomewood; the first, Monday, April 6th,<br />\nand the second on Monday, April 20th.<br />\nThe juniors, although tbey have a number<br />\nof good men on the squad, recognize the fact<br />\nthat they are up against a tough proposition,<br />\nand are determined to win. On the other<br />\nNow that the lockers are in place at Homehand, the freshmen, with Clary, Stockett, wood, the manner of their apportionment to<br />\nWilson and Tappan as a nucleus, undoubtedly the students is being discussed. At the last<br />\nwill have a fast team, and they are equally meeting of the trustees a scheme was proposed<br />\ndetermined to win.<br />\nby which the regular gymnasium fee, inA practice game will be played by the ju- creased to $10.00, was to include a locker in<br />\nniors with the Baltimore City College on Sat- both the gymnasium and the club house, and<br />\nurday, April 4th. The junior team will prob- a ticket of admission to all games under the<br /><br />\nTHE NEWS-LETTER.<br /><br />\nauspices of . the Athletic Association. This<br />\nplan, however much it may appeal to<br />\nthe student body, appears to have been opposed by several members of the board, who<br />\nobject to increasing the gymnasium fee. And<br />\nas the matter stands at present, it seems that<br />\na nominal rent, sufficient to cover the possible<br />\nloss of the key, will be charged for the use of<br />\na locker for the remainder of the season.<br /><br />\n9<br /><br />\nProfessor Buchner's appointment marks a<br />\nnew departure in the work of the University.<br />\nHe will devote his attention chiefly to instruction in the theory and principles of education, and it is believed that his work will have<br />\nan important influence in the advancement of<br />\neducation in the City, and throughout the<br />\nState.<br /><br />\n--0<br /><br />\nAt a recent meeting of the Swarthmore Athletic Council, it was decided that of the two<br />\nbranches of athletics—lacrosse and baseball—<br />\nthe latter should be left to take care of itself,<br />\nwhile lacrosse should be fostered with the idea<br />\nof making Swathmore famous in that game.<br />\nColumbia has started lacrosse practice with<br />\nseven of last year's team as a nucleus.<br /><br />\nMr. J. R. Syer, of Hamilton, Ontario, has<br />\nbeen appointed coach of the University lacrosse<br />\nteam, and will take charge of the squad this<br />\nafternoon. Mr. Syer was a member of several<br />\nof the best amateur teams of Canada, and for<br />\nthe last few years has played on professional<br />\nteams in the Senior League of Canada.<br />\nThe inter-class lacrosse series will be held<br />\non April 1, April 2 and April 4, on Soldiers'<br />\nField. On Wednesday, April 1, the seniors<br />\nwill play the juniors; on April 2, the sophomores will play the freshmen, and the final<br />\ngame will be played on Saturday, April 4.<br />\nCups will be given to the members of the winning team. On Monday, April, 6, the training table will be started at Memorial, and the<br />\nUniversity squad will be selected.'—Harvard<br />\nCrimson.<br /><br />\nTHE NEW APPOINTMENTS IN THE<br />\nFACULTY.<br />\nDr. Edward Franklin Buchner, who has<br />\nbeen recently appointed Professor of Education and Philosophy, is a graduate of Yale,<br />\nreceiving the degree of Doctor of Philosophy at<br />\nthat institution in 1893. He has since then<br />\nheld positions at Yale, New York University,<br />\nBrooklyn Institute, Clark, and the University<br />\nof Alabama, from whence he is called here.<br /><br />\nDr. John Broadus Watson has been chosen<br />\nProfessor of Experimental and Comparative<br />\nPsychology to succeed Prof. Stratton, who has<br />\nbeen recalled to the University of California.<br />\nHe is a graduate of Furman University, South<br />\nCarolina. He received the degree of Doctor<br />\nof Philosophy from the -University of Chicago<br />\nin 1903, since when he has instituted at that<br />\nDr. Watson represents both<br />\ninstitution.<br />\nExperimental and Comparative Psychology,<br />\nhaving made important contributions in both<br />\nfields, especially the latter. He ranks among<br />\nthe best-known authorities on the relation of<br />\nanimal to human intelligence and in the new<br />\nscience of animal behavior.<br /><br />\nUNIVERSITY NOTES.<br />\nPresident Remsen, of the Johns Hopkins<br />\nUniversity, as President of the National<br />\nAcademy of Sciences, has been invited by<br />\nPresident Roosevelt to take part in a conference on the Conservation of Natural Resources, to be held in the White House, May 13th,<br />\n14th, and 15th, 1908. The Governors of all<br />\nthe States and Territories have been invited to<br />\nattend, and they will each be accompanied by<br />\nthree special advisers.<br />\nThe Senators and Representatives of the<br />\nSixtieth Congress, the Justices of the Supreme<br />\nCourt, and the members of the Cabinet have<br />\nalso been invited to take part. The Inland<br />\nWaterways Commission, which suggested<br />\nthe conference, will be present to reply to<br />\ninquiries and make record of the proceedings.<br />\nA limited number of leading associations of<br />\nnational scope concerned with the natural<br />\nresources of this country will be invited to<br />\nsend one representative each to take part in<br />\nthe discussions.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nVirginia will be unable to send a team to<br />\nt h e University of Pennsylvania's annual<br />\nspring inter-collegiate and inter-scholastic<br />\nmeet on April 26th. We shall hold a dual<br />\nmeet on that day with the University of<br />\nNorth Carolina, and our baseball team will<br />\nhave a game here with Davidson College.<br />\nThis double attraction will no doubt draw a<br />\nlarge crowd.—College Topics, W. Va.<br />\nWHAT'S DOING AT HOPKINS.<br />\nDr. W. Max Miller, the eminent Egyptologist, of Philadelphia, delighted two large<br />\naudiences on March 17th and 18th, in McCoy<br />\nHall. A fair sprinkling of University men<br />\nwere present. Dr. Miller's learning is supplemented by a strong sense of humor, the effect<br />\nof which is heightened by his pleasant German accent.<br /><br />\nA fine set of Durand steel lockers has been<br />\nset up at Homewood. This about completes<br />\nthe appointments of the neat little field-house.<br /><br />\nFOR LUNCH<br />\nTHE MADISON, Cor. Madison<br /><br />\nand Eutaw<br /><br />\nCentral Lunch Rooms<br />\n26 souTH CHARLES STREET<br />\nWM. F. HAYWOOD, Manager<br />\n(Formerly at Y. M. C. A.)<br /><br />\nIF<br /><br />\nW<br /><br />\nY•<br /><br />\n“REFINED\"<br />\nIS THE<br /><br />\nMOST HARMLESS TOBACCO<br />\nFOR SMOKERS<br />\nBecause the intense heat, used in the toasting<br />\nor refining process, purifies tobacco and preserves the full cheering qualties of the high<br />\nclass tobaccos used for the brand,\"REFINED.\"<br />\nProdess patented July 30th, 1907<br />\nAwarded Gold rledal at the Jamestown<br />\nExposition<br />\nOn sale by dealers who cater for patronage of<br />\nsmokers who care<br /><br />\nC. &amp; P.. St. Paul 256.256<br /><br />\nMd., Courtland 1156-1157<br /><br />\nBaltimore Coupe Company<br />\nCOUPES, LANDAUS, VICTORIAS<br />\nOPEN COACHES,PHAETONS, BUSSES<br /><br />\nMain Office, - - 315 West Fayette Street<br /><br />\nARTISTIC PHOTOGRAPHS<br /><br />\nLONDON STUDIO<br />\n112 W. LEXINGTON STREET<br />\nSpecial Discount to Students<br /><br />\nP(E:<br /><br />\nCONFECTIONER AND CATERER<br /><br />\nUnion Theological Seminary<br />\n700 PARK AVENUE, NEW YORK<br /><br />\n701 West North Avenue<br /><br />\n8 A. M. TO 9 P. M.<br /><br />\nOFFICE. HOURS:<br />\nSUNDAYS, 10 A M. TO 4 1'. M.<br /><br />\nPhiladelphia Dental Parlors<br />\nScientific Dentistry at Moderate Prices<br />\n123 N. HOWARD STREET,<br /><br />\nBALTIMORE, MD.<br /><br />\nFully equipped for scholarly and practical work, in<br />\nthe midst of the Christian enterprises of a great city,<br />\nin close academic relations with Columbia and New<br />\nYork Universities, offers opportunities for the degrees<br />\nof B. D., A. M., and Ph. 1). Open on equal terms to<br />\nstudents of all Christian bodies.<br />\nSEVENTY-THIRD YEAR begins September 3oth,<br />\n1908. For Catalogue, address the President of the<br />\nFaculty, the<br />\nREV CHARLES CUTHBERT HALL, D. D.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe new field and house have already resulted<br />\nin increased interest in lacrosse among the<br />\nalumni, many of whom come out every<br />\nSaturday.<br /><br />\n11<br /><br />\n\"The Men's Store.\"<br /><br />\nHUTZLER BFOTHM<br />\n210 to 218 NORTH HOWARD ST.<br /><br />\nThe Scientific Association held its March<br />\nmeeting in the Physical Laboratory on March<br />\n19th. Professor J. S. Ames read a paper on<br />\nSome Recent Theories of Matter,\" and Mr.<br />\nW. D. Hoyt discussed \"Periodicity in the<br />\nFruiting of an Alga.\" About 150 were<br />\npresent.<br />\nThe new Archeological collection will be<br />\nopened formally on Friday evening, March<br />\n27th. Public exercises will be held in McCoy<br />\nHall. Illustrated addresses will be made by<br />\nProfessor Wilson, Dr. Robinson and Mr.<br />\nMagoffin.<br />\nPresident Remsen has been made the head<br />\nof a Board of Chemists who are to take up<br />\nproblems in connection with the enforcement<br />\nof the Pure Food and Drugs Act.<br /><br />\nOfficial<br />\nAthletic Outfitters<br />\nBALTIMORE<br /><br />\nC. &amp; P.'Phone, St. Paul 3725-M<br /><br />\nESTABLISSIRD<br /><br />\n1872<br /><br />\nGEO. GOETZ' SONS, Tailors<br />\n215 E. FAYETTE ST., 2nd Floor<br />\nQUALITY<br /><br />\nSTYLE<br /><br />\nPRICE<br /><br />\nCARL C. HOLZAPFEL<br />\nBRITECL)<br />\nMaker of MUSICAL INSTRUMENTS<br />\n(Successor to HoLzAPPAL &amp;<br /><br />\nExpert Repairer of all String Instruments<br /><br />\n306 N. HOWARD STREET<br />\nSHEET MUSIC .AND STRINGS<br /><br />\nChas. E. Smith &amp; Co.<br /><br />\n...jnortsts...<br />\n121 N. Liberty Street, Baltimore<br />\nGive us the Style and Quantity<br />\nof Printing you require and we<br />\nwill do the rest<br />\n::<br />\nADAI1S &amp; CROWLEY<br /><br />\n610 North Eutaw Street<br /><br />\nR.<br /><br />\nCHASE, HARVEY &amp; KERR<br />\n8 W. FAYETTE ST.,<br /><br />\nMd.'Phone, 371-B<br /><br />\nQ. TAYLOR (Sc<br /><br />\nCO.<br /><br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11 NORTH CHARLES STREET<br /><br />\nCOLLEGE POSTERS<br />\nare just the \"stunt\" to make your den attractive.<br />\nOur line of posters is unsurpassed in the city.<br />\nSomething new every minute. We can supply on<br />\nshort notice, special designs to suit the college. We<br />\nhave many odd subjects in pictures .<br />\n.<br />\n..<br /><br />\nHoward<br />\nSIZE 14x22<br />\nTHREE COLORS<br />\n26 CTS. EACH<br /><br />\nNovelty Company<br /><br />\n323 N. Howard Street<br />\nSTATIONERY<br /><br />\nBALTIMORE, MO.<br /><br />\nPOST-CARDS<br /><br />\nSIZE, 14x.22<br />\nTHREE COLORS<br />\n25 CTS. EACH<br /><br />\nTHE NEWS-LETTER.<br /><br />\n12<br /><br />\nPURNELL ART CO.<br /><br />\nVARSITY LACROSSE.<br />\nCome on, fellows, lets get together for the<br />\nLacrosse games. Everybody must get out<br />\nand help our team to win the championship,<br />\nand then to beat Mt. Washington, and finally<br />\nToronto.<br />\nTomorrow, Saturday the 28th, we play the<br />\nAlumni, and it isn't going to be slow either.<br />\nThe same afternoon the Freshman play the<br />\nCity College. Then on the fourth of April<br />\nthe team goes down to Annapolis. Let's get<br />\nup a big crowd to go along. There will be a<br />\nbaseball game there .the same afternoon.<br />\nApril 11th is the date of the first game at<br />\nHomewood. It will be a good sight to see<br />\nthe team come out on the field in their entirely new uniforms, to line up against the<br />\nblue and white boys from Columbia. This<br />\ngame will undoubtedly be something snappy.<br />\nColumbia has not been down here for years,<br />\nand she intends to make a particular good<br />\nshowing this time.<br /><br />\n224 North Howard Street<br /><br />\nPICTURE MERCHANTS<br />\nPictures Framed Correctly at Moderate Prices<br />\n• Once a Customer—Always a Customer<br />\nA Trial is All We Ask<br /><br />\nTHE A. RUPERTI COMPANY<br />\nBOOKBINDERS<br />\n238 PARK AVENUE<br /><br />\nC.&amp; P., St. Paul 3346<br /><br />\nWaterman's Ideal FountainPen<br />\nTHE<br /><br />\nAND THE<br /><br />\nSPOON FEED<br /><br />\nCLIP7(:,<br /><br />\n/1‘,<br /><br />\nc; A<br /><br />\nA Monumental Success<br />\nSTANDING ON A REPUTATION<br />\nOF MANY YEARS AND LOOKED<br />\nUP TO BY ALL WRITERS AS<br />\nA NECESSITY, OF PERMANENT<br />\nUSE AND SUPERIOR QUALITY.<br />\n• DEALERS THE WORLD OVER<br />\nSELL THEM<br /><br />\nSuitable for Weddings, Commencements,Banquets, Etc. Menus,Dance<br />\nPrograms, Calling Cards and Class<br />\nStationery. Our prices are right.<br />\nWorkmanship unexcelled. Sample. mailed upon request.<br /><br />\nInvitations<br /><br />\nOTT ENGRAVING COMPANY<br />\nPHILADELPHIA, PA.<br /><br />\n1021 CHESTNUT STREET<br /><br />\nREPUTATION<br /><br />\nIT'S SKILL THAT COUNTS<br />\nIn making Shirts; you want a lit, we make them fit.<br /><br />\nOur Specials 1 sSi x<br /><br />\n1e6 $9.00<br />\nirtas raans y$S1t0y5<br />\nWohlioteredShm<br />\nC<br /><br />\nFull Line Men's Furnishings<br />\nSTRATTON'S, 226 NORTH LIBERTY STREET<br /><br />\n14Liourr attb<br /><br />\nTompattp<br /><br />\n616 CHESTNUT STREET<br /><br />\nDIAMOND MERCHANTS<br />\nJEWELERS AND SILVERSMITHS<br /><br />\nMilirial 3frattruitg AntirIrr<br />\nSPECIALISTS IN<br />\nFRATERNITY BADGES<br />\nFOBS, NOVELTIES<br />\nRINGS, CHARMS<br />\nWALL-PLAQUES<br /><br />\nMEDALS<br /><br />\nPRIZES<br />\nTROPHIES<br /><br />\nCOLLEGE PINS<br />\nFOBS, SEALS<br />\nRINGS, CHARMS<br />\nWALL-PLAQUES<br /><br />\nMd.'Phone, B-300a<br /><br />\nC. &amp; P., St. Paul 3954<br /><br />\nBaltimore Book Company<br /><br />\nlit p<br /><br />\nSECOND-HAND BOOKS BOUGHT<br /><br />\n8 E. Lexington Street,<br /><br />\nBaltimore, Md.<br /><br />\nSecond-Hand School and College Text Books<br />\nBOUGHT and SOLD AT<br />\n805 N. Howard Street<br /><br />\nSMITH'S BOOK STORE9<br /><br />\nTHE ALPHA<br /><br />\nPlICITO ENGRAVING COMPANY<br /><br />\n3rd door above Madison<br /><br />\nISTEIDENT'S ElITATIONICIRT<br /><br />\nARTISTS 6.1P',1<br /><br />\n-ACE Cornef-91-MtparrM4yetz'ed29<br />\n11AL 77M0IS\"tk..;) MA R YI,A NO. .,<br /><br />\nJ.H.U. Stationery a Specialty. Menu,Banquet and Dance Cards<br />\nA.Nr 1F:.<br />\nStationer and<br /><br />\nAirr4\"<br />\n3ENGRAVERS<br /><br />\nMAKERS -4- 0r 4- PRINTING .- PLATES 4* FOR 4- ALL,<br />\nARTISTIC -4- AND 4- MERCANTILE 4- PURPOSES<br /><br />\nFOSNOT and WILLIAMS CO.<br /><br />\n()-VSTIVS<br />\nEngraver<br /><br />\n'PRINTERS<br />\n514-16 WEST FRANKLIN STREET<br /><br />\n229 NORTH CHARLES STREET<br /><br />\nTI,. flows-Letter,• product of our plant<br /><br />\nPRINTING<br /><br />\nSISCO 13R4DS.<br /><br />\nENGRAVING<br /><br />\nNUNN &amp; COMPANY<br /><br />\nFLAGS<br /><br />\nBOOKSELLERS and STATIONERS<br /><br />\n.pt<br /><br />\nBANNERS<br /><br />\n13 WEST LEXINGTON STREET,<br /><br />\n.4<br /><br />\n-<br /><br />\nBADGES<br />\nBALTIMORE, MD.<br /><br />\nCarry a complete line of School Books and College<br /><br />\nrerigrmargo-.1...muanua<br /><br />\nText Books, Miscellaneous,Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br /><br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n227 North Howard Street<br />\nSTATIONERY<br /><br />\nBINDING<br /><br />\nLet Us Handle Your<br />\nProperty<br /><br />\nILGENFRITZ STUDIO<br />\nSuccessor to Cusamiss<br /><br />\n1<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20<br /><br />\nWest Lexington Street<br /><br />\nBALTIMORE<br /><br />\nSpecial Discount to Students<br />\n...4.4.4<br />\n1<br />\n1111.1.01.10.111•••••••••••=61<br />\n,<br /><br />\nN. HESS' SONS<br />\nShoes for All Occasians<br /><br />\n$3.50 to $8.00<br /><br />\n8 Baltimore Street, East of Charles<br /><br />\nWe buy, sell, build, and loan money<br />\non real estate. If you want a house<br />\nor business location in any part of the<br />\ncity or suburbs, we will supply your<br />\nwants. Small payment down and<br />\neasy terms. Call or write for full<br />\nparticulurs .<br /><br />\nPIPPEN'S BOOK STORE<br />\n605 NORTH EUTAW ST.,<br />\nNear the University<br /><br />\nAGENTS FOR<br /><br />\n18 and 20 E. Baltimore St., Baltimore. Md.<br /><br />\nEvergreen Lawn<br /><br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold sad Eashaspd<br />\nBALTIflORIS'S LARGEST OLD DOOR STORE<br />\n••••••••••<br /><br />\nChocolates<br /><br />\nBonbons<br /><br />\nBaltimore's Prettiest and Most Up-to-date Suburb<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br /><br />\nHamilton Ave. and Hartford Road<br /><br />\nCABIN PASSAGE AT LOW RATES<br />\nNew York to Bremen, London<br />\nParis, Gibraltar, Naples, Genoa,etc.<br /><br />\nCITY and SUBURBAN REALTY CO.<br />\n305 and 307 Calvert Building<br /><br />\nBaltimore<br /><br />\nto<br /><br />\nBremen<br /><br />\nDirect<br /><br />\nFor Particulars apply to A.SCHUMACHER &amp; CO.<br />\nGeneral Agents, 7 South Gay Street<br /><br />\nWhen making your purchases, kindly remember our advertisers<br /><br />\nLEMMER'r<br /><br />\nrg.<br /><br />\nBAurimORE<br />\nYOU CANNOT SAY YOU HAVE WORN GOOD<br />\nCLOTHES UNTIL YOU TRY OURS.<br /><br />\nDON'T THINK OUR CLOTHES HIGH UNTIL<br />\nYOU SEE WHAT WE OFFER AT $25<br />\nMADE TO ORDER.<br /><br />\nOUR READY-TO-WEAR (LEMMERT - OWNMAKE)CLOTHES RANGE FROM $18 UP.<br /><br />\nHands off cheap gloves<br />\nif you want well-gloved<br />\nhands. Hand ott<br /><br />\nFOWNES<br />\nGLOVES<br /><br />\nTRY THIS DEPARTMENT ON YOUR NEXT SUIT.<br /><br />\n10 E. FAYETTE STREET<br />\nI-1. IPETT\"JPIN<br />\nManufacturer of<br /><br />\nGreek Letter Fraternity Jewelery<br />\n218 NORTH LIBERTY STREET<br />\nPlease call and examine our line before purchasing<br /><br />\nDo you like stylish Clothes? If so,<br />\nwhy not place your next order with<br /><br />\nFRITZ &amp; BIEREN<br />\n4 W. SARATOGA ST., at Charles<br /><br />\nInsist upon Getting<br /><br />\nWe are tailors of experience and know<br />\nhow to make stylish Clothes<br /><br />\nThis Red Woven Label<br /><br />\nSuits and Overcoats, - $20.00 Up<br /><br />\nCOTRELL &amp; LEONARD<br />\nALBANY, N. Y.<br /><br />\n1-<br /><br />\n1<br /><br />\nMADE FOlk,Thits<br />\n'<br /><br />\n- B.V. Dd<br />\nBEST RETAIL TRADE<br />\n.<br />\n,<br />\nOn Your<br /><br />\nMAKERS OP<br /><br />\nCAPS and<br />\nCOWNS<br /><br />\nCoat Cut Undershirts<br />\nand<br /><br />\nTo the American Colleges and<br />\nUniversities<br /><br />\nClass Contracts a Specialty<br /><br />\nCorrect Hoods for Degrees<br /><br />\nJirtistic 6ifts ••<br />\nWe offer the best in China, Glass, Art<br />\nPottery. Fine Color Prints, perfectly<br />\nframed, Smart Leather and Brass<br />\nNovelties.<br /><br />\nKnee Length Drawers<br />\nIt means Satisfaction and Comfort to You<br />\nACCEPT NO IMITATIONS<br /><br />\nErlanger Bros., New York<br /><br />\nLYCETT STATIONERS<br />\n317 NORTH CHARLES STREET<br /><br />\nWhen making your purchases, kindly remember our advertiseno<br /><br />"}], "field_media_file": [{"target_id": 36389, "display": null, "description": null, "target_type": "file", "target_uuid": "5d8809a9-cb24-412a-954a-e6732143abbb", "url": "http://digital.library.jhu.edu/system/files/2022-03/12354-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12354, "target_type": "node", "target_uuid": "fc961924-2b59-40f1-97bc-2aa24d9aecef", "url": "/node/12354"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "68ef77b7-e939-47b6-b1cb-99bba6cf62bd"}]}