{"mid": [{"value": 36951}], "uuid": [{"value": "266ffdff-426b-4c2f-b241-4e11b7f98956"}], "vid": [{"value": 36951}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13110-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "I.<br />\n<br />\nVOL. XXVIII, No 38<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br />\n<br />\nFRANK R. KENT DISCUSSES JOHNS HOPKINS TANKMEN SPRING SEASON TICKET CAMDEFEAT LEHIGH IN<br />\nPAIGN OPENS NEXT<br />\nPOLITICS AT THURSDAY<br />\nCLOSE CONTEST<br />\nMONDAY MORNING<br />\nASSEMBLY<br />\nPolitical Writer from the Sun Gives Three Hopkins Records Shattered and Each Student Expected to Sell Two<br />\nFourth Equaled. Welch and<br />\nTickets in Order to Insure<br />\nOutline of Present Day Problems.<br />\nBahlke Star<br />\nSuccess<br />\nBewails Indifference of Voters<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBOOTH BREAKS TWO-MILE INDOOR MARK AT<br />\nI. C. A. A. A. A. GAMES LAST SATURDAY<br />\nNIGHT IN NEW YORK<br />\nClips 3-10 Seconds from Former Record Held by McLane<br />\n<br />\nHopkins victory over Lehigh<br />\nTwo tickets per man is the quota<br />\nPennsylvania Wins Meet. Hopkins in Ninth Place. Clarke and Proctor<br />\nFriday night at the Baltimore that has been fixed for the Spring<br />\nPlace in 70 Yard Dash and High Jump<br />\nAthletic . Club was greatly due to Season Ticket Campaign which is<br />\nNew York, March 1.—Hopkins athletes entered in the I. C. A. A.<br />\nthe excellent swimming of Bob<br />\nto start next Monday morning. A. A. Indoor Championships held here tonight added new laurels to<br />\nWelch. The Homewood natator<br />\ntheir long string when Verne Booth annexed another record when<br />\nstarting behind Travis, his oppo- This quota was fixed by the Ath- he broke the indoor two-mile intercollegiate record, when Clarke<br />\nnent, succeeded in passing him letic Office from which has been is- gained a place in the seventy-yard dash, and when Proctor tied for<br />\nand winning the relay and also sued a statement that $6,000 must second in the running high jump. These three men composed the<br />\nthe meet for the Black and Blue. be realized from this campaign in entire Black and Blue entry and accounted for 7 1-9 points.<br />\nFor at the beginning of this race order to insure a successful spring<br />\nBooth, already I. C. A. A. A. A.<br />\nthe score was 33 to 29 in HopTEAM<br />\nINCLUDES outdoor two-mile champion, and<br />\nseason.<br />\nThe campaign will be TENNIS<br />\nkins' favor, the relay deciding<br />\ncross country champion, annexed<br />\nNAVY ON SCHEDULE<br />\nwhich way the victory would managed as in former years; the<br />\nindoor title when. he defeated<br />\nthe<br />\nPart of the Johns Hopkins tenrest. Incidentally, the record for fraternities and groups of non-fravarious candidates.<br />\nElmer<br />\nMcLane, Pennsylvania, fornis schedule has been released. It<br />\nthe 160-yard distance, made in ternity men forming teams for the<br />\nHarding's<br />\nmer<br />\nMr.<br />\ntitle<br />\nholder. Booth's time of<br />\nafter<br />\nthat<br />\nsaid<br />\nHe<br />\nis a certainty that the Black and<br />\n1920, was equalled, when the team sale of the tickets. As in former<br />\nRethe<br />\nfor<br />\n9<br />\nminutes<br />\nand 36 seconds clipped<br />\ncandidates<br />\ndeath many<br />\nBlue netmen will meet the Naval<br />\nthrough the water in one years a cup is to be offered to the<br />\ntraveled<br />\nall<br />\napeared<br />\n3<br />\n3-10<br />\nseconds<br />\nfrom the previous<br />\nnomination<br />\npublican<br />\nAcademy, Georgetown, University<br />\nwinning team and a handsome<br />\nminute,<br />\n22<br />\n4-5<br />\nseconds.<br />\nover the country. Mr. -Coolidge,<br />\nof Maryland, Baltimore Country record held by McLane. Booth<br />\nThe meet resulted in the shat- prize to the individual high saleshowever, soon proved himself an<br />\nClub, and the Easton Country let McLane set the pace content<br />\ntering of three Hopkins' records. man.<br />\nastute politician and gradually<br />\nClub. Negotiations riow being car- to trail until the last quarter mile,<br />\nSpring Schedules Complete<br />\neliminated his opponents-from the Welch lowered by two-fifths of a<br />\nried on will probably result in when he forged ahead. Helme of<br />\nThe spring sports schedule, to<br />\nrace. He retained the entire Har- second, Rowland's mark of 19 3-5<br />\nmatches with Loyola and Dela- Georgetown finished strong and<br />\nseconds<br />\nmade<br />\nin<br />\nwhen<br />\nhe<br />\n1920,<br />\nall<br />\ngames of which the season ticknosed out McLane for the place<br />\nding cabinet and further strengthware.<br />\nposition. Lermond, Boston Colened his position by appointing sped through the water in 19 1-5 ets are to admit holders, is one of<br />\nThe schedule to date is:<br />\nlege,<br />\nfinished fourth, followed by<br />\nMr. Bascom Slemp, a political seconds. Welch lowered his own the most brilliant spring cards ever<br />\nEaston Country Club, away,<br />\nPayne of Colby.<br />\nPower in the Republican Party, to record, which he established last offered at Homewood. The base- April 19.<br />\nserve as his personal secretary. It year, when he swam the 100 yards ball team is carded to play eleven<br />\nClarke Gets Fifth<br />\nGeorgetown University, away,<br />\nsoon became clear that \"Cal\" was free style in the good time of 58 (Tames at home and the lacrosse May 1.<br />\nLouis<br />\nClarke,<br />\nwho last Satura \"sure bet.\" Hiram Johnson seconds flat. This knocked off team will meet seven rivals in inUniversity of Maryland, home, day night broke the world's inalone remained and his campaign three-fifths of a second from his teresting contests. The track team May 3.<br />\ndoor mark for the 100 in 9 4-5 sechas scheduled but one meet at<br />\nWas not considered dangerous. former record.<br />\nBaltimore Country Club, away,<br />\nHomewood<br />\nso<br />\nfar,<br />\nbut<br />\nit<br />\nis<br />\nonds could only gain fifth place<br />\nhoped<br />\nThe<br />\nthird<br />\nevening<br />\nrecord<br />\nof<br />\nthe<br />\nCountry Normally Republican<br />\nMay 10.<br />\nthat<br />\nmore<br />\ncan<br />\nbe<br />\narranged<br />\nbefore<br />\nwas<br />\nbroken<br />\nby<br />\nGeorge<br />\nBahlke,<br />\nUnder normal conditions the<br />\nU. S. Naval Academy, away, in the 70-yard dash. After winthe opening of the season. There<br />\nthe<br />\nlanky<br />\nfreshman,<br />\nwhen<br />\nhe<br />\nif<br />\na<br />\nning both his first and semi-final<br />\nand<br />\nRepublican,<br />\nis<br />\ncountry<br />\nMay 21.<br />\nis a double header staged for nearly<br />\nswam<br />\nminthe<br />\n220-yard<br />\nrace<br />\nin<br />\n2<br />\nparty,<br />\nthat<br />\nin<br />\noccur<br />\nSplit does not<br />\nAs the available material is un- heats, Clarke succumbed to Bowthe Democratic candidate is not utes, 34 1-5 seconds, clipping sev- every Saturday afternoon from the usually fine the prospects are man, Syracuse; Comins, Yale; Fifirst of April until the twentylikely to win. The Teapot Dome en and one-fifth seconds from<br />\nbright for a most successful sea- terman, Williams, and Bugby,<br />\nfourth of May.<br />\naffair, however, prevents Coolidge Coady's old mark.<br />\nson.<br />\nJean Hoffmeister, captain of Dartmouth, in the finals. BowThe division of the student<br />\nBahlke, likewise, swam second<br />\nfrom being the certainty he was a<br />\nthe<br />\ntennis team, is much pleased<br />\nfew months ago. Mr. Coolidge, to Welch in the 100-yard dash body into fraternity and group with the outlook. George Hebner, man won by about a yard and a<br />\nalthough not connected personally and was first man on victorious teams for the sale of the season '27, junior state champion of half and the rest of the field were<br />\ntickets was found to be quite satiswith the scandal, will suffer from relay.<br />\nMaryland, will form a brilliant ad- bunched together so that many<br />\nthe notoriety his party gained<br />\nHopkins' swimmers succeeded factory in the two previous cam- dition to the Hopkins racqueters. felt that the actual outcome was<br />\nthrough the oil investigation. On in grabbing five out of the eight paigns. One man from each team Burlinghof, a third year medical different. Bowman's time of 7 2the other hand, while the Demo- competitions, but Lehigh besides is to be its captain to keep it or- student who played in several<br />\n10 seconds, is 1-10 of a second<br />\ncrats have been given an opening, placing first in the other three, ganized. The list of team mem- matches last year, is expected to<br />\nbers<br />\nwill<br />\nbe<br />\nposted<br />\non<br />\nbulletin<br />\nslower<br />\nthe<br />\nthan the intercollegiate<br />\nthey have been deprived of their<br />\nContinued on page 2, col. 4<br />\njoin the Black and Blue ranks.<br />\nboards<br />\nat<br />\nHomewood<br />\nin<br />\nthe<br />\nnear<br />\nrecord<br />\nset up last year by<br />\nMr.<br />\nfor<br />\ncandidate,<br />\npromising<br />\nInost<br />\nOthers who have displayed skill<br />\nfuture.<br />\nThe<br />\ncup<br />\nto<br />\nbe<br />\npresented<br />\nsplashed<br />\nbeen<br />\nalso<br />\nMcAdoo \"has<br />\nCONCERT TO BE GIVEN ON<br />\nin tennis are Stulman, Wasser- \"Boots\" Lever, Pennsylvania.<br />\nto the winning team is a large silWith the oil.\"<br />\nMARCH 13 AT ST.<br />\nman, and Kaulfholz.<br />\nFlahive, Boston College, repeatver trophy. The prize for the inMARK'S CHURCH<br />\nThird Party Present<br />\nCaptain Hoffmeister stated ed his performance at the Johns<br />\ndividual having the greatest sales<br />\nthat candidates would be called<br />\nThe Musical Club will present<br />\nWhat promises to make the<br />\nis expected to be very elaborate, alHopkins-Fifth Regiment games,<br />\nout and practice resumed as soon<br />\ncoming election one of the most its next concert on the night of though it has not<br />\nbeen selected yet.<br />\nwhen he won the high jump with<br />\nas the courts are ready.<br />\ninteresting in American history is Thursday, March 13, at the St.<br />\nCampaign<br />\nCloses<br />\nMarch<br />\n24<br />\na<br />\nleap of 6 feet, 1-8 of an inch.<br />\nthe possibility of Senator La Fol- Mark's M. E. Church. The affair<br />\nThe<br />\ncampaign<br />\nwill<br />\nlast<br />\nfor<br />\ntwo<br />\nHOPKINS TO HOLD FOOT- Nine men, including Proctor,<br />\nlette entering the campaign as a is under the auspices of the Ladies<br />\nweeks, beginning March tenth and<br />\nHopkins, tied for second at the<br />\nBALL TOURNAMENT<br />\nthird party nominee. La Follette Aid Society of the church.<br />\nending March twenty-fourth. In<br />\nIS an extreme progressive. He is<br />\nAlthough the big Home ConHomewood Field will be the height of 5 feet 10 inches. The<br />\nth e leader of a small bloc of pro- cert has been successfully given, that period it is expected that some scene of a novel event sometime pole vault record of 12 feet, 6<br />\ngressives in the House and in the the activities of the club have not undergraduate will call on each during the spring when a \"foot- inches, made last year by Owen<br />\nSenate, and thus occupies a domi- abated and a full schedule is in Hopkins alumnus in Baltimore or ball tournament\" is staged there and Sherrill of Pennsylvania, was<br />\nin the vicinity of Baltimore in an<br />\nnant position.<br />\nview for the remainder of the seaunder the auspices of the J. H. U. tied this year by Owen, Schollp,<br />\nattempt<br />\nto<br />\nsell<br />\nhim<br />\na<br />\nticket.<br />\nA<br />\nlist<br />\nAthletic Association. The tour- Yale, and Libby, Dartmouth.<br />\nMr. Coolidge is a real conserva- son. A trip to Delaware College<br />\nof<br />\nalumni<br />\nwill<br />\nbe<br />\navailable<br />\nto<br />\nthe<br />\nnament is limited to students of Sherrill was in a tie for fourth<br />\ntive. The elimination of McAdoo has been tentatively arranged, but<br />\nstudents at any time so that they<br />\nhigh and preparatory schools and place.<br />\nleaves only conservatives eligible is not yet definitely decided upon.<br />\ncan learn of some alumnus upon is<br />\nfor the Democratic ticket. If both Also a concert at the Western<br />\nintended to bring more school<br />\nGeorgetown Wins 2-Mile Relay<br />\nwhom to call.<br />\nconare<br />\nof<br />\nHigh<br />\nbenefit<br />\ncandidates<br />\nSchool,<br />\nfor<br />\nthe<br />\nboys<br />\nparty<br />\nout<br />\nto<br />\nlarge<br />\nHomewood.<br />\nthe<br />\nThe<br />\nThe most exciting race of the<br />\nThe price of the tickets will be<br />\nforms of competition for the con- evening was the two-mile relay.<br />\nservatives, La Follette is apt to that institution's scholarship fund,<br />\ncarry four states, and perhaps as is contemplated. The club, spurred the same as last year, $5 for regular test will be kicking and forward Brooks, Georgetown's first runrnany as .six or seven. Thus, if the on by the success of this season, tickets and $2 for prep school men. passing footballs. All regulation ner, gave Gegan a lead of about<br />\nbemocrats carry the \"Solid wishes to extend its reputation<br />\nmodes of kicking are to be used to ten yards. Geg,an maintained his<br />\nSouth,\" no candidate is likely to further afield, and it is rumored<br />\ndetermine the most educated toe lead until the third lap when he<br />\nget the necessary two hundred that the first step in this direction<br />\namong the contestants.<br />\ndropped his baton and stumbled.<br />\nIMPORTANT NOTICE<br />\nThe officials of the tournament Holden received the baton in<br />\nand twenty-six votes in the elec- will be a trip to Richmond in the<br />\nDean Ames' Office Hours<br />\ntoral college. In that case the con- spring.<br />\nare to be selected from among a iourth place, fifty yards behind the<br />\nBanquet Planned<br />\ntest will go to the House of RepMonday, Wednesday<br />\ngroup of men who have shown a foremost runner. When Marsters,<br />\nAnother innovation is planned,<br />\nresentatives for a vote by state.<br />\ngreat interest in Hopkins football. Georgetown's great half-miler, re12.30-1.00<br />\nMaryland is represented in the in the form of a larger annual banThe prizes, according to Mr. ceived the baton from Holden, he<br />\nRouse by three Republicans and quet. Formerly, banquets were<br />\nFriday, Saturday<br />\nKeyes, will be a good inducement was thirty yards to the -fear. He<br />\nthree Democrats and hence would held at the Barn, but this year, if<br />\nfor a large number of competitors. sprinted to the front and in the<br />\n9.00-10.00<br />\nnot have a vote. Seven other the proceeds from the remaining<br />\nThe best all-round man is to re- last lap opened up to win by 20<br />\nThe Dean will not see stustates are similarly deadlocked. concerts are good, the affair will<br />\nceive a gold watch; the other yards over Bernart, Cornell. Bosdents at any other hours than<br />\nThus, though Senator La Follette be held at some hotel. At this<br />\nwinners to receive medals. The ton College finished third. The<br />\nthese.<br />\ncould not be elected, he could dic- time, according to custom, officers<br />\ndate for this event will be deter- time was within two seconds of<br />\nfor the next year will be elected.<br />\nContinued on page 2 col. 5<br />\nmined in the near future.<br />\nContinued on page 3, col. 3.<br />\n\"Two months ago, no candidate<br />\nfor the coming presidential election was 'sitting prettier' than<br />\nPresident Coolidge, and then the<br />\nlid blew off Teapot Dome,\" said<br />\nMr. Frank R. Kent, political writer of the Baltimore Sun, in his address at the Assembly last Thursday. Mr. Kent spoke upon the<br />\ncorning campaign and estimated<br />\nthe possibilities for Success of the<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, MARCH 4,1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nMaybe So<br />\nOflate we have become conscience-stricken over our great<br />\nwaste of space on inconsequential<br />\nmatter and the astounding importance of a writer in the Baltimore<br />\nNews has added to our feeling of<br />\nunworthiness. Where as we offer<br />\nour readers nothing, which they receive with appropriate gratitude,<br />\nthis author answers the riddle of<br />\nthe centuries and in a single column reveals \"What Should be a<br />\nMan's Object in Life.\"<br />\n* * *<br />\n<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME,'25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mana ger<br />\nA. J. McKAY,'26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON,'24<br />\nC. EUGENE TOVELL,'24<br />\nIII, '26<br />\nOTHO J<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br />\n<br />\nA COLLEGE TOWN<br />\nHopkins and Hopkins' activities have more friends now than ever<br />\nbefore. The Maryland football game, notable track successes and<br />\nother things have succeeded in transforming many citizens from<br />\nmere Baltimoreans to actual Hopkinsites. Hopkins does not yet<br />\nmean as much to Baltimore as Harvard means to Boston or the<br />\nUniversity of Pennsylvania means to Philadelphia. The inhabitants<br />\nof the Monumental City, however, are beginning to realize that they<br />\nhave a great University in their midst.<br />\nHopkins must soon capitalize on this realization. The end of<br />\nthis month marks the opening of the spring sport schedule. In order to carry out this schedule and to pay the guarantees it will necessitate, the athletic authorities must dispose of a large number of<br />\nseason tickets. The plan of campaign will be practically the same<br />\nas last year. The students will be formed into teams, competition<br />\nwill be held, and valuable prizes will be awarded to the group and<br />\nthe individual with the largest number of sales. This spring, however, the salesmen will have a more interested and more sympathetic<br />\ncitizenry to deal with.<br />\nOur track team is famous throughout the country; lacrosse has<br />\ngrown in popularity by leaps and bounds; the nine promises to be the<br />\nbest in years; the citizens of Baltimore are interested. Success depends solely upon the efforts of the undergraduates and there is no<br />\nexcuse for failure.<br />\n<br />\nTHE FUTILITY OF UNDERGRADUATE ACTIVITIES<br />\n<br />\nThe recent more or less lamented<br />\nBowery Ball called forth the following:<br />\nP. Sachs discovered the secret of<br />\nthe prevalent joy: \"Everybody felt<br />\nat home.\"<br />\nT. Whiteley, the demon contrib.,<br />\nsuggests that another Brewery Ball<br />\nbe held in the near future.<br />\n<br />\nSTETS01•0cP<br />\n<br />\nHats<br />\n<br />\n* * *<br />\nWith that familiar helping spirit<br />\nII. Goodwin, as a hint to the policy<br />\nof this column, quotes:<br />\nThe World is too much with us.<br />\n* *<br />\nThis business of long-range argument via quotation is too easy.<br />\nFor example we might reply:<br />\nThe World is so full of a number of things. . . . And we might<br />\nadd one of the good things, such<br />\nas the following excerpt from Mr.<br />\nBroun's column of February 16:<br />\nWe find much shrewd observation on modern tendencies in our schools in a book<br />\ncalled<br />\nMoves<br />\n\"Education<br />\nAhead,\" by Eugene Randolph<br />\nSmith.<br />\n\"Pupils who are continually marked,\" writes Mr. Smith,<br />\n\"soon become self-conscious<br />\nand calculating. They say not<br />\nwhat springs naturally from<br />\ntheir own experiences and<br />\nideas but what seems likely<br />\nto obtain a good mark. They<br />\nquite naturally and wisely play<br />\nupon the idiosyncracies of<br />\nthe teacher, quoting her book<br />\nif she has written one, her<br />\nfavorite authority if she<br />\nhasn't. There is a certain<br />\nstimulus to hypocrisy in such<br />\ndealings, a tendency toward<br />\nintellectual dishonesty that it<br />\nis unfortunate to encourage.<br />\nThere is also of necessity an<br />\nemphasis on the gap between<br />\npupils and teachers, on a kind<br />\nof rivalry that sometimes becomes antagonism. The pupil<br />\nbecomes a salesman. He sells<br />\nto the teacher as little knowledge as possible for as high a<br />\nmark as he can get.\"<br />\n<br />\nChristopher Morely is the latest to declare that undergraduate acAs a matter of fact, Mr. Goodtivities are useless. In an interview accorded a representative of the<br />\nwin,<br />\nstatistics prove that the maYale \"Daily News,\" the famous columnist and author. is reported as<br />\njority<br />\nof the quotations found in<br />\ndeclaring that the training to be derived from college publications<br />\nMaybe So are from Time and not<br />\nand the time spent in acquiring this training is not worth the effort. the New York World.<br />\n* * *<br />\nWe shall not attempt to refute these statements; that would be<br />\nThe Black and Blue Jay Staff<br />\npresumptuous. We will merely cite one of his points. Mr. Morely<br />\nare to wear little tokens<br />\nmembers<br />\nrelates that, while at Oxford, he went out for rowing but soon found<br />\ntheir<br />\nof<br />\ndignity on their watch<br />\nthat three hours spent every afternoon were not giving him what he<br />\nchains. The campus idiot suggests<br />\nwanted. After recovering from an illness he refused to row any that the NEWS-LETTER news hawks<br />\nmore and set out to do what he had come to college for; to make follow suit, using a hangman's<br />\nfriendships and th.us to get the most out of life. He believes that Noose on a scarlet Letter as the derowing prevented him then and that, now, college publications and sign. Connotations explained on<br />\nother undergraduate activities tend to prevent the average student request.<br />\nAlso the campus idiot wants to<br />\nor editor from so doing.<br />\nknow why Frank Kent, who spoke<br />\nWe wonder how many of the men that have engaged in Hop- on politics at last Thursday's askins activities will agree that their participation has prevented them sembly, didn't make his speech<br />\nbefore the Interfraternity Board.<br />\nfrom making friends.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nStyle and Ruality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED<br />\n<br />\nFOIL YOUNG<br />\n<br />\nM EN,<br />\n<br />\nJOHNS HOPKINS TANKMEN DEFEAT FRANK R. KENT ADDRESSES<br />\nLEHIGH<br />\nASSEMBLY<br />\nContinued from page 1<br />\nContinued from page 1<br />\n<br />\nsucceeded in winning a number<br />\nof seconds and thirds which kept<br />\nthe victory in doubt until the final<br />\nrelay.<br />\nRaleigh was the greatest point<br />\nwinner for Lehigh. He placed<br />\nfirst in the backstroke and second<br />\nin the 40-yard dash. Astarti was<br />\nby far the best in the.fancy diving.<br />\nRidge Howard had no trouble<br />\nin winning the plunge, with Hambleton, another Blue Jay, in second place.<br />\nWith Welch's lowering of Rowland's record for the 40-yard dash<br />\nand the 160-yard relay mark<br />\nequaled; Bahlke lowering Coady's<br />\nold record by over seven seconds,<br />\nthe Johns Hopkins present undergraduates might well be proud,<br />\nfor the members of this team have<br />\nlowered or equalled every Hopkins swimming mark with the exception of the 200-yard relay,<br />\nwhich record was established last<br />\nyear, by Coady, Lord, Buhrer and<br />\nWelch. Two of these men, Welch<br />\nand Lord, being on the team this<br />\nyear.<br />\nThe Black and Blue has now<br />\nwon three of the five dual meets<br />\nthis year, winning from Catholic<br />\nUniversity, Swarthmore and Lehigh, and losing to Brown and<br />\nRutgers.<br />\nSummary:<br />\n160-Yard Relay Race—Won by Hopkins<br />\n(Bahlke, Dunning, Lord and Welch);<br />\nsecond, Lehigh (Raleigh, Freeman,<br />\nPilot and Travis). Time, 1.22 4-5.<br />\nFancy Diving—Won by Astarti, Lehigh;<br />\nsecond, Childs, Lehigh; third, Stone,<br />\nHopkins.<br />\n40-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Raleigh, Lehigh; third. Travis, Lehigh. Time,<br />\n19 1-5 seconds.<br />\nPlunge for Distance—Won by Howard,<br />\nHopkins; second, Hambleton, Hopkins ; third, DeLong, Lehigh. Time,<br />\n22 2-5 seconds. Distance, 60 feet.<br />\n220-Yard Swim, Free Style—Won by<br />\nBahlke, Hopkins; second, Reed, Lehigh; third, Stone, Hopkins. Time,<br />\n2 minutes, 34 1-5 seconds.<br />\n100-Yard Breast Stroke—Won by Pilot,<br />\nLehigh; second, Swanson, Hopkins;<br />\nthird, Freeman, Lehigh. Time, 1<br />\nminute, 21 3-5 seconds.<br />\n100-Yard Back Stroke—Won by Raleigh,<br />\nLehigh: second, McCleary, Hopkins ; third, Richards, Lehigh. Time,<br />\n1 minute, 18 3-5 seconds.<br />\n100-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Bahlke,<br />\nHopkins; third, Travis, Lehigh.<br />\nTime, 58 seconds flat.<br />\n<br />\ntate who would be the winner.<br />\nFew Actually Vote<br />\n<br />\nMr. Kent then gave some startling statistics concerning the<br />\nlarge number of non-voters in the<br />\nnation. In 1920, out of fifty-five<br />\nmillion persons qualified to vote,<br />\nonly twenty-six million went to<br />\nthe polls. \"The slogan, 'The people rule,' is a joke,\" he said, \"for<br />\nthe last President was elected by<br />\na majority of a minority.\" The<br />\nspeaker concluded by stating that<br />\nthe man who does not use his ballot is as much to blame for any<br />\ngovernmental corruptness as the<br />\ncrooked politician.<br />\nBefore Mr. Kent's talk, Mr. Norwood had charge of the Assembly.<br />\nThe chief announcement was the<br />\nregistering of Sergeant Frank's<br />\nprotest against snowballing the<br />\ndormitory windows. Other announcements of student affairs for<br />\nthe week were made.<br />\n<br />\nt hair is a<br />\n'<br />\nNeatly combed, ivell-‘p<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br />\nTubes-35c Jars-75c<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories,Inc.<br />\n750 Stanford Avenue Los Angeles, California<br />\nSend coupon for Free Trial Tube.<br />\n••••••••1<br />\n<br />\n0.1.1••<br />\n<br />\n11•1<br />\n<br />\nLABORATORIES.Inc.<br />\n<br />\nSTANDARD<br />\n760 Stanford<br />\nPlease send me free trial tube.<br />\nName<br />\nAddress<br />\n<br />\nMilt. I<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, MARCH 4, 1924<br />\n<br />\n3<br />\n<br />\nDR.<br />\nLAWRENCE<br />\nHENRY graduate—he led his class every<br />\nBAKER TO ENTER JOURyear except in 1915, when, as a<br />\nNALISM IN JUNE<br />\nsophomore, he ranked third. In<br />\nGreek Instructor to Devote Entire Time 1917, Dr. Baker received his A. B.<br />\nto Journalistic Work. Was Brildegree and continued his studies<br />\nliant Student<br />\nas Hopkins Scholar the following<br />\nDr. Lawrence H. Baker, instrucDamon—<br />\nyear. He was reappointed Hop\"What did Professor Smith mean<br />\ntor<br />\nin Greek, will sever a connecthis morning when he told you<br />\nkins<br />\nScholar in 1918, became Felthat no man could ever make a<br />\ntion of eleven years' standing with<br />\nsilk purse out of a sow's ear?\"<br />\nlow in Greek in 1919, and took his<br />\nthe Johns Hopkins University when<br />\nPythias—<br />\nPh. D. in 1920. In 1920 he was<br />\n\"He meant that I'd never be able<br />\nhe enters journalism at the concluto do good work with a poor pencil.<br />\nappointed<br />\nWhen you have tried Williams Shaving Cream your<br />\ninstructor in Greek, in<br />\nGuess I'll have to get a Dixon's<br />\nsion of this semester.<br />\nEldorado. Old Smity says it's the<br />\nverdict<br />\nwill be as favorable as is your verdict about the<br />\nwhich<br />\npost<br />\nhas<br />\nhe<br />\nserved till the<br />\nbest drawing pencil made.\"<br />\nnew Hinge-Cap. The heavier, faster-working Williams<br />\nDr. Baker has been doing jour- present itme. Dr. Baker<br />\nhas at<br />\nlather, the fact that Williams lubricates the skin, the fine<br />\nnalistic work in various periodicals times during<br />\nDIXONS<br />\nthe past four years<br />\ncondition of your face after the shave, these qualities<br />\nand daily papers for several years been<br />\nconnected with the English<br />\nmake men stick to Williams as faithfully as the Hingeal)<br />\nAD<br />\nat the same time carrying on his Department.<br />\nCap sticks to the tube. As regards the Hinge-Cap, here<br />\nteaching, and he has now decided to<br />\n\"the mastereiraw&s,pencil\"<br />\nis an offer we make:<br />\n17 leads—all dealers<br />\ncontinue solely with his writing.<br />\nBOOTH BREAKS TWO MILE INs250 in Prizes<br />\n\"The chief reason for my abanDOOR MARK<br />\near the best sentence of ten words or less on the value of the<br />\ndoning university work,\" Dr. Baker<br />\nWilliams Hinge-Cap,we offer the following prizes: 1st prize $100;<br />\nContinued from page 1<br />\n2nd prize $50;two 3rd prizes,$25 each; two 4th prizes,$10 each;<br />\nsaid, \"is that I wish to get into a the world's record and Marsters'<br />\nsix 5th prizes, $5 each. Any undergraduate or graduate student<br />\nZEF&_F'<br />\nffffEig<br />\ngZEITZEFI<br />\nrEZTIf two or more persons submit identical slogans<br />\nIs eligible,<br />\ncalling which offers greater oppor- time of 1.55 was within<br />\ndeemed worthy of prizes, the full amount of the prize will be<br />\na second<br />\nawarded to each. Contest closes at midnight March 14, 1924.<br />\ntunities for the utilization of my lit- of the indoor half-mile mark.<br />\nWinners will be announced as soon thereafter as possible. Submit any number of slogans but write on one side of paper only,<br />\nputting name, address, college and class at top of each sheet.<br />\nerary powers. I want something less<br />\nHills and Gates Break Records<br />\nAddress letters to Contest Editor, TheJ.B. Williams Co.,Glastonbury, Conn.<br />\nconfining and less restraining than<br />\nHills of Princeton broke his<br />\nteaching.<br />\nown indoor record for the 16 lb.<br />\nCLOTHIERS<br />\nWriting Circumscribed<br />\nshotput with a heave of 46 feet.<br />\n\"It is quite true that in profes- 3-4 of an inch. Beattie, a teamHABERDASHERS<br />\nsorial work one has certain chances mate was second and Plansky of<br />\nfor writing, but here the writing Georgetown was third.<br />\nGates,<br />\nThe new Hinge-Cap on<br />\n315 Charles St. North<br />\nthat one does_ is considerably cir- Princeton, this afternoon won the<br />\ncumscribed by the demands of the —5-1b. weight throw with a heave<br />\nIWIFIF131P<br />\nvarious technical journals. In these cf over forty-nine feet. Hills finit is the digging into the sediment, ished in third position.<br />\nSPARE TIME POSITIONS<br />\nsilt and filth of bygone ages and<br />\nThe meet was won by PennsylFOR STUDENTS<br />\nmusty tomes which counts for vania, last year's winners with a<br />\nGreatest opportunity, \"Life of everything, whereas the power to total of 21 1-3 points. Yale and<br />\nwill lecture on 'Bird Banding at<br />\nYoung Rhees, the student in<br />\nWoodrow Wilson\" by Josephus write interestingly is more of a dis- Princeton tied for second honors<br />\nITomewood.\"<br />\nquestion,<br />\naccording to press recredit<br />\nthan<br />\nan<br />\nadvantage.<br />\nwith 20 points. Georgetown was<br />\nDaniels, Secretary Navy, AssociaThe<br />\nmeeting<br />\nwill<br />\ntake<br />\nplace<br />\ntoports,<br />\nwas<br />\n\"ousted\" because his<br />\n\"Then,<br />\ntoo,<br />\nmy<br />\nposition<br />\nas a fourth and Penn State fifth. Hopte of Former President. Big book<br />\nmorrow<br />\nat<br />\nP.<br />\n3<br />\nM.<br />\nin<br />\nRoom<br />\n112,<br />\n\"advanced<br />\nideas\"<br />\ndid not meet with<br />\nteacher<br />\nof<br />\nGreek<br />\nis<br />\nsomewhat dif- kins with 7 1-9 points finished in<br />\nhandsomely illustrated, low price.<br />\nGilman<br />\nHall.<br />\nThe<br />\nlocal<br />\nnaturalists'<br />\nthe<br />\napproval<br />\nof<br />\nProfessor<br />\nForbes,<br />\nferent<br />\nfrom<br />\nthat<br />\nof<br />\nmost other in- ninth position, followed by SyraBest terms to representatives.<br />\nclub<br />\nis<br />\nattracting<br />\nmuch<br />\ninterest<br />\nthis<br />\ninstructor<br />\nin<br />\nphilosophy.<br />\nRhees'<br />\nstructors.<br />\nThe field of the Classics cuse, Harvard, and others of the<br />\nCredit given. Send for free outseason<br />\non<br />\nand<br />\noff<br />\ncampus.<br />\nthe<br />\nown<br />\nstatement<br />\non<br />\nthe<br />\nmatter<br />\nwas<br />\nfit at once. Make money fast. manifests certain aspects which ren- twenty-three colleges and univerMany<br />\npersons<br />\nhave<br />\nbenefited<br />\nby<br />\nthe<br />\nreported<br />\nto<br />\nbe:<br />\nAuthorship is guarantee of au- der the work of one who teaches sities entered in the meet.<br />\nscientific lectures given under the<br />\n\"I am an anarchist. This is why<br />\nLatin or Greek in the present day<br />\nthenticity.<br />\nunusually trying. The attitude of FOUR LECTURES TO BE auspices of the club. It is expected I am barred from the course.\"<br />\nUNIVERSAL HOUSE,<br />\nthat a large audience will enjoy the<br />\nmodern generations toward the<br />\nGIVEN BY NATURALISTS<br />\nMr. Hammond, commenting on<br />\nCollege Dept.<br />\nlectures<br />\nat the meeting tomorrow.<br />\nClassics presents one difficulty to<br />\nFIELD CLUB<br />\nthis statement, said:<br />\n1010 ARCH STREET<br />\nwhich is added a second in the fact<br />\nPhiladelphia, Pa.<br />\nThe program for the meeting of<br />\nHOPKINS PROF TAKES ONLY \"Of course, many professors<br />\nthat the traditions of the so-called the Naturalists' Field<br />\nClub tomorteaching philosophy are asses; but<br />\nGENTLE ANARCHISTS IN<br />\nWADERS authorities in the field are painfully row is an unusually attractive one.<br />\nEBGRAUERS •—• PRMTERS<br />\nCLASSES<br />\nfew would bar a man from classes<br />\nantiquated so far as concerns the Four lectures,<br />\nall on very interestInterviewed on the recent sus- because he happened to be an Anpresent pedagogical problem. All ing scientific subjects,<br />\nwill be pre- pension of undergraduates from archist. Perhaps Rhees carried his<br />\nthis, however, makes an interesting sented. R.<br />\nH. Luce will lecture on classes in ethics at the University views about the abolition of law<br />\ntopic for a magazine article which \"A<br />\nDeserted Beaver Dam,\" Bruce of Rochester, Mr. Hammond, eth- and order into the classroom. He<br />\nI plan to come out a little later on. Lineburg will<br />\ndeliver an address on ics instructor at Homewood, inti- may have thrown bombs or chairs<br />\nSmall Enrollment<br />\n\"Implements of Insects\"; Everett mated that the political views about during lectures, which would<br />\n\"The small enrollment of the C. Myers will talk on \"Symbiosis should not affect his classroom<br />\nexplain Professor Forbes' attiundergraduate Greek department in Hydra,\" and Everett C. Myers standing.<br />\ntude.\"<br />\nhas never justified the employing<br />\nof another man to help me in this<br />\nwork. Therefore I have had to<br />\nconduct many classes each year<br />\nmyself. Last year I taught 19<br />\nhours in Greek alone. With a<br />\nschedule so heavy, one can do little research or anything else. It<br />\nPrinters of<br />\nis quite doubtful whether a man<br />\ncrhe Johns Hopkins'<br />\nof average health could endure<br />\nNE11)S-LETTER<br />\nlong the strain of talking some<br />\nfour or five hours which this enLOMBARD and SOUTH STREETS tails. My physician has many<br />\ntimes urged me to seek a change<br />\nof vocation to rid myself of this<br />\nlabor alone, and at last I am following his directions.<br />\n\"Despite the problem they presented, I have always enjoyed my<br />\nclasses and have felt that both the<br />\nstudents and I have profited from<br />\nthem intellectually. Last year, my<br />\nbanner year, I could point to an<br />\nimprovement of some 300 per cent<br />\nOf course you know that<br />\nin enrollment since I'took over the<br />\nThe Barn is handling orders<br />\nwork.<br />\nfor our clothes again this<br />\n<br />\nWhat is your Verdict?<br />\n<br />\nPayne &Merrill<br />\n<br />\nWill<br />\niams<br />\nShaving Cream<br />\n<br />\nsE5<br />\n<br />\ntarthe<br />\nthe<br />\nfive<br />\note,<br />\n, to<br />\n)eo'for<br />\nby<br />\n['he<br />\nhat<br />\nalanY<br />\nthe<br />\n<br />\n'or)1y.<br />\nthe<br />\ntk's<br />\nthe<br />\nanfor<br />\n<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br />\n<br />\n211-213 E.. Baltimore St.<br />\n<br />\nEleven Years at Hopkins<br />\n<br />\n\"Having spent some eleven<br />\nyears at Hopkins as student and<br />\nteacher, I have made many friends<br />\n—and enemies—among the students and faculty. Both have given me a pleasure—although of different kinds—which I shall miss<br />\nwhen I do not see them so frequently.\"<br />\n• Dr. Baker was a brilliant student both as an undergraduate and<br />\n<br />\n\"What a difference<br />\njust a few cents make!\"<br />\n<br />\nFATIMA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 4, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nMaybe So=<br />\nOflate we have become conscience-stricken over our great<br />\nwaste of space on inconsequential<br />\nmatter and the astounding importance of a writer in the Baltimore<br />\nNews has added to our feeling of<br />\nunworthiness. Where as we offer<br />\nour readers nothing, which they receive with appropriate gratitude,<br />\nthis author answers the riddle of<br />\nthe centuries and in a single column reveals \"What Should be a<br />\nMan's Object in Life.\"<br />\n* *<br />\n<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME,'25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nA. J. McKAY,'26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br />\n<br />\nA COLLEGE TOWN<br />\nHopkins and Hopkins' activities have more friends now than ever<br />\nbefore. The Maryland football game, notable track successes and<br />\nother things have succeeded in transforming many citizens from<br />\nmere Baltimoreans to actual Hopkinsites. Hopkins does not yet<br />\nmean as much to Baltimore as Harvard means to Boston or the<br />\nUniversity of Pennsylvania means to Philadelphia. The inhabitants<br />\nof the Monumental City, however, are beginning to realize that they<br />\nhave a great University in their midst.<br />\nHopkins must soon capitalize on this realization. The end of<br />\nthis month marks the opening of the spring sport schedule. In order to carry out this schedule and to pay the guarantees it will necessitate, the athletic authorities must dispose of a large number of<br />\nseason tickets. The plan of campaign will be practically the same<br />\nas last year. The students will be formed into teams, competition<br />\nwill be held, and valuable prizes will be awarded to the group and<br />\nthe individual with the largest number of sales. This spring, however, the salesmen will have a more interested and more sympathetic<br />\ncitizenry to deal with.<br />\nOur track team is famous throughout the country; lacrosse has<br />\ngrown in popularity by leaps and bounds; the nine promises to be the<br />\nbest in years; the citizens of Baltimore are interested. Success depends solely upon the efforts of the undergraduates and there is no<br />\nexcuse for failure.<br />\n<br />\nThe recent more or less lamented<br />\nBowery Ball called forth the following:<br />\nP. Sachs discovered the secret of<br />\nthe prevalent joy: \"Everybody felt<br />\nat home.\"<br />\nT. Whiteley, the demon contrib..<br />\nsuggests that another Brewery Ball<br />\nbe held in the near future.<br />\n* * *<br />\nWith that familiar helping spirit<br />\nII. Goodwin, as a hint to the policy<br />\nof this column, quotes:<br />\nThe World is too much with us.<br />\n*<br />\nThis business of long-range argument via quotation is too easy.<br />\nFor example we might reply:<br />\nThe World is so full of a number of things. . . . And we might<br />\nadd one of the good things, such<br />\nas the following excerpt from Mr.<br />\nBroun's column of February 16:<br />\nWe find much shrewd observation on modern tendencies in our schools in a book<br />\ncalled \"Education<br />\nMoves<br />\nAhead,\" by Eugene Randolph<br />\nSmith.<br />\n\"Pupils who are continually marked,\" writes Mr. Smith,<br />\n\"soon become self-conscious<br />\nand calculating. They say not<br />\nwhat springs naturally from<br />\ntheir own experiences and<br />\nideas but what seems likely<br />\nto obtain a good mark. They<br />\nquite naturally and wisely play<br />\nupon the idiosyncracies of<br />\nthe teacher, quoting her book<br />\nif she has written one, her<br />\nfavorite authority if she<br />\nhasn't. There is a certain<br />\nstimulus to hypocrisy in such<br />\ndealings, a tendency toward<br />\nintellectual dishonesty that it<br />\nis unfortunate to encourage.<br />\nThere is also of necessity an<br />\nemphasis on the gap between<br />\npupils and teachers, on a kind<br />\nof rivalry that sometimes becomes antagonism. The pupil<br />\nbecomes a salesman. He sells<br />\nto the teacher as little knowledge as possible for as high a<br />\nmark as he can get.\"<br />\n<br />\nTHE FUTILITY OF UNDERGRADUATE ACTIVITIES<br />\nChristopher Morely is the latest to declare that undergraduate acAs a matter of fact, Mr. Goodtivities are useless. In an interview accorded a representative of the<br />\nwin,<br />\nstatistics prove that the maYale \"Daily News,\" the famous columnist and author. is reported as<br />\nof the quotations found in<br />\njority<br />\ndeclaring that the training to be derived from college publications<br />\nMaybe So are from Time and not<br />\nand the time spent in acquiring this training is not worth the effort. the New York World.<br />\n* * *<br />\nWe shall not attempt to refute these statements; that would be<br />\nThe Black and Blue Tay Staff<br />\npresumptuous. We will merely cite one of his points. Mr. Morely<br />\nare to wear little tokens<br />\nmembers<br />\nrelates that, while at Oxford, he went out for rowing but soon found<br />\nof<br />\ntheir<br />\ndignity on their watch<br />\nthat three hours spent every afternoon were not giving him what he<br />\nchains. The campus idiot suggests<br />\nwanted. After recovering from an illness he refused to row any that the NEWS-LETTER news hawks<br />\nmore and set out to do what he had come to college for; to make follow suit, using a hangman's<br />\nfriendships and thus to get the most out of life. He believes that Noose on a scarlet Letter as the derowing prevented him then and that, now, college publications and sign. Connotations explained on<br />\nother undergraduate activities tend to prevent the average student request.<br />\nAlso the campus idiot wants to<br />\nor editor from so doing.<br />\nknow why Frank Kent, who spoke<br />\nWe wonder how many of the men that have engaged in Hop- on politics at last Thursday's askins activities will agree that their participation has prevented them sembly, didn't make his speech<br />\nbefore the Interfraternity Board.<br />\nfrom making friends.<br />\n<br />\nSTETSONOcP<br />\n<br />\nHats<br />\nStyle and Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED<br />\n<br />\nMEN,<br />\n<br />\nFOR, YOUNG<br />\n<br />\nJOHNS HOPKINS TANKMEN DEFEAT FRANK R. KENT ADDRESSES<br />\nLEHIGH<br />\nASSEMBLY<br />\nContinued from page I<br />\nContinued from page 1<br />\n<br />\nsucceeded in winning a number<br />\nof seconds and thirds which kept<br />\nthe victory in doubt until the final<br />\nrelay.<br />\nRaleigh was the greatest point<br />\nwinner for Lehigh. He placed<br />\nfirst in the backstroke and second<br />\nin the 40-yard dash. Astarti was<br />\nby far the best in the.fancy diving.<br />\nRidge Howard had no trouble<br />\nin winning the plunge, with Hambleton, another Blue Jay, in second place.<br />\nWith Welch's lowering of Rowland's record for the 40-yard dash<br />\nand the 160-yard relay mark<br />\nequaled; Bahlke lowering Coady's<br />\nold record by over seven seconds,<br />\nthe Johns Hopkins present undergraduates might well be proud,<br />\nfor the members of this team have<br />\nlowered or equalled every Hopkins swimming mark with the exception of the 200-yard relay,<br />\nwhich record was established last<br />\nyear, by Coady, Lord, Buhrer and<br />\nWelch. Two of these men, Welch<br />\nand Lord, being on the team this<br />\nyear.<br />\nThe Black and Blue has now<br />\nwon three of the five dual meets<br />\nthis year, winning from Catholic<br />\nUniversity, Swarthmore and Lehigh, and losing to Brown and<br />\nRutgers.<br />\nSummary:<br />\n160-Yard Relay Race—Won by Hopkins<br />\n(Bahlke, Dunning, Lord and Welch);<br />\nsecond, Lehigh (Raleigh, Freeman,<br />\nPilot and Travis). Time, 1.22 4-5.<br />\nFancy Diving—Won by Astarti, Lehigh;<br />\nsecond, Childs, Lehigh; third, Stone,<br />\nHopkins.<br />\n40-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Raleigh, Lehigh; third. Travis, Lehigh. Time,<br />\n19 1-5 seconds.<br />\nPlunge for Distance—Won by Howard,<br />\nHopkins; second, Hambleton, Hopkins ; third, DeLong, Lehigh. Time,<br />\n22 2-5 seconds. Distance, 60 feet.<br />\n220-Yard Swim, Free Style—Won by<br />\nBahlke, Hopkins; second, Reed, Lehigh; third, Stone, Hopkins. Time,<br />\n2 minutes, 34 1-5 seconds.<br />\n100-Yard Breast Stroke—Won by Pilot,<br />\nLehigh; second, Swanson, Hopkins;<br />\nthird, Freeman, Lehigh. Time, 1<br />\nminute, 21 3-5 seconds.<br />\n100-Yard Back Stroke—Won by Raleigh,<br />\nLehigh: second, McCleary, Hopkins ; third, Richards, Lehigh. Time,<br />\n1 minute, 18 3-5 seconds.<br />\n100-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Bahlke,<br />\nHopkins; third, Travis, Lehigh.<br />\nTime, 58 seconds flat.<br />\n<br />\ntate who would be the winner.<br />\nFew Actually Vote<br />\n<br />\nMr. Kent then gave some startling statistics concerning the<br />\nlarge number of non-voters in the<br />\nnation. In 1920, out of fifty-five<br />\nmillion persons qualified to vote,<br />\nonly twenty-six million went to<br />\nthe polls. \"The slogan, 'The people rule,' is a joke,\" he said, \"for<br />\nthe last President was elected by<br />\na majority of a minority.\" The<br />\nspeaker concluded by stating that<br />\nthe man who does not use his ballot is as much to blame for anY<br />\ngovernmental corruptness as the<br />\ncrooked politician.<br />\nBefore Mr. Kent's talk, Mr. Norwood had charge of the Assembly.<br />\nThe chief announcement was the<br />\nregistering of Sergeant Frank's<br />\nprotest against snowballing the<br />\ndormitory windows. Other announcements of student affairs for<br />\nthe week were made.<br />\n<br />\nNeatly combed, Well4 hair is a<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br />\n<br />\nTubes-35c<br />\n<br />\nJars-75c<br />\n<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories,Inc.<br />\n<br />\n750 Stanford Avenue Los Angeles, California<br />\n<br />\n00<br />\nSend coupon for Free Trial Tube. .<br />\n=.11/<br />\n<br />\n11••<br />\n<br />\n• .M1M.•<br />\n<br />\n•<br />\n<br />\n1.10..<br />\n<br />\nIN=.•••<br />\n<br />\nSTANDARD LABORATORIES.Inc.<br />\nPlease send me free trial tube.<br />\nName<br />\nAddress<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, MARCH 4, 1924<br />\n<br />\n3<br />\n<br />\nDR.<br />\nLAWRENCE<br />\nHENRY graduate—he led his class every<br />\nBAKER TO ENTER JOURyear except in 1915, when, as a<br />\nNALISM IN JUNE<br />\nsophomore, he ranked third. In<br />\nGreek Instructor to Devote Entire Time 1917, Dr. Baker received his A. B.<br />\nto Journalistic Work. Was Brildegree and continued his studies<br />\nliant Student<br />\nas Hopkins Scholar the following<br />\nDr. Lawrence H. Baker, instrucyear. He was reappointed Hop\"What did Professor Smith mean<br />\ntor<br />\nin Greek, will sever a connecthis morning when he told you<br />\nkins<br />\nScholar in 1918, became Felthat no man could ever make a<br />\ntion of eleven years' standing with<br />\nsilk purse out of a sow's ear?\"<br />\nlow in Greek in 1919, and took his<br />\nthe Johns Hopkins University when<br />\nPythias—<br />\nPh. D. in 1920. In 1920 he was<br />\n\"He meant that I'd never be able<br />\nhe enters journalism at the concluto do good work with a poor pencil.<br />\nappointed<br />\nWhen you have tried Williams Shaving Cream your<br />\ninstructor in Greek, in<br />\nGuess I'll have to get a Dixon's<br />\nsion of this semester.<br />\nEldorado. Old Smity says it's the<br />\nverdict<br />\nwill be as favorable as is your verdict about the<br />\nwhich<br />\npost<br />\nhas<br />\nhe<br />\nserved<br />\ntill the<br />\nbest drawing pencil made.\"<br />\nnew Hinge-Cap. The heavier, faster-working Williams<br />\nDr. Baker has been doing jour- present itme. Dr.<br />\nBaker has at<br />\nlather, the fact that Williams lubricates the skin, the fine<br />\nnalistic work in various periodicals Limes during<br />\nthe past four years<br />\ncondition of your face after the shave, these qualities<br />\nand daily papers for several years been connected<br />\nwith the English<br />\nmake men stick to Williams as faithfully as the Hingeat the same time carrying on his Department.<br />\nCap sticks to the tube. As regards the Hinge-Cap, here<br />\nteaching, and he has now decided to<br />\n-the mastertharetVpencil\"<br />\nis an offer we make:<br />\n17 leads—all dealers<br />\ncontinue solely with his writing,<br />\nBOOTH BREAKS TWO MILE IN$250 in Prizes<br />\n11111•1111111EgaragaraailanillinaMMINIMP<br />\n\"The chief reason for my abanDOOR MARK<br />\nr or the best sentence of ten words or less on the value of the<br />\ndoning university work,\" Dr. Baker<br />\nWilliams Hinge-Cap,we offer the following prizes: 1st prize $100;<br />\nContinued from page 1<br />\n2nd prize $50; two 3rd prizes,$25 each; two 4th prizes,$10 each;<br />\nsaid, \"is that I wish to get into a the world's record and Marsters'<br />\nsix 5th prizes, $5 each. Any undergraduate or graduate student<br />\nIs eligible. If two or more persons submit identical slogans<br />\ncalling which offers greater oppor- time of 1.55 was<br />\ndeemed worthy of prizes, the full amount of the prize will be<br />\nwithin a second<br />\nawarded to each. Contest closes at midnight March 14, 1924.<br />\nWinners will be announced as soon thereafter as possible. Subtunities for the utilization of my lit- of the indoor half-mile mark.<br />\nmit any number of slogans but write on one side of paper only,<br />\nputting name, address, college and class at top of each sheet.<br />\nerary powers. I want something less<br />\nHills and Gates Break Records<br />\nAddress letters to Contest Editor. Thei.B. Williams Co.,Glastonbury, Conn.<br />\nconfining and less restraining than<br />\nHills of Princeton broke his<br />\nteaching.<br />\nown indoor record for the 16 lb.<br />\nCLOTHIERS<br />\nWriting Circumscribed<br />\nshotput with a heave of 46 feet,<br />\n\"It is quite true that in profes- 3-4 of an inch. Beattie, a teamHABERDASHERS<br />\nsorial work one has certain chances mate was second and Plansky of<br />\nfor writing, but here the writing Georgetown was third.<br />\nGates,<br />\nThe new Hinge-Cap on<br />\n315 Charles St. North<br />\nthat one does_ is considerably cir- Princeton, this afternoon won the<br />\ncumscribed by the demands of the '5-1b. weight throw with a heave<br />\nvarious technical journals. In these cf over forty-nine feet. Hills finit is the digging into the sediment, ished in third position.<br />\nSPARE TIME POSITIONS<br />\nsilt and filth of bygone ages and<br />\nThe meet was won by PennsylFOR STUDENTS<br />\nmusty tomes which counts for vania, last year's winners with a<br />\nGreatest opportunity, \"Life of everything, whereas the power to total of 21 1-3 points. Yale and<br />\nwill lecture on 'Bird Banding at<br />\nYoung Rhees, the student in<br />\nWoodrow Wilson\" by Josephus write interestingly is more of a dis- Princeton tied for second honors<br />\nIIomewood.\"<br />\nquestion,<br />\naccording to press recredit<br />\nthan<br />\nan<br />\nadvantage.<br />\nwith 20 points. Georgetown was<br />\nDaniels, Secretary Navy, AssociaThe meeting will take place to- ports, was \"ousted\" because his<br />\n\"Then,<br />\ntoo,<br />\nmy<br />\nposition<br />\nas a fourth and Penn State fifth. Hopte of Former President. Big book<br />\nmorrow at 3 P. M. in Room 112, \"advanced ideas\" did not meet with<br />\nhandsomely illustrated, low price. teacher of Greek is somewhat dif- kins with 7 1-9 points finished in<br />\nGilman<br />\nHall. The local naturalists' the approval of Professor Forbes,<br />\nBest terms to representatives. ferent from that of most other in- ninth position, followed by Syraclub<br />\nis<br />\nattracting<br />\nmuch interest this instructor in philosophy. Rhees'<br />\nstructors.<br />\nThe field of the Classics cuse, Harvard, and others of the<br />\nCredit given. Send for free outseason<br />\non<br />\nand<br />\noff the campus. own statement on the matter was<br />\nfit at once. Make money fast. manifests certain aspects which ren- twenty-three colleges and univerMany<br />\npersons<br />\nhave<br />\nbenefited by the reported to be:<br />\nAuthorship is guarantee of au- der the work of one who teaches sities entered in the meet.<br />\nscientific<br />\nlectures<br />\ngiven<br />\nunder the<br />\n\"I am an anarchist. This is why<br />\nLatin or Greek in the present day<br />\nthenticity.<br />\nauspices<br />\nof<br />\nthe<br />\nclub.<br />\nIt<br />\nis<br />\nexpected I am barred from the course.\"<br />\nunusually trying. The attitude of FOUR LECTURES TO BE<br />\nUNIVERSAL HOUSE,<br />\nthat a large audience will enjoy the<br />\nmodern generations toward the<br />\nGIVEN BY NATURALISTS<br />\nMr. Hammond, commenting on<br />\nCollege Dept.<br />\nlectures<br />\nat the meeting tomorrow.<br />\nClassics presents one difficulty to<br />\nFIELD CLUB<br />\nthis statement, said:<br />\n1010 ARCH STREET<br />\nwhich is added a second in the fact<br />\nPhiladelphia, Pa.<br />\nThe program for the meeting of<br />\nHOPKINS PROF TAKES ONLY \"Of course, many professors<br />\nthat the traditions of the so-called the Naturalists'<br />\nField Club tomorteaching philosophy are asses; but<br />\nGENTLE ANARCHISTS IN<br />\nPRMTERS •-• BIRDERS authorities in the field are painfully row is an unusually attractive one.<br />\nEUGRAUERS<br />\nCLASSES<br />\nfew would bar a man from classes<br />\nantiquated so far as concerns the Four lectures, all on<br />\nvery interestInterviewed on the recent sus- because he happened to be an Anpresent pedagogical problem. All ing scientific subjects,<br />\nwill be pre- pension of undergraduates from archist. Perhaps Rhees carried his<br />\nthis, however, makes an interesting sented. R.<br />\nH. Luce will lecture on classes in ethics at the University views about the abolition of law<br />\ntopic for a magazine article which \"A Deserted<br />\nBeaver Dam,\" Bruce of Rochester, Mr. Hammond, eth- and order into the classroom. He<br />\nI plan to come out a little later on. Lineburg will<br />\ndeliver an address on ics instructor at Homewood, inti- may have thrown bombs or chairs<br />\nSmall Enrollment<br />\n\"Implements of Insects\"; Everett mated that the political views about during lectures, which would<br />\n\"The small enrollment of the C. Myers will talk on \"Symbiosis should not affect his classroom<br />\nexplain .Professor Forbes' attiundergraduate Greek department in Hydra,\" and Everett C. Myers standing.<br />\ntude.\"<br />\nhas never justified the employing<br />\nof another man to help me in this<br />\nwork. Therefore I have had to<br />\nconduct many classes each year<br />\nmyself. Last year I taught 19<br />\nhours in Greek alone. With a<br />\nschedule so heavy, one can do little research or anything else. It<br />\nPrinters of<br />\nis quite doubtful whether a man<br />\ncrhe Johns Hopkins'<br />\nof average health could endure<br />\nNE -1DS,LETTER<br />\nlong the strain of talking some<br />\nfour or five hours which this enLOMBARD and SOUTH STREETS tails. My physician has many<br />\ntimes urged me to seek a change<br />\nof vocation to rid myself of this<br />\nlabor alone, and at last I am following his directions.<br />\n\"Despite the problem they presented, I have always enjoyed my<br />\nclasses and have felt that both the<br />\nstudents and I have profited from<br />\nthem intellectually. Last year, my<br />\nbanner year, I could point to an<br />\nimprovement of some 300 per cent<br />\nOf course you know that<br />\nin enrollment since I look over the<br />\nThe Barn is handling orders<br />\nwork.<br />\nfor our clothes again this<br />\n<br />\nWhat is your Verdict?<br />\n<br />\nEtfiT\"<br />\noRAD<br />\n's<br />\n<br />\nPayne &Merrill<br />\n<br />\nWill<br />\niams<br />\nShaving Cream<br />\n<br />\nSES<br />\n<br />\ntarthe<br />\nthe<br />\nfive<br />\note,<br />\nto<br />\nco'for<br />\nby<br />\nIThe<br />\nhat<br />\n)alany<br />\nthe<br />\n<br />\n'or)1y.<br />\nthe<br />\ntk's<br />\nthe<br />\nanfor<br />\n<br />\nEleven Years at Hopkins<br />\n<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats<br />\n<br />\n$30 up<br />\n$35 up<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\n\"Having spent some eleven<br />\nyears at Hopkins as student and<br />\nteacher, I have made many friends<br />\n—and enemies—among the students and faculty. Both have given me a pleasure—although of different kinds—which I shall miss<br />\nwhen I do not see them so frequently.\"<br />\n• Dr. Baker was a brilliant student both as an undergraduate and<br />\n<br />\n\"What a difference<br />\njust a few cents make!\"<br />\n<br />\nFATIMA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 4, 1924<br />\n<br />\n4<br />\n<br />\nKNOCKLESS GAS EXPLAINED BOOTH AND CLARKE TO RUN<br />\neagorergroirdI<br />\nIN NATIONAL SENIOR<br />\nIt•<br />\nIN LECTURE TO ENpp,..mgiaraaref<br />\n=<br />\n•<br />\ntri:WW)<br />\n1:7•41/INNIMININgligr<br />\n—<br />\nd.-\"`\"<br />\n•<br />\nto<br />\n•<br />\n•=aormeffir<br />\n411,<br />\nTRACK MEET<br />\nGINEERS<br />\n4,<br />\npi vo<br />\n7.eicieZor.7.W.r.,-2,...<br />\nqw<br />\n••••-•agiawilsoonAl<br />\n•<br />\namiromititC4F .c....—<br />\nVerne Booth and Louis Clarke<br />\nA positive and inexpensive way<br />\neassower4,01. ir<br />\n41111111.11.101<br />\nFOUNTAIN PEN INK<br />\n,<br />\n(1<br />\nOMR ealraff<br />\nof eliminating the \"knocking\" of will be contestants in the Nationar e be'<br />\nOM.awd<br />\na<br />\niv\"<br />\noff<br />\nam'<br />\nmeet,<br />\nU.<br />\nal Senior Indoor A. A.<br />\n• gawn<br />\nararmaggwat;<br />\n\"The Ink That Made<br />\ninternal combustion engines, parsowtokippw<br />\none of the most important track<br />\n,41%at;al<br />\n0<br />\nThe Fountain Pen Possible ticularly automobile engines, was meets of the year, at New York,<br />\nexplained last Wednesday by Dr. on May 5. The Hopkins track<br />\n.All All<br />\nColors<br />\nSizes<br />\nThomas Midgely, Jr., vice-presi- stars have attracted a great deal<br />\nttIlIIiiIii,flijLI 1111<br />\ndent and general manager of the of attention this season in indoor<br />\nGeneral Motors Company. The track meets and they are expectNLY those who have<br />\n..<br />\n:1111111•1111 --.„.<br />\ned to make a good showing towas<br />\nengineer<br />\nthe<br />\nof<br />\naddress<br />\nOhio<br />\n:01!110<br />\nsmoked Melachrinos<br />\nmorrow evening. The National<br />\nhI<br />\nthe feature of the joint meeting of<br />\nSenior Indoor A. A. U. meet is<br />\njudge the quality<br />\n1.gtilA147i111(<br />\nthe Maryland section, American one of the chief matches at which<br />\n3EifyzityL.'\";;Cpc<br />\nof the finest Turkish<br />\nChemical Society, and the Balti- Olympic team material is selected.<br />\nIII! f<br />\ntobacco.<br />\nmore Section, American Society According to Coach Van Orman,<br />\nof Civil Engineers.<br />\nBooth and Clarke should have a<br />\nORIGINAL<br />\nAlthough of a thoroughly tech- good chance of becoming memrenderwas<br />\nthe<br />\ntalk<br />\nnical nature,<br />\nbers of the U. S. team should<br />\ned unusually interesting by hu- they emerge from tomorrow's<br />\nmorous sidelights of his own ex- contests victorious.<br />\nperiences.<br />\nClarke is entered in two races,<br />\nOne Cigarette Sold the World Over\"<br />\nThe speaker traced his own re- the seventy and three hundred<br />\nsearch for a substance, which yard dashes.<br />\nIn the seventywhen added to gasoline would yard dash the Black and Blue athentirely lete \\vill compete with such stars<br />\nform a combination<br />\ni. 0M 01112<br />\n\"knockless\"; however severe the as Murchison, McAllister, and<br />\n\"The King of Lubricants\"<br />\nconditions imposed upon it. He Bowman. of Syracuse, all of<br />\nfirst explained how the search for whom are nationally known<br />\nsuch a fuel came into being. The sprinters. Allan Woodring will<br />\nFor<br />\nSHERWOOD BROTHERS, INC.<br />\nFor<br />\ncompany which employed Dr. be Clarke's principal opponent in<br />\nLIBERTY ST.<br />\nGENERAL<br />\nFOUNTAIN<br />\nINIKEIEHNIKEENUMNINIE.EIHNNEMMINDIGEO Midgely had developed an auto- the three<br />\nhundred yard dash.<br />\nAT SARATOGA<br />\nUSE<br />\nPENS<br />\nmobile having a higher gear ratio Booth's chief rival in the two-mile<br />\nManufactured by<br />\nthan other cars, and running- more run will be Hahn„who has startLUNCHEON<br />\n& HUMPHRIES<br />\nWIGHT<br />\nmiles on a gallon of gasoline. The led the sport world this winter by<br />\nBoys, the place to get your<br />\nTEA<br />\ndifficulty was that the engine defeating Joie Ray in three races.<br />\nmeals—and they are honALWAYS USE A<br />\nDINNER<br />\nat very low speeds. Ray is not entered in the two-mile<br />\n\"knocked\"<br />\nest-to-goodness meals, well<br />\nYELLOW CAB<br />\nResearch was then begun to find run tomorrow night, as he will<br />\nserve d, and reasonably<br />\nSPECIAL PARTIES<br />\nOR PHONE<br />\nthe substance which would make concentrate his efforts on win- 11.30 A. M.<br />\nuntil<br />\npriced—is at<br />\nthe gasoline \"knockproof.\"<br />\nmug the mile run.<br />\nVERNON 1212<br />\nPLAZA 6987<br />\n7.30 P. M<br />\nThe element first tried was ioHAIL THEM ANYWHERE<br />\ndine. This had the primary qual- 0 A K CONVENTION HELD AT<br />\nification of stopping \"knocks,\"<br />\nCENTER COLLEGE<br />\nbut it was ruled out by the group G. M. Shriver Represents Beta Circle<br />\nof Hopkins<br />\nof investigating engineers on acAdoption of a new constitution<br />\ncount of its cost. Besides being<br />\n1817 N. Charles St.<br />\nand individuality is offered here at prices that are not<br />\nexpensive, iodine has a strong was the main accomplishment of<br />\nand cannot be underquoted by any house at any time.<br />\n(Half Block below North Ave.)<br />\nchemical affinity for the metal the annual Omicron Delta Kappa<br />\n(I, Besides the reputation of an old-established firm<br />\nparts of the engine, and would convention, held on February 22<br />\nis back of each sale with a guarantee.<br />\nMgr.<br />\nNicholas Brown,<br />\nrender the engine useless in a and 23, at Center College. Acvery few months. Aniline was cording to G. M. Shriver, Jr., who<br />\nnext found to be one which had was the delegate of the Beta Circle<br />\nDRAPERIES<br />\nDECORATIONS<br />\nthe desired property when mixed to the convention, the new consti- FURNITURE<br />\nthe<br />\nover<br />\nimprovement<br />\nSTREET<br />\nan<br />\nis<br />\ntution<br />\n343 NORTH CHARLES<br />\nORTMAN<br />\nwith the engine fuel. This was<br />\nvalueless, likewise, because of the old one chiefly because of its re\"Queen Quality\" Home-made<br />\ninjurious and unpleasant fumes quirements for membership in the<br />\nChocolates<br />\nFor order. The qualifications for adfrom the engine exhaust.<br />\nRENT A CAR<br />\nLuncheonette<br />\nIces<br />\nIce Cream<br />\nrequire distinguished<br />\nnow<br />\nmission<br />\nnext<br />\nthe<br />\ntelurium,<br />\nsimilar<br />\nreasons<br />\n227 N. Howard 518 N. Charles<br />\ndiscovered compound, was use- leadership in a particular college<br />\nDancing Every Afternoon at<br />\nCharles St.<br />\nless to the General Motors Com- activity and do not construe meditivities as sufficient for election.<br />\npany.<br />\nDODGES, 18c PER MILE<br />\nEach of the nine circles were FORDS, 12c PER MILE<br />\nfor<br />\nfound<br />\nfinally<br />\nThe substance<br />\nthe purpose was tetra-ethyl-lead, represented by a delegate at the<br />\nSpecial Reduced Rates for 50 Miles or More<br />\nwhich is fifty times as powerful as convention and many important<br />\naniline, and is so cheap that a gal- ocre participation in several acDRIVE IT YOURSELF CO.<br />\nlon of fuel can be treated for two measures were acted upon. BeVERNON 4049<br />\n1725 NORTH CHARLES ST.<br />\ncents. That the substance actu- cause of the many colleges petially stopped engine \"knocking\" tioning for 0. D. K. charters, a<br />\nwas shown by Dr. iMidgely on a definite expansion policy was forCibeXatter<br />\nThe Greetings ofa Fine Store<br />\nreal gas engine, which \"knocked\" mulated. In this respect, the peti‘341'18 H.St OSCAR<br />\n°WNERS<br />\nbadly before the introduction of tions of Hampton-Sidney College<br />\nTo the Students of a Fine University<br />\nitiDt<br />\n1*<br />\n'<br />\n•Cw4 VIP<br />\nthe treated gasoline, but ran were recommended to the general<br />\n29 E. BALTIMORE ST.<br />\nsmoothly after the improved fuel council for favorable action. A<br />\nAgents for JOHN B. STETSON HATS was lead into the cylinder.<br />\nmotion introduced to hold bi-anHOCHSCHILD.KOHN<br />\nand FRATERNITY BANDS<br />\nnual instead of annual conventions<br />\nwas defeated, the delegates believBE A NEWSPAPER CORRESPONDENT<br />\nthat the youthfulness of the<br />\ning<br />\nNOTICES<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nsociety, together with its rapid<br />\nCandidates and members<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nmeetannual<br />\nnecessitates<br />\ngrowth,<br />\nIs Taking the Country by Storm<br />\nof News-Letter Staff today<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nings.<br />\nA complete set in bright<br />\nin News-Letter office, 12.30.<br />\nNEWSWRITERS TRAINING BUREAU<br />\ncolors, 144 tiles. 116 countEvery delegate reported that<br />\ners, 8 racks, 2 dice, book of<br />\nBuffalo, N. Y.<br />\nrules and instructions: any<br />\nmembership in the 0. D. K. is<br />\none can learn the game in<br />\nBaseball Organization<br />\nten minutes. All in attracconsidered the highest honor to be<br />\ntive box, sent prepaid on<br />\nmeeting today at 4 P. M., in<br />\nher trip to Spain last summer.<br />\nCOSMOPOLITAN CLUB<br />\nreceipt of $1.00 (Canada<br />\nwon on the campus of his college.<br />\nand<br />\nCandidates<br />\n110 M. E.<br />\n25c extra).<br />\nMEETING<br />\nThe' chairman of the program<br />\nHOLDS<br />\nAssistant Managers report.<br />\ncommittee<br />\nwas G. A. Pacheco, of<br />\nLatin-American students enterThe Read Eagle Team this year<br />\nBolivia.<br />\nThis<br />\nwas the third of a<br />\nVery Attractive Black Satwill be coached by Joe Zoller, of tained at the last meeting of the<br />\nFellowship dinner,6 P. M.<br />\neen Mah-Jong Table Cover,<br />\nseries<br />\nof<br />\nprograms<br />\nhandled by<br />\nwith colored dragon delast year's varsity, who has volun- Cosmopolitan Club, which was<br />\ntonight, Friends Meeting<br />\nsigns, adjustable to any<br />\nvarious<br />\nthe<br />\nof<br />\nclub<br />\ncounter<br />\nmembers<br />\nfrom<br />\ntable:<br />\n16<br />\nsize card<br />\nHouse. Norman Thomas, of<br />\nteered to i nstruct the Hopkins held at the Friends Meeting<br />\nPockets, striking colored<br />\non<br />\nprospeak<br />\nof<br />\nparts<br />\nworld.<br />\nThe<br />\nwill<br />\nfirst<br />\nthe<br />\nNew York,<br />\nstitched edges. Extraorscrubs. It has not been decided<br />\ndinary value. Special price<br />\nHouse on last Saturday evening, gram was handled by the Chinese,<br />\n\"The Labor Movement and<br />\nyet whether to have a Red Eagle<br />\nCOMBINATION OFFER: We will<br />\nthe Student\".<br />\nde- and the second by the Russians.<br />\nsend prepaid one complete Mahteam or a Freshman Team; the at 8 o'clock. The program,<br />\njong set and table cover as deThe members of the Friends<br />\nLatin-Amertypically<br />\nbe<br />\nto<br />\nsigned<br />\nidea of a yearling team being sugscribed above on receipt of $2.50.<br />\nBlack and Blue Jay Busiwill entertain the CosmoMeeting<br />\ntalk<br />\na<br />\nof<br />\nprincipally<br />\nconsisted<br />\nican,<br />\ngested by applications for games<br />\nCHINA-AMERICAN IMPORTING<br />\nness Staff and candidates<br />\nClub<br />\npolitan<br />\nat its next semiProfessor<br />\nFlores,<br />\nCOMPANY<br />\nPastoriza<br />\nwith such a team from several col- by Dr.<br />\nWednesday at 12.30.<br />\nNew York<br />\nmonthly<br />\nmeeting.<br />\n111 West 68th St.<br />\non<br />\nCollege,<br />\nof Spanish at Goucher<br />\nleges, including Maryland.<br />\n<br />\nSANFORD'S<br />\n<br />\nA<br />\n<br />\nO<br />\ncan<br />\n<br />\nMELACHRINO<br />\n<br />\n\"The<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nDRIVE IT YOURSELF<br />\n<br />\n8c Co.<br />\n<br />\nr--<br />\n<br />\nMah-Jong<br />\n<br />\nTable Covers<br />\n<br />\n\f", "format": "basic_html", "processed": "I.<br /><br />\nVOL. XXVIII, No 38<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br /><br />\nFRANK R. KENT DISCUSSES JOHNS HOPKINS TANKMEN SPRING SEASON TICKET CAMDEFEAT LEHIGH IN<br />\nPAIGN OPENS NEXT<br />\nPOLITICS AT THURSDAY<br />\nCLOSE CONTEST<br />\nMONDAY MORNING<br />\nASSEMBLY<br />\nPolitical Writer from the Sun Gives Three Hopkins Records Shattered and Each Student Expected to Sell Two<br />\nFourth Equaled. Welch and<br />\nTickets in Order to Insure<br />\nOutline of Present Day Problems.<br />\nBahlke Star<br />\nSuccess<br />\nBewails Indifference of Voters<br /><br />\nPRICE 5 CENTS<br /><br />\nBOOTH BREAKS TWO-MILE INDOOR MARK AT<br />\nI. C. A. A. A. A. GAMES LAST SATURDAY<br />\nNIGHT IN NEW YORK<br />\nClips 3-10 Seconds from Former Record Held by McLane<br /><br />\nHopkins victory over Lehigh<br />\nTwo tickets per man is the quota<br />\nPennsylvania Wins Meet. Hopkins in Ninth Place. Clarke and Proctor<br />\nFriday night at the Baltimore that has been fixed for the Spring<br />\nPlace in 70 Yard Dash and High Jump<br />\nAthletic . Club was greatly due to Season Ticket Campaign which is<br />\nNew York, March 1.—Hopkins athletes entered in the I. C. A. A.<br />\nthe excellent swimming of Bob<br />\nto start next Monday morning. A. A. Indoor Championships held here tonight added new laurels to<br />\nWelch. The Homewood natator<br />\ntheir long string when Verne Booth annexed another record when<br />\nstarting behind Travis, his oppo- This quota was fixed by the Ath- he broke the indoor two-mile intercollegiate record, when Clarke<br />\nnent, succeeded in passing him letic Office from which has been is- gained a place in the seventy-yard dash, and when Proctor tied for<br />\nand winning the relay and also sued a statement that $6,000 must second in the running high jump. These three men composed the<br />\nthe meet for the Black and Blue. be realized from this campaign in entire Black and Blue entry and accounted for 7 1-9 points.<br />\nFor at the beginning of this race order to insure a successful spring<br />\nBooth, already I. C. A. A. A. A.<br />\nthe score was 33 to 29 in HopTEAM<br />\nINCLUDES outdoor two-mile champion, and<br />\nseason.<br />\nThe campaign will be TENNIS<br />\nkins' favor, the relay deciding<br />\ncross country champion, annexed<br />\nNAVY ON SCHEDULE<br />\nwhich way the victory would managed as in former years; the<br />\nindoor title when. he defeated<br />\nthe<br />\nPart of the Johns Hopkins tenrest. Incidentally, the record for fraternities and groups of non-fravarious candidates.<br />\nElmer<br />\nMcLane, Pennsylvania, fornis schedule has been released. It<br />\nthe 160-yard distance, made in ternity men forming teams for the<br />\nHarding's<br />\nmer<br />\nMr.<br />\ntitle<br />\nholder. Booth's time of<br />\nafter<br />\nthat<br />\nsaid<br />\nHe<br />\nis a certainty that the Black and<br />\n1920, was equalled, when the team sale of the tickets. As in former<br />\nRethe<br />\nfor<br />\n9<br />\nminutes<br />\nand 36 seconds clipped<br />\ncandidates<br />\ndeath many<br />\nBlue netmen will meet the Naval<br />\nthrough the water in one years a cup is to be offered to the<br />\ntraveled<br />\nall<br />\napeared<br />\n3<br />\n3-10<br />\nseconds<br />\nfrom the previous<br />\nnomination<br />\npublican<br />\nAcademy, Georgetown, University<br />\nwinning team and a handsome<br />\nminute,<br />\n22<br />\n4-5<br />\nseconds.<br />\nover the country. Mr. -Coolidge,<br />\nof Maryland, Baltimore Country record held by McLane. Booth<br />\nThe meet resulted in the shat- prize to the individual high saleshowever, soon proved himself an<br />\nClub, and the Easton Country let McLane set the pace content<br />\ntering of three Hopkins' records. man.<br />\nastute politician and gradually<br />\nClub. Negotiations riow being car- to trail until the last quarter mile,<br />\nSpring Schedules Complete<br />\neliminated his opponents-from the Welch lowered by two-fifths of a<br />\nried on will probably result in when he forged ahead. Helme of<br />\nThe spring sports schedule, to<br />\nrace. He retained the entire Har- second, Rowland's mark of 19 3-5<br />\nmatches with Loyola and Dela- Georgetown finished strong and<br />\nseconds<br />\nmade<br />\nin<br />\nwhen<br />\nhe<br />\n1920,<br />\nall<br />\ngames of which the season ticknosed out McLane for the place<br />\nding cabinet and further strengthware.<br />\nposition. Lermond, Boston Colened his position by appointing sped through the water in 19 1-5 ets are to admit holders, is one of<br />\nThe schedule to date is:<br />\nlege,<br />\nfinished fourth, followed by<br />\nMr. Bascom Slemp, a political seconds. Welch lowered his own the most brilliant spring cards ever<br />\nEaston Country Club, away,<br />\nPayne of Colby.<br />\nPower in the Republican Party, to record, which he established last offered at Homewood. The base- April 19.<br />\nserve as his personal secretary. It year, when he swam the 100 yards ball team is carded to play eleven<br />\nClarke Gets Fifth<br />\nGeorgetown University, away,<br />\nsoon became clear that \"Cal\" was free style in the good time of 58 (Tames at home and the lacrosse May 1.<br />\nLouis<br />\nClarke,<br />\nwho last Satura \"sure bet.\" Hiram Johnson seconds flat. This knocked off team will meet seven rivals in inUniversity of Maryland, home, day night broke the world's inalone remained and his campaign three-fifths of a second from his teresting contests. The track team May 3.<br />\ndoor mark for the 100 in 9 4-5 sechas scheduled but one meet at<br />\nWas not considered dangerous. former record.<br />\nBaltimore Country Club, away,<br />\nHomewood<br />\nso<br />\nfar,<br />\nbut<br />\nit<br />\nis<br />\nonds could only gain fifth place<br />\nhoped<br />\nThe<br />\nthird<br />\nevening<br />\nrecord<br />\nof<br />\nthe<br />\nCountry Normally Republican<br />\nMay 10.<br />\nthat<br />\nmore<br />\ncan<br />\nbe<br />\narranged<br />\nbefore<br />\nwas<br />\nbroken<br />\nby<br />\nGeorge<br />\nBahlke,<br />\nUnder normal conditions the<br />\nU. S. Naval Academy, away, in the 70-yard dash. After winthe opening of the season. There<br />\nthe<br />\nlanky<br />\nfreshman,<br />\nwhen<br />\nhe<br />\nif<br />\na<br />\nning both his first and semi-final<br />\nand<br />\nRepublican,<br />\nis<br />\ncountry<br />\nMay 21.<br />\nis a double header staged for nearly<br />\nswam<br />\nminthe<br />\n220-yard<br />\nrace<br />\nin<br />\n2<br />\nparty,<br />\nthat<br />\nin<br />\noccur<br />\nSplit does not<br />\nAs the available material is un- heats, Clarke succumbed to Bowthe Democratic candidate is not utes, 34 1-5 seconds, clipping sev- every Saturday afternoon from the usually fine the prospects are man, Syracuse; Comins, Yale; Fifirst of April until the twentylikely to win. The Teapot Dome en and one-fifth seconds from<br />\nbright for a most successful sea- terman, Williams, and Bugby,<br />\nfourth of May.<br />\naffair, however, prevents Coolidge Coady's old mark.<br />\nson.<br />\nJean Hoffmeister, captain of Dartmouth, in the finals. BowThe division of the student<br />\nBahlke, likewise, swam second<br />\nfrom being the certainty he was a<br />\nthe<br />\ntennis team, is much pleased<br />\nfew months ago. Mr. Coolidge, to Welch in the 100-yard dash body into fraternity and group with the outlook. George Hebner, man won by about a yard and a<br />\nalthough not connected personally and was first man on victorious teams for the sale of the season '27, junior state champion of half and the rest of the field were<br />\ntickets was found to be quite satiswith the scandal, will suffer from relay.<br />\nMaryland, will form a brilliant ad- bunched together so that many<br />\nthe notoriety his party gained<br />\nHopkins' swimmers succeeded factory in the two previous cam- dition to the Hopkins racqueters. felt that the actual outcome was<br />\nthrough the oil investigation. On in grabbing five out of the eight paigns. One man from each team Burlinghof, a third year medical different. Bowman's time of 7 2the other hand, while the Demo- competitions, but Lehigh besides is to be its captain to keep it or- student who played in several<br />\n10 seconds, is 1-10 of a second<br />\ncrats have been given an opening, placing first in the other three, ganized. The list of team mem- matches last year, is expected to<br />\nbers<br />\nwill<br />\nbe<br />\nposted<br />\non<br />\nbulletin<br />\nslower<br />\nthe<br />\nthan the intercollegiate<br />\nthey have been deprived of their<br />\nContinued on page 2, col. 4<br />\njoin the Black and Blue ranks.<br />\nboards<br />\nat<br />\nHomewood<br />\nin<br />\nthe<br />\nnear<br />\nrecord<br />\nset up last year by<br />\nMr.<br />\nfor<br />\ncandidate,<br />\npromising<br />\nInost<br />\nOthers who have displayed skill<br />\nfuture.<br />\nThe<br />\ncup<br />\nto<br />\nbe<br />\npresented<br />\nsplashed<br />\nbeen<br />\nalso<br />\nMcAdoo \"has<br />\nCONCERT TO BE GIVEN ON<br />\nin tennis are Stulman, Wasser- \"Boots\" Lever, Pennsylvania.<br />\nto the winning team is a large silWith the oil.\"<br />\nMARCH 13 AT ST.<br />\nman, and Kaulfholz.<br />\nFlahive, Boston College, repeatver trophy. The prize for the inMARK'S CHURCH<br />\nThird Party Present<br />\nCaptain Hoffmeister stated ed his performance at the Johns<br />\ndividual having the greatest sales<br />\nthat candidates would be called<br />\nThe Musical Club will present<br />\nWhat promises to make the<br />\nis expected to be very elaborate, alHopkins-Fifth Regiment games,<br />\nout and practice resumed as soon<br />\ncoming election one of the most its next concert on the night of though it has not<br />\nbeen selected yet.<br />\nwhen he won the high jump with<br />\nas the courts are ready.<br />\ninteresting in American history is Thursday, March 13, at the St.<br />\nCampaign<br />\nCloses<br />\nMarch<br />\n24<br />\na<br />\nleap of 6 feet, 1-8 of an inch.<br />\nthe possibility of Senator La Fol- Mark's M. E. Church. The affair<br />\nThe<br />\ncampaign<br />\nwill<br />\nlast<br />\nfor<br />\ntwo<br />\nHOPKINS TO HOLD FOOT- Nine men, including Proctor,<br />\nlette entering the campaign as a is under the auspices of the Ladies<br />\nweeks, beginning March tenth and<br />\nHopkins, tied for second at the<br />\nBALL TOURNAMENT<br />\nthird party nominee. La Follette Aid Society of the church.<br />\nending March twenty-fourth. In<br />\nIS an extreme progressive. He is<br />\nAlthough the big Home ConHomewood Field will be the height of 5 feet 10 inches. The<br />\nth e leader of a small bloc of pro- cert has been successfully given, that period it is expected that some scene of a novel event sometime pole vault record of 12 feet, 6<br />\ngressives in the House and in the the activities of the club have not undergraduate will call on each during the spring when a \"foot- inches, made last year by Owen<br />\nSenate, and thus occupies a domi- abated and a full schedule is in Hopkins alumnus in Baltimore or ball tournament\" is staged there and Sherrill of Pennsylvania, was<br />\nin the vicinity of Baltimore in an<br />\nnant position.<br />\nview for the remainder of the seaunder the auspices of the J. H. U. tied this year by Owen, Schollp,<br />\nattempt<br />\nto<br />\nsell<br />\nhim<br />\na<br />\nticket.<br />\nA<br />\nlist<br />\nAthletic Association. The tour- Yale, and Libby, Dartmouth.<br />\nMr. Coolidge is a real conserva- son. A trip to Delaware College<br />\nof<br />\nalumni<br />\nwill<br />\nbe<br />\navailable<br />\nto<br />\nthe<br />\nnament is limited to students of Sherrill was in a tie for fourth<br />\ntive. The elimination of McAdoo has been tentatively arranged, but<br />\nstudents at any time so that they<br />\nhigh and preparatory schools and place.<br />\nleaves only conservatives eligible is not yet definitely decided upon.<br />\ncan learn of some alumnus upon is<br />\nfor the Democratic ticket. If both Also a concert at the Western<br />\nintended to bring more school<br />\nGeorgetown Wins 2-Mile Relay<br />\nwhom to call.<br />\nconare<br />\nof<br />\nHigh<br />\nbenefit<br />\ncandidates<br />\nSchool,<br />\nfor<br />\nthe<br />\nboys<br />\nparty<br />\nout<br />\nto<br />\nlarge<br />\nHomewood.<br />\nthe<br />\nThe<br />\nThe most exciting race of the<br />\nThe price of the tickets will be<br />\nforms of competition for the con- evening was the two-mile relay.<br />\nservatives, La Follette is apt to that institution's scholarship fund,<br />\ncarry four states, and perhaps as is contemplated. The club, spurred the same as last year, $5 for regular test will be kicking and forward Brooks, Georgetown's first runrnany as .six or seven. Thus, if the on by the success of this season, tickets and $2 for prep school men. passing footballs. All regulation ner, gave Gegan a lead of about<br />\nbemocrats carry the \"Solid wishes to extend its reputation<br />\nmodes of kicking are to be used to ten yards. Geg,an maintained his<br />\nSouth,\" no candidate is likely to further afield, and it is rumored<br />\ndetermine the most educated toe lead until the third lap when he<br />\nget the necessary two hundred that the first step in this direction<br />\namong the contestants.<br />\ndropped his baton and stumbled.<br />\nIMPORTANT NOTICE<br />\nThe officials of the tournament Holden received the baton in<br />\nand twenty-six votes in the elec- will be a trip to Richmond in the<br />\nDean Ames' Office Hours<br />\ntoral college. In that case the con- spring.<br />\nare to be selected from among a iourth place, fifty yards behind the<br />\nBanquet Planned<br />\ntest will go to the House of RepMonday, Wednesday<br />\ngroup of men who have shown a foremost runner. When Marsters,<br />\nAnother innovation is planned,<br />\nresentatives for a vote by state.<br />\ngreat interest in Hopkins football. Georgetown's great half-miler, re12.30-1.00<br />\nMaryland is represented in the in the form of a larger annual banThe prizes, according to Mr. ceived the baton from Holden, he<br />\nRouse by three Republicans and quet. Formerly, banquets were<br />\nFriday, Saturday<br />\nKeyes, will be a good inducement was thirty yards to the -fear. He<br />\nthree Democrats and hence would held at the Barn, but this year, if<br />\nfor a large number of competitors. sprinted to the front and in the<br />\n9.00-10.00<br />\nnot have a vote. Seven other the proceeds from the remaining<br />\nThe best all-round man is to re- last lap opened up to win by 20<br />\nThe Dean will not see stustates are similarly deadlocked. concerts are good, the affair will<br />\nceive a gold watch; the other yards over Bernart, Cornell. Bosdents at any other hours than<br />\nThus, though Senator La Follette be held at some hotel. At this<br />\nwinners to receive medals. The ton College finished third. The<br />\nthese.<br />\ncould not be elected, he could dic- time, according to custom, officers<br />\ndate for this event will be deter- time was within two seconds of<br />\nfor the next year will be elected.<br />\nContinued on page 2 col. 5<br />\nmined in the near future.<br />\nContinued on page 3, col. 3.<br />\n\"Two months ago, no candidate<br />\nfor the coming presidential election was 'sitting prettier' than<br />\nPresident Coolidge, and then the<br />\nlid blew off Teapot Dome,\" said<br />\nMr. Frank R. Kent, political writer of the Baltimore Sun, in his address at the Assembly last Thursday. Mr. Kent spoke upon the<br />\ncorning campaign and estimated<br />\nthe possibilities for Success of the<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, MARCH 4,1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nMaybe So<br />\nOflate we have become conscience-stricken over our great<br />\nwaste of space on inconsequential<br />\nmatter and the astounding importance of a writer in the Baltimore<br />\nNews has added to our feeling of<br />\nunworthiness. Where as we offer<br />\nour readers nothing, which they receive with appropriate gratitude,<br />\nthis author answers the riddle of<br />\nthe centuries and in a single column reveals \"What Should be a<br />\nMan's Object in Life.\"<br />\n* * *<br /><br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME,'25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mana ger<br />\nA. J. McKAY,'26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON,'24<br />\nC. EUGENE TOVELL,'24<br />\nIII, '26<br />\nOTHO J<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br /><br />\nA COLLEGE TOWN<br />\nHopkins and Hopkins' activities have more friends now than ever<br />\nbefore. The Maryland football game, notable track successes and<br />\nother things have succeeded in transforming many citizens from<br />\nmere Baltimoreans to actual Hopkinsites. Hopkins does not yet<br />\nmean as much to Baltimore as Harvard means to Boston or the<br />\nUniversity of Pennsylvania means to Philadelphia. The inhabitants<br />\nof the Monumental City, however, are beginning to realize that they<br />\nhave a great University in their midst.<br />\nHopkins must soon capitalize on this realization. The end of<br />\nthis month marks the opening of the spring sport schedule. In order to carry out this schedule and to pay the guarantees it will necessitate, the athletic authorities must dispose of a large number of<br />\nseason tickets. The plan of campaign will be practically the same<br />\nas last year. The students will be formed into teams, competition<br />\nwill be held, and valuable prizes will be awarded to the group and<br />\nthe individual with the largest number of sales. This spring, however, the salesmen will have a more interested and more sympathetic<br />\ncitizenry to deal with.<br />\nOur track team is famous throughout the country; lacrosse has<br />\ngrown in popularity by leaps and bounds; the nine promises to be the<br />\nbest in years; the citizens of Baltimore are interested. Success depends solely upon the efforts of the undergraduates and there is no<br />\nexcuse for failure.<br /><br />\nTHE FUTILITY OF UNDERGRADUATE ACTIVITIES<br /><br />\nThe recent more or less lamented<br />\nBowery Ball called forth the following:<br />\nP. Sachs discovered the secret of<br />\nthe prevalent joy: \"Everybody felt<br />\nat home.\"<br />\nT. Whiteley, the demon contrib.,<br />\nsuggests that another Brewery Ball<br />\nbe held in the near future.<br /><br />\nSTETS01•0cP<br /><br />\nHats<br /><br />\n* * *<br />\nWith that familiar helping spirit<br />\nII. Goodwin, as a hint to the policy<br />\nof this column, quotes:<br />\nThe World is too much with us.<br />\n* *<br />\nThis business of long-range argument via quotation is too easy.<br />\nFor example we might reply:<br />\nThe World is so full of a number of things. . . . And we might<br />\nadd one of the good things, such<br />\nas the following excerpt from Mr.<br />\nBroun's column of February 16:<br />\nWe find much shrewd observation on modern tendencies in our schools in a book<br />\ncalled<br />\nMoves<br />\n\"Education<br />\nAhead,\" by Eugene Randolph<br />\nSmith.<br />\n\"Pupils who are continually marked,\" writes Mr. Smith,<br />\n\"soon become self-conscious<br />\nand calculating. They say not<br />\nwhat springs naturally from<br />\ntheir own experiences and<br />\nideas but what seems likely<br />\nto obtain a good mark. They<br />\nquite naturally and wisely play<br />\nupon the idiosyncracies of<br />\nthe teacher, quoting her book<br />\nif she has written one, her<br />\nfavorite authority if she<br />\nhasn't. There is a certain<br />\nstimulus to hypocrisy in such<br />\ndealings, a tendency toward<br />\nintellectual dishonesty that it<br />\nis unfortunate to encourage.<br />\nThere is also of necessity an<br />\nemphasis on the gap between<br />\npupils and teachers, on a kind<br />\nof rivalry that sometimes becomes antagonism. The pupil<br />\nbecomes a salesman. He sells<br />\nto the teacher as little knowledge as possible for as high a<br />\nmark as he can get.\"<br /><br />\nChristopher Morely is the latest to declare that undergraduate acAs a matter of fact, Mr. Goodtivities are useless. In an interview accorded a representative of the<br />\nwin,<br />\nstatistics prove that the maYale \"Daily News,\" the famous columnist and author. is reported as<br />\njority<br />\nof the quotations found in<br />\ndeclaring that the training to be derived from college publications<br />\nMaybe So are from Time and not<br />\nand the time spent in acquiring this training is not worth the effort. the New York World.<br />\n* * *<br />\nWe shall not attempt to refute these statements; that would be<br />\nThe Black and Blue Jay Staff<br />\npresumptuous. We will merely cite one of his points. Mr. Morely<br />\nare to wear little tokens<br />\nmembers<br />\nrelates that, while at Oxford, he went out for rowing but soon found<br />\ntheir<br />\nof<br />\ndignity on their watch<br />\nthat three hours spent every afternoon were not giving him what he<br />\nchains. The campus idiot suggests<br />\nwanted. After recovering from an illness he refused to row any that the NEWS-LETTER news hawks<br />\nmore and set out to do what he had come to college for; to make follow suit, using a hangman's<br />\nfriendships and th.us to get the most out of life. He believes that Noose on a scarlet Letter as the derowing prevented him then and that, now, college publications and sign. Connotations explained on<br />\nother undergraduate activities tend to prevent the average student request.<br />\nAlso the campus idiot wants to<br />\nor editor from so doing.<br />\nknow why Frank Kent, who spoke<br />\nWe wonder how many of the men that have engaged in Hop- on politics at last Thursday's askins activities will agree that their participation has prevented them sembly, didn't make his speech<br />\nbefore the Interfraternity Board.<br />\nfrom making friends.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nStyle and Ruality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED<br /><br />\nFOIL YOUNG<br /><br />\nM EN,<br /><br />\nJOHNS HOPKINS TANKMEN DEFEAT FRANK R. KENT ADDRESSES<br />\nLEHIGH<br />\nASSEMBLY<br />\nContinued from page 1<br />\nContinued from page 1<br /><br />\nsucceeded in winning a number<br />\nof seconds and thirds which kept<br />\nthe victory in doubt until the final<br />\nrelay.<br />\nRaleigh was the greatest point<br />\nwinner for Lehigh. He placed<br />\nfirst in the backstroke and second<br />\nin the 40-yard dash. Astarti was<br />\nby far the best in the.fancy diving.<br />\nRidge Howard had no trouble<br />\nin winning the plunge, with Hambleton, another Blue Jay, in second place.<br />\nWith Welch's lowering of Rowland's record for the 40-yard dash<br />\nand the 160-yard relay mark<br />\nequaled; Bahlke lowering Coady's<br />\nold record by over seven seconds,<br />\nthe Johns Hopkins present undergraduates might well be proud,<br />\nfor the members of this team have<br />\nlowered or equalled every Hopkins swimming mark with the exception of the 200-yard relay,<br />\nwhich record was established last<br />\nyear, by Coady, Lord, Buhrer and<br />\nWelch. Two of these men, Welch<br />\nand Lord, being on the team this<br />\nyear.<br />\nThe Black and Blue has now<br />\nwon three of the five dual meets<br />\nthis year, winning from Catholic<br />\nUniversity, Swarthmore and Lehigh, and losing to Brown and<br />\nRutgers.<br />\nSummary:<br />\n160-Yard Relay Race—Won by Hopkins<br />\n(Bahlke, Dunning, Lord and Welch);<br />\nsecond, Lehigh (Raleigh, Freeman,<br />\nPilot and Travis). Time, 1.22 4-5.<br />\nFancy Diving—Won by Astarti, Lehigh;<br />\nsecond, Childs, Lehigh; third, Stone,<br />\nHopkins.<br />\n40-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Raleigh, Lehigh; third. Travis, Lehigh. Time,<br />\n19 1-5 seconds.<br />\nPlunge for Distance—Won by Howard,<br />\nHopkins; second, Hambleton, Hopkins ; third, DeLong, Lehigh. Time,<br />\n22 2-5 seconds. Distance, 60 feet.<br />\n220-Yard Swim, Free Style—Won by<br />\nBahlke, Hopkins; second, Reed, Lehigh; third, Stone, Hopkins. Time,<br />\n2 minutes, 34 1-5 seconds.<br />\n100-Yard Breast Stroke—Won by Pilot,<br />\nLehigh; second, Swanson, Hopkins;<br />\nthird, Freeman, Lehigh. Time, 1<br />\nminute, 21 3-5 seconds.<br />\n100-Yard Back Stroke—Won by Raleigh,<br />\nLehigh: second, McCleary, Hopkins ; third, Richards, Lehigh. Time,<br />\n1 minute, 18 3-5 seconds.<br />\n100-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Bahlke,<br />\nHopkins; third, Travis, Lehigh.<br />\nTime, 58 seconds flat.<br /><br />\ntate who would be the winner.<br />\nFew Actually Vote<br /><br />\nMr. Kent then gave some startling statistics concerning the<br />\nlarge number of non-voters in the<br />\nnation. In 1920, out of fifty-five<br />\nmillion persons qualified to vote,<br />\nonly twenty-six million went to<br />\nthe polls. \"The slogan, 'The people rule,' is a joke,\" he said, \"for<br />\nthe last President was elected by<br />\na majority of a minority.\" The<br />\nspeaker concluded by stating that<br />\nthe man who does not use his ballot is as much to blame for any<br />\ngovernmental corruptness as the<br />\ncrooked politician.<br />\nBefore Mr. Kent's talk, Mr. Norwood had charge of the Assembly.<br />\nThe chief announcement was the<br />\nregistering of Sergeant Frank's<br />\nprotest against snowballing the<br />\ndormitory windows. Other announcements of student affairs for<br />\nthe week were made.<br /><br />\nt hair is a<br />\n'<br />\nNeatly combed, ivell-‘p<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br />\nTubes-35c Jars-75c<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories,Inc.<br />\n750 Stanford Avenue Los Angeles, California<br />\nSend coupon for Free Trial Tube.<br />\n••••••••1<br /><br />\n0.1.1••<br /><br />\n11•1<br /><br />\nLABORATORIES.Inc.<br /><br />\nSTANDARD<br />\n760 Stanford<br />\nPlease send me free trial tube.<br />\nName<br />\nAddress<br /><br />\nMilt. I<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, MARCH 4, 1924<br /><br />\n3<br /><br />\nDR.<br />\nLAWRENCE<br />\nHENRY graduate—he led his class every<br />\nBAKER TO ENTER JOURyear except in 1915, when, as a<br />\nNALISM IN JUNE<br />\nsophomore, he ranked third. In<br />\nGreek Instructor to Devote Entire Time 1917, Dr. Baker received his A. B.<br />\nto Journalistic Work. Was Brildegree and continued his studies<br />\nliant Student<br />\nas Hopkins Scholar the following<br />\nDr. Lawrence H. Baker, instrucDamon—<br />\nyear. He was reappointed Hop\"What did Professor Smith mean<br />\ntor<br />\nin Greek, will sever a connecthis morning when he told you<br />\nkins<br />\nScholar in 1918, became Felthat no man could ever make a<br />\ntion of eleven years' standing with<br />\nsilk purse out of a sow's ear?\"<br />\nlow in Greek in 1919, and took his<br />\nthe Johns Hopkins University when<br />\nPythias—<br />\nPh. D. in 1920. In 1920 he was<br />\n\"He meant that I'd never be able<br />\nhe enters journalism at the concluto do good work with a poor pencil.<br />\nappointed<br />\nWhen you have tried Williams Shaving Cream your<br />\ninstructor in Greek, in<br />\nGuess I'll have to get a Dixon's<br />\nsion of this semester.<br />\nEldorado. Old Smity says it's the<br />\nverdict<br />\nwill be as favorable as is your verdict about the<br />\nwhich<br />\npost<br />\nhas<br />\nhe<br />\nserved till the<br />\nbest drawing pencil made.\"<br />\nnew Hinge-Cap. The heavier, faster-working Williams<br />\nDr. Baker has been doing jour- present itme. Dr. Baker<br />\nhas at<br />\nlather, the fact that Williams lubricates the skin, the fine<br />\nnalistic work in various periodicals times during<br />\nDIXONS<br />\nthe past four years<br />\ncondition of your face after the shave, these qualities<br />\nand daily papers for several years been<br />\nconnected with the English<br />\nmake men stick to Williams as faithfully as the Hingeal)<br />\nAD<br />\nat the same time carrying on his Department.<br />\nCap sticks to the tube. As regards the Hinge-Cap, here<br />\nteaching, and he has now decided to<br />\n\"the mastereiraw&amp;s,pencil\"<br />\nis an offer we make:<br />\n17 leads—all dealers<br />\ncontinue solely with his writing.<br />\nBOOTH BREAKS TWO MILE INs250 in Prizes<br />\n\"The chief reason for my abanDOOR MARK<br />\near the best sentence of ten words or less on the value of the<br />\ndoning university work,\" Dr. Baker<br />\nWilliams Hinge-Cap,we offer the following prizes: 1st prize $100;<br />\nContinued from page 1<br />\n2nd prize $50;two 3rd prizes,$25 each; two 4th prizes,$10 each;<br />\nsaid, \"is that I wish to get into a the world's record and Marsters'<br />\nsix 5th prizes, $5 each. Any undergraduate or graduate student<br />\nZEF&amp;_F'<br />\nffffEig<br />\ngZEITZEFI<br />\nrEZTIf two or more persons submit identical slogans<br />\nIs eligible,<br />\ncalling which offers greater oppor- time of 1.55 was within<br />\ndeemed worthy of prizes, the full amount of the prize will be<br />\na second<br />\nawarded to each. Contest closes at midnight March 14, 1924.<br />\ntunities for the utilization of my lit- of the indoor half-mile mark.<br />\nWinners will be announced as soon thereafter as possible. Submit any number of slogans but write on one side of paper only,<br />\nputting name, address, college and class at top of each sheet.<br />\nerary powers. I want something less<br />\nHills and Gates Break Records<br />\nAddress letters to Contest Editor, TheJ.B. Williams Co.,Glastonbury, Conn.<br />\nconfining and less restraining than<br />\nHills of Princeton broke his<br />\nteaching.<br />\nown indoor record for the 16 lb.<br />\nCLOTHIERS<br />\nWriting Circumscribed<br />\nshotput with a heave of 46 feet.<br />\n\"It is quite true that in profes- 3-4 of an inch. Beattie, a teamHABERDASHERS<br />\nsorial work one has certain chances mate was second and Plansky of<br />\nfor writing, but here the writing Georgetown was third.<br />\nGates,<br />\nThe new Hinge-Cap on<br />\n315 Charles St. North<br />\nthat one does_ is considerably cir- Princeton, this afternoon won the<br />\ncumscribed by the demands of the —5-1b. weight throw with a heave<br />\nIWIFIF131P<br />\nvarious technical journals. In these cf over forty-nine feet. Hills finit is the digging into the sediment, ished in third position.<br />\nSPARE TIME POSITIONS<br />\nsilt and filth of bygone ages and<br />\nThe meet was won by PennsylFOR STUDENTS<br />\nmusty tomes which counts for vania, last year's winners with a<br />\nGreatest opportunity, \"Life of everything, whereas the power to total of 21 1-3 points. Yale and<br />\nwill lecture on 'Bird Banding at<br />\nYoung Rhees, the student in<br />\nWoodrow Wilson\" by Josephus write interestingly is more of a dis- Princeton tied for second honors<br />\nITomewood.\"<br />\nquestion,<br />\naccording to press recredit<br />\nthan<br />\nan<br />\nadvantage.<br />\nwith 20 points. Georgetown was<br />\nDaniels, Secretary Navy, AssociaThe<br />\nmeeting<br />\nwill<br />\ntake<br />\nplace<br />\ntoports,<br />\nwas<br />\n\"ousted\" because his<br />\n\"Then,<br />\ntoo,<br />\nmy<br />\nposition<br />\nas a fourth and Penn State fifth. Hopte of Former President. Big book<br />\nmorrow<br />\nat<br />\nP.<br />\n3<br />\nM.<br />\nin<br />\nRoom<br />\n112,<br />\n\"advanced<br />\nideas\"<br />\ndid not meet with<br />\nteacher<br />\nof<br />\nGreek<br />\nis<br />\nsomewhat dif- kins with 7 1-9 points finished in<br />\nhandsomely illustrated, low price.<br />\nGilman<br />\nHall.<br />\nThe<br />\nlocal<br />\nnaturalists'<br />\nthe<br />\napproval<br />\nof<br />\nProfessor<br />\nForbes,<br />\nferent<br />\nfrom<br />\nthat<br />\nof<br />\nmost other in- ninth position, followed by SyraBest terms to representatives.<br />\nclub<br />\nis<br />\nattracting<br />\nmuch<br />\ninterest<br />\nthis<br />\ninstructor<br />\nin<br />\nphilosophy.<br />\nRhees'<br />\nstructors.<br />\nThe field of the Classics cuse, Harvard, and others of the<br />\nCredit given. Send for free outseason<br />\non<br />\nand<br />\noff<br />\ncampus.<br />\nthe<br />\nown<br />\nstatement<br />\non<br />\nthe<br />\nmatter<br />\nwas<br />\nfit at once. Make money fast. manifests certain aspects which ren- twenty-three colleges and univerMany<br />\npersons<br />\nhave<br />\nbenefited<br />\nby<br />\nthe<br />\nreported<br />\nto<br />\nbe:<br />\nAuthorship is guarantee of au- der the work of one who teaches sities entered in the meet.<br />\nscientific lectures given under the<br />\n\"I am an anarchist. This is why<br />\nLatin or Greek in the present day<br />\nthenticity.<br />\nunusually trying. The attitude of FOUR LECTURES TO BE auspices of the club. It is expected I am barred from the course.\"<br />\nUNIVERSAL HOUSE,<br />\nthat a large audience will enjoy the<br />\nmodern generations toward the<br />\nGIVEN BY NATURALISTS<br />\nMr. Hammond, commenting on<br />\nCollege Dept.<br />\nlectures<br />\nat the meeting tomorrow.<br />\nClassics presents one difficulty to<br />\nFIELD CLUB<br />\nthis statement, said:<br />\n1010 ARCH STREET<br />\nwhich is added a second in the fact<br />\nPhiladelphia, Pa.<br />\nThe program for the meeting of<br />\nHOPKINS PROF TAKES ONLY \"Of course, many professors<br />\nthat the traditions of the so-called the Naturalists' Field<br />\nClub tomorteaching philosophy are asses; but<br />\nGENTLE ANARCHISTS IN<br />\nWADERS authorities in the field are painfully row is an unusually attractive one.<br />\nEBGRAUERS •—• PRMTERS<br />\nCLASSES<br />\nfew would bar a man from classes<br />\nantiquated so far as concerns the Four lectures,<br />\nall on very interestInterviewed on the recent sus- because he happened to be an Anpresent pedagogical problem. All ing scientific subjects,<br />\nwill be pre- pension of undergraduates from archist. Perhaps Rhees carried his<br />\nthis, however, makes an interesting sented. R.<br />\nH. Luce will lecture on classes in ethics at the University views about the abolition of law<br />\ntopic for a magazine article which \"A<br />\nDeserted Beaver Dam,\" Bruce of Rochester, Mr. Hammond, eth- and order into the classroom. He<br />\nI plan to come out a little later on. Lineburg will<br />\ndeliver an address on ics instructor at Homewood, inti- may have thrown bombs or chairs<br />\nSmall Enrollment<br />\n\"Implements of Insects\"; Everett mated that the political views about during lectures, which would<br />\n\"The small enrollment of the C. Myers will talk on \"Symbiosis should not affect his classroom<br />\nexplain Professor Forbes' attiundergraduate Greek department in Hydra,\" and Everett C. Myers standing.<br />\ntude.\"<br />\nhas never justified the employing<br />\nof another man to help me in this<br />\nwork. Therefore I have had to<br />\nconduct many classes each year<br />\nmyself. Last year I taught 19<br />\nhours in Greek alone. With a<br />\nschedule so heavy, one can do little research or anything else. It<br />\nPrinters of<br />\nis quite doubtful whether a man<br />\ncrhe Johns Hopkins'<br />\nof average health could endure<br />\nNE11)S-LETTER<br />\nlong the strain of talking some<br />\nfour or five hours which this enLOMBARD and SOUTH STREETS tails. My physician has many<br />\ntimes urged me to seek a change<br />\nof vocation to rid myself of this<br />\nlabor alone, and at last I am following his directions.<br />\n\"Despite the problem they presented, I have always enjoyed my<br />\nclasses and have felt that both the<br />\nstudents and I have profited from<br />\nthem intellectually. Last year, my<br />\nbanner year, I could point to an<br />\nimprovement of some 300 per cent<br />\nOf course you know that<br />\nin enrollment since I'took over the<br />\nThe Barn is handling orders<br />\nwork.<br />\nfor our clothes again this<br /><br />\nWhat is your Verdict?<br /><br />\nPayne &amp;Merrill<br /><br />\nWill<br />\niams<br />\nShaving Cream<br /><br />\nsE5<br /><br />\ntarthe<br />\nthe<br />\nfive<br />\note,<br />\n, to<br />\n)eo'for<br />\nby<br />\n['he<br />\nhat<br />\nalanY<br />\nthe<br /><br />\n'or)1y.<br />\nthe<br />\ntk's<br />\nthe<br />\nanfor<br /><br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br /><br />\n211-213 E.. Baltimore St.<br /><br />\nEleven Years at Hopkins<br /><br />\n\"Having spent some eleven<br />\nyears at Hopkins as student and<br />\nteacher, I have made many friends<br />\n—and enemies—among the students and faculty. Both have given me a pleasure—although of different kinds—which I shall miss<br />\nwhen I do not see them so frequently.\"<br />\n• Dr. Baker was a brilliant student both as an undergraduate and<br /><br />\n\"What a difference<br />\njust a few cents make!\"<br /><br />\nFATIMA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 4, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nMaybe So=<br />\nOflate we have become conscience-stricken over our great<br />\nwaste of space on inconsequential<br />\nmatter and the astounding importance of a writer in the Baltimore<br />\nNews has added to our feeling of<br />\nunworthiness. Where as we offer<br />\nour readers nothing, which they receive with appropriate gratitude,<br />\nthis author answers the riddle of<br />\nthe centuries and in a single column reveals \"What Should be a<br />\nMan's Object in Life.\"<br />\n* *<br /><br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME,'25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nA. J. McKAY,'26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 4, 1924<br /><br />\nA COLLEGE TOWN<br />\nHopkins and Hopkins' activities have more friends now than ever<br />\nbefore. The Maryland football game, notable track successes and<br />\nother things have succeeded in transforming many citizens from<br />\nmere Baltimoreans to actual Hopkinsites. Hopkins does not yet<br />\nmean as much to Baltimore as Harvard means to Boston or the<br />\nUniversity of Pennsylvania means to Philadelphia. The inhabitants<br />\nof the Monumental City, however, are beginning to realize that they<br />\nhave a great University in their midst.<br />\nHopkins must soon capitalize on this realization. The end of<br />\nthis month marks the opening of the spring sport schedule. In order to carry out this schedule and to pay the guarantees it will necessitate, the athletic authorities must dispose of a large number of<br />\nseason tickets. The plan of campaign will be practically the same<br />\nas last year. The students will be formed into teams, competition<br />\nwill be held, and valuable prizes will be awarded to the group and<br />\nthe individual with the largest number of sales. This spring, however, the salesmen will have a more interested and more sympathetic<br />\ncitizenry to deal with.<br />\nOur track team is famous throughout the country; lacrosse has<br />\ngrown in popularity by leaps and bounds; the nine promises to be the<br />\nbest in years; the citizens of Baltimore are interested. Success depends solely upon the efforts of the undergraduates and there is no<br />\nexcuse for failure.<br /><br />\nThe recent more or less lamented<br />\nBowery Ball called forth the following:<br />\nP. Sachs discovered the secret of<br />\nthe prevalent joy: \"Everybody felt<br />\nat home.\"<br />\nT. Whiteley, the demon contrib..<br />\nsuggests that another Brewery Ball<br />\nbe held in the near future.<br />\n* * *<br />\nWith that familiar helping spirit<br />\nII. Goodwin, as a hint to the policy<br />\nof this column, quotes:<br />\nThe World is too much with us.<br />\n*<br />\nThis business of long-range argument via quotation is too easy.<br />\nFor example we might reply:<br />\nThe World is so full of a number of things. . . . And we might<br />\nadd one of the good things, such<br />\nas the following excerpt from Mr.<br />\nBroun's column of February 16:<br />\nWe find much shrewd observation on modern tendencies in our schools in a book<br />\ncalled \"Education<br />\nMoves<br />\nAhead,\" by Eugene Randolph<br />\nSmith.<br />\n\"Pupils who are continually marked,\" writes Mr. Smith,<br />\n\"soon become self-conscious<br />\nand calculating. They say not<br />\nwhat springs naturally from<br />\ntheir own experiences and<br />\nideas but what seems likely<br />\nto obtain a good mark. They<br />\nquite naturally and wisely play<br />\nupon the idiosyncracies of<br />\nthe teacher, quoting her book<br />\nif she has written one, her<br />\nfavorite authority if she<br />\nhasn't. There is a certain<br />\nstimulus to hypocrisy in such<br />\ndealings, a tendency toward<br />\nintellectual dishonesty that it<br />\nis unfortunate to encourage.<br />\nThere is also of necessity an<br />\nemphasis on the gap between<br />\npupils and teachers, on a kind<br />\nof rivalry that sometimes becomes antagonism. The pupil<br />\nbecomes a salesman. He sells<br />\nto the teacher as little knowledge as possible for as high a<br />\nmark as he can get.\"<br /><br />\nTHE FUTILITY OF UNDERGRADUATE ACTIVITIES<br />\nChristopher Morely is the latest to declare that undergraduate acAs a matter of fact, Mr. Goodtivities are useless. In an interview accorded a representative of the<br />\nwin,<br />\nstatistics prove that the maYale \"Daily News,\" the famous columnist and author. is reported as<br />\nof the quotations found in<br />\njority<br />\ndeclaring that the training to be derived from college publications<br />\nMaybe So are from Time and not<br />\nand the time spent in acquiring this training is not worth the effort. the New York World.<br />\n* * *<br />\nWe shall not attempt to refute these statements; that would be<br />\nThe Black and Blue Tay Staff<br />\npresumptuous. We will merely cite one of his points. Mr. Morely<br />\nare to wear little tokens<br />\nmembers<br />\nrelates that, while at Oxford, he went out for rowing but soon found<br />\nof<br />\ntheir<br />\ndignity on their watch<br />\nthat three hours spent every afternoon were not giving him what he<br />\nchains. The campus idiot suggests<br />\nwanted. After recovering from an illness he refused to row any that the NEWS-LETTER news hawks<br />\nmore and set out to do what he had come to college for; to make follow suit, using a hangman's<br />\nfriendships and thus to get the most out of life. He believes that Noose on a scarlet Letter as the derowing prevented him then and that, now, college publications and sign. Connotations explained on<br />\nother undergraduate activities tend to prevent the average student request.<br />\nAlso the campus idiot wants to<br />\nor editor from so doing.<br />\nknow why Frank Kent, who spoke<br />\nWe wonder how many of the men that have engaged in Hop- on politics at last Thursday's askins activities will agree that their participation has prevented them sembly, didn't make his speech<br />\nbefore the Interfraternity Board.<br />\nfrom making friends.<br /><br />\nSTETSONOcP<br /><br />\nHats<br />\nStyle and Quality are the two essentials of<br />\na good hat, but it does not pay to buy one<br />\nwithout the other. All Stetsons have both.<br />\nSTYLED<br /><br />\nMEN,<br /><br />\nFOR, YOUNG<br /><br />\nJOHNS HOPKINS TANKMEN DEFEAT FRANK R. KENT ADDRESSES<br />\nLEHIGH<br />\nASSEMBLY<br />\nContinued from page I<br />\nContinued from page 1<br /><br />\nsucceeded in winning a number<br />\nof seconds and thirds which kept<br />\nthe victory in doubt until the final<br />\nrelay.<br />\nRaleigh was the greatest point<br />\nwinner for Lehigh. He placed<br />\nfirst in the backstroke and second<br />\nin the 40-yard dash. Astarti was<br />\nby far the best in the.fancy diving.<br />\nRidge Howard had no trouble<br />\nin winning the plunge, with Hambleton, another Blue Jay, in second place.<br />\nWith Welch's lowering of Rowland's record for the 40-yard dash<br />\nand the 160-yard relay mark<br />\nequaled; Bahlke lowering Coady's<br />\nold record by over seven seconds,<br />\nthe Johns Hopkins present undergraduates might well be proud,<br />\nfor the members of this team have<br />\nlowered or equalled every Hopkins swimming mark with the exception of the 200-yard relay,<br />\nwhich record was established last<br />\nyear, by Coady, Lord, Buhrer and<br />\nWelch. Two of these men, Welch<br />\nand Lord, being on the team this<br />\nyear.<br />\nThe Black and Blue has now<br />\nwon three of the five dual meets<br />\nthis year, winning from Catholic<br />\nUniversity, Swarthmore and Lehigh, and losing to Brown and<br />\nRutgers.<br />\nSummary:<br />\n160-Yard Relay Race—Won by Hopkins<br />\n(Bahlke, Dunning, Lord and Welch);<br />\nsecond, Lehigh (Raleigh, Freeman,<br />\nPilot and Travis). Time, 1.22 4-5.<br />\nFancy Diving—Won by Astarti, Lehigh;<br />\nsecond, Childs, Lehigh; third, Stone,<br />\nHopkins.<br />\n40-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Raleigh, Lehigh; third. Travis, Lehigh. Time,<br />\n19 1-5 seconds.<br />\nPlunge for Distance—Won by Howard,<br />\nHopkins; second, Hambleton, Hopkins ; third, DeLong, Lehigh. Time,<br />\n22 2-5 seconds. Distance, 60 feet.<br />\n220-Yard Swim, Free Style—Won by<br />\nBahlke, Hopkins; second, Reed, Lehigh; third, Stone, Hopkins. Time,<br />\n2 minutes, 34 1-5 seconds.<br />\n100-Yard Breast Stroke—Won by Pilot,<br />\nLehigh; second, Swanson, Hopkins;<br />\nthird, Freeman, Lehigh. Time, 1<br />\nminute, 21 3-5 seconds.<br />\n100-Yard Back Stroke—Won by Raleigh,<br />\nLehigh: second, McCleary, Hopkins ; third, Richards, Lehigh. Time,<br />\n1 minute, 18 3-5 seconds.<br />\n100-Yard Dash, Free Style—Won by<br />\nWelch, Hopkins; second, Bahlke,<br />\nHopkins; third, Travis, Lehigh.<br />\nTime, 58 seconds flat.<br /><br />\ntate who would be the winner.<br />\nFew Actually Vote<br /><br />\nMr. Kent then gave some startling statistics concerning the<br />\nlarge number of non-voters in the<br />\nnation. In 1920, out of fifty-five<br />\nmillion persons qualified to vote,<br />\nonly twenty-six million went to<br />\nthe polls. \"The slogan, 'The people rule,' is a joke,\" he said, \"for<br />\nthe last President was elected by<br />\na majority of a minority.\" The<br />\nspeaker concluded by stating that<br />\nthe man who does not use his ballot is as much to blame for anY<br />\ngovernmental corruptness as the<br />\ncrooked politician.<br />\nBefore Mr. Kent's talk, Mr. Norwood had charge of the Assembly.<br />\nThe chief announcement was the<br />\nregistering of Sergeant Frank's<br />\nprotest against snowballing the<br />\ndormitory windows. Other announcements of student affairs for<br />\nthe week were made.<br /><br />\nNeatly combed, Well4 hair is a<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br /><br />\nTubes-35c<br /><br />\nJars-75c<br /><br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories,Inc.<br /><br />\n750 Stanford Avenue Los Angeles, California<br /><br />\n00<br />\nSend coupon for Free Trial Tube. .<br />\n=.11/<br /><br />\n11••<br /><br />\n• .M1M.•<br /><br />\n•<br /><br />\n1.10..<br /><br />\nIN=.•••<br /><br />\nSTANDARD LABORATORIES.Inc.<br />\nPlease send me free trial tube.<br />\nName<br />\nAddress<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, MARCH 4, 1924<br /><br />\n3<br /><br />\nDR.<br />\nLAWRENCE<br />\nHENRY graduate—he led his class every<br />\nBAKER TO ENTER JOURyear except in 1915, when, as a<br />\nNALISM IN JUNE<br />\nsophomore, he ranked third. In<br />\nGreek Instructor to Devote Entire Time 1917, Dr. Baker received his A. B.<br />\nto Journalistic Work. Was Brildegree and continued his studies<br />\nliant Student<br />\nas Hopkins Scholar the following<br />\nDr. Lawrence H. Baker, instrucyear. He was reappointed Hop\"What did Professor Smith mean<br />\ntor<br />\nin Greek, will sever a connecthis morning when he told you<br />\nkins<br />\nScholar in 1918, became Felthat no man could ever make a<br />\ntion of eleven years' standing with<br />\nsilk purse out of a sow's ear?\"<br />\nlow in Greek in 1919, and took his<br />\nthe Johns Hopkins University when<br />\nPythias—<br />\nPh. D. in 1920. In 1920 he was<br />\n\"He meant that I'd never be able<br />\nhe enters journalism at the concluto do good work with a poor pencil.<br />\nappointed<br />\nWhen you have tried Williams Shaving Cream your<br />\ninstructor in Greek, in<br />\nGuess I'll have to get a Dixon's<br />\nsion of this semester.<br />\nEldorado. Old Smity says it's the<br />\nverdict<br />\nwill be as favorable as is your verdict about the<br />\nwhich<br />\npost<br />\nhas<br />\nhe<br />\nserved<br />\ntill the<br />\nbest drawing pencil made.\"<br />\nnew Hinge-Cap. The heavier, faster-working Williams<br />\nDr. Baker has been doing jour- present itme. Dr.<br />\nBaker has at<br />\nlather, the fact that Williams lubricates the skin, the fine<br />\nnalistic work in various periodicals Limes during<br />\nthe past four years<br />\ncondition of your face after the shave, these qualities<br />\nand daily papers for several years been connected<br />\nwith the English<br />\nmake men stick to Williams as faithfully as the Hingeat the same time carrying on his Department.<br />\nCap sticks to the tube. As regards the Hinge-Cap, here<br />\nteaching, and he has now decided to<br />\n-the mastertharetVpencil\"<br />\nis an offer we make:<br />\n17 leads—all dealers<br />\ncontinue solely with his writing,<br />\nBOOTH BREAKS TWO MILE IN$250 in Prizes<br />\n11111•1111111EgaragaraailanillinaMMINIMP<br />\n\"The chief reason for my abanDOOR MARK<br />\nr or the best sentence of ten words or less on the value of the<br />\ndoning university work,\" Dr. Baker<br />\nWilliams Hinge-Cap,we offer the following prizes: 1st prize $100;<br />\nContinued from page 1<br />\n2nd prize $50; two 3rd prizes,$25 each; two 4th prizes,$10 each;<br />\nsaid, \"is that I wish to get into a the world's record and Marsters'<br />\nsix 5th prizes, $5 each. Any undergraduate or graduate student<br />\nIs eligible. If two or more persons submit identical slogans<br />\ncalling which offers greater oppor- time of 1.55 was<br />\ndeemed worthy of prizes, the full amount of the prize will be<br />\nwithin a second<br />\nawarded to each. Contest closes at midnight March 14, 1924.<br />\nWinners will be announced as soon thereafter as possible. Subtunities for the utilization of my lit- of the indoor half-mile mark.<br />\nmit any number of slogans but write on one side of paper only,<br />\nputting name, address, college and class at top of each sheet.<br />\nerary powers. I want something less<br />\nHills and Gates Break Records<br />\nAddress letters to Contest Editor. Thei.B. Williams Co.,Glastonbury, Conn.<br />\nconfining and less restraining than<br />\nHills of Princeton broke his<br />\nteaching.<br />\nown indoor record for the 16 lb.<br />\nCLOTHIERS<br />\nWriting Circumscribed<br />\nshotput with a heave of 46 feet,<br />\n\"It is quite true that in profes- 3-4 of an inch. Beattie, a teamHABERDASHERS<br />\nsorial work one has certain chances mate was second and Plansky of<br />\nfor writing, but here the writing Georgetown was third.<br />\nGates,<br />\nThe new Hinge-Cap on<br />\n315 Charles St. North<br />\nthat one does_ is considerably cir- Princeton, this afternoon won the<br />\ncumscribed by the demands of the '5-1b. weight throw with a heave<br />\nvarious technical journals. In these cf over forty-nine feet. Hills finit is the digging into the sediment, ished in third position.<br />\nSPARE TIME POSITIONS<br />\nsilt and filth of bygone ages and<br />\nThe meet was won by PennsylFOR STUDENTS<br />\nmusty tomes which counts for vania, last year's winners with a<br />\nGreatest opportunity, \"Life of everything, whereas the power to total of 21 1-3 points. Yale and<br />\nwill lecture on 'Bird Banding at<br />\nYoung Rhees, the student in<br />\nWoodrow Wilson\" by Josephus write interestingly is more of a dis- Princeton tied for second honors<br />\nIIomewood.\"<br />\nquestion,<br />\naccording to press recredit<br />\nthan<br />\nan<br />\nadvantage.<br />\nwith 20 points. Georgetown was<br />\nDaniels, Secretary Navy, AssociaThe meeting will take place to- ports, was \"ousted\" because his<br />\n\"Then,<br />\ntoo,<br />\nmy<br />\nposition<br />\nas a fourth and Penn State fifth. Hopte of Former President. Big book<br />\nmorrow at 3 P. M. in Room 112, \"advanced ideas\" did not meet with<br />\nhandsomely illustrated, low price. teacher of Greek is somewhat dif- kins with 7 1-9 points finished in<br />\nGilman<br />\nHall. The local naturalists' the approval of Professor Forbes,<br />\nBest terms to representatives. ferent from that of most other in- ninth position, followed by Syraclub<br />\nis<br />\nattracting<br />\nmuch interest this instructor in philosophy. Rhees'<br />\nstructors.<br />\nThe field of the Classics cuse, Harvard, and others of the<br />\nCredit given. Send for free outseason<br />\non<br />\nand<br />\noff the campus. own statement on the matter was<br />\nfit at once. Make money fast. manifests certain aspects which ren- twenty-three colleges and univerMany<br />\npersons<br />\nhave<br />\nbenefited by the reported to be:<br />\nAuthorship is guarantee of au- der the work of one who teaches sities entered in the meet.<br />\nscientific<br />\nlectures<br />\ngiven<br />\nunder the<br />\n\"I am an anarchist. This is why<br />\nLatin or Greek in the present day<br />\nthenticity.<br />\nauspices<br />\nof<br />\nthe<br />\nclub.<br />\nIt<br />\nis<br />\nexpected I am barred from the course.\"<br />\nunusually trying. The attitude of FOUR LECTURES TO BE<br />\nUNIVERSAL HOUSE,<br />\nthat a large audience will enjoy the<br />\nmodern generations toward the<br />\nGIVEN BY NATURALISTS<br />\nMr. Hammond, commenting on<br />\nCollege Dept.<br />\nlectures<br />\nat the meeting tomorrow.<br />\nClassics presents one difficulty to<br />\nFIELD CLUB<br />\nthis statement, said:<br />\n1010 ARCH STREET<br />\nwhich is added a second in the fact<br />\nPhiladelphia, Pa.<br />\nThe program for the meeting of<br />\nHOPKINS PROF TAKES ONLY \"Of course, many professors<br />\nthat the traditions of the so-called the Naturalists'<br />\nField Club tomorteaching philosophy are asses; but<br />\nGENTLE ANARCHISTS IN<br />\nPRMTERS •-• BIRDERS authorities in the field are painfully row is an unusually attractive one.<br />\nEUGRAUERS<br />\nCLASSES<br />\nfew would bar a man from classes<br />\nantiquated so far as concerns the Four lectures, all on<br />\nvery interestInterviewed on the recent sus- because he happened to be an Anpresent pedagogical problem. All ing scientific subjects,<br />\nwill be pre- pension of undergraduates from archist. Perhaps Rhees carried his<br />\nthis, however, makes an interesting sented. R.<br />\nH. Luce will lecture on classes in ethics at the University views about the abolition of law<br />\ntopic for a magazine article which \"A Deserted<br />\nBeaver Dam,\" Bruce of Rochester, Mr. Hammond, eth- and order into the classroom. He<br />\nI plan to come out a little later on. Lineburg will<br />\ndeliver an address on ics instructor at Homewood, inti- may have thrown bombs or chairs<br />\nSmall Enrollment<br />\n\"Implements of Insects\"; Everett mated that the political views about during lectures, which would<br />\n\"The small enrollment of the C. Myers will talk on \"Symbiosis should not affect his classroom<br />\nexplain .Professor Forbes' attiundergraduate Greek department in Hydra,\" and Everett C. Myers standing.<br />\ntude.\"<br />\nhas never justified the employing<br />\nof another man to help me in this<br />\nwork. Therefore I have had to<br />\nconduct many classes each year<br />\nmyself. Last year I taught 19<br />\nhours in Greek alone. With a<br />\nschedule so heavy, one can do little research or anything else. It<br />\nPrinters of<br />\nis quite doubtful whether a man<br />\ncrhe Johns Hopkins'<br />\nof average health could endure<br />\nNE -1DS,LETTER<br />\nlong the strain of talking some<br />\nfour or five hours which this enLOMBARD and SOUTH STREETS tails. My physician has many<br />\ntimes urged me to seek a change<br />\nof vocation to rid myself of this<br />\nlabor alone, and at last I am following his directions.<br />\n\"Despite the problem they presented, I have always enjoyed my<br />\nclasses and have felt that both the<br />\nstudents and I have profited from<br />\nthem intellectually. Last year, my<br />\nbanner year, I could point to an<br />\nimprovement of some 300 per cent<br />\nOf course you know that<br />\nin enrollment since I look over the<br />\nThe Barn is handling orders<br />\nwork.<br />\nfor our clothes again this<br /><br />\nWhat is your Verdict?<br /><br />\nEtfiT\"<br />\noRAD<br />\n's<br /><br />\nPayne &amp;Merrill<br /><br />\nWill<br />\niams<br />\nShaving Cream<br /><br />\nSES<br /><br />\ntarthe<br />\nthe<br />\nfive<br />\note,<br />\nto<br />\nco'for<br />\nby<br />\nIThe<br />\nhat<br />\n)alany<br />\nthe<br /><br />\n'or)1y.<br />\nthe<br />\ntk's<br />\nthe<br />\nanfor<br /><br />\nEleven Years at Hopkins<br /><br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats<br /><br />\n$30 up<br />\n$35 up<br /><br />\n211-213 E. Baltimore St.<br /><br />\n\"Having spent some eleven<br />\nyears at Hopkins as student and<br />\nteacher, I have made many friends<br />\n—and enemies—among the students and faculty. Both have given me a pleasure—although of different kinds—which I shall miss<br />\nwhen I do not see them so frequently.\"<br />\n• Dr. Baker was a brilliant student both as an undergraduate and<br /><br />\n\"What a difference<br />\njust a few cents make!\"<br /><br />\nFATIMA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 4, 1924<br /><br />\n4<br /><br />\nKNOCKLESS GAS EXPLAINED BOOTH AND CLARKE TO RUN<br />\neagorergroirdI<br />\nIN NATIONAL SENIOR<br />\nIt•<br />\nIN LECTURE TO ENpp,..mgiaraaref<br />\n=<br />\n•<br />\ntri:WW)<br />\n1:7•41/INNIMININgligr<br />\n—<br />\nd.-\"`\"<br />\n•<br />\nto<br />\n•<br />\n•=aormeffir<br />\n411,<br />\nTRACK MEET<br />\nGINEERS<br />\n4,<br />\npi vo<br />\n7.eicieZor.7.W.r.,-2,...<br />\nqw<br />\n••••-•agiawilsoonAl<br />\n•<br />\namiromititC4F .c....—<br />\nVerne Booth and Louis Clarke<br />\nA positive and inexpensive way<br />\neassower4,01. ir<br />\n41111111.11.101<br />\nFOUNTAIN PEN INK<br />\n,<br />\n(1<br />\nOMR ealraff<br />\nof eliminating the \"knocking\" of will be contestants in the Nationar e be'<br />\nOM.awd<br />\na<br />\niv\"<br />\noff<br />\nam'<br />\nmeet,<br />\nU.<br />\nal Senior Indoor A. A.<br />\n• gawn<br />\nararmaggwat;<br />\n\"The Ink That Made<br />\ninternal combustion engines, parsowtokippw<br />\none of the most important track<br />\n,41%at;al<br />\n0<br />\nThe Fountain Pen Possible ticularly automobile engines, was meets of the year, at New York,<br />\nexplained last Wednesday by Dr. on May 5. The Hopkins track<br />\n.All All<br />\nColors<br />\nSizes<br />\nThomas Midgely, Jr., vice-presi- stars have attracted a great deal<br />\nttIlIIiiIii,flijLI 1111<br />\ndent and general manager of the of attention this season in indoor<br />\nGeneral Motors Company. The track meets and they are expectNLY those who have<br />\n..<br />\n:1111111•1111 --.„.<br />\ned to make a good showing towas<br />\nengineer<br />\nthe<br />\nof<br />\naddress<br />\nOhio<br />\n:01!110<br />\nsmoked Melachrinos<br />\nmorrow evening. The National<br />\nhI<br />\nthe feature of the joint meeting of<br />\nSenior Indoor A. A. U. meet is<br />\njudge the quality<br />\n1.gtilA147i111(<br />\nthe Maryland section, American one of the chief matches at which<br />\n3EifyzityL.'\";;Cpc<br />\nof the finest Turkish<br />\nChemical Society, and the Balti- Olympic team material is selected.<br />\nIII! f<br />\ntobacco.<br />\nmore Section, American Society According to Coach Van Orman,<br />\nof Civil Engineers.<br />\nBooth and Clarke should have a<br />\nORIGINAL<br />\nAlthough of a thoroughly tech- good chance of becoming memrenderwas<br />\nthe<br />\ntalk<br />\nnical nature,<br />\nbers of the U. S. team should<br />\ned unusually interesting by hu- they emerge from tomorrow's<br />\nmorous sidelights of his own ex- contests victorious.<br />\nperiences.<br />\nClarke is entered in two races,<br />\nOne Cigarette Sold the World Over\"<br />\nThe speaker traced his own re- the seventy and three hundred<br />\nsearch for a substance, which yard dashes.<br />\nIn the seventywhen added to gasoline would yard dash the Black and Blue athentirely lete \\vill compete with such stars<br />\nform a combination<br />\ni. 0M 01112<br />\n\"knockless\"; however severe the as Murchison, McAllister, and<br />\n\"The King of Lubricants\"<br />\nconditions imposed upon it. He Bowman. of Syracuse, all of<br />\nfirst explained how the search for whom are nationally known<br />\nsuch a fuel came into being. The sprinters. Allan Woodring will<br />\nFor<br />\nSHERWOOD BROTHERS, INC.<br />\nFor<br />\ncompany which employed Dr. be Clarke's principal opponent in<br />\nLIBERTY ST.<br />\nGENERAL<br />\nFOUNTAIN<br />\nINIKEIEHNIKEENUMNINIE.EIHNNEMMINDIGEO Midgely had developed an auto- the three<br />\nhundred yard dash.<br />\nAT SARATOGA<br />\nUSE<br />\nPENS<br />\nmobile having a higher gear ratio Booth's chief rival in the two-mile<br />\nManufactured by<br />\nthan other cars, and running- more run will be Hahn„who has startLUNCHEON<br />\n&amp; HUMPHRIES<br />\nWIGHT<br />\nmiles on a gallon of gasoline. The led the sport world this winter by<br />\nBoys, the place to get your<br />\nTEA<br />\ndifficulty was that the engine defeating Joie Ray in three races.<br />\nmeals—and they are honALWAYS USE A<br />\nDINNER<br />\nat very low speeds. Ray is not entered in the two-mile<br />\n\"knocked\"<br />\nest-to-goodness meals, well<br />\nYELLOW CAB<br />\nResearch was then begun to find run tomorrow night, as he will<br />\nserve d, and reasonably<br />\nSPECIAL PARTIES<br />\nOR PHONE<br />\nthe substance which would make concentrate his efforts on win- 11.30 A. M.<br />\nuntil<br />\npriced—is at<br />\nthe gasoline \"knockproof.\"<br />\nmug the mile run.<br />\nVERNON 1212<br />\nPLAZA 6987<br />\n7.30 P. M<br />\nThe element first tried was ioHAIL THEM ANYWHERE<br />\ndine. This had the primary qual- 0 A K CONVENTION HELD AT<br />\nification of stopping \"knocks,\"<br />\nCENTER COLLEGE<br />\nbut it was ruled out by the group G. M. Shriver Represents Beta Circle<br />\nof Hopkins<br />\nof investigating engineers on acAdoption of a new constitution<br />\ncount of its cost. Besides being<br />\n1817 N. Charles St.<br />\nand individuality is offered here at prices that are not<br />\nexpensive, iodine has a strong was the main accomplishment of<br />\nand cannot be underquoted by any house at any time.<br />\n(Half Block below North Ave.)<br />\nchemical affinity for the metal the annual Omicron Delta Kappa<br />\n(I, Besides the reputation of an old-established firm<br />\nparts of the engine, and would convention, held on February 22<br />\nis back of each sale with a guarantee.<br />\nMgr.<br />\nNicholas Brown,<br />\nrender the engine useless in a and 23, at Center College. Acvery few months. Aniline was cording to G. M. Shriver, Jr., who<br />\nnext found to be one which had was the delegate of the Beta Circle<br />\nDRAPERIES<br />\nDECORATIONS<br />\nthe desired property when mixed to the convention, the new consti- FURNITURE<br />\nthe<br />\nover<br />\nimprovement<br />\nSTREET<br />\nan<br />\nis<br />\ntution<br />\n343 NORTH CHARLES<br />\nORTMAN<br />\nwith the engine fuel. This was<br />\nvalueless, likewise, because of the old one chiefly because of its re\"Queen Quality\" Home-made<br />\ninjurious and unpleasant fumes quirements for membership in the<br />\nChocolates<br />\nFor order. The qualifications for adfrom the engine exhaust.<br />\nRENT A CAR<br />\nLuncheonette<br />\nIces<br />\nIce Cream<br />\nrequire distinguished<br />\nnow<br />\nmission<br />\nnext<br />\nthe<br />\ntelurium,<br />\nsimilar<br />\nreasons<br />\n227 N. Howard 518 N. Charles<br />\ndiscovered compound, was use- leadership in a particular college<br />\nDancing Every Afternoon at<br />\nCharles St.<br />\nless to the General Motors Com- activity and do not construe meditivities as sufficient for election.<br />\npany.<br />\nDODGES, 18c PER MILE<br />\nEach of the nine circles were FORDS, 12c PER MILE<br />\nfor<br />\nfound<br />\nfinally<br />\nThe substance<br />\nthe purpose was tetra-ethyl-lead, represented by a delegate at the<br />\nSpecial Reduced Rates for 50 Miles or More<br />\nwhich is fifty times as powerful as convention and many important<br />\naniline, and is so cheap that a gal- ocre participation in several acDRIVE IT YOURSELF CO.<br />\nlon of fuel can be treated for two measures were acted upon. BeVERNON 4049<br />\n1725 NORTH CHARLES ST.<br />\ncents. That the substance actu- cause of the many colleges petially stopped engine \"knocking\" tioning for 0. D. K. charters, a<br />\nwas shown by Dr. iMidgely on a definite expansion policy was forCibeXatter<br />\nThe Greetings ofa Fine Store<br />\nreal gas engine, which \"knocked\" mulated. In this respect, the peti‘341'18 H.St OSCAR<br />\n°WNERS<br />\nbadly before the introduction of tions of Hampton-Sidney College<br />\nTo the Students of a Fine University<br />\nitiDt<br />\n1*<br />\n'<br />\n•Cw4 VIP<br />\nthe treated gasoline, but ran were recommended to the general<br />\n29 E. BALTIMORE ST.<br />\nsmoothly after the improved fuel council for favorable action. A<br />\nAgents for JOHN B. STETSON HATS was lead into the cylinder.<br />\nmotion introduced to hold bi-anHOCHSCHILD.KOHN<br />\nand FRATERNITY BANDS<br />\nnual instead of annual conventions<br />\nwas defeated, the delegates believBE A NEWSPAPER CORRESPONDENT<br />\nthat the youthfulness of the<br />\ning<br />\nNOTICES<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nsociety, together with its rapid<br />\nCandidates and members<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nmeetannual<br />\nnecessitates<br />\ngrowth,<br />\nIs Taking the Country by Storm<br />\nof News-Letter Staff today<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nings.<br />\nA complete set in bright<br />\nin News-Letter office, 12.30.<br />\nNEWSWRITERS TRAINING BUREAU<br />\ncolors, 144 tiles. 116 countEvery delegate reported that<br />\ners, 8 racks, 2 dice, book of<br />\nBuffalo, N. Y.<br />\nrules and instructions: any<br />\nmembership in the 0. D. K. is<br />\none can learn the game in<br />\nBaseball Organization<br />\nten minutes. All in attracconsidered the highest honor to be<br />\ntive box, sent prepaid on<br />\nmeeting today at 4 P. M., in<br />\nher trip to Spain last summer.<br />\nCOSMOPOLITAN CLUB<br />\nreceipt of $1.00 (Canada<br />\nwon on the campus of his college.<br />\nand<br />\nCandidates<br />\n110 M. E.<br />\n25c extra).<br />\nMEETING<br />\nThe' chairman of the program<br />\nHOLDS<br />\nAssistant Managers report.<br />\ncommittee<br />\nwas G. A. Pacheco, of<br />\nLatin-American students enterThe Read Eagle Team this year<br />\nBolivia.<br />\nThis<br />\nwas the third of a<br />\nVery Attractive Black Satwill be coached by Joe Zoller, of tained at the last meeting of the<br />\nFellowship dinner,6 P. M.<br />\neen Mah-Jong Table Cover,<br />\nseries<br />\nof<br />\nprograms<br />\nhandled by<br />\nwith colored dragon delast year's varsity, who has volun- Cosmopolitan Club, which was<br />\ntonight, Friends Meeting<br />\nsigns, adjustable to any<br />\nvarious<br />\nthe<br />\nof<br />\nclub<br />\ncounter<br />\nmembers<br />\nfrom<br />\ntable:<br />\n16<br />\nsize card<br />\nHouse. Norman Thomas, of<br />\nteered to i nstruct the Hopkins held at the Friends Meeting<br />\nPockets, striking colored<br />\non<br />\nprospeak<br />\nof<br />\nparts<br />\nworld.<br />\nThe<br />\nwill<br />\nfirst<br />\nthe<br />\nNew York,<br />\nstitched edges. Extraorscrubs. It has not been decided<br />\ndinary value. Special price<br />\nHouse on last Saturday evening, gram was handled by the Chinese,<br />\n\"The Labor Movement and<br />\nyet whether to have a Red Eagle<br />\nCOMBINATION OFFER: We will<br />\nthe Student\".<br />\nde- and the second by the Russians.<br />\nsend prepaid one complete Mahteam or a Freshman Team; the at 8 o'clock. The program,<br />\njong set and table cover as deThe members of the Friends<br />\nLatin-Amertypically<br />\nbe<br />\nto<br />\nsigned<br />\nidea of a yearling team being sugscribed above on receipt of $2.50.<br />\nBlack and Blue Jay Busiwill entertain the CosmoMeeting<br />\ntalk<br />\na<br />\nof<br />\nprincipally<br />\nconsisted<br />\nican,<br />\ngested by applications for games<br />\nCHINA-AMERICAN IMPORTING<br />\nness Staff and candidates<br />\nClub<br />\npolitan<br />\nat its next semiProfessor<br />\nFlores,<br />\nCOMPANY<br />\nPastoriza<br />\nwith such a team from several col- by Dr.<br />\nWednesday at 12.30.<br />\nNew York<br />\nmonthly<br />\nmeeting.<br />\n111 West 68th St.<br />\non<br />\nCollege,<br />\nof Spanish at Goucher<br />\nleges, including Maryland.<br /><br />\nSANFORD'S<br /><br />\nA<br /><br />\nO<br />\ncan<br /><br />\nMELACHRINO<br /><br />\n\"The<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nDRIVE IT YOURSELF<br /><br />\n8c Co.<br /><br />\nr--<br /><br />\nMah-Jong<br /><br />\nTable Covers<br /><br />"}], "field_media_file": [{"target_id": 37841, "display": null, "description": null, "target_type": "file", "target_uuid": "0a898fd8-9e26-43fd-a061-887188f25558", "url": "http://digital.library.jhu.edu/system/files/2022-03/13110-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13110, "target_type": "node", "target_uuid": "715d1ebf-addd-467b-8752-880a53368a75", "url": "/node/13110"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "ce08deb9-26f7-4379-9ee1-a071bde7f495"}]}