{"mid": [{"value": 37423}], "uuid": [{"value": "9eca0246-3c31-4bfc-812a-10733d9bd4b2"}], "vid": [{"value": 37423}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13346-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. XXXIII, No. 18<br />\n<br />\nMARYLAND HARRIERS<br />\nWIN OVER HOPKINS<br />\n<br />\nOMEWOOD, BALTIMORE, MD., DECEMBER 4, 1928<br />\n<br />\nFIRST COTILLON TO<br />\nBE LED BY KEGAN<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nARYLAND OUT FOSTERS INTERRUP7 DESPERATE<br />\nTHEIR OWN FUNERAL FESTIVITIES<br />\n<br />\nJAYS FALL BEFORE SUPERIOR<br />\nPOWER OF GREAT MARYLAND TEAM, 26-6<br />\n<br />\nAniid the cheers of enthusiasts, ing edict that the corpse could not<br />\nthe jeers of opponents, the impre- be removed, from the hearse and Weakness of Hopkins Line Chief Contribution to<br />\nBiggest Recent<br />\ncations of officers of the law and further profaned by the impious<br />\nDefeat at Hands of Old Liners<br />\nthe curs.'; of delayed theatre-goers, hands of J. II. U..underkraduates.<br />\nSCHIEBEL SETS RECORD<br />\nThe good General, schooled, no CAPLAN'S SCORE FROM KICKOFF AT START<br />\na sturdy but not over-large continOF SECOND HALF PROVES SENSATION OF GAME<br />\ngent of Jay rooters and exponents doubt, by the exchange of pleasHopkins Star Easily Outruns<br />\nextraordinary .of college spirit in- antries between Poly and City less Lyons Is Other Luminary for Hopkins Eleven; Strader<br />\nField for Victory<br />\nInjured;<br />\ndulged in another parade Wednes- than a week iireidously, feared a<br />\nSnyder, Terrapin Back, Is Star<br />\nreinand<br />\nscrimmage,<br />\n\"general\"<br />\nindulging<br />\nhopes<br />\nnoisily<br />\nnight,<br />\nday<br />\nWednesday,<br />\nthe<br />\nBlack and<br />\nLast<br />\nMaryland had too much power<br />\nthat Were fore-doomed to come to forced himself with two inspectors<br />\nBlue Cross-Country team jourfor the Blue Jay team—therein lies as they ran down the field. When<br />\nlieutenants<br />\ncaptains<br />\nand<br />\nmore<br />\nand<br />\nnothing.<br />\nneyed to College Park to test out<br />\nwhole story. The Terrapins they reached the fifty-yard thark the<br />\nAn innovation was the use di than college students can count, in the<br />\nhe. strength of the Terrapins.. Led<br />\n29 first downs to the Jay's Blue jerseyed men began to take<br />\nearned<br />\nforce<br />\nof<br />\nand<br />\nthe<br />\ndignity<br />\naddition<br />\nto<br />\ncarabout twenty'appropriate signs<br />\nby Captain. Myers, the stfOng team<br />\n7 and' covered 425 yards by rushing out the remaining Terrapins until<br />\nried by as. many individuals from the praetorian presence.<br />\nof Maryland defeated the Jay harAfter fifteen minutes of singing, as compared to 66 yards for Hop- all but three of them were on the<br />\namong the hundred and fifty who<br />\nriers by a score of 20 to 35. Up<br />\nyelling, and similar evidences of a kins. Time and time again on the ground then Caplan put on some remarched.<br />\nuntil the time the' half distance<br />\nLiners serve steam, tore by the first, slipA scaffold for the burning of Mr. proper collegiate enthusiasm, a ma- same off-tackle play the Old<br />\nMarker - was passed it would have<br />\njority of the men turned their went through the Blue line for five ped off the secopd, and ran away<br />\non<br />\nCity<br />\nbeen<br />\nerected<br />\nTerrapin<br />\nhad,<br />\nbeen difficult to forecast the outfrom the third to cross the goal line<br />\nHall Plaza add left in the charge thoughts and consequently their or ten yards; time and time again<br />\ncome,,...-but after the mid-oint was<br />\na<br />\nmusketeers. But fifty feet toward the Homewood campus, husky Snyder of the Terrapins second later. A scOre from the<br />\nof<br />\n'three<br />\npasSed the victory of Maryland bekick-off! Jay fans went into hyswarriors froni Maryland turned up the C. E. Hall, pretzels, and beer. dragged several Jay tacklers four or<br />\ncame evident and aSsurea.<br />\nmembers five yards before , he was fi.nally terics as the two teams lined up for<br />\nconsiderate<br />\nthere<br />\nthe<br />\nFor<br />\n-work<br />\nof<br />\nthe<br />\nshort<br />\nand made<br />\n_<br />\n.<br />\n_<br />\nthe next •kick--off.<br />\n, From the first the -odds- Nvere<br />\nwork of Hopkins men, and the of the Varsity Club had prepared pulled down.<br />\nThe score triight have been closer<br />\nBright Spot<br />\nagainst the Jays.<br />\nthese delicacies for the war-worn<br />\nscaffold was burnt.<br />\nStartling Revelations Are<br />\nbit for two bad breajcszhanded the , The play was one on which the<br />\nMaryland had defeated the<br />\nAt Charles and Center Streets, and tired-footed paraders.<br />\nMade by Exams<br />\nBlue Jays had been coached all<br />\nstrong teams of Washington and<br />\nthe same,or another fifty farmers The'luckless cheer leader, under. Jay eleven. Tlzfirst one came<br />\nLee, and the U. S. Naval Academy, If freshmen can be considered as assailed the peaceful.parade of the the harsh necessity of returning to when Lyons made a beautiful run season and even though they came<br />\nand had lost to Virginia .Poly- men, much promise holds out for polite Hornewooders with eggs and safety certain parade properties, had through theline to cross the Ter- out on the long end of the score it<br />\ntechnic Institute only after a hard the future of mankind according to other accompaniments of a class to forego the pleasures of the jug, rapin's oal line only to have the provided at least one bright spot in<br />\nfought battle. On the other hand the results of the physical exams, rush (old style). In the ensuing but arrived in time to officiate at ba brought back to its starting the afternoon for the Jay fans. The<br />\nthe Jays had one victory and one given to 16 tons of freshmen. For, ,melee, a sign carried by a freshman the cremation of the Maryland ef- lace because one of the Jay line- Terrapins were completely fooled<br />\nmen were offside; the second came on the play. On the preceding kickdefeat to their credit. This meet nof only did the specimens of '32 was made away with, but finally was figy: The solemnity occurred<br />\nwhen Roberts interfered with Wetz- off Bobby Lyons had only followed<br />\nside the C. E. building.<br />\nbrought to a close the schedules of compare most favorably with those restored unharmed.<br />\nThe Varsity Club s oker-,.-they el as he was about to receive a pass the flying wedge which carried Capthe cross-country teams of both col-. of previous years physically, but The floats were..formed into a<br />\ncalled it that---Ino • up at about a over the goal line—everyone in the lan to score for ten yards when he<br />\nleges.<br />\nalso mentally. The freshmen dem- large circle on Lexington Street for<br />\nand everyone stands saw it but it slipped the at- suddenly cut off to the right. This<br />\nufon the Plaza.. quarter past e<br />\nSchiebel Leads<br />\nonstrated how much more intelli- the final 'onslaught<br />\n. • At the start Scniebel, who<br />\npyking had been prohibited on returned h e—presumably—in a tention of the referee. With these move earlier in the game on the<br />\nAll<br />\ngent the successive classes are beegree of sobriety. Per- two breaks'for the Jays instead part of the Hopkins quarterback<br />\nseemed to be in the pink of condistreet at this point. The \"Beat .varyin<br />\ncoming by increasing the majority the<br />\ntheir dreams regaled them of against them the score would had made the Old Liners a bit wary<br />\nMaryland\" sign in lead of the ha<br />\ntion, took.the lead, which he easily<br />\n\"of eleven, by which last year's enth visions of a sweeter aftermath have at least been a bit more close. of throwing themselves into the way<br />\nsucceeded in holding all through the<br />\nparade was ripped down ,as the<br />\ntering students favored the R. 0. T.<br />\nof the massed interference so that<br />\nMaryland Scores<br />\nto their activities than. the succeedrace...Nlyers was able to trail<br />\nPlaza was reached, and as the r<br />\nC.-in preference to physical training<br />\n'Maryland's first score came about Caplan got the full benefit of his<br />\ner„.s.-- rted to do their st<br />\nJ.WD ing day_br.ought forth,<br />\nSchiebel up- uutil_the_begimting_of<br />\nby five. The ,enrollmerd was 0the—Opening<br />\nniinurei<br />\nafter<br />\ne<br />\neven<br />\nteammates'a.'ssistan-ce.<br />\nhundred College Par rs,—well, A horse-drawn hearse, a horsethe last mile, at which time SchieT. C. 126, PT., 110'.<br />\ndrawn brouse of the vintaf 'of whistle. The Terrapins harreceived<br />\ncreated some excite nt.<br />\nJust after the sensational run by<br />\nbel lengthened his strict, ,and<br />\nThese freshmen proved them- Their boos an tsses greeted the 1880, the farno`us old Hup and the the kick-off and immediately began Caplan the Jay team<br />\nseemed to -take wings,and -flj,. From<br />\ngot a break<br />\nfaithful Hopkins indispensable tally-ho figured prom- to display the power, that charac- which might have changed the<br />\n• then on he gradually pulled away selves to be mightiest that ever cheers fro<br />\nentire.<br />\nterized<br />\ntheir<br />\nplay<br />\nduring<br />\n'the<br />\ninently<br />\nin<br />\nthe<br />\nprocession,<br />\nWhich<br />\nwas<br />\nof<br />\nscore considerably if it had been<br />\nfrom his opponent and easily' took took the exams by breaking the throats, and in turn the exertion<br />\ncontest. The Jay line seemed too<br />\n, first place. His time for the five strength test record with an aver- Bla and_Plue vocal chords was illuminated by. flares that were dis- weak. to stand up under the tre- taken off in the proper manner.<br />\nand three-quarters mile course war; age score of 571 -points. However ansferred from hurricanes of tributed all along the line of Intl-ch. mendpus drives of the -Raven team Roberts received the kick-off for<br />\npraise for their team and school to All participants are said to have enMaryland and fumbled the ball<br />\ntwenty:<br />\npine- injuntes and eighteen the sffhomores, -whose score<br />\nand soon the ball. was over the goal<br />\nthemselves-4=W_ _cheerjirssoaal of General joyed<br />\n_<br />\nAstataaw<br />\nwhen<br />\npkins tackeler -bit<br />\n_list<br />\nfoT-the<br />\nfirst<br />\nscore<br />\nOf<br />\n-The<br />\ngame.<br />\n,looking<br />\na<br />\no7tbe<br />\ns<br />\nten`pOintiTes<br />\nGaither's irrevocable _and- unwaver- leaders.<br />\nBialoskorsky recovered the ball fat'<br />\nThis time broke the previous recMcDonald,<br />\nhusky<br />\nright<br />\ntackle<br />\nof<br />\nthe<br />\nHopkins. Jay rooters were expect.<br />\nord for the course and lowered it banciliet season fight are undautit<br />\nOld Line team, was drawn out of<br />\nthat the average Radical Group Here<br />\ning a score but were sadly disapDella Upsilon To Be<br />\nfifteen seconds. _ The best previous ed. They cla<br />\nthe.line to the back-field and added<br />\ntime was made by Captain Myers in was boost iy the freshmen's high •<br />\nInstalled December 8 the extra point in a fine manner. pointed when the opportunity was<br />\nEffects Organization<br />\nspoiled ,by Madigan who intercept\"<br />\nthe Washington and Lee meet<br />\nscore on the forearm (grip)<br />\nHopkins received the subsequent<br />\nInvitations have been issued by<br />\ned a Jay pass on his own 25-yard<br />\nafternoon ten<br />\n•-Oral weeks ago.<br />\nength test and hold for example . Last Wednesday<br />\nkick-off and things began to look a<br />\nAfter' Schiebel had .breasted tl the present senior class which held graduate and undergraduate mem- the Pi Kappa Chi Fraternity to the bit better to.the Jay rooters.+ Lyons line. ,Maryland kicked poorly and<br />\nthe ball went to Hopkins on the 45tybers of the University formed a installation ceremony of the Johns<br />\ntape to carry off first place. t<br />\nthe previous record of 567 points, group known as \"The Radicals.\" Hopkins Chapter of the Delta Upsi- and Caplan took the ball within yard line. This time the Old Lintwo seconds elapsed lief° another<br />\nscoring<br />\ndistance<br />\nof<br />\nthe<br />\nRaven<br />\ngoal,<br />\nline. This noting the latter', strong handshak- The League for Industrial Democ- lon Fraternity, which is to succeed but were not successful in putting ers took the ball on downs and four<br />\ntran crossed , the fin<br />\nracy had written one of its mem- the Pi Chi's on the campus. These it over for a score. .In spite of the plays later Snyder made„a 65-yard<br />\nwas • Captain My rs of Maryland. ing qualifications.<br />\nconcerning the for- invitations have been extended to all fact<br />\nwho made the course in twenty-nine<br />\nUmberger was'.the mightiest of bers at Hopkins<br />\nthat they lost the ball the Jay run to score Maryland's third<br />\nmation of a local chapter here. An activities to attend a reception at the team had showed that they, too,<br />\ntouchdown.<br />\nminutes and forty seconds. .<br />\nhad<br />\nthe mighty with a score of 1011<br />\nScore Does Not Count<br />\norganization meeting was held in chapter house, 3100 Calvert Street, power and the game was not to be<br />\n•<br />\nSonic few more,seconds went by<br />\nhighest indiyear's<br />\nLast<br />\npoints.<br />\nSaturday -afternoon, December,8, at<br />\nSoon after this the Jay team<br />\n-before two Maryland- mem-BowR29.,Lir 315 Gilman<br />\nr*t.te<br />\n9231points. Th<br />\negtrillatrtettr<br />\n.<br />\nour-Vtlottc:<br />\nreal- pivir'atr'd`socceeded- n<br />\n-4min and 1-;Insey,- crossed_ the - lit vidual score xt as<br />\nquarter ended sherily after with the<br />\no'clOck. Ten students attended, the<br />\ntogether, to tie for third place. Fol- class of 1909, the first to take the greater part of them being from the served the guests.<br />\nball 'deep in Hopkins' territory and getting the ball on Maryland's 15That nighr a formal installation<br />\nlowing closely on their heels was exams, made the lowest score rethe score 7-0 in Maryland's favor. yard line. Bobby Lyons was leadolitical economy department.<br />\nbanquet will be held-at the Southern<br />\nRemsherg who took fifth place. ., corded, which was but 429 points.<br />\nThe opening of the second quar- ing the attack and was doing a<br />\nthe pur- Hotel, k which the speaker will be ter was about like the first: Mary- mighty-good job of it hurling passes<br />\nAfter some disusai<br />\nAnother tie was witnessed dur- The scores have steadily risen, culDawes, the<br />\nwhich got the Terrapin backs up in<br />\ning-ftlre- race, when Piumbley and<br />\nposes and. work Of the group were either Vice-president<br />\nland made a touchdown soon after<br />\nminating in the present record, and<br />\nHon. Charles Evans Htighes, or<br />\nthe air and running the ends for<br />\nWallett crossed the line with locked<br />\nsocial<br />\nthe<br />\nstudy<br />\nset forth. It is to<br />\nthe<br />\nwhistle<br />\nhad<br />\nblown.<br />\nFrom<br />\nthen<br />\npoints,<br />\n480<br />\nabout<br />\nthe<br />\nGeneral Lord, director of<br />\naverage<br />\nsubstantial gains. It was here that<br />\narms, to tie for si5ctft place.<br />\ncontrol of oil, coal, power, a`nd other budget. All three are active in the on until the end of the half the<br />\nHopkins got one of its two bad<br />\nThe average age of the class was<br />\nKelly Finishes<br />\nprogram<br />\nat<br />\nThe<br />\nindustries.<br />\nbasic<br />\nfraternity. All alumni of the Pi gains was continued on about even breaks: Lyons took the ball right<br />\nThe second Jay Harrier to cross eighteen, the same as last year. This<br />\npresent will be an educational one Kappa Chi and Delta Upsilon fra- terms; neither club having 'an ad- through the center of the line and<br />\n4- the finish line was, Captain Ke<br />\nis about four-tenths years below<br />\nwent over the goarline for what<br />\ndevoted to intensive study among ternities resident in the city are ex- vantage over the other.<br />\nEmerson was the next to complete<br />\nenterexamined<br />\nthe average of all<br />\neveryone thought was a score. This<br />\nthe run and one of the three Jays<br />\nthe few members with the ultimate pected to be present.<br />\nCaplan Makes Run<br />\nThe lowest age record<br />\nThe Hopking chapter will be the<br />\nThe first minute Of the second was not to belowever because one<br />\nwho succeeded in placing;Since only ing classes.<br />\npossibility, when the membership<br />\n'23 with<br />\nfifty-fourth of the national organithe first ten men crossing the line was made by the class of<br />\nhalf<br />\nsocialist<br />\nprovided both the-Hopkins and of the Jay linesmen was off-side<br />\nbringing<br />\nhas increased, of<br />\nlong favorand the score was disallowed. Hopare included in the scoring. 'Kibler, an average of 17.1 years. This rec- speakers before the campus. At zation. The Pi Chi's,<br />\nthe<br />\nMaryland<br />\nfansivith more excampus,<br />\nwere<br />\nably regarded on the<br />\nkins still had three plays on which<br />\nof Maryland, was the tenth and last oid was due to the conditions durcitement<br />\nmembers<br />\nthan<br />\nany<br />\nother<br />\nthe<br />\nof<br />\nfifteen<br />\nminone<br />\nmeeting<br />\nfirst<br />\neach<br />\nfounded in 1905. They are the<br />\nto make the score and it was on<br />\nscoring man to reach the line.<br />\ning the war. Lyddane and Isaacs, will be expected to make a report. to receive a national charter since utes. Once again. Hopkins was rethe last of these three that the secThe only casualty of, the day be- both fifteen, are the two youngest<br />\nceiving the kiik-off. The ball soar- ond unfortunate break<br />\nThe members are supposed to be Alpha Tau Omega in 1924.<br />\nfell Connell of 'Maryland. When<br />\noccurred.<br />\nfreshmen. Last year two freshmen<br />\ned high and straight right into the Lyons threw a perfect pass to Wetto the socialist<br />\nhe had completed approximately a<br />\ncommitted<br />\ndefinitely<br />\nsumof<br />\nnumber<br />\nsame<br />\nthe<br />\nmustered<br />\nsixth of the course, he pulled son,<br />\nhands of Howard Caplan. The zel who was over the goal line but<br />\npoint of view. As the chairman Blue Jay Orchestra<br />\ntendons in his left leg and w- mers.<br />\nsaid,\"We want to say definitely that To Contain Twelve Men diminutive,Jay back caught the hall as he was about to catch the ball<br />\nthereby compelled to drop out.<br />\nBerman carries the most weight we are socialists, that we believe in<br />\nWhen the Blue Jay Orchestra neatly and paused a moment to al- Roberts grabbed his arm and he<br />\nUnlike the four and one-half mile in the class, an avoirdupois of 228<br />\nsocialization of basic industries makes its first appearance of the low his team-mates to form into in- misied it. All Hopkins yelled \"inthe<br />\nTerrapins<br />\nthe<br />\ncourse at Hopkins,<br />\npounds, exceeding by one pound and the democratization of labor.\" season it will once more be the terference and then started down<br />\nterference\" but the referee did not<br />\nboast of a five and three-quarters<br />\nweightiest man of the sopho- Mr. Spicer.of the political economy famed \"Twin-Six\" of bygone the field with the ball securely<br />\nthe<br />\nis<br />\nit<br />\nlonger,<br />\n-mile route. Although<br />\nsee it that way so the ball went to<br />\nclass<br />\nthe<br />\nof<br />\nweights<br />\nyears,<br />\nlast<br />\nthree<br />\nfor<br />\nthe<br />\n'Not<br />\nThe<br />\nyears.<br />\nHopmores.<br />\ntucked under his arm. Up to the Maryland. The Terrapins scored<br />\ndepartment, was elected chairman of<br />\nprobably not as difficult as the<br />\nlast<br />\nthan<br />\nEnoch<br />\ndeparture<br />\nof<br />\nless<br />\nsince<br />\nthe<br />\nor<br />\nno<br />\n5<br />\npounds,<br />\naverage 138<br />\nkins course because it has<br />\ncenter of the field the Jaymen did once more before the contest was<br />\nthe Club.<br />\nLight, has there been a large group<br />\nstreams to cross, which is a difficult year. The heaviest class examined<br />\nmeeting of \"The Rad- in the Jays. The entire arrangement not leave their feet to take out any ended to make the score 26-6.<br />\nnext<br />\nThe<br />\nweight<br />\nfeature in itself.<br />\nwas '29 with an average<br />\nicals\" will be 'held at 1 P. M. on is complete now, with the exception of the Mryland tacklers, they<br />\nHoward Caplan and Bobby Lyons<br />\n.The summary follows:<br />\npounds. Motry who weighs<br />\n140<br />\nof<br />\nmerely brushed them out of the way<br />\nof a tuba player.<br />\nMonday, December 10.<br />\nContinued on Page 5, Col. 2<br />\n1. Schiebel, Johns Hopkins, 29.18;<br />\nContinued on Page 5, Col. 2<br />\nContivrard an Page 5, C°1. 3<br />\nPoorest Performance of Season<br />\nby Black and Blue<br />\n<br />\n\"Bill\" Kegan,\" president of<br />\nthe senior class, and captain of<br />\nthe lacrosse team, will lead- the<br />\nfigure at the First Cotillon<br />\nFriday evening. The affair<br />\nwill take place at Lehmann's<br />\nHall from ten 'til ,two.<br />\nThere will be a raise in the<br />\nprice of adniission over that<br />\nof other affairs of the past,<br />\nthe price being $3.50 a couple<br />\nor $2.50 stag. But the fact.<br />\nthat this affair will be on a.<br />\nhigher level than past functions i expected to compensate<br />\nfor the increase. Gold andl<br />\nsilver favors will be presented<br />\nand refreshments served.<br />\n<br />\nARE FRESHMEN HUMAN?<br />\nREAD THIS AND WEEP<br />\n<br />\n4111111,<br />\n<br />\n\fER 4, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMB<br />\n<br />\nTILDES110PlgISINSIETTE<br />\n<br />\nTHE BARNSTORMERS<br />\n<br />\nby \"BEN\"<br />\nThe, Barnstormers Club is by dramatic club should produce at<br />\n$2.00<br />\nfar the most. worthwhile organi- least two, and preferably three or<br />\nSubscriPtion<br />\n'<br />\nzation on the campus, but, as has four plays each year, and it isa<br />\nin<br />\nPostoffice<br />\nat the<br />\n,Entered as second-class matter December 3, 1909,<br />\n1879.<br />\nbeen said before, there is room fact that at many of our Cniver,<br />\nBaltimore, Md., under Act of Congress November 3,<br />\n.ities such as North Carolina'and<br />\nfor improvement.<br />\nJohns<br />\nof<br />\nstudents<br />\nthe<br />\nby<br />\nJune<br />\nto<br />\nOctober<br />\nthe number is far great,:<br />\nPublished semi-weekly from<br />\nThe policy which this organi- Cornell,<br />\nHopkins University.<br />\nAnother thing always an essenhas adhered to. for quite<br />\nzation<br />\nbe addressed to the BUSINESS MANAGER,<br />\nof producing but tial part of arty dramatic club's<br />\nBusiness communications should<br />\narticles should be sent to the MANAGING' some time, that<br />\nJohns Hopkins University. All the<br />\nis not likely to success is the possession of its<br />\n-CHIEF.<br />\nyear,<br />\na<br />\nEDITOR-IN<br />\nplay<br />\none<br />\nto<br />\ntions<br />\ncommunica<br />\n&arms; other<br />\n• produce either any Publicity for own theatre. For obvious reasons<br />\nUniversity 0100<br />\nthe University' or any real dra- this has been impossible in. the Telephone<br />\nmatic talent in die club itself, past, but since the Homewood<br />\nboth of which would be desirable. Playshop is now vacant, a valEDITORIAL DEPARTMENT<br />\nIt seems evident that if the Bar - uable opportunity presents itself.<br />\nEditor-in-Chief<br />\nstormers really .are earnest n<br />\nGnoacz E. BRNICS, JR., '29<br />\nThe many advantages which the<br />\ntheir desire to follow out their'<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nin the Hand- Playshop offers are rather self:'39<br />\nGuine,<br />\npublished<br />\nas<br />\n\"deal\"<br />\nGEORGE<br />\n'29<br />\nNzss,<br />\nW.<br />\nTimm.<br />\nto itself<br />\nbook, they must make a drastic evident. Being a building<br />\nAssociate Editors<br />\n'29<br />\nWOOD,<br />\nus<br />\n.amount<br />\nH.<br />\na<br />\ntremendo<br />\nRICHARD<br />\nit<br />\nprovides<br />\n'29<br />\nWILitiat II Darns;<br />\nchange in their policy.<br />\nROBERT S. BALM, '30<br />\nof privacy, a factor which cannot<br />\nIn that ever-ready. ,source of<br />\nEditors<br />\nJunior<br />\nbe taken too seriously; and which<br />\ninformation, *the Handboblz, We<br />\n, W. Purnell Hall. Jr.. '30<br />\nStewart L. Smith. '30<br />\nat the<br />\nE. Foster Dowell, '29<br />\nThe Barn- has never 'been possible<br />\ng:<br />\nfollowin<br />\nthe<br />\nfind<br />\nnarci B. Holley, '29<br />\nRichard G. Hunt, '31<br />\nthe<br />\nupon<br />\nis<br />\nit<br />\nAs<br />\ndireetly!<br />\nBarn.<br />\nIf. Garland Hershey, '29<br />\n'31<br />\nJr..<br />\ndraHarwood F. Mullikin.<br />\nstormersis an undergraduate<br />\nPaul W. Spear, '30<br />\nIrving K. Gordon,T29<br />\ntamp as4t-,'euldalle-v-iate the<br />\nGeorge H. Dowell, '31<br />\nto<br />\nmuch<br />\ndoes<br />\nivhich<br />\nclub<br />\n'31<br />\nmatic<br />\nDarmiger,<br />\n• Lewis<br />\nRobert F. Skutch, '30 •<br />\ncessity of paying a large rental<br />\nbring the University before the<br />\nStreets,<br />\nfor the Lyric or. any other dCmii<br />\nSouth<br />\nand<br />\nLombard<br />\nCompany,<br />\nPrinted by The Read-Taylor<br />\npublic eye. It is growing to be a<br />\nBaltimore. Md.<br />\ntown theatre, and the mere fact<br />\nis<br />\nit<br />\nfor<br />\nitself,<br />\nby<br />\nclass<br />\nclub in a<br />\nits possession would Undoubtof<br />\ncontemplating producing genuine<br />\nedly provide ,a powerful stimulti Hopkins plays written and staged<br />\nthat would effect a hearty reentirely by Hopkins talent.<br />\nsponse front the student body.<br />\nearnest.<br />\nin<br />\nis<br />\nt<br />\nIf this statemen<br />\nWhether or not the Barnstormers<br />\nthe.Barnstormers have set themVICTORY IN DEFEAT<br />\ndo take over the Playshop is still<br />\nselves a high mark, but it is one<br />\nrooters received lita problem. Reports vary pro -and<br />\nN•the eve of the Maryland fracas, Hopkins<br />\nlocal<br />\nour<br />\nof<br />\nwriters<br />\nsports<br />\nwhich if achieved, would amply<br />\nthe<br />\nfrom<br />\nhope<br />\nor<br />\ntie consolation<br />\ncon, but no reliable information<br />\nJays<br />\nthe<br />\nthat<br />\nadmitted<br />\nrepay any efforts made. It is tc<br />\ndailies. These typewriter thumping experts<br />\nhas...reached the campus.<br />\nfight but to certain defeat they<br />\nefno<br />\nwould put up their customary strong Raven eleven had conquered<br />\nbe regretted therefore, that<br />\nA rumor has been current that<br />\nwere surely doomed. For the powerful strong Washington and Lee<br />\nforts have been made in that dithe mighty Yale they had beaten the On the other hand, HopSwindell,--is to resign as<br />\n\"Pop\"<br />\n.<br />\nunderfoot<br />\nhas<br />\nVirginia<br />\none<br />\nno<br />\nthat<br />\ntrod<br />\nrection'. It is true<br />\nteam and had<br />\nsteam-rollered by St. John's.<br />\nbeen<br />\nhad<br />\nthe 'stormers. This is<br />\nof<br />\ncoach,<br />\nbefore,<br />\ndays<br />\nten<br />\njust<br />\nkins,<br />\nbeen discovered at -Hopkins of<br />\nweak, inexperienced and<br />\nCompared to Maryland, the Jays appeared<br />\ngreatly to beregretted, for it has<br />\na<br />\nhave<br />\ndidn't<br />\nthey<br />\nprea<br />\nexperts,<br />\nwrite<br />\nto.<br />\nfootball<br />\nability,<br />\npuny. In the opinion of the<br />\n; sufficient<br />\nbeen- due to \"Pop's\" devPtitur<br />\nchance<br />\nsentable play, and it is riot prohdefeat<br />\ncertain<br />\nthough<br />\nEven<br />\nup.<br />\ngive<br />\ntintorke,..tnergy that the club has<br />\ndidn't<br />\nseeh<br />\nJays<br />\nv<br />\ni..<br />\nable<br />\n--... But<br />\n'<br />\nbattled<br />\n.,one conclusion, they kept fighting.. They Time ,<br />\nbeen soTsuccessfitl in the past.<br />\nwas aim<br />\ninch of the way.<br />\nwill be found, but we are of the<br />\ntheir stronger, more powerful opponents every<br />\n\"Pop's\" example furnishes a strikhimself against the blue<br />\nopinion that if an attempt were<br />\nafter time, the phenomenal Snyder hurled concerted flank attacks<br />\ning instance of an alumnus acjerseyed lineiile Evans and. Roberts made<br />\nmade in' this direction, even<br />\nJays -fought. .<br />\n, on the Blue Jay Wings. Still.the,<br />\ntively- interested in an underkradcatise, the Hopkins.<br />\nthough' the result be crue,'<br />\nFacing overwhelming odds, fighting a bit a glorious victory.<br />\nnate aetity, and it is rtot unlikewon<br />\nthey<br />\ndefeat,<br />\nin<br />\nbecome<br />\nEven<br />\nwould<br />\nbattling.<br />\nrmers<br />\non<br />\nthe.Barnsto<br />\neleven kept<br />\n.hooks. It was rather<br />\nresignation vill pro.that •<br />\nly<br />\nNot a victory for the scoreboard or the record ilehning Odd5.--:- 'sasasëjs more<br />\nto<br />\n,<br />\nDO<br />\n• s<br />\ninterestm t<br />\n-1.--gdpeib-triumph-of-gcl-plut-lost_overw<br />\nduce a-s<br />\n.<br />\nface.<br />\npossibly<br />\nversity.<br />\ncolhl<br />\n- that any football team<br />\nclub; Such a slump would go<br />\nEven though the plays were<br />\n•<br />\nhard with- the •Barnstormers, and<br />\n,.<br />\nplainly<br />\nquite<br />\nshowed<br />\nand,<br />\ncrude<br />\nit behooves them to make .prep•<br />\nthe mark of the amateur, the net<br />\n• arations now for the selection of<br />\nON SECOND THOUGHT<br />\n.<br />\nresult would justify the sacrifice.<br />\nthe<br />\na successor, since the direction<br />\nopinion that<br />\nthe<br />\nventured<br />\nwe<br />\ncolumn,<br />\n-this<br />\nin<br />\nstands<br />\nAST week,<br />\nIn addition to this'the fact<br />\nthe downtown<br />\nand coachirig Of the plays coulil<br />\nstaging of another pre-game parade through<br />\nout that the plays selected-by the<br />\nstrongly objected to the exstreets was an unwise procedure. We<br />\nhardly be handled by the club it !<br />\ninsisted<br />\nWe<br />\npurposes.<br />\ng<br />\nadvertisin<br />\nalthough<br />\npast,<br />\nfor<br />\nthe<br />\n'stunners in<br />\nploitation of the student body<br />\nself. There are several members<br />\nthe heels of the St.<br />\non'<br />\nclosely<br />\nso<br />\nollowing<br />\nf<br />\nparade,<br />\nthat another<br />\nthe work - of professionals, have<br />\n:of the faculty here at the Coiner<br />\nJohn's demonstration, wOuld be \"ineffective.\"<br />\nmering<br />\noutstand<br />\nany<br />\nheld<br />\nof<br />\nbeen<br />\nwas<br />\nnot<br />\ncelebration<br />\nIn spite of our strenuout objections, the of Niollege spirit and<br />\nsity who are quite capable of car<br />\ns<br />\nitr-In recent years they have preanyhow. We were branded as demolisherbooed on every side and<br />\nrtiito ii this work, and.it is quite<br />\nand<br />\ntraitors to the cause. We were hooted<br />\nsented \"The Dictator'', ''His 'Maathletic work.<br />\nit?je that if one of .the iacurty<br />\n•savagely flayed by men prominent in<br />\nTailor<br />\n\"A<br />\njesty Dunker 43ean\",<br />\nally. On the<br />\nTike Baltimore Sun, we have found a true zen<br />\nly,e,re selected, the_stapd_-_,;,,<br />\nmettOr.4<br />\n. Ifft4TredM?\"ffic--aale7-1Iestr;-- aud -7-rte—Charn morning -following the parade,iher74<br />\n• ard. tO plays prOdtice.,1<br />\n—<br />\nheadline:<br />\nanyear<br />\nfollowing<br />\nthis<br />\n,<br />\nthe<br />\nMoreover<br />\npion\".<br />\nback page<br />\nHOPKINS GRID<br />\n,<br />\ns<br />\nother dud has .been selected,<br />\nPARADE STIRS<br />\nDespite '1)op's\" devotion, the<br />\n\"Hawthorne of the U. $. A.\" We<br />\nIRE OF MANY<br />\nfact<br />\n•<br />\nremains that he is busy with<br />\nthe<br />\nbut<br />\nknow little of this play,<br />\n—<br />\nand cannot always,<br />\nDelays Traffic, Makes<br />\ntitle is enough. It suggests mar- other affairs<br />\nneeded. A coaci,<br />\nwhen<br />\nhand<br />\non<br />\nbe<br />\nLate For Theater,<br />\nSome<br />\nmadgalloping<br />\ntial music, horses<br />\n..a.<br />\nOthers Miss Trains<br />\n..<br />\nThis who would be on the cantpubelts.<br />\nBrowne<br />\nSam<br />\nhand<br />\ndemuch<br />\ndescribed, in<br />\nbe present nlore regularly.<br />\nThen came a lengthy news article which<br />\ntype of play is, or should be, be- could<br />\nBaltimoreans. At the Lyric, Law.•<br />\n. tail, the hardships experienced by<br />\nwas<br />\nprovide for more regbaritone,<br />\nwould<br />\nThi.s<br />\nCompany<br />\nneath-the Barnstormers. It would<br />\nrence Tibbett, famous Metropolitan Opera half of the recital. At<br />\n• ular rehearsals and -would probbut<br />\nchool,<br />\n*<br />\nS<br />\nsinging. Many Of the concertgoers glissed<br />\nHigh<br />\na<br />\nfor<br />\n'suitable<br />\nbe<br />\narrivaudiences were late in<br />\nFord's and the Maryland TheatieS4rthe was confusion and pandeably smooth out a great many of<br />\nnot for a University.<br />\ning. At the North Avenue Market, all<br />\nthe rough spots. The fact that at<br />\n.<br />\nthat<br />\nhowever,<br />\nadmit,<br />\nmonium.<br />\nmust<br />\nWe<br />\nby The Sun:—<br />\nthe University of North Carolina<br />\nHere are some of the caustic comments made<br />\nNo<br />\nthere is a deaeth Of material.<br />\ntion . . . sucthe Pla.ymakers are under the di\"This year's edition of their annual demonstra<br />\nof<br />\nany<br />\ndesire<br />\nor<br />\n-.<br />\nexpect<br />\n-could<br />\none<br />\n-rooters.<br />\nnon<br />\nceeded in arousing the ire of many<br />\nrect supervision of certain memparade,<br />\nthe<br />\nof<br />\ns<br />\nbehind<br />\nD'Oeuxre<br />\nthe subtle Chef<br />\n\"As seven southbound cars crawled along<br />\n'<br />\nbers of the faculty, has undoubt.<br />\n..<br />\n.<br />\ncriticism<br />\nof open<br />\nO'Neill to be pro4iced, but at the<br />\nimpatience of the riders-reached the point<br />\nedly contributed to their great<br />\nrs . . .\"<br />\nconcertgoe<br />\nthe<br />\nwere<br />\nstandvehement<br />\nhiaer<br />\nmuc<br />\nrly<br />\na<br />\n\"Particula<br />\nsame time<br />\nthe goodwill and supsuccess.<br />\nRather a peculiar method of building up<br />\n.<br />\nard could be reached than that of<br />\nit?<br />\nwasn't<br />\nBaltimore,<br />\nof<br />\nof the citizens<br />\nS. A.\" Let us add that we do not mean.<br />\nU.<br />\nthe<br />\nof<br />\nrne<br />\n\"Hawtho<br />\nday, Magistrate James<br />\nmers UnAt the Central Police Station, the next<br />\nThere are several playwrights to criticize the Barnstor<br />\nfive University of Maryland.<br />\nR. Cadden, while reviewing the cases of<br />\njustly, for such has not been our<br />\nme\"happy<br />\na<br />\nstrike<br />\nplays<br />\nwhose<br />\nstatement:<br />\n- iitudinti, made this rather pertinent<br />\nto point<br />\ndium\". What fault would be purpose. We have tried<br />\nthese pre•gazne disturbances.\"<br />\n'- \".•-. . thepublic is getting.tired of<br />\nor out certain faults and to suggest<br />\nPlays,<br />\nGreen's<br />\nPaul<br />\nwith<br />\narousing<br />\nfound<br />\nof<br />\nInstead<br />\nYes, it was a wonderful Publicity stunt.<br />\neye to<br />\narousing public ire. Instead<br />\nthose of any of the younger writ- certain remedies, with 'an<br />\npublic interest, the parade succeeded in<br />\nfavorably on the game, it<br />\nthey have not heightening the already high<br />\nlook<br />\nalthough<br />\nto<br />\nwho,<br />\ners,<br />\nBaltimore<br />\nof<br />\ncitizens<br />\nthe<br />\nof causing<br />\nachieved their goal, are at least standard of the club. The Barnonly stirred their anger:<br />\nand burning torches<br />\nwell along the road? If this idea stormers have been very successTraffic snarls, dynamite caps, yelling rooters<br />\nno<br />\nthe people of Baltimore to<br />\nwere to be carried out, he Barn- ful in the past, and there is<br />\nare great fun once a year, but to subject<br />\nten days, constitutes nothing less<br />\nnot<br />\nshould<br />\nthey<br />\nwhy<br />\nreason<br />\nproduce<br />\nonly<br />\nnot<br />\nsuch a demonstration twice, within<br />\nstormers could<br />\n•<br />\nthan a public nuisance<br />\nbetter plays, but also more. In achieve even greater success in<br />\nwe<br />\nAnd<br />\nenough.\"<br />\nis<br />\nparade<br />\n\"one<br />\nweek,<br />\nlast<br />\n, As we remarked<br />\nour opinion the average college the future.<br />\nFOUNDED 1897<br />\n<br />\nThe Name<br />\non the Box<br />\nChristThe name on the box of your<br />\nway<br />\nthe<br />\nwith<br />\ndo<br />\nto<br />\nlot<br />\na<br />\nhas<br />\nmas gift<br />\nit<br />\nsees<br />\nman<br />\nit is received. And when a<br />\nknows<br />\nhe<br />\nlabeled \"Hamburgers'<br />\nbeen .<br />\nthere's something inside he's<br />\nHeadGift<br />\nyour<br />\nthis<br />\nMake<br />\nwanting.<br />\nquarters<br />\n<br />\nIsaac Hamburger<br />\nM. B. (). D.<br />\n-8‘ Sons<br />\nBaltimore at Hanover Sts.<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nIntelligence Test<br />\nInstructor — \"Life Insurance?\"<br />\nThe Class (at one man, -without heiiteition)-\"John Hancock\"<br />\nInstructor (beaming with J)_<br />\n\"Class dismissed. Your I. Q. is i3o.\"<br />\n<br />\nO<br />\n<br />\nL<br />\n<br />\n•<br />\n<br />\ni‘47.J6ieer,<br />\nE COMPANY<br />\nLIFE INSURANC<br />\nS<br />\n,<br />\nDOSTOPI.<br />\nOr<br />\n<br />\nMAS....081T<br />\n<br />\nbr<br />\nby<br />\nap<br />\nth<br />\ncc<br />\nYo<br />\ntat<br />\naf<br />\nTI<br />\nan<br />\nBa<br />\ntab<br />\ndr<br />\n. prt<br />\nof<br />\nwh<br />\nclu<br />\nho<br />\ntill<br />\n<br />\nyot<br />\ntha<br />\nyea<br />\nthe<br />\napr<br />\ntle<br />\nstoi<br />\nto I<br />\ntrte<br />\npre<br />\nIll'<br />\nof I<br />\nten<br />\n<br />\ntale<br />\nwot<br />\nto ,<br />\n<br />\nthat<br />\n<br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and LoinBuicks<br />\nbard St's, •<br />\nPLaza 6000.<br />\n. Chevrolets.<br />\n1723,25 N.<br />\nChryslers<br />\nCharles St.<br />\nVErnon 4049<br />\nHupmobiles<br />\n2402 Pennsylvania Ave<br />\nWillys-Knights<br />\n)0<br />\nLAfayette<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\n• hilt'<br />\n<br />\nunit<br />\n<br />\n'hop<br />\n<br />\n.e%<br />\nf<br />\n<br />\nir<br />\n<br />\n\"Friend of the Hopkins Malt\"<br />\n<br />\nchil<br />\nUnion<br />\n<br />\nTr-ust Company of Maryland<br />\n<br />\n( HARLES AND-111-21TrE STREETS-t .<br />\n\"On tR'e 13.-Otite of the Charles Street Bus\"<br />\nr<br />\n<br />\nankle-Yashionedetfords<br />\nHere's team work between the shoe builder<br />\nand your foot — a handtailored upper that<br />\nhugs your ankle and<br />\nbanishes the discomfort<br />\nof slipping at the heel.<br />\n1565<br />\nThe Uptown<br />\naack Alaska.<br />\nAlso Bros..<br />\n<br />\nI Ile<br />\n<br />\ncat<br />\n<br />\nTHE<br />\n<br />\nr<br />\n<br />\nUMITY OHOP<br />\nCollar Hug Clothes<br />\nBaltimore OaC tIbegvStfeetF<br />\n<br />\nrie<br />\n<br />\nIlli<br />\n<br />\npa:<br />\nkit<br />\ncal<br />\n<br />\nf<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETFER, DECEMBER 4, 1928<br />\nESTASLISHED ISIS<br />\n<br />\nTHE MAIL BAG<br />\nIN REPLY TO \"BEN\"<br />\n<br />\n•<br />\n<br />\n-<br />\n<br />\n—AND ANOTHER<br />\netc., would be supplied free, which<br />\nof course, was not opposed.<br />\nMc Editor of the Milvs-1,imER. 1.iditor of the NEWS-LETTER:<br />\nTo conclude, thiS_Ietter is not inDear sir:<br />\n1/ear Sir: •<br />\ntended to justify a parade preceding<br />\nYour managing edifor haZ- \"' Several weeks ago, and in fact, the Maryland game, but to advise<br />\nbrought to my attention an article since that time there have appeared the editor that he should either get<br />\nby the mysterious and elusive \"Ben\" certain .articles in this paper writ- his editorials concerning Hopkins'<br />\nappearing in the current nuniber of ten by a gentleman who. dubs him.- enterprises in early enough to stop<br />\nself \"Ben\" and by the content of his<br />\n*the NEWS-LETTER. ,<br />\nthe enterprise or avoid discussioh<br />\nThe evening hour of nine-thirty<br />\nIn what has evidently been'a sin- articles has very justly earned the of the matter if he opposes it. An<br />\ncomes over the dormitory and theo—\"The<br />\n\"<br />\n:<br />\nCritic<br />\nCampus<br />\ncere effort at constructive criticistn,Cognomen<br />\narticle as above referred to not only .retically all music and unnecessary<br />\nyour zealous correspondent has at- Now, as undergraduate students., we tends to disrupt college spirit; -but<br />\ntacked a problem about which I ant are all very familiar with our short- also to disgust the campus' with noise immediately ceases. However,<br />\nis<br />\nafraid he knows absolutely nothing. Coming, both those knOwn to the your paper in general and your the antithesis of this happy state<br />\nmore, nearly true. The wail of<br />\nThis question is the much-bruited inward person and those 'exposed to opinion in particular.<br />\n\"Song of the Swamp\" reverberates<br />\nand oft-repeated one as to why the public survey. So far, I have read<br />\nSincerely,<br />\ndown the vacant corridors and this<br />\nBarnstortners Club has not titulr- most of the articles and so far do<br />\nNorris.<br />\nR.<br />\nJohn<br />\nunearthly call is'answered by the<br />\ntaken the production of • serions. not see one bit of constructive criti•deep and throaty moan of a bass<br />\ndrama. Mr. \"Ben\" is undoubtedly Cism. Destructive criticism is one •<br />\nsaxophone in profound grief. As<br />\nprompted only by the best interests of the easiest.things in the ,world to<br />\nMr. Norris, in his letter. teems the hours wear on, someone breaks<br />\nof the undergraduates in assailing give—remember that.<br />\nto be a trifle confused regarding the a b'cyttle of some unknown type, upon<br />\nwhat.seems to be the Position .of the<br />\nI might alter the above statement real purpose of a college newspathe stairs and falling glass is heard<br />\nclub in'regard to this matter. I feel, somewhat, The caustiC 'critic has<br />\n\"per's editorials: The Comment of during the next few minutes. Then<br />\nhowever, that several of his- state- recently founa a new field in vilich<br />\neditorial column is not,primar- the still night is pierced by a joyful<br />\nthe<br />\nments should ,not go unchallenged. to growl, i. e., The Barnstormers. A<br />\nily intended_ to \"stimulate college soul bursting -forth into song and<br />\n:In the first'place, it may surprise -suggestion-WE:old- be to regard-facts<br />\nspirit.\" Its chief mission is rather promptly is chorus of cries and unyour learned,correspondent$P) hear first and by doing so prevent the<br />\nranible after ramble. A to provoke original thipight and the pleasant sounds inform him that he<br />\nthat the Barnstormers for. several mind<br />\nis not in the good graces of the inyears have turned..envious eyes upon good principle-to fo1Iow is that if a free discussion of campus problems.<br />\nmates. However, the songs Ind ditupon<br />\nin/proved<br />\nbe<br />\ncannot<br />\nsittiation<br />\nWith<br />\nwhat<br />\nproperty.<br />\nwere<br />\nthe Playshop<br />\nIn'our parade editorial, we<br />\nties continue and occasionally the<br />\nafter<br />\ncareful<br />\nmen<br />\nexperienced<br />\nby<br />\nappeared to be the death of the litnot attempting to stamp out college fire gong is sounded to interrupt the<br />\n.consideration then those unfamiliar<br />\ntle theater group this fall, the Barn-.<br />\nspirit or pre-game enthusiasm. We monotony. Several roomers who<br />\nhad better adopt,a more philosophic<br />\nstormers immediately made efforts attitude and. if plans for improve- were merely raising.a strenuous tilt- ave unable to locate the evasive keyto bring their proposition before the ment are offered begin from the jection to the exploitation of col- hole, are admitted to their respecas the<br />\ntrustees of the vacant Playshop. At constructive viewpoint.<br />\nlege spirit for commercial purposes. tive chambers and at length,<br />\nclock chimes. two-thirty, the noise<br />\npresent. I am not at liberty t(: say<br />\nWilmer. H. Driver<br />\nThis parade was not a spontaneous<br />\nfinally lessens and dies away into<br />\nany more than that, our pnispect,<br />\noutburst of undergraduate enthusi- the early morning altogether.<br />\nMARYLAND PARADE<br />\nof procuring these facilities for proasm. It was nothing more than a<br />\nA reign of terror suc has has not<br />\nduring genuine Ilotkins plays.writ- 1 a the kditor of tbe N EWS- I ATTER. publicity stunt promoted in or$1er been known for some time is now in<br />\nto entice a large crowd into the full sway in the Hopkins' dortpiten and staged entirely by Hopkins Dear Sir ;.<br />\nI would like to know, by what au- stadium on Thursday.<br />\ntalent are practically nil. If you<br />\nContinued- an Page 4, Cot. 3<br />\nwould like to know Why-, you'll ,have thority the editor of the NEw4-1,Erto. sl$, the trnstees. But, the poinci,is TER writeS .a column stating that<br />\nhie panicle is enough and \"we<br />\ntills. the I larnstormers<br />\nthat there is a need for a- little t1W-- strongly opixTse the participation by<br />\n.ater group at li,pkins, and that-they Hopkins students in such all enterpaper is supposed to<br />\nTirz'e made efforts to do something prise.\"<br />\nabout 'It. t;ive them credit f“r-that reflect and .siimillate college- spirit,<br />\nstop the<br />\n:lat. when it is too late,<br />\n111:11<br />\nnittelt-ot<br />\nCOIlleS<br />\nS-1..liraK.<br />\nNEW<br />\nthe<br />\n\"parade.<br />\n1,&„0„,,,<br />\n1,<br />\n,<br />\nini,zht add.44t OIL.<br />\n_<br />\n<br />\nNG<br />\nCLOTHI<br />\n_<br />\n40.nitletiteno Irurnistiing 9o060,<br />\nMADISON AVENUE COR, FORTY-FOURTH STREET<br />\nNEW YORK<br />\n<br />\nOur Representative will be at the<br />\n<br />\n'<br />\nSOUTHERN HOTEL<br />\nTo-day and Tomorrow<br />\nDecember 4 and 5<br />\nSendfor Illustrated<br />\n<br />\nChristmas Circular<br />\n<br />\nR,0 S T 0 N<br />\n<br />\nPALM BEACH<br />\n<br />\n16rwevorr con. firnocrtirr Sr. 246<br />\nL. G. BALFOUR<br />\n<br />\nP..,.<br />\n<br />\nNEWPORT<br />\n<br />\nB,,., A.,.. S 220<br />\n<br />\n90.<br />\n<br />\nFraternity Pins<br />\nJewelry, Favors, Novelties<br />\n<br />\nHOPKINS RINGS<br />\n1109 Fidelity Bldg.<br />\nPhone Calvert 1564<br />\nPhone HOmewood<br />\n<br />\n7908<br />\n<br />\nBirely's Pharmacy'<br />\nST. PAUL at<br />\nYour<br />\n<br />\n33rd STREET<br />\n<br />\nNeighborhood Drug Store<br />\n<br />\nI<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\n<br />\nFORDS sok GEAR SHIFT CARS<br />\n11 E. North Avenue<br />\nVernon 2704<br />\n<br />\nMakeOur Store Your Store<br />\n<br />\nThis<br />\n<br />\ni<br />\n<br />\nt:diuir-.411rinte-01161_.:1•1)<br />\n;Ire r<br />\nmake the parade a flop, and the<br />\nuntil floor of the Ilain, which Will<br />\nJohns Hopkins University' the<br />\nhe vacated upon the completion of<br />\nlaughing stock of .the town for the<br />\n-,.evcring I Ian.. Now, it r. :1 ii'.'<br />\npoor representation of its students<br />\nironic<br />\nyour<br />\ndevote<br />\nif yott want to<br />\nsuch a college \"pep.' meeting.<br />\nin<br />\npen 1,, 5.11e .U.111,41 can,, may I sugThanks to the 'disregard on the<br />\nyour<br />\nin<br />\ncrusade<br />\na<br />\nthat<br />\nvon<br />\nstart<br />\nre.st<br />\ncaMpus of the opinion of the Nis,wsc,dunin to help us get this space<br />\n1.nTER, and, on the other hand, to<br />\nfor our own link. theater!<br />\nthe determination of a fair-sized<br />\nlit. regard to, the type of play th<br />\ngroup of lb ipkins men to prevent<br />\npretcn<br />\nclub selects, it does not it<br />\nyour paper from reducing iti. any<br />\n'liii' ii doing itiv•rnore ihau furthe parade<br />\nway the I lopkitis<br />\nnishing- pleasure tod the participantS<br />\nwas a success—Os much a success Is<br />\nIll the prodiwtion and. entertaipment<br />\nany - (inner<br />\nif the cruw,ls \\vhielt, de,pite -the<br />\nI stigiost that the writer of such<br />\npla's.•-ac-.<br />\nfact that they afe \"dudin Ilte future see. t./me<br />\ncolumn<br />\nthy largest a<br />\n• cording to Nit-.<br />\nfor such an enterresponsible<br />\none<br />\ntwo,succestheater in Baltimore on<br />\ncorrect any misto<br />\n,order<br />\nin<br />\nsive evenings, am tare generou•s with<br />\nsuch as occurred in this<br />\nistatenients<br />\ntheir applau,•e.<br />\nThwrimary pt:rposes of<br />\n1)1,1 Viiit ever still) to tltlttk, \"Ben,\"- edit()rial.<br />\nparw.le were to benefit Hopthis<br />\nproduce.<br />\nto<br />\nbe<br />\nwould<br />\nit<br />\njob<br />\na<br />\nwhat<br />\nin college spirit; secsay, \"The ('radle Song.- or some kins: firstly;<br />\nletting Baltimore know we<br />\nsimilar opus with ILI,e...:11andicaps that ondly,ln<br />\nspirit and<br />\n1.)) you have plenty of College<br />\nconfront the Stormers<br />\n\"ads\"<br />\nsecuring<br />\nin<br />\nus<br />\nassist<br />\nto<br />\nthink boys would • be convincing hence<br />\nand pecuniary<br />\npublications<br />\nour<br />\nfor<br />\nyou<br />\nDo<br />\nroles?<br />\nplaying the female<br />\nCage Fund drive; and<br />\nthink it . would \"go across\" lief ire help in our<br />\nmake the annual Hopto<br />\nthirdly,<br />\naudience?<br />\nBarnstormer<br />\na typical<br />\nkins-Maryland game a bigger 'and<br />\nThese things. you- will reply.<br />\nmore profitable game for Hopkins.<br />\n—<br />\nimpliyour<br />\nmerely go to prove that<br />\nwriter also seems to have the<br />\nThe<br />\ncation of the Barnstormers being<br />\nimpression that this parade<br />\nfalse\"low brow\" is true.<br />\ndown the throats of<br />\nforced<br />\nwas<br />\nWell, we're not particularly worTo correct this idia<br />\nmen.<br />\nHopkins<br />\nit.<br />\nmed if you feel that way about<br />\nread the first sento<br />\nonly<br />\nhas<br />\nWe have a very' good time produc- he<br />\nan article on the front page<br />\nin<br />\ntence<br />\nthe<br />\nin<br />\ndone<br />\ning plays as we have<br />\n\"—\"In response to the enthusiasm.<br />\npast. We would like to do both<br />\ndisplayed in its favor at Assembly a<br />\nbeBut<br />\nwork.<br />\nkinds of dramatic<br />\nparade will be held before the<br />\ncause one seems to be denied. us<br />\nMaryland game for the first time<br />\nreaany<br />\nthat<br />\nis<br />\nbeing,<br />\nfor the time<br />\nthe history of the University.\"<br />\nin<br />\nthe<br />\nson why we should abandon<br />\nIt was only after tlie:Assembly had<br />\nother?<br />\nvoted for a parade that announceY.:Ws truly,<br />\nment was made that flares, floats.<br />\nWILLIAM B. BAN its.<br />\n<br />\np<br />\nHEATthe instant you want ill<br />\nThe moment you are ready for your gas<br />\nflame, it springs into full action!<br />\nLikewise, at your will, it is instantly and<br />\n-completely extinguished.<br />\nWhen you use gas, there is no carrying<br />\nover of fires during periods when heat is<br />\nnot wanted.<br />\n'Nor is time lost in bringing a fire up to<br />\nthe required temperature.<br />\nThis feature alone of gas for industrial<br />\nuses is important. It represents a valuable saving- of time; conservation of<br />\nman-power, and economy of operation.<br />\nMore than that, the flexibility of gas,<br />\n<br />\nwhich makes possible this very feature,<br />\ninsures perfect temperature control for<br />\nevery manufacturing process.<br />\nQuite naturally,this makes for improved<br />\nproducts and fewer rejections.<br />\nConsidering all the many advantages<br />\nafforded by gas—of which these are but a<br />\nfew—it is no wonder that industry is today employing gas in 60,000 different<br />\nways!<br />\nYour local gas company will be glad to<br />\ntell you how gas can be profitably employed in your plant. Telephone or write<br />\nto them—your inquiry will not obligate<br />\nyou.<br />\n<br />\nFor free copy of book,\"Industrial Gas Heat\",address<br />\n<br />\nAmerican Gas Association<br />\n420 Lexington Avenue, New York City<br />\nYOU CAN DO IT BETTER WITH GAS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DEMMER 4, 1928<br />\n<br />\n4<br />\n<br />\nriorcorno<br />\n<br />\nNOVO<br />\nDE<br />\nLNTER COLLEGIATE<br />\nfty Ksc*saG. Huirr<br />\n- - NEWS fia made las buea mid and writ.e..; •<br />\neenee eel<br />\nhave puled,<br />\nPr EN.<br />\n.kW about die atm pies at Hopkins<br />\nMier hvought thy naareue Istallehaexl sad_<br />\nIllmt it hardly music presetise hey<br />\n13t.<br />\n'<br />\n'<br />\nAnti<br />\n7e2 eessere't fag. and left the miertal frame '<br />\n*iv' lig is left as illeaC for the =wren<br />\nthe 54- kiwis<br />\n*ihed<br />\n,<br />\ni en<br />\n'<br />\n774:eti<br />\n.<br />\nL&.'<br />\n• rc#enndi<br />\nwart it:ree<br />\neeered iead<br />\nvw were stEng<br />\nai'\".Lst'yinvtPat<br />\nDecemDer, 19.z7<br />\ndiet has prerhany teen erentreaced<br />\nire.;<br />\n\"..ne tea a.eress<br />\n'''<br />\nrtu<br />\n\"hail<br />\nthaek the la<br />\nmak stand l'eove edftestsest<br />\nEry,.<br />\nk<br />\nTait it far<br />\n.0t ;.‘1121611g<br />\n(<br />\nwhat,as was.'<br />\nttnde64<br />\nto, ss<br />\nOr .1,-44 m e.emeete.<br />\nthe<br />\nthe<br />\nC. A.<br />\nbe<br />\n''Y'<br />\nene<br />\ne*eiffiel<br />\n\"<br />\nere-mt.;<br />\n\"<br />\n:<br />\na*<br />\nree:<br />\ntat<br />\nlay<br />\n'<br />\nSome<br />\nneverdadmiee<br />\nhat,<br />\nIt<br />\nHall<br />\n- Leventeg<br />\nB\"4\"'aa4 Wks•.Sixz<br />\npros*nt,I iniar\"-eriAr4P'<br />\nAs my C..”,..r.rr.a.s .<br />\neadte<br />\n..ai.er-• re: e<br />\nie-o-ene eaet<br />\nAte frittete<br />\ntoa fatevemon for Mc,and I,fiat<br />\nporquei of yourtins.<br />\nrodents wm-e -arreatod. vent isrli<br />\neitsiao4 for myself a ink!,<br />\ndragging<br />\napsocy<br />\ntb.fiat<br />\nthe i-eee..<br />\nfor<br />\nrecren<br />\neee.e<br />\n•<br />\n!re=<br />\nthe<br />\nesm<br />\nfrom<br />\nir,an<br />\ndiwerdierte<br />\na<br />\nmet<br />\nohl<br />\ntrain<br />\ni- thaltet ‘Arregt Ir<br />\n7- - ----- --ararrag us re.ezusg shrouds<br />\naliglitik acquaintIn style and quatit_fiostoniarisIperty<br />\n,<br />\npr<br />\nWhich heave Arzraina\" heating depth.<br />\n\"corteke= and destreactrion<br />\n,.i ybur<br />\n:. pro,duee,<br />\nthe most 'expensive footwear<br />\nequal<br />\nT. paper has dung to, a,hes- so elm/here haguage and reeaeting<br />\na<br />\nnot<br />\nairnage dire,<br />\nI am<br />\nhack' may ne 1.,:er.rX<br />\nthe<br />\n-•--.2sionally I have a produced today.<br />\n*native patty in hand<br />\narrest, and vine with<br />\nthemageee<br />\nlex!<br />\nevil<br />\nlaxly<br />\nand<br />\nthat<br />\ngreed<br />\nWhere<br />\n,oriairler<br />\n1<br />\nipatioa, and frees ite trerannut, of teterf<br />\n.4e3k tergeare. death<br />\n, is the finest<br />\nAnd the saving is a 'big item.<br />\n-I.:<br />\nelem. aer<br />\nIn Ureic of deadle- hate<br />\nit appears that the edrstorial at- againte them<br />\nwith his<br />\nepeethee<br />\n_<br />\nwieere,<br />\nTeat<br />\nlean,<br />\nat<br />\ntune,<br />\nthis<br />\ntitathe—which<br />\nMostly $7 to $10<br />\n7 \"AU,.<br />\n,Angnix. home<br />\nAcerxefteg to odyikere m the vicire<br />\nsiarld seem fairly am-afar* to reM a.F.,..t<br />\n_<br />\nIdren<br />\nflect the campus artrende—is that ity of Harvard. 20,91.$ feet of dim<br />\nForever thetreee 7<br />\n341, 81:ttmort<br />\nEx(.1..<br />\n..trn tee by student+ af<br />\ntht new plats, wherein it sights the /father are 1W,<br />\nre weer<br />\nThat death ends a/<br />\nBecame ,rA the<br />\nanefergradiume Leidy, is a bad thing. that :institution<br />\n\"is4..7...e.<br />\nT<br />\n- d nothine • =_t L. ent:ewe<br />\nReduce<br />\nBOSTONIAN<br />\nAs I hare lead, the editors' M thiS many vreeit-enel attractierie it was<br />\nExtra High Grade ,<br />\napporestity have they\"-epport of the send that Merida, isat a poet (WrySTORt<br />\nSHOE<br />\nezh:,<br />\nAdern thy grave; thy zetee-seUe,<br />\npervasTrig student Wipiffil Welt forebutinme. the lack of funds mut112 E Baltimore Street<br />\n• an opinion characteristic of ing this amilition.<br />\nle fluted and far'f.411 kick<br />\nitudenti—eal editors. No .oae, I<br />\nT. rat:: thy samicilfor pireple<br />\nliebriu,ever heard of salad reavm- -AL a flolion 4<mvemu -it.<br />\n,r rate:eel:heater<br />\nWet not in Vase, -1,<br />\nanmunt<br />\naverage<br />\nthe<br />\nthem<br />\nthat<br />\nof<br />\nennounted<br />\neither<br />\nfrom<br />\nlag Wain<br />\nItIVe hunt the hand* et -kinge and 7,<br />\ncarried<br />\nindite:6/m<br />\nn.1.thai<br />\nativIere<br />\nTo am it is peace* absurd that a<br />\neenmett .<br />\nterange<br />\ncent,. Even<br />\nTheir<br />\ntheie„ should be a monstraft with- with hire ietwenty-two<br />\nwere'compiled at<br />\nThy sewn deer land ha. %I:Arai 7'<br />\nbidding of endorsemer. rt from a plan if suchtceileues<br />\nhesitate to pubFig men have banned by Lie<br />\nproviding .for free exercise/ of gets- Ifiephtlas, vie eh/4A!<br />\n.<br />\nthem,<br />\niieh<br />\nthe<br />\nby<br />\ntinhatf+ered<br />\n- scholarthip<br />\naloe<br />\nThan savage war: we've stceee<br />\nmuscat* dileuziniun of \"colJege<br />\nie...<br />\n!settle<br />\non<br />\ndeed.<br />\nwell<br />\nat<br />\npee<br />\nOf<br />\nthe<br />\nffiglity<br />\nof<br />\nNeepire4. abnhist<br />\nadacatioa.\" I do not argue that unWhat need for inore\" !Jost heir the<br />\ngeneration of the preeent time; the<br />\nderp-achate work oven to be everyof 'Toronto ha.; anUniversity<br />\ntolling bell' Doe we ,the<br />\nThe<br />\nmore<br />\nany<br />\nwhere done away wnh.<br />\nnounctda course in flying. .‘ccord,<br />\nbcer m e/lerrin R:47:<br />\nToy<br />\ndaan mart&.scainameriti, hog-tath<br />\nnag to the report; it will he thP first<br />\nthou are where<br />\nyet<br />\nlag coallests, or any other popular<br />\nRemembered<br />\nakiarance of any weft course in<br />\n_<br />\nand relatively harmless silliness.<br />\n.ey,<br />\nBut I ad! carry thee, my iy<br />\nne's-10 mast'A<br />\nwith it.<br />\ncerrieS<br />\ncourse<br />\nThe<br />\nCanada.<br />\nSWIM SOO of preparatory work in— U41 cut to(*ace ..4\"--Of arm: thee thee the ripplmg er,e-ne<br />\nobligetiont.<br />\nno<br />\n—<br />\nadvanced<br />\nte<br />\npresupposed<br />\n.• •<br />\ndeed is<br />\ne 7:The shaggy hall: hold thee to<br />\nESTABLItHEO EHGLISICUNIVERSITY<br />\nilii.41A recent number oi<br />\nstudy and individual research In<br />\n,rri. beryl:<br />\nthffa;<br />\n-TAlt.OREIS -S/VtR YOUTHFUL<br />\nthy<br />\nT,<br />\nSTYLES,<br />\nquench<br />\nin which all of<br />\nfact. I am not even going to debate yan Doily appeared<br />\nCHARTS SOL-ELY FOR DISTOIGUISHED<br />\n11se luecvest.Eruit. Thal\"!for*<br />\nvery<br />\nWere<br />\nimportance<br />\nof<br />\narticles<br />\nthe<br />\nagain the recently much-debated<br />\nSERVICE INTHC tirtITEJ) STATES.<br />\nT71,11<br />\nTbrieee,<br />\nseservetivOLATIMMCM..the head- •-•:-.11111•<br />\nquestion of lilt wival-41<br />\ntype<br />\nv<br />\nline,heirs**/Ai.- ex tre<br />\n_<br />\nIt of ordinary college \"training.\" Tlae<br />\nfee' tor. fle.....reee elitigatoer<br />\n•<br />\nI imPlY want 1.6 add rnY grunt and e, eXplein, said that \"the Jim/type<br />\n•<br />\nit Apz,r3-34<br />\ntint<br />\npush to heaving itout of Hoptn, et) which -the uetUil large heads of<br />\nica)<br />\n7.4/e Dirtfe• ere set, had gorK wrong<br />\nLeave it to flourish eltiewliEre.<br />\nnil that none 'if ihe front tiag - type<br />\nwest<br />\nSults $40,145,*SO.Overcoats<br />\namong the wheat fields of the<br />\nHALL HE4RINGS<br />\n:Available.\" fie continuee \"the<br />\nsouth.<br />\nthe<br />\nPagr<br />\nof<br />\nhookworms,<br />\nthe<br />\nand<br />\netaff• have it<br />\net editor. mule<br />\nBeinneee,<br />\nf tc r4-' In the dark hour.' </idle night<br />\n..... Alin let the hillsef. Teeth<br />\n'w. 4iL454 thei<br />\n.011<br />\n7<br />\n4<br />\nfapS\"ife atglibTEbe inviolate. fiche we have an in<br />\nE E. ADAM<br />\ntels of this building, and upon .a::<br />\nBY SPECIAL APPOINTMENT<br />\n•<br />\nage.en<br />\nyears<br />\nifty<br />\nf<br />\n.<br />\nStitution founded<br />\n•nettleel oi 'i/ortraeinp nvestenve eiht,Sreperntig the<br />\n*OUR STORE IS THE<br />\na principleit is apparently strug- dr fhetletll genie, he, been a.lapi- silent hand files ini-e the entry and<br />\nautivoities of purfitie<br />\n• gling to maintain now You all are ed fir the<br />\nthe time bodes ill for some unfortu'<br />\nh<br />\n.efe,<br />\nnate. The step, are mounted with<br />\n„ _Th, game 1, ee n<br />\nfamiliar with what a repute.titire has f:res<br />\n,<br />\ngridgraph. low whispers. a short conference of<br />\ncalled<br />\nmechanism<br />\na<br />\nlintbut<br />\nbrief<br />\nthat<br />\nin<br />\n(nit<br />\ncut<br />\nbeen<br />\nby play is recorded by a own- subdued voice,, a knock on the door.,<br />\ntient period by the men, sincerely flay<br />\ning light which represent, the feeeg- and then violent ecrelnis and cries I<br />\nOF BALTIMORE<br />\ndevoted to the discovery of truth<br />\n.-111 the infermation followed by an ominous -;ilence and<br />\nand the advancement of feat:fling. ,ress ohthe<br />\ngiven 'in the stadiem soireleeird i. the mystic figure, again vanish intu,!<br />\nThe character of the suits and<br />\nOvIANNIE (BERG<br />\n•<br />\n,<br />\n• and fully .4:quipped f//r the business,<br />\npri,s4.-nteo.<br />\novercoats tailored by charter House<br />\nthe- darktees from whence thee<br />\n•••<br />\n.<br />\n•<br />\n•<br />\nfionletf<br />\nBoy<br />\nMitt<br />\nOki<br />\n\"The<br />\nthe<br />\nwith<br />\nassociated<br />\nwho were<br />\nwill earn your most sincere liking.<br />\ntame. Later a disheveled<br />\n• union. flat it fallen riff of rite: Thte Brie.n an,/<br />\nTr*.ii MA.rk Ft,<br />\n'in innerrit<br />\n-;<br />\ndax,<br />\nless<br />\nor<br />\nmore<br />\nMei<br />\nioutel<br />\nj`<br />\nThen it is lately that the<br />\nsity,..anniettice, the ineees which Mat, under a colei<br />\n;.:<br />\nCoIleiate Fu_rn ish ings<br />\n---miterifuelef'ettriergete.<br />\ntettiretTav'irrri 7ieetng • •<br />\nhand-,. -Ale<br />\nwilling<br />\nby<br />\nforth<br />\ndrawn<br />\nall student.<br />\ni..;harles anti Fayette<br />\nmade itself dangetinas to the test brary regitlatioqs.<br />\nNORTH AVF MARKFT<br />\nof the -tubbing briwho keep books unduly long only other victim<br />\nInterests ,of Hopkins.<br />\nAVPS<br />\nAND<br />\n&<br />\nMARYI<br />\nNORTH<br />\nthe lkt• ,:t<br />\ntme IP.Itiee will 10: Seta *by the li- gade- he, been added to<br />\nThe extraction would be painless<br />\n1 he next one, the paper these unknown marauders.<br />\nbrary<br />\nenough. (inc fine fall there, would stated, is ',tit by the klean.<br />\nsimply be no rush of freshmen to<br />\nCONFERENCE<br />\nSTUDENTS<br />\nFrom a•college- publicatiOn, wi.<br />\nPaw I., 1', 01. 2<br />\ntrouble, the, registrar's' office girls,<br />\n'en u iicii<br />\nEasterner. just don't know jti,tifu-, it, dominance by the le,<br />\nand that winter fewer snap courses<br />\nhow to ielebrate \\ f• read, ''l<i-s-xploited<br />\nwould be sought for and filled. By<br />\niv football fan- 31.1 Ihn, 1,411, of There i,1 a In<br />\nthe time the then soplioneees would the 1;iitinore Hotel; Los Angeles,<br />\nrat, , atising lighting awl Inn tion<br />\nstudent<br />\nthe<br />\nof<br />\nersity<br />\nseniors,<br />\nbecome<br />\nStanford-Univ<br />\n.<br />\nthe<br />\nalter<br />\nhave<br />\nix-its-ern two other fa,,, 111 ,,i'dt•T•<br />\nbody would be so small half of theta Southern ,ralifornia gridiron bat- nil,' thew lkotb. The re-tilt, as la,<br />\ndollars<br />\nDrink<br />\nof<br />\nprobably would become scared and tle rienTeel ii) thietsands<br />\nas the dominated rain- is concern,:<br />\nchair, mimes, is Si) attitude iif sycophaivy or<br />\nAnn<br />\nnut<br />\ndaniftges.<br />\nhe<br />\ncould<br />\nquit, and ,the survivors<br />\n(11111,1114-111 were Itroktat<br />\nIf<br />\nhat,' toward thc exploit ing oll,<br />\nawarded honorary diplomas, with all<br />\nto,01 from the Windows. To (<br />\n.,?1111Coftiii CC4,1111111It• ltusittmuii 'I'<br />\nexpedite<br />\nto<br />\ntrappings,<br />\nthe requisite<br />\nwc;rk on the exterior alipearances<br />\ntermini, social status between FareDelicious and Refreshing<br />\nwell a, the' ,interior, plants and<br />\nmatters.<br />\n,.;•retip of I Alaholtla Indians le<br />\n.Even<br />\nuprooted.<br />\nwere<br />\nshrubbery<br />\nstamping<br />\nore<br />\nEven if they hung<br />\nconic %cry prominent socially. inn<br />\npaper bags tilled with water were tin the di,covcry in t\" oil on thee<br />\nin the fast-decaying habitat of their<br />\nused in the celebration.<br />\nlands.<br />\npredecessorsethey would become es<br />\nTo all those wlio• s.iitit red from —<br />\n.ery year less hatnifui to the serious<br />\nan the committee it: charge especially<br />\nwork of the university, and it is not too mein study, 'Purdue offered'<br />\n\"Fill Tull. I drink<br />\na single regulation. The president ei<br />\nRecently<br />\nprogram.<br />\nattractive<br />\ninconceivable that one of them might<br />\nto the general joy<br />\nwalking contest was bemoans the fact because he state,<br />\nlong-distance<br />\n1,<br />\nshow the bad taste to become inter- held in which twenty men entered. \"'rile committee is composed of big<br />\no' the whole table\"<br />\nt<br />\nested in graduate work and merit The contest, which was Called the men and it is grieving to see such<br />\nCertainly Macbeth meant<br />\nentrance IlltU its mysteries. At the \"all-University cross country walk- talent go ti, waste.\"<br />\nthe same thing as when<br />\n• • •<br />\nwould<br />\nregula<br />\nthe<br />\nover<br />\nheld<br />\nyears<br />\nwas<br />\nthree<br />\niniz<br />\nrace,\"<br />\nmost, and wont,<br />\nwe say:<br />\nAt Temple University the loscra,<br />\ncountry<br />\ncross<br />\nmile<br />\none-half<br />\npurge the universitY of their pres- two and<br />\ns.--\"<br />\nNIACISE<br />\nof the Sophonuare-Fresman tussle.<br />\noffered.<br />\nwere<br />\nAct III. Scene<br />\ncourse, Pour rewards<br />\n,<br />\nin form of a tug of war, not only<br />\nence. It is a time that I know all<br />\narripe,<br />\nmen in the stacks and research labs<br />\nConditions at Washington and suffer the humiliation of a defeat<br />\nThc Coca-Cola Company, Atlanta,<br />\niN<br />\nJefferson are admittedly perplexing but also are made to undergo e<br />\ndevoutly wish for.<br />\nand disappointing. Their freshmen drenching at the hands of their con1 T HAD TO BE GOOD TO GET<br />\n8 mafiosi es day<br />\nMaryland, Western Maryland,<br />\nWHERE IT IS<br />\nare unusual. They do not break a querors.<br />\nContinuo/ en i'q r,, co.<br />\n<br />\nTen Years Have Passed<br />\n<br />\nLondon Man<br />\n'Gives Cool Tip<br />\nSmokers Here<br />\n<br />\nPrArang t\"<br />\n<br />\nCollege Men!<br />\n<br />\n•<br />\n<br />\n*<br />\n<br />\nTh.<br />\nanxio<br />\nStadit<br />\nfifth<br />\nkins a<br />\nslight]<br />\nwere,<br />\nonslat<br />\nwith<br />\nto wit<br />\nCar<br />\nStadit<br />\nfield c<br />\nSnyde<br />\nhave<br />\nthe Imany<br />\n-wlucu an<br />\nbe ent<br />\n<br />\n•<br />\n<br />\nEdcreWoisth<br />\nS:moking Tobacco<br />\n<br />\n.•<br />\n<br />\n•<br />\n<br />\nMIMS<br />\n<br />\nl'ro<br />\nany (<br />\ncame<br />\nState<br />\nUnive<br />\n:The<br />\nto coif<br />\na deft<br />\nColgat<br />\npower<br />\nDame<br />\nThis tl<br />\n(nutplan.<br />\n.• Faster<br />\nperiori<br />\n,Q-ou4. 1<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nhArtejn °Ilse<br />\n<br />\nsmn<br />\n<br />\nhAtter F onel<br />\n<br />\ntine<br />\n<br />\nlie tit r' Hut<br />\n<br />\n,<br />\n1•40,<br />\n<br />\nWhat Shakespeare<br />\nsays about Coca-Cola<br />\n<br />\nas<br />\n<br />\n•<br />\n<br />\nV4V,<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nRefresh Yourself!<br />\n<br />\n,<br />\ndr<br />\n<br />\nA.<br />\n<br />\n• EX.UITI<br />\n<br />\n:‘)'<br />\n71i<br />\n'11.1-'<br />\n41417('.<br />\n1I(111;\"<br />\n<br />\nthe \\V<br />\nkick.<br />\nhuge g<br />\ned to<br />\n<br />\nwere in<br />\nt he tin<br />\nfor an<br />\nresult<br />\nof 13<br />\ngon it<br />\nWIC, al<br />\n<br />\nThe<br />\nleader,<br />\n(lice 55<br />\nI. wIte<br />\nto-h.<br />\ntug tug<br />\n<br />\nN 'ere f<br />\n• )itrin<br />\nigain ;<br />\n/la CO<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 4, 1928<br />\n<br />\nSPEAKING<br />\nOF<br />\n<br />\nThanksgiving Day at 2:15 two<br />\nanxious teams were lined up iti the<br />\nStadium ready to start the twentyfifth football game bFt.Ween Hopkins and Maryland. The Blue Jays,<br />\nslightly lighter than their rivals,<br />\nwere driven back before the heavy<br />\nonslaught. The game was filled<br />\nwith spectacular plays from whistle<br />\nto whistle.<br />\nCaplan thrilled every heart in the<br />\nStadium, running the length ci&the<br />\nfield on a kickoff for a touchdown,.<br />\nSnyder, of Maryland, seemed to<br />\nhave little trouble gaining through<br />\nthe Hopkins line. Lyons threw<br />\nmany beautiful passes but the men<br />\n•-who were to receive them-seemed to<br />\nbe entangled elsewhere.<br />\n<br />\nARE FRESHMEN HUMAN?<br />\n<br />\nTHE EDITOR EXPLAINS<br />\n<br />\nContinued from Page 1, Col. 2<br />\n<br />\nContinued from Page 3, Col. 4<br />\n<br />\n83 pounds is the lightest freshman.<br />\nWe agree with the writer that it<br />\nIf the freshmen stood one above would have been far preferable if<br />\nthe other in one column (the re- our ,comment could have been results include no information as to leased before arrangements for the<br />\nwhether their heads are of sufficient parade had been virtually completed.<br />\nhardness for Shis feat) the top However, due to the NEws-LETfreshman would get 300 feet more TEa's publication schedule, an edieyefull than from the top of the torial on the, subject at an earlier<br />\nEiffel Tower, as the total height of date, was impossible. We felt, nevthe cla4s is 1,285 feet. The aver- ertheless, that the topic was a live<br />\nage height is 69.6 inches. The rec- :and vital issue. The subject was<br />\nord average height belong to • the being univeraally discussed 6n the<br />\nclass of '29 and is five feet eleven compus and it was clearly the duty<br />\ninches. Larkin is the tallest, being of the News-LETTER as a represix feet three, and Crowther, who sentative undergraduate newspaper,<br />\nto make some comment. We made<br />\nis five feet one, is the shortest.<br />\nThe average chest expansion of no attempt to side-step the quesstrongly and<br />\nthe class is unusually large, as was tion but expressed as<br />\nour opposition<br />\nlast year's mark. However, the rec- logically as possible,<br />\nto such a parade which exploited<br />\nord-breaking class of '29 is the<br />\nthe Hopkins student body for 'box<br />\nchestiest with an average expansion<br />\noffice dollars.<br />\nof 3.7 inches. •<br />\nWe purposely did not interview<br />\nThe number of freslAmen comany of the backers or promoters bepared with those of previtstis years<br />\nfore writing our article. We wished<br />\nis large. The smallest class was<br />\nto write solely from the view-point<br />\nthat of '09, having forty-two memof the average student, basing otir<br />\nbers, and the largest that of '22 of<br />\ncomment on the information publicfive hundred and four members.<br />\nDr. Abercrombie. gave .the ex- ly released to the student body at<br />\naminations in the sout loft of Gil- last Thursday's assembly.—Ediior.<br />\n<br />\nman Hall.<br />\n• Probably the glate.st upset of<br />\nat<br />\nThe examinations proved<br />\nany of the Thanksgiving games<br />\ncame when the ,unheralded Oregon almost all freshmen kn.,' flat feet.<br />\nState team walked over Nt,A: York<br />\nMARYLAND WINS<br />\nUniversity to the tune of 25 to 13.<br />\nContinued from Page 1, Col.-6<br />\nThe New Yorkers were •expecting<br />\nwere the outstanding stars for the<br />\nto come through this season without<br />\nBlack and Blue eleven. Time and<br />\na defeat. Had they not defeated<br />\nagain Lyons' kicking repulsed the<br />\nColgate, Missouri and even the<br />\nOld Liners and gave the Jays<br />\npowerful Carnegie Tech with• Notre<br />\nbreathing spell; as a safety man he<br />\nDame on her list of vanquished?<br />\nwas mighty good to watch, in fact<br />\nThis team from the west completely<br />\nhe made a wonderful all-around<br />\npowerful<br />\nseemingly<br />\nthe<br />\noutplayed<br />\nshowing. 1.<br />\nliastertiers. They showed their suHopkins<br />\nperiority in every phase of ',laying. 'Maryland<br />\nLove<br />\nIF<br />\nfront bucking the line to.end runs. Dodson<br />\n---I..<br />\nKeating<br />\nL.T<br />\nLrum aeral- ttack to:defense. New Lombard<br />\nTe,ykt<br />\n<br />\n,<br />\n<br />\nOW,<br />\n<br />\n•<br />\n<br />\ntilatl,IS thought that this Was just<br />\nanother easy victory. '1'he first score<br />\nthe Westerners made was a dropkick. • Them they began to make<br />\nhuge gaps in New York's line, started to 'draw her .ensts :in,_ and :batik<br />\n<br />\n4!<br />\n<br />\n.11,•<br />\nwere made, 47 yards made way for<br />\nthe first touchd6wn, then 70 yaedt;<br />\nfor another, and the third was the<br />\nresult of a 55-yard, drive and pass<br />\nof 13 yards. One back on the. Oregon tezim-thade.120 yards; which<br />\nwas almost half of the New York<br />\ngain.<br />\n<br />\nfI<br />\n<br />\nMadigan<br />\nHeintz<br />\nMcDonald<br />\nHeap'<br />\nEvans<br />\nRoberts •<br />\nSnyder<br />\n<br />\n64,<br />\n,'.. ,<br />\n-W<br />\ni \"—!<br />\n-flr<br />\n<br />\nTO -<br />\n<br />\nStrader<br />\nC<br />\n... • Kegan<br />\nR.G<br />\nR.T.... Bialoskorsky<br />\nWetzel<br />\nR.T<br />\nLyons<br />\nQ•13<br />\nLang<br />\nL.H<br />\nCa_plati<br />\nRH •<br />\n<br />\nDE PROPOSMO NOVO<br />\nContinued tram Page 4, Col. 1<br />\nand St. John's—colleges of the type<br />\nto which the undergraduate ought to<br />\ngo—would all benefit by the change,<br />\nand those local boys with a hankering for big names and with a stack<br />\nof signed checks could go, as the<br />\nbest of them must do now, to the<br />\ngaudy citadels at Cambridge<br />\n(Mass.), New'Haven (Conn.), and<br />\nPrinceton (N. J.). Our own Iiitle<br />\nundergraduate school could certainly<br />\nnot be missed outside the state, or<br />\n<br />\nYOU'LL LIKE BOWLING AT THE<br />\n<br />\nARCADE<br />\nATOP NORTH AVE. MARKET<br />\n22 ALLEYS<br />\nBowling Keeps You Fit!<br />\n<br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br />\n<br />\n•<br />\n<br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG<br />\n<br />\nPhone PLara 0800<br />\n<br />\nD. C. HANDY, Manager<br />\n<br />\neven the city.<br />\nAnd then the graduate department, which would be missed, if it<br />\nwere swept Away, wherever medicine and science shed the beneficent<br />\nlight of their presence, could return<br />\nfreshened and unloosed to those<br />\nideals in which it was conceived a<br />\nhalf century ago.<br />\n<br />\neA. H. FETTING<br />\neNIANUFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n#<br />\n<br />\nINTERIOR' WOOD WORK<br />\n<br />\nDECORATIONS<br />\n<br />\nJAY HARRIERS LOSE<br />\n<br />\nJOHN C. KNIPP €.? SONS<br />\n<br />\nContinued from Page 1, Col. 1<br />\n<br />\n2. Myers, Maryland, 29.40 1-5; 3.<br />\nTie: Bo*nan, Maryland, 29.55, and<br />\nLinsey, Mayld, 29.55; 5. Remsberg, Maryland, 30.1 2-5; 6. Tie:<br />\nPlumbley, Maryland, nd Wallett,<br />\n.,Kelly,<br />\nMhryland, J0.31 3-5;<br />\nJohns Hopkins, 30.55 1-5: 9. Emerson, Johns Hopkins, 31.15 2-5<br />\n10. Kibler, Maryland, 31.45 4-5 ;<br />\nHopkins,<br />\nMiller, Johns<br />\n11.<br />\n32.2 1-5; 12. Waters, JOhns Hopkins, 3220 2-5;, 13. Loizeaux, Johns<br />\n'H, 14.<br />\nj_21147EW.,,,<br />\nk<br />\nJohns Hopkins, 32.43 425.<br />\nTeam,score:<br />\n20<br />\nUniversity of Maryland<br />\n35<br />\nJohns Hopkins Unifersity<br />\n<br />\nFURNITURE<br />\n<br />\nCOLLECT TWICE<br />\nIf you could talk with the big men and<br />\nthose who convey that very attitude whom<br />\nwe tailor, you'd understand what it's all<br />\nabout. To look at him might suffice be.<br />\ncause of the -charm and personality we<br />\nbuild in his clothes.<br />\nWe will do the same for you and 'include<br />\nquality in the cloth and construction<br />\nthat will outwear two dollars spent any<br />\nother Way. You collect twice on every<br />\ndollar with us, •<br />\n- TWO GRADES ONLY<br />\n<br />\nBALTIMORE, MD.<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nstimulatingdelightful<br />\nare<br />\n<br />\nthe New<br />\n<br />\nFall Books!<br />\n<br />\n-brand-new books in bright<br />\n.<br />\nr9mgV,hern7<br />\nY411And<br />\ni„,riter'Tink-and crisp paper—fiction,<br />\neirA•ersrell<br />\npoetry, biography, science—awAring your choice at our two stores<br />\n<br />\nWILLARD TAILORING CORP.<br />\n120 West Fayette St.<br />\n<br />\n'THE NORMAN,REMINGTON<br />\nDown-Town<br />\nCharles St. at Mulberry<br />\n<br />\nCO.<br />\nUp•Town:<br />\n1118 North Charles St.<br />\n<br />\nFirst Floor<br />\n<br />\nMil<br />\n.7 44s.<br />\n.<br />\nn<br />\n<br />\nSyracuse unexpectedly romped to<br />\n14-6 victory over Columbia. This<br />\nis time first win that Syracuse has<br />\nhad in any of • her major games.<br />\n\"Skinny\" Baysinger, playing his last<br />\ngame of college football, led his<br />\nteam through a hard-fought contest<br />\n•<br />\nto victory.<br />\n<br />\nBreaking a string of ThanksgivT1w hope's' of Virginia Poly for ing DaY ties; Brown was able to de• leadership in the Southern- Confer- feat Colgate 16 to 13. The game<br />\nplays.<br />\n• ence were sadly shattered by V. M. was, Idled with spectacular<br />\nI. When she defeated the cadets 16: Kevorkia1,_o17Br05t'n, after scorplay<br />\n'1;be te-ehmen could do noth- ing a drop kick, in ,a later<br />\nWas picked<br />\ning against the V. M. L line and blocked a punt, which<br />\na\\‘'ere forced to kick again and again. up and nished over the line for<br />\n-Later in<br />\nDuring the last quarter 'Tech tried -touchdown by Babcock.<br />\non a<br />\nztgain and again to rally by passing the game, Colgate also scored<br />\nblocked kick.<br />\nbut could accomplish nothing.<br />\n<br />\nn their way<br />\n<br />\nto here<br />\nChesterfield cigarettes are now sailing<br />\n780,000 South-Polewards<br />\nwith the Byrd Antarc-<br />\n<br />\nYOU CAN SCORE!<br />\n<br />\ntic Expedition.We are officially informed that the selection<br />\nof Chesterfield resulted from the individually expressed<br />\npreferences of a majority of the expedition's members.<br />\nWhen it is recalled that these are—in superlative sense<br />\n— picked men .. . selected not only for bravery, ability<br />\nand experience, but also by searching tests of physical<br />\nfitness... we may be forgiven for our considerable pride<br />\nin their vote. And something of this pride, we believe,<br />\nwill be shared by all Chesterfield smokers.<br />\nIt is another of the many proofs piling up that the<br />\nsurest way to earn popularity is to deserve it!<br />\n<br />\nfor a touchE are ready to pa,, the ball to you<br />\n. down!<br />\n<br />\n, ,<br />\n<br />\nmade.prospects with<br />\nklf you are ready to tackle our ready,<br />\ninsurance, we will welcome,<br />\na brand new idea in automobile<br />\nmoney making<br />\nthe opportunity to show you its great<br />\npossibilities.<br />\n((Sell us your spare time.-<br />\n<br />\nghe APPLE & BOND Company<br />\nBLDG.<br />\n1401 FIRST NATIONAL BANK<br />\n<br />\nLight, and Redwood Sts.<br />\n<br />\nC11-1 IESTERFI ELI)<br />\nMILD<br />\n<br />\nenough for anybody.. and yet.. THEY SATISFY<br />\nI Iciorrr & NYIll3 youCCO CO-<br />\n<br />\n\f, DECEMBER 4, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER<br />\nFORDYCE E. C. CAMPBELL<br />\nRESEARCH IN PHYSICS LIBRARI<br />\nHome—HO. 2.O9c 3<br />\nPhone, CAI. 1180<br />\nHOPKINS ALUMNUS<br />\nFRANCES T. B.ANNON<br />\nDISCOVERS.1IANYINTERESTI.VG FACTS<br />\nAll Lines of Insurance<br />\nSuccessor to HARBAUGH 6? BANNON<br />\nFast and attemtits to '<br />\nPhone. Ea:a IOC?<br />\n2 E. LEXINGTON ST., Cur. Char!,<br />\nDuring the recent listing of the Earth Stands<br />\n(Room 23)<br />\nDr. Michelson of Bureau of Eth- foreign dissertations and inaugural' prove that the universe 'roteStenographic Dictation, Copying,<br />\nnology Talks on Race Factors addresses in the Hopkins physics about the earth.<br />\nItigraphing, Mimeographing<br />\nMa<br />\nBaltimore<br />\nstartling works: were<br />\nlint the most unti,ual<br />\nBANQUET OPENS SESSIONS library some<br />\nentitled<br />\nHtNNEGEN.BATES COMPANY<br />\nexhumed. One if. these was \"A reasoning was a di,4-ussion<br />\n:tandards.'<br />\nDr. Laidler of League for Indus- Phylosophical Essay Treating of the ate \"Battle of the ,:-J<br />\n'a`rgumen:<br />\nMost Probable Cause of that Grand which presented a bitter<br />\ntrial Democracy Speaks<br />\nJewelers and Silvers17ths.since 185'7<br />\nCOMPLETE<br />\nof Nature. The Flux and against the \"sornethiii;iz bran ne•te<br />\nMystery<br />\nSeventy-five foreign students now Reflux: or. Flowing and Ebbing'of which the \"French people^ing in<br />\nDRESS SETS ,<br />\nA<br />\n-tudying in Baltimore. Philadelphia. the Sea. Printed at three bibles on a bloody -revolution and verT radand Washirigton attended the Sixth the MkIdle of London-Bridge, ical about- that time concluded '0,<br />\nfor evening wear.<br />\n.sgiving<br />\nAmmal International Thank<br />\n1673.\" Vie copy in possession of have.\" The inspired author argues<br />\n.;<br />\nof<br />\nhall<br />\nbanquet<br />\nthe<br />\nin<br />\nheld<br />\nDinner<br />\n7 and 9 East Baltimore Street<br />\nthe library was a reprint made in that the \"Anglo-Saxon world should<br />\nthe Central Y. M. C. A. last Thurssystemi<br />\nmetric<br />\nadopf-the French<br />\nby one W.funk. The original<br />\nday evening. s Mr. E. A. Schaal of 1904<br />\n•<br />\nfounded on a curved '<br />\nJohns Hopkins acted as toastmaster. author gives and reputes nine con- becatte it is:<br />\nDr.<br />\nby<br />\na, straight line. beof<br />\ncause<br />\nCog\"<br />\nline instead<br />\ntemporary opinions as to the<br />\nAfter the entrance march<br />\nJOIN OUR<br />\nPlano<br />\nCo.<br />\nWar<br />\nErnesto Murilhb. Columbian4Consul of this grand mystery of nature. cause its terms are to. cumbrous.<br />\nLABloaa<br />\nTMAS SAVINGS CLU<br />\nCHRIS<br />\nl,929'<br />\nAn Vert<br />\nin Baltimore. Mr. Lewis C. Moore including , an opinion that the sea because of an infinite l number of<br />\nTwegreplt.<br />\nBetween<br />\nown Santa l'aus<br />\ngave the invocation.<br />\nyour<br />\nparbe<br />\nand<br />\nesqraebq<br />\nthe.<br />\non<br />\n• -was the lungs of the terrestial globe. meridians it was based<br />\nCALDER,<br />\nPabowsq<br />\ncourses two short addresses were<br />\nause<br />\nc<br />\nbeParis.<br />\nof<br />\nThen<br />\nmeridian<br />\nanimal.<br />\ngreat<br />\nticiilar<br />\none<br />\nwas<br />\nti44. tlica<br />\nPaid,<br />\ngiven. one by Dr. Y. C. Yin. Pres- which<br />\n•<br />\nlika<br />\ntad,<br />\n.ii-ensive.ip its teligions relaP• X<br />\nident of the Baltimore C1).inese Stu- the author presents hi:s own theory<br />\nLEXINGTON STREET AT LIBERTY<br />\n4<br />\na<br />\nDr,<br />\nis<br />\nfurthest removed 'from .<br />\nby<br />\n\"there<br />\nt:<br />\nvitriol'cing<br />\nother<br />\n::s.<br />\nthat<br />\nthe<br />\nwas<br />\nand<br />\nwhich<br />\nClub.<br />\ndents'<br />\n\\ Branches<br />\n;<br />\nof<br />\nPressystems<br />\nGermany.<br />\nsacred<br />\nof<br />\nand<br />\n'SERVICE.<br />\nPreset<br />\nh<br />\nsalt<br />\nor the scriptural<br />\nIrtngard<br />\nated, volatile or armonisC<br />\nNorth Avenue at Charter<br />\nident of the Baltimore Students; spirit, that is_wrap.d up in the 1.ow- weights and measures, of 411 known<br />\nBelair Road at Southern<br />\nCosmopolitanrClitt- The address<br />\nsysterns..1 The article fervidly conels of the - sea and is there c1:1-:<br />\nProducers of the \"Netcs-Lrre,of the evening was delivered by<br />\nthe ::xe<br />\n\"Let us not be turned aside<br />\nof<br />\nembraces<br />\nthe<br />\nin<br />\nup<br />\nsubHis<br />\nRabbi Morris S. Lazaron.<br />\npaths of rectitude or- rig,htits<br />\nthe<br />\n71:<br />\nupon<br />\nwhich<br />\nsalt,<br />\nsnitrous<br />\nject was \"The Material •Consciou<br />\nNEW LIFE<br />\nTHE GIANT<br />\nTv' the specious devices<br />\nBOOKS<br />\nness in International Relations:: • tion of the superticies of the<br />\nFOR MOTORS<br />\nFUEL<br />\nPOWER<br />\nBeaight—Sold--Exchanged<br />\nThis dinner was the opening ses- and tht. opening of it by the vomit-. blind or wicked guides.\"<br />\nsion of the Fourth Annual Interna- biped and complicated -infression<br />\nWENS BOOK STORE tional<br />\nStudents' Conference, which of the sun and moon dislOges from<br />\n\"STANDARD\" MOTOR OIL<br />\nAt 7:30 last night a meeting of<br />\n605 N. EUTAW STREET<br />\nwas held in Baltimore flint Novemheld<br />\nwas<br />\non<br />\nAssociati<br />\nto<br />\nup<br />\nAthletic<br />\nitself<br />\nthe<br />\nshoots<br />\nand<br />\nits inelosulre<br />\nber 29 to December 2. When the<br />\nThe Measure of Oil Value<br />\nthe margent and drags along with in the .athletic office at the Barn.<br />\nConference met at 3107 N. Charles<br />\ntalked,<br />\nwas<br />\nseason<br />\nfootball<br />\nthe<br />\nstyled<br />\npast<br />\nThe<br />\nwaters<br />\nof<br />\nheap<br />\nthat<br />\nGomtneraal<br />\nNewspapers<br />\nStreet the next afternoon only it<br />\nWork<br />\nSTANDARD OIL COMPANY OF N<br />\ngames were<br />\nBooks<br />\n• thirty delegates were present„ due flux. etc.. -etc.\" Indeed. this Was of and many of the<br />\nEstiblished 1850<br />\nto a heavy downpour of rain falling a grand explanation, provided the played over again. The aii,arding<br />\nauthor understood it, and one of letters to the( varsity football<br />\nPrinting Company !at the time.<br />\nRacial Problem Is Social<br />\nmen was discussed. There was a<br />\nworthy of articles of Junk.<br />\nThomas & Evans<br />\nThe first speaker was Dr. Trus-ion about awarding numerAnother wayward remnant<br />\n1506-1508 Guilford Avenue<br />\nman Michelson of the Bureau of<br />\n:he players on the freshman<br />\na<br />\n:e:<br />\nin<br />\n)(Ind<br />\ny<br />\nphilosoph<br />\nAmerican F.ilmolop- at WashingBaltimore, Md.<br />\n.<br />\n.<br />\n- f.'iqball teams.<br />\nentree<br />\nton. His topic'was \"The Effect of delivered in<br />\nne Vt \" Gifts o- f individual and striking jewelry for Mother, sister, brother, or<br />\nRace Migrations and Population<br />\nfriend. Seahorse hat ornament, brooches, charms and pendants.<br />\n41\"S TELE,r;RAPH DELIVERY ASS,S,CIATION<br />\nChanges on Race Relations.\" Dr.<br />\nItM.EREF.S., FLOE:1,<br />\n,<br />\nMODERATE PRICES<br />\nSON<br />\nEi<br />\nMichelson said that scientific invesj..A. RFTTER<br />\nBe Sure to Visit, Our --Gift'Shop • THE SOUTHERN<br />\ntigation has shown that the differk<br />\nFlorins .:--i<br />\nHOTEL<br />\nCarl Schon<br />\nences within a race are much greatBALTIMORE, MD<br />\n•<br />\n1918 N. CHARLES ST. Nea ::TH<br />\nBahimores Newest<br />\nthe<br />\nStreet<br />\nSaratoga<br />\nw.<br />\nbetween<br />\n109<br />\ndifference<br />\nthe<br />\ner than<br />\nVEracc. i673<br />\n:-: and Fines/<br />\nraces. Culture is not forganicallv<br />\n\"A 'hotel of eumospkrre but‘<br />\nd.<br />\nor biologically - detennirk<br />\n- end Evnitmnvene\"<br />\n-'12::SPArt<br />\n• .: .77.”-csge it.;;-7-141-Vat--leegitage...1.4leturtnine:.<br />\nby the experience of the race as a<br />\nYELLOW CAB STANDS<br />\nnation. In respect to culture North<br />\nBy BRIGGS<br />\nAT<br />\nern Europe has not originated much<br />\nHomewood Field<br />\nbut it has acquired a great deal. As<br />\n35th and Sc. Paul Streets<br />\nI<br />\n_,<br />\nto race migrations. the invader must<br />\nC1-4 GEGRGE.WHAI<br />\n,....-4-------/------ ----.<br />\nMERCY .5A1-<E_S . WHY<br />\n/,<br />\n.,<br />\n31st and Sc. Paul Streets<br />\n7.U5TACE \\n/A.KIT S<br />\ncome itt*reat numbers in order to<br />\nI<br />\nA SHANIE Arai<br />\nService<br />\nTi<br />\nUP<br />\n''<br />\n-IC<br />\nElboent<br />\nSafe and<br />\nBE LITTERS<br />\nI GEE. PCP I'<br />\nAV,<br />\nE.USTACE HAT)<br />\nmake any impression. In Asia<br />\n,PLACE<br />\ni'sZ.o Charge for ban: Passengers<br />\nJuST SC'Et-4T Tv-JO<br />\n4 T N'CL: 1<br />\n' WHY DC1,<br />\nMinor, for example. three types<br />\n-11-4, NG s A N.Y v./Ay<br />\nHOOPS Scf?Tii4G<br />\n'PHONE<br />\n11.NC LAI<br />\nI Do<br />\n,..5McKE. CLD<br />\nhave persisted over long periods of<br />\nEPA ALL CuT<br />\n. VERNON 1212<br />\nis<br />\nnegro<br />\nTHGRP<br />\nGCLDS ?,<br />\ntime. Our antipathy tO the<br />\nFOR A<br />\nrenot innate. Jn -Europe he is not<br />\n.15r4'T A CcuGN<br />\nCAB<br />\nYELLOW<br />\ngarded a,. inCthis country.. Our<br />\n1.4 A CA.SLcP.D<br />\nracial feeling and troubles are soL.<br />\ncial ratherAbatiebiolcgical Jewish-nese: in type is not different from<br />\nus in general. chiefly Oriental TO<br />\nrealize the fullest possibilities of a<br />\npeople, it is neces..:sary to study them<br />\n:n their original home. The racial<br />\nquestion is a matter of tc4eration<br />\nabove all e:se. He pointed out that<br />\nalthough the capability of speech is<br />\nblologicallv deterniined, what particular speech an individual may<br />\n:Ise is<br />\ndeterrhinecl.<br />\n<br />\nINTERNATIONAL STUDENTS<br />\nHOLD 4TH CONFERENCE<br />\n<br />\nR.<br />\nTAYLOR<br />\n<br />\nPARK BANK<br />\n<br />\nESSO<br />\n<br />\nThe Carl, Schon Christmas<br />\n,hop is ready<br />\n<br />\n11-hcn a 1=ellcr Needs a Friend<br />\n<br />\n\\<br />\n<br />\n1<br />\n\\<br />\n<br />\na drag<br />\n<br />\nith a<br />\n<br />\ni_eartiet: professors<br />\nstud wise students<br />\nfind the easiest wav<br />\nto have adrag Avith<br />\nthe fair sex is to<br />\nNear<br />\nBrat burn<br />\nUniversity<br />\nOothes<br />\n/<br />\nFt.<br />\n<br />\n84^ $45<br />\n<br />\nClothias and ffsberi.:s.. hers<br />\n<br />\n...11-11EIDIUELT0,<br />\n17 E. Baltimore St.<br />\n<br />\nRace Dotaisiatioa.for Pro&<br />\nThe second address .cf the afternoon was delivered by Dr. Harr..<br />\nLaidler. Executive Director of the<br />\nLeague for Industrial Democracy.<br />\nHis topic was. \"Specific Inter-racial<br />\nEconomic Problem.\" Most of<br />\nthese'arise from the exploitation oi<br />\n..ne race by: another. Those who<br />\nhave orleained economic benefit by<br />\nthis exploitation have supported<br />\n\"the right of gaperiority: Exploitation causes the dominant race ec<br />\ntry to keep educational advantages<br />\nfrom the dominated race_ Then it<br />\nCostameet ow Page 4, Col. 3<br />\n<br />\nFRANK'S<br />\nLight Lunch<br />\n5 W. Tv.,enty-tirn Sc.<br />\nOpen 9 3,0 A. M. to Nfichuglit<br />\nPhone CAN,: t9-,<br />\nTHE CHARLES E. MYERS CO.<br />\nitiaatirer ot<br />\nNta,<br />\n<br />\n(RUBBER STAMPS<br />\nThe Service Shop<br />\n319 W Redwood Sc.<br />\n<br />\nVol<br />\n<br />\n811<br />\nIns<br />\n<br />\nCAI<br />\nDo<br />\n<br />\nFa<br />\nhand<br />\nany<br />\nseas(<br />\nout team,<br />\nstroll<br />\nStrae<br />\nCapli<br />\nnude<br />\nteam.<br />\nin L<br />\niiIls<br />\nblot<br />\nthrou<br />\npeels<br />\nfougli<br />\ntake<br />\nto an<br />\nyea<br />\n<br />\nI la•<br />\nbelts,<br />\ndust<br />\nfront ;<br />\n<br />\nYorke<br />\ning in<br />\nthe itni<br />\n<br />\ntime<br />\none by<br />\nmore<br />\ngame.<br />\ntune<br />\n-eleven<br />\ntime sa<br />\nthe III<br />\nLyons<br />\n<br />\ngame;<br />\nfield a<br />\n*ginnth<br />\nwas ce<br />\n<br />\ngenerz<br />\nhad j<br />\nfor th<br />\n<br />\nnecess<br />\nior a<br />\n<br />\nI,2ar<br />\nSpot i<br />\neasily<br />\nscore:<br />\n. made<br />\nstreng<br />\n<br />\nA ft<br />\n<br />\ngames<br />\nBlue:<br />\nMaryl<br />\nset-ba<br />\nwent<br />\nin th(<br />\nthem<br />\n<br />\nTh(<br />\n<br />\n,<br />\n<br />\nexpect<br />\nunder<br />\nscore<br />\nland g<br />\none b<br />\nbe reg<br />\ner ant<br />\nall thi<br />\n<br />\nLD GOLD<br />\n<br />\nIn<br />\nkins<br />\nheld I<br />\nVan<br />\n<br />\n'The Smoother and Better Cigarette<br />\n<br />\nPoints<br />\noppou<br />\n<br />\nnot a cough in a carload<br />\nC<br />\n<br />\nCa.Est. IMO<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. XXXIII, No. 18<br /><br />\nMARYLAND HARRIERS<br />\nWIN OVER HOPKINS<br /><br />\nOMEWOOD, BALTIMORE, MD., DECEMBER 4, 1928<br /><br />\nFIRST COTILLON TO<br />\nBE LED BY KEGAN<br /><br />\nPRICE 5 CENTS<br /><br />\nARYLAND OUT FOSTERS INTERRUP7 DESPERATE<br />\nTHEIR OWN FUNERAL FESTIVITIES<br /><br />\nJAYS FALL BEFORE SUPERIOR<br />\nPOWER OF GREAT MARYLAND TEAM, 26-6<br /><br />\nAniid the cheers of enthusiasts, ing edict that the corpse could not<br />\nthe jeers of opponents, the impre- be removed, from the hearse and Weakness of Hopkins Line Chief Contribution to<br />\nBiggest Recent<br />\ncations of officers of the law and further profaned by the impious<br />\nDefeat at Hands of Old Liners<br />\nthe curs.'; of delayed theatre-goers, hands of J. II. U..underkraduates.<br />\nSCHIEBEL SETS RECORD<br />\nThe good General, schooled, no CAPLAN'S SCORE FROM KICKOFF AT START<br />\na sturdy but not over-large continOF SECOND HALF PROVES SENSATION OF GAME<br />\ngent of Jay rooters and exponents doubt, by the exchange of pleasHopkins Star Easily Outruns<br />\nextraordinary .of college spirit in- antries between Poly and City less Lyons Is Other Luminary for Hopkins Eleven; Strader<br />\nField for Victory<br />\nInjured;<br />\ndulged in another parade Wednes- than a week iireidously, feared a<br />\nSnyder, Terrapin Back, Is Star<br />\nreinand<br />\nscrimmage,<br />\n\"general\"<br />\nindulging<br />\nhopes<br />\nnoisily<br />\nnight,<br />\nday<br />\nWednesday,<br />\nthe<br />\nBlack and<br />\nLast<br />\nMaryland had too much power<br />\nthat Were fore-doomed to come to forced himself with two inspectors<br />\nBlue Cross-Country team jourfor the Blue Jay team—therein lies as they ran down the field. When<br />\nlieutenants<br />\ncaptains<br />\nand<br />\nmore<br />\nand<br />\nnothing.<br />\nneyed to College Park to test out<br />\nwhole story. The Terrapins they reached the fifty-yard thark the<br />\nAn innovation was the use di than college students can count, in the<br />\nhe. strength of the Terrapins.. Led<br />\n29 first downs to the Jay's Blue jerseyed men began to take<br />\nearned<br />\nforce<br />\nof<br />\nand<br />\nthe<br />\ndignity<br />\naddition<br />\nto<br />\ncarabout twenty'appropriate signs<br />\nby Captain. Myers, the stfOng team<br />\n7 and' covered 425 yards by rushing out the remaining Terrapins until<br />\nried by as. many individuals from the praetorian presence.<br />\nof Maryland defeated the Jay harAfter fifteen minutes of singing, as compared to 66 yards for Hop- all but three of them were on the<br />\namong the hundred and fifty who<br />\nriers by a score of 20 to 35. Up<br />\nyelling, and similar evidences of a kins. Time and time again on the ground then Caplan put on some remarched.<br />\nuntil the time the' half distance<br />\nLiners serve steam, tore by the first, slipA scaffold for the burning of Mr. proper collegiate enthusiasm, a ma- same off-tackle play the Old<br />\nMarker - was passed it would have<br />\njority of the men turned their went through the Blue line for five ped off the secopd, and ran away<br />\non<br />\nCity<br />\nbeen<br />\nerected<br />\nTerrapin<br />\nhad,<br />\nbeen difficult to forecast the outfrom the third to cross the goal line<br />\nHall Plaza add left in the charge thoughts and consequently their or ten yards; time and time again<br />\ncome,,...-but after the mid-oint was<br />\na<br />\nmusketeers. But fifty feet toward the Homewood campus, husky Snyder of the Terrapins second later. A scOre from the<br />\nof<br />\n'three<br />\npasSed the victory of Maryland bekick-off! Jay fans went into hyswarriors froni Maryland turned up the C. E. Hall, pretzels, and beer. dragged several Jay tacklers four or<br />\ncame evident and aSsurea.<br />\nmembers five yards before , he was fi.nally terics as the two teams lined up for<br />\nconsiderate<br />\nthere<br />\nthe<br />\nFor<br />\n-work<br />\nof<br />\nthe<br />\nshort<br />\nand made<br />\n_<br />\n.<br />\n_<br />\nthe next •kick--off.<br />\n, From the first the -odds- Nvere<br />\nwork of Hopkins men, and the of the Varsity Club had prepared pulled down.<br />\nThe score triight have been closer<br />\nBright Spot<br />\nagainst the Jays.<br />\nthese delicacies for the war-worn<br />\nscaffold was burnt.<br />\nStartling Revelations Are<br />\nbit for two bad breajcszhanded the , The play was one on which the<br />\nMaryland had defeated the<br />\nAt Charles and Center Streets, and tired-footed paraders.<br />\nMade by Exams<br />\nBlue Jays had been coached all<br />\nstrong teams of Washington and<br />\nthe same,or another fifty farmers The'luckless cheer leader, under. Jay eleven. Tlzfirst one came<br />\nLee, and the U. S. Naval Academy, If freshmen can be considered as assailed the peaceful.parade of the the harsh necessity of returning to when Lyons made a beautiful run season and even though they came<br />\nand had lost to Virginia .Poly- men, much promise holds out for polite Hornewooders with eggs and safety certain parade properties, had through theline to cross the Ter- out on the long end of the score it<br />\ntechnic Institute only after a hard the future of mankind according to other accompaniments of a class to forego the pleasures of the jug, rapin's oal line only to have the provided at least one bright spot in<br />\nfought battle. On the other hand the results of the physical exams, rush (old style). In the ensuing but arrived in time to officiate at ba brought back to its starting the afternoon for the Jay fans. The<br />\nthe Jays had one victory and one given to 16 tons of freshmen. For, ,melee, a sign carried by a freshman the cremation of the Maryland ef- lace because one of the Jay line- Terrapins were completely fooled<br />\nmen were offside; the second came on the play. On the preceding kickdefeat to their credit. This meet nof only did the specimens of '32 was made away with, but finally was figy: The solemnity occurred<br />\nwhen Roberts interfered with Wetz- off Bobby Lyons had only followed<br />\nside the C. E. building.<br />\nbrought to a close the schedules of compare most favorably with those restored unharmed.<br />\nThe Varsity Club s oker-,.-they el as he was about to receive a pass the flying wedge which carried Capthe cross-country teams of both col-. of previous years physically, but The floats were..formed into a<br />\ncalled it that---Ino • up at about a over the goal line—everyone in the lan to score for ten yards when he<br />\nleges.<br />\nalso mentally. The freshmen dem- large circle on Lexington Street for<br />\nand everyone stands saw it but it slipped the at- suddenly cut off to the right. This<br />\nufon the Plaza.. quarter past e<br />\nSchiebel Leads<br />\nonstrated how much more intelli- the final 'onslaught<br />\n. • At the start Scniebel, who<br />\npyking had been prohibited on returned h e—presumably—in a tention of the referee. With these move earlier in the game on the<br />\nAll<br />\ngent the successive classes are beegree of sobriety. Per- two breaks'for the Jays instead part of the Hopkins quarterback<br />\nseemed to be in the pink of condistreet at this point. The \"Beat .varyin<br />\ncoming by increasing the majority the<br />\ntheir dreams regaled them of against them the score would had made the Old Liners a bit wary<br />\nMaryland\" sign in lead of the ha<br />\ntion, took.the lead, which he easily<br />\n\"of eleven, by which last year's enth visions of a sweeter aftermath have at least been a bit more close. of throwing themselves into the way<br />\nsucceeded in holding all through the<br />\nparade was ripped down ,as the<br />\ntering students favored the R. 0. T.<br />\nof the massed interference so that<br />\nMaryland Scores<br />\nto their activities than. the succeedrace...Nlyers was able to trail<br />\nPlaza was reached, and as the r<br />\nC.-in preference to physical training<br />\n'Maryland's first score came about Caplan got the full benefit of his<br />\ner„.s.-- rted to do their st<br />\nJ.WD ing day_br.ought forth,<br />\nSchiebel up- uutil_the_begimting_of<br />\nby five. The ,enrollmerd was 0the—Opening<br />\nniinurei<br />\nafter<br />\ne<br />\neven<br />\nteammates'a.'ssistan-ce.<br />\nhundred College Par rs,—well, A horse-drawn hearse, a horsethe last mile, at which time SchieT. C. 126, PT., 110'.<br />\ndrawn brouse of the vintaf 'of whistle. The Terrapins harreceived<br />\ncreated some excite nt.<br />\nJust after the sensational run by<br />\nbel lengthened his strict, ,and<br />\nThese freshmen proved them- Their boos an tsses greeted the 1880, the farno`us old Hup and the the kick-off and immediately began Caplan the Jay team<br />\nseemed to -take wings,and -flj,. From<br />\ngot a break<br />\nfaithful Hopkins indispensable tally-ho figured prom- to display the power, that charac- which might have changed the<br />\n• then on he gradually pulled away selves to be mightiest that ever cheers fro<br />\nentire.<br />\nterized<br />\ntheir<br />\nplay<br />\nduring<br />\n'the<br />\ninently<br />\nin<br />\nthe<br />\nprocession,<br />\nWhich<br />\nwas<br />\nof<br />\nscore considerably if it had been<br />\nfrom his opponent and easily' took took the exams by breaking the throats, and in turn the exertion<br />\ncontest. The Jay line seemed too<br />\n, first place. His time for the five strength test record with an aver- Bla and_Plue vocal chords was illuminated by. flares that were dis- weak. to stand up under the tre- taken off in the proper manner.<br />\nand three-quarters mile course war; age score of 571 -points. However ansferred from hurricanes of tributed all along the line of Intl-ch. mendpus drives of the -Raven team Roberts received the kick-off for<br />\npraise for their team and school to All participants are said to have enMaryland and fumbled the ball<br />\ntwenty:<br />\npine- injuntes and eighteen the sffhomores, -whose score<br />\nand soon the ball. was over the goal<br />\nthemselves-4=W_ _cheerjirssoaal of General joyed<br />\n_<br />\nAstataaw<br />\nwhen<br />\npkins tackeler -bit<br />\n_list<br />\nfoT-the<br />\nfirst<br />\nscore<br />\nOf<br />\n-The<br />\ngame.<br />\n,looking<br />\na<br />\no7tbe<br />\ns<br />\nten`pOintiTes<br />\nGaither's irrevocable _and- unwaver- leaders.<br />\nBialoskorsky recovered the ball fat'<br />\nThis time broke the previous recMcDonald,<br />\nhusky<br />\nright<br />\ntackle<br />\nof<br />\nthe<br />\nHopkins. Jay rooters were expect.<br />\nord for the course and lowered it banciliet season fight are undautit<br />\nOld Line team, was drawn out of<br />\nthat the average Radical Group Here<br />\ning a score but were sadly disapDella Upsilon To Be<br />\nfifteen seconds. _ The best previous ed. They cla<br />\nthe.line to the back-field and added<br />\ntime was made by Captain Myers in was boost iy the freshmen's high •<br />\nInstalled December 8 the extra point in a fine manner. pointed when the opportunity was<br />\nEffects Organization<br />\nspoiled ,by Madigan who intercept\"<br />\nthe Washington and Lee meet<br />\nscore on the forearm (grip)<br />\nHopkins received the subsequent<br />\nInvitations have been issued by<br />\ned a Jay pass on his own 25-yard<br />\nafternoon ten<br />\n•-Oral weeks ago.<br />\nength test and hold for example . Last Wednesday<br />\nkick-off and things began to look a<br />\nAfter' Schiebel had .breasted tl the present senior class which held graduate and undergraduate mem- the Pi Kappa Chi Fraternity to the bit better to.the Jay rooters.+ Lyons line. ,Maryland kicked poorly and<br />\nthe ball went to Hopkins on the 45tybers of the University formed a installation ceremony of the Johns<br />\ntape to carry off first place. t<br />\nthe previous record of 567 points, group known as \"The Radicals.\" Hopkins Chapter of the Delta Upsi- and Caplan took the ball within yard line. This time the Old Lintwo seconds elapsed lief° another<br />\nscoring<br />\ndistance<br />\nof<br />\nthe<br />\nRaven<br />\ngoal,<br />\nline. This noting the latter', strong handshak- The League for Industrial Democ- lon Fraternity, which is to succeed but were not successful in putting ers took the ball on downs and four<br />\ntran crossed , the fin<br />\nracy had written one of its mem- the Pi Chi's on the campus. These it over for a score. .In spite of the plays later Snyder made„a 65-yard<br />\nwas • Captain My rs of Maryland. ing qualifications.<br />\nconcerning the for- invitations have been extended to all fact<br />\nwho made the course in twenty-nine<br />\nUmberger was'.the mightiest of bers at Hopkins<br />\nthat they lost the ball the Jay run to score Maryland's third<br />\nmation of a local chapter here. An activities to attend a reception at the team had showed that they, too,<br />\ntouchdown.<br />\nminutes and forty seconds. .<br />\nhad<br />\nthe mighty with a score of 1011<br />\nScore Does Not Count<br />\norganization meeting was held in chapter house, 3100 Calvert Street, power and the game was not to be<br />\n•<br />\nSonic few more,seconds went by<br />\nhighest indiyear's<br />\nLast<br />\npoints.<br />\nSaturday -afternoon, December,8, at<br />\nSoon after this the Jay team<br />\n-before two Maryland- mem-BowR29.,Lir 315 Gilman<br />\nr*t.te<br />\n9231points. Th<br />\negtrillatrtettr<br />\n.<br />\nour-Vtlottc:<br />\nreal- pivir'atr'd`socceeded- n<br />\n-4min and 1-;Insey,- crossed_ the - lit vidual score xt as<br />\nquarter ended sherily after with the<br />\no'clOck. Ten students attended, the<br />\ntogether, to tie for third place. Fol- class of 1909, the first to take the greater part of them being from the served the guests.<br />\nball 'deep in Hopkins' territory and getting the ball on Maryland's 15That nighr a formal installation<br />\nlowing closely on their heels was exams, made the lowest score rethe score 7-0 in Maryland's favor. yard line. Bobby Lyons was leadolitical economy department.<br />\nbanquet will be held-at the Southern<br />\nRemsherg who took fifth place. ., corded, which was but 429 points.<br />\nThe opening of the second quar- ing the attack and was doing a<br />\nthe pur- Hotel, k which the speaker will be ter was about like the first: Mary- mighty-good job of it hurling passes<br />\nAfter some disusai<br />\nAnother tie was witnessed dur- The scores have steadily risen, culDawes, the<br />\nwhich got the Terrapin backs up in<br />\ning-ftlre- race, when Piumbley and<br />\nposes and. work Of the group were either Vice-president<br />\nland made a touchdown soon after<br />\nminating in the present record, and<br />\nHon. Charles Evans Htighes, or<br />\nthe air and running the ends for<br />\nWallett crossed the line with locked<br />\nsocial<br />\nthe<br />\nstudy<br />\nset forth. It is to<br />\nthe<br />\nwhistle<br />\nhad<br />\nblown.<br />\nFrom<br />\nthen<br />\npoints,<br />\n480<br />\nabout<br />\nthe<br />\nGeneral Lord, director of<br />\naverage<br />\nsubstantial gains. It was here that<br />\narms, to tie for si5ctft place.<br />\ncontrol of oil, coal, power, a`nd other budget. All three are active in the on until the end of the half the<br />\nHopkins got one of its two bad<br />\nThe average age of the class was<br />\nKelly Finishes<br />\nprogram<br />\nat<br />\nThe<br />\nindustries.<br />\nbasic<br />\nfraternity. All alumni of the Pi gains was continued on about even breaks: Lyons took the ball right<br />\nThe second Jay Harrier to cross eighteen, the same as last year. This<br />\npresent will be an educational one Kappa Chi and Delta Upsilon fra- terms; neither club having 'an ad- through the center of the line and<br />\n4- the finish line was, Captain Ke<br />\nis about four-tenths years below<br />\nwent over the goarline for what<br />\ndevoted to intensive study among ternities resident in the city are ex- vantage over the other.<br />\nEmerson was the next to complete<br />\nenterexamined<br />\nthe average of all<br />\neveryone thought was a score. This<br />\nthe run and one of the three Jays<br />\nthe few members with the ultimate pected to be present.<br />\nCaplan Makes Run<br />\nThe lowest age record<br />\nThe Hopking chapter will be the<br />\nThe first minute Of the second was not to belowever because one<br />\nwho succeeded in placing;Since only ing classes.<br />\npossibility, when the membership<br />\n'23 with<br />\nfifty-fourth of the national organithe first ten men crossing the line was made by the class of<br />\nhalf<br />\nsocialist<br />\nprovided both the-Hopkins and of the Jay linesmen was off-side<br />\nbringing<br />\nhas increased, of<br />\nlong favorand the score was disallowed. Hopare included in the scoring. 'Kibler, an average of 17.1 years. This rec- speakers before the campus. At zation. The Pi Chi's,<br />\nthe<br />\nMaryland<br />\nfansivith more excampus,<br />\nwere<br />\nably regarded on the<br />\nkins still had three plays on which<br />\nof Maryland, was the tenth and last oid was due to the conditions durcitement<br />\nmembers<br />\nthan<br />\nany<br />\nother<br />\nthe<br />\nof<br />\nfifteen<br />\nminone<br />\nmeeting<br />\nfirst<br />\neach<br />\nfounded in 1905. They are the<br />\nto make the score and it was on<br />\nscoring man to reach the line.<br />\ning the war. Lyddane and Isaacs, will be expected to make a report. to receive a national charter since utes. Once again. Hopkins was rethe last of these three that the secThe only casualty of, the day be- both fifteen, are the two youngest<br />\nceiving the kiik-off. The ball soar- ond unfortunate break<br />\nThe members are supposed to be Alpha Tau Omega in 1924.<br />\nfell Connell of 'Maryland. When<br />\noccurred.<br />\nfreshmen. Last year two freshmen<br />\ned high and straight right into the Lyons threw a perfect pass to Wetto the socialist<br />\nhe had completed approximately a<br />\ncommitted<br />\ndefinitely<br />\nsumof<br />\nnumber<br />\nsame<br />\nthe<br />\nmustered<br />\nsixth of the course, he pulled son,<br />\nhands of Howard Caplan. The zel who was over the goal line but<br />\npoint of view. As the chairman Blue Jay Orchestra<br />\ntendons in his left leg and w- mers.<br />\nsaid,\"We want to say definitely that To Contain Twelve Men diminutive,Jay back caught the hall as he was about to catch the ball<br />\nthereby compelled to drop out.<br />\nBerman carries the most weight we are socialists, that we believe in<br />\nWhen the Blue Jay Orchestra neatly and paused a moment to al- Roberts grabbed his arm and he<br />\nUnlike the four and one-half mile in the class, an avoirdupois of 228<br />\nsocialization of basic industries makes its first appearance of the low his team-mates to form into in- misied it. All Hopkins yelled \"inthe<br />\nTerrapins<br />\nthe<br />\ncourse at Hopkins,<br />\npounds, exceeding by one pound and the democratization of labor.\" season it will once more be the terference and then started down<br />\nterference\" but the referee did not<br />\nboast of a five and three-quarters<br />\nweightiest man of the sopho- Mr. Spicer.of the political economy famed \"Twin-Six\" of bygone the field with the ball securely<br />\nthe<br />\nis<br />\nit<br />\nlonger,<br />\n-mile route. Although<br />\nsee it that way so the ball went to<br />\nclass<br />\nthe<br />\nof<br />\nweights<br />\nyears,<br />\nlast<br />\nthree<br />\nfor<br />\nthe<br />\n'Not<br />\nThe<br />\nyears.<br />\nHopmores.<br />\ntucked under his arm. Up to the Maryland. The Terrapins scored<br />\ndepartment, was elected chairman of<br />\nprobably not as difficult as the<br />\nlast<br />\nthan<br />\nEnoch<br />\ndeparture<br />\nof<br />\nless<br />\nsince<br />\nthe<br />\nor<br />\nno<br />\n5<br />\npounds,<br />\naverage 138<br />\nkins course because it has<br />\ncenter of the field the Jaymen did once more before the contest was<br />\nthe Club.<br />\nLight, has there been a large group<br />\nstreams to cross, which is a difficult year. The heaviest class examined<br />\nmeeting of \"The Rad- in the Jays. The entire arrangement not leave their feet to take out any ended to make the score 26-6.<br />\nnext<br />\nThe<br />\nweight<br />\nfeature in itself.<br />\nwas '29 with an average<br />\nicals\" will be 'held at 1 P. M. on is complete now, with the exception of the Mryland tacklers, they<br />\nHoward Caplan and Bobby Lyons<br />\n.The summary follows:<br />\npounds. Motry who weighs<br />\n140<br />\nof<br />\nmerely brushed them out of the way<br />\nof a tuba player.<br />\nMonday, December 10.<br />\nContinued on Page 5, Col. 2<br />\n1. Schiebel, Johns Hopkins, 29.18;<br />\nContinued on Page 5, Col. 2<br />\nContivrard an Page 5, C°1. 3<br />\nPoorest Performance of Season<br />\nby Black and Blue<br /><br />\n\"Bill\" Kegan,\" president of<br />\nthe senior class, and captain of<br />\nthe lacrosse team, will lead- the<br />\nfigure at the First Cotillon<br />\nFriday evening. The affair<br />\nwill take place at Lehmann's<br />\nHall from ten 'til ,two.<br />\nThere will be a raise in the<br />\nprice of adniission over that<br />\nof other affairs of the past,<br />\nthe price being $3.50 a couple<br />\nor $2.50 stag. But the fact.<br />\nthat this affair will be on a.<br />\nhigher level than past functions i expected to compensate<br />\nfor the increase. Gold andl<br />\nsilver favors will be presented<br />\nand refreshments served.<br /><br />\nARE FRESHMEN HUMAN?<br />\nREAD THIS AND WEEP<br /><br />\n4111111,<br /><br />\nER 4, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMB<br /><br />\nTILDES110PlgISINSIETTE<br /><br />\nTHE BARNSTORMERS<br /><br />\nby \"BEN\"<br />\nThe, Barnstormers Club is by dramatic club should produce at<br />\n$2.00<br />\nfar the most. worthwhile organi- least two, and preferably three or<br />\nSubscriPtion<br />\n'<br />\nzation on the campus, but, as has four plays each year, and it isa<br />\nin<br />\nPostoffice<br />\nat the<br />\n,Entered as second-class matter December 3, 1909,<br />\n1879.<br />\nbeen said before, there is room fact that at many of our Cniver,<br />\nBaltimore, Md., under Act of Congress November 3,<br />\n.ities such as North Carolina'and<br />\nfor improvement.<br />\nJohns<br />\nof<br />\nstudents<br />\nthe<br />\nby<br />\nJune<br />\nto<br />\nOctober<br />\nthe number is far great,:<br />\nPublished semi-weekly from<br />\nThe policy which this organi- Cornell,<br />\nHopkins University.<br />\nAnother thing always an essenhas adhered to. for quite<br />\nzation<br />\nbe addressed to the BUSINESS MANAGER,<br />\nof producing but tial part of arty dramatic club's<br />\nBusiness communications should<br />\narticles should be sent to the MANAGING' some time, that<br />\nJohns Hopkins University. All the<br />\nis not likely to success is the possession of its<br />\n-CHIEF.<br />\nyear,<br />\na<br />\nEDITOR-IN<br />\nplay<br />\none<br />\nto<br />\ntions<br />\ncommunica<br />\n&amp;arms; other<br />\n• produce either any Publicity for own theatre. For obvious reasons<br />\nUniversity 0100<br />\nthe University' or any real dra- this has been impossible in. the Telephone<br />\nmatic talent in die club itself, past, but since the Homewood<br />\nboth of which would be desirable. Playshop is now vacant, a valEDITORIAL DEPARTMENT<br />\nIt seems evident that if the Bar - uable opportunity presents itself.<br />\nEditor-in-Chief<br />\nstormers really .are earnest n<br />\nGnoacz E. BRNICS, JR., '29<br />\nThe many advantages which the<br />\ntheir desire to follow out their'<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nin the Hand- Playshop offers are rather self:'39<br />\nGuine,<br />\npublished<br />\nas<br />\n\"deal\"<br />\nGEORGE<br />\n'29<br />\nNzss,<br />\nW.<br />\nTimm.<br />\nto itself<br />\nbook, they must make a drastic evident. Being a building<br />\nAssociate Editors<br />\n'29<br />\nWOOD,<br />\nus<br />\n.amount<br />\nH.<br />\na<br />\ntremendo<br />\nRICHARD<br />\nit<br />\nprovides<br />\n'29<br />\nWILitiat II Darns;<br />\nchange in their policy.<br />\nROBERT S. BALM, '30<br />\nof privacy, a factor which cannot<br />\nIn that ever-ready. ,source of<br />\nEditors<br />\nJunior<br />\nbe taken too seriously; and which<br />\ninformation, *the Handboblz, We<br />\n, W. Purnell Hall. Jr.. '30<br />\nStewart L. Smith. '30<br />\nat the<br />\nE. Foster Dowell, '29<br />\nThe Barn- has never 'been possible<br />\ng:<br />\nfollowin<br />\nthe<br />\nfind<br />\nnarci B. Holley, '29<br />\nRichard G. Hunt, '31<br />\nthe<br />\nupon<br />\nis<br />\nit<br />\nAs<br />\ndireetly!<br />\nBarn.<br />\nIf. Garland Hershey, '29<br />\n'31<br />\nJr..<br />\ndraHarwood F. Mullikin.<br />\nstormersis an undergraduate<br />\nPaul W. Spear, '30<br />\nIrving K. Gordon,T29<br />\ntamp as4t-,'euldalle-v-iate the<br />\nGeorge H. Dowell, '31<br />\nto<br />\nmuch<br />\ndoes<br />\nivhich<br />\nclub<br />\n'31<br />\nmatic<br />\nDarmiger,<br />\n• Lewis<br />\nRobert F. Skutch, '30 •<br />\ncessity of paying a large rental<br />\nbring the University before the<br />\nStreets,<br />\nfor the Lyric or. any other dCmii<br />\nSouth<br />\nand<br />\nLombard<br />\nCompany,<br />\nPrinted by The Read-Taylor<br />\npublic eye. It is growing to be a<br />\nBaltimore. Md.<br />\ntown theatre, and the mere fact<br />\nis<br />\nit<br />\nfor<br />\nitself,<br />\nby<br />\nclass<br />\nclub in a<br />\nits possession would Undoubtof<br />\ncontemplating producing genuine<br />\nedly provide ,a powerful stimulti Hopkins plays written and staged<br />\nthat would effect a hearty reentirely by Hopkins talent.<br />\nsponse front the student body.<br />\nearnest.<br />\nin<br />\nis<br />\nt<br />\nIf this statemen<br />\nWhether or not the Barnstormers<br />\nthe.Barnstormers have set themVICTORY IN DEFEAT<br />\ndo take over the Playshop is still<br />\nselves a high mark, but it is one<br />\nrooters received lita problem. Reports vary pro -and<br />\nN•the eve of the Maryland fracas, Hopkins<br />\nlocal<br />\nour<br />\nof<br />\nwriters<br />\nsports<br />\nwhich if achieved, would amply<br />\nthe<br />\nfrom<br />\nhope<br />\nor<br />\ntie consolation<br />\ncon, but no reliable information<br />\nJays<br />\nthe<br />\nthat<br />\nadmitted<br />\nrepay any efforts made. It is tc<br />\ndailies. These typewriter thumping experts<br />\nhas...reached the campus.<br />\nfight but to certain defeat they<br />\nefno<br />\nwould put up their customary strong Raven eleven had conquered<br />\nbe regretted therefore, that<br />\nA rumor has been current that<br />\nwere surely doomed. For the powerful strong Washington and Lee<br />\nforts have been made in that dithe mighty Yale they had beaten the On the other hand, HopSwindell,--is to resign as<br />\n\"Pop\"<br />\n.<br />\nunderfoot<br />\nhas<br />\nVirginia<br />\none<br />\nno<br />\nthat<br />\ntrod<br />\nrection'. It is true<br />\nteam and had<br />\nsteam-rollered by St. John's.<br />\nbeen<br />\nhad<br />\nthe 'stormers. This is<br />\nof<br />\ncoach,<br />\nbefore,<br />\ndays<br />\nten<br />\njust<br />\nkins,<br />\nbeen discovered at -Hopkins of<br />\nweak, inexperienced and<br />\nCompared to Maryland, the Jays appeared<br />\ngreatly to beregretted, for it has<br />\na<br />\nhave<br />\ndidn't<br />\nthey<br />\nprea<br />\nexperts,<br />\nwrite<br />\nto.<br />\nfootball<br />\nability,<br />\npuny. In the opinion of the<br />\n; sufficient<br />\nbeen- due to \"Pop's\" devPtitur<br />\nchance<br />\nsentable play, and it is riot prohdefeat<br />\ncertain<br />\nthough<br />\nEven<br />\nup.<br />\ngive<br />\ntintorke,..tnergy that the club has<br />\ndidn't<br />\nseeh<br />\nJays<br />\nv<br />\ni..<br />\nable<br />\n--... But<br />\n'<br />\nbattled<br />\n.,one conclusion, they kept fighting.. They Time ,<br />\nbeen soTsuccessfitl in the past.<br />\nwas aim<br />\ninch of the way.<br />\nwill be found, but we are of the<br />\ntheir stronger, more powerful opponents every<br />\n\"Pop's\" example furnishes a strikhimself against the blue<br />\nopinion that if an attempt were<br />\nafter time, the phenomenal Snyder hurled concerted flank attacks<br />\ning instance of an alumnus acjerseyed lineiile Evans and. Roberts made<br />\nmade in' this direction, even<br />\nJays -fought. .<br />\n, on the Blue Jay Wings. Still.the,<br />\ntively- interested in an underkradcatise, the Hopkins.<br />\nthough' the result be crue,'<br />\nFacing overwhelming odds, fighting a bit a glorious victory.<br />\nnate aetity, and it is rtot unlikewon<br />\nthey<br />\ndefeat,<br />\nin<br />\nbecome<br />\nEven<br />\nwould<br />\nbattling.<br />\nrmers<br />\non<br />\nthe.Barnsto<br />\neleven kept<br />\n.hooks. It was rather<br />\nresignation vill pro.that •<br />\nly<br />\nNot a victory for the scoreboard or the record ilehning Odd5.--:- 'sasasëjs more<br />\nto<br />\n,<br />\nDO<br />\n• s<br />\ninterestm t<br />\n-1.--gdpeib-triumph-of-gcl-plut-lost_overw<br />\nduce a-s<br />\n.<br />\nface.<br />\npossibly<br />\nversity.<br />\ncolhl<br />\n- that any football team<br />\nclub; Such a slump would go<br />\nEven though the plays were<br />\n•<br />\nhard with- the •Barnstormers, and<br />\n,.<br />\nplainly<br />\nquite<br />\nshowed<br />\nand,<br />\ncrude<br />\nit behooves them to make .prep•<br />\nthe mark of the amateur, the net<br />\n• arations now for the selection of<br />\nON SECOND THOUGHT<br />\n.<br />\nresult would justify the sacrifice.<br />\nthe<br />\na successor, since the direction<br />\nopinion that<br />\nthe<br />\nventured<br />\nwe<br />\ncolumn,<br />\n-this<br />\nin<br />\nstands<br />\nAST week,<br />\nIn addition to this'the fact<br />\nthe downtown<br />\nand coachirig Of the plays coulil<br />\nstaging of another pre-game parade through<br />\nout that the plays selected-by the<br />\nstrongly objected to the exstreets was an unwise procedure. We<br />\nhardly be handled by the club it !<br />\ninsisted<br />\nWe<br />\npurposes.<br />\ng<br />\nadvertisin<br />\nalthough<br />\npast,<br />\nfor<br />\nthe<br />\n'stunners in<br />\nploitation of the student body<br />\nself. There are several members<br />\nthe heels of the St.<br />\non'<br />\nclosely<br />\nso<br />\nollowing<br />\nf<br />\nparade,<br />\nthat another<br />\nthe work - of professionals, have<br />\n:of the faculty here at the Coiner<br />\nJohn's demonstration, wOuld be \"ineffective.\"<br />\nmering<br />\noutstand<br />\nany<br />\nheld<br />\nof<br />\nbeen<br />\nwas<br />\nnot<br />\ncelebration<br />\nIn spite of our strenuout objections, the of Niollege spirit and<br />\nsity who are quite capable of car<br />\ns<br />\nitr-In recent years they have preanyhow. We were branded as demolisherbooed on every side and<br />\nrtiito ii this work, and.it is quite<br />\nand<br />\ntraitors to the cause. We were hooted<br />\nsented \"The Dictator'', ''His 'Maathletic work.<br />\nit?je that if one of .the iacurty<br />\n•savagely flayed by men prominent in<br />\nTailor<br />\n\"A<br />\njesty Dunker 43ean\",<br />\nally. On the<br />\nTike Baltimore Sun, we have found a true zen<br />\nly,e,re selected, the_stapd_-_,;,,<br />\nmettOr.4<br />\n. Ifft4TredM?\"ffic--aale7-1Iestr;-- aud -7-rte—Charn morning -following the parade,iher74<br />\n• ard. tO plays prOdtice.,1<br />\n—<br />\nheadline:<br />\nanyear<br />\nfollowing<br />\nthis<br />\n,<br />\nthe<br />\nMoreover<br />\npion\".<br />\nback page<br />\nHOPKINS GRID<br />\n,<br />\ns<br />\nother dud has .been selected,<br />\nPARADE STIRS<br />\nDespite '1)op's\" devotion, the<br />\n\"Hawthorne of the U. $. A.\" We<br />\nIRE OF MANY<br />\nfact<br />\n•<br />\nremains that he is busy with<br />\nthe<br />\nbut<br />\nknow little of this play,<br />\n—<br />\nand cannot always,<br />\nDelays Traffic, Makes<br />\ntitle is enough. It suggests mar- other affairs<br />\nneeded. A coaci,<br />\nwhen<br />\nhand<br />\non<br />\nbe<br />\nLate For Theater,<br />\nSome<br />\nmadgalloping<br />\ntial music, horses<br />\n..a.<br />\nOthers Miss Trains<br />\n..<br />\nThis who would be on the cantpubelts.<br />\nBrowne<br />\nSam<br />\nhand<br />\ndemuch<br />\ndescribed, in<br />\nbe present nlore regularly.<br />\nThen came a lengthy news article which<br />\ntype of play is, or should be, be- could<br />\nBaltimoreans. At the Lyric, Law.•<br />\n. tail, the hardships experienced by<br />\nwas<br />\nprovide for more regbaritone,<br />\nwould<br />\nThi.s<br />\nCompany<br />\nneath-the Barnstormers. It would<br />\nrence Tibbett, famous Metropolitan Opera half of the recital. At<br />\n• ular rehearsals and -would probbut<br />\nchool,<br />\n*<br />\nS<br />\nsinging. Many Of the concertgoers glissed<br />\nHigh<br />\na<br />\nfor<br />\n'suitable<br />\nbe<br />\narrivaudiences were late in<br />\nFord's and the Maryland TheatieS4rthe was confusion and pandeably smooth out a great many of<br />\nnot for a University.<br />\ning. At the North Avenue Market, all<br />\nthe rough spots. The fact that at<br />\n.<br />\nthat<br />\nhowever,<br />\nadmit,<br />\nmonium.<br />\nmust<br />\nWe<br />\nby The Sun:—<br />\nthe University of North Carolina<br />\nHere are some of the caustic comments made<br />\nNo<br />\nthere is a deaeth Of material.<br />\ntion . . . sucthe Pla.ymakers are under the di\"This year's edition of their annual demonstra<br />\nof<br />\nany<br />\ndesire<br />\nor<br />\n-.<br />\nexpect<br />\n-could<br />\none<br />\n-rooters.<br />\nnon<br />\nceeded in arousing the ire of many<br />\nrect supervision of certain memparade,<br />\nthe<br />\nof<br />\ns<br />\nbehind<br />\nD'Oeuxre<br />\nthe subtle Chef<br />\n\"As seven southbound cars crawled along<br />\n'<br />\nbers of the faculty, has undoubt.<br />\n..<br />\n.<br />\ncriticism<br />\nof open<br />\nO'Neill to be pro4iced, but at the<br />\nimpatience of the riders-reached the point<br />\nedly contributed to their great<br />\nrs . . .\"<br />\nconcertgoe<br />\nthe<br />\nwere<br />\nstandvehement<br />\nhiaer<br />\nmuc<br />\nrly<br />\na<br />\n\"Particula<br />\nsame time<br />\nthe goodwill and supsuccess.<br />\nRather a peculiar method of building up<br />\n.<br />\nard could be reached than that of<br />\nit?<br />\nwasn't<br />\nBaltimore,<br />\nof<br />\nof the citizens<br />\nS. A.\" Let us add that we do not mean.<br />\nU.<br />\nthe<br />\nof<br />\nrne<br />\n\"Hawtho<br />\nday, Magistrate James<br />\nmers UnAt the Central Police Station, the next<br />\nThere are several playwrights to criticize the Barnstor<br />\nfive University of Maryland.<br />\nR. Cadden, while reviewing the cases of<br />\njustly, for such has not been our<br />\nme\"happy<br />\na<br />\nstrike<br />\nplays<br />\nwhose<br />\nstatement:<br />\n- iitudinti, made this rather pertinent<br />\nto point<br />\ndium\". What fault would be purpose. We have tried<br />\nthese pre•gazne disturbances.\"<br />\n'- \".•-. . thepublic is getting.tired of<br />\nor out certain faults and to suggest<br />\nPlays,<br />\nGreen's<br />\nPaul<br />\nwith<br />\narousing<br />\nfound<br />\nof<br />\nInstead<br />\nYes, it was a wonderful Publicity stunt.<br />\neye to<br />\narousing public ire. Instead<br />\nthose of any of the younger writ- certain remedies, with 'an<br />\npublic interest, the parade succeeded in<br />\nfavorably on the game, it<br />\nthey have not heightening the already high<br />\nlook<br />\nalthough<br />\nto<br />\nwho,<br />\ners,<br />\nBaltimore<br />\nof<br />\ncitizens<br />\nthe<br />\nof causing<br />\nachieved their goal, are at least standard of the club. The Barnonly stirred their anger:<br />\nand burning torches<br />\nwell along the road? If this idea stormers have been very successTraffic snarls, dynamite caps, yelling rooters<br />\nno<br />\nthe people of Baltimore to<br />\nwere to be carried out, he Barn- ful in the past, and there is<br />\nare great fun once a year, but to subject<br />\nten days, constitutes nothing less<br />\nnot<br />\nshould<br />\nthey<br />\nwhy<br />\nreason<br />\nproduce<br />\nonly<br />\nnot<br />\nsuch a demonstration twice, within<br />\nstormers could<br />\n•<br />\nthan a public nuisance<br />\nbetter plays, but also more. In achieve even greater success in<br />\nwe<br />\nAnd<br />\nenough.\"<br />\nis<br />\nparade<br />\n\"one<br />\nweek,<br />\nlast<br />\n, As we remarked<br />\nour opinion the average college the future.<br />\nFOUNDED 1897<br /><br />\nThe Name<br />\non the Box<br />\nChristThe name on the box of your<br />\nway<br />\nthe<br />\nwith<br />\ndo<br />\nto<br />\nlot<br />\na<br />\nhas<br />\nmas gift<br />\nit<br />\nsees<br />\nman<br />\nit is received. And when a<br />\nknows<br />\nhe<br />\nlabeled \"Hamburgers'<br />\nbeen .<br />\nthere's something inside he's<br />\nHeadGift<br />\nyour<br />\nthis<br />\nMake<br />\nwanting.<br />\nquarters<br /><br />\nIsaac Hamburger<br />\nM. B. (). D.<br />\n-8‘ Sons<br />\nBaltimore at Hanover Sts.<br /><br />\nEDITORIAL COMMENT<br /><br />\nIntelligence Test<br />\nInstructor — \"Life Insurance?\"<br />\nThe Class (at one man, -without heiiteition)-\"John Hancock\"<br />\nInstructor (beaming with J)_<br />\n\"Class dismissed. Your I. Q. is i3o.\"<br /><br />\nO<br /><br />\nL<br /><br />\n•<br /><br />\ni‘47.J6ieer,<br />\nE COMPANY<br />\nLIFE INSURANC<br />\nS<br />\n,<br />\nDOSTOPI.<br />\nOr<br /><br />\nMAS....081T<br /><br />\nbr<br />\nby<br />\nap<br />\nth<br />\ncc<br />\nYo<br />\ntat<br />\naf<br />\nTI<br />\nan<br />\nBa<br />\ntab<br />\ndr<br />\n. prt<br />\nof<br />\nwh<br />\nclu<br />\nho<br />\ntill<br /><br />\nyot<br />\ntha<br />\nyea<br />\nthe<br />\napr<br />\ntle<br />\nstoi<br />\nto I<br />\ntrte<br />\npre<br />\nIll'<br />\nof I<br />\nten<br /><br />\ntale<br />\nwot<br />\nto ,<br /><br />\nthat<br /><br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and LoinBuicks<br />\nbard St's, •<br />\nPLaza 6000.<br />\n. Chevrolets.<br />\n1723,25 N.<br />\nChryslers<br />\nCharles St.<br />\nVErnon 4049<br />\nHupmobiles<br />\n2402 Pennsylvania Ave<br />\nWillys-Knights<br />\n)0<br />\nLAfayette<br />\nBaltimore Concedes Milestone Supremacy<br /><br />\n• hilt'<br /><br />\nunit<br /><br />\n'hop<br /><br />\n.e%<br />\nf<br /><br />\nir<br /><br />\n\"Friend of the Hopkins Malt\"<br /><br />\nchil<br />\nUnion<br /><br />\nTr-ust Company of Maryland<br /><br />\n( HARLES AND-111-21TrE STREETS-t .<br />\n\"On tR'e 13.-Otite of the Charles Street Bus\"<br />\nr<br /><br />\nankle-Yashionedetfords<br />\nHere's team work between the shoe builder<br />\nand your foot — a handtailored upper that<br />\nhugs your ankle and<br />\nbanishes the discomfort<br />\nof slipping at the heel.<br />\n1565<br />\nThe Uptown<br />\naack Alaska.<br />\nAlso Bros..<br /><br />\nI Ile<br /><br />\ncat<br /><br />\nTHE<br /><br />\nr<br /><br />\nUMITY OHOP<br />\nCollar Hug Clothes<br />\nBaltimore OaC tIbegvStfeetF<br /><br />\nrie<br /><br />\nIlli<br /><br />\npa:<br />\nkit<br />\ncal<br /><br />\nf<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETFER, DECEMBER 4, 1928<br />\nESTASLISHED ISIS<br /><br />\nTHE MAIL BAG<br />\nIN REPLY TO \"BEN\"<br /><br />\n•<br /><br />\n-<br /><br />\n—AND ANOTHER<br />\netc., would be supplied free, which<br />\nof course, was not opposed.<br />\nMc Editor of the Milvs-1,imER. 1.iditor of the NEWS-LETTER:<br />\nTo conclude, thiS_Ietter is not inDear sir:<br />\n1/ear Sir: •<br />\ntended to justify a parade preceding<br />\nYour managing edifor haZ- \"' Several weeks ago, and in fact, the Maryland game, but to advise<br />\nbrought to my attention an article since that time there have appeared the editor that he should either get<br />\nby the mysterious and elusive \"Ben\" certain .articles in this paper writ- his editorials concerning Hopkins'<br />\nappearing in the current nuniber of ten by a gentleman who. dubs him.- enterprises in early enough to stop<br />\nself \"Ben\" and by the content of his<br />\n*the NEWS-LETTER. ,<br />\nthe enterprise or avoid discussioh<br />\nThe evening hour of nine-thirty<br />\nIn what has evidently been'a sin- articles has very justly earned the of the matter if he opposes it. An<br />\ncomes over the dormitory and theo—\"The<br />\n\"<br />\n:<br />\nCritic<br />\nCampus<br />\ncere effort at constructive criticistn,Cognomen<br />\narticle as above referred to not only .retically all music and unnecessary<br />\nyour zealous correspondent has at- Now, as undergraduate students., we tends to disrupt college spirit; -but<br />\ntacked a problem about which I ant are all very familiar with our short- also to disgust the campus' with noise immediately ceases. However,<br />\nis<br />\nafraid he knows absolutely nothing. Coming, both those knOwn to the your paper in general and your the antithesis of this happy state<br />\nmore, nearly true. The wail of<br />\nThis question is the much-bruited inward person and those 'exposed to opinion in particular.<br />\n\"Song of the Swamp\" reverberates<br />\nand oft-repeated one as to why the public survey. So far, I have read<br />\nSincerely,<br />\ndown the vacant corridors and this<br />\nBarnstortners Club has not titulr- most of the articles and so far do<br />\nNorris.<br />\nR.<br />\nJohn<br />\nunearthly call is'answered by the<br />\ntaken the production of • serions. not see one bit of constructive criti•deep and throaty moan of a bass<br />\ndrama. Mr. \"Ben\" is undoubtedly Cism. Destructive criticism is one •<br />\nsaxophone in profound grief. As<br />\nprompted only by the best interests of the easiest.things in the ,world to<br />\nMr. Norris, in his letter. teems the hours wear on, someone breaks<br />\nof the undergraduates in assailing give—remember that.<br />\nto be a trifle confused regarding the a b'cyttle of some unknown type, upon<br />\nwhat.seems to be the Position .of the<br />\nI might alter the above statement real purpose of a college newspathe stairs and falling glass is heard<br />\nclub in'regard to this matter. I feel, somewhat, The caustiC 'critic has<br />\n\"per's editorials: The Comment of during the next few minutes. Then<br />\nhowever, that several of his- state- recently founa a new field in vilich<br />\neditorial column is not,primar- the still night is pierced by a joyful<br />\nthe<br />\nments should ,not go unchallenged. to growl, i. e., The Barnstormers. A<br />\nily intended_ to \"stimulate college soul bursting -forth into song and<br />\n:In the first'place, it may surprise -suggestion-WE:old- be to regard-facts<br />\nspirit.\" Its chief mission is rather promptly is chorus of cries and unyour learned,correspondent$P) hear first and by doing so prevent the<br />\nranible after ramble. A to provoke original thipight and the pleasant sounds inform him that he<br />\nthat the Barnstormers for. several mind<br />\nis not in the good graces of the inyears have turned..envious eyes upon good principle-to fo1Iow is that if a free discussion of campus problems.<br />\nmates. However, the songs Ind ditupon<br />\nin/proved<br />\nbe<br />\ncannot<br />\nsittiation<br />\nWith<br />\nwhat<br />\nproperty.<br />\nwere<br />\nthe Playshop<br />\nIn'our parade editorial, we<br />\nties continue and occasionally the<br />\nafter<br />\ncareful<br />\nmen<br />\nexperienced<br />\nby<br />\nappeared to be the death of the litnot attempting to stamp out college fire gong is sounded to interrupt the<br />\n.consideration then those unfamiliar<br />\ntle theater group this fall, the Barn-.<br />\nspirit or pre-game enthusiasm. We monotony. Several roomers who<br />\nhad better adopt,a more philosophic<br />\nstormers immediately made efforts attitude and. if plans for improve- were merely raising.a strenuous tilt- ave unable to locate the evasive keyto bring their proposition before the ment are offered begin from the jection to the exploitation of col- hole, are admitted to their respecas the<br />\ntrustees of the vacant Playshop. At constructive viewpoint.<br />\nlege spirit for commercial purposes. tive chambers and at length,<br />\nclock chimes. two-thirty, the noise<br />\npresent. I am not at liberty t(: say<br />\nWilmer. H. Driver<br />\nThis parade was not a spontaneous<br />\nfinally lessens and dies away into<br />\nany more than that, our pnispect,<br />\noutburst of undergraduate enthusi- the early morning altogether.<br />\nMARYLAND PARADE<br />\nof procuring these facilities for proasm. It was nothing more than a<br />\nA reign of terror suc has has not<br />\nduring genuine Ilotkins plays.writ- 1 a the kditor of tbe N EWS- I ATTER. publicity stunt promoted in or$1er been known for some time is now in<br />\nto entice a large crowd into the full sway in the Hopkins' dortpiten and staged entirely by Hopkins Dear Sir ;.<br />\nI would like to know, by what au- stadium on Thursday.<br />\ntalent are practically nil. If you<br />\nContinued- an Page 4, Cot. 3<br />\nwould like to know Why-, you'll ,have thority the editor of the NEw4-1,Erto. sl$, the trnstees. But, the poinci,is TER writeS .a column stating that<br />\nhie panicle is enough and \"we<br />\ntills. the I larnstormers<br />\nthat there is a need for a- little t1W-- strongly opixTse the participation by<br />\n.ater group at li,pkins, and that-they Hopkins students in such all enterpaper is supposed to<br />\nTirz'e made efforts to do something prise.\"<br />\nabout 'It. t;ive them credit f“r-that reflect and .siimillate college- spirit,<br />\nstop the<br />\n:lat. when it is too late,<br />\n111:11<br />\nnittelt-ot<br />\nCOIlleS<br />\nS-1..liraK.<br />\nNEW<br />\nthe<br />\n\"parade.<br />\n1,&amp;„0„,,,<br />\n1,<br />\n,<br />\nini,zht add.44t OIL.<br />\n_<br /><br />\nNG<br />\nCLOTHI<br />\n_<br />\n40.nitletiteno Irurnistiing 9o060,<br />\nMADISON AVENUE COR, FORTY-FOURTH STREET<br />\nNEW YORK<br /><br />\nOur Representative will be at the<br /><br />\n'<br />\nSOUTHERN HOTEL<br />\nTo-day and Tomorrow<br />\nDecember 4 and 5<br />\nSendfor Illustrated<br /><br />\nChristmas Circular<br /><br />\nR,0 S T 0 N<br /><br />\nPALM BEACH<br /><br />\n16rwevorr con. firnocrtirr Sr. 246<br />\nL. G. BALFOUR<br /><br />\nP..,.<br /><br />\nNEWPORT<br /><br />\nB,,., A.,.. S 220<br /><br />\n90.<br /><br />\nFraternity Pins<br />\nJewelry, Favors, Novelties<br /><br />\nHOPKINS RINGS<br />\n1109 Fidelity Bldg.<br />\nPhone Calvert 1564<br />\nPhone HOmewood<br /><br />\n7908<br /><br />\nBirely's Pharmacy'<br />\nST. PAUL at<br />\nYour<br /><br />\n33rd STREET<br /><br />\nNeighborhood Drug Store<br /><br />\nI<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br /><br />\nFORDS sok GEAR SHIFT CARS<br />\n11 E. North Avenue<br />\nVernon 2704<br /><br />\nMakeOur Store Your Store<br /><br />\nThis<br /><br />\ni<br /><br />\nt:diuir-.411rinte-01161_.:1•1)<br />\n;Ire r<br />\nmake the parade a flop, and the<br />\nuntil floor of the Ilain, which Will<br />\nJohns Hopkins University' the<br />\nhe vacated upon the completion of<br />\nlaughing stock of .the town for the<br />\n-,.evcring I Ian.. Now, it r. :1 ii'.'<br />\npoor representation of its students<br />\nironic<br />\nyour<br />\ndevote<br />\nif yott want to<br />\nsuch a college \"pep.' meeting.<br />\nin<br />\npen 1,, 5.11e .U.111,41 can,, may I sugThanks to the 'disregard on the<br />\nyour<br />\nin<br />\ncrusade<br />\na<br />\nthat<br />\nvon<br />\nstart<br />\nre.st<br />\ncaMpus of the opinion of the Nis,wsc,dunin to help us get this space<br />\n1.nTER, and, on the other hand, to<br />\nfor our own link. theater!<br />\nthe determination of a fair-sized<br />\nlit. regard to, the type of play th<br />\ngroup of lb ipkins men to prevent<br />\npretcn<br />\nclub selects, it does not it<br />\nyour paper from reducing iti. any<br />\n'liii' ii doing itiv•rnore ihau furthe parade<br />\nway the I lopkitis<br />\nnishing- pleasure tod the participantS<br />\nwas a success—Os much a success Is<br />\nIll the prodiwtion and. entertaipment<br />\nany - (inner<br />\nif the cruw,ls \\vhielt, de,pite -the<br />\nI stigiost that the writer of such<br />\npla's.•-ac-.<br />\nfact that they afe \"dudin Ilte future see. t./me<br />\ncolumn<br />\nthy largest a<br />\n• cording to Nit-.<br />\nfor such an enterresponsible<br />\none<br />\ntwo,succestheater in Baltimore on<br />\ncorrect any misto<br />\n,order<br />\nin<br />\nsive evenings, am tare generou•s with<br />\nsuch as occurred in this<br />\nistatenients<br />\ntheir applau,•e.<br />\nThwrimary pt:rposes of<br />\n1)1,1 Viiit ever still) to tltlttk, \"Ben,\"- edit()rial.<br />\nparw.le were to benefit Hopthis<br />\nproduce.<br />\nto<br />\nbe<br />\nwould<br />\nit<br />\njob<br />\na<br />\nwhat<br />\nin college spirit; secsay, \"The ('radle Song.- or some kins: firstly;<br />\nletting Baltimore know we<br />\nsimilar opus with ILI,e...:11andicaps that ondly,ln<br />\nspirit and<br />\n1.)) you have plenty of College<br />\nconfront the Stormers<br />\n\"ads\"<br />\nsecuring<br />\nin<br />\nus<br />\nassist<br />\nto<br />\nthink boys would • be convincing hence<br />\nand pecuniary<br />\npublications<br />\nour<br />\nfor<br />\nyou<br />\nDo<br />\nroles?<br />\nplaying the female<br />\nCage Fund drive; and<br />\nthink it . would \"go across\" lief ire help in our<br />\nmake the annual Hopto<br />\nthirdly,<br />\naudience?<br />\nBarnstormer<br />\na typical<br />\nkins-Maryland game a bigger 'and<br />\nThese things. you- will reply.<br />\nmore profitable game for Hopkins.<br />\n—<br />\nimpliyour<br />\nmerely go to prove that<br />\nwriter also seems to have the<br />\nThe<br />\ncation of the Barnstormers being<br />\nimpression that this parade<br />\nfalse\"low brow\" is true.<br />\ndown the throats of<br />\nforced<br />\nwas<br />\nWell, we're not particularly worTo correct this idia<br />\nmen.<br />\nHopkins<br />\nit.<br />\nmed if you feel that way about<br />\nread the first sento<br />\nonly<br />\nhas<br />\nWe have a very' good time produc- he<br />\nan article on the front page<br />\nin<br />\ntence<br />\nthe<br />\nin<br />\ndone<br />\ning plays as we have<br />\n\"—\"In response to the enthusiasm.<br />\npast. We would like to do both<br />\ndisplayed in its favor at Assembly a<br />\nbeBut<br />\nwork.<br />\nkinds of dramatic<br />\nparade will be held before the<br />\ncause one seems to be denied. us<br />\nMaryland game for the first time<br />\nreaany<br />\nthat<br />\nis<br />\nbeing,<br />\nfor the time<br />\nthe history of the University.\"<br />\nin<br />\nthe<br />\nson why we should abandon<br />\nIt was only after tlie:Assembly had<br />\nother?<br />\nvoted for a parade that announceY.:Ws truly,<br />\nment was made that flares, floats.<br />\nWILLIAM B. BAN its.<br /><br />\np<br />\nHEATthe instant you want ill<br />\nThe moment you are ready for your gas<br />\nflame, it springs into full action!<br />\nLikewise, at your will, it is instantly and<br />\n-completely extinguished.<br />\nWhen you use gas, there is no carrying<br />\nover of fires during periods when heat is<br />\nnot wanted.<br />\n'Nor is time lost in bringing a fire up to<br />\nthe required temperature.<br />\nThis feature alone of gas for industrial<br />\nuses is important. It represents a valuable saving- of time; conservation of<br />\nman-power, and economy of operation.<br />\nMore than that, the flexibility of gas,<br /><br />\nwhich makes possible this very feature,<br />\ninsures perfect temperature control for<br />\nevery manufacturing process.<br />\nQuite naturally,this makes for improved<br />\nproducts and fewer rejections.<br />\nConsidering all the many advantages<br />\nafforded by gas—of which these are but a<br />\nfew—it is no wonder that industry is today employing gas in 60,000 different<br />\nways!<br />\nYour local gas company will be glad to<br />\ntell you how gas can be profitably employed in your plant. Telephone or write<br />\nto them—your inquiry will not obligate<br />\nyou.<br /><br />\nFor free copy of book,\"Industrial Gas Heat\",address<br /><br />\nAmerican Gas Association<br />\n420 Lexington Avenue, New York City<br />\nYOU CAN DO IT BETTER WITH GAS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DEMMER 4, 1928<br /><br />\n4<br /><br />\nriorcorno<br /><br />\nNOVO<br />\nDE<br />\nLNTER COLLEGIATE<br />\nfty Ksc*saG. Huirr<br />\n- - NEWS fia made las buea mid and writ.e..; •<br />\neenee eel<br />\nhave puled,<br />\nPr EN.<br />\n.kW about die atm pies at Hopkins<br />\nMier hvought thy naareue Istallehaexl sad_<br />\nIllmt it hardly music presetise hey<br />\n13t.<br />\n'<br />\n'<br />\nAnti<br />\n7e2 eessere't fag. and left the miertal frame '<br />\n*iv' lig is left as illeaC for the =wren<br />\nthe 54- kiwis<br />\n*ihed<br />\n,<br />\ni en<br />\n'<br />\n774:eti<br />\n.<br />\nL&amp;.'<br />\n• rc#enndi<br />\nwart it:ree<br />\neeered iead<br />\nvw were stEng<br />\nai'\".Lst'yinvtPat<br />\nDecemDer, 19.z7<br />\ndiet has prerhany teen erentreaced<br />\nire.;<br />\n\"..ne tea a.eress<br />\n'''<br />\nrtu<br />\n\"hail<br />\nthaek the la<br />\nmak stand l'eove edftestsest<br />\nEry,.<br />\nk<br />\nTait it far<br />\n.0t ;.‘1121611g<br />\n(<br />\nwhat,as was.'<br />\nttnde64<br />\nto, ss<br />\nOr .1,-44 m e.emeete.<br />\nthe<br />\nthe<br />\nC. A.<br />\nbe<br />\n''Y'<br />\nene<br />\ne*eiffiel<br />\n\"<br />\nere-mt.;<br />\n\"<br />\n:<br />\na*<br />\nree:<br />\ntat<br />\nlay<br />\n'<br />\nSome<br />\nneverdadmiee<br />\nhat,<br />\nIt<br />\nHall<br />\n- Leventeg<br />\nB\"4\"'aa4 Wks•.Sixz<br />\npros*nt,I iniar\"-eriAr4P'<br />\nAs my C..”,..r.rr.a.s .<br />\neadte<br />\n..ai.er-• re: e<br />\nie-o-ene eaet<br />\nAte frittete<br />\ntoa fatevemon for Mc,and I,fiat<br />\nporquei of yourtins.<br />\nrodents wm-e -arreatod. vent isrli<br />\neitsiao4 for myself a ink!,<br />\ndragging<br />\napsocy<br />\ntb.fiat<br />\nthe i-eee..<br />\nfor<br />\nrecren<br />\neee.e<br />\n•<br />\n!re=<br />\nthe<br />\nesm<br />\nfrom<br />\nir,an<br />\ndiwerdierte<br />\na<br />\nmet<br />\nohl<br />\ntrain<br />\ni- thaltet ‘Arregt Ir<br />\n7- - ----- --ararrag us re.ezusg shrouds<br />\naliglitik acquaintIn style and quatit_fiostoniarisIperty<br />\n,<br />\npr<br />\nWhich heave Arzraina\" heating depth.<br />\n\"corteke= and destreactrion<br />\n,.i ybur<br />\n:. pro,duee,<br />\nthe most 'expensive footwear<br />\nequal<br />\nT. paper has dung to, a,hes- so elm/here haguage and reeaeting<br />\na<br />\nnot<br />\nairnage dire,<br />\nI am<br />\nhack' may ne 1.,:er.rX<br />\nthe<br />\n-•--.2sionally I have a produced today.<br />\n*native patty in hand<br />\narrest, and vine with<br />\nthemageee<br />\nlex!<br />\nevil<br />\nlaxly<br />\nand<br />\nthat<br />\ngreed<br />\nWhere<br />\n,oriairler<br />\n1<br />\nipatioa, and frees ite trerannut, of teterf<br />\n.4e3k tergeare. death<br />\n, is the finest<br />\nAnd the saving is a 'big item.<br />\n-I.:<br />\nelem. aer<br />\nIn Ureic of deadle- hate<br />\nit appears that the edrstorial at- againte them<br />\nwith his<br />\nepeethee<br />\n_<br />\nwieere,<br />\nTeat<br />\nlean,<br />\nat<br />\ntune,<br />\nthis<br />\ntitathe—which<br />\nMostly $7 to $10<br />\n7 \"AU,.<br />\n,Angnix. home<br />\nAcerxefteg to odyikere m the vicire<br />\nsiarld seem fairly am-afar* to reM a.F.,..t<br />\n_<br />\nIdren<br />\nflect the campus artrende—is that ity of Harvard. 20,91.$ feet of dim<br />\nForever thetreee 7<br />\n341, 81:ttmort<br />\nEx(.1..<br />\n..trn tee by student+ af<br />\ntht new plats, wherein it sights the /father are 1W,<br />\nre weer<br />\nThat death ends a/<br />\nBecame ,rA the<br />\nanefergradiume Leidy, is a bad thing. that :institution<br />\n\"is4..7...e.<br />\nT<br />\n- d nothine • =_t L. ent:ewe<br />\nReduce<br />\nBOSTONIAN<br />\nAs I hare lead, the editors' M thiS many vreeit-enel attractierie it was<br />\nExtra High Grade ,<br />\napporestity have they\"-epport of the send that Merida, isat a poet (WrySTORt<br />\nSHOE<br />\nezh:,<br />\nAdern thy grave; thy zetee-seUe,<br />\npervasTrig student Wipiffil Welt forebutinme. the lack of funds mut112 E Baltimore Street<br />\n• an opinion characteristic of ing this amilition.<br />\nle fluted and far'f.411 kick<br />\nitudenti—eal editors. No .oae, I<br />\nT. rat:: thy samicilfor pireple<br />\nliebriu,ever heard of salad reavm- -AL a flolion 4\n,r rate:eel:heater<br />\nWet not in Vase, -1,<br />\nanmunt<br />\naverage<br />\nthe<br />\nthem<br />\nthat<br />\nof<br />\nennounted<br />\neither<br />\nfrom<br />\nlag Wain<br />\nItIVe hunt the hand* et -kinge and 7,<br />\ncarried<br />\nindite:6/m<br />\nn.1.thai<br />\nativIere<br />\nTo am it is peace* absurd that a<br />\neenmett .<br />\nterange<br />\ncent,. Even<br />\nTheir<br />\ntheie„ should be a monstraft with- with hire ietwenty-two<br />\nwere'compiled at<br />\nThy sewn deer land ha. %I:Arai 7'<br />\nbidding of endorsemer. rt from a plan if suchtceileues<br />\nhesitate to pubFig men have banned by Lie<br />\nproviding .for free exercise/ of gets- Ifiephtlas, vie eh/4A!<br />\n.<br />\nthem,<br />\niieh<br />\nthe<br />\nby<br />\ntinhatf+ered<br />\n- scholarthip<br />\naloe<br />\nThan savage war: we've stceee<br />\nmuscat* dileuziniun of \"colJege<br />\nie...<br />\n!settle<br />\non<br />\ndeed.<br />\nwell<br />\nat<br />\npee<br />\nOf<br />\nthe<br />\nffiglity<br />\nof<br />\nNeepire4. abnhist<br />\nadacatioa.\" I do not argue that unWhat need for inore\" !Jost heir the<br />\ngeneration of the preeent time; the<br />\nderp-achate work oven to be everyof 'Toronto ha.; anUniversity<br />\ntolling bell' Doe we ,the<br />\nThe<br />\nmore<br />\nany<br />\nwhere done away wnh.<br />\nnounctda course in flying. .‘ccord,<br />\nbcer m e/lerrin R:47:<br />\nToy<br />\ndaan mart&amp;.scainameriti, hog-tath<br />\nnag to the report; it will he thP first<br />\nthou are where<br />\nyet<br />\nlag coallests, or any other popular<br />\nRemembered<br />\nakiarance of any weft course in<br />\n_<br />\nand relatively harmless silliness.<br />\n.ey,<br />\nBut I ad! carry thee, my iy<br />\nne's-10 mast'A<br />\nwith it.<br />\ncerrieS<br />\ncourse<br />\nThe<br />\nCanada.<br />\nSWIM SOO of preparatory work in— U41 cut to(*ace ..4\"--Of arm: thee thee the ripplmg er,e-ne<br />\nobligetiont.<br />\nno<br />\n—<br />\nadvanced<br />\nte<br />\npresupposed<br />\n.• •<br />\ndeed is<br />\ne 7:The shaggy hall: hold thee to<br />\nESTABLItHEO EHGLISICUNIVERSITY<br />\nilii.41A recent number oi<br />\nstudy and individual research In<br />\n,rri. beryl:<br />\nthffa;<br />\n-TAlt.OREIS -S/VtR YOUTHFUL<br />\nthy<br />\nT,<br />\nSTYLES,<br />\nquench<br />\nin which all of<br />\nfact. I am not even going to debate yan Doily appeared<br />\nCHARTS SOL-ELY FOR DISTOIGUISHED<br />\n11se luecvest.Eruit. Thal\"!for*<br />\nvery<br />\nWere<br />\nimportance<br />\nof<br />\narticles<br />\nthe<br />\nagain the recently much-debated<br />\nSERVICE INTHC tirtITEJ) STATES.<br />\nT71,11<br />\nTbrieee,<br />\nseservetivOLATIMMCM..the head- •-•:-.11111•<br />\nquestion of lilt wival-41<br />\ntype<br />\nv<br />\nline,heirs**/Ai.- ex tre<br />\n_<br />\nIt of ordinary college \"training.\" Tlae<br />\nfee' tor. fle.....reee elitigatoer<br />\n•<br />\nI imPlY want 1.6 add rnY grunt and e, eXplein, said that \"the Jim/type<br />\n•<br />\nit Apz,r3-34<br />\ntint<br />\npush to heaving itout of Hoptn, et) which -the uetUil large heads of<br />\nica)<br />\n7.4/e Dirtfe• ere set, had gorK wrong<br />\nLeave it to flourish eltiewliEre.<br />\nnil that none 'if ihe front tiag - type<br />\nwest<br />\nSults $40,145,*SO.Overcoats<br />\namong the wheat fields of the<br />\nHALL HE4RINGS<br />\n:Available.\" fie continuee \"the<br />\nsouth.<br />\nthe<br />\nPagr<br />\nof<br />\nhookworms,<br />\nthe<br />\nand<br />\netaff• have it<br />\net editor. mule<br />\nBeinneee,<br />\nf tc r4-' In the dark hour.' \n..... Alin let the hillsef. Teeth<br />\n'w. 4iL454 thei<br />\n.011<br />\n7<br />\n4<br />\nfapS\"ife atglibTEbe inviolate. fiche we have an in<br />\nE E. ADAM<br />\ntels of this building, and upon .a::<br />\nBY SPECIAL APPOINTMENT<br />\n•<br />\nage.en<br />\nyears<br />\nifty<br />\nf<br />\n.<br />\nStitution founded<br />\n•nettleel oi 'i/ortraeinp nvestenve eiht,Sreperntig the<br />\n*OUR STORE IS THE<br />\na principleit is apparently strug- dr fhetletll genie, he, been a.lapi- silent hand files ini-e the entry and<br />\nautivoities of purfitie<br />\n• gling to maintain now You all are ed fir the<br />\nthe time bodes ill for some unfortu'<br />\nh<br />\n.efe,<br />\nnate. The step, are mounted with<br />\n„ _Th, game 1, ee n<br />\nfamiliar with what a repute.titire has f:res<br />\n,<br />\ngridgraph. low whispers. a short conference of<br />\ncalled<br />\nmechanism<br />\na<br />\nlintbut<br />\nbrief<br />\nthat<br />\nin<br />\n(nit<br />\ncut<br />\nbeen<br />\nby play is recorded by a own- subdued voice,, a knock on the door.,<br />\ntient period by the men, sincerely flay<br />\ning light which represent, the feeeg- and then violent ecrelnis and cries I<br />\nOF BALTIMORE<br />\ndevoted to the discovery of truth<br />\n.-111 the infermation followed by an ominous -;ilence and<br />\nand the advancement of feat:fling. ,ress ohthe<br />\ngiven 'in the stadiem soireleeird i. the mystic figure, again vanish intu,!<br />\nThe character of the suits and<br />\nOvIANNIE (BERG<br />\n•<br />\n,<br />\n• and fully .4:quipped f//r the business,<br />\npri,s4.-nteo.<br />\novercoats tailored by charter House<br />\nthe- darktees from whence thee<br />\n•••<br />\n.<br />\n•<br />\n•<br />\nfionletf<br />\nBoy<br />\nMitt<br />\nOki<br />\n\"The<br />\nthe<br />\nwith<br />\nassociated<br />\nwho were<br />\nwill earn your most sincere liking.<br />\ntame. Later a disheveled<br />\n• union. flat it fallen riff of rite: Thte Brie.n an,/<br />\nTr*.ii MA.rk Ft,<br />\n'in innerrit<br />\n-;<br />\ndax,<br />\nless<br />\nor<br />\nmore<br />\nMei<br />\nioutel<br />\nj`<br />\nThen it is lately that the<br />\nsity,..anniettice, the ineees which Mat, under a colei<br />\n;.:<br />\nCoIleiate Fu_rn ish ings<br />\n---miterifuelef'ettriergete.<br />\ntettiretTav'irrri 7ieetng • •<br />\nhand-,. -Ale<br />\nwilling<br />\nby<br />\nforth<br />\ndrawn<br />\nall student.<br />\ni..;harles anti Fayette<br />\nmade itself dangetinas to the test brary regitlatioqs.<br />\nNORTH AVF MARKFT<br />\nof the -tubbing briwho keep books unduly long only other victim<br />\nInterests ,of Hopkins.<br />\nAVPS<br />\nAND<br />\n&amp;<br />\nMARYI<br />\nNORTH<br />\nthe lkt• ,:t<br />\ntme IP.Itiee will 10: Seta *by the li- gade- he, been added to<br />\nThe extraction would be painless<br />\n1 he next one, the paper these unknown marauders.<br />\nbrary<br />\nenough. (inc fine fall there, would stated, is ',tit by the klean.<br />\nsimply be no rush of freshmen to<br />\nCONFERENCE<br />\nSTUDENTS<br />\nFrom a•college- publicatiOn, wi.<br />\nPaw I., 1', 01. 2<br />\ntrouble, the, registrar's' office girls,<br />\n'en u iicii<br />\nEasterner. just don't know jti,tifu-, it, dominance by the le,<br />\nand that winter fewer snap courses<br />\nhow to ielebrate \\ f• read, ''l\nwould be sought for and filled. By<br />\niv football fan- 31.1 Ihn, 1,411, of There i,1 a In<br />\nthe time the then soplioneees would the 1;iitinore Hotel; Los Angeles,<br />\nrat, , atising lighting awl Inn tion<br />\nstudent<br />\nthe<br />\nof<br />\nersity<br />\nseniors,<br />\nbecome<br />\nStanford-Univ<br />\n.<br />\nthe<br />\nalter<br />\nhave<br />\nix-its-ern two other fa,,, 111 ,,i'dt•T•<br />\nbody would be so small half of theta Southern ,ralifornia gridiron bat- nil,' thew lkotb. The re-tilt, as la,<br />\ndollars<br />\nDrink<br />\nof<br />\nprobably would become scared and tle rienTeel ii) thietsands<br />\nas the dominated rain- is concern,:<br />\nchair, mimes, is Si) attitude iif sycophaivy or<br />\nAnn<br />\nnut<br />\ndaniftges.<br />\nhe<br />\ncould<br />\nquit, and ,the survivors<br />\n(11111,1114-111 were Itroktat<br />\nIf<br />\nhat,' toward thc exploit ing oll,<br />\nawarded honorary diplomas, with all<br />\nto,01 from the Windows. To (<br />\n.,?1111Coftiii CC4,1111111It• ltusittmuii 'I'<br />\nexpedite<br />\nto<br />\ntrappings,<br />\nthe requisite<br />\nwc;rk on the exterior alipearances<br />\ntermini, social status between FareDelicious and Refreshing<br />\nwell a, the' ,interior, plants and<br />\nmatters.<br />\n,.;•retip of I Alaholtla Indians le<br />\n.Even<br />\nuprooted.<br />\nwere<br />\nshrubbery<br />\nstamping<br />\nore<br />\nEven if they hung<br />\nconic %cry prominent socially. inn<br />\npaper bags tilled with water were tin the di,covcry in t\" oil on thee<br />\nin the fast-decaying habitat of their<br />\nused in the celebration.<br />\nlands.<br />\npredecessorsethey would become es<br />\nTo all those wlio• s.iitit red from —<br />\n.ery year less hatnifui to the serious<br />\nan the committee it: charge especially<br />\nwork of the university, and it is not too mein study, 'Purdue offered'<br />\n\"Fill Tull. I drink<br />\na single regulation. The president ei<br />\nRecently<br />\nprogram.<br />\nattractive<br />\ninconceivable that one of them might<br />\nto the general joy<br />\nwalking contest was bemoans the fact because he state,<br />\nlong-distance<br />\n1,<br />\nshow the bad taste to become inter- held in which twenty men entered. \"'rile committee is composed of big<br />\no' the whole table\"<br />\nt<br />\nested in graduate work and merit The contest, which was Called the men and it is grieving to see such<br />\nCertainly Macbeth meant<br />\nentrance IlltU its mysteries. At the \"all-University cross country walk- talent go ti, waste.\"<br />\nthe same thing as when<br />\n• • •<br />\nwould<br />\nregula<br />\nthe<br />\nover<br />\nheld<br />\nyears<br />\nwas<br />\nthree<br />\niniz<br />\nrace,\"<br />\nmost, and wont,<br />\nwe say:<br />\nAt Temple University the loscra,<br />\ncountry<br />\ncross<br />\nmile<br />\none-half<br />\npurge the universitY of their pres- two and<br />\ns.--\"<br />\nNIACISE<br />\nof the Sophonuare-Fresman tussle.<br />\noffered.<br />\nwere<br />\nAct III. Scene<br />\ncourse, Pour rewards<br />\n,<br />\nin form of a tug of war, not only<br />\nence. It is a time that I know all<br />\narripe,<br />\nmen in the stacks and research labs<br />\nConditions at Washington and suffer the humiliation of a defeat<br />\nThc Coca-Cola Company, Atlanta,<br />\niN<br />\nJefferson are admittedly perplexing but also are made to undergo e<br />\ndevoutly wish for.<br />\nand disappointing. Their freshmen drenching at the hands of their con1 T HAD TO BE GOOD TO GET<br />\n8 mafiosi es day<br />\nMaryland, Western Maryland,<br />\nWHERE IT IS<br />\nare unusual. They do not break a querors.<br />\nContinuo/ en i'q r,, co.<br /><br />\nTen Years Have Passed<br /><br />\nLondon Man<br />\n'Gives Cool Tip<br />\nSmokers Here<br /><br />\nPrArang t\"<br /><br />\nCollege Men!<br /><br />\n•<br /><br />\n*<br /><br />\nTh.<br />\nanxio<br />\nStadit<br />\nfifth<br />\nkins a<br />\nslight]<br />\nwere,<br />\nonslat<br />\nwith<br />\nto wit<br />\nCar<br />\nStadit<br />\nfield c<br />\nSnyde<br />\nhave<br />\nthe Imany<br />\n-wlucu an<br />\nbe ent<br /><br />\n•<br /><br />\nEdcreWoisth<br />\nS:moking Tobacco<br /><br />\n.•<br /><br />\n•<br /><br />\nMIMS<br /><br />\nl'ro<br />\nany (<br />\ncame<br />\nState<br />\nUnive<br />\n:The<br />\nto coif<br />\na deft<br />\nColgat<br />\npower<br />\nDame<br />\nThis tl<br />\n(nutplan.<br />\n.• Faster<br />\nperiori<br />\n,Q-ou4. 1<br /><br />\n•<br /><br />\n•<br /><br />\nhArtejn °Ilse<br /><br />\nsmn<br /><br />\nhAtter F onel<br /><br />\ntine<br /><br />\nlie tit r' Hut<br /><br />\n,<br />\n1•40,<br /><br />\nWhat Shakespeare<br />\nsays about Coca-Cola<br /><br />\nas<br /><br />\n•<br /><br />\nV4V,<br /><br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\nRefresh Yourself!<br /><br />\n,<br />\ndr<br /><br />\nA.<br /><br />\n• EX.UITI<br /><br />\n:‘)'<br />\n71i<br />\n'11.1-'<br />\n41417('.<br />\n1I(111;\"<br /><br />\nthe \\V<br />\nkick.<br />\nhuge g<br />\ned to<br /><br />\nwere in<br />\nt he tin<br />\nfor an<br />\nresult<br />\nof 13<br />\ngon it<br />\nWIC, al<br /><br />\nThe<br />\nleader,<br />\n(lice 55<br />\nI. wIte<br />\nto-h.<br />\ntug tug<br /><br />\nN 'ere f<br />\n• )itrin<br />\nigain ;<br />\n/la CO<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 4, 1928<br /><br />\nSPEAKING<br />\nOF<br /><br />\nThanksgiving Day at 2:15 two<br />\nanxious teams were lined up iti the<br />\nStadium ready to start the twentyfifth football game bFt.Ween Hopkins and Maryland. The Blue Jays,<br />\nslightly lighter than their rivals,<br />\nwere driven back before the heavy<br />\nonslaught. The game was filled<br />\nwith spectacular plays from whistle<br />\nto whistle.<br />\nCaplan thrilled every heart in the<br />\nStadium, running the length ci&amp;the<br />\nfield on a kickoff for a touchdown,.<br />\nSnyder, of Maryland, seemed to<br />\nhave little trouble gaining through<br />\nthe Hopkins line. Lyons threw<br />\nmany beautiful passes but the men<br />\n•-who were to receive them-seemed to<br />\nbe entangled elsewhere.<br /><br />\nARE FRESHMEN HUMAN?<br /><br />\nTHE EDITOR EXPLAINS<br /><br />\nContinued from Page 1, Col. 2<br /><br />\nContinued from Page 3, Col. 4<br /><br />\n83 pounds is the lightest freshman.<br />\nWe agree with the writer that it<br />\nIf the freshmen stood one above would have been far preferable if<br />\nthe other in one column (the re- our ,comment could have been results include no information as to leased before arrangements for the<br />\nwhether their heads are of sufficient parade had been virtually completed.<br />\nhardness for Shis feat) the top However, due to the NEws-LETfreshman would get 300 feet more TEa's publication schedule, an edieyefull than from the top of the torial on the, subject at an earlier<br />\nEiffel Tower, as the total height of date, was impossible. We felt, nevthe cla4s is 1,285 feet. The aver- ertheless, that the topic was a live<br />\nage height is 69.6 inches. The rec- :and vital issue. The subject was<br />\nord average height belong to • the being univeraally discussed 6n the<br />\nclass of '29 and is five feet eleven compus and it was clearly the duty<br />\ninches. Larkin is the tallest, being of the News-LETTER as a represix feet three, and Crowther, who sentative undergraduate newspaper,<br />\nto make some comment. We made<br />\nis five feet one, is the shortest.<br />\nThe average chest expansion of no attempt to side-step the quesstrongly and<br />\nthe class is unusually large, as was tion but expressed as<br />\nour opposition<br />\nlast year's mark. However, the rec- logically as possible,<br />\nto such a parade which exploited<br />\nord-breaking class of '29 is the<br />\nthe Hopkins student body for 'box<br />\nchestiest with an average expansion<br />\noffice dollars.<br />\nof 3.7 inches. •<br />\nWe purposely did not interview<br />\nThe number of freslAmen comany of the backers or promoters bepared with those of previtstis years<br />\nfore writing our article. We wished<br />\nis large. The smallest class was<br />\nto write solely from the view-point<br />\nthat of '09, having forty-two memof the average student, basing otir<br />\nbers, and the largest that of '22 of<br />\ncomment on the information publicfive hundred and four members.<br />\nDr. Abercrombie. gave .the ex- ly released to the student body at<br />\naminations in the sout loft of Gil- last Thursday's assembly.—Ediior.<br /><br />\nman Hall.<br />\n• Probably the glate.st upset of<br />\nat<br />\nThe examinations proved<br />\nany of the Thanksgiving games<br />\ncame when the ,unheralded Oregon almost all freshmen kn.,' flat feet.<br />\nState team walked over Nt,A: York<br />\nMARYLAND WINS<br />\nUniversity to the tune of 25 to 13.<br />\nContinued from Page 1, Col.-6<br />\nThe New Yorkers were •expecting<br />\nwere the outstanding stars for the<br />\nto come through this season without<br />\nBlack and Blue eleven. Time and<br />\na defeat. Had they not defeated<br />\nagain Lyons' kicking repulsed the<br />\nColgate, Missouri and even the<br />\nOld Liners and gave the Jays<br />\npowerful Carnegie Tech with• Notre<br />\nbreathing spell; as a safety man he<br />\nDame on her list of vanquished?<br />\nwas mighty good to watch, in fact<br />\nThis team from the west completely<br />\nhe made a wonderful all-around<br />\npowerful<br />\nseemingly<br />\nthe<br />\noutplayed<br />\nshowing. 1.<br />\nliastertiers. They showed their suHopkins<br />\nperiority in every phase of ',laying. 'Maryland<br />\nLove<br />\nIF<br />\nfront bucking the line to.end runs. Dodson<br />\n---I..<br />\nKeating<br />\nL.T<br />\nLrum aeral- ttack to:defense. New Lombard<br />\nTe,ykt<br /><br />\n,<br /><br />\nOW,<br /><br />\n•<br /><br />\ntilatl,IS thought that this Was just<br />\nanother easy victory. '1'he first score<br />\nthe Westerners made was a dropkick. • Them they began to make<br />\nhuge gaps in New York's line, started to 'draw her .ensts :in,_ and :batik<br /><br />\n4!<br /><br />\n.11,•<br />\nwere made, 47 yards made way for<br />\nthe first touchd6wn, then 70 yaedt;<br />\nfor another, and the third was the<br />\nresult of a 55-yard, drive and pass<br />\nof 13 yards. One back on the. Oregon tezim-thade.120 yards; which<br />\nwas almost half of the New York<br />\ngain.<br /><br />\nfI<br /><br />\nMadigan<br />\nHeintz<br />\nMcDonald<br />\nHeap'<br />\nEvans<br />\nRoberts •<br />\nSnyder<br /><br />\n64,<br />\n,'.. ,<br />\n-W<br />\ni \"—!<br />\n-flr<br /><br />\nTO -<br /><br />\nStrader<br />\nC<br />\n... • Kegan<br />\nR.G<br />\nR.T.... Bialoskorsky<br />\nWetzel<br />\nR.T<br />\nLyons<br />\nQ•13<br />\nLang<br />\nL.H<br />\nCa_plati<br />\nRH •<br /><br />\nDE PROPOSMO NOVO<br />\nContinued tram Page 4, Col. 1<br />\nand St. John's—colleges of the type<br />\nto which the undergraduate ought to<br />\ngo—would all benefit by the change,<br />\nand those local boys with a hankering for big names and with a stack<br />\nof signed checks could go, as the<br />\nbest of them must do now, to the<br />\ngaudy citadels at Cambridge<br />\n(Mass.), New'Haven (Conn.), and<br />\nPrinceton (N. J.). Our own Iiitle<br />\nundergraduate school could certainly<br />\nnot be missed outside the state, or<br /><br />\nYOU'LL LIKE BOWLING AT THE<br /><br />\nARCADE<br />\nATOP NORTH AVE. MARKET<br />\n22 ALLEYS<br />\nBowling Keeps You Fit!<br /><br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br /><br />\n•<br /><br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG<br /><br />\nPhone PLara 0800<br /><br />\nD. C. HANDY, Manager<br /><br />\neven the city.<br />\nAnd then the graduate department, which would be missed, if it<br />\nwere swept Away, wherever medicine and science shed the beneficent<br />\nlight of their presence, could return<br />\nfreshened and unloosed to those<br />\nideals in which it was conceived a<br />\nhalf century ago.<br /><br />\neA. H. FETTING<br />\neNIANUFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n#<br /><br />\nINTERIOR' WOOD WORK<br /><br />\nDECORATIONS<br /><br />\nJAY HARRIERS LOSE<br /><br />\nJOHN C. KNIPP €.? SONS<br /><br />\nContinued from Page 1, Col. 1<br /><br />\n2. Myers, Maryland, 29.40 1-5; 3.<br />\nTie: Bo*nan, Maryland, 29.55, and<br />\nLinsey, Mayld, 29.55; 5. Remsberg, Maryland, 30.1 2-5; 6. Tie:<br />\nPlumbley, Maryland, nd Wallett,<br />\n.,Kelly,<br />\nMhryland, J0.31 3-5;<br />\nJohns Hopkins, 30.55 1-5: 9. Emerson, Johns Hopkins, 31.15 2-5<br />\n10. Kibler, Maryland, 31.45 4-5 ;<br />\nHopkins,<br />\nMiller, Johns<br />\n11.<br />\n32.2 1-5; 12. Waters, JOhns Hopkins, 3220 2-5;, 13. Loizeaux, Johns<br />\n'H, 14.<br />\nj_21147EW.,,,<br />\nk<br />\nJohns Hopkins, 32.43 425.<br />\nTeam,score:<br />\n20<br />\nUniversity of Maryland<br />\n35<br />\nJohns Hopkins Unifersity<br /><br />\nFURNITURE<br /><br />\nCOLLECT TWICE<br />\nIf you could talk with the big men and<br />\nthose who convey that very attitude whom<br />\nwe tailor, you'd understand what it's all<br />\nabout. To look at him might suffice be.<br />\ncause of the -charm and personality we<br />\nbuild in his clothes.<br />\nWe will do the same for you and 'include<br />\nquality in the cloth and construction<br />\nthat will outwear two dollars spent any<br />\nother Way. You collect twice on every<br />\ndollar with us, •<br />\n- TWO GRADES ONLY<br /><br />\nBALTIMORE, MD.<br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nstimulatingdelightful<br />\nare<br /><br />\nthe New<br /><br />\nFall Books!<br /><br />\n-brand-new books in bright<br />\n.<br />\nr9mgV,hern7<br />\nY411And<br />\ni„,riter'Tink-and crisp paper—fiction,<br />\neirA•ersrell<br />\npoetry, biography, science—awAring your choice at our two stores<br /><br />\nWILLARD TAILORING CORP.<br />\n120 West Fayette St.<br /><br />\n'THE NORMAN,REMINGTON<br />\nDown-Town<br />\nCharles St. at Mulberry<br /><br />\nCO.<br />\nUp•Town:<br />\n1118 North Charles St.<br /><br />\nFirst Floor<br /><br />\nMil<br />\n.7 44s.<br />\n.<br />\nn<br /><br />\nSyracuse unexpectedly romped to<br />\n14-6 victory over Columbia. This<br />\nis time first win that Syracuse has<br />\nhad in any of • her major games.<br />\n\"Skinny\" Baysinger, playing his last<br />\ngame of college football, led his<br />\nteam through a hard-fought contest<br />\n•<br />\nto victory.<br /><br />\nBreaking a string of ThanksgivT1w hope's' of Virginia Poly for ing DaY ties; Brown was able to de• leadership in the Southern- Confer- feat Colgate 16 to 13. The game<br />\nplays.<br />\n• ence were sadly shattered by V. M. was, Idled with spectacular<br />\nI. When she defeated the cadets 16: Kevorkia1,_o17Br05t'n, after scorplay<br />\n'1;be te-ehmen could do noth- ing a drop kick, in ,a later<br />\nWas picked<br />\ning against the V. M. L line and blocked a punt, which<br />\na\\‘'ere forced to kick again and again. up and nished over the line for<br />\n-Later in<br />\nDuring the last quarter 'Tech tried -touchdown by Babcock.<br />\non a<br />\nztgain and again to rally by passing the game, Colgate also scored<br />\nblocked kick.<br />\nbut could accomplish nothing.<br /><br />\nn their way<br /><br />\nto here<br />\nChesterfield cigarettes are now sailing<br />\n780,000 South-Polewards<br />\nwith the Byrd Antarc-<br /><br />\nYOU CAN SCORE!<br /><br />\ntic Expedition.We are officially informed that the selection<br />\nof Chesterfield resulted from the individually expressed<br />\npreferences of a majority of the expedition's members.<br />\nWhen it is recalled that these are—in superlative sense<br />\n— picked men .. . selected not only for bravery, ability<br />\nand experience, but also by searching tests of physical<br />\nfitness... we may be forgiven for our considerable pride<br />\nin their vote. And something of this pride, we believe,<br />\nwill be shared by all Chesterfield smokers.<br />\nIt is another of the many proofs piling up that the<br />\nsurest way to earn popularity is to deserve it!<br /><br />\nfor a touchE are ready to pa,, the ball to you<br />\n. down!<br /><br />\n, ,<br /><br />\nmade.prospects with<br />\nklf you are ready to tackle our ready,<br />\ninsurance, we will welcome,<br />\na brand new idea in automobile<br />\nmoney making<br />\nthe opportunity to show you its great<br />\npossibilities.<br />\n((Sell us your spare time.-<br /><br />\nghe APPLE &amp; BOND Company<br />\nBLDG.<br />\n1401 FIRST NATIONAL BANK<br /><br />\nLight, and Redwood Sts.<br /><br />\nC11-1 IESTERFI ELI)<br />\nMILD<br /><br />\nenough for anybody.. and yet.. THEY SATISFY<br />\nI Iciorrr &amp; NYIll3 youCCO CO-<br /><br />\n, DECEMBER 4, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER<br />\nFORDYCE E. C. CAMPBELL<br />\nRESEARCH IN PHYSICS LIBRARI<br />\nHome—HO. 2.O9c 3<br />\nPhone, CAI. 1180<br />\nHOPKINS ALUMNUS<br />\nFRANCES T. B.ANNON<br />\nDISCOVERS.1IANYINTERESTI.VG FACTS<br />\nAll Lines of Insurance<br />\nSuccessor to HARBAUGH 6? BANNON<br />\nFast and attemtits to '<br />\nPhone. Ea:a IOC?<br />\n2 E. LEXINGTON ST., Cur. Char!,<br />\nDuring the recent listing of the Earth Stands<br />\n(Room 23)<br />\nDr. Michelson of Bureau of Eth- foreign dissertations and inaugural' prove that the universe 'roteStenographic Dictation, Copying,<br />\nnology Talks on Race Factors addresses in the Hopkins physics about the earth.<br />\nItigraphing, Mimeographing<br />\nMa<br />\nBaltimore<br />\nstartling works: were<br />\nlint the most unti,ual<br />\nBANQUET OPENS SESSIONS library some<br />\nentitled<br />\nHtNNEGEN.BATES COMPANY<br />\nexhumed. One if. these was \"A reasoning was a di,4-ussion<br />\n:tandards.'<br />\nDr. Laidler of League for Indus- Phylosophical Essay Treating of the ate \"Battle of the ,:-J<br />\n'a`rgumen:<br />\nMost Probable Cause of that Grand which presented a bitter<br />\ntrial Democracy Speaks<br />\nJewelers and Silvers17ths.since 185'7<br />\nCOMPLETE<br />\nof Nature. The Flux and against the \"sornethiii;iz bran ne•te<br />\nMystery<br />\nSeventy-five foreign students now Reflux: or. Flowing and Ebbing'of which the \"French people^ing in<br />\nDRESS SETS ,<br />\nA<br />\n-tudying in Baltimore. Philadelphia. the Sea. Printed at three bibles on a bloody -revolution and verT radand Washirigton attended the Sixth the MkIdle of London-Bridge, ical about- that time concluded '0,<br />\nfor evening wear.<br />\n.sgiving<br />\nAmmal International Thank<br />\n1673.\" Vie copy in possession of have.\" The inspired author argues<br />\n.;<br />\nof<br />\nhall<br />\nbanquet<br />\nthe<br />\nin<br />\nheld<br />\nDinner<br />\n7 and 9 East Baltimore Street<br />\nthe library was a reprint made in that the \"Anglo-Saxon world should<br />\nthe Central Y. M. C. A. last Thurssystemi<br />\nmetric<br />\nadopf-the French<br />\nby one W.funk. The original<br />\nday evening. s Mr. E. A. Schaal of 1904<br />\n•<br />\nfounded on a curved '<br />\nJohns Hopkins acted as toastmaster. author gives and reputes nine con- becatte it is:<br />\nDr.<br />\nby<br />\na, straight line. beof<br />\ncause<br />\nCog\"<br />\nline instead<br />\ntemporary opinions as to the<br />\nAfter the entrance march<br />\nJOIN OUR<br />\nPlano<br />\nCo.<br />\nWar<br />\nErnesto Murilhb. Columbian4Consul of this grand mystery of nature. cause its terms are to. cumbrous.<br />\nLABloaa<br />\nTMAS SAVINGS CLU<br />\nCHRIS<br />\nl,929'<br />\nAn Vert<br />\nin Baltimore. Mr. Lewis C. Moore including , an opinion that the sea because of an infinite l number of<br />\nTwegreplt.<br />\nBetween<br />\nown Santa l'aus<br />\ngave the invocation.<br />\nyour<br />\nparbe<br />\nand<br />\nesqraebq<br />\nthe.<br />\non<br />\n• -was the lungs of the terrestial globe. meridians it was based<br />\nCALDER,<br />\nPabowsq<br />\ncourses two short addresses were<br />\nause<br />\nc<br />\nbeParis.<br />\nof<br />\nThen<br />\nmeridian<br />\nanimal.<br />\ngreat<br />\nticiilar<br />\none<br />\nwas<br />\nti44. tlica<br />\nPaid,<br />\ngiven. one by Dr. Y. C. Yin. Pres- which<br />\n•<br />\nlika<br />\ntad,<br />\n.ii-ensive.ip its teligions relaP• X<br />\nident of the Baltimore C1).inese Stu- the author presents hi:s own theory<br />\nLEXINGTON STREET AT LIBERTY<br />\n4<br />\na<br />\nDr,<br />\nis<br />\nfurthest removed 'from .<br />\nby<br />\n\"there<br />\nt:<br />\nvitriol'cing<br />\nother<br />\n::s.<br />\nthat<br />\nthe<br />\nwas<br />\nand<br />\nwhich<br />\nClub.<br />\ndents'<br />\n\\ Branches<br />\n;<br />\nof<br />\nPressystems<br />\nGermany.<br />\nsacred<br />\nof<br />\nand<br />\n'SERVICE.<br />\nPreset<br />\nh<br />\nsalt<br />\nor the scriptural<br />\nIrtngard<br />\nated, volatile or armonisC<br />\nNorth Avenue at Charter<br />\nident of the Baltimore Students; spirit, that is_wrap.d up in the 1.ow- weights and measures, of 411 known<br />\nBelair Road at Southern<br />\nCosmopolitanrClitt- The address<br />\nsysterns..1 The article fervidly conels of the - sea and is there c1:1-:<br />\nProducers of the \"Netcs-Lrre,of the evening was delivered by<br />\nthe ::xe<br />\n\"Let us not be turned aside<br />\nof<br />\nembraces<br />\nthe<br />\nin<br />\nup<br />\nsubHis<br />\nRabbi Morris S. Lazaron.<br />\npaths of rectitude or- rig,htits<br />\nthe<br />\n71:<br />\nupon<br />\nwhich<br />\nsalt,<br />\nsnitrous<br />\nject was \"The Material •Consciou<br />\nNEW LIFE<br />\nTHE GIANT<br />\nTv' the specious devices<br />\nBOOKS<br />\nness in International Relations:: • tion of the superticies of the<br />\nFOR MOTORS<br />\nFUEL<br />\nPOWER<br />\nBeaight—Sold--Exchanged<br />\nThis dinner was the opening ses- and tht. opening of it by the vomit-. blind or wicked guides.\"<br />\nsion of the Fourth Annual Interna- biped and complicated -infression<br />\nWENS BOOK STORE tional<br />\nStudents' Conference, which of the sun and moon dislOges from<br />\n\"STANDARD\" MOTOR OIL<br />\nAt 7:30 last night a meeting of<br />\n605 N. EUTAW STREET<br />\nwas held in Baltimore flint Novemheld<br />\nwas<br />\non<br />\nAssociati<br />\nto<br />\nup<br />\nAthletic<br />\nitself<br />\nthe<br />\nshoots<br />\nand<br />\nits inelosulre<br />\nber 29 to December 2. When the<br />\nThe Measure of Oil Value<br />\nthe margent and drags along with in the .athletic office at the Barn.<br />\nConference met at 3107 N. Charles<br />\ntalked,<br />\nwas<br />\nseason<br />\nfootball<br />\nthe<br />\nstyled<br />\npast<br />\nThe<br />\nwaters<br />\nof<br />\nheap<br />\nthat<br />\nGomtneraal<br />\nNewspapers<br />\nStreet the next afternoon only it<br />\nWork<br />\nSTANDARD OIL COMPANY OF N<br />\ngames were<br />\nBooks<br />\n• thirty delegates were present„ due flux. etc.. -etc.\" Indeed. this Was of and many of the<br />\nEstiblished 1850<br />\nto a heavy downpour of rain falling a grand explanation, provided the played over again. The aii,arding<br />\nauthor understood it, and one of letters to the( varsity football<br />\nPrinting Company !at the time.<br />\nRacial Problem Is Social<br />\nmen was discussed. There was a<br />\nworthy of articles of Junk.<br />\nThomas &amp; Evans<br />\nThe first speaker was Dr. Trus-ion about awarding numerAnother wayward remnant<br />\n1506-1508 Guilford Avenue<br />\nman Michelson of the Bureau of<br />\n:he players on the freshman<br />\na<br />\n:e:<br />\nin<br />\n)(Ind<br />\ny<br />\nphilosoph<br />\nAmerican F.ilmolop- at WashingBaltimore, Md.<br />\n.<br />\n.<br />\n- f.'iqball teams.<br />\nentree<br />\nton. His topic'was \"The Effect of delivered in<br />\nne Vt \" Gifts o- f individual and striking jewelry for Mother, sister, brother, or<br />\nRace Migrations and Population<br />\nfriend. Seahorse hat ornament, brooches, charms and pendants.<br />\n41\"S TELE,r;RAPH DELIVERY ASS,S,CIATION<br />\nChanges on Race Relations.\" Dr.<br />\nItM.EREF.S., FLOE:1,<br />\n,<br />\nMODERATE PRICES<br />\nSON<br />\nEi<br />\nMichelson said that scientific invesj..A. RFTTER<br />\nBe Sure to Visit, Our --Gift'Shop • THE SOUTHERN<br />\ntigation has shown that the differk<br />\nFlorins .:--i<br />\nHOTEL<br />\nCarl Schon<br />\nences within a race are much greatBALTIMORE, MD<br />\n•<br />\n1918 N. CHARLES ST. Nea ::TH<br />\nBahimores Newest<br />\nthe<br />\nStreet<br />\nSaratoga<br />\nw.<br />\nbetween<br />\n109<br />\ndifference<br />\nthe<br />\ner than<br />\nVEracc. i673<br />\n:-: and Fines/<br />\nraces. Culture is not forganicallv<br />\n\"A 'hotel of eumospkrre but‘<br />\nd.<br />\nor biologically - detennirk<br />\n- end Evnitmnvene\"<br />\n-'12::SPArt<br />\n• .: .77.”-csge it.;;-7-141-Vat--leegitage...1.4leturtnine:.<br />\nby the experience of the race as a<br />\nYELLOW CAB STANDS<br />\nnation. In respect to culture North<br />\nBy BRIGGS<br />\nAT<br />\nern Europe has not originated much<br />\nHomewood Field<br />\nbut it has acquired a great deal. As<br />\n35th and Sc. Paul Streets<br />\nI<br />\n_,<br />\nto race migrations. the invader must<br />\nC1-4 GEGRGE.WHAI<br />\n,....-4-------/------ ----.<br />\nMERCY .5A1-\n/,<br />\n.,<br />\n31st and Sc. Paul Streets<br />\n7.U5TACE \\n/A.KIT S<br />\ncome itt*reat numbers in order to<br />\nI<br />\nA SHANIE Arai<br />\nService<br />\nTi<br />\nUP<br />\n''<br />\n-IC<br />\nElboent<br />\nSafe and<br />\nBE LITTERS<br />\nI GEE. PCP I'<br />\nAV,<br />\nE.USTACE HAT)<br />\nmake any impression. In Asia<br />\n,PLACE<br />\ni'sZ.o Charge for ban: Passengers<br />\nJuST SC'Et-4T Tv-JO<br />\n4 T N'CL: 1<br />\n' WHY DC1,<br />\nMinor, for example. three types<br />\n-11-4, NG s A N.Y v./Ay<br />\nHOOPS Scf?Tii4G<br />\n'PHONE<br />\n11.NC LAI<br />\nI Do<br />\n,..5McKE. CLD<br />\nhave persisted over long periods of<br />\nEPA ALL CuT<br />\n. VERNON 1212<br />\nis<br />\nnegro<br />\nTHGRP<br />\nGCLDS ?,<br />\ntime. Our antipathy tO the<br />\nFOR A<br />\nrenot innate. Jn -Europe he is not<br />\n.15r4'T A CcuGN<br />\nCAB<br />\nYELLOW<br />\ngarded a,. inCthis country.. Our<br />\n1.4 A CA.SLcP.D<br />\nracial feeling and troubles are soL.<br />\ncial ratherAbatiebiolcgical Jewish-nese: in type is not different from<br />\nus in general. chiefly Oriental TO<br />\nrealize the fullest possibilities of a<br />\npeople, it is neces..:sary to study them<br />\n:n their original home. The racial<br />\nquestion is a matter of tc4eration<br />\nabove all e:se. He pointed out that<br />\nalthough the capability of speech is<br />\nblologicallv deterniined, what particular speech an individual may<br />\n:Ise is<br />\ndeterrhinecl.<br /><br />\nINTERNATIONAL STUDENTS<br />\nHOLD 4TH CONFERENCE<br /><br />\nR.<br />\nTAYLOR<br /><br />\nPARK BANK<br /><br />\nESSO<br /><br />\nThe Carl, Schon Christmas<br />\n,hop is ready<br /><br />\n11-hcn a 1=ellcr Needs a Friend<br /><br />\n\\<br /><br />\n1<br />\n\\<br /><br />\na drag<br /><br />\nith a<br /><br />\ni_eartiet: professors<br />\nstud wise students<br />\nfind the easiest wav<br />\nto have adrag Avith<br />\nthe fair sex is to<br />\nNear<br />\nBrat burn<br />\nUniversity<br />\nOothes<br />\n/<br />\nFt.<br /><br />\n84^ $45<br /><br />\nClothias and ffsberi.:s.. hers<br /><br />\n...11-11EIDIUELT0,<br />\n17 E. Baltimore St.<br /><br />\nRace Dotaisiatioa.for Pro&amp;<br />\nThe second address .cf the afternoon was delivered by Dr. Harr..<br />\nLaidler. Executive Director of the<br />\nLeague for Industrial Democracy.<br />\nHis topic was. \"Specific Inter-racial<br />\nEconomic Problem.\" Most of<br />\nthese'arise from the exploitation oi<br />\n..ne race by: another. Those who<br />\nhave orleained economic benefit by<br />\nthis exploitation have supported<br />\n\"the right of gaperiority: Exploitation causes the dominant race ec<br />\ntry to keep educational advantages<br />\nfrom the dominated race_ Then it<br />\nCostameet ow Page 4, Col. 3<br /><br />\nFRANK'S<br />\nLight Lunch<br />\n5 W. Tv.,enty-tirn Sc.<br />\nOpen 9 3,0 A. M. to Nfichuglit<br />\nPhone CAN,: t9-,<br />\nTHE CHARLES E. MYERS CO.<br />\nitiaatirer ot<br />\nNta,<br /><br />\n(RUBBER STAMPS<br />\nThe Service Shop<br />\n319 W Redwood Sc.<br /><br />\nVol<br /><br />\n811<br />\nIns<br /><br />\nCAI<br />\nDo<br /><br />\nFa<br />\nhand<br />\nany<br />\nseas(<br />\nout team,<br />\nstroll<br />\nStrae<br />\nCapli<br />\nnude<br />\nteam.<br />\nin L<br />\niiIls<br />\nblot<br />\nthrou<br />\npeels<br />\nfougli<br />\ntake<br />\nto an<br />\nyea<br /><br />\nI la•<br />\nbelts,<br />\ndust<br />\nfront ;<br /><br />\nYorke<br />\ning in<br />\nthe itni<br /><br />\ntime<br />\none by<br />\nmore<br />\ngame.<br />\ntune<br />\n-eleven<br />\ntime sa<br />\nthe III<br />\nLyons<br /><br />\ngame;<br />\nfield a<br />\n*ginnth<br />\nwas ce<br /><br />\ngenerz<br />\nhad j<br />\nfor th<br /><br />\nnecess<br />\nior a<br /><br />\nI,2ar<br />\nSpot i<br />\neasily<br />\nscore:<br />\n. made<br />\nstreng<br /><br />\nA ft<br /><br />\ngames<br />\nBlue:<br />\nMaryl<br />\nset-ba<br />\nwent<br />\nin th(<br />\nthem<br /><br />\nTh(<br /><br />\n,<br /><br />\nexpect<br />\nunder<br />\nscore<br />\nland g<br />\none b<br />\nbe reg<br />\ner ant<br />\nall thi<br /><br />\nLD GOLD<br /><br />\nIn<br />\nkins<br />\nheld I<br />\nVan<br /><br />\n'The Smoother and Better Cigarette<br /><br />\nPoints<br />\noppou<br /><br />\nnot a cough in a carload<br />\nC<br /><br />\nCa.Est. IMO<br /><br />"}], "field_media_file": [{"target_id": 38314, "display": null, "description": null, "target_type": "file", "target_uuid": "34b2a317-0060-49ef-839b-448164c608d5", "url": "http://digital.library.jhu.edu/system/files/2022-03/13346-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13346, "target_type": "node", "target_uuid": "0ebf3162-16e7-4644-825c-77241309c349", "url": "/node/13346"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a8eeba70-095f-43b5-9398-a3d5882ec2d3"}]}