{"mid": [{"value": 36763}], "uuid": [{"value": "12e8a48b-84fa-4ff5-b1c2-51825f39b19d"}], "vid": [{"value": 36763}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13016-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "ds,<br />\ns,<br />\n<br />\nlor<br />\n<br />\n'S<br />\n<br />\nTOL. XXVII. No 3<br />\n<br />\n+I<br />\n'<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., OCTOBER 10, 1922<br />\n<br />\n,<br />\n<br />\n'RESHMAN RECEPTION DECLARED A GREAT<br />\nSUCCESS<br />\n-7irst Year Men Introduced to University Life. Y. M. C. A. Presides,-<br />\n<br />\nMEN CANDI!<br />\nIYI-ES FOR BLACK AND<br />\n11)<br />\nBLUE CROSS-COUNTRY<br />\nTEAM<br />\nA. I. A. A.<br />\n<br />\nDRS. LATANE AND WIL- BLACK AND BLUE ELEVEN<br />\nLOUGHBY TO ATTEND<br />\nHELD TO SCORELESS TIE<br />\nBY MOUNTAINEERS<br />\nSOUTH AMERICAN EXDean Latane and Major Garey Address<br />\nPEDITION<br />\nHopkins Gridders Show Flashy Midfield<br />\nFIRST WEEKLY ASSEMBLY<br />\nTURNED OVER TO STUDENT ACTIVITIES<br />\nMeeting.<br />\n<br />\nUniversity Activities<br />\n<br />\nHopkins<br />\n<br />\nMake Extended Visit<br />\n<br />\nAttack, But Lack Push to Score.<br />\n<br />\nDean to<br />\nand Middle States Runs<br />\nBrought Before Freshmen.<br />\ntte'plitifrri Fri- S.<br />\nTurnbull and Taylor Star.<br />\nBiggest Events. Mapping a New<br />\nand Tour of Latin-American<br />\nThe<br />\nassemfirst<br />\nweekly<br />\nof<br />\nthe<br />\nday night was a great success.<br />\nCountries.<br />\nCourse for J. H. U. Contemplated.<br />\nthe first home game of the<br />\nIn<br />\nblies to be held throughout the<br />\nThe new students were made to feel<br />\nThe seventeen men who report- year took place last Thursday in<br />\nOn the nineteenth of this 1922 gridiron season and the first<br />\nat home, and even some haughty<br />\ned for the organization of the the lecture-room of the Civil En- month Dr. John H. Latane, dean contest having a direct bearing on<br />\nsophomores condescending to give cross-country<br />\nteam are now en- gineering Building. Dean Latane of the College of Arts and Sci- the state title, the Mt. St. Mary's<br />\nthe lowly freshmen a smile.<br />\ngaged in daily practice over the lamented the fact that an unfor- ences, and Dr:W. W. Willough- eleven held the Black and Blue to<br />\nUpon entering the C. E. Build- University<br />\ncourse. Only four reg- tunate lack of accommodations by, professor of political science, a scoreless tie at Homewood last<br />\ning, each freshman was \"tagged\"<br />\nAmerican Saturday.<br />\nulars of last year's team reported prevented the attendance<br />\nAlthough decisively<br />\nof the will leave on a South<br />\nand introduced by the reception<br />\nfor the initial practice. However, entire undergraduate student trip, the duration of which will be outplayed in every quarter of the<br />\ncommittee to President Goodnow,<br />\nwith over a dozen promising new body. He announced that attend- approximately two and one-half game, the Mountaineers showed at<br />\nDean Latane and Dr. French.<br />\ncandidates, the outlook for a suc- ance at the Thursday assemblies months as they Plan to return to their best when backed up against<br />\nThe reception was opened by<br />\ncessful season is by no means di- would be compulsory for the this country not later than the their own goal line. Repeatedly the<br />\n\"Bill\" Dean, vice-president •of the<br />\ninured. Booth, Cronin, Fenton Sophomores and Freshmen, and first of January.<br />\nsmashing attack of the Hopkins<br />\nHopkins Y. M. C. A. Mr. Dean,<br />\nThe primary object in this trip backfield marched half the length<br />\nand Holzapple are the old men voluntary for the Juniors and Seon behalf of the<br />\nM. C. A., wel- who form a nucleus for the new<br />\nis to attend the Brazilian Centen- of the field only to be thwarted by<br />\nniors.<br />\ncomed the new students and invited<br />\nteam.<br />\nDr. Latane's address consisted nial Exposition which is conven- the dogged defense of the invaders<br />\nthem to enjoy all the privileges of<br />\nThe<br />\n1922<br />\nschedule<br />\nhave,<br />\nwill<br />\nin principally of advice to the Fresh- ing at Rio de Janeiro during the within the shadow of their goal<br />\nthe Y. M. C. A. President Goodposts.<br />\nall<br />\nprobability, four meets, to- men. He reminded them that the winter.<br />\nnow was introduced as the speaker<br />\nDean<br />\nLatane<br />\nhas<br />\ninbeen<br />\nlong<br />\no-ether with the novice run under crowded conditions existing at<br />\nThe fact that the Black- and Blue<br />\nof the evening.<br />\nauspices of the Baltimore Hopkins as well as at other uni- terested in Latin-American his- eleven was able to chalk up fifteen<br />\ntilt,<br />\nDr. Goodnow told the freshmen<br />\ntory and diplomacy and has often<br />\nthat they are now a part of an or- Cross-Country Club as explained versities will soon necessitate wanted to visit South America. first downs to two for the Mounin last week's News-Letter. Two some sort of system of selection.<br />\ntaineers, exclusive of penalties,<br />\nganized community;-which has a<br />\ndUal meets with other colleges and While a selective system suitable Dr. Latane is considered an inter- showed clearly the superiority of<br />\ndefinite purpose to fulfill; that the<br />\ntwo intercollegiate runs are cal- to applicants for admission has national authority on relations the home team. Except in the puntschool was organized for the benewith Latin-America and has writing department, where Cronin refit of the students, and that the culated to give the Black and Blue not been fully developed at Hop- ten an authoritative book<br />\non the peatedly outdistanced Turnbull,<br />\nharriers all that they are willing kins, the \"weeding out process\" is<br />\nthe<br />\nUniversity, to be a success, must<br />\nsubject. He has many friends and<br />\nbe operated through the students. to undertake. The South Atlan- carried on among those who have acquaintances in the South'Ameri- Hopkins machine outplayed the<br />\nMountaineers completely. FlashIn concluding, he welcomed the tic run this fall will be sponsored (rained admission. An individual's can countries and on this trip<br />\nis<br />\nVirginia<br />\nby<br />\nBlacksburg,<br />\nPoly<br />\nat<br />\nacademic<br />\nrecord,<br />\ncollaboration<br />\nin<br />\ning a co-ordinated attack that was<br />\nmen who are entering Hopkins,<br />\nVa. The Middle States meet will with his grade in the intelligence desirous of seeing a large number lacking in the Princeton game, the<br />\nrequesting them to.regard restricof them and learning their views<br />\nBlack and Blue backs repeatedly<br />\ntions and to try to fill their own be given by Lafayette College at test required of all entering stu- on questions of the day.<br />\nEaston,<br />\nPa.<br />\nVerne<br />\nBooth,<br />\ndents,<br />\nwho<br />\nwill<br />\nconstitute<br />\nbasis<br />\nthe<br />\nfor<br />\ntore<br />\nthrough wide gaps opened in<br />\nthe<br />\nparts at<br />\nUniversity.<br />\nDr. Willoughby, who is on a<br />\nwas unable to compete in these deciding whether or not he should<br />\nthe opposing line. Turnbull, in the<br />\nMr. Sherwood, president of the<br />\ntwo runs last year on account of remain a student at Johns Hop- leave of absence extending until first half, and Taylor, in the secStudent Council, was next introthe migratory rule, will this year kins. The Sophomores, too, were January first, has recently re- ond, were the stars on the offenduced. He explained the principal<br />\nbe .able to show his wares and warned against considering them- turned from a four-month trip to sive.<br />\nfunctions of the Student Council.<br />\nSouth Africa, where he was studyMr. Collins, president of Omicron possibly his heels to the rest of selves immune from dismissal. ing existing<br />\nAlthough the Black and Blue<br />\nconditions in that<br />\nWith a few words of general adpelta Kappa Fraternity, followed the intercollegiate harriers.<br />\nshowed<br />\nits superiority from the<br />\npart of the globe.. He had origiCyne of tile new plans now be- ice to flu_ Freshmen, Dean LaMr. Sherwood. He talked of the<br />\nt,<br />\nstai<br />\nthe<br />\npunting of Cronin kept<br />\nnally planned to make an \"roundhonorary fraternities at Hopkins, ing considered by the C. C. team tane concluded his address.<br />\nthe<br />\nball<br />\nout<br />\nof danger for the first<br />\nthe-world<br />\n\" trip, with the particMajor Garey notified the assemand especially of the 0. D. K. In and the Athletic Board is the<br />\nten<br />\nminutes.<br />\nTowards the end of<br />\nular purpose of visiting the Far<br />\norder to become a member of this mapping out of a new course. The bly that the Hopkins R. 0. T. C. East, with which<br />\nthe<br />\nfirst<br />\nperiod<br />\nthe Hopkins team<br />\nhe is in close dip-.<br />\nfraternity, good, earnest work and trouble with the present course of Unit has been dropped from the lomatic relations, but<br />\nstarted<br />\nwhat<br />\nseemed<br />\na certain<br />\nlack of<br />\ninterest in student activities is re- two miles is that it is too smooth War Department's \"Distinguished steamer facilities<br />\nmarch<br />\ndown<br />\nthe<br />\nfield.<br />\nThe<br />\nball was<br />\nthwarted his<br />\nquired. Only the leaders on the and does not have enough hills. List.\" Assuming entire blame for plans.<br />\nworked from past midfield to the<br />\ncampus are eligible to membership. After practicing all fall on a lev- the matter, he urged that all work<br />\nThe professors will leave New fifteen-yard line, when the first<br />\nThe Hopkins Quartette then en- el course the Hopkins men have harder than ever to recover the York on<br />\nthe Santa Elisa, the voy- quarter ended. It was fourth down<br />\ntertained with two selections: The had considerable difficulty in ne- former standing, and to prove age taking them<br />\nthrough the Pan- with four yards to go at the beginUniversity Ode, \"Veritas Vos Lib- gotiating the hilly courses of the that the method of military in- ama Canal, down<br />\nthe west coast ning of the second period, and ,on<br />\nerabit,\" and a negro song entitled, other universities. It is planned struction used at Hopkins is the of South. America,<br />\nmaking vari- the first play Turnbull made only<br />\nto map out a new course which best one. Major Garey's remarks<br />\n\"When I Get to Heaven.\"<br />\nous stops at the larger and more three yards through the line. CronCoach Van Orman next spoke. will be a standard J. H. U. run met with enthusiastic response. important cities<br />\nalong the way, in then kicked out of danger and<br />\nJ. R. Sherwood, president of<br />\nHe warned the freshmen not to and on which a university record<br />\nfinally<br />\narriving<br />\nat Valparaiso, the ball see-sawed for the remainneglect their studies because of ath- may be established. It is hoped the Student Council, announced<br />\nChile.<br />\nThey<br />\nwill then cross the der of the half. During this time<br />\nletics, for, he pointed out, expul- that the course will be decided the Freshman reception, schedAndes<br />\nby rail and will spend two the Hopkins team resorted entirely<br />\nsion from the University for lack upon in time for the first dual uled for Friday night, and reto line bucking. Before the half<br />\nminded the Class of '25 of its weeks in Buenos Ayres. The next<br />\nfmecessai-y -marks renders an ath- meet.<br />\nended<br />\nTaylor went in at half and<br />\npromise to abandon the practice stop will be Montevideo. From<br />\nete useless to Hopkins<br />\nBuck<br />\nBonner<br />\nreplaced Wilson, who<br />\nteams.<br />\n'of holding the Freshman-Sopho- there they will go to Rio to at\"Happy\" Middleton, president of<br />\nstill<br />\nwas<br />\nsuffering<br />\nfrom a wrenched<br />\nTURNBULL LECTURES TO more rush at that time. Mr. Sher- tend the Exposition and will rethe Athletic Association, gave an<br />\nknee,<br />\nat<br />\nquarter.<br />\nBEGIN<br />\nwood also made numerous an- turn home from that point.<br />\nmitline of the work of that organiSoon after the opening of the secDuring Dean Latane's absence<br />\nThe trustees of the Percy Turn- nouncements in regard to other<br />\nzation, and urged that every stuhalf Van Orman's machine<br />\nond<br />\nDr. J. E. Gilpin, professor of<br />\ndent give the teams all possible bull Memorial lectureship an- activities, the variety and extent<br />\nlaunched<br />\na powerful attack that carchemistry, will be acting dean.<br />\nsupport. Verne Booth, captain of nounce that the twenty-fourth of which showed that the univerried<br />\nthe<br />\nball<br />\nto St. Mary's 16-yard<br />\nthe cross country -team, requested course of lectures on this founda- sity activities are in full swing.<br />\nline,<br />\nwhere an attempt to make<br />\ntion will be given by Emile La- Mr. Fallon issued a call for canthat everyone able to do so come<br />\ngonis, D es L, professor of Eng- didates for the News-Letter Staff, VOTE FOR SOPHOMORE first down failed by inches.<br />\nDut for cross-country work. \"Dal\"<br />\nPRESIDENT RESULTS IN<br />\nAgain<br />\nCoach<br />\nDickerman's<br />\nlish Literature in the University and Mr. Collins called for<br />\ncandiKirwan, manager of track, called<br />\ncharges<br />\nTRIPLE<br />\nTIE<br />\ntightened<br />\nTurnbull<br />\nand<br />\nParis,<br />\nthe general subject be- dates for the Black and Blue Jay<br />\nfor candidates for that sport. Tie of<br />\nA<br />\ntriple<br />\ntie<br />\nwas<br />\nfor<br />\nforced<br />\npresident<br />\nto<br />\nof<br />\nthe<br />\nkick.<br />\nMiddleton<br />\nand<br />\ning \"The Poetry of Edmund staff and for the lacrosse team. .<br />\nexplained that it was an opporSophomore<br />\nRich<br />\nClass<br />\nwere<br />\nresulted<br />\ndown<br />\nfrom<br />\nin<br />\na<br />\nflash<br />\nand<br />\nSpenser.\"<br />\nThe assembly ended with a<br />\ntunity \"to see America first.\" John<br />\nthe election of officers held at a tackled the receiver in his tracks.<br />\nlectures<br />\nbe<br />\nwill<br />\nstrenuous<br />\nyell practice.<br />\nThe<br />\ndelivered<br />\nNrurphy, captain of lacrosse, told<br />\nclass meeting last Thursday. Ma- After failing to gain, Cronin at)f the prospects of that particular in English and will be given in<br />\ngill, Turnbull and Kline were the tempted to punt on the third down,<br />\nEngineering MAJOR GAREY ADDRESSES<br />\n;Port for this year, and asked for the hall of the Civil<br />\nmen who held the equal number but Magill broke through and made<br />\nINTERFRATERNITY<br />\nBuilding at 5 o'clock, beginning<br />\narididates for the team.<br />\nof votes. The other offices were a clean tackle before the St. Mary's<br />\nBOARD<br />\nwill<br />\nAt an Interfraternity Board not so closely contested.<br />\nMr. Fallon, president of Student Monday, October 16. They<br />\nman could even get the ball in powill end meeting held last Friday the<br />\nand<br />\npunctually<br />\nbegin<br />\nregPage O'Connor was unani- sition. On the next play, however,<br />\nActivities, was the next speaker.<br />\nwithin the hour. The door will be ulations in regard to the coming mously elected to represent<br />\n(Continued on page 4, col. 2)<br />\nthe he punted; Taylor ran it back 20<br />\nclosed when the lecture begins. \"rushing season\" were gone over, class in the Student Council. Wilyards and Turnbull attempted a<br />\nNOTICE<br />\ninterpreted by the board, and will lis was elected vice-president, M. drop kick from the thirty-five<br />\nDates—<br />\nyard<br />\nMeeting Student Activibe stringently enforced. President Skinner secretary, Towner treas- line. The ball sailed low and was<br />\nMonday, October 16<br />\nties Council at Pi Kappa Chi<br />\nMacaulay, of the board, introduced urer, and Post, sergeant-at-arms. picked up behind the goal line by<br />\nTuesday, October 17<br />\nHouse Thursday at 7.30<br />\nMajor Garey as the speaker of the<br />\nThe meeting was held. with Ruiz, who was tackled when he<br />\nThursday, October 19<br />\nP.M.<br />\nmeeting. He asked the Interfra- some disorder, making it difficult tried to run it out. Thinking it a<br />\nMonday, October 23<br />\nCandidates for News-Letternity Board to help the R. 0. to determine the candidates. The safety, the stands were in an upter Staff report at office<br />\nTuesday, October 24 .<br />\nT. C. in getting the best Fresh- triple tie was voted off at a meet- ,roar, but the referee ruled it a<br />\n12.20 todayThursday, October 26.<br />\nmen to come out for that activity. ing held yesterday.<br />\nContinued on Page 4, col. 3<br />\n-<br />\n<br />\n,<br />\n<br />\nSEVENTr<br />\n<br />\n\fFTER, OCTOBER 10, 1922<br />\nTHE JOHNS HOPKINS NEWS-LF:<br />\n..UE JAY\"<br />\nEDITOR RECEIVES POEM OF<br />\ntion to F. P. A.'s \"Conning Tow- Pf<br />\n\"BLACK ;I' ND BI<br />\nN FIRsT<br />\nREPENTANCE<br />\nAT WOLK UPO_<br />\ner\" of the \"New York Tribune.\" Jr<br />\nDear Dhity<br />\nISSUE<br />\nFOUNDED 1897.<br />\nWith three-quarters of the \"four spite of such a pretentious name<br />\nTo Appear Latter Part vf Month. Corn. ,<br />\nit is a rollicking bit of verse. Be<br />\n•.)<br />\n.of college\" behind<br />\npetition Started Among Ce..ndiSubscription<br />\n$2.00<br />\n)r<br />\ncause<br />\nof its moral it belongs in th<br />\ndates for Staff.<br />\nwith the- Tollzation that<br />\nni ,<br />\nat<br />\nsedate News-Letter, and not th<br />\nAt a meeting of the literary staff<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nof the \"Black and Blue Jay\" last I have squandered much iirne at irreverent \"Black and Blue Jay. rui<br />\nthe Barn and on the campus<br />\nAlth<br />\nPublished semi-weekly from October to June by the students of Johns Wednesday plans for the first<br />\nii.written about life<br />\nHopkins University.<br />\nnumber of the Hopkins humorous should have been spent in the sole<br />\nher<br />\niollegeit recalls in man<br />\nmonthly were completed. The is- occupation of pursuing knowl- a<br />\n•<br />\n•<br />\nBusiness communications should be addressed to the BUSINESS MANways<br />\nraduate<br />\nexistence a<br />\nsue<br />\nis<br />\nto<br />\nbe<br />\ncalled<br />\nthe<br />\n\"RenaisAGER, JOHN HOPKINS UNIVERSITY; all articles and other communications<br />\nedge, I believe that I am best fitits<br />\nshould be sent to the MANAGING EDITOR.<br />\nHumewood.<br />\nsance\" or \"Revival of Learning\"<br />\nUr<br />\nted to deliver a sermon to the<br />\nTake heed, ye members of th ag,<br />\nHomewood 100 number, and will be out in the latTelephone<br />\nFrosh<br />\non<br />\nthe<br />\n\"Iniquities of Idleter part of October. Jokes about<br />\nclass of 1926, before it is too lat<br />\ncot<br />\nthe \"revival of learning\" (the re- ness.\" I have dug up a poem by<br />\nBut, of course, you won't.<br />\nGc<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nturn to college) and seasonable another sinner who repents of the<br />\ntre<br />\nBenny.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nremarks upon the harassed error of his ways at an unnamed<br />\nGLOVER P. FALLON, '23.<br />\nAl:<br />\n\"freshies\" will comprise the great- Alma Mater some number of<br />\nManaging Editor:<br />\ncal<br />\nJ. HUDSON HUFFARD, '23.<br />\ner part of the magazine.<br />\nRa<br />\nyears ago.<br />\nAdvertising Manager:<br />\nMore material is needed to inAssistant Managing Editor:<br />\n\"Our second baseman woul MI<br />\nDONALD K. VANNEMAN,'23.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nsure the success of the first issue. This poem,\"Haec Ohm MemiNc<br />\nContributions, preferably, but not nisse Iuvabit\" (whatever that make an excellent swimmer.\"<br />\nAssociate Editors:<br />\nag(<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nnecessarily, along the lines men- means) in 1916 was awarded first \"Why so?\"<br />\ntioned<br />\nabove, are wanted. All prize as being the best contribu- \"Oh, he strikes out so boldly.<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJunior Editors:<br />\nsta<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\ncopy for this number must be suba<br />\nFITZGERALD DUNNING, '24.<br />\nT. REESE MARSH, '24.<br />\nmitted by noon on Tuesday, OcT. CLYDE ROUTSON, '23.<br />\nPHILIP W. HOWARD, '25.<br />\ndez<br />\nHAEC OLIM MEMINISSE IUVABIT<br />\nR. C. TILGHMAN, '25.<br />\nMILES D. MARRIAN, '25.<br />\ntober 10.<br />\nme<br />\nWILLIAM G. DEAN, '24.<br />\nG. DONALD GIESKE, '25.<br />\nBy Deems Taylor<br />\nThe meeting on Wednesday<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nbet<br />\nBENJAMIN T. ROME, '25.<br />\nplanned also for competition Oh, back in the fall of 1902, when I was a freshman green,<br />\nstu<br />\namong the students who are can- I planned to be one of the cuWu—red few, with a high and beetling beat ag(<br />\ndidates for the literary staff. As<br />\nSo I took on Latin, and German 4,<br />\ncot<br />\nthe<br />\nresult a contest in the gatherAssociation.<br />\n• Member of Southern Intercollegiate Newspaper<br />\nFrench, History 5 (to the Civil War),<br />\ning of material was started at a<br />\nTrig ,Algebra 1-7a ghastly bore<br />\ntin(<br />\nmeeting of the candidates held<br />\n—and Freshman chemistree ;<br />\nCit<br />\nlast Friday and will continue until Here, then, are the facts I still retain from 1902<br />\n\"is,<br />\nand three:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. December 1. Appointments to the We won the<br />\n\"bloody Monday\" fight, and made the Sophs retire,<br />\nran<br />\nstaff will then be made. Credit Dear Lehigh licked the<br />\nty<br />\nfootball team by a score that was somethirq<br />\nwill be given not only for matedire,<br />\nfirlZ<br />\nrial that is printed, but also for<br />\nBALTIMORE, MD., OCTOBER 10, 1922<br />\nBill came on from Chicago U.<br />\nfun<br />\nall work submitted that is worthy<br />\nWith some bar-room stories—and good ones, too;<br />\nof being printed. For example, a I got on the glee club, and made Psi U, and sang in<br />\nWORTH YOUR TIME<br />\nthe chapel choir<br />\nWH<br />\nAfter the Y. M. C. A. reception, Friday night, the average fresh- contestant may hand in material<br />\nman probably found himself in a quandry as to what activity he should which, while not suitable for any As a Sophomore, I am proud to state, I was taking the hurdles clear<br />\nchoose. There may have been a few who sought eagerly for some of the early numbers, may be of I dreamed of copping the old Phi Bete by the end of my Junior year<br />\nactivity with slight demand as an outlet for Freshman Regulation Num- use in later issues. By this arI soaked up Logic, and Physics 3,<br />\nber One, but we hope, and believe, that the greater number gave an rangement the various candidates<br />\nFrench Lit. (I was there with the loud oui, oui !),<br />\nPsychology, Shakespeare, Verse--ilitihonest study to the matter, in hopes of selecting a branch in which they will derive full benefit from their<br />\nefforts. Since the success of the<br />\nmight eventually rise to the top.<br />\n-and a couple of courset more,<br />\ncontest<br />\nwill be extremely- helpful Here's what I recall as I look back on<br />\nEvery, activity on the campus has its individual merits, but we<br />\n1903 and four: •<br />\nbelieve that the NEWS-LETTER offers the Freshman more 'for his work to the \"Black and Blue Jay\", all Weary chairmaned the Junior prom (his girl<br />\ns Harriet White).<br />\nthan any other. In competing for the editorial staff of this publica- students are urged to give their I played third quarter on the football scrub, while Loup played cen Base<br />\ntime and interest to the affair.<br />\nter and right.<br />\ntion, the candidate not only absolves the above-mentioned Regulation<br />\nSeveral changes in the staff<br />\nJoe Bauderman ran a record mile,<br />\nNumber One Requirement, but accomplishes a great deal for his own<br />\nLact<br />\nhave been made. Joseph A. Moran<br />\nThe baseball team was perfectly vile (3)<br />\npersonal benefit.<br />\nresigned<br />\nhis<br />\nposition<br />\nas<br />\nliterary I made the track team after a while, and fussed (4) each Saturda;<br />\nFirst of all, the inexperienced writer gains in his journalistic praceditor because he did not have suftheoretical<br />\nnight<br />\nTrac<br />\ntice a great deal more than he could possibly derive from a<br />\nficient time to devote to the work.<br />\ncourse in the same subject and obtains- a knowledge that will ever be<br />\nP. L. Ives, former managing edi- By Junior year<br />\nI had laid away those hopes of a Phi Bete key,<br />\nan asset.<br />\ntor, was elected literary editor, But I toyed with the<br />\nthought of a proud M.A. and a possible Ph.r Croi<br />\n• In the second place, those who show their superiority will be given<br />\nand Parker C. Williams, former<br />\nSo I grabbed off Plato, and Kant, and such,<br />\na place upon the staff and a consequent position in student affairs.<br />\nexchange editor, was elected manChurch History, Banking (the worldly touch!),<br />\nAnd last, but not least, those who seek honors, automatically beSwin<br />\naging editor. Edward A. Kent and<br />\nThe German bards—whom we termed \"them Dutch\"<br />\ncome candidates for the Hollander Prize, an award of twenty-five dolJulian D. Tebo, junior associate<br />\n—such French as I might contrive;<br />\nlars in gold, presented annually by Professor Jacob Hollander, of the editors,<br />\nTeni<br />\nalso have resigned, the And the following info,<br />\nstill adheres from 1904 and five:<br />\nDepartment of Economics of this University, in the interest of college former<br />\nbecause he left school and Tom Reilley's team smeared<br />\nR. P. I. to the tune of a large amount (5<br />\njournalism. This prize is awarded at the class-day exercises of the grad- the<br />\nRifle<br />\nlatter because of a lack of I made the gym and the<br />\ntrack<br />\nteams both; they ducked young Blut<br />\nweek.<br />\nJune<br />\nuating class during<br />\ntime necessary for the work.<br />\n(6) in the fount;<br />\nCandidates will be enrolled at any staff meeting Tuesday or Friday, at<br />\nStu,,<br />\nThe glee club trip was a Lakewood treat,<br />\n12:20, in the NEWS-LETTER office in the Barn.<br />\nY. 1,<br />\nThe baseball team got badly beat (7),<br />\nSTUDENT ACTIVITIES COUN- And I got third at the Wesleyan meet (8),—but third place didne<br />\nWANTED<br />\nNeal<br />\nCIL TO MEET<br />\ncount.<br />\nDespite the closeness of the score in Saturday's game, a vast imA meeting of the Student Acprovement over the previous week was noticed in the team-work of the<br />\ntivities<br />\nCouncil will be held on A Senior now, I was bald and grey with the studious life I'd led, akti<br />\nVarsity football machine. The resulting figures are probably the best<br />\nthing that could have happened to the team. Hopkins' position in the Thursday evening, October 12, at But proud of the knowledge stowed away in my small but well forme<br />\nhead.<br />\nstate championship race is not menaced, yet the team realizes that it the Pi Kappa Chi House. Since<br />\nHuR<br />\nthe founding of the Council weekI killed International (so-called) Law,<br />\nhas much to accomplish ,to hold the title.<br />\nTook Spanish and Chaucer (the latter's raw),<br />\nIn the case of Saturday's game, figures mean nothing. The visitors ly meetings have been held at the<br />\nWound up with a thesis on Bernard Shaw,<br />\nwere outrushed by 15 first downs to 2. Last year Hopkins made 6 first Barn, but due to the usual dinner<br />\nInter<br />\ntime<br />\nconfusion<br />\n—how much of that stuff still sticks?<br />\nand<br />\nconflict<br />\nof<br />\nWith<br />\nthe<br />\nscore.<br />\nthe<br />\ngreat<br />\nby<br />\nwinning<br />\na<br />\nMountaineers'<br />\n3-2<br />\nto<br />\ndown<br />\n5,<br />\nimprovement this year in rushing, the best verdict the Black and Blue meetings a full attendance was Well, here is the dope I recollect from 1905 and six:<br />\nDran<br />\nrare. This year meetings will be Bill and I wrote the Senior show (his book was a mere detail),<br />\ncould obtain was a 0-0 tie.<br />\nheld in the evening and monthly And Loup played \"Elsie, the Cannibal Queen,\" and looked like a half<br />\nThe answer lies in the fact that our team lacks experienced geninstead<br />\nof weekly as heretofore.<br />\nDeba<br />\ndressed whale;<br />\neralship and a finished booter.<br />\nLa<br />\nIt<br />\nis<br />\nplanned<br />\nto<br />\nSenior<br />\nThe<br />\nhold<br />\nthe<br />\nball<br />\ndream<br />\nwas<br />\na<br />\ndivine<br />\n(9),<br />\nmeetings<br />\nCoach Van Orman has overcome a number of obstacles in the last<br />\nat the different fraternity houses<br />\nMusi;<br />\nThe Senior banquet was mostly wine,<br />\ntwo years, has developed a number of grid stars, and has done wonders<br />\nand<br />\nto<br />\nmake<br />\nP.<br />\nAnd<br />\nA.<br />\nF.<br />\nran<br />\na<br />\nattendance<br />\nmine<br />\npiece<br />\nof<br />\nin<br />\nthe<br />\nof<br />\nNew<br />\nYork<br />\nevery<br />\nEvening<br />\nMail.<br />\nwith his material thus far this season. The first of the above shortUncle<br />\n1. 46-0, if you must know.<br />\ncomings can be improved by drilling, but the development of a good member compulsory.<br />\nAt<br />\nthe<br />\nfirst<br />\n2.<br />\nAnd<br />\nmeeting<br />\nmaybe<br />\nhe<br />\nwasn't<br />\nstuck on her.<br />\nthis ThursThe j<br />\npunter and drop kicker takes time and requires a certain amount of<br />\nday the Council will organize for<br />\n3. As usual.<br />\natlent.<br />\nthe year. The main business be4. Some girl, too. She married shortly after that.<br />\nIn this school of 800 students there must be some such talented and<br />\nfore<br />\nit<br />\nat<br />\nthe<br />\npresent<br />\n5. 53--0, no less.<br />\ntime<br />\nis<br />\nthe<br />\ncomes<br />\nout<br />\nwho<br />\nman<br />\nfor<br />\nEvery<br />\nthe<br />\nteam strengthens<br />\nexperienced man.<br />\nStud,<br />\napportionment<br />\nof<br />\n6.<br />\nI'm not sure of the name. He was going to sue the college<br />\nthe<br />\n,<br />\nStudent<br />\nAcper<br />\nseven<br />\ncent.<br />\nHopkins' championship chances by<br />\ntivities<br />\nFee<br />\namong<br />\nsomething,<br />\nthe<br />\nor<br />\nbut<br />\ndidn't.<br />\nvarious<br />\nAccording to the support given our rivals of the Severn, four hun\"the<br />\nactivities. Plans will also be form7. See note 3.<br />\ndred men should be cavorting about Homewood Field every day.<br />\nulated for getting scholarship men<br />\n8. The track up there is so narrow that only three of us coult.<br />\nJust give the coach a chance and he'll give you yours.<br />\nto<br />\npay<br />\nthe<br />\nactivities<br />\nrun.<br />\nfee.<br />\nCowl<br />\nWhile<br />\nTHE NEWS-LETTER regrets to announce the resignation of T. Clyde<br />\nthey are not required to do this,<br />\nI<br />\ntook<br />\n9.<br />\nAdele<br />\nMartin,<br />\na<br />\nqueen.<br />\nmarried<br />\nShe<br />\nBill<br />\nWildman<br />\nal'<br />\nRoutson, '23, and G. Cochran Doub, '23, from the Editorial Staff.<br />\nContinuod on Page 4, col. 5.<br />\nmost immediately afterward.<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\n\fTHE JOHNS HOPKINS l\\,<br />\nTEWS-LETTER, OCTOBER 10, 1922.<br />\n<br />\n:hoit<br />\n<br />\nPRESIDENT GOODNOW AP- JUNIOR CLASS NOMINATES<br />\nOFFICERS<br />\nPOINTED ON ATHLETIC<br />\n•<br />\nCOMMITTEE<br />\nMANUF ACTURING JEWELERS<br />\nAt - meeting held last ThursLancaster, Pa.<br />\nThe president of the University, day the Junior Class made -On iolClass Rings, Pins, Fraternity Pins,<br />\nJr. Goodnow, has 1ieen appointed lowing nominati tis for<br />\nCups, Medals, Etc.<br />\nclass offi- Stationery,<br />\nInvitations, Programmes<br />\na member of the temporary com- cers:<br />\n\"Makers of the Varsity Seals\"<br />\nmittee which is in control of Hopresident—Booth, Coady, Bon- STRATTON<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nkins athletics. This committet- ner, G. M. Shriven<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n(loes the 'vork of the Homey:Ood<br />\n$3.25 and $4.25<br />\nVice-president—Shaeffer, Ken- Negligee<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nCompany', w<br />\nv ed of nedy, Alfriend, Jenifer.<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nits own volition in order to let the<br />\nSecretary — Mount, Gardner,<br />\nAlso a Full Line of Men's<br />\nUniversity have the direct manFurnishings<br />\nMarsh.<br />\nagement of athletics. The present<br />\ncommittee is composed of Dr. Treasurer -- Dunning, DeavGoodnow, Air. Graham Boyce, ours, Ashton, G. M. Shriver, CroA suit by Lemmert gives the final<br />\ntreasurer of the University; Dr. ker.<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\nAbercrombie, director of physiSergeant-at-Arms — Limbach.<br />\ncloths cut in authentic fashion—<br />\ncal education; Mr. Blanchard<br />\nwhether for every-day wear or more<br />\nMarino, Barton, Eagle, Trovel, J.<br />\nfestive occasions.<br />\nRandall, .Jr., Dr. D. G. Stewart,'<br />\nMr. Robertson Griswold and Mr. V. B. Shriver, Rector, Hamburgat<br />\nLEMMERT<br />\nNorman C. Keyes, graduate man- er, Packard, Wilgis.<br />\n19<br />\nFayette<br />\nStreet, East<br />\nager of athletics.<br />\nThis committee is of temporary<br />\nBusiness Suits<br />\nDress Clothes<br />\nstanding pending the formation of COTILLON BOARD HOLDS<br />\nOvercoats<br />\nSport Togs<br />\na permanent committee. The<br />\nELECTION<br />\ndean of the academic school, two<br />\nW. Carville Gardner was elected<br />\nMt. Vernon 4999<br />\nmembers of the faculty, two mem- president of the Cotillon Club at<br />\nbers of the board of trustees, two a meeting held on Friday.<br />\nThis<br />\nstudents and the graduate man- election<br />\nwas held to fill the place<br />\nager will form the permanent left vacant by the withdrawal<br />\nCommercial Photography<br />\ncommittee.<br />\nfrom the university' of J. BrentCircuit Photography<br />\nThis committee will continue nall Powell. Gardner was forFlash<br />\nLights<br />\nViews<br />\nunder the counsel of the Varsity merly secretary and treasurer, his<br />\nGroups<br />\nEnlargem<br />\nents<br />\nClub just as that organization ad- former position being filled by<br />\nKODAK<br />\nvised the Homewood Co. Ar- Clarence Adams.<br />\nFINISHING<br />\n325 N. Howard St.<br />\nrangement of schedules, eligibiliThe Cotillon Club will hold a<br />\nty of players and management of<br />\ndance after each football game.<br />\nfinances will form the duties and The cotillons have not been<br />\ndef=unctions of the committee.<br />\ninitely decided upon as to date<br />\nincl place.<br />\nSARATOG<br />\n<br />\ncleat<br />\nyew-<br />\n<br />\nWHO'S WHO IN THE UNIVERSITY<br />\n1922-1923<br />\nAthletic Director<br />\nRay Van Orman<br />\n<br />\nCAV-<br />\n<br />\nme<br />\nBe<br />\nth<br />\nthe.<br />\na(<br />\nany:<br />\n2 at<br />\nI<br />\nthe<br />\nlate<br />\n<br />\nDUI(<br />\n'<br />\n<br />\n:Hy.<br />\n<br />\nJ. F. Apple Co<br />\n<br />\nFine Clothes<br />\n<br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\nWARNER & COMPANY<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br />\n<br />\n111111111111111111111111111111111111<br />\n1,1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br />\n111111 1111111111111111111111111111111111 1 1 1 ' 1 1<br />\n<br />\n1111111 1111111111111111111111111111 11111111111111111111111111111<br />\n1 1 1 1 1 1 1 1 1 1 1111111111111111111111111111 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 !'<br />\n1 1 1 1 11111 1 1 1 1 1I 1 1 1 1 IIIIDD1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1! !'<br />\n<br />\nThe INGERSOLL<br />\nDOLLAR. Pony<br />\nLength $1.00. Of<br />\nRolled Silver with<br />\nring for chain or<br />\nribbon.<br />\nThe JUNIOR 50c<br />\nto $2.00. An attractive little pencil in Nickel,Silver<br />\nor Gold, with ring<br />\nfor chain or<br />\nribbon.<br />\n<br />\nW.L. Mann<br />\n<br />\nbea<br />\n<br />\ne,<br />\nthin<br />\n•<br />\n<br />\nA AT<br />\n<br />\nLIBERTY STS.<br />\nA FRESHMAN PROTESTS<br />\n<br />\nLUNCHEON<br />\n<br />\nTEA<br />\nEditor of the News-Letter.<br />\nDINNER<br />\nDear Sir:<br />\nAs a Freshman who has just unSPECIAL PARTIES<br />\nAthletic Association—<br />\ndergone his first baptism of fire 11.30 A. M.<br />\ns. A. Middleton, ?resident<br />\nin the form of an intelligence test<br />\nuntil<br />\nT. M. Landy, Captain<br />\nPLAZA 6987<br />\nI feel most divinely inspired to 7.30 P. M.<br />\nG. C. Hardy, Jr., Manager<br />\n,) (2,<br />\nRay Van Orman (Cornell), Coach come to<br />\nthe defense of the pracI cell Baseball—<br />\ntice of giving them to such innoH. W. Grace, Captain<br />\nHOPKINS SCHOLARSHIP<br />\nD. K. Vannernan, Manager<br />\ncent and long-suffering freshies.<br />\nRESULTS ANNOUNCED<br />\nCoach<br />\nit is true, of course, that these<br />\nLacrosse..<br />\n—<br />\nThe results of the examinations<br />\nJ.<br />\nJ• N. Murphy, Captain<br />\ntests are still in their infancy, and held on F- riday, September 22, for<br />\n0. D. Collins, Manager<br />\n[mkt,<br />\nalthough they probably spot im- the Hopkins scholarships for<br />\nJ. M. Knipp (J. H. U.), Coach<br />\nTrack<br />\nbeciles pretty accurately, it is Freshmen entering the College of<br />\nE. Z. Aaronson; Captain<br />\n'doubtful whether their superiors Arts and Sciences have been anJ. N. Kirwan, Manager<br />\nJ. M. LeCato, Coach<br />\nare correctly classified. However, nounced. The five successful canCross-Country—<br />\n•unless such far-sighted universi- didates were:<br />\nV. H. Booth, Captain<br />\nG. V. B. Shriver, Manager<br />\nties as ours are willing to do a lot<br />\nAllan L. Grafflin<br />\nJ. M. LeCato, Coach<br />\nof tedious experimenting with<br />\nSwimming......<br />\nErnest A. Strathman<br />\nC. P. Coady, Jr.,<br />\nCaptain<br />\nthem the great rewards of their<br />\nMorton T. Sonneborn<br />\nP. Buhrer, Manager<br />\nTennis......<br />\nultimate perfection will never be<br />\nHugh J. .fewett, Jr.<br />\nJeanHoffmeister, Captain and<br />\nrealized.<br />\nNorris M. Hardesty.<br />\nManager<br />\nit (5 Rifle<br />\nTeam—<br />\nIt<br />\nThe<br />\nseems,<br />\nthree leading men are from<br />\n.neverthel<br />\ness,<br />\nthat<br />\nMut<br />\nG. M. Ruoff, Captain<br />\namong<br />\nCity<br />\ncertain<br />\nCollege<br />\nbackward<br />\nand the other two<br />\n-looking<br />\ntrks, Manager<br />\nStu,s<br />\ncircles, the aforementioned tests from Harford county.<br />\n:ouncil—<br />\n. Sherwood, President<br />\ny. 1( t<br />\nare regarded with an unseemly<br />\nA.iSt<br />\n3. Stevens, President<br />\nand<br />\nnot to say malicious levity. LAFAYETTE ABOLISHES CORPORclidn<br />\nAL PUNISHMENT<br />\nJ. Wyckoff, General<br />\nSecretary Such an attitude of mind, as I see<br />\nNeal F<br />\nLafayette College has followed<br />\ntter—<br />\n. H. Moore, Jr., Editor-in-Chief it, is wholly stupid and inappro- Swarthmore in the abolition<br />\nof<br />\n.. P. Fallon, Business Manager<br />\npriate. In fact, would like most corporal punishment in the hazing<br />\n''<br />\n'<br />\naelt and Blue Jay—<br />\nLawrence B. Fenneman, Editor- meekly to suggest (acutely bear- of Freshmen. In the chapel ex)rine,<br />\nin-Chief.<br />\ning in mind my humble position :ercises on September 27 the unC'• D. Collins, Business Manager<br />\nin this institution of learning), dergraduate body unanimously acHullabaloo<br />\nLawrence B. Fenneman, Editor- that those who think the<br />\npsycho- cepted the student council's rein-Chief<br />\nS. Atherton<br />\nMiddleton, Business logical tests a joke should not be port which prevents paddling and<br />\nManager.<br />\ncompelled to take them, but \"razzing\" of Freshmen off the<br />\nInterfraternity Board—<br />\nP. Stewart<br />\nshould<br />\nbe simply and accurately campus. The new rule will be<br />\nMacaulay, President<br />\nP. Buhrer, Secretary<br />\nclassified<br />\nas morons, thus saving rigidly enforced. The practice of<br />\nDramatic<br />\nClub—<br />\ntime,<br />\nmuch<br />\nlabor and printer's ink 'hazing in such a fashion has been<br />\nH<br />\nW<br />\n:<br />\nMoore, Jr., President<br />\nhalf<br />\nP. West, Manager<br />\ntrying<br />\nin<br />\nto<br />\nprove a foregone con- strongly denounced throughout<br />\nDebating Council—<br />\nLawrence B. Fenneman, President clusion.<br />\nthe campus by the leaders in colJ. E. Mount, Secretary<br />\nClass of '26. lege affairs.—Phoenix.<br />\nMusical Club—<br />\nJ. R. Sherwood, President<br />\n[ail.<br />\nD. K.<br />\nGraduate Manager<br />\nNorman C. Keyes<br />\n<br />\nVanneman, Manager<br />\nU ndergraduate Orchestra<br />\n—<br />\nJ• L. Simonovitz, Leader<br />\nThe Band—<br />\nF. E. Campbell, Leader<br />\n‘-hnicron Delta Kappa0. D. Collins, President<br />\nW. H. Moore, Jr., Secretary<br />\nStudent Activitie<br />\ns Council—<br />\nlIege<br />\nG. p. Fallon, President<br />\nH. D.<br />\nThe J. H. West, Secretary<br />\nU. Publicity Board—<br />\nW. H. Moore, Jr., Editor-in<br />\n-Chief<br />\nmill(<br />\nDr. Ray Van Orman, Official<br />\n, Censor<br />\n,C°tulon Club-an al'<br />\n.1. B. Powell, President<br />\nW. C. Gardner, Treasurer<br />\n<br />\nAsk Tom Landy to show you the new styles<br />\nin Hess Winter Oxfords and Hosiery. You'll<br />\nfind them in the \"Barn\". As a Hopkins man,<br />\nyou certainly appreciate quality.<br />\n<br />\nThe FEATHERWEIGHT 50c. Of<br />\nlight weight Aluminum. Perfectly<br />\nbalanced for tireless writing. With<br />\nor without eraser.<br />\nThe INGERSOLL<br />\nDOLLAR,Standard Length,51.00<br />\nOf Rolled Silver,<br />\nnot merely bilv,r<br />\nplated.<br />\n<br />\nA New<br />\nCollege<br />\nHelpmate<br />\n<br />\nAn ingenious invention which meets the exacting requirements of college use. Simplified to overcome clogging<br />\nat the point and tedious mechanical manipulation.<br />\nMade economically by mass production methods and sold<br />\nat prices that make wood pencils a luxury.<br />\nIn models to suit every need—at prices to suit your purse.<br />\nNote these Advantages:<br />\n1 Lead guaranteed not to clog at<br />\nthe tip.<br />\n<br />\n4<br />\n<br />\nNew lead inserted in twenty<br />\nseconds.<br />\n<br />\n2 Uses leads about double ordinary<br />\n<br />\n5<br />\n<br />\nLead turns both in and out.<br />\n<br />\nlength.<br />\n<br />\n3 Point presses in<br />\n<br />\n6 Holder can<br />\nfor protection<br />\n<br />\nwhen not in use.<br />\n<br />\naccommodate fifteen<br />\n<br />\nextra leads, equal in writing service to fifteen wood pencils.<br />\n<br />\nYour stationery or cooperative store can show you these and other models.<br />\n<br />\nINGERSOLL REDEPOIINT COMPANY. Inc.<br />\n.WM.H.INGERSOLL,Pres. Formerly of Robt.H.Ingersoll St Bro.<br />\n461 Fourth'Avenue:NewYorx City<br />\n<br />\nBranches— Chisno.St.Paul.Sanaancisce<br />\nto leads - toe<br />\nDouble Length<br />\n<br />\n11111 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br />\n11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111<br />\n1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1il 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br />\n<br />\nHESS<br />\n<br />\nOrganized 1864<br />\n<br />\n8 EAST BALTIMORE STREET<br />\n<br />\nJohn J. Nelligan, President<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LE\"ITER, OCTOBER 10, 1922.<br />\n<br />\n4<br />\n<br />\nMembers closest to scoring at the opening STUDENT ACTIVITIES TO MEET<br />\nCOMPETITION FOR 1923 HUL- previous years it has been the cus- Jazz Band entertaiucd.;<br />\nthe of the third quarter. A short punt<br />\n,Thsclared•<br />\nContinued from Page 2<br />\nLABALOO BOARD ENDS<br />\ntom to put the advertising in the of the freshman cia<br />\n•.<br />\nsnc,great<br />\n,<br />\ndropped ahead of Taylor and the proposition is such a good<br />\nOCTOBER 18<br />\nhands of a professional advertis- reception to have bcen ,•<br />\none<br />\nA meeting of candidates for the ing agency, but this year the staff cess, and to have fubillPfl<br />\nEditorial, Art and Business staffs intends to save money by doing pose admirably.<br />\nof the 1923 Hullabaloo was held all the work itself. This, howat 12.30 last Thursday in the ever, will take more candidates BLACK AND BLUE HELD TO SCORELESS TIE<br />\nBarn. Fenneman, editor-in-chief than have showed up so far.<br />\nfrom page 1)<br />\n(Continued<br />\ntalked<br />\nbook,<br />\nSenior<br />\nclass<br />\nof the<br />\ngame ended a minThe<br />\nto the editorial and art candidates FRESHMAN RECEPTION A GREAT touchback.<br />\nball in Hopkins'<br />\nthe<br />\nwith<br />\nute later<br />\nSUCCESS<br />\nand explained the requirements<br />\nHopkins'<br />\nmidfield.<br />\nin<br />\npossession<br />\n(Continued from page 1)<br />\nfor election to the board. The apthe best<br />\npointment of associate and art ed- He explained that this body controls next chance and perhaps<br />\nHappy Middleton, who<br />\nitors by the editor-in-chief will be the campus organizations and that came when<br />\nstellar game throughout,<br />\nbased strictly on competition. its members award the Hopkins played a<br />\na fumble on the Mounrecovered<br />\nEditorial<br />\nof<br />\nthe<br />\nseal. Don Vanneman spoke<br />\nEach candidate for the<br />\nard line. A fortwenty-y<br />\ntaineers'<br />\nthan<br />\nNEWS-LETTER; '.Dintv\" Moore<br />\nStaff must hand in not later<br />\nMiddleton, was<br />\nto<br />\nBonner<br />\n'ward,<br />\nOctober 18 one two-hundred talked about Hopkins dramatics;<br />\nby<br />\nRuiz. On the<br />\nup<br />\nbroken<br />\nbarely<br />\nword humorous writeup of one Mr. Kelly, concerning the Black and<br />\nanother clean<br />\nBuck<br />\nshot<br />\nplay<br />\nnext<br />\nSenior and one write-up of some Blue Jay; Mr. Sherwood, of the<br />\nunguardwas<br />\nwho<br />\nHappy,<br />\nto<br />\npass<br />\nMusical Club, and Mr. Berry, of<br />\nundergraduate activity.<br />\nbefore<br />\npath<br />\nclear<br />\na<br />\nwith<br />\nand<br />\ned,<br />\nThe organization of the board the HuYaba/oo.<br />\npigskin<br />\nslippery<br />\nthe<br />\nBut<br />\nhim.<br />\nof the 1923 Hullabaloo will be After these various speeches the<br />\nhis grasp and the<br />\nsomewhat different from those of quartette again held forth. A num- dropped from<br />\nover.<br />\nwent<br />\nball<br />\nprevious years. Instead of the ber of cheers and songs were reIn spite of the fact that they did<br />\nusual board of associate editors hearsed and refreshments were<br />\nnot<br />\nhave the ball, St. Mary's came<br />\ndivided<br />\nbe<br />\nUniversity<br />\nwill<br />\nfamous<br />\nend<br />\nthe<br />\nwhile<br />\nserved<br />\neditorial<br />\nthe<br />\nindivid<br />\nas<br />\nsuch<br />\ninto departments<br />\nnal write-ups, athletics, non-athletic activities, fraternities, humor, etc. Over each of these departments will be a specially desiolaqted associate editor. The art<br />\nstaff will consist of an art editor,<br />\nassistant art editor and as many<br />\nmore who show any ability.<br />\nHappy Middleton, 'business<br />\nmanager of the year book, already<br />\nhas a number of candidates working on the advertising end. In<br />\n<br />\nboqi_ced ovc his head when he<br />\ni the tun. He baretried totâ<br />\nfall on the<br />\ntn..(1<br />\nly nianaged to<br />\nball at the same ti.i;e thi'Ll: Captain<br />\nLomond made a (i,--( for it. Jr,:<br />\nstead of punting, the 1-lovkins quarterback called for repeated line<br />\nbucks and off-tackle plays, which<br />\nnetted three first downs. Taylor<br />\ncarried the ball repeatedly and<br />\nmade gains.<br />\n<br />\nI<br />\n<br />\nthat many are expected to fall in<br />\nline and back up the non-athletic<br />\nactivities.<br />\nOn<br />\n<br />\nthe<br />\n<br />\nStudent<br />\n<br />\nBelitd are representatives from<br />\nthe following organizations: Hullabaloo, News-Letter, Black and<br />\n<br />\nBlue Jay, Musical Clubs, DebatHopkins<br />\nMt. St. Mary's ing Council, Dramatic Club, Band<br />\nWoodgie and the Y. M. C. A.<br />\nMiddleton .....L.E.....<br />\nLT<br />\nStephens<br />\n....L.G .Milanusky . . ....H. Morey<br />\nC<br />\nCrosier<br />\nCromwell<br />\n.R.G.......D. Morey<br />\nWalbert . . .<br />\nR T<br />\nLomond<br />\nLandy<br />\nR E<br />\nKelleher<br />\nRich<br />\nRuiz<br />\nWilson<br />\nQB<br />\nBoyle<br />\nLH<br />\nBonner<br />\nRiley<br />\nRH<br />\nTurnbull<br />\nCronin<br />\nFB<br />\nWillis<br />\nSubstitutions: Hopkins—Taylor for<br />\nWilson. Mt. St. Mary's—Hennessey for<br />\nRiley, Fennell for Boyle. Referee—<br />\nPrice, Swarthmore. Umpire—Clinton,<br />\nYale. Head Linesman--Danie!s, Georgetown.<br />\n<br />\nMagill<br />\n<br />\nIt will probably interest the student body to know that the NewsLetter has taken sole possession<br />\nof the office formerly occupied<br />\njointly with the Hullabaloo and<br />\nBlack and Blue Jay. The latter<br />\npublications have their headquarters on the balcony just above the<br />\nNews-Letter office.<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br />\n<br />\nReal Service Must Be Engineered<br />\nbeXatIeriese<br />\nCt<br />\n°AM S H.E., OSCAR G•LE'VNI<br />\nOWN ERS<br />\nl•r4<br />\nklioZ*.<br />\nSt., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\n29 Baltimore<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nJAS.<br />\n<br />\nH. DOWNS<br />\n<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nMany of the men whose names are writ large<br />\nin engineering history are design engineers; men<br />\n<br />\nlike Westinghouse, Lamme, Stanley, Hodgkinson, Tesla, Shallenberger. Their inventions<br />\nhave the quality of usefulness, of reliability, of<br />\nproductability; which is an involved way, perhaps, of saying that they have the primary<br />\nrequisite of all really great inventions:<br />\nServiceability.<br />\n<br />\nEngineering history abounds in instances of<br />\nnear-genius that produced no product, and of<br />\ngreat developments that never reached completion; and most of these instances are explained<br />\nby the lack, somewhere in the system, of that<br />\nability to give real Service.<br />\nService, in a machine or a system, or wherever<br />\nyou find it, is not there by accident but because<br />\nit was incorporated by men who understood<br />\nwhat was required and knew how to provide it.<br />\nMuch more is required of the designer than<br />\nfacility in calculation and mastery of theory.<br />\nHe must have first hand and thorough familiarity<br />\nwith manufacturing operations and with commercial and operating conditions. It takes more<br />\nthan mere ingenuity and inventiveness to design<br />\napparatus that will be really serviceable and<br />\nwill \"stay put.\"<br />\n<br />\nThe design engineer, in the Westinghouse<br />\nplan, is responsible for the performance of the<br />\nfinished product. He cannot possibly have the<br />\nproper understanding of operation unless he operates and tests, unless he spends time and thought<br />\nin investigation and study, not in the laboratory<br />\nor drawing room, but right on the operating<br />\njob. Here, most of his ideas will develop; and<br />\nhere he will see and prepare for all the different<br />\nthings which the product will later have to<br />\nencounter. Then when he comes to put hiQ<br />\ncreations on paper, his calculations will be<br />\nnecessary and helpful to check the conclusions<br />\nwhich he has reached, and this right use of them<br />\nrequires training and a high degree of understanding. This proper balance of the physical<br />\nand mathematical conception of things is what<br />\nconstitutes engineering judgement.<br />\nIt should be thoroughly understood that the<br />\nprimary function of the design engineer is the<br />\nconception and the production of new or improved apparatus, and familiarity with the<br />\npractical is essential to the proper discharge of<br />\nthis duty.<br />\nIt is this view of designing that makes this<br />\nbranch of Westinghouse engineering so important, so effective, and so productive of real<br />\ndevelopments.<br />\n<br />\nlifestinghouse<br />\n44000<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nActivities<br />\n<br />\nACHIEVEMENT8 OPPORTUNITY<br />\n<br />\n\f", "format": "basic_html", "processed": "ds,<br />\ns,<br /><br />\nlor<br /><br />\n'S<br /><br />\nTOL. XXVII. No 3<br /><br />\n+I<br />\n'<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., OCTOBER 10, 1922<br /><br />\n,<br /><br />\n'RESHMAN RECEPTION DECLARED A GREAT<br />\nSUCCESS<br />\n-7irst Year Men Introduced to University Life. Y. M. C. A. Presides,-<br /><br />\nMEN CANDI!<br />\nIYI-ES FOR BLACK AND<br />\n11)<br />\nBLUE CROSS-COUNTRY<br />\nTEAM<br />\nA. I. A. A.<br /><br />\nDRS. LATANE AND WIL- BLACK AND BLUE ELEVEN<br />\nLOUGHBY TO ATTEND<br />\nHELD TO SCORELESS TIE<br />\nBY MOUNTAINEERS<br />\nSOUTH AMERICAN EXDean Latane and Major Garey Address<br />\nPEDITION<br />\nHopkins Gridders Show Flashy Midfield<br />\nFIRST WEEKLY ASSEMBLY<br />\nTURNED OVER TO STUDENT ACTIVITIES<br />\nMeeting.<br /><br />\nUniversity Activities<br /><br />\nHopkins<br /><br />\nMake Extended Visit<br /><br />\nAttack, But Lack Push to Score.<br /><br />\nDean to<br />\nand Middle States Runs<br />\nBrought Before Freshmen.<br />\ntte'plitifrri Fri- S.<br />\nTurnbull and Taylor Star.<br />\nBiggest Events. Mapping a New<br />\nand Tour of Latin-American<br />\nThe<br />\nassemfirst<br />\nweekly<br />\nof<br />\nthe<br />\nday night was a great success.<br />\nCountries.<br />\nCourse for J. H. U. Contemplated.<br />\nthe first home game of the<br />\nIn<br />\nblies to be held throughout the<br />\nThe new students were made to feel<br />\nThe seventeen men who report- year took place last Thursday in<br />\nOn the nineteenth of this 1922 gridiron season and the first<br />\nat home, and even some haughty<br />\ned for the organization of the the lecture-room of the Civil En- month Dr. John H. Latane, dean contest having a direct bearing on<br />\nsophomores condescending to give cross-country<br />\nteam are now en- gineering Building. Dean Latane of the College of Arts and Sci- the state title, the Mt. St. Mary's<br />\nthe lowly freshmen a smile.<br />\ngaged in daily practice over the lamented the fact that an unfor- ences, and Dr:W. W. Willough- eleven held the Black and Blue to<br />\nUpon entering the C. E. Build- University<br />\ncourse. Only four reg- tunate lack of accommodations by, professor of political science, a scoreless tie at Homewood last<br />\ning, each freshman was \"tagged\"<br />\nAmerican Saturday.<br />\nulars of last year's team reported prevented the attendance<br />\nAlthough decisively<br />\nof the will leave on a South<br />\nand introduced by the reception<br />\nfor the initial practice. However, entire undergraduate student trip, the duration of which will be outplayed in every quarter of the<br />\ncommittee to President Goodnow,<br />\nwith over a dozen promising new body. He announced that attend- approximately two and one-half game, the Mountaineers showed at<br />\nDean Latane and Dr. French.<br />\ncandidates, the outlook for a suc- ance at the Thursday assemblies months as they Plan to return to their best when backed up against<br />\nThe reception was opened by<br />\ncessful season is by no means di- would be compulsory for the this country not later than the their own goal line. Repeatedly the<br />\n\"Bill\" Dean, vice-president •of the<br />\ninured. Booth, Cronin, Fenton Sophomores and Freshmen, and first of January.<br />\nsmashing attack of the Hopkins<br />\nHopkins Y. M. C. A. Mr. Dean,<br />\nThe primary object in this trip backfield marched half the length<br />\nand Holzapple are the old men voluntary for the Juniors and Seon behalf of the<br />\nM. C. A., wel- who form a nucleus for the new<br />\nis to attend the Brazilian Centen- of the field only to be thwarted by<br />\nniors.<br />\ncomed the new students and invited<br />\nteam.<br />\nDr. Latane's address consisted nial Exposition which is conven- the dogged defense of the invaders<br />\nthem to enjoy all the privileges of<br />\nThe<br />\n1922<br />\nschedule<br />\nhave,<br />\nwill<br />\nin principally of advice to the Fresh- ing at Rio de Janeiro during the within the shadow of their goal<br />\nthe Y. M. C. A. President Goodposts.<br />\nall<br />\nprobability, four meets, to- men. He reminded them that the winter.<br />\nnow was introduced as the speaker<br />\nDean<br />\nLatane<br />\nhas<br />\ninbeen<br />\nlong<br />\no-ether with the novice run under crowded conditions existing at<br />\nThe fact that the Black- and Blue<br />\nof the evening.<br />\nauspices of the Baltimore Hopkins as well as at other uni- terested in Latin-American his- eleven was able to chalk up fifteen<br />\ntilt,<br />\nDr. Goodnow told the freshmen<br />\ntory and diplomacy and has often<br />\nthat they are now a part of an or- Cross-Country Club as explained versities will soon necessitate wanted to visit South America. first downs to two for the Mounin last week's News-Letter. Two some sort of system of selection.<br />\ntaineers, exclusive of penalties,<br />\nganized community;-which has a<br />\ndUal meets with other colleges and While a selective system suitable Dr. Latane is considered an inter- showed clearly the superiority of<br />\ndefinite purpose to fulfill; that the<br />\ntwo intercollegiate runs are cal- to applicants for admission has national authority on relations the home team. Except in the puntschool was organized for the benewith Latin-America and has writing department, where Cronin refit of the students, and that the culated to give the Black and Blue not been fully developed at Hop- ten an authoritative book<br />\non the peatedly outdistanced Turnbull,<br />\nharriers all that they are willing kins, the \"weeding out process\" is<br />\nthe<br />\nUniversity, to be a success, must<br />\nsubject. He has many friends and<br />\nbe operated through the students. to undertake. The South Atlan- carried on among those who have acquaintances in the South'Ameri- Hopkins machine outplayed the<br />\nMountaineers completely. FlashIn concluding, he welcomed the tic run this fall will be sponsored (rained admission. An individual's can countries and on this trip<br />\nis<br />\nVirginia<br />\nby<br />\nBlacksburg,<br />\nPoly<br />\nat<br />\nacademic<br />\nrecord,<br />\ncollaboration<br />\nin<br />\ning a co-ordinated attack that was<br />\nmen who are entering Hopkins,<br />\nVa. The Middle States meet will with his grade in the intelligence desirous of seeing a large number lacking in the Princeton game, the<br />\nrequesting them to.regard restricof them and learning their views<br />\nBlack and Blue backs repeatedly<br />\ntions and to try to fill their own be given by Lafayette College at test required of all entering stu- on questions of the day.<br />\nEaston,<br />\nPa.<br />\nVerne<br />\nBooth,<br />\ndents,<br />\nwho<br />\nwill<br />\nconstitute<br />\nbasis<br />\nthe<br />\nfor<br />\ntore<br />\nthrough wide gaps opened in<br />\nthe<br />\nparts at<br />\nUniversity.<br />\nDr. Willoughby, who is on a<br />\nwas unable to compete in these deciding whether or not he should<br />\nthe opposing line. Turnbull, in the<br />\nMr. Sherwood, president of the<br />\ntwo runs last year on account of remain a student at Johns Hop- leave of absence extending until first half, and Taylor, in the secStudent Council, was next introthe migratory rule, will this year kins. The Sophomores, too, were January first, has recently re- ond, were the stars on the offenduced. He explained the principal<br />\nbe .able to show his wares and warned against considering them- turned from a four-month trip to sive.<br />\nfunctions of the Student Council.<br />\nSouth Africa, where he was studyMr. Collins, president of Omicron possibly his heels to the rest of selves immune from dismissal. ing existing<br />\nAlthough the Black and Blue<br />\nconditions in that<br />\nWith a few words of general adpelta Kappa Fraternity, followed the intercollegiate harriers.<br />\nshowed<br />\nits superiority from the<br />\npart of the globe.. He had origiCyne of tile new plans now be- ice to flu_ Freshmen, Dean LaMr. Sherwood. He talked of the<br />\nt,<br />\nstai<br />\nthe<br />\npunting of Cronin kept<br />\nnally planned to make an \"roundhonorary fraternities at Hopkins, ing considered by the C. C. team tane concluded his address.<br />\nthe<br />\nball<br />\nout<br />\nof danger for the first<br />\nthe-world<br />\n\" trip, with the particMajor Garey notified the assemand especially of the 0. D. K. In and the Athletic Board is the<br />\nten<br />\nminutes.<br />\nTowards the end of<br />\nular purpose of visiting the Far<br />\norder to become a member of this mapping out of a new course. The bly that the Hopkins R. 0. T. C. East, with which<br />\nthe<br />\nfirst<br />\nperiod<br />\nthe Hopkins team<br />\nhe is in close dip-.<br />\nfraternity, good, earnest work and trouble with the present course of Unit has been dropped from the lomatic relations, but<br />\nstarted<br />\nwhat<br />\nseemed<br />\na certain<br />\nlack of<br />\ninterest in student activities is re- two miles is that it is too smooth War Department's \"Distinguished steamer facilities<br />\nmarch<br />\ndown<br />\nthe<br />\nfield.<br />\nThe<br />\nball was<br />\nthwarted his<br />\nquired. Only the leaders on the and does not have enough hills. List.\" Assuming entire blame for plans.<br />\nworked from past midfield to the<br />\ncampus are eligible to membership. After practicing all fall on a lev- the matter, he urged that all work<br />\nThe professors will leave New fifteen-yard line, when the first<br />\nThe Hopkins Quartette then en- el course the Hopkins men have harder than ever to recover the York on<br />\nthe Santa Elisa, the voy- quarter ended. It was fourth down<br />\ntertained with two selections: The had considerable difficulty in ne- former standing, and to prove age taking them<br />\nthrough the Pan- with four yards to go at the beginUniversity Ode, \"Veritas Vos Lib- gotiating the hilly courses of the that the method of military in- ama Canal, down<br />\nthe west coast ning of the second period, and ,on<br />\nerabit,\" and a negro song entitled, other universities. It is planned struction used at Hopkins is the of South. America,<br />\nmaking vari- the first play Turnbull made only<br />\nto map out a new course which best one. Major Garey's remarks<br />\n\"When I Get to Heaven.\"<br />\nous stops at the larger and more three yards through the line. CronCoach Van Orman next spoke. will be a standard J. H. U. run met with enthusiastic response. important cities<br />\nalong the way, in then kicked out of danger and<br />\nJ. R. Sherwood, president of<br />\nHe warned the freshmen not to and on which a university record<br />\nfinally<br />\narriving<br />\nat Valparaiso, the ball see-sawed for the remainneglect their studies because of ath- may be established. It is hoped the Student Council, announced<br />\nChile.<br />\nThey<br />\nwill then cross the der of the half. During this time<br />\nletics, for, he pointed out, expul- that the course will be decided the Freshman reception, schedAndes<br />\nby rail and will spend two the Hopkins team resorted entirely<br />\nsion from the University for lack upon in time for the first dual uled for Friday night, and reto line bucking. Before the half<br />\nminded the Class of '25 of its weeks in Buenos Ayres. The next<br />\nfmecessai-y -marks renders an ath- meet.<br />\nended<br />\nTaylor went in at half and<br />\npromise to abandon the practice stop will be Montevideo. From<br />\nete useless to Hopkins<br />\nBuck<br />\nBonner<br />\nreplaced Wilson, who<br />\nteams.<br />\n'of holding the Freshman-Sopho- there they will go to Rio to at\"Happy\" Middleton, president of<br />\nstill<br />\nwas<br />\nsuffering<br />\nfrom a wrenched<br />\nTURNBULL LECTURES TO more rush at that time. Mr. Sher- tend the Exposition and will rethe Athletic Association, gave an<br />\nknee,<br />\nat<br />\nquarter.<br />\nBEGIN<br />\nwood also made numerous an- turn home from that point.<br />\nmitline of the work of that organiSoon after the opening of the secDuring Dean Latane's absence<br />\nThe trustees of the Percy Turn- nouncements in regard to other<br />\nzation, and urged that every stuhalf Van Orman's machine<br />\nond<br />\nDr. J. E. Gilpin, professor of<br />\ndent give the teams all possible bull Memorial lectureship an- activities, the variety and extent<br />\nlaunched<br />\na powerful attack that carchemistry, will be acting dean.<br />\nsupport. Verne Booth, captain of nounce that the twenty-fourth of which showed that the univerried<br />\nthe<br />\nball<br />\nto St. Mary's 16-yard<br />\nthe cross country -team, requested course of lectures on this founda- sity activities are in full swing.<br />\nline,<br />\nwhere an attempt to make<br />\ntion will be given by Emile La- Mr. Fallon issued a call for canthat everyone able to do so come<br />\ngonis, D es L, professor of Eng- didates for the News-Letter Staff, VOTE FOR SOPHOMORE first down failed by inches.<br />\nDut for cross-country work. \"Dal\"<br />\nPRESIDENT RESULTS IN<br />\nAgain<br />\nCoach<br />\nDickerman's<br />\nlish Literature in the University and Mr. Collins called for<br />\ncandiKirwan, manager of track, called<br />\ncharges<br />\nTRIPLE<br />\nTIE<br />\ntightened<br />\nTurnbull<br />\nand<br />\nParis,<br />\nthe general subject be- dates for the Black and Blue Jay<br />\nfor candidates for that sport. Tie of<br />\nA<br />\ntriple<br />\ntie<br />\nwas<br />\nfor<br />\nforced<br />\npresident<br />\nto<br />\nof<br />\nthe<br />\nkick.<br />\nMiddleton<br />\nand<br />\ning \"The Poetry of Edmund staff and for the lacrosse team. .<br />\nexplained that it was an opporSophomore<br />\nRich<br />\nClass<br />\nwere<br />\nresulted<br />\ndown<br />\nfrom<br />\nin<br />\na<br />\nflash<br />\nand<br />\nSpenser.\"<br />\nThe assembly ended with a<br />\ntunity \"to see America first.\" John<br />\nthe election of officers held at a tackled the receiver in his tracks.<br />\nlectures<br />\nbe<br />\nwill<br />\nstrenuous<br />\nyell practice.<br />\nThe<br />\ndelivered<br />\nNrurphy, captain of lacrosse, told<br />\nclass meeting last Thursday. Ma- After failing to gain, Cronin at)f the prospects of that particular in English and will be given in<br />\ngill, Turnbull and Kline were the tempted to punt on the third down,<br />\nEngineering MAJOR GAREY ADDRESSES<br />\n;Port for this year, and asked for the hall of the Civil<br />\nmen who held the equal number but Magill broke through and made<br />\nINTERFRATERNITY<br />\nBuilding at 5 o'clock, beginning<br />\narididates for the team.<br />\nof votes. The other offices were a clean tackle before the St. Mary's<br />\nBOARD<br />\nwill<br />\nAt an Interfraternity Board not so closely contested.<br />\nMr. Fallon, president of Student Monday, October 16. They<br />\nman could even get the ball in powill end meeting held last Friday the<br />\nand<br />\npunctually<br />\nbegin<br />\nregPage O'Connor was unani- sition. On the next play, however,<br />\nActivities, was the next speaker.<br />\nwithin the hour. The door will be ulations in regard to the coming mously elected to represent<br />\n(Continued on page 4, col. 2)<br />\nthe he punted; Taylor ran it back 20<br />\nclosed when the lecture begins. \"rushing season\" were gone over, class in the Student Council. Wilyards and Turnbull attempted a<br />\nNOTICE<br />\ninterpreted by the board, and will lis was elected vice-president, M. drop kick from the thirty-five<br />\nDates—<br />\nyard<br />\nMeeting Student Activibe stringently enforced. President Skinner secretary, Towner treas- line. The ball sailed low and was<br />\nMonday, October 16<br />\nties Council at Pi Kappa Chi<br />\nMacaulay, of the board, introduced urer, and Post, sergeant-at-arms. picked up behind the goal line by<br />\nTuesday, October 17<br />\nHouse Thursday at 7.30<br />\nMajor Garey as the speaker of the<br />\nThe meeting was held. with Ruiz, who was tackled when he<br />\nThursday, October 19<br />\nP.M.<br />\nmeeting. He asked the Interfra- some disorder, making it difficult tried to run it out. Thinking it a<br />\nMonday, October 23<br />\nCandidates for News-Letternity Board to help the R. 0. to determine the candidates. The safety, the stands were in an upter Staff report at office<br />\nTuesday, October 24 .<br />\nT. C. in getting the best Fresh- triple tie was voted off at a meet- ,roar, but the referee ruled it a<br />\n12.20 todayThursday, October 26.<br />\nmen to come out for that activity. ing held yesterday.<br />\nContinued on Page 4, col. 3<br />\n-<br /><br />\n,<br /><br />\nSEVENTr<br /><br />\nFTER, OCTOBER 10, 1922<br />\nTHE JOHNS HOPKINS NEWS-LF:<br />\n..UE JAY\"<br />\nEDITOR RECEIVES POEM OF<br />\ntion to F. P. A.'s \"Conning Tow- Pf<br />\n\"BLACK ;I' ND BI<br />\nN FIRsT<br />\nREPENTANCE<br />\nAT WOLK UPO_<br />\ner\" of the \"New York Tribune.\" Jr<br />\nDear Dhity<br />\nISSUE<br />\nFOUNDED 1897.<br />\nWith three-quarters of the \"four spite of such a pretentious name<br />\nTo Appear Latter Part vf Month. Corn. ,<br />\nit is a rollicking bit of verse. Be<br />\n•.)<br />\n.of college\" behind<br />\npetition Started Among Ce..ndiSubscription<br />\n$2.00<br />\n)r<br />\ncause<br />\nof its moral it belongs in th<br />\ndates for Staff.<br />\nwith the- Tollzation that<br />\nni ,<br />\nat<br />\nsedate News-Letter, and not th<br />\nAt a meeting of the literary staff<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nof the \"Black and Blue Jay\" last I have squandered much iirne at irreverent \"Black and Blue Jay. rui<br />\nthe Barn and on the campus<br />\nAlth<br />\nPublished semi-weekly from October to June by the students of Johns Wednesday plans for the first<br />\nii.written about life<br />\nHopkins University.<br />\nnumber of the Hopkins humorous should have been spent in the sole<br />\nher<br />\niollegeit recalls in man<br />\nmonthly were completed. The is- occupation of pursuing knowl- a<br />\n•<br />\n•<br />\nBusiness communications should be addressed to the BUSINESS MANways<br />\nraduate<br />\nexistence a<br />\nsue<br />\nis<br />\nto<br />\nbe<br />\ncalled<br />\nthe<br />\n\"RenaisAGER, JOHN HOPKINS UNIVERSITY; all articles and other communications<br />\nedge, I believe that I am best fitits<br />\nshould be sent to the MANAGING EDITOR.<br />\nHumewood.<br />\nsance\" or \"Revival of Learning\"<br />\nUr<br />\nted to deliver a sermon to the<br />\nTake heed, ye members of th ag,<br />\nHomewood 100 number, and will be out in the latTelephone<br />\nFrosh<br />\non<br />\nthe<br />\n\"Iniquities of Idleter part of October. Jokes about<br />\nclass of 1926, before it is too lat<br />\ncot<br />\nthe \"revival of learning\" (the re- ness.\" I have dug up a poem by<br />\nBut, of course, you won't.<br />\nGc<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nturn to college) and seasonable another sinner who repents of the<br />\ntre<br />\nBenny.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nremarks upon the harassed error of his ways at an unnamed<br />\nGLOVER P. FALLON, '23.<br />\nAl:<br />\n\"freshies\" will comprise the great- Alma Mater some number of<br />\nManaging Editor:<br />\ncal<br />\nJ. HUDSON HUFFARD, '23.<br />\ner part of the magazine.<br />\nRa<br />\nyears ago.<br />\nAdvertising Manager:<br />\nMore material is needed to inAssistant Managing Editor:<br />\n\"Our second baseman woul MI<br />\nDONALD K. VANNEMAN,'23.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nsure the success of the first issue. This poem,\"Haec Ohm MemiNc<br />\nContributions, preferably, but not nisse Iuvabit\" (whatever that make an excellent swimmer.\"<br />\nAssociate Editors:<br />\nag(<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nnecessarily, along the lines men- means) in 1916 was awarded first \"Why so?\"<br />\ntioned<br />\nabove, are wanted. All prize as being the best contribu- \"Oh, he strikes out so boldly.<br />\nManagers:<br />\nBusiness<br />\nAssistant<br />\nJunior Editors:<br />\nsta<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\ncopy for this number must be suba<br />\nFITZGERALD DUNNING, '24.<br />\nT. REESE MARSH, '24.<br />\nmitted by noon on Tuesday, OcT. CLYDE ROUTSON, '23.<br />\nPHILIP W. HOWARD, '25.<br />\ndez<br />\nHAEC OLIM MEMINISSE IUVABIT<br />\nR. C. TILGHMAN, '25.<br />\nMILES D. MARRIAN, '25.<br />\ntober 10.<br />\nme<br />\nWILLIAM G. DEAN, '24.<br />\nG. DONALD GIESKE, '25.<br />\nBy Deems Taylor<br />\nThe meeting on Wednesday<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nbet<br />\nBENJAMIN T. ROME, '25.<br />\nplanned also for competition Oh, back in the fall of 1902, when I was a freshman green,<br />\nstu<br />\namong the students who are can- I planned to be one of the cuWu—red few, with a high and beetling beat ag(<br />\ndidates for the literary staff. As<br />\nSo I took on Latin, and German 4,<br />\ncot<br />\nthe<br />\nresult a contest in the gatherAssociation.<br />\n• Member of Southern Intercollegiate Newspaper<br />\nFrench, History 5 (to the Civil War),<br />\ning of material was started at a<br />\nTrig ,Algebra 1-7a ghastly bore<br />\ntin(<br />\nmeeting of the candidates held<br />\n—and Freshman chemistree ;<br />\nCit<br />\nlast Friday and will continue until Here, then, are the facts I still retain from 1902<br />\n\"is,<br />\nand three:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. December 1. Appointments to the We won the<br />\n\"bloody Monday\" fight, and made the Sophs retire,<br />\nran<br />\nstaff will then be made. Credit Dear Lehigh licked the<br />\nty<br />\nfootball team by a score that was somethirq<br />\nwill be given not only for matedire,<br />\nfirlZ<br />\nrial that is printed, but also for<br />\nBALTIMORE, MD., OCTOBER 10, 1922<br />\nBill came on from Chicago U.<br />\nfun<br />\nall work submitted that is worthy<br />\nWith some bar-room stories—and good ones, too;<br />\nof being printed. For example, a I got on the glee club, and made Psi U, and sang in<br />\nWORTH YOUR TIME<br />\nthe chapel choir<br />\nWH<br />\nAfter the Y. M. C. A. reception, Friday night, the average fresh- contestant may hand in material<br />\nman probably found himself in a quandry as to what activity he should which, while not suitable for any As a Sophomore, I am proud to state, I was taking the hurdles clear<br />\nchoose. There may have been a few who sought eagerly for some of the early numbers, may be of I dreamed of copping the old Phi Bete by the end of my Junior year<br />\nactivity with slight demand as an outlet for Freshman Regulation Num- use in later issues. By this arI soaked up Logic, and Physics 3,<br />\nber One, but we hope, and believe, that the greater number gave an rangement the various candidates<br />\nFrench Lit. (I was there with the loud oui, oui !),<br />\nPsychology, Shakespeare, Verse--ilitihonest study to the matter, in hopes of selecting a branch in which they will derive full benefit from their<br />\nefforts. Since the success of the<br />\nmight eventually rise to the top.<br />\n-and a couple of courset more,<br />\ncontest<br />\nwill be extremely- helpful Here's what I recall as I look back on<br />\nEvery, activity on the campus has its individual merits, but we<br />\n1903 and four: •<br />\nbelieve that the NEWS-LETTER offers the Freshman more 'for his work to the \"Black and Blue Jay\", all Weary chairmaned the Junior prom (his girl<br />\ns Harriet White).<br />\nthan any other. In competing for the editorial staff of this publica- students are urged to give their I played third quarter on the football scrub, while Loup played cen Base<br />\ntime and interest to the affair.<br />\nter and right.<br />\ntion, the candidate not only absolves the above-mentioned Regulation<br />\nSeveral changes in the staff<br />\nJoe Bauderman ran a record mile,<br />\nNumber One Requirement, but accomplishes a great deal for his own<br />\nLact<br />\nhave been made. Joseph A. Moran<br />\nThe baseball team was perfectly vile (3)<br />\npersonal benefit.<br />\nresigned<br />\nhis<br />\nposition<br />\nas<br />\nliterary I made the track team after a while, and fussed (4) each Saturda;<br />\nFirst of all, the inexperienced writer gains in his journalistic praceditor because he did not have suftheoretical<br />\nnight<br />\nTrac<br />\ntice a great deal more than he could possibly derive from a<br />\nficient time to devote to the work.<br />\ncourse in the same subject and obtains- a knowledge that will ever be<br />\nP. L. Ives, former managing edi- By Junior year<br />\nI had laid away those hopes of a Phi Bete key,<br />\nan asset.<br />\ntor, was elected literary editor, But I toyed with the<br />\nthought of a proud M.A. and a possible Ph.r Croi<br />\n• In the second place, those who show their superiority will be given<br />\nand Parker C. Williams, former<br />\nSo I grabbed off Plato, and Kant, and such,<br />\na place upon the staff and a consequent position in student affairs.<br />\nexchange editor, was elected manChurch History, Banking (the worldly touch!),<br />\nAnd last, but not least, those who seek honors, automatically beSwin<br />\naging editor. Edward A. Kent and<br />\nThe German bards—whom we termed \"them Dutch\"<br />\ncome candidates for the Hollander Prize, an award of twenty-five dolJulian D. Tebo, junior associate<br />\n—such French as I might contrive;<br />\nlars in gold, presented annually by Professor Jacob Hollander, of the editors,<br />\nTeni<br />\nalso have resigned, the And the following info,<br />\nstill adheres from 1904 and five:<br />\nDepartment of Economics of this University, in the interest of college former<br />\nbecause he left school and Tom Reilley's team smeared<br />\nR. P. I. to the tune of a large amount (5<br />\njournalism. This prize is awarded at the class-day exercises of the grad- the<br />\nRifle<br />\nlatter because of a lack of I made the gym and the<br />\ntrack<br />\nteams both; they ducked young Blut<br />\nweek.<br />\nJune<br />\nuating class during<br />\ntime necessary for the work.<br />\n(6) in the fount;<br />\nCandidates will be enrolled at any staff meeting Tuesday or Friday, at<br />\nStu,,<br />\nThe glee club trip was a Lakewood treat,<br />\n12:20, in the NEWS-LETTER office in the Barn.<br />\nY. 1,<br />\nThe baseball team got badly beat (7),<br />\nSTUDENT ACTIVITIES COUN- And I got third at the Wesleyan meet (8),—but third place didne<br />\nWANTED<br />\nNeal<br />\nCIL TO MEET<br />\ncount.<br />\nDespite the closeness of the score in Saturday's game, a vast imA meeting of the Student Acprovement over the previous week was noticed in the team-work of the<br />\ntivities<br />\nCouncil will be held on A Senior now, I was bald and grey with the studious life I'd led, akti<br />\nVarsity football machine. The resulting figures are probably the best<br />\nthing that could have happened to the team. Hopkins' position in the Thursday evening, October 12, at But proud of the knowledge stowed away in my small but well forme<br />\nhead.<br />\nstate championship race is not menaced, yet the team realizes that it the Pi Kappa Chi House. Since<br />\nHuR<br />\nthe founding of the Council weekI killed International (so-called) Law,<br />\nhas much to accomplish ,to hold the title.<br />\nTook Spanish and Chaucer (the latter's raw),<br />\nIn the case of Saturday's game, figures mean nothing. The visitors ly meetings have been held at the<br />\nWound up with a thesis on Bernard Shaw,<br />\nwere outrushed by 15 first downs to 2. Last year Hopkins made 6 first Barn, but due to the usual dinner<br />\nInter<br />\ntime<br />\nconfusion<br />\n—how much of that stuff still sticks?<br />\nand<br />\nconflict<br />\nof<br />\nWith<br />\nthe<br />\nscore.<br />\nthe<br />\ngreat<br />\nby<br />\nwinning<br />\na<br />\nMountaineers'<br />\n3-2<br />\nto<br />\ndown<br />\n5,<br />\nimprovement this year in rushing, the best verdict the Black and Blue meetings a full attendance was Well, here is the dope I recollect from 1905 and six:<br />\nDran<br />\nrare. This year meetings will be Bill and I wrote the Senior show (his book was a mere detail),<br />\ncould obtain was a 0-0 tie.<br />\nheld in the evening and monthly And Loup played \"Elsie, the Cannibal Queen,\" and looked like a half<br />\nThe answer lies in the fact that our team lacks experienced geninstead<br />\nof weekly as heretofore.<br />\nDeba<br />\ndressed whale;<br />\neralship and a finished booter.<br />\nLa<br />\nIt<br />\nis<br />\nplanned<br />\nto<br />\nSenior<br />\nThe<br />\nhold<br />\nthe<br />\nball<br />\ndream<br />\nwas<br />\na<br />\ndivine<br />\n(9),<br />\nmeetings<br />\nCoach Van Orman has overcome a number of obstacles in the last<br />\nat the different fraternity houses<br />\nMusi;<br />\nThe Senior banquet was mostly wine,<br />\ntwo years, has developed a number of grid stars, and has done wonders<br />\nand<br />\nto<br />\nmake<br />\nP.<br />\nAnd<br />\nA.<br />\nF.<br />\nran<br />\na<br />\nattendance<br />\nmine<br />\npiece<br />\nof<br />\nin<br />\nthe<br />\nof<br />\nNew<br />\nYork<br />\nevery<br />\nEvening<br />\nMail.<br />\nwith his material thus far this season. The first of the above shortUncle<br />\n1. 46-0, if you must know.<br />\ncomings can be improved by drilling, but the development of a good member compulsory.<br />\nAt<br />\nthe<br />\nfirst<br />\n2.<br />\nAnd<br />\nmeeting<br />\nmaybe<br />\nhe<br />\nwasn't<br />\nstuck on her.<br />\nthis ThursThe j<br />\npunter and drop kicker takes time and requires a certain amount of<br />\nday the Council will organize for<br />\n3. As usual.<br />\natlent.<br />\nthe year. The main business be4. Some girl, too. She married shortly after that.<br />\nIn this school of 800 students there must be some such talented and<br />\nfore<br />\nit<br />\nat<br />\nthe<br />\npresent<br />\n5. 53--0, no less.<br />\ntime<br />\nis<br />\nthe<br />\ncomes<br />\nout<br />\nwho<br />\nman<br />\nfor<br />\nEvery<br />\nthe<br />\nteam strengthens<br />\nexperienced man.<br />\nStud,<br />\napportionment<br />\nof<br />\n6.<br />\nI'm not sure of the name. He was going to sue the college<br />\nthe<br />\n,<br />\nStudent<br />\nAcper<br />\nseven<br />\ncent.<br />\nHopkins' championship chances by<br />\ntivities<br />\nFee<br />\namong<br />\nsomething,<br />\nthe<br />\nor<br />\nbut<br />\ndidn't.<br />\nvarious<br />\nAccording to the support given our rivals of the Severn, four hun\"the<br />\nactivities. Plans will also be form7. See note 3.<br />\ndred men should be cavorting about Homewood Field every day.<br />\nulated for getting scholarship men<br />\n8. The track up there is so narrow that only three of us coult.<br />\nJust give the coach a chance and he'll give you yours.<br />\nto<br />\npay<br />\nthe<br />\nactivities<br />\nrun.<br />\nfee.<br />\nCowl<br />\nWhile<br />\nTHE NEWS-LETTER regrets to announce the resignation of T. Clyde<br />\nthey are not required to do this,<br />\nI<br />\ntook<br />\n9.<br />\nAdele<br />\nMartin,<br />\na<br />\nqueen.<br />\nmarried<br />\nShe<br />\nBill<br />\nWildman<br />\nal'<br />\nRoutson, '23, and G. Cochran Doub, '23, from the Editorial Staff.<br />\nContinuod on Page 4, col. 5.<br />\nmost immediately afterward.<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nTHE JOHNS HOPKINS l\\,<br />\nTEWS-LETTER, OCTOBER 10, 1922.<br /><br />\n:hoit<br /><br />\nPRESIDENT GOODNOW AP- JUNIOR CLASS NOMINATES<br />\nOFFICERS<br />\nPOINTED ON ATHLETIC<br />\n•<br />\nCOMMITTEE<br />\nMANUF ACTURING JEWELERS<br />\nAt - meeting held last ThursLancaster, Pa.<br />\nThe president of the University, day the Junior Class made -On iolClass Rings, Pins, Fraternity Pins,<br />\nJr. Goodnow, has 1ieen appointed lowing nominati tis for<br />\nCups, Medals, Etc.<br />\nclass offi- Stationery,<br />\nInvitations, Programmes<br />\na member of the temporary com- cers:<br />\n\"Makers of the Varsity Seals\"<br />\nmittee which is in control of Hopresident—Booth, Coady, Bon- STRATTON<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nkins athletics. This committet- ner, G. M. Shriven<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n(loes the 'vork of the Homey:Ood<br />\n$3.25 and $4.25<br />\nVice-president—Shaeffer, Ken- Negligee<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nCompany', w<br />\nv ed of nedy, Alfriend, Jenifer.<br />\nTerms Cash, Less 10% 30 Days on<br />\nShirts<br />\nits own volition in order to let the<br />\nSecretary — Mount, Gardner,<br />\nAlso a Full Line of Men's<br />\nUniversity have the direct manFurnishings<br />\nMarsh.<br />\nagement of athletics. The present<br />\ncommittee is composed of Dr. Treasurer -- Dunning, DeavGoodnow, Air. Graham Boyce, ours, Ashton, G. M. Shriver, CroA suit by Lemmert gives the final<br />\ntreasurer of the University; Dr. ker.<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\nAbercrombie, director of physiSergeant-at-Arms — Limbach.<br />\ncloths cut in authentic fashion—<br />\ncal education; Mr. Blanchard<br />\nwhether for every-day wear or more<br />\nMarino, Barton, Eagle, Trovel, J.<br />\nfestive occasions.<br />\nRandall, .Jr., Dr. D. G. Stewart,'<br />\nMr. Robertson Griswold and Mr. V. B. Shriver, Rector, Hamburgat<br />\nLEMMERT<br />\nNorman C. Keyes, graduate man- er, Packard, Wilgis.<br />\n19<br />\nFayette<br />\nStreet, East<br />\nager of athletics.<br />\nThis committee is of temporary<br />\nBusiness Suits<br />\nDress Clothes<br />\nstanding pending the formation of COTILLON BOARD HOLDS<br />\nOvercoats<br />\nSport Togs<br />\na permanent committee. The<br />\nELECTION<br />\ndean of the academic school, two<br />\nW. Carville Gardner was elected<br />\nMt. Vernon 4999<br />\nmembers of the faculty, two mem- president of the Cotillon Club at<br />\nbers of the board of trustees, two a meeting held on Friday.<br />\nThis<br />\nstudents and the graduate man- election<br />\nwas held to fill the place<br />\nager will form the permanent left vacant by the withdrawal<br />\nCommercial Photography<br />\ncommittee.<br />\nfrom the university' of J. BrentCircuit Photography<br />\nThis committee will continue nall Powell. Gardner was forFlash<br />\nLights<br />\nViews<br />\nunder the counsel of the Varsity merly secretary and treasurer, his<br />\nGroups<br />\nEnlargem<br />\nents<br />\nClub just as that organization ad- former position being filled by<br />\nKODAK<br />\nvised the Homewood Co. Ar- Clarence Adams.<br />\nFINISHING<br />\n325 N. Howard St.<br />\nrangement of schedules, eligibiliThe Cotillon Club will hold a<br />\nty of players and management of<br />\ndance after each football game.<br />\nfinances will form the duties and The cotillons have not been<br />\ndef=unctions of the committee.<br />\ninitely decided upon as to date<br />\nincl place.<br />\nSARATOG<br /><br />\ncleat<br />\nyew-<br /><br />\nWHO'S WHO IN THE UNIVERSITY<br />\n1922-1923<br />\nAthletic Director<br />\nRay Van Orman<br /><br />\nCAV-<br /><br />\nme<br />\nBe<br />\nth<br />\nthe.<br />\na(<br />\nany:<br />\n2 at<br />\nI<br />\nthe<br />\nlate<br /><br />\nDUI(<br />\n'<br /><br />\n:Hy.<br /><br />\nJ. F. Apple Co<br /><br />\nFine Clothes<br /><br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\nWARNER &amp; COMPANY<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br /><br />\n111111111111111111111111111111111111<br />\n1,1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br />\n111111 1111111111111111111111111111111111 1 1 1 ' 1 1<br /><br />\n1111111 1111111111111111111111111111 11111111111111111111111111111<br />\n1 1 1 1 1 1 1 1 1 1 1111111111111111111111111111 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 !'<br />\n1 1 1 1 11111 1 1 1 1 1I 1 1 1 1 IIIIDD1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1! !'<br /><br />\nThe INGERSOLL<br />\nDOLLAR. Pony<br />\nLength $1.00. Of<br />\nRolled Silver with<br />\nring for chain or<br />\nribbon.<br />\nThe JUNIOR 50c<br />\nto $2.00. An attractive little pencil in Nickel,Silver<br />\nor Gold, with ring<br />\nfor chain or<br />\nribbon.<br /><br />\nW.L. Mann<br /><br />\nbea<br /><br />\ne,<br />\nthin<br />\n•<br /><br />\nA AT<br /><br />\nLIBERTY STS.<br />\nA FRESHMAN PROTESTS<br /><br />\nLUNCHEON<br /><br />\nTEA<br />\nEditor of the News-Letter.<br />\nDINNER<br />\nDear Sir:<br />\nAs a Freshman who has just unSPECIAL PARTIES<br />\nAthletic Association—<br />\ndergone his first baptism of fire 11.30 A. M.<br />\ns. A. Middleton, ?resident<br />\nin the form of an intelligence test<br />\nuntil<br />\nT. M. Landy, Captain<br />\nPLAZA 6987<br />\nI feel most divinely inspired to 7.30 P. M.<br />\nG. C. Hardy, Jr., Manager<br />\n,) (2,<br />\nRay Van Orman (Cornell), Coach come to<br />\nthe defense of the pracI cell Baseball—<br />\ntice of giving them to such innoH. W. Grace, Captain<br />\nHOPKINS SCHOLARSHIP<br />\nD. K. Vannernan, Manager<br />\ncent and long-suffering freshies.<br />\nRESULTS ANNOUNCED<br />\nCoach<br />\nit is true, of course, that these<br />\nLacrosse..<br />\n—<br />\nThe results of the examinations<br />\nJ.<br />\nJ• N. Murphy, Captain<br />\ntests are still in their infancy, and held on F- riday, September 22, for<br />\n0. D. Collins, Manager<br />\n[mkt,<br />\nalthough they probably spot im- the Hopkins scholarships for<br />\nJ. M. Knipp (J. H. U.), Coach<br />\nTrack<br />\nbeciles pretty accurately, it is Freshmen entering the College of<br />\nE. Z. Aaronson; Captain<br />\n'doubtful whether their superiors Arts and Sciences have been anJ. N. Kirwan, Manager<br />\nJ. M. LeCato, Coach<br />\nare correctly classified. However, nounced. The five successful canCross-Country—<br />\n•unless such far-sighted universi- didates were:<br />\nV. H. Booth, Captain<br />\nG. V. B. Shriver, Manager<br />\nties as ours are willing to do a lot<br />\nAllan L. Grafflin<br />\nJ. M. LeCato, Coach<br />\nof tedious experimenting with<br />\nSwimming......<br />\nErnest A. Strathman<br />\nC. P. Coady, Jr.,<br />\nCaptain<br />\nthem the great rewards of their<br />\nMorton T. Sonneborn<br />\nP. Buhrer, Manager<br />\nTennis......<br />\nultimate perfection will never be<br />\nHugh J. .fewett, Jr.<br />\nJeanHoffmeister, Captain and<br />\nrealized.<br />\nNorris M. Hardesty.<br />\nManager<br />\nit (5 Rifle<br />\nTeam—<br />\nIt<br />\nThe<br />\nseems,<br />\nthree leading men are from<br />\n.neverthel<br />\ness,<br />\nthat<br />\nMut<br />\nG. M. Ruoff, Captain<br />\namong<br />\nCity<br />\ncertain<br />\nCollege<br />\nbackward<br />\nand the other two<br />\n-looking<br />\ntrks, Manager<br />\nStu,s<br />\ncircles, the aforementioned tests from Harford county.<br />\n:ouncil—<br />\n. Sherwood, President<br />\ny. 1( t<br />\nare regarded with an unseemly<br />\nA.iSt<br />\n3. Stevens, President<br />\nand<br />\nnot to say malicious levity. LAFAYETTE ABOLISHES CORPORclidn<br />\nAL PUNISHMENT<br />\nJ. Wyckoff, General<br />\nSecretary Such an attitude of mind, as I see<br />\nNeal F<br />\nLafayette College has followed<br />\ntter—<br />\n. H. Moore, Jr., Editor-in-Chief it, is wholly stupid and inappro- Swarthmore in the abolition<br />\nof<br />\n.. P. Fallon, Business Manager<br />\npriate. In fact, would like most corporal punishment in the hazing<br />\n''<br />\n'<br />\naelt and Blue Jay—<br />\nLawrence B. Fenneman, Editor- meekly to suggest (acutely bear- of Freshmen. In the chapel ex)rine,<br />\nin-Chief.<br />\ning in mind my humble position :ercises on September 27 the unC'• D. Collins, Business Manager<br />\nin this institution of learning), dergraduate body unanimously acHullabaloo<br />\nLawrence B. Fenneman, Editor- that those who think the<br />\npsycho- cepted the student council's rein-Chief<br />\nS. Atherton<br />\nMiddleton, Business logical tests a joke should not be port which prevents paddling and<br />\nManager.<br />\ncompelled to take them, but \"razzing\" of Freshmen off the<br />\nInterfraternity Board—<br />\nP. Stewart<br />\nshould<br />\nbe simply and accurately campus. The new rule will be<br />\nMacaulay, President<br />\nP. Buhrer, Secretary<br />\nclassified<br />\nas morons, thus saving rigidly enforced. The practice of<br />\nDramatic<br />\nClub—<br />\ntime,<br />\nmuch<br />\nlabor and printer's ink 'hazing in such a fashion has been<br />\nH<br />\nW<br />\n:<br />\nMoore, Jr., President<br />\nhalf<br />\nP. West, Manager<br />\ntrying<br />\nin<br />\nto<br />\nprove a foregone con- strongly denounced throughout<br />\nDebating Council—<br />\nLawrence B. Fenneman, President clusion.<br />\nthe campus by the leaders in colJ. E. Mount, Secretary<br />\nClass of '26. lege affairs.—Phoenix.<br />\nMusical Club—<br />\nJ. R. Sherwood, President<br />\n[ail.<br />\nD. K.<br />\nGraduate Manager<br />\nNorman C. Keyes<br /><br />\nVanneman, Manager<br />\nU ndergraduate Orchestra<br />\n—<br />\nJ• L. Simonovitz, Leader<br />\nThe Band—<br />\nF. E. Campbell, Leader<br />\n‘-hnicron Delta Kappa0. D. Collins, President<br />\nW. H. Moore, Jr., Secretary<br />\nStudent Activitie<br />\ns Council—<br />\nlIege<br />\nG. p. Fallon, President<br />\nH. D.<br />\nThe J. H. West, Secretary<br />\nU. Publicity Board—<br />\nW. H. Moore, Jr., Editor-in<br />\n-Chief<br />\nmill(<br />\nDr. Ray Van Orman, Official<br />\n, Censor<br />\n,C°tulon Club-an al'<br />\n.1. B. Powell, President<br />\nW. C. Gardner, Treasurer<br /><br />\nAsk Tom Landy to show you the new styles<br />\nin Hess Winter Oxfords and Hosiery. You'll<br />\nfind them in the \"Barn\". As a Hopkins man,<br />\nyou certainly appreciate quality.<br /><br />\nThe FEATHERWEIGHT 50c. Of<br />\nlight weight Aluminum. Perfectly<br />\nbalanced for tireless writing. With<br />\nor without eraser.<br />\nThe INGERSOLL<br />\nDOLLAR,Standard Length,51.00<br />\nOf Rolled Silver,<br />\nnot merely bilv,r<br />\nplated.<br /><br />\nA New<br />\nCollege<br />\nHelpmate<br /><br />\nAn ingenious invention which meets the exacting requirements of college use. Simplified to overcome clogging<br />\nat the point and tedious mechanical manipulation.<br />\nMade economically by mass production methods and sold<br />\nat prices that make wood pencils a luxury.<br />\nIn models to suit every need—at prices to suit your purse.<br />\nNote these Advantages:<br />\n1 Lead guaranteed not to clog at<br />\nthe tip.<br /><br />\n4<br /><br />\nNew lead inserted in twenty<br />\nseconds.<br /><br />\n2 Uses leads about double ordinary<br /><br />\n5<br /><br />\nLead turns both in and out.<br /><br />\nlength.<br /><br />\n3 Point presses in<br /><br />\n6 Holder can<br />\nfor protection<br /><br />\nwhen not in use.<br /><br />\naccommodate fifteen<br /><br />\nextra leads, equal in writing service to fifteen wood pencils.<br /><br />\nYour stationery or cooperative store can show you these and other models.<br /><br />\nINGERSOLL REDEPOIINT COMPANY. Inc.<br />\n.WM.H.INGERSOLL,Pres. Formerly of Robt.H.Ingersoll St Bro.<br />\n461 Fourth'Avenue:NewYorx City<br /><br />\nBranches— Chisno.St.Paul.Sanaancisce<br />\nto leads - toe<br />\nDouble Length<br /><br />\n11111 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br />\n11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111<br />\n1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1il 1 1 1 1 1 1 1 1 1 1 1 1 1 1<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br /><br />\nHESS<br /><br />\nOrganized 1864<br /><br />\n8 EAST BALTIMORE STREET<br /><br />\nJohn J. Nelligan, President<br /><br />\nTHE JOHNS HOPKINS NEWS-LE\"ITER, OCTOBER 10, 1922.<br /><br />\n4<br /><br />\nMembers closest to scoring at the opening STUDENT ACTIVITIES TO MEET<br />\nCOMPETITION FOR 1923 HUL- previous years it has been the cus- Jazz Band entertaiucd.;<br />\nthe of the third quarter. A short punt<br />\n,Thsclared•<br />\nContinued from Page 2<br />\nLABALOO BOARD ENDS<br />\ntom to put the advertising in the of the freshman cia<br />\n•.<br />\nsnc,great<br />\n,<br />\ndropped ahead of Taylor and the proposition is such a good<br />\nOCTOBER 18<br />\nhands of a professional advertis- reception to have bcen ,•<br />\none<br />\nA meeting of candidates for the ing agency, but this year the staff cess, and to have fubillPfl<br />\nEditorial, Art and Business staffs intends to save money by doing pose admirably.<br />\nof the 1923 Hullabaloo was held all the work itself. This, howat 12.30 last Thursday in the ever, will take more candidates BLACK AND BLUE HELD TO SCORELESS TIE<br />\nBarn. Fenneman, editor-in-chief than have showed up so far.<br />\nfrom page 1)<br />\n(Continued<br />\ntalked<br />\nbook,<br />\nSenior<br />\nclass<br />\nof the<br />\ngame ended a minThe<br />\nto the editorial and art candidates FRESHMAN RECEPTION A GREAT touchback.<br />\nball in Hopkins'<br />\nthe<br />\nwith<br />\nute later<br />\nSUCCESS<br />\nand explained the requirements<br />\nHopkins'<br />\nmidfield.<br />\nin<br />\npossession<br />\n(Continued from page 1)<br />\nfor election to the board. The apthe best<br />\npointment of associate and art ed- He explained that this body controls next chance and perhaps<br />\nHappy Middleton, who<br />\nitors by the editor-in-chief will be the campus organizations and that came when<br />\nstellar game throughout,<br />\nbased strictly on competition. its members award the Hopkins played a<br />\na fumble on the Mounrecovered<br />\nEditorial<br />\nof<br />\nthe<br />\nseal. Don Vanneman spoke<br />\nEach candidate for the<br />\nard line. A fortwenty-y<br />\ntaineers'<br />\nthan<br />\nNEWS-LETTER; '.Dintv\" Moore<br />\nStaff must hand in not later<br />\nMiddleton, was<br />\nto<br />\nBonner<br />\n'ward,<br />\nOctober 18 one two-hundred talked about Hopkins dramatics;<br />\nby<br />\nRuiz. On the<br />\nup<br />\nbroken<br />\nbarely<br />\nword humorous writeup of one Mr. Kelly, concerning the Black and<br />\nanother clean<br />\nBuck<br />\nshot<br />\nplay<br />\nnext<br />\nSenior and one write-up of some Blue Jay; Mr. Sherwood, of the<br />\nunguardwas<br />\nwho<br />\nHappy,<br />\nto<br />\npass<br />\nMusical Club, and Mr. Berry, of<br />\nundergraduate activity.<br />\nbefore<br />\npath<br />\nclear<br />\na<br />\nwith<br />\nand<br />\ned,<br />\nThe organization of the board the HuYaba/oo.<br />\npigskin<br />\nslippery<br />\nthe<br />\nBut<br />\nhim.<br />\nof the 1923 Hullabaloo will be After these various speeches the<br />\nhis grasp and the<br />\nsomewhat different from those of quartette again held forth. A num- dropped from<br />\nover.<br />\nwent<br />\nball<br />\nprevious years. Instead of the ber of cheers and songs were reIn spite of the fact that they did<br />\nusual board of associate editors hearsed and refreshments were<br />\nnot<br />\nhave the ball, St. Mary's came<br />\ndivided<br />\nbe<br />\nUniversity<br />\nwill<br />\nfamous<br />\nend<br />\nthe<br />\nwhile<br />\nserved<br />\neditorial<br />\nthe<br />\nindivid<br />\nas<br />\nsuch<br />\ninto departments<br />\nnal write-ups, athletics, non-athletic activities, fraternities, humor, etc. Over each of these departments will be a specially desiolaqted associate editor. The art<br />\nstaff will consist of an art editor,<br />\nassistant art editor and as many<br />\nmore who show any ability.<br />\nHappy Middleton, 'business<br />\nmanager of the year book, already<br />\nhas a number of candidates working on the advertising end. In<br /><br />\nboqi_ced ovc his head when he<br />\ni the tun. He baretried totâ<br />\nfall on the<br />\ntn..(1<br />\nly nianaged to<br />\nball at the same ti.i;e thi'Ll: Captain<br />\nLomond made a (i,--( for it. Jr,:<br />\nstead of punting, the 1-lovkins quarterback called for repeated line<br />\nbucks and off-tackle plays, which<br />\nnetted three first downs. Taylor<br />\ncarried the ball repeatedly and<br />\nmade gains.<br /><br />\nI<br /><br />\nthat many are expected to fall in<br />\nline and back up the non-athletic<br />\nactivities.<br />\nOn<br /><br />\nthe<br /><br />\nStudent<br /><br />\nBelitd are representatives from<br />\nthe following organizations: Hullabaloo, News-Letter, Black and<br /><br />\nBlue Jay, Musical Clubs, DebatHopkins<br />\nMt. St. Mary's ing Council, Dramatic Club, Band<br />\nWoodgie and the Y. M. C. A.<br />\nMiddleton .....L.E.....<br />\nLT<br />\nStephens<br />\n....L.G .Milanusky . . ....H. Morey<br />\nC<br />\nCrosier<br />\nCromwell<br />\n.R.G.......D. Morey<br />\nWalbert . . .<br />\nR T<br />\nLomond<br />\nLandy<br />\nR E<br />\nKelleher<br />\nRich<br />\nRuiz<br />\nWilson<br />\nQB<br />\nBoyle<br />\nLH<br />\nBonner<br />\nRiley<br />\nRH<br />\nTurnbull<br />\nCronin<br />\nFB<br />\nWillis<br />\nSubstitutions: Hopkins—Taylor for<br />\nWilson. Mt. St. Mary's—Hennessey for<br />\nRiley, Fennell for Boyle. Referee—<br />\nPrice, Swarthmore. Umpire—Clinton,<br />\nYale. Head Linesman--Danie!s, Georgetown.<br /><br />\nMagill<br /><br />\nIt will probably interest the student body to know that the NewsLetter has taken sole possession<br />\nof the office formerly occupied<br />\njointly with the Hullabaloo and<br />\nBlack and Blue Jay. The latter<br />\npublications have their headquarters on the balcony just above the<br />\nNews-Letter office.<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br /><br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br /><br />\nReal Service Must Be Engineered<br />\nbeXatIeriese<br />\nCt<br />\n°AM S H.E., OSCAR G•LE'VNI<br />\nOWN ERS<br />\nl•r4<br />\nklioZ*.<br />\nSt., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\n29 Baltimore<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nJAS.<br /><br />\nH. DOWNS<br /><br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nMany of the men whose names are writ large<br />\nin engineering history are design engineers; men<br /><br />\nlike Westinghouse, Lamme, Stanley, Hodgkinson, Tesla, Shallenberger. Their inventions<br />\nhave the quality of usefulness, of reliability, of<br />\nproductability; which is an involved way, perhaps, of saying that they have the primary<br />\nrequisite of all really great inventions:<br />\nServiceability.<br /><br />\nEngineering history abounds in instances of<br />\nnear-genius that produced no product, and of<br />\ngreat developments that never reached completion; and most of these instances are explained<br />\nby the lack, somewhere in the system, of that<br />\nability to give real Service.<br />\nService, in a machine or a system, or wherever<br />\nyou find it, is not there by accident but because<br />\nit was incorporated by men who understood<br />\nwhat was required and knew how to provide it.<br />\nMuch more is required of the designer than<br />\nfacility in calculation and mastery of theory.<br />\nHe must have first hand and thorough familiarity<br />\nwith manufacturing operations and with commercial and operating conditions. It takes more<br />\nthan mere ingenuity and inventiveness to design<br />\napparatus that will be really serviceable and<br />\nwill \"stay put.\"<br /><br />\nThe design engineer, in the Westinghouse<br />\nplan, is responsible for the performance of the<br />\nfinished product. He cannot possibly have the<br />\nproper understanding of operation unless he operates and tests, unless he spends time and thought<br />\nin investigation and study, not in the laboratory<br />\nor drawing room, but right on the operating<br />\njob. Here, most of his ideas will develop; and<br />\nhere he will see and prepare for all the different<br />\nthings which the product will later have to<br />\nencounter. Then when he comes to put hiQ<br />\ncreations on paper, his calculations will be<br />\nnecessary and helpful to check the conclusions<br />\nwhich he has reached, and this right use of them<br />\nrequires training and a high degree of understanding. This proper balance of the physical<br />\nand mathematical conception of things is what<br />\nconstitutes engineering judgement.<br />\nIt should be thoroughly understood that the<br />\nprimary function of the design engineer is the<br />\nconception and the production of new or improved apparatus, and familiarity with the<br />\npractical is essential to the proper discharge of<br />\nthis duty.<br />\nIt is this view of designing that makes this<br />\nbranch of Westinghouse engineering so important, so effective, and so productive of real<br />\ndevelopments.<br /><br />\nlifestinghouse<br />\n44000<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nActivities<br /><br />\nACHIEVEMENT8 OPPORTUNITY<br /><br />"}], "field_media_file": [{"target_id": 37653, "display": null, "description": null, "target_type": "file", "target_uuid": "1b542bd5-8769-4b1d-a84a-cf1367337bf8", "url": "http://digital.library.jhu.edu/system/files/2022-03/13016-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13016, "target_type": "node", "target_uuid": "09be600c-2c1e-4143-98e4-e05d6b905e3d", "url": "/node/13016"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4e70fb09-07b4-4b7f-9706-ee72e1590838"}]}