{"mid": [{"value": 38081}], "uuid": [{"value": "736e4183-ee44-4f7f-a177-81b49c456d7f"}], "vid": [{"value": 38081}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:47:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12649-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:47:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:47:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ".;;<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nhiL!nziqopkitts Nrins-411rttrr<br />\n<br />\nINTERFRAT BOARD<br />\nEDITORIAL, Page 2<br />\n(See Page 2)<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, OCTOBER 25, 1935<br />\n<br />\nVol. XL—No. 8<br />\n<br />\nPrice<br />\n<br />\nFive Cents<br />\n<br />\nPHI GAMS HIT BY BOARD FOR VIOLATION<br />\n'Stormers Pick<br />\n‘The Firebrand'<br />\nFor Fall Show<br />\n<br />\n1242Students Enrolled In J.H.U.; Fraternity Has Open Dance<br />\nContrasts To 89 Under Dr. Gilman For Frosh On Wednesday;<br />\n<br />\nNoted Surgeon Dies<br />\n<br />\nOver 800 Undergraduates Are Registered In College; 330<br />\nIn Graduate School; Miss Davis Contrasts Present<br />\nWith Days Of President Gilman<br />\n<br />\nCareer Of Cellini Portrayed<br />\nRacily In Mayer Play; Was<br />\nStage Hit 10 Years Ago<br />\n<br />\nThere are now 801 undergradu- tees, faculty and students of the<br />\nates, divided by schools, as follows: newly organized Johns Hopkins UniCollege of Arts and Sciences, 465; versity, and the following morning<br />\nSchool of Engineering, 251; School instruction began. Of the 89 students<br />\nof Business Economics, 85; 330 in enrolled that year, 54 had already<br />\nthe School of Higher Studies of the received' academic degrees, 12 had<br />\n<br />\nCasting Begun<br />\n<br />\nStudent Feeling Runs High<br />\nTen Fraternities Sign Peti- Gentlemen's Pact Signed By<br />\ntion Denouncing Action of<br />\nAll On Interfrat Board<br />\nPhi Gam In Breaking Pact<br />\nLimits Entertainment<br />\nEditor's Note: This petition was<br />\nsubmitted to the NEWS-LETTER by<br />\nthe Interfraternity Board.<br />\n<br />\nIn complete defiance to every other<br />\nfraternity on the campus, Phi Gamma_ Delta gave a formal dance for<br />\nfreshmen at a downtown club, Wednesday night.<br />\nThis action is a direct violation of<br />\nthe Interfraternity Rushing Agreement which specifically states \"There<br />\nwill be no restriction placed on the<br />\nentertainment provided by the fraternities for the freshmen on their<br />\nalloted date, except that the entertainment must be confined tco the<br />\nHopkins chapter house.\" While there<br />\nis no signed agreement between the<br />\nfraternities, it is considered a gentleman's pact, in keeping with the<br />\nspirit of the Honor System.<br />\nFeeling High<br />\nStudent feeling against the Phi<br />\nGams has been running high. The<br />\ngeneral concensus of opinion seems<br />\nto be that the Phi Gams have violated the Honor System and \"have not<br />\nacted in a manner befitting Hopkins<br />\ngentlemen.\"<br />\nTo signify their censure and condemnation of the Phi<br />\nGamma Delta fraternity, the members of the Interfraternity Board circulated a petition which was signed<br />\nby 10 of the 12 members on the<br />\nBoard. The petition states in part,<br />\n\"that the action of the condemned<br />\nchapter is 'unbecoming a gentleman'<br />\nand `prejudicial to the honor of the<br />\nUniversity.'\"<br />\n<br />\nFaculty of Philosophy, 34 in the matriculated as candidates for the<br />\nThe Interfraternity Board cannot<br />\nSchool of Higher Studies in Educa- bachelor's degree in this University censure<br />\nRally Held Tuesday In Playand condemn the recent action, 23 in Engineering, besides 272 and 2 had been received as special tion<br />\nof the Phi Gamma Delta FraterShop; Pantomime, Talks<br />\nenrolled in the School of Medicine students. Of the graduate students, nity too<br />\nmuch. The fraternities active<br />\nBy Fagin And Hinrichs<br />\nand 112 in the School of Hygiene and 1 held the degree of Bachelor of on<br />\nthe Board, twelve in number, enArts, 7 the baccalaureate degree in<br />\nPublic Health.<br />\nThe Barnstormers officially took<br />\ntered into a gentlemen's agreement to<br />\nwhose<br />\nphilosophy, science or letters, 4 the<br />\nhomes<br />\nstudents<br />\nare<br />\nin<br />\nThe<br />\nto<br />\nhope<br />\nthey<br />\nwhich<br />\nup the torch with<br />\nto conduct their rushing on a mutuMaryland are enrolled as follows: in degree of Civil Engineer, 18 the deset the theatrical world ablaze, last<br />\nally fair basis.<br />\nthe College, 239; Engineering, under- gree of Doctor of Medicine and 7 the<br />\nMonday. In other words, Zenas Sears<br />\nThis agreement Phi Gamma Delta<br />\ngraduate, 239, graduate, 20; School degree of Doctor of Philosophy.<br />\nhas announced that \"The Firebrand\"<br />\nhas broken in a flagrant manner, =of Business Economics, 72; School of Twenty of the 89 held fellowships.<br />\nwill be ignited on a Baltimore stage<br />\nbefitting a group wishing to be<br />\nla tie<br />\nIl MEMNE IMEMIEL<br />\nHigher Studies of the Faculty of There were 35 undergradriates.<br />\nDR. JOSEPH C. BLOODGOOD<br />\ncome December the fourteenth. Final<br />\ncalled gentlemen. The agreement<br />\nThe graduates held degrees from<br />\nPhilosophy, 148; School of Higher<br />\ndecision to produce the Edwin Mayer<br />\nstates that on \"Open House\" days,<br />\n25<br />\ninstitutions. Five of those holdStudies in Education, 31; School of<br />\nplay, which was a Broadway hit ten<br />\n\"entertainment must be confined to<br />\nHygiene, 20; and School of Medicine, ing the diploma of Doctor of Philosyears ago, was made only yesterday.<br />\nophy had done their advanced work the Hopkins chapter house.\" The lat58, making 827 out of a total enrollFirst tryouts were held last night.<br />\nin Germany; 14 of those who entered ter section was flouted before all of<br />\nment for these schools of 1,562, or had<br />\nSucceeding rehearsals will be held<br />\nreceived the degree of Doctor of the chapters on the Hopkins campus.<br />\n52<br />\nper cent. The others represent 43 Medicine from the University of This is no small matter at the Hopevery Tuesday and Thursday at<br />\nstates and the District of Columbia Maryland; there were 3 graduates kins, one of the few universities en7.30 p. m.<br />\nand 21 foreign countries. Last year from each of the following, Am- joying a successful Honor System.<br />\nBenvenuto Cellini, artist, poet, and<br />\nThe least the Interfraternity Board<br />\nherst, Cornell, Princeton, Yale and<br />\nthe leading confession writer of his Cancer Expert Was For Long in the same schools 55 per cent of the University of<br />\nVirginia; 2 came can do is remind the Phi Gamma and<br />\nthe students came from Maryland,<br />\nthe campus, that the action of the<br />\ntime, is the bright star of the plot<br />\nTime Associated With the and 45 per cent from 43 states and came from Harvard, 2 from Lafay- condemned<br />\nchapter is \"unbecoming a<br />\nette and 2 from Washington and Lee.<br />\nand, though Beni:Tenuto might not be<br />\nHopkins Medical School the District of Columbia and 27 for- The others came from 12 other gentleman\" and \"prejudicial to the<br />\nfavorably impressed by the author's<br />\neign countries.<br />\nhonor of the University.\"<br />\nAmerican institutions.<br />\nestimate of his character, the genDr. Joseph Colt Bloodgood, interIn the afternoon and evening classIt is regrettable the Board has not<br />\nFifty-seven<br />\nof<br />\nthe<br />\nstudents came<br />\neral public has made it one of the nationally known surgeon and the es the enrollment is larger than it was<br />\nthe power necessary to mete out defrom homes in Maryland. There were<br />\nA short director of the Hopkins laboratory last year, and it is believed that the<br />\nserved punishment.<br />\nstage's hardy perennials.<br />\n6 each from MassachuSetts and Virhis<br />\ndied<br />\nat<br />\npathology,<br />\nof<br />\nsurgical<br />\naverage<br />\nnumber<br />\nof<br />\ncourses<br />\ntaken<br />\nby<br />\nWe, the undersigned fraternities,<br />\nsnatched<br />\nmoguls<br />\nmovie<br />\ntime ago the<br />\nginia; 3 each from Illinois, New York<br />\nhome in Guilford last Monday even- each student is also larger, although<br />\nas members of the Interfraternity<br />\nto<br />\nburning<br />\nthe<br />\nand Pennsylvania; 2 each from Calithe \"brand\" from<br />\nThe two men who didn't sign reping, October 22.<br />\ndefinite information on this point is<br />\nBoard of the Johns Hopkins Univerfornia, Kentucky and Indiana; and<br />\ntorm a basis for \"The Affairs of Celresented<br />\nthe Phi Gams, and the BeDr. Bloodgood was sixty-seven not yet available. There has been a<br />\nsity, wish to state that the Phi Gamone each from Connecticut, Iowa,<br />\nlini.\" Admirers of the other sex will years old and had been in ill-health distinct trend in this direction during<br />\nma Delta Fraternity has broken its tas. This latter group was also reNew Jersey, North Carolina and<br />\nrecent years owing to the increasing<br />\npledge to the Board. We alsd wish cently cited by the Board for an infind Cellini a man after their own for more than a year.<br />\nSouth<br />\nCarolina.<br />\nDr.<br />\ndeath<br />\nhis<br />\ntime<br />\nof<br />\nthe<br />\nuntil<br />\nUp<br />\ndegree<br />\ncandidates<br />\nfor<br />\nthe<br />\nnumber<br />\nof<br />\nto condemn this chapter, and warn fraction of the rules.<br />\nthan<br />\nhearts, for there are no less<br />\nAt that time there was no Medi- the<br />\nBloodgood took an active interest in of Bachelor of Science.<br />\nQuestioned On Steps<br />\nmembers of the Freshman Class<br />\nfive feminine parts.<br />\nfighting cancer and in organizations<br />\nbe impossible to find a cal School, no School of Hygiene, no that Phi Gam has openly and flaWhen questioned concerning posIt<br />\nwould<br />\nTentative choice of \"The Fire- for its prevention and cure.<br />\nfree hour from 8.30 in the morning School of Engineering and no School grantly violated its honor by retract- sible steps which they might take<br />\nbrand\" was announced at the first<br />\nTaught Classes<br />\nuntil 10 at night, for classes meet of Education. The Faculty of Phil- ing its promise to the other chapters against the violators, the members of<br />\nBarnstormers' rally held last MonHe taught classes at the Johns continuously through the day.<br />\nosophy, comprising both graduate on the campus, and that it has not the Board seemed to feel that there<br />\nday. Approximately fifty persons Hopkins University School of Medand undergraduate students, was the acted in a manner befitting Hopkins was no use in trying to impose any<br />\nOn<br />\nthe<br />\nevening<br />\nof<br />\nOctober<br />\n3,<br />\n1876,<br />\nattended. A short dramatic effort icine and was chief surgeon at St.<br />\ngentlemen.<br />\nPresident Gilman addressed the trus- original university organization.<br />\npunishment whatsoever, because of<br />\nand speeches by leading 'Stormer Agnes Hospital.<br />\n(Signed) Alpha Delta Phi, Alpha their complete inability to enforce it.<br />\nfigures featured the program.<br />\nThrough publicity Dr. Bloodgood<br />\nTau Omega, Delta Phi, Delta Up\\si(Editor's note: The InterfraIn the first address, Dr. N. Bryl- fought the dread disease of which he<br />\nIon, Kappa Alpha, Kappa Sigma, Omternity Board has no means of<br />\nlion Fagin, director of the Playshop, was a recognized authority. His adicron Kappa Omicron, Phi Kappa Psi,<br />\nenforcing its dictums because it<br />\nstressed particularly the connection dresses were widely quoted in magSigma Phi Epsilon, Tau Alpha Phi.<br />\nis not vested with sufficient<br />\nbetween the Barnstormers'-and his azines and newspapers.<br />\npower by the member fraterniown organization. With proper supHe felt, however, that education Socialist, Speaking At Assembly, Address Features First Dance Of<br />\nties and the fraternities are not<br />\ncould,<br />\nboth<br />\nport from the students,<br />\nof the public was only half of the batYear; Program Includes Musical<br />\nUrges Youth To Use Own Judgrecognized by the University.)<br />\nhe said, be valuable proving-grounds tle which he waged against cancer.<br />\nment In Following Destinies<br />\nSelections By Students<br />\nBecause of the helplessness of the<br />\nfor more advanced studies. Dr. Fa- Equally necessary was the spreading<br />\n\"Graduate students belong to a<br />\nBoard in this crisis, rumor has it<br />\ngin closed with an appeal for stu- of knowledge of the latest methods<br />\nClaiming that the older men<br />\nvery special biological species,\" acThe second annual Johns Hopkins that Phi Gamma Delta will be boydent interest in this year's Playshop of diagnosis among physicians, surand women have made a mess of<br />\ncording to Dr. Isaiah Bowman, Pres- University Gymboree will be held cotted by all fraternity-controlled<br />\nprogram or, as he termed it, \"Bal- geons and x-ray specialists.<br />\ntheir job, Dr Broadus Mithcell called<br />\nident of the University, in his talk to Wednesday, December 18, at the activities oh the campus, with the<br />\ntimore's best theatrical buy.\"<br />\nBorn In Milwaukee<br />\non the youth, represented by the<br />\nFollowing the presentation of \"The<br />\nDr. Bloodgood was born at Mil- freshmen and sophomores at the as- the graduate students assembled in gymnasium. This event was inaug- consequences that any students who<br />\nLevering Hall last Friday evening for urated last year in order to raise do pledge Phi Gam, will have very<br />\nLighthouse Keeper's Daughter,\" a waukee on November 1, 1867. He<br />\nsembly, yesterday, to think for<br />\nthe first dance of the year. He de- funds with which to purchase sweat- little chance of making any activihighly dramatic pantomime, Sears was the scion of a family prominent<br />\nthemselves and not to follow the<br />\nclared that graduate students be- ers for the men on the varsity foot- ties.<br />\nintroduced Mr. Paul Hinrichs, new- as lawyers. He was graduated from<br />\nreasoning and advice given by himlonged to the class which actively ball team.<br />\n1)<br />\n(Continued on Page 4, Col.<br />\nMany fraternity men feel that this<br />\nthe University of Wisconsin in 1888<br />\nself and by others.<br />\ngoes after what it wants, preparing<br />\nwith the degree of bachelor of science<br />\nThe Athletic Department has start- infraction will be a very important<br />\n\"Because,\" he said, \" these very itself to lead a more active life.<br />\nand received the degree of doctor of<br />\ned work on the project, and its next factor in causing the University ofare responsible for the greatHe said that during the last year step will be to ask Omicron Delta ficials to take an active hand in framedicine from University of Penn- people<br />\nwar and its worst depression in he has worked with two groups of<br />\nsylvania in 1891. The following year est<br />\nKappa, the national honorary activ- ternity affairs. An authoritative<br />\nthe<br />\nhistory of the world.\" Why, men: those in, the physical sciences,<br />\nassistant<br />\nBaltimore<br />\nas<br />\nity fraternity, to take charge of the source stated that the Administrahe came to<br />\nthen, should the youth of today fol-- who were objective and showed little<br />\nresident surgeon in the Johns Hopaffair's financial end as well as act tion had been approached before the<br />\nOrganizations<br />\nCampus<br />\nOf<br />\nHeads<br />\nlow in the footsteps of the people of themselves, and those in the social<br />\nas the sponsor.<br />\npresent crisis, but had decided to<br />\nkins Hospital, where his career cenMust Turn In List Of Seniors<br />\nwho had made such a mess of sciences who were more interesting as<br />\nwait until next year, because the<br />\ntered.<br />\nVariety<br />\nOf<br />\nEvents<br />\nFor<br />\nVarsity<br />\nSeal<br />\nEligible<br />\nthings?<br />\nhuman beings and had minds stored<br />\npresent rushing season is almost<br />\nAlthough nothing is definite a;<br />\nYouth Administration<br />\nwith richer cultural experiences.<br />\nyet, the Gymboree will probably in- over.<br />\nThe Student Activities Committee<br />\nsome<br />\nthat<br />\nDr.<br />\nBowman<br />\nstated<br />\nThe \"Youth Administration\" is a<br />\nclude exhibitions in boxing, wresthas announced that Varsity Seals<br />\nplan by which older men and women students had never learned to distinling, badminton, tumbling, and a<br />\nwill be awarded in about six weeks to<br />\nobjects<br />\nDr. Hubbard Believes<br />\nare trying, with the powerful help of guish themselves from the<br />\nbasketball game between Hopkins<br />\nthose seniors who have earned them.<br />\ngovernment money, to direct the lives that they were studying. \"If I were and<br />\nsome<br />\nother club.<br />\nIn Realistic Examples<br />\nFor the benefit of new students at<br />\nThe National Research Council<br />\nof youngsters. Particularly the at- preaching a sermon,\" he stated, \"I<br />\nthe Johns Hopkins, John Macgill, the has awarded a grant to Dr. J. A.<br />\nThe exhibitions will be between<br />\ngradas<br />\non<br />\nyou<br />\nwould<br />\ntry<br />\nto<br />\nimpress<br />\ntempt to rescue youth from the<br />\nDr. J. C. Hubbard, professor of<br />\nchairman of the committee, again Bearden of the University departeither individuals from the different<br />\nblight of unemployment, and to open uate students the value of making<br />\naward.<br />\nPhysics, believes in impressing his<br />\nstudy<br />\nthe<br />\nfurther<br />\ngave the requirements for<br />\nclasses or from the various fraterniment of physics for a<br />\nthat<br />\ndistinction.\"<br />\nsome kind of future before the \"risstudents with the value of the<br />\nties.<br />\nSeniors taking part in their fourth of the electronic charge. Since 1929 ing\" generation which threatens<br />\nThe President remarked that the<br />\ntopic under consideration.<br />\nyear of a given non-athletic activity Doctor Bearden has been making a otherwise to be sunk.<br />\noutstanding difference between unAt a lecture to his IC Physics<br />\ndetermethoi<br />\nof<br />\nx-ray<br />\nthe<br />\nof<br />\nstudy<br />\nare eligible to receive the Seal. The<br />\ndergraduates and those in the gradu- Umbarger Named Business<br />\n(Continued on Page 4, Col. 1)<br />\nclass, recently, Dr. Hubbard cast<br />\nheads of the various activities will mining the exact charge on the elecate school was the fact that the latManager Of Musical Club about trying to find some apt exsubmit to the S. A. C. lists of eligible tron. His experiments have led to a<br />\nter had introduced into life their<br />\npression with which to illustrate<br />\nseniors. The S. A. C. will then check definite conclusion that there is a Council To Require<br />\nknowledge and interpretation of what<br />\nthe subject of acceleration. After<br />\nPaul Umbarger was given the<br />\nthe lists for names of questionable considerable difference between the<br />\nDues Paid To Vote they saw around them. \"Judgment office of business manager<br />\nthinking a few moments he said,<br />\nof<br />\nthe<br />\nnominees. Names of these men will be results obtained by the x-ray method<br />\ngrows with time, and experience<br />\nvery seriously.<br />\nMusical Club by the board of control<br />\npublicly posted, and the men will be and the oil-drop system as used by<br />\nbroadens judgment. A graduate stuvote<br />\nin<br />\nthe<br />\nvarito<br />\neligible<br />\n\"To<br />\nbe<br />\n\"If you ever happen to fall from<br />\nCalthe<br />\nof<br />\nMillikan<br />\nof<br />\nA.<br />\nthe<br />\nR.<br />\nProfessor<br />\ngroup<br />\nfor<br />\nMonday<br />\nC.<br />\nnight.<br />\nA.<br />\nOffices<br />\nS.<br />\nrequired to report to the<br />\ndent can't get far in the seasoning,<br />\nous class elections, which will be held<br />\nthe top of the Empire State Buildof<br />\njunior<br />\nbusiness<br />\nifornia Institute of Technology.<br />\nmanagers<br />\nwere<br />\nan interview.<br />\nbut he learns that it is there.\"<br />\ning with a stop watch in your<br />\ngiven to John Canning and Jack<br />\nThe grant from. the National Re- early in November by the Student<br />\nOne-star Seals will be awarded for<br />\n(Continued on Page 4, Col. 2)<br />\nMead<br />\ndeclared<br />\nD.<br />\nJohnson,<br />\nCouncil,\"<br />\nhand, you will easily be able to<br />\nSteepers, both juniors.<br />\nparticipation in one activity; with ad- search Council is to be used for a<br />\nprove that the distance you fall<br />\nAlthough Umbarger is a member<br />\nditional stars for more than one ac- complete repetition of the oil-drop president of the Council, \"students<br />\ntheir class dues. The fees FAGIN ADDRESSES \"Y\" CLUB of the junior class, he was given the<br />\neach succeeding second will be<br />\ntivity. Heads of organizations in experiment under more refined con- must pay<br />\n, by counting the number of<br />\nDr. N. Bryllon Fagin, director of position because he plans to leave<br />\ntheir fourth year of the work will be ditions than previously employed. may be submitted at the Postoffice.\"<br />\nstories<br />\nthat pass in each second.<br />\napparatus<br />\nprecision<br />\nsophomore<br />\nFreshman<br />\nand<br />\ndues<br />\nare<br />\nspecial<br />\nhigh<br />\nthe<br />\nJohns<br />\nHopkins<br />\nThe<br />\nthe<br />\nUniversity<br />\nat<br />\nPlayshop,<br />\nwill<br />\nthe<br />\nend<br />\nof<br />\nthis<br />\nSeal.<br />\ngiven a two-star<br />\nOne bright student wanted to<br />\nThe Varsity Seal consists.of a rec- needed has been designed and is in two dollars, while members of the 'discuss the latest plays before a year.<br />\nBenjamin Futernick, also a junior, know what he should do if the<br />\ntangular gold charm with the Seal the process of construction by Mr. C. Junior Class pay three dollars. As meeting of the International Lunchof the University superimpOsed there- T. Hill of the physics shop with the yet, no figure has been named for eon Club, at 12.30 today in Levering was appointed to special office of stop-watch stopped.<br />\nthe seniors.<br />\nHall.<br />\nhelp of assistants.<br />\npublicity manager.<br />\non.<br />\n<br />\nDr. Bloodgood Dies<br />\nAt Home On Monday<br />\nAfter Long illness<br />\n<br />\nMitchell Condemns Dr. Bowman Speaks<br />\nOlder Generation Tio Grad Students<br />\n<br />\nAnnualGymboreeTo<br />\nBe HeldDecember18<br />\n<br />\nS. A. C. To Award<br />\nSeals In Six Weeks<br />\n<br />\nGrant Awarded To<br />\nDr. J. A. Bearden<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD.,OCTOBER 25, 1935.<br />\n<br />\nCIjc<br />\n<br />\ncW8=LCttU<br />\nFounded 1897<br />\n<br />\nDEAF, DUMB, AND BLIND I So They Say<br />\n<br />\nVIEWS AND REVIEWS<br />\n<br />\nBy HAROLD M. KROPMAN<br />\n<br />\n\"William Allen White says that the<br />\nFORD'S<br />\nNEW THEATRE<br />\nRepublicans must not abolish the N.<br />\nThe big stage hit, Three Men on a<br />\nSo<br />\nconvincin<br />\ngly did Margaret HamD., but fix it up and make it work.<br />\nThen.put up a sign: 'Used Deal, Bet- Horse, will gallop into Ford's Thea- ilton play her role in A Farmer Takes<br />\nter Than New'.\"—Howard Brau- tre, Baltimore, tonight for an unusual A Wife, that Fox Film officials imRemit subscription fees to Treasurer, Student Acbaker.<br />\nlaugh engagement of eleven per- mediately signed her for an importivities Council, Remsen Hall, Postoffice, Johns Hoptant role in the film version of that<br />\nkins University.<br />\nformances, including matinees on<br />\n*<br />\n*<br />\n*<br />\ngreat American melodrama, Way<br />\nEntered as second-class matter December 3, 1909,<br />\n\"Despite the improvement in bus- Wednesday and Saturdays. On New Down East, which is now at the New<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\niness, unemployment has declined Year's Day last, Three Men on a Theatre.<br />\nCongress, November 3, 1879.<br />\nonly 3.2 per cent in the last year. Horse was just another show coming<br />\nMiss Hamilton is given ample opMaybe after all we should have let to Broadway. It opened—a<br />\nPublished semi-weekly from October to June, exsmash hit, portunity to display her ability in<br />\nHoover abolish poverty that time he<br />\ncept during examination and college holiday periods<br />\nand it's still there selling out nightly. her role as a malicious gossip in the<br />\noffered<br />\nto.\"—The New Yorker.<br />\npicture, which co-stars Henry Fonby undergraduates of the Johns Hopkins University.<br />\nA second company opened in Chicada, and Rochelle Hudson.<br />\n*<br />\n*<br />\n*<br />\ngo, a third on the Pacific Coast, and<br />\nIn Way Down East, Miss Hamilo—o<br />\nEDITORIAL DEPARTMENT<br />\n\"Kansas City—Psychologist Albert now the Boston company,<br />\nwith the ton's vigorous character is brought<br />\nE. Wiggam says chorus girls are not best known cast<br />\nWords of the Departed:<br />\nat Ford's, represents to the fore in her role as the neighEditor-in-Chief<br />\nJesse N. Borden<br />\nFrom Lou Reuling, Junior Class President, treasurer so dumb and cites Kay English, for- the peak of Broadwa<br />\ny—Hume Cronyn, borhood gossip. She brings calamity<br />\nManaging Editor<br />\nIrving Leberfeld<br />\nof Cotillion Board, and lacrosse star last year, comes mer Ziegfeld beauty and film play- Betty Field, Harry<br />\nDavenport, Jean about the shoulders of a girl trying<br />\nWilliam Diamond, Stanley M Finkel,<br />\na letter to John Murphy. Reuling is studying (supposed er, as an example. Her intelligencc Casto, Henry Norrell,<br />\nand others of to live down the disgrace of her past.<br />\nAssistant Managing Editors<br />\nto) in Germany . . . I Would have written sooner but I quotient is 168. The average colleg,- name and reputation<br />\n. The authors<br />\nKenneth Zierler<br />\nSports Editor<br />\nWay Down East, which was prowas off on a bicycle trip for ten days. In the little vil- an's is 129.\"--Evening Sun.<br />\n—George Abbott, and John Cecil duced by Winfield<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nSheehan, features<br />\nlages the cows and the peasants live together . . . I<br />\nHolm—have hit upon a great farcical Slim Summerville,<br />\nFeature Editor<br />\n*<br />\nEdgar Kemler<br />\n*<br />\n*<br />\nEdward Trevor<br />\nstayed this time in the Gugend herberge for twelve<br />\nidea in Three Men on a Horse, and and Andy<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nDevine<br />\nin<br />\nthe supporting<br />\ncents a night. They're plenty clean—shower baths, flush<br />\n\"The Italians must have home re- what is more, they<br />\nhave developed cast.<br />\nColumnists<br />\ntoilets, and all modern conveniences . . . I haven't done spect for American public opinion. it entertainingly.<br />\nThe story conBUSINESS DEPARTMENT<br />\nmuch in the way of wild times since the University is They started their invasion on the cerns the adventure<br />\ns of one Erwin<br />\nBOULEVARD<br />\nnot yet open, and I am not acquainted with student opening day of the World Series, Trowbridge, a<br />\nmousey individual,<br />\nBusiness Manager<br />\nDavid H. Levy<br />\nlife. Every once in a while I get the willies, buy a liter when it would not be noticed much.'' who earns his livelihood<br />\nFor<br />\ntoday<br />\nand tomorrow, the<br />\nAdvertising Manager<br />\nby writing<br />\nRobert Watkins<br />\nor two of wine, sit home and get a bun on. The little —The New Yorker.<br />\nBoulevard<br />\nTheatre<br />\nwill offer to its<br />\njingles<br />\nfor<br />\ngreeting<br />\ncards. For his<br />\nCirculation Manager<br />\nRobert Levi<br />\nfraulein who lives here has the most wonderful figure I<br />\nown amusement Erwin figured out patrons, the widely acclaimed cineOffice Manager<br />\nWilliam Kempton<br />\nhave ever seen. She has been engaged to one guy for<br />\na way of beating the horses, and dis- matic success, Diamond Jim. CharacMelville Locker<br />\nCopy and Filing Manager<br />\nseven years . . . Saw the fort where Johann Gottfried<br />\ncovers he has made tremendous prof- ters of the gay 'nineties, the most<br />\nHans Joseph Von Kunkel was in prison. I don't see<br />\nits—on paper. What with a kidnap- colorful and romantic period in the<br />\nBUSINESS STAFF<br />\nhow our old friend Kunkel escaped . . . imagine panMr. Maxwell Sauerwein is now ping and a dizzy blonde added, the history of the United States, come to<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\ncakes with cucumber salad and potatoes for lunch.<br />\nlife in Universal's special production,<br />\nbusiness manager<br />\nand<br />\nassistant ending is gloriously cockeyed.<br />\nN. Soifer, S. Tinley<br />\nDiamond Jim. The story deals wth<br />\ntreasurer.<br />\nThe<br />\npost<br />\nof<br />\n0-0<br />\nassistant<br />\nthe life of Jas. Buchanan Brady, the<br />\ntreasurer and burser is held by Mr.<br />\nLITTLE THEATRE<br />\nFrom the \"Redbook\" magazine comes a letter to our Henry<br />\nFriday, October 25, 1935<br />\nman who made the gay nineties gay,<br />\nIddins and Mr. John H. Gildear Editor, Jesse . ..<br />\nThe long-heralded opus that Gau- and. is in reality the<br />\nliece is auditor.<br />\nportrait of an<br />\nDear Editor:<br />\nmont-British announces on the eve of era.<br />\n*<br />\n*<br />\n*<br />\nHave you a campus marriage problem?<br />\ntheir first anniversary in America—<br />\nBeginning Sunday, the feature picFlorence Haxton Britten tells, in \"Marriages a la<br />\nDr. Ruth S. Lynch, who was in- Transatlantic Tunnel—will finally re- ture will ,be Claudette<br />\nColbert in She<br />\nIt would not be consistent to say that we were sur- Campus,\" what presidents and deans of colleges<br />\nall structor in zoology at the University, ceive its American premiere on Sat- Married Her Boss. This picture<br />\nurday,<br />\nOctober<br />\nprised by the violation of the Interfraternity Board over the country are doing about it . . . etc.<br />\n26,<br />\nat<br />\nhas resigned, and is now head of the<br />\nthe Little The- caused quite a<br />\npleasant sensation in<br />\n(I wonder if this letter happens to just hit the spot Department of Biology<br />\natre, Baltimore. This epic of man's<br />\nRushing agreement. Since the organization of the<br />\nNew York, and many critics are of<br />\nat the Maryvision<br />\n—Arrow Beer thanks.)<br />\nof<br />\na<br />\ndream<br />\ncome<br />\ntrue--a tun- the opinion<br />\nland State Teachers College, Towson,<br />\nBoard is such that it has no means of enforcing its<br />\nthat Miss Colbert's pernel under the Atlantic Ocean from<br />\nMd.<br />\no—o<br />\nformance in She , Married Her Boss<br />\ndecrees, it is only to be expected that infractions will<br />\nLondon<br />\nto<br />\nNew<br />\nYork by way of the surpasses<br />\nOn our beautiful campus, we have the girls of the<br />\n*<br />\n*<br />\nthat of It Happened One<br />\n*<br />\noccur. But although we expect them, they always cause Teachers<br />\nAzores and Bermuda—has been realCollege, organized into a club, which last year<br />\nNight. Selected short •subjects will<br />\nDr.<br />\nized<br />\nG.<br />\ndisappoin<br />\nthey<br />\nwhen<br />\nin<br />\ndisgust<br />\ndo<br />\nW.<br />\nthis highly imaginative spec- round<br />\ntment and<br />\na feeling of<br />\nClemens, formerly an inpromised to be a blight, but which surprised all conout the program.<br />\ncerned, including most of all its members, by carrying structor in German at Johns Hopkins tacle set in the year 1950.<br />\nhappen.<br />\nUniversity<br />\nAdapted from the novel, The Tun, has resigned and is now<br />\nout a rather worthy cause. This year they have reKEITH'S<br />\nThe Rushing Pact has been referred to as a \"gen- newed<br />\nactivities, re-electd Rose Hecht, president, gave professor of German at Hartwich nel, by Bernhard Kellerman, GB's<br />\nYesterday brought to Keith's TheCollege.<br />\nmillion-dollar production bids fair to<br />\ntleman's agreement.\" And although we recognize its a tea Thursday in honor of Dr. Bowman,<br />\natre a picture in which the Middle<br />\nDr. Bamberger,<br />\nestablish new standards of motionimpracticability in reference to rushing, the fact re- and Miss Coard, his secretary, who has announced her<br />\n*<br />\n*<br />\n*<br />\nAges live again in shining romance<br />\npicture spectacle for the world.<br />\nand<br />\nthrilling spectacle, The Crusades.<br />\nmains that every fraternity gave its word to abide by engagement. Seems a shame when we think of all the<br />\nDr. Jonas Friedenwald, Associate<br />\nThe cast of Transatlantic Tunnel<br />\nyears Dr. Bowman and Dr. Bamberger spent in reachThis picture was directed by Cecil B.<br />\nthe regulations.<br />\nProfessor of Ophthalmology at the includes Richard Dix, Leslie<br />\nBanks, DeMille, and came<br />\ning the heights reach by Miss Coard in one little act.<br />\ndirect from a $2Johns Hopkins Medical School, has Helen Vinson, Madge<br />\nEvans,<br />\nC.<br />\nAu- a-seat run in New York,<br />\nvery<br />\nDeltas<br />\nGamma<br />\npea<br />\nis<br />\nThe case of the Phi<br />\nPhiladelbeen<br />\ngranted<br />\nleave of absence for brey Smith Basil Sidney, George Ar0-0<br />\nphia, and Washington. Loretta Young<br />\nculiar one. Its membership list includes a number of<br />\nthe third and fourth quarters of this liss, and Walter Houston.<br />\nand Henry Wilcoxon share the lead<br />\nAmong my mail—<br />\nyear. He is to lecture at the Hebrew<br />\nthe outstanding men on the campus. But most peculiar<br />\nIn Transatlantic Tunnel, television,<br />\nroles. They are ably supported by<br />\nUniversity in Palestine.<br />\nWashington, D. C.<br />\nplanes that cross the Atlantic in a<br />\nof all is the paradoxical situation of having the PresiIan Keith, Katherie DeMille, C. Aufew hours, high speed automobiles,<br />\nOctober 15, 1935<br />\n*<br />\n*<br />\n*<br />\ndent of the Student Council and the chairman of the<br />\nbrey Smith, and Joseph Schildkraut.<br />\nDear Harold,<br />\nand other startling innovations are<br />\nThere is a cast of 10,000 in this picStudents Activities Council, both Phi Gams, apparently<br />\nA leave of absence until January,<br />\nrealities.<br />\nA certain event happened on campus at George 1936, has<br />\nture.<br />\nbeen issued to Dr. V. A.<br />\nsanctioning a breach of the Interfraternity Board rules,<br />\nWashington, which I thought might be of interest to Var<br />\nThe city of Fonda, New York, was<br />\nVolkenbur<br />\ngh,<br />\nAssociate<br />\nProfesand a gentleman's agreement. These men, who occupy you. Phi Sigma<br />\nSigma Sorority gave a dance and a sor of Epidim.iology,<br />\nGeorge Arliss and Walter Houston founded by the Dutch ancestors of<br />\nto<br />\nenable<br />\nhim<br />\nto<br />\nthe two most important positions among the under- most unusual event occurred. A certain girl wearing<br />\na act as Assistant District Health Of- donated their services free in the Henry Fonda, film actor.<br />\ngraduates should be the very last to become involved in red dress had a mishap. She had a slit all the way ficer fOr New<br />\nTransatlantic Tunnel.<br />\nYork State.<br />\n—J. S.<br />\ndown the front of her dress, and when she crossed<br />\nsuch an affair.<br />\n*<br />\n*<br />\n*<br />\nher legs it automatically fell apart. Another girl's esIn the final analysis, the whole matter boils down to cort got up in the middle of the room and<br />\nDr. A. W. Hedrich has been grantstarted clapthe powerlessness of the Board. Because of the general ping his hands to attract attention. He certainly did, to ed a leave of absence for the rest of<br />\ncontempt for the power of the Board, many men are the amazement of several hundred people on the floor, the Academic year. The Associate in<br />\nincluding the most shocked girl wearing the dress.<br />\nWas Biostatistics is to continue work on<br />\napt to overlook the importance of having some authorher face red? I leave that to your imagination.<br />\na chronic disease survey for the<br />\nity to regulate rushing. The need for such a group is<br />\nUnited States Public Health Service.<br />\nSigned,<br />\nHOME<br />\nevident. Freshmen should be given a chance to become<br />\nAn anonomous reader of your gossip column.<br />\n*<br />\n*<br />\n*<br />\nacclimated before they are pledged to a frat. If open<br />\nP. S.—If this be printed give the credit to me. (Six<br />\nA four-year scholarship in Gas Enrushing were the rule, the Freshmen would have no op- credits to anonamous.)<br />\ngineering, valued at $450, has been<br />\nacquainte<br />\nportunity to visit fraternities and become<br />\nd<br />\ngiven the Johns Hopkins University<br />\n0-0<br />\nwith the men they were going to choose as their intiby the Philadelphia Electric ComTo those upperclassmen who have missed the charmpany.<br />\nmate friends for the remainder of their stay at college.<br />\ning presence of Miss Frances Jordan, librarian<br />\nin the<br />\nNo doubt, the house putting up the best front would get main reading<br />\nroom, I wish to make known that she Las<br />\nthe lion's share of the pledges.<br />\nbeen taken sick, and is recuperating in Ashville.<br />\nNo<br />\nadulations of her efficiency and personality is necesThis affair will probably convince the administrasary, but only many wishes for a very fast recovery<br />\nand<br />\ntion that there is definite need for action to strengthen return.<br />\nthe Interfraternity Board. The events of the past two<br />\nTo the Editor of the NEWS-LE-rrER<br />\n0--0<br />\nyears have all pointed toward a complete breakdown in<br />\nDear sir:<br />\nthe present system. The breakdown is now a reality. A weaker moment:<br />\n---\\<br />\nPerhaps, and more than likely, the<br />\nMost girls go to parties with the idea of meeting<br />\nWe hope that future Interfraternity Boards will profit<br />\nsubject I am, going to discuss has<br />\nCOLLEGE<br />\nsome nice interesting man; but nine times out<br />\nof ten been brought up and<br />\nby the unhappy example of the present board.<br />\nsettled<br />\nbefore<br />\nto<br />\ncasual, accidental meetings prove to form more<br />\nlasting the satisfaction of<br />\nall concerned. If<br />\nfriendships. Somehow, a girl loses something<br />\nin at- so, I humbly beg<br />\nyour pardon for entractiveness when she is out on parade or<br />\nout for croaching on your<br />\ntime.<br />\nconquest.<br />\nI find the drinking-water facilities<br />\non this campus adequate but open<br />\nWe'll call for it, whisk it away<br />\nIt isn't often that Baltimoreans get a chance to<br />\nThe figures tabulated below are the results<br />\nto criticism. In the first place, why<br />\nof a<br />\nand<br />\nbring it back again. Railway<br />\ndance to the music of the nation's outstanding orches- questionnaire conducted by the<br />\nTerra Mariae, the year does one have to spend a penny<br />\nbook<br />\nExpress<br />\nservice is safe, swift<br />\nof the University of Maryland.<br />\ntras. Consequently, the Cotillion Board's announcement<br />\nwhenever he wants to quench his<br />\nThe<br />\nthirst?<br />\naverage<br />\nMore<br />\ncoed<br />\noften<br />\nhas approximately 6 dates a month.<br />\nthat it has secured Benny Goodman's orchestra for the<br />\nthan not a perand sure. Economical, too—<br />\nOn the other hand, the male goes out on<br />\nson finds himself without the copper<br />\nThanksgiving Cotillion has been enthusiastically reaverage of<br />\nrates are low—and our \"send9.5 times per month. Seventy-five per cent<br />\nof the girls coin. Provided he does have other<br />\nceived by the students.<br />\ning-it-collect\"<br />\nservice is particsmoke. Five per cent drink beverages stronger<br />\nchange, the difficulty in securing the<br />\nTUNE IN ON THE<br />\nthan<br />\nPARADE<br />\nRAILWAY<br />\nNEWS<br />\nEXPRESS<br />\ncringer<br />\nproper<br />\npopular.<br />\nale.<br />\nularly<br />\nlucre<br />\nPrompt pick-up<br />\nAlmost 50 per cent of the young ladies admit<br />\nis so much wasted time<br />\nThe Board is to be congratulated on its initiative<br />\nEvery week from the Following stations:<br />\nthat they are not adverse to an occasional<br />\ndelivery<br />\nand<br />\nservice<br />\npetting party. and, I am sure, very irritating. This<br />\nin all imin securing Goodman for his first Baltimore appearKWK<br />\nWLS<br />\n•<br />\nWEEI•WOR•WIIK•<br />\nThe \"dream\" girl of the U. of M. man<br />\nsituation is most acute, many peoWDSU • WFAA • WGST •KYA•KNX<br />\nmust have,<br />\nportant<br />\nance. The large social functions at the University are<br />\ncities<br />\nand<br />\ntowns.<br />\n• For<br />\nfirst of all, physical attraction, intelligen<br />\nple will tell you, when you enter GilKSTP•KOMO•WBAL•KOIL<br />\nce, and a<br />\ncomparatively few in number during the school year. pleasing personality.<br />\nannouncemen<br />\nlocal<br />\nWatch<br />\nservice<br />\nts<br />\nfor<br />\nor<br />\ninformati<br />\ntelephone<br />\non<br />\nOther men want \"mixability,\" a man Hall after an R. 0. T. C. drill on<br />\na warm afternoon. It seems to me<br />\nMost of the activity is withheld until June Week. But good disposition, chastity, and understanding.<br />\nthat the University should provide<br />\nThe ideal man of the coed must be tall,<br />\nwe are certain that there is a demand on the campus<br />\nhandsome,<br />\nintelligent, and well mannered.<br />\nOther qualifications simple fountains that would satisfy<br />\nfor more \"big-time\" affairs during the year. Last seall. Everyone does not require a cup.<br />\nincluded ate neatness, loyalty, dancing ability,<br />\nand<br />\nCharles and Fayette St.<br />\nmester, the Barnstormers very hesitantly tried the exVErnon 0600<br />\nThe water is so cold, too, that one<br />\ngood financial standing.<br />\nperiment of giving two shows instead of the usual one.<br />\ndoes not drink very much and this<br />\nDancing and swimming are the hobbies of<br />\n45 per<br />\nreally. fails to quench his thirst. I<br />\nThe results were that the production was very well sup- cent of the coeds. One spends her spare time<br />\ncollecting<br />\nDepot Office: 203 E. Franklin St.—VErnon 0600—Baltimore, Md.<br />\nhandkerch<br />\niefs.<br />\nAnother<br />\nported and now the 'Stormers have decided to give<br />\ncollects fraternity pins. Among think anyone with common sense will<br />\nsay that ice-cold water is not the<br />\nthe boys, some brand of athletics is the<br />\ntwo plays again this year.<br />\noutstanding<br />\nmost healthful of beverages in the<br />\nhobby. Music, women and reading are also<br />\nmentioned.<br />\nworld.<br />\nHomewood could readily absorb more affairs. The<br />\nForty-five per cent of the coeds expect to get<br />\nmarWhoever is responsible for our<br />\nstudents are always ready to support a function which ried soon after being graduated. Seventy per cent are<br />\nwilling to work after the ceremony has been<br />\nhas some popular feature to attract them.<br />\nperformed. present drinking system is certainly<br />\nAGENCY INC.<br />\nThe favorite subject of the student body is<br />\nchemistry, a genius for bothersome modernism.<br />\nThe Cotillion Board has the right idea.<br />\nwith pharmacy a close second.<br />\nNATION-WIDE RAIL-AIR SERVICE<br />\nA FRESHMAN.<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nAfter reading that Jesse Borden and Dave Levy are<br />\ngoing to attend the Intercollegiate Newspaper Association convention, I happened upon a choicy morsel in<br />\nthe form of a convention circular, which sort of intimates that it won't be all work . . . \"and our date<br />\nbureau is being run by a blonde and a brunette—so,<br />\ngentlemen prefer what you may; and for the girls who<br />\ncome from them 'thar' girls' schools we have a handpicked stag line accepted and approved by the coeds<br />\nhere . . . The girls, or if you will, women, will be rooming in the apartments- of the Schenley and these quarters will be completely private. No men will be permitted in this section.\" Not even the house detective?<br />\n<br />\nI<br />\n<br />\nFACULTY NOTES'<br />\n<br />\nInterfraternity Board<br />\n<br />\nin.r[<br />\n<br />\nLETTERS TO<br />\nTHE EDITOR<br />\n<br />\nritto7<br />\n<br />\nSEND YOUR<br />\nLAUNDRY HOME<br />\n<br />\n7-<br />\n<br />\nLy RAI LWAY<br />\nEXPRESS<br />\n<br />\nThe Right Idea<br />\n<br />\n-411<br />\n,<br />\n<br />\nRAILWAY EXPRESS<br />\n<br />\nTr<br />\n<br />\nThE<br />\n<br />\nSki]<br />\nto<br />\n<br />\nSW.<br />\n<br />\n110C<br />\n<br />\nthu<br />\n<br />\ncell<br />\nCol<br />\ngre<br />\nfig]<br />\nbuE<br />\nin<br />\nthe<br />\nblo<br />\nAt<br />\nDoi<br />\nup<br />\nne‘<br />\nGa:<br />\n<br />\n'7<br />\narc<br />\ning<br />\nblo<br />\nAt<br />\noff<br />\ntea<br />\ntac<br />\nJa<br />\n<br />\nof<br />\ncro<br />\nGe<br />\nwh<br />\nga<br />\nof<br />\n<br />\nbut<br />\nGa<br />\niei<br />\ntm<br />\nth(<br />\nwa<br />\nPe<br />\ner<br />\nst<br />\ntai<br />\n<br />\n\f3<br />\n<br />\nHOME WOOD, BALTIMORE, MD.,OCTOBER 25, 1935.<br />\n<br />\nJay Eleven To Face Swarthmore Runners To Open Gas-Civils Wrest SPE Fraternity<br />\nSaturday Thrilling Contest Gets Turbyville<br />\nTomorrow In Battle Between Season<br />\nAgainst Lehigh From Opponents<br />\nTwo Evenly-Matched Teams Teams Meet At Bethlehem 6-0 Victory Gained In Hard- Athletic Trophy<br />\nTravel To Swarthmore For<br />\nSecond Tilt Of Season;<br />\nOptimistic Spirit Prevails<br />\n<br />\nHave Good Prospect<br />\n<br />\nJay Walks<br />\n_By KENNETH ZIERLER<br />\n<br />\nPlan For<br />\nj<br />\nIntramural League<br />\nLast week I mentioned thvit the<br />\n<br />\nExcellent Showing Against<br />\nWashington Squad Lends<br />\nConfidence, Experience<br />\nBy RED GLANTZ<br />\nCo North, young man, go North!<br />\nThat's what the Johns Hopkins pigskin carriers are doing. They're due<br />\nto play Swarthmore College at<br />\nSwarthmore, Penna., tomorrow afternoon. It's the seasonal clash, and big<br />\nthings will be done and seen.<br />\nThe Jay footballers, after an excellent showing against Washington<br />\nCollege, promise to display an even<br />\ngreater amount of precision and<br />\nfight. Coach George Darley has been<br />\nbusy ironing out the defects found<br />\nin the opening match, and has kept<br />\nthe future Tarzans at tackling and<br />\nblocking practice for the past week.<br />\nAt the field, all is hustle and bustle.<br />\nDoes Coach Darley have a trick card<br />\n1-1P his sleeve? Will he try out his<br />\nnew spinner reverse play against the<br />\nGarnets?<br />\nThe gridmen have been going<br />\naround with grim faces and a fighting look in their eyes. They're out for<br />\nblood this time, no doubt about that.<br />\nAt any rate, when the whistle goes<br />\noff for the kick-off and the two<br />\nteams meet for that first bodily contact, Swarthmore will know that the<br />\nJays are in the game.<br />\nGarnets Drop First Two<br />\nSwarthmore has a large number<br />\nof experienced men and a promising<br />\ncrop of new material. Of these, Coach<br />\nGeorge Pfann has molded a team<br />\nWhich, though losing its first two<br />\ngames, has displayed a good brand<br />\nOf ball even in defeat.<br />\nThe initial game of the year with<br />\nWashington College was lost 13-6,<br />\nbut it was a moral victory for the<br />\narnets, having held a much heavier and more experienced squad to<br />\ntwo touchdowns while scoring once<br />\nthemselves.<br />\nCamill \"Bud\" Peter<br />\nwas the outstanding star for the<br />\nPennsylvanians, breaking loose several times for substantial gains and<br />\nShowing himself to be a veritable<br />\ntartar on defense.<br />\n<br />\nG<br />\n<br />\nUpset By Dickinson<br />\nSwarthmore's second defeat was<br />\nsomething in the nature of an upset<br />\nWhen they lost to Dickinson, 14-7.<br />\nThe Pfannmen scored their only<br />\nMarker when Ben Cooper circled end<br />\nfor 72 yards and crossed the Dickinson goal line standing up after having received some nice blocking from<br />\nhis mates. For most of the contest,<br />\nhowever, the Garnet gridmen were<br />\non the defense, trying to stop the<br />\noff-tackle slants of Shore, Clark,<br />\nKiehl, and other Dickinson stalwarts.<br />\nSeveral disastrous fumbles halted<br />\nany threats that Swarthmore made<br />\nt?wards carrying on a sustained<br />\ndrive. The game was costly in that<br />\nDudley Perkins, star halfback and<br />\none of the most effective passers and<br />\nPunters on the squad was disabled.<br />\nHe suffered a recurrence of an old<br />\nknee injury, and it is doubtful that<br />\nlie will see any action this year.<br />\nThe Dickinson game showed a<br />\nConsiderable let-down in the quality<br />\nOf the ball displayed by the Pfann.inen. The tackling was ragged, the<br />\ninterference ineffective, and the general morale of the team lower than<br />\nthat exhibited against Washington.<br />\nTeams Evenly Matched<br />\n<br />\ninterfrat football league was functioning better than the intramural<br />\nleague, and I pointed out that the<br />\nreason was that the fraternities had<br />\na basis for morale in that they are<br />\neach an entity in which the players<br />\nstick together in all activities. With<br />\nthe exception of the New Jersey AllStars and, possibly one or two other<br />\nintramural teams, the organizations<br />\nare not well-knit.<br />\nIt seems strange that there can be<br />\nfound no ties of occupational loyalty<br />\nupon which to build intramural athletic competition when every AntiWar Strike reveals so plainly the<br />\nbreach between the engineers and the<br />\nA.B. men. It might not be a bad idea<br />\nto have an engineer's league, the<br />\nteams to fight for the honor of meeting the winner of an A.B. league and<br />\nbusiness league combined. In that<br />\nway some sort of continuity might<br />\nbe inserted into the system. Plaques<br />\nmight be offered to the winner of<br />\neach league and a trophy to the college with the highest total of points<br />\nin intercollege competition within the University, all awards to be<br />\ndisplayed in the office of the dean<br />\nof the winning college—arts or business or engineers. A college would<br />\nhave to win three legs on the trophy<br />\nto get permanent possession of it. In<br />\nsuch a fashion tradition may be<br />\nstarted and the intramural league be<br />\nbuilt up as intercollege leagues.<br />\n0—0<br />\n<br />\nCriticism Of<br />\nThe Plan<br />\nPerhaps the chief objection to the<br />\nplan I outlined above lies on ethical<br />\ngrounds. It may be argued that there<br />\nis already entirely too big a rupture<br />\nin the relations of. the engineers and<br />\nthe art.'s men. Since they take different courses in different sections of<br />\nthe campus for the most part, and<br />\nsince they even segregate in the matter of fraternities, the two sets of<br />\nmen have little to do with, one another. I think that the problem oT<br />\nmaking these two units realize that<br />\nthey are each a part of a single institution that stands out in the academic world—in any world, for that<br />\nmatter—as the epitome of the scientific attitude of open-mindedness and<br />\nof thorough investigation of facts, T.<br />\nthink that this problem is not beneath the consideration of the highest administrators at the Hopkins<br />\nFollowing that line, it may be<br />\npointed out that I would act upon<br />\nthe distinctions that already exist,<br />\nand would construct an even larger<br />\nbarrier between the two groups. I<br />\ncan't agree with that. As I see it,<br />\nthe source of the trouble is the lack<br />\nof contact between the engineers and<br />\nthe arts men. Playing football<br />\nagainst one another would certainly<br />\nbring them into close contact—in<br />\nmore than one way. When men meet<br />\nmen they didn't know well before in<br />\nsome game like football, they usually<br />\nget a new respect for them. I believe that this has been the case with<br />\nthe fraternities. Speaking as a fraternity man I can say that we have<br />\nyet to meet a team whose men we<br />\ndidn't think more of after playing<br />\nthem for the courage and sportsmanship they showed.<br />\n<br />\nFought Tilt; Alpha Delts Wins Award For Interfrat<br />\nWin In Frat League Race<br />\nAthletic<br />\nChampionship;<br />\nLeads<br />\nWith<br />\n330 Points<br />\nIn a closely-contested interclass<br />\n<br />\nTo Renew Cross-Country<br />\nFeud; Close Race Seen<br />\nThe Hopkins cross-country team<br />\nwill inaugurate its season tomorrow when it travels to Bethlehem,<br />\nPa., to engage the Lehigh harriers.<br />\nThe run will mark the first competition between the squads in the sport<br />\nsince 1931.<br />\nAccording to past results, a hardfought battle should be waged. The<br />\nJays captured the last encounter by<br />\nthe score of 27-28, when a Hopkins<br />\nrunner, Tom Neely, came up into<br />\neighth place in the last half-mile to<br />\ncapture the deciding point.<br />\nProbable Starters Picked<br />\nCoach Hambleton has not definitely<br />\npicked the starting squad, but six of<br />\nthe seven participants are rather<br />\ncertain of their places. Captain Emmert, Sholtes, Lyman, Bob and<br />\nGeorge Brown, and Moxley are the<br />\nleaders, while Castelle and Schultz<br />\nare engaged in a close struggle tor<br />\nthe other open position.<br />\nInjuries have taken their toll during the past week, with both Lyman<br />\nand Moxley suffering from turned<br />\nankles. However, they have been<br />\ntraining for several days, and should<br />\nbe in good shape tomorrow. Lack of<br />\npractice has also hurt the squad,<br />\nsince a great majority are engineers<br />\nand cannot allow much time from<br />\ntheir studies.<br />\nInterscholastics To Be Held Here<br />\nHambleton, in addition to coaching<br />\nthe cross-country team, has been<br />\nspending some time in plans for the<br />\ncoming annual interscholastic championships held at Homewood and<br />\nsponsored by the University chapter<br />\nof Spiked Shoe, national honorary<br />\ntrack fraternity.<br />\nBy all indications, the meet Will<br />\nattract a greater entry list than at<br />\nany time in the past. Letters have<br />\nbeen received from Syracuse Central,<br />\nnational individual<br />\nboasting the<br />\nchampionship. Knott Terrace, the<br />\nwinner of the team trophy, and Patterson Central is another powerful aggregation. The contest will take place<br />\non November 23 at 12 noon, and entry blanks are already obtainable<br />\nfrom Irving Leberfeld.<br />\n<br />\nYesterday, the Fred Turbyville<br />\nReinoldi, handed the Business Men a<br />\nTrophy for the Interfraternity Ath6 to 0 setback.<br />\nletic Championship was bestowed<br />\nFrom the first until the last blast<br />\nupon Sigma PM Epsilon.<br />\nof the whistle the game was a nip<br />\nAlthough S. P. E. won the trophy<br />\nand tuck affair. First the Business<br />\nlast year, it was not presented to<br />\nMen had the ball, then the Gas Civthem at the time. This delay was due<br />\nils took possession.<br />\nThis sort of to the fact<br />\nthat the plaque did not<br />\nwarfare continued until a sensationhave the names of the winners etched<br />\nal play by Reinoldi resulted in the<br />\nupon its surface.<br />\nsingle tally.<br />\nThe trophy was awarded on the<br />\nA. D.s Down P. A.s<br />\nbasis<br />\nof the largest number of points<br />\nPhi Alpha stubbornly succumbed<br />\nstrung<br />\nup by the fraternity. The matto defeat at the hands of the Alpha<br />\nter<br />\nof<br />\npoints<br />\nincluded all intramural<br />\nDelta haters by a 12 to 0 score in<br />\nsports<br />\nand<br />\nS.<br />\nP. E. took the prize<br />\nthe only frat game played this week.<br />\nwith<br />\n330<br />\npoints.<br />\nFollowing them was<br />\nThe Phi Alphs, handicapped by the<br />\nPhi Sigma Delta with 325 points, and<br />\nlack of two men, were forced to leave<br />\n<br />\nwhen the Hitler of the referees, you<br />\nknow who, ruled that the football rule<br />\nwas to be followed after having made<br />\nthe lightning-fast decision that the<br />\nsituation demanded. Not to suggest<br />\nany heresy, but there is room for a<br />\ngood thrashing out of the rules. I<br />\nrecommend that each fraternity talk<br />\nthe matter over at a meeting and<br />\nsends an instructed representative to<br />\nthe interfrat athletic meeting on October 30.<br />\no—o<br />\n<br />\nEvery day something in the interBoth teams are rankling from the<br />\nsting of former defeats. In experi- frat league crops up to emphasize<br />\nence, the Garnets, perhaps, have the the need of a rules-interpretation<br />\nedge on the Jaymen. The average meeting. Wednesday, in the 0. K.<br />\nWeights of the two teams are almost 0.-Phi Ep game, Don Noonan, carthe same, with the Swarthmore line rying the ball, slipped on the muddy<br />\nPoundage at 176 pounds and the back- surface and propelled himself rather<br />\nfield weight at 160 pounds. Both are abruptly on the teerain. While in this<br />\nequally sound on defense, speed and reclining position he assayed a pass<br />\ndrive. The Hopkins team acts as which was intercepted and carried<br />\na unit while the Swarthmore aggre- to within a centimeter of his own<br />\ngation is built around \"Bud\" Peters. goal-line.<br />\nThe probable line-up:<br />\nAccording to football rules, the ball<br />\nSWARTHMORE was dead as soon as any part of<br />\nHOPKINS<br />\nKirschlager Don's anatomy except his hands or<br />\nL.E<br />\nSWindell<br />\nSpruance feet kissed the pasture. The ball<br />\nL.T.<br />\nMcGuire<br />\nDay<br />\nClement could not have been intercepted ana<br />\nL.G<br />\nTaylor the Phi Eps lost a chance to score<br />\nHalbert<br />\n•••••••••••••••••••••••••••••••••••••......................<br />\nPhillips (c.)<br />\nAnfinsen MANN..<br />\nR.G<br />\nEllis<br />\nMorissett<br />\n....R.T<br />\n................<br />\nMcCor'k (c.)<br />\nR.E<br />\nSchmidt<br />\nST. PAUL at 33RD STREET<br />\nWard<br />\nOsbourn<br />\nFB<br />\nPrescriptions-School Supplies<br />\nPeter<br />\nGraziani<br />\nLH<br />\nCandy-Cigars<br />\nKahl<br />\nCooper<br />\nRH<br />\nUnexcelled Fountain Service<br />\nXelly<br />\nLichtenw'ner lio....1.4.11.11.•••••—rowiowoos••••••••••••••••<br />\nR.B<br />\n<br />\nBtrely's Pharmacy<br />\n<br />\nmen unguarded. This, paired<br />\n<br />\nJesatko<br />\nPhi Alpha<br />\n<br />\nAlpha Delts<br />\nE.<br />\nC<br />\n<br />\nThe<br />\nRoyal Touch<br />\n<br />\nwith third place was garnered by Delta<br />\nhead- Upsilon with a score of 310 points.<br />\n<br />\nthe Alpha Delt running attack<br />\nClose Race<br />\ned by such performers as Bayless,<br />\nThe competition was very keen, and<br />\nKempton and White, was responsible<br />\nfor the Alpha Delt victory.<br />\nWhite for a while it was anybody's prize.<br />\nand Kempton each accounted for<br />\nEven to the last match, there was no<br />\ntouchdowns. Both tallies were made<br />\nsure winner. When the session's inon intercepted passes.<br />\ntramural sports ended, and the scores<br />\nThe line-ups of the games:<br />\nwere figurd out, S. P. E. had won by<br />\nBusiness Men<br />\nGas Civils<br />\nfive points.<br />\nE<br />\nSiems<br />\nGrove<br />\nThe winners of the respective tourE<br />\nWiseman<br />\nDukehart<br />\nnament were as follows:<br />\nDiver<br />\nC<br />\nJoffe<br />\nPhi Psi--Touch football<br />\nBarker<br />\nLachman<br />\nQ•B<br />\nPi<br />\nLambda Phi—Volleyball<br />\nH.B<br />\nL. Adler<br />\nThomas<br />\nDelta Upsilon—Basketball<br />\nH.B<br />\nReinoldi<br />\nJ. Adler<br />\nSigma Phi Epsilon—Softball<br />\nF.B<br />\nGrelecki<br />\nGlasser<br />\n<br />\nW. White<br />\nT. Jones<br />\nP. Edmunds<br />\nW. Kempton<br />\nJ. Bayless<br />\nE. Kimball<br />\n<br />\nFollow Arrow and you follow the style<br />\n<br />\nT Locker<br />\nA. Lachman<br />\nA. Willen<br />\nI. Lefstein<br />\n<br />\nHarrier Managers Wanted<br />\nAll freshmen interested in a crosscountry managerial berth are urged<br />\nto report to Coach Waldo Hambleton,<br />\nManager Roy Hartman or Milton<br />\nSaul today at 4:30 p. m. The position<br />\nhas not been filled' as yet, and all<br />\ncandidates will be, carefully considered.<br />\n<br />\nThis year will see another epoch<br />\nof intramural play. However, the first<br />\nfew games of touch football have<br />\nshown the spirit of the fraternities<br />\nto be even better than that of last<br />\nyear. Perhaps the reason might be<br />\nthat the frat men did not see what<br />\nthey were getting for victory. Now<br />\nthat they've all been gazing rather<br />\nenviously at the newly-awarded<br />\nplaque, they are all the more determined to take part in interfraternity<br />\nathletic activity.<br />\nAt any rate, intramural competition, as a means of giving every man<br />\nin school a chance to play ball, is an<br />\nexcellent idea. The Physical Education Department, headed by Dr.<br />\nSchaffer, ought to be given a word<br />\nof praise for the fine work they've<br />\ndone.<br />\n<br />\nStraight from London<br />\ncomes this new style but.<br />\nton down wide spread<br />\ncollar—attached to the<br />\nArrow HUNT Shirt.<br />\nWhite or fancy — all<br />\nSanforized Shrunk.<br />\n$2 up<br />\n<br />\nARROW SHIRTS<br />\nand TIES<br />\n<br />\nOnly Arrow Shirts have Arrow Collars<br />\n\"-.••••••••<br />\n,<br />\n.,.......,•••••••••••••-•••••<br />\n,<br />\n.I.<br />\n,<br />\n<br />\n./.....••-••••••••••••••••••••••••<br />\n<br />\nMcPHERSON'S<br />\nHITT<br />\nAn Arrow Shirt<br />\nwith<br />\nAroset Collar<br />\n11 E. Baltimore St.<br />\nPRICE, $2.00<br />\n<br />\nHookins Over<br />\nSwarthmore<br />\nI suppose Hopkins will officially be<br />\nthe underdog in the Swarthmore<br />\ngame, but I know I share the conviction of the team when I pick Darley's eleven to come home from<br />\nPennsylvania with a victory.<br />\nHere are the State selections for<br />\ntomorrow:<br />\nHopkins to sadden Swarthmore<br />\nNotre Dame to hand Navy her second straight loss<br />\nFlorida's 'Gators to feast on Terrapin<br />\nWestern Maryland to click against<br />\nMt. St. Mary's<br />\nSt. John's to win over American<br />\nWashington College to top Delaware<br />\nCincinnati to leave Baltimore nothing<br />\nto enjoy but the ride.<br />\nLost—I<br />\nWon-5<br />\n<br />\n0—0<br />\n<br />\nPrepare For<br />\nInterfrat Meeting<br />\n<br />\nfootball game, the Gas Civils, led by<br />\n<br />\nSports Calendar<br />\nFRIDAY—Football (Intramural):<br />\nFrosh Engineers B vs. Frosh<br />\nEngineers A, Field 3.<br />\nFrosh Artists vs. Frosh Scientists, Field 4.<br />\nFrat: Delta Upsilon vs. P.<br />\nLambda Phi, Field 1<br />\nPhi Gamma Delta vs. Tau Alpha Omega, Field 2<br />\nCross-Country (J. V.): Johns<br />\nHopkins University vs. SouthSATURDAY—Football (Varsity):<br />\nJohns Hopkins University vs.<br />\nSwarthmore at Swarthmore<br />\nCross-Country (Varsity): Johns<br />\nHopkins University vs. Lehigh<br />\nern at Homewood<br />\n<br />\nFencers Practicing<br />\nThe fencing squad has already<br />\nstarted informal practice for the<br />\ncoming season. Many men answered<br />\nthe first call, and prospects for the<br />\ncoming season are very encouraging.<br />\nDespite the large turnout, men with<br />\nany inclination towards the sport<br />\nwill be welcomed. Practice is being<br />\nheld every Saturday afternoon at 1<br />\no'clock at the Barn.<br />\n•••••••••<br />\n<br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Birely's<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\n<br />\nSPISOS<br />\n\"001n.All WSOC-0109<br />\n<br />\nOftt.SANS<br />\nla.t. 01S<br />\nSSW<br />\nI%<br />\nSOUGHT<br />\nOS,<br />\nVila<br />\nfORD<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD.,OCTOB<br />\nER 25, 1935.<br />\n<br />\n'Stormers Pick AVIATION<br />\n'The Firebrand'<br />\nFor Fall Show<br />\n<br />\nGirl In College For Teachers<br />\nIs Taught Lesson In Biology<br />\n<br />\nTHIS COLLEGIATE WORLD<br />\n<br />\nBy GORDON GRAHAME DUCE<br />\nJim Collins — Ace of High-Divers<br />\nThe great-great-grandnephew of formed.<br />\nDiving Uncle Sam's new fighting<br />\nPaul Tulane, founder of Tulane UniMargy<br />\nDetails of an alleged international<br />\nDecides To Stick To Physics After Using Up Her versity, is<br />\nplanes to find out whether or not<br />\nworking his way through plot, which it<br />\nis thought included<br />\nthey will hold together is a job noBest Lines On A Prospect, To Discover<br />\nthe university his great-uncle en- Brinson<br />\n, are as yet very meager. The<br />\nbody wants. Not many pilots will do<br />\ndowed.<br />\nearly information cabled to<br />\nLater Who He Is<br />\nthis<br />\nit for love or money. However, there<br />\ncountry told how Brinson and a friend<br />\nCareer Of Cellini Portrayed is a little group of free-lance flyers Of course, the little girl is in the chase that she forgot<br />\nButler University is attempting to Carl J. Lemcke, were detained when<br />\nall about her<br />\n—a group which probably doesn't College<br />\nfor Teachers, but while that work and dallied<br />\nRacily In Mayer Play; Was number<br />\nsolve<br />\nthe eternal problem of mar- it became certain they were attemptaround.<br />\nAgain<br />\nand<br />\nmore than half a dozen—<br />\nexplains a lot, it doesn't exonerate again the<br />\nriage<br />\nand<br />\ndivorce. A course in mat- ing to work the release of Josph<br />\nyoung fellow walked past<br />\nStage Hit 10 Years Ago which specializes in this dangerous<br />\nrimony<br />\nis<br />\nbeing offered under a 39- Walden„ also knowns as \"Dr. Rivosh<br />\nthe<br />\nlittle<br />\none<br />\nfrom<br />\nbeing<br />\ncomplet<br />\nely her desk and always stopped<br />\nwork. They are dubbed the \"Suicide<br />\nto chat year-old<br />\nlawyer who has been twice of Berlin,\" believed to be a native<br />\ndumb.<br />\nClub\" by their brother airmen.<br />\nabout the work. Of course, she was<br />\nmarried and has had wide experience of Latvia and an agent of the Ogpu,<br />\nWhen a new experimental plane<br />\nIt seems that Margy was out late a little annoyed<br />\nthe Soviet secret political police, from<br />\nat his shyness, but in divorce cases.<br />\nemerges from the work shops of the one night<br />\nwith a grad student in the she thought he<br />\na Chinese prison. Walden was sen*<br />\nwould<br />\n*<br />\n*<br />\nsoon<br />\nget over<br />\nfactory, glistening in her pristine<br />\nPhysics Department. After all, it is that, once<br />\ntenced to 15 years imprisonment for<br />\nRally Held Tuesday In Play- glory, the<br />\nhe felt the full effect of<br />\nThe following is the reasoning of<br />\nregular factory test pilots<br />\nespiona<br />\nge.<br />\nrather<br />\ntiring<br />\nto<br />\nlearn<br />\nall about Heat No. 5.<br />\na mathematics professor at Drexel:<br />\nShop; Pantomime, Talks are frequently not called upon to give<br />\nAccordi<br />\nng to a reliable Japanese<br />\nher the first long dive. Her wings and Expansion, Transfer of Heat and<br />\n1. A poor lesson is better than<br />\nBut sad to relate, the young man<br />\nBy Fagin And Hinrichs may be shorn off like cardboard; or allied subjects in one night<br />\nsource, the plot to set Walden free<br />\nnothing<br />\n.<br />\n(Saun- failed to respond to all<br />\ntreatment.<br />\nthe tail may give Way, or she may be ders, pp 148-157<br />\n2. Nothing is better than. a good was discovered when a Japanese gun), and make an 8.30 She brought all her<br />\n(Continued from Page 1, Col. 1)<br />\nboat on river patrol in the Yangtse<br />\nhunting skill lesson.<br />\njust bull-headed and refuse to pull<br />\ninto play, but he would not bite.<br />\nintercep<br />\nted a radio message from the<br />\nly appointed coach. Much of Mr. Hin- up. There are a lot of things that can the next morning.<br />\n3. Therefore, a poor lesson is betLate For Class<br />\nSoviet steamship Sever, en route<br />\nIn desperation, she skipped No.<br />\nrichs' address was devoted to the go wrong and there isn't much chance<br />\nter<br />\nthan<br />\na<br />\ngood lesson.<br />\n6<br />\nWell, be that as it may, she vifrom Shanghai to Vladivostok.<br />\nand went immediately into No.<br />\nnecessity of close cooperation be- of bailing out with a 400-mile-an* * *<br />\n7.<br />\nbrated<br />\nacross the lab and took her<br />\nBrinson and Lemcke, it is charged,<br />\nhour<br />\nrazor-e<br />\ndge<br />\nof<br />\nair<br />\nhowling<br />\npast<br />\nHeretofore, nobody had ever withtween the three branchcs of the club.<br />\nA gift of 300 books, similar to the had planned<br />\nto bribe the assistant<br />\nthe cockpit. So the manufacturers, seat exactly at 9.05 a. m. Saturday,<br />\nstood No. 6 except a well dressed one received by the Hopkins recent- warden of the jail in<br />\nIn the prodution of so difficult a rather than<br />\nWuchang, where<br />\nrisk the necks of their meanwhile flashing her No. 3 \"this<br />\npiece as \"The Firebrand,\" this, he own staff pilots, call in a member of looks interesting\" smile at a good- tailors dummy sne had mistaken for ly, was received by the University of Walden is being held. Wiichang is<br />\nSouthern California from Italy last directly opposit<br />\nlooking young fellow who happened the real thing.<br />\ne Hankow on the<br />\nthe \"Suicide Club.\"<br />\nsaid, was especially important.<br />\nAnd it looked as if year.<br />\nto<br />\nbe<br />\nYangtse. In this way the pair inpassing<br />\nat<br />\nthe<br />\ntime. And when this fellow was going to<br />\nOutstanding among them was Jim<br />\nbe imper*<br />\n*<br />\n*<br />\nBegin Casting<br />\ntended to gain admittance to the<br />\nCollins.<br />\nHe had dived more air- he evinced interest in her arrival, she vious to all her attacks. She was even<br />\nconfide<br />\njail, let Walden leave and have Lemcd<br />\n\"this<br />\nis an 8.30 class, isn't ready to use her nnal<br />\nCasting for the new Barnstormer planes—and had dived them faster<br />\nDating<br />\nwas<br />\ncalled<br />\none<br />\nof<br />\nthe<br />\nmost<br />\nresort, but as<br />\nit?\" and giggled delightedly at hav- no couch was<br />\nke remain behnd in his place. Once<br />\nplay was begun last night when ap- and farther—than any other pilot.<br />\nnearby, she could not important opportunities of college<br />\ning<br />\nput<br />\nWalden was safely out of Chinese<br />\none over on the instructor. faint.<br />\nlife<br />\nby<br />\nDr.<br />\nLast<br />\nmonth<br />\nHarold<br />\none<br />\nof<br />\nthem<br />\nBosley,<br />\ncarried<br />\nhim<br />\ndirector of<br />\nproximately thirty candidates apreligious activities at Iowa State territory, Lemcke was to have efThen after quivering around a<br />\nto his grave with the wind screaming<br />\nThen<br />\nfinding<br />\nit all in vain, she<br />\npeared at the Barn. Mr. Paul Hinfected his own release by a mere<br />\nTeachers College.<br />\na shrill symphony of death. Jim had while she finally jelled and set to grouchily turned<br />\nto her work and<br />\nrichs outlined the plot of the play been living on borrowed<br />\ndeclaration of his true identity.<br />\n* * *<br />\ntime for a work daintily stabbing at her speci- viciously cut away. Once<br />\nagain, he<br />\nand offered several suggestions to good many years. More than once men. Soon, however, her afore- stopped to<br />\nTwo other men said to be involved<br />\nIt is reported by the Associa<br />\nmake a comment, but beted in the plot are<br />\nBrain Nadis, a Soviet<br />\nthe candidates. The roles were as- he had pulled the whiskers of death mentioned friend walked past and fore he had a mance to<br />\nsay anything Collegiate Press that a freshman at<br />\nRussian and a typewriter salesman<br />\nand had come off unscathed, to grin asked how she was doing. Remem- she snapped<br />\nsumed by those who attended.<br />\n\"Please don't bother the University of Minnesota changed<br />\nby occupation, and an Englishman<br />\nand go back and do it again.<br />\nbering her success with No. 3, she me.\" Nonplus<br />\nsed, he looked sur- from a pre-med course to a business<br />\nwhose identity was not revealed.<br />\nOne bleak December afternoon he repliod that things weren't progress- prised, but<br />\nshrugged his shoulders course because the line of pre-meds<br />\nwalked out on the line at the Naval ing very badly, all the time wonder- and walked<br />\n*<br />\n*<br />\n*<br />\nin the registrar's office was very<br />\naway.<br />\nAir Station at Washington, D. C., ing if she should turn on Number 5<br />\nMargy turned around to her<br />\nlong<br />\nand<br />\nWorcest<br />\nthe<br />\ner, Mass.—Poets and others<br />\nfrosh just didn't feel<br />\nnextwhere a Martin experimental dive- or 4. Then rapidly deciding that he door<br />\nneighbor and said, —I wish that like standing in line so long.<br />\nwho talk about \"the everlasting<br />\nbomber was waiting for him. Navy looked a little too weak to withstand fellow<br />\nhills\" may not be strictly accurate,<br />\nwould'nt bother me so much.\"<br />\n* * *<br />\n(Continued from Page 1, Col. 3)<br />\nofficials who were to witness the No. 4, she let him have 5.<br />\nHer neighbor looked surprised,<br />\naccording to Dr. Wallace Atwood,<br />\nand<br />\nThe carpenter at the University of<br />\nInstead of the \"Youth AdmAnis- demonstration demanded an 8,000In accordance with this plan she remarked: \"Why,<br />\npresident of Clark University here,<br />\nthat's Dr. Bram- Southern Californ<br />\nia gives his entire<br />\ntration,\" Dr. Mitchell proposed an foot power-dive. Jim merely shrug- gave him an arch look and began ble!\"<br />\nsalary to a scholarship fund dedicat- who says that recent geological re\"Age Administration\" which would ged, had his parachute repacked, and to crack wise. Our hero looked at<br />\nNeedless to say, Mangy dropped<br />\nsearch indicates that three Rocky<br />\ned to the memory of his son.<br />\ntightened his safety-belt. He climbed her a little bewildered and then Biology<br />\n. She has decided to stick to<br />\nMountain ranges have formed and<br />\nbe run by the youth of America, de*<br />\n*<br />\n*<br />\nup to 12,000 feet. Here he rolled her shrugged his shoulders in resignation. Physic<br />\ns—at least, she knows someworn away during the last 30 milsigned to discover comfort and de- over on her side, kicked<br />\nFor the second year, Haverford<br />\nbottom rud- But Margy was so eager after the thing about<br />\nlion years.<br />\nthat.<br />\ncency for the mature and elderly, but der and let the nose flip straight toCollege is offering night courses, in<br />\n\"Three distinct ranges of mounEnglish and general science, for neto prevent them from doing harm wards the postage stamp that was<br />\ntains,\"<br />\nhe said, \"have come into exgroes. The Haverford News says<br />\nto society, especially to the young the flying field.<br />\nistence and passed away since the<br />\nDown, down the plane rushed.<br />\nthat the classes, conducted by stuwho, through their health, alertness,<br />\nformations which we know as the<br />\nStraight ahead over the nose he could<br />\ndent teachers, are well attended.<br />\nRocky Mountains began.\"<br />\nand enthusiasm, deserve every con- see the brown earth leaping<br />\n•<br />\n*<br />\n*<br />\nat him.<br />\nNo exact determination of the<br />\nsideration.<br />\nHe was standing on the rudder pedAt the University of Maryland<br />\nheight of the ancient mountains can<br />\nals,<br />\nhead<br />\nducked forward under the<br />\nthere is a freshman who objects to<br />\nInstructors Little Help<br />\nbe made, Dr. Atwood said, but they<br />\nwindscreen to protect his face from<br />\ndoing outside reading, because during<br />\nwere probably higher than the presStudents, in listening to their in- the typhoon of air.<br />\nthe winter it is so cold on the porch.<br />\nThe Department of Military Science<br />\nent peaks.<br />\nstructors, should always remember<br />\nFollowing a dinner, the \"Y\"<br />\n*<br />\nHe was down to 5,000 feet when<br />\n*<br />\nCaband Tactics announces its annual inet held its first<br />\n* * *<br />\nthat these instructors—practically suddenly there was a noise like a<br />\nbusiness meeting of<br />\nA University of Utah coed walked<br />\npresentation of an officer's sabre to the term yesterd<br />\nay evening in Lever- up to the library desk<br />\nwithout exception—have done little loud explosion. The plane lurched vi\"It<br />\nwould<br />\nseem,\"<br />\nMr. Hoover said,<br />\nand asked for<br />\na student in the Reserve Officers' ing Hall, to formula<br />\nte plans for the Horses' Oats. After much discussi<br />\nor nothing to prevent the ills olently and Jim felt something strike<br />\n\"that<br />\ngovernm<br />\nthe<br />\nent,<br />\nhaving chosen<br />\non<br />\nTraining Corps will be made by The year.<br />\nfrom<br />\nwhich<br />\nyouth is suffering him a stunning blow on the head. He<br />\nwith the head librarian, it was finally to devalue our endowment resources,<br />\nBaltimore Chapter of The Reserve<br />\nHeaded by Henry Leber, other<br />\ntoday. These professors fought in lost consciousness for a moment and<br />\ndecided that the young lady wanted might make the gates of giving<br />\nOfficers' Association of the United members of the<br />\nCabinet include J. Horace's Odes.<br />\nthe World War, or fell victims to then, as he came to and realized his<br />\nmore easy of access.<br />\nIf all taxes<br />\nStates. The association will be rep- Hurwitz, B. Murphy<br />\n, T. Wiehe, J.<br />\nthe patriotic propaganda of George predicament, he began to struggle to<br />\nand the limitations now imposed<br />\nresented by Colonel Walther F. Griffin, D. De Lima,<br />\nL. Hanawalt, B.<br />\nCreel, or, sad to relate, helped make get clear. The plane, shorn of wings<br />\n'were removed from gifts Itind beThe mule he are a funny bird.<br />\nJames, of the Cavalry Reserve, who Pinck, C. Bowers,<br />\nB. Vincenti, D.<br />\nwar propaganda. They were firm on the right side, had gone into a<br />\nqests we would receive more of them.<br />\nHe hair are long and thick;<br />\nwill make the presentation.<br />\nLloyd, E. Gaunt, P. Berge, L. Mathbelievers in the new economics violent spin and was falling at a<br />\nIf the purpose of the people is to<br />\nHe are mostly ears and head,<br />\nThe conditions of this award are: er, E. Rouny, A.<br />\nPinkerton, I. Peters,<br />\n(1922-29) and no more saw the im- speed that would make the proverbial<br />\nrdistribute wealth, I know of no<br />\nBut a lot of he are kick.<br />\npending crash than they now see the plummet look like a snail. The cen- 1. An award for excellent scholas- H. Skinner, J. Weber, F. Silver, D.<br />\nquarter into which such redistribu--Daily Kansan.<br />\ntic attainment in the subject of Emerson, R. Osborne, C. Sivertz,<br />\nway out of the slump. They con- trifugal force pressed Collins down<br />\n• * *<br />\ntion could flow that would be more<br />\nGhingher, B. Frey, J. Lyle, C. Hobbs,<br />\nMilitary Tactics.<br />\ntinue training students to enter the in the cockpit and for 3,000 feet he<br />\nProfessor Welsh of Bowdoin Col- advantageous to the people as a<br />\nJ. Mehling, W. Jarman, N. Soifer,<br />\n9. The cadet will be designa<br />\nranks of the unemployed, which is fought desperately to get out.<br />\nT. lege firmly states that examinations whole than into our edhcational inted by Ellis,<br />\nJ. Baurenschmidt, R. Bing- are<br />\nFinally, he managed to leap clear<br />\nnot the least useless of its occupaas harmful to the intellect as stitions.\"<br />\nthe professor of Military Science<br />\nhardt, J. Soule, J. Alexander, H. Sevand im,mediately began feeling for<br />\ntions.<br />\n* * *<br />\nliquor and women.<br />\nand Tactics.<br />\nern, J. Mitchell, and J. Wright.<br />\n*<br />\n*<br />\nSo what is said from the profes- the rip-cord ring. As he was about 3. The cadet<br />\nWalla Walla, Wash.—What's a<br />\nmust<br />\nbe a member of<br />\nA survey at Haverford last June slippery football to a quarterback<br />\nsors' platform should be taken with to pull it, he realized that he was<br />\nthe R. 0. T. C. Graduating Class<br />\nshowed that those students who own who works his way through college<br />\na grain of salt. The professors' falling directly in line with the path<br />\nradios get better grades.<br />\ntheory, is proved to have been of the wreckage, and if the chute 5. The saber will be presented to<br />\nby running a cake of soap for yardthe cadet by officers of the Bal* * *<br />\nwrong, at least we do not know but opened now, the doomed ship would<br />\nage on babies' backs?<br />\ntimore Chapter of the Reserve<br />\nJuniatian College may have a golf<br />\nwhat the promptings of the student fall on him. The ground began to<br />\nNothing whatsover, say those who<br />\nloom up close. Just when it seemed<br />\nOfficers' Association.<br />\nmay work out better.<br />\nAll students who can read music course this year.<br />\nhave seen Phil Green, Whitman Coltoo late, the plane swerved off, and 6.<br />\n* * *<br />\nThe name of the cadet will be and are interested in learning to play<br />\nDr. Mithcell gave a few striking<br />\nlege's varsity quarter, in action<br />\nJim gave the rip-cord a healthy tug.<br />\nThe Ohio State Lantern issues the in the nursery<br />\nannounced by the aforemen- a wood instrument, may do so free,<br />\nexamples of the paradox that exists<br />\nand on the gridiron.<br />\nThe 'chute whipped out with such<br />\ntioned professor when and in if they report to the Barn on Mon- following figures:<br />\nin the supply and demand Of proGreen pays his way at Whitman<br />\nforce that Jim was stunned and landmanner as he may prescribe, the day afternoon at 4 p. m. Conrad Ge- Population in the U. S.-124,000,000 by performing the duties of a nurseducts that exist today. He told the<br />\ned in a groggy condition between the<br />\nname of the cadet selected to be belein, conductor of the Band, will Eligible for Townsend pensionsstudents that when an attempt will<br />\nfaid---a job entailing scrubbing his<br />\n, wings and main wreckage of his<br />\nfurnish<br />\n50,000,000 young charges as well as putting<br />\nbe made to march them off to war to<br />\ned to the Baltimore Chap- teach all applicants who intend to<br />\nship in a little vacant lot.<br />\nter of the Reserve Officers' As- learn to play. Freshmen, especially, Government employes an those<br />\ntell their professors, pastors and par- '<br />\nthem to bed. (Concluded next week)<br />\nprohibited from working under<br />\nsoication of the United States, are urged to try out, as three years<br />\nents that they made the war and<br />\nWhen Green came to Whitman a<br />\nthe Labor Acts—<br />\n60,000,000 year ago, he read an advertisement<br />\nat least thirty days in advance for regularly playing entitles one to<br />\nthat they should fight it.<br />\nUnemployed—<br />\na varsity seal.<br />\n13,999,900 seeking a girl to take charge of chilof the presentation.<br />\nLessons<br />\nwill<br />\ndren and do general housework. He<br />\nbe<br />\ngiven to those de- Left to produce the nation's<br />\nThe sabre is about three feet long<br />\ngoods—<br />\nOscar Helm Gives Address<br />\n2 proved his salesmanship by calling<br />\nwith a space on the blade so as to siring to play the saxophone, the<br />\n\"These two persons,\" the report on the inquiri<br />\nengrave on it the cadet's name. The clarinet, the piccolo, the trumpet the<br />\nng hoUsewife and getcontinues, \"are you and I—and I'm ting the<br />\n(Continued from Page 1, Col. 4)<br />\nOsear Hem, a graduate of the<br />\nplace.<br />\nsaber will be on display in the Senior Trombone, the drum, and the alto or<br />\nbass horns.<br />\nWhen he returned to college this<br />\nSlips for insturments all tired out.\"<br />\nDr. Bowman's address was the fea- classroom of the R. 0. T. C.<br />\nJohns Hopkins and a former presi*<br />\n*<br />\n*<br />\nmay be obtained on Monday at the<br />\nFall he took the job again. Sunday<br />\ndent of the Student Council, ad- ture of a program which also inMinneapolis, Minn.—A search last- mornings he dresses the<br />\nsame time candidates sign up to<br />\ndressed the Freshman Commission cluded some musical numbers by<br />\nchildren,<br />\ning several weeks ending recently for rushes them<br />\nlearn.<br />\nThe<br />\nBand<br />\nHopkin<br />\nDebat<br />\nmen.<br />\ncan<br />\ns<br />\nDr.<br />\ners<br />\noff to Sunday school<br />\nTuesday evening on the subject of<br />\nLawrence A. Peuse from fifOrganize Oct. 31<br />\nInto Karimo, University of Minnesota and then<br />\nteen to twenty new members.<br />\ngoes into the kitchen and<br />\nfraternities. The session held at tran, organist at the Wilson Memorial<br />\nstudent, when he found the body of elps prepare the<br />\nMethodi<br />\nst Church and an instructor<br />\nLevering Hall was marked by a<br />\ndinner.<br />\nPaul Umbarger, business manager<br />\nhis uncle, Herman E. Karimo, in the<br />\nNew York—Harold Jesurun, 37,<br />\nheated debate, which followed Helm's at the Peaboicly Institute, performed and actisg<br />\nhead of the Debating N. S. L. Meetings Hereafter anatomy laboratory<br />\nof the Minnesota Columbia University student who<br />\non the piano. He played the First<br />\nremarks.<br />\natCouncil, announced that the initial<br />\nmedical school.<br />\nOn<br />\nTuesd<br />\nPrelude<br />\ntracted wide attention last yearwhen<br />\nby<br />\nDr.<br />\nay<br />\nDonald<br />\nAfter<br />\nH.<br />\nAndrew<br />\nnoon<br />\ns of<br />\nNext Tesday evening, October 29,<br />\nThe youth had been unable to lo- he insituted a \"wakin<br />\nmeeting of the organization would<br />\ng-up\" service<br />\nhas been tentatively selected as the the Chemistry Department and the<br />\ncate his uncle at the beginning of for his fellow<br />\nNationa<br />\nl<br />\nStudent<br />\n\"Largo<br />\nbe<br />\nmoveme<br />\nheld<br />\n\"<br />\nLeague<br />\nnt<br />\nThursda<br />\nof<br />\nDvorak's New<br />\nmeeting<br />\nstudents, is back this<br />\ny, October 31st, in<br />\ndate for election of officers of the<br />\nthe Board Room in Levering Hall. will not be held this afternoon, it the Fall term and had appealed to year full of determination to expand<br />\n-World Symphony.<br />\norganization.<br />\nCandida<br />\ntes for membership are wel- was announced by Ralph Nordstrum, police for aid. Detectives assigned his novel bbusiness.<br />\nStuart LeCompte, baritone, graduto the case found Herman Karimo<br />\n\"I'm all set for a big season,\" he<br />\nate student in Plant Physiology, sang come and are requested to report at newly elected Executive Secretary of<br />\nthe<br />\nNSL.<br />\nthat<br />\nUntil<br />\ntime.<br />\nfurther notice, regu- had changed addresses under an as- confided to our reporter. \"I've<br />\nTwo Marionettes by Law and the faalsumed name and had committed suimiliar Dear Old Johnny Hopkins. He<br />\nready got a lot of customers, and<br />\nPlans for debates with soiceties lar meetings will be on Tuesday<br />\nSeptemb<br />\ncide<br />\ner<br />\n4.<br />\nThe<br />\nbody<br />\nlay<br />\nunafterno<br />\nons<br />\nat 4 p. m. in Levering<br />\nwas accompanied by Mips Rachel representing Princeton and Yale are<br />\nmy new method of getting them up<br />\nThis week: JOHN C. MacGILL<br />\nclaimed in the county morgue until<br />\nHall.<br />\nnow being formulated.<br />\nnever fails.\"<br />\nDean Berry appointed this tall, Parker.<br />\nAt its business meeting last Tues- September 17, when it was removed<br />\nGeorge Steiner, undergraduate, a<br />\nThe new method proved to be a<br />\nblonde student chairman of the Studay<br />\nthe NSL elected a new slate of to the university.<br />\nphial of ammonium chloride, predent Activities Committee last year. scholarship holder at the Peabody,<br />\nHANDBOOKS AVAILABLE<br />\n*<br />\n*<br />\n*<br />\nofficers, including the following:<br />\nconcluded the program with two vioviously treated with sodium hydroxHe is also manager of the football<br />\nExeuticve Secretary, Ralph NordEaston, Pa.—Eugene Brinson, La- ide to obtain the<br />\nlin elections, Massenet's Meditation<br />\ngas. A few whiffs<br />\nThe NEWS-LETTER has been re- strum; Member<br />\nteam . . . a member of the Barnship Secretary, Sid- fayette '31, is being held prisoner by of this and<br />\nfrom Thais and Brahm's Fifth Hunthe patient is wide awake.<br />\nquested by E. A. Schall, executive ney H Levy;<br />\nstormers' Club . . . vice-president of<br />\nTreasurer, Irving Co- Chinese authorities at Hankow on It never<br />\ngarian Erance.<br />\nfails, and besides, \"it clears<br />\nsecretary of the Hopkins Y. M. C. A. hen; Recordi<br />\nOmicron Delta Kappa . . . a member<br />\nng Secretary, Tessim charges of \"assisting Communists to the head<br />\nThe<br />\nnext<br />\nGraduat<br />\nimmediately,\" according to<br />\ne<br />\nStudent<br />\nDance to announce that there are still a Zorach.<br />\nof the swimming team.<br />\nThe new executive commit- imperil the Chinese government, Jesurun<br />\nwill be held November 15th, with number of<br />\n.<br />\nhandbooks left, and that tee is made up of Levy,<br />\nJohnny's fraternity affiliations are<br />\nNordstrum bribing officers, and attempting to<br />\nWalter Routson's Orchestra provid- anyone desiring<br />\nHe also gives an inkling of the<br />\none should call at and Cohen, and Elijah Adams<br />\nwith Phi Gamma Delta.<br />\nand procure the escape of a convict\" col- novel means he uses<br />\ning the music.<br />\nto promote<br />\nLevering Hall at once.<br />\nMaurice Shils.<br />\nlege authorities here have been in- business.<br />\n<br />\nCasting Begun<br />\n<br />\nMitchell Condemns<br />\nOlder Generation<br />\n<br />\nR.O.T.C.Group Will \"Y\"Cabinet Meets<br />\nPresent Sabre To To Discuss Plans;<br />\nTop Ranking Cadet Leber Heads Group<br />\n<br />\nFree Musical Tuition<br />\nFor Band Members<br />\n<br />\nDr. Bowman Speaks<br />\nTo Grad Students<br />\n<br />\nCampus Captains<br />\n<br />\nwa<br />\nda:<br />\nkir<br />\nNa<br />\nbili<br />\npol<br />\nbe<br />\nthe<br />\nfor<br />\nint<br />\ntia<br />\n<br />\nthe<br />\nrio<br />\nthe<br />\nthe<br />\nwo<br />\ndet<br />\n<br />\nOUT<br />\n<br />\nisla<br />\nthe<br />\ncre<br />\nma<br />\n<br />\n2<br />\ntioi<br />\npec<br />\nthe<br />\n0.<br />\nSOT<br />\n<br />\nthe<br />\noui<br />\nlen<br />\nerr<br />\nwa<br />\ndel<br />\nup<br />\ntio<br />\ntio<br />\n(N<br />\nLe<br />\nNa<br />\non<br />\nLe<br />\nInl<br />\nlam<br />\nCo<br />\nsp<br />\nth<br />\nNi<br />\nor<br />\npr<br />\nof<br />\nth<br />\n54<br />\nIt<br />\nbe<br />\nPr<br />\ntic<br />\n<br />\nPi<br />\nti<br />\ncc<br />\nal<br />\ner<br />\nof<br />\nh(<br />\nJ(<br />\nrn<br />\n<br />\na]<br />\nti<br />\n<br />\n\f", "format": "basic_html", "processed": ".;;<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nhiL!nziqopkitts Nrins-411rttrr<br /><br />\nINTERFRAT BOARD<br />\nEDITORIAL, Page 2<br />\n(See Page 2)<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, OCTOBER 25, 1935<br /><br />\nVol. XL—No. 8<br /><br />\nPrice<br /><br />\nFive Cents<br /><br />\nPHI GAMS HIT BY BOARD FOR VIOLATION<br />\n'Stormers Pick<br />\n‘The Firebrand'<br />\nFor Fall Show<br /><br />\n1242Students Enrolled In J.H.U.; Fraternity Has Open Dance<br />\nContrasts To 89 Under Dr. Gilman For Frosh On Wednesday;<br /><br />\nNoted Surgeon Dies<br /><br />\nOver 800 Undergraduates Are Registered In College; 330<br />\nIn Graduate School; Miss Davis Contrasts Present<br />\nWith Days Of President Gilman<br /><br />\nCareer Of Cellini Portrayed<br />\nRacily In Mayer Play; Was<br />\nStage Hit 10 Years Ago<br /><br />\nThere are now 801 undergradu- tees, faculty and students of the<br />\nates, divided by schools, as follows: newly organized Johns Hopkins UniCollege of Arts and Sciences, 465; versity, and the following morning<br />\nSchool of Engineering, 251; School instruction began. Of the 89 students<br />\nof Business Economics, 85; 330 in enrolled that year, 54 had already<br />\nthe School of Higher Studies of the received' academic degrees, 12 had<br /><br />\nCasting Begun<br /><br />\nStudent Feeling Runs High<br />\nTen Fraternities Sign Peti- Gentlemen's Pact Signed By<br />\ntion Denouncing Action of<br />\nAll On Interfrat Board<br />\nPhi Gam In Breaking Pact<br />\nLimits Entertainment<br />\nEditor's Note: This petition was<br />\nsubmitted to the NEWS-LETTER by<br />\nthe Interfraternity Board.<br /><br />\nIn complete defiance to every other<br />\nfraternity on the campus, Phi Gamma_ Delta gave a formal dance for<br />\nfreshmen at a downtown club, Wednesday night.<br />\nThis action is a direct violation of<br />\nthe Interfraternity Rushing Agreement which specifically states \"There<br />\nwill be no restriction placed on the<br />\nentertainment provided by the fraternities for the freshmen on their<br />\nalloted date, except that the entertainment must be confined tco the<br />\nHopkins chapter house.\" While there<br />\nis no signed agreement between the<br />\nfraternities, it is considered a gentleman's pact, in keeping with the<br />\nspirit of the Honor System.<br />\nFeeling High<br />\nStudent feeling against the Phi<br />\nGams has been running high. The<br />\ngeneral concensus of opinion seems<br />\nto be that the Phi Gams have violated the Honor System and \"have not<br />\nacted in a manner befitting Hopkins<br />\ngentlemen.\"<br />\nTo signify their censure and condemnation of the Phi<br />\nGamma Delta fraternity, the members of the Interfraternity Board circulated a petition which was signed<br />\nby 10 of the 12 members on the<br />\nBoard. The petition states in part,<br />\n\"that the action of the condemned<br />\nchapter is 'unbecoming a gentleman'<br />\nand `prejudicial to the honor of the<br />\nUniversity.'\"<br /><br />\nFaculty of Philosophy, 34 in the matriculated as candidates for the<br />\nThe Interfraternity Board cannot<br />\nSchool of Higher Studies in Educa- bachelor's degree in this University censure<br />\nRally Held Tuesday In Playand condemn the recent action, 23 in Engineering, besides 272 and 2 had been received as special tion<br />\nof the Phi Gamma Delta FraterShop; Pantomime, Talks<br />\nenrolled in the School of Medicine students. Of the graduate students, nity too<br />\nmuch. The fraternities active<br />\nBy Fagin And Hinrichs<br />\nand 112 in the School of Hygiene and 1 held the degree of Bachelor of on<br />\nthe Board, twelve in number, enArts, 7 the baccalaureate degree in<br />\nPublic Health.<br />\nThe Barnstormers officially took<br />\ntered into a gentlemen's agreement to<br />\nwhose<br />\nphilosophy, science or letters, 4 the<br />\nhomes<br />\nstudents<br />\nare<br />\nin<br />\nThe<br />\nto<br />\nhope<br />\nthey<br />\nwhich<br />\nup the torch with<br />\nto conduct their rushing on a mutuMaryland are enrolled as follows: in degree of Civil Engineer, 18 the deset the theatrical world ablaze, last<br />\nally fair basis.<br />\nthe College, 239; Engineering, under- gree of Doctor of Medicine and 7 the<br />\nMonday. In other words, Zenas Sears<br />\nThis agreement Phi Gamma Delta<br />\ngraduate, 239, graduate, 20; School degree of Doctor of Philosophy.<br />\nhas announced that \"The Firebrand\"<br />\nhas broken in a flagrant manner, =of Business Economics, 72; School of Twenty of the 89 held fellowships.<br />\nwill be ignited on a Baltimore stage<br />\nbefitting a group wishing to be<br />\nla tie<br />\nIl MEMNE IMEMIEL<br />\nHigher Studies of the Faculty of There were 35 undergradriates.<br />\nDR. JOSEPH C. BLOODGOOD<br />\ncome December the fourteenth. Final<br />\ncalled gentlemen. The agreement<br />\nThe graduates held degrees from<br />\nPhilosophy, 148; School of Higher<br />\ndecision to produce the Edwin Mayer<br />\nstates that on \"Open House\" days,<br />\n25<br />\ninstitutions. Five of those holdStudies in Education, 31; School of<br />\nplay, which was a Broadway hit ten<br />\n\"entertainment must be confined to<br />\nHygiene, 20; and School of Medicine, ing the diploma of Doctor of Philosyears ago, was made only yesterday.<br />\nophy had done their advanced work the Hopkins chapter house.\" The lat58, making 827 out of a total enrollFirst tryouts were held last night.<br />\nin Germany; 14 of those who entered ter section was flouted before all of<br />\nment for these schools of 1,562, or had<br />\nSucceeding rehearsals will be held<br />\nreceived the degree of Doctor of the chapters on the Hopkins campus.<br />\n52<br />\nper cent. The others represent 43 Medicine from the University of This is no small matter at the Hopevery Tuesday and Thursday at<br />\nstates and the District of Columbia Maryland; there were 3 graduates kins, one of the few universities en7.30 p. m.<br />\nand 21 foreign countries. Last year from each of the following, Am- joying a successful Honor System.<br />\nBenvenuto Cellini, artist, poet, and<br />\nThe least the Interfraternity Board<br />\nherst, Cornell, Princeton, Yale and<br />\nthe leading confession writer of his Cancer Expert Was For Long in the same schools 55 per cent of the University of<br />\nVirginia; 2 came can do is remind the Phi Gamma and<br />\nthe students came from Maryland,<br />\nthe campus, that the action of the<br />\ntime, is the bright star of the plot<br />\nTime Associated With the and 45 per cent from 43 states and came from Harvard, 2 from Lafay- condemned<br />\nchapter is \"unbecoming a<br />\nette and 2 from Washington and Lee.<br />\nand, though Beni:Tenuto might not be<br />\nHopkins Medical School the District of Columbia and 27 for- The others came from 12 other gentleman\" and \"prejudicial to the<br />\nfavorably impressed by the author's<br />\neign countries.<br />\nhonor of the University.\"<br />\nAmerican institutions.<br />\nestimate of his character, the genDr. Joseph Colt Bloodgood, interIn the afternoon and evening classIt is regrettable the Board has not<br />\nFifty-seven<br />\nof<br />\nthe<br />\nstudents came<br />\neral public has made it one of the nationally known surgeon and the es the enrollment is larger than it was<br />\nthe power necessary to mete out defrom homes in Maryland. There were<br />\nA short director of the Hopkins laboratory last year, and it is believed that the<br />\nserved punishment.<br />\nstage's hardy perennials.<br />\n6 each from MassachuSetts and Virhis<br />\ndied<br />\nat<br />\npathology,<br />\nof<br />\nsurgical<br />\naverage<br />\nnumber<br />\nof<br />\ncourses<br />\ntaken<br />\nby<br />\nWe, the undersigned fraternities,<br />\nsnatched<br />\nmoguls<br />\nmovie<br />\ntime ago the<br />\nginia; 3 each from Illinois, New York<br />\nhome in Guilford last Monday even- each student is also larger, although<br />\nas members of the Interfraternity<br />\nto<br />\nburning<br />\nthe<br />\nand Pennsylvania; 2 each from Calithe \"brand\" from<br />\nThe two men who didn't sign reping, October 22.<br />\ndefinite information on this point is<br />\nBoard of the Johns Hopkins Univerfornia, Kentucky and Indiana; and<br />\ntorm a basis for \"The Affairs of Celresented<br />\nthe Phi Gams, and the BeDr. Bloodgood was sixty-seven not yet available. There has been a<br />\nsity, wish to state that the Phi Gamone each from Connecticut, Iowa,<br />\nlini.\" Admirers of the other sex will years old and had been in ill-health distinct trend in this direction during<br />\nma Delta Fraternity has broken its tas. This latter group was also reNew Jersey, North Carolina and<br />\nrecent years owing to the increasing<br />\npledge to the Board. We alsd wish cently cited by the Board for an infind Cellini a man after their own for more than a year.<br />\nSouth<br />\nCarolina.<br />\nDr.<br />\ndeath<br />\nhis<br />\ntime<br />\nof<br />\nthe<br />\nuntil<br />\nUp<br />\ndegree<br />\ncandidates<br />\nfor<br />\nthe<br />\nnumber<br />\nof<br />\nto condemn this chapter, and warn fraction of the rules.<br />\nthan<br />\nhearts, for there are no less<br />\nAt that time there was no Medi- the<br />\nBloodgood took an active interest in of Bachelor of Science.<br />\nQuestioned On Steps<br />\nmembers of the Freshman Class<br />\nfive feminine parts.<br />\nfighting cancer and in organizations<br />\nbe impossible to find a cal School, no School of Hygiene, no that Phi Gam has openly and flaWhen questioned concerning posIt<br />\nwould<br />\nTentative choice of \"The Fire- for its prevention and cure.<br />\nfree hour from 8.30 in the morning School of Engineering and no School grantly violated its honor by retract- sible steps which they might take<br />\nbrand\" was announced at the first<br />\nTaught Classes<br />\nuntil 10 at night, for classes meet of Education. The Faculty of Phil- ing its promise to the other chapters against the violators, the members of<br />\nBarnstormers' rally held last MonHe taught classes at the Johns continuously through the day.<br />\nosophy, comprising both graduate on the campus, and that it has not the Board seemed to feel that there<br />\nday. Approximately fifty persons Hopkins University School of Medand undergraduate students, was the acted in a manner befitting Hopkins was no use in trying to impose any<br />\nOn<br />\nthe<br />\nevening<br />\nof<br />\nOctober<br />\n3,<br />\n1876,<br />\nattended. A short dramatic effort icine and was chief surgeon at St.<br />\ngentlemen.<br />\nPresident Gilman addressed the trus- original university organization.<br />\npunishment whatsoever, because of<br />\nand speeches by leading 'Stormer Agnes Hospital.<br />\n(Signed) Alpha Delta Phi, Alpha their complete inability to enforce it.<br />\nfigures featured the program.<br />\nThrough publicity Dr. Bloodgood<br />\nTau Omega, Delta Phi, Delta Up\\si(Editor's note: The InterfraIn the first address, Dr. N. Bryl- fought the dread disease of which he<br />\nIon, Kappa Alpha, Kappa Sigma, Omternity Board has no means of<br />\nlion Fagin, director of the Playshop, was a recognized authority. His adicron Kappa Omicron, Phi Kappa Psi,<br />\nenforcing its dictums because it<br />\nstressed particularly the connection dresses were widely quoted in magSigma Phi Epsilon, Tau Alpha Phi.<br />\nis not vested with sufficient<br />\nbetween the Barnstormers'-and his azines and newspapers.<br />\npower by the member fraterniown organization. With proper supHe felt, however, that education Socialist, Speaking At Assembly, Address Features First Dance Of<br />\nties and the fraternities are not<br />\ncould,<br />\nboth<br />\nport from the students,<br />\nof the public was only half of the batYear; Program Includes Musical<br />\nUrges Youth To Use Own Judgrecognized by the University.)<br />\nhe said, be valuable proving-grounds tle which he waged against cancer.<br />\nment In Following Destinies<br />\nSelections By Students<br />\nBecause of the helplessness of the<br />\nfor more advanced studies. Dr. Fa- Equally necessary was the spreading<br />\n\"Graduate students belong to a<br />\nBoard in this crisis, rumor has it<br />\ngin closed with an appeal for stu- of knowledge of the latest methods<br />\nClaiming that the older men<br />\nvery special biological species,\" acThe second annual Johns Hopkins that Phi Gamma Delta will be boydent interest in this year's Playshop of diagnosis among physicians, surand women have made a mess of<br />\ncording to Dr. Isaiah Bowman, Pres- University Gymboree will be held cotted by all fraternity-controlled<br />\nprogram or, as he termed it, \"Bal- geons and x-ray specialists.<br />\ntheir job, Dr Broadus Mithcell called<br />\nident of the University, in his talk to Wednesday, December 18, at the activities oh the campus, with the<br />\ntimore's best theatrical buy.\"<br />\nBorn In Milwaukee<br />\non the youth, represented by the<br />\nFollowing the presentation of \"The<br />\nDr. Bloodgood was born at Mil- freshmen and sophomores at the as- the graduate students assembled in gymnasium. This event was inaug- consequences that any students who<br />\nLevering Hall last Friday evening for urated last year in order to raise do pledge Phi Gam, will have very<br />\nLighthouse Keeper's Daughter,\" a waukee on November 1, 1867. He<br />\nsembly, yesterday, to think for<br />\nthe first dance of the year. He de- funds with which to purchase sweat- little chance of making any activihighly dramatic pantomime, Sears was the scion of a family prominent<br />\nthemselves and not to follow the<br />\nclared that graduate students be- ers for the men on the varsity foot- ties.<br />\nintroduced Mr. Paul Hinrichs, new- as lawyers. He was graduated from<br />\nreasoning and advice given by himlonged to the class which actively ball team.<br />\n1)<br />\n(Continued on Page 4, Col.<br />\nMany fraternity men feel that this<br />\nthe University of Wisconsin in 1888<br />\nself and by others.<br />\ngoes after what it wants, preparing<br />\nwith the degree of bachelor of science<br />\nThe Athletic Department has start- infraction will be a very important<br />\n\"Because,\" he said, \" these very itself to lead a more active life.<br />\nand received the degree of doctor of<br />\ned work on the project, and its next factor in causing the University ofare responsible for the greatHe said that during the last year step will be to ask Omicron Delta ficials to take an active hand in framedicine from University of Penn- people<br />\nwar and its worst depression in he has worked with two groups of<br />\nsylvania in 1891. The following year est<br />\nKappa, the national honorary activ- ternity affairs. An authoritative<br />\nthe<br />\nhistory of the world.\" Why, men: those in, the physical sciences,<br />\nassistant<br />\nBaltimore<br />\nas<br />\nity fraternity, to take charge of the source stated that the Administrahe came to<br />\nthen, should the youth of today fol-- who were objective and showed little<br />\nresident surgeon in the Johns Hopaffair's financial end as well as act tion had been approached before the<br />\nOrganizations<br />\nCampus<br />\nOf<br />\nHeads<br />\nlow in the footsteps of the people of themselves, and those in the social<br />\nas the sponsor.<br />\npresent crisis, but had decided to<br />\nkins Hospital, where his career cenMust Turn In List Of Seniors<br />\nwho had made such a mess of sciences who were more interesting as<br />\nwait until next year, because the<br />\ntered.<br />\nVariety<br />\nOf<br />\nEvents<br />\nFor<br />\nVarsity<br />\nSeal<br />\nEligible<br />\nthings?<br />\nhuman beings and had minds stored<br />\npresent rushing season is almost<br />\nAlthough nothing is definite a;<br />\nYouth Administration<br />\nwith richer cultural experiences.<br />\nyet, the Gymboree will probably in- over.<br />\nThe Student Activities Committee<br />\nsome<br />\nthat<br />\nDr.<br />\nBowman<br />\nstated<br />\nThe \"Youth Administration\" is a<br />\nclude exhibitions in boxing, wresthas announced that Varsity Seals<br />\nplan by which older men and women students had never learned to distinling, badminton, tumbling, and a<br />\nwill be awarded in about six weeks to<br />\nobjects<br />\nDr. Hubbard Believes<br />\nare trying, with the powerful help of guish themselves from the<br />\nbasketball game between Hopkins<br />\nthose seniors who have earned them.<br />\ngovernment money, to direct the lives that they were studying. \"If I were and<br />\nsome<br />\nother club.<br />\nIn Realistic Examples<br />\nFor the benefit of new students at<br />\nThe National Research Council<br />\nof youngsters. Particularly the at- preaching a sermon,\" he stated, \"I<br />\nthe Johns Hopkins, John Macgill, the has awarded a grant to Dr. J. A.<br />\nThe exhibitions will be between<br />\ngradas<br />\non<br />\nyou<br />\nwould<br />\ntry<br />\nto<br />\nimpress<br />\ntempt to rescue youth from the<br />\nDr. J. C. Hubbard, professor of<br />\nchairman of the committee, again Bearden of the University departeither individuals from the different<br />\nblight of unemployment, and to open uate students the value of making<br />\naward.<br />\nPhysics, believes in impressing his<br />\nstudy<br />\nthe<br />\nfurther<br />\ngave the requirements for<br />\nclasses or from the various fraterniment of physics for a<br />\nthat<br />\ndistinction.\"<br />\nsome kind of future before the \"risstudents with the value of the<br />\nties.<br />\nSeniors taking part in their fourth of the electronic charge. Since 1929 ing\" generation which threatens<br />\nThe President remarked that the<br />\ntopic under consideration.<br />\nyear of a given non-athletic activity Doctor Bearden has been making a otherwise to be sunk.<br />\noutstanding difference between unAt a lecture to his IC Physics<br />\ndetermethoi<br />\nof<br />\nx-ray<br />\nthe<br />\nof<br />\nstudy<br />\nare eligible to receive the Seal. The<br />\ndergraduates and those in the gradu- Umbarger Named Business<br />\n(Continued on Page 4, Col. 1)<br />\nclass, recently, Dr. Hubbard cast<br />\nheads of the various activities will mining the exact charge on the elecate school was the fact that the latManager Of Musical Club about trying to find some apt exsubmit to the S. A. C. lists of eligible tron. His experiments have led to a<br />\nter had introduced into life their<br />\npression with which to illustrate<br />\nseniors. The S. A. C. will then check definite conclusion that there is a Council To Require<br />\nknowledge and interpretation of what<br />\nthe subject of acceleration. After<br />\nPaul Umbarger was given the<br />\nthe lists for names of questionable considerable difference between the<br />\nDues Paid To Vote they saw around them. \"Judgment office of business manager<br />\nthinking a few moments he said,<br />\nof<br />\nthe<br />\nnominees. Names of these men will be results obtained by the x-ray method<br />\ngrows with time, and experience<br />\nvery seriously.<br />\nMusical Club by the board of control<br />\npublicly posted, and the men will be and the oil-drop system as used by<br />\nbroadens judgment. A graduate stuvote<br />\nin<br />\nthe<br />\nvarito<br />\neligible<br />\n\"To<br />\nbe<br />\n\"If you ever happen to fall from<br />\nCalthe<br />\nof<br />\nMillikan<br />\nof<br />\nA.<br />\nthe<br />\nR.<br />\nProfessor<br />\ngroup<br />\nfor<br />\nMonday<br />\nC.<br />\nnight.<br />\nA.<br />\nOffices<br />\nS.<br />\nrequired to report to the<br />\ndent can't get far in the seasoning,<br />\nous class elections, which will be held<br />\nthe top of the Empire State Buildof<br />\njunior<br />\nbusiness<br />\nifornia Institute of Technology.<br />\nmanagers<br />\nwere<br />\nan interview.<br />\nbut he learns that it is there.\"<br />\ning with a stop watch in your<br />\ngiven to John Canning and Jack<br />\nThe grant from. the National Re- early in November by the Student<br />\nOne-star Seals will be awarded for<br />\n(Continued on Page 4, Col. 2)<br />\nMead<br />\ndeclared<br />\nD.<br />\nJohnson,<br />\nCouncil,\"<br />\nhand, you will easily be able to<br />\nSteepers, both juniors.<br />\nparticipation in one activity; with ad- search Council is to be used for a<br />\nprove that the distance you fall<br />\nAlthough Umbarger is a member<br />\nditional stars for more than one ac- complete repetition of the oil-drop president of the Council, \"students<br />\ntheir class dues. The fees FAGIN ADDRESSES \"Y\" CLUB of the junior class, he was given the<br />\neach succeeding second will be<br />\ntivity. Heads of organizations in experiment under more refined con- must pay<br />\n, by counting the number of<br />\nDr. N. Bryllon Fagin, director of position because he plans to leave<br />\ntheir fourth year of the work will be ditions than previously employed. may be submitted at the Postoffice.\"<br />\nstories<br />\nthat pass in each second.<br />\napparatus<br />\nprecision<br />\nsophomore<br />\nFreshman<br />\nand<br />\ndues<br />\nare<br />\nspecial<br />\nhigh<br />\nthe<br />\nJohns<br />\nHopkins<br />\nThe<br />\nthe<br />\nUniversity<br />\nat<br />\nPlayshop,<br />\nwill<br />\nthe<br />\nend<br />\nof<br />\nthis<br />\nSeal.<br />\ngiven a two-star<br />\nOne bright student wanted to<br />\nThe Varsity Seal consists.of a rec- needed has been designed and is in two dollars, while members of the 'discuss the latest plays before a year.<br />\nBenjamin Futernick, also a junior, know what he should do if the<br />\ntangular gold charm with the Seal the process of construction by Mr. C. Junior Class pay three dollars. As meeting of the International Lunchof the University superimpOsed there- T. Hill of the physics shop with the yet, no figure has been named for eon Club, at 12.30 today in Levering was appointed to special office of stop-watch stopped.<br />\nthe seniors.<br />\nHall.<br />\nhelp of assistants.<br />\npublicity manager.<br />\non.<br /><br />\nDr. Bloodgood Dies<br />\nAt Home On Monday<br />\nAfter Long illness<br /><br />\nMitchell Condemns Dr. Bowman Speaks<br />\nOlder Generation Tio Grad Students<br /><br />\nAnnualGymboreeTo<br />\nBe HeldDecember18<br /><br />\nS. A. C. To Award<br />\nSeals In Six Weeks<br /><br />\nGrant Awarded To<br />\nDr. J. A. Bearden<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD.,OCTOBER 25, 1935.<br /><br />\nCIjc<br /><br />\ncW8=LCttU<br />\nFounded 1897<br /><br />\nDEAF, DUMB, AND BLIND I So They Say<br /><br />\nVIEWS AND REVIEWS<br /><br />\nBy HAROLD M. KROPMAN<br /><br />\n\"William Allen White says that the<br />\nFORD'S<br />\nNEW THEATRE<br />\nRepublicans must not abolish the N.<br />\nThe big stage hit, Three Men on a<br />\nSo<br />\nconvincin<br />\ngly did Margaret HamD., but fix it up and make it work.<br />\nThen.put up a sign: 'Used Deal, Bet- Horse, will gallop into Ford's Thea- ilton play her role in A Farmer Takes<br />\nter Than New'.\"—Howard Brau- tre, Baltimore, tonight for an unusual A Wife, that Fox Film officials imRemit subscription fees to Treasurer, Student Acbaker.<br />\nlaugh engagement of eleven per- mediately signed her for an importivities Council, Remsen Hall, Postoffice, Johns Hoptant role in the film version of that<br />\nkins University.<br />\nformances, including matinees on<br />\n*<br />\n*<br />\n*<br />\ngreat American melodrama, Way<br />\nEntered as second-class matter December 3, 1909,<br />\n\"Despite the improvement in bus- Wednesday and Saturdays. On New Down East, which is now at the New<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\niness, unemployment has declined Year's Day last, Three Men on a Theatre.<br />\nCongress, November 3, 1879.<br />\nonly 3.2 per cent in the last year. Horse was just another show coming<br />\nMiss Hamilton is given ample opMaybe after all we should have let to Broadway. It opened—a<br />\nPublished semi-weekly from October to June, exsmash hit, portunity to display her ability in<br />\nHoover abolish poverty that time he<br />\ncept during examination and college holiday periods<br />\nand it's still there selling out nightly. her role as a malicious gossip in the<br />\noffered<br />\nto.\"—The New Yorker.<br />\npicture, which co-stars Henry Fonby undergraduates of the Johns Hopkins University.<br />\nA second company opened in Chicada, and Rochelle Hudson.<br />\n*<br />\n*<br />\n*<br />\ngo, a third on the Pacific Coast, and<br />\nIn Way Down East, Miss Hamilo—o<br />\nEDITORIAL DEPARTMENT<br />\n\"Kansas City—Psychologist Albert now the Boston company,<br />\nwith the ton's vigorous character is brought<br />\nE. Wiggam says chorus girls are not best known cast<br />\nWords of the Departed:<br />\nat Ford's, represents to the fore in her role as the neighEditor-in-Chief<br />\nJesse N. Borden<br />\nFrom Lou Reuling, Junior Class President, treasurer so dumb and cites Kay English, for- the peak of Broadwa<br />\ny—Hume Cronyn, borhood gossip. She brings calamity<br />\nManaging Editor<br />\nIrving Leberfeld<br />\nof Cotillion Board, and lacrosse star last year, comes mer Ziegfeld beauty and film play- Betty Field, Harry<br />\nDavenport, Jean about the shoulders of a girl trying<br />\nWilliam Diamond, Stanley M Finkel,<br />\na letter to John Murphy. Reuling is studying (supposed er, as an example. Her intelligencc Casto, Henry Norrell,<br />\nand others of to live down the disgrace of her past.<br />\nAssistant Managing Editors<br />\nto) in Germany . . . I Would have written sooner but I quotient is 168. The average colleg,- name and reputation<br />\n. The authors<br />\nKenneth Zierler<br />\nSports Editor<br />\nWay Down East, which was prowas off on a bicycle trip for ten days. In the little vil- an's is 129.\"--Evening Sun.<br />\n—George Abbott, and John Cecil duced by Winfield<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nSheehan, features<br />\nlages the cows and the peasants live together . . . I<br />\nHolm—have hit upon a great farcical Slim Summerville,<br />\nFeature Editor<br />\n*<br />\nEdgar Kemler<br />\n*<br />\n*<br />\nEdward Trevor<br />\nstayed this time in the Gugend herberge for twelve<br />\nidea in Three Men on a Horse, and and Andy<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nDevine<br />\nin<br />\nthe supporting<br />\ncents a night. They're plenty clean—shower baths, flush<br />\n\"The Italians must have home re- what is more, they<br />\nhave developed cast.<br />\nColumnists<br />\ntoilets, and all modern conveniences . . . I haven't done spect for American public opinion. it entertainingly.<br />\nThe story conBUSINESS DEPARTMENT<br />\nmuch in the way of wild times since the University is They started their invasion on the cerns the adventure<br />\ns of one Erwin<br />\nBOULEVARD<br />\nnot yet open, and I am not acquainted with student opening day of the World Series, Trowbridge, a<br />\nmousey individual,<br />\nBusiness Manager<br />\nDavid H. Levy<br />\nlife. Every once in a while I get the willies, buy a liter when it would not be noticed much.'' who earns his livelihood<br />\nFor<br />\ntoday<br />\nand tomorrow, the<br />\nAdvertising Manager<br />\nby writing<br />\nRobert Watkins<br />\nor two of wine, sit home and get a bun on. The little —The New Yorker.<br />\nBoulevard<br />\nTheatre<br />\nwill offer to its<br />\njingles<br />\nfor<br />\ngreeting<br />\ncards. For his<br />\nCirculation Manager<br />\nRobert Levi<br />\nfraulein who lives here has the most wonderful figure I<br />\nown amusement Erwin figured out patrons, the widely acclaimed cineOffice Manager<br />\nWilliam Kempton<br />\nhave ever seen. She has been engaged to one guy for<br />\na way of beating the horses, and dis- matic success, Diamond Jim. CharacMelville Locker<br />\nCopy and Filing Manager<br />\nseven years . . . Saw the fort where Johann Gottfried<br />\ncovers he has made tremendous prof- ters of the gay 'nineties, the most<br />\nHans Joseph Von Kunkel was in prison. I don't see<br />\nits—on paper. What with a kidnap- colorful and romantic period in the<br />\nBUSINESS STAFF<br />\nhow our old friend Kunkel escaped . . . imagine panMr. Maxwell Sauerwein is now ping and a dizzy blonde added, the history of the United States, come to<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\ncakes with cucumber salad and potatoes for lunch.<br />\nlife in Universal's special production,<br />\nbusiness manager<br />\nand<br />\nassistant ending is gloriously cockeyed.<br />\nN. Soifer, S. Tinley<br />\nDiamond Jim. The story deals wth<br />\ntreasurer.<br />\nThe<br />\npost<br />\nof<br />\n0-0<br />\nassistant<br />\nthe life of Jas. Buchanan Brady, the<br />\ntreasurer and burser is held by Mr.<br />\nLITTLE THEATRE<br />\nFrom the \"Redbook\" magazine comes a letter to our Henry<br />\nFriday, October 25, 1935<br />\nman who made the gay nineties gay,<br />\nIddins and Mr. John H. Gildear Editor, Jesse . ..<br />\nThe long-heralded opus that Gau- and. is in reality the<br />\nliece is auditor.<br />\nportrait of an<br />\nDear Editor:<br />\nmont-British announces on the eve of era.<br />\n*<br />\n*<br />\n*<br />\nHave you a campus marriage problem?<br />\ntheir first anniversary in America—<br />\nBeginning Sunday, the feature picFlorence Haxton Britten tells, in \"Marriages a la<br />\nDr. Ruth S. Lynch, who was in- Transatlantic Tunnel—will finally re- ture will ,be Claudette<br />\nColbert in She<br />\nIt would not be consistent to say that we were sur- Campus,\" what presidents and deans of colleges<br />\nall structor in zoology at the University, ceive its American premiere on Sat- Married Her Boss. This picture<br />\nurday,<br />\nOctober<br />\nprised by the violation of the Interfraternity Board over the country are doing about it . . . etc.<br />\n26,<br />\nat<br />\nhas resigned, and is now head of the<br />\nthe Little The- caused quite a<br />\npleasant sensation in<br />\n(I wonder if this letter happens to just hit the spot Department of Biology<br />\natre, Baltimore. This epic of man's<br />\nRushing agreement. Since the organization of the<br />\nNew York, and many critics are of<br />\nat the Maryvision<br />\n—Arrow Beer thanks.)<br />\nof<br />\na<br />\ndream<br />\ncome<br />\ntrue--a tun- the opinion<br />\nland State Teachers College, Towson,<br />\nBoard is such that it has no means of enforcing its<br />\nthat Miss Colbert's pernel under the Atlantic Ocean from<br />\nMd.<br />\no—o<br />\nformance in She , Married Her Boss<br />\ndecrees, it is only to be expected that infractions will<br />\nLondon<br />\nto<br />\nNew<br />\nYork by way of the surpasses<br />\nOn our beautiful campus, we have the girls of the<br />\n*<br />\n*<br />\nthat of It Happened One<br />\n*<br />\noccur. But although we expect them, they always cause Teachers<br />\nAzores and Bermuda—has been realCollege, organized into a club, which last year<br />\nNight. Selected short •subjects will<br />\nDr.<br />\nized<br />\nG.<br />\ndisappoin<br />\nthey<br />\nwhen<br />\nin<br />\ndisgust<br />\ndo<br />\nW.<br />\nthis highly imaginative spec- round<br />\ntment and<br />\na feeling of<br />\nClemens, formerly an inpromised to be a blight, but which surprised all conout the program.<br />\ncerned, including most of all its members, by carrying structor in German at Johns Hopkins tacle set in the year 1950.<br />\nhappen.<br />\nUniversity<br />\nAdapted from the novel, The Tun, has resigned and is now<br />\nout a rather worthy cause. This year they have reKEITH'S<br />\nThe Rushing Pact has been referred to as a \"gen- newed<br />\nactivities, re-electd Rose Hecht, president, gave professor of German at Hartwich nel, by Bernhard Kellerman, GB's<br />\nYesterday brought to Keith's TheCollege.<br />\nmillion-dollar production bids fair to<br />\ntleman's agreement.\" And although we recognize its a tea Thursday in honor of Dr. Bowman,<br />\natre a picture in which the Middle<br />\nDr. Bamberger,<br />\nestablish new standards of motionimpracticability in reference to rushing, the fact re- and Miss Coard, his secretary, who has announced her<br />\n*<br />\n*<br />\n*<br />\nAges live again in shining romance<br />\npicture spectacle for the world.<br />\nand<br />\nthrilling spectacle, The Crusades.<br />\nmains that every fraternity gave its word to abide by engagement. Seems a shame when we think of all the<br />\nDr. Jonas Friedenwald, Associate<br />\nThe cast of Transatlantic Tunnel<br />\nyears Dr. Bowman and Dr. Bamberger spent in reachThis picture was directed by Cecil B.<br />\nthe regulations.<br />\nProfessor of Ophthalmology at the includes Richard Dix, Leslie<br />\nBanks, DeMille, and came<br />\ning the heights reach by Miss Coard in one little act.<br />\ndirect from a $2Johns Hopkins Medical School, has Helen Vinson, Madge<br />\nEvans,<br />\nC.<br />\nAu- a-seat run in New York,<br />\nvery<br />\nDeltas<br />\nGamma<br />\npea<br />\nis<br />\nThe case of the Phi<br />\nPhiladelbeen<br />\ngranted<br />\nleave of absence for brey Smith Basil Sidney, George Ar0-0<br />\nphia, and Washington. Loretta Young<br />\nculiar one. Its membership list includes a number of<br />\nthe third and fourth quarters of this liss, and Walter Houston.<br />\nand Henry Wilcoxon share the lead<br />\nAmong my mail—<br />\nyear. He is to lecture at the Hebrew<br />\nthe outstanding men on the campus. But most peculiar<br />\nIn Transatlantic Tunnel, television,<br />\nroles. They are ably supported by<br />\nUniversity in Palestine.<br />\nWashington, D. C.<br />\nplanes that cross the Atlantic in a<br />\nof all is the paradoxical situation of having the PresiIan Keith, Katherie DeMille, C. Aufew hours, high speed automobiles,<br />\nOctober 15, 1935<br />\n*<br />\n*<br />\n*<br />\ndent of the Student Council and the chairman of the<br />\nbrey Smith, and Joseph Schildkraut.<br />\nDear Harold,<br />\nand other startling innovations are<br />\nThere is a cast of 10,000 in this picStudents Activities Council, both Phi Gams, apparently<br />\nA leave of absence until January,<br />\nrealities.<br />\nA certain event happened on campus at George 1936, has<br />\nture.<br />\nbeen issued to Dr. V. A.<br />\nsanctioning a breach of the Interfraternity Board rules,<br />\nWashington, which I thought might be of interest to Var<br />\nThe city of Fonda, New York, was<br />\nVolkenbur<br />\ngh,<br />\nAssociate<br />\nProfesand a gentleman's agreement. These men, who occupy you. Phi Sigma<br />\nSigma Sorority gave a dance and a sor of Epidim.iology,<br />\nGeorge Arliss and Walter Houston founded by the Dutch ancestors of<br />\nto<br />\nenable<br />\nhim<br />\nto<br />\nthe two most important positions among the under- most unusual event occurred. A certain girl wearing<br />\na act as Assistant District Health Of- donated their services free in the Henry Fonda, film actor.<br />\ngraduates should be the very last to become involved in red dress had a mishap. She had a slit all the way ficer fOr New<br />\nTransatlantic Tunnel.<br />\nYork State.<br />\n—J. S.<br />\ndown the front of her dress, and when she crossed<br />\nsuch an affair.<br />\n*<br />\n*<br />\n*<br />\nher legs it automatically fell apart. Another girl's esIn the final analysis, the whole matter boils down to cort got up in the middle of the room and<br />\nDr. A. W. Hedrich has been grantstarted clapthe powerlessness of the Board. Because of the general ping his hands to attract attention. He certainly did, to ed a leave of absence for the rest of<br />\ncontempt for the power of the Board, many men are the amazement of several hundred people on the floor, the Academic year. The Associate in<br />\nincluding the most shocked girl wearing the dress.<br />\nWas Biostatistics is to continue work on<br />\napt to overlook the importance of having some authorher face red? I leave that to your imagination.<br />\na chronic disease survey for the<br />\nity to regulate rushing. The need for such a group is<br />\nUnited States Public Health Service.<br />\nSigned,<br />\nHOME<br />\nevident. Freshmen should be given a chance to become<br />\nAn anonomous reader of your gossip column.<br />\n*<br />\n*<br />\n*<br />\nacclimated before they are pledged to a frat. If open<br />\nP. S.—If this be printed give the credit to me. (Six<br />\nA four-year scholarship in Gas Enrushing were the rule, the Freshmen would have no op- credits to anonamous.)<br />\ngineering, valued at $450, has been<br />\nacquainte<br />\nportunity to visit fraternities and become<br />\nd<br />\ngiven the Johns Hopkins University<br />\n0-0<br />\nwith the men they were going to choose as their intiby the Philadelphia Electric ComTo those upperclassmen who have missed the charmpany.<br />\nmate friends for the remainder of their stay at college.<br />\ning presence of Miss Frances Jordan, librarian<br />\nin the<br />\nNo doubt, the house putting up the best front would get main reading<br />\nroom, I wish to make known that she Las<br />\nthe lion's share of the pledges.<br />\nbeen taken sick, and is recuperating in Ashville.<br />\nNo<br />\nadulations of her efficiency and personality is necesThis affair will probably convince the administrasary, but only many wishes for a very fast recovery<br />\nand<br />\ntion that there is definite need for action to strengthen return.<br />\nthe Interfraternity Board. The events of the past two<br />\nTo the Editor of the NEWS-LE-rrER<br />\n0--0<br />\nyears have all pointed toward a complete breakdown in<br />\nDear sir:<br />\nthe present system. The breakdown is now a reality. A weaker moment:<br />\n---\\<br />\nPerhaps, and more than likely, the<br />\nMost girls go to parties with the idea of meeting<br />\nWe hope that future Interfraternity Boards will profit<br />\nsubject I am, going to discuss has<br />\nCOLLEGE<br />\nsome nice interesting man; but nine times out<br />\nof ten been brought up and<br />\nby the unhappy example of the present board.<br />\nsettled<br />\nbefore<br />\nto<br />\ncasual, accidental meetings prove to form more<br />\nlasting the satisfaction of<br />\nall concerned. If<br />\nfriendships. Somehow, a girl loses something<br />\nin at- so, I humbly beg<br />\nyour pardon for entractiveness when she is out on parade or<br />\nout for croaching on your<br />\ntime.<br />\nconquest.<br />\nI find the drinking-water facilities<br />\non this campus adequate but open<br />\nWe'll call for it, whisk it away<br />\nIt isn't often that Baltimoreans get a chance to<br />\nThe figures tabulated below are the results<br />\nto criticism. In the first place, why<br />\nof a<br />\nand<br />\nbring it back again. Railway<br />\ndance to the music of the nation's outstanding orches- questionnaire conducted by the<br />\nTerra Mariae, the year does one have to spend a penny<br />\nbook<br />\nExpress<br />\nservice is safe, swift<br />\nof the University of Maryland.<br />\ntras. Consequently, the Cotillion Board's announcement<br />\nwhenever he wants to quench his<br />\nThe<br />\nthirst?<br />\naverage<br />\nMore<br />\ncoed<br />\noften<br />\nhas approximately 6 dates a month.<br />\nthat it has secured Benny Goodman's orchestra for the<br />\nthan not a perand sure. Economical, too—<br />\nOn the other hand, the male goes out on<br />\nson finds himself without the copper<br />\nThanksgiving Cotillion has been enthusiastically reaverage of<br />\nrates are low—and our \"send9.5 times per month. Seventy-five per cent<br />\nof the girls coin. Provided he does have other<br />\nceived by the students.<br />\ning-it-collect\"<br />\nservice is particsmoke. Five per cent drink beverages stronger<br />\nchange, the difficulty in securing the<br />\nTUNE IN ON THE<br />\nthan<br />\nPARADE<br />\nRAILWAY<br />\nNEWS<br />\nEXPRESS<br />\ncringer<br />\nproper<br />\npopular.<br />\nale.<br />\nularly<br />\nlucre<br />\nPrompt pick-up<br />\nAlmost 50 per cent of the young ladies admit<br />\nis so much wasted time<br />\nThe Board is to be congratulated on its initiative<br />\nEvery week from the Following stations:<br />\nthat they are not adverse to an occasional<br />\ndelivery<br />\nand<br />\nservice<br />\npetting party. and, I am sure, very irritating. This<br />\nin all imin securing Goodman for his first Baltimore appearKWK<br />\nWLS<br />\n•<br />\nWEEI•WOR•WIIK•<br />\nThe \"dream\" girl of the U. of M. man<br />\nsituation is most acute, many peoWDSU • WFAA • WGST •KYA•KNX<br />\nmust have,<br />\nportant<br />\nance. The large social functions at the University are<br />\ncities<br />\nand<br />\ntowns.<br />\n• For<br />\nfirst of all, physical attraction, intelligen<br />\nple will tell you, when you enter GilKSTP•KOMO•WBAL•KOIL<br />\nce, and a<br />\ncomparatively few in number during the school year. pleasing personality.<br />\nannouncemen<br />\nlocal<br />\nWatch<br />\nservice<br />\nts<br />\nfor<br />\nor<br />\ninformati<br />\ntelephone<br />\non<br />\nOther men want \"mixability,\" a man Hall after an R. 0. T. C. drill on<br />\na warm afternoon. It seems to me<br />\nMost of the activity is withheld until June Week. But good disposition, chastity, and understanding.<br />\nthat the University should provide<br />\nThe ideal man of the coed must be tall,<br />\nwe are certain that there is a demand on the campus<br />\nhandsome,<br />\nintelligent, and well mannered.<br />\nOther qualifications simple fountains that would satisfy<br />\nfor more \"big-time\" affairs during the year. Last seall. Everyone does not require a cup.<br />\nincluded ate neatness, loyalty, dancing ability,<br />\nand<br />\nCharles and Fayette St.<br />\nmester, the Barnstormers very hesitantly tried the exVErnon 0600<br />\nThe water is so cold, too, that one<br />\ngood financial standing.<br />\nperiment of giving two shows instead of the usual one.<br />\ndoes not drink very much and this<br />\nDancing and swimming are the hobbies of<br />\n45 per<br />\nreally. fails to quench his thirst. I<br />\nThe results were that the production was very well sup- cent of the coeds. One spends her spare time<br />\ncollecting<br />\nDepot Office: 203 E. Franklin St.—VErnon 0600—Baltimore, Md.<br />\nhandkerch<br />\niefs.<br />\nAnother<br />\nported and now the 'Stormers have decided to give<br />\ncollects fraternity pins. Among think anyone with common sense will<br />\nsay that ice-cold water is not the<br />\nthe boys, some brand of athletics is the<br />\ntwo plays again this year.<br />\noutstanding<br />\nmost healthful of beverages in the<br />\nhobby. Music, women and reading are also<br />\nmentioned.<br />\nworld.<br />\nHomewood could readily absorb more affairs. The<br />\nForty-five per cent of the coeds expect to get<br />\nmarWhoever is responsible for our<br />\nstudents are always ready to support a function which ried soon after being graduated. Seventy per cent are<br />\nwilling to work after the ceremony has been<br />\nhas some popular feature to attract them.<br />\nperformed. present drinking system is certainly<br />\nAGENCY INC.<br />\nThe favorite subject of the student body is<br />\nchemistry, a genius for bothersome modernism.<br />\nThe Cotillion Board has the right idea.<br />\nwith pharmacy a close second.<br />\nNATION-WIDE RAIL-AIR SERVICE<br />\nA FRESHMAN.<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nAfter reading that Jesse Borden and Dave Levy are<br />\ngoing to attend the Intercollegiate Newspaper Association convention, I happened upon a choicy morsel in<br />\nthe form of a convention circular, which sort of intimates that it won't be all work . . . \"and our date<br />\nbureau is being run by a blonde and a brunette—so,<br />\ngentlemen prefer what you may; and for the girls who<br />\ncome from them 'thar' girls' schools we have a handpicked stag line accepted and approved by the coeds<br />\nhere . . . The girls, or if you will, women, will be rooming in the apartments- of the Schenley and these quarters will be completely private. No men will be permitted in this section.\" Not even the house detective?<br /><br />\nI<br /><br />\nFACULTY NOTES'<br /><br />\nInterfraternity Board<br /><br />\nin.r[<br /><br />\nLETTERS TO<br />\nTHE EDITOR<br /><br />\nritto7<br /><br />\nSEND YOUR<br />\nLAUNDRY HOME<br /><br />\n7-<br /><br />\nLy RAI LWAY<br />\nEXPRESS<br /><br />\nThe Right Idea<br /><br />\n-411<br />\n,<br /><br />\nRAILWAY EXPRESS<br /><br />\nTr<br /><br />\nThE<br /><br />\nSki]<br />\nto<br /><br />\nSW.<br /><br />\n110C<br /><br />\nthu<br /><br />\ncell<br />\nCol<br />\ngre<br />\nfig]<br />\nbuE<br />\nin<br />\nthe<br />\nblo<br />\nAt<br />\nDoi<br />\nup<br />\nne‘<br />\nGa:<br /><br />\n'7<br />\narc<br />\ning<br />\nblo<br />\nAt<br />\noff<br />\ntea<br />\ntac<br />\nJa<br /><br />\nof<br />\ncro<br />\nGe<br />\nwh<br />\nga<br />\nof<br /><br />\nbut<br />\nGa<br />\niei<br />\ntm<br />\nth(<br />\nwa<br />\nPe<br />\ner<br />\nst<br />\ntai<br /><br />\n3<br /><br />\nHOME WOOD, BALTIMORE, MD.,OCTOBER 25, 1935.<br /><br />\nJay Eleven To Face Swarthmore Runners To Open Gas-Civils Wrest SPE Fraternity<br />\nSaturday Thrilling Contest Gets Turbyville<br />\nTomorrow In Battle Between Season<br />\nAgainst Lehigh From Opponents<br />\nTwo Evenly-Matched Teams Teams Meet At Bethlehem 6-0 Victory Gained In Hard- Athletic Trophy<br />\nTravel To Swarthmore For<br />\nSecond Tilt Of Season;<br />\nOptimistic Spirit Prevails<br /><br />\nHave Good Prospect<br /><br />\nJay Walks<br />\n_By KENNETH ZIERLER<br /><br />\nPlan For<br />\nj<br />\nIntramural League<br />\nLast week I mentioned thvit the<br /><br />\nExcellent Showing Against<br />\nWashington Squad Lends<br />\nConfidence, Experience<br />\nBy RED GLANTZ<br />\nCo North, young man, go North!<br />\nThat's what the Johns Hopkins pigskin carriers are doing. They're due<br />\nto play Swarthmore College at<br />\nSwarthmore, Penna., tomorrow afternoon. It's the seasonal clash, and big<br />\nthings will be done and seen.<br />\nThe Jay footballers, after an excellent showing against Washington<br />\nCollege, promise to display an even<br />\ngreater amount of precision and<br />\nfight. Coach George Darley has been<br />\nbusy ironing out the defects found<br />\nin the opening match, and has kept<br />\nthe future Tarzans at tackling and<br />\nblocking practice for the past week.<br />\nAt the field, all is hustle and bustle.<br />\nDoes Coach Darley have a trick card<br />\n1-1P his sleeve? Will he try out his<br />\nnew spinner reverse play against the<br />\nGarnets?<br />\nThe gridmen have been going<br />\naround with grim faces and a fighting look in their eyes. They're out for<br />\nblood this time, no doubt about that.<br />\nAt any rate, when the whistle goes<br />\noff for the kick-off and the two<br />\nteams meet for that first bodily contact, Swarthmore will know that the<br />\nJays are in the game.<br />\nGarnets Drop First Two<br />\nSwarthmore has a large number<br />\nof experienced men and a promising<br />\ncrop of new material. Of these, Coach<br />\nGeorge Pfann has molded a team<br />\nWhich, though losing its first two<br />\ngames, has displayed a good brand<br />\nOf ball even in defeat.<br />\nThe initial game of the year with<br />\nWashington College was lost 13-6,<br />\nbut it was a moral victory for the<br />\narnets, having held a much heavier and more experienced squad to<br />\ntwo touchdowns while scoring once<br />\nthemselves.<br />\nCamill \"Bud\" Peter<br />\nwas the outstanding star for the<br />\nPennsylvanians, breaking loose several times for substantial gains and<br />\nShowing himself to be a veritable<br />\ntartar on defense.<br /><br />\nG<br /><br />\nUpset By Dickinson<br />\nSwarthmore's second defeat was<br />\nsomething in the nature of an upset<br />\nWhen they lost to Dickinson, 14-7.<br />\nThe Pfannmen scored their only<br />\nMarker when Ben Cooper circled end<br />\nfor 72 yards and crossed the Dickinson goal line standing up after having received some nice blocking from<br />\nhis mates. For most of the contest,<br />\nhowever, the Garnet gridmen were<br />\non the defense, trying to stop the<br />\noff-tackle slants of Shore, Clark,<br />\nKiehl, and other Dickinson stalwarts.<br />\nSeveral disastrous fumbles halted<br />\nany threats that Swarthmore made<br />\nt?wards carrying on a sustained<br />\ndrive. The game was costly in that<br />\nDudley Perkins, star halfback and<br />\none of the most effective passers and<br />\nPunters on the squad was disabled.<br />\nHe suffered a recurrence of an old<br />\nknee injury, and it is doubtful that<br />\nlie will see any action this year.<br />\nThe Dickinson game showed a<br />\nConsiderable let-down in the quality<br />\nOf the ball displayed by the Pfann.inen. The tackling was ragged, the<br />\ninterference ineffective, and the general morale of the team lower than<br />\nthat exhibited against Washington.<br />\nTeams Evenly Matched<br /><br />\ninterfrat football league was functioning better than the intramural<br />\nleague, and I pointed out that the<br />\nreason was that the fraternities had<br />\na basis for morale in that they are<br />\neach an entity in which the players<br />\nstick together in all activities. With<br />\nthe exception of the New Jersey AllStars and, possibly one or two other<br />\nintramural teams, the organizations<br />\nare not well-knit.<br />\nIt seems strange that there can be<br />\nfound no ties of occupational loyalty<br />\nupon which to build intramural athletic competition when every AntiWar Strike reveals so plainly the<br />\nbreach between the engineers and the<br />\nA.B. men. It might not be a bad idea<br />\nto have an engineer's league, the<br />\nteams to fight for the honor of meeting the winner of an A.B. league and<br />\nbusiness league combined. In that<br />\nway some sort of continuity might<br />\nbe inserted into the system. Plaques<br />\nmight be offered to the winner of<br />\neach league and a trophy to the college with the highest total of points<br />\nin intercollege competition within the University, all awards to be<br />\ndisplayed in the office of the dean<br />\nof the winning college—arts or business or engineers. A college would<br />\nhave to win three legs on the trophy<br />\nto get permanent possession of it. In<br />\nsuch a fashion tradition may be<br />\nstarted and the intramural league be<br />\nbuilt up as intercollege leagues.<br />\n0—0<br /><br />\nCriticism Of<br />\nThe Plan<br />\nPerhaps the chief objection to the<br />\nplan I outlined above lies on ethical<br />\ngrounds. It may be argued that there<br />\nis already entirely too big a rupture<br />\nin the relations of. the engineers and<br />\nthe art.'s men. Since they take different courses in different sections of<br />\nthe campus for the most part, and<br />\nsince they even segregate in the matter of fraternities, the two sets of<br />\nmen have little to do with, one another. I think that the problem oT<br />\nmaking these two units realize that<br />\nthey are each a part of a single institution that stands out in the academic world—in any world, for that<br />\nmatter—as the epitome of the scientific attitude of open-mindedness and<br />\nof thorough investigation of facts, T.<br />\nthink that this problem is not beneath the consideration of the highest administrators at the Hopkins<br />\nFollowing that line, it may be<br />\npointed out that I would act upon<br />\nthe distinctions that already exist,<br />\nand would construct an even larger<br />\nbarrier between the two groups. I<br />\ncan't agree with that. As I see it,<br />\nthe source of the trouble is the lack<br />\nof contact between the engineers and<br />\nthe arts men. Playing football<br />\nagainst one another would certainly<br />\nbring them into close contact—in<br />\nmore than one way. When men meet<br />\nmen they didn't know well before in<br />\nsome game like football, they usually<br />\nget a new respect for them. I believe that this has been the case with<br />\nthe fraternities. Speaking as a fraternity man I can say that we have<br />\nyet to meet a team whose men we<br />\ndidn't think more of after playing<br />\nthem for the courage and sportsmanship they showed.<br /><br />\nFought Tilt; Alpha Delts Wins Award For Interfrat<br />\nWin In Frat League Race<br />\nAthletic<br />\nChampionship;<br />\nLeads<br />\nWith<br />\n330 Points<br />\nIn a closely-contested interclass<br /><br />\nTo Renew Cross-Country<br />\nFeud; Close Race Seen<br />\nThe Hopkins cross-country team<br />\nwill inaugurate its season tomorrow when it travels to Bethlehem,<br />\nPa., to engage the Lehigh harriers.<br />\nThe run will mark the first competition between the squads in the sport<br />\nsince 1931.<br />\nAccording to past results, a hardfought battle should be waged. The<br />\nJays captured the last encounter by<br />\nthe score of 27-28, when a Hopkins<br />\nrunner, Tom Neely, came up into<br />\neighth place in the last half-mile to<br />\ncapture the deciding point.<br />\nProbable Starters Picked<br />\nCoach Hambleton has not definitely<br />\npicked the starting squad, but six of<br />\nthe seven participants are rather<br />\ncertain of their places. Captain Emmert, Sholtes, Lyman, Bob and<br />\nGeorge Brown, and Moxley are the<br />\nleaders, while Castelle and Schultz<br />\nare engaged in a close struggle tor<br />\nthe other open position.<br />\nInjuries have taken their toll during the past week, with both Lyman<br />\nand Moxley suffering from turned<br />\nankles. However, they have been<br />\ntraining for several days, and should<br />\nbe in good shape tomorrow. Lack of<br />\npractice has also hurt the squad,<br />\nsince a great majority are engineers<br />\nand cannot allow much time from<br />\ntheir studies.<br />\nInterscholastics To Be Held Here<br />\nHambleton, in addition to coaching<br />\nthe cross-country team, has been<br />\nspending some time in plans for the<br />\ncoming annual interscholastic championships held at Homewood and<br />\nsponsored by the University chapter<br />\nof Spiked Shoe, national honorary<br />\ntrack fraternity.<br />\nBy all indications, the meet Will<br />\nattract a greater entry list than at<br />\nany time in the past. Letters have<br />\nbeen received from Syracuse Central,<br />\nnational individual<br />\nboasting the<br />\nchampionship. Knott Terrace, the<br />\nwinner of the team trophy, and Patterson Central is another powerful aggregation. The contest will take place<br />\non November 23 at 12 noon, and entry blanks are already obtainable<br />\nfrom Irving Leberfeld.<br /><br />\nYesterday, the Fred Turbyville<br />\nReinoldi, handed the Business Men a<br />\nTrophy for the Interfraternity Ath6 to 0 setback.<br />\nletic Championship was bestowed<br />\nFrom the first until the last blast<br />\nupon Sigma PM Epsilon.<br />\nof the whistle the game was a nip<br />\nAlthough S. P. E. won the trophy<br />\nand tuck affair. First the Business<br />\nlast year, it was not presented to<br />\nMen had the ball, then the Gas Civthem at the time. This delay was due<br />\nils took possession.<br />\nThis sort of to the fact<br />\nthat the plaque did not<br />\nwarfare continued until a sensationhave the names of the winners etched<br />\nal play by Reinoldi resulted in the<br />\nupon its surface.<br />\nsingle tally.<br />\nThe trophy was awarded on the<br />\nA. D.s Down P. A.s<br />\nbasis<br />\nof the largest number of points<br />\nPhi Alpha stubbornly succumbed<br />\nstrung<br />\nup by the fraternity. The matto defeat at the hands of the Alpha<br />\nter<br />\nof<br />\npoints<br />\nincluded all intramural<br />\nDelta haters by a 12 to 0 score in<br />\nsports<br />\nand<br />\nS.<br />\nP. E. took the prize<br />\nthe only frat game played this week.<br />\nwith<br />\n330<br />\npoints.<br />\nFollowing them was<br />\nThe Phi Alphs, handicapped by the<br />\nPhi Sigma Delta with 325 points, and<br />\nlack of two men, were forced to leave<br /><br />\nwhen the Hitler of the referees, you<br />\nknow who, ruled that the football rule<br />\nwas to be followed after having made<br />\nthe lightning-fast decision that the<br />\nsituation demanded. Not to suggest<br />\nany heresy, but there is room for a<br />\ngood thrashing out of the rules. I<br />\nrecommend that each fraternity talk<br />\nthe matter over at a meeting and<br />\nsends an instructed representative to<br />\nthe interfrat athletic meeting on October 30.<br />\no—o<br /><br />\nEvery day something in the interBoth teams are rankling from the<br />\nsting of former defeats. In experi- frat league crops up to emphasize<br />\nence, the Garnets, perhaps, have the the need of a rules-interpretation<br />\nedge on the Jaymen. The average meeting. Wednesday, in the 0. K.<br />\nWeights of the two teams are almost 0.-Phi Ep game, Don Noonan, carthe same, with the Swarthmore line rying the ball, slipped on the muddy<br />\nPoundage at 176 pounds and the back- surface and propelled himself rather<br />\nfield weight at 160 pounds. Both are abruptly on the teerain. While in this<br />\nequally sound on defense, speed and reclining position he assayed a pass<br />\ndrive. The Hopkins team acts as which was intercepted and carried<br />\na unit while the Swarthmore aggre- to within a centimeter of his own<br />\ngation is built around \"Bud\" Peters. goal-line.<br />\nThe probable line-up:<br />\nAccording to football rules, the ball<br />\nSWARTHMORE was dead as soon as any part of<br />\nHOPKINS<br />\nKirschlager Don's anatomy except his hands or<br />\nL.E<br />\nSWindell<br />\nSpruance feet kissed the pasture. The ball<br />\nL.T.<br />\nMcGuire<br />\nDay<br />\nClement could not have been intercepted ana<br />\nL.G<br />\nTaylor the Phi Eps lost a chance to score<br />\nHalbert<br />\n•••••••••••••••••••••••••••••••••••••......................<br />\nPhillips (c.)<br />\nAnfinsen MANN..<br />\nR.G<br />\nEllis<br />\nMorissett<br />\n....R.T<br />\n................<br />\nMcCor'k (c.)<br />\nR.E<br />\nSchmidt<br />\nST. PAUL at 33RD STREET<br />\nWard<br />\nOsbourn<br />\nFB<br />\nPrescriptions-School Supplies<br />\nPeter<br />\nGraziani<br />\nLH<br />\nCandy-Cigars<br />\nKahl<br />\nCooper<br />\nRH<br />\nUnexcelled Fountain Service<br />\nXelly<br />\nLichtenw'ner lio....1.4.11.11.•••••—rowiowoos••••••••••••••••<br />\nR.B<br /><br />\nBtrely's Pharmacy<br /><br />\nmen unguarded. This, paired<br /><br />\nJesatko<br />\nPhi Alpha<br /><br />\nAlpha Delts<br />\nE.<br />\nC<br /><br />\nThe<br />\nRoyal Touch<br /><br />\nwith third place was garnered by Delta<br />\nhead- Upsilon with a score of 310 points.<br /><br />\nthe Alpha Delt running attack<br />\nClose Race<br />\ned by such performers as Bayless,<br />\nThe competition was very keen, and<br />\nKempton and White, was responsible<br />\nfor the Alpha Delt victory.<br />\nWhite for a while it was anybody's prize.<br />\nand Kempton each accounted for<br />\nEven to the last match, there was no<br />\ntouchdowns. Both tallies were made<br />\nsure winner. When the session's inon intercepted passes.<br />\ntramural sports ended, and the scores<br />\nThe line-ups of the games:<br />\nwere figurd out, S. P. E. had won by<br />\nBusiness Men<br />\nGas Civils<br />\nfive points.<br />\nE<br />\nSiems<br />\nGrove<br />\nThe winners of the respective tourE<br />\nWiseman<br />\nDukehart<br />\nnament were as follows:<br />\nDiver<br />\nC<br />\nJoffe<br />\nPhi Psi--Touch football<br />\nBarker<br />\nLachman<br />\nQ•B<br />\nPi<br />\nLambda Phi—Volleyball<br />\nH.B<br />\nL. Adler<br />\nThomas<br />\nDelta Upsilon—Basketball<br />\nH.B<br />\nReinoldi<br />\nJ. Adler<br />\nSigma Phi Epsilon—Softball<br />\nF.B<br />\nGrelecki<br />\nGlasser<br /><br />\nW. White<br />\nT. Jones<br />\nP. Edmunds<br />\nW. Kempton<br />\nJ. Bayless<br />\nE. Kimball<br /><br />\nFollow Arrow and you follow the style<br /><br />\nT Locker<br />\nA. Lachman<br />\nA. Willen<br />\nI. Lefstein<br /><br />\nHarrier Managers Wanted<br />\nAll freshmen interested in a crosscountry managerial berth are urged<br />\nto report to Coach Waldo Hambleton,<br />\nManager Roy Hartman or Milton<br />\nSaul today at 4:30 p. m. The position<br />\nhas not been filled' as yet, and all<br />\ncandidates will be, carefully considered.<br /><br />\nThis year will see another epoch<br />\nof intramural play. However, the first<br />\nfew games of touch football have<br />\nshown the spirit of the fraternities<br />\nto be even better than that of last<br />\nyear. Perhaps the reason might be<br />\nthat the frat men did not see what<br />\nthey were getting for victory. Now<br />\nthat they've all been gazing rather<br />\nenviously at the newly-awarded<br />\nplaque, they are all the more determined to take part in interfraternity<br />\nathletic activity.<br />\nAt any rate, intramural competition, as a means of giving every man<br />\nin school a chance to play ball, is an<br />\nexcellent idea. The Physical Education Department, headed by Dr.<br />\nSchaffer, ought to be given a word<br />\nof praise for the fine work they've<br />\ndone.<br /><br />\nStraight from London<br />\ncomes this new style but.<br />\nton down wide spread<br />\ncollar—attached to the<br />\nArrow HUNT Shirt.<br />\nWhite or fancy — all<br />\nSanforized Shrunk.<br />\n$2 up<br /><br />\nARROW SHIRTS<br />\nand TIES<br /><br />\nOnly Arrow Shirts have Arrow Collars<br />\n\"-.••••••••<br />\n,<br />\n.,.......,•••••••••••••-•••••<br />\n,<br />\n.I.<br />\n,<br /><br />\n./.....••-••••••••••••••••••••••••<br /><br />\nMcPHERSON'S<br />\nHITT<br />\nAn Arrow Shirt<br />\nwith<br />\nAroset Collar<br />\n11 E. Baltimore St.<br />\nPRICE, $2.00<br /><br />\nHookins Over<br />\nSwarthmore<br />\nI suppose Hopkins will officially be<br />\nthe underdog in the Swarthmore<br />\ngame, but I know I share the conviction of the team when I pick Darley's eleven to come home from<br />\nPennsylvania with a victory.<br />\nHere are the State selections for<br />\ntomorrow:<br />\nHopkins to sadden Swarthmore<br />\nNotre Dame to hand Navy her second straight loss<br />\nFlorida's 'Gators to feast on Terrapin<br />\nWestern Maryland to click against<br />\nMt. St. Mary's<br />\nSt. John's to win over American<br />\nWashington College to top Delaware<br />\nCincinnati to leave Baltimore nothing<br />\nto enjoy but the ride.<br />\nLost—I<br />\nWon-5<br /><br />\n0—0<br /><br />\nPrepare For<br />\nInterfrat Meeting<br /><br />\nfootball game, the Gas Civils, led by<br /><br />\nSports Calendar<br />\nFRIDAY—Football (Intramural):<br />\nFrosh Engineers B vs. Frosh<br />\nEngineers A, Field 3.<br />\nFrosh Artists vs. Frosh Scientists, Field 4.<br />\nFrat: Delta Upsilon vs. P.<br />\nLambda Phi, Field 1<br />\nPhi Gamma Delta vs. Tau Alpha Omega, Field 2<br />\nCross-Country (J. V.): Johns<br />\nHopkins University vs. SouthSATURDAY—Football (Varsity):<br />\nJohns Hopkins University vs.<br />\nSwarthmore at Swarthmore<br />\nCross-Country (Varsity): Johns<br />\nHopkins University vs. Lehigh<br />\nern at Homewood<br /><br />\nFencers Practicing<br />\nThe fencing squad has already<br />\nstarted informal practice for the<br />\ncoming season. Many men answered<br />\nthe first call, and prospects for the<br />\ncoming season are very encouraging.<br />\nDespite the large turnout, men with<br />\nany inclination towards the sport<br />\nwill be welcomed. Practice is being<br />\nheld every Saturday afternoon at 1<br />\no'clock at the Barn.<br />\n•••••••••<br /><br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Birely's<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\nBaltimore<br />\n12-20 Hopkins Place<br /><br />\nSPISOS<br />\n\"001n.All WSOC-0109<br /><br />\nOftt.SANS<br />\nla.t. 01S<br />\nSSW<br />\nI%<br />\nSOUGHT<br />\nOS,<br />\nVila<br />\nfORD<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD.,OCTOB<br />\nER 25, 1935.<br /><br />\n'Stormers Pick AVIATION<br />\n'The Firebrand'<br />\nFor Fall Show<br /><br />\nGirl In College For Teachers<br />\nIs Taught Lesson In Biology<br /><br />\nTHIS COLLEGIATE WORLD<br /><br />\nBy GORDON GRAHAME DUCE<br />\nJim Collins — Ace of High-Divers<br />\nThe great-great-grandnephew of formed.<br />\nDiving Uncle Sam's new fighting<br />\nPaul Tulane, founder of Tulane UniMargy<br />\nDetails of an alleged international<br />\nDecides To Stick To Physics After Using Up Her versity, is<br />\nplanes to find out whether or not<br />\nworking his way through plot, which it<br />\nis thought included<br />\nthey will hold together is a job noBest Lines On A Prospect, To Discover<br />\nthe university his great-uncle en- Brinson<br />\n, are as yet very meager. The<br />\nbody wants. Not many pilots will do<br />\ndowed.<br />\nearly information cabled to<br />\nLater Who He Is<br />\nthis<br />\nit for love or money. However, there<br />\ncountry told how Brinson and a friend<br />\nCareer Of Cellini Portrayed is a little group of free-lance flyers Of course, the little girl is in the chase that she forgot<br />\nButler University is attempting to Carl J. Lemcke, were detained when<br />\nall about her<br />\n—a group which probably doesn't College<br />\nfor Teachers, but while that work and dallied<br />\nRacily In Mayer Play; Was number<br />\nsolve<br />\nthe eternal problem of mar- it became certain they were attemptaround.<br />\nAgain<br />\nand<br />\nmore than half a dozen—<br />\nexplains a lot, it doesn't exonerate again the<br />\nriage<br />\nand<br />\ndivorce. A course in mat- ing to work the release of Josph<br />\nyoung fellow walked past<br />\nStage Hit 10 Years Ago which specializes in this dangerous<br />\nrimony<br />\nis<br />\nbeing offered under a 39- Walden„ also knowns as \"Dr. Rivosh<br />\nthe<br />\nlittle<br />\none<br />\nfrom<br />\nbeing<br />\ncomplet<br />\nely her desk and always stopped<br />\nwork. They are dubbed the \"Suicide<br />\nto chat year-old<br />\nlawyer who has been twice of Berlin,\" believed to be a native<br />\ndumb.<br />\nClub\" by their brother airmen.<br />\nabout the work. Of course, she was<br />\nmarried and has had wide experience of Latvia and an agent of the Ogpu,<br />\nWhen a new experimental plane<br />\nIt seems that Margy was out late a little annoyed<br />\nthe Soviet secret political police, from<br />\nat his shyness, but in divorce cases.<br />\nemerges from the work shops of the one night<br />\nwith a grad student in the she thought he<br />\na Chinese prison. Walden was sen*<br />\nwould<br />\n*<br />\n*<br />\nsoon<br />\nget over<br />\nfactory, glistening in her pristine<br />\nPhysics Department. After all, it is that, once<br />\ntenced to 15 years imprisonment for<br />\nRally Held Tuesday In Play- glory, the<br />\nhe felt the full effect of<br />\nThe following is the reasoning of<br />\nregular factory test pilots<br />\nespiona<br />\nge.<br />\nrather<br />\ntiring<br />\nto<br />\nlearn<br />\nall about Heat No. 5.<br />\na mathematics professor at Drexel:<br />\nShop; Pantomime, Talks are frequently not called upon to give<br />\nAccordi<br />\nng to a reliable Japanese<br />\nher the first long dive. Her wings and Expansion, Transfer of Heat and<br />\n1. A poor lesson is better than<br />\nBut sad to relate, the young man<br />\nBy Fagin And Hinrichs may be shorn off like cardboard; or allied subjects in one night<br />\nsource, the plot to set Walden free<br />\nnothing<br />\n.<br />\n(Saun- failed to respond to all<br />\ntreatment.<br />\nthe tail may give Way, or she may be ders, pp 148-157<br />\n2. Nothing is better than. a good was discovered when a Japanese gun), and make an 8.30 She brought all her<br />\n(Continued from Page 1, Col. 1)<br />\nboat on river patrol in the Yangtse<br />\nhunting skill lesson.<br />\njust bull-headed and refuse to pull<br />\ninto play, but he would not bite.<br />\nintercep<br />\nted a radio message from the<br />\nly appointed coach. Much of Mr. Hin- up. There are a lot of things that can the next morning.<br />\n3. Therefore, a poor lesson is betLate For Class<br />\nSoviet steamship Sever, en route<br />\nIn desperation, she skipped No.<br />\nrichs' address was devoted to the go wrong and there isn't much chance<br />\nter<br />\nthan<br />\na<br />\ngood lesson.<br />\n6<br />\nWell, be that as it may, she vifrom Shanghai to Vladivostok.<br />\nand went immediately into No.<br />\nnecessity of close cooperation be- of bailing out with a 400-mile-an* * *<br />\n7.<br />\nbrated<br />\nacross the lab and took her<br />\nBrinson and Lemcke, it is charged,<br />\nhour<br />\nrazor-e<br />\ndge<br />\nof<br />\nair<br />\nhowling<br />\npast<br />\nHeretofore, nobody had ever withtween the three branchcs of the club.<br />\nA gift of 300 books, similar to the had planned<br />\nto bribe the assistant<br />\nthe cockpit. So the manufacturers, seat exactly at 9.05 a. m. Saturday,<br />\nstood No. 6 except a well dressed one received by the Hopkins recent- warden of the jail in<br />\nIn the prodution of so difficult a rather than<br />\nWuchang, where<br />\nrisk the necks of their meanwhile flashing her No. 3 \"this<br />\npiece as \"The Firebrand,\" this, he own staff pilots, call in a member of looks interesting\" smile at a good- tailors dummy sne had mistaken for ly, was received by the University of Walden is being held. Wiichang is<br />\nSouthern California from Italy last directly opposit<br />\nlooking young fellow who happened the real thing.<br />\ne Hankow on the<br />\nthe \"Suicide Club.\"<br />\nsaid, was especially important.<br />\nAnd it looked as if year.<br />\nto<br />\nbe<br />\nYangtse. In this way the pair inpassing<br />\nat<br />\nthe<br />\ntime. And when this fellow was going to<br />\nOutstanding among them was Jim<br />\nbe imper*<br />\n*<br />\n*<br />\nBegin Casting<br />\ntended to gain admittance to the<br />\nCollins.<br />\nHe had dived more air- he evinced interest in her arrival, she vious to all her attacks. She was even<br />\nconfide<br />\njail, let Walden leave and have Lemcd<br />\n\"this<br />\nis an 8.30 class, isn't ready to use her nnal<br />\nCasting for the new Barnstormer planes—and had dived them faster<br />\nDating<br />\nwas<br />\ncalled<br />\none<br />\nof<br />\nthe<br />\nmost<br />\nresort, but as<br />\nit?\" and giggled delightedly at hav- no couch was<br />\nke remain behnd in his place. Once<br />\nplay was begun last night when ap- and farther—than any other pilot.<br />\nnearby, she could not important opportunities of college<br />\ning<br />\nput<br />\nWalden was safely out of Chinese<br />\none over on the instructor. faint.<br />\nlife<br />\nby<br />\nDr.<br />\nLast<br />\nmonth<br />\nHarold<br />\none<br />\nof<br />\nthem<br />\nBosley,<br />\ncarried<br />\nhim<br />\ndirector of<br />\nproximately thirty candidates apreligious activities at Iowa State territory, Lemcke was to have efThen after quivering around a<br />\nto his grave with the wind screaming<br />\nThen<br />\nfinding<br />\nit all in vain, she<br />\npeared at the Barn. Mr. Paul Hinfected his own release by a mere<br />\nTeachers College.<br />\na shrill symphony of death. Jim had while she finally jelled and set to grouchily turned<br />\nto her work and<br />\nrichs outlined the plot of the play been living on borrowed<br />\ndeclaration of his true identity.<br />\n* * *<br />\ntime for a work daintily stabbing at her speci- viciously cut away. Once<br />\nagain, he<br />\nand offered several suggestions to good many years. More than once men. Soon, however, her afore- stopped to<br />\nTwo other men said to be involved<br />\nIt is reported by the Associa<br />\nmake a comment, but beted in the plot are<br />\nBrain Nadis, a Soviet<br />\nthe candidates. The roles were as- he had pulled the whiskers of death mentioned friend walked past and fore he had a mance to<br />\nsay anything Collegiate Press that a freshman at<br />\nRussian and a typewriter salesman<br />\nand had come off unscathed, to grin asked how she was doing. Remem- she snapped<br />\nsumed by those who attended.<br />\n\"Please don't bother the University of Minnesota changed<br />\nby occupation, and an Englishman<br />\nand go back and do it again.<br />\nbering her success with No. 3, she me.\" Nonplus<br />\nsed, he looked sur- from a pre-med course to a business<br />\nwhose identity was not revealed.<br />\nOne bleak December afternoon he repliod that things weren't progress- prised, but<br />\nshrugged his shoulders course because the line of pre-meds<br />\nwalked out on the line at the Naval ing very badly, all the time wonder- and walked<br />\n*<br />\n*<br />\n*<br />\nin the registrar's office was very<br />\naway.<br />\nAir Station at Washington, D. C., ing if she should turn on Number 5<br />\nMargy turned around to her<br />\nlong<br />\nand<br />\nWorcest<br />\nthe<br />\ner, Mass.—Poets and others<br />\nfrosh just didn't feel<br />\nnextwhere a Martin experimental dive- or 4. Then rapidly deciding that he door<br />\nneighbor and said, —I wish that like standing in line so long.<br />\nwho talk about \"the everlasting<br />\nbomber was waiting for him. Navy looked a little too weak to withstand fellow<br />\nhills\" may not be strictly accurate,<br />\nwould'nt bother me so much.\"<br />\n* * *<br />\n(Continued from Page 1, Col. 3)<br />\nofficials who were to witness the No. 4, she let him have 5.<br />\nHer neighbor looked surprised,<br />\naccording to Dr. Wallace Atwood,<br />\nand<br />\nThe carpenter at the University of<br />\nInstead of the \"Youth AdmAnis- demonstration demanded an 8,000In accordance with this plan she remarked: \"Why,<br />\npresident of Clark University here,<br />\nthat's Dr. Bram- Southern Californ<br />\nia gives his entire<br />\ntration,\" Dr. Mitchell proposed an foot power-dive. Jim merely shrug- gave him an arch look and began ble!\"<br />\nsalary to a scholarship fund dedicat- who says that recent geological re\"Age Administration\" which would ged, had his parachute repacked, and to crack wise. Our hero looked at<br />\nNeedless to say, Mangy dropped<br />\nsearch indicates that three Rocky<br />\ned to the memory of his son.<br />\ntightened his safety-belt. He climbed her a little bewildered and then Biology<br />\n. She has decided to stick to<br />\nMountain ranges have formed and<br />\nbe run by the youth of America, de*<br />\n*<br />\n*<br />\nup to 12,000 feet. Here he rolled her shrugged his shoulders in resignation. Physic<br />\ns—at least, she knows someworn away during the last 30 milsigned to discover comfort and de- over on her side, kicked<br />\nFor the second year, Haverford<br />\nbottom rud- But Margy was so eager after the thing about<br />\nlion years.<br />\nthat.<br />\ncency for the mature and elderly, but der and let the nose flip straight toCollege is offering night courses, in<br />\n\"Three distinct ranges of mounEnglish and general science, for neto prevent them from doing harm wards the postage stamp that was<br />\ntains,\"<br />\nhe said, \"have come into exgroes. The Haverford News says<br />\nto society, especially to the young the flying field.<br />\nistence and passed away since the<br />\nDown, down the plane rushed.<br />\nthat the classes, conducted by stuwho, through their health, alertness,<br />\nformations which we know as the<br />\nStraight ahead over the nose he could<br />\ndent teachers, are well attended.<br />\nRocky Mountains began.\"<br />\nand enthusiasm, deserve every con- see the brown earth leaping<br />\n•<br />\n*<br />\n*<br />\nat him.<br />\nNo exact determination of the<br />\nsideration.<br />\nHe was standing on the rudder pedAt the University of Maryland<br />\nheight of the ancient mountains can<br />\nals,<br />\nhead<br />\nducked forward under the<br />\nthere is a freshman who objects to<br />\nInstructors Little Help<br />\nbe made, Dr. Atwood said, but they<br />\nwindscreen to protect his face from<br />\ndoing outside reading, because during<br />\nwere probably higher than the presStudents, in listening to their in- the typhoon of air.<br />\nthe winter it is so cold on the porch.<br />\nThe Department of Military Science<br />\nent peaks.<br />\nstructors, should always remember<br />\nFollowing a dinner, the \"Y\"<br />\n*<br />\nHe was down to 5,000 feet when<br />\n*<br />\nCaband Tactics announces its annual inet held its first<br />\n* * *<br />\nthat these instructors—practically suddenly there was a noise like a<br />\nbusiness meeting of<br />\nA University of Utah coed walked<br />\npresentation of an officer's sabre to the term yesterd<br />\nay evening in Lever- up to the library desk<br />\nwithout exception—have done little loud explosion. The plane lurched vi\"It<br />\nwould<br />\nseem,\"<br />\nMr. Hoover said,<br />\nand asked for<br />\na student in the Reserve Officers' ing Hall, to formula<br />\nte plans for the Horses' Oats. After much discussi<br />\nor nothing to prevent the ills olently and Jim felt something strike<br />\n\"that<br />\ngovernm<br />\nthe<br />\nent,<br />\nhaving chosen<br />\non<br />\nTraining Corps will be made by The year.<br />\nfrom<br />\nwhich<br />\nyouth is suffering him a stunning blow on the head. He<br />\nwith the head librarian, it was finally to devalue our endowment resources,<br />\nBaltimore Chapter of The Reserve<br />\nHeaded by Henry Leber, other<br />\ntoday. These professors fought in lost consciousness for a moment and<br />\ndecided that the young lady wanted might make the gates of giving<br />\nOfficers' Association of the United members of the<br />\nCabinet include J. Horace's Odes.<br />\nthe World War, or fell victims to then, as he came to and realized his<br />\nmore easy of access.<br />\nIf all taxes<br />\nStates. The association will be rep- Hurwitz, B. Murphy<br />\n, T. Wiehe, J.<br />\nthe patriotic propaganda of George predicament, he began to struggle to<br />\nand the limitations now imposed<br />\nresented by Colonel Walther F. Griffin, D. De Lima,<br />\nL. Hanawalt, B.<br />\nCreel, or, sad to relate, helped make get clear. The plane, shorn of wings<br />\n'were removed from gifts Itind beThe mule he are a funny bird.<br />\nJames, of the Cavalry Reserve, who Pinck, C. Bowers,<br />\nB. Vincenti, D.<br />\nwar propaganda. They were firm on the right side, had gone into a<br />\nqests we would receive more of them.<br />\nHe hair are long and thick;<br />\nwill make the presentation.<br />\nLloyd, E. Gaunt, P. Berge, L. Mathbelievers in the new economics violent spin and was falling at a<br />\nIf the purpose of the people is to<br />\nHe are mostly ears and head,<br />\nThe conditions of this award are: er, E. Rouny, A.<br />\nPinkerton, I. Peters,<br />\n(1922-29) and no more saw the im- speed that would make the proverbial<br />\nrdistribute wealth, I know of no<br />\nBut a lot of he are kick.<br />\npending crash than they now see the plummet look like a snail. The cen- 1. An award for excellent scholas- H. Skinner, J. Weber, F. Silver, D.<br />\nquarter into which such redistribu--Daily Kansan.<br />\ntic attainment in the subject of Emerson, R. Osborne, C. Sivertz,<br />\nway out of the slump. They con- trifugal force pressed Collins down<br />\n• * *<br />\ntion could flow that would be more<br />\nGhingher, B. Frey, J. Lyle, C. Hobbs,<br />\nMilitary Tactics.<br />\ntinue training students to enter the in the cockpit and for 3,000 feet he<br />\nProfessor Welsh of Bowdoin Col- advantageous to the people as a<br />\nJ. Mehling, W. Jarman, N. Soifer,<br />\n9. The cadet will be designa<br />\nranks of the unemployed, which is fought desperately to get out.<br />\nT. lege firmly states that examinations whole than into our edhcational inted by Ellis,<br />\nJ. Baurenschmidt, R. Bing- are<br />\nFinally, he managed to leap clear<br />\nnot the least useless of its occupaas harmful to the intellect as stitions.\"<br />\nthe professor of Military Science<br />\nhardt, J. Soule, J. Alexander, H. Sevand im,mediately began feeling for<br />\ntions.<br />\n* * *<br />\nliquor and women.<br />\nand Tactics.<br />\nern, J. Mitchell, and J. Wright.<br />\n*<br />\n*<br />\nSo what is said from the profes- the rip-cord ring. As he was about 3. The cadet<br />\nWalla Walla, Wash.—What's a<br />\nmust<br />\nbe a member of<br />\nA survey at Haverford last June slippery football to a quarterback<br />\nsors' platform should be taken with to pull it, he realized that he was<br />\nthe R. 0. T. C. Graduating Class<br />\nshowed that those students who own who works his way through college<br />\na grain of salt. The professors' falling directly in line with the path<br />\nradios get better grades.<br />\ntheory, is proved to have been of the wreckage, and if the chute 5. The saber will be presented to<br />\nby running a cake of soap for yardthe cadet by officers of the Bal* * *<br />\nwrong, at least we do not know but opened now, the doomed ship would<br />\nage on babies' backs?<br />\ntimore Chapter of the Reserve<br />\nJuniatian College may have a golf<br />\nwhat the promptings of the student fall on him. The ground began to<br />\nNothing whatsover, say those who<br />\nloom up close. Just when it seemed<br />\nOfficers' Association.<br />\nmay work out better.<br />\nAll students who can read music course this year.<br />\nhave seen Phil Green, Whitman Coltoo late, the plane swerved off, and 6.<br />\n* * *<br />\nThe name of the cadet will be and are interested in learning to play<br />\nDr. Mithcell gave a few striking<br />\nlege's varsity quarter, in action<br />\nJim gave the rip-cord a healthy tug.<br />\nThe Ohio State Lantern issues the in the nursery<br />\nannounced by the aforemen- a wood instrument, may do so free,<br />\nexamples of the paradox that exists<br />\nand on the gridiron.<br />\nThe 'chute whipped out with such<br />\ntioned professor when and in if they report to the Barn on Mon- following figures:<br />\nin the supply and demand Of proGreen pays his way at Whitman<br />\nforce that Jim was stunned and landmanner as he may prescribe, the day afternoon at 4 p. m. Conrad Ge- Population in the U. S.-124,000,000 by performing the duties of a nurseducts that exist today. He told the<br />\ned in a groggy condition between the<br />\nname of the cadet selected to be belein, conductor of the Band, will Eligible for Townsend pensionsstudents that when an attempt will<br />\nfaid---a job entailing scrubbing his<br />\n, wings and main wreckage of his<br />\nfurnish<br />\n50,000,000 young charges as well as putting<br />\nbe made to march them off to war to<br />\ned to the Baltimore Chap- teach all applicants who intend to<br />\nship in a little vacant lot.<br />\nter of the Reserve Officers' As- learn to play. Freshmen, especially, Government employes an those<br />\ntell their professors, pastors and par- '<br />\nthem to bed. (Concluded next week)<br />\nprohibited from working under<br />\nsoication of the United States, are urged to try out, as three years<br />\nents that they made the war and<br />\nWhen Green came to Whitman a<br />\nthe Labor Acts—<br />\n60,000,000 year ago, he read an advertisement<br />\nat least thirty days in advance for regularly playing entitles one to<br />\nthat they should fight it.<br />\nUnemployed—<br />\na varsity seal.<br />\n13,999,900 seeking a girl to take charge of chilof the presentation.<br />\nLessons<br />\nwill<br />\ndren and do general housework. He<br />\nbe<br />\ngiven to those de- Left to produce the nation's<br />\nThe sabre is about three feet long<br />\ngoods—<br />\nOscar Helm Gives Address<br />\n2 proved his salesmanship by calling<br />\nwith a space on the blade so as to siring to play the saxophone, the<br />\n\"These two persons,\" the report on the inquiri<br />\nengrave on it the cadet's name. The clarinet, the piccolo, the trumpet the<br />\nng hoUsewife and getcontinues, \"are you and I—and I'm ting the<br />\n(Continued from Page 1, Col. 4)<br />\nOsear Hem, a graduate of the<br />\nplace.<br />\nsaber will be on display in the Senior Trombone, the drum, and the alto or<br />\nbass horns.<br />\nWhen he returned to college this<br />\nSlips for insturments all tired out.\"<br />\nDr. Bowman's address was the fea- classroom of the R. 0. T. C.<br />\nJohns Hopkins and a former presi*<br />\n*<br />\n*<br />\nmay be obtained on Monday at the<br />\nFall he took the job again. Sunday<br />\ndent of the Student Council, ad- ture of a program which also inMinneapolis, Minn.—A search last- mornings he dresses the<br />\nsame time candidates sign up to<br />\ndressed the Freshman Commission cluded some musical numbers by<br />\nchildren,<br />\ning several weeks ending recently for rushes them<br />\nlearn.<br />\nThe<br />\nBand<br />\nHopkin<br />\nDebat<br />\nmen.<br />\ncan<br />\ns<br />\nDr.<br />\ners<br />\noff to Sunday school<br />\nTuesday evening on the subject of<br />\nLawrence A. Peuse from fifOrganize Oct. 31<br />\nInto Karimo, University of Minnesota and then<br />\nteen to twenty new members.<br />\ngoes into the kitchen and<br />\nfraternities. The session held at tran, organist at the Wilson Memorial<br />\nstudent, when he found the body of elps prepare the<br />\nMethodi<br />\nst Church and an instructor<br />\nLevering Hall was marked by a<br />\ndinner.<br />\nPaul Umbarger, business manager<br />\nhis uncle, Herman E. Karimo, in the<br />\nNew York—Harold Jesurun, 37,<br />\nheated debate, which followed Helm's at the Peaboicly Institute, performed and actisg<br />\nhead of the Debating N. S. L. Meetings Hereafter anatomy laboratory<br />\nof the Minnesota Columbia University student who<br />\non the piano. He played the First<br />\nremarks.<br />\natCouncil, announced that the initial<br />\nmedical school.<br />\nOn<br />\nTuesd<br />\nPrelude<br />\ntracted wide attention last yearwhen<br />\nby<br />\nDr.<br />\nay<br />\nDonald<br />\nAfter<br />\nH.<br />\nAndrew<br />\nnoon<br />\ns of<br />\nNext Tesday evening, October 29,<br />\nThe youth had been unable to lo- he insituted a \"wakin<br />\nmeeting of the organization would<br />\ng-up\" service<br />\nhas been tentatively selected as the the Chemistry Department and the<br />\ncate his uncle at the beginning of for his fellow<br />\nNationa<br />\nl<br />\nStudent<br />\n\"Largo<br />\nbe<br />\nmoveme<br />\nheld<br />\n\"<br />\nLeague<br />\nnt<br />\nThursda<br />\nof<br />\nDvorak's New<br />\nmeeting<br />\nstudents, is back this<br />\ny, October 31st, in<br />\ndate for election of officers of the<br />\nthe Board Room in Levering Hall. will not be held this afternoon, it the Fall term and had appealed to year full of determination to expand<br />\n-World Symphony.<br />\norganization.<br />\nCandida<br />\ntes for membership are wel- was announced by Ralph Nordstrum, police for aid. Detectives assigned his novel bbusiness.<br />\nStuart LeCompte, baritone, graduto the case found Herman Karimo<br />\n\"I'm all set for a big season,\" he<br />\nate student in Plant Physiology, sang come and are requested to report at newly elected Executive Secretary of<br />\nthe<br />\nNSL.<br />\nthat<br />\nUntil<br />\ntime.<br />\nfurther notice, regu- had changed addresses under an as- confided to our reporter. \"I've<br />\nTwo Marionettes by Law and the faalsumed name and had committed suimiliar Dear Old Johnny Hopkins. He<br />\nready got a lot of customers, and<br />\nPlans for debates with soiceties lar meetings will be on Tuesday<br />\nSeptemb<br />\ncide<br />\ner<br />\n4.<br />\nThe<br />\nbody<br />\nlay<br />\nunafterno<br />\nons<br />\nat 4 p. m. in Levering<br />\nwas accompanied by Mips Rachel representing Princeton and Yale are<br />\nmy new method of getting them up<br />\nThis week: JOHN C. MacGILL<br />\nclaimed in the county morgue until<br />\nHall.<br />\nnow being formulated.<br />\nnever fails.\"<br />\nDean Berry appointed this tall, Parker.<br />\nAt its business meeting last Tues- September 17, when it was removed<br />\nGeorge Steiner, undergraduate, a<br />\nThe new method proved to be a<br />\nblonde student chairman of the Studay<br />\nthe NSL elected a new slate of to the university.<br />\nphial of ammonium chloride, predent Activities Committee last year. scholarship holder at the Peabody,<br />\nHANDBOOKS AVAILABLE<br />\n*<br />\n*<br />\n*<br />\nofficers, including the following:<br />\nconcluded the program with two vioviously treated with sodium hydroxHe is also manager of the football<br />\nExeuticve Secretary, Ralph NordEaston, Pa.—Eugene Brinson, La- ide to obtain the<br />\nlin elections, Massenet's Meditation<br />\ngas. A few whiffs<br />\nThe NEWS-LETTER has been re- strum; Member<br />\nteam . . . a member of the Barnship Secretary, Sid- fayette '31, is being held prisoner by of this and<br />\nfrom Thais and Brahm's Fifth Hunthe patient is wide awake.<br />\nquested by E. A. Schall, executive ney H Levy;<br />\nstormers' Club . . . vice-president of<br />\nTreasurer, Irving Co- Chinese authorities at Hankow on It never<br />\ngarian Erance.<br />\nfails, and besides, \"it clears<br />\nsecretary of the Hopkins Y. M. C. A. hen; Recordi<br />\nOmicron Delta Kappa . . . a member<br />\nng Secretary, Tessim charges of \"assisting Communists to the head<br />\nThe<br />\nnext<br />\nGraduat<br />\nimmediately,\" according to<br />\ne<br />\nStudent<br />\nDance to announce that there are still a Zorach.<br />\nof the swimming team.<br />\nThe new executive commit- imperil the Chinese government, Jesurun<br />\nwill be held November 15th, with number of<br />\n.<br />\nhandbooks left, and that tee is made up of Levy,<br />\nJohnny's fraternity affiliations are<br />\nNordstrum bribing officers, and attempting to<br />\nWalter Routson's Orchestra provid- anyone desiring<br />\nHe also gives an inkling of the<br />\none should call at and Cohen, and Elijah Adams<br />\nwith Phi Gamma Delta.<br />\nand procure the escape of a convict\" col- novel means he uses<br />\ning the music.<br />\nto promote<br />\nLevering Hall at once.<br />\nMaurice Shils.<br />\nlege authorities here have been in- business.<br /><br />\nCasting Begun<br /><br />\nMitchell Condemns<br />\nOlder Generation<br /><br />\nR.O.T.C.Group Will \"Y\"Cabinet Meets<br />\nPresent Sabre To To Discuss Plans;<br />\nTop Ranking Cadet Leber Heads Group<br /><br />\nFree Musical Tuition<br />\nFor Band Members<br /><br />\nDr. Bowman Speaks<br />\nTo Grad Students<br /><br />\nCampus Captains<br /><br />\nwa<br />\nda:<br />\nkir<br />\nNa<br />\nbili<br />\npol<br />\nbe<br />\nthe<br />\nfor<br />\nint<br />\ntia<br /><br />\nthe<br />\nrio<br />\nthe<br />\nthe<br />\nwo<br />\ndet<br /><br />\nOUT<br /><br />\nisla<br />\nthe<br />\ncre<br />\nma<br /><br />\n2<br />\ntioi<br />\npec<br />\nthe<br />\n0.<br />\nSOT<br /><br />\nthe<br />\noui<br />\nlen<br />\nerr<br />\nwa<br />\ndel<br />\nup<br />\ntio<br />\ntio<br />\n(N<br />\nLe<br />\nNa<br />\non<br />\nLe<br />\nInl<br />\nlam<br />\nCo<br />\nsp<br />\nth<br />\nNi<br />\nor<br />\npr<br />\nof<br />\nth<br />\n54<br />\nIt<br />\nbe<br />\nPr<br />\ntic<br /><br />\nPi<br />\nti<br />\ncc<br />\nal<br />\ner<br />\nof<br />\nh(<br />\nJ(<br />\nrn<br /><br />\na]<br />\nti<br /><br />"}], "field_media_file": [{"target_id": 38972, "display": null, "description": null, "target_type": "file", "target_uuid": "9ebd036b-13b6-4c2c-a19f-222e04e4d64b", "url": "http://digital.library.jhu.edu/system/files/2022-03/12649-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12649, "target_type": "node", "target_uuid": "bfdb6a21-16e0-4f6c-b195-9cd21be45025", "url": "/node/12649"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "48d2584e-c318-4041-b636-9668c08d41f4"}]}