{"mid": [{"value": 37153}], "uuid": [{"value": "f12a8e1b-4675-4dae-a22b-bf99f20e154d"}], "vid": [{"value": 37153}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:00:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13211-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:00:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:00:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "SELL<br />\n<br />\nSELL<br />\n<br />\nTICKETS<br />\n<br />\nTICKETS<br />\n<br />\nVOL. XXX, No. 42<br />\nCELEBRITY JAY WILL BE<br />\nRELEASED TONIGHT<br />\nAT BARNSTORMERS<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 26, 1926.<br />\n<br />\nRed Eagles Begin<br />\nPractice Next Week<br />\n<br />\nLACROSSE TEAM READY<br />\nFOR INITIAL GAME<br />\n<br />\nOF SEASON<br />\nIt was announced Wednesday<br />\nThirty-Five Men of Note Contribute that the Hopkins Red Eagles will<br />\nSt. Johns Game One Week Ahead<br />\nTo Seventy-Two Page Number—<br />\nWill Be Test For Team<br />\nbegin lacrosse practice on Strauss<br />\nPlan Largp Distribution<br />\nOf Veteran Players<br />\nField next week, as soon as the<br />\nThirly-five men of national or Varsity squad is transferred to<br />\nOne week from tomorrow, the<br />\ninternational fame are contribn- the upper field. Several attrac- lacrosse team clad in its new spectors to the seventy-two page \"Cel- tive games will be secured for the ially designed uniform will trot<br />\nebrity Number\" of The Black and team, and it is hoped that they out on the field to win or lose in<br />\nPine Jay. which Will be released will play in a preliminary contest the season's inaugural against St.<br />\ntonight at the Lyric. Eleven last before t he Hopkins-Maryland Johns.<br />\nminute sketches and writings have game.<br />\nFor the past twO weeks the labeen received. Among these are<br />\nThe lied Eagles constitute a crossers have been practicing on<br />\nJ. Carroll Mansfield, whose work sort of preparatory school for the Strauss field. With a nucleus of<br />\nappears daily in The Evening Sun Varsity lacrosse team. All but a eight or more veterans of last<br />\nas -High Lights Of History.\" The score of the best players will prac- year's first string, Coaches Van<br />\ndrawing is supposed to show the tice With them, those showing the<br />\n.history of the flapper: Strictland greatest ability being employed on<br />\n.Gillilan, Baltimore's humorist, the first team. 'Special attention<br />\nhas sent in a contribution.<br />\nwill be given to promising fresh-<br />\n<br />\nOrman, Schmeisser and Darley<br />\nhave succeeded in whipping into<br />\nshape a twelve that gives great<br />\npromise even at this early date.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBARNSTORMERS TO GIVE<br />\nPRODUCTION AT LYRIC<br />\nPRESENT \"HIS MAJESTY BUNKER BEAN\" TONIGHT<br />\nSecond Performance Tomorrow; Alger<br />\nHiss And John Desch To Play Major Rolls<br />\nBunker Bean from Boston, that<br />\n<br />\n\"MOPS\"<br />\n<br />\nshadowy personality who has for<br />\nmany weeks haunted the neighborhood of the Barn, will make<br />\nhis appearance at 8:15 tonight<br />\n<br />\nso<br />\n<br />\nand tomorrow night before the<br />\naudience assembled at the Lyric<br />\nTheatre.<br />\nAccording to all accounts, the<br />\ncomedy will be one whose acting<br />\nhas never been surpassed in any<br />\nBarnstormer, production, whose<br />\nscenery, has never.been excelled in<br />\nlavishness. Rehearsals have been<br />\nheld every evening this week from<br />\nfive to eleven. o'clock under the<br />\n<br />\nVeterans On Defense<br />\nThe defense is composed of a<br />\nformidable group of old timers<br />\nFour Hurt During<br />\nincluding Captain Levy, Liepenw<br />\nCrane, who. has written an editordirection of Walter B. Swindell,<br />\nLacrosse Practice berger, Biddison, Berndt, Gersfial on College Morality, which<br />\nJr., coach of the Barnstormers,<br />\nLacrosse practice during the meyer, and Ferlano. Schwartz<br />\nlooks very out of place on the ediis<br />\n•<br />\na<br />\nnewcomer<br />\nwho<br />\nis<br />\nstepping<br />\nI. Evans Rodgers. The latter,<br />\nand<br />\npast week has not been without<br />\ntorial page of The Black and Blue<br />\nrather much into the limelight,<br />\nwho took the leading part in 4<br />\nJay so we are told, and Rube its mishaps. Wednesday, Almy lie is liable to change places with<br />\nMan last year, has<br />\nTailor-Made<br />\nCarl Stissel, who will play Mrs.<br />\nGoldberg. Rube's drawing de- injured his tack, Robinson had a Biddison any time that Biddison<br />\nBreede tonight at the Lyric<br />\nbeen greatly instrumental in impicts the ever refreshing Boob Mc- lacrosse stick poked into his eye, is needed on the attack. When<br />\nproving the intonation and acting<br />\nNutt testing. the gravity of apple and Levy and McNeil each sus- he is not at one of the points.<br />\nsauce. Of equal import is Ken tained a cut directly over the eye. Biddison is playing home at the<br />\nof the Bunker Bean cast. Rodgers<br />\nINTERFRATERNITY BOARD himself has the role of the psychic<br />\nKling, originator of the famous Many of the stickmen also corn- oilier end of the field.<br />\nJoe Quince.<br />\nSTILL UNDECIDED<br />\nplain of minor cuts and bruises. I The attack can boast of a few<br />\nBalthazar.<br />\nFrank Hanley and Edmund<br />\nveterans that lose nothing in comWeeks of Deliberation on \\ew Rushing<br />\nDress Rehearsal<br />\nDuffy of The -Sun are two more<br />\nparison with the defense. Robin_Agreement<br />\nFruitless<br />\nLast night the Barnstormers<br />\nwhose drawings are just in time. Athletic Association<br />\nson is back at his old position on<br />\nA<br />\nstruggle<br />\nbetween<br />\nthe<br />\nradical<br />\ntheir final rehearsal, in full<br />\nheld<br />\nEllis Parker Butler whose classic<br />\nTo Give Two Dances one wing, whereas Morrell is playPigs Is Pigs is the favorite of two<br />\nIn order to entertain the la- ing at the other midfield position. and conservative groups of the costume, at the Lyric. By one<br />\nnations has also \"come through\" crosse teams of<br />\nthe United States Cone and Taylor will probably be Interfraternity Board Which has o'clock most of the scenery had<br />\nwith a few words -which Must be Military<br />\nAcademy and Oxford-. the homes for the greater part recently thrown the organization been tran9orted to the Lyric and<br />\nread to be fully .appreciated. Sid- Cambridge,<br />\nof the season. The center position<br />\nthe Athletic Associainto utter confusion reached a cli- been set up by the property staff.<br />\nney Nyburg, Baltimore author,<br />\nis still undecided, many men havtion is planning to give dances on<br />\nmax at the meeting of the Board<br />\nFour complete sets of 'scenery<br />\nhas sent in a poem. It is said that<br />\nApril 10 and April 24. They will ing been tried out for but none<br />\nlast Monday.<br />\nwill be 'employed in the producthis is the first poetry which he<br />\nbe held at 9:00 P. M. in the main appearing satisfactory.<br />\nhas ever published.<br />\nThe<br />\nchief<br />\nsource<br />\nof<br />\ndissension<br />\nThe most interesting to the<br />\ntion.<br />\nballroom of the Hotel Belvedere.<br />\nPromising Newcomers<br />\nIt was hoped that the AssociaPlans For Distribution<br />\nOf the newcomers this year, is the rushing agreement for next audience will probably be the unition<br />\ncould<br />\ninvite<br />\nall<br />\nJohns Hop- Boynton, Helfrish, and Eagan year. The \"Alan which has the que background of the first scene<br />\n-Extensive_plans_bave been completed for the distribution of this kins students to these affairs but seem to be the Most promising. , strongest backing. proposes two in the second act and the scenery<br />\ngreatest of all numbers. The the results of the Spring season Mallonee, Sauerwein, Logan, Mc- Iweeks of closed rushing, then two of the last act executed in the<br />\nUnion News has contracted to sup- ticket sale have made this plan Neil, Kaufholz, and a few others weeks of non-rushing, except for Tudor style of architecture. The<br />\nmummy case which appears in<br />\nply the Jays to all.railroad stations impossible. So tickets for admis- are doing well in the daily scrimnightly entertainments at the var- the second act is one of the most<br />\nin New York, Florida, Massachu- sion will be sold at the Athletic mage.•<br />\nThe new jerseys especially de- ious fraternity houses, and lastly individual pieces ever undertaken<br />\nsetts, Pennsylvania, Maryland,Vir- Office for one dollar, a couple.<br />\nginia and District of Columbia. They may be purchased only by signed by Keyes, Van Orman, and a period of one week during which by the art staff.<br />\nBeside this the Jay will be distri- men who are on the campus or Hoban have arrived. The sweat- the fraternities will keep open<br />\nKing Directed Artists<br />\nbuted in Baltimore by the business otherwise connected with the uni- ers are solid blue. They afford house, with unrestricted rushing.<br />\npreparation<br />\nof the scenery<br />\nThe<br />\ngreater protection to the player<br />\nstaff. Large posters have been versity.<br />\nCard System Considered<br />\nhas been -carried on under the diThe first affair will be featured than any other jersey on the marprinted which will be placed on all<br />\nThe usual silent period will ex- rection of Hadley S. King, who<br />\nrailroad station stands and also by the orchestra of Bob Tula and ket. All the vulnerable spots are, tend from midnight Saturday un- was greatly assisted in the art<br />\non the stands in Baltimore city. the second by the entire Blue Jay lined with porous rubber. Every til eight or twelve o'clock Monwork, especially in the matter of<br />\nprotruding bone will be protected. day, November 8, depending upon<br />\nSome are also being placed on the Orchestra.<br />\ndesigns, by William B. Banks,<br />\ncampus.<br />\nwhether or not the card system of Donald W. White, Isaac Hampledging is adopted. This plan burger, production manager in<br />\nTen thousand copies of this VAN ORMAN CONSIDERS FOOTBALL<br />\nrequires<br />\nall pledges to-turn in the 1924, and Mario Padilo, now a<br />\nnumber have been printed and<br />\nRULING CHANGE ANTIQUARIAN<br />\nname of their chosen fraternity theatrical art director in New<br />\nofficials of The Union News Co.<br />\nthink a reprint may be necessary.<br />\nDr. Van Orman stated that he to the president of the Board by York City. The carpenters, paintAccording to Dr. Ray Van OrThe Jay staff has promised • that man, the drastic step taken by was absolutely opposed to the new twelve o'clock Monday. .<br />\ners, hnd members of the property<br />\nthe magazines will be in the boxes the football rules committee to regulation. He emphasized the<br />\nRadical members of the Inter- staff have been working day and<br />\nat the post office by Monday morn- lessen the effectiveness of the for- fact that the greater part of the fraternity Board seek to cut down night to complete their tasks, now<br />\ning. A good sale is expected at ward pass has carried the game scientific aspect of the game would the length of the closed season to at an end for the season.<br />\nthe Barnstormers Friday and back ten years.<br />\nbe lost and that the, smaller col- two or three weeks, some extreme<br />\nBut while the business staff has<br />\nFootball authorities through- leges would be severely handicap- members even favoring its com- accomplished its work, the cat<br />\nSaturday nights,<br />\nThe contributors are John Held, out the country receiyert the new ped. He expressed great surprise plete abolition. In general, how- still has to meet its greatest test.<br />\nJr., who drew the cover, J. Carroll ruling with surprise and disfavor. at the passing of the new legisla- ever, the chief objection to the Alger Hiss, President of the Barnoriginal plan was that the appor- stormers Club, should, in the role<br />\nThe new rule penalizes a team tion.<br />\nMansfield, H. W.Hanneman, Rube<br />\nfor<br />\nfive<br />\nyards<br />\nthe<br />\nsecond<br />\nand<br />\nthird<br />\nRobert Zuppke, head coach at tionment by• lot of nights for en- of His Majesty, bring to a fitting<br />\nGoldberg, Farr, Thomas Masson,<br />\nincomplete<br />\nforward<br />\npass<br />\nbefore<br />\na<br />\nthe University of Illinois and for- tertainment favored the fraternity climax the reputation for good<br />\nGertrude Stein, Strickland Gilldown.<br />\nIt<br />\nadopted<br />\nby<br />\nfirst<br />\nwas<br />\nmer president of the National As- giving time last party, a defect acting established in three years<br />\nilan, Gerald Cosgrove, Paul Reilly,<br />\nfootball<br />\ncommittee.<br />\nin<br />\nrules<br />\nthe<br />\n-Ken Kling, Frank Crane, Frank<br />\nsociation of Football Coaches, remedied by the proposed week of of participation in Barnstormer<br />\nNew<br />\nYork<br />\nlast<br />\nSaturday.<br />\nsaid that the restriction of the \"open house.\"<br />\nnamely, Newman Levy, Nina Wilplays. John Desch, co-satellite<br />\nFootball<br />\nIn case the Board reaches no with I. Evans Rodgers in A Tailorto<br />\nbe<br />\ncoaches seem<br />\ncox Putnam, Clarence Gettier,<br />\nforward pass was a step backMcReadf Huston, \"Tad,\" Tip unanimous in the opinion that ward. He is of the opinion that decision, this year's agreement Made Ilan, in his present role of<br />\nEdmund Duffy, Charles this rule is one of the greatest the rule will not lessen the use will remain in force, according to the flapper, Marie Breede, gives<br />\nblows football has ever received.<br />\nthe constitution.<br />\n(Continued on p. 3, col. 2)<br />\n(Continued on p. 3, col. 2)<br />\n(Continued on p. 3, col. 2)<br />\nLas,t Minute Contributors<br />\n<br />\nThe two most important last<br />\nminute -Celebs\" are Dr. Frank<br />\n<br />\nMOIL<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n$9.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December<br />\n<br />\nMd.;<br />\n<br />\nBaltimore,<br />\n<br />\nunder Act<br />\n<br />\nof<br />\n<br />\nfrom<br />\n<br />\nPublished semi-weekly<br />\n<br />\n3. 1909, at<br />\n3, 1879.<br />\n<br />\nthe Postoffice at<br />\n<br />\nCongress, November<br />\n<br />\nOctober to June<br />\n<br />\nby<br />\n<br />\nthe students<br />\n<br />\nof Johns<br />\n<br />\nHopkins University.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNrvicasTry ; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\n<br />\nTelephone.<br />\n<br />\nHomewood 0100<br />\n<br />\nEditor-in-Chief<br />\nJ. HENRY JARRETr, '27<br />\n<br />\nBusiness Manager<br />\n<br />\nEUGENE O'DUNNE, JR., '27<br />\n<br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br />\n<br />\nAdvertising Manager<br />\n<br />\nMORTON HAMBURGER, JR., '28<br />\nTHOMAS<br />\n<br />\nF. McNEAL, '27<br />\n<br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\n<br />\nCirculation Manager<br />\n<br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br />\n<br />\nHEYWARD<br />\n<br />\nE.<br />\n<br />\nBOYCE, JR., '27<br />\n<br />\nJunior Editors<br />\n<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nCosato G. MACKENZIE,<br />\n<br />\nJOHN<br />\n<br />\n'29<br />\n<br />\nG. TURNBULL, '29<br />\n<br />\nAssistant Business Managers<br />\n<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT. '29<br />\nLouts M. RAWLINS. '28<br />\nH. ADDISON CAMPBELL, '29<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br />\n<br />\nHOMEWOOD; BALTIMORE, MD., MARCH 26, 1926.<br />\n<br />\n\"HIS MAJESTY\"<br />\nPeace, perfect peace, has again settled upon the Barn.<br />\nAfter weeks of frantic,hammering and sawing on the part of the<br />\nProperty Staff; and of nocturnal rehearsals of the equally hard<br />\nworking cast, the clamor is ceased and the turmoil done. Tonight, the work of all these weeks will reach its consummation<br />\nin the opening performance of \"His Majesty Bunker Bean\" at<br />\nthe Lyric.<br />\nThe campus is looking forward to the event expectantly,<br />\nfor of late years the Barnstormers play has been considered<br />\nthe leading single event staged by any of the non-athletic activities. And quite rightly so, for the Barnstormers are good.<br />\nPlenty of undergraduate talent, interest on the campus, and<br />\nthe able coaching of Mr. Swindell have succeeded, during the<br />\npast few years, in making the Barnstormers a strong organization.<br />\nAll these factors, coupled with the known ability of this<br />\nyear's cast, and the happy selection of the play, seem to make<br />\nanother success assured. So, in common with the rest of the<br />\ncampus, we are looking forward to seeing -His Majesty\" with<br />\na great deal of pleasure, and we wish the Barnstormers all<br />\nthe luck in the world, which, however, we know they will not<br />\nneed.<br />\n<br />\nTWENTY-FOUR HOUR SERVICE<br />\nAnother event which helps to make this evening a really<br />\nred letter date is the appearance of the Celebrity Number of<br />\nthe Black and Blue Jay.<br />\nThe Jay shares the fate reserved for most campus .periodicals in that it has come to be'considered very much as a matter<br />\nof course. Organizations like the Musical Club and Barnstormers have periods of preparation followed by the climax of a<br />\nlarge performance; and, after basking in the pleasant rays of<br />\nthe lime light, they rest on their laurels until the following<br />\nyear.<br />\nBut the Black and Blue Jay can follow no such course.<br />\nAt the very time an issue comes off the press, the staff members are already hard at work preparing the next. There is<br />\nno let up, for its regular appearance is fully expected. During<br />\nits few years of existence, the Jay has won a real place on the<br />\ncampus. The same students who take the magazine as a matter of course would be the first to raise violent complaints if it<br />\nwere not in their mail boxes at the accustomed time.<br />\nWe would, then, bestow a great deal of rather belated<br />\ncredit on the men who make up this year's Black and Blue Jay<br />\nstaff. They have held up the standards of one of the most popular and best organized of the campus activities.<br />\nThe culmination of this work is the Celebrity Number.<br />\nThe difficulties in preparing it have been great, but success has<br />\nattended them.<br />\nAfter such an achievement, any other activity would settle<br />\nback to enjoy a well-earned rest, but the Managing Editor of<br />\nthe Jay is already growing gray preparing next month's copy.<br />\n<br />\nTudor-Stuart Club<br />\nGets Old Edition<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nNEWS-LETTER MAILBAG<br />\n(Continued from p. 1, col. 5)<br />\n<br />\nMy exp<br />\nl losion is nearly over.<br />\nAnother addition was recently<br />\nOnly a little settling of the dust<br />\nmade to the extensive library of<br />\n\"Cleanliness,\"<br />\nthe and I am finished.<br />\nBy defeating the unbeaten The Tudor and Stuart Club by<br />\nnext to Godliness.\"<br />\nthird 'edition of they say, \"is<br />\nNaval Academy team with a 42- purchase of the<br />\nhell of a place is our<br />\nCalendar,\" by Ed- My what a<br />\n120 score, Yale University captured the \"Shepherd's<br />\nBarn. Soon, if we are blessed,<br />\n1<br />\nThe very valuable<br />\n; the mythical championship of the mund Spenser.<br />\nour children may see it, a newEast, and finished a season of book was bought in New York by<br />\nwill rise out of its north.<br />\nBarn<br />\nDr. Raney, Johns Hopkins librafifteen consecutive victories. The<br />\nrian and member of the club, for Then under its guidance of its<br />\nEli•swimmers piled up 610 points about $1,500.<br />\nwe may approach -Godlito their opponents 256, the closest<br />\nThere are only three editions of ness\" and beautiful music.<br />\nmeet being with Dartmouth, this volume in the United States,<br />\nMy ravings are over, the clouds<br />\nagainst whom the score was 34-25. and only six in the world. Though<br />\nstill float past, the grass has gotThe only Navy man to take a race there is already a rare fourth ediaway from the New Haven aggre- tion work by Spenser in the Tudor ten greener, the courts are lined<br />\ngation was Allen, who defeated and Stuart library, this. latest and I feel relieved. .<br />\nNedpath, who was swimming his purchase is probably considered<br />\nYours insanely,<br />\nfirst dual meet for Yale in the even more valuable than the forCRAZY RAVING MADMAN.<br />\nbreast stroke.<br />\nmer.<br />\nYale broke five of the eight InA NEW LINE<br />\ntercollegiate records this year. pended publication for an indefi—not ' the one you tell that<br />\nCaptain J. D. Bronson holds three nite period. Its well-known buildgirl.<br />\n—but the ItIontal-Craft line of<br />\n,new records; 53:9.10 seconds in ing in Cambridge has been lost by<br />\nsuitings for the spring.<br />\nthe 100-yard dash; 23:3-5 seconds foreclosure of heavy mortgages<br />\n—It will save you money to<br />\ntake a look.<br />\nin the 50-yard dash; 2 minutes, upon it. Since the building Stands<br />\n21 :4-5 seconds in the 220. House over an underground river which<br />\nlowered his own mark in the 150- is yearly weakening the structure,<br />\nyard backstroke, setting it at 1• the editors did not consider it<br />\nminute, 44:4-5 seconds. The four worth while to attempt to pay off<br />\nerArNit)<br />\nman team in the 200-yard relay the debts.<br />\n*<br />\n*<br />\n•<br />\nmade the distance in 1 minute,<br />\nt- T<br />\n.<br />\n•_7<br />\n4<br />\n35:4-5 seconds.<br />\nTtte Sandspur of Rollins College, Florida, runs a society colg3catim ore<br />\nthe<br />\nwon<br />\nUniversity<br />\nCornell<br />\numn in which choice bits like the<br />\n•<br />\nfrequently.<br />\nwrestling<br />\nIntercollegiate<br />\nEastern<br />\nfollowing appear<br />\nSee \"GARD\" MALLONEE & FRANK MEREDITH at the Barn<br />\nchampionship by scoring twenty- -Iverne Galloway is,a real snake<br />\nDowntown at 407 N. GAY St.<br />\ntwo points. at Penn State last charmer—this was demonstrated<br />\nSaturday. • Lehigh, .Penn State, at the lake shore the other day.\"<br />\n*<br />\n*<br />\n*<br />\n*<br />\nYoung Men's Furnishings<br />\n*<br />\n•<br />\nand Yale finished in the order<br />\nThe Prices Are Right.<br />\nWhere<br />\nnamed after the winner. ColumIn an article upon honor sysbia, Pennsylvania, Princeton and tems in general the following apSyracuse also had teams entered. pears in the \"New Student.\" \"PutRussell, captain of the Eli mat- ting a person upon his honor<br />\nE. BALTIMORE ST.<br />\nmen, won his third Intercollegiate means trusting him absolutely or<br />\nchampionship in the 175-pound it means nothing. The pride of<br />\nDeveloping<br />\nclass by using his favorite three- honor is the pride of being relied Kodaks<br />\nPrinting<br />\nCameras .<br />\nquarter nelson, which has come on without being watched, be- Supplies<br />\nEnlarging<br />\nto be called the \"Yale -Lock.\"<br />\ncause one has honor.\"<br />\n•<br />\n*<br />\n*<br />\n*<br />\n*<br />\nZepri Photo Supply Co.<br />\n<br />\nNEWS<br />\n<br />\nr<br />\n<br />\n. . .,.i<br />\n, _N<br />\n(. 4„..\".........<br />\nr11411d01{,s<br />\n<br />\nMc PHERSON'S<br />\n11<br />\n<br />\nPhone: Homewood 9621<br />\n<br />\nPrinceton University musical<br />\nclub members must wear garters<br />\nFANCY DELICATESSEN<br />\nat all performances, according to<br />\nN. Charles St., Balto., Md.<br />\n2022<br />\n•an official ruling of the legislative<br />\nRATES FOR HOPSPECIAL<br />\ncommittee.<br />\nKINS STUDENTS<br />\nThe Rutgers Glee Club ended<br />\nits season by a banquet in New<br />\nYork followed by a theatre party.<br />\n<br />\nBOULEVARD RESTAURANT<br />\n<br />\nThe Jesters, Western Maryland's musical club, will tour the<br />\nEastern Shore and visit seven of<br />\nthe largest towns.<br />\nA mustache contest is in progress at the University of Arkansas. A year's subscription to the<br />\ncampus paper will be given as a<br />\nprize to the student growing the<br />\nmost foliage in one month:<br />\nAt last the reason why one out<br />\nof every five has it is explained.<br />\nThe Dean of Clinical Dentistry at<br />\nthe University of Rochester says<br />\nit is a result of promiscuous petting and kissing.<br />\n* *<br />\nDrinking at the University of<br />\nMissouri has been officially abolished, with the fraternity men<br />\nacting as vigilants. Fraternity<br />\npresidents in conference with<br />\nschool officials adopted a resolution prohibiting drinking at<br />\ndances, school functions, and serenades.<br />\nThe men of the University of<br />\nVirginia have an honor agreement<br />\namong themselves by which they<br />\nare pledged to do no drinking at,<br />\nor for six hours before, any university function at which women<br />\nare present.<br />\n*<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n*<br />\n<br />\n'I 1:f, I arvard Lampoon has sus-<br />\n<br />\nCoRoNA<br />\nThe Personal Writing Machine<br />\n<br />\n3044 Greenmount Ave.<br />\n<br />\nUs Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br />\n<br />\nLet<br />\n<br />\nBETHOLIN<br />\n'THE WONDER MOTOR FUEL:<br />\n<br />\nOF COURSE, HOPKINS<br />\nMEN ALWAYS INSIST<br />\nON BETHOLINE<br />\n<br />\nM.W.LUCY & CO.<br />\n104 W. Fayette St.<br />\n<br />\nSHERWOOD BROS., INC.<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW & FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br />\n<br />\nFURNITURE OF QUALITY<br />\nDeal with a Finn equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br />\n<br />\nSPEAKING<br />\n<br />\n\"BUNKER BEAN\" AT LYRIC<br />\n<br />\nof<br />\n<br />\npromise of surpassing his sterling<br />\nperformance of 1925. Ralph TownSPORTS<br />\nsend, Jerome Shapiro, Evans<br />\nNot many day will have passed Rodgers, Louis Hamburger, and<br />\nbefore football togs will come out the rest of the cast will furnish<br />\n. of dark lockers into the sunlight more than adequate support for<br />\nof early spring. Already the the principals.<br />\nHis Majesty Bunker Bean makes<br />\nsquad has held an organization<br />\nmeeting and decided to begin his appearance as the most efficipractice immediately after the ent clerk in the .office of J. B.<br />\nEaster recess: Many of the pig- (-Pops\") Breede. Inheriting a<br />\nskin artists are engaging in other considerable sum of money from<br />\nsports to keep in condition. Mal- his aunt, he visits the psychic<br />\nlonne and Kaufhortz are consid- shop conducted by the Countess<br />\nerably in evidence on the lacrosse Casanova and Balthazar, a prefield and Pindell puts in his after: tended believer in transmigration<br />\nof souls. Inspired by the belief<br />\nnoons on the track.<br />\nfostered by Balthazar that he is<br />\nthe reincarnation of a mighty<br />\nGeorge Washington is going<br />\ninto spring training with great Egyptian emperor, Bunker Bean<br />\nearnestness. Like many other skilfully plays the stock market<br />\n-colleges the Washingtonians place and amasses a large fortune. Disa great deal more stress on the covering that he has been tricked<br />\npreliminary training than does by Balthazar, however, Ile is on<br />\nJohns Hopkins. The Washington the verge of despondency when<br />\ngridders and University of Mary- Bud Matthews, \"the.greatest leftland are considering a \"spring foot- hand pitcher in the world,\" comes<br />\nball game tO terminate the spring to his rescue and convinces him<br />\nthat he has succeeded through his<br />\npractice.<br />\ntrue personality, and not through<br />\nhis belief that he was a superior<br />\nThis will certainly be an innobeing.<br />\nvation in the sport. Many objections may be offered to such a<br />\nproposal but the idea is nevertheNEW FOOTBALL RULINGS<br />\nless a very good one.<br />\n*<br />\n<br />\nCOLLEGIATE STYLE<br />\n+<br />\n<br />\n(Continued from p. 1,-col. 5)<br />\n<br />\n++<br />\n<br />\n+<br />\n<br />\n++++++<br />\n<br />\n+ + .t.<br />\n<br />\nROBBINS' HATS<br />\n+41<br />\nA BIRD OF A HAT<br />\n32 East Baltimore Street<br />\nFormerly LeBrou Co.<br />\n<br />\nYou Will Be<br />\n<br />\nSURPRISED<br />\n•<br />\n<br />\nTo Learn<br />\nof the incredible amount of money<br />\ncomprising the assets of the combined Life Insurance Companies.<br />\nDollar for dollar, they will check<br />\nthe total assets of all the Savings Banks in United States, and<br />\nstill have a surplus of $2,000,000000 or enough left over to buy<br />\nhalf of the assets of all the Building and Loan Associations in the<br />\nUnited States.<br />\n<br />\nT<br />\n<br />\nERE is no hat worry for the<br />\nStetson wearer. He is as sure of the<br />\nstyle of his hat as he is of the quality.<br />\n<br />\nThe Guardian Life Insurance Company of America is looking for<br />\nred-blooded he-men to help them<br />\nkeep pace with the too rapidly<br />\ngrowing market for Life Insurance.<br />\n<br />\nG. A. Myer, Mgr.<br />\n<br />\nSTETSON HATS<br />\n<br />\nTHE GUARDIAN LIFE INSURANCE<br />\nCOMPANY OF AMERICA<br />\n<br />\nStyled for young men<br />\n<br />\nFounded 1860<br />\nBaltimore, Md. M<br />\n423 Munsey Bldg.<br />\n<br />\n(Continued from p. 1, col. 3)<br />\n<br />\n*<br />\n<br />\nLacrosse is away with a flurry<br />\nthis year. All winter the athletic<br />\noffice has been besieged with many<br />\nrequests for data concerning the<br />\nexpense of putting out a lacrosse<br />\nteam. The movement in the sport<br />\nis nation-wide, communications<br />\nhaving come from California and<br />\nthe south. There are pioneers in<br />\nthe sport as far south as Alabama.<br />\n*<br />\n<br />\nGeorgia \"Tech\" wrote to Father<br />\n\"Bill\" Schmeisser for rules and<br />\ndirections on how to play the Indian game.<br />\nArmy, the University's opponent for April 25, has already<br />\nworked for some time in preparation for her rather difficult schedule. The high spots of the Army<br />\nseason will probably be Onondaga, Johns Hopkins and Navy.<br />\nThe West Point aggregation will<br />\nplay the Indians before Johns<br />\nHopkins does.<br />\nThe Rutgers lacrosse squad has<br />\nalso turned out with five of last<br />\nyear's first twelve back.<br />\n*<br />\n<br />\n*<br />\n<br />\nA recent comparison of figures<br />\n\" from other college athletic authorities shows the student at this<br />\nUniversity to be better off than<br />\nthe average in regard to fees.<br />\nOne college has a combined activities and athletic fee of $60 a<br />\nyear. This is the highest listed.<br />\nUniversity of Virginia demands a<br />\nfee of $20 for the same privileges<br />\nthat are here offered. Yale and<br />\nOther colleges ask a larger fee<br />\nthan does Johns Hopkins and in<br />\naddition asks another sum to defray the expenses of towel service<br />\nand lockets. Notre Dame charges<br />\n140 fee but only three games are<br />\nPlayed at home in their rather<br />\nlong football season.<br />\n<br />\nof the pass in the latter part of<br />\ngames, by losing teams. This last<br />\nminute effort to get out of the<br />\nruck will lack the daring of the<br />\nold pass.<br />\nJesse Hawley, coach of last<br />\nyear's famous Dartmouth team,<br />\nis of the opinion that the infliction of the penalty will retard the<br />\ndevelopment of the game and lessen the offensive possibilities from<br />\nwhich a team may choose.<br />\nHawley, whose team depended<br />\nlargely on the pass as an instrument,of attack, voiced his disappointment at the new ruling. Although the development of the<br />\nforward pass has been slow, it has<br />\nrecently become one of the main<br />\nfactors of the game. It will now<br />\nbe relegated to its former use,<br />\nthat of a last desperate resort.<br />\nA five yard penalty will be disregarded by a losing team.<br />\nThe general opinion is that the<br />\nnew rule will be a great obstacle<br />\nto scientific football. It will lessen interest in the game and cripple one .of its most popular features. Football will tend to revert to the old close defense and<br />\nline-backing style.<br />\nNot least<br />\namong the evils arising under the<br />\nnew conditions will be the increased interruptions and penalties.<br />\n<br />\nCELEBRITY JAY RELEASED<br />\n(Continued from p. 1, col. 1)<br />\n<br />\nShaw, George Boas, Sidney Nyburg, Raymond Tompkins, Yardley, Innis Lyon, Ellis Parker Butler, Maurice Day, George Ade,<br />\nCharles Dana Gibson, Crosby.<br />\nThis list is regarded as almost<br />\nperfect by the Blue Jay staff and<br />\nthe issue is expected to be a great<br />\nsuccess as a result of it.<br />\nThe Blue Jay Banquet, at which<br />\nelections will be held, has been<br />\nannounced for the ninth of April.<br />\n<br />\n'WIOIL. •<br />\n<br />\nThe big or<br />\nlittle company<br />\nwhich?<br />\nsurely be buried in the<br />\nI big company,\"say some.\"Everything is red tape, and you'll end up<br />\nin a groove in some little department.'<br />\n\"Your little company never gets<br />\nyou anywhere,\"others assert. \"The<br />\nbigger the company the bigger your<br />\nopportunity.\"<br />\nWhether a plant covers a hundred acres or is only a dingy shop<br />\nup three flights is not so important<br />\nas whether the company is concerned with improving its product<br />\nthrough the development of its<br />\nmen and their ideas.<br />\nThere are ably managed and growing companies in growing,forwardlooking industries which offer you<br />\na chance to grow with them.<br />\n<br />\n\"VOU'LL<br />\n<br />\nPublished<br />\nfor the<br />\nCommunication<br />\nIndustry<br />\nby<br />\n<br />\nstern Electric Ccmpany<br />\nMakers of the Nation's Telephones<br />\n<br />\nNumber 58 of a series<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br />\nSEASON TICKET SALE MAY<br />\nBE EXTENDED FOR A<br />\nFEW MORE WEEKS<br />\nReturns Only One-Fifth Of The Total<br />\nSet By Athletic Association<br />\nAs Goal For Drive<br />\n<br />\nResults in the season ticket sale<br />\nhave been very poor up. to the<br />\npresent date. In the three weeks<br />\nthat. have elapsed since the sale<br />\nwas started on Friday, March 5,<br />\nonly for 240 tickets, or $1,200,<br />\nhave returns been made. The situation has such a bad outlook that<br />\nthe time of the contest may . be<br />\nextended for a few weeks, instead<br />\nof ending tomorrow; as hereto-fore<br />\nintended.<br />\n<br />\n•<br />\n<br />\nPi Kappa Chi. Leads<br />\nIn the group contest the Pi<br />\nKappa Chi fraternity is-leading;<br />\n$220 having been turned in.. Iii<br />\n<br />\nFreshmen Named<br />\nTo Collect Dues<br />\n<br />\nENGINEERING STUDENTS<br />\nROLL IN BOWLING<br />\n<br />\nCONTESTS<br />\nRichard Todd, treasurer of the<br />\nf1<br />\nles man class announces that<br />\nElectrical Engineers Vanquished,<br />\nall freshman class dues must be<br />\nBy Mechanical Engineers<br />\npaid in full before the banquet.<br />\nIn Three Games<br />\nTodd, in order to facilitate the<br />\nOnce more the old rivalry becollection of the money, has apmen<br />\npointed the following thirteen<br />\ntween the Mechanical and Electrito assist in the collection: Hecht, cal Engineers burst forth when<br />\nLausch, E. C. Stuart, Dowell,<br />\nTruehart, Brack, Turnbull, H. B. the Junior Mechanical Engineers<br />\nHammond, Tydings, Hiss, Wolfe,!knocked the pins from under the<br />\nFarinholt and Richards. These Junior Electrical Engineers in a<br />\nmen will be at the Barn every series of bowling matches.<br />\nday during the lunch hour to reEngineers<br />\nMechanical<br />\nThe<br />\ncMve money. Class dues are now<br />\nproved their superiority over the<br />\nfive dollars and include tickets<br />\nElectrical Engineers by taking<br />\nfor the banquet.<br />\ntwo out of the three matches.<br />\n<br />\nY. M. C. A. To Elect<br />\nOfficers Tuesday<br />\n<br />\nThe annual election of officers<br />\nthe Y. M., C. A. will be held on<br />\nof<br />\nsecond place is Omicron Kappq.,<br />\n-day, in the Y. M. C. A. offices.<br />\n^Tiles<br />\nOmicron Fraternity, with $150;<br />\nVotes may be cast between 10:00<br />\nthird,- a group headed by Maxwell<br />\n,A., M. and 4:39 P. M.. Only memCone, with '$125; and the Beta bers of the -Y\" are entitled to<br />\nTheta Pi Fraternity, with $115. vote.\\<br />\nAltogether the average group sale<br />\nIn accordance with the ruling<br />\nis much less than. $100. .Manager of the -Y,\" the candidate for President receiving the second highest<br />\nKeyes reiterates that Unless 1200,<br />\nnumber of votes automatically<br />\ntickets are sold the Athletic Asbecomes Vice-President.<br />\n. deficit<br />\nsociation.'.<br />\nflie candidates are as follows:<br />\nat the end of the year:<br />\nPresident, Robert Bull, Jr. and<br />\nLowell Ensor ; Secretary, Louis<br />\nRawlins and Theodore Fischer;<br />\nZIONIST CLUB CHANGES<br />\nTreasurer, Maxwell ..-Vrmor and<br />\nNAME AT MEETING<br />\nClark Wisotzki.<br />\n<br />\nSociety Becomes A Member Of The<br />\nAvukah Organization<br />\n<br />\nAddresses<br />\n<br />\nVISIT TO LARGE CROWS' ROOST<br />\n<br />\nDr. Israel, rabbi of the liar<br />\nOn Saturday, March thirteenth, about sundown and settle down<br />\nSinai Congregation, will contin'ue the Field Club made a very inter- by dark. It is interesting to note<br />\ntoday his lectures on Jewish His- esting trip to visit one of the that the crows only roost there<br />\ntory. His topic will be \"The Ori- largest crow roosts in the United during the colder months. In the<br />\ngin and Development of Reform States. The naturalists left the summer they migrate to different<br />\nAfter the lecture, University at about three o'clock places to lay their eggs. Another<br />\nJudaism.\"<br />\nwhich will be held in Room 112, in the afternoon and reached the rather unusual characteristic of<br />\nGilman Hall, a general discussion roost (near St. Agnes' Hospital these birds noted by Dr. Cowles<br />\nwill take place.<br />\n•<br />\nat Arbutus,. Maryland), at about was the desire of some of their<br />\nLast Friday, Mr. E. Milton Alt- seven. They remained to see number to spend the night in the<br />\nfeld, assistant state's attorney, about two thousand crows. settle near vicinity of large electric<br />\ndelivered a lecture before the so- themselves for the night and then lights. He said that starlings, so<br />\nciety on \"Heinrich Heine.\" The returned home.<br />\nfamiliar to the city dweller, also<br />\nspeaker emphasized the ardent<br />\nThis trip has come to be a year- often manifest a similar weakness.<br />\nJewish faith of the German poet, ly affair for the members of the The crows which patronize the<br />\nsuch that if. he were living today, club and is looked forward to with Arbutus roost are of the common<br />\nhe. Would probably be a zealous much pleasure. The roost was variety known as eastern crows.<br />\nZionist, working for the caUse of formerly, if not now, one of the<br />\nDr. Cowles stated there are a<br />\nhis faith.<br />\nmany of these roosts or rookgood<br />\nlargest in the United States.<br />\nNOTICE<br />\nTry-outs for the Tocqueville<br />\nMedal will be held by Dr.<br />\nFrench in Room 112, Gilman<br />\nHall, on Tuesday, March 30, at<br />\n12:30.<br />\n<br />\nAbout 1880, in the neighborhood<br />\nof two hundred thousand crows<br />\nwere said to roost there every<br />\nnight In recent years there have<br />\nnot been quite .so mqny. The<br />\ncrows only remain there at night<br />\nand wander abroad in the daytime<br />\nin search of food. They conic<br />\n<br />\nNEWS-LETTER<br />\n<br />\nOutdoor track practice has been<br />\nprogresSing well during the past<br />\nweek under the Management of<br />\nCoach Edwards. Watson Pindell,<br />\nBull, Willison, and Robey have<br />\nbeen shining in the dashes, while<br />\nMcNeal and Gilpin have been<br />\nworking on the shot put and discus. In the middle distances Burnett has been making good time.<br />\nStick, Young, Hill, and Pindell<br />\nare the pole vaulters who show<br />\nthe most promise among the can<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nMAILBAG<br />\n<br />\ndidates.<br />\nCLEAN UP THE BARN<br />\nYoung narrowly escaped injury<br />\nWednesday when the pole with To the Editor of the A ca:8-Letter:<br />\nwhich he was vaulting broke, caus- Dear Sir:<br />\ning him a serious fall.<br />\nClouds float' lazily over head,<br />\nthe tender shorts of grass push<br />\nM. E.'s Experienced<br />\nway through the drab earth,<br />\nApparently the Mechanical En- HULLABALOO ADVERTISERS their<br />\nthe courts are rolled and there<br />\ngineers are not without experiREMITTING PROMPTLY<br />\ncourses throngh my veins an urge<br />\nence in the alley pastime. Havto explode, to free myself. Of all<br />\nReturns To Date Exceed Totals Of<br />\ning rolled their way to striking<br />\n;encumbrances, its a yearly event<br />\nFormer Years By $250<br />\nso don't worry, 4 shall survive.<br />\nvictories their total for the three<br />\nEditor-in-Chief Feeling as I do I must roast someTurnbull,<br />\nHenry<br />\ngreatpins<br />\nfifty-one<br />\nmatches was<br />\nof the Hullabaloo, has announced thing . and that something is our<br />\ner than that of their opponents.<br />\nthat $1,300 has been received in Barn, our beloved Barn.<br />\nBoth teams were composed of payment for advertisements. UnHow the cows must turn over<br />\nfive members each, exponents of like former times in which adver- in their grave, unless they werethe game from infancy, having tising was a source of much wor- used for beef, when they hear the<br />\nbeen raised with bowling balls in ry, this is a banner year; the pitiful, -pan, pan, tin, tin,\" of<br />\nreceived at this early date the' so-called ,music box. In the<br />\ntheir hands in lieu of the more amount<br />\nexceeds the final results of previ- midst of \"I want to be Happy,\" a<br />\nconventional rattle.<br />\nous years by $250.<br />\nsudden silence, the E is dead.<br />\nKnighton, of the Electrical EnThe pictures of the R. 0. T. C., Dead as the first tuner that ever<br />\ngineers, was high man with a to- the Swimming Team, the Track swung a rubber hammer. It is<br />\ntal of 127spins for one game. His Team, and the Lacrosse Team will an outrage to the intelligence of<br />\nsmashing tactics were unap- be taken on Monday and Tuesday. those musical' minded students<br />\nbe posted on the Bul- who in their leisure moments, enproached by any of the other con- Notices will<br />\nletin Boards at the Barn and Gil- gineers included frequent the.<br />\ntestants.<br />\nman Hall as to the correct time Barn. Their aesthetic nature<br />\nInnovation<br />\nfor the sittings. Proofs of the must revolt as much as the cows<br />\nThis series of matches marks an<br />\norganization -write ups\" will be at the clash and noise that pours<br />\ninnovation in inter-class sports. completed, subject to approval, forth. The \"Song of the Flame\"<br />\nIt seems probable That matches within two weeks. Full payment is played and well it would be<br />\nwill become a common occurrence for these. is expected not later that the old piano were placed in<br />\nthan five days from that date.<br />\nthe midst of the hottest and highin the favorite alleys.<br />\nhave turn- est flame.<br />\nseniors<br />\nthe<br />\nall<br />\nNearly<br />\nThe line-up of the two teams<br />\ned in their lists of activities, which<br />\n(Continued on p. 2, col. 5)<br />\nwas as follows: Mechanical Enhave been prepared for the pringineers: J. E. Howard, Towman, ter. Those men who did not turn<br />\nWhitney, Dewling .and Cushing. in a list will be classed simply as<br />\nElectrical Engineers: Knighton, \"Member of the Class .of 1926.\"<br />\nFiege, Conklin, Mills and Shult- All the individual write-ups have<br />\nbeen completed, and Book I of the<br />\nheis.<br />\nHullabaloo is ready to be printed.<br />\nWith college parties on<br />\nThe Junior Mechanical . EngiThe art staff has recently finishfamous\"0\"steamers of<br />\nneers have issued a challenge to ed up most of the drawings. The<br />\nall other groups in the University. drawings for the classes, athletics,<br />\nWrite for Illustrated Booklet.<br />\nThe Junior Civil Engineers have student council, student activities,<br />\nSchool of<br />\nForeign Travel, Inc.<br />\nare<br />\naccepted the challenge and will be fraternities and many others<br />\n1l2 College St., New Haven,Cone.<br />\n.<br />\nsk<br />\nnow in the hands of the engravers.<br />\nmet on Wednesday.<br />\n<br />\nAs an incentive to the progres- Regester<br />\nEngineering Society<br />\nsive change that is being under-,<br />\nThe local student chapter of<br />\ngone, by the Zionist Society, the<br />\nAmerican Society of Civil Enthe<br />\nname of the organization was<br />\ngineers was addressed last Frichanged to the Avukah Society,<br />\nday evening, March 19, by Robert<br />\nas the Johns Hopkins branch of<br />\nT.. Regester, .a member of last<br />\nthe! National Collegate Avukah year's graduating class.<br />\nThe<br />\nOrganization. This change will speaker chose for his topic \"The<br />\nnot only affect the name but many Design and Construction of Wood<br />\nof the policies. of the old, organiza- Stove Pipe Lilies\" and made it<br />\ninto a very interesting talk.<br />\ntion so that it is soon expected<br />\nMr. Regester now holds the<br />\nto till a. more useful place in camposition of Junior Civil Engineer<br />\npus activities.<br />\nwith the Baltimore Sewer DiviIn order to procure more memsion. In having him speak, the<br />\nbers to further the new develop- Society followed its recently<br />\nment, Israel Chodas, President,<br />\nadopted policy of seeking successappointed Aaron Snyder as chair- ful young Hopkins graduates to<br />\nman of the membership commit- address them.<br />\ntees There was also a publicity<br />\ncommittee appointed of which<br />\nFIELD CLUB PAYS INTERESTING<br />\nSamuel Belsky is chairman.<br />\nDr. Israel To Speak<br />\n<br />\nTrack Men Showing<br />\nWell In Work-Outs<br />\n<br />\neries in various parts of the country. They are frequented by quite<br />\na number of varieties of crows:<br />\nnorthern, southern, western, Canadian, etc. A somewhat unusual<br />\nspecies is that known as the fish<br />\ncrow which is distinguished by<br />\nits very short call.<br />\n<br />\nTourist<br />\nthird cabin<br />\n<br />\ntoEUROPE<br />\n<br />\nThe Royal Mail Line<br />\n<br />\n$1,000.00<br />\nIN ONE SUMMER<br />\nalso.<br />\nA few men needed—Organization and part-time work<br />\nSee:<br />\nDON BOLTON, P. 0. Box 469<br />\n<br />\nThe Training School for Jewish Social Work offers a fifteen months' course of graduate study in Jewish Family<br />\nCase Work, Child Care, Community Centers, Federations<br />\nand Health Centers.<br />\nSeveral tuition scholarships and maintenance fellowships<br />\nare available to especially qualified students.<br />\nFor further information, address the Director,<br />\nTHE TRAINING SCHOOL FOR JEWISH SOCIAL WORK<br />\n(Initiated by the National Conference of Jewish Social Service).<br />\n<br />\n210 West 91st Street<br />\n<br />\nNew York City<br />\n<br />\n8<br />\n<br />\n0<br />\n<br />\nNN<br />\n<br />\nti<br />\n<br />\nc;<br />\n<br />\n\f", "format": "basic_html", "processed": "SELL<br /><br />\nSELL<br /><br />\nTICKETS<br /><br />\nTICKETS<br /><br />\nVOL. XXX, No. 42<br />\nCELEBRITY JAY WILL BE<br />\nRELEASED TONIGHT<br />\nAT BARNSTORMERS<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 26, 1926.<br /><br />\nRed Eagles Begin<br />\nPractice Next Week<br /><br />\nLACROSSE TEAM READY<br />\nFOR INITIAL GAME<br /><br />\nOF SEASON<br />\nIt was announced Wednesday<br />\nThirty-Five Men of Note Contribute that the Hopkins Red Eagles will<br />\nSt. Johns Game One Week Ahead<br />\nTo Seventy-Two Page Number—<br />\nWill Be Test For Team<br />\nbegin lacrosse practice on Strauss<br />\nPlan Largp Distribution<br />\nOf Veteran Players<br />\nField next week, as soon as the<br />\nThirly-five men of national or Varsity squad is transferred to<br />\nOne week from tomorrow, the<br />\ninternational fame are contribn- the upper field. Several attrac- lacrosse team clad in its new spectors to the seventy-two page \"Cel- tive games will be secured for the ially designed uniform will trot<br />\nebrity Number\" of The Black and team, and it is hoped that they out on the field to win or lose in<br />\nPine Jay. which Will be released will play in a preliminary contest the season's inaugural against St.<br />\ntonight at the Lyric. Eleven last before t he Hopkins-Maryland Johns.<br />\nminute sketches and writings have game.<br />\nFor the past twO weeks the labeen received. Among these are<br />\nThe lied Eagles constitute a crossers have been practicing on<br />\nJ. Carroll Mansfield, whose work sort of preparatory school for the Strauss field. With a nucleus of<br />\nappears daily in The Evening Sun Varsity lacrosse team. All but a eight or more veterans of last<br />\nas -High Lights Of History.\" The score of the best players will prac- year's first string, Coaches Van<br />\ndrawing is supposed to show the tice With them, those showing the<br />\n.history of the flapper: Strictland greatest ability being employed on<br />\n.Gillilan, Baltimore's humorist, the first team. 'Special attention<br />\nhas sent in a contribution.<br />\nwill be given to promising fresh-<br /><br />\nOrman, Schmeisser and Darley<br />\nhave succeeded in whipping into<br />\nshape a twelve that gives great<br />\npromise even at this early date.<br /><br />\nPRICE 5 CENTS<br /><br />\nBARNSTORMERS TO GIVE<br />\nPRODUCTION AT LYRIC<br />\nPRESENT \"HIS MAJESTY BUNKER BEAN\" TONIGHT<br />\nSecond Performance Tomorrow; Alger<br />\nHiss And John Desch To Play Major Rolls<br />\nBunker Bean from Boston, that<br /><br />\n\"MOPS\"<br /><br />\nshadowy personality who has for<br />\nmany weeks haunted the neighborhood of the Barn, will make<br />\nhis appearance at 8:15 tonight<br /><br />\nso<br /><br />\nand tomorrow night before the<br />\naudience assembled at the Lyric<br />\nTheatre.<br />\nAccording to all accounts, the<br />\ncomedy will be one whose acting<br />\nhas never been surpassed in any<br />\nBarnstormer, production, whose<br />\nscenery, has never.been excelled in<br />\nlavishness. Rehearsals have been<br />\nheld every evening this week from<br />\nfive to eleven. o'clock under the<br /><br />\nVeterans On Defense<br />\nThe defense is composed of a<br />\nformidable group of old timers<br />\nFour Hurt During<br />\nincluding Captain Levy, Liepenw<br />\nCrane, who. has written an editordirection of Walter B. Swindell,<br />\nLacrosse Practice berger, Biddison, Berndt, Gersfial on College Morality, which<br />\nJr., coach of the Barnstormers,<br />\nLacrosse practice during the meyer, and Ferlano. Schwartz<br />\nlooks very out of place on the ediis<br />\n•<br />\na<br />\nnewcomer<br />\nwho<br />\nis<br />\nstepping<br />\nI. Evans Rodgers. The latter,<br />\nand<br />\npast week has not been without<br />\ntorial page of The Black and Blue<br />\nrather much into the limelight,<br />\nwho took the leading part in 4<br />\nJay so we are told, and Rube its mishaps. Wednesday, Almy lie is liable to change places with<br />\nMan last year, has<br />\nTailor-Made<br />\nCarl Stissel, who will play Mrs.<br />\nGoldberg. Rube's drawing de- injured his tack, Robinson had a Biddison any time that Biddison<br />\nBreede tonight at the Lyric<br />\nbeen greatly instrumental in impicts the ever refreshing Boob Mc- lacrosse stick poked into his eye, is needed on the attack. When<br />\nproving the intonation and acting<br />\nNutt testing. the gravity of apple and Levy and McNeil each sus- he is not at one of the points.<br />\nsauce. Of equal import is Ken tained a cut directly over the eye. Biddison is playing home at the<br />\nof the Bunker Bean cast. Rodgers<br />\nINTERFRATERNITY BOARD himself has the role of the psychic<br />\nKling, originator of the famous Many of the stickmen also corn- oilier end of the field.<br />\nJoe Quince.<br />\nSTILL UNDECIDED<br />\nplain of minor cuts and bruises. I The attack can boast of a few<br />\nBalthazar.<br />\nFrank Hanley and Edmund<br />\nveterans that lose nothing in comWeeks of Deliberation on \\ew Rushing<br />\nDress Rehearsal<br />\nDuffy of The -Sun are two more<br />\nparison with the defense. Robin_Agreement<br />\nFruitless<br />\nLast night the Barnstormers<br />\nwhose drawings are just in time. Athletic Association<br />\nson is back at his old position on<br />\nA<br />\nstruggle<br />\nbetween<br />\nthe<br />\nradical<br />\ntheir final rehearsal, in full<br />\nheld<br />\nEllis Parker Butler whose classic<br />\nTo Give Two Dances one wing, whereas Morrell is playPigs Is Pigs is the favorite of two<br />\nIn order to entertain the la- ing at the other midfield position. and conservative groups of the costume, at the Lyric. By one<br />\nnations has also \"come through\" crosse teams of<br />\nthe United States Cone and Taylor will probably be Interfraternity Board Which has o'clock most of the scenery had<br />\nwith a few words -which Must be Military<br />\nAcademy and Oxford-. the homes for the greater part recently thrown the organization been tran9orted to the Lyric and<br />\nread to be fully .appreciated. Sid- Cambridge,<br />\nof the season. The center position<br />\nthe Athletic Associainto utter confusion reached a cli- been set up by the property staff.<br />\nney Nyburg, Baltimore author,<br />\nis still undecided, many men havtion is planning to give dances on<br />\nmax at the meeting of the Board<br />\nFour complete sets of 'scenery<br />\nhas sent in a poem. It is said that<br />\nApril 10 and April 24. They will ing been tried out for but none<br />\nlast Monday.<br />\nwill be 'employed in the producthis is the first poetry which he<br />\nbe held at 9:00 P. M. in the main appearing satisfactory.<br />\nhas ever published.<br />\nThe<br />\nchief<br />\nsource<br />\nof<br />\ndissension<br />\nThe most interesting to the<br />\ntion.<br />\nballroom of the Hotel Belvedere.<br />\nPromising Newcomers<br />\nIt was hoped that the AssociaPlans For Distribution<br />\nOf the newcomers this year, is the rushing agreement for next audience will probably be the unition<br />\ncould<br />\ninvite<br />\nall<br />\nJohns Hop- Boynton, Helfrish, and Eagan year. The \"Alan which has the que background of the first scene<br />\n-Extensive_plans_bave been completed for the distribution of this kins students to these affairs but seem to be the Most promising. , strongest backing. proposes two in the second act and the scenery<br />\ngreatest of all numbers. The the results of the Spring season Mallonee, Sauerwein, Logan, Mc- Iweeks of closed rushing, then two of the last act executed in the<br />\nUnion News has contracted to sup- ticket sale have made this plan Neil, Kaufholz, and a few others weeks of non-rushing, except for Tudor style of architecture. The<br />\nmummy case which appears in<br />\nply the Jays to all.railroad stations impossible. So tickets for admis- are doing well in the daily scrimnightly entertainments at the var- the second act is one of the most<br />\nin New York, Florida, Massachu- sion will be sold at the Athletic mage.•<br />\nThe new jerseys especially de- ious fraternity houses, and lastly individual pieces ever undertaken<br />\nsetts, Pennsylvania, Maryland,Vir- Office for one dollar, a couple.<br />\nginia and District of Columbia. They may be purchased only by signed by Keyes, Van Orman, and a period of one week during which by the art staff.<br />\nBeside this the Jay will be distri- men who are on the campus or Hoban have arrived. The sweat- the fraternities will keep open<br />\nKing Directed Artists<br />\nbuted in Baltimore by the business otherwise connected with the uni- ers are solid blue. They afford house, with unrestricted rushing.<br />\npreparation<br />\nof the scenery<br />\nThe<br />\ngreater protection to the player<br />\nstaff. Large posters have been versity.<br />\nCard System Considered<br />\nhas been -carried on under the diThe first affair will be featured than any other jersey on the marprinted which will be placed on all<br />\nThe usual silent period will ex- rection of Hadley S. King, who<br />\nrailroad station stands and also by the orchestra of Bob Tula and ket. All the vulnerable spots are, tend from midnight Saturday un- was greatly assisted in the art<br />\non the stands in Baltimore city. the second by the entire Blue Jay lined with porous rubber. Every til eight or twelve o'clock Monwork, especially in the matter of<br />\nprotruding bone will be protected. day, November 8, depending upon<br />\nSome are also being placed on the Orchestra.<br />\ndesigns, by William B. Banks,<br />\ncampus.<br />\nwhether or not the card system of Donald W. White, Isaac Hampledging is adopted. This plan burger, production manager in<br />\nTen thousand copies of this VAN ORMAN CONSIDERS FOOTBALL<br />\nrequires<br />\nall pledges to-turn in the 1924, and Mario Padilo, now a<br />\nnumber have been printed and<br />\nRULING CHANGE ANTIQUARIAN<br />\nname of their chosen fraternity theatrical art director in New<br />\nofficials of The Union News Co.<br />\nthink a reprint may be necessary.<br />\nDr. Van Orman stated that he to the president of the Board by York City. The carpenters, paintAccording to Dr. Ray Van OrThe Jay staff has promised • that man, the drastic step taken by was absolutely opposed to the new twelve o'clock Monday. .<br />\ners, hnd members of the property<br />\nthe magazines will be in the boxes the football rules committee to regulation. He emphasized the<br />\nRadical members of the Inter- staff have been working day and<br />\nat the post office by Monday morn- lessen the effectiveness of the for- fact that the greater part of the fraternity Board seek to cut down night to complete their tasks, now<br />\ning. A good sale is expected at ward pass has carried the game scientific aspect of the game would the length of the closed season to at an end for the season.<br />\nthe Barnstormers Friday and back ten years.<br />\nbe lost and that the, smaller col- two or three weeks, some extreme<br />\nBut while the business staff has<br />\nFootball authorities through- leges would be severely handicap- members even favoring its com- accomplished its work, the cat<br />\nSaturday nights,<br />\nThe contributors are John Held, out the country receiyert the new ped. He expressed great surprise plete abolition. In general, how- still has to meet its greatest test.<br />\nJr., who drew the cover, J. Carroll ruling with surprise and disfavor. at the passing of the new legisla- ever, the chief objection to the Alger Hiss, President of the Barnoriginal plan was that the appor- stormers Club, should, in the role<br />\nThe new rule penalizes a team tion.<br />\nMansfield, H. W.Hanneman, Rube<br />\nfor<br />\nfive<br />\nyards<br />\nthe<br />\nsecond<br />\nand<br />\nthird<br />\nRobert Zuppke, head coach at tionment by• lot of nights for en- of His Majesty, bring to a fitting<br />\nGoldberg, Farr, Thomas Masson,<br />\nincomplete<br />\nforward<br />\npass<br />\nbefore<br />\na<br />\nthe University of Illinois and for- tertainment favored the fraternity climax the reputation for good<br />\nGertrude Stein, Strickland Gilldown.<br />\nIt<br />\nadopted<br />\nby<br />\nfirst<br />\nwas<br />\nmer president of the National As- giving time last party, a defect acting established in three years<br />\nilan, Gerald Cosgrove, Paul Reilly,<br />\nfootball<br />\ncommittee.<br />\nin<br />\nrules<br />\nthe<br />\n-Ken Kling, Frank Crane, Frank<br />\nsociation of Football Coaches, remedied by the proposed week of of participation in Barnstormer<br />\nNew<br />\nYork<br />\nlast<br />\nSaturday.<br />\nsaid that the restriction of the \"open house.\"<br />\nnamely, Newman Levy, Nina Wilplays. John Desch, co-satellite<br />\nFootball<br />\nIn case the Board reaches no with I. Evans Rodgers in A Tailorto<br />\nbe<br />\ncoaches seem<br />\ncox Putnam, Clarence Gettier,<br />\nforward pass was a step backMcReadf Huston, \"Tad,\" Tip unanimous in the opinion that ward. He is of the opinion that decision, this year's agreement Made Ilan, in his present role of<br />\nEdmund Duffy, Charles this rule is one of the greatest the rule will not lessen the use will remain in force, according to the flapper, Marie Breede, gives<br />\nblows football has ever received.<br />\nthe constitution.<br />\n(Continued on p. 3, col. 2)<br />\n(Continued on p. 3, col. 2)<br />\n(Continued on p. 3, col. 2)<br />\nLas,t Minute Contributors<br /><br />\nThe two most important last<br />\nminute -Celebs\" are Dr. Frank<br /><br />\nMOIL<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n$9.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December<br /><br />\nMd.;<br /><br />\nBaltimore,<br /><br />\nunder Act<br /><br />\nof<br /><br />\nfrom<br /><br />\nPublished semi-weekly<br /><br />\n3. 1909, at<br />\n3, 1879.<br /><br />\nthe Postoffice at<br /><br />\nCongress, November<br /><br />\nOctober to June<br /><br />\nby<br /><br />\nthe students<br /><br />\nof Johns<br /><br />\nHopkins University.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNrvicasTry ; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br /><br />\nTelephone.<br /><br />\nHomewood 0100<br /><br />\nEditor-in-Chief<br />\nJ. HENRY JARRETr, '27<br /><br />\nBusiness Manager<br /><br />\nEUGENE O'DUNNE, JR., '27<br /><br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br /><br />\nAdvertising Manager<br /><br />\nMORTON HAMBURGER, JR., '28<br />\nTHOMAS<br /><br />\nF. McNEAL, '27<br /><br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br /><br />\nCirculation Manager<br /><br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br /><br />\nHEYWARD<br /><br />\nE.<br /><br />\nBOYCE, JR., '27<br /><br />\nJunior Editors<br /><br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nCosato G. MACKENZIE,<br /><br />\nJOHN<br /><br />\n'29<br /><br />\nG. TURNBULL, '29<br /><br />\nAssistant Business Managers<br /><br />\nLAWRENCE 0. MCCORMICK, '28<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT. '29<br />\nLouts M. RAWLINS. '28<br />\nH. ADDISON CAMPBELL, '29<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br /><br />\nHOMEWOOD; BALTIMORE, MD., MARCH 26, 1926.<br /><br />\n\"HIS MAJESTY\"<br />\nPeace, perfect peace, has again settled upon the Barn.<br />\nAfter weeks of frantic,hammering and sawing on the part of the<br />\nProperty Staff; and of nocturnal rehearsals of the equally hard<br />\nworking cast, the clamor is ceased and the turmoil done. Tonight, the work of all these weeks will reach its consummation<br />\nin the opening performance of \"His Majesty Bunker Bean\" at<br />\nthe Lyric.<br />\nThe campus is looking forward to the event expectantly,<br />\nfor of late years the Barnstormers play has been considered<br />\nthe leading single event staged by any of the non-athletic activities. And quite rightly so, for the Barnstormers are good.<br />\nPlenty of undergraduate talent, interest on the campus, and<br />\nthe able coaching of Mr. Swindell have succeeded, during the<br />\npast few years, in making the Barnstormers a strong organization.<br />\nAll these factors, coupled with the known ability of this<br />\nyear's cast, and the happy selection of the play, seem to make<br />\nanother success assured. So, in common with the rest of the<br />\ncampus, we are looking forward to seeing -His Majesty\" with<br />\na great deal of pleasure, and we wish the Barnstormers all<br />\nthe luck in the world, which, however, we know they will not<br />\nneed.<br /><br />\nTWENTY-FOUR HOUR SERVICE<br />\nAnother event which helps to make this evening a really<br />\nred letter date is the appearance of the Celebrity Number of<br />\nthe Black and Blue Jay.<br />\nThe Jay shares the fate reserved for most campus .periodicals in that it has come to be'considered very much as a matter<br />\nof course. Organizations like the Musical Club and Barnstormers have periods of preparation followed by the climax of a<br />\nlarge performance; and, after basking in the pleasant rays of<br />\nthe lime light, they rest on their laurels until the following<br />\nyear.<br />\nBut the Black and Blue Jay can follow no such course.<br />\nAt the very time an issue comes off the press, the staff members are already hard at work preparing the next. There is<br />\nno let up, for its regular appearance is fully expected. During<br />\nits few years of existence, the Jay has won a real place on the<br />\ncampus. The same students who take the magazine as a matter of course would be the first to raise violent complaints if it<br />\nwere not in their mail boxes at the accustomed time.<br />\nWe would, then, bestow a great deal of rather belated<br />\ncredit on the men who make up this year's Black and Blue Jay<br />\nstaff. They have held up the standards of one of the most popular and best organized of the campus activities.<br />\nThe culmination of this work is the Celebrity Number.<br />\nThe difficulties in preparing it have been great, but success has<br />\nattended them.<br />\nAfter such an achievement, any other activity would settle<br />\nback to enjoy a well-earned rest, but the Managing Editor of<br />\nthe Jay is already growing gray preparing next month's copy.<br /><br />\nTudor-Stuart Club<br />\nGets Old Edition<br /><br />\nINTERCOLLEGIATE<br /><br />\nNEWS-LETTER MAILBAG<br />\n(Continued from p. 1, col. 5)<br /><br />\nMy exp<br />\nl losion is nearly over.<br />\nAnother addition was recently<br />\nOnly a little settling of the dust<br />\nmade to the extensive library of<br />\n\"Cleanliness,\"<br />\nthe and I am finished.<br />\nBy defeating the unbeaten The Tudor and Stuart Club by<br />\nnext to Godliness.\"<br />\nthird 'edition of they say, \"is<br />\nNaval Academy team with a 42- purchase of the<br />\nhell of a place is our<br />\nCalendar,\" by Ed- My what a<br />\n120 score, Yale University captured the \"Shepherd's<br />\nBarn. Soon, if we are blessed,<br />\n1<br />\nThe very valuable<br />\n; the mythical championship of the mund Spenser.<br />\nour children may see it, a newEast, and finished a season of book was bought in New York by<br />\nwill rise out of its north.<br />\nBarn<br />\nDr. Raney, Johns Hopkins librafifteen consecutive victories. The<br />\nrian and member of the club, for Then under its guidance of its<br />\nEli•swimmers piled up 610 points about $1,500.<br />\nwe may approach -Godlito their opponents 256, the closest<br />\nThere are only three editions of ness\" and beautiful music.<br />\nmeet being with Dartmouth, this volume in the United States,<br />\nMy ravings are over, the clouds<br />\nagainst whom the score was 34-25. and only six in the world. Though<br />\nstill float past, the grass has gotThe only Navy man to take a race there is already a rare fourth ediaway from the New Haven aggre- tion work by Spenser in the Tudor ten greener, the courts are lined<br />\ngation was Allen, who defeated and Stuart library, this. latest and I feel relieved. .<br />\nNedpath, who was swimming his purchase is probably considered<br />\nYours insanely,<br />\nfirst dual meet for Yale in the even more valuable than the forCRAZY RAVING MADMAN.<br />\nbreast stroke.<br />\nmer.<br />\nYale broke five of the eight InA NEW LINE<br />\ntercollegiate records this year. pended publication for an indefi—not ' the one you tell that<br />\nCaptain J. D. Bronson holds three nite period. Its well-known buildgirl.<br />\n—but the ItIontal-Craft line of<br />\n,new records; 53:9.10 seconds in ing in Cambridge has been lost by<br />\nsuitings for the spring.<br />\nthe 100-yard dash; 23:3-5 seconds foreclosure of heavy mortgages<br />\n—It will save you money to<br />\ntake a look.<br />\nin the 50-yard dash; 2 minutes, upon it. Since the building Stands<br />\n21 :4-5 seconds in the 220. House over an underground river which<br />\nlowered his own mark in the 150- is yearly weakening the structure,<br />\nyard backstroke, setting it at 1• the editors did not consider it<br />\nminute, 44:4-5 seconds. The four worth while to attempt to pay off<br />\nerArNit)<br />\nman team in the 200-yard relay the debts.<br />\n*<br />\n*<br />\n•<br />\nmade the distance in 1 minute,<br />\nt- T<br />\n.<br />\n•_7<br />\n4<br />\n35:4-5 seconds.<br />\nTtte Sandspur of Rollins College, Florida, runs a society colg3catim ore<br />\nthe<br />\nwon<br />\nUniversity<br />\nCornell<br />\numn in which choice bits like the<br />\n•<br />\nfrequently.<br />\nwrestling<br />\nIntercollegiate<br />\nEastern<br />\nfollowing appear<br />\nSee \"GARD\" MALLONEE &amp; FRANK MEREDITH at the Barn<br />\nchampionship by scoring twenty- -Iverne Galloway is,a real snake<br />\nDowntown at 407 N. GAY St.<br />\ntwo points. at Penn State last charmer—this was demonstrated<br />\nSaturday. • Lehigh, .Penn State, at the lake shore the other day.\"<br />\n*<br />\n*<br />\n*<br />\n*<br />\nYoung Men's Furnishings<br />\n*<br />\n•<br />\nand Yale finished in the order<br />\nThe Prices Are Right.<br />\nWhere<br />\nnamed after the winner. ColumIn an article upon honor sysbia, Pennsylvania, Princeton and tems in general the following apSyracuse also had teams entered. pears in the \"New Student.\" \"PutRussell, captain of the Eli mat- ting a person upon his honor<br />\nE. BALTIMORE ST.<br />\nmen, won his third Intercollegiate means trusting him absolutely or<br />\nchampionship in the 175-pound it means nothing. The pride of<br />\nDeveloping<br />\nclass by using his favorite three- honor is the pride of being relied Kodaks<br />\nPrinting<br />\nCameras .<br />\nquarter nelson, which has come on without being watched, be- Supplies<br />\nEnlarging<br />\nto be called the \"Yale -Lock.\"<br />\ncause one has honor.\"<br />\n•<br />\n*<br />\n*<br />\n*<br />\n*<br />\nZepri Photo Supply Co.<br /><br />\nNEWS<br /><br />\nr<br /><br />\n. . .,.i<br />\n, _N<br />\n(. 4„..\".........<br />\nr11411d01{,s<br /><br />\nMc PHERSON'S<br />\n11<br /><br />\nPhone: Homewood 9621<br /><br />\nPrinceton University musical<br />\nclub members must wear garters<br />\nFANCY DELICATESSEN<br />\nat all performances, according to<br />\nN. Charles St., Balto., Md.<br />\n2022<br />\n•an official ruling of the legislative<br />\nRATES FOR HOPSPECIAL<br />\ncommittee.<br />\nKINS STUDENTS<br />\nThe Rutgers Glee Club ended<br />\nits season by a banquet in New<br />\nYork followed by a theatre party.<br /><br />\nBOULEVARD RESTAURANT<br /><br />\nThe Jesters, Western Maryland's musical club, will tour the<br />\nEastern Shore and visit seven of<br />\nthe largest towns.<br />\nA mustache contest is in progress at the University of Arkansas. A year's subscription to the<br />\ncampus paper will be given as a<br />\nprize to the student growing the<br />\nmost foliage in one month:<br />\nAt last the reason why one out<br />\nof every five has it is explained.<br />\nThe Dean of Clinical Dentistry at<br />\nthe University of Rochester says<br />\nit is a result of promiscuous petting and kissing.<br />\n* *<br />\nDrinking at the University of<br />\nMissouri has been officially abolished, with the fraternity men<br />\nacting as vigilants. Fraternity<br />\npresidents in conference with<br />\nschool officials adopted a resolution prohibiting drinking at<br />\ndances, school functions, and serenades.<br />\nThe men of the University of<br />\nVirginia have an honor agreement<br />\namong themselves by which they<br />\nare pledged to do no drinking at,<br />\nor for six hours before, any university function at which women<br />\nare present.<br />\n*<br /><br />\n•<br /><br />\n•<br /><br />\n*<br /><br />\n'I 1:f, I arvard Lampoon has sus-<br /><br />\nCoRoNA<br />\nThe Personal Writing Machine<br /><br />\n3044 Greenmount Ave.<br /><br />\nUs Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br /><br />\nLet<br /><br />\nBETHOLIN<br />\n'THE WONDER MOTOR FUEL:<br /><br />\nOF COURSE, HOPKINS<br />\nMEN ALWAYS INSIST<br />\nON BETHOLINE<br /><br />\nM.W.LUCY &amp; CO.<br />\n104 W. Fayette St.<br /><br />\nSHERWOOD BROS., INC.<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW &amp; FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br /><br />\nFURNITURE OF QUALITY<br />\nDeal with a Finn equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br /><br />\nSPEAKING<br /><br />\n\"BUNKER BEAN\" AT LYRIC<br /><br />\nof<br /><br />\npromise of surpassing his sterling<br />\nperformance of 1925. Ralph TownSPORTS<br />\nsend, Jerome Shapiro, Evans<br />\nNot many day will have passed Rodgers, Louis Hamburger, and<br />\nbefore football togs will come out the rest of the cast will furnish<br />\n. of dark lockers into the sunlight more than adequate support for<br />\nof early spring. Already the the principals.<br />\nHis Majesty Bunker Bean makes<br />\nsquad has held an organization<br />\nmeeting and decided to begin his appearance as the most efficipractice immediately after the ent clerk in the .office of J. B.<br />\nEaster recess: Many of the pig- (-Pops\") Breede. Inheriting a<br />\nskin artists are engaging in other considerable sum of money from<br />\nsports to keep in condition. Mal- his aunt, he visits the psychic<br />\nlonne and Kaufhortz are consid- shop conducted by the Countess<br />\nerably in evidence on the lacrosse Casanova and Balthazar, a prefield and Pindell puts in his after: tended believer in transmigration<br />\nof souls. Inspired by the belief<br />\nnoons on the track.<br />\nfostered by Balthazar that he is<br />\nthe reincarnation of a mighty<br />\nGeorge Washington is going<br />\ninto spring training with great Egyptian emperor, Bunker Bean<br />\nearnestness. Like many other skilfully plays the stock market<br />\n-colleges the Washingtonians place and amasses a large fortune. Disa great deal more stress on the covering that he has been tricked<br />\npreliminary training than does by Balthazar, however, Ile is on<br />\nJohns Hopkins. The Washington the verge of despondency when<br />\ngridders and University of Mary- Bud Matthews, \"the.greatest leftland are considering a \"spring foot- hand pitcher in the world,\" comes<br />\nball game tO terminate the spring to his rescue and convinces him<br />\nthat he has succeeded through his<br />\npractice.<br />\ntrue personality, and not through<br />\nhis belief that he was a superior<br />\nThis will certainly be an innobeing.<br />\nvation in the sport. Many objections may be offered to such a<br />\nproposal but the idea is nevertheNEW FOOTBALL RULINGS<br />\nless a very good one.<br />\n*<br /><br />\nCOLLEGIATE STYLE<br />\n+<br /><br />\n(Continued from p. 1,-col. 5)<br /><br />\n++<br /><br />\n+<br /><br />\n++++++<br /><br />\n+ + .t.<br /><br />\nROBBINS' HATS<br />\n+41<br />\nA BIRD OF A HAT<br />\n32 East Baltimore Street<br />\nFormerly LeBrou Co.<br /><br />\nYou Will Be<br /><br />\nSURPRISED<br />\n•<br /><br />\nTo Learn<br />\nof the incredible amount of money<br />\ncomprising the assets of the combined Life Insurance Companies.<br />\nDollar for dollar, they will check<br />\nthe total assets of all the Savings Banks in United States, and<br />\nstill have a surplus of $2,000,000000 or enough left over to buy<br />\nhalf of the assets of all the Building and Loan Associations in the<br />\nUnited States.<br /><br />\nT<br /><br />\nERE is no hat worry for the<br />\nStetson wearer. He is as sure of the<br />\nstyle of his hat as he is of the quality.<br /><br />\nThe Guardian Life Insurance Company of America is looking for<br />\nred-blooded he-men to help them<br />\nkeep pace with the too rapidly<br />\ngrowing market for Life Insurance.<br /><br />\nG. A. Myer, Mgr.<br /><br />\nSTETSON HATS<br /><br />\nTHE GUARDIAN LIFE INSURANCE<br />\nCOMPANY OF AMERICA<br /><br />\nStyled for young men<br /><br />\nFounded 1860<br />\nBaltimore, Md. M<br />\n423 Munsey Bldg.<br /><br />\n(Continued from p. 1, col. 3)<br /><br />\n*<br /><br />\nLacrosse is away with a flurry<br />\nthis year. All winter the athletic<br />\noffice has been besieged with many<br />\nrequests for data concerning the<br />\nexpense of putting out a lacrosse<br />\nteam. The movement in the sport<br />\nis nation-wide, communications<br />\nhaving come from California and<br />\nthe south. There are pioneers in<br />\nthe sport as far south as Alabama.<br />\n*<br /><br />\nGeorgia \"Tech\" wrote to Father<br />\n\"Bill\" Schmeisser for rules and<br />\ndirections on how to play the Indian game.<br />\nArmy, the University's opponent for April 25, has already<br />\nworked for some time in preparation for her rather difficult schedule. The high spots of the Army<br />\nseason will probably be Onondaga, Johns Hopkins and Navy.<br />\nThe West Point aggregation will<br />\nplay the Indians before Johns<br />\nHopkins does.<br />\nThe Rutgers lacrosse squad has<br />\nalso turned out with five of last<br />\nyear's first twelve back.<br />\n*<br /><br />\n*<br /><br />\nA recent comparison of figures<br />\n\" from other college athletic authorities shows the student at this<br />\nUniversity to be better off than<br />\nthe average in regard to fees.<br />\nOne college has a combined activities and athletic fee of $60 a<br />\nyear. This is the highest listed.<br />\nUniversity of Virginia demands a<br />\nfee of $20 for the same privileges<br />\nthat are here offered. Yale and<br />\nOther colleges ask a larger fee<br />\nthan does Johns Hopkins and in<br />\naddition asks another sum to defray the expenses of towel service<br />\nand lockets. Notre Dame charges<br />\n140 fee but only three games are<br />\nPlayed at home in their rather<br />\nlong football season.<br /><br />\nof the pass in the latter part of<br />\ngames, by losing teams. This last<br />\nminute effort to get out of the<br />\nruck will lack the daring of the<br />\nold pass.<br />\nJesse Hawley, coach of last<br />\nyear's famous Dartmouth team,<br />\nis of the opinion that the infliction of the penalty will retard the<br />\ndevelopment of the game and lessen the offensive possibilities from<br />\nwhich a team may choose.<br />\nHawley, whose team depended<br />\nlargely on the pass as an instrument,of attack, voiced his disappointment at the new ruling. Although the development of the<br />\nforward pass has been slow, it has<br />\nrecently become one of the main<br />\nfactors of the game. It will now<br />\nbe relegated to its former use,<br />\nthat of a last desperate resort.<br />\nA five yard penalty will be disregarded by a losing team.<br />\nThe general opinion is that the<br />\nnew rule will be a great obstacle<br />\nto scientific football. It will lessen interest in the game and cripple one .of its most popular features. Football will tend to revert to the old close defense and<br />\nline-backing style.<br />\nNot least<br />\namong the evils arising under the<br />\nnew conditions will be the increased interruptions and penalties.<br /><br />\nCELEBRITY JAY RELEASED<br />\n(Continued from p. 1, col. 1)<br /><br />\nShaw, George Boas, Sidney Nyburg, Raymond Tompkins, Yardley, Innis Lyon, Ellis Parker Butler, Maurice Day, George Ade,<br />\nCharles Dana Gibson, Crosby.<br />\nThis list is regarded as almost<br />\nperfect by the Blue Jay staff and<br />\nthe issue is expected to be a great<br />\nsuccess as a result of it.<br />\nThe Blue Jay Banquet, at which<br />\nelections will be held, has been<br />\nannounced for the ninth of April.<br /><br />\n'WIOIL. •<br /><br />\nThe big or<br />\nlittle company<br />\nwhich?<br />\nsurely be buried in the<br />\nI big company,\"say some.\"Everything is red tape, and you'll end up<br />\nin a groove in some little department.'<br />\n\"Your little company never gets<br />\nyou anywhere,\"others assert. \"The<br />\nbigger the company the bigger your<br />\nopportunity.\"<br />\nWhether a plant covers a hundred acres or is only a dingy shop<br />\nup three flights is not so important<br />\nas whether the company is concerned with improving its product<br />\nthrough the development of its<br />\nmen and their ideas.<br />\nThere are ably managed and growing companies in growing,forwardlooking industries which offer you<br />\na chance to grow with them.<br /><br />\n\"VOU'LL<br /><br />\nPublished<br />\nfor the<br />\nCommunication<br />\nIndustry<br />\nby<br /><br />\nstern Electric Ccmpany<br />\nMakers of the Nation's Telephones<br /><br />\nNumber 58 of a series<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 26, 1926.<br />\nSEASON TICKET SALE MAY<br />\nBE EXTENDED FOR A<br />\nFEW MORE WEEKS<br />\nReturns Only One-Fifth Of The Total<br />\nSet By Athletic Association<br />\nAs Goal For Drive<br /><br />\nResults in the season ticket sale<br />\nhave been very poor up. to the<br />\npresent date. In the three weeks<br />\nthat. have elapsed since the sale<br />\nwas started on Friday, March 5,<br />\nonly for 240 tickets, or $1,200,<br />\nhave returns been made. The situation has such a bad outlook that<br />\nthe time of the contest may . be<br />\nextended for a few weeks, instead<br />\nof ending tomorrow; as hereto-fore<br />\nintended.<br /><br />\n•<br /><br />\nPi Kappa Chi. Leads<br />\nIn the group contest the Pi<br />\nKappa Chi fraternity is-leading;<br />\n$220 having been turned in.. Iii<br /><br />\nFreshmen Named<br />\nTo Collect Dues<br /><br />\nENGINEERING STUDENTS<br />\nROLL IN BOWLING<br /><br />\nCONTESTS<br />\nRichard Todd, treasurer of the<br />\nf1<br />\nles man class announces that<br />\nElectrical Engineers Vanquished,<br />\nall freshman class dues must be<br />\nBy Mechanical Engineers<br />\npaid in full before the banquet.<br />\nIn Three Games<br />\nTodd, in order to facilitate the<br />\nOnce more the old rivalry becollection of the money, has apmen<br />\npointed the following thirteen<br />\ntween the Mechanical and Electrito assist in the collection: Hecht, cal Engineers burst forth when<br />\nLausch, E. C. Stuart, Dowell,<br />\nTruehart, Brack, Turnbull, H. B. the Junior Mechanical Engineers<br />\nHammond, Tydings, Hiss, Wolfe,!knocked the pins from under the<br />\nFarinholt and Richards. These Junior Electrical Engineers in a<br />\nmen will be at the Barn every series of bowling matches.<br />\nday during the lunch hour to reEngineers<br />\nMechanical<br />\nThe<br />\ncMve money. Class dues are now<br />\nproved their superiority over the<br />\nfive dollars and include tickets<br />\nElectrical Engineers by taking<br />\nfor the banquet.<br />\ntwo out of the three matches.<br /><br />\nY. M. C. A. To Elect<br />\nOfficers Tuesday<br /><br />\nThe annual election of officers<br />\nthe Y. M., C. A. will be held on<br />\nof<br />\nsecond place is Omicron Kappq.,<br />\n-day, in the Y. M. C. A. offices.<br />\n^Tiles<br />\nOmicron Fraternity, with $150;<br />\nVotes may be cast between 10:00<br />\nthird,- a group headed by Maxwell<br />\n,A., M. and 4:39 P. M.. Only memCone, with '$125; and the Beta bers of the -Y\" are entitled to<br />\nTheta Pi Fraternity, with $115. vote.\\<br />\nAltogether the average group sale<br />\nIn accordance with the ruling<br />\nis much less than. $100. .Manager of the -Y,\" the candidate for President receiving the second highest<br />\nKeyes reiterates that Unless 1200,<br />\nnumber of votes automatically<br />\ntickets are sold the Athletic Asbecomes Vice-President.<br />\n. deficit<br />\nsociation.'.<br />\nflie candidates are as follows:<br />\nat the end of the year:<br />\nPresident, Robert Bull, Jr. and<br />\nLowell Ensor ; Secretary, Louis<br />\nRawlins and Theodore Fischer;<br />\nZIONIST CLUB CHANGES<br />\nTreasurer, Maxwell ..-Vrmor and<br />\nNAME AT MEETING<br />\nClark Wisotzki.<br /><br />\nSociety Becomes A Member Of The<br />\nAvukah Organization<br /><br />\nAddresses<br /><br />\nVISIT TO LARGE CROWS' ROOST<br /><br />\nDr. Israel, rabbi of the liar<br />\nOn Saturday, March thirteenth, about sundown and settle down<br />\nSinai Congregation, will contin'ue the Field Club made a very inter- by dark. It is interesting to note<br />\ntoday his lectures on Jewish His- esting trip to visit one of the that the crows only roost there<br />\ntory. His topic will be \"The Ori- largest crow roosts in the United during the colder months. In the<br />\ngin and Development of Reform States. The naturalists left the summer they migrate to different<br />\nAfter the lecture, University at about three o'clock places to lay their eggs. Another<br />\nJudaism.\"<br />\nwhich will be held in Room 112, in the afternoon and reached the rather unusual characteristic of<br />\nGilman Hall, a general discussion roost (near St. Agnes' Hospital these birds noted by Dr. Cowles<br />\nwill take place.<br />\n•<br />\nat Arbutus,. Maryland), at about was the desire of some of their<br />\nLast Friday, Mr. E. Milton Alt- seven. They remained to see number to spend the night in the<br />\nfeld, assistant state's attorney, about two thousand crows. settle near vicinity of large electric<br />\ndelivered a lecture before the so- themselves for the night and then lights. He said that starlings, so<br />\nciety on \"Heinrich Heine.\" The returned home.<br />\nfamiliar to the city dweller, also<br />\nspeaker emphasized the ardent<br />\nThis trip has come to be a year- often manifest a similar weakness.<br />\nJewish faith of the German poet, ly affair for the members of the The crows which patronize the<br />\nsuch that if. he were living today, club and is looked forward to with Arbutus roost are of the common<br />\nhe. Would probably be a zealous much pleasure. The roost was variety known as eastern crows.<br />\nZionist, working for the caUse of formerly, if not now, one of the<br />\nDr. Cowles stated there are a<br />\nhis faith.<br />\nmany of these roosts or rookgood<br />\nlargest in the United States.<br />\nNOTICE<br />\nTry-outs for the Tocqueville<br />\nMedal will be held by Dr.<br />\nFrench in Room 112, Gilman<br />\nHall, on Tuesday, March 30, at<br />\n12:30.<br /><br />\nAbout 1880, in the neighborhood<br />\nof two hundred thousand crows<br />\nwere said to roost there every<br />\nnight In recent years there have<br />\nnot been quite .so mqny. The<br />\ncrows only remain there at night<br />\nand wander abroad in the daytime<br />\nin search of food. They conic<br /><br />\nNEWS-LETTER<br /><br />\nOutdoor track practice has been<br />\nprogresSing well during the past<br />\nweek under the Management of<br />\nCoach Edwards. Watson Pindell,<br />\nBull, Willison, and Robey have<br />\nbeen shining in the dashes, while<br />\nMcNeal and Gilpin have been<br />\nworking on the shot put and discus. In the middle distances Burnett has been making good time.<br />\nStick, Young, Hill, and Pindell<br />\nare the pole vaulters who show<br />\nthe most promise among the can<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nMAILBAG<br /><br />\ndidates.<br />\nCLEAN UP THE BARN<br />\nYoung narrowly escaped injury<br />\nWednesday when the pole with To the Editor of the A ca:8-Letter:<br />\nwhich he was vaulting broke, caus- Dear Sir:<br />\ning him a serious fall.<br />\nClouds float' lazily over head,<br />\nthe tender shorts of grass push<br />\nM. E.'s Experienced<br />\nway through the drab earth,<br />\nApparently the Mechanical En- HULLABALOO ADVERTISERS their<br />\nthe courts are rolled and there<br />\ngineers are not without experiREMITTING PROMPTLY<br />\ncourses throngh my veins an urge<br />\nence in the alley pastime. Havto explode, to free myself. Of all<br />\nReturns To Date Exceed Totals Of<br />\ning rolled their way to striking<br />\n;encumbrances, its a yearly event<br />\nFormer Years By $250<br />\nso don't worry, 4 shall survive.<br />\nvictories their total for the three<br />\nEditor-in-Chief Feeling as I do I must roast someTurnbull,<br />\nHenry<br />\ngreatpins<br />\nfifty-one<br />\nmatches was<br />\nof the Hullabaloo, has announced thing . and that something is our<br />\ner than that of their opponents.<br />\nthat $1,300 has been received in Barn, our beloved Barn.<br />\nBoth teams were composed of payment for advertisements. UnHow the cows must turn over<br />\nfive members each, exponents of like former times in which adver- in their grave, unless they werethe game from infancy, having tising was a source of much wor- used for beef, when they hear the<br />\nbeen raised with bowling balls in ry, this is a banner year; the pitiful, -pan, pan, tin, tin,\" of<br />\nreceived at this early date the' so-called ,music box. In the<br />\ntheir hands in lieu of the more amount<br />\nexceeds the final results of previ- midst of \"I want to be Happy,\" a<br />\nconventional rattle.<br />\nous years by $250.<br />\nsudden silence, the E is dead.<br />\nKnighton, of the Electrical EnThe pictures of the R. 0. T. C., Dead as the first tuner that ever<br />\ngineers, was high man with a to- the Swimming Team, the Track swung a rubber hammer. It is<br />\ntal of 127spins for one game. His Team, and the Lacrosse Team will an outrage to the intelligence of<br />\nsmashing tactics were unap- be taken on Monday and Tuesday. those musical' minded students<br />\nbe posted on the Bul- who in their leisure moments, enproached by any of the other con- Notices will<br />\nletin Boards at the Barn and Gil- gineers included frequent the.<br />\ntestants.<br />\nman Hall as to the correct time Barn. Their aesthetic nature<br />\nInnovation<br />\nfor the sittings. Proofs of the must revolt as much as the cows<br />\nThis series of matches marks an<br />\norganization -write ups\" will be at the clash and noise that pours<br />\ninnovation in inter-class sports. completed, subject to approval, forth. The \"Song of the Flame\"<br />\nIt seems probable That matches within two weeks. Full payment is played and well it would be<br />\nwill become a common occurrence for these. is expected not later that the old piano were placed in<br />\nthan five days from that date.<br />\nthe midst of the hottest and highin the favorite alleys.<br />\nhave turn- est flame.<br />\nseniors<br />\nthe<br />\nall<br />\nNearly<br />\nThe line-up of the two teams<br />\ned in their lists of activities, which<br />\n(Continued on p. 2, col. 5)<br />\nwas as follows: Mechanical Enhave been prepared for the pringineers: J. E. Howard, Towman, ter. Those men who did not turn<br />\nWhitney, Dewling .and Cushing. in a list will be classed simply as<br />\nElectrical Engineers: Knighton, \"Member of the Class .of 1926.\"<br />\nFiege, Conklin, Mills and Shult- All the individual write-ups have<br />\nbeen completed, and Book I of the<br />\nheis.<br />\nHullabaloo is ready to be printed.<br />\nWith college parties on<br />\nThe Junior Mechanical . EngiThe art staff has recently finishfamous\"0\"steamers of<br />\nneers have issued a challenge to ed up most of the drawings. The<br />\nall other groups in the University. drawings for the classes, athletics,<br />\nWrite for Illustrated Booklet.<br />\nThe Junior Civil Engineers have student council, student activities,<br />\nSchool of<br />\nForeign Travel, Inc.<br />\nare<br />\naccepted the challenge and will be fraternities and many others<br />\n1l2 College St., New Haven,Cone.<br />\n.<br />\nsk<br />\nnow in the hands of the engravers.<br />\nmet on Wednesday.<br /><br />\nAs an incentive to the progres- Regester<br />\nEngineering Society<br />\nsive change that is being under-,<br />\nThe local student chapter of<br />\ngone, by the Zionist Society, the<br />\nAmerican Society of Civil Enthe<br />\nname of the organization was<br />\ngineers was addressed last Frichanged to the Avukah Society,<br />\nday evening, March 19, by Robert<br />\nas the Johns Hopkins branch of<br />\nT.. Regester, .a member of last<br />\nthe! National Collegate Avukah year's graduating class.<br />\nThe<br />\nOrganization. This change will speaker chose for his topic \"The<br />\nnot only affect the name but many Design and Construction of Wood<br />\nof the policies. of the old, organiza- Stove Pipe Lilies\" and made it<br />\ninto a very interesting talk.<br />\ntion so that it is soon expected<br />\nMr. Regester now holds the<br />\nto till a. more useful place in camposition of Junior Civil Engineer<br />\npus activities.<br />\nwith the Baltimore Sewer DiviIn order to procure more memsion. In having him speak, the<br />\nbers to further the new develop- Society followed its recently<br />\nment, Israel Chodas, President,<br />\nadopted policy of seeking successappointed Aaron Snyder as chair- ful young Hopkins graduates to<br />\nman of the membership commit- address them.<br />\ntees There was also a publicity<br />\ncommittee appointed of which<br />\nFIELD CLUB PAYS INTERESTING<br />\nSamuel Belsky is chairman.<br />\nDr. Israel To Speak<br /><br />\nTrack Men Showing<br />\nWell In Work-Outs<br /><br />\neries in various parts of the country. They are frequented by quite<br />\na number of varieties of crows:<br />\nnorthern, southern, western, Canadian, etc. A somewhat unusual<br />\nspecies is that known as the fish<br />\ncrow which is distinguished by<br />\nits very short call.<br /><br />\nTourist<br />\nthird cabin<br /><br />\ntoEUROPE<br /><br />\nThe Royal Mail Line<br /><br />\n$1,000.00<br />\nIN ONE SUMMER<br />\nalso.<br />\nA few men needed—Organization and part-time work<br />\nSee:<br />\nDON BOLTON, P. 0. Box 469<br /><br />\nThe Training School for Jewish Social Work offers a fifteen months' course of graduate study in Jewish Family<br />\nCase Work, Child Care, Community Centers, Federations<br />\nand Health Centers.<br />\nSeveral tuition scholarships and maintenance fellowships<br />\nare available to especially qualified students.<br />\nFor further information, address the Director,<br />\nTHE TRAINING SCHOOL FOR JEWISH SOCIAL WORK<br />\n(Initiated by the National Conference of Jewish Social Service).<br /><br />\n210 West 91st Street<br /><br />\nNew York City<br /><br />\n8<br /><br />\n0<br /><br />\nNN<br /><br />\nti<br /><br />\nc;<br /><br />"}], "field_media_file": [{"target_id": 38043, "display": null, "description": null, "target_type": "file", "target_uuid": "18eae284-ddbd-4172-a9f3-9f160bb1fbff", "url": "http://digital.library.jhu.edu/system/files/2022-03/13211-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13211, "target_type": "node", "target_uuid": "7cd989e2-5da4-4ff7-a3a0-c8a41427581c", "url": "/node/13211"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "452281c1-1394-4d82-aca0-12c9c3d38880"}]}