{"mid": [{"value": 37723}], "uuid": [{"value": "1ed804e6-0f61-4a7e-8b15-ea288f415dcb"}], "vid": [{"value": 37723}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:38:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12251-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:38:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:38:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "COTILLION BOARD DANCE<br />\nWill be held<br />\n<br />\nJUNIOR DANCE<br />\nTickets now procurable<br />\nfrom Committee Membets<br />\n<br />\nIn Latrobe Hall<br />\nTomorrow Night<br />\n<br />\nVol. XXXV, No. 43<br />\n<br />\nLIBERAL CONCLAVE<br />\nGETS UNDER WAY<br />\nTOMORROW MORNING<br />\n<br />\nApril 18<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., APRIL 10, 1931<br />\n<br />\nNew Editorial Board<br />\nElected By NewsLetter Staff<br />\n<br />\nTax $1.75<br />\n<br />\nPrice 5 Cents<br />\n<br />\nIRISH POET STIRS Music and Chemistry Relation<br />\nJAY LACROSSEMEN<br />\nCROWD IN TALK ON<br />\nEstablished By Hopkins Man CLASH TOMORROW<br />\nLITURGISTS OF ERIN<br />\nWITH SWARTHMORE<br />\n<br />\nDr. D. H. Andrews, Chemistry Professor, Discovers Connection<br />\nBetween Them; To Broadcast Over Columbia<br />\nAE Recalls Friendships With<br />\nGame With Maroon Twelve To<br />\nChain Next Friday<br />\nLeaders In Irish Literary<br />\nBe Played At Homewood<br />\nMovement<br />\nDue to the recent findings of Dr.<br />\nField<br />\nAlthough Dr. Andrews said this<br />\nDonald Hook Andrews, Professor disclosure was only an incidentalu<br />\nPOET CALLS G. B. S.<br />\nof Chemistry, a relation has been part of the study of chemical mole- VAN ORMAN LAUDS<br />\nfound<br />\nbetween chemistry and music, cule's structure which he has been<br />\nVISITING MENTOR<br />\nANGEL INCARNATE<br />\nwhich enables the action of chem- making for some time, he believes it<br />\nSpoke Yesterday On 'A Poet ical atoms to be transposed to the can be of value in the study of Pennsylvanians In B e tte r<br />\nmusical scale, and played or sung. chemistry.<br />\nShape Now Than When<br />\nAnd Artist Considers<br />\nThis discovery was first disclosed<br />\n\"It is a new approach to this sciThey Met Hillmen<br />\nDreams'<br />\nby Dr. Andrews at a lecture he gave ence,\" he said. \"It means that you<br />\nbefore the annual meeting of the can hear chemistry as well as see it.<br />\nDespite the unfavorable performIn a soft, low voice, whose chant American Chemical Society, at In- It tends to make things more<br />\nance<br />\nof Swarthmore's lacrosse team<br />\nbrought absolute silence to the dianapolis, on March 31st.<br />\nvivid.\"<br />\nagainst<br />\nMt. Washington two weeks<br />\nDr. Andrews stated that it might<br />\ncapacity assemblages in Latrobe That chemical activity is always<br />\naccompanied by musical vibrations be possible to project the<br />\nago, Coach Van Orman has been<br />\naction<br />\nHall last Tuesday and yesterday has long been an established fact,<br />\ninformed that he can expect opposievenings, George W. Russell, better according to Dr. Andrews, but these and sound of the molecule upon the<br />\nvibrations are entirely too high for screen, in the form of a talking tion of a better calibre in tomorknown by his pen name, AE, dean the human ear to hear. However, by movie. He mentioned this as one of<br />\nrow's contest.<br />\nof the Irish mystic poets, gave two a formula he has devised, they can be many interesting possibilities.<br />\n\"Abe\" Blake, Maroon mentor,<br />\nbrought down to an audible pitch.<br />\npublic lectures on poetry and poets This is done by dividing the frequency<br />\nNews-Reel Made Of Professor<br />\nstated that Swarthmore would unLast Monday, a news-reel com- doubtedly<br />\nTo Continue Until 11 P. M.<br />\nunder the Percy Graeme Turnbull of the chemical atom's vibration, by<br />\nhave a stronger team.<br />\nvelocity of light. Since the atoms pany took a talking movie of the In the<br />\nBeginning at 10 a. m. the con- 148 Courses Offered For Six- Lecture Foundation. The subjects the<br />\nfirst<br />\nplace, the Hillmen<br />\nof<br />\nvarious chemicals have different chemist, in which he explained this<br />\nference will continue until 11 p. m. Week Session At Home- of the talks were \"Some Personali- vibrations, musical notes<br />\nfracas was scheduled too early in<br />\ndiffer.<br />\nchemistry-music<br />\nrelationship.<br />\nThis the season for the<br />\nDuring the morning session, dewood; 78 On Faculty<br />\nMaroons. The<br />\nPictures In Form Of Light<br />\nties of the Irish Liteary Movement\"<br />\nfilm is to have a country-wide dis- team,<br />\nvoted to the consideration of the<br />\ncomposed mainly of new men,<br />\nThe method by which Dr. Andrews<br />\ntribution,<br />\nas part of the regular had had<br />\nand \"A Poet and Artist Considers determines the vibrations, is by takcauses of unemployment, three ad- REGISTRATION SET FOR<br />\nvery little practice, conseing pictures of them, by means of the news-reel.<br />\ndresses are to be given. Dr. George<br />\nquently, the squad was not in a posiJUNE 15-20, REMSEN Dreams.\"<br />\nspectograph. These photographs are<br />\nHe will also speak on this subject tion<br />\nE. Barnett, professor of statistics<br />\nCalling George Bernard Shaw in<br />\nto present its best efforts.<br />\nthe form of light. According<br />\nthe via the radio, over the network of<br />\nat the Hopkins, will discuss \"Basic, Dr. R. B. Roulston, Director; \"an angel incarnate,\" the Irish poet savant, they are much like the to<br />\nsound the Columbia chain, next Friday,<br />\nTan Orman Praises Blake<br />\nSeasonal, Cyclical Unemployment\"; Dr. J. S. Ames, President, named him<br />\nstrip on a talking movie film. These<br />\nDr.<br />\nVan Orman recently stated<br />\nthe<br />\n\"kindest,<br />\nmost<br />\ngen.April<br />\n17,<br />\n3.45<br />\nat<br />\nP.<br />\nHis<br />\nM.<br />\ntalk<br />\nphotographs are then transposed to<br />\nDr. Harry W. Laidler, executive diTo Meet Faculty<br />\nthat he has great respect for Blake's<br />\nwill<br />\nmade<br />\nbe<br />\nStation<br />\nfrom<br />\nWMAL<br />\nerous,<br />\nand<br />\nmusical<br />\nsympathetic\"<br />\nmost<br />\nthe<br />\nscale<br />\nby<br />\nmeans<br />\nman<br />\nof<br />\nthe<br />\nrector, League of Industrial Deability. The latter, who happens to<br />\nof Washington, D. C.<br />\nhe knew. \"He is the greatest man formula.<br />\nmocracy,\"Technological UnemployInstruction in summer courses<br />\nbe a Marylander, . has a Sound<br />\nment\"; Charles W. Ervin, associate conducted at the Johns Hopkins of letters of his time,\" the poet said<br />\nknowledge<br />\nof the game and he may<br />\neditor, The Advance, \"The Profit University will begin June 23, at of him, in recounting his unique<br />\nbe counted on to develop, in time, a<br />\nMotive As a Cause of Unemploy- 8.30 a. m., and will culminate July<br />\nstrong Swarthmore team. Most of<br />\nmeeting with Shaw . Encountering<br />\nment.\"<br />\n31, it was announced.<br />\nthe students have taken to the game<br />\nthe dramatist in the Dublin art galConsequences of unemployment<br />\nand<br />\nhave shown a strong desire to<br />\nRegistration June 15-20<br />\nlery,<br />\nhe carried on a conversation Orthopedist Succumbs<br />\nwill be depicted in the two adTues. \"Torchbearers\" By George learn.<br />\nRegistration<br />\nfor<br />\nthe<br />\nsession<br />\nwill<br />\nwith him for two hours, totally<br />\ndresses to be presented by Miss<br />\nMorning; On Faculty<br />\nKelly Will Be Presented<br />\nDespite these threats of a strong<br />\nAnna D. Ward, general secretary, take place from June 15 to June 20, ignorant of his companion's identi30 Years<br />\nopposition,<br />\n9<br />\na.<br />\nthere seems little reason<br />\nm.<br />\nto<br />\n4<br />\nApril<br />\np.<br />\nm.,<br />\n23,<br />\nin<br />\nRemsen<br />\n24,<br />\n25<br />\nHall.<br />\nFamily Welfare Association; and<br />\nty. Shaw told Russell that Whistler<br />\nwhy<br />\nthe<br />\nJays<br />\nshould have any fears.<br />\nSunday,<br />\nJune<br />\n21,<br />\nrooms<br />\nin<br />\nthe<br />\nJay Lovestone, editor, RevolutionGraduate of and professor at the<br />\n\"made him sick,\" the poet told his<br />\nPast performances have already<br />\nDue<br />\ndifficulty<br />\nto<br />\nin<br />\nobtaining<br />\nthe<br />\nary Age. Miss Ward has chosen as Alumni Memorial Hall will be<br />\nJohns Hopkins University, Dr.<br />\nstamped the team as being one of<br />\nher topic, \"Social Consequences.\" opened for occupancy by the out- audience.<br />\nWilliam S. Baer, internationally permission of the copyright owners the most powerful in the history of<br />\nof-town<br />\nstudents.<br />\nSections<br />\nA,<br />\nB, C,<br />\nMr. Lovestone will talk on \"EcoNoted In Many Fields<br />\n.known orthopedic surgeon, Tues- to produce \"The High Road,\" the the Indian pastime at Hopkins.<br />\nand E are to be reserved for womnomic Consequences.\" This session en; sections<br />\nGeorge W. Russell is noted in day at 11 A. M., died in the Union Barnstormers have chosen as their<br />\nD and F for men. InJay Material Plentiful<br />\nbegins at 2 p. m.<br />\nstructors are to be in their offices many fields of endeavor. He is a Memorial Hospital, subsequent to new play \"The Torchbearers.\" This<br />\nMaterial<br />\nfor all positions is<br />\nan<br />\nillness of approximately fifty<br />\non June 22, from 10 a. m. to 12 poet, painter, agriculturist, journalRound Table Discussions<br />\nplay was written by George Kelly, plentiful. In fact, Coach Van Orhours.<br />\nstricken<br />\nHe<br />\nwas<br />\nwith<br />\npaFour members of the J. H. U. noon, for consultation with students ist, and statesman. He has been ralysis Sunday morning while on one of the best actor-playwrites on man has come to the conclusion that<br />\nLiberal Club will lead discussion concerning courses.<br />\neditor of two newspapers, has his vacation in Delaware. Brought Broadway and has recently had a certain positions cannot be definiteDr. Ames To Meet Faculty<br />\ngroups on unemployment problems.<br />\npainted numerous works of art, is to Baltimore by ambulance, Dr. most successful showing in New ly bagged by any one player. This<br />\nLazare Teper will lead the round<br />\nDr. Joseph S. Ames, president at called by critics<br />\nimplies that the type of opponent<br />\n\"the greatest of Baer was admitted to the hospital York.<br />\ntable discussion of \"Hours of La- the Hopkins, is scheduled to meet<br />\nmust be taken into consideration.<br />\nIn<br />\ncondition.<br />\nunconscious<br />\nan<br />\nHe<br />\nbor and Unemployment\"; Joel the faculty of the summer courses Irish mystics,\" and has excelled as died while still in the coma, physiCalls for Difficult Lead<br />\nThus if Hopkins happens to enSeidman, \"What Unions Can Do\"; at 2 p. m., June 22, in Room 101, an agriculturist.<br />\nThe leading part in the play de- counter a rival possessing a fast<br />\nDuring his varied career, George cians declared.<br />\nH. G. Burke, \"Government and Remsen Hall. Dr. Robert B. Roulsmands an actress highly versed in offense, changes to fast defensive<br />\nAttended Hopkins<br />\nUnemployment\"; C. H. Van Duzer, ton, collegiate professor of Ger- Russell has formed friendships<br />\nFollowing<br />\ncompletion<br />\nthe<br />\nof his the dramatic art, and the club was men will be necessary. The same<br />\n\"Unemployment and the Negro.\" man, is director of the summer with many Irishmen famous in the medical course in 1898, when he reapplies to the Jays' attack.<br />\nlucky in finding Miss Evelyn Bigfield of letters. His lectures are filled<br />\ncourses.<br />\nIf the Black and Blue will need<br />\nceived his M.D. degree at the J. H.<br />\nNorman Thomas To Talk<br />\nSeventy-eight persons will consti- with anecdotes of his friends. Of U. School of Medicine, Dr. Baer ley, a teacher of expression at Bard speed, there are several on the<br />\nNorman Thomas, noted Socialist tute the faculty for the six-week Lord Dunsany, from whose pen<br />\nAvon, who is doing exceedingly squad who can supply it. This<br />\nleader in the United States, at 8 p. session at Homewood. One hundred some of the most unusual of pres- served for two years as assistant<br />\nwell at the present as the leading naturally accounts for the alternaresident<br />\nJohns<br />\nphysician<br />\nthe<br />\nat<br />\nm. will speak on \"Socialization as forty-eight courses are offered in ent-day writings have flown, the lecHopkins<br />\nDuring<br />\nHospital.<br />\n1900<br />\nand<br />\ncharacter,<br />\nwhich portrays a direct- tion between Dukehart and Stone,<br />\nturer holds some unique remema Solution.\" His talk, as well as the summer school.<br />\n1901 he was assistant orthopedic ress of an amateur show. The other Dowell and Triplett on the attack,<br />\nbrances.<br />\nthose of Dr. Isador Lubin, Brooksurgeon. In the School of Medicine<br />\nand Ness, Cone, Kneip and Hudert<br />\nings Institute, and Rabbi Dr. EdKnew Dunsany At Early Age<br />\nhe was on the teaching staff for 30 members who are to have parts in on the defense. Likewise the center<br />\nward L Israel, chairman of the Tickets Now On Sale<br />\nWhen Russell first knew Lord years, from 1901 until his unex- the show are already known to post will be shared by Cockey and<br />\nMunicipal Commission on EmployFor<br />\nDance<br />\nJunior<br />\nDunsany, the dramatist was a boy pected death. An instructor in or- Hopkins students because of their Buhler for the remainder of the<br />\nment Stabilization, will be broadof<br />\ncast by Station WCBM, Baltimore. Affair To Be Held At The Southern he tender years. Even at this age thopedics from 1901 to 1905, Dr. previous performances. They are campaign.<br />\nhad a map of what he called Baer was promoted to associate, in Whiting<br />\nHotel<br />\nOn<br />\nApril<br />\nFarinholt, Talbot Banks, Line-up for Swarthmore - HopDr. Lubin is to speak on \"Unem\"his land.\" This map, a six-foot which capacity he served from 1905<br />\n18th<br />\nS. Jesse Robinson, Barbara Sturte- kins game:<br />\nployment Insurance\"; Rabbi Israel,<br />\nTickets are now on sale for the affair, depicted a land of some to 1910. For four years, 1910-1914 vant, Earl Evans, P. L. Weisingoff, Hopkins<br />\nSwarthmore<br />\n\"Stabilization, Public Works and<br />\nJunior Dance which is to be held strange name. To reach this land, be was associate professor. From Cyrile Kader, Sam Selsky, Jeanette Stude<br />\nDavies<br />\nother Cures and Alleged Cures.\"<br />\nSaturday evening, April 18th at the Dunsany told Russell, \"you travel 1914 to 1927 Dr. Baer was asso- Sauters, Eleanor German and Vir- Bernard<br />\nDeldwind<br />\nOfficials of the club sponsoring<br />\nEast until you reach China. Then, ciate professor of clinical orthoMahon<br />\nWeitzel<br />\nCP<br />\nthe conference believe many of the Southern Hotel. The affair prom- instead of going around the world pedic surgery. In that year he was ginia Barsely. The characters are Ness<br />\nKeefer<br />\nFD<br />\nthe<br />\nof<br />\none<br />\nises<br />\nbe<br />\nto<br />\nmost outstandbeing excellently trained for this<br />\npublic will attend the evening sesRushmore<br />\nS D<br />\n:<br />\ni<br />\nL<br />\nKnoneng<br />\nagain, you go straight on and get named full professor in that study.<br />\nproduction,<br />\nwhich is of a very fast<br />\nDouglas<br />\nT D<br />\nsion, which will be devoted to ad- ing Hopkins affairs of the year.<br />\nHopkins<br />\nA.B.<br />\nthe<br />\nat<br />\nHe<br />\nhis<br />\ntook<br />\nto<br />\nmy<br />\nland.\"<br />\nThis<br />\nland<br />\nin<br />\nthe<br />\nwas<br />\nA musical tempo that is pleasingWilliams<br />\ntempo by the coaches, Bill Banks BuhIcr<br />\ndresses on remedies for unemployhere<br />\nafter<br />\nentered<br />\nin<br />\nhaving<br />\n1894,<br />\nwhich<br />\nDunsany's bizarre incidents<br />\nstone<br />\nT A<br />\nJoyce<br />\nly different and novel entertainment<br />\nment.<br />\nfrom the Baltimore City College, and Howard Caplan.<br />\ntook place.<br />\nS A<br />\nJones<br />\nfurnished<br />\nfeatures<br />\nwill<br />\nBud<br />\nbe<br />\nby<br />\nThis presentation which is exArrange Program<br />\nPA<br />\nLord Dunsany, stated Russell, local high school.<br />\nCodori and his Pennsylvania RamMcVaPuig<br />\n0H<br />\nirKellyu<br />\nlndb lI<br />\nkh<br />\ne<br />\nSurviving the famed surgeon is cellent in its portrayal and satire of Turnbull<br />\nwould have made an excellent artist.<br />\nIn charge of the program are blers.<br />\nHarlan<br />\nI H<br />\nTriplett<br />\namateur<br />\nproductions<br />\nbe<br />\nwill<br />\nespeRuth<br />\nMiss<br />\nformer.<br />\nhis<br />\nwife, the<br />\nJoel Seidman and Charles Stern. The committee in charge of the His drawings in early youth were<br />\nPublicity for the meet is in charge affair includes Ronald Levy, chair- indicative of a not inconsiderable Adams, of New Haven, Conn., cially interesting to Baltimoreans<br />\nwhom he had married in 1901. since Baltimore is one of the first Jay Netmen Retarded<br />\nof V. Jackson Lee and Vernon man; Ned Dukehart, president of artistic genius.<br />\ncenters of the little theater moveare no children.<br />\nThere<br />\nO'Rourke. Misses Tillye Braun and the Junior Class; Sylvan Lebow,<br />\nHeard Author's Stories<br />\nment in this country as evidenced Due To Wet Weather<br />\nFamed Orthopedist<br />\nMatilda B. Maloy are on the fi- Walter Kneip, Weitzel and Quick. Russell had the opportunity to<br />\nPassionately devoted to his pro- by the great number of little thea- Trips To Washington and New York<br />\nnance committee. Registration of<br />\nTickets may be procured from hear many of Dunsany's stories beand rooming accommodations for any member of the committee at fore their publication. Dunsany, he fession of orthopedic surgery, ters in this city, particularly on the<br />\nCity Scheduled For Next<br />\nHopkins campus which is reprethe delegates is in the hands of $1.75 a couple. At the door the asserted, a<br />\nof<br />\ncorrection<br />\nwith<br />\ndeals<br />\nthe<br />\nwhich<br />\nWeek<br />\nis born story teller, and<br />\nsented by the Barnstormers and the<br />\nMiss Thelma Shaivitz and James price will be $2.25 per couple.<br />\nDue to the inclemency of the<br />\neverything that he says is in the ,bone deformities, Dr. Baer has per- Homewood Playshop.<br />\nremarkable achievements in<br />\nD. McNeal.<br />\nweather, the Hopkins varsity tenform of a tale. Most of the char- formed<br />\nRoyalty Rights Procurred<br />\nsurgery in which he is<br />\nfield<br />\nof<br />\nthat<br />\nnis<br />\nteam was unable to hold its first<br />\nof Dunsany's stories told to<br />\nDr. Greenfield Speaks acters<br />\nThe Barnstormers have gone two schedule meets of the season<br />\nchiefly interested. It is said that<br />\nhis friend were later recognizible in due<br />\nto his declination of speaking through a great expense to obtain with American U. and Baltimore U.<br />\nTonight Before Club the dramatist's future writing. The<br />\nHopkins Year Book<br />\nabout his surgical work, his achieve- the royalty rights and even thus last Friday and Mondaq, respectiveGoes To Press Today History Professor Addresses Intercol- parable of Smith the Grocer, how- ments are well known to only those only through pull with the copy- ly. The late preponderance of wet<br />\never, he has never since recognized. in the medical world and not the<br />\nlegiate Italian Club On Italian<br />\nwrite owners. Whiting Farinholt, weather in this vicinity has greatly<br />\nOutlook<br />\nThe story of Smith, the Grocer, general public.<br />\nElections For Next Year's Staff Will<br />\npesident<br />\nof the club, announces that retarded developments on the tennis<br />\n\"The Outlook of a Resurrected is typical of Dunsany. It's abrupt, In 1929 the name of Dr. Baer since this is the<br />\nBe Held On Afternoon of<br />\nfirst time in the courts and it is very doubtful that<br />\nApril 23<br />\nItaly\" will be the topic of an ad- startling ending is of the sort for<br />\n(Continued on Page 3, Col. 4)<br />\nhistory of the Barnstormers that a they will be completed by the end<br />\nfamous.<br />\nDealIrishman<br />\nis<br />\nwhich<br />\nthe<br />\nToday the Hullaballoo, anuual dress to be given tonight in Latrobe<br />\nsecond showing will be held in one of this month.<br />\nPublication of the Hopkins student Hall, Room 120, by Dr. Kent R. ing with the travel of the soul of FROSH DANCE POSTPONED season, the student body and their<br />\nAt present, efforts are being made<br />\nbody went to press. Individual por- Greenfield, professor of European Smith, who has just died on Earth, Ted Stern, secretary<br />\nof the fresh- friends will have to give their to secure other courts for the imtraits of ninety-two seniors are in- history at the Johns Hopkins Uni- the story tells of the trip up to the man class, yesterday announced the heartiest support<br />\nin order to put it pending home matches with the<br />\ncluded in this edition, according to versity. He will talk before the In- gates of heaven. On the way, Smith postponement of the date of the across if they desire<br />\nthe Barnstorm- St. John's (of Brooklyn) tomorrow<br />\nL. Townsend Parks, editor.<br />\ntercollegiate Italian Club.<br />\nwonders if his life has been of the freshman dance due to a conflict ers to continue with<br />\ntheir new polDr. Greenfield, who will be intro- sort to allow him access to Para- with the Junior Dance and other icy of several performances a year. and St. John's (Annapolis) WedElections for the editors and<br />\nnesday. Matches for next week<br />\nbusiness managers for next year's duced by Charles Bandiere, vice- dise.<br />\nUniversity functions.<br />\nHarold Schwartz, business man- have also been scheduled with<br />\nstaff will be held on the afternoon president of the Backus Motor Co.,<br />\nMust Have Excuses For God<br />\nThe officers and the committee of ager, has announced that tickets will George Washington University on<br />\nc!f April 23. The results of the elec- will in his speech present personal<br />\nSmith decides that he must have a the freshman class will meet at a soon be on sale for the perform- Monday, April 13, at Washington,<br />\ntion are to be announced at the Ju- observations while on a tour of set of excuses for God. After long future date to decide upon this ances, which will be held on the<br />\n23, and New York University on Satnior Banquet to be held that night. Italy.<br />\nquestion.<br />\n(Continued on Page 4, Col. 4)<br />\n24 and 25 of April,<br />\nurday, April 18, in New York City.<br />\nAt the annual banquet of the<br />\nNEWS-LETTER<br />\nstaff, held last<br />\nThir d Annual Conference<br />\nnight at the Emerson Hotel, the<br />\nWill Be Held In Levering<br />\nfollowing men were elected to<br />\nHall, 10 A.M. to 11 P.M.<br />\nthe editorial board of the publicaEIGHT SPEAKERS ARE<br />\ntion:<br />\nON PROGRAM SATURDAY<br />\nEditor—Rowland Ness<br />\nManaging Editor—Sylvan LeUnemployment, Theme of Adbow.<br />\ndresses; Evening Session<br />\nWill Be Broadcast<br />\nAssistant Managing Editors—<br />\nH. L. Friedberg, H. Levin.<br />\nTomorrow more than 200 stuAssociate Editors—N. M. Hardents from colleges and universities<br />\nthroughout the country will con- ris, H. B. Yudkin.<br />\nvene in Levering Hall, at HomeElection for the business board<br />\nwood, for the Third Annual Interwas<br />\nindefinitely postponed.<br />\ncollegiate Liberal Conference to be<br />\nsponsored by the Johns Hopkins<br />\nUniversity Liberal Club. \"Unemployment\" will be the theme of tomorrow's conclave.<br />\n<br />\nSUMMER COURSES BEGIN<br />\nJUNE 23; END JULY 31<br />\n<br />\nBA ER, NOTED SURGEON,'STORMERS CHANGE PLAY<br />\nDIES FROM PARALYSIS FOR SPRING PRODUCTION<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br />\n<br />\n2<br />\n<br />\nHOPKINSIIEWSIETTER<br />\n<br />\nINTERCOLLEGIATE NEWS<br />\n<br />\nDILLY<br />\nDALLY<br />\n<br />\n•<br />\n<br />\nFOUNDED 1897<br />\n<br />\nA bill has been introduced in the<br />\nOn his recent trip through the<br />\nbehalf of the drought North Carolina State Legislature<br />\n$2.00 Southwest in<br />\nSubscription<br />\nstricken farmers, Will Rogers to prohibit the operation of campus or dormitory merchandise stores<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore, stopped for lunch with a fraternity<br />\n1879.<br />\n3,<br />\nlid., under the Act of Congress November<br />\nat Oklahoma State College. Will in the state institutions. It's going<br />\nhad previously requested bacon and to be a long trip for a candy bar<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nbeans, so the menu was a constant if it passes.<br />\nUniversity.<br />\nround of cornbread, beans and<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, bacon.<br />\nEnrroR;<br />\nIn order to assist Greek neophytes<br />\n* * *<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\npreparing for \"hell week\" the<br />\nin<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nOne Harvard senior aspires to<br />\nState College listed several<br />\nPenn<br />\nBelmont 8778 be a bear tamer and still another<br />\nTelephone<br />\nusual duties required and<br />\nthe<br />\nconsiders writing epic poetry as his of<br />\nsolution. Among them<br />\nthe<br />\nEDITORIAL DEPARTMENT<br />\nvocation. \"It's really a pleasure to gave<br />\nof the bolts of a<br />\ncounting<br />\nknow that other institutions are al- was the<br />\nEditor-in-Chief<br />\nnumber of mail<br />\nthe<br />\nso afflicted with would-be geniuses\" certain cannon,<br />\nROWLAND McD. NESS, '32<br />\nand the<br />\nbuilding,<br />\nis the comment of the Dickinson boxes in a college<br />\npenny.<br />\nCollege publication upon the situa- date on a hidden<br />\nManaging Editor<br />\n'32<br />\nLEBOW,<br />\nSYLVAN<br />\nNew York University and the<br />\ntion.<br />\n* * * *<br />\nCatholic University of Washington<br />\nAssistant Managing Editors<br />\ncarryhave established an air law acadA course in love making<br />\nHYMAN LEVIN, '34<br />\nHERBEWT L FRIEDBERG,'33<br />\nweek<br />\na<br />\ning a credit of five hours<br />\nemy, which will make possible the<br />\nEditors<br />\nat<br />\nAssociate<br />\nresearch and study of aeronautical<br />\nis now being offered to co-eds<br />\nNATHAN M. HARRIS, '32<br />\na<br />\nHAROLD B. YUDKIN,'32<br />\nand radio law.<br />\nRollins College. It is said that<br />\nJunior Editors<br />\ngreat many are signing up for the<br />\n* * *<br />\nJACK GREENFIELD, '33<br />\nMARION GROVE, '33<br />\ncourse in order to benefit from the<br />\n'34<br />\n,<br />\nKUSLOVITZ<br />\nHAROLD<br />\nSANFORD SARNEY, '34<br />\nAt Wheaton the freshmen used<br />\npractical instruction.<br />\nSAMUEL M. DOCTOFSKEY, '34<br />\nJEROME BLUM,'34<br />\na novel method of announcing class<br />\n*<br />\nNORMAN HEANEY, '34<br />\nSTANLEY STILLMAN, '33<br />\nelections. An \"emergency police\"<br />\nMORDECAI EDELMAN, '34<br />\nRAYMOND DUNN,'33<br />\nUniversity of South Carolina<br />\n'32<br />\nsquad rounded up five \"escaped<br />\nMARLOWE PERRY,<br />\nDONALD PROCTOR, '33<br />\nstudents may avoid chapel attend'33<br />\nVERLIN,<br />\nBERNARD<br />\nconvicts\" and led them to \"prison\"<br />\nHARRY GOODMAN, '33<br />\nance because the demand is unin Science Hall, where \"sentences\"<br />\nconstitutional according to advice<br />\nBUSINESS DEPARTMENT<br />\nwere pronounced on each new ofrecently given by prominent atBusiness Manager<br />\nficer. Just to make it more realistic,<br />\nGus BURK, '31<br />\ntorneys.<br />\nenthusiastic frosh ended the<br />\nthe<br />\n*<br />\n*<br />\n* *<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nwith a \"prison riot.'<br />\nceremony<br />\nP3i<br />\nMONT,<br />\nGEORGE W. LA<br />\nAccording to the Lehigh Brown<br />\nDAVID SYKES, '32<br />\n* * *<br />\nand White the dean of Hunter ColOffice Manager<br />\ncollege<br />\nmodern<br />\nthe<br />\nthat<br />\nclaims<br />\nlege<br />\n\"Canada spends $120,000,000<br />\nISADORE C. GUTMAN,'32<br />\nparties,<br />\nenough<br />\nto<br />\ngo<br />\ngirl<br />\ndoesn't<br />\nWILSON RUTHERFORD, '31<br />\nannually for education,\" according<br />\nCHARLES NEY, '33<br />\nand studies entirely too much. It's<br />\nABRAM Buitx, '34<br />\nto Dr. Walter F. Percival, director<br />\nSIMON Lin., '33<br />\na shame the dean only feels that<br />\nVICTOR FRENKIL, '34<br />\nWu. N. MYERS, '33<br />\nof Protestant education in the<br />\nway. For the benefit of the weaker<br />\nEDGAR BLUMSTF.IN, '34<br />\nMORTON Rolm, '33<br />\nprovince of Quebec, Canada.<br />\nDAVID Gun& Art, '34<br />\nsex, we wish something could be<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN, '33<br />\ndone about it.<br />\nLEONARD HARRIS, '34<br />\n• * * *<br />\nGEORGE LANDAU, '34<br />\nJose R. Capablanca, 7 times naAve., Baltimore, Md. tional chess champion, enjoyed baseProduced by the R. L. Polk Printing Company, 1930 Clifton<br />\nball much more than chess, while<br />\nhe was a student in Columbia University. He was regular shortstop<br />\non the Varsity.<br />\n* * * *<br />\nStudents from India, Syria, Lithuania, Japan and France are enrolled in the University of Wichita<br />\nAU REVOIR<br />\nthis semester, according to Worth<br />\nthe<br />\nA. Fletcher, registrar..<br />\nODAY a new editorial board takes over the editorial reins of<br />\nNEWS-LETTER. The retiring editor and managing editor will soon<br />\n* * *<br />\nbe leaving our midst and it is with much regret that we bid them au<br />\nwish<br />\nIt will only cost England $600 for<br />\nrevoir. We recall pleasant days spent in good fellowship and<br />\nthem all the success in the world in whatever field of endeavor they ineach athlete she sends to the 1932<br />\ntend to cast their fortunes.<br />\nOlympic games at Los Angeles, owthe<br />\nWe sincerely feel that the NEWS-LETTER has progressed under<br />\ning to special rates offered by railpast administration, but realize that there is much room for improveediroad and steamship lines.<br />\nment. The student body may rest assured that the newly-elected<br />\n* * *<br />\ntors will do everything in their power to make the NEWS-LETTER an<br />\norgan which will reflect credit upon the Johns Hopkins.<br />\nA senior at Washington State<br />\nThe increase of interest in the NEWS-LETTER, as shown by the recent profusion of contributions to the MAIL BAG, is extremely encourhas<br />\nattended 14,050 classes in the<br />\nto<br />\naging. Without this interest the NEWS-LETTER would be unable<br />\nsixteen years without being abpast<br />\nlive up to its purpose, namely to reflect student opinion as well as to<br />\nor late once.<br />\nL.<br />\nsent<br />\nS.<br />\ntabulate campus events.<br />\n*<br />\n<br />\nE NOTE, with a great deal of amazement, the plan offered to<br />\n<br />\nWthe Johns Hopkins Athletic<br />\nBoard by the Athletic Board of St.<br />\nse measure to settle the question of a<br />\n<br />\nJohn's College, as a compromi<br />\nlacrosse game this year between the two institutions.<br />\nIn this suggested compromise four universities would be involved,<br />\nand their present lacrosse schedule revised to a certain degree. Princeton University, the University of Maryland, St. John's College and the<br />\nJohns Hopkins University would be required to make a shift of games<br />\nin their present schedules.<br />\nBy the new plan, St. John's would play Princeton on the date that<br />\nHopkins is now scheduled to meet the Tigers, namely May 1 and Hopkins in turn would be ,required to meet Princeton on May 23, the existing date of the Johns Hopkins-University of Maryland game.<br />\nFurthermore our game with the University of Maryland would have<br />\nto be put off until June 6th, a date after the closing of both of the<br />\nUniversities.<br />\nThe St. John's-Johns Hopkins fracas would cake place on May 2,<br />\nthe day following the St. John's-Princeton game.<br />\nIn our estimation, this suggested plan is preposterous and we feel<br />\nthat it would be a very unwise move for all those concerned to adhere to such a suggestion.<br />\nAll this controversy and wrangling could have been avoided if the<br />\nSt. John's College had shown any semblance of cooperation on her<br />\npart when the schedules were being made up.<br />\nAt that time, we offered St. John's these dates, namely the 18th and<br />\n25th of April and the 6th of June. In reply, the Crabtown powers that<br />\nbe, said that the two April dates were not satisfactory purely because<br />\nit was too early in the season to play Hopkins and that the 6th of June<br />\nwas out of the question because they would not be able to put a team<br />\non the field at that date.<br />\nIn return, they offered to us the 2nd of May as the only date that<br />\nthey could meet the Jay twelve. In reviewing the existing situation, the<br />\nHopkins authorities held that it would be unfair to both St. John's and<br />\nPrinceton to accept this date in view of the fact that the Princeton<br />\ngame had been scheduled many months before on Mriday, May 1st.<br />\nWe can see no reason why St. John's did not accept one of the dates<br />\nin April in the first place; but since both of those dates are no longer<br />\nopen and since the only possible date for the St. John's-Hopkins game<br />\nseems to be the 6th of June, we therefore sincerely hope that an agreement to that effect will will soon be reached by the two institutions.<br />\n<br />\nLow Evening<br />\nand Night Rates<br />\nEvening Rates<br />\nBetween 7 P.M. and<br />\n8:30 P. M.<br />\n15% to 20% lower<br />\nthan day rates<br />\n<br />\nNight Rates<br />\nBetween 8:30 P. M.<br />\nand 4:30 A. M.<br />\n40% to 50% lower<br />\nthan day rates<br />\n<br />\nTHE CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY .<br />\nOF BALTIMORE CITY<br />\n<br />\nraM.M1.1<br />\n<br />\ner=)<br />\n3r/rbUttiepd<br />\n31<br />\n<br />\n(ga AcgrffelE<br />\nelOthip(21...14atiViCiablV.A.4<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE... MARYLAND<br />\n<br />\nany a man is<br />\ndoingr work. day after<br />\nday that an electric<br />\nmotor can do for lessPii,<br />\nthan a cent an hour IS<br />\n<br />\nEDITORIALS<br />\n<br />\nFOOLISHNESS<br />\n<br />\nTHE tune of reluctance played on<br />\nthe ink well. The<br />\nResourceful Soul<br />\nanswers—call 'em<br />\nby Long Distance<br />\ntelephone and<br />\nhave a real<br />\nvisit.<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n\"Objectionable material\" will be<br />\ndeleted from the 3,500 copies of the<br />\nFraternity Number of the Longhorn-Ranger before its distribution.<br />\n*<br />\n<br />\n*<br />\n<br />\nWI<br />\n<br />\n*<br />\n<br />\n\\r)<br />\nfoilm*<br />\n<br />\n) 1 a=7<br />\n___)l<br />\n<br />\nStudents in the School of journalism at Marqtrotte University, al-.<br />\nthough they spend the least time in<br />\noutside work, have the greatest average earning capacity as compared<br />\nto students in other departments.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nGreen caps will be seen no more<br />\nand sophomores will no longer torment their first year rivals at Ohio<br />\nUniversity by virtue of new laws<br />\npassed by the Junior-Senior Governing Board this week.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nParents representing forty nationalities sent their sons and daughters to the University of Wisconsin<br />\nin the fall of 1930.<br />\n* * * *<br />\nThe Interfraternity Council at<br />\nAlabama Polytechnic Institute has<br />\ndecided to send each prospective<br />\nfreshman, before he enters college,<br />\na booklet giving a brief history of<br />\nthe fraternities in the council, their<br />\nofficers, and the relative expense of<br />\nbelonging to them.<br />\n<br />\nCollege men and women recognize electricity as one of the principal aids to<br />\nprogress in the factory, on the farm, and<br />\nin the home.<br />\n<br />\nGuided by human intelligence,<br />\nelectricity can do almost any<br />\njob a man can do. From stirring<br />\nto grinding, from lifting to<br />\npulling, there is a G-E motor<br />\nspecially adapted to any task.<br />\n<br />\n210-60D11<br />\n<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\n^ELECT IC<br />\n<br />\nCOMPANY.<br />\n<br />\nSCHENECTADY,<br />\n<br />\nNEW<br />\n<br />\nY<br />\n<br />\nOR1C•<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br />\nPhone: VErnon 1868<br />\n'What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING Co.<br />\nMoth Holes, Burns, Tears. Cuu and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\n1931-32 \"Y\" Cabinet Wrestling Practice<br />\nHeld Thrice Weekly<br />\nTo Be Installed<br />\n<br />\nBAER, NOTED SURGEON Women Win Collegiate International Relations<br />\nGood Sleep Contest Conference To Be Held<br />\nDIES<br />\nFROM<br />\nPARALYSIS<br />\nAt Carleton April 17-18<br />\nTuesdays,<br />\n<br />\nJack Hart, University of Pennsyl- Spring Practice In Barn<br />\nThursdays, Fridays; New Candivania Chaplain, Slated To<br />\ndates For Team Are Desired<br />\nSpeak<br />\n<br />\nHamilton, N. Y.(NSFA)—Girls<br />\nOrthopedist Succumbs Tues. are far better<br />\nsleepers than men, acMorning;<br />\nOn<br />\nFaculty<br />\nNorthfield, Minn. (NSFA)—<br />\nInstallation of next year's Y. M. Saul Jacobson, manager of the<br />\ncording to Dr. Donald Laird, \"ex30 Years<br />\nC. A. cabinet will take place at the team, yesterday announced that the<br />\npert\" on the subject of sleep and Nineteen midwest colleges and unithird annual Student Movement wrestling squad will hold spring<br />\nprofessor of psychology at Colgate versities will be represented at a<br />\n(Continued from Page 1, Col. 4)<br />\ntwo-day regional international relaDinner next Tuesday in Levering practice for those men not candiJ. H. FURST CO.<br />\nwas made more famous by his con- University, where a recent sleep tions conference to be held at CarleHall.<br />\ndates for any spring sport, and that clusion, the<br />\nPRINTERS OF<br />\nresult of service in survey was held.<br />\nton College, April 17 and 18, under<br />\nThe dinner will begin at 6.30 p. new men would be welcomed. Prac- France<br />\nPhilological and Scientific<br />\nAn intercollegiate good sleep con- the auspices of the International<br />\nas the chief orthopedic conHall,<br />\nEdwin<br />\nwith<br />\nGreat<br />\nthe<br />\nm.<br />\nin<br />\ntice<br />\nis<br />\nheld<br />\non<br />\nTuesday,<br />\nThursday<br />\nPublications<br />\nsultant of the A. E. F., that the test was held between the men at Relations Club of that college.<br />\nLockard presiding. The new officers and Friday of each week in the grub of the blue-bottle<br />\n12-20 Hopkins Place, Baltimore<br />\nfly will clear Colgate and the women at SkidSubjects will pertain to American<br />\nwill be presented by the old presi- Barn at four o'clock.<br />\nup deep-seated infections of the more College.<br />\npolicy towards Russia, the present<br />\ndent, Jack Mount. The new presiDue to the scarcity of collegiate bone which defy all other methods<br />\nResulting figures showed that status of India, and the tariff quesdent, Walter Glass, will then pre- wrestling teams in the vicinity, it of treatment. For two years he ex- girls have<br />\nless trouble going to tion in the international situation.<br />\nService<br />\nGive<br />\nDrugs<br />\nand<br />\nWe Sell<br />\nsent the rest of the new cabinet, was stated, trips planned for next perimented with the theory. Not<br />\nsleep, wake up fewer times during An outside speaker who is an auRobert<br />\nbe<br />\nby<br />\nwill<br />\ninstalled<br />\nwhich<br />\nyear will be outside the state. For until he had proved its worth sev- the night, are less restless, and<br />\nCall us up Belmont 5318, 5846<br />\nhave thority in his line will be secured<br />\nL. Ball, who was president- of the this reason the number of meets eral times did this frank, straightfewer dreams.<br />\nPeabody Pharmacy<br />\nto give the introductory explana\"Y\" in 1926-27.<br />\nwill be lessened, and about six con- forward Hopkins surgeon reveal<br />\nIn addition, fewer girls have to tion for each topic.<br />\nCalvert and 30th Streets<br />\nJack Hart of the University of tests are planned. The schedule for his discoveries in a paper which he<br />\nPennsylvania will deliver the ad- next year is now being compiled, read at a meeting of the Interstate be called twice in the morning and<br />\nDr. Keith Clark, chairman of the<br />\ndress of the evening. Parents of the and will be made public at an early Medical Association, held in De- in general feel more peppy and less department of history at Carleton,<br />\ngrouchy and are less foggy mental- is the faculty advisor of the stucabinet members and other inter- date.<br />\ntroit. Physicians are said to have ly in the morning.<br />\nested persons have been invited to<br />\nAccording to present plans, there been cynical in regard to his new<br />\ndent committee in charge of all arProf. Laird attributes this to the mittee, three round table discussions<br />\nattend.<br />\nwill be a junior varsity squad for conclusion.<br />\nthe training of men unable to make<br />\nMay, 1917, Dr. Baer was the first theory that members of the fem- rangements. According to this cornfirst<br />\nthe<br />\nteam.<br />\nwill<br />\nThis<br />\nsquad<br />\nof a group of distinguished Balti- inine sex are neither as active phy- will be held during the conference.<br />\nDon Proctor Sings<br />\nwrestle with several scholastic more surgeons to leave for the sically or mentally as men.<br />\nThese meetings wlil be brought to<br />\nAt Midday Musicale teams of Maryland.<br />\n\"Only four hours may be suffi- a close by a dinner on Saturday<br />\nfront. He remained in France in<br />\ncient to recuperate physically,\" he night, April 18. At that time, Count<br />\nactive service until 1919.<br />\n'Selections Rendered By Baritone<br />\nFounded Children's Hospital<br />\nmaintains, \"but mentally may need Carlo Sforza, formerly minister of<br />\nSoloist Received Favorably By<br />\nJay<br />\nTracksters<br />\nMeet<br />\nAs a surgeon of wide repute he eight hours more to be completely foreign affairs in Italy, will give the<br />\nAudience<br />\nAND<br />\nprincipal address.<br />\nDonald Proctor, baritone, pre- Gettysburg Tomorrow was especially famous for his work rested.\"<br />\nsamong children. Through his efsented a varied program of vocal<br />\nselections at the weekly informal Conditioning Made Difficult Due To forts the Children's Hospital school,<br />\nTHE<br />\nGreen Spring Avenue and 41st<br />\nInclemency of Weather, Claims<br />\nmidday musicale held in Levering<br />\nStreet, was founded. Dr. Baer was<br />\nCoach Hambleton<br />\nHall last Tuesday. Proctor is a<br />\nthe<br />\nchief physician here.<br />\nsophomore in the College of Arts<br />\nThe<br />\nsurgeon was a member of<br />\nhere.<br />\ntrackSciences<br />\nand<br />\nTomorrow, the Blue Jay<br />\nthe<br />\nUniversity<br />\nClub as well as other<br />\nCarrie Jacobs Bond's 'Just A- sters journey to Gettysburg Colorganizations.<br />\nby<br />\nDear,\"<br />\n\"My<br />\nYou,\"<br />\nWearyin' for<br />\nlege, to open their 1930 season.<br />\nFuneral services were held at the<br />\nErnest R. Ball, and \"Love Is A<br />\nMt.<br />\nVernon Place M. E. Church<br />\nstrength<br />\nof<br />\nLittle<br />\nis<br />\nof<br />\nthe<br />\nknown<br />\nSanderson,<br />\nWilfred<br />\nBurden,\" by<br />\nyesterday at 3.30 p. m.<br />\nwere included in the program of se- the Pennsylvanians for they WO,<br />\nEight Active Pall-Bearers<br />\nOPPOSITE<br />\nlections presented most enjoyably are just opening their season: A<br />\nEight<br />\nactive pall-bearers were<br />\nPENNA.RR.STATION by Proctor. \"At Dawning,\" a fa- number of lettermen have been lost chosen from<br />\northopedic surgeons,<br />\nvorite by Charles Wakefield Cad- to the team that<br />\ntied Hopkins last all of whom received their special<br />\nKarl<br />\nby<br />\nNight,\"<br />\nmon, \"Calm as the<br />\nBohn, \"Chanson D'un Coeur year in a dual Meet, but additional training under Dr. Baer. Honorary<br />\nBrise,\" by Moya, and the well men from the ranks of last year's .pall-bearers, numbering seventy, inff.OTHES<br />\nknown \"Mandalay,\" by Oley frosh are being molded into a team cluded the names of some of the<br />\nSpeakes, completed the program. around nucleus of the few . re- country's most eminent medical<br />\nmen and close associates in the U.<br />\n211-213 E. Baltimore St.<br />\n• Mr. Proctor was especially lauded maining veterans.<br />\nArtily, including Gen. J. J.<br />\nS.<br />\nfor his remarkable ability to retain<br />\nHopkins has been equally ; hard Pershing.<br />\nhis volume and excellent tone quality throughout the performance. hit. With ate graduation of .such<br />\n\"Mandalay,\" the finale, especially Men as Stafford .and Hershey, the<br />\nserved to bring out his abilities in squad Was left destitute of experithis respect.<br />\nenced hurdle men. The loss of CapThe audience very enthusiastically tain Sheidt will be felt in the hurreceived all of the presentations, dle and pole-vault, while the work<br />\nespecially the finale.<br />\nof.13ob' Kelly in the distances will<br />\nRichard M. Tillman accompanied ..be .keenly missed.<br />\nProctor on the piano.<br />\n-.it is with some misgiving that<br />\nCoach Hambleton takes his men to<br />\nW. H. Wilmer Named Gettysburg, for the inclement<br />\nand unexpected holiday has<br />\nTo Editorial Hoard weather<br />\nMade conditioning almost impossiJ. II. U. Ophthalmologist Chosen On ble. The return of \"Bill\" Dorman<br />\nand Hughes Caldwell has bolstered<br />\nBoard of Sight-Saving<br />\nReview<br />\nthe field strength materially. In the<br />\nDr. William H. Wilmer, director dashes, the Jays appear to be exA pre-eminent Hotel of 1200<br />\nof the Wilmer Ophthalmological ceptionally strong. Captain LockRooms, each having Bath, Institute of the Johns Hopkins Uni- ard, Chassin, Wilfson, Linck, and<br />\nSe r vidor, Circulating Ice versity, was named one of the mem- 'Reynolds and Frenkil, freshmen,<br />\nbers of the editorial board of the will .carry the burden of all the<br />\nWater and many other inno- Sight-Saving Review, a quarterly sprints including the '440!<br />\nvations...featuring a sincere journal sponsored by the National Coach Hambleton is taking a•<br />\n*11.711-10<br />\n:<br />\n1<br />\n7<br />\nSociety, for the Prevention of large squad to the meet and doubtspirit of hospitality.<br />\nBlindness.<br />\nless every man will see action, as<br />\n-1<br />\n4<br />\ni<br />\n• According to Science Serviee, the the coach wishes to see how his men<br />\npurpose of the magazine is to pro- behave 'under fire.'<br />\n'ROOM AND BATH $3UP vide an additional weapon with Among the promising new matewhich to fight blindness.<br />\nrial are 'Don' Bittinger, who recently won the handicap meet held at<br />\nthe field, 'Pete' Reynolds, whose<br />\n,feats on the football field are to be<br />\nOPERATE IT YOURSELF<br />\nRENT A CAR<br />\nremembered, and 'Vic' Frenkil, who<br />\ncaptained the Forest Park cinder<br />\nartists last year.<br />\nThe Jays are unfortunate this<br />\nyear in that all but one of their<br />\nmeets will be run on alien tracks;<br />\nCars for Hopkins Students<br />\nthere<br />\nare both a physical and pschoDeposit Not Required<br />\nlogical handicap attached to such<br />\n111 W.NORTH AVE.<br />\n.conditions.<br />\n2125 HARFORD AVE.<br />\n<br />\npELCOME<br />\nTo<br />\nNEWYORK<br />\n<br />\n_MOTEL<br />\n(41VERNOIA<br />\n<br />\nYou just can't help<br />\nlooking well-dressed<br />\nin Katz Clothes<br />\n<br />\ngINTON<br />\n51s2ST.`0162711YAVE,<br />\n<br />\nAYBE YOU'RE PAYING TOO<br />\nMUCH FOR GAS BECAUSE<br />\nYOU'RE PAYING TOO LITTLE<br />\n7<br />\n<br />\nAMOCO-GAS<br />\n<br />\nThe Auto Rental Company<br />\n<br />\nPhone, Wolfe 1413<br />\n<br />\nGIVES MORE<br />\nPER<br />\n<br />\nNumber of Foreign<br />\nStudents Increased<br />\nChinese And Canadians Lead In 10<br />\nPer Cent Increase Of Foreign<br />\nStudents In America<br />\n<br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br />\n<br />\nNew York, N. Y.—In 1929-30<br />\nmore than 10,000 foreign students<br />\nwere registered in some 450 American institutions of higher learning.<br />\nThis is an increase of 10% or more<br />\nover the preceding year.<br />\nThe Chinese and Canadians lead<br />\nthe list of Foreign students with<br />\n1,294 and 1,263 respectively, according to the Committee on Friendly Relations among Foreign Students, and the Japanese with 987,<br />\nthe Philippinos with 887, the Russians with 538, the Germans with<br />\n397, the English with 365, the Mexicans with 315 follow in order.<br />\n(N.S.F.A.)<br />\nTHANK YOU:<br />\nThe cut of George W. Russell<br />\n(A.E.) which appeared in the last<br />\nissue of the NEWS-LETTER was<br />\nlent through the courtesy of the<br />\nBaltimore Post. The NEWS-LETTER at this time acknowledges the<br />\nfavor.<br />\n<br />\nMILES<br />\nGALLON— — -REDUCES<br />\nOPERATING<br />\nEXPENSES — —<br />\n<br />\nHad<br />\nghe AMERICAN OIL COMPANY<br />\nAffiliated with Pan American Petroleum & Transport Compaq<br />\n_General Offices: Baltimore, bid.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br />\n<br />\n4<br />\n<br />\nObstetrician<br />\nCENTRAL 'Y' BOARD Hopkins<br />\nFavors Anesthesia<br />\nIn Child-Delivery<br />\nPROPOSES SECOND<br />\nCONFERENCE, SAID<br />\n<br />\nHopkins Frosh, City<br />\nMeet Today In<br />\nAnnual Debate<br />\n<br />\nJ. W. Williams Advocates Move To<br />\nMake Child-Birth Painless<br />\nBy Use Of Opiates<br />\n<br />\nIn answer to the query \"Should<br />\nWhether Schaal Is To Be Rechildbirth be made painless?\", made<br />\ntained Or Dismissed, Not<br />\nby Science Service of four obstetYet Ascertained<br />\nrics authorities, Dr. J. Whitridge<br />\nWilliams, obstetrician-in-chief at<br />\nTWO BOARDS WILL MEET the Hopkins Hospital, and professor<br />\nTO DISCUSS ISSUE of obstetrics at the J. H. U. Medical<br />\nSchool, declared he favored the use<br />\nHas Been Agreed That Hop- of anesthetics in child-delivery.<br />\nDr. Williams advises nitrous oxkins, Central Groups Each<br />\nide gas with oxygen during the secNominate Levering<br />\nond stage in all normal labors. In<br />\nSecretary<br />\naddition, a small amount of heroin<br />\nis given by hypodermic and the paWhether E. A. Schaal, secretary tient is kept in a quiet, semi-darkof the Johns Hopkins branch of the ened room.<br />\nFor home practice, however, he<br />\nY. M. C. A., will be reappointed to<br />\nthe position he now holds at Home- recommends chloroform. Administration of nitrous oxide requires a<br />\nwood has not been ascertained yet, trained anesthetist, he explained; the<br />\nit was learned after the meeting of apparatus is bulky and difficult to<br />\nthe Metropolitan Board of the transport and the gas is expensive.<br />\ndowntown branch late Wednesday. With either type the anesthetic is<br />\ngiven during the second stage, a few<br />\nAdvise Second Confab<br />\nThe group at the Central \"Y,\" whiffs at the beginning of each pain,<br />\nheaded by James C. Martine, it was Dr. Williams said. At the end of<br />\nannounced by Carlton Harrison, this stage, as the baby's head is born,<br />\nsecretary, proposed that a second the patient is made completely unconference be held of full repre- conscious by increasing the amount<br />\nsentation of both the Metropolitan of the anesthetic.<br />\nBoard and the Board of Managers, The use of anesthesia in obstetof the Hopkins, for further discus- rics is now being widely discussed<br />\nsion of the Schaal matter. They by the public and is still the subhave not decided on the retainment ject of disagreement in medical<br />\nor dismissal of Mr. Schaal, but will circles.<br />\ndefinitely decide following the interboard conference.<br />\nThis move places the controversy<br />\nin balance. It is indicated, however,<br />\nthat a decision must be reached<br />\nsoon for the ultimate good of both<br />\nthe Central and Hopkins groups.<br />\n<br />\nTeams representing the Johns<br />\nHopkins freshmen and the Baltimore City College debate today<br />\non Resolved, That the United<br />\nStates Join the League of Nations.<br />\nIn this forensic clash, to be<br />\nstaged at 3 p. m. at the high<br />\nschool, 33rd street at the Alameda, the Hopkins debaters will<br />\nuphold the affirmative to the<br />\nquestion and will be represented<br />\nby Saul Dorfman, S. M. Doctofsky, and Charles Stern.<br />\nHerbert Rosenbaum is first<br />\nspeaker for City College; Eric<br />\nGoldman, second; Louis Kraus,<br />\nrebuttal.<br />\nThe Homewood frosh last year<br />\nwere defeated by the City Col-<br />\n<br />\nHABIT TRAINING DISCUSSED<br />\nDr. Esther L. Richardson, of Hopkins<br />\nHospital, Addresses Club,<br />\nTuesday<br />\n<br />\nBefore the Govans Improvement<br />\nClub Tuesday at 2.30 p. m., in the<br />\nGovans Branch of the Enoch Pratt<br />\nLibrary, Dr. Esther L. Richardson,<br />\nassistant professor of psychiatry at<br />\nthe Hopkins, spoke on \"Habit<br />\nTraining In Children.\"<br />\n<br />\nSp ring Showing<br />\n<br />\nILG ER9S<br />\ncANDWICI-1<br />\nefilOPS<br />\n<br />\nClaims That An Inner Force, Manifested In Dreams, Often Shows<br />\nExtraordinary Creative Genius<br />\n(Continued front Page 1, Col. 3)<br />\n<br />\nmental, or possibly spiritual anguish, he finally formulates alibis<br />\nwhich should satisfy God, and resumes his flight. But doubt enters<br />\ninto his mind. Is that God of whom<br />\nhe has heard the real God? Smith<br />\nstops his travels again to fix an<br />\nalibi that would satisfy any God,<br />\nand then, peaceful and confident at<br />\nlast, goes on. Finally he reaches the<br />\ngates of heaven, God, he finds, was<br />\na gigantic Smith, in whose image<br />\nhe had been created. That was the<br />\nonly God that he could not deceive.<br />\nDiscusses Dreams<br />\n<br />\nAdvancing the theory that there<br />\ninner force in man that manian<br />\nis<br />\nfests itself in the dream state,<br />\nGeorge W. Russell yesterday addressed a crowd that overtaxed the<br />\ncapacity of Latrobe Hall's assembly<br />\nroom. This force, he claimed, often showed a creative genius that<br />\nby far trancended that shown in<br />\nthe soul in its waking state.<br />\nThe mystic ascribed several of<br />\nhis poems and several paintings to<br />\nvisions seen in his dreams. He cited<br />\none instance in which he had a vision of a painting in a dream every<br />\nstroke of which seemed perfectly<br />\nclear and separated from every<br />\nother one. On the following morning, it was stated, he painted the<br />\npicture and signed it \"AE.\"<br />\n<br />\nNot only excellent food, but the choice<br />\nmeeting place of the better class of people<br />\n2<br />\n<br />\n\"GOOD THINGS TO EAT\"<br />\nUP-TOWN SHOP<br />\n<br />\nDOWN-TOWN SHOP<br />\n<br />\nNorth & Charles<br />\n<br />\nCalvert & Fayette<br />\nOPEN ALL NIGHT<br />\n<br />\nSAMUEL KIRK & SON, Inc.<br />\nJewelers—Stationers—Silversmiths<br />\n421 North Charles Street<br />\nBaltimore, Md.<br />\nWRIST WATCHES FOR MEN<br />\nGIFTS IN SILVERWARE<br />\nFINE STATIONERY<br />\nFounded 1815<br />\n<br />\nNEW<br />\n<br />\nUSED<br />\n<br />\nFORD<br />\nAutomobiles<br />\n<br />\nPresents Own Explanation<br />\n<br />\nInitial Conference Held<br />\n<br />\nThe first confab of representatives of the two boards was called<br />\nby Dr. Joseph S. Ames, president<br />\nof the University, about a month<br />\nago in an effort to clear up the misunderstandings which had arisen regarding the scope of authority by<br />\nboth bodies in the selection of the<br />\nsecretary for the campus \"Y\"<br />\nbranch. John K. Mount, Jr., recording secretary of the Board of Managers at Homewood, had forwarded<br />\nthe motion passed by the Levering<br />\nHall group to Dr. Ames.<br />\n<br />\nGeorge Wm. Russell,<br />\nNoted Irish Poet,<br />\nConsiders Dreams<br />\n<br />\nMANHATTAN SHIRTS—SCOTCH SPUN<br />\nNECKWEAR—INTERWOVEN HOSE<br />\n<br />\nIn attempting to explode the<br />\npresent theories concerning dreams,<br />\nthe poet averred that neither the<br />\ntheory of the recombination of<br />\nmemories or of their recurrence offered adequate explanation of the<br />\nphenomena. Tis own idea, that of<br />\na creative genius of sleep, offers a<br />\na more logical and more satisfying<br />\nthesis.<br />\n<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br />\n<br />\n41,1rs<br />\n_<br />\n<br />\nMcPherson's<br />\n<br />\nmoursownsnvine<br />\nMg!<br />\n<br />\nAmes Gets Motion<br />\n<br />\nThe communication read, in part:<br />\nA motion was adopted at the last<br />\nmeeting of the board of managers<br />\nof the Johns Hopkins Y. M. C. A.<br />\nstating that in view of the fact that<br />\nmisunderstandings have arisen regarding the scope of the Metropolitan Board and the Johns Hopkins<br />\nY. M. C. A., the president of the<br />\nUniversity be requested to arrange<br />\na conference between representatives of these boards.<br />\n<br />\n11 East Baltimore Street<br />\n<br />\nFriends of the secretary persuaded the Central \"Y\" group to<br />\npermit Mr. Schaal to continue in<br />\nhis capacity until the culmination of<br />\nthe present academic year.<br />\n<br />\nEngraving<br />\n<br />\nJEWELER AND OPTICIAN<br />\n3222 Greenmount Avenue<br />\n5409 Harford Avenue<br />\nNearest Jeweler to the Campus<br />\n<br />\nence at an early date, to regularize<br />\nthe rather indefinite situation which<br />\nnow exists as to the relations between the University, the Y. M. C.<br />\nA. of Hopkins and the Y. M. C. A.<br />\nof Baltimore. In my judgment,<br />\nwhatever agreement is reached will<br />\nhave a bearing only upon the future<br />\nand will go into effect in the next<br />\nacademic year.<br />\n<br />\nMetropolitan Board Persuaded<br />\n<br />\nKIBLER'S<br />\n<br />\nRepairing<br />\n<br />\nThe president, in answer to this,<br />\nhad declared:<br />\nI am prepared to call this confer-<br />\n<br />\nMutual Agreement Reached<br />\nAt the initial conclave it was<br />\nmutually agreed that each board<br />\nwas to have the privilege of nominating whomever they desire for<br />\nthe Levering Hall position. Nominations are to be forwarded to Dr.<br />\nAmes for consideration. The University president is to select the<br />\nman whom he believes should be<br />\nappointed. His selection is to be<br />\nfinal.<br />\nMr. Schaal was asked to resign<br />\nlast July by the Metropolitan Board<br />\nbut refused to, declaring he would<br />\ndo so to the Homewood Board of<br />\nManagers only.<br />\n<br />\n\"The Store of Standard Value\"<br />\n<br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nv‘irv<br />\n<br />\nSometimes the cart<br />\nshould be put<br />\nbefore the horse<br />\n<br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\nHere's a case where a warehouse was built around a conveyor, instead<br />\n<br />\n•WV<br />\n<br />\n\"Food Prepared the Right Way\"<br />\nof the conveyor being squeezed into the warehouse...Western Electric<br />\n<br />\nWhen in Aretv York dine at<br />\n<br />\nSt. Regis Restaurants<br />\nLocated<br />\n<br />\nwanted a new warehouse for telephone equipment. For the most effi-<br />\n<br />\ncient handling of material,its own distribution engineers designed a system ofconveyors<br />\n<br />\nat<br />\n<br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd Sc.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br />\n<br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br />\n<br />\nPackages can be<br />\nswitched onto sidings— by one central dispatcher<br />\n<br />\neven before architectural details of the building were worked out ... This was done<br />\n<br />\nafter careful estimate had been made of volume and kinds of material to be stored<br />\n<br />\nand handled ...There are many other assignments that challenge re-<br />\n<br />\nThom Cup Contest<br />\nBooked For Next Month<br />\nTryouts Will Be Held During Next<br />\nTwo Weeks To Determine Final<br />\nContestants<br />\n<br />\nIn accordance with the annual<br />\ncustom, the Thom cup will be<br />\nawarded to the winner of the Extemporaneous public speaking contest to be held early in May in Levering Hall. The cup is offered by<br />\nMrs. H. R. M. Thom, prominent<br />\nin Baltimore society, in memory of<br />\nHunt Reynolds Mayo Thom, and is<br />\nnow on display in the main library.<br />\nTryouts will be held in the public<br />\nspeaking classes during the next<br />\ntwo weeks, in order to determine<br />\nupon the final contestants.<br />\n<br />\nMILESTONE SYSTEM<br />\n<br />\nsourcefulness and imagination in making telephones and equipment<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\n<br />\nfor the Bell System—purchasing its supplies—acting as its distributor.<br />\n<br />\nDRIVE IT YOURSELF<br />\n<br />\nBuick@<br />\nFords<br />\nChryslers<br />\nHupmobtles<br />\nChevrolets<br />\n<br />\nCoupes<br />\nRoadsters<br />\nSedans<br />\n<br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br />\n<br />\nPLaza<br />\n<br />\n6000<br />\n<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br />\n<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nSpeed needed!<br />\nThe emergency<br />\nis met by the<br />\nnew warehouse<br />\n<br />\nWestern Electric<br />\nManufacturers...Purchasers...Distributors<br />\n5P THE BELL SYSTEM<br />\nSINCE 1182 FOR il<br />\n<br />\n\f", "format": "basic_html", "processed": "COTILLION BOARD DANCE<br />\nWill be held<br /><br />\nJUNIOR DANCE<br />\nTickets now procurable<br />\nfrom Committee Membets<br /><br />\nIn Latrobe Hall<br />\nTomorrow Night<br /><br />\nVol. XXXV, No. 43<br /><br />\nLIBERAL CONCLAVE<br />\nGETS UNDER WAY<br />\nTOMORROW MORNING<br /><br />\nApril 18<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., APRIL 10, 1931<br /><br />\nNew Editorial Board<br />\nElected By NewsLetter Staff<br /><br />\nTax $1.75<br /><br />\nPrice 5 Cents<br /><br />\nIRISH POET STIRS Music and Chemistry Relation<br />\nJAY LACROSSEMEN<br />\nCROWD IN TALK ON<br />\nEstablished By Hopkins Man CLASH TOMORROW<br />\nLITURGISTS OF ERIN<br />\nWITH SWARTHMORE<br /><br />\nDr. D. H. Andrews, Chemistry Professor, Discovers Connection<br />\nBetween Them; To Broadcast Over Columbia<br />\nAE Recalls Friendships With<br />\nGame With Maroon Twelve To<br />\nChain Next Friday<br />\nLeaders In Irish Literary<br />\nBe Played At Homewood<br />\nMovement<br />\nDue to the recent findings of Dr.<br />\nField<br />\nAlthough Dr. Andrews said this<br />\nDonald Hook Andrews, Professor disclosure was only an incidentalu<br />\nPOET CALLS G. B. S.<br />\nof Chemistry, a relation has been part of the study of chemical mole- VAN ORMAN LAUDS<br />\nfound<br />\nbetween chemistry and music, cule's structure which he has been<br />\nVISITING MENTOR<br />\nANGEL INCARNATE<br />\nwhich enables the action of chem- making for some time, he believes it<br />\nSpoke Yesterday On 'A Poet ical atoms to be transposed to the can be of value in the study of Pennsylvanians In B e tte r<br />\nmusical scale, and played or sung. chemistry.<br />\nShape Now Than When<br />\nAnd Artist Considers<br />\nThis discovery was first disclosed<br />\n\"It is a new approach to this sciThey Met Hillmen<br />\nDreams'<br />\nby Dr. Andrews at a lecture he gave ence,\" he said. \"It means that you<br />\nbefore the annual meeting of the can hear chemistry as well as see it.<br />\nDespite the unfavorable performIn a soft, low voice, whose chant American Chemical Society, at In- It tends to make things more<br />\nance<br />\nof Swarthmore's lacrosse team<br />\nbrought absolute silence to the dianapolis, on March 31st.<br />\nvivid.\"<br />\nagainst<br />\nMt. Washington two weeks<br />\nDr. Andrews stated that it might<br />\ncapacity assemblages in Latrobe That chemical activity is always<br />\naccompanied by musical vibrations be possible to project the<br />\nago, Coach Van Orman has been<br />\naction<br />\nHall last Tuesday and yesterday has long been an established fact,<br />\ninformed that he can expect opposievenings, George W. Russell, better according to Dr. Andrews, but these and sound of the molecule upon the<br />\nvibrations are entirely too high for screen, in the form of a talking tion of a better calibre in tomorknown by his pen name, AE, dean the human ear to hear. However, by movie. He mentioned this as one of<br />\nrow's contest.<br />\nof the Irish mystic poets, gave two a formula he has devised, they can be many interesting possibilities.<br />\n\"Abe\" Blake, Maroon mentor,<br />\nbrought down to an audible pitch.<br />\npublic lectures on poetry and poets This is done by dividing the frequency<br />\nNews-Reel Made Of Professor<br />\nstated that Swarthmore would unLast Monday, a news-reel com- doubtedly<br />\nTo Continue Until 11 P. M.<br />\nunder the Percy Graeme Turnbull of the chemical atom's vibration, by<br />\nhave a stronger team.<br />\nvelocity of light. Since the atoms pany took a talking movie of the In the<br />\nBeginning at 10 a. m. the con- 148 Courses Offered For Six- Lecture Foundation. The subjects the<br />\nfirst<br />\nplace, the Hillmen<br />\nof<br />\nvarious chemicals have different chemist, in which he explained this<br />\nference will continue until 11 p. m. Week Session At Home- of the talks were \"Some Personali- vibrations, musical notes<br />\nfracas was scheduled too early in<br />\ndiffer.<br />\nchemistry-music<br />\nrelationship.<br />\nThis the season for the<br />\nDuring the morning session, dewood; 78 On Faculty<br />\nMaroons. The<br />\nPictures In Form Of Light<br />\nties of the Irish Liteary Movement\"<br />\nfilm is to have a country-wide dis- team,<br />\nvoted to the consideration of the<br />\ncomposed mainly of new men,<br />\nThe method by which Dr. Andrews<br />\ntribution,<br />\nas part of the regular had had<br />\nand \"A Poet and Artist Considers determines the vibrations, is by takcauses of unemployment, three ad- REGISTRATION SET FOR<br />\nvery little practice, conseing pictures of them, by means of the news-reel.<br />\ndresses are to be given. Dr. George<br />\nquently, the squad was not in a posiJUNE 15-20, REMSEN Dreams.\"<br />\nspectograph. These photographs are<br />\nHe will also speak on this subject tion<br />\nE. Barnett, professor of statistics<br />\nCalling George Bernard Shaw in<br />\nto present its best efforts.<br />\nthe form of light. According<br />\nthe via the radio, over the network of<br />\nat the Hopkins, will discuss \"Basic, Dr. R. B. Roulston, Director; \"an angel incarnate,\" the Irish poet savant, they are much like the to<br />\nsound the Columbia chain, next Friday,<br />\nTan Orman Praises Blake<br />\nSeasonal, Cyclical Unemployment\"; Dr. J. S. Ames, President, named him<br />\nstrip on a talking movie film. These<br />\nDr.<br />\nVan Orman recently stated<br />\nthe<br />\n\"kindest,<br />\nmost<br />\ngen.April<br />\n17,<br />\n3.45<br />\nat<br />\nP.<br />\nHis<br />\nM.<br />\ntalk<br />\nphotographs are then transposed to<br />\nDr. Harry W. Laidler, executive diTo Meet Faculty<br />\nthat he has great respect for Blake's<br />\nwill<br />\nmade<br />\nbe<br />\nStation<br />\nfrom<br />\nWMAL<br />\nerous,<br />\nand<br />\nmusical<br />\nsympathetic\"<br />\nmost<br />\nthe<br />\nscale<br />\nby<br />\nmeans<br />\nman<br />\nof<br />\nthe<br />\nrector, League of Industrial Deability. The latter, who happens to<br />\nof Washington, D. C.<br />\nhe knew. \"He is the greatest man formula.<br />\nmocracy,\"Technological UnemployInstruction in summer courses<br />\nbe a Marylander, . has a Sound<br />\nment\"; Charles W. Ervin, associate conducted at the Johns Hopkins of letters of his time,\" the poet said<br />\nknowledge<br />\nof the game and he may<br />\neditor, The Advance, \"The Profit University will begin June 23, at of him, in recounting his unique<br />\nbe counted on to develop, in time, a<br />\nMotive As a Cause of Unemploy- 8.30 a. m., and will culminate July<br />\nstrong Swarthmore team. Most of<br />\nmeeting with Shaw . Encountering<br />\nment.\"<br />\n31, it was announced.<br />\nthe students have taken to the game<br />\nthe dramatist in the Dublin art galConsequences of unemployment<br />\nand<br />\nhave shown a strong desire to<br />\nRegistration June 15-20<br />\nlery,<br />\nhe carried on a conversation Orthopedist Succumbs<br />\nwill be depicted in the two adTues. \"Torchbearers\" By George learn.<br />\nRegistration<br />\nfor<br />\nthe<br />\nsession<br />\nwill<br />\nwith him for two hours, totally<br />\ndresses to be presented by Miss<br />\nMorning; On Faculty<br />\nKelly Will Be Presented<br />\nDespite these threats of a strong<br />\nAnna D. Ward, general secretary, take place from June 15 to June 20, ignorant of his companion's identi30 Years<br />\nopposition,<br />\n9<br />\na.<br />\nthere seems little reason<br />\nm.<br />\nto<br />\n4<br />\nApril<br />\np.<br />\nm.,<br />\n23,<br />\nin<br />\nRemsen<br />\n24,<br />\n25<br />\nHall.<br />\nFamily Welfare Association; and<br />\nty. Shaw told Russell that Whistler<br />\nwhy<br />\nthe<br />\nJays<br />\nshould have any fears.<br />\nSunday,<br />\nJune<br />\n21,<br />\nrooms<br />\nin<br />\nthe<br />\nJay Lovestone, editor, RevolutionGraduate of and professor at the<br />\n\"made him sick,\" the poet told his<br />\nPast performances have already<br />\nDue<br />\ndifficulty<br />\nto<br />\nin<br />\nobtaining<br />\nthe<br />\nary Age. Miss Ward has chosen as Alumni Memorial Hall will be<br />\nJohns Hopkins University, Dr.<br />\nstamped the team as being one of<br />\nher topic, \"Social Consequences.\" opened for occupancy by the out- audience.<br />\nWilliam S. Baer, internationally permission of the copyright owners the most powerful in the history of<br />\nof-town<br />\nstudents.<br />\nSections<br />\nA,<br />\nB, C,<br />\nMr. Lovestone will talk on \"EcoNoted In Many Fields<br />\n.known orthopedic surgeon, Tues- to produce \"The High Road,\" the the Indian pastime at Hopkins.<br />\nand E are to be reserved for womnomic Consequences.\" This session en; sections<br />\nGeorge W. Russell is noted in day at 11 A. M., died in the Union Barnstormers have chosen as their<br />\nD and F for men. InJay Material Plentiful<br />\nbegins at 2 p. m.<br />\nstructors are to be in their offices many fields of endeavor. He is a Memorial Hospital, subsequent to new play \"The Torchbearers.\" This<br />\nMaterial<br />\nfor all positions is<br />\nan<br />\nillness of approximately fifty<br />\non June 22, from 10 a. m. to 12 poet, painter, agriculturist, journalRound Table Discussions<br />\nplay was written by George Kelly, plentiful. In fact, Coach Van Orhours.<br />\nstricken<br />\nHe<br />\nwas<br />\nwith<br />\npaFour members of the J. H. U. noon, for consultation with students ist, and statesman. He has been ralysis Sunday morning while on one of the best actor-playwrites on man has come to the conclusion that<br />\nLiberal Club will lead discussion concerning courses.<br />\neditor of two newspapers, has his vacation in Delaware. Brought Broadway and has recently had a certain positions cannot be definiteDr. Ames To Meet Faculty<br />\ngroups on unemployment problems.<br />\npainted numerous works of art, is to Baltimore by ambulance, Dr. most successful showing in New ly bagged by any one player. This<br />\nLazare Teper will lead the round<br />\nDr. Joseph S. Ames, president at called by critics<br />\nimplies that the type of opponent<br />\n\"the greatest of Baer was admitted to the hospital York.<br />\ntable discussion of \"Hours of La- the Hopkins, is scheduled to meet<br />\nmust be taken into consideration.<br />\nIn<br />\ncondition.<br />\nunconscious<br />\nan<br />\nHe<br />\nbor and Unemployment\"; Joel the faculty of the summer courses Irish mystics,\" and has excelled as died while still in the coma, physiCalls for Difficult Lead<br />\nThus if Hopkins happens to enSeidman, \"What Unions Can Do\"; at 2 p. m., June 22, in Room 101, an agriculturist.<br />\nThe leading part in the play de- counter a rival possessing a fast<br />\nDuring his varied career, George cians declared.<br />\nH. G. Burke, \"Government and Remsen Hall. Dr. Robert B. Roulsmands an actress highly versed in offense, changes to fast defensive<br />\nAttended Hopkins<br />\nUnemployment\"; C. H. Van Duzer, ton, collegiate professor of Ger- Russell has formed friendships<br />\nFollowing<br />\ncompletion<br />\nthe<br />\nof his the dramatic art, and the club was men will be necessary. The same<br />\n\"Unemployment and the Negro.\" man, is director of the summer with many Irishmen famous in the medical course in 1898, when he reapplies to the Jays' attack.<br />\nlucky in finding Miss Evelyn Bigfield of letters. His lectures are filled<br />\ncourses.<br />\nIf the Black and Blue will need<br />\nceived his M.D. degree at the J. H.<br />\nNorman Thomas To Talk<br />\nSeventy-eight persons will consti- with anecdotes of his friends. Of U. School of Medicine, Dr. Baer ley, a teacher of expression at Bard speed, there are several on the<br />\nNorman Thomas, noted Socialist tute the faculty for the six-week Lord Dunsany, from whose pen<br />\nAvon, who is doing exceedingly squad who can supply it. This<br />\nleader in the United States, at 8 p. session at Homewood. One hundred some of the most unusual of pres- served for two years as assistant<br />\nwell at the present as the leading naturally accounts for the alternaresident<br />\nJohns<br />\nphysician<br />\nthe<br />\nat<br />\nm. will speak on \"Socialization as forty-eight courses are offered in ent-day writings have flown, the lecHopkins<br />\nDuring<br />\nHospital.<br />\n1900<br />\nand<br />\ncharacter,<br />\nwhich portrays a direct- tion between Dukehart and Stone,<br />\nturer holds some unique remema Solution.\" His talk, as well as the summer school.<br />\n1901 he was assistant orthopedic ress of an amateur show. The other Dowell and Triplett on the attack,<br />\nbrances.<br />\nthose of Dr. Isador Lubin, Brooksurgeon. In the School of Medicine<br />\nand Ness, Cone, Kneip and Hudert<br />\nings Institute, and Rabbi Dr. EdKnew Dunsany At Early Age<br />\nhe was on the teaching staff for 30 members who are to have parts in on the defense. Likewise the center<br />\nward L Israel, chairman of the Tickets Now On Sale<br />\nWhen Russell first knew Lord years, from 1901 until his unex- the show are already known to post will be shared by Cockey and<br />\nMunicipal Commission on EmployFor<br />\nDance<br />\nJunior<br />\nDunsany, the dramatist was a boy pected death. An instructor in or- Hopkins students because of their Buhler for the remainder of the<br />\nment Stabilization, will be broadof<br />\ncast by Station WCBM, Baltimore. Affair To Be Held At The Southern he tender years. Even at this age thopedics from 1901 to 1905, Dr. previous performances. They are campaign.<br />\nhad a map of what he called Baer was promoted to associate, in Whiting<br />\nHotel<br />\nOn<br />\nApril<br />\nFarinholt, Talbot Banks, Line-up for Swarthmore - HopDr. Lubin is to speak on \"Unem\"his land.\" This map, a six-foot which capacity he served from 1905<br />\n18th<br />\nS. Jesse Robinson, Barbara Sturte- kins game:<br />\nployment Insurance\"; Rabbi Israel,<br />\nTickets are now on sale for the affair, depicted a land of some to 1910. For four years, 1910-1914 vant, Earl Evans, P. L. Weisingoff, Hopkins<br />\nSwarthmore<br />\n\"Stabilization, Public Works and<br />\nJunior Dance which is to be held strange name. To reach this land, be was associate professor. From Cyrile Kader, Sam Selsky, Jeanette Stude<br />\nDavies<br />\nother Cures and Alleged Cures.\"<br />\nSaturday evening, April 18th at the Dunsany told Russell, \"you travel 1914 to 1927 Dr. Baer was asso- Sauters, Eleanor German and Vir- Bernard<br />\nDeldwind<br />\nOfficials of the club sponsoring<br />\nEast until you reach China. Then, ciate professor of clinical orthoMahon<br />\nWeitzel<br />\nCP<br />\nthe conference believe many of the Southern Hotel. The affair prom- instead of going around the world pedic surgery. In that year he was ginia Barsely. The characters are Ness<br />\nKeefer<br />\nFD<br />\nthe<br />\nof<br />\none<br />\nises<br />\nbe<br />\nto<br />\nmost outstandbeing excellently trained for this<br />\npublic will attend the evening sesRushmore<br />\nS D<br />\n:<br />\ni<br />\nL<br />\nKnoneng<br />\nagain, you go straight on and get named full professor in that study.<br />\nproduction,<br />\nwhich is of a very fast<br />\nDouglas<br />\nT D<br />\nsion, which will be devoted to ad- ing Hopkins affairs of the year.<br />\nHopkins<br />\nA.B.<br />\nthe<br />\nat<br />\nHe<br />\nhis<br />\ntook<br />\nto<br />\nmy<br />\nland.\"<br />\nThis<br />\nland<br />\nin<br />\nthe<br />\nwas<br />\nA musical tempo that is pleasingWilliams<br />\ntempo by the coaches, Bill Banks BuhIcr<br />\ndresses on remedies for unemployhere<br />\nafter<br />\nentered<br />\nin<br />\nhaving<br />\n1894,<br />\nwhich<br />\nDunsany's bizarre incidents<br />\nstone<br />\nT A<br />\nJoyce<br />\nly different and novel entertainment<br />\nment.<br />\nfrom the Baltimore City College, and Howard Caplan.<br />\ntook place.<br />\nS A<br />\nJones<br />\nfurnished<br />\nfeatures<br />\nwill<br />\nBud<br />\nbe<br />\nby<br />\nThis presentation which is exArrange Program<br />\nPA<br />\nLord Dunsany, stated Russell, local high school.<br />\nCodori and his Pennsylvania RamMcVaPuig<br />\n0H<br />\nirKellyu<br />\nlndb lI<br />\nkh<br />\ne<br />\nSurviving the famed surgeon is cellent in its portrayal and satire of Turnbull<br />\nwould have made an excellent artist.<br />\nIn charge of the program are blers.<br />\nHarlan<br />\nI H<br />\nTriplett<br />\namateur<br />\nproductions<br />\nbe<br />\nwill<br />\nespeRuth<br />\nMiss<br />\nformer.<br />\nhis<br />\nwife, the<br />\nJoel Seidman and Charles Stern. The committee in charge of the His drawings in early youth were<br />\nPublicity for the meet is in charge affair includes Ronald Levy, chair- indicative of a not inconsiderable Adams, of New Haven, Conn., cially interesting to Baltimoreans<br />\nwhom he had married in 1901. since Baltimore is one of the first Jay Netmen Retarded<br />\nof V. Jackson Lee and Vernon man; Ned Dukehart, president of artistic genius.<br />\ncenters of the little theater moveare no children.<br />\nThere<br />\nO'Rourke. Misses Tillye Braun and the Junior Class; Sylvan Lebow,<br />\nHeard Author's Stories<br />\nment in this country as evidenced Due To Wet Weather<br />\nFamed Orthopedist<br />\nMatilda B. Maloy are on the fi- Walter Kneip, Weitzel and Quick. Russell had the opportunity to<br />\nPassionately devoted to his pro- by the great number of little thea- Trips To Washington and New York<br />\nnance committee. Registration of<br />\nTickets may be procured from hear many of Dunsany's stories beand rooming accommodations for any member of the committee at fore their publication. Dunsany, he fession of orthopedic surgery, ters in this city, particularly on the<br />\nCity Scheduled For Next<br />\nHopkins campus which is reprethe delegates is in the hands of $1.75 a couple. At the door the asserted, a<br />\nof<br />\ncorrection<br />\nwith<br />\ndeals<br />\nthe<br />\nwhich<br />\nWeek<br />\nis born story teller, and<br />\nsented by the Barnstormers and the<br />\nMiss Thelma Shaivitz and James price will be $2.25 per couple.<br />\nDue to the inclemency of the<br />\neverything that he says is in the ,bone deformities, Dr. Baer has per- Homewood Playshop.<br />\nremarkable achievements in<br />\nD. McNeal.<br />\nweather, the Hopkins varsity tenform of a tale. Most of the char- formed<br />\nRoyalty Rights Procurred<br />\nsurgery in which he is<br />\nfield<br />\nof<br />\nthat<br />\nnis<br />\nteam was unable to hold its first<br />\nof Dunsany's stories told to<br />\nDr. Greenfield Speaks acters<br />\nThe Barnstormers have gone two schedule meets of the season<br />\nchiefly interested. It is said that<br />\nhis friend were later recognizible in due<br />\nto his declination of speaking through a great expense to obtain with American U. and Baltimore U.<br />\nTonight Before Club the dramatist's future writing. The<br />\nHopkins Year Book<br />\nabout his surgical work, his achieve- the royalty rights and even thus last Friday and Mondaq, respectiveGoes To Press Today History Professor Addresses Intercol- parable of Smith the Grocer, how- ments are well known to only those only through pull with the copy- ly. The late preponderance of wet<br />\never, he has never since recognized. in the medical world and not the<br />\nlegiate Italian Club On Italian<br />\nwrite owners. Whiting Farinholt, weather in this vicinity has greatly<br />\nOutlook<br />\nThe story of Smith, the Grocer, general public.<br />\nElections For Next Year's Staff Will<br />\npesident<br />\nof the club, announces that retarded developments on the tennis<br />\n\"The Outlook of a Resurrected is typical of Dunsany. It's abrupt, In 1929 the name of Dr. Baer since this is the<br />\nBe Held On Afternoon of<br />\nfirst time in the courts and it is very doubtful that<br />\nApril 23<br />\nItaly\" will be the topic of an ad- startling ending is of the sort for<br />\n(Continued on Page 3, Col. 4)<br />\nhistory of the Barnstormers that a they will be completed by the end<br />\nfamous.<br />\nDealIrishman<br />\nis<br />\nwhich<br />\nthe<br />\nToday the Hullaballoo, anuual dress to be given tonight in Latrobe<br />\nsecond showing will be held in one of this month.<br />\nPublication of the Hopkins student Hall, Room 120, by Dr. Kent R. ing with the travel of the soul of FROSH DANCE POSTPONED season, the student body and their<br />\nAt present, efforts are being made<br />\nbody went to press. Individual por- Greenfield, professor of European Smith, who has just died on Earth, Ted Stern, secretary<br />\nof the fresh- friends will have to give their to secure other courts for the imtraits of ninety-two seniors are in- history at the Johns Hopkins Uni- the story tells of the trip up to the man class, yesterday announced the heartiest support<br />\nin order to put it pending home matches with the<br />\ncluded in this edition, according to versity. He will talk before the In- gates of heaven. On the way, Smith postponement of the date of the across if they desire<br />\nthe Barnstorm- St. John's (of Brooklyn) tomorrow<br />\nL. Townsend Parks, editor.<br />\ntercollegiate Italian Club.<br />\nwonders if his life has been of the freshman dance due to a conflict ers to continue with<br />\ntheir new polDr. Greenfield, who will be intro- sort to allow him access to Para- with the Junior Dance and other icy of several performances a year. and St. John's (Annapolis) WedElections for the editors and<br />\nnesday. Matches for next week<br />\nbusiness managers for next year's duced by Charles Bandiere, vice- dise.<br />\nUniversity functions.<br />\nHarold Schwartz, business man- have also been scheduled with<br />\nstaff will be held on the afternoon president of the Backus Motor Co.,<br />\nMust Have Excuses For God<br />\nThe officers and the committee of ager, has announced that tickets will George Washington University on<br />\nc!f April 23. The results of the elec- will in his speech present personal<br />\nSmith decides that he must have a the freshman class will meet at a soon be on sale for the perform- Monday, April 13, at Washington,<br />\ntion are to be announced at the Ju- observations while on a tour of set of excuses for God. After long future date to decide upon this ances, which will be held on the<br />\n23, and New York University on Satnior Banquet to be held that night. Italy.<br />\nquestion.<br />\n(Continued on Page 4, Col. 4)<br />\n24 and 25 of April,<br />\nurday, April 18, in New York City.<br />\nAt the annual banquet of the<br />\nNEWS-LETTER<br />\nstaff, held last<br />\nThir d Annual Conference<br />\nnight at the Emerson Hotel, the<br />\nWill Be Held In Levering<br />\nfollowing men were elected to<br />\nHall, 10 A.M. to 11 P.M.<br />\nthe editorial board of the publicaEIGHT SPEAKERS ARE<br />\ntion:<br />\nON PROGRAM SATURDAY<br />\nEditor—Rowland Ness<br />\nManaging Editor—Sylvan LeUnemployment, Theme of Adbow.<br />\ndresses; Evening Session<br />\nWill Be Broadcast<br />\nAssistant Managing Editors—<br />\nH. L. Friedberg, H. Levin.<br />\nTomorrow more than 200 stuAssociate Editors—N. M. Hardents from colleges and universities<br />\nthroughout the country will con- ris, H. B. Yudkin.<br />\nvene in Levering Hall, at HomeElection for the business board<br />\nwood, for the Third Annual Interwas<br />\nindefinitely postponed.<br />\ncollegiate Liberal Conference to be<br />\nsponsored by the Johns Hopkins<br />\nUniversity Liberal Club. \"Unemployment\" will be the theme of tomorrow's conclave.<br /><br />\nSUMMER COURSES BEGIN<br />\nJUNE 23; END JULY 31<br /><br />\nBA ER, NOTED SURGEON,'STORMERS CHANGE PLAY<br />\nDIES FROM PARALYSIS FOR SPRING PRODUCTION<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br /><br />\n2<br /><br />\nHOPKINSIIEWSIETTER<br /><br />\nINTERCOLLEGIATE NEWS<br /><br />\nDILLY<br />\nDALLY<br /><br />\n•<br /><br />\nFOUNDED 1897<br /><br />\nA bill has been introduced in the<br />\nOn his recent trip through the<br />\nbehalf of the drought North Carolina State Legislature<br />\n$2.00 Southwest in<br />\nSubscription<br />\nstricken farmers, Will Rogers to prohibit the operation of campus or dormitory merchandise stores<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore, stopped for lunch with a fraternity<br />\n1879.<br />\n3,<br />\nlid., under the Act of Congress November<br />\nat Oklahoma State College. Will in the state institutions. It's going<br />\nhad previously requested bacon and to be a long trip for a candy bar<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nbeans, so the menu was a constant if it passes.<br />\nUniversity.<br />\nround of cornbread, beans and<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, bacon.<br />\nEnrroR;<br />\nIn order to assist Greek neophytes<br />\n* * *<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\npreparing for \"hell week\" the<br />\nin<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nOne Harvard senior aspires to<br />\nState College listed several<br />\nPenn<br />\nBelmont 8778 be a bear tamer and still another<br />\nTelephone<br />\nusual duties required and<br />\nthe<br />\nconsiders writing epic poetry as his of<br />\nsolution. Among them<br />\nthe<br />\nEDITORIAL DEPARTMENT<br />\nvocation. \"It's really a pleasure to gave<br />\nof the bolts of a<br />\ncounting<br />\nknow that other institutions are al- was the<br />\nEditor-in-Chief<br />\nnumber of mail<br />\nthe<br />\nso afflicted with would-be geniuses\" certain cannon,<br />\nROWLAND McD. NESS, '32<br />\nand the<br />\nbuilding,<br />\nis the comment of the Dickinson boxes in a college<br />\npenny.<br />\nCollege publication upon the situa- date on a hidden<br />\nManaging Editor<br />\n'32<br />\nLEBOW,<br />\nSYLVAN<br />\nNew York University and the<br />\ntion.<br />\n* * * *<br />\nCatholic University of Washington<br />\nAssistant Managing Editors<br />\ncarryhave established an air law acadA course in love making<br />\nHYMAN LEVIN, '34<br />\nHERBEWT L FRIEDBERG,'33<br />\nweek<br />\na<br />\ning a credit of five hours<br />\nemy, which will make possible the<br />\nEditors<br />\nat<br />\nAssociate<br />\nresearch and study of aeronautical<br />\nis now being offered to co-eds<br />\nNATHAN M. HARRIS, '32<br />\na<br />\nHAROLD B. YUDKIN,'32<br />\nand radio law.<br />\nRollins College. It is said that<br />\nJunior Editors<br />\ngreat many are signing up for the<br />\n* * *<br />\nJACK GREENFIELD, '33<br />\nMARION GROVE, '33<br />\ncourse in order to benefit from the<br />\n'34<br />\n,<br />\nKUSLOVITZ<br />\nHAROLD<br />\nSANFORD SARNEY, '34<br />\nAt Wheaton the freshmen used<br />\npractical instruction.<br />\nSAMUEL M. DOCTOFSKEY, '34<br />\nJEROME BLUM,'34<br />\na novel method of announcing class<br />\n*<br />\nNORMAN HEANEY, '34<br />\nSTANLEY STILLMAN, '33<br />\nelections. An \"emergency police\"<br />\nMORDECAI EDELMAN, '34<br />\nRAYMOND DUNN,'33<br />\nUniversity of South Carolina<br />\n'32<br />\nsquad rounded up five \"escaped<br />\nMARLOWE PERRY,<br />\nDONALD PROCTOR, '33<br />\nstudents may avoid chapel attend'33<br />\nVERLIN,<br />\nBERNARD<br />\nconvicts\" and led them to \"prison\"<br />\nHARRY GOODMAN, '33<br />\nance because the demand is unin Science Hall, where \"sentences\"<br />\nconstitutional according to advice<br />\nBUSINESS DEPARTMENT<br />\nwere pronounced on each new ofrecently given by prominent atBusiness Manager<br />\nficer. Just to make it more realistic,<br />\nGus BURK, '31<br />\ntorneys.<br />\nenthusiastic frosh ended the<br />\nthe<br />\n*<br />\n*<br />\n* *<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nwith a \"prison riot.'<br />\nceremony<br />\nP3i<br />\nMONT,<br />\nGEORGE W. LA<br />\nAccording to the Lehigh Brown<br />\nDAVID SYKES, '32<br />\n* * *<br />\nand White the dean of Hunter ColOffice Manager<br />\ncollege<br />\nmodern<br />\nthe<br />\nthat<br />\nclaims<br />\nlege<br />\n\"Canada spends $120,000,000<br />\nISADORE C. GUTMAN,'32<br />\nparties,<br />\nenough<br />\nto<br />\ngo<br />\ngirl<br />\ndoesn't<br />\nWILSON RUTHERFORD, '31<br />\nannually for education,\" according<br />\nCHARLES NEY, '33<br />\nand studies entirely too much. It's<br />\nABRAM Buitx, '34<br />\nto Dr. Walter F. Percival, director<br />\nSIMON Lin., '33<br />\na shame the dean only feels that<br />\nVICTOR FRENKIL, '34<br />\nWu. N. MYERS, '33<br />\nof Protestant education in the<br />\nway. For the benefit of the weaker<br />\nEDGAR BLUMSTF.IN, '34<br />\nMORTON Rolm, '33<br />\nprovince of Quebec, Canada.<br />\nDAVID Gun&amp; Art, '34<br />\nsex, we wish something could be<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN, '33<br />\ndone about it.<br />\nLEONARD HARRIS, '34<br />\n• * * *<br />\nGEORGE LANDAU, '34<br />\nJose R. Capablanca, 7 times naAve., Baltimore, Md. tional chess champion, enjoyed baseProduced by the R. L. Polk Printing Company, 1930 Clifton<br />\nball much more than chess, while<br />\nhe was a student in Columbia University. He was regular shortstop<br />\non the Varsity.<br />\n* * * *<br />\nStudents from India, Syria, Lithuania, Japan and France are enrolled in the University of Wichita<br />\nAU REVOIR<br />\nthis semester, according to Worth<br />\nthe<br />\nA. Fletcher, registrar..<br />\nODAY a new editorial board takes over the editorial reins of<br />\nNEWS-LETTER. The retiring editor and managing editor will soon<br />\n* * *<br />\nbe leaving our midst and it is with much regret that we bid them au<br />\nwish<br />\nIt will only cost England $600 for<br />\nrevoir. We recall pleasant days spent in good fellowship and<br />\nthem all the success in the world in whatever field of endeavor they ineach athlete she sends to the 1932<br />\ntend to cast their fortunes.<br />\nOlympic games at Los Angeles, owthe<br />\nWe sincerely feel that the NEWS-LETTER has progressed under<br />\ning to special rates offered by railpast administration, but realize that there is much room for improveediroad and steamship lines.<br />\nment. The student body may rest assured that the newly-elected<br />\n* * *<br />\ntors will do everything in their power to make the NEWS-LETTER an<br />\norgan which will reflect credit upon the Johns Hopkins.<br />\nA senior at Washington State<br />\nThe increase of interest in the NEWS-LETTER, as shown by the recent profusion of contributions to the MAIL BAG, is extremely encourhas<br />\nattended 14,050 classes in the<br />\nto<br />\naging. Without this interest the NEWS-LETTER would be unable<br />\nsixteen years without being abpast<br />\nlive up to its purpose, namely to reflect student opinion as well as to<br />\nor late once.<br />\nL.<br />\nsent<br />\nS.<br />\ntabulate campus events.<br />\n*<br /><br />\nE NOTE, with a great deal of amazement, the plan offered to<br /><br />\nWthe Johns Hopkins Athletic<br />\nBoard by the Athletic Board of St.<br />\nse measure to settle the question of a<br /><br />\nJohn's College, as a compromi<br />\nlacrosse game this year between the two institutions.<br />\nIn this suggested compromise four universities would be involved,<br />\nand their present lacrosse schedule revised to a certain degree. Princeton University, the University of Maryland, St. John's College and the<br />\nJohns Hopkins University would be required to make a shift of games<br />\nin their present schedules.<br />\nBy the new plan, St. John's would play Princeton on the date that<br />\nHopkins is now scheduled to meet the Tigers, namely May 1 and Hopkins in turn would be ,required to meet Princeton on May 23, the existing date of the Johns Hopkins-University of Maryland game.<br />\nFurthermore our game with the University of Maryland would have<br />\nto be put off until June 6th, a date after the closing of both of the<br />\nUniversities.<br />\nThe St. John's-Johns Hopkins fracas would cake place on May 2,<br />\nthe day following the St. John's-Princeton game.<br />\nIn our estimation, this suggested plan is preposterous and we feel<br />\nthat it would be a very unwise move for all those concerned to adhere to such a suggestion.<br />\nAll this controversy and wrangling could have been avoided if the<br />\nSt. John's College had shown any semblance of cooperation on her<br />\npart when the schedules were being made up.<br />\nAt that time, we offered St. John's these dates, namely the 18th and<br />\n25th of April and the 6th of June. In reply, the Crabtown powers that<br />\nbe, said that the two April dates were not satisfactory purely because<br />\nit was too early in the season to play Hopkins and that the 6th of June<br />\nwas out of the question because they would not be able to put a team<br />\non the field at that date.<br />\nIn return, they offered to us the 2nd of May as the only date that<br />\nthey could meet the Jay twelve. In reviewing the existing situation, the<br />\nHopkins authorities held that it would be unfair to both St. John's and<br />\nPrinceton to accept this date in view of the fact that the Princeton<br />\ngame had been scheduled many months before on Mriday, May 1st.<br />\nWe can see no reason why St. John's did not accept one of the dates<br />\nin April in the first place; but since both of those dates are no longer<br />\nopen and since the only possible date for the St. John's-Hopkins game<br />\nseems to be the 6th of June, we therefore sincerely hope that an agreement to that effect will will soon be reached by the two institutions.<br /><br />\nLow Evening<br />\nand Night Rates<br />\nEvening Rates<br />\nBetween 7 P.M. and<br />\n8:30 P. M.<br />\n15% to 20% lower<br />\nthan day rates<br /><br />\nNight Rates<br />\nBetween 8:30 P. M.<br />\nand 4:30 A. M.<br />\n40% to 50% lower<br />\nthan day rates<br /><br />\nTHE CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY .<br />\nOF BALTIMORE CITY<br /><br />\nraM.M1.1<br /><br />\ner=)<br />\n3r/rbUttiepd<br />\n31<br /><br />\n(ga AcgrffelE<br />\nelOthip(21...14atiViCiablV.A.4<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE... MARYLAND<br /><br />\nany a man is<br />\ndoingr work. day after<br />\nday that an electric<br />\nmotor can do for lessPii,<br />\nthan a cent an hour IS<br /><br />\nEDITORIALS<br /><br />\nFOOLISHNESS<br /><br />\nTHE tune of reluctance played on<br />\nthe ink well. The<br />\nResourceful Soul<br />\nanswers—call 'em<br />\nby Long Distance<br />\ntelephone and<br />\nhave a real<br />\nvisit.<br /><br />\n*<br /><br />\n*<br /><br />\n\"Objectionable material\" will be<br />\ndeleted from the 3,500 copies of the<br />\nFraternity Number of the Longhorn-Ranger before its distribution.<br />\n*<br /><br />\n*<br /><br />\nWI<br /><br />\n*<br /><br />\n\\r)<br />\nfoilm*<br /><br />\n) 1 a=7<br />\n___)l<br /><br />\nStudents in the School of journalism at Marqtrotte University, al-.<br />\nthough they spend the least time in<br />\noutside work, have the greatest average earning capacity as compared<br />\nto students in other departments.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nGreen caps will be seen no more<br />\nand sophomores will no longer torment their first year rivals at Ohio<br />\nUniversity by virtue of new laws<br />\npassed by the Junior-Senior Governing Board this week.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nParents representing forty nationalities sent their sons and daughters to the University of Wisconsin<br />\nin the fall of 1930.<br />\n* * * *<br />\nThe Interfraternity Council at<br />\nAlabama Polytechnic Institute has<br />\ndecided to send each prospective<br />\nfreshman, before he enters college,<br />\na booklet giving a brief history of<br />\nthe fraternities in the council, their<br />\nofficers, and the relative expense of<br />\nbelonging to them.<br /><br />\nCollege men and women recognize electricity as one of the principal aids to<br />\nprogress in the factory, on the farm, and<br />\nin the home.<br /><br />\nGuided by human intelligence,<br />\nelectricity can do almost any<br />\njob a man can do. From stirring<br />\nto grinding, from lifting to<br />\npulling, there is a G-E motor<br />\nspecially adapted to any task.<br /><br />\n210-60D11<br /><br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\n^ELECT IC<br /><br />\nCOMPANY.<br /><br />\nSCHENECTADY,<br /><br />\nNEW<br /><br />\nY<br /><br />\nOR1C•<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br />\nPhone: VErnon 1868<br />\n'What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING Co.<br />\nMoth Holes, Burns, Tears. Cuu and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\n1931-32 \"Y\" Cabinet Wrestling Practice<br />\nHeld Thrice Weekly<br />\nTo Be Installed<br /><br />\nBAER, NOTED SURGEON Women Win Collegiate International Relations<br />\nGood Sleep Contest Conference To Be Held<br />\nDIES<br />\nFROM<br />\nPARALYSIS<br />\nAt Carleton April 17-18<br />\nTuesdays,<br /><br />\nJack Hart, University of Pennsyl- Spring Practice In Barn<br />\nThursdays, Fridays; New Candivania Chaplain, Slated To<br />\ndates For Team Are Desired<br />\nSpeak<br /><br />\nHamilton, N. Y.(NSFA)—Girls<br />\nOrthopedist Succumbs Tues. are far better<br />\nsleepers than men, acMorning;<br />\nOn<br />\nFaculty<br />\nNorthfield, Minn. (NSFA)—<br />\nInstallation of next year's Y. M. Saul Jacobson, manager of the<br />\ncording to Dr. Donald Laird, \"ex30 Years<br />\nC. A. cabinet will take place at the team, yesterday announced that the<br />\npert\" on the subject of sleep and Nineteen midwest colleges and unithird annual Student Movement wrestling squad will hold spring<br />\nprofessor of psychology at Colgate versities will be represented at a<br />\n(Continued from Page 1, Col. 4)<br />\ntwo-day regional international relaDinner next Tuesday in Levering practice for those men not candiJ. H. FURST CO.<br />\nwas made more famous by his con- University, where a recent sleep tions conference to be held at CarleHall.<br />\ndates for any spring sport, and that clusion, the<br />\nPRINTERS OF<br />\nresult of service in survey was held.<br />\nton College, April 17 and 18, under<br />\nThe dinner will begin at 6.30 p. new men would be welcomed. Prac- France<br />\nPhilological and Scientific<br />\nAn intercollegiate good sleep con- the auspices of the International<br />\nas the chief orthopedic conHall,<br />\nEdwin<br />\nwith<br />\nGreat<br />\nthe<br />\nm.<br />\nin<br />\ntice<br />\nis<br />\nheld<br />\non<br />\nTuesday,<br />\nThursday<br />\nPublications<br />\nsultant of the A. E. F., that the test was held between the men at Relations Club of that college.<br />\nLockard presiding. The new officers and Friday of each week in the grub of the blue-bottle<br />\n12-20 Hopkins Place, Baltimore<br />\nfly will clear Colgate and the women at SkidSubjects will pertain to American<br />\nwill be presented by the old presi- Barn at four o'clock.<br />\nup deep-seated infections of the more College.<br />\npolicy towards Russia, the present<br />\ndent, Jack Mount. The new presiDue to the scarcity of collegiate bone which defy all other methods<br />\nResulting figures showed that status of India, and the tariff quesdent, Walter Glass, will then pre- wrestling teams in the vicinity, it of treatment. For two years he ex- girls have<br />\nless trouble going to tion in the international situation.<br />\nService<br />\nGive<br />\nDrugs<br />\nand<br />\nWe Sell<br />\nsent the rest of the new cabinet, was stated, trips planned for next perimented with the theory. Not<br />\nsleep, wake up fewer times during An outside speaker who is an auRobert<br />\nbe<br />\nby<br />\nwill<br />\ninstalled<br />\nwhich<br />\nyear will be outside the state. For until he had proved its worth sev- the night, are less restless, and<br />\nCall us up Belmont 5318, 5846<br />\nhave thority in his line will be secured<br />\nL. Ball, who was president- of the this reason the number of meets eral times did this frank, straightfewer dreams.<br />\nPeabody Pharmacy<br />\nto give the introductory explana\"Y\" in 1926-27.<br />\nwill be lessened, and about six con- forward Hopkins surgeon reveal<br />\nIn addition, fewer girls have to tion for each topic.<br />\nCalvert and 30th Streets<br />\nJack Hart of the University of tests are planned. The schedule for his discoveries in a paper which he<br />\nPennsylvania will deliver the ad- next year is now being compiled, read at a meeting of the Interstate be called twice in the morning and<br />\nDr. Keith Clark, chairman of the<br />\ndress of the evening. Parents of the and will be made public at an early Medical Association, held in De- in general feel more peppy and less department of history at Carleton,<br />\ngrouchy and are less foggy mental- is the faculty advisor of the stucabinet members and other inter- date.<br />\ntroit. Physicians are said to have ly in the morning.<br />\nested persons have been invited to<br />\nAccording to present plans, there been cynical in regard to his new<br />\ndent committee in charge of all arProf. Laird attributes this to the mittee, three round table discussions<br />\nattend.<br />\nwill be a junior varsity squad for conclusion.<br />\nthe training of men unable to make<br />\nMay, 1917, Dr. Baer was the first theory that members of the fem- rangements. According to this cornfirst<br />\nthe<br />\nteam.<br />\nwill<br />\nThis<br />\nsquad<br />\nof a group of distinguished Balti- inine sex are neither as active phy- will be held during the conference.<br />\nDon Proctor Sings<br />\nwrestle with several scholastic more surgeons to leave for the sically or mentally as men.<br />\nThese meetings wlil be brought to<br />\nAt Midday Musicale teams of Maryland.<br />\n\"Only four hours may be suffi- a close by a dinner on Saturday<br />\nfront. He remained in France in<br />\ncient to recuperate physically,\" he night, April 18. At that time, Count<br />\nactive service until 1919.<br />\n'Selections Rendered By Baritone<br />\nFounded Children's Hospital<br />\nmaintains, \"but mentally may need Carlo Sforza, formerly minister of<br />\nSoloist Received Favorably By<br />\nJay<br />\nTracksters<br />\nMeet<br />\nAs a surgeon of wide repute he eight hours more to be completely foreign affairs in Italy, will give the<br />\nAudience<br />\nAND<br />\nprincipal address.<br />\nDonald Proctor, baritone, pre- Gettysburg Tomorrow was especially famous for his work rested.\"<br />\nsamong children. Through his efsented a varied program of vocal<br />\nselections at the weekly informal Conditioning Made Difficult Due To forts the Children's Hospital school,<br />\nTHE<br />\nGreen Spring Avenue and 41st<br />\nInclemency of Weather, Claims<br />\nmidday musicale held in Levering<br />\nStreet, was founded. Dr. Baer was<br />\nCoach Hambleton<br />\nHall last Tuesday. Proctor is a<br />\nthe<br />\nchief physician here.<br />\nsophomore in the College of Arts<br />\nThe<br />\nsurgeon was a member of<br />\nhere.<br />\ntrackSciences<br />\nand<br />\nTomorrow, the Blue Jay<br />\nthe<br />\nUniversity<br />\nClub as well as other<br />\nCarrie Jacobs Bond's 'Just A- sters journey to Gettysburg Colorganizations.<br />\nby<br />\nDear,\"<br />\n\"My<br />\nYou,\"<br />\nWearyin' for<br />\nlege, to open their 1930 season.<br />\nFuneral services were held at the<br />\nErnest R. Ball, and \"Love Is A<br />\nMt.<br />\nVernon Place M. E. Church<br />\nstrength<br />\nof<br />\nLittle<br />\nis<br />\nof<br />\nthe<br />\nknown<br />\nSanderson,<br />\nWilfred<br />\nBurden,\" by<br />\nyesterday at 3.30 p. m.<br />\nwere included in the program of se- the Pennsylvanians for they WO,<br />\nEight Active Pall-Bearers<br />\nOPPOSITE<br />\nlections presented most enjoyably are just opening their season: A<br />\nEight<br />\nactive pall-bearers were<br />\nPENNA.RR.STATION by Proctor. \"At Dawning,\" a fa- number of lettermen have been lost chosen from<br />\northopedic surgeons,<br />\nvorite by Charles Wakefield Cad- to the team that<br />\ntied Hopkins last all of whom received their special<br />\nKarl<br />\nby<br />\nNight,\"<br />\nmon, \"Calm as the<br />\nBohn, \"Chanson D'un Coeur year in a dual Meet, but additional training under Dr. Baer. Honorary<br />\nBrise,\" by Moya, and the well men from the ranks of last year's .pall-bearers, numbering seventy, inff.OTHES<br />\nknown \"Mandalay,\" by Oley frosh are being molded into a team cluded the names of some of the<br />\nSpeakes, completed the program. around nucleus of the few . re- country's most eminent medical<br />\nmen and close associates in the U.<br />\n211-213 E. Baltimore St.<br />\n• Mr. Proctor was especially lauded maining veterans.<br />\nArtily, including Gen. J. J.<br />\nS.<br />\nfor his remarkable ability to retain<br />\nHopkins has been equally ; hard Pershing.<br />\nhis volume and excellent tone quality throughout the performance. hit. With ate graduation of .such<br />\n\"Mandalay,\" the finale, especially Men as Stafford .and Hershey, the<br />\nserved to bring out his abilities in squad Was left destitute of experithis respect.<br />\nenced hurdle men. The loss of CapThe audience very enthusiastically tain Sheidt will be felt in the hurreceived all of the presentations, dle and pole-vault, while the work<br />\nespecially the finale.<br />\nof.13ob' Kelly in the distances will<br />\nRichard M. Tillman accompanied ..be .keenly missed.<br />\nProctor on the piano.<br />\n-.it is with some misgiving that<br />\nCoach Hambleton takes his men to<br />\nW. H. Wilmer Named Gettysburg, for the inclement<br />\nand unexpected holiday has<br />\nTo Editorial Hoard weather<br />\nMade conditioning almost impossiJ. II. U. Ophthalmologist Chosen On ble. The return of \"Bill\" Dorman<br />\nand Hughes Caldwell has bolstered<br />\nBoard of Sight-Saving<br />\nReview<br />\nthe field strength materially. In the<br />\nDr. William H. Wilmer, director dashes, the Jays appear to be exA pre-eminent Hotel of 1200<br />\nof the Wilmer Ophthalmological ceptionally strong. Captain LockRooms, each having Bath, Institute of the Johns Hopkins Uni- ard, Chassin, Wilfson, Linck, and<br />\nSe r vidor, Circulating Ice versity, was named one of the mem- 'Reynolds and Frenkil, freshmen,<br />\nbers of the editorial board of the will .carry the burden of all the<br />\nWater and many other inno- Sight-Saving Review, a quarterly sprints including the '440!<br />\nvations...featuring a sincere journal sponsored by the National Coach Hambleton is taking a•<br />\n*11.711-10<br />\n:<br />\n1<br />\n7<br />\nSociety, for the Prevention of large squad to the meet and doubtspirit of hospitality.<br />\nBlindness.<br />\nless every man will see action, as<br />\n-1<br />\n4<br />\ni<br />\n• According to Science Serviee, the the coach wishes to see how his men<br />\npurpose of the magazine is to pro- behave 'under fire.'<br />\n'ROOM AND BATH $3UP vide an additional weapon with Among the promising new matewhich to fight blindness.<br />\nrial are 'Don' Bittinger, who recently won the handicap meet held at<br />\nthe field, 'Pete' Reynolds, whose<br />\n,feats on the football field are to be<br />\nOPERATE IT YOURSELF<br />\nRENT A CAR<br />\nremembered, and 'Vic' Frenkil, who<br />\ncaptained the Forest Park cinder<br />\nartists last year.<br />\nThe Jays are unfortunate this<br />\nyear in that all but one of their<br />\nmeets will be run on alien tracks;<br />\nCars for Hopkins Students<br />\nthere<br />\nare both a physical and pschoDeposit Not Required<br />\nlogical handicap attached to such<br />\n111 W.NORTH AVE.<br />\n.conditions.<br />\n2125 HARFORD AVE.<br /><br />\npELCOME<br />\nTo<br />\nNEWYORK<br /><br />\n_MOTEL<br />\n(41VERNOIA<br /><br />\nYou just can't help<br />\nlooking well-dressed<br />\nin Katz Clothes<br /><br />\ngINTON<br />\n51s2ST.`0162711YAVE,<br /><br />\nAYBE YOU'RE PAYING TOO<br />\nMUCH FOR GAS BECAUSE<br />\nYOU'RE PAYING TOO LITTLE<br />\n7<br /><br />\nAMOCO-GAS<br /><br />\nThe Auto Rental Company<br /><br />\nPhone, Wolfe 1413<br /><br />\nGIVES MORE<br />\nPER<br /><br />\nNumber of Foreign<br />\nStudents Increased<br />\nChinese And Canadians Lead In 10<br />\nPer Cent Increase Of Foreign<br />\nStudents In America<br /><br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br /><br />\nNew York, N. Y.—In 1929-30<br />\nmore than 10,000 foreign students<br />\nwere registered in some 450 American institutions of higher learning.<br />\nThis is an increase of 10% or more<br />\nover the preceding year.<br />\nThe Chinese and Canadians lead<br />\nthe list of Foreign students with<br />\n1,294 and 1,263 respectively, according to the Committee on Friendly Relations among Foreign Students, and the Japanese with 987,<br />\nthe Philippinos with 887, the Russians with 538, the Germans with<br />\n397, the English with 365, the Mexicans with 315 follow in order.<br />\n(N.S.F.A.)<br />\nTHANK YOU:<br />\nThe cut of George W. Russell<br />\n(A.E.) which appeared in the last<br />\nissue of the NEWS-LETTER was<br />\nlent through the courtesy of the<br />\nBaltimore Post. The NEWS-LETTER at this time acknowledges the<br />\nfavor.<br /><br />\nMILES<br />\nGALLON— — -REDUCES<br />\nOPERATING<br />\nEXPENSES — —<br /><br />\nHad<br />\nghe AMERICAN OIL COMPANY<br />\nAffiliated with Pan American Petroleum &amp; Transport Compaq<br />\n_General Offices: Baltimore, bid.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 10, 1931<br /><br />\n4<br /><br />\nObstetrician<br />\nCENTRAL 'Y' BOARD Hopkins<br />\nFavors Anesthesia<br />\nIn Child-Delivery<br />\nPROPOSES SECOND<br />\nCONFERENCE, SAID<br /><br />\nHopkins Frosh, City<br />\nMeet Today In<br />\nAnnual Debate<br /><br />\nJ. W. Williams Advocates Move To<br />\nMake Child-Birth Painless<br />\nBy Use Of Opiates<br /><br />\nIn answer to the query \"Should<br />\nWhether Schaal Is To Be Rechildbirth be made painless?\", made<br />\ntained Or Dismissed, Not<br />\nby Science Service of four obstetYet Ascertained<br />\nrics authorities, Dr. J. Whitridge<br />\nWilliams, obstetrician-in-chief at<br />\nTWO BOARDS WILL MEET the Hopkins Hospital, and professor<br />\nTO DISCUSS ISSUE of obstetrics at the J. H. U. Medical<br />\nSchool, declared he favored the use<br />\nHas Been Agreed That Hop- of anesthetics in child-delivery.<br />\nDr. Williams advises nitrous oxkins, Central Groups Each<br />\nide gas with oxygen during the secNominate Levering<br />\nond stage in all normal labors. In<br />\nSecretary<br />\naddition, a small amount of heroin<br />\nis given by hypodermic and the paWhether E. A. Schaal, secretary tient is kept in a quiet, semi-darkof the Johns Hopkins branch of the ened room.<br />\nFor home practice, however, he<br />\nY. M. C. A., will be reappointed to<br />\nthe position he now holds at Home- recommends chloroform. Administration of nitrous oxide requires a<br />\nwood has not been ascertained yet, trained anesthetist, he explained; the<br />\nit was learned after the meeting of apparatus is bulky and difficult to<br />\nthe Metropolitan Board of the transport and the gas is expensive.<br />\ndowntown branch late Wednesday. With either type the anesthetic is<br />\ngiven during the second stage, a few<br />\nAdvise Second Confab<br />\nThe group at the Central \"Y,\" whiffs at the beginning of each pain,<br />\nheaded by James C. Martine, it was Dr. Williams said. At the end of<br />\nannounced by Carlton Harrison, this stage, as the baby's head is born,<br />\nsecretary, proposed that a second the patient is made completely unconference be held of full repre- conscious by increasing the amount<br />\nsentation of both the Metropolitan of the anesthetic.<br />\nBoard and the Board of Managers, The use of anesthesia in obstetof the Hopkins, for further discus- rics is now being widely discussed<br />\nsion of the Schaal matter. They by the public and is still the subhave not decided on the retainment ject of disagreement in medical<br />\nor dismissal of Mr. Schaal, but will circles.<br />\ndefinitely decide following the interboard conference.<br />\nThis move places the controversy<br />\nin balance. It is indicated, however,<br />\nthat a decision must be reached<br />\nsoon for the ultimate good of both<br />\nthe Central and Hopkins groups.<br /><br />\nTeams representing the Johns<br />\nHopkins freshmen and the Baltimore City College debate today<br />\non Resolved, That the United<br />\nStates Join the League of Nations.<br />\nIn this forensic clash, to be<br />\nstaged at 3 p. m. at the high<br />\nschool, 33rd street at the Alameda, the Hopkins debaters will<br />\nuphold the affirmative to the<br />\nquestion and will be represented<br />\nby Saul Dorfman, S. M. Doctofsky, and Charles Stern.<br />\nHerbert Rosenbaum is first<br />\nspeaker for City College; Eric<br />\nGoldman, second; Louis Kraus,<br />\nrebuttal.<br />\nThe Homewood frosh last year<br />\nwere defeated by the City Col-<br /><br />\nHABIT TRAINING DISCUSSED<br />\nDr. Esther L. Richardson, of Hopkins<br />\nHospital, Addresses Club,<br />\nTuesday<br /><br />\nBefore the Govans Improvement<br />\nClub Tuesday at 2.30 p. m., in the<br />\nGovans Branch of the Enoch Pratt<br />\nLibrary, Dr. Esther L. Richardson,<br />\nassistant professor of psychiatry at<br />\nthe Hopkins, spoke on \"Habit<br />\nTraining In Children.\"<br /><br />\nSp ring Showing<br /><br />\nILG ER9S<br />\ncANDWICI-1<br />\nefilOPS<br /><br />\nClaims That An Inner Force, Manifested In Dreams, Often Shows<br />\nExtraordinary Creative Genius<br />\n(Continued front Page 1, Col. 3)<br /><br />\nmental, or possibly spiritual anguish, he finally formulates alibis<br />\nwhich should satisfy God, and resumes his flight. But doubt enters<br />\ninto his mind. Is that God of whom<br />\nhe has heard the real God? Smith<br />\nstops his travels again to fix an<br />\nalibi that would satisfy any God,<br />\nand then, peaceful and confident at<br />\nlast, goes on. Finally he reaches the<br />\ngates of heaven, God, he finds, was<br />\na gigantic Smith, in whose image<br />\nhe had been created. That was the<br />\nonly God that he could not deceive.<br />\nDiscusses Dreams<br /><br />\nAdvancing the theory that there<br />\ninner force in man that manian<br />\nis<br />\nfests itself in the dream state,<br />\nGeorge W. Russell yesterday addressed a crowd that overtaxed the<br />\ncapacity of Latrobe Hall's assembly<br />\nroom. This force, he claimed, often showed a creative genius that<br />\nby far trancended that shown in<br />\nthe soul in its waking state.<br />\nThe mystic ascribed several of<br />\nhis poems and several paintings to<br />\nvisions seen in his dreams. He cited<br />\none instance in which he had a vision of a painting in a dream every<br />\nstroke of which seemed perfectly<br />\nclear and separated from every<br />\nother one. On the following morning, it was stated, he painted the<br />\npicture and signed it \"AE.\"<br /><br />\nNot only excellent food, but the choice<br />\nmeeting place of the better class of people<br />\n2<br /><br />\n\"GOOD THINGS TO EAT\"<br />\nUP-TOWN SHOP<br /><br />\nDOWN-TOWN SHOP<br /><br />\nNorth &amp; Charles<br /><br />\nCalvert &amp; Fayette<br />\nOPEN ALL NIGHT<br /><br />\nSAMUEL KIRK &amp; SON, Inc.<br />\nJewelers—Stationers—Silversmiths<br />\n421 North Charles Street<br />\nBaltimore, Md.<br />\nWRIST WATCHES FOR MEN<br />\nGIFTS IN SILVERWARE<br />\nFINE STATIONERY<br />\nFounded 1815<br /><br />\nNEW<br /><br />\nUSED<br /><br />\nFORD<br />\nAutomobiles<br /><br />\nPresents Own Explanation<br /><br />\nInitial Conference Held<br /><br />\nThe first confab of representatives of the two boards was called<br />\nby Dr. Joseph S. Ames, president<br />\nof the University, about a month<br />\nago in an effort to clear up the misunderstandings which had arisen regarding the scope of authority by<br />\nboth bodies in the selection of the<br />\nsecretary for the campus \"Y\"<br />\nbranch. John K. Mount, Jr., recording secretary of the Board of Managers at Homewood, had forwarded<br />\nthe motion passed by the Levering<br />\nHall group to Dr. Ames.<br /><br />\nGeorge Wm. Russell,<br />\nNoted Irish Poet,<br />\nConsiders Dreams<br /><br />\nMANHATTAN SHIRTS—SCOTCH SPUN<br />\nNECKWEAR—INTERWOVEN HOSE<br /><br />\nIn attempting to explode the<br />\npresent theories concerning dreams,<br />\nthe poet averred that neither the<br />\ntheory of the recombination of<br />\nmemories or of their recurrence offered adequate explanation of the<br />\nphenomena. Tis own idea, that of<br />\na creative genius of sleep, offers a<br />\na more logical and more satisfying<br />\nthesis.<br /><br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br /><br />\n41,1rs<br />\n_<br /><br />\nMcPherson's<br /><br />\nmoursownsnvine<br />\nMg!<br /><br />\nAmes Gets Motion<br /><br />\nThe communication read, in part:<br />\nA motion was adopted at the last<br />\nmeeting of the board of managers<br />\nof the Johns Hopkins Y. M. C. A.<br />\nstating that in view of the fact that<br />\nmisunderstandings have arisen regarding the scope of the Metropolitan Board and the Johns Hopkins<br />\nY. M. C. A., the president of the<br />\nUniversity be requested to arrange<br />\na conference between representatives of these boards.<br /><br />\n11 East Baltimore Street<br /><br />\nFriends of the secretary persuaded the Central \"Y\" group to<br />\npermit Mr. Schaal to continue in<br />\nhis capacity until the culmination of<br />\nthe present academic year.<br /><br />\nEngraving<br /><br />\nJEWELER AND OPTICIAN<br />\n3222 Greenmount Avenue<br />\n5409 Harford Avenue<br />\nNearest Jeweler to the Campus<br /><br />\nence at an early date, to regularize<br />\nthe rather indefinite situation which<br />\nnow exists as to the relations between the University, the Y. M. C.<br />\nA. of Hopkins and the Y. M. C. A.<br />\nof Baltimore. In my judgment,<br />\nwhatever agreement is reached will<br />\nhave a bearing only upon the future<br />\nand will go into effect in the next<br />\nacademic year.<br /><br />\nMetropolitan Board Persuaded<br /><br />\nKIBLER'S<br /><br />\nRepairing<br /><br />\nThe president, in answer to this,<br />\nhad declared:<br />\nI am prepared to call this confer-<br /><br />\nMutual Agreement Reached<br />\nAt the initial conclave it was<br />\nmutually agreed that each board<br />\nwas to have the privilege of nominating whomever they desire for<br />\nthe Levering Hall position. Nominations are to be forwarded to Dr.<br />\nAmes for consideration. The University president is to select the<br />\nman whom he believes should be<br />\nappointed. His selection is to be<br />\nfinal.<br />\nMr. Schaal was asked to resign<br />\nlast July by the Metropolitan Board<br />\nbut refused to, declaring he would<br />\ndo so to the Homewood Board of<br />\nManagers only.<br /><br />\n\"The Store of Standard Value\"<br /><br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nv‘irv<br /><br />\nSometimes the cart<br />\nshould be put<br />\nbefore the horse<br /><br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\nHere's a case where a warehouse was built around a conveyor, instead<br /><br />\n•WV<br /><br />\n\"Food Prepared the Right Way\"<br />\nof the conveyor being squeezed into the warehouse...Western Electric<br /><br />\nWhen in Aretv York dine at<br /><br />\nSt. Regis Restaurants<br />\nLocated<br /><br />\nwanted a new warehouse for telephone equipment. For the most effi-<br /><br />\ncient handling of material,its own distribution engineers designed a system ofconveyors<br /><br />\nat<br /><br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd Sc.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br /><br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br /><br />\nPackages can be<br />\nswitched onto sidings— by one central dispatcher<br /><br />\neven before architectural details of the building were worked out ... This was done<br /><br />\nafter careful estimate had been made of volume and kinds of material to be stored<br /><br />\nand handled ...There are many other assignments that challenge re-<br /><br />\nThom Cup Contest<br />\nBooked For Next Month<br />\nTryouts Will Be Held During Next<br />\nTwo Weeks To Determine Final<br />\nContestants<br /><br />\nIn accordance with the annual<br />\ncustom, the Thom cup will be<br />\nawarded to the winner of the Extemporaneous public speaking contest to be held early in May in Levering Hall. The cup is offered by<br />\nMrs. H. R. M. Thom, prominent<br />\nin Baltimore society, in memory of<br />\nHunt Reynolds Mayo Thom, and is<br />\nnow on display in the main library.<br />\nTryouts will be held in the public<br />\nspeaking classes during the next<br />\ntwo weeks, in order to determine<br />\nupon the final contestants.<br /><br />\nMILESTONE SYSTEM<br /><br />\nsourcefulness and imagination in making telephones and equipment<br /><br />\nNo Deposit Required of Hopkins Students<br /><br />\nfor the Bell System—purchasing its supplies—acting as its distributor.<br /><br />\nDRIVE IT YOURSELF<br /><br />\nBuick@<br />\nFords<br />\nChryslers<br />\nHupmobtles<br />\nChevrolets<br /><br />\nCoupes<br />\nRoadsters<br />\nSedans<br /><br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br /><br />\nPLaza<br /><br />\n6000<br /><br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br /><br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nSpeed needed!<br />\nThe emergency<br />\nis met by the<br />\nnew warehouse<br /><br />\nWestern Electric<br />\nManufacturers...Purchasers...Distributors<br />\n5P THE BELL SYSTEM<br />\nSINCE 1182 FOR il<br /><br />"}], "field_media_file": [{"target_id": 38614, "display": null, "description": null, "target_type": "file", "target_uuid": "802c1c36-8d73-4318-8ba5-eac72260ecf2", "url": "http://digital.library.jhu.edu/system/files/2022-03/12251-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12251, "target_type": "node", "target_uuid": "50f03977-a411-4836-ad24-77078848a4f4", "url": "/node/12251"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3173d333-882e-4cbd-8390-045a33d88861"}]}