{"mid": [{"value": 36691}], "uuid": [{"value": "574a9cf7-34e1-4b27-b91d-cbf0001a5996"}], "vid": [{"value": 36691}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12980-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "/-1<br />\n<br />\nr4<br />\n,74<br />\n40<br />\n<br />\nVOL. XXVI. No. 26<br />\n<br />\n10/j °<br />\n<br />\nro,<br />\n<br />\n'<br />\ns<br />\n<br />\nA<br />\n<br />\nt<br />\n<br />\n-<br />\n<br />\nP<br />\n<br />\n1<br />\n, - A ./<br />\n<br />\ndmj<br />\n<br />\n,<br />\nrYtz7<br />\n<br />\nBALTIMORE, MD., JANUARY 26, 1922<br />\n<br />\nMARYLAND STATE TO BE WOODROW WILSON EULO- PUBLICITY BOARD BECOMES GOLD FOOTBALLS AND VARGIZED BY RABBI WISE<br />\nMET ON DIAMOND<br />\nSITY SEALS AWARDED<br />\nRECOGNIZED ACTIVITY<br />\n<br />\nPRICE 5 CENTS<br />\nTANKMEN LOSE TO QUAKERS BY CLOSE SCORE<br />\n<br />\nGame a Result of Recent Settlement of New York Rabbi Declares Achievements To B-gin Spreadirg Propaganda Week Twelve Football Players and Eight Non- Hambleton Breaks Record in Plunge,<br />\nDifficulties. William and Mary Also<br />\nAthletic Workers Rewarded<br />\nof Former President Will Go Down<br />\nAfter Exams. Call for Candidates<br />\nDoing 61 Feet. Result Hinges on<br />\nAdded to Schedule.<br />\nin History.<br />\nat Assembly.<br />\nto Be Issued.<br />\n100-Yard Dash.<br />\n<br />\nke,<br />\nme<br />\n<br />\nisnd<br />\nSs.<br />\n<br />\n20M.<br />\n<br />\npt<br />\n<br />\nr7-<br />\n<br />\nier<br />\n<br />\nial<br />\n<br />\ner<br />\nnd<br />\ner<br />\n<br />\nr.<br />\n<br />\nne-<br />\n<br />\nin<br />\n<br />\n)r.<br />\n<br />\n0.<br />\n<br />\nP.<br />\n<br />\n0.<br />\n<br />\nSr..<br />\n<br />\nd..<br />\n<br />\np.,<br />\n<br />\n0.<br />\ny.<br />\n<br />\n7--<br />\n<br />\nJohns Hopkins and Maryland<br />\nThe Assembly on Thursday last<br />\nThe Johns Hopkins Publicity<br />\nIn one of the most thrilling<br />\nThe championship gold footwill meet on the baseball diamond was addressed by Dr. Stephen Wise. Board because a recognized activity footballs were awarded at last meets ever held in the Swarthmore<br />\nthis year. Arrangements for the one of America's leading publicists on Monday, January 16, when the<br />\npool, the Hopkins swimming team<br />\nweek's assembly to the following<br />\ngame have just been completed and a rabbi of some note. He has Student Council passed favorably<br />\nwas nosed out in their first meet<br />\nby Alanager Huey as a result of rendered valuable service to the na- upon its constitution. The Coun- members of the season's team: of the season by a 32-30 score.<br />\nthe recent amicable adjustment of tion, especially during the recent cil heartily indorsed the aims of the W. G. Totterdale (captain), F. E. From the relay, the first event on<br />\ndifficulties by the presidents of war, when he served on commis- Board as set forth in the consti- Calkins, J. U. Markell, A. H. the program, until the 100-yard<br />\nthe two Universities, Drs. Good- sions in England and France. Rab- tution and offered to assist in its Knecht, T. M. Landy, S. A. Mid- dash, which ended the match, the<br />\nnow and Wood. As soon as ath- bi Wise has always been an ardent financing, provided some arrange- dleton, F. Rich, J. I. Bonner, G. L. outcome was always in doubt, and<br />\nletic relations were resumed follower of the ideals of former ments were made to include the<br />\nDarley, G. L. Westerman, T. P. it was the latter event that gave<br />\nDr. Ray Van Orman advised President Wilson, and he is now de- non-athletic activities of the Unithe Garnet their hard-earned vicMcGill and H. P. Brawner (manManager Huey to propose a date voting a part of his time to the fur- versity in the propaganda released<br />\ntory. Prior to this swim, the score<br />\nager).<br />\nfor a baseball game to the Mary- therance of those ideals. \"Wood- for publication.<br />\nwas 27-26 with the Black and Blue<br />\nThese<br />\nmen<br />\nwere<br />\nthus<br />\nhonored<br />\nland authorities. This he did and row Wilson and the Woodrow Wilon<br />\nthe long end, and Hopkins needThe Board consists of an editorMay 6 is the date that has been son Fund\" was the theme of the in-chief, a state editor, an out-of- by the student body for the record ed a first to win or a second and<br />\nagreed upon.<br />\nrabbi's address.<br />\nstate editor, a collegiate editor, a which they made for Hopkins third to tie. Manager Rowland deAt the last meeting of the two \"Woodrow Wilson deserves the photographic editor, a clippings ed- this season, securing the state cided to pin his hopes on Morrell<br />\nand Hambleton in this event.<br />\nteams, in the spring of 1920, Mary- foundation being established for itor, and assistant editors. The aschampionship as well as defeating<br />\nSwarthmore was represented by<br />\nland State was victorious. No bat- the promotion of his ideals, and sistant editors will be elected from<br />\na<br />\nnumber<br />\nof<br />\nprominent<br />\noutside<br />\n\"Charlie\"<br />\nCrownover,<br />\ntle was staged last year on ac- A merica needs such a foundation,\" the most promisinz candidates for<br />\nMiddle<br />\nteams.<br />\nStates champion, and it looked as<br />\ncount of the rupture caused by the said Rabbi Wise, who declared that the positions.<br />\nEight men who were voted their<br />\ndisagreement over the football Wilson's name will ring loud and<br />\nThe Board, appcinted to hold of- Varsity Seals this year were if he would capture the race by a<br />\nlarge margin.<br />\nHe was hard<br />\ngame. This year, however, the clear in the annals of American his- fice until March, 1923, is composed<br />\nawarded them by H: Douglas Cot- pressed throughout, however, by<br />\nchances for a Black and -Blue vic- tory, when the letters and docu- of the following men: Editor-intory are very bright and revenge ments that are not generally known chief, W. H. Moore, Jr.; out-of- ton, president of the Varsity Seal Morrell, and they rounded the last<br />\nfor the defeat of two years ago will today shall be thrown to the press. state editor, Pat.:1 W. Bodman ; Voting Council. Those receiving turn swimming neck and neck, the<br />\nbe sweet after waiting so long for In singing the praises of Wilson state editor, Savington W.Cromp- the seals were: Lawrence B. Fen- Swarthmore star finally touching<br />\nthe opportunity. Maryland has its and his ideals, the speaker declared ton; collegiate editor, T. C. Rout- neman, editor-in-chief; Paul Ives, the finish a fraction of a second bemanaging editor; H. Douglas fore his opponent. Hambleton,<br />\nusual strong team, but Hopkins' that he was not disparaging the son; photographic editor, RanCotton,<br />\nbusiness manager; Joseph too, was barely nosed out for third<br />\nProspects are the best in several works of other great American dolph Norwood.,These men were<br />\nA. Moran, literary editor, and place.<br />\nYears.<br />\nmen, such as Washington, Lincoln selected by virtue of their fitness Quentin Singewald, advertising<br />\nThe plunging of Waldo HambleThe schedule for April and and Roosevelt.<br />\nand because they are not too over- manager, all of the Black and Blue<br />\nwas the feature of the evening.<br />\nton<br />\nMay has received another attracWoodrow Wilson was, in the es- burdened with other activities to Jay; Emil Smith, for special merit He easily won the plunge for distion in the addition of a game with<br />\nas leader of the orchestra; Wil- tance, traversing 61 feet and breaktimation of Dr. Wise, more like do justice to their new duties.<br />\nWilliam and Mary College. The<br />\nThe<br />\nplans<br />\nand<br />\nof<br />\npurposes<br />\nthe<br />\nliam<br />\nH. Moore, Jr., managing edi- ing the Hopkins record, which was<br />\nI incoln than any other man has<br />\nlittle Virginia college gained naBoard<br />\nhave<br />\nmet<br />\nenthusiastic<br />\nthe<br />\naptor<br />\nof<br />\nthe News-Letter, and Mar- 59.6. He also captured a first<br />\never been. \"Lincoln stepped from<br />\ntion-wide notice last year by deproval<br />\nof<br />\nevery<br />\norganization<br />\non<br />\nthe iano Badillo, for his exceedingly place in the back stroke, finishing<br />\nthe inaugural stand to the battlefeating the University of Ii.ansj l-field of America and after a most campus. Ma2y of Mein iiave even praiseworthy efforcs as stage man- ahead of Lora, a Medical School<br />\nvania's crack nine. As a result its<br />\nadmirable career of piloting the passed resolutions to assist in every ager of the Dramatic Club. He not man.<br />\nProgress on its Northern trip will<br />\nperturbed ship of state through the way possible. Every individual only painted the scenery, but suCrownover, who also won the<br />\nbe closely watched this year.<br />\ndarkness of war to the dawn of who has beeil questioned has also pervised all the stage settings, a 50 and the 100, pulled the unexThe schedule as arranged thus peace, he was shot down by a expressed the opinion that the Pub- task of no small difficulty.<br />\npected when he defeated Pearce<br />\nfar:<br />\nraving madman. Wilson's career licity Board will become a great<br />\nThe Varsity Seal is the highest Coady in the 220, which he swam<br />\nApril 1—Dickinson (pending). as President was very similar.\" The institution at Hopkins.<br />\naward bestowed upon an under- in the poor time of 2.58. Lord, of<br />\nApril 11—Cornell.<br />\ngraduate<br />\nfor work of a non-ath- Hopkins, finished third in this<br />\nRabbi stated that Lincoln was equal<br />\nAccording to the plans of the<br />\nApril 13—Blue Ridge College. to the great emergency that sum- Board,<br />\nletic<br />\ncharacter,<br />\nand it is only as a event. The Black and Blue started<br />\npropaganda concerning the<br />\nApril 15—University of Pitts- moned him in 1861 and so was J. H. U.<br />\nrecognition<br />\nof<br />\nsome important the meet with a rush by capturing<br />\nundergraduate school will<br />\nburgh.<br />\nWilson equal to the emergency of reach the eyes of thousands of peo- service to an activity of this sort the relay in handy fashion. The<br />\nApril 18—Baltimore Orioles.<br />\n1917; Lincoln served because he ple all over the United States and that it is awarded, co that winning team was composed of Coady, MorApril 22—V. M. I. at. Lexing- was a true representative of Amerwill especially attract the attention it is a worthy accomplishment.<br />\nrell, Johnston and Rowland.<br />\nton, Va. (pending).<br />\nican citizenship, and so was Wil- of every high school graduate withThe Hopkins swimmers showed<br />\nApril 26—William and Mary. son, completely and adequately,<br />\nin a radius of 150 miles of Balti- RIFLE TEAM LOSES TO YALE BY to disadvantage in the 50-yard dash<br />\nApril 29—Gettysburg (pend- American.<br />\nCLOSE SCORE<br />\nmore.<br />\nand the fancy diving, in both of<br />\ning).<br />\nThe Yale rifle team had to put<br />\nwhich the Garnet captured first and<br />\nActual work will not begin until<br />\nMay 6—University of Mary- \"Wilson won the war, he did not<br />\na hard fight last Thursday to second.<br />\nup<br />\nIn the latter event, espeiose it,\" said Dr. Wise, and he de- the first week after exams. At this<br />\nland.<br />\nwin from Johns Hopkins by the cially, the<br />\ncandidate's<br />\ntime<br />\nBlack and Blue was out-a<br />\nmeeting<br />\nwar.<br />\nWilson<br />\nthe<br />\nentered<br />\nwill<br />\nbe<br />\nthat<br />\nclared<br />\nMay 10—Navy (at Annapolis).<br />\n497-490. This speaks well classed<br />\ntaking America with him, and held and the exact work to be ac- score of<br />\nand<br />\nshowed dire need of<br />\nMay 13—Western Maryland.<br />\ncomplished will be outlined by Dr. for Hopkins, as Yale is supposed new material.<br />\nRabbi<br />\nbeThe<br />\nthings.<br />\ngreat<br />\ndid<br />\nMay 20—St. John's.<br />\nThe team was somewhat handiItaly, Van Orman, the official censor of to have the best team in the counMay 27—Delaware (at New- lieves that \"the people of<br />\ntry. Yale has already defeated capped<br />\nthe<br />\nBelgium<br />\nBoard.<br />\nby the absence of two of<br />\nand<br />\nEngland<br />\nFrance,<br />\nark).<br />\nIowa State University and Univer- its stars, Capt.<br />\nPaul Buhrer and<br />\nterand<br />\ndark<br />\nthe<br />\nof<br />\nthe<br />\ntest<br />\nstood<br />\nJune 3—Haverford.<br />\nsity of Maine, and finished third in \"Bob\" Hall,<br />\nwho were unable to<br />\nrible days of the German cruelties SOPHOMORE PROM<br />\nPOSTPONED the National Rifle Association meet<br />\nparticipate because of scholastic<br />\nof war because they had trust and<br />\nUNTIL SPRING<br />\nin December.<br />\ndifficulties.<br />\nman—Woodrow<br />\none<br />\nconfidence in<br />\nIt was recently decided by the<br />\nThe individual scores in the Yale<br />\nMUSICAL CLUB TO TAKE PART IN Wilson, who was the representative<br />\nThe next meet is pending for<br />\nSoph- shoot were as follows:<br />\nASSEMBLIES<br />\nFebruary 4 and the big meet with<br />\nof America, the nation that was in committee in charge of the<br />\nThe Musical Club will, in the the war to make the world safe for omore Prom to postpone that affair<br />\nRuoff, 99; Mount, 99; Salter, Lehigh is scheduled for<br />\nSaturday,<br />\nfuture, be a feature of the weekly freedom and democracy. Wilson until after the Spring vacation. It 98; L'Allemand, 97; Sherwood, 97: 'February 11, at the B. A. C. pool.<br />\nstudent assemblies. It was decided was the leader of the allied forces had been previously announced Ross, 97; Wilgis, 95; Virdin, 95; Summary:<br />\nat their last meeting that the club<br />\nRelay—Won by Johns Hopkins<br />\nin 1917 and 1918 for he welded to- that the second year men would Gustafson, 95; Cochran, 92.<br />\nWas not accomplishing enough<br />\nThe five highest scores were used (Rowland, Coady, Morrell and<br />\ngether united peoples, and placed have<br />\ntheir \"hop\" after the mid-year to determine the total score of the<br />\nPublic work about the school, them in the hands of one who could<br />\nJohnston). Time, 1.53 3-5.<br />\nexaminations,<br />\nbut, owing to the<br />\nand it was proposed to put on<br />\nFancy Diving—Won by Baxter,<br />\nlead them to victory, namely, Mar- large number of affairs to be held match. The members of the Yale<br />\nsome program at each Assembly.<br />\nteam are: J. W. Clise, captain; W. Swarthmore; Baker, Swarthmore,<br />\nshall Foch.\"<br />\naround this time, the postponement W. Baker, T. G. Bennet, W. H.<br />\nThis will not only create a greater<br />\nsecond; Coady, Johns Hopkins,<br />\n\"After the war, Italy failed him. was announced in order that those<br />\nMeyer, R. W. Schlesinger, W. R. third.<br />\ninterest in the club on the part of<br />\nFrance weakened toward him, and who expect to attend may have a<br />\nthe student body, but it will also<br />\nBriggs, K. T. Redick, C. P. Wil50-Yard Dash—Won by CrownEngland became doubtful of Wil- cl-.ance to recuperate financially.<br />\n'flake the assemblies more attracliams, Jr., S. W. Seward, S. H. over, Swarthmore; Baker, Swarthson, because America failed their The affair will be formal and will<br />\ntive by way of diversion, thus fillLanahan, and R. T. Lowndes.<br />\nmore, second; Johnston, Johns<br />\nPresident,\" declared the speaker. not be closed to the Sophomore<br />\nCapt. McMurray is pleased with Hopkins, third. Time, 282-5.<br />\ning a long existing gap in the proDr. Wise said that the vile and un- Class.<br />\ngra m of these meetings.<br />\nthe showing that the team made<br />\n50-Yard Back Stroke—Won by<br />\njust newspaper reports that filled<br />\nimmediately<br />\nposted<br />\nroll<br />\nwill<br />\nbe<br />\nA<br />\nand was particularly pleased by the Hambleton, Johns Hopkins; Lord,<br />\nThe feature at last Thursday's the<br />\npress at Paris in the winter of after the completion of the midfact that Hopkins score was one Johns Hopkins, second; Bonsall,<br />\nAssembly was a song by the club's<br />\n1919 came from America and were year examinations, and all Sopho- point<br />\nmore than that made against Swarthmore, third. Time, 40 3-5.<br />\nccluartette, which is composed of<br />\nwritten by Americans, while our<br />\njimmy\" Harwood, first tenor; I'resident was in a strange land mores are requested to sign this University of Maine. He feels that 220-Yard Dash — Won by<br />\npromptly in order that a complete the team is running in good shape Crownover, Swarthmore; Coady,<br />\n:‘Ted\" Morrison, second tenor;<br />\nnegotiating for America. At Paris, personnel of the class may be acanr.1 s':onfirlent that our defeat by Johns Hopkins, second; Lord,<br />\n:Jack\" Croker, first bass, and<br />\nContinued on Page 4, Col. 4<br />\n'Yale will be the only one.<br />\nquired.<br />\n'Johnny\" Sherwood, second bass.<br />\nContinued on page 3, col. 1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 26, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nSTUDENT COUNCIL TO PUBLISH ITS TRIALS<br />\n<br />\nFOUNDED 1897.<br />\n<br />\nHope to Remove Air of Mystery from<br />\nProcedure.<br />\n$2.60<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22.<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LILTS, '22.<br />\n<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nCRAIG E. TAYLOR, '24.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIM3RE, MD., JANUARY 26, 1922<br />\n<br />\nRABBI WISE<br />\nWhatever may have been the sentiments and opinions of the<br />\nstudents who heard Rabbi -Wise last Thursday, they could not fail<br />\nto have been impressed and interested. The privilege of hearing a<br />\nspeaker of Rabbi Wise's ability is seldom given a student body, for<br />\nfew such men are in the country.<br />\nRabbi Wise well defended his reputation as one of the foremost<br />\norators in America, holding the attention of his audience from first<br />\nto last. We believe that the speaker who can hold the interest of a<br />\ncollege audience is a genuine orator and we take this opportunity of<br />\npaying our respects to Rabbi Wise and our thanks to Dr. Latane for<br />\nprocuring such an interesting and able man,<br />\n<br />\nA WORTHY ALUMNUS?<br />\nThe following letter has been received from an alumnus in reply<br />\nto the circulars recently sent out by the News-Letter:<br />\n\"Dear Sir:<br />\nReferring to your circular,—the reason you have not<br />\nheard from me ;s that I have thrown your paper into the<br />\nwaste basket unopened, consequently did not see any of the<br />\nnotices you sent me.<br />\nI do not care for the paper.<br />\nVery truly yours,<br />\nWhen we adopted the policy of putting a number of alumni on<br />\nthe mailing list this fall, we made no effort to force them to accept<br />\nthe publication. We simply took this means of bringing it to their<br />\nattention with the hope that they would be sufficiently interested in<br />\nthe rapid development of the University to subscribe.<br />\nWe do not object to the writer not caring for the paper, but we<br />\ndo object to his having thrown it \"into the waste basket unopened.\"<br />\nWe believe that such action on his part shows a deplorable lack of<br />\ninterest in his Alma Mater, and for that reason we question his value<br />\nto the University as an Alumnus.<br />\nAfter all, is the man, who receives his education from the University at a fraction of its actual cost, who receives the privilege of<br />\nbeing its representative and yet who,in after years, does not even take<br />\nsufficient interest to open a copy of his college paper, worthy to be<br />\non the Alumni roll of that institution?<br />\n<br />\n\"Dick\" Wood announces that in<br />\nthe future the trials conducted by<br />\nthe Student Council, if any shall<br />\nhe found necessary, will be given<br />\ndetailed publication, omitting only<br />\nthe names of the men accused of<br />\nmisdemeanors. It is thought that<br />\nthis will throw light on the actual<br />\nses of such cases and also on<br />\nDff<br />\nthe procedure of Council, and help<br />\nto offset the air of mystery which<br />\nhas seemed to envelop the actions<br />\nuf the Council in the past.<br />\nWith regard to the Honor System, an intensive campaign of education is to be waged from now<br />\nup to examination time, with the<br />\nend in view of making the system<br />\nso plain that no misunderstandings<br />\nwill be possible. At the coming assembly, which is to be dedicated in<br />\nits entirety to this work, Mr. Christy and other speakers will address<br />\nthe student body, and it is more<br />\nthan important that everyone be<br />\npresent, since the honor of the University seems to be compromised in<br />\nthe question of the success or failure of the Honor System (although<br />\nwhat grounds there are for the idea<br />\nthat it has failed are beyond imagination). It is hoped, therefore,<br />\nthat the assembly will be marked<br />\nby a full attendance to show, if<br />\nnething else, that the student body<br />\nis heartily in favor of the Honor<br />\nSystem.<br />\nShort talks in the various classes<br />\nexplanatory of the system are to be<br />\ngiven also as parts of the campaign<br />\nto clarify once and for all this matter of the working of the Honor<br />\nSystem.<br />\n<br />\nALUMNI!<br />\nPay Your News-Letter<br />\nBills<br />\nBOXING TEAM PROSPERING<br />\nDESPITE DIFFICULTIES<br />\n<br />\nLACROSSE PRACTICE TEMPORARILY SUSPENDED<br />\n<br />\nHow can a boxing team thrive<br />\nwithout some adequate place in<br />\nwhich the \"knights of the squared<br />\ncircle\" can pair off? At present<br />\nthat is the big question which is<br />\ntroubling \"Bob\" Marino, to whom<br />\nHopkins is indebted for the recent revival of boxing.<br />\n<br />\nAs Hopkins has planned a very<br />\nextensive lacrosse schedule for this<br />\nyear, the most important thing at<br />\nthis time is for all members of the<br />\nteam, as well as the candidates, to<br />\nkeep their names off the black list.<br />\nIn order that such may be the case,<br />\npractice has been suspended until<br />\nafter the mid-year exams.<br />\nA meeting of. the team was held<br />\non Monday, January 16, at which<br />\ntime Coach Johnny Knipp emphatically urged the \"snow shoers\" to<br />\ncome through the exams with flyii:g colors, and also heartened the<br />\nmen by telling of the excellent prospects which Hopkins has for a banner season this year.<br />\n<br />\nFor some time past an effort has<br />\nbeen made to secure as a boxing<br />\nroom the old gym. located behind<br />\nthe Hopkins Club.<br />\nAll attempts<br />\nhave proven fruitless, as the gym.<br />\nis pretty well filled up with geological specimens for which no other place can be found. \"Bob\" just<br />\ncan't see why the manly art should<br />\nsuffer because of a few rocks but<br />\nsuffice it to say that he and Dr. weights, and there are openings<br />\n'Thercrombie are making every pos- for some of the huskies.<br />\nsible effort to secure a suitable inIt is not at all necessary that the<br />\ndoor place.<br />\ncandidates be experienced, as it is<br />\nAt present the candidates are do- not purposed to enter any intercoling vigorous track work to con- legiate matches this year. The idea<br />\ndition them for the real training is to take the men at this time, teach<br />\nwhich will commence after the ex- and train them, so that next year<br />\nams. About twenty-five or thirty they will know the fine points of the<br />\ncandidates have responded to the game, nd then a schedule will be<br />\ncall, and among them there is some arranged.<br />\nSENIORS DEFEAT JUNIORS IN very promising material. There is,<br />\nActive work will begin FebruANNUAL DEBATE<br />\nhowever, a great lack of heavy- ary 6.<br />\nDebate is Followed by Informal Dance.<br />\nMusic Furnished by Undergraduate<br />\nJazz Orchestra.<br />\n<br />\nThe twenty-fifth annual Adams<br />\nDebate between the Junior and<br />\nSenior classes, held in the C. E.<br />\nHall last Saturday night, was won<br />\nby the Class of 1922. The contest<br />\nwas an unusually close one as th.c.;<br />\nvictors gained the decision by the<br />\nmargin_of one vote, two judges declaring in favor of the Seniors,<br />\nwhile one voted for the Junior<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nteam. Dr. John C. French presided. while Messrs. Jesse SlingINSTRUCTION<br />\nff, Ralph F. Proctor and Thomas<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nj Tingley, '16, acted as arbiters.<br />\nof Philosophy.<br />\nThe subject for debate was: \"ReMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nsolved, That the United States<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nGovernment should own and operDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nate the coal mines of the country.\"<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nThe Senior team, which upheld the SCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\naffirmative, was composed of R.<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nDorsey Watkins, Edward L. PotPublic Health.<br />\nzel and Adolphus D. Emmart, COLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nwhile Parker C. Williams, Harold SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nor of Science. Also for graduates in Medicine.<br />\nBreslau and Raymond W. Cooke<br />\ncomposed the negative, which rep- EVENING COURSES in Business Economics and for Technical Workers.<br />\nPHYSICAL TRAINING NOTICE<br />\nNEW BLACK AND BLUE JAY OUT<br />\nresented the Class of 1923.<br />\nTHIS WEEK<br />\nThe class in Physical Training<br />\nThe opening argument for the<br />\nThe third issue of the Black and has suspended its outdoor work and<br />\nwas made by Edward JOHNS HOPKINS PRESS PUBLICATIONS.<br />\naffirmative<br />\nBlue Jay will be out the first part<br />\nis now taking a course in hygiene, L. Putzel, who presented in a clear STATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nof this week. It will be called the<br />\nconcise manner the difficulties<br />\nBUILDINGS<br />\n\"Wise Guy\" number. According which will last throughout the win- and<br />\nand disproduction<br />\nthe<br />\nin<br />\narising<br />\nmonths.<br />\nDr.<br />\nter<br />\nAbercrombie<br />\ndecopy,<br />\nthe<br />\nclass rooms, biology, administration.<br />\nlibrary,<br />\nseen<br />\nto those who have<br />\nGILMAN HALL—general<br />\npresent<br />\nunder<br />\ncoal<br />\nthe<br />\nof<br />\ntriution<br />\npublished.<br />\never<br />\nlivers a lecture three times a week<br />\nit will be the best<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and Coland<br />\nownership,<br />\nprivate<br />\nof<br />\nsystem<br />\nlege Chemistry.<br />\nThe fourth issue will be put out on some part of the human anatof<br />\nfunctions<br />\nthese<br />\nthat<br />\nasserted<br />\nCIVIL ENGINEERING—housing also Geology.<br />\non an entirely different idea than omy. All first and second year stubetter<br />\nbe<br />\nwould<br />\nindustry<br />\ncoal<br />\nthe<br />\nPOWER HOUSE.<br />\nany of the former numbers. A re- dents, who are not excused, must<br />\nownergovernment<br />\nunder<br />\nexecuted<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nquest will be sent to Goucher, attend these lectures. So far the<br />\nship.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nEastern High, Western High, following lectures have been defirst<br />\nthe<br />\nCooke,<br />\nRaymond<br />\nW.<br />\nPHYSIOLOGICAL BUILDING.<br />\nPolytechnic, City College, Notre livered:<br />\nnuegative speaker, held that it ANATOMICAL LABORATORY.<br />\nDame and several other schools in<br />\nJanuary 9—The Structure of the would be impossible for the govHUNTERIAN LABORATORIES.<br />\nthe city to contribute drawings, Human Body.<br />\nernment to purchase the coal re- PATHOLOGICAL LABORATORY.<br />\njokes, stories and literature.. The<br />\nJanuary 13—The Heart.<br />\nsources of this country, as the cost SCHOOL OF HYGIENE.<br />\nBlack and Blue Jay staff expects<br />\nwould be many times our present CARROLL MANSION—Johns Hopkins Club.<br />\nNerJanuary<br />\nCentral<br />\n16—The<br />\nto get sufficient material from<br />\ndebt. Private enterprise. STUDENT ACTIVITIES BUILDING.<br />\nnational<br />\nthese sources to fill an entire vous System.<br />\nwilling to pay competent<br />\nis<br />\nsaid,<br />\nhe<br />\nJanuary 18—The Physiology of<br />\nnumber. This issue will appear<br />\nContinued on page 4, col. 2<br />\nthe Digestive Tract.<br />\nabout the first of April.<br />\n<br />\nThe Johns Hopkins<br />\nUniversity<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 26, 1922<br />\n<br />\n!ry<br />\nhis<br />\nat<br />\nthe<br />\nto<br />\nist.<br />\nse,<br />\nitil<br />\n<br />\nld<br />\nch<br />\natto<br />\nlyhe<br />\n3sLn-<br />\n<br />\no-s<br />\n<br />\nhe<br />\nis<br />\n31ea<br />\nch<br />\nar<br />\nhe<br />\nbe<br />\nu-<br />\n<br />\nor<br />\n<br />\nD1-<br />\n<br />\nTANK MEET LOST TO QUAKERS SIGMA CHI BETA DANCE ON<br />\nContinued from page 1,<br />\nMARCH THIRD<br />\nJohns Hopkins, third. Time, 2.53. To Be First of Series Given by the<br />\nHonorary Society.<br />\nPlunge for Distance—Won by<br />\nAt a meeting of Sigma Chi Beta<br />\nHambleton, Johns Hopkins; Bliss,<br />\nClark, Friday, definite plans were made<br />\nSwarthmore,<br />\nsecond;<br />\nSwarthmore, third. Distance, 61 for a dance to be given Friday,<br />\nfeet (breaking Hopkins record).<br />\nMarch third. The committee ap100-Yard<br />\nDash — Won<br />\nby<br />\npointed is R. Hall (chairman),<br />\nCrownover, Swarthmore; MorJohn<br />\nDubbleday and H. Forerell, Johns Hopkins, second; Baker,<br />\nSwarthmore, third. Time, 1.3 3-5. graves and they will immediately<br />\nmake arrangements for securing<br />\nHULLABALOO \"MARKING TIME\"<br />\nL'Hirondelle Club for the purpose.<br />\nWork on the Hullabaloo is at the<br />\nSigma Chi Beta has adopted a<br />\npresent time very quiet because of<br />\nthe closeness of the exams. Most new policy which they hope will,<br />\nof the individual pictures for the in future years, be of advantage to<br />\nyear-book have been finished and the university. Their plan is to<br />\nthose which are still incomplete are give two or three dances a year,<br />\nbeing taken as rapidly as possible. to which the desirable members of<br />\nAfter the examinations, group pic- the graduating classes of the<br />\ntures will be taken and the Hulla- city's \"prep\" schools will be inbaloo will enter upon the home- vited. Sigma Chi Beta is made up<br />\nof men who have gained promistretch.<br />\nnence on the campus, and it is<br />\nthought<br />\nthat they can influence<br />\nLIBERTY<br />\nthese \"prep\" school boys to come<br />\nExpert Cleaners and Dyers<br />\nto Hopkins. 0. D. K. works for<br />\nSpecial Rates to Hopkins Men<br />\nthis same end by a series of lec211 E.25th St.<br />\nHomewood 5205-W tures on Hopkins throughout the<br />\nstate. To this effort Sigma Chi<br />\nBeta is endeavoring to add their<br />\ninfluence. This plan has received<br />\nLunches, Cigars<br />\nthe endorsement of prominent<br />\nCigarettes<br />\nprofessors in many departments<br />\nof<br />\nthe University.<br />\nCandy, Soda and<br />\nThe new men, whose names<br />\nPipes and Fountain Pens were passed on several weeks ago,<br />\nwere pledged by Sigma Chi Beta<br />\nAt the Barn<br />\nyesterday.<br />\n<br />\nE. E. Adams<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nNECKWEAR<br />\n<br />\nSHIRTS<br />\n<br />\nLefranc & Ault<br />\n421 N. HOWARD ST.<br />\nGLOVES<br />\nHOSIERY<br />\nSHIRT MAKER<br />\nLiberty St.<br />\n226<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\n<br />\nSTRATTON<br />\n<br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nEstablished 1873<br />\n<br />\nA.H.Fetting Man'fg Jewelry Co.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\n3<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nClothes if Cusiom<br />\n<br />\n14 N.Charles Street<br />\n<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\n<br />\nSOMETHING WRONG SOMEWHERE?<br />\n<br />\nEditor of News-Letter,<br />\nDear Sir:<br />\nWe are establishing a new standard in<br />\nWhen affairs reach such a state<br />\nthat a professor in English reYoung Men's Suits at $29.50<br />\nfuses to place on reserve a valStyles for every taste.<br />\nuable book with the explanation<br />\nthat \"they are already too scarce,\"<br />\nthe Secretary of the Y. M. C. A.<br />\nBaltimore's Best Store<br />\nwrites to the News-Letter complaining of the petty theft of some<br />\nHOCHSCHILD.KOHN 8c CO.<br />\nboard covers intended for use on<br />\nthe magazines there, and an instructor in philosophy is found to<br />\nremonstrate with his class over<br />\nthe carrying away of not one, but<br />\nseveral of the text books bought<br />\nby the University especially to<br />\nsave the purchasing of them by<br />\nall the members of the class, when<br />\nthis is the case, every right-minded student will agree that someSend for catalog describing over 400 courses in History, English,<br />\nthing is amiss, to put it mildly.<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nIt is not, and should not be, a<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\nhow credits earned may be applied on present college program.<br />\ncharacteristic of the real college<br />\nman to commit filchings of this<br />\n30th<br />\nnature. A man that would play a /<br />\n1<br />\n4<br />\nHOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nYear<br />\ntrick of that kind does not belong<br />\nin college. If apprehended, there is<br />\nSOCIAL SCIENCE CLUB NOTICE<br />\nno doubting that he would be<br />\nMr. James O'Connell, president summarily dismissed. Let the<br />\nof the Metal Trades Department of<br />\nContinued on page 4, col 2.<br />\nthe American Federation of Labor,<br />\nwill address the Social Science Club<br />\nMHOUSANDS of smokers have proved it—and now give the verdict<br />\noday.(Tuesday, January 23). The<br />\nto you<br />\nall the other tobaccos NATURE has produced—none<br />\nmeeting will be held at quarter<br />\ncan<br />\nEngineering<br />\napproach<br />\nthe<br />\nCivil<br />\nfinest varieties of pure Turkish for cigarettes—<br />\npast four in the<br />\nshop<br />\nopen<br />\nHall. Arguments for the<br />\nNone has the delicious<br />\nwill be brought up at a future meetFLAVOR<br />\nofthefinestTurkish—<br />\ning.<br />\nThe Club is planning to have<br />\nNone gives the ENJOYseveral lectures on the open and<br />\nMENT ofthe finest Turkish—<br />\nclosed shop. These will be held in<br />\nNone will SATISFY you as<br />\nthe C. E. Hall, one in January<br />\nand one in February. Emil Smith,<br />\nwill the finest Turkish—<br />\nsecretary of the club, is corNone but the highest grade<br />\nresponding with several promL.<br />\nand<br />\nhe<br />\ninent men of the A. F. of<br />\nand personally selected<br />\nhopes to have one of them deliver<br />\nTurkish tobaccos is used in<br />\nthe lecture on the closed shop. The<br />\nMURAD.<br />\nclub will not hold any more meetings until after the mid-year examTo enjoy 100% pure Turkish<br />\ninations.<br />\n<br />\nSHE HURT HER FEELINGS<br />\nHe—\"Where did you do most of<br />\nElkridge Farms Dairy<br />\nyour skating when you were learnSTRICTLY FRESH MILK<br />\ning?\"<br />\nProduced, Pasteurized and Bottled<br />\nShe—\"I think you're horrid.\"—<br />\nCounty<br />\nHoward<br />\nin<br />\nOctopus.<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nq Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nDo You Need Extra Courses?<br />\nZhr liniurrsityut atigragrt<br />\n<br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br />\nMURAD—<br />\n<br />\nS. ANARGYR0S.<br />\n<br />\nTry MURAD today and<br />\n\"Judge for<br />\nYourself—!\"<br />\n<br />\n20c<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDRAPERIES<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\n!n.<br />\n<br />\nBONDS<br />\n<br />\nENVELOPES<br />\n<br />\nLEDGERS<br />\nak.To.mcgcmisdo,<br />\n<br />\nlEisttandik.s..amildi<br />\n<br />\nThe W. H Moore, Jr. Paper Co.<br />\n205 W.CAMDEN STREET<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET rER, JANUARY 26, 1922<br />\n<br />\n4<br />\n<br />\nBIBLE CLASSES POPULAR IN not more than five to twelve cents<br />\nper ton.<br />\nNORTHERN COLLEGES<br />\n(THE BOOK MART)<br />\nHarold Breslau, in his negative<br />\nHopkins Y. M. C. A. Discussion Groups<br />\nComplete Stock of<br />\nto Meet After Exams.<br />\nrebuttal, gave statistics to show<br />\nMedical Books and College<br />\n\"The University of Pennsyl- that the margin of the operators'<br />\nRequisites<br />\nvania had more than fifty Bible profit is very small. During the<br />\nImporters and Dealers in Fine Books groups last year, with an enrollwar, when the mines were under<br />\n301 N. CHARLES ST.<br />\nment of 1,500 and an average at- the supervision of the government,<br />\nBaltimore, Md.<br />\ntendance of 1,000.\" This statement coal was more difficult to get than<br />\ncoming to the local \"Y\" office this ever before.<br />\nweek gives an idea of the work of<br />\nIn closing the debate with the<br />\nthe student \"Y's\" along this branch affirmative rebuttal, R. Dorsey<br />\nof service.<br />\nWatkins said that the government<br />\nAmong other colleges the fol- would be able to mine and distriblowing information upon the forma- ute coal to the public at one-half<br />\ntion of Bible study groups is avail- the present price, and at the same<br />\n: Wesleyan (Conn.), 150 out time give the miners a wage inG.1-5s<br />\nof 180 freshmen were enrolled: crease of fifty cents a ton. He enH.N, OSCAR<br />\n,OWNEIRS<br />\nBates, 10 classes, 8 of which are deavored to refute the argument<br />\n°<br />\ned by students, with an enroll- that government ownership was in2%it41/3,0\"\"lec--4 OP<br />\n29 Baltimore St., East<br />\nment of 101; University of Maine, efficient, and held that it would be<br />\nOne Door West of Light St.<br />\n10 classes, consisting of 167 stu- more satisfactory, both to the pubSOLE AGENTS FOR BALTIMORE<br />\nlents ; Yale, 20 group leaders in lic and the operatives.<br />\nFor College Fraternity Bands<br />\nSocieties)<br />\n(Greek Letter<br />\ntraining; Brown, 12 groups, with<br />\nAfter the debate the chairs were<br />\nan enrollment of 125; North Caro- removed for an informal dance,<br />\nThe Chas. Willms Surgical<br />\nlina State, 32 groups, with an en- NN,hich lasted until twelve. Music<br />\nInstrument Co.<br />\nrollment of 350; and Iowa State was furnished by the University<br />\nsoo N. HOWARD ST., Baltimore, Md.<br />\nCollege, 74 groups, with 4 normal Jazz Orchestra.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\ntraining classes, having an attendStethoscopes<br />\nBlood Lancets ance of 700 to 800 students.<br />\nBlood Counters<br />\nAmong the leaders of these groups<br />\nare ministers, student pastors, association secretaries and senior<br />\nPrinters of Philological and<br />\nstudents.<br />\nScientific Works<br />\nInterest became markedly more<br />\n23 S. HANOVER ST.<br />\nwidespread at the Lake Forest AsBaltimore, Md.<br />\nsembly of College \"Y's\" last September, when the following principle, among a host of others, was<br />\nadopted: \"The function of Bible<br />\nstudy is to increase the knowledge<br />\nand interest in Jesus and His cause<br />\nfor the purpose of securing Christ:an living and Christian social conditions.\"<br />\nAfter the exams the Hopkins Y.<br />\nC. A. will again hold its Bible<br />\nM.<br />\n17 E. Baltimore St.<br />\nstudy classes and discussion groups.<br />\nAn unusual interest was shown in<br />\nthe class the first term, even though<br />\nthe short period of time prevented<br />\nPrinters of the<br />\nextensive discussion upon various<br />\n-Letter<br />\nJohns Hopkins News<br />\npoints which were brought up for<br />\nthe leader's consideration. The<br />\nname of the leader and the time and<br />\nplace for the class will be announced in a short time, probably<br />\nthe first of February.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\ntr-tbv<br />\n<br />\n-4mts<br />\n<br />\nUNIVERSITY BAND TO PLAY AT<br />\nARMORY TRACK MEET<br />\nThe Band will play at the track<br />\nmeet in the Fifth Regiment Armory on the twenty-fifth of February. Emil Smith is working very<br />\nhard in order that the Band may<br />\nbe in good shape on that day. At<br />\nthe rehearsals they are working<br />\non a new overture called \"Lustspiel\" and also some new popular<br />\nmusic in addition to several wellmarches. The Band is<br />\nknown<br />\nWOODROW WILSON<br />\nContinued from page 1, vol. 2<br />\ngreatly handicapped, however, as<br />\nWilson was not supported by his the men will not turn out regown people, but was undermined ularly and promptly on Mondays<br />\nand betrayed, so how could leaders at the rehearsals.<br />\nof foreign nations look up to him.<br />\nThe rascals who did this mean and his name will stand in the anwork set out to destroy a man and nals of history with that of Washthey nearly shattered the pillars of ington, Lincoln and Roosevelt.\"<br />\nthe temple of peace, and really ton, Lincoln and Roosevelt.\"<br />\nmade the man, Wilson, live.<br />\nENUF IS ENUF<br />\nDr. Wise closed his address by<br />\nstating that a politician meets a<br />\nMrs. Pasch—\"Mildred, I wish<br />\nman on his lowest level.; a statesman you would send :Vic home.\"<br />\nreaches out and leads men to the<br />\nMildred—\"I will after a second.\"<br />\nhighest level—Wilson was a statesMrs. P.—\"No, one is enough.\"—<br />\nman. \"History will sustain him Teaser.<br />\n<br />\n\"DICK\" HOLMES MARRIED<br />\nIt was recently announced that<br />\nRichmond B. Holmes, otherwise<br />\nknown as \"Dick,\" ex-'22, who left<br />\ncollege last June to embark on a<br />\nbusiness career, had been married.<br />\nThe lucky bride is Miss Lelia B.<br />\nTall, of Fairmont, Walbrook.<br />\n\"Dick\" will be remembered as a<br />\nstar attack man on last year's lacrosse twelve.<br />\n<br />\nSWIMMING MEET WITH LEHIGH<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nfollowed by<br />\n<br />\nA DANCE<br />\n<br />\nFEBRUARY 11.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nB. A. C.<br />\n<br />\nALL OUT<br />\n<br />\nTickets at Andy Landy & Co.<br />\n<br />\ntrnosphere—<br />\nti<br />\n<br />\nMAILBAG CONTINUED<br />\nContinued from page 3,cal. 3<br />\n<br />\nCollege Literature<br />\n<br />\nguilty one, therefore, (or are<br />\nthere possibly several?) discontinue his practice if he wishes to<br />\nkeep his name clearer than his<br />\nconscience.<br />\nR. S. P.<br />\n<br />\nThe subtle something that<br />\nmakes your college different<br />\nfrom any other, and dearer<br />\nto you,than all the rest combined. In cigarettes, it's the<br />\nsignal success that makes so<br />\nmanycollege men ofdiscrimination prefer Melachrino,<br />\nthe one cigarette sold the<br />\nworld over.<br />\n<br />\nLOMBARD and SOUTH STREETS<br />\nSENIOR JUNIOR DEBATE<br />\nContinued from page 2<br />\n<br />\nSHOES<br />\n<br />\nment would pay them only a nomfor<br />\ninal sum. He gave several examples of the failure of government<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear ownership in the past and said it<br />\nwould create delay and inefficiency,<br />\nSmart Styles—Best Leathers<br />\nresult in \"passing the buck\"<br />\nand<br />\nModerate Prices<br />\nto higher officials.<br />\nAlbert E. Dimond, the second affirmative speaker, gave a plan for<br />\nthe transfer of the mines to gov19 W. LEXINGTON ST.<br />\nernment control by means of stock<br />\nand bond subscriptions. He mainained that this plan would put an<br />\nend to the continual war between<br />\n\"College\" isn't labeled<br />\nthe owners and operatives.<br />\non our clothes, but<br />\nThe second presentation speaker<br />\nthe college spirit is for the negative, Parker C. Wilthere never-the-less in liams, asserted that the plan would<br />\ncreate an enormous government anevery line.<br />\nnual trust, which he characterized<br />\nas socialistic and un-American. He<br />\npointed out that at present the opBaltimore and Hanover<br />\nerator gets an average profit over<br />\nand above all expenses of from<br />\n<br />\nWYMAN<br />\n<br />\nIsaac Hamburur and Sons<br />\n<br />\n•<br />\n<br />\nmen adequately, while the govern-<br />\n<br />\n•<br />\n<br />\n..4.<br />\n„<br />\n,............41010.....•<br />\n...<br />\n...7e,<br />\n<br />\n.....<br />\n..,...'<br />\n...No.....;.........*.<br />\n,1;<br />\n1'<br />\n,<br />\n\"e\"n4A.. '<br />\n''<br />\n......<br />\n<br />\n-.0\"<br />\n.<br />\n..<br />\n\",..<br />\n.<br />\nic.. %*\". ..<br />\n.i..,..<br />\n'<br />\n<br />\n...•<br />\n<br />\nl'e'37\"41:7<br />\ni<br />\n.<br />\na.-7.••-•<br />\nite<br />\n7<br />\n<br />\n4:Z;.:-.--.<br />\n<br />\n..<br />\n. ......,<br />\n,<br />\n-,.,......„-... *<br />\n..34.........,..„,........,........-<br />\n<br />\n.y.,<br />\n'..<br />\n,.<br />\n.\"<br />\n..\"'..<br />\n...n,....\"<br />\n<br />\nCo.?<br />\n'<br />\n....1i=Z;uftosa••••••,..,. ....<br />\n<br />\n:Igt<br />\n2,,<br />\n)<br />\nF11.1A74<br />\n<br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino—it's right<br />\n<br />\nelachrino<br />\n<br />\n\" The Cigarette Elect of All Nations\"<br />\n<br />\nV<br />\n<br />\n1.<br />\n<br />\nfi<br />\n<br />\na<br />\n<br />\n\f", "format": "basic_html", "processed": "/-1<br /><br />\nr4<br />\n,74<br />\n40<br /><br />\nVOL. XXVI. No. 26<br /><br />\n10/j °<br /><br />\nro,<br /><br />\n'<br />\ns<br /><br />\nA<br /><br />\nt<br /><br />\n-<br /><br />\nP<br /><br />\n1<br />\n, - A ./<br /><br />\ndmj<br /><br />\n,<br />\nrYtz7<br /><br />\nBALTIMORE, MD., JANUARY 26, 1922<br /><br />\nMARYLAND STATE TO BE WOODROW WILSON EULO- PUBLICITY BOARD BECOMES GOLD FOOTBALLS AND VARGIZED BY RABBI WISE<br />\nMET ON DIAMOND<br />\nSITY SEALS AWARDED<br />\nRECOGNIZED ACTIVITY<br /><br />\nPRICE 5 CENTS<br />\nTANKMEN LOSE TO QUAKERS BY CLOSE SCORE<br /><br />\nGame a Result of Recent Settlement of New York Rabbi Declares Achievements To B-gin Spreadirg Propaganda Week Twelve Football Players and Eight Non- Hambleton Breaks Record in Plunge,<br />\nDifficulties. William and Mary Also<br />\nAthletic Workers Rewarded<br />\nof Former President Will Go Down<br />\nAfter Exams. Call for Candidates<br />\nDoing 61 Feet. Result Hinges on<br />\nAdded to Schedule.<br />\nin History.<br />\nat Assembly.<br />\nto Be Issued.<br />\n100-Yard Dash.<br /><br />\nke,<br />\nme<br /><br />\nisnd<br />\nSs.<br /><br />\n20M.<br /><br />\npt<br /><br />\nr7-<br /><br />\nier<br /><br />\nial<br /><br />\ner<br />\nnd<br />\ner<br /><br />\nr.<br /><br />\nne-<br /><br />\nin<br /><br />\n)r.<br /><br />\n0.<br /><br />\nP.<br /><br />\n0.<br /><br />\nSr..<br /><br />\nd..<br /><br />\np.,<br /><br />\n0.<br />\ny.<br /><br />\n7--<br /><br />\nJohns Hopkins and Maryland<br />\nThe Assembly on Thursday last<br />\nThe Johns Hopkins Publicity<br />\nIn one of the most thrilling<br />\nThe championship gold footwill meet on the baseball diamond was addressed by Dr. Stephen Wise. Board because a recognized activity footballs were awarded at last meets ever held in the Swarthmore<br />\nthis year. Arrangements for the one of America's leading publicists on Monday, January 16, when the<br />\npool, the Hopkins swimming team<br />\nweek's assembly to the following<br />\ngame have just been completed and a rabbi of some note. He has Student Council passed favorably<br />\nwas nosed out in their first meet<br />\nby Alanager Huey as a result of rendered valuable service to the na- upon its constitution. The Coun- members of the season's team: of the season by a 32-30 score.<br />\nthe recent amicable adjustment of tion, especially during the recent cil heartily indorsed the aims of the W. G. Totterdale (captain), F. E. From the relay, the first event on<br />\ndifficulties by the presidents of war, when he served on commis- Board as set forth in the consti- Calkins, J. U. Markell, A. H. the program, until the 100-yard<br />\nthe two Universities, Drs. Good- sions in England and France. Rab- tution and offered to assist in its Knecht, T. M. Landy, S. A. Mid- dash, which ended the match, the<br />\nnow and Wood. As soon as ath- bi Wise has always been an ardent financing, provided some arrange- dleton, F. Rich, J. I. Bonner, G. L. outcome was always in doubt, and<br />\nletic relations were resumed follower of the ideals of former ments were made to include the<br />\nDarley, G. L. Westerman, T. P. it was the latter event that gave<br />\nDr. Ray Van Orman advised President Wilson, and he is now de- non-athletic activities of the Unithe Garnet their hard-earned vicMcGill and H. P. Brawner (manManager Huey to propose a date voting a part of his time to the fur- versity in the propaganda released<br />\ntory. Prior to this swim, the score<br />\nager).<br />\nfor a baseball game to the Mary- therance of those ideals. \"Wood- for publication.<br />\nwas 27-26 with the Black and Blue<br />\nThese<br />\nmen<br />\nwere<br />\nthus<br />\nhonored<br />\nland authorities. This he did and row Wilson and the Woodrow Wilon<br />\nthe long end, and Hopkins needThe Board consists of an editorMay 6 is the date that has been son Fund\" was the theme of the in-chief, a state editor, an out-of- by the student body for the record ed a first to win or a second and<br />\nagreed upon.<br />\nrabbi's address.<br />\nstate editor, a collegiate editor, a which they made for Hopkins third to tie. Manager Rowland deAt the last meeting of the two \"Woodrow Wilson deserves the photographic editor, a clippings ed- this season, securing the state cided to pin his hopes on Morrell<br />\nand Hambleton in this event.<br />\nteams, in the spring of 1920, Mary- foundation being established for itor, and assistant editors. The aschampionship as well as defeating<br />\nSwarthmore was represented by<br />\nland State was victorious. No bat- the promotion of his ideals, and sistant editors will be elected from<br />\na<br />\nnumber<br />\nof<br />\nprominent<br />\noutside<br />\n\"Charlie\"<br />\nCrownover,<br />\ntle was staged last year on ac- A merica needs such a foundation,\" the most promisinz candidates for<br />\nMiddle<br />\nteams.<br />\nStates champion, and it looked as<br />\ncount of the rupture caused by the said Rabbi Wise, who declared that the positions.<br />\nEight men who were voted their<br />\ndisagreement over the football Wilson's name will ring loud and<br />\nThe Board, appcinted to hold of- Varsity Seals this year were if he would capture the race by a<br />\nlarge margin.<br />\nHe was hard<br />\ngame. This year, however, the clear in the annals of American his- fice until March, 1923, is composed<br />\nawarded them by H: Douglas Cot- pressed throughout, however, by<br />\nchances for a Black and -Blue vic- tory, when the letters and docu- of the following men: Editor-intory are very bright and revenge ments that are not generally known chief, W. H. Moore, Jr.; out-of- ton, president of the Varsity Seal Morrell, and they rounded the last<br />\nfor the defeat of two years ago will today shall be thrown to the press. state editor, Pat.:1 W. Bodman ; Voting Council. Those receiving turn swimming neck and neck, the<br />\nbe sweet after waiting so long for In singing the praises of Wilson state editor, Savington W.Cromp- the seals were: Lawrence B. Fen- Swarthmore star finally touching<br />\nthe opportunity. Maryland has its and his ideals, the speaker declared ton; collegiate editor, T. C. Rout- neman, editor-in-chief; Paul Ives, the finish a fraction of a second bemanaging editor; H. Douglas fore his opponent. Hambleton,<br />\nusual strong team, but Hopkins' that he was not disparaging the son; photographic editor, RanCotton,<br />\nbusiness manager; Joseph too, was barely nosed out for third<br />\nProspects are the best in several works of other great American dolph Norwood.,These men were<br />\nA. Moran, literary editor, and place.<br />\nYears.<br />\nmen, such as Washington, Lincoln selected by virtue of their fitness Quentin Singewald, advertising<br />\nThe plunging of Waldo HambleThe schedule for April and and Roosevelt.<br />\nand because they are not too over- manager, all of the Black and Blue<br />\nwas the feature of the evening.<br />\nton<br />\nMay has received another attracWoodrow Wilson was, in the es- burdened with other activities to Jay; Emil Smith, for special merit He easily won the plunge for distion in the addition of a game with<br />\nas leader of the orchestra; Wil- tance, traversing 61 feet and breaktimation of Dr. Wise, more like do justice to their new duties.<br />\nWilliam and Mary College. The<br />\nThe<br />\nplans<br />\nand<br />\nof<br />\npurposes<br />\nthe<br />\nliam<br />\nH. Moore, Jr., managing edi- ing the Hopkins record, which was<br />\nI incoln than any other man has<br />\nlittle Virginia college gained naBoard<br />\nhave<br />\nmet<br />\nenthusiastic<br />\nthe<br />\naptor<br />\nof<br />\nthe News-Letter, and Mar- 59.6. He also captured a first<br />\never been. \"Lincoln stepped from<br />\ntion-wide notice last year by deproval<br />\nof<br />\nevery<br />\norganization<br />\non<br />\nthe iano Badillo, for his exceedingly place in the back stroke, finishing<br />\nthe inaugural stand to the battlefeating the University of Ii.ansj l-field of America and after a most campus. Ma2y of Mein iiave even praiseworthy efforcs as stage man- ahead of Lora, a Medical School<br />\nvania's crack nine. As a result its<br />\nadmirable career of piloting the passed resolutions to assist in every ager of the Dramatic Club. He not man.<br />\nProgress on its Northern trip will<br />\nperturbed ship of state through the way possible. Every individual only painted the scenery, but suCrownover, who also won the<br />\nbe closely watched this year.<br />\ndarkness of war to the dawn of who has beeil questioned has also pervised all the stage settings, a 50 and the 100, pulled the unexThe schedule as arranged thus peace, he was shot down by a expressed the opinion that the Pub- task of no small difficulty.<br />\npected when he defeated Pearce<br />\nfar:<br />\nraving madman. Wilson's career licity Board will become a great<br />\nThe Varsity Seal is the highest Coady in the 220, which he swam<br />\nApril 1—Dickinson (pending). as President was very similar.\" The institution at Hopkins.<br />\naward bestowed upon an under- in the poor time of 2.58. Lord, of<br />\nApril 11—Cornell.<br />\ngraduate<br />\nfor work of a non-ath- Hopkins, finished third in this<br />\nRabbi stated that Lincoln was equal<br />\nAccording to the plans of the<br />\nApril 13—Blue Ridge College. to the great emergency that sum- Board,<br />\nletic<br />\ncharacter,<br />\nand it is only as a event. The Black and Blue started<br />\npropaganda concerning the<br />\nApril 15—University of Pitts- moned him in 1861 and so was J. H. U.<br />\nrecognition<br />\nof<br />\nsome important the meet with a rush by capturing<br />\nundergraduate school will<br />\nburgh.<br />\nWilson equal to the emergency of reach the eyes of thousands of peo- service to an activity of this sort the relay in handy fashion. The<br />\nApril 18—Baltimore Orioles.<br />\n1917; Lincoln served because he ple all over the United States and that it is awarded, co that winning team was composed of Coady, MorApril 22—V. M. I. at. Lexing- was a true representative of Amerwill especially attract the attention it is a worthy accomplishment.<br />\nrell, Johnston and Rowland.<br />\nton, Va. (pending).<br />\nican citizenship, and so was Wil- of every high school graduate withThe Hopkins swimmers showed<br />\nApril 26—William and Mary. son, completely and adequately,<br />\nin a radius of 150 miles of Balti- RIFLE TEAM LOSES TO YALE BY to disadvantage in the 50-yard dash<br />\nApril 29—Gettysburg (pend- American.<br />\nCLOSE SCORE<br />\nmore.<br />\nand the fancy diving, in both of<br />\ning).<br />\nThe Yale rifle team had to put<br />\nwhich the Garnet captured first and<br />\nActual work will not begin until<br />\nMay 6—University of Mary- \"Wilson won the war, he did not<br />\na hard fight last Thursday to second.<br />\nup<br />\nIn the latter event, espeiose it,\" said Dr. Wise, and he de- the first week after exams. At this<br />\nland.<br />\nwin from Johns Hopkins by the cially, the<br />\ncandidate's<br />\ntime<br />\nBlack and Blue was out-a<br />\nmeeting<br />\nwar.<br />\nWilson<br />\nthe<br />\nentered<br />\nwill<br />\nbe<br />\nthat<br />\nclared<br />\nMay 10—Navy (at Annapolis).<br />\n497-490. This speaks well classed<br />\ntaking America with him, and held and the exact work to be ac- score of<br />\nand<br />\nshowed dire need of<br />\nMay 13—Western Maryland.<br />\ncomplished will be outlined by Dr. for Hopkins, as Yale is supposed new material.<br />\nRabbi<br />\nbeThe<br />\nthings.<br />\ngreat<br />\ndid<br />\nMay 20—St. John's.<br />\nThe team was somewhat handiItaly, Van Orman, the official censor of to have the best team in the counMay 27—Delaware (at New- lieves that \"the people of<br />\ntry. Yale has already defeated capped<br />\nthe<br />\nBelgium<br />\nBoard.<br />\nby the absence of two of<br />\nand<br />\nEngland<br />\nFrance,<br />\nark).<br />\nIowa State University and Univer- its stars, Capt.<br />\nPaul Buhrer and<br />\nterand<br />\ndark<br />\nthe<br />\nof<br />\nthe<br />\ntest<br />\nstood<br />\nJune 3—Haverford.<br />\nsity of Maine, and finished third in \"Bob\" Hall,<br />\nwho were unable to<br />\nrible days of the German cruelties SOPHOMORE PROM<br />\nPOSTPONED the National Rifle Association meet<br />\nparticipate because of scholastic<br />\nof war because they had trust and<br />\nUNTIL SPRING<br />\nin December.<br />\ndifficulties.<br />\nman—Woodrow<br />\none<br />\nconfidence in<br />\nIt was recently decided by the<br />\nThe individual scores in the Yale<br />\nMUSICAL CLUB TO TAKE PART IN Wilson, who was the representative<br />\nThe next meet is pending for<br />\nSoph- shoot were as follows:<br />\nASSEMBLIES<br />\nFebruary 4 and the big meet with<br />\nof America, the nation that was in committee in charge of the<br />\nThe Musical Club will, in the the war to make the world safe for omore Prom to postpone that affair<br />\nRuoff, 99; Mount, 99; Salter, Lehigh is scheduled for<br />\nSaturday,<br />\nfuture, be a feature of the weekly freedom and democracy. Wilson until after the Spring vacation. It 98; L'Allemand, 97; Sherwood, 97: 'February 11, at the B. A. C. pool.<br />\nstudent assemblies. It was decided was the leader of the allied forces had been previously announced Ross, 97; Wilgis, 95; Virdin, 95; Summary:<br />\nat their last meeting that the club<br />\nRelay—Won by Johns Hopkins<br />\nin 1917 and 1918 for he welded to- that the second year men would Gustafson, 95; Cochran, 92.<br />\nWas not accomplishing enough<br />\nThe five highest scores were used (Rowland, Coady, Morrell and<br />\ngether united peoples, and placed have<br />\ntheir \"hop\" after the mid-year to determine the total score of the<br />\nPublic work about the school, them in the hands of one who could<br />\nJohnston). Time, 1.53 3-5.<br />\nexaminations,<br />\nbut, owing to the<br />\nand it was proposed to put on<br />\nFancy Diving—Won by Baxter,<br />\nlead them to victory, namely, Mar- large number of affairs to be held match. The members of the Yale<br />\nsome program at each Assembly.<br />\nteam are: J. W. Clise, captain; W. Swarthmore; Baker, Swarthmore,<br />\nshall Foch.\"<br />\naround this time, the postponement W. Baker, T. G. Bennet, W. H.<br />\nThis will not only create a greater<br />\nsecond; Coady, Johns Hopkins,<br />\n\"After the war, Italy failed him. was announced in order that those<br />\nMeyer, R. W. Schlesinger, W. R. third.<br />\ninterest in the club on the part of<br />\nFrance weakened toward him, and who expect to attend may have a<br />\nthe student body, but it will also<br />\nBriggs, K. T. Redick, C. P. Wil50-Yard Dash—Won by CrownEngland became doubtful of Wil- cl-.ance to recuperate financially.<br />\n'flake the assemblies more attracliams, Jr., S. W. Seward, S. H. over, Swarthmore; Baker, Swarthson, because America failed their The affair will be formal and will<br />\ntive by way of diversion, thus fillLanahan, and R. T. Lowndes.<br />\nmore, second; Johnston, Johns<br />\nPresident,\" declared the speaker. not be closed to the Sophomore<br />\nCapt. McMurray is pleased with Hopkins, third. Time, 282-5.<br />\ning a long existing gap in the proDr. Wise said that the vile and un- Class.<br />\ngra m of these meetings.<br />\nthe showing that the team made<br />\n50-Yard Back Stroke—Won by<br />\njust newspaper reports that filled<br />\nimmediately<br />\nposted<br />\nroll<br />\nwill<br />\nbe<br />\nA<br />\nand was particularly pleased by the Hambleton, Johns Hopkins; Lord,<br />\nThe feature at last Thursday's the<br />\npress at Paris in the winter of after the completion of the midfact that Hopkins score was one Johns Hopkins, second; Bonsall,<br />\nAssembly was a song by the club's<br />\n1919 came from America and were year examinations, and all Sopho- point<br />\nmore than that made against Swarthmore, third. Time, 40 3-5.<br />\nccluartette, which is composed of<br />\nwritten by Americans, while our<br />\njimmy\" Harwood, first tenor; I'resident was in a strange land mores are requested to sign this University of Maine. He feels that 220-Yard Dash — Won by<br />\npromptly in order that a complete the team is running in good shape Crownover, Swarthmore; Coady,<br />\n:‘Ted\" Morrison, second tenor;<br />\nnegotiating for America. At Paris, personnel of the class may be acanr.1 s':onfirlent that our defeat by Johns Hopkins, second; Lord,<br />\n:Jack\" Croker, first bass, and<br />\nContinued on Page 4, Col. 4<br />\n'Yale will be the only one.<br />\nquired.<br />\n'Johnny\" Sherwood, second bass.<br />\nContinued on page 3, col. 1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 26, 1922<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nSTUDENT COUNCIL TO PUBLISH ITS TRIALS<br /><br />\nFOUNDED 1897.<br /><br />\nHope to Remove Air of Mystery from<br />\nProcedure.<br />\n$2.60<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22.<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LILTS, '22.<br /><br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD,'23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nCRAIG E. TAYLOR, '24.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIM3RE, MD., JANUARY 26, 1922<br /><br />\nRABBI WISE<br />\nWhatever may have been the sentiments and opinions of the<br />\nstudents who heard Rabbi -Wise last Thursday, they could not fail<br />\nto have been impressed and interested. The privilege of hearing a<br />\nspeaker of Rabbi Wise's ability is seldom given a student body, for<br />\nfew such men are in the country.<br />\nRabbi Wise well defended his reputation as one of the foremost<br />\norators in America, holding the attention of his audience from first<br />\nto last. We believe that the speaker who can hold the interest of a<br />\ncollege audience is a genuine orator and we take this opportunity of<br />\npaying our respects to Rabbi Wise and our thanks to Dr. Latane for<br />\nprocuring such an interesting and able man,<br /><br />\nA WORTHY ALUMNUS?<br />\nThe following letter has been received from an alumnus in reply<br />\nto the circulars recently sent out by the News-Letter:<br />\n\"Dear Sir:<br />\nReferring to your circular,—the reason you have not<br />\nheard from me ;s that I have thrown your paper into the<br />\nwaste basket unopened, consequently did not see any of the<br />\nnotices you sent me.<br />\nI do not care for the paper.<br />\nVery truly yours,<br />\nWhen we adopted the policy of putting a number of alumni on<br />\nthe mailing list this fall, we made no effort to force them to accept<br />\nthe publication. We simply took this means of bringing it to their<br />\nattention with the hope that they would be sufficiently interested in<br />\nthe rapid development of the University to subscribe.<br />\nWe do not object to the writer not caring for the paper, but we<br />\ndo object to his having thrown it \"into the waste basket unopened.\"<br />\nWe believe that such action on his part shows a deplorable lack of<br />\ninterest in his Alma Mater, and for that reason we question his value<br />\nto the University as an Alumnus.<br />\nAfter all, is the man, who receives his education from the University at a fraction of its actual cost, who receives the privilege of<br />\nbeing its representative and yet who,in after years, does not even take<br />\nsufficient interest to open a copy of his college paper, worthy to be<br />\non the Alumni roll of that institution?<br /><br />\n\"Dick\" Wood announces that in<br />\nthe future the trials conducted by<br />\nthe Student Council, if any shall<br />\nhe found necessary, will be given<br />\ndetailed publication, omitting only<br />\nthe names of the men accused of<br />\nmisdemeanors. It is thought that<br />\nthis will throw light on the actual<br />\nses of such cases and also on<br />\nDff<br />\nthe procedure of Council, and help<br />\nto offset the air of mystery which<br />\nhas seemed to envelop the actions<br />\nuf the Council in the past.<br />\nWith regard to the Honor System, an intensive campaign of education is to be waged from now<br />\nup to examination time, with the<br />\nend in view of making the system<br />\nso plain that no misunderstandings<br />\nwill be possible. At the coming assembly, which is to be dedicated in<br />\nits entirety to this work, Mr. Christy and other speakers will address<br />\nthe student body, and it is more<br />\nthan important that everyone be<br />\npresent, since the honor of the University seems to be compromised in<br />\nthe question of the success or failure of the Honor System (although<br />\nwhat grounds there are for the idea<br />\nthat it has failed are beyond imagination). It is hoped, therefore,<br />\nthat the assembly will be marked<br />\nby a full attendance to show, if<br />\nnething else, that the student body<br />\nis heartily in favor of the Honor<br />\nSystem.<br />\nShort talks in the various classes<br />\nexplanatory of the system are to be<br />\ngiven also as parts of the campaign<br />\nto clarify once and for all this matter of the working of the Honor<br />\nSystem.<br /><br />\nALUMNI!<br />\nPay Your News-Letter<br />\nBills<br />\nBOXING TEAM PROSPERING<br />\nDESPITE DIFFICULTIES<br /><br />\nLACROSSE PRACTICE TEMPORARILY SUSPENDED<br /><br />\nHow can a boxing team thrive<br />\nwithout some adequate place in<br />\nwhich the \"knights of the squared<br />\ncircle\" can pair off? At present<br />\nthat is the big question which is<br />\ntroubling \"Bob\" Marino, to whom<br />\nHopkins is indebted for the recent revival of boxing.<br /><br />\nAs Hopkins has planned a very<br />\nextensive lacrosse schedule for this<br />\nyear, the most important thing at<br />\nthis time is for all members of the<br />\nteam, as well as the candidates, to<br />\nkeep their names off the black list.<br />\nIn order that such may be the case,<br />\npractice has been suspended until<br />\nafter the mid-year exams.<br />\nA meeting of. the team was held<br />\non Monday, January 16, at which<br />\ntime Coach Johnny Knipp emphatically urged the \"snow shoers\" to<br />\ncome through the exams with flyii:g colors, and also heartened the<br />\nmen by telling of the excellent prospects which Hopkins has for a banner season this year.<br /><br />\nFor some time past an effort has<br />\nbeen made to secure as a boxing<br />\nroom the old gym. located behind<br />\nthe Hopkins Club.<br />\nAll attempts<br />\nhave proven fruitless, as the gym.<br />\nis pretty well filled up with geological specimens for which no other place can be found. \"Bob\" just<br />\ncan't see why the manly art should<br />\nsuffer because of a few rocks but<br />\nsuffice it to say that he and Dr. weights, and there are openings<br />\n'Thercrombie are making every pos- for some of the huskies.<br />\nsible effort to secure a suitable inIt is not at all necessary that the<br />\ndoor place.<br />\ncandidates be experienced, as it is<br />\nAt present the candidates are do- not purposed to enter any intercoling vigorous track work to con- legiate matches this year. The idea<br />\ndition them for the real training is to take the men at this time, teach<br />\nwhich will commence after the ex- and train them, so that next year<br />\nams. About twenty-five or thirty they will know the fine points of the<br />\ncandidates have responded to the game, nd then a schedule will be<br />\ncall, and among them there is some arranged.<br />\nSENIORS DEFEAT JUNIORS IN very promising material. There is,<br />\nActive work will begin FebruANNUAL DEBATE<br />\nhowever, a great lack of heavy- ary 6.<br />\nDebate is Followed by Informal Dance.<br />\nMusic Furnished by Undergraduate<br />\nJazz Orchestra.<br /><br />\nThe twenty-fifth annual Adams<br />\nDebate between the Junior and<br />\nSenior classes, held in the C. E.<br />\nHall last Saturday night, was won<br />\nby the Class of 1922. The contest<br />\nwas an unusually close one as th.c.;<br />\nvictors gained the decision by the<br />\nmargin_of one vote, two judges declaring in favor of the Seniors,<br />\nwhile one voted for the Junior<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nteam. Dr. John C. French presided. while Messrs. Jesse SlingINSTRUCTION<br />\nff, Ralph F. Proctor and Thomas<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\nj Tingley, '16, acted as arbiters.<br />\nof Philosophy.<br />\nThe subject for debate was: \"ReMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nsolved, That the United States<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nGovernment should own and operDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nate the coal mines of the country.\"<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nThe Senior team, which upheld the SCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\naffirmative, was composed of R.<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nDorsey Watkins, Edward L. PotPublic Health.<br />\nzel and Adolphus D. Emmart, COLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nwhile Parker C. Williams, Harold SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nor of Science. Also for graduates in Medicine.<br />\nBreslau and Raymond W. Cooke<br />\ncomposed the negative, which rep- EVENING COURSES in Business Economics and for Technical Workers.<br />\nPHYSICAL TRAINING NOTICE<br />\nNEW BLACK AND BLUE JAY OUT<br />\nresented the Class of 1923.<br />\nTHIS WEEK<br />\nThe class in Physical Training<br />\nThe opening argument for the<br />\nThe third issue of the Black and has suspended its outdoor work and<br />\nwas made by Edward JOHNS HOPKINS PRESS PUBLICATIONS.<br />\naffirmative<br />\nBlue Jay will be out the first part<br />\nis now taking a course in hygiene, L. Putzel, who presented in a clear STATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nof this week. It will be called the<br />\nconcise manner the difficulties<br />\nBUILDINGS<br />\n\"Wise Guy\" number. According which will last throughout the win- and<br />\nand disproduction<br />\nthe<br />\nin<br />\narising<br />\nmonths.<br />\nDr.<br />\nter<br />\nAbercrombie<br />\ndecopy,<br />\nthe<br />\nclass rooms, biology, administration.<br />\nlibrary,<br />\nseen<br />\nto those who have<br />\nGILMAN HALL—general<br />\npresent<br />\nunder<br />\ncoal<br />\nthe<br />\nof<br />\ntriution<br />\npublished.<br />\never<br />\nlivers a lecture three times a week<br />\nit will be the best<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and Coland<br />\nownership,<br />\nprivate<br />\nof<br />\nsystem<br />\nlege Chemistry.<br />\nThe fourth issue will be put out on some part of the human anatof<br />\nfunctions<br />\nthese<br />\nthat<br />\nasserted<br />\nCIVIL ENGINEERING—housing also Geology.<br />\non an entirely different idea than omy. All first and second year stubetter<br />\nbe<br />\nwould<br />\nindustry<br />\ncoal<br />\nthe<br />\nPOWER HOUSE.<br />\nany of the former numbers. A re- dents, who are not excused, must<br />\nownergovernment<br />\nunder<br />\nexecuted<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nquest will be sent to Goucher, attend these lectures. So far the<br />\nship.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nEastern High, Western High, following lectures have been defirst<br />\nthe<br />\nCooke,<br />\nRaymond<br />\nW.<br />\nPHYSIOLOGICAL BUILDING.<br />\nPolytechnic, City College, Notre livered:<br />\nnuegative speaker, held that it ANATOMICAL LABORATORY.<br />\nDame and several other schools in<br />\nJanuary 9—The Structure of the would be impossible for the govHUNTERIAN LABORATORIES.<br />\nthe city to contribute drawings, Human Body.<br />\nernment to purchase the coal re- PATHOLOGICAL LABORATORY.<br />\njokes, stories and literature.. The<br />\nJanuary 13—The Heart.<br />\nsources of this country, as the cost SCHOOL OF HYGIENE.<br />\nBlack and Blue Jay staff expects<br />\nwould be many times our present CARROLL MANSION—Johns Hopkins Club.<br />\nNerJanuary<br />\nCentral<br />\n16—The<br />\nto get sufficient material from<br />\ndebt. Private enterprise. STUDENT ACTIVITIES BUILDING.<br />\nnational<br />\nthese sources to fill an entire vous System.<br />\nwilling to pay competent<br />\nis<br />\nsaid,<br />\nhe<br />\nJanuary 18—The Physiology of<br />\nnumber. This issue will appear<br />\nContinued on page 4, col. 2<br />\nthe Digestive Tract.<br />\nabout the first of April.<br /><br />\nThe Johns Hopkins<br />\nUniversity<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 26, 1922<br /><br />\n!ry<br />\nhis<br />\nat<br />\nthe<br />\nto<br />\nist.<br />\nse,<br />\nitil<br /><br />\nld<br />\nch<br />\natto<br />\nlyhe<br />\n3sLn-<br /><br />\no-s<br /><br />\nhe<br />\nis<br />\n31ea<br />\nch<br />\nar<br />\nhe<br />\nbe<br />\nu-<br /><br />\nor<br /><br />\nD1-<br /><br />\nTANK MEET LOST TO QUAKERS SIGMA CHI BETA DANCE ON<br />\nContinued from page 1,<br />\nMARCH THIRD<br />\nJohns Hopkins, third. Time, 2.53. To Be First of Series Given by the<br />\nHonorary Society.<br />\nPlunge for Distance—Won by<br />\nAt a meeting of Sigma Chi Beta<br />\nHambleton, Johns Hopkins; Bliss,<br />\nClark, Friday, definite plans were made<br />\nSwarthmore,<br />\nsecond;<br />\nSwarthmore, third. Distance, 61 for a dance to be given Friday,<br />\nfeet (breaking Hopkins record).<br />\nMarch third. The committee ap100-Yard<br />\nDash — Won<br />\nby<br />\npointed is R. Hall (chairman),<br />\nCrownover, Swarthmore; MorJohn<br />\nDubbleday and H. Forerell, Johns Hopkins, second; Baker,<br />\nSwarthmore, third. Time, 1.3 3-5. graves and they will immediately<br />\nmake arrangements for securing<br />\nHULLABALOO \"MARKING TIME\"<br />\nL'Hirondelle Club for the purpose.<br />\nWork on the Hullabaloo is at the<br />\nSigma Chi Beta has adopted a<br />\npresent time very quiet because of<br />\nthe closeness of the exams. Most new policy which they hope will,<br />\nof the individual pictures for the in future years, be of advantage to<br />\nyear-book have been finished and the university. Their plan is to<br />\nthose which are still incomplete are give two or three dances a year,<br />\nbeing taken as rapidly as possible. to which the desirable members of<br />\nAfter the examinations, group pic- the graduating classes of the<br />\ntures will be taken and the Hulla- city's \"prep\" schools will be inbaloo will enter upon the home- vited. Sigma Chi Beta is made up<br />\nof men who have gained promistretch.<br />\nnence on the campus, and it is<br />\nthought<br />\nthat they can influence<br />\nLIBERTY<br />\nthese \"prep\" school boys to come<br />\nExpert Cleaners and Dyers<br />\nto Hopkins. 0. D. K. works for<br />\nSpecial Rates to Hopkins Men<br />\nthis same end by a series of lec211 E.25th St.<br />\nHomewood 5205-W tures on Hopkins throughout the<br />\nstate. To this effort Sigma Chi<br />\nBeta is endeavoring to add their<br />\ninfluence. This plan has received<br />\nLunches, Cigars<br />\nthe endorsement of prominent<br />\nCigarettes<br />\nprofessors in many departments<br />\nof<br />\nthe University.<br />\nCandy, Soda and<br />\nThe new men, whose names<br />\nPipes and Fountain Pens were passed on several weeks ago,<br />\nwere pledged by Sigma Chi Beta<br />\nAt the Barn<br />\nyesterday.<br /><br />\nE. E. Adams<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nNECKWEAR<br /><br />\nSHIRTS<br /><br />\nLefranc &amp; Ault<br />\n421 N. HOWARD ST.<br />\nGLOVES<br />\nHOSIERY<br />\nSHIRT MAKER<br />\nLiberty St.<br />\n226<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on<br /><br />\nSTRATTON<br /><br />\nShirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nEstablished 1873<br /><br />\nA.H.Fetting Man'fg Jewelry Co.<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />\n3<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nClothes if Cusiom<br /><br />\n14 N.Charles Street<br /><br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br /><br />\nSOMETHING WRONG SOMEWHERE?<br /><br />\nEditor of News-Letter,<br />\nDear Sir:<br />\nWe are establishing a new standard in<br />\nWhen affairs reach such a state<br />\nthat a professor in English reYoung Men's Suits at $29.50<br />\nfuses to place on reserve a valStyles for every taste.<br />\nuable book with the explanation<br />\nthat \"they are already too scarce,\"<br />\nthe Secretary of the Y. M. C. A.<br />\nBaltimore's Best Store<br />\nwrites to the News-Letter complaining of the petty theft of some<br />\nHOCHSCHILD.KOHN 8c CO.<br />\nboard covers intended for use on<br />\nthe magazines there, and an instructor in philosophy is found to<br />\nremonstrate with his class over<br />\nthe carrying away of not one, but<br />\nseveral of the text books bought<br />\nby the University especially to<br />\nsave the purchasing of them by<br />\nall the members of the class, when<br />\nthis is the case, every right-minded student will agree that someSend for catalog describing over 400 courses in History, English,<br />\nthing is amiss, to put it mildly.<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nIt is not, and should not be, a<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\nhow credits earned may be applied on present college program.<br />\ncharacteristic of the real college<br />\nman to commit filchings of this<br />\n30th<br />\nnature. A man that would play a /<br />\n1<br />\n4<br />\nHOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nYear<br />\ntrick of that kind does not belong<br />\nin college. If apprehended, there is<br />\nSOCIAL SCIENCE CLUB NOTICE<br />\nno doubting that he would be<br />\nMr. James O'Connell, president summarily dismissed. Let the<br />\nof the Metal Trades Department of<br />\nContinued on page 4, col 2.<br />\nthe American Federation of Labor,<br />\nwill address the Social Science Club<br />\nMHOUSANDS of smokers have proved it—and now give the verdict<br />\noday.(Tuesday, January 23). The<br />\nto you<br />\nall the other tobaccos NATURE has produced—none<br />\nmeeting will be held at quarter<br />\ncan<br />\nEngineering<br />\napproach<br />\nthe<br />\nCivil<br />\nfinest varieties of pure Turkish for cigarettes—<br />\npast four in the<br />\nshop<br />\nopen<br />\nHall. Arguments for the<br />\nNone has the delicious<br />\nwill be brought up at a future meetFLAVOR<br />\nofthefinestTurkish—<br />\ning.<br />\nThe Club is planning to have<br />\nNone gives the ENJOYseveral lectures on the open and<br />\nMENT ofthe finest Turkish—<br />\nclosed shop. These will be held in<br />\nNone will SATISFY you as<br />\nthe C. E. Hall, one in January<br />\nand one in February. Emil Smith,<br />\nwill the finest Turkish—<br />\nsecretary of the club, is corNone but the highest grade<br />\nresponding with several promL.<br />\nand<br />\nhe<br />\ninent men of the A. F. of<br />\nand personally selected<br />\nhopes to have one of them deliver<br />\nTurkish tobaccos is used in<br />\nthe lecture on the closed shop. The<br />\nMURAD.<br />\nclub will not hold any more meetings until after the mid-year examTo enjoy 100% pure Turkish<br />\ninations.<br /><br />\nSHE HURT HER FEELINGS<br />\nHe—\"Where did you do most of<br />\nElkridge Farms Dairy<br />\nyour skating when you were learnSTRICTLY FRESH MILK<br />\ning?\"<br />\nProduced, Pasteurized and Bottled<br />\nShe—\"I think you're horrid.\"—<br />\nCounty<br />\nHoward<br />\nin<br />\nOctopus.<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nq Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nDo You Need Extra Courses?<br />\nZhr liniurrsityut atigragrt<br /><br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br />\nMURAD—<br /><br />\nS. ANARGYR0S.<br /><br />\nTry MURAD today and<br />\n\"Judge for<br />\nYourself—!\"<br /><br />\n20c<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDRAPERIES<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\n!n.<br /><br />\nBONDS<br /><br />\nENVELOPES<br /><br />\nLEDGERS<br />\nak.To.mcgcmisdo,<br /><br />\nlEisttandik.s..amildi<br /><br />\nThe W. H Moore, Jr. Paper Co.<br />\n205 W.CAMDEN STREET<br /><br />\nTHE JOHNS HOPKINS NEWS-LET rER, JANUARY 26, 1922<br /><br />\n4<br /><br />\nBIBLE CLASSES POPULAR IN not more than five to twelve cents<br />\nper ton.<br />\nNORTHERN COLLEGES<br />\n(THE BOOK MART)<br />\nHarold Breslau, in his negative<br />\nHopkins Y. M. C. A. Discussion Groups<br />\nComplete Stock of<br />\nto Meet After Exams.<br />\nrebuttal, gave statistics to show<br />\nMedical Books and College<br />\n\"The University of Pennsyl- that the margin of the operators'<br />\nRequisites<br />\nvania had more than fifty Bible profit is very small. During the<br />\nImporters and Dealers in Fine Books groups last year, with an enrollwar, when the mines were under<br />\n301 N. CHARLES ST.<br />\nment of 1,500 and an average at- the supervision of the government,<br />\nBaltimore, Md.<br />\ntendance of 1,000.\" This statement coal was more difficult to get than<br />\ncoming to the local \"Y\" office this ever before.<br />\nweek gives an idea of the work of<br />\nIn closing the debate with the<br />\nthe student \"Y's\" along this branch affirmative rebuttal, R. Dorsey<br />\nof service.<br />\nWatkins said that the government<br />\nAmong other colleges the fol- would be able to mine and distriblowing information upon the forma- ute coal to the public at one-half<br />\ntion of Bible study groups is avail- the present price, and at the same<br />\n: Wesleyan (Conn.), 150 out time give the miners a wage inG.1-5s<br />\nof 180 freshmen were enrolled: crease of fifty cents a ton. He enH.N, OSCAR<br />\n,OWNEIRS<br />\nBates, 10 classes, 8 of which are deavored to refute the argument<br />\n°<br />\ned by students, with an enroll- that government ownership was in2%it41/3,0\"\"lec--4 OP<br />\n29 Baltimore St., East<br />\nment of 101; University of Maine, efficient, and held that it would be<br />\nOne Door West of Light St.<br />\n10 classes, consisting of 167 stu- more satisfactory, both to the pubSOLE AGENTS FOR BALTIMORE<br />\nlents ; Yale, 20 group leaders in lic and the operatives.<br />\nFor College Fraternity Bands<br />\nSocieties)<br />\n(Greek Letter<br />\ntraining; Brown, 12 groups, with<br />\nAfter the debate the chairs were<br />\nan enrollment of 125; North Caro- removed for an informal dance,<br />\nThe Chas. Willms Surgical<br />\nlina State, 32 groups, with an en- NN,hich lasted until twelve. Music<br />\nInstrument Co.<br />\nrollment of 350; and Iowa State was furnished by the University<br />\nsoo N. HOWARD ST., Baltimore, Md.<br />\nCollege, 74 groups, with 4 normal Jazz Orchestra.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\ntraining classes, having an attendStethoscopes<br />\nBlood Lancets ance of 700 to 800 students.<br />\nBlood Counters<br />\nAmong the leaders of these groups<br />\nare ministers, student pastors, association secretaries and senior<br />\nPrinters of Philological and<br />\nstudents.<br />\nScientific Works<br />\nInterest became markedly more<br />\n23 S. HANOVER ST.<br />\nwidespread at the Lake Forest AsBaltimore, Md.<br />\nsembly of College \"Y's\" last September, when the following principle, among a host of others, was<br />\nadopted: \"The function of Bible<br />\nstudy is to increase the knowledge<br />\nand interest in Jesus and His cause<br />\nfor the purpose of securing Christ:an living and Christian social conditions.\"<br />\nAfter the exams the Hopkins Y.<br />\nC. A. will again hold its Bible<br />\nM.<br />\n17 E. Baltimore St.<br />\nstudy classes and discussion groups.<br />\nAn unusual interest was shown in<br />\nthe class the first term, even though<br />\nthe short period of time prevented<br />\nPrinters of the<br />\nextensive discussion upon various<br />\n-Letter<br />\nJohns Hopkins News<br />\npoints which were brought up for<br />\nthe leader's consideration. The<br />\nname of the leader and the time and<br />\nplace for the class will be announced in a short time, probably<br />\nthe first of February.<br /><br />\nThe Medical Standard Book Co.<br /><br />\ntr-tbv<br /><br />\n-4mts<br /><br />\nUNIVERSITY BAND TO PLAY AT<br />\nARMORY TRACK MEET<br />\nThe Band will play at the track<br />\nmeet in the Fifth Regiment Armory on the twenty-fifth of February. Emil Smith is working very<br />\nhard in order that the Band may<br />\nbe in good shape on that day. At<br />\nthe rehearsals they are working<br />\non a new overture called \"Lustspiel\" and also some new popular<br />\nmusic in addition to several wellmarches. The Band is<br />\nknown<br />\nWOODROW WILSON<br />\nContinued from page 1, vol. 2<br />\ngreatly handicapped, however, as<br />\nWilson was not supported by his the men will not turn out regown people, but was undermined ularly and promptly on Mondays<br />\nand betrayed, so how could leaders at the rehearsals.<br />\nof foreign nations look up to him.<br />\nThe rascals who did this mean and his name will stand in the anwork set out to destroy a man and nals of history with that of Washthey nearly shattered the pillars of ington, Lincoln and Roosevelt.\"<br />\nthe temple of peace, and really ton, Lincoln and Roosevelt.\"<br />\nmade the man, Wilson, live.<br />\nENUF IS ENUF<br />\nDr. Wise closed his address by<br />\nstating that a politician meets a<br />\nMrs. Pasch—\"Mildred, I wish<br />\nman on his lowest level.; a statesman you would send :Vic home.\"<br />\nreaches out and leads men to the<br />\nMildred—\"I will after a second.\"<br />\nhighest level—Wilson was a statesMrs. P.—\"No, one is enough.\"—<br />\nman. \"History will sustain him Teaser.<br /><br />\n\"DICK\" HOLMES MARRIED<br />\nIt was recently announced that<br />\nRichmond B. Holmes, otherwise<br />\nknown as \"Dick,\" ex-'22, who left<br />\ncollege last June to embark on a<br />\nbusiness career, had been married.<br />\nThe lucky bride is Miss Lelia B.<br />\nTall, of Fairmont, Walbrook.<br />\n\"Dick\" will be remembered as a<br />\nstar attack man on last year's lacrosse twelve.<br /><br />\nSWIMMING MEET WITH LEHIGH<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nfollowed by<br /><br />\nA DANCE<br /><br />\nFEBRUARY 11.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nB. A. C.<br /><br />\nALL OUT<br /><br />\nTickets at Andy Landy &amp; Co.<br /><br />\ntrnosphere—<br />\nti<br /><br />\nMAILBAG CONTINUED<br />\nContinued from page 3,cal. 3<br /><br />\nCollege Literature<br /><br />\nguilty one, therefore, (or are<br />\nthere possibly several?) discontinue his practice if he wishes to<br />\nkeep his name clearer than his<br />\nconscience.<br />\nR. S. P.<br /><br />\nThe subtle something that<br />\nmakes your college different<br />\nfrom any other, and dearer<br />\nto you,than all the rest combined. In cigarettes, it's the<br />\nsignal success that makes so<br />\nmanycollege men ofdiscrimination prefer Melachrino,<br />\nthe one cigarette sold the<br />\nworld over.<br /><br />\nLOMBARD and SOUTH STREETS<br />\nSENIOR JUNIOR DEBATE<br />\nContinued from page 2<br /><br />\nSHOES<br /><br />\nment would pay them only a nomfor<br />\ninal sum. He gave several examples of the failure of government<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear ownership in the past and said it<br />\nwould create delay and inefficiency,<br />\nSmart Styles—Best Leathers<br />\nresult in \"passing the buck\"<br />\nand<br />\nModerate Prices<br />\nto higher officials.<br />\nAlbert E. Dimond, the second affirmative speaker, gave a plan for<br />\nthe transfer of the mines to gov19 W. LEXINGTON ST.<br />\nernment control by means of stock<br />\nand bond subscriptions. He mainained that this plan would put an<br />\nend to the continual war between<br />\n\"College\" isn't labeled<br />\nthe owners and operatives.<br />\non our clothes, but<br />\nThe second presentation speaker<br />\nthe college spirit is for the negative, Parker C. Wilthere never-the-less in liams, asserted that the plan would<br />\ncreate an enormous government anevery line.<br />\nnual trust, which he characterized<br />\nas socialistic and un-American. He<br />\npointed out that at present the opBaltimore and Hanover<br />\nerator gets an average profit over<br />\nand above all expenses of from<br /><br />\nWYMAN<br /><br />\nIsaac Hamburur and Sons<br /><br />\n•<br /><br />\nmen adequately, while the govern-<br /><br />\n•<br /><br />\n..4.<br />\n„<br />\n,............41010.....•<br />\n...<br />\n...7e,<br /><br />\n.....<br />\n..,...'<br />\n...No.....;.........*.<br />\n,1;<br />\n1'<br />\n,<br />\n\"e\"n4A.. '<br />\n''<br />\n......<br /><br />\n-.0\"<br />\n.<br />\n..<br />\n\",..<br />\n.<br />\nic.. %*\". ..<br />\n.i..,..<br />\n'<br /><br />\n...•<br /><br />\nl'e'37\"41:7<br />\ni<br />\n.<br />\na.-7.••-•<br />\nite<br />\n7<br /><br />\n4:Z;.:-.--.<br /><br />\n..<br />\n. ......,<br />\n,<br />\n-,.,......„-... *<br />\n..34.........,..„,........,........-<br /><br />\n.y.,<br />\n'..<br />\n,.<br />\n.\"<br />\n..\"'..<br />\n...n,....\"<br /><br />\nCo.?<br />\n'<br />\n....1i=Z;uftosa••••••,..,. ....<br /><br />\n:Igt<br />\n2,,<br />\n)<br />\nF11.1A74<br /><br />\nRemember that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino—it's right<br /><br />\nelachrino<br /><br />\n\" The Cigarette Elect of All Nations\"<br /><br />\nV<br /><br />\n1.<br /><br />\nfi<br /><br />\na<br /><br />"}], "field_media_file": [{"target_id": 37581, "display": null, "description": null, "target_type": "file", "target_uuid": "a83556d4-0d88-48a2-b693-7cd020eabd50", "url": "http://digital.library.jhu.edu/system/files/2022-03/12980-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12980, "target_type": "node", "target_uuid": "953b0887-ea69-45f2-aa2a-2873e925122b", "url": "/node/12980"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "58e6c42e-b183-48a9-9ba6-6b205e43a443"}]}