{"mid": [{"value": 36967}], "uuid": [{"value": "121193bb-5a72-4afb-bfe2-8cb5688fc041"}], "vid": [{"value": 36967}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13117-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No XI<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 1, 1924<br />\n<br />\nSEASON TICKET CAMPAIGN FORMAL OPENING OF TU- ADVENTURES IN CANADIAN<br />\nWILDS RELATED BY<br />\nDOR AND STUART ROOM<br />\nEXTENDED UNTIL<br />\nMR. BAETJER<br />\nTOMORROW<br />\nAPRIL 5<br />\nReturns Far Short of Necessary $4,500. Out of Town Members Will Attend Tea. Interesting Lecture Supplemented by<br />\nPhotographs of Wild Animals.<br />\nMany Will View Richly Furnished<br />\nGraduate Manager Keyes Shows<br />\nPraises Out-of-doors<br />\nRoom for First Time<br />\nSeriousness of Situation<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBARNSTORMERS PRODUCTION OF<br />\nTHE GALLOPER\" WELL RECEIVED;<br />\nWALTER B. SWINDELL HONORED<br />\nLarge Audiences Greet Maiden Effort of Barnstormers Club<br />\n<br />\nTo encourage men to seek the<br />\nThe formal opening of the room<br />\nEnthusiastically<br />\nout-of-doors, Mr. Edwin<br />\ngreat<br />\nof the Tudor and Stuart Club, sitCriticism of the Play Will Be Found on Page 3, Column .2<br />\nuated in Gilman Hall on the third Baetjer, at the Assembly last<br />\nThursday, told of his own experiGalloper,\" Richard Harding Davis' famous farce, was<br />\n\"The<br />\nfloor, will take place tomorrow<br />\nences. His talk was interesting, presented by the Johns Hopkins Barnstormers Club to appreciative<br />\nafternoon in the form of a tea, to not only to the biologist but to<br />\naudiences at the Lyric last Friday and Saturday nights. R. F. Pasence between $850 and $4500, the be poured by Mrs. T. B. Futcher, everyone, as he included in it sano played the male lead, \"Copeland Schuyler,\" and Mortimer Slatmany exciting accounts of his kin portrayed the role of \"Grace Whitney\", the female lead.<br />\nsum that is absolutely necessary of New York.<br />\nMrs. Futcher is the niece of Sir hunts and discoveries. Among<br />\nin order that the Athletic AssoThe presentation of this farce constitutes the annual production<br />\nthree of the Club. The production approached an all-Hopkins one. Davis<br />\nciation may overcome its ex- William and Lady Osler, the par- these was an adventure with<br />\nin his was himself a student at the University for a short time. The heroents of the late Edward Revere bears. With but one rifle<br />\npenses.<br />\nentire party, he was attacked by ine of the play, \"Grace Whitney,\" is a trained nurse from the HopRealizing that the sale of the Osier, who was killed in the three grizzlies, a female and two<br />\nkins Hospital. All parts, male and female, were taken by Hopkins<br />\nBarnstormers' tickets was serious- World War, and to whose mem- cubs, infuriated by the human instudents. The scenery was designed and executed strictly on the<br />\nly interfering with its own drive, ory the room is dedicated.<br />\nvasion. He managed to kill the Hopkins campus. Walter B. Swindell, who coached the play, is a<br />\nTea will be served from three large female but not until she had Hopkins graduate, class of '01.<br />\nthe Athletic Association extended<br />\nthe close of the drive to Saturday, to four and from four to six in the avanced within ten feet of him.<br />\nDuring the first intermission,<br />\nThe cubs immediately retreated<br />\nApril 5, in order that those men afternoon. From three to four all<br />\nVARSITY LACROSSE SQUAD on the opening night, Mr. Swinat sight of their mother's fate.<br />\ndell received a public recognition<br />\nANNOUNCED BY COACHwho were spending their spare club members both in and out of<br />\nMr. Baetjer, who is a Baltiof<br />\nhis services to the Club. In<br />\nING COMMITTEE<br />\ntime in selling Barnstormer tick- town, trustees, and special friends morean, explained that he made<br />\nfront<br />\nof the curtain, he was pubets can get out on the sale of the of the Osier family are cordially these trips to the Canadian wilds<br />\nonly licly initiated into the Omicron<br />\nwhich<br />\ndelay,<br />\nmuch<br />\nAfter<br />\nseason tickets.<br />\ninvited. From four to six all not only for pleasure, but also for<br />\ninterest and Delta Kappa Honorary FraterWith an entire week left in members of the faculty, friends of science. Biologists, he explained, served to stimulate<br />\namong nity. Membership in the organanxiety<br />\nof<br />\nfeeling<br />\ncreate<br />\na<br />\nwhich to work for the university's<br />\nthe University and of the club, have long tried to trace the con- many of the men who were try- ization has for the last five years<br />\nfuture athletic teams, there is no<br />\nsheep to<br />\nand certain other members related nection of our Montana<br />\ning out, the Varsity lacrosse squad been regarded the highest honor<br />\nreason why each man cannot sell<br />\nthe Asiatic Marco-Polo sheep, but<br />\nthe coach- that a Hopkins man can attain.<br />\nat least two tickets. If every stu- to and interested in the club have have never been able to complete- has been announced by<br />\nFollowing an announcement of<br />\ning committee.<br />\ndent sells his small quota of two been asked to attend.<br />\nly do so. It was easy to find skel28<br />\nof<br />\nconsisting<br />\ninitiation, \"Doug\" Turnbull,<br />\nsquad,<br />\nthe<br />\nThe<br />\nwill<br />\na<br />\nbe<br />\nMrs. Brewster Will Attend<br />\ntickets, the campaign<br />\netons of the Asiatic tribe in parts men, is as follows:<br />\nof 0. D. K., introduced<br />\npresident<br />\nthe<br />\nguests of honor will of Siberia and Alaska, but a space<br />\nOne of<br />\nsuccess. The Athletic Association<br />\nMilBachman,<br />\nB. Garey, president of<br />\nDr.<br />\nCone,<br />\nEnoch<br />\nS.<br />\nLove,<br />\nstill entertaines the hope that the be Mrs. Robert Brewster, of New of eight hundred miles, in which<br />\nVoBarton,<br />\nand formerly<br />\nGump,<br />\nJohn's<br />\nLevy,<br />\nCollege,<br />\nSt.<br />\nbourne,<br />\nYork, who provided money for the no trace could be found separated<br />\nnecessary quota will be reached.<br />\nPorBenedict,<br />\nHess,<br />\nScience at<br />\nof<br />\nWatson,<br />\nMilitary<br />\ngel,<br />\nprofessor<br />\nfurnishing of the room but has the two varieties of sheep. It was<br />\nKeyes Shows Need for Funds<br />\nCroker,<br />\nhe<br />\nKaufholz,<br />\nwhich<br />\ninstitution<br />\nSummers,<br />\nter,<br />\nat<br />\nHopkins,<br />\n\"At present,\" said Norman not seen it since its completion. into this space, just north of MonRobinson,<br />\nGerstmeyer,<br />\nAaronson,<br />\nof<br />\nwas<br />\nmember<br />\nassociate<br />\nan<br />\nmade<br />\nKeyes, \"I know of $2,000 worth During the afternoon at least tant, between the provinces of AlTurnbull,<br />\nStick,<br />\nMorrill,<br />\nParsons,<br />\nHe<br />\nK.<br />\nbriefly<br />\nexplained<br />\nD.<br />\nthe<br />\n0.<br />\nof tickets that have been sold but three hundred people are expected berta and British Columbia, that<br />\nBates, Baldwin, M. Cone, Draper, qualifications for membership in<br />\nhave only received $850 of this to attend.<br />\nMr. Baetjer ond his party venMcDaniel.<br />\nSanderson,<br />\nthe organization.<br />\nThe room is constructed to con- tured.<br />\namount. With another week bewho have not been<br />\nmen<br />\nThe<br />\nDr. Garey pointed out that Mr.<br />\nfore the end of the drive and the form as closely as possible to the<br />\nThey explored a country so rugfirst game, and with the Barn- Tudor and Stuart period. There ged that to proceed to a point two chosen for the first squad are ex- Swindell has served the Club in<br />\nstormers' show over, we hope to are three windows richly cur- hundred miles ahead, it was nec- pected to work for the Red Eagle the capacity of coach for three<br />\nreceive the $4,500 that is absolute- tained. Under the two which face essary to go around mountains team. This team has several years, without financial remunerly necessary for the association. on the upper quadrangle runs a and follow riverbeds for a thou- games already scheduled and ation; that under his direction the<br />\nWithout this sum we will run in- long- high couch, deeply cush- sand miles. During this trip they promises to have a very success- productions of the Club has atto debt badly and the university ioned ; and the third window faces underwent many difficulties, but ful season. It will most probably tained a hitherto unreached dewon't support us. This, of course, south, giving a view of the cam- accomplished their purpose, find- play City, Poly, Mt. Washington gree of excellence; and that ever<br />\nJuniors, the Diamond Backs of U. since his graduation Mr. Swinmeans cutting out some of next pus.<br />\ning an excellent specimen of a<br />\nPark School.<br />\ndell has taken an active interest<br />\nspring's schedule, or even deprivAlmost completely covering the sheep's skeleton, which is now be- of Md., and<br />\nOn April 5, the first game of the in Hopkins affairs.<br />\ning the football team of the train- west wall are shelves containing ing examined to determnie if it is<br />\ning table, camp, and new equip- many rare books which were for- one of the connecting links be- 1924 lacrosse team will be played<br />\nProperty Staff Recognized<br />\nmerly in the personal library of tween the two tribes that have at Homewood. This game is<br />\nment.\"<br />\nFollowing Dr. Garey's address,<br />\nscheduled with the alumni, and in<br />\nEdward Revere Osler. The other long puzzled biologists.<br />\nJoseph Leopold, secretary of 0.<br />\nformer years has always created<br />\nRomance in Exploration<br />\nEXCELLENT MATERIAL AND three walls are panelled in dark<br />\nD. K., formally read out the name<br />\nMr.<br />\nthe<br />\nparty<br />\nBaetjer's<br />\ncharm<br />\na lot of interest and enthusiasm,<br />\nwas<br />\nand<br />\nof<br />\nair<br />\nan<br />\nlending<br />\noak,<br />\nVETERANS INSURE GOOD<br />\nthird which dared to enter this and served as a general reunion of Walter B. Swindell, Jr., as a<br />\nquiet which is hard to define.<br />\nTENNIS SEASON<br />\nrugged<br />\nregion which the Canadian for Hopkins men. At this time member of that organization. In<br />\nFireplace in Room<br />\nSevOpposition.<br />\ngovernment<br />\nhas never had ex- the Hopkins teams will blossom his speech of acceptance, Mr.<br />\nStrong<br />\nTeam Will Meet<br />\nIn one corner of the room under<br />\neral Trips Planned. State Tournaplored.<br />\nThere<br />\nis much romance forth in their new uniforms. The Swindell expressed his deep apa mantel piece is a fireplace, with<br />\nment Possible<br />\nconnected with such explorations color effect this year will be much<br />\npreciation of the honor he had reAll indications point to a suc- brass fittings, which gives a<br />\ncen- in the great \"out-of-doors,\" Dr. more striking than formerly, since<br />\ncessful season for the tennis team. homelike appearance. In the<br />\nBaetjer stated, and ,once it has you the jerseys are royal blue with ceived. He publicly thanked his<br />\nAmong the members of the team ter of the mantel rests a mahogco-workers among the undergradan in its grip, you go back again and black stripes instead of the dull<br />\nare: Hoffmeister, Stulman, Was- any clock, and over each end is<br />\nuates, and as a special recognition,<br />\nwhite<br />\nWith<br />\nyears.<br />\ncan- again and again. His purpose in black of other<br />\nserman and Frelinghausen. Cap- electric light in the form of a<br />\nhe<br />\nread a list of the members of<br />\nnew<br />\nrelating his adventures, he said, hats and trunks and bright<br />\ntain Hoffmeister says, \"We have dle lamp, which was the type of<br />\nthe<br />\nproperty staff, \"whom the auteam<br />\nwas to encourage everyone to take sticks with red grips, the<br />\nsome very promising candidates light used in that period. At<br />\ndience<br />\ncannot see at work behind<br />\na trip into the wilds and to realize will present an imposing appearin Block, Goldstein, Hebner and both ends of the room is a small<br />\nthe<br />\nfootlights.\"<br />\nthe adventures connected with ance.<br />\nKaufholtz. As the courts will not table with a beautiful reading<br />\nPreparation for this year's pressuch an expedition.<br />\nsuch<br />\nbe ready until about the second lamp on each.<br />\nentation<br />\nwas done in record time,<br />\nADS<br />\nWANTS<br />\nHULLABALOO<br />\nIn one corner of the room, skillweek in April, there will be little<br />\nthe<br />\nsince<br />\nother project had dehas<br />\nthe<br />\nHullabaloo<br />\nWork on<br />\npractice before that time.\" Heb- fully hidden behind the oak panNOTICES<br />\nlayed<br />\nfor \"The Galrehearsals<br />\nprogressed to such a degree that<br />\nner's playing is well known elling, is a safe containing the valTRACK<br />\nloper\"<br />\nuntil<br />\nthe<br />\nafter<br />\nmid-year exthe copy will soon go to press.<br />\nTrack candidates who are not<br />\nthroughout the state; he holds the uables of the club. Included in<br />\nto<br />\nasked<br />\npractice<br />\nare<br />\nwas<br />\nIt<br />\naminations.<br />\nattending<br />\nonly<br />\nby hard<br />\nAll the Senior write-ups are in.<br />\nState Interscholastic and State these is complete equipment for<br />\nturn in equipment at once or cauwork<br />\ninto<br />\nconcentrated<br />\nregular<br />\nThe pictures, with the exception<br />\ntion money will be attached.<br />\nJunior Championships, the latter serving tea, a set, of silver en4.<br />\nrehearsals<br />\nbe<br />\nthat<br />\nthe<br />\ncould<br />\ncast<br />\nand<br />\nthe<br />\nsports<br />\n0.<br />\nof<br />\nR.<br />\nspring<br />\ngraved<br />\ncoat-of-arms<br />\nwith<br />\nthe<br />\nthe<br />\nof<br />\nhaving been won by a series of<br />\nR. 0. T. C.<br />\ndrilled<br />\ninto<br />\nshape.<br />\nThe<br />\nsets,<br />\nand<br />\nclub,<br />\nmost<br />\ntaken<br />\nand<br />\n.<br />\nbooks,<br />\nrare<br />\nthe<br />\nbeen<br />\nsome<br />\nall<br />\nhave<br />\nC.<br />\nT.<br />\nThe R. 0. T. C. Military Ball,<br />\ncompetitive matches last summer.<br />\nfor Juniors and Seniors only, will<br />\nof the contracts of the various which were designed by Isaac<br />\nGraduate Manager Keyes is which are now in possession of<br />\nbe held Saturday, April 5, at 9 P.<br />\nclub.<br />\nthe<br />\ncampus organizations are com- Hamburger and Alan Gump, were<br />\nconsidering a state intercollegiate<br />\nM. in the C. E. Hall; Subscription,<br />\nalso executed in a very short time.<br />\nother<br />\ndates<br />\ngiving<br />\nNotices<br />\n$2.50.<br />\npleted.<br />\nThe furniture and lights, includtournament. Nothing has been<br />\nare incorrect.<br />\nThe<br />\napplause of the audiences inanmanager<br />\nbusiness<br />\nThe<br />\ndefinitely arranged about this, but ing the beautifully designed dropdicated<br />\nthat their work was well<br />\nare<br />\nads<br />\nthe<br />\nthat<br />\nhowever,<br />\nY. M. C. A.<br />\nnounces,<br />\nit is looked upon with favor by light which hangs from .the midDinner<br />\nFellowship<br />\ntonight,<br />\nDr.<br />\ndone.<br />\nsatisfaction.<br />\nnot coming in to his<br />\nseveral interested colleges, who, dle of the ceiling, were especially<br />\nChan, of George Washington UniPatronesses Prominent<br />\nAnyone knowing of prospects for<br />\nversity will talk. Special features.<br />\nit is understood, are ready to give designed for the room by Delano<br />\noffice<br />\n\"Y\"<br />\nMake<br />\nat<br />\nreservations<br />\nThe performances were well atrequested to get in touch<br />\nis<br />\nads<br />\nthe plan hearty support. With the and Aldrich of New York, leading<br />\nbefore noon.<br />\nContinued on page 4, col. 2.<br />\narchitects of the country.<br />\nwith \"Bill\" Dean.<br />\nContinued on page 4, col. 3<br />\n<br />\nThe day before the spring season ticket campaign was to close,<br />\nthe Athletic Association's figures<br />\nshowed that but $850 had been<br />\nturned in. There is a vast differ-<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL I, 1921<br />\n<br />\nA Sonnet of Yester-month<br />\n<br />\nSANFORD'S<br />\nFOUNTAIN PEN INK<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible<br />\nAll<br />\nSizes<br />\n<br />\nAll<br />\nColors<br />\n<br />\n44:201<br />\n<br />\nI IlI<br />\n<br />\n27.<br />\n'SarfOrd'S<br />\nOUNIA PRINI,NK<br />\nBIS(F:kA\",?<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br />\n<br />\nBy a Member of Sigma Upsilon<br />\n<br />\nMARCH<br />\n0 winds of March that tell of coming Spring,<br />\nAnd April with her weeping tears, her showers;<br />\nOnce more you come and once again you bring<br />\nThe promises of blustry days and flowers.<br />\n0 month that over all art truly king<br />\nOf 'sudden gusts that rock the highest towers,<br />\nHow glad I am that once again you sing<br />\nThrough newly budding trees and future bowers;<br />\nIn winter months we long to hear your voice,<br />\nWhen fields are clothed in white and sparkling dress,<br />\nWhen glowing logs burn crackling on the hearth.<br />\nAt last you come; there's reason to rejoice,<br />\nFor your approach is signal of no less<br />\nThan days of joy and happiness and mirth.<br />\nB. J. Hood.<br />\n\"BLUE JAY\" TO APPEAR<br />\nSOON<br />\n<br />\nJUNE WEEK PROGRAMS TO<br />\nAPPEAR EARLY<br />\n<br />\nThe \"Caveman Number\" of the<br />\nAs in former years the activities<br />\n\"Black and Blue Jay\" will appear in the Botanical Garden will be<br />\nnext week according to an an- one of the feature events of June<br />\nnouncement of. the Hopkins pubWeek. The garden, resplendent<br />\nlication.<br />\nMuch<br />\ncommendable<br />\ncopy and a gratifying number of in its natural beauty, will be furgood cuts is in the possession of ther glorified by the presence of<br />\nhe editor. There will be two more a French caterer who will dispense<br />\nissues; namely, the \"Spring Fan- savory viands and many mysteri1817 N. Charles St.<br />\ncies\" number to appear May 1 and ous refreshments. R. Page O'Conthe \"June Week\" edition which<br />\n(Half Block below North Ave.)<br />\nnor heads a committee who will<br />\nwill be published at an approseek<br />\nout this deft exponent of inpriate time.<br />\nNicholas Brown, Mgr.<br />\nternal<br />\nsatisfaction. The former caAt the annual Black and Blue<br />\nterer<br />\nis<br />\nnot available this year, for<br />\nJay banquet which will take place<br />\nit<br />\nis<br />\nfeared<br />\nhe still has a deficit<br />\nin the near future in the dormiBE A NEWSPAPER<br />\n.from<br />\nthe festive occasion of last<br />\ntory the staff elections will be<br />\nCORRESPONDENT<br />\nheld. Several vacancies on the season.<br />\nwith the Heacock Plan and earn a Art Staff will be filled at this<br />\nThe early appearance of the progood income while learning; we<br />\ngrams is due to hard work on the<br />\nmeeting.<br />\nshow you how; begin actual work<br />\nAn increase in the number of part of the committee. They are<br />\nat once; all or spare time; experifor the Black and of blue roan leather in rococo<br />\ncandidates<br />\nence unnecessary; no canvassing;<br />\nsend for particulars.<br />\nBlue Jay staffs is urged by Fitz- style, further embellished on the<br />\ngerald Dunning, Editor-in-chief. cover by the university seal. NuNEWSWRITERS TRAINING<br />\nmerous firms have submitted rare<br />\nBUREAU<br />\nand<br />\ndelightful favors for considerBARNSTORMERS' PRODUCTION OF<br />\nBuffalo, N. Y.<br />\n\"THE GALLOPER\" WELL REation but to date no specific samCEIVED<br />\nple has been decided upon.<br />\nContinued from page 1<br />\nFinancial considerations are<br />\nFor<br />\nFor<br />\ntended. As usual, a number of giving the committee no little<br />\nFOUNTAIN<br />\nGENERAL<br />\nfraternity box parties were given worry. It is hard for the average<br />\n,<br />\nUSE<br />\nPENS<br />\non both Friday and Saturday student to be convinced that upon<br />\nSold by<br />\nnights. The list of patronesses in- him depends the success of June<br />\nSTATIONERS, DRUG AND<br />\nDEPARTMENT STORES<br />\ncluded a number of the most Week, with all that it implies. It<br />\nprominent matrons in Baltimore is, of course, the university's faresociety.<br />\nwell to the graduate.<br />\nDiscussion of the rendering of<br />\nthe major roles will be found elseIs Taking the Country by Storm<br />\nEXCELLENT MATERIAL AND VETA complete set in bright<br />\nwhere in these pages. The less<br />\nERANS INSURE GOOD TENcolors, 144 tiles, 116 countNIS SEASON<br />\ners, 8 racks, 2 dice, book of<br />\nimportant characters, however,<br />\nrules and instructions: any<br />\nContinued<br />\nfrom page 1<br />\none can learn the game in<br />\nare by no means beneath notice:<br />\nten! minutes. All in attractive box, sent prepaid on<br />\nCRETAN EXILES — Robert present material and plenty of<br />\nreceipt of $1.00 (Canada<br />\n25c extra).<br />\nC. Griffith, III, Charles E. Vogle ; practice our team will have an<br />\nLarkin H. Farinholt, W. Nelson excellent chance to come out on<br />\nJ. Cookman Boyd, Jr., top.<br />\nYoung;<br />\nVery Attractive Black SatTeam Will Take Two Trips<br />\neen Mah-Jong Table Cover,<br />\nCharles B. Hines; J. Henry Jarwith colored dragon deThe<br />\nHopkins team has been ensigns, adjustable to any<br />\nH.<br />\nrett, Edward H. Watson; John<br />\nsize card table: 16 counter<br />\ntered<br />\nin<br />\nthe Middle Atlantic Secpockets, striking colored<br />\nFringer, Douglas S. Frantz; Chas.<br />\nstitched edges. Extraortional<br />\nTournament,<br />\nto be played<br />\ndinary value. Special price<br />\nC. Hazell, Rubin H. Flocks; IsiCOMBINATION OFFER: We will<br />\nat<br />\nHaverford<br />\nMay<br />\n31st,<br />\nbut bedore Bloom.<br />\nsend prepaid one complete Mahcause<br />\nof<br />\nthe<br />\nexaminations,<br />\nwhich<br />\nOFFICERS OF FOREIGN<br />\njong set and table cover as dewill<br />\nbe<br />\nin<br />\nfull<br />\nswing<br />\nat<br />\nscribed above on receipt of $2.50.<br />\nthat<br />\ntime,<br />\nLEGION OF GREEK ARMY—<br />\nit<br />\nwill<br />\nbe<br />\nprobably<br />\nunable<br />\nto<br />\nparCHINA-AMERICAN IMPORTING<br />\nHugh Jewett, III, Joseph LeoCOMPANY<br />\nticipate.<br />\nAn<br />\nattractive<br />\nschedule<br />\npold; Thomas F. McNeal, RidgeNew York<br />\n111 West 68th St.<br />\nis being prepared, with several<br />\nly Howard; T. Stran Summers,<br />\ntrips under consideration. At<br />\nGordon Donovan.<br />\nleast<br />\ntwo trips have been finally<br />\nALWAYS USE A<br />\nTURKISH SOLDIERS—John<br />\ndecided<br />\nupon: one to Easton„ to<br />\nH. Fringer, Jr., Charles F. Reese.<br />\nYELLOW CAB<br />\nmeet the team of the Easton CounOR PHONE<br />\nAfter gold footballs, baseballs, try Club, the other to play1212<br />\nVERNON<br />\nbasketballs, etc., were obtained for Georgetown University at GeorgeHAIL THEM ANYWHERE<br />\nall the respective teams at the town. It is especially desired<br />\nUniversity of Missouri, the track that as many students as possible<br />\ngo with the team on these trips<br />\nNECKWEAR team began to want emblems for<br />\nSHIRTS<br />\nand<br />\nlend it every support.<br />\nye old watch chain. So gold track<br />\n<br />\nraway<br />\n,,,,Afforgr<br />\nririf<br />\n\"ga<br />\n=6<br />\n,W47,<br />\n•<br />\n•■<br />\ngfreffavalfan<br />\nWt..'aiworeffeager<br />\nimworataiCir<br />\nsir or<br />\nowatt4,5<br />\n,<br />\nannwillea<br />\nmitardpw<br />\nMEIENE<br />\n,<br />\n1_ W<br />\nar 4,<br />\nIMO<br />\nl.<br />\ne<br />\nag<br />\nMOM OW 44<br />\n0<br />\n0101°.111<br />\nfirlOWWOdOljg<br />\n\"<br />\n0.11'47010<br />\n<br />\n•<br />\n<br />\nPer,<br />\n<br />\n-11011111111111111111111.<br />\n‘tolot<br />\n,:=11,<br />\n101.<br />\n4•10041111111111111.....<br />\n'<br />\n411114444441ftw<br />\n<br />\ntelt<br />\n'<br />\n..hrieteere•<br />\n.<br />\n4.:4<br />\n....<br />\n,<br />\n-<br />\n<br />\nvc<br />\n<br />\n4<br />\n<br />\nwat<br />\n<br />\nC<br />\n<br />\nSti<br />\n<br />\nNLY those<br />\n<br />\nwho have<br />\nsmoked Melachrinos<br />\ncan judge the quality<br />\nof the finest Turkish<br />\ntobacco.<br />\n<br />\nO<br />\n<br />\ngz<br />\nco<br />\ncc<br />\ntl<br />\nd(<br />\nro<br />\n<br />\nNV<br />\n<br />\nORIGINAL<br />\n<br />\nSi<br />\n<br />\nMEL CHRINO<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\ntl<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nig-<br />\n<br />\n14-4<br />\n,<br />\n)<br />\n<br />\nXatterie)<br />\nd4mzsOSCAR G.I-Orif<br />\n<br />\nLeFranc & Ault<br />\n<br />\nshoes were obtained. Gold bathing suits are hereby suggested as POETRY OF A LIGHTER VEIN<br />\n421 N. HOWARD ST.<br />\nGLOVES suitable for the swimming team.<br />\nIf—<br />\nHOSIERY<br />\nKissing a miss<br />\nis<br />\nStore<br />\nFine<br />\nKissing<br />\namiss<br />\nGreetings<br />\nof<br />\na<br />\nThe<br />\nAre there<br />\nTo the Students of a Fine University<br />\nAny more blisses<br />\nIn kissing a Mrs?<br />\n<br />\nHOCHSCHILD.KOHN 8cCo.<br />\n<br />\n—Boll-Weevil.<br />\n<br />\n11<br />\n<br />\nHave you<br />\nseen it?<br />\n<br />\nOWN ERS<br />\n7'1P1411)<br />\n:<br />\n1\"1\":1•C.441.11/k°<br />\n29 E. BALTIMORE ST.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\n<br />\nLIBERTY ST.<br />\nAT SARATOGA<br />\n<br />\na<br />\n<br />\n411Something new in portable<br />\ntypewriters.<br />\n(Lit writes nearly all languages.<br />\n<br />\nLUNCHEON<br />\n<br />\nCHas 90 characters.<br />\n<br />\nTEA<br />\nDINNER<br />\n11.30A. M.<br />\nuntil<br />\n7.30 P. M<br />\n<br />\nSee Fred Rich, College<br />\nRepresentative<br />\n<br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br />\n<br />\nMah-Jong<br />\n<br />\nTable Covers<br />\n<br />\n\"ix(.I\"<br />\nCORONA<br />\n<br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br />\n<br />\nRENT A CAR<br />\n<br />\nDRIVE IT YOURSELF<br />\nFORDS, 12c PER MILE<br />\n<br />\nDODGES, 18c PER MILE<br />\n<br />\nSpecial Reduced Rates for 50 Miles or More<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 NORTH CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n411, Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\nNew York University School of Retailing<br />\nTHE SCHOOL OF RETAILING TRAINS FOR<br />\nEXECUTIVE POSITIONS<br />\nMERCHANDISING<br />\nADVERTISING<br />\n<br />\nPERSONNEL<br />\nTRAINING<br />\n<br />\nTEACHING<br />\nSERVICE<br />\n<br />\nFINANCE AND CONTROL<br />\nMerchants Are Eager to Secure Trained Men and Women in These Fields.<br />\nSERVICE FELLOWSHIPS<br />\nCLASSROOM AND STORE ARE LINKED CLOSELY TOGETHER<br />\nIllustrated booklet on application. For further information write<br />\nDR. NORRIS A. BRISCOE<br />\nDIRECTOR OF NEW YORK UNIVERSITY SCHOOL OF RETAILING<br />\n100 WASHINGTON PLACE<br />\nNEW YORK CITY<br />\n<br />\n:1<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No XI<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 1, 1924<br /><br />\nSEASON TICKET CAMPAIGN FORMAL OPENING OF TU- ADVENTURES IN CANADIAN<br />\nWILDS RELATED BY<br />\nDOR AND STUART ROOM<br />\nEXTENDED UNTIL<br />\nMR. BAETJER<br />\nTOMORROW<br />\nAPRIL 5<br />\nReturns Far Short of Necessary $4,500. Out of Town Members Will Attend Tea. Interesting Lecture Supplemented by<br />\nPhotographs of Wild Animals.<br />\nMany Will View Richly Furnished<br />\nGraduate Manager Keyes Shows<br />\nPraises Out-of-doors<br />\nRoom for First Time<br />\nSeriousness of Situation<br /><br />\nPRICE 5 CENTS<br /><br />\nBARNSTORMERS PRODUCTION OF<br />\nTHE GALLOPER\" WELL RECEIVED;<br />\nWALTER B. SWINDELL HONORED<br />\nLarge Audiences Greet Maiden Effort of Barnstormers Club<br /><br />\nTo encourage men to seek the<br />\nThe formal opening of the room<br />\nEnthusiastically<br />\nout-of-doors, Mr. Edwin<br />\ngreat<br />\nof the Tudor and Stuart Club, sitCriticism of the Play Will Be Found on Page 3, Column .2<br />\nuated in Gilman Hall on the third Baetjer, at the Assembly last<br />\nThursday, told of his own experiGalloper,\" Richard Harding Davis' famous farce, was<br />\n\"The<br />\nfloor, will take place tomorrow<br />\nences. His talk was interesting, presented by the Johns Hopkins Barnstormers Club to appreciative<br />\nafternoon in the form of a tea, to not only to the biologist but to<br />\naudiences at the Lyric last Friday and Saturday nights. R. F. Pasence between $850 and $4500, the be poured by Mrs. T. B. Futcher, everyone, as he included in it sano played the male lead, \"Copeland Schuyler,\" and Mortimer Slatmany exciting accounts of his kin portrayed the role of \"Grace Whitney\", the female lead.<br />\nsum that is absolutely necessary of New York.<br />\nMrs. Futcher is the niece of Sir hunts and discoveries. Among<br />\nin order that the Athletic AssoThe presentation of this farce constitutes the annual production<br />\nthree of the Club. The production approached an all-Hopkins one. Davis<br />\nciation may overcome its ex- William and Lady Osler, the par- these was an adventure with<br />\nin his was himself a student at the University for a short time. The heroents of the late Edward Revere bears. With but one rifle<br />\npenses.<br />\nentire party, he was attacked by ine of the play, \"Grace Whitney,\" is a trained nurse from the HopRealizing that the sale of the Osier, who was killed in the three grizzlies, a female and two<br />\nkins Hospital. All parts, male and female, were taken by Hopkins<br />\nBarnstormers' tickets was serious- World War, and to whose mem- cubs, infuriated by the human instudents. The scenery was designed and executed strictly on the<br />\nly interfering with its own drive, ory the room is dedicated.<br />\nvasion. He managed to kill the Hopkins campus. Walter B. Swindell, who coached the play, is a<br />\nTea will be served from three large female but not until she had Hopkins graduate, class of '01.<br />\nthe Athletic Association extended<br />\nthe close of the drive to Saturday, to four and from four to six in the avanced within ten feet of him.<br />\nDuring the first intermission,<br />\nThe cubs immediately retreated<br />\nApril 5, in order that those men afternoon. From three to four all<br />\nVARSITY LACROSSE SQUAD on the opening night, Mr. Swinat sight of their mother's fate.<br />\ndell received a public recognition<br />\nANNOUNCED BY COACHwho were spending their spare club members both in and out of<br />\nMr. Baetjer, who is a Baltiof<br />\nhis services to the Club. In<br />\nING COMMITTEE<br />\ntime in selling Barnstormer tick- town, trustees, and special friends morean, explained that he made<br />\nfront<br />\nof the curtain, he was pubets can get out on the sale of the of the Osier family are cordially these trips to the Canadian wilds<br />\nonly licly initiated into the Omicron<br />\nwhich<br />\ndelay,<br />\nmuch<br />\nAfter<br />\nseason tickets.<br />\ninvited. From four to six all not only for pleasure, but also for<br />\ninterest and Delta Kappa Honorary FraterWith an entire week left in members of the faculty, friends of science. Biologists, he explained, served to stimulate<br />\namong nity. Membership in the organanxiety<br />\nof<br />\nfeeling<br />\ncreate<br />\na<br />\nwhich to work for the university's<br />\nthe University and of the club, have long tried to trace the con- many of the men who were try- ization has for the last five years<br />\nfuture athletic teams, there is no<br />\nsheep to<br />\nand certain other members related nection of our Montana<br />\ning out, the Varsity lacrosse squad been regarded the highest honor<br />\nreason why each man cannot sell<br />\nthe Asiatic Marco-Polo sheep, but<br />\nthe coach- that a Hopkins man can attain.<br />\nat least two tickets. If every stu- to and interested in the club have have never been able to complete- has been announced by<br />\nFollowing an announcement of<br />\ning committee.<br />\ndent sells his small quota of two been asked to attend.<br />\nly do so. It was easy to find skel28<br />\nof<br />\nconsisting<br />\ninitiation, \"Doug\" Turnbull,<br />\nsquad,<br />\nthe<br />\nThe<br />\nwill<br />\na<br />\nbe<br />\nMrs. Brewster Will Attend<br />\ntickets, the campaign<br />\netons of the Asiatic tribe in parts men, is as follows:<br />\nof 0. D. K., introduced<br />\npresident<br />\nthe<br />\nguests of honor will of Siberia and Alaska, but a space<br />\nOne of<br />\nsuccess. The Athletic Association<br />\nMilBachman,<br />\nB. Garey, president of<br />\nDr.<br />\nCone,<br />\nEnoch<br />\nS.<br />\nLove,<br />\nstill entertaines the hope that the be Mrs. Robert Brewster, of New of eight hundred miles, in which<br />\nVoBarton,<br />\nand formerly<br />\nGump,<br />\nJohn's<br />\nLevy,<br />\nCollege,<br />\nSt.<br />\nbourne,<br />\nYork, who provided money for the no trace could be found separated<br />\nnecessary quota will be reached.<br />\nPorBenedict,<br />\nHess,<br />\nScience at<br />\nof<br />\nWatson,<br />\nMilitary<br />\ngel,<br />\nprofessor<br />\nfurnishing of the room but has the two varieties of sheep. It was<br />\nKeyes Shows Need for Funds<br />\nCroker,<br />\nhe<br />\nKaufholz,<br />\nwhich<br />\ninstitution<br />\nSummers,<br />\nter,<br />\nat<br />\nHopkins,<br />\n\"At present,\" said Norman not seen it since its completion. into this space, just north of MonRobinson,<br />\nGerstmeyer,<br />\nAaronson,<br />\nof<br />\nwas<br />\nmember<br />\nassociate<br />\nan<br />\nmade<br />\nKeyes, \"I know of $2,000 worth During the afternoon at least tant, between the provinces of AlTurnbull,<br />\nStick,<br />\nMorrill,<br />\nParsons,<br />\nHe<br />\nK.<br />\nbriefly<br />\nexplained<br />\nD.<br />\nthe<br />\n0.<br />\nof tickets that have been sold but three hundred people are expected berta and British Columbia, that<br />\nBates, Baldwin, M. Cone, Draper, qualifications for membership in<br />\nhave only received $850 of this to attend.<br />\nMr. Baetjer ond his party venMcDaniel.<br />\nSanderson,<br />\nthe organization.<br />\nThe room is constructed to con- tured.<br />\namount. With another week bewho have not been<br />\nmen<br />\nThe<br />\nDr. Garey pointed out that Mr.<br />\nfore the end of the drive and the form as closely as possible to the<br />\nThey explored a country so rugfirst game, and with the Barn- Tudor and Stuart period. There ged that to proceed to a point two chosen for the first squad are ex- Swindell has served the Club in<br />\nstormers' show over, we hope to are three windows richly cur- hundred miles ahead, it was nec- pected to work for the Red Eagle the capacity of coach for three<br />\nreceive the $4,500 that is absolute- tained. Under the two which face essary to go around mountains team. This team has several years, without financial remunerly necessary for the association. on the upper quadrangle runs a and follow riverbeds for a thou- games already scheduled and ation; that under his direction the<br />\nWithout this sum we will run in- long- high couch, deeply cush- sand miles. During this trip they promises to have a very success- productions of the Club has atto debt badly and the university ioned ; and the third window faces underwent many difficulties, but ful season. It will most probably tained a hitherto unreached dewon't support us. This, of course, south, giving a view of the cam- accomplished their purpose, find- play City, Poly, Mt. Washington gree of excellence; and that ever<br />\nJuniors, the Diamond Backs of U. since his graduation Mr. Swinmeans cutting out some of next pus.<br />\ning an excellent specimen of a<br />\nPark School.<br />\ndell has taken an active interest<br />\nspring's schedule, or even deprivAlmost completely covering the sheep's skeleton, which is now be- of Md., and<br />\nOn April 5, the first game of the in Hopkins affairs.<br />\ning the football team of the train- west wall are shelves containing ing examined to determnie if it is<br />\ning table, camp, and new equip- many rare books which were for- one of the connecting links be- 1924 lacrosse team will be played<br />\nProperty Staff Recognized<br />\nmerly in the personal library of tween the two tribes that have at Homewood. This game is<br />\nment.\"<br />\nFollowing Dr. Garey's address,<br />\nscheduled with the alumni, and in<br />\nEdward Revere Osler. The other long puzzled biologists.<br />\nJoseph Leopold, secretary of 0.<br />\nformer years has always created<br />\nRomance in Exploration<br />\nEXCELLENT MATERIAL AND three walls are panelled in dark<br />\nD. K., formally read out the name<br />\nMr.<br />\nthe<br />\nparty<br />\nBaetjer's<br />\ncharm<br />\na lot of interest and enthusiasm,<br />\nwas<br />\nand<br />\nof<br />\nair<br />\nan<br />\nlending<br />\noak,<br />\nVETERANS INSURE GOOD<br />\nthird which dared to enter this and served as a general reunion of Walter B. Swindell, Jr., as a<br />\nquiet which is hard to define.<br />\nTENNIS SEASON<br />\nrugged<br />\nregion which the Canadian for Hopkins men. At this time member of that organization. In<br />\nFireplace in Room<br />\nSevOpposition.<br />\ngovernment<br />\nhas never had ex- the Hopkins teams will blossom his speech of acceptance, Mr.<br />\nStrong<br />\nTeam Will Meet<br />\nIn one corner of the room under<br />\neral Trips Planned. State Tournaplored.<br />\nThere<br />\nis much romance forth in their new uniforms. The Swindell expressed his deep apa mantel piece is a fireplace, with<br />\nment Possible<br />\nconnected with such explorations color effect this year will be much<br />\npreciation of the honor he had reAll indications point to a suc- brass fittings, which gives a<br />\ncen- in the great \"out-of-doors,\" Dr. more striking than formerly, since<br />\ncessful season for the tennis team. homelike appearance. In the<br />\nBaetjer stated, and ,once it has you the jerseys are royal blue with ceived. He publicly thanked his<br />\nAmong the members of the team ter of the mantel rests a mahogco-workers among the undergradan in its grip, you go back again and black stripes instead of the dull<br />\nare: Hoffmeister, Stulman, Was- any clock, and over each end is<br />\nuates, and as a special recognition,<br />\nwhite<br />\nWith<br />\nyears.<br />\ncan- again and again. His purpose in black of other<br />\nserman and Frelinghausen. Cap- electric light in the form of a<br />\nhe<br />\nread a list of the members of<br />\nnew<br />\nrelating his adventures, he said, hats and trunks and bright<br />\ntain Hoffmeister says, \"We have dle lamp, which was the type of<br />\nthe<br />\nproperty staff, \"whom the auteam<br />\nwas to encourage everyone to take sticks with red grips, the<br />\nsome very promising candidates light used in that period. At<br />\ndience<br />\ncannot see at work behind<br />\na trip into the wilds and to realize will present an imposing appearin Block, Goldstein, Hebner and both ends of the room is a small<br />\nthe<br />\nfootlights.\"<br />\nthe adventures connected with ance.<br />\nKaufholtz. As the courts will not table with a beautiful reading<br />\nPreparation for this year's pressuch an expedition.<br />\nsuch<br />\nbe ready until about the second lamp on each.<br />\nentation<br />\nwas done in record time,<br />\nADS<br />\nWANTS<br />\nHULLABALOO<br />\nIn one corner of the room, skillweek in April, there will be little<br />\nthe<br />\nsince<br />\nother project had dehas<br />\nthe<br />\nHullabaloo<br />\nWork on<br />\npractice before that time.\" Heb- fully hidden behind the oak panNOTICES<br />\nlayed<br />\nfor \"The Galrehearsals<br />\nprogressed to such a degree that<br />\nner's playing is well known elling, is a safe containing the valTRACK<br />\nloper\"<br />\nuntil<br />\nthe<br />\nafter<br />\nmid-year exthe copy will soon go to press.<br />\nTrack candidates who are not<br />\nthroughout the state; he holds the uables of the club. Included in<br />\nto<br />\nasked<br />\npractice<br />\nare<br />\nwas<br />\nIt<br />\naminations.<br />\nattending<br />\nonly<br />\nby hard<br />\nAll the Senior write-ups are in.<br />\nState Interscholastic and State these is complete equipment for<br />\nturn in equipment at once or cauwork<br />\ninto<br />\nconcentrated<br />\nregular<br />\nThe pictures, with the exception<br />\ntion money will be attached.<br />\nJunior Championships, the latter serving tea, a set, of silver en4.<br />\nrehearsals<br />\nbe<br />\nthat<br />\nthe<br />\ncould<br />\ncast<br />\nand<br />\nthe<br />\nsports<br />\n0.<br />\nof<br />\nR.<br />\nspring<br />\ngraved<br />\ncoat-of-arms<br />\nwith<br />\nthe<br />\nthe<br />\nof<br />\nhaving been won by a series of<br />\nR. 0. T. C.<br />\ndrilled<br />\ninto<br />\nshape.<br />\nThe<br />\nsets,<br />\nand<br />\nclub,<br />\nmost<br />\ntaken<br />\nand<br />\n.<br />\nbooks,<br />\nrare<br />\nthe<br />\nbeen<br />\nsome<br />\nall<br />\nhave<br />\nC.<br />\nT.<br />\nThe R. 0. T. C. Military Ball,<br />\ncompetitive matches last summer.<br />\nfor Juniors and Seniors only, will<br />\nof the contracts of the various which were designed by Isaac<br />\nGraduate Manager Keyes is which are now in possession of<br />\nbe held Saturday, April 5, at 9 P.<br />\nclub.<br />\nthe<br />\ncampus organizations are com- Hamburger and Alan Gump, were<br />\nconsidering a state intercollegiate<br />\nM. in the C. E. Hall; Subscription,<br />\nalso executed in a very short time.<br />\nother<br />\ndates<br />\ngiving<br />\nNotices<br />\n$2.50.<br />\npleted.<br />\nThe furniture and lights, includtournament. Nothing has been<br />\nare incorrect.<br />\nThe<br />\napplause of the audiences inanmanager<br />\nbusiness<br />\nThe<br />\ndefinitely arranged about this, but ing the beautifully designed dropdicated<br />\nthat their work was well<br />\nare<br />\nads<br />\nthe<br />\nthat<br />\nhowever,<br />\nY. M. C. A.<br />\nnounces,<br />\nit is looked upon with favor by light which hangs from .the midDinner<br />\nFellowship<br />\ntonight,<br />\nDr.<br />\ndone.<br />\nsatisfaction.<br />\nnot coming in to his<br />\nseveral interested colleges, who, dle of the ceiling, were especially<br />\nChan, of George Washington UniPatronesses Prominent<br />\nAnyone knowing of prospects for<br />\nversity will talk. Special features.<br />\nit is understood, are ready to give designed for the room by Delano<br />\noffice<br />\n\"Y\"<br />\nMake<br />\nat<br />\nreservations<br />\nThe performances were well atrequested to get in touch<br />\nis<br />\nads<br />\nthe plan hearty support. With the and Aldrich of New York, leading<br />\nbefore noon.<br />\nContinued on page 4, col. 2.<br />\narchitects of the country.<br />\nwith \"Bill\" Dean.<br />\nContinued on page 4, col. 3<br /><br />\nThe day before the spring season ticket campaign was to close,<br />\nthe Athletic Association's figures<br />\nshowed that but $850 had been<br />\nturned in. There is a vast differ-<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL I, 1921<br /><br />\nA Sonnet of Yester-month<br /><br />\nSANFORD'S<br />\nFOUNTAIN PEN INK<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible<br />\nAll<br />\nSizes<br /><br />\nAll<br />\nColors<br /><br />\n44:201<br /><br />\nI IlI<br /><br />\n27.<br />\n'SarfOrd'S<br />\nOUNIA PRINI,NK<br />\nBIS(F:kA\",?<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br /><br />\nBy a Member of Sigma Upsilon<br /><br />\nMARCH<br />\n0 winds of March that tell of coming Spring,<br />\nAnd April with her weeping tears, her showers;<br />\nOnce more you come and once again you bring<br />\nThe promises of blustry days and flowers.<br />\n0 month that over all art truly king<br />\nOf 'sudden gusts that rock the highest towers,<br />\nHow glad I am that once again you sing<br />\nThrough newly budding trees and future bowers;<br />\nIn winter months we long to hear your voice,<br />\nWhen fields are clothed in white and sparkling dress,<br />\nWhen glowing logs burn crackling on the hearth.<br />\nAt last you come; there's reason to rejoice,<br />\nFor your approach is signal of no less<br />\nThan days of joy and happiness and mirth.<br />\nB. J. Hood.<br />\n\"BLUE JAY\" TO APPEAR<br />\nSOON<br /><br />\nJUNE WEEK PROGRAMS TO<br />\nAPPEAR EARLY<br /><br />\nThe \"Caveman Number\" of the<br />\nAs in former years the activities<br />\n\"Black and Blue Jay\" will appear in the Botanical Garden will be<br />\nnext week according to an an- one of the feature events of June<br />\nnouncement of. the Hopkins pubWeek. The garden, resplendent<br />\nlication.<br />\nMuch<br />\ncommendable<br />\ncopy and a gratifying number of in its natural beauty, will be furgood cuts is in the possession of ther glorified by the presence of<br />\nhe editor. There will be two more a French caterer who will dispense<br />\nissues; namely, the \"Spring Fan- savory viands and many mysteri1817 N. Charles St.<br />\ncies\" number to appear May 1 and ous refreshments. R. Page O'Conthe \"June Week\" edition which<br />\n(Half Block below North Ave.)<br />\nnor heads a committee who will<br />\nwill be published at an approseek<br />\nout this deft exponent of inpriate time.<br />\nNicholas Brown, Mgr.<br />\nternal<br />\nsatisfaction. The former caAt the annual Black and Blue<br />\nterer<br />\nis<br />\nnot available this year, for<br />\nJay banquet which will take place<br />\nit<br />\nis<br />\nfeared<br />\nhe still has a deficit<br />\nin the near future in the dormiBE A NEWSPAPER<br />\n.from<br />\nthe festive occasion of last<br />\ntory the staff elections will be<br />\nCORRESPONDENT<br />\nheld. Several vacancies on the season.<br />\nwith the Heacock Plan and earn a Art Staff will be filled at this<br />\nThe early appearance of the progood income while learning; we<br />\ngrams is due to hard work on the<br />\nmeeting.<br />\nshow you how; begin actual work<br />\nAn increase in the number of part of the committee. They are<br />\nat once; all or spare time; experifor the Black and of blue roan leather in rococo<br />\ncandidates<br />\nence unnecessary; no canvassing;<br />\nsend for particulars.<br />\nBlue Jay staffs is urged by Fitz- style, further embellished on the<br />\ngerald Dunning, Editor-in-chief. cover by the university seal. NuNEWSWRITERS TRAINING<br />\nmerous firms have submitted rare<br />\nBUREAU<br />\nand<br />\ndelightful favors for considerBARNSTORMERS' PRODUCTION OF<br />\nBuffalo, N. Y.<br />\n\"THE GALLOPER\" WELL REation but to date no specific samCEIVED<br />\nple has been decided upon.<br />\nContinued from page 1<br />\nFinancial considerations are<br />\nFor<br />\nFor<br />\ntended. As usual, a number of giving the committee no little<br />\nFOUNTAIN<br />\nGENERAL<br />\nfraternity box parties were given worry. It is hard for the average<br />\n,<br />\nUSE<br />\nPENS<br />\non both Friday and Saturday student to be convinced that upon<br />\nSold by<br />\nnights. The list of patronesses in- him depends the success of June<br />\nSTATIONERS, DRUG AND<br />\nDEPARTMENT STORES<br />\ncluded a number of the most Week, with all that it implies. It<br />\nprominent matrons in Baltimore is, of course, the university's faresociety.<br />\nwell to the graduate.<br />\nDiscussion of the rendering of<br />\nthe major roles will be found elseIs Taking the Country by Storm<br />\nEXCELLENT MATERIAL AND VETA complete set in bright<br />\nwhere in these pages. The less<br />\nERANS INSURE GOOD TENcolors, 144 tiles, 116 countNIS SEASON<br />\ners, 8 racks, 2 dice, book of<br />\nimportant characters, however,<br />\nrules and instructions: any<br />\nContinued<br />\nfrom page 1<br />\none can learn the game in<br />\nare by no means beneath notice:<br />\nten! minutes. All in attractive box, sent prepaid on<br />\nCRETAN EXILES — Robert present material and plenty of<br />\nreceipt of $1.00 (Canada<br />\n25c extra).<br />\nC. Griffith, III, Charles E. Vogle ; practice our team will have an<br />\nLarkin H. Farinholt, W. Nelson excellent chance to come out on<br />\nJ. Cookman Boyd, Jr., top.<br />\nYoung;<br />\nVery Attractive Black SatTeam Will Take Two Trips<br />\neen Mah-Jong Table Cover,<br />\nCharles B. Hines; J. Henry Jarwith colored dragon deThe<br />\nHopkins team has been ensigns, adjustable to any<br />\nH.<br />\nrett, Edward H. Watson; John<br />\nsize card table: 16 counter<br />\ntered<br />\nin<br />\nthe Middle Atlantic Secpockets, striking colored<br />\nFringer, Douglas S. Frantz; Chas.<br />\nstitched edges. Extraortional<br />\nTournament,<br />\nto be played<br />\ndinary value. Special price<br />\nC. Hazell, Rubin H. Flocks; IsiCOMBINATION OFFER: We will<br />\nat<br />\nHaverford<br />\nMay<br />\n31st,<br />\nbut bedore Bloom.<br />\nsend prepaid one complete Mahcause<br />\nof<br />\nthe<br />\nexaminations,<br />\nwhich<br />\nOFFICERS OF FOREIGN<br />\njong set and table cover as dewill<br />\nbe<br />\nin<br />\nfull<br />\nswing<br />\nat<br />\nscribed above on receipt of $2.50.<br />\nthat<br />\ntime,<br />\nLEGION OF GREEK ARMY—<br />\nit<br />\nwill<br />\nbe<br />\nprobably<br />\nunable<br />\nto<br />\nparCHINA-AMERICAN IMPORTING<br />\nHugh Jewett, III, Joseph LeoCOMPANY<br />\nticipate.<br />\nAn<br />\nattractive<br />\nschedule<br />\npold; Thomas F. McNeal, RidgeNew York<br />\n111 West 68th St.<br />\nis being prepared, with several<br />\nly Howard; T. Stran Summers,<br />\ntrips under consideration. At<br />\nGordon Donovan.<br />\nleast<br />\ntwo trips have been finally<br />\nALWAYS USE A<br />\nTURKISH SOLDIERS—John<br />\ndecided<br />\nupon: one to Easton„ to<br />\nH. Fringer, Jr., Charles F. Reese.<br />\nYELLOW CAB<br />\nmeet the team of the Easton CounOR PHONE<br />\nAfter gold footballs, baseballs, try Club, the other to play1212<br />\nVERNON<br />\nbasketballs, etc., were obtained for Georgetown University at GeorgeHAIL THEM ANYWHERE<br />\nall the respective teams at the town. It is especially desired<br />\nUniversity of Missouri, the track that as many students as possible<br />\ngo with the team on these trips<br />\nNECKWEAR team began to want emblems for<br />\nSHIRTS<br />\nand<br />\nlend it every support.<br />\nye old watch chain. So gold track<br /><br />\nraway<br />\n,,,,Afforgr<br />\nririf<br />\n\"ga<br />\n=6<br />\n,W47,<br />\n•<br />\n•■<br />\ngfreffavalfan<br />\nWt..'aiworeffeager<br />\nimworataiCir<br />\nsir or<br />\nowatt4,5<br />\n,<br />\nannwillea<br />\nmitardpw<br />\nMEIENE<br />\n,<br />\n1_ W<br />\nar 4,<br />\nIMO<br />\nl.<br />\ne<br />\nag<br />\nMOM OW 44<br />\n0<br />\n0101°.111<br />\nfirlOWWOdOljg<br />\n\"<br />\n0.11'47010<br /><br />\n•<br /><br />\nPer,<br /><br />\n-11011111111111111111111.<br />\n‘tolot<br />\n,:=11,<br />\n101.<br />\n4•10041111111111111.....<br />\n'<br />\n411114444441ftw<br /><br />\ntelt<br />\n'<br />\n..hrieteere•<br />\n.<br />\n4.:4<br />\n....<br />\n,<br />\n-<br /><br />\nvc<br /><br />\n4<br /><br />\nwat<br /><br />\nC<br /><br />\nSti<br /><br />\nNLY those<br /><br />\nwho have<br />\nsmoked Melachrinos<br />\ncan judge the quality<br />\nof the finest Turkish<br />\ntobacco.<br /><br />\nO<br /><br />\ngz<br />\nco<br />\ncc<br />\ntl<br />\nd(<br />\nro<br /><br />\nNV<br /><br />\nORIGINAL<br /><br />\nSi<br /><br />\nMEL CHRINO<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\ntl<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nig-<br /><br />\n14-4<br />\n,<br />\n)<br /><br />\nXatterie)<br />\nd4mzsOSCAR G.I-Orif<br /><br />\nLeFranc &amp; Ault<br /><br />\nshoes were obtained. Gold bathing suits are hereby suggested as POETRY OF A LIGHTER VEIN<br />\n421 N. HOWARD ST.<br />\nGLOVES suitable for the swimming team.<br />\nIf—<br />\nHOSIERY<br />\nKissing a miss<br />\nis<br />\nStore<br />\nFine<br />\nKissing<br />\namiss<br />\nGreetings<br />\nof<br />\na<br />\nThe<br />\nAre there<br />\nTo the Students of a Fine University<br />\nAny more blisses<br />\nIn kissing a Mrs?<br /><br />\nHOCHSCHILD.KOHN 8cCo.<br /><br />\n—Boll-Weevil.<br /><br />\n11<br /><br />\nHave you<br />\nseen it?<br /><br />\nOWN ERS<br />\n7'1P1411)<br />\n:<br />\n1\"1\":1•C.441.11/k°<br />\n29 E. BALTIMORE ST.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br /><br />\nLIBERTY ST.<br />\nAT SARATOGA<br /><br />\na<br /><br />\n411Something new in portable<br />\ntypewriters.<br />\n(Lit writes nearly all languages.<br /><br />\nLUNCHEON<br /><br />\nCHas 90 characters.<br /><br />\nTEA<br />\nDINNER<br />\n11.30A. M.<br />\nuntil<br />\n7.30 P. M<br /><br />\nSee Fred Rich, College<br />\nRepresentative<br /><br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br /><br />\nMah-Jong<br /><br />\nTable Covers<br /><br />\n\"ix(.I\"<br />\nCORONA<br /><br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br /><br />\nRENT A CAR<br /><br />\nDRIVE IT YOURSELF<br />\nFORDS, 12c PER MILE<br /><br />\nDODGES, 18c PER MILE<br /><br />\nSpecial Reduced Rates for 50 Miles or More<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 NORTH CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n411, Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />\nNew York University School of Retailing<br />\nTHE SCHOOL OF RETAILING TRAINS FOR<br />\nEXECUTIVE POSITIONS<br />\nMERCHANDISING<br />\nADVERTISING<br /><br />\nPERSONNEL<br />\nTRAINING<br /><br />\nTEACHING<br />\nSERVICE<br /><br />\nFINANCE AND CONTROL<br />\nMerchants Are Eager to Secure Trained Men and Women in These Fields.<br />\nSERVICE FELLOWSHIPS<br />\nCLASSROOM AND STORE ARE LINKED CLOSELY TOGETHER<br />\nIllustrated booklet on application. For further information write<br />\nDR. NORRIS A. BRISCOE<br />\nDIRECTOR OF NEW YORK UNIVERSITY SCHOOL OF RETAILING<br />\n100 WASHINGTON PLACE<br />\nNEW YORK CITY<br /><br />\n:1<br /><br />"}], "field_media_file": [{"target_id": 37857, "display": null, "description": null, "target_type": "file", "target_uuid": "d8ca9ed5-9dce-475d-94cc-de37d4f9488f", "url": "http://digital.library.jhu.edu/system/files/2022-03/13117-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13117, "target_type": "node", "target_uuid": "8c9dc1b3-7aff-4ece-9d22-53f274086c9a", "url": "/node/13117"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c84ecd35-bcdc-4fce-b6fa-daeb95d492a2"}]}