{"mid": [{"value": 35781}], "uuid": [{"value": "c0ae6851-2bc3-4979-9909-b960f239a6db"}], "vid": [{"value": 35781}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:13:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12308-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:13:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:13:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ",own.dev<br />\n<br />\n,<br />\nOor ,,w0,5E;,xyz<br />\n<br />\n111<br />\n<br />\n•<br />\n<br />\n\f„<br />\n<br />\n'<br />\n<br />\nrr*'.<br />\n<br />\nL.<br />\n<br />\n. 0.„<br />\n1111)hilit:5r<br />\n,t(<br />\n<br />\n,:f<br />\n<br />\nA<br />\n<br />\n;<br />\n4<br />\n<br />\ni- ,\"t!'\";<br />\n.•<br />\n<br />\n\"<br />\n<br />\n,<br />\n<br />\nno.<br />\n<br />\n11)N.<br />\nFor Iiraduzitr<br />\nI<br />\n<br />\nCa;<br />\n<br />\n,\\11<br />\n<br />\nt 'lir it<br />\n<br />\ntiItU 1+<br />\n<br />\nlU<br />\n<br />\n.;<br />\n<br />\n\\<br />\n<br />\n:<br />\n<br />\ntttiIF ft<br />\nirhy.n<br />\n<br />\ndt., grl.,e 4.0 M. IL-,<br />\n17or<br />\n<br />\n,tHatirl,.; I Ioe,Tt,<br />\n<br />\nl li. li)<br />\n<br />\n414,1e.Tgratto.oates:<br />\n<br />\n,1 .<br />\n<br />\nN.. ft,<br />\n<br />\n3,44,tu<br />\n<br />\n'.. A .<br />\n<br />\n(F)<br />\n<br />\nCooteat.a.itioils to ky.,yri(44.1g,), st<br />\nI .. ..tt..1.F5'11'<br />\nL<br />\np{,t.iIlVtt. it id<br />\n<br />\n,<br />\n<br />\nfi,i(p.tcrut .variy.,kia.,ge<br />\nA. \\].<br />\nX<br />\nXI.<br />\n<br />\nt 1,<br />\n<br />\n.phorntory.<br />\n;LV<br />\n<br />\nfrorn<br />\n<br />\n,<br />\n‘\",1,a1/,,,, „<br />\n<br />\nvirtitit..<br />\n<br />\n1.1<br />\n<br />\nr<br />\n<br />\nA tnericrua ,icrurtiztt of Inr.;allity,,.<br />\n111\"R<br />\n<br />\nih1i<br />\n<br />\nh'.,)<br />\n<br />\n1;5'<br />\n<br />\nI en, 1., 1\" roor<br />\n/1 111(1o,,vhd1/ El/joII:<br />\n. .<br />\n_<br />\n,<br />\n”<br />\nLL 1L.<br />\n<br />\n14/<br />\n/ //Auk 17,41,17,7in.<br />\nPr (Ink 11/0/'<br />\n<br />\nUndergraduate Courses Oleading to B. At<br />\n<br />\nto grAdthat:' terili<br />\nPt'rutn;it' of -thl'•<br />\n!,,,phy al)(1 ho Art,. and in the department of \\loth<br />\ntti Phi14,<br />\ntine, and also ol the untleryrailuate or collegiate courses,<br />\nwilL la sellt ou application to the Reyistrar,<br />\nC0111-,e; olIVICI1<br />\n<br />\nvigt, 1.<br />\nA lull<br />\n<br />\nse, eent,4<br />\nItuhltention,,;<br />\n<br />\n,<br />\n,ent OSI 5151)1untion.<br />\n<br />\n,ot and yernittances<br />\nComtnuttiontion in revoct to exchat.o..,<br />\n11211fitni\"ac, Mci<br />\nmay be se.nt to the johns<br />\n<br />\n\f\"A HOPKINS SIDE-LINER.\"<br />\n<br />\n\fTHE NEWS=LETTER<br />\nVol,. XI.<br />\n<br />\nNOVEMBER 9, 1906.<br />\n<br />\nNo. 2<br />\n<br />\nSubscriptions, p.so per year.<br />\n<br />\nPublished Fortnightly.<br />\n<br />\nio Cents per copy<br />\n<br />\nBOARD OF EDITORS.<br />\n<br />\nStanley Meade Reynolds, 1907, Editor-in-Chief.<br />\nArthur Leonard Bloomfield, 19127, Ass't Editor-in-Chief.<br />\nCarl Lewis Bernhardt, 1908, News Editor.<br />\nLawrence Melville Riddle, z9o8,<br />\nHarry K. Hardcastle, 1908,<br />\nF. B. Pedrick, 1909,<br />\n<br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, i9o8, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nAss't News Editors.<br />\n<br />\nAddress all articles, communications, etc., to Stanley M. Reynolds, Box 517 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Hermann J. Hughes, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br />\n<br />\nEDITORIAL.<br />\nUR readers, no doubt, will be surprised at the changed appearance of the<br />\nNEWS-14E1.m from the appearance presented by the first issue of this<br />\nyear. The explanation lies in the fact that the Board, composed as it is<br />\nof youthful talent, immature in its judgment, had not realized, when<br />\ngetting out the previous issue, that it was endangering the moral tone<br />\nof the University as a whole. We had made the somewhat pardonable<br />\nmistake of conceiving the purpose of a college paper to be to amuse,<br />\nrather than to instruct, its readers, and, in emulation of such of our<br />\nesteemed contemporaries as the Harvard \"Lampoon,\" the Cornell<br />\n\"Widow,\" and others too numerous to mention, we attempted to<br />\nmake the reading of the previous issue light and amusing, and more radical still, we introduced<br />\na number of cartoons. Unfortunately, however, in so doing, we laid ourselves open to the<br />\nserious charge of being vulgar in our cartoons and \"yellow\" in our written matter; and to<br />\nsuch an extent did we go that pressure was brought to bear in the form of alarmed surprise<br />\nand serious concern from someone \"interested in the welfare of the University.\" Being an<br />\noutsider, and a much older man, the gentleman concerned was in a better position than the<br />\nstudent subscribers, who were, we believe, pleased as a whole with the issue in question, to<br />\nrealize the possible consequences of putting forth from the undergraduates of the Johns Hopkins University a publication as undignified in character as the last issue of the NEWS-LETTER.<br />\nFar from wishing to endanger the moral tone of such a world-renowned institution as the<br />\nJohns Hopkins University, we are compelled, contrary as we believe the change to be to the<br />\nwishes of the majority of our subscribers, to hasten back to a more dignified and uplifting level.<br />\nE are glad to see that one of the daily papers has taken notice of the<br />\nStudent Contribution Fund idea advanced by the NEWS-LETTER in<br />\nits last issue; but unfortunately the appreciative daily in question<br />\nmisinterpreted the gist of the idea. The NEWS-LETTER did not<br />\nmean to limit the contributions to the Fund, which is to be used to<br />\nsome good service in the building at Homewood, to yearly appropriations by the graduating classes. On the other hand, we believe that<br />\nmore returns could be realized, with a less burden on the contributors, if every student in the University would contribute a little now<br />\nand then whenever he may chance to have a spare bit of change. We<br />\nopen the Fund column in this issue by a contribution of five dollars from the NEWS-LETTER<br />\nitself. Contributions will be received by the Business Manager of the NEWS-LETTER.<br />\n<br />\n.1<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nHE decrease in the study of Latin and Greek in our colleges is very<br />\nmuch to be deplored indeed. The old classical course, which stood for<br />\n•<br />\nit<br />\nso long, seems at last to have been overthrown, and the average college<br />\ngraduate of today does not know whether Aeschylus was an Egyptian<br />\nKing or a Norse Viking. The cry has been raised again and again that<br />\nthe classics are of no practical value, that they are a waste of time.<br />\nWhatever they are, however, they make cultured men, thinking men,<br />\nmen of wider experience, men-of mental calibre, something which the<br />\nstudy of the sciences alone cannot accomplish and never did. Take your<br />\nman with a purelyscie ntific education; he knows his facts pretty well, and<br />\nin due course of time, may attain a mediocre position; but the men who have been forces, who<br />\nhave held the very top, in the scientific world are those whose knowledge was based on a wide<br />\nexperience in the study of the classics. The fallacy lies right here. It is not the scientific<br />\neducation which develops a man's mind, it is a previous thorough training in the classics<br />\nwhich makes him afterward able to profit by such an education. Your little classical pedagogue<br />\nmay be scoffed at, but he has unlimited powers. The small scientific man stops right there.<br />\nIf we abandon everything to opportunism, if we admit that in the hurry and scurry of modern<br />\ntimes there is no time for pure education, drop the classics; but as long as anyone still believes<br />\nin true culture, let us fight to keep them with us.<br />\nift<br />\n2t<br />\n<br />\n.<br />\n<br />\n\"<br />\n.<br />\n<br />\nV<br />\n<br />\nHE Musical Clubs have gotten their work fairly started. In the last issue<br />\nof the NEWS-LETTER an appeal was made to the new students to come<br />\n,.. v v *Iry ww .<br />\nIf• )0<br />\nw 4,.,<br />\ni,<br />\nout<br />\nfor the Clubs. A number of names were sent in to the leaders of the<br />\nw<br />\nv<br />\nv<br />\nV c Mandolin and Glee Clubs, but when the first rehearsal was held not onew<br />\nw•<br />\nhalf of the candidates put in appearance. Notwithstanding this fact, a<br />\nw<br />\nv.<br />\nvery good practice was held by the Mandolin Club. The Glee Club did<br />\nV<br />\n-0 If<br />\nV<br />\ni<br />\nnot<br />\nmake as good a showing, for there was not more than five men<br />\n:V<br />\nV<br />\n• VVVVVVVVV<br />\n•<br />\npresent, and the leader was not among them. This must be remedied.<br />\nsF, *, The Musical Clubs cannot exist if the students do not take more interest<br />\nV<br />\nand work more earnestly. We have heard that there is very good<br />\nmaterial among the Freshmen for both Clubs. Now let us see at the next rehearsal every man<br />\nWho sent in his name—and others also.<br />\n<br />\n\"ALMA MATER.\"<br />\nOur Guardian Mother, Queen of Wisdom's sphere,<br />\nThe flaming steeds of princely learning guides;<br />\nAcross the boundless track she daily rides,<br />\nAnd leaves behind a brilliant pathway clear.<br />\nShe pities Wisdom's present darkness drear,<br />\nAnd boldly into Future's workshop strides;<br />\nIntent to see and learn she there abides,<br />\nAnd there to Future's secrets gives she ear.<br />\nShe hears each humble pygmy prayer,<br />\nAnd, hearing, leads us to the living fount,<br />\nWhere rise the Pierian waters wondrous rare;<br />\nAnd bids us each to drink, nor fear to mount<br />\nWhere she would lead, for she, in sooth,<br />\nShall reign forever Queen of perfect truth.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nA SUMMER STORM.<br />\nOf course, the first thing I did after reading<br />\nMarian's letter was to send for jimmy Peters.<br />\nJimmy and I were brothers and classmates at<br />\ncollege, and he has stuck true to me ever<br />\nsince, though our tastes and occupations would<br />\nlead us apart.<br />\n\"Jimmy,\" I began, as soon as he had come<br />\nto me, and had nearly broken my wrists with<br />\nthe old \"frat\" grip, which he always insists<br />\non using—as for myself, I have dropped all<br />\nsuch things long ago— 'Jimmy, I've just had<br />\na letter from my sister which has given me a<br />\ndreadful shock. You know Marian has been<br />\ntravelling and visiting in the West for the past<br />\nsix months, and it appears that she has struck<br />\nup some very doubtful friendships out there.<br />\nI disapproved of the whole trip; however, I<br />\ntrusted that when she came back and we<br />\nopened the old house up in the Maine woods<br />\nfot the summer, her enthusiasm for the West<br />\nwould wane and she would retain nothing<br />\nmore lasting or tangible than a few sentimental recollections.<br />\n\"But oh, Jimmy,\" and my tones grew<br />\ntragic, \"my worst apprehensions fell short<br />\nof the truth. Marian is coming home with<br />\na young woman, from Iowa, Jimmy, one of<br />\nthose common middle Westerners—you know<br />\nthe type—breezy and loud-voiced, and, of<br />\ncourse, with fuzzy yellow hair — I detest<br />\nblondes! She is, it seems, an orphan with no<br />\nin the world but an older brother. She met<br />\nMarian somewhere through mutual acquaintances, hoodwinked her with some imaginary<br />\ntale of woe, played upon my sister's soft<br />\nheart, and— is coming East with her to<br />\nspend 'a few weeks' at our old Maine home!<br />\nYou know my dread of women; why, I've<br />\nhardly spoken to a girl for fifteen years, and<br />\nthe prospect of this strange female, intruding<br />\non our quiet summer life is intolerable to me.<br />\nShe will have the place overrun with silly, idle<br />\nboys, she will torture the piano with 'popular'<br />\nmusic, she will upset the whole house, interfere with my work, and be always in the way.<br />\nAnd finally, her name, Jimmy—Lillian—<br />\nLillian Lane! That name spells adventuress;<br />\nI daresay she'll even be wanting to marry me,<br />\nbut she shan't do it, I tell you; I'll not let<br />\nher!\"<br />\n<br />\nI had worked myself into a fine rage.<br />\nJimmy was sympathetic, but had no suggestion to offer. He mildly hinted that Marian's<br />\nnatural refinement and good taste would prevent her from taking up anyone so hopeless<br />\nas I felt this young person to be.<br />\n\"Jimmy,\" I explained testily, \"for a sane<br />\nwoman of thirty-five, my sister takes the<br />\noddest fancies imaginable. I am prepared for<br />\nthe worst.\"<br />\nSo, here I am, doomed to go North in less<br />\nthan a week, and Marian and the young<br />\nwoman arrive about the same time. I have<br />\nthought of all sorts of plans, but there is<br />\nnothing I can do. I am at my wits' end.<br />\nHer hair is red! No, not that insufferable<br />\ncarrotty shade, but still uncompromisingly<br />\nred. When I ungraciously mentioned this<br />\nfact to Marian, she became indignant.<br />\n\"Anthony Carter,\" she cried, \"I'm ashamed<br />\nof you! Lillian's hair is lovely golden bronze,<br />\nsuch as any beauty might envy!\"<br />\n\"Golden bronze!\" I sniffed with contempt.<br />\n\"Anyhow, her eyes are like a china doll's,\" I<br />\nretorted.<br />\nBut Marian was equal to the demands of<br />\nthe occasion. 'They're just like violets,\"<br />\nshe answered calmly.<br />\nViolets, indeed! I'm afraid Marian's imagination is running away with her common<br />\nsense.<br />\nBut I must confess that, on the whole, the<br />\nyoung woman was an agreeable surprise. I<br />\nsuppose I'll have to describe her. She is<br />\nridiculously young—no more than twenty—<br />\nand she dresses always in white—fluffy, ruffiy<br />\nwhite things that make her appear still more<br />\nchildish. As I expected, she spends a great<br />\ndeal of time at the piano, playing and singing<br />\na lot of foolish songs. At first this annoyed<br />\nme and prevented me from writing, but I<br />\nthink I shall get accustomed to it in time.<br />\nHer voice, to my great relief, is gentle and<br />\nrefined.<br />\nShe has, or pretends to have, an interest in<br />\nmy work, and has already plagued me to let<br />\nher into my study and explain to her what I<br />\nam writing.<br />\n\"she begged, \"couldn't you, wouldn't<br />\nyou—just once—let me see some of the books;<br />\nI'd be so grateful!\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nShe opened her eyes wide—a familiar trick<br />\nwith girls, I believe—and looked at me imploringly.<br />\nBut /was not to be imposed upon. \"No,\"<br />\nI said, irritably, \"I can't have you have<br />\nyou prying about my study and disturbing<br />\nme with silly questions. My work is not a<br />\nPastime for children. No; it is impossible.\"<br />\nThen she drew herself up haughtily. \"Oh,\"<br />\nshe said, \"I didn't know you felt that way.<br />\nI didn't understand.\"<br />\nAnd she left the room with her chin up in<br />\nthe air.<br />\n<br />\n•<br />\n<br />\nThe boys have arrived! I knew it would be<br />\nSO. There is quite a colony of summer cottages and a camp at the other end of the lake,<br />\nand Marian occasionally pays calls over there<br />\nand, I suppose, has introduced the young<br />\nwoman to her friends. Now, there are always<br />\na number of strange canoes in our little boathouse, and strange young men roam about my<br />\ngarden.<br />\nYesterday evening I had gone off to have a<br />\nquiet pipe in the woods—the house is so noisy<br />\nof late I find it impossible to write—and corning home I stumbled over half a dozen of<br />\nthem grouped around her on the veranda,<br />\nmaking the air hideous with wretched harmonies and with the twang and plunk of their<br />\nguitars. She seemed to be enjoying it greatly<br />\nand I heard her irresponsible little giggle as I<br />\nturned up the walk to the house, but when<br />\nshe saw me she stopped laughing suddenly<br />\nand looked solemn. The boys, too, quieted<br />\ndown at sight of me and jumped to their feet<br />\nhalf shyly as I passed into the house.<br />\nBut I went up to my study with a great bitterness at my heart. Was I then such an old<br />\nbear, such a killjoy that these young people<br />\nshould become silent and afraid at sight of me?<br />\nI was hardly forty, yet my own youth had<br />\nbeen dead these fifteen years. Unconsciously<br />\nI pulled open a little drawer, long untouched,<br />\ncontaining some relics of my young days: my<br />\nfrat pins, discarded years ago; a couple of<br />\nloose pages of our college paper—I had been<br />\neditor in my day; a few photographs; a bunch<br />\nof dance programs, tied with a<br />\nbit of ribbon;<br />\nand a faded and broken fan. And,<br />\nas I sat<br />\nthere, old scences came back to me, old faces<br />\n<br />\n5<br />\n<br />\ncrowded round me, old memories surged over<br />\nme. The little fan I held in my hands—somebody else had held it once—somebody with<br />\nhair like flame and eyes — ah, yes, like<br />\nviolets! Someone who—ah, come, come,<br />\nnone of that! I closed the drawer and turned<br />\nto my work.<br />\nBut I wrote no more that night.<br />\nYesterday afternoon I was up to my elbows<br />\nin books and papers. rearranging some shelves.<br />\nOutside the storm that had been brewing all<br />\nday had finally broken loose. The rain fell in<br />\nsheets, the lightning and thunder were terrific,<br />\nand our peaceful lake was black and wild.<br />\nSuddenly Marian appeared at the door in<br />\ngreat excitement. \"Anthony,\" she cried, \"I<br />\nam worried to death about Lillian. She went<br />\nout over an hour ago to walk in the woods,<br />\nand though I warned her against the coming<br />\nstorm, she would not listen, and said she<br />\ndidn't mind rain. I don't know what I ought<br />\nto do.\"<br />\nI said something short and to the point, and<br />\ncommented briefly on the perversity of the<br />\nfeminine gender in toto. But I was downstairs before Marian could get in another word,<br />\nand out of the house, snatching up an old<br />\nulster as I ran.<br />\nFor half an hour I hunted through the<br />\nwoods, fighting off the anxiety that, against<br />\nmy will, grew upon me every moment. The<br />\nstorm had now considerably abated, and I<br />\nturned homeward along the lake path, thinking that perhaps she had gotten back to the<br />\nhouse from another direction. And, sure<br />\nenough, as I came in sight of our landing, I<br />\nsaw her coming towards me from the other<br />\nside.<br />\nShe was drenched, of course; the water<br />\ntrickled down off her hair into her face, and<br />\nher white flounces and flim-flams drooped dejectedly.<br />\n\"I was walking and went too far,\" she<br />\nsaid, apologetically; \"the storm came on before<br />\nI was aware of it; I have gotten very wet.\"<br />\nShe looked down at her bedraggled dress and<br />\nthen up at me with a pale little smile—oh,<br />\nthe veriest ghost of her usual giggle. And,<br />\nbefore I could answer—`'Oh,\" she exclaimed,<br />\n\"you're wet, too; you've been walking, too—<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ncatching sight of the coat on my arms. \"Did I think I had better be leaving—I'm a bit<br />\nhomesick. I think I want to go home.\"<br />\nyou go out after me?\"<br />\nThen my last bit of control left me, and<br />\nflung<br />\nI<br />\nend.<br />\nBut my endurance was at an<br />\nwords rushed to my lips \"So,\" I cried,<br />\nthe<br />\nfairly<br />\nand<br />\nthe coat around her shoulders,<br />\nis the way you would treat me! You<br />\n\"this<br />\npushed her up the walk.<br />\nmy life, unbidden; snatch away my<br />\ninto<br />\ncame<br />\n\"don't<br />\ngrowled;<br />\n\"Go into the house,\" I<br />\na ruthless hand; I am but forty,<br />\nwith<br />\npeace<br />\nYou'll<br />\nrain.<br />\nthe<br />\nin<br />\nstand there chattering<br />\nmyself an old man; I was asleep,<br />\nfancied<br />\nI<br />\nyet<br />\ninto<br />\nGo<br />\ndaresay.<br />\nI<br />\nhave pneumonia as it is,<br />\nawakened me to old memories,<br />\nhave<br />\nyou<br />\nbut<br />\nthe house!\"<br />\nlove—and now, now you<br />\ndead<br />\nyouth,<br />\ndead<br />\nwide,<br />\nwith<br />\na<br />\nmoment<br />\nme<br />\nShe looked at<br />\nthis. Why did you come<br />\nlike<br />\nme<br />\nleave<br />\nwould<br />\nturned<br />\nword<br />\na<br />\nwithout<br />\nand<br />\nthen<br />\nstartled eyes,<br />\ndone<br />\nthis thing?\"<br />\nyou<br />\nhave<br />\nwhy<br />\nhere;<br />\nher<br />\nat<br />\nmy<br />\nulster<br />\nholding<br />\npath,<br />\nup<br />\nthe<br />\nslowly<br />\nhurt her beyond all<br />\nhad<br />\nI<br />\nthat<br />\nthen<br />\nknew<br />\nI<br />\nthroat.<br />\nback on her and<br />\nmy<br />\nturned<br />\nI<br />\nand<br />\nrepair,<br />\nat<br />\nknock<br />\na<br />\ntimid<br />\ncame<br />\nthere<br />\nlater<br />\nAn hour<br />\nBut Lillian,<br />\nroom.<br />\nthe<br />\nleave<br />\nto<br />\nher<br />\nfor<br />\nwaited<br />\nit—<br />\nmy<br />\nheart—confound<br />\nand<br />\nmy study door,<br />\nto me,<br />\nover<br />\nran<br />\nsob,<br />\ncatching<br />\nlittle<br />\na<br />\nwith<br />\nAnd<br />\nhammer.<br />\nsledge<br />\na<br />\nlike<br />\nwent pounding<br />\nand<br />\nshoulders,<br />\nmy<br />\non<br />\nhands<br />\nboth<br />\nputting<br />\ntonguefelt<br />\nroom,I<br />\nthe<br />\ninto<br />\nher<br />\nlet<br />\nwhen I had<br />\ntears—And<br />\nthrough<br />\nface<br />\nmy<br />\ninto<br />\nup<br />\nlooked<br />\nknowing<br />\nnot<br />\nthere<br />\nstupidly,<br />\nand<br />\nstood<br />\ntied<br />\nin her eyes I read the answer to my question.<br />\nwhat to say.<br />\nBut she looked up into my gloomy face.<br />\nOf course, I wrote to Jimmy Peters at once<br />\n\"I have come,\" she said, \"to thank you for<br />\nyour trouble this afternoon. I know it was and told him he was to be my best man. And<br />\non my account that you went out into the Lillian's brother is coming—all the way from<br />\nstorm. And I have come to say—good-bye; Iowa—to give her away to me.<br />\n<br />\nTO THE NOW-TIME.<br />\nCome, gentle Phyllis, bide a bit and sit<br />\nUnder the Cigarette tree.<br />\nWe'll live on lotus leaves and sweets,<br />\nAnd I'll love you and you'll love me.<br />\nLet us live beside some babbling brook,<br />\nWatching the pebbles swirl,<br />\nThe Sons of men in the towns below<br />\nAre but men in the city's whirl.<br />\nFaith! we will live in Arcady,<br />\nNo care shall touch us there;<br />\nFor what want we of the Whither and Whence;<br />\nNor yet of the After and Where.<br />\nLet us live in the Now-time<br />\nWith music of brook and bird calls,<br />\nIf we love each other well now<br />\nWhat care we when the old world falls?<br />\nCome, gentle Phyllis, bide a bit and sit<br />\nUnder the Cigarette tree.<br />\nWe'll live on lotus leaves and sweets,<br />\nAnd I'll love you and you'll love me.<br />\n<br />\nTHE SOLDIERS OF FORTUNE.<br />\nWe fight for love,—not woman's love,<br />\nBut the love of Our Lady Chance.<br />\nIn fever lands and ice bound zones<br />\nWhere ever she calls our lance.<br />\nSome paltry King stirs up a war;<br />\nHe'll give us a medal and fun;<br />\nCome gallop and fight with a smile on your face;<br />\nCome on! You can point a gun.<br />\nFor we are smittten with Wanderlust,<br />\nWe fret in the city walls.<br />\nCome jump in saddle and run your horse;<br />\nWhere the smell o' powder calls.<br />\n0 what care we, if we risk our lives?<br />\nThe world goes on the same.<br />\nThe city men die in stupid ways;<br />\nCome on let us play the game.<br />\nFor we are the last of the race of men,<br />\nThe Sons of the Gods are we!<br />\nWith blood in our veins and blood on our hands,<br />\n'But thank the Lord—we are free!<br />\nC. B.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nA LITERARY CENTRE.<br />\n<br />\nSTUDENT CONTRIBUTION FUND.<br />\n<br />\nSomeone who has been asked to write the<br />\nliterary history of Baltimore, for one of the<br />\ncritical journals of this country, remarked to<br />\nthe writer that he could not understand why<br />\nthis community had been more or less lacking<br />\nin the pursuit of letters. On reflecting, he<br />\ncame to the conclusion that, apart from the<br />\npersonal element, the chief reason has been<br />\nthat Baltimore has had no center of learning<br />\nuntil the Johns Hopkins University came into<br />\nexistence. It is true that the University of<br />\nMaryland maintained a department of the<br />\nhumanities, but it did not rise to the excellence and influence of its, at one time,<br />\nfamous medical department. This may only<br />\nhave Veen a sign that there was no demand<br />\nfor the department. It is true, that of the<br />\ntwo most prominent literary men, who were<br />\nconnected at some time in their career with<br />\nBaltimore—Poe and Lanier—the latter was<br />\nvery intimately associated with Hopkins.<br />\nBut it seems to many observers that the background, which is obtained at Cambridge and<br />\nOxford, in England, and Harvard, in this<br />\ncountry, is a more stimulating influence on the<br />\nman of letters than is the specializing which<br />\nis characteristic of this and the German Universities. However, there are many of the<br />\nYounger alumni of this institution who are<br />\nnow connected with publishing houses, magazines and other journalistic enterprises, and<br />\nit seems fair to hope that the literary courses<br />\nat Hopkins will continue to develop when<br />\nthe University moves to Homewood. The influence of Hopkins as a literary center is<br />\ngradually spreading through the community,<br />\nand so keen an observer as Henry James<br />\nnoticed it as one of the most potent forces in<br />\nBaltimore. Let him who is interested in this<br />\nphase of Hopkins, read the article in the<br />\nNorth American Review\" by Mr. James and<br />\nhe will indeed take heart.<br />\n<br />\n(Contributions should be sent to Mr. Hermann J. Hughes, Business Manager, Johns<br />\nHopkins NEWS LETTER, Box 224, John Hopkins University.)<br />\n<br />\nIf YOU wish to show appreciation of what<br />\nYour Alma Mater means to you; if you wish<br />\nto do YOUR share in preparing a home for her<br />\nat Homewood; contribute your spare change<br />\nto the Student Contribution Fund.<br />\n<br />\nNEWS LETTER<br />\n<br />\n$5.00<br />\n<br />\nBUBBLES THAT BURST.<br />\nFor it was a castle of air, my lads,<br />\nBuilt in the dreams of youth,<br />\nWith shining walls and tow'ring height;<br />\nA glorious sight, in sooth!<br />\nAlack! alas! all dreams must pass,<br />\nAnd with each dream its hope;<br />\nMy castle bright was razed in a night,<br />\nFor its walls were raised on dope.<br />\nComrades eight, it seems that fate,<br />\nWould shatter what dreams would give.<br />\nKeep in the grooves, experience proves<br />\nOnly the old can live.<br />\n<br />\nA NEW EXCUSE.<br />\n\"Really,\" said Slopay, \"you'll have to excuse me today. I'm not well and besides<br />\nyou'll have to see my wife about this bill.\"<br />\n\"Oh, come,\" cried the collector, \"you contracted this bill yourself and you should pay<br />\nit yourself without trying to\"—<br />\n\"But I tell you I'm not myself today.\"<br />\n—Exchange.<br />\n<br />\nTHE PLAINT OF ARGUS.<br />\nOft' in the night thro' hours passing slow,<br />\nI lie with staring eyes and burning brain,<br />\nFed with enkindling thoughts that quickly<br />\nglow,<br />\nUntil a roaring furnace fire doth drain<br />\nThe last few drops from out my parched eyes.<br />\nThe pow'r engendered from this roaring heat,<br />\nTo set my frame in frenzied action tries,<br />\nAnd like a ponderous pounding press I beat<br />\nMy arms and limbs about; and toss and turn;<br />\nAnd groan and curse; and press my feverish<br />\nhands<br />\nAgainst my throbbing brows that hotter burn,<br />\nBut fail to loose the glowing, cutting bands.<br />\nAll this the world well knows; yet none<br />\nknows well,<br />\nSave those who nightly see this fearful hell.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n'VARSITY LACROSSE.<br />\nCaptain Tough is back from the mines, full<br />\nof mining engineering and lacrosse. At anytime of the day you can get him started on<br />\neither of those subjects, and he will even miss<br />\nclasses to tell you how he is worrying his<br />\nbrain to get the Crescent Athletic Club of<br />\nBrooklyn down here next spring. He says,<br />\nthat, with nine men back from the team that<br />\nlined up against Swarthmore last May, he is<br />\nafraid the team will get swelled heads, and<br />\nnot win the championship in 1907. He says,<br />\ntoo, that his thumb is now 0. K., and this is<br />\ndoubtless true, for you no longer see the<br />\nplaster cast as big as a fist.<br />\n\"All's safe, Walter, Harry's in the goal,\"<br />\nwill doubtless be heard again this year, for<br />\nboth Blanck and Schmeisser are again with<br />\nus. Almost any Wednesday afternoon you<br />\nmay see Erlanger sprinting up and down the<br />\ntrack in company with Knipp. Breyer and<br />\nFrank will soon be out with their old white<br />\nhats of last year. Chesney, by the way, is<br />\nsporting a new black and blue skull-cap with<br />\na huge tassel; wasn't she good to make it for<br />\nhim? That reminds one of Raleigh, with his<br />\nassortment of head-gear last year. He has<br />\nbeen seen lately in the cage, making his deft,<br />\nfoxy passes to MacSherry.<br />\nThe team will greatly miss the services of<br />\nMeyer, Dill and Hudgins, and some new men<br />\nmust begotten to fill their places. At present,<br />\nthere seem to be several good men. Everybody seems to be interested in developing<br />\nCharlie Mathias' leg-work. You may sec the<br />\ncaptain and Charlie holding serious consultations which has resulted in the announcement<br />\nthat Mathias will limber up with the track<br />\nteam.<br />\nTo get the best idea of the lacrosse squad,<br />\ngo up in the gym some Tuesday or Thursday<br />\nnight, and watch the track and lacrosse men<br />\ngoing through stunts designed to make them<br />\nbetter runners. The only trouble is, that<br />\nthere are not enough Freshmen out. Wake<br />\nup, 1909! Now is the time to start in on<br />\nstick- and leg-work.<br />\n<br />\nSWARTHMORE WINS.<br />\nThere is more honor, someone has said, in<br />\na hard-fought defeat, than in an easily won<br />\nvictory, and in this respect every Hopkins man<br />\nshould feel proud over the magnificent showing made by the Varsity football team against<br />\nthe unbeaten aggregation from Swarthmore,<br />\nbig hefty beeves, whose 200-pound line kept<br />\nPenn from scoring against it, while at the<br />\nsame time allowing its own quarterback<br />\nO'Brien to drop-kick a goal over Penn's bars.<br />\nAlthough Hopkins did not score on Swarthmore, and although the visitors crossed our<br />\ngoal-line for four touchdowns they were compelled to fight and fight hard for every inch<br />\ngained.<br />\nThe pluck of our lads showed itself especially in the second half, when, worn out and<br />\nbruised by the terrific plunges of the heavy<br />\nvisitors, our men fought even more fiercely<br />\nthan before, keeping the ball down in Swarthmore territory continuously for fifteen minutes.<br />\nThe work of Costello and Ridgely was particularly creditable, and was remarked on by<br />\nseveral Swarthmore players after the game was<br />\nover. Chesney has steadily improved as the<br />\nseason has progressed, and much credit is due<br />\nhim for his work against Swarthmore, several<br />\nfirst-downs being gained by him on quarterback runs.<br />\nWebb played the hardest game of his<br />\ncareer at Hopkins, and only when absolutely<br />\nexhausted by fatigue did he retire to the sidelines. Hart shared honors with Costello, and<br />\ntime and again his speed carried the ball out<br />\nof danger.<br />\nJarvis played a hard plucky game at centre<br />\nthroughout the game, although time and<br />\nagain Swarthmore's heavy backs attacked<br />\nhim.<br />\nFrom the other side, those who witnessed<br />\nthe playing of the visitors, were certainly<br />\ntreated to a rare display of football. Almost<br />\nevery conceivable device permitted under the<br />\nnew rules was tried by the Swarthmore eleven,<br />\nand no one, following the beautiful plays and<br />\nmagnificent team work, would care to dispute<br />\nthe claim of the red-jersied giants to a place in<br />\nthe Big Four class.<br />\nThe wonderful advance which Swarthmore<br />\nhas made in football shows convincingly what<br />\nis possible from a squad which, supported<br />\nheart and soul by the student body as a whole,<br />\nis determined to win out.<br />\nBoys, remember, the student body is heart<br />\nand soul with you in your preparations to<br />\nwipe out the defeat last year at the hand of<br />\nSt. Johns'. Play as hard as you did against<br />\nSwarthmore, and the victory is yours.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nHOPKINS, 0—STEVENS, 0.<br />\nMud, and lots of it. That is the whole<br />\nstory of the game with Stevens on October 27.<br />\nFor days before the game there had been a<br />\nsteady downpour, and during frequent intervals Saturday morning it rained. Everyone<br />\nknows the result.<br />\nUrged on by the excited cheers of perhaps<br />\nfifty spectators, the Black and Blue team battled manfully, and bit the mud—literally and<br />\nfiguratively—of a tie game. Hopkins could<br />\nnot score and Stevens could not score. About<br />\nall either team could do was to slip and slide,<br />\nnow on their feet, and now on other portions<br />\nof their anatomy.<br />\nThe team certainly did show much improvement over the way it played against Delaware.<br />\nSeveral of the older men were out, and some<br />\nchanges in the lineup were made that proved<br />\nbeneficial. Moss was seen back at right<br />\nguard, and Captain Preble got in the game at<br />\ncenter in the second half. Roemer, left end,<br />\nhaving left the University, one of the Sawyer's<br />\nwent to his position, while the other Sawyer<br />\nplayed right tackle in place of Haas. Webb<br />\nwas in at full, and Stewart and Abel took<br />\nHart's place.<br />\nThe uncertain footing and the slippery ball<br />\nmade hard work for the backs, especially since<br />\nthe game soon turned out to be a kicking one.<br />\nHere it was that Michael excelled, for the<br />\nHopkins gained on every exchange of punts.<br />\nAgain Chesney was uncertain in handling<br />\nPunts, and will have to take a brace.<br />\nStevens worked a beautiful forward pass for<br />\na good gain of from 20 to 25 yards, but they<br />\ndid not make first down any oftener than did<br />\nHopkins.<br />\nIt was a pity that the weather was so bad,<br />\nfor it takes money to bring a team down from<br />\nNew York, and a crowd (?) of fifty will not<br />\ngo a long way towards making money on the<br />\ngame.<br />\n<br />\nBig Four crowds at the games will not be<br />\nseen until we get on our field at Homewood<br />\nWith the 'Varsity buildings all around. Do<br />\nYOUR part towards getting there by contributing to the Student Contribution Fund.<br />\n<br />\n9<br />\n<br />\nHOPKINS, 0—MT. WASHINGTON, 6.<br />\nFor the first time in the history of the<br />\nChair of Football at the Johns Hopkins University the Mt. Washington Football Team<br />\nfrustrated the attempts of the sturdy warriors<br />\nfrom our beloved Alma Mater and defeated<br />\nthem by six points to nothing.<br />\nAs it was, the defeat was accomplished by<br />\nonly a few inches, for had the ball not been<br />\ncarried outside the bounds eight inches from<br />\nthe goal line, the score would have been tied.<br />\nLack of sufficient outdoor practice was in<br />\nthe main part responsible for the defeat, and<br />\nespecially practice in the art of catching the<br />\nball as it descended from its lofty flights<br />\nthrough the atmosphere. Michael was more<br />\nsuccessful than his opponent in bringing the<br />\nleather-covered-spheroid in contact with his<br />\nright pedal extremity, but the Mountaineer<br />\nbacks had greater practice in catching it and,<br />\ntherefore, lost it less often.<br />\nThe Hopkins team played a grand game,<br />\nand in the second half fairly played Mt.<br />\nWashington off their feet. The work of Costello was especially noteworthy, both in<br />\nnegotiating the field with the ball in his arms<br />\nand also in grappling his opponents by the<br />\nlower limbs, thereby bringing them in forciable contact with mother earth. Several of<br />\nthe Mt. Washington heroes were very argumentative in spirit, but unfortunately showed<br />\na tendency to argue with their closed hands<br />\nrather than with their vocal organs. No<br />\nfatal bodily injury followed this tendency, although the ardor of the game resulted in the<br />\nbreaking of another bone in Captain Preble's<br />\nknee.<br />\n<br />\nWHAT THEY EAT.<br />\nThe Banker—Rolls and doughnuts.<br />\nThe Dentist—Pullets.<br />\nThe Ball Player—Batter cakes.<br />\nThe Jeweler—Lady fingers.<br />\nThe Lumberman—Chops.<br />\nThe Actress—Lobsters.<br />\nThe Chef—Bacon.<br />\nThe Surveyor—Steaks.<br />\nThe Broker—Lamb.<br />\nThe Dry Goods Merchant—Flannel cakes.<br />\nThe Dramatic Critic—Roasts.<br />\nThe Chiropodist—Corned beef.<br />\nThe Pittsburg Millionaire—Broilers:<br />\nThe Gambler—Saratoga chips.<br />\nThe Promoter—Watermelon.—Exchange•<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nJIM OVERHOLTZ'S RETURN.<br />\nIt was current gossip in Finchville that Jim<br />\nOverholtz had borrowed money to get a marriage license, and, when, after three years of<br />\nteam work in which he carried but a small<br />\nburden of the load on his own neck, he left<br />\nfor other fields, the story was repeated with<br />\ndouble the gusto.<br />\nThe situation at the barber shop conference<br />\nwas dismissed in expressive language. \"As<br />\nlong as Jim had his traces loose he was all<br />\nright on the off side, but the minute Sary tied<br />\nhim to the wheel on the near side, Jim he sort<br />\nof busted the traces.\"<br />\nOne said Jim was bumming his way, another<br />\nthat he was running a side-show at the State<br />\nfair, third and general opinion that he had<br />\njoined the Army.<br />\nNow, Sary played in Finchville and did the<br />\nsame work she had done for three years and<br />\nlonger, and prospered well, having but three<br />\nmouths to feed instead of five, for Jim took<br />\nwith him Loop—boon companion,fellow, goodfor-nothing and dog—a philosopher of the<br />\nsame school. She soon realized the height of<br />\nher small ambitions—lace curtains—only to<br />\nbring over the horizon another desire—an<br />\neasel with \"almost any sort of a picture on it<br />\nto fill up the corner.\"<br />\nOne day Sary happened to be in the \"city\"<br />\nwhile a rummage sale was in progress, and<br />\nshe brought back on the \"buss\"—among bird<br />\ncages and unsoldered tinware—an easel with<br />\na crayon portrait of a man in middle life—<br />\nanything may be bought at a rummage sale.<br />\nIt was to Mandy Loop that she explained<br />\nthat it would be a good example to the children, and by this means it took hours for it to<br />\nmake a complete circuit of the town.<br />\nWhen Sary's, weak-eyed and washed out,<br />\nDickey and Lura came to the age of understanding, it was duly impressed on their minds<br />\nthat the sacred one on the easel, who was to<br />\nbe approached with reverence like unto some<br />\nheathen god, was their father, and when they<br />\ngrew up they were to emulate him who left<br />\nthem orphans.<br />\nThe town mused over it and then considered<br />\nit the proper thing morally and otherwise to<br />\n<br />\ncarry on the illusion. Jim, the outcast, was<br />\nto be blotted from existence—no breath of his<br />\npast to breathe on the lives of Dickey and<br />\nLura. It enlarged on, found anecdotes,<br />\nqualities, sayings, and a past history for the<br />\npicture, and set itself to believe it, while Sary<br />\ngrounded the children in it.<br />\nIt was at least 7.30 when a man with garments, suggestive of the comic supplement<br />\ntramps, got off the tail end of a local freight<br />\nwith a skill which argued a familiarity with<br />\nthat mode of travel. It was dark when, unseen,<br />\nthe same person walked with a familiar air<br />\ninto Sary Overholtz's yard. He looked long<br />\nthrough the windows into the brightly lighted<br />\nroom. He saw a well-swept hearth, a brilliant<br />\nfire, two pale, washed out children, and a<br />\nlarge picture with an easel draped with some<br />\nscarlet flimsy texture.<br />\nHe sighed and said unto himself: \"Well,<br />\nSary, if you've found your man, it'd be a<br />\nshame to disturb you \" The local gave a<br />\nsqueal.<br />\n<br />\nALUMNI NOTES.<br />\n'06. Thomas Campbell, captain of last<br />\nyear's baseball team is a master at St. James<br />\nSchool, Hagerstown, Md.<br />\n'06. Henry Findlay French,formerly editorin-chief of the NEWS-LETTUR is studying law<br />\nat the University of Maryland.<br />\n'06 (Ph.D.). Charles J. Robinson is at the<br />\nRockefeller Institute, New York City.<br />\n'06. Carl Mengel is studying law at the<br />\nUniversity of Maryland.<br />\n'05. William R. Straughn is professor of<br />\nEnglish at the Pennsylvania State Normal<br />\nSchool, Millersville, Pa.<br />\n'04. Frank Stollenwerck is finishing up<br />\nhis law course at the Harvard Law School.<br />\nHe will graduate in June.<br />\n'99. James Morfit Mullen is prospering<br />\nunder an attorney-at-law sign, 1137 Calvert<br />\nBuilding.<br />\n<br />\n\f11<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE ATHLETIC FIELD.<br />\n<br />\nCHRISTIAN ASSOCIATIAN NOTES.<br />\n<br />\nIf anyone should ask in what condition<br />\nthe athletic field is, it would be difficult to<br />\ntell him. Since there is no car line running<br />\npast the field—an obstacle which, we are<br />\nPromised, will be overcome before next fall—<br />\nit is almost impossible to get out to the<br />\ngrounds owing to the heavy rains. The field<br />\nitself is almost completed except for planting<br />\nthe grass seeds, and it will be ready for use<br />\nat the beginning of the next collegiate year.<br />\nWe expected to be able to play on the field<br />\nthis year, but the delay was unavoidable.<br />\nAs President Remsen explained, when the<br />\nfield was thought completed, it was found<br />\nthat there was not proper drainage; so it had<br />\nto be dug up again, and a sub-soil drainage<br />\nput in, which required a great deal of time<br />\nand money. When the field is finished we<br />\nshall be the possessors of one of the finest<br />\nathletic fields in the country. As yet there<br />\nare no stands or buildings. If more funds are<br />\nnot quickly obtained, we shall have an<br />\nexcellent field without any grandstands or<br />\nnecessary buildings for the teams. The<br />\nspectators will have to be content to stand up<br />\nall during the games.<br />\n<br />\nCaptain D. A. Davis, of the Syracuse<br />\n'Varsity Crew, 1907, will be the speaker at<br />\nthe first of the series of monthly meetings<br />\nin Levering Hall. His topic will be: \"The<br />\nRace of Our Lives.\" Mr. M. T. Adkins of<br />\nthe Medical School will sing.<br />\nCaptain Davis is a man of strong personality, one of the type admired by every college man. He was stroke of the world's<br />\nrecord four-oared crew, 1905. His athletic<br />\nrenown alone will render him attractive to<br />\nHopkins men. Mr. Adkins, of course, needs<br />\nno introduction here. November 13 is the<br />\ndate for the meeting.<br />\n<br />\nThe Bible Study campaign has resulted in<br />\nthe enrollment of a number of men. Courses<br />\nare provided for all students, graduates and<br />\nundergraduates.<br />\n<br />\nYoung Men's Christian Association:<br />\nYou May Contribute Also<br />\nTo the Student Contribution Fund.<br />\n<br />\nUNIVERSITY NOTES.<br />\nThe Cotillon Club has at last fixed upon<br />\nfinal dates for the dances, which according to<br />\nthe latest arrangement are to be as follows:<br />\nNovember 30; February 1; and April 5. A<br />\nlarge number of students and alumni have<br />\nalready signed up and the series promise to<br />\nbe successful.<br />\nWhen being conducted about the University<br />\nbuildings last Wednesday, Sir William Henry<br />\nPerkin, was heard to remark upon the miserable<br />\nPaving which the cily is willing should remain<br />\nabout the halls of an institution for which it<br />\nis more renowned abroad than for all its other<br />\nadvantages taken together.<br />\n<br />\nJUST LIKE HER.<br />\nNo girl who read a tale of love,<br />\nBut in her heart will say<br />\nThe heroine reminds her of<br />\nHerself in every way.<br />\n—Exchange.<br />\n<br />\nEXCHANGES.<br />\nAYE!<br />\nJust a little water,<br />\nJust a little rye,<br />\nMake a man see double,<br />\nAnd have a bleary eye.<br />\n—Philadelphia Press.<br />\n<br />\nA BAD NIGHT.<br />\nUncle Reuben was taking his first ocean<br />\nvoyage down to Florida.<br />\n\"Did you sleep well, uncle?\" they asked him<br />\nafter the first night out.<br />\n\"Not perticler,\" he replied, \"Them bustles<br />\nye hey t' tie under yer arms kinda keep a<br />\nfeller from restin'.\"—Life.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n12<br />\n<br />\nBOOK NOTICES.<br />\nThe Boys' Life of Abraham Lincoln. By<br />\nHelen Nicolay. Illustrations by Hambidge and others. 12mo, 307 pages. Price,<br />\n$1.50. New York: The Century Co<br />\nWhile the title seems to limit the interest of<br />\nthis book to boys, it is a record for girls as<br />\nwell. For, as years go by, the nobility and<br />\nfar-reaching influence of Abraham Lincoln's<br />\ncharacter are being more and more widely<br />\n<br />\nrecognized and highly honored; and the story<br />\nof this great American's life and work is one<br />\nfor every young American citizen to read<br />\nand re-read often. As Miss Helen Nicolay<br />\nhas written the story, it is a vivid and inspiring narrative, with the weight of authority—based upon the standard life of<br />\nLincoln, written by Lincoln's secretaries,<br />\nJohn G. Nicolay and John Hay. Fully and<br />\nattractively illustrated, \"The Boys' Life of<br />\nLincoln\" should take permanent rank as a<br />\nyoung people's classic.<br />\n<br />\nR. Q. TAYLOR & CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br />\n<br />\nNORTH<br />\n<br />\nConklin's<br />\nSelfFilling<br />\n<br />\nCHARLES STREET<br />\n<br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink,a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br />\n<br />\nDo You Enjoy GOOD Cigarettes?<br />\nIf so, let us make you a Sample<br />\n<br />\nI:HE<br />\na<br />\n<br />\nJ. MANKOWITZ, 1101 E. Baltimore Street<br />\nCHAS.<br />\n<br />\nG. FRANK<br />\n<br />\nT. RVAN<br />\n<br />\nPen<br />\n<br />\nWARD<br />\n<br />\n74,!,<br />\n<br />\nAll the best dealers everywhere8\"trillTtg.<br />\n<br />\nRYAN & WARD<br />\n<br />\n—<br />\n:<br />\nap<br />\nre7aVesrs<br />\nOl<br />\n<br />\nVZI:TI,>rigg,httat<br />\n<br />\nupon having<br />\n<br />\npens of best grade. WO styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fountain pen repaired promptly.<br />\nTHE CONKLIN PEN CO,<br />\n<br />\nDesigners and Makers of<br />\n<br />\nMen's Clothes<br />\n16 NORTH LIBERTY STREET<br />\n<br />\n.7<br />\n<br />\n414-1,10-1116 Jefferson Ave., Telledo,Oile.<br />\nBole Ern CoakIls Solt-71111se rea.<br />\n<br />\n;<br />\n<br />\nBALTimoRit. MD.<br />\n<br />\nUnder Brewers' Exchange<br />\n<br />\nBaltimore Steam Packet Company<br />\n(OLD<br />\n<br />\nBAY<br />\n<br />\nLINE)<br />\n<br />\nFOR<br />\n<br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br />\n<br />\nTICKET OFFICES<br />\n<br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br />\n<br />\n109 North Charles Street<br />\n506 Light Street<br />\n<br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday, 6.30 p. m. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br />\n<br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br />\n<br />\nE. BROWN,<br />\nGeneral Passenger Agent<br />\n<br />\n\f\fEmmERT<br />\nTailor<br />\n<br />\n.c.<br />\n<br />\n'11'0<br />\n<br />\nyOtt<br />\n<br />\nto\") be<br />\n<br />\njJ;;'14iii?T<br />\n<br />\nFOW\\ES<br />\n<br />\nCollrve 1,1erthcs,.<br />\n<br />\nvii<br />\n<br />\nNot high in price, bat way up to<br />\n<br />\nii iA'F'S /MI, YOU<br />\n<br />\n„•X<br />\n<br />\n.74%<br />\n<br />\nNUI1.1) To<br />\n<br />\n.1,<br />\n<br />\nI0 F. I'A YET<br />\n<br />\nS R 13* T<br />\n<br />\nKNOW<br />\n<br />\nABOU 1' A GLOVE<br />\n<br />\nCHIDT TO 01Z1017R IN<br />\n.<br />\n<br />\nWI_ MAKI.; tl A<br />\nep Iot/U<br />\n<br />\n01111% I \"I ME<br />\n<br />\nNicPHERSONS<br />\nI<br />\n<br />\nEAST RAJ AMOR!: STRIA-if<br />\n<br />\n.<br />\n,4144 410<br />\n....401.00e.molon,re..¢014<br />\n<br />\n1*-4<br />\n<br />\nS<br />\n(<br />\n<br />\n) II:<br />\n<br />\n?, 41 30<br />\n11.11411M111•111.<br />\n<br />\n13.<br />\n<br />\n1.1:X1N(JON STREIT,<br />\n<br />\nRALliMORE,<br />\n<br />\n-<br />\n<br />\n1.1.1114.5414Moraloi...nommln4svernil<br />\n<br />\n1<br />\n<br />\n4<br />\n<br />\nF. C<br />\nC. FOSSL71 ('-cY SON<br />\nfltcu'<br />\n-1<br />\n<br />\n,1<br />\n<br />\niASi<br />\n<br />\nill<br />\n<br />\nBALTIMOk<br />\n<br />\nSI<br />\n<br />\nBaltimore, Md.<br />\n•<br />\n<br />\nA,.4,<br />\n<br />\ntww, ..,aur..anwpwurait.<br />\n<br />\nwrItftSkinirae<br />\n,<br />\n,<br />\n<br />\n44,<br />\n.....n.mok.momegooroonnownpxolorymmeoirom1.....*...\"*<br />\n,<br />\n<br />\nTHE YOUNG MEN'S STORE<br />\n<br />\nrRAus BRos.<br />\nTAILORS<br />\n<br />\nHATIf..tIF<br />\n<br />\nFUR<br />\n<br />\nCIi)iIflRS<br />\n<br />\n20 \\V. Baltimore 51_, 29<br />\n<br />\nKEEP YOUR EYE<br />\nON THIS SPACE<br />\n<br />\nAdjUhlihim' .1442.,W 03. &U.ru;iidinp•<br />\n<br />\nVISITORS ARE ALWAYS WELCOME<br />\n<br />\n\"Wireri rnakii kr. your- purchuses, kindly roneniber our ti.dvertiers<br />\n<br />\n\f", "format": "basic_html", "processed": ",own.dev<br /><br />\n,<br />\nOor ,,w0,5E;,xyz<br /><br />\n111<br /><br />\n•<br /><br />\n„<br /><br />\n'<br /><br />\nrr*'.<br /><br />\nL.<br /><br />\n. 0.„<br />\n1111)hilit:5r<br />\n,t(<br /><br />\n,:f<br /><br />\nA<br /><br />\n;<br />\n4<br /><br />\ni- ,\"t!'\";<br />\n.•<br /><br />\n\"<br /><br />\n,<br /><br />\nno.<br /><br />\n11)N.<br />\nFor Iiraduzitr<br />\nI<br /><br />\nCa;<br /><br />\n,\\11<br /><br />\nt 'lir it<br /><br />\ntiItU 1+<br /><br />\nlU<br /><br />\n.;<br /><br />\n\\<br /><br />\n:<br /><br />\ntttiIF ft<br />\nirhy.n<br /><br />\ndt., grl.,e 4.0 M. IL-,<br />\n17or<br /><br />\n,tHatirl,.; I Ioe,Tt,<br /><br />\nl li. li)<br /><br />\n414,1e.Tgratto.oates:<br /><br />\n,1 .<br /><br />\nN.. ft,<br /><br />\n3,44,tu<br /><br />\n'.. A .<br /><br />\n(F)<br /><br />\nCooteat.a.itioils to ky.,yri(44.1g,), st<br />\nI .. ..tt..1.F5'11'<br />\nL<br />\np{,t.iIlVtt. it id<br /><br />\n,<br /><br />\nfi,i(p.tcrut .variy.,kia.,ge<br />\nA. \\].<br />\nX<br />\nXI.<br /><br />\nt 1,<br /><br />\n.phorntory.<br />\n;LV<br /><br />\nfrorn<br /><br />\n,<br />\n‘\",1,a1/,,,, „<br /><br />\nvirtitit..<br /><br />\n1.1<br /><br />\nr<br /><br />\nA tnericrua ,icrurtiztt of Inr.;allity,,.<br />\n111\"R<br /><br />\nih1i<br /><br />\nh'.,)<br /><br />\n1;5'<br /><br />\nI en, 1., 1\" roor<br />\n/1 111(1o,,vhd1/ El/joII:<br />\n. .<br />\n_<br />\n,<br />\n”<br />\nLL 1L.<br /><br />\n14/<br />\n/ //Auk 17,41,17,7in.<br />\nPr (Ink 11/0/'<br /><br />\nUndergraduate Courses Oleading to B. At<br /><br />\nto grAdthat:' terili<br />\nPt'rutn;it' of -thl'•<br />\n!,,,phy al)(1 ho Art,. and in the department of \\loth<br />\ntti Phi14,<br />\ntine, and also ol the untleryrailuate or collegiate courses,<br />\nwilL la sellt ou application to the Reyistrar,<br />\nC0111-,e; olIVICI1<br /><br />\nvigt, 1.<br />\nA lull<br /><br />\nse, eent,4<br />\nItuhltention,,;<br /><br />\n,<br />\n,ent OSI 5151)1untion.<br /><br />\n,ot and yernittances<br />\nComtnuttiontion in revoct to exchat.o..,<br />\n11211fitni\"ac, Mci<br />\nmay be se.nt to the johns<br /><br />\n\"A HOPKINS SIDE-LINER.\"<br /><br />\nTHE NEWS=LETTER<br />\nVol,. XI.<br /><br />\nNOVEMBER 9, 1906.<br /><br />\nNo. 2<br /><br />\nSubscriptions, p.so per year.<br /><br />\nPublished Fortnightly.<br /><br />\nio Cents per copy<br /><br />\nBOARD OF EDITORS.<br /><br />\nStanley Meade Reynolds, 1907, Editor-in-Chief.<br />\nArthur Leonard Bloomfield, 19127, Ass't Editor-in-Chief.<br />\nCarl Lewis Bernhardt, 1908, News Editor.<br />\nLawrence Melville Riddle, z9o8,<br />\nHarry K. Hardcastle, 1908,<br />\nF. B. Pedrick, 1909,<br /><br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, i9o8, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nAss't News Editors.<br /><br />\nAddress all articles, communications, etc., to Stanley M. Reynolds, Box 517 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Hermann J. Hughes, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br /><br />\nEDITORIAL.<br />\nUR readers, no doubt, will be surprised at the changed appearance of the<br />\nNEWS-14E1.m from the appearance presented by the first issue of this<br />\nyear. The explanation lies in the fact that the Board, composed as it is<br />\nof youthful talent, immature in its judgment, had not realized, when<br />\ngetting out the previous issue, that it was endangering the moral tone<br />\nof the University as a whole. We had made the somewhat pardonable<br />\nmistake of conceiving the purpose of a college paper to be to amuse,<br />\nrather than to instruct, its readers, and, in emulation of such of our<br />\nesteemed contemporaries as the Harvard \"Lampoon,\" the Cornell<br />\n\"Widow,\" and others too numerous to mention, we attempted to<br />\nmake the reading of the previous issue light and amusing, and more radical still, we introduced<br />\na number of cartoons. Unfortunately, however, in so doing, we laid ourselves open to the<br />\nserious charge of being vulgar in our cartoons and \"yellow\" in our written matter; and to<br />\nsuch an extent did we go that pressure was brought to bear in the form of alarmed surprise<br />\nand serious concern from someone \"interested in the welfare of the University.\" Being an<br />\noutsider, and a much older man, the gentleman concerned was in a better position than the<br />\nstudent subscribers, who were, we believe, pleased as a whole with the issue in question, to<br />\nrealize the possible consequences of putting forth from the undergraduates of the Johns Hopkins University a publication as undignified in character as the last issue of the NEWS-LETTER.<br />\nFar from wishing to endanger the moral tone of such a world-renowned institution as the<br />\nJohns Hopkins University, we are compelled, contrary as we believe the change to be to the<br />\nwishes of the majority of our subscribers, to hasten back to a more dignified and uplifting level.<br />\nE are glad to see that one of the daily papers has taken notice of the<br />\nStudent Contribution Fund idea advanced by the NEWS-LETTER in<br />\nits last issue; but unfortunately the appreciative daily in question<br />\nmisinterpreted the gist of the idea. The NEWS-LETTER did not<br />\nmean to limit the contributions to the Fund, which is to be used to<br />\nsome good service in the building at Homewood, to yearly appropriations by the graduating classes. On the other hand, we believe that<br />\nmore returns could be realized, with a less burden on the contributors, if every student in the University would contribute a little now<br />\nand then whenever he may chance to have a spare bit of change. We<br />\nopen the Fund column in this issue by a contribution of five dollars from the NEWS-LETTER<br />\nitself. Contributions will be received by the Business Manager of the NEWS-LETTER.<br /><br />\n.1<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nHE decrease in the study of Latin and Greek in our colleges is very<br />\nmuch to be deplored indeed. The old classical course, which stood for<br />\n•<br />\nit<br />\nso long, seems at last to have been overthrown, and the average college<br />\ngraduate of today does not know whether Aeschylus was an Egyptian<br />\nKing or a Norse Viking. The cry has been raised again and again that<br />\nthe classics are of no practical value, that they are a waste of time.<br />\nWhatever they are, however, they make cultured men, thinking men,<br />\nmen of wider experience, men-of mental calibre, something which the<br />\nstudy of the sciences alone cannot accomplish and never did. Take your<br />\nman with a purelyscie ntific education; he knows his facts pretty well, and<br />\nin due course of time, may attain a mediocre position; but the men who have been forces, who<br />\nhave held the very top, in the scientific world are those whose knowledge was based on a wide<br />\nexperience in the study of the classics. The fallacy lies right here. It is not the scientific<br />\neducation which develops a man's mind, it is a previous thorough training in the classics<br />\nwhich makes him afterward able to profit by such an education. Your little classical pedagogue<br />\nmay be scoffed at, but he has unlimited powers. The small scientific man stops right there.<br />\nIf we abandon everything to opportunism, if we admit that in the hurry and scurry of modern<br />\ntimes there is no time for pure education, drop the classics; but as long as anyone still believes<br />\nin true culture, let us fight to keep them with us.<br />\nift<br />\n2t<br /><br />\n.<br /><br />\n\"<br />\n.<br /><br />\nV<br /><br />\nHE Musical Clubs have gotten their work fairly started. In the last issue<br />\nof the NEWS-LETTER an appeal was made to the new students to come<br />\n,.. v v *Iry ww .<br />\nIf• )0<br />\nw 4,.,<br />\ni,<br />\nout<br />\nfor the Clubs. A number of names were sent in to the leaders of the<br />\nw<br />\nv<br />\nv<br />\nV c Mandolin and Glee Clubs, but when the first rehearsal was held not onew<br />\nw•<br />\nhalf of the candidates put in appearance. Notwithstanding this fact, a<br />\nw<br />\nv.<br />\nvery good practice was held by the Mandolin Club. The Glee Club did<br />\nV<br />\n-0 If<br />\nV<br />\ni<br />\nnot<br />\nmake as good a showing, for there was not more than five men<br />\n:V<br />\nV<br />\n• VVVVVVVVV<br />\n•<br />\npresent, and the leader was not among them. This must be remedied.<br />\nsF, *, The Musical Clubs cannot exist if the students do not take more interest<br />\nV<br />\nand work more earnestly. We have heard that there is very good<br />\nmaterial among the Freshmen for both Clubs. Now let us see at the next rehearsal every man<br />\nWho sent in his name—and others also.<br /><br />\n\"ALMA MATER.\"<br />\nOur Guardian Mother, Queen of Wisdom's sphere,<br />\nThe flaming steeds of princely learning guides;<br />\nAcross the boundless track she daily rides,<br />\nAnd leaves behind a brilliant pathway clear.<br />\nShe pities Wisdom's present darkness drear,<br />\nAnd boldly into Future's workshop strides;<br />\nIntent to see and learn she there abides,<br />\nAnd there to Future's secrets gives she ear.<br />\nShe hears each humble pygmy prayer,<br />\nAnd, hearing, leads us to the living fount,<br />\nWhere rise the Pierian waters wondrous rare;<br />\nAnd bids us each to drink, nor fear to mount<br />\nWhere she would lead, for she, in sooth,<br />\nShall reign forever Queen of perfect truth.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nA SUMMER STORM.<br />\nOf course, the first thing I did after reading<br />\nMarian's letter was to send for jimmy Peters.<br />\nJimmy and I were brothers and classmates at<br />\ncollege, and he has stuck true to me ever<br />\nsince, though our tastes and occupations would<br />\nlead us apart.<br />\n\"Jimmy,\" I began, as soon as he had come<br />\nto me, and had nearly broken my wrists with<br />\nthe old \"frat\" grip, which he always insists<br />\non using—as for myself, I have dropped all<br />\nsuch things long ago— 'Jimmy, I've just had<br />\na letter from my sister which has given me a<br />\ndreadful shock. You know Marian has been<br />\ntravelling and visiting in the West for the past<br />\nsix months, and it appears that she has struck<br />\nup some very doubtful friendships out there.<br />\nI disapproved of the whole trip; however, I<br />\ntrusted that when she came back and we<br />\nopened the old house up in the Maine woods<br />\nfot the summer, her enthusiasm for the West<br />\nwould wane and she would retain nothing<br />\nmore lasting or tangible than a few sentimental recollections.<br />\n\"But oh, Jimmy,\" and my tones grew<br />\ntragic, \"my worst apprehensions fell short<br />\nof the truth. Marian is coming home with<br />\na young woman, from Iowa, Jimmy, one of<br />\nthose common middle Westerners—you know<br />\nthe type—breezy and loud-voiced, and, of<br />\ncourse, with fuzzy yellow hair — I detest<br />\nblondes! She is, it seems, an orphan with no<br />\nin the world but an older brother. She met<br />\nMarian somewhere through mutual acquaintances, hoodwinked her with some imaginary<br />\ntale of woe, played upon my sister's soft<br />\nheart, and— is coming East with her to<br />\nspend 'a few weeks' at our old Maine home!<br />\nYou know my dread of women; why, I've<br />\nhardly spoken to a girl for fifteen years, and<br />\nthe prospect of this strange female, intruding<br />\non our quiet summer life is intolerable to me.<br />\nShe will have the place overrun with silly, idle<br />\nboys, she will torture the piano with 'popular'<br />\nmusic, she will upset the whole house, interfere with my work, and be always in the way.<br />\nAnd finally, her name, Jimmy—Lillian—<br />\nLillian Lane! That name spells adventuress;<br />\nI daresay she'll even be wanting to marry me,<br />\nbut she shan't do it, I tell you; I'll not let<br />\nher!\"<br /><br />\nI had worked myself into a fine rage.<br />\nJimmy was sympathetic, but had no suggestion to offer. He mildly hinted that Marian's<br />\nnatural refinement and good taste would prevent her from taking up anyone so hopeless<br />\nas I felt this young person to be.<br />\n\"Jimmy,\" I explained testily, \"for a sane<br />\nwoman of thirty-five, my sister takes the<br />\noddest fancies imaginable. I am prepared for<br />\nthe worst.\"<br />\nSo, here I am, doomed to go North in less<br />\nthan a week, and Marian and the young<br />\nwoman arrive about the same time. I have<br />\nthought of all sorts of plans, but there is<br />\nnothing I can do. I am at my wits' end.<br />\nHer hair is red! No, not that insufferable<br />\ncarrotty shade, but still uncompromisingly<br />\nred. When I ungraciously mentioned this<br />\nfact to Marian, she became indignant.<br />\n\"Anthony Carter,\" she cried, \"I'm ashamed<br />\nof you! Lillian's hair is lovely golden bronze,<br />\nsuch as any beauty might envy!\"<br />\n\"Golden bronze!\" I sniffed with contempt.<br />\n\"Anyhow, her eyes are like a china doll's,\" I<br />\nretorted.<br />\nBut Marian was equal to the demands of<br />\nthe occasion. 'They're just like violets,\"<br />\nshe answered calmly.<br />\nViolets, indeed! I'm afraid Marian's imagination is running away with her common<br />\nsense.<br />\nBut I must confess that, on the whole, the<br />\nyoung woman was an agreeable surprise. I<br />\nsuppose I'll have to describe her. She is<br />\nridiculously young—no more than twenty—<br />\nand she dresses always in white—fluffy, ruffiy<br />\nwhite things that make her appear still more<br />\nchildish. As I expected, she spends a great<br />\ndeal of time at the piano, playing and singing<br />\na lot of foolish songs. At first this annoyed<br />\nme and prevented me from writing, but I<br />\nthink I shall get accustomed to it in time.<br />\nHer voice, to my great relief, is gentle and<br />\nrefined.<br />\nShe has, or pretends to have, an interest in<br />\nmy work, and has already plagued me to let<br />\nher into my study and explain to her what I<br />\nam writing.<br />\n\"she begged, \"couldn't you, wouldn't<br />\nyou—just once—let me see some of the books;<br />\nI'd be so grateful!\"<br /><br />\nTHE NEWS-LETTER.<br /><br />\nShe opened her eyes wide—a familiar trick<br />\nwith girls, I believe—and looked at me imploringly.<br />\nBut /was not to be imposed upon. \"No,\"<br />\nI said, irritably, \"I can't have you have<br />\nyou prying about my study and disturbing<br />\nme with silly questions. My work is not a<br />\nPastime for children. No; it is impossible.\"<br />\nThen she drew herself up haughtily. \"Oh,\"<br />\nshe said, \"I didn't know you felt that way.<br />\nI didn't understand.\"<br />\nAnd she left the room with her chin up in<br />\nthe air.<br /><br />\n•<br /><br />\nThe boys have arrived! I knew it would be<br />\nSO. There is quite a colony of summer cottages and a camp at the other end of the lake,<br />\nand Marian occasionally pays calls over there<br />\nand, I suppose, has introduced the young<br />\nwoman to her friends. Now, there are always<br />\na number of strange canoes in our little boathouse, and strange young men roam about my<br />\ngarden.<br />\nYesterday evening I had gone off to have a<br />\nquiet pipe in the woods—the house is so noisy<br />\nof late I find it impossible to write—and corning home I stumbled over half a dozen of<br />\nthem grouped around her on the veranda,<br />\nmaking the air hideous with wretched harmonies and with the twang and plunk of their<br />\nguitars. She seemed to be enjoying it greatly<br />\nand I heard her irresponsible little giggle as I<br />\nturned up the walk to the house, but when<br />\nshe saw me she stopped laughing suddenly<br />\nand looked solemn. The boys, too, quieted<br />\ndown at sight of me and jumped to their feet<br />\nhalf shyly as I passed into the house.<br />\nBut I went up to my study with a great bitterness at my heart. Was I then such an old<br />\nbear, such a killjoy that these young people<br />\nshould become silent and afraid at sight of me?<br />\nI was hardly forty, yet my own youth had<br />\nbeen dead these fifteen years. Unconsciously<br />\nI pulled open a little drawer, long untouched,<br />\ncontaining some relics of my young days: my<br />\nfrat pins, discarded years ago; a couple of<br />\nloose pages of our college paper—I had been<br />\neditor in my day; a few photographs; a bunch<br />\nof dance programs, tied with a<br />\nbit of ribbon;<br />\nand a faded and broken fan. And,<br />\nas I sat<br />\nthere, old scences came back to me, old faces<br /><br />\n5<br /><br />\ncrowded round me, old memories surged over<br />\nme. The little fan I held in my hands—somebody else had held it once—somebody with<br />\nhair like flame and eyes — ah, yes, like<br />\nviolets! Someone who—ah, come, come,<br />\nnone of that! I closed the drawer and turned<br />\nto my work.<br />\nBut I wrote no more that night.<br />\nYesterday afternoon I was up to my elbows<br />\nin books and papers. rearranging some shelves.<br />\nOutside the storm that had been brewing all<br />\nday had finally broken loose. The rain fell in<br />\nsheets, the lightning and thunder were terrific,<br />\nand our peaceful lake was black and wild.<br />\nSuddenly Marian appeared at the door in<br />\ngreat excitement. \"Anthony,\" she cried, \"I<br />\nam worried to death about Lillian. She went<br />\nout over an hour ago to walk in the woods,<br />\nand though I warned her against the coming<br />\nstorm, she would not listen, and said she<br />\ndidn't mind rain. I don't know what I ought<br />\nto do.\"<br />\nI said something short and to the point, and<br />\ncommented briefly on the perversity of the<br />\nfeminine gender in toto. But I was downstairs before Marian could get in another word,<br />\nand out of the house, snatching up an old<br />\nulster as I ran.<br />\nFor half an hour I hunted through the<br />\nwoods, fighting off the anxiety that, against<br />\nmy will, grew upon me every moment. The<br />\nstorm had now considerably abated, and I<br />\nturned homeward along the lake path, thinking that perhaps she had gotten back to the<br />\nhouse from another direction. And, sure<br />\nenough, as I came in sight of our landing, I<br />\nsaw her coming towards me from the other<br />\nside.<br />\nShe was drenched, of course; the water<br />\ntrickled down off her hair into her face, and<br />\nher white flounces and flim-flams drooped dejectedly.<br />\n\"I was walking and went too far,\" she<br />\nsaid, apologetically; \"the storm came on before<br />\nI was aware of it; I have gotten very wet.\"<br />\nShe looked down at her bedraggled dress and<br />\nthen up at me with a pale little smile—oh,<br />\nthe veriest ghost of her usual giggle. And,<br />\nbefore I could answer—`'Oh,\" she exclaimed,<br />\n\"you're wet, too; you've been walking, too—<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\ncatching sight of the coat on my arms. \"Did I think I had better be leaving—I'm a bit<br />\nhomesick. I think I want to go home.\"<br />\nyou go out after me?\"<br />\nThen my last bit of control left me, and<br />\nflung<br />\nI<br />\nend.<br />\nBut my endurance was at an<br />\nwords rushed to my lips \"So,\" I cried,<br />\nthe<br />\nfairly<br />\nand<br />\nthe coat around her shoulders,<br />\nis the way you would treat me! You<br />\n\"this<br />\npushed her up the walk.<br />\nmy life, unbidden; snatch away my<br />\ninto<br />\ncame<br />\n\"don't<br />\ngrowled;<br />\n\"Go into the house,\" I<br />\na ruthless hand; I am but forty,<br />\nwith<br />\npeace<br />\nYou'll<br />\nrain.<br />\nthe<br />\nin<br />\nstand there chattering<br />\nmyself an old man; I was asleep,<br />\nfancied<br />\nI<br />\nyet<br />\ninto<br />\nGo<br />\ndaresay.<br />\nI<br />\nhave pneumonia as it is,<br />\nawakened me to old memories,<br />\nhave<br />\nyou<br />\nbut<br />\nthe house!\"<br />\nlove—and now, now you<br />\ndead<br />\nyouth,<br />\ndead<br />\nwide,<br />\nwith<br />\na<br />\nmoment<br />\nme<br />\nShe looked at<br />\nthis. Why did you come<br />\nlike<br />\nme<br />\nleave<br />\nwould<br />\nturned<br />\nword<br />\na<br />\nwithout<br />\nand<br />\nthen<br />\nstartled eyes,<br />\ndone<br />\nthis thing?\"<br />\nyou<br />\nhave<br />\nwhy<br />\nhere;<br />\nher<br />\nat<br />\nmy<br />\nulster<br />\nholding<br />\npath,<br />\nup<br />\nthe<br />\nslowly<br />\nhurt her beyond all<br />\nhad<br />\nI<br />\nthat<br />\nthen<br />\nknew<br />\nI<br />\nthroat.<br />\nback on her and<br />\nmy<br />\nturned<br />\nI<br />\nand<br />\nrepair,<br />\nat<br />\nknock<br />\na<br />\ntimid<br />\ncame<br />\nthere<br />\nlater<br />\nAn hour<br />\nBut Lillian,<br />\nroom.<br />\nthe<br />\nleave<br />\nto<br />\nher<br />\nfor<br />\nwaited<br />\nit—<br />\nmy<br />\nheart—confound<br />\nand<br />\nmy study door,<br />\nto me,<br />\nover<br />\nran<br />\nsob,<br />\ncatching<br />\nlittle<br />\na<br />\nwith<br />\nAnd<br />\nhammer.<br />\nsledge<br />\na<br />\nlike<br />\nwent pounding<br />\nand<br />\nshoulders,<br />\nmy<br />\non<br />\nhands<br />\nboth<br />\nputting<br />\ntonguefelt<br />\nroom,I<br />\nthe<br />\ninto<br />\nher<br />\nlet<br />\nwhen I had<br />\ntears—And<br />\nthrough<br />\nface<br />\nmy<br />\ninto<br />\nup<br />\nlooked<br />\nknowing<br />\nnot<br />\nthere<br />\nstupidly,<br />\nand<br />\nstood<br />\ntied<br />\nin her eyes I read the answer to my question.<br />\nwhat to say.<br />\nBut she looked up into my gloomy face.<br />\nOf course, I wrote to Jimmy Peters at once<br />\n\"I have come,\" she said, \"to thank you for<br />\nyour trouble this afternoon. I know it was and told him he was to be my best man. And<br />\non my account that you went out into the Lillian's brother is coming—all the way from<br />\nstorm. And I have come to say—good-bye; Iowa—to give her away to me.<br /><br />\nTO THE NOW-TIME.<br />\nCome, gentle Phyllis, bide a bit and sit<br />\nUnder the Cigarette tree.<br />\nWe'll live on lotus leaves and sweets,<br />\nAnd I'll love you and you'll love me.<br />\nLet us live beside some babbling brook,<br />\nWatching the pebbles swirl,<br />\nThe Sons of men in the towns below<br />\nAre but men in the city's whirl.<br />\nFaith! we will live in Arcady,<br />\nNo care shall touch us there;<br />\nFor what want we of the Whither and Whence;<br />\nNor yet of the After and Where.<br />\nLet us live in the Now-time<br />\nWith music of brook and bird calls,<br />\nIf we love each other well now<br />\nWhat care we when the old world falls?<br />\nCome, gentle Phyllis, bide a bit and sit<br />\nUnder the Cigarette tree.<br />\nWe'll live on lotus leaves and sweets,<br />\nAnd I'll love you and you'll love me.<br /><br />\nTHE SOLDIERS OF FORTUNE.<br />\nWe fight for love,—not woman's love,<br />\nBut the love of Our Lady Chance.<br />\nIn fever lands and ice bound zones<br />\nWhere ever she calls our lance.<br />\nSome paltry King stirs up a war;<br />\nHe'll give us a medal and fun;<br />\nCome gallop and fight with a smile on your face;<br />\nCome on! You can point a gun.<br />\nFor we are smittten with Wanderlust,<br />\nWe fret in the city walls.<br />\nCome jump in saddle and run your horse;<br />\nWhere the smell o' powder calls.<br />\n0 what care we, if we risk our lives?<br />\nThe world goes on the same.<br />\nThe city men die in stupid ways;<br />\nCome on let us play the game.<br />\nFor we are the last of the race of men,<br />\nThe Sons of the Gods are we!<br />\nWith blood in our veins and blood on our hands,<br />\n'But thank the Lord—we are free!<br />\nC. B.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nA LITERARY CENTRE.<br /><br />\nSTUDENT CONTRIBUTION FUND.<br /><br />\nSomeone who has been asked to write the<br />\nliterary history of Baltimore, for one of the<br />\ncritical journals of this country, remarked to<br />\nthe writer that he could not understand why<br />\nthis community had been more or less lacking<br />\nin the pursuit of letters. On reflecting, he<br />\ncame to the conclusion that, apart from the<br />\npersonal element, the chief reason has been<br />\nthat Baltimore has had no center of learning<br />\nuntil the Johns Hopkins University came into<br />\nexistence. It is true that the University of<br />\nMaryland maintained a department of the<br />\nhumanities, but it did not rise to the excellence and influence of its, at one time,<br />\nfamous medical department. This may only<br />\nhave Veen a sign that there was no demand<br />\nfor the department. It is true, that of the<br />\ntwo most prominent literary men, who were<br />\nconnected at some time in their career with<br />\nBaltimore—Poe and Lanier—the latter was<br />\nvery intimately associated with Hopkins.<br />\nBut it seems to many observers that the background, which is obtained at Cambridge and<br />\nOxford, in England, and Harvard, in this<br />\ncountry, is a more stimulating influence on the<br />\nman of letters than is the specializing which<br />\nis characteristic of this and the German Universities. However, there are many of the<br />\nYounger alumni of this institution who are<br />\nnow connected with publishing houses, magazines and other journalistic enterprises, and<br />\nit seems fair to hope that the literary courses<br />\nat Hopkins will continue to develop when<br />\nthe University moves to Homewood. The influence of Hopkins as a literary center is<br />\ngradually spreading through the community,<br />\nand so keen an observer as Henry James<br />\nnoticed it as one of the most potent forces in<br />\nBaltimore. Let him who is interested in this<br />\nphase of Hopkins, read the article in the<br />\nNorth American Review\" by Mr. James and<br />\nhe will indeed take heart.<br /><br />\n(Contributions should be sent to Mr. Hermann J. Hughes, Business Manager, Johns<br />\nHopkins NEWS LETTER, Box 224, John Hopkins University.)<br /><br />\nIf YOU wish to show appreciation of what<br />\nYour Alma Mater means to you; if you wish<br />\nto do YOUR share in preparing a home for her<br />\nat Homewood; contribute your spare change<br />\nto the Student Contribution Fund.<br /><br />\nNEWS LETTER<br /><br />\n$5.00<br /><br />\nBUBBLES THAT BURST.<br />\nFor it was a castle of air, my lads,<br />\nBuilt in the dreams of youth,<br />\nWith shining walls and tow'ring height;<br />\nA glorious sight, in sooth!<br />\nAlack! alas! all dreams must pass,<br />\nAnd with each dream its hope;<br />\nMy castle bright was razed in a night,<br />\nFor its walls were raised on dope.<br />\nComrades eight, it seems that fate,<br />\nWould shatter what dreams would give.<br />\nKeep in the grooves, experience proves<br />\nOnly the old can live.<br /><br />\nA NEW EXCUSE.<br />\n\"Really,\" said Slopay, \"you'll have to excuse me today. I'm not well and besides<br />\nyou'll have to see my wife about this bill.\"<br />\n\"Oh, come,\" cried the collector, \"you contracted this bill yourself and you should pay<br />\nit yourself without trying to\"—<br />\n\"But I tell you I'm not myself today.\"<br />\n—Exchange.<br /><br />\nTHE PLAINT OF ARGUS.<br />\nOft' in the night thro' hours passing slow,<br />\nI lie with staring eyes and burning brain,<br />\nFed with enkindling thoughts that quickly<br />\nglow,<br />\nUntil a roaring furnace fire doth drain<br />\nThe last few drops from out my parched eyes.<br />\nThe pow'r engendered from this roaring heat,<br />\nTo set my frame in frenzied action tries,<br />\nAnd like a ponderous pounding press I beat<br />\nMy arms and limbs about; and toss and turn;<br />\nAnd groan and curse; and press my feverish<br />\nhands<br />\nAgainst my throbbing brows that hotter burn,<br />\nBut fail to loose the glowing, cutting bands.<br />\nAll this the world well knows; yet none<br />\nknows well,<br />\nSave those who nightly see this fearful hell.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\n'VARSITY LACROSSE.<br />\nCaptain Tough is back from the mines, full<br />\nof mining engineering and lacrosse. At anytime of the day you can get him started on<br />\neither of those subjects, and he will even miss<br />\nclasses to tell you how he is worrying his<br />\nbrain to get the Crescent Athletic Club of<br />\nBrooklyn down here next spring. He says,<br />\nthat, with nine men back from the team that<br />\nlined up against Swarthmore last May, he is<br />\nafraid the team will get swelled heads, and<br />\nnot win the championship in 1907. He says,<br />\ntoo, that his thumb is now 0. K., and this is<br />\ndoubtless true, for you no longer see the<br />\nplaster cast as big as a fist.<br />\n\"All's safe, Walter, Harry's in the goal,\"<br />\nwill doubtless be heard again this year, for<br />\nboth Blanck and Schmeisser are again with<br />\nus. Almost any Wednesday afternoon you<br />\nmay see Erlanger sprinting up and down the<br />\ntrack in company with Knipp. Breyer and<br />\nFrank will soon be out with their old white<br />\nhats of last year. Chesney, by the way, is<br />\nsporting a new black and blue skull-cap with<br />\na huge tassel; wasn't she good to make it for<br />\nhim? That reminds one of Raleigh, with his<br />\nassortment of head-gear last year. He has<br />\nbeen seen lately in the cage, making his deft,<br />\nfoxy passes to MacSherry.<br />\nThe team will greatly miss the services of<br />\nMeyer, Dill and Hudgins, and some new men<br />\nmust begotten to fill their places. At present,<br />\nthere seem to be several good men. Everybody seems to be interested in developing<br />\nCharlie Mathias' leg-work. You may sec the<br />\ncaptain and Charlie holding serious consultations which has resulted in the announcement<br />\nthat Mathias will limber up with the track<br />\nteam.<br />\nTo get the best idea of the lacrosse squad,<br />\ngo up in the gym some Tuesday or Thursday<br />\nnight, and watch the track and lacrosse men<br />\ngoing through stunts designed to make them<br />\nbetter runners. The only trouble is, that<br />\nthere are not enough Freshmen out. Wake<br />\nup, 1909! Now is the time to start in on<br />\nstick- and leg-work.<br /><br />\nSWARTHMORE WINS.<br />\nThere is more honor, someone has said, in<br />\na hard-fought defeat, than in an easily won<br />\nvictory, and in this respect every Hopkins man<br />\nshould feel proud over the magnificent showing made by the Varsity football team against<br />\nthe unbeaten aggregation from Swarthmore,<br />\nbig hefty beeves, whose 200-pound line kept<br />\nPenn from scoring against it, while at the<br />\nsame time allowing its own quarterback<br />\nO'Brien to drop-kick a goal over Penn's bars.<br />\nAlthough Hopkins did not score on Swarthmore, and although the visitors crossed our<br />\ngoal-line for four touchdowns they were compelled to fight and fight hard for every inch<br />\ngained.<br />\nThe pluck of our lads showed itself especially in the second half, when, worn out and<br />\nbruised by the terrific plunges of the heavy<br />\nvisitors, our men fought even more fiercely<br />\nthan before, keeping the ball down in Swarthmore territory continuously for fifteen minutes.<br />\nThe work of Costello and Ridgely was particularly creditable, and was remarked on by<br />\nseveral Swarthmore players after the game was<br />\nover. Chesney has steadily improved as the<br />\nseason has progressed, and much credit is due<br />\nhim for his work against Swarthmore, several<br />\nfirst-downs being gained by him on quarterback runs.<br />\nWebb played the hardest game of his<br />\ncareer at Hopkins, and only when absolutely<br />\nexhausted by fatigue did he retire to the sidelines. Hart shared honors with Costello, and<br />\ntime and again his speed carried the ball out<br />\nof danger.<br />\nJarvis played a hard plucky game at centre<br />\nthroughout the game, although time and<br />\nagain Swarthmore's heavy backs attacked<br />\nhim.<br />\nFrom the other side, those who witnessed<br />\nthe playing of the visitors, were certainly<br />\ntreated to a rare display of football. Almost<br />\nevery conceivable device permitted under the<br />\nnew rules was tried by the Swarthmore eleven,<br />\nand no one, following the beautiful plays and<br />\nmagnificent team work, would care to dispute<br />\nthe claim of the red-jersied giants to a place in<br />\nthe Big Four class.<br />\nThe wonderful advance which Swarthmore<br />\nhas made in football shows convincingly what<br />\nis possible from a squad which, supported<br />\nheart and soul by the student body as a whole,<br />\nis determined to win out.<br />\nBoys, remember, the student body is heart<br />\nand soul with you in your preparations to<br />\nwipe out the defeat last year at the hand of<br />\nSt. Johns'. Play as hard as you did against<br />\nSwarthmore, and the victory is yours.<br /><br />\nTHE NEWS-LETTER.<br />\nHOPKINS, 0—STEVENS, 0.<br />\nMud, and lots of it. That is the whole<br />\nstory of the game with Stevens on October 27.<br />\nFor days before the game there had been a<br />\nsteady downpour, and during frequent intervals Saturday morning it rained. Everyone<br />\nknows the result.<br />\nUrged on by the excited cheers of perhaps<br />\nfifty spectators, the Black and Blue team battled manfully, and bit the mud—literally and<br />\nfiguratively—of a tie game. Hopkins could<br />\nnot score and Stevens could not score. About<br />\nall either team could do was to slip and slide,<br />\nnow on their feet, and now on other portions<br />\nof their anatomy.<br />\nThe team certainly did show much improvement over the way it played against Delaware.<br />\nSeveral of the older men were out, and some<br />\nchanges in the lineup were made that proved<br />\nbeneficial. Moss was seen back at right<br />\nguard, and Captain Preble got in the game at<br />\ncenter in the second half. Roemer, left end,<br />\nhaving left the University, one of the Sawyer's<br />\nwent to his position, while the other Sawyer<br />\nplayed right tackle in place of Haas. Webb<br />\nwas in at full, and Stewart and Abel took<br />\nHart's place.<br />\nThe uncertain footing and the slippery ball<br />\nmade hard work for the backs, especially since<br />\nthe game soon turned out to be a kicking one.<br />\nHere it was that Michael excelled, for the<br />\nHopkins gained on every exchange of punts.<br />\nAgain Chesney was uncertain in handling<br />\nPunts, and will have to take a brace.<br />\nStevens worked a beautiful forward pass for<br />\na good gain of from 20 to 25 yards, but they<br />\ndid not make first down any oftener than did<br />\nHopkins.<br />\nIt was a pity that the weather was so bad,<br />\nfor it takes money to bring a team down from<br />\nNew York, and a crowd (?) of fifty will not<br />\ngo a long way towards making money on the<br />\ngame.<br /><br />\nBig Four crowds at the games will not be<br />\nseen until we get on our field at Homewood<br />\nWith the 'Varsity buildings all around. Do<br />\nYOUR part towards getting there by contributing to the Student Contribution Fund.<br /><br />\n9<br /><br />\nHOPKINS, 0—MT. WASHINGTON, 6.<br />\nFor the first time in the history of the<br />\nChair of Football at the Johns Hopkins University the Mt. Washington Football Team<br />\nfrustrated the attempts of the sturdy warriors<br />\nfrom our beloved Alma Mater and defeated<br />\nthem by six points to nothing.<br />\nAs it was, the defeat was accomplished by<br />\nonly a few inches, for had the ball not been<br />\ncarried outside the bounds eight inches from<br />\nthe goal line, the score would have been tied.<br />\nLack of sufficient outdoor practice was in<br />\nthe main part responsible for the defeat, and<br />\nespecially practice in the art of catching the<br />\nball as it descended from its lofty flights<br />\nthrough the atmosphere. Michael was more<br />\nsuccessful than his opponent in bringing the<br />\nleather-covered-spheroid in contact with his<br />\nright pedal extremity, but the Mountaineer<br />\nbacks had greater practice in catching it and,<br />\ntherefore, lost it less often.<br />\nThe Hopkins team played a grand game,<br />\nand in the second half fairly played Mt.<br />\nWashington off their feet. The work of Costello was especially noteworthy, both in<br />\nnegotiating the field with the ball in his arms<br />\nand also in grappling his opponents by the<br />\nlower limbs, thereby bringing them in forciable contact with mother earth. Several of<br />\nthe Mt. Washington heroes were very argumentative in spirit, but unfortunately showed<br />\na tendency to argue with their closed hands<br />\nrather than with their vocal organs. No<br />\nfatal bodily injury followed this tendency, although the ardor of the game resulted in the<br />\nbreaking of another bone in Captain Preble's<br />\nknee.<br /><br />\nWHAT THEY EAT.<br />\nThe Banker—Rolls and doughnuts.<br />\nThe Dentist—Pullets.<br />\nThe Ball Player—Batter cakes.<br />\nThe Jeweler—Lady fingers.<br />\nThe Lumberman—Chops.<br />\nThe Actress—Lobsters.<br />\nThe Chef—Bacon.<br />\nThe Surveyor—Steaks.<br />\nThe Broker—Lamb.<br />\nThe Dry Goods Merchant—Flannel cakes.<br />\nThe Dramatic Critic—Roasts.<br />\nThe Chiropodist—Corned beef.<br />\nThe Pittsburg Millionaire—Broilers:<br />\nThe Gambler—Saratoga chips.<br />\nThe Promoter—Watermelon.—Exchange•<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nJIM OVERHOLTZ'S RETURN.<br />\nIt was current gossip in Finchville that Jim<br />\nOverholtz had borrowed money to get a marriage license, and, when, after three years of<br />\nteam work in which he carried but a small<br />\nburden of the load on his own neck, he left<br />\nfor other fields, the story was repeated with<br />\ndouble the gusto.<br />\nThe situation at the barber shop conference<br />\nwas dismissed in expressive language. \"As<br />\nlong as Jim had his traces loose he was all<br />\nright on the off side, but the minute Sary tied<br />\nhim to the wheel on the near side, Jim he sort<br />\nof busted the traces.\"<br />\nOne said Jim was bumming his way, another<br />\nthat he was running a side-show at the State<br />\nfair, third and general opinion that he had<br />\njoined the Army.<br />\nNow, Sary played in Finchville and did the<br />\nsame work she had done for three years and<br />\nlonger, and prospered well, having but three<br />\nmouths to feed instead of five, for Jim took<br />\nwith him Loop—boon companion,fellow, goodfor-nothing and dog—a philosopher of the<br />\nsame school. She soon realized the height of<br />\nher small ambitions—lace curtains—only to<br />\nbring over the horizon another desire—an<br />\neasel with \"almost any sort of a picture on it<br />\nto fill up the corner.\"<br />\nOne day Sary happened to be in the \"city\"<br />\nwhile a rummage sale was in progress, and<br />\nshe brought back on the \"buss\"—among bird<br />\ncages and unsoldered tinware—an easel with<br />\na crayon portrait of a man in middle life—<br />\nanything may be bought at a rummage sale.<br />\nIt was to Mandy Loop that she explained<br />\nthat it would be a good example to the children, and by this means it took hours for it to<br />\nmake a complete circuit of the town.<br />\nWhen Sary's, weak-eyed and washed out,<br />\nDickey and Lura came to the age of understanding, it was duly impressed on their minds<br />\nthat the sacred one on the easel, who was to<br />\nbe approached with reverence like unto some<br />\nheathen god, was their father, and when they<br />\ngrew up they were to emulate him who left<br />\nthem orphans.<br />\nThe town mused over it and then considered<br />\nit the proper thing morally and otherwise to<br /><br />\ncarry on the illusion. Jim, the outcast, was<br />\nto be blotted from existence—no breath of his<br />\npast to breathe on the lives of Dickey and<br />\nLura. It enlarged on, found anecdotes,<br />\nqualities, sayings, and a past history for the<br />\npicture, and set itself to believe it, while Sary<br />\ngrounded the children in it.<br />\nIt was at least 7.30 when a man with garments, suggestive of the comic supplement<br />\ntramps, got off the tail end of a local freight<br />\nwith a skill which argued a familiarity with<br />\nthat mode of travel. It was dark when, unseen,<br />\nthe same person walked with a familiar air<br />\ninto Sary Overholtz's yard. He looked long<br />\nthrough the windows into the brightly lighted<br />\nroom. He saw a well-swept hearth, a brilliant<br />\nfire, two pale, washed out children, and a<br />\nlarge picture with an easel draped with some<br />\nscarlet flimsy texture.<br />\nHe sighed and said unto himself: \"Well,<br />\nSary, if you've found your man, it'd be a<br />\nshame to disturb you \" The local gave a<br />\nsqueal.<br /><br />\nALUMNI NOTES.<br />\n'06. Thomas Campbell, captain of last<br />\nyear's baseball team is a master at St. James<br />\nSchool, Hagerstown, Md.<br />\n'06. Henry Findlay French,formerly editorin-chief of the NEWS-LETTUR is studying law<br />\nat the University of Maryland.<br />\n'06 (Ph.D.). Charles J. Robinson is at the<br />\nRockefeller Institute, New York City.<br />\n'06. Carl Mengel is studying law at the<br />\nUniversity of Maryland.<br />\n'05. William R. Straughn is professor of<br />\nEnglish at the Pennsylvania State Normal<br />\nSchool, Millersville, Pa.<br />\n'04. Frank Stollenwerck is finishing up<br />\nhis law course at the Harvard Law School.<br />\nHe will graduate in June.<br />\n'99. James Morfit Mullen is prospering<br />\nunder an attorney-at-law sign, 1137 Calvert<br />\nBuilding.<br /><br />\n11<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE ATHLETIC FIELD.<br /><br />\nCHRISTIAN ASSOCIATIAN NOTES.<br /><br />\nIf anyone should ask in what condition<br />\nthe athletic field is, it would be difficult to<br />\ntell him. Since there is no car line running<br />\npast the field—an obstacle which, we are<br />\nPromised, will be overcome before next fall—<br />\nit is almost impossible to get out to the<br />\ngrounds owing to the heavy rains. The field<br />\nitself is almost completed except for planting<br />\nthe grass seeds, and it will be ready for use<br />\nat the beginning of the next collegiate year.<br />\nWe expected to be able to play on the field<br />\nthis year, but the delay was unavoidable.<br />\nAs President Remsen explained, when the<br />\nfield was thought completed, it was found<br />\nthat there was not proper drainage; so it had<br />\nto be dug up again, and a sub-soil drainage<br />\nput in, which required a great deal of time<br />\nand money. When the field is finished we<br />\nshall be the possessors of one of the finest<br />\nathletic fields in the country. As yet there<br />\nare no stands or buildings. If more funds are<br />\nnot quickly obtained, we shall have an<br />\nexcellent field without any grandstands or<br />\nnecessary buildings for the teams. The<br />\nspectators will have to be content to stand up<br />\nall during the games.<br /><br />\nCaptain D. A. Davis, of the Syracuse<br />\n'Varsity Crew, 1907, will be the speaker at<br />\nthe first of the series of monthly meetings<br />\nin Levering Hall. His topic will be: \"The<br />\nRace of Our Lives.\" Mr. M. T. Adkins of<br />\nthe Medical School will sing.<br />\nCaptain Davis is a man of strong personality, one of the type admired by every college man. He was stroke of the world's<br />\nrecord four-oared crew, 1905. His athletic<br />\nrenown alone will render him attractive to<br />\nHopkins men. Mr. Adkins, of course, needs<br />\nno introduction here. November 13 is the<br />\ndate for the meeting.<br /><br />\nThe Bible Study campaign has resulted in<br />\nthe enrollment of a number of men. Courses<br />\nare provided for all students, graduates and<br />\nundergraduates.<br /><br />\nYoung Men's Christian Association:<br />\nYou May Contribute Also<br />\nTo the Student Contribution Fund.<br /><br />\nUNIVERSITY NOTES.<br />\nThe Cotillon Club has at last fixed upon<br />\nfinal dates for the dances, which according to<br />\nthe latest arrangement are to be as follows:<br />\nNovember 30; February 1; and April 5. A<br />\nlarge number of students and alumni have<br />\nalready signed up and the series promise to<br />\nbe successful.<br />\nWhen being conducted about the University<br />\nbuildings last Wednesday, Sir William Henry<br />\nPerkin, was heard to remark upon the miserable<br />\nPaving which the cily is willing should remain<br />\nabout the halls of an institution for which it<br />\nis more renowned abroad than for all its other<br />\nadvantages taken together.<br /><br />\nJUST LIKE HER.<br />\nNo girl who read a tale of love,<br />\nBut in her heart will say<br />\nThe heroine reminds her of<br />\nHerself in every way.<br />\n—Exchange.<br /><br />\nEXCHANGES.<br />\nAYE!<br />\nJust a little water,<br />\nJust a little rye,<br />\nMake a man see double,<br />\nAnd have a bleary eye.<br />\n—Philadelphia Press.<br /><br />\nA BAD NIGHT.<br />\nUncle Reuben was taking his first ocean<br />\nvoyage down to Florida.<br />\n\"Did you sleep well, uncle?\" they asked him<br />\nafter the first night out.<br />\n\"Not perticler,\" he replied, \"Them bustles<br />\nye hey t' tie under yer arms kinda keep a<br />\nfeller from restin'.\"—Life.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n12<br /><br />\nBOOK NOTICES.<br />\nThe Boys' Life of Abraham Lincoln. By<br />\nHelen Nicolay. Illustrations by Hambidge and others. 12mo, 307 pages. Price,<br />\n$1.50. New York: The Century Co<br />\nWhile the title seems to limit the interest of<br />\nthis book to boys, it is a record for girls as<br />\nwell. For, as years go by, the nobility and<br />\nfar-reaching influence of Abraham Lincoln's<br />\ncharacter are being more and more widely<br /><br />\nrecognized and highly honored; and the story<br />\nof this great American's life and work is one<br />\nfor every young American citizen to read<br />\nand re-read often. As Miss Helen Nicolay<br />\nhas written the story, it is a vivid and inspiring narrative, with the weight of authority—based upon the standard life of<br />\nLincoln, written by Lincoln's secretaries,<br />\nJohn G. Nicolay and John Hay. Fully and<br />\nattractively illustrated, \"The Boys' Life of<br />\nLincoln\" should take permanent rank as a<br />\nyoung people's classic.<br /><br />\nR. Q. TAYLOR &amp; CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br /><br />\nNORTH<br /><br />\nConklin's<br />\nSelfFilling<br /><br />\nCHARLES STREET<br /><br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink,a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br /><br />\nDo You Enjoy GOOD Cigarettes?<br />\nIf so, let us make you a Sample<br /><br />\nI:HE<br />\na<br /><br />\nJ. MANKOWITZ, 1101 E. Baltimore Street<br />\nCHAS.<br /><br />\nG. FRANK<br /><br />\nT. RVAN<br /><br />\nPen<br /><br />\nWARD<br /><br />\n74,!,<br /><br />\nAll the best dealers everywhere8\"trillTtg.<br /><br />\nRYAN &amp; WARD<br /><br />\n—<br />\n:<br />\nap<br />\nre7aVesrs<br />\nOl<br /><br />\nVZI:TI,&gt;rigg,httat<br /><br />\nupon having<br /><br />\npens of best grade. WO styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fountain pen repaired promptly.<br />\nTHE CONKLIN PEN CO,<br /><br />\nDesigners and Makers of<br /><br />\nMen's Clothes<br />\n16 NORTH LIBERTY STREET<br /><br />\n.7<br /><br />\n414-1,10-1116 Jefferson Ave., Telledo,Oile.<br />\nBole Ern CoakIls Solt-71111se rea.<br /><br />\n;<br /><br />\nBALTimoRit. MD.<br /><br />\nUnder Brewers' Exchange<br /><br />\nBaltimore Steam Packet Company<br />\n(OLD<br /><br />\nBAY<br /><br />\nLINE)<br /><br />\nFOR<br /><br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br /><br />\nTICKET OFFICES<br /><br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br /><br />\n109 North Charles Street<br />\n506 Light Street<br /><br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday, 6.30 p. m. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br /><br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br /><br />\nE. BROWN,<br />\nGeneral Passenger Agent<br /><br />\nEmmERT<br />\nTailor<br /><br />\n.c.<br /><br />\n'11'0<br /><br />\nyOtt<br /><br />\nto\") be<br /><br />\njJ;;'14iii?T<br /><br />\nFOW\\ES<br /><br />\nCollrve 1,1erthcs,.<br /><br />\nvii<br /><br />\nNot high in price, bat way up to<br /><br />\nii iA'F'S /MI, YOU<br /><br />\n„•X<br /><br />\n.74%<br /><br />\nNUI1.1) To<br /><br />\n.1,<br /><br />\nI0 F. I'A YET<br /><br />\nS R 13* T<br /><br />\nKNOW<br /><br />\nABOU 1' A GLOVE<br /><br />\nCHIDT TO 01Z1017R IN<br />\n.<br /><br />\nWI_ MAKI.; tl A<br />\nep Iot/U<br /><br />\n01111% I \"I ME<br /><br />\nNicPHERSONS<br />\nI<br /><br />\nEAST RAJ AMOR!: STRIA-if<br /><br />\n.<br />\n,4144 410<br />\n....401.00e.molon,re..¢014<br /><br />\n1*-4<br /><br />\nS<br />\n(<br /><br />\n) II:<br /><br />\n?, 41 30<br />\n11.11411M111•111.<br /><br />\n13.<br /><br />\n1.1:X1N(JON STREIT,<br /><br />\nRALliMORE,<br /><br />\n-<br /><br />\n1.1.1114.5414Moraloi...nommln4svernil<br /><br />\n1<br /><br />\n4<br /><br />\nF. C<br />\nC. FOSSL71 ('-cY SON<br />\nfltcu'<br />\n-1<br /><br />\n,1<br /><br />\niASi<br /><br />\nill<br /><br />\nBALTIMOk<br /><br />\nSI<br /><br />\nBaltimore, Md.<br />\n•<br /><br />\nA,.4,<br /><br />\ntww, ..,aur..anwpwurait.<br /><br />\nwrItftSkinirae<br />\n,<br />\n,<br /><br />\n44,<br />\n.....n.mok.momegooroonnownpxolorymmeoirom1.....*...\"*<br />\n,<br /><br />\nTHE YOUNG MEN'S STORE<br /><br />\nrRAus BRos.<br />\nTAILORS<br /><br />\nHATIf..tIF<br /><br />\nFUR<br /><br />\nCIi)iIflRS<br /><br />\n20 \\V. Baltimore 51_, 29<br /><br />\nKEEP YOUR EYE<br />\nON THIS SPACE<br /><br />\nAdjUhlihim' .1442.,W 03. &amp;U.ru;iidinp•<br /><br />\nVISITORS ARE ALWAYS WELCOME<br /><br />\n\"Wireri rnakii kr. your- purchuses, kindly roneniber our ti.dvertiers<br /><br />"}], "field_media_file": [{"target_id": 36340, "display": null, "description": null, "target_type": "file", "target_uuid": "02509bd9-a228-4f0d-a021-7ede1087a649", "url": "http://digital.library.jhu.edu/system/files/2022-03/12308-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12308, "target_type": "node", "target_uuid": "092e9f8b-9b97-4c95-90d1-56443b75cb0d", "url": "/node/12308"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "8142128b-3eaf-429e-b347-b4bd8fd33fd4"}]}