{"mid": [{"value": 37129}], "uuid": [{"value": "121c3f72-b735-47a7-8fc5-428884307bc8"}], "vid": [{"value": 37129}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:00:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13199-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:00:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:00:03+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "irr;<br />\n<br />\nVOL. XXX, No. 30<br />\nSPRING SEASON TICKETS<br />\nWILL BE OFFERED<br />\nTO ALUMNI<br />\nChairman Heyn and Committe of Seven<br />\nTo Organize Publicity. Campaign and Teams<br />\n- Plans were laid for the inauguration of the spring season ticket<br />\ncampaign at a conference of Coach<br />\nVan Orman, Graduate Manager<br />\nKeyes, and Robert Heyn, president<br />\nof the Athletic Association Board<br />\nheld this week. Reyn is to be<br />\nchairman of an undergraduate<br />\ncommittee that will be in charge<br />\nof the campaign.<br />\nThree Weeks Drive<br />\nThe campaign will probably<br />\nstart on March 8, and last three<br />\nweeks.. According -to ',present<br />\nplans, certain undergraduates will<br />\nbe organized into teams, each team<br />\nto be captained by a member of the<br />\nundergraduate conurnittge mentioned above. There , will, be five to<br />\nseven of these teams, depending<br />\nupon the decision of the board.<br />\nThe campaign. will be an intensive one. The Athletic Associa-<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 12, 1926.<br />\n<br />\nHULLABALOO VOTING<br />\nTHROWN OPEN AGAIN<br />\nAccording to an announcement made by President Lord<br />\nof the Junior class, the voting for Editor-in-Chief and<br />\nBusiness Manager of the Hullabaloo was so thin that none<br />\nof the candidates was elected.<br />\nUnder the new class constitution a majority vote of the<br />\nclass is necessary to elect a<br />\nman to office. The candidates<br />\nare Charles Reese for Editorin-Chief and O'Dunne, Abrahams and Bortner for Business Manager.<br />\nThe polls will be reopened<br />\ntoday from twelve thirty until one, under the supervision<br />\nof the Student Council. Only<br />\nthose members of the class<br />\nwho have not voted previously will be entitled to a vote.<br />\n<br />\nDR. PUPIN TO BE GUEST<br />\nAT LUNCHEON<br />\nDr. and Mrs. Goodnow to entertain<br />\nProfessor on February 22<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMISS KAY FIELDS WINS<br />\nBARNSTORMERS CLUB<br />\nPOSTER CONTEST<br />\n<br />\n$50,000 OFFERED TOWARD<br />\nNEW ACTIVITIES BUILDING<br />\n<br />\nWill Receive Box at Performance;<br />\nCoach Swindell has Rough'. Voyage<br />\nReturning From Europe<br />\n<br />\nSUM MUST BE MATCHED BY OTHER ALUMNI<br />\n<br />\nMiss Kay Fields of the Maryland Institute was pronounced<br />\nwinner of the Barnstormers Club<br />\nposter contest. The judgment was<br />\nmade by Mr. and Mrs. Swindell<br />\nand members of the club at the<br />\nrehearsal last Saturday afternoon.<br />\nMiss Fields, who won from a field<br />\nof some twenty odd, will receive a<br />\nbox at one of the performances<br />\nnext month. No decision has been<br />\nreached in the program cover contest.<br />\nThe rehearsal was the first one<br />\nheld since Mr. Swindell's return<br />\nfrom Europe, and he was delighted<br />\nwith the progress the club has<br />\nmade on the production during'<br />\nhis absence. Mr. Swindell returning on the Steamer Olympic, had<br />\nthe misfortune of being on the<br />\nship when it encountered the worst<br />\n<br />\nNEW STRUCTURE CAN BE STARTED AS SCION AS SUM<br />\nRAISED, SAYS PRO liCST CHARLES K. EDMUNDS<br />\nSCHERR TO PLAY<br />\nFOR BLUE JAYS<br />\n.1. J. Scherr, the Blue Jay<br />\nOrchestra's most illustrious<br />\nsaxophonist of all time and<br />\nits leader last winter has returned to this University for<br />\nthe second semester to take<br />\nhis degree. The former leader<br />\nmade his return debut at the<br />\nTea Dance at Lehmann's Art<br />\nCentre last Saturday. He<br />\nwill play with :the Twin Six<br />\nfor the rest of the year.<br />\nIf anything, Scherr's playing, seasoned by several<br />\nmonths with Paul Whiteman's Second Band in New<br />\nYork, is superior to the high<br />\ncalibre furnished last winter.<br />\n<br />\nAn indication that the New Plan<br />\nis not expected to endanger the<br />\nstatus of student activities at<br />\nJohns Hopkins was made public<br />\nthis week by Provost Char!e.- K.<br />\nEdmunds. According to the provost, a prominent alumnus assures<br />\nus that he can secure $50,000<br />\ntoward the erection of a Student<br />\nAetivities Building, provided that<br />\nan equal sum be raised from the<br />\nalumni body. The total cost of<br />\nthe building would be in the neighborhood of $145,000.<br />\nThat the completion of this fund<br />\nis extremely likely is shown by the<br />\nsubscription of $10,000 already.<br />\nThe trustees have also, on hand<br />\n$45,000 received from Mr. Eugene<br />\nLevering of this city. Of this<br />\namount $20,000 represents insur-<br />\n<br />\ntrip across the boat had experiDr. Michael Idvorsky Pupin, enced in its<br />\nhistory.<br />\neiation in poorer financial shape who will<br />\nHall, which, it<br />\ndeliver the principal adTWO HUNDRED JOKES ARE ance on Levering<br />\nTownsend<br />\nBack<br />\nthan it has been in more than four dress at the<br />\nRECEIVED BY JAY<br />\nwill be recalled, was destroyed in<br />\nfiftieth Commemora1Zalph Townsend, who made the<br />\nyears, due to the rainy football tion Day<br />\nfire of 1919, and the remainder<br />\nthe<br />\nExercises is to be the<br />\nThree Five Dollar Awards To Be<br />\nclub<br />\nthree<br />\nhas<br />\nyears<br />\nago,<br />\nbut<br />\nwho<br />\nseason and a decline in interest guest of honor at a luncheon given<br />\na gift from Air. Levering to the<br />\nMade After Judges Pick Jokes<br />\nbeen tumble to come out during<br />\namong both undergraduates and by Dr. and Mrs. Frank<br />\nFund to be used for<br />\nHalf-Century<br />\nJohnson<br />\nOver two hundred jokes were<br />\nthe<br />\nlast<br />\ntwo<br />\nseasons,<br />\nis<br />\nagain<br />\ntakalumni. The coming lacrosse sea- Goodnow on Monday, February 22<br />\nthe erection of a Student Activiing an active part. Though he has turned in to the contest editor of ties Building. This $45,000, howson will pay for the running exat one thirty.<br />\nrecently been sick, his tine acting The Muck mid Blue Jay, Circu- ever, cannot be included in the<br />\ntime the coaches are paid, equipDr. Pupin was born of poor paris easily making up for lost time. lation Manager Cone announced 1$50,000 to be raised.<br />\nment is purchased and advertising ents in Hungary in 1858.<br />\nBe came<br />\nThere is,also Francis II asbrouk, Friday. So many of these are of<br />\npaid for.<br />\nNo Time Limit<br />\nto this country while still a young<br />\nwho starred as Mr. Jellicott, the merit that between two and three<br />\nDeficit Now<br />\nThere has been no time limit<br />\nman and received an A. B. degree<br />\nIt is the aim of the Athletic<br />\npompous Englishman in last year's pages of them are to be printed in<br />\nset for the raising of the additional<br />\nat Columbia University in 1883.<br />\nOffice to raise $6,000, $700 to $800<br />\nproduction. Re has been busy the next Jay, which will be re- , $50,000, but it is believed that the<br />\nHe attended the University of<br />\nof which will go toward defraying<br />\nwith exams but is now free to leased on the nineteenth of this money will not be long forthcomBerlin where he received a Ph. D.<br />\nthe costs of the campaign. As<br />\ndevote his talent to the footlights. month at the swimming meet with<br />\ning. Work on the building can<br />\ndegree in 1889. He received the<br />\nAnother man who has been par- Delaware.<br />\nthere is at present a deficit of<br />\ngin as soon as the necessary sum<br />\nSc. D. degree at the University of ticularly successful in his attempt<br />\nThree awards of five dollars<br />\n4650, the success of the campaign<br />\nCalifornia. The honorary degree ti4 be a woman is Leslie Schwinn. each will be made for the best has been raised.<br />\nmust be insured if the Athletic<br />\nThe Half-Century Committee is<br />\nof LL. D. was conferred upon him He was a ravishing female in drawing, the best joke, and the<br />\nAssociation is to succeed .finanby the Johns Hopkins University. 1924 but was unable to 10:tempt cleverest verse: All the contri- now making its final drive among<br />\ncially this year. It is hoped that<br />\nto make the cast last year. John<br />\nthe alumni. Those who have not<br />\nAt present Dr. Pupin is Profesthe gate receipts of the spring seaDesch, the fair heroine and butions selected for publication responded are being approached<br />\nson will pay for the running ex- sor of Electro-Mechanics in Col- heart-breaker of 1924, is again will be reprinted in sheet form again.<br />\nOn a card recently sent to.<br />\npenses of the office for the remain- umbia University. He is President free from the worry of studies and and a number of them sent to these alumni, attention is called to<br />\nder of the year.<br />\nof the American Institute of Elec- on the -stage. :His efforts are ex- prominent men. These judges a fund for the maintenance of<br />\nIn addition to personal solicit- trical Engineers and President of pected to excel those of last<br />\nwill be asked to pick the best from buildings and facilities for student<br />\ning by members of the ticket teams,<br />\nyear as further experience with<br />\nthe American Association for the<br />\nthese -Applause Cards\" and their activities. However, since the rethe alumni will be approached<br />\nthe fair sex has enabled him to<br />\nceipt of the recent generous offer,<br />\nAdvancement of Science.<br />\nthrough the mails. Circular letstudy their habits and wiles in verdict will be abided by.<br />\nparticular attention is being atDr. and Mrs. Goodnow have is- more detail.<br />\nters will be sent to every alumnus,<br />\nThe winners will be announced tracted to this fund. Especially<br />\nand every means of persuasion will sued 1,400 invitations. About 400<br />\nin the issue of March 26. In case in the case of alumni of the underCast Indefinite<br />\nbe used to sell season tickets.<br />\nguests are expected to attend.<br />\nThough these new arrivals this of a tie, student opinion will guide graduate schools is this being emphasized.<br />\nyear have been showing up very the choice.<br />\nLocation<br />\nwell, the east is not at all definite.<br />\nThe<br />\nproposed<br />\nbuilding would<br />\nMost of the men are interchanging Three Men To Represent<br />\nprobably<br />\noccupy<br />\none<br />\nof the sites to<br />\nin all the parts so that the various<br />\nJay At Princeton<br />\ntime north of and facing the ChemiThe new plan will soon either be Edmunds will settle all doubts characters are familiar to everyone. Under this plan, regular at-' Ludlow H. Baldwin '26 Gordon cal Laboratory. In it would be<br />\nentirely dropped, or dropped for a on the subject.\"<br />\nWhile it is not definitely known tendance at rehearsals is demand- M. Stick '26, and Maxwell B. Cone offices of the Y. M. C. A., the<br />\nterm of years, according to Norwhat Dr. Edmunds said in his let- ed if a man expects to appear on '27 will represent the Black and NEWS-LETTER, the Black and Blue<br />\nInan C. Keyes, Graduate Manager ter to Keyes, it is believed that he<br />\nthe Lyric stage on March 26 and Blue Jay at the annual meeting of Jay, the Hullabaloo, Barnstormers<br />\nof Athletics. Keyes has just re- has announced the indefinite post- 27.<br />\nthe Association of College Comics Club, Musical Club, and any other<br />\nThe production staff is expect- of the East next Saturday and activity that should need room.<br />\nceived a letter from Provost Char- ponement of the shift of Hopkins<br />\nSunday. The trio will leave Fri- The athletic offices would also be<br />\nles K. Edmunds that will settle to a graduate research institution, ing to design the scenery in an<br />\nas proposed by President Good- unusual manner. All the curtains day evening after the Musical Club situated in the new building. Of<br />\nall dispute about when the Plan<br />\nnow.<br />\nand drops will be painted accord- concert in which Stick will partici- course, an adequate cafeteria is<br />\nWill or will not be put into effect,<br />\nHowever, until the circular of ing to a scientifi'c color scheme so pate and the swimming meet in included in the tentative plans.<br />\nIf the sum be raised by June,<br />\n;Ind the Athletic Office is sending the Athletic Association is issued, that the scenic effects will be en- which Baldwin will be a contestant.<br />\nexample, the new Student Acno<br />\nfor<br />\none<br />\nin<br />\na<br />\nposition<br />\nto<br />\nknow<br />\nthe<br />\ntirely harmonious. In a particuout facsimile copies to all alumni<br />\nThis year the convention is at tivities Building might be comfacts will commit himself to larly brilliant ballroom scene there<br />\n:it'd. undergraduates.<br />\nthe extent of confirming or deny- will be an Egyptian motif that is Princeton, N. J. under the auspices pleted by the fall of 1927. Dr. Eding<br />\nthe rumor that the plan has accentuated by every detail. of the Princeton Tiger, Princeton's munds believes that its construc\"Ile student body will soon<br />\nbeen<br />\ndropped temporarily: The Though no definite designs have humorous publication. A formal tion should not take as long as<br />\nknow what the status of the<br />\ncircular letter will be sent out been selected, Hadley King and banquet scheduled for Saturday that of the Chemical Laboratory,<br />\nundergraduate school will be,\"<br />\neither Saturday or Monday, ac- Donald White, along with many evening occupies a prominent posi- once the actual work gets under<br />\nKeys;aid<br />\n\"The letter from Dr. cording to Keyes.<br />\ntion on the convention's program. way.<br />\n(Continued on p. 4, col. 1)<br />\n<br />\nPOSTPONEMENT OF NEW PLAN IS<br />\nLIKELY,SAYS MANAGER KEYES<br />\n<br />\n\fTHE. JOHNS HOPKINS NIPAVS.LETTER,FEBRUARY 12,1926.<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoflice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nHomewood 0100<br />\n<br />\nTelephone.<br />\n<br />\nBusiness Manager<br />\nOTHO J. KELLER III, '26<br />\n<br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\nCHARLES F. REESE, '27<br />\n<br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, '26<br />\n<br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nA. RISLEY ENSOR, '26<br />\nRICHARD R. GRIFFITH, '28<br />\nMORTON HAMBURGER; JR., '28<br />\nJunior Editors<br />\nW. BARNES HALL, '26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nBRINTON H. STONE, '27<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR.., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\n<br />\nNEWS<br />\n<br />\n\"Hamlet, as Shakespeare staged Hamlet when Marcellus, Horatio,<br />\nit,\" was the subject of a lecture and Bernado are sitting on the<br />\ndelivered by Mr. William J. Law- battlements the ghost appeared,<br />\n\"The largest and best planned<br />\nrence, prominent Irish lawyer, and not through the usual entrance,<br />\nlibrary in the world\" will rest one of the greatest living authori- which was at the rear of the stage,<br />\nwithin two years on the campus of ties on the Elizabethan stage, last but through a trapdoor immediateYale. It will be 192 feet high, 85 Friday afternoon in the Civil En- ly before their eyes. Armor was<br />\nproductions<br />\nfeet square, and will cost $6,000,- gineering building. The lecture, not worn in the first<br />\na sort ,of<br />\nInstead<br />\nof the year, was given of the play.<br />\n000, housing eventually 5,000,000 the third<br />\nemployed,<br />\nwas<br />\nunder the auspices of The Tudor silvered leather suit<br />\nvolumes and admitting two thouthe<br />\nactions<br />\nwhich did not hamper<br />\nand Stuart Club.<br />\nsand readers at a time. It will be<br />\nMr. Lawrence pointed out that of the players at all. Today the<br />\ncalled the Sterling Memorial Li- Shakespearian production had de- ghost says \"adieu\" three times<br />\nbrary.<br />\nviated much from the way in when lie passes out of the door,<br />\nof<br />\nroom<br />\nlittle<br />\nwhich it was first played by that but when Shakespeare played it<br />\none<br />\nwill<br />\nbe<br />\nThere<br />\nplaywrite and producer. Of he said his \"adieu's\" as he was<br />\ngreat<br />\nextraordinary interest: a replica<br />\nthere has been some being lowered through the trapyears<br />\nlate<br />\nof the Yale Library as it was in<br />\neffort to retrace the steps, and to door.<br />\n1743: a room some I wenty,two feet<br />\nModern Dress Old Idea<br />\nproduce the drama as Shakespeare<br />\n31r. Lawrence said that the sysby thirty-one feet, containing the did. The stage directions are<br />\nsame old volumes or duplicates, vague, but by careful observation tem , of playing \"Hamlet\" in modentered by the same old doors, and of the methods of the time, one ern clothes is not a new idea, this<br />\nmethod has been in use for some<br />\nfitted out with the.same old style can secure the methods of staging<br />\nShakesperian drama in the time of time. Mr. Lawrence further pointof furniture.<br />\ned out that there has been some<br />\nElizabeth.<br />\nThe New Stu den t mentioils<br />\nchange in !the closing scene. Sir<br />\nGhost Scenes<br />\nthat this is one of the most fasciMr. Lawrence selected \"The Henry .Irving, a famous authority<br />\nnating tales in American college Ghost Scenes of Hamlet,\" as the on Shakesperian drama thought in<br />\nhistory, for Yale was a library be- part of the play best suiting the the nineteenth century that the<br />\noriginal pro- two portraits in this scene were<br />\nfore it was a college. Before Yale deviation from the<br />\nduction. Now the ghost comes out in the first performance of the<br />\nhad a single student or a teacher,<br />\non the stage in the usual manner, stage. From strong evidence it is<br />\na local habitation or a name, it in practically the same way as the believed' that these pictures were<br />\nhad a small library assembled by other actors do. This was, how- on the back wall of the stage, and<br />\nhalf a dozen colonial ministers, ever, quite different in the olden were curtained, as was the node<br />\nwho by pledging a gift of books times. A trapdoor was the usual at that time.<br />\nMr. Lawrence has devoted his<br />\nat Branford in 1701, and accord- method for the entrance and exit<br />\ning to tradition, actually laying of ghosts.. Mr. Lawrence said that life to a study of Elizabethan<br />\nsome of them on the table, found- there were numerous examples of drama, and is probably the greated a -Collegiate School in His this in theatrical production of est living authority on this subject.<br />\nMajesty's Colony of Connecticut.\" this period. It was an integral He has been lecturing at Harvard<br />\n* *<br />\npart of the play to have the ghost, for the past four months, and<br />\nBefore becoming collegiate, a or devil, gradually appear and every afternoon for the past week<br />\nfreshman at Penn State College, fade out of sight. Without it the has been with the English semimust give up his pleasant associa- play would have been shorn of nary. Immediately before the lections with co-eds, except; at many of its thrills, and the audi- ture he was the guest of the Tudor<br />\nstated periods; he must be seen on ence would have been sadly dis- and. Stuart Club whichi gave a tea<br />\nthe campus with his hands in his appointed. In the ghost scene in in his honor.<br />\npockets, and his coat uributtoned,<br />\nkeeping off the grass, and abstain- 'DR.WHITEHEAD PRESENTS PAPER PAYMENT OF DORMITORY<br />\ning from wearing gaudily colored<br />\n(Continued from p. 6, col. 3)<br />\nPLEDGES URGED<br />\nsocks.<br />\ntric force, occasions a current<br />\nA freshman found guilty of component in phase with that Alumni Committee Issues Circulars<br />\nbreaking any of these rules is pub- force. This means an energy loss<br />\n• To Fund Subscribers<br />\nlicly barbered and then -adorned in the dielectric.<br />\nCirculars appealing for prompt<br />\nin women's regalia\" for two weeks<br />\n-The two extremes of disadvanand in the spring of the year given tage of the presence of this loss payment of subscriptions. to the<br />\na molasses bath.<br />\nare the danger it occasions to the A luumi n i Memorial Dormitory<br />\nThe editor of The Daily Ne- life of high voltage insulation and<br />\nFund and thanking those who<br />\nbraskan derides this mode of initi- the effect in the high frequency<br />\nation into the realms of higher impulses and signals of wire and have already paid fuel r contrilearning and speaks slightingly of cable communications of telegra- butions in full have been issued<br />\nthe cultural development of the phy and telephony.<br />\nby a special committee consisting<br />\nstudents at Penn State concluding \"It is remarkable that so little of<br />\nHorace Burrough, Jr., George<br />\nwith; -Yes, We of the West do not attention has been given the propL. Radcliffe, Robertson Griswold,<br />\nknow what we are missing. 1 erty of dielectric absorption in<br />\nand<br />\nCharles K. Edmunds.<br />\ntakes some such revelation of in- the efforts which have been inade<br />\ntelligence as that at Penn State to improve the qualities of comOf the $172,312 subscribed by<br />\nto wake us up.\"<br />\nmercial insulation. Studies in this alumni and friends of the UniThe \"Penn State Collegian\" de- direction are certain to produce versity, $125,845<br />\nhas been collectfends the traditions of its Alma new knowledge leading to improveed. No less than 843 subscribers<br />\nMater.<br />\nments and economics.<br />\nhave paid their pledges in full and<br />\n\"Many, many years ago, good<br />\n\"Thus, there is a wide field of<br />\nold Noah Webster defined culture study apparently still untouched 211 in part, while 328 have not<br />\nas follows:'The training, improve- in our efforts to-c-oirtPortlit-iiiost as yet remitted a single dollar of<br />\nment and refinement of mind and vulnerable and. troublesome of all the amounts they subscribed. The<br />\nmorals.' And we should be willing the materials used by the electrical committee hopes to collect the<br />\nto stack Penn ,State's mind and engineer.\"<br />\nunpaid pledges to the fund by<br />\nmorals against those of Nebraska<br />\nies. It is especially useful to Cor- February 22.<br />\nWhen a freshman<br />\nany day.<br />\nnell alumni who find it difficult to<br />\nThe Alumni Memorial Dormiemerges into the sophomore class<br />\nfind lodging during a big game.<br />\nhere, he at least knows something<br />\nwas constructed as a monutory<br />\nThe entire student body are memof college tradition. At Nebraska,<br />\nbers, are almost three hundred ment to those graduates and stuhe probably wears plus—fours<br />\nothers from the faculty and resi- dents of Johns Hopkins Univerand smokes Lord Luckyfields.<br />\ndent alumni.<br />\nsity who gave their live§ for their<br />\nBut, of course, that's the West's<br />\ncountry<br />\nin the World War. The<br />\ndefinition of culture.<br />\n*<br />\n*<br />\ntotal cost of the building with<br />\nNOTICE<br />\nThe New Willard Straight Hall<br />\nequipment was $509,165, most of<br />\nat Cornell has become the social<br />\nNo Discount on Senior Class Dues<br />\nwhich was borrowed from the genheadquarters of the college. It<br />\nAfter Monday. See Townsend, Berndt,<br />\neral fund of the University. The<br />\ncontains a well equipped theater,<br />\nHunter, Baldwin, Meredith or HopAlumni Committee is, of course,<br />\nkins.<br />\ncafeteria, tea rooms, soda fountain,<br />\nROBERT HOPKINS,<br />\nanxious to pay this debt and is<br />\nand memorial hall, besides the<br />\nTreasurer.<br />\nseeking all contributions possible.<br />\nusual lounge rooms and dormitorINTERCOLLEGIATE<br />\n<br />\nSubscription<br />\n<br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br />\n<br />\nAUTHORITY ON ELIZABETHAN<br />\nDRAMA LECTURES ON\"HAMLET\"<br />\n<br />\nCirculation Manager<br />\nROBERT T. SAUERWEIN, '26<br />\n<br />\nAssistant Business Managers<br />\nHEywAan E. BOYCE, JR., '27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, JR., '27<br />\nWILLIAM BORTNER, 927<br />\nIRVING HOFFMAN, '28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 12, 1926.<br />\n<br />\nTHE PUBLICITY BOARD<br />\n• After years of almost supine existence, the Publicity Board<br />\nis at last to be called upon to make a good defense of itself, or<br />\nbe abolished by the Student Activities Council. The move is<br />\npraiseworthy. All useless organizations should be removed from<br />\nthe Campus, and unless the Publicity Board can convince us<br />\nby strong arguments to the contrary, we must admit its uselessness, and advocate its consignment to the limbo.<br />\n<br />\nMEN'S RIGHTS<br />\n\"It is to laugh,\" said some, when they read of the recent<br />\nshaving episode at a western university. It seems that a<br />\ntolerant professor told the men that they had just as much right<br />\nto shave their ugly faces in the class-room as the women had<br />\nto powder their shiny noses. Taking the unwary \"profs\" at his<br />\nword, two students entered the clas sthe next day, equipped with<br />\nrazors, soap, and towels, and proceeded to shave themselves<br />\nduring the lecture, to the immense amusement and satisfaction<br />\nof the class. However, the professor proved to be a good sport,<br />\nand awarded the shavers A's for the semester, stating that he<br />\nadmired the way in which they stood up for men's rights.<br />\nThere is much meat in the incident. The long and constant<br />\nfight for \"Women's Rights\" has caused a corresponding depression in the rights of the so-called sterner sex. It is high<br />\ntime for men to rally around the flag, to fight fOr their liberties.<br />\nHopkins has seen something of the battle. By the wise and<br />\nforunate provision in the will of Johns Hopkins, (or was it incorporated in Dr. Gilman's plan?), the undergraduate school<br />\nis not co-educational. Nevertheless, woman has from time to<br />\ntime crept into the sacred precincts of the male. Even now, in<br />\none of our classes, we can swear that there are at least three of<br />\nthe unfair sex, airing their deficient knowledge and pulling down<br />\nexcellent grades. The professors are not immune to their wiles.<br />\nOne brave instructor, though, actually had the temerity to ask<br />\none of the dears a question. She has not appeared in the class<br />\nsince.<br />\nWhile we are not women haters, and while we admit that<br />\nthey are very very essential at the proper time and place, we<br />\nhope that the powers that be will keep them out of the undergraduate classes. They are only an unnecessary distraction to<br />\nthe toiling student.<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS.LETTER, FEBRUARY 12, 1926.<br />\nEarl L. Simpson<br />\n<br />\nH. Glynn Morris<br />\n<br />\nPhone: Homewood 9621<br />\n<br />\nit? And in Philadelphia, too. I Homewood 4391<br />\nLiberty 1209<br />\nNEWS-LETTER<br />\nturn again; this stares me in the<br />\nFANCY DELICATESSEN<br />\nMAILBAG<br />\nface: \"Dry Agent Witness at Col2022 N. Charles St., Salto., Md.<br />\nlege Probe. Investigation of AlSPECIAL RATES FOR HOPORCHESTRAS<br />\nAll letters intended for publication<br />\nKINS STUDENTS<br />\nleged Liquor Law Violations and<br />\nmust be concise, written in ink on<br />\nnow<br />\nSummit,<br />\nOrchestras<br />\nplaying<br />\nCommunistic Activities Among<br />\nregular letter size paper, on one side<br />\nonly.<br />\nSilver Slipper, Alcazar<br />\nthe<br />\n'<br />\nFaculty and Students<br />\nNo attention will be paid to anony-<br />\n<br />\nBOULEVARD RESTAURANT<br />\n<br />\nSimpson - Morris<br />\n<br />\nmous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nOH BARN! OUR BARN<br />\nTo the Editor of the News-Letter:<br />\nDear Sir:<br />\nNever, since Adatu was given the<br />\nGarden of Eden to dress and keep,<br />\nhas a structure been so appropriately named as our own -Barn.\"<br />\nWhat pleasant associations attached to the immortal barn!<br />\nHow many s of us can remember<br />\nthe romps we had in the old hay<br />\nstack, and the time we unknowingly rolled into the wasp's nest?<br />\nThe old barn, the dear old barn,<br />\nwith its pungent 'odors, its great<br />\noozy mires, its adjoining pig pen,<br />\nand its smoking ordures. The old<br />\nbarn, sweet to the memory of the<br />\nboy who has been blessed with a<br />\nsojourn in the sticks. With all its<br />\nreek and filth and odor, we adore<br />\nit.<br />\nAt Homewood there is a building which was converted into—<br />\nbut there we must stop, because<br />\nit is apparent that the conversion<br />\nis only fiction. The old barn is<br />\n<br />\n* *<br />\n<br />\nMc PHERSON'S<br />\n11 E. BALTIMORE ST.<br />\n<br />\n*<br />\n<br />\n\" My, oh, my, and in<br />\nOhio! And then, then I saw the Office: 10 E. FRANKLIN ST.<br />\nPhone, Vernon 0226<br />\nknockout, the veritable piece de<br />\nresistance:\"<br />\n, a sophomore at<br />\n, was suspended from the<br />\nuniversity today as the result of<br />\na wild automobile ride, just beThe Personal Writirk,<br />\n.! Machine<br />\nfore the Christmas vacation, during which he ran down a squad<br />\nof eight Bridgeport policemen as<br />\nthey were about to board a trolley.\" Now that shows what college men can do.<br />\n<br />\n93lue Suits<br />\nwill be very popular this year in<br />\nfancy weaves—<br />\ndiagonals — wide<br />\nwales and dia.<br />\nmonds— and lots<br />\nof plain ones, too.<br />\n<br />\nCoRorsTA<br />\n<br />\nM.W.LUCY & CO.<br />\n<br />\nBut I am ashamed when I com104 W. Fayette St.<br />\npare these interesting achievements with Hopkins'. How can<br />\nwe ever hope to be a real college<br />\nGALEN HALL<br />\nwhen we lie here in a sink of eduAtlantic City, N. J.<br />\ncation, simply, oozing respectability? Fellow students, where is<br />\nMay we send folder, bills of fare,<br />\nthat much vaunted school spirit and especially attractive rates at this<br />\nof ours? Cannot we also do some season? No better food and service<br />\nthing epoch-making? It is indeed anywhere. It is our purpose and<br />\nheartrending to sit here and,think practice to give rather more than is<br />\nof our Alma Mater being thus usual for the rates charged. We try<br />\neclipsed by everyone. Have we at to keep our old friends, and we like<br />\nHomewood no public-spirited stu- to make new ones. Good Music.<br />\ndents who will spring up and startle Baltimore and, yea, even this<br />\n-keep cool with Coolidge\" country; no one who will show what,<br />\nHopkins can do? Hopkins has a<br />\nright to expect the best of every<br />\nman,—and then, I find men in<br />\nthe libraries, in the laboratories,—<br />\n11.01141<br />\n<br />\n(Continued on p. 4, col. 1)<br />\n<br />\nstill there, bless it, and although<br />\nsome extreme romanticists may in<br />\ntheir most ethereal moments refer DON'T FORGET!<br />\n—clothes that are tailored to<br />\nto it as the Student Activities<br />\nyour measure fit you best.<br />\nBuilding, yet the majorty of us<br />\n—they have the right cut..<br />\nmortals must confess that the<br />\n—they make you feel welldressed.<br />\n\"Barn\" is a barn still, in every<br />\ncharacteristic of the country barn<br />\nso deeply impressed upon our<br />\n<br />\nr-<br />\n<br />\nhearts and noses.<br />\n, Oh Barn! Our Barn! May many<br />\n•*\" a<br />\nN<br />\nwarm suns penetrate the odorifie<br />\n4'*9<br />\nfumes ascending from your rank,<br />\nrotten recesses, your humid and<br />\n911.A.4k1-1LCCM$<br />\nc&Usmore<br />\ndingy caverns of subtle mystery.<br />\nWe revere thee; center of our stu- See \"GARD\" MALLONEE & FRAMK MEREDITH at the Barn<br />\nDowntown at 407 N. GAY St.<br />\ndent activities, slimy place of our<br />\nlunches. We love thee truly, and<br />\nthough thy filth of orange peels,<br />\nspilled milk, broken glasses,<br />\namassed papers, and heaps of refuse utterly consume us—yet we<br />\nshall not advocate a new building.<br />\n<br />\nUPLIFT.<br />\n<br />\nEXCUSE OUR CRUST!<br />\n<br />\nTo the Editor of the News-Letter.<br />\nDear Sir:<br />\nI read with interest the newspaper accounts of non-athletic activities at several of our American institutions of higher education. In last night's edition of<br />\none of our Baltimore papers I<br />\nread, \"Sixteen Students on Probation for Kidnapping Episode.\"<br />\n\"Pine,\" I say, wetting my lips in<br />\nanticipation, \"oh, yes, a well<br />\nknown college in Annapolis; oh,<br />\nYes!\" I turn a page. Screaming<br />\nheadlines, \"Junior's Back Broken<br />\nIn Rum Revel! As a climax to an<br />\norgy that started on New Year's<br />\nEve and continued for two nights<br />\nand a day, * * * a junior * * * is<br />\nnear death with a broken back.\"<br />\nWell, well, who'd have thought<br />\n<br />\nENGLISH OVERCOATS<br />\n$30.00 to $75.00<br />\n<br />\nAusicians<br />\nYour whole orchestra can<br />\ntravel cheaper and keep<br />\nmore engagements with<br />\nless lost time by renting<br />\nSaunders System cars. Go<br />\nand come when you please.<br />\nNo waits—nc delays. Cost<br />\nless than rail fare for five<br />\nor more.<br />\n<br />\nHomewood and Edgetvood<br />\n<br />\nWatch for Our Showings<br />\nSee the fall and winter lines in authori.<br />\ntative American and English styles for<br />\nthe College man—in single and double<br />\nbreasted models exquisitely tailored,<br />\nperfect fitting.<br />\n$29.50 and $34.50<br />\nNationally<br />\nKnown<br />\n<br />\nYustly<br />\nFamous<br />\nBALTIMORE<br />\n<br />\nairrIer<br />\n,<br />\nr411<br />\n<br />\n147\"7167NY-Irfivv'T4Vv*IIRYN\"ervNgirvIlirvW\".\"131/7r.<br />\n<br />\nWNW\\<br />\n<br />\necorate<br />\nyourself with<br />\nthe degree<br />\nof P. A.<br />\nmeans \"Pipa Amoroso\" in the Latin, or<br />\n\"pipe-lover\" in plain campus English. P. A.<br />\nhas certainly endeared a pipe to more men than<br />\nany other letters in the smoke-alphabet. Because<br />\nPrince Albert lets a fellow smoke all he wants<br />\nto—and makes him want to!<br />\nCool as the stare of a marble Venus. Sweet<br />\nas the approach of vacation. Fragrant as spring<br />\nblossoms. Think up your own similes, Fellows.<br />\nYou will when you pick P. A. and a jimmy-pipe<br />\nfor permanent roommates. Prince Albert is<br />\ngreat tobacco, and that's not blah.<br />\nGet yourself a tidy red tin of Prince Albert<br />\ntoday. Fill the bowl of that old jimmy-pipe to<br />\nthe brim and borrow a match. Then you're set<br />\nfor some great smoke-sessions, as sure as you're<br />\na foot high.<br />\nTHAT<br />\n<br />\nSAUNDERS SYSTEM<br />\n<br />\nOR1NGE ALBERT<br />\nDrive It irOttrrieff<br />\n•va.<br />\n<br />\nvtil<br />\n<br />\n13<br />\n<br />\n—no other tobacco is like it!<br />\n1926,R. J. ReynoldsTobacco<br />\nCompany,Winston-Salem,N. C.<br />\n<br />\nP. A. is sold everywhere in<br />\ntidy red tins, pound and halfpound tin humidors, and<br />\npound crystal-glass humidors<br />\nwith sponge-moistener top.<br />\nAnd always with every bit of<br />\nbite and parch removed by<br />\nthe Prince Albert process.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 12, 1926.<br />\n<br />\n4<br />\n<br />\nDeveloping<br />\nPrinting<br />\nEnlarging<br />\n<br />\nKodaks<br />\nCameras<br />\nSupplies<br />\n<br />\n%%FURNITURE OF QUALITY<br />\n% Your Future %% Deal with a Firm equipped with 57 years' Experience.<br />\n•<br />\n%<br />\n%% SUCCESS %% Our Salesmen are Specialists, everyone carefully trained to handle<br />\n(Continued from p. 1, col. 3)<br />\n%<br />\n% ' your Problems efficiently.<br />\nothers, have submitted some excel- Zepp Photo Supply Co. % in life does not depend on<br />\nBARNSTORMERS SECURE<br />\nGRAD'S ADVICE<br />\n<br />\nlent drawings.<br />\nIn addition to the work done by<br />\nthe production staff advice has<br />\nbeen received from Morris Bavillo,<br />\nformer Art Director of the Club<br />\nand now connected with the Beaux<br />\nArts. Isaac Hamburger, former<br />\nProduction Manager of the Club is<br />\nalso helping the building of the<br />\nsets.<br />\nThe first rehearsal after exams<br />\nwas held last Saturday afternoon. They will be held regularly on Tuesday and Thursday at<br />\n7.30 P. M., and Saturday and Sunday at 3.00 P. M.<br />\n<br />\n3044 Greenmount Ave.<br />\nLet Us Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br />\n<br />\nETHOLI<br />\n<br />\n\"THE WONDER MOTOR FUEL:<br />\n<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n•<br />\n%<br />\n•<br />\n%<br />\n%<br />\n%<br />\n%<br />\nSS<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n!fi<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n<br />\n%E9<br />\n% G. A. Myer, Mgr. %<br />\n%<br />\n%<br />\n<br />\nPOPULARITY<br />\nSPEAKS FOR<br />\nITSELF!!<br />\n<br />\n% THE GUARDIAN LIFE INSURANCE %<br />\n%<br />\n%<br />\nCOMPANY OF AMERICA<br />\n%<br />\n%<br />\n%<br />\n<br />\noh, gentlemen, it is a sight to<br />\nmake strong men break down and<br />\nweep like babes!<br />\nThink of our freshmen, of their<br />\nshattered illusions! Where, indeed, can they find true college<br />\nlife; where can they see men in<br />\nhigh hats and pink combinations<br />\nholding up swaying lamp-posts;<br />\nwhere can they see raccoon coats<br />\nemerging from lowly gutters; oh,<br />\nwhere, forsooth, can they find collitch ? Don't you see how we are<br />\ncheating these innocent, trusting<br />\nboys? They had ideals, they had<br />\nfaith in human nature, and then,<br />\n—they find this Kiwanian paradise, this haven for overworked<br />\nfaith healers. No cocktail shakers in the memorial room, no kegs<br />\nin the Post Office,—oh, Shades of<br />\nAristippus! Can nothing be done?<br />\nWon't you 'help me to restore<br />\nthe glory of the \"Elastic Age\"?<br />\nThe NEWS-LETTER'S suggestion to<br />\nthe Blue Jay is a step in the right<br />\ndirection. Come, join the crusade; help this bigger-better movement. Enlist the barn hounds<br />\nand the Tudor Stuart Club. Let<br />\nus stop hoodwinking the public<br />\nand our own fledglings. Let us,<br />\nindeed, have a college where men<br />\nare men. Let us out-Castor Castor. Will you do your bit?<br />\nIf this is published, I will extoll the NEWS-LETTER till I'm<br />\nblack in the face; I will arouse<br />\nThe world with my praise of this<br />\nfar-seeing, democratic, free-thinking paragon of journalism, while<br />\nif you don't I'll shout just as loudly that—that you're subsidized by<br />\nthe Y. M. C. A.<br />\n<br />\nRED NOSE PETE.<br />\nJan. 12, 1925.<br />\nP. S.—Help make the world<br />\nsafe for democracy!<br />\nHE APPROVES OUR EDITORIAL<br />\n<br />\nTo the Editor of the sews-Letter.<br />\nDear Sir:<br />\nYour editorial \"Unlimited Cuts\"<br />\nin the NEWS-LETTER of Tuesday,<br />\nFebruary 9th, is very pertinent. I<br />\nheartily approve of the stand you<br />\ntake.<br />\nThere is no doubt that you express the sentiment of the student<br />\nbody. Some recognition of the<br />\nsituation ought to be given it by<br />\nthe authorities.<br />\nVery truly,<br />\nM. C.<br />\n<br />\nFounded 1860<br />\n<br />\n•<br />\n% 423 Munsey Bldg.<br />\n<br />\nTHE NEWS-LETTER'S MAIL<br />\n(Continued from p. 3, col. 2)<br />\n<br />\n\"lucky accidents,\" or ''per- %<br />\nsonal pull.\" It depends on the %<br />\nwise selection of your work and<br />\nthe close application of the underlying principles of success.<br />\nThe Guardian Life Insurance %<br />\n%<br />\nCompany of America is one of %<br />\nthe oldest and financially strong- %<br />\nest institutions of its kind in %<br />\nAmerica today. Its representa- %<br />\ntives are rapidly taking their %<br />\nplaces of importance among the %<br />\nreally successful men of the corn- %<br />\n%<br />\nmunity in which they live.<br />\nThis institution offers the %<br />\nyoung man with a trained mind, %<br />\npleasant, well-paid work, with %<br />\nthe chances of success depend- %<br />\nent only on three factors:<br />\n%<br />\n1. Willingness to work.<br />\n%<br />\n2. Intelligent work.<br />\n%<br />\n%<br />\n3. Love of work.<br />\nfor<br />\nour<br />\n%<br />\nCall at our local office<br />\n%<br />\nbooklet, \"The Greatest Family %<br />\nin the World.\"<br />\n%<br />\n<br />\n%<br />\n<br />\nBaltimore, Md. %<br />\n<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW & FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br />\n<br />\nSHERWOOD BROS., INC.<br />\n<br />\nThe question is sometimes asked:<br />\nWhere do young men get when<br />\nthey enter a large industrial organization? Have they opportunity to<br />\nexercise creative talents, or are they<br />\nforced into narrow grooves?<br />\n<br />\nCC<br />\n<br />\nThis series of advertisements<br />\nthrows light on these questions. Each<br />\nadvertisement takes up the record of<br />\na college man who came with the<br />\nWestinghouse Company after graduation and within the past ten years.<br />\n<br />\nEngineer! .„<br />\nArrest that Bolt<br />\nHE Sales Department was<br />\ntalking in emphatic and easily<br />\nunderstood language. It was saying,\"We want action.\"<br />\nAt Westinghouse,action in many<br />\ncases is another word for research.<br />\nJOSEPH SLEPIAN And research works toward selected<br />\ngoals. In this case the goal was for new apparatus<br />\nto make unchained lightning more respectful of<br />\npower plants, lines and equipment.<br />\nToday, as a consequence, the electrical industry<br />\nis the beneficiary of the \"Autovalve Lightning<br />\nArrester\", perfected to a degree of efficiency, long<br />\nservice and universal utility never dreamed of before. Behind that picture you find Joseph Slepian.<br />\nWith two degrees from Harvard, he started<br />\ntraining in our East Pittsburgh Shops in 1916.<br />\nA year later he entered the Research Department.<br />\nThis was the lightning arrester situation which<br />\nSlepian took into the research camp: There were<br />\ntwo different types of apparatus. One, called the<br />\nmulti-gap, was used chiefly on poles of distribution circuits. When lightning struCk, it frequently<br />\n<br />\nT<br />\n<br />\nDRAPERIES<br />\n<br />\ncaused transformer troubles and damaged equipment. For high-voltage application there was<br />\nthe cumbersome electrolytic arrester. Its performance was good enough. But it required constant attention; was costly of upkeep; and could<br />\nnot be used on poles.<br />\nWhen Slepian perfected the Autovalve Arrester, the demand was so great that orders could not<br />\nbe filled. It was entirely new. One type of apparatus solved the whole problem—no more<br />\ncostly care. It stands up indefinitely, whether<br />\nused on poles or on the ground—sufficient<br />\nreasons for yearly sales exceeding 52,000,000.<br />\nSuch results may depend as much on a phase of<br />\nan engineer's past training as on his immediate research. Take the radio horn which gives the natural<br />\ntone to Radiola sets. It was Slepian's mastery<br />\nof mathematics, in which he specialized at Harvard, which contributed toward that big advance<br />\nin the early days of loud-speaker popularity.<br />\nThe man with \"hidden reserves\" is constantly<br />\nfinding them called upon to \"climb peaks and cross<br />\nmountains\" in institutions like Westinghouse.<br />\n<br />\nWestinghouse<br />\n<br />\n\f5<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 12, 1926.<br />\n<br />\nYou<br />\n<br />\nFELLOWS<br />\nAre \"up Against<br />\n<br />\na Great<br />\nResponsibility\".'<br />\n<br />\nITHIN a short time you will be called upon to make a great decision. That<br />\ndecision is going to leave its impression on civilization for generations to come.<br />\nYou can't approach such a responsibility hastily, carelessly or flippantly and<br />\nbe true to your self.<br />\nYou can't point 'thumbs down' and continue to walk on the same thought plane with<br />\nGilman, Gildersleeve, Rowland, Rernsen and Brooks.<br />\nWe have but one excuse for addressing Hopkins undergraduates and alumni upon this<br />\nvital Hopkins problem.<br />\nWe at first approached this question with misgivings, doubts and minds circumscribed<br />\nby selfish prejudices—<br />\nWe had but slight understanding of the fundamental rightness of the advocated plans<br />\nwhich have been conceived to enlighten and serve humanity—<br />\nBut we made it our business to get the reaction of eminent<br />\nthinkers and the cold-blooded analytical opinions of the<br />\ncountry's outstanding promoters of World Progress.<br />\nWe have seen the light and sincerely believe that we may<br />\nbe helpful to you in getting down to the necessity of having<br />\nevery Hopkins undergraduate and every Hopkins Alumnus<br />\nand every Hopkins friend behind our leaders,--backing<br />\nthem to the limit in the epoch-making work of making<br />\nJohns Hopkins the best research school in the country.<br />\nRight off the bat let's agree that a great objective can<br />\nnever be attained without sacrifices.<br />\nWe believe that the men who are and have been intimately<br />\nidentified with Hopkins undergraduate life—men to whom<br />\nHopkins' college spirit has been an all powerful influence<br />\nwill be called upon to bear their share of the sacrifices.<br />\nWe well understand what it means to think of Hopkins<br />\nwithout a Freshman class—without a Sophomore class.<br />\nWe know what it has meant during that first year to learn<br />\nhow to be sweetly humble and during that second year to<br />\nteach humility to others.<br />\nWe know the thrill that comes only in a \"class rush\"—in<br />\na Freshman-Sophomore football game.<br />\nWe know the joys of hazing and being hazed; of breaking<br />\nup a class banquet and the chagrin of having one broken up.<br />\nWe know the taste of victory and the pangs of defeat in<br />\ncompetition with our rivals on the field.<br />\nYes, we know because we have been part of it. We lived<br />\nit for two solid years before we realized that there was<br />\nreal work to do and that we must be \"up and doing.\"<br />\n<br />\nBut there is no such purpose in mind.<br />\nMen entering Hopkins will come with varied backgrounds,<br />\npresenting the best that each has to offer from which will<br />\ndevelop a more comprehensive, a more influential, a more<br />\nconstructive University spirit and \"Esprit de Corps\"<br />\nthan ever before.<br />\nThis would not have been so in years gone by.<br />\nA student formerly went into research largely to fit himself<br />\nto teach others.<br />\nIt was not unusual to find him the proverbial grind.<br />\nBut not so today.<br />\nWorld activities and problems are calling for scholars—<br />\nmen who know. But to know is not sufficient. One must<br />\nknow and know how to discover and to apply their discoveries in solving the problems of a cold-blooded, practical \"survival of the fittest World.\"<br />\nThat's the type you are going to see at Hopkins in the new<br />\nera.<br />\nThat's the type which will evolve a spirit at Hopkins destined to be the pattern for the University World.<br />\nYou are face to face with your great responsibility<br />\ngreat opportunity.<br />\n<br />\nyour<br />\n<br />\nGet on the band wagon and get on quick.<br />\nDon't stand on the side-lines.<br />\nDon't get run over.<br />\nDon't just hang on.<br />\nGet right up in the driver's seat—<br />\n<br />\nIf the Hopkins men of tomorrow were to be denied acquaintance with Freshman-Sophomore life, then in our opinions<br />\nthese men would be handicapped in starting on their way<br />\ntowards their bigger work.<br />\n<br />\nCrack the whip and let the world know that you and your<br />\nside-kicks are out to clear the way for the great procession<br />\nthat is to follow.<br />\n<br />\n(MORE NEXT ISSUE)<br />\nSigned<br />\n<br />\nWm. D. LILLY, J. H. U., Class '96<br />\n<br />\nSYDNEY M. CONE, M. D., J. H• U., A. B., '90<br />\n<br />\nDUSHANE PENNIMAN, J. H. U., A. B., '14<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER,FEBRUARY 12, 1926.<br />\n<br />\n6<br />\n<br />\nLACROSSE TEAM UNKNOWN RIFLE TEAM STARTS ON DR. WHITEHEAD PRESENTS<br />\nIMPORTANT PAPER<br />\nQUANTITY DUE TO LOSS<br />\nFIRST I. R. A. RIFLE<br />\nIN NEW YORK<br />\nOF FORMER STARS<br />\nMATCH THIS WEEK ,<br />\nPractice To Begin Early in March Western Maryland First on National<br />\nUnder. Leadership of Captain<br />\nSchedule to Decide Nation's<br />\nLevy and Veterans<br />\nChampion by March 20<br />\n<br />\nIs Result of Extensive Review of<br />\nLiterature On Dielectric<br />\nAbsorption<br />\n<br />\nAn important scientific paper<br />\nEarly in the month of March<br />\nAfter suffering only one defeat<br />\npresented at the Midwinter<br />\nwas<br />\nthe lacrosse enthusiasts will haul during the 1925-26 season the rifle<br />\nout the old crosse and roll out the team is firing its first Inter-Col- Convention of the American Inrubber pellet on to the fresh green legiate Rifle Association match stitute of Electrical Engineers by<br />\nturf of the budding spring season. this week against the University 1)1.. J. B. Whitehead, Dean of the<br />\nThe team, although there are of Western Maryland. This con- Engineering Faculty. Dr. W.. B.<br />\nmany good veterans eligible for test is the first of a series that Kunwenhoven, Chairman of the<br />\nthe coiling season, will feel the will continue until the week of local section of the Institute,<br />\nloss of Turnbull, Cone, Bates, Dra- March 20. At this time the cham- also attended the convention.<br />\nper, Kaufholz, and Almy. The pion of the Appalachian League, Eight sessions were held in<br />\nravages of the black list have not comprising Johns Hopkins and six New York City by the society bebeen particularly harrowing and other universitieswill be selected. tween February S and 11, during<br />\nmost of the veterans will be ready The winning team of that section which time thirty-five separate<br />\nto romp out on the green when will then engage in a shoulder-to- papers were read. A dinner dance<br />\nthe manager issues, after a fash- shoulder match with the leaders and inspection trips were also on<br />\nthe program of events. The meetion, the annual call to arms.<br />\nof other sections, in order to deterings took place -in the EngineerManagers Kidd and Keyes have mine the champion of the East,<br />\ning Societies Building of New<br />\nbeen looking into equipment all and ultimately the champion of the York City.<br />\nduring the bleak months of the United States.<br />\nThe paper which Dr. Whitehead<br />\nwinter. New sticks, gloves and<br />\nread this week is of particuBlue Jays Strong<br />\nlar interest as the second report<br />\nother paraphernalia will be ready<br />\nAlthough the Black and Blue<br />\nof the Committee on Electrical<br />\nfor those who show a brand of marksmen<br />\nare not confident of de- Insulation of the Division of Enability worthy of these outward feating all the Universities<br />\nof the gineering and Industrial Research<br />\nsigns of proficiency. Old equip- country,<br />\nthey are practically cer- of the National Research COuncil.<br />\nment will be in complete readiness<br />\ntain of leading the Appalachian It presented the results of an exfor the novices and others who<br />\nLeague. Their strongest oppon- tensive review of the literature on<br />\nare less fortunate in the sport.<br />\ndielectric absorption and theories<br />\nent will probably be Pennsyldielectric behavior, and closed<br />\nConditioning<br />\nvania State College, which was of<br />\nwith<br />\na brief summary and review<br />\nIn the short interval before prac- defeated earlier in the<br />\nseason by<br />\ntice is actually begun, the teams forty-one points. The only other of the subject.<br />\nDielectrics Little Studied<br />\nand the aspirants will, according possible source of trouble might<br />\n-Little,<br />\nif any, attempt has been<br />\nto a few of the candidates, spend be met in the University of West<br />\nDr. Whitehead in the<br />\nsaid<br />\nmade,\"<br />\nits time getting in condition for Virginia, which was beaten<br />\nby 186 introduction to his report, -to conthe stiff games in the offing. St. points. Both of these victories<br />\nJohns should be snowed under were gained with fifteen men trol the inherent characteristics of<br />\nwithout exertion, when the game firing, while the ten highest scores simple dielectrics, or to study their<br />\ninfluence in combinations.<br />\nis staged on Homewood field April counted.<br />\n\"Physicists appear to have all<br />\n3. But unless the week following<br />\nIn the telegraphic matches of<br />\nforgotten the unsolved probbut<br />\nis to tell an entirely different story the week ending January 23, the<br />\nlems<br />\nof dielectric behavior, or perthe Jays will have to use every list of conquests was increased by<br />\nto have given them up. The<br />\nhaps<br />\nmeans of turning the tide of battle the defeat of the Virginia Military<br />\ncontrol<br />\nof manufactured insulato a Hopkins victory. Oxford- Institute and the University of<br />\nCambridge will be here April 10. Porto Rico. The former was beat- tion appears to be limited to heat<br />\nAnd following this. will come en by a score of 1892-1818, and treatment, principally for the purArmy, Onondaga, Swarthmore and the latter by 1892-1804. Thus, pose of elimination of moisture—a<br />\npossibly Toronto. Toronto, how- the long record of victories is mar- sulliciently important object—and<br />\never, will be up to the team and red only by the nine point defeat to the obtaining of raw materials.<br />\nthe June Week Committee. If the at the hands of the Virginia Poly- \"Studies of the properties of<br />\nthese materials in their bearing on<br />\nteam wants to play the Canadians technic Institute.<br />\nthose<br />\nof the composite final form<br />\nand the Committee will take the<br />\nHeavy<br />\nof<br />\nSchedule'<br />\nthe<br />\ninsulation have not appearresponsibility, the athletic office<br />\nA<br />\nglance<br />\nat<br />\nthe<br />\nfollowing<br />\nscheded<br />\nin<br />\nany<br />\nquantity.<br />\nwill arrange the contest. The<br />\nule of matches for the<br />\n.<br />\nrest<br />\nof<br />\nthe<br />\n-The<br />\nliterature<br />\ndescribing work<br />\nschedule will close officially the<br />\nseason<br />\nshows<br />\nthat<br />\nmany<br />\npowerful<br />\nalready<br />\ndone<br />\non<br />\ndielectrics,<br />\nfrom<br />\nweek before exams.<br />\nteams are to be met. The I. R. the points of view of both theory<br />\nA. and shoulder matches are likely .and practice, is enormous in volto be easy victories, but the tele- ume. Many important data are<br />\nPlay Shop Holds<br />\ngraphic matches will cause many hidden in this mass, as well as<br />\nDance Tonight close contests. University of much careful and competent theoWashington has been rated among retical analysis.\"<br />\nA Valentine dance will be given<br />\nthe<br />\nfirst three teams in the counby the Homewood Play Shop to<br />\nConclusion<br />\ntry<br />\nfor<br />\nthe last four years. There<br />\nnight in the Play Shop theater.<br />\nThe report then went on to<br />\nThe admission will be one dollar a is also Northwestern University make a comprehensive review of<br />\nand University of Illinois, who<br />\ncouple.<br />\nthis literature and drew from the<br />\nAnnouncement is also made that are always the leading contestants review conclusions as to the most<br />\nthe Play Shop is busily working for the Western Conference Cham- promising directions for future<br />\non its next play, \"Charles, The pionship. The schedule is as work.<br />\nSecond\" written by Washington follows:<br />\nAt the end of the report, Dr.<br />\n13,—<br />\nIrving and John Howard Payne. February<br />\nWhitehead<br />\nhad this to say about<br />\nW. Md. (I. R. A.).<br />\nU. .of Tennessee.<br />\nthe application of this branch of<br />\nThis play is selected as typical of<br />\nU. of Kansas.<br />\nthe Restoration drama, and is exresearch work:<br />\nU. of Washington.<br />\nFebruary 20,—<br />\nOn the practical side, speaking<br />\npected to excite much interest<br />\nPenn State (I. R. A.)<br />\ngenerally, absorption is a conducNorthwestern U.<br />\nU. of Nebraska.<br />\ntion phenomenon, and therefore<br />\nFebruary 27,—<br />\nin<br />\nall cases of varying applied elecR.<br />\nA.)<br />\n(I.<br />\nVirginia<br />\nWest<br />\nof<br />\nU.<br />\nWe Believe We<br />\n<br />\nHave<br />\nFound Something<br />\nWorthwhile<br />\n•<br />\n<br />\nWatch This Space<br />\nNEXT TUESDAY<br />\n<br />\nColumbia U.<br />\nGeorgetown U. (Shoulder).<br />\nPrinceton U.<br />\nMarch 6,—<br />\nCarnegie Tech (I. R. A.).<br />\nU. of Illinois.<br />\nU. of Maryland (Shoulder).<br />\nMarch 13,—<br />\nU. of Pittsburgh (I. R. A.).<br />\nU. of Buffalo.<br />\nBoston U.<br />\nMarch 20,—<br />\nGettysburg (I. R. A.).<br />\nU. of California.<br />\nMarch 27,—<br />\nN. Carolina State.<br />\nU. of Delaware.<br />\nIowa State.<br />\n<br />\n(Continued on p. 2, col. 4)<br />\n<br />\nJleet rsijiatr°4-)<br />\n<br />\n)Irs<br />\n<br />\nlila<br />\n<br />\nwe<br />\n<br />\nan<br />\nact<br />\ntioi<br />\nStudent Presidents and Stewards come and<br />\ngo but she's the one who runs \"the house\"<br />\nwith particular attention to the table.<br />\nShe's pledged more freshmen than the<br />\nOldest Living Grad and saved more money<br />\nthan the Treasurer by pinning her faith<br />\nand reputation to<br />\n<br />\nShredded<br />\nWheat<br />\nar'round<br />\nHot or Cold -A11 year<br />\nas a food to build keen brains and sound<br />\nbodies for her boys (or girls as the case<br />\nmay be). Shredded Wheat combines all<br />\nthe elements you need for perfect nutrition, balanced to provide the ideal combination of salts, bran vitamins and iron to<br />\nbuild good brain, blood and bone.<br />\nMeet Mrs. Matron and make your next<br />\n7.30 breakfast out of Shredded Wheat.<br />\n<br />\nSATURDAY NIGHT<br />\n9 P.M.<br />\n<br />\nfoodfor thought-andexercise<br />\n.0.0.04moopo.ame<0...mogm.oemmadmisoamodalweinwom.oemboano40<br />\n<br />\nHo]<br />\n<br />\n3<br />\nsix<br />\n<br />\npal<br />\nwa<br />\nWa<br />\n<br />\n• at<br />\nthe<br />\nflub<br />\n<br />\nlieu<br />\n<br />\nfor<br />\n<br />\nWe:<br />\n<br />\nfril<br />\nthc<br />\n<br />\ntic<br />\nIt a<br />\nwi<br />\n<br />\ntii<br />\nsp<br />\ntic<br />\n811<br />\n<br />\nPhi<br />\nth<br />\n<br />\n111111111W<br />\n<br />\n6-62..)ise heads wear Stetson hats<br />\nthey look well and last long.<br />\nDo you wear a Stetson?<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\nit,mmmormawoimpo.......ammosmsommiroimmo•MIDoomm0<br />\n<br />\nC. E. HALL—$1.00 A COUPLE<br />\n<br />\nby<br />\ncor<br />\ntall<br />\n<br />\nas<br />\nof<br />\n<br />\nCOTILLION CLUB<br />\n<br />\nDANCE<br />\n<br />\nVO<br />\n<br />\n\f", "format": "basic_html", "processed": "irr;<br /><br />\nVOL. XXX, No. 30<br />\nSPRING SEASON TICKETS<br />\nWILL BE OFFERED<br />\nTO ALUMNI<br />\nChairman Heyn and Committe of Seven<br />\nTo Organize Publicity. Campaign and Teams<br />\n- Plans were laid for the inauguration of the spring season ticket<br />\ncampaign at a conference of Coach<br />\nVan Orman, Graduate Manager<br />\nKeyes, and Robert Heyn, president<br />\nof the Athletic Association Board<br />\nheld this week. Reyn is to be<br />\nchairman of an undergraduate<br />\ncommittee that will be in charge<br />\nof the campaign.<br />\nThree Weeks Drive<br />\nThe campaign will probably<br />\nstart on March 8, and last three<br />\nweeks.. According -to ',present<br />\nplans, certain undergraduates will<br />\nbe organized into teams, each team<br />\nto be captained by a member of the<br />\nundergraduate conurnittge mentioned above. There , will, be five to<br />\nseven of these teams, depending<br />\nupon the decision of the board.<br />\nThe campaign. will be an intensive one. The Athletic Associa-<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 12, 1926.<br /><br />\nHULLABALOO VOTING<br />\nTHROWN OPEN AGAIN<br />\nAccording to an announcement made by President Lord<br />\nof the Junior class, the voting for Editor-in-Chief and<br />\nBusiness Manager of the Hullabaloo was so thin that none<br />\nof the candidates was elected.<br />\nUnder the new class constitution a majority vote of the<br />\nclass is necessary to elect a<br />\nman to office. The candidates<br />\nare Charles Reese for Editorin-Chief and O'Dunne, Abrahams and Bortner for Business Manager.<br />\nThe polls will be reopened<br />\ntoday from twelve thirty until one, under the supervision<br />\nof the Student Council. Only<br />\nthose members of the class<br />\nwho have not voted previously will be entitled to a vote.<br /><br />\nDR. PUPIN TO BE GUEST<br />\nAT LUNCHEON<br />\nDr. and Mrs. Goodnow to entertain<br />\nProfessor on February 22<br /><br />\nPRICE 5 CENTS<br /><br />\nMISS KAY FIELDS WINS<br />\nBARNSTORMERS CLUB<br />\nPOSTER CONTEST<br /><br />\n$50,000 OFFERED TOWARD<br />\nNEW ACTIVITIES BUILDING<br /><br />\nWill Receive Box at Performance;<br />\nCoach Swindell has Rough'. Voyage<br />\nReturning From Europe<br /><br />\nSUM MUST BE MATCHED BY OTHER ALUMNI<br /><br />\nMiss Kay Fields of the Maryland Institute was pronounced<br />\nwinner of the Barnstormers Club<br />\nposter contest. The judgment was<br />\nmade by Mr. and Mrs. Swindell<br />\nand members of the club at the<br />\nrehearsal last Saturday afternoon.<br />\nMiss Fields, who won from a field<br />\nof some twenty odd, will receive a<br />\nbox at one of the performances<br />\nnext month. No decision has been<br />\nreached in the program cover contest.<br />\nThe rehearsal was the first one<br />\nheld since Mr. Swindell's return<br />\nfrom Europe, and he was delighted<br />\nwith the progress the club has<br />\nmade on the production during'<br />\nhis absence. Mr. Swindell returning on the Steamer Olympic, had<br />\nthe misfortune of being on the<br />\nship when it encountered the worst<br /><br />\nNEW STRUCTURE CAN BE STARTED AS SCION AS SUM<br />\nRAISED, SAYS PRO liCST CHARLES K. EDMUNDS<br />\nSCHERR TO PLAY<br />\nFOR BLUE JAYS<br />\n.1. J. Scherr, the Blue Jay<br />\nOrchestra's most illustrious<br />\nsaxophonist of all time and<br />\nits leader last winter has returned to this University for<br />\nthe second semester to take<br />\nhis degree. The former leader<br />\nmade his return debut at the<br />\nTea Dance at Lehmann's Art<br />\nCentre last Saturday. He<br />\nwill play with :the Twin Six<br />\nfor the rest of the year.<br />\nIf anything, Scherr's playing, seasoned by several<br />\nmonths with Paul Whiteman's Second Band in New<br />\nYork, is superior to the high<br />\ncalibre furnished last winter.<br /><br />\nAn indication that the New Plan<br />\nis not expected to endanger the<br />\nstatus of student activities at<br />\nJohns Hopkins was made public<br />\nthis week by Provost Char!e.- K.<br />\nEdmunds. According to the provost, a prominent alumnus assures<br />\nus that he can secure $50,000<br />\ntoward the erection of a Student<br />\nAetivities Building, provided that<br />\nan equal sum be raised from the<br />\nalumni body. The total cost of<br />\nthe building would be in the neighborhood of $145,000.<br />\nThat the completion of this fund<br />\nis extremely likely is shown by the<br />\nsubscription of $10,000 already.<br />\nThe trustees have also, on hand<br />\n$45,000 received from Mr. Eugene<br />\nLevering of this city. Of this<br />\namount $20,000 represents insur-<br /><br />\ntrip across the boat had experiDr. Michael Idvorsky Pupin, enced in its<br />\nhistory.<br />\neiation in poorer financial shape who will<br />\nHall, which, it<br />\ndeliver the principal adTWO HUNDRED JOKES ARE ance on Levering<br />\nTownsend<br />\nBack<br />\nthan it has been in more than four dress at the<br />\nRECEIVED BY JAY<br />\nwill be recalled, was destroyed in<br />\nfiftieth Commemora1Zalph Townsend, who made the<br />\nyears, due to the rainy football tion Day<br />\nfire of 1919, and the remainder<br />\nthe<br />\nExercises is to be the<br />\nThree Five Dollar Awards To Be<br />\nclub<br />\nthree<br />\nhas<br />\nyears<br />\nago,<br />\nbut<br />\nwho<br />\nseason and a decline in interest guest of honor at a luncheon given<br />\na gift from Air. Levering to the<br />\nMade After Judges Pick Jokes<br />\nbeen tumble to come out during<br />\namong both undergraduates and by Dr. and Mrs. Frank<br />\nFund to be used for<br />\nHalf-Century<br />\nJohnson<br />\nOver two hundred jokes were<br />\nthe<br />\nlast<br />\ntwo<br />\nseasons,<br />\nis<br />\nagain<br />\ntakalumni. The coming lacrosse sea- Goodnow on Monday, February 22<br />\nthe erection of a Student Activiing an active part. Though he has turned in to the contest editor of ties Building. This $45,000, howson will pay for the running exat one thirty.<br />\nrecently been sick, his tine acting The Muck mid Blue Jay, Circu- ever, cannot be included in the<br />\ntime the coaches are paid, equipDr. Pupin was born of poor paris easily making up for lost time. lation Manager Cone announced 1$50,000 to be raised.<br />\nment is purchased and advertising ents in Hungary in 1858.<br />\nBe came<br />\nThere is,also Francis II asbrouk, Friday. So many of these are of<br />\npaid for.<br />\nNo Time Limit<br />\nto this country while still a young<br />\nwho starred as Mr. Jellicott, the merit that between two and three<br />\nDeficit Now<br />\nThere has been no time limit<br />\nman and received an A. B. degree<br />\nIt is the aim of the Athletic<br />\npompous Englishman in last year's pages of them are to be printed in<br />\nset for the raising of the additional<br />\nat Columbia University in 1883.<br />\nOffice to raise $6,000, $700 to $800<br />\nproduction. Re has been busy the next Jay, which will be re- , $50,000, but it is believed that the<br />\nHe attended the University of<br />\nof which will go toward defraying<br />\nwith exams but is now free to leased on the nineteenth of this money will not be long forthcomBerlin where he received a Ph. D.<br />\nthe costs of the campaign. As<br />\ndevote his talent to the footlights. month at the swimming meet with<br />\ning. Work on the building can<br />\ndegree in 1889. He received the<br />\nAnother man who has been par- Delaware.<br />\nthere is at present a deficit of<br />\ngin as soon as the necessary sum<br />\nSc. D. degree at the University of ticularly successful in his attempt<br />\nThree awards of five dollars<br />\n4650, the success of the campaign<br />\nCalifornia. The honorary degree ti4 be a woman is Leslie Schwinn. each will be made for the best has been raised.<br />\nmust be insured if the Athletic<br />\nThe Half-Century Committee is<br />\nof LL. D. was conferred upon him He was a ravishing female in drawing, the best joke, and the<br />\nAssociation is to succeed .finanby the Johns Hopkins University. 1924 but was unable to 10:tempt cleverest verse: All the contri- now making its final drive among<br />\ncially this year. It is hoped that<br />\nto make the cast last year. John<br />\nthe alumni. Those who have not<br />\nAt present Dr. Pupin is Profesthe gate receipts of the spring seaDesch, the fair heroine and butions selected for publication responded are being approached<br />\nson will pay for the running ex- sor of Electro-Mechanics in Col- heart-breaker of 1924, is again will be reprinted in sheet form again.<br />\nOn a card recently sent to.<br />\npenses of the office for the remain- umbia University. He is President free from the worry of studies and and a number of them sent to these alumni, attention is called to<br />\nder of the year.<br />\nof the American Institute of Elec- on the -stage. :His efforts are ex- prominent men. These judges a fund for the maintenance of<br />\nIn addition to personal solicit- trical Engineers and President of pected to excel those of last<br />\nwill be asked to pick the best from buildings and facilities for student<br />\ning by members of the ticket teams,<br />\nyear as further experience with<br />\nthe American Association for the<br />\nthese -Applause Cards\" and their activities. However, since the rethe alumni will be approached<br />\nthe fair sex has enabled him to<br />\nceipt of the recent generous offer,<br />\nAdvancement of Science.<br />\nthrough the mails. Circular letstudy their habits and wiles in verdict will be abided by.<br />\nparticular attention is being atDr. and Mrs. Goodnow have is- more detail.<br />\nters will be sent to every alumnus,<br />\nThe winners will be announced tracted to this fund. Especially<br />\nand every means of persuasion will sued 1,400 invitations. About 400<br />\nin the issue of March 26. In case in the case of alumni of the underCast Indefinite<br />\nbe used to sell season tickets.<br />\nguests are expected to attend.<br />\nThough these new arrivals this of a tie, student opinion will guide graduate schools is this being emphasized.<br />\nyear have been showing up very the choice.<br />\nLocation<br />\nwell, the east is not at all definite.<br />\nThe<br />\nproposed<br />\nbuilding would<br />\nMost of the men are interchanging Three Men To Represent<br />\nprobably<br />\noccupy<br />\none<br />\nof the sites to<br />\nin all the parts so that the various<br />\nJay At Princeton<br />\ntime north of and facing the ChemiThe new plan will soon either be Edmunds will settle all doubts characters are familiar to everyone. Under this plan, regular at-' Ludlow H. Baldwin '26 Gordon cal Laboratory. In it would be<br />\nentirely dropped, or dropped for a on the subject.\"<br />\nWhile it is not definitely known tendance at rehearsals is demand- M. Stick '26, and Maxwell B. Cone offices of the Y. M. C. A., the<br />\nterm of years, according to Norwhat Dr. Edmunds said in his let- ed if a man expects to appear on '27 will represent the Black and NEWS-LETTER, the Black and Blue<br />\nInan C. Keyes, Graduate Manager ter to Keyes, it is believed that he<br />\nthe Lyric stage on March 26 and Blue Jay at the annual meeting of Jay, the Hullabaloo, Barnstormers<br />\nof Athletics. Keyes has just re- has announced the indefinite post- 27.<br />\nthe Association of College Comics Club, Musical Club, and any other<br />\nThe production staff is expect- of the East next Saturday and activity that should need room.<br />\nceived a letter from Provost Char- ponement of the shift of Hopkins<br />\nSunday. The trio will leave Fri- The athletic offices would also be<br />\nles K. Edmunds that will settle to a graduate research institution, ing to design the scenery in an<br />\nas proposed by President Good- unusual manner. All the curtains day evening after the Musical Club situated in the new building. Of<br />\nall dispute about when the Plan<br />\nnow.<br />\nand drops will be painted accord- concert in which Stick will partici- course, an adequate cafeteria is<br />\nWill or will not be put into effect,<br />\nHowever, until the circular of ing to a scientifi'c color scheme so pate and the swimming meet in included in the tentative plans.<br />\nIf the sum be raised by June,<br />\n;Ind the Athletic Office is sending the Athletic Association is issued, that the scenic effects will be en- which Baldwin will be a contestant.<br />\nexample, the new Student Acno<br />\nfor<br />\none<br />\nin<br />\na<br />\nposition<br />\nto<br />\nknow<br />\nthe<br />\ntirely harmonious. In a particuout facsimile copies to all alumni<br />\nThis year the convention is at tivities Building might be comfacts will commit himself to larly brilliant ballroom scene there<br />\n:it'd. undergraduates.<br />\nthe extent of confirming or deny- will be an Egyptian motif that is Princeton, N. J. under the auspices pleted by the fall of 1927. Dr. Eding<br />\nthe rumor that the plan has accentuated by every detail. of the Princeton Tiger, Princeton's munds believes that its construc\"Ile student body will soon<br />\nbeen<br />\ndropped temporarily: The Though no definite designs have humorous publication. A formal tion should not take as long as<br />\nknow what the status of the<br />\ncircular letter will be sent out been selected, Hadley King and banquet scheduled for Saturday that of the Chemical Laboratory,<br />\nundergraduate school will be,\"<br />\neither Saturday or Monday, ac- Donald White, along with many evening occupies a prominent posi- once the actual work gets under<br />\nKeys;aid<br />\n\"The letter from Dr. cording to Keyes.<br />\ntion on the convention's program. way.<br />\n(Continued on p. 4, col. 1)<br /><br />\nPOSTPONEMENT OF NEW PLAN IS<br />\nLIKELY,SAYS MANAGER KEYES<br /><br />\nTHE. JOHNS HOPKINS NIPAVS.LETTER,FEBRUARY 12,1926.<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoflice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nHomewood 0100<br /><br />\nTelephone.<br /><br />\nBusiness Manager<br />\nOTHO J. KELLER III, '26<br /><br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\nCHARLES F. REESE, '27<br /><br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, '26<br /><br />\nColumnist<br />\nHAROLD S. GOODWIN, '26<br />\nAssociate Editors<br />\nA. RISLEY ENSOR, '26<br />\nRICHARD R. GRIFFITH, '28<br />\nMORTON HAMBURGER; JR., '28<br />\nJunior Editors<br />\nW. BARNES HALL, '26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nBRINTON H. STONE, '27<br />\nDONALD C. NILES, '28<br />\nLAWRENCE P. KATZENSTEIN, '28<br />\nCORNELIUS S. FRANCKLE, JR.., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br /><br />\nNEWS<br /><br />\n\"Hamlet, as Shakespeare staged Hamlet when Marcellus, Horatio,<br />\nit,\" was the subject of a lecture and Bernado are sitting on the<br />\ndelivered by Mr. William J. Law- battlements the ghost appeared,<br />\n\"The largest and best planned<br />\nrence, prominent Irish lawyer, and not through the usual entrance,<br />\nlibrary in the world\" will rest one of the greatest living authori- which was at the rear of the stage,<br />\nwithin two years on the campus of ties on the Elizabethan stage, last but through a trapdoor immediateYale. It will be 192 feet high, 85 Friday afternoon in the Civil En- ly before their eyes. Armor was<br />\nproductions<br />\nfeet square, and will cost $6,000,- gineering building. The lecture, not worn in the first<br />\na sort ,of<br />\nInstead<br />\nof the year, was given of the play.<br />\n000, housing eventually 5,000,000 the third<br />\nemployed,<br />\nwas<br />\nunder the auspices of The Tudor silvered leather suit<br />\nvolumes and admitting two thouthe<br />\nactions<br />\nwhich did not hamper<br />\nand Stuart Club.<br />\nsand readers at a time. It will be<br />\nMr. Lawrence pointed out that of the players at all. Today the<br />\ncalled the Sterling Memorial Li- Shakespearian production had de- ghost says \"adieu\" three times<br />\nbrary.<br />\nviated much from the way in when lie passes out of the door,<br />\nof<br />\nroom<br />\nlittle<br />\nwhich it was first played by that but when Shakespeare played it<br />\none<br />\nwill<br />\nbe<br />\nThere<br />\nplaywrite and producer. Of he said his \"adieu's\" as he was<br />\ngreat<br />\nextraordinary interest: a replica<br />\nthere has been some being lowered through the trapyears<br />\nlate<br />\nof the Yale Library as it was in<br />\neffort to retrace the steps, and to door.<br />\n1743: a room some I wenty,two feet<br />\nModern Dress Old Idea<br />\nproduce the drama as Shakespeare<br />\n31r. Lawrence said that the sysby thirty-one feet, containing the did. The stage directions are<br />\nsame old volumes or duplicates, vague, but by careful observation tem , of playing \"Hamlet\" in modentered by the same old doors, and of the methods of the time, one ern clothes is not a new idea, this<br />\nmethod has been in use for some<br />\nfitted out with the.same old style can secure the methods of staging<br />\nShakesperian drama in the time of time. Mr. Lawrence further pointof furniture.<br />\ned out that there has been some<br />\nElizabeth.<br />\nThe New Stu den t mentioils<br />\nchange in !the closing scene. Sir<br />\nGhost Scenes<br />\nthat this is one of the most fasciMr. Lawrence selected \"The Henry .Irving, a famous authority<br />\nnating tales in American college Ghost Scenes of Hamlet,\" as the on Shakesperian drama thought in<br />\nhistory, for Yale was a library be- part of the play best suiting the the nineteenth century that the<br />\noriginal pro- two portraits in this scene were<br />\nfore it was a college. Before Yale deviation from the<br />\nduction. Now the ghost comes out in the first performance of the<br />\nhad a single student or a teacher,<br />\non the stage in the usual manner, stage. From strong evidence it is<br />\na local habitation or a name, it in practically the same way as the believed' that these pictures were<br />\nhad a small library assembled by other actors do. This was, how- on the back wall of the stage, and<br />\nhalf a dozen colonial ministers, ever, quite different in the olden were curtained, as was the node<br />\nwho by pledging a gift of books times. A trapdoor was the usual at that time.<br />\nMr. Lawrence has devoted his<br />\nat Branford in 1701, and accord- method for the entrance and exit<br />\ning to tradition, actually laying of ghosts.. Mr. Lawrence said that life to a study of Elizabethan<br />\nsome of them on the table, found- there were numerous examples of drama, and is probably the greated a -Collegiate School in His this in theatrical production of est living authority on this subject.<br />\nMajesty's Colony of Connecticut.\" this period. It was an integral He has been lecturing at Harvard<br />\n* *<br />\npart of the play to have the ghost, for the past four months, and<br />\nBefore becoming collegiate, a or devil, gradually appear and every afternoon for the past week<br />\nfreshman at Penn State College, fade out of sight. Without it the has been with the English semimust give up his pleasant associa- play would have been shorn of nary. Immediately before the lections with co-eds, except; at many of its thrills, and the audi- ture he was the guest of the Tudor<br />\nstated periods; he must be seen on ence would have been sadly dis- and. Stuart Club whichi gave a tea<br />\nthe campus with his hands in his appointed. In the ghost scene in in his honor.<br />\npockets, and his coat uributtoned,<br />\nkeeping off the grass, and abstain- 'DR.WHITEHEAD PRESENTS PAPER PAYMENT OF DORMITORY<br />\ning from wearing gaudily colored<br />\n(Continued from p. 6, col. 3)<br />\nPLEDGES URGED<br />\nsocks.<br />\ntric force, occasions a current<br />\nA freshman found guilty of component in phase with that Alumni Committee Issues Circulars<br />\nbreaking any of these rules is pub- force. This means an energy loss<br />\n• To Fund Subscribers<br />\nlicly barbered and then -adorned in the dielectric.<br />\nCirculars appealing for prompt<br />\nin women's regalia\" for two weeks<br />\n-The two extremes of disadvanand in the spring of the year given tage of the presence of this loss payment of subscriptions. to the<br />\na molasses bath.<br />\nare the danger it occasions to the A luumi n i Memorial Dormitory<br />\nThe editor of The Daily Ne- life of high voltage insulation and<br />\nFund and thanking those who<br />\nbraskan derides this mode of initi- the effect in the high frequency<br />\nation into the realms of higher impulses and signals of wire and have already paid fuel r contrilearning and speaks slightingly of cable communications of telegra- butions in full have been issued<br />\nthe cultural development of the phy and telephony.<br />\nby a special committee consisting<br />\nstudents at Penn State concluding \"It is remarkable that so little of<br />\nHorace Burrough, Jr., George<br />\nwith; -Yes, We of the West do not attention has been given the propL. Radcliffe, Robertson Griswold,<br />\nknow what we are missing. 1 erty of dielectric absorption in<br />\nand<br />\nCharles K. Edmunds.<br />\ntakes some such revelation of in- the efforts which have been inade<br />\ntelligence as that at Penn State to improve the qualities of comOf the $172,312 subscribed by<br />\nto wake us up.\"<br />\nmercial insulation. Studies in this alumni and friends of the UniThe \"Penn State Collegian\" de- direction are certain to produce versity, $125,845<br />\nhas been collectfends the traditions of its Alma new knowledge leading to improveed. No less than 843 subscribers<br />\nMater.<br />\nments and economics.<br />\nhave paid their pledges in full and<br />\n\"Many, many years ago, good<br />\n\"Thus, there is a wide field of<br />\nold Noah Webster defined culture study apparently still untouched 211 in part, while 328 have not<br />\nas follows:'The training, improve- in our efforts to-c-oirtPortlit-iiiost as yet remitted a single dollar of<br />\nment and refinement of mind and vulnerable and. troublesome of all the amounts they subscribed. The<br />\nmorals.' And we should be willing the materials used by the electrical committee hopes to collect the<br />\nto stack Penn ,State's mind and engineer.\"<br />\nunpaid pledges to the fund by<br />\nmorals against those of Nebraska<br />\nies. It is especially useful to Cor- February 22.<br />\nWhen a freshman<br />\nany day.<br />\nnell alumni who find it difficult to<br />\nThe Alumni Memorial Dormiemerges into the sophomore class<br />\nfind lodging during a big game.<br />\nhere, he at least knows something<br />\nwas constructed as a monutory<br />\nThe entire student body are memof college tradition. At Nebraska,<br />\nbers, are almost three hundred ment to those graduates and stuhe probably wears plus—fours<br />\nothers from the faculty and resi- dents of Johns Hopkins Univerand smokes Lord Luckyfields.<br />\ndent alumni.<br />\nsity who gave their live§ for their<br />\nBut, of course, that's the West's<br />\ncountry<br />\nin the World War. The<br />\ndefinition of culture.<br />\n*<br />\n*<br />\ntotal cost of the building with<br />\nNOTICE<br />\nThe New Willard Straight Hall<br />\nequipment was $509,165, most of<br />\nat Cornell has become the social<br />\nNo Discount on Senior Class Dues<br />\nwhich was borrowed from the genheadquarters of the college. It<br />\nAfter Monday. See Townsend, Berndt,<br />\neral fund of the University. The<br />\ncontains a well equipped theater,<br />\nHunter, Baldwin, Meredith or HopAlumni Committee is, of course,<br />\nkins.<br />\ncafeteria, tea rooms, soda fountain,<br />\nROBERT HOPKINS,<br />\nanxious to pay this debt and is<br />\nand memorial hall, besides the<br />\nTreasurer.<br />\nseeking all contributions possible.<br />\nusual lounge rooms and dormitorINTERCOLLEGIATE<br /><br />\nSubscription<br /><br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br /><br />\nAUTHORITY ON ELIZABETHAN<br />\nDRAMA LECTURES ON\"HAMLET\"<br /><br />\nCirculation Manager<br />\nROBERT T. SAUERWEIN, '26<br /><br />\nAssistant Business Managers<br />\nHEywAan E. BOYCE, JR., '27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, JR., '27<br />\nWILLIAM BORTNER, 927<br />\nIRVING HOFFMAN, '28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br />\nSAMUEL M. HECHT, '29<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 12, 1926.<br /><br />\nTHE PUBLICITY BOARD<br />\n• After years of almost supine existence, the Publicity Board<br />\nis at last to be called upon to make a good defense of itself, or<br />\nbe abolished by the Student Activities Council. The move is<br />\npraiseworthy. All useless organizations should be removed from<br />\nthe Campus, and unless the Publicity Board can convince us<br />\nby strong arguments to the contrary, we must admit its uselessness, and advocate its consignment to the limbo.<br /><br />\nMEN'S RIGHTS<br />\n\"It is to laugh,\" said some, when they read of the recent<br />\nshaving episode at a western university. It seems that a<br />\ntolerant professor told the men that they had just as much right<br />\nto shave their ugly faces in the class-room as the women had<br />\nto powder their shiny noses. Taking the unwary \"profs\" at his<br />\nword, two students entered the clas sthe next day, equipped with<br />\nrazors, soap, and towels, and proceeded to shave themselves<br />\nduring the lecture, to the immense amusement and satisfaction<br />\nof the class. However, the professor proved to be a good sport,<br />\nand awarded the shavers A's for the semester, stating that he<br />\nadmired the way in which they stood up for men's rights.<br />\nThere is much meat in the incident. The long and constant<br />\nfight for \"Women's Rights\" has caused a corresponding depression in the rights of the so-called sterner sex. It is high<br />\ntime for men to rally around the flag, to fight fOr their liberties.<br />\nHopkins has seen something of the battle. By the wise and<br />\nforunate provision in the will of Johns Hopkins, (or was it incorporated in Dr. Gilman's plan?), the undergraduate school<br />\nis not co-educational. Nevertheless, woman has from time to<br />\ntime crept into the sacred precincts of the male. Even now, in<br />\none of our classes, we can swear that there are at least three of<br />\nthe unfair sex, airing their deficient knowledge and pulling down<br />\nexcellent grades. The professors are not immune to their wiles.<br />\nOne brave instructor, though, actually had the temerity to ask<br />\none of the dears a question. She has not appeared in the class<br />\nsince.<br />\nWhile we are not women haters, and while we admit that<br />\nthey are very very essential at the proper time and place, we<br />\nhope that the powers that be will keep them out of the undergraduate classes. They are only an unnecessary distraction to<br />\nthe toiling student.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS.LETTER, FEBRUARY 12, 1926.<br />\nEarl L. Simpson<br /><br />\nH. Glynn Morris<br /><br />\nPhone: Homewood 9621<br /><br />\nit? And in Philadelphia, too. I Homewood 4391<br />\nLiberty 1209<br />\nNEWS-LETTER<br />\nturn again; this stares me in the<br />\nFANCY DELICATESSEN<br />\nMAILBAG<br />\nface: \"Dry Agent Witness at Col2022 N. Charles St., Salto., Md.<br />\nlege Probe. Investigation of AlSPECIAL RATES FOR HOPORCHESTRAS<br />\nAll letters intended for publication<br />\nKINS STUDENTS<br />\nleged Liquor Law Violations and<br />\nmust be concise, written in ink on<br />\nnow<br />\nSummit,<br />\nOrchestras<br />\nplaying<br />\nCommunistic Activities Among<br />\nregular letter size paper, on one side<br />\nonly.<br />\nSilver Slipper, Alcazar<br />\nthe<br />\n'<br />\nFaculty and Students<br />\nNo attention will be paid to anony-<br /><br />\nBOULEVARD RESTAURANT<br /><br />\nSimpson - Morris<br /><br />\nmous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nOH BARN! OUR BARN<br />\nTo the Editor of the News-Letter:<br />\nDear Sir:<br />\nNever, since Adatu was given the<br />\nGarden of Eden to dress and keep,<br />\nhas a structure been so appropriately named as our own -Barn.\"<br />\nWhat pleasant associations attached to the immortal barn!<br />\nHow many s of us can remember<br />\nthe romps we had in the old hay<br />\nstack, and the time we unknowingly rolled into the wasp's nest?<br />\nThe old barn, the dear old barn,<br />\nwith its pungent 'odors, its great<br />\noozy mires, its adjoining pig pen,<br />\nand its smoking ordures. The old<br />\nbarn, sweet to the memory of the<br />\nboy who has been blessed with a<br />\nsojourn in the sticks. With all its<br />\nreek and filth and odor, we adore<br />\nit.<br />\nAt Homewood there is a building which was converted into—<br />\nbut there we must stop, because<br />\nit is apparent that the conversion<br />\nis only fiction. The old barn is<br /><br />\n* *<br /><br />\nMc PHERSON'S<br />\n11 E. BALTIMORE ST.<br /><br />\n*<br /><br />\n\" My, oh, my, and in<br />\nOhio! And then, then I saw the Office: 10 E. FRANKLIN ST.<br />\nPhone, Vernon 0226<br />\nknockout, the veritable piece de<br />\nresistance:\"<br />\n, a sophomore at<br />\n, was suspended from the<br />\nuniversity today as the result of<br />\na wild automobile ride, just beThe Personal Writirk,<br />\n.! Machine<br />\nfore the Christmas vacation, during which he ran down a squad<br />\nof eight Bridgeport policemen as<br />\nthey were about to board a trolley.\" Now that shows what college men can do.<br /><br />\n93lue Suits<br />\nwill be very popular this year in<br />\nfancy weaves—<br />\ndiagonals — wide<br />\nwales and dia.<br />\nmonds— and lots<br />\nof plain ones, too.<br /><br />\nCoRorsTA<br /><br />\nM.W.LUCY &amp; CO.<br /><br />\nBut I am ashamed when I com104 W. Fayette St.<br />\npare these interesting achievements with Hopkins'. How can<br />\nwe ever hope to be a real college<br />\nGALEN HALL<br />\nwhen we lie here in a sink of eduAtlantic City, N. J.<br />\ncation, simply, oozing respectability? Fellow students, where is<br />\nMay we send folder, bills of fare,<br />\nthat much vaunted school spirit and especially attractive rates at this<br />\nof ours? Cannot we also do some season? No better food and service<br />\nthing epoch-making? It is indeed anywhere. It is our purpose and<br />\nheartrending to sit here and,think practice to give rather more than is<br />\nof our Alma Mater being thus usual for the rates charged. We try<br />\neclipsed by everyone. Have we at to keep our old friends, and we like<br />\nHomewood no public-spirited stu- to make new ones. Good Music.<br />\ndents who will spring up and startle Baltimore and, yea, even this<br />\n-keep cool with Coolidge\" country; no one who will show what,<br />\nHopkins can do? Hopkins has a<br />\nright to expect the best of every<br />\nman,—and then, I find men in<br />\nthe libraries, in the laboratories,—<br />\n11.01141<br /><br />\n(Continued on p. 4, col. 1)<br /><br />\nstill there, bless it, and although<br />\nsome extreme romanticists may in<br />\ntheir most ethereal moments refer DON'T FORGET!<br />\n—clothes that are tailored to<br />\nto it as the Student Activities<br />\nyour measure fit you best.<br />\nBuilding, yet the majorty of us<br />\n—they have the right cut..<br />\nmortals must confess that the<br />\n—they make you feel welldressed.<br />\n\"Barn\" is a barn still, in every<br />\ncharacteristic of the country barn<br />\nso deeply impressed upon our<br /><br />\nr-<br /><br />\nhearts and noses.<br />\n, Oh Barn! Our Barn! May many<br />\n•*\" a<br />\nN<br />\nwarm suns penetrate the odorifie<br />\n4'*9<br />\nfumes ascending from your rank,<br />\nrotten recesses, your humid and<br />\n911.A.4k1-1LCCM$<br />\nc&amp;Usmore<br />\ndingy caverns of subtle mystery.<br />\nWe revere thee; center of our stu- See \"GARD\" MALLONEE &amp; FRAMK MEREDITH at the Barn<br />\nDowntown at 407 N. GAY St.<br />\ndent activities, slimy place of our<br />\nlunches. We love thee truly, and<br />\nthough thy filth of orange peels,<br />\nspilled milk, broken glasses,<br />\namassed papers, and heaps of refuse utterly consume us—yet we<br />\nshall not advocate a new building.<br /><br />\nUPLIFT.<br /><br />\nEXCUSE OUR CRUST!<br /><br />\nTo the Editor of the News-Letter.<br />\nDear Sir:<br />\nI read with interest the newspaper accounts of non-athletic activities at several of our American institutions of higher education. In last night's edition of<br />\none of our Baltimore papers I<br />\nread, \"Sixteen Students on Probation for Kidnapping Episode.\"<br />\n\"Pine,\" I say, wetting my lips in<br />\nanticipation, \"oh, yes, a well<br />\nknown college in Annapolis; oh,<br />\nYes!\" I turn a page. Screaming<br />\nheadlines, \"Junior's Back Broken<br />\nIn Rum Revel! As a climax to an<br />\norgy that started on New Year's<br />\nEve and continued for two nights<br />\nand a day, * * * a junior * * * is<br />\nnear death with a broken back.\"<br />\nWell, well, who'd have thought<br /><br />\nENGLISH OVERCOATS<br />\n$30.00 to $75.00<br /><br />\nAusicians<br />\nYour whole orchestra can<br />\ntravel cheaper and keep<br />\nmore engagements with<br />\nless lost time by renting<br />\nSaunders System cars. Go<br />\nand come when you please.<br />\nNo waits—nc delays. Cost<br />\nless than rail fare for five<br />\nor more.<br /><br />\nHomewood and Edgetvood<br /><br />\nWatch for Our Showings<br />\nSee the fall and winter lines in authori.<br />\ntative American and English styles for<br />\nthe College man—in single and double<br />\nbreasted models exquisitely tailored,<br />\nperfect fitting.<br />\n$29.50 and $34.50<br />\nNationally<br />\nKnown<br /><br />\nYustly<br />\nFamous<br />\nBALTIMORE<br /><br />\nairrIer<br />\n,<br />\nr411<br /><br />\n147\"7167NY-Irfivv'T4Vv*IIRYN\"ervNgirvIlirvW\".\"131/7r.<br /><br />\nWNW\\<br /><br />\necorate<br />\nyourself with<br />\nthe degree<br />\nof P. A.<br />\nmeans \"Pipa Amoroso\" in the Latin, or<br />\n\"pipe-lover\" in plain campus English. P. A.<br />\nhas certainly endeared a pipe to more men than<br />\nany other letters in the smoke-alphabet. Because<br />\nPrince Albert lets a fellow smoke all he wants<br />\nto—and makes him want to!<br />\nCool as the stare of a marble Venus. Sweet<br />\nas the approach of vacation. Fragrant as spring<br />\nblossoms. Think up your own similes, Fellows.<br />\nYou will when you pick P. A. and a jimmy-pipe<br />\nfor permanent roommates. Prince Albert is<br />\ngreat tobacco, and that's not blah.<br />\nGet yourself a tidy red tin of Prince Albert<br />\ntoday. Fill the bowl of that old jimmy-pipe to<br />\nthe brim and borrow a match. Then you're set<br />\nfor some great smoke-sessions, as sure as you're<br />\na foot high.<br />\nTHAT<br /><br />\nSAUNDERS SYSTEM<br /><br />\nOR1NGE ALBERT<br />\nDrive It irOttrrieff<br />\n•va.<br /><br />\nvtil<br /><br />\n13<br /><br />\n—no other tobacco is like it!<br />\n1926,R. J. ReynoldsTobacco<br />\nCompany,Winston-Salem,N. C.<br /><br />\nP. A. is sold everywhere in<br />\ntidy red tins, pound and halfpound tin humidors, and<br />\npound crystal-glass humidors<br />\nwith sponge-moistener top.<br />\nAnd always with every bit of<br />\nbite and parch removed by<br />\nthe Prince Albert process.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 12, 1926.<br /><br />\n4<br /><br />\nDeveloping<br />\nPrinting<br />\nEnlarging<br /><br />\nKodaks<br />\nCameras<br />\nSupplies<br /><br />\n%%FURNITURE OF QUALITY<br />\n% Your Future %% Deal with a Firm equipped with 57 years' Experience.<br />\n•<br />\n%<br />\n%% SUCCESS %% Our Salesmen are Specialists, everyone carefully trained to handle<br />\n(Continued from p. 1, col. 3)<br />\n%<br />\n% ' your Problems efficiently.<br />\nothers, have submitted some excel- Zepp Photo Supply Co. % in life does not depend on<br />\nBARNSTORMERS SECURE<br />\nGRAD'S ADVICE<br /><br />\nlent drawings.<br />\nIn addition to the work done by<br />\nthe production staff advice has<br />\nbeen received from Morris Bavillo,<br />\nformer Art Director of the Club<br />\nand now connected with the Beaux<br />\nArts. Isaac Hamburger, former<br />\nProduction Manager of the Club is<br />\nalso helping the building of the<br />\nsets.<br />\nThe first rehearsal after exams<br />\nwas held last Saturday afternoon. They will be held regularly on Tuesday and Thursday at<br />\n7.30 P. M., and Saturday and Sunday at 3.00 P. M.<br /><br />\n3044 Greenmount Ave.<br />\nLet Us Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br /><br />\nETHOLI<br /><br />\n\"THE WONDER MOTOR FUEL:<br /><br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n•<br />\n%<br />\n•<br />\n%<br />\n%<br />\n%<br />\n%<br />\nSS<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n!fi<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br />\n%<br /><br />\n%E9<br />\n% G. A. Myer, Mgr. %<br />\n%<br />\n%<br /><br />\nPOPULARITY<br />\nSPEAKS FOR<br />\nITSELF!!<br /><br />\n% THE GUARDIAN LIFE INSURANCE %<br />\n%<br />\n%<br />\nCOMPANY OF AMERICA<br />\n%<br />\n%<br />\n%<br /><br />\noh, gentlemen, it is a sight to<br />\nmake strong men break down and<br />\nweep like babes!<br />\nThink of our freshmen, of their<br />\nshattered illusions! Where, indeed, can they find true college<br />\nlife; where can they see men in<br />\nhigh hats and pink combinations<br />\nholding up swaying lamp-posts;<br />\nwhere can they see raccoon coats<br />\nemerging from lowly gutters; oh,<br />\nwhere, forsooth, can they find collitch ? Don't you see how we are<br />\ncheating these innocent, trusting<br />\nboys? They had ideals, they had<br />\nfaith in human nature, and then,<br />\n—they find this Kiwanian paradise, this haven for overworked<br />\nfaith healers. No cocktail shakers in the memorial room, no kegs<br />\nin the Post Office,—oh, Shades of<br />\nAristippus! Can nothing be done?<br />\nWon't you 'help me to restore<br />\nthe glory of the \"Elastic Age\"?<br />\nThe NEWS-LETTER'S suggestion to<br />\nthe Blue Jay is a step in the right<br />\ndirection. Come, join the crusade; help this bigger-better movement. Enlist the barn hounds<br />\nand the Tudor Stuart Club. Let<br />\nus stop hoodwinking the public<br />\nand our own fledglings. Let us,<br />\nindeed, have a college where men<br />\nare men. Let us out-Castor Castor. Will you do your bit?<br />\nIf this is published, I will extoll the NEWS-LETTER till I'm<br />\nblack in the face; I will arouse<br />\nThe world with my praise of this<br />\nfar-seeing, democratic, free-thinking paragon of journalism, while<br />\nif you don't I'll shout just as loudly that—that you're subsidized by<br />\nthe Y. M. C. A.<br /><br />\nRED NOSE PETE.<br />\nJan. 12, 1925.<br />\nP. S.—Help make the world<br />\nsafe for democracy!<br />\nHE APPROVES OUR EDITORIAL<br /><br />\nTo the Editor of the sews-Letter.<br />\nDear Sir:<br />\nYour editorial \"Unlimited Cuts\"<br />\nin the NEWS-LETTER of Tuesday,<br />\nFebruary 9th, is very pertinent. I<br />\nheartily approve of the stand you<br />\ntake.<br />\nThere is no doubt that you express the sentiment of the student<br />\nbody. Some recognition of the<br />\nsituation ought to be given it by<br />\nthe authorities.<br />\nVery truly,<br />\nM. C.<br /><br />\nFounded 1860<br /><br />\n•<br />\n% 423 Munsey Bldg.<br /><br />\nTHE NEWS-LETTER'S MAIL<br />\n(Continued from p. 3, col. 2)<br /><br />\n\"lucky accidents,\" or ''per- %<br />\nsonal pull.\" It depends on the %<br />\nwise selection of your work and<br />\nthe close application of the underlying principles of success.<br />\nThe Guardian Life Insurance %<br />\n%<br />\nCompany of America is one of %<br />\nthe oldest and financially strong- %<br />\nest institutions of its kind in %<br />\nAmerica today. Its representa- %<br />\ntives are rapidly taking their %<br />\nplaces of importance among the %<br />\nreally successful men of the corn- %<br />\n%<br />\nmunity in which they live.<br />\nThis institution offers the %<br />\nyoung man with a trained mind, %<br />\npleasant, well-paid work, with %<br />\nthe chances of success depend- %<br />\nent only on three factors:<br />\n%<br />\n1. Willingness to work.<br />\n%<br />\n2. Intelligent work.<br />\n%<br />\n%<br />\n3. Love of work.<br />\nfor<br />\nour<br />\n%<br />\nCall at our local office<br />\n%<br />\nbooklet, \"The Greatest Family %<br />\nin the World.\"<br />\n%<br /><br />\n%<br /><br />\nBaltimore, Md. %<br /><br />\nYou should get the benefit of our Expert Knowledge and Ability.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW &amp; FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br /><br />\nSHERWOOD BROS., INC.<br /><br />\nThe question is sometimes asked:<br />\nWhere do young men get when<br />\nthey enter a large industrial organization? Have they opportunity to<br />\nexercise creative talents, or are they<br />\nforced into narrow grooves?<br /><br />\nCC<br /><br />\nThis series of advertisements<br />\nthrows light on these questions. Each<br />\nadvertisement takes up the record of<br />\na college man who came with the<br />\nWestinghouse Company after graduation and within the past ten years.<br /><br />\nEngineer! .„<br />\nArrest that Bolt<br />\nHE Sales Department was<br />\ntalking in emphatic and easily<br />\nunderstood language. It was saying,\"We want action.\"<br />\nAt Westinghouse,action in many<br />\ncases is another word for research.<br />\nJOSEPH SLEPIAN And research works toward selected<br />\ngoals. In this case the goal was for new apparatus<br />\nto make unchained lightning more respectful of<br />\npower plants, lines and equipment.<br />\nToday, as a consequence, the electrical industry<br />\nis the beneficiary of the \"Autovalve Lightning<br />\nArrester\", perfected to a degree of efficiency, long<br />\nservice and universal utility never dreamed of before. Behind that picture you find Joseph Slepian.<br />\nWith two degrees from Harvard, he started<br />\ntraining in our East Pittsburgh Shops in 1916.<br />\nA year later he entered the Research Department.<br />\nThis was the lightning arrester situation which<br />\nSlepian took into the research camp: There were<br />\ntwo different types of apparatus. One, called the<br />\nmulti-gap, was used chiefly on poles of distribution circuits. When lightning struCk, it frequently<br /><br />\nT<br /><br />\nDRAPERIES<br /><br />\ncaused transformer troubles and damaged equipment. For high-voltage application there was<br />\nthe cumbersome electrolytic arrester. Its performance was good enough. But it required constant attention; was costly of upkeep; and could<br />\nnot be used on poles.<br />\nWhen Slepian perfected the Autovalve Arrester, the demand was so great that orders could not<br />\nbe filled. It was entirely new. One type of apparatus solved the whole problem—no more<br />\ncostly care. It stands up indefinitely, whether<br />\nused on poles or on the ground—sufficient<br />\nreasons for yearly sales exceeding 52,000,000.<br />\nSuch results may depend as much on a phase of<br />\nan engineer's past training as on his immediate research. Take the radio horn which gives the natural<br />\ntone to Radiola sets. It was Slepian's mastery<br />\nof mathematics, in which he specialized at Harvard, which contributed toward that big advance<br />\nin the early days of loud-speaker popularity.<br />\nThe man with \"hidden reserves\" is constantly<br />\nfinding them called upon to \"climb peaks and cross<br />\nmountains\" in institutions like Westinghouse.<br /><br />\nWestinghouse<br /><br />\n5<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 12, 1926.<br /><br />\nYou<br /><br />\nFELLOWS<br />\nAre \"up Against<br /><br />\na Great<br />\nResponsibility\".'<br /><br />\nITHIN a short time you will be called upon to make a great decision. That<br />\ndecision is going to leave its impression on civilization for generations to come.<br />\nYou can't approach such a responsibility hastily, carelessly or flippantly and<br />\nbe true to your self.<br />\nYou can't point 'thumbs down' and continue to walk on the same thought plane with<br />\nGilman, Gildersleeve, Rowland, Rernsen and Brooks.<br />\nWe have but one excuse for addressing Hopkins undergraduates and alumni upon this<br />\nvital Hopkins problem.<br />\nWe at first approached this question with misgivings, doubts and minds circumscribed<br />\nby selfish prejudices—<br />\nWe had but slight understanding of the fundamental rightness of the advocated plans<br />\nwhich have been conceived to enlighten and serve humanity—<br />\nBut we made it our business to get the reaction of eminent<br />\nthinkers and the cold-blooded analytical opinions of the<br />\ncountry's outstanding promoters of World Progress.<br />\nWe have seen the light and sincerely believe that we may<br />\nbe helpful to you in getting down to the necessity of having<br />\nevery Hopkins undergraduate and every Hopkins Alumnus<br />\nand every Hopkins friend behind our leaders,--backing<br />\nthem to the limit in the epoch-making work of making<br />\nJohns Hopkins the best research school in the country.<br />\nRight off the bat let's agree that a great objective can<br />\nnever be attained without sacrifices.<br />\nWe believe that the men who are and have been intimately<br />\nidentified with Hopkins undergraduate life—men to whom<br />\nHopkins' college spirit has been an all powerful influence<br />\nwill be called upon to bear their share of the sacrifices.<br />\nWe well understand what it means to think of Hopkins<br />\nwithout a Freshman class—without a Sophomore class.<br />\nWe know what it has meant during that first year to learn<br />\nhow to be sweetly humble and during that second year to<br />\nteach humility to others.<br />\nWe know the thrill that comes only in a \"class rush\"—in<br />\na Freshman-Sophomore football game.<br />\nWe know the joys of hazing and being hazed; of breaking<br />\nup a class banquet and the chagrin of having one broken up.<br />\nWe know the taste of victory and the pangs of defeat in<br />\ncompetition with our rivals on the field.<br />\nYes, we know because we have been part of it. We lived<br />\nit for two solid years before we realized that there was<br />\nreal work to do and that we must be \"up and doing.\"<br /><br />\nBut there is no such purpose in mind.<br />\nMen entering Hopkins will come with varied backgrounds,<br />\npresenting the best that each has to offer from which will<br />\ndevelop a more comprehensive, a more influential, a more<br />\nconstructive University spirit and \"Esprit de Corps\"<br />\nthan ever before.<br />\nThis would not have been so in years gone by.<br />\nA student formerly went into research largely to fit himself<br />\nto teach others.<br />\nIt was not unusual to find him the proverbial grind.<br />\nBut not so today.<br />\nWorld activities and problems are calling for scholars—<br />\nmen who know. But to know is not sufficient. One must<br />\nknow and know how to discover and to apply their discoveries in solving the problems of a cold-blooded, practical \"survival of the fittest World.\"<br />\nThat's the type you are going to see at Hopkins in the new<br />\nera.<br />\nThat's the type which will evolve a spirit at Hopkins destined to be the pattern for the University World.<br />\nYou are face to face with your great responsibility<br />\ngreat opportunity.<br /><br />\nyour<br /><br />\nGet on the band wagon and get on quick.<br />\nDon't stand on the side-lines.<br />\nDon't get run over.<br />\nDon't just hang on.<br />\nGet right up in the driver's seat—<br /><br />\nIf the Hopkins men of tomorrow were to be denied acquaintance with Freshman-Sophomore life, then in our opinions<br />\nthese men would be handicapped in starting on their way<br />\ntowards their bigger work.<br /><br />\nCrack the whip and let the world know that you and your<br />\nside-kicks are out to clear the way for the great procession<br />\nthat is to follow.<br /><br />\n(MORE NEXT ISSUE)<br />\nSigned<br /><br />\nWm. D. LILLY, J. H. U., Class '96<br /><br />\nSYDNEY M. CONE, M. D., J. H• U., A. B., '90<br /><br />\nDUSHANE PENNIMAN, J. H. U., A. B., '14<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER,FEBRUARY 12, 1926.<br /><br />\n6<br /><br />\nLACROSSE TEAM UNKNOWN RIFLE TEAM STARTS ON DR. WHITEHEAD PRESENTS<br />\nIMPORTANT PAPER<br />\nQUANTITY DUE TO LOSS<br />\nFIRST I. R. A. RIFLE<br />\nIN NEW YORK<br />\nOF FORMER STARS<br />\nMATCH THIS WEEK ,<br />\nPractice To Begin Early in March Western Maryland First on National<br />\nUnder. Leadership of Captain<br />\nSchedule to Decide Nation's<br />\nLevy and Veterans<br />\nChampion by March 20<br /><br />\nIs Result of Extensive Review of<br />\nLiterature On Dielectric<br />\nAbsorption<br /><br />\nAn important scientific paper<br />\nEarly in the month of March<br />\nAfter suffering only one defeat<br />\npresented at the Midwinter<br />\nwas<br />\nthe lacrosse enthusiasts will haul during the 1925-26 season the rifle<br />\nout the old crosse and roll out the team is firing its first Inter-Col- Convention of the American Inrubber pellet on to the fresh green legiate Rifle Association match stitute of Electrical Engineers by<br />\nturf of the budding spring season. this week against the University 1)1.. J. B. Whitehead, Dean of the<br />\nThe team, although there are of Western Maryland. This con- Engineering Faculty. Dr. W.. B.<br />\nmany good veterans eligible for test is the first of a series that Kunwenhoven, Chairman of the<br />\nthe coiling season, will feel the will continue until the week of local section of the Institute,<br />\nloss of Turnbull, Cone, Bates, Dra- March 20. At this time the cham- also attended the convention.<br />\nper, Kaufholz, and Almy. The pion of the Appalachian League, Eight sessions were held in<br />\nravages of the black list have not comprising Johns Hopkins and six New York City by the society bebeen particularly harrowing and other universitieswill be selected. tween February S and 11, during<br />\nmost of the veterans will be ready The winning team of that section which time thirty-five separate<br />\nto romp out on the green when will then engage in a shoulder-to- papers were read. A dinner dance<br />\nthe manager issues, after a fash- shoulder match with the leaders and inspection trips were also on<br />\nthe program of events. The meetion, the annual call to arms.<br />\nof other sections, in order to deterings took place -in the EngineerManagers Kidd and Keyes have mine the champion of the East,<br />\ning Societies Building of New<br />\nbeen looking into equipment all and ultimately the champion of the York City.<br />\nduring the bleak months of the United States.<br />\nThe paper which Dr. Whitehead<br />\nwinter. New sticks, gloves and<br />\nread this week is of particuBlue Jays Strong<br />\nlar interest as the second report<br />\nother paraphernalia will be ready<br />\nAlthough the Black and Blue<br />\nof the Committee on Electrical<br />\nfor those who show a brand of marksmen<br />\nare not confident of de- Insulation of the Division of Enability worthy of these outward feating all the Universities<br />\nof the gineering and Industrial Research<br />\nsigns of proficiency. Old equip- country,<br />\nthey are practically cer- of the National Research COuncil.<br />\nment will be in complete readiness<br />\ntain of leading the Appalachian It presented the results of an exfor the novices and others who<br />\nLeague. Their strongest oppon- tensive review of the literature on<br />\nare less fortunate in the sport.<br />\ndielectric absorption and theories<br />\nent will probably be Pennsyldielectric behavior, and closed<br />\nConditioning<br />\nvania State College, which was of<br />\nwith<br />\na brief summary and review<br />\nIn the short interval before prac- defeated earlier in the<br />\nseason by<br />\ntice is actually begun, the teams forty-one points. The only other of the subject.<br />\nDielectrics Little Studied<br />\nand the aspirants will, according possible source of trouble might<br />\n-Little,<br />\nif any, attempt has been<br />\nto a few of the candidates, spend be met in the University of West<br />\nDr. Whitehead in the<br />\nsaid<br />\nmade,\"<br />\nits time getting in condition for Virginia, which was beaten<br />\nby 186 introduction to his report, -to conthe stiff games in the offing. St. points. Both of these victories<br />\nJohns should be snowed under were gained with fifteen men trol the inherent characteristics of<br />\nwithout exertion, when the game firing, while the ten highest scores simple dielectrics, or to study their<br />\ninfluence in combinations.<br />\nis staged on Homewood field April counted.<br />\n\"Physicists appear to have all<br />\n3. But unless the week following<br />\nIn the telegraphic matches of<br />\nforgotten the unsolved probbut<br />\nis to tell an entirely different story the week ending January 23, the<br />\nlems<br />\nof dielectric behavior, or perthe Jays will have to use every list of conquests was increased by<br />\nto have given them up. The<br />\nhaps<br />\nmeans of turning the tide of battle the defeat of the Virginia Military<br />\ncontrol<br />\nof manufactured insulato a Hopkins victory. Oxford- Institute and the University of<br />\nCambridge will be here April 10. Porto Rico. The former was beat- tion appears to be limited to heat<br />\nAnd following this. will come en by a score of 1892-1818, and treatment, principally for the purArmy, Onondaga, Swarthmore and the latter by 1892-1804. Thus, pose of elimination of moisture—a<br />\npossibly Toronto. Toronto, how- the long record of victories is mar- sulliciently important object—and<br />\never, will be up to the team and red only by the nine point defeat to the obtaining of raw materials.<br />\nthe June Week Committee. If the at the hands of the Virginia Poly- \"Studies of the properties of<br />\nthese materials in their bearing on<br />\nteam wants to play the Canadians technic Institute.<br />\nthose<br />\nof the composite final form<br />\nand the Committee will take the<br />\nHeavy<br />\nof<br />\nSchedule'<br />\nthe<br />\ninsulation have not appearresponsibility, the athletic office<br />\nA<br />\nglance<br />\nat<br />\nthe<br />\nfollowing<br />\nscheded<br />\nin<br />\nany<br />\nquantity.<br />\nwill arrange the contest. The<br />\nule of matches for the<br />\n.<br />\nrest<br />\nof<br />\nthe<br />\n-The<br />\nliterature<br />\ndescribing work<br />\nschedule will close officially the<br />\nseason<br />\nshows<br />\nthat<br />\nmany<br />\npowerful<br />\nalready<br />\ndone<br />\non<br />\ndielectrics,<br />\nfrom<br />\nweek before exams.<br />\nteams are to be met. The I. R. the points of view of both theory<br />\nA. and shoulder matches are likely .and practice, is enormous in volto be easy victories, but the tele- ume. Many important data are<br />\nPlay Shop Holds<br />\ngraphic matches will cause many hidden in this mass, as well as<br />\nDance Tonight close contests. University of much careful and competent theoWashington has been rated among retical analysis.\"<br />\nA Valentine dance will be given<br />\nthe<br />\nfirst three teams in the counby the Homewood Play Shop to<br />\nConclusion<br />\ntry<br />\nfor<br />\nthe last four years. There<br />\nnight in the Play Shop theater.<br />\nThe report then went on to<br />\nThe admission will be one dollar a is also Northwestern University make a comprehensive review of<br />\nand University of Illinois, who<br />\ncouple.<br />\nthis literature and drew from the<br />\nAnnouncement is also made that are always the leading contestants review conclusions as to the most<br />\nthe Play Shop is busily working for the Western Conference Cham- promising directions for future<br />\non its next play, \"Charles, The pionship. The schedule is as work.<br />\nSecond\" written by Washington follows:<br />\nAt the end of the report, Dr.<br />\n13,—<br />\nIrving and John Howard Payne. February<br />\nWhitehead<br />\nhad this to say about<br />\nW. Md. (I. R. A.).<br />\nU. .of Tennessee.<br />\nthe application of this branch of<br />\nThis play is selected as typical of<br />\nU. of Kansas.<br />\nthe Restoration drama, and is exresearch work:<br />\nU. of Washington.<br />\nFebruary 20,—<br />\nOn the practical side, speaking<br />\npected to excite much interest<br />\nPenn State (I. R. A.)<br />\ngenerally, absorption is a conducNorthwestern U.<br />\nU. of Nebraska.<br />\ntion phenomenon, and therefore<br />\nFebruary 27,—<br />\nin<br />\nall cases of varying applied elecR.<br />\nA.)<br />\n(I.<br />\nVirginia<br />\nWest<br />\nof<br />\nU.<br />\nWe Believe We<br /><br />\nHave<br />\nFound Something<br />\nWorthwhile<br />\n•<br /><br />\nWatch This Space<br />\nNEXT TUESDAY<br /><br />\nColumbia U.<br />\nGeorgetown U. (Shoulder).<br />\nPrinceton U.<br />\nMarch 6,—<br />\nCarnegie Tech (I. R. A.).<br />\nU. of Illinois.<br />\nU. of Maryland (Shoulder).<br />\nMarch 13,—<br />\nU. of Pittsburgh (I. R. A.).<br />\nU. of Buffalo.<br />\nBoston U.<br />\nMarch 20,—<br />\nGettysburg (I. R. A.).<br />\nU. of California.<br />\nMarch 27,—<br />\nN. Carolina State.<br />\nU. of Delaware.<br />\nIowa State.<br /><br />\n(Continued on p. 2, col. 4)<br /><br />\nJleet rsijiatr°4-)<br /><br />\n)Irs<br /><br />\nlila<br /><br />\nwe<br /><br />\nan<br />\nact<br />\ntioi<br />\nStudent Presidents and Stewards come and<br />\ngo but she's the one who runs \"the house\"<br />\nwith particular attention to the table.<br />\nShe's pledged more freshmen than the<br />\nOldest Living Grad and saved more money<br />\nthan the Treasurer by pinning her faith<br />\nand reputation to<br /><br />\nShredded<br />\nWheat<br />\nar'round<br />\nHot or Cold -A11 year<br />\nas a food to build keen brains and sound<br />\nbodies for her boys (or girls as the case<br />\nmay be). Shredded Wheat combines all<br />\nthe elements you need for perfect nutrition, balanced to provide the ideal combination of salts, bran vitamins and iron to<br />\nbuild good brain, blood and bone.<br />\nMeet Mrs. Matron and make your next<br />\n7.30 breakfast out of Shredded Wheat.<br /><br />\nSATURDAY NIGHT<br />\n9 P.M.<br /><br />\nfoodfor thought-andexercise<br />\n.0.0.04moopo.ame&lt;0...mogm.oemmadmisoamodalweinwom.oemboano40<br /><br />\nHo]<br /><br />\n3<br />\nsix<br /><br />\npal<br />\nwa<br />\nWa<br /><br />\n• at<br />\nthe<br />\nflub<br /><br />\nlieu<br /><br />\nfor<br /><br />\nWe:<br /><br />\nfril<br />\nthc<br /><br />\ntic<br />\nIt a<br />\nwi<br /><br />\ntii<br />\nsp<br />\ntic<br />\n811<br /><br />\nPhi<br />\nth<br /><br />\n111111111W<br /><br />\n6-62..)ise heads wear Stetson hats<br />\nthey look well and last long.<br />\nDo you wear a Stetson?<br /><br />\nSTETSON HATS<br />\nStyled for young men<br />\nit,mmmormawoimpo.......ammosmsommiroimmo•MIDoomm0<br /><br />\nC. E. HALL—$1.00 A COUPLE<br /><br />\nby<br />\ncor<br />\ntall<br /><br />\nas<br />\nof<br /><br />\nCOTILLION CLUB<br /><br />\nDANCE<br /><br />\nVO<br /><br />"}], "field_media_file": [{"target_id": 38019, "display": null, "description": null, "target_type": "file", "target_uuid": "e8cb8f16-98b4-4ad3-a77a-50544c02f73d", "url": "http://digital.library.jhu.edu/system/files/2022-03/13199-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13199, "target_type": "node", "target_uuid": "ab7e6a75-e920-470b-9acb-0f57eec2a841", "url": "/node/13199"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4da9ca08-e5ad-4a4e-a1c3-9f44c8e49f3c"}]}