{"mid": [{"value": 36559}], "uuid": [{"value": "63cb0dac-bb54-475c-b678-d19583c185ff"}], "vid": [{"value": 36559}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:49:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12914-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:49:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:49:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "[r<br />\nr<br />\nVOL. XXIV, NO. 20.<br />\n<br />\nBALTIMORE, MD., MARCH 16, 1920.<br />\n<br />\nPRICE, FIVE CENTS<br />\n<br />\nSEASON TICKET CAMPAIGN OPENS<br />\n<br />\nWIN FIRST IN OPEN EVENTS<br />\n<br />\nHOPKINS LOSES STATE TITLE<br />\n<br />\n\"YOU\" SUBJECT OF LECTURE<br />\n<br />\nForty Student Teams in Charge of Selling Tickets — Tickets Admit to<br />\nThirteen Games -Students Get<br />\nCommission on Cards of<br />\nAdmission.<br />\n<br />\nFourth In South Atlantic. at Catholic<br />\nUniversity Meet — Team Makes<br />\nBetter Showing Than at<br />\nthe Armory.<br />\n<br />\nBasketeers Go Down Before Mount St.<br />\nMary's in State Title Match— Too<br />\nMuch Individual Work Again<br />\nCause of Defeat.<br />\n<br />\nDr. J. Sherwood Eddy, Former Y. M. C.<br />\nA. Traveling Secretary, and Now a<br />\nRepresentative of the InterChurch Movement,Addresses<br />\nSecond Student Body.<br />\n<br />\nThe Johns Hopkins basket-ball<br />\nIn spite of the fact that GeorgeThe Hopkins Athletic Associa- town was the chief point winner team went down to defeat to a<br />\nThe second of the series of four<br />\ntion opened its Season Ticket cam- in the Catholic University meet on<br />\nscore of 34 to 13 before Mt. St. lectures, arranged for the underpaign on Monday, and expects to Saturday night, Hopkins made a<br />\ngraduate department of Hopkins<br />\ncomplete all the soliciting by the much better showing than she did Mary's men last Thursday, in the was given last Wednesday at 10.30<br />\nend of the week. Mr. Theodore on her native heath two weeks state title match. Although Hop- A. M. in the Civil Engineering<br />\nKistler is in charge of the cam- ago. Hopkins made a better show- kins displayed the same form they Hall by Dr. J. Sherwood Eddy.<br />\npaign, and he has assisting him 40 ing in the open events than in the used against Princeton at the All classes were suspended at this<br />\nmen who act as captains of 40 South Atlantics, getting 12 points start,<br />\nthe ability of their oppo- hour, so that every student might<br />\nbe able to hear this important and<br />\nteams. These men, in turn, have for second place against 22 for<br />\neach chosen from the college regis- Georgetown, who topped the list. nents seemed to take the punch interesting talk entitled \"You.\"<br />\nter 15 other men who complete In the South Atlantics, George- out of their attack.<br />\nDr. French, in introducing the<br />\ntheir teams. In this way, 600 stu- town again led with 29 points,<br />\nThe Mt. St. Mary's team, which speaker, told of his work both bedents, the large majority of the while Hopkins came fourth with has had the experience of 16 fore and during the war as travelenrollment, have been drafted into 71/<br />\n2, being defeated also by Vir- games, 14 of which are to her cred- ing secretary of the Y. M. C. A.,<br />\nthe service of their college.<br />\nit, played with easy confidence. and still later as a representative<br />\nginia and Catholic University.<br />\nThe members of every team has<br />\nThe work of Captain Bartels Each man showed a familiarity of the recently formed interbeen asked to be responsible for was especially good, ashe took first with his position in the attack to Church Movement.<br />\nthe distribution of at least 10 cir- place in both the open mile and such an extent that the playing<br />\nDr. Eddy is a very brilliant<br />\nculars, which explain the uses, ad- half mile without much trouble. was mostly of their own making. speaker, and the attention of his<br />\nvantages and cost of the season Joe Thompson also did very crediHopkins, on the other hand, lost large audience never strayed durtickets. Thirty thousand of these table work, taking second place in most of its concentrated plays on ing the entire hour. He has just<br />\nPamphlets have been printed, and the South Atlantic 440, third in account of too much individual returned from a trip around the<br />\nso everyone interested in the cam- the 50-yard hurdles, and third in work. Many long shots were made world, spending considerable time<br />\npaign will be kept busy all the the Invitation 50-yard dash. at times when more steady players in China, India and the Near East.<br />\nweek folding, clipping and mailing Hazletine, Wood,Norwood and Ed- would have used passing to lessen Dr. Eddy drew most vivid pictures<br />\nthem.<br />\nwards also scored for the Varsity. the distance to the basket, before of the hardships and sufferings<br />\nThe season tiekets sell for $5 The showing of Hazletine and the shot was made.<br />\nwhich the Armenians have eneach, representing a saving of \"Bill\" Norwood was especially<br />\nBoyle and Gallagher did most of dured at the hands of the Turks.<br />\n$4.75 over the amount paid by per- good, the first mentioned getting the star work for Mt. St. Mary's, Endured, he said, but this endursons coming to the games on the third place in the open mile, and each registering four goals. Chap- ance cannot last forever. Only<br />\nordinary general admission of 75 the latter taking an easy second man, however, proved to be the yesterday a cablegram was recents per game. The1s:3 will be in the South Atlantic two mile, largest point scorer with three ceived saying the Turks wereagain<br />\ncontests at Homewood on 10 Sat- Gantt, the Virginia cross-country goals and ten fouls.<br />\non the warpath and unless Amerurdays and 3 week days during man, leading him across the line<br />\nBest action on the Hopkins ica intervenes, they will accomthe spring season. This, however, after a nip and tuck battle for a quint was displayed by Weiner plish their purpose of the comrepresents more than 13 games, mile and a half. Thompson ran and Woad. The former made two plete extermination of the Arsince baseball and lacrosse games a beautiful race in the South At- goals, taking a leading part in the menian race. He went on to show<br />\nare often played the same after- lantic 440 against LeGendre and attack, while \"Bill\" Wood showed how the European nation, so<br />\nnoon, thus affording the spectator Griffith of Georgetown, two of the some clever work at the defense.<br />\nweakened and exhausted by the<br />\ncontinuous amusement from 2 un- fastest in the country. Thompson<br />\nAt the opening of the game, late war, and already so burdened<br />\ntil almost 6 o'clock.<br />\nstumbled on one of the steeply \"Hopkins was the first to score, with policing large areas, are powThe games to take place at banked curves in his second lap, from the foul line. In the next erless to aid this oppressed counHomewood will be advertised be- but saved himself from a nasty few minutes the Mt. St. Mary's try. It is up to us. We alone can<br />\nforehand by large signs on Uni- fall. At the time he was running men uncorked some clever plays, save them, and by so doing we will<br />\nversity Parkway, and probably at second to Griffith. From then un- which rather dazed the visitors. prove to the doubting world that<br />\nCharles street and Lafayette ave- til the last 50 yards he was led The temporary paralysis of team our aims in the great war were<br />\nnue. Likewise, on the mornings by both of the Blue and Gray men, work was quickly taken advantage truly righteous and unselfish.<br />\nof the contests, \"Lefty\" Shields but on the last turn, Griffith, who of, and several goals were made,<br />\nThe speaker told of the work of<br />\nwill parade around the downtown seemed pretty well played out, fell making the score 19 to 6, at the the Y. M. C. A. in India. He told<br />\nsection of the city, dressed in a and LeGendre stumbled over him, end of the first period.<br />\nhow the Y. M. C. A. is making<br />\nlacrosse or baseball suit and car- recovering just before Thompson<br />\nWhen the whistle blew for the leaders of men out of low-caste<br />\nrying his well-known \"sandwich got to him. Joe would then have second half, Hopkins went on the Indians—a thing which half a cenboards.\"<br />\nwon the race had not the George- floor with their fighting spirit on tury ago would have been deemed<br />\nIn addition to the circulars sent town man shown an unwonted edge, but the opponents showed impossible. India today is going<br />\nout by the different members of familiarity with the use of his el- them that cofisistent playing and through a great crisis, just as all<br />\nthe<br />\nothers will be forwardheadwork, as well as spirit, were the countries of Europe and Asia<br />\n(Continued on page 8, col. 3)<br />\ned for<br />\ndistribution to the Varsity<br />\nteams,<br />\nthe essential qualities in a win- are. It is in a turmoil. Strikes<br />\nClub and alumnus. Graduates of them from the sale of the tickets. ning teem. Seven points were reg- and unrest exist everywhere. Inthe Baltimore Prep Schools will Thus, if a man sells 10 tickets, he lstered during the half for the dia, he said, is demanding \"Home<br />\nalso obtain lists of the students at wil make $5 for himself. The goal Black and Blue, while 15 went to Rule on the installment plan.\" He<br />\nthose schools and send circulars set by Mr. Kistler is to sell $6,000 Mt. St. Mary's.<br />\nreceives daily from his associates<br />\nto their parents, in the effort to worth of tickets, in which the stuover there, pleas for men. Men<br />\nThe line-up:<br />\ninterest them in the University, dents will profit to the sum of Mt. St. Mary's.<br />\nPos.<br />\n1. H. U. for teaching, for educating, for<br />\nBoyle<br />\nso that they will send their sons $600.<br />\nWeiner<br />\nguiding and particularly men for<br />\nGallagher<br />\nScheurich<br />\nto Hopkins.<br />\nTickets, circulars and any in- Dowd.<br />\nleadership.<br />\nC<br />\nKennady<br />\n.W.Wood<br />\nOf particular interest to the formation concerning We cam- Chapman<br />\nChina, too, is having her own<br />\nHart<br />\nE Wood<br />\nGoals—Boyle (4), Gallagher (4), Chapman<br />\ncampaign workers should be the paign may be obtained at any<br />\ntroubles.<br />\nThis vast nation, comz<br />\n(3), Dowd, Hart, Weiner (4), Kennady (1).<br />\nfact that they will be given 10 per time from the Athletic Office in Fouls—Chapman<br />\nprising one-fourth of the popula(10), Weiner (3). Referee—<br />\nLeathers, Gettysburg. Time of Halves-20<br />\ncent of the money collected by the Barn.<br />\nminutes.<br />\n(('ontinued on pace 4, col. 2)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br />\n<br />\n2<br />\n<br />\nNEW CONSTITUTION ACCEPTED<br />\nGeneral Athletic Association Passes It<br />\nUnanimously—Two Admendments<br />\nLikely To Be Made.<br />\n<br />\nIffrrbrrirk<br />\n<br />\nKipp<br />\n<br />\nIII<br />\n<br />\nI ii<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nHIGH GRADE CHOCOLATES.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nCI Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br />\n<br />\nJohn C. Knipp & Sons<br />\nDRAPERIES<br />\n<br />\nDECORATIONS<br />\n<br />\nFURNITURE<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nATTENTION! J. H. U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br />\n<br />\nPUBLISHERS<br />\n<br />\nPRINTERS<br />\n<br />\nMEWALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0-12 N. HOWARD STREET<br />\n<br />\nBALTIMORE<br />\n<br />\nNearly 400 students of the University. of Nebraska have recently<br />\nreturned to their studies after<br />\nworking in the mines of Nebraska<br />\nand neighboring states to help relieve tliv_ coal famine. Support<br />\nwas pledged to the government at<br />\na inass-me.oting, and resolutions<br />\nwere adopted, condemning those<br />\nresponsible for conditions as they<br />\nwere at the time- of greatest need.<br />\nThree co-eds helped with the cooking for the men while they were at<br />\nwork in the coal fields.<br />\n<br />\n11<br />\n<br />\n11<br />\n1111 1111<br />\n::;11<br />\n;11111<br />\n<br />\n11111<br />\n<br />\n-4,<br />\n<br />\n1111<br />\n<br />\nThe IICW constitution -drawn up.<br />\nby the Athletic Board and read at<br />\nthe mass-meeting of the preceding<br />\nweek was unanimously passed by<br />\nthe student body last Thursday.<br />\nCopies of the new constitution will<br />\nbe printed and distributed among<br />\nthe students.<br />\nSeveral proposed amendments<br />\nwere discussed before the constitution was accepted, but President<br />\nHoffman of the Athletic Board<br />\npointed out that a constitution<br />\ncould not be amended until it took<br />\neffect. General disapproval of that<br />\nsection Mach gives the Athletic<br />\nBoard the right to reject a captain elected by the team was expressed. It was pointed out that<br />\nthe players, rather than the student body represented through the<br />\nAthletic Board, would undoubtedly be the best judges of the qualifications for athletic leaders. A<br />\nDiotiOn to annul this clause failed<br />\nto receive the necessary unanimous passage by two votes. The<br />\nsnbject will be brought up again<br />\nat a future meeting.<br />\nThe other section found objectionable related to the election of<br />\nmanagers of teams. The constitution, as written, states that men<br />\nheed not have been assistant managers to be chosen managers. At<br />\nler some discussion, this matter<br />\nwas also postponed until the next<br />\nmeeting.<br />\n•Last Thursday's gathering was<br />\ndistinguished from the usual massmeeting by the presence of a trio<br />\nof the Hopkins orchestra. Vanneman on the drum, Baughman on<br />\nthe piano, and Rankin on the violin, performed to the great delight<br />\nof everyone present—and that future mass-meetings would be much<br />\nmore satisfactory with such music<br />\nincluded in their programs was<br />\nthe concensus of opinion.<br />\n<br />\n'1111\"i<br />\n<br />\nI<br />\n.\"..„:1111111111111111111111111111:.<br />\n<br />\nWm. DEMUTH 8t CO.. NEW<br />\nMAKERS<br />\n<br />\nOF<br />\n<br />\nYORK<br />\n<br />\nFINE<br />\n<br />\nPIPES<br />\n<br />\n1_11111111111111111111111111111111111111111111111111111<br />\n<br />\nI<br />\n<br />\nLARGEST<br />\n<br />\nI.—American Journal of Mathematics.<br />\nF, MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLII in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nII.—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors: Quarterly. 8vo.<br />\nVolume XLI in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVIII<br />\n$3.50 per volume.<br />\n<br />\nin progress.<br />\n<br />\nIV.—Johns Hopkins University Circular<br />\n.Including Annual Report. Register,<br />\netc. 8vo. Volume XXXIX in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXXI in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br />\n<br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br />\n<br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\n. Semitic Philology.<br />\n(Beitrage zur Assyriologie. etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br />\n<br />\nVIII.—Modern Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRUENBAUM, W, KURRELMEYER and H, C. LANCASTER.<br />\nmonthly. 4to. Volume XXXV in<br />\nprogress. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\n<br />\nIX.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Attnos- pheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXV in progress. $3<br />\nper volume. (Foreign postage 25 cts.)<br />\nXi.—Reprint of Economic Tracts..<br />\n- J. H. HOLLANDER, Editor. Fourth<br />\nSeries in progress, $2.<br />\nXII.—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMBS W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nX111.—Elliott Monograph in the Romance<br />\nLanguages and Literatures.<br />\n.. EDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. • Reports of the Maryland Geological Survey.<br />\nE. B. MATHEWS, Editor.<br />\n<br />\n''''''''<br />\n<br />\nF you would know real smoke contentment, just you smoke<br />\na WDC Pipe full of your favorite tobacco. Then you'll<br />\nknow what a real French briar is, and what the Demuth<br />\nseasoning will do to make it break in sweet and mellow.<br />\nAsk any good dealer to show you a variety of shapes, then<br />\npick yours.<br />\n<br />\nWORLD'S<br />\n<br />\nJohns Hopkins Press<br />\n<br />\nThe co-eds of the University of<br />\nCincinnati have a Man-haters'<br />\nClub. Two girls were recently requested to resign on the ground<br />\nthat they had not lived up to, the<br />\nideals of the organization. After<br />\nthe business of the club had be])<br />\ntransacted, an interesting paper<br />\non \"Why We Hate Men Until We<br />\nHave A Date,\" was read by one of<br />\nthe members.<br />\n<br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of publications will be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br />\n<br />\n3<br />\n<br />\nYOUNG MAN<br />\n,<br />\nk<br />\ncsAS:.:<br />\n<br />\nYour Suit or Overcoat<br />\nwill have those smart dapper kinks if<br />\nit comes from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br />\n<br />\nPrices, $25.00 to $65.00<br />\n<br />\nSTEWART111,<br />\nfa COOIMMOR With lanes Itrer•err<br />\n<br />\nCe..Nris<br />\n<br />\nHOWARD AND LEXINGTON STS.<br />\n<br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br />\n<br />\nSo!e Agents for Baltimore for College Fraternity Bands (6reek Letter Societies).<br />\nSHIRTS<br />\n<br />\n(2e.i<br />\n<br />\nARROW COLLARS<br />\n<br />\nop, co.<br />\nOL•<br />\n<br />\nQuality<br />\n<br />\ns\"e'et<br />\n•<br />\n<br />\nI<br />\n30<br />\n<br />\nGP<br />\n<br />\ncv° Me.<br />\n1k• 1kc'\"<br />\nMerchandise<br />\nViS1` l'e°`<br />\n<br />\n... and at three historic banquets<br />\nHOSIERY<br />\n<br />\nHATS<br />\n<br />\neA fact:<br />\n'Just enough Turkish\"<br />\nFacts like these make Fatima's<br />\nplace among cigarettes unique.<br />\nA few years ago, the \"proper\"<br />\nthing on such state occasions<br />\nwould have been an expensive,<br />\nfancy -boxed, straight Turkish<br />\ncigarette.<br />\nToday, things are different.<br />\nMen base their choice on taste<br />\nrather than price. That Fatima<br />\nshould be so clearly the choice<br />\nof men who can afford anything<br />\nthey like,shows that most smokers really prefer—not too much<br />\nTurkish tobacco in their cigarettes nor too little —but \"jast<br />\nenough Turkish.\"<br />\n<br />\nSHOP<br />\nTHE HOSIERY<br />\nN. CHARLES ST.<br />\n<br />\nWithin a single week last fall, great civic<br />\ndinners were tendered at the WaldorfAstoria<br />\nto General Pershing, to Herbert Hoover and<br />\nto Cardinal Mercier. And at all three of these<br />\nfamous banquets, the only cigarette served by<br />\nthe hosts was Fatima.<br />\n<br />\n215<br />\n<br />\n,Dest Shop For<br />\nMen's Sox and Ties.<br />\n75 Cents and Up.<br />\n<br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br />\n<br />\nATIMA<br />\nA Sensible Cigarette<br />\n<br />\n106-108 CLAY ST.<br />\n<br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\npkins Seals in Silver and<br />\nGold,<br />\n<br />\nCollege Jewelry e Specially<br />\n•••••111<br />\n<br />\n28 E BALTIMORE STREET<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br />\n<br />\nTHE NEWS-LETTER'S MAILBAG<br />\nentire student body. If you have<br />\never written for any paper whatever, or if you have not, but feel A Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulthat you can express yourself in<br />\nder the Responsibility.<br />\nink, do not fail to hand in your<br />\nEntered as second-class matter De- name at once. Be you freshman<br />\ncember 3, 1909, at the Post Office at or senior, you will receive a fair<br />\nAll letters intended for publication<br />\nmust be concise.<br />\nBaltimore, Md., under Act of Congress,<br />\nbe<br />\nwill<br />\nelection<br />\ntrial, and your<br />\nNo attention will be paid to anonyNovember 3, 1879.<br />\nmous letters, but names signed as an<br />\njudged on the merits of your work.<br />\nof good faith will not be printed<br />\nevidence<br />\nPublished weekly, from October to<br />\nif request is made that they be omitted.<br />\nJune, by the students of Johns HopThe publication of a letter is not to be<br />\nThe fight is on! Will we stand<br />\nkins University.<br />\ntaken as an indorsement of its views by<br />\nbehind our teams, or will we leave<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\nBusiness communications should be them in the lurch? Spring pracinterest.<br />\naddressed to the BUSINESS MANAGER,<br />\nin<br />\nJOHNS HOPKINS UNIVERSITY; all arti- tices have already commenced<br />\ncles and other communications should all the major sports, and the cam- Suggests That Representatives be Sent<br />\nbe sent to the MANAGING EDITOR,<br />\npaign for season tickets to the<br />\nto High Schools.<br />\nHomewood 100 games has been inaugurated. The To the Editor Of THE NEWS-LETTER:<br />\nTelephcce<br />\nsquads are working every day to<br />\nSir—I should like to suggest<br />\nEditor-in-Chief.<br />\nput teams on Homewood Field that THE NEWS-LETTER be placed<br />\n• Llewellyn W. Lord, '21.<br />\nworthy of bearing the name of in the library of every high school<br />\nManaging Editor.<br />\nHopkins, and it is up to us in the state. There are only a<br />\nJohns<br />\nH: Douglas Cotton, '22.<br />\nto prove ourselves worthy of our few high school students who<br />\n•<br />\nAssociate Editors.<br />\nteams.<br />\nknow that the Johns Hopkins<br />\nWarren W. Driver, '20.<br />\nBy selling seas?n tickets we will University has an Undergraduate<br />\nEdward G. Huey,'22.<br />\nnot only help our Alma Mater, but Department, as well as a Medical<br />\nJunior Editors.<br />\nalso ourselves. Ten per cent of School. A little information, such<br />\nRichard Dallam, Jr., '22.<br />\nevery ticket we sell goes into our as THE NEWS-LETTER contains,<br />\nCharles C. Marbury, '22.<br />\nRichard M. Wood, '22.<br />\npockets. We should be willing would turn their steps our way<br />\nNorvell E. Miller, Jr., '23.<br />\nwork for our College gratis, but and give them a chance to link<br />\nto<br />\nWilliam F. Passano, '23.<br />\nwith this added inducement, there their future with our great and<br />\nBusiness Manager.<br />\nis no reason why we should not growing institution of learning.<br />\nGeorge Deichman, '21.<br />\nmore than fulfill that which is<br />\nOne of the best things that<br />\nCirculation Manager.<br />\nof us. Our families are in- could be done for the seniors in<br />\nasked<br />\nFrederick W. Lipps, '22.<br />\nterested in what we do at Home- the Maryland high schools would<br />\nAssistant Business Managers.<br />\nwood, and we should have no dif- be a talk by one of our men,<br />\nFrederick Abbott, '22.<br />\nin selling several to rela- chosen by the student body, who<br />\nficulty<br />\nLawrence K. Wagner, '22.<br />\ntives. Then, there are many other would outline our courses, our<br />\nBALTIMORE, MD., MAR. 16, 1920 fields where tickets can be sold. spirit in athletics, our student orHeretofore, the attendances at the ganizations, our location, and<br />\nIt is with sincerest regret that spring sports have been but<br />\nwould •thus give a perspective of<br />\nTHE NEWS-LETTER announces the mere handfuls, and it is up to us<br />\ncollege not to be gained in any •<br />\nthe<br />\nresignation of John H. Lewin, edi- to see that these contests are as<br />\nway. This talk would aid<br />\nother<br />\ntor-in-chief; George W. Wagner, well attended as the football<br />\nthe man who has not yet decided<br />\nTorsch,<br />\nF.<br />\nF.<br />\nbusiness manager;<br />\ngames in the fall.<br />\nwhat he will do after he gradumanaging editor; H. H. Morriss,<br />\nates. The University of PennsylCarB.<br />\ncirculation manager; M.<br />\n\"YOU\" SUBJECT OF LELTURE<br />\nvania has adopted the plan of<br />\nroll, V. J. Wyckoff, J. R. Lomausending a representative to the<br />\nro and H. E. Niles, associate edidifferent \"prep\" schools, who aids<br />\n(Continuedfrom page 1)<br />\ntors, and Mr. V. E. Stuart, assistthe seniors in fixing their scheda<br />\nbecome<br />\njust<br />\nhas<br />\nthe<br />\nglobe<br />\nof<br />\ntion<br />\nant business manager. The loss of<br />\nules for the next year at Penn.<br />\nthis capable body of writers will republic. The Chinese people can- Why could not Hopkins adopt the<br />\ninare<br />\nThey<br />\nit.<br />\nbe felt keenly in future numbers of not comprehend<br />\ntoxicated by the wine of liberty, same course in its relations with<br />\nthe paper.<br />\nthe Altiryland high schools?<br />\nMr. Lewin has piloted the paper and the feeble government is totONE WHO WOULD WAKE UP<br />\norganizers;<br />\nneed<br />\nThey<br />\ntering.<br />\nof<br />\nshoals<br />\nfrom the breakers and<br />\nTHE HIGH SCHOOLS.<br />\nthe war, (luring which the paper men of initiative and ability to<br />\nas<br />\nfeet<br />\ntheir<br />\non<br />\nthem<br />\nput<br />\nfirmly<br />\nwas seriously threatened with<br />\nFOUR RECORDS BROKEN<br />\nfailure and bankruptcy, to the the second greatest republic of the<br />\nsmooth and untroubled waters of world.<br />\n(('ontinuedfrom page 5)<br />\nDr. Eddy spoke also of the need<br />\npeace, placing it in a position of<br />\nfor first honors in the<br />\nRowlaM1<br />\nfor men of this type in America.<br />\ngreat promise for future years.<br />\nswim.<br />\n100-yard<br />\nTo Mr. Wagner, the heartfelt Compared to European countries,<br />\nThe summary:<br />\ngratitude of the entire board is we are enjoying a carnival of ex160-Yard Relay—Won by Central Young<br />\nMen's Christian Association; Baltimore Athextended, for he took the helm of travagance and luxury. The aver- letic<br />\nClub, second. Time. — minutes 22<br />\nthe managerial staff at a time age laboring man in this country seconds.<br />\nDive—R. A. Newby, Central High<br />\nFancy<br />\nwhen THE NEWS-LErrER was more receives from $3.50 to $4.00 a day, School, first; C. IL Slingluff, Baltimore Ath'second; F D. Little, Central High<br />\nClub,<br />\nletic<br />\nthan $700 in debt, the largest de- which in India, a laborer is fortu- School, third.<br />\nday.<br />\na<br />\ncents<br />\nDash—W. E.- Kanakanui, Central<br />\n3<br />\nreceives<br />\nhe<br />\n50-Yard<br />\nif<br />\nnate<br />\nficit which has ever been recorded<br />\nYoung Men's Christian Association, first; E.<br />\nin the history of the paper,Sand it There are, in our own country, J. Shell, Central Young Men's Christian Assosecond; C. Carrigan, Doyle's Athletic<br />\nis due to his unceasing toil and fifty millions of people absolutely ciation,<br />\nClub, third. Time, 26 seconds.<br />\n80-Yard Breast Stroke—D. H. Rowland, Baltrue college spirit, that THE NEWS- unconnected with any religious timore<br />\nAthletic Club, first; S. II. Wallach,<br />\nDoyles' Athletic Club, second; C. Carrigan,<br />\nLETTER can now hold up its head institutions.<br />\nthird.<br />\nHe emphasized the fact, that the second. Time (unofficial), 1 minute and 4-5<br />\nwith an asset of $200.<br />\n220-Yard Swim—C P. Coady, Baltimore AthWe are about to embark upon Y. M. C. A. does not attempt to letic<br />\nClub, first; C. G. Lutz, Central high<br />\nSchool, second; T. II. G. 13ailliere, Central<br />\nanother season, with but four ex- change a man's religious belief, it Young<br />\nMen's Christian Association, third.<br />\nperienced men remaining on the does not try to prostilize, but to Time, 2 minutes 44 4-5 seconds.<br />\nR. Howard, Marston. first; F.<br />\nboard. THE NEWS-LETTER is es- vitalize. \"Life, minus god is hell,\" II.Plunge—C.<br />\nLongfellow, Central Young Men's Christian<br />\nW. L. Gigson, Central<br />\nsecond;<br />\nAssociation,<br />\nuninpecially fortunate in having such he said, \"and the sooner the<br />\nYoung Men's Christian Association, third.<br />\nfor<br />\nbetter<br />\nthe<br />\nit,<br />\ndiscover<br />\nformed<br />\nto<br />\neditors<br />\n28 1-5 seconds<br />\njunior<br />\nTime,<br />\nfeet.<br />\nDistance, 60<br />\nan able group of<br />\n80-Yard Back Stroke—G. E. Dickey, Cencall upon, but these men are as yet all mankind.\"<br />\nC. Hall, Baltimore<br />\nR.<br />\nfirst;<br />\ntral Iligh School,<br />\nF. A. Wessells, Central<br />\nIn closing, Dr. Eddy asked all Athletic Club, second;<br />\ninexperienced, and there is a great<br />\nthird.<br />\nAssociation,<br />\nChristian<br />\nYoung Men's<br />\nneed for new candidates, of which those interested and desiring to Time, 57 seconds.<br />\nCentral<br />\nE.<br />\nKanakanui,<br />\nSwim—W.<br />\n100-Yard<br />\nthere should be a large number in help in this great cause to see him Young Men's Christian Association, first; HenBaltimore Athletic Club, second;<br />\nimmediately, for he expects to ry Rowland,<br />\na university of this size.<br />\nF. J. Shell, Central Young Men's Christian<br />\nEurope.<br />\nto<br />\nTime, 1 minute 3-5 second.<br />\nreturn<br />\nshortly<br />\nthird.<br />\nAssociation,<br />\nWe need the co-operation of the<br />\n<br />\nDechilllsjilli01810101<br />\n$2.00<br />\n<br />\n•<br />\n<br />\nQUACKS FROM A QUACK<br />\n<br />\nI<br />\n<br />\n\"In the spring, a young man's<br />\nfancy lightly turns to thoughts of<br />\nlove.\" So says ye om proverb and<br />\nrightly. Spring time is upon us;<br />\nyea, even it is here, and by the<br />\nsame token I have seen strange<br />\nand wonderful sights which go to<br />\nshow that the young men at Hopkins are permitting themselves to<br />\nrun true to form. Of course, Ferdie Meyers has set the example by<br />\nthreatening marriage. That, I<br />\nthink, is carrying the custom of<br />\n\"obeying that impulse\" a wee bit<br />\nfar, I don't believe that aforesaid<br />\nold proverb intended Ferdie to do<br />\nanything quite so desperate.<br />\nBut the signs of the times are<br />\nbreaking out in milder forms here<br />\nand there. For instance, have you<br />\ntaken careful note of that pearl<br />\ngray creation which Vertrees<br />\nWyckoff proudly calls a hat? It<br />\nis truly a masterpiece of the art,<br />\none in a million, but even so, no<br />\nself-respecting male being would<br />\nvoluntarily of his own accord condescend to purchase such an article, much less to wear it. By<br />\nmy beard, he is under the spell of<br />\na fair maiden, as Kipling used to<br />\nsay (I believe it was Kipling),<br />\n\"look for the woman in the case.\"<br />\nBut this strange and peculiar<br />\ndisease affects both young and old.<br />\nIt plays no favorites, none are immune. They tell me that when<br />\n\"Ma\" Green takes leave of a beautiful lady nowadays, it is with<br />\nwords to this effect, \"Good-bye,<br />\nmy dear, and remember that the<br />\npresent Mrs. Green is not immortal.\"<br />\nThe taller they are the harder<br />\nthey fall, and following out this<br />\nline of reasoning, let me unfold<br />\nthe queer maneuvers that the<br />\nweather has caused one young gentleman to execute. Namely, Calkins, the boy the newspaper chaps<br />\nloved to dub \"the blond young<br />\ngiant,\" a regular two-fisted caveman, you know. They tell me he<br />\nhas 'been seen flashing his superb<br />\nphysique and wicked hair cut before the more or less admiring<br />\nbrown eyes of one of the fair sex,<br />\nwho condescends to grace the Civil<br />\nEngineering Building with her<br />\ncharming presence. This hero of<br />\nmany a bloody football battle, this<br />\nfire-eater who was afraid of nothing, tells me that this same damsel<br />\nIi; s that strange faculty of making him shine the tip of his left<br />\nshoe against the cuff of his right<br />\ntronser, and be scared nearly to<br />\ndeath. Eric says that when he<br />\ngoes to call in the evening he has<br />\nthe same sinking nervous sensation in the immediate vicinity of<br />\nhis floating ribs which was formerly aroused in him when \"Doc.\"<br />\nHulbert would say, \"Now for the<br />\npr-r-roblems.\" Another good man<br />\ngone wrong.<br />\nStill there is one consolation,<br />\nonly one wild woman can get you<br />\nat once. The law firmly states<br />\nthis fact, even the Bible says,\"No<br />\nma n can serve two masters.\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br />\n<br />\n5<br />\n<br />\nTALKS ON LABOR SITUATION<br />\n<br />\nA good guess for<br />\nyou would be—<br />\n<br />\nMr. Whyte Talks Development of<br />\nLabor Situation in Second Huntingdon Williams Memorial Lecture.<br />\n<br />\nThe industrial and political<br />\nphases of British labor conditions<br />\nsince the outbreak of the recent<br />\nwar were discussed by Mr. Whyte,<br />\nformer Member of Parliament, in<br />\nthe second of his series of'lectures, Friday afternoon, in the<br />\nMr.<br />\nCivil Engineering Hall.<br />\nWhite traced the development of<br />\nthe present labor situation from<br />\nits beginning in 1914, bringing<br />\nout the logical steps by which the<br />\npresent issues were brought before<br />\nthe English public. The speaker<br />\npointed out that during the war<br />\nthese successive steps could not be<br />\nclearly discerned and understood;<br />\n—There's style<br />\nthat it is only in retrospect that<br />\neach separate action and its conto them<br />\nsequences can be pieced together<br />\ninto the train of events which has<br />\nled to the existence of the present<br />\nBritish labor problems.<br />\nIn the months preceding the<br />\nwar, England was suffering from<br />\na series of strikes or threatened<br />\nstrikes in many of her largest inBaltimore, Charles and Fayette \"<br />\ndustries. Labor unions and employers were engaged in a contest<br />\nof a nationally serious character.<br />\n— AMUSEMENTS — The outbreak of the war, however,<br />\nimmediately put an end to this<br />\ncontroversy, and unionized labor<br />\nco-operated with its employers to<br />\nbring about the necessary increase<br />\nShubert Attractions.<br />\nin output for the carrying on of<br />\nMatinees Wednesday and Saturday.<br />\nthe war.<br />\nTONIGHT AT 8.15<br />\nDuring the war, then, organArthur Hammerstein Presents<br />\nized labor was given further cause<br />\nTHE BIG JOYOUS MUSICAL<br />\nfor dissatisfaction. The great inSPREAD<br />\nflux of inexperienced workers inOf New York,Chicago & Boston Glories. to war industries met with vigorous objection from the unions, and<br />\nthe \"dilution crisis\" was brought<br />\nabout. At the conference which<br />\nWith a Cast of Musical Comedy<br />\nfollowed<br />\nthis general complaint<br />\nFavorites.<br />\non the part of the unions, a proA Parade of Tumble-In Beauties.<br />\nvision was made for a relaxation<br />\nof many of the rights of organized<br />\nNext Week—Seats Tomorrow.<br />\nlabor for the period of the war.<br />\nE. H.<br />\nJULIA<br />\nStill reater dissatisfaction on the<br />\nSOUTHERN<br />\nMARLOWE<br />\npart of unionized labor naturally<br />\nMonday, Thursday Evenings, Saturday<br />\nMatinee, \"TWELFTH NIGHT;\" Tues- followed this curtailment of its<br />\nday, Saturday Evenings, \"HAMLET;\" privileges. Consequently, English<br />\nWednesday, Friday Evenings, \"TAMING OF THE SHREW.\" $1.00 to $3.00. labor was in such a state of unrest that it seized with eagerness<br />\nthe opportunity which the RusTeacher: \"Which eat most, ani- sian Revolution gave it of asserting itself forcibly.<br />\nmals or birds?\"<br />\nThus it happened that under<br />\nIt: \"Birds, sir; because they<br />\ntake a peck at a time.\"—The Por- the influence of three great facpoise.<br />\n(Continued on page 7, col. 1)<br />\n<br />\ntirirtu<br />\nNrattb<br />\n(1I1uttiri<br />\n<br />\nHub<br />\n<br />\nAUDITORIUM<br />\n<br />\n\"TUMBLE IN\"<br />\n<br />\n—<br />\n<br />\nr IN THE YOUNG MEN'S SHOP—<br />\nThe \"Carlton\"—a new Spring Suit;<br />\nsingle-breasted, with patch pockets.<br />\nBALTIMORE'S BEST STORE<br />\n<br />\n.icthochia,./rchgide<br />\nHOWARD AND LEXINGTON<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nFOUR RECORDS BROKEN<br />\nHopkins Men Swimming For B. A. C.<br />\nWin Many Points—Dardy Rowland<br />\nBreaks Record In 80-Yard<br />\nBreast Stroke.<br />\n<br />\nLefranc & Ault<br />\n421 N. Noward St.<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br />\n<br />\nThe Point Winners<br />\n--Central Y. M. C. A.<br />\nBaltimore Athletic Club<br />\nCental High School<br />\nDoyle's Athletic Club<br />\nUniversity School<br />\n<br />\n30<br />\n25<br />\n<br />\n14<br />\n<br />\nLuncheon<br />\n<br />\nAfternoon Tea<br />\n<br />\nSODAS AND SUNDAES<br />\n<br />\nMUSIC<br />\n<br />\n5<br />\n5<br />\n<br />\nR.G.LOY & COMPANY<br />\n<br />\nFour records were broken last<br />\nSaturday night in the South At1 W. UNIVERSITY PARKWAY<br />\nlantic Association's Twelth Annual Indoor Swimming Meet at<br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br />\nthe Baltimore Athletic Club. New<br />\nmarks were set for the 160-yard Drug Store for J. H. U. Boys<br />\nrelay, 50-yard dash, 80-yard breast<br />\nPHONE HOMEWOOD 2121<br />\nstroke and 220-yard swim.<br />\nFour members of the Hopkins<br />\nteam entered the meet as repre- Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nsentatives of the Baltimore Athletic Club, and were largely instrumental in that club's winning<br />\nsecond place. The Central Young<br />\nMen's Christian Association came<br />\nout ahead with 30 points.<br />\nThe Y team won the 160-yard<br />\nMADE TO ORDER<br />\nrelay. Newby, of Central High<br />\nAND<br />\nSchool, upset the dope by defeating \"Toots\" Slingluff in the fancy<br />\nFINISHED CLOTHES<br />\ndive. The latter started well, but<br />\nmade two poor dives and was<br />\nseemingly out of his usual form.<br />\nPLAZA BUILDING<br />\nKanakanni won the 50-yard 19 AND 21 EAST FAYETTE STREET<br />\ndash in 26 seconds. Davidge Rowland set a new mark for the 80yard breast stroke, defeating both<br />\nORTMAN'S<br />\nWallach and Carrigan. Coady,<br />\nBaltimore Athletic Club, won the \"Queen Quality\" Home-Made Candies<br />\n220-yard swim from Lutz, of Cen80c. a pound<br />\ntral High, in a very close and<br />\nVISIT OUR ICE CREAM PARLORS<br />\nthrilling race.<br />\n227 N. HOWARD STREET<br />\nHoward, of<br />\nMarston's, had<br />\nlittle difficulty in winning the ARTISTIC PHOTOGRAPHS<br />\nplunge. Dickey, of Central High,<br />\nand \"Bob\" Hall, finished first and<br />\nsecond in the 80-yard back stroke,<br />\n319 North Charles Street<br />\nwhile Kanakanui nosed out Henry<br />\n<br />\nLEM M ERT<br />\n<br />\nIlgenfritz<br />\n<br />\n(Continued on page 4, col. 3)<br />\n<br />\nSPECIAL 'DISCOUNT TO J.H.U. STUDENTS<br />\n<br />\n11<br />\n<br />\nROBERT FAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br />\n<br />\nORCHESTRA DE LUXE<br />\n<br />\nCharles and Lafayette Ave.<br />\n<br />\nTHE ARCADE<br />\nTEA ROO/A<br />\n324 N. Charles St.<br />\n<br />\nMUSIC FOR DANCES, RECEPTIONS, ETC.<br />\nTELEF'HONE. GILMOR 2929<br />\n<br />\nRESIDENCE, 614 FULTON AVENUE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br />\n<br />\n6<br />\n<br />\n- (. kANyk77,7,<br />\n,<br />\n,<br />\nL'<br />\n<br />\n.41,<br />\n<br />\niN<br />\n<br />\nirsu<br />\n<br />\n.\"•A<br />\n40;<br />\n4t,ty.,4<br />\n<br />\n.1cONVIt<br />\nUfroP •<br />\n<br />\nAnd all discriminating<br />\nlovers of cigarettes love<br />\n<br />\nor.u, b<br />\n<br />\n'<br />\n1 1'114<br />\ni<br />\n<br />\n4114.11111<br />\n<br />\n-2;,41/h71,/,<br />\n<br />\nBecause Murads are pure Turkish, the world's most famous tobacco<br />\nfor cigarettes.<br />\n<br />\n%ft&<br />\n<br />\n6'1/<br />\n9);I<br />\n<br />\nAnd the Fame of Muracls grows<br />\nand grows and grows—they are 100<br />\nper cent Turkish, and they are 100<br />\nper cent popular with connoisseurs<br />\neverywhere.<br />\n<br />\nis true that \"ordinary<br />\ncigarettes cost a trifle less.<br />\nIt<br />\n<br />\nR. O. T. C.<br />\n<br />\nAn inspection of the R. 0. T. C.<br />\nunit was held last Thursday with<br />\nColonel Bull, from the headquarters of the Eastern Division as inspecting officer. After a brief inspection on the upper quadrangle,<br />\ntwo companies spent the rest of<br />\nthe drill period in practising close<br />\nand extended order, while Company A was marched out Thirtysecond street to Lake Montebello.<br />\nHere two squads, under Corporals<br />\n\"Bob\" Hall and \"Johnnie\" Dubelle, respectively, were sent out<br />\nin the same general direction, as<br />\nreconnaissance patrols, representing hostile forces. Each was to<br />\nprocure certain information; thus<br />\n<br />\nthe duty of each was to avoid combat at all costs. The patrols, however, came into contact and opened<br />\nfire on each other, the umpires<br />\nruling two men in one squad<br />\nkilled and two in the other captured. Colonel Bull and Captain<br />\nEllis viewed the maneuvers<br />\nthrough field glasses, and when<br />\nthe squads were called in, Cadet<br />\nMajor Burger gave the critique.<br />\nThe Lake Montebello region is<br />\nan excellent one in which to simulate actual campaign conditions,<br />\nand although time is necessarily<br />\nlost in marching there and back,<br />\nit is felt that much can be gained<br />\nby working under such excellent<br />\nconditions.<br />\n<br />\nContestants For Adams Medal<br />\n<br />\nThe \"Foreign Student's Directory.\"<br />\n<br />\nUpon the request of :Mr. Hammond, Dr. John C. French judged<br />\nthe would-be orators in the tryouts for the Adams contest. About<br />\n12 men came out for the preliminaries. Although most of the<br />\ncandidates spoke very well, Dr.<br />\nFrench decided that the four men<br />\nwho gave evidence of being able<br />\nto make better speeches in the<br />\nfinal contest were Hieman, Macdonald, Marbury and Williams.<br />\nThese men will show their wares<br />\non the night of the Taqueville<br />\nMedal Contest, the date of which<br />\nwill be decided upon by the Debating Council in the near future.<br />\n<br />\nThe \"Foreign Student's Directory,\" is published by the committee on Friendly Relations Among<br />\nForeign Students, 347 Madison<br />\navenue, New York City, and contains the names of over 6,000 sturents from 80 nations; the summary indicates the number of institutions attended, classified by<br />\nstates. Price 25c. For information, inquire at the Y. M. C. A.<br />\noffice.<br />\nThe Aero Clubs of Columbia,<br />\nHarvard and Yale are making<br />\nplans for a three-cornered airplane<br />\nrace next spring.<br />\n•<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 16, 1920.<br />\n<br />\nGOETZ WINS THIRD PLACE<br />\nIn Spite of Train Wreck and Thirty-four<br />\nHour Trip, Hopkins Delegate Succeeds In Carrying Off Third<br />\nHonors In Southern Oratorical League Contest.<br />\n<br />\nFACULTY NOTES<br />\n<br />\n-Why we dislike certain people<br />\nwhen we grow up.--Why getting<br />\na. baby mad is good for him.—How<br />\nDue to an unavoidable accident, a mother's cooing can make .a<br />\nthe first contest of The Southern grand opera singer and a father's<br />\nOratorical League did not prove carelessness a bully, etc.,\" is the<br />\nas successful as was hoped. A title of a full page article in the<br />\nfreight-wreck delayed the train on<br />\nWhich the Hopkins and University. magazine section of a popular New<br />\nof Virginia Delegates were; and, York paper in the issue of Sun:ts a result, the train instead. of day, March 7.<br />\n:t1TiVillg at Lexington, Ky. at 8.50<br />\nDr. John B. Watson, whose ;<br />\nA. M. Friday, March 5, reached views are quoted, was rather prothere at 10.50 P: M., • just 14 voked<br />\nto see the strange photohours late. All of the other speakgraph<br />\nthe several other illusand<br />\ners had delivered their addresses,<br />\nfind the meeting was practically trations employed in the paper.<br />\nOver, when Goetz and Lavenstein, AS a. matter of fact, Ile had never<br />\nthe Virginia representative, Were seen the photographs before. The<br />\nushered on the platform. In spite genuine illustrations which might<br />\nof the fatigue occasioned by a have been used properly over<br />\nhis<br />\ncontinuous 34-hour trip, the two name may be found in his latest<br />\nlate arrivals delivered their . ad- book,\"Psychology from the Standdresses as best they could.<br />\npoint of the Behaviorist,\" which<br />\nSmith, of University of Ken- was placed on the market last<br />\ntucky,‘ was awarded the first prize November by the J. B. Lippincott<br />\nof 8:t0 Bobbitt, of North Caro- Company. lina, received second honors with<br />\nDr. Watson Is still carrying on<br />\na prize of $20. Goetz, of Johns<br />\na therongh research on infant acHopkins, won third place with an tivities, such as grasping, the inaward. of :”0. The other univer- folded thumb, the development of<br />\nsities represented in the contest eye movement, the Babinski reflex,<br />\nWere Alabaina, Tennessee, Vander- blinking, ability to maintain<br />\nthe<br />\nbilt and Virginia.<br />\nhead, locomotion, and other early<br />\nSmith spoke on \"Shantung ;\" activities. The observations are<br />\nBobbitt's speech was entitled \"The made from \"zero\" age to more adModern Crisis in Demecracy,\" vanced age.<br />\nand Goetz's address was on \"Free<br />\nOn Thursday, February 5, he deSpeech and Radicalism.\"<br />\nlivered a lecture before the National Hygiene Association, New<br />\nTALKS ON LABOR SITUATION<br />\nYork ; on Friday, February 13,<br />\nat the . Government Hospital<br />\n(Continued from 'mg<br />\n- e 5)<br />\nfor the Insane.<br />\nOn March<br />\ntors, the dilution crisis, the relax- 23, he will lecture before . the<br />\nation crisis and the Russian Revo- Teacher's College at Columbia<br />\nlution, British labor became pre- University. At a. future date,<br />\npared to combat the situation .Dr. Watson will lecture also<br />\nmore energetically than ever be- before the 'Women's Climb of Rofore. With the signing of the ar- land Park.. He uses his private<br />\nmistice, then, organized labor be- .motion-picture film to illustrate<br />\ngan to make good its threats of this lecture on \"Studies in Infant<br />\na general strike. During the past Psychology.\"<br />\n•<br />\n14 months, two extremely importProfessor Edward W. Berry<br />\nant national conferences between gave a lecture on \"The Structure<br />\nlabor and employers have been and- Age of the Andes,\" before the<br />\nheld, and in each ease, labor was „American Philosophical -Society of<br />\nprevailed upon to defer its plans Philadelphia on March - 5, and anfor direct action. Last fall, how- other on \"South American Experiever, a general railroad strike was ences and Impressions\" at Princecalled and could not be prevented ton \"niversity on March 8. He<br />\nby even the strenuous efforts of recent ly lectured before the Johns<br />\nthe delegates to the national con- Hopkins Field Club on \"Paleonference.<br />\ntology.\" Professor Berry has a<br />\nAt the present, according to Mr. most amusing. collection of anecWhyte, a saner view is coming dotes connected with the recent<br />\ninto •organized labor in England. Willia ins Memorial Expedition.<br />\nThe support which public opinion His fluent manner of speech makes<br />\nhas given the newly-formed labor him an unusually good lecturer,<br />\npolitical party has done much to since he keeps his audiences inalleviate the grievances of union- terested as well as amused from<br />\nized labor; so also has the public the beginning to the end of his<br />\nsentiment against general strikes addresses.<br />\nhelped to bring labor to a more<br />\nrational viewpoint. \"England is<br />\nnow confronted by bigger labor<br />\nproblems than ever before,\" concluded the lecturer, \"yet, in the<br />\nmatter of industry, the country<br />\nin 1920 is distinctly and substan1:1(1)ERS 7.11?:<br />\ntially better off than in 1914.\"<br />\n<br />\n7<br />\n<br />\nMANY LACROSSE STARS BACK<br />\nNine H Men on Hand This Spring—<br />\nRecord-Breaking Squad Out—<br />\nFirst Game With Cornell.<br />\n<br />\nThe prospects for a recordbreaking lacrosse team this year<br />\nare particularly bright. With the<br />\npresent improvement of weather<br />\nconditions it seems probable that<br />\nCoach Wolf will be able to whip<br />\nhis charges into splendid form before the opening of the season<br />\nwith. Cornell on April 3. At present, there are approximately 80<br />\nyoung athletes cavorting around<br />\nStraus Field at one time or another.<br />\nFor Spring<br />\nOf last year's team there are<br />\nnine men back. They are Captain<br />\nThe Liberty Hat $6.00<br />\nMeyer, Defandorf, Marley, Cashell, Hoffman, Stuart, Dougherty,<br />\nSilberstein and Sadtler. There is<br />\nTHE<br />\nli<br />\nstill - a possibility of \"Tiff\" Williams, now a medical student, reCollar Hug Clothes<br />\nturning to his old position at cenBaltimore and LiberfyStreets<br />\nter. It is not known yet whether<br />\nor not \"Sam\" Silberstein's work<br />\nwill keep him from going out for<br />\nthe team this year. If \"Sam\"<br />\nfinds it impossible to play, it<br />\nmeans that there will be three positions to be fought for among.the<br />\n\"subs.\" There are a• number of<br />\nFor aCen Who<br />\nnew men who are demonstrating<br />\nc-Chink<br />\nthat they will be ready to fill the<br />\nplace of any of the regulars should<br />\nthese waiver. However, it is very<br />\nunfortunate that many men, inN. HESS' SONS<br />\ncluding two very promising fresh8 E. Baltimore St.<br />\nmen have been rendered ineligible<br />\nby that jinx which always haunts<br />\ncollege athletics—the black list.<br />\nManager Keys has added another game to the schedule. This<br />\nStationers Engravers Printers<br />\nis the game with the Crescents on<br />\nJune 5. He is dickering with Fountain Pens<br />\nI. P. Note Books<br />\nToronto for a game on June 12.<br />\n229<br />\nPark<br />\nAvenue - Baltimore<br />\nThere is also an open date on<br />\nApril 17. which he hopes to fill<br />\nsoon.<br />\n<br />\nUALITYÔHOP<br />\n<br />\nHESS SHOES<br />\n<br />\nJ. H.SAUMENIG & CO.<br />\n<br />\nFire in By-products Research<br />\nLaboratory.<br />\n<br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br />\n<br />\n,*<br />\nA fire, starting presumably from<br />\nan overheated flue, destroyed the<br />\ncontents of the By-products Research Laboratory on Thursday,<br />\nMarch 11, at about 2.15 P. M. A<br />\ngraduate student, U. 0. Hutton,<br />\nwas working in the laboratory<br />\nwhen the fire broke out in the<br />\nsecond story. Someone passing The Chas. Willms<br />\nSurgical Instrument Co.<br />\non Charles street saw the smoke<br />\n300 N. Howard St., Baltimore, Md.<br />\nand turned,jn an alarm. A crowd<br />\nSURGICAL INSTRUMENTS<br />\n.of students and others had gathHospital, Invalid and Microscopic<br />\nered by the time the firemen arSupplies.<br />\n\"<br />\nrhred. Although the smoke was<br />\nORTHOPEDIC APPLIANCES.<br />\nvery dense and the firemen experiCollege and Fraternity Stationery<br />\nenced difficulty in -breaking into<br />\nthe second story windows, since Banquet and Dance Cards—Invitations<br />\nthey were screened with stout<br />\nJAS. H. DOWNS<br />\nwire, they, soon had the blaze unENGRAVER — PRINTER — STATIONER<br />\nder control.<br />\n<br />\nE. E. ADAMS<br />\n<br />\n229 N. Charles Street<br />\n<br />\nCollars—Dozens of Styles—and Other Furnishings<br />\n<br />\nHUTZLER BRITIEM<br />\n<br />\nHoward Street<br />\nNear Saratoga<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 16, 1920.<br />\n<br />\n8<br />\n<br />\n-10ifOR0220ig<br />\n10:-fOOTA0Et0::0::0::0::0::0::011:0:#0:40::0-if0::0:f0:<br />\n:<br />\n%0LIOTIONOTL:0-<br />\n<br />\nSPRING SUITS FOR YOUNG MEN,<br />\nin patterns and models not to be had elsewhere.<br />\n<br />\nClothes ofiCustom Quality<br />\n14 N. CHARLES ST.<br />\nOBOCOMROT:OgONOEDEOPOltagaLIDEOE:000E0DOMOA0g0A0D0z ROPONOR<br />\nPEG I.15 PAT Off<br />\n<br />\nCOME TO<br />\n<br />\nTH—E7BEVERAGE<br />\n<br />\nNorthmittitrr tirtsblitrrian Ourril<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass in front of door)<br />\n<br />\nSatisfies the national<br />\ndemand for a wholesome, pure and appetizing beverage—at the<br />\nsoda fountain or with<br />\nyour meals.<br />\n<br />\nServices. 11 A.M.and8P. M.<br />\nMen's Bible Class. 9.45 A. M.<br />\n<br />\nCORDIAL WE<br />\nTO ALL STUDENTS<br />\n<br />\n(Srarp $c<br />\n<br />\nPeres Evitinipal<br />\n<br />\nMONUMENT ST. AND PARK AVE.<br />\nIli] The services on Sunday are at II o'clock and 8 o'clock. Seats will be reserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege of having you associated with us in our worship, and we hope that the benefit may be reciprocal.<br />\n<br />\nESTABLISHED 1873<br />\n<br />\nA. H.FETTING MAN'FG JEWELRY CO.<br />\n213 N. LIBERTY STREET<br />\nMARYLAND<br />\nBALTIMORE,<br />\n<br />\n\"ALL THINGS MUSICAL\"<br />\n417 North Howard Street<br />\nBALTIMORE, MD.<br />\nBAND AND ORCHESTRA INSTRUMENTS<br />\nVICTROLA SPECIALISTS<br />\n<br />\nThe last round was undoubtedly<br />\nDorsey's. In spite of his bad eye,<br />\nhe landed frequently and continuously forced his man to the ropes.<br />\nThe latter clinched often, and<br />\nseemed to be fast weakening.<br />\n<br />\nEEI<br />\n<br />\n77 7F Fr-W.--<br />\n<br />\nriff<br />\n<br />\nt<br />\n•\" '• \"' .<br />\n,<br />\nVIII<br />\n<br />\nVisitors-to St:Lossis aro invitod<br />\nto inspoct this mammoth institution.<br />\n<br />\n•<br />\n<br />\nBOOK<br />\n<br />\nMART)<br />\n<br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br />\nIMPORTERS AND DEALERS IN<br />\n<br />\nEstablished 1811<br />\nOldest Musical Instrument House In U. S.<br />\n<br />\nH. R. EISENBRANDT SONS, Inc.<br />\n<br />\n_ -<br />\n<br />\n(THE<br />\n<br />\nGREEK LETTER FRATERNITY JEWELRY<br />\n<br />\nST. LOUIS<br />\n<br />\n:;.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nMANUFACTURERS<br />\n<br />\nANHEUSER- BUSCH<br />\n<br />\nTriomf!!!ir-ir rr //-<br />\n<br />\nMinister<br />\n<br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Services at<br />\n<br />\nBevo will more than<br />\nsatisfy your thirst.<br />\n<br />\n„<br />\n<br />\nRev. David Carson Bayless<br />\n<br />\nf'nwimumin,m,4,Rou<br />\nbI*1<br />\n46:11,...131:k./<br />\n<br />\nFINE BOOKS<br />\n<br />\n301<br />\n<br />\nN. CHARLES<br />\n<br />\nSTREET<br />\n<br />\nBaltimore, Md.<br />\n<br />\nThe<br />\nNorman Remington Col<br />\n<br />\nBOOKS<br />\n<br />\nYou're Interested In<br />\nEvery Student Should Own<br />\n<br />\nWIN FIRST IN OPEN EVENTS<br />\n<br />\nSend Your Name for Monthly List<br />\n<br />\n(Continued from page I)<br />\n<br />\nCharles Street, at Mulberry<br />\n<br />\nbows in a way that might easily<br />\nbe objected to.<br />\nThe summary of the events in<br />\nwhich Hopkins men placed folDorsey deserved at least a draw. lows. The times do not seem to<br />\nFrom the first gong, he took the be very good, but the track must<br />\ninitiative and usually had his man be taken into consideration, as it<br />\nclose to the ropes. His chief trou- was very poor.<br />\n50-Yard Low Hurdles (Open)—Won by<br />\nble lay in the fact that he had LeGendre,<br />\nGeorgetown; second, Reinhardt, Virthird, Thompson, IIopkins, Time, 6 2-5<br />\nginia;<br />\nhis<br />\nseemingly no regard for what<br />\nseconds.<br />\nopponent could do to him, and<br />\n880-Yard Run (South Atlantic)—Won by<br />\nSbeenan, Georgetown; second, Auray, Georgewalked into many short jabs with town;<br />\nthird, McDonough, Georgetown; fourth,<br />\nEdwards, Hopkins. Time, 2 minutes 16 1practically no guard at all. How- seconds.<br />\n440-Yard Dash (South Atlantic)—Won by<br />\never, to many, it looked as though<br />\nLeGendre, Georgetown; second, Thompson.<br />\nDorsey gave at least one blow for Hopkins; third, Griffith, Georgetown; fourth,<br />\nTime, 61 2-5<br />\nForan, Catholic University.<br />\neach that he received.<br />\nseconds.<br />\nBartels, Hopby<br />\n(Open)—Won<br />\nMile<br />\nOne<br />\nGeary started well, and had the kins; second, Fitzgerald, Georgetown; third,<br />\nHazeltine, Hopkins. Time, 5 minutes 4 4-5<br />\nedge over Dorsey in the first seconds.<br />\nround. The second was very<br />\nTwo Mile Run (South Atlantic)—Won by<br />\nGantt, Virginia; second, W. Norwood, Hopclose, being marked with almost kins;<br />\nthird, McLaughlin, Catholic University;<br />\nfourth, Scally, Georgetown Time, 10 minutes<br />\ncontinuous clinching. Where Cap- 46<br />\n3-5 seconds<br />\nhigh Jump (South Atlantic)—Won by Feetain Mabbutt erred was in the<br />\nney, Georgetown, and Archer, Virginia, tied<br />\nthird round, which he evidently at 5 feet 9 3-4 inches; third, Bradley, Georgefourth, Hume. George Washington, and<br />\ngave to the soldier. Although the town;<br />\nWood. Hopkins, tied.<br />\n50-Yard Dash (Invitation)—Won by Griffith,<br />\n\"Kid\" did succeed in landing sevGeorgetown; second, DeLavergne, Catholic Unieral left jabs to the face, Dorsey, vergity; third, Thompson, Hopkins. Time<br />\nseconds.<br />\nin the opinion of many, easily 5 3-5<br />\n880-Yard Run (Open)—Won by Bartels,<br />\nsecond, Auray. Georgetown; third,<br />\nmade up for these with two hard Hopkins;<br />\nMawr, Georgetown. Time, 2 minutes 19 4-5<br />\nchin.<br />\nopponent's<br />\nhis<br />\nseconds.<br />\nuppercuts to<br />\n0.•<br />\n<br />\nLOSES BOUT BY DECISION<br />\nTed Dorsey Loses by Referee's Decision<br />\nto Kid Geary, of Fort McHenry, in<br />\nFast Four-Round Bout at the<br />\nAmerican Legion Circus.<br />\n<br />\nIn the fastest bout of the evening at the American Legion Circus last Saturday night, \"Ted\"<br />\nDorsey, a member of the Hopkins<br />\nBoxing Team, and representing<br />\nthe Central Young Men's Christian Association, lost the referee's<br />\ndecision to \"Kid\" Geary, of Fort<br />\nMcHenry. The match was for only four rounds, and Dorsey seemed<br />\nto be improving all the time, although he had taken quite a bit<br />\nof punishment and had had one<br />\neye closed by his opponent.<br />\nCaptain Mabbutt, the referee,<br />\nreceived a great deal of criticism<br />\nwhen he handed Geary thd decision, since the concensus of the<br />\nring-side opiriion seemed to be that<br />\n<br />\nJ. H. FURST CO•<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br />\n<br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\"\"Maryland Historical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br />\n<br />\nDOCTORS' DISSERTATIONS<br />\nIn Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages.<br />\n<br />\nWyman's<br />\n<br />\nThe Largest &<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\n<br />\nMell's<br />\nShoes<br />\n<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes,<br />\n<br />\n19 Lexington St.<br />\n<br />\nSole Agent for<br />\nthe Johnston &<br />\nMurphy Shoes.<br />\n<br />\n\f", "format": "basic_html", "processed": "[r<br />\nr<br />\nVOL. XXIV, NO. 20.<br /><br />\nBALTIMORE, MD., MARCH 16, 1920.<br /><br />\nPRICE, FIVE CENTS<br /><br />\nSEASON TICKET CAMPAIGN OPENS<br /><br />\nWIN FIRST IN OPEN EVENTS<br /><br />\nHOPKINS LOSES STATE TITLE<br /><br />\n\"YOU\" SUBJECT OF LECTURE<br /><br />\nForty Student Teams in Charge of Selling Tickets — Tickets Admit to<br />\nThirteen Games -Students Get<br />\nCommission on Cards of<br />\nAdmission.<br /><br />\nFourth In South Atlantic. at Catholic<br />\nUniversity Meet — Team Makes<br />\nBetter Showing Than at<br />\nthe Armory.<br /><br />\nBasketeers Go Down Before Mount St.<br />\nMary's in State Title Match— Too<br />\nMuch Individual Work Again<br />\nCause of Defeat.<br /><br />\nDr. J. Sherwood Eddy, Former Y. M. C.<br />\nA. Traveling Secretary, and Now a<br />\nRepresentative of the InterChurch Movement,Addresses<br />\nSecond Student Body.<br /><br />\nThe Johns Hopkins basket-ball<br />\nIn spite of the fact that GeorgeThe Hopkins Athletic Associa- town was the chief point winner team went down to defeat to a<br />\nThe second of the series of four<br />\ntion opened its Season Ticket cam- in the Catholic University meet on<br />\nscore of 34 to 13 before Mt. St. lectures, arranged for the underpaign on Monday, and expects to Saturday night, Hopkins made a<br />\ngraduate department of Hopkins<br />\ncomplete all the soliciting by the much better showing than she did Mary's men last Thursday, in the was given last Wednesday at 10.30<br />\nend of the week. Mr. Theodore on her native heath two weeks state title match. Although Hop- A. M. in the Civil Engineering<br />\nKistler is in charge of the cam- ago. Hopkins made a better show- kins displayed the same form they Hall by Dr. J. Sherwood Eddy.<br />\npaign, and he has assisting him 40 ing in the open events than in the used against Princeton at the All classes were suspended at this<br />\nmen who act as captains of 40 South Atlantics, getting 12 points start,<br />\nthe ability of their oppo- hour, so that every student might<br />\nbe able to hear this important and<br />\nteams. These men, in turn, have for second place against 22 for<br />\neach chosen from the college regis- Georgetown, who topped the list. nents seemed to take the punch interesting talk entitled \"You.\"<br />\nter 15 other men who complete In the South Atlantics, George- out of their attack.<br />\nDr. French, in introducing the<br />\ntheir teams. In this way, 600 stu- town again led with 29 points,<br />\nThe Mt. St. Mary's team, which speaker, told of his work both bedents, the large majority of the while Hopkins came fourth with has had the experience of 16 fore and during the war as travelenrollment, have been drafted into 71/<br />\n2, being defeated also by Vir- games, 14 of which are to her cred- ing secretary of the Y. M. C. A.,<br />\nthe service of their college.<br />\nit, played with easy confidence. and still later as a representative<br />\nginia and Catholic University.<br />\nThe members of every team has<br />\nThe work of Captain Bartels Each man showed a familiarity of the recently formed interbeen asked to be responsible for was especially good, ashe took first with his position in the attack to Church Movement.<br />\nthe distribution of at least 10 cir- place in both the open mile and such an extent that the playing<br />\nDr. Eddy is a very brilliant<br />\nculars, which explain the uses, ad- half mile without much trouble. was mostly of their own making. speaker, and the attention of his<br />\nvantages and cost of the season Joe Thompson also did very crediHopkins, on the other hand, lost large audience never strayed durtickets. Thirty thousand of these table work, taking second place in most of its concentrated plays on ing the entire hour. He has just<br />\nPamphlets have been printed, and the South Atlantic 440, third in account of too much individual returned from a trip around the<br />\nso everyone interested in the cam- the 50-yard hurdles, and third in work. Many long shots were made world, spending considerable time<br />\npaign will be kept busy all the the Invitation 50-yard dash. at times when more steady players in China, India and the Near East.<br />\nweek folding, clipping and mailing Hazletine, Wood,Norwood and Ed- would have used passing to lessen Dr. Eddy drew most vivid pictures<br />\nthem.<br />\nwards also scored for the Varsity. the distance to the basket, before of the hardships and sufferings<br />\nThe season tiekets sell for $5 The showing of Hazletine and the shot was made.<br />\nwhich the Armenians have eneach, representing a saving of \"Bill\" Norwood was especially<br />\nBoyle and Gallagher did most of dured at the hands of the Turks.<br />\n$4.75 over the amount paid by per- good, the first mentioned getting the star work for Mt. St. Mary's, Endured, he said, but this endursons coming to the games on the third place in the open mile, and each registering four goals. Chap- ance cannot last forever. Only<br />\nordinary general admission of 75 the latter taking an easy second man, however, proved to be the yesterday a cablegram was recents per game. The1s:3 will be in the South Atlantic two mile, largest point scorer with three ceived saying the Turks wereagain<br />\ncontests at Homewood on 10 Sat- Gantt, the Virginia cross-country goals and ten fouls.<br />\non the warpath and unless Amerurdays and 3 week days during man, leading him across the line<br />\nBest action on the Hopkins ica intervenes, they will accomthe spring season. This, however, after a nip and tuck battle for a quint was displayed by Weiner plish their purpose of the comrepresents more than 13 games, mile and a half. Thompson ran and Woad. The former made two plete extermination of the Arsince baseball and lacrosse games a beautiful race in the South At- goals, taking a leading part in the menian race. He went on to show<br />\nare often played the same after- lantic 440 against LeGendre and attack, while \"Bill\" Wood showed how the European nation, so<br />\nnoon, thus affording the spectator Griffith of Georgetown, two of the some clever work at the defense.<br />\nweakened and exhausted by the<br />\ncontinuous amusement from 2 un- fastest in the country. Thompson<br />\nAt the opening of the game, late war, and already so burdened<br />\ntil almost 6 o'clock.<br />\nstumbled on one of the steeply \"Hopkins was the first to score, with policing large areas, are powThe games to take place at banked curves in his second lap, from the foul line. In the next erless to aid this oppressed counHomewood will be advertised be- but saved himself from a nasty few minutes the Mt. St. Mary's try. It is up to us. We alone can<br />\nforehand by large signs on Uni- fall. At the time he was running men uncorked some clever plays, save them, and by so doing we will<br />\nversity Parkway, and probably at second to Griffith. From then un- which rather dazed the visitors. prove to the doubting world that<br />\nCharles street and Lafayette ave- til the last 50 yards he was led The temporary paralysis of team our aims in the great war were<br />\nnue. Likewise, on the mornings by both of the Blue and Gray men, work was quickly taken advantage truly righteous and unselfish.<br />\nof the contests, \"Lefty\" Shields but on the last turn, Griffith, who of, and several goals were made,<br />\nThe speaker told of the work of<br />\nwill parade around the downtown seemed pretty well played out, fell making the score 19 to 6, at the the Y. M. C. A. in India. He told<br />\nsection of the city, dressed in a and LeGendre stumbled over him, end of the first period.<br />\nhow the Y. M. C. A. is making<br />\nlacrosse or baseball suit and car- recovering just before Thompson<br />\nWhen the whistle blew for the leaders of men out of low-caste<br />\nrying his well-known \"sandwich got to him. Joe would then have second half, Hopkins went on the Indians—a thing which half a cenboards.\"<br />\nwon the race had not the George- floor with their fighting spirit on tury ago would have been deemed<br />\nIn addition to the circulars sent town man shown an unwonted edge, but the opponents showed impossible. India today is going<br />\nout by the different members of familiarity with the use of his el- them that cofisistent playing and through a great crisis, just as all<br />\nthe<br />\nothers will be forwardheadwork, as well as spirit, were the countries of Europe and Asia<br />\n(Continued on page 8, col. 3)<br />\ned for<br />\ndistribution to the Varsity<br />\nteams,<br />\nthe essential qualities in a win- are. It is in a turmoil. Strikes<br />\nClub and alumnus. Graduates of them from the sale of the tickets. ning teem. Seven points were reg- and unrest exist everywhere. Inthe Baltimore Prep Schools will Thus, if a man sells 10 tickets, he lstered during the half for the dia, he said, is demanding \"Home<br />\nalso obtain lists of the students at wil make $5 for himself. The goal Black and Blue, while 15 went to Rule on the installment plan.\" He<br />\nthose schools and send circulars set by Mr. Kistler is to sell $6,000 Mt. St. Mary's.<br />\nreceives daily from his associates<br />\nto their parents, in the effort to worth of tickets, in which the stuover there, pleas for men. Men<br />\nThe line-up:<br />\ninterest them in the University, dents will profit to the sum of Mt. St. Mary's.<br />\nPos.<br />\n1. H. U. for teaching, for educating, for<br />\nBoyle<br />\nso that they will send their sons $600.<br />\nWeiner<br />\nguiding and particularly men for<br />\nGallagher<br />\nScheurich<br />\nto Hopkins.<br />\nTickets, circulars and any in- Dowd.<br />\nleadership.<br />\nC<br />\nKennady<br />\n.W.Wood<br />\nOf particular interest to the formation concerning We cam- Chapman<br />\nChina, too, is having her own<br />\nHart<br />\nE Wood<br />\nGoals—Boyle (4), Gallagher (4), Chapman<br />\ncampaign workers should be the paign may be obtained at any<br />\ntroubles.<br />\nThis vast nation, comz<br />\n(3), Dowd, Hart, Weiner (4), Kennady (1).<br />\nfact that they will be given 10 per time from the Athletic Office in Fouls—Chapman<br />\nprising one-fourth of the popula(10), Weiner (3). Referee—<br />\nLeathers, Gettysburg. Time of Halves-20<br />\ncent of the money collected by the Barn.<br />\nminutes.<br />\n(('ontinued on pace 4, col. 2)<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br /><br />\n2<br /><br />\nNEW CONSTITUTION ACCEPTED<br />\nGeneral Athletic Association Passes It<br />\nUnanimously—Two Admendments<br />\nLikely To Be Made.<br /><br />\nIffrrbrrirk<br /><br />\nKipp<br /><br />\nIII<br /><br />\nI ii<br /><br />\nMANUFACTURERS OF<br /><br />\nHIGH GRADE CHOCOLATES.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nCI Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br /><br />\nJohn C. Knipp &amp; Sons<br />\nDRAPERIES<br /><br />\nDECORATIONS<br /><br />\nFURNITURE<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nATTENTION! J. H. U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br /><br />\nPUBLISHERS<br /><br />\nPRINTERS<br /><br />\nMEWALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0-12 N. HOWARD STREET<br /><br />\nBALTIMORE<br /><br />\nNearly 400 students of the University. of Nebraska have recently<br />\nreturned to their studies after<br />\nworking in the mines of Nebraska<br />\nand neighboring states to help relieve tliv_ coal famine. Support<br />\nwas pledged to the government at<br />\na inass-me.oting, and resolutions<br />\nwere adopted, condemning those<br />\nresponsible for conditions as they<br />\nwere at the time- of greatest need.<br />\nThree co-eds helped with the cooking for the men while they were at<br />\nwork in the coal fields.<br /><br />\n11<br /><br />\n11<br />\n1111 1111<br />\n::;11<br />\n;11111<br /><br />\n11111<br /><br />\n-4,<br /><br />\n1111<br /><br />\nThe IICW constitution -drawn up.<br />\nby the Athletic Board and read at<br />\nthe mass-meeting of the preceding<br />\nweek was unanimously passed by<br />\nthe student body last Thursday.<br />\nCopies of the new constitution will<br />\nbe printed and distributed among<br />\nthe students.<br />\nSeveral proposed amendments<br />\nwere discussed before the constitution was accepted, but President<br />\nHoffman of the Athletic Board<br />\npointed out that a constitution<br />\ncould not be amended until it took<br />\neffect. General disapproval of that<br />\nsection Mach gives the Athletic<br />\nBoard the right to reject a captain elected by the team was expressed. It was pointed out that<br />\nthe players, rather than the student body represented through the<br />\nAthletic Board, would undoubtedly be the best judges of the qualifications for athletic leaders. A<br />\nDiotiOn to annul this clause failed<br />\nto receive the necessary unanimous passage by two votes. The<br />\nsnbject will be brought up again<br />\nat a future meeting.<br />\nThe other section found objectionable related to the election of<br />\nmanagers of teams. The constitution, as written, states that men<br />\nheed not have been assistant managers to be chosen managers. At<br />\nler some discussion, this matter<br />\nwas also postponed until the next<br />\nmeeting.<br />\n•Last Thursday's gathering was<br />\ndistinguished from the usual massmeeting by the presence of a trio<br />\nof the Hopkins orchestra. Vanneman on the drum, Baughman on<br />\nthe piano, and Rankin on the violin, performed to the great delight<br />\nof everyone present—and that future mass-meetings would be much<br />\nmore satisfactory with such music<br />\nincluded in their programs was<br />\nthe concensus of opinion.<br /><br />\n'1111\"i<br /><br />\nI<br />\n.\"..„:1111111111111111111111111111:.<br /><br />\nWm. DEMUTH 8t CO.. NEW<br />\nMAKERS<br /><br />\nOF<br /><br />\nYORK<br /><br />\nFINE<br /><br />\nPIPES<br /><br />\n1_11111111111111111111111111111111111111111111111111111<br /><br />\nI<br /><br />\nLARGEST<br /><br />\nI.—American Journal of Mathematics.<br />\nF, MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLII in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nII.—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors: Quarterly. 8vo.<br />\nVolume XLI in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVIII<br />\n$3.50 per volume.<br /><br />\nin progress.<br /><br />\nIV.—Johns Hopkins University Circular<br />\n.Including Annual Report. Register,<br />\netc. 8vo. Volume XXXIX in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXXI in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br /><br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br /><br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\n. Semitic Philology.<br />\n(Beitrage zur Assyriologie. etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br /><br />\nVIII.—Modern Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRUENBAUM, W, KURRELMEYER and H, C. LANCASTER.<br />\nmonthly. 4to. Volume XXXV in<br />\nprogress. $5 per volume. (Foreign<br />\npostage 50 cts.)<br /><br />\nIX.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Attnos- pheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXV in progress. $3<br />\nper volume. (Foreign postage 25 cts.)<br />\nXi.—Reprint of Economic Tracts..<br />\n- J. H. HOLLANDER, Editor. Fourth<br />\nSeries in progress, $2.<br />\nXII.—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMBS W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nX111.—Elliott Monograph in the Romance<br />\nLanguages and Literatures.<br />\n.. EDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. • Reports of the Maryland Geological Survey.<br />\nE. B. MATHEWS, Editor.<br /><br />\n''''''''<br /><br />\nF you would know real smoke contentment, just you smoke<br />\na WDC Pipe full of your favorite tobacco. Then you'll<br />\nknow what a real French briar is, and what the Demuth<br />\nseasoning will do to make it break in sweet and mellow.<br />\nAsk any good dealer to show you a variety of shapes, then<br />\npick yours.<br /><br />\nWORLD'S<br /><br />\nJohns Hopkins Press<br /><br />\nThe co-eds of the University of<br />\nCincinnati have a Man-haters'<br />\nClub. Two girls were recently requested to resign on the ground<br />\nthat they had not lived up to, the<br />\nideals of the organization. After<br />\nthe business of the club had be])<br />\ntransacted, an interesting paper<br />\non \"Why We Hate Men Until We<br />\nHave A Date,\" was read by one of<br />\nthe members.<br /><br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of publications will be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br /><br />\n3<br /><br />\nYOUNG MAN<br />\n,<br />\nk<br />\ncsAS:.:<br /><br />\nYour Suit or Overcoat<br />\nwill have those smart dapper kinks if<br />\nit comes from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br /><br />\nPrices, $25.00 to $65.00<br /><br />\nSTEWART111,<br />\nfa COOIMMOR With lanes Itrer•err<br /><br />\nCe..Nris<br /><br />\nHOWARD AND LEXINGTON STS.<br /><br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br /><br />\nSo!e Agents for Baltimore for College Fraternity Bands (6reek Letter Societies).<br />\nSHIRTS<br /><br />\n(2e.i<br /><br />\nARROW COLLARS<br /><br />\nop, co.<br />\nOL•<br /><br />\nQuality<br /><br />\ns\"e'et<br />\n•<br /><br />\nI<br />\n30<br /><br />\nGP<br /><br />\ncv° Me.<br />\n1k• 1kc'\"<br />\nMerchandise<br />\nViS1` l'e°`<br /><br />\n... and at three historic banquets<br />\nHOSIERY<br /><br />\nHATS<br /><br />\neA fact:<br />\n'Just enough Turkish\"<br />\nFacts like these make Fatima's<br />\nplace among cigarettes unique.<br />\nA few years ago, the \"proper\"<br />\nthing on such state occasions<br />\nwould have been an expensive,<br />\nfancy -boxed, straight Turkish<br />\ncigarette.<br />\nToday, things are different.<br />\nMen base their choice on taste<br />\nrather than price. That Fatima<br />\nshould be so clearly the choice<br />\nof men who can afford anything<br />\nthey like,shows that most smokers really prefer—not too much<br />\nTurkish tobacco in their cigarettes nor too little —but \"jast<br />\nenough Turkish.\"<br /><br />\nSHOP<br />\nTHE HOSIERY<br />\nN. CHARLES ST.<br /><br />\nWithin a single week last fall, great civic<br />\ndinners were tendered at the WaldorfAstoria<br />\nto General Pershing, to Herbert Hoover and<br />\nto Cardinal Mercier. And at all three of these<br />\nfamous banquets, the only cigarette served by<br />\nthe hosts was Fatima.<br /><br />\n215<br /><br />\n,Dest Shop For<br />\nMen's Sox and Ties.<br />\n75 Cents and Up.<br /><br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br /><br />\nATIMA<br />\nA Sensible Cigarette<br /><br />\n106-108 CLAY ST.<br /><br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\npkins Seals in Silver and<br />\nGold,<br /><br />\nCollege Jewelry e Specially<br />\n•••••111<br /><br />\n28 E BALTIMORE STREET<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br /><br />\nTHE NEWS-LETTER'S MAILBAG<br />\nentire student body. If you have<br />\never written for any paper whatever, or if you have not, but feel A Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulthat you can express yourself in<br />\nder the Responsibility.<br />\nink, do not fail to hand in your<br />\nEntered as second-class matter De- name at once. Be you freshman<br />\ncember 3, 1909, at the Post Office at or senior, you will receive a fair<br />\nAll letters intended for publication<br />\nmust be concise.<br />\nBaltimore, Md., under Act of Congress,<br />\nbe<br />\nwill<br />\nelection<br />\ntrial, and your<br />\nNo attention will be paid to anonyNovember 3, 1879.<br />\nmous letters, but names signed as an<br />\njudged on the merits of your work.<br />\nof good faith will not be printed<br />\nevidence<br />\nPublished weekly, from October to<br />\nif request is made that they be omitted.<br />\nJune, by the students of Johns HopThe publication of a letter is not to be<br />\nThe fight is on! Will we stand<br />\nkins University.<br />\ntaken as an indorsement of its views by<br />\nbehind our teams, or will we leave<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\nBusiness communications should be them in the lurch? Spring pracinterest.<br />\naddressed to the BUSINESS MANAGER,<br />\nin<br />\nJOHNS HOPKINS UNIVERSITY; all arti- tices have already commenced<br />\ncles and other communications should all the major sports, and the cam- Suggests That Representatives be Sent<br />\nbe sent to the MANAGING EDITOR,<br />\npaign for season tickets to the<br />\nto High Schools.<br />\nHomewood 100 games has been inaugurated. The To the Editor Of THE NEWS-LETTER:<br />\nTelephcce<br />\nsquads are working every day to<br />\nSir—I should like to suggest<br />\nEditor-in-Chief.<br />\nput teams on Homewood Field that THE NEWS-LETTER be placed<br />\n• Llewellyn W. Lord, '21.<br />\nworthy of bearing the name of in the library of every high school<br />\nManaging Editor.<br />\nHopkins, and it is up to us in the state. There are only a<br />\nJohns<br />\nH: Douglas Cotton, '22.<br />\nto prove ourselves worthy of our few high school students who<br />\n•<br />\nAssociate Editors.<br />\nteams.<br />\nknow that the Johns Hopkins<br />\nWarren W. Driver, '20.<br />\nBy selling seas?n tickets we will University has an Undergraduate<br />\nEdward G. Huey,'22.<br />\nnot only help our Alma Mater, but Department, as well as a Medical<br />\nJunior Editors.<br />\nalso ourselves. Ten per cent of School. A little information, such<br />\nRichard Dallam, Jr., '22.<br />\nevery ticket we sell goes into our as THE NEWS-LETTER contains,<br />\nCharles C. Marbury, '22.<br />\nRichard M. Wood, '22.<br />\npockets. We should be willing would turn their steps our way<br />\nNorvell E. Miller, Jr., '23.<br />\nwork for our College gratis, but and give them a chance to link<br />\nto<br />\nWilliam F. Passano, '23.<br />\nwith this added inducement, there their future with our great and<br />\nBusiness Manager.<br />\nis no reason why we should not growing institution of learning.<br />\nGeorge Deichman, '21.<br />\nmore than fulfill that which is<br />\nOne of the best things that<br />\nCirculation Manager.<br />\nof us. Our families are in- could be done for the seniors in<br />\nasked<br />\nFrederick W. Lipps, '22.<br />\nterested in what we do at Home- the Maryland high schools would<br />\nAssistant Business Managers.<br />\nwood, and we should have no dif- be a talk by one of our men,<br />\nFrederick Abbott, '22.<br />\nin selling several to rela- chosen by the student body, who<br />\nficulty<br />\nLawrence K. Wagner, '22.<br />\ntives. Then, there are many other would outline our courses, our<br />\nBALTIMORE, MD., MAR. 16, 1920 fields where tickets can be sold. spirit in athletics, our student orHeretofore, the attendances at the ganizations, our location, and<br />\nIt is with sincerest regret that spring sports have been but<br />\nwould •thus give a perspective of<br />\nTHE NEWS-LETTER announces the mere handfuls, and it is up to us<br />\ncollege not to be gained in any •<br />\nthe<br />\nresignation of John H. Lewin, edi- to see that these contests are as<br />\nway. This talk would aid<br />\nother<br />\ntor-in-chief; George W. Wagner, well attended as the football<br />\nthe man who has not yet decided<br />\nTorsch,<br />\nF.<br />\nF.<br />\nbusiness manager;<br />\ngames in the fall.<br />\nwhat he will do after he gradumanaging editor; H. H. Morriss,<br />\nates. The University of PennsylCarB.<br />\ncirculation manager; M.<br />\n\"YOU\" SUBJECT OF LELTURE<br />\nvania has adopted the plan of<br />\nroll, V. J. Wyckoff, J. R. Lomausending a representative to the<br />\nro and H. E. Niles, associate edidifferent \"prep\" schools, who aids<br />\n(Continuedfrom page 1)<br />\ntors, and Mr. V. E. Stuart, assistthe seniors in fixing their scheda<br />\nbecome<br />\njust<br />\nhas<br />\nthe<br />\nglobe<br />\nof<br />\ntion<br />\nant business manager. The loss of<br />\nules for the next year at Penn.<br />\nthis capable body of writers will republic. The Chinese people can- Why could not Hopkins adopt the<br />\ninare<br />\nThey<br />\nit.<br />\nbe felt keenly in future numbers of not comprehend<br />\ntoxicated by the wine of liberty, same course in its relations with<br />\nthe paper.<br />\nthe Altiryland high schools?<br />\nMr. Lewin has piloted the paper and the feeble government is totONE WHO WOULD WAKE UP<br />\norganizers;<br />\nneed<br />\nThey<br />\ntering.<br />\nof<br />\nshoals<br />\nfrom the breakers and<br />\nTHE HIGH SCHOOLS.<br />\nthe war, (luring which the paper men of initiative and ability to<br />\nas<br />\nfeet<br />\ntheir<br />\non<br />\nthem<br />\nput<br />\nfirmly<br />\nwas seriously threatened with<br />\nFOUR RECORDS BROKEN<br />\nfailure and bankruptcy, to the the second greatest republic of the<br />\nsmooth and untroubled waters of world.<br />\n(('ontinuedfrom page 5)<br />\nDr. Eddy spoke also of the need<br />\npeace, placing it in a position of<br />\nfor first honors in the<br />\nRowlaM1<br />\nfor men of this type in America.<br />\ngreat promise for future years.<br />\nswim.<br />\n100-yard<br />\nTo Mr. Wagner, the heartfelt Compared to European countries,<br />\nThe summary:<br />\ngratitude of the entire board is we are enjoying a carnival of ex160-Yard Relay—Won by Central Young<br />\nMen's Christian Association; Baltimore Athextended, for he took the helm of travagance and luxury. The aver- letic<br />\nClub, second. Time. — minutes 22<br />\nthe managerial staff at a time age laboring man in this country seconds.<br />\nDive—R. A. Newby, Central High<br />\nFancy<br />\nwhen THE NEWS-LErrER was more receives from $3.50 to $4.00 a day, School, first; C. IL Slingluff, Baltimore Ath'second; F D. Little, Central High<br />\nClub,<br />\nletic<br />\nthan $700 in debt, the largest de- which in India, a laborer is fortu- School, third.<br />\nday.<br />\na<br />\ncents<br />\nDash—W. E.- Kanakanui, Central<br />\n3<br />\nreceives<br />\nhe<br />\n50-Yard<br />\nif<br />\nnate<br />\nficit which has ever been recorded<br />\nYoung Men's Christian Association, first; E.<br />\nin the history of the paper,Sand it There are, in our own country, J. Shell, Central Young Men's Christian Assosecond; C. Carrigan, Doyle's Athletic<br />\nis due to his unceasing toil and fifty millions of people absolutely ciation,<br />\nClub, third. Time, 26 seconds.<br />\n80-Yard Breast Stroke—D. H. Rowland, Baltrue college spirit, that THE NEWS- unconnected with any religious timore<br />\nAthletic Club, first; S. II. Wallach,<br />\nDoyles' Athletic Club, second; C. Carrigan,<br />\nLETTER can now hold up its head institutions.<br />\nthird.<br />\nHe emphasized the fact, that the second. Time (unofficial), 1 minute and 4-5<br />\nwith an asset of $200.<br />\n220-Yard Swim—C P. Coady, Baltimore AthWe are about to embark upon Y. M. C. A. does not attempt to letic<br />\nClub, first; C. G. Lutz, Central high<br />\nSchool, second; T. II. G. 13ailliere, Central<br />\nanother season, with but four ex- change a man's religious belief, it Young<br />\nMen's Christian Association, third.<br />\nperienced men remaining on the does not try to prostilize, but to Time, 2 minutes 44 4-5 seconds.<br />\nR. Howard, Marston. first; F.<br />\nboard. THE NEWS-LETTER is es- vitalize. \"Life, minus god is hell,\" II.Plunge—C.<br />\nLongfellow, Central Young Men's Christian<br />\nW. L. Gigson, Central<br />\nsecond;<br />\nAssociation,<br />\nuninpecially fortunate in having such he said, \"and the sooner the<br />\nYoung Men's Christian Association, third.<br />\nfor<br />\nbetter<br />\nthe<br />\nit,<br />\ndiscover<br />\nformed<br />\nto<br />\neditors<br />\n28 1-5 seconds<br />\njunior<br />\nTime,<br />\nfeet.<br />\nDistance, 60<br />\nan able group of<br />\n80-Yard Back Stroke—G. E. Dickey, Cencall upon, but these men are as yet all mankind.\"<br />\nC. Hall, Baltimore<br />\nR.<br />\nfirst;<br />\ntral Iligh School,<br />\nF. A. Wessells, Central<br />\nIn closing, Dr. Eddy asked all Athletic Club, second;<br />\ninexperienced, and there is a great<br />\nthird.<br />\nAssociation,<br />\nChristian<br />\nYoung Men's<br />\nneed for new candidates, of which those interested and desiring to Time, 57 seconds.<br />\nCentral<br />\nE.<br />\nKanakanui,<br />\nSwim—W.<br />\n100-Yard<br />\nthere should be a large number in help in this great cause to see him Young Men's Christian Association, first; HenBaltimore Athletic Club, second;<br />\nimmediately, for he expects to ry Rowland,<br />\na university of this size.<br />\nF. J. Shell, Central Young Men's Christian<br />\nEurope.<br />\nto<br />\nTime, 1 minute 3-5 second.<br />\nreturn<br />\nshortly<br />\nthird.<br />\nAssociation,<br />\nWe need the co-operation of the<br /><br />\nDechilllsjilli01810101<br />\n$2.00<br /><br />\n•<br /><br />\nQUACKS FROM A QUACK<br /><br />\nI<br /><br />\n\"In the spring, a young man's<br />\nfancy lightly turns to thoughts of<br />\nlove.\" So says ye om proverb and<br />\nrightly. Spring time is upon us;<br />\nyea, even it is here, and by the<br />\nsame token I have seen strange<br />\nand wonderful sights which go to<br />\nshow that the young men at Hopkins are permitting themselves to<br />\nrun true to form. Of course, Ferdie Meyers has set the example by<br />\nthreatening marriage. That, I<br />\nthink, is carrying the custom of<br />\n\"obeying that impulse\" a wee bit<br />\nfar, I don't believe that aforesaid<br />\nold proverb intended Ferdie to do<br />\nanything quite so desperate.<br />\nBut the signs of the times are<br />\nbreaking out in milder forms here<br />\nand there. For instance, have you<br />\ntaken careful note of that pearl<br />\ngray creation which Vertrees<br />\nWyckoff proudly calls a hat? It<br />\nis truly a masterpiece of the art,<br />\none in a million, but even so, no<br />\nself-respecting male being would<br />\nvoluntarily of his own accord condescend to purchase such an article, much less to wear it. By<br />\nmy beard, he is under the spell of<br />\na fair maiden, as Kipling used to<br />\nsay (I believe it was Kipling),<br />\n\"look for the woman in the case.\"<br />\nBut this strange and peculiar<br />\ndisease affects both young and old.<br />\nIt plays no favorites, none are immune. They tell me that when<br />\n\"Ma\" Green takes leave of a beautiful lady nowadays, it is with<br />\nwords to this effect, \"Good-bye,<br />\nmy dear, and remember that the<br />\npresent Mrs. Green is not immortal.\"<br />\nThe taller they are the harder<br />\nthey fall, and following out this<br />\nline of reasoning, let me unfold<br />\nthe queer maneuvers that the<br />\nweather has caused one young gentleman to execute. Namely, Calkins, the boy the newspaper chaps<br />\nloved to dub \"the blond young<br />\ngiant,\" a regular two-fisted caveman, you know. They tell me he<br />\nhas 'been seen flashing his superb<br />\nphysique and wicked hair cut before the more or less admiring<br />\nbrown eyes of one of the fair sex,<br />\nwho condescends to grace the Civil<br />\nEngineering Building with her<br />\ncharming presence. This hero of<br />\nmany a bloody football battle, this<br />\nfire-eater who was afraid of nothing, tells me that this same damsel<br />\nIi; s that strange faculty of making him shine the tip of his left<br />\nshoe against the cuff of his right<br />\ntronser, and be scared nearly to<br />\ndeath. Eric says that when he<br />\ngoes to call in the evening he has<br />\nthe same sinking nervous sensation in the immediate vicinity of<br />\nhis floating ribs which was formerly aroused in him when \"Doc.\"<br />\nHulbert would say, \"Now for the<br />\npr-r-roblems.\" Another good man<br />\ngone wrong.<br />\nStill there is one consolation,<br />\nonly one wild woman can get you<br />\nat once. The law firmly states<br />\nthis fact, even the Bible says,\"No<br />\nma n can serve two masters.\"<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br /><br />\n5<br /><br />\nTALKS ON LABOR SITUATION<br /><br />\nA good guess for<br />\nyou would be—<br /><br />\nMr. Whyte Talks Development of<br />\nLabor Situation in Second Huntingdon Williams Memorial Lecture.<br /><br />\nThe industrial and political<br />\nphases of British labor conditions<br />\nsince the outbreak of the recent<br />\nwar were discussed by Mr. Whyte,<br />\nformer Member of Parliament, in<br />\nthe second of his series of'lectures, Friday afternoon, in the<br />\nMr.<br />\nCivil Engineering Hall.<br />\nWhite traced the development of<br />\nthe present labor situation from<br />\nits beginning in 1914, bringing<br />\nout the logical steps by which the<br />\npresent issues were brought before<br />\nthe English public. The speaker<br />\npointed out that during the war<br />\nthese successive steps could not be<br />\nclearly discerned and understood;<br />\n—There's style<br />\nthat it is only in retrospect that<br />\neach separate action and its conto them<br />\nsequences can be pieced together<br />\ninto the train of events which has<br />\nled to the existence of the present<br />\nBritish labor problems.<br />\nIn the months preceding the<br />\nwar, England was suffering from<br />\na series of strikes or threatened<br />\nstrikes in many of her largest inBaltimore, Charles and Fayette \"<br />\ndustries. Labor unions and employers were engaged in a contest<br />\nof a nationally serious character.<br />\n— AMUSEMENTS — The outbreak of the war, however,<br />\nimmediately put an end to this<br />\ncontroversy, and unionized labor<br />\nco-operated with its employers to<br />\nbring about the necessary increase<br />\nShubert Attractions.<br />\nin output for the carrying on of<br />\nMatinees Wednesday and Saturday.<br />\nthe war.<br />\nTONIGHT AT 8.15<br />\nDuring the war, then, organArthur Hammerstein Presents<br />\nized labor was given further cause<br />\nTHE BIG JOYOUS MUSICAL<br />\nfor dissatisfaction. The great inSPREAD<br />\nflux of inexperienced workers inOf New York,Chicago &amp; Boston Glories. to war industries met with vigorous objection from the unions, and<br />\nthe \"dilution crisis\" was brought<br />\nabout. At the conference which<br />\nWith a Cast of Musical Comedy<br />\nfollowed<br />\nthis general complaint<br />\nFavorites.<br />\non the part of the unions, a proA Parade of Tumble-In Beauties.<br />\nvision was made for a relaxation<br />\nof many of the rights of organized<br />\nNext Week—Seats Tomorrow.<br />\nlabor for the period of the war.<br />\nE. H.<br />\nJULIA<br />\nStill reater dissatisfaction on the<br />\nSOUTHERN<br />\nMARLOWE<br />\npart of unionized labor naturally<br />\nMonday, Thursday Evenings, Saturday<br />\nMatinee, \"TWELFTH NIGHT;\" Tues- followed this curtailment of its<br />\nday, Saturday Evenings, \"HAMLET;\" privileges. Consequently, English<br />\nWednesday, Friday Evenings, \"TAMING OF THE SHREW.\" $1.00 to $3.00. labor was in such a state of unrest that it seized with eagerness<br />\nthe opportunity which the RusTeacher: \"Which eat most, ani- sian Revolution gave it of asserting itself forcibly.<br />\nmals or birds?\"<br />\nThus it happened that under<br />\nIt: \"Birds, sir; because they<br />\ntake a peck at a time.\"—The Por- the influence of three great facpoise.<br />\n(Continued on page 7, col. 1)<br /><br />\ntirirtu<br />\nNrattb<br />\n(1I1uttiri<br /><br />\nHub<br /><br />\nAUDITORIUM<br /><br />\n\"TUMBLE IN\"<br /><br />\n—<br /><br />\nr IN THE YOUNG MEN'S SHOP—<br />\nThe \"Carlton\"—a new Spring Suit;<br />\nsingle-breasted, with patch pockets.<br />\nBALTIMORE'S BEST STORE<br /><br />\n.icthochia,./rchgide<br />\nHOWARD AND LEXINGTON<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nFOUR RECORDS BROKEN<br />\nHopkins Men Swimming For B. A. C.<br />\nWin Many Points—Dardy Rowland<br />\nBreaks Record In 80-Yard<br />\nBreast Stroke.<br /><br />\nLefranc &amp; Ault<br />\n421 N. Noward St.<br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br /><br />\nThe Point Winners<br />\n--Central Y. M. C. A.<br />\nBaltimore Athletic Club<br />\nCental High School<br />\nDoyle's Athletic Club<br />\nUniversity School<br /><br />\n30<br />\n25<br /><br />\n14<br /><br />\nLuncheon<br /><br />\nAfternoon Tea<br /><br />\nSODAS AND SUNDAES<br /><br />\nMUSIC<br /><br />\n5<br />\n5<br /><br />\nR.G.LOY &amp; COMPANY<br /><br />\nFour records were broken last<br />\nSaturday night in the South At1 W. UNIVERSITY PARKWAY<br />\nlantic Association's Twelth Annual Indoor Swimming Meet at<br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br />\nthe Baltimore Athletic Club. New<br />\nmarks were set for the 160-yard Drug Store for J. H. U. Boys<br />\nrelay, 50-yard dash, 80-yard breast<br />\nPHONE HOMEWOOD 2121<br />\nstroke and 220-yard swim.<br />\nFour members of the Hopkins<br />\nteam entered the meet as repre- Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nsentatives of the Baltimore Athletic Club, and were largely instrumental in that club's winning<br />\nsecond place. The Central Young<br />\nMen's Christian Association came<br />\nout ahead with 30 points.<br />\nThe Y team won the 160-yard<br />\nMADE TO ORDER<br />\nrelay. Newby, of Central High<br />\nAND<br />\nSchool, upset the dope by defeating \"Toots\" Slingluff in the fancy<br />\nFINISHED CLOTHES<br />\ndive. The latter started well, but<br />\nmade two poor dives and was<br />\nseemingly out of his usual form.<br />\nPLAZA BUILDING<br />\nKanakanni won the 50-yard 19 AND 21 EAST FAYETTE STREET<br />\ndash in 26 seconds. Davidge Rowland set a new mark for the 80yard breast stroke, defeating both<br />\nORTMAN'S<br />\nWallach and Carrigan. Coady,<br />\nBaltimore Athletic Club, won the \"Queen Quality\" Home-Made Candies<br />\n220-yard swim from Lutz, of Cen80c. a pound<br />\ntral High, in a very close and<br />\nVISIT OUR ICE CREAM PARLORS<br />\nthrilling race.<br />\n227 N. HOWARD STREET<br />\nHoward, of<br />\nMarston's, had<br />\nlittle difficulty in winning the ARTISTIC PHOTOGRAPHS<br />\nplunge. Dickey, of Central High,<br />\nand \"Bob\" Hall, finished first and<br />\nsecond in the 80-yard back stroke,<br />\n319 North Charles Street<br />\nwhile Kanakanui nosed out Henry<br /><br />\nLEM M ERT<br /><br />\nIlgenfritz<br /><br />\n(Continued on page 4, col. 3)<br /><br />\nSPECIAL 'DISCOUNT TO J.H.U. STUDENTS<br /><br />\n11<br /><br />\nROBERT FAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br /><br />\nORCHESTRA DE LUXE<br /><br />\nCharles and Lafayette Ave.<br /><br />\nTHE ARCADE<br />\nTEA ROO/A<br />\n324 N. Charles St.<br /><br />\nMUSIC FOR DANCES, RECEPTIONS, ETC.<br />\nTELEF'HONE. GILMOR 2929<br /><br />\nRESIDENCE, 614 FULTON AVENUE<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MARCH 16, 1920.<br /><br />\n6<br /><br />\n- (. kANyk77,7,<br />\n,<br />\n,<br />\nL'<br /><br />\n.41,<br /><br />\niN<br /><br />\nirsu<br /><br />\n.\"•A<br />\n40;<br />\n4t,ty.,4<br /><br />\n.1cONVIt<br />\nUfroP •<br /><br />\nAnd all discriminating<br />\nlovers of cigarettes love<br /><br />\nor.u, b<br /><br />\n'<br />\n1 1'114<br />\ni<br /><br />\n4114.11111<br /><br />\n-2;,41/h71,/,<br /><br />\nBecause Murads are pure Turkish, the world's most famous tobacco<br />\nfor cigarettes.<br /><br />\n%ft&amp;<br /><br />\n6'1/<br />\n9);I<br /><br />\nAnd the Fame of Muracls grows<br />\nand grows and grows—they are 100<br />\nper cent Turkish, and they are 100<br />\nper cent popular with connoisseurs<br />\neverywhere.<br /><br />\nis true that \"ordinary<br />\ncigarettes cost a trifle less.<br />\nIt<br /><br />\nR. O. T. C.<br /><br />\nAn inspection of the R. 0. T. C.<br />\nunit was held last Thursday with<br />\nColonel Bull, from the headquarters of the Eastern Division as inspecting officer. After a brief inspection on the upper quadrangle,<br />\ntwo companies spent the rest of<br />\nthe drill period in practising close<br />\nand extended order, while Company A was marched out Thirtysecond street to Lake Montebello.<br />\nHere two squads, under Corporals<br />\n\"Bob\" Hall and \"Johnnie\" Dubelle, respectively, were sent out<br />\nin the same general direction, as<br />\nreconnaissance patrols, representing hostile forces. Each was to<br />\nprocure certain information; thus<br /><br />\nthe duty of each was to avoid combat at all costs. The patrols, however, came into contact and opened<br />\nfire on each other, the umpires<br />\nruling two men in one squad<br />\nkilled and two in the other captured. Colonel Bull and Captain<br />\nEllis viewed the maneuvers<br />\nthrough field glasses, and when<br />\nthe squads were called in, Cadet<br />\nMajor Burger gave the critique.<br />\nThe Lake Montebello region is<br />\nan excellent one in which to simulate actual campaign conditions,<br />\nand although time is necessarily<br />\nlost in marching there and back,<br />\nit is felt that much can be gained<br />\nby working under such excellent<br />\nconditions.<br /><br />\nContestants For Adams Medal<br /><br />\nThe \"Foreign Student's Directory.\"<br /><br />\nUpon the request of :Mr. Hammond, Dr. John C. French judged<br />\nthe would-be orators in the tryouts for the Adams contest. About<br />\n12 men came out for the preliminaries. Although most of the<br />\ncandidates spoke very well, Dr.<br />\nFrench decided that the four men<br />\nwho gave evidence of being able<br />\nto make better speeches in the<br />\nfinal contest were Hieman, Macdonald, Marbury and Williams.<br />\nThese men will show their wares<br />\non the night of the Taqueville<br />\nMedal Contest, the date of which<br />\nwill be decided upon by the Debating Council in the near future.<br /><br />\nThe \"Foreign Student's Directory,\" is published by the committee on Friendly Relations Among<br />\nForeign Students, 347 Madison<br />\navenue, New York City, and contains the names of over 6,000 sturents from 80 nations; the summary indicates the number of institutions attended, classified by<br />\nstates. Price 25c. For information, inquire at the Y. M. C. A.<br />\noffice.<br />\nThe Aero Clubs of Columbia,<br />\nHarvard and Yale are making<br />\nplans for a three-cornered airplane<br />\nrace next spring.<br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 16, 1920.<br /><br />\nGOETZ WINS THIRD PLACE<br />\nIn Spite of Train Wreck and Thirty-four<br />\nHour Trip, Hopkins Delegate Succeeds In Carrying Off Third<br />\nHonors In Southern Oratorical League Contest.<br /><br />\nFACULTY NOTES<br /><br />\n-Why we dislike certain people<br />\nwhen we grow up.--Why getting<br />\na. baby mad is good for him.—How<br />\nDue to an unavoidable accident, a mother's cooing can make .a<br />\nthe first contest of The Southern grand opera singer and a father's<br />\nOratorical League did not prove carelessness a bully, etc.,\" is the<br />\nas successful as was hoped. A title of a full page article in the<br />\nfreight-wreck delayed the train on<br />\nWhich the Hopkins and University. magazine section of a popular New<br />\nof Virginia Delegates were; and, York paper in the issue of Sun:ts a result, the train instead. of day, March 7.<br />\n:t1TiVillg at Lexington, Ky. at 8.50<br />\nDr. John B. Watson, whose ;<br />\nA. M. Friday, March 5, reached views are quoted, was rather prothere at 10.50 P: M., • just 14 voked<br />\nto see the strange photohours late. All of the other speakgraph<br />\nthe several other illusand<br />\ners had delivered their addresses,<br />\nfind the meeting was practically trations employed in the paper.<br />\nOver, when Goetz and Lavenstein, AS a. matter of fact, Ile had never<br />\nthe Virginia representative, Were seen the photographs before. The<br />\nushered on the platform. In spite genuine illustrations which might<br />\nof the fatigue occasioned by a have been used properly over<br />\nhis<br />\ncontinuous 34-hour trip, the two name may be found in his latest<br />\nlate arrivals delivered their . ad- book,\"Psychology from the Standdresses as best they could.<br />\npoint of the Behaviorist,\" which<br />\nSmith, of University of Ken- was placed on the market last<br />\ntucky,‘ was awarded the first prize November by the J. B. Lippincott<br />\nof 8:t0 Bobbitt, of North Caro- Company. lina, received second honors with<br />\nDr. Watson Is still carrying on<br />\na prize of $20. Goetz, of Johns<br />\na therongh research on infant acHopkins, won third place with an tivities, such as grasping, the inaward. of :”0. The other univer- folded thumb, the development of<br />\nsities represented in the contest eye movement, the Babinski reflex,<br />\nWere Alabaina, Tennessee, Vander- blinking, ability to maintain<br />\nthe<br />\nbilt and Virginia.<br />\nhead, locomotion, and other early<br />\nSmith spoke on \"Shantung ;\" activities. The observations are<br />\nBobbitt's speech was entitled \"The made from \"zero\" age to more adModern Crisis in Demecracy,\" vanced age.<br />\nand Goetz's address was on \"Free<br />\nOn Thursday, February 5, he deSpeech and Radicalism.\"<br />\nlivered a lecture before the National Hygiene Association, New<br />\nTALKS ON LABOR SITUATION<br />\nYork ; on Friday, February 13,<br />\nat the . Government Hospital<br />\n(Continued from 'mg<br />\n- e 5)<br />\nfor the Insane.<br />\nOn March<br />\ntors, the dilution crisis, the relax- 23, he will lecture before . the<br />\nation crisis and the Russian Revo- Teacher's College at Columbia<br />\nlution, British labor became pre- University. At a. future date,<br />\npared to combat the situation .Dr. Watson will lecture also<br />\nmore energetically than ever be- before the 'Women's Climb of Rofore. With the signing of the ar- land Park.. He uses his private<br />\nmistice, then, organized labor be- .motion-picture film to illustrate<br />\ngan to make good its threats of this lecture on \"Studies in Infant<br />\na general strike. During the past Psychology.\"<br />\n•<br />\n14 months, two extremely importProfessor Edward W. Berry<br />\nant national conferences between gave a lecture on \"The Structure<br />\nlabor and employers have been and- Age of the Andes,\" before the<br />\nheld, and in each ease, labor was „American Philosophical -Society of<br />\nprevailed upon to defer its plans Philadelphia on March - 5, and anfor direct action. Last fall, how- other on \"South American Experiever, a general railroad strike was ences and Impressions\" at Princecalled and could not be prevented ton \"niversity on March 8. He<br />\nby even the strenuous efforts of recent ly lectured before the Johns<br />\nthe delegates to the national con- Hopkins Field Club on \"Paleonference.<br />\ntology.\" Professor Berry has a<br />\nAt the present, according to Mr. most amusing. collection of anecWhyte, a saner view is coming dotes connected with the recent<br />\ninto •organized labor in England. Willia ins Memorial Expedition.<br />\nThe support which public opinion His fluent manner of speech makes<br />\nhas given the newly-formed labor him an unusually good lecturer,<br />\npolitical party has done much to since he keeps his audiences inalleviate the grievances of union- terested as well as amused from<br />\nized labor; so also has the public the beginning to the end of his<br />\nsentiment against general strikes addresses.<br />\nhelped to bring labor to a more<br />\nrational viewpoint. \"England is<br />\nnow confronted by bigger labor<br />\nproblems than ever before,\" concluded the lecturer, \"yet, in the<br />\nmatter of industry, the country<br />\nin 1920 is distinctly and substan1:1(1)ERS 7.11?:<br />\ntially better off than in 1914.\"<br /><br />\n7<br /><br />\nMANY LACROSSE STARS BACK<br />\nNine H Men on Hand This Spring—<br />\nRecord-Breaking Squad Out—<br />\nFirst Game With Cornell.<br /><br />\nThe prospects for a recordbreaking lacrosse team this year<br />\nare particularly bright. With the<br />\npresent improvement of weather<br />\nconditions it seems probable that<br />\nCoach Wolf will be able to whip<br />\nhis charges into splendid form before the opening of the season<br />\nwith. Cornell on April 3. At present, there are approximately 80<br />\nyoung athletes cavorting around<br />\nStraus Field at one time or another.<br />\nFor Spring<br />\nOf last year's team there are<br />\nnine men back. They are Captain<br />\nThe Liberty Hat $6.00<br />\nMeyer, Defandorf, Marley, Cashell, Hoffman, Stuart, Dougherty,<br />\nSilberstein and Sadtler. There is<br />\nTHE<br />\nli<br />\nstill - a possibility of \"Tiff\" Williams, now a medical student, reCollar Hug Clothes<br />\nturning to his old position at cenBaltimore and LiberfyStreets<br />\nter. It is not known yet whether<br />\nor not \"Sam\" Silberstein's work<br />\nwill keep him from going out for<br />\nthe team this year. If \"Sam\"<br />\nfinds it impossible to play, it<br />\nmeans that there will be three positions to be fought for among.the<br />\n\"subs.\" There are a• number of<br />\nFor aCen Who<br />\nnew men who are demonstrating<br />\nc-Chink<br />\nthat they will be ready to fill the<br />\nplace of any of the regulars should<br />\nthese waiver. However, it is very<br />\nunfortunate that many men, inN. HESS' SONS<br />\ncluding two very promising fresh8 E. Baltimore St.<br />\nmen have been rendered ineligible<br />\nby that jinx which always haunts<br />\ncollege athletics—the black list.<br />\nManager Keys has added another game to the schedule. This<br />\nStationers Engravers Printers<br />\nis the game with the Crescents on<br />\nJune 5. He is dickering with Fountain Pens<br />\nI. P. Note Books<br />\nToronto for a game on June 12.<br />\n229<br />\nPark<br />\nAvenue - Baltimore<br />\nThere is also an open date on<br />\nApril 17. which he hopes to fill<br />\nsoon.<br /><br />\nUALITYÔHOP<br /><br />\nHESS SHOES<br /><br />\nJ. H.SAUMENIG &amp; CO.<br /><br />\nFire in By-products Research<br />\nLaboratory.<br /><br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br /><br />\n,*<br />\nA fire, starting presumably from<br />\nan overheated flue, destroyed the<br />\ncontents of the By-products Research Laboratory on Thursday,<br />\nMarch 11, at about 2.15 P. M. A<br />\ngraduate student, U. 0. Hutton,<br />\nwas working in the laboratory<br />\nwhen the fire broke out in the<br />\nsecond story. Someone passing The Chas. Willms<br />\nSurgical Instrument Co.<br />\non Charles street saw the smoke<br />\n300 N. Howard St., Baltimore, Md.<br />\nand turned,jn an alarm. A crowd<br />\nSURGICAL INSTRUMENTS<br />\n.of students and others had gathHospital, Invalid and Microscopic<br />\nered by the time the firemen arSupplies.<br />\n\"<br />\nrhred. Although the smoke was<br />\nORTHOPEDIC APPLIANCES.<br />\nvery dense and the firemen experiCollege and Fraternity Stationery<br />\nenced difficulty in -breaking into<br />\nthe second story windows, since Banquet and Dance Cards—Invitations<br />\nthey were screened with stout<br />\nJAS. H. DOWNS<br />\nwire, they, soon had the blaze unENGRAVER — PRINTER — STATIONER<br />\nder control.<br /><br />\nE. E. ADAMS<br /><br />\n229 N. Charles Street<br /><br />\nCollars—Dozens of Styles—and Other Furnishings<br /><br />\nHUTZLER BRITIEM<br /><br />\nHoward Street<br />\nNear Saratoga<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 16, 1920.<br /><br />\n8<br /><br />\n-10ifOR0220ig<br />\n10:-fOOTA0Et0::0::0::0::0::0::011:0:#0:40::0-if0::0:f0:<br />\n:<br />\n%0LIOTIONOTL:0-<br /><br />\nSPRING SUITS FOR YOUNG MEN,<br />\nin patterns and models not to be had elsewhere.<br /><br />\nClothes ofiCustom Quality<br />\n14 N. CHARLES ST.<br />\nOBOCOMROT:OgONOEDEOPOltagaLIDEOE:000E0DOMOA0g0A0D0z ROPONOR<br />\nPEG I.15 PAT Off<br /><br />\nCOME TO<br /><br />\nTH—E7BEVERAGE<br /><br />\nNorthmittitrr tirtsblitrrian Ourril<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass in front of door)<br /><br />\nSatisfies the national<br />\ndemand for a wholesome, pure and appetizing beverage—at the<br />\nsoda fountain or with<br />\nyour meals.<br /><br />\nServices. 11 A.M.and8P. M.<br />\nMen's Bible Class. 9.45 A. M.<br /><br />\nCORDIAL WE<br />\nTO ALL STUDENTS<br /><br />\n(Srarp $c<br /><br />\nPeres Evitinipal<br /><br />\nMONUMENT ST. AND PARK AVE.<br />\nIli] The services on Sunday are at II o'clock and 8 o'clock. Seats will be reserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege of having you associated with us in our worship, and we hope that the benefit may be reciprocal.<br /><br />\nESTABLISHED 1873<br /><br />\nA. H.FETTING MAN'FG JEWELRY CO.<br />\n213 N. LIBERTY STREET<br />\nMARYLAND<br />\nBALTIMORE,<br /><br />\n\"ALL THINGS MUSICAL\"<br />\n417 North Howard Street<br />\nBALTIMORE, MD.<br />\nBAND AND ORCHESTRA INSTRUMENTS<br />\nVICTROLA SPECIALISTS<br /><br />\nThe last round was undoubtedly<br />\nDorsey's. In spite of his bad eye,<br />\nhe landed frequently and continuously forced his man to the ropes.<br />\nThe latter clinched often, and<br />\nseemed to be fast weakening.<br /><br />\nEEI<br /><br />\n77 7F Fr-W.--<br /><br />\nriff<br /><br />\nt<br />\n•\" '• \"' .<br />\n,<br />\nVIII<br /><br />\nVisitors-to St:Lossis aro invitod<br />\nto inspoct this mammoth institution.<br /><br />\n•<br /><br />\nBOOK<br /><br />\nMART)<br /><br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br />\nIMPORTERS AND DEALERS IN<br /><br />\nEstablished 1811<br />\nOldest Musical Instrument House In U. S.<br /><br />\nH. R. EISENBRANDT SONS, Inc.<br /><br />\n_ -<br /><br />\n(THE<br /><br />\nGREEK LETTER FRATERNITY JEWELRY<br /><br />\nST. LOUIS<br /><br />\n:;.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nMANUFACTURERS<br /><br />\nANHEUSER- BUSCH<br /><br />\nTriomf!!!ir-ir rr //-<br /><br />\nMinister<br /><br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Services at<br /><br />\nBevo will more than<br />\nsatisfy your thirst.<br /><br />\n„<br /><br />\nRev. David Carson Bayless<br /><br />\nf'nwimumin,m,4,Rou<br />\nbI*1<br />\n46:11,...131:k./<br /><br />\nFINE BOOKS<br /><br />\n301<br /><br />\nN. CHARLES<br /><br />\nSTREET<br /><br />\nBaltimore, Md.<br /><br />\nThe<br />\nNorman Remington Col<br /><br />\nBOOKS<br /><br />\nYou're Interested In<br />\nEvery Student Should Own<br /><br />\nWIN FIRST IN OPEN EVENTS<br /><br />\nSend Your Name for Monthly List<br /><br />\n(Continued from page I)<br /><br />\nCharles Street, at Mulberry<br /><br />\nbows in a way that might easily<br />\nbe objected to.<br />\nThe summary of the events in<br />\nwhich Hopkins men placed folDorsey deserved at least a draw. lows. The times do not seem to<br />\nFrom the first gong, he took the be very good, but the track must<br />\ninitiative and usually had his man be taken into consideration, as it<br />\nclose to the ropes. His chief trou- was very poor.<br />\n50-Yard Low Hurdles (Open)—Won by<br />\nble lay in the fact that he had LeGendre,<br />\nGeorgetown; second, Reinhardt, Virthird, Thompson, IIopkins, Time, 6 2-5<br />\nginia;<br />\nhis<br />\nseemingly no regard for what<br />\nseconds.<br />\nopponent could do to him, and<br />\n880-Yard Run (South Atlantic)—Won by<br />\nSbeenan, Georgetown; second, Auray, Georgewalked into many short jabs with town;<br />\nthird, McDonough, Georgetown; fourth,<br />\nEdwards, Hopkins. Time, 2 minutes 16 1practically no guard at all. How- seconds.<br />\n440-Yard Dash (South Atlantic)—Won by<br />\never, to many, it looked as though<br />\nLeGendre, Georgetown; second, Thompson.<br />\nDorsey gave at least one blow for Hopkins; third, Griffith, Georgetown; fourth,<br />\nTime, 61 2-5<br />\nForan, Catholic University.<br />\neach that he received.<br />\nseconds.<br />\nBartels, Hopby<br />\n(Open)—Won<br />\nMile<br />\nOne<br />\nGeary started well, and had the kins; second, Fitzgerald, Georgetown; third,<br />\nHazeltine, Hopkins. Time, 5 minutes 4 4-5<br />\nedge over Dorsey in the first seconds.<br />\nround. The second was very<br />\nTwo Mile Run (South Atlantic)—Won by<br />\nGantt, Virginia; second, W. Norwood, Hopclose, being marked with almost kins;<br />\nthird, McLaughlin, Catholic University;<br />\nfourth, Scally, Georgetown Time, 10 minutes<br />\ncontinuous clinching. Where Cap- 46<br />\n3-5 seconds<br />\nhigh Jump (South Atlantic)—Won by Feetain Mabbutt erred was in the<br />\nney, Georgetown, and Archer, Virginia, tied<br />\nthird round, which he evidently at 5 feet 9 3-4 inches; third, Bradley, Georgefourth, Hume. George Washington, and<br />\ngave to the soldier. Although the town;<br />\nWood. Hopkins, tied.<br />\n50-Yard Dash (Invitation)—Won by Griffith,<br />\n\"Kid\" did succeed in landing sevGeorgetown; second, DeLavergne, Catholic Unieral left jabs to the face, Dorsey, vergity; third, Thompson, Hopkins. Time<br />\nseconds.<br />\nin the opinion of many, easily 5 3-5<br />\n880-Yard Run (Open)—Won by Bartels,<br />\nsecond, Auray. Georgetown; third,<br />\nmade up for these with two hard Hopkins;<br />\nMawr, Georgetown. Time, 2 minutes 19 4-5<br />\nchin.<br />\nopponent's<br />\nhis<br />\nseconds.<br />\nuppercuts to<br />\n0.•<br /><br />\nLOSES BOUT BY DECISION<br />\nTed Dorsey Loses by Referee's Decision<br />\nto Kid Geary, of Fort McHenry, in<br />\nFast Four-Round Bout at the<br />\nAmerican Legion Circus.<br /><br />\nIn the fastest bout of the evening at the American Legion Circus last Saturday night, \"Ted\"<br />\nDorsey, a member of the Hopkins<br />\nBoxing Team, and representing<br />\nthe Central Young Men's Christian Association, lost the referee's<br />\ndecision to \"Kid\" Geary, of Fort<br />\nMcHenry. The match was for only four rounds, and Dorsey seemed<br />\nto be improving all the time, although he had taken quite a bit<br />\nof punishment and had had one<br />\neye closed by his opponent.<br />\nCaptain Mabbutt, the referee,<br />\nreceived a great deal of criticism<br />\nwhen he handed Geary thd decision, since the concensus of the<br />\nring-side opiriion seemed to be that<br /><br />\nJ. H. FURST CO•<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br /><br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\"\"Maryland Historical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br /><br />\nDOCTORS' DISSERTATIONS<br />\nIn Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages.<br /><br />\nWyman's<br /><br />\nThe Largest &amp;<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br /><br />\nMell's<br />\nShoes<br /><br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes,<br /><br />\n19 Lexington St.<br /><br />\nSole Agent for<br />\nthe Johnston &amp;<br />\nMurphy Shoes.<br /><br />"}], "field_media_file": [{"target_id": 37449, "display": null, "description": null, "target_type": "file", "target_uuid": "01749054-e357-4cd2-9dde-a3a8b311e81e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12914-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12914, "target_type": "node", "target_uuid": "19f60dd2-4a21-449d-8f6a-d879f2d8e5fb", "url": "/node/12914"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "36fd3e17-dcf3-47aa-9e6b-571283f301a4"}]}