{"mid": [{"value": 35538}], "uuid": [{"value": "0f65859b-1aa5-40b1-a27f-c80db7ff9548"}], "vid": [{"value": 35538}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12094-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol.<br />\n<br />\nL is I I. I<br />\n<br />\nNOVEMBER 11th, 1897.<br />\n<br />\nt 1 t<br />\n<br />\nt<br />\n<br />\nNo. 3.<br />\n<br />\ntbe<br />\n<br />\n3,idettisaifctitcr<br />\n<br />\nPublished by ,S'iucients of<br />\nPress of<br />\nog Cruggenheimer, Weil & Co.<br />\n<br />\nTHE JOHNS HOPKINS<br />\n+ UNIVERSITY<br />\n<br />\nISSUED<br />\n<br />\nBALTIMORE<br />\n<br />\nFORTNIGHTLY<br />\n<br />\n\fMetropolitan Savings Bank of Baltimore<br />\nInterest 4i per cent. per annum.<br />\nC. C. SHRINER, President.<br />\nJAMES J. RYAN, Treasurer.<br />\nBALTIMORE, December ist, 1896.<br />\nThe undersigned, a committee of examination appointed by the managers of the Metropolitan Savings<br />\nBank of Baltimore to investigate the affairs of said cor.<br />\nporation, and to make and publish a report ofsuch investigation, respectfully submit the following:<br />\nAmount of funds on hand December 1, 1895 ....<br />\n42,145,870 98<br />\nReceived from depositors during past year<br />\n1,457,261 48<br />\nReceived alvIdends from stocks and<br />\nbonds and interest<br />\nfrom loans<br />\n125,M5 93<br />\nTotal<br />\n$3,728,738 35<br />\nFrom which deduct as follows:<br />\nAmount paid depositors during past years...$1,503,794 70<br />\nt4tate and City taxes and expenses<br />\n20,208 95<br />\nPremiums on stocks and bonds<br />\n15,182 38<br />\n$1,539,134 03<br />\nLeaving funds December 1, 1898<br />\n$2,189,804 32<br />\nThe funds are invested in loans on real estate, stocks<br />\nand bonds, in the opinion of the undersigned abundan<br />\nsecured, and in the purchase of stocks and bonds of tly<br />\nthe.<br />\nmost substantial character. The stocks and bonds purchased are all held below their market value, and none<br />\nabove their par value.<br />\nThere were open December 1, 1895, 4,145 accounts;<br />\nthere were opened during past year 799 accounts, and<br />\nclosed during same period 746 accounts, leaving open<br />\nDecember 1, 1896, 4,198 accounts.<br />\nI CUMBERLAND DUGAN,<br />\nCommittee<br />\nDANIEL DONNELLY,<br />\nof<br />\nV. J. BROWN,<br />\nDirectors. I ALBERT T. MYER,<br />\nF. K. MURPHY.<br />\nIn accordance with Article IV, of the By-laws, the<br />\ninvestments have been examined by a committee NOT<br />\nCONNECTED WITH THE MANAGEMENT OF<br />\nTHE CORPORATION, who thus characterize them—<br />\nthe loans and investments have been safely and judi• ciously made, and the securities held are ample.<br />\nCommittee<br />\nE. AUSTIN JENKINS,<br />\nof NonB. F. NEWCOMER.<br />\nDirectors.<br />\nALLAN McSHERRY,<br />\n,<br />\n<br />\n..<br />\n<br />\n. ,s,n,,,,„.ror ap,-.)41C ' • . --'. 1ES<br />\n.f,rnui u\" r 5u PPI•<br />\n. a•,<br />\n',<br />\n0..,„/\".._<br />\n•<br />\n,„' ,„0/e00 el!.<br />\n, 1,0 '<br />\n.,.... ,.r.,.........!\"...\"..,.,, ik, JP, s 'ill iii!<br />\nir<br />\nI , '<br />\n<br />\nCameras & Supplies.<br />\nje<br />\n<br />\nDeveloping<br />\nand<br />\noe<br />\nPrinting.<br />\n<br />\nTHE CUMMINS<br />\n•..Ni CHARLE.S<br />\n.,.„., s<br />\n<br />\nTHE UNIVERSITY 5C111001. FM BOY'S<br />\nW. S. MARSTON, A. 11 and C'. E.,<br />\n<br />\n„HIS<br />\n<br />\nPrincipal.<br />\n<br />\n710 and 712 Madison Ave.<br />\n<br />\nSCHOOL prepares boys for almIseton to the Johns Hopkins or 'my<br />\n111,3versitY<br />\nScientific School. It has lined more than one hundred fur the John,<br />\niloplchos<br />\nMA many for Herverd, Vale, rrincetun,<br />\nthe Masaachusetts Institute of Technology, th•<br />\nTroy Polytechnic and other College. and Schools. In October,<br />\n1894-95,<br />\ntwo<br />\nof the tic.<br />\nectuderehlpe given at the John a hlopkine lo new 11101trialllitten<br />\n, were awarded to It. pupils. It<br />\nhe. It good laburetory and a well equipped gymnasium, whiuk is<br />\nunder the eheroe of It comp.<br />\ntent Ini,truotor. For further 1,0°111.00u or fur catalogue.,<br />\n&dares. the Principal, at No. in I<br />\nN. Calvert Street.<br />\n<br />\nB. G. EICHELBERGER,<br />\nBooK8 AND FINE STATIONFARY.<br />\n308 N. CHARLES<br />\n<br />\nST.<br />\n<br />\nY. M. O. •, /11111.1)1b111.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701, 703 and<br />\n705 Madison avenue,cor. Eutaw st. Telephone 817.<br />\n<br />\nCushing & Company, lii<br />\n<br />\nBOOKSELLERS<br />\n<br />\nAND<br />\n<br />\nSTATIONERS<br />\n<br />\n34 WEST BALTIMORE STREET.<br />\n1301100L, LAW, MEDICAL, AND CLASSICAL AND intiONLLANEOUS BOONS.<br />\nKeel. ounstently on hand the Text Books used In Johns Hopkluoi Untverelty,<br />\nJohn* Hopkins<br />\nHospital, and the Woniatt'a College of Baltimore.<br />\nSTATIONORY.—Por School, Fc,nIly, Office and 'lank.<br />\n<br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThe Johns Il_o_pkiits University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the ace. . demic year beginnitsg_October oat, 1897 may be had on application to the Registrar of thslohns Ii.spkins University.<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nTile announcements of thejohns Heykins Medical School may_also<br />\n• be had on application to the Registrars.<br />\n<br />\nPHOTO-STOCK CO,<br />\n<br />\n(<br />\n. \"BALT IMOR<br />\n<br />\n106 N. Charles St.<br />\n<br />\nMANDOLINS<br />\nGU!TARS<br />\n<br />\nAre used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nCalifornia. Iar Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin<br />\nand Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br />\nMANUFACTURED BY<br />\nF. H. GRIFFITH & CO.,<br />\nMention this paper when you<br />\ncall or write.<br />\n<br />\nAt SMITH'S BOOK EXCHANGE<br />\n,<br />\nyou can sell Text Books for Cash<br />\nor exchange them. A full line of<br />\nStudents Requisites always on hand.<br />\nCall,<br />\n805 N. HOWARD STREET,<br />\nTOREE DOORS ABOVit MADISON.<br />\n<br />\nYou Fairly Fly on<br />\n<br />\nKeating<br />\n<br />\na\"<br />\n<br />\n11111.110411010Mwromm.=....--<br />\n<br />\nGrand\"<br />\n<br />\nFactory and Salesro<br />\n<br />\n, 871 N. Howard St., Ilaftlinore, Md.<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nMadison & Howard Sts.<br />\n<br />\n. Text Books .<br />\n. Note Books .<br />\nStudents' Supplies<br />\nANIIIIMINIM1.11.1•1/<br />\n<br />\nIt's the Wheel of 'Wheels, with its<br />\nDouble Roller Chain--\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO„ IxI N. Charles St.<br />\n<br />\nBaltimore hardware Co., Baltimore tic Greene Sts.-Branch.<br />\n<br />\n\ftbe 1Rews lLetter.<br />\nFortnightly<br />\n<br />\nVol. II.<br />\n<br />\nSTUDENT LIFE AT EDINBURGH.<br />\nI.<br />\nIn the university city of Edinburgh a \"Town<br />\nand Gown Association\" was formed in the<br />\nyear 1896 for co-operative undertakings in the<br />\njoint interest of citizens and students. It was<br />\nfor the common good of city and university.<br />\nThe Association is a stock company representing academic interests for the purpose of providing residential halls or house accommodation for students and other persons connected<br />\neither with the University or with the liberal<br />\nprofessions. Although Edinburgh University<br />\nhas been in existence for more than two centuries, it has never enjoyed the benefit of college<br />\nhalls or hostels like those which have given<br />\nsuch architectural character and social charm<br />\nto Oxford and Cambridge. Students and professors have lived in Edinburgh wherever they<br />\ncould find lodgings. There has been no real<br />\nunity to academic life, no college centre or<br />\nLatin Quarter, where students live and educate<br />\none another in their own society—perhaps the<br />\nmost effective of all academic means of culture.<br />\nThe English colleges have always been strong<br />\nin social education, but here the Scotch and<br />\nGerman universities are weak.<br />\nTo remedy a long-standing and manifest defect in Edinburgh student life the Town and<br />\nGown Association was organized by the<br />\nenergy and enterprise of Professor Patrick<br />\nGeddes, who lives near the Outlook Tower on<br />\nCastle Hill and surveys from his charming<br />\napartments, at the top of an airy citadel, the<br />\nhistoric City of Edinburgh and the picturesque<br />\ncountry round about. While Professor Geddes<br />\nhas had in mind the need of better associated<br />\ncollegiate life in Edinburgh, he has also sought<br />\nthe material and architectural improvement of<br />\nthe city. It is well known by all visitors to this<br />\nancient capital of Scotland that the historic and<br />\n<br />\nNo. 3<br />\n<br />\npicturesque old town, extending from Castle<br />\nHill eastward to Holyrood, was until lately the<br />\nmost dilapidated and unsanitary part of the city.<br />\nMunicipal and architectural improvements,<br />\nwhich Professor Geddes has greatly promoted,<br />\nhave now transformed some of the worst of<br />\n'those ancient rookeries, narrow passageways<br />\nand noisome courts into spacious college halls<br />\nand modern apartment houses.<br />\nThe beginnings of this remarkable movement, which is at once \"civic and academic,<br />\narchitectural and educational,\" date from the<br />\nyear 1887. Then a new social life was instituted for students in Edinburgh by the renting<br />\nand furnishing of three small flats on the socalled \"Mound,\" which connects Old and New<br />\nTown. At first only seven students entered<br />\nupon this common or associated life ; but the<br />\nnumber increased and soon an entire house was<br />\nneeded to supply the demand. By a perfectly<br />\nnatural law of growth, and upon a sound business basis, the first residential hall in Edinburgh was established. It is now a studenthome for members of New College. In 1890<br />\nanother house WaS purchased in Riddle's court<br />\nand reconstructed for student-residents. In<br />\nthe same year was acquired an historic locality<br />\nonce occupied by the Scotch poet, Allan Ramsay, author of \"The Gentle Shepherd.\" Gradually a range of new houses was built on two<br />\nsides of Ramsay Garden, so that now there is a<br />\nlarge number of comfortable flats, or sets of<br />\nchambers, occupied by professors and their<br />\nfamilies, and a large building called \"Ramsay<br />\nLodge,\" with numerous rooms, occupied by<br />\nstudents in residence.<br />\nThe visitor in Edinburgh as he strolls along<br />\nPrinces street (said to be, for noble views, the<br />\nfinest street in Europe) will find himself looking upwards to that natural acropolis where<br />\n\"Edwin's Burgh\" gave name and fame to the<br />\nOld Town on the hill. Extending eastward<br />\nfrom the castle and the walls of the Esplanade<br />\n<br />\nA<br />\n<br />\n\fP.<br />\n<br />\n1<br />\n<br />\n2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nis an attractive range of buildings. These are ulation than I had read in books or heard in<br />\nthe most conspicuous beginnings of college lectures.<br />\nhalls in Edinburgh.<br />\nIn the College Hall at Ramsay Garden there<br />\nFrom my hotel on Princes street I moved, was in August and September a considerable<br />\nbag and baggage, in a cab, one afternoon in number of medical students in residence.<br />\nAugust, to \"Ramsay Lodge,\" on the heights, These men were an entertaining source of sowhere students attending the Edinburgh Sum- ciological and academic information. We met<br />\nmer School were quartered. I had previously<br />\nat least three times daily, for we all boarded in<br />\nmade arrangements with Mr. Marr, the secre- commons. The dining hall was in the basetary ; and the matron of the College Hall at ment, where a substantial dinner was served at<br />\nRamsay Garden promptly assigned me to a the close of day. Breakfast and luncheon were<br />\nlarge, airy room looking northwards across simpler and more frugal than in America. The<br />\nPrinces street, beyond the New Town and to- \"halesome parritch, chief of Scotia's food,\" we<br />\nwards the Firth of Forth and eastward towards enjoyed every morning, with good coffee,<br />\nCalton Hill, with its crown of historic monu- which every student poured out for himself.<br />\nments in memory of Robert Burns, Dugald<br />\nThere was always some hot dish or cold meat<br />\nStewart, and other celebrities. It was worth a at both breakfast and luncheon, with, of course,<br />\nlong journey to Edinburgh to behold that bread and butter, and marmalade from Dunmagnificent prospect, which I enjoyed morn- dee. All these meals were served by Scotch<br />\ning, noon and eve. There before my very eyes spinsters of safe age, austere looks, and undisI could read Scotch history backward from the puted moral character, who treated the boardliving present to the time of King Edwin, on ers with a certain cold Scotch severity, somewhose very hill I was lodging. Ramsay Gar- times preventing the enjoyment of two porden lies close to the ancient burgh or castle, tions. Students are allowed in Scotland, as in<br />\nwhich still shelters the chapel of Queen Mar- England, to have wine and beer at their own<br />\ngaret, the oldest church in Scotland. From<br />\nexpense, but very little drinking is done. After<br />\nmy northern windows I could look away to- luncheon and after dinner the company adwards the Queen's Ferry, over which Margaret journed to the common room, just above the<br />\nand her children, rescued from siege and car- dining hall, and helped themselves to coffee,<br />\nried down the crags one night, were safely read the papers, played on the piano, sang<br />\ntransported into the adjoining kingdom of Fife. songs, and amused themselves in conversation<br />\nThere below me at the foot of Castle Hill lay for a little while before dispersing to their<br />\noutspread the beautiful gardens which occupy rooms and their work.<br />\nthe basin of the old North Loch. It was a rare<br />\nHERBERT B. ADAMS.<br />\npleasure, on a sunshiny Sunday afternoon, to<br />\n[TO BE CONTINUED.]<br />\nwatch from those ancient heights the happy<br />\nmodern groups of people—men, women and<br />\nchildren—on the green hillside and in the gardens below. The great parks of Chicago, New<br />\nMr. C. C. Clark,'96, is teacher of French and<br />\nYork, Philadelphia and Baltimore have shown German at the Naval Academy of the Great<br />\nme greater crowds of happy people in summer, Lakes, Toledo, Ohio.<br />\nbut nothing so picturesque as those grassy<br />\nslopes of Edwin's Burgh all alive with children<br />\nMr. Blake, in behalf of The '97 Hullabaloo,<br />\nand their admiring parents. I spent one entire has given Mr. Harwood $44.5o net profits of<br />\nSunday afternoon among people on the hillside<br />\nThe '97 Hullabaloo, to be divided equally beand in the gardens below. I learned more of tween the General Athletic, Baseball, Footthe characteristics of Edinburgh's mixed pop- ball, Lacrosse and Hockey Associations.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nNEWS OF A FORTNIGHT.<br />\nCONORESSIVE SESSION.<br />\n<br />\nThe first regular meeting of the Senate,<br />\nwhich was held November 3, was honored by<br />\nthe presence of Dean Griffin, who expressed<br />\nhimself as much pleased with the work. The<br />\nmeeting proved how much practice in debating<br />\nis needed by the Senators. Several of the debaters were seized with stage fright, and found<br />\nit difficult to speak without stumbling over<br />\nwords and making awkward pauses. This fault<br />\nis common to all beginners, and will surely disappear with practice. Time that might have<br />\nbeen used in debate was lost in calling the roll<br />\nand reading the minutes of the previous meeting. Hereafter the roll will be taken silently—<br />\nthat is, the clerk will simply mark the absence<br />\nof members without calling the names. The<br />\nminutes will be referred to the Censor. In this<br />\nway it will be possible to begin the debate five<br />\nminutes after opening the session. As the Senate ages, the members will settle to their work,<br />\nand the slight breaches of decorum that mar<br />\nthe proceedings of any forensic body will be<br />\neliminated. On the whole, the first meeting<br />\nof the Senate may be pronounced a success.<br />\nThe current debate was won by the affirmative,<br />\nrepresented by Messrs. Lucke, Renouf and E.<br />\nSmith.<br />\nThe subject for the next debate is:<br />\n\"Resolved, That the result of the work of the<br />\npresent United States Bimetallic Commission<br />\nought to definitely settle the discussion of the<br />\n'Silver Question.'\"<br />\nSenators Fisher, Fitzgerald and R. D. Miller have the affirmative ; Senators Ballard,<br />\nWhitehead and Cook the negative.<br />\nThe first regular meeting of the House of<br />\nRepresentatives was held Wednesday, October 26. Speaker French presided. The use of<br />\na gavel, a valuable old Indian relic, was tendered to the House by Dr. Adams. The Censor announced that Dr. Adams had also given<br />\nthe use of the Southern History room for the<br />\ndebaters. The House moved that a vote of<br />\nthanks be given to Dr. Adams. The main interest of the meeting centered in the debate :<br />\n<br />\n3<br />\n<br />\n\"Resolved, That municipal government be independent of national party lines.\" The affirmative was taken by Messrs. Smull, Jones,<br />\nVer Planck and M. Jungbluth ; the negative<br />\nby Messrs. Mullen, Grimes, Gemmil and Joyner. The House decided on the merits of the<br />\ndebaters that the negative side had won. The<br />\ndebate for next time was given to Congressmen Fosnocht, Frank and Greenbaum for the<br />\nnegative, and Congressmen Levering, Kalb<br />\nand Gaddess for the affirmative. In parliamentary law the following appointments were<br />\nmade: Leader of attack, H. Grimes; leader<br />\nof defense, C. Remsen.<br />\n<br />\nnusicAL CLUB'S CONCERT.<br />\nThe University Banjo and Mandolin Clubs<br />\ngave the first concert of the season on Friday<br />\nevening, November 5, at Hannah More Academy, near Reisterstown. The trip was made<br />\non a special car over the new Baltimore and<br />\nNorthern Electric Railroad.<br />\nThe occasion of the concert was the opening<br />\nof Wyman Hall, which was filled by a large audience drawn from Baltimore, Pikesville and<br />\nReisterstown. The clubs played well and were<br />\nheartily received by the audience. The new<br />\nmen give promise of ranking among the best<br />\nplayers in the clubs, and there is no reason<br />\nwhy, under the leadership of Mr. Peters and<br />\nwith a full attendance at practice, this year's<br />\nclubs should not excel those of '93-'94 and<br />\n'96-'97, the best in the history of Hopkins.<br />\nMr. Harwood and Mr. Clunet made a great<br />\nhit with their new songs.<br />\nThe vocal parts were ably given by Miss<br />\nStarr, the composer of the music of \"Veritas<br />\nVos Liberabit,\" and Mr. Frank Taylor, the<br />\nwell-known soloist of the club. Mr. Edwin L.<br />\nTurnbull gave two selections on the violin.<br />\nAfter the concert there was dancing, kept<br />\nup until the men were compelled to leave, carrying with them pleasant memories of the hospitality of Hannah More.<br />\nDr. Hollander, of the Economic Department, has just returned from Europe, where<br />\nhe served as secretary of the Bimetallic Commission.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n4<br />\n<br />\nbe pettioALetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nNOVEMBER ii, /897.<br />\nSubscription $1.30 per year. 15 cents a single copy.<br />\nEditor in Chief,<br />\n<br />\nEDGEWORTH SMITH,'98.<br />\nAssistant Editor in Chief, - - ALBERT C. DIEPYRNuacii,'98.<br />\nConsulting Editors, -<br />\n<br />\nProf. KIRBY P. SMITH.<br />\nGEO. C. MORRISON,'90.<br />\n<br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RAbcir.IFFE,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONOCOPE, Medical School.<br />\nV. A. RIFINOUF,<br />\nR. D. MILLER,'98.<br />\nJ. C. PRENCII,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, '99.<br />\nBusiness Manager,<br />\nR. H. GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br />\n<br />\nors of the Athletic Association, and a finance<br />\ncommittee, consisting of the president, the<br />\ntreasurer, one alumnus and the manager of the<br />\nteam, whose duties shall be to arrange a schedule and govern the finances of that team. This,<br />\nit will be seen, has an appearance of fairness<br />\nand will insure the team's being governed in a<br />\nbusiness manner.<br />\nLet the committee arouse the alumni by<br />\nplacing them in the Association. If they see<br />\nthat they are not forgotten by their successors<br />\nin university life, they will not be backward in<br />\nhelping in a material way. But the Association must be general it must as nearly as possible represent every student of the institution.<br />\nLet the good work be given an impetus, and<br />\nour alumni will meet us more than half way.<br />\n<br />\nTRAINING AND HONOR.<br />\nNEW ATHLETIC ASSOCIATION.<br />\n<br />\nOne of the best efforts in athletics at Hopkins is the proposed reorganization of the Athletic Association. Up to the present time the<br />\nseveral other athletic societies which have been<br />\nindependent of it have amounted to nothing.<br />\nEach one is simply a name. It is true that they<br />\ndo choose officials for the teams, but even this<br />\nthey sometimes do most unwisely. It is a palpable blunder for a body of several delegates to<br />\nelect the leader of a team. The team itself<br />\nshould choose the captain. Another serious<br />\ndefect in the several associations was that there<br />\nwas no business responsibility and no authority. In short the manager was the association,<br />\nwith all rights and abuses thereto appertaining.<br />\nThe new association should have a constitut.ion which provides for a strong centralization,<br />\nand the alumni should be represented. By<br />\nbringing all departments of sport under one<br />\ngovernment there is the advantage of having a<br />\nreliable organization to guide the teams and<br />\nthe managers. Then we should have such a<br />\nrarity as system. All that is necessary in the<br />\nassociation is a representative membership.<br />\nTwo of the salient features proposed are the<br />\nelection of the managers by the board of direct-<br />\n<br />\nUnpleasant rumors are going about. It is<br />\nsaid that certain members of the football team<br />\nhave been smoking. This is a deplorable state<br />\nof affairs. It is right for the students to<br />\nobject. So long as the players keep in good<br />\nphysical condition there will be sympathy and<br />\nsupport in case of defeat. But if the men do<br />\nnot train they cannot expect to win, and they<br />\ndeserve to be \"roasted\" by the students. We<br />\nhope that the reports of the violations of rules<br />\nare untrue. In training for a team the adherence to a pledge is a matter of honesty. There<br />\nis no absolute prevention if a man cares to<br />\nsmoke or in any other way violate the rules.<br />\nThe point to appreciate, then, is that honor is<br />\njust as necessary on the football team as in the<br />\nexamination room, and a violator should be<br />\ntreated accordingly.<br />\n<br />\nIt is interesting to note the prominent part<br />\nplayed in the late election by former Hopkins<br />\nstudents. One graduate, who, while a student<br />\nat the Hopkins, impressed everyone by his extremely retiring disposition, stumped New<br />\nYork City for Low on street corners and from<br />\nthe back of grocery wagons.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n!ATHLETICS.<br />\nENTHUSIASTIC rtAss METING.<br />\nA mass-meeting of the students was held in<br />\nHopkins Hall October 29 to discuss and consider the reorganization of the General Athletic Association. The assembly decided upon<br />\ntwo points, which, it is believed, will further<br />\nthe interest of athletics at the University. An<br />\neffort will be made to centralize the several<br />\nathletic associations which now exist, each<br />\nunder separate government, and, second, the<br />\nstudents will earnestly strive to procure a field.<br />\nPresident Edward Renouf was chairman<br />\nand Dr. J. B. Crenshaw was secretary. The<br />\nPresident discussed the situation of the separate organizations, and showed clearly that unless these associations were put under one head<br />\nathletics at the University could never have a<br />\nfuture.<br />\nAt present there exist the Football Association, the Lacrosse Association, and the Baseball Association. Several speeches were made,<br />\nall proving that these several organizations<br />\ncould no longer exist as such. It was shown<br />\nthat the associations had done almost nothing<br />\nfor athletics; that they were mere paper associations, and, beyond assembling for the annual<br />\nelection of the managers and captains, did absolutely nothing. The responsibility rested<br />\nalone on these men, and, if debts were incurred, they alone received the blame.<br />\nTo obviate this, it was decided that the President appoint a committee of seven students to<br />\nascertain how the students felt on this point,<br />\nand to draw up a constitution for the proposed<br />\nreorganization.<br />\nThe committee consists of J. 13. Crenshaw<br />\n(chairman), Hancock, Reese, Dieffenbach,<br />\nScholl,'Grimes, G. C. Robinson and Foster.<br />\nThe heavy beams which will support the<br />\nroof of the cage are in position and the building now gives an idea of what it will be when<br />\nfinished. It will require only a few weeks to<br />\ncomplete the structure. The gymnasium will<br />\nnot be ready for occupancy so early on account of the interior work.<br />\n<br />\n5<br />\n<br />\nVICTORIES AT GEORGETOWN.<br />\n<br />\nJohns Hopkins won two events and got second place in another at the Georgetown games<br />\non Saturday. Robert Garrett was the chief attraction of the day, and his feat with the<br />\ndiscus brought out much applause. Scholl<br />\nwon the high jump, Garrett won at discusthrowing,and was second in the running broad<br />\njump. Knapp was put in a preliminary heat<br />\nwith Wefers, champion of the world, in the<br />\nioo-yard dash, and failed to qualify in the<br />\nfinal. In the discus event Garrett did not exert<br />\nhimself, and won easily at 107 feet 7 inches.<br />\nScholl cleared 5 feet 5 inches in the high jump<br />\nin good form. In the running broad jump the<br />\nmeasuring was decidedly favorable to Georgetown. When Garrett and Scholl jumped the<br />\ntape was drawn taut, but the home competitor,<br />\nWalsh, was given a slack tape twisted several<br />\ntimes. The event was nevertheless a notable<br />\none, for Garrett broke the Maryland record<br />\nmade by him-2I feet 91 inches. He beat this<br />\nby an inch and a half. Scholl made 21 feet<br />\ninches, breaking his own record by eighteen<br />\ninches. Walsh was credited with 22 feet<br />\ninch. About forty rooters went over to cheer<br />\non the men. Incidentally, they gave .the other<br />\ncolleges represented a few pointers as to college yells.<br />\nFOOTBALL.<br />\nHOPKINS 0-W. M. C. 10.<br />\n<br />\nW. M. C.<br />\nPositions.<br />\nJ. H. U.<br />\nThorpe<br />\nRight End.<br />\nTalty<br />\nFrancis... ...Right Tackle... ...Stoffer<br />\nRight Guard ..... . .Reese<br />\nKennard...<br />\n.Tagg<br />\n.Centre<br />\nHancock<br />\nRushmore.. ....Left Guard.... ....L Wells<br />\nLazenby.. . ..Left Tackle.. .....C Baker<br />\n.Patton<br />\nArmstrong (f. b.). Left End.<br />\nWells<br />\nL.<br />\n0.<br />\n..B.<br />\n...Quarterback<br />\nMullen....<br />\n.Smith<br />\nGuggenheimer..Left Halfback.<br />\nZepp<br />\nRobinson(f.b.)..Right Halfback.<br />\n.<br />\n.<br />\nHalfback<br />\nRight<br />\n.<br />\nBouschelle<br />\nFullback ...H. D. Baker(C.)<br />\nHodges.<br />\nTouchdowns—Patton, Smith. Goal—H. D.<br />\nBaker.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nAt the kick-off Hopkins advanced the ball<br />\nHodges played a magnificent game. He<br />\nnear the centre of the field. They steadily made gains right and left, and bucked the line<br />\nforced their way to W. M..C.'s five-yard line, with good effect.<br />\nwhen the ball went over on a questionable offRobinson, Hodges and Francis were the<br />\nside play. W. M. C. then took a brace and star tacklers, while Haulenbeek and Talty<br />\nbefore the half closed Patton forced the ball made good runs.<br />\nover Hopkins' line for a touchdown, H. D.<br />\nArmstrong kicked all five goals, but was a<br />\nBaker kicking goal.<br />\nlittle off in his punting.<br />\nThe line bucking of W. M. C. is the most<br />\nThe team needs practice in interference,<br />\neffective encountered by the team this year.<br />\npassing and catching the ball. There was too<br />\nThe grounds were wretched, in parts cov- much fumbling.<br />\nered with stones. The goal line was protected<br />\nSeveral alumni coached the team in the latby a steep incline, which twice frustrated Hop- ter part of the second half.<br />\nkins' efforts to cross it.<br />\nM. A. C.'s goal was due to a bad pass early<br />\nBouschelle as substitute deserves mention in the game.<br />\nfor his creditable work.<br />\nRushmore, Medical School, is a good one.<br />\nHopkins was unfortunate in not having<br />\nBouscaren, for M. A. C., put up a good<br />\nCaptain Brady. Hodges, acting captain, was game.<br />\ninjured and the team considerably weakened.<br />\nCaptain Hodges resigned after the game,<br />\nArmstrong, Robinson and Mullen played well and Brady was elected in his place.<br />\nthroughout. For Western Maryland Zepp,<br />\nSWATHMORE I6—HOPKINS o.<br />\nSmith and H. D. Baker excelled. This makes<br />\none victory and one defeat in the pennant race.<br />\nAll the scoring in this game was done in the<br />\nfirst half. The second half was nip and tuck,<br />\nHOPKINS 30—M. A. C. 6.<br />\nthe game ending with the ball in the centre of<br />\nThe 'Varsity eleven won a brilliant victory the field. Everybody played<br />\nsteadily, and Robover the Maryland Agricultural College in the inson, Francis and Hodges<br />\nespecially distinfirst game of the intercollegiate series for the guished themselves.<br />\nThe victory was due to<br />\nState championship. It was Hopkins' game Swathmore's superior<br />\nity in weight.<br />\nfrom the kick-off. The college team was<br />\nrouted at every point and could score only one<br />\n\"Bad Story-Telling,\" an article by Mr.<br />\ntouchdown, and that on a fluke, against Hop- Frederic M. Bird in<br />\nOctober Lippincott's, may<br />\nkins' five. The 'Varsity eleven kept the ball be interesting in connect<br />\nion with THE NEWScontinually in the opponents' territory, and<br />\nLETTER'S prize story offer. Mr. Bird counsels<br />\nwithout halting or wavering carried it steadily the young story writer<br />\nto look for material<br />\ntoward the M. A. C. goal, ploughing through<br />\nnear at hand and to write about things with<br />\nthe line, breaking up interference, and making<br />\nwhich he is familiar. He suggests the South<br />\ncontinual gains around the ends. The men and West as fields not<br />\nyet worked out, and calls<br />\nplayed together with clock-like regularity, the attention to the present<br />\nfad for fiction founded<br />\nbacks tackled well, and the line stood as firm as on American history.<br />\n\"Whatever you do,\"<br />\na rock. The visitors played well, but were out- he says, \"take pains<br />\nwith it. Put your best<br />\nclassed at every point. There was a slight dif- work into every sentenc<br />\ne. If you are too lazy<br />\nference in the weights of the teams, favorable and careless to do<br />\nthat, better go into trade or<br />\nto the 'Varsity, but Hopkins won the day by politics.\"<br />\nher superior team work and individual play.<br />\nFrancis was the hero of the day. He was<br />\nEfforts are being made to secure the serveverywhere. He made a beautiful run of sixty ices of Messrs.<br />\nRobinson and McGraw to<br />\nyards for a touchdown, besides scoring two coach the 'Varsit<br />\ny baseball team when the<br />\nothers.<br />\ncage is finished.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nIN THE LAND OF THE CZAR.<br />\nDr. William B. Clark, professor of geology<br />\nin the Johns Hopkins University, has just returned from Russia, where he has been in attendance upon the International Geological<br />\nCongress in St. Petersburg. He bore the credentials of the Secretary of State as one of the<br />\nsix national delegates from the United States,<br />\nand also an appointment from the Governor<br />\nof Maryland to represent the State as State<br />\nGeologist.<br />\nAn international congress is held every three<br />\nyears at one of the leading cities of the world,<br />\nthe first congress being held in Paris in 1878.<br />\nSubsequent congresses have been held at Bologna, Berlin, London, Washington and Zurich. The invitation to hold the seventh Inter1Lati9nal Congress at St. Petersburg was presented in the name of the Czar by the Russian<br />\nrepresentatives at the Washington Congress<br />\nin 1891, and was at once accepted by that Congress. Assurances were given of most cordial<br />\nwelcome on the part of the Russian Government and people. How sincerely these assurances were meant is shown by the marvelous<br />\nhospitality with which the delegates to the International Congress at St. Petersburg were<br />\ngreeted. Free tickets upon all Russian transportation lines were granted to the members of<br />\nthe Congress, so that after reaching the borders of Russia no expenses for railway and<br />\nsteamboat travel were incurred. Orders were<br />\nalso given to the customs officials to pass the<br />\nmembers of the Congress without inconvenience.<br />\nThe Congress opened upon August 29 in<br />\nSt. Petersburg, with somewhat over 600 delegates in attendance, representatives being present from nearly every country of the world.<br />\nThe Germans and French were much more<br />\nnumerous than the representatives of other<br />\ncountries. About forty American geologists<br />\nwere present, among them the aged Professor<br />\nHall, the State Geologist of New York; Professor Marsh, of Yale University, and Professor S. F. Emmons,of the United States Geological Survey.<br />\n<br />\n7<br />\n<br />\nAmong the distinguished Europeans were<br />\nSir Archibald Geikie, who lectured at the University on the Williams foundation last spring;<br />\nBaron von Richthofen, of Berlin; Prof. von<br />\nZittel, of Munich ; Professor Zirkel, of Leipsic ; Professor Capellini, of Florence ; Professor Brogger, of Christiania, and many others.<br />\nThe Congress was opened with an addres by<br />\nthe Grand Duke Constantine, a cousin of the<br />\nCzar, and remained in session a week, during<br />\nwhich time the delegates were elaborately entertained, the Czar giving a great banquet in<br />\nhonor of the Congress at Peterhof. The members of the Congress were also elaborately entertained by the Grand Duke Constantine, the<br />\nGovernor of St. Petersburg, and the other<br />\ncelebrities. During the session of the Congress<br />\nthe members visited Finland at the invitation of<br />\nthe Senate of that country, a day being spent at<br />\nthe Falls of Imatra, where a state dinner was<br />\ngiven in honor of the visitors.<br />\nAt the close of the Congress the members<br />\nwent to Moscow, where, after a few days' visit<br />\nin that city, they divided into three groups,<br />\neach party journeying to Vladikavkaz at the<br />\nbase of the Caucasus Mountains by different<br />\nroutes. Professor Clark accompanied the<br />\nVolga party, going first to Nijni Novgorod,<br />\nwhere the great Russian fair was visited. At<br />\nthis point a steamer was taken down the Volga,<br />\nnumerous stops being made by the party to<br />\nexamine the geology of the country traversed.<br />\nA journey of 1124 miles was made in this manner, the party leaving the boat at Tzaritzin,<br />\nand thence proceeding by rail across the<br />\nsteppes of Central and Southern Russia to<br />\nVladikavkaz.<br />\nThe Caucasus Mountains were crossed by<br />\nthe Russian military road in carriages, and<br />\nunder escort of a Cossack guard. Four days<br />\nwere consumed upon this journey, all other<br />\ntraffic across the highway being suspended by<br />\norder of the Russian Government. Arriving at<br />\nTiflis, the Capital of Georgia, several days were<br />\nspent in examining this wonderful city and its<br />\nimmediate surroundings. Numerous festivities were arranged by the residents in honor of<br />\ntheir guests.<br />\n<br />\n4<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe party next visited the great Russian oil Plumian professorship of astronomy and exfields at Baku, on the shores of the Caspian perimental philosophy at Cambridge, and is a<br />\nSea, a short trip from that point being made by member of the council of the Meteorological<br />\nsteamer. Returning to Tiflis the party pro- Office.<br />\nceeded thence to Batoum on the Black Sea,<br />\nPresident Gilman made the historical adwhere a Russian vessel was in waiting. The dress in celebration of the fiftieth anniversary<br />\nlast ten days of the Congress were spent upon a of the Sheffield Scientific School<br />\nat Yale Unitrip along the Eastern and Northern coast of<br />\nversity on Thursday, October 28. He was<br />\nthe Black Sea, several short trips being made formerly a member<br />\nof the faculty of the school.<br />\ninto the interior of the Crimea, where the sumThe<br />\nNovember<br />\nweek<br />\nof<br />\n14-20 will be obmer homes of the wealthy and noble Russians<br />\nserved by all the Young Men's Christian Asare to be found. Yalta, the Bar Harbor of<br />\nsociations in the country as a week of prayer.<br />\nRussia, the battle-field of Balaclava and SeThe University Association has arranged for<br />\nbastapol, were visited. The journey ended at<br />\nshort prayer-meetings every day of that week<br />\nOdessa, where the final session of the Congress<br />\nin the chapel at 12.55 o'clock. The meetings<br />\ntook place upon October 6.<br />\nFrom Odessa Professor Clark went to Con- will not exceed fifteen minutes in length, and<br />\nwill be led by members of the faculty.<br />\nstantinople, and thence by way of Bulgaria and<br />\nThe class of 19oo has completed its organServia back to Central Europe.<br />\nThe Johns Hopkins University was repre- ization by the adoption of a constitution and<br />\nsented at the Congress by both Professor Clark the election of the following officers: Presiand Dr. Reid, who made interesting collections dent, Frederick Foster ; vice-president, Willof specimens for the geological museum of the iam P. Shriver ; secretary, John Philip Hill;<br />\ntreasurer, Harry D. Hill ; sergeant-at-arms, I.<br />\nUniversity.<br />\nH. Francis; delegate to the Matriculate Society, James L. A. Burrell. Executive comThe class of '98 held its first meeting of this mittee—The President, John Wheeler Griffin,<br />\nyear on Wednesday, October 27, and elected C. T. Clarke, Morvin Lindheim, Ronald Aberthe new officers.' Mr. Fitzgerald was elected crombie, Charles B. Wirt and Charles Edward<br />\npresident, Mr. Clarke vice-president, Mr. J. H. Brooks. The election of class poet, artist and<br />\nPalmer treasurer, and Mr. Seth was re-elected historian is to be by competition, and has been<br />\nsecretary. The other offices were filled as fol- put into the hands of Messrs. Shriver (chairlows: Historian, Mr. Renouf ; delegate to man), Eager, James, White and Moore. The<br />\nMatriculate Society, Mr. E. L. Palmer ; dele- committee's awards will he made December I.<br />\ngates to General Athletic Association, Messrs. The class colors are maroon and white ; the<br />\nScholl and Clarke; delegates to Football As- class pin has not yet been chosen.<br />\nsociation, Messrs. Clunet and F. W. Smith ;<br />\nThe Christian Herald and Signs of Our<br />\ndelegates to Lacrosse Association, Messrs. Times for October 27 publishes an illustrated<br />\nClunet and F. W. Smith; delegates to Base- article, an allegory, entitled, \"The Island of<br />\nball Association, Messrs. Clarke and Swaine. Symbols,\" by Mr. Charles K. Edmunds. Mr.<br />\nProfessor George Howard Darwin, the sec- Edmunds represents the graduate scientific<br />\nond son of the late Charles R. Darwin, is vis- departments in THE NEWS-LETTER staff.<br />\niting the University this week. He is interAt the Mendelssohn memorial concert given<br />\nested chiefly in the Department of Physics by the Oratorio Society of Baltimore in Music<br />\nand in Professor Rowland's work. Professor Hall November 4, President Gilman made a<br />\nDarwin is a well-known scientist, and author short address and unveiled a portrait of the<br />\nof many papers referring to geology, astron- composer, a gift to the Society from Baron<br />\nomy and the theory of tides. He holds the Ernst Mendelssohn, his lineal descendant.<br />\n<br />\n1<br />\n<br />\n\fThe Boy8' Latin SG hool f<br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Hood IVIrtster.<br />\n<br />\n--This school has a continuous history of over fifty years .<br />\nIt was reorganized under its present management<br />\nin 1894.<br />\n<br />\nTelephcne Call 1822.<br />\n<br />\nFAitablished 188U.<br />\n<br />\nARTHUR F. LAWRENCE & CO.<br />\nLeading Dealers in<br />\n<br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br />\n<br />\n6 W. SARATOGA STREET,<br />\nY. M. C<br />\n<br />\nA. BUILDING,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nSAVINGS DEPARTMENT.<br />\n<br />\nCAPITAL, $100.000.<br />\n<br />\nMaryland CRle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE<br />\nTELEPHONE 1376.<br />\nT. K. WORTHINGTON,<br />\nL. M. DUVALL,<br />\nJUSSH HILT,ES<br />\nSeey-Treas.<br />\nVice-President.<br />\nPresident.<br />\n<br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br />\n<br />\nCOMMONWEALTH BANK,<br />\nEUTAW S'f.. FACING MADISON.<br />\nJORN R. HOOPER,<br />\nCEO. YAKEL,<br />\nJAB. E. WHEELER,<br />\nCashier.<br />\nVice-Prest.<br />\nPresident.<br />\n--- DIRECTORS.<br />\nJefferson J. Walsh,<br />\nLouis Yakel,<br />\nJohn N. Matthews,<br />\nJordan Stabler,<br />\nDr. T. A. Ashby, George A. BIHke.<br />\nJames R. Wheeler,<br />\nRobert Biggs,<br />\nJames H. Preston,<br />\nJease F. Ely.<br />\nMurray Vandiver,<br />\nJ. if. Ober,<br />\nGeorge Yokel.<br />\nJos. U. Valiant.<br />\nM. II. Ould,<br />\nLarge or small earns, for long or short periods, received on favorable<br />\nterms. Call at the Bank for information.<br />\n<br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br />\n<br />\nGIFFORD de JERSEY MESNY,<br />\n<br />\nDIRECTORS:<br />\njohn A. Whitridge,<br />\nEdgar G. Miller,<br />\nAlexander Brown,<br />\nJesse [lilies,<br />\n'Thomas Hill.<br />\nGeorge Whiteiock,<br />\nU. H. Perkins,<br />\nC. C. Shriver,<br />\nJacob I. Cohen,<br />\nT. K. Worthington.<br />\n14. Goldenberg,<br />\nRates for Title Insurance furnished on application.<br />\nWhen politicians ranted loud<br />\n\"Hear! Hear!\" is what we uttered;<br />\nBut now since football holds the crowd<br />\nY. M.13. 0. D.<br />\n\"Hair!\" Hair!\" is softly muttered.<br />\n<br />\nEvery visitor who \"drops in\" to our store becomes a<br />\nregular customer. Why? Because he sees at once<br />\nthat he can save money by dealing with us. Good<br />\nclothes and cheap prices is a combination hard to beat.<br />\nWAS ever before in Baltimore such a bargain as these<br />\n$to Cassimere-lined Satin-top Suits? Hundreds of<br />\nased purchasers will gladly answer\"No!\" These<br />\nStilts are all carefully made and of handsome material.<br />\nThey are going like hot cakes.<br />\nTHAT Top Coat you promised yourself! Forgotten<br />\nabout it, eh? Well, we have some extremely handsome goods in that line, but we can't tell you how soon<br />\nthey'll be gone. From Po to 1620-every fashionable<br />\nshade.<br />\nUNDERWEAR—How about it? We guarantee comfort<br />\nthat means everything. Prices from 50c. to $2.50.<br />\nWORSTED TROUSERS at $3.50. Surprising how quickly<br />\npeople snap up a genuine bargain.<br />\nA well-fitting shirt puts a man at peace with the world.<br />\nThe Star Shirt fits like a glove $1.50.<br />\n<br />\nArtist Photographer,<br />\n226 NORTH CHARLES STREET.<br />\nBuy your<br />\n<br />\nGeo. P. Mordecai,<br />\nlice-President.<br />\n<br />\nArthur H. Hall,<br />\nSee'y and Truss.<br />\n<br />\nThe A.G. Alford Sporting Goods Co.<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\n113.4111TIMOICE, MD.<br />\n<br />\nTelephone 2573.<br />\n<br />\nfrom<br />\n<br />\nfiEvALD<br />\n639<br />\n<br />\nNORTH EUTAW<br />\n<br />\nST., NEXT<br />\n<br />\nDoos<br />\n<br />\nUNIVER•ITY<br />\n1.1<br />\nTO -OPKIMIX<br />\n<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\nGIVE us A CALL.<br />\nALL THE<br />\n<br />\ntatConEfY<br />\n<br />\nGOOD, NEW<br />\nNOVELS..'<br />\n<br />\n20% Discount On Coyright books to<br />\nJ. H. U. Students,<br />\nUNIVENSITY<br />\n<br />\nJOHNS HO.PNINS<br />\n<br />\n100 Sheets Paper<br />\n100 Envelopes<br />\nNo,8 Linen Note.<br />\nAzurine Note • •<br />\n<br />\n49c.<br />\n• 15c. per lb.<br />\n• 20c. \"<br />\n<br />\nWm. J. C. DULANY COMPANY.<br />\n<br />\nHamburgers', Baltimore & Howard Sts.<br />\nOeo. L. Harrison,<br />\nPresident.<br />\n<br />\nCIGARS, CIGARETTES AND SMOKING TOBACCO<br />\n<br />\n8<br />\n<br />\nEAST BALTIMORE STREET.<br />\n<br />\nFici9s<br />\n<br />\nSISCO BROS.<br />\n<br />\nnamicrii<br />\n<br />\n218 N. Charles Street,<br />\n<br />\n114;09ts<br />\n<br />\nBALTIMORE, MD.<br />\n•__<br />\n<br />\nSAMUEL HUNT'S SONS<br />\n<br />\nE. BALTIMORE ST.<br />\n<br />\nL<br />\n<br />\n95<br />\nLOVES<br />\n4ALIARLIfILTO no Prom#3.<br />\n<br />\nReduction in Prices.<br />\nThe only ho use keeping<br />\nGloves in repair, for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time a new<br />\npair given in exchange.<br />\n81.25 London Tan Gloves<br />\nreduced to 95 cts.<br />\nSee if you can snatch them<br />\nfor 81.25.<br />\n<br />\nWarwick and Maryland Bicycles,<br />\nAT $100 AND $50 RESPECTIVELY—ARE LEADERS.<br />\nYOU CANNOT GET MORE FOR YOUR MONEY ANY PLACE. THEY ARE STANDARDS.<br />\n<br />\nC. E. ricGOWAN, 1205 14th St., N.W.,Washington, D.C.<br />\nGUGGENHEIMER, WEIL St CO., STUDENTS' REQUISITES:._<br />\n<br />\n\fBARTHOLOMAY BREWERY CO.<br />\n<br />\nJ NO. H ELNZE1RLI NO •<br />\n<br />\nHEINZERLING<br />\n& co.<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\nMg<br />\n<br />\nW. J. WICKHAM.<br />\n<br />\nOffice & Factory, zI8-zz W. Conway St.<br />\n<br />\nBohemian ot<br />\nBavarian<br />\nMaerzen gat<br />\nApollo tat to:<br />\n<br />\nOur<br />\nSpecialties:<br />\n<br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER(ExtraDry)<br />\nSPARKLING KOLAFRA .<br />\n'pHONE • • •<br />\n<br />\n204<br />\n<br />\n1080—Telephone-2080<br />\n<br />\nBALTIMORE BRANCH t<br />\n<br />\nCatalogue No 8<br />\n<br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAuaR<br />\n<br />\nMandolins<br />\nGuitars • •<br />\nBanjos -<br />\n<br />\nwasbburn<br />\n<br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br />\n<br />\nH. R. EISENBRANDT SONS,<br />\nSOLE ABENTS.<br />\n<br />\na Month.<br />\n<br />\nPianos<br />\n<br />\nN. E. Corner<br />\n<br />\nCHARLES ANDIEXINGTON STS,<br />\n<br />\nEasiest Terms.<br />\n<br />\nThe enormous domade upon<br />\nno for Catalogues of our world celebrated<br />\nCHLORIDE OF SILVER DRY<br />\nCELL BATTERIES<br />\nhas entirely exhausted the three editions of<br />\nour number seven catalogue,compelling UN to<br />\nIssue now (instead of in the Spring of 1898, as<br />\noriginally intended) an entirely new and revised edition (No. 8), showing the many<br />\n<br />\nREMARKABLE IMPROVEMENTS<br />\n<br />\nmade In our Electro - Medical Batteries and<br />\nElectrodes during the Past year.<br />\nThfs book is now in press and will be the handsomest<br />\ncatalogue of such instruments ever published. If Interested, send six cents In stamps(exact cost of mailing)<br />\nand<br />\nyou will receive a copy.<br />\nChloride of Silver Dry Cell Battery Co.<br />\nBaltimore, Md., U.S. A,<br />\nMANES E. FULD. GEN'L MANAGE',<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS,.<br />\nSilk and<br />\nCANTS,<br />\n..<br />\n<br />\nMANUFAOTURIGN Or<br />\n<br />\nbatters<br />\n<br />\n• Ca/maniere<br />\n<br />\nMate<br />\n<br />\n:?24 W. 1:1.a.1.,TX1VE012.M<br />\nAgents for Walter Barnard London Hats.<br />\n<br />\nJ0J-IN<br />\n<br />\nBALTIMORE, MU.<br />\n<br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4<br />\n1- Standard Machines<br />\nMimeograph Work.<br />\nrented at II per week<br />\n<br />\nTYPEWRITER INSPECTION & SUPPLY CO,<br />\n15 NORTH STREET.<br />\n<br />\nKEEIDER,<br />\n<br />\nMAKER OF MEN'S GARMENTS,<br />\n<br />\nThe Chas. Willms Surgical Instrument Co.<br />\nIlzd(<br />\ntkAram('pt<br />\n<br />\n5 NORTH CALVERT STREET,<br />\nOpp. Equitable Building<br />\nIMO FIFTH AVE., NEAR 90TH ST.<br />\nNEW YORK.<br />\n<br />\n114<br />\n<br />\nBENJ. A. NELSON, O.,e! Alamitos.<br />\n<br />\nterrsa of rINE SkIIMIC.AL INSIN<br />\nTMENTS,<br />\nPhysicians', Burgeons', Hospital and Invalid Supplies,<br />\nElastic Hosiery, Trusses, Rubber Goods, Au,.<br />\n<br />\n300 N. HOWARD ST.,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nTELEPHONH 771.<br />\n<br />\n'<br />\n1 NEW YORK TO BREMEN, • • • NORTH GERMAN LLOYD S.S. CO.4<br />\nelq, LONDON,<br />\nCABIN PASSAGE AT LOW RATES.<br />\n<br />\n9<br />\n<br />\nA. SCHUMACHER & CO.<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\n9<br />\n<br />\nPARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN • • • •<br />\nDIRECT.<br />\n<br />\nevery description.. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br />\n<br />\nF. It DAVIDSON & C2.<br />\n<br />\n509 W. Franklin Street,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nTelephone 2095.<br />\n<br />\nATLANTIC TRANSPORT LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br />\n<br />\nBaltimore Storage & Lighterage Co.,<br />\n403-409 WATER STREE1,<br />\nBAI.TIMORE.<br />\n<br />\nNew York Shipping Co.,<br />\n1<br />\n<br />\nBROADWAY,<br />\nNEW YORK.<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 4x5 Water Street, LSecond St.]<br />\nShort Insurance for a Day<br />\n. . or Longer Period,<br />\n<br />\nAdjoining Custom House on theWest<br />\n<br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nROAM B. POST, Seely.<br />\n<br />\nTHOMAS I. CAREY, Plea.<br />\n<br />\nDIRECTORS<br />\nA. J. Ulman,<br />\nFerd. C. Latrobe,<br />\nJoshua (I. Harvey,<br />\nWilliam Harvey,<br />\nHenry James,<br />\nJames W. Bates,<br />\nAndrew D. Jones. GRIFFITH HEMMER,kilt. los<br />\n<br />\nBOARD OF<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol.<br /><br />\nL is I I. I<br /><br />\nNOVEMBER 11th, 1897.<br /><br />\nt 1 t<br /><br />\nt<br /><br />\nNo. 3.<br /><br />\ntbe<br /><br />\n3,idettisaifctitcr<br /><br />\nPublished by ,S'iucients of<br />\nPress of<br />\nog Cruggenheimer, Weil &amp; Co.<br /><br />\nTHE JOHNS HOPKINS<br />\n+ UNIVERSITY<br /><br />\nISSUED<br /><br />\nBALTIMORE<br /><br />\nFORTNIGHTLY<br /><br />\nMetropolitan Savings Bank of Baltimore<br />\nInterest 4i per cent. per annum.<br />\nC. C. SHRINER, President.<br />\nJAMES J. RYAN, Treasurer.<br />\nBALTIMORE, December ist, 1896.<br />\nThe undersigned, a committee of examination appointed by the managers of the Metropolitan Savings<br />\nBank of Baltimore to investigate the affairs of said cor.<br />\nporation, and to make and publish a report ofsuch investigation, respectfully submit the following:<br />\nAmount of funds on hand December 1, 1895 ....<br />\n42,145,870 98<br />\nReceived from depositors during past year<br />\n1,457,261 48<br />\nReceived alvIdends from stocks and<br />\nbonds and interest<br />\nfrom loans<br />\n125,M5 93<br />\nTotal<br />\n$3,728,738 35<br />\nFrom which deduct as follows:<br />\nAmount paid depositors during past years...$1,503,794 70<br />\nt4tate and City taxes and expenses<br />\n20,208 95<br />\nPremiums on stocks and bonds<br />\n15,182 38<br />\n$1,539,134 03<br />\nLeaving funds December 1, 1898<br />\n$2,189,804 32<br />\nThe funds are invested in loans on real estate, stocks<br />\nand bonds, in the opinion of the undersigned abundan<br />\nsecured, and in the purchase of stocks and bonds of tly<br />\nthe.<br />\nmost substantial character. The stocks and bonds purchased are all held below their market value, and none<br />\nabove their par value.<br />\nThere were open December 1, 1895, 4,145 accounts;<br />\nthere were opened during past year 799 accounts, and<br />\nclosed during same period 746 accounts, leaving open<br />\nDecember 1, 1896, 4,198 accounts.<br />\nI CUMBERLAND DUGAN,<br />\nCommittee<br />\nDANIEL DONNELLY,<br />\nof<br />\nV. J. BROWN,<br />\nDirectors. I ALBERT T. MYER,<br />\nF. K. MURPHY.<br />\nIn accordance with Article IV, of the By-laws, the<br />\ninvestments have been examined by a committee NOT<br />\nCONNECTED WITH THE MANAGEMENT OF<br />\nTHE CORPORATION, who thus characterize them—<br />\nthe loans and investments have been safely and judi• ciously made, and the securities held are ample.<br />\nCommittee<br />\nE. AUSTIN JENKINS,<br />\nof NonB. F. NEWCOMER.<br />\nDirectors.<br />\nALLAN McSHERRY,<br />\n,<br /><br />\n..<br /><br />\n. ,s,n,,,,„.ror ap,-.)41C ' • . --'. 1ES<br />\n.f,rnui u\" r 5u PPI•<br />\n. a•,<br />\n',<br />\n0..,„/\".._<br />\n•<br />\n,„' ,„0/e00 el!.<br />\n, 1,0 '<br />\n.,.... ,.r.,.........!\"...\"..,.,, ik, JP, s 'ill iii!<br />\nir<br />\nI , '<br /><br />\nCameras &amp; Supplies.<br />\nje<br /><br />\nDeveloping<br />\nand<br />\noe<br />\nPrinting.<br /><br />\nTHE CUMMINS<br />\n•..Ni CHARLE.S<br />\n.,.„., s<br /><br />\nTHE UNIVERSITY 5C111001. FM BOY'S<br />\nW. S. MARSTON, A. 11 and C'. E.,<br /><br />\n„HIS<br /><br />\nPrincipal.<br /><br />\n710 and 712 Madison Ave.<br /><br />\nSCHOOL prepares boys for almIseton to the Johns Hopkins or 'my<br />\n111,3versitY<br />\nScientific School. It has lined more than one hundred fur the John,<br />\niloplchos<br />\nMA many for Herverd, Vale, rrincetun,<br />\nthe Masaachusetts Institute of Technology, th•<br />\nTroy Polytechnic and other College. and Schools. In October,<br />\n1894-95,<br />\ntwo<br />\nof the tic.<br />\nectuderehlpe given at the John a hlopkine lo new 11101trialllitten<br />\n, were awarded to It. pupils. It<br />\nhe. It good laburetory and a well equipped gymnasium, whiuk is<br />\nunder the eheroe of It comp.<br />\ntent Ini,truotor. For further 1,0°111.00u or fur catalogue.,<br />\n&amp;dares. the Principal, at No. in I<br />\nN. Calvert Street.<br /><br />\nB. G. EICHELBERGER,<br />\nBooK8 AND FINE STATIONFARY.<br />\n308 N. CHARLES<br /><br />\nST.<br /><br />\nY. M. O. •, /11111.1)1b111.<br /><br />\nBaltimore, Md.<br /><br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701, 703 and<br />\n705 Madison avenue,cor. Eutaw st. Telephone 817.<br /><br />\nCushing &amp; Company, lii<br /><br />\nBOOKSELLERS<br /><br />\nAND<br /><br />\nSTATIONERS<br /><br />\n34 WEST BALTIMORE STREET.<br />\n1301100L, LAW, MEDICAL, AND CLASSICAL AND intiONLLANEOUS BOONS.<br />\nKeel. ounstently on hand the Text Books used In Johns Hopkluoi Untverelty,<br />\nJohn* Hopkins<br />\nHospital, and the Woniatt'a College of Baltimore.<br />\nSTATIONORY.—Por School, Fc,nIly, Office and 'lank.<br /><br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThe Johns Il_o_pkiits University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the ace. . demic year beginnitsg_October oat, 1897 may be had on application to the Registrar of thslohns Ii.spkins University.<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nTile announcements of thejohns Heykins Medical School may_also<br />\n• be had on application to the Registrars.<br /><br />\nPHOTO-STOCK CO,<br /><br />\n(<br />\n. \"BALT IMOR<br /><br />\n106 N. Charles St.<br /><br />\nMANDOLINS<br />\nGU!TARS<br /><br />\nAre used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nCalifornia. Iar Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin<br />\nand Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br />\nMANUFACTURED BY<br />\nF. H. GRIFFITH &amp; CO.,<br />\nMention this paper when you<br />\ncall or write.<br /><br />\nAt SMITH'S BOOK EXCHANGE<br />\n,<br />\nyou can sell Text Books for Cash<br />\nor exchange them. A full line of<br />\nStudents Requisites always on hand.<br />\nCall,<br />\n805 N. HOWARD STREET,<br />\nTOREE DOORS ABOVit MADISON.<br /><br />\nYou Fairly Fly on<br /><br />\nKeating<br /><br />\na\"<br /><br />\n11111.110411010Mwromm.=....--<br /><br />\nGrand\"<br /><br />\nFactory and Salesro<br /><br />\n, 871 N. Howard St., Ilaftlinore, Md.<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nMadison &amp; Howard Sts.<br /><br />\n. Text Books .<br />\n. Note Books .<br />\nStudents' Supplies<br />\nANIIIIMINIM1.11.1•1/<br /><br />\nIt's the Wheel of 'Wheels, with its<br />\nDouble Roller Chain--\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO„ IxI N. Charles St.<br /><br />\nBaltimore hardware Co., Baltimore tic Greene Sts.-Branch.<br /><br />\ntbe 1Rews lLetter.<br />\nFortnightly<br /><br />\nVol. II.<br /><br />\nSTUDENT LIFE AT EDINBURGH.<br />\nI.<br />\nIn the university city of Edinburgh a \"Town<br />\nand Gown Association\" was formed in the<br />\nyear 1896 for co-operative undertakings in the<br />\njoint interest of citizens and students. It was<br />\nfor the common good of city and university.<br />\nThe Association is a stock company representing academic interests for the purpose of providing residential halls or house accommodation for students and other persons connected<br />\neither with the University or with the liberal<br />\nprofessions. Although Edinburgh University<br />\nhas been in existence for more than two centuries, it has never enjoyed the benefit of college<br />\nhalls or hostels like those which have given<br />\nsuch architectural character and social charm<br />\nto Oxford and Cambridge. Students and professors have lived in Edinburgh wherever they<br />\ncould find lodgings. There has been no real<br />\nunity to academic life, no college centre or<br />\nLatin Quarter, where students live and educate<br />\none another in their own society—perhaps the<br />\nmost effective of all academic means of culture.<br />\nThe English colleges have always been strong<br />\nin social education, but here the Scotch and<br />\nGerman universities are weak.<br />\nTo remedy a long-standing and manifest defect in Edinburgh student life the Town and<br />\nGown Association was organized by the<br />\nenergy and enterprise of Professor Patrick<br />\nGeddes, who lives near the Outlook Tower on<br />\nCastle Hill and surveys from his charming<br />\napartments, at the top of an airy citadel, the<br />\nhistoric City of Edinburgh and the picturesque<br />\ncountry round about. While Professor Geddes<br />\nhas had in mind the need of better associated<br />\ncollegiate life in Edinburgh, he has also sought<br />\nthe material and architectural improvement of<br />\nthe city. It is well known by all visitors to this<br />\nancient capital of Scotland that the historic and<br /><br />\nNo. 3<br /><br />\npicturesque old town, extending from Castle<br />\nHill eastward to Holyrood, was until lately the<br />\nmost dilapidated and unsanitary part of the city.<br />\nMunicipal and architectural improvements,<br />\nwhich Professor Geddes has greatly promoted,<br />\nhave now transformed some of the worst of<br />\n'those ancient rookeries, narrow passageways<br />\nand noisome courts into spacious college halls<br />\nand modern apartment houses.<br />\nThe beginnings of this remarkable movement, which is at once \"civic and academic,<br />\narchitectural and educational,\" date from the<br />\nyear 1887. Then a new social life was instituted for students in Edinburgh by the renting<br />\nand furnishing of three small flats on the socalled \"Mound,\" which connects Old and New<br />\nTown. At first only seven students entered<br />\nupon this common or associated life ; but the<br />\nnumber increased and soon an entire house was<br />\nneeded to supply the demand. By a perfectly<br />\nnatural law of growth, and upon a sound business basis, the first residential hall in Edinburgh was established. It is now a studenthome for members of New College. In 1890<br />\nanother house WaS purchased in Riddle's court<br />\nand reconstructed for student-residents. In<br />\nthe same year was acquired an historic locality<br />\nonce occupied by the Scotch poet, Allan Ramsay, author of \"The Gentle Shepherd.\" Gradually a range of new houses was built on two<br />\nsides of Ramsay Garden, so that now there is a<br />\nlarge number of comfortable flats, or sets of<br />\nchambers, occupied by professors and their<br />\nfamilies, and a large building called \"Ramsay<br />\nLodge,\" with numerous rooms, occupied by<br />\nstudents in residence.<br />\nThe visitor in Edinburgh as he strolls along<br />\nPrinces street (said to be, for noble views, the<br />\nfinest street in Europe) will find himself looking upwards to that natural acropolis where<br />\n\"Edwin's Burgh\" gave name and fame to the<br />\nOld Town on the hill. Extending eastward<br />\nfrom the castle and the walls of the Esplanade<br /><br />\nA<br /><br />\nP.<br /><br />\n1<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nis an attractive range of buildings. These are ulation than I had read in books or heard in<br />\nthe most conspicuous beginnings of college lectures.<br />\nhalls in Edinburgh.<br />\nIn the College Hall at Ramsay Garden there<br />\nFrom my hotel on Princes street I moved, was in August and September a considerable<br />\nbag and baggage, in a cab, one afternoon in number of medical students in residence.<br />\nAugust, to \"Ramsay Lodge,\" on the heights, These men were an entertaining source of sowhere students attending the Edinburgh Sum- ciological and academic information. We met<br />\nmer School were quartered. I had previously<br />\nat least three times daily, for we all boarded in<br />\nmade arrangements with Mr. Marr, the secre- commons. The dining hall was in the basetary ; and the matron of the College Hall at ment, where a substantial dinner was served at<br />\nRamsay Garden promptly assigned me to a the close of day. Breakfast and luncheon were<br />\nlarge, airy room looking northwards across simpler and more frugal than in America. The<br />\nPrinces street, beyond the New Town and to- \"halesome parritch, chief of Scotia's food,\" we<br />\nwards the Firth of Forth and eastward towards enjoyed every morning, with good coffee,<br />\nCalton Hill, with its crown of historic monu- which every student poured out for himself.<br />\nments in memory of Robert Burns, Dugald<br />\nThere was always some hot dish or cold meat<br />\nStewart, and other celebrities. It was worth a at both breakfast and luncheon, with, of course,<br />\nlong journey to Edinburgh to behold that bread and butter, and marmalade from Dunmagnificent prospect, which I enjoyed morn- dee. All these meals were served by Scotch<br />\ning, noon and eve. There before my very eyes spinsters of safe age, austere looks, and undisI could read Scotch history backward from the puted moral character, who treated the boardliving present to the time of King Edwin, on ers with a certain cold Scotch severity, somewhose very hill I was lodging. Ramsay Gar- times preventing the enjoyment of two porden lies close to the ancient burgh or castle, tions. Students are allowed in Scotland, as in<br />\nwhich still shelters the chapel of Queen Mar- England, to have wine and beer at their own<br />\ngaret, the oldest church in Scotland. From<br />\nexpense, but very little drinking is done. After<br />\nmy northern windows I could look away to- luncheon and after dinner the company adwards the Queen's Ferry, over which Margaret journed to the common room, just above the<br />\nand her children, rescued from siege and car- dining hall, and helped themselves to coffee,<br />\nried down the crags one night, were safely read the papers, played on the piano, sang<br />\ntransported into the adjoining kingdom of Fife. songs, and amused themselves in conversation<br />\nThere below me at the foot of Castle Hill lay for a little while before dispersing to their<br />\noutspread the beautiful gardens which occupy rooms and their work.<br />\nthe basin of the old North Loch. It was a rare<br />\nHERBERT B. ADAMS.<br />\npleasure, on a sunshiny Sunday afternoon, to<br />\n[TO BE CONTINUED.]<br />\nwatch from those ancient heights the happy<br />\nmodern groups of people—men, women and<br />\nchildren—on the green hillside and in the gardens below. The great parks of Chicago, New<br />\nMr. C. C. Clark,'96, is teacher of French and<br />\nYork, Philadelphia and Baltimore have shown German at the Naval Academy of the Great<br />\nme greater crowds of happy people in summer, Lakes, Toledo, Ohio.<br />\nbut nothing so picturesque as those grassy<br />\nslopes of Edwin's Burgh all alive with children<br />\nMr. Blake, in behalf of The '97 Hullabaloo,<br />\nand their admiring parents. I spent one entire has given Mr. Harwood $44.5o net profits of<br />\nSunday afternoon among people on the hillside<br />\nThe '97 Hullabaloo, to be divided equally beand in the gardens below. I learned more of tween the General Athletic, Baseball, Footthe characteristics of Edinburgh's mixed pop- ball, Lacrosse and Hockey Associations.<br /><br />\nTHE NEWS-LETTER.<br />\nNEWS OF A FORTNIGHT.<br />\nCONORESSIVE SESSION.<br /><br />\nThe first regular meeting of the Senate,<br />\nwhich was held November 3, was honored by<br />\nthe presence of Dean Griffin, who expressed<br />\nhimself as much pleased with the work. The<br />\nmeeting proved how much practice in debating<br />\nis needed by the Senators. Several of the debaters were seized with stage fright, and found<br />\nit difficult to speak without stumbling over<br />\nwords and making awkward pauses. This fault<br />\nis common to all beginners, and will surely disappear with practice. Time that might have<br />\nbeen used in debate was lost in calling the roll<br />\nand reading the minutes of the previous meeting. Hereafter the roll will be taken silently—<br />\nthat is, the clerk will simply mark the absence<br />\nof members without calling the names. The<br />\nminutes will be referred to the Censor. In this<br />\nway it will be possible to begin the debate five<br />\nminutes after opening the session. As the Senate ages, the members will settle to their work,<br />\nand the slight breaches of decorum that mar<br />\nthe proceedings of any forensic body will be<br />\neliminated. On the whole, the first meeting<br />\nof the Senate may be pronounced a success.<br />\nThe current debate was won by the affirmative,<br />\nrepresented by Messrs. Lucke, Renouf and E.<br />\nSmith.<br />\nThe subject for the next debate is:<br />\n\"Resolved, That the result of the work of the<br />\npresent United States Bimetallic Commission<br />\nought to definitely settle the discussion of the<br />\n'Silver Question.'\"<br />\nSenators Fisher, Fitzgerald and R. D. Miller have the affirmative ; Senators Ballard,<br />\nWhitehead and Cook the negative.<br />\nThe first regular meeting of the House of<br />\nRepresentatives was held Wednesday, October 26. Speaker French presided. The use of<br />\na gavel, a valuable old Indian relic, was tendered to the House by Dr. Adams. The Censor announced that Dr. Adams had also given<br />\nthe use of the Southern History room for the<br />\ndebaters. The House moved that a vote of<br />\nthanks be given to Dr. Adams. The main interest of the meeting centered in the debate :<br /><br />\n3<br /><br />\n\"Resolved, That municipal government be independent of national party lines.\" The affirmative was taken by Messrs. Smull, Jones,<br />\nVer Planck and M. Jungbluth ; the negative<br />\nby Messrs. Mullen, Grimes, Gemmil and Joyner. The House decided on the merits of the<br />\ndebaters that the negative side had won. The<br />\ndebate for next time was given to Congressmen Fosnocht, Frank and Greenbaum for the<br />\nnegative, and Congressmen Levering, Kalb<br />\nand Gaddess for the affirmative. In parliamentary law the following appointments were<br />\nmade: Leader of attack, H. Grimes; leader<br />\nof defense, C. Remsen.<br /><br />\nnusicAL CLUB'S CONCERT.<br />\nThe University Banjo and Mandolin Clubs<br />\ngave the first concert of the season on Friday<br />\nevening, November 5, at Hannah More Academy, near Reisterstown. The trip was made<br />\non a special car over the new Baltimore and<br />\nNorthern Electric Railroad.<br />\nThe occasion of the concert was the opening<br />\nof Wyman Hall, which was filled by a large audience drawn from Baltimore, Pikesville and<br />\nReisterstown. The clubs played well and were<br />\nheartily received by the audience. The new<br />\nmen give promise of ranking among the best<br />\nplayers in the clubs, and there is no reason<br />\nwhy, under the leadership of Mr. Peters and<br />\nwith a full attendance at practice, this year's<br />\nclubs should not excel those of '93-'94 and<br />\n'96-'97, the best in the history of Hopkins.<br />\nMr. Harwood and Mr. Clunet made a great<br />\nhit with their new songs.<br />\nThe vocal parts were ably given by Miss<br />\nStarr, the composer of the music of \"Veritas<br />\nVos Liberabit,\" and Mr. Frank Taylor, the<br />\nwell-known soloist of the club. Mr. Edwin L.<br />\nTurnbull gave two selections on the violin.<br />\nAfter the concert there was dancing, kept<br />\nup until the men were compelled to leave, carrying with them pleasant memories of the hospitality of Hannah More.<br />\nDr. Hollander, of the Economic Department, has just returned from Europe, where<br />\nhe served as secretary of the Bimetallic Commission.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n4<br /><br />\nbe pettioALetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nNOVEMBER ii, /897.<br />\nSubscription $1.30 per year. 15 cents a single copy.<br />\nEditor in Chief,<br /><br />\nEDGEWORTH SMITH,'98.<br />\nAssistant Editor in Chief, - - ALBERT C. DIEPYRNuacii,'98.<br />\nConsulting Editors, -<br /><br />\nProf. KIRBY P. SMITH.<br />\nGEO. C. MORRISON,'90.<br /><br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RAbcir.IFFE,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONOCOPE, Medical School.<br />\nV. A. RIFINOUF,<br />\nR. D. MILLER,'98.<br />\nJ. C. PRENCII,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, '99.<br />\nBusiness Manager,<br />\nR. H. GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br /><br />\nors of the Athletic Association, and a finance<br />\ncommittee, consisting of the president, the<br />\ntreasurer, one alumnus and the manager of the<br />\nteam, whose duties shall be to arrange a schedule and govern the finances of that team. This,<br />\nit will be seen, has an appearance of fairness<br />\nand will insure the team's being governed in a<br />\nbusiness manner.<br />\nLet the committee arouse the alumni by<br />\nplacing them in the Association. If they see<br />\nthat they are not forgotten by their successors<br />\nin university life, they will not be backward in<br />\nhelping in a material way. But the Association must be general it must as nearly as possible represent every student of the institution.<br />\nLet the good work be given an impetus, and<br />\nour alumni will meet us more than half way.<br /><br />\nTRAINING AND HONOR.<br />\nNEW ATHLETIC ASSOCIATION.<br /><br />\nOne of the best efforts in athletics at Hopkins is the proposed reorganization of the Athletic Association. Up to the present time the<br />\nseveral other athletic societies which have been<br />\nindependent of it have amounted to nothing.<br />\nEach one is simply a name. It is true that they<br />\ndo choose officials for the teams, but even this<br />\nthey sometimes do most unwisely. It is a palpable blunder for a body of several delegates to<br />\nelect the leader of a team. The team itself<br />\nshould choose the captain. Another serious<br />\ndefect in the several associations was that there<br />\nwas no business responsibility and no authority. In short the manager was the association,<br />\nwith all rights and abuses thereto appertaining.<br />\nThe new association should have a constitut.ion which provides for a strong centralization,<br />\nand the alumni should be represented. By<br />\nbringing all departments of sport under one<br />\ngovernment there is the advantage of having a<br />\nreliable organization to guide the teams and<br />\nthe managers. Then we should have such a<br />\nrarity as system. All that is necessary in the<br />\nassociation is a representative membership.<br />\nTwo of the salient features proposed are the<br />\nelection of the managers by the board of direct-<br /><br />\nUnpleasant rumors are going about. It is<br />\nsaid that certain members of the football team<br />\nhave been smoking. This is a deplorable state<br />\nof affairs. It is right for the students to<br />\nobject. So long as the players keep in good<br />\nphysical condition there will be sympathy and<br />\nsupport in case of defeat. But if the men do<br />\nnot train they cannot expect to win, and they<br />\ndeserve to be \"roasted\" by the students. We<br />\nhope that the reports of the violations of rules<br />\nare untrue. In training for a team the adherence to a pledge is a matter of honesty. There<br />\nis no absolute prevention if a man cares to<br />\nsmoke or in any other way violate the rules.<br />\nThe point to appreciate, then, is that honor is<br />\njust as necessary on the football team as in the<br />\nexamination room, and a violator should be<br />\ntreated accordingly.<br /><br />\nIt is interesting to note the prominent part<br />\nplayed in the late election by former Hopkins<br />\nstudents. One graduate, who, while a student<br />\nat the Hopkins, impressed everyone by his extremely retiring disposition, stumped New<br />\nYork City for Low on street corners and from<br />\nthe back of grocery wagons.<br /><br />\nTHE NEWS-LETTER.<br />\n!ATHLETICS.<br />\nENTHUSIASTIC rtAss METING.<br />\nA mass-meeting of the students was held in<br />\nHopkins Hall October 29 to discuss and consider the reorganization of the General Athletic Association. The assembly decided upon<br />\ntwo points, which, it is believed, will further<br />\nthe interest of athletics at the University. An<br />\neffort will be made to centralize the several<br />\nathletic associations which now exist, each<br />\nunder separate government, and, second, the<br />\nstudents will earnestly strive to procure a field.<br />\nPresident Edward Renouf was chairman<br />\nand Dr. J. B. Crenshaw was secretary. The<br />\nPresident discussed the situation of the separate organizations, and showed clearly that unless these associations were put under one head<br />\nathletics at the University could never have a<br />\nfuture.<br />\nAt present there exist the Football Association, the Lacrosse Association, and the Baseball Association. Several speeches were made,<br />\nall proving that these several organizations<br />\ncould no longer exist as such. It was shown<br />\nthat the associations had done almost nothing<br />\nfor athletics; that they were mere paper associations, and, beyond assembling for the annual<br />\nelection of the managers and captains, did absolutely nothing. The responsibility rested<br />\nalone on these men, and, if debts were incurred, they alone received the blame.<br />\nTo obviate this, it was decided that the President appoint a committee of seven students to<br />\nascertain how the students felt on this point,<br />\nand to draw up a constitution for the proposed<br />\nreorganization.<br />\nThe committee consists of J. 13. Crenshaw<br />\n(chairman), Hancock, Reese, Dieffenbach,<br />\nScholl,'Grimes, G. C. Robinson and Foster.<br />\nThe heavy beams which will support the<br />\nroof of the cage are in position and the building now gives an idea of what it will be when<br />\nfinished. It will require only a few weeks to<br />\ncomplete the structure. The gymnasium will<br />\nnot be ready for occupancy so early on account of the interior work.<br /><br />\n5<br /><br />\nVICTORIES AT GEORGETOWN.<br /><br />\nJohns Hopkins won two events and got second place in another at the Georgetown games<br />\non Saturday. Robert Garrett was the chief attraction of the day, and his feat with the<br />\ndiscus brought out much applause. Scholl<br />\nwon the high jump, Garrett won at discusthrowing,and was second in the running broad<br />\njump. Knapp was put in a preliminary heat<br />\nwith Wefers, champion of the world, in the<br />\nioo-yard dash, and failed to qualify in the<br />\nfinal. In the discus event Garrett did not exert<br />\nhimself, and won easily at 107 feet 7 inches.<br />\nScholl cleared 5 feet 5 inches in the high jump<br />\nin good form. In the running broad jump the<br />\nmeasuring was decidedly favorable to Georgetown. When Garrett and Scholl jumped the<br />\ntape was drawn taut, but the home competitor,<br />\nWalsh, was given a slack tape twisted several<br />\ntimes. The event was nevertheless a notable<br />\none, for Garrett broke the Maryland record<br />\nmade by him-2I feet 91 inches. He beat this<br />\nby an inch and a half. Scholl made 21 feet<br />\ninches, breaking his own record by eighteen<br />\ninches. Walsh was credited with 22 feet<br />\ninch. About forty rooters went over to cheer<br />\non the men. Incidentally, they gave .the other<br />\ncolleges represented a few pointers as to college yells.<br />\nFOOTBALL.<br />\nHOPKINS 0-W. M. C. 10.<br /><br />\nW. M. C.<br />\nPositions.<br />\nJ. H. U.<br />\nThorpe<br />\nRight End.<br />\nTalty<br />\nFrancis... ...Right Tackle... ...Stoffer<br />\nRight Guard ..... . .Reese<br />\nKennard...<br />\n.Tagg<br />\n.Centre<br />\nHancock<br />\nRushmore.. ....Left Guard.... ....L Wells<br />\nLazenby.. . ..Left Tackle.. .....C Baker<br />\n.Patton<br />\nArmstrong (f. b.). Left End.<br />\nWells<br />\nL.<br />\n0.<br />\n..B.<br />\n...Quarterback<br />\nMullen....<br />\n.Smith<br />\nGuggenheimer..Left Halfback.<br />\nZepp<br />\nRobinson(f.b.)..Right Halfback.<br />\n.<br />\n.<br />\nHalfback<br />\nRight<br />\n.<br />\nBouschelle<br />\nFullback ...H. D. Baker(C.)<br />\nHodges.<br />\nTouchdowns—Patton, Smith. Goal—H. D.<br />\nBaker.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\nAt the kick-off Hopkins advanced the ball<br />\nHodges played a magnificent game. He<br />\nnear the centre of the field. They steadily made gains right and left, and bucked the line<br />\nforced their way to W. M..C.'s five-yard line, with good effect.<br />\nwhen the ball went over on a questionable offRobinson, Hodges and Francis were the<br />\nside play. W. M. C. then took a brace and star tacklers, while Haulenbeek and Talty<br />\nbefore the half closed Patton forced the ball made good runs.<br />\nover Hopkins' line for a touchdown, H. D.<br />\nArmstrong kicked all five goals, but was a<br />\nBaker kicking goal.<br />\nlittle off in his punting.<br />\nThe line bucking of W. M. C. is the most<br />\nThe team needs practice in interference,<br />\neffective encountered by the team this year.<br />\npassing and catching the ball. There was too<br />\nThe grounds were wretched, in parts cov- much fumbling.<br />\nered with stones. The goal line was protected<br />\nSeveral alumni coached the team in the latby a steep incline, which twice frustrated Hop- ter part of the second half.<br />\nkins' efforts to cross it.<br />\nM. A. C.'s goal was due to a bad pass early<br />\nBouschelle as substitute deserves mention in the game.<br />\nfor his creditable work.<br />\nRushmore, Medical School, is a good one.<br />\nHopkins was unfortunate in not having<br />\nBouscaren, for M. A. C., put up a good<br />\nCaptain Brady. Hodges, acting captain, was game.<br />\ninjured and the team considerably weakened.<br />\nCaptain Hodges resigned after the game,<br />\nArmstrong, Robinson and Mullen played well and Brady was elected in his place.<br />\nthroughout. For Western Maryland Zepp,<br />\nSWATHMORE I6—HOPKINS o.<br />\nSmith and H. D. Baker excelled. This makes<br />\none victory and one defeat in the pennant race.<br />\nAll the scoring in this game was done in the<br />\nfirst half. The second half was nip and tuck,<br />\nHOPKINS 30—M. A. C. 6.<br />\nthe game ending with the ball in the centre of<br />\nThe 'Varsity eleven won a brilliant victory the field. Everybody played<br />\nsteadily, and Robover the Maryland Agricultural College in the inson, Francis and Hodges<br />\nespecially distinfirst game of the intercollegiate series for the guished themselves.<br />\nThe victory was due to<br />\nState championship. It was Hopkins' game Swathmore's superior<br />\nity in weight.<br />\nfrom the kick-off. The college team was<br />\nrouted at every point and could score only one<br />\n\"Bad Story-Telling,\" an article by Mr.<br />\ntouchdown, and that on a fluke, against Hop- Frederic M. Bird in<br />\nOctober Lippincott's, may<br />\nkins' five. The 'Varsity eleven kept the ball be interesting in connect<br />\nion with THE NEWScontinually in the opponents' territory, and<br />\nLETTER'S prize story offer. Mr. Bird counsels<br />\nwithout halting or wavering carried it steadily the young story writer<br />\nto look for material<br />\ntoward the M. A. C. goal, ploughing through<br />\nnear at hand and to write about things with<br />\nthe line, breaking up interference, and making<br />\nwhich he is familiar. He suggests the South<br />\ncontinual gains around the ends. The men and West as fields not<br />\nyet worked out, and calls<br />\nplayed together with clock-like regularity, the attention to the present<br />\nfad for fiction founded<br />\nbacks tackled well, and the line stood as firm as on American history.<br />\n\"Whatever you do,\"<br />\na rock. The visitors played well, but were out- he says, \"take pains<br />\nwith it. Put your best<br />\nclassed at every point. There was a slight dif- work into every sentenc<br />\ne. If you are too lazy<br />\nference in the weights of the teams, favorable and careless to do<br />\nthat, better go into trade or<br />\nto the 'Varsity, but Hopkins won the day by politics.\"<br />\nher superior team work and individual play.<br />\nFrancis was the hero of the day. He was<br />\nEfforts are being made to secure the serveverywhere. He made a beautiful run of sixty ices of Messrs.<br />\nRobinson and McGraw to<br />\nyards for a touchdown, besides scoring two coach the 'Varsit<br />\ny baseball team when the<br />\nothers.<br />\ncage is finished.<br /><br />\nTHE NEWS-LETTER.<br />\nIN THE LAND OF THE CZAR.<br />\nDr. William B. Clark, professor of geology<br />\nin the Johns Hopkins University, has just returned from Russia, where he has been in attendance upon the International Geological<br />\nCongress in St. Petersburg. He bore the credentials of the Secretary of State as one of the<br />\nsix national delegates from the United States,<br />\nand also an appointment from the Governor<br />\nof Maryland to represent the State as State<br />\nGeologist.<br />\nAn international congress is held every three<br />\nyears at one of the leading cities of the world,<br />\nthe first congress being held in Paris in 1878.<br />\nSubsequent congresses have been held at Bologna, Berlin, London, Washington and Zurich. The invitation to hold the seventh Inter1Lati9nal Congress at St. Petersburg was presented in the name of the Czar by the Russian<br />\nrepresentatives at the Washington Congress<br />\nin 1891, and was at once accepted by that Congress. Assurances were given of most cordial<br />\nwelcome on the part of the Russian Government and people. How sincerely these assurances were meant is shown by the marvelous<br />\nhospitality with which the delegates to the International Congress at St. Petersburg were<br />\ngreeted. Free tickets upon all Russian transportation lines were granted to the members of<br />\nthe Congress, so that after reaching the borders of Russia no expenses for railway and<br />\nsteamboat travel were incurred. Orders were<br />\nalso given to the customs officials to pass the<br />\nmembers of the Congress without inconvenience.<br />\nThe Congress opened upon August 29 in<br />\nSt. Petersburg, with somewhat over 600 delegates in attendance, representatives being present from nearly every country of the world.<br />\nThe Germans and French were much more<br />\nnumerous than the representatives of other<br />\ncountries. About forty American geologists<br />\nwere present, among them the aged Professor<br />\nHall, the State Geologist of New York; Professor Marsh, of Yale University, and Professor S. F. Emmons,of the United States Geological Survey.<br /><br />\n7<br /><br />\nAmong the distinguished Europeans were<br />\nSir Archibald Geikie, who lectured at the University on the Williams foundation last spring;<br />\nBaron von Richthofen, of Berlin; Prof. von<br />\nZittel, of Munich ; Professor Zirkel, of Leipsic ; Professor Capellini, of Florence ; Professor Brogger, of Christiania, and many others.<br />\nThe Congress was opened with an addres by<br />\nthe Grand Duke Constantine, a cousin of the<br />\nCzar, and remained in session a week, during<br />\nwhich time the delegates were elaborately entertained, the Czar giving a great banquet in<br />\nhonor of the Congress at Peterhof. The members of the Congress were also elaborately entertained by the Grand Duke Constantine, the<br />\nGovernor of St. Petersburg, and the other<br />\ncelebrities. During the session of the Congress<br />\nthe members visited Finland at the invitation of<br />\nthe Senate of that country, a day being spent at<br />\nthe Falls of Imatra, where a state dinner was<br />\ngiven in honor of the visitors.<br />\nAt the close of the Congress the members<br />\nwent to Moscow, where, after a few days' visit<br />\nin that city, they divided into three groups,<br />\neach party journeying to Vladikavkaz at the<br />\nbase of the Caucasus Mountains by different<br />\nroutes. Professor Clark accompanied the<br />\nVolga party, going first to Nijni Novgorod,<br />\nwhere the great Russian fair was visited. At<br />\nthis point a steamer was taken down the Volga,<br />\nnumerous stops being made by the party to<br />\nexamine the geology of the country traversed.<br />\nA journey of 1124 miles was made in this manner, the party leaving the boat at Tzaritzin,<br />\nand thence proceeding by rail across the<br />\nsteppes of Central and Southern Russia to<br />\nVladikavkaz.<br />\nThe Caucasus Mountains were crossed by<br />\nthe Russian military road in carriages, and<br />\nunder escort of a Cossack guard. Four days<br />\nwere consumed upon this journey, all other<br />\ntraffic across the highway being suspended by<br />\norder of the Russian Government. Arriving at<br />\nTiflis, the Capital of Georgia, several days were<br />\nspent in examining this wonderful city and its<br />\nimmediate surroundings. Numerous festivities were arranged by the residents in honor of<br />\ntheir guests.<br /><br />\n4<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe party next visited the great Russian oil Plumian professorship of astronomy and exfields at Baku, on the shores of the Caspian perimental philosophy at Cambridge, and is a<br />\nSea, a short trip from that point being made by member of the council of the Meteorological<br />\nsteamer. Returning to Tiflis the party pro- Office.<br />\nceeded thence to Batoum on the Black Sea,<br />\nPresident Gilman made the historical adwhere a Russian vessel was in waiting. The dress in celebration of the fiftieth anniversary<br />\nlast ten days of the Congress were spent upon a of the Sheffield Scientific School<br />\nat Yale Unitrip along the Eastern and Northern coast of<br />\nversity on Thursday, October 28. He was<br />\nthe Black Sea, several short trips being made formerly a member<br />\nof the faculty of the school.<br />\ninto the interior of the Crimea, where the sumThe<br />\nNovember<br />\nweek<br />\nof<br />\n14-20 will be obmer homes of the wealthy and noble Russians<br />\nserved by all the Young Men's Christian Asare to be found. Yalta, the Bar Harbor of<br />\nsociations in the country as a week of prayer.<br />\nRussia, the battle-field of Balaclava and SeThe University Association has arranged for<br />\nbastapol, were visited. The journey ended at<br />\nshort prayer-meetings every day of that week<br />\nOdessa, where the final session of the Congress<br />\nin the chapel at 12.55 o'clock. The meetings<br />\ntook place upon October 6.<br />\nFrom Odessa Professor Clark went to Con- will not exceed fifteen minutes in length, and<br />\nwill be led by members of the faculty.<br />\nstantinople, and thence by way of Bulgaria and<br />\nThe class of 19oo has completed its organServia back to Central Europe.<br />\nThe Johns Hopkins University was repre- ization by the adoption of a constitution and<br />\nsented at the Congress by both Professor Clark the election of the following officers: Presiand Dr. Reid, who made interesting collections dent, Frederick Foster ; vice-president, Willof specimens for the geological museum of the iam P. Shriver ; secretary, John Philip Hill;<br />\ntreasurer, Harry D. Hill ; sergeant-at-arms, I.<br />\nUniversity.<br />\nH. Francis; delegate to the Matriculate Society, James L. A. Burrell. Executive comThe class of '98 held its first meeting of this mittee—The President, John Wheeler Griffin,<br />\nyear on Wednesday, October 27, and elected C. T. Clarke, Morvin Lindheim, Ronald Aberthe new officers.' Mr. Fitzgerald was elected crombie, Charles B. Wirt and Charles Edward<br />\npresident, Mr. Clarke vice-president, Mr. J. H. Brooks. The election of class poet, artist and<br />\nPalmer treasurer, and Mr. Seth was re-elected historian is to be by competition, and has been<br />\nsecretary. The other offices were filled as fol- put into the hands of Messrs. Shriver (chairlows: Historian, Mr. Renouf ; delegate to man), Eager, James, White and Moore. The<br />\nMatriculate Society, Mr. E. L. Palmer ; dele- committee's awards will he made December I.<br />\ngates to General Athletic Association, Messrs. The class colors are maroon and white ; the<br />\nScholl and Clarke; delegates to Football As- class pin has not yet been chosen.<br />\nsociation, Messrs. Clunet and F. W. Smith ;<br />\nThe Christian Herald and Signs of Our<br />\ndelegates to Lacrosse Association, Messrs. Times for October 27 publishes an illustrated<br />\nClunet and F. W. Smith; delegates to Base- article, an allegory, entitled, \"The Island of<br />\nball Association, Messrs. Clarke and Swaine. Symbols,\" by Mr. Charles K. Edmunds. Mr.<br />\nProfessor George Howard Darwin, the sec- Edmunds represents the graduate scientific<br />\nond son of the late Charles R. Darwin, is vis- departments in THE NEWS-LETTER staff.<br />\niting the University this week. He is interAt the Mendelssohn memorial concert given<br />\nested chiefly in the Department of Physics by the Oratorio Society of Baltimore in Music<br />\nand in Professor Rowland's work. Professor Hall November 4, President Gilman made a<br />\nDarwin is a well-known scientist, and author short address and unveiled a portrait of the<br />\nof many papers referring to geology, astron- composer, a gift to the Society from Baron<br />\nomy and the theory of tides. He holds the Ernst Mendelssohn, his lineal descendant.<br /><br />\n1<br /><br />\nThe Boy8' Latin SG hool f<br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Hood IVIrtster.<br /><br />\n--This school has a continuous history of over fifty years .<br />\nIt was reorganized under its present management<br />\nin 1894.<br /><br />\nTelephcne Call 1822.<br /><br />\nFAitablished 188U.<br /><br />\nARTHUR F. LAWRENCE &amp; CO.<br />\nLeading Dealers in<br /><br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br /><br />\n6 W. SARATOGA STREET,<br />\nY. M. C<br /><br />\nA. BUILDING,<br /><br />\nBALTIMORE, MD.<br /><br />\nSAVINGS DEPARTMENT.<br /><br />\nCAPITAL, $100.000.<br /><br />\nMaryland CRle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE<br />\nTELEPHONE 1376.<br />\nT. K. WORTHINGTON,<br />\nL. M. DUVALL,<br />\nJUSSH HILT,ES<br />\nSeey-Treas.<br />\nVice-President.<br />\nPresident.<br /><br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br /><br />\nCOMMONWEALTH BANK,<br />\nEUTAW S'f.. FACING MADISON.<br />\nJORN R. HOOPER,<br />\nCEO. YAKEL,<br />\nJAB. E. WHEELER,<br />\nCashier.<br />\nVice-Prest.<br />\nPresident.<br />\n--- DIRECTORS.<br />\nJefferson J. Walsh,<br />\nLouis Yakel,<br />\nJohn N. Matthews,<br />\nJordan Stabler,<br />\nDr. T. A. Ashby, George A. BIHke.<br />\nJames R. Wheeler,<br />\nRobert Biggs,<br />\nJames H. Preston,<br />\nJease F. Ely.<br />\nMurray Vandiver,<br />\nJ. if. Ober,<br />\nGeorge Yokel.<br />\nJos. U. Valiant.<br />\nM. II. Ould,<br />\nLarge or small earns, for long or short periods, received on favorable<br />\nterms. Call at the Bank for information.<br /><br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br /><br />\nGIFFORD de JERSEY MESNY,<br /><br />\nDIRECTORS:<br />\njohn A. Whitridge,<br />\nEdgar G. Miller,<br />\nAlexander Brown,<br />\nJesse [lilies,<br />\n'Thomas Hill.<br />\nGeorge Whiteiock,<br />\nU. H. Perkins,<br />\nC. C. Shriver,<br />\nJacob I. Cohen,<br />\nT. K. Worthington.<br />\n14. Goldenberg,<br />\nRates for Title Insurance furnished on application.<br />\nWhen politicians ranted loud<br />\n\"Hear! Hear!\" is what we uttered;<br />\nBut now since football holds the crowd<br />\nY. M.13. 0. D.<br />\n\"Hair!\" Hair!\" is softly muttered.<br /><br />\nEvery visitor who \"drops in\" to our store becomes a<br />\nregular customer. Why? Because he sees at once<br />\nthat he can save money by dealing with us. Good<br />\nclothes and cheap prices is a combination hard to beat.<br />\nWAS ever before in Baltimore such a bargain as these<br />\n$to Cassimere-lined Satin-top Suits? Hundreds of<br />\nased purchasers will gladly answer\"No!\" These<br />\nStilts are all carefully made and of handsome material.<br />\nThey are going like hot cakes.<br />\nTHAT Top Coat you promised yourself! Forgotten<br />\nabout it, eh? Well, we have some extremely handsome goods in that line, but we can't tell you how soon<br />\nthey'll be gone. From Po to 1620-every fashionable<br />\nshade.<br />\nUNDERWEAR—How about it? We guarantee comfort<br />\nthat means everything. Prices from 50c. to $2.50.<br />\nWORSTED TROUSERS at $3.50. Surprising how quickly<br />\npeople snap up a genuine bargain.<br />\nA well-fitting shirt puts a man at peace with the world.<br />\nThe Star Shirt fits like a glove $1.50.<br /><br />\nArtist Photographer,<br />\n226 NORTH CHARLES STREET.<br />\nBuy your<br /><br />\nGeo. P. Mordecai,<br />\nlice-President.<br /><br />\nArthur H. Hall,<br />\nSee'y and Truss.<br /><br />\nThe A.G. Alford Sporting Goods Co.<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\n113.4111TIMOICE, MD.<br /><br />\nTelephone 2573.<br /><br />\nfrom<br /><br />\nfiEvALD<br />\n639<br /><br />\nNORTH EUTAW<br /><br />\nST., NEXT<br /><br />\nDoos<br /><br />\nUNIVER•ITY<br />\n1.1<br />\nTO -OPKIMIX<br /><br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\nGIVE us A CALL.<br />\nALL THE<br /><br />\ntatConEfY<br /><br />\nGOOD, NEW<br />\nNOVELS..'<br /><br />\n20% Discount On Coyright books to<br />\nJ. H. U. Students,<br />\nUNIVENSITY<br /><br />\nJOHNS HO.PNINS<br /><br />\n100 Sheets Paper<br />\n100 Envelopes<br />\nNo,8 Linen Note.<br />\nAzurine Note • •<br /><br />\n49c.<br />\n• 15c. per lb.<br />\n• 20c. \"<br /><br />\nWm. J. C. DULANY COMPANY.<br /><br />\nHamburgers', Baltimore &amp; Howard Sts.<br />\nOeo. L. Harrison,<br />\nPresident.<br /><br />\nCIGARS, CIGARETTES AND SMOKING TOBACCO<br /><br />\n8<br /><br />\nEAST BALTIMORE STREET.<br /><br />\nFici9s<br /><br />\nSISCO BROS.<br /><br />\nnamicrii<br /><br />\n218 N. Charles Street,<br /><br />\n114;09ts<br /><br />\nBALTIMORE, MD.<br />\n•__<br /><br />\nSAMUEL HUNT'S SONS<br /><br />\nE. BALTIMORE ST.<br /><br />\nL<br /><br />\n95<br />\nLOVES<br />\n4ALIARLIfILTO no Prom#3.<br /><br />\nReduction in Prices.<br />\nThe only ho use keeping<br />\nGloves in repair, for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time a new<br />\npair given in exchange.<br />\n81.25 London Tan Gloves<br />\nreduced to 95 cts.<br />\nSee if you can snatch them<br />\nfor 81.25.<br /><br />\nWarwick and Maryland Bicycles,<br />\nAT $100 AND $50 RESPECTIVELY—ARE LEADERS.<br />\nYOU CANNOT GET MORE FOR YOUR MONEY ANY PLACE. THEY ARE STANDARDS.<br /><br />\nC. E. ricGOWAN, 1205 14th St., N.W.,Washington, D.C.<br />\nGUGGENHEIMER, WEIL St CO., STUDENTS' REQUISITES:._<br /><br />\nBARTHOLOMAY BREWERY CO.<br /><br />\nJ NO. H ELNZE1RLI NO •<br /><br />\nHEINZERLING<br />\n&amp; co.<br /><br />\nROCHESTER, N. Y.<br /><br />\nMg<br /><br />\nW. J. WICKHAM.<br /><br />\nOffice &amp; Factory, zI8-zz W. Conway St.<br /><br />\nBohemian ot<br />\nBavarian<br />\nMaerzen gat<br />\nApollo tat to:<br /><br />\nOur<br />\nSpecialties:<br /><br />\nCHALLENGE GINGER ALE<br />\nCLUB GINGER ALE<br />\nCHAMPAGNE CIDER(ExtraDry)<br />\nSPARKLING KOLAFRA .<br />\n'pHONE • • •<br /><br />\n204<br /><br />\n1080—Telephone-2080<br /><br />\nBALTIMORE BRANCH t<br /><br />\nCatalogue No 8<br /><br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAuaR<br /><br />\nMandolins<br />\nGuitars • •<br />\nBanjos -<br /><br />\nwasbburn<br /><br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br /><br />\nH. R. EISENBRANDT SONS,<br />\nSOLE ABENTS.<br /><br />\na Month.<br /><br />\nPianos<br /><br />\nN. E. Corner<br /><br />\nCHARLES ANDIEXINGTON STS,<br /><br />\nEasiest Terms.<br /><br />\nThe enormous domade upon<br />\nno for Catalogues of our world celebrated<br />\nCHLORIDE OF SILVER DRY<br />\nCELL BATTERIES<br />\nhas entirely exhausted the three editions of<br />\nour number seven catalogue,compelling UN to<br />\nIssue now (instead of in the Spring of 1898, as<br />\noriginally intended) an entirely new and revised edition (No. 8), showing the many<br /><br />\nREMARKABLE IMPROVEMENTS<br /><br />\nmade In our Electro - Medical Batteries and<br />\nElectrodes during the Past year.<br />\nThfs book is now in press and will be the handsomest<br />\ncatalogue of such instruments ever published. If Interested, send six cents In stamps(exact cost of mailing)<br />\nand<br />\nyou will receive a copy.<br />\nChloride of Silver Dry Cell Battery Co.<br />\nBaltimore, Md., U.S. A,<br />\nMANES E. FULD. GEN'L MANAGE',<br /><br />\nTHEO. WARNER.<br /><br />\nJAMES R. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS,.<br />\nSilk and<br />\nCANTS,<br />\n..<br /><br />\nMANUFAOTURIGN Or<br /><br />\nbatters<br /><br />\n• Ca/maniere<br /><br />\nMate<br /><br />\n:?24 W. 1:1.a.1.,TX1VE012.M<br />\nAgents for Walter Barnard London Hats.<br /><br />\nJ0J-IN<br /><br />\nBALTIMORE, MU.<br /><br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4<br />\n1- Standard Machines<br />\nMimeograph Work.<br />\nrented at II per week<br /><br />\nTYPEWRITER INSPECTION &amp; SUPPLY CO,<br />\n15 NORTH STREET.<br /><br />\nKEEIDER,<br /><br />\nMAKER OF MEN'S GARMENTS,<br /><br />\nThe Chas. Willms Surgical Instrument Co.<br />\nIlzd(<br />\ntkAram('pt<br /><br />\n5 NORTH CALVERT STREET,<br />\nOpp. Equitable Building<br />\nIMO FIFTH AVE., NEAR 90TH ST.<br />\nNEW YORK.<br /><br />\n114<br /><br />\nBENJ. A. NELSON, O.,e! Alamitos.<br /><br />\nterrsa of rINE SkIIMIC.AL INSIN<br />\nTMENTS,<br />\nPhysicians', Burgeons', Hospital and Invalid Supplies,<br />\nElastic Hosiery, Trusses, Rubber Goods, Au,.<br /><br />\n300 N. HOWARD ST.,<br /><br />\nBALTIMORE, MD.<br /><br />\nTELEPHONH 771.<br /><br />\n'<br />\n1 NEW YORK TO BREMEN, • • • NORTH GERMAN LLOYD S.S. CO.4<br />\nelq, LONDON,<br />\nCABIN PASSAGE AT LOW RATES.<br /><br />\n9<br /><br />\nA. SCHUMACHER &amp; CO.<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br /><br />\n9<br /><br />\nPARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN • • • •<br />\nDIRECT.<br /><br />\nevery description.. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br /><br />\nF. It DAVIDSON &amp; C2.<br /><br />\n509 W. Franklin Street,<br /><br />\nBaltimore, Md.<br /><br />\nTelephone 2095.<br /><br />\nATLANTIC TRANSPORT LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br /><br />\nBaltimore Storage &amp; Lighterage Co.,<br />\n403-409 WATER STREE1,<br />\nBAI.TIMORE.<br /><br />\nNew York Shipping Co.,<br />\n1<br /><br />\nBROADWAY,<br />\nNEW YORK.<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 4x5 Water Street, LSecond St.]<br />\nShort Insurance for a Day<br />\n. . or Longer Period,<br /><br />\nAdjoining Custom House on theWest<br /><br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nROAM B. POST, Seely.<br /><br />\nTHOMAS I. CAREY, Plea.<br /><br />\nDIRECTORS<br />\nA. J. Ulman,<br />\nFerd. C. Latrobe,<br />\nJoshua (I. Harvey,<br />\nWilliam Harvey,<br />\nHenry James,<br />\nJames W. Bates,<br />\nAndrew D. Jones. GRIFFITH HEMMER,kilt. los<br /><br />\nBOARD OF<br /><br />"}], "field_media_file": [{"target_id": 36096, "display": null, "description": null, "target_type": "file", "target_uuid": "275d7e84-5222-4f15-98ff-fea13ab30422", "url": "http://digital.library.jhu.edu/system/files/2022-03/12094-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12094, "target_type": "node", "target_uuid": "37546e3a-8004-4798-bcaf-35fc3191ee40", "url": "/node/12094"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f1a05ef4-2097-4bf3-8253-f6d96190a2fa"}]}