{"mid": [{"value": 38063}], "uuid": [{"value": "955902b2-5031-4988-a93d-ebaa295383bb"}], "vid": [{"value": 38063}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:46:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12633-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:46:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:46:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "In* i0opkitts Nnuatrttrr<br />\n<br />\nMember Of The<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nHOME WOOD, BALTIMORE, MD.,<br />\n<br />\nVol. XXXIX—No.51<br />\n<br />\nIN TRIBUTE<br />\nTO DR. AMES<br />\nPrice, 5 Omar<br />\n<br />\nWEDNESDAY, MAY 22, 1935<br />\n<br />\nDr. Ames To End 51 Years Of Service On June 22<br />\nI<br />\n;<br />\n<br />\nSigma Phi Epsilon Annexes Interfraternity Trophy<br />\nS.P.E. Noses Out<br />\nPhi Sigma Delta<br />\nBy Five Points<br />\nWinner Scores 330 In Softball, Football, Volleyball,<br />\nAnd Basketball Leagues<br />\n<br />\nLast Game Decides<br />\nTrophy Hung On Ball Game<br />\nYesterday Between Sig Ep<br />\nAnd Tau Alpha Phi Teams<br />\nSigma Phi Epsilon gained the first<br />\nleg on the interfrat athletic trophy<br />\nas it ended the year with 330 points,<br />\nonly five ahead of second-place Phi<br />\nSigma Delta. At the same time, Sig<br />\n<br />\nLevy, Stine Elected<br />\nAs Senior Councilmen<br />\nDavid H. Levy and William Stine<br />\nwere elected the Senior representatives on the Student Council for<br />\n1935-1936.<br />\nLevy was recently elected president of the local chapter of 0. D.<br />\nK. He is a member of Pi Delta Epsilon, honorary journalism fraternity,- manager of the swimming<br />\nLearn, and Business Manager of the<br />\nNEWS-LETTER.<br />\n<br />\nStine, who belongs to the S. P. E.<br />\nfraternity, is a member of the tennis team.<br />\n<br />\nRobert C. Abrams,<br />\n'35 SAC Chairman,<br />\nMakes Final Report<br />\n<br />\nEp, winner of its division, annexed<br />\n<br />\n; Activities Committee Has<br />\nthe fraternity softball title yesterday<br />\nBalance For Fiscal Year;<br />\nby defeating Tau Alpha Phi, leader of<br />\n'News-Letter' Successful<br />\nextra inning<br />\nthe other division in an<br />\n<br />\nThe final report of the Student AcCommittee was released yestiv4ties<br />\nThe interfraternity trophy, awarded<br />\nRobert C. Abrams, chairby<br />\nterday<br />\nfor the first time this year, is preman of the body.<br />\nsented to the house scoring the highThe current year of 1934-35 was<br />\nest number of points in the four frathe first time that all activities ended<br />\nternity leagues held throughout the<br />\ntheir fiscal years with a balance. In<br />\nyear—touch football, basketball, volcommenting on the fine showing releyball, and softball. In the scoring,<br />\nalized this year by the introduction<br />\nfifteen points are awarded for a win, of a group of three undergraduates to<br />\ngame, 8 to 7.<br />\n<br />\nRetiring President<br />\n<br />\nDavid H. Levy<br />\nMeade Johnson<br />\nthosen Student Elected President<br />\nCouncil President OfHopkins O.D.K.<br />\n<br />\n\"Man Who Grew<br />\nWith Hopkins\"<br />\nPlans To Retire<br />\n<br />\nJunior In Business Econom- Macgill, Weimer Chosen For<br />\nVice-President, Treasurer<br />\nics School Named After<br />\nOf Honorary Fraternity<br />\nWithdrawal Of Emmert<br />\n<br />\nFourth President Of Hopkins<br />\nSays Plans Are Indefinite;<br />\nWill Take Six-Week Cruise<br />\n<br />\nDavid H. Levy, a junior in the ColWith the withdrawal of Leonard<br />\nof Arts and Sciences, was elected<br />\nlege<br />\nEmmert from the running, Meade<br />\nof the Beta Chapter of<br />\npresident<br />\nJohnson was unanimously elected<br />\nOmicron Delta Kappa, national honpresident of the Student Council for orary activities fraternity, at the regthe. year 1935-36. Emmert refused ular meeting held last Wednesday.<br />\nJohn C. Macgill, a junior in the<br />\nto remain a candidate, mentioning<br />\nEconomics, was<br />\nthe fact that Johnson had far more School of Business<br />\nof the honor<br />\nvice-president<br />\nnamed<br />\nexperience in that type of work.<br />\ngroup. The positions of secretary<br />\nMeade Johnson, a junior in the and treasurer went to Clarence WeimSchool of Business Economics, was er, a junior in the College of Arts and<br />\nrecently inducted into Omicron Delta Sciences, and Leonard Emmert, a<br />\nKappa and has held many positions junior in the School of Engineering,<br />\nsince he entered the Hopkins in 1932. respectively.<br />\nMeade Johnson is the only other<br />\nElected sergeant-at-arms of the<br />\nFreshman Class, he was later made member of 0. D. K., besides the offichairman of the banquet committee. cers, who will return to the UniverThe following years Johnson was sity next fall.<br />\nThe newly elected men are all very<br />\nchosen president of the Sophomore<br />\nClass, and he joined the Barnstormers active on the campus. Levy is the<br />\nClub as well as the Cotillion Board. business manager of the NEWS-LETAs a junior, be became secretary TER, is manager of the swimming<br />\nof the Cotillon Board, Student Coun- team, and was the secretary of the<br />\ncil representative of the Junior Class, Student Council for the past year.<br />\nand advertising manager of the Hulla- Macgill is the chairman of the Stubaloo. He has been nominated as- dent Activities Committee for the<br />\nsistant business manager of next coming year. He is president of the<br />\nyear's book and was elected to Pi Phi Gamma Delta fraternity, manDelta Epsilon, national honorary jour- ager of the football team and is a<br />\nrecord holder on the swimming team.<br />\nnalism fraternity.<br />\n<br />\nWill Live Here<br />\nHas Ascended Every Rung<br />\nOf Academic L add e r;<br />\nFrom Student To President<br />\nDr. Joseph Sweetman Ames, who<br />\nwill retire as president of the University in June after fifty-one years of<br />\nconnection with the Hopkins, said last<br />\nSaturday that his plans for the fuDR. AMES<br />\n<br />\nR.O.T. C. Holds<br />\nFinal Ceremony<br />\nOn J.H.U.Campus<br />\n<br />\nture are undecided.<br />\nHowever, Dr. Ames intends taking<br />\na cruise for aout six weeks. He will<br />\nleave on the 22nd of June and will<br />\nreturn to his home aout the 2nd or<br />\n3rd of August. After his return, Dr.<br />\nAmes has no definite plans, but he<br />\nbelieves that he will live in Baltimore.<br />\n<br />\nCompany C, Commanded By<br />\nCapt. Orth, Judged Best<br />\nCompany;8 Other Awards<br />\nEight awards for military excellence were presented to various mem-<br />\n<br />\nP. T. Dept. To Present<br />\nOttenheimer Elected<br />\nBand<br />\nAwards At Assembly<br />\nOf<br />\nStudent Leader<br />\n<br />\nDr. Ames said that he was not<br />\ngoing to write a book or go into<br />\nbusiness.<br />\n<br />\nHe intends taking a com-<br />\n<br />\nplete rest and may possibly take a<br />\ncruise around the world.<br />\n<br />\nDr. Ames Climbed Every<br />\n<br />\nbers of the Hopkins R. 0. T. C. Unit<br />\nStep OfAcademic Ladder<br />\nat the annual inspection held last<br />\nten points for a tie, five points for a control all activities, Abrams said:<br />\nMonday before the steps of Gilman<br />\nThere is no finer counterpart to the<br />\nIn the final assembly of the year Hall. After the inspection the assemAt a meeting held Monday after\"Success of the new set-up was due<br />\ngame played and lost, and nothing<br />\nstory of Johns Hopkins Unicomplete<br />\nof the tomorrow in Latrobe 120, the Depart- bled unit was addressed by Dr. Joentirely to the splendid cooperation noon in the Barn, the Band<br />\nfor a forfeit.<br />\nthan<br />\nthat which is mirrored<br />\nversity<br />\nJohns Hopkins University elected of- ment of Physical Training and Ath- seph S. Ames, president of the Uniof the various college<br />\nBefore yesterday's game, Phi Sig of the heads<br />\nyear.<br />\nacademic<br />\ncoming<br />\nthe<br />\nfor<br />\nficers<br />\nin the career of one of her most faithversity.<br />\nletics will make five sets of awards.<br />\nactivities. Many thanks to all the<br />\nThe officers elected were:<br />\nwas judged the best ful sons. Having been inspired by and<br />\nC<br />\nwas leading S. P. E. by ten points.<br />\nCompany<br />\nSigma Phi Epsilon will be given a<br />\nmembers of the activities and espeEdwin Ottenheimer, student leader;<br />\ndrilled of the five companies and a fostered in the ideals exemplified by<br />\nConsequently, the title was at stake.<br />\ncially to Dick Feise and Johnny Mac- Lowerre, secretary; William Gon- trophy for all-'round athletics, and cup was presented to that group.<br />\n4er founders, he has proven true to<br />\nIf Sig Ep lost to Tau Alpha Phi, Phi gill.\"<br />\ntrum, librarian; and \"Ace\" Weigand, another one for its championship in Charles E. Orth, captain of Company<br />\nthe traditions of our University, and<br />\nlatter<br />\nThis<br />\ntourney.<br />\nsoftball<br />\nthe<br />\nmajor.<br />\ndrum<br />\n\"Hullabaloo\" To Appear<br />\nC, was the recipient of a cup given<br />\nSig would win the trophy. But the<br />\naward will be donated by Mr. Fred<br />\nthan that, he has added to her<br />\n,more<br />\ncaptain<br />\nthe<br />\nfor<br />\nby Major 0. Ellis<br />\nThe Hullabaloo is printing the anS. P. E. men won the game, got fifBETA Turbeyville. A plaque will also be of the winning company.<br />\nTAU<br />\nHEAD<br />\nTO<br />\nprestige,<br />\nmade fuller her heritage, and<br />\nEMMERT<br />\nnual which will appea.4. during the<br />\nPhi frateen points for it, earned the interL. Emmert was named president of awarded to the Pi Lambda<br />\nthe value of his own perdedicated<br />\nPrivate<br />\nBest<br />\nTaylor,<br />\nfirst week in June. The publication at Tau Beta pi at a recent election. ternity for its success in the interComfrat softball plaque, and the fraterto<br />\nin<br />\nsonality<br />\nthe list of those famous<br />\nprivate<br />\na<br />\nTaylor,<br />\nB.<br />\nOliver<br />\npresent is financially sound with The other officers are G. Eager, vice- fraternity volleyball tournament.<br />\ndrilled sons and scholars, whose memories<br />\nbest<br />\nthe<br />\njudged<br />\nwas<br />\nB,<br />\npany<br />\nnity trophy for the year's work.<br />\nOf the handball tournament winmuch of a saving accomplished dur- president; W. Bittrick, corresponding<br />\nprivate and was given a medal do- are reflected in the achievements of<br />\nsecretary; J. Bullock, recording secre- ners, Kramer will be awarded a gold<br />\nThe original plan was that a fra- ing the year,\" Abrams said.<br />\nby the Baltimore Chamber of<br />\nnated<br />\nthe Johns Hopkins University.<br />\ntary; L. Hartman, treasurer; J. Ma- medal, Hernandez a silver one, and<br />\nThe Musical Club went through a<br />\nCommerce.<br />\nternity would have to win three legs<br />\nGlanz and Pasternak bronze medals.<br />\nchek, cataloguer.<br />\nNo one's life is more closely interwhatsoThe medal for excellence in milion the big trophy in order to perma- long season with no deficit<br />\nwoven with the use and full develtary efficiency went to John E.<br />\never. Conrad Beblein and Ozwald<br />\nnently possess it, but it is possible<br />\nof Hopkins than that of Dr.<br />\nopment<br />\nthe<br />\nof<br />\nmajor<br />\ncadet<br />\nthe<br />\nSchmeiser,<br />\nSteinwald were the directors of the<br />\nthat, in view of the large number of<br />\nunit. The award was given by Dr. Ames, who today is completing more<br />\nclub.<br />\nFrank Goodnow, president emeritus than half a century of active associahouses competing, the number of<br />\n'Stormers Make Profit<br />\n\"The editors of the NEWS-LETTER press a hope.<br />\nthe University.<br />\nof<br />\n\"My warning is 'Do not toy with<br />\ntion with the institution, where he<br />\nThe Barnstormer Club, in the face have asked me to write for this numlegs necessary may be reduced to<br />\nOrth Awarded Saber<br />\nhere<br />\nI<br />\n'temptation'<br />\naddressed<br />\nuse<br />\na<br />\ntemptation.'<br />\nletter<br />\na<br />\npaper<br />\ntheir<br />\nof<br />\nber<br />\nbegan as an undergraduate and is rewith<br />\nyear<br />\nthe<br />\nended<br />\nodds,<br />\nof terrific<br />\ntwo.<br />\nOrth was awarded a sabre for exto its readers. I do this with pleas- only in the sense of the idea of doing<br />\nas its president. Dr. Ames detiring<br />\nyear<br />\nfirst<br />\nthe<br />\na slight profit. It was<br />\nattainment in miliure, as I welcome an opportunity to something which you know is wrong cellent scholastic<br />\nExactly how tight the race was is<br />\na university president as the<br />\nscribes<br />\nChapBaltimore<br />\nthe<br />\nby<br />\nfor quite some time that fhe Barn- express to them, including as they —for if you know it is wrong, or if tary tactics<br />\nindicated by the fact that no fraterAssociaOfficers<br />\nof the university's ideals.<br />\nReserve<br />\nof<br />\nthe<br />\nter<br />\ninterpreter<br />\nof<br />\nMy<br />\nyou don't, no one can tell you.<br />\nstormers have been able to give two do all the undergraduate students<br />\nnity won more than one league chamStates.<br />\nthe<br />\nUnited<br />\nof<br />\ntion<br />\nidea,<br />\nthe<br />\nwith<br />\nappreciato<br />\nis<br />\nwarning<br />\ndally<br />\nnot<br />\nHe<br />\nnot<br />\nhimself<br />\nonly interprets but his<br />\nsincere<br />\nmy<br />\nshows during the same year. Both the University,<br />\nThe medal for excellence in field ife represents the embodiment of the<br />\npionship. Phi Kappa Psi won the Bill Banks and Howard Caplan, the tion of unfailing courtesy to me and nut it away from you. Form the habit<br />\nthe fact that they have not only of doing this, and soon you will act engineering was awarded to William University's principles.<br />\nfootball title; Delta Upsilon, basket- coaches of the club, served through of<br />\ncaused me absolutely no care or trou- from instinct. Recognition of right A. Hazlett. Phillip W. Guild received<br />\nJoseph Sweetman Ames, the son of<br />\nball; Pi Lambda Phi, volleyball; and the year without salary,\" continued ble but that our relations have been and wrong is largely instinctive, and the marksmanship medal awarded by<br />\nAbrams.<br />\nuniformly pleasant and friendly. No the response to temptation should be Dr. Ronald T. Abercrombie. A medal George Tapham Ames and Elizabeth<br />\nS. P. E., softball.<br />\nThe Debating Club also had a very President could possibly ask for bet- so also. The quickness of response awarded by the military department Bacon, was born in Manchester, Vermore cordial may be cultivated and the days of for excellence in machine gun work mont, on July 3, 1864. The family<br />\nseason. Two trips were ter understanding or a<br />\n13 Students To Entertain successful the year, one of them spirit of cooperation. I know full well college life is the time to do this.<br />\nwent to Joseph Miceli.<br />\nmoved from their ancestral environs<br />\nmade during<br />\nyou have learned<br />\nThe unit then formed in front of<br />\nCritic Teachers Saturday to Georgia, and the other to Phila- how many things you might have \"My hope is that<br />\nNew York and New England, and<br />\nof<br />\ndone to make my life unhappy—the or are learning a love of freedom of the Gilman Hall steps to hear Dr.<br />\ndelphia. Dr. Clifford Lyons was the outstanding fact is that you have not thought and are convinced that life Ames make his farewell address to settled in Minnesota, where Dr.<br />\nThirteen students in the course of coach of the club.<br />\nAmes spent his youth.<br />\ndone them, and I am truly grateful. is worth while only in such an at- the unit at the Hopkins.<br />\nsecondary school practice teaching<br />\nThis same idea is exBoth the band and the NEWS-LET\"Some of you may think I intend mosphere.<br />\nAt the age of fifteen, while still<br />\nDr. Ames Speaks<br />\nwill entertain their critic teachers and TER showed very successful seasons. to give you some advice, either di- pressed from a different angle in the<br />\nDr. Ames, who was introduced by attending the Shattuck School at Farnot. It motto of the University: 'The Truth<br />\neight principals of the schools in The Band took the first trip out of rectly or indirectly; but I do<br />\nMajor Gregory Hoisington, profes- ihault, Minnesota, he was fascinated<br />\nwould be both foolish and presump- will set you free.' Every member of sor of military science and tactics at<br />\nin a number of years.<br />\ncity<br />\nthe<br />\nwhich the practice work was done<br />\nby a magazine description of a young<br />\ntious for me to do so. This happens the University, student or teacher, the Hopkins, said that he was heartCotillion Board Successful<br />\nduring the past four months, at a<br />\nto be the seventeenth of May, nine- should adopt this as his personal ily in favor of the principles of the eastern university which had no backThe Cotillion Board also did reluncheon to be held Saturday in Levground but which stood for \"original<br />\nteen hundred and thirty-five, but watch-word. It is doubtful if you ever R. O. T. C.<br />\nmarkably well during the past year.<br />\nthose words do not mean to you what attain absolute truth, and it is cerering Hall.<br />\nand the raising of educaA large debt to the University was<br />\nHe said he could distinguish a research<br />\nthey do to me. I see around me a cer- tain that you will never know if you<br />\nAmong the principal guests of paid off, and the Board is expected<br />\nmember of the R. 0. T. C. unit from tional standards.\" Following his hightain world, you see a quite different do attain it. This should, however, be<br />\nhonor who will speak briefly at the to end its fiscal year with a slight one. You and I do not even speak the your constant endeavor. I personally an undergraduate who was not a school graduation in 1883, young<br />\nmember. If he ever went to another Ames traveled east and upon his arluncheon which sets a precedent in profit.<br />\nsame language, I do not know by am more afraid of orthodoxy of any<br />\nThe S. A. C. gave out 42 Varsity what mental processes your actions form than of unorthodoxy; the for- college, Dr. Ames continued, he would rival in Baltimore, he walked to the<br />\nthe College for Teachers, will be Dr.<br />\nSeals this season for work on these are guided, our sense of relative val- pier numbs the senses and tends to look to the R. 0. T. C. unit for the<br />\ntwo converted dwellings on Howard<br />\nDavid E. Weglein, superintendent of<br />\nactivities. A new contract has been ues is not the same. Old age and put one to sleep. The state of mind most desirable men.<br />\nstreet, which then sheltered the Unipublic instruction, and Dr. J. Carey signed with S. and N. Katz for the<br />\nIn closing Dr. Ames added that he<br />\nyouth are never alike. Further, ev- 9f so many people today is what can<br />\nTaylor,<br />\nassistant<br />\nsuperintendent. making of these awards, Abrams add- erything I could say would either be described only by the word 'pan- hoped the unit would be at the Hop- versity and enrolled as a candidate<br />\nfor a degree.<br />\nMembers of the department of edu- ed.<br />\nagree with your thoughts or differ ic'. Young people, of all people, should kins as long as the University operDr. Ames's record, following his<br />\nthey<br />\nwould<br />\nthat<br />\nhoped<br />\nhe<br />\nated<br />\nand<br />\nthat<br />\nthere<br />\nfirst<br />\nyear<br />\nis<br />\nthe<br />\nof<br />\nform<br />\nthe<br />\nand<br />\nthe<br />\n\"This<br />\nremedy,<br />\nin<br />\nThe<br />\ngiven<br />\nthis.<br />\nif<br />\nfall<br />\ninto<br />\nnot<br />\nfrom them,<br />\ncation here will also attend.<br />\nyour carry on in the fine way they had graduation in 1886, is a pattern which<br />\nbeen no graft whatsoeer.\"<br />\nfaintest<br />\nupon<br />\ninsist<br />\nhas<br />\nto<br />\nthe<br />\nis<br />\nnot<br />\nhave<br />\nremedy,<br />\nI<br />\npnly<br />\nand<br />\nadvice,<br />\nDr. E. Earle Franklin, associate<br />\nThe Student Activities Committee conviction that I am any wiser than right to liberty of thought. The world done in former years. As far as he closely adheres to his definition of<br />\nin education, is in charge of the affor the ensuing year consists of John you, and your problems are not mine. needs as never before this service could see, continued Dr. Ames, the R. what the perfect student should be—<br />\nfair. Entertainment will be provided Macgill, chairman; Jerome Bloom anyway. I may be permitted, how- which youth only can furnish. See 0. T. C. was a definite part of the \"original, self-directing, responsible,<br />\n(Continued on Page 2, Col. 2)<br />\ncollege curriculum.<br />\nby the practice teachers.<br />\nand Holt Maulsby.<br />\never, to give a warning and to ex(Continued on Page 2, Col. 5)<br />\n<br />\nA Letter From Dr. Ames<br />\n<br />\nI<br />\n<br />\n4<br />\n<br />\n\fHOMEWOOD,BALTIMORE, MD., MAY 22, 1935<br />\n<br />\n2<br />\n<br />\nCb e flevoz4Letter<br />\nFOUNDED 1897<br />\nSubscription per year.......<br />\nBy Mail<br />\n<br />\nA Letter From Dr. Ames<br />\n<br />\nHAIL AND FAREWELL!<br />\n<br />\n(Continued from Page 1, Col. 4)<br />\nthat you do your part and never be<br />\nafraid of where your search for truth<br />\nwill lead you.<br />\n\"About the world in which you are<br />\ngoing to live, I can tell you nothing,<br />\nI know nothing. I hope you face it<br />\n<br />\n42.50<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council. RemBen Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br />\n<br />\nunafraid in your constant pursuit of<br />\nthe Truth and in your determination<br />\nto do what you can to help. I beg you<br />\nnever to forget that each one of you<br />\nis personally responsible for the good<br />\nname of the Johns Hopkins University.\"<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postofflce in<br />\nBaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nJESSE N. BORDEN<br />\nNE.AL POTTER, IRVING LEBERFELD,<br />\nManaging Editors<br />\nJOHN C. BRASHEARS,<br />\nWILLIAM DIAMOND,<br />\nAsst. Managing Editors<br />\nHERSHNER CROSS, STANLEY FINKEL<br />\nB.<br />\nWILLIAM<br />\nLEON JACOBS ON,<br />\nNews Editors<br />\nKEMPTON<br />\nSports Editor<br />\nKENNETH ZIERLER<br />\nD. KOLKER<br />\nMARVIN<br />\nCAPLAN,<br />\nDAVID<br />\nAssistant Sports Editors<br />\nSTANLEY E. BLUMBERG, HYMAN M.<br />\nContributing Editors<br />\nLEVIN<br />\nFeature Editor<br />\nEDGAR KEMLER<br />\nJACK STEIN,<br />\nKROPMAN,<br />\nHAROLD M.<br />\nColumnists<br />\nSIDNEY GREEN<br />\nReporters<br />\nBenjamin Futernick, Jewett Goldsmith, Sigmund Safier, William<br />\nSnyder, Howard Reizenstein, Jonas<br />\nCohen, Leonard Jaffe, Lester H.<br />\nCaplan, Bernard Pinck, Julian AdIskoler, Lorman Levinson, Max<br />\nwitz, Nathaniel Finkelstein.<br />\nBUSINESS DEPARTMENT<br />\n_Business Manager<br />\nDAVID LE'VY<br />\nJULIAN CoHEN....Advertising Manager<br />\nOffice Manager<br />\nROBERT WATKINS<br />\nCirculation Manager<br />\nROBERT LEVI<br />\nSTANLEY PRAGER,<br />\nCopy and Filing Manager<br />\n<br />\nWednesday, May 22, 1935<br />\n<br />\nDr. Ames<br />\nThe closing of the present school<br />\nyear marks the termination of the<br />\nofficial career of a man who for<br />\nmore than fifty years has been intimately associated with the Johns<br />\n<br />\nT<br />\n<br />\nO A FUTURE PHYSICIST<br />\nSpectrography is the only method of determining accurately the presence or absence of the various elements in<br />\nthe material being studied. Spectrography and the<br />\nBausch &Lomb Spectrographic line warrants your careful study and investigation. Bausch & Lomb Optical<br />\nCo., 635 St. Paul Street, Rochester, New York.<br />\n<br />\nDR. JOSEPH SVVEETMAN AMES<br />\n<br />\nPOEM FOR THE DAY<br />\nBy LOUIS ALBERT BANKS<br />\n<br />\ncross-word puzzle enthusiast. His favorite pastimes are reading histories<br />\n<br />\n(Courtesy, Alumni Office)<br />\nA dream that first his fancy snared,<br />\nHow sweet the picture of this boy<br />\n(A dream maturer life has shared)<br />\nWho, dreaming of life's coming joy,<br />\nThat learning's always in the dawn—<br />\nHas suddenly, his fancy caught<br />\nWill grow in wealth as we go on.<br />\nWith this entrancing, rapturous<br />\nIs still his ruling force in life;<br />\nthought!<br />\nWith keen expectancy he's rife.<br />\nA college, altogether new,<br />\nHe's helped to build Johns Hopkins'<br />\nThat scintillates the coming view—<br />\nsoul;<br />\nThat does not stop with what is old<br />\nHis spirit animates the whole.<br />\nBut searches for unminted gold.<br />\n<br />\n,and biographies, and listening to the<br />\ncompositions of Beethoven and Bach.<br />\n<br />\nHopkins University.<br />\nDr. Joseph S. Ames has grown with<br />\nthe University. As a student he<br />\nlearned to cherish the ideals of the<br />\ninstitution which at that time was How beautiful these youthful dreams! He's helped to shape his wondrous<br />\na newcomer to the field of higher ed- Though they may end in failing<br />\ntask—<br />\nucation. As a teacher and a famed<br />\nWhat more could any scholar ask!<br />\nschemes,<br />\nphysicist he furthered these ideals, They furnish steam for all advance;<br />\nIn him Johns Hopkins buds anew;<br />\nand as President he saw them grow Are warp and woof of life's romance. She's to her lifelong spirit true—<br />\nto a full maturity.<br />\nFor Ames, rare product of her<br />\nYoung Joseph Ames, that dreaming<br />\nDr. Ames has been an ideal Presschool,<br />\nyouth,<br />\nident to the students. He is not only Through fifty years of search for<br />\nIs now her most efficient too<br />\nthe President, he is the First Man of<br />\nTo wind her splendid bugle horn—<br />\ntruth<br />\nthe University. He was reserved but Has kept his thirst for new surHe'll always sound the note of morn.<br />\nnever aloof. He was always interested<br />\nprise—<br />\nin the students and their activities.<br />\nBelieves adventure makes us wise.<br />\nIn his quiet, unobtrusive manner,<br />\nhe has always labored for the welfare of the University. Assuming office on the eve of the depression, he<br />\nhad to guide the affairs of the Hoplived up to his counsel that the Uni(Continued from Page 1, Col. 6)<br />\nkins during a time of unparalleled finversity graduate should never assume<br />\nurge<br />\ninner<br />\nthat<br />\nof<br />\npossessed<br />\nand<br />\nancial distress. Only by the most dedirec- an impassive role in the world's afcertain<br />\na<br />\nin<br />\none<br />\nleads<br />\nwhich<br />\ncisive measures has he been able to<br />\nfairs.<br />\ncontinue operations without seriously tion.\"<br />\nIn 1917 he was Chairman of the<br />\nreceiving his A.B. degree, Dr.<br />\nAfter<br />\ndisabling the University.<br />\nof the National Research<br />\nCommittee<br />\nresident<br />\na<br />\nAmes spent one year as<br />\nAlthough we say good-bye to Dr. •<br />\nBerlin. Upon his Council to study Scientific Activities<br />\nof<br />\nUniversity<br />\nthe<br />\nat<br />\nAmes when this semester is concludreturn, he was engaged the following in Warfare. In 1923 he was named as<br />\ned, we will never forget him. He will<br />\nyears (1888-91) as assistant in the Wilbur Wright Lecturer. His<br />\nthree<br />\nalways remain to us the personificaIt was during this period work in aeronautics has contributed<br />\nphysics.<br />\ntion of the true Hopkins ideal.<br />\nMrs. Mary Boykin much to the science of flying. As the<br />\ncourted<br />\nthat he<br />\nHarrison of Society Hill, South Car- Chairman of the National Advisory<br />\nolina. They were married on Septem- Committee for Aeronautics, he made<br />\nber 14, 1895. The following year Dr. up reports on progress in that field<br />\nDr. G. Wilson Shaffer announces Ames earned his Doctor of Philosophy or President Hoover. Dr. Ames is a<br />\nthat more than 600 out of the 800 un- degree. By this time he was becom- member of the Royal Aeronautical<br />\ndergraduates have taken part in the ing a part of the Unversity. He had Society of London and a member of<br />\nintramural program put into effect been caught in the contagion, spread the Royal Institute of Great Britain.<br />\nthis year. Success in this degree is by its founders \"for the noble zeal of He has also been connected with the<br />\nscarcely expected in the initial year learning for learning's sake.\" His National Academy of Sciences and<br />\nof any system.<br />\npersonal investigations serve as prac- the American Physical Society.<br />\nBehind these results lie a new spirit tical demonstrations of his advice \"to . Dr. Ames succeeded Dr. Frank J.<br />\ninstilled in the college men and the relieve one's curiosity about certain Goodnow as the Hopkins only underthe athletic phenomena.\" He always emphasizes graduate ever to become president of<br />\ncontagious enthusiasm<br />\npersonnel—Dr. Shaffer, Reuben Baer, the fact that a degree, to him, was the University. This was in 1930. The<br />\nFrank Dotterweich, Edwin Lotz, Ron- beside the point. The main thing was following years were made burdenald Levy, George Darley, and Gard- the student's interest and its chief some to him by worries over the finanpial condition of the University and<br />\nner Malone. In addition, there are object was to find out the truth.<br />\ngrief over the loss of his wife who<br />\nwas<br />\nthe two men who handle only interAmes<br />\nFrom 1891 to 1893, Dr.<br />\ncollegiate competition—Waldo Ham- an associate in physics from 1893-99, ,had been both a devoted wife and a<br />\nbleton and Dr. Kelso Morrill.<br />\nhe was associate professor and from real companion. Dr. Ames' leaderTheir attested aim has been sports 1899 to 1926 he was professor of phys- ship during the stress of the depresfor all, but the actual results may go ics and succeeded Dr. Henry A. Row- sion years has been admired and apeven beyond that. Not only will land as Director of the Physics Lab- preciated, especially because he never<br />\nsacrificed the University's reputaeverybody take part in some branch oratory.<br />\nof athletics, but many will be develIt was during these years that he tion or principles to any situation.<br />\noped into varsity material—something conducted extensive researches in , Dr. Ames has, throughout the years<br />\nthat has rarely happened at the Hop- electro-dynamics and spectroscopy. been adopted by the people of Baltikins.<br />\nHis published works during these more. They could not have shown<br />\nThe revised Department of Physical years included Theory of Physics more respect and affection for him,<br />\nTraining and Athletics has wished not Free Expansion of Gases, Prismatic liad he been a native of the city. He<br />\nto emphasize this phase of its activity, and Diffraction Spectra, Induction of has taken active interest in charity,<br />\nbut in the minds of alumni, of under- Electric Currents, and The Constitu- education, social organization and science, being a member of the School<br />\ngraduates, and of prospective under- tion of Matter.<br />\ngraduates, intercollegiate participaFrom 1924-29, Dr. Ames served the poard, of the Budget Committee of<br />\ntion is still the goal.<br />\nUniversity in the capacity of the Dean the Community Fund, and of the<br />\nBut why quibble at this time? The of the Faculty and from 1926-29 as Maryland Academy of Sciences and<br />\nnew athletic deal enters its sopho- Provost. During the long period after President of the Baltimore Country<br />\n<br />\nLIFE OF DR. AMES<br />\n<br />\nIn Review<br />\n<br />\na<br />\n<br />\nmore year cum laude.<br />\nK. Z.<br />\n<br />\nmember of the Alpha Delta Phi Fraternity, an ardent supporter of the<br />\nEinstein theories and an English<br />\n<br />\nDr. Ames resembles the practical<br />\nbusiness man; he is smooth-shaven<br />\nand vigorous. His speech is clipped,<br />\nhis manner energetic and enthusiastic. He has an air of competence and<br />\ndecisiveness about him that supplements the quick reasoning of that analytical mind, which unhesitatingly<br />\ngets to the heart of most of his problems. His fair-mindedness is reflected<br />\nin his \"open door policy to students\"<br />\nand in his abhorrence for everything<br />\nthat smacks of \"politics and pull.\"<br />\nThe finest traits of Dr. Ames are<br />\nhis broadmindedness and comprehensieness in understanding the relationships between men. He is quick to see<br />\nanother's point of view and careful<br />\nnot to wound a person's sensitiveness.<br />\nHis understanding of human nature<br />\nprevents him from assuming an air<br />\nof condescension toward younger men.<br />\nHe can still look back on his own<br />\nyouth and sympathize with the feelings of today's younger generation.<br />\nThese are the qualities that have endeared him to the students.<br />\nMuch of the personality of Dr.<br />\nAmes is expressed in his speeches and<br />\ninterviews. They give us a broad conception of his well-founded opinions.<br />\nFirst he believes that old ideas should<br />\nbe made to fit modern applications.<br />\nHe says that the fundamental problems of higher education have not<br />\nchanged, despite the fact that \"liberal<br />\neducation\" has given way to \"specialization\". Dr. Ames is fully conscious of personal differences and<br />\nsubsequently of individual needs. \"The<br />\nUniversity must do for the social sciences what it has done in the past<br />\nfor other sciences. We must learn not<br />\nonly man's environment, but man<br />\nhimself. This is rightly the task of<br />\nthe University.<br />\nDr. Ames is, intellectually, not one<br />\nof the \"old school.\" He is keenly<br />\naware of the many changes the future may usher in and declares that<br />\nthe University will not be hemmed<br />\nin by the evils of unprogressive stability. \"The minute any great institution reaches a point where it thinks<br />\nits methods are the only ways that<br />\ncan be followed and refuses to accept<br />\nchange—then that institution's service to mankind is about at an end.\"<br />\nThese ideas have been extended to<br />\ninclude the personnel of the faculty,<br />\nfor Dr. Ames thinks \"the scientist<br />\nwho is only interested in science,<br />\nmust be very stupid\" and therefore,<br />\nhe urges teachers to broaden their<br />\ncultural horizons and to stimulate<br />\noriginality.<br />\nDr. Ames is as open-minded today<br />\nas ever. \"I am,\" he says, \"not convinced that the future of our University lies in the field of advanced<br />\nstudy. I am not convinced that our<br />\n<br />\nplans are the best or must be followed<br />\nhe received his Doctorate of Laws Club.<br />\na<br />\nas fixed policies.\"<br />\nis<br />\nAmes<br />\nDr.<br />\nlife<br />\nIn his personal<br />\nfrom Washington College, Dr. Ames<br />\n<br />\n... what's left of your school term<br />\nbudget will take you home<br />\n<br />\nby GREYHOUND<br />\nYOU<br />\n<br />\nneedn't hock your faithful ticker to buy a ticket<br />\nhome. The remnants of your school-term budget will<br />\npay your fare by Greyhound.<br />\nFrequent departures enable you to leave almost any time<br />\nyou like. As you roll along springtime highways, Nature's<br />\nclean, fresh air will banish the last dull headache of final<br />\nexams and put you in the proper mood for a real vacation.<br />\n<br />\nSUMMER VACATION TRIPS<br />\nEvery popular vacation spot, major scenic area, and large<br />\ncity in America is served by Greyhound, either direct or in<br />\ncooperation with short connecting lines. Vacations by<br />\nGreyhound cost less and offer more than by any other firstclass travel method. Ask your Greyhound agent for details.<br />\n<br />\nGreyhound Bus Terminal<br />\n217-221W. Baltimore Street<br />\nPhone: PLaza 0520<br />\n<br />\nEYIROUND<br />\n<br />\n\f3<br />\n<br />\nHOME WOOD,BALTIMORE, MD., MAY 22, 1935<br />\n<br />\n. Maryland Tops<br />\nHopkins 5 To 4<br />\nIn Lacrosse<br />\nTerps Score Two Goals In<br />\nBoth Halves; Powell And<br />\nHenry Houck Score<br />\nAll-Opponent Collegiate<br />\nLacrosse Team<br />\nPicked By The Members Of The<br />\nJohns Hopkins Varsity<br />\nG.—Jack Kelly, Maryland<br />\nP.—Sam Silber, Maryland<br />\nCF.—Angus - Lamond, St. John's<br />\nF.D.—Robert Collett, Rutgers<br />\nS.D.—John Donohue, St. John's<br />\nC.—Warren Hammann, St. John's<br />\nS.A.—Richard Halvorsen, Dartmouth<br />\nF.A.—David Nopper, St. John's<br />\n0.H.—John Christhilf, Maryland<br />\nI.H.—Everett Smith, St. John's<br />\nIn a slow game, the University of<br />\nMaryland ten defeated the Jays 4-2<br />\nat Homewood Field last Saturday.<br />\nAlthough both teams showed bad<br />\npassing at times, the Terps proved<br />\nmore versatile in passing and in defensive play.<br />\nMuch of the credit for holding the<br />\nscore to suck a low one should go<br />\nto George Kahl, who in the absence<br />\nof Lou Reuling and Cliff Gilbert played a fine game at goal. Kahl, only<br />\na sophomore, has all the earmarks<br />\nof keeping the goal position as well<br />\nas any of his brilliant predecessors.<br />\nWhen Sam Silber, giant Maryland<br />\ndefense, was put out for slashing, the<br />\nJays countered their first goal. The<br />\nextra man play was tried two times<br />\nbefore Bob Levi spotted Henry Houck<br />\nopen about 15 feet from the circle.<br />\nHouck put a ground shot by Jack<br />\nKelly, the Maryland goalie.<br />\nNeither team could score during the<br />\nremaining minutes. Maryland tried a<br />\nnumber of plays and dodges, but all<br />\nwere nipped by an alert Hopkins<br />\nteam.<br />\nPowell Shoots Goal<br />\nElmer Powell shot the second Jay<br />\ngoal about four minutes after the<br />\nsecond canto opened. He rifled a hard<br />\noutside shot past Kelly after Charley<br />\nOrth had checked his defenseman's<br />\nstick to provide a perfect screen.<br />\nThat ended the Hopkins scoring.<br />\nCharlie Ellinger scored the first<br />\nMaryland tally after Rube PasareW<br />\nhad been ejected two minutes for<br />\nchecking. The same player passed<br />\nto Christhilf who shot the ball over<br />\nKahl's shoulder.<br />\nLeonard Rombro countered the<br />\nthird goal fo Maryland with Jack<br />\nTaylor on the side lines. The shot was<br />\na long outside one which was partially blocked by the Jay goalie.<br />\nThe fourth and final tally of the<br />\ngame came on Ramsay Thomas' shot.<br />\nAnother penalty was part of the cause<br />\nfor the goal since the Terps had an<br />\nextra due to Levi's banishment for<br />\nslashing.<br />\nJays Try Rally<br />\nWhat looked like a Jay rally came<br />\nwith six minutes of the game remaining. Jack Taylor succeeded in getting<br />\nthe ball and raced straight down the<br />\nfield as an extra. His pass to Houck<br />\nwas perfect, but the latter's shot hit<br />\nKelly in the chest.<br />\nStatistics show that Maryland took<br />\n32 shots, while Hopkins took 21.<br />\nKahl had 11 saves and Kelly 9.<br />\nPete Swindell did nobly in holding<br />\nthe highly-touted Charlie Ellinger to<br />\na single goal. Effinger did not dodge<br />\nPete the entire afternoon.<br />\nThe game itself made no material<br />\ndifference in the collegiate and national championship since both teams<br />\nhad been beaten by St. John's and<br />\nMt. Washington. However, it was the<br />\nfirst time in four years that Maryland has been able to defeat Hopkins in lacrosse. The defeat was the<br />\nfourth one sustained- by the Jays during the current season.<br />\n<br />\nAs A Secretary Sees Dr. Ames<br />\nThe day on which Dr. Ames was helpful things that perhaps I alone<br />\nelected President—June 3, 1929, seems know of. A kind word here or there<br />\nonly yesterday; or it might have about a recalcitrant member to his<br />\nnever been, for if any man ever \"be- colleagues; a defense of another to a<br />\nlonged\" to a job, he has. The Trus- severe critic; monetary aid—from<br />\ntees met at 10:30 in the President's his own resources—to a needy stuRoom in Remsen Hall, and shortly dent; I could go on, giving specific<br />\nafter, Dr. Tom Brown and Mr. Car- details endlessly.<br />\nWhen Dr. Ames' retirement was<br />\nlyle Barton came out of the meeting<br />\nand \"gathered him in\"—each with announced the newspapers spoke of<br />\none arm about his shoulders. It was him as \"young\" with an appreciation<br />\na very logical gesture; Dr. Ames had of the younger man's point of view.<br />\nknown them a long time—and it was This is one of his greatest attributes;<br />\na happy day for everyone. Immedi- he was one of the most successful<br />\nately after the meeting, the Presi- Deans we have ever had; he was wise<br />\ndent-Elect came to me and said, \"How in his choice of Dean Berry to succeed<br />\nwould you like me for your nevi. him, and he has been able to underboss?\" My answer was not impor- stand the students and leave, them<br />\ntant; nor intelligible. When one is the freedom of action so characterisclose to Dr. Ames and works with tic of the Hopkins.<br />\nThe difficulties of being President<br />\nhim for any length of time,—he had<br />\nbeen \"resident\" in the office as Pro- are many and varied; he must have<br />\n'vast—one's feelings are not easily ex- the patience of Job; he must have<br />\ngreat tact, understanding, sympathy,<br />\npressed without showing sentiment.<br />\nAnd now it is June, 1935, and there and above all, he must be approachable. The University has been exwill be another \"Boss\" in his chair.<br />\nThese few years have been very. tremely fortunate in having as Presshort. No one but his secretary could ident a man with all these characterknow what they have meant to the istics to lead it during the worst<br />\nUniversity and to Dr. Ames. I have years of its existence—from a finanseen faculty members wear a path cial standpoint. The faculty morale<br />\nto his door—or rather to his desk, for has been kept high, and the reputathere has been no barrier of a closed tion of the University has been wider<br />\ndoor, and very little respect for ap- spread. Dr. Ames—unassuming, and<br />\npointments. And they have brought alone—has done more intangible<br />\nhim their troubles—academic, finan- things to further this than will be<br />\ncial, domestic, and I don't know of one realized for a long time.<br />\nA President's Office is a good vanman on the faculty who can honestly<br />\nsay that he does not owe the Presi- tage point from which to judge the<br />\ndent a debt of some kind. This could University—its faculties, students,<br />\nalso extend to students—graduate and and administration. Committees meet<br />\nundergraduate—in each of whom he almost daily in the office; there is a<br />\nhas taken a personal interest, and steady stream of faculty, students,<br />\nhas given advice and assistance. This alumni back for a visit, friends of<br />\nhas not always been known to the the University, sight-seers, and so<br />\nman given it; he has done so many on. Charity-seekers have not been<br />\n<br />\nBy<br />\nCARRIE LEE WOOD<br />\n<br />\nDr. Ames Outstanding In<br />\nAeronautical Development<br />\n<br />\nturned away empty-lianded; I have<br />\nhad to try, more than once, to put a<br />\n<br />\nSynonymous with the story of aero- by 15 or 20 miles per hour. It was<br />\nnautical research and advancement thoroughly tested under Dr. Ames'<br />\ncurb on Dr. Ames' generosity, and<br />\nin the United States since the World supervision at Langley Field, Virginunsuccessful.<br />\nusually been<br />\nhave<br />\nWar, has been the name of Dr. Jo- ia, and the results proved it of first<br />\nThere has always been a good humor seph S. Ames.<br />\nimportance in the development of<br />\nDr. Ames has studied the scientific aviation.<br />\nabout the meetings, the interviews;<br />\nOn May 21, 1935, Mr. Chief Justice<br />\nand all this is directly traceable to aspects of aeronautics as a member<br />\nNational Advisory Committee Hughes of the United States Supreme<br />\nthe<br />\nof<br />\nthe character and disposition of the<br />\nfor Aeronautics. He has been asso- Court, acting in his capacity as<br />\nPresident.<br />\nciated with the Committee ever since Chancellor of the Smithsonian InstiThis is all, of course, from a sec- its inception in 1915, when he was tution, and on behalf of the Board of<br />\nretary's point of view. But I won't appointed as one of the original mem- Regents- of the Smithsonian Instituadmit that it's prejudiced, because bers by President Wilson.<br />\ntion, presented to Dr. Ames the<br />\nthat old saying \"A man's no hero to<br />\nWhen the United States entered the Langley Gold Medal for Aerodromics<br />\nhis valet\" could well be amended to World War, Dr. Ames served as the \"in recognition of the surpassing iminclude his secretary. He has criti- chairman of the Foreign Service provement of the performance, efficized himself—too severely; others Committee of the National Research ciency, and safety of American airhave criticized him at times, and not Council, which visited France and craft resulting from fundamental<br />\nalways justly, and never, as far as I England to study the origin and de- scientific researches conducted by the<br />\nknow, with the result that he has held velopment of scientific activities in National Advisory Committee for<br />\na grievance. Despite everything—de- connection with warfare.<br />\nAeronautics under the leadership of<br />\nspite the fact that he has had to fight<br />\nFrom the very outset of his con- Doctor Ames.\"<br />\nevery inch of the way for cooperation nection with the National Advisory<br />\nThe Langley Medal was established<br />\nand understanding of the University's Committee, Dr. Ames has sought to by the Board of Regents of the<br />\nproblems, I think that there has never develop an aeronautical research lab- Smithsonian Institution in 1908, and<br />\nbeen such a In4kiversally liked presi- oratory in this country that would was first presented to the Wright<br />\ndent of a university. He has retained place the United States in the fore- brothers. It has subsequently been<br />\nhis, dignity, and yet has never been front of progressive nations in the awarded only five times, to Glen H.<br />\nstiff or unbending.<br />\ndevelopment of aeronautics. Thus as a Curtis, 1913; Gustave Eiffel, 1923;<br />\nwell<br />\nas<br />\nUniversity,<br />\nresult of Dr. Ames' great personal Colonel Charles A. Lindbergh, 1927;<br />\nStudents at the<br />\nas faculty, could find something to interest and initiative a laboratory Charles M. Manly, 1929; and Rear<br />\npattern after in Dr. .Ames' life. He has been developed at Langley Field, Admiral Richard E. Byrd, 1929.<br />\nNo tribute is more fitting for Dr.<br />\nhas been an inspiration to his office; Virginia, that by virtue of researches<br />\nhe has infinite patience, and I have conducted there, merits being called Ames than as represented by the innever known him to be unkind or im- \"the world's finest aeronautical re- numerable complimentary references<br />\npolite; he is a gentleman in the true search laboratory\". The work con- to the work of the Committeee from<br />\nsense of the word. He has been a very ducted at the Langley Memorial Aer- aeronautical authorities the world<br />\neasy person to work for—never de- onautical Laboratory, as the labora- over. These references filed in the ormanding the impossible; exacting at tory is called, is of incalculable value ganization's headquarters in Washtimes to be sure, and a hard worker to the nation, for aircraft of superior ington, D. C., constitute internationwho never works anyone harder, how- performance will most likely be ul- al testimony of the efficacy of aeronautical research in the United States<br />\never, than he works himself. We have timately decisive in war.<br />\nDr. Ames became Chairman of the under Dr. Ames' leadership.<br />\nbeen friendly, not too business-like,<br />\nDr. Ames, during his years of conand anything I say is inadequate. I Executive Committee of the organization in 1919 by unanimous choice. nection with the Committee, has been<br />\nshall miss a very good friend.<br />\nThe constant and gratifying record an active member from time to time<br />\nof progress in improving the perform- of twenty subcommittees, and was<br />\nBy<br />\nance, efficiency, and safety of Amer- Chairman of the Committee on AeroLILLIAN M. HALL<br />\nican aircraft of all types and for all dynamics, Committee on Aircraft<br />\npurposes is largely the result of fun- Communications, Committee on Perdent had to rap on his door for ad- thing. As soon as Dr. Ames was in- damental scientific researches con- sonnel, Buildings, and Equipment and<br />\nmittance. He had no set hours for formed that a student had reached ducted by the National Advisory the Committee on Publication and<br />\nIntelligence. Dr. Ames has also served<br />\nconferences, but whenever he saw a this state of mind and was ready to Committee for Aeronautics under Dr.<br />\nAmes' general direction as its Chair- as Director of the Office of Aeronaugentleleave,<br />\nthe<br />\nand<br />\ntrunk<br />\nhis<br />\npack<br />\ntimid face peering in he immediately<br />\ntical Intelligence from 1919 to date;<br />\nman would receive a summons to the man.<br />\ninvited the owner to enter, and would<br />\nof Special Conferennes on<br />\nChairman<br />\nas<br />\nIn<br />\nwork<br />\nhis<br />\nChairof<br />\nrecognition<br />\nencouraged<br />\nbe<br />\nthere<br />\nwould<br />\noffice. He<br />\nbegin the conversation by saying, to speak of his difficulties and, after man of the Committee, Dr. Ames re- Nomenclature for Aeronautics since<br />\n\"Well, what's on your mind?\" He was talking things over with the Director, ceived from the hands of President 1916, chairman of annual aircraft engineering research conferences with<br />\nalways willing to discuss their prob- he would come forth with a most de- Hoover at the White House the Colaircraft industry from 1926 to<br />\nthe<br />\nlier<br />\nin<br />\nTrophy<br />\nThis<br />\n1930.<br />\ntrophy,<br />\nto<br />\nlems with them, but grew very im- termined look on his face—ready<br />\nwhich is awarded annually, went to date; member of the Executive Comdo and to dare.<br />\npatient when they failed to use their<br />\nIt was this interest, not only in Dr. Ames in recognition of the de- mittee since 1915 and Chairman since<br />\nbrains. He endeavored to have each their work but in them personally velopment of a device for stream- 1919; and as Chairman of the Naman stand upon his own feet. It was which endeared Dr. Ames to his stu- lining radial air-cooled engines and tional Advisory Committee for Aeroa difficult task which did not al- dents. That the interest has been kept thus increasing the speed of airplanes nautics since 1927.<br />\nways meet with success.<br />\nis shown by the fact that to this day<br />\nOccasionally when a student would students who left the University many<br />\nask a question the answer to which he years ago still consider it a privilege<br />\n11•11161.1111111111111E<br />\nshould have learned in Undergradu- to come back to Baltimore if only<br />\nview<br />\nate Physics, Dr. Ames would<br />\nfor a few hours in order to discuss<br />\nhim sternly and say: \"The answer to their latest problems with the Di\\SHOES FOR MEN<br />\nyour question is in the book. I know rector. No matter how busy he may<br />\nit is, I wrote it myself.\" With a crest- be, he can always find time to give<br />\nfallen look the student would retire an ear to a former student and his<br />\nto review the book. (Theory of Phys- latest problem.<br />\nics).<br />\nDr. Ames apparently felt responsible for all students in Physics. He<br />\ncame to the laboratory before nine<br />\nin the morning and, except for a lunch<br />\nperiod, he spent the day there.<br />\nIn the old Physical Laboratory<br />\nA Phase of Preventive Medicine<br />\ndown town it was his custom daily to<br />\nCollege Men find in it unusual<br />\nstart in the tower of the building and<br />\nopportunities for a career<br />\nvisit each and every student who was<br />\nUNIVERSITY<br />\nHARVARD<br />\nengaged in research work to see what<br />\nDENTAL SCHOOL<br />\nprogress he was making. He would<br />\nA competent course of preparation for<br />\nthe dental profession. A 'Class A\"<br />\nthen visit the undergraduate laboraSchool. Write for catalogue.<br />\ntories and stand quietly behind a<br />\nLEROY M.S. MINER, D.M.D., M.D., Dean<br />\nDept. 9. 188 Longwood Ave., Boston, Mass.<br />\ngroup of students at work on some<br />\nMany Styles,<br />\nexperiment and electrify them by<br />\nIncluding<br />\nasking a question as to what they<br />\nALL-WHITE<br />\nwere doing.<br />\n<br />\nAmes - - The Teacher<br />\nDr. Ames' name<br />\n<br />\nmid that of the<br />\n<br />\nUniversity have been so closely allied for so many years, it is difficult to<br />\nthink of the one without the other.<br />\nOver fifty years ago he entered its<br />\ndoors as an undergraduate student;<br />\nhe leaves as President. In the meantime he has received its degrees and<br />\nhas occupied every position of importance it has had to offer. He has<br />\ngrown with the University and has<br />\nproved himself always a loyal student and a tireless worker in its behalf.<br />\nAmong his outstanding successes<br />\nis a wholesome and lasting imprint<br />\nmade upon his students.<br />\nHaving come in contact with him<br />\nin the Physical Laboratory for many<br />\nyears, I have seen him not only as a<br />\nteacher, but as a counselor and friend<br />\nto all those students who came under<br />\nhis guidance. It is this relationship<br />\nwith his students I would like to<br />\ndwell upon briefly.<br />\nIt is a well-known fact that as a<br />\nteacher Dr. Ames has always stood<br />\nin the first ranks of that profession.<br />\nDr. Ames was a very serious lecturer and demanded the undivided attention of his students, objecting to<br />\nany notes beTfig made by the students while he was teaching. He liked<br />\nto have the eyes of the students and<br />\nthey soon found out that it was well<br />\nto keep their brains working as well,<br />\nfor Dr. Ames seemed to know when<br />\na mind began to wander, and would<br />\npounce upon the wanderer with a<br />\nquestion which would bring him back<br />\nand keep him alert.<br />\nIn the early days he had but one<br />\ncopy of his lectures, carefully written up, and left upon his desk for<br />\nthe use of his students while writing<br />\nup the lecture to which they had just<br />\nlistened, but in later years mimeographed copies of his lectures were<br />\ndistributed among his students, to<br />\ntheir delight.<br />\nDr. Ames was at all times available to his students. He believed in<br />\nthe \"open door\" policy, and no stu-<br />\n<br />\nJune Week<br />\nTickets On Sale In Levering Hall<br />\n<br />\nTESTED<br />\n<br />\nA Splendid<br />\nGroup Of<br />\n<br />\nTHE NEW<br />\n<br />\nDENTISTRY<br />\n<br />\nOne other fact lingers in my memory in regard to his interest in his<br />\nstudents. It was not an unusual thing<br />\nfor a graduate student to become disgusted with himself during the first<br />\nfew weeks of his residence in the<br />\nUniversity. He felt he knew so little,<br />\nthe lectures were all above his head<br />\nand he could never hope to reach up<br />\nto them. Really an excellent state of<br />\nmind for any student, for then he<br />\nbegins to work and amount to some-<br />\n<br />\ns4•95<br />\n<br />\nBring Your \"Date\" on<br />\nthis Dat e to the<br />\n<br />\nAnnual Spring<br />\nDance<br />\nof the Delta Phi<br />\nof Baltimore<br />\n<br />\n25<br />\n<br />\nLevering Hall<br />\n9 p.m. to 1 a.m.<br />\n$1.50 Per Couple<br />\n<br />\nCOMMENCEMENT GIFTS<br />\nARE IN ORDER<br />\nfrom FAMILY and FRIENDS<br />\nThe tactful Graduate-to-be suggests what he would like. And we<br />\nsuggest that what he likes is, in nine cases out of ten, to be found at<br />\nHutzler's. Among them, handkerchiefs — belt and buckle sets — pipes —<br />\nfountain pens — pen and pencil sets — stationery — golf sweaters —<br />\nties — evening and cuff link sets.<br />\n<br />\nHUTZLER BIMEM<br />\n4.4.4.4.4-•-•-•••4•4......4-4.4.4.4.4.4-44.4.4.4.4.4.4.4•••-..4.4.4.4.4•4•4•••..o.4.4.4.4.4.4.4.4.4.4.4.4....•4<br />\n<br />\nSPORT SHOES<br />\n<br />\nASK —<br />\nLou Reuling and Tom Callahan—Representing<br />\n<br />\nIFESS\" SIDS<br />\nSoles of Honor Since 1873<br />\n<br />\n8 East Baltimore Street<br />\n<br />\nTHE HOME OF<br />\n<br />\nHART SF 4FFNER<br />\n<br />\nMARX,<br />\n<br />\nSOCIETY BRAND and WAKELY CLOTHES<br />\nBaltimore, Charles and Fayette<br />\n<br />\nCAlyert 4444<br />\n<br />\n\fHOMEWOOD. BALTIMORE, MD., MAY 22, 1935<br />\n<br />\n4<br />\nfh.<br />\n<br />\nDr. Ames - - - As His Colleagues See Him<br />\nForty-odd years ago I sat in a<br />\nPhysics class, and hoped that my<br />\ninstructor would not call upon me.<br />\nIt was a somewhat trying experience<br />\nfor a pupil with an unscientific mind<br />\n—perhaps it was a trying experience<br />\nfor the instructor as well. Anyway, I<br />\ngot through my course, and now the<br />\nWhirligig of Time has brought me to<br />\nwhere I am to contribute a word of<br />\ntribute to my erstwhile instructor,<br />\nnow retiring as President of the University.<br />\nThere have been and will be many<br />\ntributes to President Ames. For that<br />\nreason I feel like reserving my own<br />\nto his consideration in one particular<br />\naspect: as a reader of books in general, and as an encourager of general reading.<br />\nI remember once hearing Dr. Ames<br />\ndeclare that the real test of a man's<br />\neducation is what he does with his<br />\nleisure. From his own wide knowledge of all sorts of books outside of<br />\nhis special field, one might suppose<br />\nhe spends all his leisure reading.<br />\nAgain and again I have heard some<br />\nbook, old or recent, mentioned in his<br />\npresence, and have heard him show<br />\nunmistakable—faimmediate—and<br />\nmiliarity with its contents. How does<br />\nhe do it? I should suggest that he<br />\nspends both leisure and working<br />\nhours in reading, but what he has<br />\ndone in travel, aviation, science, and<br />\nadministration renders this theory<br />\ndoubtful.<br />\nMost people draw such a long face<br />\nwhen education is mentioned. Apparently they consider it the technique<br />\nof knowledge transfusion while the<br />\nvictim is in a proper state of narcosis or anesthesia. Dr. Ames does<br />\nsomething better than define education: he shows it. May he live long<br />\nand happily to enjoy it in his welldeserved leisure!<br />\nL. WARDLAW MIT.F.,S.<br />\nDuring his long career as student,<br />\nteacher, and administrator, President<br />\nAmes has always been a loyal and<br />\ndevoted servant of the University. It<br />\nis the hope of my colleagues that he<br />\nwill have many happy years in which<br />\nto look back upon the services he has<br />\nrendered and that, his successors will<br />\nlabor for the Jdhns Hopkins with<br />\nequal devotion and loyalty.<br />\nH. C. LANCASTER.<br />\n<br />\nI was a graduate student from<br />\nFrom this company will come the<br />\nsame \"hail and farewell!\" with which 1903-1906 during which period the<br />\ncourses on theoretical physics were<br />\nall Homewood rings.<br />\ngiven by Professor Ames. Although<br />\nJACOB H. HOLLANDER.<br />\nthirty years have since elapsed, the<br />\nWhatever, the future may hold in memory of his lectures is still fresh.<br />\nstore for the Johns Hopkins Univer- Each lecture was a masterpiece of<br />\nsity, the retirement of President logical perfection. When the final<br />\nAmes marks the end of an era. Dur- Q. E. D. had been written, we had the<br />\ning the most trying period in its his- impression of a gem, brilliant and<br />\ntory, President Ames has not only flawless. As a lecturer on mathematpersonified all that was noblest and ical physics, it was generally conbest in the traditions of the Univer- ceded, he had no peer.<br />\nWhile he was great as a teacher, he<br />\nsity, he has, in a very real,way, been<br />\nwas greater as a man. During one<br />\nthe University.<br />\nNo other University president has of his recent public utterances Presibeen as near or as dear to students dent Ames stated that one of the few<br />\nand faculty alike, and this because guiding principles in his life was the<br />\nno other has been as honest, conscien- desire to be of help to others. This<br />\ntious, wise, friendly, frank and up- principle, I know, had already been<br />\nadopted in those early years. To this<br />\nright.<br />\nOver a half century of association day his former students hold him in<br />\nhas woven Ames into the warp and affectionate regard.<br />\nA. H. PFUND.<br />\nwoof of the University fabric and<br />\nthis will remain when he relinquishes<br />\nFor a quarter of a century Dr. Ames'<br />\nthe command in June.<br />\nlectures on theoretical physics were<br />\nEDWARD W. BERRY.<br />\nregularly attended by all of the gradA university is a democracy gov- uate students in the department, and<br />\nerned by an autocrat. When he is an furnished them with a solid foundaaristocrat, the democratic atmos- tion on which to build their further<br />\nphere of the university becomes more investigations. He had a firm grasp of<br />\ndemocratic than ever. The aristo- the subject and kept abreast of all of<br />\ncratic autocrat is never surrounded the new developments. While not an<br />\nby restrictions and by useless cere- experimentalist himself, he initiated<br />\nmonies. He is available to everyone many of the important investigations<br />\nand at every time. It is only the aris- carried on in the laboratory and was<br />\ntocrat who can be really and sanely untiring in his efforts to encourage<br />\nand assist the students working undemocratic.<br />\nThose of us who have lived for der his supervision, inspiring them<br />\nthese last years under the rule of with enthusiasm for further scientific<br />\nPresident Ames know that these work.<br />\nPresident Ames's active life in<br />\nthings are true. In order to bring<br />\nour various difficulties before the physics has spanned the period bePresident, we have merely had to tween the era of sporadic individual<br />\nwalk into his little anteroom and sit effort of the earlier day to the presthere until he was ready to receive ent highly organized advance along<br />\nR. W. WOOD.<br />\nus. The youngest instructor had as all lines<br />\ncomplete and immediate access to<br />\n\"Not in one but perhaps once in a<br />\nhim as the most distinguished and<br />\nthe oldest professor. He did not sit million blue moons is it given to one<br />\nfar away on a high Olympus, looking man to tread every rung of the acaddown with vague interest upon the emic ladder; as undergraduate, gradactivities of the university's life. He uate student, fellow, assistant, assowas of us and with us and yet none ciate, associate professor, director,<br />\nof us, ever for a moment, treated him provost, and president, Dr. Ames has<br />\nas if we were all on the same level. distinguished himself. A born leader<br />\nIt is always better to be able to look and executive, he has pushed from<br />\neach position to the higher by eviup to somone than to look down.<br />\nE. E. REED.<br />\ndent fitness.<br />\nJOHN RATTHBONE OLIVER.<br />\n<br />\nPkene Belmont 7908<br />\n<br />\nBirely's Pharmacy<br />\nst. Paul at 33rd Street<br />\nPreaceiptiene-Schoel Supplies-Candy<br />\nagora - Unexcelled<br />\nFountain $ervice<br />\n<br />\nIt is right that the undergraduate<br />\nstudent body of Johns Hopkins should<br />\nvoice their feelings at the retirement<br />\nof President Ames. During his long<br />\nassociation with Johns Hopkins, he<br />\nhas run the full course of membership. In every station he has shown<br />\nthe deepest concern in the junior student body. The College has been to<br />\nhim coordinate with the University<br />\n—embodying its ideals, sharing its<br />\nproblems, rejoicing in its triumphs.<br />\nFree Manicuring<br />\n<br />\nTheodore's Barber Shop<br />\nFormerly with ENIIL CAYE<br />\nS. W. Cor. St. Paul and 33d Streets<br />\nNext to Birely's<br />\n3 A. M. to 8 P.M.<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br />\n<br />\nPrinters of<br />\nPHILOLOGICAL and SCIENTIFIC<br />\nPUBLICATIONS<br />\n12-20 HOPKINS PLACE, B41,713401=<br />\n<br />\nNo delivery too small. Bel. 5318<br />\n<br />\n•<br />\n<br />\nMy acquaintance with President<br />\nAmes began about twenty-five years<br />\nago. Since then we have met from<br />\ntime to time with increasing frequency, and from our acquaintance<br />\nhas developed one of the most enjoyable friendships of my entire life.<br />\nSince he has been President of the<br />\nUniversity our relations have of<br />\ncourse been very close, both person-•<br />\nally and officially. He came to the<br />\npresidency in 1929 Just at the beginning of the movement which we now<br />\nspeak of as the depression, and the<br />\nproblems confronting the President<br />\nof the Johns Hopkins University have<br />\nbeen very greatly increased on that<br />\naccount. The available income has<br />\nbeen less than formerly, just as has<br />\nbeen the case with all similar institutions and with practically all individuals. President Ames has dealt<br />\nwith that question in a very able manner and he has also been able, thru<br />\nhis leadership, to secure the hearty<br />\nand loyal cooperation of the faculty<br />\nand University staff throughout.<br />\nDANIEL WILLARD.<br />\nBetween the record of Joseph S.<br />\nAmes, admitted as a matriculate in<br />\nOctober, 1883, from the Shattuck<br />\nSchool, and that of President Ames,<br />\n1935,<br />\napproaching retirement in<br />\nstretches more than half a century of<br />\nactive and fruitful association with<br />\nthe Johns Hopkins University upon<br />\nwhich any man might look back with<br />\npride. As president emeritus, Dr.<br />\nAmes will enjoy the respect and affection of his colleagues and former<br />\nstudents and their good wishes for<br />\nthe happy years for which his temperament and his broad interest in<br />\naffairs so admirably fit him.<br />\nJOHN C. FRENCH,<br />\nLibrarian.<br />\n<br />\nPeabody Pharmacy<br />\n<br />\ncm<br />\n<br />\ndown to<br />\ncorner to get some<br />\nmore Chesterfields<br />\n.•.....•\".<br />\n<br />\n•<br />\n<br />\n\f", "format": "basic_html", "processed": "In* i0opkitts Nnuatrttrr<br /><br />\nMember Of The<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nHOME WOOD, BALTIMORE, MD.,<br /><br />\nVol. XXXIX—No.51<br /><br />\nIN TRIBUTE<br />\nTO DR. AMES<br />\nPrice, 5 Omar<br /><br />\nWEDNESDAY, MAY 22, 1935<br /><br />\nDr. Ames To End 51 Years Of Service On June 22<br />\nI<br />\n;<br /><br />\nSigma Phi Epsilon Annexes Interfraternity Trophy<br />\nS.P.E. Noses Out<br />\nPhi Sigma Delta<br />\nBy Five Points<br />\nWinner Scores 330 In Softball, Football, Volleyball,<br />\nAnd Basketball Leagues<br /><br />\nLast Game Decides<br />\nTrophy Hung On Ball Game<br />\nYesterday Between Sig Ep<br />\nAnd Tau Alpha Phi Teams<br />\nSigma Phi Epsilon gained the first<br />\nleg on the interfrat athletic trophy<br />\nas it ended the year with 330 points,<br />\nonly five ahead of second-place Phi<br />\nSigma Delta. At the same time, Sig<br /><br />\nLevy, Stine Elected<br />\nAs Senior Councilmen<br />\nDavid H. Levy and William Stine<br />\nwere elected the Senior representatives on the Student Council for<br />\n1935-1936.<br />\nLevy was recently elected president of the local chapter of 0. D.<br />\nK. He is a member of Pi Delta Epsilon, honorary journalism fraternity,- manager of the swimming<br />\nLearn, and Business Manager of the<br />\nNEWS-LETTER.<br /><br />\nStine, who belongs to the S. P. E.<br />\nfraternity, is a member of the tennis team.<br /><br />\nRobert C. Abrams,<br />\n'35 SAC Chairman,<br />\nMakes Final Report<br /><br />\nEp, winner of its division, annexed<br /><br />\n; Activities Committee Has<br />\nthe fraternity softball title yesterday<br />\nBalance For Fiscal Year;<br />\nby defeating Tau Alpha Phi, leader of<br />\n'News-Letter' Successful<br />\nextra inning<br />\nthe other division in an<br /><br />\nThe final report of the Student AcCommittee was released yestiv4ties<br />\nThe interfraternity trophy, awarded<br />\nRobert C. Abrams, chairby<br />\nterday<br />\nfor the first time this year, is preman of the body.<br />\nsented to the house scoring the highThe current year of 1934-35 was<br />\nest number of points in the four frathe first time that all activities ended<br />\nternity leagues held throughout the<br />\ntheir fiscal years with a balance. In<br />\nyear—touch football, basketball, volcommenting on the fine showing releyball, and softball. In the scoring,<br />\nalized this year by the introduction<br />\nfifteen points are awarded for a win, of a group of three undergraduates to<br />\ngame, 8 to 7.<br /><br />\nRetiring President<br /><br />\nDavid H. Levy<br />\nMeade Johnson<br />\nthosen Student Elected President<br />\nCouncil President OfHopkins O.D.K.<br /><br />\n\"Man Who Grew<br />\nWith Hopkins\"<br />\nPlans To Retire<br /><br />\nJunior In Business Econom- Macgill, Weimer Chosen For<br />\nVice-President, Treasurer<br />\nics School Named After<br />\nOf Honorary Fraternity<br />\nWithdrawal Of Emmert<br /><br />\nFourth President Of Hopkins<br />\nSays Plans Are Indefinite;<br />\nWill Take Six-Week Cruise<br /><br />\nDavid H. Levy, a junior in the ColWith the withdrawal of Leonard<br />\nof Arts and Sciences, was elected<br />\nlege<br />\nEmmert from the running, Meade<br />\nof the Beta Chapter of<br />\npresident<br />\nJohnson was unanimously elected<br />\nOmicron Delta Kappa, national honpresident of the Student Council for orary activities fraternity, at the regthe. year 1935-36. Emmert refused ular meeting held last Wednesday.<br />\nJohn C. Macgill, a junior in the<br />\nto remain a candidate, mentioning<br />\nEconomics, was<br />\nthe fact that Johnson had far more School of Business<br />\nof the honor<br />\nvice-president<br />\nnamed<br />\nexperience in that type of work.<br />\ngroup. The positions of secretary<br />\nMeade Johnson, a junior in the and treasurer went to Clarence WeimSchool of Business Economics, was er, a junior in the College of Arts and<br />\nrecently inducted into Omicron Delta Sciences, and Leonard Emmert, a<br />\nKappa and has held many positions junior in the School of Engineering,<br />\nsince he entered the Hopkins in 1932. respectively.<br />\nMeade Johnson is the only other<br />\nElected sergeant-at-arms of the<br />\nFreshman Class, he was later made member of 0. D. K., besides the offichairman of the banquet committee. cers, who will return to the UniverThe following years Johnson was sity next fall.<br />\nThe newly elected men are all very<br />\nchosen president of the Sophomore<br />\nClass, and he joined the Barnstormers active on the campus. Levy is the<br />\nClub as well as the Cotillion Board. business manager of the NEWS-LETAs a junior, be became secretary TER, is manager of the swimming<br />\nof the Cotillon Board, Student Coun- team, and was the secretary of the<br />\ncil representative of the Junior Class, Student Council for the past year.<br />\nand advertising manager of the Hulla- Macgill is the chairman of the Stubaloo. He has been nominated as- dent Activities Committee for the<br />\nsistant business manager of next coming year. He is president of the<br />\nyear's book and was elected to Pi Phi Gamma Delta fraternity, manDelta Epsilon, national honorary jour- ager of the football team and is a<br />\nrecord holder on the swimming team.<br />\nnalism fraternity.<br /><br />\nWill Live Here<br />\nHas Ascended Every Rung<br />\nOf Academic L add e r;<br />\nFrom Student To President<br />\nDr. Joseph Sweetman Ames, who<br />\nwill retire as president of the University in June after fifty-one years of<br />\nconnection with the Hopkins, said last<br />\nSaturday that his plans for the fuDR. AMES<br /><br />\nR.O.T. C. Holds<br />\nFinal Ceremony<br />\nOn J.H.U.Campus<br /><br />\nture are undecided.<br />\nHowever, Dr. Ames intends taking<br />\na cruise for aout six weeks. He will<br />\nleave on the 22nd of June and will<br />\nreturn to his home aout the 2nd or<br />\n3rd of August. After his return, Dr.<br />\nAmes has no definite plans, but he<br />\nbelieves that he will live in Baltimore.<br /><br />\nCompany C, Commanded By<br />\nCapt. Orth, Judged Best<br />\nCompany;8 Other Awards<br />\nEight awards for military excellence were presented to various mem-<br /><br />\nP. T. Dept. To Present<br />\nOttenheimer Elected<br />\nBand<br />\nAwards At Assembly<br />\nOf<br />\nStudent Leader<br /><br />\nDr. Ames said that he was not<br />\ngoing to write a book or go into<br />\nbusiness.<br /><br />\nHe intends taking a com-<br /><br />\nplete rest and may possibly take a<br />\ncruise around the world.<br /><br />\nDr. Ames Climbed Every<br /><br />\nbers of the Hopkins R. 0. T. C. Unit<br />\nStep OfAcademic Ladder<br />\nat the annual inspection held last<br />\nten points for a tie, five points for a control all activities, Abrams said:<br />\nMonday before the steps of Gilman<br />\nThere is no finer counterpart to the<br />\nIn the final assembly of the year Hall. After the inspection the assemAt a meeting held Monday after\"Success of the new set-up was due<br />\ngame played and lost, and nothing<br />\nstory of Johns Hopkins Unicomplete<br />\nof the tomorrow in Latrobe 120, the Depart- bled unit was addressed by Dr. Joentirely to the splendid cooperation noon in the Barn, the Band<br />\nfor a forfeit.<br />\nthan<br />\nthat which is mirrored<br />\nversity<br />\nJohns Hopkins University elected of- ment of Physical Training and Ath- seph S. Ames, president of the Uniof the various college<br />\nBefore yesterday's game, Phi Sig of the heads<br />\nyear.<br />\nacademic<br />\ncoming<br />\nthe<br />\nfor<br />\nficers<br />\nin the career of one of her most faithversity.<br />\nletics will make five sets of awards.<br />\nactivities. Many thanks to all the<br />\nThe officers elected were:<br />\nwas judged the best ful sons. Having been inspired by and<br />\nC<br />\nwas leading S. P. E. by ten points.<br />\nCompany<br />\nSigma Phi Epsilon will be given a<br />\nmembers of the activities and espeEdwin Ottenheimer, student leader;<br />\ndrilled of the five companies and a fostered in the ideals exemplified by<br />\nConsequently, the title was at stake.<br />\ncially to Dick Feise and Johnny Mac- Lowerre, secretary; William Gon- trophy for all-'round athletics, and cup was presented to that group.<br />\n4er founders, he has proven true to<br />\nIf Sig Ep lost to Tau Alpha Phi, Phi gill.\"<br />\ntrum, librarian; and \"Ace\" Weigand, another one for its championship in Charles E. Orth, captain of Company<br />\nthe traditions of our University, and<br />\nlatter<br />\nThis<br />\ntourney.<br />\nsoftball<br />\nthe<br />\nmajor.<br />\ndrum<br />\n\"Hullabaloo\" To Appear<br />\nC, was the recipient of a cup given<br />\nSig would win the trophy. But the<br />\naward will be donated by Mr. Fred<br />\nthan that, he has added to her<br />\n,more<br />\ncaptain<br />\nthe<br />\nfor<br />\nby Major 0. Ellis<br />\nThe Hullabaloo is printing the anS. P. E. men won the game, got fifBETA Turbeyville. A plaque will also be of the winning company.<br />\nTAU<br />\nHEAD<br />\nTO<br />\nprestige,<br />\nmade fuller her heritage, and<br />\nEMMERT<br />\nnual which will appea.4. during the<br />\nPhi frateen points for it, earned the interL. Emmert was named president of awarded to the Pi Lambda<br />\nthe value of his own perdedicated<br />\nPrivate<br />\nBest<br />\nTaylor,<br />\nfirst week in June. The publication at Tau Beta pi at a recent election. ternity for its success in the interComfrat softball plaque, and the fraterto<br />\nin<br />\nsonality<br />\nthe list of those famous<br />\nprivate<br />\na<br />\nTaylor,<br />\nB.<br />\nOliver<br />\npresent is financially sound with The other officers are G. Eager, vice- fraternity volleyball tournament.<br />\ndrilled sons and scholars, whose memories<br />\nbest<br />\nthe<br />\njudged<br />\nwas<br />\nB,<br />\npany<br />\nnity trophy for the year's work.<br />\nOf the handball tournament winmuch of a saving accomplished dur- president; W. Bittrick, corresponding<br />\nprivate and was given a medal do- are reflected in the achievements of<br />\nsecretary; J. Bullock, recording secre- ners, Kramer will be awarded a gold<br />\nThe original plan was that a fra- ing the year,\" Abrams said.<br />\nby the Baltimore Chamber of<br />\nnated<br />\nthe Johns Hopkins University.<br />\ntary; L. Hartman, treasurer; J. Ma- medal, Hernandez a silver one, and<br />\nThe Musical Club went through a<br />\nCommerce.<br />\nternity would have to win three legs<br />\nGlanz and Pasternak bronze medals.<br />\nchek, cataloguer.<br />\nNo one's life is more closely interwhatsoThe medal for excellence in milion the big trophy in order to perma- long season with no deficit<br />\nwoven with the use and full develtary efficiency went to John E.<br />\never. Conrad Beblein and Ozwald<br />\nnently possess it, but it is possible<br />\nof Hopkins than that of Dr.<br />\nopment<br />\nthe<br />\nof<br />\nmajor<br />\ncadet<br />\nthe<br />\nSchmeiser,<br />\nSteinwald were the directors of the<br />\nthat, in view of the large number of<br />\nunit. The award was given by Dr. Ames, who today is completing more<br />\nclub.<br />\nFrank Goodnow, president emeritus than half a century of active associahouses competing, the number of<br />\n'Stormers Make Profit<br />\n\"The editors of the NEWS-LETTER press a hope.<br />\nthe University.<br />\nof<br />\n\"My warning is 'Do not toy with<br />\ntion with the institution, where he<br />\nThe Barnstormer Club, in the face have asked me to write for this numlegs necessary may be reduced to<br />\nOrth Awarded Saber<br />\nhere<br />\nI<br />\n'temptation'<br />\naddressed<br />\nuse<br />\na<br />\ntemptation.'<br />\nletter<br />\na<br />\npaper<br />\ntheir<br />\nof<br />\nber<br />\nbegan as an undergraduate and is rewith<br />\nyear<br />\nthe<br />\nended<br />\nodds,<br />\nof terrific<br />\ntwo.<br />\nOrth was awarded a sabre for exto its readers. I do this with pleas- only in the sense of the idea of doing<br />\nas its president. Dr. Ames detiring<br />\nyear<br />\nfirst<br />\nthe<br />\na slight profit. It was<br />\nattainment in miliure, as I welcome an opportunity to something which you know is wrong cellent scholastic<br />\nExactly how tight the race was is<br />\na university president as the<br />\nscribes<br />\nChapBaltimore<br />\nthe<br />\nby<br />\nfor quite some time that fhe Barn- express to them, including as they —for if you know it is wrong, or if tary tactics<br />\nindicated by the fact that no fraterAssociaOfficers<br />\nof the university's ideals.<br />\nReserve<br />\nof<br />\nthe<br />\nter<br />\ninterpreter<br />\nof<br />\nMy<br />\nyou don't, no one can tell you.<br />\nstormers have been able to give two do all the undergraduate students<br />\nnity won more than one league chamStates.<br />\nthe<br />\nUnited<br />\nof<br />\ntion<br />\nidea,<br />\nthe<br />\nwith<br />\nappreciato<br />\nis<br />\nwarning<br />\ndally<br />\nnot<br />\nHe<br />\nnot<br />\nhimself<br />\nonly interprets but his<br />\nsincere<br />\nmy<br />\nshows during the same year. Both the University,<br />\nThe medal for excellence in field ife represents the embodiment of the<br />\npionship. Phi Kappa Psi won the Bill Banks and Howard Caplan, the tion of unfailing courtesy to me and nut it away from you. Form the habit<br />\nthe fact that they have not only of doing this, and soon you will act engineering was awarded to William University's principles.<br />\nfootball title; Delta Upsilon, basket- coaches of the club, served through of<br />\ncaused me absolutely no care or trou- from instinct. Recognition of right A. Hazlett. Phillip W. Guild received<br />\nJoseph Sweetman Ames, the son of<br />\nball; Pi Lambda Phi, volleyball; and the year without salary,\" continued ble but that our relations have been and wrong is largely instinctive, and the marksmanship medal awarded by<br />\nAbrams.<br />\nuniformly pleasant and friendly. No the response to temptation should be Dr. Ronald T. Abercrombie. A medal George Tapham Ames and Elizabeth<br />\nS. P. E., softball.<br />\nThe Debating Club also had a very President could possibly ask for bet- so also. The quickness of response awarded by the military department Bacon, was born in Manchester, Vermore cordial may be cultivated and the days of for excellence in machine gun work mont, on July 3, 1864. The family<br />\nseason. Two trips were ter understanding or a<br />\n13 Students To Entertain successful the year, one of them spirit of cooperation. I know full well college life is the time to do this.<br />\nwent to Joseph Miceli.<br />\nmoved from their ancestral environs<br />\nmade during<br />\nyou have learned<br />\nThe unit then formed in front of<br />\nCritic Teachers Saturday to Georgia, and the other to Phila- how many things you might have \"My hope is that<br />\nNew York and New England, and<br />\nof<br />\ndone to make my life unhappy—the or are learning a love of freedom of the Gilman Hall steps to hear Dr.<br />\ndelphia. Dr. Clifford Lyons was the outstanding fact is that you have not thought and are convinced that life Ames make his farewell address to settled in Minnesota, where Dr.<br />\nThirteen students in the course of coach of the club.<br />\nAmes spent his youth.<br />\ndone them, and I am truly grateful. is worth while only in such an at- the unit at the Hopkins.<br />\nsecondary school practice teaching<br />\nThis same idea is exBoth the band and the NEWS-LET\"Some of you may think I intend mosphere.<br />\nAt the age of fifteen, while still<br />\nDr. Ames Speaks<br />\nwill entertain their critic teachers and TER showed very successful seasons. to give you some advice, either di- pressed from a different angle in the<br />\nDr. Ames, who was introduced by attending the Shattuck School at Farnot. It motto of the University: 'The Truth<br />\neight principals of the schools in The Band took the first trip out of rectly or indirectly; but I do<br />\nMajor Gregory Hoisington, profes- ihault, Minnesota, he was fascinated<br />\nwould be both foolish and presump- will set you free.' Every member of sor of military science and tactics at<br />\nin a number of years.<br />\ncity<br />\nthe<br />\nwhich the practice work was done<br />\nby a magazine description of a young<br />\ntious for me to do so. This happens the University, student or teacher, the Hopkins, said that he was heartCotillion Board Successful<br />\nduring the past four months, at a<br />\nto be the seventeenth of May, nine- should adopt this as his personal ily in favor of the principles of the eastern university which had no backThe Cotillion Board also did reluncheon to be held Saturday in Levground but which stood for \"original<br />\nteen hundred and thirty-five, but watch-word. It is doubtful if you ever R. O. T. C.<br />\nmarkably well during the past year.<br />\nthose words do not mean to you what attain absolute truth, and it is cerering Hall.<br />\nand the raising of educaA large debt to the University was<br />\nHe said he could distinguish a research<br />\nthey do to me. I see around me a cer- tain that you will never know if you<br />\nAmong the principal guests of paid off, and the Board is expected<br />\nmember of the R. 0. T. C. unit from tional standards.\" Following his hightain world, you see a quite different do attain it. This should, however, be<br />\nhonor who will speak briefly at the to end its fiscal year with a slight one. You and I do not even speak the your constant endeavor. I personally an undergraduate who was not a school graduation in 1883, young<br />\nmember. If he ever went to another Ames traveled east and upon his arluncheon which sets a precedent in profit.<br />\nsame language, I do not know by am more afraid of orthodoxy of any<br />\nThe S. A. C. gave out 42 Varsity what mental processes your actions form than of unorthodoxy; the for- college, Dr. Ames continued, he would rival in Baltimore, he walked to the<br />\nthe College for Teachers, will be Dr.<br />\nSeals this season for work on these are guided, our sense of relative val- pier numbs the senses and tends to look to the R. 0. T. C. unit for the<br />\ntwo converted dwellings on Howard<br />\nDavid E. Weglein, superintendent of<br />\nactivities. A new contract has been ues is not the same. Old age and put one to sleep. The state of mind most desirable men.<br />\nstreet, which then sheltered the Unipublic instruction, and Dr. J. Carey signed with S. and N. Katz for the<br />\nIn closing Dr. Ames added that he<br />\nyouth are never alike. Further, ev- 9f so many people today is what can<br />\nTaylor,<br />\nassistant<br />\nsuperintendent. making of these awards, Abrams add- erything I could say would either be described only by the word 'pan- hoped the unit would be at the Hop- versity and enrolled as a candidate<br />\nfor a degree.<br />\nMembers of the department of edu- ed.<br />\nagree with your thoughts or differ ic'. Young people, of all people, should kins as long as the University operDr. Ames's record, following his<br />\nthey<br />\nwould<br />\nthat<br />\nhoped<br />\nhe<br />\nated<br />\nand<br />\nthat<br />\nthere<br />\nfirst<br />\nyear<br />\nis<br />\nthe<br />\nof<br />\nform<br />\nthe<br />\nand<br />\nthe<br />\n\"This<br />\nremedy,<br />\nin<br />\nThe<br />\ngiven<br />\nthis.<br />\nif<br />\nfall<br />\ninto<br />\nnot<br />\nfrom them,<br />\ncation here will also attend.<br />\nyour carry on in the fine way they had graduation in 1886, is a pattern which<br />\nbeen no graft whatsoeer.\"<br />\nfaintest<br />\nupon<br />\ninsist<br />\nhas<br />\nto<br />\nthe<br />\nis<br />\nnot<br />\nhave<br />\nremedy,<br />\nI<br />\npnly<br />\nand<br />\nadvice,<br />\nDr. E. Earle Franklin, associate<br />\nThe Student Activities Committee conviction that I am any wiser than right to liberty of thought. The world done in former years. As far as he closely adheres to his definition of<br />\nin education, is in charge of the affor the ensuing year consists of John you, and your problems are not mine. needs as never before this service could see, continued Dr. Ames, the R. what the perfect student should be—<br />\nfair. Entertainment will be provided Macgill, chairman; Jerome Bloom anyway. I may be permitted, how- which youth only can furnish. See 0. T. C. was a definite part of the \"original, self-directing, responsible,<br />\n(Continued on Page 2, Col. 2)<br />\ncollege curriculum.<br />\nby the practice teachers.<br />\nand Holt Maulsby.<br />\never, to give a warning and to ex(Continued on Page 2, Col. 5)<br /><br />\nA Letter From Dr. Ames<br /><br />\nI<br /><br />\n4<br /><br />\nHOMEWOOD,BALTIMORE, MD., MAY 22, 1935<br /><br />\n2<br /><br />\nCb e flevoz4Letter<br />\nFOUNDED 1897<br />\nSubscription per year.......<br />\nBy Mail<br /><br />\nA Letter From Dr. Ames<br /><br />\nHAIL AND FAREWELL!<br /><br />\n(Continued from Page 1, Col. 4)<br />\nthat you do your part and never be<br />\nafraid of where your search for truth<br />\nwill lead you.<br />\n\"About the world in which you are<br />\ngoing to live, I can tell you nothing,<br />\nI know nothing. I hope you face it<br /><br />\n42.50<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council. RemBen Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br /><br />\nunafraid in your constant pursuit of<br />\nthe Truth and in your determination<br />\nto do what you can to help. I beg you<br />\nnever to forget that each one of you<br />\nis personally responsible for the good<br />\nname of the Johns Hopkins University.\"<br /><br />\nEntered as second-class matter December 3, 1909, at the Postofflce in<br />\nBaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nJESSE N. BORDEN<br />\nNE.AL POTTER, IRVING LEBERFELD,<br />\nManaging Editors<br />\nJOHN C. BRASHEARS,<br />\nWILLIAM DIAMOND,<br />\nAsst. Managing Editors<br />\nHERSHNER CROSS, STANLEY FINKEL<br />\nB.<br />\nWILLIAM<br />\nLEON JACOBS ON,<br />\nNews Editors<br />\nKEMPTON<br />\nSports Editor<br />\nKENNETH ZIERLER<br />\nD. KOLKER<br />\nMARVIN<br />\nCAPLAN,<br />\nDAVID<br />\nAssistant Sports Editors<br />\nSTANLEY E. BLUMBERG, HYMAN M.<br />\nContributing Editors<br />\nLEVIN<br />\nFeature Editor<br />\nEDGAR KEMLER<br />\nJACK STEIN,<br />\nKROPMAN,<br />\nHAROLD M.<br />\nColumnists<br />\nSIDNEY GREEN<br />\nReporters<br />\nBenjamin Futernick, Jewett Goldsmith, Sigmund Safier, William<br />\nSnyder, Howard Reizenstein, Jonas<br />\nCohen, Leonard Jaffe, Lester H.<br />\nCaplan, Bernard Pinck, Julian AdIskoler, Lorman Levinson, Max<br />\nwitz, Nathaniel Finkelstein.<br />\nBUSINESS DEPARTMENT<br />\n_Business Manager<br />\nDAVID LE'VY<br />\nJULIAN CoHEN....Advertising Manager<br />\nOffice Manager<br />\nROBERT WATKINS<br />\nCirculation Manager<br />\nROBERT LEVI<br />\nSTANLEY PRAGER,<br />\nCopy and Filing Manager<br /><br />\nWednesday, May 22, 1935<br /><br />\nDr. Ames<br />\nThe closing of the present school<br />\nyear marks the termination of the<br />\nofficial career of a man who for<br />\nmore than fifty years has been intimately associated with the Johns<br /><br />\nT<br /><br />\nO A FUTURE PHYSICIST<br />\nSpectrography is the only method of determining accurately the presence or absence of the various elements in<br />\nthe material being studied. Spectrography and the<br />\nBausch &amp;Lomb Spectrographic line warrants your careful study and investigation. Bausch &amp; Lomb Optical<br />\nCo., 635 St. Paul Street, Rochester, New York.<br /><br />\nDR. JOSEPH SVVEETMAN AMES<br /><br />\nPOEM FOR THE DAY<br />\nBy LOUIS ALBERT BANKS<br /><br />\ncross-word puzzle enthusiast. His favorite pastimes are reading histories<br /><br />\n(Courtesy, Alumni Office)<br />\nA dream that first his fancy snared,<br />\nHow sweet the picture of this boy<br />\n(A dream maturer life has shared)<br />\nWho, dreaming of life's coming joy,<br />\nThat learning's always in the dawn—<br />\nHas suddenly, his fancy caught<br />\nWill grow in wealth as we go on.<br />\nWith this entrancing, rapturous<br />\nIs still his ruling force in life;<br />\nthought!<br />\nWith keen expectancy he's rife.<br />\nA college, altogether new,<br />\nHe's helped to build Johns Hopkins'<br />\nThat scintillates the coming view—<br />\nsoul;<br />\nThat does not stop with what is old<br />\nHis spirit animates the whole.<br />\nBut searches for unminted gold.<br /><br />\n,and biographies, and listening to the<br />\ncompositions of Beethoven and Bach.<br /><br />\nHopkins University.<br />\nDr. Joseph S. Ames has grown with<br />\nthe University. As a student he<br />\nlearned to cherish the ideals of the<br />\ninstitution which at that time was How beautiful these youthful dreams! He's helped to shape his wondrous<br />\na newcomer to the field of higher ed- Though they may end in failing<br />\ntask—<br />\nucation. As a teacher and a famed<br />\nWhat more could any scholar ask!<br />\nschemes,<br />\nphysicist he furthered these ideals, They furnish steam for all advance;<br />\nIn him Johns Hopkins buds anew;<br />\nand as President he saw them grow Are warp and woof of life's romance. She's to her lifelong spirit true—<br />\nto a full maturity.<br />\nFor Ames, rare product of her<br />\nYoung Joseph Ames, that dreaming<br />\nDr. Ames has been an ideal Presschool,<br />\nyouth,<br />\nident to the students. He is not only Through fifty years of search for<br />\nIs now her most efficient too<br />\nthe President, he is the First Man of<br />\nTo wind her splendid bugle horn—<br />\ntruth<br />\nthe University. He was reserved but Has kept his thirst for new surHe'll always sound the note of morn.<br />\nnever aloof. He was always interested<br />\nprise—<br />\nin the students and their activities.<br />\nBelieves adventure makes us wise.<br />\nIn his quiet, unobtrusive manner,<br />\nhe has always labored for the welfare of the University. Assuming office on the eve of the depression, he<br />\nhad to guide the affairs of the Hoplived up to his counsel that the Uni(Continued from Page 1, Col. 6)<br />\nkins during a time of unparalleled finversity graduate should never assume<br />\nurge<br />\ninner<br />\nthat<br />\nof<br />\npossessed<br />\nand<br />\nancial distress. Only by the most dedirec- an impassive role in the world's afcertain<br />\na<br />\nin<br />\none<br />\nleads<br />\nwhich<br />\ncisive measures has he been able to<br />\nfairs.<br />\ncontinue operations without seriously tion.\"<br />\nIn 1917 he was Chairman of the<br />\nreceiving his A.B. degree, Dr.<br />\nAfter<br />\ndisabling the University.<br />\nof the National Research<br />\nCommittee<br />\nresident<br />\na<br />\nAmes spent one year as<br />\nAlthough we say good-bye to Dr. •<br />\nBerlin. Upon his Council to study Scientific Activities<br />\nof<br />\nUniversity<br />\nthe<br />\nat<br />\nAmes when this semester is concludreturn, he was engaged the following in Warfare. In 1923 he was named as<br />\ned, we will never forget him. He will<br />\nyears (1888-91) as assistant in the Wilbur Wright Lecturer. His<br />\nthree<br />\nalways remain to us the personificaIt was during this period work in aeronautics has contributed<br />\nphysics.<br />\ntion of the true Hopkins ideal.<br />\nMrs. Mary Boykin much to the science of flying. As the<br />\ncourted<br />\nthat he<br />\nHarrison of Society Hill, South Car- Chairman of the National Advisory<br />\nolina. They were married on Septem- Committee for Aeronautics, he made<br />\nber 14, 1895. The following year Dr. up reports on progress in that field<br />\nDr. G. Wilson Shaffer announces Ames earned his Doctor of Philosophy or President Hoover. Dr. Ames is a<br />\nthat more than 600 out of the 800 un- degree. By this time he was becom- member of the Royal Aeronautical<br />\ndergraduates have taken part in the ing a part of the Unversity. He had Society of London and a member of<br />\nintramural program put into effect been caught in the contagion, spread the Royal Institute of Great Britain.<br />\nthis year. Success in this degree is by its founders \"for the noble zeal of He has also been connected with the<br />\nscarcely expected in the initial year learning for learning's sake.\" His National Academy of Sciences and<br />\nof any system.<br />\npersonal investigations serve as prac- the American Physical Society.<br />\nBehind these results lie a new spirit tical demonstrations of his advice \"to . Dr. Ames succeeded Dr. Frank J.<br />\ninstilled in the college men and the relieve one's curiosity about certain Goodnow as the Hopkins only underthe athletic phenomena.\" He always emphasizes graduate ever to become president of<br />\ncontagious enthusiasm<br />\npersonnel—Dr. Shaffer, Reuben Baer, the fact that a degree, to him, was the University. This was in 1930. The<br />\nFrank Dotterweich, Edwin Lotz, Ron- beside the point. The main thing was following years were made burdenald Levy, George Darley, and Gard- the student's interest and its chief some to him by worries over the finanpial condition of the University and<br />\nner Malone. In addition, there are object was to find out the truth.<br />\ngrief over the loss of his wife who<br />\nwas<br />\nthe two men who handle only interAmes<br />\nFrom 1891 to 1893, Dr.<br />\ncollegiate competition—Waldo Ham- an associate in physics from 1893-99, ,had been both a devoted wife and a<br />\nbleton and Dr. Kelso Morrill.<br />\nhe was associate professor and from real companion. Dr. Ames' leaderTheir attested aim has been sports 1899 to 1926 he was professor of phys- ship during the stress of the depresfor all, but the actual results may go ics and succeeded Dr. Henry A. Row- sion years has been admired and apeven beyond that. Not only will land as Director of the Physics Lab- preciated, especially because he never<br />\nsacrificed the University's reputaeverybody take part in some branch oratory.<br />\nof athletics, but many will be develIt was during these years that he tion or principles to any situation.<br />\noped into varsity material—something conducted extensive researches in , Dr. Ames has, throughout the years<br />\nthat has rarely happened at the Hop- electro-dynamics and spectroscopy. been adopted by the people of Baltikins.<br />\nHis published works during these more. They could not have shown<br />\nThe revised Department of Physical years included Theory of Physics more respect and affection for him,<br />\nTraining and Athletics has wished not Free Expansion of Gases, Prismatic liad he been a native of the city. He<br />\nto emphasize this phase of its activity, and Diffraction Spectra, Induction of has taken active interest in charity,<br />\nbut in the minds of alumni, of under- Electric Currents, and The Constitu- education, social organization and science, being a member of the School<br />\ngraduates, and of prospective under- tion of Matter.<br />\ngraduates, intercollegiate participaFrom 1924-29, Dr. Ames served the poard, of the Budget Committee of<br />\ntion is still the goal.<br />\nUniversity in the capacity of the Dean the Community Fund, and of the<br />\nBut why quibble at this time? The of the Faculty and from 1926-29 as Maryland Academy of Sciences and<br />\nnew athletic deal enters its sopho- Provost. During the long period after President of the Baltimore Country<br /><br />\nLIFE OF DR. AMES<br /><br />\nIn Review<br /><br />\na<br /><br />\nmore year cum laude.<br />\nK. Z.<br /><br />\nmember of the Alpha Delta Phi Fraternity, an ardent supporter of the<br />\nEinstein theories and an English<br /><br />\nDr. Ames resembles the practical<br />\nbusiness man; he is smooth-shaven<br />\nand vigorous. His speech is clipped,<br />\nhis manner energetic and enthusiastic. He has an air of competence and<br />\ndecisiveness about him that supplements the quick reasoning of that analytical mind, which unhesitatingly<br />\ngets to the heart of most of his problems. His fair-mindedness is reflected<br />\nin his \"open door policy to students\"<br />\nand in his abhorrence for everything<br />\nthat smacks of \"politics and pull.\"<br />\nThe finest traits of Dr. Ames are<br />\nhis broadmindedness and comprehensieness in understanding the relationships between men. He is quick to see<br />\nanother's point of view and careful<br />\nnot to wound a person's sensitiveness.<br />\nHis understanding of human nature<br />\nprevents him from assuming an air<br />\nof condescension toward younger men.<br />\nHe can still look back on his own<br />\nyouth and sympathize with the feelings of today's younger generation.<br />\nThese are the qualities that have endeared him to the students.<br />\nMuch of the personality of Dr.<br />\nAmes is expressed in his speeches and<br />\ninterviews. They give us a broad conception of his well-founded opinions.<br />\nFirst he believes that old ideas should<br />\nbe made to fit modern applications.<br />\nHe says that the fundamental problems of higher education have not<br />\nchanged, despite the fact that \"liberal<br />\neducation\" has given way to \"specialization\". Dr. Ames is fully conscious of personal differences and<br />\nsubsequently of individual needs. \"The<br />\nUniversity must do for the social sciences what it has done in the past<br />\nfor other sciences. We must learn not<br />\nonly man's environment, but man<br />\nhimself. This is rightly the task of<br />\nthe University.<br />\nDr. Ames is, intellectually, not one<br />\nof the \"old school.\" He is keenly<br />\naware of the many changes the future may usher in and declares that<br />\nthe University will not be hemmed<br />\nin by the evils of unprogressive stability. \"The minute any great institution reaches a point where it thinks<br />\nits methods are the only ways that<br />\ncan be followed and refuses to accept<br />\nchange—then that institution's service to mankind is about at an end.\"<br />\nThese ideas have been extended to<br />\ninclude the personnel of the faculty,<br />\nfor Dr. Ames thinks \"the scientist<br />\nwho is only interested in science,<br />\nmust be very stupid\" and therefore,<br />\nhe urges teachers to broaden their<br />\ncultural horizons and to stimulate<br />\noriginality.<br />\nDr. Ames is as open-minded today<br />\nas ever. \"I am,\" he says, \"not convinced that the future of our University lies in the field of advanced<br />\nstudy. I am not convinced that our<br /><br />\nplans are the best or must be followed<br />\nhe received his Doctorate of Laws Club.<br />\na<br />\nas fixed policies.\"<br />\nis<br />\nAmes<br />\nDr.<br />\nlife<br />\nIn his personal<br />\nfrom Washington College, Dr. Ames<br /><br />\n... what's left of your school term<br />\nbudget will take you home<br /><br />\nby GREYHOUND<br />\nYOU<br /><br />\nneedn't hock your faithful ticker to buy a ticket<br />\nhome. The remnants of your school-term budget will<br />\npay your fare by Greyhound.<br />\nFrequent departures enable you to leave almost any time<br />\nyou like. As you roll along springtime highways, Nature's<br />\nclean, fresh air will banish the last dull headache of final<br />\nexams and put you in the proper mood for a real vacation.<br /><br />\nSUMMER VACATION TRIPS<br />\nEvery popular vacation spot, major scenic area, and large<br />\ncity in America is served by Greyhound, either direct or in<br />\ncooperation with short connecting lines. Vacations by<br />\nGreyhound cost less and offer more than by any other firstclass travel method. Ask your Greyhound agent for details.<br /><br />\nGreyhound Bus Terminal<br />\n217-221W. Baltimore Street<br />\nPhone: PLaza 0520<br /><br />\nEYIROUND<br /><br />\n3<br /><br />\nHOME WOOD,BALTIMORE, MD., MAY 22, 1935<br /><br />\n. Maryland Tops<br />\nHopkins 5 To 4<br />\nIn Lacrosse<br />\nTerps Score Two Goals In<br />\nBoth Halves; Powell And<br />\nHenry Houck Score<br />\nAll-Opponent Collegiate<br />\nLacrosse Team<br />\nPicked By The Members Of The<br />\nJohns Hopkins Varsity<br />\nG.—Jack Kelly, Maryland<br />\nP.—Sam Silber, Maryland<br />\nCF.—Angus - Lamond, St. John's<br />\nF.D.—Robert Collett, Rutgers<br />\nS.D.—John Donohue, St. John's<br />\nC.—Warren Hammann, St. John's<br />\nS.A.—Richard Halvorsen, Dartmouth<br />\nF.A.—David Nopper, St. John's<br />\n0.H.—John Christhilf, Maryland<br />\nI.H.—Everett Smith, St. John's<br />\nIn a slow game, the University of<br />\nMaryland ten defeated the Jays 4-2<br />\nat Homewood Field last Saturday.<br />\nAlthough both teams showed bad<br />\npassing at times, the Terps proved<br />\nmore versatile in passing and in defensive play.<br />\nMuch of the credit for holding the<br />\nscore to suck a low one should go<br />\nto George Kahl, who in the absence<br />\nof Lou Reuling and Cliff Gilbert played a fine game at goal. Kahl, only<br />\na sophomore, has all the earmarks<br />\nof keeping the goal position as well<br />\nas any of his brilliant predecessors.<br />\nWhen Sam Silber, giant Maryland<br />\ndefense, was put out for slashing, the<br />\nJays countered their first goal. The<br />\nextra man play was tried two times<br />\nbefore Bob Levi spotted Henry Houck<br />\nopen about 15 feet from the circle.<br />\nHouck put a ground shot by Jack<br />\nKelly, the Maryland goalie.<br />\nNeither team could score during the<br />\nremaining minutes. Maryland tried a<br />\nnumber of plays and dodges, but all<br />\nwere nipped by an alert Hopkins<br />\nteam.<br />\nPowell Shoots Goal<br />\nElmer Powell shot the second Jay<br />\ngoal about four minutes after the<br />\nsecond canto opened. He rifled a hard<br />\noutside shot past Kelly after Charley<br />\nOrth had checked his defenseman's<br />\nstick to provide a perfect screen.<br />\nThat ended the Hopkins scoring.<br />\nCharlie Ellinger scored the first<br />\nMaryland tally after Rube PasareW<br />\nhad been ejected two minutes for<br />\nchecking. The same player passed<br />\nto Christhilf who shot the ball over<br />\nKahl's shoulder.<br />\nLeonard Rombro countered the<br />\nthird goal fo Maryland with Jack<br />\nTaylor on the side lines. The shot was<br />\na long outside one which was partially blocked by the Jay goalie.<br />\nThe fourth and final tally of the<br />\ngame came on Ramsay Thomas' shot.<br />\nAnother penalty was part of the cause<br />\nfor the goal since the Terps had an<br />\nextra due to Levi's banishment for<br />\nslashing.<br />\nJays Try Rally<br />\nWhat looked like a Jay rally came<br />\nwith six minutes of the game remaining. Jack Taylor succeeded in getting<br />\nthe ball and raced straight down the<br />\nfield as an extra. His pass to Houck<br />\nwas perfect, but the latter's shot hit<br />\nKelly in the chest.<br />\nStatistics show that Maryland took<br />\n32 shots, while Hopkins took 21.<br />\nKahl had 11 saves and Kelly 9.<br />\nPete Swindell did nobly in holding<br />\nthe highly-touted Charlie Ellinger to<br />\na single goal. Effinger did not dodge<br />\nPete the entire afternoon.<br />\nThe game itself made no material<br />\ndifference in the collegiate and national championship since both teams<br />\nhad been beaten by St. John's and<br />\nMt. Washington. However, it was the<br />\nfirst time in four years that Maryland has been able to defeat Hopkins in lacrosse. The defeat was the<br />\nfourth one sustained- by the Jays during the current season.<br /><br />\nAs A Secretary Sees Dr. Ames<br />\nThe day on which Dr. Ames was helpful things that perhaps I alone<br />\nelected President—June 3, 1929, seems know of. A kind word here or there<br />\nonly yesterday; or it might have about a recalcitrant member to his<br />\nnever been, for if any man ever \"be- colleagues; a defense of another to a<br />\nlonged\" to a job, he has. The Trus- severe critic; monetary aid—from<br />\ntees met at 10:30 in the President's his own resources—to a needy stuRoom in Remsen Hall, and shortly dent; I could go on, giving specific<br />\nafter, Dr. Tom Brown and Mr. Car- details endlessly.<br />\nWhen Dr. Ames' retirement was<br />\nlyle Barton came out of the meeting<br />\nand \"gathered him in\"—each with announced the newspapers spoke of<br />\none arm about his shoulders. It was him as \"young\" with an appreciation<br />\na very logical gesture; Dr. Ames had of the younger man's point of view.<br />\nknown them a long time—and it was This is one of his greatest attributes;<br />\na happy day for everyone. Immedi- he was one of the most successful<br />\nately after the meeting, the Presi- Deans we have ever had; he was wise<br />\ndent-Elect came to me and said, \"How in his choice of Dean Berry to succeed<br />\nwould you like me for your nevi. him, and he has been able to underboss?\" My answer was not impor- stand the students and leave, them<br />\ntant; nor intelligible. When one is the freedom of action so characterisclose to Dr. Ames and works with tic of the Hopkins.<br />\nThe difficulties of being President<br />\nhim for any length of time,—he had<br />\nbeen \"resident\" in the office as Pro- are many and varied; he must have<br />\n'vast—one's feelings are not easily ex- the patience of Job; he must have<br />\ngreat tact, understanding, sympathy,<br />\npressed without showing sentiment.<br />\nAnd now it is June, 1935, and there and above all, he must be approachable. The University has been exwill be another \"Boss\" in his chair.<br />\nThese few years have been very. tremely fortunate in having as Presshort. No one but his secretary could ident a man with all these characterknow what they have meant to the istics to lead it during the worst<br />\nUniversity and to Dr. Ames. I have years of its existence—from a finanseen faculty members wear a path cial standpoint. The faculty morale<br />\nto his door—or rather to his desk, for has been kept high, and the reputathere has been no barrier of a closed tion of the University has been wider<br />\ndoor, and very little respect for ap- spread. Dr. Ames—unassuming, and<br />\npointments. And they have brought alone—has done more intangible<br />\nhim their troubles—academic, finan- things to further this than will be<br />\ncial, domestic, and I don't know of one realized for a long time.<br />\nA President's Office is a good vanman on the faculty who can honestly<br />\nsay that he does not owe the Presi- tage point from which to judge the<br />\ndent a debt of some kind. This could University—its faculties, students,<br />\nalso extend to students—graduate and and administration. Committees meet<br />\nundergraduate—in each of whom he almost daily in the office; there is a<br />\nhas taken a personal interest, and steady stream of faculty, students,<br />\nhas given advice and assistance. This alumni back for a visit, friends of<br />\nhas not always been known to the the University, sight-seers, and so<br />\nman given it; he has done so many on. Charity-seekers have not been<br /><br />\nBy<br />\nCARRIE LEE WOOD<br /><br />\nDr. Ames Outstanding In<br />\nAeronautical Development<br /><br />\nturned away empty-lianded; I have<br />\nhad to try, more than once, to put a<br /><br />\nSynonymous with the story of aero- by 15 or 20 miles per hour. It was<br />\nnautical research and advancement thoroughly tested under Dr. Ames'<br />\ncurb on Dr. Ames' generosity, and<br />\nin the United States since the World supervision at Langley Field, Virginunsuccessful.<br />\nusually been<br />\nhave<br />\nWar, has been the name of Dr. Jo- ia, and the results proved it of first<br />\nThere has always been a good humor seph S. Ames.<br />\nimportance in the development of<br />\nDr. Ames has studied the scientific aviation.<br />\nabout the meetings, the interviews;<br />\nOn May 21, 1935, Mr. Chief Justice<br />\nand all this is directly traceable to aspects of aeronautics as a member<br />\nNational Advisory Committee Hughes of the United States Supreme<br />\nthe<br />\nof<br />\nthe character and disposition of the<br />\nfor Aeronautics. He has been asso- Court, acting in his capacity as<br />\nPresident.<br />\nciated with the Committee ever since Chancellor of the Smithsonian InstiThis is all, of course, from a sec- its inception in 1915, when he was tution, and on behalf of the Board of<br />\nretary's point of view. But I won't appointed as one of the original mem- Regents- of the Smithsonian Instituadmit that it's prejudiced, because bers by President Wilson.<br />\ntion, presented to Dr. Ames the<br />\nthat old saying \"A man's no hero to<br />\nWhen the United States entered the Langley Gold Medal for Aerodromics<br />\nhis valet\" could well be amended to World War, Dr. Ames served as the \"in recognition of the surpassing iminclude his secretary. He has criti- chairman of the Foreign Service provement of the performance, efficized himself—too severely; others Committee of the National Research ciency, and safety of American airhave criticized him at times, and not Council, which visited France and craft resulting from fundamental<br />\nalways justly, and never, as far as I England to study the origin and de- scientific researches conducted by the<br />\nknow, with the result that he has held velopment of scientific activities in National Advisory Committee for<br />\na grievance. Despite everything—de- connection with warfare.<br />\nAeronautics under the leadership of<br />\nspite the fact that he has had to fight<br />\nFrom the very outset of his con- Doctor Ames.\"<br />\nevery inch of the way for cooperation nection with the National Advisory<br />\nThe Langley Medal was established<br />\nand understanding of the University's Committee, Dr. Ames has sought to by the Board of Regents of the<br />\nproblems, I think that there has never develop an aeronautical research lab- Smithsonian Institution in 1908, and<br />\nbeen such a In4kiversally liked presi- oratory in this country that would was first presented to the Wright<br />\ndent of a university. He has retained place the United States in the fore- brothers. It has subsequently been<br />\nhis, dignity, and yet has never been front of progressive nations in the awarded only five times, to Glen H.<br />\nstiff or unbending.<br />\ndevelopment of aeronautics. Thus as a Curtis, 1913; Gustave Eiffel, 1923;<br />\nwell<br />\nas<br />\nUniversity,<br />\nresult of Dr. Ames' great personal Colonel Charles A. Lindbergh, 1927;<br />\nStudents at the<br />\nas faculty, could find something to interest and initiative a laboratory Charles M. Manly, 1929; and Rear<br />\npattern after in Dr. .Ames' life. He has been developed at Langley Field, Admiral Richard E. Byrd, 1929.<br />\nNo tribute is more fitting for Dr.<br />\nhas been an inspiration to his office; Virginia, that by virtue of researches<br />\nhe has infinite patience, and I have conducted there, merits being called Ames than as represented by the innever known him to be unkind or im- \"the world's finest aeronautical re- numerable complimentary references<br />\npolite; he is a gentleman in the true search laboratory\". The work con- to the work of the Committeee from<br />\nsense of the word. He has been a very ducted at the Langley Memorial Aer- aeronautical authorities the world<br />\neasy person to work for—never de- onautical Laboratory, as the labora- over. These references filed in the ormanding the impossible; exacting at tory is called, is of incalculable value ganization's headquarters in Washtimes to be sure, and a hard worker to the nation, for aircraft of superior ington, D. C., constitute internationwho never works anyone harder, how- performance will most likely be ul- al testimony of the efficacy of aeronautical research in the United States<br />\never, than he works himself. We have timately decisive in war.<br />\nDr. Ames became Chairman of the under Dr. Ames' leadership.<br />\nbeen friendly, not too business-like,<br />\nDr. Ames, during his years of conand anything I say is inadequate. I Executive Committee of the organization in 1919 by unanimous choice. nection with the Committee, has been<br />\nshall miss a very good friend.<br />\nThe constant and gratifying record an active member from time to time<br />\nof progress in improving the perform- of twenty subcommittees, and was<br />\nBy<br />\nance, efficiency, and safety of Amer- Chairman of the Committee on AeroLILLIAN M. HALL<br />\nican aircraft of all types and for all dynamics, Committee on Aircraft<br />\npurposes is largely the result of fun- Communications, Committee on Perdent had to rap on his door for ad- thing. As soon as Dr. Ames was in- damental scientific researches con- sonnel, Buildings, and Equipment and<br />\nmittance. He had no set hours for formed that a student had reached ducted by the National Advisory the Committee on Publication and<br />\nIntelligence. Dr. Ames has also served<br />\nconferences, but whenever he saw a this state of mind and was ready to Committee for Aeronautics under Dr.<br />\nAmes' general direction as its Chair- as Director of the Office of Aeronaugentleleave,<br />\nthe<br />\nand<br />\ntrunk<br />\nhis<br />\npack<br />\ntimid face peering in he immediately<br />\ntical Intelligence from 1919 to date;<br />\nman would receive a summons to the man.<br />\ninvited the owner to enter, and would<br />\nof Special Conferennes on<br />\nChairman<br />\nas<br />\nIn<br />\nwork<br />\nhis<br />\nChairof<br />\nrecognition<br />\nencouraged<br />\nbe<br />\nthere<br />\nwould<br />\noffice. He<br />\nbegin the conversation by saying, to speak of his difficulties and, after man of the Committee, Dr. Ames re- Nomenclature for Aeronautics since<br />\n\"Well, what's on your mind?\" He was talking things over with the Director, ceived from the hands of President 1916, chairman of annual aircraft engineering research conferences with<br />\nalways willing to discuss their prob- he would come forth with a most de- Hoover at the White House the Colaircraft industry from 1926 to<br />\nthe<br />\nlier<br />\nin<br />\nTrophy<br />\nThis<br />\n1930.<br />\ntrophy,<br />\nto<br />\nlems with them, but grew very im- termined look on his face—ready<br />\nwhich is awarded annually, went to date; member of the Executive Comdo and to dare.<br />\npatient when they failed to use their<br />\nIt was this interest, not only in Dr. Ames in recognition of the de- mittee since 1915 and Chairman since<br />\nbrains. He endeavored to have each their work but in them personally velopment of a device for stream- 1919; and as Chairman of the Naman stand upon his own feet. It was which endeared Dr. Ames to his stu- lining radial air-cooled engines and tional Advisory Committee for Aeroa difficult task which did not al- dents. That the interest has been kept thus increasing the speed of airplanes nautics since 1927.<br />\nways meet with success.<br />\nis shown by the fact that to this day<br />\nOccasionally when a student would students who left the University many<br />\nask a question the answer to which he years ago still consider it a privilege<br />\n11•11161.1111111111111E<br />\nshould have learned in Undergradu- to come back to Baltimore if only<br />\nview<br />\nate Physics, Dr. Ames would<br />\nfor a few hours in order to discuss<br />\nhim sternly and say: \"The answer to their latest problems with the Di\\SHOES FOR MEN<br />\nyour question is in the book. I know rector. No matter how busy he may<br />\nit is, I wrote it myself.\" With a crest- be, he can always find time to give<br />\nfallen look the student would retire an ear to a former student and his<br />\nto review the book. (Theory of Phys- latest problem.<br />\nics).<br />\nDr. Ames apparently felt responsible for all students in Physics. He<br />\ncame to the laboratory before nine<br />\nin the morning and, except for a lunch<br />\nperiod, he spent the day there.<br />\nIn the old Physical Laboratory<br />\nA Phase of Preventive Medicine<br />\ndown town it was his custom daily to<br />\nCollege Men find in it unusual<br />\nstart in the tower of the building and<br />\nopportunities for a career<br />\nvisit each and every student who was<br />\nUNIVERSITY<br />\nHARVARD<br />\nengaged in research work to see what<br />\nDENTAL SCHOOL<br />\nprogress he was making. He would<br />\nA competent course of preparation for<br />\nthe dental profession. A 'Class A\"<br />\nthen visit the undergraduate laboraSchool. Write for catalogue.<br />\ntories and stand quietly behind a<br />\nLEROY M.S. MINER, D.M.D., M.D., Dean<br />\nDept. 9. 188 Longwood Ave., Boston, Mass.<br />\ngroup of students at work on some<br />\nMany Styles,<br />\nexperiment and electrify them by<br />\nIncluding<br />\nasking a question as to what they<br />\nALL-WHITE<br />\nwere doing.<br /><br />\nAmes - - The Teacher<br />\nDr. Ames' name<br /><br />\nmid that of the<br /><br />\nUniversity have been so closely allied for so many years, it is difficult to<br />\nthink of the one without the other.<br />\nOver fifty years ago he entered its<br />\ndoors as an undergraduate student;<br />\nhe leaves as President. In the meantime he has received its degrees and<br />\nhas occupied every position of importance it has had to offer. He has<br />\ngrown with the University and has<br />\nproved himself always a loyal student and a tireless worker in its behalf.<br />\nAmong his outstanding successes<br />\nis a wholesome and lasting imprint<br />\nmade upon his students.<br />\nHaving come in contact with him<br />\nin the Physical Laboratory for many<br />\nyears, I have seen him not only as a<br />\nteacher, but as a counselor and friend<br />\nto all those students who came under<br />\nhis guidance. It is this relationship<br />\nwith his students I would like to<br />\ndwell upon briefly.<br />\nIt is a well-known fact that as a<br />\nteacher Dr. Ames has always stood<br />\nin the first ranks of that profession.<br />\nDr. Ames was a very serious lecturer and demanded the undivided attention of his students, objecting to<br />\nany notes beTfig made by the students while he was teaching. He liked<br />\nto have the eyes of the students and<br />\nthey soon found out that it was well<br />\nto keep their brains working as well,<br />\nfor Dr. Ames seemed to know when<br />\na mind began to wander, and would<br />\npounce upon the wanderer with a<br />\nquestion which would bring him back<br />\nand keep him alert.<br />\nIn the early days he had but one<br />\ncopy of his lectures, carefully written up, and left upon his desk for<br />\nthe use of his students while writing<br />\nup the lecture to which they had just<br />\nlistened, but in later years mimeographed copies of his lectures were<br />\ndistributed among his students, to<br />\ntheir delight.<br />\nDr. Ames was at all times available to his students. He believed in<br />\nthe \"open door\" policy, and no stu-<br /><br />\nJune Week<br />\nTickets On Sale In Levering Hall<br /><br />\nTESTED<br /><br />\nA Splendid<br />\nGroup Of<br /><br />\nTHE NEW<br /><br />\nDENTISTRY<br /><br />\nOne other fact lingers in my memory in regard to his interest in his<br />\nstudents. It was not an unusual thing<br />\nfor a graduate student to become disgusted with himself during the first<br />\nfew weeks of his residence in the<br />\nUniversity. He felt he knew so little,<br />\nthe lectures were all above his head<br />\nand he could never hope to reach up<br />\nto them. Really an excellent state of<br />\nmind for any student, for then he<br />\nbegins to work and amount to some-<br /><br />\ns4•95<br /><br />\nBring Your \"Date\" on<br />\nthis Dat e to the<br /><br />\nAnnual Spring<br />\nDance<br />\nof the Delta Phi<br />\nof Baltimore<br /><br />\n25<br /><br />\nLevering Hall<br />\n9 p.m. to 1 a.m.<br />\n$1.50 Per Couple<br /><br />\nCOMMENCEMENT GIFTS<br />\nARE IN ORDER<br />\nfrom FAMILY and FRIENDS<br />\nThe tactful Graduate-to-be suggests what he would like. And we<br />\nsuggest that what he likes is, in nine cases out of ten, to be found at<br />\nHutzler's. Among them, handkerchiefs — belt and buckle sets — pipes —<br />\nfountain pens — pen and pencil sets — stationery — golf sweaters —<br />\nties — evening and cuff link sets.<br /><br />\nHUTZLER BIMEM<br />\n4.4.4.4.4-•-•-•••4•4......4-4.4.4.4.4.4-44.4.4.4.4.4.4.4•••-..4.4.4.4.4•4•4•••..o.4.4.4.4.4.4.4.4.4.4.4.4....•4<br /><br />\nSPORT SHOES<br /><br />\nASK —<br />\nLou Reuling and Tom Callahan—Representing<br /><br />\nIFESS\" SIDS<br />\nSoles of Honor Since 1873<br /><br />\n8 East Baltimore Street<br /><br />\nTHE HOME OF<br /><br />\nHART SF 4FFNER<br /><br />\nMARX,<br /><br />\nSOCIETY BRAND and WAKELY CLOTHES<br />\nBaltimore, Charles and Fayette<br /><br />\nCAlyert 4444<br /><br />\nHOMEWOOD. BALTIMORE, MD., MAY 22, 1935<br /><br />\n4<br />\nfh.<br /><br />\nDr. Ames - - - As His Colleagues See Him<br />\nForty-odd years ago I sat in a<br />\nPhysics class, and hoped that my<br />\ninstructor would not call upon me.<br />\nIt was a somewhat trying experience<br />\nfor a pupil with an unscientific mind<br />\n—perhaps it was a trying experience<br />\nfor the instructor as well. Anyway, I<br />\ngot through my course, and now the<br />\nWhirligig of Time has brought me to<br />\nwhere I am to contribute a word of<br />\ntribute to my erstwhile instructor,<br />\nnow retiring as President of the University.<br />\nThere have been and will be many<br />\ntributes to President Ames. For that<br />\nreason I feel like reserving my own<br />\nto his consideration in one particular<br />\naspect: as a reader of books in general, and as an encourager of general reading.<br />\nI remember once hearing Dr. Ames<br />\ndeclare that the real test of a man's<br />\neducation is what he does with his<br />\nleisure. From his own wide knowledge of all sorts of books outside of<br />\nhis special field, one might suppose<br />\nhe spends all his leisure reading.<br />\nAgain and again I have heard some<br />\nbook, old or recent, mentioned in his<br />\npresence, and have heard him show<br />\nunmistakable—faimmediate—and<br />\nmiliarity with its contents. How does<br />\nhe do it? I should suggest that he<br />\nspends both leisure and working<br />\nhours in reading, but what he has<br />\ndone in travel, aviation, science, and<br />\nadministration renders this theory<br />\ndoubtful.<br />\nMost people draw such a long face<br />\nwhen education is mentioned. Apparently they consider it the technique<br />\nof knowledge transfusion while the<br />\nvictim is in a proper state of narcosis or anesthesia. Dr. Ames does<br />\nsomething better than define education: he shows it. May he live long<br />\nand happily to enjoy it in his welldeserved leisure!<br />\nL. WARDLAW MIT.F.,S.<br />\nDuring his long career as student,<br />\nteacher, and administrator, President<br />\nAmes has always been a loyal and<br />\ndevoted servant of the University. It<br />\nis the hope of my colleagues that he<br />\nwill have many happy years in which<br />\nto look back upon the services he has<br />\nrendered and that, his successors will<br />\nlabor for the Jdhns Hopkins with<br />\nequal devotion and loyalty.<br />\nH. C. LANCASTER.<br /><br />\nI was a graduate student from<br />\nFrom this company will come the<br />\nsame \"hail and farewell!\" with which 1903-1906 during which period the<br />\ncourses on theoretical physics were<br />\nall Homewood rings.<br />\ngiven by Professor Ames. Although<br />\nJACOB H. HOLLANDER.<br />\nthirty years have since elapsed, the<br />\nWhatever, the future may hold in memory of his lectures is still fresh.<br />\nstore for the Johns Hopkins Univer- Each lecture was a masterpiece of<br />\nsity, the retirement of President logical perfection. When the final<br />\nAmes marks the end of an era. Dur- Q. E. D. had been written, we had the<br />\ning the most trying period in its his- impression of a gem, brilliant and<br />\ntory, President Ames has not only flawless. As a lecturer on mathematpersonified all that was noblest and ical physics, it was generally conbest in the traditions of the Univer- ceded, he had no peer.<br />\nWhile he was great as a teacher, he<br />\nsity, he has, in a very real,way, been<br />\nwas greater as a man. During one<br />\nthe University.<br />\nNo other University president has of his recent public utterances Presibeen as near or as dear to students dent Ames stated that one of the few<br />\nand faculty alike, and this because guiding principles in his life was the<br />\nno other has been as honest, conscien- desire to be of help to others. This<br />\ntious, wise, friendly, frank and up- principle, I know, had already been<br />\nadopted in those early years. To this<br />\nright.<br />\nOver a half century of association day his former students hold him in<br />\nhas woven Ames into the warp and affectionate regard.<br />\nA. H. PFUND.<br />\nwoof of the University fabric and<br />\nthis will remain when he relinquishes<br />\nFor a quarter of a century Dr. Ames'<br />\nthe command in June.<br />\nlectures on theoretical physics were<br />\nEDWARD W. BERRY.<br />\nregularly attended by all of the gradA university is a democracy gov- uate students in the department, and<br />\nerned by an autocrat. When he is an furnished them with a solid foundaaristocrat, the democratic atmos- tion on which to build their further<br />\nphere of the university becomes more investigations. He had a firm grasp of<br />\ndemocratic than ever. The aristo- the subject and kept abreast of all of<br />\ncratic autocrat is never surrounded the new developments. While not an<br />\nby restrictions and by useless cere- experimentalist himself, he initiated<br />\nmonies. He is available to everyone many of the important investigations<br />\nand at every time. It is only the aris- carried on in the laboratory and was<br />\ntocrat who can be really and sanely untiring in his efforts to encourage<br />\nand assist the students working undemocratic.<br />\nThose of us who have lived for der his supervision, inspiring them<br />\nthese last years under the rule of with enthusiasm for further scientific<br />\nPresident Ames know that these work.<br />\nPresident Ames's active life in<br />\nthings are true. In order to bring<br />\nour various difficulties before the physics has spanned the period bePresident, we have merely had to tween the era of sporadic individual<br />\nwalk into his little anteroom and sit effort of the earlier day to the presthere until he was ready to receive ent highly organized advance along<br />\nR. W. WOOD.<br />\nus. The youngest instructor had as all lines<br />\ncomplete and immediate access to<br />\n\"Not in one but perhaps once in a<br />\nhim as the most distinguished and<br />\nthe oldest professor. He did not sit million blue moons is it given to one<br />\nfar away on a high Olympus, looking man to tread every rung of the acaddown with vague interest upon the emic ladder; as undergraduate, gradactivities of the university's life. He uate student, fellow, assistant, assowas of us and with us and yet none ciate, associate professor, director,<br />\nof us, ever for a moment, treated him provost, and president, Dr. Ames has<br />\nas if we were all on the same level. distinguished himself. A born leader<br />\nIt is always better to be able to look and executive, he has pushed from<br />\neach position to the higher by eviup to somone than to look down.<br />\nE. E. REED.<br />\ndent fitness.<br />\nJOHN RATTHBONE OLIVER.<br /><br />\nPkene Belmont 7908<br /><br />\nBirely's Pharmacy<br />\nst. Paul at 33rd Street<br />\nPreaceiptiene-Schoel Supplies-Candy<br />\nagora - Unexcelled<br />\nFountain $ervice<br /><br />\nIt is right that the undergraduate<br />\nstudent body of Johns Hopkins should<br />\nvoice their feelings at the retirement<br />\nof President Ames. During his long<br />\nassociation with Johns Hopkins, he<br />\nhas run the full course of membership. In every station he has shown<br />\nthe deepest concern in the junior student body. The College has been to<br />\nhim coordinate with the University<br />\n—embodying its ideals, sharing its<br />\nproblems, rejoicing in its triumphs.<br />\nFree Manicuring<br /><br />\nTheodore's Barber Shop<br />\nFormerly with ENIIL CAYE<br />\nS. W. Cor. St. Paul and 33d Streets<br />\nNext to Birely's<br />\n3 A. M. to 8 P.M.<br /><br />\nJ. H. FURST CO.<br /><br />\nCALVERT and 30TH STS.<br />\nFirst in Quality — First in<br />\nService<br /><br />\nPrinters of<br />\nPHILOLOGICAL and SCIENTIFIC<br />\nPUBLICATIONS<br />\n12-20 HOPKINS PLACE, B41,713401=<br /><br />\nNo delivery too small. Bel. 5318<br /><br />\n•<br /><br />\nMy acquaintance with President<br />\nAmes began about twenty-five years<br />\nago. Since then we have met from<br />\ntime to time with increasing frequency, and from our acquaintance<br />\nhas developed one of the most enjoyable friendships of my entire life.<br />\nSince he has been President of the<br />\nUniversity our relations have of<br />\ncourse been very close, both person-•<br />\nally and officially. He came to the<br />\npresidency in 1929 Just at the beginning of the movement which we now<br />\nspeak of as the depression, and the<br />\nproblems confronting the President<br />\nof the Johns Hopkins University have<br />\nbeen very greatly increased on that<br />\naccount. The available income has<br />\nbeen less than formerly, just as has<br />\nbeen the case with all similar institutions and with practically all individuals. President Ames has dealt<br />\nwith that question in a very able manner and he has also been able, thru<br />\nhis leadership, to secure the hearty<br />\nand loyal cooperation of the faculty<br />\nand University staff throughout.<br />\nDANIEL WILLARD.<br />\nBetween the record of Joseph S.<br />\nAmes, admitted as a matriculate in<br />\nOctober, 1883, from the Shattuck<br />\nSchool, and that of President Ames,<br />\n1935,<br />\napproaching retirement in<br />\nstretches more than half a century of<br />\nactive and fruitful association with<br />\nthe Johns Hopkins University upon<br />\nwhich any man might look back with<br />\npride. As president emeritus, Dr.<br />\nAmes will enjoy the respect and affection of his colleagues and former<br />\nstudents and their good wishes for<br />\nthe happy years for which his temperament and his broad interest in<br />\naffairs so admirably fit him.<br />\nJOHN C. FRENCH,<br />\nLibrarian.<br /><br />\nPeabody Pharmacy<br /><br />\ncm<br /><br />\ndown to<br />\ncorner to get some<br />\nmore Chesterfields<br />\n.•.....•\".<br /><br />\n•<br /><br />"}], "field_media_file": [{"target_id": 38954, "display": null, "description": null, "target_type": "file", "target_uuid": "d2626811-4f93-4cdb-a94e-e9216eb9c7e8", "url": "http://digital.library.jhu.edu/system/files/2022-03/12633-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12633, "target_type": "node", "target_uuid": "0d663ff1-9265-42a0-a823-c6966678fda2", "url": "/node/12633"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3e04ccc4-0d6d-4c3c-bf9b-ba0876ce97d1"}]}