{"mid": [{"value": 37607}], "uuid": [{"value": "75bae3c4-1f2c-4334-954f-a2d242c04c70"}], "vid": [{"value": 37607}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:36:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12177-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:36:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:36:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "l. XXXV, No. 3<br />\n<br />\n\"POPS\" SWINDELL<br />\nTALKS AT ASSEMBLY<br />\nFormer Barnstormer Coach<br />\nUrges Students to go Out<br />\nFor Activities<br />\n<br />\nSENIORS ELECT<br />\nCLASS OFFICERS<br />\nAt a meeting of the Senior<br />\nclass held in the C. E. Hall<br />\nyesterday the following men<br />\nwere elected to office:<br />\n<br />\nENTHUSIASM DISPLAYED<br />\n<br />\nPresident—Heinzerling.<br />\n<br />\nEveryone Gets a Fair Chance<br />\nWith the 'Stormers<br />\n<br />\nVice-president—Parks:<br />\nSecretary—Rutherford.<br />\n<br />\n\"PRIVATE, NO ADMIT7ANCE\" SIGN<br />\nNO BAN TO UNOBSERVANT REPORTER<br />\nFor the past few days users of having stamped them, is piling these<br />\nthe telephones in the Johns Hopkins little blue books in two great big<br />\nJanuary<br />\nbuildings and those suffering indi- packing cases to await next<br />\nwhen mid-year's come.<br />\nviduals who have been trying to get<br />\nThose huddled, the two, by the<br />\nconnections with some Hopkins ever-buzzing switchboard are merely<br />\nlines have been treated to service passing the time by putting little<br />\nde luxe. Not less than four charm- pencil marks here and there on<br />\ning young ladies have been engaged sheets of white paper supported by<br />\nin operating the lone and forlorn tally-boards. Idle sport for such<br />\nseemingly hard-working girls. And<br />\nswitchboard in the basement of Gillast we have the fourth party to the<br />\nman Hall. On second thought, scene. It is she who controls the<br />\nthough, that switchboard is not so dial, the little red lights, the little<br />\nlone and forlorn, and many an yellow lights and the machine-gun<br />\nupperclassman would gladly change sounding 'buzzer—our new phone<br />\nplaces with it and relish the pre- operator.<br />\nBut still we do not know their<br />\ndicament of being all alone with<br />\nfour operators in a room behind a prime raison d'être. The lone switchclosed door with a sign reading: board is not so hardy as some of<br />\nour upperclassmen and needs com\"Private, No Admittance.\"<br />\nIt is now our duty to explain the pany in its misery, therefore the C.<br />\npresence of such an abundance of and P. Telephone Co. has sent its<br />\nfemale talent in this very private two tally-board carriers up to inroom. Quite obviously they are vestigate the traffic and decide the<br />\nthere for a reason, but the explana- fate of the old board and the new<br />\ntion of that reason must wait until operator.<br />\nwe investigate who are the DraOf course, if the new board is inmatis Persona.<br />\nstalled, the new operator will have<br />\nThe former operator, the first we company and will have more time<br />\nsee as we enter the room, for the to gossip and give poorer service,<br />\n\"Private, No Admittance\" does not and maybe the young lady who is<br />\nsay positively, is seated behind a abdicating because of the excessive<br />\ndesk in the center of the floor. Two labor may be urged to stay. It is she<br />\nstrangers are seated, not seated but who was the subject of an article<br />\nhuddled, around the switchboard at in the NEWS LETTER several issues<br />\nthe right, and a fairly new face is ago. And may it be said here that<br />\nat the board swinging the cords, she took exception to this article,<br />\nplugging in the calls and discon- saying that she pays for and wears<br />\nnecting imporynt messages.<br />\nsilk hose, and is grossly insulted<br />\nNow as to their raison d'être. that the former reporter was so unLackadaisically, the first met sub- observant as not to notice the differject is stamping little blue books ence when he interviewed her bewith a great big rubber stamp, and fore.<br />\n<br />\nTreasurer—Kyle.<br />\nYesterday, at the regular weekly<br />\nassembly, \"Pops\" Swindell addresSergeant-at-arms — Tie besed the students on the subject of<br />\ntween Towbin and Halsey.<br />\nthe Barnstormers.<br />\nThe assembly was opened as<br />\nusual by singing the University<br />\nOde. Francis Warlow, President<br />\nof the Student Council, introduced<br />\n\"Pops\" Swindell. He mentioned<br />\nAffiliation With L. I. D. Asthat \"Pops\" Swindell had retired<br />\nsures Prosperous Season<br />\nfrom his position of Coach of the<br />\n\"ENVIABLE .CONFERENCE\"<br />\nBarnstormer's Club, last year. This<br />\nretirement was contrary to his own Many Well - Known Speakers<br />\nTo Address Organization<br />\nwishes and those of the student<br />\nbody.<br />\nA recent bulletin of the League<br />\nActivities<br />\nfor Industrial Democracy declares:<br />\n\"Pops\" opened by saying that this \"The Johns Hopkins Liberal Club<br />\nopportunity was one of the pleas- promotes an enviable conference<br />\nures he looked forward to each year. for colleges of the Potomac region.\"<br />\n\"As I look around this large group<br />\nIn 1928-1929 Johns Hopkins<br />\nof fine-looking young men,\" he said,<br />\nUniversity probably had the strongalways feel that I must for a mo- est Liberal Club of any college in<br />\nment be a little serious.\" Mr. Swin- the country.<br />\ndell believes the extra curricular<br />\nLast year Swarthmore possessed<br />\nactivities in college are of great im- the<br />\nstrongest collegiate Liberal orportance in preparing a young man<br />\nwith Johns Hopkins<br />\nganization,<br />\nfor the work of life. The activities<br />\nprobably second.<br />\nbring something to the student that<br />\nActivities Four-Fold<br />\nstudying will never bring. Each<br />\nAt present the activities of the<br />\nPart of the activities is helpful in Liberal Club are four-fold in their<br />\nlife itself; the acting of any kind,<br />\nnature.<br />\nbusiness work, artistic work, all of<br />\nEach Friday there is a noon<br />\nthem are important.<br />\nluncheon meeting for the club memThe Barnstormers' Club differs bers and their friends, at which adfrom the activities in that it pro- dresses are made by the club memvides something of all of these. bers themselves or by some outside<br />\nMusical Club Holds<br />\nA confidence and \"stage presence\"<br />\nspeaker.<br />\nFirst Official Rehearsal<br />\ncomes from the ability to act. As<br />\nLast night the first official reApproximately once a month a<br />\nproof of the value of this \"Pops\"<br />\nmeeting is held to which the general hearsal of the Musical Club was<br />\nrelated a little story in the manner<br />\npublic is invited. On such occa- held in Levering Hall. According<br />\nWhich only he could assume.<br />\nsions an attempt is made to bring to the president of the organization,<br />\nGorilla Demonstration<br />\nat\"One day a young acrobat went the leaders of American Liberalism Bruce Peake, the new men who<br />\npromise.<br />\nconsiderable<br />\nshowed<br />\ntended<br />\nto a circus to get a job. He was to Baltimore. Men of such ability<br />\ntold that there was no opening; but as Norman Thomas, Scott Nearing, Peake announced that the schedule<br />\nUpon his pleading with the manager, Louis Waldman, Oswald Garrison was still tentative, but that arrangehe was told that the gorilla had died Villard and Roger W. Baldwin are ments are being made for a most<br />\nattractive season, interspersed with<br />\nand if he liked he could -put on the invited to speak.<br />\nseveral trips.<br />\nInterested in Local Conditions<br />\nSkin and act the part. The young<br />\nAny men who were unable to atAs<br />\na<br />\nfor<br />\nchapter<br />\nLeague<br />\nof<br />\nthe<br />\nman practiced a little and went to<br />\nlast night are invited to come<br />\ntend<br />\nIndustrial<br />\nDemocracy,<br />\nclub<br />\nis<br />\nthe<br />\nwork the next morning. He was<br />\nthe<br />\nnext rehearsal, next Thursto<br />\ninterested<br />\ntheoboth<br />\npractically<br />\nand<br />\ngetting along fine and climbing all<br />\nevening<br />\nday<br />\nat 7:30, when addiretically<br />\nin<br />\nthe<br />\nsocial<br />\neconomic<br />\nand<br />\nabout, swinging on ropes, when a<br />\ntional<br />\ntryouts<br />\nwill be held. Immeconditions<br />\nof<br />\nBaltimore.<br />\nrope suddenly snapped and he fell<br />\nrehearsal, meetings<br />\nthe<br />\ndiately<br />\nafter<br />\ni▪ nto the lion's cage. (Here \"Pops\"<br />\nThe League for Industrial Demand Hawaiian<br />\nClub<br />\nthe<br />\nBanjo<br />\nof<br />\ndid a wonderful job of imitating ocracy (or L. I. D., as it is generbe held. The<br />\nTroupe<br />\nwill<br />\ngroups<br />\nboth the lion and gorilla.) Fright- ally known) is a membership society<br />\npractices on<br />\nOrchestra<br />\nBlue<br />\nJay<br />\nened nearly to death by the lion's composed principally of college<br />\naccording<br />\nand,<br />\nafternoons<br />\nThursday<br />\nfiy-ce growls the acrobat cried for graduates and college students.<br />\nseveral<br />\nleader,<br />\nthe<br />\nBert<br />\nClark,<br />\nto<br />\nhelp, forgetting his job. Then the Among the officers are Robert<br />\npositions<br />\navailable.<br />\nare<br />\nlion came closer and between growls Morss Lovett, professor of English<br />\nGreat stress will be placed on atsaid, 'Shut up, you damn fool !'\" Literature at the University of Chicago and an editor of the New Re- tendance this year. If the attendWell Received<br />\nThe story was greeted with roars public; John Dewey, the philoso- ance of any of the members is lax,<br />\nof 1.aughter<br />\nalong on any<br />\nwhich the acting fully pher; Alexander Meiklejohn, direc- they will not be taken<br />\nmerrted. He then mentioned the tor of the Experimental College, of the trips.<br />\nobligations of the college boy to his University of Wisconsin; Vladimir<br />\nparents to get something out of Karapetoff, professor of electrical<br />\nBlack and Blue Jay<br />\ncollege; to<br />\nimprove his mind, and engineering, Cornell University, and<br />\nTo Appear Today<br />\nto prepare<br />\nthe way for the future. inventor; Florence Kelley, national<br />\nT h e long-heralded Freshman<br />\nstudent should not enter activi- secretary of the Consumers'League, number of the Black and Blue Jay<br />\nvities if they will interfere with and Stuart Chase, author and<br />\nwill make its first appearance tohis studies, which<br />\nare really most economist.<br />\nIt will contain all of the old<br />\nday.<br />\ni▪ mportant.<br />\nNorman Thomas Included<br />\nAlthough there was<br />\nfeatures<br />\nin addition to a new cover<br />\na big crowd<br />\nThe executive staff includes Nor- design by Harold Blum.<br />\nat the rally, since<br />\nthen at the rehearsals the number man Thomas, Dr. Harry W. LaidAlthough the Jay may appear to<br />\nof candidates<br />\nhas dwindled. The ler, Karl Borders, Mary Fox and be late, it is in reality two weeks<br />\nbasis on which the Barnstormer's Paul Porter, field secretary. Paul<br />\nahead of last year's initial appearClub is built is that no favoritism Blanshard, one of the most popular<br />\nance.<br />\nis shown.<br />\nEverybody gets a fair college speakers in America, occachance and the best man gets the sionally acts in the capacity of<br />\nDate Book On File<br />\nj▪ ob. \"Pops\"<br />\nasked the handsome special lecturer.<br />\nIn Registrar's Office<br />\nmen to come out for the<br />\nThe outstanding activity of the<br />\nhero's<br />\nDate<br />\nBook for the purpose of<br />\nA<br />\nroles, the funny looking for those club is<br />\nthe annual Liberal Confer- recording coming events is kept on<br />\nof the villains and<br />\nthose with a ence each Spring, which is attended file at the Registrar's office in Remhumorous trend for the comedians by students from New England to<br />\nsen Hall. Thus far the only groups<br />\nParts.<br />\nNorth Carolina.<br />\nthat have made use of the book<br />\nFrancis Warlow then made a<br />\nAt last year's Conference the are the Football Team and the<br />\nfew announcements and<br />\nturned the socialization of power was dis- Cotillion Board. Therefore,a repreassembly over to Cliff Gilbert, cussed.<br />\nOne of the speakers at that sentative of each University activity<br />\ncheer leader. There followed one time<br />\nhad been called before the is requested to place on file a list of<br />\nof the best cheering<br />\npractices this Congressional committee investi- his organization's appointments as<br />\nyear.<br />\nWont. on page 4, col. 2)<br />\nsoon as possible.<br />\n<br />\nJ. H. U. LIBERAL CLUB<br />\nHIGHLY PRAISED<br />\n<br />\na<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br />\n<br />\nDUKEHART ELECTED<br />\nJUNIOR PRESIDENT<br />\nAt a meeting of the Junior<br />\nclass, held in the C. E. Hall,<br />\nWednesday, Ned Dukehart<br />\nwas elected to succeed himself<br />\nas president of the Junior<br />\nclass. Dukehart presided over<br />\nthe Sophomore class last year.<br />\nThe other officers elected by<br />\nthe Juniors for the coming<br />\nyear are as follows:<br />\nMettee, secretary.<br />\nBialoskorski, treasurer.<br />\nPerry and Becksinski tied<br />\nfor office of sergeant-at-arms.<br />\nThere will be a short meeting of the class of '32 to vote<br />\noff the tie for sergeant-atarms.<br />\n<br />\nHOPKINS TO MEET<br />\nRUTGERS TOMORROW<br />\nJerseyites Defeated George<br />\nWashington and Lost to<br />\nSyracuse<br />\nJAYS' FIRST TRIP<br />\nBobby Lyons Might be Able to<br />\nPlay<br />\n<br />\nJohns Hopkins travels to New<br />\nBrunswick, N. J., tomorrow for<br />\ntheir second strenuous test in as<br />\nmany weeks when they lock horns<br />\nwith Rutgers College. The Jays<br />\nwill be forced to display as much if<br />\nnot more than they did last week<br />\nagainst Lehigh.<br />\nCoach Van Orman's men surprised quite a few of their own<br />\nloyal followers not to mention the<br />\nmajority of sports writers and critics in the city by their fine work<br />\nagainst the heavier and more exTopic Chosen is \"Religion and perienced Pennsylvania eleven last<br />\nSaturday. Picked by the local exLife Today\"<br />\nperts to win by three or four touchdowns the Lehigh team was lucky<br />\nMEETING WELL ATTENDED<br />\nto return home without a tie, and<br />\npossibly a defeat, registered against<br />\nSpeaker Suggests Ways of Rethem. Whatever advantage the Jays<br />\nligious Success<br />\nconceded their opponents in weight,<br />\nexperience, etc. they more than<br />\nChoosing for his topic \"Religion made up for in fight and pep.<br />\nThey<br />\nand its Relation to the Life of To- were outscored but not outfought.<br />\nday\", William E. Kroll told the If the same fight remains with the<br />\nmembers of the University Supper Ropkins team this week, and there<br />\nClub how religion could best be is no reason why it shouldn't, the<br />\npracticed in this day and age.<br />\nresult at New Brunswick tomorrow<br />\nAfter a few announcements by E. should be most favorable as far as<br />\nA. Schaal, the speaker of the eve- the Black and Blue is concerned.<br />\nning was introduced by Linck,<br />\nLehigh Uneasy<br />\nchairman of the Supper Club. Mr.<br />\nThere is no reason why the Jays<br />\nKroll began by stating that our re- should feel particularly bad about<br />\nligion is now at a crisis, that it has last week's game. True, there were<br />\nGrads Inaugurate First<br />\nbeen broken down; this has been some rough spots that need to be<br />\nOf Weekly Assemblies blamed on the recent war, but the ironed out, but the fact that they<br />\nInaugurating its initial event of causes are more underlying, and came from behind to<br />\ntie the score<br />\nthe college term, the graduate stu- were only brought to a focus by the twice and then lost only<br />\nthrough a<br />\ndent body of the Johns Hopkins war. The result is that we are per- pass<br />\nused as a last resort, speaks<br />\nUniversity will hold a reception to- plexed as to what we can really highly for<br />\ntheir fighting spirit and<br />\nmorrow, 8:30 P. M., Levering Hall, have in the way of religious belief. makes<br />\nthe future seem much brightto which all faculty members and<br />\ner. In the last quarter and indeed,<br />\nHelpful Pointers<br />\ngraduate students are invited. The<br />\nTo help us answer this, Mr. Kroll from the opening minutes, they<br />\naffair will be featured by an address<br />\ncontinued he would give us three caused the Lehigh team and everyto be delivered by Dr. Joseph S.<br />\npoints which he thought would be one connected with it quite a few<br />\nAmes, president of the Johns Hopof help. The first of these was that uneasy moments.<br />\nkins, and by dancing and card<br />\nthe church should again become an<br />\nLost to Syracuse<br />\ngames.<br />\nimportant center of everyday life as<br />\nLittle<br />\nis known of the real<br />\nIt is planned to stage a religious<br />\nit has been in times past. It lost strength of tomorrow's opponents.<br />\ndiscussion luncheon group each<br />\nthis pre-eminence because when cer- The New Jerseyites scored a 20-to-6<br />\nTuesday, 12:30 to 1:30 P. M., for<br />\ntain ideals were reached, people be- victory over George Washington<br />\ngraduate students who care to atcame firmly intrenched in them, and two weeks ago and then lost last<br />\ntend. George Seidel, graduate stuwould not step out to expand. Now Saturday to Syracuse, 27-0. This<br />\ndent in the Chemistry Department,<br />\nwe must leave these and strike out would indicate a fairly strong team<br />\nis in charge of the committee on<br />\nfor new ones, but retain the old ones as Rutgers teams go and it is safe<br />\narrangements.<br />\nuntil the new are firmly established. to say that they will be taking no<br />\nDr. F. R. Bayley is the discussion<br />\nThus will the church gain its right- chances with the Black and Blue<br />\ngroup leader, according to Mr. E.<br />\nful place.<br />\neleven when they line up.<br />\nA. Schaal, executive secretary of<br />\nChristianity Tolerant<br />\nAs for the Jays, they, too, realize<br />\nthe Y. M. C. A. Hopkins cabinet.<br />\nSecondly, he said, Christianity is the task which confronts them. RutSubsequent to Saturday's reception the graduate students will becoming more tolerant and less gers will probably be stronger than<br />\ndefinitely organize their social pro- dogmatic in its beliefs, and should Lehigh but this does not necessarily<br />\ncontinue to do so. But still Christ spell doom for the locals. It is safe<br />\ngram for the season.<br />\nis to be regarded as the center of to prophesize that they will be in<br />\nthe game, fighting every minute of<br />\nActivities Council Mak s belief and the first authority.<br />\nAppropriation To Band Third, finally and most important, the time.<br />\nThere will probably be one or<br />\nFor the first time this semester, in the speaker's point of view, is the<br />\nthe Student Activities Council met necessity of living the principles of two changes in the Hopkins' linein Levering Hall last Tuesday at religion in everyday life. To be a up tomorrow. Bill Weitzel, who<br />\nreal Christian nowadays means to has becii performing well at right<br />\n1 :30 P. M.<br />\nThe main discussion involved the believe in practicing Christian prin- end, will be out because of a<br />\never serious matter of appropria- ciples. To use the words of Christ wrenched ankle which he secured<br />\ntions. After careful consideration, \"He that willeth to do shall know.\" in last week's setto. In all probaMr. Kroll is the minister of the bility Yearly, who went in when<br />\nit was decided to increase the apArlington<br />\nAvenue Presbyterian Weitzel was Eurt, will start at that<br />\npropriations for the band by drawChurch<br />\nof<br />\nEast<br />\nOrange, N. J. He position. Yearly is a freshman but<br />\ning the sum of twenty-five cents<br />\nis<br />\nespecially<br />\ninterested<br />\nwith student has shown up well in both games<br />\nfrom the activities card of each<br />\nwork<br />\nand<br />\nis<br />\nintimately<br />\nconnected and promises to develop into a stelstudent. The purpose of this inlar wing before he leaves college.<br />\ncrease is to aid the band to acquire with student Y. M. C. A. work.<br />\nMeeting Well Attended<br />\na professional leader.<br />\nLyons Might Play<br />\nCharles Weller, representing the<br />\nThe meeting, which was the first<br />\nAnother change may be made in<br />\nband, was present at the meeting. of the season, was well attended, the backfield as Bobby Lyons' knee<br />\nHe stated that in order to increase and it is believed was thoroughly seems to be mending nicely. Lyons<br />\nappropriations for the band it would enjoyed by those present. Enter- was not in uniform last week but<br />\nbe necessary to cut appropriations tainment was furnished by the Delta may break into the game tomorrow.<br />\nfor other organizations of the Uni- Upsilon Orchestra in the form of Bernard and Towbin will in all<br />\nversity.<br />\npopular music and college songs. probability be sent in to bolster up<br />\nThe Student Activities Council The audience was led in singing the the line, although the former is sufplans to gather to discuss and decide songs by Cheer Leader Gilbert and fering from a wrenched shoulder<br />\nupon matters of the various activi- managed to make quite a noise at which may render him useless this<br />\nties represented on the campus.<br />\ntimes.<br />\nweek.<br />\n<br />\nSUPPER CLUB HEARS<br />\nWILLIAM E. KROLL<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br />\n<br />\n2<br />\n<br />\nInn<br />\n<br />\nCONTESTS<br />\nSHOPKINS WSILETTER ORATORICAL<br />\nTO BE HELD AGAIN<br />\nDr. Wheeler Deplores Lack of<br />\nInterest In Events<br />\n<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\n<br />\nBelmont 8778<br />\n<br />\nTelephone<br />\n<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nSYLVAN LEBOW, '32<br />\nROWLAND McD. NESS, '32<br />\n<br />\nJunior Editors<br />\nNATHAN M. HARRIS, '32<br />\nHAROLD B. YUDKIN,'32<br />\nMELVIN GUDE, '33<br />\nHERBERT FRIEDBERG, '33<br />\nMARION GROVE, '33<br />\n<br />\nRAYMOND DUNN,'33<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nDAVID DOLOWITZ, '33<br />\nJACK GREENFIELD, '33<br />\n<br />\n(Cont. from page<br />\n<br />\n4, col. 3)<br />\n<br />\nmedal is presented in honor of<br />\nAlexis de Tocqueville, author.<br />\nThe winner of the Adams Declamation contest, held yearly during<br />\neither April or May, is awarded a<br />\ngold medal. This competition is<br />\nopen to only Sophomores. J. K.<br />\nMount, Jr., won the 1929 award.<br />\nSenior-Junior Debate<br />\nSeniors and Juniors have the opportunity each year to try out for<br />\nthe respective class debate teams,<br />\ncomposed of three men each, which<br />\nmeet annually in what is termed the<br />\nHerbert B. Adams Debate. The<br />\nvictorious trio of debaters are permitted to purchase a total of fifty<br />\ndollars' worth of books. Last year,<br />\nJanuary 16, 1930, the Juniors triumphed over the fourth year men.<br />\nWhen the Freshmen and Sophomores meet to debate, to the victor<br />\ngoes glory alone. No award is<br />\nmade in the lower class debate. December 11, 1929, the first year men<br />\n—Alpert, Dunn and Milestone—defeated the Sophomore speakers.<br />\nThom Cup Presented<br />\n<br />\nMrs. Thom, distinguished society<br />\nwoman, distant relative of Johns<br />\nHopkins and author of a biography<br />\nupon the late founder, yearly<br />\nBUSINESS DEPARTMENT<br />\nawards the Thom Cup to the winner<br />\nBusiness Manager<br />\nof an extemporaneous speaking conGus BURK, '31<br />\ntest. Stuart L. Smith captured the<br />\ntrophy last season.<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nDAVID SYKES, '32<br />\nGEORGE W. LA MONT,'32<br />\nPreliminaries are held in order to<br />\nselect<br />\nthe finalists. From each<br />\nOffice Manager<br />\npublic speaking course section two<br />\nISADOR GUTMAN, '33<br />\nare chosen. This year there will be<br />\nCHARLES NEY, '33<br />\nWILBUR BLOOM,'33<br />\nten contestants in the final appearSIMON LITT, '33<br />\nMORTON ROME,'33<br />\nance.<br />\nIn explaining the conditions of<br />\nProduced by the R. L Polk Printing Company, 1930 Clifton Ave., Baltimore, Md. the contest, Dr. Wheeler pointed<br />\nout the speeches are to be based<br />\nupon one general topic, announced<br />\nto the contestants thirty-six hours<br />\nprior to the date set. Ten minutes<br />\nbefore each speaker is scheduled to<br />\nappear before the audience he is<br />\ngiven his particular topic based<br />\nupon the general subject.<br />\nDr. Wheeler states he intends to<br />\nTHE ROLLINS PLAN<br />\nabolish the ten minute provision and<br />\nto present the topic to the speaker<br />\nTATING on October first with an article by Professor Howard<br />\nof Northwestern University, on \"Who Ought to Go to College,\"<br />\nas he enters the entrance to the<br />\nThe Nation is publishing a series of articles on educational experistage.<br />\nments which should be of interest to Hopkins students. After discussing at length the various methods by which a college may select<br />\nthe most likely prospects, Dr. Howard shows the hopelessness of the<br />\nsituation by the following two statements, \"Actually, any high school<br />\ngraduate can enter college, for if one college will not take him, he<br />\ncan go to another\" and \"—I am disposed to believe that anybody ought<br />\nto go to college who really wants to.\" In other words, it is impossible to keep any high school graduate out of college and for this reason Dr. Howard advises that everyone who wants to should go to<br />\ncollege.<br />\nThe foremost defect in this system is stated in the second of the<br />\nseries of articles, \"The Rollins Idea,\" by Hamilton Holt. Dr. Holt<br />\nsays, \"For in the effort to build up the most elaborate machinery in<br />\nthe world for turning out academic degrees it seemed to me that we<br />\nhad somewhere lost the essence of true education, and that to find it<br />\nagain we must revert to simpler methods, fewer rules, less emphasis<br />\nupon information and more upon thinking.\"<br />\nAt Rollins for the last four years experiments have been made to<br />\neliminate these defects. The Rollins two-hour conference plan has<br />\nobvious advantages. Some of the more important changes are the<br />\nabolishment of lectures and recitations, the minimization of term and<br />\nyearly examinations, freedom of outside time, and the attempts to<br />\nreplace textbooks with life that is to say to give nothing second-hand<br />\nthat may be acquired first-hand by the student.<br />\nA teacher presides over each conference but he does not lecture,<br />\nnor does he hear recitations. His primary function is to keep quiet, and<br />\nto guide and stimulate work. The students study and discuss problems<br />\namong themselves. The situation seems ideal for the student who is<br />\nreally anxious to learn. Furthermore one student who advances more<br />\nrapidly than his fellows is not held in check by a slow class. With<br />\nthe aid of the teacher, he may in the course of a year, cover much<br />\nmore ground than his classmates. This system, of course, could not<br />\nbe immediately adopted by American colleges. Some students would<br />\nnot progress with this lack of rule and regulation. This type of student, however, is the type that needs to be eliminated. The primary<br />\nreason why the Rollins Plan could not be adopted is that a sufficient<br />\nnumber of teachers could not be found. One able teacher is needed<br />\nCollege men who know what to<br />\nfor every ten students at Rollins.<br />\nwear and how to wear it choose<br />\nAlligator \"50\"— the new College<br />\nThe plan seems to be a decided success at Rollins, but more experiCoat... Alligator \"50\"is a smart<br />\nmentation is necessary before the system can be termed ideal. The<br />\ndouble-breasted raglan —long—fullstudents at Rollins as well as the faculty were hand-picked, and never<br />\ncut—roomy—full-belted, with big<br />\ndoubted that the plan would be successful.<br />\npatch pockets, and a convertible<br />\nAt Hopkins, attempts to get away from rules and, regulations are<br />\ncollar that gives extra protection<br />\naround the neck ... Light in<br />\nbeing made. The student is informed as a freshman that he must be<br />\nweight —semi-transparent—absointellectually independent. He is not being forced to work, but is<br />\nlutely weather-proof. Four rich,<br />\nassisted if he wishes. The cutting of classes is not a serious misoriginal colors —Deep Sea, Tan,<br />\ndemeanor as in some colleges. The roll is not constantly checked.<br />\nBlue,Black —and only $7.50!...<br />\nExaminations eliminate those who take advantage of newly gained<br />\nOther Alligator models from<br />\nliberties, as they would term them. Others however lose the high$5.00 to $25.00.<br />\nschool attitude that the teacher is your enemy, and that anything you<br />\nTHE ALLIGATOR CO.<br />\ncan put over on him is a coup for yourself. They realize instead the<br />\nSt. Louis, Mo.<br />\nteacher will help the man who wants to learn, but will certainly not<br />\ncompel the man who does not care to learn to study.<br />\n<br />\nHULLABALOO STAFF,<br />\nCANDIDATES TO MEET<br />\nCandidates and members of<br />\nthe editorial, art and photographic departments of the<br />\nHullabaloo staff will meet with<br />\nTownsend Parks, editor-inchief, in the Hullabaloo office<br />\ntoday at 12:30 P. M. At this meeting Parks will<br />\norganize the staff and explain<br />\nthe year's work. Candidates<br />\nare wanted from all classes<br />\nfor all the departments.<br />\nParks announced that the<br />\nwork in view will be discussed, but the actual theme<br />\nof the book will not be divulgel until later in the year.<br />\n<br />\nHochschild, Kohn & Co.<br />\n<br />\nCotillion Board To<br />\nHold Dance Saturday<br />\n<br />\nTwo short months ago we'd have priced these<br />\n<br />\n$29\"<br />\n.<br />\nis doing the job<br />\nof $35<br />\nat<br />\n<br />\nThere will be a Cotillion Board<br />\ndance on October 18, in the Civil<br />\nEngineering Hall. Music will be<br />\nfurnished by Bob Iula's band. Sub-<br />\n<br />\ntwo-trouser suits at $35---and they'd have<br />\n<br />\nscription, either stag or couple, is<br />\none dollar.<br />\nAt a meeting of the board Thursday afternoon a number of the<br />\nmembers of the art squad were appointed to make posters advertising<br />\nthe dances after the games for this<br />\nyear. Also, it was announced that<br />\nhereafter the Cotillion Board will<br />\nhold its meetings in Levering Hall<br />\nevery Monday at twelve twenty instead of on Thursdays.<br />\n<br />\nBut now---because Hochschild, Kohn & Co.<br />\n<br />\nbeen good values!<br />\n<br />\nclothing values are greater than ever---you<br />\ncan get them for $29.75.<br />\nNot an inch of material sacrificed---nor a<br />\nstitch of tailoring. But a new low price to<br />\ndemonstrate our power for value-giving.<br />\n<br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n<br />\nEvery Suit with 2 trousers!<br />\n<br />\n20 S. SHARP ST., BALTIMORE<br />\n<br />\nEMIORIALS<br />\n<br />\nS<br />\n<br />\nTHE NEW<br />\n<br />\nThe new free book<br />\n\"GAS HEAT\" is ready<br />\nfor distribution. Have<br />\nyou received your<br />\ncopy?<br />\n<br />\nThe unprecedented growth in the use of die-castings can<br />\n<br />\nlargely attributed to the perfection of the process through the<br />\n<br />\nuse of gas. Die-casting metal must be kept at constant temperatures for long<br />\nperiods of time—what better way to maintain the proper thermal head than by<br />\nthe use of gas? In many cases, too, where intricate dies are involved, tiny gas<br />\njets keep thin sections at uniform temperature, thus preventing the freezing<br />\nof metal in the gates, and assuring perfect castings every time.<br />\nAMERICAN GAS<br />\nASSOCIATION<br />\n420 Lexington Avenue, New York<br />\n<br />\n$750<br />\n<br />\nSmartest Coat<br />\non the Campus<br />\n<br />\nbe<br />\n<br />\nThe gas-fired furnace for melting scrap metal is an important<br />\nadjunct to the die-casting shop.<br />\n<br />\nyou can do it better with<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br />\n<br />\nmamma.<br />\n<br />\nAutumn Showing-The season's styles in neckwear are the key to a<br />\n<br />\nSOPHOMORES TO NOMINATE CLASS OFFICERS<br />\nman's dress . . . they give that<br />\n<br />\ntouch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br />\nInterwoven Hose<br />\n<br />\nScotch Spun Neckwear<br />\n<br />\nManhattan Shirts<br />\n<br />\n11 East Baltimore Street<br />\n<br />\nMcPHERSON'S<br />\n<br />\nCollege Men Will Appreciate This<br />\n6 BREAKFASTS<br />\nALL FOR<br />\n<br />\n7 DINNERS<br />\nGood Food<br />\n<br />\n$7.00<br />\n<br />\nLowest Prices<br />\n<br />\nHASSLINGER'S<br />\n3226 Greenmount Avenue<br />\nr<br />\n<br />\nJust Below 33rd Street<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nRENT A CAR<br />\n<br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br />\n<br />\n111 W. NORTH AVE.<br />\n<br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe 1413<br />\n<br />\nHalf of you men<br />\nin college have<br />\n<br />\nATHLETE'S<br />\nFOOT\"<br />\n....says U.S. report<br />\nOU may call it toe itch,golf<br />\nitch-the \"doe\" may call it<br />\nringworm—millions of people<br />\nwho catch it, call it \"Athlete's<br />\nFoot\"— but all of them are the<br />\nsame. A ringworm parasite,<br />\ntinea trichophyton by name,<br />\ncauses that redness between the<br />\ntoes with i-t-c-h-i-n-g. Tiny<br />\nblisters or a thick, moist skin<br />\ncondition may be another symptom. Again dryness, with little<br />\nscales, is a signal.<br />\n<br />\nY<br />\n<br />\nthis fungus parasite infects and<br />\nreinfects bare feet almost any<br />\ntime they come in contact with<br />\ndamp floors.<br />\n<br />\nAbsorbine Jr. kills the<br />\ngerm of<br />\n\"ATHLETE'S FOOT\"<br />\n<br />\nTests in a famous New York<br />\n\"lab\" have revealed that<br />\nAbsorbine Jr. penetrates flesh.<br />\nlike tissues deeply and that<br />\nv`At least half of all adults wherever it penetrates,it KILLS<br />\nsuffer from it at some time,\" the ringworm germ.<br />\nsays the U. S. Public Health<br />\nIt might not be a bad idea to<br />\nService. In universities as far examine your feet tonight. At<br />\napart as Pennsylvania and Cali- the first sign of the symptoms<br />\nfornia 50% of the men have it. mentioned here, douse on<br />\nAnd the co-eds are not immune Absorbine Jr. And keep a bottle<br />\neither.<br />\nhandy in your locker as a preventive.<br />\nUse it after every<br />\nIt lurks in the very places<br />\nexposure<br />\nof<br />\nbare feet on damp<br />\nwhere we all go for cleanliness<br />\nand health—on the edges of floors. At all druggists — $1.25.<br />\nYoung, Inc., Springfield,<br />\nswimming pools and showers— W.F.<br />\nMassachusetts.<br />\nin gymnasiums—on locker- and<br />\ndressing-room floors. It spite of<br />\nmodern sanitation (you have to<br />\nboil socks 15 minutes to kill it'<br />\n<br />\nAbsorbine<br />\nFOR YEARS HAS RELIEVED SORE<br />\nMUSCLES, MUSCULAR ACHES, BRUISES,<br />\nBURNS, CUTS, SPRAINS, tBRASIONS<br />\n<br />\nNominations for class officers will be held at the first<br />\nSophomore class meeting at<br />\n12:20 in C. E. 120 today.<br />\nJack Turnbull, president of<br />\nlast year's Freshman class, will<br />\nconduct the meeting. It is<br />\nhoped that as many Sophomores as possible will attend.<br />\n<br />\nLinthicum Named Captain<br />\nOf Scabbard and Blade<br />\nAt the first meeting of the Scabbard and Blade, honorary military<br />\nfraternity, it was decided that election for first lieutenant for the ensuing term will be held on Tuesday,<br />\nOctober 21.<br />\nScabbard and Blade is a fraternity to which seniors of high standing in the R. 0. T. C. and other<br />\nuniversity activities, as well as<br />\nscholarships are elected. There are,<br />\nat present, seven men in the company.<br />\nSweester Linthicum, lieutenant<br />\ncolonel of the Cadet R. 0. T. C.<br />\nCorps, automatically became captain of the company due to the fact<br />\nthat Bledsoe has not returned this<br />\nyear.<br />\nIt is planed to have many activities this year, including a dance for<br />\nthe members.<br />\n<br />\nCoach Morrill Continues<br />\nFall Lacrosse Practice<br />\nAt the second practice of fall lacrosse, which was held Tuesday,<br />\nCoach Morrill, who is in charge,<br />\ncontinued in his elementary drill in<br />\nstickwork ann fundamentals for the<br />\ncandidates. The majority of these<br />\ncandidates are playing the game for<br />\nthe first time and this work is a<br />\nnecessity if they expect to develop<br />\ninto varsity material. The work for<br />\nthe main part consisted of passing<br />\nand receiving with Coach Morrill<br />\nand members of last year's varsity<br />\ncorrecting the new men.<br />\nThe coach wishes to repeat again<br />\nhis anouncement to all those who<br />\ncontemplate trying for the team in<br />\nthe spring. With many other phases<br />\nof the game to be worked and<br />\ncoached, the man with deficient or<br />\nundeveloped stickwork will be at a<br />\ndistinct disadvantage. It is for the<br />\npurpose of teaching and improving<br />\nthe rudiments of stickwork that the<br />\npractice is held in the fall. Men out<br />\nfor another sport such as football<br />\nor cross country, of course, cannot<br />\nattend. But those who are able to<br />\nparticipate at this time are urged to<br />\ndo 50.<br />\nAmong those of last year's varsity squad who are attending the<br />\npractice are Stone, Kelly, Ness, and<br />\nMcDorman. Others are Davis,<br />\nReid, Mattingly, Martin, Kuper,<br />\nGude, Krulev itch, Chancellor and<br />\nWilloughby.<br />\nA call for freshman managers in<br />\nthis sport has also been sent out.<br />\nCandidates for this position should<br />\nreport to Manager L. A. McNeer<br />\nat the dressing rooms or the field on<br />\nTuesday and Friday afternoons.<br />\n<br />\nBoard To Penalize<br />\nViolaters Of Agreement<br />\nAt a special meeting of the Interfraternity board, Monday, resolutions were passed to the effect that<br />\nall violations of rushing rules would<br />\nbe subject, according to the resolutions, to the usual penalty of from<br />\n$1.00 to $100.<br />\nSo far, the board declared, all<br />\nHopkins fraternities have abided<br />\nstrictly by the rushing agreement.<br />\nThe resolutions were passed, however, to acquaint campus fraternal<br />\norganizations with just what means<br />\nwould be used to enforce the agreement.<br />\nRushing regulations prohibit any<br />\nfraternity represented by the Interfraternity Board from pledging<br />\nFreshmen before the second semester.<br />\n<br />\nCROSS COUNTRY TEAM TO<br />\nBE CHOSEN TOMORROW<br />\nFreshman-Sophomore Meet to<br />\nBe Held Wednesday<br />\nWith prospects for a successful<br />\nseason ever increasing, Coach<br />\nHambleton is putting his harriers<br />\nthrough a period of intensive training preparatory to the Lehigh meet<br />\non October 25 at Homewood. The<br />\ncross-country men have already<br />\nbeen taken over the course several<br />\ntimes and have been improving the<br />\ntime with each successive trip.<br />\nTomorrow<br />\nsquad will be<br />\nmile course.<br />\nwill definitely<br />\n<br />\nAn influence for<br />\nbetter dressing at<br />\nMaryland colleges!<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\ntryouts for the first<br />\nconducted over a 41/2<br />\nSeven or eight men<br />\nbe chosen to compete.<br />\n<br />\nayn@,tvL-Gylrt_<br />\n<br />\nLehigh<br />\n<br />\nLehigh, it has been rumored, will<br />\npresent quite a strong team, but<br />\njudging from the form the Blue Jay<br />\nharriers have been displaying in<br />\n<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br />\n<br />\npractice, Homewood ought to be the<br />\nscene of an interesting meet at the<br />\nend of the month.<br />\nThe cross-country squad this year<br />\nhas been greatly strengthened by<br />\nthe addition of Paul Zepp, an experienced distance runner. Some of<br />\nthe other candidates who have been<br />\nshowing excellent form are Hancock, Packard, Cornman, Rapport,<br />\nSneeringer, Mattingly and Sklarewsky.<br />\n<br />\nNEW<br />\n<br />\nFORD<br />\n<br />\nUSED<br />\n<br />\nAutomobiles<br />\n<br />\nFrosh-Soph Meet<br />\n<br />\nA 21/2 mile meet will be held between the Freshman and Sophomore teams on Wednesday, when<br />\nthe younger men will have a chance<br />\nto run in competition.<br />\nIn spite of the fact that the<br />\ncross-country squad this year is one<br />\nof the largest, Coach Hambleton is<br />\nanxious that as many candidates as<br />\npossible try for the squad. He<br />\nadded that all interested should report immediately, since equipment<br />\nis now being ordered for the team.<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br />\n<br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nvlry<br />\n<br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\n•WV<br />\n<br />\n\"Food Prepared the Right Way\"<br />\n<br />\nThis white<br />\ndot identifies<br />\nSheafrer's,the<br />\nONLY Aenuine<br />\nLifetime° pen.<br />\n<br />\nThe only Balance° per<br />\nand pencil is Sheafrer's.<br />\n<br />\nThe College World<br />\nhas \"gone Sheaffer\"*<br />\n<br />\nNo. HTSC,<br />\nMarine Green,<br />\n$4.00<br />\n<br />\n1111111111111111111111111111111111111110,<br />\n<br />\nThe plain factis that among the hundred leading<br />\nAmerican colleges, each having 1,700 or more<br />\nstudents registered, more Sheaffer's are bought<br />\nthan any other make. That's understandable<br />\nenough, once you're acquainted with Sheaffer's<br />\nfour advantages: (1) individualized pen points,<br />\n(2) the Balance° design that makes for easier,<br />\nspeedier writing, (3) the modern beauty of the<br />\nBalance° contour,(4) the Lifetime° guarantee of<br />\nsatisfactory service.<br />\nSince all that comes with Sheaffer's Balance°<br />\nLifetimes°, why be content with less?<br />\n*A recent survey made by a disinterested o*anization showed<br />\nSheaffer's first in fountain pen sales amonk,the 100 leadinE,American<br />\ncollek,es havin registration of 1,700 or more students. Documents<br />\ncoverink, this survey are available to anyone.<br />\n<br />\nAT BETTER STORES EVERYWHERE<br />\nThe ONLY genuine Lifetime° pen is Sheaffer's; do not be deceived!<br />\nAll fountain pens are uaranteed ak,ainst defects, but Sheaffer's Lifetime° is kuaranteed unconditionally for your life, and other Sheaffer<br />\nproducts are forever liaranteed apinst defect in materials and workmanship. Green or Black Lifetime° pens,$8.75; Ladies', $8.25. Blackand-Pearl DeLuxe and Marine Green Lifetime° pens,$10;Ladies',$9.50.<br />\nPetite Lifetime° pens,$7 up. Golfo'.Handba Pencil,$3. Others lower.<br />\nSAFETY SKRIP, SUCCESSOR TO INK,SKRIPFILLED, 50c to $10. Carry<br />\nSafety Skrip in your luPlake<br />\nand to classes. It's leak-proof,<br />\n<br />\npractically unbreakable.<br />\nSavesfurniture,clothink„ruks,<br />\nkeeps the fluid fresh, makes<br />\nall pens write better.<br />\n<br />\nHEAFFE<br />\n<br />\nPENS•PENCILS-DESK SETS•SKRIP<br />\n<br />\nW.A.SHEAFFER PEN COMPANY,FORT MADISON,IOWA,U.S.A.<br />\n<br />\noaeg. U. s. Pat. Off..<br />\n<br />\n©W,A. S.. P. Cu., UN<br />\n<br />\nNo.<br />\nK74TC<br />\n$9.50<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br />\n<br />\n4<br />\nDR. FRENCH SPEAKS TO EN GUSH<br />\nCLASS ON J. H. U. LIBRARY<br />\nall<br />\nlitle<br />\nway in college, and in some few<br />\n\"Libraries are the hearts of<br />\nenterprising universities, and the cases, even to graduation. But the<br />\nstudent body at Johns Hopkins university plan of reading more<br />\nthan the required amount of books,<br />\nshould feel it a great privilege to<br />\nand of satisfying your intellectual<br />\nhave so fine a one.\" This was the<br />\ncuriosity will see you through much<br />\nstatement of Dr. French, Johns farther and much more successHopkins librarian, in a talk to the fully.\"<br />\nclass in English composition on<br />\nThe Hopkins libraries have been<br />\nWednesday.<br />\ncollecting books for fifty years, and<br />\nDr. French went on to explain now have over four hundred thouthat a university is founded for two sand bound volumes, and countless<br />\npurposes: instruction, and research. numbers of unbound pamphlets.<br />\nFor both of these, he said, libraries Three hundred thousand bound volare absolutely essential.<br />\numes are at Homewood.<br />\n\"The high school plan of reading<br />\nThe windows in the main library<br />\nonly the required literature and are among the finest in the world.<br />\npassing exams,\" he stated emphati- A printed sheet explaining them<br />\ncally, \"will carry a student along a may be secured at the desk.<br />\n<br />\nJ. H. U. Band Meets To<br />\nPrepare For Coming Season<br />\n<br />\nLIBERAL CLUB<br />\n(Cont. from page 1, col. 2)<br />\n<br />\nMeeting for the first time this gating this situation. A great many<br />\nyear, the Johns Hopkins Band con- Southern colleges were represented<br />\nvened in the Barn last Monday for at this conference, as the result of<br />\norganization,practice and discussion the spread of liberalism in the<br />\nSouth, due to the terrible conditions<br />\nof proposed activities.<br />\nexisting in the Southern textile inHerbert Trueheart presented a<br />\ndustry.<br />\ndetailed resume of the band's deL. I. D. Advises Clubs<br />\nvelopments and spoke of the inThis year the Club is in close<br />\ncreased membership.<br />\ntouch with the League for IndusMr. Converso will probably contrial Democracy's New York office,<br />\nduct the band this year. The musiand its members have been called<br />\ncal organization will be under the<br />\nupon for advice in the formation of<br />\nsupervision of Norman Milbourne<br />\nseveral Liberal clubs.<br />\nand Eugene Lyon will act as drum<br />\nThe nearest Liberal clubs of any<br />\nmajor.<br />\nsignificance to the Johns Hopkins<br />\n<br />\nORATORICAL CONTESTS<br />\nTO BE HELD AGAIN<br />\n<br />\nVO1<br />\n<br />\nDr. Wheeler Deplores Lack of<br />\nInterest In Events<br />\n<br />\nRU<br />\n<br />\nDeclaring there is a decided lack<br />\nof interest in the various public<br />\nspeaking contests sponsored at the<br />\nJohns Hopkins University, Dr. Paul<br />\nM. Wheeler, of the Department of<br />\nEnglish, yesterday stated the oratorical events will again be held this<br />\nyear, the dates of which have not<br />\nbeen definitely settled.<br />\nDates for the Tocqueville Medal,<br />\nthe Adams Medal and the Thom<br />\nCup contests; and for the SeniorJunior, Freshman-Sophomore debates will be announced subsequent<br />\nto a conference between Dr.<br />\nWheeler and Francis Warlow,<br />\npresident of the Student Council.<br />\nEach speaking event, with the exception of the Thom Cup contention, which is held at night, will be<br />\nstaged at a weekly assembly of the<br />\nstudent body.<br />\n\"There is a decided non-interest<br />\namong the students in the public<br />\nspeaking events held on the campus<br />\nof the University,\" declared Dr.<br />\nWheeler. \"Frankly, there is no good<br />\nreason at all for this absence of enthusiasm toward oratorical contests.<br />\nThis year, when entrants are called<br />\nfor there should be a greater response than last.\"<br />\nDr. Wheeler stated he would<br />\ngladly discuss the contests with any<br />\none who is interested in them. His<br />\noffice is in Remsen Hall, 310.<br />\nDelegated Debates Dropped<br />\n<br />\nThe Johns Hopkins University<br />\nwill not meet other institutions in<br />\nCharles Weller, Jr., secretary- are to be found in Washington, D.<br />\ndebating, it was announced. Offitreasurer, requests that those stu- C., at the George Washington Uni- cials of the University have stamped<br />\ndents who play band instruments versity and at St. John's College in their opposition upon delegated debating this year. Authorization for<br />\nAnnapolis, Maryland.<br />\nget in touch with him at once.<br />\ninter-college debates was dropped<br />\nhere because of no interest in the<br />\nmeets. Consequently, the Debating<br />\nCouncil was absolved.<br />\nThe Tocqueville Medal, won by<br />\nLeo Alpert, March 1929, in his first<br />\nyear here, has been offered annually<br />\nto the student who delivers the best<br />\nspeech on some phase of a general<br />\n<br />\nTOURNAMENT<br />\nVALUABLE CASH PRIZES<br />\nQualify on or Before October 18th<br />\n<br />\nST. PAUL STREET, Between 24th and 25th Streets<br />\n<br />\n,<br />\n40<br />\n<br />\nOnly<br />\n<br />\nDesk<br />\n<br />\nEdit<br />\n<br />\nNem<br />\n<br />\nHun<br />\nedit(<br />\n<br />\n17, i<br />\n<br />\nstaff<br />\n<br />\nsu<br />\noffet<br />\nA<br />\nhea.<br />\ntor,<br />\npart<br />\ndida<br />\n<br />\nDrink<br />\n<br />\nDelicious and Refreshing<br />\n<br />\n...for the<br />\n<br />\nPause<br />\n<br />\nSeni<br />\nman<br />\nsecti<br />\n<br />\nthat refreshes<br />\n<br />\nin4<br />\n<br />\n.phol<br />\ntean<br />\ngam<br />\n<br />\nWhen you suffer from large and undiluted<br />\ndoses of your fellows. When the milk of<br />\nhuman kindness seems to sour. Blow the<br />\nwhistle for a minute's \"time out\" on your<br />\nown account, to pause and refresh yourself.<br />\n<br />\ntake<br />\nphoi<br />\npicti<br />\ntinic<br />\n<br />\nIn other words, go into a huddle with a<br />\nglass or bottle of refreshing, delicious<br />\nCoca-Cola. It will make you captain of<br />\nyour soul again, ready to live—or die—<br />\nfor the dear old alma mater.<br />\n<br />\nFamous<br />\nGrantland Rice<br />\nSports Champions-^s-- Coca-Cola<br />\nOrchestra..--s..Every Wednesday<br />\n10:30to 11 pm.Eastern Daylight<br />\nSavinEtaTimeCoast to<br />\nCoast NBC Network.<br />\n<br />\nThe Coca-Cola Company, Atlanta, Ga.<br />\n<br />\new-7<br />\n9 MILLION A DAY<br />\n<br />\nIT<br />\n<br />\nHAD<br />\n<br />\nTO<br />\n<br />\nBE<br />\n<br />\nGOOD<br />\n<br />\nTO<br />\n<br />\nGET<br />\n<br />\nWHERE<br />\n<br />\nIT<br />\n<br />\nIS<br />\n<br />\n_pelt<br />\n<br />\nWill<br />\n<br />\nness,<br />\n<br />\nSTEPPING<br />\n<br />\nINTO<br />\n<br />\nA<br />\n<br />\nMODERN<br />\n<br />\nWORILI)<br />\n<br />\n(Cont. on page 2, col. 3)<br />\n<br />\nOffers This Combination<br />\n<br />\nPho<br />\ncan<br />\n<br />\n0<br />\n4.<br />\n<br />\nthe<br />\nSer<br />\nclu(<br />\n<br />\nPEN GUARANTEED FOR LIFE<br />\n<br />\nSAVES PRICE OF A SECOND PEN<br />\n<br />\nin t<br />\nage]<br />\nrner<br />\ndatc<br />\n<br />\nthe<br />\nof t<br />\nit-1g<br />\nof<br />\ning<br />\ning<br />\n<br />\nNott,<br />\n<br />\nParker Duofold<br />\n<br />\nphoi<br />\ndida<br />\n'nee<br />\nwor<br />\nfor<br />\nuse<br />\n<br />\nthei<br />\n<br />\ntopic chosen from the field of<br />\nFrench history, politics or literature<br />\nin the Nineteenth Century. The<br />\n<br />\nST. PAUL OBSTACLE GOLF COURSE<br />\n<br />\nvoevet and<br />\n<br />\nBlow<br />\nthe Whistle<br />\n<br />\nOn,<br />\nSer<br />\nphc<br />\n<br />\nthe<br />\nof<br />\n<br />\nthe<br />\nhis<br />\ncla!<br />\nthe<br />\ndre<br />\nthe<br />\nthe<br />\nSame Pen Converted<br />\nEven at higher prices, other makers<br />\nhave been unable to match this classic.<br />\nNow that it takes the place of a special<br />\npen for the pocket and another for the<br />\ndesk, its sales are soaring beyond all<br />\nprevious heights.<br />\nGo and ask the nearest dealer to show<br />\nhow the Duofold is changed back and<br />\nforth from a Pocket to a Desk Set Pen.<br />\nIf you own a Parker, take it with you.<br />\nIf not, go anyway and see this revolutionary invention.<br />\n<br />\nAs a Pocket Pen<br />\nGetting the Parker Duofold is now<br />\nlike getting two Pens at the price of one.<br />\nAttaching a tapered end converts it into<br />\na Desk Set Pen. Removing the taper<br />\nrestores it to a pocket Pen.<br />\nEither way, you save the price of a<br />\nsecond pen. You have only one Pen to<br />\nfill instead of two. And whether you<br />\nwrite at your desk or on the go, you<br />\nalways have your favorite point.<br />\nYou have a non-breakable Permanite<br />\nbarrel that holds 17.4% more ink than<br />\naverage, size for size—that is jewel-like<br />\nin lustre, color, and beauty. And most<br />\nof all—the famous Duofold *bonus<br />\npoint that writes with Geo. S. Parker's<br />\n47th improvement—Pressureless Touch.<br />\n<br />\nTHE PARKER PEN COMPANY,Janesville, Wis. Offices and subsidiaries: New York,<br />\nChicago, Atlanta, Buffalo, San Francisco, Dallas,<br />\nToronto,Canada;London,Eng.; Berlin, Germany.<br />\n<br />\nScientist and Salesman<br />\nTHE MODERN PARTNERSHIP<br />\nLike every other modern industry, the Bell<br />\nSystem requires the combined effort of scientist and salesman. The commercial man has<br />\nagain and again shown the public how to use<br />\nnew products of the telephone laboratory,<br />\nand how to make new uses of existing<br />\napparatus.<br />\nTransmitting pictures and typewritten mes-<br />\n<br />\nsages over telephone wires are services right<br />\nnow being actively promoted. Scientific selling<br />\nby long distance is among many ideas originated to increase the telephone's usefulness.<br />\nIn short telephony is a business, with problems that stimulate commercially minded men<br />\nand a breadth of opportunity in step with the<br />\nfast moving world of industry today.<br />\n<br />\n* Point-smiths Paid a Bonus<br />\n• 34ds;q1<br />\n<br />\n(Par er<br />\nDuq/b/d<br />\n<br />\nEleven merciless inspections are<br />\ngiven each Parker Duofold point.<br />\nThen we pay a bonus to our pointsmith who made it. Points are rejected if they fail even one inspection, and the point-smith pays us<br />\na forfeit. Yet,7out of8 points earn<br />\na bonus,because we limit each man<br />\nto a given number a day.<br />\n<br />\nBELL SYSTEM<br />\n<br />\niS s7 $10<br />\n<br />\nA NATION-WIDE SYSTEM OF MORE THAN 20,000,000 INTER-CONNECTING TELEPHONES<br />\n<br />\nPEN GUARANTEED FOR LIFE<br />\n<br />\nof<br />\nof<br />\n<br />\nout<br />\nthi;<br />\n<br />\nbri<br />\n<br />\ndir<br />\nthi<br />\nPa:<br />\n<br />\nser<br />\nCat<br />\nbe<br />\nart<br />\nstt<br />\nwi<br />\nstri<br />\n<br />\n\f", "format": "basic_html", "processed": "l. XXXV, No. 3<br /><br />\n\"POPS\" SWINDELL<br />\nTALKS AT ASSEMBLY<br />\nFormer Barnstormer Coach<br />\nUrges Students to go Out<br />\nFor Activities<br /><br />\nSENIORS ELECT<br />\nCLASS OFFICERS<br />\nAt a meeting of the Senior<br />\nclass held in the C. E. Hall<br />\nyesterday the following men<br />\nwere elected to office:<br /><br />\nENTHUSIASM DISPLAYED<br /><br />\nPresident—Heinzerling.<br /><br />\nEveryone Gets a Fair Chance<br />\nWith the 'Stormers<br /><br />\nVice-president—Parks:<br />\nSecretary—Rutherford.<br /><br />\n\"PRIVATE, NO ADMIT7ANCE\" SIGN<br />\nNO BAN TO UNOBSERVANT REPORTER<br />\nFor the past few days users of having stamped them, is piling these<br />\nthe telephones in the Johns Hopkins little blue books in two great big<br />\nJanuary<br />\nbuildings and those suffering indi- packing cases to await next<br />\nwhen mid-year's come.<br />\nviduals who have been trying to get<br />\nThose huddled, the two, by the<br />\nconnections with some Hopkins ever-buzzing switchboard are merely<br />\nlines have been treated to service passing the time by putting little<br />\nde luxe. Not less than four charm- pencil marks here and there on<br />\ning young ladies have been engaged sheets of white paper supported by<br />\nin operating the lone and forlorn tally-boards. Idle sport for such<br />\nseemingly hard-working girls. And<br />\nswitchboard in the basement of Gillast we have the fourth party to the<br />\nman Hall. On second thought, scene. It is she who controls the<br />\nthough, that switchboard is not so dial, the little red lights, the little<br />\nlone and forlorn, and many an yellow lights and the machine-gun<br />\nupperclassman would gladly change sounding 'buzzer—our new phone<br />\nplaces with it and relish the pre- operator.<br />\nBut still we do not know their<br />\ndicament of being all alone with<br />\nfour operators in a room behind a prime raison d'être. The lone switchclosed door with a sign reading: board is not so hardy as some of<br />\nour upperclassmen and needs com\"Private, No Admittance.\"<br />\nIt is now our duty to explain the pany in its misery, therefore the C.<br />\npresence of such an abundance of and P. Telephone Co. has sent its<br />\nfemale talent in this very private two tally-board carriers up to inroom. Quite obviously they are vestigate the traffic and decide the<br />\nthere for a reason, but the explana- fate of the old board and the new<br />\ntion of that reason must wait until operator.<br />\nwe investigate who are the DraOf course, if the new board is inmatis Persona.<br />\nstalled, the new operator will have<br />\nThe former operator, the first we company and will have more time<br />\nsee as we enter the room, for the to gossip and give poorer service,<br />\n\"Private, No Admittance\" does not and maybe the young lady who is<br />\nsay positively, is seated behind a abdicating because of the excessive<br />\ndesk in the center of the floor. Two labor may be urged to stay. It is she<br />\nstrangers are seated, not seated but who was the subject of an article<br />\nhuddled, around the switchboard at in the NEWS LETTER several issues<br />\nthe right, and a fairly new face is ago. And may it be said here that<br />\nat the board swinging the cords, she took exception to this article,<br />\nplugging in the calls and discon- saying that she pays for and wears<br />\nnecting imporynt messages.<br />\nsilk hose, and is grossly insulted<br />\nNow as to their raison d'être. that the former reporter was so unLackadaisically, the first met sub- observant as not to notice the differject is stamping little blue books ence when he interviewed her bewith a great big rubber stamp, and fore.<br /><br />\nTreasurer—Kyle.<br />\nYesterday, at the regular weekly<br />\nassembly, \"Pops\" Swindell addresSergeant-at-arms — Tie besed the students on the subject of<br />\ntween Towbin and Halsey.<br />\nthe Barnstormers.<br />\nThe assembly was opened as<br />\nusual by singing the University<br />\nOde. Francis Warlow, President<br />\nof the Student Council, introduced<br />\n\"Pops\" Swindell. He mentioned<br />\nAffiliation With L. I. D. Asthat \"Pops\" Swindell had retired<br />\nsures Prosperous Season<br />\nfrom his position of Coach of the<br />\n\"ENVIABLE .CONFERENCE\"<br />\nBarnstormer's Club, last year. This<br />\nretirement was contrary to his own Many Well - Known Speakers<br />\nTo Address Organization<br />\nwishes and those of the student<br />\nbody.<br />\nA recent bulletin of the League<br />\nActivities<br />\nfor Industrial Democracy declares:<br />\n\"Pops\" opened by saying that this \"The Johns Hopkins Liberal Club<br />\nopportunity was one of the pleas- promotes an enviable conference<br />\nures he looked forward to each year. for colleges of the Potomac region.\"<br />\n\"As I look around this large group<br />\nIn 1928-1929 Johns Hopkins<br />\nof fine-looking young men,\" he said,<br />\nUniversity probably had the strongalways feel that I must for a mo- est Liberal Club of any college in<br />\nment be a little serious.\" Mr. Swin- the country.<br />\ndell believes the extra curricular<br />\nLast year Swarthmore possessed<br />\nactivities in college are of great im- the<br />\nstrongest collegiate Liberal orportance in preparing a young man<br />\nwith Johns Hopkins<br />\nganization,<br />\nfor the work of life. The activities<br />\nprobably second.<br />\nbring something to the student that<br />\nActivities Four-Fold<br />\nstudying will never bring. Each<br />\nAt present the activities of the<br />\nPart of the activities is helpful in Liberal Club are four-fold in their<br />\nlife itself; the acting of any kind,<br />\nnature.<br />\nbusiness work, artistic work, all of<br />\nEach Friday there is a noon<br />\nthem are important.<br />\nluncheon meeting for the club memThe Barnstormers' Club differs bers and their friends, at which adfrom the activities in that it pro- dresses are made by the club memvides something of all of these. bers themselves or by some outside<br />\nMusical Club Holds<br />\nA confidence and \"stage presence\"<br />\nspeaker.<br />\nFirst Official Rehearsal<br />\ncomes from the ability to act. As<br />\nLast night the first official reApproximately once a month a<br />\nproof of the value of this \"Pops\"<br />\nmeeting is held to which the general hearsal of the Musical Club was<br />\nrelated a little story in the manner<br />\npublic is invited. On such occa- held in Levering Hall. According<br />\nWhich only he could assume.<br />\nsions an attempt is made to bring to the president of the organization,<br />\nGorilla Demonstration<br />\nat\"One day a young acrobat went the leaders of American Liberalism Bruce Peake, the new men who<br />\npromise.<br />\nconsiderable<br />\nshowed<br />\ntended<br />\nto a circus to get a job. He was to Baltimore. Men of such ability<br />\ntold that there was no opening; but as Norman Thomas, Scott Nearing, Peake announced that the schedule<br />\nUpon his pleading with the manager, Louis Waldman, Oswald Garrison was still tentative, but that arrangehe was told that the gorilla had died Villard and Roger W. Baldwin are ments are being made for a most<br />\nattractive season, interspersed with<br />\nand if he liked he could -put on the invited to speak.<br />\nseveral trips.<br />\nInterested in Local Conditions<br />\nSkin and act the part. The young<br />\nAny men who were unable to atAs<br />\na<br />\nfor<br />\nchapter<br />\nLeague<br />\nof<br />\nthe<br />\nman practiced a little and went to<br />\nlast night are invited to come<br />\ntend<br />\nIndustrial<br />\nDemocracy,<br />\nclub<br />\nis<br />\nthe<br />\nwork the next morning. He was<br />\nthe<br />\nnext rehearsal, next Thursto<br />\ninterested<br />\ntheoboth<br />\npractically<br />\nand<br />\ngetting along fine and climbing all<br />\nevening<br />\nday<br />\nat 7:30, when addiretically<br />\nin<br />\nthe<br />\nsocial<br />\neconomic<br />\nand<br />\nabout, swinging on ropes, when a<br />\ntional<br />\ntryouts<br />\nwill be held. Immeconditions<br />\nof<br />\nBaltimore.<br />\nrope suddenly snapped and he fell<br />\nrehearsal, meetings<br />\nthe<br />\ndiately<br />\nafter<br />\ni▪ nto the lion's cage. (Here \"Pops\"<br />\nThe League for Industrial Demand Hawaiian<br />\nClub<br />\nthe<br />\nBanjo<br />\nof<br />\ndid a wonderful job of imitating ocracy (or L. I. D., as it is generbe held. The<br />\nTroupe<br />\nwill<br />\ngroups<br />\nboth the lion and gorilla.) Fright- ally known) is a membership society<br />\npractices on<br />\nOrchestra<br />\nBlue<br />\nJay<br />\nened nearly to death by the lion's composed principally of college<br />\naccording<br />\nand,<br />\nafternoons<br />\nThursday<br />\nfiy-ce growls the acrobat cried for graduates and college students.<br />\nseveral<br />\nleader,<br />\nthe<br />\nBert<br />\nClark,<br />\nto<br />\nhelp, forgetting his job. Then the Among the officers are Robert<br />\npositions<br />\navailable.<br />\nare<br />\nlion came closer and between growls Morss Lovett, professor of English<br />\nGreat stress will be placed on atsaid, 'Shut up, you damn fool !'\" Literature at the University of Chicago and an editor of the New Re- tendance this year. If the attendWell Received<br />\nThe story was greeted with roars public; John Dewey, the philoso- ance of any of the members is lax,<br />\nof 1.aughter<br />\nalong on any<br />\nwhich the acting fully pher; Alexander Meiklejohn, direc- they will not be taken<br />\nmerrted. He then mentioned the tor of the Experimental College, of the trips.<br />\nobligations of the college boy to his University of Wisconsin; Vladimir<br />\nparents to get something out of Karapetoff, professor of electrical<br />\nBlack and Blue Jay<br />\ncollege; to<br />\nimprove his mind, and engineering, Cornell University, and<br />\nTo Appear Today<br />\nto prepare<br />\nthe way for the future. inventor; Florence Kelley, national<br />\nT h e long-heralded Freshman<br />\nstudent should not enter activi- secretary of the Consumers'League, number of the Black and Blue Jay<br />\nvities if they will interfere with and Stuart Chase, author and<br />\nwill make its first appearance tohis studies, which<br />\nare really most economist.<br />\nIt will contain all of the old<br />\nday.<br />\ni▪ mportant.<br />\nNorman Thomas Included<br />\nAlthough there was<br />\nfeatures<br />\nin addition to a new cover<br />\na big crowd<br />\nThe executive staff includes Nor- design by Harold Blum.<br />\nat the rally, since<br />\nthen at the rehearsals the number man Thomas, Dr. Harry W. LaidAlthough the Jay may appear to<br />\nof candidates<br />\nhas dwindled. The ler, Karl Borders, Mary Fox and be late, it is in reality two weeks<br />\nbasis on which the Barnstormer's Paul Porter, field secretary. Paul<br />\nahead of last year's initial appearClub is built is that no favoritism Blanshard, one of the most popular<br />\nance.<br />\nis shown.<br />\nEverybody gets a fair college speakers in America, occachance and the best man gets the sionally acts in the capacity of<br />\nDate Book On File<br />\nj▪ ob. \"Pops\"<br />\nasked the handsome special lecturer.<br />\nIn Registrar's Office<br />\nmen to come out for the<br />\nThe outstanding activity of the<br />\nhero's<br />\nDate<br />\nBook for the purpose of<br />\nA<br />\nroles, the funny looking for those club is<br />\nthe annual Liberal Confer- recording coming events is kept on<br />\nof the villains and<br />\nthose with a ence each Spring, which is attended file at the Registrar's office in Remhumorous trend for the comedians by students from New England to<br />\nsen Hall. Thus far the only groups<br />\nParts.<br />\nNorth Carolina.<br />\nthat have made use of the book<br />\nFrancis Warlow then made a<br />\nAt last year's Conference the are the Football Team and the<br />\nfew announcements and<br />\nturned the socialization of power was dis- Cotillion Board. Therefore,a repreassembly over to Cliff Gilbert, cussed.<br />\nOne of the speakers at that sentative of each University activity<br />\ncheer leader. There followed one time<br />\nhad been called before the is requested to place on file a list of<br />\nof the best cheering<br />\npractices this Congressional committee investi- his organization's appointments as<br />\nyear.<br />\nWont. on page 4, col. 2)<br />\nsoon as possible.<br /><br />\nJ. H. U. LIBERAL CLUB<br />\nHIGHLY PRAISED<br /><br />\na<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br /><br />\nDUKEHART ELECTED<br />\nJUNIOR PRESIDENT<br />\nAt a meeting of the Junior<br />\nclass, held in the C. E. Hall,<br />\nWednesday, Ned Dukehart<br />\nwas elected to succeed himself<br />\nas president of the Junior<br />\nclass. Dukehart presided over<br />\nthe Sophomore class last year.<br />\nThe other officers elected by<br />\nthe Juniors for the coming<br />\nyear are as follows:<br />\nMettee, secretary.<br />\nBialoskorski, treasurer.<br />\nPerry and Becksinski tied<br />\nfor office of sergeant-at-arms.<br />\nThere will be a short meeting of the class of '32 to vote<br />\noff the tie for sergeant-atarms.<br /><br />\nHOPKINS TO MEET<br />\nRUTGERS TOMORROW<br />\nJerseyites Defeated George<br />\nWashington and Lost to<br />\nSyracuse<br />\nJAYS' FIRST TRIP<br />\nBobby Lyons Might be Able to<br />\nPlay<br /><br />\nJohns Hopkins travels to New<br />\nBrunswick, N. J., tomorrow for<br />\ntheir second strenuous test in as<br />\nmany weeks when they lock horns<br />\nwith Rutgers College. The Jays<br />\nwill be forced to display as much if<br />\nnot more than they did last week<br />\nagainst Lehigh.<br />\nCoach Van Orman's men surprised quite a few of their own<br />\nloyal followers not to mention the<br />\nmajority of sports writers and critics in the city by their fine work<br />\nagainst the heavier and more exTopic Chosen is \"Religion and perienced Pennsylvania eleven last<br />\nSaturday. Picked by the local exLife Today\"<br />\nperts to win by three or four touchdowns the Lehigh team was lucky<br />\nMEETING WELL ATTENDED<br />\nto return home without a tie, and<br />\npossibly a defeat, registered against<br />\nSpeaker Suggests Ways of Rethem. Whatever advantage the Jays<br />\nligious Success<br />\nconceded their opponents in weight,<br />\nexperience, etc. they more than<br />\nChoosing for his topic \"Religion made up for in fight and pep.<br />\nThey<br />\nand its Relation to the Life of To- were outscored but not outfought.<br />\nday\", William E. Kroll told the If the same fight remains with the<br />\nmembers of the University Supper Ropkins team this week, and there<br />\nClub how religion could best be is no reason why it shouldn't, the<br />\npracticed in this day and age.<br />\nresult at New Brunswick tomorrow<br />\nAfter a few announcements by E. should be most favorable as far as<br />\nA. Schaal, the speaker of the eve- the Black and Blue is concerned.<br />\nning was introduced by Linck,<br />\nLehigh Uneasy<br />\nchairman of the Supper Club. Mr.<br />\nThere is no reason why the Jays<br />\nKroll began by stating that our re- should feel particularly bad about<br />\nligion is now at a crisis, that it has last week's game. True, there were<br />\nGrads Inaugurate First<br />\nbeen broken down; this has been some rough spots that need to be<br />\nOf Weekly Assemblies blamed on the recent war, but the ironed out, but the fact that they<br />\nInaugurating its initial event of causes are more underlying, and came from behind to<br />\ntie the score<br />\nthe college term, the graduate stu- were only brought to a focus by the twice and then lost only<br />\nthrough a<br />\ndent body of the Johns Hopkins war. The result is that we are per- pass<br />\nused as a last resort, speaks<br />\nUniversity will hold a reception to- plexed as to what we can really highly for<br />\ntheir fighting spirit and<br />\nmorrow, 8:30 P. M., Levering Hall, have in the way of religious belief. makes<br />\nthe future seem much brightto which all faculty members and<br />\ner. In the last quarter and indeed,<br />\nHelpful Pointers<br />\ngraduate students are invited. The<br />\nTo help us answer this, Mr. Kroll from the opening minutes, they<br />\naffair will be featured by an address<br />\ncontinued he would give us three caused the Lehigh team and everyto be delivered by Dr. Joseph S.<br />\npoints which he thought would be one connected with it quite a few<br />\nAmes, president of the Johns Hopof help. The first of these was that uneasy moments.<br />\nkins, and by dancing and card<br />\nthe church should again become an<br />\nLost to Syracuse<br />\ngames.<br />\nimportant center of everyday life as<br />\nLittle<br />\nis known of the real<br />\nIt is planned to stage a religious<br />\nit has been in times past. It lost strength of tomorrow's opponents.<br />\ndiscussion luncheon group each<br />\nthis pre-eminence because when cer- The New Jerseyites scored a 20-to-6<br />\nTuesday, 12:30 to 1:30 P. M., for<br />\ntain ideals were reached, people be- victory over George Washington<br />\ngraduate students who care to atcame firmly intrenched in them, and two weeks ago and then lost last<br />\ntend. George Seidel, graduate stuwould not step out to expand. Now Saturday to Syracuse, 27-0. This<br />\ndent in the Chemistry Department,<br />\nwe must leave these and strike out would indicate a fairly strong team<br />\nis in charge of the committee on<br />\nfor new ones, but retain the old ones as Rutgers teams go and it is safe<br />\narrangements.<br />\nuntil the new are firmly established. to say that they will be taking no<br />\nDr. F. R. Bayley is the discussion<br />\nThus will the church gain its right- chances with the Black and Blue<br />\ngroup leader, according to Mr. E.<br />\nful place.<br />\neleven when they line up.<br />\nA. Schaal, executive secretary of<br />\nChristianity Tolerant<br />\nAs for the Jays, they, too, realize<br />\nthe Y. M. C. A. Hopkins cabinet.<br />\nSecondly, he said, Christianity is the task which confronts them. RutSubsequent to Saturday's reception the graduate students will becoming more tolerant and less gers will probably be stronger than<br />\ndefinitely organize their social pro- dogmatic in its beliefs, and should Lehigh but this does not necessarily<br />\ncontinue to do so. But still Christ spell doom for the locals. It is safe<br />\ngram for the season.<br />\nis to be regarded as the center of to prophesize that they will be in<br />\nthe game, fighting every minute of<br />\nActivities Council Mak s belief and the first authority.<br />\nAppropriation To Band Third, finally and most important, the time.<br />\nThere will probably be one or<br />\nFor the first time this semester, in the speaker's point of view, is the<br />\nthe Student Activities Council met necessity of living the principles of two changes in the Hopkins' linein Levering Hall last Tuesday at religion in everyday life. To be a up tomorrow. Bill Weitzel, who<br />\nreal Christian nowadays means to has becii performing well at right<br />\n1 :30 P. M.<br />\nThe main discussion involved the believe in practicing Christian prin- end, will be out because of a<br />\never serious matter of appropria- ciples. To use the words of Christ wrenched ankle which he secured<br />\ntions. After careful consideration, \"He that willeth to do shall know.\" in last week's setto. In all probaMr. Kroll is the minister of the bility Yearly, who went in when<br />\nit was decided to increase the apArlington<br />\nAvenue Presbyterian Weitzel was Eurt, will start at that<br />\npropriations for the band by drawChurch<br />\nof<br />\nEast<br />\nOrange, N. J. He position. Yearly is a freshman but<br />\ning the sum of twenty-five cents<br />\nis<br />\nespecially<br />\ninterested<br />\nwith student has shown up well in both games<br />\nfrom the activities card of each<br />\nwork<br />\nand<br />\nis<br />\nintimately<br />\nconnected and promises to develop into a stelstudent. The purpose of this inlar wing before he leaves college.<br />\ncrease is to aid the band to acquire with student Y. M. C. A. work.<br />\nMeeting Well Attended<br />\na professional leader.<br />\nLyons Might Play<br />\nCharles Weller, representing the<br />\nThe meeting, which was the first<br />\nAnother change may be made in<br />\nband, was present at the meeting. of the season, was well attended, the backfield as Bobby Lyons' knee<br />\nHe stated that in order to increase and it is believed was thoroughly seems to be mending nicely. Lyons<br />\nappropriations for the band it would enjoyed by those present. Enter- was not in uniform last week but<br />\nbe necessary to cut appropriations tainment was furnished by the Delta may break into the game tomorrow.<br />\nfor other organizations of the Uni- Upsilon Orchestra in the form of Bernard and Towbin will in all<br />\nversity.<br />\npopular music and college songs. probability be sent in to bolster up<br />\nThe Student Activities Council The audience was led in singing the the line, although the former is sufplans to gather to discuss and decide songs by Cheer Leader Gilbert and fering from a wrenched shoulder<br />\nupon matters of the various activi- managed to make quite a noise at which may render him useless this<br />\nties represented on the campus.<br />\ntimes.<br />\nweek.<br /><br />\nSUPPER CLUB HEARS<br />\nWILLIAM E. KROLL<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br /><br />\n2<br /><br />\nInn<br /><br />\nCONTESTS<br />\nSHOPKINS WSILETTER ORATORICAL<br />\nTO BE HELD AGAIN<br />\nDr. Wheeler Deplores Lack of<br />\nInterest In Events<br /><br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore,<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br /><br />\nBelmont 8778<br /><br />\nTelephone<br /><br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nSYLVAN LEBOW, '32<br />\nROWLAND McD. NESS, '32<br /><br />\nJunior Editors<br />\nNATHAN M. HARRIS, '32<br />\nHAROLD B. YUDKIN,'32<br />\nMELVIN GUDE, '33<br />\nHERBERT FRIEDBERG, '33<br />\nMARION GROVE, '33<br /><br />\nRAYMOND DUNN,'33<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nDAVID DOLOWITZ, '33<br />\nJACK GREENFIELD, '33<br /><br />\n(Cont. from page<br /><br />\n4, col. 3)<br /><br />\nmedal is presented in honor of<br />\nAlexis de Tocqueville, author.<br />\nThe winner of the Adams Declamation contest, held yearly during<br />\neither April or May, is awarded a<br />\ngold medal. This competition is<br />\nopen to only Sophomores. J. K.<br />\nMount, Jr., won the 1929 award.<br />\nSenior-Junior Debate<br />\nSeniors and Juniors have the opportunity each year to try out for<br />\nthe respective class debate teams,<br />\ncomposed of three men each, which<br />\nmeet annually in what is termed the<br />\nHerbert B. Adams Debate. The<br />\nvictorious trio of debaters are permitted to purchase a total of fifty<br />\ndollars' worth of books. Last year,<br />\nJanuary 16, 1930, the Juniors triumphed over the fourth year men.<br />\nWhen the Freshmen and Sophomores meet to debate, to the victor<br />\ngoes glory alone. No award is<br />\nmade in the lower class debate. December 11, 1929, the first year men<br />\n—Alpert, Dunn and Milestone—defeated the Sophomore speakers.<br />\nThom Cup Presented<br /><br />\nMrs. Thom, distinguished society<br />\nwoman, distant relative of Johns<br />\nHopkins and author of a biography<br />\nupon the late founder, yearly<br />\nBUSINESS DEPARTMENT<br />\nawards the Thom Cup to the winner<br />\nBusiness Manager<br />\nof an extemporaneous speaking conGus BURK, '31<br />\ntest. Stuart L. Smith captured the<br />\ntrophy last season.<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nDAVID SYKES, '32<br />\nGEORGE W. LA MONT,'32<br />\nPreliminaries are held in order to<br />\nselect<br />\nthe finalists. From each<br />\nOffice Manager<br />\npublic speaking course section two<br />\nISADOR GUTMAN, '33<br />\nare chosen. This year there will be<br />\nCHARLES NEY, '33<br />\nWILBUR BLOOM,'33<br />\nten contestants in the final appearSIMON LITT, '33<br />\nMORTON ROME,'33<br />\nance.<br />\nIn explaining the conditions of<br />\nProduced by the R. L Polk Printing Company, 1930 Clifton Ave., Baltimore, Md. the contest, Dr. Wheeler pointed<br />\nout the speeches are to be based<br />\nupon one general topic, announced<br />\nto the contestants thirty-six hours<br />\nprior to the date set. Ten minutes<br />\nbefore each speaker is scheduled to<br />\nappear before the audience he is<br />\ngiven his particular topic based<br />\nupon the general subject.<br />\nDr. Wheeler states he intends to<br />\nTHE ROLLINS PLAN<br />\nabolish the ten minute provision and<br />\nto present the topic to the speaker<br />\nTATING on October first with an article by Professor Howard<br />\nof Northwestern University, on \"Who Ought to Go to College,\"<br />\nas he enters the entrance to the<br />\nThe Nation is publishing a series of articles on educational experistage.<br />\nments which should be of interest to Hopkins students. After discussing at length the various methods by which a college may select<br />\nthe most likely prospects, Dr. Howard shows the hopelessness of the<br />\nsituation by the following two statements, \"Actually, any high school<br />\ngraduate can enter college, for if one college will not take him, he<br />\ncan go to another\" and \"—I am disposed to believe that anybody ought<br />\nto go to college who really wants to.\" In other words, it is impossible to keep any high school graduate out of college and for this reason Dr. Howard advises that everyone who wants to should go to<br />\ncollege.<br />\nThe foremost defect in this system is stated in the second of the<br />\nseries of articles, \"The Rollins Idea,\" by Hamilton Holt. Dr. Holt<br />\nsays, \"For in the effort to build up the most elaborate machinery in<br />\nthe world for turning out academic degrees it seemed to me that we<br />\nhad somewhere lost the essence of true education, and that to find it<br />\nagain we must revert to simpler methods, fewer rules, less emphasis<br />\nupon information and more upon thinking.\"<br />\nAt Rollins for the last four years experiments have been made to<br />\neliminate these defects. The Rollins two-hour conference plan has<br />\nobvious advantages. Some of the more important changes are the<br />\nabolishment of lectures and recitations, the minimization of term and<br />\nyearly examinations, freedom of outside time, and the attempts to<br />\nreplace textbooks with life that is to say to give nothing second-hand<br />\nthat may be acquired first-hand by the student.<br />\nA teacher presides over each conference but he does not lecture,<br />\nnor does he hear recitations. His primary function is to keep quiet, and<br />\nto guide and stimulate work. The students study and discuss problems<br />\namong themselves. The situation seems ideal for the student who is<br />\nreally anxious to learn. Furthermore one student who advances more<br />\nrapidly than his fellows is not held in check by a slow class. With<br />\nthe aid of the teacher, he may in the course of a year, cover much<br />\nmore ground than his classmates. This system, of course, could not<br />\nbe immediately adopted by American colleges. Some students would<br />\nnot progress with this lack of rule and regulation. This type of student, however, is the type that needs to be eliminated. The primary<br />\nreason why the Rollins Plan could not be adopted is that a sufficient<br />\nnumber of teachers could not be found. One able teacher is needed<br />\nCollege men who know what to<br />\nfor every ten students at Rollins.<br />\nwear and how to wear it choose<br />\nAlligator \"50\"— the new College<br />\nThe plan seems to be a decided success at Rollins, but more experiCoat... Alligator \"50\"is a smart<br />\nmentation is necessary before the system can be termed ideal. The<br />\ndouble-breasted raglan —long—fullstudents at Rollins as well as the faculty were hand-picked, and never<br />\ncut—roomy—full-belted, with big<br />\ndoubted that the plan would be successful.<br />\npatch pockets, and a convertible<br />\nAt Hopkins, attempts to get away from rules and, regulations are<br />\ncollar that gives extra protection<br />\naround the neck ... Light in<br />\nbeing made. The student is informed as a freshman that he must be<br />\nweight —semi-transparent—absointellectually independent. He is not being forced to work, but is<br />\nlutely weather-proof. Four rich,<br />\nassisted if he wishes. The cutting of classes is not a serious misoriginal colors —Deep Sea, Tan,<br />\ndemeanor as in some colleges. The roll is not constantly checked.<br />\nBlue,Black —and only $7.50!...<br />\nExaminations eliminate those who take advantage of newly gained<br />\nOther Alligator models from<br />\nliberties, as they would term them. Others however lose the high$5.00 to $25.00.<br />\nschool attitude that the teacher is your enemy, and that anything you<br />\nTHE ALLIGATOR CO.<br />\ncan put over on him is a coup for yourself. They realize instead the<br />\nSt. Louis, Mo.<br />\nteacher will help the man who wants to learn, but will certainly not<br />\ncompel the man who does not care to learn to study.<br /><br />\nHULLABALOO STAFF,<br />\nCANDIDATES TO MEET<br />\nCandidates and members of<br />\nthe editorial, art and photographic departments of the<br />\nHullabaloo staff will meet with<br />\nTownsend Parks, editor-inchief, in the Hullabaloo office<br />\ntoday at 12:30 P. M. At this meeting Parks will<br />\norganize the staff and explain<br />\nthe year's work. Candidates<br />\nare wanted from all classes<br />\nfor all the departments.<br />\nParks announced that the<br />\nwork in view will be discussed, but the actual theme<br />\nof the book will not be divulgel until later in the year.<br /><br />\nHochschild, Kohn &amp; Co.<br /><br />\nCotillion Board To<br />\nHold Dance Saturday<br /><br />\nTwo short months ago we'd have priced these<br /><br />\n$29\"<br />\n.<br />\nis doing the job<br />\nof $35<br />\nat<br /><br />\nThere will be a Cotillion Board<br />\ndance on October 18, in the Civil<br />\nEngineering Hall. Music will be<br />\nfurnished by Bob Iula's band. Sub-<br /><br />\ntwo-trouser suits at $35---and they'd have<br /><br />\nscription, either stag or couple, is<br />\none dollar.<br />\nAt a meeting of the board Thursday afternoon a number of the<br />\nmembers of the art squad were appointed to make posters advertising<br />\nthe dances after the games for this<br />\nyear. Also, it was announced that<br />\nhereafter the Cotillion Board will<br />\nhold its meetings in Levering Hall<br />\nevery Monday at twelve twenty instead of on Thursdays.<br /><br />\nBut now---because Hochschild, Kohn &amp; Co.<br /><br />\nbeen good values!<br /><br />\nclothing values are greater than ever---you<br />\ncan get them for $29.75.<br />\nNot an inch of material sacrificed---nor a<br />\nstitch of tailoring. But a new low price to<br />\ndemonstrate our power for value-giving.<br /><br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br /><br />\nPhilological and Scientific<br />\nPublications<br /><br />\nEvery Suit with 2 trousers!<br /><br />\n20 S. SHARP ST., BALTIMORE<br /><br />\nEMIORIALS<br /><br />\nS<br /><br />\nTHE NEW<br /><br />\nThe new free book<br />\n\"GAS HEAT\" is ready<br />\nfor distribution. Have<br />\nyou received your<br />\ncopy?<br /><br />\nThe unprecedented growth in the use of die-castings can<br /><br />\nlargely attributed to the perfection of the process through the<br /><br />\nuse of gas. Die-casting metal must be kept at constant temperatures for long<br />\nperiods of time—what better way to maintain the proper thermal head than by<br />\nthe use of gas? In many cases, too, where intricate dies are involved, tiny gas<br />\njets keep thin sections at uniform temperature, thus preventing the freezing<br />\nof metal in the gates, and assuring perfect castings every time.<br />\nAMERICAN GAS<br />\nASSOCIATION<br />\n420 Lexington Avenue, New York<br /><br />\n$750<br /><br />\nSmartest Coat<br />\non the Campus<br /><br />\nbe<br /><br />\nThe gas-fired furnace for melting scrap metal is an important<br />\nadjunct to the die-casting shop.<br /><br />\nyou can do it better with<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br /><br />\nmamma.<br /><br />\nAutumn Showing-The season's styles in neckwear are the key to a<br /><br />\nSOPHOMORES TO NOMINATE CLASS OFFICERS<br />\nman's dress . . . they give that<br /><br />\ntouch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br />\nInterwoven Hose<br /><br />\nScotch Spun Neckwear<br /><br />\nManhattan Shirts<br /><br />\n11 East Baltimore Street<br /><br />\nMcPHERSON'S<br /><br />\nCollege Men Will Appreciate This<br />\n6 BREAKFASTS<br />\nALL FOR<br /><br />\n7 DINNERS<br />\nGood Food<br /><br />\n$7.00<br /><br />\nLowest Prices<br /><br />\nHASSLINGER'S<br />\n3226 Greenmount Avenue<br />\nr<br /><br />\nJust Below 33rd Street<br /><br />\nOPERATE IT YOURSELF<br /><br />\nRENT A CAR<br /><br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br /><br />\n111 W. NORTH AVE.<br /><br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe 1413<br /><br />\nHalf of you men<br />\nin college have<br /><br />\nATHLETE'S<br />\nFOOT\"<br />\n....says U.S. report<br />\nOU may call it toe itch,golf<br />\nitch-the \"doe\" may call it<br />\nringworm—millions of people<br />\nwho catch it, call it \"Athlete's<br />\nFoot\"— but all of them are the<br />\nsame. A ringworm parasite,<br />\ntinea trichophyton by name,<br />\ncauses that redness between the<br />\ntoes with i-t-c-h-i-n-g. Tiny<br />\nblisters or a thick, moist skin<br />\ncondition may be another symptom. Again dryness, with little<br />\nscales, is a signal.<br /><br />\nY<br /><br />\nthis fungus parasite infects and<br />\nreinfects bare feet almost any<br />\ntime they come in contact with<br />\ndamp floors.<br /><br />\nAbsorbine Jr. kills the<br />\ngerm of<br />\n\"ATHLETE'S FOOT\"<br /><br />\nTests in a famous New York<br />\n\"lab\" have revealed that<br />\nAbsorbine Jr. penetrates flesh.<br />\nlike tissues deeply and that<br />\nv`At least half of all adults wherever it penetrates,it KILLS<br />\nsuffer from it at some time,\" the ringworm germ.<br />\nsays the U. S. Public Health<br />\nIt might not be a bad idea to<br />\nService. In universities as far examine your feet tonight. At<br />\napart as Pennsylvania and Cali- the first sign of the symptoms<br />\nfornia 50% of the men have it. mentioned here, douse on<br />\nAnd the co-eds are not immune Absorbine Jr. And keep a bottle<br />\neither.<br />\nhandy in your locker as a preventive.<br />\nUse it after every<br />\nIt lurks in the very places<br />\nexposure<br />\nof<br />\nbare feet on damp<br />\nwhere we all go for cleanliness<br />\nand health—on the edges of floors. At all druggists — $1.25.<br />\nYoung, Inc., Springfield,<br />\nswimming pools and showers— W.F.<br />\nMassachusetts.<br />\nin gymnasiums—on locker- and<br />\ndressing-room floors. It spite of<br />\nmodern sanitation (you have to<br />\nboil socks 15 minutes to kill it'<br /><br />\nAbsorbine<br />\nFOR YEARS HAS RELIEVED SORE<br />\nMUSCLES, MUSCULAR ACHES, BRUISES,<br />\nBURNS, CUTS, SPRAINS, tBRASIONS<br /><br />\nNominations for class officers will be held at the first<br />\nSophomore class meeting at<br />\n12:20 in C. E. 120 today.<br />\nJack Turnbull, president of<br />\nlast year's Freshman class, will<br />\nconduct the meeting. It is<br />\nhoped that as many Sophomores as possible will attend.<br /><br />\nLinthicum Named Captain<br />\nOf Scabbard and Blade<br />\nAt the first meeting of the Scabbard and Blade, honorary military<br />\nfraternity, it was decided that election for first lieutenant for the ensuing term will be held on Tuesday,<br />\nOctober 21.<br />\nScabbard and Blade is a fraternity to which seniors of high standing in the R. 0. T. C. and other<br />\nuniversity activities, as well as<br />\nscholarships are elected. There are,<br />\nat present, seven men in the company.<br />\nSweester Linthicum, lieutenant<br />\ncolonel of the Cadet R. 0. T. C.<br />\nCorps, automatically became captain of the company due to the fact<br />\nthat Bledsoe has not returned this<br />\nyear.<br />\nIt is planed to have many activities this year, including a dance for<br />\nthe members.<br /><br />\nCoach Morrill Continues<br />\nFall Lacrosse Practice<br />\nAt the second practice of fall lacrosse, which was held Tuesday,<br />\nCoach Morrill, who is in charge,<br />\ncontinued in his elementary drill in<br />\nstickwork ann fundamentals for the<br />\ncandidates. The majority of these<br />\ncandidates are playing the game for<br />\nthe first time and this work is a<br />\nnecessity if they expect to develop<br />\ninto varsity material. The work for<br />\nthe main part consisted of passing<br />\nand receiving with Coach Morrill<br />\nand members of last year's varsity<br />\ncorrecting the new men.<br />\nThe coach wishes to repeat again<br />\nhis anouncement to all those who<br />\ncontemplate trying for the team in<br />\nthe spring. With many other phases<br />\nof the game to be worked and<br />\ncoached, the man with deficient or<br />\nundeveloped stickwork will be at a<br />\ndistinct disadvantage. It is for the<br />\npurpose of teaching and improving<br />\nthe rudiments of stickwork that the<br />\npractice is held in the fall. Men out<br />\nfor another sport such as football<br />\nor cross country, of course, cannot<br />\nattend. But those who are able to<br />\nparticipate at this time are urged to<br />\ndo 50.<br />\nAmong those of last year's varsity squad who are attending the<br />\npractice are Stone, Kelly, Ness, and<br />\nMcDorman. Others are Davis,<br />\nReid, Mattingly, Martin, Kuper,<br />\nGude, Krulev itch, Chancellor and<br />\nWilloughby.<br />\nA call for freshman managers in<br />\nthis sport has also been sent out.<br />\nCandidates for this position should<br />\nreport to Manager L. A. McNeer<br />\nat the dressing rooms or the field on<br />\nTuesday and Friday afternoons.<br /><br />\nBoard To Penalize<br />\nViolaters Of Agreement<br />\nAt a special meeting of the Interfraternity board, Monday, resolutions were passed to the effect that<br />\nall violations of rushing rules would<br />\nbe subject, according to the resolutions, to the usual penalty of from<br />\n$1.00 to $100.<br />\nSo far, the board declared, all<br />\nHopkins fraternities have abided<br />\nstrictly by the rushing agreement.<br />\nThe resolutions were passed, however, to acquaint campus fraternal<br />\norganizations with just what means<br />\nwould be used to enforce the agreement.<br />\nRushing regulations prohibit any<br />\nfraternity represented by the Interfraternity Board from pledging<br />\nFreshmen before the second semester.<br /><br />\nCROSS COUNTRY TEAM TO<br />\nBE CHOSEN TOMORROW<br />\nFreshman-Sophomore Meet to<br />\nBe Held Wednesday<br />\nWith prospects for a successful<br />\nseason ever increasing, Coach<br />\nHambleton is putting his harriers<br />\nthrough a period of intensive training preparatory to the Lehigh meet<br />\non October 25 at Homewood. The<br />\ncross-country men have already<br />\nbeen taken over the course several<br />\ntimes and have been improving the<br />\ntime with each successive trip.<br />\nTomorrow<br />\nsquad will be<br />\nmile course.<br />\nwill definitely<br /><br />\nAn influence for<br />\nbetter dressing at<br />\nMaryland colleges!<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\ntryouts for the first<br />\nconducted over a 41/2<br />\nSeven or eight men<br />\nbe chosen to compete.<br /><br />\nayn@,tvL-Gylrt_<br /><br />\nLehigh<br /><br />\nLehigh, it has been rumored, will<br />\npresent quite a strong team, but<br />\njudging from the form the Blue Jay<br />\nharriers have been displaying in<br /><br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br /><br />\npractice, Homewood ought to be the<br />\nscene of an interesting meet at the<br />\nend of the month.<br />\nThe cross-country squad this year<br />\nhas been greatly strengthened by<br />\nthe addition of Paul Zepp, an experienced distance runner. Some of<br />\nthe other candidates who have been<br />\nshowing excellent form are Hancock, Packard, Cornman, Rapport,<br />\nSneeringer, Mattingly and Sklarewsky.<br /><br />\nNEW<br /><br />\nFORD<br /><br />\nUSED<br /><br />\nAutomobiles<br /><br />\nFrosh-Soph Meet<br /><br />\nA 21/2 mile meet will be held between the Freshman and Sophomore teams on Wednesday, when<br />\nthe younger men will have a chance<br />\nto run in competition.<br />\nIn spite of the fact that the<br />\ncross-country squad this year is one<br />\nof the largest, Coach Hambleton is<br />\nanxious that as many candidates as<br />\npossible try for the squad. He<br />\nadded that all interested should report immediately, since equipment<br />\nis now being ordered for the team.<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\nVernon 4300<br /><br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\nvlry<br /><br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\n•WV<br /><br />\n\"Food Prepared the Right Way\"<br /><br />\nThis white<br />\ndot identifies<br />\nSheafrer's,the<br />\nONLY Aenuine<br />\nLifetime° pen.<br /><br />\nThe only Balance° per<br />\nand pencil is Sheafrer's.<br /><br />\nThe College World<br />\nhas \"gone Sheaffer\"*<br /><br />\nNo. HTSC,<br />\nMarine Green,<br />\n$4.00<br /><br />\n1111111111111111111111111111111111111110,<br /><br />\nThe plain factis that among the hundred leading<br />\nAmerican colleges, each having 1,700 or more<br />\nstudents registered, more Sheaffer's are bought<br />\nthan any other make. That's understandable<br />\nenough, once you're acquainted with Sheaffer's<br />\nfour advantages: (1) individualized pen points,<br />\n(2) the Balance° design that makes for easier,<br />\nspeedier writing, (3) the modern beauty of the<br />\nBalance° contour,(4) the Lifetime° guarantee of<br />\nsatisfactory service.<br />\nSince all that comes with Sheaffer's Balance°<br />\nLifetimes°, why be content with less?<br />\n*A recent survey made by a disinterested o*anization showed<br />\nSheaffer's first in fountain pen sales amonk,the 100 leadinE,American<br />\ncollek,es havin registration of 1,700 or more students. Documents<br />\ncoverink, this survey are available to anyone.<br /><br />\nAT BETTER STORES EVERYWHERE<br />\nThe ONLY genuine Lifetime° pen is Sheaffer's; do not be deceived!<br />\nAll fountain pens are uaranteed ak,ainst defects, but Sheaffer's Lifetime° is kuaranteed unconditionally for your life, and other Sheaffer<br />\nproducts are forever liaranteed apinst defect in materials and workmanship. Green or Black Lifetime° pens,$8.75; Ladies', $8.25. Blackand-Pearl DeLuxe and Marine Green Lifetime° pens,$10;Ladies',$9.50.<br />\nPetite Lifetime° pens,$7 up. Golfo'.Handba Pencil,$3. Others lower.<br />\nSAFETY SKRIP, SUCCESSOR TO INK,SKRIPFILLED, 50c to $10. Carry<br />\nSafety Skrip in your luPlake<br />\nand to classes. It's leak-proof,<br /><br />\npractically unbreakable.<br />\nSavesfurniture,clothink„ruks,<br />\nkeeps the fluid fresh, makes<br />\nall pens write better.<br /><br />\nHEAFFE<br /><br />\nPENS•PENCILS-DESK SETS•SKRIP<br /><br />\nW.A.SHEAFFER PEN COMPANY,FORT MADISON,IOWA,U.S.A.<br /><br />\noaeg. U. s. Pat. Off..<br /><br />\n©W,A. S.. P. Cu., UN<br /><br />\nNo.<br />\nK74TC<br />\n$9.50<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 17, 1930<br /><br />\n4<br />\nDR. FRENCH SPEAKS TO EN GUSH<br />\nCLASS ON J. H. U. LIBRARY<br />\nall<br />\nlitle<br />\nway in college, and in some few<br />\n\"Libraries are the hearts of<br />\nenterprising universities, and the cases, even to graduation. But the<br />\nstudent body at Johns Hopkins university plan of reading more<br />\nthan the required amount of books,<br />\nshould feel it a great privilege to<br />\nand of satisfying your intellectual<br />\nhave so fine a one.\" This was the<br />\ncuriosity will see you through much<br />\nstatement of Dr. French, Johns farther and much more successHopkins librarian, in a talk to the fully.\"<br />\nclass in English composition on<br />\nThe Hopkins libraries have been<br />\nWednesday.<br />\ncollecting books for fifty years, and<br />\nDr. French went on to explain now have over four hundred thouthat a university is founded for two sand bound volumes, and countless<br />\npurposes: instruction, and research. numbers of unbound pamphlets.<br />\nFor both of these, he said, libraries Three hundred thousand bound volare absolutely essential.<br />\numes are at Homewood.<br />\n\"The high school plan of reading<br />\nThe windows in the main library<br />\nonly the required literature and are among the finest in the world.<br />\npassing exams,\" he stated emphati- A printed sheet explaining them<br />\ncally, \"will carry a student along a may be secured at the desk.<br /><br />\nJ. H. U. Band Meets To<br />\nPrepare For Coming Season<br /><br />\nLIBERAL CLUB<br />\n(Cont. from page 1, col. 2)<br /><br />\nMeeting for the first time this gating this situation. A great many<br />\nyear, the Johns Hopkins Band con- Southern colleges were represented<br />\nvened in the Barn last Monday for at this conference, as the result of<br />\norganization,practice and discussion the spread of liberalism in the<br />\nSouth, due to the terrible conditions<br />\nof proposed activities.<br />\nexisting in the Southern textile inHerbert Trueheart presented a<br />\ndustry.<br />\ndetailed resume of the band's deL. I. D. Advises Clubs<br />\nvelopments and spoke of the inThis year the Club is in close<br />\ncreased membership.<br />\ntouch with the League for IndusMr. Converso will probably contrial Democracy's New York office,<br />\nduct the band this year. The musiand its members have been called<br />\ncal organization will be under the<br />\nupon for advice in the formation of<br />\nsupervision of Norman Milbourne<br />\nseveral Liberal clubs.<br />\nand Eugene Lyon will act as drum<br />\nThe nearest Liberal clubs of any<br />\nmajor.<br />\nsignificance to the Johns Hopkins<br /><br />\nORATORICAL CONTESTS<br />\nTO BE HELD AGAIN<br /><br />\nVO1<br /><br />\nDr. Wheeler Deplores Lack of<br />\nInterest In Events<br /><br />\nRU<br /><br />\nDeclaring there is a decided lack<br />\nof interest in the various public<br />\nspeaking contests sponsored at the<br />\nJohns Hopkins University, Dr. Paul<br />\nM. Wheeler, of the Department of<br />\nEnglish, yesterday stated the oratorical events will again be held this<br />\nyear, the dates of which have not<br />\nbeen definitely settled.<br />\nDates for the Tocqueville Medal,<br />\nthe Adams Medal and the Thom<br />\nCup contests; and for the SeniorJunior, Freshman-Sophomore debates will be announced subsequent<br />\nto a conference between Dr.<br />\nWheeler and Francis Warlow,<br />\npresident of the Student Council.<br />\nEach speaking event, with the exception of the Thom Cup contention, which is held at night, will be<br />\nstaged at a weekly assembly of the<br />\nstudent body.<br />\n\"There is a decided non-interest<br />\namong the students in the public<br />\nspeaking events held on the campus<br />\nof the University,\" declared Dr.<br />\nWheeler. \"Frankly, there is no good<br />\nreason at all for this absence of enthusiasm toward oratorical contests.<br />\nThis year, when entrants are called<br />\nfor there should be a greater response than last.\"<br />\nDr. Wheeler stated he would<br />\ngladly discuss the contests with any<br />\none who is interested in them. His<br />\noffice is in Remsen Hall, 310.<br />\nDelegated Debates Dropped<br /><br />\nThe Johns Hopkins University<br />\nwill not meet other institutions in<br />\nCharles Weller, Jr., secretary- are to be found in Washington, D.<br />\ndebating, it was announced. Offitreasurer, requests that those stu- C., at the George Washington Uni- cials of the University have stamped<br />\ndents who play band instruments versity and at St. John's College in their opposition upon delegated debating this year. Authorization for<br />\nAnnapolis, Maryland.<br />\nget in touch with him at once.<br />\ninter-college debates was dropped<br />\nhere because of no interest in the<br />\nmeets. Consequently, the Debating<br />\nCouncil was absolved.<br />\nThe Tocqueville Medal, won by<br />\nLeo Alpert, March 1929, in his first<br />\nyear here, has been offered annually<br />\nto the student who delivers the best<br />\nspeech on some phase of a general<br /><br />\nTOURNAMENT<br />\nVALUABLE CASH PRIZES<br />\nQualify on or Before October 18th<br /><br />\nST. PAUL STREET, Between 24th and 25th Streets<br /><br />\n,<br />\n40<br /><br />\nOnly<br /><br />\nDesk<br /><br />\nEdit<br /><br />\nNem<br /><br />\nHun<br />\nedit(<br /><br />\n17, i<br /><br />\nstaff<br /><br />\nsu<br />\noffet<br />\nA<br />\nhea.<br />\ntor,<br />\npart<br />\ndida<br /><br />\nDrink<br /><br />\nDelicious and Refreshing<br /><br />\n...for the<br /><br />\nPause<br /><br />\nSeni<br />\nman<br />\nsecti<br /><br />\nthat refreshes<br /><br />\nin4<br /><br />\n.phol<br />\ntean<br />\ngam<br /><br />\nWhen you suffer from large and undiluted<br />\ndoses of your fellows. When the milk of<br />\nhuman kindness seems to sour. Blow the<br />\nwhistle for a minute's \"time out\" on your<br />\nown account, to pause and refresh yourself.<br /><br />\ntake<br />\nphoi<br />\npicti<br />\ntinic<br /><br />\nIn other words, go into a huddle with a<br />\nglass or bottle of refreshing, delicious<br />\nCoca-Cola. It will make you captain of<br />\nyour soul again, ready to live—or die—<br />\nfor the dear old alma mater.<br /><br />\nFamous<br />\nGrantland Rice<br />\nSports Champions-^s-- Coca-Cola<br />\nOrchestra..--s..Every Wednesday<br />\n10:30to 11 pm.Eastern Daylight<br />\nSavinEtaTimeCoast to<br />\nCoast NBC Network.<br /><br />\nThe Coca-Cola Company, Atlanta, Ga.<br /><br />\new-7<br />\n9 MILLION A DAY<br /><br />\nIT<br /><br />\nHAD<br /><br />\nTO<br /><br />\nBE<br /><br />\nGOOD<br /><br />\nTO<br /><br />\nGET<br /><br />\nWHERE<br /><br />\nIT<br /><br />\nIS<br /><br />\n_pelt<br /><br />\nWill<br /><br />\nness,<br /><br />\nSTEPPING<br /><br />\nINTO<br /><br />\nA<br /><br />\nMODERN<br /><br />\nWORILI)<br /><br />\n(Cont. on page 2, col. 3)<br /><br />\nOffers This Combination<br /><br />\nPho<br />\ncan<br /><br />\n0<br />\n4.<br /><br />\nthe<br />\nSer<br />\nclu(<br /><br />\nPEN GUARANTEED FOR LIFE<br /><br />\nSAVES PRICE OF A SECOND PEN<br /><br />\nin t<br />\nage]<br />\nrner<br />\ndatc<br /><br />\nthe<br />\nof t<br />\nit-1g<br />\nof<br />\ning<br />\ning<br /><br />\nNott,<br /><br />\nParker Duofold<br /><br />\nphoi<br />\ndida<br />\n'nee<br />\nwor<br />\nfor<br />\nuse<br /><br />\nthei<br /><br />\ntopic chosen from the field of<br />\nFrench history, politics or literature<br />\nin the Nineteenth Century. The<br /><br />\nST. PAUL OBSTACLE GOLF COURSE<br /><br />\nvoevet and<br /><br />\nBlow<br />\nthe Whistle<br /><br />\nOn,<br />\nSer<br />\nphc<br /><br />\nthe<br />\nof<br /><br />\nthe<br />\nhis<br />\ncla!<br />\nthe<br />\ndre<br />\nthe<br />\nthe<br />\nSame Pen Converted<br />\nEven at higher prices, other makers<br />\nhave been unable to match this classic.<br />\nNow that it takes the place of a special<br />\npen for the pocket and another for the<br />\ndesk, its sales are soaring beyond all<br />\nprevious heights.<br />\nGo and ask the nearest dealer to show<br />\nhow the Duofold is changed back and<br />\nforth from a Pocket to a Desk Set Pen.<br />\nIf you own a Parker, take it with you.<br />\nIf not, go anyway and see this revolutionary invention.<br /><br />\nAs a Pocket Pen<br />\nGetting the Parker Duofold is now<br />\nlike getting two Pens at the price of one.<br />\nAttaching a tapered end converts it into<br />\na Desk Set Pen. Removing the taper<br />\nrestores it to a pocket Pen.<br />\nEither way, you save the price of a<br />\nsecond pen. You have only one Pen to<br />\nfill instead of two. And whether you<br />\nwrite at your desk or on the go, you<br />\nalways have your favorite point.<br />\nYou have a non-breakable Permanite<br />\nbarrel that holds 17.4% more ink than<br />\naverage, size for size—that is jewel-like<br />\nin lustre, color, and beauty. And most<br />\nof all—the famous Duofold *bonus<br />\npoint that writes with Geo. S. Parker's<br />\n47th improvement—Pressureless Touch.<br /><br />\nTHE PARKER PEN COMPANY,Janesville, Wis. Offices and subsidiaries: New York,<br />\nChicago, Atlanta, Buffalo, San Francisco, Dallas,<br />\nToronto,Canada;London,Eng.; Berlin, Germany.<br /><br />\nScientist and Salesman<br />\nTHE MODERN PARTNERSHIP<br />\nLike every other modern industry, the Bell<br />\nSystem requires the combined effort of scientist and salesman. The commercial man has<br />\nagain and again shown the public how to use<br />\nnew products of the telephone laboratory,<br />\nand how to make new uses of existing<br />\napparatus.<br />\nTransmitting pictures and typewritten mes-<br /><br />\nsages over telephone wires are services right<br />\nnow being actively promoted. Scientific selling<br />\nby long distance is among many ideas originated to increase the telephone's usefulness.<br />\nIn short telephony is a business, with problems that stimulate commercially minded men<br />\nand a breadth of opportunity in step with the<br />\nfast moving world of industry today.<br /><br />\n* Point-smiths Paid a Bonus<br />\n• 34ds;q1<br /><br />\n(Par er<br />\nDuq/b/d<br /><br />\nEleven merciless inspections are<br />\ngiven each Parker Duofold point.<br />\nThen we pay a bonus to our pointsmith who made it. Points are rejected if they fail even one inspection, and the point-smith pays us<br />\na forfeit. Yet,7out of8 points earn<br />\na bonus,because we limit each man<br />\nto a given number a day.<br /><br />\nBELL SYSTEM<br /><br />\niS s7 $10<br /><br />\nA NATION-WIDE SYSTEM OF MORE THAN 20,000,000 INTER-CONNECTING TELEPHONES<br /><br />\nPEN GUARANTEED FOR LIFE<br /><br />\nof<br />\nof<br /><br />\nout<br />\nthi;<br /><br />\nbri<br /><br />\ndir<br />\nthi<br />\nPa:<br /><br />\nser<br />\nCat<br />\nbe<br />\nart<br />\nstt<br />\nwi<br />\nstri<br /><br />"}], "field_media_file": [{"target_id": 38498, "display": null, "description": null, "target_type": "file", "target_uuid": "dbdd8651-8867-496c-8032-c6e25e2cba69", "url": "http://digital.library.jhu.edu/system/files/2022-03/12177-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12177, "target_type": "node", "target_uuid": "14ed9da6-975a-4a25-be0a-c5c5ddda4e9f", "url": "/node/12177"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c53695d8-fc0c-4bd3-aa12-ca241f0a0b60"}]}