{"mid": [{"value": 36705}], "uuid": [{"value": "3e2a0563-72de-4c4e-931f-9e6cfcce3a17"}], "vid": [{"value": 36705}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12987-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "BALTIMORE, MD., FEBRUARY 24, 1922<br />\n<br />\nVOL. XXVI. No 33<br />\n<br />\nBLACK AND BLUE MERMEN<br />\nMR. KISTLER TO COACH<br />\nSTAGE SET FOR ANNUAL<br />\nTO SWIM RUTGERS IN<br />\nDUELLERS<br />\nDRAMATIC<br />\nCLUB<br />\nJOHNS HOPKINS FIFTH<br />\nDUAL MEET<br />\nREGIMENT GAMES<br />\nCoach Swindell Obtains Services of a<br />\nBooth To Meet Crawford in 1,000-yard<br />\nSpecial. Hopkins Mile Relay<br />\nTo Meet Virginia.<br />\n<br />\nFormer Instructor to Help the<br />\nSwordsmen.<br />\n<br />\nNew Jersey College Represented by<br />\nStrong Team. Were Defeated by<br />\nLehigh Tankmen.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nTwelve Degrees Conferred At<br />\nCommemoration<br />\n<br />\nCALVIN COOLIDGE DELIV- PRESIDENT GOODNOW CRITIIn an effort to present, as near<br />\nCIZES PRESENT-DAY<br />\nERS CHIEF ADDRESS<br />\nThe Johns Hopkins swimming<br />\nEDUCATION<br />\nWhen the curtain rises tomorrow as possible, a perfect duel scene in<br />\nVice President Defends Arms Confernight on the fifteenth annual Johns Act 1 of the Dramatic Club's pro- team will journey to New Bruns- ence in Contrast With the League of Announcement Made of Increase of<br />\nEndowment to Seventeen<br />\nHopkins-Fifth Regiment indoor duction, \"If I Were King,\" Coach wick tomorrow to meet the Rut- Nations. Upholds Four Power Treaty.<br />\nMillion.<br />\nViceCoolidge,<br />\nCalvin<br />\nHon.<br />\ngames, the greatest collection of Walter B. Swindell has enlisted the<br />\ngers team in the latter's tank. UnUniversity held<br />\nHopkins<br />\nJohns<br />\nPresident of the United States, aftrack and field stars ever assem- services of Mr. Kistler, business<br />\ndaunted by the decisive defeat ter having the degree of Doctor of its annual Commemoration Day exbled in Baltimore will be brought manager of Athletics and former<br />\nto the starting line. Nearly all of fencing instructor at the Univer- handed down by the Columbia nata- Laws conferred upon him, made ercises—its forty-sixth anniversary<br />\ntors, the Black and Blue team in- the principal address at the anni- celebration—at the Lyric Theatre,<br />\nthe Eastern collegiate stars will be sity.<br />\nAct I, the longest of the four-act tends to make a strong bid in wrest- versary day exercises of the Uni- Wednesday morning. The trusseen in one or more events. An<br />\ndrama,<br />\nhas been practically com- ing the laurels from the New Jer- versity last Wednesday. His speech tees, faculty members and alumni<br />\nrunners<br />\nof<br />\nfield<br />\nespecially brilliant<br />\nwork has been comwas an ardent appeal to patriotism<br />\nand<br />\npleted,<br />\nSpeClub<br />\nhas entered the Varsity<br />\nsey lads.<br />\nWith<br />\nfine sturdy Americanism, with- assembled in a body in the foyer,<br />\nand<br />\nact.<br />\nsecond<br />\nupon<br />\nthe<br />\nmenced<br />\ncial invitation 1,000-yard race.<br />\ninEastern<br />\nRutgers,<br />\nlast<br />\nyear's<br />\nout that frequept spirit of narrow- the doctors wearing their official<br />\nBooth, of Hopkins, who ran a dead but four weeks remaining in which<br />\ngowns, the vivid colors of whose<br />\nheat with Bob Crawford, of Lafay- to whip the play into shape, the tercollegiate champions, is again minded nationalism.<br />\nsketch<br />\nhistorical<br />\nAfter<br />\ngiving<br />\nan<br />\ncall<br />\nfive<br />\nexceptionally<br />\nrepresented by an<br />\nhoods contrasted with the sombre<br />\nette, in the two-mile last spring, coach has been forced to<br />\nWill again set off in company with rehearsals a week. Mr. Swindell is strong team. They were defeated cf the colonies and of the events black robes. The exercises opened<br />\nthe Lafayette flyer: -Curtis, of a graduate of Hopkins, Class of by the crack swimmers represent- which fixed Washington in his with the entrance of the impressive<br />\n'Navy ; Helfrich and Shields, of 1901, and is giving his services to ing Navy this season, but they suc- place of immortality, he discussed procession, at the head of which<br />\nthe significance of the Arms ConPenn State; Rick, of Princeton, the club free of charge. He beceeded in making the best score ference to world relationships.<br />\nwalked President Goodnow, acand Hayes, of University of Pitts- lieves that \"If I Were King\" will<br />\nagainst<br />\nthe<br />\nDefending the four-power treaty companied by Mr. Coolidge.<br />\nburgh, will also start in this same be the most successful play ever which has been made<br />\nGiebel,<br />\nof<br />\ncontrasted with the League of<br />\nfuture<br />\nsailors<br />\nthis<br />\nyear.<br />\nclub.<br />\nas<br />\nAs chaplain of the day, Archthe<br />\nby<br />\ngiven<br />\nAmerevent. Shields was the first<br />\nof<br />\nreign<br />\nsaid:<br />\nNations,<br />\nhe<br />\nthe<br />\nin<br />\nlaid<br />\nis<br />\nplay<br />\nThe<br />\nRutgers, well known to Baltimorican to finish in the 1,500 metre<br />\nbishop Michael Curley delivered<br />\nrun at Antwerp, and Rick ran a Louis XI in the city of Paris. Much eans because of his excellent show- \"No one doubts that the dele- the invocation. Dr. Goodnow preclose second to Joie Ray a few care is being exercised in the se- ing at the championships here last gates to the Paris Conference were sided and the chief feature of the<br />\ninspired by that noble ideal. Amid<br />\nWeeks ago, when the latter set a lection of costumes and other prop- year, defeated<br />\nSinclair,<br />\nof<br />\nNavy,<br />\nwill<br />\nbe<br />\nthere<br />\nall the contending elements they ceremonies was his conferring of<br />\nnew record for the one and one- erties. In order that<br />\n220.<br />\nin<br />\nthe<br />\nSinclair<br />\nholds<br />\nthe<br />\ncolplay<br />\nfailed to propose a plan which har- degrees. Vice-President Coolidge<br />\nno anachronisms and that the<br />\nhalf mile.<br />\nmonized with the spirit of Amer- was given the honorary degree of<br />\nSome of the most interesting of will be historically correct, the ser- legiate record for this event.<br />\nauthorEveryone knows that the Doctor of Laws. Degrees were<br />\nan<br />\nica.<br />\nVincent,<br />\nas<br />\nDr.<br />\nof<br />\nvices<br />\nHopkins<br />\nwas<br />\nnosed<br />\nout<br />\nthe<br />\npreS.<br />\nNaval<br />\nU.<br />\nare<br />\nthe relay races<br />\nbeen<br />\nAmerican<br />\nsoul longed to establish then<br />\nhave<br />\nhistory,<br />\nMediaeval<br />\non<br />\nity<br />\nin<br />\na<br />\nAcademy versus Penn State<br />\nvious week by Lehigh, losing by a<br />\nconferred upon twelve stuwhich held the promise<br />\ncondition<br />\na<br />\nsought.<br />\nmedley race; Princeton versus<br />\n36-35 score. Rutgers, however,<br />\ndents, as follows: Doctor of Medof a permanent peace, buts its ideal<br />\nThe play, which originally served<br />\nMassachusetts Institute of TechLehigh<br />\nby<br />\nwas<br />\ndecisively<br />\ndefeated<br />\nicine,<br />\nKo Chin Sun; Doctor of Pubwas for a peace not imposed by the<br />\nnology in a mile; Georgetown ver- as a starring vehicle for E. H.<br />\nmeet<br />\nin<br />\nSaturday,<br />\n42-29,<br />\nin<br />\na<br />\nlast<br />\nmajor forces of the world from lic Health, Dr. Rufino Anrial ; Docsus Fordham in a one-mile Cath- Southern, calls for a great deal of<br />\nwhich<br />\nexcellent<br />\ntimes<br />\nwere<br />\nmade.<br />\nbut maintained by the tor of Philosophy, William Enginterest<br />\nwithout,<br />\nholds<br />\nthe<br />\nand<br />\nfine<br />\nacting<br />\nolic intercollegiate relay; Johns<br />\nIn<br />\nthis<br />\nbroke<br />\nmeet,<br />\nthe<br />\nGiebel<br />\nEastinUnusual<br />\nof the world from lish, Jr., Johannes Mattern. Lawmoral<br />\npower<br />\nfinish.<br />\nHopkins versus Carnegie Tech in from start to<br />\nern<br />\ncollegiate<br />\nrecord<br />\nfor<br />\n-the<br />\nluO,<br />\nthe<br />\nby<br />\nwithin.\"<br />\nrence Opdycke, and Charles C.<br />\na medley; Johns Hopkins Reserves terest lis* been displayed<br />\ncovering the distance in 59 seconds. He continued by saying that Thatch; Doctor of Science in Hyconit<br />\nis<br />\nand<br />\nclub,<br />\nthe<br />\nfollowers<br />\nof<br />\nBaltimore<br />\nand<br />\nGallaudet<br />\nversus<br />\narmon, of Lehigh, bettered the when the Washington Conference giene, J. R. Minor; Master of Civil<br />\nCity College versus Baltimore Poly sequently believed that the demand<br />\nrecord<br />\nfor the 220 by 8 3-5 sec- was called men had decided that Engineering, G. T. Bryan, Jr.;<br />\nThe record-breaking Hopkins mile for tickets will be very great. _<br />\nrelay team of the Wilco A. A. There will be two performances onds, negotiating the distance in 2 the most feasible way of securing Bachelor of Arts, E. T. Cline and<br />\ngames will compete against Uni- given, one each on the nights of minutes and 37 seconds. Coady de- peace was by making the necessary C. D. Ebaugh ; Bachelor of Science,<br />\nversity of Virginia and Washing- March 27 and 28, at the Lyric The- feated Harmon in the Hopkins-Le- sacrifices to remove some of the J. C. Taylor.<br />\nton and Lee in the Smith Atlantic. atre. The stage, being the largest high meet by one-quarter of the causes of war.<br />\nDr. Goodnow made the Presi\"It was not merely the voice of dent's annual address. He critiin the city, will afford much great- length of the pool.<br />\nindoor mile relay event.<br />\nIn addition to the intercollegiate er floor space for the large cast- In the breast stroke, Gangwere, one man or one party or one ad- cised severely the Maryland State<br />\nevents, there will be a number of which will occupy the limelight in of Lehigh, defeated the Rutgers en- ministration, but the true voice of law which obliges the University,<br />\ntrants. Gangwere was easily de- America which proposed the scrap- as a state-aided institution, to acOpen handicap and interscholastic the first act.<br />\nfeated<br />\nhere in this event by \"Davvy\" ping of thirty capital ships, limita- cept without further examination<br />\nshortly<br />\nTickets will be on sale<br />\nraces in which it is expected that<br />\nRowland.<br />\nBoth Lehigh entrants tion upon the use of submarines, the graduates of all approved high<br />\nsome records will be broken. Clark and will be obtainable from any<br />\ndefeated Galbraith, of Rutgers, in . . . the abolition.of poison gas, ... schools. The law has become the<br />\nand Aaronson, of Hopkins, are ex- member of the cast.<br />\nthe<br />\nclub,<br />\ndive, while Coady, of Hopkins, the proposal of the Four-power source of the waste of much time,<br />\nmeeting<br />\nof<br />\nthe<br />\nthe<br />\nlast<br />\nAt<br />\npected to place in the dashes. The<br />\neasily<br />\nMiss<br />\ndefeated the Lehigh divers Treaty.\"<br />\nof<br />\nappreciation<br />\nof<br />\nresolution<br />\na<br />\nboth to the University and to the<br />\n100-yard high hurdles should furin<br />\nthis<br />\nwas<br />\nevent.<br />\n\"America<br />\nyears<br />\ncOnclusion,<br />\nhe<br />\nsaid:<br />\nin<br />\npast<br />\nIn<br />\nservices<br />\nWalters'<br />\nmany<br />\nstudents sent to college inadnish plenty of excitement when<br />\nOwing to a misunderstanding of stands ready to bear its share of equately prepared and who cannot<br />\nalso exTrowbridge, winner of the Eng- passed. The resolutiOn<br />\nlish 126 high hurdle championship pressed the club's sympathy and the schedule, the Black and Blue the burdens of the world, but it be dropped until the end of their<br />\nof 1920, meets ifile, of Penn State. sincere hope that she would have a had intended to meet Rutgers last cannot live the life of other peo- first half year. This situation ofLast year Hopkins won the speedy recovery from her present Saturday, swimming two meets in ples; it cannot remove from them fers an alarming handicap to the<br />\nmeet. The team this year, devel- sickness. A large bouquet of flow- one day. Matters were adjusted, the necessity of working out their University which is facing the<br />\nalong with. a however, and the New Jersey lads own destiny. It recognizes their problem of limiting its undergrad°Ped by Coach Le Cato, is known ers were sent to her<br />\nwill be met tomorrow as per sched- independence and the right to es- uate student body.<br />\nto be much stronger than it was copy of the resolution.<br />\nule. The Hopkins swimmers are tablish their own form of governDr. Goodnow then deplored the<br />\nat the same time last -year, and acAmerica<br />\nwill<br />\njoin<br />\nanxious<br />\nto<br />\nrevenge<br />\nlast<br />\nment,<br />\nbut<br />\nno<br />\nnayear's<br />\nde\"democracy\"<br />\nor \"the submergence<br />\ncording to all predictions it should<br />\nMUSICAL CLUB CONCERT AT<br />\nfeat<br />\nand<br />\nfrom<br />\nall<br />\ndestroying<br />\nwhat<br />\nit<br />\nbelieves<br />\ntion<br />\nin<br />\nindications<br />\nthey<br />\nof<br />\nthe<br />\nelite in the mediocre\" of<br />\nbe able to bring the team trophy<br />\nWESTERN TONIGHT<br />\nshould turn the tables on the New ought to be preserved or in profan- higher educational tendencies. \"As<br />\nback to Homewood. The meet will<br />\nThe Musical Clubs have started Brunswick team. A clean-cut vic- ing what it believes ought to be held<br />\ncompared with higher education in<br />\nProbably continue until some time<br />\non their program of concerts where tory would do much to erase the sacred. We are at peace with all Europe,<br />\nAmerican higher educanear midnight.<br />\nthey left off before the exams. A memory of the two extremely peoples. We do not deny our duty tion is conspicuously lacking in any<br />\nconcert will be given at Western clost4 meets recently lost by the to continue the making of sacri- serious attempts to devote all the<br />\nfices for the welfare of the world. attention of which they are in need<br />\nHigh School tonight, February 24; Black and Blue. BLACK AND BLUE JAY<br />\nThe<br />\nmen<br />\nprobably<br />\nfollowing<br />\nwill<br />\nIt is not alone for their sake but to the comparatively few bright<br />\nRECOGNIZED<br />\none at the State Normal School on<br />\nrepresent Hopkins in the meet:<br />\nfor our own sake that we would minds which should be nurtured as<br />\nThe Johns Hopkins Black and March 3, and one at Annapolis on<br />\nRelay—Coady, Rowland, Buhr- pursue that course. We have adopt- the most precious treasures of our<br />\nMarch 13. These concerts will be<br />\n81ue Jay has received public reced toward the world the policy of intellectual life. The desire which<br />\nfollowed by dances, the music be- er, (Morrell or Lord).<br />\nognition at the hands of one of the ing furnished by the Student Jazz<br />\nPlunge—Hambleton.<br />\nWashington, not of repression, not is so characteristic of this demo50-yard Dash—Buhrer, Row- of dictation, not of coercion, not of cratic country to afford to all equal<br />\ncurrent humorous periodicals. Each Orchestra.<br />\nimperialism, but a policy of co-op- opportunity should not be permitweek Judge has a page composed<br />\nLater in the spring, concerts will land.<br />\nFancy<br />\nDive—Coady.<br />\neration, relieving distress, of for- ted to put serious obstacles in the<br />\nUniversity,'Gouchof exchanges from the various col- b2 given at the<br />\n100-yard<br />\nDash—Buhrer,<br />\nJohnbearance, of helpfulness, of sym- way of developing those leaders<br />\nlege publications, under the cap- er, Lehman's Hall and probably at<br />\nston.<br />\npathy,<br />\nof forgiveness—a policy without whom the progress of our<br />\nEastern High and City College.<br />\ntion of \"With the College Wits.\"<br />\nDash—Coady,<br />\n220-yard<br />\nLord.<br />\nwhich is first of all American, but civilization is all but impossible.\"<br />\nThe club is expecting to take a trip<br />\nIn their issue of February 14, exBreast Stroke—Rowland, Dun- a policy above all, of faith in the<br />\nDr. Goodnow pointed out that<br />\nto the Eastern Shore to give a conchanges from the Black and Blue cert at Easton. The dates fo,r these ning or Buhrer.<br />\nsanction of the universal conscience to keep abreast of the great inJay occupied over a quarter of the concerts have not been definitely<br />\nBack Stroke—Hambleton, Mor- of mankind. That sanction is crease in the number of students<br />\nrell.<br />\neternal.<br />\ndecided upon.<br />\n1 ge.<br />\nContinued on page 2, col. 5<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\n<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22.<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nJunior Editors:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nENGINEERING LECTURES<br />\n<br />\nPublic lectures on engineering<br />\npractice have been arranged by the<br />\nEngineering School to take the<br />\nplace of the J. E. Aldred series,<br />\nwhich has been discontinued this<br />\nyear .<br />\nThe new course will be similar<br />\nin purpose anti method to the Aldred lectures, although only four addresses will be given. The lectures<br />\nare designed principally to supplement the engineering course for<br />\nundergraduate students.<br />\nThe addresses, which will be held<br />\nat 4.15 o'clock in the C. E. Hall,<br />\nare as follows:<br />\nMarch 8—\"Construction of the<br />\nCatskill water supply for the City<br />\nof New York,\" by J. Waldo Smith,<br />\n<br />\nchief engineer of the Board of Water Supply, New York City.<br />\nMarch 15-,—\"Some Results of the<br />\nWar on Engineering Research,\" by<br />\nC. E. Skinner, manager of the research department of the Westinghouse Electric Company, East Pittsburgh, Pa.<br />\nMarch 22—\"Engineering Problems Involving Atmospheric Pressure,\" by W. H. Carrier, president<br />\nof the Carrier Engineering Corporation, Newark, N. J.<br />\nMarch 29 — \"Magnesium, Its<br />\nManufacture and Use,\" by 1.V. G.<br />\nHarvey, vice-president and superintendent of the American Magnesium Corporation, Niagara Falls,<br />\nN.Y.<br />\n<br />\nPRESIDENT GOODNOW CRITICIZES PRESENT-DAY<br />\nEDUCATION<br />\n.<br />\nContinued from page 1,<br />\n<br />\nwhich may reasonably be expected,<br />\nthere must be expansion of plant<br />\nand increase of endowment, or limitation of numbers. However, many<br />\nlarge contributions have been made<br />\nduring the past year for the endowment of the Medical School.<br />\nThe total fund of $14,681,350 in<br />\nJune, 1920, has increased to date<br />\nt3 $17,000,000. He added that it<br />\nis imperative that a chemical laboratory be built very soon at Homewood. Also, the new dormitories<br />\nwill be completed by the fall of<br />\n1924, if not before.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\n<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., FEBRUARY 24, 1922<br />\n<br />\nSTUDENT COUNCIL<br />\nis delighted to announce that the Student Coun-<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nci t will from now on be unaffected by the black list. While this exempti )n does not apply to men who flunk out and are reinstated, it is all that<br />\n<br />\n,uld be expected or requested. This is only one of the many instances<br />\nin which the Faculty have shown themselves open to reason in regards<br />\n<br />\nto matters of importance to the student welfare, and their action should<br />\n) much to increase the efficiency of the Council.<br />\n<br />\nA BOOST, SENIORS<br />\nThe Seniors also come in for their mead of praise. Their dance<br />\nIs a wonderful success. The decorations played no small part in their<br />\ntriumph, although good music and refreshments, and attractive girls,<br />\nCOntributed<br />\n<br />\ntheir share.<br />\n<br />\nMr. Badillo, and those that assisted him,<br />\n<br />\ndeserve the praise of every member of the class, for through their work<br />\nand ability the C. E. Hall was changed into a veritable art gallery.<br />\nWe do not set ourselves up as art critics and we, therefore, quote<br />\n!an Latane, whose arrival momentarily flabbergasted the decorators.<br />\nA 'ter viewing with interest and amusement the varied decorations, and<br />\nca -efully studying the caricature of himself he is reported to have said<br />\nth it it \"was a real art collection,\" and that he had seen much worse<br />\nat the Vagabond Theatre.<br />\nSince the Dean really meant this as a compliment, we trust that<br />\n<br />\nKeeping faith<br />\nwith the<br />\nSMOKER<br />\nOur lifelong knowledge of choice<br />\ntobaccos, our years of manufacturing<br />\nexperience and our up-to-date facilities<br />\nare concentrated on making CAMELS<br />\nthe finest cigarette that can be produced.<br />\nInto THIS ONE BRAND we put the<br />\nUTMOST QUALITY. A better cigarette<br />\ncannot be made—even for a higher price.<br />\nCAMELis THE QUALITY CIGARETTE<br />\nmade for men who think for themselves<br />\n—for folks who appreciate really fine<br />\ntobacco.<br />\nONE BRAND—ONE QUALITY ONE<br />\nSIZE PACKAGE.<br />\n<br />\nth! artists will not be insulted.<br />\n<br />\nThat is the way we keep faith with the<br />\nsmoker.<br />\nCONGRATULATIONS, BLUE JAY!<br />\nTHE NEWS-LETTER<br />\n<br />\nth<br />\n<br />\nwishes to take this opportunity to congratulate<br />\n<br />\nBlue Jay upon its rapid improvement.<br />\n<br />\nThe magazine has taken<br />\n<br />\nfrr !at strides in the last year, and with proper support will soon arrive<br />\nat a place of distinction among the college comics.<br />\nThe fact that the Jay is already featuring largely in exchanges has<br />\n<br />\namel<br />\n<br />\nha 1 jokes in the Literary Digest several times, and in a recent issue of<br />\nfit ige<br />\n<br />\nmade up half of the \"College Wits\" page, is proof that the<br />\n<br />\nmagazine is obtaining recognition in the outside world.<br />\n<br />\nR. J. ILLYNOLD5 TOSACCO CO., Winatan•Salm, W.at<br />\n....•11111OINIMMMINEMBIF<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br />\nITI-<br />\n<br />\nlant<br />\nlimtany<br />\nlade<br />\nenool.<br />\n1 in<br />\nlate<br />\nt it<br />\nlabmeries<br />\nof<br />\n<br />\nNOTICES<br />\nNOTICE TO NEWS-LETTER<br />\nREADERS<br />\n<br />\nThe business office urgently<br />\nneeds copies of the Sidney Lanier<br />\nissue, No. 28, January 31. Anyone having one is requested to<br />\nbring it to the Post Office or the<br />\nNEWS-LETTER office immediately,<br />\nSENIORS<br />\n<br />\nAll class dues must be paid by<br />\nMarch 1, 1922. The treasurer will<br />\nbe at the Hullabaloo office in the<br />\nEarn, daily, from February 23 to<br />\nMarch 1, inclusive, from 11:30 A.<br />\nM. to 1 :30 P. M.<br />\nSOCIAL SCIENCE CLUB MEETING<br />\n<br />\nThere will be a meeting of the<br />\nSocial Science Club today at 2:30,<br />\nin Room 113, Gilman Hall. A discussion on \"Nationalism vs. Internationalism\" will be held.<br />\nBUSINESS CANDIDATES DRAMATIC<br />\nCLUB<br />\n<br />\nCandidates for the _position of<br />\nbusiness manager of the Dramatic<br />\nClub will report at the Barn tomorrow at 2 P. M.<br />\nBOB SKINNER ELECTED VICEPRESIDENT OF FRESHMAN<br />\nCLASS<br />\n<br />\nThe first meeting of the Freshman Class was held Tuesday, at<br />\n12:30, in the auditorium of the<br />\nCivil Engineering Building. After<br />\ncalling the meeting to order, President Page O'Connor announced<br />\nthat plans for the banquet were being arranged. After this a vote was<br />\ntaken to see how many of the members of the class desired pins, but,<br />\nas there were so very many who<br />\ndidn't want them, it was decided<br />\n\"to let the matter slide until next<br />\nyear.\" Treasurer \"Bill\" Norris<br />\nthen announced that a plan had<br />\nb(:.en devised for collecting the dues<br />\n\"Toots\" Darley, of the Engineering School, and Gedige Hess, of<br />\nthe Academic Department, are to<br />\nact as his assistants and are to keep<br />\nafter the Freshmen until the dues<br />\nare paid.<br />\nPresident O'Connor took the<br />\nchair again and announced that<br />\nnew officers would have to be elected to take the places of Spinney,<br />\nthe vice-president, and Westerman,<br />\nthe sergeant-at-arms, who had been<br />\ndropped from the University. Magill, Asendorf, \"Bob\" Skinner and<br />\n\"Ed\" Panneti were nominated for<br />\nvice-president. Post, Young and<br />\nRome were nominated. to fill the position of \"bouncer.\" Skinner was<br />\nelected vice-president. Post was<br />\nelected to the other office.<br />\n<br />\nTHE NEWS LETTER'S<br />\nSENIOR PROM DECLARED<br />\nMAILBAG<br />\nTHE GAYEST EVER HELD<br />\nAT HOPKINS<br />\nA Column in Which the Correspondents<br />\nDecorations Overshadow Anything of<br />\nthe Kind Ever Attempted. Spirit<br />\nof Jazz Unconfined.<br />\n<br />\nSurrounded by the most futuristic, impressionistic, cubistic, tapestries which ever adorned an otherwise solemn hall, the Class of<br />\n1922 unlimbered their studently<br />\nlimbs and gave themselves over to<br />\njoy unconfined and swayed themselves to thewierd strains of Seidenham's sorrow-killing orchestra of<br />\nseven pieces.<br />\nWith all thoughts of unhappy<br />\nexams behind them and caring little for the future, seventy-five<br />\ncouples threw their whole energies<br />\ninto the delightful pastime sponsored by the god Terpsichore; caring little for the harmful news-articles daily published by minds long<br />\nsince exhausted of other moneygetting material.<br />\nWith the \"King and Queen of<br />\nJazz\" beaming upon their disciples,<br />\nthe dance went on from 9:30 P. M.<br />\nuntil nearly 2 A. M., 'Wednesday<br />\nmorning.<br />\nThe decorations were by far the<br />\nmost impressive ever used at such<br />\nan affair. The personal ones Dean<br />\nLatane, Drs. Wood, French and<br />\nMitchell rivalled those of jazzier<br />\nsubjects, such as the \"Cave-man's<br />\nPetting Party,\" \"The Leg of Nations,\" \"Mrs. Salome,\" the \"First<br />\nShimmy,\" etc.<br />\nThe patrons and patronesses<br />\nwere: Dr. Frank J. Goodnow, Dean<br />\nand Mrs. John B. Whitehead, Professor and Mrs. Knight Dunlap,<br />\nMr. and Mrs. Robertson Griswold,<br />\nDr. and Mrs. Ronald T. Abercrombie, Professor and Mrs. J. H. Gregory, Dr. and Mrs. Luther M. Parsons, Dr. and Mrs. Ray Van Orman and Mrs. Christopher Johnson.<br />\n<br />\ntional Rifle Association Intercollegiate Matches, which was held on<br />\nWednesday, February 16, the Hopkins team scored 964 out of a possible 1,000. The team which shot<br />\nIii this match was composed of Captain Salter, Ruoff, Sherwood,<br />\nMount and L'Allemand. Each man<br />\nfired 10 shots sitting and 10 prone<br />\nfor a possible score of 200. While<br />\nthe scores were not as good as those<br />\nmade in recent dual meets, the total was considered very encouraging, inasmuch as the rules which<br />\napplied in this match are much<br />\nmore rigorous.<br />\nIn the same meet, a five-man<br />\nteam from each university in the<br />\n<br />\nADVERTISE HOPKINS!<br />\n<br />\nEditor of NEWS-LETTER.<br />\nDear Sir: In order to help our<br />\nuniversity by advertising it and<br />\nkeeping its name before the public,<br />\nlocally at least, I suggest that every<br />\nmotor vehicle operated by any person connected in any capacity with<br />\nthe university carry a suitable and<br />\ninexpensive Hopkins banner, pennant or emblem.<br />\nThe difficulty of carrying out<br />\nsuch an idea as this is that someone must start it and put it into the<br />\nform of a custom by making it<br />\npopular. With this in mind, our<br />\nMotorcycle Club is ready to take<br />\nthe lead and start the practice of<br />\ncarrying a Hopkins banner, pennant or emblem on its machines.<br />\nRespectfully yours,<br />\nEDWARD F. BUCHNER, JR.<br />\n<br />\nJoint Committee of Maryland<br />\nHouse and Senate inspect Homewood grounds, with view of establishing- technical school.<br />\nEleven Hopkins men to compete<br />\nin Georgetown games.<br />\nFIVE YEARS AGO<br />\nFEBRUARY 22, 1917<br />\n<br />\nFEBRUARY 22, 1919<br />\n<br />\nRECENT STADIUM ERECTIONS<br />\nELSEWHERE<br />\n<br />\nAre You Planning A<br />\n<br />\nORTMAN'S<br />\n<br />\nVACATION ABROAD?<br />\nIf So, Call on<br />\n<br />\nA. SCHUMACHER & CO.<br />\n<br />\n\"Queen Quality\" Home Made<br />\nChocolates<br />\nVISIT OUR ICE CREAM PARLORS<br />\n<br />\nPASSENGER<br />\nAGENTS<br />\n<br />\n518 N. CHARLES ST.<br />\n<br />\nfor all<br />\nTrans-Atlantic Lines<br />\n<br />\nR. G. by & Company<br />\n<br />\nCharles & Redwood Sts.<br />\n<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br />\n<br />\nChelsea Pharmacy<br />\nCharles and 22nd Sts.<br />\nDelicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nPrompt & Efficient Service<br />\n<br />\nDRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br />\n<br />\n-prep- room on<br />\n<br />\nthe<br />\n<br />\nthird floor specializes in<br />\nclothes for young men.<br />\n<br />\nAmerican universities which have<br />\ncompleted athletic stadiums within<br />\nthe decade, or have provided for<br />\ntheir construction, include California, Ohio State, Yale, Illinois,<br />\nBaltimore. Charles and Fayette<br />\nStanford, Chicago, Washington,<br />\nPrinceton, Kansas, Pittsburgh and<br />\nthe City College of New York. Of<br />\nthese, Yale's stadium cost $400,000<br />\nand seats 70,000; Washington spent<br />\n$600,000 and can seat 60,000; California is spending $900,000 to seat<br />\n60,000; Illinois is planning a combined stadium and amphitheater to<br />\ncost $2,500,000, and Ohio State<br />\nraised $1,250,000. No 'stadium yet<br />\ncompleted has been large enough<br />\nto meet the immediate demand for<br />\nseats. These facts, together with<br />\nth recent discussion by President<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nLowell, of Harvard University, on<br />\nthe relationship of intercollegiate<br />\nathletics to the university, indicate<br />\nINSTRUCTION<br />\ntwo opposite trends which are likely to clash in the future.<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br />\n<br />\nHub<br />\n<br />\nUniversity<br />\n<br />\nBOX 201, BOSTON, MASS.<br />\n<br />\nYoung Men's Clothing<br />\nand Furnishings<br />\n<br />\nAre made a special feature of<br />\nhere.<br />\ncountry represented in the N. R.<br />\nA., was entered in the contest.<br />\nGive us a call and let us become<br />\nThese matches will be held weekly<br />\nbetter acquainted for mutual<br />\nfor a period of two months and at<br />\nbenefit.<br />\nthe end of that time the total scores<br />\nwill be compiled and the colleges<br />\nwill be ranked from these results.<br />\nThe scores of the other colleges<br />\nwhich shot in the last meet will not<br />\nbe known for some time.<br />\nThe score of the Hopkins team:<br />\nHoward at Lexington<br />\nSitting Prone Total<br />\n197<br />\n99<br />\n98<br />\nRuoff<br />\nJ. F. APPLE CO.<br />\n195<br />\n97<br />\n98<br />\nSherwood<br />\nLancaster, Pa.<br />\n193<br />\n97<br />\n96<br />\nMount<br />\nMANUFACTURING JEWELERS<br />\n192<br />\n97<br />\n95<br />\nI.'Allemand<br />\nMakers of Hopkins Jewelry.<br />\n187<br />\n98<br />\n89<br />\nSalter<br />\nSpecial Designs and Prices<br />\n<br />\nSTEWART& O.<br />\nCC4CoNtearon WU/..r.mrs 11.6-Crurg<br />\n<br />\n488<br />\n<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\n<br />\nOur<br />\n<br />\nHopkins finishes second to Pennsylvania in open events of Hopkins-Fifth Regiment meet. Weeks,<br />\ncf Hopkins, captures first in open<br />\nand South Atlantic mile. In Hopkins' interfraternity rellay-, Alpha<br />\nHER HANDWRITING!<br />\nDelta Phi finished first and Beta<br />\nDo you know that you can know her<br />\nTheta Pi a close second.<br />\ncharacter through her handwriting if<br />\npaper?<br />\nEx-President Taft speaks at you send us ten lines on unruled<br />\n3 for $1.00<br />\n$ .50 each<br />\nforty-first commemoration.<br />\nThe Boston Graphological<br />\nTHREE YEARS AGO<br />\nSociety<br />\n<br />\n476<br />\n<br />\nClothes if Cusiom (pluality.<br />\nCharles Street.<br />\n<br />\nThe Johns Hopkins<br />\n<br />\nTEN YEARS AGO<br />\nFebruary 22, 1911<br />\n<br />\nDr. George E. Vincent, president<br />\nof Rockefeller Foundation, delivers address at Commemoration<br />\nDay exercises. School of Hygiene<br />\nFIRST N. R. A. I. SHOOTING MEET and Public Health formally opened.<br />\nHELD<br />\nIn the first of a series of ten Na-<br />\n<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nCo..NIP Tort<br />\n<br />\nWrite for<br />\nCall at University P. 0. for<br />\n964<br />\nInformation.<br />\n<br />\nof Philosophy.<br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nPublic Health.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nor of Science. Also for graduates in Medicine.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\n<br />\nJOHNS HOPKINS PRESS PUBLICATIONS.<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nHOPKINS MILE RELAY TEAM<br />\nSHATTERS RECORD IN<br />\nGOTHAM<br />\nFast Time of 3.32 2-5 Sets New Indoor<br />\nRecord for Hopkins. N. Y. U.<br />\nBeaten by Two Yards.<br />\n<br />\nLast Saturday night, February<br />\n18, the varsity mile relay team<br />\n301 N. CHARLES ST.<br />\nsmashed the University indoor recBaltimore, Md.<br />\nord while competing in the annual<br />\nathletic carnival of the Wilco Athletic Association of New York<br />\nCity. The Hopkins quartet, composed of Captain Joe Thompson,<br />\nRandy Norwood, Bob Skinner and<br />\nRidg. Edwards, negotiated their<br />\ndistance in the record time of 3<br />\nminutes 32 3-5 seconds. The event,<br />\nibeXatterif<br />\nCl<br />\n‘frIZS<br />\nOSCAR G.1-- which was an intercollegiate one<br />\nOWN<br />\nmile, scratch, special invitation reDE7..11*E<br />\n'<br />\nV*C<br />\nriln 141P<br />\nlay, was the climax of a series of<br />\n29 Baltimore St., East<br />\nthrilling,<br />\nrecord-making<br />\nraces<br />\nOne Door West of Light St.<br />\nwhich<br />\nhad<br />\nkept<br />\nthe<br />\ngreat<br />\ncrowd<br />\nof<br />\nBOLE AGENTS FOR BALTIMORE<br />\nspectators at a high pitch of enFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nthusiasm all evening.<br />\nWith New York University a<br />\nThe Chas. Wilhns Surgical<br />\nclose second, contested bitterly by<br />\nInstrument Co.<br />\nZOO N. HOWARD ST., Baltimore, Md. Bowdoin College, which finished<br />\nSURGICAL INSTRUMENTS<br />\nthird, the Homewood sprinters<br />\nMicroscopes and Supplies,<br />\nwere compellel to fight for the race<br />\nStethoscopes<br />\nBlood Lancets at every stage. Joe Thompson,<br />\nBlood Counters<br />\nstarting for Hopkins, got off to a<br />\nfast start and led the first men of<br />\nthe other colleges at a fast pace<br />\nPrinters of Philological and<br />\nfor 350 yards. At this point in his<br />\nScientific Works<br />\nrelay, he cut loose and left his op23 S. HANOVER ST.<br />\nponents several yards behind on<br />\nBaltimore, Md.<br />\nthe home stretch and succeeding in<br />\ngiving the second Hopkins performer a good send-off. The second man for New York University<br />\nset out with determination to put<br />\nhis team in the lead, but he only<br />\nsucceeded in viewing Norwood's<br />\nheels for the entire 440 yards. Bob<br />\nSkinner, who took the baton from<br />\nNorwood, was compelled to fight<br />\nhard<br />\nfrom start to finish, but he<br />\n17 E. Baltimore St.<br />\nmaintained Hopkins' lead and ended up with a whirlwind finish,<br />\nPrinters of the<br />\nwhich started Ridge Edwards, the<br />\nJohns Hopkins News-Letter<br />\n\"blonde flash,\" on the final leg of<br />\nthe journey with a slight advantage. The N. Y. U anchor man<br />\nstarted out as if he intended to run<br />\na hundred yard dash and swept past<br />\nEdwards at the end of the first 220<br />\nyards. He failed, however, to judge<br />\nthe ability of the Hopkins star,<br />\nwho, just at the right moment,<br />\nstarted out on his characteristic<br />\nfinal sprint so well known to Hopkins men, and with a beautiful exhibition of final reserve power beat<br />\nout the N. Y. U. man a few yards<br />\nCollege Literature<br />\nin front of the tape and brought<br />\nLOMBARD and SOUTH STREETS victory to the Hopkins team. The<br />\nexcellent indoor time of 3.32 2-5<br />\nmade by the team beats the old<br />\nHopkins record of 3.35 by 2 3-5<br />\nseconds.<br />\nTeach a Lesson in Style<br />\nImporters and Dealers in Fine Books<br />\n<br />\nMt. Vernon 4999<br />\n<br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br />\n<br />\nElkridge Farms Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br />\n<br />\nEllicott City 231-R<br />\n<br />\nDo you know how best to provide<br />\nan income for your old age?<br />\nConsult with<br />\n<br />\nth<br />\n<br />\nB:<br />\n<br />\nOnly four words<br />\nhut they tell our whole story.<br />\n<br />\nYc<br />\ncl:<br />\n<br />\nth<br />\n<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\n<br />\nSF<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\n<br />\nec<br />\nth<br />\n<br />\nCOGGINS'<br />\nTransfer and Baggage Express<br />\nAUTOMOBILE SERVICE<br />\n<br />\nPHONE, HOMEWOOD 2645-W<br />\n<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\nPT<br />\n<br />\nC1<br />\n<br />\nThe Episcopal Church of<br />\n<br />\nfl<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:--DINNER<br />\n11:30 until 7:30<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\n<br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\n<br />\nDANCES Morning Service, II o'clock<br />\nEvening Service, 8 o'clock<br />\n<br />\nTelephone St. Paul 6987<br />\n<br />\nURNER'S<br />\n<br />\nar<br />\n<br />\nMEN'S SHOES<br />\n<br />\nre<br />\n<br />\nSt:<br />\n<br />\nOf the Better Class<br />\n<br />\nURNER BROTHERS<br />\n<br />\nSpecial Invitation to Hopkins Students<br />\n<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nfT<br />\n<br />\nth<br />\n<br />\nMURAD<br />\nTHE TURKISH CIGARETTE<br />\n<br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br />\n<br />\nCHRISTIAN SERVICE CLUB MEETS<br />\n<br />\nAt a recent meeting of the Christian Service Club, the members of<br />\nthe club decided to back up the StuN. HESS' SONS<br />\ndent Friendship Fund in its drive<br />\n8 E. BALTIMORE ST.<br />\nfor $250 in this University.<br />\nRoberts, a member of the club,<br />\nSHOES<br />\ngave a short talk on the results of<br />\nir<br />\nMartin Luther's ministry. This<br />\nUNIVERSITY MEN<br />\nwas followed by a general discusFor Sport Wear sion of the different leaders of the<br />\nFor Dress<br />\nSmart Styles—Best Leathers Reformation.<br />\nModerate Price:,<br />\nA committee was appointed to<br />\nchoose members of the club who<br />\nwill give short talks on certain periods of the growth of the church<br />\n19 W. LEXINGTON ST.<br />\nfrom the time of St. Paul up to the<br />\npresent. The aim of this is to acquaint the members of the club<br />\nwith the relative importance of the<br />\nmovements of the Reformation and<br />\nMADE TO ORDER<br />\nthe<br />\ntime which they took place.<br />\nAND<br />\nG.<br />\nConning was elected treasurFINISHED CLOTHES<br />\nei of the club to fill the place left<br />\nPLAZA BUILDING<br />\nvacant by the resignation of<br />\nWheeler.<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\nGOOD CLOTHES<br />\nNOTHING ELSE<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\n<br />\nHess Shoes<br />\n<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nW. W. WALKER<br />\n909 Calvert Bldg. St. Paul 2581<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nCLOTHES<br />\n<br />\nCIGARETT<br />\n1\"Vt<br />\nESPECAALW FOR<br />\nDISCRIM1RATIIAGpDEXPER1EVIC<br />\nARE MADE<br />\nGRADE_<br />\n1-11GVI<br />\nSMOKER OF CAGARETTES<br />\nI1)PKISti<br />\n<br />\nIheblexOnt<br />\nisexcel)tioNA<br />\n<br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br />\n<br />\nOr<br />\n<br />\n11<br />\n<br />\n2!<br />\n<br />\ng(<br />\nni<br />\n<br />\n2.<br />\n<br />\n(<br />\nS<br />\n<br />\nSt<br />\n<br />\nCi<br />\n<br />\nCl<br />\n<br />\n1<br />\n<br />\nWYMAN<br />\n<br />\n\"Judge for Yourself—!\"<br />\n<br />\nLEMMERT<br />\n<br />\nOs<br />\n<br />\n.<br />\n160200 Maienffitelitheightkiii<br />\n<br />\n\f", "format": "basic_html", "processed": "BALTIMORE, MD., FEBRUARY 24, 1922<br /><br />\nVOL. XXVI. No 33<br /><br />\nBLACK AND BLUE MERMEN<br />\nMR. KISTLER TO COACH<br />\nSTAGE SET FOR ANNUAL<br />\nTO SWIM RUTGERS IN<br />\nDUELLERS<br />\nDRAMATIC<br />\nCLUB<br />\nJOHNS HOPKINS FIFTH<br />\nDUAL MEET<br />\nREGIMENT GAMES<br />\nCoach Swindell Obtains Services of a<br />\nBooth To Meet Crawford in 1,000-yard<br />\nSpecial. Hopkins Mile Relay<br />\nTo Meet Virginia.<br /><br />\nFormer Instructor to Help the<br />\nSwordsmen.<br /><br />\nNew Jersey College Represented by<br />\nStrong Team. Were Defeated by<br />\nLehigh Tankmen.<br /><br />\nPRICE 5 CENTS<br /><br />\nTwelve Degrees Conferred At<br />\nCommemoration<br /><br />\nCALVIN COOLIDGE DELIV- PRESIDENT GOODNOW CRITIIn an effort to present, as near<br />\nCIZES PRESENT-DAY<br />\nERS CHIEF ADDRESS<br />\nThe Johns Hopkins swimming<br />\nEDUCATION<br />\nWhen the curtain rises tomorrow as possible, a perfect duel scene in<br />\nVice President Defends Arms Confernight on the fifteenth annual Johns Act 1 of the Dramatic Club's pro- team will journey to New Bruns- ence in Contrast With the League of Announcement Made of Increase of<br />\nEndowment to Seventeen<br />\nHopkins-Fifth Regiment indoor duction, \"If I Were King,\" Coach wick tomorrow to meet the Rut- Nations. Upholds Four Power Treaty.<br />\nMillion.<br />\nViceCoolidge,<br />\nCalvin<br />\nHon.<br />\ngames, the greatest collection of Walter B. Swindell has enlisted the<br />\ngers team in the latter's tank. UnUniversity held<br />\nHopkins<br />\nJohns<br />\nPresident of the United States, aftrack and field stars ever assem- services of Mr. Kistler, business<br />\ndaunted by the decisive defeat ter having the degree of Doctor of its annual Commemoration Day exbled in Baltimore will be brought manager of Athletics and former<br />\nto the starting line. Nearly all of fencing instructor at the Univer- handed down by the Columbia nata- Laws conferred upon him, made ercises—its forty-sixth anniversary<br />\ntors, the Black and Blue team in- the principal address at the anni- celebration—at the Lyric Theatre,<br />\nthe Eastern collegiate stars will be sity.<br />\nAct I, the longest of the four-act tends to make a strong bid in wrest- versary day exercises of the Uni- Wednesday morning. The trusseen in one or more events. An<br />\ndrama,<br />\nhas been practically com- ing the laurels from the New Jer- versity last Wednesday. His speech tees, faculty members and alumni<br />\nrunners<br />\nof<br />\nfield<br />\nespecially brilliant<br />\nwork has been comwas an ardent appeal to patriotism<br />\nand<br />\npleted,<br />\nSpeClub<br />\nhas entered the Varsity<br />\nsey lads.<br />\nWith<br />\nfine sturdy Americanism, with- assembled in a body in the foyer,<br />\nand<br />\nact.<br />\nsecond<br />\nupon<br />\nthe<br />\nmenced<br />\ncial invitation 1,000-yard race.<br />\ninEastern<br />\nRutgers,<br />\nlast<br />\nyear's<br />\nout that frequept spirit of narrow- the doctors wearing their official<br />\nBooth, of Hopkins, who ran a dead but four weeks remaining in which<br />\ngowns, the vivid colors of whose<br />\nheat with Bob Crawford, of Lafay- to whip the play into shape, the tercollegiate champions, is again minded nationalism.<br />\nsketch<br />\nhistorical<br />\nAfter<br />\ngiving<br />\nan<br />\ncall<br />\nfive<br />\nexceptionally<br />\nrepresented by an<br />\nhoods contrasted with the sombre<br />\nette, in the two-mile last spring, coach has been forced to<br />\nWill again set off in company with rehearsals a week. Mr. Swindell is strong team. They were defeated cf the colonies and of the events black robes. The exercises opened<br />\nthe Lafayette flyer: -Curtis, of a graduate of Hopkins, Class of by the crack swimmers represent- which fixed Washington in his with the entrance of the impressive<br />\n'Navy ; Helfrich and Shields, of 1901, and is giving his services to ing Navy this season, but they suc- place of immortality, he discussed procession, at the head of which<br />\nthe significance of the Arms ConPenn State; Rick, of Princeton, the club free of charge. He beceeded in making the best score ference to world relationships.<br />\nwalked President Goodnow, acand Hayes, of University of Pitts- lieves that \"If I Were King\" will<br />\nagainst<br />\nthe<br />\nDefending the four-power treaty companied by Mr. Coolidge.<br />\nburgh, will also start in this same be the most successful play ever which has been made<br />\nGiebel,<br />\nof<br />\ncontrasted with the League of<br />\nfuture<br />\nsailors<br />\nthis<br />\nyear.<br />\nclub.<br />\nas<br />\nAs chaplain of the day, Archthe<br />\nby<br />\ngiven<br />\nAmerevent. Shields was the first<br />\nof<br />\nreign<br />\nsaid:<br />\nNations,<br />\nhe<br />\nthe<br />\nin<br />\nlaid<br />\nis<br />\nplay<br />\nThe<br />\nRutgers, well known to Baltimorican to finish in the 1,500 metre<br />\nbishop Michael Curley delivered<br />\nrun at Antwerp, and Rick ran a Louis XI in the city of Paris. Much eans because of his excellent show- \"No one doubts that the dele- the invocation. Dr. Goodnow preclose second to Joie Ray a few care is being exercised in the se- ing at the championships here last gates to the Paris Conference were sided and the chief feature of the<br />\ninspired by that noble ideal. Amid<br />\nWeeks ago, when the latter set a lection of costumes and other prop- year, defeated<br />\nSinclair,<br />\nof<br />\nNavy,<br />\nwill<br />\nbe<br />\nthere<br />\nall the contending elements they ceremonies was his conferring of<br />\nnew record for the one and one- erties. In order that<br />\n220.<br />\nin<br />\nthe<br />\nSinclair<br />\nholds<br />\nthe<br />\ncolplay<br />\nfailed to propose a plan which har- degrees. Vice-President Coolidge<br />\nno anachronisms and that the<br />\nhalf mile.<br />\nmonized with the spirit of Amer- was given the honorary degree of<br />\nSome of the most interesting of will be historically correct, the ser- legiate record for this event.<br />\nauthorEveryone knows that the Doctor of Laws. Degrees were<br />\nan<br />\nica.<br />\nVincent,<br />\nas<br />\nDr.<br />\nof<br />\nvices<br />\nHopkins<br />\nwas<br />\nnosed<br />\nout<br />\nthe<br />\npreS.<br />\nNaval<br />\nU.<br />\nare<br />\nthe relay races<br />\nbeen<br />\nAmerican<br />\nsoul longed to establish then<br />\nhave<br />\nhistory,<br />\nMediaeval<br />\non<br />\nity<br />\nin<br />\na<br />\nAcademy versus Penn State<br />\nvious week by Lehigh, losing by a<br />\nconferred upon twelve stuwhich held the promise<br />\ncondition<br />\na<br />\nsought.<br />\nmedley race; Princeton versus<br />\n36-35 score. Rutgers, however,<br />\ndents, as follows: Doctor of Medof a permanent peace, buts its ideal<br />\nThe play, which originally served<br />\nMassachusetts Institute of TechLehigh<br />\nby<br />\nwas<br />\ndecisively<br />\ndefeated<br />\nicine,<br />\nKo Chin Sun; Doctor of Pubwas for a peace not imposed by the<br />\nnology in a mile; Georgetown ver- as a starring vehicle for E. H.<br />\nmeet<br />\nin<br />\nSaturday,<br />\n42-29,<br />\nin<br />\na<br />\nlast<br />\nmajor forces of the world from lic Health, Dr. Rufino Anrial ; Docsus Fordham in a one-mile Cath- Southern, calls for a great deal of<br />\nwhich<br />\nexcellent<br />\ntimes<br />\nwere<br />\nmade.<br />\nbut maintained by the tor of Philosophy, William Enginterest<br />\nwithout,<br />\nholds<br />\nthe<br />\nand<br />\nfine<br />\nacting<br />\nolic intercollegiate relay; Johns<br />\nIn<br />\nthis<br />\nbroke<br />\nmeet,<br />\nthe<br />\nGiebel<br />\nEastinUnusual<br />\nof the world from lish, Jr., Johannes Mattern. Lawmoral<br />\npower<br />\nfinish.<br />\nHopkins versus Carnegie Tech in from start to<br />\nern<br />\ncollegiate<br />\nrecord<br />\nfor<br />\n-the<br />\nluO,<br />\nthe<br />\nby<br />\nwithin.\"<br />\nrence Opdycke, and Charles C.<br />\na medley; Johns Hopkins Reserves terest lis* been displayed<br />\ncovering the distance in 59 seconds. He continued by saying that Thatch; Doctor of Science in Hyconit<br />\nis<br />\nand<br />\nclub,<br />\nthe<br />\nfollowers<br />\nof<br />\nBaltimore<br />\nand<br />\nGallaudet<br />\nversus<br />\narmon, of Lehigh, bettered the when the Washington Conference giene, J. R. Minor; Master of Civil<br />\nCity College versus Baltimore Poly sequently believed that the demand<br />\nrecord<br />\nfor the 220 by 8 3-5 sec- was called men had decided that Engineering, G. T. Bryan, Jr.;<br />\nThe record-breaking Hopkins mile for tickets will be very great. _<br />\nrelay team of the Wilco A. A. There will be two performances onds, negotiating the distance in 2 the most feasible way of securing Bachelor of Arts, E. T. Cline and<br />\ngames will compete against Uni- given, one each on the nights of minutes and 37 seconds. Coady de- peace was by making the necessary C. D. Ebaugh ; Bachelor of Science,<br />\nversity of Virginia and Washing- March 27 and 28, at the Lyric The- feated Harmon in the Hopkins-Le- sacrifices to remove some of the J. C. Taylor.<br />\nton and Lee in the Smith Atlantic. atre. The stage, being the largest high meet by one-quarter of the causes of war.<br />\nDr. Goodnow made the Presi\"It was not merely the voice of dent's annual address. He critiin the city, will afford much great- length of the pool.<br />\nindoor mile relay event.<br />\nIn addition to the intercollegiate er floor space for the large cast- In the breast stroke, Gangwere, one man or one party or one ad- cised severely the Maryland State<br />\nevents, there will be a number of which will occupy the limelight in of Lehigh, defeated the Rutgers en- ministration, but the true voice of law which obliges the University,<br />\ntrants. Gangwere was easily de- America which proposed the scrap- as a state-aided institution, to acOpen handicap and interscholastic the first act.<br />\nfeated<br />\nhere in this event by \"Davvy\" ping of thirty capital ships, limita- cept without further examination<br />\nshortly<br />\nTickets will be on sale<br />\nraces in which it is expected that<br />\nRowland.<br />\nBoth Lehigh entrants tion upon the use of submarines, the graduates of all approved high<br />\nsome records will be broken. Clark and will be obtainable from any<br />\ndefeated Galbraith, of Rutgers, in . . . the abolition.of poison gas, ... schools. The law has become the<br />\nand Aaronson, of Hopkins, are ex- member of the cast.<br />\nthe<br />\nclub,<br />\ndive, while Coady, of Hopkins, the proposal of the Four-power source of the waste of much time,<br />\nmeeting<br />\nof<br />\nthe<br />\nthe<br />\nlast<br />\nAt<br />\npected to place in the dashes. The<br />\neasily<br />\nMiss<br />\ndefeated the Lehigh divers Treaty.\"<br />\nof<br />\nappreciation<br />\nof<br />\nresolution<br />\na<br />\nboth to the University and to the<br />\n100-yard high hurdles should furin<br />\nthis<br />\nwas<br />\nevent.<br />\n\"America<br />\nyears<br />\ncOnclusion,<br />\nhe<br />\nsaid:<br />\nin<br />\npast<br />\nIn<br />\nservices<br />\nWalters'<br />\nmany<br />\nstudents sent to college inadnish plenty of excitement when<br />\nOwing to a misunderstanding of stands ready to bear its share of equately prepared and who cannot<br />\nalso exTrowbridge, winner of the Eng- passed. The resolutiOn<br />\nlish 126 high hurdle championship pressed the club's sympathy and the schedule, the Black and Blue the burdens of the world, but it be dropped until the end of their<br />\nof 1920, meets ifile, of Penn State. sincere hope that she would have a had intended to meet Rutgers last cannot live the life of other peo- first half year. This situation ofLast year Hopkins won the speedy recovery from her present Saturday, swimming two meets in ples; it cannot remove from them fers an alarming handicap to the<br />\nmeet. The team this year, devel- sickness. A large bouquet of flow- one day. Matters were adjusted, the necessity of working out their University which is facing the<br />\nalong with. a however, and the New Jersey lads own destiny. It recognizes their problem of limiting its undergrad°Ped by Coach Le Cato, is known ers were sent to her<br />\nwill be met tomorrow as per sched- independence and the right to es- uate student body.<br />\nto be much stronger than it was copy of the resolution.<br />\nule. The Hopkins swimmers are tablish their own form of governDr. Goodnow then deplored the<br />\nat the same time last -year, and acAmerica<br />\nwill<br />\njoin<br />\nanxious<br />\nto<br />\nrevenge<br />\nlast<br />\nment,<br />\nbut<br />\nno<br />\nnayear's<br />\nde\"democracy\"<br />\nor \"the submergence<br />\ncording to all predictions it should<br />\nMUSICAL CLUB CONCERT AT<br />\nfeat<br />\nand<br />\nfrom<br />\nall<br />\ndestroying<br />\nwhat<br />\nit<br />\nbelieves<br />\ntion<br />\nin<br />\nindications<br />\nthey<br />\nof<br />\nthe<br />\nelite in the mediocre\" of<br />\nbe able to bring the team trophy<br />\nWESTERN TONIGHT<br />\nshould turn the tables on the New ought to be preserved or in profan- higher educational tendencies. \"As<br />\nback to Homewood. The meet will<br />\nThe Musical Clubs have started Brunswick team. A clean-cut vic- ing what it believes ought to be held<br />\ncompared with higher education in<br />\nProbably continue until some time<br />\non their program of concerts where tory would do much to erase the sacred. We are at peace with all Europe,<br />\nAmerican higher educanear midnight.<br />\nthey left off before the exams. A memory of the two extremely peoples. We do not deny our duty tion is conspicuously lacking in any<br />\nconcert will be given at Western clost4 meets recently lost by the to continue the making of sacri- serious attempts to devote all the<br />\nfices for the welfare of the world. attention of which they are in need<br />\nHigh School tonight, February 24; Black and Blue. BLACK AND BLUE JAY<br />\nThe<br />\nmen<br />\nprobably<br />\nfollowing<br />\nwill<br />\nIt is not alone for their sake but to the comparatively few bright<br />\nRECOGNIZED<br />\none at the State Normal School on<br />\nrepresent Hopkins in the meet:<br />\nfor our own sake that we would minds which should be nurtured as<br />\nThe Johns Hopkins Black and March 3, and one at Annapolis on<br />\nRelay—Coady, Rowland, Buhr- pursue that course. We have adopt- the most precious treasures of our<br />\nMarch 13. These concerts will be<br />\n81ue Jay has received public reced toward the world the policy of intellectual life. The desire which<br />\nfollowed by dances, the music be- er, (Morrell or Lord).<br />\nognition at the hands of one of the ing furnished by the Student Jazz<br />\nPlunge—Hambleton.<br />\nWashington, not of repression, not is so characteristic of this demo50-yard Dash—Buhrer, Row- of dictation, not of coercion, not of cratic country to afford to all equal<br />\ncurrent humorous periodicals. Each Orchestra.<br />\nimperialism, but a policy of co-op- opportunity should not be permitweek Judge has a page composed<br />\nLater in the spring, concerts will land.<br />\nFancy<br />\nDive—Coady.<br />\neration, relieving distress, of for- ted to put serious obstacles in the<br />\nUniversity,'Gouchof exchanges from the various col- b2 given at the<br />\n100-yard<br />\nDash—Buhrer,<br />\nJohnbearance, of helpfulness, of sym- way of developing those leaders<br />\nlege publications, under the cap- er, Lehman's Hall and probably at<br />\nston.<br />\npathy,<br />\nof forgiveness—a policy without whom the progress of our<br />\nEastern High and City College.<br />\ntion of \"With the College Wits.\"<br />\nDash—Coady,<br />\n220-yard<br />\nLord.<br />\nwhich is first of all American, but civilization is all but impossible.\"<br />\nThe club is expecting to take a trip<br />\nIn their issue of February 14, exBreast Stroke—Rowland, Dun- a policy above all, of faith in the<br />\nDr. Goodnow pointed out that<br />\nto the Eastern Shore to give a conchanges from the Black and Blue cert at Easton. The dates fo,r these ning or Buhrer.<br />\nsanction of the universal conscience to keep abreast of the great inJay occupied over a quarter of the concerts have not been definitely<br />\nBack Stroke—Hambleton, Mor- of mankind. That sanction is crease in the number of students<br />\nrell.<br />\neternal.<br />\ndecided upon.<br />\n1 ge.<br />\nContinued on page 2, col. 5<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br /><br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22.<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nJunior Editors:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nENGINEERING LECTURES<br /><br />\nPublic lectures on engineering<br />\npractice have been arranged by the<br />\nEngineering School to take the<br />\nplace of the J. E. Aldred series,<br />\nwhich has been discontinued this<br />\nyear .<br />\nThe new course will be similar<br />\nin purpose anti method to the Aldred lectures, although only four addresses will be given. The lectures<br />\nare designed principally to supplement the engineering course for<br />\nundergraduate students.<br />\nThe addresses, which will be held<br />\nat 4.15 o'clock in the C. E. Hall,<br />\nare as follows:<br />\nMarch 8—\"Construction of the<br />\nCatskill water supply for the City<br />\nof New York,\" by J. Waldo Smith,<br /><br />\nchief engineer of the Board of Water Supply, New York City.<br />\nMarch 15-,—\"Some Results of the<br />\nWar on Engineering Research,\" by<br />\nC. E. Skinner, manager of the research department of the Westinghouse Electric Company, East Pittsburgh, Pa.<br />\nMarch 22—\"Engineering Problems Involving Atmospheric Pressure,\" by W. H. Carrier, president<br />\nof the Carrier Engineering Corporation, Newark, N. J.<br />\nMarch 29 — \"Magnesium, Its<br />\nManufacture and Use,\" by 1.V. G.<br />\nHarvey, vice-president and superintendent of the American Magnesium Corporation, Niagara Falls,<br />\nN.Y.<br /><br />\nPRESIDENT GOODNOW CRITICIZES PRESENT-DAY<br />\nEDUCATION<br />\n.<br />\nContinued from page 1,<br /><br />\nwhich may reasonably be expected,<br />\nthere must be expansion of plant<br />\nand increase of endowment, or limitation of numbers. However, many<br />\nlarge contributions have been made<br />\nduring the past year for the endowment of the Medical School.<br />\nThe total fund of $14,681,350 in<br />\nJune, 1920, has increased to date<br />\nt3 $17,000,000. He added that it<br />\nis imperative that a chemical laboratory be built very soon at Homewood. Also, the new dormitories<br />\nwill be completed by the fall of<br />\n1924, if not before.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br /><br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., FEBRUARY 24, 1922<br /><br />\nSTUDENT COUNCIL<br />\nis delighted to announce that the Student Coun-<br /><br />\nTHE NEWS-LETTER<br /><br />\nci t will from now on be unaffected by the black list. While this exempti )n does not apply to men who flunk out and are reinstated, it is all that<br /><br />\n,uld be expected or requested. This is only one of the many instances<br />\nin which the Faculty have shown themselves open to reason in regards<br /><br />\nto matters of importance to the student welfare, and their action should<br />\n) much to increase the efficiency of the Council.<br /><br />\nA BOOST, SENIORS<br />\nThe Seniors also come in for their mead of praise. Their dance<br />\nIs a wonderful success. The decorations played no small part in their<br />\ntriumph, although good music and refreshments, and attractive girls,<br />\nCOntributed<br /><br />\ntheir share.<br /><br />\nMr. Badillo, and those that assisted him,<br /><br />\ndeserve the praise of every member of the class, for through their work<br />\nand ability the C. E. Hall was changed into a veritable art gallery.<br />\nWe do not set ourselves up as art critics and we, therefore, quote<br />\n!an Latane, whose arrival momentarily flabbergasted the decorators.<br />\nA 'ter viewing with interest and amusement the varied decorations, and<br />\nca -efully studying the caricature of himself he is reported to have said<br />\nth it it \"was a real art collection,\" and that he had seen much worse<br />\nat the Vagabond Theatre.<br />\nSince the Dean really meant this as a compliment, we trust that<br /><br />\nKeeping faith<br />\nwith the<br />\nSMOKER<br />\nOur lifelong knowledge of choice<br />\ntobaccos, our years of manufacturing<br />\nexperience and our up-to-date facilities<br />\nare concentrated on making CAMELS<br />\nthe finest cigarette that can be produced.<br />\nInto THIS ONE BRAND we put the<br />\nUTMOST QUALITY. A better cigarette<br />\ncannot be made—even for a higher price.<br />\nCAMELis THE QUALITY CIGARETTE<br />\nmade for men who think for themselves<br />\n—for folks who appreciate really fine<br />\ntobacco.<br />\nONE BRAND—ONE QUALITY ONE<br />\nSIZE PACKAGE.<br /><br />\nth! artists will not be insulted.<br /><br />\nThat is the way we keep faith with the<br />\nsmoker.<br />\nCONGRATULATIONS, BLUE JAY!<br />\nTHE NEWS-LETTER<br /><br />\nth<br /><br />\nwishes to take this opportunity to congratulate<br /><br />\nBlue Jay upon its rapid improvement.<br /><br />\nThe magazine has taken<br /><br />\nfrr !at strides in the last year, and with proper support will soon arrive<br />\nat a place of distinction among the college comics.<br />\nThe fact that the Jay is already featuring largely in exchanges has<br /><br />\namel<br /><br />\nha 1 jokes in the Literary Digest several times, and in a recent issue of<br />\nfit ige<br /><br />\nmade up half of the \"College Wits\" page, is proof that the<br /><br />\nmagazine is obtaining recognition in the outside world.<br /><br />\nR. J. ILLYNOLD5 TOSACCO CO., Winatan•Salm, W.at<br />\n....•11111OINIMMMINEMBIF<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br />\nITI-<br /><br />\nlant<br />\nlimtany<br />\nlade<br />\nenool.<br />\n1 in<br />\nlate<br />\nt it<br />\nlabmeries<br />\nof<br /><br />\nNOTICES<br />\nNOTICE TO NEWS-LETTER<br />\nREADERS<br /><br />\nThe business office urgently<br />\nneeds copies of the Sidney Lanier<br />\nissue, No. 28, January 31. Anyone having one is requested to<br />\nbring it to the Post Office or the<br />\nNEWS-LETTER office immediately,<br />\nSENIORS<br /><br />\nAll class dues must be paid by<br />\nMarch 1, 1922. The treasurer will<br />\nbe at the Hullabaloo office in the<br />\nEarn, daily, from February 23 to<br />\nMarch 1, inclusive, from 11:30 A.<br />\nM. to 1 :30 P. M.<br />\nSOCIAL SCIENCE CLUB MEETING<br /><br />\nThere will be a meeting of the<br />\nSocial Science Club today at 2:30,<br />\nin Room 113, Gilman Hall. A discussion on \"Nationalism vs. Internationalism\" will be held.<br />\nBUSINESS CANDIDATES DRAMATIC<br />\nCLUB<br /><br />\nCandidates for the _position of<br />\nbusiness manager of the Dramatic<br />\nClub will report at the Barn tomorrow at 2 P. M.<br />\nBOB SKINNER ELECTED VICEPRESIDENT OF FRESHMAN<br />\nCLASS<br /><br />\nThe first meeting of the Freshman Class was held Tuesday, at<br />\n12:30, in the auditorium of the<br />\nCivil Engineering Building. After<br />\ncalling the meeting to order, President Page O'Connor announced<br />\nthat plans for the banquet were being arranged. After this a vote was<br />\ntaken to see how many of the members of the class desired pins, but,<br />\nas there were so very many who<br />\ndidn't want them, it was decided<br />\n\"to let the matter slide until next<br />\nyear.\" Treasurer \"Bill\" Norris<br />\nthen announced that a plan had<br />\nb(:.en devised for collecting the dues<br />\n\"Toots\" Darley, of the Engineering School, and Gedige Hess, of<br />\nthe Academic Department, are to<br />\nact as his assistants and are to keep<br />\nafter the Freshmen until the dues<br />\nare paid.<br />\nPresident O'Connor took the<br />\nchair again and announced that<br />\nnew officers would have to be elected to take the places of Spinney,<br />\nthe vice-president, and Westerman,<br />\nthe sergeant-at-arms, who had been<br />\ndropped from the University. Magill, Asendorf, \"Bob\" Skinner and<br />\n\"Ed\" Panneti were nominated for<br />\nvice-president. Post, Young and<br />\nRome were nominated. to fill the position of \"bouncer.\" Skinner was<br />\nelected vice-president. Post was<br />\nelected to the other office.<br /><br />\nTHE NEWS LETTER'S<br />\nSENIOR PROM DECLARED<br />\nMAILBAG<br />\nTHE GAYEST EVER HELD<br />\nAT HOPKINS<br />\nA Column in Which the Correspondents<br />\nDecorations Overshadow Anything of<br />\nthe Kind Ever Attempted. Spirit<br />\nof Jazz Unconfined.<br /><br />\nSurrounded by the most futuristic, impressionistic, cubistic, tapestries which ever adorned an otherwise solemn hall, the Class of<br />\n1922 unlimbered their studently<br />\nlimbs and gave themselves over to<br />\njoy unconfined and swayed themselves to thewierd strains of Seidenham's sorrow-killing orchestra of<br />\nseven pieces.<br />\nWith all thoughts of unhappy<br />\nexams behind them and caring little for the future, seventy-five<br />\ncouples threw their whole energies<br />\ninto the delightful pastime sponsored by the god Terpsichore; caring little for the harmful news-articles daily published by minds long<br />\nsince exhausted of other moneygetting material.<br />\nWith the \"King and Queen of<br />\nJazz\" beaming upon their disciples,<br />\nthe dance went on from 9:30 P. M.<br />\nuntil nearly 2 A. M., 'Wednesday<br />\nmorning.<br />\nThe decorations were by far the<br />\nmost impressive ever used at such<br />\nan affair. The personal ones Dean<br />\nLatane, Drs. Wood, French and<br />\nMitchell rivalled those of jazzier<br />\nsubjects, such as the \"Cave-man's<br />\nPetting Party,\" \"The Leg of Nations,\" \"Mrs. Salome,\" the \"First<br />\nShimmy,\" etc.<br />\nThe patrons and patronesses<br />\nwere: Dr. Frank J. Goodnow, Dean<br />\nand Mrs. John B. Whitehead, Professor and Mrs. Knight Dunlap,<br />\nMr. and Mrs. Robertson Griswold,<br />\nDr. and Mrs. Ronald T. Abercrombie, Professor and Mrs. J. H. Gregory, Dr. and Mrs. Luther M. Parsons, Dr. and Mrs. Ray Van Orman and Mrs. Christopher Johnson.<br /><br />\ntional Rifle Association Intercollegiate Matches, which was held on<br />\nWednesday, February 16, the Hopkins team scored 964 out of a possible 1,000. The team which shot<br />\nIii this match was composed of Captain Salter, Ruoff, Sherwood,<br />\nMount and L'Allemand. Each man<br />\nfired 10 shots sitting and 10 prone<br />\nfor a possible score of 200. While<br />\nthe scores were not as good as those<br />\nmade in recent dual meets, the total was considered very encouraging, inasmuch as the rules which<br />\napplied in this match are much<br />\nmore rigorous.<br />\nIn the same meet, a five-man<br />\nteam from each university in the<br /><br />\nADVERTISE HOPKINS!<br /><br />\nEditor of NEWS-LETTER.<br />\nDear Sir: In order to help our<br />\nuniversity by advertising it and<br />\nkeeping its name before the public,<br />\nlocally at least, I suggest that every<br />\nmotor vehicle operated by any person connected in any capacity with<br />\nthe university carry a suitable and<br />\ninexpensive Hopkins banner, pennant or emblem.<br />\nThe difficulty of carrying out<br />\nsuch an idea as this is that someone must start it and put it into the<br />\nform of a custom by making it<br />\npopular. With this in mind, our<br />\nMotorcycle Club is ready to take<br />\nthe lead and start the practice of<br />\ncarrying a Hopkins banner, pennant or emblem on its machines.<br />\nRespectfully yours,<br />\nEDWARD F. BUCHNER, JR.<br /><br />\nJoint Committee of Maryland<br />\nHouse and Senate inspect Homewood grounds, with view of establishing- technical school.<br />\nEleven Hopkins men to compete<br />\nin Georgetown games.<br />\nFIVE YEARS AGO<br />\nFEBRUARY 22, 1917<br /><br />\nFEBRUARY 22, 1919<br /><br />\nRECENT STADIUM ERECTIONS<br />\nELSEWHERE<br /><br />\nAre You Planning A<br /><br />\nORTMAN'S<br /><br />\nVACATION ABROAD?<br />\nIf So, Call on<br /><br />\nA. SCHUMACHER &amp; CO.<br /><br />\n\"Queen Quality\" Home Made<br />\nChocolates<br />\nVISIT OUR ICE CREAM PARLORS<br /><br />\nPASSENGER<br />\nAGENTS<br /><br />\n518 N. CHARLES ST.<br /><br />\nfor all<br />\nTrans-Atlantic Lines<br /><br />\nR. G. by &amp; Company<br /><br />\nCharles &amp; Redwood Sts.<br /><br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br /><br />\nChelsea Pharmacy<br />\nCharles and 22nd Sts.<br />\nDelicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nPrompt &amp; Efficient Service<br /><br />\nDRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br /><br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br /><br />\n-prep- room on<br /><br />\nthe<br /><br />\nthird floor specializes in<br />\nclothes for young men.<br /><br />\nAmerican universities which have<br />\ncompleted athletic stadiums within<br />\nthe decade, or have provided for<br />\ntheir construction, include California, Ohio State, Yale, Illinois,<br />\nBaltimore. Charles and Fayette<br />\nStanford, Chicago, Washington,<br />\nPrinceton, Kansas, Pittsburgh and<br />\nthe City College of New York. Of<br />\nthese, Yale's stadium cost $400,000<br />\nand seats 70,000; Washington spent<br />\n$600,000 and can seat 60,000; California is spending $900,000 to seat<br />\n60,000; Illinois is planning a combined stadium and amphitheater to<br />\ncost $2,500,000, and Ohio State<br />\nraised $1,250,000. No 'stadium yet<br />\ncompleted has been large enough<br />\nto meet the immediate demand for<br />\nseats. These facts, together with<br />\nth recent discussion by President<br />\nFORTY-SIXTH YEAR OF INSTRUCTION, 1921-22<br />\nLowell, of Harvard University, on<br />\nthe relationship of intercollegiate<br />\nathletics to the university, indicate<br />\nINSTRUCTION<br />\ntwo opposite trends which are likely to clash in the future.<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of Arts; Doctor<br /><br />\nHub<br /><br />\nUniversity<br /><br />\nBOX 201, BOSTON, MASS.<br /><br />\nYoung Men's Clothing<br />\nand Furnishings<br /><br />\nAre made a special feature of<br />\nhere.<br />\ncountry represented in the N. R.<br />\nA., was entered in the contest.<br />\nGive us a call and let us become<br />\nThese matches will be held weekly<br />\nbetter acquainted for mutual<br />\nfor a period of two months and at<br />\nbenefit.<br />\nthe end of that time the total scores<br />\nwill be compiled and the colleges<br />\nwill be ranked from these results.<br />\nThe scores of the other colleges<br />\nwhich shot in the last meet will not<br />\nbe known for some time.<br />\nThe score of the Hopkins team:<br />\nHoward at Lexington<br />\nSitting Prone Total<br />\n197<br />\n99<br />\n98<br />\nRuoff<br />\nJ. F. APPLE CO.<br />\n195<br />\n97<br />\n98<br />\nSherwood<br />\nLancaster, Pa.<br />\n193<br />\n97<br />\n96<br />\nMount<br />\nMANUFACTURING JEWELERS<br />\n192<br />\n97<br />\n95<br />\nI.'Allemand<br />\nMakers of Hopkins Jewelry.<br />\n187<br />\n98<br />\n89<br />\nSalter<br />\nSpecial Designs and Prices<br /><br />\nSTEWART&amp; O.<br />\nCC4CoNtearon WU/..r.mrs 11.6-Crurg<br /><br />\n488<br /><br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br /><br />\nOur<br /><br />\nHopkins finishes second to Pennsylvania in open events of Hopkins-Fifth Regiment meet. Weeks,<br />\ncf Hopkins, captures first in open<br />\nand South Atlantic mile. In Hopkins' interfraternity rellay-, Alpha<br />\nHER HANDWRITING!<br />\nDelta Phi finished first and Beta<br />\nDo you know that you can know her<br />\nTheta Pi a close second.<br />\ncharacter through her handwriting if<br />\npaper?<br />\nEx-President Taft speaks at you send us ten lines on unruled<br />\n3 for $1.00<br />\n$ .50 each<br />\nforty-first commemoration.<br />\nThe Boston Graphological<br />\nTHREE YEARS AGO<br />\nSociety<br /><br />\n476<br /><br />\nClothes if Cusiom (pluality.<br />\nCharles Street.<br /><br />\nThe Johns Hopkins<br /><br />\nTEN YEARS AGO<br />\nFebruary 22, 1911<br /><br />\nDr. George E. Vincent, president<br />\nof Rockefeller Foundation, delivers address at Commemoration<br />\nDay exercises. School of Hygiene<br />\nFIRST N. R. A. I. SHOOTING MEET and Public Health formally opened.<br />\nHELD<br />\nIn the first of a series of ten Na-<br /><br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nCo..NIP Tort<br /><br />\nWrite for<br />\nCall at University P. 0. for<br />\n964<br />\nInformation.<br /><br />\nof Philosophy.<br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of<br />\nEngineering; Bachelor of Engineering; Bachelor of Science in Chemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health;<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certificate in<br />\nPublic Health.<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of Arts<br />\nor of Science. Also for graduates in Medicine.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br /><br />\nJOHNS HOPKINS PRESS PUBLICATIONS.<br />\nSTATE BUREAUS: Geological Survey; Weather Service; Forestry.<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics and College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical Garden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 24, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nHOPKINS MILE RELAY TEAM<br />\nSHATTERS RECORD IN<br />\nGOTHAM<br />\nFast Time of 3.32 2-5 Sets New Indoor<br />\nRecord for Hopkins. N. Y. U.<br />\nBeaten by Two Yards.<br /><br />\nLast Saturday night, February<br />\n18, the varsity mile relay team<br />\n301 N. CHARLES ST.<br />\nsmashed the University indoor recBaltimore, Md.<br />\nord while competing in the annual<br />\nathletic carnival of the Wilco Athletic Association of New York<br />\nCity. The Hopkins quartet, composed of Captain Joe Thompson,<br />\nRandy Norwood, Bob Skinner and<br />\nRidg. Edwards, negotiated their<br />\ndistance in the record time of 3<br />\nminutes 32 3-5 seconds. The event,<br />\nibeXatterif<br />\nCl<br />\n‘frIZS<br />\nOSCAR G.1-- which was an intercollegiate one<br />\nOWN<br />\nmile, scratch, special invitation reDE7..11*E<br />\n'<br />\nV*C<br />\nriln 141P<br />\nlay, was the climax of a series of<br />\n29 Baltimore St., East<br />\nthrilling,<br />\nrecord-making<br />\nraces<br />\nOne Door West of Light St.<br />\nwhich<br />\nhad<br />\nkept<br />\nthe<br />\ngreat<br />\ncrowd<br />\nof<br />\nBOLE AGENTS FOR BALTIMORE<br />\nspectators at a high pitch of enFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nthusiasm all evening.<br />\nWith New York University a<br />\nThe Chas. Wilhns Surgical<br />\nclose second, contested bitterly by<br />\nInstrument Co.<br />\nZOO N. HOWARD ST., Baltimore, Md. Bowdoin College, which finished<br />\nSURGICAL INSTRUMENTS<br />\nthird, the Homewood sprinters<br />\nMicroscopes and Supplies,<br />\nwere compellel to fight for the race<br />\nStethoscopes<br />\nBlood Lancets at every stage. Joe Thompson,<br />\nBlood Counters<br />\nstarting for Hopkins, got off to a<br />\nfast start and led the first men of<br />\nthe other colleges at a fast pace<br />\nPrinters of Philological and<br />\nfor 350 yards. At this point in his<br />\nScientific Works<br />\nrelay, he cut loose and left his op23 S. HANOVER ST.<br />\nponents several yards behind on<br />\nBaltimore, Md.<br />\nthe home stretch and succeeding in<br />\ngiving the second Hopkins performer a good send-off. The second man for New York University<br />\nset out with determination to put<br />\nhis team in the lead, but he only<br />\nsucceeded in viewing Norwood's<br />\nheels for the entire 440 yards. Bob<br />\nSkinner, who took the baton from<br />\nNorwood, was compelled to fight<br />\nhard<br />\nfrom start to finish, but he<br />\n17 E. Baltimore St.<br />\nmaintained Hopkins' lead and ended up with a whirlwind finish,<br />\nPrinters of the<br />\nwhich started Ridge Edwards, the<br />\nJohns Hopkins News-Letter<br />\n\"blonde flash,\" on the final leg of<br />\nthe journey with a slight advantage. The N. Y. U anchor man<br />\nstarted out as if he intended to run<br />\na hundred yard dash and swept past<br />\nEdwards at the end of the first 220<br />\nyards. He failed, however, to judge<br />\nthe ability of the Hopkins star,<br />\nwho, just at the right moment,<br />\nstarted out on his characteristic<br />\nfinal sprint so well known to Hopkins men, and with a beautiful exhibition of final reserve power beat<br />\nout the N. Y. U. man a few yards<br />\nCollege Literature<br />\nin front of the tape and brought<br />\nLOMBARD and SOUTH STREETS victory to the Hopkins team. The<br />\nexcellent indoor time of 3.32 2-5<br />\nmade by the team beats the old<br />\nHopkins record of 3.35 by 2 3-5<br />\nseconds.<br />\nTeach a Lesson in Style<br />\nImporters and Dealers in Fine Books<br /><br />\nMt. Vernon 4999<br /><br />\nW.L. Mann<br />\nCommercial Photography<br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br /><br />\nElkridge Farms Dairy<br />\nSTRICTLY FRESH MILK<br />\nProduced, Pasteurized and Bottled<br />\nin Howard County<br />\nCLARK BROS.<br /><br />\nEllicott City 231-R<br /><br />\nDo you know how best to provide<br />\nan income for your old age?<br />\nConsult with<br /><br />\nth<br /><br />\nB:<br /><br />\nOnly four words<br />\nhut they tell our whole story.<br /><br />\nYc<br />\ncl:<br /><br />\nth<br /><br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br /><br />\nSF<br /><br />\nORDERS RECEIVED FOR<br /><br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br /><br />\nec<br />\nth<br /><br />\nCOGGINS'<br />\nTransfer and Baggage Express<br />\nAUTOMOBILE SERVICE<br /><br />\nPHONE, HOMEWOOD 2645-W<br /><br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\nPT<br /><br />\nC1<br /><br />\nThe Episcopal Church of<br /><br />\nfl<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:--DINNER<br />\n11:30 until 7:30<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br /><br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br /><br />\nDANCES Morning Service, II o'clock<br />\nEvening Service, 8 o'clock<br /><br />\nTelephone St. Paul 6987<br /><br />\nURNER'S<br /><br />\nar<br /><br />\nMEN'S SHOES<br /><br />\nre<br /><br />\nSt:<br /><br />\nOf the Better Class<br /><br />\nURNER BROTHERS<br /><br />\nSpecial Invitation to Hopkins Students<br /><br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nfT<br /><br />\nth<br /><br />\nMURAD<br />\nTHE TURKISH CIGARETTE<br /><br />\nEvery day MURADS are held<br />\nhigher in the estimation of the men<br />\nwho smoke them.<br />\nThey are the standard of Taste.<br />\nThey never disappoint—never<br />\nfail—never change—<br /><br />\nCHRISTIAN SERVICE CLUB MEETS<br /><br />\nAt a recent meeting of the Christian Service Club, the members of<br />\nthe club decided to back up the StuN. HESS' SONS<br />\ndent Friendship Fund in its drive<br />\n8 E. BALTIMORE ST.<br />\nfor $250 in this University.<br />\nRoberts, a member of the club,<br />\nSHOES<br />\ngave a short talk on the results of<br />\nir<br />\nMartin Luther's ministry. This<br />\nUNIVERSITY MEN<br />\nwas followed by a general discusFor Sport Wear sion of the different leaders of the<br />\nFor Dress<br />\nSmart Styles—Best Leathers Reformation.<br />\nModerate Price:,<br />\nA committee was appointed to<br />\nchoose members of the club who<br />\nwill give short talks on certain periods of the growth of the church<br />\n19 W. LEXINGTON ST.<br />\nfrom the time of St. Paul up to the<br />\npresent. The aim of this is to acquaint the members of the club<br />\nwith the relative importance of the<br />\nmovements of the Reformation and<br />\nMADE TO ORDER<br />\nthe<br />\ntime which they took place.<br />\nAND<br />\nG.<br />\nConning was elected treasurFINISHED CLOTHES<br />\nei of the club to fill the place left<br />\nPLAZA BUILDING<br />\nvacant by the resignation of<br />\nWheeler.<br />\n19 and 21 EAST FAYETTE ST.<br /><br />\nGOOD CLOTHES<br />\nNOTHING ELSE<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br /><br />\nHess Shoes<br /><br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br /><br />\n211-213 E. Baltimore St.<br /><br />\nW. W. WALKER<br />\n909 Calvert Bldg. St. Paul 2581<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nCLOTHES<br /><br />\nCIGARETT<br />\n1\"Vt<br />\nESPECAALW FOR<br />\nDISCRIM1RATIIAGpDEXPER1EVIC<br />\nARE MADE<br />\nGRADE_<br />\n1-11GVI<br />\nSMOKER OF CAGARETTES<br />\nI1)PKISti<br /><br />\nIheblexOnt<br />\nisexcel)tioNA<br /><br />\nThey are 100% pure Turkish tobacco—ofthe finest varieties grown.<br />\nYou are proud to smoke them<br />\nin any company—on any occasion.<br />\nThey are the largest selling highgrade cigarette in the world.<br />\nThe cigarette smokers ofAmerica<br />\nDO prefer Quality to Quantity.<br /><br />\nOr<br /><br />\n11<br /><br />\n2!<br /><br />\ng(<br />\nni<br /><br />\n2.<br /><br />\n(<br />\nS<br /><br />\nSt<br /><br />\nCi<br /><br />\nCl<br /><br />\n1<br /><br />\nWYMAN<br /><br />\n\"Judge for Yourself—!\"<br /><br />\nLEMMERT<br /><br />\nOs<br /><br />\n.<br />\n160200 Maienffitelitheightkiii<br /><br />"}], "field_media_file": [{"target_id": 37595, "display": null, "description": null, "target_type": "file", "target_uuid": "b85f1785-0bb7-40fe-b383-5fa5bf008489", "url": "http://digital.library.jhu.edu/system/files/2022-03/12987-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12987, "target_type": "node", "target_uuid": "15bd5f9b-510e-4f18-9c19-172709c158a2", "url": "/node/12987"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e13b49b5-6849-4528-9e84-4ed690ab440d"}]}