{"mid": [{"value": 38183}], "uuid": [{"value": "c8cd279f-1004-4499-8a96-442fb690445d"}], "vid": [{"value": 38183}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12752-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ".rtirr<br />\nifintikins Nnus-41<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nHOMEWOOD, BALTIMORE, FEBRUARY 12. 1937<br />\n<br />\nVOL. XLI, NO. 22<br />\n<br />\nSanderson Strikes<br />\nAssembly Hears Sachs Thinks President's<br />\nCourt Bill Avoids Real Issues Keynote Of Down<br />\nHugh H. Clegg, Instructor<br />\nAsserts That Roosevelt Desires \"Packed Court\"; The Bay Conference<br />\nAdds That Powers Should Be Curbed And<br />\nAce Detective<br />\nClergyman Declares 'Hell Is<br />\nMeans Perhaps Justified<br />\n\"If I were in Congress, I should<br />\nvote for the proposal, but I don't<br />\nthink that the proposal of the President meets the real issue before the<br />\ncountry. That issue is who shall have<br />\nfinal say in the making of laws:<br />\nMETHODS EXPLAINED the<br />\nthe peoples' representatives, responsible to the people for what they do,<br />\nDiscusses Training G - Men; or nine judges (and in many cases<br />\nfive) sitting for life without any reAttitude Of Nation;<br />\nsponsibility to the people.<br />\nFinger-Printing<br />\n\"The President's proposal does not<br />\nmeet the issue squarely. Under his<br />\nThe first of the student assemproposal the Supreme Court will conblies under the new 'voluntary attinue to have the final say over legistendance system was addressed yesterlation, the only difference being that<br />\nday by Hugh H. Clegg, assistant dithe President desires a particular<br />\nrector of the Federal Bureau of InSupreme Court which would look<br />\nvestigation at Washington, D. C. Mr.<br />\nwith favor upon his social and econClegg spoke on \"Scientific Crime Deomic reforms.\"<br />\ntection.\"<br />\nWith this statement Mr. Leon<br />\nThe assembly was presided over Sachs, instructor in Constitutional<br />\nby Hershner Cross, president of the Law and American Government at<br />\nassembly the Hopkins, expressed views on that<br />\nCouncil. The<br />\nStudegit<br />\nroom M Latrobe Hall was filled. part of President Roosevelt's proAfter the singing of the Ode, the posed court reform which dealt with<br />\nspeaker was introduced by Hershner the highest tribunal itself. Mr. Sachs,<br />\nCross.<br />\nwhen interviewed by a NEWS-LETTER<br />\nEntrance Into The F. B. I.<br />\nreporter, declared that he was in<br />\nMr. Clegg brought out that while hearty accord with all other sections<br />\nin ancient times there was an ex- of the bill, but that adding six justices<br />\naggerated individualism in law en- was but a \"naked attempt to pack the<br />\nforcement, with the wounded party Supreme Court so as to ensue the conacting as both detective and prose- stitutionality of New Deal legislacutor, we realize today that training tion.\"<br />\nHe asserted that something could<br />\nmen for detection is important as<br />\ntraining them for judges or prose- be said for the President's position:<br />\n\"If the Constitution contained the ancutors.<br />\nShortly after J. Edgar Hoover be- swers to all these constitutional quescame head of the Federal Bureau of tions, then obviously there would be<br />\nInvestigation, he set the rigid stand- no justification for the President's<br />\nards now followed for candidacy in the quarreling with the Supreme Court,<br />\nservice. An applicant must be be- because all the Supreme Court would<br />\ntween 25 and 35 years of age, a law be doing is interpreting and telling<br />\nschool graduate, or a certified ac- you what is in the Constitution, so<br />\ncountant, and in good health. After that, if you are dissatisfied, then don't<br />\n<br />\nAssistant Head Of F. B. I.<br />\nSpeaks On \"Scientific<br />\nCrime Detection\"<br />\n<br />\n0<br />\nY,<br />\n'n<br />\n<br />\nIn<br />\nS.<br />\n<br />\nle<br />\n<br />\nIf<br />\n<br />\n'S<br />\n-r<br />\ng,<br />\nse<br />\n<br />\nYof<br />\nd,<br />\nes<br />\n.1,<br />\nhe<br />\n<br />\na thorough investigation, a candidate<br />\nis declared either eligible or ineligible.<br />\nRigorous Training Necessary<br />\nIf eligible, the candidate goes<br />\nthrough a rigorous seven-day-a-week<br />\ntraining period in scientific crime detection, crime statistics, and adapta- Thomas Plaque Will Also Be<br />\nbility to various calls. He is trained<br />\nOffered On Commemto effect a coordination of police faoration Day<br />\ncilities all over the country, as was<br />\nThe Commemoration Day Exernecessary in the Urschell kidnapping<br />\ncase. He must also learn to put his cises at The Johns Hopkins Univerwit against a criminal brain, and how sity will be signalized by the preto handle himself in any emergency. sentation of two memorials. A bust by<br />\nMr. Clegg showed that certain Dr. John H. Latane will be presented<br />\ncriminals possessing various talents, by a committee, with Senator George<br />\nmight have been a credit rather than L. Radcliffe acting as spokesman, and<br />\na hindrance to society, had they been a bronze plaque commemmorating the<br />\nbrought under a good influence in services of Douglas H. Thomas, the<br />\narchitect responsible in large measyouth.<br />\nure<br />\nfor the Homewood buildings and<br />\nCrime statistics also play an important part in the study of crime de- planning, will be given to the Univertection. They show, for instance, that sity.<br />\n<br />\nblame the Supreme Court, but blame<br />\nthe Constitution.<br />\n\"However, it so happens that the<br />\nConstitution does not contain the answers to these problems because of<br />\nits very vague and ambiguous<br />\nlanguage. Consequently, the unconstitutionality of the New Deal, for example, is not due to the Constitution, but due to the opinion of judges<br />\nas to what they think the Constitution ought to mean. Most of these<br />\nproblems could have been settled<br />\neither way; and, if a conservative<br />\ncourt decides them in a conservative<br />\nway, it must assume the responsibilitl for its choice.\"<br />\nMr. Sachs suggested that many<br />\npeople insist that the President<br />\nshould seek his reforms through a<br />\nconstitutional amendment, but he<br />\nthinks that the President could reply that \"the Constitution is adequate.<br />\nIt is not the Constitution that needs<br />\namending but the Supreme Court.\"<br />\nDiscounting the President's humanitarian motives, Mr. Sachs declared that far from easing the burden of the older justices, the measure would increase it, because among<br />\nothr things it authorizes that all<br />\ncases in lower court declaring an<br />\nact of Congress unconstitutional be<br />\nimmediately heard in the Supreme<br />\nCourt. A great majority of cases<br />\nnever reach the \"nine old men.\"<br />\n\"I favor the Supreme Court's retaining its present function of judicial review,\" Mr. Sachs asserted, \"but<br />\nI favor a constitutional amendment<br />\nthat would authorize Congress to<br />\nrepass legislation declared unconstitutional by the Court by a two-thirds<br />\nmajority. This is certainly a conservative enough check on hasty legislation.\"<br />\n<br />\nLatane Bust To Guttmacher Opens<br />\nBe Given Hopkins Lectures On Sex<br />\n<br />\n20 out of every one hundred criminals<br />\nis under voting age. However, the<br />\nfact that until recently the largest<br />\npart of these 20 was nineteen years of<br />\nage, while now they are twenty-one,<br />\nshows that our nation has become law<br />\nenforcement conscious, and that there<br />\nis no longer any hero-worship of<br />\ncriminals by youth. The desirable effect is apparent.<br />\n(Continued on Page 3, Col. 1)<br />\n<br />\nGeneral Bi - Sexual Theory<br />\nCenter Of First<br />\nOf Series<br />\nA sizeable group of students yesterday heard Dr. Allen Frank Critmacner, of the Johns Hopkins Medican School, open a series of lectures<br />\non sex hygiene with a general discussion. The opening lecture, 5p5iisored by the Johns Hopkins chapter<br />\nof the Amercan Students' Union was<br />\nheld in room 112, Gilman Hall.<br />\nDr. Guttmacher deplored the use of<br />\nthe term \"sex hygiene,\" saying that<br />\nit puts sex apart into a separate<br />\nchannel, when it is really a part of<br />\nthe general biological cosmos which<br />\nsurrounds us. He then proceeded to<br />\nclassify the various types of reproduction as sexual, parthenogeneties,<br />\nfaculatedal parthenogenetic, hermaphroditic, and the bisexual, with<br />\nwhich his lectures are to be concerned.<br />\n<br />\nThe exercises on Monday, February<br />\n22, honor Dr. Latine, a graduate of<br />\nthe class of 189, former Professor<br />\nof American History, and Dean of the<br />\nCollege of Arts and SciencOs. The<br />\ncommittee presenting the bust numbers among others: Newton D. Baker,<br />\nFrederic Bancroft, Walter H. Buck,<br />\nKent Roberts Greenfield, W. Stull<br />\nIn connection with the idea of herHelt, Charles Morris Howard, Theo- maphroditism, Dr.<br />\nGuttmacher stated<br />\ndore Marburg, and W. W. Dilloughby. that the well-known circus freak<br />\nThe bronze plaque, which is to be \"half-man and half woman\" is frauplaced near the main entrance to dulent, and is really a case of hemiGilman Hall, one of the buildings hypertrophy, which is a well known<br />\nplanned by Douglas Thomas, was human phenomenon. \"All human<br />\nconceived and designed by LoUis Ros- bodies,\" he said, \"are more or less<br />\nChemistry Professor Talking On enthal, the eminent sculptor. The asymmetrical, that is, one side is<br />\nplaque is donated by the class of more developed than the other. A<br />\nAbsolute Zero Work<br />\n1893, who are to be present in a group, woman usually discovers which of<br />\nAt Hopkins<br />\nhonoring their classmate. The pre- her profiles is the better, and turns<br />\nDr. Donald Hatch Andrews, head of sentation will be made by Siegmund that side toward you.\"<br />\nthe Johns Hopkins Department of B. Sonneborn.<br />\nAccording to Dr. Guttmacner, biChemistry, is now engaged upon a<br />\nsexual reproduction, or that in which<br />\ntour of northern cities. He is to speak Two Chem. Fellowships<br />\nthe female is fertilized by the male,<br />\nin Schenectady, Providence, Boston,<br />\nReceived At Homewood is divided into several classes: that<br />\nand Springfield, before the local chapaccompanied by no bodily contact or<br />\nTwo important fellowships in the<br />\nters of the American Chemical Sociinterest; no bodily contact, but interety, on the subject, \"Approaching Ab- department of Chemistry have been est; and the type which is charactersolute Zero.\" Dr. Andrews' work in recently renewed by their donors. ized by both contact and interest. This<br />\nthis field, carried on at the Hopkins, The DuPont Post Graduate Fellow- last type is that which takes place in<br />\nship, valued at $750, will run for an- all mammals.<br />\nplaces him among the leaders.<br />\nDuring the past years, a number of other year, beginning in September.<br />\n\"Bisexual reproduction,' said Dr..<br />\ncolleges and Universities have been Likewise, the Eli Lilly Fellowship, Guttmacher, \"has the biological adInvestigating the possibility of at- of $1000 per year, has been renewed vantage of producing a variety of<br />\ntaining the zero of the absolute tem- for four more years, starting next offspring which can cope better with<br />\nperature scale. Already within one fall.<br />\ndifferent environments.\" He contindegree, the laboratories are busy tryFrom the Rockefeller Foundation, ued to say that because of this ading to push down a few precious the University has recently accepted vantage, for example, children of a<br />\ntenths further. Dr. Andrews has been $4000 to be used on the Spenser Pro- tuberculous father and a normal<br />\none of the major contributors to these ject. This undertaking is the editing mother need not be expected to retain<br />\nefforts, and speaks with authority and publishing of a number of vol- their father's susceptibility to that<br />\n• born of actual experience.<br />\numes of the \"Faerie Queene.\"<br />\ndisease.<br />\n<br />\nDr. Andrews Making<br />\nNorthern Tour<br />\n<br />\nCHEER JAY<br />\nBASKETERS TO<br />\nVICTORY TOMORROW<br />\n<br />\nPerpetuity Of<br />\nInsecurity'<br />\n'Y' Delegates Miss Winant,<br />\nUnable To Attend<br />\nMeet<br />\nThe highlight of the Tri-State Student Christian Conference held last<br />\nweek-end came when Dr. Ross Sanderson said in his Sunday morning sermon, \"Hell is the perpetuity of insecurity.\" This remark struck the dominant note of the conference, which<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nStudent Council Statement<br />\nIn an official statement issued<br />\nWednesday evening, February 10,<br />\nthe Johns Hopkins Student Council announced:<br />\n\"The NEWS-LETTER 'election' has<br />\nbeen declared invalid by the Student Council on the technical<br />\ngrounds of Article I, Section 2a, of<br />\nthe S.A.C. rules; and an election<br />\nwill be held with Harold Zheutlin<br />\nand Stanley Finkel as the candidates for editorship.\"<br />\n<br />\nEighty Per Cent Declare<br />\nWillingness To Subscribe<br />\nTen Dollars<br />\nPLANS<br />\n<br />\nUNDER<br />\n<br />\nWAY<br />\n<br />\nDebaters Vie With Bradford Declares CommitBe Anounced<br />\nGeorgia Tuesday tee Will<br />\nNext Week<br />\nMaas And Sfekas Present<br />\nAffirmative On Minimum<br />\nWage Issue<br />\n<br />\nmet aboard the Chesapeake Line<br />\nIn what was termed \"the most sucsteamer City of Norfolk, and was cessful debate in years,\"<br />\nthe John's<br />\nattended by several hundred delegates Hopkins Debating Council met the<br />\nfrom nineteen colleges. The confer- University of Georgia Tuesday evenence was held chiefly for the discus- ing before Dr. Broadus Mitchell's<br />\nclass in Political Economy.<br />\nsion of Social Security in all its<br />\nThe topic of the debate was: Reaspects.<br />\nsolved, That Congress should be emHenry H. Leber, chairman of the powered to enact<br />\nminimum wages and<br />\narea and president of the Hopkins maximum hours for<br />\nindustry. The af\"Y\", opened the sessions of the con- firmative side was upheld<br />\nby the Hopference and introduced the speakers, kins and presented by<br />\nCharles Sfekas<br />\nwho discussed Social Security Leg- and Arthur Maass. The University<br />\nof<br />\nislation from several points of view. Georgia argued the negative side,<br />\nMr. Luther Becker, field representa- and its speakers were Chairles Fain<br />\ntive of the Social Security Board, en- and Morris Abram. Dr. Broadus Mitlarged upon the purposes of the Fed- chell acted as chairman for the deeral Social Security Act. The Rev. bate.<br />\nJoseph Nowak, Jr., pastor of St.<br />\n\"The reason for its overwhelming<br />\nPaul's Presbyterian Church, and Mr.<br />\nsuccess,\"<br />\nsaid Mr. Maass, \"was that<br />\nPhil Jacob, Secretary of the Youth<br />\nthe audience was a class in political<br />\nSection of the Emergency Peace Cameconomy which was deeply interested<br />\npaign, spoke of the major deficiencies<br />\nin the topic.\"<br />\nand international 'aspects of the legMr. Maass reported that this interislation.<br />\nest manifested itself after the debate<br />\nSocial Problems Discussed<br />\nat which time several members of<br />\nDiscussions of current social prob- th class plied<br />\nthe debaters with queslems were held in the evening, at tions.<br />\nwhich time Dr. Sanderson presided.<br />\nThe next debate on the schedule is<br />\nOf special interest to the delegates<br />\nwas the talk on the N.Y.A. and Amer- on January 27th with the University<br />\nof Virginia team. The topic will be<br />\nican Youth Act.<br />\nthe same, but the Hopkins will uphold<br />\nThe delegates were joined at Old the negative side of the question. The<br />\nPoint Comfort in the morning by a place has not been decided but will<br />\ngroup from several Virginia colleges. be announced next week in the NEWSThe augmented group went to the LETTER.<br />\nHampton Institute, whose famous<br />\ngroup of singers offered vocal entertainment. President and Mrs. Arthur Jay Grapplers, Fencers<br />\nHowe welcomed the group to the<br />\nSuffer Double Defeat<br />\nNegro institution.<br />\nThe Blue Jays suffered a dual deDr. Sanderson's Sunday morning<br />\nfeat last Tuesday evening at the<br />\nsermon climaxed the conference.<br />\nHomewood gymnasium when both the<br />\n\"Protestantism must chbose be- wrestling and fencing team bowed<br />\ntween revolution and reaction,\" he to their respective<br />\nconquerors.<br />\nsaid. \"Too often Protestantism has<br />\nThe<br />\nSt.<br />\nJohn's<br />\nlungers parried their<br />\nconcerned itself with the hereafter<br />\nand ignored the life on earth. Hell is way to a meager 10-7 victory as -the<br />\nthe perptuity of insecurity.\" In deal- Blue Jays attempted time arid again<br />\ning with the racial aspect of this to cut through their defense.<br />\nvital question Dr. Sanderson emphasized the fact that a concerted and<br />\nsincere effort must be made to give<br />\nthe Negro equal opportunity with his<br />\n\"white brothers.\"<br />\n<br />\nSeniors Favor<br />\nJune Week In<br />\nBallot Results<br />\n<br />\nThe<br />\nLafayette grapplers, too,<br />\nhelped to intensify the Blue Jay losing streak as they grunted and<br />\ngrowled their way to a 21-11 victory<br />\nover the Hopkins wrestling team<br />\n<br />\nBilly Igaac Band To Play<br />\nAt Musical Club Concert<br />\n<br />\nReturns from the ballots sent out<br />\nby the June Week committee to the<br />\nSenior Class show that eighty per<br />\ncent of those who replied favored the<br />\ncontinuation of the annual June Week.<br />\nSeventy-five per cent of the graduating class replied to the questionnaire<br />\ndistributed.<br />\nRoy Galloway, president of the<br />\nclass, issued the following statement<br />\nupon complete tabulation of returns:<br />\n\"I am very pleased with the response<br />\nof my colleagues to the appeal of the<br />\nJune Week committee, and I am sure<br />\n<br />\nthat with the support which has been<br />\npromised us we will be able to make<br />\na success of June Week, financially<br />\nas well as socially.\"<br />\nAverage Price<br />\nThe ballot showed that the average<br />\nof the class was in favor of a price of<br />\nten dollars per person for the entire<br />\nweek. Last year the price was twelve<br />\ndollars per person. The result of last<br />\nyear's June Week was that there was<br />\na full week of activity, with the Senior Ball, Junior Prom, Night Club<br />\nParty, Tea Dances, and other events.<br />\nThe June Week festivities take place<br />\nduring the first week after exams, in<br />\norder to finish off the school year with<br />\na memorable celebration.<br />\nJames Bradford, chairman of the<br />\ncommittee, stated that he would appoint a large group to assist him in<br />\nmaking the necessary arrangements,<br />\nsuch as bands, halls, and other things<br />\nincidental to its success.<br />\n<br />\n•<br />\n<br />\nPlayshop ToSponsor<br />\nStrinberg Festival<br />\nPlay To Follow Dr. Miller's Lecture<br />\nOn Playwright Next<br />\nTuesday Evening<br />\nThe Playshop-sponsored Strindberg<br />\nFestival will get under way next Tuesday, with an evening devoted to a lecture and play. The lecture will be<br />\ndelivered by Dr. Anne Irena Millere,<br />\nprofessor of English at Goucher College, on the subject, \"August Strindberg, the Father of Expression.\" Following this, Director N. B. Fagin announces, will be presented the play,<br />\n\"First Warning,\" by Strindberg.<br />\n<br />\nBy Bobby Hildreth<br />\nOn Friday, February 26, at 8.15 the<br />\nenjoyment of five and one-half hours<br />\nwill get under way at the Maryland<br />\nCasualty Auditorium. The ball of<br />\ngood time will start rolling with the<br />\nvarious departments of the club presenting their achievements from past<br />\nrehearsals. This includes the Glee<br />\nClub, Banjo Club, Hawaiian Troupe,<br />\nQuartette, Blue Jay orchestra and<br />\nsoloists who will render a few \"bars<br />\nin search of melody.\" This part of the<br />\nprogram should conclude about 10.15,<br />\nbut then it is only the beginning.<br />\nAt 10.30, and continuing until 1.00,<br />\nBilly Isaac and his Commanders will<br />\nfurnish some of the best type of music<br />\never heard in Baltimore.This organization under Little Man With Big Stuff<br />\nIsaac, has been playing for quite a<br />\nfew years without a break-up among<br />\nthe musicians—as so many of the<br />\nother local bands have done.<br />\n<br />\nThe Festival is dedicated to the late<br />\ngood. For ten pieces they do not only<br />\nMiss<br />\nFrances Jordan for many years<br />\nplay loud, but sweet and soft.<br />\na<br />\nleading<br />\nfigure of the Homewood<br />\nTwo fine vocalists, Doris Scharron<br />\nDramatic<br />\norganization.<br />\nThe program<br />\nand Ed Melvin, another Kenny Sargent, lend a chorus or two for those is scheduled for 8.30 P.M., at the<br />\nwho desire words with their music. Playshop. Tickets will be twenty-five<br />\nThe drummer, is Baltimore's Gene cents, save for season subscribers,<br />\nKrupa, while their leader, Billy Isaac, who will be admitted on their sublooks like a small edition of Paul scriptions.<br />\nThe cast for the play includes Patty<br />\nWhiteman and plays like Bunny<br />\nSinglewald,<br />\nHelen Ascherfeld, Leola<br />\nBerrigan. Ed Wolfe is the trombone<br />\nman in the band, and he resembles Myers, and Gerald Branower. The<br />\ngroup is under the direction of Myra<br />\nTommy Dorsey.<br />\nLehr.<br />\nTown Jobs<br />\n<br />\nEvery Saturday<br />\nThe commanders can be heard<br />\nregularly every Saturday night at the<br />\nMount Holly Inn at Walbrook.<br />\nThey have been there steady for two<br />\nsolid years, and any band that can remain in one place that long must be<br />\n<br />\nThe total price has been set at $3<br />\nper couple. This includes the concert,<br />\nwhich is $1 per person unless an<br />\nS.A.C. card is exchanged for a complimentary ticket; while the dance is<br />\n$1 per couple for everybody. Let's<br />\nsupport the affair.<br />\n<br />\nThis band has played jobs out of<br />\ntown as well as many around the city<br />\n—everywhere receiving compliments<br />\non their fine arrangements. Requests<br />\nare played in the order in which they<br />\nare received. All this adds to the things<br />\none would look for in a dance orchestra. The fine points mentioned about<br />\nthe Commanders will be approved by<br />\nthose who attend the Home Concert.<br />\n<br />\n\"China Goes Modern\"<br />\nIs Topic Of Lecture<br />\nMr. Eugene E. Barnett, founder of<br />\nthe Hangchow Y.M.C.A., considered<br />\none of the largest and most influential<br />\nin China, addressed a joint committee of the Cosmopolitan Club and the<br />\nFriendly Relations Committee of the<br />\n\"Y\" on his favorite subject, \"China<br />\nGoes Modern,\" at 4:00 p.m. yesterday<br />\nin Levering Hall.<br />\nMr. Barnett, a graduate of Emory<br />\nUniversity, has spent 26 years in<br />\nChina, and has recently been elected<br />\ndirector of World Service of United<br />\nStates and Canada.<br />\n<br />\n\fHOMEVVOOD, BALTIMORE, FEBRUARY 12, 1937<br />\n<br />\n2<br />\n<br />\nMit<br />\n<br />\no1jn5 Appittn5<br />\n<br />\nCAMPUS eIRCLIN'<br />\ntATFI<br />\nOMNIENT<br />\ntater<br />\nP US<br />\nE<br />\n<br />\n,i2etus<br />\n<br />\nFELLOWS! THEY INTEND<br />\nTO CONSCRIPT US<br />\nYes they intend to conscript us!<br />\npei year<br />\n42.a u<br />\nWhat do you mean, conscript?<br />\n13/<br />\n----this—The War Department<br />\n---Simply<br />\nRemit subscription tees to Treasurer, Student<br />\nActivities LULIRC74, itemsen i.aIl, Pustudice, Johns has for thirteen years had a commitOpluRb l;111versity.<br />\n-- -- tee of sixty men working on a plan<br />\nEntered as second class matter December 3, to be presented to Congress whereby<br />\nunder<br />\nMd..<br />\nBaltimore,<br />\n19U9, at the Postuthce in<br />\nthe Act of Congress, Novernbei 3, 1579.<br />\nall of us young men between the ages<br />\n— -Published senn-weekly trurn October to June, of eighteen and forty-five will be torn<br />\nexcept dui ing examination and college holiday away from our homes, taken away<br />\nperiods by undergraduates ut the Johns Hopkins<br />\nnive sity.<br />\nfrom our vocations and studies and<br />\nEDITORIAL STAFF<br />\nforced into military service at time<br />\nEtittot<br />\nWilliam Diamond<br />\nAssociate Editor the president feels that a national<br />\nStanley Finkel<br />\nJames Morrow, David Caplan Managing Editors emergency exists (that emergency<br />\nSports Editor<br />\n..<br />\nBernard D. Pinck<br />\nmay be in peace or war). Anyone<br />\nBenjamin Rout, Wethered Barroll, Jr.<br />\nAssistant Managing Editors<br />\nrefuses to leave his vocation will<br />\nwho<br />\nAssistant<br />\nSports<br />\nEditor<br />\nZheutlin<br />\nHarold<br />\nColumnist I be thrown into jail for an indefinite<br />\nPaul Berge<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein,<br />\nJewett Goldsmith, Howard Reizenstein, Jul. period of time.<br />\n<br />\n'With BOBBY HILDRETII<br />\n<br />\nDoug Meigs seems to be •having<br />\ntrouble with his \"Bug.\" That is the<br />\nlittle green Austin you see parked<br />\nabout the campus. His friends seem<br />\nto enjoy hiding it from him while he<br />\nattends classes. This week he found it<br />\nin the woods near the power house.<br />\nWhy not take it to class with you,<br />\nDoug?<br />\n<br />\nMUSICANA<br />\nAlexandre Scriabin, music's sole<br />\nmystic, is a great musician, but he is<br />\ngreatly neglected. Tuesday night, a<br />\ngroup of Baltimorean music-lovers<br />\ngathered to hear the National Symphony play his 3rd Symphony, Le<br />\nDivin Poeme. It was an unforgettable<br />\nexperience. Exotic harmonies, shimmering solo passages, brilliant orchestral coloring were mixed with a<br />\nwild overpowering emotional appeal.<br />\nOne still remembers the huge, shattering, forte-fortissmo in the first<br />\nmovement, the melodious violin solo,<br />\nwith flute chirping in the second, and<br />\nthe unrestrained, lusty, final shout of<br />\njoy. Undoubtedly a great work, even<br />\nat second hearing, it leads one to wait<br />\nwith anticipation future hearings of<br />\nthe works of this strange, bizarre<br />\nphilosopher.<br />\n<br />\nhe failed!) is vague, religious, misty, have a little of the ape-man in you<br />\nand mystic. Scriabin stole the show. says Prof. H. R. Hunt of the zoology<br />\n* * *<br />\ndepartment at Michigan State ColThe concert of March 16 will fea- lege. Pre-historic man had to wiggle<br />\nture George Gershwin at the piano his ears to sharpen his sense of hearing. Muscles employed in this action<br />\nand podium.<br />\nAuditur<br />\nare a definite inheritance from him.<br />\nThe \"Hell Week\" practice at Northwestern University has been severely<br />\ncircumscribed and restricted by resolution of the interfraternity council.<br />\nFlu can't even stop University of<br />\nKnox College will celebrate its<br />\nMinnesota students from wooing. Men hundredth anniversary during the<br />\nin the isolation ward sent the girls Founders' Day program to be held on<br />\nacross the hall ice cream cones in the 14th and 15th of February.<br />\nappreciative acknowledgement of a<br />\nIn order to study the night-life of<br />\nset of paper dolls.<br />\nbirds, George R. R. Pflaum, debate<br />\nThe \"Committee for the Preserva- coach at Kansas State Teacher's Coltion of Tradition at St. Mary's Uni- lege, has put up a glass wren-house,<br />\nversity\" proclaimed recently that with electric light attachments, in his<br />\nshaves, haircuts, baths and any other backyard.<br />\nsimilar marks of civilization would be<br />\nHarvard,Yale, and the University of<br />\noutlawed during exam week.<br />\nChicago have the largest endowment<br />\nFreshmen at the University of funds of any of the education instituMichigan have been granted the per- tions in the United States. Harvard's<br />\nmission to live in fraternity houses fund totals $131,099,000.<br />\nduring the second semester.<br />\nThe names of two University of<br />\nA \"No Cigarette Bumming League\"<br />\nPennsylvania girls appeared by accicampus<br />\nof<br />\nhas been forced on the<br />\ndent on the list of men of that instituLouisiana State University. League<br />\ntion accepted for fraternity rushing.<br />\n.members promised not to bum or<br />\nA quick witted student in the bacbe bummed from. Bumming of<br />\nteriology laboratory at the University<br />\n\"drags\" is permitted.<br />\nof Minnesota found a swift solution<br />\nSkiing is the most \"bodybruising\"<br />\nfor an unexpected fire. When a stusport at Harvard University. In the<br />\ndent's hair caught on fire, he put out<br />\nannual report of the Hygiene Departthe flame by slamming a book on the<br />\nment it was found that skiiers suffellow's head.<br />\nfered the most injuries. Football men<br />\nhad no serious injuries.<br />\nIf you can wiggle your ears, you<br />\n<br />\nIntercollegiates<br />\n<br />\nThe Music Club concert should be<br />\na success evel though the Cotillion<br />\nBoard chiseled in on the sam week.<br />\nBilly Isaac's orchestra is quite the<br />\ntops in the city at present. The only<br />\nmusical difference between Hal Kemp<br />\nPrior to the intermission, Dr. Kindtan Adler, Carl Raisin, Leonard Rubinger,<br />\nTalk about Fascism or government and Billy Isaac is the name and the ler drew from dusty cob-webby<br />\nMorris Wessel, Arthur Katz, Martin<br />\nKempton.<br />\nKrieger, I.ester Rosenthal, Murray<br />\nprice that you are going to pay.<br />\nVictor Victoroff, Charles Diggs, William dictatorship--well, there it is. If we<br />\nshelves three rarely-performed works.<br />\nBurford, J. C. UaiiIeknian, Mal liostmack. are to be subjected to a conscription<br />\nAs soon as we reached our seats, we<br />\nBUSINESS STAFF<br />\nDid you know that the first collecBusiness Massager similar to German or Italian univerWilliam B. Kempton<br />\nheard a suite of operatic excerpts by<br />\nAssistant Business Manage, sal conscription so contrary to Amer- tion made in America of Egyptian art<br />\nMelville Locker<br />\n,Christoph Willibald von Gluck. Need<br />\nAdvertising Massager<br />\nWm. C. Erlanger<br />\nCirculation Manager ican institutions of life, liberty, and is here at the University? Ask Dr. more be said?<br />\nGerald Willen<br />\nOffice Manager<br />\nHoward Linkoff<br />\nRobinson about it.<br />\nCopy and Filing Manager the pursuit of happiness, we the<br />\nNathaniel Soifer<br />\nContrasted to the dazzling splendor<br />\noyoung men who will be conscripted<br />\nof Rimsky-Korsakoff's Le Coq d'Or,<br />\nI understand that Hutch is no going<br />\n1936<br />\nMember<br />\n1937<br />\nand the young women citizens of the<br />\nGluck is a pale and wan lover. Some<br />\nUnited States ought to know the to attend the 2nd C,otillon. That means of the fire and vitality of the two<br />\ncontent of this proposal, and the de- more room to dance. It's to good to be Coq d'Or excerpts was a harbinger<br />\nDistributors<br />\ncision implied, instead of having it true.<br />\nof Scriabin's symphonic poem1symthrust upon us, as the War Departphony.<br />\nThe registrar's office took up a nice<br />\nment<br />\nevidently<br />\nintends, without<br />\nLoudon Greenlees, an elderly bald,<br />\nTISINO<br />\nST<br />\nRRRRR<br />\nsize<br />\nNATIONAL<br />\ncollection<br />\nduring<br />\nthe recent Red<br />\nRIIP KKKKK TKO FOR<br />\na warning at a time when an emobony, bow-legged, Scotch baritone<br />\nNational Advertising Service, Inc.<br />\ntional hysteria which accompanies Cross campaign for the flood sufferers.<br />\nthan sang the Kindertotenlieder.<br />\nCollege Pablishers Representative<br />\nemergencies<br />\nwill have gripped the Nice work, my friends.<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nThese are five poems, dealing with<br />\ncHte.aic, . BOSTON - SAN FRANCISCO<br />\ncountry.<br />\nthe death of a beloved child, set to<br />\nSISATTLII<br />\n•<br />\nLos ANOTLI I - FORTLANL<br />\nBrian Murphy offered Jack BarnMore important, the bill has been<br />\nmusic by Gustav Mahler. Gentlemen,<br />\ncompleted to perfection and is known berger a free pass to the Hal Kemp that was the low spot of the evening.<br />\nFriday, February 12, 1937<br />\nas \"The Army plan for University dance, providing that he would give The audience did not seem to feel the<br />\nFill your pen with thisnew<br />\nink creation— Parker(Nine<br />\nDraft\" and is ready to be presented the crowd a tap number. Call his emotion which Mahler and the soloist<br />\nQuink cleans a _pen as it<br />\nbluff, Jack, and accept.<br />\nto Congress as soon as possible.<br />\nwrites—a Parker Pen or any<br />\nwere trying to convey. Why? I'll tell<br />\nother. Dissolves sediment<br />\n-0In order to get a clearer conception<br />\nleft by pen-clogging inks.<br />\nyou the answer if you tell me Why<br />\nComplaints have been made regardof the plan, here are extracts taken<br />\nsome music is great and some medioThe first voluntary assembly is directly from the bill as drawn up by the distribution of the Blue Jay.<br />\ncre.<br />\ngone, but not forgotten. The posi- the committee of sixty:<br />\nEverybody is wondering if they have<br />\nI repeat, sirs--Scriabin was a great<br />\ntion which the NEWS-LETTER has<br />\nAlways rich, brilliant—never watery.<br />\nBe it enacted . . . that during to pay $.15 for it, or swipe it from artist. He _iad all the vivid color and<br />\nGet it at any store selling Ink, 15c and 25c,<br />\nmaintained, not without difficulty, any national emergency which in Levering Hall. Many never get posbreathless irridescence of Stravinsky<br />\nhas been vindicated.<br />\nthe judgment of the president de- session of this interesting magazine plus the objective subjectivity of<br />\n•<br />\nIt is evident that the students of mands the immediate increase of until it is at least two weeks old. Tschaikowsky. He was a great artist,<br />\nNo<br />\nassemblies.<br />\nwant<br />\nSomething<br />\nshould<br />\nbe<br />\ndone about it.<br />\nthe University<br />\nthe armed forces of th United<br />\neven if his philosophy, which he tried<br />\nMade by The Parker Pen Cn.,Janesville,Wis.<br />\nbetter evidence of this can be ob- States, the president may, and he<br />\nto inject into his music (thank God<br />\nA ladies \"John\" has finally been intained than the fact that the assem- hereby is, authorized to register<br />\nbly hall was filled. It is more than and select for induction and to in- stalled in the Log Cabin, a break for<br />\nobvious that the assembly was suc- duct into those forces, such male the girls. I understand that it has<br />\ncessful, not only because of the pres- citizens . . . who shall have reached hot and cold folding doors, besides a<br />\nence of a full house, but because of the eighteenth anniversary of the cooling system.<br />\nthe interest and enthusiasm exhibited day of his birth on or before the<br />\nby the audience in the speaker and day or days fixed for registration<br />\n\"Papa Tree Top Tall\" --- Henry<br />\nin the preliminary songs.<br />\n. . . Any person who shall fail or Krumrein has competition from \"MaNo small amount of the credit is refuse to submit thereto . . . shall ma Tree Top Tall\"—Eileen Schaeffer.<br />\ndue to Mr. Clegg. It is only on rare upon conviction in a district court Both tower over 6 feet. Look up and<br />\noccasions that the students have had of the United States having juris- see them some time.<br />\nthe opportunity to hear a speaker of diction thereof, be punished by imA fine specimen of brains and<br />\nMr. Clegg's quality and personal prisonment for not more than . . .<br />\nmagnetism. He may not have made and shall upon conviction be duly beauty is Miss Benton in the Teachers College. A sample of the golden<br />\nany converts for the F.B.I., but he registered.\"<br />\nThe length of prison term is omit- West.<br />\nhas certainly found sympathizers for<br />\nted from the bill, because upon conIt and admirers for himself.<br />\nBut whatever the opinion of the viction the individual is registered, got hit unfairly by the exams, not<br />\nspeaker, assemblies as an institution that is, he passes directly to military once but twice. Tuesday they sweated<br />\ncontrol and probably serves out his through their two hour comprehenhave been vindicated.<br />\nsentence under such control.<br />\nsive, but next June they will be held<br />\nThe bill further reads:<br />\nresponsible for the same material in<br />\n\"and such persons (those con- another \"final.\"<br />\nIn its capacity as the Hopkins' offi- scripted) shall be required to serve<br />\nOther violations of the entire spirit<br />\nuntil six months after the emercial organ, the NEwS-1,LiTrriat enof the new system were also noted.<br />\ndeavors to protest in its column un- gency shall have been declared by These, of course, must be smoothed<br />\nbiased and uncolored news of the the president to have terminated.\"<br />\nout if the innovation is to have any<br />\nQuoting Harold Fay \"The Sentence<br />\nUniversity.<br />\nmeaning. Year courses must be made<br />\nEspecially do we feel it necessary providing that this regimentation just that, or Brown might better reas a matter of duty and obligation to shall remain in effect for six months turn to calling examinations and semthe student body to print the facts of after the President shall have de- esters by their right names.<br />\na matter which so vitally concerns clared the emergency is over shows<br />\nLength of examinations is another<br />\nus. Until now these facts were not that once this fascism lays hold upon<br />\nmatter which requires adjustment.<br />\nthe<br />\nnation,<br />\nit<br />\nwill<br />\nnot<br />\neasily<br />\nrelease<br />\nknown; and no one has a right to<br />\nThe ordinary \"hour exam\" covers<br />\nstate them unless knowledge is def- its grip with the coming of peace.\"<br />\nabout a month and a half's class<br />\nFinallyinitely possessed concerning these<br />\nweek students have<br />\nNothing contained in this Act work, but this<br />\nfacts.<br />\nwrite enough in two<br />\nbeen<br />\nasked<br />\nto<br />\nBriefly, those bodies which directly shall be construed to require or<br />\nhours to show their mastery of nearly<br />\nand ultimately regulate, supervise, compel any person to serve in commonths of studies. New regime<br />\nfive<br />\nand control the conditions and activi- bat capacity in any of the public or old regime, there is just as much<br />\narmed<br />\nforces<br />\nof<br />\nthe<br />\nUnited<br />\nStates.<br />\nties of election have never issued any<br />\nto know about Greek civilization as<br />\nstatement announcing the results of who is found to be a member of any<br />\nthere ever was. The student must rewell<br />\nrecognized<br />\nreligious<br />\nsect<br />\nan election and have never recogsort to spotting questions; the pronized any statement from any source whose creed or principles forbid its fessor cannot hope to give a thormembers<br />\nto<br />\nparticipate<br />\nin<br />\nwar<br />\nof<br />\nconcerning the outcome of an election.<br />\nough examination.<br />\nIn other words it may be said that any form.\"<br />\nA sizeable proportion of the underThe Act continues, however, and<br />\nthere never has been official recognigraduate body is home now, cutting<br />\nstates<br />\nthat<br />\neven<br />\nmembers<br />\nof<br />\npacifist<br />\nninon or announcement of a NEWSclasses. When the last test was over,<br />\nCHURNING flood had taken out the telephone line<br />\nLETTER election for editor by either sects will have to engage in non-cornthe students felt they had a right to<br />\nbatant<br />\n(even<br />\nthough<br />\nthat<br />\nserservice<br />\nthe S.A.C. or Student Council.<br />\nacross a Colorado stream. Repairmen couldn't wade<br />\nvice is aiding in direct warfare). Well, leave the campus if they had no<br />\nUnder conditions prescribe by the<br />\n'<br />\nt cross elsewhere and<br />\nit because of quicksand—couldn<br />\nthere it is—it's real, it's ready, it's classes for two or three days, and<br />\nStudent Council, the regular NEWSthe<br />\nvacation<br />\nto<br />\ninthey<br />\nstretched<br />\nobstructions.<br />\nchallenging.<br />\nbring back the line because of<br />\nLETTER elections will take place today.<br />\nWhat are you going to do about it? clude the week-end. Schedule finals<br />\n'<br />\ns master had an idea. He went upstream,<br />\nThen Kayo<br />\nfrom Monday through Friday, and<br />\n--Elizabethtown Etownian<br />\ncame back and whistled. Kayo jumped in—swam<br />\ncrossed,<br />\nthose men who have nothing to keep<br />\nacross with a cord tied to his collar. With this cord, the<br />\nthem<br />\non the Hill can leave without<br />\nBY<br />\nERROR<br />\nTRIAL<br />\nHopkins<br />\nJohns<br />\nWe students of the<br />\nhaving<br />\nto<br />\nworry<br />\nabout<br />\ncuts.<br />\nNow that the shooting is over, a<br />\nwire was soon pulled over—communication was restored.<br />\nUniversity have been invited by the<br />\nnew<br />\nsysthe<br />\nwhole<br />\nHow<br />\nsuccessful<br />\njudgment<br />\nof<br />\nthe<br />\n\"abolition<br />\nof<br />\nmidPresident to help celebrate two anA small incident. But it typifies the ingenuity which<br />\nniversities --the sixty-first Anniver- year examinations,\" is in order. How tem of \"year courses\" is, is topic for<br />\nBell System men and women to give you the world's<br />\nhelps<br />\ndiscussion some other time — after<br />\nsary of the University's founding and did the innovation work out in actelephone service.<br />\ndependable<br />\nit has been further tested. But if the<br />\nmost<br />\nthe twenty-fifth Celebration of the tual practice?<br />\nstays,<br />\nto<br />\nsystem<br />\nthese<br />\nchanges<br />\nought<br />\nPrime among the observed objecof the School of Engineering.<br />\nThere is a full program of speak- tions is the fact that some depart- be made.<br />\n—Brown Daily Herald<br />\nWhy not tglephone home more often?<br />\ners and exhibits arranged fittingly ments apparently never heard that<br />\nexams<br />\nwere<br />\nabolished.<br />\nmid-year<br />\nfor his dual celebration, and these<br />\nRates to most points are lowest after<br />\nseries of events should be attended Math. finals, for example, were giv7 P. M. and all day Sunday.<br />\nby all the students and friends of the en in courses where the second semUniversity. All of us should feel ester is invariably elected by those<br />\nproud at this time and be present in men taking the first--where the subfull force at the enjoyable celebra- ject matter is continuous.<br />\n\"We Sell Drugs and Give Service\"<br />\nStudents taking required history<br />\ntion schedule ahead.<br />\n<br />\nAssociated Colle6iale Press<br />\n<br />\nof<br />\nCollegiate Di6est<br />\n<br />\nGES<br />\n<br />\nNO MORE<br />\nCLOGGED-UP<br />\nFOUNTAIN PENS<br />\n<br />\nAt<br />\nMue<br />\n<br />\nSIEG<br />\nCapt.<br />\n<br />\nrnAm ta<br />\n<br />\nuMtklifly<br />\ntibefore<br />\nS'ta2li'lhiltegPe<br />\neal<br />\nde:cari<br />\n<br />\nk<br />\nquick<br />\n<br />\nt)thi(a°e:rel,rtheeebsda4 ant.<br />\ndbRil<br />\n<br />\nh:<br />\nWhen<br />\n<br />\nAnother Hopkins<br />\nVictory<br />\n<br />\nWa<br />\n<br />\nrn<br />\n<br />\nYOU MEAN<br />\n<br />\nE<br />\n<br />\ntt<br />\n. GS<br />\n<br />\nI<br />\n<br />\nTHOUGHTCHRISTMASIEIR<br />\nWAS IN DEC<br />\n<br />\nplatyst)fh1 -1( hhIrt:ee<br />\nCltPr<br />\ng<br />\no<br />\nn<br />\nt<br />\nk<br />\nr<br />\nr<br />\no<br />\n:<br />\nCiW<br />\ni<br />\nc<br />\n(<br />\naC<br />\nf<br />\nr1<br />\n:<br />\nlOng<br />\n<br />\nrLerk<br />\n<br />\nthat<br />\n<br />\nt<br />\nr<br />\nCi<br />\n<br />\n•••<br />\n<br />\nthreat<br />\n<br />\nSAVED E 140U6H<br />\nMONEY SMOKING<br />\nEDGEWORTH JR, ;<br />\nTO BUY IT.<br />\n<br />\nPNri<br />\n)lo<br />\nndta<br />\n.<br />\n<br />\nns<br />\n<br />\nWASTE.SMOKES SWEET<br />\nAND MILD DOWN TO THE HEEL. ITS GREAT '<br />\n<br />\n:<br />\n1dt14.:6::::<br />\n15°e<br />\n8t4a.<br />\nOwathrejri e<br />\n:<br />\nnrrtn<br />\nCr s<br />\nPhiekh<br />\nt<br />\nn<br />\ne<br />\njuaed°e,°14atrair<br />\nHo<br />\nllopk<br />\n<br />\nSome Facts<br />\n<br />\na poi<br />\n<br />\ntense<br />\n00p_<br />\n<br />\nt<br />\nifV),„ r<br />\n7:eir<br />\n<br />\ngin<br />\nttia.<br />\nfoul .<br />\n<br />\nt.<br />\n<br />\nSc.<br />\n.<br />\nwrapped<br />\n<br />\nMo<br />\n<br />\nHo<br />\n<br />\nAMAZING VALUE!<br />\n$P-2 POUCH<br />\nFOR 10‘<br />\nIN YOUR COLLEGE COLORS<br />\nWe make this amazing offer<br />\nof a 81.00 English Type<br />\nFolding Pouch in Rep Cloth<br />\nwith Rubberized 'Liner for<br />\nonly 100 and one wrapper<br />\nto persuade you to try Edgeworth Jr. Send the inside<br />\nwhite paraffin wrapper and<br />\nyour dime together with<br />\nthe coupon (or print your<br />\nname, college and address<br />\non the wrapper)—and we<br />\nwill send your pouch. Only<br />\none to a customer.<br />\n<br />\nA<br />\n<br />\nAn Acceptance<br />\n<br />\nPEABODY<br />\nPHARMACY<br />\nCalvert and 30th Streets<br />\n<br />\n0V<br />\n<br />\nSPECIAL<br />\nOFFER<br />\nEMI 1111111ER Ems FIENEI<br />\n1Lerus & Bro. Co., Richmond, Vs.<br />\nEnclosed find lO0, and one inside white<br />\nparaffin wrapper from a tin of Edgeworth<br />\nJr., for which send me 51.00 value milk<br />\niohacco pouch in my college colors.(Pfooae<br />\nI print.)<br />\n<br />\nI<br />\n<br />\nI<br />\n<br />\nI Nama<br />\n<br />\nI Address<br />\nI lily<br />\n1<br />\nI C01.1 FGF<br />\n<br />\nL<br />\n<br />\nOM MI NIP IIIIII<br />\n<br />\n1<br />\n<br />\n\fHOMEWOOD, BALTiMORE, FEBRUARY 12, 1937<br />\n<br />\n&unties Score Tanksters Trounce<br />\nAs Weiner<br />\nOver Jay Five Terps<br />\nAnd Radner Shine<br />\nAt Emmitsburg Blue Jays Smear Maryland<br />\nTo The Tune Of 39-29<br />\nBlue Jay Defense Falters In<br />\nAt Washington<br />\nSecond Half Attack<br />\nOf Mountaineers<br />\nMeet Decided By Victory In<br />\nThe 440 Yard Relay<br />\nSIEGEL OUTSTANDING<br />\nIn 4:10.4's<br />\n<br />\nCapt. Kokie Of Mt.St. Mary's<br />\nChalks Up 15 Points<br />\nAs High Scorer<br />\nA fast moving, fast breaking Mt.<br />\nst. Mary's quintet defeated Johns<br />\nHopkins last Tuesday evening at<br />\ntnunitsburg to score their sixth<br />\nleague victory. The Galloping Saints<br />\nfunctioned smoothly enough to erase<br />\nally doubt as to their superiority in<br />\nthe Maryland Intercollegiate League.<br />\nThe final score of the contest, played<br />\nbefore an aroused crowd of hoop fans,<br />\nwas 41-19.<br />\nFast First Half<br />\nThe play during the first half was<br />\neaPecially fast, with the Blue Jay<br />\nquick break on tap-off and pick-off<br />\nPlays working as the main phase of<br />\nthe attack. The Malloneemen emPloyed the zone defense throughout<br />\nthe battle and were well nigh imPregnable at times, altho the better<br />\nhall handling of the home team enabled them to break through to score,<br />\nWhen catching the Jays unawares.<br />\nIt should be stated that a strong<br />\nHopkins defense kept down the home<br />\nteam scoring during the first period,<br />\nbut were unable to stop the Mountmen<br />\nNM coming through during the 5ec011(1 canto. Hopkins took the lead at<br />\nthe offset with a 3-2 margin, but a<br />\nleng toss by Kokie, the Mount captain, dissolved this, and the visitors<br />\nWere never threatened seriously since<br />\nthat incident. Apichella was the chief<br />\nthreat during the scoring rampage<br />\nthat followed, scoring 8 of the 15<br />\nPoints that his team scored for that<br />\nPriod. Siegel's two field goals, reinforced by numerous fouls thrown by<br />\nthe Jays, set the Black and Blue<br />\ntharkers at 8.<br />\nSad Second Half<br />\nThe last half was decisive as the<br />\nturning point, for the home team<br />\ncored 26 points to the 11 counters<br />\nfor Johns Hopkins. In this section of<br />\nthe contest, Kokie, guard and the outStanding man on the floor, went wild<br />\nto pull his scoring total up to 15<br />\nPoints for the evening. His handling<br />\nef the ball was a beautiful thing to<br />\nWatch, and his passing was responsible for the defeat of the Hopkins zone<br />\ndefense in the latter phase of the<br />\n4frair.<br />\nHopping Herby Siegel was the<br />\nHopkins high scorer with a total of<br />\nPoints, made on 4 field goals.<br />\nAmong other things seen at the<br />\ngame . . . the clever Hopkins defense in the first half . . . Siegel's<br />\nPV-up at the crucial moment to give<br />\na last ray of hope. . . Dimmy Tragkia running around big Frank Apich'lla on a lay up . . . the number of<br />\nroul shots taken . ..<br />\nScore by periods:<br />\nMount St. Mary's<br />\n15 26--41<br />\n8 11-19<br />\nHopkins<br />\n<br />\nThe Black and Blue natators( led<br />\nby Captain Danny Weiner, turned<br />\ndown the University of Maryland<br />\nswimming team by the score of 3929 in a closely contested meet at the<br />\nShoreham Hotel pool, Washington,<br />\nD.C., last Monday evening.<br />\nLast Event Decisive<br />\nThe meet was undecided until the<br />\nlast event, the 400 yard relay, in<br />\nwhich every man swam even, until<br />\nZoel Radner, the anchor man, sprinted<br />\nto give 'Hopkins the race and meet.<br />\nThe next opponents of the Blue Jay<br />\naggregation will be Lehigh who will<br />\nbe met Saturday, 3 P.M. at the Baltimore City College Pool. It has been<br />\nmany years since Hopkins can boast<br />\nof such a club as this year's. A request<br />\nfor a larger turnout at the meets has<br />\nbeen made to the student body by the<br />\nteam and Coach Hambleton.<br />\nThe results of the contest are as<br />\nfollows:<br />\n100 Yard Free Style: Prinz, Maryland; 13. Adler, Hopkins; A. Hill, Hopkins; Time, 2:43s.<br />\n50 Yard Free Style —Goldberg,<br />\nMaryland; L. Adler, Hopkins, Wood,<br />\n(Continued on Page 4, Col. 6)<br />\n<br />\nFraternity Fives<br />\nReach Final Stage<br />\nWith four weeks remaining of frat<br />\nbasketball, Kappa Alpha and Pi<br />\nLambda are knotted for top honors<br />\nin division A while Phi Gamma Delta<br />\nthreatens to run away in the other<br />\ndivision. All these squads copped conl.ests Saturday. K.S.. defeated the<br />\nPhi Sigma Delta crew, and Pi Lam<br />\nEpsilon<br />\nPi<br />\nits fourth<br />\nhanded<br />\ndefeat. The other leader, Phi Gamma<br />\nDelta, also won in a low scoring contest with Phi Alpha. Only seven field<br />\ngoals were netted by both teams with<br />\nPhi Gam tallying four to nose out<br />\nthe P. A. five 8-6.<br />\nD. U. Versus PI Lams<br />\nDelta Upsilon conquered Kappa Alpha to remain in the pennant race.<br />\nAfter a hard fought match, K. A.<br />\ndropped the game 18-10. The D. U.<br />\nand Pi Lam courtmen are closely<br />\nmatched in points towards the frat<br />\ntoken, and both are trying to secure<br />\nthe basketball crown to strengthen<br />\ntheir claim to the award. On Saturday, February 20, Kappa Sigma will<br />\nmeet the Delta Upsilon representatives. Even at this date, this battle<br />\nwill be important in deciding the<br />\ntitle.<br />\nIn other encounters Saturday,<br />\nO.K.O. Delta Phi, and Tau 41pha<br />\nOmega netted victories.<br />\n<br />\nto our Men's Shop on the first floor, and our Young Men's<br />\nShop on the third. Perhaps you won't even have to come<br />\nin; try writing or phoning us!<br />\n<br />\nflUTZLEK B?THEM (,;\\<br />\nFFor Your<br />\nLiquors<br />\n<br />\nJays were victorious in the single<br />\nwall matches.<br />\nBecause of the practice the Jay<br />\nwalimen have had this year in the<br />\nfour wall game ,they expect to win<br />\nboth Friday and Saturday, repeating<br />\nin single wall, and winning in four<br />\nwall.<br />\nIntramural Finals<br />\nMeanwhile, the intramural handball<br />\ntournament has reached the finals,<br />\nwith Milt Alperstein and Phil Small<br />\nscheduled to play the championship<br />\nmatch next week.<br />\nIn a hard fought semi-final match,<br />\nPhil Small defeated Floyd Katskc,<br />\n21-15, 16-21, 21- 18. The other finalist, Milt Alperstein reached his goal<br />\nby disposing of Harry Nierenberg,<br />\nKatane and Nierenberg will receive<br />\nbronze medals and the gold and silver medals go to Alperstein and<br />\nSmall, depending on the victor in the<br />\nfinal match.<br />\nA summary of Thursday night's<br />\nmatch with the Police A.C. follows:<br />\n<br />\nIf you're in tune with the times, you'll wear only<br />\nArrow shirts with their proper team mates, Arrow<br />\nties. The tenor on the right wears the Kent model,<br />\nan oxford shirt in new polychrome stripes—$2. The<br />\nArrow tie is particularly designed to go with it--$1.<br />\nOn the left is Arrow Hitt with the Aroset wiltless<br />\ncollar—$2.<br />\n<br />\nSINGLES<br />\n<br />\nI. Milberg, J.H.U., defeated J. AlexBecause of the fine showing and<br />\nander; 15-5, 10-15, 15-2.<br />\ngood condition of the team high<br />\nR. Pasternak, J.H.U. defeated E.<br />\nhopes were held for victory over the<br />\nParr; 15-12, 15-6.<br />\nstrong invading Virginia team.<br />\nThe Jays encounter the Cavaliers<br />\nFriday evening at Homewood in a<br />\nseries of single wall matches. Saturday morning the teams clash at the<br />\nY.M.C.A. courts in four wall handball. The Virginia team, led by Ferguson, Conrad, Lynn, and Rosen, hope<br />\nto do better than last year, when the<br />\n<br />\nClose Harmony<br />\n<br />\nMitoga—tailored to fit<br />\n<br />\nSanforized Shrunk<br />\n<br />\nM. Alperstein, J.H.U., defeated A.<br />\nSennet; 15-8, 15-5.<br />\nDOUBLES<br />\nBurns and Kleimik, Police A.C., defeated Finkelstein and Hernandez, 1513, 12-15, 15?9.<br />\nMilberg and Pasternak, J.H.U., defeated Rice and Rogers; 15-8, 15-8.<br />\n<br />\n•<br />\n<br />\n\"The Voice of Experience\"...<br />\nthe man with the million dollar throat<br />\ninsists on a light smoke<br />\n\"My voice is my career. It has inspired more than five million people<br />\nto confide in me their personal problems. During 25 years, first on the<br />\nlecture platform and then on the air,<br />\nI have never missed a single engagement because of my throat. I am a<br />\nsteady smoker,and because my throat<br />\nand voice are vital to my career I insist upon a light smoke. In Luckies I<br />\nfind a light smoke plus the enjoyment<br />\nof fine tobacco ... and that's why<br />\nLucky Strikes have been my choice<br />\nfor 14 years.\"<br />\nsteyziro<br />\n<br />\nFRIEND AND COUNSELOR<br />\nTO MILLIONS OF RADIO LISTENERS<br />\n<br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br />\n<br />\nSeeHARRY<br />\n3113 GREENMOUNT AVE.<br />\nPhone UN. 4883<br />\nFor Delivery<br />\n<br />\nNEW YORK LOAN OFFICE<br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\nInstruments, slide rules.<br />\n<br />\n118 North Liberty Street<br />\n<br />\nThe<br />\nHopkins handball varsity<br />\ncaught the Police A. C. flatfooted<br />\nThursday night in a hard fought<br />\nstrugggle by a score of 4-1. The handballers took the police in their stride,<br />\nin prelude to the big match this<br />\nweek-end with the University of Virginia at Homewood.<br />\nMilberg Wins<br />\nIn the first singles match, Iry<br />\nMilberg defeated Jos. Alexander by<br />\na score of 15-5, 10-15, 15-2. In the<br />\nsecond singles match Dick Pasternak<br />\nfollowed up with another victory over<br />\nEd Parr to the tune of 21-15, 15-6.<br />\nIn the third singles, Milt Alperstein<br />\ncompleted the sweep of the singles<br />\nmatches by taking over Al. Sennet,<br />\n15-8, 15-5.<br />\nIn the double matches, Iry Milberg paired with Dick Pasternak to<br />\ntrounce the Police team of Lowrey<br />\nRogers and Bob Rice, 15-8, 15-8.<br />\nHowever, Captain Nat Finkelstein<br />\nand Joe Hernandez were tripped up<br />\nby John Burns and George Kleimik<br />\nby a score of 15-13, 12-15, 15-9. A<br />\nreturn match is being arranged for a<br />\nlater date.<br />\n<br />\namong professional men and women lawyers,<br />\ndoctors,lecturers,scientists,etc.Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\n\"The Voice of Experience\" verifies the wisdom<br />\nof this preference,and so do other leading artists<br />\nof the radio,stage,screen and opera.Their voices<br />\nare their fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies — a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br />\n<br />\nIs at your service—though we call your attention especially<br />\n<br />\nUnexcelled Fountain Service<br />\n<br />\nBaltimore Police Department Hanclballers Lose 4-1 To<br />\nScrappy Hopkins Team<br />\n<br />\nAn independent survey was made recently<br />\n<br />\nSo we'd like to file for future reference that our whole store<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nBlue Jay Wallmen Defeat Police<br />\n<br />\nDelta Phi and Tau Alpha Omega<br />\ndefeated Beta Theta Pi and Phi Kappa Psi respectively. Games in both<br />\ndivisions are scheduled for Saturday.<br />\n<br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCkIN A WHILE<br />\n<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br />\n<br />\na<br />\n<br />\n1<br />\n<br />\nPlaza 3495<br />\n<br />\nA Light Smoke<br />\n\"Ies Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\n<br />\nCopyright 1937. The American Tobacco Comma,'<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FEBRUARY 1'2, 1937<br />\n<br />\n4<br />\n<br />\nHullabaloo Beats J.H.U. Gazette Issued<br />\nTanksters Trounce<br />\nAssembly Hears Kemp Threatens To Bury<br />\nAs<br />\nOfficial<br />\nJournal<br />\nDarace Board in lioneyBags Distributed To Staff<br />\nTerps As Weiner<br />\nHugh II. Clegg,<br />\nAnd Radner Shine<br />\nAce Detective<br />\nThe NEWS-LETTER reports a rival<br />\nPublication To Be Placed On Less publication, recently appearing on the<br />\nFormal Basis In Future<br />\nCampus. Coming in this case, not<br />\n,<br />\nBy J. Niurray Kempton<br />\nwhat of the all-essential quality?<br />\nUnder Branoner<br />\nfrom the student body, but from the<br />\nWhen Hal Kemp takes the band- Where was the great tradition of Brx<br />\nadministrative offices, a news journal,<br />\nstand of the Lord Baltimore a week .and Tram, of Louis and Earl, of<br />\nAt a meeting of the Hulabaloo staff of uncertain publication schedule, will<br />\nfrom Monday, the membership of the Muggsy and Benny? In short, whith- held Wednesday noon, initial assign- make at<br />\nleast two bows this spring.<br />\nCotillion Board is reputedly in grave er jam? Hot protests flowed into the ments for the year were distributed The first issue is already a reality, and<br />\ndanger of being buried six-feet deep Cotillion Board, but requests for Lo staff members and candidates. a second is planned. Further than that,<br />\nThere will be another meeting Mon- the director would not go. The publitickets flowed in faster.<br />\nin money-bags.<br />\nday at 12.30 P.M. at which time all cation bears the name, Johns Hopkins<br />\nreturns<br />\nhave<br />\nfact,<br />\nif<br />\nthe<br />\nearly<br />\nIn<br />\nAnd so, the tragic rout is complete.<br />\nother students interested in trying University Gazette and is now of a<br />\nany bearing on the conc!usion, the Hal Kemp, who has the temerity to out for the staff should be present.<br />\nmainly official character. It will be<br />\nsaid Cotillion Board is about to ex- play strictly for dancers, is outsell\"This year's Hullabaloo,\" said Ger- mailed to all Alumni and other interperience the same general sensations ing the immortals by a safe margin. ald Branower, managing editor, \"will ested persons. A quarterly organizaas the man who struck oil while he Some of the swingtasters still grum- be on a more informal basis than those tion is being considered.<br />\nof preceding years.\" It is hoped that<br />\nwas digging a well.<br />\nble and cry havoc with many a dire<br />\na .rnore interesting yearbook will be<br />\nAll of which constitutes a pretty prediction of worse chings for the futurned out as a result of this policy.<br />\ntragic blow to the swing savants. By ture. But the majority, in the great<br />\nAt the meeting of the Gas EngiOutstanding bills of each actand large it's the worst shock to any Amer:can tradition, have accepted<br />\nneering Asociation which was held<br />\nivity and fraternity must be<br />\nlast Thursday in Maryland Hall, Dr.<br />\ncampus group since the Levering Hall the inevitable. It is reported that one<br />\npaid before March 1, or its<br />\nJ. W. Huff, head of the Gas Engipicture will not appear in the<br />\npitchman bid four on the Queen, of the bitterest of the die-hards was<br />\nneering Department, gave a lecture<br />\nannual.<br />\nseen<br />\nlast<br />\nWednsday<br />\ndickering<br />\nfor<br />\nnine and five of spades.<br />\non his recent travels in the Yosemite.<br />\nthree tickets (price $3.00 per ard<br />\nFor the last two years la jazz hot<br />\nobtainable from freshmen candidates of man he has only spoken well of His interesting narrative was accomhas reigned supreme. Any discus- for the Cotillion Board).<br />\npaaied by color photographs.<br />\none chorus recorded by one musician<br />\nsion of a Hopkins dance was accomAs a matter of fact, Hal Kemp who died six years ago--even a,dirritpanied by fervent \"swing, gates\" seems to have been<br />\ngrossly maligned. ted in a bfirst of confidence that he<br />\nand \"skip the gutters.\" Tommy Dor- True, his band is<br />\nadmittedly of the expects to enjoy the Cotillion \"very<br />\nsey, Jimmy Lunceford, Will Hudson, \"sweet\" variety, but it is<br />\ndistinctly much.\" \"After all,\" he said sadly,<br />\nMal Hallett, Benny Goodman—such not saccharine. One expert-reput- \"there must be something !n a bandl<br />\nIs the roster of great names which edly so particular<br />\nthat in the memory 'hat can draw this crowd.\"<br />\nhave graced the orchestra platform.<br />\n<br />\n(Continued from Page 1, Col. 1.)<br />\nPeoples of ancient times had types<br />\nof personal identification, such as<br />\nbranding, mutilation and Somatic<br />\nmeasurement. However, China was<br />\nalready using thumb prints in business. By 1850, it was discovered in<br />\nEurope that the characteristic marks<br />\non finger hubs could not be removed<br />\nby mutilation.<br />\nScotland Yard set up a fingerprint filing system in 1901. In 1924<br />\nthe United States set up its fingerprint clearing house in Washington.<br />\nIt now has the prints of some six million people, ten of each. 4,000 prints<br />\na day come pouring in, but an average of 52 out of 100 are already on<br />\nfile. When fingerprints of a suspicious<br />\ncharacter are sent to Washington, in<br />\nless than five minutes his prints and<br />\nrecord, if on file, may be found. This<br />\nrecord helps in the giving of a sentence in keeping with the type of<br />\ncriminal. It is also useful in amnesia<br />\ncases.<br />\nAn invitation to private individuels<br />\nto have their prints on a separate file<br />\nin Washington, for purposes which<br />\nWhen the Cotillion Board smashed<br />\nmay be useful to them, has been is- the iron last month by signing Hal<br />\nsued by J. Edgar Hoover.<br />\nKemp, loud were the wailings from<br />\nMechanical Devices<br />\ndevotees of the arts. The whisper<br />\nThose concerned with scientific de- flitted about the record columns that<br />\ntection are taking advantage of the the Boardmen would be lucky to carry<br />\ncreative genius of men to apply new home their shirts from the debacle.<br />\ninventions to crime detection. TypiOf course Hal Kemp was popular<br />\ncal among these are the ultraviolet<br />\n---so popular, in fact, that the Repuband x-rays.<br />\nlican party was reported on the verge<br />\nChemical analyses, watermark deof disregarding his North Carolina<br />\ntectors, spectrograph and ballistics<br />\nancestry and nominating him to run<br />\nall play their part. These men go<br />\nagainst Mr. Roosevelt in 1940. But,<br />\nthrough all these checks every day,•<br />\nusing all known electrical, mechanical,<br />\nand scientific detection devices, that<br />\ncriminals may be made to spend their<br />\nPrinters of<br />\nlives under \"supervised Federal jurisPHILOLOGICAL and<br />\ndiction. Mr. Clegg closed with the<br />\nSCIENTIFIC PUBLICATIONS<br />\nwords \"We have this fight (on crime)<br />\n12-20 Hopkins Place Baltimore<br />\nto win; we shall win!\"<br />\n<br />\n1<br />\n<br />\nJ. H. FURST<br />\n<br />\nDr. Huff Talks On Travels<br />\n<br />\n(Continued from Page 3, Col. 2)<br />\n<br />\nMaryland; Time, 27 3-5s.<br />\nDiving—Goldberg, Maryland; Jacob, Hopkins; Gacheal, Maryland.<br />\n440 Yard Free Style—Z. Radner,<br />\nHopkins! B. Adler, Hopkins; Balmer,<br />\nMaryland; Time, 6.17:3-5s.<br />\n150 Yard Backstroke—D. Weiner,<br />\nCaptain, Hopkins; McClure, Maryland;<br />\n<br />\nReekard,<br />\n<br />\nMaryland;<br />\n<br />\n200 Yard Breastroke — Blucher,<br />\nHopkins; Gatch, Maryland; Time,<br />\n2:55s.<br />\n100 Yard Free Style — L. Adler,<br />\nHopkins; Wood, Pitzer, Maryland;<br />\nTime, 1.00:3-5s.<br />\n400 Yard Free Style Relay—Hopkins (Abrahams, Hill, B. Adler, Radner ); Maryland; Time, 4.10:4-10s.<br />\n<br />\nN the making of fine<br />\n<br />\nI<br />\n<br />\nFINAL SALE of the SEASON!<br />\nAll Overcoats<br />\nand Topcoats<br />\nREDUCED!<br />\n<br />\nAll Fall and<br />\nWinter Suits<br />\noil IA ofF<br />\n<br />\n$25 to $100 Overcoats<br />\nnow $18.50 to $76.75<br />\n$22.50 to $75 Topcoats,<br />\nnow $16.75 to $56.75<br />\n<br />\nOnly Blues and Blacks<br />\nExcepted<br />\n<br />\nbeer<br />\n<br />\nthere is no sub-<br />\n<br />\nstitute for time ...<br />\nand here at National<br />\n... we take ow time.<br />\n<br />\nCO.<br />\n<br />\nKATZ CLOTHES<br />\n7 and 9 E. Baltimore Street • 2 Ho urs Free Parkinu, New Mid City<br />\n<br />\nTime,<br />\n<br />\n1.54:3-5s.<br />\n<br />\nThe National Brewing Co.<br />\nBALTIMORE MD.<br />\n<br />\nof<br />\non<br />\nva<br />\nlas<br />\nbei<br />\n<br />\nan<br />\nwe<br />\nific<br />\ntra<br />\nba<br />\nqu<br />\nite<br />\nthe<br />\nof<br />\ngi v<br />\neit<br />\nper<br />\nwa<br />\nust<br />\nble<br />\nof<br />\nAn<br />\nwh<br />\nac<br />\neve<br />\n'Ba<br />\nat<br />\n,ber<br />\n<br />\nma<br />\nroN&<br />\n<br />\nCu',<br />\n<br />\nswi<br />\nthe<br />\ning<br />\ntin(<br />\nhon<br />\nDel<br />\n<br />\nwor<br />\nSta.<br />\nior,<br />\nfrat<br />\nmai<br />\ning.<br />\nmet<br />\n<br />\npos;<br />\n<br />\nthir<br />\nvitz<br />\nBar<br />\nfor<br />\n<br />\nFrom tobaccofarm toshipping<br />\nroom...at every stage in the making of Chesterfield Cigarettes...Job<br />\nNumber One is to see that Chesterfields are made to Satisfy.<br />\nIn the fields...at the auction markets<br />\n...and in the storage warehouses...<br />\nJob Number One is to see that Chesterfield tobaccos are MILD and RIPE.<br />\nIn the Blending Department Job<br />\nNumber One is to\"weld\"our homegrown tobaccos with aromatic Turkish to the exact Chesterfield formula,.<br />\n<br />\nIn the Cutting<br />\n<br />\nand Making Departments Job Number One is to cut the<br />\ntobacco into long clean shreds and<br />\nroll it in pure cigarette paper.<br />\n<br />\npre:<br />\n<br />\nSau<br />\ncote<br />\n<br />\n0<br />\nsop'<br />\nsqui<br />\nof<br />\nRob<br />\nroll.<br />\nA<br />\nthe<br />\nby<br />\n<br />\nSOOT<br />\n<br />\nelec<br />\nfor<br />\nfor<br />\n<br />\nInc<br />\n<br />\nT.<br />\n<br />\nHop<br />\n<br />\nDay<br />\nflier<br />\nfron<br />\n<br />\n0<br />\nCoil<br />\nthe<br />\nfive<br />\n<br />\nsix ,<br />\nfour<br />\nand<br />\nInst<br />\nlege<br />\n<br />\npale<br />\n<br />\ni_.pyriOit 1937. .1..IG6tri C. 1'1<br />\n<br />\nLAS I 01.5A( t,0 CO.<br />\n<br />\n•• Chesterfields are made to give you the things<br />\nyou enjoy in a cigarette... refreshing mildness<br />\n...pleasing taste and aroma. They Satisfy.<br />\n<br />\nstud<br />\nPort<br />\nP. A<br />\n<br />\nAPI),<br />\n<br />\n\f", "format": "basic_html", "processed": ".rtirr<br />\nifintikins Nnus-41<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nHOMEWOOD, BALTIMORE, FEBRUARY 12. 1937<br /><br />\nVOL. XLI, NO. 22<br /><br />\nSanderson Strikes<br />\nAssembly Hears Sachs Thinks President's<br />\nCourt Bill Avoids Real Issues Keynote Of Down<br />\nHugh H. Clegg, Instructor<br />\nAsserts That Roosevelt Desires \"Packed Court\"; The Bay Conference<br />\nAdds That Powers Should Be Curbed And<br />\nAce Detective<br />\nClergyman Declares 'Hell Is<br />\nMeans Perhaps Justified<br />\n\"If I were in Congress, I should<br />\nvote for the proposal, but I don't<br />\nthink that the proposal of the President meets the real issue before the<br />\ncountry. That issue is who shall have<br />\nfinal say in the making of laws:<br />\nMETHODS EXPLAINED the<br />\nthe peoples' representatives, responsible to the people for what they do,<br />\nDiscusses Training G - Men; or nine judges (and in many cases<br />\nfive) sitting for life without any reAttitude Of Nation;<br />\nsponsibility to the people.<br />\nFinger-Printing<br />\n\"The President's proposal does not<br />\nmeet the issue squarely. Under his<br />\nThe first of the student assemproposal the Supreme Court will conblies under the new 'voluntary attinue to have the final say over legistendance system was addressed yesterlation, the only difference being that<br />\nday by Hugh H. Clegg, assistant dithe President desires a particular<br />\nrector of the Federal Bureau of InSupreme Court which would look<br />\nvestigation at Washington, D. C. Mr.<br />\nwith favor upon his social and econClegg spoke on \"Scientific Crime Deomic reforms.\"<br />\ntection.\"<br />\nWith this statement Mr. Leon<br />\nThe assembly was presided over Sachs, instructor in Constitutional<br />\nby Hershner Cross, president of the Law and American Government at<br />\nassembly the Hopkins, expressed views on that<br />\nCouncil. The<br />\nStudegit<br />\nroom M Latrobe Hall was filled. part of President Roosevelt's proAfter the singing of the Ode, the posed court reform which dealt with<br />\nspeaker was introduced by Hershner the highest tribunal itself. Mr. Sachs,<br />\nCross.<br />\nwhen interviewed by a NEWS-LETTER<br />\nEntrance Into The F. B. I.<br />\nreporter, declared that he was in<br />\nMr. Clegg brought out that while hearty accord with all other sections<br />\nin ancient times there was an ex- of the bill, but that adding six justices<br />\naggerated individualism in law en- was but a \"naked attempt to pack the<br />\nforcement, with the wounded party Supreme Court so as to ensue the conacting as both detective and prose- stitutionality of New Deal legislacutor, we realize today that training tion.\"<br />\nHe asserted that something could<br />\nmen for detection is important as<br />\ntraining them for judges or prose- be said for the President's position:<br />\n\"If the Constitution contained the ancutors.<br />\nShortly after J. Edgar Hoover be- swers to all these constitutional quescame head of the Federal Bureau of tions, then obviously there would be<br />\nInvestigation, he set the rigid stand- no justification for the President's<br />\nards now followed for candidacy in the quarreling with the Supreme Court,<br />\nservice. An applicant must be be- because all the Supreme Court would<br />\ntween 25 and 35 years of age, a law be doing is interpreting and telling<br />\nschool graduate, or a certified ac- you what is in the Constitution, so<br />\ncountant, and in good health. After that, if you are dissatisfied, then don't<br /><br />\nAssistant Head Of F. B. I.<br />\nSpeaks On \"Scientific<br />\nCrime Detection\"<br /><br />\n0<br />\nY,<br />\n'n<br /><br />\nIn<br />\nS.<br /><br />\nle<br /><br />\nIf<br /><br />\n'S<br />\n-r<br />\ng,<br />\nse<br /><br />\nYof<br />\nd,<br />\nes<br />\n.1,<br />\nhe<br /><br />\na thorough investigation, a candidate<br />\nis declared either eligible or ineligible.<br />\nRigorous Training Necessary<br />\nIf eligible, the candidate goes<br />\nthrough a rigorous seven-day-a-week<br />\ntraining period in scientific crime detection, crime statistics, and adapta- Thomas Plaque Will Also Be<br />\nbility to various calls. He is trained<br />\nOffered On Commemto effect a coordination of police faoration Day<br />\ncilities all over the country, as was<br />\nThe Commemoration Day Exernecessary in the Urschell kidnapping<br />\ncase. He must also learn to put his cises at The Johns Hopkins Univerwit against a criminal brain, and how sity will be signalized by the preto handle himself in any emergency. sentation of two memorials. A bust by<br />\nMr. Clegg showed that certain Dr. John H. Latane will be presented<br />\ncriminals possessing various talents, by a committee, with Senator George<br />\nmight have been a credit rather than L. Radcliffe acting as spokesman, and<br />\na hindrance to society, had they been a bronze plaque commemmorating the<br />\nbrought under a good influence in services of Douglas H. Thomas, the<br />\narchitect responsible in large measyouth.<br />\nure<br />\nfor the Homewood buildings and<br />\nCrime statistics also play an important part in the study of crime de- planning, will be given to the Univertection. They show, for instance, that sity.<br /><br />\nblame the Supreme Court, but blame<br />\nthe Constitution.<br />\n\"However, it so happens that the<br />\nConstitution does not contain the answers to these problems because of<br />\nits very vague and ambiguous<br />\nlanguage. Consequently, the unconstitutionality of the New Deal, for example, is not due to the Constitution, but due to the opinion of judges<br />\nas to what they think the Constitution ought to mean. Most of these<br />\nproblems could have been settled<br />\neither way; and, if a conservative<br />\ncourt decides them in a conservative<br />\nway, it must assume the responsibilitl for its choice.\"<br />\nMr. Sachs suggested that many<br />\npeople insist that the President<br />\nshould seek his reforms through a<br />\nconstitutional amendment, but he<br />\nthinks that the President could reply that \"the Constitution is adequate.<br />\nIt is not the Constitution that needs<br />\namending but the Supreme Court.\"<br />\nDiscounting the President's humanitarian motives, Mr. Sachs declared that far from easing the burden of the older justices, the measure would increase it, because among<br />\nothr things it authorizes that all<br />\ncases in lower court declaring an<br />\nact of Congress unconstitutional be<br />\nimmediately heard in the Supreme<br />\nCourt. A great majority of cases<br />\nnever reach the \"nine old men.\"<br />\n\"I favor the Supreme Court's retaining its present function of judicial review,\" Mr. Sachs asserted, \"but<br />\nI favor a constitutional amendment<br />\nthat would authorize Congress to<br />\nrepass legislation declared unconstitutional by the Court by a two-thirds<br />\nmajority. This is certainly a conservative enough check on hasty legislation.\"<br /><br />\nLatane Bust To Guttmacher Opens<br />\nBe Given Hopkins Lectures On Sex<br /><br />\n20 out of every one hundred criminals<br />\nis under voting age. However, the<br />\nfact that until recently the largest<br />\npart of these 20 was nineteen years of<br />\nage, while now they are twenty-one,<br />\nshows that our nation has become law<br />\nenforcement conscious, and that there<br />\nis no longer any hero-worship of<br />\ncriminals by youth. The desirable effect is apparent.<br />\n(Continued on Page 3, Col. 1)<br /><br />\nGeneral Bi - Sexual Theory<br />\nCenter Of First<br />\nOf Series<br />\nA sizeable group of students yesterday heard Dr. Allen Frank Critmacner, of the Johns Hopkins Medican School, open a series of lectures<br />\non sex hygiene with a general discussion. The opening lecture, 5p5iisored by the Johns Hopkins chapter<br />\nof the Amercan Students' Union was<br />\nheld in room 112, Gilman Hall.<br />\nDr. Guttmacher deplored the use of<br />\nthe term \"sex hygiene,\" saying that<br />\nit puts sex apart into a separate<br />\nchannel, when it is really a part of<br />\nthe general biological cosmos which<br />\nsurrounds us. He then proceeded to<br />\nclassify the various types of reproduction as sexual, parthenogeneties,<br />\nfaculatedal parthenogenetic, hermaphroditic, and the bisexual, with<br />\nwhich his lectures are to be concerned.<br /><br />\nThe exercises on Monday, February<br />\n22, honor Dr. Latine, a graduate of<br />\nthe class of 189, former Professor<br />\nof American History, and Dean of the<br />\nCollege of Arts and SciencOs. The<br />\ncommittee presenting the bust numbers among others: Newton D. Baker,<br />\nFrederic Bancroft, Walter H. Buck,<br />\nKent Roberts Greenfield, W. Stull<br />\nIn connection with the idea of herHelt, Charles Morris Howard, Theo- maphroditism, Dr.<br />\nGuttmacher stated<br />\ndore Marburg, and W. W. Dilloughby. that the well-known circus freak<br />\nThe bronze plaque, which is to be \"half-man and half woman\" is frauplaced near the main entrance to dulent, and is really a case of hemiGilman Hall, one of the buildings hypertrophy, which is a well known<br />\nplanned by Douglas Thomas, was human phenomenon. \"All human<br />\nconceived and designed by LoUis Ros- bodies,\" he said, \"are more or less<br />\nChemistry Professor Talking On enthal, the eminent sculptor. The asymmetrical, that is, one side is<br />\nplaque is donated by the class of more developed than the other. A<br />\nAbsolute Zero Work<br />\n1893, who are to be present in a group, woman usually discovers which of<br />\nAt Hopkins<br />\nhonoring their classmate. The pre- her profiles is the better, and turns<br />\nDr. Donald Hatch Andrews, head of sentation will be made by Siegmund that side toward you.\"<br />\nthe Johns Hopkins Department of B. Sonneborn.<br />\nAccording to Dr. Guttmacner, biChemistry, is now engaged upon a<br />\nsexual reproduction, or that in which<br />\ntour of northern cities. He is to speak Two Chem. Fellowships<br />\nthe female is fertilized by the male,<br />\nin Schenectady, Providence, Boston,<br />\nReceived At Homewood is divided into several classes: that<br />\nand Springfield, before the local chapaccompanied by no bodily contact or<br />\nTwo important fellowships in the<br />\nters of the American Chemical Sociinterest; no bodily contact, but interety, on the subject, \"Approaching Ab- department of Chemistry have been est; and the type which is charactersolute Zero.\" Dr. Andrews' work in recently renewed by their donors. ized by both contact and interest. This<br />\nthis field, carried on at the Hopkins, The DuPont Post Graduate Fellow- last type is that which takes place in<br />\nship, valued at $750, will run for an- all mammals.<br />\nplaces him among the leaders.<br />\nDuring the past years, a number of other year, beginning in September.<br />\n\"Bisexual reproduction,' said Dr..<br />\ncolleges and Universities have been Likewise, the Eli Lilly Fellowship, Guttmacher, \"has the biological adInvestigating the possibility of at- of $1000 per year, has been renewed vantage of producing a variety of<br />\ntaining the zero of the absolute tem- for four more years, starting next offspring which can cope better with<br />\nperature scale. Already within one fall.<br />\ndifferent environments.\" He contindegree, the laboratories are busy tryFrom the Rockefeller Foundation, ued to say that because of this ading to push down a few precious the University has recently accepted vantage, for example, children of a<br />\ntenths further. Dr. Andrews has been $4000 to be used on the Spenser Pro- tuberculous father and a normal<br />\none of the major contributors to these ject. This undertaking is the editing mother need not be expected to retain<br />\nefforts, and speaks with authority and publishing of a number of vol- their father's susceptibility to that<br />\n• born of actual experience.<br />\numes of the \"Faerie Queene.\"<br />\ndisease.<br /><br />\nDr. Andrews Making<br />\nNorthern Tour<br /><br />\nCHEER JAY<br />\nBASKETERS TO<br />\nVICTORY TOMORROW<br /><br />\nPerpetuity Of<br />\nInsecurity'<br />\n'Y' Delegates Miss Winant,<br />\nUnable To Attend<br />\nMeet<br />\nThe highlight of the Tri-State Student Christian Conference held last<br />\nweek-end came when Dr. Ross Sanderson said in his Sunday morning sermon, \"Hell is the perpetuity of insecurity.\" This remark struck the dominant note of the conference, which<br /><br />\nPRICE 5 CENTS<br /><br />\nStudent Council Statement<br />\nIn an official statement issued<br />\nWednesday evening, February 10,<br />\nthe Johns Hopkins Student Council announced:<br />\n\"The NEWS-LETTER 'election' has<br />\nbeen declared invalid by the Student Council on the technical<br />\ngrounds of Article I, Section 2a, of<br />\nthe S.A.C. rules; and an election<br />\nwill be held with Harold Zheutlin<br />\nand Stanley Finkel as the candidates for editorship.\"<br /><br />\nEighty Per Cent Declare<br />\nWillingness To Subscribe<br />\nTen Dollars<br />\nPLANS<br /><br />\nUNDER<br /><br />\nWAY<br /><br />\nDebaters Vie With Bradford Declares CommitBe Anounced<br />\nGeorgia Tuesday tee Will<br />\nNext Week<br />\nMaas And Sfekas Present<br />\nAffirmative On Minimum<br />\nWage Issue<br /><br />\nmet aboard the Chesapeake Line<br />\nIn what was termed \"the most sucsteamer City of Norfolk, and was cessful debate in years,\"<br />\nthe John's<br />\nattended by several hundred delegates Hopkins Debating Council met the<br />\nfrom nineteen colleges. The confer- University of Georgia Tuesday evenence was held chiefly for the discus- ing before Dr. Broadus Mitchell's<br />\nclass in Political Economy.<br />\nsion of Social Security in all its<br />\nThe topic of the debate was: Reaspects.<br />\nsolved, That Congress should be emHenry H. Leber, chairman of the powered to enact<br />\nminimum wages and<br />\narea and president of the Hopkins maximum hours for<br />\nindustry. The af\"Y\", opened the sessions of the con- firmative side was upheld<br />\nby the Hopference and introduced the speakers, kins and presented by<br />\nCharles Sfekas<br />\nwho discussed Social Security Leg- and Arthur Maass. The University<br />\nof<br />\nislation from several points of view. Georgia argued the negative side,<br />\nMr. Luther Becker, field representa- and its speakers were Chairles Fain<br />\ntive of the Social Security Board, en- and Morris Abram. Dr. Broadus Mitlarged upon the purposes of the Fed- chell acted as chairman for the deeral Social Security Act. The Rev. bate.<br />\nJoseph Nowak, Jr., pastor of St.<br />\n\"The reason for its overwhelming<br />\nPaul's Presbyterian Church, and Mr.<br />\nsuccess,\"<br />\nsaid Mr. Maass, \"was that<br />\nPhil Jacob, Secretary of the Youth<br />\nthe audience was a class in political<br />\nSection of the Emergency Peace Cameconomy which was deeply interested<br />\npaign, spoke of the major deficiencies<br />\nin the topic.\"<br />\nand international 'aspects of the legMr. Maass reported that this interislation.<br />\nest manifested itself after the debate<br />\nSocial Problems Discussed<br />\nat which time several members of<br />\nDiscussions of current social prob- th class plied<br />\nthe debaters with queslems were held in the evening, at tions.<br />\nwhich time Dr. Sanderson presided.<br />\nThe next debate on the schedule is<br />\nOf special interest to the delegates<br />\nwas the talk on the N.Y.A. and Amer- on January 27th with the University<br />\nof Virginia team. The topic will be<br />\nican Youth Act.<br />\nthe same, but the Hopkins will uphold<br />\nThe delegates were joined at Old the negative side of the question. The<br />\nPoint Comfort in the morning by a place has not been decided but will<br />\ngroup from several Virginia colleges. be announced next week in the NEWSThe augmented group went to the LETTER.<br />\nHampton Institute, whose famous<br />\ngroup of singers offered vocal entertainment. President and Mrs. Arthur Jay Grapplers, Fencers<br />\nHowe welcomed the group to the<br />\nSuffer Double Defeat<br />\nNegro institution.<br />\nThe Blue Jays suffered a dual deDr. Sanderson's Sunday morning<br />\nfeat last Tuesday evening at the<br />\nsermon climaxed the conference.<br />\nHomewood gymnasium when both the<br />\n\"Protestantism must chbose be- wrestling and fencing team bowed<br />\ntween revolution and reaction,\" he to their respective<br />\nconquerors.<br />\nsaid. \"Too often Protestantism has<br />\nThe<br />\nSt.<br />\nJohn's<br />\nlungers parried their<br />\nconcerned itself with the hereafter<br />\nand ignored the life on earth. Hell is way to a meager 10-7 victory as -the<br />\nthe perptuity of insecurity.\" In deal- Blue Jays attempted time arid again<br />\ning with the racial aspect of this to cut through their defense.<br />\nvital question Dr. Sanderson emphasized the fact that a concerted and<br />\nsincere effort must be made to give<br />\nthe Negro equal opportunity with his<br />\n\"white brothers.\"<br /><br />\nSeniors Favor<br />\nJune Week In<br />\nBallot Results<br /><br />\nThe<br />\nLafayette grapplers, too,<br />\nhelped to intensify the Blue Jay losing streak as they grunted and<br />\ngrowled their way to a 21-11 victory<br />\nover the Hopkins wrestling team<br /><br />\nBilly Igaac Band To Play<br />\nAt Musical Club Concert<br /><br />\nReturns from the ballots sent out<br />\nby the June Week committee to the<br />\nSenior Class show that eighty per<br />\ncent of those who replied favored the<br />\ncontinuation of the annual June Week.<br />\nSeventy-five per cent of the graduating class replied to the questionnaire<br />\ndistributed.<br />\nRoy Galloway, president of the<br />\nclass, issued the following statement<br />\nupon complete tabulation of returns:<br />\n\"I am very pleased with the response<br />\nof my colleagues to the appeal of the<br />\nJune Week committee, and I am sure<br /><br />\nthat with the support which has been<br />\npromised us we will be able to make<br />\na success of June Week, financially<br />\nas well as socially.\"<br />\nAverage Price<br />\nThe ballot showed that the average<br />\nof the class was in favor of a price of<br />\nten dollars per person for the entire<br />\nweek. Last year the price was twelve<br />\ndollars per person. The result of last<br />\nyear's June Week was that there was<br />\na full week of activity, with the Senior Ball, Junior Prom, Night Club<br />\nParty, Tea Dances, and other events.<br />\nThe June Week festivities take place<br />\nduring the first week after exams, in<br />\norder to finish off the school year with<br />\na memorable celebration.<br />\nJames Bradford, chairman of the<br />\ncommittee, stated that he would appoint a large group to assist him in<br />\nmaking the necessary arrangements,<br />\nsuch as bands, halls, and other things<br />\nincidental to its success.<br /><br />\n•<br /><br />\nPlayshop ToSponsor<br />\nStrinberg Festival<br />\nPlay To Follow Dr. Miller's Lecture<br />\nOn Playwright Next<br />\nTuesday Evening<br />\nThe Playshop-sponsored Strindberg<br />\nFestival will get under way next Tuesday, with an evening devoted to a lecture and play. The lecture will be<br />\ndelivered by Dr. Anne Irena Millere,<br />\nprofessor of English at Goucher College, on the subject, \"August Strindberg, the Father of Expression.\" Following this, Director N. B. Fagin announces, will be presented the play,<br />\n\"First Warning,\" by Strindberg.<br /><br />\nBy Bobby Hildreth<br />\nOn Friday, February 26, at 8.15 the<br />\nenjoyment of five and one-half hours<br />\nwill get under way at the Maryland<br />\nCasualty Auditorium. The ball of<br />\ngood time will start rolling with the<br />\nvarious departments of the club presenting their achievements from past<br />\nrehearsals. This includes the Glee<br />\nClub, Banjo Club, Hawaiian Troupe,<br />\nQuartette, Blue Jay orchestra and<br />\nsoloists who will render a few \"bars<br />\nin search of melody.\" This part of the<br />\nprogram should conclude about 10.15,<br />\nbut then it is only the beginning.<br />\nAt 10.30, and continuing until 1.00,<br />\nBilly Isaac and his Commanders will<br />\nfurnish some of the best type of music<br />\never heard in Baltimore.This organization under Little Man With Big Stuff<br />\nIsaac, has been playing for quite a<br />\nfew years without a break-up among<br />\nthe musicians—as so many of the<br />\nother local bands have done.<br /><br />\nThe Festival is dedicated to the late<br />\ngood. For ten pieces they do not only<br />\nMiss<br />\nFrances Jordan for many years<br />\nplay loud, but sweet and soft.<br />\na<br />\nleading<br />\nfigure of the Homewood<br />\nTwo fine vocalists, Doris Scharron<br />\nDramatic<br />\norganization.<br />\nThe program<br />\nand Ed Melvin, another Kenny Sargent, lend a chorus or two for those is scheduled for 8.30 P.M., at the<br />\nwho desire words with their music. Playshop. Tickets will be twenty-five<br />\nThe drummer, is Baltimore's Gene cents, save for season subscribers,<br />\nKrupa, while their leader, Billy Isaac, who will be admitted on their sublooks like a small edition of Paul scriptions.<br />\nThe cast for the play includes Patty<br />\nWhiteman and plays like Bunny<br />\nSinglewald,<br />\nHelen Ascherfeld, Leola<br />\nBerrigan. Ed Wolfe is the trombone<br />\nman in the band, and he resembles Myers, and Gerald Branower. The<br />\ngroup is under the direction of Myra<br />\nTommy Dorsey.<br />\nLehr.<br />\nTown Jobs<br /><br />\nEvery Saturday<br />\nThe commanders can be heard<br />\nregularly every Saturday night at the<br />\nMount Holly Inn at Walbrook.<br />\nThey have been there steady for two<br />\nsolid years, and any band that can remain in one place that long must be<br /><br />\nThe total price has been set at $3<br />\nper couple. This includes the concert,<br />\nwhich is $1 per person unless an<br />\nS.A.C. card is exchanged for a complimentary ticket; while the dance is<br />\n$1 per couple for everybody. Let's<br />\nsupport the affair.<br /><br />\nThis band has played jobs out of<br />\ntown as well as many around the city<br />\n—everywhere receiving compliments<br />\non their fine arrangements. Requests<br />\nare played in the order in which they<br />\nare received. All this adds to the things<br />\none would look for in a dance orchestra. The fine points mentioned about<br />\nthe Commanders will be approved by<br />\nthose who attend the Home Concert.<br /><br />\n\"China Goes Modern\"<br />\nIs Topic Of Lecture<br />\nMr. Eugene E. Barnett, founder of<br />\nthe Hangchow Y.M.C.A., considered<br />\none of the largest and most influential<br />\nin China, addressed a joint committee of the Cosmopolitan Club and the<br />\nFriendly Relations Committee of the<br />\n\"Y\" on his favorite subject, \"China<br />\nGoes Modern,\" at 4:00 p.m. yesterday<br />\nin Levering Hall.<br />\nMr. Barnett, a graduate of Emory<br />\nUniversity, has spent 26 years in<br />\nChina, and has recently been elected<br />\ndirector of World Service of United<br />\nStates and Canada.<br /><br />\nHOMEVVOOD, BALTIMORE, FEBRUARY 12, 1937<br /><br />\n2<br /><br />\nMit<br /><br />\no1jn5 Appittn5<br /><br />\nCAMPUS eIRCLIN'<br />\ntATFI<br />\nOMNIENT<br />\ntater<br />\nP US<br />\nE<br /><br />\n,i2etus<br /><br />\nFELLOWS! THEY INTEND<br />\nTO CONSCRIPT US<br />\nYes they intend to conscript us!<br />\npei year<br />\n42.a u<br />\nWhat do you mean, conscript?<br />\n13/<br />\n----this—The War Department<br />\n---Simply<br />\nRemit subscription tees to Treasurer, Student<br />\nActivities LULIRC74, itemsen i.aIl, Pustudice, Johns has for thirteen years had a commitOpluRb l;111versity.<br />\n-- -- tee of sixty men working on a plan<br />\nEntered as second class matter December 3, to be presented to Congress whereby<br />\nunder<br />\nMd..<br />\nBaltimore,<br />\n19U9, at the Postuthce in<br />\nthe Act of Congress, Novernbei 3, 1579.<br />\nall of us young men between the ages<br />\n— -Published senn-weekly trurn October to June, of eighteen and forty-five will be torn<br />\nexcept dui ing examination and college holiday away from our homes, taken away<br />\nperiods by undergraduates ut the Johns Hopkins<br />\nnive sity.<br />\nfrom our vocations and studies and<br />\nEDITORIAL STAFF<br />\nforced into military service at time<br />\nEtittot<br />\nWilliam Diamond<br />\nAssociate Editor the president feels that a national<br />\nStanley Finkel<br />\nJames Morrow, David Caplan Managing Editors emergency exists (that emergency<br />\nSports Editor<br />\n..<br />\nBernard D. Pinck<br />\nmay be in peace or war). Anyone<br />\nBenjamin Rout, Wethered Barroll, Jr.<br />\nAssistant Managing Editors<br />\nrefuses to leave his vocation will<br />\nwho<br />\nAssistant<br />\nSports<br />\nEditor<br />\nZheutlin<br />\nHarold<br />\nColumnist I be thrown into jail for an indefinite<br />\nPaul Berge<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein,<br />\nJewett Goldsmith, Howard Reizenstein, Jul. period of time.<br /><br />\n'With BOBBY HILDRETII<br /><br />\nDoug Meigs seems to be •having<br />\ntrouble with his \"Bug.\" That is the<br />\nlittle green Austin you see parked<br />\nabout the campus. His friends seem<br />\nto enjoy hiding it from him while he<br />\nattends classes. This week he found it<br />\nin the woods near the power house.<br />\nWhy not take it to class with you,<br />\nDoug?<br /><br />\nMUSICANA<br />\nAlexandre Scriabin, music's sole<br />\nmystic, is a great musician, but he is<br />\ngreatly neglected. Tuesday night, a<br />\ngroup of Baltimorean music-lovers<br />\ngathered to hear the National Symphony play his 3rd Symphony, Le<br />\nDivin Poeme. It was an unforgettable<br />\nexperience. Exotic harmonies, shimmering solo passages, brilliant orchestral coloring were mixed with a<br />\nwild overpowering emotional appeal.<br />\nOne still remembers the huge, shattering, forte-fortissmo in the first<br />\nmovement, the melodious violin solo,<br />\nwith flute chirping in the second, and<br />\nthe unrestrained, lusty, final shout of<br />\njoy. Undoubtedly a great work, even<br />\nat second hearing, it leads one to wait<br />\nwith anticipation future hearings of<br />\nthe works of this strange, bizarre<br />\nphilosopher.<br /><br />\nhe failed!) is vague, religious, misty, have a little of the ape-man in you<br />\nand mystic. Scriabin stole the show. says Prof. H. R. Hunt of the zoology<br />\n* * *<br />\ndepartment at Michigan State ColThe concert of March 16 will fea- lege. Pre-historic man had to wiggle<br />\nture George Gershwin at the piano his ears to sharpen his sense of hearing. Muscles employed in this action<br />\nand podium.<br />\nAuditur<br />\nare a definite inheritance from him.<br />\nThe \"Hell Week\" practice at Northwestern University has been severely<br />\ncircumscribed and restricted by resolution of the interfraternity council.<br />\nFlu can't even stop University of<br />\nKnox College will celebrate its<br />\nMinnesota students from wooing. Men hundredth anniversary during the<br />\nin the isolation ward sent the girls Founders' Day program to be held on<br />\nacross the hall ice cream cones in the 14th and 15th of February.<br />\nappreciative acknowledgement of a<br />\nIn order to study the night-life of<br />\nset of paper dolls.<br />\nbirds, George R. R. Pflaum, debate<br />\nThe \"Committee for the Preserva- coach at Kansas State Teacher's Coltion of Tradition at St. Mary's Uni- lege, has put up a glass wren-house,<br />\nversity\" proclaimed recently that with electric light attachments, in his<br />\nshaves, haircuts, baths and any other backyard.<br />\nsimilar marks of civilization would be<br />\nHarvard,Yale, and the University of<br />\noutlawed during exam week.<br />\nChicago have the largest endowment<br />\nFreshmen at the University of funds of any of the education instituMichigan have been granted the per- tions in the United States. Harvard's<br />\nmission to live in fraternity houses fund totals $131,099,000.<br />\nduring the second semester.<br />\nThe names of two University of<br />\nA \"No Cigarette Bumming League\"<br />\nPennsylvania girls appeared by accicampus<br />\nof<br />\nhas been forced on the<br />\ndent on the list of men of that instituLouisiana State University. League<br />\ntion accepted for fraternity rushing.<br />\n.members promised not to bum or<br />\nA quick witted student in the bacbe bummed from. Bumming of<br />\nteriology laboratory at the University<br />\n\"drags\" is permitted.<br />\nof Minnesota found a swift solution<br />\nSkiing is the most \"bodybruising\"<br />\nfor an unexpected fire. When a stusport at Harvard University. In the<br />\ndent's hair caught on fire, he put out<br />\nannual report of the Hygiene Departthe flame by slamming a book on the<br />\nment it was found that skiiers suffellow's head.<br />\nfered the most injuries. Football men<br />\nhad no serious injuries.<br />\nIf you can wiggle your ears, you<br /><br />\nIntercollegiates<br /><br />\nThe Music Club concert should be<br />\na success evel though the Cotillion<br />\nBoard chiseled in on the sam week.<br />\nBilly Isaac's orchestra is quite the<br />\ntops in the city at present. The only<br />\nmusical difference between Hal Kemp<br />\nPrior to the intermission, Dr. Kindtan Adler, Carl Raisin, Leonard Rubinger,<br />\nTalk about Fascism or government and Billy Isaac is the name and the ler drew from dusty cob-webby<br />\nMorris Wessel, Arthur Katz, Martin<br />\nKempton.<br />\nKrieger, I.ester Rosenthal, Murray<br />\nprice that you are going to pay.<br />\nVictor Victoroff, Charles Diggs, William dictatorship--well, there it is. If we<br />\nshelves three rarely-performed works.<br />\nBurford, J. C. UaiiIeknian, Mal liostmack. are to be subjected to a conscription<br />\nAs soon as we reached our seats, we<br />\nBUSINESS STAFF<br />\nDid you know that the first collecBusiness Massager similar to German or Italian univerWilliam B. Kempton<br />\nheard a suite of operatic excerpts by<br />\nAssistant Business Manage, sal conscription so contrary to Amer- tion made in America of Egyptian art<br />\nMelville Locker<br />\n,Christoph Willibald von Gluck. Need<br />\nAdvertising Massager<br />\nWm. C. Erlanger<br />\nCirculation Manager ican institutions of life, liberty, and is here at the University? Ask Dr. more be said?<br />\nGerald Willen<br />\nOffice Manager<br />\nHoward Linkoff<br />\nRobinson about it.<br />\nCopy and Filing Manager the pursuit of happiness, we the<br />\nNathaniel Soifer<br />\nContrasted to the dazzling splendor<br />\noyoung men who will be conscripted<br />\nof Rimsky-Korsakoff's Le Coq d'Or,<br />\nI understand that Hutch is no going<br />\n1936<br />\nMember<br />\n1937<br />\nand the young women citizens of the<br />\nGluck is a pale and wan lover. Some<br />\nUnited States ought to know the to attend the 2nd C,otillon. That means of the fire and vitality of the two<br />\ncontent of this proposal, and the de- more room to dance. It's to good to be Coq d'Or excerpts was a harbinger<br />\nDistributors<br />\ncision implied, instead of having it true.<br />\nof Scriabin's symphonic poem1symthrust upon us, as the War Departphony.<br />\nThe registrar's office took up a nice<br />\nment<br />\nevidently<br />\nintends, without<br />\nLoudon Greenlees, an elderly bald,<br />\nTISINO<br />\nST<br />\nRRRRR<br />\nsize<br />\nNATIONAL<br />\ncollection<br />\nduring<br />\nthe recent Red<br />\nRIIP KKKKK TKO FOR<br />\na warning at a time when an emobony, bow-legged, Scotch baritone<br />\nNational Advertising Service, Inc.<br />\ntional hysteria which accompanies Cross campaign for the flood sufferers.<br />\nthan sang the Kindertotenlieder.<br />\nCollege Pablishers Representative<br />\nemergencies<br />\nwill have gripped the Nice work, my friends.<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nThese are five poems, dealing with<br />\ncHte.aic, . BOSTON - SAN FRANCISCO<br />\ncountry.<br />\nthe death of a beloved child, set to<br />\nSISATTLII<br />\n•<br />\nLos ANOTLI I - FORTLANL<br />\nBrian Murphy offered Jack BarnMore important, the bill has been<br />\nmusic by Gustav Mahler. Gentlemen,<br />\ncompleted to perfection and is known berger a free pass to the Hal Kemp that was the low spot of the evening.<br />\nFriday, February 12, 1937<br />\nas \"The Army plan for University dance, providing that he would give The audience did not seem to feel the<br />\nFill your pen with thisnew<br />\nink creation— Parker(Nine<br />\nDraft\" and is ready to be presented the crowd a tap number. Call his emotion which Mahler and the soloist<br />\nQuink cleans a _pen as it<br />\nbluff, Jack, and accept.<br />\nto Congress as soon as possible.<br />\nwrites—a Parker Pen or any<br />\nwere trying to convey. Why? I'll tell<br />\nother. Dissolves sediment<br />\n-0In order to get a clearer conception<br />\nleft by pen-clogging inks.<br />\nyou the answer if you tell me Why<br />\nComplaints have been made regardof the plan, here are extracts taken<br />\nsome music is great and some medioThe first voluntary assembly is directly from the bill as drawn up by the distribution of the Blue Jay.<br />\ncre.<br />\ngone, but not forgotten. The posi- the committee of sixty:<br />\nEverybody is wondering if they have<br />\nI repeat, sirs--Scriabin was a great<br />\ntion which the NEWS-LETTER has<br />\nAlways rich, brilliant—never watery.<br />\nBe it enacted . . . that during to pay $.15 for it, or swipe it from artist. He _iad all the vivid color and<br />\nGet it at any store selling Ink, 15c and 25c,<br />\nmaintained, not without difficulty, any national emergency which in Levering Hall. Many never get posbreathless irridescence of Stravinsky<br />\nhas been vindicated.<br />\nthe judgment of the president de- session of this interesting magazine plus the objective subjectivity of<br />\n•<br />\nIt is evident that the students of mands the immediate increase of until it is at least two weeks old. Tschaikowsky. He was a great artist,<br />\nNo<br />\nassemblies.<br />\nwant<br />\nSomething<br />\nshould<br />\nbe<br />\ndone about it.<br />\nthe University<br />\nthe armed forces of th United<br />\neven if his philosophy, which he tried<br />\nMade by The Parker Pen Cn.,Janesville,Wis.<br />\nbetter evidence of this can be ob- States, the president may, and he<br />\nto inject into his music (thank God<br />\nA ladies \"John\" has finally been intained than the fact that the assem- hereby is, authorized to register<br />\nbly hall was filled. It is more than and select for induction and to in- stalled in the Log Cabin, a break for<br />\nobvious that the assembly was suc- duct into those forces, such male the girls. I understand that it has<br />\ncessful, not only because of the pres- citizens . . . who shall have reached hot and cold folding doors, besides a<br />\nence of a full house, but because of the eighteenth anniversary of the cooling system.<br />\nthe interest and enthusiasm exhibited day of his birth on or before the<br />\nby the audience in the speaker and day or days fixed for registration<br />\n\"Papa Tree Top Tall\" --- Henry<br />\nin the preliminary songs.<br />\n. . . Any person who shall fail or Krumrein has competition from \"MaNo small amount of the credit is refuse to submit thereto . . . shall ma Tree Top Tall\"—Eileen Schaeffer.<br />\ndue to Mr. Clegg. It is only on rare upon conviction in a district court Both tower over 6 feet. Look up and<br />\noccasions that the students have had of the United States having juris- see them some time.<br />\nthe opportunity to hear a speaker of diction thereof, be punished by imA fine specimen of brains and<br />\nMr. Clegg's quality and personal prisonment for not more than . . .<br />\nmagnetism. He may not have made and shall upon conviction be duly beauty is Miss Benton in the Teachers College. A sample of the golden<br />\nany converts for the F.B.I., but he registered.\"<br />\nThe length of prison term is omit- West.<br />\nhas certainly found sympathizers for<br />\nted from the bill, because upon conIt and admirers for himself.<br />\nBut whatever the opinion of the viction the individual is registered, got hit unfairly by the exams, not<br />\nspeaker, assemblies as an institution that is, he passes directly to military once but twice. Tuesday they sweated<br />\ncontrol and probably serves out his through their two hour comprehenhave been vindicated.<br />\nsentence under such control.<br />\nsive, but next June they will be held<br />\nThe bill further reads:<br />\nresponsible for the same material in<br />\n\"and such persons (those con- another \"final.\"<br />\nIn its capacity as the Hopkins' offi- scripted) shall be required to serve<br />\nOther violations of the entire spirit<br />\nuntil six months after the emercial organ, the NEwS-1,LiTrriat enof the new system were also noted.<br />\ndeavors to protest in its column un- gency shall have been declared by These, of course, must be smoothed<br />\nbiased and uncolored news of the the president to have terminated.\"<br />\nout if the innovation is to have any<br />\nQuoting Harold Fay \"The Sentence<br />\nUniversity.<br />\nmeaning. Year courses must be made<br />\nEspecially do we feel it necessary providing that this regimentation just that, or Brown might better reas a matter of duty and obligation to shall remain in effect for six months turn to calling examinations and semthe student body to print the facts of after the President shall have de- esters by their right names.<br />\na matter which so vitally concerns clared the emergency is over shows<br />\nLength of examinations is another<br />\nus. Until now these facts were not that once this fascism lays hold upon<br />\nmatter which requires adjustment.<br />\nthe<br />\nnation,<br />\nit<br />\nwill<br />\nnot<br />\neasily<br />\nrelease<br />\nknown; and no one has a right to<br />\nThe ordinary \"hour exam\" covers<br />\nstate them unless knowledge is def- its grip with the coming of peace.\"<br />\nabout a month and a half's class<br />\nFinallyinitely possessed concerning these<br />\nweek students have<br />\nNothing contained in this Act work, but this<br />\nfacts.<br />\nwrite enough in two<br />\nbeen<br />\nasked<br />\nto<br />\nBriefly, those bodies which directly shall be construed to require or<br />\nhours to show their mastery of nearly<br />\nand ultimately regulate, supervise, compel any person to serve in commonths of studies. New regime<br />\nfive<br />\nand control the conditions and activi- bat capacity in any of the public or old regime, there is just as much<br />\narmed<br />\nforces<br />\nof<br />\nthe<br />\nUnited<br />\nStates.<br />\nties of election have never issued any<br />\nto know about Greek civilization as<br />\nstatement announcing the results of who is found to be a member of any<br />\nthere ever was. The student must rewell<br />\nrecognized<br />\nreligious<br />\nsect<br />\nan election and have never recogsort to spotting questions; the pronized any statement from any source whose creed or principles forbid its fessor cannot hope to give a thormembers<br />\nto<br />\nparticipate<br />\nin<br />\nwar<br />\nof<br />\nconcerning the outcome of an election.<br />\nough examination.<br />\nIn other words it may be said that any form.\"<br />\nA sizeable proportion of the underThe Act continues, however, and<br />\nthere never has been official recognigraduate body is home now, cutting<br />\nstates<br />\nthat<br />\neven<br />\nmembers<br />\nof<br />\npacifist<br />\nninon or announcement of a NEWSclasses. When the last test was over,<br />\nCHURNING flood had taken out the telephone line<br />\nLETTER election for editor by either sects will have to engage in non-cornthe students felt they had a right to<br />\nbatant<br />\n(even<br />\nthough<br />\nthat<br />\nserservice<br />\nthe S.A.C. or Student Council.<br />\nacross a Colorado stream. Repairmen couldn't wade<br />\nvice is aiding in direct warfare). Well, leave the campus if they had no<br />\nUnder conditions prescribe by the<br />\n'<br />\nt cross elsewhere and<br />\nit because of quicksand—couldn<br />\nthere it is—it's real, it's ready, it's classes for two or three days, and<br />\nStudent Council, the regular NEWSthe<br />\nvacation<br />\nto<br />\ninthey<br />\nstretched<br />\nobstructions.<br />\nchallenging.<br />\nbring back the line because of<br />\nLETTER elections will take place today.<br />\nWhat are you going to do about it? clude the week-end. Schedule finals<br />\n'<br />\ns master had an idea. He went upstream,<br />\nThen Kayo<br />\nfrom Monday through Friday, and<br />\n--Elizabethtown Etownian<br />\ncame back and whistled. Kayo jumped in—swam<br />\ncrossed,<br />\nthose men who have nothing to keep<br />\nacross with a cord tied to his collar. With this cord, the<br />\nthem<br />\non the Hill can leave without<br />\nBY<br />\nERROR<br />\nTRIAL<br />\nHopkins<br />\nJohns<br />\nWe students of the<br />\nhaving<br />\nto<br />\nworry<br />\nabout<br />\ncuts.<br />\nNow that the shooting is over, a<br />\nwire was soon pulled over—communication was restored.<br />\nUniversity have been invited by the<br />\nnew<br />\nsysthe<br />\nwhole<br />\nHow<br />\nsuccessful<br />\njudgment<br />\nof<br />\nthe<br />\n\"abolition<br />\nof<br />\nmidPresident to help celebrate two anA small incident. But it typifies the ingenuity which<br />\nniversities --the sixty-first Anniver- year examinations,\" is in order. How tem of \"year courses\" is, is topic for<br />\nBell System men and women to give you the world's<br />\nhelps<br />\ndiscussion some other time — after<br />\nsary of the University's founding and did the innovation work out in actelephone service.<br />\ndependable<br />\nit has been further tested. But if the<br />\nmost<br />\nthe twenty-fifth Celebration of the tual practice?<br />\nstays,<br />\nto<br />\nsystem<br />\nthese<br />\nchanges<br />\nought<br />\nPrime among the observed objecof the School of Engineering.<br />\nThere is a full program of speak- tions is the fact that some depart- be made.<br />\n—Brown Daily Herald<br />\nWhy not tglephone home more often?<br />\ners and exhibits arranged fittingly ments apparently never heard that<br />\nexams<br />\nwere<br />\nabolished.<br />\nmid-year<br />\nfor his dual celebration, and these<br />\nRates to most points are lowest after<br />\nseries of events should be attended Math. finals, for example, were giv7 P. M. and all day Sunday.<br />\nby all the students and friends of the en in courses where the second semUniversity. All of us should feel ester is invariably elected by those<br />\nproud at this time and be present in men taking the first--where the subfull force at the enjoyable celebra- ject matter is continuous.<br />\n\"We Sell Drugs and Give Service\"<br />\nStudents taking required history<br />\ntion schedule ahead.<br /><br />\nAssociated Colle6iale Press<br /><br />\nof<br />\nCollegiate Di6est<br /><br />\nGES<br /><br />\nNO MORE<br />\nCLOGGED-UP<br />\nFOUNTAIN PENS<br /><br />\nAt<br />\nMue<br /><br />\nSIEG<br />\nCapt.<br /><br />\nrnAm ta<br /><br />\nuMtklifly<br />\ntibefore<br />\nS'ta2li'lhiltegPe<br />\neal<br />\nde:cari<br /><br />\nk<br />\nquick<br /><br />\nt)thi(a°e:rel,rtheeebsda4 ant.<br />\ndbRil<br /><br />\nh:<br />\nWhen<br /><br />\nAnother Hopkins<br />\nVictory<br /><br />\nWa<br /><br />\nrn<br /><br />\nYOU MEAN<br /><br />\nE<br /><br />\ntt<br />\n. GS<br /><br />\nI<br /><br />\nTHOUGHTCHRISTMASIEIR<br />\nWAS IN DEC<br /><br />\nplatyst)fh1 -1( hhIrt:ee<br />\nCltPr<br />\ng<br />\no<br />\nn<br />\nt<br />\nk<br />\nr<br />\nr<br />\no<br />\n:<br />\nCiW<br />\ni<br />\nc<br />\n(<br />\naC<br />\nf<br />\nr1<br />\n:<br />\nlOng<br /><br />\nrLerk<br /><br />\nthat<br /><br />\nt<br />\nr<br />\nCi<br /><br />\n•••<br /><br />\nthreat<br /><br />\nSAVED E 140U6H<br />\nMONEY SMOKING<br />\nEDGEWORTH JR, ;<br />\nTO BUY IT.<br /><br />\nPNri<br />\n)lo<br />\nndta<br />\n.<br /><br />\nns<br /><br />\nWASTE.SMOKES SWEET<br />\nAND MILD DOWN TO THE HEEL. ITS GREAT '<br /><br />\n:<br />\n1dt14.:6::::<br />\n15°e<br />\n8t4a.<br />\nOwathrejri e<br />\n:<br />\nnrrtn<br />\nCr s<br />\nPhiekh<br />\nt<br />\nn<br />\ne<br />\njuaed°e,°14atrair<br />\nHo<br />\nllopk<br /><br />\nSome Facts<br /><br />\na poi<br /><br />\ntense<br />\n00p_<br /><br />\nt<br />\nifV),„ r<br />\n7:eir<br /><br />\ngin<br />\nttia.<br />\nfoul .<br /><br />\nt.<br /><br />\nSc.<br />\n.<br />\nwrapped<br /><br />\nMo<br /><br />\nHo<br /><br />\nAMAZING VALUE!<br />\n$P-2 POUCH<br />\nFOR 10‘<br />\nIN YOUR COLLEGE COLORS<br />\nWe make this amazing offer<br />\nof a 81.00 English Type<br />\nFolding Pouch in Rep Cloth<br />\nwith Rubberized 'Liner for<br />\nonly 100 and one wrapper<br />\nto persuade you to try Edgeworth Jr. Send the inside<br />\nwhite paraffin wrapper and<br />\nyour dime together with<br />\nthe coupon (or print your<br />\nname, college and address<br />\non the wrapper)—and we<br />\nwill send your pouch. Only<br />\none to a customer.<br /><br />\nA<br /><br />\nAn Acceptance<br /><br />\nPEABODY<br />\nPHARMACY<br />\nCalvert and 30th Streets<br /><br />\n0V<br /><br />\nSPECIAL<br />\nOFFER<br />\nEMI 1111111ER Ems FIENEI<br />\n1Lerus &amp; Bro. Co., Richmond, Vs.<br />\nEnclosed find lO0, and one inside white<br />\nparaffin wrapper from a tin of Edgeworth<br />\nJr., for which send me 51.00 value milk<br />\niohacco pouch in my college colors.(Pfooae<br />\nI print.)<br /><br />\nI<br /><br />\nI<br /><br />\nI Nama<br /><br />\nI Address<br />\nI lily<br />\n1<br />\nI C01.1 FGF<br /><br />\nL<br /><br />\nOM MI NIP IIIIII<br /><br />\n1<br /><br />\nHOMEWOOD, BALTiMORE, FEBRUARY 12, 1937<br /><br />\n&amp;unties Score Tanksters Trounce<br />\nAs Weiner<br />\nOver Jay Five Terps<br />\nAnd Radner Shine<br />\nAt Emmitsburg Blue Jays Smear Maryland<br />\nTo The Tune Of 39-29<br />\nBlue Jay Defense Falters In<br />\nAt Washington<br />\nSecond Half Attack<br />\nOf Mountaineers<br />\nMeet Decided By Victory In<br />\nThe 440 Yard Relay<br />\nSIEGEL OUTSTANDING<br />\nIn 4:10.4's<br /><br />\nCapt. Kokie Of Mt.St. Mary's<br />\nChalks Up 15 Points<br />\nAs High Scorer<br />\nA fast moving, fast breaking Mt.<br />\nst. Mary's quintet defeated Johns<br />\nHopkins last Tuesday evening at<br />\ntnunitsburg to score their sixth<br />\nleague victory. The Galloping Saints<br />\nfunctioned smoothly enough to erase<br />\nally doubt as to their superiority in<br />\nthe Maryland Intercollegiate League.<br />\nThe final score of the contest, played<br />\nbefore an aroused crowd of hoop fans,<br />\nwas 41-19.<br />\nFast First Half<br />\nThe play during the first half was<br />\neaPecially fast, with the Blue Jay<br />\nquick break on tap-off and pick-off<br />\nPlays working as the main phase of<br />\nthe attack. The Malloneemen emPloyed the zone defense throughout<br />\nthe battle and were well nigh imPregnable at times, altho the better<br />\nhall handling of the home team enabled them to break through to score,<br />\nWhen catching the Jays unawares.<br />\nIt should be stated that a strong<br />\nHopkins defense kept down the home<br />\nteam scoring during the first period,<br />\nbut were unable to stop the Mountmen<br />\nNM coming through during the 5ec011(1 canto. Hopkins took the lead at<br />\nthe offset with a 3-2 margin, but a<br />\nleng toss by Kokie, the Mount captain, dissolved this, and the visitors<br />\nWere never threatened seriously since<br />\nthat incident. Apichella was the chief<br />\nthreat during the scoring rampage<br />\nthat followed, scoring 8 of the 15<br />\nPoints that his team scored for that<br />\nPriod. Siegel's two field goals, reinforced by numerous fouls thrown by<br />\nthe Jays, set the Black and Blue<br />\ntharkers at 8.<br />\nSad Second Half<br />\nThe last half was decisive as the<br />\nturning point, for the home team<br />\ncored 26 points to the 11 counters<br />\nfor Johns Hopkins. In this section of<br />\nthe contest, Kokie, guard and the outStanding man on the floor, went wild<br />\nto pull his scoring total up to 15<br />\nPoints for the evening. His handling<br />\nef the ball was a beautiful thing to<br />\nWatch, and his passing was responsible for the defeat of the Hopkins zone<br />\ndefense in the latter phase of the<br />\n4frair.<br />\nHopping Herby Siegel was the<br />\nHopkins high scorer with a total of<br />\nPoints, made on 4 field goals.<br />\nAmong other things seen at the<br />\ngame . . . the clever Hopkins defense in the first half . . . Siegel's<br />\nPV-up at the crucial moment to give<br />\na last ray of hope. . . Dimmy Tragkia running around big Frank Apich'lla on a lay up . . . the number of<br />\nroul shots taken . ..<br />\nScore by periods:<br />\nMount St. Mary's<br />\n15 26--41<br />\n8 11-19<br />\nHopkins<br /><br />\nThe Black and Blue natators( led<br />\nby Captain Danny Weiner, turned<br />\ndown the University of Maryland<br />\nswimming team by the score of 3929 in a closely contested meet at the<br />\nShoreham Hotel pool, Washington,<br />\nD.C., last Monday evening.<br />\nLast Event Decisive<br />\nThe meet was undecided until the<br />\nlast event, the 400 yard relay, in<br />\nwhich every man swam even, until<br />\nZoel Radner, the anchor man, sprinted<br />\nto give 'Hopkins the race and meet.<br />\nThe next opponents of the Blue Jay<br />\naggregation will be Lehigh who will<br />\nbe met Saturday, 3 P.M. at the Baltimore City College Pool. It has been<br />\nmany years since Hopkins can boast<br />\nof such a club as this year's. A request<br />\nfor a larger turnout at the meets has<br />\nbeen made to the student body by the<br />\nteam and Coach Hambleton.<br />\nThe results of the contest are as<br />\nfollows:<br />\n100 Yard Free Style: Prinz, Maryland; 13. Adler, Hopkins; A. Hill, Hopkins; Time, 2:43s.<br />\n50 Yard Free Style —Goldberg,<br />\nMaryland; L. Adler, Hopkins, Wood,<br />\n(Continued on Page 4, Col. 6)<br /><br />\nFraternity Fives<br />\nReach Final Stage<br />\nWith four weeks remaining of frat<br />\nbasketball, Kappa Alpha and Pi<br />\nLambda are knotted for top honors<br />\nin division A while Phi Gamma Delta<br />\nthreatens to run away in the other<br />\ndivision. All these squads copped conl.ests Saturday. K.S.. defeated the<br />\nPhi Sigma Delta crew, and Pi Lam<br />\nEpsilon<br />\nPi<br />\nits fourth<br />\nhanded<br />\ndefeat. The other leader, Phi Gamma<br />\nDelta, also won in a low scoring contest with Phi Alpha. Only seven field<br />\ngoals were netted by both teams with<br />\nPhi Gam tallying four to nose out<br />\nthe P. A. five 8-6.<br />\nD. U. Versus PI Lams<br />\nDelta Upsilon conquered Kappa Alpha to remain in the pennant race.<br />\nAfter a hard fought match, K. A.<br />\ndropped the game 18-10. The D. U.<br />\nand Pi Lam courtmen are closely<br />\nmatched in points towards the frat<br />\ntoken, and both are trying to secure<br />\nthe basketball crown to strengthen<br />\ntheir claim to the award. On Saturday, February 20, Kappa Sigma will<br />\nmeet the Delta Upsilon representatives. Even at this date, this battle<br />\nwill be important in deciding the<br />\ntitle.<br />\nIn other encounters Saturday,<br />\nO.K.O. Delta Phi, and Tau 41pha<br />\nOmega netted victories.<br /><br />\nto our Men's Shop on the first floor, and our Young Men's<br />\nShop on the third. Perhaps you won't even have to come<br />\nin; try writing or phoning us!<br /><br />\nflUTZLEK B?THEM (,;\\<br />\nFFor Your<br />\nLiquors<br /><br />\nJays were victorious in the single<br />\nwall matches.<br />\nBecause of the practice the Jay<br />\nwalimen have had this year in the<br />\nfour wall game ,they expect to win<br />\nboth Friday and Saturday, repeating<br />\nin single wall, and winning in four<br />\nwall.<br />\nIntramural Finals<br />\nMeanwhile, the intramural handball<br />\ntournament has reached the finals,<br />\nwith Milt Alperstein and Phil Small<br />\nscheduled to play the championship<br />\nmatch next week.<br />\nIn a hard fought semi-final match,<br />\nPhil Small defeated Floyd Katskc,<br />\n21-15, 16-21, 21- 18. The other finalist, Milt Alperstein reached his goal<br />\nby disposing of Harry Nierenberg,<br />\nKatane and Nierenberg will receive<br />\nbronze medals and the gold and silver medals go to Alperstein and<br />\nSmall, depending on the victor in the<br />\nfinal match.<br />\nA summary of Thursday night's<br />\nmatch with the Police A.C. follows:<br /><br />\nIf you're in tune with the times, you'll wear only<br />\nArrow shirts with their proper team mates, Arrow<br />\nties. The tenor on the right wears the Kent model,<br />\nan oxford shirt in new polychrome stripes—$2. The<br />\nArrow tie is particularly designed to go with it--$1.<br />\nOn the left is Arrow Hitt with the Aroset wiltless<br />\ncollar—$2.<br /><br />\nSINGLES<br /><br />\nI. Milberg, J.H.U., defeated J. AlexBecause of the fine showing and<br />\nander; 15-5, 10-15, 15-2.<br />\ngood condition of the team high<br />\nR. Pasternak, J.H.U. defeated E.<br />\nhopes were held for victory over the<br />\nParr; 15-12, 15-6.<br />\nstrong invading Virginia team.<br />\nThe Jays encounter the Cavaliers<br />\nFriday evening at Homewood in a<br />\nseries of single wall matches. Saturday morning the teams clash at the<br />\nY.M.C.A. courts in four wall handball. The Virginia team, led by Ferguson, Conrad, Lynn, and Rosen, hope<br />\nto do better than last year, when the<br /><br />\nClose Harmony<br /><br />\nMitoga—tailored to fit<br /><br />\nSanforized Shrunk<br /><br />\nM. Alperstein, J.H.U., defeated A.<br />\nSennet; 15-8, 15-5.<br />\nDOUBLES<br />\nBurns and Kleimik, Police A.C., defeated Finkelstein and Hernandez, 1513, 12-15, 15?9.<br />\nMilberg and Pasternak, J.H.U., defeated Rice and Rogers; 15-8, 15-8.<br /><br />\n•<br /><br />\n\"The Voice of Experience\"...<br />\nthe man with the million dollar throat<br />\ninsists on a light smoke<br />\n\"My voice is my career. It has inspired more than five million people<br />\nto confide in me their personal problems. During 25 years, first on the<br />\nlecture platform and then on the air,<br />\nI have never missed a single engagement because of my throat. I am a<br />\nsteady smoker,and because my throat<br />\nand voice are vital to my career I insist upon a light smoke. In Luckies I<br />\nfind a light smoke plus the enjoyment<br />\nof fine tobacco ... and that's why<br />\nLucky Strikes have been my choice<br />\nfor 14 years.\"<br />\nsteyziro<br /><br />\nFRIEND AND COUNSELOR<br />\nTO MILLIONS OF RADIO LISTENERS<br /><br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br /><br />\nSeeHARRY<br />\n3113 GREENMOUNT AVE.<br />\nPhone UN. 4883<br />\nFor Delivery<br /><br />\nNEW YORK LOAN OFFICE<br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\nInstruments, slide rules.<br /><br />\n118 North Liberty Street<br /><br />\nThe<br />\nHopkins handball varsity<br />\ncaught the Police A. C. flatfooted<br />\nThursday night in a hard fought<br />\nstrugggle by a score of 4-1. The handballers took the police in their stride,<br />\nin prelude to the big match this<br />\nweek-end with the University of Virginia at Homewood.<br />\nMilberg Wins<br />\nIn the first singles match, Iry<br />\nMilberg defeated Jos. Alexander by<br />\na score of 15-5, 10-15, 15-2. In the<br />\nsecond singles match Dick Pasternak<br />\nfollowed up with another victory over<br />\nEd Parr to the tune of 21-15, 15-6.<br />\nIn the third singles, Milt Alperstein<br />\ncompleted the sweep of the singles<br />\nmatches by taking over Al. Sennet,<br />\n15-8, 15-5.<br />\nIn the double matches, Iry Milberg paired with Dick Pasternak to<br />\ntrounce the Police team of Lowrey<br />\nRogers and Bob Rice, 15-8, 15-8.<br />\nHowever, Captain Nat Finkelstein<br />\nand Joe Hernandez were tripped up<br />\nby John Burns and George Kleimik<br />\nby a score of 15-13, 12-15, 15-9. A<br />\nreturn match is being arranged for a<br />\nlater date.<br /><br />\namong professional men and women lawyers,<br />\ndoctors,lecturers,scientists,etc.Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\n\"The Voice of Experience\" verifies the wisdom<br />\nof this preference,and so do other leading artists<br />\nof the radio,stage,screen and opera.Their voices<br />\nare their fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies — a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br /><br />\nIs at your service—though we call your attention especially<br /><br />\nUnexcelled Fountain Service<br /><br />\nBaltimore Police Department Hanclballers Lose 4-1 To<br />\nScrappy Hopkins Team<br /><br />\nAn independent survey was made recently<br /><br />\nSo we'd like to file for future reference that our whole store<br /><br />\nBirely's Pharmacy<br /><br />\nBlue Jay Wallmen Defeat Police<br /><br />\nDelta Phi and Tau Alpha Omega<br />\ndefeated Beta Theta Pi and Phi Kappa Psi respectively. Games in both<br />\ndivisions are scheduled for Saturday.<br /><br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCkIN A WHILE<br /><br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br /><br />\na<br /><br />\n1<br /><br />\nPlaza 3495<br /><br />\nA Light Smoke<br />\n\"Ies Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br /><br />\nCopyright 1937. The American Tobacco Comma,'<br /><br />\nHOMEWOOD, BALTIMORE, FEBRUARY 1'2, 1937<br /><br />\n4<br /><br />\nHullabaloo Beats J.H.U. Gazette Issued<br />\nTanksters Trounce<br />\nAssembly Hears Kemp Threatens To Bury<br />\nAs<br />\nOfficial<br />\nJournal<br />\nDarace Board in lioneyBags Distributed To Staff<br />\nTerps As Weiner<br />\nHugh II. Clegg,<br />\nAnd Radner Shine<br />\nAce Detective<br />\nThe NEWS-LETTER reports a rival<br />\nPublication To Be Placed On Less publication, recently appearing on the<br />\nFormal Basis In Future<br />\nCampus. Coming in this case, not<br />\n,<br />\nBy J. Niurray Kempton<br />\nwhat of the all-essential quality?<br />\nUnder Branoner<br />\nfrom the student body, but from the<br />\nWhen Hal Kemp takes the band- Where was the great tradition of Brx<br />\nadministrative offices, a news journal,<br />\nstand of the Lord Baltimore a week .and Tram, of Louis and Earl, of<br />\nAt a meeting of the Hulabaloo staff of uncertain publication schedule, will<br />\nfrom Monday, the membership of the Muggsy and Benny? In short, whith- held Wednesday noon, initial assign- make at<br />\nleast two bows this spring.<br />\nCotillion Board is reputedly in grave er jam? Hot protests flowed into the ments for the year were distributed The first issue is already a reality, and<br />\ndanger of being buried six-feet deep Cotillion Board, but requests for Lo staff members and candidates. a second is planned. Further than that,<br />\nThere will be another meeting Mon- the director would not go. The publitickets flowed in faster.<br />\nin money-bags.<br />\nday at 12.30 P.M. at which time all cation bears the name, Johns Hopkins<br />\nreturns<br />\nhave<br />\nfact,<br />\nif<br />\nthe<br />\nearly<br />\nIn<br />\nAnd so, the tragic rout is complete.<br />\nother students interested in trying University Gazette and is now of a<br />\nany bearing on the conc!usion, the Hal Kemp, who has the temerity to out for the staff should be present.<br />\nmainly official character. It will be<br />\nsaid Cotillion Board is about to ex- play strictly for dancers, is outsell\"This year's Hullabaloo,\" said Ger- mailed to all Alumni and other interperience the same general sensations ing the immortals by a safe margin. ald Branower, managing editor, \"will ested persons. A quarterly organizaas the man who struck oil while he Some of the swingtasters still grum- be on a more informal basis than those tion is being considered.<br />\nof preceding years.\" It is hoped that<br />\nwas digging a well.<br />\nble and cry havoc with many a dire<br />\na .rnore interesting yearbook will be<br />\nAll of which constitutes a pretty prediction of worse chings for the futurned out as a result of this policy.<br />\ntragic blow to the swing savants. By ture. But the majority, in the great<br />\nAt the meeting of the Gas EngiOutstanding bills of each actand large it's the worst shock to any Amer:can tradition, have accepted<br />\nneering Asociation which was held<br />\nivity and fraternity must be<br />\nlast Thursday in Maryland Hall, Dr.<br />\ncampus group since the Levering Hall the inevitable. It is reported that one<br />\npaid before March 1, or its<br />\nJ. W. Huff, head of the Gas Engipicture will not appear in the<br />\npitchman bid four on the Queen, of the bitterest of the die-hards was<br />\nneering Department, gave a lecture<br />\nannual.<br />\nseen<br />\nlast<br />\nWednsday<br />\ndickering<br />\nfor<br />\nnine and five of spades.<br />\non his recent travels in the Yosemite.<br />\nthree tickets (price $3.00 per ard<br />\nFor the last two years la jazz hot<br />\nobtainable from freshmen candidates of man he has only spoken well of His interesting narrative was accomhas reigned supreme. Any discus- for the Cotillion Board).<br />\npaaied by color photographs.<br />\none chorus recorded by one musician<br />\nsion of a Hopkins dance was accomAs a matter of fact, Hal Kemp who died six years ago--even a,dirritpanied by fervent \"swing, gates\" seems to have been<br />\ngrossly maligned. ted in a bfirst of confidence that he<br />\nand \"skip the gutters.\" Tommy Dor- True, his band is<br />\nadmittedly of the expects to enjoy the Cotillion \"very<br />\nsey, Jimmy Lunceford, Will Hudson, \"sweet\" variety, but it is<br />\ndistinctly much.\" \"After all,\" he said sadly,<br />\nMal Hallett, Benny Goodman—such not saccharine. One expert-reput- \"there must be something !n a bandl<br />\nIs the roster of great names which edly so particular<br />\nthat in the memory 'hat can draw this crowd.\"<br />\nhave graced the orchestra platform.<br /><br />\n(Continued from Page 1, Col. 1.)<br />\nPeoples of ancient times had types<br />\nof personal identification, such as<br />\nbranding, mutilation and Somatic<br />\nmeasurement. However, China was<br />\nalready using thumb prints in business. By 1850, it was discovered in<br />\nEurope that the characteristic marks<br />\non finger hubs could not be removed<br />\nby mutilation.<br />\nScotland Yard set up a fingerprint filing system in 1901. In 1924<br />\nthe United States set up its fingerprint clearing house in Washington.<br />\nIt now has the prints of some six million people, ten of each. 4,000 prints<br />\na day come pouring in, but an average of 52 out of 100 are already on<br />\nfile. When fingerprints of a suspicious<br />\ncharacter are sent to Washington, in<br />\nless than five minutes his prints and<br />\nrecord, if on file, may be found. This<br />\nrecord helps in the giving of a sentence in keeping with the type of<br />\ncriminal. It is also useful in amnesia<br />\ncases.<br />\nAn invitation to private individuels<br />\nto have their prints on a separate file<br />\nin Washington, for purposes which<br />\nWhen the Cotillion Board smashed<br />\nmay be useful to them, has been is- the iron last month by signing Hal<br />\nsued by J. Edgar Hoover.<br />\nKemp, loud were the wailings from<br />\nMechanical Devices<br />\ndevotees of the arts. The whisper<br />\nThose concerned with scientific de- flitted about the record columns that<br />\ntection are taking advantage of the the Boardmen would be lucky to carry<br />\ncreative genius of men to apply new home their shirts from the debacle.<br />\ninventions to crime detection. TypiOf course Hal Kemp was popular<br />\ncal among these are the ultraviolet<br />\n---so popular, in fact, that the Repuband x-rays.<br />\nlican party was reported on the verge<br />\nChemical analyses, watermark deof disregarding his North Carolina<br />\ntectors, spectrograph and ballistics<br />\nancestry and nominating him to run<br />\nall play their part. These men go<br />\nagainst Mr. Roosevelt in 1940. But,<br />\nthrough all these checks every day,•<br />\nusing all known electrical, mechanical,<br />\nand scientific detection devices, that<br />\ncriminals may be made to spend their<br />\nPrinters of<br />\nlives under \"supervised Federal jurisPHILOLOGICAL and<br />\ndiction. Mr. Clegg closed with the<br />\nSCIENTIFIC PUBLICATIONS<br />\nwords \"We have this fight (on crime)<br />\n12-20 Hopkins Place Baltimore<br />\nto win; we shall win!\"<br /><br />\n1<br /><br />\nJ. H. FURST<br /><br />\nDr. Huff Talks On Travels<br /><br />\n(Continued from Page 3, Col. 2)<br /><br />\nMaryland; Time, 27 3-5s.<br />\nDiving—Goldberg, Maryland; Jacob, Hopkins; Gacheal, Maryland.<br />\n440 Yard Free Style—Z. Radner,<br />\nHopkins! B. Adler, Hopkins; Balmer,<br />\nMaryland; Time, 6.17:3-5s.<br />\n150 Yard Backstroke—D. Weiner,<br />\nCaptain, Hopkins; McClure, Maryland;<br /><br />\nReekard,<br /><br />\nMaryland;<br /><br />\n200 Yard Breastroke — Blucher,<br />\nHopkins; Gatch, Maryland; Time,<br />\n2:55s.<br />\n100 Yard Free Style — L. Adler,<br />\nHopkins; Wood, Pitzer, Maryland;<br />\nTime, 1.00:3-5s.<br />\n400 Yard Free Style Relay—Hopkins (Abrahams, Hill, B. Adler, Radner ); Maryland; Time, 4.10:4-10s.<br /><br />\nN the making of fine<br /><br />\nI<br /><br />\nFINAL SALE of the SEASON!<br />\nAll Overcoats<br />\nand Topcoats<br />\nREDUCED!<br /><br />\nAll Fall and<br />\nWinter Suits<br />\noil IA ofF<br /><br />\n$25 to $100 Overcoats<br />\nnow $18.50 to $76.75<br />\n$22.50 to $75 Topcoats,<br />\nnow $16.75 to $56.75<br /><br />\nOnly Blues and Blacks<br />\nExcepted<br /><br />\nbeer<br /><br />\nthere is no sub-<br /><br />\nstitute for time ...<br />\nand here at National<br />\n... we take ow time.<br /><br />\nCO.<br /><br />\nKATZ CLOTHES<br />\n7 and 9 E. Baltimore Street • 2 Ho urs Free Parkinu, New Mid City<br /><br />\nTime,<br /><br />\n1.54:3-5s.<br /><br />\nThe National Brewing Co.<br />\nBALTIMORE MD.<br /><br />\nof<br />\non<br />\nva<br />\nlas<br />\nbei<br /><br />\nan<br />\nwe<br />\nific<br />\ntra<br />\nba<br />\nqu<br />\nite<br />\nthe<br />\nof<br />\ngi v<br />\neit<br />\nper<br />\nwa<br />\nust<br />\nble<br />\nof<br />\nAn<br />\nwh<br />\nac<br />\neve<br />\n'Ba<br />\nat<br />\n,ber<br /><br />\nma<br />\nroN&amp;<br /><br />\nCu',<br /><br />\nswi<br />\nthe<br />\ning<br />\ntin(<br />\nhon<br />\nDel<br /><br />\nwor<br />\nSta.<br />\nior,<br />\nfrat<br />\nmai<br />\ning.<br />\nmet<br /><br />\npos;<br /><br />\nthir<br />\nvitz<br />\nBar<br />\nfor<br /><br />\nFrom tobaccofarm toshipping<br />\nroom...at every stage in the making of Chesterfield Cigarettes...Job<br />\nNumber One is to see that Chesterfields are made to Satisfy.<br />\nIn the fields...at the auction markets<br />\n...and in the storage warehouses...<br />\nJob Number One is to see that Chesterfield tobaccos are MILD and RIPE.<br />\nIn the Blending Department Job<br />\nNumber One is to\"weld\"our homegrown tobaccos with aromatic Turkish to the exact Chesterfield formula,.<br /><br />\nIn the Cutting<br /><br />\nand Making Departments Job Number One is to cut the<br />\ntobacco into long clean shreds and<br />\nroll it in pure cigarette paper.<br /><br />\npre:<br /><br />\nSau<br />\ncote<br /><br />\n0<br />\nsop'<br />\nsqui<br />\nof<br />\nRob<br />\nroll.<br />\nA<br />\nthe<br />\nby<br /><br />\nSOOT<br /><br />\nelec<br />\nfor<br />\nfor<br /><br />\nInc<br /><br />\nT.<br /><br />\nHop<br /><br />\nDay<br />\nflier<br />\nfron<br /><br />\n0<br />\nCoil<br />\nthe<br />\nfive<br /><br />\nsix ,<br />\nfour<br />\nand<br />\nInst<br />\nlege<br /><br />\npale<br /><br />\ni_.pyriOit 1937. .1..IG6tri C. 1'1<br /><br />\nLAS I 01.5A( t,0 CO.<br /><br />\n•• Chesterfields are made to give you the things<br />\nyou enjoy in a cigarette... refreshing mildness<br />\n...pleasing taste and aroma. They Satisfy.<br /><br />\nstud<br />\nPort<br />\nP. A<br /><br />\nAPI),<br /><br />"}], "field_media_file": [{"target_id": 39074, "display": null, "description": null, "target_type": "file", "target_uuid": "3333fdd6-18ab-446c-bb8d-2fbb21e5ea5b", "url": "http://digital.library.jhu.edu/system/files/2022-03/12752-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12752, "target_type": "node", "target_uuid": "5530dbaf-36be-4af8-b335-675c69d59b71", "url": "/node/12752"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "613d8979-dba2-4f53-ba96-813426f736a0"}]}