{"mid": [{"value": 51445}], "uuid": [{"value": "2053297f-4549-4ec8-a6b4-baf818fd4c3e"}], "vid": [{"value": 51445}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T03:56:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16216-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T03:56:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T03:56:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "JLTIT<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nHISTORICAL POINTS Rochambeau’s troops camped here 1781 on their way to Yorktown. 1018-605 \"T|hg Labadie T(actf.\" 3,75f0|_:?cres occupied 1684 by a Religious Sect who 1125-604 EXTENSION SERVICE, UNIVERSITY OF MARYLAND<br />\n“Harford Town” or “Bush.” The first Declaration of Independence was 1016-626 ed-a communist form of life. g<br />\nsigned here March 22, 1775. Warwick. Washington stopped here on his way from Fort Cumberland to 1146-580 PLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett 169-637<br />\nWESTERN MARYLAND Rochambeau’s troops camped here in 1782 on their way back from the 1035-612 ‘Boston, in 1756, and on several other occasions. ] County, 10 miles south of Grantsville on é!ate 495. Elevations 2,000-<br />\nvictory of Yorktown. Birthplace of James Rumsey, the inventor of the steamboat. 1146-580 2,900 feet. Public facnhtuesAf%B pncnltik;(ng'unclu(}'ebalx cfovere(li)lpawh_on,<br />\n- ] ; b g e . - ila r i m-<br />\n“McCulloch’s Path.” The first trail through the Glades. George Washington 110-577 Aberdeen Proving Grounds. Military reservation of 55,000 acres of land 1047-595 Georgetown, burned by the British on May 6, 1814. 1116-561 tr:g:gf’ %Egrgp:pefgfopdgcg:mping :g(r:gma:ngdlitﬁ;\\as fore12% ppel:'sorc\\s?wv:/ith<br />\nstopped here, September 26, 1784. and yvater. ; Galena. Washington stopped here |n.177‘}. 1117-551 15 cabins and a large combination lodge and dining hall, as well as adja-<br />\n“Charles Friend’s Home.” George Washington stopped here on Septem- 114-560 Spesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592 Shrewsbury Church and Tomb of Brigadier General John Cadwalader. 1104-546 cent facilities for swimming and hiking. (For group camping reservations,<br />\nber 26, 1784, looking for the best route from the Potomac to the Ohio in Harford County. Treaty with the Susquehannock Indians made here Chestertown. (a) Washington College, founded 1782. (b) Worsell’s Tavern 1065-502 address Extension Service, University of Maryland, College Park, Md.)<br />\nRiver. in 1666. & a b wherée Washington stopped. (c) Site ’gf First FreeESchoo| of Kent County.<br />\n“Bear Camp.” General Braddock’s 6th Camp on the march to Fort Du- 154-690 Rochambeau’s Camp (near the Havre de Grace Race Track). Here in 1781 1054-624 (d) Church where the name of ‘“‘Prostestant Episcopal church’” was<br />\nquesne, J?Jne 20-21, 1755. . S the troops camped on their way to Yorktown. aédopted. Foréxdditional information apply for pamphlet at Hotels and NATIONAL PARK SERVICE AREAS IN MARYLAND<br />\nWhere George Washington was taken sick and remained for a few days 175-682 Havre de Grace. Originally called Susquehanna Lower Ferry. Washington 1056-626 hamber of Commerce. 5 : g g :<br />\ntill he cou|% proceed gnd catch up with Braddock. y stopped here many times. Rock Hall. Tench Tilghman used this route in carrying the news of the 1017-475 ;‘;{‘:rSN:;L\"e':g'I Eg:ssigr\\&c:r)ﬂfartlge aUs\"f'g?gvg’;?tes Department of the Interior admin-<br />\n“The Little Crossings” of the Youghiogheny River (now called Castieman’s 198-684 John O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-626 victory of Yorktown. ; e s 3<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the 1814 (in City park). “Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis- 1010-478 ANTIETAM NATIQNAL BAT‘tl:LEFIEILIDd SSIhTE cct))mme{;npra}es tlt\\e (d‘,!wl 593-596<br />\nlongest built up to that time. “Tudor Hall.” Birthplace of Edwin Booth and John Wilkes Booth. 982-635 Rock Hall Packet. 2 . & 4 : ??’n‘,‘,'o?tit;LZ°{nAR:$°etr?$}\\s%?;?o'rTessiﬁzeeit marked the ending of General<br />\n“Little Meadows.” Braddock’s fourth Camp on the march to “Fort 216-684 “Medical Hall.” The home of Dr. John Archer, the first graduate of medi- 992-624 “Kent Island”\" (the Isle of Kent). William Claiborne of Virginia established 995-410 Robert E. Lee’s first invasion of the North, thereby postponing indefi-<br />\nDugquesne,” 1755. Washington stopped here many times afterwards. cine in America. a t_radmg’) post, settiement and fort here in 1631. nitely England’s threatened recognition of the Confederacy and giving<br />\n“Martin’s Plantation” (near Frostburg). Braddock’s 2nd Camp, 1755. 254-660 Churchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630 ““Bolingly.” Surveyed 1658 for James Bowling. 1048-434 President Lincoln the opportunity to issue his Emancipation Proclama-<br />\nFirst Toll Gate House on National Road 262-665 to Yorktown. “Bloomingdale.” Patented 1685 by Capt. Robert Morris. 1049-416 tion. The neighboring Antietam National Cemetery is also under the<br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this 278-662 “Indian Spring.\" Where Rochambeau’s heavy artillery camped after 1016-670 “Stagwell.” Patented to Thomas Stagwell, 1649. 1050-416 3‘:&\"\"\"&5;;?\"‘\\’;‘h‘i’;ghtgyg;'&\"‘eaw::'f';3:,:;’\";?:;'{\"?: étu'fi;ﬂaﬁa‘getz?é’és;g;ﬁ<br />\nhistoric road. Erected by the D. A. R. crossing the Susquehanna River. . ““Cheston-on-Wye.” Survayed 1659 for John and William Coursey. 1043-408 gead from the battles of Antietam, South Mountain, and minor engage-<br />\nThe National Road. First internal improvement undertaken by the U. S. 286-662 Lafayette at Col. Rigbie’s House April 13, 1781, where he quelled a 1025-658 “Wye Plantation.” Home of William Paca, signer of the Declaration, and 1088-398 ments of the region. A library and small museum, located in the adminis-<br />\nGovernment. mutiny of his soldiers. twice Governor of Maryland. He lies buried here. tration building at the entrance to the National Cemetery, are available<br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage. 271-683 Conowingo ”(site of the Conowingo Dam) an Indian name meaning “At 1034-667 “Wye Island.” Patented to Col. Philemon Lloyd 1682 as ‘‘Lloyd’s Insula.” 1051-385 for the use of vnlsfitors. Organizations 30(;11 Q{OUpfj of VlSth;i\\;V}\"\" be given<br />\n“The Narrows,” the bridge to carry the new route of the National Highway 297-672 TS . “Clover Field.” 1522 acres patentéd to William Hamsley, 1730. 1086-416 fg:g::tszr;m . .aéﬁ:r%zrgjpts S Soue i1 A v U Superiny<br />\nover Will’s Creek, built 1883. Denton. Originally called Edenton for Robert Eden, Maryland’s last 1133-385 : : A dove<br />\ng y ) y<br />\nCumberland— For further information apply at Hotels and Chamber of 304-666 Colonial Governor and ancestor of Anthony Eden. F?&memEt':fl(u';'ﬁ:gﬁfn&ox%ﬁmgﬁﬁyﬁﬁ'ss‘]é?eiiﬁf?e?é?s% 919-522<br />\nCfoglrg?:rcet.éa) .ll)'hel b%gl?n)lr(? - Br\\:/dd?‘qﬁ st:r'lgw:;dro:d':té?s) t(':i? %‘rﬁe SOUTHERN MARYLAND Preston. Started 1846 ;f\"?und ‘.‘Franer’s Chapel.” ; 1112-322 of Fort McHenry against a heavy British naval bombardment in the War<br />\n?, cg \"”(;’ e; aSId ‘r’__ te%rge b af 'dg . ™ qTf? ‘\" 0 Site of home of Col. William Richardson, Col. of the “Flying Camp”’ of the 1112-296 of 1812 and the writing by Francis Scott Key of the “Star-Spangled<br />\narade Ground of C ort Cumberland. (e) The Thomas Cresap A lis. Capital of Maryland and site of the U. S. Naval Academy, St. Eastern Shore. His tomb is located here. Banner.” Key, detained by the British on a small vessel anchored behind<br />\nMonument in Riverside Park. (f) The original Headquarters House in nnapolis, Capital of Mary and s \" cademy, A S g : s<br />\nRiverside Park ; ; Johns College and numerous points of historical interest. For additional 942-416 “Wye House.” Home of the Lloyd family since Colonial times. 1035-381 the enemy fleet, during the night watched the spectacle of the British<br />\n“Washington’s Road.” Washington’s troops first opened this road from 316-684 information apply at Hotels and Chamber of Commerce. Saint Michaels. Attacked by the British during the War of 1812. 1021-348 tr\\'?fc\"ﬁ’éﬂ?y aﬁﬁ:ﬁ‘%‘;&‘rf bigsgrna(ga;ht?\\té R?nrgtr)i%anarf]ggrgfihegyiﬁtg Z%rg .<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758 Governor Ritchie Highway and Memorial ; 915-473 i Manngus o Ralsiie.” Colarsial home of the Hollyday fami, 1048-343 was moved to write the verses of our national anthem. The fort is a fine Administration Building, Hood College, Frederick State House Portico, Statue of (former) Chief Justice, R. B. Taney<br />\nWhere Jane Frazier was captured by the Indians in 1754. Original house 312-644 “Whitehall.\"f}';h? h(_mlle of Gov?‘rnor nga&o Srluar%e, considered the finest 959-431 William Penn’s visit IR 1682 to the Friends Meeting House, the oldest frame 1058-346 example of late 18th century military architecture, with bastions forming ’ ’<br />\nstill standing. example of Colonial country houses in Maryland. meeting house in America. a five-pointed star. “They’re off”’—Preakness start at Pimlico ‘“ ” . . .<br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the 347-622 “Widow Ramsey’s Tavern,” on the General’s Highway. 909-443 “Canterbury Manor.” Laid out for Richard Tilghman 1659. 1060-323 Fort McHenry is open to the public daily throughout the year, including y Homewood\", on campus of Johns Hopkins University<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many Washington and Rochambeau passed over this road on their way to York- 920-431 Oxford, one of the first towns and ports authorized by Assembly in 1683. 1036-313 Sundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open<br />\ntimes. town. “Hole in the Wall.” Early name of this village located near Whitemarsh 1062-315 \\t/)ie:i‘twoerinmgofe'r?r;aann?es epa'rr:. ?’; a:\"g)'(scs;mt\"t;“t r‘r\"f 10bc$nts; oshcha'rged to<br />\n“The Warriors Path.” War path of the five nations of Indians of New York 366-678 Route taken by Washington on his way to Annapolis to resign his com- 906-446 Church where Robert Morris’ father lies buried. 30 16 Sradd hoe );re ad?’nit?ec‘i freepOrgzniz:;?o:ssog gsr%u%% a’ri?'ug:<br />\nState to the Carolina Mountains. mission. (Bronze tablet at Severn cross roads). ““Compton.” Home of Governor Stevens who welcomed General Lafayette 888-161 given special service if arrangements are made with the superintendent.<br />\n“Old Mr. Flint’'s Home.”” Visited by Washington in 1769, while visiting 450-680 “Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434 at Fort McHenry 1825. Address: Baltimore, Maryland.<br />\nat Berkeley Springs, W. Va. “Three Mile Oak.” Portion of the old tree where citizens of Annapolis met 928-420 “Crosiadore.” The home of the Dickinson family from 1695 to the present 1058-291 : :<br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians. 463-686 General Washington in 1783, on his way to resign his commission. time. Dickinson College at Carlisle, Pa. was named after John Dickinson. CTéSSZEﬁcT%f%%Bm%%I% %ﬁxﬁ;,ﬁﬂ:gwﬂgr;r:ﬂ;oggg:ﬁe':';er:afr:,%rv'; 321-666<br />\nIt now belongs to the State. Birthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440 Cambridge. Originally part of the “Choptank Indian Reservation.” Made 1063-270 right-of-way totalling 5,253 acres, and is administered as part of the<br />\nSt. Thomas Church, Hancock. Founded 1835. During 1861-62 used as a 472-680 Hospital and University. a port of entry 1684. National Capital Park System. This old waterway, one of the least altered<br />\n: rch, g : : i s<br />\nhospital for Union Troops. d : “Elk Ridge Landing.” An important Colonial Port for the shipment of 881-506 “Appleby.” The home of Governor Thomas Holliday Hicks. 1063-263 of the older American canals, is an example of the ever-improvirig means<br />\nRoad to Fort Frederick. Built 1756. Stone fort of Colonial days in America. 517-659 tobacco. “The Treaty Oak.” Where the early settlers conferred with Choptank 1048-270 Ofttrqupoggé;tlzr;/tha;tohgzgegvégtb;?fgrg;% %atlt%r; t’ggfggeré ;’.\"’0“ h |tlhe<br />\nGen. J. E. B. Stuart’s cavalry on his raid after the Battle of Antietam 524-662 “Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482 Indians for the purchase of land. R:Vlé 3ag:ed '?he ﬁ{dian trail. colonial wagor){ road Cana|a raill;,:e:d ?eg<br />\ncrossed the National Road here, Oct. 10, 1862. “Montpelier.” The Colonial home of Col. Thomas Snowden. 844-448 “Old Trinity Church.” Built prior to 1670. 1042-272 graph and telephone, and the modern superhighwa,y. By these cons’tanﬂy<br />\nThe Federal signal station on the top of Fairview Mountain was captured 528-662 The first telegram ever sent in the world passed this spot May 24, 1844. 838-453 ““Choptank Indian Reservation.” The first Indian Reservation in America, 1082-254 improving modes of communication the once widely separated eastern<br />\nby J. E. B. Stuart’s cavalry, Oct. 10, 1862. “Van Horn’s Tavern.” A Colonial Inn at which Washington stopped many 834-448 1669. and western regions of the fast-growing Union were firmly linked both<br />\n“The Bank Road” built between 1816-21. Financed by the Banks of 570-664 times. Rehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor 1142-272 sé)cuallytand coDmrgerma(;I)g Twent)lr\\;ltwolmx(ljeshof thtc)s old cart1a|, betweﬁn<br />\nMaryland in consideration of the renewal of their Charters. “Rhodes’ Tavern,” George Washington’s last stopping place in Maryland. 820-403 of the Lees of Maryland. Gov. Thomas Sim Lee was one of them. atinel Pk Sercice: Speecr}gﬁ? conadrzcigd’toSvY:vi:e:nrglsd?trifr?ebn)!]utle?<br />\nGen. Lee’s ammunition train captured here, September 15, 1862 594-650 The second Agricultural College in the Western Hemisphere started 1754. 816-419 ““Unnacokossimmon.” Emperor of the Nanticoke Indians, lived here in 1135-257 drawn barge are available on the canal during the summer months.<br />\nGen. J. E. B. Stuart attacked a large Pennsylvania force here September 572-644 “Rossburg Inn.” A famous Colonial stopping place. 820-403 1677. Canoeing, boating, hiking, fishing, picnicking, nature walks, and ice<br />\n20, 1862, but being outnumbered retired across the Potomac. “Adelphi Mill.” Built 1796 812-420 “Patty Cannon’s House.” where the noted kidnapping group had head- 1168-296 skating are among the recreational opportunities. Canoes and rowboats<br />\nWilliamsport. An important point during the French and Indian War. It 568-644 “Bladensb 4 Sit fth. Battle of Bladensh W f 1812 820-403 quarters. Described in the novel “The Entailed Hat.” may be rented at Great Falls; and privately owned canoes are permitted<br />\n; ; ital of the United States adapsuurg.= oite of the Battie of Bladensoirg, War o . “ ; ” : “ on the canal. Address: The Superintendent, National Capital Parks,<br />\nwas considered as one of the sites for the capital of the Ur . “Mount Lubentia.” The home and school of the Rev. Jonathan Boucher, 848-388 Green Hill Town and Port,” authorized by an Act of Assembly,. 1706. 1150-176 intarior Building. Washingten 28, D. C<br />\nTl:) UtLGeo;‘?le VdVashl(r;gton c'l'\\ose tthetsge o: ;23 {’ recselnt V:’a?r:1 mgto% iy 582-682 the tutor of Jackie Custis ! ’ B T e o e oty o CATocOﬂN RECgR,EATIONE:\\L DEMONSTRATION AREA contai 670-660<br />\ne Long Meadow. Oyiginally patented in o Colonel Thomas Cresap. - e ; : “Askimi ” i ; i i ’ contains ap- -<br />\ng Mieadow. Lyipinatly p ; ! - p . “St. Barnabas Church,” erected in 1774. Washington and Governor Eden 868-359 A'sklmmokonson (Indian Town).\" The largest Indian town in Maryland 1227-161 A boraximatoly 10,000 acres of mountain land, mostly forested, ranging in<br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th, 597-688 1671). X 2 . )<br />\n103rd. 102nd and 101st with M. on the Maryland side and P. on the attended services here together. b b elevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nPenns'ylvania e & litte alon.g R % ““Northampton.” The birthplace of Albert Lord Fairfax. 874-418 \"Ngssawango Iron Furnace, E),un_t in 1832, by the Maryiand Iron Company. 1235-130 County, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown” stones 617-688 “Queen Anne.” A post town in 1707, where Washington stopped. 891-387 ”Blrthplace”of Samusi Chase,” signer of the Declaration of Indepengience. 1174-146 Route 15. (t;r:m:p i g'c'gft'ﬁ':ﬂieg'kT\"r‘l%gz':”;%i::g nr%tsjpr%asrt#iy<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and “Tulip Hill.” Colonial home of Samuel Galloway, built in 1756. 932-372 ﬁgﬁo?ﬁt&ar'ﬁ;&s here that Francis Makemie established Presbyterian- 1185-075 dannd ot the modern “unit? stes, Tk Soaiiahis 6 e g e o)<br />\nWilliam Penn’s on the other. “Rawlings’ Tavern,” Washington dined here on September 26, 1773. 916-386 i Pl On.e of the fisont Snasmales of Savty Cultoiiel Riutte 1146-050 religious organizations and to hiking and camping clubs, on a season,<br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road. 610-660 “Larkins Hills,” where Lord Baltimore and the Assembly met, 1683. 914-388 Shtedend Mooy £ ¢ 2) . f th g g . Z : d f the 1220-066 intermediate, or short term basis. Facilities in the camps include sleep-<br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers 592-542 William Penn came to the home of Colonel Thomas Tailler on December 908-376 “h)/l|arriz; é gr|rne':s” I:ree' Iocg?ec? neare thgunoiirty stones and one of the N ing hcablr)ts, umtt ',\"dé‘»es- w't\"r“ ﬁ“td°grk.'f(gﬁgg”sée'ff‘r”'Itagm\\f;‘g;\"t;]%zs'e\"<br />\nFerry, Oct. 17, 1859. 13, 1682, for his first conference with Charles Lord Baltimore as to the g PO eac “i'r‘: ) ‘(’)%’l‘ Z\\d ir;g:'rr‘r?ar aTh%nslee:)ing qbartersaare Smiouad. with<br />\nWashington-Frederick County Line. Washington County was the first 608-546 location of the Maryland-Pennsylvania Boundary Line. T cots) Dut. campers must provide their own mattresses, bedding,<br />\nCounty in the U. S. named for the Father of his country. William Penn attended a meeting of the Friends (Quakers) at Thomas 932-358 - kitchen utensils, and dishes. Address: Superintendent, National Capital<br />\n“Crampton’s Gaép” andS“South Mountain,” an important battle of Sept. 619-573 MHooker’é in 1682. 4 5 o e STATE FORESTS AND STATE PARKS IN MARYLAND Parks, Interior Building, Washington 25, D. C.<br />\n14-15, 1862. Six U. S. markers mark the spot, and a large stone arch arlboro County seat of Prince George’s County since 1720. 5 TON NATIONAL HISTORIC SITE. One of the great 913-575 . g ¢ oo<br />\ncrowns the crest. : Site of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352 The state parks of Maryland were selected for their scenic or historic values and for HAG“SO':QS,,_SMG mansions of America is historic Hampton, long the Monument to Francis Scott Keyi AFU”EOV 'Ofk the ““Star Spangled Banner<br />\n“Needwood Forest,” the home of Governor Thomas Sim Lee. 634-576 indirectly provided occasion for Francis Scott Key to write the ‘‘Star their recreational possibilities. The state forests were established primarily for home of the distinguished Ridgely family of Maryland, situated north =30 Fregenc View from Cabins at Elk Neck State Park<br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet 658-579 Spangled Banner.” conservation, but they also afford extensive recreational opportunities. For detailed of Baltimore near Towson, Maryland. There are very few early houses<br />\non a large boulder. The first Bishop consecrated in the United States, Thomas John Claggett. 870-345 information regarding cabin rentals, seasons of use and description of accommo- in the United States built on such a magnificent scale. Erected in<br />\nWhere Gen. Meade took command of the Federal Army. 684-566 Birthplace of Archbishop John Carroll. 877-343 dations, write to Department of State Forests and Parks, State Office Building, 1783-90, Hampton represents the height of opulence in the moment<br />\nFrederick. (a) Site of the Brothers Tavern where Washington stopped. 685-576 Marking the route of Washington from Annapolis to Mt. Vernon in 1783. 850-356 Annapolis, Md. just between the end of the Revolution adnd the atitqptiﬁnh{)ftthe<br />\n(b) Statue at grave of Francis Scott Key. (c) Tablet at old barracks “Melwood Park.” The home of Ignatius Digges and Governor Thomas 849-354 CEDARVILLE STATE FOREST, 3,510 acres, Charles and Prince George’s 850-294 Federal Constitution. Hamptgn is opf,_rate fa;\\s’l a r|1a l(;m: 2 ls'(t)'”g<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (e) Sim Lee. Counties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah site by the Society for the res_el:va norr\\} (t)' Iag alr(ws n_nQunItnq<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional “Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348 Swamp, maandering streams and mixed pine and hardwoods feature this under a cooperatl_ve_?greementt‘ wit hthSet adlonaf ar” .%Bv;ce.sabs<br />\ninformation apply at Hotels and Chamber of Commerce. Washington’s stepson. ; area. Limited facilities for picnicking and camping, forest roads and trails open to th?og‘{b\"c_soueliqay lt 'od“g” da uhgzd;(’m AW<br />\nG(We_rrt\\_orld.]ghnsog’sh House, wherﬁ Washington stopped several times. 688-604 “Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339 for hiking, hunting in season. Address: Forest Supt., Brandywine, Md. Sundays 1:00 to 5:30. It is closed all day P<br />\ninfield Scott Schley was born here. ; : ammunition. DONCASTER STATE FOREST, 1,464 acres, Charles County, west of La 743-246<br />\nCatoctm. Furnace, an important Iron Furnace durl.ng the Revolut[on, 1776. 678-636 “T. B.” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316 Plata and 114 miles east of Doncaster on State 6. Virginia pine forest.<br />\n“Jug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571 “Dr. Mudd’s House.” Home of Dr. Mudd, who set the broken leg of John 862-255 Limited opportunities for picnicking and camping, forest roads and trails<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566 Wilkes Booth. for hiking, hunting in season. Address: Forest Supt., Doncaster, Md.<br />\n3 street, Sept. 6-9, 186?, : “De La Brooke Manor.” Surveyed in 1650 for Robert Brooke, Commander 866-298 ELK NECK STATE FOREST, 3,762 acres, Cecil County, 1 mile east of 1110-640<br />\nMonocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562 of Charles County. Northeast. Cut-over area in wild condition. Hunting in season.<br />\n_ : THE APPALACHIAN TRAIL<br />\n“Carrollton,” 10,000 acres of land from which Charles Carroll derived the 686-516 ““Three Notch Road.” An early law providod that three notches marked on  920-190 ELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602 THE APPALACHIAN TRAIL, the longest marked and chartered footpath g33. 626<br />\ntitle, Charles Carroll of Carroliton. trees indicated a road to a ferry. : Northeast, traversinngeninsular at head of Chesapeake Bay, fronting itclthe wortldﬁ'exteiggiing f‘th Mlainetto’_(iieorgia gnters AM.af1ry|land at Pen :<br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528 Charlotte Hall School, continuously open since 1796. 863-230 both on bay and Elk River. Mixed pine and hardwood forest. Extensive ar, stretching thirty-eight miles to Harpers Ferry. ully equipped : nt. Baltimore<br />\ndelphi:\\ to Vi!ginia. N “Yg Coole Springs.” The first medicinal springs in America. 863-235 facilities for picnicking, limited opportunities for camping, swimming and isr’\\]t?alrtg;tail:gluf:i\\;e tLe;r}::sotsma(::urarY:r'\\'tatt:)l%}goonr' Zh\\?vgé'f.?ﬁ'tmaﬁgar”?”ff. ?f Washington Monument, B : Chapel, U. S. Naval<br />\n“Amelung Glass Works.” First glass works in America was established 697-547 Benedict. British troops landed here August, 1814. 892-247 boat;?gﬁ hl?suesecl)(:lepmt;? ng;’;sn(;'t?e:gx;?-lo:]O'Lett R:?\\aw;s'h) ht};l;g (for oy e R o hoch o e . 0% Sens<br />\nhere in 1789. 5 “District Line.” Point where Washington first entered Prince George’s 818-394 ;Q\"’::,i gupt North);astde . et - panorama of the Potomac at Weverton Rocks. Address: The Igotomac<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524 County, Maryland (1751). : \" L REPO . Appalachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br />\nin 1710. ““Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351 FORT FREDERICK STATE PARK, 279 acres, Washington County, off 518-646 D.C.<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482 “Broad Creek Church.” Mother Church of the District of Columbia, erected 800-336 U. S. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472 in 1723. ﬂ;mttlgh Big ﬁ’g&l_’, Znt(anc?__ on S}:ate ;14' l(?qutor\\%i old flrontler gor(t’ built<br />\n. + Peas ; 4 : e L. 3 . of stone in 17! uring French and Indian Wars, also used during<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456 Fort Washington built by Major L’Enfant who laid out the City of Wash- 792-320 Revolutionary and Civil Wars, Stone museum illustrates Successive To TRAVELLERS lN MARYLAND .<br />\nJ. E. B. Stuart’s raid, 1863. S : lpgton. o historical events. Facilities for picnicking, camping and fishing in Big<br />\nGreat Falls of the Potomac. One of the most picturesque spots in Maryland. 729-425 ‘‘Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316 Pool on old Chesapeake and Ohio Canal, near Potomac River. Address:<br />\nWestminster. The first complete county rural free delivery service in the 801-634 M(before :‘e':ar’::ed at St. M:ry s)ft&/ws'l‘t th? Indian Empferor. :,2 2R Park Supt., Big Pool, Md.<br />\nUnited States. arshall Hall. Maryland landing of Washington’s private ferry. 772- g .<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29,(;863, and Gen. James 792-669 “Aéaby.” H\\e Colonial home of Widow Eilbeck, whose daughter married 780-260 Gevh:s?TfLi-Ere%gﬁIE E%Rth;g)S%ﬁcrce:t’;;?ndwf: Cgltxer:,ta)'t,ignm1llg(s)61c;;t;- 660-595 The people Of The<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg. : eorge Mason. : affording extensive views oven Monocac and Middletown Valleys. : ’<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619 “Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288 Facilit'ie% for picnicking and hiking, refreshr):\\ent building, teahouse a)r/|d Free State Of Maryland Ocean City, Maryland’s Sea Resort<br />\n“Terra Rubra.”” Birthplace of Francis Scott Key. 710-619 Hall, Virginia. s ; shelters (reserve in advance). Address Forest Supervisor, R.F.D. #5, ;<br />\nOld Friends Meeting House, of which President Hoover's ancestors 750-632 “gov:rnorc?‘mal:‘wotgi’s Hor;;.’;{\\l\\t/)as:\\lngtfyg:lefe in October, 1785. ;;f—,:ggg Frederick, Md. send you thlS map of<br />\nwere members. “Durham Church.” Built 1732. Rebuilt in 1791. GATHLAND STATE PARK, 101 acres atop South Mountain in Washing- 619-573<br />\nFirst Reaping Machine in the world was invented here. 761-631 “Washington’s Farm.” 600 acres acquired by him in 1775. 738-226 ton and Frederick Counties at Crampton &ap on State Bouta 572 Emvg_ their Splendid road sys-<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526 “The Retreat.” Home of Daniel of St. Thomas of Jenifer. 795-248 tion of 930 feet. Located on the Appalachian Trail and surrounding the :<br />\nlast survivor of the signers of the Declaration of Independence. “‘Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248 Civil War Correspondents Monument, a national memorial. Undeveloped tem. and extend you a<br />\n“Ellicott’s Mills.” Terminus of the B. & O. R. R. in 1830 857-522 physicians. ; but plans for development are now under way. ’<br />\n“Rolling Road.” a Colonial road built for the purpose of rolling hogheads 869-538 ““Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266 GREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be- 360-650 cordial invitation to<br />\nof tobacco to Elk Ridge Landing. of Independence. 2 tween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of<br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248 Cumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic ot . J<br />\n““La Grange,” the home of Dr. James Craik, Washington’s lifelong friend 795-248 area near Fofrest Hdgrs.,h1€-milf§ r?reek gr;]d U. S. 40. Undzvc(ajloped visit us. You will be<br />\nand physician. ; opportunities for camping, iking, fishing and hunting in season. Address: E<br />\nNORTH CENTRAL MARYLAND “Samuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229 Forest Supt., Flintstone P. O., welcomed here with<br />\n’ : for several days. E MT. NEBO—STATE FOREST. AND GAME REFUGE, 1791 acres, 190-622 ]<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564 Cedar Point. Washington’s schooner ran aground here in February, 1766. 844-156 located along U. S. Route 19 in Garrett County. Tract administered genuine traditional<br />\nConfederate troops on July 11, 1864. : : “Laidlow’s Ferry.” Washington crossed here many times on his way to 803-193 jointly by the Department of State Forests and Parks and the Depart-<br />\n“‘Garrison Forest Church.” Built for the Forest inhabitants of St. Paul’s 869-573 Williamsburg. ment of Game and Inland Fish. Undeveloped. M | g b itali<br />\nChurch, Baltimore, 1742. g The birthplace of Roger Brooke Taney, Chief Justice of the United States, 919-258 PATAPSCO STATE PARK, 1,564 acres, Baltimore and Howard Counties, 860-535. arylian osplta“tyv<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560 1836-64. A . Bin , DA ) ‘<br />\n: F R ] . e 11 miles from Baltimore City Hall, 1 mile northwest of U. S. 1 from GOVERNOR MCKELDIN d<br />\nThe Old United States Arsenal. Built in 1816 after the close of the War of 877-562 “The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265 Elkridge, along Patapsco River between Relay and Hollofield. Extensive and you will see why<br />\n1812. S . : : 1 “Preston on Patuxent.” Seat of the Puritan government of Maryland, 952-196 facilities for picnicking, camping, hiking, horseback riding and nature<br />\n“The Garrison Fort.” Built in 1695 as a protection against hostile Indians. 869-573 1653-57. study, limited opportunities for swimming and fishing. Address: Park Maryland has come to be known as “AMERICA IN<br />\n“The Eagle’s Nest.” Part of “The Valley of Jehosophat”” which was con- 927-594 ““Mattapany.” Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162 Supt., lichester, Md.<br />\nﬁs_cat'ed as British qwned property and repatented_ln 1788.' Baltimore). : POCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140 M|N|ATU RE.\" :<br />\n“2”'\".’; . °'f| \"Swebet.\":\"-; P:1§°7“5t2°d 1704. Long associated with the Carroll 930-612 ““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. = 982-096 County, between Snow Hill and Pocomoke City in “Eastern Shore” area. : Hall of Records, Annapolis<br />\namily. House built abou . . Saint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129 Forest of bald cypress, southern gum, cottonwood poplar and loblolly : ;<br />\nThe Baltimore and Yorktown Turnpike Road. Authorized 1805, to rebuild 895-635 to Leonard Caivert. (¢) Trinity Church, erected from bricks of first State pine. Milburn Landing Recreational Area on Pocomoke River, 7 miles Come to Maryland and see for yourself. Meet Woodward Hall, St. John’s College, Annapolis, Maryland<br />\nthe road laid out by the State in 1787. House of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop- northeast of Pocomoke City off State 364. Facilities for picnicking, . _ X S 4<br />\n40th Milestone on the Mason and Dixon Line, surveyed and marked 925-685 I(e);'sFtomg. (f) f\"(I:VIatta_pany Street.” thte (f\":r)st '_fota# Osven.tin Marylapq. %%%ortumtees f?fS Ca{npﬁﬂ% Dhllgng ﬁShlﬂS‘J< amd hunting in season. the people of a State rich in tradition and hlstory,<br />\n1763-68 - g) “Freedom o onscne,rjce_” monument. “Father White”” memorial. ress: Forest Supt., R.F.D. ocomoke, . - 5 : 3 ; : . The Hager House —Home of the Founder of Hagerstown<br />\n“Black Horse Tavern.” Where Washington spent the night on his way 927-653 (1) “Memorial Gateway.” (j) St. Mary’s Seminary. (k) Site of first mill POTOMAC STATE FOREST, 12,057 acres, southern Garrett County 150-560 who proud of their culture and progress, are Maryland’s State House, Oldest Capitol in use in the nation, Annapolis g ! g<br />\notk o e el 178, et 70, (o ks, - 021408 o e Ty Rt Sheth ot Oudand Elsatons 1500300 e 17 ot ner '<br />\nSt. James Church, My Lady’s Manor, started 1750. (no marker). : -6 . y | . - dering the Potomac River, and one on Backbone Mtn. along State 135. i 1 : =<br />\nClynmalyra, 5,000’ acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636 established 1839. - : e Roads and trails provide access and opportunities for camping, hiking, |nSp|red by the paSt to face the future with con<br />\nmore’s Attorney-General; in 1822, his great-great grandson Henry Point Lookout. Site of Prison Camp during Civil War; where 3,000 Con- 995-075 fishing and hunting in_season. Forest Hdqrs. near Tasker Corners. .<br />\nCarroll built the house. federate prisoners died. ; s Address: Forest Supt., Deer Park, Md. fidence.<br />\n“My Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. 927-638 i e T e of the Colonists from the Ark and  874-137 SANDY POINT STATE PARK, 725 acres, located on Chesapeake Bay at 970-433 s : ; 2<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620 B DOV0 00 TRErN &85, FSO%, Sandy Point in Anne Arundel County on U. S. Route 50. Work is pro- For Complete details about historic and scenic<br />\nmarals-in Coust FHouss and Post OIS uD'S:p Fl-'alls;.“g%ms%)and burial place of Dr. James Thomas, Governor of 862-195 ceeding on the development of this park.<br />\n“ s ’ 229 : i 2 5-608 ryian - . 3 2 s ot ° .<br />\n\".:arzgag:\\m:/:iﬁsR'?“:-'.'staltxﬁg:vf: si:} 01n7f702d eg;t?):,‘;:st::faMs?::::’ o 3;2 594 “The l)\\lllonastery.” First Carmelite convent in U. S. Founded 1790. 804-268 SAS/AGE RIVER STATE FORE?\"’: 52,672 acres, n&rtheastern Gadfeét 173-335 places of interest which you should visit, | invite<br />\n. . s ’ o “ : ” . : . ounty. Elevations 1,400-3,000 feet. 1 mile east of Grantsville on U. S. 3<br />\nBuck’s County, Pennsylvania. The Oid South River Club. Oldest Secial Glub in America. - 40, turn south 5 miles to Forest Hdgrs. at New Germany. In two sections, you to write to the<br />\n“The H_Ouse of Ishmael Pa .’. who shot a Confefefate Cavalryman at- 975-608 one on Negro Mountain near Keysers R|dge on U. S. 40, and one in the<br />\ntempting to pull down his Union flag during Harry Gilmor’s raid. Savage River watershed between Meadow and Big Savage Mtns.<br />\n“The Sweathouse Road,” called from the Indian practice of throwing 960-588 . N SHORE Recreational areas with cabins (for vacation use only, by advance reser-<br />\nwater on heated stones to generate steam, an Indian ”Turkish Bath” ASTER vatiog até\\nna olis), campsites and picnickir&g facGiIities at Nsew Gerfmany<br />\nfor a curative purpose. c and Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nPerry Hall. The home of Harry Dorsey Gough. One of the largest colonial 951-375 “The Proprietors of the Susquehanna Canal” one of the first canals in 1048-659 ties include open slopes with rope tow, downhill and cross-country ski MARYLAND DEPARTMENT OF INFORMATION<br />\nhouses in Maryland. % : America, 1783. trails and ski lodge vaith cooking and sleeping accommodations for 26<br />\n“Th Road.” An old Indian trail used as a route to Joppa, the 958-572 “‘Susquehannock Indian Fort” (site of an important point in the contro- 1042-668 persons at any time of year (organized groups only, by advance reserva-<br />\nc:u}fff‘;gat g? Baltimore County 1712. -~y versy between Penn and Lord Baltimore). tion at Annapolis). Address: Forest Supt., Grantsville P.O., Md. BOX 706<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590 “Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658 SWALLOW FALLS STATE FOREST, 7,458 acres, western Garrett 110-615<br />\n“Battle of North Point,” September 12, 1814. 943-528 g River to this pomt,., : ; County, northwest of Oakland between Youghiogheny River and bound- ANNAPOLIS<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528 Cun;:@lnngihTagem. ehwaugregf’g':ambeau s heavy artillery camped before 1070-658 ary of West&/irginiaF- F—'“isions 2,200-2,900 fegt. Recreational areas at<br />\n; tnfadmablon’ 3 2 iatoric i | 908 crossing the susqu a River. : : Herrington Manor, Forest Hdars. 5 miles from Oakland, with cabins (for )<br />\nBat',t,'(;“ﬁj:‘yo':,°§n'§f8€t\"‘yaggﬂnéﬂga;{g;';gi;’t‘,-’(',’,‘,ts(,f°f;f,‘,',f,‘,‘,’;',‘§e' \";,?3\"?}01’2.‘;,.’ - e “Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679 vacation use only, by advance reservation at Annapolis), bathhouse and MARYLAND : 3<br />\nRochambeau’s Camp at White’marsh on his way to Yorktown, 1781, and 960-565 West Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671 beach for swimming in 53-acre lake, and at picturesque Swallow Falls iR<br />\non his return to tge nocth . A 1761 became the President of Princeton. ?r:\\d Mﬁdqy _Cree}:gtFaII_s (hlghgsht in IthekStat.e) 3 ':r'ulei bgl)f?nd, with ttrall_s i<br />\ni s : : : “ ; ” : rou rgin white pines and hemlocks, picnicking facilities, o ni- i<br />\nSite of “The Red Lion Tavern” where Washington stopped over 25 times. 966-554 Ng;‘:'o\"nghﬁz‘e 'LOtS- Important in the controversy over the Mason and 1074-690 s :a:mg;)ing, ﬁshpi'ng ARG Rt o s[:aas:)n. v s Foreps‘zoésjptl., . i<br />\n“The Gunpowder River.” So called as early as 1660. 993-550 i . p . s . Oakland, Md. k Cordla\"y,<br />\n“Jo Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584 Brick Meeting House,” Established by William Penn in 1702. 1086-683 ’<br />\nSrar iieh (haton v shiseed § BRgIANG. Long the rival of Ulait- “Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680 WASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash- 624-608<br />\nsviors Town* “New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681 ington County, 2 miles east of Boonsboro, then 114 miles.north of U. S.<br />\n““The Gunpowder Neck.” One of the earliest settled portions of Baltimore 998-565 other Irishmen. 40 from Zittiestown. Famous Biue Rocks on west slope of South Mitn,,<br />\nCount E::)w the site of Fort Hoyle and Edgewood Arsenal. Perryville, Cecil County, terminus of the ‘“Susquehanna Lower Ferry.” 1060-630 elevation 1,600 feet. Extensive views from restored 30-foot stone monu-<br />\n¥ Y) R g Y 2 Rochambeau’s troops camped here on their way to Yorktown in 1781 ment and observation tower, built in 1827 as the first completed memorial W<br />\nBirthplace of William Paca, signer of the Declaration of Independence. 997-588 .. . M 30 0’())0 s Ay oy t M . 506 bee to George Washington, of Hagerstown Valley, to the west and Catoctin i<br />\nCapt. John Smith ascended to this point 1608. 1014-596 _ SRS S acres, one of Maryland's largest Vianors. & Range to the east. Located on route of the Appalachian trail. Museum—<br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600 The Principio Company.” The first iron works in America (1715). 1072-638 refreshment building, and facilities for picnicking, including shelters (re-<br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594 Charlestown. Laid out in 1742. Washington stopped here many times.  1087-636 serve in advance). Address: Park Supt., Middletown, Md. THEODORE R. MCKELDIN<br />\ny . . % . o o . = » . ina A g oo<br />\n“Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599 Morth Esiet. S8 W Iiiiiron Jurgls of e “Prinipsy Sivnasiy. | - AR WYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye 1061-405 Governor of Maryland e<br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598 Elkton, o‘rllgmally calll?d Heafi of Elk”, Important during the Revglut»on. 1129-648 Mills on U. S. 213. A nature mounument preserving 400-year-old white : 3 g ; ] : ; g . ; ; :<br />\nWilliam White. The old “Post Road.” where it crosses the Maryland-Delaware Line.  1143-648 oak, said to be the largest of this species found east of Mississippi River, Baltimore Skyline U. S. Naval Academy, Annapolis The Government House, Home of Maryland’s Governors, Annapolis The Hammond-Harwood House, Annapolis Farm scene in rich Western Maryland hills Wye Oak, Maryland’s State Tree, Wye Mills<br />\n1014-604 “Bohemia Mannour.” Patented to Augustine Hermann in 1662 “for making 1110-608 with circumference of 57 feet, 7 inches—1 foot above ground, height of<br />\n<br />\n“Cokesbury College” the first Methodist College in the world éstablished<br />\n1785.<br />\n<br />\nthe Map of the Province of Maryland.”<br />\n<br />\n95 feet and spread of 165 feet. State Tree of Maryland.<br />\n<br />\nPRESERVATION TECHNOLOGIES, L.P<br />\n111 Thomson Park Drive<br />\n<br />\nCranberry Township, PA 16066<br />\n<br />\n(724) 779-2111<br />\n\f", "format": "basic_html", "processed": "JLTIT<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nHISTORICAL POINTS Rochambeau’s troops camped here 1781 on their way to Yorktown. 1018-605 \"T|hg Labadie T(actf.\" 3,75f0|_:?cres occupied 1684 by a Religious Sect who 1125-604 EXTENSION SERVICE, UNIVERSITY OF MARYLAND<br />\n“Harford Town” or “Bush.” The first Declaration of Independence was 1016-626 ed-a communist form of life. g<br />\nsigned here March 22, 1775. Warwick. Washington stopped here on his way from Fort Cumberland to 1146-580 PLEASANT VALLEY RECREATION AREA, 1904 acres, central Garrett 169-637<br />\nWESTERN MARYLAND Rochambeau’s troops camped here in 1782 on their way back from the 1035-612 ‘Boston, in 1756, and on several other occasions. ] County, 10 miles south of Grantsville on é!ate 495. Elevations 2,000-<br />\nvictory of Yorktown. Birthplace of James Rumsey, the inventor of the steamboat. 1146-580 2,900 feet. Public facnhtuesAf%B pncnltik;(ng'unclu(}'ebalx cfovere(li)lpawh_on,<br />\n- ] ; b g e . - ila r i m-<br />\n“McCulloch’s Path.” The first trail through the Glades. George Washington 110-577 Aberdeen Proving Grounds. Military reservation of 55,000 acres of land 1047-595 Georgetown, burned by the British on May 6, 1814. 1116-561 tr:g:gf’ %Egrgp:pefgfopdgcg:mping :g(r:gma:ngdlitﬁ;\\as fore12% ppel:'sorc\\s?wv:/ith<br />\nstopped here, September 26, 1784. and yvater. ; Galena. Washington stopped here |n.177‘}. 1117-551 15 cabins and a large combination lodge and dining hall, as well as adja-<br />\n“Charles Friend’s Home.” George Washington stopped here on Septem- 114-560 Spesutia Island (Utie’s Hope), 2300 acres surveyed 1658. The only Manor 1061-592 Shrewsbury Church and Tomb of Brigadier General John Cadwalader. 1104-546 cent facilities for swimming and hiking. (For group camping reservations,<br />\nber 26, 1784, looking for the best route from the Potomac to the Ohio in Harford County. Treaty with the Susquehannock Indians made here Chestertown. (a) Washington College, founded 1782. (b) Worsell’s Tavern 1065-502 address Extension Service, University of Maryland, College Park, Md.)<br />\nRiver. in 1666. &amp; a b wherée Washington stopped. (c) Site ’gf First FreeESchoo| of Kent County.<br />\n“Bear Camp.” General Braddock’s 6th Camp on the march to Fort Du- 154-690 Rochambeau’s Camp (near the Havre de Grace Race Track). Here in 1781 1054-624 (d) Church where the name of ‘“‘Prostestant Episcopal church’” was<br />\nquesne, J?Jne 20-21, 1755. . S the troops camped on their way to Yorktown. aédopted. Foréxdditional information apply for pamphlet at Hotels and NATIONAL PARK SERVICE AREAS IN MARYLAND<br />\nWhere George Washington was taken sick and remained for a few days 175-682 Havre de Grace. Originally called Susquehanna Lower Ferry. Washington 1056-626 hamber of Commerce. 5 : g g :<br />\ntill he cou|% proceed gnd catch up with Braddock. y stopped here many times. Rock Hall. Tench Tilghman used this route in carrying the news of the 1017-475 ;‘;{‘:rSN:;L\"e':g'I Eg:ssigr\\&amp;c:r)ﬂfartlge aUs\"f'g?gvg’;?tes Department of the Interior admin-<br />\n“The Little Crossings” of the Youghiogheny River (now called Castieman’s 198-684 John O’Neill’s memorial and gun used in the defense of Havre de Grace 1056-626 victory of Yorktown. ; e s 3<br />\nRiver). Old stone arch bridge built in 1813. An arch of 80 foot span, the 1814 (in City park). “Rock Hall Landing.” Eastern Shore Landing of the Colonial Annapolis- 1010-478 ANTIETAM NATIQNAL BAT‘tl:LEFIEILIDd SSIhTE cct))mme{;npra}es tlt\\e (d‘,!wl 593-596<br />\nlongest built up to that time. “Tudor Hall.” Birthplace of Edwin Booth and John Wilkes Booth. 982-635 Rock Hall Packet. 2 . &amp; 4 : ??’n‘,‘,'o?tit;LZ°{nAR:$°etr?$}\\s%?;?o'rTessiﬁzeeit marked the ending of General<br />\n“Little Meadows.” Braddock’s fourth Camp on the march to “Fort 216-684 “Medical Hall.” The home of Dr. John Archer, the first graduate of medi- 992-624 “Kent Island”\" (the Isle of Kent). William Claiborne of Virginia established 995-410 Robert E. Lee’s first invasion of the North, thereby postponing indefi-<br />\nDugquesne,” 1755. Washington stopped here many times afterwards. cine in America. a t_radmg’) post, settiement and fort here in 1631. nitely England’s threatened recognition of the Confederacy and giving<br />\n“Martin’s Plantation” (near Frostburg). Braddock’s 2nd Camp, 1755. 254-660 Churchville. Rochambeau’s heavy artillery here September, 1781, on way 1012-630 ““Bolingly.” Surveyed 1658 for James Bowling. 1048-434 President Lincoln the opportunity to issue his Emancipation Proclama-<br />\nFirst Toll Gate House on National Road 262-665 to Yorktown. “Bloomingdale.” Patented 1685 by Capt. Robert Morris. 1049-416 tion. The neighboring Antietam National Cemetery is also under the<br />\nBronze tablet on boulder, in memory of the Pioneers who traveled this 278-662 “Indian Spring.\" Where Rochambeau’s heavy artillery camped after 1016-670 “Stagwell.” Patented to Thomas Stagwell, 1649. 1050-416 3‘:&amp;\"\"\"&amp;5;;?\"‘\\’;‘h‘i’;ghtgyg;'&amp;\"‘eaw::'f';3:,:;’\";?:;'{\"?: étu'fi;ﬂaﬁa‘getz?é’és;g;ﬁ<br />\nhistoric road. Erected by the D. A. R. crossing the Susquehanna River. . ““Cheston-on-Wye.” Survayed 1659 for John and William Coursey. 1043-408 gead from the battles of Antietam, South Mountain, and minor engage-<br />\nThe National Road. First internal improvement undertaken by the U. S. 286-662 Lafayette at Col. Rigbie’s House April 13, 1781, where he quelled a 1025-658 “Wye Plantation.” Home of William Paca, signer of the Declaration, and 1088-398 ments of the region. A library and small museum, located in the adminis-<br />\nGovernment. mutiny of his soldiers. twice Governor of Maryland. He lies buried here. tration building at the entrance to the National Cemetery, are available<br />\nFirst Iron Rails manufactured in the U. S. at Mt. Savage. 271-683 Conowingo ”(site of the Conowingo Dam) an Indian name meaning “At 1034-667 “Wye Island.” Patented to Col. Philemon Lloyd 1682 as ‘‘Lloyd’s Insula.” 1051-385 for the use of vnlsfitors. Organizations 30(;11 Q{OUpfj of VlSth;i\\;V}\"\" be given<br />\n“The Narrows,” the bridge to carry the new route of the National Highway 297-672 TS . “Clover Field.” 1522 acres patentéd to William Hamsley, 1730. 1086-416 fg:g::tszr;m . .aéﬁ:r%zrgjpts S Soue i1 A v U Superiny<br />\nover Will’s Creek, built 1883. Denton. Originally called Edenton for Robert Eden, Maryland’s last 1133-385 : : A dove<br />\ng y ) y<br />\nCumberland— For further information apply at Hotels and Chamber of 304-666 Colonial Governor and ancestor of Anthony Eden. F?&amp;memEt':fl(u';'ﬁ:gﬁfn&amp;ox%ﬁmgﬁﬁyﬁﬁ'ss‘]é?eiiﬁf?e?é?s% 919-522<br />\nCfoglrg?:rcet.éa) .ll)'hel b%gl?n)lr(? - Br\\:/dd?‘qﬁ st:r'lgw:;dro:d':té?s) t(':i? %‘rﬁe SOUTHERN MARYLAND Preston. Started 1846 ;f\"?und ‘.‘Franer’s Chapel.” ; 1112-322 of Fort McHenry against a heavy British naval bombardment in the War<br />\n?, cg \"”(;’ e; aSId ‘r’__ te%rge b af 'dg . ™ qTf? ‘\" 0 Site of home of Col. William Richardson, Col. of the “Flying Camp”’ of the 1112-296 of 1812 and the writing by Francis Scott Key of the “Star-Spangled<br />\narade Ground of C ort Cumberland. (e) The Thomas Cresap A lis. Capital of Maryland and site of the U. S. Naval Academy, St. Eastern Shore. His tomb is located here. Banner.” Key, detained by the British on a small vessel anchored behind<br />\nMonument in Riverside Park. (f) The original Headquarters House in nnapolis, Capital of Mary and s \" cademy, A S g : s<br />\nRiverside Park ; ; Johns College and numerous points of historical interest. For additional 942-416 “Wye House.” Home of the Lloyd family since Colonial times. 1035-381 the enemy fleet, during the night watched the spectacle of the British<br />\n“Washington’s Road.” Washington’s troops first opened this road from 316-684 information apply at Hotels and Chamber of Commerce. Saint Michaels. Attacked by the British during the War of 1812. 1021-348 tr\\'?fc\"ﬁ’éﬂ?y aﬁﬁ:ﬁ‘%‘;&amp;‘rf bigsgrna(ga;ht?\\té R?nrgtr)i%anarf]ggrgfihegyiﬁtg Z%rg .<br />\nCumberland to Reas-Town (Bedford, Pa.) in July, 1758 Governor Ritchie Highway and Memorial ; 915-473 i Manngus o Ralsiie.” Colarsial home of the Hollyday fami, 1048-343 was moved to write the verses of our national anthem. The fort is a fine Administration Building, Hood College, Frederick State House Portico, Statue of (former) Chief Justice, R. B. Taney<br />\nWhere Jane Frazier was captured by the Indians in 1754. Original house 312-644 “Whitehall.\"f}';h? h(_mlle of Gov?‘rnor nga&amp;o Srluar%e, considered the finest 959-431 William Penn’s visit IR 1682 to the Friends Meeting House, the oldest frame 1058-346 example of late 18th century military architecture, with bastions forming ’ ’<br />\nstill standing. example of Colonial country houses in Maryland. meeting house in America. a five-pointed star. “They’re off”’—Preakness start at Pimlico ‘“ ” . . .<br />\nOld Fording Place across the Potomac of the Warriors Path, and site of the 347-622 “Widow Ramsey’s Tavern,” on the General’s Highway. 909-443 “Canterbury Manor.” Laid out for Richard Tilghman 1659. 1060-323 Fort McHenry is open to the public daily throughout the year, including y Homewood\", on campus of Johns Hopkins University<br />\nStockade Fort of Col. Thomas Cresap. Washington stopped here many Washington and Rochambeau passed over this road on their way to York- 920-431 Oxford, one of the first towns and ports authorized by Assembly in 1683. 1036-313 Sundays, from 7:30 a.m. to 5:30 p.m. The museum buildings are open<br />\ntimes. town. “Hole in the Wall.” Early name of this village located near Whitemarsh 1062-315 \\t/)ie:i‘twoerinmgofe'r?r;aann?es epa'rr:. ?’; a:\"g)'(scs;mt\"t;“t r‘r\"f 10bc$nts; oshcha'rged to<br />\n“The Warriors Path.” War path of the five nations of Indians of New York 366-678 Route taken by Washington on his way to Annapolis to resign his com- 906-446 Church where Robert Morris’ father lies buried. 30 16 Sradd hoe );re ad?’nit?ec‘i freepOrgzniz:;?o:ssog gsr%u%% a’ri?'ug:<br />\nState to the Carolina Mountains. mission. (Bronze tablet at Severn cross roads). ““Compton.” Home of Governor Stevens who welcomed General Lafayette 888-161 given special service if arrangements are made with the superintendent.<br />\n“Old Mr. Flint’'s Home.”” Visited by Washington in 1769, while visiting 450-680 “Belvoir.” Rochambeau’s troops camped here on their way to Yorktown. 918-434 at Fort McHenry 1825. Address: Baltimore, Maryland.<br />\nat Berkeley Springs, W. Va. “Three Mile Oak.” Portion of the old tree where citizens of Annapolis met 928-420 “Crosiadore.” The home of the Dickinson family from 1695 to the present 1058-291 : :<br />\nSite of Tonoloway Fort. Built 1755 as a protection against the Indians. 463-686 General Washington in 1783, on his way to resign his commission. time. Dickinson College at Carlisle, Pa. was named after John Dickinson. CTéSSZEﬁcT%f%%Bm%%I% %ﬁxﬁ;,ﬁﬂ:gwﬂgr;r:ﬂ;oggg:ﬁe':';er:afr:,%rv'; 321-666<br />\nIt now belongs to the State. Birthplace of Johns Hopkins, May 19, 1795. Founder of Johns Hopkins 894-440 Cambridge. Originally part of the “Choptank Indian Reservation.” Made 1063-270 right-of-way totalling 5,253 acres, and is administered as part of the<br />\nSt. Thomas Church, Hancock. Founded 1835. During 1861-62 used as a 472-680 Hospital and University. a port of entry 1684. National Capital Park System. This old waterway, one of the least altered<br />\n: rch, g : : i s<br />\nhospital for Union Troops. d : “Elk Ridge Landing.” An important Colonial Port for the shipment of 881-506 “Appleby.” The home of Governor Thomas Holliday Hicks. 1063-263 of the older American canals, is an example of the ever-improvirig means<br />\nRoad to Fort Frederick. Built 1756. Stone fort of Colonial days in America. 517-659 tobacco. “The Treaty Oak.” Where the early settlers conferred with Choptank 1048-270 Ofttrqupoggé;tlzr;/tha;tohgzgegvégtb;?fgrg;% %atlt%r; t’ggfggeré ;’.\"’0“ h |tlhe<br />\nGen. J. E. B. Stuart’s cavalry on his raid after the Battle of Antietam 524-662 “Spurrier’s Tavern.” Visited over twenty-five times by Washington. 857-482 Indians for the purchase of land. R:Vlé 3ag:ed '?he ﬁ{dian trail. colonial wagor){ road Cana|a raill;,:e:d ?eg<br />\ncrossed the National Road here, Oct. 10, 1862. “Montpelier.” The Colonial home of Col. Thomas Snowden. 844-448 “Old Trinity Church.” Built prior to 1670. 1042-272 graph and telephone, and the modern superhighwa,y. By these cons’tanﬂy<br />\nThe Federal signal station on the top of Fairview Mountain was captured 528-662 The first telegram ever sent in the world passed this spot May 24, 1844. 838-453 ““Choptank Indian Reservation.” The first Indian Reservation in America, 1082-254 improving modes of communication the once widely separated eastern<br />\nby J. E. B. Stuart’s cavalry, Oct. 10, 1862. “Van Horn’s Tavern.” A Colonial Inn at which Washington stopped many 834-448 1669. and western regions of the fast-growing Union were firmly linked both<br />\n“The Bank Road” built between 1816-21. Financed by the Banks of 570-664 times. Rehoboth, granted Richard Lee of Virginia 1673 (2350 acres). The ancestor 1142-272 sé)cuallytand coDmrgerma(;I)g Twent)lr\\;ltwolmx(ljeshof thtc)s old cart1a|, betweﬁn<br />\nMaryland in consideration of the renewal of their Charters. “Rhodes’ Tavern,” George Washington’s last stopping place in Maryland. 820-403 of the Lees of Maryland. Gov. Thomas Sim Lee was one of them. atinel Pk Sercice: Speecr}gﬁ? conadrzcigd’toSvY:vi:e:nrglsd?trifr?ebn)!]utle?<br />\nGen. Lee’s ammunition train captured here, September 15, 1862 594-650 The second Agricultural College in the Western Hemisphere started 1754. 816-419 ““Unnacokossimmon.” Emperor of the Nanticoke Indians, lived here in 1135-257 drawn barge are available on the canal during the summer months.<br />\nGen. J. E. B. Stuart attacked a large Pennsylvania force here September 572-644 “Rossburg Inn.” A famous Colonial stopping place. 820-403 1677. Canoeing, boating, hiking, fishing, picnicking, nature walks, and ice<br />\n20, 1862, but being outnumbered retired across the Potomac. “Adelphi Mill.” Built 1796 812-420 “Patty Cannon’s House.” where the noted kidnapping group had head- 1168-296 skating are among the recreational opportunities. Canoes and rowboats<br />\nWilliamsport. An important point during the French and Indian War. It 568-644 “Bladensb 4 Sit fth. Battle of Bladensh W f 1812 820-403 quarters. Described in the novel “The Entailed Hat.” may be rented at Great Falls; and privately owned canoes are permitted<br />\n; ; ital of the United States adapsuurg.= oite of the Battie of Bladensoirg, War o . “ ; ” : “ on the canal. Address: The Superintendent, National Capital Parks,<br />\nwas considered as one of the sites for the capital of the Ur . “Mount Lubentia.” The home and school of the Rev. Jonathan Boucher, 848-388 Green Hill Town and Port,” authorized by an Act of Assembly,. 1706. 1150-176 intarior Building. Washingten 28, D. C<br />\nTl:) UtLGeo;‘?le VdVashl(r;gton c'l'\\ose tthetsge o: ;23 {’ recselnt V:’a?r:1 mgto% iy 582-682 the tutor of Jackie Custis ! ’ B T e o e oty o CATocOﬂN RECgR,EATIONE:\\L DEMONSTRATION AREA contai 670-660<br />\ne Long Meadow. Oyiginally patented in o Colonel Thomas Cresap. - e ; : “Askimi ” i ; i i ’ contains ap- -<br />\ng Mieadow. Lyipinatly p ; ! - p . “St. Barnabas Church,” erected in 1774. Washington and Governor Eden 868-359 A'sklmmokonson (Indian Town).\" The largest Indian town in Maryland 1227-161 A boraximatoly 10,000 acres of mountain land, mostly forested, ranging in<br />\nMason and Dixon Line. The 105th Milestone erected in 1763. The 104th, 597-688 1671). X 2 . )<br />\n103rd. 102nd and 101st with M. on the Maryland side and P. on the attended services here together. b b elevation from 500 to 1,890 feet. It is located in northern Frederick<br />\nPenns'ylvania e &amp; litte alon.g R % ““Northampton.” The birthplace of Albert Lord Fairfax. 874-418 \"Ngssawango Iron Furnace, E),un_t in 1832, by the Maryiand Iron Company. 1235-130 County, 16 miles north of Frederick near Thurmont, Maryland, on U. S.<br />\nMason and Dixon Line. The 100th Milestone. One of the “Crown” stones 617-688 “Queen Anne.” A post town in 1707, where Washington stopped. 891-387 ”Blrthplace”of Samusi Chase,” signer of the Declaration of Indepengience. 1174-146 Route 15. (t;r:m:p i g'c'gft'ﬁ':ﬂieg'kT\"r‘l%gz':”;%i::g nr%tsjpr%asrt#iy<br />\nset every five miles. On one side Lord Baltimore’s coat of arms, and “Tulip Hill.” Colonial home of Samuel Galloway, built in 1756. 932-372 ﬁgﬁo?ﬁt&amp;ar'ﬁ;&amp;s here that Francis Makemie established Presbyterian- 1185-075 dannd ot the modern “unit? stes, Tk Soaiiahis 6 e g e o)<br />\nWilliam Penn’s on the other. “Rawlings’ Tavern,” Washington dined here on September 26, 1773. 916-386 i Pl On.e of the fisont Snasmales of Savty Cultoiiel Riutte 1146-050 religious organizations and to hiking and camping clubs, on a season,<br />\nGen. Robert E. Lee entered Hagerstown Sept. 11, 1862, along this road. 610-660 “Larkins Hills,” where Lord Baltimore and the Assembly met, 1683. 914-388 Shtedend Mooy £ ¢ 2) . f th g g . Z : d f the 1220-066 intermediate, or short term basis. Facilities in the camps include sleep-<br />\nHarpers Ferry Bridge where John Brown crossed in his raid on Harpers 592-542 William Penn came to the home of Colonel Thomas Tailler on December 908-376 “h)/l|arriz; é gr|rne':s” I:ree' Iocg?ec? neare thgunoiirty stones and one of the N ing hcablr)ts, umtt ',\"dé‘»es- w't\"r“ ﬁ“td°grk.'f(gﬁgg”sée'ff‘r”'Itagm\\f;‘g;\"t;]%zs'e\"<br />\nFerry, Oct. 17, 1859. 13, 1682, for his first conference with Charles Lord Baltimore as to the g PO eac “i'r‘: ) ‘(’)%’l‘ Z\\d ir;g:'rr‘r?ar aTh%nslee:)ing qbartersaare Smiouad. with<br />\nWashington-Frederick County Line. Washington County was the first 608-546 location of the Maryland-Pennsylvania Boundary Line. T cots) Dut. campers must provide their own mattresses, bedding,<br />\nCounty in the U. S. named for the Father of his country. William Penn attended a meeting of the Friends (Quakers) at Thomas 932-358 - kitchen utensils, and dishes. Address: Superintendent, National Capital<br />\n“Crampton’s Gaép” andS“South Mountain,” an important battle of Sept. 619-573 MHooker’é in 1682. 4 5 o e STATE FORESTS AND STATE PARKS IN MARYLAND Parks, Interior Building, Washington 25, D. C.<br />\n14-15, 1862. Six U. S. markers mark the spot, and a large stone arch arlboro County seat of Prince George’s County since 1720. 5 TON NATIONAL HISTORIC SITE. One of the great 913-575 . g ¢ oo<br />\ncrowns the crest. : Site of home and grave of Dr. Beanes whose arrest by the British in 1814, 862-352 The state parks of Maryland were selected for their scenic or historic values and for HAG“SO':QS,,_SMG mansions of America is historic Hampton, long the Monument to Francis Scott Keyi AFU”EOV 'Ofk the ““Star Spangled Banner<br />\n“Needwood Forest,” the home of Governor Thomas Sim Lee. 634-576 indirectly provided occasion for Francis Scott Key to write the ‘‘Star their recreational possibilities. The state forests were established primarily for home of the distinguished Ridgely family of Maryland, situated north =30 Fregenc View from Cabins at Elk Neck State Park<br />\nBraddock’s Heights and Braddock’s Spring, marked by a bronze tablet 658-579 Spangled Banner.” conservation, but they also afford extensive recreational opportunities. For detailed of Baltimore near Towson, Maryland. There are very few early houses<br />\non a large boulder. The first Bishop consecrated in the United States, Thomas John Claggett. 870-345 information regarding cabin rentals, seasons of use and description of accommo- in the United States built on such a magnificent scale. Erected in<br />\nWhere Gen. Meade took command of the Federal Army. 684-566 Birthplace of Archbishop John Carroll. 877-343 dations, write to Department of State Forests and Parks, State Office Building, 1783-90, Hampton represents the height of opulence in the moment<br />\nFrederick. (a) Site of the Brothers Tavern where Washington stopped. 685-576 Marking the route of Washington from Annapolis to Mt. Vernon in 1783. 850-356 Annapolis, Md. just between the end of the Revolution adnd the atitqptiﬁnh{)ftthe<br />\n(b) Statue at grave of Francis Scott Key. (c) Tablet at old barracks “Melwood Park.” The home of Ignatius Digges and Governor Thomas 849-354 CEDARVILLE STATE FOREST, 3,510 acres, Charles and Prince George’s 850-294 Federal Constitution. Hamptgn is opf,_rate fa;\\s’l a r|1a l(;m: 2 ls'(t)'”g<br />\nbuilt in 1777. (d) Tablet at corner of Church and Market Streets. (e) Sim Lee. Counties, off U. S. 301, 5 miles southeast of Brandywine. The Zekiah site by the Society for the res_el:va norr\\} (t)' Iag alr(ws n_nQunItnq<br />\nTaney House (Bentz Street). (f) Barbara Fritchie House. For additional “Mount Airy,” The home of Benedict Calvert, whose daughter married 854-348 Swamp, maandering streams and mixed pine and hardwoods feature this under a cooperatl_ve_?greementt‘ wit hthSet adlonaf ar” .%Bv;ce.sabs<br />\ninformation apply at Hotels and Chamber of Commerce. Washington’s stepson. ; area. Limited facilities for picnicking and camping, forest roads and trails open to th?og‘{b\"c_soueliqay lt 'od“g” da uhgzd;(’m AW<br />\nG(We_rrt\\_orld.]ghnsog’sh House, wherﬁ Washington stopped several times. 688-604 “Mrs. Surratt’s House.” where John Wilkes Booth stopped to secure 829-339 for hiking, hunting in season. Address: Forest Supt., Brandywine, Md. Sundays 1:00 to 5:30. It is closed all day P<br />\ninfield Scott Schley was born here. ; : ammunition. DONCASTER STATE FOREST, 1,464 acres, Charles County, west of La 743-246<br />\nCatoctm. Furnace, an important Iron Furnace durl.ng the Revolut[on, 1776. 678-636 “T. B.” The initials of Thomas Brooke on a boundary stone at Brookfield. 834-316 Plata and 114 miles east of Doncaster on State 6. Virginia pine forest.<br />\n“Jug Bridge,” where Lafayette was met by the Citizens of Frederick, 1824. 696-571 “Dr. Mudd’s House.” Home of Dr. Mudd, who set the broken leg of John 862-255 Limited opportunities for picnicking and camping, forest roads and trails<br />\nHeadquarters of Generals Robert E. Lee, Stonewall Jackson and Long- 688-566 Wilkes Booth. for hiking, hunting in season. Address: Forest Supt., Doncaster, Md.<br />\n3 street, Sept. 6-9, 186?, : “De La Brooke Manor.” Surveyed in 1650 for Robert Brooke, Commander 866-298 ELK NECK STATE FOREST, 3,762 acres, Cecil County, 1 mile east of 1110-640<br />\nMonocacy Battlefield,” July 9, 1864. Apply for pamphlets at Frederick. 685-562 of Charles County. Northeast. Cut-over area in wild condition. Hunting in season.<br />\n_ : THE APPALACHIAN TRAIL<br />\n“Carrollton,” 10,000 acres of land from which Charles Carroll derived the 686-516 ““Three Notch Road.” An early law providod that three notches marked on  920-190 ELK NECK STATE PARK, 995 acres, Cecil County, 10 miles south of 1088-602 THE APPALACHIAN TRAIL, the longest marked and chartered footpath g33. 626<br />\ntitle, Charles Carroll of Carroliton. trees indicated a road to a ferry. : Northeast, traversinngeninsular at head of Chesapeake Bay, fronting itclthe wortldﬁ'exteiggiing f‘th Mlainetto’_(iieorgia gnters AM.af1ry|land at Pen :<br />\nRoute taken by Gen. Anthony Wayne in 1781 on his march from Phila- 670-528 Charlotte Hall School, continuously open since 1796. 863-230 both on bay and Elk River. Mixed pine and hardwood forest. Extensive ar, stretching thirty-eight miles to Harpers Ferry. ully equipped : nt. Baltimore<br />\ndelphi:\\ to Vi!ginia. N “Yg Coole Springs.” The first medicinal springs in America. 863-235 facilities for picnicking, limited opportunities for camping, swimming and isr’\\]t?alrtg;tail:gluf:i\\;e tLe;r}::sotsma(::urarY:r'\\'tatt:)l%}goonr' Zh\\?vgé'f.?ﬁ'tmaﬁgar”?”ff. ?f Washington Monument, B : Chapel, U. S. Naval<br />\n“Amelung Glass Works.” First glass works in America was established 697-547 Benedict. British troops landed here August, 1814. 892-247 boat;?gﬁ hl?suesecl)(:lepmt;? ng;’;sn(;'t?e:gx;?-lo:]O'Lett R:?\\aw;s'h) ht};l;g (for oy e R o hoch o e . 0% Sens<br />\nhere in 1789. 5 “District Line.” Point where Washington first entered Prince George’s 818-394 ;Q\"’::,i gupt North);astde . et - panorama of the Potomac at Weverton Rocks. Address: The Igotomac<br />\nSugar Loaf Mountain. So called by Baron Graffenried, a Swiss Nobleman, 690-524 County, Maryland (1751). : \" L REPO . Appalachian Trail Club, 1916 Sunderland Place, N.W., Washington 6,<br />\nin 1710. ““Oxon Hill.” Home of the Addison family. John Hanson died here. 804-351 FORT FREDERICK STATE PARK, 279 acres, Washington County, off 518-646 D.C.<br />\n“Whites Ferry.” Important crossing of the Potomac during the Civil War. 652-482 “Broad Creek Church.” Mother Church of the District of Columbia, erected 800-336 U. S. 40, 5 miles south of Clear Spring or Indian Springs via State 56<br />\nWoodstock. Farm owned by Washington at the time of his death. 702-472 in 1723. ﬂ;mttlgh Big ﬁ’g&amp;l_’, Znt(anc?__ on S}:ate ;14' l(?qutor\\%i old flrontler gor(t’ built<br />\n. + Peas ; 4 : e L. 3 . of stone in 17! uring French and Indian Wars, also used during<br />\nRockville. (a) Site of camping grounds of Braddock’s troops, 1755. (b) 758-456 Fort Washington built by Major L’Enfant who laid out the City of Wash- 792-320 Revolutionary and Civil Wars, Stone museum illustrates Successive To TRAVELLERS lN MARYLAND .<br />\nJ. E. B. Stuart’s raid, 1863. S : lpgton. o historical events. Facilities for picnicking, camping and fishing in Big<br />\nGreat Falls of the Potomac. One of the most picturesque spots in Maryland. 729-425 ‘‘Piscataway Town.” Visited by Governor Leonard Calvert, March 1634, 807-316 Pool on old Chesapeake and Ohio Canal, near Potomac River. Address:<br />\nWestminster. The first complete county rural free delivery service in the 801-634 M(before :‘e':ar’::ed at St. M:ry s)ft&amp;/ws'l‘t th? Indian Empferor. :,2 2R Park Supt., Big Pool, Md.<br />\nUnited States. arshall Hall. Maryland landing of Washington’s private ferry. 772- g .<br />\nUnion Mills. Gen. J. E. B. Stuart’s Camp on June 29,(;863, and Gen. James 792-669 “Aéaby.” H\\e Colonial home of Widow Eilbeck, whose daughter married 780-260 Gevh:s?TfLi-Ere%gﬁIE E%Rth;g)S%ﬁcrce:t’;;?ndwf: Cgltxer:,ta)'t,ignm1llg(s)61c;;t;- 660-595 The people Of The<br />\nBarnes’ Camp on June 30, 1863, on their way to Gettysburg. : eorge Mason. : affording extensive views oven Monocac and Middletown Valleys. : ’<br />\n“Cookerly’s Tavern.” Washington stopped here on July 1, 1791. 712-619 “Widow Chapman’s.” Mt. Aventine on the Potomac opposite Gunston 770-288 Facilit'ie% for picnicking and hiking, refreshr):\\ent building, teahouse a)r/|d Free State Of Maryland Ocean City, Maryland’s Sea Resort<br />\n“Terra Rubra.”” Birthplace of Francis Scott Key. 710-619 Hall, Virginia. s ; shelters (reserve in advance). Address Forest Supervisor, R.F.D. #5, ;<br />\nOld Friends Meeting House, of which President Hoover's ancestors 750-632 “gov:rnorc?‘mal:‘wotgi’s Hor;;.’;{\\l\\t/)as:\\lngtfyg:lefe in October, 1785. ;;f—,:ggg Frederick, Md. send you thlS map of<br />\nwere members. “Durham Church.” Built 1732. Rebuilt in 1791. GATHLAND STATE PARK, 101 acres atop South Mountain in Washing- 619-573<br />\nFirst Reaping Machine in the world was invented here. 761-631 “Washington’s Farm.” 600 acres acquired by him in 1775. 738-226 ton and Frederick Counties at Crampton &amp;ap on State Bouta 572 Emvg_ their Splendid road sys-<br />\n“Doughoregan Manor.” The home of Charles Carroll of Carrollton. The 830-526 “The Retreat.” Home of Daniel of St. Thomas of Jenifer. 795-248 tion of 930 feet. Located on the Appalachian Trail and surrounding the :<br />\nlast survivor of the signers of the Declaration of Independence. “‘Rose Hill.” The home of Dr. Gustavus Brown, one of Washington’s 795-248 Civil War Correspondents Monument, a national memorial. Undeveloped tem. and extend you a<br />\n“Ellicott’s Mills.” Terminus of the B. &amp; O. R. R. in 1830 857-522 physicians. ; but plans for development are now under way. ’<br />\n“Rolling Road.” a Colonial road built for the purpose of rolling hogheads 869-538 ““Habre de Venture,” the home of Thomas Stone, signer of the Declaration 800-266 GREEN RIDGE STATE FOREST, 25,451 acres, Allegany County, be- 360-650 cordial invitation to<br />\nof tobacco to Elk Ridge Landing. of Independence. 2 tween Town Hill, Polish Mtn. and the Potomac River, 15 miles east of<br />\nPort Tobacco. The County Seat of Charles County until 1895. 795-248 Cumberland along U. S. 40. Elevations 500-1,800 feet. Roadside picnic ot . J<br />\n““La Grange,” the home of Dr. James Craik, Washington’s lifelong friend 795-248 area near Fofrest Hdgrs.,h1€-milf§ r?reek gr;]d U. S. 40. Undzvc(ajloped visit us. You will be<br />\nand physician. ; opportunities for camping, iking, fishing and hunting in season. Address: E<br />\nNORTH CENTRAL MARYLAND “Samuel Cox’s Farm,” where John Wilkes Booth and his accomplice hid 804-229 Forest Supt., Flintstone P. O., welcomed here with<br />\n’ : for several days. E MT. NEBO—STATE FOREST. AND GAME REFUGE, 1791 acres, 190-622 ]<br />\nSite of Home of Governor Augustus W. Bradford which was burned by 906-564 Cedar Point. Washington’s schooner ran aground here in February, 1766. 844-156 located along U. S. Route 19 in Garrett County. Tract administered genuine traditional<br />\nConfederate troops on July 11, 1864. : : “Laidlow’s Ferry.” Washington crossed here many times on his way to 803-193 jointly by the Department of State Forests and Parks and the Depart-<br />\n“‘Garrison Forest Church.” Built for the Forest inhabitants of St. Paul’s 869-573 Williamsburg. ment of Game and Inland Fish. Undeveloped. M | g b itali<br />\nChurch, Baltimore, 1742. g The birthplace of Roger Brooke Taney, Chief Justice of the United States, 919-258 PATAPSCO STATE PARK, 1,564 acres, Baltimore and Howard Counties, 860-535. arylian osplta“tyv<br />\nOld Court Road. The original road leading to the Court at Joppa Town. 871-560 1836-64. A . Bin , DA ) ‘<br />\n: F R ] . e 11 miles from Baltimore City Hall, 1 mile northwest of U. S. 1 from GOVERNOR MCKELDIN d<br />\nThe Old United States Arsenal. Built in 1816 after the close of the War of 877-562 “The Cliffs of Calvert.” One of the most picturesque spots in Maryland. 938-265 Elkridge, along Patapsco River between Relay and Hollofield. Extensive and you will see why<br />\n1812. S . : : 1 “Preston on Patuxent.” Seat of the Puritan government of Maryland, 952-196 facilities for picnicking, camping, hiking, horseback riding and nature<br />\n“The Garrison Fort.” Built in 1695 as a protection against hostile Indians. 869-573 1653-57. study, limited opportunities for swimming and fishing. Address: Park Maryland has come to be known as “AMERICA IN<br />\n“The Eagle’s Nest.” Part of “The Valley of Jehosophat”” which was con- 927-594 ““Mattapany.” Site of 1st Jesuit Mission, later home of Charles (3rd Lord 965-162 Supt., lichester, Md.<br />\nﬁs_cat'ed as British qwned property and repatented_ln 1788.' Baltimore). : POCOMOKE STATE FOREST, 12,377 acres, southwestern Worcester 1225-140 M|N|ATU RE.\" :<br />\n“2”'\".’; . °'f| \"Swebet.\":\"-; P:1§°7“5t2°d 1704. Long associated with the Carroll 930-612 ““Manor of Cornwaley’s Cross.” One of the oldest homes in Maryland. = 982-096 County, between Snow Hill and Pocomoke City in “Eastern Shore” area. : Hall of Records, Annapolis<br />\namily. House built abou . . Saint Mary’s City. (a) Reproduction of State House of 1676. (b) Monument 963-129 Forest of bald cypress, southern gum, cottonwood poplar and loblolly : ;<br />\nThe Baltimore and Yorktown Turnpike Road. Authorized 1805, to rebuild 895-635 to Leonard Caivert. (¢) Trinity Church, erected from bricks of first State pine. Milburn Landing Recreational Area on Pocomoke River, 7 miles Come to Maryland and see for yourself. Meet Woodward Hall, St. John’s College, Annapolis, Maryland<br />\nthe road laid out by the State in 1787. House of 1676. (d) Site of the 1st State House. (e) Governor Lionel Cop- northeast of Pocomoke City off State 364. Facilities for picnicking, . _ X S 4<br />\n40th Milestone on the Mason and Dixon Line, surveyed and marked 925-685 I(e);'sFtomg. (f) f\"(I:VIatta_pany Street.” thte (f\":r)st '_fota# Osven.tin Marylapq. %%%ortumtees f?fS Ca{npﬁﬂ% Dhllgng ﬁShlﬂS‘J&lt; amd hunting in season. the people of a State rich in tradition and hlstory,<br />\n1763-68 - g) “Freedom o onscne,rjce_” monument. “Father White”” memorial. ress: Forest Supt., R.F.D. ocomoke, . - 5 : 3 ; : . The Hager House —Home of the Founder of Hagerstown<br />\n“Black Horse Tavern.” Where Washington spent the night on his way 927-653 (1) “Memorial Gateway.” (j) St. Mary’s Seminary. (k) Site of first mill POTOMAC STATE FOREST, 12,057 acres, southern Garrett County 150-560 who proud of their culture and progress, are Maryland’s State House, Oldest Capitol in use in the nation, Annapolis g ! g<br />\notk o e el 178, et 70, (o ks, - 021408 o e Ty Rt Sheth ot Oudand Elsatons 1500300 e 17 ot ner '<br />\nSt. James Church, My Lady’s Manor, started 1750. (no marker). : -6 . y | . - dering the Potomac River, and one on Backbone Mtn. along State 135. i 1 : =<br />\nClynmalyra, 5,000’ acres surveyed 1705 for Charles Carroll, Lord Balti- 908-636 established 1839. - : e Roads and trails provide access and opportunities for camping, hiking, |nSp|red by the paSt to face the future with con<br />\nmore’s Attorney-General; in 1822, his great-great grandson Henry Point Lookout. Site of Prison Camp during Civil War; where 3,000 Con- 995-075 fishing and hunting in_season. Forest Hdqrs. near Tasker Corners. .<br />\nCarroll built the house. federate prisoners died. ; s Address: Forest Supt., Deer Park, Md. fidence.<br />\n“My Lady’s Manor.” 10,000 acres owned by Lady Baroness of Baltimore. 927-638 i e T e of the Colonists from the Ark and  874-137 SANDY POINT STATE PARK, 725 acres, located on Chesapeake Bay at 970-433 s : ; 2<br />\nBel Air. County seat of Harford County since 1783. See portraits and 984-620 B DOV0 00 TRErN &amp;85, FSO%, Sandy Point in Anne Arundel County on U. S. Route 50. Work is pro- For Complete details about historic and scenic<br />\nmarals-in Coust FHouss and Post OIS uD'S:p Fl-'alls;.“g%ms%)and burial place of Dr. James Thomas, Governor of 862-195 ceeding on the development of this park.<br />\n“ s ’ 229 : i 2 5-608 ryian - . 3 2 s ot ° .<br />\n\".:arzgag:\\m:/:iﬁsR'?“:-'.'staltxﬁg:vf: si:} 01n7f702d eg;t?):,‘;:st::faMs?::::’ o 3;2 594 “The l)\\lllonastery.” First Carmelite convent in U. S. Founded 1790. 804-268 SAS/AGE RIVER STATE FORE?\"’: 52,672 acres, n&amp;rtheastern Gadfeét 173-335 places of interest which you should visit, | invite<br />\n. . s ’ o “ : ” . : . ounty. Elevations 1,400-3,000 feet. 1 mile east of Grantsville on U. S. 3<br />\nBuck’s County, Pennsylvania. The Oid South River Club. Oldest Secial Glub in America. - 40, turn south 5 miles to Forest Hdgrs. at New Germany. In two sections, you to write to the<br />\n“The H_Ouse of Ishmael Pa .’. who shot a Confefefate Cavalryman at- 975-608 one on Negro Mountain near Keysers R|dge on U. S. 40, and one in the<br />\ntempting to pull down his Union flag during Harry Gilmor’s raid. Savage River watershed between Meadow and Big Savage Mtns.<br />\n“The Sweathouse Road,” called from the Indian practice of throwing 960-588 . N SHORE Recreational areas with cabins (for vacation use only, by advance reser-<br />\nwater on heated stones to generate steam, an Indian ”Turkish Bath” ASTER vatiog até\\nna olis), campsites and picnickir&amp;g facGiIities at Nsew Gerfmany<br />\nfor a curative purpose. c and Big Run. Swimming in 13-acre lake at New Germany. Skiing facili-<br />\nPerry Hall. The home of Harry Dorsey Gough. One of the largest colonial 951-375 “The Proprietors of the Susquehanna Canal” one of the first canals in 1048-659 ties include open slopes with rope tow, downhill and cross-country ski MARYLAND DEPARTMENT OF INFORMATION<br />\nhouses in Maryland. % : America, 1783. trails and ski lodge vaith cooking and sleeping accommodations for 26<br />\n“Th Road.” An old Indian trail used as a route to Joppa, the 958-572 “‘Susquehannock Indian Fort” (site of an important point in the contro- 1042-668 persons at any time of year (organized groups only, by advance reserva-<br />\nc:u}fff‘;gat g? Baltimore County 1712. -~y versy between Penn and Lord Baltimore). tion at Annapolis). Address: Forest Supt., Grantsville P.O., Md. BOX 706<br />\nThe Baltimore and Harford Turnpike, built 1816. 950-590 “Smith’s Falls.” In 1608 Captain John Smith ascended the Susquehanna 1040-658 SWALLOW FALLS STATE FOREST, 7,458 acres, western Garrett 110-615<br />\n“Battle of North Point,” September 12, 1814. 943-528 g River to this pomt,., : ; County, northwest of Oakland between Youghiogheny River and bound- ANNAPOLIS<br />\nBritish attack on Baltimore on the Battlefield of North Point. 943-528 Cun;:@lnngihTagem. ehwaugregf’g':ambeau s heavy artillery camped before 1070-658 ary of West&amp;/irginiaF- F—'“isions 2,200-2,900 fegt. Recreational areas at<br />\n; tnfadmablon’ 3 2 iatoric i | 908 crossing the susqu a River. : : Herrington Manor, Forest Hdars. 5 miles from Oakland, with cabins (for )<br />\nBat',t,'(;“ﬁj:‘yo':,°§n'§f8€t\"‘yaggﬂnéﬂga;{g;';gi;’t‘,-’(',’,‘,ts(,f°f;f,‘,',f,‘,‘,’;',‘§e' \";,?3\"?}01’2.‘;,.’ - e “Richards’ Oak.” Lafayette’s troops camped under this tree in 1781. 1049-679 vacation use only, by advance reservation at Annapolis), bathhouse and MARYLAND : 3<br />\nRochambeau’s Camp at White’marsh on his way to Yorktown, 1781, and 960-565 West Nottingham Academy, founded 1744, by Dr. Samuel Finley, who in 1061-671 beach for swimming in 53-acre lake, and at picturesque Swallow Falls iR<br />\non his return to tge nocth . A 1761 became the President of Princeton. ?r:\\d Mﬁdqy _Cree}:gtFaII_s (hlghgsht in IthekStat.e) 3 ':r'ulei bgl)f?nd, with ttrall_s i<br />\ni s : : : “ ; ” : rou rgin white pines and hemlocks, picnicking facilities, o ni- i<br />\nSite of “The Red Lion Tavern” where Washington stopped over 25 times. 966-554 Ng;‘:'o\"nghﬁz‘e 'LOtS- Important in the controversy over the Mason and 1074-690 s :a:mg;)ing, ﬁshpi'ng ARG Rt o s[:aas:)n. v s Foreps‘zoésjptl., . i<br />\n“The Gunpowder River.” So called as early as 1660. 993-550 i . p . s . Oakland, Md. k Cordla\"y,<br />\n“Jo Town.” County seat of Baltimore County, 1712 to 1768. A port 982-584 Brick Meeting House,” Established by William Penn in 1702. 1086-683 ’<br />\nSrar iieh (haton v shiseed § BRgIANG. Long the rival of Ulait- “Blue Ball Tavern.” Established in 1710, by Andrew Job. 1112-680 WASHINGTON MONUMENT STATE PARK, 96 acres, eastern Wash- 624-608<br />\nsviors Town* “New Munster.” 6,000 acres granted in 1683, to Edwin O’Dwire and 15 1133-681 ington County, 2 miles east of Boonsboro, then 114 miles.north of U. S.<br />\n““The Gunpowder Neck.” One of the earliest settled portions of Baltimore 998-565 other Irishmen. 40 from Zittiestown. Famous Biue Rocks on west slope of South Mitn,,<br />\nCount E::)w the site of Fort Hoyle and Edgewood Arsenal. Perryville, Cecil County, terminus of the ‘“Susquehanna Lower Ferry.” 1060-630 elevation 1,600 feet. Extensive views from restored 30-foot stone monu-<br />\n¥ Y) R g Y 2 Rochambeau’s troops camped here on their way to Yorktown in 1781 ment and observation tower, built in 1827 as the first completed memorial W<br />\nBirthplace of William Paca, signer of the Declaration of Independence. 997-588 .. . M 30 0’())0 s Ay oy t M . 506 bee to George Washington, of Hagerstown Valley, to the west and Catoctin i<br />\nCapt. John Smith ascended to this point 1608. 1014-596 _ SRS S acres, one of Maryland's largest Vianors. &amp; Range to the east. Located on route of the Appalachian trail. Museum—<br />\nSophia’s Dairy. Built 1768, by Aquila Paca. 1020-600 The Principio Company.” The first iron works in America (1715). 1072-638 refreshment building, and facilities for picnicking, including shelters (re-<br />\nSite of “Old Baltimore,” 1683. 1st County Seat of Baltimore County. 1011-594 Charlestown. Laid out in 1742. Washington stopped here many times.  1087-636 serve in advance). Address: Park Supt., Middletown, Md. THEODORE R. MCKELDIN<br />\ny . . % . o o . = » . ina A g oo<br />\n“Spesutia P. E. Church” (St. George’s Parish). Founded 1671. 1025-599 Morth Esiet. S8 W Iiiiiron Jurgls of e “Prinipsy Sivnasiy. | - AR WYE OAK STATE PARK, 1.5 acres, northern Talbot County near Wye 1061-405 Governor of Maryland e<br />\n“Constant Friendship” Owned by Col. Thomas White, father of Bishop 995-598 Elkton, o‘rllgmally calll?d Heafi of Elk”, Important during the Revglut»on. 1129-648 Mills on U. S. 213. A nature mounument preserving 400-year-old white : 3 g ; ] : ; g . ; ; :<br />\nWilliam White. The old “Post Road.” where it crosses the Maryland-Delaware Line.  1143-648 oak, said to be the largest of this species found east of Mississippi River, Baltimore Skyline U. S. Naval Academy, Annapolis The Government House, Home of Maryland’s Governors, Annapolis The Hammond-Harwood House, Annapolis Farm scene in rich Western Maryland hills Wye Oak, Maryland’s State Tree, Wye Mills<br />\n1014-604 “Bohemia Mannour.” Patented to Augustine Hermann in 1662 “for making 1110-608 with circumference of 57 feet, 7 inches—1 foot above ground, height of<br /><br />\n“Cokesbury College” the first Methodist College in the world éstablished<br />\n1785.<br /><br />\nthe Map of the Province of Maryland.”<br /><br />\n95 feet and spread of 165 feet. State Tree of Maryland.<br /><br />\nPRESERVATION TECHNOLOGIES, L.P<br />\n111 Thomson Park Drive<br /><br />\nCranberry Township, PA 16066<br /><br />\n(724) 779-2111<br />"}], "field_media_file": [{"target_id": 52368, "display": null, "description": null, "target_type": "file", "target_uuid": "c52ec2a2-9812-46da-9c00-3a99a8b81106", "url": "http://digital.library.jhu.edu/system/files/2022-03/16216-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16216, "target_type": "node", "target_uuid": "8a88311b-9f78-4477-97ef-a9eea0df8ef5", "url": "/node/16216"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "679b2740-29d3-4f3a-885c-1f317bda56da"}]}