{"mid": [{"value": 38071}], "uuid": [{"value": "bfafd195-c8ff-468d-8e92-5b4f4f726b55"}], "vid": [{"value": 38071}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:47:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12639-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:47:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:47:08+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nt4 iAlts 4113Pitilts Nztun-ilIrttrr<br />\n<br />\n\"AMERICAN BALI\" — PART II<br />\nBy EDGAR KEMLER<br />\nSee Page Two<br />\nPrice Five Cents<br />\n<br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, OCTOBER 8, 1935<br />\n<br />\nVol. XL—No. 3<br />\n<br />\nR.O.T.C. Names<br />\nRobinsonDenies Athletic Heads Italian Consul Graduate Student In Political<br />\nRelates Experiences<br />\nNew Officers For<br />\nStatements In At Assembly Gives300Books Science<br />\nBefore Coming To Hopkins Coming Year<br />\nTo University<br />\nHearst Article<br />\nBernard Stein, Graduate Student at Johns HopArchaeologist Denies That<br />\nOlythians Had S a c r ed<br />\nDuty To Enjoy Wine<br />\n<br />\nCaptains and managers of the<br />\nvarious sports at the Hopkins will<br />\nspeak at the assembly this Thursday in Latrobe 120. Dr. G. Wilson<br />\nShaffer, head of the Department<br />\nof Physical Training and Athletics, is also expected to address<br />\nthe meeting.<br />\n<br />\nIn charge of the assembly is the<br />\nA. A. Board, whose president, Bill<br />\nHazlett, will present the speakers.<br />\nIt is expected that Reuben Pasarew will talk on football, Pete<br />\nSwindell on lacrosse, George Margolis on basketball, Leonard Emmert on track, and Hazlett on<br />\nswimming, besides representatives<br />\nof several other sports.<br />\n<br />\nSpecial Detachment Of Po- William<br />\nkins, Tells Interviewer of School Days and of Thrilling<br />\nlice Guard Against StuTrips Taken Among the Mountains of Europe<br />\ndent Body Protest<br />\n<br />\nNo Demonstration<br />\n<br />\nAnLt.-Col. Hoisington<br />\nnounces New Organization At Remsen Assembly<br />\n<br />\nBy KENNETH ZIERLER<br />\n<br />\n45 Students Named<br />\n<br />\nAn all-around man and a very fine short by the German government.<br />\nDr. Bowman Accepts Gift one—from Alpine climbing to getting The idea was to award scholarships<br />\nwhat corresponds to our doctor of on the basis of past performances to<br />\nFor J. H. U.; Dr. Green- law degree at the age of twenty- those whose education was nearly New Drill Scheme Described<br />\nNo Such Temple Uncovered<br />\nthree.<br />\nThat is William Bernard completed so that they may soon find<br />\nAnd Plans For Coming<br />\nfield Lauds Collection<br />\nIn Olynthus; Only Girls<br />\nStern — short, dark, bespectacled their places in the professional life<br />\nYear Outlined<br />\nThree hundred volumes of Italian<br />\nyoung German from Wurzburg, Ba- of this country.<br />\nPainted On Vases<br />\nliterature were presented to the UniWas At Texas<br />\nvaria, now a graduate student in poAt a meeting held late yesterday<br />\nversity by Dr. Mario Carosi, Royal<br />\nDr. David Moore Robinson, head of<br />\nStern won a scholarship—one of<br />\nlitical science at the Hopkins.<br />\nin Remsen Hall, the Johns Hopkins<br />\nBaltimore.<br />\nat<br />\nItalian<br />\nConsul<br />\nthe department of art and archaeolHe is a serious young man at twen- few selected from many applicants— Unit of the Reserve Officers Training<br />\nWhen the books were delivered.<br />\nogy at the Johns Hopkins University,<br />\nty-five. His is an unassuming mild and elected to go to the. University Corp announced the officers for the<br />\nSunday, a special detachment of potoday disclaimed authority for some<br />\nmanner and his is a life that is full. of Texas, where he was a guest of coming year.<br />\nlice were assigned to prevent any<br />\nstatements included in an article<br />\nHhe studied law in Germany at the the Phi Sig house there. Other Phi<br />\nPresided over by Lt.-Col. Hoisingdemonstration which was rumored to<br />\n11.)uses participating in this plan<br />\npublished in The American Weekly<br />\nUniversities of Munich, Berlin, and<br />\nthe new organization of the R.<br />\nton,<br />\nagainst<br />\nthe<br />\nin<br />\nplace<br />\nprotest<br />\ntake<br />\nMagazine, Sunday, September 29, reVViurzburg, receiving his degree in are at the Universities of Chicago, 0. T. C. was described and drill<br />\nno<br />\nBut<br />\nEthiopia.<br />\nof<br />\ninvasion<br />\nItalian<br />\ngarding his discoveries and excavaPennsylvania,<br />\nMichigan,<br />\n1933 at the last-named institution. .-urneil,<br />\nshemes to be used this year was exstudents or demonstration appeared<br />\ntions at Olynthus.<br />\nHis thesis was entitled Der Kundig- Jolorado, Missouri, Alabama, West plained.<br />\nscene.<br />\nthe<br />\non<br />\nThe article, while in the main auVirginia, New York, and Rensselaer<br />\nThe new officers are:<br />\nAbout fifty people were present at ungseinspruchsprozess. German readthentic and accurate, contains cerPolytechnic<br />\nInstitute.<br />\ning classes are invited to figure it<br />\nthe ceremony at which Dr. Isaiah<br />\nCommander,<br />\nBattalion<br />\nMajor,<br />\ntain statements which have been disHopkins Ideal<br />\nWell-Known Political Leader Bowman, president of the University, out.<br />\ntorted in such a way as to make<br />\nAfter spending half a year at Tex- P. W. Guild; captain, battalion adjuFollowing this he took a summer<br />\nAnd Author To Speak At accepted the collection of books for course<br />\nthem absolutely false. It is these<br />\nas Stern decided he was too far away tant, H. D. Severn; first sergeant,<br />\nat the University College of<br />\nthe<br />\nUniversity.<br />\nstatements for Which Dr. Robinson<br />\nthe center of information for drum major, G. R. Weigand.<br />\nfrom<br />\nLecture Series at 8 P. M. Dr. Kent R. Greenfield, professor the Southwest of England. He spent<br />\nCOMPANY \"A\"<br />\nwishes to disclaim responsibility.<br />\na student of international law. As a<br />\nof modern European languages, said some time in England and is inter- result, he chose Hopkins, ideally sitCaptain, W. R. Hazlett; first lieuSensational Rather Than Truthful<br />\nNorman Thomas, renowned writer in his address explaining the new ested in the work of the New ComAccording to the American Weekuated for his field. On a scholarship tenants, B. W. Archer, A. Karpuk, C.<br />\nmonwealth Institute in London.<br />\nand<br />\nforemost American Socialist, collection:<br />\nassumed<br />\nbe<br />\nly Magazine, \"it may<br />\nfrom the University supplemented by I. Rostov. Second lieutenants, G. S.<br />\nat the Johns Hopkins<br />\n\"We may feel very grateful to SigPhi Sig Scholar<br />\nthat the leading citizens of Olynthus will be present<br />\nPhi Sig and the International Stu- Eager, J. A. Hurwitz, W. 0. Miller,<br />\n8,<br />\naddress<br />\nOctober<br />\nUniversity<br />\nto<br />\non<br />\nnor<br />\nCarosi, who not only as friend of<br />\nfelt it their sacred duty to fill themThen, a year ago, Phi Sigma Delta :lents Service, he is especially study- F. T. Suman, Jr., J. E. Walsh. First<br />\nthe first meeting of the University the library of the Johns Hopkins<br />\nselves with the choicest wines and<br />\nfraternity in collaboration with the ing international law and relations, sergeants, H. M. Diver, H. H. Leber.<br />\nClub.<br />\nThe subject of his University has given us, at hiS own<br />\nSupper<br />\nenjoy the performances of the pretty<br />\nInternational Students Service, ar- working at the present time on the<br />\nCOMPANY \"B\"<br />\ntalk will be \"The University and expense, a setting for these books in<br />\ndancing girls frequently.\"<br />\nranged scholarships with various role of equity in international arbiCaptain, C. J. Arcilesi. First lieuTimes.\"<br />\nChanging<br />\nwhich they will be readily accessible American universities for those stu- tration under Drs. Johannes Mattern<br />\n\"This,\" says Dr. Robinson, \"is a<br />\ntenants, J. B. Bullock, G. H. Dayett,<br />\nFollowing his address here, Dr. to us all, but who as a representative dents and former university instruc- and James Hart.<br />\nshameful distortion of facts in order<br />\nE. J. Hatfeld, Jr. Second lieutento provide reading which is sensa- Thomas will give one of the Univer- of his people has wished to submit tors whose education had been cut<br />\n(Continued on Page 4, Col. 3)<br />\nants, R. D. Bader, R. Byer, D. H.<br />\ninterand<br />\nrich<br />\ntional rather than truthful. There sity Lecture series being sponsored to our judgment this<br />\nFisher, R. D. Gambrill, J. W. Powers.<br />\nare no indications found in my ex- by the Hopkins Y. M. C. A., and held esting example of their intellectual<br />\nFirst sergeants, W. D. Buttner, H.<br />\ncavations to support the contention at the First Methodist Episcopal and artistic activity.<br />\nW. Glasser.<br />\n\"For the products of this activity<br />\nthat drinking wine or viewing dances Church. His topic for discussion will<br />\nCOMPANY \"C\"<br />\nby pretty girls was considered by be \"Conflictions Between Security are exports which, whatever may be<br />\nT. D. Callahan, Jr. First<br />\nCaptain,<br />\nthe judgments or decisions dictated<br />\nthe Olynthian populace to be their and Liberty.\"<br />\nlieutenants, E. H. Henning, J. W. Mcby<br />\ncomedy<br />\na<br />\nHills,<br />\nthe<br />\nof<br />\nJeppi<br />\nexpediency<br />\nor<br />\njustice<br />\nof<br />\nsense<br />\nour<br />\nby<br />\nBorn In Ohio<br />\nsacred duty.\"<br />\nGarrity, J. Miceli. Second lieutento the political acts of Ludwig Holling, has been selected<br />\nStatements Misleading<br />\nDr. Thomas was born in Marion, with reference<br />\nC. P. Davis Jr., F. B. Hall, B.<br />\nants,<br />\nfifthe<br />\nof<br />\nproduction<br />\nfirst<br />\nthe<br />\nfor<br />\nan<br />\nto<br />\nsubjected<br />\nbe<br />\nIn another portion of the page is Ohio, in 1884. He was graduated a state, can never<br />\nI. Maisel, F. A. Sarlin. First serHopkins<br />\nJohns<br />\nthe<br />\nof<br />\nseason<br />\nteenth<br />\ncan<br />\nuniversities<br />\nour<br />\nwhile<br />\nembargo<br />\nskeletons<br />\na picture depicting fourteen<br />\nfrom the Marion High School in 19(11<br />\ngeants, V. C. Grove, R. G. Sachs.<br />\nPlaced side by side. The \"blurb\" be- and four years later received his still maintain their hard-won faith in Playshop, according to Dr. N. Bryl- Head Of Archaeology DeCOMPANY \"D'<br />\ngroup.<br />\nthe<br />\nof<br />\ndirector<br />\nFagin,<br />\nIon<br />\nthought.\"<br />\nof<br />\nfreedom<br />\nthe<br />\nneath reads as follows: \"A grim re- A. B. degree at Princeton University.<br />\nTo<br />\nGive<br />\npartment<br />\nAddress<br />\nW. E. Bittrick. First lieuCaptain,<br />\nperfive<br />\ngiven<br />\nbe<br />\nwill<br />\nplay<br />\nThe<br />\nIncluded<br />\nMatter<br />\nCritical<br />\n2,300<br />\nminder of a plague in Olynthus<br />\nIn 1911 he matriculated at the Union<br />\ntenants, V. C. Kelly, L. B. Tankin,<br />\nDr. Greenfield publicly expressed formances, beginning Tuesday, NoOn Poetry of Pindar<br />\nyears ago when scores of people—no Theological Seminary and was orR. B. Young. Second lieutenants, E.<br />\ndoubt lovely dancers like those above dained into the ministry of the Pres- his appreciation of the fact that the vember 19.<br />\nM. Lippman, J. MacClarence, A. V.<br />\nSeveral Plays Scheduled<br />\namong them—were laid side by side byterian Church. Between 1918 and collection contained not only matter<br />\nThe Johns Hopkins University<br />\noffering<br />\nof<br />\npolicy<br />\nVoegle. First sergeants, E. L. RowContinuing<br />\nits<br />\nbut<br />\nstate,<br />\nFascist<br />\nthe<br />\nwithout coffins in a single grave.\" 1921 Dr. Thomas founded and edited favorable to<br />\nPhilological Association will hear Dr.<br />\nseason,<br />\neach<br />\nny, W. H. Townshend.<br />\npresentations<br />\nseveral<br />\nwell.<br />\nas<br />\nmatter<br />\ncritical<br />\ndancers<br />\nlovely<br />\nthat<br />\nThis intimation<br />\nDavid Moore Robinson, head of the<br />\nThe World Tomorrow. In 1921 he<br />\nAmong the volumes, which are to the Playshop is preparing a schedule University's department of art and<br />\nwere among the fourteen skeletons became associate editor of The NaThe Fires of St.<br />\npictured, has no foundation in fact. tion and the director of the League be housed in a special alcove pre- which will include<br />\narchaeology, lecturer on Greek litersented by Signor Carosi, are some John, by Herman Sudermann; a new ature, and president of the associa- J. H. U. Cotillion Board<br />\n\"There is,\" according to Dr. Robin- for Industrial Democracy in 1922.<br />\nforty plays by about twenty different play by a contemporary American tion, deliver his presidential address<br />\nson, \"no indication that any of the<br />\nAnnounces First Dance<br />\nCandidate For President<br />\nauthors, Dr. Greenfield said. There playwriter, and a series of short dra- on Thursday, October 17, at 11:30<br />\nfourteen skeletons were either lovely<br />\nA candidate for governor of New are about thirty novels by fifteen mas. Each play will be preceded by<br />\nor dancers.<br />\nThe majority of the<br />\nA. M.<br />\nThe Townsmen, well-known local<br />\nYork on the Socialist ticket, and authors, and sixteen volumes of a lecture from some prominent scholskeletons shown are of the male sex.\"<br />\nDr. Robinson has chosen the topic, orchestra, will furish the music at<br />\ntwice a candidate for mayor of New verse by a dozen poets.<br />\nar or lecturer on dramatics.<br />\nThe article also mentions the fact<br />\n\"Pindar, A Poet of Eternal Ideas.\" the first dance to be held in LeverYork City, Dr. Thomas ran for presiSeason tickets entitling the holder<br />\nDuce's Speeches Recorded<br />\nthat \"a great temple to the god had<br />\nThe purpose of lecturing on this ing Hall on Saturday night, October<br />\ndent in 1928 and 1932.<br />\nFor comment on modern Italian to see all productions and to attend<br />\nbeen found decorated with friezes of<br />\nAs an author, Dr. Thomas has life are the five volumes of Cose all lectures may be obtained from topic, explained Dr. Robinson, is to 12, from 9 to 1, according to an andancing girls.\" \"There is absolutely<br />\noffer a refutation to the idea held nouncement from the Cotillion Board.<br />\nwritten such books as America's Way Viste by Ugo Oietti, Italian journal- Dr. Fagin for $2.00.<br />\nno basis for this assertion,\" says Dr.<br />\nThe board, headed by Alan Deleby many modern scholars, including<br />\nOut, As I Sec It, and What's The ist; an edition of the public addresses<br />\nAdmission for the major performRobinson, chief archaeologist of the<br />\nMatter With New York? He has of Mussolini; and recent works on ances will be fifty cents for the stu- Gilbert Murray, that there is no vett, has started preparation for the<br />\nexpedition. He states that no temple<br />\nthought in the works of Pindar. Dr. first Cotillion, which will be held<br />\nalso made many contributions to the Fascism and the cooperative state.<br />\ndent body.<br />\nwas found such as described in the<br />\nRobinson believes, however, that Thanksgiving night, probably at the<br />\nSocialist and Labor Press.<br />\narticle. There were excavated, howPindar's<br />\nworks are full of thoughts, Alcazar. The orchestra which will<br />\nOn November 5, Dr. T. Z. Koo, Secever, vases and mosaics bearing<br />\nof<br />\nmany<br />\nwhich can be applied to the play at the Cotillion will be decided<br />\nfigures of dancing girls, but no retary World's Student Christian Fedpresent<br />\nDr. Robinson also holds on later.<br />\nday.<br />\neration, will address the Supper Club.<br />\ntemple.<br />\nthat the works of Pindar influenced<br />\nDr. Thomas Guthrie Speers, trusDescribes Olynthus<br />\nsuch literary figures as Matthew ArThe article deals with the history tee of Princeton University and of<br />\nnold, Ruskin, Tennyson, Emerson, First Meeting Of Band<br />\nof Olynthus, and with the customs Goucher College, will present the<br />\nSwinburne, Walter Pater. and others<br />\nTo Be Held Tomorrow<br />\nand habits of the people living there. third lecture on December 10.<br />\nIn a message primarily designed marked in part, \"to get places either<br />\nMany modern scholars also hold<br />\nIt describes how Olynthus was deOther speakers who will address for the incoming students, but of during the summer, or after school the belief that Milton never read<br />\nAn organization meeting of the<br />\nstroyed by Philip of Macedon, father the Supper Club at subsequent meet- definite interest to upper classmen hours, in positions which are allied Pindar. In answer to this Dr. RobinHopkins Band will be held<br />\nJohns<br />\n1)<br />\n(Continued on Page 4, Col.<br />\nings throughout the year are Dr. as well, Dr. William B. Kouwenhov- to their studies. Thus one can broad- son has direct proof that Milton<br />\nOctober 9, at 4 o'clock,<br />\nWednesday,'<br />\nToyDr.<br />\n7;<br />\nJanuary<br />\non<br />\nKirby Page,<br />\nen, assistant dean of the School of en his knowledge of his particular spent three months reading Pindar.<br />\nWell-Known Astronemer<br />\nhiko Kagawa, on January 21; Dr. Engineering, and director of the subject. 'What is more important, if As his proof, Dr. Robinson will offer in the Barn. All students interested<br />\nGraham, on February American Institute of Engineering, he is good, is the fact that he stands the fact that the copy of Pindar used are urged to attend.<br />\nTo Give Courses Here Frank Porter<br />\nInstruments can be borrowed, and<br />\n18; Paul Hutchinson, on March 17; stressed particularly the duties of a an excellent chance to obtain a place by Milton is now in the Harvard Uniauthorization slips will be given at<br />\nDr. A. Adel, New Member Of Teach- Rev. Ernest Fremont Tittle, on April<br />\nSugraduation.<br />\nafter<br />\npertiimmediately<br />\ngiving<br />\nfreshman class, while<br />\nversity Library, is underscored, and<br />\ners' College Faculty, To Do<br />\n21; Rev. Reinhold Niebuhr, on May nent advice to students in his de- perintendents have an uncanny mem- contains many notes in the margins the meeting to supply the members.<br />\nPlayers of brass instruments and<br />\nSpectroscopy Work<br />\n12.<br />\nory. They especially remember men which are unmistakably those of<br />\npartment.<br />\nclarinets are especially in demand.<br />\ngood work- Milton.<br />\n\"This class,\" said Dr. KoKtiwen- who are persistent or are<br />\nBand officers for the current year<br />\nDr. A. Adel, the new member in<br />\ncite several exThe lecture is open to all students include: Ace Weigand, drum major;<br />\nhoven, in speaking of the freshmen, ers.\" He went on to<br />\nthe Department of Astronomy of the zalero Club To Discuss<br />\nmemory.<br />\nhis<br />\nwithin<br />\nthis<br />\nof<br />\namples<br />\nand instructors of the Univeroity, Edwin Ottenheimer, leader; Lowere,<br />\nimpresses me as being both big and<br />\nCollege For Teachers, is well-known<br />\nS.<br />\nU.<br />\nSubmarine<br />\nPlanes<br />\nschool graduate whether members of the Philological<br />\nengineering<br />\n\"The<br />\nhaving<br />\nof<br />\nsense<br />\nthe<br />\ngood-looking—in<br />\nsecretary, and Wm. Gontrum, limolecular rein the field of<br />\npossibilities. I would especially of today need have little fear of dif- Association or not.<br />\ngreat<br />\nplanbrarian.<br />\nof<br />\nsearch and also in the study<br />\nTuesday at 5:00 P. M. was selected like to see these possibilities realized ficulty in obtaining a position.\"<br />\nn the evening of the same day, Dr.<br />\nAt the<br />\nets and their atmosphere.<br />\nPoints To Last Year's Record<br />\nmeeting time by the in some form of campaign to keep<br />\nRobinson will deliver an address to<br />\nUniversity of Michigan Graduate as a regular<br />\nGAREY STATE POLICE HEAD<br />\nconnecthis<br />\nIn<br />\ngrass.<br />\nAero<br />\nthe<br />\nClub<br />\noff<br />\nat<br />\nits<br />\npeople<br />\nHopkins<br />\nfirst<br />\nAt this point he interrupted his a large audience in the New York<br />\nSchool he did extensive research Johns<br />\ntion it would be well to emphasize the discourse to pull a well-fingered University's auditorium at Univermeeting held last Friday.<br />\nwork on the atmosphere of the planet<br />\nMajor Enoch Barton Garey, former<br />\nfor interest in the activities of brown notebook from a drawer.<br />\nneed<br />\ngathering<br />\nwill<br />\nformal<br />\nfirst<br />\nsity Heights, on the \"Methods of ExThe<br />\nits<br />\natmosphere<br />\nVenus and proved that<br />\nprofessor of Military Science and<br />\nuniits<br />\nin<br />\nas<br />\nwell<br />\nas<br />\nUniversity<br />\nthe<br />\nhe<br />\nEngineering,\"<br />\nof<br />\nSchool<br />\n\"The<br />\ncavation.\"<br />\nis largely made up of carbon dioxide. take place today in the office of the<br />\nTactics at the Johns Hopkins Univerversity. A man should allow himself read, \"graduated forty mechanical<br />\nDr. Adel has also done considerable Student Activities Committee in<br />\nwas appointed head of the<br />\nsity,<br />\nand<br />\noutrecreation<br />\nfor<br />\ntime<br />\nof<br />\nplenty<br />\nand electrical engineers at the last<br />\nLevering Hall. The discussion will<br />\nwork at the Lowell Observatory.<br />\nMaryland State Police last week by<br />\nMEET<br />\nACTIVITIES<br />\nHEADS<br />\nOF<br />\nfreshmen<br />\nHowever,<br />\ninterests.<br />\nside<br />\nof<br />\ntwo<br />\nexcept<br />\nAll<br />\ncommencement.<br />\nAt Johns Hopkins, Dr. Adel will be on \"Folding-Wing Submarine<br />\nGovernor Harry W. Nice.<br />\nand upper classmen alike should do these men are working in their choswork with Dr. Gerhard H. Pieke, as- Planes of the U. S. Navy.\" The lecMajor Garey, who is widely known<br />\ncourses<br />\nthe<br />\non<br />\nhard<br />\nwork<br />\nthan<br />\nmore<br />\nthe<br />\nof<br />\nJohn<br />\nMagill,<br />\nC.<br />\npresident<br />\ncontinuen fields. Both of these are<br />\nsociate professor of physics, in the ture will be augmented by several<br />\nhis textbooks on military instrucfor<br />\nHopthe<br />\nat<br />\nstudying<br />\nhere<br />\nare<br />\nthey<br />\nof<br />\nproudest<br />\nam<br />\nI<br />\nstudies.<br />\ntheir<br />\ning<br />\nhas<br />\nStudent Activities Committee,<br />\nfield of experimental spectroscopy. photographs from the collection of<br />\ntion, was appointed head of the Milikins.\"<br />\nworkis<br />\nthese<br />\nof<br />\none<br />\nno<br />\nthat<br />\nfact<br />\nthe<br />\nthe<br />\nof<br />\npresident<br />\nDuce,<br />\nDr. Adel will also give the astronomy G. Grahame<br />\nhas announced a meeting of the<br />\ntary Department at the Hopkins<br />\ning for any government agency. No<br />\nSummer Jobs Advised<br />\ncourse in the College For Teachers. club. An election will also be held<br />\npresidents and business managers of shortly after the war and held this<br />\nthe<br />\nascend<br />\nto<br />\nexpecting<br />\nhis<br />\nengineer<br />\nturned<br />\nthen<br />\nKouwenhoven<br />\nDr.<br />\nDr. Adel graduated from the Uni- to fill the position of vice-president.<br />\nthe various activities, to be held to- post until he assumed the presidency<br />\nversity of Michigan in 1931 and re- Names of all students interested in attention to the matter of placing ladder of success should accept a<br />\nmorrow at 12:20 P. M., in the board of St. John's College several years<br />\nemerin<br />\nexcept<br />\nposition<br />\nceived the degree of doctor of philoso- the club should be sent to G. G. Duce, graduates, which is in his charge. \"I government<br />\nago.<br />\nof Levering Hall.<br />\nroom<br />\ngency<br />\ncases.\"<br />\nrehe<br />\nmen,\"<br />\nadvise<br />\nstrongly<br />\nwould<br />\nphy there in 1933.<br />\nBox 65.<br />\n<br />\nNo Basis For Belief<br />\n<br />\nNorman Thomas To<br />\nOpen Supper Club<br />\nSeries Here Tonight<br />\n<br />\nPlayshop To Open Philological<br />\nSeason November19<br />\n<br />\nGroup<br />\nAt Johns Hopkins<br />\nTo Hear Robinson<br />\n<br />\nDr. Kouwenhoven Gives<br />\nViews On Freshman Class<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br />\n<br />\nOMMEN<br />\n<br />\nTbt PewslLetter<br />\n<br />\nQuad Quips<br />\n<br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nTuesday, October 8, 1935<br />\n<br />\nEternal Freshman<br />\n<br />\nERICAN BALI -:-<br />\n<br />\nBy JACK STEIN<br />\n<br />\n. . . \"Good humor is one of the best articles of<br />\ndress one can wear in society.\" Thus William Thackeray<br />\nRemit subscription fees to Treasurer, Student Acdefined the word humor.<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hop. . . \"Wit is the most rascally, contemptible, begkins University.<br />\ngarly thing on the face of the earth.\" This is the defiEntered as second-class matter December 3, 1909, nition of wit by Arthur Murphy, an Irish dramatist and<br />\nat the Postoffice in Baltimore, Md., under the Act of miscellaneous writer of the 19th century.<br />\nCongress, November 3, 1879.<br />\nBut we all agree that wit and humor are not the<br />\nPublished semi-weekly from October to June, ex- same thing. Wit implies the swift perception of the<br />\ncept during examination and college holiday periods incongrous, while humor, often blended with pathos,<br />\nimplies a more kindly sense of the incongrous. Be that<br />\nby undergraduates of the Johns Hopkins University.<br />\nas it may, the object of this column is to present a witty<br />\nEDITORIAL DEPARTMENT<br />\nhumor. Define that! Go ahead—I dare you!<br />\n. . . in any case, a girl I know received a letter<br />\nEditor-in-Chief<br />\nJesse N. Borden<br />\nfrom a barber friend of hers proposing marriage. She<br />\nEditor<br />\nManaging<br />\nLeberfeld<br />\nIrving<br />\nhappened to leave this letter exposed and while visiting<br />\nWilliam Diamond, Stanley M Finkel,<br />\nher one night, I read it. This is what the barber says:<br />\nAssistant Managing Editors<br />\nDear One:<br />\nNews Editor<br />\nHershner Cross<br />\nHair I comb bringing a massage of love. It's a singe<br />\nEditor<br />\nSports<br />\nKenneth Zierler<br />\nthat<br />\nI'd lather have you than all the curls in the world.<br />\nEditor<br />\nSports<br />\nAssistant<br />\nCaplan<br />\nDavid<br />\nI'm your devoted shave for ever and ever. Every day<br />\nFeature Editor<br />\nEdgar Kemler<br />\nlilac the shop and cologne up, and then hurry to our<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nlittle hone with the honeysuckles all around it. We'll<br />\nColumnists<br />\nrazor little one to be a great man, and shear in his<br />\nBUSINESS DEPARTMENT<br />\ngreatness. We'll facial our troubles with a song in our<br />\nBusiness Manager<br />\nhearts, and this is no idle talc. I Jeris the very thought<br />\nDavid Levy<br />\nAdvertising Manager<br />\nof you. While honeymooning we will stop only at nice<br />\nJulian Cohen<br />\nOffice Manager<br />\nhot-towels.<br />\nRobert Watkins<br />\nCirculation Manager<br />\nWith lotions of love,<br />\nRobert Levi<br />\n(apologies to Winchell)<br />\nCopy and Filing Manager<br />\nStanley Prager<br />\nJohn Baldhead.<br />\nBUSINESS STAFF<br />\nN. Soifer, A. Delevett, W. Kempton, H. Linkoff,<br />\nG. Willen, W. Erlanger.<br />\n<br />\nA<br />\n<br />\nII. NO SPIES<br />\nEarly in June I sailed from New<br />\nYork City. I then slept five days of<br />\nexotic dreams before the first sight<br />\nof land, which happened to be a little<br />\nrock off the coast of Porto Rica—<br />\nonce mistaken for a full-rigged mano-war and fired upon.<br />\nFor three<br />\nmore days we passed isle after isle<br />\n—but none quite the right one. Each<br />\nwas terrible at sea level with wrinkles of rock. Each island town was<br />\na colony of red-brick mushrooms as<br />\nagainst the thick yellow-green foliage of the hills. Each isle was set<br />\nin the Caribbean like a hanging garden—between sky and sea—between<br />\nthe upper heavens above for the Pure<br />\nSpirits and the richer purple-streaked<br />\nHell below of the vile water of Pluto. Noble—but not yet!<br />\n<br />\nA week already. Behind were the<br />\nLittle paradise drops—the islands: St.<br />\nThomas, St. Kitts, Antigua, Guadaloupe—none, the Bali I was searching for. At last as we headed toward<br />\nFort de France, capital of French<br />\nMartinique, along its coast, I saw a<br />\nstrand of beach—of listless palms<br />\nand primitive huts in the foreground,<br />\nand a possible jungle in the rear. Immediately I knew that the great local<br />\nBali could not be far. Here, certainSPECIAL QUAD QUIP NEWS DISPATCH:<br />\nly, must be romance, languid beauty,<br />\nOctober 3, 1935, QQP—Nitwiaal engages in fierce<br />\nthe Land of Escape!<br />\ncombat with the troops of His Royal Shyness, the King<br />\nIn company with an aristocratic,<br />\nof Kings, the Invincible, the etc., etc., etc., the Zoo of<br />\nbut<br />\nwell-informed Californian, Dr.<br />\nJudah, according to latest dispatches. It is believed<br />\nFortescue,<br />\nI disembarked. I went to<br />\nthat the quarrel broke out six months ago, when one<br />\nthe government building three blocks<br />\nof the Witlitalian soldiers went a hunting. Spying a<br />\nbrightly colored bird soaring on high, he aimed his from the wharf to seek entrance.<br />\nNow it seems that in my enthutrusty musket and fired. The sound echoed and resiasm to investigate down here, I had<br />\nechoed throughout the mountain of I'llbeseeinya. The<br />\noverlooked certain concessions that<br />\nking of I'llbeseeinya Holey Salami, imagining the war<br />\nyou have to make to imperial egos.<br />\nforces,<br />\ntwo<br />\nentire<br />\nordered<br />\nhis<br />\nimmediately<br />\nhand,<br />\non<br />\nwas'<br />\nhad brought no passport, no visa,<br />\ncamels, one airplane propeller, and a one-legged soldier<br />\nno<br />\nnothing. I had no means of into the front. Since I'llbeseeinya is a backwards counternational recognition — and the<br />\ntry, the soldier had to go to the rear to get to the front.<br />\nFrench officials were supposed to be<br />\nMeanwhile, the Nitwitalians realized that Holey Salami<br />\nunusually strict. I guess that all this<br />\nMusleinoni<br />\nleader,<br />\nforces,<br />\ntheir<br />\nand<br />\nwas mobilizing his<br />\nred-tape must go back to pirate days<br />\ndid likewise. Thus it was a war between Salami and<br />\n—when a stranger could overnight<br />\nMuscleinoni. The lotter thought Salami was a lot of<br />\nbetray and ravage any of these ports.<br />\nbolony, and Salami thought that Muscleinoni was a<br />\nAs my friend, Fortescue, had prompt(censored) kind of a man. At the latest report before<br />\nly disappeared—I figured that I<br />\nbusiness),<br />\ngoing to press (no, we're not in the tailor<br />\nmight reveal myself to the officials<br />\n,the war was still being carried on verbally. That peacetor what I was, which was obviously<br />\nloving body, the League, has suggested a game of tidno pirate, spy, nor international<br />\ndley winks to settle the argument.<br />\nvagabond. Surely they would listen<br />\nto reason.<br />\nA spinster is a bachelor's wife.<br />\nThere were troubles to all this,<br />\nThat new monument to Johns Hopkins, located on however. It seems that the official<br />\nCharles and Thirty-Fourth Streets, is a beautiful piece means of communication here is<br />\nof work. One is bound to wonder why Johns is facing French. But through the years, the<br />\nEast Baltimore Street rather than his own campus— great masses of black natives have<br />\nor maybe it's because they figured it's bad enough he converted it into a patois—a sort of<br />\nbaby-talk jargon based on the origionly hears what's going on, and not having to see.<br />\nYou've probably heard of the Freshman who wanted nal without grammar, rule or order.<br />\nFor example, for the word more, they<br />\nto be-come a street car conductor so he could kick the<br />\nhave corrupted the Parisian plus<br />\ngong around.<br />\ninto the Martiniquan peele. For he,<br />\nthey have changed il into H. For I<br />\nwere forced to halt their pursuit of education love you, they do not say je raime<br />\nlike the French; they say moi ea<br />\nby the Nazis.<br />\nby the Nazis. One of these students is now a aimer 0u—literally, me am lovin' you.<br />\nguest of the Hopkins chapter of Phi Sigma In other words, the street babble of<br />\nMartinique is known as Patois Creole<br />\nDelta.<br />\n—the patois of the native. It is, in<br />\nHere we have a fraternity doing some- all truth, the Yiddish of the<br />\nWest<br />\nthing patently worthwhile.<br />\nIndies!<br />\n<br />\nAlthough the term \"freshman\" is applied<br />\nin their first year of residence at a<br />\nmen<br />\nto<br />\nuniversity, there are many men in their third<br />\nand fourth years who are, nevertheless, freshmen. To determine how this statement can<br />\nbe true, we must first interpret the meaning<br />\nof the word \"freshman.\"<br />\nA reputable dictionary describes a \"freshman\" as \"a college student in the first year of<br />\nthe course.\" According to this definition, the<br />\nonly determining factor is the time element.<br />\nBut after having been in college for two years<br />\nand having closely observed many students<br />\nduring that period we venture to disagree<br />\nwith accepted definitions of \"freshman.\"<br />\nBreaking the word into its component<br />\nparts we get, fresh man, which is about the<br />\nsimplest and best definition it is possible to<br />\nmake. Thus, we see that a freshman is a man<br />\nwho is new to the ways and ideas of the University, and is trying to become acclimated to<br />\nthem.<br />\nHow can a freshman become acclimated?<br />\nThis is a difficult question to answer because<br />\nits solution has to deal with mental rather<br />\nthan physical factors. But the closest we can<br />\ncome to it is to say that a man has not become<br />\nacclimated to the University until he has acquired the Hopkins Spirit. This inevitably<br />\nleads to the query, \"What is the Hopkins<br />\nSpirit'?\" And here we run into an obstacle<br />\nwhich we can't hurdle.<br />\nThe Hopkins Spirit is something intangible. It is like some powerful force, itself<br />\nAt the risk of shaking somebody's convicunseen, but evident because of its external ef- tions, may we suggest that there may be other<br />\nfects. We can point out several of these ex- laudable phases to fraternity life? It is an<br />\nternal manifestations but we cannot hope to interesting conjecture.<br />\ninstill the spirit which motivates them. That<br />\nis something which has to come of its own<br />\nRah-Rah<br />\naccord after a man has been exposed to the<br />\nIt is a fearful thing to grow up—to lose<br />\ninfluences and atmosphere of the University.<br />\nThis is almost like a religious experience and naturalness.<br />\nAnnually, each freshman class is told that<br />\ncan come to a person in the midst of an exciting football game or while he is just look- the freshmen are no longer high school boys,<br />\ning over the campus from some advantageous but college men. Apparently this admonition connotes cynical apathy.<br />\nspot, and reminiscing.<br />\nSpecifically, we refer to the lackluster lasSo even though a man were to attend the<br />\nsitude<br />\nof what has humorously been termed<br />\nUniversity for the rest of his life, without the<br />\nHopkins<br />\nthe<br />\nrooting section.<br />\nHopkins Spirit, he would still be a freshNow<br />\nwe<br />\nare<br />\nthe first to rejoice that our<br />\nman.<br />\nBluejay is not a cinematic rah-rah bird, but<br />\nwe do lament the lack of cooperation of the<br />\nThe Other Side<br />\nstudent body \"in building up and fostering a<br />\nSkepticism has been intimated in the past vital team spirit,\" as Head Coach George<br />\nfew years concerning the value of fraternities Darley phrased it.<br />\non a campus—on any campus,in general—on<br />\nOne way to help in this matter is for those<br />\nthe Hopkins grazing ground, in particular. gripers who themselves fall short of the courIt has been suggested that frat houses age to try to play football for Hopkins to<br />\nwere merely places to hang out, that they keep all unkind remarks anent the merits of<br />\nwere merely a means of providing rent for the eleven to themselves.<br />\nimpoverished landlords and irritation for senA second way is more constructive<br />\nsitive neighbors.<br />\nthough no more effective, for it is the perniciThe Greek brethren themselves have been ous whispering of the envious that underlabeled snobs, bums, and incorrigibles.<br />\nmines spirit. This additional method is for<br />\nThat there is another side to fraternity the regretably compulsory rooting section to<br />\nlife may be a disappointing surprise to some. evince some semblance of organized enthusiThe case of 'William Bernard Stern is a case asm.<br />\nin point.<br />\nIt lets the outside world see that the HopPhi Sigma Delta, with chapters in twen- kins man can become enthusiastic, and the<br />\nty colleges and universities from the New outside world finds some inherent good in<br />\nEngland States to Texas and from the At- a man who can become enthusiastic about<br />\nlantic coast to the Rocky Mountains, offered<br />\nsgteomhniktem mm mmbb bb bmbbbbbb<br />\nto play host to students in Germany who something.<br />\n<br />\nSo much I had gleaned from the<br />\nisles en route. But I was undaunted.<br />\nI stood firm in a little room in the<br />\nwhite, cold gouvernment.<br />\nLittle<br />\nknots of of native police in brown<br />\nuniforms hovered in the corners. In<br />\nfront of me was a large desk at<br />\nwhose wings sat two dusky little<br />\nsecretaries—so similar as to be twins.<br />\nI marveled at their symmetry, until<br />\nI realized that I was facing a stout,<br />\nfierce bluster of a man—surely the<br />\ngovernor—jutting out dangerously<br />\nfrom between his menials.<br />\n\"Bonjour, monsieur,\" I started,<br />\nrealizing that this was the beginning<br />\nof a long hard, linguistic journey.<br />\n\"Bonjour,\" he blustered back.<br />\n\"Je sis American. Pas de brigand.<br />\nNo pirate. Je desire rester ici for<br />\nabout a month. I want to study this<br />\nLand of Escape—this tropical paradise .. . \" It went all very well until<br />\nI came to explain that I had no passport, no visa, nothing. I didn't remember that passport was the same<br />\nin French as in English. I began to<br />\nthink of all the substitutes for the<br />\nword passport that could ever be possibly invented. International ticket,<br />\nnative notice, national note—avis de<br />\ncommerce, billet de pays, etc.—all<br />\nsorts of queer phrases which must<br />\nhave been truly astonishing to the<br />\nunimaginative automat in front of<br />\nme.<br />\n\"Sacre Bleu!\" said the automat,<br />\nastonished. He had understood nothing.<br />\nI now realized that I was in a<br />\ntough spot. The blood rushed to my<br />\ncheeks. Even had I communicated<br />\nthe fact that I had no passport, that<br />\nI was not a spy, and that I was<br />\nharmless, they might not let me in.<br />\n<br />\nBy EDGAR KEMLER<br />\nI lost faith in their reason. Perhaps, really hadn't, for the previous evethen, I could appeal to their emo- ning I had let him read the foregoing<br />\ntions. I would entertain them. In- parts of this series on the American<br />\nstead of talking French, I'd talk Pa- Bali. He had felt so nauseated after<br />\ntois Creole to them. It would create that that I had given him up for<br />\nlost. An author should never reveal<br />\na bond of sympathy between us.<br />\nSlowly, but distinctly, I now cooed, himself to his friends; it's the surest<br />\n\"Moi ca aimer ou. Me am lovin oo.\" way of losing them.<br />\nIt was, to tell the truth, all I knew HOPKINS—THREE<br />\n\"Congratulations, Kemler, you are<br />\nof the language. And though inappropriate, it came as an emotional saved,\" he said. \"I have told them<br />\nlaxative to my startled audience. the truth. You are perfectly harmThe knots of chocolate soldiers roared less.\"<br />\nHe was like a deus ex machina—<br />\nas though the bowels of the Earth<br />\nwere moving in accord. Their sabers like a classical god solving my superrattled frivolously. The two secre- human difficulty in his divine emertaries stopped their typing—probably gence. My regiment dissolved away.<br />\na double record of my speech— I was free.<br />\nWhen Raison and I had returned to<br />\nblushed, and wept tears of relief.<br />\nLove and the emotions are a univer- the governor's room, Raison pointed<br />\nsal solvent, I thought—for all but to my boots which I always wear in<br />\nthe governor. He was not to be dis- the tropics for fear of snakes. \"Pour<br />\nles serpants,\" he told the governor.<br />\nsolved!<br />\nHis look quelled the uprising. He \"See how naive he is.\" The staff of<br />\nwhispered something in turn to each officials roared at my embarrassof his menials. They next whispered ment with perfect freedom. I had<br />\nsomething<br />\nto the corresponding previously roared at them with the<br />\nguards at hand, who disappeared threat of life imprisonment. Such is<br />\ninto an inner room. Soon they re- the way of the world!<br />\n(Continued In Next Issue)<br />\nturned again with a short, serious<br />\nlittle fellow with a deep scar on his<br />\nface.<br />\nInter-Frat Freddie's<br />\nHe addressed me, \"I speak Engleesh. You insult zee gouvernment of<br />\nMartinique. Where eez your passport, eh brigand?\"<br />\nWell, the rushng season of 1935<br />\nI was sure now that it would be<br />\ninfinitely safer if they didn't under- is now well under way with the S.<br />\nstand me. This fellow would return P. E.'s (Sig Ep's) spreading rumors<br />\nme to New York. My demands were around that they have just pledged<br />\nso simple, yet all this international Haile Selassie. Also the A. T. 0.'s<br />\ngravity—it was so absurd. I would are all busy down in the cellar of<br />\nnot steal the island. Why should I? their house around on Calvert Street,<br />\nI had it! If they couldn't under- building a brand new recruiting stastand my efforts at reason in my tion which ,they will probably set up<br />\nimaginative French, then I couldn't right out in front of Levering Hall.<br />\nWe hear that, as a last resort, the<br />\nunderstand their in English.<br />\n\"You understand me good, yes, Kappa Sigs are inviting Harry (Governor) Nice to their open house (as<br />\nno?\" he asked.<br />\nif he'll do any good).<br />\n\"No, sir, notatall.\"<br />\nWhat with Lou Reuling swilling<br />\n\"You not understand? You not<br />\nbeer in Heidelberg and Carson FraiEnglish?\"<br />\nley gone from the campus the D. U.'s<br />\n\"No sir, I'm not. I'm American.<br />\nseem<br />\nplenty worried about being able<br />\nAnd what is more I don't talk English. I don't talk American, even. to roll the Phi Gams out of any<br />\nI'm from Ballimer (Baltimore). I major offices this year.<br />\nSpeaking of the Phi Gams it seems<br />\nspeak Ballimer patois—nothing more,<br />\nthat brother John \"Tunnel Mouth\"<br />\nnothing less!\"<br />\nGhingher is trying to achieve fame<br />\n\"Mon dieu.\"<br />\n\"Swearing does you no good. If as the greatest \"rusher\" of all time.<br />\nyou wan to communicate, you got to Freshmen (who can't run faster than<br />\nlearn to speak Ballimer too. Slur Johnny) have developed the habit of<br />\nyour syllables. Talk fast. Jumble sitting down and putting handkeryour mouth. therwise, I wone under- chiefs over their faces whenever he<br />\n. appears on the scene.<br />\nstan a<br />\nword—notaword!\"<br />\nFrater Delevett of the Phi Psi's,<br />\n\"Patois, patois. In Baltimore, you<br />\nseems<br />\nto think that there is some<br />\nhave baby talk American like Patois Creole is baby to zee French? strange fascination about his big,<br />\nblack derby hat which will draw<br />\nImpossible!\"<br />\nfreshmen<br />\nto him; else why does he<br />\n\"That's the general idea.<br />\nAn I<br />\ncould teach you Philly patois, Vir- wear the fool thing? Maybe to shade<br />\nginia patois, Middle West patois, his face. Seems he's \"rushing\" the<br />\nMaine patois—all of them. It would season as well as the freshmen.<br />\nThe Tau Alpha Phi's are still oftake years—but it is well worth it.<br />\nfering<br />\nsoda fountain jobs and memIf you gentlemen wan to learn, I<br />\ncould easily arrange it at 15 francs bership into Tau Beta Pi to any<br />\nfreshman engineers who might sign<br />\nan hour . . .\"<br />\nup with them.<br />\n\"Fifteen francs, sacre mere,\" he<br />\nWill someone please drop good ol'<br />\nchoked.<br />\nThe linguist repeated my proposi- Inter-frat Freddie a penny postal and<br />\ntion to the governor. There was a tell him whether the Delta Phi's still<br />\nhave a chapter at Hopkins or not.<br />\nmoment of reflective silence.<br />\nHis<br />\nWe wonder how Duce, Tinley and<br />\nExcellency slowly, but surely was<br />\nsensing the fact that he was being Henry will like being chained down<br />\nswindled. A grand sweep of his the cellar of the Kappa Alpha house<br />\nhand! In an instant, I was seized by all during \"rushing\" season.<br />\nthe entire regiment of native guards.<br />\nMy my, my! We almost forgot the<br />\nWell, maybe we<br />\nI was accompanied across an open good ol' Beta's.<br />\nought to, anyway.<br />\ncourt lined with royal palms.<br />\nThen<br />\ninto a long corridor, down a long<br />\nset<br />\nA. C. P. NEWS<br />\nof stone steps. An occasional<br />\nbarred<br />\nThe Associated Collegiate Press<br />\nwindow opened out into the tropical<br />\nwill hold its convention in Chicago,<br />\nsun. It became darker., I<br />\ngulped.<br />\nOctober 17-19.<br />\nCells, large blood-shot eyes and<br />\nthe<br />\n* * *<br />\nbloody swollen lips of lepers<br />\nopened<br />\nAmong the many distinguished perout at me. A key clanked.<br />\nsons who will be present are: Leland<br />\nAll the while, I screamed and<br />\nStowe, Paris correspondent of the<br />\nraged. \"You officials, you humorless<br />\nNew York Herald-Tribune and winautocrats. Children playing a mockserious game against imaginary spies ner of the Pulitzer Prize for the best<br />\nexample of foreign correspondent in<br />\nand pirates! What right have you<br />\nto 1930; he will<br />\nspeak on \"The European<br />\nseize me, an American citizen?<br />\nMe, vs. the American<br />\nPress.\"<br />\nCarroll<br />\nconcerned only witih the harmless<br />\nBinder,<br />\nforeign<br />\nexpert<br />\nof the Chicago<br />\njoy of living in the tropics.<br />\nNeither<br />\nreason nor emotion sways you—you Daily News, who has served his<br />\npaper in Rome, Moscow, London, and<br />\nofficials who live by ancient formuLatin<br />\nAmerica, and has just returned<br />\nlas and illogical orders.<br />\nTo think<br />\nfrom an investigative visit to Japan,<br />\nthat I'd have to find you here as<br />\nthe<br />\nBlack Dogs who guard the gates of China, Manchukuo, and Korea. Mr.<br />\nBinder will speak on \"News of the<br />\na splendid paradise.<br />\nThere are<br />\nWorld.\" Harry B. Rutledge, managenough of your breed at home. The<br />\ning<br />\ndirector, National Editorial AsTemperate one is full of you. But<br />\nsociation; Dr. Ralph D. Casey, chairefficiency and<br />\ncollectivism<br />\neven man,<br />\nDepartment of Journalism,<br />\nhere? Good God!\"<br />\nUniversity of Minnesota; Curtis D.<br />\nIt was then in the midst of my<br />\nMacDougall, editor, Evanston News<br />\nraving that I felt a firm hand on<br />\nIndex, and lecturer in journalism at<br />\nmy shoulder. I turned and looked<br />\nNorthwestern; Kenneth E. Olson,<br />\ndirectly into a dark, familiar face.<br />\nnewly appointed director of the<br />\nIt was Raison—the man whom I had<br />\nschool of journalism at Rutgers Unimet on the boat, who was getting off<br />\nversity and formerly at Minnesota.<br />\nat Martinique, and whom I had comGerhard Becker and Fred Noes,<br />\npletely forgotten.<br />\nmanager and editor, respectively of<br />\n\"You, Raison. I had never expect- the Collegiate Digest, will also aped to see you again,\" I mumbled. I pear on the program.<br />\n<br />\nFilth<br />\n<br />\nT(<br />\n<br />\n1313;<br />\nth<br />\nby<br />\nha<br />\n<br />\nME<br />\n<br />\nth(<br />\nth<br />\n<br />\nth<br />\n<br />\nOpi<br />\n<br />\n111<br />\n<br />\nno<br />\nau<br />\nre<br />\n<br />\ncic<br />\npr<br />\nth<br />\nel(<br />\n<br />\n1111<br />\n<br />\nmi<br />\n<br />\nth<br />\n<br />\nth<br />\n<br />\nCO<br />\n<br />\ngi•<br />\nIn<br />\n<br />\nin<br />\nPc<br />\nin;<br />\n<br />\nsP<br />\nth<br />\nal;<br />\nth<br />\nri(<br />\nul<br />\n<br />\nto<br />\nhE<br />\n<br />\nSc<br />\n<br />\na<br />\n<br />\nti<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br />\n<br />\n3<br />\n<br />\n.<br />\n<br />\nHand Ball Enters Frat Football<br />\nDarley Satisfied With Show<br />\nStarts Today<br />\nSecond Season<br />\nOf Blue Jay Gridiron Squad<br />\nTeam Returns In- 4 Divisions To Be Formed; 2<br />\nAfter Two Weeks Scrimmage Regular<br />\nRounds Scheduled; Playtact; Plan Large Schedule;<br />\nMeeting On Friday<br />\nTeam Has Learned Almost<br />\nAll Plays To Be Used In<br />\nOpener With Shoremen<br />\n<br />\n_ By KENNETH ZIERLER_<br />\n<br />\nNewcomers Promise<br />\n<br />\nShould All Sports<br />\nGet A Major H?<br />\n<br />\nJay Walks<br />\n<br />\n1<br />\n<br />\nThe question has been raised as to<br />\nwhat should constitute a major sport.<br />\nShould all sports be on an equal footing or should some be singled- out as<br />\ndeserving greater recognition ?Both sides of the question have<br />\npoints<br />\nto back them up. I might say<br />\nBy BERNARD D. PINCK<br />\nthat the discussion was started by<br />\nWith two weeks of scrimmage<br />\nsome members of a minor sport who<br />\npractice completed, Coach George thought they should get a major<br />\nDarley expresses satisfaction with letter.<br />\n<br />\nWard, Day, Schmidt, Popow<br />\nSupport Returning Men;<br />\nOtts Phillips Back Again<br />\n<br />\nthe progress which has been made<br />\nby the 1935 edition of Blue Jay football teams. With a fortnight still re-<br />\n<br />\n0-0<br />\n<br />\nTime Spent<br />\nIs Time Spent<br />\n<br />\nmaining before the initial dispute of<br />\nIn favor of giving the same award<br />\nthe season with Washington College foreall sports is the reas,oning that<br />\nthe grid men have learned almost all as much time is spent in practicing<br />\nfor one sport as for 'another. Time<br />\nthe plays which they will use in the<br />\nis time, whether it is for football or<br />\nOpener.<br />\nfor cross-country, and men who take<br />\nThe sights which can be seen at two hours a day off for practicing<br />\nHomewood Field almost any after- some sport deserve equal recognition,<br />\nnoon—punted balls soaring in the regardless of any discrimination in<br />\nair, Coach Eddie Lotz barking di- the gate value of the sport.<br />\nTo refute this we can draw a parrections at his aspirant linesmen, viallel. Let's say we have two medical<br />\ncious tacklers mowing down the<br />\nstudents; one going to Hopkins and<br />\npractice dummy—all give testimony one to a college of less renown. They<br />\nthat the development of a formidable both spend about the same time at<br />\neleven is well on its way. The funda- their work and they both graduate at<br />\nmentals of good tackling and block- the head of their respective classes.<br />\ning are being strongly emphasized<br />\nThe Hopkins M.D. will find himself<br />\nthis year. They are, according<br />\nto in a better position to secure an inDarley, the \"basis of football\", and<br />\nterneship than the other man. Bethus far the results have been encause Hopkins has a bigger name.<br />\ncouraging.<br />\n0-0<br />\nWard Promising<br />\nMany of the new candidates have<br />\ngiven very promising performances.<br />\nIn particular, Norbert Schmidt and<br />\nDay indicate that they are varsity<br />\nmaterial. Bob Ward, a freshman from<br />\nPoly, will no doubt be in the starting line-up, should he maintain the<br />\nsplendid showing he has made up to<br />\nthe present. An able punter, Ward<br />\nalso shows some ability in passing<br />\nthe pigskin. He is a capable ball-carrier, running well and having the faculty of following his interference.<br />\nPopow, another newcomer, appears<br />\nto be a potential lineman, although<br />\nhe has not, at yet, participated in<br />\nscrimmage because of injury.<br />\n<br />\nCompetition<br />\nAs The Standard<br />\n<br />\nThe Johns Hopkins handball team<br />\nis preparing for its second year of<br />\nintercollegiate activity.<br />\nWith every member of last year's<br />\nvarsity team reporting, the future<br />\nseems bright.<br />\nManager Dick Pasternak has contacted fifteen colleges and has prepared an intensive program.<br />\nAll candidates for the team are<br />\nurged to report to the gym on Friday at 4 o'clock. All those interested<br />\nin handball please communicate with<br />\nDick Pasternak, Postoffice box 781.<br />\nSince a system is being arranged<br />\nwhereby the gloves and handballs<br />\nwill be available at all times only,<br />\nhowever, to those who are interested<br />\nenough in the game to report at once.<br />\nSuccessful Season Foreseen<br />\nCo-captains Krell and Hernandez<br />\nhope to better last year's records of<br />\n4 wins and 1 loss against college<br />\ncompetition. Last year's season began with a victory over Western<br />\nMaryland on the Hopkins courts, but<br />\nwas followed by a loss in a return<br />\nmatch on Western Maryland's fourwall courts. This was followed by<br />\ntwo victories over Virginia and was<br />\nclimaxed by swamping our traditional rivals, St. John's.<br />\nAll the members of last year's<br />\nsquad have improved their game considerably through intensive practice<br />\nduring the summer.<br />\nThe members of the squad are Joe<br />\nKrell, Joaquin Hernandez, Ted Wiehe,<br />\nDick Pasternak, Red Glantz, M. Kramer, Dick Byer, Rosen, and N. Finkelstein.<br />\n<br />\nShuttlecock To Fly Again<br />\nThe Johns Hopkins undergraduate<br />\nbadminton team will start its schedule in the latter part of October at<br />\nMontebello Junior High School. The<br />\nHopkins gymnasium is no longer<br />\navailable because of future basketball games to be held there.<br />\nHowever, the team, bolstered up<br />\nby new blood from the incoming<br />\nfreshman class, expects to repeat last<br />\nyear's excellent season during which<br />\nthe team won four out of six matches,<br />\nthus placing well up among the leaders of the Baltimore Badminton<br />\nLeague.<br />\n<br />\nOffs To End Season<br />\nThe first round of inter-frat touch<br />\nfootball starts today with Phi Kappa<br />\nPsi vs. Tau Alpha Phi. Last year's<br />\ntouch football inovation was a great<br />\nsuccess, and it is expected that this<br />\nyear there will be even more enthusiasm and spirit shown in the fraternity competition.<br />\nThe fraternities are divided into<br />\nfour divisions, the winner of each to<br />\nmeet in semi-finals and utlimately<br />\nfinals to determine the champions.<br />\nRegular Weekly Competition<br />\nEach fraternity is to play at least<br />\none game a week, all postponed<br />\ngames played off on Monday afternoons and on Tuesday and Wednesday of the week beginning Monday,<br />\nOctober 18.<br />\nPlayoffs for the championship will<br />\ntake place on November 21, 22, and<br />\n26. The winners will be awarded a<br />\nbronze plaque.<br />\nSchedule For This Week<br />\nTuesday, Oct. 8—Phi Kappa Psi<br />\nvs. Tau Alpha Phi, Field No. 1; Kappa Sigma vs. Sigma Phi Epsilon,<br />\nField No. 2.<br />\nWednesday, Oc. 9—Delta Upsilon<br />\nvs. Phi Gamma Delta, Field No. 1;<br />\nPi Lambda Phi vs. Tau Alpha Omega, Field No. 2.<br />\nThursday, Oct. 10—Kappa Alpha<br />\nvs. Delta Phi, Field No. 1; Beta Theta Pi vs. Omicron Kappa Omicron,<br />\nField No. 2.<br />\nFriday, Oct. 11—Phi Sigma Delta<br />\nvs. Alpha Delta, Field No. 1; Alpha<br />\nTau Omega vs. Phi Alpha, Field No.<br />\n2.<br />\n<br />\nBoard For Frat Competition<br />\n<br />\nSprints Through<br />\nSportland<br />\n<br />\nFall Lacrosse<br />\nToStartSoon<br />\n<br />\nTHE RISE of Joe Louis to preeminence in the boxing game has, in<br />\naddition to driving sports writers to<br />\nthe dictionary in frantic search for<br />\nnew alliterative titles, recalled to<br />\nmany the deeds of the great fighters<br />\nof his race. Louis is in the best tradition of a line that runs all the way<br />\ndown from Tom Devereaux, who wazAmerican champion in 1810, to tn,<br />\nelusive Kid Chocolate, last of th t<br />\ngreat dusky warriors. He has, it ap<br />\npears, all the skill of Peter Jackson<br />\nand Joe Gans, coupled with the power<br />\nof Sam Langford and Joe Wolcott.<br />\nHowever, Jack Johnson, now a portly<br />\nHarlem gin salesman and once holder of the crown universally conceded<br />\nto Louis, still keeps hi.§ place in the<br />\nsun. It is all of twenty years since<br />\nLil' Ahthah, still wearing the famous<br />\n\"golden smile\", eased his great length<br />\nto the canvas in response to a wild<br />\npush of Jess Willard's, and, with one<br />\nhuge arm upraised to keep off the<br />\nblazing Cuban sun, placidly heard<br />\nthe fatal count; yet the legend of his<br />\nprowess still runs through the dark<br />\nbelt. Johnson's timing is said to be<br />\nstill so remarkable that he can pick<br />\nflies out cif the air. Unlike Joe Louis,<br />\nhowever, he blazed no meteoric trail<br />\nto the top. In fact, during the early<br />\npart of his career, Johnson lost three<br />\nfights in one week.<br />\nALTHOUGH the obsequies may be<br />\na trifle premature, it appears at this<br />\nwriting as though the Chicago Cubs<br />\nare going to be the first of nineteen<br />\nhundred and thirty-five's \"destiny<br />\nriders\" to fail in achieving the ultimate triumphs. In a year which produced Sam Parks, Wilmer Allison,<br />\nand Jimmy Braddock, the men of<br />\nGrimm seem unable to overcome the<br />\ntwin bugaboos of bad luck and form.<br />\nA Cub victory would be a fitting climax to a topsy-turvy year, as well as<br />\nwarming the hearts of sports fans,<br />\nwho are romantics to the care. Whatever the result, the Chicagoans have<br />\nproved themselves worthy of the<br />\n\"miracle team\" title, both in point<br />\nof perforthance and courage. Galan<br />\nand Demaree, two of the year's prize<br />\nrookies, have been particular shining<br />\nlights.<br />\n<br />\nThere will be a meeting of representatives from all fraternities on<br />\nWednesday, October 9, at 8 p. m., in<br />\nLatrobe Hall.<br />\nThe object of the meeting is to<br />\nelect an Interfraternity Athletic<br />\nBoard having absolute control and<br />\nsupervision over all interfraternity<br />\nathletic competition. These activities<br />\nwill include touch football, box lacrosse, volleyball, basketball, and<br />\nsoftball.<br />\nPi Lambda Phi Fraternity is aso<br />\nSPEAKING of Joe Louis calls to<br />\nendeavoring to organize an interframind the name of that rather obscure<br />\nternity ping-pong league, which will<br />\nfigure, Max Baer. The Livermore Laralso come under the supervision oT<br />\nruper, on whose every thoughtless<br />\nBoard.<br />\nAthletic<br />\nInterfraternity<br />\nthe<br />\nword an adoring public once hung,<br />\nand who in his heyday inspired nearly as much metaphor as the Brown<br />\nBomber, now finds himself useful<br />\nChestertown<br />\nOct. 19—Washington at<br />\nonly as the subject of several highly<br />\nSwarthmore<br />\n26—Swarthmore<br />\nat<br />\nOct.<br />\nmoral studies of the inevitable toll of<br />\nNov. 2—Mt. St. Mary's at<br />\nHomewood the primrose path.<br />\n<br />\nLeagues To Be Formed For<br />\nInterclass Activity; Begin<br />\nPractice Next Week<br />\nDr. Wilson Shaffer, Director of<br />\nAthletics, has announced that fall lacrosse activity will begin in the near<br />\nfuture.<br />\nThe activity will be conducted in<br />\nsuch a manner that it will serve a<br />\ndouble purpose. Firstly, leagues will<br />\nbe formed to act as a means of interclass activity. Secondly, it will<br />\ngive Dr. Morrill and his assistants<br />\nan opportunity to survey the players<br />\nand obtain an accurate determination<br />\nof the type of players who will be<br />\navailable for spring drill.<br />\nCall For Men Next Week<br />\nThe official fall call for lacrossemen will not be made until October<br />\n14. However, contestants may practice at any time in the lower field.<br />\nThe sophomores will be divided into a number of teams participating in<br />\nthe sophomore league which will play<br />\none day a week. Several freshman<br />\nteams will also be organized into a<br />\nweekly league. Days on which no<br />\ngames are scheduled will be set aside<br />\nfor general practice.<br />\nWinners To Meet<br />\nThe winners of the freshman and<br />\nsophomore leagues will then be placed<br />\ntogether with<br />\n<br />\npicked teams composed of juniors and seniors to determine the class championship.<br />\nThere will be fivd men to a team<br />\nand the regular lacrosse rules will<br />\ngovern, except that there will be no<br />\ngoalie or offside ruling.<br />\nThe activity will be personally supervised by Dr. Morrill, assisted by<br />\nRoland Levy and Frank Dotterweich.<br />\n<br />\nPerhaps the biggest argument<br />\nagainst a single award system is the<br />\nmere presence of the more athletictised lethal quality of the bright lights<br />\nally inclined concentrated in a few<br />\nhas proved too often so much damp<br />\nsports rather than spread evenly over<br />\npowder. The training grinds of the<br />\nthe repertoire of activities.<br />\nold fighters are best characterized<br />\n. be a good<br />\nFor example, soccer may<br />\nby John L. Sullivan's \"shave and<br />\ngame requiring plenty of ability, but<br />\nhaircut\", and the desultory shadowit could never be a major sport here<br />\nboxing with which Abe Attell began<br />\nas long as the best players keep gohis preparations five minutes before<br />\ning out for football. It's as though<br />\nthe bell. And, even today, Maxie Rowe had two math sections; one for<br />\nsenbloom is still baffling younger<br />\nbrighter students and one for the less<br />\nand soberer opponents with twinkling<br />\nDoes the<br />\nmathematically inclined.<br />\nhands and dancing feet, which know<br />\nman who heads the slower section at<br />\nas well wax floor as the resined canthe end of the year rate on a par<br />\nBishop Blocking Back<br />\nThe wrestling team, headed by<br />\nvas. Greatest of all is Mickey Walkwith the man who heads the faster<br />\nBill Bishop, who was mauled about<br />\nCaptain Gelber, held their first pracsection?<br />\ner, who, after seventeen years of<br />\nin the line last year, has been contice last Thursday. Most of last year's<br />\nhighly improper living, is so far from<br />\nI don't think so, either.<br />\nverted into a back for the forthcomregulars have returned, including ex0-0<br />\nthe hour of reckoning as to boast of ,<br />\ning campaign. He is the outstanding<br />\nCaptain Croxton McDaniels.<br />\nCommendable as this crusading regaining the middleweight title \"at<br />\nHomewood<br />\nJohn's<br />\nat<br />\n16—St.<br />\nNov.<br />\nblocking -back on the squad. Charlie<br />\nPlaces are open in the light and<br />\nspirit is, however, the much-adver- any time now.\"—J. M. K.<br />\n23—Haverford at Homewood<br />\nKelly will undoubtedly handle the<br />\nheavyweight division and newcomers Nov.<br />\npassing duties this year. An experipractice evWhile we're on the subject of ma- are requested to attend<br />\nenced veteran, Kelly hurls the spherThursday.<br />\nery<br />\njor letters, we might insert a bit<br />\noid with more ability than any other<br />\nAs yet, the schedule is not final,<br />\nabout the gymboree.<br />\ncandidate. George Kahl will, in all<br />\nwill be announced in the near<br />\nLast year no provision was made but it<br />\nprobability, be the fourth member<br />\nfuture)<br />\nThe first meet will be held on<br />\npurin the athletic budget for the<br />\nof the backfield quartet. A promisAlumni Day when the gym will be,<br />\nThe<br />\nfor<br />\nawards.<br />\nsweaters<br />\nchase of<br />\ning punter, George is also a fair<br />\nopened officially.<br />\nreason was the general financial conpasser and an evasive runner.<br />\nin<br />\nis<br />\nflat<br />\nwhich<br />\ndition of the world,<br />\nlacrosse players.<br />\nTed Graziano and Bernie Vincenti, spite of Columbus' attempt to prove sweaterless<br />\nIt is hoped that by taking in<br />\nboth of whom saw action last year, the contrary.<br />\nenough money at the gymboree a<br />\nare back in the fold. Baum, a sophAs a result, it was decided to put sweater fund can be established. This<br />\nprogressing<br />\nto<br />\nDaromore, has been<br />\non a gala circus at the gym with fund is expected to grow with each<br />\nley's satisfaction and gives promise the basketball<br />\nteam playing a game gymboree until finally there will be<br />\nof being a versatile back. The men- and tumbling<br />\nand wrestling and box- enough quarters to order the sweattor also feels sure that he has a foot- ing exhibits also on the card. Adball player in Jack Kaufman. A fast mission was two bits—or as some ers ahead of time so that a man can<br />\nsoon as<br />\nman and a good runner, Kaufman say, twenty-five cents. The receipts actually get his sweater as<br />\nhe earns it instead of having to wait<br />\nhas the making of a splendid punter;<br />\nwere to be used to buy H sweaters. for the next solar eclipse as has been<br />\nhe has the dig and drive and it is<br />\n0-0<br />\nthe quaint custom in the past.<br />\nexpected that a little experience will<br />\nThis happy day has tentatively<br />\ngive him whatever finesse is needed.<br />\nbeen set at the day before we are all<br />\nHalbert, Mehling, Centers<br />\ndrafted to fight for Ethiopia, in which<br />\nThe first annual gymboree was not<br />\nThe center post appears to be<br />\ncase it would be better to award<br />\nBeing an unqualified success. It didn't take nightgowns.<br />\nclinched by Hersh Halbert.<br />\ngroomed as a reserve center is Bill in enough to buy all the sweaters for<br />\no—o<br />\nMehling, a converted end. A good the year, probably because it was artackler and blocker, he is not as yet ranged only a short time before it<br />\nquite proficient in passing the ball. was to take place. The rest of the<br />\nmoney came during June Week from<br />\nDon't get the idea that the quarFlanking the center will probably<br />\nTHOUSANDS of years ago, a skin-clad workman pounded away with<br />\nbe Tom Ellis and Otts Phillips hold- a benefit lacrosse game—benefit of ter you shell out for the gymboree<br />\na cobblestone on a slab of hard rock. In a few years, that slab might<br />\nwill be purely for charity. You will<br />\ning down the guard berths. Jim Hop- sweaterless lacrosse players.<br />\nbe passably square and smooth.<br />\naddition,<br />\nThis year the budget again slipped get your money's worth. In<br />\nkins, Bob McGuire, Crox McDaniels,<br />\ndown<br />\nbusy machines, supervised by trained workmen, pare off crisp,<br />\nsweater<br />\ndeep<br />\nproposition<br />\nso<br />\nwill<br />\nfeel<br />\nToday,<br />\nthe<br />\nthat<br />\nyou<br />\non<br />\nglow<br />\nup<br />\nthat<br />\nand John Royster are tackle possibilribbons<br />\nfrom whirling blocks of steel, as one would unwind riblook as though the mat- inside will be a glow of satisfaction,<br />\ncurling<br />\nbegins<br />\nto<br />\nit<br />\nities. Hopeful of varsity honors in<br />\na<br />\nspool,<br />\nshaping the metal to a thousand purposes — to an<br />\nmild<br />\nfrom<br />\na<br />\nbecome<br />\na<br />\nquenching<br />\nto<br />\nbon<br />\nabout<br />\nhabit.<br />\nunless<br />\nyou've<br />\nbeen<br />\nwere<br />\nthe end positions are Iry Leberfeld ter<br />\nwithin<br />\naccuracy<br />\na<br />\nfew<br />\nten-thousandths of an inch.<br />\napplication of<br />\nretaliating<br />\nby<br />\nmaking<br />\ninternal<br />\nan<br />\nShaffer<br />\nis<br />\nthirst<br />\nwith<br />\nDr.<br />\nDon Naylor, Pete Swindell, and Day.<br />\nthe gymboree a conditioned reflex. rubbing alcohol.<br />\nCARBOLOY—<br />\na<br />\ntool material developed by General Electric<br />\nmodern<br />\nSpirit Excellent<br />\nThe program for the second anIt is rumored by unreliable sources<br />\nresearch—has made possible this speed, this precision. It cuts materials<br />\nCoach Darley is particularly im- that he has already had tickets print- nual gymboree has not as yet been<br />\nhitherto unworkable — cuts faster and holds its edge longer than steel<br />\npressed with the active enthusiasm<br />\ntools—can be run at red heat without losing its temper.<br />\ned marked as far ahead as the four- mapped out, but it will, in all probdisplayed by his squad this year. teenth annual gymboree.<br />\nibility, include a basketball game<br />\nCARBOLOY is only one of the contributions made to improved indus\"The spiriU is excellent,\" he ex(well worth the price of admission)<br />\n0-0<br />\ntrial processes by G-E reseach—research that has saved the public from<br />\nclaimed. \"The men like the game and<br />\nboxing (well worth the price of adten to one hundred dollars for every dollar earned for General Electric.<br />\nlike to play it. They are interested in<br />\nmission), wrestling (well worth the<br />\n96-188FBI-2<br />\nlearning. In my twelve years of exprice of admission), and tumbling<br />\nperience at Hopkins they are one of<br />\nThat is to say, we may expect to (ell worth the price of admission).<br />\nthe finest squads I've seen.\"<br />\nIt is also well worth the price of<br />\nsee the second annual gymboree this<br />\nAt the present time the squad has winter. It's being plugged ahead of admission to come to see what it<br />\nmastered the fundamental plays. Be- time so that enough quarters will be looks like to see 799 other fellows<br />\nfor the Washington game variations taken in to do away with the possi- come to see what it looks like to see<br />\n•<br />\nwill have been added.<br />\nbility of a second annual benefit of 800 fellows in the Hopkins gym.<br />\n<br />\nGrunters Grovel In Gym<br />\n<br />\nFootball Schedule<br />\n<br />\nRemember<br />\nThe Gymboree?<br />\n<br />\nBudget Again<br />\nNeglects Sweaters<br />\n<br />\nWell Worth<br />\nPrice Of Admission<br />\n<br />\nProvide Awards<br />\nOn Schedule<br />\n<br />\n'Maki nom VD 24111<br />\n<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br />\n<br />\nMusical Club<br />\nMakesPlansFor<br />\nComing Year<br />\nOpportunities On Business<br />\nStaff Offered For All Students, Says Murphy<br />\n<br />\nGrad Students Will Hopkins To Choose<br />\nGraduate Student In Political<br />\nScience Relates Experiences Hold Dance Oct 18 Delegation Forl 2th t<br />\n<br />\nBrother Of Donor<br />\nOf Levering, Dies<br />\n<br />\nThe first graduate reception and<br />\n<br />\nJoshua Levering, twin brother<br />\nof Eugene Levering, who donated<br />\ngifts which made possible the<br />\nbuilding of Levering 1Hall, died<br />\nSaturday night after a month's<br />\nillness.<br />\nMr. Levering was well-known as<br />\nthe candidate for President of the<br />\nUnited States on the Prohibition<br />\nparty ticket. He was also onetime candidate for Governor of<br />\nMaryland and State Comptroller.<br />\nHe and his twin brother were<br />\nborn in 1845. Eugene Levering<br />\ndied August 2, 1928.<br />\n<br />\n(Continued from Page 1, Col. 5)<br />\n\"Here I have time to study as I<br />\nlike,\" he said, \"and it is always an<br />\nhonor for one to be able to say that<br />\none has studied at the Johns Hopkins<br />\nUniversity.\"<br />\n<br />\nwould freeze solid on the windowpanes. Out of curiosity he has had<br />\nhimself lowered into crevasses in glaciers. That corresponds to walking<br />\ninto a cage to find out whether or<br />\nnot the lion is carniverous.<br />\n<br />\nIncidentally, he practiced law for<br />\na year and a half in Germany as<br />\nwhat he described as a \"junior lawyer.\"<br />\nHe has traveled over most of Europe and almost half the United<br />\nStates. \"Something new has happened to me everywhere I went,\" he<br />\nsaid, but he insisted that none of the<br />\nincidents would be interesting; in<br />\nfact, he said that sorhe were \"embarassing and not fit to print,\" whin<br />\nmakes it certain that they are interesting.<br />\n<br />\nShot Mountain Rapids<br />\nDescending these mountains, Stern<br />\nhas ported a canoe until he reached<br />\nthe region of melting snow. Here he<br />\nhas shot swirling mountain rapids<br />\nWhile skiing he has seriously frozen the tips of all his fingers and has<br />\n\"broken many a ski but never a<br />\nbone.\"<br />\n<br />\nAn opportunity for all students<br />\nwhether they are musically inclined<br />\nor not, to attain positions on the<br />\nbusiness staff of the Johns Hopkins<br />\nMusical Club, was announced the<br />\nother day by John L. V. Murphy, Jr.,<br />\npresident of the organization.<br />\nHe has also done rock mountain<br />\nBy giving all students a chance to<br />\nclimbing. In fact, he was a guide for<br />\nparticipate in the organization's acone summer at the Oetztan.i. Mountivities Murphy hopes that the Musitain.<br />\ncal Club will take on a more incluHis well-built body is proof of his<br />\nsive character.<br />\nHe has been skiing and mountain activity, and though he has told me<br />\nThis, Murphy continued, will give<br />\nclimbing for the past eleven years.<br />\na whole host of incidents, he has refreshmen who are interested in muCamped for two weeks in the re- fused to let them be printed. The<br />\nsical appreciation a splendid opporgion of eternal snow in a cottage best thing to do is to see him at his<br />\ntunity to make connections with this Dr. W. F. Albright, W. W.<br />\n9,000 feet up on a mountain, Stern desk in the political sciences ,Pbrary<br />\ngreat campus organization.<br />\nAlso,<br />\nSpence Professor, Plans tells how the vapor from his breatli and ask him about them.<br />\nthat in order to compensate these<br />\nReturn<br />\nTo America in Feb.<br />\nboys, two junior and the one senior<br />\nbusiness managers will be taken on<br />\nProf. W. F. Albright, holder of the<br />\nall trips.<br />\nW.<br />\n. Spence professorship of Semitic<br />\nThe servies of Osmar P. Steinwald,<br />\na prominent professional musician Languages in the School of Higher<br />\nof this city, and also director of the Studies of the Johns Hopkins UniA reception dinner will be given<br />\nGlee Club and of the Blue Jay Or- versity, has resigned as director of Boycotts \"Red Salute\" As Protest by the Friendly Relations Society on<br />\nchestra last year, has been secured the American School of Oriental ReOctober 19. President Isaiah BowAgainst \"Vulgar Misleading Atfor this winter's seaSon. Positions search in Jerusalem, Palestine, and<br />\nman will probably attend.<br />\ntack Upon Peace Struggle\"<br />\nfor saxaphones on the Blue Jay Or- is scheduled to return to this counIf any students are interested in<br />\nchestra are still open.<br />\nRehearsals try late in January<br />\ndelegation of students represent- this organization, it is suggested<br />\nA<br />\nDuring the past two years Profesfor tenors in the Glee Club will take<br />\ning the Hopkins National Students that they see Daniel DeLima before<br />\nplace this Thursday at 7:30 p. m. sor Albright has divided his time bethe day of the reception. Whether<br />\ntween his duties at the University League and the American League<br />\nBasses on Mondays at 7:30 p. m.<br />\ninterested or not, foreign students<br />\nand at the American School in the Against War and Fascism protested<br />\nAddressing candidates for the<br />\nare urged to report to the \"Y\" secHoly Land. Upon his return he plans<br />\nthe showing of \"Red Salute\" at the retary's office as soon as possible.<br />\nGlee Club at the last meeting, Presito devote his time to the professordent Murphy explained that in view<br />\nCentury Theater this past Friday and<br />\nship at the Hopkins.<br />\nof the excessive turnout, a willing<br />\nNo excaations are being made by Saturday by distributing circulars Bowman To Address<br />\nand faithful man would be more deProfessor Albright this year.<br />\nA denouncing the cinema to theaterFriends of Library<br />\nsirable than just a good voice. He<br />\nlearned author, he is busy working goers.<br />\nalso asked those candidates for the<br />\nover reports concerning his finds durDr. Isaiah Bowman, President of<br />\nAfter futile attempts to prevent<br />\nGlee Club who could play a musical<br />\ning the recent years. His wife and<br />\nJohns Hopkins University, will<br />\nthe<br />\ninstrument or two not to be hesitant<br />\nthe showing of the cinema in the thefour children accompanied him to<br />\naddress the first meeting of the<br />\nand come out for either the Blue Jay<br />\nater by sending an open letter to the<br />\nPalestine this summer.<br />\nFriends of the Library. Dr. John C.<br />\nOrchestra, Banjo Club or the Hawaimanager requesting him to drop the French, librarian, announced that no<br />\nWas Delegate At Rome<br />\nian Troupe.<br />\nHe was official delegate of the picture from the theater's schedule, date had been set for the gathering,<br />\nThe Musical Club is one of the<br />\nUnited States government at the the N. S. L. and the A. L. W. F. but that it would take place early in<br />\noldest campus activities, established<br />\n19th International Congress of Orienin 1885 by the late President Wooddecided to appeal to the theater-goers November.<br />\ntalists, held at Rome, Italy, during<br />\nrow Wilson, Albert Shaw, editor of<br />\nChair- of Baltimore to boycott \"Red Salute.\"<br />\nthe week of Sept. 23-29.<br />\nthe Review of Reviews, Newton D.<br />\nThe following are excerpts from<br />\nman of the American delegation and<br />\nBaker, ex-Secretary of War, and a<br />\nrepresentative of the American Ori- one of the circulars:<br />\nWANTED<br />\nnumber of other renowned associates.<br />\nental Society, of which he was elected<br />\n\"Wherever it is being shown<br />\npresident in April, he was the sole<br />\nCounsellors With Followings For<br />\nthroughout the length and breadth of<br />\nFreshman Commission<br />\nAmerican present at the sessions.<br />\nExclusive Boys' Camp<br />\nOther members of the U. S. delega- America, the moving-picture, \"Red<br />\n<br />\nResigns Position In<br />\nAmerican SchoolOf<br />\nOriental Research<br />\n<br />\nN.S.L. Denounces<br />\nFilm Propaganda<br />\n<br />\nTo Be Selected Soon<br />\n<br />\nMembers of the Freshman Commission will be selected at an early<br />\ndate by the Hopkins \"Y\" Cabinet, it<br />\nwas learned today.<br />\nThe group is composed of twentyfive members. The selection of the<br />\nstudents is determined by contacts<br />\non the campus and at Freshman<br />\nCamp. High school records also are<br />\nconsidered.<br />\nEvery Tuesday evening the Commission meets, and on those Tuesdays on which the Supper Club is<br />\nheld, the meeting is combined with<br />\nthat of the Supper Club.<br />\nThe Commission, which is a campus activity, has achieved much<br />\npopularity among freshmen.<br />\n<br />\n4rchaeologist Refutes<br />\nArticle In Hearst Paper<br />\n(Continued from Page 1, Col. 1)<br />\nof Alexander the Great, because he<br />\nlost an eye while attacking the city.<br />\nAs a result of this, Philip utterly destroyed the town. The layout of the<br />\ncity, sanitary equipment, kitchen<br />\nutensils, etc., are gone into in great<br />\ndetail. The article is illustrated with<br />\npictures showing excavated Olynthian bathtubs, a kitchen vessel, a<br />\nterra-cotta figurine of Hermes, a terra-cotta vase in the form of a head,<br />\nand a painting by H. Schneider showing Greek women dancing in a temple<br />\nof Bacchus before the image of the<br />\ngod.<br />\n<br />\nJoin<br />\nThe<br />\nNEWS-LETTER<br />\nStaff<br />\n<br />\ntion believed conditions caused by<br />\nthe Italo-Ethiopian situation were<br />\ntoo serious, and did not attend.<br />\nProfessor Albright was called to<br />\nthe Johns Hopkins in 1929 to fill the<br />\nchair of Semitic Languages left vacant by the death of Dr. Paul Haupt,<br />\nwho held the position from 1883 till<br />\n1926. For the three years following his<br />\nappointment Professor Albright gave<br />\nhis time to his new duties, not continuing as acting head of the American School of Oriental Research.<br />\n<br />\nHopkins Library Staff<br />\nHandicapped By Illness<br />\n<br />\nFriendly Relations<br />\nGroup Will Meet<br />\n<br />\nLuther Norem, will be held Friday,<br />\nOctober 18, in Levering Hall.<br />\n<br />\nStuart Le Compte, soloist, and Dr.<br />\n<br />\n1<br />\n<br />\nof Music.<br />\n<br />\nA delegation from the Hopkins will<br />\nPresident Isaiah Bowman is ex- be chosen soon by a local<br />\ncommittee<br />\npected to speak. Following this proto represent the University in the H<br />\ngram there will be dancing to the<br />\nTwelfth Quadrennial Student Volunmusic of Ed Norwood's orchestra.<br />\nteer Convention, to be held December<br />\n28 to January 1, at Indianapolis.<br />\nROBINSON SPEAKS ON COINS Several thousand students are expected to attend from the United s<br />\nLast Thursday, October 3, Dr. States and Canada.<br />\nDavid M. Robinson, Johns Hopkins<br />\nThe speakers at the convention will<br />\nUniversity archaeologist, delivered include Dr. T. Z. Koo, Reinhold Nie- R<br />\nan address to the Baltimore Coin buhr, Toyohiki Kagawa, Henry P.<br />\nClub on the topic, \"Early Greek and Van Dusen, Robert E. Speer, John<br />\nRoman Coins.\"<br />\nR. Moot and others. Those wanting to<br />\nThe talk was illustrated by a show- attend should get in touch with meming of actual coins, many taken from bers of the Cabinet or Board of Manthe Olynthian excavation.<br />\nagers of the Hopkins Y. M. C. A.<br />\nbc<br />\npr<br />\nif•<br />\n0.••••••••••••••••••••••••••••••••••••••••••••••••••••••••••«••••••••••••••••?<br />\n<br />\nPEABODY<br />\nPHARMACY<br />\n<br />\nI<br />\nI CALVERT<br />\n<br />\nand 30TH STREETS<br />\nWe Sell Drugs and Give Service I<br />\n<br />\nAmerican schools and universities. It<br />\nis a planned and slanderous assault<br />\nalso upon the millions of other patriotic Americans in every walk of<br />\nlife who,share with the students the<br />\ndesire for peace and happiness and<br />\nthe refusal to see the genius and<br />\nyouth of our country again devoted<br />\nto the collective suicide of humanity.\"<br />\n\"We students believe that we have<br />\nshown you how to act. Boycott 'Red<br />\nSalute': protest its showing to the<br />\nmanager of every theater at which<br />\nit appears, write to the producers.<br />\nDefend and support the American<br />\nstudent struggle for peace!\"<br />\n<br />\nWILLIE HUGH<br />\nLAUNDRY<br />\nSpecial Price for Hopkins Men<br />\n2815 GREENMOUNT AVE.<br />\nCHesapeake 5474<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\n<br />\nYou get efficient service.<br />\n<br />\nEl<br />\n<br />\nHUTZLER 13K1F1-1EM E<br />\nEAT AT THE<br />\n<br />\nBOULEVARD<br />\nRESTAURANT<br />\n3226 GREENMOUNT AVE.<br />\n<br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and. 33RD STREETS<br />\nNext To Birely's<br />\na -.....<br />\n<br />\n,<br />\n•••,,ILW<br />\n,<br />\n.1r<br />\n,<br />\n...^..V,I,O.•./V<br />\n,<br />\n.1•VP<br />\n,<br />\n....,111<br />\n...OW,M.P<br />\n,<br />\n-.--.1... a...a•<br />\n<br />\n-<br />\n<br />\n..,1..../..•••vilP.....,,e1.,./,..1..../,..,......1<br />\n<br />\nNORTH INN<br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever_l<br />\n—.......-<br />\n<br />\nA COLLEGE PROFESSOR DISCOVERED<br />\nThat Often It Isn't a Student's Brain but his Pen<br />\nthat Buns Dry—causes Failure—in Classes and Exams!<br />\nSo he invented this sacless Vacumatic, and Parker engineered it to perfection—gave it<br />\n102% more Ink Capacity—made its Ink Level VISIBLE,so it suddenly can't go empty!<br />\n<br />\nCHARLIE DER1<br />\nFirst Class Laundry<br />\n3224 GREENMOUNT AVE.<br />\nQuality Hand Work at Our<br />\nLow Prices<br />\n-<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place<br />\nBaltimore<br />\n<br />\nhow pens that run<br />\nout of ink slow down classes, demoralize thinking, and bring marks<br />\nthat no student wants to write home<br />\nabout.<br />\nHis observations led to the birth of<br />\nthe revolutionary Parker Vacumatic.<br />\nThis miracle pen writes 12,000 words<br />\n<br />\nYour Nearest Dealer is<br />\n<br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br />\n<br />\nrarLer<br />\nMIM-d—rACUALLITIC:c14<br />\nGUARANTEED MECHANICALLY PERFECT<br />\n<br />\nJunior, $5<br />\nOver-Size, $10<br />\n<br />\nPencils, $2.50,<br />\n$3.50 and $5<br />\n<br />\nh;<br />\nr(<br />\n<br />\nIT<br />\n<br />\nLAfayette 4519<br />\n<br />\nES, a scientist on the faculty of<br />\nY<br />\nthe University of Wisconsin was<br />\namazed to find<br />\n<br />\nin<br />\nat<br />\ndl<br />\nas<br />\n\"c<br />\n<br />\nr<br />\n<br />\n•••••••••• ••••••••••••••••••••••• • NI •••••••••••••••••••••••01..11....• •<br />\n<br />\nLowell Thomas, nationally known<br />\nnews commentator, lecturer and author, will present one of the series<br />\nof University Lectures on December<br />\n10, and will speak on \"Some Important Issues Demanding Action Today.\"<br />\nThe series of lectures, sponsored<br />\nby the Johns Hopkins Y. M. C. A., is<br />\nbeing held at the First Methodist<br />\nEpiscopal Church, which is located<br />\nat St. Paul and Twenty-second Sts.<br />\n<br />\nA:<br />\n<br />\nPrices are reasonable.<br />\n<br />\nThree illnesses in the staff of the<br />\nlibrary are proving a handicap, Dr.<br />\nJohn C. French, librarian of the University, announced today. The absence of Miss Ethel Hubbard,' Miss<br />\nCatherine Dudley and Miss Frances<br />\nJordan, who is recuperating in the<br />\nmountains of North Carolina, is sore+<br />\nly felt. But all are recovering rapidNEW YORK<br />\n+<br />\nly and are expected to return in the +<br />\n:LOAN OFFICE:<br />\nnear future.<br />\n;<br />\nLOANS<br />\nAt the college reserve Mrs. Wil++<br />\nlem Wirtz is taking the place of<br />\n.<br />\n—<br />\n+<br />\nMiss Nancy Lanier, who is absent on<br />\n=<br />\nUnredeemed Microscopes<br />\n++<br />\ni<br />\nleave taking a course in the Library + Cameras, Binoculars, Musical +<br />\n+<br />\n+<br />\nSchool of Columbia University. Mrs. +<br />\nInstruments, Typewriters<br />\n+<br />\n4<br />\n+<br />\nWilthe<br />\nlate<br />\nWirtz is the widow of<br />\nlem Wirt, whose work gave him a i<br />\n+<br />\n+<br />\n+<br />\n118 N. LIBERTY STREET<br />\nhigh place in Baltimore art and music +<br />\n,<br />\n+<br />\n+<br />\ni<br />\nPLaza 3495<br />\ncircles.<br />\n+<br />\n+<br />\n<br />\nLowell Thomas To Speak<br />\n<br />\nta<br />\nse<br />\n<br />\nWhat you want is easy to find.<br />\n<br />\nCall Harold Speert<br />\n<br />\ngle for peace which is being conducted by the student body of ,our<br />\n<br />\nExpect Several Thousand<br />\nStudents From United<br />\nStates, Canada, To Attend<br />\n<br />\nPetran, of the Peabody Conservatory<br />\n<br />\nmisleading piece of militaristic propaganda is an attack upon the strug-<br />\n<br />\nThere<br />\n<br />\nwill be a musical program including<br />\n<br />\nSalute\" is meeting with widespreaZ<br />\nprotest and picketing. This vulgar<br />\n<br />\nStudent Convention -=<br />\n<br />\ndanc, under the chairmanship of<br />\n<br />\nfrom a single filling—shows when it's<br />\nGo and try writing two different<br />\nrunning low—tells when to refill!<br />\nways with its Reversible Point—solid<br />\nAny good store selling pens will Gold combined with precious Platshow you how the Parker Vacumatic inum—skilfully fashioned to write on<br />\neliminates 14 old-time parts, includ- both sides—slightly turned up at the<br />\ning the lever filler and rubber ink sac tip so it cannot scratch or drag, even<br />\nfound in sac-type pens.<br />\nunder pressure!<br />\nAnd due to this,it has<br />\nDo this and you won't<br />\nWRITES TWO WAYS<br />\ndouble room forink,withlet an old pen impede<br />\nout increase in size.<br />\nyour learning another<br />\nhifitt•<br />\nBut don't think that<br />\nday. The Parker Pen<br />\n-exAz<br />\n4,<br />\nsacless pens containing<br />\nCompany, Janesville,<br />\nsquirt-r<br />\n‘un pumps are like<br />\nWisconsin.<br />\nParker s patented VacuSend a Post Card for Free Botmatic. This new creation<br />\ntle of Parker Quink—the marcontains none of these.<br />\nvelous new quick-drying, penThat's why it's GUARAN-<br />\n<br />\nt<br />\n<br />\nTEED MECHANICALLY<br />\nPERFECT!<br />\n<br />\nati.,./.40nct<br />\neipsue<br />\n<br />\nWITHOUT ADJUSTMENT<br />\n<br />\ncleaning ink, and throw your<br />\nblotter away. Address Dept.<br />\n<br />\n712.<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nt4 iAlts 4113Pitilts Nztun-ilIrttrr<br /><br />\n\"AMERICAN BALI\" — PART II<br />\nBy EDGAR KEMLER<br />\nSee Page Two<br />\nPrice Five Cents<br /><br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, OCTOBER 8, 1935<br /><br />\nVol. XL—No. 3<br /><br />\nR.O.T.C. Names<br />\nRobinsonDenies Athletic Heads Italian Consul Graduate Student In Political<br />\nRelates Experiences<br />\nNew Officers For<br />\nStatements In At Assembly Gives300Books Science<br />\nBefore Coming To Hopkins Coming Year<br />\nTo University<br />\nHearst Article<br />\nBernard Stein, Graduate Student at Johns HopArchaeologist Denies That<br />\nOlythians Had S a c r ed<br />\nDuty To Enjoy Wine<br /><br />\nCaptains and managers of the<br />\nvarious sports at the Hopkins will<br />\nspeak at the assembly this Thursday in Latrobe 120. Dr. G. Wilson<br />\nShaffer, head of the Department<br />\nof Physical Training and Athletics, is also expected to address<br />\nthe meeting.<br /><br />\nIn charge of the assembly is the<br />\nA. A. Board, whose president, Bill<br />\nHazlett, will present the speakers.<br />\nIt is expected that Reuben Pasarew will talk on football, Pete<br />\nSwindell on lacrosse, George Margolis on basketball, Leonard Emmert on track, and Hazlett on<br />\nswimming, besides representatives<br />\nof several other sports.<br /><br />\nSpecial Detachment Of Po- William<br />\nkins, Tells Interviewer of School Days and of Thrilling<br />\nlice Guard Against StuTrips Taken Among the Mountains of Europe<br />\ndent Body Protest<br /><br />\nNo Demonstration<br /><br />\nAnLt.-Col. Hoisington<br />\nnounces New Organization At Remsen Assembly<br /><br />\nBy KENNETH ZIERLER<br /><br />\n45 Students Named<br /><br />\nAn all-around man and a very fine short by the German government.<br />\nDr. Bowman Accepts Gift one—from Alpine climbing to getting The idea was to award scholarships<br />\nwhat corresponds to our doctor of on the basis of past performances to<br />\nFor J. H. U.; Dr. Green- law degree at the age of twenty- those whose education was nearly New Drill Scheme Described<br />\nNo Such Temple Uncovered<br />\nthree.<br />\nThat is William Bernard completed so that they may soon find<br />\nAnd Plans For Coming<br />\nfield Lauds Collection<br />\nIn Olynthus; Only Girls<br />\nStern — short, dark, bespectacled their places in the professional life<br />\nYear Outlined<br />\nThree hundred volumes of Italian<br />\nyoung German from Wurzburg, Ba- of this country.<br />\nPainted On Vases<br />\nliterature were presented to the UniWas At Texas<br />\nvaria, now a graduate student in poAt a meeting held late yesterday<br />\nversity by Dr. Mario Carosi, Royal<br />\nDr. David Moore Robinson, head of<br />\nStern won a scholarship—one of<br />\nlitical science at the Hopkins.<br />\nin Remsen Hall, the Johns Hopkins<br />\nBaltimore.<br />\nat<br />\nItalian<br />\nConsul<br />\nthe department of art and archaeolHe is a serious young man at twen- few selected from many applicants— Unit of the Reserve Officers Training<br />\nWhen the books were delivered.<br />\nogy at the Johns Hopkins University,<br />\nty-five. His is an unassuming mild and elected to go to the. University Corp announced the officers for the<br />\nSunday, a special detachment of potoday disclaimed authority for some<br />\nmanner and his is a life that is full. of Texas, where he was a guest of coming year.<br />\nlice were assigned to prevent any<br />\nstatements included in an article<br />\nHhe studied law in Germany at the the Phi Sig house there. Other Phi<br />\nPresided over by Lt.-Col. Hoisingdemonstration which was rumored to<br />\n11.)uses participating in this plan<br />\npublished in The American Weekly<br />\nUniversities of Munich, Berlin, and<br />\nthe new organization of the R.<br />\nton,<br />\nagainst<br />\nthe<br />\nin<br />\nplace<br />\nprotest<br />\ntake<br />\nMagazine, Sunday, September 29, reVViurzburg, receiving his degree in are at the Universities of Chicago, 0. T. C. was described and drill<br />\nno<br />\nBut<br />\nEthiopia.<br />\nof<br />\ninvasion<br />\nItalian<br />\ngarding his discoveries and excavaPennsylvania,<br />\nMichigan,<br />\n1933 at the last-named institution. .-urneil,<br />\nshemes to be used this year was exstudents or demonstration appeared<br />\ntions at Olynthus.<br />\nHis thesis was entitled Der Kundig- Jolorado, Missouri, Alabama, West plained.<br />\nscene.<br />\nthe<br />\non<br />\nThe article, while in the main auVirginia, New York, and Rensselaer<br />\nThe new officers are:<br />\nAbout fifty people were present at ungseinspruchsprozess. German readthentic and accurate, contains cerPolytechnic<br />\nInstitute.<br />\ning classes are invited to figure it<br />\nthe ceremony at which Dr. Isaiah<br />\nCommander,<br />\nBattalion<br />\nMajor,<br />\ntain statements which have been disHopkins Ideal<br />\nWell-Known Political Leader Bowman, president of the University, out.<br />\ntorted in such a way as to make<br />\nAfter spending half a year at Tex- P. W. Guild; captain, battalion adjuFollowing this he took a summer<br />\nAnd Author To Speak At accepted the collection of books for course<br />\nthem absolutely false. It is these<br />\nas Stern decided he was too far away tant, H. D. Severn; first sergeant,<br />\nat the University College of<br />\nthe<br />\nUniversity.<br />\nstatements for Which Dr. Robinson<br />\nthe center of information for drum major, G. R. Weigand.<br />\nfrom<br />\nLecture Series at 8 P. M. Dr. Kent R. Greenfield, professor the Southwest of England. He spent<br />\nCOMPANY \"A\"<br />\nwishes to disclaim responsibility.<br />\na student of international law. As a<br />\nof modern European languages, said some time in England and is inter- result, he chose Hopkins, ideally sitCaptain, W. R. Hazlett; first lieuSensational Rather Than Truthful<br />\nNorman Thomas, renowned writer in his address explaining the new ested in the work of the New ComAccording to the American Weekuated for his field. On a scholarship tenants, B. W. Archer, A. Karpuk, C.<br />\nmonwealth Institute in London.<br />\nand<br />\nforemost American Socialist, collection:<br />\nassumed<br />\nbe<br />\nly Magazine, \"it may<br />\nfrom the University supplemented by I. Rostov. Second lieutenants, G. S.<br />\nat the Johns Hopkins<br />\n\"We may feel very grateful to SigPhi Sig Scholar<br />\nthat the leading citizens of Olynthus will be present<br />\nPhi Sig and the International Stu- Eager, J. A. Hurwitz, W. 0. Miller,<br />\n8,<br />\naddress<br />\nOctober<br />\nUniversity<br />\nto<br />\non<br />\nnor<br />\nCarosi, who not only as friend of<br />\nfelt it their sacred duty to fill themThen, a year ago, Phi Sigma Delta :lents Service, he is especially study- F. T. Suman, Jr., J. E. Walsh. First<br />\nthe first meeting of the University the library of the Johns Hopkins<br />\nselves with the choicest wines and<br />\nfraternity in collaboration with the ing international law and relations, sergeants, H. M. Diver, H. H. Leber.<br />\nClub.<br />\nThe subject of his University has given us, at hiS own<br />\nSupper<br />\nenjoy the performances of the pretty<br />\nInternational Students Service, ar- working at the present time on the<br />\nCOMPANY \"B\"<br />\ntalk will be \"The University and expense, a setting for these books in<br />\ndancing girls frequently.\"<br />\nranged scholarships with various role of equity in international arbiCaptain, C. J. Arcilesi. First lieuTimes.\"<br />\nChanging<br />\nwhich they will be readily accessible American universities for those stu- tration under Drs. Johannes Mattern<br />\n\"This,\" says Dr. Robinson, \"is a<br />\ntenants, J. B. Bullock, G. H. Dayett,<br />\nFollowing his address here, Dr. to us all, but who as a representative dents and former university instruc- and James Hart.<br />\nshameful distortion of facts in order<br />\nE. J. Hatfeld, Jr. Second lieutento provide reading which is sensa- Thomas will give one of the Univer- of his people has wished to submit tors whose education had been cut<br />\n(Continued on Page 4, Col. 3)<br />\nants, R. D. Bader, R. Byer, D. H.<br />\ninterand<br />\nrich<br />\ntional rather than truthful. There sity Lecture series being sponsored to our judgment this<br />\nFisher, R. D. Gambrill, J. W. Powers.<br />\nare no indications found in my ex- by the Hopkins Y. M. C. A., and held esting example of their intellectual<br />\nFirst sergeants, W. D. Buttner, H.<br />\ncavations to support the contention at the First Methodist Episcopal and artistic activity.<br />\nW. Glasser.<br />\n\"For the products of this activity<br />\nthat drinking wine or viewing dances Church. His topic for discussion will<br />\nCOMPANY \"C\"<br />\nby pretty girls was considered by be \"Conflictions Between Security are exports which, whatever may be<br />\nT. D. Callahan, Jr. First<br />\nCaptain,<br />\nthe judgments or decisions dictated<br />\nthe Olynthian populace to be their and Liberty.\"<br />\nlieutenants, E. H. Henning, J. W. Mcby<br />\ncomedy<br />\na<br />\nHills,<br />\nthe<br />\nof<br />\nJeppi<br />\nexpediency<br />\nor<br />\njustice<br />\nof<br />\nsense<br />\nour<br />\nby<br />\nBorn In Ohio<br />\nsacred duty.\"<br />\nGarrity, J. Miceli. Second lieutento the political acts of Ludwig Holling, has been selected<br />\nStatements Misleading<br />\nDr. Thomas was born in Marion, with reference<br />\nC. P. Davis Jr., F. B. Hall, B.<br />\nants,<br />\nfifthe<br />\nof<br />\nproduction<br />\nfirst<br />\nthe<br />\nfor<br />\nan<br />\nto<br />\nsubjected<br />\nbe<br />\nIn another portion of the page is Ohio, in 1884. He was graduated a state, can never<br />\nI. Maisel, F. A. Sarlin. First serHopkins<br />\nJohns<br />\nthe<br />\nof<br />\nseason<br />\nteenth<br />\ncan<br />\nuniversities<br />\nour<br />\nwhile<br />\nembargo<br />\nskeletons<br />\na picture depicting fourteen<br />\nfrom the Marion High School in 19(11<br />\ngeants, V. C. Grove, R. G. Sachs.<br />\nPlaced side by side. The \"blurb\" be- and four years later received his still maintain their hard-won faith in Playshop, according to Dr. N. Bryl- Head Of Archaeology DeCOMPANY \"D'<br />\ngroup.<br />\nthe<br />\nof<br />\ndirector<br />\nFagin,<br />\nIon<br />\nthought.\"<br />\nof<br />\nfreedom<br />\nthe<br />\nneath reads as follows: \"A grim re- A. B. degree at Princeton University.<br />\nTo<br />\nGive<br />\npartment<br />\nAddress<br />\nW. E. Bittrick. First lieuCaptain,<br />\nperfive<br />\ngiven<br />\nbe<br />\nwill<br />\nplay<br />\nThe<br />\nIncluded<br />\nMatter<br />\nCritical<br />\n2,300<br />\nminder of a plague in Olynthus<br />\nIn 1911 he matriculated at the Union<br />\ntenants, V. C. Kelly, L. B. Tankin,<br />\nDr. Greenfield publicly expressed formances, beginning Tuesday, NoOn Poetry of Pindar<br />\nyears ago when scores of people—no Theological Seminary and was orR. B. Young. Second lieutenants, E.<br />\ndoubt lovely dancers like those above dained into the ministry of the Pres- his appreciation of the fact that the vember 19.<br />\nM. Lippman, J. MacClarence, A. V.<br />\nSeveral Plays Scheduled<br />\namong them—were laid side by side byterian Church. Between 1918 and collection contained not only matter<br />\nThe Johns Hopkins University<br />\noffering<br />\nof<br />\npolicy<br />\nVoegle. First sergeants, E. L. RowContinuing<br />\nits<br />\nbut<br />\nstate,<br />\nFascist<br />\nthe<br />\nwithout coffins in a single grave.\" 1921 Dr. Thomas founded and edited favorable to<br />\nPhilological Association will hear Dr.<br />\nseason,<br />\neach<br />\nny, W. H. Townshend.<br />\npresentations<br />\nseveral<br />\nwell.<br />\nas<br />\nmatter<br />\ncritical<br />\ndancers<br />\nlovely<br />\nthat<br />\nThis intimation<br />\nDavid Moore Robinson, head of the<br />\nThe World Tomorrow. In 1921 he<br />\nAmong the volumes, which are to the Playshop is preparing a schedule University's department of art and<br />\nwere among the fourteen skeletons became associate editor of The NaThe Fires of St.<br />\npictured, has no foundation in fact. tion and the director of the League be housed in a special alcove pre- which will include<br />\narchaeology, lecturer on Greek litersented by Signor Carosi, are some John, by Herman Sudermann; a new ature, and president of the associa- J. H. U. Cotillion Board<br />\n\"There is,\" according to Dr. Robin- for Industrial Democracy in 1922.<br />\nforty plays by about twenty different play by a contemporary American tion, deliver his presidential address<br />\nson, \"no indication that any of the<br />\nAnnounces First Dance<br />\nCandidate For President<br />\nauthors, Dr. Greenfield said. There playwriter, and a series of short dra- on Thursday, October 17, at 11:30<br />\nfourteen skeletons were either lovely<br />\nA candidate for governor of New are about thirty novels by fifteen mas. Each play will be preceded by<br />\nor dancers.<br />\nThe majority of the<br />\nA. M.<br />\nThe Townsmen, well-known local<br />\nYork on the Socialist ticket, and authors, and sixteen volumes of a lecture from some prominent scholskeletons shown are of the male sex.\"<br />\nDr. Robinson has chosen the topic, orchestra, will furish the music at<br />\ntwice a candidate for mayor of New verse by a dozen poets.<br />\nar or lecturer on dramatics.<br />\nThe article also mentions the fact<br />\n\"Pindar, A Poet of Eternal Ideas.\" the first dance to be held in LeverYork City, Dr. Thomas ran for presiSeason tickets entitling the holder<br />\nDuce's Speeches Recorded<br />\nthat \"a great temple to the god had<br />\nThe purpose of lecturing on this ing Hall on Saturday night, October<br />\ndent in 1928 and 1932.<br />\nFor comment on modern Italian to see all productions and to attend<br />\nbeen found decorated with friezes of<br />\nAs an author, Dr. Thomas has life are the five volumes of Cose all lectures may be obtained from topic, explained Dr. Robinson, is to 12, from 9 to 1, according to an andancing girls.\" \"There is absolutely<br />\noffer a refutation to the idea held nouncement from the Cotillion Board.<br />\nwritten such books as America's Way Viste by Ugo Oietti, Italian journal- Dr. Fagin for $2.00.<br />\nno basis for this assertion,\" says Dr.<br />\nThe board, headed by Alan Deleby many modern scholars, including<br />\nOut, As I Sec It, and What's The ist; an edition of the public addresses<br />\nAdmission for the major performRobinson, chief archaeologist of the<br />\nMatter With New York? He has of Mussolini; and recent works on ances will be fifty cents for the stu- Gilbert Murray, that there is no vett, has started preparation for the<br />\nexpedition. He states that no temple<br />\nthought in the works of Pindar. Dr. first Cotillion, which will be held<br />\nalso made many contributions to the Fascism and the cooperative state.<br />\ndent body.<br />\nwas found such as described in the<br />\nRobinson believes, however, that Thanksgiving night, probably at the<br />\nSocialist and Labor Press.<br />\narticle. There were excavated, howPindar's<br />\nworks are full of thoughts, Alcazar. The orchestra which will<br />\nOn November 5, Dr. T. Z. Koo, Secever, vases and mosaics bearing<br />\nof<br />\nmany<br />\nwhich can be applied to the play at the Cotillion will be decided<br />\nfigures of dancing girls, but no retary World's Student Christian Fedpresent<br />\nDr. Robinson also holds on later.<br />\nday.<br />\neration, will address the Supper Club.<br />\ntemple.<br />\nthat the works of Pindar influenced<br />\nDr. Thomas Guthrie Speers, trusDescribes Olynthus<br />\nsuch literary figures as Matthew ArThe article deals with the history tee of Princeton University and of<br />\nnold, Ruskin, Tennyson, Emerson, First Meeting Of Band<br />\nof Olynthus, and with the customs Goucher College, will present the<br />\nSwinburne, Walter Pater. and others<br />\nTo Be Held Tomorrow<br />\nand habits of the people living there. third lecture on December 10.<br />\nIn a message primarily designed marked in part, \"to get places either<br />\nMany modern scholars also hold<br />\nIt describes how Olynthus was deOther speakers who will address for the incoming students, but of during the summer, or after school the belief that Milton never read<br />\nAn organization meeting of the<br />\nstroyed by Philip of Macedon, father the Supper Club at subsequent meet- definite interest to upper classmen hours, in positions which are allied Pindar. In answer to this Dr. RobinHopkins Band will be held<br />\nJohns<br />\n1)<br />\n(Continued on Page 4, Col.<br />\nings throughout the year are Dr. as well, Dr. William B. Kouwenhov- to their studies. Thus one can broad- son has direct proof that Milton<br />\nOctober 9, at 4 o'clock,<br />\nWednesday,'<br />\nToyDr.<br />\n7;<br />\nJanuary<br />\non<br />\nKirby Page,<br />\nen, assistant dean of the School of en his knowledge of his particular spent three months reading Pindar.<br />\nWell-Known Astronemer<br />\nhiko Kagawa, on January 21; Dr. Engineering, and director of the subject. 'What is more important, if As his proof, Dr. Robinson will offer in the Barn. All students interested<br />\nGraham, on February American Institute of Engineering, he is good, is the fact that he stands the fact that the copy of Pindar used are urged to attend.<br />\nTo Give Courses Here Frank Porter<br />\nInstruments can be borrowed, and<br />\n18; Paul Hutchinson, on March 17; stressed particularly the duties of a an excellent chance to obtain a place by Milton is now in the Harvard Uniauthorization slips will be given at<br />\nDr. A. Adel, New Member Of Teach- Rev. Ernest Fremont Tittle, on April<br />\nSugraduation.<br />\nafter<br />\npertiimmediately<br />\ngiving<br />\nfreshman class, while<br />\nversity Library, is underscored, and<br />\ners' College Faculty, To Do<br />\n21; Rev. Reinhold Niebuhr, on May nent advice to students in his de- perintendents have an uncanny mem- contains many notes in the margins the meeting to supply the members.<br />\nPlayers of brass instruments and<br />\nSpectroscopy Work<br />\n12.<br />\nory. They especially remember men which are unmistakably those of<br />\npartment.<br />\nclarinets are especially in demand.<br />\ngood work- Milton.<br />\n\"This class,\" said Dr. KoKtiwen- who are persistent or are<br />\nBand officers for the current year<br />\nDr. A. Adel, the new member in<br />\ncite several exThe lecture is open to all students include: Ace Weigand, drum major;<br />\nhoven, in speaking of the freshmen, ers.\" He went on to<br />\nthe Department of Astronomy of the zalero Club To Discuss<br />\nmemory.<br />\nhis<br />\nwithin<br />\nthis<br />\nof<br />\namples<br />\nand instructors of the Univeroity, Edwin Ottenheimer, leader; Lowere,<br />\nimpresses me as being both big and<br />\nCollege For Teachers, is well-known<br />\nS.<br />\nU.<br />\nSubmarine<br />\nPlanes<br />\nschool graduate whether members of the Philological<br />\nengineering<br />\n\"The<br />\nhaving<br />\nof<br />\nsense<br />\nthe<br />\ngood-looking—in<br />\nsecretary, and Wm. Gontrum, limolecular rein the field of<br />\npossibilities. I would especially of today need have little fear of dif- Association or not.<br />\ngreat<br />\nplanbrarian.<br />\nof<br />\nsearch and also in the study<br />\nTuesday at 5:00 P. M. was selected like to see these possibilities realized ficulty in obtaining a position.\"<br />\nn the evening of the same day, Dr.<br />\nAt the<br />\nets and their atmosphere.<br />\nPoints To Last Year's Record<br />\nmeeting time by the in some form of campaign to keep<br />\nRobinson will deliver an address to<br />\nUniversity of Michigan Graduate as a regular<br />\nGAREY STATE POLICE HEAD<br />\nconnecthis<br />\nIn<br />\ngrass.<br />\nAero<br />\nthe<br />\nClub<br />\noff<br />\nat<br />\nits<br />\npeople<br />\nHopkins<br />\nfirst<br />\nAt this point he interrupted his a large audience in the New York<br />\nSchool he did extensive research Johns<br />\ntion it would be well to emphasize the discourse to pull a well-fingered University's auditorium at Univermeeting held last Friday.<br />\nwork on the atmosphere of the planet<br />\nMajor Enoch Barton Garey, former<br />\nfor interest in the activities of brown notebook from a drawer.<br />\nneed<br />\ngathering<br />\nwill<br />\nformal<br />\nfirst<br />\nsity Heights, on the \"Methods of ExThe<br />\nits<br />\natmosphere<br />\nVenus and proved that<br />\nprofessor of Military Science and<br />\nuniits<br />\nin<br />\nas<br />\nwell<br />\nas<br />\nUniversity<br />\nthe<br />\nhe<br />\nEngineering,\"<br />\nof<br />\nSchool<br />\n\"The<br />\ncavation.\"<br />\nis largely made up of carbon dioxide. take place today in the office of the<br />\nTactics at the Johns Hopkins Univerversity. A man should allow himself read, \"graduated forty mechanical<br />\nDr. Adel has also done considerable Student Activities Committee in<br />\nwas appointed head of the<br />\nsity,<br />\nand<br />\noutrecreation<br />\nfor<br />\ntime<br />\nof<br />\nplenty<br />\nand electrical engineers at the last<br />\nLevering Hall. The discussion will<br />\nwork at the Lowell Observatory.<br />\nMaryland State Police last week by<br />\nMEET<br />\nACTIVITIES<br />\nHEADS<br />\nOF<br />\nfreshmen<br />\nHowever,<br />\ninterests.<br />\nside<br />\nof<br />\ntwo<br />\nexcept<br />\nAll<br />\ncommencement.<br />\nAt Johns Hopkins, Dr. Adel will be on \"Folding-Wing Submarine<br />\nGovernor Harry W. Nice.<br />\nand upper classmen alike should do these men are working in their choswork with Dr. Gerhard H. Pieke, as- Planes of the U. S. Navy.\" The lecMajor Garey, who is widely known<br />\ncourses<br />\nthe<br />\non<br />\nhard<br />\nwork<br />\nthan<br />\nmore<br />\nthe<br />\nof<br />\nJohn<br />\nMagill,<br />\nC.<br />\npresident<br />\ncontinuen fields. Both of these are<br />\nsociate professor of physics, in the ture will be augmented by several<br />\nhis textbooks on military instrucfor<br />\nHopthe<br />\nat<br />\nstudying<br />\nhere<br />\nare<br />\nthey<br />\nof<br />\nproudest<br />\nam<br />\nI<br />\nstudies.<br />\ntheir<br />\ning<br />\nhas<br />\nStudent Activities Committee,<br />\nfield of experimental spectroscopy. photographs from the collection of<br />\ntion, was appointed head of the Milikins.\"<br />\nworkis<br />\nthese<br />\nof<br />\none<br />\nno<br />\nthat<br />\nfact<br />\nthe<br />\nthe<br />\nof<br />\npresident<br />\nDuce,<br />\nDr. Adel will also give the astronomy G. Grahame<br />\nhas announced a meeting of the<br />\ntary Department at the Hopkins<br />\ning for any government agency. No<br />\nSummer Jobs Advised<br />\ncourse in the College For Teachers. club. An election will also be held<br />\npresidents and business managers of shortly after the war and held this<br />\nthe<br />\nascend<br />\nto<br />\nexpecting<br />\nhis<br />\nengineer<br />\nturned<br />\nthen<br />\nKouwenhoven<br />\nDr.<br />\nDr. Adel graduated from the Uni- to fill the position of vice-president.<br />\nthe various activities, to be held to- post until he assumed the presidency<br />\nversity of Michigan in 1931 and re- Names of all students interested in attention to the matter of placing ladder of success should accept a<br />\nmorrow at 12:20 P. M., in the board of St. John's College several years<br />\nemerin<br />\nexcept<br />\nposition<br />\nceived the degree of doctor of philoso- the club should be sent to G. G. Duce, graduates, which is in his charge. \"I government<br />\nago.<br />\nof Levering Hall.<br />\nroom<br />\ngency<br />\ncases.\"<br />\nrehe<br />\nmen,\"<br />\nadvise<br />\nstrongly<br />\nwould<br />\nphy there in 1933.<br />\nBox 65.<br /><br />\nNo Basis For Belief<br /><br />\nNorman Thomas To<br />\nOpen Supper Club<br />\nSeries Here Tonight<br /><br />\nPlayshop To Open Philological<br />\nSeason November19<br /><br />\nGroup<br />\nAt Johns Hopkins<br />\nTo Hear Robinson<br /><br />\nDr. Kouwenhoven Gives<br />\nViews On Freshman Class<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br /><br />\nOMMEN<br /><br />\nTbt PewslLetter<br /><br />\nQuad Quips<br /><br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nTuesday, October 8, 1935<br /><br />\nEternal Freshman<br /><br />\nERICAN BALI -:-<br /><br />\nBy JACK STEIN<br /><br />\n. . . \"Good humor is one of the best articles of<br />\ndress one can wear in society.\" Thus William Thackeray<br />\nRemit subscription fees to Treasurer, Student Acdefined the word humor.<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hop. . . \"Wit is the most rascally, contemptible, begkins University.<br />\ngarly thing on the face of the earth.\" This is the defiEntered as second-class matter December 3, 1909, nition of wit by Arthur Murphy, an Irish dramatist and<br />\nat the Postoffice in Baltimore, Md., under the Act of miscellaneous writer of the 19th century.<br />\nCongress, November 3, 1879.<br />\nBut we all agree that wit and humor are not the<br />\nPublished semi-weekly from October to June, ex- same thing. Wit implies the swift perception of the<br />\ncept during examination and college holiday periods incongrous, while humor, often blended with pathos,<br />\nimplies a more kindly sense of the incongrous. Be that<br />\nby undergraduates of the Johns Hopkins University.<br />\nas it may, the object of this column is to present a witty<br />\nEDITORIAL DEPARTMENT<br />\nhumor. Define that! Go ahead—I dare you!<br />\n. . . in any case, a girl I know received a letter<br />\nEditor-in-Chief<br />\nJesse N. Borden<br />\nfrom a barber friend of hers proposing marriage. She<br />\nEditor<br />\nManaging<br />\nLeberfeld<br />\nIrving<br />\nhappened to leave this letter exposed and while visiting<br />\nWilliam Diamond, Stanley M Finkel,<br />\nher one night, I read it. This is what the barber says:<br />\nAssistant Managing Editors<br />\nDear One:<br />\nNews Editor<br />\nHershner Cross<br />\nHair I comb bringing a massage of love. It's a singe<br />\nEditor<br />\nSports<br />\nKenneth Zierler<br />\nthat<br />\nI'd lather have you than all the curls in the world.<br />\nEditor<br />\nSports<br />\nAssistant<br />\nCaplan<br />\nDavid<br />\nI'm your devoted shave for ever and ever. Every day<br />\nFeature Editor<br />\nEdgar Kemler<br />\nlilac the shop and cologne up, and then hurry to our<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nlittle hone with the honeysuckles all around it. We'll<br />\nColumnists<br />\nrazor little one to be a great man, and shear in his<br />\nBUSINESS DEPARTMENT<br />\ngreatness. We'll facial our troubles with a song in our<br />\nBusiness Manager<br />\nhearts, and this is no idle talc. I Jeris the very thought<br />\nDavid Levy<br />\nAdvertising Manager<br />\nof you. While honeymooning we will stop only at nice<br />\nJulian Cohen<br />\nOffice Manager<br />\nhot-towels.<br />\nRobert Watkins<br />\nCirculation Manager<br />\nWith lotions of love,<br />\nRobert Levi<br />\n(apologies to Winchell)<br />\nCopy and Filing Manager<br />\nStanley Prager<br />\nJohn Baldhead.<br />\nBUSINESS STAFF<br />\nN. Soifer, A. Delevett, W. Kempton, H. Linkoff,<br />\nG. Willen, W. Erlanger.<br /><br />\nA<br /><br />\nII. NO SPIES<br />\nEarly in June I sailed from New<br />\nYork City. I then slept five days of<br />\nexotic dreams before the first sight<br />\nof land, which happened to be a little<br />\nrock off the coast of Porto Rica—<br />\nonce mistaken for a full-rigged mano-war and fired upon.<br />\nFor three<br />\nmore days we passed isle after isle<br />\n—but none quite the right one. Each<br />\nwas terrible at sea level with wrinkles of rock. Each island town was<br />\na colony of red-brick mushrooms as<br />\nagainst the thick yellow-green foliage of the hills. Each isle was set<br />\nin the Caribbean like a hanging garden—between sky and sea—between<br />\nthe upper heavens above for the Pure<br />\nSpirits and the richer purple-streaked<br />\nHell below of the vile water of Pluto. Noble—but not yet!<br /><br />\nA week already. Behind were the<br />\nLittle paradise drops—the islands: St.<br />\nThomas, St. Kitts, Antigua, Guadaloupe—none, the Bali I was searching for. At last as we headed toward<br />\nFort de France, capital of French<br />\nMartinique, along its coast, I saw a<br />\nstrand of beach—of listless palms<br />\nand primitive huts in the foreground,<br />\nand a possible jungle in the rear. Immediately I knew that the great local<br />\nBali could not be far. Here, certainSPECIAL QUAD QUIP NEWS DISPATCH:<br />\nly, must be romance, languid beauty,<br />\nOctober 3, 1935, QQP—Nitwiaal engages in fierce<br />\nthe Land of Escape!<br />\ncombat with the troops of His Royal Shyness, the King<br />\nIn company with an aristocratic,<br />\nof Kings, the Invincible, the etc., etc., etc., the Zoo of<br />\nbut<br />\nwell-informed Californian, Dr.<br />\nJudah, according to latest dispatches. It is believed<br />\nFortescue,<br />\nI disembarked. I went to<br />\nthat the quarrel broke out six months ago, when one<br />\nthe government building three blocks<br />\nof the Witlitalian soldiers went a hunting. Spying a<br />\nbrightly colored bird soaring on high, he aimed his from the wharf to seek entrance.<br />\nNow it seems that in my enthutrusty musket and fired. The sound echoed and resiasm to investigate down here, I had<br />\nechoed throughout the mountain of I'llbeseeinya. The<br />\noverlooked certain concessions that<br />\nking of I'llbeseeinya Holey Salami, imagining the war<br />\nyou have to make to imperial egos.<br />\nforces,<br />\ntwo<br />\nentire<br />\nordered<br />\nhis<br />\nimmediately<br />\nhand,<br />\non<br />\nwas'<br />\nhad brought no passport, no visa,<br />\ncamels, one airplane propeller, and a one-legged soldier<br />\nno<br />\nnothing. I had no means of into the front. Since I'llbeseeinya is a backwards counternational recognition — and the<br />\ntry, the soldier had to go to the rear to get to the front.<br />\nFrench officials were supposed to be<br />\nMeanwhile, the Nitwitalians realized that Holey Salami<br />\nunusually strict. I guess that all this<br />\nMusleinoni<br />\nleader,<br />\nforces,<br />\ntheir<br />\nand<br />\nwas mobilizing his<br />\nred-tape must go back to pirate days<br />\ndid likewise. Thus it was a war between Salami and<br />\n—when a stranger could overnight<br />\nMuscleinoni. The lotter thought Salami was a lot of<br />\nbetray and ravage any of these ports.<br />\nbolony, and Salami thought that Muscleinoni was a<br />\nAs my friend, Fortescue, had prompt(censored) kind of a man. At the latest report before<br />\nly disappeared—I figured that I<br />\nbusiness),<br />\ngoing to press (no, we're not in the tailor<br />\nmight reveal myself to the officials<br />\n,the war was still being carried on verbally. That peacetor what I was, which was obviously<br />\nloving body, the League, has suggested a game of tidno pirate, spy, nor international<br />\ndley winks to settle the argument.<br />\nvagabond. Surely they would listen<br />\nto reason.<br />\nA spinster is a bachelor's wife.<br />\nThere were troubles to all this,<br />\nThat new monument to Johns Hopkins, located on however. It seems that the official<br />\nCharles and Thirty-Fourth Streets, is a beautiful piece means of communication here is<br />\nof work. One is bound to wonder why Johns is facing French. But through the years, the<br />\nEast Baltimore Street rather than his own campus— great masses of black natives have<br />\nor maybe it's because they figured it's bad enough he converted it into a patois—a sort of<br />\nbaby-talk jargon based on the origionly hears what's going on, and not having to see.<br />\nYou've probably heard of the Freshman who wanted nal without grammar, rule or order.<br />\nFor example, for the word more, they<br />\nto be-come a street car conductor so he could kick the<br />\nhave corrupted the Parisian plus<br />\ngong around.<br />\ninto the Martiniquan peele. For he,<br />\nthey have changed il into H. For I<br />\nwere forced to halt their pursuit of education love you, they do not say je raime<br />\nlike the French; they say moi ea<br />\nby the Nazis.<br />\nby the Nazis. One of these students is now a aimer 0u—literally, me am lovin' you.<br />\nguest of the Hopkins chapter of Phi Sigma In other words, the street babble of<br />\nMartinique is known as Patois Creole<br />\nDelta.<br />\n—the patois of the native. It is, in<br />\nHere we have a fraternity doing some- all truth, the Yiddish of the<br />\nWest<br />\nthing patently worthwhile.<br />\nIndies!<br /><br />\nAlthough the term \"freshman\" is applied<br />\nin their first year of residence at a<br />\nmen<br />\nto<br />\nuniversity, there are many men in their third<br />\nand fourth years who are, nevertheless, freshmen. To determine how this statement can<br />\nbe true, we must first interpret the meaning<br />\nof the word \"freshman.\"<br />\nA reputable dictionary describes a \"freshman\" as \"a college student in the first year of<br />\nthe course.\" According to this definition, the<br />\nonly determining factor is the time element.<br />\nBut after having been in college for two years<br />\nand having closely observed many students<br />\nduring that period we venture to disagree<br />\nwith accepted definitions of \"freshman.\"<br />\nBreaking the word into its component<br />\nparts we get, fresh man, which is about the<br />\nsimplest and best definition it is possible to<br />\nmake. Thus, we see that a freshman is a man<br />\nwho is new to the ways and ideas of the University, and is trying to become acclimated to<br />\nthem.<br />\nHow can a freshman become acclimated?<br />\nThis is a difficult question to answer because<br />\nits solution has to deal with mental rather<br />\nthan physical factors. But the closest we can<br />\ncome to it is to say that a man has not become<br />\nacclimated to the University until he has acquired the Hopkins Spirit. This inevitably<br />\nleads to the query, \"What is the Hopkins<br />\nSpirit'?\" And here we run into an obstacle<br />\nwhich we can't hurdle.<br />\nThe Hopkins Spirit is something intangible. It is like some powerful force, itself<br />\nAt the risk of shaking somebody's convicunseen, but evident because of its external ef- tions, may we suggest that there may be other<br />\nfects. We can point out several of these ex- laudable phases to fraternity life? It is an<br />\nternal manifestations but we cannot hope to interesting conjecture.<br />\ninstill the spirit which motivates them. That<br />\nis something which has to come of its own<br />\nRah-Rah<br />\naccord after a man has been exposed to the<br />\nIt is a fearful thing to grow up—to lose<br />\ninfluences and atmosphere of the University.<br />\nThis is almost like a religious experience and naturalness.<br />\nAnnually, each freshman class is told that<br />\ncan come to a person in the midst of an exciting football game or while he is just look- the freshmen are no longer high school boys,<br />\ning over the campus from some advantageous but college men. Apparently this admonition connotes cynical apathy.<br />\nspot, and reminiscing.<br />\nSpecifically, we refer to the lackluster lasSo even though a man were to attend the<br />\nsitude<br />\nof what has humorously been termed<br />\nUniversity for the rest of his life, without the<br />\nHopkins<br />\nthe<br />\nrooting section.<br />\nHopkins Spirit, he would still be a freshNow<br />\nwe<br />\nare<br />\nthe first to rejoice that our<br />\nman.<br />\nBluejay is not a cinematic rah-rah bird, but<br />\nwe do lament the lack of cooperation of the<br />\nThe Other Side<br />\nstudent body \"in building up and fostering a<br />\nSkepticism has been intimated in the past vital team spirit,\" as Head Coach George<br />\nfew years concerning the value of fraternities Darley phrased it.<br />\non a campus—on any campus,in general—on<br />\nOne way to help in this matter is for those<br />\nthe Hopkins grazing ground, in particular. gripers who themselves fall short of the courIt has been suggested that frat houses age to try to play football for Hopkins to<br />\nwere merely places to hang out, that they keep all unkind remarks anent the merits of<br />\nwere merely a means of providing rent for the eleven to themselves.<br />\nimpoverished landlords and irritation for senA second way is more constructive<br />\nsitive neighbors.<br />\nthough no more effective, for it is the perniciThe Greek brethren themselves have been ous whispering of the envious that underlabeled snobs, bums, and incorrigibles.<br />\nmines spirit. This additional method is for<br />\nThat there is another side to fraternity the regretably compulsory rooting section to<br />\nlife may be a disappointing surprise to some. evince some semblance of organized enthusiThe case of 'William Bernard Stern is a case asm.<br />\nin point.<br />\nIt lets the outside world see that the HopPhi Sigma Delta, with chapters in twen- kins man can become enthusiastic, and the<br />\nty colleges and universities from the New outside world finds some inherent good in<br />\nEngland States to Texas and from the At- a man who can become enthusiastic about<br />\nlantic coast to the Rocky Mountains, offered<br />\nsgteomhniktem mm mmbb bb bmbbbbbb<br />\nto play host to students in Germany who something.<br /><br />\nSo much I had gleaned from the<br />\nisles en route. But I was undaunted.<br />\nI stood firm in a little room in the<br />\nwhite, cold gouvernment.<br />\nLittle<br />\nknots of of native police in brown<br />\nuniforms hovered in the corners. In<br />\nfront of me was a large desk at<br />\nwhose wings sat two dusky little<br />\nsecretaries—so similar as to be twins.<br />\nI marveled at their symmetry, until<br />\nI realized that I was facing a stout,<br />\nfierce bluster of a man—surely the<br />\ngovernor—jutting out dangerously<br />\nfrom between his menials.<br />\n\"Bonjour, monsieur,\" I started,<br />\nrealizing that this was the beginning<br />\nof a long hard, linguistic journey.<br />\n\"Bonjour,\" he blustered back.<br />\n\"Je sis American. Pas de brigand.<br />\nNo pirate. Je desire rester ici for<br />\nabout a month. I want to study this<br />\nLand of Escape—this tropical paradise .. . \" It went all very well until<br />\nI came to explain that I had no passport, no visa, nothing. I didn't remember that passport was the same<br />\nin French as in English. I began to<br />\nthink of all the substitutes for the<br />\nword passport that could ever be possibly invented. International ticket,<br />\nnative notice, national note—avis de<br />\ncommerce, billet de pays, etc.—all<br />\nsorts of queer phrases which must<br />\nhave been truly astonishing to the<br />\nunimaginative automat in front of<br />\nme.<br />\n\"Sacre Bleu!\" said the automat,<br />\nastonished. He had understood nothing.<br />\nI now realized that I was in a<br />\ntough spot. The blood rushed to my<br />\ncheeks. Even had I communicated<br />\nthe fact that I had no passport, that<br />\nI was not a spy, and that I was<br />\nharmless, they might not let me in.<br /><br />\nBy EDGAR KEMLER<br />\nI lost faith in their reason. Perhaps, really hadn't, for the previous evethen, I could appeal to their emo- ning I had let him read the foregoing<br />\ntions. I would entertain them. In- parts of this series on the American<br />\nstead of talking French, I'd talk Pa- Bali. He had felt so nauseated after<br />\ntois Creole to them. It would create that that I had given him up for<br />\nlost. An author should never reveal<br />\na bond of sympathy between us.<br />\nSlowly, but distinctly, I now cooed, himself to his friends; it's the surest<br />\n\"Moi ca aimer ou. Me am lovin oo.\" way of losing them.<br />\nIt was, to tell the truth, all I knew HOPKINS—THREE<br />\n\"Congratulations, Kemler, you are<br />\nof the language. And though inappropriate, it came as an emotional saved,\" he said. \"I have told them<br />\nlaxative to my startled audience. the truth. You are perfectly harmThe knots of chocolate soldiers roared less.\"<br />\nHe was like a deus ex machina—<br />\nas though the bowels of the Earth<br />\nwere moving in accord. Their sabers like a classical god solving my superrattled frivolously. The two secre- human difficulty in his divine emertaries stopped their typing—probably gence. My regiment dissolved away.<br />\na double record of my speech— I was free.<br />\nWhen Raison and I had returned to<br />\nblushed, and wept tears of relief.<br />\nLove and the emotions are a univer- the governor's room, Raison pointed<br />\nsal solvent, I thought—for all but to my boots which I always wear in<br />\nthe governor. He was not to be dis- the tropics for fear of snakes. \"Pour<br />\nles serpants,\" he told the governor.<br />\nsolved!<br />\nHis look quelled the uprising. He \"See how naive he is.\" The staff of<br />\nwhispered something in turn to each officials roared at my embarrassof his menials. They next whispered ment with perfect freedom. I had<br />\nsomething<br />\nto the corresponding previously roared at them with the<br />\nguards at hand, who disappeared threat of life imprisonment. Such is<br />\ninto an inner room. Soon they re- the way of the world!<br />\n(Continued In Next Issue)<br />\nturned again with a short, serious<br />\nlittle fellow with a deep scar on his<br />\nface.<br />\nInter-Frat Freddie's<br />\nHe addressed me, \"I speak Engleesh. You insult zee gouvernment of<br />\nMartinique. Where eez your passport, eh brigand?\"<br />\nWell, the rushng season of 1935<br />\nI was sure now that it would be<br />\ninfinitely safer if they didn't under- is now well under way with the S.<br />\nstand me. This fellow would return P. E.'s (Sig Ep's) spreading rumors<br />\nme to New York. My demands were around that they have just pledged<br />\nso simple, yet all this international Haile Selassie. Also the A. T. 0.'s<br />\ngravity—it was so absurd. I would are all busy down in the cellar of<br />\nnot steal the island. Why should I? their house around on Calvert Street,<br />\nI had it! If they couldn't under- building a brand new recruiting stastand my efforts at reason in my tion which ,they will probably set up<br />\nimaginative French, then I couldn't right out in front of Levering Hall.<br />\nWe hear that, as a last resort, the<br />\nunderstand their in English.<br />\n\"You understand me good, yes, Kappa Sigs are inviting Harry (Governor) Nice to their open house (as<br />\nno?\" he asked.<br />\nif he'll do any good).<br />\n\"No, sir, notatall.\"<br />\nWhat with Lou Reuling swilling<br />\n\"You not understand? You not<br />\nbeer in Heidelberg and Carson FraiEnglish?\"<br />\nley gone from the campus the D. U.'s<br />\n\"No sir, I'm not. I'm American.<br />\nseem<br />\nplenty worried about being able<br />\nAnd what is more I don't talk English. I don't talk American, even. to roll the Phi Gams out of any<br />\nI'm from Ballimer (Baltimore). I major offices this year.<br />\nSpeaking of the Phi Gams it seems<br />\nspeak Ballimer patois—nothing more,<br />\nthat brother John \"Tunnel Mouth\"<br />\nnothing less!\"<br />\nGhingher is trying to achieve fame<br />\n\"Mon dieu.\"<br />\n\"Swearing does you no good. If as the greatest \"rusher\" of all time.<br />\nyou wan to communicate, you got to Freshmen (who can't run faster than<br />\nlearn to speak Ballimer too. Slur Johnny) have developed the habit of<br />\nyour syllables. Talk fast. Jumble sitting down and putting handkeryour mouth. therwise, I wone under- chiefs over their faces whenever he<br />\n. appears on the scene.<br />\nstan a<br />\nword—notaword!\"<br />\nFrater Delevett of the Phi Psi's,<br />\n\"Patois, patois. In Baltimore, you<br />\nseems<br />\nto think that there is some<br />\nhave baby talk American like Patois Creole is baby to zee French? strange fascination about his big,<br />\nblack derby hat which will draw<br />\nImpossible!\"<br />\nfreshmen<br />\nto him; else why does he<br />\n\"That's the general idea.<br />\nAn I<br />\ncould teach you Philly patois, Vir- wear the fool thing? Maybe to shade<br />\nginia patois, Middle West patois, his face. Seems he's \"rushing\" the<br />\nMaine patois—all of them. It would season as well as the freshmen.<br />\nThe Tau Alpha Phi's are still oftake years—but it is well worth it.<br />\nfering<br />\nsoda fountain jobs and memIf you gentlemen wan to learn, I<br />\ncould easily arrange it at 15 francs bership into Tau Beta Pi to any<br />\nfreshman engineers who might sign<br />\nan hour . . .\"<br />\nup with them.<br />\n\"Fifteen francs, sacre mere,\" he<br />\nWill someone please drop good ol'<br />\nchoked.<br />\nThe linguist repeated my proposi- Inter-frat Freddie a penny postal and<br />\ntion to the governor. There was a tell him whether the Delta Phi's still<br />\nhave a chapter at Hopkins or not.<br />\nmoment of reflective silence.<br />\nHis<br />\nWe wonder how Duce, Tinley and<br />\nExcellency slowly, but surely was<br />\nsensing the fact that he was being Henry will like being chained down<br />\nswindled. A grand sweep of his the cellar of the Kappa Alpha house<br />\nhand! In an instant, I was seized by all during \"rushing\" season.<br />\nthe entire regiment of native guards.<br />\nMy my, my! We almost forgot the<br />\nWell, maybe we<br />\nI was accompanied across an open good ol' Beta's.<br />\nought to, anyway.<br />\ncourt lined with royal palms.<br />\nThen<br />\ninto a long corridor, down a long<br />\nset<br />\nA. C. P. NEWS<br />\nof stone steps. An occasional<br />\nbarred<br />\nThe Associated Collegiate Press<br />\nwindow opened out into the tropical<br />\nwill hold its convention in Chicago,<br />\nsun. It became darker., I<br />\ngulped.<br />\nOctober 17-19.<br />\nCells, large blood-shot eyes and<br />\nthe<br />\n* * *<br />\nbloody swollen lips of lepers<br />\nopened<br />\nAmong the many distinguished perout at me. A key clanked.<br />\nsons who will be present are: Leland<br />\nAll the while, I screamed and<br />\nStowe, Paris correspondent of the<br />\nraged. \"You officials, you humorless<br />\nNew York Herald-Tribune and winautocrats. Children playing a mockserious game against imaginary spies ner of the Pulitzer Prize for the best<br />\nexample of foreign correspondent in<br />\nand pirates! What right have you<br />\nto 1930; he will<br />\nspeak on \"The European<br />\nseize me, an American citizen?<br />\nMe, vs. the American<br />\nPress.\"<br />\nCarroll<br />\nconcerned only witih the harmless<br />\nBinder,<br />\nforeign<br />\nexpert<br />\nof the Chicago<br />\njoy of living in the tropics.<br />\nNeither<br />\nreason nor emotion sways you—you Daily News, who has served his<br />\npaper in Rome, Moscow, London, and<br />\nofficials who live by ancient formuLatin<br />\nAmerica, and has just returned<br />\nlas and illogical orders.<br />\nTo think<br />\nfrom an investigative visit to Japan,<br />\nthat I'd have to find you here as<br />\nthe<br />\nBlack Dogs who guard the gates of China, Manchukuo, and Korea. Mr.<br />\nBinder will speak on \"News of the<br />\na splendid paradise.<br />\nThere are<br />\nWorld.\" Harry B. Rutledge, managenough of your breed at home. The<br />\ning<br />\ndirector, National Editorial AsTemperate one is full of you. But<br />\nsociation; Dr. Ralph D. Casey, chairefficiency and<br />\ncollectivism<br />\neven man,<br />\nDepartment of Journalism,<br />\nhere? Good God!\"<br />\nUniversity of Minnesota; Curtis D.<br />\nIt was then in the midst of my<br />\nMacDougall, editor, Evanston News<br />\nraving that I felt a firm hand on<br />\nIndex, and lecturer in journalism at<br />\nmy shoulder. I turned and looked<br />\nNorthwestern; Kenneth E. Olson,<br />\ndirectly into a dark, familiar face.<br />\nnewly appointed director of the<br />\nIt was Raison—the man whom I had<br />\nschool of journalism at Rutgers Unimet on the boat, who was getting off<br />\nversity and formerly at Minnesota.<br />\nat Martinique, and whom I had comGerhard Becker and Fred Noes,<br />\npletely forgotten.<br />\nmanager and editor, respectively of<br />\n\"You, Raison. I had never expect- the Collegiate Digest, will also aped to see you again,\" I mumbled. I pear on the program.<br /><br />\nFilth<br /><br />\nT(<br /><br />\n1313;<br />\nth<br />\nby<br />\nha<br /><br />\nME<br /><br />\nth(<br />\nth<br /><br />\nth<br /><br />\nOpi<br /><br />\n111<br /><br />\nno<br />\nau<br />\nre<br /><br />\ncic<br />\npr<br />\nth<br />\nel(<br /><br />\n1111<br /><br />\nmi<br /><br />\nth<br /><br />\nth<br /><br />\nCO<br /><br />\ngi•<br />\nIn<br /><br />\nin<br />\nPc<br />\nin;<br /><br />\nsP<br />\nth<br />\nal;<br />\nth<br />\nri(<br />\nul<br /><br />\nto<br />\nhE<br /><br />\nSc<br /><br />\na<br /><br />\nti<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br /><br />\n3<br /><br />\n.<br /><br />\nHand Ball Enters Frat Football<br />\nDarley Satisfied With Show<br />\nStarts Today<br />\nSecond Season<br />\nOf Blue Jay Gridiron Squad<br />\nTeam Returns In- 4 Divisions To Be Formed; 2<br />\nAfter Two Weeks Scrimmage Regular<br />\nRounds Scheduled; Playtact; Plan Large Schedule;<br />\nMeeting On Friday<br />\nTeam Has Learned Almost<br />\nAll Plays To Be Used In<br />\nOpener With Shoremen<br /><br />\n_ By KENNETH ZIERLER_<br /><br />\nNewcomers Promise<br /><br />\nShould All Sports<br />\nGet A Major H?<br /><br />\nJay Walks<br /><br />\n1<br /><br />\nThe question has been raised as to<br />\nwhat should constitute a major sport.<br />\nShould all sports be on an equal footing or should some be singled- out as<br />\ndeserving greater recognition ?Both sides of the question have<br />\npoints<br />\nto back them up. I might say<br />\nBy BERNARD D. PINCK<br />\nthat the discussion was started by<br />\nWith two weeks of scrimmage<br />\nsome members of a minor sport who<br />\npractice completed, Coach George thought they should get a major<br />\nDarley expresses satisfaction with letter.<br /><br />\nWard, Day, Schmidt, Popow<br />\nSupport Returning Men;<br />\nOtts Phillips Back Again<br /><br />\nthe progress which has been made<br />\nby the 1935 edition of Blue Jay football teams. With a fortnight still re-<br /><br />\n0-0<br /><br />\nTime Spent<br />\nIs Time Spent<br /><br />\nmaining before the initial dispute of<br />\nIn favor of giving the same award<br />\nthe season with Washington College foreall sports is the reas,oning that<br />\nthe grid men have learned almost all as much time is spent in practicing<br />\nfor one sport as for 'another. Time<br />\nthe plays which they will use in the<br />\nis time, whether it is for football or<br />\nOpener.<br />\nfor cross-country, and men who take<br />\nThe sights which can be seen at two hours a day off for practicing<br />\nHomewood Field almost any after- some sport deserve equal recognition,<br />\nnoon—punted balls soaring in the regardless of any discrimination in<br />\nair, Coach Eddie Lotz barking di- the gate value of the sport.<br />\nTo refute this we can draw a parrections at his aspirant linesmen, viallel. Let's say we have two medical<br />\ncious tacklers mowing down the<br />\nstudents; one going to Hopkins and<br />\npractice dummy—all give testimony one to a college of less renown. They<br />\nthat the development of a formidable both spend about the same time at<br />\neleven is well on its way. The funda- their work and they both graduate at<br />\nmentals of good tackling and block- the head of their respective classes.<br />\ning are being strongly emphasized<br />\nThe Hopkins M.D. will find himself<br />\nthis year. They are, according<br />\nto in a better position to secure an inDarley, the \"basis of football\", and<br />\nterneship than the other man. Bethus far the results have been encause Hopkins has a bigger name.<br />\ncouraging.<br />\n0-0<br />\nWard Promising<br />\nMany of the new candidates have<br />\ngiven very promising performances.<br />\nIn particular, Norbert Schmidt and<br />\nDay indicate that they are varsity<br />\nmaterial. Bob Ward, a freshman from<br />\nPoly, will no doubt be in the starting line-up, should he maintain the<br />\nsplendid showing he has made up to<br />\nthe present. An able punter, Ward<br />\nalso shows some ability in passing<br />\nthe pigskin. He is a capable ball-carrier, running well and having the faculty of following his interference.<br />\nPopow, another newcomer, appears<br />\nto be a potential lineman, although<br />\nhe has not, at yet, participated in<br />\nscrimmage because of injury.<br /><br />\nCompetition<br />\nAs The Standard<br /><br />\nThe Johns Hopkins handball team<br />\nis preparing for its second year of<br />\nintercollegiate activity.<br />\nWith every member of last year's<br />\nvarsity team reporting, the future<br />\nseems bright.<br />\nManager Dick Pasternak has contacted fifteen colleges and has prepared an intensive program.<br />\nAll candidates for the team are<br />\nurged to report to the gym on Friday at 4 o'clock. All those interested<br />\nin handball please communicate with<br />\nDick Pasternak, Postoffice box 781.<br />\nSince a system is being arranged<br />\nwhereby the gloves and handballs<br />\nwill be available at all times only,<br />\nhowever, to those who are interested<br />\nenough in the game to report at once.<br />\nSuccessful Season Foreseen<br />\nCo-captains Krell and Hernandez<br />\nhope to better last year's records of<br />\n4 wins and 1 loss against college<br />\ncompetition. Last year's season began with a victory over Western<br />\nMaryland on the Hopkins courts, but<br />\nwas followed by a loss in a return<br />\nmatch on Western Maryland's fourwall courts. This was followed by<br />\ntwo victories over Virginia and was<br />\nclimaxed by swamping our traditional rivals, St. John's.<br />\nAll the members of last year's<br />\nsquad have improved their game considerably through intensive practice<br />\nduring the summer.<br />\nThe members of the squad are Joe<br />\nKrell, Joaquin Hernandez, Ted Wiehe,<br />\nDick Pasternak, Red Glantz, M. Kramer, Dick Byer, Rosen, and N. Finkelstein.<br /><br />\nShuttlecock To Fly Again<br />\nThe Johns Hopkins undergraduate<br />\nbadminton team will start its schedule in the latter part of October at<br />\nMontebello Junior High School. The<br />\nHopkins gymnasium is no longer<br />\navailable because of future basketball games to be held there.<br />\nHowever, the team, bolstered up<br />\nby new blood from the incoming<br />\nfreshman class, expects to repeat last<br />\nyear's excellent season during which<br />\nthe team won four out of six matches,<br />\nthus placing well up among the leaders of the Baltimore Badminton<br />\nLeague.<br /><br />\nOffs To End Season<br />\nThe first round of inter-frat touch<br />\nfootball starts today with Phi Kappa<br />\nPsi vs. Tau Alpha Phi. Last year's<br />\ntouch football inovation was a great<br />\nsuccess, and it is expected that this<br />\nyear there will be even more enthusiasm and spirit shown in the fraternity competition.<br />\nThe fraternities are divided into<br />\nfour divisions, the winner of each to<br />\nmeet in semi-finals and utlimately<br />\nfinals to determine the champions.<br />\nRegular Weekly Competition<br />\nEach fraternity is to play at least<br />\none game a week, all postponed<br />\ngames played off on Monday afternoons and on Tuesday and Wednesday of the week beginning Monday,<br />\nOctober 18.<br />\nPlayoffs for the championship will<br />\ntake place on November 21, 22, and<br />\n26. The winners will be awarded a<br />\nbronze plaque.<br />\nSchedule For This Week<br />\nTuesday, Oct. 8—Phi Kappa Psi<br />\nvs. Tau Alpha Phi, Field No. 1; Kappa Sigma vs. Sigma Phi Epsilon,<br />\nField No. 2.<br />\nWednesday, Oc. 9—Delta Upsilon<br />\nvs. Phi Gamma Delta, Field No. 1;<br />\nPi Lambda Phi vs. Tau Alpha Omega, Field No. 2.<br />\nThursday, Oct. 10—Kappa Alpha<br />\nvs. Delta Phi, Field No. 1; Beta Theta Pi vs. Omicron Kappa Omicron,<br />\nField No. 2.<br />\nFriday, Oct. 11—Phi Sigma Delta<br />\nvs. Alpha Delta, Field No. 1; Alpha<br />\nTau Omega vs. Phi Alpha, Field No.<br />\n2.<br /><br />\nBoard For Frat Competition<br /><br />\nSprints Through<br />\nSportland<br /><br />\nFall Lacrosse<br />\nToStartSoon<br /><br />\nTHE RISE of Joe Louis to preeminence in the boxing game has, in<br />\naddition to driving sports writers to<br />\nthe dictionary in frantic search for<br />\nnew alliterative titles, recalled to<br />\nmany the deeds of the great fighters<br />\nof his race. Louis is in the best tradition of a line that runs all the way<br />\ndown from Tom Devereaux, who wazAmerican champion in 1810, to tn,<br />\nelusive Kid Chocolate, last of th t<br />\ngreat dusky warriors. He has, it ap<br />\npears, all the skill of Peter Jackson<br />\nand Joe Gans, coupled with the power<br />\nof Sam Langford and Joe Wolcott.<br />\nHowever, Jack Johnson, now a portly<br />\nHarlem gin salesman and once holder of the crown universally conceded<br />\nto Louis, still keeps hi.§ place in the<br />\nsun. It is all of twenty years since<br />\nLil' Ahthah, still wearing the famous<br />\n\"golden smile\", eased his great length<br />\nto the canvas in response to a wild<br />\npush of Jess Willard's, and, with one<br />\nhuge arm upraised to keep off the<br />\nblazing Cuban sun, placidly heard<br />\nthe fatal count; yet the legend of his<br />\nprowess still runs through the dark<br />\nbelt. Johnson's timing is said to be<br />\nstill so remarkable that he can pick<br />\nflies out cif the air. Unlike Joe Louis,<br />\nhowever, he blazed no meteoric trail<br />\nto the top. In fact, during the early<br />\npart of his career, Johnson lost three<br />\nfights in one week.<br />\nALTHOUGH the obsequies may be<br />\na trifle premature, it appears at this<br />\nwriting as though the Chicago Cubs<br />\nare going to be the first of nineteen<br />\nhundred and thirty-five's \"destiny<br />\nriders\" to fail in achieving the ultimate triumphs. In a year which produced Sam Parks, Wilmer Allison,<br />\nand Jimmy Braddock, the men of<br />\nGrimm seem unable to overcome the<br />\ntwin bugaboos of bad luck and form.<br />\nA Cub victory would be a fitting climax to a topsy-turvy year, as well as<br />\nwarming the hearts of sports fans,<br />\nwho are romantics to the care. Whatever the result, the Chicagoans have<br />\nproved themselves worthy of the<br />\n\"miracle team\" title, both in point<br />\nof perforthance and courage. Galan<br />\nand Demaree, two of the year's prize<br />\nrookies, have been particular shining<br />\nlights.<br /><br />\nThere will be a meeting of representatives from all fraternities on<br />\nWednesday, October 9, at 8 p. m., in<br />\nLatrobe Hall.<br />\nThe object of the meeting is to<br />\nelect an Interfraternity Athletic<br />\nBoard having absolute control and<br />\nsupervision over all interfraternity<br />\nathletic competition. These activities<br />\nwill include touch football, box lacrosse, volleyball, basketball, and<br />\nsoftball.<br />\nPi Lambda Phi Fraternity is aso<br />\nSPEAKING of Joe Louis calls to<br />\nendeavoring to organize an interframind the name of that rather obscure<br />\nternity ping-pong league, which will<br />\nfigure, Max Baer. The Livermore Laralso come under the supervision oT<br />\nruper, on whose every thoughtless<br />\nBoard.<br />\nAthletic<br />\nInterfraternity<br />\nthe<br />\nword an adoring public once hung,<br />\nand who in his heyday inspired nearly as much metaphor as the Brown<br />\nBomber, now finds himself useful<br />\nChestertown<br />\nOct. 19—Washington at<br />\nonly as the subject of several highly<br />\nSwarthmore<br />\n26—Swarthmore<br />\nat<br />\nOct.<br />\nmoral studies of the inevitable toll of<br />\nNov. 2—Mt. St. Mary's at<br />\nHomewood the primrose path.<br /><br />\nLeagues To Be Formed For<br />\nInterclass Activity; Begin<br />\nPractice Next Week<br />\nDr. Wilson Shaffer, Director of<br />\nAthletics, has announced that fall lacrosse activity will begin in the near<br />\nfuture.<br />\nThe activity will be conducted in<br />\nsuch a manner that it will serve a<br />\ndouble purpose. Firstly, leagues will<br />\nbe formed to act as a means of interclass activity. Secondly, it will<br />\ngive Dr. Morrill and his assistants<br />\nan opportunity to survey the players<br />\nand obtain an accurate determination<br />\nof the type of players who will be<br />\navailable for spring drill.<br />\nCall For Men Next Week<br />\nThe official fall call for lacrossemen will not be made until October<br />\n14. However, contestants may practice at any time in the lower field.<br />\nThe sophomores will be divided into a number of teams participating in<br />\nthe sophomore league which will play<br />\none day a week. Several freshman<br />\nteams will also be organized into a<br />\nweekly league. Days on which no<br />\ngames are scheduled will be set aside<br />\nfor general practice.<br />\nWinners To Meet<br />\nThe winners of the freshman and<br />\nsophomore leagues will then be placed<br />\ntogether with<br /><br />\npicked teams composed of juniors and seniors to determine the class championship.<br />\nThere will be fivd men to a team<br />\nand the regular lacrosse rules will<br />\ngovern, except that there will be no<br />\ngoalie or offside ruling.<br />\nThe activity will be personally supervised by Dr. Morrill, assisted by<br />\nRoland Levy and Frank Dotterweich.<br /><br />\nPerhaps the biggest argument<br />\nagainst a single award system is the<br />\nmere presence of the more athletictised lethal quality of the bright lights<br />\nally inclined concentrated in a few<br />\nhas proved too often so much damp<br />\nsports rather than spread evenly over<br />\npowder. The training grinds of the<br />\nthe repertoire of activities.<br />\nold fighters are best characterized<br />\n. be a good<br />\nFor example, soccer may<br />\nby John L. Sullivan's \"shave and<br />\ngame requiring plenty of ability, but<br />\nhaircut\", and the desultory shadowit could never be a major sport here<br />\nboxing with which Abe Attell began<br />\nas long as the best players keep gohis preparations five minutes before<br />\ning out for football. It's as though<br />\nthe bell. And, even today, Maxie Rowe had two math sections; one for<br />\nsenbloom is still baffling younger<br />\nbrighter students and one for the less<br />\nand soberer opponents with twinkling<br />\nDoes the<br />\nmathematically inclined.<br />\nhands and dancing feet, which know<br />\nman who heads the slower section at<br />\nas well wax floor as the resined canthe end of the year rate on a par<br />\nBishop Blocking Back<br />\nThe wrestling team, headed by<br />\nvas. Greatest of all is Mickey Walkwith the man who heads the faster<br />\nBill Bishop, who was mauled about<br />\nCaptain Gelber, held their first pracsection?<br />\ner, who, after seventeen years of<br />\nin the line last year, has been contice last Thursday. Most of last year's<br />\nhighly improper living, is so far from<br />\nI don't think so, either.<br />\nverted into a back for the forthcomregulars have returned, including ex0-0<br />\nthe hour of reckoning as to boast of ,<br />\ning campaign. He is the outstanding<br />\nCaptain Croxton McDaniels.<br />\nCommendable as this crusading regaining the middleweight title \"at<br />\nHomewood<br />\nJohn's<br />\nat<br />\n16—St.<br />\nNov.<br />\nblocking -back on the squad. Charlie<br />\nPlaces are open in the light and<br />\nspirit is, however, the much-adver- any time now.\"—J. M. K.<br />\n23—Haverford at Homewood<br />\nKelly will undoubtedly handle the<br />\nheavyweight division and newcomers Nov.<br />\npassing duties this year. An experipractice evWhile we're on the subject of ma- are requested to attend<br />\nenced veteran, Kelly hurls the spherThursday.<br />\nery<br />\njor letters, we might insert a bit<br />\noid with more ability than any other<br />\nAs yet, the schedule is not final,<br />\nabout the gymboree.<br />\ncandidate. George Kahl will, in all<br />\nwill be announced in the near<br />\nLast year no provision was made but it<br />\nprobability, be the fourth member<br />\nfuture)<br />\nThe first meet will be held on<br />\npurin the athletic budget for the<br />\nof the backfield quartet. A promisAlumni Day when the gym will be,<br />\nThe<br />\nfor<br />\nawards.<br />\nsweaters<br />\nchase of<br />\ning punter, George is also a fair<br />\nopened officially.<br />\nreason was the general financial conpasser and an evasive runner.<br />\nin<br />\nis<br />\nflat<br />\nwhich<br />\ndition of the world,<br />\nlacrosse players.<br />\nTed Graziano and Bernie Vincenti, spite of Columbus' attempt to prove sweaterless<br />\nIt is hoped that by taking in<br />\nboth of whom saw action last year, the contrary.<br />\nenough money at the gymboree a<br />\nare back in the fold. Baum, a sophAs a result, it was decided to put sweater fund can be established. This<br />\nprogressing<br />\nto<br />\nDaromore, has been<br />\non a gala circus at the gym with fund is expected to grow with each<br />\nley's satisfaction and gives promise the basketball<br />\nteam playing a game gymboree until finally there will be<br />\nof being a versatile back. The men- and tumbling<br />\nand wrestling and box- enough quarters to order the sweattor also feels sure that he has a foot- ing exhibits also on the card. Adball player in Jack Kaufman. A fast mission was two bits—or as some ers ahead of time so that a man can<br />\nsoon as<br />\nman and a good runner, Kaufman say, twenty-five cents. The receipts actually get his sweater as<br />\nhe earns it instead of having to wait<br />\nhas the making of a splendid punter;<br />\nwere to be used to buy H sweaters. for the next solar eclipse as has been<br />\nhe has the dig and drive and it is<br />\n0-0<br />\nthe quaint custom in the past.<br />\nexpected that a little experience will<br />\nThis happy day has tentatively<br />\ngive him whatever finesse is needed.<br />\nbeen set at the day before we are all<br />\nHalbert, Mehling, Centers<br />\ndrafted to fight for Ethiopia, in which<br />\nThe first annual gymboree was not<br />\nThe center post appears to be<br />\ncase it would be better to award<br />\nBeing an unqualified success. It didn't take nightgowns.<br />\nclinched by Hersh Halbert.<br />\ngroomed as a reserve center is Bill in enough to buy all the sweaters for<br />\no—o<br />\nMehling, a converted end. A good the year, probably because it was artackler and blocker, he is not as yet ranged only a short time before it<br />\nquite proficient in passing the ball. was to take place. The rest of the<br />\nmoney came during June Week from<br />\nDon't get the idea that the quarFlanking the center will probably<br />\nTHOUSANDS of years ago, a skin-clad workman pounded away with<br />\nbe Tom Ellis and Otts Phillips hold- a benefit lacrosse game—benefit of ter you shell out for the gymboree<br />\na cobblestone on a slab of hard rock. In a few years, that slab might<br />\nwill be purely for charity. You will<br />\ning down the guard berths. Jim Hop- sweaterless lacrosse players.<br />\nbe passably square and smooth.<br />\naddition,<br />\nThis year the budget again slipped get your money's worth. In<br />\nkins, Bob McGuire, Crox McDaniels,<br />\ndown<br />\nbusy machines, supervised by trained workmen, pare off crisp,<br />\nsweater<br />\ndeep<br />\nproposition<br />\nso<br />\nwill<br />\nfeel<br />\nToday,<br />\nthe<br />\nthat<br />\nyou<br />\non<br />\nglow<br />\nup<br />\nthat<br />\nand John Royster are tackle possibilribbons<br />\nfrom whirling blocks of steel, as one would unwind riblook as though the mat- inside will be a glow of satisfaction,<br />\ncurling<br />\nbegins<br />\nto<br />\nit<br />\nities. Hopeful of varsity honors in<br />\na<br />\nspool,<br />\nshaping the metal to a thousand purposes — to an<br />\nmild<br />\nfrom<br />\na<br />\nbecome<br />\na<br />\nquenching<br />\nto<br />\nbon<br />\nabout<br />\nhabit.<br />\nunless<br />\nyou've<br />\nbeen<br />\nwere<br />\nthe end positions are Iry Leberfeld ter<br />\nwithin<br />\naccuracy<br />\na<br />\nfew<br />\nten-thousandths of an inch.<br />\napplication of<br />\nretaliating<br />\nby<br />\nmaking<br />\ninternal<br />\nan<br />\nShaffer<br />\nis<br />\nthirst<br />\nwith<br />\nDr.<br />\nDon Naylor, Pete Swindell, and Day.<br />\nthe gymboree a conditioned reflex. rubbing alcohol.<br />\nCARBOLOY—<br />\na<br />\ntool material developed by General Electric<br />\nmodern<br />\nSpirit Excellent<br />\nThe program for the second anIt is rumored by unreliable sources<br />\nresearch—has made possible this speed, this precision. It cuts materials<br />\nCoach Darley is particularly im- that he has already had tickets print- nual gymboree has not as yet been<br />\nhitherto unworkable — cuts faster and holds its edge longer than steel<br />\npressed with the active enthusiasm<br />\ntools—can be run at red heat without losing its temper.<br />\ned marked as far ahead as the four- mapped out, but it will, in all probdisplayed by his squad this year. teenth annual gymboree.<br />\nibility, include a basketball game<br />\nCARBOLOY is only one of the contributions made to improved indus\"The spiriU is excellent,\" he ex(well worth the price of admission)<br />\n0-0<br />\ntrial processes by G-E reseach—research that has saved the public from<br />\nclaimed. \"The men like the game and<br />\nboxing (well worth the price of adten to one hundred dollars for every dollar earned for General Electric.<br />\nlike to play it. They are interested in<br />\nmission), wrestling (well worth the<br />\n96-188FBI-2<br />\nlearning. In my twelve years of exprice of admission), and tumbling<br />\nperience at Hopkins they are one of<br />\nThat is to say, we may expect to (ell worth the price of admission).<br />\nthe finest squads I've seen.\"<br />\nIt is also well worth the price of<br />\nsee the second annual gymboree this<br />\nAt the present time the squad has winter. It's being plugged ahead of admission to come to see what it<br />\nmastered the fundamental plays. Be- time so that enough quarters will be looks like to see 799 other fellows<br />\nfor the Washington game variations taken in to do away with the possi- come to see what it looks like to see<br />\n•<br />\nwill have been added.<br />\nbility of a second annual benefit of 800 fellows in the Hopkins gym.<br /><br />\nGrunters Grovel In Gym<br /><br />\nFootball Schedule<br /><br />\nRemember<br />\nThe Gymboree?<br /><br />\nBudget Again<br />\nNeglects Sweaters<br /><br />\nWell Worth<br />\nPrice Of Admission<br /><br />\nProvide Awards<br />\nOn Schedule<br /><br />\n'Maki nom VD 24111<br /><br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., OCTOBER 8, 1935.<br /><br />\nMusical Club<br />\nMakesPlansFor<br />\nComing Year<br />\nOpportunities On Business<br />\nStaff Offered For All Students, Says Murphy<br /><br />\nGrad Students Will Hopkins To Choose<br />\nGraduate Student In Political<br />\nScience Relates Experiences Hold Dance Oct 18 Delegation Forl 2th t<br /><br />\nBrother Of Donor<br />\nOf Levering, Dies<br /><br />\nThe first graduate reception and<br /><br />\nJoshua Levering, twin brother<br />\nof Eugene Levering, who donated<br />\ngifts which made possible the<br />\nbuilding of Levering 1Hall, died<br />\nSaturday night after a month's<br />\nillness.<br />\nMr. Levering was well-known as<br />\nthe candidate for President of the<br />\nUnited States on the Prohibition<br />\nparty ticket. He was also onetime candidate for Governor of<br />\nMaryland and State Comptroller.<br />\nHe and his twin brother were<br />\nborn in 1845. Eugene Levering<br />\ndied August 2, 1928.<br /><br />\n(Continued from Page 1, Col. 5)<br />\n\"Here I have time to study as I<br />\nlike,\" he said, \"and it is always an<br />\nhonor for one to be able to say that<br />\none has studied at the Johns Hopkins<br />\nUniversity.\"<br /><br />\nwould freeze solid on the windowpanes. Out of curiosity he has had<br />\nhimself lowered into crevasses in glaciers. That corresponds to walking<br />\ninto a cage to find out whether or<br />\nnot the lion is carniverous.<br /><br />\nIncidentally, he practiced law for<br />\na year and a half in Germany as<br />\nwhat he described as a \"junior lawyer.\"<br />\nHe has traveled over most of Europe and almost half the United<br />\nStates. \"Something new has happened to me everywhere I went,\" he<br />\nsaid, but he insisted that none of the<br />\nincidents would be interesting; in<br />\nfact, he said that sorhe were \"embarassing and not fit to print,\" whin<br />\nmakes it certain that they are interesting.<br /><br />\nShot Mountain Rapids<br />\nDescending these mountains, Stern<br />\nhas ported a canoe until he reached<br />\nthe region of melting snow. Here he<br />\nhas shot swirling mountain rapids<br />\nWhile skiing he has seriously frozen the tips of all his fingers and has<br />\n\"broken many a ski but never a<br />\nbone.\"<br /><br />\nAn opportunity for all students<br />\nwhether they are musically inclined<br />\nor not, to attain positions on the<br />\nbusiness staff of the Johns Hopkins<br />\nMusical Club, was announced the<br />\nother day by John L. V. Murphy, Jr.,<br />\npresident of the organization.<br />\nHe has also done rock mountain<br />\nBy giving all students a chance to<br />\nclimbing. In fact, he was a guide for<br />\nparticipate in the organization's acone summer at the Oetztan.i. Mountivities Murphy hopes that the Musitain.<br />\ncal Club will take on a more incluHis well-built body is proof of his<br />\nsive character.<br />\nHe has been skiing and mountain activity, and though he has told me<br />\nThis, Murphy continued, will give<br />\nclimbing for the past eleven years.<br />\na whole host of incidents, he has refreshmen who are interested in muCamped for two weeks in the re- fused to let them be printed. The<br />\nsical appreciation a splendid opporgion of eternal snow in a cottage best thing to do is to see him at his<br />\ntunity to make connections with this Dr. W. F. Albright, W. W.<br />\n9,000 feet up on a mountain, Stern desk in the political sciences ,Pbrary<br />\ngreat campus organization.<br />\nAlso,<br />\nSpence Professor, Plans tells how the vapor from his breatli and ask him about them.<br />\nthat in order to compensate these<br />\nReturn<br />\nTo America in Feb.<br />\nboys, two junior and the one senior<br />\nbusiness managers will be taken on<br />\nProf. W. F. Albright, holder of the<br />\nall trips.<br />\nW.<br />\n. Spence professorship of Semitic<br />\nThe servies of Osmar P. Steinwald,<br />\na prominent professional musician Languages in the School of Higher<br />\nof this city, and also director of the Studies of the Johns Hopkins UniA reception dinner will be given<br />\nGlee Club and of the Blue Jay Or- versity, has resigned as director of Boycotts \"Red Salute\" As Protest by the Friendly Relations Society on<br />\nchestra last year, has been secured the American School of Oriental ReOctober 19. President Isaiah BowAgainst \"Vulgar Misleading Atfor this winter's seaSon. Positions search in Jerusalem, Palestine, and<br />\nman will probably attend.<br />\ntack Upon Peace Struggle\"<br />\nfor saxaphones on the Blue Jay Or- is scheduled to return to this counIf any students are interested in<br />\nchestra are still open.<br />\nRehearsals try late in January<br />\ndelegation of students represent- this organization, it is suggested<br />\nA<br />\nDuring the past two years Profesfor tenors in the Glee Club will take<br />\ning the Hopkins National Students that they see Daniel DeLima before<br />\nplace this Thursday at 7:30 p. m. sor Albright has divided his time bethe day of the reception. Whether<br />\ntween his duties at the University League and the American League<br />\nBasses on Mondays at 7:30 p. m.<br />\ninterested or not, foreign students<br />\nand at the American School in the Against War and Fascism protested<br />\nAddressing candidates for the<br />\nare urged to report to the \"Y\" secHoly Land. Upon his return he plans<br />\nthe showing of \"Red Salute\" at the retary's office as soon as possible.<br />\nGlee Club at the last meeting, Presito devote his time to the professordent Murphy explained that in view<br />\nCentury Theater this past Friday and<br />\nship at the Hopkins.<br />\nof the excessive turnout, a willing<br />\nNo excaations are being made by Saturday by distributing circulars Bowman To Address<br />\nand faithful man would be more deProfessor Albright this year.<br />\nA denouncing the cinema to theaterFriends of Library<br />\nsirable than just a good voice. He<br />\nlearned author, he is busy working goers.<br />\nalso asked those candidates for the<br />\nover reports concerning his finds durDr. Isaiah Bowman, President of<br />\nAfter futile attempts to prevent<br />\nGlee Club who could play a musical<br />\ning the recent years. His wife and<br />\nJohns Hopkins University, will<br />\nthe<br />\ninstrument or two not to be hesitant<br />\nthe showing of the cinema in the thefour children accompanied him to<br />\naddress the first meeting of the<br />\nand come out for either the Blue Jay<br />\nater by sending an open letter to the<br />\nPalestine this summer.<br />\nFriends of the Library. Dr. John C.<br />\nOrchestra, Banjo Club or the Hawaimanager requesting him to drop the French, librarian, announced that no<br />\nWas Delegate At Rome<br />\nian Troupe.<br />\nHe was official delegate of the picture from the theater's schedule, date had been set for the gathering,<br />\nThe Musical Club is one of the<br />\nUnited States government at the the N. S. L. and the A. L. W. F. but that it would take place early in<br />\noldest campus activities, established<br />\n19th International Congress of Orienin 1885 by the late President Wooddecided to appeal to the theater-goers November.<br />\ntalists, held at Rome, Italy, during<br />\nrow Wilson, Albert Shaw, editor of<br />\nChair- of Baltimore to boycott \"Red Salute.\"<br />\nthe week of Sept. 23-29.<br />\nthe Review of Reviews, Newton D.<br />\nThe following are excerpts from<br />\nman of the American delegation and<br />\nBaker, ex-Secretary of War, and a<br />\nrepresentative of the American Ori- one of the circulars:<br />\nWANTED<br />\nnumber of other renowned associates.<br />\nental Society, of which he was elected<br />\n\"Wherever it is being shown<br />\npresident in April, he was the sole<br />\nCounsellors With Followings For<br />\nthroughout the length and breadth of<br />\nFreshman Commission<br />\nAmerican present at the sessions.<br />\nExclusive Boys' Camp<br />\nOther members of the U. S. delega- America, the moving-picture, \"Red<br /><br />\nResigns Position In<br />\nAmerican SchoolOf<br />\nOriental Research<br /><br />\nN.S.L. Denounces<br />\nFilm Propaganda<br /><br />\nTo Be Selected Soon<br /><br />\nMembers of the Freshman Commission will be selected at an early<br />\ndate by the Hopkins \"Y\" Cabinet, it<br />\nwas learned today.<br />\nThe group is composed of twentyfive members. The selection of the<br />\nstudents is determined by contacts<br />\non the campus and at Freshman<br />\nCamp. High school records also are<br />\nconsidered.<br />\nEvery Tuesday evening the Commission meets, and on those Tuesdays on which the Supper Club is<br />\nheld, the meeting is combined with<br />\nthat of the Supper Club.<br />\nThe Commission, which is a campus activity, has achieved much<br />\npopularity among freshmen.<br /><br />\n4rchaeologist Refutes<br />\nArticle In Hearst Paper<br />\n(Continued from Page 1, Col. 1)<br />\nof Alexander the Great, because he<br />\nlost an eye while attacking the city.<br />\nAs a result of this, Philip utterly destroyed the town. The layout of the<br />\ncity, sanitary equipment, kitchen<br />\nutensils, etc., are gone into in great<br />\ndetail. The article is illustrated with<br />\npictures showing excavated Olynthian bathtubs, a kitchen vessel, a<br />\nterra-cotta figurine of Hermes, a terra-cotta vase in the form of a head,<br />\nand a painting by H. Schneider showing Greek women dancing in a temple<br />\nof Bacchus before the image of the<br />\ngod.<br /><br />\nJoin<br />\nThe<br />\nNEWS-LETTER<br />\nStaff<br /><br />\ntion believed conditions caused by<br />\nthe Italo-Ethiopian situation were<br />\ntoo serious, and did not attend.<br />\nProfessor Albright was called to<br />\nthe Johns Hopkins in 1929 to fill the<br />\nchair of Semitic Languages left vacant by the death of Dr. Paul Haupt,<br />\nwho held the position from 1883 till<br />\n1926. For the three years following his<br />\nappointment Professor Albright gave<br />\nhis time to his new duties, not continuing as acting head of the American School of Oriental Research.<br /><br />\nHopkins Library Staff<br />\nHandicapped By Illness<br /><br />\nFriendly Relations<br />\nGroup Will Meet<br /><br />\nLuther Norem, will be held Friday,<br />\nOctober 18, in Levering Hall.<br /><br />\nStuart Le Compte, soloist, and Dr.<br /><br />\n1<br /><br />\nof Music.<br /><br />\nA delegation from the Hopkins will<br />\nPresident Isaiah Bowman is ex- be chosen soon by a local<br />\ncommittee<br />\npected to speak. Following this proto represent the University in the H<br />\ngram there will be dancing to the<br />\nTwelfth Quadrennial Student Volunmusic of Ed Norwood's orchestra.<br />\nteer Convention, to be held December<br />\n28 to January 1, at Indianapolis.<br />\nROBINSON SPEAKS ON COINS Several thousand students are expected to attend from the United s<br />\nLast Thursday, October 3, Dr. States and Canada.<br />\nDavid M. Robinson, Johns Hopkins<br />\nThe speakers at the convention will<br />\nUniversity archaeologist, delivered include Dr. T. Z. Koo, Reinhold Nie- R<br />\nan address to the Baltimore Coin buhr, Toyohiki Kagawa, Henry P.<br />\nClub on the topic, \"Early Greek and Van Dusen, Robert E. Speer, John<br />\nRoman Coins.\"<br />\nR. Moot and others. Those wanting to<br />\nThe talk was illustrated by a show- attend should get in touch with meming of actual coins, many taken from bers of the Cabinet or Board of Manthe Olynthian excavation.<br />\nagers of the Hopkins Y. M. C. A.<br />\nbc<br />\npr<br />\nif•<br />\n0.••••••••••••••••••••••••••••••••••••••••••••••••••••••••••«••••••••••••••••?<br /><br />\nPEABODY<br />\nPHARMACY<br /><br />\nI<br />\nI CALVERT<br /><br />\nand 30TH STREETS<br />\nWe Sell Drugs and Give Service I<br /><br />\nAmerican schools and universities. It<br />\nis a planned and slanderous assault<br />\nalso upon the millions of other patriotic Americans in every walk of<br />\nlife who,share with the students the<br />\ndesire for peace and happiness and<br />\nthe refusal to see the genius and<br />\nyouth of our country again devoted<br />\nto the collective suicide of humanity.\"<br />\n\"We students believe that we have<br />\nshown you how to act. Boycott 'Red<br />\nSalute': protest its showing to the<br />\nmanager of every theater at which<br />\nit appears, write to the producers.<br />\nDefend and support the American<br />\nstudent struggle for peace!\"<br /><br />\nWILLIE HUGH<br />\nLAUNDRY<br />\nSpecial Price for Hopkins Men<br />\n2815 GREENMOUNT AVE.<br />\nCHesapeake 5474<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br /><br />\nYou get efficient service.<br /><br />\nEl<br /><br />\nHUTZLER 13K1F1-1EM E<br />\nEAT AT THE<br /><br />\nBOULEVARD<br />\nRESTAURANT<br />\n3226 GREENMOUNT AVE.<br /><br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and. 33RD STREETS<br />\nNext To Birely's<br />\na -.....<br /><br />\n,<br />\n•••,,ILW<br />\n,<br />\n.1r<br />\n,<br />\n...^..V,I,O.•./V<br />\n,<br />\n.1•VP<br />\n,<br />\n....,111<br />\n...OW,M.P<br />\n,<br />\n-.--.1... a...a•<br /><br />\n-<br /><br />\n..,1..../..•••vilP.....,,e1.,./,..1..../,..,......1<br /><br />\nNORTH INN<br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever_l<br />\n—.......-<br /><br />\nA COLLEGE PROFESSOR DISCOVERED<br />\nThat Often It Isn't a Student's Brain but his Pen<br />\nthat Buns Dry—causes Failure—in Classes and Exams!<br />\nSo he invented this sacless Vacumatic, and Parker engineered it to perfection—gave it<br />\n102% more Ink Capacity—made its Ink Level VISIBLE,so it suddenly can't go empty!<br /><br />\nCHARLIE DER1<br />\nFirst Class Laundry<br />\n3224 GREENMOUNT AVE.<br />\nQuality Hand Work at Our<br />\nLow Prices<br />\n-<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place<br />\nBaltimore<br /><br />\nhow pens that run<br />\nout of ink slow down classes, demoralize thinking, and bring marks<br />\nthat no student wants to write home<br />\nabout.<br />\nHis observations led to the birth of<br />\nthe revolutionary Parker Vacumatic.<br />\nThis miracle pen writes 12,000 words<br /><br />\nYour Nearest Dealer is<br /><br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br /><br />\nrarLer<br />\nMIM-d—rACUALLITIC:c14<br />\nGUARANTEED MECHANICALLY PERFECT<br /><br />\nJunior, $5<br />\nOver-Size, $10<br /><br />\nPencils, $2.50,<br />\n$3.50 and $5<br /><br />\nh;<br />\nr(<br /><br />\nIT<br /><br />\nLAfayette 4519<br /><br />\nES, a scientist on the faculty of<br />\nY<br />\nthe University of Wisconsin was<br />\namazed to find<br /><br />\nin<br />\nat<br />\ndl<br />\nas<br />\n\"c<br /><br />\nr<br /><br />\n•••••••••• ••••••••••••••••••••••• • NI •••••••••••••••••••••••01..11....• •<br /><br />\nLowell Thomas, nationally known<br />\nnews commentator, lecturer and author, will present one of the series<br />\nof University Lectures on December<br />\n10, and will speak on \"Some Important Issues Demanding Action Today.\"<br />\nThe series of lectures, sponsored<br />\nby the Johns Hopkins Y. M. C. A., is<br />\nbeing held at the First Methodist<br />\nEpiscopal Church, which is located<br />\nat St. Paul and Twenty-second Sts.<br /><br />\nA:<br /><br />\nPrices are reasonable.<br /><br />\nThree illnesses in the staff of the<br />\nlibrary are proving a handicap, Dr.<br />\nJohn C. French, librarian of the University, announced today. The absence of Miss Ethel Hubbard,' Miss<br />\nCatherine Dudley and Miss Frances<br />\nJordan, who is recuperating in the<br />\nmountains of North Carolina, is sore+<br />\nly felt. But all are recovering rapidNEW YORK<br />\n+<br />\nly and are expected to return in the +<br />\n:LOAN OFFICE:<br />\nnear future.<br />\n;<br />\nLOANS<br />\nAt the college reserve Mrs. Wil++<br />\nlem Wirtz is taking the place of<br />\n.<br />\n—<br />\n+<br />\nMiss Nancy Lanier, who is absent on<br />\n=<br />\nUnredeemed Microscopes<br />\n++<br />\ni<br />\nleave taking a course in the Library + Cameras, Binoculars, Musical +<br />\n+<br />\n+<br />\nSchool of Columbia University. Mrs. +<br />\nInstruments, Typewriters<br />\n+<br />\n4<br />\n+<br />\nWilthe<br />\nlate<br />\nWirtz is the widow of<br />\nlem Wirt, whose work gave him a i<br />\n+<br />\n+<br />\n+<br />\n118 N. LIBERTY STREET<br />\nhigh place in Baltimore art and music +<br />\n,<br />\n+<br />\n+<br />\ni<br />\nPLaza 3495<br />\ncircles.<br />\n+<br />\n+<br /><br />\nLowell Thomas To Speak<br /><br />\nta<br />\nse<br /><br />\nWhat you want is easy to find.<br /><br />\nCall Harold Speert<br /><br />\ngle for peace which is being conducted by the student body of ,our<br /><br />\nExpect Several Thousand<br />\nStudents From United<br />\nStates, Canada, To Attend<br /><br />\nPetran, of the Peabody Conservatory<br /><br />\nmisleading piece of militaristic propaganda is an attack upon the strug-<br /><br />\nThere<br /><br />\nwill be a musical program including<br /><br />\nSalute\" is meeting with widespreaZ<br />\nprotest and picketing. This vulgar<br /><br />\nStudent Convention -=<br /><br />\ndanc, under the chairmanship of<br /><br />\nfrom a single filling—shows when it's<br />\nGo and try writing two different<br />\nrunning low—tells when to refill!<br />\nways with its Reversible Point—solid<br />\nAny good store selling pens will Gold combined with precious Platshow you how the Parker Vacumatic inum—skilfully fashioned to write on<br />\neliminates 14 old-time parts, includ- both sides—slightly turned up at the<br />\ning the lever filler and rubber ink sac tip so it cannot scratch or drag, even<br />\nfound in sac-type pens.<br />\nunder pressure!<br />\nAnd due to this,it has<br />\nDo this and you won't<br />\nWRITES TWO WAYS<br />\ndouble room forink,withlet an old pen impede<br />\nout increase in size.<br />\nyour learning another<br />\nhifitt•<br />\nBut don't think that<br />\nday. The Parker Pen<br />\n-exAz<br />\n4,<br />\nsacless pens containing<br />\nCompany, Janesville,<br />\nsquirt-r<br />\n‘un pumps are like<br />\nWisconsin.<br />\nParker s patented VacuSend a Post Card for Free Botmatic. This new creation<br />\ntle of Parker Quink—the marcontains none of these.<br />\nvelous new quick-drying, penThat's why it's GUARAN-<br /><br />\nt<br /><br />\nTEED MECHANICALLY<br />\nPERFECT!<br /><br />\nati.,./.40nct<br />\neipsue<br /><br />\nWITHOUT ADJUSTMENT<br /><br />\ncleaning ink, and throw your<br />\nblotter away. Address Dept.<br /><br />\n712.<br /><br />"}], "field_media_file": [{"target_id": 38962, "display": null, "description": null, "target_type": "file", "target_uuid": "6e576344-ad56-41f1-a4a2-008c31ba138c", "url": "http://digital.library.jhu.edu/system/files/2022-03/12639-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12639, "target_type": "node", "target_uuid": "f02e7ea0-3c96-43dc-87ed-b7c3637a6ee9", "url": "/node/12639"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "09fed091-4db0-480d-bd34-41590988af61"}]}