{"mid": [{"value": 36643}], "uuid": [{"value": "3ea7a96d-9920-4714-8085-a06a8f690631"}], "vid": [{"value": 36643}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:50:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12956-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:50:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:50:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 2<br />\nFRESHMAN RECEPTION TONIGHT IN C. E. HALL<br />\nInteresting Evening to Be Provided.<br />\nStudent Council Will Superintend<br />\nAnnual Scrap at Close.<br />\n<br />\nBALTIMORE, MD., OCTOBER 7, 1921<br />\nALUMNI SCHOLARSHIPS<br />\nSOON TO BE ESTABLISHED<br />\nWill Be On Order of Rhodes Scholarships. $50,000 Fund to Be<br />\nCollected.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS THE FAVORITE<br />\nIN TOMORROW'S CLASH<br />\n<br />\nAccording to the plans of the<br />\nThe game with Deleware, toHopkins Alumni Association,<br />\nJohns<br />\nThe Freshman reception to be<br />\nLINEUP<br />\nmorrow, will probably find sevgiven in the C. E. Building on a new scholarship, very similar to<br />\neral changes in the lineup of the<br />\nFriday, October 7, at 8 P. M., will the Princeton Alumni Scholarship,<br />\nDELAWARE<br />\nJOHNS HOPKINS<br />\nBlack and Blue as the coach<br />\nbe held this year under the joint is soon to be established. The aim<br />\nwishes<br />\nto try out as many promisL. E.<br />\nMatraw<br />\n(1)<br />\n(1) Middleton<br />\nauspices of the Y. M. C. A. and of this scholarship, which shall be<br />\nmen<br />\nas possible. Delaware has<br />\ning<br />\nthe Student Council. The Y. M. known as the Johns Hopkins Alum(21) Westerman or<br />\nthus far had a rather bumpy road<br />\nC. A. will provide the main pro- ni Scholarship, is to counterbalance<br />\ntravel. While Hopkins was<br />\nto<br />\nL. T.<br />\nHolton (Capt.)(2)<br />\nMagill<br />\ngram in the way of speakers, mu- the existing scholarships which recdowning Mt. St. Mary's last Satsic and refreshments, while the ognize solely the students' mental<br />\nL. G.<br />\nAkin<br />\n(5) Barton<br />\n(3)<br />\nurday the Blue Hens were being<br />\nStudent Council will take charge ability. It is believed that such<br />\ntrampled<br />\nunder by Muhlenberg<br />\nSelby<br />\n(4)<br />\n(31) Cromwell<br />\nof the Freshman-Sophomore rush scholarships will attract more allUniversity to the tune of 21-0. The<br />\nR. G.<br />\nHuff<br />\n(8) Hardy<br />\nwhich will follow immediately around men to Hopkins.<br />\n(5)<br />\nlosers played a rather weak ofafter the reception. The Y. M. C. The plans, as developed by the<br />\ngame, allowing the ball to<br />\nfensive<br />\nR. T.<br />\nRepp<br />\n(4) Knecht<br />\n(6)<br />\nA. will provide a very interesting Association, have met the entire apremain in the possession of their<br />\nManning (7)<br />\n(11) Rich or Turnbull R. E.<br />\nprogram with speeches by Dean proval of the faculty. Appointment<br />\nopponents most of the time.<br />\nLatane, of the Faculty; Mr. Lev- will depend upon qualifications sim<br />\nMagee<br />\n(6) Darley or Wilson Q. B.<br />\nOn the Saturday previous Del(8)<br />\nering, of the Trustees; a represen- ilar to those required of a Rhodes<br />\naware met the heavy University of<br />\nMacDonald (9)<br />\nR. H. B.<br />\n(29) Willis<br />\ntative of the Y. M. C. A.; Joe cholar. The candidate for the<br />\nPennsylvania team and was delThompson, of the 0. D. K. So- scholarship must meet the usual<br />\nJackson<br />\n(14)<br />\n(7) Spinney or.Coady L. H. B.<br />\nuged under a 89-0 score, Penn<br />\nciety; Dick Wood, of-the Student eligibility requirement of the Unia number of second string<br />\nusing<br />\n(19) Markell or<br />\nCouncil; Gilson Engel, of the In- versity and must present a letter of<br />\nmen for the last half of the game.<br />\nterfraternity Board; Douglas Cot- recommendation from the principal<br />\nF. B.<br />\nCalkins<br />\nWilliams (11)<br />\nHopkins chances seem very<br />\nton, of the. Verity Seal Council, of his prep. school as to the ability,<br />\nbright. The squad has been putand Andy Knecht, of the Athletic circumstances, etc., of the appliting up a snappy practice and<br />\nSUBSTITUTES<br />\nBoard. Music will be furnished cant.<br />\nshould be able to present a<br />\nby the University Jazz Band, and<br />\nThe committee to judge the canIvory<br />\n(9) Coady<br />\nstronger offensive this week. Del(10)<br />\nrefreshments will follow the didates will be composed of the<br />\nRothrock (12)<br />\n(10) Harwood<br />\naware, however, may have advanspeech-making.<br />\nPresident of the Alumni AssociaBetzmer<br />\n(12) Bonner<br />\n(13)<br />\ntaged by their early season deImmediately after the recep- tion, Chairman of the Alumni<br />\nSchaeffer (15)<br />\n(16) Rones<br />\nfeats and may be prepared to hantion all the students will be Council, President of the Home(20) Wilson<br />\ndle the Black and Blue a wallop.<br />\nmarched out of the building, the wood Company, and President of<br />\n(37) Turnbull<br />\nHowever, the game is not expectdoors locked and the Freshmen the Varsity Club.<br />\nMurphy<br />\nto be at all one-sided.<br />\ned<br />\nre o<br />\nlined up along the M. E. side with<br />\nLike thy_ Rhodes scholarship, the<br />\nRowland<br />\nThe showing made by the Varthe Sophs on the opposite side. selection will be based upon the<br />\nsity in last Saturday's football<br />\nAt a given signal the two lines three factors: mental ability, leadergame was far from discouraging.<br />\nwill charge and fight it out. No ship and physical ability.<br />\nFRATERNITY RUSHING SEASUMMER SCHOOL HAD<br />\n!come<br />\nThose<br />\nwho have been in close conLARGE ENROLLMENT<br />\nfighting is to take place in the<br />\nSON TO OPEN OCT. 31<br />\nThe drive for the dormitory fund<br />\nual<br />\ntact with the squad this seabuilding and the whole affair is to having been completed, the AssoUntil That Time All Rushing of First- Attendance for 1921 Showed Increase son know what an uphill fight<br />\nbe run and conducted by the Stu- ciation is about to launch a drive Year Men is Forbidden. Late Season<br />\nof 112 Per Cent. Over Preceding<br />\nCoaches<br />\nOrman<br />\nPan<br />\nand<br />\nYear. Many Innovations Inis Bene9cial to Both New Men<br />\ndent Council. It is the duty of all for a $50,000 fund, the interest on<br />\nand Fraternities.<br />\ntroduced.<br />\nO'Rourke have had. The material<br />\nFreshmen to be present and rep- which will go to the establishment<br />\nUndergrads who attended the provided from the prep schools<br />\nIn some colleges it is customresent their class Friday night. It of Alumni Scholarships. Wallace<br />\nFreshary to begin rushing the<br />\nis hardly necessary for the Sophs Giffen, '06, is chairman of the<br />\nsummer school at Hopkins last was excellent and abundant, but<br />\ncommen as soon as they register or in summer report that the session was it was for the most part but of<br />\nto be so advised.<br />\nmittee for. collections.<br />\na few cases while they are still in the most successful ever held here. prep school calibre.<br />\nAt the meeting of the Student<br />\nFRATERNITY RUSHING SEASON<br />\nThe squad of 25 men who reprep school. The rivalry among The attendance figures exceeded<br />\nCouncil Wednesday it was deTO OPEN OCT. 31<br />\nthe fraternities for the most de- those of previous years by more ported at Red Cloud was earnest<br />\nContinued from page 1, col. 3<br />\ncided to appoint a Freshman<br />\n\"pep\" committee to have charge pa Omicron, has been admitted to sirable men is intense so that in than 112 per cent., with about 40 and enthusiastic, but those candiof enforcing the Freshman reg- the board and therefore comes the scramble and excitement it is Hopkins undergraduates working dates who had had any previous<br />\noften very diffcult for a Fresh- off conditions or making up much- experience were extremely light<br />\nulations. This plan is to last for under its rules.<br />\nUntil the beginning of rushing man to consider calmly and care- needed<br />\nSol-:<br />\ntwo weeks and is to give an idea<br />\n\"points\" toward graduation. for a college eleven. The 15 days<br />\nof whether the Freshmen are ca- season no fraternity or fraternity fully the very important question<br />\nStudents with a leaning toward at training camp did wonders for<br />\nman<br />\nis<br />\npermitted<br />\nbe?.<br />\nto<br />\nentertain<br />\na<br />\njoin.<br />\nshould<br />\nhe<br />\nfraternity<br />\nof<br />\nwhat<br />\npable of enforcing their own regthe so-called fair sex had an excel- the squad, for it was a peppy<br />\nfirst<br />\nyear<br />\nman<br />\nin<br />\nfoota<br />\nchapter<br />\nhouse,<br />\nfor<br />\nopportunity<br />\nlittle<br />\nThere is also<br />\nulations. Any flagrant violations<br />\nlent opportunity to indulge their crew that put in its appearance on<br />\ntalk<br />\nto<br />\nhim<br />\nabout<br />\nfraternities<br />\nor<br />\nmen<br />\nup<br />\nthe<br />\nsize<br />\nthe fraternities to<br />\nwill be taken care of by the<br />\nI.otharian proclivities, as the women Straus field on September 17.<br />\ntreat<br />\nhim<br />\nin<br />\na<br />\nbe?<br />\nmanner<br />\nthat<br />\nis<br />\nobmemnew<br />\nOf the prep school recruits<br />\nthey are considering as<br />\nSophs and if at the end of two<br />\noutnumbered the men by about<br />\nbud)<br />\nweeks the plan doesn't work out viously intended to persuade him bers.<br />\nthree to one. Most of the women, Turnbull, Willis, Darley, Magill<br />\nthe Sophs will again take up the to join that fraternity. Although<br />\nFor these reasons it has been to be sure, were city and county and Spinney looked like winners.<br />\njob. This plan is in the nature of it is rather difficult to define ex- the custom at Hopkins for a num- school teachers and, consequently, The veterans Totterdale, Knecht,<br />\ng,<br />\nan experiment and will put the actly what rushing is, the co-op- ber of years to defer the beginning in most cases were strictly useless Landy, Middleton, Markell, BarFreshman on probation. It is to be eration of both the fraternities and of rushing season for several to the budding collegiate Romeo. A ton,. Coady and Rich looked fine.<br />\nhoped that the plan works, as it the Freshmen in living up to the weeks after the opening of col- few of the local Eugene O'Brien's, Cromwell, although he has given<br />\nwill be simpler for all classes. The spirit of this regulation will pre- lege. The exact date on which such as Joe Moran and Larry Mur- Totterdale a fierce battle for the<br />\nCouncil also decided to reprimand vent much trouble.<br />\nrushing shall begin it set by the phy; however, found suitable vic- center position, has been seriously<br />\nhandicapped by sickness.<br />\nthe Freshmen for- defacing the<br />\n0. D. K. TO HOLD MEETING Interfraternity Board which con- tims.<br />\nUniversity with tar paint and to<br />\nThe team that took the field Sat<br />\nA meeting of Omicron Delta sists of representatives from each<br />\nThe summer school lasted from<br />\ntake further action on this in the Kappa,<br />\ncampus.<br />\non<br />\nfraternities<br />\nthe<br />\nurday<br />\ndid all that could be expectthe<br />\nof<br />\nthe honorary society given<br />\nJuly 5 to August 13, covering pracnear future.<br />\nis<br />\nas<br />\nyear<br />\nagreement<br />\ned<br />\nthis<br />\nof<br />\nfor<br />\nit.<br />\nMt. St. Mary's team was<br />\nThe<br />\nfor leadership in college activities,<br />\ntically six weeks of instruction. The<br />\nfollows:<br />\nmuch<br />\nstronger<br />\nthan it has been in<br />\nwill be held this afternoon at 12.30<br />\ntotal number of students enrolled<br />\nHOPKINS UNIT TO HAVE SPECIAL<br />\nThe rushing season for 1921 was 949, which, compared with the previous years, presenting more<br />\nin the Hopkins Club.<br />\nUNIFORMS<br />\nMany important questions •are shall begin on October 31, one- record of 442 made last year, shows veterans in its lineup than any<br />\n\"This institution is one of the<br />\nfew in the country that has this to be discussed and much business half hour before the first class at that more than twice as many this<br />\nother team in the state.<br />\nYear been given what is known is to be brought up. All members, the University. From midnight of year as last year took advantage<br />\nThe most encouraging feature<br />\nas commutation of uniforms. By whether faculty, graduate or un- October 30 until the opening hour of the summer courses. The maof<br />\nthe game from a Hopkins point<br />\nthis is meant that•the government, dergraduate, are requested to be of the season there shall be no jority of the students came from<br />\ninstead of furnishing uniforms for present. The Beta Circle expects communication between any fra- Baltimore city and county, but 16 of view was the work of Darley at<br />\nthe R. 0. T. C. as it has been do- to play an important part on the ternity men and men in their first other states and six foreign coun- quarter. Although very light, the<br />\ning in the past, gives to the campus this year and it is neces- yer of residence at the Universitries were also represented.<br />\nlittle pivot men proved an excelTreasurer of the institution the sary that it make a prompt be- ty. This was signed by represenAmong the innovations during lent general. For his initial fling at<br />\nmoney with which to purchase ginning.<br />\ntatives from the following frater- the summer were the establishment<br />\nthe game in college circles, his<br />\nuniforms. By this arrangement<br />\nnities: Beta Theta Pi, Phi Kappa of the Demonstration School, with<br />\nHOPKINS<br />\nUNIT TO HAVE<br />\nthe Military Department goes out<br />\nPsi, Alpha Delta Phi, Phi Gamma more than 400 children from all work was exceptional. Willis at<br />\nSPECIAL UNIFORMS<br />\nto the civilian tailors, prepares its<br />\nDelta, Kappa Alpha, Pi Kappa parts of the city, ranging in age half played a steady game both<br />\nContiuued from page 1, col. 1<br />\ndesign of uniform and has them month we will see the R. 0. T. C. Chi, Alpha Kappa Phi, Kappa Sig- from 6 to 14. The<br />\nchildren were on the offensive and defensive, but<br />\nprepare tailor-made uniforms for unit equipped with smart and ma and Delta Phi. Since the sign- grouped in specimen classes, and was slowed up by a wrenched<br />\neach individual. This arrangement manly looking uniforms in which ing of the rushing agreement a<br />\neach class was taught by the teach- ankle.<br />\ngoes into effect at once. Within a all of us may have a justifiable new organization, Omicron KapContinued on page 2, col. 4<br />\nContinued on page 2, col. 4<br />\nContinued on page 1, col. 2<br />\nContinued on page 1 col. 2<br />\n_pride.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br />\nMAJOR GAREY FORESEES the government in preparing for TO HAVE ENGINEER AS<br />\nits future- national defense.<br />\nPROSPEROUS YEAR FOR<br />\nWELL AS INFANTRY UNIT<br />\nFOUNDED 1897.<br />\nThis splendid portrayal of<br />\nR. O. T. C.<br />\nthings as they are under Major Thrze New Army Officers Stationed at<br />\n$2.50 Asks Support of University in Making<br />\nSubscription<br />\nHopkins.<br />\nGarey's charge is deserving of<br />\nUnit First in Country.<br />\ncareful attention from the student<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"Some university in this coun- body, especially the new students. \"Upon the recommendation of<br />\nPublished semi-weekly from October to June by the students of Johns try is going to stand No. 1 in R. The advantages to be obtained the Department of Engineering,<br />\nHopkins University.<br />\n0. T. C. affairs. There is no reason from this work are so evident. the President of the University<br />\nBusiness communications should be addressed to the BUSINESS MAN- why Johns Hopkins should not Let's see lots of interest and co- requested the War Department<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nan Engineer Unit of<br />\nbe that institution. I ask the sup- operation. Excellent progress will to establish<br />\nshould be sent to the MANAGING EDITOR.<br />\nReserve<br />\nOfficers'. Training<br />\nthe<br />\nHomewood 100 port of the university in my en- be the result.<br />\nTelephone<br />\nthis<br />\nat<br />\nCorps<br />\nuniversity this<br />\ndeavor to attain that end for this<br />\nDR. MAGOFFIN BACK FROM LEAVE year. This request has been apBusiness Manager:<br />\nEditor-in-Chief:<br />\nC.<br />\nunit.\"<br />\nR. 0. T.<br />\nTO ROME<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nproved and an Engineer Unit has<br />\nSo says Major Enoch B. Garey, Dr. Ralph Van Deman MagofAssociate Editors:<br />\nformed. Johns Hopkins is the<br />\nbeen<br />\n•Greek<br />\nCirculation Manager:<br />\nProfessor of Military Science and fin, Associate Professor of<br />\nEDWARD G. HUEY, '22.<br />\ninstitution in the country<br />\nonly<br />\nELI FRANK, JR., '22.<br />\nGLOVER P. FALLON, '23.<br />\nTactics, at the University, and and Roman History, has recently<br />\nwhere<br />\na new Engineer Unit has<br />\nJunior Editors:<br />\nthat he is not expecting too much returned from Europe, where he<br />\nAdvertising Manager:<br />\nbeen<br />\nthis year. Capt.<br />\nestablished<br />\nCHARLES C. MARBURY, '22.<br />\nDONALD K. VANNEMAN, '23.<br />\nof his unit here is evidenced by has been on leave as the professor<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nWm.<br />\nC.<br />\nAtwater,<br />\na regular army<br />\nROBERT K. GUGGENHEIAIER, '23.<br />\nthe advance it has made in the last it, charge of the School of Classical<br />\nAssistant Business Managers:<br />\nofficer<br />\nand<br />\na<br />\npost-graduate<br />\nof<br />\nRICHARD M. WOOD, '22.<br />\ntwo years. Major Garey goes on Studies of the American Academy<br />\nBERNARD C. HEARN, '23.<br />\nWILLIAM H. MOORE, '23.<br />\nHarvard,<br />\nhas<br />\ndetailed<br />\nbeen<br />\nhere<br />\nin Rome since last October. He<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nto say:<br />\nby the War Department to take<br />\nCRAIG E. TAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nsix weeks in France, going<br />\nspent<br />\n\"Last year I was new at this<br />\ncharge<br />\nof the unit. He comes to us<br />\nuniversity. My assistants were over the battle fields, visiting the with a most excellent record and<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nnew. I considered it best to pro- Louvre in Paris, and studying arch- it is Major Garey's<br />\njudgment<br />\naeology in southern France. The<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. ceed most cautiously and conservthat<br />\nhe<br />\nwill<br />\nvery<br />\ncontribute<br />\natively for the first year. The rest of his time was spent at the as assistants to Major<br />\nGarey.<br />\ncourse in Military Training was American Academy in Rome.<br />\nBALTIMORE, MD., OCTOBER 7, 1921<br />\nThey<br />\nare<br />\ngraduates<br />\nof<br />\nthe<br />\npostThe American Academy now has<br />\nnot made particularly hard. Stugraduate<br />\nschool<br />\nat<br />\nCamp<br />\nBenning<br />\nbeautiful site on the Janiculum<br />\nCHILD'S PLAY AGAIN<br />\nomores are the most diligent in see- dents were not discharged from a<br />\nand are young officers of proven<br />\nOnce again the pest of the campus ing that they are enforced, but it is it unless their work was poor. Hill, which is on the west side of<br />\nability. Captain Williams has<br />\nhas been busy and has desecrated not a class matter and should not This year with suitable text books the Tiber. The School of Classical<br />\nbeen transferred to the Universithe walks and buildings with sev- be regarded as such.<br />\nand with a greatly enlarged staff, Studies is made up of exclusively ty of Arizona and Major Dixon,<br />\neral glaring sets of class numerals. Do not be ashamed of your colors, in addition to being much more of American A. B. students. DurMajor Garey's assistant, went<br />\nSuch action on the part of an en- freshmen. Wear them proudly and familiar with the desires of the ing April and May, Dr. Magoffin<br />\non<br />\nthe inactive list the first<br />\ntering classman might have been do everything in your power to authorities and traditions of the took twenty-one of these students<br />\nduties<br />\nof senior assistant. The<br />\nthe<br />\nforgiven, but on the part of an up- bring credit upon them, yourself, university, it is my intention to and toured through Greece. Be- Military Department now has<br />\nper classmen it is inexcusable.<br />\nput the Military Department on as sides his regular work, he gave lec- three regular non-commissioned<br />\nand your University.<br />\nnear a footing with the other de- tures before the Anglo-American officers on duty as assistants and<br />\nIt is to be hoped that the student<br />\nas may be possible. and Italian Archaeological Soci- is hoping to secure the services<br />\npartments<br />\ncouncil will take some drastic acLET'S PULL TOGETHER<br />\nbe held up to a much eties. Another Baltimore man, Mr, of one more officer and one<br />\nwill<br />\nStudents<br />\ntion in the matter.<br />\nWith last week's issue, the first<br />\nmore<br />\nmore rigid mark of scholarship Henry Walter, of Walter's Art Gal- non-commissioned officer.<br />\nof<br />\nthe<br />\nNEWScollegiate<br />\nyear, the<br />\nTHE FRESHMAN REGULATIONS<br />\nthan last year. Absence from the- lery, is one of the trustees of the<br />\nThe freshman just entering LETTER began the twenty-fifth year oretical and practical work will Academy.<br />\nSIR ARTHUR KEITH IS LECTURING<br />\nHopkins is confronted by a for- of its existence; and, at the same not be excused except for unAT MEDICAL SCHOOL<br />\nnearly<br />\nfinished<br />\nDr.<br />\nMagof<br />\nfin<br />\nhas<br />\nmidable looking list of regula- time, in becoming a semi-weekly usual conditions. All lost work<br />\na book entitled \"The Three Flavian<br />\nSir Arthur Keith, of the Royal<br />\ntions which he must obey. To many made a radical departure from its must be made up. Only by the<br />\nCaesars: Vespasian, Titus, and Do- College of Surgeons, in London,<br />\nit may seem an unnecessary and un- former policy. The editors believe greatest of enterprise and energy<br />\nmitian,\"<br />\nwhich will cover, in a gen- who was requested several months<br />\njust hardship to have to give up that in becoming a semi-weekly the will it be, possible for , us to hold<br />\neral<br />\nway,<br />\nhis latest work in Rome. ago to deliver the thirteenth course<br />\none's accustomed mode of dress and paper is simply keeping pace with the position that we feel has prob- An account of some new<br />\nRoman in- of lectures under the provisions of<br />\nin other ways vary one's habits at the growth of the University, which ably been attained by the depart- scriptions, which he<br />\nthe Herter foundation at the Meddiscovered,<br />\nthe command of a strange and mys- demands more and better publicity ment so far.<br />\nwill appear shortly in a magazine ical School, gave the first lecture<br />\nterious body known as the student than it has received in the past. The<br />\n\"I wish to express my cordial article. In summing up his trip, of the series Wednesday.<br />\ncouncil. But upon examining the NEWS-LETTER exists solely to give appreciation to the university au- Dr.<br />\nMagoffin said that he had \"a<br />\nHis general topic was \"The Difmatter more carefully it will be full publicity to all affairs of inter- thorities, to all members of the<br />\nmost wonderful time.\" •<br />\nof Modern Races in the<br />\nferentiation<br />\nfound that the regulations are really est to the'student body, faculty and faculty and to the student body<br />\nHormone Theory.\"<br />\nthe<br />\nof<br />\nLight<br />\nfor the good of the University as alumni of the University.<br />\nfor the support that has been givthe same lines were<br />\nalong<br />\nSUMMER<br />\nSCHOOL<br />\nLectures<br />\nHAD<br />\nIn undertaking to appear twice<br />\na whole and of the freshmen themen to me and fo my department<br />\nLARGE ENROLLMENT<br />\nyesterday<br />\nand the last of the<br />\ngiven<br />\nselves, rather than merely to suit a week throughout the coming year, since I have been here. The presContinued from page 1<br />\ngiven<br />\nbe<br />\ntoday. A large<br />\nwill<br />\n,eries<br />\nthe NEWS-LETTER faces a serious ent condition of the department is<br />\nthe tastes of the upper classmen.<br />\ners who were in turn under the in- lumber of physicians of the city and<br />\nThis year a regulation has been problem. We want the NEWS-LET- due solely to this support. By the struction of other<br />\nmore experienced nedical students were present at<br />\nintroduced requiring every fresh- TER to be a credit to the University. hardest of work we are trying to teachers.<br />\nhe lectures, which were given in<br />\nman to take part in some college We want it to help in every way merit that support and hope that<br />\nMusic was also taught for the he medical amphitheatre at 4:30.<br />\nactivity. Every year a great many possible to advance and better the it will be given to us in the future.<br />\nfirst time at Hopkins as a regular )rs. MacCallum, Abel and Thayer<br />\nmen enter the University who never undergraduate life at Hopkins. We Every member of the university is<br />\npart of the curriculum during the -ompose the committee in charge of<br />\ntake part in any activity at all, sim- want it to be an active force in stu- cordially invited to come in to see<br />\nsummer<br />\ncourse, with John Denues .,he lectures.<br />\nply because they are too timid or dent affairs, and a true mirror of us and give us the opportunity of<br />\nas<br />\ninstructor.<br />\nThe class in Journallack the ambition to start. As a student feeling. We want it to aid showing the character of work<br />\nism<br />\n2,<br />\nunder<br />\nthe<br />\nable direction of themselves well on the • wings.<br />\nresult, the various teams, the staffs in bringing closer together the that we are endeavoring to conMr.<br />\nRaymond<br />\nof the \"Happy\" showed the ability of a<br />\nTompkins,<br />\nof the college publications and other trustees, faculty, graduate and un- duct.<br />\nSun<br />\nthe<br />\ncourse,<br />\nis- first-class end .He lost no time in<br />\nstaff,<br />\nof<br />\nteacher<br />\nstudent organizations have lacked dergraduate schools.<br />\n\"During the war it required but sued a paper known as the \"Hot running under punts and his<br />\nWe ask your co-operation.<br />\nnew material to take the place of<br />\nlittle ability to see the necessity Times\" for the delectation and in- tackling was deadly. His only difthe men who graduated. It is hoped<br />\nof establishing R. 0. T. C. units struction of the students. Other ficulty<br />\nseemed to be.in over-runBACK UP THE TEAM<br />\nthat the new regulations will remThis year our football team is throughout our various institu- innovations not so spectacular ning his man, a fault which exedy this condition and also be of<br />\nunfortunately handicapped by a tions. During times of peace it helped to make the course the most perience will correct. Knecht and<br />\ngreater value to the freshman himlack of heavy material. To help requires more foresight and abili- successful in the history of Johns Westerman performed admirably<br />\nself. For by forcing him out for<br />\noffset this disadvantage, we must ty to see this. Those who follow Hopkins.<br />\nat the tackle positions. The latter,<br />\nsome activity it will give him an<br />\nnational affairs have seen how the<br />\nturn our efforts to hearty support<br />\nDr. Edward Buchner, director of an ex-Poly and St. Johns man,<br />\nopportunity to make many friends,<br />\neconomic conditions of the world<br />\nof the team. The Hopkins spirit<br />\nthe summer courses, expressed him- weighs 195 pounds and has three<br />\na name for himself at college, inhave tended to reduce government<br />\ncannot be criticised, but we must<br />\nself yesterday as much pleased with years of college football before<br />\nstead of passing through his four<br />\nactivities. Every good American<br />\nsimply intensify our interest. The<br />\nthe progress that Hopkins is mak- him. With few exceptions his<br />\nyears course unnoticed.<br />\nhopes that the peace armament<br />\nmen who are out for the team are<br />\ning in the matter of the summer work was of high order. He was<br />\nThe regulations requiring freshprogram will be 100 per cent, sucloing their very best, but they will<br />\nschool courses, and says that he ex- injured in the second quarter and<br />\ncessful, but no thoughtful and<br />\nmen to wear distinctive clothing undo still more if the active support<br />\npects an even more successful was replaced by Magill, who was<br />\ndoubtedly tends to get the class toconservative American will be<br />\nshifted from guard.<br />\nof the student body is secured.<br />\nsummer next year.<br />\nwilling to reduce the power and<br />\ngether and give it greater unity.<br />\nfor<br />\nJohnroot<br />\nEverybody out and<br />\nAt guard, a position lending<br />\nfighting efficiency of the country<br />\nFreshmen can recognize freshmen,<br />\nny Hopkins.<br />\nHOPKINS THE FAVORITE IN few opportunities for brilliant<br />\nshould other wars unfortunately<br />\neven though they be total strangers.<br />\nTOMORROW'S CLASH<br />\nplay, Lancly, Magill and Barton<br />\ncome in the future. College stuMost of the other regulations are<br />\nplayed a steady game. Cromeach<br />\nContinued from page 1<br />\nSOPHS AND FRESH MIX IT UP<br />\ndents constitute the finest resertraditions which have existed at the<br />\nsingle unfortunate bad pass<br />\nwell's<br />\nwork<br />\nat<br />\nMarkell's<br />\nfull<br />\nwas<br />\nmost<br />\nContinued from page 4<br />\nvoir from which our country can<br />\nUniversity for a good many years,<br />\nwould<br />\nprobably not have ocsatisfactory,<br />\nas<br />\nwas<br />\nCalkins, who<br />\nand which the incoming class must kins' traditions, but the painting obtain suitable leaders for future<br />\nhad<br />\nhe been in his best concurred<br />\nhim<br />\nin<br />\nreplaced<br />\nthe second half.<br />\nlearn to uphold.<br />\nwas not. The blame cannot be emergencies. It is a source of<br />\ndition.<br />\nUnder<br />\nthe circumstances<br />\nSpinney at the other half played<br />\nThe entering classmen should also laid entirely upon the shoulders of ()Teat satisfaction to the War Dehe<br />\nplayed<br />\nthe<br />\ngame<br />\nlike the veta fighting game but appeared<br />\nbear in mind the fact that the reg- the freshmen. The blame rests partment that such eminent men<br />\neran<br />\nhe<br />\nis.<br />\noveranxious.<br />\nCoady<br />\nwho<br />\nsubstiulations imposed upon them by the with the renegade members of the as the President of this university,<br />\ntuted for him, appeared more at<br />\nAs a team Hopkins looked exstudent council and not by the soph- class of '24. We believe, however, Drs. Latane, Willoughby, -Whiteease.<br />\ntremely<br />\nlight, rough in places, but<br />\nomore class, and, therefore, must that such a thing will not again head, etc., so clearly see this probwith<br />\nplenty<br />\nof fight.<br />\nMiddleton and Rich handled<br />\nlem and are in cordial support of<br />\nbe obeyed. It is true that the soph- occur.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br />\n<br />\nWe are establishing a new standard in<br />\n<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br />\n<br />\nBaltimore's Best Store<br />\n<br />\nHOCHSCHILD.KOHN 8c Co.<br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br />\n<br />\nHUTZLER NOTHEM<br />\nFidelity & Deposit Company<br />\nOF MARYLAND<br />\n1890<br />\n<br />\n1920<br />\n<br />\nFIDELITY BONDS & BURGLARY INSURANCE<br />\nContract, Judicial—BONDS—Public Official, Depository<br />\nCHARLES ST. at LEXINGTON<br />\n<br />\nBaltimore, Md.<br />\n<br />\nEstablished 1863<br />\n<br />\nHENRY SEIM & CO.<br />\nWhen you want the<br />\nreal thing in Sport Manufacturers,<br />\nImporters & Dealers<br />\nEquipment you think<br />\ninstinctively of<br />\n\"SPALDING\"<br />\n<br />\nGLASS<br />\n<br />\nPAINTS, OILS and VARNISHES<br />\nof Every Description<br />\nAutomobile Glass a Specialty<br />\n<br />\nA. G. SPALDING & BROS.<br />\n110 EAST BALTIMORE ST.<br />\n<br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br />\n<br />\nBaltimore, Md.<br />\nHOWARD & FAYETTE STS.<br />\n<br />\n3<br />\n<br />\nWho's Who at J. H. U.<br />\n1921-1922<br />\nOMICRON DELTA KAPPA<br />\nPresident, Joseph C. Thompson;<br />\nSecretary, Robert C. Flail; Members, Douglas Cotton, Andrew<br />\nKnecht, Davidge Rowland.<br />\nSTUDENT COUNCIL<br />\nPresident, Richard M. Wood;<br />\nSecretary, Gilson Engel; Seniors,<br />\nRobert Hall, Gilson Engel, Andrew<br />\nKnecht; Juniors, John Marchant,<br />\nDonald Vanneman ; Sophomores,<br />\nEdward Morrison.<br />\nATHLETIC BOARD<br />\nPresident, Andrew H. Knecht;<br />\nSecretary, S. Atherton Middleton.<br />\nVARSITY SEAL VOTING COUNCIL<br />\nChairman, H. Douglas Cotton;<br />\nSecretary, Frederick W. Lipps.<br />\nFOOTBALL<br />\nCaptain,<br />\n, Manager.<br />\nH. Pierce Brawner.<br />\nLACROSSE<br />\nCaptain, Joseph Zoller ; Manager,<br />\nHoward Hensel.<br />\nBASEBALL<br />\nCaptain, Andrew H. Knecht;<br />\nManager, Edward G. Huey.<br />\nTRACK<br />\nCaptain, Joseph C. Thompson;<br />\nManager, William R. Fortney.<br />\nBASKET-BALL<br />\nCaptain,<br />\n; Manager,<br />\nJ. Brentnall Powell.<br />\nSWIMMING<br />\nCaptain, Paul Buhrer ; Manager,<br />\nDavidge Rowland.<br />\nTENNIS<br />\nCaptain and Manager, Wilson<br />\nDuffy.<br />\nCROSS COUNTRY TEA<br />\nCaptain, W. H. Somerville.<br />\nNEWS-LETTER<br />\nEditor-in-Chief — H. Douglas<br />\nCotton; Business Manager, Frederick W. Lipps.<br />\nHULLABALOO<br />\nEditor-in-Chief, R. Dorsey Watkins; Business Manager, Edward<br />\nG. Huey.<br />\n<br />\nClothes of Cusicon Qualiiy.<br />\n14 N,CharlesStreet.,<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\n<br />\nLafayette Bank<br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE, President<br />\n<br />\nEDWIN W. ADAMS, Vice-Pres. & Cashier<br />\n<br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS--4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\nNovember 22, 1920<br />\n$428,399.57<br />\nApril 28, 1921<br />\nDecember 29, 1920<br />\n$112,418.77<br />\nMay 18, 1921<br />\n549,051.33<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n657,092.61<br />\nTOTAL ASSETS AUGUST 31, 1921<br />\n$1,013,167.87<br />\n<br />\nMaryland Glass Corporation<br />\nBaltimore<br />\n<br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br />\nBlue and Light Green Glass Bottles.<br />\n<br />\nThe James R. Armiger Co.<br />\nJewelers and Silversmiths<br />\n310 N. Charles St.<br />\n<br />\nBaltimore, Maryland<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n<br />\nATHLETIC GOSSIP<br />\nElmer Jones, or rather \"TurkBLACK AND BLUE JAY<br />\ney\", to those who knew him, put<br />\nLunches, Cigars<br />\n13 SOUTH ST.<br />\nEditor-in-Chief, Lawrence B.<br />\nin his appearance at the universi- Fenneman<br />\n; Business Manager, H.<br />\nCigarettes<br />\nOrganized 1864<br />\nty several days ago. His resigna- Douglas Cotton.<br />\nCandy, Soda and<br />\ntion at West Point has been acJohn J. Nelligan, President<br />\nDAILY BULLETIN<br />\nPipes and Fountain Pens<br />\ncepted and he expects to finish<br />\nEditor, H. Douglas Cotton; Bushis education back here in his own iness Manager, Donald K. VanneAt the Barn<br />\nman.<br />\nhome town.<br />\nE. E. Adams<br />\nDRAMATIC CLUB<br />\nThe \"Turkey\", captain of the<br />\nPresident—Gilso<br />\nn Engel; Secre1919 football aggregates, looked as<br />\nAnd Medicines and Dressings are required or other Real<br />\ntary,<br />\nFrank,<br />\nEli<br />\nJr.<br />\nthough he had greatly benefited,<br />\nPharmaceutical Service is Needed<br />\nMUSICAL<br />\nCLUB<br />\nphysically,<br />\nby<br />\nhis<br />\nshort<br />\nsojourn<br />\nCollege and Fraternity Stationery<br />\nTHINK OF<br />\nPresident, R. Waldo Hambleton ;<br />\nBanquet and Dance Cards, Invitations on the Hudson. He has taken on<br />\nquite a bit of weight and looks a Business Manager, Hugh SmallJAS. H. DOWNS<br />\nfootball player from stem to stern. wood.<br />\nENGRAVER PRINTER STATIONER<br />\nCoach Pan Orman's eyes folBAND<br />\n229 N. CHARLES ST.<br />\nTWO STORES:<br />\nlowed him hungrily as he left the<br />\nDirector, Emil Smith.<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nuniversity grounds.<br />\nDEBATING COUNCIL<br />\nMadison 405<br />\nMt. Vernon 890<br />\nSt. John's defeated Western<br />\nPresident, R. Dorsey 'Watkins;<br />\nMaryland last Saturday, 29-0. Of Secretary, Lawrence B. Fenneman.<br />\ninterest to Hopkins is the work of<br />\nSt. Paul 7855-7856<br />\nINTERERATERNITY BOARD<br />\nGregg, last year's quarterback for<br />\nPresident, Gilson E. Engel; Secthe Black and Blue. Haines<br />\nHomes Sold on Easy Terms<br />\nUY or rent a Corona<br />\nretary,<br />\nRichard M. Wood.<br />\ntypewriter on easy<br />\nmore<br />\nthan<br />\nfilled<br />\nthe<br />\nbill<br />\nlast<br />\nSatpayments. Carry it to<br />\nY. M. C. A.<br />\nurday for the Cadets both in callschool every day in its<br />\nPresident,<br />\nLeroy Baughman;<br />\nneat case. Make extra<br />\ning signals and running the ball.<br />\nmoney writing articles or<br />\nSecretary,<br />\nPaul Stevens; General<br />\ndoing typing for others!<br />\nBill Wood, elected captain of<br />\nSecretary, Charles S. Sydnor ; As<br />\nCall today at the nearest<br />\nthis year's squad, has chosen to<br />\nCorona store—or teleROBERT SEFF<br />\nsistant General Secretary, Vertrees<br />\nphone for a demonstraremain at West Point. In the first<br />\nhome.<br />\ntion at your<br />\nWyckoff.<br />\nReal Estate—Investments<br />\ngame of the season last Saturday<br />\nM. W. LUCY & CO.<br />\nWest Point defeated Springfield. SHIRTS<br />\nNECKWEAR<br />\n118 W. Fayette St.<br />\nBill, playing at halfback, ran a distance of forty yards for a touchWeighs GM lbs.<br />\ndown.<br />\nFolds and fits<br />\nSOLD BY ALL GROCERS<br />\n421 N. HOWARD ST.<br />\nin a neat carry231 Courtland Street Baltimore, Md.<br />\ning case.<br />\nHugh Ward, who played tackle HOSIERY<br />\nGLOVES<br />\non Western Maryland's eleven<br />\n$An with<br />\ncase<br />\nwhen we wore knee breeches, is STRATTON SHIRT MAKER<br />\n226 N. Liberty St.<br />\nEstablished 1873<br />\nLIBERTY<br />\nstill holding down that position. Dress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n$3.25 and $4.25 A.H.Felling Man'fg Jewelry Co.<br />\nHugh is captain this year. We Negligee<br />\nExpert Cleaners and Dyers<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nManufacturers<br />\nmust<br />\nrespect<br />\nyour<br />\ngray<br />\nhairs,<br />\nMachine<br />\nPersonal<br />\nWriting<br />\nTerms<br />\nCash,<br />\nLess<br />\nSpecial<br />\n30<br />\n10%<br />\nDays<br />\non<br />\nRates to Hopkins Men<br />\nThe<br />\nShirts<br />\nGreek Letter Fraternity Jewelry<br />\nWardie. Stay at Westminster on<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nAlso a Full Line of Men's<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nOctober 29.<br />\nFurnishings<br />\n<br />\nIf an Accident Occurs<br />\n<br />\nHynson, Westcott and Dunning<br />\n<br />\nTeachers!<br />\n<br />\nHE-NO<br />\nTEA<br />\n<br />\nB<br />\n<br />\nLefranc & Ault<br />\n<br />\nConoNA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nFORDNEY TARIFF BILL<br />\nTHREATENS EDUCATION<br />\n<br />\nTHE RED CROSS MAKES<br />\nAPPEAL FOR MEMBERS<br />\n<br />\nWould Increase Tariff on Foreign College Men Especially Urged to Join.<br />\nBooks. Dr. M. L. Reaney Chosen<br />\nSplendid Relief Work Being Done.<br />\nby American Library Association<br />\nCongress.<br />\nto Present Protest to<br />\n<br />\nBuck Glass Company<br />\n<br />\nCollege men and women should<br />\nRaney, librarian of feel it peculiarly their duty to supL.<br />\nI.<br />\nDr.<br />\nImporters and Dealers in Fine Books<br />\nthe university, has been chosen to port the American Red Cross in its<br />\n301 N. CHARLES ST.<br />\npresent a protest to Congress on a forthcoming annual Roll Call, to<br />\nBaltimore, Md.<br />\nprovision of the Fordney tariff bill be held November 11-24. For the<br />\nwhich threatens to endanger educa- Red Cross, from the beginning, has<br />\ntion. The provision would increase been supported and directed very<br />\nthe duty on all foreign books and largely by college men, because its<br />\nwould limit institutions to a max- aims and ideals are the aims and<br />\nimum of two copies of any work ideals which the training received<br />\nsecured free upon affidavit.<br />\nin universities and colleges has<br />\nThe provision is declared by Uni- taught them to honor and cherish—<br />\nse) versity authorities to be a menace because it is constructive, and gives<br />\nCtleff beXatteri<br />\n•<br />\n\"14MES H.& OSCAR<br />\nto education. It is obvious that them the opportunity of applying<br />\nOWNERS<br />\nAmerican dealers will be discour- those ideals practically.<br />\nT4P:?-‘4<br />\n4<br />\n•e<br />\n.1<br />\n130<br />\naged from importing valuable liThe Red Cross needs support this<br />\n29 Baltimore St., East<br />\nbraries which would otherwise find year more than ever before. The<br />\nOne Door West of Light St.<br />\nhands of inter- wartime work was dramatic, picturlole Assorted Chocolates<br />\nSOLE AGENTS FOR BALTIMORE their way into the<br />\nFor College Fraternity Bands<br />\nested students.<br />\nesque; the peace-time work, alAND<br />\n(Greek Letter Societies)<br />\nIf the present tariff measure is though just as indispensable, canLady Helen Chocolate Cherries in Cordial<br />\npassed unamended, the University not arouse so intense a public inThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nadvantage<br />\nthe<br />\nlose<br />\nwill<br />\nLibrary<br />\nterest. Work for the disabled sol300 N. HOWARD ST., Baltimore, Md. which it has had of importing for- diers,<br />\nfor the dependent children in<br />\nSURGICAL INSTRUMENTS<br />\ndue<br />\nrates,<br />\nspecial<br />\nat<br />\njournals<br />\neign<br />\nSupplies,<br />\nEastern<br />\nand Central Europe, DisMicroscopes and<br />\nStethoscopes<br />\nto the exchange situation.<br />\naster Relief Preparedness, First Aid<br />\nBlood Lancets<br />\nBlood Counters<br />\nAre standards in their respective class of delicious confections<br />\nDr. Raney, in his protest, is rep- Instruction, Public Health Nursresenting the American Library As- ing—these are not things in which<br />\nat popular prices.<br />\nsociation. He is chairman of the the average man, untouched himPrinters of Philological and<br />\nassociation's committee on book self by misfortune, can find a thrilScientific Works<br />\nbuying. The statement which he ling interest.<br />\n23 S. HANOVER ST.<br />\nlaid before the Senate has been<br />\nhas<br />\nBaltimore, Md.<br />\nYet that all these activities are<br />\nAsk Your Dealer for Them<br />\nofficially endorsed by the National relieving an<br />\nincalculable amount of<br />\nEducation Association, Association suffering no<br />\none can deny. A thouof Urban Universities, and the As- sand disabled ex-service men are<br />\nsociation of University Professors. reporting every month at hospitals<br />\nt is hoped that as many of the fac- for treatment, and last year the<br />\nBaltimore, Md.<br />\nulty as possible will send in their Red Cross spent<br />\n$10,000,000 in<br />\nprotests against the bill to the Mary- helping these<br />\ndisabled men alone.<br />\nland Senators and to Senator Pen- And that was<br />\n$4,000,000 more than<br />\nrose. the chairman of the Finance the<br />\nCall Calvert 1718<br />\naggregate receipts from the Norman James, President<br />\nCommittee.<br />\nVice-President<br />\nHunting,<br />\nB.<br />\nGeo.<br />\nyears<br />\nmembership<br />\ndues.<br />\nObviously. Walter B. Wessels, Secretary-Treas. FOR KEEN CUTTER HARDWARE<br />\n17 E. Baltimore St.<br />\nLUCAS<br />\nif the work is to continue, popular F. A. Ascherfeld, General Manager<br />\nMarine,<br />\nIndustrial, House<br />\nofbenefits<br />\nto take an interest in the<br />\nsupport must be greatly strengthPAINTS<br />\nfered at the University had better ened. It remains for the college<br />\nPrinters of the<br />\nnot try to get a higher education. men and women of the country, unBUILDING LUMBER<br />\nJohns Hopkins News-Letter<br />\nDr. Latane also explained the oper- dergraduates and alumni, to work Office and Yardsation of the student council and the together to see that these things are 921 ALICEANNA ST., cor. Exeter<br />\nBaltimore, Md.<br />\n609 W. LEXINGTON ST.<br />\nhonor system. He warned all stu- not allowed to fail.<br />\ndents of the necessity of honorable<br />\nChas. L. Cunningham & Co.<br />\naction in all affairs of the Univer •<br />\nSOPHS<br />\nAND FRESH MIX IT UP<br />\n(Licensees)<br />\nStewart Taxi Service Co.<br />\nsity, citing some cases of aggresTo the casual visitor at the<br />\n20-30 GARRISON LANE<br />\nsion to the honor system and the<br />\nNear Baltimore St.<br />\nUniversity Wednesday morning<br />\nCall Mt. Vernon 11<br />\nresults meted out by the student<br />\nthe drives, walks and every other<br />\nSTRIPS<br />\nWEATHER<br />\nMETAL<br />\ncouncil. The student council, as<br />\nfor<br />\nflat surface in sight presented<br />\nTaxi Cabs and Touring Cars<br />\nDr. Latane explained, acts as a meWINDOWS and DOORS<br />\na scene not unlike the famous<br />\ndium between the faculty and the<br />\nPhones—C. & P., Long Distance<br />\n\"Hell's Half-acre.\"<br />\nstudent body, dispensing justice to<br />\nSeveral misguided freshmen<br />\nthe undergraduates in a democratic<br />\nhad,<br />\nin following the example of<br />\nand liberal manner.<br />\nCollege LiteratureA<br />\nUse MORGAN'S CARBOLATED<br />\nAn Unusual Beauty Shop<br />\nsome less sane sophomore, slunk<br />\nDean Whitehead corroborated<br />\nLOMBARD and SOUTH STREETS<br />\nBABY POWDER for Chafing<br />\ninto the grounds the night pre- Our Exclusive Tailored Sport<br />\nthe statements of Dean Latane and<br />\nvious<br />\nand<br />\nmade<br />\nthe<br />\ncampus<br />\nmerry<br />\nBlouses a Specialty<br />\nand Itching for Adults and<br />\nSHOES<br />\nfurther extolled the students, espewith a coat of war paint. From<br />\nMeasurement<br />\nYour<br />\nto<br />\nMade<br />\ncially those of the Engineering<br />\nfor<br />\nChildren.<br />\nthe top of a tall tree by the barn 517 N. CHARLES ST.<br />\nSchool,<br />\nto<br />\nin<br />\nconduct<br />\ngentle,<br />\nmanly<br />\nUNIVERSITY MEN<br />\na banner fluttered in the quiet<br />\nBaltimore, Maryland<br />\nthe buildings and grounds of the<br />\nFor Sport Wear University. He showed how the breeze. It bore the simple numerFor Dress<br />\nSmart Styles—Best Leathers crowded condition of the Mechan- als, '25.\"<br />\nIn the neighborhood of 8.05 a<br />\nModerate Prices<br />\nDoes the C. P. A. degree, a caical and Civil Engineering buildgroup of indignant sophomores<br />\nreer as a public accountant or tax<br />\nings made it necessary for quiet and<br />\nspecialist, an executive position<br />\ndiscovered the innocent banner.<br />\norder in those buildings. Dr. Whiteas Controller, Treasurer, Auditor<br />\nThe first luckless freshman to enhead further said that complete unor Office Manager appeal to you?<br />\nCOMPLIMENTS<br />\n19 W. LEXINGTON ST.<br />\nter the grounds was dispatched<br />\nderstanding between the students<br />\nPace courses, standardized and<br />\nwith the aid of paddles, suggesaccredited, available in evening<br />\nthe<br />\nand<br />\nSchool<br />\nthose<br />\nof<br />\nEngineering<br />\nFRESHMEN WELCOMED AT<br />\ntions, etc., to haul down the buntclasses, have for years afforded<br />\nof the College of Arts and Sciences<br />\nASSEMBLY<br />\npreparation for professional Acing. When about half way up a<br />\nLast Monday, in the Civil Engi- was necessary to preserve the unity<br />\ncountancy<br />\npractice and for execDemocratic Candidate<br />\ntroupe of Frosh bore down upon<br />\nneering Hall, Deans Latane and of the University.<br />\nutive<br />\nin business.<br />\npositions<br />\nthe scene, ordering their unforWhitehead addressed the Class of<br />\nWills<br />\nof<br />\nRegister<br />\ntunate representative to let buntJOKES<br />\n1925, welcoming them into the Uniing remain.<br />\nShe—If I kiss you this once, will<br />\nversity. Dr. Latane expressed a<br />\nFew minutes passed before the<br />\nmake<br />\nmen<br />\nyou<br />\nnew<br />\nthe<br />\npromise never to ask me again?<br />\nsee<br />\nto<br />\ndesire<br />\nFALL CLASSES NOW FORMING<br />\nclasses mingled as one, books,<br />\ntwo<br />\nan honorable and laudable record<br />\nCall or Write for Bulletin<br />\nHe—Certainly, dear. If you conhats<br />\nin<br />\npaper<br />\nand<br />\nair.<br />\nflying<br />\nthe<br />\nSt. Paul 1469<br />\ncollege<br />\nthe<br />\nin<br />\nin their studies and<br />\nsider it unnecessary.—Octopus.<br />\n201-208 EQUITABLE BLDG.<br />\nMars<br />\ngod<br />\nonce.<br />\nThe<br />\nbut<br />\nhesitated<br />\nactivities of the University. He<br />\nInstructor—Do we import any Dean Latane putting in an appointed out the undesirability of a<br />\npearance, attempted arbitration,<br />\nraw<br />\nmaterial from France?<br />\nman who allowed his life at the Unisucceeded in having the padand<br />\nWit (a la critic)—Only plays.—<br />\nversity to pass without having made<br />\ndles<br />\ndiscarded. Then the battle<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br />\na good standing in scholarship and Burr.<br />\nto rage until the<br />\nwas<br />\nresumed,<br />\nstudent life. Such a man, he said,<br />\nOfficer in Charge of Rifle Range Gilman Hall chimes called the<br />\nhad failed to grasp the first opporART GOODS<br />\nyou know any better than warriors to camp.<br />\n—Don't<br />\ntunity of life, as a man's character<br />\nThe battle was worthy of Hopis usually formed by the habits he to point an empty gun at me?<br />\nCutlery, Kitchen Utensils<br />\nChina and Table Glassware<br />\nempty,<br />\nisn't<br />\nit<br />\nRooky—But<br />\nRaw<br />\ngains while at college. He further<br />\n2<br />\ncol.<br />\n2,<br />\npage<br />\non<br />\nContinued<br />\nheld that a man who was not willing sir; it's loaded.—The Mirror.<br />\n<br />\nManufacturers of<br />\n<br />\nGLASS BOTTLES<br />\n<br />\nBaltimore<br />\n<br />\nMaryland<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nChocolate Products Company<br />\n<br />\nThe James Lumber Co.<br />\n<br />\nLexington Paint &<br />\nHardware Co.<br />\n<br />\nKALLOTHENEION<br />\n<br />\nAccountancy<br />\n<br />\nWYMAN<br />\n<br />\nHoward W.Jackson<br />\n<br />\nBaltimore<br />\nPace Institute<br />\n<br />\nJ. Seth Hopkins-Mansfield Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 2<br />\nFRESHMAN RECEPTION TONIGHT IN C. E. HALL<br />\nInteresting Evening to Be Provided.<br />\nStudent Council Will Superintend<br />\nAnnual Scrap at Close.<br /><br />\nBALTIMORE, MD., OCTOBER 7, 1921<br />\nALUMNI SCHOLARSHIPS<br />\nSOON TO BE ESTABLISHED<br />\nWill Be On Order of Rhodes Scholarships. $50,000 Fund to Be<br />\nCollected.<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS THE FAVORITE<br />\nIN TOMORROW'S CLASH<br /><br />\nAccording to the plans of the<br />\nThe game with Deleware, toHopkins Alumni Association,<br />\nJohns<br />\nThe Freshman reception to be<br />\nLINEUP<br />\nmorrow, will probably find sevgiven in the C. E. Building on a new scholarship, very similar to<br />\neral changes in the lineup of the<br />\nFriday, October 7, at 8 P. M., will the Princeton Alumni Scholarship,<br />\nDELAWARE<br />\nJOHNS HOPKINS<br />\nBlack and Blue as the coach<br />\nbe held this year under the joint is soon to be established. The aim<br />\nwishes<br />\nto try out as many promisL. E.<br />\nMatraw<br />\n(1)<br />\n(1) Middleton<br />\nauspices of the Y. M. C. A. and of this scholarship, which shall be<br />\nmen<br />\nas possible. Delaware has<br />\ning<br />\nthe Student Council. The Y. M. known as the Johns Hopkins Alum(21) Westerman or<br />\nthus far had a rather bumpy road<br />\nC. A. will provide the main pro- ni Scholarship, is to counterbalance<br />\ntravel. While Hopkins was<br />\nto<br />\nL. T.<br />\nHolton (Capt.)(2)<br />\nMagill<br />\ngram in the way of speakers, mu- the existing scholarships which recdowning Mt. St. Mary's last Satsic and refreshments, while the ognize solely the students' mental<br />\nL. G.<br />\nAkin<br />\n(5) Barton<br />\n(3)<br />\nurday the Blue Hens were being<br />\nStudent Council will take charge ability. It is believed that such<br />\ntrampled<br />\nunder by Muhlenberg<br />\nSelby<br />\n(4)<br />\n(31) Cromwell<br />\nof the Freshman-Sophomore rush scholarships will attract more allUniversity to the tune of 21-0. The<br />\nR. G.<br />\nHuff<br />\n(8) Hardy<br />\nwhich will follow immediately around men to Hopkins.<br />\n(5)<br />\nlosers played a rather weak ofafter the reception. The Y. M. C. The plans, as developed by the<br />\ngame, allowing the ball to<br />\nfensive<br />\nR. T.<br />\nRepp<br />\n(4) Knecht<br />\n(6)<br />\nA. will provide a very interesting Association, have met the entire apremain in the possession of their<br />\nManning (7)<br />\n(11) Rich or Turnbull R. E.<br />\nprogram with speeches by Dean proval of the faculty. Appointment<br />\nopponents most of the time.<br />\nLatane, of the Faculty; Mr. Lev- will depend upon qualifications sim<br />\nMagee<br />\n(6) Darley or Wilson Q. B.<br />\nOn the Saturday previous Del(8)<br />\nering, of the Trustees; a represen- ilar to those required of a Rhodes<br />\naware met the heavy University of<br />\nMacDonald (9)<br />\nR. H. B.<br />\n(29) Willis<br />\ntative of the Y. M. C. A.; Joe cholar. The candidate for the<br />\nPennsylvania team and was delThompson, of the 0. D. K. So- scholarship must meet the usual<br />\nJackson<br />\n(14)<br />\n(7) Spinney or.Coady L. H. B.<br />\nuged under a 89-0 score, Penn<br />\nciety; Dick Wood, of-the Student eligibility requirement of the Unia number of second string<br />\nusing<br />\n(19) Markell or<br />\nCouncil; Gilson Engel, of the In- versity and must present a letter of<br />\nmen for the last half of the game.<br />\nterfraternity Board; Douglas Cot- recommendation from the principal<br />\nF. B.<br />\nCalkins<br />\nWilliams (11)<br />\nHopkins chances seem very<br />\nton, of the. Verity Seal Council, of his prep. school as to the ability,<br />\nbright. The squad has been putand Andy Knecht, of the Athletic circumstances, etc., of the appliting up a snappy practice and<br />\nSUBSTITUTES<br />\nBoard. Music will be furnished cant.<br />\nshould be able to present a<br />\nby the University Jazz Band, and<br />\nThe committee to judge the canIvory<br />\n(9) Coady<br />\nstronger offensive this week. Del(10)<br />\nrefreshments will follow the didates will be composed of the<br />\nRothrock (12)<br />\n(10) Harwood<br />\naware, however, may have advanspeech-making.<br />\nPresident of the Alumni AssociaBetzmer<br />\n(12) Bonner<br />\n(13)<br />\ntaged by their early season deImmediately after the recep- tion, Chairman of the Alumni<br />\nSchaeffer (15)<br />\n(16) Rones<br />\nfeats and may be prepared to hantion all the students will be Council, President of the Home(20) Wilson<br />\ndle the Black and Blue a wallop.<br />\nmarched out of the building, the wood Company, and President of<br />\n(37) Turnbull<br />\nHowever, the game is not expectdoors locked and the Freshmen the Varsity Club.<br />\nMurphy<br />\nto be at all one-sided.<br />\ned<br />\nre o<br />\nlined up along the M. E. side with<br />\nLike thy_ Rhodes scholarship, the<br />\nRowland<br />\nThe showing made by the Varthe Sophs on the opposite side. selection will be based upon the<br />\nsity in last Saturday's football<br />\nAt a given signal the two lines three factors: mental ability, leadergame was far from discouraging.<br />\nwill charge and fight it out. No ship and physical ability.<br />\nFRATERNITY RUSHING SEASUMMER SCHOOL HAD<br />\n!come<br />\nThose<br />\nwho have been in close conLARGE ENROLLMENT<br />\nfighting is to take place in the<br />\nSON TO OPEN OCT. 31<br />\nThe drive for the dormitory fund<br />\nual<br />\ntact with the squad this seabuilding and the whole affair is to having been completed, the AssoUntil That Time All Rushing of First- Attendance for 1921 Showed Increase son know what an uphill fight<br />\nbe run and conducted by the Stu- ciation is about to launch a drive Year Men is Forbidden. Late Season<br />\nof 112 Per Cent. Over Preceding<br />\nCoaches<br />\nOrman<br />\nPan<br />\nand<br />\nYear. Many Innovations Inis Bene9cial to Both New Men<br />\ndent Council. It is the duty of all for a $50,000 fund, the interest on<br />\nand Fraternities.<br />\ntroduced.<br />\nO'Rourke have had. The material<br />\nFreshmen to be present and rep- which will go to the establishment<br />\nUndergrads who attended the provided from the prep schools<br />\nIn some colleges it is customresent their class Friday night. It of Alumni Scholarships. Wallace<br />\nFreshary to begin rushing the<br />\nis hardly necessary for the Sophs Giffen, '06, is chairman of the<br />\nsummer school at Hopkins last was excellent and abundant, but<br />\ncommen as soon as they register or in summer report that the session was it was for the most part but of<br />\nto be so advised.<br />\nmittee for. collections.<br />\na few cases while they are still in the most successful ever held here. prep school calibre.<br />\nAt the meeting of the Student<br />\nFRATERNITY RUSHING SEASON<br />\nThe squad of 25 men who reprep school. The rivalry among The attendance figures exceeded<br />\nCouncil Wednesday it was deTO OPEN OCT. 31<br />\nthe fraternities for the most de- those of previous years by more ported at Red Cloud was earnest<br />\nContinued from page 1, col. 3<br />\ncided to appoint a Freshman<br />\n\"pep\" committee to have charge pa Omicron, has been admitted to sirable men is intense so that in than 112 per cent., with about 40 and enthusiastic, but those candiof enforcing the Freshman reg- the board and therefore comes the scramble and excitement it is Hopkins undergraduates working dates who had had any previous<br />\noften very diffcult for a Fresh- off conditions or making up much- experience were extremely light<br />\nulations. This plan is to last for under its rules.<br />\nUntil the beginning of rushing man to consider calmly and care- needed<br />\nSol-:<br />\ntwo weeks and is to give an idea<br />\n\"points\" toward graduation. for a college eleven. The 15 days<br />\nof whether the Freshmen are ca- season no fraternity or fraternity fully the very important question<br />\nStudents with a leaning toward at training camp did wonders for<br />\nman<br />\nis<br />\npermitted<br />\nbe?.<br />\nto<br />\nentertain<br />\na<br />\njoin.<br />\nshould<br />\nhe<br />\nfraternity<br />\nof<br />\nwhat<br />\npable of enforcing their own regthe so-called fair sex had an excel- the squad, for it was a peppy<br />\nfirst<br />\nyear<br />\nman<br />\nin<br />\nfoota<br />\nchapter<br />\nhouse,<br />\nfor<br />\nopportunity<br />\nlittle<br />\nThere is also<br />\nulations. Any flagrant violations<br />\nlent opportunity to indulge their crew that put in its appearance on<br />\ntalk<br />\nto<br />\nhim<br />\nabout<br />\nfraternities<br />\nor<br />\nmen<br />\nup<br />\nthe<br />\nsize<br />\nthe fraternities to<br />\nwill be taken care of by the<br />\nI.otharian proclivities, as the women Straus field on September 17.<br />\ntreat<br />\nhim<br />\nin<br />\na<br />\nbe?<br />\nmanner<br />\nthat<br />\nis<br />\nobmemnew<br />\nOf the prep school recruits<br />\nthey are considering as<br />\nSophs and if at the end of two<br />\noutnumbered the men by about<br />\nbud)<br />\nweeks the plan doesn't work out viously intended to persuade him bers.<br />\nthree to one. Most of the women, Turnbull, Willis, Darley, Magill<br />\nthe Sophs will again take up the to join that fraternity. Although<br />\nFor these reasons it has been to be sure, were city and county and Spinney looked like winners.<br />\njob. This plan is in the nature of it is rather difficult to define ex- the custom at Hopkins for a num- school teachers and, consequently, The veterans Totterdale, Knecht,<br />\ng,<br />\nan experiment and will put the actly what rushing is, the co-op- ber of years to defer the beginning in most cases were strictly useless Landy, Middleton, Markell, BarFreshman on probation. It is to be eration of both the fraternities and of rushing season for several to the budding collegiate Romeo. A ton,. Coady and Rich looked fine.<br />\nhoped that the plan works, as it the Freshmen in living up to the weeks after the opening of col- few of the local Eugene O'Brien's, Cromwell, although he has given<br />\nwill be simpler for all classes. The spirit of this regulation will pre- lege. The exact date on which such as Joe Moran and Larry Mur- Totterdale a fierce battle for the<br />\nCouncil also decided to reprimand vent much trouble.<br />\nrushing shall begin it set by the phy; however, found suitable vic- center position, has been seriously<br />\nhandicapped by sickness.<br />\nthe Freshmen for- defacing the<br />\n0. D. K. TO HOLD MEETING Interfraternity Board which con- tims.<br />\nUniversity with tar paint and to<br />\nThe team that took the field Sat<br />\nA meeting of Omicron Delta sists of representatives from each<br />\nThe summer school lasted from<br />\ntake further action on this in the Kappa,<br />\ncampus.<br />\non<br />\nfraternities<br />\nthe<br />\nurday<br />\ndid all that could be expectthe<br />\nof<br />\nthe honorary society given<br />\nJuly 5 to August 13, covering pracnear future.<br />\nis<br />\nas<br />\nyear<br />\nagreement<br />\ned<br />\nthis<br />\nof<br />\nfor<br />\nit.<br />\nMt. St. Mary's team was<br />\nThe<br />\nfor leadership in college activities,<br />\ntically six weeks of instruction. The<br />\nfollows:<br />\nmuch<br />\nstronger<br />\nthan it has been in<br />\nwill be held this afternoon at 12.30<br />\ntotal number of students enrolled<br />\nHOPKINS UNIT TO HAVE SPECIAL<br />\nThe rushing season for 1921 was 949, which, compared with the previous years, presenting more<br />\nin the Hopkins Club.<br />\nUNIFORMS<br />\nMany important questions •are shall begin on October 31, one- record of 442 made last year, shows veterans in its lineup than any<br />\n\"This institution is one of the<br />\nfew in the country that has this to be discussed and much business half hour before the first class at that more than twice as many this<br />\nother team in the state.<br />\nYear been given what is known is to be brought up. All members, the University. From midnight of year as last year took advantage<br />\nThe most encouraging feature<br />\nas commutation of uniforms. By whether faculty, graduate or un- October 30 until the opening hour of the summer courses. The maof<br />\nthe game from a Hopkins point<br />\nthis is meant that•the government, dergraduate, are requested to be of the season there shall be no jority of the students came from<br />\ninstead of furnishing uniforms for present. The Beta Circle expects communication between any fra- Baltimore city and county, but 16 of view was the work of Darley at<br />\nthe R. 0. T. C. as it has been do- to play an important part on the ternity men and men in their first other states and six foreign coun- quarter. Although very light, the<br />\ning in the past, gives to the campus this year and it is neces- yer of residence at the Universitries were also represented.<br />\nlittle pivot men proved an excelTreasurer of the institution the sary that it make a prompt be- ty. This was signed by represenAmong the innovations during lent general. For his initial fling at<br />\nmoney with which to purchase ginning.<br />\ntatives from the following frater- the summer were the establishment<br />\nthe game in college circles, his<br />\nuniforms. By this arrangement<br />\nnities: Beta Theta Pi, Phi Kappa of the Demonstration School, with<br />\nHOPKINS<br />\nUNIT TO HAVE<br />\nthe Military Department goes out<br />\nPsi, Alpha Delta Phi, Phi Gamma more than 400 children from all work was exceptional. Willis at<br />\nSPECIAL UNIFORMS<br />\nto the civilian tailors, prepares its<br />\nDelta, Kappa Alpha, Pi Kappa parts of the city, ranging in age half played a steady game both<br />\nContiuued from page 1, col. 1<br />\ndesign of uniform and has them month we will see the R. 0. T. C. Chi, Alpha Kappa Phi, Kappa Sig- from 6 to 14. The<br />\nchildren were on the offensive and defensive, but<br />\nprepare tailor-made uniforms for unit equipped with smart and ma and Delta Phi. Since the sign- grouped in specimen classes, and was slowed up by a wrenched<br />\neach individual. This arrangement manly looking uniforms in which ing of the rushing agreement a<br />\neach class was taught by the teach- ankle.<br />\ngoes into effect at once. Within a all of us may have a justifiable new organization, Omicron KapContinued on page 2, col. 4<br />\nContinued on page 2, col. 4<br />\nContinued on page 1, col. 2<br />\nContinued on page 1 col. 2<br />\n_pride.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br />\nMAJOR GAREY FORESEES the government in preparing for TO HAVE ENGINEER AS<br />\nits future- national defense.<br />\nPROSPEROUS YEAR FOR<br />\nWELL AS INFANTRY UNIT<br />\nFOUNDED 1897.<br />\nThis splendid portrayal of<br />\nR. O. T. C.<br />\nthings as they are under Major Thrze New Army Officers Stationed at<br />\n$2.50 Asks Support of University in Making<br />\nSubscription<br />\nHopkins.<br />\nGarey's charge is deserving of<br />\nUnit First in Country.<br />\ncareful attention from the student<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"Some university in this coun- body, especially the new students. \"Upon the recommendation of<br />\nPublished semi-weekly from October to June by the students of Johns try is going to stand No. 1 in R. The advantages to be obtained the Department of Engineering,<br />\nHopkins University.<br />\n0. T. C. affairs. There is no reason from this work are so evident. the President of the University<br />\nBusiness communications should be addressed to the BUSINESS MAN- why Johns Hopkins should not Let's see lots of interest and co- requested the War Department<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nan Engineer Unit of<br />\nbe that institution. I ask the sup- operation. Excellent progress will to establish<br />\nshould be sent to the MANAGING EDITOR.<br />\nReserve<br />\nOfficers'. Training<br />\nthe<br />\nHomewood 100 port of the university in my en- be the result.<br />\nTelephone<br />\nthis<br />\nat<br />\nCorps<br />\nuniversity this<br />\ndeavor to attain that end for this<br />\nDR. MAGOFFIN BACK FROM LEAVE year. This request has been apBusiness Manager:<br />\nEditor-in-Chief:<br />\nC.<br />\nunit.\"<br />\nR. 0. T.<br />\nTO ROME<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nproved and an Engineer Unit has<br />\nSo says Major Enoch B. Garey, Dr. Ralph Van Deman MagofAssociate Editors:<br />\nformed. Johns Hopkins is the<br />\nbeen<br />\n•Greek<br />\nCirculation Manager:<br />\nProfessor of Military Science and fin, Associate Professor of<br />\nEDWARD G. HUEY, '22.<br />\ninstitution in the country<br />\nonly<br />\nELI FRANK, JR., '22.<br />\nGLOVER P. FALLON, '23.<br />\nTactics, at the University, and and Roman History, has recently<br />\nwhere<br />\na new Engineer Unit has<br />\nJunior Editors:<br />\nthat he is not expecting too much returned from Europe, where he<br />\nAdvertising Manager:<br />\nbeen<br />\nthis year. Capt.<br />\nestablished<br />\nCHARLES C. MARBURY, '22.<br />\nDONALD K. VANNEMAN, '23.<br />\nof his unit here is evidenced by has been on leave as the professor<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nWm.<br />\nC.<br />\nAtwater,<br />\na regular army<br />\nROBERT K. GUGGENHEIAIER, '23.<br />\nthe advance it has made in the last it, charge of the School of Classical<br />\nAssistant Business Managers:<br />\nofficer<br />\nand<br />\na<br />\npost-graduate<br />\nof<br />\nRICHARD M. WOOD, '22.<br />\ntwo years. Major Garey goes on Studies of the American Academy<br />\nBERNARD C. HEARN, '23.<br />\nWILLIAM H. MOORE, '23.<br />\nHarvard,<br />\nhas<br />\ndetailed<br />\nbeen<br />\nhere<br />\nin Rome since last October. He<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nto say:<br />\nby the War Department to take<br />\nCRAIG E. TAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nsix weeks in France, going<br />\nspent<br />\n\"Last year I was new at this<br />\ncharge<br />\nof the unit. He comes to us<br />\nuniversity. My assistants were over the battle fields, visiting the with a most excellent record and<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nnew. I considered it best to pro- Louvre in Paris, and studying arch- it is Major Garey's<br />\njudgment<br />\naeology in southern France. The<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. ceed most cautiously and conservthat<br />\nhe<br />\nwill<br />\nvery<br />\ncontribute<br />\natively for the first year. The rest of his time was spent at the as assistants to Major<br />\nGarey.<br />\ncourse in Military Training was American Academy in Rome.<br />\nBALTIMORE, MD., OCTOBER 7, 1921<br />\nThey<br />\nare<br />\ngraduates<br />\nof<br />\nthe<br />\npostThe American Academy now has<br />\nnot made particularly hard. Stugraduate<br />\nschool<br />\nat<br />\nCamp<br />\nBenning<br />\nbeautiful site on the Janiculum<br />\nCHILD'S PLAY AGAIN<br />\nomores are the most diligent in see- dents were not discharged from a<br />\nand are young officers of proven<br />\nOnce again the pest of the campus ing that they are enforced, but it is it unless their work was poor. Hill, which is on the west side of<br />\nability. Captain Williams has<br />\nhas been busy and has desecrated not a class matter and should not This year with suitable text books the Tiber. The School of Classical<br />\nbeen transferred to the Universithe walks and buildings with sev- be regarded as such.<br />\nand with a greatly enlarged staff, Studies is made up of exclusively ty of Arizona and Major Dixon,<br />\neral glaring sets of class numerals. Do not be ashamed of your colors, in addition to being much more of American A. B. students. DurMajor Garey's assistant, went<br />\nSuch action on the part of an en- freshmen. Wear them proudly and familiar with the desires of the ing April and May, Dr. Magoffin<br />\non<br />\nthe inactive list the first<br />\ntering classman might have been do everything in your power to authorities and traditions of the took twenty-one of these students<br />\nduties<br />\nof senior assistant. The<br />\nthe<br />\nforgiven, but on the part of an up- bring credit upon them, yourself, university, it is my intention to and toured through Greece. Be- Military Department now has<br />\nper classmen it is inexcusable.<br />\nput the Military Department on as sides his regular work, he gave lec- three regular non-commissioned<br />\nand your University.<br />\nnear a footing with the other de- tures before the Anglo-American officers on duty as assistants and<br />\nIt is to be hoped that the student<br />\nas may be possible. and Italian Archaeological Soci- is hoping to secure the services<br />\npartments<br />\ncouncil will take some drastic acLET'S PULL TOGETHER<br />\nbe held up to a much eties. Another Baltimore man, Mr, of one more officer and one<br />\nwill<br />\nStudents<br />\ntion in the matter.<br />\nWith last week's issue, the first<br />\nmore<br />\nmore rigid mark of scholarship Henry Walter, of Walter's Art Gal- non-commissioned officer.<br />\nof<br />\nthe<br />\nNEWScollegiate<br />\nyear, the<br />\nTHE FRESHMAN REGULATIONS<br />\nthan last year. Absence from the- lery, is one of the trustees of the<br />\nThe freshman just entering LETTER began the twenty-fifth year oretical and practical work will Academy.<br />\nSIR ARTHUR KEITH IS LECTURING<br />\nHopkins is confronted by a for- of its existence; and, at the same not be excused except for unAT MEDICAL SCHOOL<br />\nnearly<br />\nfinished<br />\nDr.<br />\nMagof<br />\nfin<br />\nhas<br />\nmidable looking list of regula- time, in becoming a semi-weekly usual conditions. All lost work<br />\na book entitled \"The Three Flavian<br />\nSir Arthur Keith, of the Royal<br />\ntions which he must obey. To many made a radical departure from its must be made up. Only by the<br />\nCaesars: Vespasian, Titus, and Do- College of Surgeons, in London,<br />\nit may seem an unnecessary and un- former policy. The editors believe greatest of enterprise and energy<br />\nmitian,\"<br />\nwhich will cover, in a gen- who was requested several months<br />\njust hardship to have to give up that in becoming a semi-weekly the will it be, possible for , us to hold<br />\neral<br />\nway,<br />\nhis latest work in Rome. ago to deliver the thirteenth course<br />\none's accustomed mode of dress and paper is simply keeping pace with the position that we feel has prob- An account of some new<br />\nRoman in- of lectures under the provisions of<br />\nin other ways vary one's habits at the growth of the University, which ably been attained by the depart- scriptions, which he<br />\nthe Herter foundation at the Meddiscovered,<br />\nthe command of a strange and mys- demands more and better publicity ment so far.<br />\nwill appear shortly in a magazine ical School, gave the first lecture<br />\nterious body known as the student than it has received in the past. The<br />\n\"I wish to express my cordial article. In summing up his trip, of the series Wednesday.<br />\ncouncil. But upon examining the NEWS-LETTER exists solely to give appreciation to the university au- Dr.<br />\nMagoffin said that he had \"a<br />\nHis general topic was \"The Difmatter more carefully it will be full publicity to all affairs of inter- thorities, to all members of the<br />\nmost wonderful time.\" •<br />\nof Modern Races in the<br />\nferentiation<br />\nfound that the regulations are really est to the'student body, faculty and faculty and to the student body<br />\nHormone Theory.\"<br />\nthe<br />\nof<br />\nLight<br />\nfor the good of the University as alumni of the University.<br />\nfor the support that has been givthe same lines were<br />\nalong<br />\nSUMMER<br />\nSCHOOL<br />\nLectures<br />\nHAD<br />\nIn undertaking to appear twice<br />\na whole and of the freshmen themen to me and fo my department<br />\nLARGE ENROLLMENT<br />\nyesterday<br />\nand the last of the<br />\ngiven<br />\nselves, rather than merely to suit a week throughout the coming year, since I have been here. The presContinued from page 1<br />\ngiven<br />\nbe<br />\ntoday. A large<br />\nwill<br />\n,eries<br />\nthe NEWS-LETTER faces a serious ent condition of the department is<br />\nthe tastes of the upper classmen.<br />\ners who were in turn under the in- lumber of physicians of the city and<br />\nThis year a regulation has been problem. We want the NEWS-LET- due solely to this support. By the struction of other<br />\nmore experienced nedical students were present at<br />\nintroduced requiring every fresh- TER to be a credit to the University. hardest of work we are trying to teachers.<br />\nhe lectures, which were given in<br />\nman to take part in some college We want it to help in every way merit that support and hope that<br />\nMusic was also taught for the he medical amphitheatre at 4:30.<br />\nactivity. Every year a great many possible to advance and better the it will be given to us in the future.<br />\nfirst time at Hopkins as a regular )rs. MacCallum, Abel and Thayer<br />\nmen enter the University who never undergraduate life at Hopkins. We Every member of the university is<br />\npart of the curriculum during the -ompose the committee in charge of<br />\ntake part in any activity at all, sim- want it to be an active force in stu- cordially invited to come in to see<br />\nsummer<br />\ncourse, with John Denues .,he lectures.<br />\nply because they are too timid or dent affairs, and a true mirror of us and give us the opportunity of<br />\nas<br />\ninstructor.<br />\nThe class in Journallack the ambition to start. As a student feeling. We want it to aid showing the character of work<br />\nism<br />\n2,<br />\nunder<br />\nthe<br />\nable direction of themselves well on the • wings.<br />\nresult, the various teams, the staffs in bringing closer together the that we are endeavoring to conMr.<br />\nRaymond<br />\nof the \"Happy\" showed the ability of a<br />\nTompkins,<br />\nof the college publications and other trustees, faculty, graduate and un- duct.<br />\nSun<br />\nthe<br />\ncourse,<br />\nis- first-class end .He lost no time in<br />\nstaff,<br />\nof<br />\nteacher<br />\nstudent organizations have lacked dergraduate schools.<br />\n\"During the war it required but sued a paper known as the \"Hot running under punts and his<br />\nWe ask your co-operation.<br />\nnew material to take the place of<br />\nlittle ability to see the necessity Times\" for the delectation and in- tackling was deadly. His only difthe men who graduated. It is hoped<br />\nof establishing R. 0. T. C. units struction of the students. Other ficulty<br />\nseemed to be.in over-runBACK UP THE TEAM<br />\nthat the new regulations will remThis year our football team is throughout our various institu- innovations not so spectacular ning his man, a fault which exedy this condition and also be of<br />\nunfortunately handicapped by a tions. During times of peace it helped to make the course the most perience will correct. Knecht and<br />\ngreater value to the freshman himlack of heavy material. To help requires more foresight and abili- successful in the history of Johns Westerman performed admirably<br />\nself. For by forcing him out for<br />\noffset this disadvantage, we must ty to see this. Those who follow Hopkins.<br />\nat the tackle positions. The latter,<br />\nsome activity it will give him an<br />\nnational affairs have seen how the<br />\nturn our efforts to hearty support<br />\nDr. Edward Buchner, director of an ex-Poly and St. Johns man,<br />\nopportunity to make many friends,<br />\neconomic conditions of the world<br />\nof the team. The Hopkins spirit<br />\nthe summer courses, expressed him- weighs 195 pounds and has three<br />\na name for himself at college, inhave tended to reduce government<br />\ncannot be criticised, but we must<br />\nself yesterday as much pleased with years of college football before<br />\nstead of passing through his four<br />\nactivities. Every good American<br />\nsimply intensify our interest. The<br />\nthe progress that Hopkins is mak- him. With few exceptions his<br />\nyears course unnoticed.<br />\nhopes that the peace armament<br />\nmen who are out for the team are<br />\ning in the matter of the summer work was of high order. He was<br />\nThe regulations requiring freshprogram will be 100 per cent, sucloing their very best, but they will<br />\nschool courses, and says that he ex- injured in the second quarter and<br />\ncessful, but no thoughtful and<br />\nmen to wear distinctive clothing undo still more if the active support<br />\npects an even more successful was replaced by Magill, who was<br />\ndoubtedly tends to get the class toconservative American will be<br />\nshifted from guard.<br />\nof the student body is secured.<br />\nsummer next year.<br />\nwilling to reduce the power and<br />\ngether and give it greater unity.<br />\nfor<br />\nJohnroot<br />\nEverybody out and<br />\nAt guard, a position lending<br />\nfighting efficiency of the country<br />\nFreshmen can recognize freshmen,<br />\nny Hopkins.<br />\nHOPKINS THE FAVORITE IN few opportunities for brilliant<br />\nshould other wars unfortunately<br />\neven though they be total strangers.<br />\nTOMORROW'S CLASH<br />\nplay, Lancly, Magill and Barton<br />\ncome in the future. College stuMost of the other regulations are<br />\nplayed a steady game. Cromeach<br />\nContinued from page 1<br />\nSOPHS AND FRESH MIX IT UP<br />\ndents constitute the finest resertraditions which have existed at the<br />\nsingle unfortunate bad pass<br />\nwell's<br />\nwork<br />\nat<br />\nMarkell's<br />\nfull<br />\nwas<br />\nmost<br />\nContinued from page 4<br />\nvoir from which our country can<br />\nUniversity for a good many years,<br />\nwould<br />\nprobably not have ocsatisfactory,<br />\nas<br />\nwas<br />\nCalkins, who<br />\nand which the incoming class must kins' traditions, but the painting obtain suitable leaders for future<br />\nhad<br />\nhe been in his best concurred<br />\nhim<br />\nin<br />\nreplaced<br />\nthe second half.<br />\nlearn to uphold.<br />\nwas not. The blame cannot be emergencies. It is a source of<br />\ndition.<br />\nUnder<br />\nthe circumstances<br />\nSpinney at the other half played<br />\nThe entering classmen should also laid entirely upon the shoulders of ()Teat satisfaction to the War Dehe<br />\nplayed<br />\nthe<br />\ngame<br />\nlike the veta fighting game but appeared<br />\nbear in mind the fact that the reg- the freshmen. The blame rests partment that such eminent men<br />\neran<br />\nhe<br />\nis.<br />\noveranxious.<br />\nCoady<br />\nwho<br />\nsubstiulations imposed upon them by the with the renegade members of the as the President of this university,<br />\ntuted for him, appeared more at<br />\nAs a team Hopkins looked exstudent council and not by the soph- class of '24. We believe, however, Drs. Latane, Willoughby, -Whiteease.<br />\ntremely<br />\nlight, rough in places, but<br />\nomore class, and, therefore, must that such a thing will not again head, etc., so clearly see this probwith<br />\nplenty<br />\nof fight.<br />\nMiddleton and Rich handled<br />\nlem and are in cordial support of<br />\nbe obeyed. It is true that the soph- occur.<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br /><br />\nWe are establishing a new standard in<br /><br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br /><br />\nBaltimore's Best Store<br /><br />\nHOCHSCHILD.KOHN 8c Co.<br />\nIn Our Men's Section<br />\nYou will at all times find the newest<br />\nand most fashionable Neckwear, Shirts,<br />\nCollars and other Furnishings necessary<br />\nto a college man's wardrobe.<br /><br />\nHUTZLER NOTHEM<br />\nFidelity &amp; Deposit Company<br />\nOF MARYLAND<br />\n1890<br /><br />\n1920<br /><br />\nFIDELITY BONDS &amp; BURGLARY INSURANCE<br />\nContract, Judicial—BONDS—Public Official, Depository<br />\nCHARLES ST. at LEXINGTON<br /><br />\nBaltimore, Md.<br /><br />\nEstablished 1863<br /><br />\nHENRY SEIM &amp; CO.<br />\nWhen you want the<br />\nreal thing in Sport Manufacturers,<br />\nImporters &amp; Dealers<br />\nEquipment you think<br />\ninstinctively of<br />\n\"SPALDING\"<br /><br />\nGLASS<br /><br />\nPAINTS, OILS and VARNISHES<br />\nof Every Description<br />\nAutomobile Glass a Specialty<br /><br />\nA. G. SPALDING &amp; BROS.<br />\n110 EAST BALTIMORE ST.<br /><br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br /><br />\nBaltimore, Md.<br />\nHOWARD &amp; FAYETTE STS.<br /><br />\n3<br /><br />\nWho's Who at J. H. U.<br />\n1921-1922<br />\nOMICRON DELTA KAPPA<br />\nPresident, Joseph C. Thompson;<br />\nSecretary, Robert C. Flail; Members, Douglas Cotton, Andrew<br />\nKnecht, Davidge Rowland.<br />\nSTUDENT COUNCIL<br />\nPresident, Richard M. Wood;<br />\nSecretary, Gilson Engel; Seniors,<br />\nRobert Hall, Gilson Engel, Andrew<br />\nKnecht; Juniors, John Marchant,<br />\nDonald Vanneman ; Sophomores,<br />\nEdward Morrison.<br />\nATHLETIC BOARD<br />\nPresident, Andrew H. Knecht;<br />\nSecretary, S. Atherton Middleton.<br />\nVARSITY SEAL VOTING COUNCIL<br />\nChairman, H. Douglas Cotton;<br />\nSecretary, Frederick W. Lipps.<br />\nFOOTBALL<br />\nCaptain,<br />\n, Manager.<br />\nH. Pierce Brawner.<br />\nLACROSSE<br />\nCaptain, Joseph Zoller ; Manager,<br />\nHoward Hensel.<br />\nBASEBALL<br />\nCaptain, Andrew H. Knecht;<br />\nManager, Edward G. Huey.<br />\nTRACK<br />\nCaptain, Joseph C. Thompson;<br />\nManager, William R. Fortney.<br />\nBASKET-BALL<br />\nCaptain,<br />\n; Manager,<br />\nJ. Brentnall Powell.<br />\nSWIMMING<br />\nCaptain, Paul Buhrer ; Manager,<br />\nDavidge Rowland.<br />\nTENNIS<br />\nCaptain and Manager, Wilson<br />\nDuffy.<br />\nCROSS COUNTRY TEA<br />\nCaptain, W. H. Somerville.<br />\nNEWS-LETTER<br />\nEditor-in-Chief — H. Douglas<br />\nCotton; Business Manager, Frederick W. Lipps.<br />\nHULLABALOO<br />\nEditor-in-Chief, R. Dorsey Watkins; Business Manager, Edward<br />\nG. Huey.<br /><br />\nClothes of Cusicon Qualiiy.<br />\n14 N,CharlesStreet.,<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br /><br />\nLafayette Bank<br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE, President<br /><br />\nEDWIN W. ADAMS, Vice-Pres. &amp; Cashier<br /><br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS--4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\nNovember 22, 1920<br />\n$428,399.57<br />\nApril 28, 1921<br />\nDecember 29, 1920<br />\n$112,418.77<br />\nMay 18, 1921<br />\n549,051.33<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n657,092.61<br />\nTOTAL ASSETS AUGUST 31, 1921<br />\n$1,013,167.87<br /><br />\nMaryland Glass Corporation<br />\nBaltimore<br /><br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br />\nBlue and Light Green Glass Bottles.<br /><br />\nThe James R. Armiger Co.<br />\nJewelers and Silversmiths<br />\n310 N. Charles St.<br /><br />\nBaltimore, Maryland<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br /><br />\nATHLETIC GOSSIP<br />\nElmer Jones, or rather \"TurkBLACK AND BLUE JAY<br />\ney\", to those who knew him, put<br />\nLunches, Cigars<br />\n13 SOUTH ST.<br />\nEditor-in-Chief, Lawrence B.<br />\nin his appearance at the universi- Fenneman<br />\n; Business Manager, H.<br />\nCigarettes<br />\nOrganized 1864<br />\nty several days ago. His resigna- Douglas Cotton.<br />\nCandy, Soda and<br />\ntion at West Point has been acJohn J. Nelligan, President<br />\nDAILY BULLETIN<br />\nPipes and Fountain Pens<br />\ncepted and he expects to finish<br />\nEditor, H. Douglas Cotton; Bushis education back here in his own iness Manager, Donald K. VanneAt the Barn<br />\nman.<br />\nhome town.<br />\nE. E. Adams<br />\nDRAMATIC CLUB<br />\nThe \"Turkey\", captain of the<br />\nPresident—Gilso<br />\nn Engel; Secre1919 football aggregates, looked as<br />\nAnd Medicines and Dressings are required or other Real<br />\ntary,<br />\nFrank,<br />\nEli<br />\nJr.<br />\nthough he had greatly benefited,<br />\nPharmaceutical Service is Needed<br />\nMUSICAL<br />\nCLUB<br />\nphysically,<br />\nby<br />\nhis<br />\nshort<br />\nsojourn<br />\nCollege and Fraternity Stationery<br />\nTHINK OF<br />\nPresident, R. Waldo Hambleton ;<br />\nBanquet and Dance Cards, Invitations on the Hudson. He has taken on<br />\nquite a bit of weight and looks a Business Manager, Hugh SmallJAS. H. DOWNS<br />\nfootball player from stem to stern. wood.<br />\nENGRAVER PRINTER STATIONER<br />\nCoach Pan Orman's eyes folBAND<br />\n229 N. CHARLES ST.<br />\nTWO STORES:<br />\nlowed him hungrily as he left the<br />\nDirector, Emil Smith.<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nuniversity grounds.<br />\nDEBATING COUNCIL<br />\nMadison 405<br />\nMt. Vernon 890<br />\nSt. John's defeated Western<br />\nPresident, R. Dorsey 'Watkins;<br />\nMaryland last Saturday, 29-0. Of Secretary, Lawrence B. Fenneman.<br />\ninterest to Hopkins is the work of<br />\nSt. Paul 7855-7856<br />\nINTERERATERNITY BOARD<br />\nGregg, last year's quarterback for<br />\nPresident, Gilson E. Engel; Secthe Black and Blue. Haines<br />\nHomes Sold on Easy Terms<br />\nUY or rent a Corona<br />\nretary,<br />\nRichard M. Wood.<br />\ntypewriter on easy<br />\nmore<br />\nthan<br />\nfilled<br />\nthe<br />\nbill<br />\nlast<br />\nSatpayments. Carry it to<br />\nY. M. C. A.<br />\nurday for the Cadets both in callschool every day in its<br />\nPresident,<br />\nLeroy Baughman;<br />\nneat case. Make extra<br />\ning signals and running the ball.<br />\nmoney writing articles or<br />\nSecretary,<br />\nPaul Stevens; General<br />\ndoing typing for others!<br />\nBill Wood, elected captain of<br />\nSecretary, Charles S. Sydnor ; As<br />\nCall today at the nearest<br />\nthis year's squad, has chosen to<br />\nCorona store—or teleROBERT SEFF<br />\nsistant General Secretary, Vertrees<br />\nphone for a demonstraremain at West Point. In the first<br />\nhome.<br />\ntion at your<br />\nWyckoff.<br />\nReal Estate—Investments<br />\ngame of the season last Saturday<br />\nM. W. LUCY &amp; CO.<br />\nWest Point defeated Springfield. SHIRTS<br />\nNECKWEAR<br />\n118 W. Fayette St.<br />\nBill, playing at halfback, ran a distance of forty yards for a touchWeighs GM lbs.<br />\ndown.<br />\nFolds and fits<br />\nSOLD BY ALL GROCERS<br />\n421 N. HOWARD ST.<br />\nin a neat carry231 Courtland Street Baltimore, Md.<br />\ning case.<br />\nHugh Ward, who played tackle HOSIERY<br />\nGLOVES<br />\non Western Maryland's eleven<br />\n$An with<br />\ncase<br />\nwhen we wore knee breeches, is STRATTON SHIRT MAKER<br />\n226 N. Liberty St.<br />\nEstablished 1873<br />\nLIBERTY<br />\nstill holding down that position. Dress Shirts<br />\n$3.00, $3.50 and $4.00<br />\n$3.25 and $4.25 A.H.Felling Man'fg Jewelry Co.<br />\nHugh is captain this year. We Negligee<br />\nExpert Cleaners and Dyers<br />\nImported Madras<br />\n$5.25 and $6.25<br />\nManufacturers<br />\nmust<br />\nrespect<br />\nyour<br />\ngray<br />\nhairs,<br />\nMachine<br />\nPersonal<br />\nWriting<br />\nTerms<br />\nCash,<br />\nLess<br />\nSpecial<br />\n30<br />\n10%<br />\nDays<br />\non<br />\nRates to Hopkins Men<br />\nThe<br />\nShirts<br />\nGreek Letter Fraternity Jewelry<br />\nWardie. Stay at Westminster on<br />\n211 E. 25th St.<br />\nHomewood 5205-W<br />\nAlso a Full Line of Men's<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nOctober 29.<br />\nFurnishings<br /><br />\nIf an Accident Occurs<br /><br />\nHynson, Westcott and Dunning<br /><br />\nTeachers!<br /><br />\nHE-NO<br />\nTEA<br /><br />\nB<br /><br />\nLefranc &amp; Ault<br /><br />\nConoNA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nFORDNEY TARIFF BILL<br />\nTHREATENS EDUCATION<br /><br />\nTHE RED CROSS MAKES<br />\nAPPEAL FOR MEMBERS<br /><br />\nWould Increase Tariff on Foreign College Men Especially Urged to Join.<br />\nBooks. Dr. M. L. Reaney Chosen<br />\nSplendid Relief Work Being Done.<br />\nby American Library Association<br />\nCongress.<br />\nto Present Protest to<br /><br />\nBuck Glass Company<br /><br />\nCollege men and women should<br />\nRaney, librarian of feel it peculiarly their duty to supL.<br />\nI.<br />\nDr.<br />\nImporters and Dealers in Fine Books<br />\nthe university, has been chosen to port the American Red Cross in its<br />\n301 N. CHARLES ST.<br />\npresent a protest to Congress on a forthcoming annual Roll Call, to<br />\nBaltimore, Md.<br />\nprovision of the Fordney tariff bill be held November 11-24. For the<br />\nwhich threatens to endanger educa- Red Cross, from the beginning, has<br />\ntion. The provision would increase been supported and directed very<br />\nthe duty on all foreign books and largely by college men, because its<br />\nwould limit institutions to a max- aims and ideals are the aims and<br />\nimum of two copies of any work ideals which the training received<br />\nsecured free upon affidavit.<br />\nin universities and colleges has<br />\nThe provision is declared by Uni- taught them to honor and cherish—<br />\nse) versity authorities to be a menace because it is constructive, and gives<br />\nCtleff beXatteri<br />\n•<br />\n\"14MES H.&amp; OSCAR<br />\nto education. It is obvious that them the opportunity of applying<br />\nOWNERS<br />\nAmerican dealers will be discour- those ideals practically.<br />\nT4P:?-‘4<br />\n4<br />\n•e<br />\n.1<br />\n130<br />\naged from importing valuable liThe Red Cross needs support this<br />\n29 Baltimore St., East<br />\nbraries which would otherwise find year more than ever before. The<br />\nOne Door West of Light St.<br />\nhands of inter- wartime work was dramatic, picturlole Assorted Chocolates<br />\nSOLE AGENTS FOR BALTIMORE their way into the<br />\nFor College Fraternity Bands<br />\nested students.<br />\nesque; the peace-time work, alAND<br />\n(Greek Letter Societies)<br />\nIf the present tariff measure is though just as indispensable, canLady Helen Chocolate Cherries in Cordial<br />\npassed unamended, the University not arouse so intense a public inThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nadvantage<br />\nthe<br />\nlose<br />\nwill<br />\nLibrary<br />\nterest. Work for the disabled sol300 N. HOWARD ST., Baltimore, Md. which it has had of importing for- diers,<br />\nfor the dependent children in<br />\nSURGICAL INSTRUMENTS<br />\ndue<br />\nrates,<br />\nspecial<br />\nat<br />\njournals<br />\neign<br />\nSupplies,<br />\nEastern<br />\nand Central Europe, DisMicroscopes and<br />\nStethoscopes<br />\nto the exchange situation.<br />\naster Relief Preparedness, First Aid<br />\nBlood Lancets<br />\nBlood Counters<br />\nAre standards in their respective class of delicious confections<br />\nDr. Raney, in his protest, is rep- Instruction, Public Health Nursresenting the American Library As- ing—these are not things in which<br />\nat popular prices.<br />\nsociation. He is chairman of the the average man, untouched himPrinters of Philological and<br />\nassociation's committee on book self by misfortune, can find a thrilScientific Works<br />\nbuying. The statement which he ling interest.<br />\n23 S. HANOVER ST.<br />\nlaid before the Senate has been<br />\nhas<br />\nBaltimore, Md.<br />\nYet that all these activities are<br />\nAsk Your Dealer for Them<br />\nofficially endorsed by the National relieving an<br />\nincalculable amount of<br />\nEducation Association, Association suffering no<br />\none can deny. A thouof Urban Universities, and the As- sand disabled ex-service men are<br />\nsociation of University Professors. reporting every month at hospitals<br />\nt is hoped that as many of the fac- for treatment, and last year the<br />\nBaltimore, Md.<br />\nulty as possible will send in their Red Cross spent<br />\n$10,000,000 in<br />\nprotests against the bill to the Mary- helping these<br />\ndisabled men alone.<br />\nland Senators and to Senator Pen- And that was<br />\n$4,000,000 more than<br />\nrose. the chairman of the Finance the<br />\nCall Calvert 1718<br />\naggregate receipts from the Norman James, President<br />\nCommittee.<br />\nVice-President<br />\nHunting,<br />\nB.<br />\nGeo.<br />\nyears<br />\nmembership<br />\ndues.<br />\nObviously. Walter B. Wessels, Secretary-Treas. FOR KEEN CUTTER HARDWARE<br />\n17 E. Baltimore St.<br />\nLUCAS<br />\nif the work is to continue, popular F. A. Ascherfeld, General Manager<br />\nMarine,<br />\nIndustrial, House<br />\nofbenefits<br />\nto take an interest in the<br />\nsupport must be greatly strengthPAINTS<br />\nfered at the University had better ened. It remains for the college<br />\nPrinters of the<br />\nnot try to get a higher education. men and women of the country, unBUILDING LUMBER<br />\nJohns Hopkins News-Letter<br />\nDr. Latane also explained the oper- dergraduates and alumni, to work Office and Yardsation of the student council and the together to see that these things are 921 ALICEANNA ST., cor. Exeter<br />\nBaltimore, Md.<br />\n609 W. LEXINGTON ST.<br />\nhonor system. He warned all stu- not allowed to fail.<br />\ndents of the necessity of honorable<br />\nChas. L. Cunningham &amp; Co.<br />\naction in all affairs of the Univer •<br />\nSOPHS<br />\nAND FRESH MIX IT UP<br />\n(Licensees)<br />\nStewart Taxi Service Co.<br />\nsity, citing some cases of aggresTo the casual visitor at the<br />\n20-30 GARRISON LANE<br />\nsion to the honor system and the<br />\nNear Baltimore St.<br />\nUniversity Wednesday morning<br />\nCall Mt. Vernon 11<br />\nresults meted out by the student<br />\nthe drives, walks and every other<br />\nSTRIPS<br />\nWEATHER<br />\nMETAL<br />\ncouncil. The student council, as<br />\nfor<br />\nflat surface in sight presented<br />\nTaxi Cabs and Touring Cars<br />\nDr. Latane explained, acts as a meWINDOWS and DOORS<br />\na scene not unlike the famous<br />\ndium between the faculty and the<br />\nPhones—C. &amp; P., Long Distance<br />\n\"Hell's Half-acre.\"<br />\nstudent body, dispensing justice to<br />\nSeveral misguided freshmen<br />\nthe undergraduates in a democratic<br />\nhad,<br />\nin following the example of<br />\nand liberal manner.<br />\nCollege LiteratureA<br />\nUse MORGAN'S CARBOLATED<br />\nAn Unusual Beauty Shop<br />\nsome less sane sophomore, slunk<br />\nDean Whitehead corroborated<br />\nLOMBARD and SOUTH STREETS<br />\nBABY POWDER for Chafing<br />\ninto the grounds the night pre- Our Exclusive Tailored Sport<br />\nthe statements of Dean Latane and<br />\nvious<br />\nand<br />\nmade<br />\nthe<br />\ncampus<br />\nmerry<br />\nBlouses a Specialty<br />\nand Itching for Adults and<br />\nSHOES<br />\nfurther extolled the students, espewith a coat of war paint. From<br />\nMeasurement<br />\nYour<br />\nto<br />\nMade<br />\ncially those of the Engineering<br />\nfor<br />\nChildren.<br />\nthe top of a tall tree by the barn 517 N. CHARLES ST.<br />\nSchool,<br />\nto<br />\nin<br />\nconduct<br />\ngentle,<br />\nmanly<br />\nUNIVERSITY MEN<br />\na banner fluttered in the quiet<br />\nBaltimore, Maryland<br />\nthe buildings and grounds of the<br />\nFor Sport Wear University. He showed how the breeze. It bore the simple numerFor Dress<br />\nSmart Styles—Best Leathers crowded condition of the Mechan- als, '25.\"<br />\nIn the neighborhood of 8.05 a<br />\nModerate Prices<br />\nDoes the C. P. A. degree, a caical and Civil Engineering buildgroup of indignant sophomores<br />\nreer as a public accountant or tax<br />\nings made it necessary for quiet and<br />\nspecialist, an executive position<br />\ndiscovered the innocent banner.<br />\norder in those buildings. Dr. Whiteas Controller, Treasurer, Auditor<br />\nThe first luckless freshman to enhead further said that complete unor Office Manager appeal to you?<br />\nCOMPLIMENTS<br />\n19 W. LEXINGTON ST.<br />\nter the grounds was dispatched<br />\nderstanding between the students<br />\nPace courses, standardized and<br />\nwith the aid of paddles, suggesaccredited, available in evening<br />\nthe<br />\nand<br />\nSchool<br />\nthose<br />\nof<br />\nEngineering<br />\nFRESHMEN WELCOMED AT<br />\ntions, etc., to haul down the buntclasses, have for years afforded<br />\nof the College of Arts and Sciences<br />\nASSEMBLY<br />\npreparation for professional Acing. When about half way up a<br />\nLast Monday, in the Civil Engi- was necessary to preserve the unity<br />\ncountancy<br />\npractice and for execDemocratic Candidate<br />\ntroupe of Frosh bore down upon<br />\nneering Hall, Deans Latane and of the University.<br />\nutive<br />\nin business.<br />\npositions<br />\nthe scene, ordering their unforWhitehead addressed the Class of<br />\nWills<br />\nof<br />\nRegister<br />\ntunate representative to let buntJOKES<br />\n1925, welcoming them into the Uniing remain.<br />\nShe—If I kiss you this once, will<br />\nversity. Dr. Latane expressed a<br />\nFew minutes passed before the<br />\nmake<br />\nmen<br />\nyou<br />\nnew<br />\nthe<br />\npromise never to ask me again?<br />\nsee<br />\nto<br />\ndesire<br />\nFALL CLASSES NOW FORMING<br />\nclasses mingled as one, books,<br />\ntwo<br />\nan honorable and laudable record<br />\nCall or Write for Bulletin<br />\nHe—Certainly, dear. If you conhats<br />\nin<br />\npaper<br />\nand<br />\nair.<br />\nflying<br />\nthe<br />\nSt. Paul 1469<br />\ncollege<br />\nthe<br />\nin<br />\nin their studies and<br />\nsider it unnecessary.—Octopus.<br />\n201-208 EQUITABLE BLDG.<br />\nMars<br />\ngod<br />\nonce.<br />\nThe<br />\nbut<br />\nhesitated<br />\nactivities of the University. He<br />\nInstructor—Do we import any Dean Latane putting in an appointed out the undesirability of a<br />\npearance, attempted arbitration,<br />\nraw<br />\nmaterial from France?<br />\nman who allowed his life at the Unisucceeded in having the padand<br />\nWit (a la critic)—Only plays.—<br />\nversity to pass without having made<br />\ndles<br />\ndiscarded. Then the battle<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br />\na good standing in scholarship and Burr.<br />\nto rage until the<br />\nwas<br />\nresumed,<br />\nstudent life. Such a man, he said,<br />\nOfficer in Charge of Rifle Range Gilman Hall chimes called the<br />\nhad failed to grasp the first opporART GOODS<br />\nyou know any better than warriors to camp.<br />\n—Don't<br />\ntunity of life, as a man's character<br />\nThe battle was worthy of Hopis usually formed by the habits he to point an empty gun at me?<br />\nCutlery, Kitchen Utensils<br />\nChina and Table Glassware<br />\nempty,<br />\nisn't<br />\nit<br />\nRooky—But<br />\nRaw<br />\ngains while at college. He further<br />\n2<br />\ncol.<br />\n2,<br />\npage<br />\non<br />\nContinued<br />\nheld that a man who was not willing sir; it's loaded.—The Mirror.<br /><br />\nManufacturers of<br /><br />\nGLASS BOTTLES<br /><br />\nBaltimore<br /><br />\nMaryland<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nChocolate Products Company<br /><br />\nThe James Lumber Co.<br /><br />\nLexington Paint &amp;<br />\nHardware Co.<br /><br />\nKALLOTHENEION<br /><br />\nAccountancy<br /><br />\nWYMAN<br /><br />\nHoward W.Jackson<br /><br />\nBaltimore<br />\nPace Institute<br /><br />\nJ. Seth Hopkins-Mansfield Co.<br /><br />"}], "field_media_file": [{"target_id": 37533, "display": null, "description": null, "target_type": "file", "target_uuid": "6d647a67-daec-4518-b106-99c064ceb5c0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12956-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12956, "target_type": "node", "target_uuid": "44b5f39b-4c77-4db8-9609-43848228de37", "url": "/node/12956"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e212fe46-fd8a-4e9e-bfe2-4b56ecc0bc02"}]}