{"mid": [{"value": 35540}], "uuid": [{"value": "17ebe87b-f43f-4d41-b5ce-2033ab0b349d"}], "vid": [{"value": 35540}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12096-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "1'A' WNW<br />\n<br />\nvol. II. I or J it I t<br />\n<br />\nDECEMBER 2d, 1897.<br />\n<br />\nt t is<br />\n<br />\nNo. 4.<br />\n<br />\ntbc<br />\n<br />\n•<br />\n<br />\nNicuisA-Ccatiter<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\n•<br />\n<br />\nPress of<br />\n411 Cruggenheimer, Weil & Co.<br />\n<br />\nPublished by Students of<br />\net, THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br />\n<br />\nISSUED<br />\n<br />\nBALTIMORE<br />\n<br />\ntIt<br />\n<br />\nFORTNIGHTLY<br />\n<br />\n\f-14111111<br />\n11 P.R BOYS<br />\nTHE UHIVERSITT SCHOOL.<br />\nW. S. MARSTON, A. II and C. E.,<br />\nPrincipal.<br />\n<br />\n710 and 712 Madison Ave.<br />\n<br />\nTHIM SCHOOL prepares boys for admiesion to the John, Hopkins or any UhiversitY or<br />\nScientific School. It has Stied more than one hundred for the Johns Hopkins alone,<br />\nand many for Harvard, Yale, Princeton, the Massachusetts Institute of Technology, the<br />\nTroy Polytechnic and other College. and Schools. In October. 1894-96 two of the flee<br />\nscholarships given at the John.' llopk hie innew mitirloulAtes, were awarded to it. pupils. It<br />\nhaa a good laboratory and•well equipped gymnasium widen la under the charge of it oompetent instructor. roc further Information or for catalogues, address the Principal,at No. loll<br />\nN. Calvert Street.<br />\n<br />\nB. G. ElCHELBERGER,<br />\n1300K8 AND FINE STIATIONBRY,<br />\n308 N. CHARLES ST.<br />\nY. a. ci. •. BUILDING.<br />\n<br />\nU<br />\n<br />\nBaltimore, Md.<br />\n<br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 70x,703 and<br />\n705 Madison avenue, cor. Eutaw St. Telephone 817.<br />\n<br />\n(ISSUED EVERY FRIDAY)<br />\n<br />\nThe Society Paper of Baltimore.<br />\nBRIGHT AND BREEZY<br />\n<br />\nCushing & CompanyIII<br />\n<br />\nBOOKSELLERS<br />\n<br />\nAND<br />\n<br />\nSTATIONERS<br />\n<br />\n34 WEST BALTIMORE STREET.<br />\n0011001., LAW, MEDICAL, AND CLASSICAL AM/ P4180ELLANLICOUS BOOKS.<br />\nKeep eone•ntly on hand the Text Books need in John. Hopkine University, John, Hopkins<br />\nHospital, and The Woman,<br />\n.College of Baltimore.<br />\nSTATIONERY.—For School, Family, Office and Hank.<br />\n<br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\n<br />\nCameras &.Siaplies.<br />\n<br />\noe<br />\n<br />\nDeveloping<br />\nand<br />\nOt<br />\nPrinting.<br />\n<br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO,<br />\n<br />\nThej9_hns Hopkins University Circular containing announcements<br />\n.. of the Collegiate and Graduate courser offered for the aca.. demic year beenning October 1st, i&ronay be had on appi. cation to the Registrar of the Johns Hopkins University.<br />\n<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of thejohns 1-t9_pkins Medical School may also<br />\n.. be had on application to the Registrars.<br />\n<br />\n106 N. Charles St.<br />\n<br />\nMANDOLINS Are used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nGUITARS<br />\nCalifornia. ;gr. Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin and Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br />\nMANUFACTURED BY<br />\nF. H. GRIFFITH & CO.,<br />\n<br />\nQRIFFITH<br />\n<br />\nMention thia paper when you call or write.<br />\n<br />\nD. E. WILLIAMS,<br />\n<br />\nTAILOR AND SHIRT MAKER,<br />\nN. E. coy. Lexington and Liberty Sts.<br />\nFt aca rri<br />\nGents Underwear made to Order; also Dyeing, Scouring and<br />\nRepairing.<br />\n<br />\nYou Fairly Fly on<br />\n<br />\na<br />\n<br />\neating<br />\n\"K Grand\"<br />\n<br />\n1.<br />\n.<br />\n11111.1<br />\n<br />\nFactory and Salesroom, 87 i N. Howard St., Baltimore, Md.<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\n<br />\n. Text Books .<br />\n. Note Books .<br />\nStudents' Supplies<br />\n<br />\nMadison & Howard Sts.<br />\n<br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain—\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO,, in N. Charles St.<br />\n<br />\nBaltimore Hardware Co., Baltimore & Greene Sts.-Branch.<br />\n<br />\n\f'Moe flews lLetter.<br />\nVol. II.<br />\n<br />\nFortnightly<br />\n<br />\nSTUDENT LIFE IN EDINBURGH.<br />\n<br />\n10<br />\n<br />\ns,<br />\n.0<br />\nr.<br />\n<br />\nd.<br />\n<br />\n3t.<br />\n<br />\nLife in a Scotch college is well and economically ordered upon the basis of student selfgovernment. There is no needless interference<br />\non the part of the authorities. There is no<br />\nwatching or supervising, no gating,\" or shutting in of students at an early evening hour, as<br />\nin an English college. In Edinburgh a<br />\nstudent-lodger, as in America, has his own<br />\npass-key and comes or goes when he likes. A<br />\nCollege Hall in Scotland is managed very<br />\nmuch like an American City Club or College<br />\nFraternity House. The Hall chooses its own<br />\nofficers. A house committee has general<br />\ncharge of all matters of interior concern. Only<br />\nthose students are received as members who<br />\nare approved or elected. Any obnoxious member may be disciplined or expelled.<br />\nThe<br />\nCharges made for rooms, which are furnished<br />\nwith all things needful, are according to location. The cost of board is assessed pro rata<br />\nupon the members of the common mess, exactly as in old-fashioned student commons, or<br />\ndining clubs, at Harvard and Yale.<br />\nIn the Scotch, as well as in the English colleges, a visitor is impressed with the good administration and efficient household service.<br />\nThere is a well-developed spirit of social unity<br />\nand good fellowship. In these points our<br />\nAmerican dormitory system at boys' schools<br />\nand men's colleges is, in most cases, weak. The<br />\nservice and management are usually bad. Our<br />\nAmerican colleges for women are far superior<br />\nto the old-fashioned dormitories for men. At<br />\nSmith and Bryn Mawr, as in English and<br />\nScotch colleges, you will find common diningrooms and common parlors in the buildings<br />\nwhere students lodge. This, of course, promotes sociability, and the common life, which,<br />\nin men's colleges, is too often relegated to the<br />\n<br />\nNo. 4<br />\n<br />\nfraternity house, the gymnasium, the \"cage,\"<br />\nor the ball field. To this general rule there are<br />\nwholesome exceptions a t Lawrenceville,<br />\nWorcester Free Academy, Rutger's College,<br />\nTrinity College, N. C., and other places.<br />\n• The experience of Oxford, Cambridge and<br />\nEdinburgh Universities has shown the possibility of good social organization in dormitories and of a real common life in large academic towns, where the individual, unless living in some college, is in danger of isolation<br />\nand a more or less hermit mode of existence.<br />\nEspecially in Edinburgh has the institution of<br />\nUniversity Halls, on Castle Hill, socialized and<br />\nunified the hitherto separate and scattered elements of the great student body. It is both<br />\nfeasible and desirable in American college<br />\ntowns to bring together, in the form of Students' Unions, little bands of congenial spirits,<br />\nwho can form social clubs, or open fraternities,<br />\nto which desirable members may be gradually<br />\nelected, upon a broad and liberal plan. The<br />\nupper rooms of the club-house, as in our present fraternity houses, should be rented to members. There should be a common room, or<br />\nparlor, and a dining-room on the first floor, a<br />\nclub cuisine in the basement, and bathrooms in<br />\nall the upper stories. A club mess can easily be<br />\nsustained by residents and boarders under the<br />\ndirection of a student manager or steward,<br />\nwho should cater for the club mess and regulate expenses according to the wishes of its patrons. The business affairs of the club, the<br />\nelection of new members, the collection of<br />\nrents, dues, etc., should be in charge of a house<br />\ncommittee. This kind of administration is well<br />\nunderstood in some of our American College<br />\nFraternities, but it needs social extension and<br />\nacademic popularization.<br />\nIn the Scotch College Hall at Ramsay Garden I was greatly impressed with the interior<br />\nart decorations. As you ascend the winding<br />\nstairways, you find the walls beautifully<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nadorned with hundreds of photographs of Old<br />\nEdinburgh buildings. Modern improvements<br />\nin the \"Old Town\" on the hill have caused<br />\nthe removal of many ancient landmarks and<br />\nhistoric monuments, architectural facades and<br />\npicturesque courts, or ancient \"wyndes,\"<br />\nwhich were once the artist's and tourist's delight. You will now find them all preserved in<br />\nartistic ways, by drawings and photographs on<br />\nthe staircases of the College Hall at Ramsay<br />\nGarden. In the common room of this hall the<br />\nwalls are artistically frescoed to represent certain scenes in Celtic mythology. There is an<br />\nearnest attempt every year at the Edinburgh<br />\nSummer School to revive old Celtic decorative<br />\nart, of which a pleasing exhibition is made on<br />\nacademic premises and in prints and publications.<br />\nEdinburgh is a wonderfully beautiful town,<br />\na queenly city, a modern Athens, set upon hills,<br />\nwith broad thoroughfares, noble monuments<br />\nand public buildings, lovely gardens, extensive<br />\nparks and drives, magnificent outlooks towards<br />\nthe mountains and across the Firth of Forth.<br />\nBut some idea of what the condition of the<br />\ntown once was can be obtained by glancing at<br />\nthe squalid \"survivals\" of filth and misery<br />\nin \"Cowgate\" and other old-time streets and<br />\nalleys in which now dwell \"the submerged<br />\ntenth,\" apparently sunken below the present<br />\nlevel of the city, whose traffic and modern<br />\npromenades are more conspicuously seen<br />\nalong those gigantic causeways which cross the<br />\nold historic ravines or gullies of Edinburgh.<br />\nIn the newest art gallery of the city you will<br />\nfind in an upper room a large collection of<br />\nsketches and water colors, showing Old Edinburgh in all its picturesque squalor. Almost<br />\nevery bit of quaint architecture, every nook and<br />\ncorner of the ancient town, is thus immortalized by the faithful hand of art ; but we must<br />\nremember that those old rookeries on High<br />\nstreet and Canongate, while interesting to look<br />\nat, were not sanitary places of abode. As Robert Louis Stevenson says : \"It is easy to be a<br />\nconservator of the discomforts of others. . . .<br />\nAssuredly, in driving streets through the black<br />\nlabyrinth, a few curious old corners have been<br />\nswept away, and some associations turned out<br />\n<br />\nof house and home. But what slices of sunlight, what breaths of clean of air, have been<br />\nlet in I And what a picturesque world remains<br />\nuntouched I\"<br />\nWhoever visits Edinburgh will be grateful<br />\nto the memory of Robert Louis Stevenson, and<br />\nwill read and re-read his \"Picturesque Notes\"<br />\non this fascinating old city. No writer has better caught the spirit of the place or sketched its<br />\nsalient features with a truer hand. The visitor<br />\nwill surely encounter this genius loci, Robert<br />\nLouis Stevenson, in the National Portrait Gallery of Edinburgh, where a marble bust of the<br />\ncharming author of \"St. Ives\" greets you<br />\nwith an almost life-like welcome. The man<br />\ntruly lives in literature and in art. The following brief extracts from his \"Picturesque Notes\"<br />\ndescribe Edinburgh :<br />\n\"Few places, if any,\" he says, \"offer a more<br />\nbarbaric display of contrasts to the eye. In the<br />\nvery midst stands one of the most satisfactory<br />\ncrags in nature—a bass rock upon dry land,<br />\nrooted in a garden, shaken by passing trains,<br />\ncarrying a crown of battlements and turrets,<br />\nand describing its warlike shadow over the<br />\nliveliest and brightest thoroughfare of the New<br />\nTown. From their smoky beehives, ten stories<br />\nhigh, the unwashed look down upon the open<br />\nsquares and gardens of the wealthy ; and gay<br />\npeople sunning themselves along Princes<br />\nstreet, with its mile of commercial palaces beflagged upon some great occasion, see, across a<br />\ngardened valley set with statues, where the<br />\nwashings of the old town flutter in the breeze<br />\nat its high windows. And then, upon all sides,<br />\nwhat a clashing of architecture I In this one<br />\nvalley, where the life of the town goes most<br />\nbusily forward, there may be seen, shown one<br />\nabove and behind another by the accidents of<br />\nthe ground, buildings in almost every style<br />\nupon the globe. Egyptian and Greek temples,<br />\nVenetian palaces and Gothic spires, are huddled one over another in a most admired disorder; while, above all, the brute mass of the<br />\nCastle and the summit of Arthur's Seat look<br />\ndown upon these imitations with a becoming<br />\ndignity, as the works of Nature may look down<br />\nupon the monuments of Art.\"<br />\nHERBERT B. ADAMS.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nDR. T11-1011AS.<br />\n<br />\nDr. James Carey Thomas was born in Baltimore on July II, 1833, and died on November<br />\n9, 1897. He graduated from Haverford College in 1852, and from the Medical School of<br />\nthe University of Maryland in 1854. He was<br />\na trustee of the Johns Hopkins University from<br />\nits opening until his death.<br />\nHis efficient, faithful and devoted work in<br />\nmany lines is known to all men. He was a<br />\nphysician in the active practice of that arduous<br />\nprofession, a minister of the 'Gospel in the Society of Friends, a public-spirited philanthropist, keenly interested in every plan for the improvement of his fellowman ; an officer and a<br />\nzealous supporter of the Young Men's Christian Association in this city, and a trustee of<br />\nseveral important educational institutions.<br />\nThis is not the place to write of these manifold<br />\nfields of activity. But it is eminently fitting that<br />\nreference should be made in THE NEWS-LETTER to another side of Dr. Thomas' activity to<br />\nwhich he gave much time, thought and love—<br />\nhis relations to the Johns Hopkins University.<br />\nOnly the trustees can tell how valuable his<br />\nservices were in the organization and development of the University in general, and of the<br />\nMedical School in particular; but certain of<br />\nDr. Thomas' services were such as could be<br />\nseen even by those who came here as students,<br />\nand still more clearly by those who remained<br />\nas instructors, after the conclusion of their<br />\ncourse of studies for a degree.<br />\nFirst of all, he stood for a broad and courageous Christianity in the University. Other<br />\nmen might doubt as to the position of Christianity in the mind of an educated man or in the<br />\nlife of an educational institution ; but we felt<br />\nthat in him we knew one who never hesitated<br />\nin his firm insistence on the greatest freedom<br />\nof scientific research and on the certainty and<br />\nimportance of the Christian religion. None<br />\nShould be ignorantly religious; none should<br />\nbe learned infidels —all should be educated<br />\nChristians. With such convictions, he was a<br />\nmost eager and consistent supporter of everything which tended to make the religious life<br />\nmore vital to the students.<br />\n<br />\n3<br />\n<br />\nAnother service, rendered by Dr. Thomas to<br />\nthe University, came from his broad culture.<br />\nHe was the member of the Board of Trustees<br />\nwith whom (next to President Gilman) the students most frequently came in contact, and in<br />\nhim we found the true University spirit. He<br />\nhad none of that narrow specialization into<br />\nwhich professional men are so liable to fall ;<br />\nnone of that distortion of perspective which<br />\nmakes the science studied by you so important<br />\nand those studied by others so insignificant. In<br />\nhim we knew a man whose outlook was over a<br />\nwide field. He was a truly liberal man. Liberality has been defined as \"breadth on high levels,\" and it seems to me that Dr. Thomas' life<br />\nfulfilled that definition. Shallowness was as<br />\nforeign to him as narrowness. His breadth<br />\nwas that of the deep and mighty ocean.<br />\nFinally, his life was one of great influence on<br />\nHopkins men because of its kindliness, purity<br />\nand lovableness. One could not meet him without a friendly word. To chat with him was to<br />\ncatch an inspiration to effort, which lingered<br />\nlong after the conversation was finished. He<br />\nwas so cheerful, so buoyant and hopeful in his<br />\nview of life, so filled with brotherly kindness,<br />\nand his face was so turned towards those things<br />\nthat are pure and lovely, that his presence was<br />\na benediction. Good was it for so many of us<br />\nthat we knew him,and good was it for the University that his influence was so long manifested and so potent here.<br />\nBERNARD C. STEINER.<br />\n<br />\nA meeting of the class of '99 was held on<br />\nWednesday, November 3. The financial situation of the class was discussed and an assessment made. Mr. Dieffenbach addressed the<br />\nmeeting in behalf of The '98 Hullabaloo. The<br />\nclass voted an appropriation of $20 to The Hullabaloo. The election of class historian was<br />\npostponed until next meeting.<br />\nThe Fat Lady: Heavings! me diamonds is<br />\ngone! Hey yer seen 'em?<br />\nThe Snake Lady: _N-no; but I noticed the<br />\nglass-eater chewin' on somethin' a minute<br />\nago!—Bakintore Life.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nNEWS or A rORTNIGI-IT.<br />\nCOLLEGE CONGRESS.<br />\n<br />\nThe second regular session of the Senate,<br />\nheld on Wednesday, November 17, was decidedly more interesting and spirited than the<br />\nprevious meeting. The debaters displayed<br />\ngreater self-possession, and were, therefore,<br />\nmore effective. The side which affirmed that<br />\nthe \"silver question\" was now a dead issue, represented by Senators Fisher, R. D. Miller and<br />\nFitzgerald, won by an overwhelming majority.<br />\nSenators Fisher and Miller were heartily applauded. The open discussion was participated<br />\nin by Senators Ballard and Miller. The meeting was honored by the presence of Professor<br />\nAdams, who afterwards gave a favorable criticism of the debate. His advice to the speakers<br />\nis to write down their address, as an effective<br />\nmethod of impressing it on the memory, but to<br />\nuse no notes in speaking, as it is most important to be independent in the delivery.<br />\nThe subject for the next debate is : Shall<br />\nthe United States intervene in behalf of Cuba?\"<br />\nSenators Seth, Clark and Pender will take the<br />\naffirmative; Senators Ulman, Stearns and<br />\nHammond 'the negative. President Gilman<br />\nwill probably be present as the guest of the<br />\nSenate.<br />\nThe third regular meeting of the House of<br />\nRepresentatives was held Wednesday, October<br />\n10, in the Donovan room, McCoy ,Hall. Dr.<br />\nAdams was the guest of the House. The subject debated was: \"Resolved, That the result<br />\nof the work of the United States Bimetallic<br />\nMonetary 'Commission ought definitely to settle the silver question.\" The affirmative side<br />\nwas taken by Congressmen Greenbaum, Fosnocht and Frank; the negative side by Congressmen Gaddess, Levering and Kalb. The<br />\nquestion was very ably debated, and the arguments were effective, especially those of Fosnocht, Levering and Frank. The House took<br />\na very active part in the open discussion. Dr.<br />\nAdams, at the request of the House, spoke a<br />\nfew words. He complimented both the debaters and the House on their able discussion of<br />\nthe question. The subject for debate at the next<br />\n<br />\nmeeting of the House will be : \"Resolved, That<br />\nthe United States should intervene in behalf of<br />\nCuba.\" The affirmative side will be taken by<br />\nCongressmen Chambers, Bruce and Ramsay;<br />\nthe negative side by Congressmen Fisher, Ross<br />\nand Guggenheimer. Dr. Vincent will be the<br />\nguest of the House.<br />\nENROLLTIENT OF STUDENTS.<br />\n<br />\nThis autumn's enrollment of students shows<br />\na total gain of fifty-six over last year. The figures are:<br />\nPhilosophical Department:<br />\nGraduates.<br />\nUndergraduates.<br />\nSpecial<br />\n<br />\nMedical Department:<br />\nCandidates for M. D.—<br />\nFourth year<br />\nThird year.<br />\nSecond year<br />\nFirst year<br />\nDoctors of Medicine<br />\nTotal<br />\n<br />\nNov. 12,<br />\n'896.<br />\n206<br />\n144<br />\n32<br />\n<br />\nNov. 15,<br />\n1897.<br />\n<br />\n382<br />\n<br />\n394<br />\n<br />\n208<br />\n153<br />\n33<br />\n<br />\n17<br />\n26<br />\n29<br />\n34<br />\n36<br />\n44<br />\n63<br />\n42<br />\n-124 - 167<br />\n8<br />\n9<br />\n514<br />\n<br />\n570<br />\n<br />\nThis does not include the attendants on special courses of instruction given to Doctors of<br />\nMedicine, which were attended during the year<br />\n1895-96 by 69 physicians, and in the summer<br />\nof 1897 by 58 physicians.<br />\nATHLETIC ASSOCIATION.<br />\n<br />\nThe newly-organized General Athletic Association is taking active steps to better the<br />\ncondition of athletics at the University. A field<br />\nwill be secured and the rent guaranteed for five<br />\nyears. Five thousand dollars are to be raised,<br />\nwith the assistance of the alumni, which will be<br />\nexpended in fitting up the grounds. This will<br />\ngive our teams next spring good grounds for<br />\nout-of-door practice, in addition to the facilities<br />\nwhich the cage will afford, and will also enable<br />\nthem to make some money on the gate receipts<br />\nat games. The graduates and alumni members of the governing board of the Association<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nwere elected at the last meeting. They are:<br />\nDr. Renouf, Allan McLane, Robert Garrett<br />\nand W. H. Maddren. The undergraduate<br />\nmembers of the board will be elected by the<br />\nvarious classes.<br />\nTHE LITERARY PRIZES.<br />\n<br />\nA few days only remain until December I,<br />\nwhen the time appointed for THE NEWS-LETTER literary contest will close. The Thanksgiving holidays have given some relief from<br />\nregular work, and afford an opportunity to<br />\nthose who have found themselves too busy to<br />\ncompete. Prof. Adams, Prof. Greene and<br />\nMr. Guy Carleton Lee have consented to act<br />\nas judges. The offer is open to students in all<br />\ndepartments of the University. The conditions<br />\nare broad, and the prizes are as liberal as we<br />\ncan make them. The copy of THE NEWSLETTER containing the winning compositions<br />\nwill go to the exchange table of every prominent college paper in the country. It is important that we be well represented. We look to<br />\nthe students to make the contest a success.<br />\n<br />\nProf. Brooks will deliver a series of lectures<br />\non \"The Principles of Science as Illustrated by<br />\nZoology,\" beginning on Monday, November<br />\n29,at 5 P. M. These lectures will be held in the<br />\nlecture room of the Biological Laboratory, and<br />\nare not open to the public.<br />\nThe Philological Association met Friday,<br />\nNovember 19. Principal paper, \"The Sources<br />\nof Davenart's Albovine\" and \"Siege of<br />\nRhodes,\" Mr. Killis Campbell. Minor communication,\"The Arrangement of the Fables<br />\nof Marie de France,\" Mr. Murray Brush.<br />\nDr. F. R. Jones, instructor in political economy has accepted the position of instructor in<br />\nhistory and politics at Union College, Schenectady, N. Y. He left Baltimore last week,<br />\nand Dr. Hollander has taken the class in political economy in his stead.<br />\n<br />\n5<br />\n<br />\nPresident Gilman has been appointed by the<br />\nMayor one of five citizens to act with the law<br />\nofficers of the city in drafting a new charter for<br />\nthe city of Baltimore.<br />\nThe current number of the Johns Hopkins<br />\nUniversity Circular, contains a sketch of Dr.<br />\nHumphrey by J. S. Kingsley and B. W. Barton, and a sketch of Dr. Conant by George<br />\nLefevre.<br />\nPresident Gilman has invited Dr. and Mrs.<br />\nNansen to stay at his house during their sojourn in Baltimore.<br />\nrIEDICAL SCHOOL NOTES.<br />\n<br />\nThe first Pithotomy of the present academic<br />\nyear was given on November 27th, at 9 P. M.,<br />\nby the fourth year meds., to the rest of that<br />\nclass and to the faculty and Hospital staff. The<br />\nmeeting was at the Phi Kappa Psi house. It<br />\nincluded all that was necessary for the comfort<br />\nof those present in the line of smoke and drink.<br />\nThe literary part of the entertainment consisted of stories and songs by various members<br />\nof the staff, besides original topical songs by<br />\nMr. Dawson, of the fourth year. The word<br />\n\"Pithotomy\" was coined by the originators of<br />\nthe society, and is derived from the Greek<br />\nword Pithos—\"beer jug.\"<br />\nMessrs. Brown and Oliver of the third-year<br />\nclass have been made demonstrators in anatomy. Messrs. Flint, McCallum and Lewis of<br />\nthe second-year class have been made assistants in histology. Miss Sabine, also of the second-year class, is now demonstrator in anatomy.<br />\nMiss Sabine is about to publish in the Hopkins Hospital reports an article on \"The Seventh Cranial.\"<br />\nSAD DAYS.<br />\nThe melancholy days have come<br />\nFor barbers everywhere,<br />\nThe football season has arrived,<br />\nAnd all must wear long hair.<br />\n—Baltimore Life.<br />\n<br />\n\f6<br />\n<br />\nh.<br />\n<br />\nTHE NEWS-LETTER.<br />\nDR. REID'S TRIP.<br />\n<br />\nTHE LECTURES ON JAPAN.<br />\n<br />\nDr. H. F. Reid returned from his summer's<br />\ntrip on Wednesday November 17. He left<br />\nBaltimore on June 12, and spent some weeks<br />\ntaking measurements on the Forno glacier in<br />\nthe Engadin, together with Professor Ames.<br />\nFrom Switzerland he went to Russia, to take<br />\npart in an extensive journey of geologists<br />\nacross the Ural as far as the Western terminus<br />\nof the Great Siberian road. After this he<br />\nmet Dr. Clark at St. Petersburg, took part in<br />\nthe Congress, and then joined in a special trip<br />\nto Mt. Elbrux in the Caucasus.<br />\nIn the first days of October an excursion was<br />\nmade to Mt. Ararat. Mr. E. Stoeber, who ascended the greater Ararat, together with Dr.<br />\nEbeling, of Berlin, and Dr. Oswald, of Bale,<br />\nseparated from his companions. They gained<br />\nthe summit, were forced to spend the night at<br />\nan altitude of 16,000 feet, suffering much from<br />\ncold, and returned to the Cossack camp next<br />\nday. There they learned that Stoeber had not<br />\nreturned. An instant search after the lost man<br />\nwas rendered fruitless through a violent snowstorm and through the men's inability to speak<br />\nRussian with the Cossacks. After many difficulties and unavoidable delays, a party composed of Dr. Ebeling, Dr. Oswald and Dr.<br />\nReid continued the search until October 4,<br />\nwhen some Cossacks found Stoeber's body. He<br />\nhad evidently slipped on a ledge of rocks and<br />\nbroken his leg. The cold had killed him before<br />\nhe recovered consciousness. The accident was<br />\nentirely due to Stoeber's inexperience in<br />\nmountaineering.<br />\nDr. Reid returned by way of Odessa, Constantinople and Athens, and through the Mediterranean to Switzerland. At Crete he saw the<br />\nassembled fleet of the powers, and also their<br />\ntroops, which were stationed at Canea. One<br />\nfortress was flying the colors of nearly all the<br />\nEuropean nations.<br />\nHe also ascended Mt.<br />\nStromboli, a well-known volcano in the Lipari<br />\nIslands, but was disappointed in not finding<br />\nit in activity. In Switzerland he took final<br />\nmeasurements on the Forno glacier.<br />\n<br />\nA series of remarkable lectures on \"Modern<br />\nJapan\" was given during the past week. Dr.<br />\nDavid Murray lectured on \"Education in<br />\nJapan ;\" Professor Mits4kuri gave an account<br />\nof \"Recent Changes in Japan\" and of the \"University of Tokio,\" and Mr. Rokuro Nakaseko,<br />\none of our graduates in chemistry, gave some<br />\ncharming and realistic glimpses of modern<br />\nJapan.<br />\nBy request of Prof. Brooks, Prof. Mitsukuri spoke before the instructors and students of the Biological Department on Thursday morning, November 18. His interesting<br />\nreminiscences and amusing anecdotes of his<br />\nstudent days at the Johns Hopkins afforded a<br />\nstriking illustration for President Gilman's definition of an university as a\"societas magistrorum ct discipulorum.\" Dr. Sedgwick and Dr.<br />\nWilson were fellow students with Dr. Mitsukuri. Dr. Howell was then an undergraduate<br />\nand worked with him in physiology. Professor<br />\nMartin and Professor Brooks were the chief instructors of these men. Since then all have<br />\nbecome famous, and have spread abroad the<br />\nlearning derived from our University. Dr. Mitsukuri took his degree in '83, and is now professor of zoology at the University of Tokio.<br />\n<br />\nTHE BVIETALLIC<br />\n<br />\ncortrussioN.<br />\n<br />\nDr. Hollander delivered a lecture upon \"The<br />\nPresent Monetary Condition\" on Friday evening before the Historical Seminary. In the<br />\ncourse of his talk he gave a rapid sketch of the<br />\nmonetary history of the United States, but<br />\ndwelt principally upon the modern aspect of the<br />\nquestion, especially as affected by the results of<br />\nthe Bimetallic Commission. Dr. Hollander, as<br />\nSecretary of the Commission, was thrown in<br />\ncontact with many prominent European statesmen, among whom various opinions on the<br />\nmatter could be found. The sentiment in favor<br />\nof international bimetallism was everywhere<br />\nevident, especially in France. The reception in<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nEngland, contrary to the general opinion, was gridiron in the furious and fierce game of footcordial. The Embassy was not by any<br />\nball this afternoon. A breathless conclave of<br />\nmeans regarded as a delegation cringing for physicians said that it could not live. Women<br />\nfavors from the Court of St. James, but as Am- fainted and strong men wept. A gauze was<br />\nbassadors sent over to treat with Great Britain stretched in front of the grand stand to keep the<br />\nin response to a vote of the House of Commons. moaning spectators from the horrible sight.<br />\nThe mission cannot be looked upon as a failure, The game was the most brutal in the annals of<br />\nin spite of the fact that England's refusal to a most terrible game. The face of Captain<br />\nopen the Indian mints puts a stop to all nego- Wilson was torn to shreds, he losing both eyes.<br />\ntiations.<br />\nThe freshman manager carried Wilson's<br />\nIn spite of the arduous duties of the Commis- \"tongue from the field on a stick. The sophosion, time was found for more congenial tasks. mores won by a score of 12 to o.—Sequoict of<br />\nFrom several remarks of Dr. Hollander, we Leland Stanford University.<br />\nwould infer that the members of the Commission were present at sundry banquets, where<br />\nCATULLUS.<br />\nCI.<br />\nmirth and good cheer flowed in unison with<br />\nmore substantial matters.<br />\nThrough many climes, o'er many billows<br />\nborne,<br />\nBrother,<br />\nto thy sad funeral rites I've come,<br />\nPRES'T JORDAN on COLLEUE DISCIPLINE.<br />\nDeath's last reward to pour upon thy tomb,<br />\nDavid Starr Jordan, President of Leland And o'er thy silent ashes vainly mourn.<br />\nStanford Jr. University, writes in the October Though Fortune tore thee from me, yet receive<br />\nNorth American Reviezu on \"College Disci(0 wretched brother from my bosom reft!)<br />\npline.\" He adapts a saying of Bismarck, and<br />\nWhat ancient rite our fathers' custom left<br />\nsays of American college students : \"One With mournful honor o'er our dead to grieve—<br />\npart go to the clogs, one part to the grave, and<br />\nA brother's tears, whose number none can<br />\nthe rest are the strength of the republic.\" After<br />\ntell.<br />\nPointing out the defects in old methods and the<br />\nHail and forever, brother, fare thee well !<br />\nCARL WIGHT, 1900.<br />\nadvantages of modern tendencies in discipline,<br />\nMr. Jordan uses his own university as an illustration. The control of students at Leland<br />\nStanford is vested in a committee of five members of the faculty, who have full power to disPresident Sherman, of Cornell, has ofmiss any student whom they may consider un- fered a prize of fifty dollars, to be competed<br />\ndesirable. It is interesting to note that they for through the columns of the daily newspaper<br />\nhave express authority to discipline a man for of that University. Only matters of the nastudying too hard. Like Hopkins, Leland ture of reports, descriptions and comments<br />\nStanford has no code of rules, and prohibits will be accepted, and the competition shall be<br />\nnothing not forbidden by the laws of the State. open to every student of the University.—ExHazing President Jordan considers a species change.<br />\nof ruffianism. His remedy is<br />\nto get rid of the<br />\nkind of men who are likely to take part in<br />\nit.<br />\nA VALUABLE MAN.<br />\nHallroom<br />\n: Who's the star boarder at your<br />\nWESTERN FOOTBALL.<br />\nplace?<br />\nA crushed mass of humanity with every<br />\nMansard: A doctor! Before each meal he<br />\nbone<br />\nin it ground to<br />\nphosphate and dripping blood tells about the dangers and disasters resulting<br />\nwas laid beyond the pale<br />\nof the white wash from over-eating, you know.—Baltimore Life.<br />\n<br />\n\fTHE NEWS -LETTER.<br />\n<br />\n8<br />\n<br />\nebe petuoatetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS EopgiNS UNIVERSITY.<br />\n<br />\nDECEMBER<br />\n<br />\n2,<br />\n<br />\n1897.<br />\n<br />\nSubscription $1.50 per year. 15 cents a single copy.<br />\nEDGEWoRTH SMITH, '98.<br />\nEditor in Chief,<br />\nAssistant Editor in Chlet, - - ALBERT C. DIEFFENBACH,'98.<br />\n<br />\nConsulting Editors, -<br />\n<br />\nProf. KIRBY F. SMITH.<br />\nMoRRISON,'90.<br />\n<br />\nDEPARTMENT<br />\n<br />\nEDITORS.<br />\n<br />\nG. L. P. RA.HcLIEFE,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONGcOPE, Medical School.<br />\nV. A. Riasour,'98.<br />\nR. D. MILLER,'98.<br />\nJ. C. PRRNCH,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, '99.<br />\nR. H.GRIMES,'99.<br />\nBusiness Manager,<br />\n<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 23,q, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br />\n<br />\nCOLLEGE HALLS.<br />\n<br />\nIn this number of the NEWS-LETTER appears<br />\nthe latter half of a very interesting article by<br />\nProfessor Herbert B. Adams,on \"Student Life<br />\nin Edinburgh.\" In this description of customs<br />\nat the University of Edinburgh, Dr. Adams has<br />\nbrought up a point which merits the thoughtful attention of every member of our University—the existence, namely, of co-operative<br />\ncollege halls.<br />\nA distinguished guest of the University—Sir<br />\nMichael Foster—has recently said that one<br />\nchief source of strength with us lies in the fact<br />\nthat our University is still young enough to be<br />\nmoulded—that there are no iron-bound \"precedents\" to hinder us from developing along<br />\nthe lines of latest improvement, or from adopting unto ourselves the best features of all other<br />\neducational systems.<br />\nIf we accept this theory of constant improvement by selection as our creed—and we could<br />\nnot wish for a better one—then it behooves us<br />\nto consider carefully this system, only recently<br />\ninaugurated at a great sister university, yet already markedly successful there. Until a few<br />\nyears since, Edinburgh had been, like our-<br />\n<br />\nselves, destitute of any real student life; she<br />\nlacked that side of education which does not<br />\ncome to us from books or lectures, but rather<br />\nis absorbed by living in an atmosphere created<br />\nby a number of cultivated men and earnest<br />\nworkers. Now this void has been filled by the<br />\nmembers of the University themselves, and college halls have sprung up and are flourishing<br />\non the co-operative plan, and without any outside backing.<br />\nThat such a system, if adopted here, would<br />\nprove successful, is likely. That it is needed is<br />\nunquestionable. Students—especially those<br />\nseeking a doctor's degree—are all too prone,<br />\nabsorbed in their own special line of work, to<br />\nforget that duty toward self as an individual, as<br />\nwell as a unit of social humanity, demands of<br />\nthem a general and broadening cultivation as<br />\nan antidote to the narrowing effect of specializing. Again, who,of all these workers scattered<br />\nthroughout the city in boarding houses, has not<br />\nfelt that strain upon the will, greater than any<br />\nstrain of study, which results from sticking to<br />\nwork, day by day, monotonously, with hardly<br />\na taste of outside life to relieve the tension?<br />\nAnd,suffering this strain of lonely self-dependence, would he not draw fresh vigor and enthusiasm from an atmosphere of work and<br />\nearnest purpose, and from the society of cultivated men, come together in the common<br />\nroom of the hall for a little rest and chatting<br />\nafter breakfast or at the end of the day's work?<br />\nSuch a stimulus is dwelt upon in all stories<br />\nand descriptions of English university life,<br />\nwhere this system of halls is in use ; and<br />\nit is of only less value than that broadening of character and rubbing away of<br />\nangles which results from the contact of<br />\nman with his fellow-men. And then there<br />\nis the other side, more interesting to undergraduates, perhaps, than to graduates, yet of<br />\nimportance to both — the fellowship among<br />\nstudents which this system would foster and<br />\nthe friendships, to whose formation it would<br />\nstand sponsor. All these features—quite as<br />\nimportant in their results as the college work—<br />\nbelong to some extent to the fraternities. But<br />\ntheir scope is limited. The four hundred and<br />\n<br />\n\f0E44<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nI<br />\n<br />\n1<br />\n<br />\nodd members of the University whose homes<br />\nare out of the city prove the need, while they<br />\nargue the practicability of such a system.<br />\nLast year, at the outset of its career, the<br />\nNEWS-LETTER outlined two wants as being<br />\nmost pressing at the University, and pledged<br />\nits aid in supplying them. They were, better<br />\nathletic facilities, and more college life. Since<br />\nthen the first of these wants has been filled.<br />\nWith gratification we realize that a new spirit<br />\nhas pervaded the whole University from Dan<br />\nto Beersheba, from students even unto trustees, and that it has shown itself in the erection<br />\nof a cage and the search for a field for our athletes. The second want was for a more mature and definite form of college life. And<br />\nthis, too, bids fair to be realized. It is shown<br />\nin the sentiment against the silly forms of hazing formerly practiced here, as well as in the<br />\nestablishment of a college congress. And<br />\nnow, may we not hope that in some future time,<br />\nwhether near or dim, these halls, which will do<br />\nthe most of all toward furthering true academic<br />\nlife, may be embodied in our University? It<br />\nis, at least, a pleasant dream to construct them<br />\nin fancy. There might be one for medical students, lying conveniently half way between the<br />\nHospital buildings on Broadway, and the Laboratories clustered around McCoy Hall ; another for the graduates and members of the<br />\nfaculty, a third for undergraduates—all threads<br />\nof a web which would bring together the scattered lives of our students--which would bring<br />\nabout what Dr. Adams calls \"the real unity of<br />\nacademic life—a college centre where students<br />\nlive and educate one another in their own society—perhaps the most effective of all academic means of culture.\" Of course, these<br />\nhalls will not spring into existence spontaneously. But it is possible here, as was the<br />\ncase in Edinburgh, for a dozen or so students<br />\nto club together and<br />\nmake a beginning. And<br />\nfrom this beginning the development of the<br />\nsystem should be but a question of time.<br />\nFOOTBALL.<br />\n<br />\n.t<br />\nd<br />\n<br />\nWith the St. John's game our football season<br />\nPractically closed, as the game with the Baltimore Medical College was regarded as of little<br />\n<br />\n9<br />\n<br />\nimportance by Hopkins men, and was played<br />\nwith enough substitutes to cost us the game.<br />\nThe victory over our old rivals on Thanksgiving, however, left a very sweet taste in our<br />\nmouths, and considerable credit is due the team<br />\nfor the hard practice and plucky playing which<br />\ngave us the victory.<br />\nThere are, however, one or two lessons to be<br />\nlearned from the past season which are worth<br />\npointing out. One is, that it is as impossible<br />\nas it is unfair to expect the athletic reputation<br />\nof a university with nearly six hundred students to be adequately sustained by the almost<br />\nunsupported exertions of an undergraduate<br />\nbody amounting to scarcely one-fourth of the<br />\nwhole. There is enough good material in the<br />\ngraduate and medical departments to furnish<br />\nthe 'Varsity with teams which would place her<br />\non the level where she rightly belongs; but this<br />\nmaterial seems quite impossible to be reached.<br />\nOccasionally a \"grad.\" tries for the team, and<br />\nalmost invariably makes it if he practices. But<br />\neven this is but the exception which proves<br />\nthe rule.<br />\nThe other point is the impossibility of getting the best results out of what material we<br />\nhave, without adequate grounds and regular<br />\ncoaching. This was emphasized by the improvement in the team after Mr. Bond took it<br />\nin hand. On the whole, however, the result<br />\nhas been encouraging, and with a cage and an<br />\nathletic field we may indulge in a good many<br />\n\"hopes\" for better results next year.<br />\nCLIPPINGS.<br />\n<br />\n\"I wonder,\" said the philosophical student,<br />\n\"why a fight is called a scrap ?\"<br />\n\"Because it is a broken peace,\" replied the<br />\nCheerful Idiot, with his usual promptitude.—<br />\nExchange.<br />\n\"Nothing won\" ('oi), is the remark of the<br />\ncolleges, after admitting the freshman class this<br />\nyear.—Exchange.<br />\nThere was a time when every wheelman you<br />\nmet on the road was a gentleman ; now it is<br />\nhard to tell whether it is a gentleman or a<br />\nlady.—Baltimore Life.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\n<br />\nATHLETICS.<br />\nFOOTBALL.<br />\n<br />\n25 yards down the field and across the line.<br />\nHodges kicked goal. This settled the game,<br />\nand the Hopkins rooters went wild. Captain<br />\nRobinson was carried off the field on their<br />\nshoulders, under the waving Hopkins banner.<br />\nCambridge in general shared in Hopkins' rejoicing, and the sixty St. John's rooters present<br />\nwere about the only ones to whom the result<br />\nwas a disappointment. The line-up follows:<br />\n<br />\nJ. H. U., 6; ST. JOHN'S, 0.<br />\n'Varsity<br />\nThe<br />\nwon a brilliant victory over the<br />\nmen from Annapolis on Thanksgiving Day.<br />\nOnly a dozen rooters accompanied the team to<br />\nCambridge, but they cheered and sang and<br />\nyelled until the air seemed black—and blue, as<br />\nwell, to St. John's.<br />\nI. H. U.<br />\nPositions.<br />\nSi. John's.<br />\nLeft End<br />\nReynolds<br />\nCaptain Robinson won the toss, and St. Armstrong<br />\nLeft Tackle<br />\nPenn ington<br />\nJohn's kicked off to the 20-yard line. Hopkins Huff.<br />\nKennard<br />\nLeft Guard<br />\nTorbert<br />\nadvanced the ball gradually up the field. Straus Hancock<br />\nCentre.<br />\nCullison<br />\nwas given the ball repeatedly, and he bucked Rushmore<br />\nRight Guard<br />\n.Spates<br />\nthe line hard, rarely failing to gain. St. John's Haskell (Lazenby).Right Tackle.<br />\nSinclair<br />\nRight End<br />\nWinchester<br />\nlost ten yards on off-side play, but a moment Talty<br />\nQuarter-back.... .....Douglass<br />\nlater got the ball on downs. Then Brady and Mullen<br />\nRobinson (C.)... Left 'Halfback.<br />\nBrady<br />\nBlanchard alternated at runs around the ends. Hodges<br />\nRight Halfback...Blanchard (C.)<br />\nBoth men played well, and St. John's might Straus<br />\nFullback.<br />\nMackell<br />\nhave scored had not the tackling of Lazenby,<br />\nTouchdown—Robinson. Goal—Hodges.<br />\nHodges, Robinson and Straus broken them<br />\nScore—J. H. U. 6, St. John's o.<br />\nup. Lazenby played strongly. In his work<br />\nOfficials—Professor Chew (St. John's), referee;<br />\nat tackle he simply outclassed his opponent.<br />\nMackdermott (M. A. C.), umpire; Orem, (St.<br />\nThe rest of the line also played well in the John's), and Bouchelle (J. H. U.), linesmen.<br />\nearly part of the game, but St. John's was<br />\nsometimes able to break -through. A brace up<br />\nNOTES.<br />\ntook place in the closing moments of the first<br />\nhalf, when the ball went up toward St. John's<br />\nAfter the touchdown was scored the Hopgoal. Finally, at the three-yard line, on the kins rooters fell upon each other's necks and<br />\nthird down, Mullen passed to Straus. There wept for joy. Then they started out and<br />\nwas a misunderstanding, and the play was not clashed all the way around the field, to give<br />\nexecuted. It was a terrible blow to the rooters vent to their feelings. A countryman who<br />\non the side lines, who nevertheless kept up a came to \"see the game\" was much scandalized<br />\nsteady cheering. The half closed with St. at this levity, and remarked, \"Waal, I don't<br />\nJohn's in possession of the ball on their 4.0- know which air the dom'dest fools, them fellers<br />\nyard line.<br />\nshovin' each other in the middle of the field or<br />\nThere was a new infusion of life into J. H. them others tearin\"round like mad.\"<br />\nU. in the second half, and although St. John's<br />\nThe organized rooting and singing of the litalso played more strongly they could not break tle band of Hopkins men was very effective,<br />\nthrough the Hopkins line. In consequence, and quite outdid the efforts of the St. John's<br />\nthe ball went down the field. But the 'Varsity men, although they had several times our numlost on fumbles several times, and this contin- bers. It took with the crowd, too, who cheered<br />\nued to keep the result in doubt. The tide our college songs, and it certainly did much to<br />\nturned Hopkinsward once more, and at the 30- hearten our players.<br />\nyard line came the beginning of the end,<br />\nThe features of our playing were the interHodges and Talty figured in some matchless ference and the breaking of our opponents' ininterference, when Captain Robinson took the terference. At this Talty, Hodges, Robinson<br />\nball around St. John's left end and carried it and Straus were particularly good.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nRobinson made two good runs, one in the<br />\nfirst half for thirty yards, and another in the<br />\nsecond half for twenty-five yards, and the winning touchdown.<br />\nOur line in the main held splendidly, and repeatedly got the ball on downs.<br />\nBlanchard did the best work for St. Johns.<br />\n<br />\nB. M. C., 4; J. H. U., o.<br />\nHopkins lost its last game of the season on<br />\nSaturday, to Baltimore Medical College. The<br />\nMeds. were much heavier, and Hopkins was<br />\nweakened by the absence of both the regular<br />\ntackles. All the Meds'. gains were made<br />\nthrough the line.<br />\nj. H. U., 4; GALLAUDET,6.<br />\nThe 'Varsity lost to Gallaudet by 6 to 4, on<br />\nSaturday, November 13, in Washington. Gallaudet put up a strong game, and Hopkins<br />\nfought fiercely to score, and deserves much<br />\nPraise for practically tieing the deaf mutes.<br />\nIn the first half the 'Varsity eleven went<br />\nthrough Gallaudet's line almost at will, bu,<br />\nthey were not able to do so in the second. Gallaudet would probably have made ,a better<br />\nshowing had not their ambition led them to<br />\nstart before the baIl was in play. They lost a<br />\nnumber of times on this account. The whole<br />\nHopkins eleven did good work. The regrettable feature was that Armstrong had a stiff<br />\nbreeze in which to try for goal, while the home<br />\nplayers had a perfect calm. Straus scored the<br />\ntouchdown for Hopkins in the first half.<br />\n<br />\nHOPKINS, 4; B. M. C., 4.<br />\nThis game between Hopkins and the Baltimore Medical College was not of very great<br />\nInterest. The College team outclassed our men<br />\nentirely in weight. The 'Varsity team put up<br />\na good showing in<br />\nthe first half, scoring one<br />\ntouchdown. In the second half the weight of<br />\nthe College told upon<br />\nour men, and a touchdown was made by the College. The game<br />\nended in a dispute. When the kick for goal<br />\nwas being tried, the captain ran up and<br />\nhandled<br />\n<br />\nthe ball, putting it in play. Our men naturally<br />\ntook advantage of this, and carried the ball to<br />\nthe centre of the field. The College team did<br />\nnot look upon this in the same light as the<br />\n'Varsity did, and refused to play. The referee<br />\ndecided Hopkins' view correct, and Walter<br />\nCamp wrote to Captain Robinson that the decision of the referee is final.<br />\nHOCKEY.<br />\n<br />\nThe prospects for a good hockey team this<br />\nyear are unusually bright. This is proven not<br />\nonly by the large number of candidates, but<br />\nalso by their enthusiasm and determination.<br />\nThis season will witness a notable change in<br />\nthe choosing of the team, as well as of methods<br />\nand style in play. The chief feature of the new<br />\narrangement will be the presence of two teams,<br />\none following Hopkins' attack method and the<br />\nother the various styles of plays pursued by<br />\nother teams. In this manner weak points can<br />\nbe strengthened and faults remedied.<br />\nNo man on the team can feel secure of his<br />\nplace, for a substitute may at any time replace<br />\na regular if by his playing the \"sub\" proves his<br />\ncapability of strengthening that position. This<br />\nwill do away with the discouragement and loss<br />\nof interest that usually follows when a man fails<br />\nto make a team. The following candidates<br />\nhave given their names to the manager:<br />\nGraduates, S. A. Mitchell, McInnis; M. S.,<br />\nW. H. Maddren, G. W. Warren, W. W. Williams, L. V. Hamman, J. M. Hitzrot; Undergraduates, T. Fitzgerald, Jr., W. Straus, C.<br />\nHodges, H. Wright, G. Knapp, J. Levering,<br />\nJr., W. White, A. Murkland, R. C. Kerr, H.<br />\nMarshall, A. Wright, 0. Gminder, B. Bernheim, C. Guggenheimer, R. T. Abercrombie,<br />\nH. Whitman, C. Spencer.<br />\nTHEN AND NOW.<br />\n0 Marguerite!0 Marguerite!<br />\nWhen first we were acquaint,<br />\nYou were cold and I was mean,<br />\nThe same which now we ain't.<br />\n—Exchange.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\nTHE UEOLOGICAL SURVEY.<br />\n<br />\nThe State Geological Survey Commission,<br />\ncomposed of Governor Lloyd Lowndes,<br />\nComptroller R. P. Graham, President D. C.<br />\nGilman, and President R. W. Silvester, met at<br />\nthe Geological Survey headquarters at the<br />\nJohns Hopkins University on Tuesday at 3:30<br />\nP. M. to listen to the semi- annual report of<br />\nProfessor William Bullock 'Clark, the State<br />\nGeologist. Professor Clark informed the board<br />\nof the publication of the first volume of the<br />\n'State survey reports, and read extracts from<br />\nvarious letters which had been received from<br />\nvarious sources at home and abroad congratulating the survey and the State upon the high<br />\ncharacter of its first publication.<br />\nAn extended report was given of the present<br />\nstatus of the work and what had been accomplished during the past field season. Professor<br />\nClark stated that between 200 and 300 square<br />\nmiles in Western Maryland, chiefly in Allegany<br />\ncounty, had been topographically surveyed in<br />\nco-operation with the United States Geological Survey ; that the magnetic work had been<br />\nfurther extended, several additional county<br />\ntowns asking for the co-operation of the State<br />\nsurvey in establishing meridian lines, while all<br />\nthe magnetic and astronomical work for the<br />\nWestern Boundary Survey had also been<br />\nplaced under the supervision of the State Geologist ; that the work inaugurated the previous<br />\nyear upon the building stones of the State had<br />\nbeen practically brought to a conclusion, and<br />\nthe preparation of the manuscript of the report<br />\nwas already well advanced; that detailed geological surveys had been made of Allegany<br />\nand Garrett counties and portions of Cecil,<br />\nKent and Anne Arundel counties ; that the<br />\nstudy of the agricultural soils in their relations<br />\nto geology had been carried on in the same<br />\ncounties, and finally that much preliminary<br />\nwork along various lines of investigation had<br />\nbeen taken up in various portions of the State.<br />\nProfessor Clark also informed the board regarding his recent attendance upon the International Geological 'Congress at St. Petersburg, where he had been sent by appointment<br />\n<br />\nL-<br />\n<br />\nof the Governor to represent the State as State<br />\nGeologist.<br />\nAfter the discussion of plans for future work,<br />\nthe members of the Commission examined the<br />\nlarge collections which have been brought together under the auspices of the Survey.<br />\nALWINI NOTES.<br />\n<br />\nR. P. Bigelow, Ph. D.,'92, who is instructor<br />\nin biology at the Massachusetts Institute of<br />\nTechnology, has been elected editor of The<br />\nAmerican Naturalist.<br />\nW. J. Karslake, Ph. D., '95, is professor of<br />\nchemistry at Butler University, Irvington, Ind.<br />\nJ. E. Bucher, Ph. D., '94, is professor of<br />\nchemistry at the Rhode Island Agricultural<br />\nCollege, Kingston.<br />\nF. K. Cameron, Ph. D., '94, who has been<br />\nassociate professor of chemistry at the Catholic University, is now research assistant in<br />\nphysical chemistry at Cornell.<br />\nH.E. Griffith, graduate student in chemistry,<br />\n'96, is assistant in chemistry at Knox College.<br />\nGeorge P. Bristol, Ph. D., is professor of<br />\nGreek at Cornell.<br />\nH. Friedenwald, A. B.,'90, is superintendent<br />\nof the manuscript department in the Library of<br />\nCongress.<br />\nH. P. Thieme, Ph. D., '97, is assistant professor of French at Earlham College.<br />\nWESTERN JUSTICE.<br />\nJudge: \"What are you up for, sir?\"<br />\nPrisoner: \"Picking pockets, Your Honor.\"<br />\nJudge: \"Seeing that you are so honest<br />\nabout it, I will only charge you $20.\"<br />\nPrisoner: \"I only have sixteen.\"<br />\nJudge: \"Officer, take this man out in the<br />\ncrowd and let him mix until he gets four more<br />\ndollars! Next case.—Sequoia.<br />\n<br />\nBrown-Jones:<br />\nJones-Brown:<br />\nBrown-Jones:<br />\nJones-Brown:<br />\nmore Life.<br />\n<br />\nI raise you $5.<br />\nI X-rays you $5.<br />\nWhat do you mean by that?<br />\nI see you, of course.—Balti-<br />\n<br />\n\fThe Beyg' Latin gGhoel<br />\n<br />\nEmtablished 1880.<br />\n<br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Head<br />\n<br />\nMaster.<br />\n<br />\nTelephone Call 1822.<br />\n<br />\nARTHUR F. LAWRENCE & CO.<br />\nLeading Dealers in<br />\n<br />\nThis school has a continuous history of<br />\nover fifty years<br />\n:It was reorganized under<br />\nits present management<br />\nin 1894.<br />\n<br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br />\n<br />\n6 W. SARATOGA STREET,<br />\nY. M. C A. BUILDING,<br />\n<br />\n112arpland Citle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE<br />\nTELEPHONE 1376.<br />\nT. K.<br />\n<br />\nWORTHINGTON,<br />\nJESSE MLLES,<br />\nL. M. DUVALL,<br />\nPresident.<br />\nSec`y-Treas.<br />\nVice-President.<br />\n<br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nCAPITAL, $100.000.<br />\n<br />\nSAVINGS DEPARTMENT.<br />\n<br />\nCOMMONWEALTH BANK,<br />\nEUTAW ST.,<br />\n<br />\nFACING MADISON.<br />\nGEO. YAKEL,<br />\nJOHN R. TIOOPER,<br />\nVice- Prest.<br />\nCashier.<br />\n-DIRECTORS.<br />\nJordan Stabler,<br />\nJohn N. Matthews,<br />\nLouis Yakel,<br />\nJefferson J. Walsh,<br />\nRobert Biggs,<br />\nJames R. Wheeler,<br />\nDr. T. A. Ashby, George A. Blake.<br />\nJ. K. Ober,<br />\nMurray Vandiver,<br />\nJesse F. Ely.<br />\nJames H. Preston,<br />\nM. H. Ould,<br />\nJoe. G. Valiant.<br />\nGeorge Yakel.<br />\nLarge or small sums, for long or short period., received on favorable<br />\nterms. Call at the Bank for information.<br />\nJAS. R. WHEELER,<br />\nPresident.<br />\n<br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br />\n<br />\nGIFFORD de JERSEY MESNY,<br />\n<br />\nDIRECTORS:<br />\nA. Whitridge,<br />\nAlexander Brown,<br />\nEdgar G. Miller,<br />\nThomas<br />\nehomas Hill,<br />\nGeorge<br />\nWhitelock,<br />\nJesse Hilles,<br />\nH. H. Perkins,<br />\nJacob I. Cohen,<br />\nC. C. Shriver,<br />\nM. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application.<br />\n<br />\n1<br />\n<br />\nIf<br />\n<br />\nThe days are<br />\ndark, the days are drear,<br />\nThe moments<br />\nThe days are sad, now are murky;<br />\nthe days are bad<br />\nPer the poor Thanksgivi<br />\nng Turkey!<br />\nY. M. H.0. D.<br />\n<br />\n639<br />\n<br />\nBaltimore and Howard Sts.<br />\nPree Went.<br />\n<br />\nArthur H. Hall,<br />\n<br />\nVice-President.<br />\n<br />\nSec'y a141 Treas.<br />\n<br />\nThe A.G. Alford Sporting Goods Co.<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\nTelePh011e<br />\n<br />\n2573,<br />\n<br />\nNORTH CHARLES STREET.<br />\n<br />\nfiEfILD & DELfitiftY,<br />\n<br />\nHAMBURGERS',<br />\nGeo. P. Mordecai,<br />\n<br />\n226<br />\n<br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br />\n<br />\nLet not the sun go down upon your overcoatlessness<br />\nThis $20 Overcoat we have mentioned frequently because<br />\nIt is a genuine<br />\nbargain, if ever there was a bargain offered in<br />\nOvercoats.<br />\nA spick and span Overcoat is second in importance<br />\nonly<br />\nto the spick and span<br />\nTurkey on Thanksgiving Day.<br />\nLoose-fitting Overcoats—not too loose; tight-fitting Overcoats—not too tight; long Overcoats, short Overcoats, Overcoats with slik sleeve<br />\nlining, Overcoats with satin shoulder<br />\nlining, Overcoats with part silk and part fancy lining, Overcoats In every desirable color and style, and in every desirable price from $7.50<br />\nto $35.<br />\nIf you have a snug<br />\nand comfortable Overcoat you are<br />\nfixed for the winter.<br />\nWhy not attend to this detail to-day?<br />\nWe are constantly adding to our assortment of Readymade-to-Fit Clothing.<br />\nWonderful bargains are to be had<br />\nnow in Winter<br />\nSuits, $7.50 to $25.<br />\nNew Handkerchiefs! A fine line of the Silk Initial<br />\nkind<br />\nhas just arrived. A<br />\nWhite Handkerchief with handsome<br />\nborders-3for 25 cents.<br />\nWe sell nothing but Good Clothing, and we sell it<br />\nCheaply!<br />\n<br />\nGeo. L. Harrison,<br />\n<br />\nArtist Photographer,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNORTH EUTAW<br />\n<br />\nST., Near<br />\n<br />\nGIVE US A CALL.<br />\n<br />\nGENT'S<br />\nFINE FURNISHINGS.<br />\n<br />\n\"Ztbe Eutaw<br />\nA. WAGNER.<br />\n<br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br />\n<br />\njj L. LAMBURO'S<br />\n611 N. HOWARD STREET,<br />\nBALTIMORE, MD.<br />\n<br />\nMerchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br />\n<br />\nFict9s<br />\n13c:tuners<br />\n1%149QS<br />\n<br />\n95(t<br />\nQLOVES<br />\n614411IIIIrir new /Wan<br />\n<br />\nFlorist<br />\n<br />\n•<br />\n<br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers.<br />\n<br />\nMadison Cycle<br />\n315 Madison St.<br />\n<br />\nMRs, OTTO SCHULER,<br />\n322 WEST SARATOGA ST.,<br />\n<br />\nNEAR EUTAW,<br />\n<br />\nBALTIMORE.<br />\n<br />\nLucke & Sons,<br />\n<br />\nMerchant Tailors,<br />\n<br />\nNO. 205 E. FAYETTE STREET,<br />\nO PPOSITE<br />\n<br />\nTHE NEW POST OFFICE<br />\n<br />\nBALTIMORE.<br />\n<br />\nWe will<br />\ninsure the finest workmanship and styles in Tailoring as<br />\nalso well-fitting garments.<br />\nThe latest varieties of goods always on hand.<br />\n<br />\nNEAR EUTAW.<br />\n<br />\nWork called for and delivered.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nSPECIAL, DISCOUNTS to Students<br />\nmentioning this advertisement.<br />\n<br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br />\n<br />\nSuits Pressed While You Walt.<br />\nPants Pressed.<br />\n15c„<br />\nSuits Pressed<br />\n50c.<br />\nSuits Cleaned<br />\n$1.00<br />\n<br />\n218 N. Charles Street,<br />\n<br />\n6 E.BALTIMORE St<br />\n<br />\nA few doors South of Johns Hopkins University<br />\n<br />\nRepairing of any description at<br />\nReduced Prices.<br />\n<br />\nSISCO BROS.<br />\n<br />\nSAMUEL HUNT'S SONS<br />\n<br />\nNew<br />\nM Usic<br />\nStore ia<br />\n<br />\nDOOR TO HOPKINS UNIVERSITY<br />\n<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\n<br />\nReduction in Prices.<br />\nThe only house keeping<br />\nGloves in repair for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time a new<br />\npair given in exchange.<br />\n01.25 London Tan Gloves<br />\nreduced to 95 cts.<br />\nSee if you can match them<br />\nfor 611.25.<br />\n<br />\n•0•<br />\n<br />\nPOOL PARLOR,<br />\n<br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br />\n<br />\nFine Goods at<br />\nMBROSE CPERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n224<br />\n<br />\nW. Fayette Street, near Howard,<br />\nBALTIMORE, MD.<br />\n<br />\n\fBARTHOLOMAY BREWERY CO.<br />\n<br />\nJNO. HEINZERLING.<br />\n<br />\nW. .1. WICRHAM•<br />\n<br />\nHEINZERLING<br />\n<br />\nFM9 ROCHESTER, N. Y.<br />\n<br />\n& CO.<br />\nOffice & Factory,<br />\n<br />\nBohemian ot<br />\nBavarian ot<br />\nMaerzen<br />\nApollo ot<br />\n<br />\n2I8-.r W. Conway St.<br />\n<br />\nCHALLENGE GINGER ALE<br />\nOur<br />\nCLUB GINGER ALE<br />\nSpecialties: CHAMPAGNE CIDER (ExtraDrY)<br />\nSPARKLING KOLAFRA<br />\n<br />\n.<br />\n<br />\n'pHONE • • •<br />\n204<br />\n<br />\ngallkiniaMINEIII<br />\n<br />\n'<br />\nI 060—Telephone--2060<br />\n<br />\nBALTIMORE BRANCH:<br />\n<br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\n<br />\nv.10<br />\n<br />\nlow<br />\n<br />\no•<br />\n<br />\nEADY<br />\n<br />\nGEO. C. SUCRO, MANAGttH<br />\n<br />\nvitrllito<br />\n„ 60<br />\n<br />\nlkilt:;?\",fk<br />\niec.14<br />\n,11<br />\n<br />\nMandolins<br />\nGuitars •<br />\nBanjos<br />\n•<br />\n<br />\nWashburn<br />\n<br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br />\n<br />\nfl'1<br />\nT<br />\n<br />\nf,• -<br />\n<br />\nH. R. EISENBRANDT SONS,<br />\n<br />\nf„<br />\n'Io<br />\n<br />\nR9G*:'<br />\n<br />\nSOLE ABENTS.<br />\n<br />\na Month.<br />\nPianos $5 Low<br />\nPrices<br />\nEasiest Terms.<br />\nTHEO.<br />\n<br />\nN. E. Corner<br />\n<br />\nCHARLES AND LEXINGTON STS.<br />\n<br />\nWARNER.<br />\n<br />\nSEND 6'tIN STAMPS ACTUAL COST OF MAILING AND GET ONE,<br />\n<br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERY CO..<br />\nBALTI MORE,MD. U.S.A.<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS,.<br />\nCANES, tire. . .<br />\n<br />\nbatters<br />\n<br />\nMilk and<br />\nCassintere Hato<br />\n<br />\nTICOI<br />\n<br />\nC2<br />\n<br />\nAgents for<br />\ntor Walter Barnard London Hats.<br />\n<br />\nYa'<br />\n<br />\nMANUFACIURIR6 OP<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4# Standard Machines<br />\nMimeograph Work.<br />\nrented at Si per week<br />\n<br />\nTYPEWRITER INSPECTION & SUPPLY CO,<br />\n15 NORTH STREET.<br />\n<br />\nPrice Innovation! Cash Consideration!<br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nJNO. M. KEELER,<br />\nMaker of Men's Garments.<br />\n<br />\n6 N. CALVERT ST.. Opp. P. 0.<br />\n<br />\nThe Chas. Willifis Surgical Instrument Co.<br />\n<br />\nBENJ. A. NELSON, Oeu'l Manager.<br />\nManufacturers<br />\nand Importers of<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nMantle lioniery, Trusses, Rubber Goods,Ace.<br />\n<br />\nFINE SkIIMIC.,IL INSTINMENTS,<br />\n<br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE 771.<br />\n<br />\nNORTH GERMAN LLOYDS.S. CO. NEW YORK<br />\n01.6 LONDON,<br />\n<br />\nTO BREMEN, • •<br />\nPARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN ••• •<br />\nDIRECT.<br />\n<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER & CO.<br />\nFor particulars apply to<br />\nGeneral Agents.<br />\n<br />\nevery description. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br />\n<br />\nF. It bilVlbSON & (2.<br />\n<br />\n509 W. Franklin Street,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nTelephone 2095.<br />\n<br />\nATLANTIC TRyIrNSPOU LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br />\nBaltimore Storage & Lighterage Co.,<br />\n<br />\nNew York Shipping Co.,<br />\n<br />\n403-409 WATER STREE7,<br />\n<br />\nI BROADWAY,<br />\n<br />\nBALTIMORE.<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 4z5 Water Street,[Second St.]<br />\nAdjoining Custom House on the West<br />\n<br />\nShort Insurance for a Day<br />\n. or Longer Period.<br />\n<br />\nTHOMAS I. CAREY, Pres.<br />\n<br />\nBOARD OF DIRECTORS:<br />\n<br />\nJesse Tyson,<br />\nFrancis white,<br />\nRichard Cromwell,<br />\nRICHARD B. POST, holy.<br />\n<br />\nA. J. Inman,<br />\nFord. C. Latrobe,<br />\nJoshua G. Harvey,<br />\nWilliam Harvey,<br />\nHenry James,<br />\nJames W. Bates,<br />\nAndrew D. Jones. GRIFFITH FM/MITER, int. de<br />\n<br />\nNEW YORK.<br />\n<br />\nJOHN V. RUPPERT,<br />\nMERCHANT TAILOR,<br />\n<br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for $10.00 and upwards.<br />\nScouring, Altering aud Repairing a Specialty,<br />\n<br />\nGUGGENHEIMER, WEIL & Co.<br />\nStudents'...<br />\n<br />\n\f", "format": "basic_html", "processed": "1'A' WNW<br /><br />\nvol. II. I or J it I t<br /><br />\nDECEMBER 2d, 1897.<br /><br />\nt t is<br /><br />\nNo. 4.<br /><br />\ntbc<br /><br />\n•<br /><br />\nNicuisA-Ccatiter<br />\n•<br /><br />\n•<br /><br />\n•<br />\n•<br />\n•<br /><br />\n•<br />\n•<br /><br />\nPress of<br />\n411 Cruggenheimer, Weil &amp; Co.<br /><br />\nPublished by Students of<br />\net, THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br /><br />\nISSUED<br /><br />\nBALTIMORE<br /><br />\ntIt<br /><br />\nFORTNIGHTLY<br /><br />\n-14111111<br />\n11 P.R BOYS<br />\nTHE UHIVERSITT SCHOOL.<br />\nW. S. MARSTON, A. II and C. E.,<br />\nPrincipal.<br /><br />\n710 and 712 Madison Ave.<br /><br />\nTHIM SCHOOL prepares boys for admiesion to the John, Hopkins or any UhiversitY or<br />\nScientific School. It has Stied more than one hundred for the Johns Hopkins alone,<br />\nand many for Harvard, Yale, Princeton, the Massachusetts Institute of Technology, the<br />\nTroy Polytechnic and other College. and Schools. In October. 1894-96 two of the flee<br />\nscholarships given at the John.' llopk hie innew mitirloulAtes, were awarded to it. pupils. It<br />\nhaa a good laboratory and•well equipped gymnasium widen la under the charge of it oompetent instructor. roc further Information or for catalogues, address the Principal,at No. loll<br />\nN. Calvert Street.<br /><br />\nB. G. ElCHELBERGER,<br />\n1300K8 AND FINE STIATIONBRY,<br />\n308 N. CHARLES ST.<br />\nY. a. ci. •. BUILDING.<br /><br />\nU<br /><br />\nBaltimore, Md.<br /><br />\nThe professors and students of the Johns Hopkins<br />\nUniversity will find it to their advantage to examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 70x,703 and<br />\n705 Madison avenue, cor. Eutaw St. Telephone 817.<br /><br />\n(ISSUED EVERY FRIDAY)<br /><br />\nThe Society Paper of Baltimore.<br />\nBRIGHT AND BREEZY<br /><br />\nCushing &amp; CompanyIII<br /><br />\nBOOKSELLERS<br /><br />\nAND<br /><br />\nSTATIONERS<br /><br />\n34 WEST BALTIMORE STREET.<br />\n0011001., LAW, MEDICAL, AND CLASSICAL AM/ P4180ELLANLICOUS BOOKS.<br />\nKeep eone•ntly on hand the Text Books need in John. Hopkine University, John, Hopkins<br />\nHospital, and The Woman,<br />\n.College of Baltimore.<br />\nSTATIONERY.—For School, Family, Office and Hank.<br /><br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br /><br />\nCameras &amp;.Siaplies.<br /><br />\noe<br /><br />\nDeveloping<br />\nand<br />\nOt<br />\nPrinting.<br /><br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO,<br /><br />\nThej9_hns Hopkins University Circular containing announcements<br />\n.. of the Collegiate and Graduate courser offered for the aca.. demic year beenning October 1st, i&amp;ronay be had on appi. cation to the Registrar of the Johns Hopkins University.<br /><br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of thejohns 1-t9_pkins Medical School may also<br />\n.. be had on application to the Registrars.<br /><br />\n106 N. Charles St.<br /><br />\nMANDOLINS Are used exclusively by all the leading amateurs,<br />\nprofessionals and College Clubs, from Maine to<br />\nGUITARS<br />\nCalifornia. ;gr. Only one grade, the BEST.<br />\nThe celebrated Griffith Blue End Strings for the Banjo, Mandolin and Guitar seldom snap.<br />\nSpecial discount to Students.<br />\nBuy direct from the manufacturers and save the middleman's profit.<br />\nMANUFACTURED BY<br />\nF. H. GRIFFITH &amp; CO.,<br /><br />\nQRIFFITH<br /><br />\nMention thia paper when you call or write.<br /><br />\nD. E. WILLIAMS,<br /><br />\nTAILOR AND SHIRT MAKER,<br />\nN. E. coy. Lexington and Liberty Sts.<br />\nFt aca rri<br />\nGents Underwear made to Order; also Dyeing, Scouring and<br />\nRepairing.<br /><br />\nYou Fairly Fly on<br /><br />\na<br /><br />\neating<br />\n\"K Grand\"<br /><br />\n1.<br />\n.<br />\n11111.1<br /><br />\nFactory and Salesroom, 87 i N. Howard St., Baltimore, Md.<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br /><br />\n. Text Books .<br />\n. Note Books .<br />\nStudents' Supplies<br /><br />\nMadison &amp; Howard Sts.<br /><br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain—\"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO,, in N. Charles St.<br /><br />\nBaltimore Hardware Co., Baltimore &amp; Greene Sts.-Branch.<br /><br />\n'Moe flews lLetter.<br />\nVol. II.<br /><br />\nFortnightly<br /><br />\nSTUDENT LIFE IN EDINBURGH.<br /><br />\n10<br /><br />\ns,<br />\n.0<br />\nr.<br /><br />\nd.<br /><br />\n3t.<br /><br />\nLife in a Scotch college is well and economically ordered upon the basis of student selfgovernment. There is no needless interference<br />\non the part of the authorities. There is no<br />\nwatching or supervising, no gating,\" or shutting in of students at an early evening hour, as<br />\nin an English college. In Edinburgh a<br />\nstudent-lodger, as in America, has his own<br />\npass-key and comes or goes when he likes. A<br />\nCollege Hall in Scotland is managed very<br />\nmuch like an American City Club or College<br />\nFraternity House. The Hall chooses its own<br />\nofficers. A house committee has general<br />\ncharge of all matters of interior concern. Only<br />\nthose students are received as members who<br />\nare approved or elected. Any obnoxious member may be disciplined or expelled.<br />\nThe<br />\nCharges made for rooms, which are furnished<br />\nwith all things needful, are according to location. The cost of board is assessed pro rata<br />\nupon the members of the common mess, exactly as in old-fashioned student commons, or<br />\ndining clubs, at Harvard and Yale.<br />\nIn the Scotch, as well as in the English colleges, a visitor is impressed with the good administration and efficient household service.<br />\nThere is a well-developed spirit of social unity<br />\nand good fellowship. In these points our<br />\nAmerican dormitory system at boys' schools<br />\nand men's colleges is, in most cases, weak. The<br />\nservice and management are usually bad. Our<br />\nAmerican colleges for women are far superior<br />\nto the old-fashioned dormitories for men. At<br />\nSmith and Bryn Mawr, as in English and<br />\nScotch colleges, you will find common diningrooms and common parlors in the buildings<br />\nwhere students lodge. This, of course, promotes sociability, and the common life, which,<br />\nin men's colleges, is too often relegated to the<br /><br />\nNo. 4<br /><br />\nfraternity house, the gymnasium, the \"cage,\"<br />\nor the ball field. To this general rule there are<br />\nwholesome exceptions a t Lawrenceville,<br />\nWorcester Free Academy, Rutger's College,<br />\nTrinity College, N. C., and other places.<br />\n• The experience of Oxford, Cambridge and<br />\nEdinburgh Universities has shown the possibility of good social organization in dormitories and of a real common life in large academic towns, where the individual, unless living in some college, is in danger of isolation<br />\nand a more or less hermit mode of existence.<br />\nEspecially in Edinburgh has the institution of<br />\nUniversity Halls, on Castle Hill, socialized and<br />\nunified the hitherto separate and scattered elements of the great student body. It is both<br />\nfeasible and desirable in American college<br />\ntowns to bring together, in the form of Students' Unions, little bands of congenial spirits,<br />\nwho can form social clubs, or open fraternities,<br />\nto which desirable members may be gradually<br />\nelected, upon a broad and liberal plan. The<br />\nupper rooms of the club-house, as in our present fraternity houses, should be rented to members. There should be a common room, or<br />\nparlor, and a dining-room on the first floor, a<br />\nclub cuisine in the basement, and bathrooms in<br />\nall the upper stories. A club mess can easily be<br />\nsustained by residents and boarders under the<br />\ndirection of a student manager or steward,<br />\nwho should cater for the club mess and regulate expenses according to the wishes of its patrons. The business affairs of the club, the<br />\nelection of new members, the collection of<br />\nrents, dues, etc., should be in charge of a house<br />\ncommittee. This kind of administration is well<br />\nunderstood in some of our American College<br />\nFraternities, but it needs social extension and<br />\nacademic popularization.<br />\nIn the Scotch College Hall at Ramsay Garden I was greatly impressed with the interior<br />\nart decorations. As you ascend the winding<br />\nstairways, you find the walls beautifully<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nadorned with hundreds of photographs of Old<br />\nEdinburgh buildings. Modern improvements<br />\nin the \"Old Town\" on the hill have caused<br />\nthe removal of many ancient landmarks and<br />\nhistoric monuments, architectural facades and<br />\npicturesque courts, or ancient \"wyndes,\"<br />\nwhich were once the artist's and tourist's delight. You will now find them all preserved in<br />\nartistic ways, by drawings and photographs on<br />\nthe staircases of the College Hall at Ramsay<br />\nGarden. In the common room of this hall the<br />\nwalls are artistically frescoed to represent certain scenes in Celtic mythology. There is an<br />\nearnest attempt every year at the Edinburgh<br />\nSummer School to revive old Celtic decorative<br />\nart, of which a pleasing exhibition is made on<br />\nacademic premises and in prints and publications.<br />\nEdinburgh is a wonderfully beautiful town,<br />\na queenly city, a modern Athens, set upon hills,<br />\nwith broad thoroughfares, noble monuments<br />\nand public buildings, lovely gardens, extensive<br />\nparks and drives, magnificent outlooks towards<br />\nthe mountains and across the Firth of Forth.<br />\nBut some idea of what the condition of the<br />\ntown once was can be obtained by glancing at<br />\nthe squalid \"survivals\" of filth and misery<br />\nin \"Cowgate\" and other old-time streets and<br />\nalleys in which now dwell \"the submerged<br />\ntenth,\" apparently sunken below the present<br />\nlevel of the city, whose traffic and modern<br />\npromenades are more conspicuously seen<br />\nalong those gigantic causeways which cross the<br />\nold historic ravines or gullies of Edinburgh.<br />\nIn the newest art gallery of the city you will<br />\nfind in an upper room a large collection of<br />\nsketches and water colors, showing Old Edinburgh in all its picturesque squalor. Almost<br />\nevery bit of quaint architecture, every nook and<br />\ncorner of the ancient town, is thus immortalized by the faithful hand of art ; but we must<br />\nremember that those old rookeries on High<br />\nstreet and Canongate, while interesting to look<br />\nat, were not sanitary places of abode. As Robert Louis Stevenson says : \"It is easy to be a<br />\nconservator of the discomforts of others. . . .<br />\nAssuredly, in driving streets through the black<br />\nlabyrinth, a few curious old corners have been<br />\nswept away, and some associations turned out<br /><br />\nof house and home. But what slices of sunlight, what breaths of clean of air, have been<br />\nlet in I And what a picturesque world remains<br />\nuntouched I\"<br />\nWhoever visits Edinburgh will be grateful<br />\nto the memory of Robert Louis Stevenson, and<br />\nwill read and re-read his \"Picturesque Notes\"<br />\non this fascinating old city. No writer has better caught the spirit of the place or sketched its<br />\nsalient features with a truer hand. The visitor<br />\nwill surely encounter this genius loci, Robert<br />\nLouis Stevenson, in the National Portrait Gallery of Edinburgh, where a marble bust of the<br />\ncharming author of \"St. Ives\" greets you<br />\nwith an almost life-like welcome. The man<br />\ntruly lives in literature and in art. The following brief extracts from his \"Picturesque Notes\"<br />\ndescribe Edinburgh :<br />\n\"Few places, if any,\" he says, \"offer a more<br />\nbarbaric display of contrasts to the eye. In the<br />\nvery midst stands one of the most satisfactory<br />\ncrags in nature—a bass rock upon dry land,<br />\nrooted in a garden, shaken by passing trains,<br />\ncarrying a crown of battlements and turrets,<br />\nand describing its warlike shadow over the<br />\nliveliest and brightest thoroughfare of the New<br />\nTown. From their smoky beehives, ten stories<br />\nhigh, the unwashed look down upon the open<br />\nsquares and gardens of the wealthy ; and gay<br />\npeople sunning themselves along Princes<br />\nstreet, with its mile of commercial palaces beflagged upon some great occasion, see, across a<br />\ngardened valley set with statues, where the<br />\nwashings of the old town flutter in the breeze<br />\nat its high windows. And then, upon all sides,<br />\nwhat a clashing of architecture I In this one<br />\nvalley, where the life of the town goes most<br />\nbusily forward, there may be seen, shown one<br />\nabove and behind another by the accidents of<br />\nthe ground, buildings in almost every style<br />\nupon the globe. Egyptian and Greek temples,<br />\nVenetian palaces and Gothic spires, are huddled one over another in a most admired disorder; while, above all, the brute mass of the<br />\nCastle and the summit of Arthur's Seat look<br />\ndown upon these imitations with a becoming<br />\ndignity, as the works of Nature may look down<br />\nupon the monuments of Art.\"<br />\nHERBERT B. ADAMS.<br /><br />\nTHE NEWS-LETTER.<br />\nDR. T11-1011AS.<br /><br />\nDr. James Carey Thomas was born in Baltimore on July II, 1833, and died on November<br />\n9, 1897. He graduated from Haverford College in 1852, and from the Medical School of<br />\nthe University of Maryland in 1854. He was<br />\na trustee of the Johns Hopkins University from<br />\nits opening until his death.<br />\nHis efficient, faithful and devoted work in<br />\nmany lines is known to all men. He was a<br />\nphysician in the active practice of that arduous<br />\nprofession, a minister of the 'Gospel in the Society of Friends, a public-spirited philanthropist, keenly interested in every plan for the improvement of his fellowman ; an officer and a<br />\nzealous supporter of the Young Men's Christian Association in this city, and a trustee of<br />\nseveral important educational institutions.<br />\nThis is not the place to write of these manifold<br />\nfields of activity. But it is eminently fitting that<br />\nreference should be made in THE NEWS-LETTER to another side of Dr. Thomas' activity to<br />\nwhich he gave much time, thought and love—<br />\nhis relations to the Johns Hopkins University.<br />\nOnly the trustees can tell how valuable his<br />\nservices were in the organization and development of the University in general, and of the<br />\nMedical School in particular; but certain of<br />\nDr. Thomas' services were such as could be<br />\nseen even by those who came here as students,<br />\nand still more clearly by those who remained<br />\nas instructors, after the conclusion of their<br />\ncourse of studies for a degree.<br />\nFirst of all, he stood for a broad and courageous Christianity in the University. Other<br />\nmen might doubt as to the position of Christianity in the mind of an educated man or in the<br />\nlife of an educational institution ; but we felt<br />\nthat in him we knew one who never hesitated<br />\nin his firm insistence on the greatest freedom<br />\nof scientific research and on the certainty and<br />\nimportance of the Christian religion. None<br />\nShould be ignorantly religious; none should<br />\nbe learned infidels —all should be educated<br />\nChristians. With such convictions, he was a<br />\nmost eager and consistent supporter of everything which tended to make the religious life<br />\nmore vital to the students.<br /><br />\n3<br /><br />\nAnother service, rendered by Dr. Thomas to<br />\nthe University, came from his broad culture.<br />\nHe was the member of the Board of Trustees<br />\nwith whom (next to President Gilman) the students most frequently came in contact, and in<br />\nhim we found the true University spirit. He<br />\nhad none of that narrow specialization into<br />\nwhich professional men are so liable to fall ;<br />\nnone of that distortion of perspective which<br />\nmakes the science studied by you so important<br />\nand those studied by others so insignificant. In<br />\nhim we knew a man whose outlook was over a<br />\nwide field. He was a truly liberal man. Liberality has been defined as \"breadth on high levels,\" and it seems to me that Dr. Thomas' life<br />\nfulfilled that definition. Shallowness was as<br />\nforeign to him as narrowness. His breadth<br />\nwas that of the deep and mighty ocean.<br />\nFinally, his life was one of great influence on<br />\nHopkins men because of its kindliness, purity<br />\nand lovableness. One could not meet him without a friendly word. To chat with him was to<br />\ncatch an inspiration to effort, which lingered<br />\nlong after the conversation was finished. He<br />\nwas so cheerful, so buoyant and hopeful in his<br />\nview of life, so filled with brotherly kindness,<br />\nand his face was so turned towards those things<br />\nthat are pure and lovely, that his presence was<br />\na benediction. Good was it for so many of us<br />\nthat we knew him,and good was it for the University that his influence was so long manifested and so potent here.<br />\nBERNARD C. STEINER.<br /><br />\nA meeting of the class of '99 was held on<br />\nWednesday, November 3. The financial situation of the class was discussed and an assessment made. Mr. Dieffenbach addressed the<br />\nmeeting in behalf of The '98 Hullabaloo. The<br />\nclass voted an appropriation of $20 to The Hullabaloo. The election of class historian was<br />\npostponed until next meeting.<br />\nThe Fat Lady: Heavings! me diamonds is<br />\ngone! Hey yer seen 'em?<br />\nThe Snake Lady: _N-no; but I noticed the<br />\nglass-eater chewin' on somethin' a minute<br />\nago!—Bakintore Life.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nNEWS or A rORTNIGI-IT.<br />\nCOLLEGE CONGRESS.<br /><br />\nThe second regular session of the Senate,<br />\nheld on Wednesday, November 17, was decidedly more interesting and spirited than the<br />\nprevious meeting. The debaters displayed<br />\ngreater self-possession, and were, therefore,<br />\nmore effective. The side which affirmed that<br />\nthe \"silver question\" was now a dead issue, represented by Senators Fisher, R. D. Miller and<br />\nFitzgerald, won by an overwhelming majority.<br />\nSenators Fisher and Miller were heartily applauded. The open discussion was participated<br />\nin by Senators Ballard and Miller. The meeting was honored by the presence of Professor<br />\nAdams, who afterwards gave a favorable criticism of the debate. His advice to the speakers<br />\nis to write down their address, as an effective<br />\nmethod of impressing it on the memory, but to<br />\nuse no notes in speaking, as it is most important to be independent in the delivery.<br />\nThe subject for the next debate is : Shall<br />\nthe United States intervene in behalf of Cuba?\"<br />\nSenators Seth, Clark and Pender will take the<br />\naffirmative; Senators Ulman, Stearns and<br />\nHammond 'the negative. President Gilman<br />\nwill probably be present as the guest of the<br />\nSenate.<br />\nThe third regular meeting of the House of<br />\nRepresentatives was held Wednesday, October<br />\n10, in the Donovan room, McCoy ,Hall. Dr.<br />\nAdams was the guest of the House. The subject debated was: \"Resolved, That the result<br />\nof the work of the United States Bimetallic<br />\nMonetary 'Commission ought definitely to settle the silver question.\" The affirmative side<br />\nwas taken by Congressmen Greenbaum, Fosnocht and Frank; the negative side by Congressmen Gaddess, Levering and Kalb. The<br />\nquestion was very ably debated, and the arguments were effective, especially those of Fosnocht, Levering and Frank. The House took<br />\na very active part in the open discussion. Dr.<br />\nAdams, at the request of the House, spoke a<br />\nfew words. He complimented both the debaters and the House on their able discussion of<br />\nthe question. The subject for debate at the next<br /><br />\nmeeting of the House will be : \"Resolved, That<br />\nthe United States should intervene in behalf of<br />\nCuba.\" The affirmative side will be taken by<br />\nCongressmen Chambers, Bruce and Ramsay;<br />\nthe negative side by Congressmen Fisher, Ross<br />\nand Guggenheimer. Dr. Vincent will be the<br />\nguest of the House.<br />\nENROLLTIENT OF STUDENTS.<br /><br />\nThis autumn's enrollment of students shows<br />\na total gain of fifty-six over last year. The figures are:<br />\nPhilosophical Department:<br />\nGraduates.<br />\nUndergraduates.<br />\nSpecial<br /><br />\nMedical Department:<br />\nCandidates for M. D.—<br />\nFourth year<br />\nThird year.<br />\nSecond year<br />\nFirst year<br />\nDoctors of Medicine<br />\nTotal<br /><br />\nNov. 12,<br />\n'896.<br />\n206<br />\n144<br />\n32<br /><br />\nNov. 15,<br />\n1897.<br /><br />\n382<br /><br />\n394<br /><br />\n208<br />\n153<br />\n33<br /><br />\n17<br />\n26<br />\n29<br />\n34<br />\n36<br />\n44<br />\n63<br />\n42<br />\n-124 - 167<br />\n8<br />\n9<br />\n514<br /><br />\n570<br /><br />\nThis does not include the attendants on special courses of instruction given to Doctors of<br />\nMedicine, which were attended during the year<br />\n1895-96 by 69 physicians, and in the summer<br />\nof 1897 by 58 physicians.<br />\nATHLETIC ASSOCIATION.<br /><br />\nThe newly-organized General Athletic Association is taking active steps to better the<br />\ncondition of athletics at the University. A field<br />\nwill be secured and the rent guaranteed for five<br />\nyears. Five thousand dollars are to be raised,<br />\nwith the assistance of the alumni, which will be<br />\nexpended in fitting up the grounds. This will<br />\ngive our teams next spring good grounds for<br />\nout-of-door practice, in addition to the facilities<br />\nwhich the cage will afford, and will also enable<br />\nthem to make some money on the gate receipts<br />\nat games. The graduates and alumni members of the governing board of the Association<br /><br />\nTHE NEWS-LETTER.<br />\nwere elected at the last meeting. They are:<br />\nDr. Renouf, Allan McLane, Robert Garrett<br />\nand W. H. Maddren. The undergraduate<br />\nmembers of the board will be elected by the<br />\nvarious classes.<br />\nTHE LITERARY PRIZES.<br /><br />\nA few days only remain until December I,<br />\nwhen the time appointed for THE NEWS-LETTER literary contest will close. The Thanksgiving holidays have given some relief from<br />\nregular work, and afford an opportunity to<br />\nthose who have found themselves too busy to<br />\ncompete. Prof. Adams, Prof. Greene and<br />\nMr. Guy Carleton Lee have consented to act<br />\nas judges. The offer is open to students in all<br />\ndepartments of the University. The conditions<br />\nare broad, and the prizes are as liberal as we<br />\ncan make them. The copy of THE NEWSLETTER containing the winning compositions<br />\nwill go to the exchange table of every prominent college paper in the country. It is important that we be well represented. We look to<br />\nthe students to make the contest a success.<br /><br />\nProf. Brooks will deliver a series of lectures<br />\non \"The Principles of Science as Illustrated by<br />\nZoology,\" beginning on Monday, November<br />\n29,at 5 P. M. These lectures will be held in the<br />\nlecture room of the Biological Laboratory, and<br />\nare not open to the public.<br />\nThe Philological Association met Friday,<br />\nNovember 19. Principal paper, \"The Sources<br />\nof Davenart's Albovine\" and \"Siege of<br />\nRhodes,\" Mr. Killis Campbell. Minor communication,\"The Arrangement of the Fables<br />\nof Marie de France,\" Mr. Murray Brush.<br />\nDr. F. R. Jones, instructor in political economy has accepted the position of instructor in<br />\nhistory and politics at Union College, Schenectady, N. Y. He left Baltimore last week,<br />\nand Dr. Hollander has taken the class in political economy in his stead.<br /><br />\n5<br /><br />\nPresident Gilman has been appointed by the<br />\nMayor one of five citizens to act with the law<br />\nofficers of the city in drafting a new charter for<br />\nthe city of Baltimore.<br />\nThe current number of the Johns Hopkins<br />\nUniversity Circular, contains a sketch of Dr.<br />\nHumphrey by J. S. Kingsley and B. W. Barton, and a sketch of Dr. Conant by George<br />\nLefevre.<br />\nPresident Gilman has invited Dr. and Mrs.<br />\nNansen to stay at his house during their sojourn in Baltimore.<br />\nrIEDICAL SCHOOL NOTES.<br /><br />\nThe first Pithotomy of the present academic<br />\nyear was given on November 27th, at 9 P. M.,<br />\nby the fourth year meds., to the rest of that<br />\nclass and to the faculty and Hospital staff. The<br />\nmeeting was at the Phi Kappa Psi house. It<br />\nincluded all that was necessary for the comfort<br />\nof those present in the line of smoke and drink.<br />\nThe literary part of the entertainment consisted of stories and songs by various members<br />\nof the staff, besides original topical songs by<br />\nMr. Dawson, of the fourth year. The word<br />\n\"Pithotomy\" was coined by the originators of<br />\nthe society, and is derived from the Greek<br />\nword Pithos—\"beer jug.\"<br />\nMessrs. Brown and Oliver of the third-year<br />\nclass have been made demonstrators in anatomy. Messrs. Flint, McCallum and Lewis of<br />\nthe second-year class have been made assistants in histology. Miss Sabine, also of the second-year class, is now demonstrator in anatomy.<br />\nMiss Sabine is about to publish in the Hopkins Hospital reports an article on \"The Seventh Cranial.\"<br />\nSAD DAYS.<br />\nThe melancholy days have come<br />\nFor barbers everywhere,<br />\nThe football season has arrived,<br />\nAnd all must wear long hair.<br />\n—Baltimore Life.<br /><br />\n6<br /><br />\nh.<br /><br />\nTHE NEWS-LETTER.<br />\nDR. REID'S TRIP.<br /><br />\nTHE LECTURES ON JAPAN.<br /><br />\nDr. H. F. Reid returned from his summer's<br />\ntrip on Wednesday November 17. He left<br />\nBaltimore on June 12, and spent some weeks<br />\ntaking measurements on the Forno glacier in<br />\nthe Engadin, together with Professor Ames.<br />\nFrom Switzerland he went to Russia, to take<br />\npart in an extensive journey of geologists<br />\nacross the Ural as far as the Western terminus<br />\nof the Great Siberian road. After this he<br />\nmet Dr. Clark at St. Petersburg, took part in<br />\nthe Congress, and then joined in a special trip<br />\nto Mt. Elbrux in the Caucasus.<br />\nIn the first days of October an excursion was<br />\nmade to Mt. Ararat. Mr. E. Stoeber, who ascended the greater Ararat, together with Dr.<br />\nEbeling, of Berlin, and Dr. Oswald, of Bale,<br />\nseparated from his companions. They gained<br />\nthe summit, were forced to spend the night at<br />\nan altitude of 16,000 feet, suffering much from<br />\ncold, and returned to the Cossack camp next<br />\nday. There they learned that Stoeber had not<br />\nreturned. An instant search after the lost man<br />\nwas rendered fruitless through a violent snowstorm and through the men's inability to speak<br />\nRussian with the Cossacks. After many difficulties and unavoidable delays, a party composed of Dr. Ebeling, Dr. Oswald and Dr.<br />\nReid continued the search until October 4,<br />\nwhen some Cossacks found Stoeber's body. He<br />\nhad evidently slipped on a ledge of rocks and<br />\nbroken his leg. The cold had killed him before<br />\nhe recovered consciousness. The accident was<br />\nentirely due to Stoeber's inexperience in<br />\nmountaineering.<br />\nDr. Reid returned by way of Odessa, Constantinople and Athens, and through the Mediterranean to Switzerland. At Crete he saw the<br />\nassembled fleet of the powers, and also their<br />\ntroops, which were stationed at Canea. One<br />\nfortress was flying the colors of nearly all the<br />\nEuropean nations.<br />\nHe also ascended Mt.<br />\nStromboli, a well-known volcano in the Lipari<br />\nIslands, but was disappointed in not finding<br />\nit in activity. In Switzerland he took final<br />\nmeasurements on the Forno glacier.<br /><br />\nA series of remarkable lectures on \"Modern<br />\nJapan\" was given during the past week. Dr.<br />\nDavid Murray lectured on \"Education in<br />\nJapan ;\" Professor Mits4kuri gave an account<br />\nof \"Recent Changes in Japan\" and of the \"University of Tokio,\" and Mr. Rokuro Nakaseko,<br />\none of our graduates in chemistry, gave some<br />\ncharming and realistic glimpses of modern<br />\nJapan.<br />\nBy request of Prof. Brooks, Prof. Mitsukuri spoke before the instructors and students of the Biological Department on Thursday morning, November 18. His interesting<br />\nreminiscences and amusing anecdotes of his<br />\nstudent days at the Johns Hopkins afforded a<br />\nstriking illustration for President Gilman's definition of an university as a\"societas magistrorum ct discipulorum.\" Dr. Sedgwick and Dr.<br />\nWilson were fellow students with Dr. Mitsukuri. Dr. Howell was then an undergraduate<br />\nand worked with him in physiology. Professor<br />\nMartin and Professor Brooks were the chief instructors of these men. Since then all have<br />\nbecome famous, and have spread abroad the<br />\nlearning derived from our University. Dr. Mitsukuri took his degree in '83, and is now professor of zoology at the University of Tokio.<br /><br />\nTHE BVIETALLIC<br /><br />\ncortrussioN.<br /><br />\nDr. Hollander delivered a lecture upon \"The<br />\nPresent Monetary Condition\" on Friday evening before the Historical Seminary. In the<br />\ncourse of his talk he gave a rapid sketch of the<br />\nmonetary history of the United States, but<br />\ndwelt principally upon the modern aspect of the<br />\nquestion, especially as affected by the results of<br />\nthe Bimetallic Commission. Dr. Hollander, as<br />\nSecretary of the Commission, was thrown in<br />\ncontact with many prominent European statesmen, among whom various opinions on the<br />\nmatter could be found. The sentiment in favor<br />\nof international bimetallism was everywhere<br />\nevident, especially in France. The reception in<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nEngland, contrary to the general opinion, was gridiron in the furious and fierce game of footcordial. The Embassy was not by any<br />\nball this afternoon. A breathless conclave of<br />\nmeans regarded as a delegation cringing for physicians said that it could not live. Women<br />\nfavors from the Court of St. James, but as Am- fainted and strong men wept. A gauze was<br />\nbassadors sent over to treat with Great Britain stretched in front of the grand stand to keep the<br />\nin response to a vote of the House of Commons. moaning spectators from the horrible sight.<br />\nThe mission cannot be looked upon as a failure, The game was the most brutal in the annals of<br />\nin spite of the fact that England's refusal to a most terrible game. The face of Captain<br />\nopen the Indian mints puts a stop to all nego- Wilson was torn to shreds, he losing both eyes.<br />\ntiations.<br />\nThe freshman manager carried Wilson's<br />\nIn spite of the arduous duties of the Commis- \"tongue from the field on a stick. The sophosion, time was found for more congenial tasks. mores won by a score of 12 to o.—Sequoict of<br />\nFrom several remarks of Dr. Hollander, we Leland Stanford University.<br />\nwould infer that the members of the Commission were present at sundry banquets, where<br />\nCATULLUS.<br />\nCI.<br />\nmirth and good cheer flowed in unison with<br />\nmore substantial matters.<br />\nThrough many climes, o'er many billows<br />\nborne,<br />\nBrother,<br />\nto thy sad funeral rites I've come,<br />\nPRES'T JORDAN on COLLEUE DISCIPLINE.<br />\nDeath's last reward to pour upon thy tomb,<br />\nDavid Starr Jordan, President of Leland And o'er thy silent ashes vainly mourn.<br />\nStanford Jr. University, writes in the October Though Fortune tore thee from me, yet receive<br />\nNorth American Reviezu on \"College Disci(0 wretched brother from my bosom reft!)<br />\npline.\" He adapts a saying of Bismarck, and<br />\nWhat ancient rite our fathers' custom left<br />\nsays of American college students : \"One With mournful honor o'er our dead to grieve—<br />\npart go to the clogs, one part to the grave, and<br />\nA brother's tears, whose number none can<br />\nthe rest are the strength of the republic.\" After<br />\ntell.<br />\nPointing out the defects in old methods and the<br />\nHail and forever, brother, fare thee well !<br />\nCARL WIGHT, 1900.<br />\nadvantages of modern tendencies in discipline,<br />\nMr. Jordan uses his own university as an illustration. The control of students at Leland<br />\nStanford is vested in a committee of five members of the faculty, who have full power to disPresident Sherman, of Cornell, has ofmiss any student whom they may consider un- fered a prize of fifty dollars, to be competed<br />\ndesirable. It is interesting to note that they for through the columns of the daily newspaper<br />\nhave express authority to discipline a man for of that University. Only matters of the nastudying too hard. Like Hopkins, Leland ture of reports, descriptions and comments<br />\nStanford has no code of rules, and prohibits will be accepted, and the competition shall be<br />\nnothing not forbidden by the laws of the State. open to every student of the University.—ExHazing President Jordan considers a species change.<br />\nof ruffianism. His remedy is<br />\nto get rid of the<br />\nkind of men who are likely to take part in<br />\nit.<br />\nA VALUABLE MAN.<br />\nHallroom<br />\n: Who's the star boarder at your<br />\nWESTERN FOOTBALL.<br />\nplace?<br />\nA crushed mass of humanity with every<br />\nMansard: A doctor! Before each meal he<br />\nbone<br />\nin it ground to<br />\nphosphate and dripping blood tells about the dangers and disasters resulting<br />\nwas laid beyond the pale<br />\nof the white wash from over-eating, you know.—Baltimore Life.<br /><br />\nTHE NEWS -LETTER.<br /><br />\n8<br /><br />\nebe petuoatetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS EopgiNS UNIVERSITY.<br /><br />\nDECEMBER<br /><br />\n2,<br /><br />\n1897.<br /><br />\nSubscription $1.50 per year. 15 cents a single copy.<br />\nEDGEWoRTH SMITH, '98.<br />\nEditor in Chief,<br />\nAssistant Editor in Chlet, - - ALBERT C. DIEFFENBACH,'98.<br /><br />\nConsulting Editors, -<br /><br />\nProf. KIRBY F. SMITH.<br />\nMoRRISON,'90.<br /><br />\nDEPARTMENT<br /><br />\nEDITORS.<br /><br />\nG. L. P. RA.HcLIEFE,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nW.T. LONGcOPE, Medical School.<br />\nV. A. Riasour,'98.<br />\nR. D. MILLER,'98.<br />\nJ. C. PRRNCH,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, '99.<br />\nR. H.GRIMES,'99.<br />\nBusiness Manager,<br /><br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 23,q, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br /><br />\nCOLLEGE HALLS.<br /><br />\nIn this number of the NEWS-LETTER appears<br />\nthe latter half of a very interesting article by<br />\nProfessor Herbert B. Adams,on \"Student Life<br />\nin Edinburgh.\" In this description of customs<br />\nat the University of Edinburgh, Dr. Adams has<br />\nbrought up a point which merits the thoughtful attention of every member of our University—the existence, namely, of co-operative<br />\ncollege halls.<br />\nA distinguished guest of the University—Sir<br />\nMichael Foster—has recently said that one<br />\nchief source of strength with us lies in the fact<br />\nthat our University is still young enough to be<br />\nmoulded—that there are no iron-bound \"precedents\" to hinder us from developing along<br />\nthe lines of latest improvement, or from adopting unto ourselves the best features of all other<br />\neducational systems.<br />\nIf we accept this theory of constant improvement by selection as our creed—and we could<br />\nnot wish for a better one—then it behooves us<br />\nto consider carefully this system, only recently<br />\ninaugurated at a great sister university, yet already markedly successful there. Until a few<br />\nyears since, Edinburgh had been, like our-<br /><br />\nselves, destitute of any real student life; she<br />\nlacked that side of education which does not<br />\ncome to us from books or lectures, but rather<br />\nis absorbed by living in an atmosphere created<br />\nby a number of cultivated men and earnest<br />\nworkers. Now this void has been filled by the<br />\nmembers of the University themselves, and college halls have sprung up and are flourishing<br />\non the co-operative plan, and without any outside backing.<br />\nThat such a system, if adopted here, would<br />\nprove successful, is likely. That it is needed is<br />\nunquestionable. Students—especially those<br />\nseeking a doctor's degree—are all too prone,<br />\nabsorbed in their own special line of work, to<br />\nforget that duty toward self as an individual, as<br />\nwell as a unit of social humanity, demands of<br />\nthem a general and broadening cultivation as<br />\nan antidote to the narrowing effect of specializing. Again, who,of all these workers scattered<br />\nthroughout the city in boarding houses, has not<br />\nfelt that strain upon the will, greater than any<br />\nstrain of study, which results from sticking to<br />\nwork, day by day, monotonously, with hardly<br />\na taste of outside life to relieve the tension?<br />\nAnd,suffering this strain of lonely self-dependence, would he not draw fresh vigor and enthusiasm from an atmosphere of work and<br />\nearnest purpose, and from the society of cultivated men, come together in the common<br />\nroom of the hall for a little rest and chatting<br />\nafter breakfast or at the end of the day's work?<br />\nSuch a stimulus is dwelt upon in all stories<br />\nand descriptions of English university life,<br />\nwhere this system of halls is in use ; and<br />\nit is of only less value than that broadening of character and rubbing away of<br />\nangles which results from the contact of<br />\nman with his fellow-men. And then there<br />\nis the other side, more interesting to undergraduates, perhaps, than to graduates, yet of<br />\nimportance to both — the fellowship among<br />\nstudents which this system would foster and<br />\nthe friendships, to whose formation it would<br />\nstand sponsor. All these features—quite as<br />\nimportant in their results as the college work—<br />\nbelong to some extent to the fraternities. But<br />\ntheir scope is limited. The four hundred and<br /><br />\n0E44<br /><br />\nTHE NEWS-LETTER.<br /><br />\nI<br /><br />\n1<br /><br />\nodd members of the University whose homes<br />\nare out of the city prove the need, while they<br />\nargue the practicability of such a system.<br />\nLast year, at the outset of its career, the<br />\nNEWS-LETTER outlined two wants as being<br />\nmost pressing at the University, and pledged<br />\nits aid in supplying them. They were, better<br />\nathletic facilities, and more college life. Since<br />\nthen the first of these wants has been filled.<br />\nWith gratification we realize that a new spirit<br />\nhas pervaded the whole University from Dan<br />\nto Beersheba, from students even unto trustees, and that it has shown itself in the erection<br />\nof a cage and the search for a field for our athletes. The second want was for a more mature and definite form of college life. And<br />\nthis, too, bids fair to be realized. It is shown<br />\nin the sentiment against the silly forms of hazing formerly practiced here, as well as in the<br />\nestablishment of a college congress. And<br />\nnow, may we not hope that in some future time,<br />\nwhether near or dim, these halls, which will do<br />\nthe most of all toward furthering true academic<br />\nlife, may be embodied in our University? It<br />\nis, at least, a pleasant dream to construct them<br />\nin fancy. There might be one for medical students, lying conveniently half way between the<br />\nHospital buildings on Broadway, and the Laboratories clustered around McCoy Hall ; another for the graduates and members of the<br />\nfaculty, a third for undergraduates—all threads<br />\nof a web which would bring together the scattered lives of our students--which would bring<br />\nabout what Dr. Adams calls \"the real unity of<br />\nacademic life—a college centre where students<br />\nlive and educate one another in their own society—perhaps the most effective of all academic means of culture.\" Of course, these<br />\nhalls will not spring into existence spontaneously. But it is possible here, as was the<br />\ncase in Edinburgh, for a dozen or so students<br />\nto club together and<br />\nmake a beginning. And<br />\nfrom this beginning the development of the<br />\nsystem should be but a question of time.<br />\nFOOTBALL.<br /><br />\n.t<br />\nd<br /><br />\nWith the St. John's game our football season<br />\nPractically closed, as the game with the Baltimore Medical College was regarded as of little<br /><br />\n9<br /><br />\nimportance by Hopkins men, and was played<br />\nwith enough substitutes to cost us the game.<br />\nThe victory over our old rivals on Thanksgiving, however, left a very sweet taste in our<br />\nmouths, and considerable credit is due the team<br />\nfor the hard practice and plucky playing which<br />\ngave us the victory.<br />\nThere are, however, one or two lessons to be<br />\nlearned from the past season which are worth<br />\npointing out. One is, that it is as impossible<br />\nas it is unfair to expect the athletic reputation<br />\nof a university with nearly six hundred students to be adequately sustained by the almost<br />\nunsupported exertions of an undergraduate<br />\nbody amounting to scarcely one-fourth of the<br />\nwhole. There is enough good material in the<br />\ngraduate and medical departments to furnish<br />\nthe 'Varsity with teams which would place her<br />\non the level where she rightly belongs; but this<br />\nmaterial seems quite impossible to be reached.<br />\nOccasionally a \"grad.\" tries for the team, and<br />\nalmost invariably makes it if he practices. But<br />\neven this is but the exception which proves<br />\nthe rule.<br />\nThe other point is the impossibility of getting the best results out of what material we<br />\nhave, without adequate grounds and regular<br />\ncoaching. This was emphasized by the improvement in the team after Mr. Bond took it<br />\nin hand. On the whole, however, the result<br />\nhas been encouraging, and with a cage and an<br />\nathletic field we may indulge in a good many<br />\n\"hopes\" for better results next year.<br />\nCLIPPINGS.<br /><br />\n\"I wonder,\" said the philosophical student,<br />\n\"why a fight is called a scrap ?\"<br />\n\"Because it is a broken peace,\" replied the<br />\nCheerful Idiot, with his usual promptitude.—<br />\nExchange.<br />\n\"Nothing won\" ('oi), is the remark of the<br />\ncolleges, after admitting the freshman class this<br />\nyear.—Exchange.<br />\nThere was a time when every wheelman you<br />\nmet on the road was a gentleman ; now it is<br />\nhard to tell whether it is a gentleman or a<br />\nlady.—Baltimore Life.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br /><br />\nATHLETICS.<br />\nFOOTBALL.<br /><br />\n25 yards down the field and across the line.<br />\nHodges kicked goal. This settled the game,<br />\nand the Hopkins rooters went wild. Captain<br />\nRobinson was carried off the field on their<br />\nshoulders, under the waving Hopkins banner.<br />\nCambridge in general shared in Hopkins' rejoicing, and the sixty St. John's rooters present<br />\nwere about the only ones to whom the result<br />\nwas a disappointment. The line-up follows:<br /><br />\nJ. H. U., 6; ST. JOHN'S, 0.<br />\n'Varsity<br />\nThe<br />\nwon a brilliant victory over the<br />\nmen from Annapolis on Thanksgiving Day.<br />\nOnly a dozen rooters accompanied the team to<br />\nCambridge, but they cheered and sang and<br />\nyelled until the air seemed black—and blue, as<br />\nwell, to St. John's.<br />\nI. H. U.<br />\nPositions.<br />\nSi. John's.<br />\nLeft End<br />\nReynolds<br />\nCaptain Robinson won the toss, and St. Armstrong<br />\nLeft Tackle<br />\nPenn ington<br />\nJohn's kicked off to the 20-yard line. Hopkins Huff.<br />\nKennard<br />\nLeft Guard<br />\nTorbert<br />\nadvanced the ball gradually up the field. Straus Hancock<br />\nCentre.<br />\nCullison<br />\nwas given the ball repeatedly, and he bucked Rushmore<br />\nRight Guard<br />\n.Spates<br />\nthe line hard, rarely failing to gain. St. John's Haskell (Lazenby).Right Tackle.<br />\nSinclair<br />\nRight End<br />\nWinchester<br />\nlost ten yards on off-side play, but a moment Talty<br />\nQuarter-back.... .....Douglass<br />\nlater got the ball on downs. Then Brady and Mullen<br />\nRobinson (C.)... Left 'Halfback.<br />\nBrady<br />\nBlanchard alternated at runs around the ends. Hodges<br />\nRight Halfback...Blanchard (C.)<br />\nBoth men played well, and St. John's might Straus<br />\nFullback.<br />\nMackell<br />\nhave scored had not the tackling of Lazenby,<br />\nTouchdown—Robinson. Goal—Hodges.<br />\nHodges, Robinson and Straus broken them<br />\nScore—J. H. U. 6, St. John's o.<br />\nup. Lazenby played strongly. In his work<br />\nOfficials—Professor Chew (St. John's), referee;<br />\nat tackle he simply outclassed his opponent.<br />\nMackdermott (M. A. C.), umpire; Orem, (St.<br />\nThe rest of the line also played well in the John's), and Bouchelle (J. H. U.), linesmen.<br />\nearly part of the game, but St. John's was<br />\nsometimes able to break -through. A brace up<br />\nNOTES.<br />\ntook place in the closing moments of the first<br />\nhalf, when the ball went up toward St. John's<br />\nAfter the touchdown was scored the Hopgoal. Finally, at the three-yard line, on the kins rooters fell upon each other's necks and<br />\nthird down, Mullen passed to Straus. There wept for joy. Then they started out and<br />\nwas a misunderstanding, and the play was not clashed all the way around the field, to give<br />\nexecuted. It was a terrible blow to the rooters vent to their feelings. A countryman who<br />\non the side lines, who nevertheless kept up a came to \"see the game\" was much scandalized<br />\nsteady cheering. The half closed with St. at this levity, and remarked, \"Waal, I don't<br />\nJohn's in possession of the ball on their 4.0- know which air the dom'dest fools, them fellers<br />\nyard line.<br />\nshovin' each other in the middle of the field or<br />\nThere was a new infusion of life into J. H. them others tearin\"round like mad.\"<br />\nU. in the second half, and although St. John's<br />\nThe organized rooting and singing of the litalso played more strongly they could not break tle band of Hopkins men was very effective,<br />\nthrough the Hopkins line. In consequence, and quite outdid the efforts of the St. John's<br />\nthe ball went down the field. But the 'Varsity men, although they had several times our numlost on fumbles several times, and this contin- bers. It took with the crowd, too, who cheered<br />\nued to keep the result in doubt. The tide our college songs, and it certainly did much to<br />\nturned Hopkinsward once more, and at the 30- hearten our players.<br />\nyard line came the beginning of the end,<br />\nThe features of our playing were the interHodges and Talty figured in some matchless ference and the breaking of our opponents' ininterference, when Captain Robinson took the terference. At this Talty, Hodges, Robinson<br />\nball around St. John's left end and carried it and Straus were particularly good.<br /><br />\nTHE NEWS-LETTER.<br />\nRobinson made two good runs, one in the<br />\nfirst half for thirty yards, and another in the<br />\nsecond half for twenty-five yards, and the winning touchdown.<br />\nOur line in the main held splendidly, and repeatedly got the ball on downs.<br />\nBlanchard did the best work for St. Johns.<br /><br />\nB. M. C., 4; J. H. U., o.<br />\nHopkins lost its last game of the season on<br />\nSaturday, to Baltimore Medical College. The<br />\nMeds. were much heavier, and Hopkins was<br />\nweakened by the absence of both the regular<br />\ntackles. All the Meds'. gains were made<br />\nthrough the line.<br />\nj. H. U., 4; GALLAUDET,6.<br />\nThe 'Varsity lost to Gallaudet by 6 to 4, on<br />\nSaturday, November 13, in Washington. Gallaudet put up a strong game, and Hopkins<br />\nfought fiercely to score, and deserves much<br />\nPraise for practically tieing the deaf mutes.<br />\nIn the first half the 'Varsity eleven went<br />\nthrough Gallaudet's line almost at will, bu,<br />\nthey were not able to do so in the second. Gallaudet would probably have made ,a better<br />\nshowing had not their ambition led them to<br />\nstart before the baIl was in play. They lost a<br />\nnumber of times on this account. The whole<br />\nHopkins eleven did good work. The regrettable feature was that Armstrong had a stiff<br />\nbreeze in which to try for goal, while the home<br />\nplayers had a perfect calm. Straus scored the<br />\ntouchdown for Hopkins in the first half.<br /><br />\nHOPKINS, 4; B. M. C., 4.<br />\nThis game between Hopkins and the Baltimore Medical College was not of very great<br />\nInterest. The College team outclassed our men<br />\nentirely in weight. The 'Varsity team put up<br />\na good showing in<br />\nthe first half, scoring one<br />\ntouchdown. In the second half the weight of<br />\nthe College told upon<br />\nour men, and a touchdown was made by the College. The game<br />\nended in a dispute. When the kick for goal<br />\nwas being tried, the captain ran up and<br />\nhandled<br /><br />\nthe ball, putting it in play. Our men naturally<br />\ntook advantage of this, and carried the ball to<br />\nthe centre of the field. The College team did<br />\nnot look upon this in the same light as the<br />\n'Varsity did, and refused to play. The referee<br />\ndecided Hopkins' view correct, and Walter<br />\nCamp wrote to Captain Robinson that the decision of the referee is final.<br />\nHOCKEY.<br /><br />\nThe prospects for a good hockey team this<br />\nyear are unusually bright. This is proven not<br />\nonly by the large number of candidates, but<br />\nalso by their enthusiasm and determination.<br />\nThis season will witness a notable change in<br />\nthe choosing of the team, as well as of methods<br />\nand style in play. The chief feature of the new<br />\narrangement will be the presence of two teams,<br />\none following Hopkins' attack method and the<br />\nother the various styles of plays pursued by<br />\nother teams. In this manner weak points can<br />\nbe strengthened and faults remedied.<br />\nNo man on the team can feel secure of his<br />\nplace, for a substitute may at any time replace<br />\na regular if by his playing the \"sub\" proves his<br />\ncapability of strengthening that position. This<br />\nwill do away with the discouragement and loss<br />\nof interest that usually follows when a man fails<br />\nto make a team. The following candidates<br />\nhave given their names to the manager:<br />\nGraduates, S. A. Mitchell, McInnis; M. S.,<br />\nW. H. Maddren, G. W. Warren, W. W. Williams, L. V. Hamman, J. M. Hitzrot; Undergraduates, T. Fitzgerald, Jr., W. Straus, C.<br />\nHodges, H. Wright, G. Knapp, J. Levering,<br />\nJr., W. White, A. Murkland, R. C. Kerr, H.<br />\nMarshall, A. Wright, 0. Gminder, B. Bernheim, C. Guggenheimer, R. T. Abercrombie,<br />\nH. Whitman, C. Spencer.<br />\nTHEN AND NOW.<br />\n0 Marguerite!0 Marguerite!<br />\nWhen first we were acquaint,<br />\nYou were cold and I was mean,<br />\nThe same which now we ain't.<br />\n—Exchange.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br />\nTHE UEOLOGICAL SURVEY.<br /><br />\nThe State Geological Survey Commission,<br />\ncomposed of Governor Lloyd Lowndes,<br />\nComptroller R. P. Graham, President D. C.<br />\nGilman, and President R. W. Silvester, met at<br />\nthe Geological Survey headquarters at the<br />\nJohns Hopkins University on Tuesday at 3:30<br />\nP. M. to listen to the semi- annual report of<br />\nProfessor William Bullock 'Clark, the State<br />\nGeologist. Professor Clark informed the board<br />\nof the publication of the first volume of the<br />\n'State survey reports, and read extracts from<br />\nvarious letters which had been received from<br />\nvarious sources at home and abroad congratulating the survey and the State upon the high<br />\ncharacter of its first publication.<br />\nAn extended report was given of the present<br />\nstatus of the work and what had been accomplished during the past field season. Professor<br />\nClark stated that between 200 and 300 square<br />\nmiles in Western Maryland, chiefly in Allegany<br />\ncounty, had been topographically surveyed in<br />\nco-operation with the United States Geological Survey ; that the magnetic work had been<br />\nfurther extended, several additional county<br />\ntowns asking for the co-operation of the State<br />\nsurvey in establishing meridian lines, while all<br />\nthe magnetic and astronomical work for the<br />\nWestern Boundary Survey had also been<br />\nplaced under the supervision of the State Geologist ; that the work inaugurated the previous<br />\nyear upon the building stones of the State had<br />\nbeen practically brought to a conclusion, and<br />\nthe preparation of the manuscript of the report<br />\nwas already well advanced; that detailed geological surveys had been made of Allegany<br />\nand Garrett counties and portions of Cecil,<br />\nKent and Anne Arundel counties ; that the<br />\nstudy of the agricultural soils in their relations<br />\nto geology had been carried on in the same<br />\ncounties, and finally that much preliminary<br />\nwork along various lines of investigation had<br />\nbeen taken up in various portions of the State.<br />\nProfessor Clark also informed the board regarding his recent attendance upon the International Geological 'Congress at St. Petersburg, where he had been sent by appointment<br /><br />\nL-<br /><br />\nof the Governor to represent the State as State<br />\nGeologist.<br />\nAfter the discussion of plans for future work,<br />\nthe members of the Commission examined the<br />\nlarge collections which have been brought together under the auspices of the Survey.<br />\nALWINI NOTES.<br /><br />\nR. P. Bigelow, Ph. D.,'92, who is instructor<br />\nin biology at the Massachusetts Institute of<br />\nTechnology, has been elected editor of The<br />\nAmerican Naturalist.<br />\nW. J. Karslake, Ph. D., '95, is professor of<br />\nchemistry at Butler University, Irvington, Ind.<br />\nJ. E. Bucher, Ph. D., '94, is professor of<br />\nchemistry at the Rhode Island Agricultural<br />\nCollege, Kingston.<br />\nF. K. Cameron, Ph. D., '94, who has been<br />\nassociate professor of chemistry at the Catholic University, is now research assistant in<br />\nphysical chemistry at Cornell.<br />\nH.E. Griffith, graduate student in chemistry,<br />\n'96, is assistant in chemistry at Knox College.<br />\nGeorge P. Bristol, Ph. D., is professor of<br />\nGreek at Cornell.<br />\nH. Friedenwald, A. B.,'90, is superintendent<br />\nof the manuscript department in the Library of<br />\nCongress.<br />\nH. P. Thieme, Ph. D., '97, is assistant professor of French at Earlham College.<br />\nWESTERN JUSTICE.<br />\nJudge: \"What are you up for, sir?\"<br />\nPrisoner: \"Picking pockets, Your Honor.\"<br />\nJudge: \"Seeing that you are so honest<br />\nabout it, I will only charge you $20.\"<br />\nPrisoner: \"I only have sixteen.\"<br />\nJudge: \"Officer, take this man out in the<br />\ncrowd and let him mix until he gets four more<br />\ndollars! Next case.—Sequoia.<br /><br />\nBrown-Jones:<br />\nJones-Brown:<br />\nBrown-Jones:<br />\nJones-Brown:<br />\nmore Life.<br /><br />\nI raise you $5.<br />\nI X-rays you $5.<br />\nWhat do you mean by that?<br />\nI see you, of course.—Balti-<br /><br />\nThe Beyg' Latin gGhoel<br /><br />\nEmtablished 1880.<br /><br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. B., Head<br /><br />\nMaster.<br /><br />\nTelephone Call 1822.<br /><br />\nARTHUR F. LAWRENCE &amp; CO.<br />\nLeading Dealers in<br /><br />\nThis school has a continuous history of<br />\nover fifty years<br />\n:It was reorganized under<br />\nits present management<br />\nin 1894.<br /><br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br /><br />\n6 W. SARATOGA STREET,<br />\nY. M. C A. BUILDING,<br /><br />\n112arpland Citle Insurance and Crust Co.<br />\nEQUITABLE BUILDING, BALTIMORE<br />\nTELEPHONE 1376.<br />\nT. K.<br /><br />\nWORTHINGTON,<br />\nJESSE MLLES,<br />\nL. M. DUVALL,<br />\nPresident.<br />\nSec`y-Treas.<br />\nVice-President.<br /><br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br /><br />\nBALTIMORE, MD.<br /><br />\nCAPITAL, $100.000.<br /><br />\nSAVINGS DEPARTMENT.<br /><br />\nCOMMONWEALTH BANK,<br />\nEUTAW ST.,<br /><br />\nFACING MADISON.<br />\nGEO. YAKEL,<br />\nJOHN R. TIOOPER,<br />\nVice- Prest.<br />\nCashier.<br />\n-DIRECTORS.<br />\nJordan Stabler,<br />\nJohn N. Matthews,<br />\nLouis Yakel,<br />\nJefferson J. Walsh,<br />\nRobert Biggs,<br />\nJames R. Wheeler,<br />\nDr. T. A. Ashby, George A. Blake.<br />\nJ. K. Ober,<br />\nMurray Vandiver,<br />\nJesse F. Ely.<br />\nJames H. Preston,<br />\nM. H. Ould,<br />\nJoe. G. Valiant.<br />\nGeorge Yakel.<br />\nLarge or small sums, for long or short period., received on favorable<br />\nterms. Call at the Bank for information.<br />\nJAS. R. WHEELER,<br />\nPresident.<br /><br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br /><br />\nGIFFORD de JERSEY MESNY,<br /><br />\nDIRECTORS:<br />\nA. Whitridge,<br />\nAlexander Brown,<br />\nEdgar G. Miller,<br />\nThomas<br />\nehomas Hill,<br />\nGeorge<br />\nWhitelock,<br />\nJesse Hilles,<br />\nH. H. Perkins,<br />\nJacob I. Cohen,<br />\nC. C. Shriver,<br />\nM. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application.<br /><br />\n1<br /><br />\nIf<br /><br />\nThe days are<br />\ndark, the days are drear,<br />\nThe moments<br />\nThe days are sad, now are murky;<br />\nthe days are bad<br />\nPer the poor Thanksgivi<br />\nng Turkey!<br />\nY. M. H.0. D.<br /><br />\n639<br /><br />\nBaltimore and Howard Sts.<br />\nPree Went.<br /><br />\nArthur H. Hall,<br /><br />\nVice-President.<br /><br />\nSec'y a141 Treas.<br /><br />\nThe A.G. Alford Sporting Goods Co.<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\nTelePh011e<br /><br />\n2573,<br /><br />\nNORTH CHARLES STREET.<br /><br />\nfiEfILD &amp; DELfitiftY,<br /><br />\nHAMBURGERS',<br />\nGeo. P. Mordecai,<br /><br />\n226<br /><br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br /><br />\nLet not the sun go down upon your overcoatlessness<br />\nThis $20 Overcoat we have mentioned frequently because<br />\nIt is a genuine<br />\nbargain, if ever there was a bargain offered in<br />\nOvercoats.<br />\nA spick and span Overcoat is second in importance<br />\nonly<br />\nto the spick and span<br />\nTurkey on Thanksgiving Day.<br />\nLoose-fitting Overcoats—not too loose; tight-fitting Overcoats—not too tight; long Overcoats, short Overcoats, Overcoats with slik sleeve<br />\nlining, Overcoats with satin shoulder<br />\nlining, Overcoats with part silk and part fancy lining, Overcoats In every desirable color and style, and in every desirable price from $7.50<br />\nto $35.<br />\nIf you have a snug<br />\nand comfortable Overcoat you are<br />\nfixed for the winter.<br />\nWhy not attend to this detail to-day?<br />\nWe are constantly adding to our assortment of Readymade-to-Fit Clothing.<br />\nWonderful bargains are to be had<br />\nnow in Winter<br />\nSuits, $7.50 to $25.<br />\nNew Handkerchiefs! A fine line of the Silk Initial<br />\nkind<br />\nhas just arrived. A<br />\nWhite Handkerchief with handsome<br />\nborders-3for 25 cents.<br />\nWe sell nothing but Good Clothing, and we sell it<br />\nCheaply!<br /><br />\nGeo. L. Harrison,<br /><br />\nArtist Photographer,<br /><br />\nBALTIMORE, MD.<br /><br />\nNORTH EUTAW<br /><br />\nST., Near<br /><br />\nGIVE US A CALL.<br /><br />\nGENT'S<br />\nFINE FURNISHINGS.<br /><br />\n\"Ztbe Eutaw<br />\nA. WAGNER.<br /><br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br /><br />\njj L. LAMBURO'S<br />\n611 N. HOWARD STREET,<br />\nBALTIMORE, MD.<br /><br />\nMerchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br /><br />\nFict9s<br />\n13c:tuners<br />\n1%149QS<br /><br />\n95(t<br />\nQLOVES<br />\n614411IIIIrir new /Wan<br /><br />\nFlorist<br /><br />\n•<br /><br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers.<br /><br />\nMadison Cycle<br />\n315 Madison St.<br /><br />\nMRs, OTTO SCHULER,<br />\n322 WEST SARATOGA ST.,<br /><br />\nNEAR EUTAW,<br /><br />\nBALTIMORE.<br /><br />\nLucke &amp; Sons,<br /><br />\nMerchant Tailors,<br /><br />\nNO. 205 E. FAYETTE STREET,<br />\nO PPOSITE<br /><br />\nTHE NEW POST OFFICE<br /><br />\nBALTIMORE.<br /><br />\nWe will<br />\ninsure the finest workmanship and styles in Tailoring as<br />\nalso well-fitting garments.<br />\nThe latest varieties of goods always on hand.<br /><br />\nNEAR EUTAW.<br /><br />\nWork called for and delivered.<br /><br />\nBALTIMORE, MD.<br /><br />\nSPECIAL, DISCOUNTS to Students<br />\nmentioning this advertisement.<br /><br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br /><br />\nSuits Pressed While You Walt.<br />\nPants Pressed.<br />\n15c„<br />\nSuits Pressed<br />\n50c.<br />\nSuits Cleaned<br />\n$1.00<br /><br />\n218 N. Charles Street,<br /><br />\n6 E.BALTIMORE St<br /><br />\nA few doors South of Johns Hopkins University<br /><br />\nRepairing of any description at<br />\nReduced Prices.<br /><br />\nSISCO BROS.<br /><br />\nSAMUEL HUNT'S SONS<br /><br />\nNew<br />\nM Usic<br />\nStore ia<br /><br />\nDOOR TO HOPKINS UNIVERSITY<br /><br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br /><br />\nReduction in Prices.<br />\nThe only house keeping<br />\nGloves in repair for two<br />\nmonths free of charge, and<br />\nif not satisfactory at expiration of this time a new<br />\npair given in exchange.<br />\n01.25 London Tan Gloves<br />\nreduced to 95 cts.<br />\nSee if you can match them<br />\nfor 611.25.<br /><br />\n•0•<br /><br />\nPOOL PARLOR,<br /><br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br /><br />\nFine Goods at<br />\nMBROSE CPERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n224<br /><br />\nW. Fayette Street, near Howard,<br />\nBALTIMORE, MD.<br /><br />\nBARTHOLOMAY BREWERY CO.<br /><br />\nJNO. HEINZERLING.<br /><br />\nW. .1. WICRHAM•<br /><br />\nHEINZERLING<br /><br />\nFM9 ROCHESTER, N. Y.<br /><br />\n&amp; CO.<br />\nOffice &amp; Factory,<br /><br />\nBohemian ot<br />\nBavarian ot<br />\nMaerzen<br />\nApollo ot<br /><br />\n2I8-.r W. Conway St.<br /><br />\nCHALLENGE GINGER ALE<br />\nOur<br />\nCLUB GINGER ALE<br />\nSpecialties: CHAMPAGNE CIDER (ExtraDrY)<br />\nSPARKLING KOLAFRA<br /><br />\n.<br /><br />\n'pHONE • • •<br />\n204<br /><br />\ngallkiniaMINEIII<br /><br />\n'<br />\nI 060—Telephone--2060<br /><br />\nBALTIMORE BRANCH:<br /><br />\nOffice and Depot, - 227-239 S. Central Ave.<br /><br />\nv.10<br /><br />\nlow<br /><br />\no•<br /><br />\nEADY<br /><br />\nGEO. C. SUCRO, MANAGttH<br /><br />\nvitrllito<br />\n„ 60<br /><br />\nlkilt:;?\",fk<br />\niec.14<br />\n,11<br /><br />\nMandolins<br />\nGuitars •<br />\nBanjos<br />\n•<br /><br />\nWashburn<br /><br />\nare recommended<br />\nby the highest musical authorities<br />\nall over the world.<br /><br />\nfl'1<br />\nT<br /><br />\nf,• -<br /><br />\nH. R. EISENBRANDT SONS,<br /><br />\nf„<br />\n'Io<br /><br />\nR9G*:'<br /><br />\nSOLE ABENTS.<br /><br />\na Month.<br />\nPianos $5 Low<br />\nPrices<br />\nEasiest Terms.<br />\nTHEO.<br /><br />\nN. E. Corner<br /><br />\nCHARLES AND LEXINGTON STS.<br /><br />\nWARNER.<br /><br />\nSEND 6'tIN STAMPS ACTUAL COST OF MAILING AND GET ONE,<br /><br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERY CO..<br />\nBALTI MORE,MD. U.S.A.<br /><br />\nJAMES R. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS,.<br />\nCANES, tire. . .<br /><br />\nbatters<br /><br />\nMilk and<br />\nCassintere Hato<br /><br />\nTICOI<br /><br />\nC2<br /><br />\nAgents for<br />\ntor Walter Barnard London Hats.<br /><br />\nYa'<br /><br />\nMANUFACIURIR6 OP<br /><br />\nBALTIMORE, MD.<br /><br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and 4# Standard Machines<br />\nMimeograph Work.<br />\nrented at Si per week<br /><br />\nTYPEWRITER INSPECTION &amp; SUPPLY CO,<br />\n15 NORTH STREET.<br /><br />\nPrice Innovation! Cash Consideration!<br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nJNO. M. KEELER,<br />\nMaker of Men's Garments.<br /><br />\n6 N. CALVERT ST.. Opp. P. 0.<br /><br />\nThe Chas. Willifis Surgical Instrument Co.<br /><br />\nBENJ. A. NELSON, Oeu'l Manager.<br />\nManufacturers<br />\nand Importers of<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nMantle lioniery, Trusses, Rubber Goods,Ace.<br /><br />\nFINE SkIIMIC.,IL INSTINMENTS,<br /><br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTELEPHONE 771.<br /><br />\nNORTH GERMAN LLOYDS.S. CO. NEW YORK<br />\n01.6 LONDON,<br /><br />\nTO BREMEN, • •<br />\nPARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN ••• •<br />\nDIRECT.<br /><br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER &amp; CO.<br />\nFor particulars apply to<br />\nGeneral Agents.<br /><br />\nevery description. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br /><br />\nF. It bilVlbSON &amp; (2.<br /><br />\n509 W. Franklin Street,<br /><br />\nBaltimore, Md.<br /><br />\nTelephone 2095.<br /><br />\nATLANTIC TRyIrNSPOU LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br />\nBaltimore Storage &amp; Lighterage Co.,<br /><br />\nNew York Shipping Co.,<br /><br />\n403-409 WATER STREE7,<br /><br />\nI BROADWAY,<br /><br />\nBALTIMORE.<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 4z5 Water Street,[Second St.]<br />\nAdjoining Custom House on the West<br /><br />\nShort Insurance for a Day<br />\n. or Longer Period.<br /><br />\nTHOMAS I. CAREY, Pres.<br /><br />\nBOARD OF DIRECTORS:<br /><br />\nJesse Tyson,<br />\nFrancis white,<br />\nRichard Cromwell,<br />\nRICHARD B. POST, holy.<br /><br />\nA. J. Inman,<br />\nFord. C. Latrobe,<br />\nJoshua G. Harvey,<br />\nWilliam Harvey,<br />\nHenry James,<br />\nJames W. Bates,<br />\nAndrew D. Jones. GRIFFITH FM/MITER, int. de<br /><br />\nNEW YORK.<br /><br />\nJOHN V. RUPPERT,<br />\nMERCHANT TAILOR,<br /><br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for $10.00 and upwards.<br />\nScouring, Altering aud Repairing a Specialty,<br /><br />\nGUGGENHEIMER, WEIL &amp; Co.<br />\nStudents'...<br /><br />"}], "field_media_file": [{"target_id": 36098, "display": null, "description": null, "target_type": "file", "target_uuid": "ffcb1273-dd92-482f-b390-32cd4af03393", "url": "http://digital.library.jhu.edu/system/files/2022-03/12096-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12096, "target_type": "node", "target_uuid": "a17178d6-ecd8-4fd0-9dfe-cb9b20b467cc", "url": "/node/12096"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b0bbe875-bcec-4f54-aa0a-ab09ec74aa89"}]}