{"mid": [{"value": 36779}], "uuid": [{"value": "48c67b1b-0298-48d3-aeb1-da05a55d5f48"}], "vid": [{"value": 36779}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13025-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 11<br />\n<br />\nBALTIMORE, MD., NOVEMBER 7, 1922<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nSOPHOMORE PRESIDENT<br />\nPROFESSOR AMES LECTURES RIFLE TEAM TO BEGIN PRACTICE IN NEAR FUTURE<br />\nSUGGESTS CO-OPERATION<br />\nON AERONAUTICS AT<br />\nOF FRESHMEN<br />\nTHURSDAY ASSEMBLY<br />\nCaptain McMurray to Act as the<br />\nCoach. Prospects for ChamKlein Addresses First Year Men<br />\nRecent Steps in Scientific Investipionship Team Bright<br />\nat Meeting. Team Called for<br />\ngation of Conduct of AeroCandivates for Debatiag<br />\nplanes Explained in Detail<br />\n, \\Vith the completion of the physDaniel E. Klein, President of the<br />\nProfessor Joseph S. Ames, pro- ical examinations, the rifle team<br />\nMethodists No Match for Van Orman's Regulars. Coady's<br />\nfessor of Physics at the Johns Hop- will begin practice in the near fu- Class of '25, addressed the FreshReturn to Lineup Adds Punch to the<br />\nkins University, and a member of ture. Work has already been start- man Class meeting, held in the Civil<br />\nBackfield<br />\nthe National Advisory Committee ed on the indoor rifle range, which Engineering Hall. after Thursday's<br />\nfor Aeronautics, delivered an inter- is situated in the north loft, Gilman assembly. Klein explained that the<br />\nWhatever doubts the Black and Blue followers may have had<br />\nestin z lecture on the research work Hall, and the gallery will soon be present Freshman Class probably concerning the powers of the Hopkins gridiron machine, were certhat has been done recently in con- ready for use. Captain McMurray, regarded the Sophomores with the tainly dispelled last Saturday when the Methodists from Western<br />\nnection with the manufacture of who will act as coach for the team customary amount of affection, and Maryland were smothered by a score of 35-0 at Homewood. With<br />\naeroplanes: The object of the in- this year, is anxious to have all of stated that ill feeling was entirely Cotts Coady in action for the first time this year, and presenting its<br />\nvestigations was to furnish the the old men, that is, men who shot uncalled for, as the two classes regular lineup for the first time in three weeks, Van Orman's machine<br />\nmakers of airships- with the scien- last year, out for the team this work together in the interests of showed that it will certainly be among the foremost contenders for<br />\ntific information that would enable year. Any new men who are in- Hopkins.<br />\nthe state title. Not only did the line again put up its usual brand<br />\nAlthough advocating the mainte- of stonewall defense, but the backfield showed a more consistent<br />\nthem to turn out more efficient and terested are also urged to come out.<br />\nSince the range will not accommo- nance of the traditional rivalry be- and varied attack than has been evidenced in any previous game this<br />\ntrustworthy products.<br />\nHe first stated the manner in date all of the men at one time, tween the two classes, Klein de- year. With Coady and 'Taylor slicing off tackle for five yards at a<br />\nwhich the various .problems had definite hours will have to be as- clared that there was nothing ma- crack, with Turnbull bucking the line successfully, and Buck Bonner<br />\ncome before the committee, and, in signed the men for practice. When licious in the Freshman Regula- generalizing his team in fine shape and in addition throwing an oca few words, told whY it was nec- the men report to Captain fcMur- tions. He explained.that the wear- casional forward or running an end, nothing could stop the Hopkins<br />\nessary that they should be solved. ray they are asked to give him a of distinctive hats and buttons backfield once it was started. The only thing that marred the game<br />\nWhen planes are tested by the complete schedule of their free would enable the Freshmen to be- was its great sloWness caused by frequent penalties and much haranmethods existing at present, the hours. Application should be made come acquainted for the benefit of guing with the officials.<br />\nPilots cannot tell accurately what to the Military Department this themselves and the University, and<br />\nThe only real offensive work on the part of the Green and Gold<br />\nthat participation in school activthey did or how ,the planes acted. week.<br />\ncame on the first few plays of the<br />\nThe plane has complicated motions, Prospects for a championship ities is a practical expression of the<br />\ngame. On the first scrimmage an<br />\nDRAMATIC CLUB STARTS REseveral in horizontal and several in team this year are very bright, school spirit that must be acquired<br />\nend run around the left wing netHEARSALS FOR ONE-ACT<br />\nvertical directions. To know the since only one man was lost through by all. He urged that the Freshted nine yards and a line plunge<br />\nPLAYS<br />\nconditions affecting these motions graduation last year. The remain- men obey the regulations of their<br />\nthru center gave the visitors their<br />\nCasts Chosen' for Minor Producand to know the nature of these ing men are Captain Knoff, Sher- own volition, and, in every way,<br />\nonly earned first down. Hopkins,<br />\ntions. Major Presentation Not<br />\nmotions are essential for an un- wood, Mount, Steck. Wilgis and work for the good of Johns Hopon the other hand, earned fourteen<br />\nYet Decided Upon<br />\nbiased judgment of the worth of a L'Allemand. The positions of these kins. In this spirit, Klein requeston straight line plunges in addiThe<br />\nDramatic<br />\nClub is busily enPlane.<br />\nmen are not necessarily assured. e3 the first year men to attend bition to several more by the air<br />\ngaged in casting and starting reroute. Grimm and Flannagan<br />\nIn their investigations, the scien- and the Freshmen will be given weekly yell practices at the barn. hearsals for the<br />\none-act plays<br />\nKlein's<br />\ngeneral<br />\natitude<br />\nwas<br />\nevery<br />\nchance<br />\nin<br />\nthat<br />\nthe<br />\nwhich<br />\nmatches,<br />\nthe<br />\nmodel,<br />\nabout onetists suspended a<br />\nwhich will be presented toward the played best for Coach Shroyer's<br />\nFreshman<br />\nand<br />\nwill<br />\nSophomore<br />\nprobably<br />\nbegin<br />\nearly<br />\nClasses,<br />\nnext<br />\ncharges.<br />\noriginal,<br />\ntwentieth the size of the<br />\nend of the month. Four plays will<br />\nas<br />\nindividual<br />\nbodies,<br />\nshould<br />\nact<br />\nin<br />\nweek.<br />\nreal<br />\nThe<br />\nmatches<br />\nbewill<br />\nin a wind tunnel. The model beAfter the invaders had made<br />\nthe roles of friendly competitors: be given and in some cases two seping smaller than the original, the gin around Christmas.<br />\narate casts are rehearsing the same their initial rush Taylor received<br />\nLast year the Athletic Associa- 'ut.it that, in all cases affecting the<br />\nwind conditions were regulated proplay. To date, three plays have been a punt on his 18-yard line and the<br />\nportionately. Then, since the revo- tion added the Rifle Team to the college as a whole, they should work chosen and their casts<br />\nare already drive that resulted in the initial<br />\nlution of the propeller also had to list of minor sports. and decided hand in hand for the University.<br />\nbusy<br />\nrehearsing.<br />\nscore was on. Coady tore thru cenIn the same spirit Mr. Collins<br />\nbe taken into account, a propeller that any man who shot in seventy\"Overtones\" is to be coached by ter for six yards and thru right<br />\ndelivered<br />\na<br />\nsuggestion<br />\nfrom the<br />\nwas made to revolve on the model. five per cent, of the matches would<br />\nJoe Moran, the cast including Al- guard for four more. Turnbull<br />\n\"With this apparatus the investiga- receive an R H T. The organization Student Council to the effect that ger Hiss in the role<br />\nof \"Maggie\"; smashed left tackle for five yards<br />\ntors perfected their designs for also ruled that a major H would the Freshmen should enforce the<br />\nJackson Kidel, as \"Margaret\"; Ed and first down. Repeated line<br />\nmeasuring the action of a plane me- be awarded to a man winning first regulations themselves by having a Buffington,<br />\nas \"Harriet,\" and Hen- bucks and off tackle plays placed<br />\nplace in the National Rifle Asso- \"pep\" committee of their own to<br />\nchanically.<br />\nry Joesting as \"Hetty.\"<br />\nthe ball on the visitors' 45-yard<br />\nBy a system of tubes, connected ciation Match. Quite an induce- deal with delinquents. This idea<br />\nIn<br />\n\"The<br />\nVery<br />\nNaked<br />\nBoy,\"<br />\nFred<br />\nline. Here Walker Taylor rewith holes in the wings and lead- ment is thus offered to the Fresh- was heartily endorsed by the class. Steck will endeavor to do justice<br />\nceived<br />\nthe pigskin; sliced thru the<br />\nPresident Middleton again reing to pressure gauges, the pressure men, for the Rifle Team is a recto<br />\nthe<br />\ntitle<br />\nrole,<br />\nwhile<br />\n\"He\"<br />\nand<br />\nline<br />\noff<br />\nleft tackle, with the aid<br />\non the different parts of the wings ognized student activity, and an ac- quested that class dues be paid \"She\" will be represented by Webof<br />\ngood<br />\ninterference evaded the<br />\ncan be learned, no matter what po- tivity button will be given all those promptly. He announced also that ster and Hudson, respectively.<br />\nwhole<br />\nMethodist backfield and<br />\ncandidates for the Freshman Desition the pilot takes. The results who try for the team.<br />\n\"Helena's Husband\" will be raced the remaining distance for<br />\nbating<br />\nTeam,<br />\nwhich<br />\nis<br />\nto<br />\nmeet<br />\nthe<br />\nSeveral challenges have been isare prepared for practical purposes<br />\nplayed with Fitzgerald Dunning as the first points of the game. This<br />\nin the form of contour or relief sued by Captain McMurray and Sophomore team, should report to \"Menelaus,- the husband. Hugh<br />\nplay electrified the spectators and<br />\nmaps, which serve as guides to the Manager Parks, and it is expected Professor French. A tentative draft English will appear as \"Helena,\" dispelled any<br />\ndoubt as to the outof<br />\nthe<br />\nclass<br />\nconstitution,<br />\nwritten by<br />\nmanufacturers in strengthening the that a very attractive schedule will<br />\nand the other parts will be taken come of the game.<br />\na<br />\ncommittee<br />\ncomposed<br />\nof Townsend<br />\nparts on which pressure is greatest. be announced shortly.<br />\nby Mortimer playing \"Paris,\" PasIt was immediately after this,<br />\n(chairman),<br />\nBerndt,<br />\nSullivan<br />\nand<br />\nThe important controls, such as the<br />\nsano<br />\nas \"Analitikos,\" and Margo- however, that Western Maryland<br />\nNingard,<br />\nwas<br />\nread<br />\nand<br />\nexplained<br />\nrudder and the elevator, are sub- PRESIDENT GOODNOW TO<br />\nby Townsend. Members of the lin in the part of \"Tsumn.\"<br />\nhad its only real chance to score.<br />\nREVIEW R. 0. T. C.<br />\njected to similar examinations,<br />\nWork on the major production After Coady had kicked offside<br />\nclass were invited to make suggesA'review of the R. 0. T. C. unit<br />\nwith the same result: that is, instrutions before the final writing of the is progressing. The choice now on his own 40-yard line, succesments have been designed to record will be held on next Monday afterconstitution. The meeting then ad- lies between Tarkington's \"Mon- sive penalties against Hopkins for<br />\nthe actions of these parts under noon before President Goodnow<br />\nsieur Beaucaire,\" and \"Beau Brum- a total of 35 yards placed the ball<br />\njourned.<br />\nvarious conditions.<br />\nfel,\" by Clyde Fitch. The nights on the four-yard line. Here the<br />\nand the Military Committee of the<br />\nof March 12 and 13 have been Black and Blue made a great<br />\nThe lecture was accompanied by University. Heretofore, no reHOPKINS MEN AT HARVARD<br />\nchosen for the presentation of the<br />\n\"slides,\" showing the instruments views have been held before the<br />\nThe following Hopkins men are play, and it is thought that rehear- stand. The first play netted one<br />\nthat were explained, and the difyard thru center. Magill and Midspring of the year. However, with enrolled at Harvard University:<br />\nsals will be under way before the dleton smeared the next for a twoferent kinds of charts that give the<br />\nIn the Law School—Carville Christmas holidays.<br />\nresults of the investigations. Pro- the excellent material in the Freshyard loss and two more plays netBenson,<br />\nJr., '20; Joseph Berkofessor Ames, in his conclusion, em- man Class, Major .Garey has deted<br />\nless than two yards. The<br />\nOMISSION IN LIST OF<br />\nPhasized the fact that the knowl- cided upon this rather bold step, witz, '20; Lai Kwang Lon, '20; Eli<br />\nquarter<br />\nended with the ball in<br />\nDEGREES<br />\nedge sought was purely scientific, breaking from the precedent of Frank, Jr., '21.<br />\nHopkins<br />\npossession on her own<br />\nThe<br />\nRegistrar calls attention to<br />\nIn the School of Business AdJust as investigations in the physics previous years.<br />\none-yard<br />\nline.<br />\nan error which crept into the list<br />\nlaboratory. In this case, however, It is understood that the battal- ministration—John Stearns, '20; of degrees granted by the trustees<br />\nAt the beginning of the second<br />\nJesse Halle, '21.<br />\nthe experiments have a direct bearand<br />\npublished<br />\nin<br />\nion will be asked to join the large<br />\na<br />\nrecent<br />\nissue<br />\nof<br />\nquarter<br />\nBonner intercepted a forIn the Medical School—Niel Miling on a commercial enterprise, the parade on December 2nd<br />\nbefore the liken, '21; Benjamin Rones, '22; THE NEWS-LETTER. Quentin D. ward on his 20-yard line. Coady<br />\nmanufacture of aeroplanes.<br />\nArmy-Marine game. As many of Gilson Engel, '22.<br />\nSingewald completed the require- hit left tackle for six yards and<br />\nments for the A. B. degree in June then tore off 22 more thru the<br />\nMiddleton, president of the Ath- the Washington officials will probletic Association, made several an- ably be in Baltimore, it is essential<br />\nlast, but through some inadvert- center of the line and nearly sucnouncements, one of which was that the unit make an excellent<br />\nence his name was omitted from ceeded in breaking away. Losing<br />\n11 DAYS<br />\nthat the Student Council had de- showing. Major Garey, in the event<br />\nthe list of candidates, and his name possession of the ball only once<br />\nBEFORE THE<br />\ncided to close the memorial room that he should accept this invitadid not reach the trustees before the Black and Blue attack netted<br />\nIn Gilman Hall to all except Sen- tion, has imposed the condition that<br />\nCommencement. His diploma bears six first downs and Turnbull<br />\nMARYLAND<br />\niors, members of the Faculty, and either every member of the unit<br />\nthe date of June 13, 1922, and that plunged across the line for the secofficials of the administration. The will participate, or that he will not<br />\nGAME<br />\nfact was brought out in the official ond score, but missed his try for<br />\nlist issued by the Registrar's Office.<br />\ngo into the parade.<br />\nContinued on Page 4, col. 2<br />\nContinued on Page 4, col. 4<br />\n<br />\nWESTERN MARYLAND<br />\nCRUSHED BY ATTACK<br />\nOF BLACK AND BLUE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922<br />\n<br />\n2<br />\n<br />\nGOUCHER GRADUATE AD- SIFIAFTESBURY ADDRESSES 0. D. K. DISCUSSES CAMPUS<br />\nPROBLEMS<br />\nFIELD CLUB<br />\nDRESSES SOCIAL SCIENCE<br />\nafternoon,<br />\nMr.<br />\nOn<br />\nWednesday<br />\nCLUB<br />\nAt<br />\na<br />\nmeeting<br />\nof the Omicron<br />\nFOUNDED 1897.<br />\nOn Friday afternoon, Miss Shaftesbury addressed the Field Delta Kappa Honorary Fraternity,<br />\n$2.00 Pastenak, a graduate of Goucher Club. He is a graduate student held last Wednesday, the first matSubscription<br />\nCollege and student in the J. H. U.<br />\nhere and was formerly a member ter of discussion was in connection<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Graduate School of Social Science,<br />\nwith the appointment of a commitBaltimore, Md., under Act of Congress, November 3, 1879.<br />\naddressed the Social Science Club of the Department of Agriculture tee on the scholarship of men on<br />\nin Washington, where he worked athletic teams. This committee has<br />\nPublished semi-weekly from October to June by the students of Johns on \"The Dependency of InterHopkins University.<br />\nrelated Families.\" After a brief on bees.<br />\na twofold purpose in view. First,<br />\nMr.<br />\nShaftesbury's<br />\ntalk<br />\nwas<br />\non<br />\nremark<br />\nhistory<br />\nof<br />\nSocial<br />\nit is to' protect the men who are<br />\nBusiness communications Should be addressed to the BUSINESS MAticommunications<br />\nother<br />\nand<br />\nUNIVERSITY;<br />\nall<br />\narticles<br />\non<br />\neconomic<br />\nthe<br />\naspect<br />\nof<br />\nbees.<br />\nHOPKINS<br />\nPastenak<br />\nService,<br />\nMiss<br />\nfew<br />\n.JOHN<br />\nmade<br />\na<br />\ndoing<br />\nAGER,<br />\nextra-curriculum work by<br />\nshould be sent to the MANAGING EDITOR.<br />\nobservations on the comparison of He told of the various methods of watching their marks, warning<br />\nHomewood 100 religions to state control of social raising bees, both for pleasure and them if their marks are low, and<br />\nTelephone<br />\nservice work. However, her main profit. The civilization of the bee securing some one to help men who<br />\npoint was the fact that in her sur- is a fit subject for men to study. are having any particular difficulty<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nvey of the conditions of dependent Their system of castes, division of with any of their courses. SecondGLOVER P. FALLON, '23.<br />\nfamilies in Baltimore, she observed labor, and stringent discipline for ly, the purpose of the Scholarship<br />\nManaging Editor:<br />\n'23.<br />\nHUFFARD,<br />\nJ. HUDSON<br />\nthe large number of related families the good of their society and their Committee is to prevent the variAdvertising Manager:<br />\n'23.<br />\nVANNEMAN,<br />\nthat<br />\nsought social aid. This point future generations reveals a com- ous teams of the University from<br />\nK.<br />\nDONALD<br />\nAssistant Managing Editor:<br />\nbrings up the problem of heredity plex method of living that is of the losing athletes.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nCirculation Manager:<br />\nand environment, and the part they greatest human interest and imporLater in the year this committee<br />\nAssociate Editors:<br />\nPHILIP W. HOWARD, '25.<br />\nplay in social menaces. Miss Pas- tance. Bees are solitary, gregarious intends to watch the marks of all<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nAssistant Business Managers: tenak is now engaged in an inten- or communal and each sort dis- men who are engaged in extra-curBERNARD C. HEARN, '23.<br />\nsive study of this situation and is plays a thoroughly practicable riculum work, rfo matter what that<br />\nJunior Editors:<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nanalyzing the causes that may be method of coping with the various work may be.<br />\nD. MILES MARRIAN, '25.<br />\nT. REESE MARSH, '24.<br />\n'25.<br />\nGIESKE,<br />\nDONALD<br />\nG.<br />\ncontrolled in the matter of the problems which they are called<br />\nThe second problem, which was<br />\nRICHARD C. TILGHMAN, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN W. PARSONS, '25.<br />\nupon to meet. The bee lives main- discussed at the meeting dealt with<br />\nhealth,<br />\nintelligence<br />\nand<br />\ncharacter<br />\nof<br />\n'23<br />\nJR.,<br />\nLEWIS,<br />\nC.<br />\nJOHN<br />\nBENJAMIN T. ROME, '25.<br />\nthese inter-related dependent fam- ly in a world of smell and touch, the amount of courtesy which<br />\nin contrast with the world of sight should be extended to the visiting<br />\nilies.<br />\nand<br />\nsound, to which men are ac- athletic teams.<br />\nAfter the lecture, the members<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nof the club participated in a discus- customed. This increases the difThe Sigma Chi Beta Fraternity<br />\nsion of the question, Miss Pastenak ficulties of dealing with them and supervises the social work which is<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. answering the questions brought interpreting their behavior. Vari- done on the campus, and it was felt<br />\nous stereoptican views were shown by the members of 0. D. K. that the<br />\nup.<br />\nto illustrate the lecture.<br />\nMr. Sigma Chi Beta should take this<br />\nIn<br />\nthe<br />\nnear<br />\nfuture<br />\nthe<br />\nSocial<br />\nBALTIMORE, MD., NOVEMBER 7, 1922<br />\nScience Club, with the assistance of Shaftesbury's talk was highly in- matter of lack of proper courtesy<br />\nDr. Lovejoy, expects to secure some structive as well as intensely inter- in hand and endeavor to make<br />\nJohns Hopkins one of the univerprominent speaker on the subject esting.<br />\nMAKE FOR A PATHLESS CAMPUS<br />\nsities which are noted for the courof<br />\nthe<br />\n\"British<br />\nPolitical System<br />\nThe slogan \"make for a pathless campus,\" adopted by the Stu- Recent Crisis.\" It is expected that<br />\nTAU BETA PI CONSIDERS<br />\nteous manner in which they meet<br />\naccomgood<br />\nThe<br />\nCANDIDATES<br />\none.<br />\nadmirable<br />\nan<br />\nis<br />\nyear,<br />\nthe<br />\nCouncil<br />\nfor<br />\nthe representatives of other colthe club will renew its former poldent<br />\nHonorary<br />\nFraPi<br />\nThe<br />\nTau<br />\nBeta<br />\nleges.<br />\nplished by making such a drive should do much toward adding to the icy of working in conjunction with<br />\nDiscussion was held regarding<br />\nthe Goucher Ethics Club, as for ternity is considering new candibeauty of our grounds.<br />\ndates. The Tau Beta Pi has the signs which mark the' places<br />\nmerl v.<br />\nas members those men in the En- where the new buildings will stand.<br />\nA great deal of money has been spent during the past year upon<br />\nSchool whose scholastic These signs are ill a very dilapigineering<br />\nSOPHOMORES TO ENFORCE<br />\nexternal improvements. The wooden steps leading to the main and<br />\nstanding<br />\nis<br />\nthe highest. There are dated condition and members of the<br />\nREGULATIONS<br />\nwing entrances to Gilman Hall have been replaced by more artistic<br />\neight<br />\nmen<br />\neligible<br />\nto election this 0. D. K. have called the attention<br />\nAt a meeting of the Sophomore<br />\nThe<br />\nfrom<br />\nupon.<br />\nthe<br />\nClass and one of the Faculty to the appearance of<br />\nyear<br />\nSenior<br />\nimproved<br />\nClass last Friday, President Klein<br />\nsubstitutes. The entire main entrance has been<br />\nmay<br />\nbe<br />\nduring these unsightly objects on the<br />\nwho<br />\nelected<br />\nJunior,<br />\nbrought up the question of the<br />\nremainder of the grounds has been beautified by the addition of sevJunior<br />\nterm.<br />\nThe<br />\none<br />\nis campus.<br />\nSophomore \"Pep Committee.\" He the first<br />\neral thousand dollars' worth of shrubbery. Much attention has been explained that the work of enforc- that student whose average has been<br />\ngiven the lawns between the buildings and where there is a tendency ing regulations has been left too the highest in his class for his first<br />\nPAGE MR. DARWIN<br />\nmuch to the committee, and that it two years at college. At the secto trespass fences have ben ereected.<br />\nas I chanced to pass,<br />\nOne<br />\nday,<br />\nis the duty of every sophomore to ond half of the junior year oneHowver, a number of boosters of the \"straight line\" theory have- see that the freshmen do not stray eighth of the class is eligible, and<br />\nA beaver was damning a river<br />\npersisted in taking the -shortest distance between two points.\" re- from the straight and narrow path. at the beginning of the Senior year And a man who had run out of gas<br />\nPlans for the coming sophomore one-fourth is eligible.<br />\nWas doing the same to his flivgardless of its effect upon the grass. Consequently, unsightly cowScholarship is the main considersmoker were discussed, and the<br />\nv er.<br />\npaths have put in their appearance, notably, from the Y. M. C. A. President announced the program ation for admittance, although<br />\n—Phoenix<br />\noffice to the drive, from the C. E. Hall, around the end of the tennis of entertainment which will be giv- character and personality are essential to election. As a rule, twoen by members of the class.<br />\ncourts, and between the engineering buildings. ?<br />\nof those eligible are admitthirds<br />\nPage O'Connor, representative<br />\nHopkins grounds can compare in beauty with those of any col- on the Student Council from the ted. At the present time the fralege in the country, large or small. It is gratifying to see the Student Sophomore Class, spoke on class ternity has only five active members: Warfield, Shaefer, Grace,<br />\nCouncil give their support to preserve and improve upon the attrac- and school spirit. He urged every<br />\nsophomore to be present in the Wilen and Vogel, while Professor<br />\ntiveness of our campus.<br />\nChristie and Dean Whitehead are<br />\nrooting section at all games.<br />\nPresident Klein announced that honorary members.<br />\nThe initiation of the new men<br />\na Freshman-Sophomore debate will<br />\nbe held about the first of January. will take place some time in the FOREVERY DEGREE<br />\nANOTHER NEED<br />\nThe subject of the debate will be near future, and will be followed<br />\nof Lead<br />\n\"Freshman<br />\nRegulations.\" Organi- by a banquet at the Hopkins Club.<br />\nNow that winter is approaching, it seems the proper time to call<br />\nzation of several Sophomore basto the attention of the University authorities, a matter which has long<br />\nketball teams for inter- and intra- VEDENIAPINSKY TO PLAY ON<br />\nneeded a remedy, that is, the inadequate facilities for handling the class competition<br />\nC. E. BASKETBALL TEAM<br />\nwas begun.<br />\nThe C. E. Juniors have organized<br />\ntraffic that must use the roads about the campus.<br />\na basketball team. For sometime A serviceable,<br />\nGOLF TEAM<br />\nIt is difficult enough for the pedestrian to keep out of the way<br />\nsimplified<br />\nGreat<br />\nexcitement<br />\ncaused<br />\nthe<br />\nwas<br />\nthis group has been practicing in writing tool that holds<br />\nthere<br />\nwhen<br />\nof the automobiles in fair weather, but during the winter<br />\nother day by a bulletin which read the afternoons on the court to the the style of lead most<br />\nis a heavy snow upon the ground the problem is a real one. The \"Organization<br />\nof an African Golf south of C. E. Hall. The squad suitable for your particroad leading from the Thirty-second Street entrance to the Postoffice Team.\" After the tumult and fur- consists of: Forwards, Cochran, ularcollege work.Seven<br />\ndifferent grades availis a very narrow one; so narrow that two machines can barely pass. -.)re. which the notice caused, had Crout, Wysong and St. Claire; able.<br />\nIn the wintertime the students are frequently forced into the deep subsided, it was learned that the Centre: Martin, Michael and Ved- Made economically<br />\nby<br />\nDorsey mass production methformation of a -real golf team was eniapinsky ;<br />\nGuards:<br />\nsnow to avoid being struck.<br />\nTo- ods and sold at prices<br />\nIt seems a perfectly logical time to clear at least a temporary in the offing. At a meeting last (Capt.), Moehle, Watson and<br />\nvarious classes, which make wood penWednesday<br />\nof<br />\ncandidates,<br />\nGames<br />\nwith<br />\nthere<br />\nveil.<br />\nroad from the rear of the powerhouse, around the south end of the<br />\nwas naturally a great deal of dis- sections and organizations on the cils a luxury.<br />\nengineering buildings to the road leading down to the Civil Engi- cussion, but nothing was done. Be- campus are wanted.. For particu- TheSTUBBY—shown<br />\nhere—of Rolled Silver<br />\nneering Hall basement. A road will have to be constructed there sides several renowned golfers in lars see F. L. Moehle, Box 410.<br />\nwith ring for watch<br />\nnow\"?<br />\nnot<br />\n\"why<br />\neventually, so<br />\nthe Medical School to build a team<br />\nchain costs $1.00.<br />\nCROSS-COUNTRY<br />\nSuch a temporary road would leave the concrete walk safe for around, it has been learned that<br />\nSee this and other<br />\nin<br />\nthere<br />\nare<br />\nsome<br />\neminent<br />\ngolfers<br />\nThe<br />\nCross<br />\nCountry team, which Ingersoll models at your<br />\ngive<br />\nstill<br />\naccess<br />\nto<br />\nGilman<br />\nHall<br />\nand<br />\npedestrian students and would<br />\nthe undergraduate department who was reported disbanded last Satur- stationery or cooperathe various parking spaces.<br />\nare \"hiding their light under a day, has organized again, as an- tive store.<br />\nIt will, further, be a great aid in the \"make for a pathless cam- bushel.\" With great pride we re- nounced by Manager Shriven. The<br />\nIngersoll Redlpoint Co.,Inc.<br />\nWm. H.Ingersoll,Pres.<br />\npus\" campaign.<br />\nfer,to Johnny Sherwood, Ed Stro- team has resumed practicing under 461 Fourth Ave.,New York City<br />\nbel, Jack Croker and George Doub. the watchful eye of Captain Booth. 111111111111111111111111111111111111M1111111111111111111M<br />\nHow about it, Mr. Authority?<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\nIngersoll<br />\n<br />\n\fis<br />\n<br />\nDll<br />\n<br />\nttDn<br />\nit-<br />\n<br />\nas<br />\nst,<br />\nre<br />\nD<br />\nig<br />\nid<br />\n<br />\nty<br />\nclip<br />\n•i-<br />\n<br />\nL11<br />\nrat<br />\n<br />\n:h<br />\n:h<br />\n<br />\nLg<br />\n<br />\nis<br />\n<br />\n!S<br />\n<br />\n1.<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922.<br />\n<br />\n3<br />\n<br />\nAND THREE TIMES<br />\nFREEDOM<br />\nAND<br />\nDEMOCTo the Editor of<br />\nRACY.<br />\nTIIE NEWS-LETTER:<br />\nWhy not give \"the infidel 43\" a<br />\nA Column in Which the Correspondents<br />\nSir:<br />\nhelping hand, Mr. Wilen, and radiAre Allowed Latitude, But Shoulder the Responsibility.<br />\nIn THE NEWS-LETTER'S Mailate to them a little of the sunshine<br />\nAll letters intended for publication of your convictions ?- Do a little bag of October 31 Frank Wilen,<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side missionary work with these belated the professed exponent of \"endurWARNER Si, COMPANY<br />\nonly.<br />\nNo attention will be paid to anony- \"clods\"(?) of \"diminuitive com- ing Faith,\" ridicules and apparentan<br />\nas<br />\nsigned<br />\nmous letters, but names<br />\nHATTERS<br />\nevidence of good faith will not be prehension.\" Shame on you for ly condemns an \"infidel clique\" of<br />\nprinted if request is made that they be<br />\n222<br />\nW.<br />\nBALTIMORE ST.<br />\nmocking and scoffing at them! \"no less than 43 unbelievers\" which<br />\nomitted.<br />\nnot<br />\nto<br />\nletter<br />\nis<br />\na<br />\npublication<br />\nof<br />\nThe<br />\nour Alma Mater harbors. These<br />\nbe taken as an indorsement of its views Shame.again for even nursing in<br />\nthe your heart a desire to maim and same \"unbelievers\" he ruthlessly<br />\nby the \"News-Letter,\" which invites<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n\"brand them\" for their infirmities stamps as \"clods\"—persons of \"diminutive comprehension\"—persons<br />\n(?)<br />\nof belief.<br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nBACK AT YOU W1LEN,<br />\n\"clamoring<br />\nwith vulgar obstinacy<br />\nask<br />\nyou<br />\nin<br />\nall<br />\nI<br />\nfrankness, Mr.<br />\nONCE—<br />\nNovember 2, 1922.<br />\nWilen, do you think your present for facts, evidence, and reasons and<br />\nsensible style of the business world.<br />\nTo the Editor of<br />\nattitude and policy could ever ad- other such irrelevant nonsense!\"<br />\nStein-Bloch and Goodman & Suss Clothes, tailored<br />\nTHE NEWS-LETTER:<br />\nvance Hopkins to a better spirit of (sic.)<br />\nin Rochester, exemplify that idea so well.<br />\nAs far as I am able to deduce,<br />\nThe letter of Mr. Wilen, appear- good fellowship, good sportsmanExclusively at—<br />\ning in THE NEWS-LETTER Of Octo- ship, good scholarship, or good these unfounded declarations, buried<br />\ncontains<br />\na<br />\nbeneath a maze of rhetorical<br />\nber 31, 1922,<br />\nnumber of anything?<br />\ngrandiloquence, are the result of<br />\nstatements which do not seem to me<br />\nFaithfully yours,<br />\na violently prejudiced and intolerto be conclusive to the spirit of felEVERETT C. MYERS,<br />\nlowship and fair-- -play for which<br />\nGraduate Student ant mind. If Frank Wilen consid(Y. M. B. 0. D.)<br />\ners Science as an \"upstart monster\"<br />\nHopkins has always stood. You<br />\nTWICE—<br />\nthen he is, indeed, grossly illusionspeak of Hopkins as \"harboring 43<br />\nBaltimore & Hanover<br />\nBaltimore, Md., ed.and<br />\ndeserves to be pitied. It is<br />\nunbelievers,\" and continue to be•<br />\nOctober 31, 1922.<br />\nas futile to oppose scientific analylabor these unfortunate(?) creaTo the Editor of<br />\nsis in the research after Truth as<br />\ntures by stating:<br />\nTHE NEWS-LETTER:<br />\nit is to oppose an earthquake.<br />\nWe who _have arrived . at the<br />\nIn a letter to THE NEWS-LETTER<br />\nFrank Wilen may have his fixed<br />\nGreat Understanding, who have<br />\nof October 31 one of our brightest and bigoted<br />\nopinion concerning<br />\npassed through the supreme portals<br />\nfellow-students condemns the \"43<br />\nScience and Religion, but why<br />\nof Faith, \\\\=hich is the- only true enunbelievers\" among us. He seems should<br />\nhe be so narrow-minded as<br />\nlightenment, and who have rightto be filled with the mediaeval spirto<br />\nattempt<br />\nto impose his fixed opineously spurned -that upstart monit, the spirit which passively ac- ion upon a<br />\nmore progressive few!<br />\nster, science,—must cleanse our<br />\ncepts the inheritance of the past<br />\nIs such the true aim of a college<br />\nsacred institution of this infidel<br />\nwithout questioning it or reconcileducation? Alas! How long wilt<br />\nclique,\" etc., etc.<br />\ning it with reason. Such a spirit<br />\nthou abuse with our patience, 0<br />\nWhat do you mean by all this?<br />\nemphasizes believing rather than<br />\nIntolerance?<br />\nWhat right have you to scoff at<br />\nliving. Such a spirit is intolerant<br />\nYours for greater tolerance<br />\nthese men of personal creed in the<br />\nand defies progress.<br />\nway you do, even if they are UnC. P. HEINLEIN, '23.<br />\nThe mediaeval spirit has no sense<br />\nJ. H. U., November 1, 1922.<br />\nbelievers?<br />\nof proportion; it haggles over imYou seem to have overlooked the possible questions of dogma, and<br />\nTRACK TEAM ENGAGES IN<br />\nfact that Hopkins is not a \"sacred\" neglects the essentials of relig:on.<br />\nPRELIMINARY WORK<br />\ninstitution, but an institution of Which is more essential, to believe<br />\nAt present the track team is delearning with equal rights and priv- hi the Divine inspiration of the<br />\nvoting most of its time to prelimileges for all!<br />\nBible or to follow the ideals of Ey- inary training. The newcomers are<br />\nAre you not making a serious ing which the Bible presents? And<br />\nbeing broken in, and, at the same<br />\nerror when you associate Science does the Bible contain the only true<br />\ntime, are getting ideas of just what<br />\nand Faith (or Religion) together, ideals in the world? Cannot an inthey want to do. General practice<br />\nand make one a force that is in any dividual follow high ideals secured<br />\nfor both indoor and outdoor work<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\nway antagonistic to the other? from another source? And finally,<br />\nis being held on Tuesdays and FriScience deals only with the Phe- is not religion to be judged by its<br />\ndays, at four o'clock in the after nomena of Matter; Religion deals actual value in individual and sonoon.<br />\nwith the Soul, which transcends cial experience, instead of from a<br />\nINSTRUCTION<br />\nWithin the next week practice in<br />\nmatter. There can be no quarrel narrow dogmatic viewpoint? If so,<br />\nhigh jumping and hurdling will be GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master or<br />\nbetween them! The ultimate goal the religion of the \"43 unbelievers\"<br />\nArts; Doctor of Philsophy.<br />\nstarted, and the board track will be<br />\nand purpose of all scientific research should not be condemned so confiMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nlaid in the near future in order to<br />\nis to lighten the burdens of Man, dently.<br />\nget the men accustomed to running COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nand to produce as nearly a perfect<br />\nSincerely,<br />\non indoor tracks. The whole team DEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Masmaterial happiness as possible. Why,<br />\nJ. L. H.<br />\nis working to put the Hopkins meet<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nthen, should you label Science as<br />\nChemistry.<br />\nwith<br />\na<br />\nacross<br />\nbang<br />\nthis<br />\nyear.<br />\nENTIRELY ABSENT<br />\nan \"upstart monster\"?<br />\nSCHOOL<br />\nOF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubThe professor was engaged in<br />\nNO DREAM<br />\nReligion, or Faith, on the other<br />\nlic<br />\nHealth;<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certifia knotty problem when his study<br />\n\"I had an awful nightmare last<br />\nhand, depends upon the belief in<br />\ncate in Public Health.<br />\ndoor was opened by a servant<br />\nnight.\"<br />\nMan that he has a something called<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nwho announced:<br />\n\"Yes, I saw you with her.\"—<br />\na Soul, which transcends matter,<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\n\"A little stranger has arrived,<br />\nPhoenix.<br />\nand which will live on after his<br />\nArts or of Science.<br />\nsir.\"<br />\nphysical body has ceased to exist<br />\nSCHOOL OF BUSINESS ECONOMICS.<br />\n\"Eh?\"<br />\nThe Height of Laziness<br />\nas an organized, living, entity on<br />\n• Breaking a cigarette in half so COURSES IN SOCIAL ECONOMICS.<br />\n\"It's a little boy.\"<br />\nthis earth. Would it not seem a<br />\n\"Little boy? Well, ask him you won't have to draw the EVENING COURSES in Business Economics and for Technical Workers.<br />\nmore wholesome attitude to regard<br />\nwhat he wants.\"—Wampus.<br />\nsmoke so far.—Purple Parrot.<br />\nScience and Religion as Complements—two distinct things, both<br />\ngood in themselves, both of which<br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br />\nwe need?<br />\nWhen you \"spurn\" Science as<br />\nBUILDINGS<br />\nan \"upstart monster,\" and would<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nunmercifully brand those who are<br />\nnot so fortunate as you to \"have arMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nrived at the Great Understanding,\"<br />\nas you claim to have done, you are<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nnot only picking an unjust quarrel,<br />\nPOWER HOUSE.<br />\nbut are also meddling with the<br />\nOf heavy Scotch Grain Leather; black or<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nrights and privileges which are<br />\nGarden.<br />\ntan; equipped with rubber heel: a colgranted by the Constitution of the<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nUnited States—to you, and to me.<br />\nlege shoe designed for real college men.<br />\nPHYSIOLOGICAL BUILDING.<br />\nand to everybody! WAKE UP!<br />\nANATOMICAL LABORATORY.<br />\nWe are living in a new era! This<br />\nHUNTERIAN LABORATORIES.<br />\nis 1922! We are not governed by<br />\nthe same statutes (as you infer)<br />\nPATHOLOGICAL LABORATORY.<br />\nwhich Lord Baltimore and his predSCHOOL OF HYGIENE.<br />\necessors were empowered to enCARROLL MANSION—Johns Hopkins Club.<br />\nAT CHARLES STREET<br />\nforce, but rather we are living in<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n216 NORTH<br />\nan age of charity and leniency—and<br />\nALUMNI MEMORIAL DORMITORY.<br />\nmost important of all, WE ARE<br />\nLIVING IN A COUNTRY OF<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n.50<br />\n4up<br />\nG<br />\n<br />\nY-yegrw4-<br />\n<br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER BFOTNEM<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\nA Hopkins<br />\nBrogue $8<br />\n<br />\nSlesingers<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922.<br />\n<br />\n4<br />\n<br />\nTHE PASSING OF TRADINOTICE<br />\nTIONS<br />\nmen realize what<br />\nProbably<br />\nfew<br />\n(THE BOOK MART)<br />\na great change has been made in<br />\nBLUE JAY<br />\nHopkins traditions by the removComplete Stock of<br />\nANNOUNCEMENT<br />\nMedical Books and College<br />\nal of the university to Homewood<br />\nThe Black and Blue Jay<br />\nRequisites<br />\nBusiness Staff wishes to anfrom the old site on Druid Hill<br />\nnounce that, owing to a printavenue. Gone is our old alley<br />\nImporters and Dealers in Fine Books<br />\ner's error, the Jay failed to<br />\ncampus, the narrow block of Garinclude the name of S. Ath301 N. CHARLES ST.<br />\nden street between Druid Hill<br />\nerton Middleton, '23, in the<br />\nBaltimore, Md.<br />\navenue and Monument street.<br />\nlist of Assistant Business<br />\n:<br />\nManagers, and to anototanc,<br />\nHere the \"Charles Street CowLeoJoseph<br />\nelection<br />\nof<br />\nthe<br />\nlounged<br />\non<br />\nboys\" of bygone days,<br />\npold, '24, as Assistant Busipacking boxes in the short strip<br />\nMANUFACTURING JEWELERS<br />\nness Manager.<br />\nLancaster, Pa.<br />\nof sunlight that fell between the<br />\nClass Rings, Pins, Fraternity Pins,<br />\nwalls of McCoy Hall and the late<br />\nLost, a ladies' gold bar<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes lamented cage. From nine in the<br />\npin. If found, please return<br />\n\"Makers of the Varsity Seals\"<br />\nto registrar's office.<br />\nmorning until two-thirty in the<br />\nafternoon the ancient and honorSHIRT MAKER<br />\nSTRATTON<br />\nable sport of pitching dimes was ATTRACTIVE PROGRAM AR226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00 the only pastime. Shortly after<br />\nDress Shirts<br />\nRANGED FOR SOPH SMOKER<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25 lunch the scene of activity shifted<br />\nImported Madras<br />\nAt a special meeting of the SophTerms Cash, Less 10% 30 Days on to the first floor of Levering Hall,<br />\nClass, held on Friday, Noomore<br />\nShirts<br />\nthe Student Y. M. C. A. Building,<br />\nAlso a Full Line of Men's<br />\nvember 3, 1922, plans for the class<br />\nFurnishings<br />\nlocated on the corner of Eutaw<br />\nsmoker, to be held at the St. George<br />\nstreet and Druid Hill avenue. ArHotel on Friday, November .10.<br />\nrayed in chairs, with feet lined<br />\nFine Clothes<br />\n1922, were fully discussed.<br />\nalong the window sill the HopA suit by Lemmert gives the final<br />\nA very attractive program has<br />\ntouch to the lasting satisfaction you kins men watched the girls of<br />\nbeen arranged. Several members<br />\nderive from thoroly dependable<br />\nWestern High School pass in recloths cut in authentic fashion—<br />\nof the class will furnish amusewear<br />\nor<br />\nmore<br />\nview.<br />\nwhether for every-day<br />\nment and a snappy jazz orchestra,<br />\nfestive occasions.<br />\nAlumni of the day of Governor<br />\ncomposed of members of the class,<br />\nRitchie will remember the \"Pot<br />\nat<br />\nLEM MERT<br />\nwill furnish music for the evening.<br />\nSocials\" held in the old locker<br />\nSeveral distinguished guests will<br />\n19 Fayette Street, East<br />\nroom on the ground floor of the<br />\nbe<br />\non hand. Dr. Gilpen, honorary<br />\nBusiness Suits<br />\nDress Clothes gym. This small room, formerly a<br />\npresident<br />\nof the class, will attend.<br />\nSport Togs<br />\nOvercoats<br />\nkitchen, was the gathering place<br />\nTom Landy, captain of the footof Sophomores. At almost any<br />\nball team, will award numerals to<br />\nNECKWEAR time of day a Freshman might be the Sophomores who won them last<br />\nSHIRTS<br />\nseen making a hasty and ingloriyear. 0. D. Collins, president of<br />\nous exit to the accompaniment of<br />\nOmicron Delta Kappa, will speak<br />\nhoots and jeers from the \"pep<br />\n421 N. HOWARD ST.<br />\non the spirit of 0. D. K.<br />\ncommittee\" whose session he had<br />\nDon Reese, chairman of the comHOSIERY<br />\nGLOVES<br />\ninterrupted.<br />\nmittee, while in a philanthropic<br />\nPlaces in the McCoy Hall ele•<br />\nframe of mind, agreed to furnish a<br />\nvator<br />\nwere strictly in order of seEstablished 1873<br />\nbarrel of cider for the smoker. This<br />\nniority. Freshmen were not alA.H.Fetting Man'fg Jewelry Co. lowed upon it at all and few seems to have had a stimulating<br />\neffect and subscriptions have inManufacturers<br />\nSophomores and Juniors were<br />\ncreased<br />\ntremendously. The joke is<br />\nGreek Letter Fraternity Jewelry<br />\nable to resist ejectment if they<br />\nthat<br />\nit<br />\nis<br />\nsweet cider.<br />\n213 N. LIBERTY ST., Baltimore, Md. were fortunate enough to get on<br />\nboard during the ten-minute interCHRISTIAN SERVICE CLUB<br />\nvals between periods.<br />\nThe Christian Service Club,<br />\nThe present year saw the passfounded two years ago by the Y.<br />\ning of one tradition. The Student<br />\nM. C. A., but now an independent<br />\nCouncil called off the usual fight<br />\norganization, held its second meetbetween the Freshman and Sophing of the year last Monday night.<br />\nomore classes after the Y. M. C.<br />\nMr. W. R. Barnhardt was elected<br />\nA. reception which in the old days<br />\npresident to fill the vacancy made<br />\nClibeXatterie)<br />\nwas held around the fountains in<br />\n`34M Zs H.& OSCAR G.1-01Y<br />\nby Mr. Custer Cromwell, who has<br />\nMt. Vernon Place and in recent<br />\nOWN ERS<br />\nleft the University. Dr. Daugheryears around the pond in front of<br />\nZ.E*1. 0e4Wel°<br />\nty, of Goucher College, was the<br />\nthe<br />\nBarn.<br />\n29 Baltimore St., East<br />\nspeaker<br />\nof the evening. His genOne Door West of Light St.<br />\nNor does the Senior class on the<br />\neral<br />\nsubject<br />\nwas \"The Bible.\" Dr.<br />\nSOLE AGENTS FOR BALTIMORE last day parade through the buildDaugherty spoke with great effect.<br />\nFor College Fraternity Bands<br />\nings to the accompaniment of its<br />\n(Greek Letter Societies)<br />\nFive new members were admitted<br />\nSwan Song,\"We Won't Be Here<br />\nat this meeting,—McFaul, Hunter,<br />\nAny More.\"<br />\nDoc Adams followed us to Long, Harp and \\Verner.<br />\nThe Christian Service Club meets<br />\nHomewood, but Fritz's Cafe has<br />\nPrinters of Philological and<br />\nevery<br />\nother Monday evening. The<br />\nno connotations to the present<br />\nScientific Works<br />\nprograms<br />\nalternate between genergeneration of Hopkins men. Sic<br />\nal<br />\ndiscussions<br />\n23 S. HANOVER ST.<br />\nand<br />\ninformal<br />\ntransit gloria mundi.<br />\nBaltimore, Md.<br />\nspeeches. At the meeting in which<br />\nLOUISIANA FOOTBALL TEAM general discussions are held a series<br />\nWEAR BEARDS<br />\nis being conducted on the leading<br />\nMembers of the Louisiana State religions of the world. At the meetSARATOGA AT<br />\nLIBERTY STS. LIniversity football team have ap- ing on November 13. to be held at<br />\npeared on the field for the last few the home of Mr. W. F. Wheeler.<br />\nLUNCHEON<br />\ndays with a heavy growth of beard, the subject will be \"Judaism.- Mr.<br />\nTEA<br />\nin accordance with the written Wheeler will lead the discussion<br />\nDINNER<br />\npromise signed by all varsity mem- himself. The next discussion will<br />\nSPECIAL PARTIES bers not to shave until they won a<br />\nbe on Confucianism. The Christian<br />\ngame.<br />\n11.30 A. M.<br />\nService Club issues a cordial inviuntil<br />\nMade desperate by their ill suc- tation to all to attend any of it<br />\nPLAZA 6987 cess,<br />\n7.30 P. M.<br />\nthey are determined to make meetings. Information concerning<br />\nthe fight of their lives in order to the club may be obtained from Win<br />\nobtain a shave.---Baltimore News. C. Roberts, secretary.<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n<br />\ng6tanbarb Punk To_<br />\n<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nBANK WITH<br />\n<br />\nSecurity Storage & Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, rresicient<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD,KOHN 8c Co.<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at anytime.<br />\nlj Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nLefranc & Ault<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nMt. Vernon 4999<br />\n<br />\nW.L. Mann<br />\n<br />\nPROFESSOR AMES LECTURES ON<br />\n•<br />\nAERONAUTICS AT THURSDAY<br />\nASSEMBLY<br />\nContinued from page I<br />\n<br />\ndecision will be acted upon by the<br />\nFaculty. Collins asked that stuCommercial Photography<br />\ndents<br />\nsubscribe to the Black and<br />\nCircuit Photography<br />\nBlue<br />\nJay<br />\nfor their friends. VanneViews<br />\nFlash Lights<br />\nman,<br />\nafter again requesting sugEnlargements<br />\nGroups<br />\ngestions for the celebrations on the<br />\nKODAK FINISHING<br />\ndays of our big games, led a few<br />\n325 N. Howard St.<br />\nsongs and yells.<br />\n<br />\nBLACK AND BLUE DEFEATS<br />\nWESTERN MARYLAND<br />\nContinued from. page 1<br />\n<br />\npoint. For the rest of the half<br />\nHopkins took things easy and the<br />\nball was in midfield when the period ended.<br />\nTaking the ball in the second<br />\nhalf on the kickoff, Van Orman's<br />\ncharges did not stop until Doug<br />\nTurnbull tossed a forward across<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nColder Weather Does Not<br />\nAffect the Superior Quality of<br />\n<br />\n1,<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nMore Power and More Miles to<br />\nEvery Gallon of This Wonder Motor Fuel<br />\n<br />\nI<br />\n<br />\nManufactured & Guaranteed by<br />\nSHERWOOD BROTHERS, lac.<br />\n<br />\nthe line .to Buck Bonner. This<br />\ntime Doug added the extra point.<br />\nA few minutes later a penalty<br />\nmade a first down for Hopkins impossible and Bonner called for a<br />\ndropkick. Coady-, standing on the<br />\n30-yard line, sent the pigskin<br />\nsquarely between the bars. At<br />\nthis stage Van Orman started to<br />\ntry out his subs for the first time<br />\nthis year. Maxwell went in for<br />\nCoady, Gilliece for Rich, Murphy<br />\nfor Magill and Rob Middleton<br />\ntook Taylor's place.<br />\n•• The. 'fourth touchdown came<br />\nafter a 20-yard pass, Bonner to<br />\nTaylor, had placed the ball on<br />\nthe six-yard line. Maxwell carried<br />\nit over. in two tries. Turnbull<br />\nmade the final score when he intercepted a forwar dand raced 60<br />\nyards to the goal line. Toward the<br />\nend of the game Murphy made a<br />\nhe<br />\nwhen<br />\nspectacular tackle<br />\ndowned Grimm in his tracks on<br />\nthe 35-yard line after the latter<br />\nhad received a long punt. The<br />\ngame ended soon after this with<br />\nthe ball in Hopkins' possession.<br />\nThe lineup :<br />\n<br />\nURN ER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nScore by Periods<br />\n6<br />\n10 13-35<br />\nMaryland ...0 06 0 0.-- 0<br />\nTouchdowns—Taylor, Bonner, Turnbull (2), Maxwell. Points—Turnbull<br />\n(2) by dropkick. Field goal—Cotdy.<br />\nSubstitutions: Hopkins — Maxwell for<br />\nCoady, Gilliece for Rich, Murphy for<br />\nMagill, R. Middleton for Taylor. Western Maryland—Clayton for Robey,<br />\nLong for Davis, Robey for Clayton.<br />\nReferee—Thomas, Syracuse. Umpire—<br />\nClinton, Lafayette. Head linesman—<br />\n(0) West. Maryland Bailey, Syracuse.<br />\nHopkins (35)<br />\nL E<br />\nDuncan<br />\nMiddleton<br />\nDouglas<br />\nMagill<br />\nWilliams<br />\nSlowick<br />\nRobey STUDENT COUNCIL NOTICE<br />\nCromwell<br />\nHofer<br />\nCouncill<br />\nThe work in the Gilman MeLandy (c).....R.T...... Flannagan<br />\nGroton morial Room has just been comR E<br />\nRich<br />\nGrimm<br />\nQ B<br />\nBonner<br />\nKinsey pleted. This room is open to SenL H<br />\nTaylor<br />\nDavis<br />\n.R H<br />\nCoady<br />\nStanley iors only.<br />\nF B<br />\nTurnbull<br />\nWesternop kins<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 11<br /><br />\nBALTIMORE, MD., NOVEMBER 7, 1922<br /><br />\nPRICE 5 CENTS<br /><br />\nSOPHOMORE PRESIDENT<br />\nPROFESSOR AMES LECTURES RIFLE TEAM TO BEGIN PRACTICE IN NEAR FUTURE<br />\nSUGGESTS CO-OPERATION<br />\nON AERONAUTICS AT<br />\nOF FRESHMEN<br />\nTHURSDAY ASSEMBLY<br />\nCaptain McMurray to Act as the<br />\nCoach. Prospects for ChamKlein Addresses First Year Men<br />\nRecent Steps in Scientific Investipionship Team Bright<br />\nat Meeting. Team Called for<br />\ngation of Conduct of AeroCandivates for Debatiag<br />\nplanes Explained in Detail<br />\n, \\Vith the completion of the physDaniel E. Klein, President of the<br />\nProfessor Joseph S. Ames, pro- ical examinations, the rifle team<br />\nMethodists No Match for Van Orman's Regulars. Coady's<br />\nfessor of Physics at the Johns Hop- will begin practice in the near fu- Class of '25, addressed the FreshReturn to Lineup Adds Punch to the<br />\nkins University, and a member of ture. Work has already been start- man Class meeting, held in the Civil<br />\nBackfield<br />\nthe National Advisory Committee ed on the indoor rifle range, which Engineering Hall. after Thursday's<br />\nfor Aeronautics, delivered an inter- is situated in the north loft, Gilman assembly. Klein explained that the<br />\nWhatever doubts the Black and Blue followers may have had<br />\nestin z lecture on the research work Hall, and the gallery will soon be present Freshman Class probably concerning the powers of the Hopkins gridiron machine, were certhat has been done recently in con- ready for use. Captain McMurray, regarded the Sophomores with the tainly dispelled last Saturday when the Methodists from Western<br />\nnection with the manufacture of who will act as coach for the team customary amount of affection, and Maryland were smothered by a score of 35-0 at Homewood. With<br />\naeroplanes: The object of the in- this year, is anxious to have all of stated that ill feeling was entirely Cotts Coady in action for the first time this year, and presenting its<br />\nvestigations was to furnish the the old men, that is, men who shot uncalled for, as the two classes regular lineup for the first time in three weeks, Van Orman's machine<br />\nmakers of airships- with the scien- last year, out for the team this work together in the interests of showed that it will certainly be among the foremost contenders for<br />\ntific information that would enable year. Any new men who are in- Hopkins.<br />\nthe state title. Not only did the line again put up its usual brand<br />\nAlthough advocating the mainte- of stonewall defense, but the backfield showed a more consistent<br />\nthem to turn out more efficient and terested are also urged to come out.<br />\nSince the range will not accommo- nance of the traditional rivalry be- and varied attack than has been evidenced in any previous game this<br />\ntrustworthy products.<br />\nHe first stated the manner in date all of the men at one time, tween the two classes, Klein de- year. With Coady and 'Taylor slicing off tackle for five yards at a<br />\nwhich the various .problems had definite hours will have to be as- clared that there was nothing ma- crack, with Turnbull bucking the line successfully, and Buck Bonner<br />\ncome before the committee, and, in signed the men for practice. When licious in the Freshman Regula- generalizing his team in fine shape and in addition throwing an oca few words, told whY it was nec- the men report to Captain fcMur- tions. He explained.that the wear- casional forward or running an end, nothing could stop the Hopkins<br />\nessary that they should be solved. ray they are asked to give him a of distinctive hats and buttons backfield once it was started. The only thing that marred the game<br />\nWhen planes are tested by the complete schedule of their free would enable the Freshmen to be- was its great sloWness caused by frequent penalties and much haranmethods existing at present, the hours. Application should be made come acquainted for the benefit of guing with the officials.<br />\nPilots cannot tell accurately what to the Military Department this themselves and the University, and<br />\nThe only real offensive work on the part of the Green and Gold<br />\nthat participation in school activthey did or how ,the planes acted. week.<br />\ncame on the first few plays of the<br />\nThe plane has complicated motions, Prospects for a championship ities is a practical expression of the<br />\ngame. On the first scrimmage an<br />\nDRAMATIC CLUB STARTS REseveral in horizontal and several in team this year are very bright, school spirit that must be acquired<br />\nend run around the left wing netHEARSALS FOR ONE-ACT<br />\nvertical directions. To know the since only one man was lost through by all. He urged that the Freshted nine yards and a line plunge<br />\nPLAYS<br />\nconditions affecting these motions graduation last year. The remain- men obey the regulations of their<br />\nthru center gave the visitors their<br />\nCasts Chosen' for Minor Producand to know the nature of these ing men are Captain Knoff, Sher- own volition, and, in every way,<br />\nonly earned first down. Hopkins,<br />\ntions. Major Presentation Not<br />\nmotions are essential for an un- wood, Mount, Steck. Wilgis and work for the good of Johns Hopon the other hand, earned fourteen<br />\nYet Decided Upon<br />\nbiased judgment of the worth of a L'Allemand. The positions of these kins. In this spirit, Klein requeston straight line plunges in addiThe<br />\nDramatic<br />\nClub is busily enPlane.<br />\nmen are not necessarily assured. e3 the first year men to attend bition to several more by the air<br />\ngaged in casting and starting reroute. Grimm and Flannagan<br />\nIn their investigations, the scien- and the Freshmen will be given weekly yell practices at the barn. hearsals for the<br />\none-act plays<br />\nKlein's<br />\ngeneral<br />\natitude<br />\nwas<br />\nevery<br />\nchance<br />\nin<br />\nthat<br />\nthe<br />\nwhich<br />\nmatches,<br />\nthe<br />\nmodel,<br />\nabout onetists suspended a<br />\nwhich will be presented toward the played best for Coach Shroyer's<br />\nFreshman<br />\nand<br />\nwill<br />\nSophomore<br />\nprobably<br />\nbegin<br />\nearly<br />\nClasses,<br />\nnext<br />\ncharges.<br />\noriginal,<br />\ntwentieth the size of the<br />\nend of the month. Four plays will<br />\nas<br />\nindividual<br />\nbodies,<br />\nshould<br />\nact<br />\nin<br />\nweek.<br />\nreal<br />\nThe<br />\nmatches<br />\nbewill<br />\nin a wind tunnel. The model beAfter the invaders had made<br />\nthe roles of friendly competitors: be given and in some cases two seping smaller than the original, the gin around Christmas.<br />\narate casts are rehearsing the same their initial rush Taylor received<br />\nLast year the Athletic Associa- 'ut.it that, in all cases affecting the<br />\nwind conditions were regulated proplay. To date, three plays have been a punt on his 18-yard line and the<br />\nportionately. Then, since the revo- tion added the Rifle Team to the college as a whole, they should work chosen and their casts<br />\nare already drive that resulted in the initial<br />\nlution of the propeller also had to list of minor sports. and decided hand in hand for the University.<br />\nbusy<br />\nrehearsing.<br />\nscore was on. Coady tore thru cenIn the same spirit Mr. Collins<br />\nbe taken into account, a propeller that any man who shot in seventy\"Overtones\" is to be coached by ter for six yards and thru right<br />\ndelivered<br />\na<br />\nsuggestion<br />\nfrom the<br />\nwas made to revolve on the model. five per cent, of the matches would<br />\nJoe Moran, the cast including Al- guard for four more. Turnbull<br />\n\"With this apparatus the investiga- receive an R H T. The organization Student Council to the effect that ger Hiss in the role<br />\nof \"Maggie\"; smashed left tackle for five yards<br />\ntors perfected their designs for also ruled that a major H would the Freshmen should enforce the<br />\nJackson Kidel, as \"Margaret\"; Ed and first down. Repeated line<br />\nmeasuring the action of a plane me- be awarded to a man winning first regulations themselves by having a Buffington,<br />\nas \"Harriet,\" and Hen- bucks and off tackle plays placed<br />\nplace in the National Rifle Asso- \"pep\" committee of their own to<br />\nchanically.<br />\nry Joesting as \"Hetty.\"<br />\nthe ball on the visitors' 45-yard<br />\nBy a system of tubes, connected ciation Match. Quite an induce- deal with delinquents. This idea<br />\nIn<br />\n\"The<br />\nVery<br />\nNaked<br />\nBoy,\"<br />\nFred<br />\nline. Here Walker Taylor rewith holes in the wings and lead- ment is thus offered to the Fresh- was heartily endorsed by the class. Steck will endeavor to do justice<br />\nceived<br />\nthe pigskin; sliced thru the<br />\nPresident Middleton again reing to pressure gauges, the pressure men, for the Rifle Team is a recto<br />\nthe<br />\ntitle<br />\nrole,<br />\nwhile<br />\n\"He\"<br />\nand<br />\nline<br />\noff<br />\nleft tackle, with the aid<br />\non the different parts of the wings ognized student activity, and an ac- quested that class dues be paid \"She\" will be represented by Webof<br />\ngood<br />\ninterference evaded the<br />\ncan be learned, no matter what po- tivity button will be given all those promptly. He announced also that ster and Hudson, respectively.<br />\nwhole<br />\nMethodist backfield and<br />\ncandidates for the Freshman Desition the pilot takes. The results who try for the team.<br />\n\"Helena's Husband\" will be raced the remaining distance for<br />\nbating<br />\nTeam,<br />\nwhich<br />\nis<br />\nto<br />\nmeet<br />\nthe<br />\nSeveral challenges have been isare prepared for practical purposes<br />\nplayed with Fitzgerald Dunning as the first points of the game. This<br />\nin the form of contour or relief sued by Captain McMurray and Sophomore team, should report to \"Menelaus,- the husband. Hugh<br />\nplay electrified the spectators and<br />\nmaps, which serve as guides to the Manager Parks, and it is expected Professor French. A tentative draft English will appear as \"Helena,\" dispelled any<br />\ndoubt as to the outof<br />\nthe<br />\nclass<br />\nconstitution,<br />\nwritten by<br />\nmanufacturers in strengthening the that a very attractive schedule will<br />\nand the other parts will be taken come of the game.<br />\na<br />\ncommittee<br />\ncomposed<br />\nof Townsend<br />\nparts on which pressure is greatest. be announced shortly.<br />\nby Mortimer playing \"Paris,\" PasIt was immediately after this,<br />\n(chairman),<br />\nBerndt,<br />\nSullivan<br />\nand<br />\nThe important controls, such as the<br />\nsano<br />\nas \"Analitikos,\" and Margo- however, that Western Maryland<br />\nNingard,<br />\nwas<br />\nread<br />\nand<br />\nexplained<br />\nrudder and the elevator, are sub- PRESIDENT GOODNOW TO<br />\nby Townsend. Members of the lin in the part of \"Tsumn.\"<br />\nhad its only real chance to score.<br />\nREVIEW R. 0. T. C.<br />\njected to similar examinations,<br />\nWork on the major production After Coady had kicked offside<br />\nclass were invited to make suggesA'review of the R. 0. T. C. unit<br />\nwith the same result: that is, instrutions before the final writing of the is progressing. The choice now on his own 40-yard line, succesments have been designed to record will be held on next Monday afterconstitution. The meeting then ad- lies between Tarkington's \"Mon- sive penalties against Hopkins for<br />\nthe actions of these parts under noon before President Goodnow<br />\nsieur Beaucaire,\" and \"Beau Brum- a total of 35 yards placed the ball<br />\njourned.<br />\nvarious conditions.<br />\nfel,\" by Clyde Fitch. The nights on the four-yard line. Here the<br />\nand the Military Committee of the<br />\nof March 12 and 13 have been Black and Blue made a great<br />\nThe lecture was accompanied by University. Heretofore, no reHOPKINS MEN AT HARVARD<br />\nchosen for the presentation of the<br />\n\"slides,\" showing the instruments views have been held before the<br />\nThe following Hopkins men are play, and it is thought that rehear- stand. The first play netted one<br />\nthat were explained, and the difyard thru center. Magill and Midspring of the year. However, with enrolled at Harvard University:<br />\nsals will be under way before the dleton smeared the next for a twoferent kinds of charts that give the<br />\nIn the Law School—Carville Christmas holidays.<br />\nresults of the investigations. Pro- the excellent material in the Freshyard loss and two more plays netBenson,<br />\nJr., '20; Joseph Berkofessor Ames, in his conclusion, em- man Class, Major .Garey has deted<br />\nless than two yards. The<br />\nOMISSION IN LIST OF<br />\nPhasized the fact that the knowl- cided upon this rather bold step, witz, '20; Lai Kwang Lon, '20; Eli<br />\nquarter<br />\nended with the ball in<br />\nDEGREES<br />\nedge sought was purely scientific, breaking from the precedent of Frank, Jr., '21.<br />\nHopkins<br />\npossession on her own<br />\nThe<br />\nRegistrar calls attention to<br />\nIn the School of Business AdJust as investigations in the physics previous years.<br />\none-yard<br />\nline.<br />\nan error which crept into the list<br />\nlaboratory. In this case, however, It is understood that the battal- ministration—John Stearns, '20; of degrees granted by the trustees<br />\nAt the beginning of the second<br />\nJesse Halle, '21.<br />\nthe experiments have a direct bearand<br />\npublished<br />\nin<br />\nion will be asked to join the large<br />\na<br />\nrecent<br />\nissue<br />\nof<br />\nquarter<br />\nBonner intercepted a forIn the Medical School—Niel Miling on a commercial enterprise, the parade on December 2nd<br />\nbefore the liken, '21; Benjamin Rones, '22; THE NEWS-LETTER. Quentin D. ward on his 20-yard line. Coady<br />\nmanufacture of aeroplanes.<br />\nArmy-Marine game. As many of Gilson Engel, '22.<br />\nSingewald completed the require- hit left tackle for six yards and<br />\nments for the A. B. degree in June then tore off 22 more thru the<br />\nMiddleton, president of the Ath- the Washington officials will probletic Association, made several an- ably be in Baltimore, it is essential<br />\nlast, but through some inadvert- center of the line and nearly sucnouncements, one of which was that the unit make an excellent<br />\nence his name was omitted from ceeded in breaking away. Losing<br />\n11 DAYS<br />\nthat the Student Council had de- showing. Major Garey, in the event<br />\nthe list of candidates, and his name possession of the ball only once<br />\nBEFORE THE<br />\ncided to close the memorial room that he should accept this invitadid not reach the trustees before the Black and Blue attack netted<br />\nIn Gilman Hall to all except Sen- tion, has imposed the condition that<br />\nCommencement. His diploma bears six first downs and Turnbull<br />\nMARYLAND<br />\niors, members of the Faculty, and either every member of the unit<br />\nthe date of June 13, 1922, and that plunged across the line for the secofficials of the administration. The will participate, or that he will not<br />\nGAME<br />\nfact was brought out in the official ond score, but missed his try for<br />\nlist issued by the Registrar's Office.<br />\ngo into the parade.<br />\nContinued on Page 4, col. 2<br />\nContinued on Page 4, col. 4<br /><br />\nWESTERN MARYLAND<br />\nCRUSHED BY ATTACK<br />\nOF BLACK AND BLUE<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922<br /><br />\n2<br /><br />\nGOUCHER GRADUATE AD- SIFIAFTESBURY ADDRESSES 0. D. K. DISCUSSES CAMPUS<br />\nPROBLEMS<br />\nFIELD CLUB<br />\nDRESSES SOCIAL SCIENCE<br />\nafternoon,<br />\nMr.<br />\nOn<br />\nWednesday<br />\nCLUB<br />\nAt<br />\na<br />\nmeeting<br />\nof the Omicron<br />\nFOUNDED 1897.<br />\nOn Friday afternoon, Miss Shaftesbury addressed the Field Delta Kappa Honorary Fraternity,<br />\n$2.00 Pastenak, a graduate of Goucher Club. He is a graduate student held last Wednesday, the first matSubscription<br />\nCollege and student in the J. H. U.<br />\nhere and was formerly a member ter of discussion was in connection<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Graduate School of Social Science,<br />\nwith the appointment of a commitBaltimore, Md., under Act of Congress, November 3, 1879.<br />\naddressed the Social Science Club of the Department of Agriculture tee on the scholarship of men on<br />\nin Washington, where he worked athletic teams. This committee has<br />\nPublished semi-weekly from October to June by the students of Johns on \"The Dependency of InterHopkins University.<br />\nrelated Families.\" After a brief on bees.<br />\na twofold purpose in view. First,<br />\nMr.<br />\nShaftesbury's<br />\ntalk<br />\nwas<br />\non<br />\nremark<br />\nhistory<br />\nof<br />\nSocial<br />\nit is to' protect the men who are<br />\nBusiness communications Should be addressed to the BUSINESS MAticommunications<br />\nother<br />\nand<br />\nUNIVERSITY;<br />\nall<br />\narticles<br />\non<br />\neconomic<br />\nthe<br />\naspect<br />\nof<br />\nbees.<br />\nHOPKINS<br />\nPastenak<br />\nService,<br />\nMiss<br />\nfew<br />\n.JOHN<br />\nmade<br />\na<br />\ndoing<br />\nAGER,<br />\nextra-curriculum work by<br />\nshould be sent to the MANAGING EDITOR.<br />\nobservations on the comparison of He told of the various methods of watching their marks, warning<br />\nHomewood 100 religions to state control of social raising bees, both for pleasure and them if their marks are low, and<br />\nTelephone<br />\nservice work. However, her main profit. The civilization of the bee securing some one to help men who<br />\npoint was the fact that in her sur- is a fit subject for men to study. are having any particular difficulty<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nvey of the conditions of dependent Their system of castes, division of with any of their courses. SecondGLOVER P. FALLON, '23.<br />\nfamilies in Baltimore, she observed labor, and stringent discipline for ly, the purpose of the Scholarship<br />\nManaging Editor:<br />\n'23.<br />\nHUFFARD,<br />\nJ. HUDSON<br />\nthe large number of related families the good of their society and their Committee is to prevent the variAdvertising Manager:<br />\n'23.<br />\nVANNEMAN,<br />\nthat<br />\nsought social aid. This point future generations reveals a com- ous teams of the University from<br />\nK.<br />\nDONALD<br />\nAssistant Managing Editor:<br />\nbrings up the problem of heredity plex method of living that is of the losing athletes.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nCirculation Manager:<br />\nand environment, and the part they greatest human interest and imporLater in the year this committee<br />\nAssociate Editors:<br />\nPHILIP W. HOWARD, '25.<br />\nplay in social menaces. Miss Pas- tance. Bees are solitary, gregarious intends to watch the marks of all<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nAssistant Business Managers: tenak is now engaged in an inten- or communal and each sort dis- men who are engaged in extra-curBERNARD C. HEARN, '23.<br />\nsive study of this situation and is plays a thoroughly practicable riculum work, rfo matter what that<br />\nJunior Editors:<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nanalyzing the causes that may be method of coping with the various work may be.<br />\nD. MILES MARRIAN, '25.<br />\nT. REESE MARSH, '24.<br />\n'25.<br />\nGIESKE,<br />\nDONALD<br />\nG.<br />\ncontrolled in the matter of the problems which they are called<br />\nThe second problem, which was<br />\nRICHARD C. TILGHMAN, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN W. PARSONS, '25.<br />\nupon to meet. The bee lives main- discussed at the meeting dealt with<br />\nhealth,<br />\nintelligence<br />\nand<br />\ncharacter<br />\nof<br />\n'23<br />\nJR.,<br />\nLEWIS,<br />\nC.<br />\nJOHN<br />\nBENJAMIN T. ROME, '25.<br />\nthese inter-related dependent fam- ly in a world of smell and touch, the amount of courtesy which<br />\nin contrast with the world of sight should be extended to the visiting<br />\nilies.<br />\nand<br />\nsound, to which men are ac- athletic teams.<br />\nAfter the lecture, the members<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nof the club participated in a discus- customed. This increases the difThe Sigma Chi Beta Fraternity<br />\nsion of the question, Miss Pastenak ficulties of dealing with them and supervises the social work which is<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. answering the questions brought interpreting their behavior. Vari- done on the campus, and it was felt<br />\nous stereoptican views were shown by the members of 0. D. K. that the<br />\nup.<br />\nto illustrate the lecture.<br />\nMr. Sigma Chi Beta should take this<br />\nIn<br />\nthe<br />\nnear<br />\nfuture<br />\nthe<br />\nSocial<br />\nBALTIMORE, MD., NOVEMBER 7, 1922<br />\nScience Club, with the assistance of Shaftesbury's talk was highly in- matter of lack of proper courtesy<br />\nDr. Lovejoy, expects to secure some structive as well as intensely inter- in hand and endeavor to make<br />\nJohns Hopkins one of the univerprominent speaker on the subject esting.<br />\nMAKE FOR A PATHLESS CAMPUS<br />\nsities which are noted for the courof<br />\nthe<br />\n\"British<br />\nPolitical System<br />\nThe slogan \"make for a pathless campus,\" adopted by the Stu- Recent Crisis.\" It is expected that<br />\nTAU BETA PI CONSIDERS<br />\nteous manner in which they meet<br />\naccomgood<br />\nThe<br />\nCANDIDATES<br />\none.<br />\nadmirable<br />\nan<br />\nis<br />\nyear,<br />\nthe<br />\nCouncil<br />\nfor<br />\nthe representatives of other colthe club will renew its former poldent<br />\nHonorary<br />\nFraPi<br />\nThe<br />\nTau<br />\nBeta<br />\nleges.<br />\nplished by making such a drive should do much toward adding to the icy of working in conjunction with<br />\nDiscussion was held regarding<br />\nthe Goucher Ethics Club, as for ternity is considering new candibeauty of our grounds.<br />\ndates. The Tau Beta Pi has the signs which mark the' places<br />\nmerl v.<br />\nas members those men in the En- where the new buildings will stand.<br />\nA great deal of money has been spent during the past year upon<br />\nSchool whose scholastic These signs are ill a very dilapigineering<br />\nSOPHOMORES TO ENFORCE<br />\nexternal improvements. The wooden steps leading to the main and<br />\nstanding<br />\nis<br />\nthe highest. There are dated condition and members of the<br />\nREGULATIONS<br />\nwing entrances to Gilman Hall have been replaced by more artistic<br />\neight<br />\nmen<br />\neligible<br />\nto election this 0. D. K. have called the attention<br />\nAt a meeting of the Sophomore<br />\nThe<br />\nfrom<br />\nupon.<br />\nthe<br />\nClass and one of the Faculty to the appearance of<br />\nyear<br />\nSenior<br />\nimproved<br />\nClass last Friday, President Klein<br />\nsubstitutes. The entire main entrance has been<br />\nmay<br />\nbe<br />\nduring these unsightly objects on the<br />\nwho<br />\nelected<br />\nJunior,<br />\nbrought up the question of the<br />\nremainder of the grounds has been beautified by the addition of sevJunior<br />\nterm.<br />\nThe<br />\none<br />\nis campus.<br />\nSophomore \"Pep Committee.\" He the first<br />\neral thousand dollars' worth of shrubbery. Much attention has been explained that the work of enforc- that student whose average has been<br />\ngiven the lawns between the buildings and where there is a tendency ing regulations has been left too the highest in his class for his first<br />\nPAGE MR. DARWIN<br />\nmuch to the committee, and that it two years at college. At the secto trespass fences have ben ereected.<br />\nas I chanced to pass,<br />\nOne<br />\nday,<br />\nis the duty of every sophomore to ond half of the junior year oneHowver, a number of boosters of the \"straight line\" theory have- see that the freshmen do not stray eighth of the class is eligible, and<br />\nA beaver was damning a river<br />\npersisted in taking the -shortest distance between two points.\" re- from the straight and narrow path. at the beginning of the Senior year And a man who had run out of gas<br />\nPlans for the coming sophomore one-fourth is eligible.<br />\nWas doing the same to his flivgardless of its effect upon the grass. Consequently, unsightly cowScholarship is the main considersmoker were discussed, and the<br />\nv er.<br />\npaths have put in their appearance, notably, from the Y. M. C. A. President announced the program ation for admittance, although<br />\n—Phoenix<br />\noffice to the drive, from the C. E. Hall, around the end of the tennis of entertainment which will be giv- character and personality are essential to election. As a rule, twoen by members of the class.<br />\ncourts, and between the engineering buildings. ?<br />\nof those eligible are admitthirds<br />\nPage O'Connor, representative<br />\nHopkins grounds can compare in beauty with those of any col- on the Student Council from the ted. At the present time the fralege in the country, large or small. It is gratifying to see the Student Sophomore Class, spoke on class ternity has only five active members: Warfield, Shaefer, Grace,<br />\nCouncil give their support to preserve and improve upon the attrac- and school spirit. He urged every<br />\nsophomore to be present in the Wilen and Vogel, while Professor<br />\ntiveness of our campus.<br />\nChristie and Dean Whitehead are<br />\nrooting section at all games.<br />\nPresident Klein announced that honorary members.<br />\nThe initiation of the new men<br />\na Freshman-Sophomore debate will<br />\nbe held about the first of January. will take place some time in the FOREVERY DEGREE<br />\nANOTHER NEED<br />\nThe subject of the debate will be near future, and will be followed<br />\nof Lead<br />\n\"Freshman<br />\nRegulations.\" Organi- by a banquet at the Hopkins Club.<br />\nNow that winter is approaching, it seems the proper time to call<br />\nzation of several Sophomore basto the attention of the University authorities, a matter which has long<br />\nketball teams for inter- and intra- VEDENIAPINSKY TO PLAY ON<br />\nneeded a remedy, that is, the inadequate facilities for handling the class competition<br />\nC. E. BASKETBALL TEAM<br />\nwas begun.<br />\nThe C. E. Juniors have organized<br />\ntraffic that must use the roads about the campus.<br />\na basketball team. For sometime A serviceable,<br />\nGOLF TEAM<br />\nIt is difficult enough for the pedestrian to keep out of the way<br />\nsimplified<br />\nGreat<br />\nexcitement<br />\ncaused<br />\nthe<br />\nwas<br />\nthis group has been practicing in writing tool that holds<br />\nthere<br />\nwhen<br />\nof the automobiles in fair weather, but during the winter<br />\nother day by a bulletin which read the afternoons on the court to the the style of lead most<br />\nis a heavy snow upon the ground the problem is a real one. The \"Organization<br />\nof an African Golf south of C. E. Hall. The squad suitable for your particroad leading from the Thirty-second Street entrance to the Postoffice Team.\" After the tumult and fur- consists of: Forwards, Cochran, ularcollege work.Seven<br />\ndifferent grades availis a very narrow one; so narrow that two machines can barely pass. -.)re. which the notice caused, had Crout, Wysong and St. Claire; able.<br />\nIn the wintertime the students are frequently forced into the deep subsided, it was learned that the Centre: Martin, Michael and Ved- Made economically<br />\nby<br />\nDorsey mass production methformation of a -real golf team was eniapinsky ;<br />\nGuards:<br />\nsnow to avoid being struck.<br />\nTo- ods and sold at prices<br />\nIt seems a perfectly logical time to clear at least a temporary in the offing. At a meeting last (Capt.), Moehle, Watson and<br />\nvarious classes, which make wood penWednesday<br />\nof<br />\ncandidates,<br />\nGames<br />\nwith<br />\nthere<br />\nveil.<br />\nroad from the rear of the powerhouse, around the south end of the<br />\nwas naturally a great deal of dis- sections and organizations on the cils a luxury.<br />\nengineering buildings to the road leading down to the Civil Engi- cussion, but nothing was done. Be- campus are wanted.. For particu- TheSTUBBY—shown<br />\nhere—of Rolled Silver<br />\nneering Hall basement. A road will have to be constructed there sides several renowned golfers in lars see F. L. Moehle, Box 410.<br />\nwith ring for watch<br />\nnow\"?<br />\nnot<br />\n\"why<br />\neventually, so<br />\nthe Medical School to build a team<br />\nchain costs $1.00.<br />\nCROSS-COUNTRY<br />\nSuch a temporary road would leave the concrete walk safe for around, it has been learned that<br />\nSee this and other<br />\nin<br />\nthere<br />\nare<br />\nsome<br />\neminent<br />\ngolfers<br />\nThe<br />\nCross<br />\nCountry team, which Ingersoll models at your<br />\ngive<br />\nstill<br />\naccess<br />\nto<br />\nGilman<br />\nHall<br />\nand<br />\npedestrian students and would<br />\nthe undergraduate department who was reported disbanded last Satur- stationery or cooperathe various parking spaces.<br />\nare \"hiding their light under a day, has organized again, as an- tive store.<br />\nIt will, further, be a great aid in the \"make for a pathless cam- bushel.\" With great pride we re- nounced by Manager Shriven. The<br />\nIngersoll Redlpoint Co.,Inc.<br />\nWm. H.Ingersoll,Pres.<br />\npus\" campaign.<br />\nfer,to Johnny Sherwood, Ed Stro- team has resumed practicing under 461 Fourth Ave.,New York City<br />\nbel, Jack Croker and George Doub. the watchful eye of Captain Booth. 111111111111111111111111111111111111M1111111111111111111M<br />\nHow about it, Mr. Authority?<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\nIngersoll<br /><br />\nis<br /><br />\nDll<br /><br />\nttDn<br />\nit-<br /><br />\nas<br />\nst,<br />\nre<br />\nD<br />\nig<br />\nid<br /><br />\nty<br />\nclip<br />\n•i-<br /><br />\nL11<br />\nrat<br /><br />\n:h<br />\n:h<br /><br />\nLg<br /><br />\nis<br /><br />\n!S<br /><br />\n1.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922.<br /><br />\n3<br /><br />\nAND THREE TIMES<br />\nFREEDOM<br />\nAND<br />\nDEMOCTo the Editor of<br />\nRACY.<br />\nTIIE NEWS-LETTER:<br />\nWhy not give \"the infidel 43\" a<br />\nA Column in Which the Correspondents<br />\nSir:<br />\nhelping hand, Mr. Wilen, and radiAre Allowed Latitude, But Shoulder the Responsibility.<br />\nIn THE NEWS-LETTER'S Mailate to them a little of the sunshine<br />\nAll letters intended for publication of your convictions ?- Do a little bag of October 31 Frank Wilen,<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side missionary work with these belated the professed exponent of \"endurWARNER Si, COMPANY<br />\nonly.<br />\nNo attention will be paid to anony- \"clods\"(?) of \"diminuitive com- ing Faith,\" ridicules and apparentan<br />\nas<br />\nsigned<br />\nmous letters, but names<br />\nHATTERS<br />\nevidence of good faith will not be prehension.\" Shame on you for ly condemns an \"infidel clique\" of<br />\nprinted if request is made that they be<br />\n222<br />\nW.<br />\nBALTIMORE ST.<br />\nmocking and scoffing at them! \"no less than 43 unbelievers\" which<br />\nomitted.<br />\nnot<br />\nto<br />\nletter<br />\nis<br />\na<br />\npublication<br />\nof<br />\nThe<br />\nour Alma Mater harbors. These<br />\nbe taken as an indorsement of its views Shame.again for even nursing in<br />\nthe your heart a desire to maim and same \"unbelievers\" he ruthlessly<br />\nby the \"News-Letter,\" which invites<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n\"brand them\" for their infirmities stamps as \"clods\"—persons of \"diminutive comprehension\"—persons<br />\n(?)<br />\nof belief.<br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nBACK AT YOU W1LEN,<br />\n\"clamoring<br />\nwith vulgar obstinacy<br />\nask<br />\nyou<br />\nin<br />\nall<br />\nI<br />\nfrankness, Mr.<br />\nONCE—<br />\nNovember 2, 1922.<br />\nWilen, do you think your present for facts, evidence, and reasons and<br />\nsensible style of the business world.<br />\nTo the Editor of<br />\nattitude and policy could ever ad- other such irrelevant nonsense!\"<br />\nStein-Bloch and Goodman &amp; Suss Clothes, tailored<br />\nTHE NEWS-LETTER:<br />\nvance Hopkins to a better spirit of (sic.)<br />\nin Rochester, exemplify that idea so well.<br />\nAs far as I am able to deduce,<br />\nThe letter of Mr. Wilen, appear- good fellowship, good sportsmanExclusively at—<br />\ning in THE NEWS-LETTER Of Octo- ship, good scholarship, or good these unfounded declarations, buried<br />\ncontains<br />\na<br />\nbeneath a maze of rhetorical<br />\nber 31, 1922,<br />\nnumber of anything?<br />\ngrandiloquence, are the result of<br />\nstatements which do not seem to me<br />\nFaithfully yours,<br />\na violently prejudiced and intolerto be conclusive to the spirit of felEVERETT C. MYERS,<br />\nlowship and fair-- -play for which<br />\nGraduate Student ant mind. If Frank Wilen consid(Y. M. B. 0. D.)<br />\ners Science as an \"upstart monster\"<br />\nHopkins has always stood. You<br />\nTWICE—<br />\nthen he is, indeed, grossly illusionspeak of Hopkins as \"harboring 43<br />\nBaltimore &amp; Hanover<br />\nBaltimore, Md., ed.and<br />\ndeserves to be pitied. It is<br />\nunbelievers,\" and continue to be•<br />\nOctober 31, 1922.<br />\nas futile to oppose scientific analylabor these unfortunate(?) creaTo the Editor of<br />\nsis in the research after Truth as<br />\ntures by stating:<br />\nTHE NEWS-LETTER:<br />\nit is to oppose an earthquake.<br />\nWe who _have arrived . at the<br />\nIn a letter to THE NEWS-LETTER<br />\nFrank Wilen may have his fixed<br />\nGreat Understanding, who have<br />\nof October 31 one of our brightest and bigoted<br />\nopinion concerning<br />\npassed through the supreme portals<br />\nfellow-students condemns the \"43<br />\nScience and Religion, but why<br />\nof Faith, \\\\=hich is the- only true enunbelievers\" among us. He seems should<br />\nhe be so narrow-minded as<br />\nlightenment, and who have rightto be filled with the mediaeval spirto<br />\nattempt<br />\nto impose his fixed opineously spurned -that upstart monit, the spirit which passively ac- ion upon a<br />\nmore progressive few!<br />\nster, science,—must cleanse our<br />\ncepts the inheritance of the past<br />\nIs such the true aim of a college<br />\nsacred institution of this infidel<br />\nwithout questioning it or reconcileducation? Alas! How long wilt<br />\nclique,\" etc., etc.<br />\ning it with reason. Such a spirit<br />\nthou abuse with our patience, 0<br />\nWhat do you mean by all this?<br />\nemphasizes believing rather than<br />\nIntolerance?<br />\nWhat right have you to scoff at<br />\nliving. Such a spirit is intolerant<br />\nYours for greater tolerance<br />\nthese men of personal creed in the<br />\nand defies progress.<br />\nway you do, even if they are UnC. P. HEINLEIN, '23.<br />\nThe mediaeval spirit has no sense<br />\nJ. H. U., November 1, 1922.<br />\nbelievers?<br />\nof proportion; it haggles over imYou seem to have overlooked the possible questions of dogma, and<br />\nTRACK TEAM ENGAGES IN<br />\nfact that Hopkins is not a \"sacred\" neglects the essentials of relig:on.<br />\nPRELIMINARY WORK<br />\ninstitution, but an institution of Which is more essential, to believe<br />\nAt present the track team is delearning with equal rights and priv- hi the Divine inspiration of the<br />\nvoting most of its time to prelimileges for all!<br />\nBible or to follow the ideals of Ey- inary training. The newcomers are<br />\nAre you not making a serious ing which the Bible presents? And<br />\nbeing broken in, and, at the same<br />\nerror when you associate Science does the Bible contain the only true<br />\ntime, are getting ideas of just what<br />\nand Faith (or Religion) together, ideals in the world? Cannot an inthey want to do. General practice<br />\nand make one a force that is in any dividual follow high ideals secured<br />\nfor both indoor and outdoor work<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\nway antagonistic to the other? from another source? And finally,<br />\nis being held on Tuesdays and FriScience deals only with the Phe- is not religion to be judged by its<br />\ndays, at four o'clock in the after nomena of Matter; Religion deals actual value in individual and sonoon.<br />\nwith the Soul, which transcends cial experience, instead of from a<br />\nINSTRUCTION<br />\nWithin the next week practice in<br />\nmatter. There can be no quarrel narrow dogmatic viewpoint? If so,<br />\nhigh jumping and hurdling will be GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master or<br />\nbetween them! The ultimate goal the religion of the \"43 unbelievers\"<br />\nArts; Doctor of Philsophy.<br />\nstarted, and the board track will be<br />\nand purpose of all scientific research should not be condemned so confiMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nlaid in the near future in order to<br />\nis to lighten the burdens of Man, dently.<br />\nget the men accustomed to running COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nand to produce as nearly a perfect<br />\nSincerely,<br />\non indoor tracks. The whole team DEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Masmaterial happiness as possible. Why,<br />\nJ. L. H.<br />\nis working to put the Hopkins meet<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nthen, should you label Science as<br />\nChemistry.<br />\nwith<br />\na<br />\nacross<br />\nbang<br />\nthis<br />\nyear.<br />\nENTIRELY ABSENT<br />\nan \"upstart monster\"?<br />\nSCHOOL<br />\nOF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubThe professor was engaged in<br />\nNO DREAM<br />\nReligion, or Faith, on the other<br />\nlic<br />\nHealth;<br />\nDoctor of Science and Bachelor of Science in Hygiene; Certifia knotty problem when his study<br />\n\"I had an awful nightmare last<br />\nhand, depends upon the belief in<br />\ncate in Public Health.<br />\ndoor was opened by a servant<br />\nnight.\"<br />\nMan that he has a something called<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nwho announced:<br />\n\"Yes, I saw you with her.\"—<br />\na Soul, which transcends matter,<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\n\"A little stranger has arrived,<br />\nPhoenix.<br />\nand which will live on after his<br />\nArts or of Science.<br />\nsir.\"<br />\nphysical body has ceased to exist<br />\nSCHOOL OF BUSINESS ECONOMICS.<br />\n\"Eh?\"<br />\nThe Height of Laziness<br />\nas an organized, living, entity on<br />\n• Breaking a cigarette in half so COURSES IN SOCIAL ECONOMICS.<br />\n\"It's a little boy.\"<br />\nthis earth. Would it not seem a<br />\n\"Little boy? Well, ask him you won't have to draw the EVENING COURSES in Business Economics and for Technical Workers.<br />\nmore wholesome attitude to regard<br />\nwhat he wants.\"—Wampus.<br />\nsmoke so far.—Purple Parrot.<br />\nScience and Religion as Complements—two distinct things, both<br />\ngood in themselves, both of which<br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br />\nwe need?<br />\nWhen you \"spurn\" Science as<br />\nBUILDINGS<br />\nan \"upstart monster,\" and would<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nunmercifully brand those who are<br />\nnot so fortunate as you to \"have arMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nrived at the Great Understanding,\"<br />\nas you claim to have done, you are<br />\nCIVIL ENGINEERING—housing also Geology.<br />\nnot only picking an unjust quarrel,<br />\nPOWER HOUSE.<br />\nbut are also meddling with the<br />\nOf heavy Scotch Grain Leather; black or<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nrights and privileges which are<br />\nGarden.<br />\ntan; equipped with rubber heel: a colgranted by the Constitution of the<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nUnited States—to you, and to me.<br />\nlege shoe designed for real college men.<br />\nPHYSIOLOGICAL BUILDING.<br />\nand to everybody! WAKE UP!<br />\nANATOMICAL LABORATORY.<br />\nWe are living in a new era! This<br />\nHUNTERIAN LABORATORIES.<br />\nis 1922! We are not governed by<br />\nthe same statutes (as you infer)<br />\nPATHOLOGICAL LABORATORY.<br />\nwhich Lord Baltimore and his predSCHOOL OF HYGIENE.<br />\necessors were empowered to enCARROLL MANSION—Johns Hopkins Club.<br />\nAT CHARLES STREET<br />\nforce, but rather we are living in<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n216 NORTH<br />\nan age of charity and leniency—and<br />\nALUMNI MEMORIAL DORMITORY.<br />\nmost important of all, WE ARE<br />\nLIVING IN A COUNTRY OF<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n.50<br />\n4up<br />\nG<br /><br />\nY-yegrw4-<br /><br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER BFOTNEM<br /><br />\nThe Johns Hopkins University<br /><br />\nA Hopkins<br />\nBrogue $8<br /><br />\nSlesingers<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 7, 1922.<br /><br />\n4<br /><br />\nTHE PASSING OF TRADINOTICE<br />\nTIONS<br />\nmen realize what<br />\nProbably<br />\nfew<br />\n(THE BOOK MART)<br />\na great change has been made in<br />\nBLUE JAY<br />\nHopkins traditions by the removComplete Stock of<br />\nANNOUNCEMENT<br />\nMedical Books and College<br />\nal of the university to Homewood<br />\nThe Black and Blue Jay<br />\nRequisites<br />\nBusiness Staff wishes to anfrom the old site on Druid Hill<br />\nnounce that, owing to a printavenue. Gone is our old alley<br />\nImporters and Dealers in Fine Books<br />\ner's error, the Jay failed to<br />\ncampus, the narrow block of Garinclude the name of S. Ath301 N. CHARLES ST.<br />\nden street between Druid Hill<br />\nerton Middleton, '23, in the<br />\nBaltimore, Md.<br />\navenue and Monument street.<br />\nlist of Assistant Business<br />\n:<br />\nManagers, and to anototanc,<br />\nHere the \"Charles Street CowLeoJoseph<br />\nelection<br />\nof<br />\nthe<br />\nlounged<br />\non<br />\nboys\" of bygone days,<br />\npold, '24, as Assistant Busipacking boxes in the short strip<br />\nMANUFACTURING JEWELERS<br />\nness Manager.<br />\nLancaster, Pa.<br />\nof sunlight that fell between the<br />\nClass Rings, Pins, Fraternity Pins,<br />\nwalls of McCoy Hall and the late<br />\nLost, a ladies' gold bar<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes lamented cage. From nine in the<br />\npin. If found, please return<br />\n\"Makers of the Varsity Seals\"<br />\nto registrar's office.<br />\nmorning until two-thirty in the<br />\nafternoon the ancient and honorSHIRT MAKER<br />\nSTRATTON<br />\nable sport of pitching dimes was ATTRACTIVE PROGRAM AR226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00 the only pastime. Shortly after<br />\nDress Shirts<br />\nRANGED FOR SOPH SMOKER<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25 lunch the scene of activity shifted<br />\nImported Madras<br />\nAt a special meeting of the SophTerms Cash, Less 10% 30 Days on to the first floor of Levering Hall,<br />\nClass, held on Friday, Noomore<br />\nShirts<br />\nthe Student Y. M. C. A. Building,<br />\nAlso a Full Line of Men's<br />\nvember 3, 1922, plans for the class<br />\nFurnishings<br />\nlocated on the corner of Eutaw<br />\nsmoker, to be held at the St. George<br />\nstreet and Druid Hill avenue. ArHotel on Friday, November .10.<br />\nrayed in chairs, with feet lined<br />\nFine Clothes<br />\n1922, were fully discussed.<br />\nalong the window sill the HopA suit by Lemmert gives the final<br />\nA very attractive program has<br />\ntouch to the lasting satisfaction you kins men watched the girls of<br />\nbeen arranged. Several members<br />\nderive from thoroly dependable<br />\nWestern High School pass in recloths cut in authentic fashion—<br />\nof the class will furnish amusewear<br />\nor<br />\nmore<br />\nview.<br />\nwhether for every-day<br />\nment and a snappy jazz orchestra,<br />\nfestive occasions.<br />\nAlumni of the day of Governor<br />\ncomposed of members of the class,<br />\nRitchie will remember the \"Pot<br />\nat<br />\nLEM MERT<br />\nwill furnish music for the evening.<br />\nSocials\" held in the old locker<br />\nSeveral distinguished guests will<br />\n19 Fayette Street, East<br />\nroom on the ground floor of the<br />\nbe<br />\non hand. Dr. Gilpen, honorary<br />\nBusiness Suits<br />\nDress Clothes gym. This small room, formerly a<br />\npresident<br />\nof the class, will attend.<br />\nSport Togs<br />\nOvercoats<br />\nkitchen, was the gathering place<br />\nTom Landy, captain of the footof Sophomores. At almost any<br />\nball team, will award numerals to<br />\nNECKWEAR time of day a Freshman might be the Sophomores who won them last<br />\nSHIRTS<br />\nseen making a hasty and ingloriyear. 0. D. Collins, president of<br />\nous exit to the accompaniment of<br />\nOmicron Delta Kappa, will speak<br />\nhoots and jeers from the \"pep<br />\n421 N. HOWARD ST.<br />\non the spirit of 0. D. K.<br />\ncommittee\" whose session he had<br />\nDon Reese, chairman of the comHOSIERY<br />\nGLOVES<br />\ninterrupted.<br />\nmittee, while in a philanthropic<br />\nPlaces in the McCoy Hall ele•<br />\nframe of mind, agreed to furnish a<br />\nvator<br />\nwere strictly in order of seEstablished 1873<br />\nbarrel of cider for the smoker. This<br />\nniority. Freshmen were not alA.H.Fetting Man'fg Jewelry Co. lowed upon it at all and few seems to have had a stimulating<br />\neffect and subscriptions have inManufacturers<br />\nSophomores and Juniors were<br />\ncreased<br />\ntremendously. The joke is<br />\nGreek Letter Fraternity Jewelry<br />\nable to resist ejectment if they<br />\nthat<br />\nit<br />\nis<br />\nsweet cider.<br />\n213 N. LIBERTY ST., Baltimore, Md. were fortunate enough to get on<br />\nboard during the ten-minute interCHRISTIAN SERVICE CLUB<br />\nvals between periods.<br />\nThe Christian Service Club,<br />\nThe present year saw the passfounded two years ago by the Y.<br />\ning of one tradition. The Student<br />\nM. C. A., but now an independent<br />\nCouncil called off the usual fight<br />\norganization, held its second meetbetween the Freshman and Sophing of the year last Monday night.<br />\nomore classes after the Y. M. C.<br />\nMr. W. R. Barnhardt was elected<br />\nA. reception which in the old days<br />\npresident to fill the vacancy made<br />\nClibeXatterie)<br />\nwas held around the fountains in<br />\n`34M Zs H.&amp; OSCAR G.1-01Y<br />\nby Mr. Custer Cromwell, who has<br />\nMt. Vernon Place and in recent<br />\nOWN ERS<br />\nleft the University. Dr. Daugheryears around the pond in front of<br />\nZ.E*1. 0e4Wel°<br />\nty, of Goucher College, was the<br />\nthe<br />\nBarn.<br />\n29 Baltimore St., East<br />\nspeaker<br />\nof the evening. His genOne Door West of Light St.<br />\nNor does the Senior class on the<br />\neral<br />\nsubject<br />\nwas \"The Bible.\" Dr.<br />\nSOLE AGENTS FOR BALTIMORE last day parade through the buildDaugherty spoke with great effect.<br />\nFor College Fraternity Bands<br />\nings to the accompaniment of its<br />\n(Greek Letter Societies)<br />\nFive new members were admitted<br />\nSwan Song,\"We Won't Be Here<br />\nat this meeting,—McFaul, Hunter,<br />\nAny More.\"<br />\nDoc Adams followed us to Long, Harp and \\Verner.<br />\nThe Christian Service Club meets<br />\nHomewood, but Fritz's Cafe has<br />\nPrinters of Philological and<br />\nevery<br />\nother Monday evening. The<br />\nno connotations to the present<br />\nScientific Works<br />\nprograms<br />\nalternate between genergeneration of Hopkins men. Sic<br />\nal<br />\ndiscussions<br />\n23 S. HANOVER ST.<br />\nand<br />\ninformal<br />\ntransit gloria mundi.<br />\nBaltimore, Md.<br />\nspeeches. At the meeting in which<br />\nLOUISIANA FOOTBALL TEAM general discussions are held a series<br />\nWEAR BEARDS<br />\nis being conducted on the leading<br />\nMembers of the Louisiana State religions of the world. At the meetSARATOGA AT<br />\nLIBERTY STS. LIniversity football team have ap- ing on November 13. to be held at<br />\npeared on the field for the last few the home of Mr. W. F. Wheeler.<br />\nLUNCHEON<br />\ndays with a heavy growth of beard, the subject will be \"Judaism.- Mr.<br />\nTEA<br />\nin accordance with the written Wheeler will lead the discussion<br />\nDINNER<br />\npromise signed by all varsity mem- himself. The next discussion will<br />\nSPECIAL PARTIES bers not to shave until they won a<br />\nbe on Confucianism. The Christian<br />\ngame.<br />\n11.30 A. M.<br />\nService Club issues a cordial inviuntil<br />\nMade desperate by their ill suc- tation to all to attend any of it<br />\nPLAZA 6987 cess,<br />\n7.30 P. M.<br />\nthey are determined to make meetings. Information concerning<br />\nthe fight of their lives in order to the club may be obtained from Win<br />\nobtain a shave.---Baltimore News. C. Roberts, secretary.<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br /><br />\ng6tanbarb Punk To_<br /><br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br /><br />\nJ. F. Apple Co.<br /><br />\nBANK WITH<br /><br />\nSecurity Storage &amp; Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, rresicient<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD,KOHN 8c Co.<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at anytime.<br />\nlj Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nLefranc &amp; Ault<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nMt. Vernon 4999<br /><br />\nW.L. Mann<br /><br />\nPROFESSOR AMES LECTURES ON<br />\n•<br />\nAERONAUTICS AT THURSDAY<br />\nASSEMBLY<br />\nContinued from page I<br /><br />\ndecision will be acted upon by the<br />\nFaculty. Collins asked that stuCommercial Photography<br />\ndents<br />\nsubscribe to the Black and<br />\nCircuit Photography<br />\nBlue<br />\nJay<br />\nfor their friends. VanneViews<br />\nFlash Lights<br />\nman,<br />\nafter again requesting sugEnlargements<br />\nGroups<br />\ngestions for the celebrations on the<br />\nKODAK FINISHING<br />\ndays of our big games, led a few<br />\n325 N. Howard St.<br />\nsongs and yells.<br /><br />\nBLACK AND BLUE DEFEATS<br />\nWESTERN MARYLAND<br />\nContinued from. page 1<br /><br />\npoint. For the rest of the half<br />\nHopkins took things easy and the<br />\nball was in midfield when the period ended.<br />\nTaking the ball in the second<br />\nhalf on the kickoff, Van Orman's<br />\ncharges did not stop until Doug<br />\nTurnbull tossed a forward across<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nColder Weather Does Not<br />\nAffect the Superior Quality of<br /><br />\n1,<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nMore Power and More Miles to<br />\nEvery Gallon of This Wonder Motor Fuel<br /><br />\nI<br /><br />\nManufactured &amp; Guaranteed by<br />\nSHERWOOD BROTHERS, lac.<br /><br />\nthe line .to Buck Bonner. This<br />\ntime Doug added the extra point.<br />\nA few minutes later a penalty<br />\nmade a first down for Hopkins impossible and Bonner called for a<br />\ndropkick. Coady-, standing on the<br />\n30-yard line, sent the pigskin<br />\nsquarely between the bars. At<br />\nthis stage Van Orman started to<br />\ntry out his subs for the first time<br />\nthis year. Maxwell went in for<br />\nCoady, Gilliece for Rich, Murphy<br />\nfor Magill and Rob Middleton<br />\ntook Taylor's place.<br />\n•• The. 'fourth touchdown came<br />\nafter a 20-yard pass, Bonner to<br />\nTaylor, had placed the ball on<br />\nthe six-yard line. Maxwell carried<br />\nit over. in two tries. Turnbull<br />\nmade the final score when he intercepted a forwar dand raced 60<br />\nyards to the goal line. Toward the<br />\nend of the game Murphy made a<br />\nhe<br />\nwhen<br />\nspectacular tackle<br />\ndowned Grimm in his tracks on<br />\nthe 35-yard line after the latter<br />\nhad received a long punt. The<br />\ngame ended soon after this with<br />\nthe ball in Hopkins' possession.<br />\nThe lineup :<br /><br />\nURN ER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nScore by Periods<br />\n6<br />\n10 13-35<br />\nMaryland ...0 06 0 0.-- 0<br />\nTouchdowns—Taylor, Bonner, Turnbull (2), Maxwell. Points—Turnbull<br />\n(2) by dropkick. Field goal—Cotdy.<br />\nSubstitutions: Hopkins — Maxwell for<br />\nCoady, Gilliece for Rich, Murphy for<br />\nMagill, R. Middleton for Taylor. Western Maryland—Clayton for Robey,<br />\nLong for Davis, Robey for Clayton.<br />\nReferee—Thomas, Syracuse. Umpire—<br />\nClinton, Lafayette. Head linesman—<br />\n(0) West. Maryland Bailey, Syracuse.<br />\nHopkins (35)<br />\nL E<br />\nDuncan<br />\nMiddleton<br />\nDouglas<br />\nMagill<br />\nWilliams<br />\nSlowick<br />\nRobey STUDENT COUNCIL NOTICE<br />\nCromwell<br />\nHofer<br />\nCouncill<br />\nThe work in the Gilman MeLandy (c).....R.T...... Flannagan<br />\nGroton morial Room has just been comR E<br />\nRich<br />\nGrimm<br />\nQ B<br />\nBonner<br />\nKinsey pleted. This room is open to SenL H<br />\nTaylor<br />\nDavis<br />\n.R H<br />\nCoady<br />\nStanley iors only.<br />\nF B<br />\nTurnbull<br />\nWesternop kins<br /><br />"}], "field_media_file": [{"target_id": 37669, "display": null, "description": null, "target_type": "file", "target_uuid": "08981fe0-166d-4bdc-8937-1d2f8be12717", "url": "http://digital.library.jhu.edu/system/files/2022-03/13025-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13025, "target_type": "node", "target_uuid": "f2688303-aa8a-43dd-84f5-ff7f7573e1cc", "url": "/node/13025"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2cbd3d3f-c584-4366-8bdd-f6d939f58f96"}]}