{"mid": [{"value": 40319}], "uuid": [{"value": "fa4d3583-63e6-4dbd-aa13-8491d9964b05"}], "vid": [{"value": 40319}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:03:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14353-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:03:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:03:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "#40<br />\n<br />\n•<br />\n<br />\nNEWS-LETTER<br />\n<br />\n•<br />\n<br />\nvol. lxxxi. no. 16/tuesdav, aril 19.1977/baltrinore.,marvland/81st year<br />\n-<br />\n<br />\n\"Fly me to the Moon\"<br />\n--Professor Wayman Scott<br />\nBy MARK SHUSTED<br />\nProfessor Wayman Scott, an accomplished member of<br />\nboth the Hopkins' faculty and the Baltimore City School<br />\nBoard, is one of the-most well-known and popular men on<br />\ncampus.<br />\n.The first black appointed to Hopkins' faculty,<br />\nProfessor Scott holds a doctorate in fluid dynamics and is<br />\na part-time professor in the department of Earth and<br />\nPlanetary Sciences. Furthermore, the professor, who is<br />\n51, has recently started his second term on the 13altimor<br />\nCity Board of Education.<br />\nBorn ,and raised in Oberlin, Ohio, Dr. Scott went to<br />\nOberlin College and received his Ph.D. at Hopkins: \"Like<br />\nmost blacks, I viewed education as a means to an end, the<br />\nend being getting a job -- so I figured if I could major in<br />\nthe most difficult course in the curriculum I could get a<br />\njob. The most difficult course was physics, so I majored in<br />\nphysics in college and got a Master's degree in it, and for<br />\nme the most difficult part of physics was fluid dynamics,<br />\nso I got a Ph. D. in that.\"<br />\nBefore arriving at Johns Hopkins, Professor Scott<br />\ntaught at several state colleges and, as a result, his opinion<br />\nof the students here is high: \"I've spent a lot of time<br />\nteaching in state institutions, schools where if you<br />\ngraduated from high school you could get admitted. I've<br />\nhad students in the college classes who couldn't read or<br />\nwrite; so I am tremendously impressed with the Hopkins'<br />\nstudents, maybe too impressed, because of my having<br />\ntaught so much in the other schools. The students here<br />\nare outstanding.\"<br />\nMany of the non science-oriented students here are<br />\nfamiliar with Dr. Scott through his teaching of the<br />\nintroductory ..course, Astronomy and the Solar System.<br />\n(Commonly called Astrogut.) According to the Professor,<br />\nhis interest in astronomy was not accidental, but instead<br />\nresulted from his previous work in fluid dynamics: \"The<br />\ncore of the earth and some of the other planets is fluid,<br />\nand it is those fluid dynamical processes that give rise, so<br />\nthe theory says, to the magnetic fields of the earth and<br />\nthe planets. So I had a chance to apply my knowledge of<br />\nfluid dynamics to an astronomical problem, and thus I<br />\nbecame interested in astronomy.\"<br />\n<br />\nHowever, because Dr. Scott employs a flamboyant<br />\nlecture style and is prone to the unearthing of<br />\nlittle-known iaformation, wary students often question<br />\nthe factual basis of the lectures. To these complaints the<br />\nProfessor replies: \"I have read, I think, every astronomy<br />\ntext in existence, and with that kind of background it is<br />\nwry easy to prepare the kind of lectures that I do.\"<br />\n<br />\nProfessor Scott finds satisfaction in helping to formulate<br />\nthe policies of the Baltimoe City School Board, a body to<br />\nwhich he was recently renominated. by Mayor Schaefer.<br />\nThe Board, however, far from ensuring that the public<br />\nschools are as good as they can be, has had difficulties<br />\nmaintaining high standards of excellence in education in<br />\n<br />\nrecent years.<br />\n\"No, the schools are not as good as they should be, but<br />\nthis Board is going to make them better,\" declared Dr.<br />\nScott. \"I think that I helped change the Board's thinking<br />\n.-- that we should return to the basics in education. Let's<br />\nemphasize the fact that the youngsters must learn to read<br />\nand write -- that wasn't the emphasis four or five years<br />\nago.\"<br />\nDr. Scott's concern for education is by no means<br />\nlimited to the Board, for he has been active in attempts to<br />\nexpand and diversify the educational opportunities at<br />\nHopkins. Despite these efforts, he still feels that many of<br />\nthe students do not ta c advantage of the widening<br />\ncurriculum.<br />\n\"I am somewhat concerned with the tendency of the<br />\nstudents to specialize, hut that may be necessary. I do<br />\nthink the students could be a little more well-rounded<br />\nthan they are, but that's going to require more time, and<br />\nthe time is not available.<br />\n\"I did agree sonic years ago with the student<br />\ncontention that the undergraduate program As not-as<br />\nbroad as it should have been, but there's been a lot of<br />\nimprovement in that area and maybe we can see some<br />\nmore. That is, there weren't enough courses being offered,<br />\non the undergraduate level. There are more now, but I am<br />\nnot-quite sure if there are enough.\"<br />\nOf course, Professor Scott realizes that mere expansion<br />\nof the undergraduate curriculum will not guarantee<br />\nwell-rounded students, and that .the ultimate aim of the<br />\nbulk of the students to reach graduate schools limits the<br />\nvariety of courses one can take. \"I think the solution is<br />\ngoing to lie with the medical schools and the graduate<br />\nschools, and as long as spaces are limited, you're going to<br />\nhave to have this kind of competition.\"<br />\nAlthough these conditions may be harmful in some<br />\nrespects, Professor Scott feels that, overall, receiving one's<br />\neducation at Hopkins is a worthwhile experience. \"I think<br />\nwe are producing well-educated graduates. I believe the<br />\ngraduate here knows something when he le;ivcs. The goal<br />\nof Hopkins is what it has always been, and that is to make<br />\na contribution to society -- Hopkins has done that and iF<br />\ncontinuing to do that.\"<br />\n<br />\nINSIDE THIS ISSUE<br />\nAdministrators do theVarsity Rag p.3<br />\nChesanow's Declaration of Principles p.6<br />\n<br />\n\fpage 2/news-letter/april 19, 1977<br />\nThe Clydesdale horses will appear at the Johns Hopkins<br />\nHospital May 13 and volunteers are needed to solicit the crowds<br />\nfor donations. If you can serve, please contact the Johns Hopkins<br />\nChildren's Center Development Office at 955-8767 or 955- 768.<br />\nHear ye, hear ye, all ye lovers of dogs! There will be a dog show<br />\nat the Spring Fair on Sunday, April 24, at 2:00 PM. Get your<br />\napplications in the Office of the Chaplain in Levering Hall. The<br />\ndeadline for applications is 1:59 PM on Sunday. Certificates will<br />\nbe awarded to participants, and ribbons to the winners of all<br />\ncategories. For more information, call exts. 8188, 8189 or 8190.<br />\n<br />\nOne Act Plays! Friday and Saturday, April 22 and 23, at 8 PM<br />\nin the Little Theatre of Levering Hall. Free admission.<br />\nThe BIA is seeking new members. Applications, available in the<br />\ngym office, will be accepted through April 27. Interviewsv id be<br />\non April 28. Also, non-varsity letter winners who have contributed<br />\nto the Hopkins athletic program are now being considered for the<br />\nG. V Lon Shaffer Award. Nominations, available in the gym<br />\noffice, are due April 29. For details, call 243- S05.<br />\nI would like to borrow a September 1976 issue of Ms. magazine<br />\nfor reference for a research paper. If you have one, call 889-8113<br />\nor drop a note in box 466.<br />\nAnyone who has been involved with the men's varsity, JV, or<br />\nfreshman fencing programs at any time during the history of the<br />\nUniversity is asked to contact the Alumnix Fencing Association<br />\nc/o Mr. John Austin, 1222 Deanwood Rd., Baltimore, Maryland<br />\n21234 (work 301-296-1434, home 296-0209.)<br />\nAnyone who has been involved with the men's varsity, JV, or<br />\nfreshman fencing programs is asked to contact- the Alumni<br />\nFencing Association c/o Mr. John Austin, 1222 Deanwood Rd!,<br />\nBaltimore, Md. 21234 (wprk 30U 9%4434, home 296-0209.)<br />\n<br />\nThe Science and Society Discussion Group will meet on<br />\nThursday, April 2 lt 7:30 PM in Conference Rm B, Levering. Dr.<br />\nR.K. Hunt of the Biophysics Dept. will discuss 'Catastrophe<br />\nTheory and Its Relation to Biological Concepts'. Readings are onx<br />\nreserve in the library. All interested students and especially<br />\nfreshmen are encouraved to attend.<br />\nAttention sophomores. Anyone interested in working at the<br />\nsophomore class ice cream booth during Spring Fair weekend<br />\nplease contact Ross Heisman as soom as possible a 366-5610 or<br />\nbox 254.<br />\nThere will be a meeting of the Hopkins Christian Fellows<br />\nthis Thursday, April 21,<br />\nat 7:00 PM in Conference<br />\nRoom A, Levering Hall.<br />\n<br />\nThe Canterbury Film Board will present the film Dirty Harry<br />\non Friday, April 22, in Remsen 1 at 7:30, 9:30 and 12:00<br />\nmidnight. Admission is $1.00.<br />\nA simultaneous chess exhibitionx will be held in the Rathskellar<br />\nSaturday night, April 23, starting at 9:00 PM. All winners receive<br />\na free pitcher of beer!<br />\nDomestic Investment will be the topic of a lecture by Merrill<br />\nLynch representative Timothy Clark tonight, April 19, at 7:30 PM<br />\nin the Mary Fisher Lounge at Goucher College. Refreshments will<br />\nbe served. The lecture is sponsored by AISEC-Goucher/Hopkins.<br />\nThe JHU Gay Caucus will meet tonight, Tuesday, April 19, at<br />\n8:30 PM in Conference Room B. Among topics to be considered<br />\nwill be the Spring Fair and a forthcoming dance. For more<br />\ninformation, call 366-0488.<br />\n<br />\nall the young<br />\nnotes<br />\n<br />\nThe Mayor's Fellowship Program is accepting applications now<br />\nfor next semester. The program is a six-credit course in which<br />\nstudents work at least 12 hours per week in an urban planning,<br />\nadministration, law or other agency. The work in the agencies is<br />\ncomplemented by a weekly seminar. Interested undergraduates<br />\nshould call Bob Seidel at extension 7168 or come directly to<br />\nMetrocenter Complex D in the basement of Shriver Hall to pick<br />\nup an application.<br />\n<br />\nComing events on the Homewood campus presented by the<br />\nOffice of Special Events:<br />\nApril 19. The Frank R. Kent Memorial Lecture by John<br />\nChancellor, Shriver Hall Auditorium, 4:00 PM. No admission<br />\ncharge.<br />\n•<br />\nApril 20. Wednesday Noon Series: \"I Remember Hopkins When<br />\n.. .\" Johns Hopkins faculty reminisce about their student days at<br />\nJHU. Francis Carlson, Professor, Biophysics, graduate 1942;<br />\nMatthew Crenson, Professor, Political Science, graduate 1963;<br />\nJohn Higham, Professor, History, graduate 1941; Richard<br />\nMacksey, Professor and Chairman, Humanities Center, graduate<br />\n19 -7; and M. Gordon Wolman, Professor and Chairman,<br />\nGeography and Environmental Engineering, graduate 1949.<br />\nGarrett Room, MSE Library, 12 noon. No admission charge.<br />\nApril 21. Peabody At Hopkins: \"Art Song\", prepared by Alice<br />\nGerstl Duschak and sung by her students. Garrett Room, MSE<br />\nLibrary, 12 noon. No admission charge.-<br />\n<br />\nOn Tuesday, April 26 a representative from the Hurricane<br />\nIsland Outward Bound School will show a film about the school.<br />\nA question and answer period will follow.x Credits are available to<br />\nschool participants. The meeting is at 8:00 PM in the Little<br />\nTheatre, Levering Hall.<br />\nChester's Place and the Writing Seminars is sponsoring another<br />\ncharming evening of live music, poetry and fiction this Wednesday<br />\nfrom 7:30 PM until 12:30 AM. Lee Mellick will read poetry and<br />\nMoira Crone fiction. Be it known that there is a 25 cent admission<br />\ncharge after 9:00. Refreshments will of course include beer, wine,<br />\ncoffee and tea, soda, cheese, assorted nuts, and fruit.<br />\n<br />\nEXCLUSIVE OFFER!!!<br />\nBuy fifty shares of<br />\nn-1 unlimited (preferred)<br />\nand receive free<br />\na copy of<br />\n'Faces in the News'<br />\n(CPS)-- What's an ex-President of the United States to<br />\ndo? It can get boring while still in a transitional stage,<br />\neven if your pension is near the hundred grand mark and a<br />\nton of golfing invitations flood your Secret<br />\nService-protected office every day.<br />\nFor Gerry Ford, the answer to escape that boredom is<br />\nto hit the always lucrative lecture circuit. Ford has kicked<br />\noff his series of \"informal\" visits to college campuses<br />\naround the country w ith a stop at his alma mater, Yale<br />\nUniversity. He had started his law studies there 42<br />\nyears-ago after a fair-to-middling scholastic record and a<br />\ndistinguished football career at the University of<br />\nMichigan. At Yale he coached the football team and<br />\neventually talked his way into the law school.<br />\nFord spoke to several classes, touching upon a wide<br />\nrange of topics with a guarded opinion. He said that one,<br />\nof his more regrettable decisions as president was not to<br />\ninvite the Russian dissident-exile, Aleksandr I.<br />\nSolzhenitsyn, to the White House in 1975.<br />\nTo further ease his retirement days, Ford has also been<br />\nappointed as an adjunct professor of political science at<br />\nthe U. of Michigan for the next winter term. He'll be on<br />\nthat campus for one or twol tek periods this calendar<br />\nyear while his teaching schedule is being worked out on a<br />\nmore permanent basis. Maybe he'll achieve the tenure he<br />\nmissed in November.<br />\n(CPS)-- Tired of that same old campus, smugly<br />\nlandlocked as it is in its traditions and too-familiar faces?<br />\nFor a $4,300 outlay, frustrated student adventurers,<br />\nacademically-oriented boatswains, collegiate shuffleboard<br />\nchampions, and campus Captain Piscums can sail the<br />\nseven seas aboard the SS Universe Campus, a 10,000-ton<br />\nship which houses classrooms, labs, a 10,000-volume<br />\nlibrary, a theater,. a hospital, a bookstore, and a student<br />\nunion. The ship is also equipped with the traditional<br />\nswimming pool and sports and sun decks.<br />\nThe three-month trip, which begins in Los Angeles May<br />\n25, offers a full range of college courses and credit. The<br />\nship will carry its 60 student voyagers t,o stopovers in<br />\nports in the North Pacific, the Indian Ocean, the Suez<br />\nCanal, and the Mediterranean Sea, and will complete the<br />\nexcursion by steaming up the Chesapeake to Baltimore.<br />\n\"The whole point is that it's really a consuming thing,\"<br />\nsays Phil Sonnichson of the Institute for Shipboard<br />\nEducation, which together with the . University<br />\n<br />\nColorado runs the program. \"You get off the boat<br />\nentirely drained.\"<br />\n<br />\nAll the<br />\nCPS Shorts<br />\nYou Can Eat<br />\n<br />\n(CPS)-- Admitting that speculation about futuhil<br />\ndevelopment in space is \"a very scary process,\" an<br />\naccomplished physicist and aerospace professor has<br />\nsuggested that a space community could be established,<br />\nequidistant from the earth and moon, by the 1990's.<br />\nGerard K. O'Neill of Princeton University has written a<br />\nbook exploring, through scientific and technological<br />\nknow-how, the \"possibilities\" of space development The<br />\nbook, The High 'Frontier: Human Colonies in Space<br />\n(Morrow, $8.95), is filled with enough well-documented<br />\nideas to make even Spock and Captain Kirk dancer ith<br />\nglee.<br />\n<br />\n•<br />\n<br />\nO'Neill believes that thousands of earthlings now alive<br />\nwould be able to live and work in space, in an \"island\"<br />\nspace colony located in orbit around the moon. In the<br />\nbook, O'Neill says that personal living conditions in space<br />\nshould be at least as aesirable and healthful as the most<br />\nfavorable areas on earth - more healthful, in' fact, for<br />\npeople with heart troubles and for elderly persons/ ho<br />\nwould find movement far easier in low-gravity space.<br />\nAll this could be achieved right now by using this<br />\ndecade's technological abilities, O'Neill writes.<br />\nOf special concern to our energy-strapped world is the<br />\nprofessor's notion that the space colonyi ould send to<br />\nearth, via microwave, unlimited supplies of solar power.<br />\nEnough, the author offers, tO ma conventional power<br />\nsources obsolete.<br />\nThe book does not avoid one's potential for good and<br />\nevil, no matter here one lives. However, the Cornell<br />\ngraduate and Jerome Clarke Hunsa or Professor of<br />\nAerospace declares, \"there seems good reason to believe<br />\nthat openingsthe door into space can improve the human<br />\ncondition on earth.\"<br />\n<br />\n(CPS)-- In a landmark decison, one of the toughest<br />\nstate fair political practices laws/ as relaxed this year to<br />\nallow minimum disclosures by Communist candidates<br />\nrunning for public office.<br />\nThe California la,said to be one of the nation's most<br />\nstringest political reform packages, requires all candidates<br />\nand campaign committees to complete periodical reports<br />\nrevealing the sources, dates, and amounts of campaign<br />\ncontributions.<br />\nBut, because of potential FBI harassment, employer<br />\nreprisals, citizen violence and a chilling effect on* fund<br />\nraising, candidates running on Communist tickets in<br />\nCalifornia no longer have to report the identities,<br />\noccupations, or addresses of contributors donating<br />\nbetween $50 and $1,000.<br />\nCommunist candidates for public office- ill have to<br />\nreport complete information on contributors of over<br />\n$1,000. And for those in the $50 to 81,000 category only<br />\nthe dates and amounts of the contributions/v' ill have to<br />\nbe disclosed.<br />\nThe recent California Fair Political Practices<br />\nCommission ruling is thought to be the first of its type,<br />\nthe Los Angeles Times said.<br />\n<br />\n\f!ap-ril 19, 1977/news-Itter/pagel3<br />\n<br />\nPrez Muller shuffles deck;<br />\nV.P.s no longer<br />\n'heartbeat away'<br />\nBy ROBERT RIGGS<br />\nA major high-level reorganization of the administration<br />\nof the Johns Hopkins Institutions was disclosed by<br />\nUniversity President Stephen Muller. Of five existing vicepresidencies, one will be created, three will undergo<br />\nchanges in both title and function, and one will remain<br />\nbasically unchanged.<br />\nThe vice presidencies for the Homewood and Health<br />\nDivisions (Dr. George S. Benton and Dr. Richard S. Ross)<br />\nare being discontinued. The Provost (Dr. Richard<br />\nLongaker) will assume the acade,mic functions previously<br />\nperformed by these two vice-presidencies, including<br />\nsupervision of the MSE Library and the Dean of Students<br />\nOffice. On the organizational chart, the Deans at<br />\nHomewood, SAIS, and East Baltimore will be directly<br />\nresponsible to the Provost rather than these two<br />\nvice-presidencies as they were in the past.<br />\nAdministrative duties performed by these two positions<br />\nwill be transferred to the newly created vice-president for<br />\nAdministrative Services. No candidate has yet been<br />\nselected to fill this office.<br />\nThe incumbent Vice -President for Business<br />\nManagement, Robert C. Bowie, will become<br />\nVice-President for Finance and Management Systems.<br />\nThis post is designed for a staff role, monitoring fiscal and<br />\nmanagement policies within the University. Bowie will<br />\nalso be the principal budget adviser to President Muller.<br />\nAdministrative functions of the old V.P. for Business<br />\nManagement will be transferred to the V.P. for<br />\nAdministrative Services.<br />\nRoss Jones will shift from Vice-President for University<br />\nAffairs to Vice-President for Institutional Affairs, There<br />\n<br />\nhe will be-,11-ie .senior development and public relations<br />\nofficer of Hopkins institutions. Also, Dr. Richard S. Ross<br />\nwill change his title to Vice-President for Medicine, where<br />\nhe will share in the supervision of the clinical patient-care<br />\nactivities of the Hopkins institutions. He will continue to<br />\nserve as Dean of the Medical Scnool.<br />\nThe fifth vice-presidency will remain unchanged.<br />\nExecutive Vice-President and Director of the Johns.<br />\nHopkins Hospital Dr. Robert M. Heyssel will continue to<br />\ndirect operations of the Hospital.<br />\nThe primary purpose of the reorganization, according<br />\nto President Muller, is to integrate and reaffirm the joint<br />\nPresidency of the University and the Hospital. \"The joint<br />\npresidency of the two institutions has been in effect for<br />\nnearly five years,\" he commented, \"and can be more<br />\neffectively institutionalized.\"<br />\n\"Until now, we have had separate organs for the<br />\nUniversity and for the Hospital,\" he continued.\"When we<br />\nfirst had a joint President, we really didn't know how it<br />\nwould work. I myself, the Boards of Trustees, and my<br />\n\"The job was a mix of academic and non-academic<br />\ncolleagues reached the conclusion around the end of 1975 services,\" posed President Muller as another reason for the<br />\nthat the, joint Presidency should be continued and that termination of the job. \"We're somewhat discontinuing<br />\nwe ought to consider it permanent. In making the change,<br />\ni Resignation Unrelated<br />\nThere is no relation, he added, between Dr. Benton s<br />\nwe decided to get rid of the things that weren't working<br />\nrecent resignation and this reorganization. \"Dr. Benton<br />\nterribly well.\"<br />\ncould have been included in this reorganization,\" he<br />\n?resident Muller cited the discontinued<br />\nvice-presidencies for the Health Divisions and for the stated.<br />\nHomewood Divisions as positions that never realized their<br />\nPlans for the reorganization, which will go into effect<br />\nfull complement of potential functions. \"Dr. Benton was July 1, have been in the works for the past fifteen<br />\nvery effective at Homewood,\" he said, \"but it was hoped<br />\nmonths. They were developed by a seven-man internal<br />\nthat a closer link to SAIS would be formed than what task force, with the assistance of Organization Resource<br />\ndeveloped.\"<br />\nCounselors, Inc., a consulting firm.<br />\n<br />\nj<br />\n<br />\n$$$SAC$$$$<br />\n<br />\nBy GAYLE COHEN<br />\nThe Mardi Gras will come to Homewood this weekend<br />\nin the guise of the Spring Fair. In keeping with the theme,<br />\nfestivities will include a masked ball, jazz music, and a<br />\nkiewe.<br />\nFair chairman Mike Posever explained that Mardi Gras<br />\nwas chosen as the theme \"because it's colorful and there's<br />\na lot of possibility in the lines of entertainment and food<br />\nthat's never been done before.<br />\n\"We're expecting up to 100,000 people. Last year we<br />\nhad 60-80,000. Booth exhibits are another of the fair's staple<br />\nattractions. Posever said, \"This year we've made a specific<br />\neffort to upgrade the arts and crafts exhibits.<br />\nThis year we'vereally tried to improve the quality.\"<br />\nIn order to qualify for a booth, a craftsman must send<br />\nsamples or pictures of his or her work for screening.<br />\nAccording to Posever, \"We goson a rolling admissions<br />\nbasis. We pick the best ones. This year we're only allowing<br />\noriginal, handcraftediwork.\"<br />\nAlthough most of the craft exhibiters aie from the<br />\n<br />\nMaryland area, some come from as far away as California.<br />\nTheir displays range fromphotography to woodworking to<br />\njewelry.\"We have just about everything,\" Posever said.<br />\nMany campus and community organizations will also<br />\nhave stalls, although these \"will mostly 'just distribute<br />\ninformation. There's been a lot lot of enthusiasm,mostly<br />\njust distribute information. There's been a lot of<br />\nenthusiasm. We probably have a couple hundred<br />\nvolunteers. All the classes and most of the frats are<br />\ninvolved.\"<br />\nSome highlights of the fair will be:<br />\nFriday: a parade down Wyman Park Drive at noon, a<br />\nfireworks display at 9 PM in the freshman quad and a<br />\ncostume party in the Rathskellar.<br />\nSaturday: Casino Night in the Great Hall and a masked<br />\nMardi Gras ball in the Glass Pavilion.<br />\nAntique Car Show<br />\nxSunday: an antique car show at Homewood House<br />\nand the Claude Kipnis Mime Theatre in Shriver Ha 1 in<br />\nShrive r Hall.<br />\n<br />\nToday at 4 pm in the Great Hall, the Student Activities<br />\nCommission will vote on its budget for the 1977-8 fiscal<br />\nyear. This annual meeting, far from being a moribund<br />\naffair, has in previous years beer: marked by a high degree<br />\nof picayune quarrelling and violence.<br />\nHowever, because the SAC budget is balanced and each<br />\nparticipating organization has already agieed to the amount<br />\nof currency it is to recieve, today's meeting will probably<br />\nproceed with an absence of fisticuffs.<br />\nThe 1977-78 operating budget is $108,000, which<br />\nfeatures an increase of $8,000 from this year. According<br />\nto Ron Bialek, outgoing head of the SAC,the increase has<br />\nboth good and bad consequences: \"The SAC was<br />\nextremely lucky to get an lye 000 increase for next year,<br />\nbut that' means that Ja<br />\nand Chris Columbo won't<br />\nhave big contingency funds to help bail out those clubs<br />\nthat get into financial difficulty.\"<br />\nOut of the $108,000, the largest outlay is for the<br />\nNews-Letter, which receives $7,200. \"In order to print<br />\nthe News-Letter twice a week,\" Bialek said, \"they need<br />\nthe cash. It's pretty legitimate.\"<br />\nYet, he continued, \"Considering the complaints I've<br />\ngotten from students about the 'content of the Friday<br />\nNews-Letter, it's hard to justify that $7,200. They feel<br />\nthat for features they could go out and buy a quality<br />\nmagazine like Time or Newsweek. I'd like to be able to<br />\npick up ' a N-L that had a combination of news and<br />\nfeatures.\"<br />\nClose behind the N-L in operating costs is Milli,<br />\nwhich is budgeted for approximately $6,300. With the<br />\ninstallation of an FM transmitter, WJHU will be able to<br />\nexpand and provide another source of campus<br />\ninformation besides the N-L. Says Bialek, \"I've had no<br />\ncomplaints concerning the expansion of WJHU. Everyone<br />\nthat I've talked to thinks it's a great idea.\"<br />\nOne of the few organizations that will take a cut in<br />\nbudget is Ellipsis (formerly Collection of Words), whose<br />\nallocations will decrease from $1350 to $900.<br />\n\"Last year they screamed that they needed $1350 for<br />\nproduction, prize money, etc., so we gave it to them,\"<br />\nsaid Bialek. \"But they've already spent a good portion of<br />\nthat one one full-page and four quarter-page ads in the<br />\nNews-Letter. They've spent more on adskhan on prizes.<br />\nIn the SAC we have to justify this iid of spending to the<br />\nadministration and the faculty. All I can say is that<br />\noccasionally we get irresponsible people in high positions<br />\nin clubs here.\"<br />\n<br />\n\fpage 4/news-letteriapril 19, 1977<br />\n<br />\nWho knows what Jimmy's doing?<br />\nBy K.E.T.<br />\nEven an astute observer of the development of current<br />\nUnited States foreign policy under the Carter<br />\nAdministration may have difficulty pinpointing exactly<br />\nwhat the overall direction of our policy is, and perhayof<br />\nour policy is, and perhaps of equal importance, who is<br />\nreally deciding it. Of course, a few political bywords come<br />\nto mind immediately; undoubtedly, we all would recall<br />\nsuch phrases as 'containing the arms race', 'support for<br />\nIi uman rights', and 'cooperation', but even these<br />\ncormerstones of action have not been emoloyed at times<br />\nwhen outside pressure beeame overpowering and when<br />\nthe real decisionswere to be made.<br />\n<br />\nWhizzes balance<br />\nHopkins bucks<br />\n<br />\ncontrary interests and ideas as well as the<br />\nnevessary might to overcome or at least severely hamper<br />\nthe President's goal plans.<br />\nOn the matter of human rights, there are also<br />\ndifferences between the policies that the President has<br />\nendorsed and those that are ultimately enacted. Among<br />\nthe human riflits principles outlined in the Helsinki<br />\nAgreement was one calling for increased travel<br />\nopportunities and exchanges of East and West business,<br />\nscientific, and cultural groups. But the recent US decision<br />\nt bar entry to three Soviet trade-union officials/ ho had<br />\nbeen invited to attend a labor conference in the US is at<br />\nvariance with our agreement at Helsinki. In this case, it<br />\nwas not Carter's decision that carried, but the opposition<br />\nof the powerful organization of the AFL-CIO leadership<br />\nand their lobbying efforts which finally swayed the<br />\ndecision.<br />\nOf equal importance as the need for consensus among<br />\nthe groups that influence and decide US foreign policy,is<br />\nthe necessity of a clear I foreign policy, is the necessity of<br />\na clear position on US involvement in disputes in other<br />\nparts of they' orld. Of prime interest at this time are the<br />\ncountries of Africa and especially Zaire, which is<br />\ncurrently being invaded by Soviet-supplied guerillas from<br />\nAngola. Mr. Carter, this time faced with a situation that<br />\ninvolved little opposition from domestic groups, decided<br />\nnot to sene military aid even though it was evident that<br />\nthe Soviet Union had militarily supplied the insurgents.<br />\nInstead, the US agreed to send 'nonlethal' material,<br />\nnecessitating the involvement and arms pledges of the<br />\nFrench, the Belgian, and several other governments. The<br />\nSoviets have voiced their intention to make their presence<br />\nfelt in the troubled areas of theSoviets have voiced their<br />\nintention to \"make their presence felt in the troubled<br />\nareas of the world\", seemingly/ ithout constraint and if<br />\nthe United States continues to ignore the requests of<br />\ninvaded nations for arms, Soviet presence 'will .expand<br />\nsimply as a result of our inaction. President Carter has<br />\nstated that the US eill support any nation dedicated to<br />\n'democratic principles' but if he does not begin soon by<br />\nsupporting nations that need our military aid to remain<br />\ndemocratic, there may be none that survive.<br />\nThe foreign policy of a country with a number of<br />\npowerful interest groups like the United States cannot<br />\nconceivably be formulated by one man. Undoubtedly,<br />\nthis dilemma presents problems of enacting a consistent<br />\nforeign policy line. But in the interest of our allies,-and<br />\nthose nations that. have come to depend on the United<br />\nStates as a balancing force against the Soviet Union in<br />\nworld affairs, it is our responsibility to involve ourselves.<br />\n<br />\nFor example, the United States is committed to the<br />\nreduction and control of proliferation of nuclear<br />\nweapons, but even as Washington reporters scribbled the<br />\nrestrainingw ords Carter spoke,construction continued at<br />\na quick pace on the new US Military base on Diego Garcia<br />\nin the Indian Ocean. Not only does our new base<br />\nrepresent the United States' first permanent foothold in<br />\nthis part of the world, but it is in direct defiance of the<br />\nreiterations of the countries in this part of the world<br />\nwho,x since 1971, have requested that the Indian Ocean<br />\nbe declared a 'zone of peace'. Obviously, our cooperation<br />\nis unresponsive on this matter and our commitment to<br />\n'the race' is progressing in leaps and bounds.<br />\nYet it appears that President Carter is not totally to<br />\nblame for • discrepancies in US foreign policy.<br />\nUndoubtedly, Mr. Carter's rhetoric on stemming the arms<br />\nrace or reducing it draws everything from concerned<br />\nfrowns to concealed chuckles from Pentagon officials and<br />\narms dealers;, both major foreign policy formulators in<br />\ntheir own rights. The fact is that these two forces have<br />\n<br />\nBy ROBBY RIGGS<br />\nThe Johns Hopkins University will have a balanced<br />\nbudg consecutive year, according to Budget Director.<br />\nNorman Kreuger.<br />\nThe Johns Hopkins University will have a balanced<br />\nbudget in 1977-78 for the fourth consecutive . year,<br />\naccording to Budget Director Norman Krueger.<br />\nKrueger termed the projected 159 million dollar budget<br />\n\"status quo\" with little new or different except pursuit of<br />\nthe rising price index. On the expenditure side, there are<br />\nno new programs and no wholesale cuts. Although<br />\nrevenues increased sufficiently to assure a balanced<br />\nbudget, Krueger cited several areas which could prove<br />\ntrouble spots in the near future.<br />\nHe expressed concern about the leveling off of<br />\neach year while sending tuition over the $5000 mark.<br />\nsponsored research funding in Washington. \"We're not<br />\nWhile he expects the next several years to be \"very tight\"<br />\nseeing the kinds of increase in National Science<br />\nfinancially for some divisions of the University, he is<br />\nFoundation and National Institute of Health funds that<br />\nlooking for long-term relief from the Hopkins_ Ilundreds,<br />\nwe have had previously,\" he stated': A 0.6% increase over<br />\nincreased alumni donations and increases in Maryland<br />\nthis year is projected in these areas, while the normal rate<br />\nstate aid to education. Krueger called the policies ot the<br />\nof increase had been 6% per year. This curtailing of direct<br />\nCarter administration \"a big unknown\" in planning the<br />\nresearch grants has the consequence of lowering indirect<br />\nUniversity's financial future.<br />\nrecovery funds, a major (almost 10%) source of revenue<br />\nfor the University. Effects of this trend have been felt this<br />\nyear in the School of Public Health.<br />\nThe School of Medicine is another problem area. It is<br />\nbudgeted to use 1;.<br />\ndollars worth of funds it had<br />\naccumulated as surplus during previous years. There are<br />\n\"one-time\" monies which are not renewable, so the<br />\ndivision risks running a deficit in future years.<br />\nOne significant increase in revenue Nva-s a 2.7 million<br />\nincrease in !`Clinical Service\" funds from fees charged by<br />\nphysicians at East Baltimore. This, too, has the character<br />\nof a one-shot/windfall which may not be counted on in<br />\nthe future. The same, according to Krueger, might be said<br />\nof a 0.6 million dollar increase in \"Designated Funds\"<br />\nThe question as to the best form of managemant for<br />\nsolicited by President Muller. The University will thus<br />\nthe Bookcenter is still under consideration by the<br />\nneed to find more lucrative sources of income in the near<br />\ntudent Council and Dean of Students Jakie Hall,<br />\nfuture.<br />\nalthough no concrete decisions have yet been made.<br />\nThe total 1 977-78 budget for the University,<br />\nPresident-elect of the Student Council, David<br />\n5159,173,000, is about 7.9 million dollars more than this<br />\nChesanow, said, \"We're going to look into the matter<br />\nyear's. This represents an increase at approximately the<br />\nfurther. We have to consider the people in the co-op and<br />\nrate of inflation, which means the University will operate<br />\nwhether the co-op could financially sustain itself.\"<br />\non about the same amount-of money this year in real<br />\nHe was referring to a Student Council proposal that the<br />\nter The 1976=77 budget, hich was projected to be<br />\nBookcenter be converted to a student-run cooperative<br />\nbalanced, may actually run a deficit of<br />\nfrom its current set-up as a franchise of the Follett<br />\n5100,000-200,000, Krueger stated. He attributed this to<br />\nPublishing ComaCompany. Chesanow explained that<br />\nthe exceptionally severe winter weather, which caused<br />\nstudents might be reluctant to work in the co-op during<br />\ncaused this year's fuel costs to. exceed next year's by<br />\n• exam periods, and that Follett's makes most of its profits<br />\nS600,000. He noted that in January alone the Unibersity<br />\nfrom non-book sales, such as those of shirts and<br />\nspent %115,000 on number six fuel oil, as opposed to<br />\nstationery. These two factors could undermine the success<br />\nS45,000 during-a normal year. Any such deficit would be<br />\nof a student book co-op.<br />\npaid out of the unrestricted endowment of the University.<br />\nMembers of the Student Council's Bookcenter<br />\nKnieger compared Hopkins favorably with other large<br />\nCommittee are studying similar cooperative bookstore<br />\nprivate universities in the East which have run deficits<br />\narrangements at other colleges.<br />\n<br />\nr!<br />\n<br />\nSC bookies to<br />\nlook further<br />\ninto<br />\nFollett's future<br />\n<br />\nhappy birthday,<br />\njakie!<br />\n<br />\n\fapril 19, 1977/news-letter/page 5<br />\n<br />\n\"Sravos, laughter and people WNW the house<br />\nAnnaKIsselgoff — The New To* limos<br />\n<br />\n•<br />\n<br />\nJRINSEINIF<br />\n<br />\n41:1,11%1W.<br />\n<br />\nJOHNS ii0PKINS UNIVERSITY<br />\nSHRIVER HALL<br />\nApril 24 - 8:00 p.m.<br />\nTickets<br />\n<br />\nAdults<br />\n<br />\nStudents<br />\n<br />\nTickets on sale at Union Desk & at door<br />\nSponsoied by thr• Un.on Board<br />\n<br />\na dinner dance orsthe MV ityrtWelcame<br />\n4<br />\nmay lB—8pm_ _ _ a_dmissi *2 'comples<br />\n*112_5°singles.— live rnut_sic..._fanc__y colotim<br />\ncbarropagirs_ _ - buffet— prime rib__ crab cakes<br />\nsweet table___cash bar__ _tickets-uunion desk<br />\nsponsored by the juniior class<br />\n<br />\nI think of David Bowie in the<br />\n'<br />\nsame way that I think of major household appliances.<br />\n<br />\n_FE0_0_10014010101000011010.<br />\n<br />\n-g_<br />\n<br />\nThe JHU Young Democrats Present<br />\n<br />\nFoi<br />\n<br />\nSenator<br />\n<br />\nWILLI<br />\nP!T-!'. 'XMI<br />\nApril 19, 1977<br />\n8 pm<br />\nListening-Viewing<br />\nRoom<br />\nLevering Hall<br />\n<br />\nThe Johns Hopkins<br />\nUniversity Band<br />\npresents its<br />\n<br />\nSpring Concert<br />\nSaturday<br />\n4<br />\nr<br />\nApril 23,1977 8pm ,?<br />\nShriver Auditorium '/?<br />\nFREE<br />\nADMISSION<br />\n<br />\n101010<br />\n\\<br />\n<br />\n'..7.<br />\n,<br />\n7`.\"•7<br />\n\\<br />\n<br />\n\fArAndr'AirArArAr'ArArAr<br />\n<br />\ncarter's little<br />\nenergy pills<br />\neditors-in-chief<br />\nMike Deak<br />\nMike Krug<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editor<br />\nDave DeSmith<br />\nnews editor<br />\nGayle Cohen<br />\nsports editor<br />\nDave Kraus<br />\nphoto-production manager<br />\nJennifer Bishop<br />\n<br />\nWas it a phone call placed by President Carter or merely fate that causedyesterday's two incidents of power failure? The<br />\nHomewood power plant sustained a morning and afternoon bout of April fever which forced energy officials to<br />\ntemporarily cut back on the power in circulation.<br />\nMeanwhile, President Carter embarks this week on the mission to convince the American people that this country faces a<br />\nsevere shortage of energy. He will tell them that individuals must conserve, and the government must invest in the<br />\ndevelopment of alternative energy sources. Carter will further deliver an energy state of the union message to Congress, and<br />\nrelease his long-awaited comprehensive energy proposal masterminded by Secretary James Schlesinger.<br />\nMobil and Texaco oil corporations have recently been conducting an interesting advertising campaign in the New York<br />\nTimes and Washington Post, attempting to illustrate their concern for scarce energy supplies. Such publicity is also meant t<br />\ninfluence the administration in their formulation of the final energy policy manifesto.<br />\nFurthermore, oil companies defend themselves against congressional critics.who contend they. kept needed natural gas<br />\nembedded in off-shore oil wells this past winter (for financial gain.) Oil barons are correct to assert,_ however, that<br />\nunlimited barrels of oil should not be pumped, even in the face of ascare such as the one this past winter. But will they<br />\nconvincingly assist the administration in the search for dependable energy? (a step past plutonium plants, we hope.)<br />\nThe unemployed that walked the streets in the nation's steel belt this December are already aware of the human energy _<br />\nsources. Yet the source which technology must develop on a reasonable scale, will not ultimately be our backup, but<br />\nprimary energy source.<br />\n<br />\nDeclaration of Principles<br />\nIn an interview appearing in the March 22 News-Letter,<br />\nI spoke of my intention, if elected, of producing a<br />\nDeclaration of Principle for my term as Student Council<br />\nPresident. Though more of a letter than an actual<br />\ndeclaration (as part of an effort to strike all undue<br />\nformality from student government), I hope this<br />\nstatement, will,serve to reaffirm my views and, amidst the<br />\nclass primaries, perhaps define the guidelines by which the<br />\nincoming Council might operate.<br />\nThe most general, all-encompassing duties of the<br />\nStudent Council are to represent and act in the the<br />\ninterests of the Hopkins undergraduates in all matters<br />\ndirectly or indirectly pertaining to them. However, in<br />\norder to to render credence to this proposition certain<br />\nfundamental conditions must be met.<br />\nFirst, it is absolutely necessary that the Council present<br />\nitself as a cohesive front for meeting student needs.<br />\nTherefore, upon assuming office for the coming academic<br />\nyear, the entire Student Council membership must make a<br />\nconscious and concerted attempt to transcend all<br />\nbitterness and personal enmities (often arising from the<br />\nprevious elections) that could possibly hamper Council<br />\nprogress in any given direction. Unless completely devoid<br />\nof in-fighting, the Council will have damned itself from<br />\nthe • start, leaving the possibilities of accomplishing<br />\nanything of long-term consequence negligible.<br />\nSecond, the Student Council must seek the active<br />\nparticipation of the greatest possible number of<br />\nundergraduates in student<br />\ngovernment. Not only will this promote more widespread<br />\nknowledge and understanding of important issues -- as<br />\nwell as bring new issues to the fore -- but itwill greatly<br />\nfacilitate Council action in areas w here strong student<br />\nreaction can produce an impact. It is also of paramount<br />\nimportance that undergraduates know,who their Council<br />\nrepresentatives are, and utilize them to the fullest as a<br />\nmeans of articulating their concerns. By way of regular<br />\nopen forums (tentatively scheduled for . the second '<br />\n<br />\nTuesday of each month, in the Glass Pavilion) as -a<br />\nbadly-needed supplement to the weekly Council meetings,<br />\nit is hoped that more students will avail themselves of the<br />\nopportunity to make themselves heard.<br />\nThird, the new Council must strive to develop a closer<br />\nrapport ,with the Hopkins faculty. Through revitalized<br />\nstudentliasons to the individual departments, in addition<br />\nto the careful scrutiny of all facets of Hopkins education,<br />\nthe Council and faculty together may take steos toward<br />\nthe overall betterment of undergraduate academics.<br />\nFourth, a more productive wor Icing relationship<br />\nbetween the Council and University administration must<br />\nbe fortered. This does not entail passive submission to<br />\nadministration must be fostered. This does not entail<br />\npassive submission to policies that blatantly conflicbwith<br />\nundergraduate interests, in which case it would be the<br />\nCouncil's duty to spearhead swift :)nd definitive measures<br />\nto counter such an action. Rather, it must be the purpose<br />\nof the Council, through a display of pragmatism and<br />\nsound judgment, to secure a welcomed role in all<br />\npolicy-making that affects the undergraduate.<br />\nOnce the above prerequisites have been fulfilled, the<br />\nCouncil will find itself in a position to implement those<br />\nchanges it deems necessary to improve undergraduate<br />\nexistence at Johns Hopkins -- everything from intersession<br />\ncourse-offerings to the day-to-day social life on campus.<br />\nThe desire, the innovativeness, and the energy are readily<br />\napparent -- only a clear and level-headed approach is<br />\nneeded to see the plans through. It is simply a matter of<br />\nkeeping our objectives practical -- .they need not be<br />\nmodest.<br />\n<br />\na<br />\n<br />\nletters,we<br />\nTo The Editor:<br />\nI would like to take this opportunity to express my<br />\nsincerest appreciation those who supported my candidacy<br />\nfor Student Council President during the past month.<br />\nThough our<br />\ncompaign was unsuccessful, I an very proud because the<br />\ncampaign was based on solid issues and proposals and<br />\nbecause itv si's a clean and honest campaign. In a sense the<br />\ncampaign was a success because it aroused the interest of<br />\nmany who had lost faith in student government and many<br />\nwho are now interested in participating in the programs<br />\nwhich were proposed and discussed as a result of the<br />\nelections.<br />\nIt is extremely important that those who expressed<br />\ninterest in becoming involved in student activities pursue<br />\ntheir ambitions. We face a difficult year ahead and David<br />\nChesanow and the Student Council will need a great deal<br />\nof popular support to effect the change that most of us<br />\n<br />\ngot letters<br />\n<br />\nagree is necessary. I can only hope that I will prove research, and the value of his unusual and challenging<br />\nworthy of the faith that those who voted for me have critique of the dominant understanding of politics in our<br />\nexpressed. Personally I plan to pursue those issues which socitiety, we believe that it is essential that he remain in<br />\nwe raised during the campaign, and hope othersv ill too. the University. Believing the issues to be essentially as<br />\nIn short, the campaign is not over, it is jut beginning; defined by the open letter to President Muller in the April<br />\nthe problems that existed in March will still be there in 12 News-Letter, we have requested that the Academic<br />\nSeptember and so I will urge once again for people to get .Council form an ad hoc committee to review Professor<br />\nnvolved, be active, and help us build for the future.<br />\nPfeffer's candidacy for a tenured position. We urge all.<br />\nStuart Davidson students and faculty w ho believe as Qv do to use their •<br />\nMembers of the University Community:<br />\ninfluence and good offices to have the Academic Council<br />\nAs many of you know by now, Associate Professor form such an ad hoc committee to review the case.<br />\nRichard M. Pfeffer of the Department of Political Science<br />\nPolitical Science Graduate Students<br />\nhas been denied tenure by a recent action of the senior<br />\nfaculty in the Department. A move is under way to Jim Musselwhite<br />\nDouglas Dailey<br />\nrequest that the Academic Council form an ad hoc faculty Deborah P. Kelly<br />\nMarilyn Karr<br />\ncommittee at its next meeting to review his candidacy for Robert Roach<br />\nKenneth T. Kato<br />\na tenured position in the University. Because of his Robert B. Shepard<br />\nChris Goldman<br />\nexcellent teaching performance, the high quality of his James H. Qualls<br />\n<br />\n\fBroadway comes to Baltimore;<br />\nPlaywriting at Hopkins<br />\nBy JOHN PERROTTA<br />\n<br />\nBob Arellano<br />\n<br />\nFriday and Saturday at eight pm in the Little Theatre<br />\nundergraduates will once again demonstrate that<br />\ncreativity does exist at Hopkins. Robert Arellano will<br />\npresent six one-act plays written, directed, produced and<br />\nacted by the students in his play writing workshop. The<br />\nprogram mingles comedy and satire with realistic drama.<br />\nStudent demand led to the birth of the play writing<br />\ncourses in 1971. Arellano, an instructor in the Chemistry<br />\nDepartment, taught \"Problem Drama\" to a handful of<br />\neager undergraduates. The \"problems\" they wrote about<br />\nwere generally restricted to those at Homewood:<br />\nautomatic vending machines in Levering Hall and the<br />\ninefficient University president who just wouldn't quit.<br />\nInterestingly enough, just before five plays were<br />\nperformed, all dealing with President Lincoln Gordon's<br />\ninadequacies, he resigned his position at Johns Hopkins.<br />\nAfter the end of the Vietnamese War, protest plays were<br />\nreplaced by real-life drama.<br />\nThe young playwrights did not always enjoy the<br />\nbenefits of Levering Hall's Little Theatre. They first<br />\nperformed plays in Maryland Hall, the Garrett Room,the<br />\nJ and H Rooms, and even in Shaffer 3. Many times stage<br />\nhands w ould arrange props and lights while a nervous<br />\nprofessor was trying to wrap up his lecture. Finally, Dean<br />\n<br />\nOwen procured funds to buy floodlights and lumber for a<br />\nstage, and playwriting moved to its present'location. The<br />\nLittle Theatre seats seventy comfortably, but Arellano<br />\nclaims the record for cramming people ,in is one hundred<br />\nand two,counting those seated on the. window sills.<br />\nRobert Arellano left his native Cuba in 1959 and<br />\nreceived his B.A. and M .A. at the Massachusetts Institute<br />\nof Technology. He came to Johns Hopkins in 1961 as a<br />\nchemistry instructor; and enrolled in Writing Seminars<br />\ncourses during his spare time. He received his M.A. from<br />\nthat department the following year. .<br />\nArellano's classes, including a quickie intersession<br />\ncourse, have performed over two hundred and fifty plays<br />\nsince 1971. Actors are allowed not more than one week<br />\nto learn their lines. Intersession students are permitted a<br />\nmere three days.<br />\nPresently Arellano is busy supervising rehearsals of two<br />\noriginal plays: \"Nicely Goodworth\",<br />\na chemical<br />\ncomedy to be presented during the Spring Fair in Remsen<br />\nHall, and \"Eleven O'clock\", to be presented the following<br />\nweekend. He is also preparing for a summer musical.<br />\nSays Arellano about drama and chemistry, \"It's a very<br />\ngood combination because you don't get bored.\" Indeed,<br />\nhe is not the only one, as his course is ranked among the<br />\ntop by students, and at show-time the Little Theatre is<br />\nalmost always filled to capacity.<br />\n<br />\nYoung Dudes respond toYoung Dems<br />\n<br />\nfr<br />\n<br />\nThe recent article concerning attempts to force the<br />\nunionization of Southern textile plants was submitted by<br />\nthe Yotnig Democrats. Yet, in a larger sense, the<br />\ncharacterizations of the evil magnate and the blameless<br />\nlabor organizer are the creation of well-salaried curators<br />\nof public opinion. Fifteen million dollars of workers'<br />\nsalaries buys many stereotypes.<br />\nThe migration of the American textile industry to the<br />\nSouth is not solely the result of an attempt to avoid the<br />\npower of Union bosses. Management knows well that the<br />\nhirelings of Big Labor will travel, for a price. Non-union,<br />\nas well as organized, plants moved from the Northeast.<br />\nOther aspects of overhead costs-- power, taxes, and rent -influenced the decision.<br />\nThe allegedly low wage scale of Stevens employees is<br />\noffered as evidence of management wrongdoing. To note.<br />\nonly that the STevens worker receives somewhat less than<br />\nthe averageAmerican factory worker does not take into<br />\naccount differences in skill, cost of living, and job market<br />\nconditions. Any increase in wages gained by the union<br />\nwill lead to higher prices, a higher cost of living, and<br />\nfurther wage demands. Neither should it be forgotten that<br />\nunion membership ' costs both the worker and his<br />\nemployer money; money that might otherwise go to<br />\nwagess and capital investment. And what service does the<br />\nunion provide, that workers could not provide for<br />\nthemselves without paying the union hierarchy?<br />\nIf, as is alleged, laws have been violated, redress is<br />\navailable. It were not as if employees needed to submit to<br />\nunionization in order to have their legal rights protected.<br />\nThere is, however, an issue at stake that reaches well<br />\nbeyond the Stevens plants, sweaty or not, beyond the<br />\nSouth, beyond even the media hirelings. Those who<br />\nsupport the forced unionization of'Stevens workers claim<br />\nfor themselves the words \"freedom\" and \"justice.\"<br />\nRegardless of the price paid out of the pockets of<br />\nAmerican workers, these concepts cannot be bought.<br />\nThey cannot be annexed to a cause that has, at its basis, a<br />\nsystem of political and economic coercion.<br />\nA union election is not what it seems. In the absence of<br />\nRight-to-Work Laws, derided by unionists, a bare majority<br />\nof workers in a single plant may force their fellow<br />\nemployees to submit their own paychecks to union<br />\nsiphoning, under pain of disemployment. There is no<br />\nfreedom; there is compulsory deprivation of property.<br />\nThose unwilling workers who, valuing their livelihoods<br />\nover their indpendence, acquiesce to this dues-slavery lose<br />\ntheir political freedom as well. The supposed power of the<br />\nMeaneys and Woodcocks of the textile industry may in<br />\nthe future be built on the backs of unwilling union<br />\nmembers. Their political support is subsumed wliAn the<br />\n<br />\nlabor bosses flaunt membership figures before officials.<br />\nThere is no freedom; there is restraint of freedom of<br />\n'assocation. The same rationale that prompted the textile plants to<br />\n<br />\nbe relocated in the Sotith could, as easily, close them. The<br />\nsame groups -- the same party -- that support the Stevens<br />\nventure oppose protectionism. The' two positions are<br />\ncontradictory.<br />\nsubmitted by the Young Republicans<br />\n<br />\nNear a Dike in the Dakotas<br />\nHer regime detracted from our union<br />\nAlthough severe press laws had been repealed<br />\nShe hid in shadows, mute but able.<br />\n<br />\nShe said her press conferences call for<br />\nMy indulgence and participation<br />\nYet she always answered \"I can't comment.\"<br />\n<br />\nWhen the tongue and its telegraph<br />\nBecome inundated in decision<br />\nWiresv ithe on,- catery ground:<br />\n<br />\n•<br />\n<br />\nMust I manage emergency repairs<br />\nLike a National Guardsman crashing<br />\nSome flooded dike in the Dakotas?<br />\nThe waters reel over your wrinkling skin;<br />\nI canoe through rapids near your struggle<br />\nProffering final measures of strength.<br />\nBut you're not willing to swim or stretch<br />\nYou wallow, convulsions sweep you away<br />\nLike a tumbling old stove<br />\nMichel Krug<br />\n<br />\n\fpage 8/news-letter/april, 19; 19.77<br />\nlimusimminommiemiumw mow<br />\n<br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $4.10.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 and<br />\nsave $103.) All you have to do is be under the age of 24.<br />\nThere are no booking restrictions. And no skimping on<br />\nmeals or service. Because we give you the same service<br />\nyou'd get from other airlines, without the same high costs.<br />\nSo,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to.<br />\nWe'll give you the best deal.<br />\n<br />\nAPE!<br />\n<br />\nUBS 1977<br />\n<br />\nDON'T BE A VICTIM<br />\n<br />\nCharter Tours<br />\nD.C. & Balto. Departures<br />\n•11111111•••11111•111•1111•1111•1111111•11111111111111111•M<br />\nfrom<br />\n1, 2 & 3 week charters<br />\nMarch—Dec. 30 Weekend<br />\nDepartures, via British<br />\nCaledonian Airways<br />\nair only<br />\nABC & TGC<br />\n••111111•1111•111••111111•1111111111111•1111111111111111111111•11111<br />\nfrom<br />\nParadise Island<br />\nHoliday Inn<br />\nMar—Apr •'359<br />\n$29<br />\nJuly—Nov. - 5299<br />\n17 weekend departures<br />\nall inclusive<br />\nAir, Hotel, Tax Piedmont Airlines<br />\nOTC<br />\n1111110•<br />\n1•11•11111111<br />\n11111111111•1<br />\n1111111111111<br />\n•••11111111•1<br />\nAcapulco $315-9 depar- from<br />\ntures Feb-Dec: Tri-Mexico<br />\nP66-4 departures July-Oct y<br />\n29<br />\nI a3bas.rjaty/Puerto<br />\nUaliajltaa s<br />\nC<br />\n<br />\n$289<br />\n<br />\nLondon<br />\nBahamas<br />\n<br />\nMem<br />\nHawaii Fil itdionlialnwanfilo‘ni is4m e4:D499<br />\n<br />\ne<br />\n<br />\n5<br />\n<br />\nall inclusive<br />\nAir, Hotel, Tax American & United Airlines<br />\nOTC & ITC<br />\nIII•1I•1II•111 111•11111 III•1111 11111111111111 1111111 1111111.111•11111<br />\nfrom<br />\n_ _ Waikiki Village '429<br />\n$345<br />\nAmerican & United Airlines<br />\n<br />\nair only<br />\nABC & OTC<br />\n111111•111•11111111111111111••11111111111111•11111111111011111<br />\n<br />\nIreland<br />\nPlease call<br />\n<br />\nBURCH<br />\nTRAVEL LTD<br />\n<br />\n467-3900<br />\n<br />\nWe plan<br />\nyour trip...<br />\nall you do<br />\nis take it!<br />\n<br />\nINSTANT PROTECTION from<br />\nMUGGERS, RAPISTS, and ANIMALS<br />\n<br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br />\n<br />\nOne quick spray with Guardian leaves an<br />\nattacker coughing, gasping and staggering blindly for 15 minutes and longer!<br />\nUsers have more than enough time to<br />\nescape and call police. The size of an<br />\nordinary pen. Guardian may be carried in<br />\npocket or purse for instant use in<br />\nemergencies.<br />\nCONTAINS<br />\nNO ILLEGAL<br />\nTEAR GAS!<br />\n<br />\nEIcelandic Airlines, Dept. #CN<br />\n<br />\nNOT<br />\nPERMANENTLY<br />\nINJURIOUS!<br />\n<br />\n630 Fifth Ave., N.Y., N.Y. 10020<br />\nSee your travel agent. Or call toll free: 8(10) 555-1212.<br />\nPlease send information on all Icelandic's low-cost fares to Europe.<br />\n<br />\n10-DAY<br />\nMONEY BACK<br />\nGUARANTEE!<br />\n<br />\nName<br />\n<br />\nORDER NOW—DON'T WAIT<br />\n<br />\nYOUR LIFE MAY DEPEND ON IT!<br />\nMail check or money order to:<br />\nAMG Enterprises Inc. Dept. N<br />\n95 Cedar Drive<br />\nPlainview, N.Y. 11803<br />\n<br />\nAddress<br />\n<br />\nIcelandic<br />\n<br />\nLowest Jet fares to Europe of any scheduled airline.<br />\n<br />\nADD 50C PER UNIT<br />\nPOSTAGE AND HANDLING<br />\n<br />\n0PP0P<br />\n<br />\nZip<br />\n<br />\nFAre..tibirct to chankr and g..t appr..,31<br />\n<br />\nL<br />\n<br />\n1 for $3.95 SAVE! [11 2 for $6.95<br />\nSUPER SAVINGS! 1 3 for $9.95<br />\n<br />\nBUSINESS<br />\n<br />\nState<br />\n<br />\nCity<br />\n<br />\n-T<br />\n<br />\nBURCH TRAVEL LTD<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin' Street<br />\nBoston,Mass. 02110<br />\n<br />\n3900 N. Charles St.<br />\n467-3900<br />\n00<br />\n00<br />\n<br />\nSpecializing in Hopkins<br />\nTravel<br />\n<br />\nTHE FRANK R. KENT MEMORIAL LECTURE<br />\n<br />\nBURCH<br />\nTRAVEL LTD<br />\n<br />\nSpecializing in Cruises,<br />\nIndividual and Group Tours<br />\nAll Domestic and International<br />\nTravelArrangements.<br />\nURCH<br />\n<br />\nr,AvEL<br />\n<br />\nJ. Burch Monett - President<br />\nPhyllis Mollett Barry - Vice\"President<br />\nStephen J. Baxter - Manager<br />\n<br />\n467-3900<br />\n3900 N. Charles St.<br />\n—<br />\n<br />\nWEDNESDAY NOON SERIES<br />\npresented by<br />\nThe Office of Special Events<br />\n'I REMEMBER HOPKINS WHEN...'<br />\nJohns Hopkins faculty reminisce about their student days at J.H.U.<br />\nFrancis Carlson, Professor, Biophysics,<br />\ngraduate 1942<br />\nMatthew Crenson, Professor, Political Science,<br />\ngraduate 1963<br />\nJohn Higham, Professor, History<br />\ngraduate 1941<br />\nRichard Macksey, Professor and Chairman<br />\nHumanities Center, graduate 1957<br />\nM. Gordon Wolman, Professor and Chairman,<br />\nGeography and Environmental Engineering,<br />\ngraduate 1949<br />\nWEDNESDAY, APRIL 20. 12 NOON<br />\nGarrett Room, Milton S. Eisenhower Library<br />\nFREE ADMISSION<br />\n<br />\nTo bE civEN by<br />\n<br />\nJOHN CHANCELLOR<br />\nSHRIVER HALL AUDITORIUM<br />\nTUESDAY, APRIL 19, 1977 AT 4:00 P.M.<br />\n<br />\n\feditor after<br />\n<br />\n-S•7-<br />\n<br />\n,41<br />\nA.( 'ie.- •<br />\n•<br />\nk<br />\n<br />\nNAT'L MEDICAL BDS.<br />\nFLEX • ECFMG • DAT<br />\n<br />\nI BIRTII<br />\nMC<br />\nAT<br />\nCONTROL&<br />\nwith confidence<br />\noriginal study materials<br />\nsmall groups • tape center<br />\n<br />\nsummer & compact courses<br />\nCALL<br />\n(202)<br />\n244-3010<br />\n<br />\nKA<br />\n<br />\nI<br />\n<br />\nEDUCATIONAL CENTER<br />\n<br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20008<br />\n<br />\nL<br />\n<br />\nr<br />\n<br />\nA1101111011<br />\nSERVICES<br />\n<br />\n;<br />\n<br />\nEducated Beer<br />\nTastes Prefer<br />\n<br />\nI<br />\n<br />\nBECK'S<br />\n<br />\nHILICAEST CLINIC 84<br />\ntAFRVICE<br />\nGaANZ.Ci<br />\nTh<br />\nano<br />\n<br />\nI<br />\n<br />\nIMPORTED BEER<br />\n••••41<br />\n.8<br />\n<br />\n(301)TSB-4400<br />\n<br />\n111111a.mils<br />\n<br />\nNATIONAL BESTSELLER<br />\n<br />\n\"Has already been placed<br />\non many executive<br />\n'must'reading lists:'<br />\n—Time Magazine<br />\n<br />\nBrewed in West<br />\nGermany for<br />\n800 semesters!<br />\n<br />\nEnjoyed in<br />\n140 Countries!<br />\n<br />\npunishment<br />\n<br />\napril 19, 1977/news-letter/page 9<br />\n<br />\n_<br />\n<br />\nTHE WUJS INSTITUTE<br />\nHere's a way for college<br />\ngraduates to experience Israel in<br />\na comprehensive one-year<br />\nstudy/work programme. You<br />\nspend your first 5 months in<br />\nArad, a dynamic new town,<br />\ntogether with other graduates<br />\nfrom all over the world. There<br />\nyou will study Hebrew, Judaica<br />\nand Israeli society, combined<br />\nwith tours and a kibbutz period<br />\nFor the following 7 months or<br />\nmore, you can either work in<br />\nyour profession, volunteer in a<br />\nkibbutz or development town,<br />\nre-train professionally or continue<br />\nstudying. The World Union of<br />\nJewish Student; Institute in Arad<br />\ncould be the beginning of your<br />\nlove affair with Israel.<br />\nIsrael Aliyah Center, 515 Park Avenue,<br />\nNew York, New York 10022,(212) 752-0600<br />\n<br />\nGraduate to Beck's!<br />\nFor information, please send to the above address.<br />\n<br />\nBeer Mug Offer!<br />\n111<br />\n<br />\nTHE NEW CORPORATE LEADERS<br />\n<br />\nAge<br />\n<br />\nlandsome,<br />\nheavy<br />\nBeck's<br />\nBeer Mugs at cry special<br />\nlow price where you buy<br />\nfee1,\": Beer.<br />\n<br />\nCity<br />\n<br />\nImported by Dribeck,<br />\n<br />\nUniversity<br />\n<br />\nN.N'.<br />\n<br />\nin Md. by FA'. %%Inner<br />\n<br />\nby Michael Maccoby<br />\n<br />\nName<br />\n<br />\nW —34<br />\n<br />\nAddress<br />\n<br />\nState<br />\n<br />\nlip<br />\n<br />\n... ...<br />\n<br />\nLiterary Guild Alternate Selection /-::<br />\n<br />\nThis is for the mother, and this is for the father, and this is for the sponsor! -- Soupy Sales<br />\n<br />\nS8.95 • Simon and Schuster ,<br />\n••<br />\n<br />\n•<br />\n—\" • .'\"\\INZN<br />\n<br />\n•<br />\n<br />\n•<br />\ns<br />\n<br />\n•<br />\n<br />\n•<br />\n_^<br />\n<br />\n•<br />\n<br />\nIr<br />\n<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n<br />\nPresented by<br />\nThe Office of Special Events<br />\n<br />\n9<br />\n9<br />\n<br />\nPEABODY AT HOPKINS<br />\n<br />\n9<br />\n<br />\n9<br />\n9<br />\n<br />\nART SONG<br />\nPrepared by Alice Gerstl Duschak<br />\nand sung by her Students<br />\nTHURSDAY, APRIL 21 - 12 NOON<br />\nGarrett Room, Milton S. Eisenhower Library<br />\nFREE ADMISSION<br />\n<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n<br />\nH/ BITS\"<br />\nlleavenlyHash.itsthe<br />\nWatergatestory,piously camped up<br />\nIn a Philadelphia nunnery.<br />\nGlenda Jackson is Nixon,Geraldine Page<br />\nand Anne Jackson are Haldeman and Erlichman,<br />\nAnne Meara is Gerald Ford. Sandy Dennis is<br />\nJohn Dean and Melina Mercouri is Henry Kissinger.<br />\nThey smoke,swear, munch pizza.\" —Rex Reed, Vogue<br />\n\"A biting, black and very witty comedy<br />\nstarring a knuckle of cracking good<br />\nactresses. Glenda Jackson,in the first<br />\ngood role she has had in several years.<br />\nSandy Dennis' characterization is worth<br />\nall of 1976's movies rolled into one<br />\nIntelligent and devastating!\"<br />\n<br />\nThee<br />\noutrageous<br />\ncomedy!<br />\n<br />\n—Liz Smith, Cosmopolitan<br />\n<br />\nairs<br />\nUniversit4 SandvAchShoppe and Deli<br />\nAB Lump Crab Cakes<br />\nGamine Kodsa Corned Beef<br />\nDdicious Roast Beef<br />\nVirsisia Baked Ham<br />\nVarious Cold Cuts<br />\nCheese (Swiss. Provolone. Muesster)<br />\nKoehn Hot Doe<br />\nCalming<br />\nPasty Trays(special olds°<br />\nHome Made Desert (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br />\nPlants<br />\n<br />\nRERTAURANT & CARRY OUT<br />\nPima 4674262<br />\nUNINIEMIIIITY PARKWAY<br />\nPAUL<br />\nAT<br />\n- Fri: 930 - 700<br />\nLOW. UNIVICRIWTY OP APTS.<br />\nSat 930 - 200<br />\nClosed Sandayx<br />\nFREE SODA W 1P-1 THIS A n<br />\nPURCHASE OF S1.00<br />\n<br />\nAND<br />\n<br />\nPure gold...Outrageous and amusing. The screen is set<br />\naglow. Glenda -Jackson is superb. Sandy Dennis steals<br />\nthe<br />\nshow.- —Judsth Crist, Saturday Review<br />\nHigh wit. With Glenda Jackson's normal biting delivery,<br />\nsnobbery achieves perfection. Sandy Dennis' first real<br />\ncrack at screen farce. Wearing big, round specs and<br />\ngrinning like a rabbit, she's John Dean crossed with<br />\nAmy Carter. Everything Anne Meara does is funny. Even<br />\nthose who voted for Nixon may be able to laugh at<br />\nNasty Habits'.\" —Pauline Kael, The New Yorker<br />\nBRUT PRODUCTIONS PRESENTS A GEORGE<br />\n<br />\nBARRIE —ROBERT ENDERS PRODUCTION<br />\n<br />\nGLENDA JACKSON MELINA MERCOURI GERALD<br />\nINE PAGE SANDY DENNIS<br />\nANNE JACKSON ANNE MEARA SUSAN PENHAL<br />\nIGON ;NASTY HABITS\"<br />\nalso vomng<br />\n<br />\nEDITH EVANS as Hiideagorde JERRY STILLER a,PR p,,,<br />\nRIP TORN a, ma,...,,bor, ELI WALLACH as monstignor<br />\n<br />\nMusic by JOHN CAMERON Executive Producer GEORGE<br />\nBARRIE adopted from The Abbess of Crewe by MURIEL<br />\nSPARK<br />\nWritten and Produced by ROBERT ENDERS Directed by<br />\n<br />\nPG PARENTAL GUIDANCE SUGGESTEDI<br />\n,• • kW<br />\n<br />\nROTUNDA CINEMA<br />\n<br />\n•<br />\n<br />\n'.41<br />\n<br />\n..re<br />\n<br />\nWESTVIEW<br />\n<br />\n1.I...Z2r.<br />\n<br />\nMICHAEL LINDSAY-HOGG Color by Technkolor i<br />\ni0\"_YOk_<br />\n<br />\nStarts Friday, April 22<br />\n<br />\n'<br />\n16 BAUT<br />\n<br />\nCINEMA HARUNDALE PERRING<br />\nPLAZA CINEMA VILLAGE1STRAND CAMPUS HILLS<br />\nCINEMA<br />\n4.441<br />\n<br />\n,<br />\n<br />\n'44<br />\n<br />\n•4<br />\n<br />\n•<br />\n<br />\n\fpage 10/news-lettedapril 19, 197e<br />\n<br />\nBy AL DANIELS<br />\nWhile the lax game was, piped into the freshman quad,<br />\nonly those who heardl the contest behind the new<br />\ndorms got to see the real good news made by JHU<br />\nathletes Saturday.<br />\nHopkins new cardiac kids stole both ends of a<br />\ndoubleheader from league rival Ursinus, coming from<br />\nbehind both times to win 4-3 and then 7-6.<br />\nConsistently forcing the visiting Bears from<br />\nCollegeville, Pa. into major blunders, the baseball Blue<br />\nJays benefited from what co-captain Dave Emala called \"a<br />\nwinning attitude we haven't had around here for a long<br />\ntime.\"<br />\nDown 3-0 after the first inning in the opening game the<br />\nJays got on the scoreboard in what would become<br />\nstandard for the day.<br />\nBob Babb jumped on the first pitch in the JH third,<br />\nslugging the team's first hit to left. Despite being forced at<br />\nsecond on the next play, Bob made their second baseman<br />\ntaste a major league slide, and the Bear double play throw<br />\nsailed near the tennis courts, allowing batter John Santo<br />\nto get into scoring position.<br />\nTop hitter Dave Emala then singled him home, but<br />\nEmala was thrown out attempting to stretch his hit into a<br />\ndouble. This was particularly unfortunate as top RBI man<br />\nDave Lewing followed with a double (the lone JHU<br />\nextra-base hit of the game) - a hit that certainly/ would<br />\nhave scored Emala.<br />\nA strikingly similar Jay sixth saw Frank Parreira open<br />\nwith a single followed by a clutch two-strike single by<br />\nBobby McCoy after the bunt sign was taken off. Frank<br />\n;tole third before a Mike April walk which loaded the<br />\nbases and set the stage for the Bears' most pathetic play<br />\nof the day.<br />\n<br />\nCatcher Ricky Law sent a foul pop to the first base<br />\nside, and, instead of running the ball in after he caught it,<br />\nthe Ursinus first bagger heaved what looked like a decent<br />\njavelin throw towards Griffin doBoth Parreira and McCoy<br />\nscored, tying the game, forcing it into extra frames.<br />\nIn the third extra inning, Emala reached on an error,<br />\nwent to second on another crazy Bear overthrow and was<br />\nsacrificed to third by cleanup hitter Lewing's clutch bunt.<br />\nMike Santo then squeezed Dave home with an excellent<br />\ngame-winning bunt.<br />\nWhile the offense was playing heads-up ball, game<br />\nwinning pitcher sophomore Steffan \"Three Finger\" Bums<br />\nwas no \"slouch\" either. He pitched the full ten innings,<br />\nfacing 36 batters,while giving up only one walk, yielding<br />\nonly one hit in the last five innings and picking up his<br />\nsecond victory/without a loss.<br />\nThe loyal and good sized crowd was ready in the<br />\nsecond game for thel Jays to go out and demolish the<br />\nBears early, but once again the cardiac kids yielded a<br />\nbunch of runs in the first frame.<br />\nWith little support behind him in the field and/with<br />\nseemingly no anger in hi s pitches, Jay starter and smoke<br />\nthrower Charlie Lachenbruch was wild and gave way to<br />\niron man reliver Mike Santo in the first inning.<br />\nThe Jay scoring began in the second and capitalized<br />\nagain on Ursinus throws which had little written on them<br />\nbut good distance and ,not the pockets of their<br />\nteammates' gloves.<br />\nIn the third, Emala wound up on third after a passed<br />\nball on ball four. The struggling Bears weren't helped<br />\nwhen Lewing singled \"Ern\" home.<br />\nSimilar happenings occurred in the fourth frame.<br />\nParreira reached first on an error. McCoy sacrificed him to<br />\nsecond and April knoc ad Frank home. Lawgot April<br />\n<br />\nassifiedsclassifiedsclassifiedsclassifiedsclassifiedsclassifiedsclassifieds<br />\nQuality<br />\n<br />\nTyping 467-0342.<br />\n<br />\n1SRANISH by expesienced nati<br />\nteachers • All levels, all ages.<br />\n, 366-2056.<br />\nEUROPE- '77 No Frills Charters 4<br />\nGLOBAL TRAVEL, 521 Fitt<br />\nA t.e., N.Y.,N.Y.,1 0 0 1<br />\n212-379-3532.<br />\nk<br />\n<br />\nI<br />\n<br />\nTwo students want to take care of<br />\nvacationer's home during the<br />\nsummer months Ca11:366-5286.<br />\nCarpenters needed for rennovation<br />\nFree Room. Call 332-1110.<br />\n<br />\nPree Room w/ semi-private bath in<br />\nexchange for light housekeeping &<br />\ncouple evenings babysitting. within<br />\nfive minutes drive. Call 332-1110.<br />\nFemale preferred.<br />\nSuffering from mal tuition? Need<br />\nextra income part-time? Looking<br />\nfor carreer? In 2-5 years earn<br />\napprox. $2,500/mo. Call of write<br />\nfor interview. Hunt Valley<br />\nInternational, Inc., P.O. Box 56,<br />\nOwings Mills, Maryland<br />\n301-356-4688. Resumes accepted.<br />\n<br />\nhome when his shot to the infield was juggled by the Bear<br />\ndefense.<br />\nParreira singled two more runs home in the fifth and in<br />\nthe decisive sixth Dave Lewing singled in the w inning run<br />\non a blast to right field.<br />\nThe tenacious Blue Jays next take to their field directly<br />\nbehind the new dorms today at 1:30 pm with non-league<br />\nrival UM-Eastern Shore the opposition.<br />\nThe team will squeeze plenty of action into the t in<br />\nbill. As far as excitement goes, expect nothing but the<br />\nmost as we don't call 'em the cardiac kids for nothing.<br />\n,,pro<br />\n<br />\n.<br />\n<br />\n.1<br />\n<br />\nO<br />\n,<br />\n.<br />\n<br />\n?:4<br />\n<br />\nEIDAE1<br />\nDIMOM<br />\nJT<br />\n<br />\nmumvErz<br />\n<br />\n•<br />\nThe Department of Urban Affairs at Hunter College<br />\nof the City University of New York offers a two-year,<br />\n60-credit program leading to a MASTER OF URBAN<br />\nPLANNING degree.<br />\nAction oriented, Hunter's program grapples with<br />\nsocial and economic problems and explores the<br />\nareas of housing, transportation, environmental and<br />\nhealth care planning.<br />\nFieldwork opportunities abound—in city and<br />\nsuburban planning agencies, In neighborhood<br />\ngroups, in community development organizations.<br />\nRequirements are flexible and an able, diverse,<br />\n'and experienced faculty is ready to add guidance<br />\nand direction to student goals.<br />\nExtensive financial aid is available. Current costs<br />\nare $750 a secnester for City residents and $1,000<br />\nfor non-City Residents, plus activity fees.<br />\nFor more Information and admission applications<br />\nwrite: Director, Graduate Program in Urban Planning, Hunter College/C.U.N.Y., 790 Madison Avenue, New York, N.Y. 10021-(212)57G5594.<br />\n<br />\nAdd a new international<br />\ndimension to your<br />\ncollege career with a<br />\n<br />\nWRITE FOR FILMS<br />\nAND TELEVISION!<br />\n<br />\nSEMESTER<br />\nAT SEA<br />\nThe S.S. Universe sails<br />\nFeb. 25, 1978, on a<br />\nround-the-World<br />\nvoyage. Join us.<br />\n<br />\n•Experienced professionals<br />\n* Valuable industry contacts<br />\n•Editorial and marketing aid<br />\n<br />\nFREE COLOR VIE WBOOK<br />\n<br />\nWrite or phone INSTITUTE<br />\nFOR SHIPBOARD<br />\nEDUCATION,Taj Mahal<br />\nBldg., P.O. Box 2488, Laguna<br />\nHills CA 92653.(714)581-6770<br />\nAttn: UG Division<br />\n<br />\nAcademically affiliated with<br />\nthe Uniuersity of Colorado<br />\nThe S.S. Universe is<br />\nregistered in Liberia<br />\n<br />\n•Do not send manuscripts<br />\n•For information, write<br />\nSCREEN WRITERS SERVICE<br />\n2064 Alameda Padre Serra<br />\nSanta Barbara, CA 93103<br />\n<br />\n1<br />\n<br />\n\fI april 19, 1977/news-letter/page 11<br />\n<br />\nLaxers lose<br />\nheartbreaker•<br />\nCornell ekes<br />\nout victory<br />\n•<br />\n<br />\n1<br />\n<br />\nSaturday ,.afternoon, some 15,000-plus lacrosse fans<br />\nconverged on Schoelkopf Field in Ithaca, New York, to<br />\nview the kind of excitement that they hoped the top two<br />\nteams in the country could generate. They weren't<br />\ndisappointed.<br />\nThe Big Red of Cornell staged an inspired second half<br />\ncomeback to nip the Blue Jays 12-11, thus preserving<br />\nCornell's top ranking and extending the Big Red's two<br />\nyear winning streak to 20 consecutive victories.<br />\nFor Hopkins, the loss was a bitter one to accept. The<br />\nJays led throughout most of the game and had even held a<br />\n7-1 advantage late in the first half. Howeifer, JHU could<br />\nnot stop the Cornell onslaught and now finds itself in the<br />\nnumber 3 position in the Coaches Poll, trailing both<br />\nCornell and Maryland.<br />\nDespite the Big Red second half rally, the game Nvas<br />\nlost by Hopkins during the first thirty minutes of play.<br />\nFor although JHU held a 7- 91ead at intermission , the<br />\nBlue Jays had -missed numerous scoring opportunities in<br />\nthe first two periods- chances which, if converted into<br />\ngoals, would probably have negated the Cornell third<br />\nperiod comeback.<br />\nWhile the offense sputtered through much of the first<br />\nhalf, the Hopkins defense performed brilliantly. Led by a<br />\nsupreme effort from goalie Kevin Mahon, the JHU<br />\nbackline totally stymied the home team offense, enabling<br />\nthe large halftime lead to be amassed.<br />\nHopkins midfielder Dave Huntley started the Jays off<br />\non the proper foot in the opening quarter. The<br />\nsophomore from Canada rifled home the game's first two<br />\ngoals to give the Homewood stickmen a quick 2-0 lead.<br />\nFreshman Frank Cutrone added a score late in the period<br />\nto give JHU a 3-0 advantage after fifteen minutes of play.<br />\nThe style of play continued unchanged throughout<br />\nmost of the second quarter. The dominant factor was the<br />\nJay defense, a unit that. ept the Big REd at bay most of<br />\nthe period.<br />\nHopkins middie Wayne Davis scored to give JHU a 4-0<br />\nlead early in the quarter. Cornell got onto the scoreboard<br />\nseveral minutes later, but JHU's Scott Baugher, Mike<br />\nO'Neill and George Johnson fired home unanswered goals<br />\nto up the lead to 7-1.<br />\n<br />\npair of goals to gain an 8-L :tie after forty-five minutes of<br />\nplay.<br />\nThe Jays, however, regained their composure for the<br />\nstart of the final period. Midfielder Steve Wey opened the<br />\nscoring in the fourth quarter, giving JHU a 9-8 lead.<br />\nUnfortunately, Cornell was not to be stopped. They<br />\nquickly tied the game and, after Wayne Davis put JHU up<br />\n10-9, took control of the contest. The Big Red whipped<br />\ndiree gOals past the beleaguered Jay defense to establish a<br />\n12-1- lead with less than two minutes'to play.<br />\nThe Jays, however, refused to die and provided an<br />\nexciting climax to the afternoon. Mike O'Neill culminated<br />\na fast break with forty seconds remainingw ith his second<br />\ngoal of the afternoon. JHU's Bob Maimone won the<br />\nensuing face-off (he won 19 of 22-on the afternoon!), but<br />\nthe Jays could not get off a good shot and time ran out.<br />\n\"We're young and we're getting better,\" Ciccarone<br />\ncommented. \"We lost a game and that was extremely<br />\ndisappointing, but I still like our chances to be in<br />\nCharlottesville (site of this year's NCAA championship<br />\ngame).\"<br />\nThe Jays face Brown this Saturday afternoon on<br />\nHomewood field beginning at 2:00. Hopkins will be<br />\nwithout the services of tri-captain Tom Myrick / ho<br />\ninjured his right knee during the third quarter of<br />\nSaturday's game. The extent of the injury is still<br />\nunknown, but the senior from Towson will probably be<br />\nlost to the team for at least three weeks.<br />\n<br />\n-414,<br />\nThe Big Red cut the margin to 7- Rvith less than half a<br />\nminute remaini::sr!<br />\n- in the half, but the intermission was<br />\nstill a happy time, for the Blue Jay faithful/ hh visions of<br />\na number one ranking dancing in their heads.<br />\nThe situation changed drastically, however, as play got<br />\nunderway in the third quarter. Cornell began to solve the<br />\nriddle of the Blue Jay defense that had stumped them so<br />\nthoroughly in the first half, while the Hopkins offense<br />\ngrinded to a halt.<br />\nThe teams traded goals to open the period, but the Big<br />\nRed then began to assert itself. Cornell tallied a pair of<br />\nunanswered scores to bring the count to 8-5 midway<br />\nthrough the period.<br />\nDuring the next series of plays, Jay middie Bob<br />\nDeSimone picked up an errant ball in his defensive zone<br />\nand began a fast break. A perfect pass to O'Neill deep in<br />\nthe Cornell zone set Mike up one-on-one with the goalie.<br />\nHowever, the shot hit the top pipe and the deep rebound<br />\nwas taken by a Big Red midfielder, who started a break in<br />\nthe opposite direction - an opportunity that culminated in<br />\na Cornell goal.<br />\nFollowing the game, JHU head Coach Henry Ciccarone<br />\npointed to that series of plays as a turning point in the<br />\ngame.<br />\n\"If Mike scores, we're up 9-5 and have some of the<br />\nmomentum,\" the Coach explained. \"Instead, it's now 8-6<br />\nand they (Cornell) still have the momentum.\"<br />\nThe Big Red continued their charge and added another<br />\n<br />\nNetmen smash their way to Success<br />\nBy ANDREW COHEN<br />\nThe Blue Jays Men's Tennis Team continued their<br />\nsmashing success by demolishing the University of<br />\nMaryland in Baltimore last Friday afternoon by the score<br />\nof 8-1 at the downtown campus.<br />\nThe Jay victory, coupled with their 9-0 drubbing of<br />\nWidener College at home earlier in the week, lifted their<br />\nseason record to .500 at 4-4. Both games were highlighted<br />\nwith ,strong performances from the singles and doubles<br />\ncorps.<br />\nAgainst Widener every one of the nine matches, bar<br />\none, went to the Blue Jays in straight sets. AT first<br />\nsingles, Ken Vogelstein took his Widener opponent<br />\nhandily 6-3 and 6-1. In the second slot, Kevin Little<br />\ncrushed his adversary 6-0, 6-2 while Mike Mont, third<br />\nsingles player, whipped the Widener third man, 6-2, 6-0.<br />\nSenior Captain Chuck McCulloch handed Widener its<br />\nmost embarassing defeat of the day when he annihilated<br />\nhis opponent 6-0, 6-0. Jeremy Levin and Ken Feinberg,<br />\nfifth and sixth singles players respectively, switched roles<br />\nfor this game, with Feinberg taking his match 6-3, 6-4 and<br />\nLevin going to three games before coming up the winner<br />\nat 64,2-6, and 6-3.<br />\nIn the doubles column the only real contest saw the<br />\nfirst team of Little and Mont edge out their opponents in<br />\nstraight sets 7-5, 6-4. Vogelstein and McCulloch easily<br />\ntook the second position by winning 6-1 and 6-0.<br />\nSophomore Mike Grohol replaced Levin in the third<br />\ndoubles spot and along with Feinberg defeated Widener<br />\n6-3, 6-4.<br />\nThe UMBC match was quite as impresive as the earlier<br />\ncontest. On this occasion, though, Mont was unable to<br />\nPlay so Grohol was called upon to fill the sixth singles<br />\nvacancy and everyone from McCulloch down moved up a<br />\nstep on the ladder. Vogelstein and Little were easy<br />\nIvrinners in their regular spots with scores of 6-3, 6-2, and<br />\n6-1, 6-3, respectively. McCulloch, Levin and Feinberg, all<br />\nin their new positions, also chalked up victories by<br />\n<br />\nrespective scores of 6-1,.7-5; 6-1, 6-1; and 6-3, 6-4. The<br />\nonly loss the Jays suffered in the contests came when<br />\nGrohol dropped his match in straight sets 6-4,64.<br />\nAgain, the Jay tennis bums swept the doubles portion<br />\nof the game. This time, though, Coach Bob Hughes<br />\nshuffled up his team play lineup. This strategic move<br />\nproved effective as Vogelstein and McCulloch, elevated to<br />\nthe first slot, Little and Levin, and Feinberg and Grohol<br />\ntook their matches 6-1, 2-6, 6-4; 6-1, 64; and 64, 6-0,<br />\nrespectively.<br />\nThese two huge victories seemed to amply make up for<br />\nthe two disappointing losses the Blue Jays were handed<br />\ntwo weeks ago. On April 8, the team traveled to<br />\nWashington, D.C. to face Catholic University.<br />\nUnfortunately, the Jays had to forfeit the second doubles<br />\nmatch and the third doubles contest fell by the wayside<br />\n<br />\ndue. t dar ness. McCulloch and Feinberg in singles, and<br />\nthe doubles tandem of Little and Mont were the, only<br />\nvictorious netmen. The scores read 4-6, 7-6,64;6-3,6-0;<br />\nand 64,6-3, respectively.<br />\nA powerful Towson State club whipped th Jays Here<br />\non April 11 by the count of 8-1. On this occasion Little<br />\nand Mont were team victors with a 64,64 score.<br />\nIndividually<br />\neinberg tops the team with a ; -'4<br />\nsingles record with Little and McCulloch just behind<br />\nsporting 4-5 records. The doubles duo of McCulloch and<br />\nVogelstein rate number one for the Jays in that category<br />\nwith a 4-2 showing.<br />\nThe Blue Jays next home match will ta 6 place this<br />\nThursday when the team faces MAC rival Ursinus College.<br />\nThe context is set to get underway at 3 pm on the tennis<br />\ncourts behind the new dorms.<br />\n<br />\nbermuda sports shorts<br />\nA new exercise activity has been opened by the<br />\nAthletic Department.<br />\nIt is called a \"circuit course,\" is located in the old<br />\nping-pong room in the lower front hall of the Athletic<br />\nCenter, and is designed primarily for those of any age and<br />\neither sex who want a simple, consistent, non-organized<br />\narrangement by/ hich they can wor out to improve their<br />\nphysical condition in a minimum of time.<br />\nIt requires no prior lcnowlege or experience in athletics.<br />\nor physical training, uses simple calisthenic-type exercises,<br />\nand can be carried out at any intensity the user prefers.<br />\nThe instructions are self-explanatory, so that no formal.<br />\ninstruction is needed to begin, and users can go through<br />\nthe course at their own convenienced rather than in an<br />\norganized class arrangement.<br />\nStudents and faculty are being invited to examine \\the<br />\ncirduit course to see if it provides a simple but effective<br />\nmethod for \"getting in shape\" with a minimum of ,time<br />\n<br />\nspent each week. If anyone has questions or problems<br />\nabout this circuit course, or anything else about their<br />\npersonal physical activity program, please see Mr. Turner<br />\nOn the Links: (Apr. 15) The inaugural edition of the<br />\nHutzler Open was won by Peter Bigharn with a startling<br />\nquadruple-carom shot that landed flush against the pin at<br />\ntheJohn Wisneski and the Rainbow Kid, who immediately<br />\ndecided to disband the tournament on that note and go<br />\nout for a few beers.<br />\nThe Hopkins Women's Lacrosse team garnered its<br />\nsecond victory of the seasen, whipping the Georgetown<br />\nHoyas 104 Friday afternoon. The Jays are back in<br />\naction<br />\nthis Thursday afternoon as they host Goucher College.<br />\nGame time on Garland Field is 4:00.<br />\n<br />\n\fTHE EOPLE<br />\nWho are the people? Why, they're the Tuesday News-Letter's staff members and their friends-,' As one can see, morale is unusually high<br />\non the Tuesday News-Letter. We're proud of our 449 voting members. (If you thought this picturevwas a waste of space, then you get the<br />\nidea of this whole issue--- seriously, folks, this shot is a godsend compared to the \"articles\" cranked out by Messrs. DeSmith and<br />\nRaphaels6n which at one time or another were respectively destined to nestle on this, the \"back page.\"<br />\n<br />\n\f", "format": "basic_html", "processed": "#40<br /><br />\n•<br /><br />\nNEWS-LETTER<br /><br />\n•<br /><br />\nvol. lxxxi. no. 16/tuesdav, aril 19.1977/baltrinore.,marvland/81st year<br />\n-<br /><br />\n\"Fly me to the Moon\"<br />\n--Professor Wayman Scott<br />\nBy MARK SHUSTED<br />\nProfessor Wayman Scott, an accomplished member of<br />\nboth the Hopkins' faculty and the Baltimore City School<br />\nBoard, is one of the-most well-known and popular men on<br />\ncampus.<br />\n.The first black appointed to Hopkins' faculty,<br />\nProfessor Scott holds a doctorate in fluid dynamics and is<br />\na part-time professor in the department of Earth and<br />\nPlanetary Sciences. Furthermore, the professor, who is<br />\n51, has recently started his second term on the 13altimor<br />\nCity Board of Education.<br />\nBorn ,and raised in Oberlin, Ohio, Dr. Scott went to<br />\nOberlin College and received his Ph.D. at Hopkins: \"Like<br />\nmost blacks, I viewed education as a means to an end, the<br />\nend being getting a job -- so I figured if I could major in<br />\nthe most difficult course in the curriculum I could get a<br />\njob. The most difficult course was physics, so I majored in<br />\nphysics in college and got a Master's degree in it, and for<br />\nme the most difficult part of physics was fluid dynamics,<br />\nso I got a Ph. D. in that.\"<br />\nBefore arriving at Johns Hopkins, Professor Scott<br />\ntaught at several state colleges and, as a result, his opinion<br />\nof the students here is high: \"I've spent a lot of time<br />\nteaching in state institutions, schools where if you<br />\ngraduated from high school you could get admitted. I've<br />\nhad students in the college classes who couldn't read or<br />\nwrite; so I am tremendously impressed with the Hopkins'<br />\nstudents, maybe too impressed, because of my having<br />\ntaught so much in the other schools. The students here<br />\nare outstanding.\"<br />\nMany of the non science-oriented students here are<br />\nfamiliar with Dr. Scott through his teaching of the<br />\nintroductory ..course, Astronomy and the Solar System.<br />\n(Commonly called Astrogut.) According to the Professor,<br />\nhis interest in astronomy was not accidental, but instead<br />\nresulted from his previous work in fluid dynamics: \"The<br />\ncore of the earth and some of the other planets is fluid,<br />\nand it is those fluid dynamical processes that give rise, so<br />\nthe theory says, to the magnetic fields of the earth and<br />\nthe planets. So I had a chance to apply my knowledge of<br />\nfluid dynamics to an astronomical problem, and thus I<br />\nbecame interested in astronomy.\"<br /><br />\nHowever, because Dr. Scott employs a flamboyant<br />\nlecture style and is prone to the unearthing of<br />\nlittle-known iaformation, wary students often question<br />\nthe factual basis of the lectures. To these complaints the<br />\nProfessor replies: \"I have read, I think, every astronomy<br />\ntext in existence, and with that kind of background it is<br />\nwry easy to prepare the kind of lectures that I do.\"<br /><br />\nProfessor Scott finds satisfaction in helping to formulate<br />\nthe policies of the Baltimoe City School Board, a body to<br />\nwhich he was recently renominated. by Mayor Schaefer.<br />\nThe Board, however, far from ensuring that the public<br />\nschools are as good as they can be, has had difficulties<br />\nmaintaining high standards of excellence in education in<br /><br />\nrecent years.<br />\n\"No, the schools are not as good as they should be, but<br />\nthis Board is going to make them better,\" declared Dr.<br />\nScott. \"I think that I helped change the Board's thinking<br />\n.-- that we should return to the basics in education. Let's<br />\nemphasize the fact that the youngsters must learn to read<br />\nand write -- that wasn't the emphasis four or five years<br />\nago.\"<br />\nDr. Scott's concern for education is by no means<br />\nlimited to the Board, for he has been active in attempts to<br />\nexpand and diversify the educational opportunities at<br />\nHopkins. Despite these efforts, he still feels that many of<br />\nthe students do not ta c advantage of the widening<br />\ncurriculum.<br />\n\"I am somewhat concerned with the tendency of the<br />\nstudents to specialize, hut that may be necessary. I do<br />\nthink the students could be a little more well-rounded<br />\nthan they are, but that's going to require more time, and<br />\nthe time is not available.<br />\n\"I did agree sonic years ago with the student<br />\ncontention that the undergraduate program As not-as<br />\nbroad as it should have been, but there's been a lot of<br />\nimprovement in that area and maybe we can see some<br />\nmore. That is, there weren't enough courses being offered,<br />\non the undergraduate level. There are more now, but I am<br />\nnot-quite sure if there are enough.\"<br />\nOf course, Professor Scott realizes that mere expansion<br />\nof the undergraduate curriculum will not guarantee<br />\nwell-rounded students, and that .the ultimate aim of the<br />\nbulk of the students to reach graduate schools limits the<br />\nvariety of courses one can take. \"I think the solution is<br />\ngoing to lie with the medical schools and the graduate<br />\nschools, and as long as spaces are limited, you're going to<br />\nhave to have this kind of competition.\"<br />\nAlthough these conditions may be harmful in some<br />\nrespects, Professor Scott feels that, overall, receiving one's<br />\neducation at Hopkins is a worthwhile experience. \"I think<br />\nwe are producing well-educated graduates. I believe the<br />\ngraduate here knows something when he le;ivcs. The goal<br />\nof Hopkins is what it has always been, and that is to make<br />\na contribution to society -- Hopkins has done that and iF<br />\ncontinuing to do that.\"<br /><br />\nINSIDE THIS ISSUE<br />\nAdministrators do theVarsity Rag p.3<br />\nChesanow's Declaration of Principles p.6<br /><br />\npage 2/news-letter/april 19, 1977<br />\nThe Clydesdale horses will appear at the Johns Hopkins<br />\nHospital May 13 and volunteers are needed to solicit the crowds<br />\nfor donations. If you can serve, please contact the Johns Hopkins<br />\nChildren's Center Development Office at 955-8767 or 955- 768.<br />\nHear ye, hear ye, all ye lovers of dogs! There will be a dog show<br />\nat the Spring Fair on Sunday, April 24, at 2:00 PM. Get your<br />\napplications in the Office of the Chaplain in Levering Hall. The<br />\ndeadline for applications is 1:59 PM on Sunday. Certificates will<br />\nbe awarded to participants, and ribbons to the winners of all<br />\ncategories. For more information, call exts. 8188, 8189 or 8190.<br /><br />\nOne Act Plays! Friday and Saturday, April 22 and 23, at 8 PM<br />\nin the Little Theatre of Levering Hall. Free admission.<br />\nThe BIA is seeking new members. Applications, available in the<br />\ngym office, will be accepted through April 27. Interviewsv id be<br />\non April 28. Also, non-varsity letter winners who have contributed<br />\nto the Hopkins athletic program are now being considered for the<br />\nG. V Lon Shaffer Award. Nominations, available in the gym<br />\noffice, are due April 29. For details, call 243- S05.<br />\nI would like to borrow a September 1976 issue of Ms. magazine<br />\nfor reference for a research paper. If you have one, call 889-8113<br />\nor drop a note in box 466.<br />\nAnyone who has been involved with the men's varsity, JV, or<br />\nfreshman fencing programs at any time during the history of the<br />\nUniversity is asked to contact the Alumnix Fencing Association<br />\nc/o Mr. John Austin, 1222 Deanwood Rd., Baltimore, Maryland<br />\n21234 (work 301-296-1434, home 296-0209.)<br />\nAnyone who has been involved with the men's varsity, JV, or<br />\nfreshman fencing programs is asked to contact- the Alumni<br />\nFencing Association c/o Mr. John Austin, 1222 Deanwood Rd!,<br />\nBaltimore, Md. 21234 (wprk 30U 9%4434, home 296-0209.)<br /><br />\nThe Science and Society Discussion Group will meet on<br />\nThursday, April 2 lt 7:30 PM in Conference Rm B, Levering. Dr.<br />\nR.K. Hunt of the Biophysics Dept. will discuss 'Catastrophe<br />\nTheory and Its Relation to Biological Concepts'. Readings are onx<br />\nreserve in the library. All interested students and especially<br />\nfreshmen are encouraved to attend.<br />\nAttention sophomores. Anyone interested in working at the<br />\nsophomore class ice cream booth during Spring Fair weekend<br />\nplease contact Ross Heisman as soom as possible a 366-5610 or<br />\nbox 254.<br />\nThere will be a meeting of the Hopkins Christian Fellows<br />\nthis Thursday, April 21,<br />\nat 7:00 PM in Conference<br />\nRoom A, Levering Hall.<br /><br />\nThe Canterbury Film Board will present the film Dirty Harry<br />\non Friday, April 22, in Remsen 1 at 7:30, 9:30 and 12:00<br />\nmidnight. Admission is $1.00.<br />\nA simultaneous chess exhibitionx will be held in the Rathskellar<br />\nSaturday night, April 23, starting at 9:00 PM. All winners receive<br />\na free pitcher of beer!<br />\nDomestic Investment will be the topic of a lecture by Merrill<br />\nLynch representative Timothy Clark tonight, April 19, at 7:30 PM<br />\nin the Mary Fisher Lounge at Goucher College. Refreshments will<br />\nbe served. The lecture is sponsored by AISEC-Goucher/Hopkins.<br />\nThe JHU Gay Caucus will meet tonight, Tuesday, April 19, at<br />\n8:30 PM in Conference Room B. Among topics to be considered<br />\nwill be the Spring Fair and a forthcoming dance. For more<br />\ninformation, call 366-0488.<br /><br />\nall the young<br />\nnotes<br /><br />\nThe Mayor's Fellowship Program is accepting applications now<br />\nfor next semester. The program is a six-credit course in which<br />\nstudents work at least 12 hours per week in an urban planning,<br />\nadministration, law or other agency. The work in the agencies is<br />\ncomplemented by a weekly seminar. Interested undergraduates<br />\nshould call Bob Seidel at extension 7168 or come directly to<br />\nMetrocenter Complex D in the basement of Shriver Hall to pick<br />\nup an application.<br /><br />\nComing events on the Homewood campus presented by the<br />\nOffice of Special Events:<br />\nApril 19. The Frank R. Kent Memorial Lecture by John<br />\nChancellor, Shriver Hall Auditorium, 4:00 PM. No admission<br />\ncharge.<br />\n•<br />\nApril 20. Wednesday Noon Series: \"I Remember Hopkins When<br />\n.. .\" Johns Hopkins faculty reminisce about their student days at<br />\nJHU. Francis Carlson, Professor, Biophysics, graduate 1942;<br />\nMatthew Crenson, Professor, Political Science, graduate 1963;<br />\nJohn Higham, Professor, History, graduate 1941; Richard<br />\nMacksey, Professor and Chairman, Humanities Center, graduate<br />\n19 -7; and M. Gordon Wolman, Professor and Chairman,<br />\nGeography and Environmental Engineering, graduate 1949.<br />\nGarrett Room, MSE Library, 12 noon. No admission charge.<br />\nApril 21. Peabody At Hopkins: \"Art Song\", prepared by Alice<br />\nGerstl Duschak and sung by her students. Garrett Room, MSE<br />\nLibrary, 12 noon. No admission charge.-<br /><br />\nOn Tuesday, April 26 a representative from the Hurricane<br />\nIsland Outward Bound School will show a film about the school.<br />\nA question and answer period will follow.x Credits are available to<br />\nschool participants. The meeting is at 8:00 PM in the Little<br />\nTheatre, Levering Hall.<br />\nChester's Place and the Writing Seminars is sponsoring another<br />\ncharming evening of live music, poetry and fiction this Wednesday<br />\nfrom 7:30 PM until 12:30 AM. Lee Mellick will read poetry and<br />\nMoira Crone fiction. Be it known that there is a 25 cent admission<br />\ncharge after 9:00. Refreshments will of course include beer, wine,<br />\ncoffee and tea, soda, cheese, assorted nuts, and fruit.<br /><br />\nEXCLUSIVE OFFER!!!<br />\nBuy fifty shares of<br />\nn-1 unlimited (preferred)<br />\nand receive free<br />\na copy of<br />\n'Faces in the News'<br />\n(CPS)-- What's an ex-President of the United States to<br />\ndo? It can get boring while still in a transitional stage,<br />\neven if your pension is near the hundred grand mark and a<br />\nton of golfing invitations flood your Secret<br />\nService-protected office every day.<br />\nFor Gerry Ford, the answer to escape that boredom is<br />\nto hit the always lucrative lecture circuit. Ford has kicked<br />\noff his series of \"informal\" visits to college campuses<br />\naround the country w ith a stop at his alma mater, Yale<br />\nUniversity. He had started his law studies there 42<br />\nyears-ago after a fair-to-middling scholastic record and a<br />\ndistinguished football career at the University of<br />\nMichigan. At Yale he coached the football team and<br />\neventually talked his way into the law school.<br />\nFord spoke to several classes, touching upon a wide<br />\nrange of topics with a guarded opinion. He said that one,<br />\nof his more regrettable decisions as president was not to<br />\ninvite the Russian dissident-exile, Aleksandr I.<br />\nSolzhenitsyn, to the White House in 1975.<br />\nTo further ease his retirement days, Ford has also been<br />\nappointed as an adjunct professor of political science at<br />\nthe U. of Michigan for the next winter term. He'll be on<br />\nthat campus for one or twol tek periods this calendar<br />\nyear while his teaching schedule is being worked out on a<br />\nmore permanent basis. Maybe he'll achieve the tenure he<br />\nmissed in November.<br />\n(CPS)-- Tired of that same old campus, smugly<br />\nlandlocked as it is in its traditions and too-familiar faces?<br />\nFor a $4,300 outlay, frustrated student adventurers,<br />\nacademically-oriented boatswains, collegiate shuffleboard<br />\nchampions, and campus Captain Piscums can sail the<br />\nseven seas aboard the SS Universe Campus, a 10,000-ton<br />\nship which houses classrooms, labs, a 10,000-volume<br />\nlibrary, a theater,. a hospital, a bookstore, and a student<br />\nunion. The ship is also equipped with the traditional<br />\nswimming pool and sports and sun decks.<br />\nThe three-month trip, which begins in Los Angeles May<br />\n25, offers a full range of college courses and credit. The<br />\nship will carry its 60 student voyagers t,o stopovers in<br />\nports in the North Pacific, the Indian Ocean, the Suez<br />\nCanal, and the Mediterranean Sea, and will complete the<br />\nexcursion by steaming up the Chesapeake to Baltimore.<br />\n\"The whole point is that it's really a consuming thing,\"<br />\nsays Phil Sonnichson of the Institute for Shipboard<br />\nEducation, which together with the . University<br /><br />\nColorado runs the program. \"You get off the boat<br />\nentirely drained.\"<br /><br />\nAll the<br />\nCPS Shorts<br />\nYou Can Eat<br /><br />\n(CPS)-- Admitting that speculation about futuhil<br />\ndevelopment in space is \"a very scary process,\" an<br />\naccomplished physicist and aerospace professor has<br />\nsuggested that a space community could be established,<br />\nequidistant from the earth and moon, by the 1990's.<br />\nGerard K. O'Neill of Princeton University has written a<br />\nbook exploring, through scientific and technological<br />\nknow-how, the \"possibilities\" of space development The<br />\nbook, The High 'Frontier: Human Colonies in Space<br />\n(Morrow, $8.95), is filled with enough well-documented<br />\nideas to make even Spock and Captain Kirk dancer ith<br />\nglee.<br /><br />\n•<br /><br />\nO'Neill believes that thousands of earthlings now alive<br />\nwould be able to live and work in space, in an \"island\"<br />\nspace colony located in orbit around the moon. In the<br />\nbook, O'Neill says that personal living conditions in space<br />\nshould be at least as aesirable and healthful as the most<br />\nfavorable areas on earth - more healthful, in' fact, for<br />\npeople with heart troubles and for elderly persons/ ho<br />\nwould find movement far easier in low-gravity space.<br />\nAll this could be achieved right now by using this<br />\ndecade's technological abilities, O'Neill writes.<br />\nOf special concern to our energy-strapped world is the<br />\nprofessor's notion that the space colonyi ould send to<br />\nearth, via microwave, unlimited supplies of solar power.<br />\nEnough, the author offers, tO ma conventional power<br />\nsources obsolete.<br />\nThe book does not avoid one's potential for good and<br />\nevil, no matter here one lives. However, the Cornell<br />\ngraduate and Jerome Clarke Hunsa or Professor of<br />\nAerospace declares, \"there seems good reason to believe<br />\nthat openingsthe door into space can improve the human<br />\ncondition on earth.\"<br /><br />\n(CPS)-- In a landmark decison, one of the toughest<br />\nstate fair political practices laws/ as relaxed this year to<br />\nallow minimum disclosures by Communist candidates<br />\nrunning for public office.<br />\nThe California la,said to be one of the nation's most<br />\nstringest political reform packages, requires all candidates<br />\nand campaign committees to complete periodical reports<br />\nrevealing the sources, dates, and amounts of campaign<br />\ncontributions.<br />\nBut, because of potential FBI harassment, employer<br />\nreprisals, citizen violence and a chilling effect on* fund<br />\nraising, candidates running on Communist tickets in<br />\nCalifornia no longer have to report the identities,<br />\noccupations, or addresses of contributors donating<br />\nbetween $50 and $1,000.<br />\nCommunist candidates for public office- ill have to<br />\nreport complete information on contributors of over<br />\n$1,000. And for those in the $50 to 81,000 category only<br />\nthe dates and amounts of the contributions/v' ill have to<br />\nbe disclosed.<br />\nThe recent California Fair Political Practices<br />\nCommission ruling is thought to be the first of its type,<br />\nthe Los Angeles Times said.<br /><br />\n!ap-ril 19, 1977/news-Itter/pagel3<br /><br />\nPrez Muller shuffles deck;<br />\nV.P.s no longer<br />\n'heartbeat away'<br />\nBy ROBERT RIGGS<br />\nA major high-level reorganization of the administration<br />\nof the Johns Hopkins Institutions was disclosed by<br />\nUniversity President Stephen Muller. Of five existing vicepresidencies, one will be created, three will undergo<br />\nchanges in both title and function, and one will remain<br />\nbasically unchanged.<br />\nThe vice presidencies for the Homewood and Health<br />\nDivisions (Dr. George S. Benton and Dr. Richard S. Ross)<br />\nare being discontinued. The Provost (Dr. Richard<br />\nLongaker) will assume the acade,mic functions previously<br />\nperformed by these two vice-presidencies, including<br />\nsupervision of the MSE Library and the Dean of Students<br />\nOffice. On the organizational chart, the Deans at<br />\nHomewood, SAIS, and East Baltimore will be directly<br />\nresponsible to the Provost rather than these two<br />\nvice-presidencies as they were in the past.<br />\nAdministrative duties performed by these two positions<br />\nwill be transferred to the newly created vice-president for<br />\nAdministrative Services. No candidate has yet been<br />\nselected to fill this office.<br />\nThe incumbent Vice -President for Business<br />\nManagement, Robert C. Bowie, will become<br />\nVice-President for Finance and Management Systems.<br />\nThis post is designed for a staff role, monitoring fiscal and<br />\nmanagement policies within the University. Bowie will<br />\nalso be the principal budget adviser to President Muller.<br />\nAdministrative functions of the old V.P. for Business<br />\nManagement will be transferred to the V.P. for<br />\nAdministrative Services.<br />\nRoss Jones will shift from Vice-President for University<br />\nAffairs to Vice-President for Institutional Affairs, There<br /><br />\nhe will be-,11-ie .senior development and public relations<br />\nofficer of Hopkins institutions. Also, Dr. Richard S. Ross<br />\nwill change his title to Vice-President for Medicine, where<br />\nhe will share in the supervision of the clinical patient-care<br />\nactivities of the Hopkins institutions. He will continue to<br />\nserve as Dean of the Medical Scnool.<br />\nThe fifth vice-presidency will remain unchanged.<br />\nExecutive Vice-President and Director of the Johns.<br />\nHopkins Hospital Dr. Robert M. Heyssel will continue to<br />\ndirect operations of the Hospital.<br />\nThe primary purpose of the reorganization, according<br />\nto President Muller, is to integrate and reaffirm the joint<br />\nPresidency of the University and the Hospital. \"The joint<br />\npresidency of the two institutions has been in effect for<br />\nnearly five years,\" he commented, \"and can be more<br />\neffectively institutionalized.\"<br />\n\"Until now, we have had separate organs for the<br />\nUniversity and for the Hospital,\" he continued.\"When we<br />\nfirst had a joint President, we really didn't know how it<br />\nwould work. I myself, the Boards of Trustees, and my<br />\n\"The job was a mix of academic and non-academic<br />\ncolleagues reached the conclusion around the end of 1975 services,\" posed President Muller as another reason for the<br />\nthat the, joint Presidency should be continued and that termination of the job. \"We're somewhat discontinuing<br />\nwe ought to consider it permanent. In making the change,<br />\ni Resignation Unrelated<br />\nThere is no relation, he added, between Dr. Benton s<br />\nwe decided to get rid of the things that weren't working<br />\nrecent resignation and this reorganization. \"Dr. Benton<br />\nterribly well.\"<br />\ncould have been included in this reorganization,\" he<br />\n?resident Muller cited the discontinued<br />\nvice-presidencies for the Health Divisions and for the stated.<br />\nHomewood Divisions as positions that never realized their<br />\nPlans for the reorganization, which will go into effect<br />\nfull complement of potential functions. \"Dr. Benton was July 1, have been in the works for the past fifteen<br />\nvery effective at Homewood,\" he said, \"but it was hoped<br />\nmonths. They were developed by a seven-man internal<br />\nthat a closer link to SAIS would be formed than what task force, with the assistance of Organization Resource<br />\ndeveloped.\"<br />\nCounselors, Inc., a consulting firm.<br /><br />\nj<br /><br />\n$$$SAC$$$$<br /><br />\nBy GAYLE COHEN<br />\nThe Mardi Gras will come to Homewood this weekend<br />\nin the guise of the Spring Fair. In keeping with the theme,<br />\nfestivities will include a masked ball, jazz music, and a<br />\nkiewe.<br />\nFair chairman Mike Posever explained that Mardi Gras<br />\nwas chosen as the theme \"because it's colorful and there's<br />\na lot of possibility in the lines of entertainment and food<br />\nthat's never been done before.<br />\n\"We're expecting up to 100,000 people. Last year we<br />\nhad 60-80,000. Booth exhibits are another of the fair's staple<br />\nattractions. Posever said, \"This year we've made a specific<br />\neffort to upgrade the arts and crafts exhibits.<br />\nThis year we'vereally tried to improve the quality.\"<br />\nIn order to qualify for a booth, a craftsman must send<br />\nsamples or pictures of his or her work for screening.<br />\nAccording to Posever, \"We goson a rolling admissions<br />\nbasis. We pick the best ones. This year we're only allowing<br />\noriginal, handcraftediwork.\"<br />\nAlthough most of the craft exhibiters aie from the<br /><br />\nMaryland area, some come from as far away as California.<br />\nTheir displays range fromphotography to woodworking to<br />\njewelry.\"We have just about everything,\" Posever said.<br />\nMany campus and community organizations will also<br />\nhave stalls, although these \"will mostly 'just distribute<br />\ninformation. There's been a lot lot of enthusiasm,mostly<br />\njust distribute information. There's been a lot of<br />\nenthusiasm. We probably have a couple hundred<br />\nvolunteers. All the classes and most of the frats are<br />\ninvolved.\"<br />\nSome highlights of the fair will be:<br />\nFriday: a parade down Wyman Park Drive at noon, a<br />\nfireworks display at 9 PM in the freshman quad and a<br />\ncostume party in the Rathskellar.<br />\nSaturday: Casino Night in the Great Hall and a masked<br />\nMardi Gras ball in the Glass Pavilion.<br />\nAntique Car Show<br />\nxSunday: an antique car show at Homewood House<br />\nand the Claude Kipnis Mime Theatre in Shriver Ha 1 in<br />\nShrive r Hall.<br /><br />\nToday at 4 pm in the Great Hall, the Student Activities<br />\nCommission will vote on its budget for the 1977-8 fiscal<br />\nyear. This annual meeting, far from being a moribund<br />\naffair, has in previous years beer: marked by a high degree<br />\nof picayune quarrelling and violence.<br />\nHowever, because the SAC budget is balanced and each<br />\nparticipating organization has already agieed to the amount<br />\nof currency it is to recieve, today's meeting will probably<br />\nproceed with an absence of fisticuffs.<br />\nThe 1977-78 operating budget is $108,000, which<br />\nfeatures an increase of $8,000 from this year. According<br />\nto Ron Bialek, outgoing head of the SAC,the increase has<br />\nboth good and bad consequences: \"The SAC was<br />\nextremely lucky to get an lye 000 increase for next year,<br />\nbut that' means that Ja<br />\nand Chris Columbo won't<br />\nhave big contingency funds to help bail out those clubs<br />\nthat get into financial difficulty.\"<br />\nOut of the $108,000, the largest outlay is for the<br />\nNews-Letter, which receives $7,200. \"In order to print<br />\nthe News-Letter twice a week,\" Bialek said, \"they need<br />\nthe cash. It's pretty legitimate.\"<br />\nYet, he continued, \"Considering the complaints I've<br />\ngotten from students about the 'content of the Friday<br />\nNews-Letter, it's hard to justify that $7,200. They feel<br />\nthat for features they could go out and buy a quality<br />\nmagazine like Time or Newsweek. I'd like to be able to<br />\npick up ' a N-L that had a combination of news and<br />\nfeatures.\"<br />\nClose behind the N-L in operating costs is Milli,<br />\nwhich is budgeted for approximately $6,300. With the<br />\ninstallation of an FM transmitter, WJHU will be able to<br />\nexpand and provide another source of campus<br />\ninformation besides the N-L. Says Bialek, \"I've had no<br />\ncomplaints concerning the expansion of WJHU. Everyone<br />\nthat I've talked to thinks it's a great idea.\"<br />\nOne of the few organizations that will take a cut in<br />\nbudget is Ellipsis (formerly Collection of Words), whose<br />\nallocations will decrease from $1350 to $900.<br />\n\"Last year they screamed that they needed $1350 for<br />\nproduction, prize money, etc., so we gave it to them,\"<br />\nsaid Bialek. \"But they've already spent a good portion of<br />\nthat one one full-page and four quarter-page ads in the<br />\nNews-Letter. They've spent more on adskhan on prizes.<br />\nIn the SAC we have to justify this iid of spending to the<br />\nadministration and the faculty. All I can say is that<br />\noccasionally we get irresponsible people in high positions<br />\nin clubs here.\"<br /><br />\npage 4/news-letteriapril 19, 1977<br /><br />\nWho knows what Jimmy's doing?<br />\nBy K.E.T.<br />\nEven an astute observer of the development of current<br />\nUnited States foreign policy under the Carter<br />\nAdministration may have difficulty pinpointing exactly<br />\nwhat the overall direction of our policy is, and perhayof<br />\nour policy is, and perhaps of equal importance, who is<br />\nreally deciding it. Of course, a few political bywords come<br />\nto mind immediately; undoubtedly, we all would recall<br />\nsuch phrases as 'containing the arms race', 'support for<br />\nIi uman rights', and 'cooperation', but even these<br />\ncormerstones of action have not been emoloyed at times<br />\nwhen outside pressure beeame overpowering and when<br />\nthe real decisionswere to be made.<br /><br />\nWhizzes balance<br />\nHopkins bucks<br /><br />\ncontrary interests and ideas as well as the<br />\nnevessary might to overcome or at least severely hamper<br />\nthe President's goal plans.<br />\nOn the matter of human rights, there are also<br />\ndifferences between the policies that the President has<br />\nendorsed and those that are ultimately enacted. Among<br />\nthe human riflits principles outlined in the Helsinki<br />\nAgreement was one calling for increased travel<br />\nopportunities and exchanges of East and West business,<br />\nscientific, and cultural groups. But the recent US decision<br />\nt bar entry to three Soviet trade-union officials/ ho had<br />\nbeen invited to attend a labor conference in the US is at<br />\nvariance with our agreement at Helsinki. In this case, it<br />\nwas not Carter's decision that carried, but the opposition<br />\nof the powerful organization of the AFL-CIO leadership<br />\nand their lobbying efforts which finally swayed the<br />\ndecision.<br />\nOf equal importance as the need for consensus among<br />\nthe groups that influence and decide US foreign policy,is<br />\nthe necessity of a clear I foreign policy, is the necessity of<br />\na clear position on US involvement in disputes in other<br />\nparts of they' orld. Of prime interest at this time are the<br />\ncountries of Africa and especially Zaire, which is<br />\ncurrently being invaded by Soviet-supplied guerillas from<br />\nAngola. Mr. Carter, this time faced with a situation that<br />\ninvolved little opposition from domestic groups, decided<br />\nnot to sene military aid even though it was evident that<br />\nthe Soviet Union had militarily supplied the insurgents.<br />\nInstead, the US agreed to send 'nonlethal' material,<br />\nnecessitating the involvement and arms pledges of the<br />\nFrench, the Belgian, and several other governments. The<br />\nSoviets have voiced their intention to make their presence<br />\nfelt in the troubled areas of theSoviets have voiced their<br />\nintention to \"make their presence felt in the troubled<br />\nareas of the world\", seemingly/ ithout constraint and if<br />\nthe United States continues to ignore the requests of<br />\ninvaded nations for arms, Soviet presence 'will .expand<br />\nsimply as a result of our inaction. President Carter has<br />\nstated that the US eill support any nation dedicated to<br />\n'democratic principles' but if he does not begin soon by<br />\nsupporting nations that need our military aid to remain<br />\ndemocratic, there may be none that survive.<br />\nThe foreign policy of a country with a number of<br />\npowerful interest groups like the United States cannot<br />\nconceivably be formulated by one man. Undoubtedly,<br />\nthis dilemma presents problems of enacting a consistent<br />\nforeign policy line. But in the interest of our allies,-and<br />\nthose nations that. have come to depend on the United<br />\nStates as a balancing force against the Soviet Union in<br />\nworld affairs, it is our responsibility to involve ourselves.<br /><br />\nFor example, the United States is committed to the<br />\nreduction and control of proliferation of nuclear<br />\nweapons, but even as Washington reporters scribbled the<br />\nrestrainingw ords Carter spoke,construction continued at<br />\na quick pace on the new US Military base on Diego Garcia<br />\nin the Indian Ocean. Not only does our new base<br />\nrepresent the United States' first permanent foothold in<br />\nthis part of the world, but it is in direct defiance of the<br />\nreiterations of the countries in this part of the world<br />\nwho,x since 1971, have requested that the Indian Ocean<br />\nbe declared a 'zone of peace'. Obviously, our cooperation<br />\nis unresponsive on this matter and our commitment to<br />\n'the race' is progressing in leaps and bounds.<br />\nYet it appears that President Carter is not totally to<br />\nblame for • discrepancies in US foreign policy.<br />\nUndoubtedly, Mr. Carter's rhetoric on stemming the arms<br />\nrace or reducing it draws everything from concerned<br />\nfrowns to concealed chuckles from Pentagon officials and<br />\narms dealers;, both major foreign policy formulators in<br />\ntheir own rights. The fact is that these two forces have<br /><br />\nBy ROBBY RIGGS<br />\nThe Johns Hopkins University will have a balanced<br />\nbudg consecutive year, according to Budget Director.<br />\nNorman Kreuger.<br />\nThe Johns Hopkins University will have a balanced<br />\nbudget in 1977-78 for the fourth consecutive . year,<br />\naccording to Budget Director Norman Krueger.<br />\nKrueger termed the projected 159 million dollar budget<br />\n\"status quo\" with little new or different except pursuit of<br />\nthe rising price index. On the expenditure side, there are<br />\nno new programs and no wholesale cuts. Although<br />\nrevenues increased sufficiently to assure a balanced<br />\nbudget, Krueger cited several areas which could prove<br />\ntrouble spots in the near future.<br />\nHe expressed concern about the leveling off of<br />\neach year while sending tuition over the $5000 mark.<br />\nsponsored research funding in Washington. \"We're not<br />\nWhile he expects the next several years to be \"very tight\"<br />\nseeing the kinds of increase in National Science<br />\nfinancially for some divisions of the University, he is<br />\nFoundation and National Institute of Health funds that<br />\nlooking for long-term relief from the Hopkins_ Ilundreds,<br />\nwe have had previously,\" he stated': A 0.6% increase over<br />\nincreased alumni donations and increases in Maryland<br />\nthis year is projected in these areas, while the normal rate<br />\nstate aid to education. Krueger called the policies ot the<br />\nof increase had been 6% per year. This curtailing of direct<br />\nCarter administration \"a big unknown\" in planning the<br />\nresearch grants has the consequence of lowering indirect<br />\nUniversity's financial future.<br />\nrecovery funds, a major (almost 10%) source of revenue<br />\nfor the University. Effects of this trend have been felt this<br />\nyear in the School of Public Health.<br />\nThe School of Medicine is another problem area. It is<br />\nbudgeted to use 1;.<br />\ndollars worth of funds it had<br />\naccumulated as surplus during previous years. There are<br />\n\"one-time\" monies which are not renewable, so the<br />\ndivision risks running a deficit in future years.<br />\nOne significant increase in revenue Nva-s a 2.7 million<br />\nincrease in !`Clinical Service\" funds from fees charged by<br />\nphysicians at East Baltimore. This, too, has the character<br />\nof a one-shot/windfall which may not be counted on in<br />\nthe future. The same, according to Krueger, might be said<br />\nof a 0.6 million dollar increase in \"Designated Funds\"<br />\nThe question as to the best form of managemant for<br />\nsolicited by President Muller. The University will thus<br />\nthe Bookcenter is still under consideration by the<br />\nneed to find more lucrative sources of income in the near<br />\ntudent Council and Dean of Students Jakie Hall,<br />\nfuture.<br />\nalthough no concrete decisions have yet been made.<br />\nThe total 1 977-78 budget for the University,<br />\nPresident-elect of the Student Council, David<br />\n5159,173,000, is about 7.9 million dollars more than this<br />\nChesanow, said, \"We're going to look into the matter<br />\nyear's. This represents an increase at approximately the<br />\nfurther. We have to consider the people in the co-op and<br />\nrate of inflation, which means the University will operate<br />\nwhether the co-op could financially sustain itself.\"<br />\non about the same amount-of money this year in real<br />\nHe was referring to a Student Council proposal that the<br />\nter The 1976=77 budget, hich was projected to be<br />\nBookcenter be converted to a student-run cooperative<br />\nbalanced, may actually run a deficit of<br />\nfrom its current set-up as a franchise of the Follett<br />\n5100,000-200,000, Krueger stated. He attributed this to<br />\nPublishing ComaCompany. Chesanow explained that<br />\nthe exceptionally severe winter weather, which caused<br />\nstudents might be reluctant to work in the co-op during<br />\ncaused this year's fuel costs to. exceed next year's by<br />\n• exam periods, and that Follett's makes most of its profits<br />\nS600,000. He noted that in January alone the Unibersity<br />\nfrom non-book sales, such as those of shirts and<br />\nspent %115,000 on number six fuel oil, as opposed to<br />\nstationery. These two factors could undermine the success<br />\nS45,000 during-a normal year. Any such deficit would be<br />\nof a student book co-op.<br />\npaid out of the unrestricted endowment of the University.<br />\nMembers of the Student Council's Bookcenter<br />\nKnieger compared Hopkins favorably with other large<br />\nCommittee are studying similar cooperative bookstore<br />\nprivate universities in the East which have run deficits<br />\narrangements at other colleges.<br /><br />\nr!<br /><br />\nSC bookies to<br />\nlook further<br />\ninto<br />\nFollett's future<br /><br />\nhappy birthday,<br />\njakie!<br /><br />\napril 19, 1977/news-letter/page 5<br /><br />\n\"Sravos, laughter and people WNW the house<br />\nAnnaKIsselgoff — The New To* limos<br /><br />\n•<br /><br />\nJRINSEINIF<br /><br />\n41:1,11%1W.<br /><br />\nJOHNS ii0PKINS UNIVERSITY<br />\nSHRIVER HALL<br />\nApril 24 - 8:00 p.m.<br />\nTickets<br /><br />\nAdults<br /><br />\nStudents<br /><br />\nTickets on sale at Union Desk &amp; at door<br />\nSponsoied by thr• Un.on Board<br /><br />\na dinner dance orsthe MV ityrtWelcame<br />\n4<br />\nmay lB—8pm_ _ _ a_dmissi *2 'comples<br />\n*112_5°singles.— live rnut_sic..._fanc__y colotim<br />\ncbarropagirs_ _ - buffet— prime rib__ crab cakes<br />\nsweet table___cash bar__ _tickets-uunion desk<br />\nsponsored by the juniior class<br /><br />\nI think of David Bowie in the<br />\n'<br />\nsame way that I think of major household appliances.<br /><br />\n_FE0_0_10014010101000011010.<br /><br />\n-g_<br /><br />\nThe JHU Young Democrats Present<br /><br />\nFoi<br /><br />\nSenator<br /><br />\nWILLI<br />\nP!T-!'. 'XMI<br />\nApril 19, 1977<br />\n8 pm<br />\nListening-Viewing<br />\nRoom<br />\nLevering Hall<br /><br />\nThe Johns Hopkins<br />\nUniversity Band<br />\npresents its<br /><br />\nSpring Concert<br />\nSaturday<br />\n4<br />\nr<br />\nApril 23,1977 8pm ,?<br />\nShriver Auditorium '/?<br />\nFREE<br />\nADMISSION<br /><br />\n101010<br />\n\\<br /><br />\n'..7.<br />\n,<br />\n7`.\"•7<br />\n\\<br /><br />\nArAndr'AirArArAr'ArArAr<br /><br />\ncarter's little<br />\nenergy pills<br />\neditors-in-chief<br />\nMike Deak<br />\nMike Krug<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editor<br />\nDave DeSmith<br />\nnews editor<br />\nGayle Cohen<br />\nsports editor<br />\nDave Kraus<br />\nphoto-production manager<br />\nJennifer Bishop<br /><br />\nWas it a phone call placed by President Carter or merely fate that causedyesterday's two incidents of power failure? The<br />\nHomewood power plant sustained a morning and afternoon bout of April fever which forced energy officials to<br />\ntemporarily cut back on the power in circulation.<br />\nMeanwhile, President Carter embarks this week on the mission to convince the American people that this country faces a<br />\nsevere shortage of energy. He will tell them that individuals must conserve, and the government must invest in the<br />\ndevelopment of alternative energy sources. Carter will further deliver an energy state of the union message to Congress, and<br />\nrelease his long-awaited comprehensive energy proposal masterminded by Secretary James Schlesinger.<br />\nMobil and Texaco oil corporations have recently been conducting an interesting advertising campaign in the New York<br />\nTimes and Washington Post, attempting to illustrate their concern for scarce energy supplies. Such publicity is also meant t<br />\ninfluence the administration in their formulation of the final energy policy manifesto.<br />\nFurthermore, oil companies defend themselves against congressional critics.who contend they. kept needed natural gas<br />\nembedded in off-shore oil wells this past winter (for financial gain.) Oil barons are correct to assert,_ however, that<br />\nunlimited barrels of oil should not be pumped, even in the face of ascare such as the one this past winter. But will they<br />\nconvincingly assist the administration in the search for dependable energy? (a step past plutonium plants, we hope.)<br />\nThe unemployed that walked the streets in the nation's steel belt this December are already aware of the human energy _<br />\nsources. Yet the source which technology must develop on a reasonable scale, will not ultimately be our backup, but<br />\nprimary energy source.<br /><br />\nDeclaration of Principles<br />\nIn an interview appearing in the March 22 News-Letter,<br />\nI spoke of my intention, if elected, of producing a<br />\nDeclaration of Principle for my term as Student Council<br />\nPresident. Though more of a letter than an actual<br />\ndeclaration (as part of an effort to strike all undue<br />\nformality from student government), I hope this<br />\nstatement, will,serve to reaffirm my views and, amidst the<br />\nclass primaries, perhaps define the guidelines by which the<br />\nincoming Council might operate.<br />\nThe most general, all-encompassing duties of the<br />\nStudent Council are to represent and act in the the<br />\ninterests of the Hopkins undergraduates in all matters<br />\ndirectly or indirectly pertaining to them. However, in<br />\norder to to render credence to this proposition certain<br />\nfundamental conditions must be met.<br />\nFirst, it is absolutely necessary that the Council present<br />\nitself as a cohesive front for meeting student needs.<br />\nTherefore, upon assuming office for the coming academic<br />\nyear, the entire Student Council membership must make a<br />\nconscious and concerted attempt to transcend all<br />\nbitterness and personal enmities (often arising from the<br />\nprevious elections) that could possibly hamper Council<br />\nprogress in any given direction. Unless completely devoid<br />\nof in-fighting, the Council will have damned itself from<br />\nthe • start, leaving the possibilities of accomplishing<br />\nanything of long-term consequence negligible.<br />\nSecond, the Student Council must seek the active<br />\nparticipation of the greatest possible number of<br />\nundergraduates in student<br />\ngovernment. Not only will this promote more widespread<br />\nknowledge and understanding of important issues -- as<br />\nwell as bring new issues to the fore -- but itwill greatly<br />\nfacilitate Council action in areas w here strong student<br />\nreaction can produce an impact. It is also of paramount<br />\nimportance that undergraduates know,who their Council<br />\nrepresentatives are, and utilize them to the fullest as a<br />\nmeans of articulating their concerns. By way of regular<br />\nopen forums (tentatively scheduled for . the second '<br /><br />\nTuesday of each month, in the Glass Pavilion) as -a<br />\nbadly-needed supplement to the weekly Council meetings,<br />\nit is hoped that more students will avail themselves of the<br />\nopportunity to make themselves heard.<br />\nThird, the new Council must strive to develop a closer<br />\nrapport ,with the Hopkins faculty. Through revitalized<br />\nstudentliasons to the individual departments, in addition<br />\nto the careful scrutiny of all facets of Hopkins education,<br />\nthe Council and faculty together may take steos toward<br />\nthe overall betterment of undergraduate academics.<br />\nFourth, a more productive wor Icing relationship<br />\nbetween the Council and University administration must<br />\nbe fortered. This does not entail passive submission to<br />\nadministration must be fostered. This does not entail<br />\npassive submission to policies that blatantly conflicbwith<br />\nundergraduate interests, in which case it would be the<br />\nCouncil's duty to spearhead swift :)nd definitive measures<br />\nto counter such an action. Rather, it must be the purpose<br />\nof the Council, through a display of pragmatism and<br />\nsound judgment, to secure a welcomed role in all<br />\npolicy-making that affects the undergraduate.<br />\nOnce the above prerequisites have been fulfilled, the<br />\nCouncil will find itself in a position to implement those<br />\nchanges it deems necessary to improve undergraduate<br />\nexistence at Johns Hopkins -- everything from intersession<br />\ncourse-offerings to the day-to-day social life on campus.<br />\nThe desire, the innovativeness, and the energy are readily<br />\napparent -- only a clear and level-headed approach is<br />\nneeded to see the plans through. It is simply a matter of<br />\nkeeping our objectives practical -- .they need not be<br />\nmodest.<br /><br />\na<br /><br />\nletters,we<br />\nTo The Editor:<br />\nI would like to take this opportunity to express my<br />\nsincerest appreciation those who supported my candidacy<br />\nfor Student Council President during the past month.<br />\nThough our<br />\ncompaign was unsuccessful, I an very proud because the<br />\ncampaign was based on solid issues and proposals and<br />\nbecause itv si's a clean and honest campaign. In a sense the<br />\ncampaign was a success because it aroused the interest of<br />\nmany who had lost faith in student government and many<br />\nwho are now interested in participating in the programs<br />\nwhich were proposed and discussed as a result of the<br />\nelections.<br />\nIt is extremely important that those who expressed<br />\ninterest in becoming involved in student activities pursue<br />\ntheir ambitions. We face a difficult year ahead and David<br />\nChesanow and the Student Council will need a great deal<br />\nof popular support to effect the change that most of us<br /><br />\ngot letters<br /><br />\nagree is necessary. I can only hope that I will prove research, and the value of his unusual and challenging<br />\nworthy of the faith that those who voted for me have critique of the dominant understanding of politics in our<br />\nexpressed. Personally I plan to pursue those issues which socitiety, we believe that it is essential that he remain in<br />\nwe raised during the campaign, and hope othersv ill too. the University. Believing the issues to be essentially as<br />\nIn short, the campaign is not over, it is jut beginning; defined by the open letter to President Muller in the April<br />\nthe problems that existed in March will still be there in 12 News-Letter, we have requested that the Academic<br />\nSeptember and so I will urge once again for people to get .Council form an ad hoc committee to review Professor<br />\nnvolved, be active, and help us build for the future.<br />\nPfeffer's candidacy for a tenured position. We urge all.<br />\nStuart Davidson students and faculty w ho believe as Qv do to use their •<br />\nMembers of the University Community:<br />\ninfluence and good offices to have the Academic Council<br />\nAs many of you know by now, Associate Professor form such an ad hoc committee to review the case.<br />\nRichard M. Pfeffer of the Department of Political Science<br />\nPolitical Science Graduate Students<br />\nhas been denied tenure by a recent action of the senior<br />\nfaculty in the Department. A move is under way to Jim Musselwhite<br />\nDouglas Dailey<br />\nrequest that the Academic Council form an ad hoc faculty Deborah P. Kelly<br />\nMarilyn Karr<br />\ncommittee at its next meeting to review his candidacy for Robert Roach<br />\nKenneth T. Kato<br />\na tenured position in the University. Because of his Robert B. Shepard<br />\nChris Goldman<br />\nexcellent teaching performance, the high quality of his James H. Qualls<br /><br />\nBroadway comes to Baltimore;<br />\nPlaywriting at Hopkins<br />\nBy JOHN PERROTTA<br /><br />\nBob Arellano<br /><br />\nFriday and Saturday at eight pm in the Little Theatre<br />\nundergraduates will once again demonstrate that<br />\ncreativity does exist at Hopkins. Robert Arellano will<br />\npresent six one-act plays written, directed, produced and<br />\nacted by the students in his play writing workshop. The<br />\nprogram mingles comedy and satire with realistic drama.<br />\nStudent demand led to the birth of the play writing<br />\ncourses in 1971. Arellano, an instructor in the Chemistry<br />\nDepartment, taught \"Problem Drama\" to a handful of<br />\neager undergraduates. The \"problems\" they wrote about<br />\nwere generally restricted to those at Homewood:<br />\nautomatic vending machines in Levering Hall and the<br />\ninefficient University president who just wouldn't quit.<br />\nInterestingly enough, just before five plays were<br />\nperformed, all dealing with President Lincoln Gordon's<br />\ninadequacies, he resigned his position at Johns Hopkins.<br />\nAfter the end of the Vietnamese War, protest plays were<br />\nreplaced by real-life drama.<br />\nThe young playwrights did not always enjoy the<br />\nbenefits of Levering Hall's Little Theatre. They first<br />\nperformed plays in Maryland Hall, the Garrett Room,the<br />\nJ and H Rooms, and even in Shaffer 3. Many times stage<br />\nhands w ould arrange props and lights while a nervous<br />\nprofessor was trying to wrap up his lecture. Finally, Dean<br /><br />\nOwen procured funds to buy floodlights and lumber for a<br />\nstage, and playwriting moved to its present'location. The<br />\nLittle Theatre seats seventy comfortably, but Arellano<br />\nclaims the record for cramming people ,in is one hundred<br />\nand two,counting those seated on the. window sills.<br />\nRobert Arellano left his native Cuba in 1959 and<br />\nreceived his B.A. and M .A. at the Massachusetts Institute<br />\nof Technology. He came to Johns Hopkins in 1961 as a<br />\nchemistry instructor; and enrolled in Writing Seminars<br />\ncourses during his spare time. He received his M.A. from<br />\nthat department the following year. .<br />\nArellano's classes, including a quickie intersession<br />\ncourse, have performed over two hundred and fifty plays<br />\nsince 1971. Actors are allowed not more than one week<br />\nto learn their lines. Intersession students are permitted a<br />\nmere three days.<br />\nPresently Arellano is busy supervising rehearsals of two<br />\noriginal plays: \"Nicely Goodworth\",<br />\na chemical<br />\ncomedy to be presented during the Spring Fair in Remsen<br />\nHall, and \"Eleven O'clock\", to be presented the following<br />\nweekend. He is also preparing for a summer musical.<br />\nSays Arellano about drama and chemistry, \"It's a very<br />\ngood combination because you don't get bored.\" Indeed,<br />\nhe is not the only one, as his course is ranked among the<br />\ntop by students, and at show-time the Little Theatre is<br />\nalmost always filled to capacity.<br /><br />\nYoung Dudes respond toYoung Dems<br /><br />\nfr<br /><br />\nThe recent article concerning attempts to force the<br />\nunionization of Southern textile plants was submitted by<br />\nthe Yotnig Democrats. Yet, in a larger sense, the<br />\ncharacterizations of the evil magnate and the blameless<br />\nlabor organizer are the creation of well-salaried curators<br />\nof public opinion. Fifteen million dollars of workers'<br />\nsalaries buys many stereotypes.<br />\nThe migration of the American textile industry to the<br />\nSouth is not solely the result of an attempt to avoid the<br />\npower of Union bosses. Management knows well that the<br />\nhirelings of Big Labor will travel, for a price. Non-union,<br />\nas well as organized, plants moved from the Northeast.<br />\nOther aspects of overhead costs-- power, taxes, and rent -influenced the decision.<br />\nThe allegedly low wage scale of Stevens employees is<br />\noffered as evidence of management wrongdoing. To note.<br />\nonly that the STevens worker receives somewhat less than<br />\nthe averageAmerican factory worker does not take into<br />\naccount differences in skill, cost of living, and job market<br />\nconditions. Any increase in wages gained by the union<br />\nwill lead to higher prices, a higher cost of living, and<br />\nfurther wage demands. Neither should it be forgotten that<br />\nunion membership ' costs both the worker and his<br />\nemployer money; money that might otherwise go to<br />\nwagess and capital investment. And what service does the<br />\nunion provide, that workers could not provide for<br />\nthemselves without paying the union hierarchy?<br />\nIf, as is alleged, laws have been violated, redress is<br />\navailable. It were not as if employees needed to submit to<br />\nunionization in order to have their legal rights protected.<br />\nThere is, however, an issue at stake that reaches well<br />\nbeyond the Stevens plants, sweaty or not, beyond the<br />\nSouth, beyond even the media hirelings. Those who<br />\nsupport the forced unionization of'Stevens workers claim<br />\nfor themselves the words \"freedom\" and \"justice.\"<br />\nRegardless of the price paid out of the pockets of<br />\nAmerican workers, these concepts cannot be bought.<br />\nThey cannot be annexed to a cause that has, at its basis, a<br />\nsystem of political and economic coercion.<br />\nA union election is not what it seems. In the absence of<br />\nRight-to-Work Laws, derided by unionists, a bare majority<br />\nof workers in a single plant may force their fellow<br />\nemployees to submit their own paychecks to union<br />\nsiphoning, under pain of disemployment. There is no<br />\nfreedom; there is compulsory deprivation of property.<br />\nThose unwilling workers who, valuing their livelihoods<br />\nover their indpendence, acquiesce to this dues-slavery lose<br />\ntheir political freedom as well. The supposed power of the<br />\nMeaneys and Woodcocks of the textile industry may in<br />\nthe future be built on the backs of unwilling union<br />\nmembers. Their political support is subsumed wliAn the<br /><br />\nlabor bosses flaunt membership figures before officials.<br />\nThere is no freedom; there is restraint of freedom of<br />\n'assocation. The same rationale that prompted the textile plants to<br /><br />\nbe relocated in the Sotith could, as easily, close them. The<br />\nsame groups -- the same party -- that support the Stevens<br />\nventure oppose protectionism. The' two positions are<br />\ncontradictory.<br />\nsubmitted by the Young Republicans<br /><br />\nNear a Dike in the Dakotas<br />\nHer regime detracted from our union<br />\nAlthough severe press laws had been repealed<br />\nShe hid in shadows, mute but able.<br /><br />\nShe said her press conferences call for<br />\nMy indulgence and participation<br />\nYet she always answered \"I can't comment.\"<br /><br />\nWhen the tongue and its telegraph<br />\nBecome inundated in decision<br />\nWiresv ithe on,- catery ground:<br /><br />\n•<br /><br />\nMust I manage emergency repairs<br />\nLike a National Guardsman crashing<br />\nSome flooded dike in the Dakotas?<br />\nThe waters reel over your wrinkling skin;<br />\nI canoe through rapids near your struggle<br />\nProffering final measures of strength.<br />\nBut you're not willing to swim or stretch<br />\nYou wallow, convulsions sweep you away<br />\nLike a tumbling old stove<br />\nMichel Krug<br /><br />\npage 8/news-letter/april, 19; 19.77<br />\nlimusimminommiemiumw mow<br /><br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $4.10.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 and<br />\nsave $103.) All you have to do is be under the age of 24.<br />\nThere are no booking restrictions. And no skimping on<br />\nmeals or service. Because we give you the same service<br />\nyou'd get from other airlines, without the same high costs.<br />\nSo,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to.<br />\nWe'll give you the best deal.<br /><br />\nAPE!<br /><br />\nUBS 1977<br /><br />\nDON'T BE A VICTIM<br /><br />\nCharter Tours<br />\nD.C. &amp; Balto. Departures<br />\n•11111111•••11111•111•1111•1111•1111111•11111111111111111•M<br />\nfrom<br />\n1, 2 &amp; 3 week charters<br />\nMarch—Dec. 30 Weekend<br />\nDepartures, via British<br />\nCaledonian Airways<br />\nair only<br />\nABC &amp; TGC<br />\n••111111•1111•111••111111•1111111111111•1111111111111111111111•11111<br />\nfrom<br />\nParadise Island<br />\nHoliday Inn<br />\nMar—Apr •'359<br />\n$29<br />\nJuly—Nov. - 5299<br />\n17 weekend departures<br />\nall inclusive<br />\nAir, Hotel, Tax Piedmont Airlines<br />\nOTC<br />\n1111110•<br />\n1•11•11111111<br />\n11111111111•1<br />\n1111111111111<br />\n•••11111111•1<br />\nAcapulco $315-9 depar- from<br />\ntures Feb-Dec: Tri-Mexico<br />\nP66-4 departures July-Oct y<br />\n29<br />\nI a3bas.rjaty/Puerto<br />\nUaliajltaa s<br />\nC<br /><br />\n$289<br /><br />\nLondon<br />\nBahamas<br /><br />\nMem<br />\nHawaii Fil itdionlialnwanfilo‘ni is4m e4:D499<br /><br />\ne<br /><br />\n5<br /><br />\nall inclusive<br />\nAir, Hotel, Tax American &amp; United Airlines<br />\nOTC &amp; ITC<br />\nIII•1I•1II•111 111•11111 III•1111 11111111111111 1111111 1111111.111•11111<br />\nfrom<br />\n_ _ Waikiki Village '429<br />\n$345<br />\nAmerican &amp; United Airlines<br /><br />\nair only<br />\nABC &amp; OTC<br />\n111111•111•11111111111111111••11111111111111•11111111111011111<br /><br />\nIreland<br />\nPlease call<br /><br />\nBURCH<br />\nTRAVEL LTD<br /><br />\n467-3900<br /><br />\nWe plan<br />\nyour trip...<br />\nall you do<br />\nis take it!<br /><br />\nINSTANT PROTECTION from<br />\nMUGGERS, RAPISTS, and ANIMALS<br /><br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br /><br />\nOne quick spray with Guardian leaves an<br />\nattacker coughing, gasping and staggering blindly for 15 minutes and longer!<br />\nUsers have more than enough time to<br />\nescape and call police. The size of an<br />\nordinary pen. Guardian may be carried in<br />\npocket or purse for instant use in<br />\nemergencies.<br />\nCONTAINS<br />\nNO ILLEGAL<br />\nTEAR GAS!<br /><br />\nEIcelandic Airlines, Dept. #CN<br /><br />\nNOT<br />\nPERMANENTLY<br />\nINJURIOUS!<br /><br />\n630 Fifth Ave., N.Y., N.Y. 10020<br />\nSee your travel agent. Or call toll free: 8(10) 555-1212.<br />\nPlease send information on all Icelandic's low-cost fares to Europe.<br /><br />\n10-DAY<br />\nMONEY BACK<br />\nGUARANTEE!<br /><br />\nName<br /><br />\nORDER NOW—DON'T WAIT<br /><br />\nYOUR LIFE MAY DEPEND ON IT!<br />\nMail check or money order to:<br />\nAMG Enterprises Inc. Dept. N<br />\n95 Cedar Drive<br />\nPlainview, N.Y. 11803<br /><br />\nAddress<br /><br />\nIcelandic<br /><br />\nLowest Jet fares to Europe of any scheduled airline.<br /><br />\nADD 50C PER UNIT<br />\nPOSTAGE AND HANDLING<br /><br />\n0PP0P<br /><br />\nZip<br /><br />\nFAre..tibirct to chankr and g..t appr..,31<br /><br />\nL<br /><br />\n1 for $3.95 SAVE! [11 2 for $6.95<br />\nSUPER SAVINGS! 1 3 for $9.95<br /><br />\nBUSINESS<br /><br />\nState<br /><br />\nCity<br /><br />\n-T<br /><br />\nBURCH TRAVEL LTD<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin' Street<br />\nBoston,Mass. 02110<br /><br />\n3900 N. Charles St.<br />\n467-3900<br />\n00<br />\n00<br /><br />\nSpecializing in Hopkins<br />\nTravel<br /><br />\nTHE FRANK R. KENT MEMORIAL LECTURE<br /><br />\nBURCH<br />\nTRAVEL LTD<br /><br />\nSpecializing in Cruises,<br />\nIndividual and Group Tours<br />\nAll Domestic and International<br />\nTravelArrangements.<br />\nURCH<br /><br />\nr,AvEL<br /><br />\nJ. Burch Monett - President<br />\nPhyllis Mollett Barry - Vice\"President<br />\nStephen J. Baxter - Manager<br /><br />\n467-3900<br />\n3900 N. Charles St.<br />\n—<br /><br />\nWEDNESDAY NOON SERIES<br />\npresented by<br />\nThe Office of Special Events<br />\n'I REMEMBER HOPKINS WHEN...'<br />\nJohns Hopkins faculty reminisce about their student days at J.H.U.<br />\nFrancis Carlson, Professor, Biophysics,<br />\ngraduate 1942<br />\nMatthew Crenson, Professor, Political Science,<br />\ngraduate 1963<br />\nJohn Higham, Professor, History<br />\ngraduate 1941<br />\nRichard Macksey, Professor and Chairman<br />\nHumanities Center, graduate 1957<br />\nM. Gordon Wolman, Professor and Chairman,<br />\nGeography and Environmental Engineering,<br />\ngraduate 1949<br />\nWEDNESDAY, APRIL 20. 12 NOON<br />\nGarrett Room, Milton S. Eisenhower Library<br />\nFREE ADMISSION<br /><br />\nTo bE civEN by<br /><br />\nJOHN CHANCELLOR<br />\nSHRIVER HALL AUDITORIUM<br />\nTUESDAY, APRIL 19, 1977 AT 4:00 P.M.<br /><br />\neditor after<br /><br />\n-S•7-<br /><br />\n,41<br />\nA.( 'ie.- •<br />\n•<br />\nk<br /><br />\nNAT'L MEDICAL BDS.<br />\nFLEX • ECFMG • DAT<br /><br />\nI BIRTII<br />\nMC<br />\nAT<br />\nCONTROL&amp;<br />\nwith confidence<br />\noriginal study materials<br />\nsmall groups • tape center<br /><br />\nsummer &amp; compact courses<br />\nCALL<br />\n(202)<br />\n244-3010<br /><br />\nKA<br /><br />\nI<br /><br />\nEDUCATIONAL CENTER<br /><br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20008<br /><br />\nL<br /><br />\nr<br /><br />\nA1101111011<br />\nSERVICES<br /><br />\n;<br /><br />\nEducated Beer<br />\nTastes Prefer<br /><br />\nI<br /><br />\nBECK'S<br /><br />\nHILICAEST CLINIC 84<br />\ntAFRVICE<br />\nGaANZ.Ci<br />\nTh<br />\nano<br /><br />\nI<br /><br />\nIMPORTED BEER<br />\n••••41<br />\n.8<br /><br />\n(301)TSB-4400<br /><br />\n111111a.mils<br /><br />\nNATIONAL BESTSELLER<br /><br />\n\"Has already been placed<br />\non many executive<br />\n'must'reading lists:'<br />\n—Time Magazine<br /><br />\nBrewed in West<br />\nGermany for<br />\n800 semesters!<br /><br />\nEnjoyed in<br />\n140 Countries!<br /><br />\npunishment<br /><br />\napril 19, 1977/news-letter/page 9<br /><br />\n_<br /><br />\nTHE WUJS INSTITUTE<br />\nHere's a way for college<br />\ngraduates to experience Israel in<br />\na comprehensive one-year<br />\nstudy/work programme. You<br />\nspend your first 5 months in<br />\nArad, a dynamic new town,<br />\ntogether with other graduates<br />\nfrom all over the world. There<br />\nyou will study Hebrew, Judaica<br />\nand Israeli society, combined<br />\nwith tours and a kibbutz period<br />\nFor the following 7 months or<br />\nmore, you can either work in<br />\nyour profession, volunteer in a<br />\nkibbutz or development town,<br />\nre-train professionally or continue<br />\nstudying. The World Union of<br />\nJewish Student; Institute in Arad<br />\ncould be the beginning of your<br />\nlove affair with Israel.<br />\nIsrael Aliyah Center, 515 Park Avenue,<br />\nNew York, New York 10022,(212) 752-0600<br /><br />\nGraduate to Beck's!<br />\nFor information, please send to the above address.<br /><br />\nBeer Mug Offer!<br />\n111<br /><br />\nTHE NEW CORPORATE LEADERS<br /><br />\nAge<br /><br />\nlandsome,<br />\nheavy<br />\nBeck's<br />\nBeer Mugs at cry special<br />\nlow price where you buy<br />\nfee1,\": Beer.<br /><br />\nCity<br /><br />\nImported by Dribeck,<br /><br />\nUniversity<br /><br />\nN.N'.<br /><br />\nin Md. by FA'. %%Inner<br /><br />\nby Michael Maccoby<br /><br />\nName<br /><br />\nW —34<br /><br />\nAddress<br /><br />\nState<br /><br />\nlip<br /><br />\n... ...<br /><br />\nLiterary Guild Alternate Selection /-::<br /><br />\nThis is for the mother, and this is for the father, and this is for the sponsor! -- Soupy Sales<br /><br />\nS8.95 • Simon and Schuster ,<br />\n••<br /><br />\n•<br />\n—\" • .'\"\\INZN<br /><br />\n•<br /><br />\n•<br />\ns<br /><br />\n•<br /><br />\n•<br />\n_^<br /><br />\n•<br /><br />\nIr<br /><br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br /><br />\nPresented by<br />\nThe Office of Special Events<br /><br />\n9<br />\n9<br /><br />\nPEABODY AT HOPKINS<br /><br />\n9<br /><br />\n9<br />\n9<br /><br />\nART SONG<br />\nPrepared by Alice Gerstl Duschak<br />\nand sung by her Students<br />\nTHURSDAY, APRIL 21 - 12 NOON<br />\nGarrett Room, Milton S. Eisenhower Library<br />\nFREE ADMISSION<br /><br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br />\n9<br /><br />\nH/ BITS\"<br />\nlleavenlyHash.itsthe<br />\nWatergatestory,piously camped up<br />\nIn a Philadelphia nunnery.<br />\nGlenda Jackson is Nixon,Geraldine Page<br />\nand Anne Jackson are Haldeman and Erlichman,<br />\nAnne Meara is Gerald Ford. Sandy Dennis is<br />\nJohn Dean and Melina Mercouri is Henry Kissinger.<br />\nThey smoke,swear, munch pizza.\" —Rex Reed, Vogue<br />\n\"A biting, black and very witty comedy<br />\nstarring a knuckle of cracking good<br />\nactresses. Glenda Jackson,in the first<br />\ngood role she has had in several years.<br />\nSandy Dennis' characterization is worth<br />\nall of 1976's movies rolled into one<br />\nIntelligent and devastating!\"<br /><br />\nThee<br />\noutrageous<br />\ncomedy!<br /><br />\n—Liz Smith, Cosmopolitan<br /><br />\nairs<br />\nUniversit4 SandvAchShoppe and Deli<br />\nAB Lump Crab Cakes<br />\nGamine Kodsa Corned Beef<br />\nDdicious Roast Beef<br />\nVirsisia Baked Ham<br />\nVarious Cold Cuts<br />\nCheese (Swiss. Provolone. Muesster)<br />\nKoehn Hot Doe<br />\nCalming<br />\nPasty Trays(special olds°<br />\nHome Made Desert (Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br />\nPlants<br /><br />\nRERTAURANT &amp; CARRY OUT<br />\nPima 4674262<br />\nUNINIEMIIIITY PARKWAY<br />\nPAUL<br />\nAT<br />\n- Fri: 930 - 700<br />\nLOW. UNIVICRIWTY OP APTS.<br />\nSat 930 - 200<br />\nClosed Sandayx<br />\nFREE SODA W 1P-1 THIS A n<br />\nPURCHASE OF S1.00<br /><br />\nAND<br /><br />\nPure gold...Outrageous and amusing. The screen is set<br />\naglow. Glenda -Jackson is superb. Sandy Dennis steals<br />\nthe<br />\nshow.- —Judsth Crist, Saturday Review<br />\nHigh wit. With Glenda Jackson's normal biting delivery,<br />\nsnobbery achieves perfection. Sandy Dennis' first real<br />\ncrack at screen farce. Wearing big, round specs and<br />\ngrinning like a rabbit, she's John Dean crossed with<br />\nAmy Carter. Everything Anne Meara does is funny. Even<br />\nthose who voted for Nixon may be able to laugh at<br />\nNasty Habits'.\" —Pauline Kael, The New Yorker<br />\nBRUT PRODUCTIONS PRESENTS A GEORGE<br /><br />\nBARRIE —ROBERT ENDERS PRODUCTION<br /><br />\nGLENDA JACKSON MELINA MERCOURI GERALD<br />\nINE PAGE SANDY DENNIS<br />\nANNE JACKSON ANNE MEARA SUSAN PENHAL<br />\nIGON ;NASTY HABITS\"<br />\nalso vomng<br /><br />\nEDITH EVANS as Hiideagorde JERRY STILLER a,PR p,,,<br />\nRIP TORN a, ma,...,,bor, ELI WALLACH as monstignor<br /><br />\nMusic by JOHN CAMERON Executive Producer GEORGE<br />\nBARRIE adopted from The Abbess of Crewe by MURIEL<br />\nSPARK<br />\nWritten and Produced by ROBERT ENDERS Directed by<br /><br />\nPG PARENTAL GUIDANCE SUGGESTEDI<br />\n,• • kW<br /><br />\nROTUNDA CINEMA<br /><br />\n•<br /><br />\n'.41<br /><br />\n..re<br /><br />\nWESTVIEW<br /><br />\n1.I...Z2r.<br /><br />\nMICHAEL LINDSAY-HOGG Color by Technkolor i<br />\ni0\"_YOk_<br /><br />\nStarts Friday, April 22<br /><br />\n'<br />\n16 BAUT<br /><br />\nCINEMA HARUNDALE PERRING<br />\nPLAZA CINEMA VILLAGE1STRAND CAMPUS HILLS<br />\nCINEMA<br />\n4.441<br /><br />\n,<br /><br />\n'44<br /><br />\n•4<br /><br />\n•<br /><br />\npage 10/news-lettedapril 19, 197e<br /><br />\nBy AL DANIELS<br />\nWhile the lax game was, piped into the freshman quad,<br />\nonly those who heardl the contest behind the new<br />\ndorms got to see the real good news made by JHU<br />\nathletes Saturday.<br />\nHopkins new cardiac kids stole both ends of a<br />\ndoubleheader from league rival Ursinus, coming from<br />\nbehind both times to win 4-3 and then 7-6.<br />\nConsistently forcing the visiting Bears from<br />\nCollegeville, Pa. into major blunders, the baseball Blue<br />\nJays benefited from what co-captain Dave Emala called \"a<br />\nwinning attitude we haven't had around here for a long<br />\ntime.\"<br />\nDown 3-0 after the first inning in the opening game the<br />\nJays got on the scoreboard in what would become<br />\nstandard for the day.<br />\nBob Babb jumped on the first pitch in the JH third,<br />\nslugging the team's first hit to left. Despite being forced at<br />\nsecond on the next play, Bob made their second baseman<br />\ntaste a major league slide, and the Bear double play throw<br />\nsailed near the tennis courts, allowing batter John Santo<br />\nto get into scoring position.<br />\nTop hitter Dave Emala then singled him home, but<br />\nEmala was thrown out attempting to stretch his hit into a<br />\ndouble. This was particularly unfortunate as top RBI man<br />\nDave Lewing followed with a double (the lone JHU<br />\nextra-base hit of the game) - a hit that certainly/ would<br />\nhave scored Emala.<br />\nA strikingly similar Jay sixth saw Frank Parreira open<br />\nwith a single followed by a clutch two-strike single by<br />\nBobby McCoy after the bunt sign was taken off. Frank<br />\n;tole third before a Mike April walk which loaded the<br />\nbases and set the stage for the Bears' most pathetic play<br />\nof the day.<br /><br />\nCatcher Ricky Law sent a foul pop to the first base<br />\nside, and, instead of running the ball in after he caught it,<br />\nthe Ursinus first bagger heaved what looked like a decent<br />\njavelin throw towards Griffin doBoth Parreira and McCoy<br />\nscored, tying the game, forcing it into extra frames.<br />\nIn the third extra inning, Emala reached on an error,<br />\nwent to second on another crazy Bear overthrow and was<br />\nsacrificed to third by cleanup hitter Lewing's clutch bunt.<br />\nMike Santo then squeezed Dave home with an excellent<br />\ngame-winning bunt.<br />\nWhile the offense was playing heads-up ball, game<br />\nwinning pitcher sophomore Steffan \"Three Finger\" Bums<br />\nwas no \"slouch\" either. He pitched the full ten innings,<br />\nfacing 36 batters,while giving up only one walk, yielding<br />\nonly one hit in the last five innings and picking up his<br />\nsecond victory/without a loss.<br />\nThe loyal and good sized crowd was ready in the<br />\nsecond game for thel Jays to go out and demolish the<br />\nBears early, but once again the cardiac kids yielded a<br />\nbunch of runs in the first frame.<br />\nWith little support behind him in the field and/with<br />\nseemingly no anger in hi s pitches, Jay starter and smoke<br />\nthrower Charlie Lachenbruch was wild and gave way to<br />\niron man reliver Mike Santo in the first inning.<br />\nThe Jay scoring began in the second and capitalized<br />\nagain on Ursinus throws which had little written on them<br />\nbut good distance and ,not the pockets of their<br />\nteammates' gloves.<br />\nIn the third, Emala wound up on third after a passed<br />\nball on ball four. The struggling Bears weren't helped<br />\nwhen Lewing singled \"Ern\" home.<br />\nSimilar happenings occurred in the fourth frame.<br />\nParreira reached first on an error. McCoy sacrificed him to<br />\nsecond and April knoc ad Frank home. Lawgot April<br /><br />\nassifiedsclassifiedsclassifiedsclassifiedsclassifiedsclassifiedsclassifieds<br />\nQuality<br /><br />\nTyping 467-0342.<br /><br />\n1SRANISH by expesienced nati<br />\nteachers • All levels, all ages.<br />\n, 366-2056.<br />\nEUROPE- '77 No Frills Charters 4<br />\nGLOBAL TRAVEL, 521 Fitt<br />\nA t.e., N.Y.,N.Y.,1 0 0 1<br />\n212-379-3532.<br />\nk<br /><br />\nI<br /><br />\nTwo students want to take care of<br />\nvacationer's home during the<br />\nsummer months Ca11:366-5286.<br />\nCarpenters needed for rennovation<br />\nFree Room. Call 332-1110.<br /><br />\nPree Room w/ semi-private bath in<br />\nexchange for light housekeeping &amp;<br />\ncouple evenings babysitting. within<br />\nfive minutes drive. Call 332-1110.<br />\nFemale preferred.<br />\nSuffering from mal tuition? Need<br />\nextra income part-time? Looking<br />\nfor carreer? In 2-5 years earn<br />\napprox. $2,500/mo. Call of write<br />\nfor interview. Hunt Valley<br />\nInternational, Inc., P.O. Box 56,<br />\nOwings Mills, Maryland<br />\n301-356-4688. Resumes accepted.<br /><br />\nhome when his shot to the infield was juggled by the Bear<br />\ndefense.<br />\nParreira singled two more runs home in the fifth and in<br />\nthe decisive sixth Dave Lewing singled in the w inning run<br />\non a blast to right field.<br />\nThe tenacious Blue Jays next take to their field directly<br />\nbehind the new dorms today at 1:30 pm with non-league<br />\nrival UM-Eastern Shore the opposition.<br />\nThe team will squeeze plenty of action into the t in<br />\nbill. As far as excitement goes, expect nothing but the<br />\nmost as we don't call 'em the cardiac kids for nothing.<br />\n,,pro<br /><br />\n.<br /><br />\n.1<br /><br />\nO<br />\n,<br />\n.<br /><br />\n?:4<br /><br />\nEIDAE1<br />\nDIMOM<br />\nJT<br /><br />\nmumvErz<br /><br />\n•<br />\nThe Department of Urban Affairs at Hunter College<br />\nof the City University of New York offers a two-year,<br />\n60-credit program leading to a MASTER OF URBAN<br />\nPLANNING degree.<br />\nAction oriented, Hunter's program grapples with<br />\nsocial and economic problems and explores the<br />\nareas of housing, transportation, environmental and<br />\nhealth care planning.<br />\nFieldwork opportunities abound—in city and<br />\nsuburban planning agencies, In neighborhood<br />\ngroups, in community development organizations.<br />\nRequirements are flexible and an able, diverse,<br />\n'and experienced faculty is ready to add guidance<br />\nand direction to student goals.<br />\nExtensive financial aid is available. Current costs<br />\nare $750 a secnester for City residents and $1,000<br />\nfor non-City Residents, plus activity fees.<br />\nFor more Information and admission applications<br />\nwrite: Director, Graduate Program in Urban Planning, Hunter College/C.U.N.Y., 790 Madison Avenue, New York, N.Y. 10021-(212)57G5594.<br /><br />\nAdd a new international<br />\ndimension to your<br />\ncollege career with a<br /><br />\nWRITE FOR FILMS<br />\nAND TELEVISION!<br /><br />\nSEMESTER<br />\nAT SEA<br />\nThe S.S. Universe sails<br />\nFeb. 25, 1978, on a<br />\nround-the-World<br />\nvoyage. Join us.<br /><br />\n•Experienced professionals<br />\n* Valuable industry contacts<br />\n•Editorial and marketing aid<br /><br />\nFREE COLOR VIE WBOOK<br /><br />\nWrite or phone INSTITUTE<br />\nFOR SHIPBOARD<br />\nEDUCATION,Taj Mahal<br />\nBldg., P.O. Box 2488, Laguna<br />\nHills CA 92653.(714)581-6770<br />\nAttn: UG Division<br /><br />\nAcademically affiliated with<br />\nthe Uniuersity of Colorado<br />\nThe S.S. Universe is<br />\nregistered in Liberia<br /><br />\n•Do not send manuscripts<br />\n•For information, write<br />\nSCREEN WRITERS SERVICE<br />\n2064 Alameda Padre Serra<br />\nSanta Barbara, CA 93103<br /><br />\n1<br /><br />\nI april 19, 1977/news-letter/page 11<br /><br />\nLaxers lose<br />\nheartbreaker•<br />\nCornell ekes<br />\nout victory<br />\n•<br /><br />\n1<br /><br />\nSaturday ,.afternoon, some 15,000-plus lacrosse fans<br />\nconverged on Schoelkopf Field in Ithaca, New York, to<br />\nview the kind of excitement that they hoped the top two<br />\nteams in the country could generate. They weren't<br />\ndisappointed.<br />\nThe Big Red of Cornell staged an inspired second half<br />\ncomeback to nip the Blue Jays 12-11, thus preserving<br />\nCornell's top ranking and extending the Big Red's two<br />\nyear winning streak to 20 consecutive victories.<br />\nFor Hopkins, the loss was a bitter one to accept. The<br />\nJays led throughout most of the game and had even held a<br />\n7-1 advantage late in the first half. Howeifer, JHU could<br />\nnot stop the Cornell onslaught and now finds itself in the<br />\nnumber 3 position in the Coaches Poll, trailing both<br />\nCornell and Maryland.<br />\nDespite the Big Red second half rally, the game Nvas<br />\nlost by Hopkins during the first thirty minutes of play.<br />\nFor although JHU held a 7- 91ead at intermission , the<br />\nBlue Jays had -missed numerous scoring opportunities in<br />\nthe first two periods- chances which, if converted into<br />\ngoals, would probably have negated the Cornell third<br />\nperiod comeback.<br />\nWhile the offense sputtered through much of the first<br />\nhalf, the Hopkins defense performed brilliantly. Led by a<br />\nsupreme effort from goalie Kevin Mahon, the JHU<br />\nbackline totally stymied the home team offense, enabling<br />\nthe large halftime lead to be amassed.<br />\nHopkins midfielder Dave Huntley started the Jays off<br />\non the proper foot in the opening quarter. The<br />\nsophomore from Canada rifled home the game's first two<br />\ngoals to give the Homewood stickmen a quick 2-0 lead.<br />\nFreshman Frank Cutrone added a score late in the period<br />\nto give JHU a 3-0 advantage after fifteen minutes of play.<br />\nThe style of play continued unchanged throughout<br />\nmost of the second quarter. The dominant factor was the<br />\nJay defense, a unit that. ept the Big REd at bay most of<br />\nthe period.<br />\nHopkins middie Wayne Davis scored to give JHU a 4-0<br />\nlead early in the quarter. Cornell got onto the scoreboard<br />\nseveral minutes later, but JHU's Scott Baugher, Mike<br />\nO'Neill and George Johnson fired home unanswered goals<br />\nto up the lead to 7-1.<br /><br />\npair of goals to gain an 8-L :tie after forty-five minutes of<br />\nplay.<br />\nThe Jays, however, regained their composure for the<br />\nstart of the final period. Midfielder Steve Wey opened the<br />\nscoring in the fourth quarter, giving JHU a 9-8 lead.<br />\nUnfortunately, Cornell was not to be stopped. They<br />\nquickly tied the game and, after Wayne Davis put JHU up<br />\n10-9, took control of the contest. The Big Red whipped<br />\ndiree gOals past the beleaguered Jay defense to establish a<br />\n12-1- lead with less than two minutes'to play.<br />\nThe Jays, however, refused to die and provided an<br />\nexciting climax to the afternoon. Mike O'Neill culminated<br />\na fast break with forty seconds remainingw ith his second<br />\ngoal of the afternoon. JHU's Bob Maimone won the<br />\nensuing face-off (he won 19 of 22-on the afternoon!), but<br />\nthe Jays could not get off a good shot and time ran out.<br />\n\"We're young and we're getting better,\" Ciccarone<br />\ncommented. \"We lost a game and that was extremely<br />\ndisappointing, but I still like our chances to be in<br />\nCharlottesville (site of this year's NCAA championship<br />\ngame).\"<br />\nThe Jays face Brown this Saturday afternoon on<br />\nHomewood field beginning at 2:00. Hopkins will be<br />\nwithout the services of tri-captain Tom Myrick / ho<br />\ninjured his right knee during the third quarter of<br />\nSaturday's game. The extent of the injury is still<br />\nunknown, but the senior from Towson will probably be<br />\nlost to the team for at least three weeks.<br /><br />\n-414,<br />\nThe Big Red cut the margin to 7- Rvith less than half a<br />\nminute remaini::sr!<br />\n- in the half, but the intermission was<br />\nstill a happy time, for the Blue Jay faithful/ hh visions of<br />\na number one ranking dancing in their heads.<br />\nThe situation changed drastically, however, as play got<br />\nunderway in the third quarter. Cornell began to solve the<br />\nriddle of the Blue Jay defense that had stumped them so<br />\nthoroughly in the first half, while the Hopkins offense<br />\ngrinded to a halt.<br />\nThe teams traded goals to open the period, but the Big<br />\nRed then began to assert itself. Cornell tallied a pair of<br />\nunanswered scores to bring the count to 8-5 midway<br />\nthrough the period.<br />\nDuring the next series of plays, Jay middie Bob<br />\nDeSimone picked up an errant ball in his defensive zone<br />\nand began a fast break. A perfect pass to O'Neill deep in<br />\nthe Cornell zone set Mike up one-on-one with the goalie.<br />\nHowever, the shot hit the top pipe and the deep rebound<br />\nwas taken by a Big Red midfielder, who started a break in<br />\nthe opposite direction - an opportunity that culminated in<br />\na Cornell goal.<br />\nFollowing the game, JHU head Coach Henry Ciccarone<br />\npointed to that series of plays as a turning point in the<br />\ngame.<br />\n\"If Mike scores, we're up 9-5 and have some of the<br />\nmomentum,\" the Coach explained. \"Instead, it's now 8-6<br />\nand they (Cornell) still have the momentum.\"<br />\nThe Big Red continued their charge and added another<br /><br />\nNetmen smash their way to Success<br />\nBy ANDREW COHEN<br />\nThe Blue Jays Men's Tennis Team continued their<br />\nsmashing success by demolishing the University of<br />\nMaryland in Baltimore last Friday afternoon by the score<br />\nof 8-1 at the downtown campus.<br />\nThe Jay victory, coupled with their 9-0 drubbing of<br />\nWidener College at home earlier in the week, lifted their<br />\nseason record to .500 at 4-4. Both games were highlighted<br />\nwith ,strong performances from the singles and doubles<br />\ncorps.<br />\nAgainst Widener every one of the nine matches, bar<br />\none, went to the Blue Jays in straight sets. AT first<br />\nsingles, Ken Vogelstein took his Widener opponent<br />\nhandily 6-3 and 6-1. In the second slot, Kevin Little<br />\ncrushed his adversary 6-0, 6-2 while Mike Mont, third<br />\nsingles player, whipped the Widener third man, 6-2, 6-0.<br />\nSenior Captain Chuck McCulloch handed Widener its<br />\nmost embarassing defeat of the day when he annihilated<br />\nhis opponent 6-0, 6-0. Jeremy Levin and Ken Feinberg,<br />\nfifth and sixth singles players respectively, switched roles<br />\nfor this game, with Feinberg taking his match 6-3, 6-4 and<br />\nLevin going to three games before coming up the winner<br />\nat 64,2-6, and 6-3.<br />\nIn the doubles column the only real contest saw the<br />\nfirst team of Little and Mont edge out their opponents in<br />\nstraight sets 7-5, 6-4. Vogelstein and McCulloch easily<br />\ntook the second position by winning 6-1 and 6-0.<br />\nSophomore Mike Grohol replaced Levin in the third<br />\ndoubles spot and along with Feinberg defeated Widener<br />\n6-3, 6-4.<br />\nThe UMBC match was quite as impresive as the earlier<br />\ncontest. On this occasion, though, Mont was unable to<br />\nPlay so Grohol was called upon to fill the sixth singles<br />\nvacancy and everyone from McCulloch down moved up a<br />\nstep on the ladder. Vogelstein and Little were easy<br />\nIvrinners in their regular spots with scores of 6-3, 6-2, and<br />\n6-1, 6-3, respectively. McCulloch, Levin and Feinberg, all<br />\nin their new positions, also chalked up victories by<br /><br />\nrespective scores of 6-1,.7-5; 6-1, 6-1; and 6-3, 6-4. The<br />\nonly loss the Jays suffered in the contests came when<br />\nGrohol dropped his match in straight sets 6-4,64.<br />\nAgain, the Jay tennis bums swept the doubles portion<br />\nof the game. This time, though, Coach Bob Hughes<br />\nshuffled up his team play lineup. This strategic move<br />\nproved effective as Vogelstein and McCulloch, elevated to<br />\nthe first slot, Little and Levin, and Feinberg and Grohol<br />\ntook their matches 6-1, 2-6, 6-4; 6-1, 64; and 64, 6-0,<br />\nrespectively.<br />\nThese two huge victories seemed to amply make up for<br />\nthe two disappointing losses the Blue Jays were handed<br />\ntwo weeks ago. On April 8, the team traveled to<br />\nWashington, D.C. to face Catholic University.<br />\nUnfortunately, the Jays had to forfeit the second doubles<br />\nmatch and the third doubles contest fell by the wayside<br /><br />\ndue. t dar ness. McCulloch and Feinberg in singles, and<br />\nthe doubles tandem of Little and Mont were the, only<br />\nvictorious netmen. The scores read 4-6, 7-6,64;6-3,6-0;<br />\nand 64,6-3, respectively.<br />\nA powerful Towson State club whipped th Jays Here<br />\non April 11 by the count of 8-1. On this occasion Little<br />\nand Mont were team victors with a 64,64 score.<br />\nIndividually<br />\neinberg tops the team with a ; -'4<br />\nsingles record with Little and McCulloch just behind<br />\nsporting 4-5 records. The doubles duo of McCulloch and<br />\nVogelstein rate number one for the Jays in that category<br />\nwith a 4-2 showing.<br />\nThe Blue Jays next home match will ta 6 place this<br />\nThursday when the team faces MAC rival Ursinus College.<br />\nThe context is set to get underway at 3 pm on the tennis<br />\ncourts behind the new dorms.<br /><br />\nbermuda sports shorts<br />\nA new exercise activity has been opened by the<br />\nAthletic Department.<br />\nIt is called a \"circuit course,\" is located in the old<br />\nping-pong room in the lower front hall of the Athletic<br />\nCenter, and is designed primarily for those of any age and<br />\neither sex who want a simple, consistent, non-organized<br />\narrangement by/ hich they can wor out to improve their<br />\nphysical condition in a minimum of time.<br />\nIt requires no prior lcnowlege or experience in athletics.<br />\nor physical training, uses simple calisthenic-type exercises,<br />\nand can be carried out at any intensity the user prefers.<br />\nThe instructions are self-explanatory, so that no formal.<br />\ninstruction is needed to begin, and users can go through<br />\nthe course at their own convenienced rather than in an<br />\norganized class arrangement.<br />\nStudents and faculty are being invited to examine \\the<br />\ncirduit course to see if it provides a simple but effective<br />\nmethod for \"getting in shape\" with a minimum of ,time<br /><br />\nspent each week. If anyone has questions or problems<br />\nabout this circuit course, or anything else about their<br />\npersonal physical activity program, please see Mr. Turner<br />\nOn the Links: (Apr. 15) The inaugural edition of the<br />\nHutzler Open was won by Peter Bigharn with a startling<br />\nquadruple-carom shot that landed flush against the pin at<br />\ntheJohn Wisneski and the Rainbow Kid, who immediately<br />\ndecided to disband the tournament on that note and go<br />\nout for a few beers.<br />\nThe Hopkins Women's Lacrosse team garnered its<br />\nsecond victory of the seasen, whipping the Georgetown<br />\nHoyas 104 Friday afternoon. The Jays are back in<br />\naction<br />\nthis Thursday afternoon as they host Goucher College.<br />\nGame time on Garland Field is 4:00.<br /><br />\nTHE EOPLE<br />\nWho are the people? Why, they're the Tuesday News-Letter's staff members and their friends-,' As one can see, morale is unusually high<br />\non the Tuesday News-Letter. We're proud of our 449 voting members. (If you thought this picturevwas a waste of space, then you get the<br />\nidea of this whole issue--- seriously, folks, this shot is a godsend compared to the \"articles\" cranked out by Messrs. DeSmith and<br />\nRaphaels6n which at one time or another were respectively destined to nestle on this, the \"back page.\"<br /><br />"}], "field_media_file": [{"target_id": 41213, "display": null, "description": null, "target_type": "file", "target_uuid": "68772506-3abb-4e2f-9411-16df6d5eba51", "url": "http://digital.library.jhu.edu/system/files/2022-03/14353-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14353, "target_type": "node", "target_uuid": "48cdd3eb-f196-4758-855b-72358a3a2b93", "url": "/node/14353"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "20abc60a-4005-48f0-b523-30c1ff19fa06"}]}