{"mid": [{"value": 37007}], "uuid": [{"value": "83a2795d-2c0f-44fb-a499-94fa6916303e"}], "vid": [{"value": 37007}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13137-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 7<br />\nDE LA MARE LECTURES ON<br />\nCHRISTINA ROSETTI;<br />\nPOINTS OUT FALLACIES<br />\nAppreciation of Rosetti Marks End Of<br />\nBelief in Common Poetical Fallacies, Says Lecturer<br />\n<br />\nHOMEWOOD, BALTIMORE. MD., OCTOBER 24, 1924<br />\n<br />\nSenior Presidency<br />\nStill Undecided<br />\nBecause of a class by-law<br />\nrequiring a majority in all<br />\nelections, W. C. Calhoun and<br />\nW. K. Morrill are deadlocked<br />\nfor President of the Senior<br />\nClass. At the elections of the<br />\nclass on Wednesday, Calhoun,<br />\nalthough . possessing a large<br />\nplurality, did not have enough<br />\nvotes to satisfy the majority<br />\nrequirement. A revote will be<br />\ntaken in the near future.<br />\nOther results of the elections were: M. Urner, VicePresident; R. Wienefeld,<br />\nSecretary; D. Reese, Treasurer; K. Miller, Sergeant-atArms.<br />\n<br />\nHOPKINS PROFESSOR IS A<br />\nMEMBER OF IMPORTANT COMMITTEE<br />\nProf. John H. Gregory, Head of Civil<br />\nEngineering Dept., Consulted By<br />\nCity of Chicago<br />\n<br />\nDr. Willoughby Attends<br />\nGeneva Conference<br />\nAccording to a cable received Monday by a local<br />\nnewspaper, Dr. W. W. Willoughby, professor in Political Science at the Johns Hopkins University, has arrived<br />\nat Geneva, Switzerland, where<br />\nhe is participating in the.<br />\nLeague of Nations discussion<br />\non the Chinese opium trade.<br />\nChina has retained Dr. Willoughby as Constitutional Advisor to see that the rights of<br />\nthat country are not infringed<br />\nupon M the league's effort to<br />\nbreak the opium traffic. Dr.<br />\nWilloughby has played an important part in the development of the government of<br />\nChina.<br />\n<br />\nPRICE 5 CENTS<br />\nLOYOLA WILL MAKE DEBUT<br />\nAT HOMEWOOD AGAINST<br />\nHOPKINS TOMORROW<br />\nCatholic College Will Inaugurate Series<br />\nOf Annual Gridiron Games<br />\nWith Hopkins<br />\n<br />\nProfessor John H. Gregory,<br />\nChristina Rossetti, her life and<br />\nhead of the Civil Engineering DePROBABLE LINE-UP:<br />\nHopkins<br />\nher works, was the subject of WalLoyola<br />\npartment at the University and also<br />\nBerndt<br />\nL E.<br />\nO'Connell<br />\nter De La Mare's third lecture, una prominent consulting sanitary<br />\nMagill<br />\nLT.<br />\nSimpson<br />\nSlowik<br />\nLG<br />\nengineer, has recently served on a<br />\nWatson<br />\nder the auspices of the Turnbull<br />\nDay<br />\nC<br />\nEgan<br />\ncommittee<br />\nnationally<br />\nof<br />\nknown<br />\nhyMilinausky<br />\nFoundation. Mr. De La Mare beRG<br />\nThaler<br />\nBiddison<br />\nRT<br />\ndraulic civil and sanitary engineers<br />\nPolowitz<br />\ngan by pointing out three common<br />\nOles<br />\nR E.<br />\nShanahan<br />\ninvited<br />\nthe<br />\nby<br />\nsanitary<br />\ndistrict<br />\nof<br />\nfallacies with which people regard<br />\nTaylor<br />\nQ B.<br />\nEnright<br />\nTurnbull .. . . L.H.B........ Schmidt<br />\nChicago to make an exhaustive surPoetry, and then showed how, when<br />\nBeckwith . . . .R.H.B.<br />\nLinn<br />\nvey and report on its sewage disthese fallacies were removed from<br />\nBlandi<br />\nF B.<br />\nByrne<br />\nposal problem. This commission,<br />\nconsideration, many of the objeccomposed<br />\nof 28 engineers, repretions to Christina Rossetti's work<br />\nHopkins and Loyola, both having<br />\nsenting eighteen states and the Diswere overcome.<br />\nfallen victims of 26 to 0 scores at<br />\ntrict of Columbia, is the biggest<br />\n-The fact of these fallacies,\"<br />\nthe hands of their opponents last<br />\nboard of engineering skill and<br />\nsaid Mr. De La Mare, \"is that poweek, will endeavor to snap out of<br />\nscientific<br />\nability ever assembled.<br />\netry is likely to be the outcome of<br />\ntheir<br />\nruts tomorrow at Homewood.<br />\nThe honorary chairman of the comemotion, and particularly of emoEach has the intention of making<br />\ntions shared by the world at large, SOPH-FROSH CLASH SET FOR missioni is E. E. Haskell, dean<br />\nemeritus<br />\nCornell<br />\nof<br />\nUniversity,<br />\nand<br />\nthe other the stepping stone.<br />\nthe crises, the calamities, and the<br />\nDECEMBER 6TH<br />\na former member of the internaAs it was Mt. St. Mary's who deobsessions of the pa %sing hour.\"<br />\nAt last the date of the Freshman- tional boundary commission. The GOOD SEASON ANTICIPATED<br />\nChristina Rossetti wrote for herfeated Loyola last Saturday, comBY SWIMMING TEAM<br />\nSophomore football game and class active chairman is George Feller,<br />\nself, not for the world. Even when<br />\nparative scores would evidently<br />\nshe did refer to matters of the rush has been decided. The Stu- consulting engineer on water sup- Many Veterans Back From Last Year<br />\ngive Hopkins a 50-point margin<br />\nply and sewage for many American<br />\nAnd Some Promising Material<br />\nworld, she did so in a purely per- dent Council at its last meeting set<br />\nFrom Local High Schools<br />\ncities.<br />\nover<br />\nthe Catholics, but football is<br />\nsonal manner. In her poem on the date for December 6. On this<br />\nAccording to Capt. -Bob\" Welsh, one of the most uncertain games<br />\nOther prominent engineers on the<br />\nFrance, the bleeding, conquered memorable day will take place, the<br />\ncommission are: C. E. Grunsky, Hopkins will have the best swim- known. This was evidenced<br />\nFrance of 1871, she expresses her traditional struggle for supremacy<br />\nlast<br />\npresident of the American Society ming team this season that has ever<br />\nPersonal sorrow and sympathy for between the two classes. The footyear when St. John's fell before<br />\nof Civil Engineers; J. Hawley, conthe stricken country, but did not<br />\nball game will be staged first. In sulting engineer on the construc- sported the Black and Blue. This Maryland and Hopkins at 26 to 0<br />\neven hint at the event which caused between<br />\nthe halves of the gridiron tion of the Panama Canal; A. feeling of satisfaction is held by the and 3 to 0 scores, respectively. Yet<br />\nher poem. She wrote thus, not as<br />\nentire team because most of the old Maryland and Hopkins fought to<br />\nbattle will be a sort of preliminary Ames, dean of Engineering at<br />\nIowa<br />\na matter of will, of volition, but as<br />\nrush. This first combat between the State College; J. Hasskarl, builder veterans will be back for better<br />\na 6 to 6 standstill.<br />\na matter of personal necessity, of<br />\nrival forces will be of short dura- of the largest breakwater in Amer- performances than ever before, and<br />\nCoach Van Orman has no intenpersonal sorrow.<br />\ntion and will probably serve as an ica; and A. Phillips, builder of the because there are many new men<br />\ntion of letting \"Doug\" Turnbull<br />\n\"Another fallacy,\" said Mr. De accurate gauge as to the outcome of<br />\nlargest pumping station ill the who have already achieved very<br />\nLa Mare, \"is the belief that the ten- the final encounter of the evening,<br />\nsettle<br />\nthe issue with his toe, but is<br />\nworld. Another member of the fine results.<br />\ndency in poetry is toward the which is to be held immediately afboard from Baltimore is Ezra B. The list of men from last year intent upon routing the Jesuits in<br />\nmournful, the tragic, the melan- ter the football game.<br />\nWhitman, chairman of the Mary- will naturally be headed by \"Bob.\" his charges' initial encounter with<br />\ncholy. Yet the finest fiction, music, This year ancient traditions are<br />\nland Public Utilities Commission. He is in good condition and looks them. He will probably send the<br />\nPainting, even architecture, are, in to be revived in the manner of stagThe official title of the committee as if he will better the time of the same team against them as faced<br />\ngeneral, grave rather than gay, ing the rush. The oldest method on is<br />\nthe \"Engineering Board of Re- records that he now holds. An<br />\nthe heavy Pitt team last week. One<br />\ntragic rather than comic, impres- record, the flag rush, is to be used.<br />\nview of the Sanitary District of Chi- otherveteran on the team will be<br />\nsive rather than amusing.\" Chris- The Student Council was unanicago on the Lake Lowering Con- Fitz Dunning, last year's captain. or two minor changes may be made<br />\ntina Rossetti, no doubt was, in her mous in deciding to revive the<br />\ntroversy and a Program of Reme- Though Fitz has strained a liga- but this is uncertain.<br />\nPoetry, grave, even melancholy, on rush. In previous years many sysOur very nearness to the Catholic<br />\ndial Measures.\" The problem be- ment in his back, he is expected to<br />\nthe surface. However, when the in- tems were • used. All the juniors<br />\nfore the committee is as follows: do better than ever in the breast- college, which will be only two<br />\nnate beauty of her words, her and seniors can recall the battle<br />\nThe city of Chicago has construct- stroke and relay in the first meet. blocks away in the near future, is<br />\nthoughts are taken into considera- over the three footballs. Some can<br />\ned a canal leading from Lake Mich- Howard, Hopkins' star plunger, bound<br />\nto breed a, strong spirit of<br />\ntion, one cannot but believe that, recollect the memorable tug of war.<br />\nigan into a tributary of the Missis- will show a great development durin spite of the sad air of her work, None of these<br />\nrivalry.<br />\ncan compare to the sippi River, and into which it dis- ing the coming season. He is being<br />\nChristina Rossetti must have taken gory battles waged around the flags<br />\nThe Loyola team made a fine<br />\ncharges its sewage. The flow primed for the Intercollegiates and<br />\ngreat pleasure in her writing. In of the old classes. The idea of the<br />\nstart<br />\nthis season against Blue Ridge,<br />\nthrough this canal is 10,000 cubic meets of like calibre. Swanson, in<br />\nher poem \"When I Am Gone, Dear- flag rush is: one class is given a<br />\ncoming<br />\nout on top of a 30 to 0 vicfeet per second. So large, indeed, the breast-stroke;' McCleary, in the<br />\nest,\" the quiet beauty of the thought flag and told to defend it to the<br />\ntory.<br />\nTheir<br />\ndefeat Saturday at Emis this draft that the level of Lake back-stroke; Baldwin and Sauerwill give pleasure, not sorrow.<br />\nmitsburg<br />\nmust not be considered as<br />\ndeath against the onslaughts of the Michigan has been lowered five wein, in the dashes and relay, and<br />\nChristina Rossetti was born in opposing class. It has not been de- inches. This<br />\nhas caused navigation Stone and Calhoun, in the dives, the Hopkins game has been Loy1830. She was only one-fourth cided whether the Freshmen or the<br />\nand power interests along the Ni- should all turn in very good per- ola's goal all season. A victory<br />\nEnglish, three-fourths of her an- Sophomores are to be the defendover the Black and Blue would be<br />\nagara and St. Lawrence Rivers to formances during the season.<br />\ncestry was of the \"warm southern ers this year, but the Student CounThe new men, however, should the crowning achievement of their<br />\ntake the matter into the courts and<br />\nblood\" of sunny Italy. She began cil will announce that shortly.<br />\nTheir<br />\nthe litigation has been in progress be of great value. This is especially maiden gridiron season.<br />\nto write \"poetry\" when she was not<br />\nOwing to vastly superior num- for a period of years. The matter true of Bailey, the 100 and relay greatest disappointment lies in the<br />\nyet in her teens.<br />\nbers the Freshmen are conceded to has now reached Congress and ac- star, who has transferred from Cor- injury of \"Polly\" Byrne in last<br />\n\"'Come, cheer up, me lads, 'tis to be slight favorites. However, ard- cordingly the report of the commit- nell. He has an enviable record week's game. Byrne, who is the<br />\nent supporters of the class of '27 tee, which will be submitted in<br />\nglory we steer,'<br />\na and should prove of great value to backbone '.o.f the Catholic eleven,<br />\nAs the soldier remarked, whose claim that quality and not quan- few weeks' time, will<br />\nbe used as a the team. Bolton, in the 100, and may be prevented from participattity will decide the issue. The bet- basis for further arguments betore Henneter, in the dives from Poly. ing in the game because of an inpost lay to the rear.\"<br />\nThis couplet is the only part of ter organization of the Sophomores the rivers and harbors committee and Oles, the City College repre- jured leg. He was rushed to a hosher work of this period now pre- may prevail over the inexperienced of<br />\nCongress in bearinis on the sentative, in the dives and 220, will pital immediately after the team arserved. However, it was not until Freshmen, but everybody agrees pending lake level bill.<br />\nstrengthen the team considerably. rived in the city last Saturday night<br />\n1862 that her first book, \"Goblin that this year's rush will probably<br />\nOnly three losses of any conse- and there will be little chance of his<br />\nThe magnitude of this problem<br />\nMarket,\" was published.<br />\nbe one of the hardest fought in can be appreciated by the fact that quence will be suffered. Bahlke, being able to play tomorrow.<br />\nHer life was tinged by disap- many days.<br />\nthe City of Chicago has already the 220-yard and relay man, has<br />\nThe Black and Blue players esP9intrnents in love, by poverty, and<br />\nLudlow Baldwin was elected sec- spent on its sewerage system the been transferred to Northwestern caped with only a few minor inthe death of her nearest relatives. retary and treasurer at last week's sum of $200.000,000,<br />\nHambleton, in the juries. Day and Milinausky inwhich is six University.<br />\nBut we cannot find or read into her meeting of the Student Council. times as much<br />\nas the United State plunge, and Lord, in the relay, have jured their hips and Beckwith his<br />\nPoems any evidence of these hard- The Council settled the question of crient on the Panama Canal.<br />\nbeen lost through graduation. shoulder.<br />\nThese men, however,<br />\nships. \"A poet's life profoundly Freshman regulations for the rest<br />\nThough these men will be missed will have recovered enough to play<br />\nNOTICES<br />\naffects his work, but we may not of this year. It was decided to revery much, it, is confidently expect- Saturday. Malonee, who showed<br />\nREGISTRAR<br />\nbe able actually to see the results quire Freshmen to wear their black<br />\ned<br />\nthat their places will be compet- his prowess against Pitt, may beThe Registrar's office anof his life in his poems,\" said Mr. ties, black socks, caps and 'pins at<br />\nnounces that a fine of five dollars<br />\nently filled.<br />\ncome a regular end, while Almy<br />\nwIll be collectd from all students<br />\nDe La Mare.<br />\nall times when they were on the<br />\nThe<br />\ndates<br />\nfor<br />\nfollowing<br />\nthe<br />\nten- may also become a first-string man.<br />\nwho did not file their schedule of<br />\nIn summing up his remarks on campus. This ruling was passed<br />\ntative<br />\nschedule have not been defihours with the Registrar before<br />\nTomorrow may bring the first of<br />\nWednesday. Oct 15.<br />\nChristina Rossetti, Mr. De La because some of the Freshmen misnitely fixed: Navy, away; Lehigh. a series of annual games that will<br />\nNEWS-LETTER<br />\nMare said, \"Her style is natural. understood the rule and attended<br />\naway; Swarthmore. at home; Rut- rival the Army and Navy conflicts<br />\nMeeting of Ed.torial and Buseasy, although occasionally touched +-he Tea dances minus their required<br />\niness Staffs of NEWS-LETTER<br />\ngers, at home; Catholic University, in spirit among the local gridiron<br />\ntoday at 12.20, in the Barn.<br />\nequipment.<br />\nContinued on page 2, col. 5<br />\nContinued on\"page 4 col. I<br />\nfans.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 24, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nPeople always seej<br />\nyour hair first<br />\n<br />\n•<br />\n<br />\nTo the NEWS-LETTER Mailbag:<br />\nJohns Hopkins undergraduates<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nhave<br />\nplenty of cause to deplore the<br />\nHopkins University.<br />\nway in which they have been treated<br />\nin regard to the lectures delivered<br />\nBusiness communications should be addressed to ,the BUSINESS MAN- in the C. E. Hall by Mr. De<br />\nLa<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nMare. It is a 'lamentable fact that<br />\nshould be sent to the MANAGING EDITOR.<br />\nIn jars and tubes, at your college<br />\nO matter how carefully you<br />\nthe Turnbull lectures, primarily indrug store. Apply a little Stacomb<br />\nare dressed—you cannot look<br />\nyour best if your hair is straggly, tomorrow morning, and look your<br />\ntended for Hopkins students, have<br />\nbest all day!<br />\nTelephone<br />\nHomewood 0100<br />\nunkempt.<br />\nnow developed into courses enjoyed<br />\nToday well-dressed men, in colmainly by female students attendlege and in business,have found just<br />\nwhat they need to keep their hair<br />\ning Goucher and other nearby colin place—Stacomb. This delicate,<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ninvisible cream will keep the most<br />\nleges. That this, a Hopkins' tradiR. CARMICHAEL TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nunruly hair in place all day long.<br />\nKEEPS THE HAIR l.N PLACE<br />\ntion, has become so thoroughly nonManaging Editor<br />\n;;I:-S,.. •<br />\n/77<br />\n\\.t\\<br />\nHopkins, is a fact which is astonALGER HISS, '26<br />\nAdvertising Manager<br />\nDept. fit-4<br />\nishing in its truth, and disgusting<br />\nInc.,<br />\nLaboratoties,<br />\n'York City<br />\nALFRED J. McKAY, '26<br />\nAssistant Managing Editor<br />\nSt.,NeW<br />\nin its conspicuousness.<br />\nStandard.<br />\na gener18th<br />\nRE<br />\nE<br />\ncharge,<br />\nWest<br />\nERNEST A. STRATHMAN, '26<br />\nof<br />\n113<br />\nfree<br />\nThe<br />\nundergraduate<br />\nstudent<br />\nbody<br />\nb.<br />\nOFFEl_k<br />\nme, of Stacom<br />\nsend tube<br />\nCirculation Manager<br />\nPleasewnple<br />\nAssociate Editors<br />\nhas lost a much-treasured possess<br />\nous<br />\n.• •••<br />\nOTHO J. KELLER, III, '26<br />\n. . ..<br />\nBENJAMIN T. ROME, '25<br />\nsion; it finds itself practically<br />\n•<br />\n.•<br />\n•<br />\n•<br />\n•<br />\nAddress<br />\nARTHUR L. NELSON, '26<br />\n........<br />\n\"booed\" from the lectures which<br />\nAssistant Business Managers<br />\nJunior Editors<br />\nwere founded for its benefit. Lack<br />\nG. DONALD GIESKE, '25<br />\nEDWARD 0. MICHEL, '26<br />\nof<br />\nsufficient space, no doubt, can<br />\nJAMES YOUNG, '25<br />\nJ. JACKSON KIDD, '26<br />\nbe<br />\nattributed<br />\nto the congested audi- GRADUATE STUDENTS HAIL<br />\nHENRY R. TURNBULL, '26<br />\nT. STRAN SUMMERS, '25<br />\nFROM 33 STATES<br />\nA. RISLEY ENSOR, '26<br />\nences. The writer is not condemnHEYWARD E. BOYCE, JR., '27<br />\nJ. HENRY JARRETT, '27<br />\nThere<br />\nare two hundred and<br />\ning the size of the audiences, but<br />\nROBERT T. SAUERWEIN, '26<br />\nCHARLES F. REESE, '27<br />\nARTHUR SWANSON, '27<br />\nW. BARNES HALL, '27<br />\nhe is bewailing the fact that Gouch- ninety-one graduate students ater College students and others in no tending the University this year.<br />\nway connected with the university, The school is more cosmopolitan<br />\nMember Southern Intercollegiate Newspaper Association<br />\nare occupying the seats which rightthan ever before, for included in it<br />\nfully belong to Hopkins' De La<br />\nare representatives of thirty-three<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Mare admirers.<br />\nFrankly, the issue is: \"Are we to states, two Canadian provinces, and<br />\nsurrender our seats to members of four other foreign nations. MaryHOMEWOOD, BALTIMORE, MD., OCTOBER 24, 1924<br />\nSanford's<br />\nthe opposite sex and thus obey a land, of course, has the largest repPEN MI<br />\nfOlINTAIN<br />\nEASY-FLOWING<br />\nprerogative of etiquette, or are we resentation, having 163 students,<br />\n5<br />\nto demand our rights? Which is<br />\n1 ANFORCI mro.co.<br />\nHOSPITALITY<br />\n\"The<br />\nwhile Virginia, Pennsylvania and<br />\nthe<br />\nstronger,<br />\netiquette<br />\nor<br />\njustice?\"<br />\nAlthough Johns Hopkins is the most northern Southern college<br />\nINK<br />\nIt is the duty of the registrar to the District of Columbia follow in<br />\n1<br />\nI<br />\nand the most southern Northern college, in the matter of hospitality<br />\norder.<br />\nOnly<br />\nten<br />\nforeign<br />\nstudents<br />\nremedy<br />\nthe<br />\npresent<br />\nevil.<br />\nThat<br />\ncan<br />\nPOSSIBLE\"<br />\nFountain<br />\nPen<br />\nMade<br />\nthe<br />\nThat<br />\nit is desirous of making its Southern affiliations unmistakable. Sigma<br />\nChi Beta in the past has always greeted and entertained visiting be done by reserving a section of are found on the register this year,<br />\nteams. This year the extending of hospitality has been the para- seats for Hopkins men. It is only of whom exactly half are Chinese.<br />\nmount purpose of the fraternity. Teams from Randolph-Macon, Mt. fair that a Hopkins lecture, pri- Two hail from Canada, and one<br />\nSt. Mary's and Pittsburgh have been escorted to the tea dances fol- marily established for Hopkins, de- each from England, Ecuador and<br />\nlowing the football games. Arrangements have been made to meet livered in a Hopkins building, Palestine.<br />\nIt is interesting to note the varied<br />\nall teafns at the railroad station and to entertain the visitors during should be enjoyed to a considerable<br />\nextent by Hopkins undergrdauates. number of \"majors\" pursued by the<br />\ntheir stay at Hopkins.<br />\n•D. BELL. graduates. Twenty-eight subjects,<br />\nSigma Chi Beta, however, not satisfied with a single line of acincluding every conceivable intertivity, is beginning tomorrow to put into execution its plans for the<br />\ncoming year and to demonstrate its worth as an organization. The FIFTY PRACTICE LACROSSE est, are to be found on the schedLacrosse is off to a good start ule. Chemistry is the most popular,<br />\nsociety has volunteered to take complete charge of ushering at the<br />\nin<br />\nthe 1924-25 campaign. Prac- while education and English are<br />\ngames. In this way, it is believed, supporters of Hopkins will come<br />\nSHERWOOD BROTHERS, INC.<br />\ntices<br />\neven at this early date do next on the list. Sanscrit has one<br />\ninto contact with men representative of the University.<br />\nq4 kileetee<br />\nnot lack variety. The team already adherent, Germanic philology,<br />\nii I4I4<br />\ntwo;<br />\nSemetic<br />\nlanguages,<br />\nthree,<br />\nwell supplied with 25 men from<br />\nCHEERING<br />\nlast<br />\nyear's squad will be strength- and plant physiology, four.<br />\nIn an attempt to awaken the students of our friendly rival,- the<br />\nTO HAVE CRITICS IN<br />\nComparatively few are majoring JAY<br />\nUniversity of Maryland, to the fact that cheering at games has a ened with approximately the same<br />\nNEXT ISSUE<br />\nin Romance languages, a subject<br />\ndirect bearing on the success of a team, the Editor of the Diamondback. number of recruits who have. good<br />\nwhich usually has a rather large<br />\nremarked that Navy's cheering is without equal because everyone stickwork, to say nothing of the<br />\nThe next issue of the Black and<br />\nfollowing.<br />\nri ifteen study French,<br />\nnovices<br />\nwho<br />\nshow<br />\na<br />\nmarked imcheers. This is undoubtedly a true deduction.<br />\nBlue Jay, which will appear on<br />\nCheering at Hopkins might be improved by everyone cheering provement in their handling of while but three are taking Spanish November 10, will have several<br />\nand similarly the body of rooters might be enlarged by every Student the stick.<br />\nstartling innovations: Present<br />\nCoach Schmeisser has left the CLASS OFFICERS ELECTED plans call for a page devoted to<br />\nsitting in the rooting section. Game after game it has been noticed<br />\nAT FRESHMAN MEETING<br />\nthat the rooting section has been depleted because a number of actual working out of the squad<br />\nthe reviewing of current books<br />\nto•the older, men. In the absence<br />\nToni Biddison was the unani- and another page is to be given<br />\nstudents insist upon leaning on the fence by the side lines.<br />\nSigma Chi Beta has been given authority by the Student Council of Captain Turnbull the oldest mous choice of the freshman class over to dramatic criticism. The<br />\nand the Athletic Association to assemble all students in the rooting player on the field directs pro- for vice-president at a meeting men in charge of these departsection. This fraternity is attempting to fulfill this aim by appealing ceedings. To do away with mo- held Tuesday at 12.30 in the C. E. ments have not been announced<br />\nto the loyalty of the \"fence-leaners\". This action has been heartily notony the squad is run through Hall. After the ballots had been as yet.<br />\napproved by the Student Council and it behooves all to lend support various fundamentals in stick- officially counted by representaThis vill be the first time that.<br />\nto Sigma Chi Beta.<br />\nwork. Stress is laid on passing, tives of the Student Council it the Jay has attempted to mix the<br />\nshooting goals, and picking up the was found that Mallonee was sec- sublime with the ridiculous, alball. The last 15 or 20 minutes retary, Bolton treasurer and Igle- though other humorous magaESPRIT DE CORPS<br />\nof<br />\npractice are devoted to a game hart sergeant-at-arms. The latter zines have been following the<br />\n()allege spirit was sadly lacking in those Freshmen and upper<br />\nof<br />\ntag in which the 'entire squad was also elected manager of the practice for some time. The nevv<br />\nclassmen who left the field at the Pittsburgh game before the final<br />\ntakes<br />\npart.<br />\n'28 football team.<br />\nwhistle. The eleven men out on the gridiron were fighting a valiant<br />\ndepartments are expected to be<br />\nPractices are held every TuesA pep committee was chosen, permanent.<br />\nif losing battle. It did not help those men to fight harder when they<br />\nsaw nearly a hundred Hopkins men leave the stands just at the mo- day, Wednesday and Friday. composed of the following men:<br />\nment when the team, was most pressed. No one thought of leaving Right now is the time for *new White, Scherr, Lawrence, Wood<br />\nDE LA MARE LECTURE<br />\nat the Mt. St. Mary's game when Hopkins was on the long end of men to come out and get stick- and Thomson. The purpose ot<br />\nContinued from page 1<br />\na twenty-one to nothing score. It certainly seems as if the fighting work. The coach desires especial- this committee, as announced, is with the ceremonious. It is at time5<br />\nstreak were left out of the make-up of some of our students. The ly men who have been unsuccess- to generally look after the a little stilled, even frigid, arid<br />\nteam can not put forth its best efforts until it knows that every stu- ful in track. It often happens that \"Frosh\" and instill pep into them sometimes almost demure. Here<br />\ndent is out rooting hard for victory.—G. W. H.<br />\nmen who have been unable to run for all activities.<br />\nand again we find her quiet humor<br />\na straight course on a track deThe football team was discussed and buoyancy of spirit, but cries<br />\nThe NEWS-LETTER regrets to announce the resignation of velop into the best of lacrosse but action was postponed await- from the heart are as rare as gynv<br />\nplayers.<br />\ning the appointment of a coach. nastics of the intellect.\"<br />\nJohn W. Parsons, '25, from the position of Associate Editor.<br />\n<br />\nDon't let unkempt hair<br />\nspoil your whole appearance!<br />\n<br />\nN<br />\n<br />\n4,1<br />\n<br />\nRef 1 With<br />\nORD'S<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 24, 1924<br />\n<br />\nNMI<br />\n<br />\nORGANIZATION MEETING<br />\nOF A. S. C. E. HELD<br />\nPlans for the coming year were<br />\noutlined by President William<br />\nKaufholz at the organization meeting of the Hopkins student chapter of the American Society of<br />\nCivil Engineers, held last Friday,<br />\nOctober 18. It was announced that<br />\nthe speaker for the regular meeting<br />\nFriday, October 24, will be Mr.<br />\nEarl Stimson, chief engineer, maintenance of way, of the Baltimore<br />\nand Ohio Railroad. Mr. Stimson,<br />\nwho is one of the most prominent<br />\nengineers in the city, delivered last<br />\nyear one of the \"Engineering Practice\" lectures, given annually by<br />\nthe School of Engineering.<br />\nToday's meeting will be followed<br />\nby a smoker, as is customary. The<br />\nschedule of monthly meetings to be<br />\ngiven this year was not announced<br />\nat this meeting but negotiations are<br />\nbeing made with several important<br />\ncivil engineers to address the future meetings.<br />\nOfficers of the society expect that<br />\nthe membership will be practically<br />\ndoubled this year, as the enrollment in the civil engineering department has increased in a similar ratio. Although freshmen are not<br />\neligible, the enrollment of upperclassmen has reached almost one<br />\nPUBLICITY BOARD TO MOVE hundred per cent in the last two<br />\nyears.<br />\nINTO NEW OFFICE<br />\nThe Publicity Board has been<br />\nPromised a room as an office in the GRASS CUT FOR LAST TIME<br />\nbasement of the new Chemical LabThe Dormitory lawn has received<br />\noratory, according to the Board's .ts last \"hair cut\" of the season.<br />\nsecretary. The publicity agents will fuesday afternoon an employee of<br />\ninove into their new quarters early he University \"just knocked off<br />\nnext week. The exact room has he rough,\" as he said. This was<br />\nnot been<br />\nannounced by Dean Ames. he last time that a lawn mower will<br />\nA meeting will be held next Mon- -lick across the court until Spring<br />\n(1aY, notice of which will be posted. ')ursts forth on the campus.<br />\nDEBATING COUNCIL PLANS<br />\nIMPORTANT CONTESTS<br />\nDebating will regain some of its<br />\nformer prestige at Hopkins if the<br />\nPlans for the present season are<br />\ncarried out. The first step was<br />\ntaken a week ago, when candidates<br />\nWere called for the freshman and<br />\nsophomore debating teams. The<br />\nzmnual debate between the two lower classes will be held at an Assembly on either December 11 or<br />\n12. In January the juniors and<br />\nseniors will clash.<br />\nProspects for the varsity debating team are bright; although Gross<br />\nis the only regular back from last<br />\nyear, a successful team should be<br />\nbuilt up from members of last<br />\nyear's class teams and from freshmen who have had experience in<br />\ndebating.<br />\nA very attractive schedule is in<br />\nthe making. The team will go to<br />\nLexington, Va., to hold a triangular<br />\ndebate with Washington and Lee<br />\nand the University of North Carolina. A trip to the University of<br />\nRichmond to hold a _return debate<br />\nIS Practically<br />\nassured. _In the contest held at Hopkins last year, Rich ni°nd was the victor. Debates with<br />\nother college teams are -pending, including- one with the University<br />\nof Virginia.<br />\n<br />\nRIFLE TEAM BEGINS RANGE<br />\nPRACTICE<br />\nBang! Zip! Bull's-eye!<br />\nWith this brief introduction the<br />\nRifle Club began range practice<br />\nMonday, up in the North attic of<br />\nGilman Hall. According to Lieutenant Sherwood, who is coaching<br />\nthe club, a great many students<br />\nhave become interested in sharpshooting this year, and from 9:30<br />\nA. M. to 4:00 P. M. every day,<br />\nlife on the range is just one sharp<br />\nreport after another. Due to large<br />\nmembership a schedule ,has been<br />\nposted with the names of men assigned to certain periods of practice<br />\nduring the week.<br />\nTo add a pinch of ginger to the<br />\ndaily practicing, contests will be<br />\nstaged among the club members<br />\nthemselves in a few weeks. Details<br />\nwill be announced later.<br />\nExact dates of shooting matches<br />\nwith other colleges have not yet<br />\nbeen decided upon, but it is said<br />\nthey will be held some time in December. At that time, the 15 men<br />\nmaking the highest scores the week<br />\nbefore each match will compete<br />\nwith the opposing team. One hundred is the standard of perfect<br />\nmarksmanship, each man getting<br />\nten shots at his target and each<br />\nbull's-eye counting ten points.<br />\nCommenting upon results so far,<br />\nLieutenant Sherwood said: \"It is<br />\ntoo early to form any definite idea<br />\nas to how many real sharpshooters<br />\nare in the making or already made,<br />\nbut rivalry is very keen and no one<br />\nwastes his ammunition. I feel sure<br />\nthat with its large enrollment and,<br />\nincidentally, with its eight brandnew rifles, the club will produce this<br />\nyear an unusual team.\"<br />\n<br />\n3<br />\n<br />\nErnest G. Leimbach<br />\n<br />\nSENIORS<br />\n<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\n<br />\nJUNIORS<br />\n<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nSOPHOMORES<br />\nFRESHMEN<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nSt. Regis<br />\n<br />\nWARNER & CO.<br />\n<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n<br />\nHatters<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br />\n<br />\nOpen All Hours<br />\n<br />\nNear Your Campus<br />\n222 & 224 W. Baltimore St.<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nDOUG TURNBULL<br />\nRepresentatives<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nTOM MAGILL,<br />\nManager<br />\n<br />\nSHIRTS<br />\n<br />\nLeFranc & Ault<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER<br />\n<br />\nPRINTER<br />\n<br />\n.11<br />\n<br />\n421 N. HOWARD ST.<br />\n<br />\nSTATIONER<br />\n<br />\n229 N. CHARLES ST.<br />\n<br />\nNECKWEAR<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nBaltimore's Best Store<br />\n<br />\nHOCHSCHILD,KOHN 8cCo.<br />\nHoward and Lexington<br />\n<br />\nFRESHIE<br />\n<br />\nAt theekick-off<br />\n<br />\n(Many pardons, Mr. Kipling)<br />\nThe new man conies to college fresh, unknowing of its ways,<br />\nIt doesn't take him long to learn—provided that he stays!<br />\nFor there are always Sophomores on the job, all willing Tutors<br />\n<br />\nWho make, enforce and set the rules until the Freshman cries:<br />\n\"0 it's Freshie this and Freshie that and Freshie 'Off the grass,'<br />\nOr Freshie 'kindly step aside to let your elders pass;<br />\nTo let your elders pass, my Frosh, to let your elders pass,'<br />\nAnd it's Freshie, 'kindly step aside to let your elders pass'!\"<br />\n<br />\nDa<br />\nIN<br />\n<br />\nlIld<br />\nOhl<br />\n<br />\nral<br />\nznt<br />\nto<br />\n)ks<br />\nren<br />\n'he<br />\n,rt-<br />\n<br />\niat<br />\nthe<br />\nal;a-<br />\n<br />\neW<br />\nbe<br />\n<br />\nind<br />\n<br />\nere<br />\nclot'<br />\n<br />\nYour Sheaffer pen<br />\nwill prove to be your<br />\nmost valuable assistant in the game of<br />\nschool or business.<br />\n<br />\nwise,<br />\n<br />\n,The Sophomores keep a watchful eye and use a heavy hand,<br />\nrheY brand the Freshman black and blue—true to colors understand,<br />\nBut when the football game comes 'round it's Freshmen,<br />\n\"out to cheer<br />\nIle team is fightin' on the field, they need your fightin' here!\"<br />\nIt's Freshie this and Freshie that and Freshie \"out to yell,<br />\nThe \"even on the field can't win unless you cheer them well ;<br />\n<br />\nGive your pen<br />\na drink of<br />\n<br />\nMakes the<br />\nbest pen write<br />\nbetter.<br />\n<br />\nUnless you cheer them well, you Frosh, unless you cheer them<br />\nwell,<br />\nThe leven on the field can't will unless you cheer them well.\"<br />\nThe Freshman enters Gilman Hall by tunnel at the rear,<br />\nlie wears his cap day in, day out and walks sometimes with fear,<br />\nFor behind<br />\nhim lurks a critic Soph a-watchin' every step—<br />\nBut it's<br />\n\"come on join activities, it's that we want—your pep !,,<br />\n0 it's Freshie this and Freshie that, it's Freshie \"join the band;<br />\nThe Barnstormers have vacancies, the papers want your hand!<br />\nThe papers want your hand, good Frosh, the papers want your<br />\nhand,<br />\nNews-Letter or the Blue Jay, for the papers want your hand<br />\nOr it's \"come out for the football team, they need a sturdy crew;<br />\nScholastic duties first, perhaps, but still, the sports need you,<br />\n,<br />\nAnd you need sports and exercise to grow up like a Soph—<br />\nith too much grinding, too much work you'll be a puny prof!\"<br />\nIt's Freshie this and Freshie that, but all they want's your pep,<br />\nYOU may not make a team at first or even place, and yet,<br />\n\"Try and try again, my Frosh, try and try again,<br />\nIf at first you don't succeed—just try and try again!\"<br />\n<br />\nTIV<br />\n<br />\n—By Louis P. Hamburger, Jr.<br />\n<br />\nCHEAFFER'S Lifetime<br />\nPen is the master of all<br />\nwriting instruments.<br />\nThe 46 Special is made with<br />\nthe same care and precision<br />\nas all Sheaffer pens and<br />\npencils.<br />\nThe Student's Special is designed for students and is<br />\nthe ideal pen at the price<br />\nfor classroom or study.<br />\n<br />\nNew Yor;<br />\n370 7th Avenue<br />\n<br />\nChicago<br />\n506 Republic Bldg.<br />\n<br />\nLifetime<br />\n$8.75<br />\n<br />\nStudent's<br />\nSpecial<br />\n$3.75<br />\n<br />\nSold By The Better<br />\nDealers Everywhere<br />\n<br />\nHEAFFE<br />\nPENS \"LIFETIME\" PENCILS<br />\nW. A. SHEAFFER PEN CO., Fort Madison, Iowa<br />\n<br />\nDenver<br />\nSO2 Jacobsen 1114.<br />\n<br />\nSan Francisco<br />\n681 Market Street<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 24, 1924<br />\n<br />\nJUNIORS DEFEAT FRESHMEN \"BLUE JAY SIX\" EXPANDS<br />\nIN CLOSE BASEBALL<br />\nTO INCLUDE TWELVE<br />\nCONTEST<br />\nFive-Inning Game Furnishes Thrills<br />\nA Plenty As Second Inter-Class<br />\nMatch Is Staged<br />\n<br />\nJ. J. Scherr Is Leader of Recently<br />\nOrganized Hopkins Orchestra<br />\n<br />\nThat the Johns Hopkins University is to have an orchestra comparable with any other similar college<br />\norganization in the country, has<br />\nbeen virtually assured, according to<br />\nWe;hl Pen and Eversharp are<br />\nobtainable in matched<br />\nMr. J. J. Scherr, who has been<br />\nsets<br />\ninstrumental in organizing the<br />\n\"Blue Jay Twelve.\" This group of<br />\nmusicians, which consists of men<br />\nof ability and experience, is an outgrowth of the well-known \"Blue<br />\nJay Six,\" idolized by the patrons of<br />\nthe various university dances.<br />\nAn unqualified guaranteestands<br />\nAlthough the newly formed orback of every Wahl<br />\nproduct<br />\nchestra is to be primarily a Hopkins organization, it hopes to establish its reputation throughout the<br />\nEast. This talented group is contemplating an engagement at the<br />\nMaryland or Rivoli. That comparatively recent musical innovation,<br />\nJuniors Tie Score<br />\nclassical jazz, will be produced by<br />\nThe freshmen started out well.<br />\nDowning, the first man up, walked, Mr. Scherr's jazz exponents, who,<br />\nstole second, and scored on Shul- in all probability will furnish the<br />\nties' hit. The juniors, however, music for the university's formal<br />\ncould not put a run across until the dances of the season.<br />\nSide by side in your pocket, Eversharp and Wahl<br />\nThe personnel of the \"Blue Jay<br />\nPen are ever ready to serve your thoughts.<br />\nthird stanza, when Goodwin tied<br />\nDurability and dependability are common qualities<br />\nthe score with a single, two stolen Twelve\" is one which seems to asof these economical, practical writing companions.<br />\nbases, and a passed ball by Proc- sure success for the Hopkins orThe non-clogging rifled tip, quick reloading, and<br />\ntor. The winning run was scored chestra. J. J. Scherr, the leader,<br />\nwho<br />\nplays<br />\nthe<br />\nsaxaphone,<br />\nplayed<br />\nhas<br />\ninterchangeability of parts are among the<br />\ncomplete<br />\nin the following frame, on hits by<br />\nwith<br />\nGarber<br />\nDavis<br />\nof<br />\nCornell<br />\nfeatures<br />\nwhich make the perfected Eversharp.<br />\nsix<br />\nnew<br />\nHomer and Graser.<br />\nother<br />\nfame.<br />\nThe<br />\nare<br />\nsaxaphonists<br />\nAnd the Wahl all-metal Pen is at par with EverIn the last inning, the freshmen<br />\nMr.<br />\nBetz,<br />\nformerly<br />\nwho<br />\nwas<br />\nwith<br />\nsharp in giving thorough satisfaction. Light in<br />\nmade a valiant effort to win. With<br />\nweight, perfect in balance, resistant to wear, and<br />\none down, Shultack doubled, but \"Bob\" Iula, and Mr. Sater, of<br />\nbeautiful in design—it is the ideal pen.<br />\nwas out trying to stretch the hit. \"Fred\" Robbin's Century Roof Orchestra.<br />\nMessrs.<br />\nUrner<br />\nand<br />\nPenWahl Pen, $5 to $55.<br />\nEversharp,<br />\n$1 to $45.<br />\nShulties then followed with a long<br />\nrose,<br />\nboth<br />\nmusicians<br />\nof<br />\nlocal<br />\nfame,<br />\nhit that was good for three bases.<br />\n{Made in the U.S.A. by THE WAHL COMPANY,Chicago<br />\nArmor, clean-up man, emulated are the club's banjoists. Other memCanadian Factory,THE WAHL COMPANY,Ltd.,Toronto<br />\nManufaCturers ofthe Wahl Eversharp and the Wahl All-MetalFountain Pen<br />\nCasey, however, and dashed all bers of the orchestra, all of which<br />\nhave had experience in their rehopes for victory.<br />\nspective<br />\nlines, are: Messrs. Light,<br />\nGoodwin and Homer were the<br />\nviolinist;<br />\nChamberlain, trombonist;<br />\nstars of the winners, while CalaConant<br />\nand<br />\nMcElfresh, cornetists ;<br />\nbrisi, who pitched the first two inheNew PERFECTED<br />\nVanneman,<br />\ndrummer;<br />\nTovell, Wnings, played best for the losers.<br />\nhist ; Steinwald, pianist.<br />\nThe Line-Ups:<br />\nThe lineup for the freshmen was<br />\nas follows: Downing, 3b; Shultack, R. 0. T. C. UNIT LARGEST<br />\nss ; Shulties, lf ; Armor, cf ; Wyatt,<br />\nSINCE ORGANIZATION<br />\nrf ; McElfrish, lb; Fenimore, 2b;<br />\nGreenfield, C; Proctor, c; Calabrise, Every Availabk Minute Being Devoted<br />\nTo Instruction On Drill Field<br />\nILMEMAIIIMIN=IMENIMM\\<br />\np ; Carrico, p.<br />\nLatest<br />\nreports<br />\nfrom<br />\nthe<br />\nMilitary<br />\nThe junior lineup was: Wasserman, ss ; Lane, 3b; Thompson, lb : office indicate that the R. 0. T. C.<br />\nHomer, c; Fonda, 2b; Baldwin, cf ; unit this year will surpass in numORDERS RECEIVED FOR<br />\nGroser, rf ; Ziv, if; Goodwin, p. ber and quality any that has been<br />\nMANUFACTURING JEWELERS<br />\nSCORE BY INNINGS:<br />\nturned out since the introduction<br />\nFreshmen<br />\n1 0 0 0 0-1<br />\nLancaster, Pa.<br />\nof this organization at Hopkins.<br />\nJuniors .<br />\nTransfer & Baggage Express<br />\n.0 0 1 1 x-2<br />\nClass Rings, Pins, Fraternity Pins<br />\nEveryone in the department is<br />\nCups, Medals, Etc.<br />\nAUTOMOBILE SERVICE<br />\nSTUDENT ACTIVITIES CARDS working to advance Hopkins' name<br />\nStationery, Invitations, Programmes<br />\nPHONE, HOMEWOOD 6886<br />\nSecretary Campbell, of the Stu- on the honor list. The University<br />\n\"Makers of the Varsity Seals\"<br />\ndent Activities Council, announces has been represented on this list<br />\nthat it is necessary for every<br />\nfor the last two years, in spite of<br />\nfreshman to get himself a Student<br />\nthe fact that it has bad to compete<br />\nActivities<br />\ncard<br />\nimmediately.<br />\nThese cards entitle the holder to with military colleges, which devote<br />\nBIRDERS<br />\nPRIRTERS<br />\nsubscriptions to the Blue Jay and a great deal of time to practical in- ERGRADERS<br />\nNews-Letter, a copy of the Hulla- struction.<br />\nBecause of a lack of time for<br />\nbaloo, Barnstormers and Musical<br />\nClub tickets, and several other drilling, last year's unit did not<br />\n.TWCornerciyelie and Cutaw Sis.<br />\nthings of interest to Hopkins men. reach the hight standard that would<br />\nhave<br />\nbeen<br />\npossible<br />\notherwise.<br />\nEvery<br />\nUnless you have one of these<br />\n-Where Wholesale and Retail Districts Meet'.<br />\ncards in your possession, the ben- available moment will be devoted<br />\nefits to be derived from them will this year to this branch of the work<br />\nin an effort to compete with the<br />\ncease.<br />\nStudent Activities cards are military colleges. Drilling has been<br />\ngiven at the Barn daily from 12.30 going on for only three weeks, but<br />\nto 1 P. M. Bring your treasurer's the new men have been rounded<br />\ninto form, and on the whole prereceipt with you.<br />\nsent a very military appearance.<br />\nand individuality is offered here at prices that are not<br />\nThe contest for an emblem to be<br />\nGOOD SEASON ANTICIPATED BY<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nSWIMMING TEAM<br />\nplaced on the caps worn by the<br />\nCBesides the reputation of an old-established firm<br />\nContinued from page<br />\nPrinters of<br />\nmen, will be open until November<br />\nis back of each sale with a guarantee.<br />\naway; Boston Tech, away; Brown. 15, after which no designs will be<br />\ncThe Johns Hopkins<br />\nat home. So, with most of the vet- accepted. They must be in black<br />\nNE1DS,LETTER<br />\nerans back from last year, new men and white, actual size, and are to be<br />\nwith experience, and a hard sched- turned in at the Military office in<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nule, Hopkins will have a swimming a sealed envelope bearing the con343 NORTH CHARLES STREET<br />\nteam of which it may well be proud. testant's name.<br />\nLOM BARD and SOUTH STREETS<br />\nIn one of the best exhibitions of<br />\ninter-class baseball ever seen at<br />\nHopkins, the juniors vanquished<br />\nthe freshmen by the score of two<br />\nto one. The game which was replete with thrills from the first inning until the fifth, was not decided<br />\nuntil the final out. The remarkabL<br />\npart of the game was the extremely low number of errors committed by the two teams. But three<br />\nmiscues were made by the losers<br />\nwhereas the winners were credited<br />\nwith five, a truly small total for an<br />\ninter-class game. Even one or two<br />\nof these might have been averted<br />\nhad it not been for the autumn chill.<br />\nGoodwin, of the juniors, pitched<br />\nexcellent ball, striking out eleven<br />\nmen, and holding the opposition to<br />\nsix hits. Shulties was the batting<br />\nstar, getting a triple and a single in<br />\nthree times up.<br />\n<br />\nComplete Writing Equipment<br />\n<br />\nT<br />\n<br />\nFM511APP<br />\n<br />\n691VAIII \"JV<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\nJ. F. APPLE CO.<br />\n<br />\nCOGGIN'S<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP 8z SONS<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 7<br />\nDE LA MARE LECTURES ON<br />\nCHRISTINA ROSETTI;<br />\nPOINTS OUT FALLACIES<br />\nAppreciation of Rosetti Marks End Of<br />\nBelief in Common Poetical Fallacies, Says Lecturer<br /><br />\nHOMEWOOD, BALTIMORE. MD., OCTOBER 24, 1924<br /><br />\nSenior Presidency<br />\nStill Undecided<br />\nBecause of a class by-law<br />\nrequiring a majority in all<br />\nelections, W. C. Calhoun and<br />\nW. K. Morrill are deadlocked<br />\nfor President of the Senior<br />\nClass. At the elections of the<br />\nclass on Wednesday, Calhoun,<br />\nalthough . possessing a large<br />\nplurality, did not have enough<br />\nvotes to satisfy the majority<br />\nrequirement. A revote will be<br />\ntaken in the near future.<br />\nOther results of the elections were: M. Urner, VicePresident; R. Wienefeld,<br />\nSecretary; D. Reese, Treasurer; K. Miller, Sergeant-atArms.<br /><br />\nHOPKINS PROFESSOR IS A<br />\nMEMBER OF IMPORTANT COMMITTEE<br />\nProf. John H. Gregory, Head of Civil<br />\nEngineering Dept., Consulted By<br />\nCity of Chicago<br /><br />\nDr. Willoughby Attends<br />\nGeneva Conference<br />\nAccording to a cable received Monday by a local<br />\nnewspaper, Dr. W. W. Willoughby, professor in Political Science at the Johns Hopkins University, has arrived<br />\nat Geneva, Switzerland, where<br />\nhe is participating in the.<br />\nLeague of Nations discussion<br />\non the Chinese opium trade.<br />\nChina has retained Dr. Willoughby as Constitutional Advisor to see that the rights of<br />\nthat country are not infringed<br />\nupon M the league's effort to<br />\nbreak the opium traffic. Dr.<br />\nWilloughby has played an important part in the development of the government of<br />\nChina.<br /><br />\nPRICE 5 CENTS<br />\nLOYOLA WILL MAKE DEBUT<br />\nAT HOMEWOOD AGAINST<br />\nHOPKINS TOMORROW<br />\nCatholic College Will Inaugurate Series<br />\nOf Annual Gridiron Games<br />\nWith Hopkins<br /><br />\nProfessor John H. Gregory,<br />\nChristina Rossetti, her life and<br />\nhead of the Civil Engineering DePROBABLE LINE-UP:<br />\nHopkins<br />\nher works, was the subject of WalLoyola<br />\npartment at the University and also<br />\nBerndt<br />\nL E.<br />\nO'Connell<br />\nter De La Mare's third lecture, una prominent consulting sanitary<br />\nMagill<br />\nLT.<br />\nSimpson<br />\nSlowik<br />\nLG<br />\nengineer, has recently served on a<br />\nWatson<br />\nder the auspices of the Turnbull<br />\nDay<br />\nC<br />\nEgan<br />\ncommittee<br />\nnationally<br />\nof<br />\nknown<br />\nhyMilinausky<br />\nFoundation. Mr. De La Mare beRG<br />\nThaler<br />\nBiddison<br />\nRT<br />\ndraulic civil and sanitary engineers<br />\nPolowitz<br />\ngan by pointing out three common<br />\nOles<br />\nR E.<br />\nShanahan<br />\ninvited<br />\nthe<br />\nby<br />\nsanitary<br />\ndistrict<br />\nof<br />\nfallacies with which people regard<br />\nTaylor<br />\nQ B.<br />\nEnright<br />\nTurnbull .. . . L.H.B........ Schmidt<br />\nChicago to make an exhaustive surPoetry, and then showed how, when<br />\nBeckwith . . . .R.H.B.<br />\nLinn<br />\nvey and report on its sewage disthese fallacies were removed from<br />\nBlandi<br />\nF B.<br />\nByrne<br />\nposal problem. This commission,<br />\nconsideration, many of the objeccomposed<br />\nof 28 engineers, repretions to Christina Rossetti's work<br />\nHopkins and Loyola, both having<br />\nsenting eighteen states and the Diswere overcome.<br />\nfallen victims of 26 to 0 scores at<br />\ntrict of Columbia, is the biggest<br />\n-The fact of these fallacies,\"<br />\nthe hands of their opponents last<br />\nboard of engineering skill and<br />\nsaid Mr. De La Mare, \"is that poweek, will endeavor to snap out of<br />\nscientific<br />\nability ever assembled.<br />\netry is likely to be the outcome of<br />\ntheir<br />\nruts tomorrow at Homewood.<br />\nThe honorary chairman of the comemotion, and particularly of emoEach has the intention of making<br />\ntions shared by the world at large, SOPH-FROSH CLASH SET FOR missioni is E. E. Haskell, dean<br />\nemeritus<br />\nCornell<br />\nof<br />\nUniversity,<br />\nand<br />\nthe other the stepping stone.<br />\nthe crises, the calamities, and the<br />\nDECEMBER 6TH<br />\na former member of the internaAs it was Mt. St. Mary's who deobsessions of the pa %sing hour.\"<br />\nAt last the date of the Freshman- tional boundary commission. The GOOD SEASON ANTICIPATED<br />\nChristina Rossetti wrote for herfeated Loyola last Saturday, comBY SWIMMING TEAM<br />\nSophomore football game and class active chairman is George Feller,<br />\nself, not for the world. Even when<br />\nparative scores would evidently<br />\nshe did refer to matters of the rush has been decided. The Stu- consulting engineer on water sup- Many Veterans Back From Last Year<br />\ngive Hopkins a 50-point margin<br />\nply and sewage for many American<br />\nAnd Some Promising Material<br />\nworld, she did so in a purely per- dent Council at its last meeting set<br />\nFrom Local High Schools<br />\ncities.<br />\nover<br />\nthe Catholics, but football is<br />\nsonal manner. In her poem on the date for December 6. On this<br />\nAccording to Capt. -Bob\" Welsh, one of the most uncertain games<br />\nOther prominent engineers on the<br />\nFrance, the bleeding, conquered memorable day will take place, the<br />\ncommission are: C. E. Grunsky, Hopkins will have the best swim- known. This was evidenced<br />\nFrance of 1871, she expresses her traditional struggle for supremacy<br />\nlast<br />\npresident of the American Society ming team this season that has ever<br />\nPersonal sorrow and sympathy for between the two classes. The footyear when St. John's fell before<br />\nof Civil Engineers; J. Hawley, conthe stricken country, but did not<br />\nball game will be staged first. In sulting engineer on the construc- sported the Black and Blue. This Maryland and Hopkins at 26 to 0<br />\neven hint at the event which caused between<br />\nthe halves of the gridiron tion of the Panama Canal; A. feeling of satisfaction is held by the and 3 to 0 scores, respectively. Yet<br />\nher poem. She wrote thus, not as<br />\nentire team because most of the old Maryland and Hopkins fought to<br />\nbattle will be a sort of preliminary Ames, dean of Engineering at<br />\nIowa<br />\na matter of will, of volition, but as<br />\nrush. This first combat between the State College; J. Hasskarl, builder veterans will be back for better<br />\na 6 to 6 standstill.<br />\na matter of personal necessity, of<br />\nrival forces will be of short dura- of the largest breakwater in Amer- performances than ever before, and<br />\nCoach Van Orman has no intenpersonal sorrow.<br />\ntion and will probably serve as an ica; and A. Phillips, builder of the because there are many new men<br />\ntion of letting \"Doug\" Turnbull<br />\n\"Another fallacy,\" said Mr. De accurate gauge as to the outcome of<br />\nlargest pumping station ill the who have already achieved very<br />\nLa Mare, \"is the belief that the ten- the final encounter of the evening,<br />\nsettle<br />\nthe issue with his toe, but is<br />\nworld. Another member of the fine results.<br />\ndency in poetry is toward the which is to be held immediately afboard from Baltimore is Ezra B. The list of men from last year intent upon routing the Jesuits in<br />\nmournful, the tragic, the melan- ter the football game.<br />\nWhitman, chairman of the Mary- will naturally be headed by \"Bob.\" his charges' initial encounter with<br />\ncholy. Yet the finest fiction, music, This year ancient traditions are<br />\nland Public Utilities Commission. He is in good condition and looks them. He will probably send the<br />\nPainting, even architecture, are, in to be revived in the manner of stagThe official title of the committee as if he will better the time of the same team against them as faced<br />\ngeneral, grave rather than gay, ing the rush. The oldest method on is<br />\nthe \"Engineering Board of Re- records that he now holds. An<br />\nthe heavy Pitt team last week. One<br />\ntragic rather than comic, impres- record, the flag rush, is to be used.<br />\nview of the Sanitary District of Chi- otherveteran on the team will be<br />\nsive rather than amusing.\" Chris- The Student Council was unanicago on the Lake Lowering Con- Fitz Dunning, last year's captain. or two minor changes may be made<br />\ntina Rossetti, no doubt was, in her mous in deciding to revive the<br />\ntroversy and a Program of Reme- Though Fitz has strained a liga- but this is uncertain.<br />\nPoetry, grave, even melancholy, on rush. In previous years many sysOur very nearness to the Catholic<br />\ndial Measures.\" The problem be- ment in his back, he is expected to<br />\nthe surface. However, when the in- tems were • used. All the juniors<br />\nfore the committee is as follows: do better than ever in the breast- college, which will be only two<br />\nnate beauty of her words, her and seniors can recall the battle<br />\nThe city of Chicago has construct- stroke and relay in the first meet. blocks away in the near future, is<br />\nthoughts are taken into considera- over the three footballs. Some can<br />\ned a canal leading from Lake Mich- Howard, Hopkins' star plunger, bound<br />\nto breed a, strong spirit of<br />\ntion, one cannot but believe that, recollect the memorable tug of war.<br />\nigan into a tributary of the Missis- will show a great development durin spite of the sad air of her work, None of these<br />\nrivalry.<br />\ncan compare to the sippi River, and into which it dis- ing the coming season. He is being<br />\nChristina Rossetti must have taken gory battles waged around the flags<br />\nThe Loyola team made a fine<br />\ncharges its sewage. The flow primed for the Intercollegiates and<br />\ngreat pleasure in her writing. In of the old classes. The idea of the<br />\nstart<br />\nthis season against Blue Ridge,<br />\nthrough this canal is 10,000 cubic meets of like calibre. Swanson, in<br />\nher poem \"When I Am Gone, Dear- flag rush is: one class is given a<br />\ncoming<br />\nout on top of a 30 to 0 vicfeet per second. So large, indeed, the breast-stroke;' McCleary, in the<br />\nest,\" the quiet beauty of the thought flag and told to defend it to the<br />\ntory.<br />\nTheir<br />\ndefeat Saturday at Emis this draft that the level of Lake back-stroke; Baldwin and Sauerwill give pleasure, not sorrow.<br />\nmitsburg<br />\nmust not be considered as<br />\ndeath against the onslaughts of the Michigan has been lowered five wein, in the dashes and relay, and<br />\nChristina Rossetti was born in opposing class. It has not been de- inches. This<br />\nhas caused navigation Stone and Calhoun, in the dives, the Hopkins game has been Loy1830. She was only one-fourth cided whether the Freshmen or the<br />\nand power interests along the Ni- should all turn in very good per- ola's goal all season. A victory<br />\nEnglish, three-fourths of her an- Sophomores are to be the defendover the Black and Blue would be<br />\nagara and St. Lawrence Rivers to formances during the season.<br />\ncestry was of the \"warm southern ers this year, but the Student CounThe new men, however, should the crowning achievement of their<br />\ntake the matter into the courts and<br />\nblood\" of sunny Italy. She began cil will announce that shortly.<br />\nTheir<br />\nthe litigation has been in progress be of great value. This is especially maiden gridiron season.<br />\nto write \"poetry\" when she was not<br />\nOwing to vastly superior num- for a period of years. The matter true of Bailey, the 100 and relay greatest disappointment lies in the<br />\nyet in her teens.<br />\nbers the Freshmen are conceded to has now reached Congress and ac- star, who has transferred from Cor- injury of \"Polly\" Byrne in last<br />\n\"'Come, cheer up, me lads, 'tis to be slight favorites. However, ard- cordingly the report of the commit- nell. He has an enviable record week's game. Byrne, who is the<br />\nent supporters of the class of '27 tee, which will be submitted in<br />\nglory we steer,'<br />\na and should prove of great value to backbone '.o.f the Catholic eleven,<br />\nAs the soldier remarked, whose claim that quality and not quan- few weeks' time, will<br />\nbe used as a the team. Bolton, in the 100, and may be prevented from participattity will decide the issue. The bet- basis for further arguments betore Henneter, in the dives from Poly. ing in the game because of an inpost lay to the rear.\"<br />\nThis couplet is the only part of ter organization of the Sophomores the rivers and harbors committee and Oles, the City College repre- jured leg. He was rushed to a hosher work of this period now pre- may prevail over the inexperienced of<br />\nCongress in bearinis on the sentative, in the dives and 220, will pital immediately after the team arserved. However, it was not until Freshmen, but everybody agrees pending lake level bill.<br />\nstrengthen the team considerably. rived in the city last Saturday night<br />\n1862 that her first book, \"Goblin that this year's rush will probably<br />\nOnly three losses of any conse- and there will be little chance of his<br />\nThe magnitude of this problem<br />\nMarket,\" was published.<br />\nbe one of the hardest fought in can be appreciated by the fact that quence will be suffered. Bahlke, being able to play tomorrow.<br />\nHer life was tinged by disap- many days.<br />\nthe City of Chicago has already the 220-yard and relay man, has<br />\nThe Black and Blue players esP9intrnents in love, by poverty, and<br />\nLudlow Baldwin was elected sec- spent on its sewerage system the been transferred to Northwestern caped with only a few minor inthe death of her nearest relatives. retary and treasurer at last week's sum of $200.000,000,<br />\nHambleton, in the juries. Day and Milinausky inwhich is six University.<br />\nBut we cannot find or read into her meeting of the Student Council. times as much<br />\nas the United State plunge, and Lord, in the relay, have jured their hips and Beckwith his<br />\nPoems any evidence of these hard- The Council settled the question of crient on the Panama Canal.<br />\nbeen lost through graduation. shoulder.<br />\nThese men, however,<br />\nships. \"A poet's life profoundly Freshman regulations for the rest<br />\nThough these men will be missed will have recovered enough to play<br />\nNOTICES<br />\naffects his work, but we may not of this year. It was decided to revery much, it, is confidently expect- Saturday. Malonee, who showed<br />\nREGISTRAR<br />\nbe able actually to see the results quire Freshmen to wear their black<br />\ned<br />\nthat their places will be compet- his prowess against Pitt, may beThe Registrar's office anof his life in his poems,\" said Mr. ties, black socks, caps and 'pins at<br />\nnounces that a fine of five dollars<br />\nently filled.<br />\ncome a regular end, while Almy<br />\nwIll be collectd from all students<br />\nDe La Mare.<br />\nall times when they were on the<br />\nThe<br />\ndates<br />\nfor<br />\nfollowing<br />\nthe<br />\nten- may also become a first-string man.<br />\nwho did not file their schedule of<br />\nIn summing up his remarks on campus. This ruling was passed<br />\ntative<br />\nschedule have not been defihours with the Registrar before<br />\nTomorrow may bring the first of<br />\nWednesday. Oct 15.<br />\nChristina Rossetti, Mr. De La because some of the Freshmen misnitely fixed: Navy, away; Lehigh. a series of annual games that will<br />\nNEWS-LETTER<br />\nMare said, \"Her style is natural. understood the rule and attended<br />\naway; Swarthmore. at home; Rut- rival the Army and Navy conflicts<br />\nMeeting of Ed.torial and Buseasy, although occasionally touched +-he Tea dances minus their required<br />\niness Staffs of NEWS-LETTER<br />\ngers, at home; Catholic University, in spirit among the local gridiron<br />\ntoday at 12.20, in the Barn.<br />\nequipment.<br />\nContinued on page 2, col. 5<br />\nContinued on\"page 4 col. I<br />\nfans.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 24, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nPeople always seej<br />\nyour hair first<br /><br />\n•<br /><br />\nTo the NEWS-LETTER Mailbag:<br />\nJohns Hopkins undergraduates<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nhave<br />\nplenty of cause to deplore the<br />\nHopkins University.<br />\nway in which they have been treated<br />\nin regard to the lectures delivered<br />\nBusiness communications should be addressed to ,the BUSINESS MAN- in the C. E. Hall by Mr. De<br />\nLa<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nMare. It is a 'lamentable fact that<br />\nshould be sent to the MANAGING EDITOR.<br />\nIn jars and tubes, at your college<br />\nO matter how carefully you<br />\nthe Turnbull lectures, primarily indrug store. Apply a little Stacomb<br />\nare dressed—you cannot look<br />\nyour best if your hair is straggly, tomorrow morning, and look your<br />\ntended for Hopkins students, have<br />\nbest all day!<br />\nTelephone<br />\nHomewood 0100<br />\nunkempt.<br />\nnow developed into courses enjoyed<br />\nToday well-dressed men, in colmainly by female students attendlege and in business,have found just<br />\nwhat they need to keep their hair<br />\ning Goucher and other nearby colin place—Stacomb. This delicate,<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ninvisible cream will keep the most<br />\nleges. That this, a Hopkins' tradiR. CARMICHAEL TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nunruly hair in place all day long.<br />\nKEEPS THE HAIR l.N PLACE<br />\ntion, has become so thoroughly nonManaging Editor<br />\n;;I:-S,.. •<br />\n/77<br />\n\\.t\\<br />\nHopkins, is a fact which is astonALGER HISS, '26<br />\nAdvertising Manager<br />\nDept. fit-4<br />\nishing in its truth, and disgusting<br />\nInc.,<br />\nLaboratoties,<br />\n'York City<br />\nALFRED J. McKAY, '26<br />\nAssistant Managing Editor<br />\nSt.,NeW<br />\nin its conspicuousness.<br />\nStandard.<br />\na gener18th<br />\nRE<br />\nE<br />\ncharge,<br />\nWest<br />\nERNEST A. STRATHMAN, '26<br />\nof<br />\n113<br />\nfree<br />\nThe<br />\nundergraduate<br />\nstudent<br />\nbody<br />\nb.<br />\nOFFEl_k<br />\nme, of Stacom<br />\nsend tube<br />\nCirculation Manager<br />\nPleasewnple<br />\nAssociate Editors<br />\nhas lost a much-treasured possess<br />\nous<br />\n.• •••<br />\nOTHO J. KELLER, III, '26<br />\n. . ..<br />\nBENJAMIN T. ROME, '25<br />\nsion; it finds itself practically<br />\n•<br />\n.•<br />\n•<br />\n•<br />\n•<br />\nAddress<br />\nARTHUR L. NELSON, '26<br />\n........<br />\n\"booed\" from the lectures which<br />\nAssistant Business Managers<br />\nJunior Editors<br />\nwere founded for its benefit. Lack<br />\nG. DONALD GIESKE, '25<br />\nEDWARD 0. MICHEL, '26<br />\nof<br />\nsufficient space, no doubt, can<br />\nJAMES YOUNG, '25<br />\nJ. JACKSON KIDD, '26<br />\nbe<br />\nattributed<br />\nto the congested audi- GRADUATE STUDENTS HAIL<br />\nHENRY R. TURNBULL, '26<br />\nT. STRAN SUMMERS, '25<br />\nFROM 33 STATES<br />\nA. RISLEY ENSOR, '26<br />\nences. The writer is not condemnHEYWARD E. BOYCE, JR., '27<br />\nJ. HENRY JARRETT, '27<br />\nThere<br />\nare two hundred and<br />\ning the size of the audiences, but<br />\nROBERT T. SAUERWEIN, '26<br />\nCHARLES F. REESE, '27<br />\nARTHUR SWANSON, '27<br />\nW. BARNES HALL, '27<br />\nhe is bewailing the fact that Gouch- ninety-one graduate students ater College students and others in no tending the University this year.<br />\nway connected with the university, The school is more cosmopolitan<br />\nMember Southern Intercollegiate Newspaper Association<br />\nare occupying the seats which rightthan ever before, for included in it<br />\nfully belong to Hopkins' De La<br />\nare representatives of thirty-three<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. Mare admirers.<br />\nFrankly, the issue is: \"Are we to states, two Canadian provinces, and<br />\nsurrender our seats to members of four other foreign nations. MaryHOMEWOOD, BALTIMORE, MD., OCTOBER 24, 1924<br />\nSanford's<br />\nthe opposite sex and thus obey a land, of course, has the largest repPEN MI<br />\nfOlINTAIN<br />\nEASY-FLOWING<br />\nprerogative of etiquette, or are we resentation, having 163 students,<br />\n5<br />\nto demand our rights? Which is<br />\n1 ANFORCI mro.co.<br />\nHOSPITALITY<br />\n\"The<br />\nwhile Virginia, Pennsylvania and<br />\nthe<br />\nstronger,<br />\netiquette<br />\nor<br />\njustice?\"<br />\nAlthough Johns Hopkins is the most northern Southern college<br />\nINK<br />\nIt is the duty of the registrar to the District of Columbia follow in<br />\n1<br />\nI<br />\nand the most southern Northern college, in the matter of hospitality<br />\norder.<br />\nOnly<br />\nten<br />\nforeign<br />\nstudents<br />\nremedy<br />\nthe<br />\npresent<br />\nevil.<br />\nThat<br />\ncan<br />\nPOSSIBLE\"<br />\nFountain<br />\nPen<br />\nMade<br />\nthe<br />\nThat<br />\nit is desirous of making its Southern affiliations unmistakable. Sigma<br />\nChi Beta in the past has always greeted and entertained visiting be done by reserving a section of are found on the register this year,<br />\nteams. This year the extending of hospitality has been the para- seats for Hopkins men. It is only of whom exactly half are Chinese.<br />\nmount purpose of the fraternity. Teams from Randolph-Macon, Mt. fair that a Hopkins lecture, pri- Two hail from Canada, and one<br />\nSt. Mary's and Pittsburgh have been escorted to the tea dances fol- marily established for Hopkins, de- each from England, Ecuador and<br />\nlowing the football games. Arrangements have been made to meet livered in a Hopkins building, Palestine.<br />\nIt is interesting to note the varied<br />\nall teafns at the railroad station and to entertain the visitors during should be enjoyed to a considerable<br />\nextent by Hopkins undergrdauates. number of \"majors\" pursued by the<br />\ntheir stay at Hopkins.<br />\n•D. BELL. graduates. Twenty-eight subjects,<br />\nSigma Chi Beta, however, not satisfied with a single line of acincluding every conceivable intertivity, is beginning tomorrow to put into execution its plans for the<br />\ncoming year and to demonstrate its worth as an organization. The FIFTY PRACTICE LACROSSE est, are to be found on the schedLacrosse is off to a good start ule. Chemistry is the most popular,<br />\nsociety has volunteered to take complete charge of ushering at the<br />\nin<br />\nthe 1924-25 campaign. Prac- while education and English are<br />\ngames. In this way, it is believed, supporters of Hopkins will come<br />\nSHERWOOD BROTHERS, INC.<br />\ntices<br />\neven at this early date do next on the list. Sanscrit has one<br />\ninto contact with men representative of the University.<br />\nq4 kileetee<br />\nnot lack variety. The team already adherent, Germanic philology,<br />\nii I4I4<br />\ntwo;<br />\nSemetic<br />\nlanguages,<br />\nthree,<br />\nwell supplied with 25 men from<br />\nCHEERING<br />\nlast<br />\nyear's squad will be strength- and plant physiology, four.<br />\nIn an attempt to awaken the students of our friendly rival,- the<br />\nTO HAVE CRITICS IN<br />\nComparatively few are majoring JAY<br />\nUniversity of Maryland, to the fact that cheering at games has a ened with approximately the same<br />\nNEXT ISSUE<br />\nin Romance languages, a subject<br />\ndirect bearing on the success of a team, the Editor of the Diamondback. number of recruits who have. good<br />\nwhich usually has a rather large<br />\nremarked that Navy's cheering is without equal because everyone stickwork, to say nothing of the<br />\nThe next issue of the Black and<br />\nfollowing.<br />\nri ifteen study French,<br />\nnovices<br />\nwho<br />\nshow<br />\na<br />\nmarked imcheers. This is undoubtedly a true deduction.<br />\nBlue Jay, which will appear on<br />\nCheering at Hopkins might be improved by everyone cheering provement in their handling of while but three are taking Spanish November 10, will have several<br />\nand similarly the body of rooters might be enlarged by every Student the stick.<br />\nstartling innovations: Present<br />\nCoach Schmeisser has left the CLASS OFFICERS ELECTED plans call for a page devoted to<br />\nsitting in the rooting section. Game after game it has been noticed<br />\nAT FRESHMAN MEETING<br />\nthat the rooting section has been depleted because a number of actual working out of the squad<br />\nthe reviewing of current books<br />\nto•the older, men. In the absence<br />\nToni Biddison was the unani- and another page is to be given<br />\nstudents insist upon leaning on the fence by the side lines.<br />\nSigma Chi Beta has been given authority by the Student Council of Captain Turnbull the oldest mous choice of the freshman class over to dramatic criticism. The<br />\nand the Athletic Association to assemble all students in the rooting player on the field directs pro- for vice-president at a meeting men in charge of these departsection. This fraternity is attempting to fulfill this aim by appealing ceedings. To do away with mo- held Tuesday at 12.30 in the C. E. ments have not been announced<br />\nto the loyalty of the \"fence-leaners\". This action has been heartily notony the squad is run through Hall. After the ballots had been as yet.<br />\napproved by the Student Council and it behooves all to lend support various fundamentals in stick- officially counted by representaThis vill be the first time that.<br />\nto Sigma Chi Beta.<br />\nwork. Stress is laid on passing, tives of the Student Council it the Jay has attempted to mix the<br />\nshooting goals, and picking up the was found that Mallonee was sec- sublime with the ridiculous, alball. The last 15 or 20 minutes retary, Bolton treasurer and Igle- though other humorous magaESPRIT DE CORPS<br />\nof<br />\npractice are devoted to a game hart sergeant-at-arms. The latter zines have been following the<br />\n()allege spirit was sadly lacking in those Freshmen and upper<br />\nof<br />\ntag in which the 'entire squad was also elected manager of the practice for some time. The nevv<br />\nclassmen who left the field at the Pittsburgh game before the final<br />\ntakes<br />\npart.<br />\n'28 football team.<br />\nwhistle. The eleven men out on the gridiron were fighting a valiant<br />\ndepartments are expected to be<br />\nPractices are held every TuesA pep committee was chosen, permanent.<br />\nif losing battle. It did not help those men to fight harder when they<br />\nsaw nearly a hundred Hopkins men leave the stands just at the mo- day, Wednesday and Friday. composed of the following men:<br />\nment when the team, was most pressed. No one thought of leaving Right now is the time for *new White, Scherr, Lawrence, Wood<br />\nDE LA MARE LECTURE<br />\nat the Mt. St. Mary's game when Hopkins was on the long end of men to come out and get stick- and Thomson. The purpose ot<br />\nContinued from page 1<br />\na twenty-one to nothing score. It certainly seems as if the fighting work. The coach desires especial- this committee, as announced, is with the ceremonious. It is at time5<br />\nstreak were left out of the make-up of some of our students. The ly men who have been unsuccess- to generally look after the a little stilled, even frigid, arid<br />\nteam can not put forth its best efforts until it knows that every stu- ful in track. It often happens that \"Frosh\" and instill pep into them sometimes almost demure. Here<br />\ndent is out rooting hard for victory.—G. W. H.<br />\nmen who have been unable to run for all activities.<br />\nand again we find her quiet humor<br />\na straight course on a track deThe football team was discussed and buoyancy of spirit, but cries<br />\nThe NEWS-LETTER regrets to announce the resignation of velop into the best of lacrosse but action was postponed await- from the heart are as rare as gynv<br />\nplayers.<br />\ning the appointment of a coach. nastics of the intellect.\"<br />\nJohn W. Parsons, '25, from the position of Associate Editor.<br /><br />\nDon't let unkempt hair<br />\nspoil your whole appearance!<br /><br />\nN<br /><br />\n4,1<br /><br />\nRef 1 With<br />\nORD'S<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 24, 1924<br /><br />\nNMI<br /><br />\nORGANIZATION MEETING<br />\nOF A. S. C. E. HELD<br />\nPlans for the coming year were<br />\noutlined by President William<br />\nKaufholz at the organization meeting of the Hopkins student chapter of the American Society of<br />\nCivil Engineers, held last Friday,<br />\nOctober 18. It was announced that<br />\nthe speaker for the regular meeting<br />\nFriday, October 24, will be Mr.<br />\nEarl Stimson, chief engineer, maintenance of way, of the Baltimore<br />\nand Ohio Railroad. Mr. Stimson,<br />\nwho is one of the most prominent<br />\nengineers in the city, delivered last<br />\nyear one of the \"Engineering Practice\" lectures, given annually by<br />\nthe School of Engineering.<br />\nToday's meeting will be followed<br />\nby a smoker, as is customary. The<br />\nschedule of monthly meetings to be<br />\ngiven this year was not announced<br />\nat this meeting but negotiations are<br />\nbeing made with several important<br />\ncivil engineers to address the future meetings.<br />\nOfficers of the society expect that<br />\nthe membership will be practically<br />\ndoubled this year, as the enrollment in the civil engineering department has increased in a similar ratio. Although freshmen are not<br />\neligible, the enrollment of upperclassmen has reached almost one<br />\nPUBLICITY BOARD TO MOVE hundred per cent in the last two<br />\nyears.<br />\nINTO NEW OFFICE<br />\nThe Publicity Board has been<br />\nPromised a room as an office in the GRASS CUT FOR LAST TIME<br />\nbasement of the new Chemical LabThe Dormitory lawn has received<br />\noratory, according to the Board's .ts last \"hair cut\" of the season.<br />\nsecretary. The publicity agents will fuesday afternoon an employee of<br />\ninove into their new quarters early he University \"just knocked off<br />\nnext week. The exact room has he rough,\" as he said. This was<br />\nnot been<br />\nannounced by Dean Ames. he last time that a lawn mower will<br />\nA meeting will be held next Mon- -lick across the court until Spring<br />\n(1aY, notice of which will be posted. ')ursts forth on the campus.<br />\nDEBATING COUNCIL PLANS<br />\nIMPORTANT CONTESTS<br />\nDebating will regain some of its<br />\nformer prestige at Hopkins if the<br />\nPlans for the present season are<br />\ncarried out. The first step was<br />\ntaken a week ago, when candidates<br />\nWere called for the freshman and<br />\nsophomore debating teams. The<br />\nzmnual debate between the two lower classes will be held at an Assembly on either December 11 or<br />\n12. In January the juniors and<br />\nseniors will clash.<br />\nProspects for the varsity debating team are bright; although Gross<br />\nis the only regular back from last<br />\nyear, a successful team should be<br />\nbuilt up from members of last<br />\nyear's class teams and from freshmen who have had experience in<br />\ndebating.<br />\nA very attractive schedule is in<br />\nthe making. The team will go to<br />\nLexington, Va., to hold a triangular<br />\ndebate with Washington and Lee<br />\nand the University of North Carolina. A trip to the University of<br />\nRichmond to hold a _return debate<br />\nIS Practically<br />\nassured. _In the contest held at Hopkins last year, Rich ni°nd was the victor. Debates with<br />\nother college teams are -pending, including- one with the University<br />\nof Virginia.<br /><br />\nRIFLE TEAM BEGINS RANGE<br />\nPRACTICE<br />\nBang! Zip! Bull's-eye!<br />\nWith this brief introduction the<br />\nRifle Club began range practice<br />\nMonday, up in the North attic of<br />\nGilman Hall. According to Lieutenant Sherwood, who is coaching<br />\nthe club, a great many students<br />\nhave become interested in sharpshooting this year, and from 9:30<br />\nA. M. to 4:00 P. M. every day,<br />\nlife on the range is just one sharp<br />\nreport after another. Due to large<br />\nmembership a schedule ,has been<br />\nposted with the names of men assigned to certain periods of practice<br />\nduring the week.<br />\nTo add a pinch of ginger to the<br />\ndaily practicing, contests will be<br />\nstaged among the club members<br />\nthemselves in a few weeks. Details<br />\nwill be announced later.<br />\nExact dates of shooting matches<br />\nwith other colleges have not yet<br />\nbeen decided upon, but it is said<br />\nthey will be held some time in December. At that time, the 15 men<br />\nmaking the highest scores the week<br />\nbefore each match will compete<br />\nwith the opposing team. One hundred is the standard of perfect<br />\nmarksmanship, each man getting<br />\nten shots at his target and each<br />\nbull's-eye counting ten points.<br />\nCommenting upon results so far,<br />\nLieutenant Sherwood said: \"It is<br />\ntoo early to form any definite idea<br />\nas to how many real sharpshooters<br />\nare in the making or already made,<br />\nbut rivalry is very keen and no one<br />\nwastes his ammunition. I feel sure<br />\nthat with its large enrollment and,<br />\nincidentally, with its eight brandnew rifles, the club will produce this<br />\nyear an unusual team.\"<br /><br />\n3<br /><br />\nErnest G. Leimbach<br /><br />\nSENIORS<br /><br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br /><br />\nJUNIORS<br /><br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nSOPHOMORES<br />\nFRESHMEN<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nOPEN EVENINGS<br /><br />\nSt. Regis<br /><br />\nWARNER &amp; CO.<br /><br />\nRESTAURANT<br />\n1817 N. Charles St.<br /><br />\nHatters<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br /><br />\nOpen All Hours<br /><br />\nNear Your Campus<br />\n222 &amp; 224 W. Baltimore St.<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nDOUG TURNBULL<br />\nRepresentatives<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nTOM MAGILL,<br />\nManager<br /><br />\nSHIRTS<br /><br />\nLeFranc &amp; Ault<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER<br /><br />\nPRINTER<br /><br />\n.11<br /><br />\n421 N. HOWARD ST.<br /><br />\nSTATIONER<br /><br />\n229 N. CHARLES ST.<br /><br />\nNECKWEAR<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nBaltimore's Best Store<br /><br />\nHOCHSCHILD,KOHN 8cCo.<br />\nHoward and Lexington<br /><br />\nFRESHIE<br /><br />\nAt theekick-off<br /><br />\n(Many pardons, Mr. Kipling)<br />\nThe new man conies to college fresh, unknowing of its ways,<br />\nIt doesn't take him long to learn—provided that he stays!<br />\nFor there are always Sophomores on the job, all willing Tutors<br /><br />\nWho make, enforce and set the rules until the Freshman cries:<br />\n\"0 it's Freshie this and Freshie that and Freshie 'Off the grass,'<br />\nOr Freshie 'kindly step aside to let your elders pass;<br />\nTo let your elders pass, my Frosh, to let your elders pass,'<br />\nAnd it's Freshie, 'kindly step aside to let your elders pass'!\"<br /><br />\nDa<br />\nIN<br /><br />\nlIld<br />\nOhl<br /><br />\nral<br />\nznt<br />\nto<br />\n)ks<br />\nren<br />\n'he<br />\n,rt-<br /><br />\niat<br />\nthe<br />\nal;a-<br /><br />\neW<br />\nbe<br /><br />\nind<br /><br />\nere<br />\nclot'<br /><br />\nYour Sheaffer pen<br />\nwill prove to be your<br />\nmost valuable assistant in the game of<br />\nschool or business.<br /><br />\nwise,<br /><br />\n,The Sophomores keep a watchful eye and use a heavy hand,<br />\nrheY brand the Freshman black and blue—true to colors understand,<br />\nBut when the football game comes 'round it's Freshmen,<br />\n\"out to cheer<br />\nIle team is fightin' on the field, they need your fightin' here!\"<br />\nIt's Freshie this and Freshie that and Freshie \"out to yell,<br />\nThe \"even on the field can't win unless you cheer them well ;<br /><br />\nGive your pen<br />\na drink of<br /><br />\nMakes the<br />\nbest pen write<br />\nbetter.<br /><br />\nUnless you cheer them well, you Frosh, unless you cheer them<br />\nwell,<br />\nThe leven on the field can't will unless you cheer them well.\"<br />\nThe Freshman enters Gilman Hall by tunnel at the rear,<br />\nlie wears his cap day in, day out and walks sometimes with fear,<br />\nFor behind<br />\nhim lurks a critic Soph a-watchin' every step—<br />\nBut it's<br />\n\"come on join activities, it's that we want—your pep !,,<br />\n0 it's Freshie this and Freshie that, it's Freshie \"join the band;<br />\nThe Barnstormers have vacancies, the papers want your hand!<br />\nThe papers want your hand, good Frosh, the papers want your<br />\nhand,<br />\nNews-Letter or the Blue Jay, for the papers want your hand<br />\nOr it's \"come out for the football team, they need a sturdy crew;<br />\nScholastic duties first, perhaps, but still, the sports need you,<br />\n,<br />\nAnd you need sports and exercise to grow up like a Soph—<br />\nith too much grinding, too much work you'll be a puny prof!\"<br />\nIt's Freshie this and Freshie that, but all they want's your pep,<br />\nYOU may not make a team at first or even place, and yet,<br />\n\"Try and try again, my Frosh, try and try again,<br />\nIf at first you don't succeed—just try and try again!\"<br /><br />\nTIV<br /><br />\n—By Louis P. Hamburger, Jr.<br /><br />\nCHEAFFER'S Lifetime<br />\nPen is the master of all<br />\nwriting instruments.<br />\nThe 46 Special is made with<br />\nthe same care and precision<br />\nas all Sheaffer pens and<br />\npencils.<br />\nThe Student's Special is designed for students and is<br />\nthe ideal pen at the price<br />\nfor classroom or study.<br /><br />\nNew Yor;<br />\n370 7th Avenue<br /><br />\nChicago<br />\n506 Republic Bldg.<br /><br />\nLifetime<br />\n$8.75<br /><br />\nStudent's<br />\nSpecial<br />\n$3.75<br /><br />\nSold By The Better<br />\nDealers Everywhere<br /><br />\nHEAFFE<br />\nPENS \"LIFETIME\" PENCILS<br />\nW. A. SHEAFFER PEN CO., Fort Madison, Iowa<br /><br />\nDenver<br />\nSO2 Jacobsen 1114.<br /><br />\nSan Francisco<br />\n681 Market Street<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 24, 1924<br /><br />\nJUNIORS DEFEAT FRESHMEN \"BLUE JAY SIX\" EXPANDS<br />\nIN CLOSE BASEBALL<br />\nTO INCLUDE TWELVE<br />\nCONTEST<br />\nFive-Inning Game Furnishes Thrills<br />\nA Plenty As Second Inter-Class<br />\nMatch Is Staged<br /><br />\nJ. J. Scherr Is Leader of Recently<br />\nOrganized Hopkins Orchestra<br /><br />\nThat the Johns Hopkins University is to have an orchestra comparable with any other similar college<br />\norganization in the country, has<br />\nbeen virtually assured, according to<br />\nWe;hl Pen and Eversharp are<br />\nobtainable in matched<br />\nMr. J. J. Scherr, who has been<br />\nsets<br />\ninstrumental in organizing the<br />\n\"Blue Jay Twelve.\" This group of<br />\nmusicians, which consists of men<br />\nof ability and experience, is an outgrowth of the well-known \"Blue<br />\nJay Six,\" idolized by the patrons of<br />\nthe various university dances.<br />\nAn unqualified guaranteestands<br />\nAlthough the newly formed orback of every Wahl<br />\nproduct<br />\nchestra is to be primarily a Hopkins organization, it hopes to establish its reputation throughout the<br />\nEast. This talented group is contemplating an engagement at the<br />\nMaryland or Rivoli. That comparatively recent musical innovation,<br />\nJuniors Tie Score<br />\nclassical jazz, will be produced by<br />\nThe freshmen started out well.<br />\nDowning, the first man up, walked, Mr. Scherr's jazz exponents, who,<br />\nstole second, and scored on Shul- in all probability will furnish the<br />\nties' hit. The juniors, however, music for the university's formal<br />\ncould not put a run across until the dances of the season.<br />\nSide by side in your pocket, Eversharp and Wahl<br />\nThe personnel of the \"Blue Jay<br />\nPen are ever ready to serve your thoughts.<br />\nthird stanza, when Goodwin tied<br />\nDurability and dependability are common qualities<br />\nthe score with a single, two stolen Twelve\" is one which seems to asof these economical, practical writing companions.<br />\nbases, and a passed ball by Proc- sure success for the Hopkins orThe non-clogging rifled tip, quick reloading, and<br />\ntor. The winning run was scored chestra. J. J. Scherr, the leader,<br />\nwho<br />\nplays<br />\nthe<br />\nsaxaphone,<br />\nplayed<br />\nhas<br />\ninterchangeability of parts are among the<br />\ncomplete<br />\nin the following frame, on hits by<br />\nwith<br />\nGarber<br />\nDavis<br />\nof<br />\nCornell<br />\nfeatures<br />\nwhich make the perfected Eversharp.<br />\nsix<br />\nnew<br />\nHomer and Graser.<br />\nother<br />\nfame.<br />\nThe<br />\nare<br />\nsaxaphonists<br />\nAnd the Wahl all-metal Pen is at par with EverIn the last inning, the freshmen<br />\nMr.<br />\nBetz,<br />\nformerly<br />\nwho<br />\nwas<br />\nwith<br />\nsharp in giving thorough satisfaction. Light in<br />\nmade a valiant effort to win. With<br />\nweight, perfect in balance, resistant to wear, and<br />\none down, Shultack doubled, but \"Bob\" Iula, and Mr. Sater, of<br />\nbeautiful in design—it is the ideal pen.<br />\nwas out trying to stretch the hit. \"Fred\" Robbin's Century Roof Orchestra.<br />\nMessrs.<br />\nUrner<br />\nand<br />\nPenWahl Pen, $5 to $55.<br />\nEversharp,<br />\n$1 to $45.<br />\nShulties then followed with a long<br />\nrose,<br />\nboth<br />\nmusicians<br />\nof<br />\nlocal<br />\nfame,<br />\nhit that was good for three bases.<br />\n{Made in the U.S.A. by THE WAHL COMPANY,Chicago<br />\nArmor, clean-up man, emulated are the club's banjoists. Other memCanadian Factory,THE WAHL COMPANY,Ltd.,Toronto<br />\nManufaCturers ofthe Wahl Eversharp and the Wahl All-MetalFountain Pen<br />\nCasey, however, and dashed all bers of the orchestra, all of which<br />\nhave had experience in their rehopes for victory.<br />\nspective<br />\nlines, are: Messrs. Light,<br />\nGoodwin and Homer were the<br />\nviolinist;<br />\nChamberlain, trombonist;<br />\nstars of the winners, while CalaConant<br />\nand<br />\nMcElfresh, cornetists ;<br />\nbrisi, who pitched the first two inheNew PERFECTED<br />\nVanneman,<br />\ndrummer;<br />\nTovell, Wnings, played best for the losers.<br />\nhist ; Steinwald, pianist.<br />\nThe Line-Ups:<br />\nThe lineup for the freshmen was<br />\nas follows: Downing, 3b; Shultack, R. 0. T. C. UNIT LARGEST<br />\nss ; Shulties, lf ; Armor, cf ; Wyatt,<br />\nSINCE ORGANIZATION<br />\nrf ; McElfrish, lb; Fenimore, 2b;<br />\nGreenfield, C; Proctor, c; Calabrise, Every Availabk Minute Being Devoted<br />\nTo Instruction On Drill Field<br />\nILMEMAIIIMIN=IMENIMM\\<br />\np ; Carrico, p.<br />\nLatest<br />\nreports<br />\nfrom<br />\nthe<br />\nMilitary<br />\nThe junior lineup was: Wasserman, ss ; Lane, 3b; Thompson, lb : office indicate that the R. 0. T. C.<br />\nHomer, c; Fonda, 2b; Baldwin, cf ; unit this year will surpass in numORDERS RECEIVED FOR<br />\nGroser, rf ; Ziv, if; Goodwin, p. ber and quality any that has been<br />\nMANUFACTURING JEWELERS<br />\nSCORE BY INNINGS:<br />\nturned out since the introduction<br />\nFreshmen<br />\n1 0 0 0 0-1<br />\nLancaster, Pa.<br />\nof this organization at Hopkins.<br />\nJuniors .<br />\nTransfer &amp; Baggage Express<br />\n.0 0 1 1 x-2<br />\nClass Rings, Pins, Fraternity Pins<br />\nEveryone in the department is<br />\nCups, Medals, Etc.<br />\nAUTOMOBILE SERVICE<br />\nSTUDENT ACTIVITIES CARDS working to advance Hopkins' name<br />\nStationery, Invitations, Programmes<br />\nPHONE, HOMEWOOD 6886<br />\nSecretary Campbell, of the Stu- on the honor list. The University<br />\n\"Makers of the Varsity Seals\"<br />\ndent Activities Council, announces has been represented on this list<br />\nthat it is necessary for every<br />\nfor the last two years, in spite of<br />\nfreshman to get himself a Student<br />\nthe fact that it has bad to compete<br />\nActivities<br />\ncard<br />\nimmediately.<br />\nThese cards entitle the holder to with military colleges, which devote<br />\nBIRDERS<br />\nPRIRTERS<br />\nsubscriptions to the Blue Jay and a great deal of time to practical in- ERGRADERS<br />\nNews-Letter, a copy of the Hulla- struction.<br />\nBecause of a lack of time for<br />\nbaloo, Barnstormers and Musical<br />\nClub tickets, and several other drilling, last year's unit did not<br />\n.TWCornerciyelie and Cutaw Sis.<br />\nthings of interest to Hopkins men. reach the hight standard that would<br />\nhave<br />\nbeen<br />\npossible<br />\notherwise.<br />\nEvery<br />\nUnless you have one of these<br />\n-Where Wholesale and Retail Districts Meet'.<br />\ncards in your possession, the ben- available moment will be devoted<br />\nefits to be derived from them will this year to this branch of the work<br />\nin an effort to compete with the<br />\ncease.<br />\nStudent Activities cards are military colleges. Drilling has been<br />\ngiven at the Barn daily from 12.30 going on for only three weeks, but<br />\nto 1 P. M. Bring your treasurer's the new men have been rounded<br />\ninto form, and on the whole prereceipt with you.<br />\nsent a very military appearance.<br />\nand individuality is offered here at prices that are not<br />\nThe contest for an emblem to be<br />\nGOOD SEASON ANTICIPATED BY<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nSWIMMING TEAM<br />\nplaced on the caps worn by the<br />\nCBesides the reputation of an old-established firm<br />\nContinued from page<br />\nPrinters of<br />\nmen, will be open until November<br />\nis back of each sale with a guarantee.<br />\naway; Boston Tech, away; Brown. 15, after which no designs will be<br />\ncThe Johns Hopkins<br />\nat home. So, with most of the vet- accepted. They must be in black<br />\nNE1DS,LETTER<br />\nerans back from last year, new men and white, actual size, and are to be<br />\nwith experience, and a hard sched- turned in at the Military office in<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nule, Hopkins will have a swimming a sealed envelope bearing the con343 NORTH CHARLES STREET<br />\nteam of which it may well be proud. testant's name.<br />\nLOM BARD and SOUTH STREETS<br />\nIn one of the best exhibitions of<br />\ninter-class baseball ever seen at<br />\nHopkins, the juniors vanquished<br />\nthe freshmen by the score of two<br />\nto one. The game which was replete with thrills from the first inning until the fifth, was not decided<br />\nuntil the final out. The remarkabL<br />\npart of the game was the extremely low number of errors committed by the two teams. But three<br />\nmiscues were made by the losers<br />\nwhereas the winners were credited<br />\nwith five, a truly small total for an<br />\ninter-class game. Even one or two<br />\nof these might have been averted<br />\nhad it not been for the autumn chill.<br />\nGoodwin, of the juniors, pitched<br />\nexcellent ball, striking out eleven<br />\nmen, and holding the opposition to<br />\nsix hits. Shulties was the batting<br />\nstar, getting a triple and a single in<br />\nthree times up.<br /><br />\nComplete Writing Equipment<br /><br />\nT<br /><br />\nFM511APP<br /><br />\n691VAIII \"JV<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\nJ. F. APPLE CO.<br /><br />\nCOGGIN'S<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP 8z SONS<br /><br />"}], "field_media_file": [{"target_id": 37897, "display": null, "description": null, "target_type": "file", "target_uuid": "85f49780-3c66-47ff-9124-35d3fcb19493", "url": "http://digital.library.jhu.edu/system/files/2022-03/13137-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13137, "target_type": "node", "target_uuid": "d0ffb3be-63df-49b7-b519-ab64bcfc7729", "url": "/node/13137"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "5f8db572-3d6f-4026-a754-287c3d4ae098"}]}