{"mid": [{"value": 37181}], "uuid": [{"value": "3aacde95-7ac5-4833-8a26-6439b75b646b"}], "vid": [{"value": 37181}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:01:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13225-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:01:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:01:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXI. No. 2<br />\nBARNSTORMERS CLUB TO<br />\nHOLD FIRST MEETING<br />\nTHURSDAY<br />\nTWO One-act Plays Are Planned for<br />\nProspective Frosh<br />\nCandidates<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 5, 1926<br />\n<br />\nTHIRTY-FIVE ROOTERS<br />\nACCOMPANY TEAM<br />\nTO PENN<br />\nAbout thirty-five rooters followed the football team to<br />\nPenn last Saturday. The majority journeyed to Philadelphia late Friday and stayed<br />\nat fraternity houses over<br />\nnight. The team did not go<br />\nup until Saturday morning.<br />\nUnfortunately, however, the<br />\nlocal contingent was unorganized and spread over a<br />\nlarge section of the stands assigned to Hopkins, making efficient cheering almost impossible. A few scattered yells<br />\nissued forth sporadically, but<br />\nit is doubtful if any were loud<br />\nenough to be heard on the<br />\nfield.<br />\n<br />\nPRICE,5 CENTS<br />\n<br />\nDR. GOODNOW ADDRESSES<br />\nSTUDENTS AT WEEKLY<br />\nASSEMBLY<br />\n<br />\nBIDDISON SCORES FIRST<br />\nHOPKINS TOUCHDOWN AS<br />\nHead of University Explains New Plan;<br />\nPENN DEFEATS JAYS 40-7<br />\nJarrett and Farinholt Welcome<br />\nFreshmen<br />\n<br />\nCAPTAIN MALLONEE<br />\n<br />\nMallonee, Lawrence, and Pindell<br />\nStar for the Black<br />\nand Blue<br />\n<br />\nThis is the first authoritative<br />\nThe Barnstormers Club will hold<br />\nstatement<br />\nthat has been made to<br />\nits first meeting this year on Thursthe undergraduates concerning<br />\nday at the studio in the Barn, imPENN TEAM IS POWERFUL<br />\nthe \"New Plan.\" \"As yet the<br />\nmediately after the. weekly assemForward Passes, \"Hidden Ball\",<br />\n'new plan' is only a goal to be<br />\nbly. At this meeting all new canand Rogers Too Much for<br />\nworked for and that the date of<br />\ndidates as well as both the members<br />\nJ. H. U.<br />\nits establishment is now a matter<br />\nof the club and last year's cast are<br />\nAbility to take ladvantage of<br />\nof conjecture. New students will<br />\nexpected to be present.<br />\nevery break that presented itself<br />\ncontinue to be accepted under the<br />\nI. Evans Rodgers, star actor of<br />\nwas responsible for Johns Hopold plan and anyone who is admitthe Barnstormers - for the last two<br />\nkins' averting a shut-out in the<br />\nted as a candidate for the degree<br />\nYears, is president of the club, and<br />\nfirst football game of the season<br />\nof Bachelor of Arts will be given<br />\nalso will act in the capacity of aslast Saturday. Tom Biddison's<br />\nfull opportunity of completing his<br />\nsistant coach, which position he<br />\nalertness in the third period acstudies. Under no consideration<br />\nheld last year.<br />\ncounted<br />\nfor the Jays' lone touchwill the establishment of the new<br />\nRodgers announced that two onedown<br />\nin<br />\na rather one-sided strugact plays, Silken Purses by \"Dinty\"<br />\nplan affect any student then in<br />\n_<br />\ngle against Penn which the latter<br />\nthe university,\" said Dr. Frank J.<br />\nMoore, president of the Barnstorm- Nearly 100 Turn Out<br />\ners four years ago, and Another<br />\nFor Musical Club Goodnow at the first weekly. As- Captain Gardner Mallonee, who led won, 40 to 7. Thirty-five thouthe Black and Blue eleven against U. sand persons witnessed the<br />\nstrugWay Out by Lawrence Langner, If the number of candidates sembly last Thursday.<br />\nof Penn Saturday.<br />\ngle at Franklin Field.<br />\nturn<br />\nwho<br />\nout<br />\nfor<br />\norganization<br />\nan<br />\nwhich was produced last year by the<br />\nPresident Goodnow said Oat<br />\nPennsylvania, represented by<br />\nfreshmen, have been selected for is a promising sign for future suc- Johns Hopkins will continue to TWO NEW APPOINTMENTS<br />\ncess<br />\ncoming<br />\nthe<br />\nseason of the Muwhat is probably the best team in<br />\nthe annual tryout plays for freshMADE IN PHYSICS<br />\ngivegreater<br />\nreater freedom to its stusical Club ought to be a good one,<br />\nthe<br />\nhistory of the university,<br />\nDEPARTMENT<br />\nmen.<br />\naccording to Edward M. Passano, dents, and he likened the univercrossed the Hopkins goal line six<br />\nAccording to Rodgers, Another president.<br />\nsity to a republic of letters in Drs. Herzfeld and Pfund Have Accepted<br />\ntimes,<br />\ntwice each in the first, secWay Out proved to be such an ideal At the organization meeting last which the great part of the rePermanent Places at<br />\nand,<br />\nand<br />\nfourth quarters. Penn's<br />\nUniversity<br />\nplay for discovering ability in new Thursday, over 50 candidates sponsibility of sucecss is laid on<br />\noffensive power lay in their aeriel<br />\nmen,. that it was decided to have turned up for the Glee Club, 25 the student body. Since laws<br />\nTwo new appointments to the<br />\nattack<br />\nand their now famous \"hidfor the Banjo Club, and 20 for'che which<br />\nit produced again this fall.<br />\nhave not the approval of the rank of full professor in the deden ball' play. The latter is so<br />\nOrchestra. There was a good<br />\nWill Give \"Silken Purses\"<br />\ngoverned cannot be easily enforced. partment of physics, were formalnamed , because each backfield<br />\nSilken Purses by \"Dinty\" Moore showing of freshmen at the try- a large measure<br />\nof self government ly announced today by Dr. Frank<br />\nman's sleeve is covered with<br />\nis his first attempt at playwriting outs.<br />\nis given to students. This method J. Goodnow, president of the<br />\nleather sheeting, which the oppoand it is expected that much interMr. Edgar T. Paul, who suc- of putting<br />\nthe law-making, to a Johns Hopkins University. He<br />\nsition often mistakes for the ball.<br />\nest will be taken in this skit by stu- ceeds the late Mr. Hobart Smock<br />\nlarge degree, into the hands of the said that Dr. Karl F. Herzfeld,<br />\nThe result is that before the opdents on the campus due to the fact as leader of the Glee Club, was students,<br />\nDr. Goodnow explained, who came here last year from<br />\nthat Moore was at one time a well- well satisfied with the men whose<br />\nGermany as the \"James Speyer posing line is able to discover who<br />\nanswers a more lively spirit of<br />\nVisiting Professor,\" had accepted is carrying the ball, a substantial<br />\nvoices he tested. Osmer Steinknown student at Hopkins.<br />\nresponsibility and a keener in- a<br />\npermanent appointment with the gain is made.<br />\nRehearsals for these plays will wald and Mr. Conrad Gebelein, terest in<br />\nthe welfare of the Uni- university. Dr. Herzfeld will also<br />\nRogers Is Great Back<br />\nbegin the first of next week and as leaders of the Orchestra and Banversity.<br />\nbe Professor of Theoretical MeThree<br />\nof Penn's touchdowns<br />\nusual three rehearsals each—week jo Club, respectively, were also<br />\nAfter Dr. Goodnow had fin- chanics. The other appointment were the direct result of forward<br />\nwill be held, the days and time of pleased with the showing.<br />\nished speaking, Brinton Stone, to the full professorship was that passes. The others were attributhem, however, still being uncertain.<br />\nof Dr. A. Herman Pfund, formerly<br />\npresident of the Student Council,<br />\ntable to the marvelous broken<br />\nassociate professor of physics.<br />\nThese plays will be produced at Hullabaloo Holds<br />\noutlined for the benefit of the new<br />\nthe Playshop Theatre on Saturday,<br />\nDr. Herzfeld was professor of field running of Rogers, and the<br />\nInitial Meeting<br />\nstudents, the workings and re- theoretical physics and chemistry line plunging of Wascolonis, a<br />\nNovember the twentieth.<br />\nWork on the 1927 Hullabaloo got<br />\nquirements of the honor system. at the University gof Munich. He two-hundred pounder from the<br />\nAll members of the business, art under way yesterday at a meeting<br />\nFollowing him, Henry Jarrett, was the ifirst appointee to the vis- Pennsylvania coal mines.<br />\nand production staffs and all candi- of the staffs and candidates in the<br />\neditor-in-chief in NzwS-LETTER and iting professorship established by<br />\nThe game itself was marked by<br />\ndates for these staffs are expected Barn.<br />\nJames Speyer of New York for<br />\npresident<br />\nof<br />\nOmicron<br />\nDelta<br />\nKapto present themselves at the meetCharles T. Reese, editor, and<br />\nthe purpose of bringing to the the excellent condition and clean<br />\ning on Thursday as it will be neces- Eugene O'Dunne, business mana- pa, gave a short talk on the tra- Johns Hopkins each year a lead- playing of the Hopkins team.<br />\nsary to begin work almost imme- ger, outlined the work to be done ditions of Johns Hopkins. Larkin ing scientist from one of the uni- Whereas Penn was penalized for<br />\ndiately under the direction of Don- by the various staffs. As usual it Farinholt, president of the Stu- versities in Central Europe. Dr. a total of fifty yards, the Jays reold Bolton and Maxwell Bertuch, is planned to make the book a big- dent Activities Council, then told Herzfeld received his Ph. D. deceived no penalties at all. In adtemporary managers of the Busi- ger and better annual than those of the various activities which gree from the University of Viendition, while Penn was using nearness and Production staffs.<br />\nof previous classes.<br />\nmay be taken up. Following a na in 1914 and returned to that ly three complete teams during<br />\ninstitution after the war. He went<br />\nfew announcements cheer practice<br />\nto the University of Munich in the course of the game, Coach<br />\nHABERDASHERY SHOP IN BARN AT ONE<br />\nwas held which consummated the 1920 and was promoted to a pro- Van Orman made but three subTIME A THRIVING TONSORIAL PARLOR assembly.<br />\nfessorship there in 1923.<br />\nstitutions<br />\ne-up. in the Black and Blue<br />\nMuch of Dr. Herzfeld's work, it !in<br />\nSeveral 'years ago a tonsorial store with Gard Mallonee as his<br />\nwas said, has dealt with researches<br />\nparlor was located on the north assistant. This year Mallonee and<br />\nBiddison Scores<br />\nHopkins Again On<br />\nconcerning the Zeeman effect, a<br />\nThe Jay tally came in about the<br />\nSide of the Barn and did a rush- Liebensbereger are at the head of<br />\nDistinguished List phenomena occurring when light<br />\nmiddle of the third quarter as the<br />\ning business in haircuts and the establishment.<br />\nThe Johns Hopkins R. 0. T: C. is broken up to form the colors<br />\nresult of a Penn fumble. With the<br />\nshaves. For a while the shop<br />\nAlthough most colleges give<br />\nis once more on the distinguished of the spectrum. Studies of this<br />\nProspered and then suddenly went special scholarships to athletes,<br />\nball<br />\non Penn's forty-yard line,<br />\nphenomena are said to have<br />\nout of business—the barber died. the Hopkins authorities have service list issued by the Governproved of great benefit in difficult Murphy, the Quaker quarterback<br />\nAfter the barber's demise, Andy never adopted this means of se- ment, as was announced by Major chemical analyses by giving a clue called the signal for the \"hidden<br />\nKnecht, former Hopkins baseball curing prominent high school Hoisington.<br />\nas to how the atoms are arranged ball\" play. The ball was snapped<br />\nPlayer, and Tom Landy of foot- players. The store is the only<br />\nSeven colleges were assigned to form the molecules of compli- back, but a hitch in the smoothball fame, in 1921, became the first concession allowed to men of a:11- this position<br />\nof honor from the cated substances.<br />\nness of the backfield caused the<br />\nproprietors of the present haber- letic ability. Preference is usually<br />\nThird Corps Area.<br />\nDr. Pfund received his. A. B. de- ball to lie on the ground unprodashery establishment.<br />\nAfter given to the captain of the footThere are 82 advanced students gree from the University of Wis- tected. Biddison sensed his opKnecht and Landy had graduated ball team.<br />\nconsin in 1901 and his Ph. D. de- portunity, kicked up the pigskin,<br />\nfrom the university, the store was<br />\nThe store always has in stock a to 272 basic students in the unit gree from Johns Hopkins in 1906, and ran the forty yards to carry<br />\nmanaged by Bonner, Magill and large •assortment of tailor made at present, about half of the Freshr.nrnbull. Last year Frank Mere- suits, shoes, socks, neckties and man class signing up for the after . which he was appointed to the ball across the Red and Blue<br />\nthe faculty in the department of line. Bobby' Lyons kicked goal<br />\n(11th, track star, had charge of the pennants.<br />\nwork, as usual.<br />\n(Continued on Page 3 Column 2)<br />\n(Continued on Page 3 Column 2)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 5, 1926<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nSPEAKING<br />\nOF<br />\n<br />\nSPORTS<br />\n<br />\nThe unexpected return of \"Red'<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Dugan, All-Maryland back last seaBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nson, to St. John's will make Coach<br />\nMcKee's job of producing a good<br />\nPublished semi-weekly from October to June by the students of Johns eleven considerably easier, and acHopkins University.<br />\ncording to reports there is a scarcity of good material at the Annapolis institution.<br />\ncommunications should be addressed to the BUSINESS MANA-<br />\n<br />\nTHE EMANUEL PRESS<br />\nINCORPORATED<br />\n<br />\nPRINTING<br />\n<br />\nENGRAVING<br />\n<br />\nEMBOSSING<br />\n<br />\n203 WEST FRANKLIN STREET, BALTIMORE<br />\nTELEPHONE VERNON 4519<br />\n<br />\nPresenting The NEW IN<br />\n<br />\nNeckwear for Men<br />\n<br />\nColor--and plenty of it, is the keynote in the Ties for Fall.<br />\nStripes predominate, and are shown in all widths, in harmonizIt will be rem.embered that this<br />\ning two-tone effects or vivid color contrasts. Some of the new allsame Dugan saved the Jo/tunics over effects are particularly pleasing.<br />\nfront a defeat at the hands of HopHomewood 0100 kins last year. In the attempt for<br />\nthe extra point after touchdown, a<br />\npoor pass from the center made it<br />\nBusiness Manager<br />\nimpossible to try for a placement<br />\nEUGENE O'DUNNE, JR., '27<br />\nkick and Dugan using excellent<br />\nheadwork picked up the ball and ran<br />\nAdvertising Manager<br />\naround end for the score, causing<br />\nthe game to end in a deadlock at<br />\nTHOMAS F. MCNEAL,'27<br />\n7 to 7.<br />\n<br />\nBusiness<br />\nGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\n$1.00 $1.50 $2.00<br />\nSTEWART& CI:<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\n<br />\nJ. HENRY JARRETT, '27<br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br />\n<br />\n, Columnist<br />\nFRANCIS M. HASBROUCK, '27<br />\n<br />\nCirculation Manager<br />\n<br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br />\n<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nJunior Editors<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '27<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nJOHN G. TURNBULL, '29<br />\nA. BERNARD CHANCELLOR, '28<br />\nDONALD HISS, '29<br />\nPHILIP NESS, '29<br />\n<br />\nLAWRENCE 0. MCCORMICK, '28<br />\n<br />\nAssistant Business Managers<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28<br />\nSAMUEL M. HECHT, '29<br />\nLours M. RAWLINS, '28<br />\nH. ADDISON CAMPBELL, '29<br />\nZANVYL E. KRIEGER, '28<br />\n<br />\nMember Southern- Intercollegiate Newspaper Association<br />\n<br />\nPrinted by Read-Taylor Press, South and Lombard Streets<br />\n<br />\nLUCK<br />\n<br />\nConsiderable comment has been occasioned by the early dates set<br />\nthis year for class elections. No doubt some of this unfavorable criticism has been just. With little or no advance notice, members of the<br />\nSenior and Junior classes, in the midst of the turmoil brought about by<br />\nthe selecting of courses, the extra effort required to once more set the<br />\n, wheels of activities in motion, and the absorbing spectacle of the first<br />\nfreshman-sophomore run-ins, were called upon to make nominations<br />\nfor class officers or student councilmen. On the next day they were<br />\nfollowed by the sophomores.<br />\n<br />\nEvidently, Dartmouth, last year<br />\nconsidered by many leading authorities as the best team in the<br />\ncountry, will have another excellent<br />\nteam this season despite the loss of<br />\nthat great forward passing combination of Oberlander to Tully.<br />\nIn the opening game Norwich<br />\nwas smothered 59-0 and according<br />\nto reports another forward passing<br />\nteam consisting of Dooley and Lane<br />\nwas discovered.<br />\nAlthough Oberlander, last year's<br />\nAll-American back is not at Dartmouth this year, the backfield is expected to be equally as strong as<br />\nlast year's quartet.<br />\nCaptain Horton, Lane and McPhail, who with Oberlander were<br />\nthe regular ball carriers last season,<br />\nhave returned to college and Dooley.<br />\na star two years ago, but ineligible<br />\nlast year because of studies, has<br />\nmade up his deficient work, and is<br />\nnow the fourth member of the backfield.<br />\n<br />\nAPenYou Can Lend<br />\nwithouta Tremor<br />\nFor its point yields to any hand<br />\nyet resumes its original shape<br />\nIts \"Permanite\" barrel and cap will not break<br />\nHE Parker Duofold point<br />\ncombines what you get in<br />\nno other point—durability and<br />\nflexibility.<br />\nThis point yields to any style<br />\nof writing yet retains its original shape. It is guaranteed for<br />\n25 years not only for mechanical perfection but for wear.<br />\nAnd Parker Duofold's barrel<br />\nand cap will not break, though<br />\nyou drop it a hundred times.<br />\nFor they are now made of Permanite—Parker's non-breakable materialthat has withstood<br />\nsuch gruelling tests as a 3,000<br />\nfoot drop from an aeroplane.<br />\nThis combination—the Parker Duofold Point and the<br />\nParker \"Permanite\" Barrel and<br />\nCap—makes the world's greatest writing instrument.<br />\nYou cannot get such value in<br />\nany other pen, at any price.<br />\nStop at the nearest pen counter<br />\ntoday and try your size and<br />\npoint in a Parker Duofold.<br />\n<br />\nT<br />\n<br />\nC. C. Pyle, the professional<br />\nfootball and tennis magnate, made<br />\na great move towards strengthening professional tennis when he<br />\nsigned Vincent Richards last week.<br />\nRichards during the past season<br />\nhad a better record than Tilden and<br />\nhas ranked either second or third<br />\namong the first ten for the last several years.<br />\nHarvey Snodgrass, who comes<br />\nfrom the Pacific Coast, also turned<br />\nprofessional last week and \"Cold<br />\nCash\" Pyle, as he is sometimes<br />\ncalled, will probably arrange a tour<br />\nwith Snodgrass and Richards playing in the larger cities of the country, along with Mlle. Lenglen and<br />\nMiss Browne.<br />\n<br />\nAside from the possible thwarting of any of the enterprising young<br />\ncampus politicians, whose existence is as a matter of fact large by mythical, this decidedly precipitate gathering of the clans was unfortunate.<br />\nClass office and Student Council membership, although not matters of<br />\nlife and death importance, nevertheless ought to be considered in a<br />\nfairly serious frame of mind, both for the honor involved and their<br />\nopportunity for service to class and university. Those that know anything whatever about class elections know that nominations are fully<br />\nDORM<br />\nas important as the election itself, and also that in making intelligent<br />\nDOINGS<br />\nnominations, a little time and thought are necessary, at least to the average run of mortals.<br />\nThose fraternities not repreThe blame, if there is any blame, it might be more correct to say sented on the inter-fraternity<br />\nadvice, should not be given to class officials for calling the meetings board have already 'had a big<br />\nearly this year; but rather for not holding the Student Council elections rushing season at the. dormitory.<br />\nlast year; for that is where the trouble lies. Because these elections Freshmen have been pledged durwere not held in the spring, and because the hectic battles of the first ing meals, while taking 'showers.<br />\nand in the midst of other activimonth make the existence of the Council even more than ordinarily imties. Practically every man eligiperative, the elections have to be held as soon as possible; there is no<br />\nble at the dormitory has been<br />\nother course to be taken.<br />\ngiven a choice of lapel pins.<br />\nDuring the next few weeks while the issue is still fresh, before it<br />\nThe proportion of graduate and<br />\nsinks to a relatively remote position in the undergraduate mind, steps undergraduate residents remained<br />\nshould be taken to insure the election of Student Council delegates in the about the same. The undergraduspring. Provisions to this effect should be written into the, class con- ates have a slight majority possistitutions, or, if they already exist, should be made clearer. This year bly. As in previous years the<br />\nmanagement has experienced no<br />\nthe class nominations stem to have been as satisfactory, as usual, despite<br />\ndifficulty in disposing of the<br />\nthe hurry. But it was through good luck. No one can predict what ,rooms and many applications were<br />\nsimilar conditions may bring forth in the future.<br />\nof necessity not accepted.<br />\n<br />\n`Tennanite\"—the new<br />\nNon-Breakable Material of<br />\nwhich all Parker Pens and<br />\nPencils are now made—is<br />\nlustrous, light-weight, and<br />\ndoes not break,fade or shrink.<br />\nParker Duofold Pencils to match the Pens:<br />\nLady Duofold. $3; Over-size Jr., $3.50<br />\n\"Big Brother\" Over-size. $4<br />\nTHE PARKER PEN COMPANY, JANESVILLE, Wis.<br />\nOFFICES AND SUBSIDIARIES: NEW YORK'CHICAGO<br />\nATLANTA • DALLAS • SAN FRANCISCO<br />\n• LONDON, ENGLAND<br />\nTORONTO, CANADA<br />\n<br />\nParker<br />\nDuofold<br />\nJunior<br />\n$5<br />\nParker<br />\nOver-size<br />\nDuofold<br />\n$7<br />\nLuchy Curve Feed 1and 25-YearPoint<br />\nLady Duofold 05<br />\nDuofold Jr. $5<br />\nRed and Black Color Combination—Reg. Trade Mark C. S. Pat. Office<br />\n<br />\n\fTH E JOHNS HOPKINS NEWS-LE FTER, OCTOBER 5, 1926<br />\n<br />\nMAILBAG<br />\nTHE NEWS-LETTER<br />\n<br />\nTWO NEW APPOINTMENTS<br />\nMADE IN PHYSICS<br />\nDEPARTMENT<br />\n<br />\nBARN CAFETERIA<br />\nI.<br />\n<br />\n(Continuedfrom Page I, Column 4)<br />\n<br />\nphysics. In his researches at<br />\nJohns Hopkins he has devoted<br />\nhimself to investigations concerned with the problems of light<br />\nand in this connection designed a<br />\nnumber of new instruments for<br />\nwhich he was awarded the medal<br />\nof the Franklin Institute.<br />\nDr. Pfund's instruments for<br />\nmeasuring minute differentiations<br />\nin color have been used extensiv.?.ly for improving methods in the<br />\npaint and dye industries. He also<br />\nAN APPRECIATION<br />\nTo the Editor of the NEWS-LETTER. discovered that the dangerotts<br />\nDear Sir: For two and a half infra-red rays, which often cause<br />\nYears a son of the University has serious eye trouble among men<br />\nlabored •unceasingly for the ad- who work near blast furnaces,<br />\nvancement of his Alma Mater. Now could be shut off by goggles on<br />\nthe day draws near when, sensing which a thin transparent film of<br />\na call to greater endeavor, he is to gold had been deposited. The<br />\nsever his connection with us for a vacuum therinophile, a mechaaconsiderable period of time, • if not ism used in measuring the heat of<br />\nthe stars, is another of the instruPermanently.<br />\nThe Board of Trustees has ex- ments devised by Dr. Pfund.<br />\nFollowing the resignation of<br />\npressed its infinite regret at his-decision; its President has publicly Dr. Joseph S. Ames as professor<br />\nsignified the debt of gratitude the of physics and director of the<br />\nUniversity owes him for his un- physics laboratory, so that he<br />\nfailing efforts. Day after day, might accept appointment as Prowhen we have passed the office in vost of the university, it was anthe Chemical Laboratory, we have nounced that the direction of the<br />\nseen the light burning after all oth- laboratory would be assumed by a<br />\ner than the hall lights had been ex- committee composed of the facultinguished. He •vet labored on ty of the physics department.<br />\nThis committee has organized itWhen all others had gone home.<br />\nUndoubtedly a number of this self and has appointed Robert W.<br />\ntoiler's 'policies have not been un- Wood, professor of experimental<br />\nderstood. His plans are too 'prac- physics, director for this year. Dr.<br />\ntical, too far-sighted for us to Bliss will be secretary. Dr. Hetzgrasp their full import. No other felcl will take over Dr. Ames's<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br />\n<br />\nindividual in the University has classes.<br />\nworked so hard in the interest of a<br />\nStudent Activities Building, or so<br />\nSCORES THE FIRST<br />\nnnselfishly. We have all been so BIDDISON<br />\nHOPKINS TOUCHDOWN AS<br />\nWrapped up in our own narrow dePENN DEFEATS JAYS 40-7<br />\nsires that we could not unde-pstand<br />\n(Continued from Page 1 Column 5)<br />\na plan which provided for the com- immediately afterwards by a place<br />\npletion of the building even if kick.<br />\nfunds ran short.<br />\nCaptain Gardner Mallonee and<br />\nWe ourselves have done nothing<br />\nJack Lawrence were the stellar<br />\nfor the building: we have not<br />\nperformers for Hopkins. With<br />\nraised a single cent, or even offered<br />\nthe exception of the first play of<br />\nsuggestions as to the interior arthe game, when Rogers tore<br />\nrangements. There was nothing to<br />\naround his flank, \"Mal's\" end was<br />\ntell the originator of the plans what<br />\npractically impregnable. In addiWe wanted; yet we loudly protested<br />\ntion, he blocked the dropkick after<br />\nWhen the plans did not conform to<br />\nPenn's first touchdown in the last<br />\nOur ideas. Because we were afraid<br />\nquarter. Lawrence was here,<br />\nthat we would not have a place in<br />\nthere, and everywhere on the dethe building, we wanted immediate<br />\nfense, and was the best ground<br />\nguarantees of a definite room. The<br />\ntoiler has labored against our oppo- gainer and forward pass receiver<br />\nsition, always unselfish, never ex- on the offense. Watson Pindell<br />\nPeeling anything for himself. The played a steady, if not brilliant<br />\nAdministration wished not only to defensive game, making difficult<br />\ngive the Activities rooms of their tackles in rapid succession.<br />\nOW, and us a cafeteria and lounging rooms, but also to have us keep<br />\nthe Barn as an additional student<br />\nbuilding. We have garbled every- LARGE CROWD ATTENDS<br />\n.ANNUAL RECEPTION<br />\nthing.<br />\n(Continued from Page 4 Column 2)<br />\nAnything we can say in appreowner. However, at the end<br />\nthe<br />\nof<br />\nciation of the toiler's services is not<br />\nhalf enough. He has given of the of the trick, to the amazement of<br />\nbest years of his life and of the the audience, the hat was found to<br />\nbest of his ability for the Univer- be entirely unharmed. The magicsity. The efficient Alumni organi- ians also showed great proficiency<br />\nza.tion and the splendid Fiftieth Anin making cards and eggs disappear<br />\nniversary Celebration soon to be<br />\nheld are the work of his hands. into the air and then reappear.<br />\nFollowing the magic act, the rePoi- he has fought the good fight.<br />\nception was concluded with the<br />\nRespectfully,<br />\nG. B. N. serving of ice cream and cakes.<br />\n<br />\nSWARTHMORE<br />\n<br />\n41<br />\n<br />\nBRUYERE PIPES<br />\n<br />\nI.<br />\n<br />\nRegular Price, $2.00<br />\nWhile They Last, $1.25<br />\n41<br />\n<br />\ni+<br />\n<br />\n1<br />\n<br />\nThe college man who<br />\ninvests in Katz clothes<br />\nfor the first time has<br />\nonly one regret—that<br />\nhe didn't buy them<br />\nsooner<br />\n<br />\n211-213<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\nO<br />\n<br />\nN campus or off campus, rain<br />\nor shine, night or day, a Stetson is<br />\nthe smartest hat and the longest lived.<br />\n<br />\nE. Baltimore St.<br />\n<br />\nSTETSON HATS<br />\n<br />\n$30 up<br />\n<br />\nStyled for young men<br />\n<br />\n_Alva<br />\n<br />\nrtaltoot<br />\n<br />\nCamels add the charm of living<br />\nWHETHER through the tasks of<br />\n<br />\nevery day, or in life's moments of<br />\ncrisis and great reward, the comfort and understanding of Camel<br />\ncheers us on our way. For no other<br />\ncigarette was ever so friendly, so<br />\nloyal as Camel. The unfathomed<br />\ngoodness, the deep underlying<br />\nquality of Camel tobacco, is<br />\never-dependable.<br />\nThe world's largest tobacco organization buys the best of everything for Camels. The choicest<br />\nTurkish and Domestic tobaccos<br />\n<br />\ngrown. The kind of blending that<br />\nonly such a group of experts could<br />\ngive. Regardless of what you are<br />\nwilling to pay, there is no other<br />\ncigarette like Camel; there can be<br />\nno better cigarette made than<br />\nCamels. Camels never tire the<br />\ntaste, no matter how indefatigably<br />\nyou smoke them, never leave a<br />\ncigaretty after-taste.<br />\nIf you don't yet know Camel<br />\nenjoyment, just sample the most<br />\nexquisite fragrance that ever came<br />\nfrom a cigarette. Have a Camel!<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br />\n<br />\n192f4<br />\n<br />\n•11<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 5, 1926<br />\n<br />\n4<br />\nLARGE CROWD ATTENDS<br />\nANNUAL FRESHMAN<br />\nRECEPTION<br />\nDr. C.<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nLINEUP OF HOPKINS-PENN GAME<br />\nPENN (40)<br />\nJ. H. U. (7)<br />\nMallonee . ..L.E...... Thayer<br />\nSmith<br />\nLeibensp'r<br />\nL T<br />\nDuncan<br />\nL G<br />\nKaufman<br />\nButler<br />\nC<br />\nClayton<br />\nParke<br />\nDill<br />\nR G<br />\nHatre<br />\nBiddison ....R. T<br />\nF. Scull<br />\nKaufholtz<br />\nR E<br />\nMurphy<br />\nLyons<br />\nQ B<br />\nRogers<br />\nLawrence<br />\nR H<br />\nP Scull<br />\nL H<br />\nPindell<br />\nF. B.. Wascolonis<br />\nBoynton . ...F<br />\nScore by Periods<br />\nJ. H. U.... . 0 0 7 0— 7<br />\n14 13 0 13-40<br />\nPenn<br />\nSubstitutions: Hopkins, Caplan<br />\nLyons; Dotterweich for<br />\nfor<br />\nBoynton; Strader for Clayton.<br />\nPenn, Fields for Murphy, Pine for<br />\nWascolonis, Freeman for Rogers,<br />\nOdione for F. Scull, Thompson<br />\nfor Fields, Downey for Hatre,<br />\nMiller for Smith, Singer for F.<br />\n<br />\nV. B. Wight Addresses Meeting;<br />\nRodgers and Magicians<br />\nEntertain Audience<br />\n<br />\nAbout two hundred freshmen<br />\nand upper classmen attended the<br />\nannual reception given Friday night<br />\nby the Hopkins Y. M. C. A. in honor of the first year men. Lowell S.<br />\nEnsor, vice-president of the \"Y\"<br />\nwas in charge of the entertainment.<br />\nFraternity rushing parties were<br />\nmuch in evidence.<br />\n<br />\nScull, Rogers for Freeman, Westgate for Butler, Hayes for Thayer, Monte for Parke, McGinnis for<br />\nDuncan, P. Scull for Odione,<br />\nWascolonis for Pine, Schaff for<br />\nSinger, Hatre for Downey, Smith<br />\nfor Miller, F. Scull for Schaff,<br />\nButler for Westgate, Thayer for<br />\nHayes, Hatre for Monk, Duncan<br />\nfor McGinnis, Fields for Murphy, Douglas for Rogers, Odione for P. Scull, Mulligan for<br />\nWascolonis, Sullivan for Thayer,<br />\nLenzner for F. Scull, Kishner for<br />\nButler, Walker for Hatre, Fonde<br />\nfor Smith, Poole for Duncan, Sanford for Parke, Thompson for<br />\nFields, Freeman for Douglas.<br />\nScoring: Touchdowns, Biddison, Wascolonis (2), F. Scull,<br />\nRogers, Murphy, P. Scull. Try<br />\nfor point—Lyons (place kick),<br />\nWascolonis, 3 (place kicks), P.<br />\nScull (dropkick).<br />\n<br />\nSpeeches of welcome were made<br />\nby Robert L. Bull, president of the<br />\n\"The Curse of Drink,\" which told<br />\ncghe largest selling<br />\nY. M. C. A., and Dr. Carol V. B.<br />\nof the debauchee of a drug-store<br />\npencil<br />\n44.4449ua1ity441.<br />\nWight, professor of Greek at the<br />\nworld<br />\nthe<br />\n4641,,_ in<br />\nsoda fountain. Responding to the<br />\nuniversity. Dr. Wight told the<br />\n-water<br />\ndemands of his audience, \"Bill.'<br />\nfreshmen of the advantages to be<br />\nnext recited the well-known \"Shootgained from college study and par17<br />\ning of Dan McGrew\" in his usual<br />\nticipation in student activities. Ex- entertaining style.<br />\nblack<br />\nperience gained from work in the Two youthful magicians next en- degrees Superlative in quality,<br />\nthe world-famous<br />\nvarious clubs and organizations of tertained with a variety of tricks.<br />\nthe university will prove to be of One trick that was especially good copying<br />\ngreat value in later years when the involved the manufacture of yards<br />\nof silk from a slice of bread and two<br />\ncollege man enters the world of busgive best service and<br />\neggs. During the cooking process a<br />\nlongest wear.<br />\niness. Dr. Wight also emphasized<br />\nfire was started in the hat of one of<br />\n$1.00<br />\nends, per doz.<br />\nBuy Plain<br />\n1.20<br />\nthe social advantages to be derived the members of the audience in<br />\nRubber ends, per doz.<br />\nwft all dealers<br />\na<br />\nfrom fraternity life and member- spite of the vociferous objections<br />\nAmerican Lead Pencil Co.<br />\ndozen<br />\n220 Fifth Ave., N.Y. .1<br />\nship in honor societies such as Phi<br />\n(Continued on Page 3 Column 2)<br />\nBeta Kappa and 0. D. K.<br />\nYOUR MONEY GETS INTO THE BANK WHETHER<br />\n\"Bill\" Rodgers, president of the<br />\nYOU PUT IT THERE OR NOT. IF YOU SPEND ALL, THE<br />\nBarnstormers Club and versatile<br />\nOTHER FELLOW BANKS YOUR MONEY.<br />\ncampus entertainer, next took the<br />\nMAKE YOUR MONEY WORK FOR YOU AT 4% INstage. His first number was an elabTEREST BY OPENING A SAVINGS ACCOUNT WITH<br />\norate tale of June Week, which he<br />\ninterspersed with popular songs.<br />\nHe next rendered a poem entitled<br />\nCharles and Fayette Streets<br />\nBaltimore, Maryland<br />\n<br />\nVENUS<br />\nV PENCILS<br />\n<br />\nUNION TRUST COMPANY<br />\n<br />\nPrinters of<br />\n<br />\nThe Flag, Banner and<br />\nPennant Shop<br />\n<br />\nV(i<br />\n<br />\nSuccessor to Sisco Brothers<br />\n<br />\nPHILOLOGICAL & SCIENTIFIC<br />\n<br />\nFLAGS, BANNERS, PENNANTS,<br />\nSOCIETIES and FRATERNITIES<br />\n<br />\nPUBLICATIONS<br />\n<br />\nR. H. TAYLOR<br />\n<br />\n23 S. Hanover St., Baltimore<br />\n<br />\n302 Park Ave.<br />\n<br />\nBaltimore,<br />\n<br />\nSC<br />\n<br />\nMd.<br />\n<br />\nVernon 2355<br />\n<br />\nFift<br />\n<br />\nMake the Grade with a,<br />\n<br />\nKemington Portable<br />\nT U DEN TS<br />\neverywhere<br />\nhave found the<br />\nRemington Portable Typewriter<br />\nindispensable in<br />\ntheir college work.<br />\nYou can't get<br />\naway from the fact<br />\nthat neatly typewritten reports and theses get<br />\nbetter attention from the profs,<br />\nand very often mean bettermarks.<br />\nThe Remington Portable<br />\nweighs only 8% pounds, net.<br />\n<br />\nIt is the smallest,<br />\nlightest, and most<br />\ncompact portable<br />\nwith standard keyboard. The machinecan betucked<br />\naway in a drawer<br />\n7,w,„„4<br />\nwhen not in use,<br />\nfor the case is only<br />\nfour inches high.<br />\nThis handy helper, which<br />\ntakes all the drudgery out of<br />\ncollege work,can be bought for<br />\nas little as $10 down and $5<br />\nmonthly.<br />\n<br />\nfic<br />\n<br />\nscl-<br />\n<br />\n,JA,Of<br />\n<br />\n1<br />\n<br />\nThe Recognized Leader iii Sacs and Popularity<br />\n<br />\n71.4:9?)<br />\netibigz..,a:44<br />\nlb-,<br />\ntel<br />\nir<br />\ntt t<br />\nJaat<br />\n.<br />\n4144-4b<br />\nw4114*Ste<br />\n1<br />\n•15,011<br />\n<br />\nCLOTHES -<br />\n<br />\nsok<br />\n<br />\nReady-made<br />\nAnd Cut to Order<br />\n<br />\n41<br />\n1# Ase<br />\n<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\n<br />\nitirrpf<br />\nmod<br />\n<br />\n1<br />\nshi<br />\ntioi<br />\nha]<br />\ndei<br />\n<br />\n\"112<br />\n<br />\na<br />\n<br />\n9.<br />\n%110,<br />\n<br />\n(queer lif!owe<br />\n<br />\n45%<br />\n<br />\n4<br />\n0)<br />\n4<br />\n<br />\nSuits and Overcoats<br />\n<br />\n$40,$45,$50<br />\n<br />\na<br />\nw.-Awl<br />\n4Pootw 4,;ow**<br />\n110.11<br />\n9<br />\n<br />\n•'<br />\n4,<br />\n<br />\nswiesmez<br />\n<br />\nIdentify the aristocrat<br />\nof pens by this<br />\nwhite dot<br />\n<br />\nDad, too, buys this pen<br />\nfor economy's sake<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\n07,1tArter 1J ousel<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nThe cheap and uncertain pen costs much more in<br />\nthe long,run. The Lifetime* is the pen of no repair costs. So accurately is it built, and so unfailingly does it perform, that we unhesitatingly<br />\nguarantee it without reservations whatsoever.<br />\nAnd because it is also a beautiful pen, built of<br />\nenduring green Radite, it is a pride of studentdom — and a coveted possession always. Spot<br />\nit by the dot—at better dealers everywhere.<br />\nPrice,in green or black, $8.75.<br />\n<br />\n41.1<br />\n<br />\nStudent's special,$7.50. Pencil,$4.25<br />\nBlue Label Leads—fifteen cents<br />\nSkrip is the best ink for all fountain pens<br />\n<br />\na<br />\n<br />\nHub<br />\n<br />\n.!<br />\n<br />\nSHEAFFEKS<br />\n<br />\nfor<br />\nsin<br />\nthi<br />\n<br />\ntvv,<br />\n<br />\ntha<br />\n<br />\nCh<br />\nAl(<br />\n<br />\nsti]<br />\n<br />\nPENS -PENCILS- SKRIP<br />\nSHEAFFER PEN COMPANY<br />\n<br />\nha,<br />\n<br />\nFORT MADISON.IOWA<br />\n<br />\nCharles and Fayette Sts.<br />\n<br />\n*Reg. U.S. Pat. Off.<br />\n<br />\nsin<br />\n<br />\n.MMNI<br />\n<br />\nfea<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXI. No. 2<br />\nBARNSTORMERS CLUB TO<br />\nHOLD FIRST MEETING<br />\nTHURSDAY<br />\nTWO One-act Plays Are Planned for<br />\nProspective Frosh<br />\nCandidates<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 5, 1926<br /><br />\nTHIRTY-FIVE ROOTERS<br />\nACCOMPANY TEAM<br />\nTO PENN<br />\nAbout thirty-five rooters followed the football team to<br />\nPenn last Saturday. The majority journeyed to Philadelphia late Friday and stayed<br />\nat fraternity houses over<br />\nnight. The team did not go<br />\nup until Saturday morning.<br />\nUnfortunately, however, the<br />\nlocal contingent was unorganized and spread over a<br />\nlarge section of the stands assigned to Hopkins, making efficient cheering almost impossible. A few scattered yells<br />\nissued forth sporadically, but<br />\nit is doubtful if any were loud<br />\nenough to be heard on the<br />\nfield.<br /><br />\nPRICE,5 CENTS<br /><br />\nDR. GOODNOW ADDRESSES<br />\nSTUDENTS AT WEEKLY<br />\nASSEMBLY<br /><br />\nBIDDISON SCORES FIRST<br />\nHOPKINS TOUCHDOWN AS<br />\nHead of University Explains New Plan;<br />\nPENN DEFEATS JAYS 40-7<br />\nJarrett and Farinholt Welcome<br />\nFreshmen<br /><br />\nCAPTAIN MALLONEE<br /><br />\nMallonee, Lawrence, and Pindell<br />\nStar for the Black<br />\nand Blue<br /><br />\nThis is the first authoritative<br />\nThe Barnstormers Club will hold<br />\nstatement<br />\nthat has been made to<br />\nits first meeting this year on Thursthe undergraduates concerning<br />\nday at the studio in the Barn, imPENN TEAM IS POWERFUL<br />\nthe \"New Plan.\" \"As yet the<br />\nmediately after the. weekly assemForward Passes, \"Hidden Ball\",<br />\n'new plan' is only a goal to be<br />\nbly. At this meeting all new canand Rogers Too Much for<br />\nworked for and that the date of<br />\ndidates as well as both the members<br />\nJ. H. U.<br />\nits establishment is now a matter<br />\nof the club and last year's cast are<br />\nAbility to take ladvantage of<br />\nof conjecture. New students will<br />\nexpected to be present.<br />\nevery break that presented itself<br />\ncontinue to be accepted under the<br />\nI. Evans Rodgers, star actor of<br />\nwas responsible for Johns Hopold plan and anyone who is admitthe Barnstormers - for the last two<br />\nkins' averting a shut-out in the<br />\nted as a candidate for the degree<br />\nYears, is president of the club, and<br />\nfirst football game of the season<br />\nof Bachelor of Arts will be given<br />\nalso will act in the capacity of aslast Saturday. Tom Biddison's<br />\nfull opportunity of completing his<br />\nsistant coach, which position he<br />\nalertness in the third period acstudies. Under no consideration<br />\nheld last year.<br />\ncounted<br />\nfor the Jays' lone touchwill the establishment of the new<br />\nRodgers announced that two onedown<br />\nin<br />\na rather one-sided strugact plays, Silken Purses by \"Dinty\"<br />\nplan affect any student then in<br />\n_<br />\ngle against Penn which the latter<br />\nthe university,\" said Dr. Frank J.<br />\nMoore, president of the Barnstorm- Nearly 100 Turn Out<br />\ners four years ago, and Another<br />\nFor Musical Club Goodnow at the first weekly. As- Captain Gardner Mallonee, who led won, 40 to 7. Thirty-five thouthe Black and Blue eleven against U. sand persons witnessed the<br />\nstrugWay Out by Lawrence Langner, If the number of candidates sembly last Thursday.<br />\nof Penn Saturday.<br />\ngle at Franklin Field.<br />\nturn<br />\nwho<br />\nout<br />\nfor<br />\norganization<br />\nan<br />\nwhich was produced last year by the<br />\nPresident Goodnow said Oat<br />\nPennsylvania, represented by<br />\nfreshmen, have been selected for is a promising sign for future suc- Johns Hopkins will continue to TWO NEW APPOINTMENTS<br />\ncess<br />\ncoming<br />\nthe<br />\nseason of the Muwhat is probably the best team in<br />\nthe annual tryout plays for freshMADE IN PHYSICS<br />\ngivegreater<br />\nreater freedom to its stusical Club ought to be a good one,<br />\nthe<br />\nhistory of the university,<br />\nDEPARTMENT<br />\nmen.<br />\naccording to Edward M. Passano, dents, and he likened the univercrossed the Hopkins goal line six<br />\nAccording to Rodgers, Another president.<br />\nsity to a republic of letters in Drs. Herzfeld and Pfund Have Accepted<br />\ntimes,<br />\ntwice each in the first, secWay Out proved to be such an ideal At the organization meeting last which the great part of the rePermanent Places at<br />\nand,<br />\nand<br />\nfourth quarters. Penn's<br />\nUniversity<br />\nplay for discovering ability in new Thursday, over 50 candidates sponsibility of sucecss is laid on<br />\noffensive power lay in their aeriel<br />\nmen,. that it was decided to have turned up for the Glee Club, 25 the student body. Since laws<br />\nTwo new appointments to the<br />\nattack<br />\nand their now famous \"hidfor the Banjo Club, and 20 for'che which<br />\nit produced again this fall.<br />\nhave not the approval of the rank of full professor in the deden ball' play. The latter is so<br />\nOrchestra. There was a good<br />\nWill Give \"Silken Purses\"<br />\ngoverned cannot be easily enforced. partment of physics, were formalnamed , because each backfield<br />\nSilken Purses by \"Dinty\" Moore showing of freshmen at the try- a large measure<br />\nof self government ly announced today by Dr. Frank<br />\nman's sleeve is covered with<br />\nis his first attempt at playwriting outs.<br />\nis given to students. This method J. Goodnow, president of the<br />\nleather sheeting, which the oppoand it is expected that much interMr. Edgar T. Paul, who suc- of putting<br />\nthe law-making, to a Johns Hopkins University. He<br />\nsition often mistakes for the ball.<br />\nest will be taken in this skit by stu- ceeds the late Mr. Hobart Smock<br />\nlarge degree, into the hands of the said that Dr. Karl F. Herzfeld,<br />\nThe result is that before the opdents on the campus due to the fact as leader of the Glee Club, was students,<br />\nDr. Goodnow explained, who came here last year from<br />\nthat Moore was at one time a well- well satisfied with the men whose<br />\nGermany as the \"James Speyer posing line is able to discover who<br />\nanswers a more lively spirit of<br />\nVisiting Professor,\" had accepted is carrying the ball, a substantial<br />\nvoices he tested. Osmer Steinknown student at Hopkins.<br />\nresponsibility and a keener in- a<br />\npermanent appointment with the gain is made.<br />\nRehearsals for these plays will wald and Mr. Conrad Gebelein, terest in<br />\nthe welfare of the Uni- university. Dr. Herzfeld will also<br />\nRogers Is Great Back<br />\nbegin the first of next week and as leaders of the Orchestra and Banversity.<br />\nbe Professor of Theoretical MeThree<br />\nof Penn's touchdowns<br />\nusual three rehearsals each—week jo Club, respectively, were also<br />\nAfter Dr. Goodnow had fin- chanics. The other appointment were the direct result of forward<br />\nwill be held, the days and time of pleased with the showing.<br />\nished speaking, Brinton Stone, to the full professorship was that passes. The others were attributhem, however, still being uncertain.<br />\nof Dr. A. Herman Pfund, formerly<br />\npresident of the Student Council,<br />\ntable to the marvelous broken<br />\nassociate professor of physics.<br />\nThese plays will be produced at Hullabaloo Holds<br />\noutlined for the benefit of the new<br />\nthe Playshop Theatre on Saturday,<br />\nDr. Herzfeld was professor of field running of Rogers, and the<br />\nInitial Meeting<br />\nstudents, the workings and re- theoretical physics and chemistry line plunging of Wascolonis, a<br />\nNovember the twentieth.<br />\nWork on the 1927 Hullabaloo got<br />\nquirements of the honor system. at the University gof Munich. He two-hundred pounder from the<br />\nAll members of the business, art under way yesterday at a meeting<br />\nFollowing him, Henry Jarrett, was the ifirst appointee to the vis- Pennsylvania coal mines.<br />\nand production staffs and all candi- of the staffs and candidates in the<br />\neditor-in-chief in NzwS-LETTER and iting professorship established by<br />\nThe game itself was marked by<br />\ndates for these staffs are expected Barn.<br />\nJames Speyer of New York for<br />\npresident<br />\nof<br />\nOmicron<br />\nDelta<br />\nKapto present themselves at the meetCharles T. Reese, editor, and<br />\nthe purpose of bringing to the the excellent condition and clean<br />\ning on Thursday as it will be neces- Eugene O'Dunne, business mana- pa, gave a short talk on the tra- Johns Hopkins each year a lead- playing of the Hopkins team.<br />\nsary to begin work almost imme- ger, outlined the work to be done ditions of Johns Hopkins. Larkin ing scientist from one of the uni- Whereas Penn was penalized for<br />\ndiately under the direction of Don- by the various staffs. As usual it Farinholt, president of the Stu- versities in Central Europe. Dr. a total of fifty yards, the Jays reold Bolton and Maxwell Bertuch, is planned to make the book a big- dent Activities Council, then told Herzfeld received his Ph. D. deceived no penalties at all. In adtemporary managers of the Busi- ger and better annual than those of the various activities which gree from the University of Viendition, while Penn was using nearness and Production staffs.<br />\nof previous classes.<br />\nmay be taken up. Following a na in 1914 and returned to that ly three complete teams during<br />\ninstitution after the war. He went<br />\nfew announcements cheer practice<br />\nto the University of Munich in the course of the game, Coach<br />\nHABERDASHERY SHOP IN BARN AT ONE<br />\nwas held which consummated the 1920 and was promoted to a pro- Van Orman made but three subTIME A THRIVING TONSORIAL PARLOR assembly.<br />\nfessorship there in 1923.<br />\nstitutions<br />\ne-up. in the Black and Blue<br />\nMuch of Dr. Herzfeld's work, it !in<br />\nSeveral 'years ago a tonsorial store with Gard Mallonee as his<br />\nwas said, has dealt with researches<br />\nparlor was located on the north assistant. This year Mallonee and<br />\nBiddison Scores<br />\nHopkins Again On<br />\nconcerning the Zeeman effect, a<br />\nThe Jay tally came in about the<br />\nSide of the Barn and did a rush- Liebensbereger are at the head of<br />\nDistinguished List phenomena occurring when light<br />\nmiddle of the third quarter as the<br />\ning business in haircuts and the establishment.<br />\nThe Johns Hopkins R. 0. T: C. is broken up to form the colors<br />\nresult of a Penn fumble. With the<br />\nshaves. For a while the shop<br />\nAlthough most colleges give<br />\nis once more on the distinguished of the spectrum. Studies of this<br />\nProspered and then suddenly went special scholarships to athletes,<br />\nball<br />\non Penn's forty-yard line,<br />\nphenomena are said to have<br />\nout of business—the barber died. the Hopkins authorities have service list issued by the Governproved of great benefit in difficult Murphy, the Quaker quarterback<br />\nAfter the barber's demise, Andy never adopted this means of se- ment, as was announced by Major chemical analyses by giving a clue called the signal for the \"hidden<br />\nKnecht, former Hopkins baseball curing prominent high school Hoisington.<br />\nas to how the atoms are arranged ball\" play. The ball was snapped<br />\nPlayer, and Tom Landy of foot- players. The store is the only<br />\nSeven colleges were assigned to form the molecules of compli- back, but a hitch in the smoothball fame, in 1921, became the first concession allowed to men of a:11- this position<br />\nof honor from the cated substances.<br />\nness of the backfield caused the<br />\nproprietors of the present haber- letic ability. Preference is usually<br />\nThird Corps Area.<br />\nDr. Pfund received his. A. B. de- ball to lie on the ground unprodashery establishment.<br />\nAfter given to the captain of the footThere are 82 advanced students gree from the University of Wis- tected. Biddison sensed his opKnecht and Landy had graduated ball team.<br />\nconsin in 1901 and his Ph. D. de- portunity, kicked up the pigskin,<br />\nfrom the university, the store was<br />\nThe store always has in stock a to 272 basic students in the unit gree from Johns Hopkins in 1906, and ran the forty yards to carry<br />\nmanaged by Bonner, Magill and large •assortment of tailor made at present, about half of the Freshr.nrnbull. Last year Frank Mere- suits, shoes, socks, neckties and man class signing up for the after . which he was appointed to the ball across the Red and Blue<br />\nthe faculty in the department of line. Bobby' Lyons kicked goal<br />\n(11th, track star, had charge of the pennants.<br />\nwork, as usual.<br />\n(Continued on Page 3 Column 2)<br />\n(Continued on Page 3 Column 2)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 5, 1926<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nSPEAKING<br />\nOF<br /><br />\nSPORTS<br /><br />\nThe unexpected return of \"Red'<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at Dugan, All-Maryland back last seaBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nson, to St. John's will make Coach<br />\nMcKee's job of producing a good<br />\nPublished semi-weekly from October to June by the students of Johns eleven considerably easier, and acHopkins University.<br />\ncording to reports there is a scarcity of good material at the Annapolis institution.<br />\ncommunications should be addressed to the BUSINESS MANA-<br /><br />\nTHE EMANUEL PRESS<br />\nINCORPORATED<br /><br />\nPRINTING<br /><br />\nENGRAVING<br /><br />\nEMBOSSING<br /><br />\n203 WEST FRANKLIN STREET, BALTIMORE<br />\nTELEPHONE VERNON 4519<br /><br />\nPresenting The NEW IN<br /><br />\nNeckwear for Men<br /><br />\nColor--and plenty of it, is the keynote in the Ties for Fall.<br />\nStripes predominate, and are shown in all widths, in harmonizIt will be rem.embered that this<br />\ning two-tone effects or vivid color contrasts. Some of the new allsame Dugan saved the Jo/tunics over effects are particularly pleasing.<br />\nfront a defeat at the hands of HopHomewood 0100 kins last year. In the attempt for<br />\nthe extra point after touchdown, a<br />\npoor pass from the center made it<br />\nBusiness Manager<br />\nimpossible to try for a placement<br />\nEUGENE O'DUNNE, JR., '27<br />\nkick and Dugan using excellent<br />\nheadwork picked up the ball and ran<br />\nAdvertising Manager<br />\naround end for the score, causing<br />\nthe game to end in a deadlock at<br />\nTHOMAS F. MCNEAL,'27<br />\n7 to 7.<br /><br />\nBusiness<br />\nGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\n$1.00 $1.50 $2.00<br />\nSTEWART&amp; CI:<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br /><br />\nJ. HENRY JARRETT, '27<br />\nManaging Editor<br />\nCHARLES F. REESE, '27<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br /><br />\n, Columnist<br />\nFRANCIS M. HASBROUCK, '27<br /><br />\nCirculation Manager<br /><br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nBRINTON H. STONE, '27<br />\nNORMAN B. GARDINER, JR., '28<br /><br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nJunior Editors<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '27<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR., '29<br />\nLEONARD B. NOLLEY, '29<br />\nROBERT S. NYBURG, '29<br />\nJOHN G. TURNBULL, '29<br />\nA. BERNARD CHANCELLOR, '28<br />\nDONALD HISS, '29<br />\nPHILIP NESS, '29<br /><br />\nLAWRENCE 0. MCCORMICK, '28<br /><br />\nAssistant Business Managers<br />\nWILLIAM BORTNER, '27<br />\nIRVING HOFFMAN, '28<br />\nDONALD C. WEILLER, '28<br />\nSAMUEL M. HECHT, '29<br />\nLours M. RAWLINS, '28<br />\nH. ADDISON CAMPBELL, '29<br />\nZANVYL E. KRIEGER, '28<br /><br />\nMember Southern- Intercollegiate Newspaper Association<br /><br />\nPrinted by Read-Taylor Press, South and Lombard Streets<br /><br />\nLUCK<br /><br />\nConsiderable comment has been occasioned by the early dates set<br />\nthis year for class elections. No doubt some of this unfavorable criticism has been just. With little or no advance notice, members of the<br />\nSenior and Junior classes, in the midst of the turmoil brought about by<br />\nthe selecting of courses, the extra effort required to once more set the<br />\n, wheels of activities in motion, and the absorbing spectacle of the first<br />\nfreshman-sophomore run-ins, were called upon to make nominations<br />\nfor class officers or student councilmen. On the next day they were<br />\nfollowed by the sophomores.<br /><br />\nEvidently, Dartmouth, last year<br />\nconsidered by many leading authorities as the best team in the<br />\ncountry, will have another excellent<br />\nteam this season despite the loss of<br />\nthat great forward passing combination of Oberlander to Tully.<br />\nIn the opening game Norwich<br />\nwas smothered 59-0 and according<br />\nto reports another forward passing<br />\nteam consisting of Dooley and Lane<br />\nwas discovered.<br />\nAlthough Oberlander, last year's<br />\nAll-American back is not at Dartmouth this year, the backfield is expected to be equally as strong as<br />\nlast year's quartet.<br />\nCaptain Horton, Lane and McPhail, who with Oberlander were<br />\nthe regular ball carriers last season,<br />\nhave returned to college and Dooley.<br />\na star two years ago, but ineligible<br />\nlast year because of studies, has<br />\nmade up his deficient work, and is<br />\nnow the fourth member of the backfield.<br /><br />\nAPenYou Can Lend<br />\nwithouta Tremor<br />\nFor its point yields to any hand<br />\nyet resumes its original shape<br />\nIts \"Permanite\" barrel and cap will not break<br />\nHE Parker Duofold point<br />\ncombines what you get in<br />\nno other point—durability and<br />\nflexibility.<br />\nThis point yields to any style<br />\nof writing yet retains its original shape. It is guaranteed for<br />\n25 years not only for mechanical perfection but for wear.<br />\nAnd Parker Duofold's barrel<br />\nand cap will not break, though<br />\nyou drop it a hundred times.<br />\nFor they are now made of Permanite—Parker's non-breakable materialthat has withstood<br />\nsuch gruelling tests as a 3,000<br />\nfoot drop from an aeroplane.<br />\nThis combination—the Parker Duofold Point and the<br />\nParker \"Permanite\" Barrel and<br />\nCap—makes the world's greatest writing instrument.<br />\nYou cannot get such value in<br />\nany other pen, at any price.<br />\nStop at the nearest pen counter<br />\ntoday and try your size and<br />\npoint in a Parker Duofold.<br /><br />\nT<br /><br />\nC. C. Pyle, the professional<br />\nfootball and tennis magnate, made<br />\na great move towards strengthening professional tennis when he<br />\nsigned Vincent Richards last week.<br />\nRichards during the past season<br />\nhad a better record than Tilden and<br />\nhas ranked either second or third<br />\namong the first ten for the last several years.<br />\nHarvey Snodgrass, who comes<br />\nfrom the Pacific Coast, also turned<br />\nprofessional last week and \"Cold<br />\nCash\" Pyle, as he is sometimes<br />\ncalled, will probably arrange a tour<br />\nwith Snodgrass and Richards playing in the larger cities of the country, along with Mlle. Lenglen and<br />\nMiss Browne.<br /><br />\nAside from the possible thwarting of any of the enterprising young<br />\ncampus politicians, whose existence is as a matter of fact large by mythical, this decidedly precipitate gathering of the clans was unfortunate.<br />\nClass office and Student Council membership, although not matters of<br />\nlife and death importance, nevertheless ought to be considered in a<br />\nfairly serious frame of mind, both for the honor involved and their<br />\nopportunity for service to class and university. Those that know anything whatever about class elections know that nominations are fully<br />\nDORM<br />\nas important as the election itself, and also that in making intelligent<br />\nDOINGS<br />\nnominations, a little time and thought are necessary, at least to the average run of mortals.<br />\nThose fraternities not repreThe blame, if there is any blame, it might be more correct to say sented on the inter-fraternity<br />\nadvice, should not be given to class officials for calling the meetings board have already 'had a big<br />\nearly this year; but rather for not holding the Student Council elections rushing season at the. dormitory.<br />\nlast year; for that is where the trouble lies. Because these elections Freshmen have been pledged durwere not held in the spring, and because the hectic battles of the first ing meals, while taking 'showers.<br />\nand in the midst of other activimonth make the existence of the Council even more than ordinarily imties. Practically every man eligiperative, the elections have to be held as soon as possible; there is no<br />\nble at the dormitory has been<br />\nother course to be taken.<br />\ngiven a choice of lapel pins.<br />\nDuring the next few weeks while the issue is still fresh, before it<br />\nThe proportion of graduate and<br />\nsinks to a relatively remote position in the undergraduate mind, steps undergraduate residents remained<br />\nshould be taken to insure the election of Student Council delegates in the about the same. The undergraduspring. Provisions to this effect should be written into the, class con- ates have a slight majority possistitutions, or, if they already exist, should be made clearer. This year bly. As in previous years the<br />\nmanagement has experienced no<br />\nthe class nominations stem to have been as satisfactory, as usual, despite<br />\ndifficulty in disposing of the<br />\nthe hurry. But it was through good luck. No one can predict what ,rooms and many applications were<br />\nsimilar conditions may bring forth in the future.<br />\nof necessity not accepted.<br /><br />\n`Tennanite\"—the new<br />\nNon-Breakable Material of<br />\nwhich all Parker Pens and<br />\nPencils are now made—is<br />\nlustrous, light-weight, and<br />\ndoes not break,fade or shrink.<br />\nParker Duofold Pencils to match the Pens:<br />\nLady Duofold. $3; Over-size Jr., $3.50<br />\n\"Big Brother\" Over-size. $4<br />\nTHE PARKER PEN COMPANY, JANESVILLE, Wis.<br />\nOFFICES AND SUBSIDIARIES: NEW YORK'CHICAGO<br />\nATLANTA • DALLAS • SAN FRANCISCO<br />\n• LONDON, ENGLAND<br />\nTORONTO, CANADA<br /><br />\nParker<br />\nDuofold<br />\nJunior<br />\n$5<br />\nParker<br />\nOver-size<br />\nDuofold<br />\n$7<br />\nLuchy Curve Feed 1and 25-YearPoint<br />\nLady Duofold 05<br />\nDuofold Jr. $5<br />\nRed and Black Color Combination—Reg. Trade Mark C. S. Pat. Office<br /><br />\nTH E JOHNS HOPKINS NEWS-LE FTER, OCTOBER 5, 1926<br /><br />\nMAILBAG<br />\nTHE NEWS-LETTER<br /><br />\nTWO NEW APPOINTMENTS<br />\nMADE IN PHYSICS<br />\nDEPARTMENT<br /><br />\nBARN CAFETERIA<br />\nI.<br /><br />\n(Continuedfrom Page I, Column 4)<br /><br />\nphysics. In his researches at<br />\nJohns Hopkins he has devoted<br />\nhimself to investigations concerned with the problems of light<br />\nand in this connection designed a<br />\nnumber of new instruments for<br />\nwhich he was awarded the medal<br />\nof the Franklin Institute.<br />\nDr. Pfund's instruments for<br />\nmeasuring minute differentiations<br />\nin color have been used extensiv.?.ly for improving methods in the<br />\npaint and dye industries. He also<br />\nAN APPRECIATION<br />\nTo the Editor of the NEWS-LETTER. discovered that the dangerotts<br />\nDear Sir: For two and a half infra-red rays, which often cause<br />\nYears a son of the University has serious eye trouble among men<br />\nlabored •unceasingly for the ad- who work near blast furnaces,<br />\nvancement of his Alma Mater. Now could be shut off by goggles on<br />\nthe day draws near when, sensing which a thin transparent film of<br />\na call to greater endeavor, he is to gold had been deposited. The<br />\nsever his connection with us for a vacuum therinophile, a mechaaconsiderable period of time, • if not ism used in measuring the heat of<br />\nthe stars, is another of the instruPermanently.<br />\nThe Board of Trustees has ex- ments devised by Dr. Pfund.<br />\nFollowing the resignation of<br />\npressed its infinite regret at his-decision; its President has publicly Dr. Joseph S. Ames as professor<br />\nsignified the debt of gratitude the of physics and director of the<br />\nUniversity owes him for his un- physics laboratory, so that he<br />\nfailing efforts. Day after day, might accept appointment as Prowhen we have passed the office in vost of the university, it was anthe Chemical Laboratory, we have nounced that the direction of the<br />\nseen the light burning after all oth- laboratory would be assumed by a<br />\ner than the hall lights had been ex- committee composed of the facultinguished. He •vet labored on ty of the physics department.<br />\nThis committee has organized itWhen all others had gone home.<br />\nUndoubtedly a number of this self and has appointed Robert W.<br />\ntoiler's 'policies have not been un- Wood, professor of experimental<br />\nderstood. His plans are too 'prac- physics, director for this year. Dr.<br />\ntical, too far-sighted for us to Bliss will be secretary. Dr. Hetzgrasp their full import. No other felcl will take over Dr. Ames's<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br /><br />\nindividual in the University has classes.<br />\nworked so hard in the interest of a<br />\nStudent Activities Building, or so<br />\nSCORES THE FIRST<br />\nnnselfishly. We have all been so BIDDISON<br />\nHOPKINS TOUCHDOWN AS<br />\nWrapped up in our own narrow dePENN DEFEATS JAYS 40-7<br />\nsires that we could not unde-pstand<br />\n(Continued from Page 1 Column 5)<br />\na plan which provided for the com- immediately afterwards by a place<br />\npletion of the building even if kick.<br />\nfunds ran short.<br />\nCaptain Gardner Mallonee and<br />\nWe ourselves have done nothing<br />\nJack Lawrence were the stellar<br />\nfor the building: we have not<br />\nperformers for Hopkins. With<br />\nraised a single cent, or even offered<br />\nthe exception of the first play of<br />\nsuggestions as to the interior arthe game, when Rogers tore<br />\nrangements. There was nothing to<br />\naround his flank, \"Mal's\" end was<br />\ntell the originator of the plans what<br />\npractically impregnable. In addiWe wanted; yet we loudly protested<br />\ntion, he blocked the dropkick after<br />\nWhen the plans did not conform to<br />\nPenn's first touchdown in the last<br />\nOur ideas. Because we were afraid<br />\nquarter. Lawrence was here,<br />\nthat we would not have a place in<br />\nthere, and everywhere on the dethe building, we wanted immediate<br />\nfense, and was the best ground<br />\nguarantees of a definite room. The<br />\ntoiler has labored against our oppo- gainer and forward pass receiver<br />\nsition, always unselfish, never ex- on the offense. Watson Pindell<br />\nPeeling anything for himself. The played a steady, if not brilliant<br />\nAdministration wished not only to defensive game, making difficult<br />\ngive the Activities rooms of their tackles in rapid succession.<br />\nOW, and us a cafeteria and lounging rooms, but also to have us keep<br />\nthe Barn as an additional student<br />\nbuilding. We have garbled every- LARGE CROWD ATTENDS<br />\n.ANNUAL RECEPTION<br />\nthing.<br />\n(Continued from Page 4 Column 2)<br />\nAnything we can say in appreowner. However, at the end<br />\nthe<br />\nof<br />\nciation of the toiler's services is not<br />\nhalf enough. He has given of the of the trick, to the amazement of<br />\nbest years of his life and of the the audience, the hat was found to<br />\nbest of his ability for the Univer- be entirely unharmed. The magicsity. The efficient Alumni organi- ians also showed great proficiency<br />\nza.tion and the splendid Fiftieth Anin making cards and eggs disappear<br />\nniversary Celebration soon to be<br />\nheld are the work of his hands. into the air and then reappear.<br />\nFollowing the magic act, the rePoi- he has fought the good fight.<br />\nception was concluded with the<br />\nRespectfully,<br />\nG. B. N. serving of ice cream and cakes.<br /><br />\nSWARTHMORE<br /><br />\n41<br /><br />\nBRUYERE PIPES<br /><br />\nI.<br /><br />\nRegular Price, $2.00<br />\nWhile They Last, $1.25<br />\n41<br /><br />\ni+<br /><br />\n1<br /><br />\nThe college man who<br />\ninvests in Katz clothes<br />\nfor the first time has<br />\nonly one regret—that<br />\nhe didn't buy them<br />\nsooner<br /><br />\n211-213<br /><br />\n1<br /><br />\n1<br /><br />\nO<br /><br />\nN campus or off campus, rain<br />\nor shine, night or day, a Stetson is<br />\nthe smartest hat and the longest lived.<br /><br />\nE. Baltimore St.<br /><br />\nSTETSON HATS<br /><br />\n$30 up<br /><br />\nStyled for young men<br /><br />\n_Alva<br /><br />\nrtaltoot<br /><br />\nCamels add the charm of living<br />\nWHETHER through the tasks of<br /><br />\nevery day, or in life's moments of<br />\ncrisis and great reward, the comfort and understanding of Camel<br />\ncheers us on our way. For no other<br />\ncigarette was ever so friendly, so<br />\nloyal as Camel. The unfathomed<br />\ngoodness, the deep underlying<br />\nquality of Camel tobacco, is<br />\never-dependable.<br />\nThe world's largest tobacco organization buys the best of everything for Camels. The choicest<br />\nTurkish and Domestic tobaccos<br /><br />\ngrown. The kind of blending that<br />\nonly such a group of experts could<br />\ngive. Regardless of what you are<br />\nwilling to pay, there is no other<br />\ncigarette like Camel; there can be<br />\nno better cigarette made than<br />\nCamels. Camels never tire the<br />\ntaste, no matter how indefatigably<br />\nyou smoke them, never leave a<br />\ncigaretty after-taste.<br />\nIf you don't yet know Camel<br />\nenjoyment, just sample the most<br />\nexquisite fragrance that ever came<br />\nfrom a cigarette. Have a Camel!<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br /><br />\n192f4<br /><br />\n•11<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 5, 1926<br /><br />\n4<br />\nLARGE CROWD ATTENDS<br />\nANNUAL FRESHMAN<br />\nRECEPTION<br />\nDr. C.<br /><br />\nJ. H. FURST CO.<br /><br />\nLINEUP OF HOPKINS-PENN GAME<br />\nPENN (40)<br />\nJ. H. U. (7)<br />\nMallonee . ..L.E...... Thayer<br />\nSmith<br />\nLeibensp'r<br />\nL T<br />\nDuncan<br />\nL G<br />\nKaufman<br />\nButler<br />\nC<br />\nClayton<br />\nParke<br />\nDill<br />\nR G<br />\nHatre<br />\nBiddison ....R. T<br />\nF. Scull<br />\nKaufholtz<br />\nR E<br />\nMurphy<br />\nLyons<br />\nQ B<br />\nRogers<br />\nLawrence<br />\nR H<br />\nP Scull<br />\nL H<br />\nPindell<br />\nF. B.. Wascolonis<br />\nBoynton . ...F<br />\nScore by Periods<br />\nJ. H. U.... . 0 0 7 0— 7<br />\n14 13 0 13-40<br />\nPenn<br />\nSubstitutions: Hopkins, Caplan<br />\nLyons; Dotterweich for<br />\nfor<br />\nBoynton; Strader for Clayton.<br />\nPenn, Fields for Murphy, Pine for<br />\nWascolonis, Freeman for Rogers,<br />\nOdione for F. Scull, Thompson<br />\nfor Fields, Downey for Hatre,<br />\nMiller for Smith, Singer for F.<br /><br />\nV. B. Wight Addresses Meeting;<br />\nRodgers and Magicians<br />\nEntertain Audience<br /><br />\nAbout two hundred freshmen<br />\nand upper classmen attended the<br />\nannual reception given Friday night<br />\nby the Hopkins Y. M. C. A. in honor of the first year men. Lowell S.<br />\nEnsor, vice-president of the \"Y\"<br />\nwas in charge of the entertainment.<br />\nFraternity rushing parties were<br />\nmuch in evidence.<br /><br />\nScull, Rogers for Freeman, Westgate for Butler, Hayes for Thayer, Monte for Parke, McGinnis for<br />\nDuncan, P. Scull for Odione,<br />\nWascolonis for Pine, Schaff for<br />\nSinger, Hatre for Downey, Smith<br />\nfor Miller, F. Scull for Schaff,<br />\nButler for Westgate, Thayer for<br />\nHayes, Hatre for Monk, Duncan<br />\nfor McGinnis, Fields for Murphy, Douglas for Rogers, Odione for P. Scull, Mulligan for<br />\nWascolonis, Sullivan for Thayer,<br />\nLenzner for F. Scull, Kishner for<br />\nButler, Walker for Hatre, Fonde<br />\nfor Smith, Poole for Duncan, Sanford for Parke, Thompson for<br />\nFields, Freeman for Douglas.<br />\nScoring: Touchdowns, Biddison, Wascolonis (2), F. Scull,<br />\nRogers, Murphy, P. Scull. Try<br />\nfor point—Lyons (place kick),<br />\nWascolonis, 3 (place kicks), P.<br />\nScull (dropkick).<br /><br />\nSpeeches of welcome were made<br />\nby Robert L. Bull, president of the<br />\n\"The Curse of Drink,\" which told<br />\ncghe largest selling<br />\nY. M. C. A., and Dr. Carol V. B.<br />\nof the debauchee of a drug-store<br />\npencil<br />\n44.4449ua1ity441.<br />\nWight, professor of Greek at the<br />\nworld<br />\nthe<br />\n4641,,_ in<br />\nsoda fountain. Responding to the<br />\nuniversity. Dr. Wight told the<br />\n-water<br />\ndemands of his audience, \"Bill.'<br />\nfreshmen of the advantages to be<br />\nnext recited the well-known \"Shootgained from college study and par17<br />\ning of Dan McGrew\" in his usual<br />\nticipation in student activities. Ex- entertaining style.<br />\nblack<br />\nperience gained from work in the Two youthful magicians next en- degrees Superlative in quality,<br />\nthe world-famous<br />\nvarious clubs and organizations of tertained with a variety of tricks.<br />\nthe university will prove to be of One trick that was especially good copying<br />\ngreat value in later years when the involved the manufacture of yards<br />\nof silk from a slice of bread and two<br />\ncollege man enters the world of busgive best service and<br />\neggs. During the cooking process a<br />\nlongest wear.<br />\niness. Dr. Wight also emphasized<br />\nfire was started in the hat of one of<br />\n$1.00<br />\nends, per doz.<br />\nBuy Plain<br />\n1.20<br />\nthe social advantages to be derived the members of the audience in<br />\nRubber ends, per doz.<br />\nwft all dealers<br />\na<br />\nfrom fraternity life and member- spite of the vociferous objections<br />\nAmerican Lead Pencil Co.<br />\ndozen<br />\n220 Fifth Ave., N.Y. .1<br />\nship in honor societies such as Phi<br />\n(Continued on Page 3 Column 2)<br />\nBeta Kappa and 0. D. K.<br />\nYOUR MONEY GETS INTO THE BANK WHETHER<br />\n\"Bill\" Rodgers, president of the<br />\nYOU PUT IT THERE OR NOT. IF YOU SPEND ALL, THE<br />\nBarnstormers Club and versatile<br />\nOTHER FELLOW BANKS YOUR MONEY.<br />\ncampus entertainer, next took the<br />\nMAKE YOUR MONEY WORK FOR YOU AT 4% INstage. His first number was an elabTEREST BY OPENING A SAVINGS ACCOUNT WITH<br />\norate tale of June Week, which he<br />\ninterspersed with popular songs.<br />\nHe next rendered a poem entitled<br />\nCharles and Fayette Streets<br />\nBaltimore, Maryland<br /><br />\nVENUS<br />\nV PENCILS<br /><br />\nUNION TRUST COMPANY<br /><br />\nPrinters of<br /><br />\nThe Flag, Banner and<br />\nPennant Shop<br /><br />\nV(i<br /><br />\nSuccessor to Sisco Brothers<br /><br />\nPHILOLOGICAL &amp; SCIENTIFIC<br /><br />\nFLAGS, BANNERS, PENNANTS,<br />\nSOCIETIES and FRATERNITIES<br /><br />\nPUBLICATIONS<br /><br />\nR. H. TAYLOR<br /><br />\n23 S. Hanover St., Baltimore<br /><br />\n302 Park Ave.<br /><br />\nBaltimore,<br /><br />\nSC<br /><br />\nMd.<br /><br />\nVernon 2355<br /><br />\nFift<br /><br />\nMake the Grade with a,<br /><br />\nKemington Portable<br />\nT U DEN TS<br />\neverywhere<br />\nhave found the<br />\nRemington Portable Typewriter<br />\nindispensable in<br />\ntheir college work.<br />\nYou can't get<br />\naway from the fact<br />\nthat neatly typewritten reports and theses get<br />\nbetter attention from the profs,<br />\nand very often mean bettermarks.<br />\nThe Remington Portable<br />\nweighs only 8% pounds, net.<br /><br />\nIt is the smallest,<br />\nlightest, and most<br />\ncompact portable<br />\nwith standard keyboard. The machinecan betucked<br />\naway in a drawer<br />\n7,w,„„4<br />\nwhen not in use,<br />\nfor the case is only<br />\nfour inches high.<br />\nThis handy helper, which<br />\ntakes all the drudgery out of<br />\ncollege work,can be bought for<br />\nas little as $10 down and $5<br />\nmonthly.<br /><br />\nfic<br /><br />\nscl-<br /><br />\n,JA,Of<br /><br />\n1<br /><br />\nThe Recognized Leader iii Sacs and Popularity<br /><br />\n71.4:9?)<br />\netibigz..,a:44<br />\nlb-,<br />\ntel<br />\nir<br />\ntt t<br />\nJaat<br />\n.<br />\n4144-4b<br />\nw4114*Ste<br />\n1<br />\n•15,011<br /><br />\nCLOTHES -<br /><br />\nsok<br /><br />\nReady-made<br />\nAnd Cut to Order<br /><br />\n41<br />\n1# Ase<br /><br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br /><br />\nitirrpf<br />\nmod<br /><br />\n1<br />\nshi<br />\ntioi<br />\nha]<br />\ndei<br /><br />\n\"112<br /><br />\na<br /><br />\n9.<br />\n%110,<br /><br />\n(queer lif!owe<br /><br />\n45%<br /><br />\n4<br />\n0)<br />\n4<br /><br />\nSuits and Overcoats<br /><br />\n$40,$45,$50<br /><br />\na<br />\nw.-Awl<br />\n4Pootw 4,;ow**<br />\n110.11<br />\n9<br /><br />\n•'<br />\n4,<br /><br />\nswiesmez<br /><br />\nIdentify the aristocrat<br />\nof pens by this<br />\nwhite dot<br /><br />\nDad, too, buys this pen<br />\nfor economy's sake<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\n07,1tArter 1J ousel<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nThe cheap and uncertain pen costs much more in<br />\nthe long,run. The Lifetime* is the pen of no repair costs. So accurately is it built, and so unfailingly does it perform, that we unhesitatingly<br />\nguarantee it without reservations whatsoever.<br />\nAnd because it is also a beautiful pen, built of<br />\nenduring green Radite, it is a pride of studentdom — and a coveted possession always. Spot<br />\nit by the dot—at better dealers everywhere.<br />\nPrice,in green or black, $8.75.<br /><br />\n41.1<br /><br />\nStudent's special,$7.50. Pencil,$4.25<br />\nBlue Label Leads—fifteen cents<br />\nSkrip is the best ink for all fountain pens<br /><br />\na<br /><br />\nHub<br /><br />\n.!<br /><br />\nSHEAFFEKS<br /><br />\nfor<br />\nsin<br />\nthi<br /><br />\ntvv,<br /><br />\ntha<br /><br />\nCh<br />\nAl(<br /><br />\nsti]<br /><br />\nPENS -PENCILS- SKRIP<br />\nSHEAFFER PEN COMPANY<br /><br />\nha,<br /><br />\nFORT MADISON.IOWA<br /><br />\nCharles and Fayette Sts.<br /><br />\n*Reg. U.S. Pat. Off.<br /><br />\nsin<br /><br />\n.MMNI<br /><br />\nfea<br /><br />"}], "field_media_file": [{"target_id": 38071, "display": null, "description": null, "target_type": "file", "target_uuid": "af5955ba-4936-478a-8f59-4820cb69a0c4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13225-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13225, "target_type": "node", "target_uuid": "04fd9bd0-6d64-4946-9751-dadde8cc2f45", "url": "/node/13225"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c72380f5-0f5d-4c0a-a986-1fefea246980"}]}