{"mid": [{"value": 37413}], "uuid": [{"value": "41320060-9320-4233-9342-a7e096609a33"}], "vid": [{"value": 37413}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:31:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13341-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:31:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:31:56+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXIII, No. 13<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 13, 1928<br />\n<br />\nCAGE FU ND RECEIVESDOUG:FAIRBANKS' RIVAL FOUND<br />\nIN SOPII ENGINEERING STUDENT<br />\nGOOD CA MPUS SUPPORT Tickets for the Hopkins- He was only a Sophomore<br />\nengi- \"prof\" was in the front of the room<br />\nTURKEY DAY TICKETS<br />\nON SALE NOW<br />\n<br />\nPRICE 6 CENTS<br />\n<br />\n'Dr. eddy<br />\n<br />\nJAYS LOSE CLOSE<br />\nGAME TO COLUMBIA<br />\n<br />\n.<br />\nnerring student who was unsurpass- and escape was. barred. Did the<br />\nis-Jaryland game' .n Thanks<br />\nLions Beat Hopkins by Single<br />\ngiving Day at the Stadium<br />\nably bored with his first afternoon Soph remember Doug Fairbanks?<br />\nPoint Margin<br />\nclass. The spirit of the Barn still Oh, of course, but what did he do,<br />\nare now on sale at the TreasMANY ALUMNI IN STANDS<br />\nclung to him, and he was simply un- drink \"Cokes\" and smoke Luckies?<br />\nurer's office daily from 9 to<br />\nable to focus his attention on the \"That is not the point at all!\" flung<br />\n11.30 and at the Athletic AsFigures Presented to New York<br />\nHoward Caplan Scores Both Jay<br />\nsociation office in the Battr\", rather uninteresting fact of getting scornfully back the outsider, hit un-AIwrIli at Smoker<br />\nTouchdowns<br />\nseated and remaining so. With the pleasantly upon his ears. \"Don't you<br />\nfrom 11.30- to 1. Reserved<br />\naudacity and originality of the engi- remember Doug, of the lithe and<br />\nseats will be $2.00. Students<br />\nDevelopme ats in the progress of<br />\nNew York City, N. Y., Nov. 10<br />\nneer, he ascended to and deposited athletic figure and somewhat neat<br />\nmay procure reserved seats<br />\nthe Cage Fund up to date have been<br />\n(By Staff Correspondent). A light,<br />\nhimself on the lofty perch offered little mustache? Well, his method<br />\nwith their Athletic Associafavorable<br />\nq a Freshman Class<br />\nspeedy Blue Jay eleven threw conby the window casement in the M. of retiring from a building was<br />\ntion tickets and $1.00 addimeeting held after the weekly assternation into the ranks of the<br />\nE. three stories above the campus. usually the simple expedient'of<br />\ntional.<br />\nsembly Thur ,day, November 8c adLions today by battling the heavy<br />\nFrom this vantage point he gazed dropping out of a fifth or eighth<br />\nditional pled es for $1,000.00 were<br />\nColumbia outfit to a 14 to 13 score,<br />\n.<br />\nwith somewhat wistful eyes—if it story window backwards and- landsecured. This amount brings the HOPKINS HARRIERS<br />\nat Baker Field. Howard Caplan,<br />\nengineers are wist- ing on his . . . feet. See the coni be<br />\ntotal sum ple<br />\nstocky Jay fullback, proved the outto date by underDEFEATED BY UNION cal • said that<br />\nsimplify<br />\nnection,<br />\nprocedure<br />\nthe<br />\ncampus<br />\nful—on<br />\nyou<br />\nhim.<br />\nbelow<br />\nthe<br />\ngraduates up to $7,600. This is sigstanding star for Hopkins by scorthe usual Hopkins by emerging frontwards.\" GradualCaptain of Garnet Team Almost<br />\nnificant of se<br />\ning both touchdowns. He made the<br />\nEquals<br />\nbecame<br />\nintelligible<br />\nRecord<br />\npanorama<br />\nthe:<br />\nthe<br />\ngreets<br />\nthe<br />\nof<br />\nthat<br />\nplan<br />\neye<br />\nto<br />\nly<br />\n_<br />\nfacts. In th e first place, this imfirst, at the end of the second half,<br />\n.<br />\nEngineering<br />\n- Soph, his face lit up<br />\nevery observer. The usual pathway<br />\nplies that .t ie projeet has really<br />\n- by a sensational 98-yard run and<br />\nLed by Captain Heath and Rothlater, in the next period, he plunged<br />\ngained mom ritum and is moving mann, who finished only a half min- On which several, figures straggled and'the wisaul gaze vanished. Haythrough for the second Jay score.<br />\nIntwa.<br />\nrd. Uri lergradnates who have rite behind the course-record, Union to and from the Barn, the usual ten- in mentally grasped the idea, the<br />\nas yet not Cu i-itributed may be im- College harriers dashed all hopes nis courts on one oewhich the much engineer proceeded to emerge and<br />\nAlumni Present<br />\nWith the Army-Notre Dame<br />\n• pressed by t iis statement and may of an undefeated season for Hop- discussed R. 0. T. C. was going successfully negotiated the downgame<br />\nat<br />\nthe<br />\nSpeaker<br />\nIs<br />\nYankee Stadium drawAlso<br />\nWorld<br />\nTravelee<br />\nrealize that their pledges, so far, kins by downing_ the Jays 20,to 35. our engineering herb was Supremely ward journey.<br />\nHis Book Barred from Mails<br />\ning the bulk of Manhattan football<br />\nwithheld, will be influential in put- a'he strength of the Garnet team<br />\nmanoeuvers, Certainly hot a thrillSurely, by this time, the reader<br />\nfans, only about 12,000 spectators<br />\nting the project across. Secondly, was unexpected and the match was<br />\nDr. Sherwood Eddy, famous<br />\nmg orr luring aspect,<br />\np .but,_remember, will wonder if he has missed being<br />\nwere in the stands when Remy Tyg<br />\nthe cage is in a fair way to'be real- predicted a win for-I-the Black and ing<br />\nauthor and lecturer, will be the<br />\nkicked off for the Morningside<br />\n_ •<br />\nour-engineering hero was supremely present at the occurrence of a<br />\nized. The at aount of $10,000, re- Blue.<br />\nspeaker at this week's assembly.<br />\nHeights outfit. A good crowd of<br />\nbored, and the great outdoors at miracle or whether some engineer His topic will be \"Sex<br />\ncently set up is the amount expected Heath<br />\nand Hopkins rooters, including<br />\nand Rothmann led throughmany<br />\nof the unde rgraduates, is a goal out<br />\nthe entire distance, setting a least offered- fresh air if not excite- has conquered the limits placed on Youth\". Dr. Eddy wrote a book New York alumni,<br />\nwere in the<br />\nwhich, with t little more effort of pace<br />\ntoo rapid for Scheibel and ment. Finally,--our hero recognized human motility through the air by with the same title which has just stands to cheer the<br />\nJays in their<br />\nthe students, will be attained. Fi- Captain Kelly<br />\nbeen published and is experiencto overcome. The-an acquaintance in a passerby whom the well known law of gravity,<br />\ngame fight. Although small in size,<br />\nnally, this fa t is significant in that two<br />\nwide<br />\ning<br />\na<br />\ncirculation.<br />\nHe<br />\nspent the Hopkins rooting<br />\noutfits were closely bunched un- he hailed. Standing below the win- 'Actually, the Soph -did no such<br />\nsection showed<br />\nit demonstrates that the project is til the<br />\ntwo-mile post was reached, dow, the newcomer carried on a long thing. The first part of this article last year in a specialized study of plenty of enthusiasm.<br />\nfor the most part favorable as far when Heath, Rothmann,<br />\nthis<br />\nfield, and in his work he<br />\nSchiebel,<br />\nShortly after the opening play, the<br />\ndistance conversation with the \"ex- is an account of a prosaic fact. The draws<br />\nas the und a-g-raduates are con- Kelly, and Segal<br />\nupon practically all existbroke into a scatcerned. So ar, their contributions tered formation in<br />\nsuggesclassed\"<br />\nour<br />\nobvious<br />\nlast<br />\nproduct<br />\nsoph.<br />\nthe<br />\npart<br />\nThe<br />\nof<br />\nis<br />\nfeaing authorities on this subject. siege guns of the Columbia eleven<br />\nadvance of the<br />\nbegan a concerted bombprdment<br />\nalone are twit:e as much as that re- others. The four-mile `post<br />\non the tion obviously followed. Why not ture writer's imagination who offers His point of view is that the<br />\nagainst the Jay defenses. Following<br />\nceived by the Levering Hall Fund home team's<br />\n. course- is marked b.v come down and hold a more inti- this somewhat cinemagraphic and frankest, kind of treatment and a punt<br />\nby Bobby Lyons to Columfrom the cam Pus as a whole. Thus a long hill: This proved_the turnmate and closer conversation ? Then non-coll_4_ate method of escaping sex education is desirable and<br />\nbia's 48-yard line, Joe Stanczyk tore<br />\nfar the situat on is somewhat grafi- ing point of the meet, the orderwould<br />\nbe<br />\nhelpful.<br />\nIncidentally<br />\nwas the sad fact revealed:. The dull classes.<br />\nthrough right end for a healthy gain<br />\nfying and it is felt.that a favorable changing at that mark..<br />\nthis book was barred from the<br />\nSchiebel,.<br />\nof twelve yards. Buser, Stanczyk<br />\nimpression of the matter was given who was running third,_ was followmails. This is the first tirne that<br />\nPlans Made For Student Dr.<br />\nand Scott of the Lions' backfielo<br />\nto the New ork Alumni who were ed by Segal, who nosed out Kelly<br />\nEddy has spoken in assembly<br />\npresent at a moker given in honor in the hard grind.<br />\nParade On Friday at Hopkins. He is being brought then smashed the line for a total<br />\nyardage of thirteen in four plays.<br />\n:of the food) 11 team after the Cohere by<br />\nKelly, Fifth<br />\nDefinite announcements for plans A H the University Y. M. C. Two mbre jabs at the Hopkins forlumbia game.<br />\nhase<br />\nworked without a salKelly was :, :110vvi:: I I :\\ N,i-jny Noted Criminologist Discusses for the annual student-body parade A.<br />\nward' wall , resulted in placing the<br />\n• Several Cases<br />\nCampaiie Net Concluded<br />\n.ary all his life, giving his servand O'Connor, of Union; I inerson,<br />\n' on Friday evening preceding the St:<br />\nball on the 15-yard line. A long,<br />\nDespite th : improvement in the on° ,<br />\nices<br />\nto<br />\nthe<br />\norganization<br />\nof<br />\nwhich<br />\n.<br />\n.‘.<br />\n.<br />\nLi<br />\n•<br />\nDr. John R. Oliver, warden of John's game, were made last week<br />\narching forward, tossed by Scott,<br />\nraw, and vi afters, of opk.ins,<br />\nprogress of t le Cage Fund, the-sithe<br />\nis<br />\nso<br />\nprominent<br />\na<br />\nworker.<br />\nthe itiniversity dormitories, well- during assembly. The usual cerwas snatched by Liflander behind<br />\nnation is not definitely' concluded. in the order named. 'Several others<br />\n• In -\"Y\" Work Forty Years - the goalline for the first score of the'<br />\nknown criminologist, author ote a. emony ha consisted of a large<br />\n'ffte project 1 ias the consent of the followed but only the first ten or<br />\nSherwood Eddy was born in game. . A placement<br />\npopular novel called \"Fear,\"'and group of students starting from the<br />\nkick by the<br />\nTrustees of t te University, who had the runners are included in the scor- proud possessor of seven<br />\ndegrees, Barn at about 7 in the' evening Leavenworth, Kansas, on Janu- Columbia quarterback added the exsignified thei - approval • at the be- jug.<br />\nincluding M. D., D. D., and Ph. D., dressed in various rough apparel ary 19, 1871. He graduated from tra tally.<br />\nginning Of th e Fund. The framed '<br />\nUnlike the four and one-half addressed a large assembly last week and fitted -with bright torches,'pa- Yale in 1891 with the degree of<br />\nLions Score Again<br />\nplans of the proposed cage-, which<br />\nin the C..E. Hall. Dr. Oliver en- rading downtown through Charles Bachelor of'Philosophy. At pres- The Lions,<br />\nhaving tasted the<br />\nare -in appearaiice in several places mile course at Hopkins, the Gar, tertained the audience with an exp,,<br />\nent<br />\nhe<br />\n.holds<br />\nthree<br />\nother<br />\ndegrees,<br />\nStreet,;nn<br />\ncli general \"making u<br />\nflavor of blood, came roaring back<br />\nOn the campu i, are another evidence nets boast of a six-mile route. This Cellent outline<br />\nof different types of the good old city. Plans for this all honorary, A. M. A. front Yale for more. Following<br />\na kick by<br />\nof official sawction. It may be said course, however, is not so difficult criminals encountered in modern<br />\nyear will be,a bit different in that and an M.A. and LL. D. from 'Lyons, Stanczyk launched another<br />\nalso that me ral support is almost a one as is the Jay's, as hard roads crinie, - He fried to impress<br />\nWooster<br />\n'<br />\nCollege.<br />\nFive years drive for the<br />\nthe au- students will wear instead of odds<br />\nJay goal line by sweepunanimous. At practically every and paths are chiefly involved in the dience at first with the fact that<br />\nand ends a uniform costume which after graduating from college he ing around right end for nine yards.<br />\n'meeting at wliich the cage has been<br />\ncourse used last week. The record there is no such thing as •an under- will be none other than the -well: became Y. M. C. A. secretary for On the next play, Liflander was<br />\ndiscussed, the project received<br />\nthe Union cross country course world or an underworld character. known pajamas. They will be fitted India and then,secretary for Asia. chased far back of the line of<br />\napproval of tl te total audience. the.or<br />\n1<br />\nHe brought out that people serving tout as usual with the torches, but it •In 1911 he was appointed a meinscrimmage when the Jays broke<br />\nis thirty-fotu- mlnutes, twenty-six<br />\nThe campai<br />\nber of.the International Committhrough.the Columbia defenses. For<br />\nwill continue to do so until the and two-tiftlis seconds. Heath's and ly perfectly' ordinaa_ individuals.<br />\ntee<br />\nof<br />\nthe<br />\nY.<br />\nM.<br />\nC.<br />\nA.<br />\nIn<br />\nthis<br />\nCawill add_a new interest awl agreater<br />\na few moments, the Lion back apExecutive Cotnmittee gets,a definite Rothmatin•s times differed only in a They simply have done wrong and<br />\npacity<br />\n-Dr:<br />\nworked<br />\namong<br />\noriginality to the parade. There will<br />\npeared doomed for a fifteen or<br />\nanswer front -very student. Recent- small fraction of a second, the for- have been caught! They are paying<br />\nalso be two original floats built to students in Japan, Korea, China, twenty-yard' loss but, by a quick<br />\nly, letters we re sent to every stuIndia,<br />\ndearly<br />\ncrime.<br />\ntheir<br />\nthe<br />\nfor<br />\nwas<br />\nIt<br />\nNear<br />\nEast,<br />\nand<br />\nRussia. change of pace, he suddenly<br />\ntrier of the two running the course<br />\nPrecede the marchers and although<br />\nredent to which he was asked to reply<br />\nn.,•t., brought out that murderers are not their exact description has not been He has addressed the provincial<br />\nin the fast time of thir<br />\nversed the whole field and tore<br />\ngiving his at itude on the matter.<br />\n'<br />\nty-four -^L.- strictly,<br />\ncriminals<br />\nbecause<br />\n_parliament<br />\nin most disclosed<br />\n•<br />\nof China b3' request. around<br />\nas yet, they will undoubtend for a substantial gain.<br />\nand two-fifths secSo far, respo ises have been coming t,'tes°fifty-six<br />\n,<br />\ncases they have Made just one mis- ,<br />\nbe ol_a very clever and eye- During the World War he served Several minutes later, this same<br />\nin very slowly:. Men who have not onds. Schiebel, who ran third, did take in their lives in a moment of<br />\nwith the Army'Y. M. C. A., but<br />\nedlY<br />\noPeiling<br />\ny<br />\n',./<br />\nplayer scored the New Yorkers' sec.<br />\nas yet answer xl are requested to do the six mile route in thirty-six min- extreme anger or excitement and as<br />\nThere will be a few more an- afterwards he became a deter- ond touchdown by a center plunge<br />\nso at once, b!cause the Committee utes and eleven seconds, which is a consequence they pay dearly with nouncements of later plans for the mined pacifist, declaring that he of ten yards. A<br />\nperfect placement<br />\nis desirous of closing out the mat- fast time for a .1: trange course of their, lives or through life impris- parade, but in the meantime tet would not serve in another war kick gave Columbia a fourteen-poin.<br />\nonment.<br />\nTo<br />\nbring<br />\nthis<br />\nout<br />\npoint,<br />\nsuch length. The summary, which<br />\nthose \"loud\" pajamas ready and plan under any consideration. At lead.<br />\nter 1,,\\ the end of the week.<br />\n•<br />\nDr, Oliver related three distinct into be with us at the Barn Friday present he<br />\ne runpresents the order in which tire<br />\nCaplan Thrills Crowd<br />\nDon, ;trader Speaks<br />\nis a National Secrestances of murderers, cases he had<br />\n,<br />\nevening, November 15at<br />\nFollowing this score, Tys booty'<br />\n, 7 o clock.<br />\nAt the -past assembly, D<br />\nDow Strad- ners crossed the -line and the time closely followed.<br />\ntary of the Y. M. C. A. His home<br />\nthe kick-off far into the Blue Jay<br />\ner;captain of the football team, ad- of each 'follows:<br />\nis at Jackson Heights, Long territory. Caplan snatched<br />\nThe first of these cases was• that Hopkins Band Plays<br />\nthe ball<br />\ndressed the st idents in reference to<br />\n1. Heath, Union, 34.562-5; 2. of a young foreigner who was a sort '<br />\nout of the air on the two-yard line.<br />\nAt Century Theatre Island, N. Y.<br />\nthe cage. H urged every man to Rothmann, Union, 34.56 1-2; 3 of a \"rolling stone\" in this country.<br />\ntucked it under his arm and streaked<br />\nAuthor of Many Books<br />\ngive his suppart. He pointed out Schiebel, Johns 'Hopkins, 36.11; 4.<br />\nThe Johns. Hopkins Band, and<br />\nDr. Edi,ly - has written over a down the right side of the field for<br />\nHe Committed a slight crime of<br />\na touchdown. The Hopkins interthat the Aluni:Ili will back the pro- Segal, Union, 36.21; 5. Kelly, Johnsburglary andsent<br />\nwas<br />\ntt'<br />\no the peni- not the Johns Hopkins Blue Jay Or- dozen books. The list includes.<br />\nference, in the shape of a flying<br />\nposition if the undergraduates want Hopkins, 36.34; 6. Nigriny, Union, tentiary. for one year.<br />\nThis oc- chestra as advertised in the Friday Students of Asia, With Our Sol- wedge, toppled<br />\nColumbia's potential<br />\nit. .However, it is up to the students 37.07; 7., O'Connor, Union, 37.36; curred<br />\nabout fifteen years ago when NEWS-LErrEa, played a concert at diers in France, Facing the Crisis, tacklers left and right and cleared<br />\nto show their willingneSs in some 8. Emerson, Johns Hopkins,. 37.40; prisons<br />\nthe<br />\nCentury<br />\nTheatre.<br />\nThe<br />\nhand<br />\nThe<br />\nNew<br />\nWorld<br />\nof Labor, and Rus- the way for the speedy Caplan. It<br />\nwere far from the state of<br />\ntangible -form.: He urged that 100% 9. Onorato, Johns Hopkins, 38.07; perfection of today, and the man, played at both performances Mon- sia, a Warning and a Challenge. was a marvelous exhibition of broksupport be gra nted the fund. Strad- 10. Watters, Johns Hopkins, 38.- having served his term, decided<br />\nthat day night and received much ap- Tht`ii evening- he will address the en field running, with the Jay back<br />\ner told his f how students that. a 53 1-2; 11. Hawley, Union, 38.56; he never wanted to see jail<br />\nagain. plause from the well-filled theatre. University Supper Club at 310 N. well guarded behind a protective<br />\nHopkins drive has always succeed- 12. Hill, Union, 39.32; 13, Rosser, He got a position in Baltimore and They marched up the aisle playing Charles St. at 6 P. M. The reg- screen. A placement kick by Caplan added the extra point.<br />\ned and that su iscriptions have never Johns Hopkins, 39.40; 14. Miller, settled down<br />\nin a boarding house. and formed on the stage. Here they ular Tuesday evening meeting of<br />\nThe fighting Homewood eleven<br />\nbeen canceled because of lack of Johns Hopkins, 41.49. Team score: He bought a revolver out of<br />\nseveral<br />\nplayed<br />\npieces.<br />\nDuring<br />\nthe<br />\nthe<br />\nclub<br />\nhas<br />\nbeen<br />\npostponed<br />\nin<br />\nchildcame back strong in the second half<br />\n1 2 4 6 7-20 ish curiosity and carried<br />\n,<br />\nsupport. He loped that this project Union<br />\nperformance<br />\nthey<br />\nhad<br />\nreserved<br />\nseats<br />\norder<br />\nthat<br />\nDr. Eddy might speak<br />\nit with him<br />\nand threw panic into Columbia by<br />\nJohns Hopkins 3 5 8 9 10-35<br />\nwould not fall thrrutoh<br />\nin the loges.<br />\nennti....1 fro,,, Pen p a rot 1<br />\nto the members,<br />\n.Continued on Page 3, Col. 8<br />\nFreshma , Class-Subseritiet<br />\n$1,0 )0 at Meeting<br />\n•<br />\n$10,000 i CAMPUS GOAL<br />\n<br />\nOR. EDDY TO SPEAK<br />\nON \"SEX AND YOUTH\"<br />\n<br />\nDR. JOHN R. OLIVER<br />\nADDRESSES ASSEMBLY<br />\n<br />\nEctly<br />\n<br />\naure.<br />\n<br />\n\fNOVEMBER 13, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\n<br />\n2<br />\n<br />\nTHEMS11<br />\n<br />\nIffilv(1 14<br />\n<br />\nZIWKETTER<br />\n<br />\nFOUNDED 1887<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR; other communications to the EDITOR-IN-CHIEF.<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\n<br />\nJOHNS HOPKINS - - - THE COLLEGE<br />\nBy \"BEN\"<br />\n<br />\n(Tie largestselling<br />\nin the world<br />\n<br />\nDares Fate<br />\nfor Favorite<br />\nPipe Tobacco<br />\n<br />\nNot<br />\n<br />\n17<br />\nblack<br />\npart of it,<br />\nRecently there appeared in the works. There is one<br />\ndegrees Superlative in quality,<br />\nnevertheless, that seems contrary to<br />\nthe world-famous<br />\ncolumns of the NEws-LETTER, an<br />\nitself.<br />\nthing<br />\nPa.,<br />\nthe<br />\nof<br />\nDarby,<br />\nthe very spirit<br />\n3<br />\nNovember 12, 1926.<br />\narticle' exploiting the life-if. John;<br />\nevery<br />\ncopying<br />\nThat is, thc rule th-4.-forces<br />\nLams & Bro. Co.<br />\nHopkins, the founder of the univerAt all<br />\nstudent to sign a pledge on each ex- Richmond, Va.<br />\ndo<br />\nto<br />\n.Gentlemen:<br />\ndealers<br />\nsity. This article is an attempt<br />\nthrough<br />\namination. In the explanation of<br />\nhave a mania for crawling<br />\nI<br />\nbecaverns<br />\nunexplored<br />\nsomething of the kind with Johns<br />\na number of<br />\nBuy give best service and<br />\nand<br />\nthe Honor System in the handbook tween the towns of Woodstock<br />\nlowest wear.<br />\nValley.<br />\na<br />\nHopkins as a college. I say \"colthe Shenandoah<br />\nin<br />\nJackson<br />\n- 10c each<br />\nMt.<br />\nstatement:<br />\ndangerous<br />\nexceedingly<br />\nwe find the following<br />\ndozen<br />\nAmerican Pencil Co.<br />\nOne cave was passages, etc. I spent<br />\nlege\" advisedly. With the university<br />\nv illow Ave., D 48, Hoboken, N. J<br />\n\"When work is haded in under with its tightin this cavify, groping<br />\nthree hours<br />\nI find no fault.<br />\nMake.of UNIQUE Thin Lead<br />\nflashlight and<br />\ncolors-$1.00 per dor.<br />\nyour name, it is aatturred to be your blindly with a \"dead\"<br />\nColored Pencils in<br />\na severed guiding string.<br />\nis<br />\nHopkins<br />\nJohns<br />\nDEFINITION<br />\nI was finally<br />\nshort,<br />\nstory<br />\nown.\" This is not SQ. It would<br />\nmy<br />\ncut<br />\nTo<br />\na<br />\nafter<br />\nparty<br />\nsearching<br />\nby a<br />\nthe home of disappointed young seem apparent to the unbiased ob- rescued experience.<br />\nIt was a wonderterrible<br />\nof the<br />\nmen who wanted to go somewhere server, that a pledge is. only neces- ful feeling as I sat at the mouthI would<br />\nthat<br />\nfriends<br />\ntelling my<br />\nfor love nor.<br />\nelse. It is a breeding place for cyni- sary when there is some doubt as cavern<br />\nEy.13ANKS& BIbb<br />\nnot go back in there<br />\nreached<br />\n,I meant it-until Iwas gone,<br />\nmoney.<br />\nlers Silversmiths Statiorw,<br />\ncism and snobbery.<br />\nkl<br />\nto whether the student is really hon- for my can of Edgeworth.Itsomething<br />\nI recalled droppingthe cave.<br />\nASSOCIATIONS: In practically all est. enough to be put on his honor and<br />\nin<br />\nduring the excitement will do when<br />\n'Established 1832<br />\nIt is queer what a manconcerned. I<br />\nof the current books and magazine at all. But no doubt this rule will<br />\nPHILADELPHIA<br />\nhis favorite tobacco ismy tobacco it<br />\narticles on colleges we find the state- continue-in effect for years to come. realized that without<br />\nlost in the<br />\nbeing<br />\nas<br />\nbad<br />\nas<br />\nbe<br />\nwould<br />\nSCHOOL RINGS, EMBLEMS,,<br />\nment, \"It isn't so much what you A question of this ,sort arouses no cavity -SO I crawled back. feeling<br />\nCHARMS AND TROPHIES<br />\ngrand and glorious<br />\na<br />\nOis<br />\nIt<br />\nlea'rn from your books that counts, interest on the campus. The student as my hand came in contact with the<br />\nOf the Better Kind<br />\nAristocrat of Tobacco.<br />\nits ydur associations.\" This is un- body is dead from the neck up. '<br />\nYours very truly,<br />\nTHE GIFT SUGG&TION BOOK •<br />\nJr.<br />\nFink,<br />\nP.<br />\nJoseph<br />\ndoubtedly true in the average AmerTALENT: Talent, and by that I<br />\nMailed upon request-'-illustrates<br />\nican college, but,Hopkins is not av- mean an unusual cleverness in some<br />\n,<br />\nand prices •<br />\nerage. Ifopkins is an advanced high field, is raCking at Hiiiikins. 'There<br />\nJewels, 'Watches, Clocks, Silver,<br />\nschool.' At most of the other col- are a few men with great poteniialExtra High Grath,<br />\nChina, Glass; Leather and Novelties<br />\n:from which may be selected<br />\nleges there is a very definite value ities, but they are so bowed down by<br />\ndistinctive Wedding,•Birthday,<br />\nGraduation and other gifts<br />\nplaced on associations, not only be- the weight of their intellects that<br />\ntween students, but also between stu- they do nothing at all. The clifonic<br />\ndents and professors. At Princeton, epidemic of Megalocephalus is unfor example, we find hoary old Ph. founded. In athletics, with the exFORDY,,CE E. C. CAMPBELL<br />\nD's sitting around their offices in ception of ldcrosse, there are no real<br />\n'1-'14dPKINS -ALIMNUS<br />\ntheir shirt sleeves talking to students stars. On the literary side, there<br />\nAll Lines of Insurance<br />\nPhone, Plaza 1062<br />\nin a perfectly matter of fact man- is but little more. With,the excepner. This .at Hopkins would be tion of the Sandburgian A. C. W.<br />\nheresy. Even between students we there is no one able to write without<br />\nfind- little more. On the other hand a heavy pedantic style, and even A.<br />\nwe see a decided lack of friendliness. C.W. is rather stingy with his offerTaAninoN: The only trouble ings. Last year -we saw more of<br />\nabout tradition at Hopkins is the him, but this year; one rather charmNo Deposit Required<br />\nfact that there isti't any,. despite the ing bit has been his only contribuJohns Hopkins University -Students<br />\nof<br />\nfact that thei;Y\" makes a feeble at- tion.<br />\nLight and LADACTIVITIES: The adtivities at<br />\ntempt each year in the \"Handbook\"<br />\nBuicks<br />\nbard Sts.<br />\nto advance the idea that there is. On Hopkins are surprisingly well supPLaza 6000<br />\nChevrolets<br />\nl723-25 N.<br />\npage thirty-Ove of this year's hand- ported and it is for this reason that<br />\nChryslers'<br />\nCharles St.<br />\nbook, under General Customs And they rank far al;ove the rest -of tit<br />\nVErnon 4049<br />\nHopmotsiles<br />\nlisted.<br />\nfor<br />\nThe<br />\nTen<br />\nthere<br />\nare<br />\ncollege.<br />\nNEWS-I,ETTER,<br />\nTraditions,<br />\n2402 Pennsylvania Ave. _<br />\nWillys-Knights<br />\nSectjon two tells us: \"The Gilman example, is well edited, well printed,<br />\nLAfayette 2000Me rial room is for the pleasure and all in all, very satisfacfory. The<br />\nBaltimore Concedes Milestone Supremacy<br />\nof se tors only.\" Just what this Blue Jay while it does not rank<br />\n\"pleasure\" is, no one has ever at- with the NEWS-LETTER, is about as<br />\ntempted to explain. Section -three good as the average and its covers<br />\nsays: \"Everyone is to tip his hat to are as good as any, though they bethe members of the faculty.\" If lie the contents. Since the Jay<br />\nyou will stand on ithe porch of Gil- has revised its policy, is it possible<br />\nman Hall some day and trace the that we can look for something betpath of one of the faculty members ter? Drawing our cloak about us<br />\ndown to the barn, you will be able we will step softly past the Debating<br />\nto count the number of hat tippings Council, vvhicht will assuredly be lost<br />\non one finger, and you really witliatt the leadership of the naive<br />\nwouldn't need that. S_ectism eigbt Norman. Gardiner, atiel pa •a -en to<br />\ninadt--A5<br />\ngoes number three one better. In the Barnstormers.jat last we<br />\niIdCuttoOli$ifiF the old Rutgers manner it gives find something worth having. AlESTABLW1;40<br />\nENGLI-514„-IJNIVtRSITY<br />\nvent to this utterance: \"Remember, though their productions could unSTYLES, TAILOREO-,OVER YOUTHFUL<br />\nit is a .Hopkins tradition to speak doubtedly be improyed7tifey are- alCHARTS SOLELY FOR DISTOIGUISHED<br />\nto every I?Iopkins man you pass on ready on a high 'plane. The stanSERVICE IN TPM fit'a-ITO STATES.<br />\nthe campus.\" Far from cherishing dard of work done by the men who<br />\nand carrying out this ideal, tht Hop- handle the \"props\" and scenery, the<br />\nkins man runs the other way anal- efficient business- management, thel<br />\nneglects to speak to anyone. It is devotion of \"Pop\" Swindell, all are<br />\nnot strange for two men who have things greatly to be admired. The<br />\nmet one day, to pass each other the one fault that could possibly be<br />\novercoats<br />\nnext v(ithout a nod. This situation, found with the Barnstormer produchowever, is not hard to account for. tions is that there are not enough<br />\n4§1<br />\nHopkins, after all, is composed of a of them. In the Barnstormers, HopBY SPECIAL APPOINTMENT<br />\nrather motley crew, most of whom _kins has something to livp up to.<br />\nare day students and have little<br />\nOUR STORE IS THE<br />\nCONCLUSION: Since there is<br />\nchance to contract others at the Uni- something lacking at Hopkins, what<br />\nversity. An explanation, however, is the remedy? As this article is<br />\ndoes not alleviate the condition, and not intended to be \"constructive\" I<br />\nit is highly probable that nothing have nothing to offer,<br />\nespecially as<br />\nOF BALTIMORE<br />\never will alleviate it. But until it it's getting late and I want to go<br />\nto<br />\nis remedied, and men get to know bed. (This is only an<br />\nexcuse. In<br />\nThe character of the suits and<br />\neach other, no trace of that indefin- reality my sterile brain<br />\nhas nothing<br />\novercoats<br />\ntailored by Charter House<br />\nable spirit, so essential to a college, to offer<br />\nanyway.) It is to be expectwill earn your most sincere liking.<br />\nwill ever-,e-sent.<br />\ned, considering the conditions, that<br />\nTHE HONOR SYSTEM: The Honor nothing ever will be offered. HopSystem is one of Hopkins' pets, and kins has sunk into a morass of \"inrightly so. We have it on good au- nocuous desuetude,\" from which it<br />\nliditimore. Charles and Fayette<br />\nthority that Hopkins. is one of the will probably n7r emerge. All<br />\nfew colleges at which such a.system very,<br />\nad.<br />\n<br />\nENUS<br />\nPENCILS<br />\n<br />\n20<br />\n<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE E. BANKS, JR.., '29<br />\nAssistant Managing Editor<br />\nGEORGE GUMP,'30<br />\n<br />\nManaging Editor<br />\nPHILIP W. NEN. '21<br />\n<br />\nAssociate Editors<br />\nRICHARD H. WOOD,'29<br />\n<br />\nWn.anot H. DRIVER, '29<br />\nRoman S. BAIRD, '30<br />\nJunior Editors<br />\nStetiritrt L. Smith, 'SO<br />\nLeonard B. Nolley.•'29<br />\nH. Garland Hershey, '29<br />\nPaul W. Spear, '30<br />\nGeorge H. Dowell, '31<br />\nCharles Harry, '31<br />\n<br />\nW. Purnell Hall, Jr.. '30<br />\nE. Foster Dowell, '29<br />\nRichard G. Hunt. '31<br />\nHarwood P.,Mullikin, Jr., '31<br />\nIrving S.C. Gordon, '29<br />\n<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nJ. ROBERT MYERS. '29<br />\nGEORGE M. GLAZIER, '29<br />\nAdvertising Staff<br />\nOffice Staff<br />\nAlvin H. Blum, '30<br />\nTheodore A. Flefehninn, '31<br />\nGus Burke. '31<br />\nRandolph Rothchild, '31<br />\nJohn Lots, '30<br />\nLeroy Shwa, '31<br />\nGeorge S. Robertson, '31<br />\nJohn A Jamieson, '30<br />\nSidney Rattel, '31<br />\nStaff Photographer<br />\nWALTER D. SCHEIDT, '30<br />\nPrinted by The Read-Taylor Company, Lombard and South Streets,<br />\nBaltimore, Md.<br />\n<br />\nEDITORIAL COMMENT<br />\nBROTHER BABBITT<br />\n1MRATERNITIES are causing the American colleges-to turn gradually from the advancement of book learning .to the training of<br />\npractical business men. Universities were formerly dedicated to critical analysis, logical reasoning, aesthetic appreciation and ethical paination. Now veith the dominating influence of the Greek letter,'chapters over the members of the student body, our colleges are beginning'.<br />\nto instill into our American youth such moral qualities as the fighting<br />\nspirit, the will-to-win and initiative.<br />\nSuch is the interesting theory advanced by Max McConn, Dean<br />\nof Lehigh University, in the current issue of The North American<br />\nReview._ At the beginning of his treatise, the author reveals the informition that the Average college fraternity takes into account four<br />\nprincipal points in the rushing of freshmen: money; familY; the preparatory school which the rushee attended; and personal qualities.<br />\nThe financial standing of the candidate is of little importance to<br />\nthe fraternity rushing committee. If the freshman's father is an influential man in his home town and the frosh's mother is a social<br />\nleader, the rushee's chances of receiving a bid are materially increased.<br />\nThe social reputation of the preparatory school which he attended is<br />\nalso considered of great importance by the fraternity.<br />\nBut of the four criteria, the matter of \"personality\" stands foremost. A boy with a winning smile, a \"smooth line\" of conversation<br />\nand a pleasing manner, is certain to be taken. If he has won dis- •<br />\ntinction in athletics, dramatics or college publication work he be•<br />\n_<br />\ncomes even more desirable. - •<br />\nFraternities seem to put little or no emphasis on the matter of<br />\nscholastic perfection, in the opinion of the Lehigh educator. The<br />\nchapter is, of course, interested to the extent of seeing to it that its<br />\nmembers \"stay in college\".. Probation for a, member means that he<br />\nwill be debarred from athletic competition and participation in!outside activities. The typical fraternity house is distinctly non-intellectual in general atmosphere and any conversation of a \"high brow\"<br />\nnature is completely taboo.<br />\nBut the author hastens to explain that he.is not attempting anything in the nature of an \"indictment\" of the fraternity. He admits<br />\nthat the typical Greek fritter is an exceedingly_inaustrious and hard<br />\nworking young man. In addition to his periods of class room work<br />\nand studies, he must play on the teams, practice .for the glee club,<br />\nattend dramatic rehearsals, organize meetings, give dances, arrange<br />\nbanquets and sit on numberless boards and committees.. Students contend that these outside activities are a more valuable means of training than book learning. When they graduate, they send their sons<br />\nback to the campus to follow in their footsteps and become student<br />\nleaders. Dr. McConn makes no attempt to refute these claims—on<br />\nthe contrary, he admits that these contenions are sound and correct.<br />\nThese students, with their self-devised course of training, consisting of outside activities, stand for a conception of higher education, quite different from the traditional idea. In the last forty years,<br />\nstates the author, a new type of student has entered the American<br />\nuniversities—a student who is incapable of profiting by the old method<br />\nof book learning. Sponsored by the college fraternity„ he is obtaining<br />\nhis education through work on the student activities. A campus Babbitt, so to speak.<br />\nDr. McConn'a-discussion revolves about the old, old question of<br />\nthe relative value of student activities as opposed to academic work.<br />\nHe pictures the fraternities as pushing the student one way, while the<br />\northodox college professor is pulling him in another direction.<br />\nIt has long been our opinion that in this new world of high pre&<br />\nsure business methods and rapid fire commercial activity, the apprenticeship served on the editorial staff of a college publication, or in,<br />\nsome other campus activity, is a valuable preparation for the struggle<br />\nfor existence after graduation. But'no one can deny the cultural and<br />\naesthetic value of academic work and book learning. Again, we enter<br />\nour plea for a sensible balance of these two important phases of college life.<br />\n<br />\nfit<br />\n<br />\nEdgew, orth<br />\n<br />\nSmoking Tobacco<br />\n<br />\nsuits $47a, ms,.50<br />\n<br />\nwel<br />\n<br />\nNola<br />\n<br />\nitrxterI oweIfie i.Hub<br />\n<br />\n••••I<br />\n•••••I<br />\nOEM<br />\n<br />\nf.<br />\n<br />\nDR. J<br />\n<br />\nquaiity pencil<br />\n<br />\na<br />\n<br />\nCOI<br />\nill an<br />\nSomet<br />\n- the rot<br />\nnatura<br />\nthe pa<br />\n• Tinie,<br />\norribl<br />\npenitei<br />\nfore t<br />\nquarte<br />\n- saw I<br />\nseeing<br />\n_ decide<br />\nnot be•<br />\nhad hi<br />\nof his<br />\nshot it<br />\nthe po<br />\nOn th<br />\ns deflect<br />\n• the bu<br />\n\"killed<br />\nV ie we(<br />\nfound<br />\n\"deap(<br />\nhad 1<br />\nstain<br />\nsaved<br />\ntence<br />\nthe w(<br />\nern p<br />\nbroug'<br />\nwas e<br />\nyears,<br />\nan igi<br />\na non<br />\npersen<br />\nshop<br />\nto'.sa,<br />\nitione)<br />\nPAfter<br />\nSNO<br />\nwit11. .<br />\n<br />\nfriiiloso<br />\ndenta/<br />\n. wood,<br />\n, playe(<br />\nfused<br />\neven<br />\nmini,<br />\nably L<br />\n<br />\n.1<br />\n<br />\nthrotn<br />\nthere<br />\ngentle<br />\nWilt) 1<br />\nnity.<br />\n<br />\nTIn<br />\ncilea<br />\ning<br />\n<br />\n\\<br />\n,wit, it<br />\nv.,<br />\nvigil<br />\nyear<br />\n<br />\n- ican 1<br />\n<br />\nlast i<br />\n<br />\nwhere<br />\nphysi(<br />\nrible<br />\nder a<br />\nhere<br />\na dist<br />\na rev<br />\ncomp]<br />\nRapp()<br />\n,garde<br />\nthe m<br />\ntestifi<br />\nand t<br />\n' grout<br />\ntime<br />\ninters<br />\nlutely<br />\ncurrel<br />\nbut w<br />\ntruce<br />\nthe d<br />\nbalani<br />\na mit<br />\nto his<br />\nlater,<br />\nthe n<br />\nceive(<br />\ntor's<br />\nbring<br />\n'C<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1928<br />\nDR. JOHN R. OLIVER<br />\nADDRESSES ASSEMBLY<br />\n<br />\nCOUNT IVA TOLSTOY TO<br />\nSPEAK HERE ON THURSDAY<br />\n<br />\n3<br />\n<br />\nBLUE JAYS NOSED OUT BY COLUMBIA<br />\nELEVEN IN THRILLING GRID BATTLE<br />\n<br />\nBOOKS<br />\neMANNIE BERG<br />\nBOUGHT, SOLD<br />\nContinued front Page 1, Col. 6<br />\nand EXCHANGED<br />\nThe Old Boy Himself\"<br />\nPippen's Book Store<br />\nComes to Interpret the Philosophy scoring another touchdown in the distributed megaphones to I,ion<br />\n605 N. EUTAW ST.<br />\nthird quarter. Caplan made a beau- rooters -bearing such slogans as<br />\nTrade Mark Reg<br />\nContinued from \"age 1, Col. 31<br />\nof His Father<br />\nAbove Franklin<br />\ntifulahoe-string catch of a forward \"Roar, Lion Rooter\" and \"Beat<br />\nin an absolutely i nocent manner. • Count Ilya Tolstoy has accepted<br />\nCollek,iate Furnishink5<br />\nSomething was stolen from one of an inyitation and will speak in the pass from Lyons and, after a twen- Johns I-Opkins,\" Some day this<br />\nYELLOW CAB STANDS<br />\nty-yard run, was brought down on game may become as important as<br />\nAT<br />\nthe rooms in the boarding house and C. E. Hall on Thursday, November<br />\nNORTH AVE. MARKET<br />\nHomewood Field<br />\n,naturally this man was suspected b) 15th, at 5 P. M. Count Tolstoy the tWo-yard line. Two line smashes the Harvard-Yale struggle. ,Who<br />\nhy the Joy fullback netted one and knows?<br />\nNORTH<br />\nEt? MARYLAND AVES.<br />\n35th<br />\n6'<br />\nSt<br />\nPaul<br />\nSts.<br />\ninnocent<br />\nof the is making his American tour ow the.<br />\nthe police. He was<br />\nhalf yards, giving Hopkins its sec31st & St. Paul Sts.<br />\ni-rime, but had a terrible vision of a Mindredth anniversary of the birth a<br />\nond touchdown. The try-for-point<br />\nSafe and Efficient Service<br />\nThe Columbia players were<br />\nlorrible future period in that dread of the results of the Bolshevist revNo Charge for Extra Passenger:<br />\npenitentiary. lie was brought be- most famous writer and philosopher. missed the posts by a narrow mar- served drinking water from individgin.<br />\n'PHONE<br />\nual paper cups btit the Jays continfore the Sergeant at police head- who died in 1910. He comes to inAlthough heavily outweightd on ued to use the old fashioned water<br />\nVERNON 1 2 1 2<br />\nquarters to be questioned. The man terpret to America the phi:osopily<br />\nboth the line and in the backfield, bucket.<br />\nFOR A<br />\n• saw jail looming before him and of the elder Tolstoy and to speak<br />\nthe Jays fought a game battle and<br />\nseeing the,open door behind him, he ro the results of the Bolshevist revYELLOW<br />\nCAB<br />\n_decided to try to escape.: He had olution in Russia eleven, years a u. played heads-up football from the<br />\nThe Hopkins band, twenty-eight<br />\nPhone CAlvert 5975<br />\nopening whistle until the end of the<br />\nsearched<br />\nbeen<br />\nthoroughly<br />\nnot<br />\nand he<br />\nstrung, Marched about the field be- THE CHARLES E. MYERS CO.<br />\nPen Mightier. Than Sword<br />\ncontest. The Lions started their<br />\nhad his revolver in the -inside pocket<br />\nIncorporated<br />\ntween halves and got a big hand<br />\nLeo Tolstoy, it will be rem<br />\nManufacturer of<br />\nregular<br />\nfirst<br />\nstring<br />\nteam<br />\nagainst<br />\nthe<br />\nof his coat. ice drew it out and bered, was the one<br />\nfrom the Columbia stands. The<br />\nman who proved.<br />\n'RUBBER STAMPS<br />\nBlue Jays and kept their ranks prac- Columbia band made a good showshot into the air merely to frighten that the pen<br />\nis mightier than the<br />\nThe Service Shop<br />\n' the policemen antl affect his escape. sword. Born in 1828,<br />\nUnder the tically intact throughout the battle. ing in their dark capes. lined with<br />\n319 W. Redwood St.<br />\nOn the second shot, his arm was reign of Nicholas<br />\nblue,<br />\nand<br />\nwhite<br />\nhats.<br />\nLooked<br />\njust<br />\nI, the -most crud If Hopkins can show the same<br />\nt deflected by one of. the officers and autocrat of Russia, in a time when power and fight on Thanksgiving like movie ushers.<br />\n' the bullet struck an old turnkey and slavery and brute<br />\nforce were in Day, the Maryland eleven will have<br />\nkilled him. The •.man was inter- power, Tolstoy was<br />\nThe band, incidentally, had a hard'<br />\nhimself a mem- a busy afternoon in spite of their<br />\nviewed later by Dr. Oliver and ber,of the<br />\ntime getting to New York. Their.<br />\nmost aristocratic class.<br />\nsurprise<br />\nvictory<br />\nover<br />\nYale.<br />\nfound to be fzir different from the Ilis grandfather<br />\nE. E. ADAMS<br />\nwas a -prisoner in<br />\nbus ran out of gasoline'near Plain\"desperade that the _newspaners -the Napoleunic<br />\n—<br />\nSidelights<br />\n.war in 1814, and trafield,<br />\n.New<br />\njersey,<br />\nwhich.<br />\nis<br />\nabout<br />\nhad painted him. A-fter a hard dition has it<br />\nNew York newspaper writers inBAkW WETERIA<br />\nthat Napoleon was surfiftl, miles from. Manhattan.<br />\nstruggle if law the man's life was<br />\n4saiaed ihatuasiaArnjyjcgr sist on referring to the Jays as -the<br />\n_<br />\nsaved and. he was given a life sen- could speak<br />\n\"medicos,\"<br />\nFrench bettec-than him- \"doctor-S.,\" \"surgeons?<br />\n'<br />\nWhen things looked darkest for<br />\ntence in the penitentiary. To show self.<br />\n-and \"medical men.\" Something<br />\nColumbia, the Lions' band struck up<br />\nthe wonderful strides that the modWas Individualist<br />\ndrastic should be done about this.<br />\nern prison has taken, Dr. Oliver<br />\n\"Old Man Sunshine\" and the sky<br />\nLeo Tolstoy attended -the Russian<br />\nbrought out that this man actually Universities, and on one of his rejust _continued to get cloudier and<br />\nSign outside of Baker Field anWas educated during the past ten ports was the annotation \"Tolstoy<br />\ncloudier.<br />\nyears, and has been changed from ms e.specially weak in the Russian nounces \"Football Today, Columbia<br />\nan ignorant, useless human unit to language and in Russian literature.\" Vs. John Hopkins.\" When will the<br />\nA page of cartoons in the official<br />\na normally intelligent, quite useful At,•,?1 Tolstoy joined the•Army and world learn the difference between<br />\nprogram afforded much amusement<br />\nperson. He is-now head of the shoe became an officer. At that time he<br />\n\"John\" and \"Johns\"?<br />\nto Hopkins rooters. The Hopkins<br />\nshop at the jail and. has managed- had his own estate and several thouAlumni are pictured as hanging on<br />\nto save a considerable amount of sand peasant families. Tolstoy was<br />\nThe• Jays stayed •at the Commo- an ambulance as they inquire the dimoney, obtained from extra work. addicted to playing Cards and drink*After five years he had accumulated ing. An awakening conscience Soon dore Hotel during their New York rection of Baker Field.<br />\n$.<br />\nand calling for an ,,interview revealed itself in his writings. liar visit. This is one of the largest and<br />\n• wikt1101iv .1-.:, Ii requested that anti Peace, Amid K.urenina, Kreutz- most palatial of the Manhattan hosColumbia has two more hard bat.iill•el ' . I . I_ thlr money to the_ er Sonata, #esurrectii:in followed<br />\ntles before the end of the season.<br />\ntelries.'<br />\n'fwitle ---0 the man he • had acci- each other in rapid succession;and<br />\nClothiers and Haberdashers<br />\nhis week -they meet Pen<br />\nTnsylvania<br />\nFORDS*0•4 GEAR SHIFT CANS<br />\ndentally shot. This was indeed a sent his name and fame throughout<br />\nColumbia<br />\nseemed<br />\nho<br />\nbe.considFTat<br />\nFranklin<br />\nField<br />\nand<br />\non<br />\nThanksIt E. North Avenue<br />\n\"<br />\nT<br />\nI<br />\n. wonderful trait of character (Its- the world. Czar Alexander the 11,<br />\nVernon 2704<br />\nplayed, and although the widow re- When asked why he did not stop ably xorked up over the contest. A giving Day they will play Syracuse<br />\n17 E. Baltimore St.<br />\nfused the money, it is believed that 'folstoy's-startling revelations of po- haberdashery shop, near the cumpus, at New Vork.<br />\na<br />\n(Nett slu: respected the offer. This litical • life said, \"Tolstoy is more<br />\nman, it ‘N as brought out, will prob- powerful than I,\" and he- was left<br />\nably be sct free in a ftw more years to write. Famous guests came from<br />\nI hrough the goverias pardoul.and all over the world to visit Tolstoy.<br />\nJUST RELEASED FROM HOLLYWOOD...<br />\nthere will 'emerge then a perfect Esom America came_ William Jengentleman, and . a mined laborer nings .Bryan, while Thomas A. Edwho will be a credit to the commit ison scnt an engineer to make phonnitY.<br />\nograph records of his voice: Henry<br />\nGeorge, Jr., came to discuss the<br />\nPhysician Affected<br />\nThe second case WaS -that .1 a single tax question. Tolstoy's-views<br />\ncolleague of 1)r. ()liver while study- on the-church and on war became<br />\ning in' a mental -research • hospital. the chief topic of discussion for<br />\nDIRECTOR<br />\nThe victim as we may well call flint, 'many days. 'lie preached Christ's<br />\n.was it specialist in this field,- -.a pro- Doctrine of passive resistence and<br />\nfess.r in ps,chiatrics in a large f,w- said wars would stop if people<br />\n•• eign university, sent here for MIC won1(1 stop killing each other. Ile<br />\n* STAR *<br />\nyear of research work in the<br />\nndiVidttalist. At least 'Cola-va. au<br />\n.ican hospitals. 1 le'was a very bril- st,)y had found did God he had been<br />\nliant man, but unfortunately be dc:. seeking in the livcs of the humble<br />\nveloped a peculiar ,ort 1 insanitv_ peasants, tfittrllers• l[tlaY toil. 'He<br />\nwhereby lie believed that a certain did not want to profit from his<br />\nTHE CAST<br />\nphysician in the hoSpital tIltS It ter- writings and took no copyrights.<br />\n. .<br />\nrible enemy of his becapse of slanShort Story Writer<br />\n.SecApti Cigtilette<br />\n. • . OLD GOLD:<br />\nder and other practices. We have<br />\nCount Ilya Tolstoy, the son, has<br />\nThird Cigarette<br />\n. ..... . 17-`'<br />\nhere a man of super-intelligence,. of written many short stories of RusFourth<br />\nCigarette<br />\na distinctive reputation. He bought sian life which have-had a wide cira revolver and after putting in a culation and are at- present entirely<br />\n\"Making a blindfold test is like conducting a movie<br />\ncomplaint to the police about this out of print. Ice has, iti addifion<br />\ntryout. But in this competition I fc•und my star<br />\nsupposed enemy, which was disre2 to the abilities inherited from his<br />\n'right off the reel.' I named OLD GOLD for the lead<br />\n,garded through an oversight, he shot great father, it natural ability as a<br />\npart the moment I tasted its ihrilling flavor and<br />\nthe man.and killed him. Dr. Oliver speaker and has turned this to actestified in this case for the accused count in giving his ideas verbally<br />\n.its soothing gentleness to the tongue and throat.\"<br />\nand tried to save his life on the to audiences. On his last American<br />\ngrounds that he was insane at the tour in 1924 he was greeted as he<br />\ntime of the murder. The man Was himsaf puts it \"by large crowds<br />\ninterviewed in jail and was abso- from Portland to Portland.\" His<br />\nlutely ignorant of all that had oc- coming to Johns Hopkins should<br />\ncurred. He was finally almost hung, prove onc of the,most interesting<br />\nbut was saved and given a life sen- events of the season.<br />\ntence in the penitentiary. In jail<br />\nBARTHELMASS was •skcd to smoke. each of the lour leading brands,<br />\nclearing his<br />\n151 .15 et,ffec rit;earnitmokesiOnly ouc<br />\n\"(1 II,true<br />\ny.like best?\"<br />\n•<br />\nthe doctor's mind became more un- glue Jay To Be<br />\nbalanced and finally he was sent tc<br />\nIssued On Friday<br />\na mind institution and thence back<br />\nE. Bennet Kold, editor-in-chief of'<br />\nto his own country. A short time<br />\nlater, 13t. Oliver who .had -helped the Black and Blue Jay, announced<br />\nIhree types of leaves grow on the to- . . . and the heart-leaves. rich<br />\nr. Lorinoli Co.. kiir.<br />\nin cool<br />\nRICHARD BARTH ELM ESS..„endeared<br />\nbacco plant . . . coarse top-leaves,<br />\nto ruovie,goers the world over for hi• superb<br />\nand fragrant smoking qualities<br />\nthe man throughout the affair, re- that the first issue would be placed<br />\nMade from the heart-leaves of the<br />\nacting in such First National pictures •s,<br />\nirritating to the throat . . . withered<br />\nOnly<br />\nthe<br />\nheert-leevee<br />\npostoffice<br />\nare<br />\nitoxes<br />\nFriday<br />\nused<br />\nmornin<br />\nthe<br />\nis<br />\n*.The Patent Leather Kid,\"<br />\nceived a beautiful gift from the docNoise\"<br />\ntobacco plait<br />\nground-leave;without taste or aroma<br />\nOLD GOLDS.<br />\nand \"Out of thc Rums.\"<br />\ntor's foreign colleagues. This_story ing. The Blue Jay will be on sale<br />\nbrings out the necessity for imme- at the St. John's game Saturday afternoon.<br />\nCoittinued on Page 5, Col. 3<br />\nNoted Criminologist Discusses<br />\nSeveral Cases<br />\n<br />\nent a<br />\nnew DERS%<br />\n)0P'SAUN<br />\n<br />\ntr,<br />\n<br />\nDrive It Yourself<br />\n<br />\nYou'll never<br />\nhave to takeaback seat in<br />\na Braeburn<br />\nProm Tux.<br />\n$4°<br />\n<br />\nE IU<br />\n<br />\nThe<br />\n<br />\nBlindfold Cigarette Test<br />\n<br />\nDick Barthelmess<br />\n<br />\nL,D GOLD<br />\n•<br />\n<br />\nWhy you can pick them<br />\n<br />\nSMOOTHER AND BETTER—\"NOT A COUGH IN A CARLOA<br />\nD\"<br />\n<br />\n\f1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13,_<br />\n<br />\n4<br />\n<br />\nHOPKINS IS HOST<br />\nTO DOZEN COLLEGES<br />\n<br />\nINTER COLLEGIATE<br />\nNEWS<br />\n<br />\nHULL1BALOO BECOME HUMOROUS<br />\nPicture Schedule of<br />\nCAMPUS<br />\nBUT NOT aV HOME WOOD<br />\n-Hullabaloo Changed<br />\nevery four<br />\n<br />\nPI<br />\n<br />\nHAVE YOU<br />\none issue for<br />\nSomething 11 w_un4er the sun. erage of.<br />\nFollowing are the changes which<br />\nopiteatiatif some- years.<br />\nrathet,<br />\nOr,<br />\nhave been made in the Hullabaloo<br />\nYears ago, the editors of the<br />\nthing so old' ftat th renewal<br />\nEddy Conference Brings Over a<br />\nto<br />\nA compromise has been affected ...I ture schedule:<br />\nlopkins Hullahatoo' stalled •<br />\ncampu,<br />\nSIGNED<br />\nthe<br />\nwords<br />\nHundred Visiting Students<br />\nnew. In other<br />\nbetween the student body of Cornell<br />\ncopyright all of the publications<br />\nTUESDAY<br />\nUniversity 'and, the local theatre<br />\nworld has awaken,.<br />\ncontinpublication<br />\nbeen<br />\nhas<br />\nand this practice<br />\nDR. FRENCH SPEAKS<br />\nHOMEWOOD<br />\nManagement whereby, upon the<br />\nto the fact that we at Hopkins ued throughout the yearly issues:<br />\n,to deport 4.30—Football Team.<br />\nRemsen Hall Is Sce..e of Talks on agree:zit:at of the fortnc<br />\nare not the -only anes that p-rtb• What effect this copyright<br />\n4.45--Cross Country Team.<br />\nthemselves quietly dit week days,<br />\nreWorld and Domestic Issues<br />\na fiAtotoo. \\\\ lien. this have on the new \"Hullabaloo\"<br />\nlish<br />\nWEDNESDAY<br />\nthe management has ainsented Cr<br />\neditors<br />\nthe<br />\nbut<br />\nseen,<br />\nbe<br />\nis<br />\nto<br />\nit<br />\nmains<br />\n'function<br />\nS. E. HALL<br />\nnew paper began to<br />\nTwelve universities, colleges. and countenance all forms of disapproon this campus<br />\nnormal schools sent over, one hun- bation (the well-known razzberry) 4.10—Electrical Club.<br />\nnot possible to say at_this time. Of the year book<br />\nthe name<br />\nthat<br />\ndetermined<br />\nis<br />\ndred students to the Sherwood Eddy or even applause at the second show 420—A. S. C. E.<br />\nclaim<br />\nthe<br />\nare<br />\npage<br />\nOn the editorial<br />\nConference which was held at fohns every Saturday. We can scarcely<br />\nbe synonyMade that the paper was estab- \"Hullabaloo\" shall<br />\nTHURSDAY<br />\nHopkins from Friday to Sunday of term this a gentleman's agreement,<br />\nstately year<br />\nlished in 1894, yet side 'by side mous witliak good,<br />\nS. E. HALL<br />\nlast week. Four universities, John's however.<br />\n'<br />\nof<br />\ngenerations<br />\nof<br />\nyells<br />\nI2.25—Barnstormers.<br />\nwith this statement is the nor book, and<br />\n*<br />\nHopkins, Maryland, George Washon athletic<br />\nstudents<br />\nCouncil.<br />\nActivities<br />\nissue<br />\n12.30—Student<br />\nthe<br />\nHopkins<br />\nand<br />\n2<br />\nvolume<br />\nrePtewere<br />\nthe<br />\nDelaware,<br />\nof<br />\nber<br />\nington and<br />\nExperiments on- the consumption<br />\nconnected with<br />\nsented. Six colleges including Gou- of energy, by human beings are be- 12.35—Debating Council.<br />\n1. *It would seem that the stti- fields, and not be<br />\npublication,<br />\nMaryland,<br />\ncher, Hood, Western<br />\ning carried on by a certain profes- 12.50—Y. M. C. A. Council.<br />\ndepts of Franklin and Marshall. a semi-humorous<br />\nPLEDGE?<br />\nPennsylvania,<br />\nWashington College, Maryland Col- sor of University College, England.<br />\nof<br />\npaper.<br />\nwilds<br />\nthis<br />\nthe<br />\nhad<br />\npublish<br />\nfront<br />\nSeveral fraternities have<br />\nCollege, who<br />\nlege for Women and 'Morgan sent Among other *resting conclu- their designated time changed, to<br />\napof<br />\nreputation<br />\nthe courage—oi which has the<br />\nonly<br />\ndelegates. Students,from two nor- sions.developed, he has ascertained Wednesday night; but the exact have<br />\nnine pearing- very intermittently, at<br />\nmal school -Frostburg .and Mary- that an athlete in running the 100 time has not been definitely decided funds—to publish not over<br />\nissues in thirty-four years, an av, least !nice in every four' years.<br />\nland' State Normal, also attended. yarddasli in less than eleven sec, on.<br />\nThe Johns Hopkins delegation con- onds expend:5 an.antount of energy<br />\nsisted of a dozen men headed by W. equal fO !fiat 'which would be reFIDELITY - AND DEPOSIT CO..<br />\nPurnell Hall, Jr., president of. the quired :for a leapfal 650 feel into<br />\n-.<br />\n:<br />\nFETTING-__<br />\nH.<br />\neA.<br />\nwere<br />\nchairmen<br />\n\"Y.\" The conference<br />\nthe air—one hundi.ed-feet higher<br />\nof Maryland<br />\nMiss Gladys Wakk of Hood and than the famous Washington -MoncMANUFACTURING JEWELRY CO.<br />\nEdward Lockard ofjohns Hopkins. ument in the Capital City.<br />\nFidelity and Surety Bonds<br />\n* * *<br />\nThe conference sessions were held<br />\nBurglary -r and Plate Glass Insurance<br />\nManufacturers<br />\nin Remsen Hall. On Friday evening, Oregon State College has a footthe delegates were welcomed on be- ball novelty on hand thiS season it<br />\nBALTIMORE BRANCH OFFICE<br />\nGreek Letter Fraternity Jewelry<br />\nhalf of the University by Dr. John the pers'on of a barefooted kicker<br />\nGROUND FLOOR, FIDELITY BLDG.<br />\nC. French, Librarian.<br />\n(not related to the-barefoot boy).<br />\nPhone PLaza 0800<br />\nCHARLES STREET<br />\nD. C. HANDY, Manager<br />\nNORTH<br />\n314<br />\nHe is a half back who learned his<br />\nKellog Pact Is Praised<br />\nThe outlook for peace is distinct- football in Hawaii, where he became<br />\nly greater for that great pact,\" said xtremely proficient in the art of,<br />\nDr. Eddy at the opening session spiraling a punt down the field, tinwhen referring to the Kellogg- der the efficient propulsion of hi<br />\nBriand Treaty. Along with the bare foot. Indeed, this prodigy<br />\nLeague of Nations and the Locarno says he cannot secure satisfactory<br />\ntreaties he classed it as one of the results with his feet shod in the<br />\ngreat milestones of peace since the conventional regulation shoe. The<br />\n,war and declared that European coach is searching' now for a pair<br />\n('.5. Ill 14.2..,,IDES<br />\nstatesmen were impressed with it of shoes which this phenomenon<br />\n1.1,<br />\nV. D. LANDON<br />\n.Trun3 muter,<br />\nRadio<br />\ndespite its, reservations and -limita- may slip off.and on quiokly at will.<br />\nSouth htkota<br />\nDotroUt Junior<br />\n1.4 Mules,'24<br />\nollege, '22<br />\ntions. The significance of this treaty for the Oregon State mentor does<br />\nis threefold, it brings America back not want to risk his half back's un;<br />\ninto the international arena; it will shod feet in a scrimmage And inforce us to take dip logical \"neat tends that he should wear the boots<br />\nFront of the weeingh.mse radio cull,<br />\nsteps\"; and it takes secret,diplomacy when not kicking.<br />\n*<br />\n*<br />\n*<br />\nt3<br />\nit<br />\ngives<br />\nfrom the diplomats and<br />\nAn odd traditional combat', termthe people.<br />\nAN. I;errs<br />\ned the cane spree, which is practiMuuolini a War Menace<br />\nDesign of<br />\nTransmitters<br />\nIn the realm of world economics cally the only survival of freshmanniveruI,Y of<br />\nurgh,'27<br />\nis<br />\nPrinceton,<br />\nat<br />\nrivalry<br />\nsophomore<br />\nrich,the<br />\ntoday<br />\nStates,<br />\nUnited<br />\nthe<br />\nest nation on earth and chief gainer yet maintained at That institution<br />\nby the gar, should help the weaker The contest, is taken seriously and<br />\n.nations rather than present insistent three-man teams:are tutored by up,<br />\nweeks in.<br />\ndemands for payment of war debts. per classmen for severid<br />\npreparation.. All of the bouts are<br />\n\"although<br />\nDr. Eddy predicted that,<br />\nnine minutes in :length unless one<br />\nthe Dawes plan saved Germany and of the contestants succeeds in<br />\n0. B. G1JN RV<br />\nbreak<br />\nwill<br />\nit<br />\nEurope,<br />\nstabilized<br />\nwrenching the stick or \"cane\" front<br />\nPhoto5Z::::7iirision<br />\n,Dy,intion,'27<br />\ndown next year because Germany his opponent before that-time. If<br />\nwill not or will not be able to meet the \"cline\" is still in possession of<br />\nboth, however, at the., expiration of<br />\npayment. There- is not the will_Lo<br />\nthe nine minutes,.there is a short<br />\npay in France and Germany or on<br />\nrest period after Which the two rethe rest of the Continent bf Europe. engage until one or thc other wins<br />\nThey do ni3t believe that it is a just, out.<br />\n_<br />\n*<br />\n•<br />\n_<br />\nmoral obligation.\"..<br />\nJOHN COLEMAN<br />\n\"One of the primary purposes of<br />\nThe outlook for democracy in<br />\nRadio Endineer<br />\nH. I. IQ 1 If<br />\na college course,\" says Dean HewC.:anegic luititute,<br />\nON RECENT WESTINGHOUSE JOBS<br />\n1.,:rioprnent Engo neer<br />\noi echnolugy. '23<br />\n.Europe is very dark at. present:<br />\nfuvernity<br />\nitt of Williamette University, \"is<br />\nl'aohorgh. -26<br />\nOver half of that Continent is- now the finding 'Of a mate. People are<br />\nunder. dictatorships, of which Italy. irklined,to laugh at.a girl who goes<br />\nand Russia are the outstanding ex- to college only to find a beau, but<br />\namples. In the former Mussolini she is rather to be admired for her<br />\nis worse than Napoleon ; a greater purpose.\" (Which is rather a radand ical stand for any college dean.)<br />\nwar menace than Wilhelni'.<br />\nthe chief danger to the peace of Anyho‘V these remarks were utterOn the U. S. Navy Airplane signed, built, and , installed<br />\nWhere do young college men get in a large<br />\nEurope to-day. \"Mussolini has ed during a discussion of the quesindustrial. 4rganizaticn? Have they<br />\nCarriers \"Lexington” and \"Sara- Westinghouse<br />\nthe or,.zanizadone much for Italy but at the cost tion \"Why GO to College?\" at a<br />\nopportunity to exercise creative talent?<br />\ntoga\" the situation is met with tion which in i 920 established<br />\nof the liberties of 42,000,000 two- student meeting .of Williamette.<br />\n•<br />\nIs individual work recognized?<br />\ncrystal control transmitters de- KDKA, the pioneer radio broad* * *<br />\nple.\" In Russia the denial of libsigned to send on different wave, casting station of the world, and<br />\nA number of interesting facts<br />\nerty, atheism, and reliance on force<br />\ncarriers area re- lengths. Each plane's receiving Which also operatesstations KF K<br />\nare-the objectionable factors. To be concerning American 'colleges and<br />\nX,<br />\ncommended, there is the passion of universities are revealed in the recent development in naval set has its own wave length. A<br />\nKYW, WHZ, and W FIZA.<br />\nCommunism for sharing and the cent -Educational Directory putihistory—and they . haye a com- turn of the dial on the transmitI<br />\nf<br />\nlislied by the Bureau of Education.<br />\nlack of race prejudice.<br />\nmunication problem that calls for ter selects the wave length cor- Opportunities to do the historyColumbia is recognized as the<br />\nStudents Are Docile Minded<br />\nthe engineering resources of an responding to that of the plane making things in engineering fall<br />\nAs to American schools and col- largest university in the country,<br />\nnaturally to an organization with a<br />\norganization which has shown it to be reached with ajnessage'<br />\n'leges, Dr. Eddy said, \"I would class with 35,000 students and 1,500<br />\nrecord for making history in its field.<br />\n_an make radio history.<br />\nthis country as rifmincing the most teachers. Buena Vita College is<br />\nRadio equipinent on the \"Lex- And<br />\nWestinghouse,quite as naturally,<br />\ndocile minds in the world.\" In our the smallest with 21 students and<br />\nComplex maneuvers are di- ington\" and \"Saratoga\" was de- offers powc+,-.1<br />\natt,atioos to -!.thi-ise<br />\ninter-racial relatkons we are suffer- 16 faculty members. Howard is the<br />\ncc:mei, scouting ex---------/young college men<br />\ning more Iront race prejudice than oldest university, having been<br />\n„clitions controlled,<br />\nw nose initiative and<br />\nany other country in the world.\" -founded in 1636. William and<br />\nand far-tlyingaplanes<br />\nenterprise<br />\nfit them for<br />\nIn regard..to our great social prob- Mary College and Yale rank second<br />\nrecalled—by radio.<br />\nhistory-making tasks„<br />\nlem of unemployment, \"We don't and third in this respect, having<br />\nknow how many are unemployed be- been established in,1693 and<br />\n1701,<br />\ncause we don't care.\"<br />\nrespectively.<br />\n<br />\nCACF.<br />\n<br />\n(Bir<br />\nST.<br />\nYour 7<br />\n<br />\nSchool<br />\nUnex<br />\nMall<br />\n<br />\nG NN,<br />\nOrch<br />\n<br />\n19,<br />\n<br />\nTI-<br />\n<br />\nNewspa<br />\nBooks<br />\n<br />\nTh<br />\nPri<br />\n<br />\n150(<br />\n<br />\nCol<br />\n<br />\nIn sty<br />\nequal th<br />\nproduced<br />\n<br />\nAnd t<br />\n<br />\nYOUNGER COLLEGE MEN<br />\n<br />\nRadio Directs the Navy's Flyers > ><br />\n<br />\n11<br />\n<br />\nNEN<br />\n<br />\n•<br />\n<br />\nAIRPLAN<br />\n<br />\nestinghouse<br />\n<br />\nSuits<br />\n<br />\n$2<br />\n<br />\nWe<br />\nasso<br />\nin sl<br />\nvisi<br />\nherr<br />\n<br />\nDc<br />\n<br />\nCandi<br />\n<br />\nTA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1928<br />\n\"NEVER GO BACK\"<br />\n<br />\nPhone HOmewood 7908<br />\ns<br />\n'<br />\nCBirely<br />\n<br />\nPharmacy'<br />\n<br />\nST. PAUL at 33rd STREET<br />\n<br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br />\n_<br />\n<br />\nCOMMUNITY IN14<br />\n<br />\nPresident Dukehart of the,<br />\nClass of '32, announced today that there would be a<br />\nmeeting of. his class in the<br />\nC. E. Hall on Thursday following the Assembly. Donald Hiss, president of the<br />\nfudent Louncil,. will address the class at the gathering.. There will be no excuses accepted for absence.<br />\n<br />\nGWYNN LEASE<br />\n<br />\nOrchestras of Distinction<br />\n<br />\nGEORGE BOAS<br />\n<br />\nFRESHMEN CLASS TO<br />\nMEET ON THURSDAY<br />\n<br />\nSPEAKING<br />\n<br />\nOn the wall of a room in the<br />\nMemorial Hall there hangs a poem<br />\nby Margaret Johnston Graftlin<br />\nwhich the editor of this column believes is worth your attention.<br />\n<br />\nThe first novel of our own Dr.<br />\nBoas is not, we regret to predict,<br />\ndestined to be the long awaitea<br />\nepic of American college faculty<br />\nlife. For that it is too sketchy,<br />\nits length insufficient, its characters too few, the attention given<br />\nto yctra-collegiate _events_ too<br />\ngreat.<br />\nBut it is—and this 'may be<br />\nmore important—very delightful<br />\nreading-for'Ode who has had experience with college faculties,<br />\nand who is therefore anxious to<br />\nlook behind the scenes of their<br />\nacademic existence. This view<br />\nthe author, with quite shameless<br />\ncandor and quite biting sarcasm,<br />\nproceeds to give.<br />\nFrancis Harper, who is the author himself without doubt, is ,<br />\ncalled to Oralia University, in<br />\nCalifornia, as an instructor in<br />\nEnglish. 4'here, as a witty but<br />\nnot brilliant man of ready sallies<br />\nand few ideas, Harper is well received by his,fellow instructors,<br />\ninvited to their teas, their musicales, and their bickerings, all of<br />\nwhich are, of course, very informal.<br />\nWith his characters in these<br />\neasy attitudes, Dr. Boas begins<br />\nwith masterful strokes of satire<br />\nand really good bits of dialogue<br />\nto expose their souls. Here the<br />\nauthor reaches his greatest<br />\nheights, for character portrayal,<br />\nas those who have taken his<br />\ncourses here know, is his true<br />\nforte, as the satirical is his most<br />\nfluent farm of discourse. Calmly,<br />\nrelentlessly as a surgeon, the author dissects Harper and his<br />\nfriends, shows the. reader what<br />\nmanner of men'they afF,-changes<br />\nsome, sekvs -them tip again, and<br />\nsets them to work as they will.<br />\n<br />\nfr'unn-BMI<br />\nanide-gashionedatfords<br />\nTagselfassuranc,e and confidence that<br />\ncorrect clothes and correct foot gear<br />\ngive are as vital for success in college<br />\nas in the business world. Nunn-Bush<br />\nAnkle-Fashioned Oxfords are built<br />\nthe ankle as well as thefoot-no gapping, no slipping at the heel.<br />\nT<br />\n<br />\nC<br />\n<br />\n,<br />\n<br />\nUIrYaffor<br />\n<br />\nCollar Hug Clothes<br />\nBoit/more on, v.5enysfreea<br />\n<br />\nThis is what it says:<br />\n1156<br />\nThe Whitehall<br />\nimponed Black<br />\nTO MY SON<br />\nScotch Grab*.<br />\nDo you know that your soul<br />\nPhone Gamor 6886<br />\nIs of my soul such part<br />\n-79kat you seem to be fibre<br />\nF.<br />\nAfid core of my heart?'<br />\nSOUTHERN<br />\nTHE<br />\nlane other can. pain me<br />\nAs you, dear, can do;<br />\nHOTEL<br />\nBaltimore's Newest<br />\nNone other can please one<br />\nand Finest :-:<br />\nOr praise one as you.<br />\n\"A Hotel of Atmosphere<br />\n'The fact that there will be no<br />\n6<br />\nRemember the world<br />\nand, environment\"<br />\nArmy-Navy football game this year<br />\njgjllr be. quick' with its blame<br />\nis lamented by many football fans in<br />\nIf shadozb or stain<br />\nview of the excellent showing Navy<br />\nCommercial<br />\nNewspapers<br />\nEver darken your name.<br />\nWork<br />\nBooks<br />\nhas made in its recent games. How\"Like mother, like son,\"<br />\nEstablished 1880<br />\never, elegibility rules present a great<br />\nIs a saying sp true,<br />\nproblem to all colleges at this time.<br />\nThe world will judge largely<br />\nThomas Fe Evans<br />\nthree year rule at Hopkins, in<br />\nOf mother by you.<br />\nPrinting Company • view of.the new plan, would bring<br />\nBe yours then the task,<br />\nathletics to a quick end. However,<br />\n1506-15J8 Guiltord Avenue<br />\nIf task it shall be,<br />\nat larger colleges, it is maintained<br />\nTo force the proud world<br />\nBaltimore, Md.<br />\nthat this is the only fair system.<br />\nTo do lutinage to me.<br />\nThere is truth in this belief, but<br />\nPhone VErnon 1691<br />\nBe sure it will say,<br />\nwould these colleges rather have no<br />\nWhen its verdict you've won,<br />\ncontests With less fortunate insti\"She reaped as she sowed,<br />\nto<br />\ntutiOns, or will they be willing<br />\nFlat Tire<br />\n\"Lo, this is her son.\"<br />\nmake certain concessions.<br />\nCall Barry<br />\nSentimental, of course; poetry,<br />\nVernon 4183<br />\nbut in those .anapestic<br />\nThis problem will . be discussed scarcely;<br />\ncouplets (they are written as'quatHOOD TIRES<br />\nagain before the St. Jcihn:s game.<br />\nrains here to fit the width of the<br />\n\"We -•Hurry\"<br />\nThe question this time is the transcolumn) . there is. contained , much<br />\nfer rule._ Thompson _anct._Smith,<br />\nthat is basic-in family existence as<br />\n-two of the stars of the 'Annapolis<br />\nwe know it.<br />\nteam,' are transfers. ThompSon,<br />\nTheir work if interrupted by<br />\n' It is important, sometimes, in the<br />\ncoming front Swarthmore, is A•<br />\ndetached existence on Dorm resi- the war, in which Harper serves<br />\nviodsly not eligible, according to the<br />\nERE'S a good busi- much neater and more<br />\nof in France as a lieutenant. Overreminder<br />\na<br />\nsuch<br />\nhave<br />\nto<br />\ndents<br />\nrule which states, \"No man shall be<br />\nness proposition! Invest business-like they look<br />\nthe ties of family. It may keep a seas, of course, his character<br />\neligible during his first year of resin<br />\na Remington Portable when typewritten!<br />\nOrback<br />\nto<br />\nname.<br />\ngoes<br />\nchanges, but he<br />\nshadow from the family<br />\nidence after transferring from a deand reap dividends in the Examine the Remington<br />\nbelieving he can resume the<br />\nha<br />\nthings<br />\ntangible<br />\nmore<br />\nto<br />\nTurning<br />\nlowever,<br />\nI<br />\ngree conferring college.\"<br />\nform of bigger and better Portable. It is the smallest,<br />\nold life where he had left off. But<br />\nNavy does not 'confer any degree,' and more immediate needs, we -find<br />\nrest at night.<br />\nlightest, most compact and<br />\nhis friends,<br />\nnaturally<br />\nfor<br />\ncan't,<br />\nhe<br />\nrea<br />\nin<br />\npropounded<br />\nquestion<br />\nthis<br />\n'therefore Smith is eligible. This exMuch faster than writing most dependable portable<br />\ncannot<br />\nThey<br />\nchanged.<br />\nhave<br />\ntoo,<br />\n\"is<br />\nit<br />\nasked,<br />\nis<br />\n\"Why,\"<br />\n-letter.<br />\ncent<br />\nample shows excellently the injusby hand, this little Rem- with standard keyboard.<br />\nit that there were-grapefruit,. or appreciate the new standards Of<br />\ntices incurred by such rules.<br />\nenables you to fin- (Carrying case only 4<br />\nington<br />\ncannot<br />\nhe<br />\nlieutenant,<br />\nformer<br />\nthe<br />\ngradand<br />\nfaculty<br />\nthe<br />\non<br />\ngrapefruits,<br />\nlong reports or inches high. Weighs 8%<br />\nyour<br />\nish<br />\nworshiped<br />\nonce<br />\nhe<br />\nthat<br />\nbelieve<br />\nsuggestbeen<br />\nmorning<br />\nhave<br />\none<br />\nmethods<br />\ntables<br />\nMany<br />\nuate students'<br />\nfall asleep try- pounds, net.)<br />\ntheses—not<br />\ndisthis<br />\non<br />\nand<br />\ngods,<br />\ntribal<br />\nStadium<br />\ntheir<br />\nMunicipal<br />\nwhile the other taxpayep had to becd for filling the<br />\nfinish<br />\nthem. Not Monthly payments.<br />\nto<br />\ning<br />\nends.<br />\ntale<br />\ngames.<br />\nthe<br />\nnote<br />\ngin the day under the tremendous cordant<br />\nfor all the large football<br />\nLeader—in Sales<br />\nonly that, but think how The Recognized<br />\nIn style and quality \"Bostonians\" 'rho policy of letting sc oo i<br />\n-handicap of prunes?\"<br />\nand Popularity.<br />\nAs a work of characterization,<br />\nequal the most, expensive footwear in free to fill the empty seats is one<br />\nIf we were good enough to an- \"Never Go Back\" is in places unproduced today.<br />\nof the latest. This is a noble idea, swer this one, we wouldn't, because usually good, although the author<br />\nchil- then we would • have been entitled is somewhat less satisfactory in<br />\nAnd the saving is a big item. but just how much would these<br />\ndren get out of a football game to a seat at the graduates' table.<br />\nhis very difficult work of describWould it not be wiser to graduate DR. OLIVER AT ASSEMBLY ing himself. It is not for us to<br />\nMostly $7.50 to $10<br />\nthe prices of the tickets from two<br />\nContinued from Page 3, Col. 1<br />\ncomment upon its accuracy, but<br />\ndollars down to fifty cents? .V diate action in case of any suspicion as an anatomical treatise certainExclusively in Baltimore<br />\ndl<br />\nthree<br />\nor<br />\nOliver<br />\ntwo<br />\nDr.<br />\npayof Mental unbalance.<br />\n'those who now<br />\nly it is stimulating.<br />\nREMINGTON RAND<br />\nlar; for sets vould be present as1 mentioned that _six murders right<br />\nstudent<br />\nBUSINESS<br />\nman,<br />\nSERVICE, INC.,<br />\ncollege,<br />\nFor<br />\nthe<br />\nable<br />\nhere in Baltimore might have. been<br />\nwell as those interested-hut not<br />\n130 W. Fayette Street<br />\nor instructor, who does not mind<br />\nto pay -ttg prise, It woulk1. make' avoided if the families of the murMD.<br />\nBALTIMORE,<br />\nbeing laughed at, or stormed at,<br />\na far more colorful spectacle if all derers had reported signs of insaii:<br />\nto<br />\nnot<br />\nbook<br />\na<br />\nis<br />\nit<br />\nlampooned,<br />\nor<br />\n112 E. Baltimore Street<br />\nand had the men examined.<br />\nthe seats. were filled. At present,<br />\nbe missed.<br />\nthey are. all going to waste. This - The third case was the most disexperiment might be tried at least. agreeable, for the man was hung.<br />\nDr. Oliver feels that his life could<br />\nThere seems to be a great lack have been saved, but his case was<br />\nnumbe:<br />\nGRAYS<br />\nlarge<br />\nNEWLOXFORD<br />\nof college spirit in a<br />\ntoo radical. He was a person whom<br />\nof Hopkins students. The _sam- one would describe as being \"hardsupports and plays on boiled.\" According to Dr. Oliver<br />\nSuits Topcoats Overcoats small group<br />\nall the teams. Many others are not he was actually only \"half cooked/'<br />\nr Drink<br />\ninterested enough to help the Cage He was brought to Dr. Oliver's at$28.75 - $38.75<br />\nFund -with any contribution what- tention first after stealing an auto<br />\n1<br />\nsoever. This fund will aid all the in Baltimore at the age of eighteen.<br />\nWe just :received a new<br />\nmen on the Campus, not only He refused to converse but acted<br />\nDelicious and Refreshin<br />\nIn<br />\nassortment of Oxford Grays<br />\nthose athletically inclined.<br />\nthe \"wise guy.\" He was given two<br />\nathstar<br />\nfor<br />\nnot<br />\nis<br />\nreally<br />\nfact, it<br />\nin shadow striped, slightly<br />\nyears, \\freed and then after stealing<br />\nletes. It is to be used by all, prin- another car was sentenced to ten<br />\nvisible overplaids and'<br />\nparticipate<br />\nnot<br />\ncipally those who do<br />\nyears. He was still the \"know it<br />\nherringbone effects.<br />\n\"Ever precise in<br />\nin athletics but need some kind of all\" and refused to listen to any<br />\nphysical exercise. But again, it is \"nut\" doctors as he termed them.<br />\npromise keeping\"<br />\nDo not fail to see them<br />\nthe same group who support the He tried to escape from jail later,<br />\nThe point of Lucius remark is<br />\ncaution Money vouchers uceRi;d<br />\nCage Fund. Something is wrong killed a guard and was sentenced to<br />\nnot what hc said it about, but<br />\nwhat he said. It surely describes<br />\nwith the student body!<br />\nbe hung. He refused right up to<br />\n..41risr•<br />\nCoca-Cola, for consider these<br />\nNext Saturday St. John's will the end to even concede a pleasant<br />\nfacts:<br />\nbring the best team it has enjoyed word to Dr. Oliver, who continued<br />\nWILLARD<br />\nPure as Sunlight<br />\nin years to Homewood to try to to interview him. It is this type, it<br />\nAnd the proof of its purity is in<br />\nCORP.<br />\nTAILORING<br />\ndiscourages<br />\nthat<br />\nout,<br />\nbrought<br />\nwas<br />\nThe<br />\n1916.<br />\nsince<br />\nvictory<br />\nfirst<br />\ngain its<br />\nthe testing. Twenty-two scientific<br />\nFAYFTTF Si. AT HANOVIR<br />\ntests, catering every step in its<br />\n,ild rivalry with St. John's has fall- criminologists. This is the unmanly<br />\nFIRST FLOOR<br />\nwith<br />\nsafeguard this pure<br />\nreckoned<br />\nbe<br />\npreparation,<br />\ncannot<br />\nwhich<br />\ntype<br />\nyears<br />\nfew<br />\nlast<br />\nen off some in the<br />\ndrink of naturalflavors.<br />\nBy means of these three cases.<br />\nbut it should be revived this year<br />\nEASIIHE<br />\nFOR<br />\nMEASURE<br />\nCigarettes<br />\nClub Lounge<br />\nDu Coca-Co, Compaoy.Arlaat, Ga.<br />\n,CN<br />\nAet I, Scrim 2<br />\nas both teams are of about the same Dr. Oliver showed that each man<br />\nFree Phone<br />\ncalibre and a close fight is antici- has his lesson, and is reckoned with<br />\n8 million a day — T HAD TO BE GOOD TO GET WHERE IT Is<br />\nin different ways.<br />\npated.<br />\n1944 EDMONDSON AVENUE<br />\n<br />\nOF<br />\n<br />\n---Cs<br />\n<br />\nis<br />\n<br />\nBosioNLANSI<br />\nShoes 1<br />\nfor<br />\nMen<br />\n<br />\nless burning<br />\n<br />\nofthe midnight<br />\n<br />\noil/<br />\n<br />\nH<br />\n<br />\nCollege Men!<br />\n<br />\nRemington<br />\nPortable<br />\n<br />\nBOS-TONIAN SHOE STORE<br />\n<br />\nWhat Shakespear<br />\nsays about Coca-Co<br />\n<br />\n\f13, 1928<br />\nTHE JOHNS HOPKINS NPIWS-LEITER, NOVEMBER<br />\n<br />\n6<br />\n<br />\nGREAT FEAR PERMEATES NEWS-.<br />\nLETTER OFFICE ON JINX DAY<br />\n4.<br />\n,410<br />\n416<br />\n<br />\nWe've Graduated--<br />\n<br />\nI<br />\ntrawzmar.<br />\nVrne<br />\n••,<br />\n<br />\nto Finer ClutyLike<br />\n/<br />\n<br />\nNew Showrooms!<br />\n<br />\nAND CORDIALLY NVITE YOU TO VIEW THIS<br />\nSPLENDID NEW HOME - - OUR DISTINGUISHED<br />\nFALL STYLE VARIATIONS • - AND OUR NEW<br />\nAUTUMN FABRICS BY EMINENT WEAVERS • • •<br />\n<br />\nJustly<br />\nFamous'.<br />\n<br />\nCLOTHES FOR COLLEGE MEN<br />\n<br />\nFOUR NORTH HOWARD STREET<br />\nSecond and Third Floors<br />\n<br />\n==<br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n<br />\nJ. A. RITTER 6? SON<br />\nflorists and Decorators<br />\nBALTIMORE, MD.<br />\n<br />\n1918 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br />\nDRESS SETS<br />\nfor evening wear.<br />\n'7 and 9 East IPOtimore Street<br />\n<br />\nProducers of - -<br />\n<br />\ncITIE JOHITS:HOPEERS<br />\nHEWS—LEGITEE<br />\n<br />\nFear dominates the publication of- struction of the printer's plant to<br />\nIf<br />\nfice and floods the editors' hearts. the misplacement of a comma.<br />\nNot for any of the usual reasons we could only be sure it would be<br />\ndo these conditions exist. Ordinar- no more than the latter, ,but who<br />\nily the sight of an editor feverishly are NEWS-LETTER editors to predict<br />\nrunning his hand through his hair, the Fates?<br />\nsing his pencil among its tangles, This singular coincidence is not<br />\nand consequently holding up the is- carried So far as it 'conceivably<br />\nsue while the entire staff joins in might be. For instance, the issue<br />\nthe search, means nothing more nor could have containedL thirteen colless than that there are twelve col- umns of news, or there might have<br />\numns to fill with only eight columns been thirteen members of the staff.<br />\nof copy, that the cut for the Ches- Nevertheless, there may be reason<br />\nterfield ad has net been received, for hope. Last year's thirteenth<br />\nand that a freshman candidate has number brought news of the frabeen thrown out of all the offices on ternities pledging ninety-five men<br />\nthe campus without getting a line of ,and Hopkins' decisive victory over<br />\nnews. This time, however, the St. John's. Maybe the jinx will<br />\ncause of editorial uneasiness super- cast favorable auspices on the Cocedes these comparative trivialities lumbia game.<br />\nand plunge's into the realm of the<br />\nmystic and the supernatural. The<br />\nWork On Foundation Of<br />\njinx is at work!<br />\nOn.Friday, the most fateful day<br />\nof the week, here we sit and fear as<br />\nwe prepare copy fot the thirteenth<br />\nissq of the year, to appear‘ on the<br />\nthirteenth day of the month. Small<br />\nwonder if the paper never even appears; the dread of ill fortune is<br />\nin itself capable of working the complete disintegration of the petrified staff.<br />\nA mere Friday the thirteenth<br />\nwould be tame compared to this situation. The worries would end with<br />\nthe end of that day—but imagine<br />\nthe suspension when Friday introduces a period of killing uncertainty that ends only after toe paper<br />\nreaches the post office the following<br />\nTuesday. •Anything can happen in<br />\nthe meantime from the total de-<br />\n<br />\nA meeting of the Varsity<br />\nClub will be held tomorrow,<br />\nWednesday, November 14,<br />\nin the C. E. Hall at 12.20.<br />\nDow Strader wants all lettermen to be present for this<br />\nmeeting.<br />\n<br />\nLereriug Hall Begun<br />\nWith the site of Levering Hall<br />\ntemporarily staked out, actual<br />\nwork on the foundation will soon<br />\nbegin. In fact, a building to be<br />\nused as combination office and<br />\ntool shed has already been constructed.<br />\n'<br />\n<br />\nHANDKERCHIEFS<br />\nLADIES' HOSE, UNDIES,<br />\nHOSE, TIES, HANDKERCHIEF'S<br />\n<br />\nMEN'S<br />\n<br />\nCOOKIES<br />\n<br />\nCANDIES<br />\n<br />\nJELLIES<br />\n<br />\nVOL. X:<br />\n<br />\nYou Can Buy Here for Leas<br />\nWhy Buy Elsewhere When<br />\n<br />\nChristmas is Near<br />\n<br />\nTHE COLLEGIATE SHOP<br />\n<br />\nSt. Jolt<br />\n<br />\nAnnounces its Opening on November 5th<br />\n2446<br />\nOpen<br />\n<br />\nN. CHARLES ST.<br />\n<br />\nt<br />\n<br />\nAlso<br />\n<br />\nand the boys (Hopkins) to help themselves.<br />\n• •Help the girls (Goucher)<br />\nhand-made novelties and home-made dainties<br />\nStop In to see their display of<br />\n•<br />\n<br />\nHERE IS THE PLAN<br />\n<br />\n•<br />\n<br />\nChristmas is almost here, why not make some extra pin money<br />\n'for a new coat, hat, etc., by bringing some homemade article to be sold<br />\nat the Goucher•Hopkins Exchange at 10% commission. Probably your<br />\nMothers and Sisters are helping you through College, therefore; why<br />\nnot have them make some candy, cakes,. or, in fact, anything. All helps<br />\nand everybody. will be out to help -Goucher and Hopkins students to<br />\nhelp themselves. Bring your articles now and remember the articles<br />\nthat are least expensive- sell the best.<br />\n<br />\nFast following this will be a<br />\nseven-foot fence which is to surTUTORING<br />\nround the entire building area. FIRST CHURCH OF CHRIST<br />\nAlgebra--Geometry--Trigonometry<br />\nSCIENTIST<br />\nThis fence will serve a twofold<br />\nWILLIAM H. JOLLY<br />\nBALTIMORE, MD.<br />\npurpose, as it will keep the Joose<br />\n2706 Gwynn Oak Ave,<br />\nTel. Woodlawn 276,W<br />\nannounces Free Lectures on<br />\nmaterial from scattering over the<br />\ncampus, and hinder the over-cur'<br />\nCHRISTIAN SCIENCE<br />\nous students from diverting the By Miss Margaret Murhey Glenn, C. S. B., Phone, CAI. 1380 Home—HO. 2095.J<br />\nof Boston, Mass., member of the Board of<br />\nFRANCES T. BANNON<br />\nworkers' attention by questions. Lectureship of The Mother Church, The Successor to<br />\nHARBAUGH Es' BANNON<br />\nChurch of. Christ, Scientist, in BosFirst<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nand by the worthless advice of ton, Mass., at<br />\n(Room 28)<br />\nwould-be engineering genii. YesFORD'S THEATRE<br />\nStenographic Dictation, Copying„<br />\nMultigraphing, Mimeographing<br />\nterday the top soil was removed, Thursday,'Nov. 15, 1928, at 12.10 Noon<br />\nBaltimore,. '<br />\n•<br />\nMaryland<br />\nand at<br />\nand the work of grading was be- FIRST CHUR:CH OF CHRIST, SCIENTIST<br />\n.<br />\nUniversity<br />\nParkway<br />\ngun. Several trees will necesFriday, Nov. 16, at 8.15 P. M.<br />\nFRANK'S<br />\nsarily be cut down, as the buildLight Lunch<br />\nAmplifiers will be installed in,<br />\ning extends some one hundred<br />\nSunday School room<br />\n5 W. Twenty-first St.<br />\nand eleven feet back from the The Public is Cordially invited to Attend<br />\nOpen 9.30 A. M. to Midnight<br />\nroad into the woods.<br />\n<br />\n-<br />\n<br />\nBALTIMORE. MD.<br />\n<br />\n- INTERIOR WOOD WORK<br />\n<br />\nDECORATIONS<br />\n<br />\n'Doubled and redoubled\"<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE'.<br />\nBALtIMORE, MD<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nShow Rooms<br />\n343 N. Charles Streit<br />\n<br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto success--Opportunity waits beyond.<br />\n<br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND'FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nNEW LIFE FOR MOTORS<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil<br />\n<br />\nValue<br />\n<br />\nSTANDARD OIL COMPANY<br />\n<br />\nOF N.<br />\n<br />\nA leading<br />\n<br />\nbridge expert once said,\"The<br />\naces and kings play themselves; it's the little<br />\nspots that make games.\"<br />\nWhat's true in bridge seems equally true in<br />\nthe cigarette business. Aces to deuces, spades<br />\nto clubs—from the very first deal, Chesterfield<br />\nmade every card good!<br />\nNo risky finesses, no sharp double squeezes<br />\n— Chesterfield rose to world-wide popularity<br />\n<br />\nFRESE<br />\n<br />\nHOmewood 8680<br />\n<br />\nEvery Evbning<br />\n<br />\nTHE READ-TAYLOR CO.<br />\nAdvertising<br />\n<br />\nPAjAM<br />\n1<br />\n<br />\nby straight honest selling with a straight<br />\nhonest<br />\nproduct — an outstanding suFcess in cigarette<br />\nhistory.<br />\nSo Chesterfield can bid high. Tobacco<br />\nqttality, perfect blending, purity, mildness,<br />\nnatural<br />\nsweetness — with a hand like that, Chesterfield<br />\ncan redouble your smoking pleasure,,,and<br />\ntoday, next month, next year, keep right on<br />\nfulfilling the contract.<br />\n<br />\n1F1 ESTERTI ELI<br />\n<br />\nMILD enough for anybody.. and yei..<br />\nTHEY SATISFY<br />\n<br />\n1.11..GBTT az MYERS TOBACCO CO.<br />\n<br />\nAt sev,<br />\ntional St.<br />\nthe Barn.<br />\nticipants<br />\njamas o•<br />\nclothing.<br />\ndon this<br />\nare requo<br />\nner.<br />\nAll fr,<br />\ntend the<br />\npected tc<br />\nthe two<br />\nrequester<br />\n<br />\nAs is<br />\nand red<br />\nraders ai<br />\nposed of<br />\non the<br />\nIrhe f<br />\nGlittner<br />\nHere th,<br />\nthe chee<br />\ncape and<br />\ncheering<br />\non the ning will<br />\nat Nor<br />\nStreet.<br />\nwill wall<br />\nMontunt<br />\nbe made<br />\nscene of<br />\nin effigy,<br />\nwill disb<br />\n<br />\nMany<br />\nhave bet<br />\nof the cl<br />\nplayed<br />\nmarch.<br />\nPeen .11x<br />\nwill be<br />\nfew oth<br />\nduring •<br />\nancient •<br />\nwill co-ff<br />\nThe-old<br />\na.,ftaw!.<br />\nfor seve<br />\nof mare'<br />\nsiphonsr<br />\nFreslinir<br />\nbu<br />\nown risl<br />\n<br />\nThe S<br />\nunite ph<br />\nwho do<br />\nthe an<br />\ntags on<br />\nthem IV<br />\nnesday<br />\nbe distr<br />\nman wh<br />\nnightshi<br />\ntwo flat•<br />\now, ft,<br />\nrade fr<br />\nuleh( 5111<br />\nto h<br />\nform • o<br />\no'clock<br />\nhave no<br />\nbefore 1<br />\npropriat<br />\nted.<br />\n<br />\nThe<br />\nall men<br />\nrade WI<br />\nwill be<br />\nA bonfi<br />\nin defer<br />\nment.<br />\nSt. Jc<br />\nive'at Iorated t<br />\nHalt*ar<br />\ninsignia<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXIII, No. 13<br /><br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 13, 1928<br /><br />\nCAGE FU ND RECEIVESDOUG:FAIRBANKS' RIVAL FOUND<br />\nIN SOPII ENGINEERING STUDENT<br />\nGOOD CA MPUS SUPPORT Tickets for the Hopkins- He was only a Sophomore<br />\nengi- \"prof\" was in the front of the room<br />\nTURKEY DAY TICKETS<br />\nON SALE NOW<br /><br />\nPRICE 6 CENTS<br /><br />\n'Dr. eddy<br /><br />\nJAYS LOSE CLOSE<br />\nGAME TO COLUMBIA<br /><br />\n.<br />\nnerring student who was unsurpass- and escape was. barred. Did the<br />\nis-Jaryland game' .n Thanks<br />\nLions Beat Hopkins by Single<br />\ngiving Day at the Stadium<br />\nably bored with his first afternoon Soph remember Doug Fairbanks?<br />\nPoint Margin<br />\nclass. The spirit of the Barn still Oh, of course, but what did he do,<br />\nare now on sale at the TreasMANY ALUMNI IN STANDS<br />\nclung to him, and he was simply un- drink \"Cokes\" and smoke Luckies?<br />\nurer's office daily from 9 to<br />\nable to focus his attention on the \"That is not the point at all!\" flung<br />\n11.30 and at the Athletic AsFigures Presented to New York<br />\nHoward Caplan Scores Both Jay<br />\nsociation office in the Battr\", rather uninteresting fact of getting scornfully back the outsider, hit un-AIwrIli at Smoker<br />\nTouchdowns<br />\nseated and remaining so. With the pleasantly upon his ears. \"Don't you<br />\nfrom 11.30- to 1. Reserved<br />\naudacity and originality of the engi- remember Doug, of the lithe and<br />\nseats will be $2.00. Students<br />\nDevelopme ats in the progress of<br />\nNew York City, N. Y., Nov. 10<br />\nneer, he ascended to and deposited athletic figure and somewhat neat<br />\nmay procure reserved seats<br />\nthe Cage Fund up to date have been<br />\n(By Staff Correspondent). A light,<br />\nhimself on the lofty perch offered little mustache? Well, his method<br />\nwith their Athletic Associafavorable<br />\nq a Freshman Class<br />\nspeedy Blue Jay eleven threw conby the window casement in the M. of retiring from a building was<br />\ntion tickets and $1.00 addimeeting held after the weekly assternation into the ranks of the<br />\nE. three stories above the campus. usually the simple expedient'of<br />\ntional.<br />\nsembly Thur ,day, November 8c adLions today by battling the heavy<br />\nFrom this vantage point he gazed dropping out of a fifth or eighth<br />\nditional pled es for $1,000.00 were<br />\nColumbia outfit to a 14 to 13 score,<br />\n.<br />\nwith somewhat wistful eyes—if it story window backwards and- landsecured. This amount brings the HOPKINS HARRIERS<br />\nat Baker Field. Howard Caplan,<br />\nengineers are wist- ing on his . . . feet. See the coni be<br />\ntotal sum ple<br />\nstocky Jay fullback, proved the outto date by underDEFEATED BY UNION cal • said that<br />\nsimplify<br />\nnection,<br />\nprocedure<br />\nthe<br />\ncampus<br />\nful—on<br />\nyou<br />\nhim.<br />\nbelow<br />\nthe<br />\ngraduates up to $7,600. This is sigstanding star for Hopkins by scorthe usual Hopkins by emerging frontwards.\" GradualCaptain of Garnet Team Almost<br />\nnificant of se<br />\ning both touchdowns. He made the<br />\nEquals<br />\nbecame<br />\nintelligible<br />\nRecord<br />\npanorama<br />\nthe:<br />\nthe<br />\ngreets<br />\nthe<br />\nof<br />\nthat<br />\nplan<br />\neye<br />\nto<br />\nly<br />\n_<br />\nfacts. In th e first place, this imfirst, at the end of the second half,<br />\n.<br />\nEngineering<br />\n- Soph, his face lit up<br />\nevery observer. The usual pathway<br />\nplies that .t ie projeet has really<br />\n- by a sensational 98-yard run and<br />\nLed by Captain Heath and Rothlater, in the next period, he plunged<br />\ngained mom ritum and is moving mann, who finished only a half min- On which several, figures straggled and'the wisaul gaze vanished. Haythrough for the second Jay score.<br />\nIntwa.<br />\nrd. Uri lergradnates who have rite behind the course-record, Union to and from the Barn, the usual ten- in mentally grasped the idea, the<br />\nas yet not Cu i-itributed may be im- College harriers dashed all hopes nis courts on one oewhich the much engineer proceeded to emerge and<br />\nAlumni Present<br />\nWith the Army-Notre Dame<br />\n• pressed by t iis statement and may of an undefeated season for Hop- discussed R. 0. T. C. was going successfully negotiated the downgame<br />\nat<br />\nthe<br />\nSpeaker<br />\nIs<br />\nYankee Stadium drawAlso<br />\nWorld<br />\nTravelee<br />\nrealize that their pledges, so far, kins by downing_ the Jays 20,to 35. our engineering herb was Supremely ward journey.<br />\nHis Book Barred from Mails<br />\ning the bulk of Manhattan football<br />\nwithheld, will be influential in put- a'he strength of the Garnet team<br />\nmanoeuvers, Certainly hot a thrillSurely, by this time, the reader<br />\nfans, only about 12,000 spectators<br />\nting the project across. Secondly, was unexpected and the match was<br />\nDr. Sherwood Eddy, famous<br />\nmg orr luring aspect,<br />\np .but,_remember, will wonder if he has missed being<br />\nwere in the stands when Remy Tyg<br />\nthe cage is in a fair way to'be real- predicted a win for-I-the Black and ing<br />\nauthor and lecturer, will be the<br />\nkicked off for the Morningside<br />\n_ •<br />\nour-engineering hero was supremely present at the occurrence of a<br />\nized. The at aount of $10,000, re- Blue.<br />\nspeaker at this week's assembly.<br />\nHeights outfit. A good crowd of<br />\nbored, and the great outdoors at miracle or whether some engineer His topic will be \"Sex<br />\ncently set up is the amount expected Heath<br />\nand Hopkins rooters, including<br />\nand Rothmann led throughmany<br />\nof the unde rgraduates, is a goal out<br />\nthe entire distance, setting a least offered- fresh air if not excite- has conquered the limits placed on Youth\". Dr. Eddy wrote a book New York alumni,<br />\nwere in the<br />\nwhich, with t little more effort of pace<br />\ntoo rapid for Scheibel and ment. Finally,--our hero recognized human motility through the air by with the same title which has just stands to cheer the<br />\nJays in their<br />\nthe students, will be attained. Fi- Captain Kelly<br />\nbeen published and is experiencto overcome. The-an acquaintance in a passerby whom the well known law of gravity,<br />\ngame fight. Although small in size,<br />\nnally, this fa t is significant in that two<br />\nwide<br />\ning<br />\na<br />\ncirculation.<br />\nHe<br />\nspent the Hopkins rooting<br />\noutfits were closely bunched un- he hailed. Standing below the win- 'Actually, the Soph -did no such<br />\nsection showed<br />\nit demonstrates that the project is til the<br />\ntwo-mile post was reached, dow, the newcomer carried on a long thing. The first part of this article last year in a specialized study of plenty of enthusiasm.<br />\nfor the most part favorable as far when Heath, Rothmann,<br />\nthis<br />\nfield, and in his work he<br />\nSchiebel,<br />\nShortly after the opening play, the<br />\ndistance conversation with the \"ex- is an account of a prosaic fact. The draws<br />\nas the und a-g-raduates are con- Kelly, and Segal<br />\nupon practically all existbroke into a scatcerned. So ar, their contributions tered formation in<br />\nsuggesclassed\"<br />\nour<br />\nobvious<br />\nlast<br />\nproduct<br />\nsoph.<br />\nthe<br />\npart<br />\nThe<br />\nof<br />\nis<br />\nfeaing authorities on this subject. siege guns of the Columbia eleven<br />\nadvance of the<br />\nbegan a concerted bombprdment<br />\nalone are twit:e as much as that re- others. The four-mile `post<br />\non the tion obviously followed. Why not ture writer's imagination who offers His point of view is that the<br />\nagainst the Jay defenses. Following<br />\nceived by the Levering Hall Fund home team's<br />\n. course- is marked b.v come down and hold a more inti- this somewhat cinemagraphic and frankest, kind of treatment and a punt<br />\nby Bobby Lyons to Columfrom the cam Pus as a whole. Thus a long hill: This proved_the turnmate and closer conversation ? Then non-coll_4_ate method of escaping sex education is desirable and<br />\nbia's 48-yard line, Joe Stanczyk tore<br />\nfar the situat on is somewhat grafi- ing point of the meet, the orderwould<br />\nbe<br />\nhelpful.<br />\nIncidentally<br />\nwas the sad fact revealed:. The dull classes.<br />\nthrough right end for a healthy gain<br />\nfying and it is felt.that a favorable changing at that mark..<br />\nthis book was barred from the<br />\nSchiebel,.<br />\nof twelve yards. Buser, Stanczyk<br />\nimpression of the matter was given who was running third,_ was followmails. This is the first tirne that<br />\nPlans Made For Student Dr.<br />\nand Scott of the Lions' backfielo<br />\nto the New ork Alumni who were ed by Segal, who nosed out Kelly<br />\nEddy has spoken in assembly<br />\npresent at a moker given in honor in the hard grind.<br />\nParade On Friday at Hopkins. He is being brought then smashed the line for a total<br />\nyardage of thirteen in four plays.<br />\n:of the food) 11 team after the Cohere by<br />\nKelly, Fifth<br />\nDefinite announcements for plans A H the University Y. M. C. Two mbre jabs at the Hopkins forlumbia game.<br />\nhase<br />\nworked without a salKelly was :, :110vvi:: I I :\\ N,i-jny Noted Criminologist Discusses for the annual student-body parade A.<br />\nward' wall , resulted in placing the<br />\n• Several Cases<br />\nCampaiie Net Concluded<br />\n.ary all his life, giving his servand O'Connor, of Union; I inerson,<br />\n' on Friday evening preceding the St:<br />\nball on the 15-yard line. A long,<br />\nDespite th : improvement in the on° ,<br />\nices<br />\nto<br />\nthe<br />\norganization<br />\nof<br />\nwhich<br />\n.<br />\n.‘.<br />\n.<br />\nLi<br />\n•<br />\nDr. John R. Oliver, warden of John's game, were made last week<br />\narching forward, tossed by Scott,<br />\nraw, and vi afters, of opk.ins,<br />\nprogress of t le Cage Fund, the-sithe<br />\nis<br />\nso<br />\nprominent<br />\na<br />\nworker.<br />\nthe itiniversity dormitories, well- during assembly. The usual cerwas snatched by Liflander behind<br />\nnation is not definitely' concluded. in the order named. 'Several others<br />\n• In -\"Y\" Work Forty Years - the goalline for the first score of the'<br />\nknown criminologist, author ote a. emony ha consisted of a large<br />\n'ffte project 1 ias the consent of the followed but only the first ten or<br />\nSherwood Eddy was born in game. . A placement<br />\npopular novel called \"Fear,\"'and group of students starting from the<br />\nkick by the<br />\nTrustees of t te University, who had the runners are included in the scor- proud possessor of seven<br />\ndegrees, Barn at about 7 in the' evening Leavenworth, Kansas, on Janu- Columbia quarterback added the exsignified thei - approval • at the be- jug.<br />\nincluding M. D., D. D., and Ph. D., dressed in various rough apparel ary 19, 1871. He graduated from tra tally.<br />\nginning Of th e Fund. The framed '<br />\nUnlike the four and one-half addressed a large assembly last week and fitted -with bright torches,'pa- Yale in 1891 with the degree of<br />\nLions Score Again<br />\nplans of the proposed cage-, which<br />\nin the C..E. Hall. Dr. Oliver en- rading downtown through Charles Bachelor of'Philosophy. At pres- The Lions,<br />\nhaving tasted the<br />\nare -in appearaiice in several places mile course at Hopkins, the Gar, tertained the audience with an exp,,<br />\nent<br />\nhe<br />\n.holds<br />\nthree<br />\nother<br />\ndegrees,<br />\nStreet,;nn<br />\ncli general \"making u<br />\nflavor of blood, came roaring back<br />\nOn the campu i, are another evidence nets boast of a six-mile route. This Cellent outline<br />\nof different types of the good old city. Plans for this all honorary, A. M. A. front Yale for more. Following<br />\na kick by<br />\nof official sawction. It may be said course, however, is not so difficult criminals encountered in modern<br />\nyear will be,a bit different in that and an M.A. and LL. D. from 'Lyons, Stanczyk launched another<br />\nalso that me ral support is almost a one as is the Jay's, as hard roads crinie, - He fried to impress<br />\nWooster<br />\n'<br />\nCollege.<br />\nFive years drive for the<br />\nthe au- students will wear instead of odds<br />\nJay goal line by sweepunanimous. At practically every and paths are chiefly involved in the dience at first with the fact that<br />\nand ends a uniform costume which after graduating from college he ing around right end for nine yards.<br />\n'meeting at wliich the cage has been<br />\ncourse used last week. The record there is no such thing as •an under- will be none other than the -well: became Y. M. C. A. secretary for On the next play, Liflander was<br />\ndiscussed, the project received<br />\nthe Union cross country course world or an underworld character. known pajamas. They will be fitted India and then,secretary for Asia. chased far back of the line of<br />\napproval of tl te total audience. the.or<br />\n1<br />\nHe brought out that people serving tout as usual with the torches, but it •In 1911 he was appointed a meinscrimmage when the Jays broke<br />\nis thirty-fotu- mlnutes, twenty-six<br />\nThe campai<br />\nber of.the International Committhrough.the Columbia defenses. For<br />\nwill continue to do so until the and two-tiftlis seconds. Heath's and ly perfectly' ordinaa_ individuals.<br />\ntee<br />\nof<br />\nthe<br />\nY.<br />\nM.<br />\nC.<br />\nA.<br />\nIn<br />\nthis<br />\nCawill add_a new interest awl agreater<br />\na few moments, the Lion back apExecutive Cotnmittee gets,a definite Rothmatin•s times differed only in a They simply have done wrong and<br />\npacity<br />\n-Dr:<br />\nworked<br />\namong<br />\noriginality to the parade. There will<br />\npeared doomed for a fifteen or<br />\nanswer front -very student. Recent- small fraction of a second, the for- have been caught! They are paying<br />\nalso be two original floats built to students in Japan, Korea, China, twenty-yard' loss but, by a quick<br />\nly, letters we re sent to every stuIndia,<br />\ndearly<br />\ncrime.<br />\ntheir<br />\nthe<br />\nfor<br />\nwas<br />\nIt<br />\nNear<br />\nEast,<br />\nand<br />\nRussia. change of pace, he suddenly<br />\ntrier of the two running the course<br />\nPrecede the marchers and although<br />\nredent to which he was asked to reply<br />\nn.,•t., brought out that murderers are not their exact description has not been He has addressed the provincial<br />\nin the fast time of thir<br />\nversed the whole field and tore<br />\ngiving his at itude on the matter.<br />\n'<br />\nty-four -^L.- strictly,<br />\ncriminals<br />\nbecause<br />\n_parliament<br />\nin most disclosed<br />\n•<br />\nof China b3' request. around<br />\nas yet, they will undoubtend for a substantial gain.<br />\nand two-fifths secSo far, respo ises have been coming t,'tes°fifty-six<br />\n,<br />\ncases they have Made just one mis- ,<br />\nbe ol_a very clever and eye- During the World War he served Several minutes later, this same<br />\nin very slowly:. Men who have not onds. Schiebel, who ran third, did take in their lives in a moment of<br />\nwith the Army'Y. M. C. A., but<br />\nedlY<br />\noPeiling<br />\ny<br />\n',./<br />\nplayer scored the New Yorkers' sec.<br />\nas yet answer xl are requested to do the six mile route in thirty-six min- extreme anger or excitement and as<br />\nThere will be a few more an- afterwards he became a deter- ond touchdown by a center plunge<br />\nso at once, b!cause the Committee utes and eleven seconds, which is a consequence they pay dearly with nouncements of later plans for the mined pacifist, declaring that he of ten yards. A<br />\nperfect placement<br />\nis desirous of closing out the mat- fast time for a .1: trange course of their, lives or through life impris- parade, but in the meantime tet would not serve in another war kick gave Columbia a fourteen-poin.<br />\nonment.<br />\nTo<br />\nbring<br />\nthis<br />\nout<br />\npoint,<br />\nsuch length. The summary, which<br />\nthose \"loud\" pajamas ready and plan under any consideration. At lead.<br />\nter 1,,\\ the end of the week.<br />\n•<br />\nDr, Oliver related three distinct into be with us at the Barn Friday present he<br />\ne runpresents the order in which tire<br />\nCaplan Thrills Crowd<br />\nDon, ;trader Speaks<br />\nis a National Secrestances of murderers, cases he had<br />\n,<br />\nevening, November 15at<br />\nFollowing this score, Tys booty'<br />\n, 7 o clock.<br />\nAt the -past assembly, D<br />\nDow Strad- ners crossed the -line and the time closely followed.<br />\ntary of the Y. M. C. A. His home<br />\nthe kick-off far into the Blue Jay<br />\ner;captain of the football team, ad- of each 'follows:<br />\nis at Jackson Heights, Long territory. Caplan snatched<br />\nThe first of these cases was• that Hopkins Band Plays<br />\nthe ball<br />\ndressed the st idents in reference to<br />\n1. Heath, Union, 34.562-5; 2. of a young foreigner who was a sort '<br />\nout of the air on the two-yard line.<br />\nAt Century Theatre Island, N. Y.<br />\nthe cage. H urged every man to Rothmann, Union, 34.56 1-2; 3 of a \"rolling stone\" in this country.<br />\ntucked it under his arm and streaked<br />\nAuthor of Many Books<br />\ngive his suppart. He pointed out Schiebel, Johns 'Hopkins, 36.11; 4.<br />\nThe Johns. Hopkins Band, and<br />\nDr. Edi,ly - has written over a down the right side of the field for<br />\nHe Committed a slight crime of<br />\na touchdown. The Hopkins interthat the Aluni:Ili will back the pro- Segal, Union, 36.21; 5. Kelly, Johnsburglary andsent<br />\nwas<br />\ntt'<br />\no the peni- not the Johns Hopkins Blue Jay Or- dozen books. The list includes.<br />\nference, in the shape of a flying<br />\nposition if the undergraduates want Hopkins, 36.34; 6. Nigriny, Union, tentiary. for one year.<br />\nThis oc- chestra as advertised in the Friday Students of Asia, With Our Sol- wedge, toppled<br />\nColumbia's potential<br />\nit. .However, it is up to the students 37.07; 7., O'Connor, Union, 37.36; curred<br />\nabout fifteen years ago when NEWS-LErrEa, played a concert at diers in France, Facing the Crisis, tacklers left and right and cleared<br />\nto show their willingneSs in some 8. Emerson, Johns Hopkins,. 37.40; prisons<br />\nthe<br />\nCentury<br />\nTheatre.<br />\nThe<br />\nhand<br />\nThe<br />\nNew<br />\nWorld<br />\nof Labor, and Rus- the way for the speedy Caplan. It<br />\nwere far from the state of<br />\ntangible -form.: He urged that 100% 9. Onorato, Johns Hopkins, 38.07; perfection of today, and the man, played at both performances Mon- sia, a Warning and a Challenge. was a marvelous exhibition of broksupport be gra nted the fund. Strad- 10. Watters, Johns Hopkins, 38.- having served his term, decided<br />\nthat day night and received much ap- Tht`ii evening- he will address the en field running, with the Jay back<br />\ner told his f how students that. a 53 1-2; 11. Hawley, Union, 38.56; he never wanted to see jail<br />\nagain. plause from the well-filled theatre. University Supper Club at 310 N. well guarded behind a protective<br />\nHopkins drive has always succeed- 12. Hill, Union, 39.32; 13, Rosser, He got a position in Baltimore and They marched up the aisle playing Charles St. at 6 P. M. The reg- screen. A placement kick by Caplan added the extra point.<br />\ned and that su iscriptions have never Johns Hopkins, 39.40; 14. Miller, settled down<br />\nin a boarding house. and formed on the stage. Here they ular Tuesday evening meeting of<br />\nThe fighting Homewood eleven<br />\nbeen canceled because of lack of Johns Hopkins, 41.49. Team score: He bought a revolver out of<br />\nseveral<br />\nplayed<br />\npieces.<br />\nDuring<br />\nthe<br />\nthe<br />\nclub<br />\nhas<br />\nbeen<br />\npostponed<br />\nin<br />\nchildcame back strong in the second half<br />\n1 2 4 6 7-20 ish curiosity and carried<br />\n,<br />\nsupport. He loped that this project Union<br />\nperformance<br />\nthey<br />\nhad<br />\nreserved<br />\nseats<br />\norder<br />\nthat<br />\nDr. Eddy might speak<br />\nit with him<br />\nand threw panic into Columbia by<br />\nJohns Hopkins 3 5 8 9 10-35<br />\nwould not fall thrrutoh<br />\nin the loges.<br />\nennti....1 fro,,, Pen p a rot 1<br />\nto the members,<br />\n.Continued on Page 3, Col. 8<br />\nFreshma , Class-Subseritiet<br />\n$1,0 )0 at Meeting<br />\n•<br />\n$10,000 i CAMPUS GOAL<br /><br />\nOR. EDDY TO SPEAK<br />\nON \"SEX AND YOUTH\"<br /><br />\nDR. JOHN R. OLIVER<br />\nADDRESSES ASSEMBLY<br /><br />\nEctly<br /><br />\naure.<br /><br />\nNOVEMBER 13, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br /><br />\n2<br /><br />\nTHEMS11<br /><br />\nIffilv(1 14<br /><br />\nZIWKETTER<br /><br />\nFOUNDED 1887<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR; other communications to the EDITOR-IN-CHIEF.<br />\nUniversity 0100<br /><br />\nTelephone<br /><br />\nJOHNS HOPKINS - - - THE COLLEGE<br />\nBy \"BEN\"<br /><br />\n(Tie largestselling<br />\nin the world<br /><br />\nDares Fate<br />\nfor Favorite<br />\nPipe Tobacco<br /><br />\nNot<br /><br />\n17<br />\nblack<br />\npart of it,<br />\nRecently there appeared in the works. There is one<br />\ndegrees Superlative in quality,<br />\nnevertheless, that seems contrary to<br />\nthe world-famous<br />\ncolumns of the NEws-LETTER, an<br />\nitself.<br />\nthing<br />\nPa.,<br />\nthe<br />\nof<br />\nDarby,<br />\nthe very spirit<br />\n3<br />\nNovember 12, 1926.<br />\narticle' exploiting the life-if. John;<br />\nevery<br />\ncopying<br />\nThat is, thc rule th-4.-forces<br />\nLams &amp; Bro. Co.<br />\nHopkins, the founder of the univerAt all<br />\nstudent to sign a pledge on each ex- Richmond, Va.<br />\ndo<br />\nto<br />\n.Gentlemen:<br />\ndealers<br />\nsity. This article is an attempt<br />\nthrough<br />\namination. In the explanation of<br />\nhave a mania for crawling<br />\nI<br />\nbecaverns<br />\nunexplored<br />\nsomething of the kind with Johns<br />\na number of<br />\nBuy give best service and<br />\nand<br />\nthe Honor System in the handbook tween the towns of Woodstock<br />\nlowest wear.<br />\nValley.<br />\na<br />\nHopkins as a college. I say \"colthe Shenandoah<br />\nin<br />\nJackson<br />\n- 10c each<br />\nMt.<br />\nstatement:<br />\ndangerous<br />\nexceedingly<br />\nwe find the following<br />\ndozen<br />\nAmerican Pencil Co.<br />\nOne cave was passages, etc. I spent<br />\nlege\" advisedly. With the university<br />\nv illow Ave., D 48, Hoboken, N. J<br />\n\"When work is haded in under with its tightin this cavify, groping<br />\nthree hours<br />\nI find no fault.<br />\nMake.of UNIQUE Thin Lead<br />\nflashlight and<br />\ncolors-$1.00 per dor.<br />\nyour name, it is aatturred to be your blindly with a \"dead\"<br />\nColored Pencils in<br />\na severed guiding string.<br />\nis<br />\nHopkins<br />\nJohns<br />\nDEFINITION<br />\nI was finally<br />\nshort,<br />\nstory<br />\nown.\" This is not SQ. It would<br />\nmy<br />\ncut<br />\nTo<br />\na<br />\nafter<br />\nparty<br />\nsearching<br />\nby a<br />\nthe home of disappointed young seem apparent to the unbiased ob- rescued experience.<br />\nIt was a wonderterrible<br />\nof the<br />\nmen who wanted to go somewhere server, that a pledge is. only neces- ful feeling as I sat at the mouthI would<br />\nthat<br />\nfriends<br />\ntelling my<br />\nfor love nor.<br />\nelse. It is a breeding place for cyni- sary when there is some doubt as cavern<br />\nEy.13ANKS&amp; BIbb<br />\nnot go back in there<br />\nreached<br />\n,I meant it-until Iwas gone,<br />\nmoney.<br />\nlers Silversmiths Statiorw,<br />\ncism and snobbery.<br />\nkl<br />\nto whether the student is really hon- for my can of Edgeworth.Itsomething<br />\nI recalled droppingthe cave.<br />\nASSOCIATIONS: In practically all est. enough to be put on his honor and<br />\nin<br />\nduring the excitement will do when<br />\n'Established 1832<br />\nIt is queer what a manconcerned. I<br />\nof the current books and magazine at all. But no doubt this rule will<br />\nPHILADELPHIA<br />\nhis favorite tobacco ismy tobacco it<br />\narticles on colleges we find the state- continue-in effect for years to come. realized that without<br />\nlost in the<br />\nbeing<br />\nas<br />\nbad<br />\nas<br />\nbe<br />\nwould<br />\nSCHOOL RINGS, EMBLEMS,,<br />\nment, \"It isn't so much what you A question of this ,sort arouses no cavity -SO I crawled back. feeling<br />\nCHARMS AND TROPHIES<br />\ngrand and glorious<br />\na<br />\nOis<br />\nIt<br />\nlea'rn from your books that counts, interest on the campus. The student as my hand came in contact with the<br />\nOf the Better Kind<br />\nAristocrat of Tobacco.<br />\nits ydur associations.\" This is un- body is dead from the neck up. '<br />\nYours very truly,<br />\nTHE GIFT SUGG&amp;TION BOOK •<br />\nJr.<br />\nFink,<br />\nP.<br />\nJoseph<br />\ndoubtedly true in the average AmerTALENT: Talent, and by that I<br />\nMailed upon request-'-illustrates<br />\nican college, but,Hopkins is not av- mean an unusual cleverness in some<br />\n,<br />\nand prices •<br />\nerage. Ifopkins is an advanced high field, is raCking at Hiiiikins. 'There<br />\nJewels, 'Watches, Clocks, Silver,<br />\nschool.' At most of the other col- are a few men with great poteniialExtra High Grath,<br />\nChina, Glass; Leather and Novelties<br />\n:from which may be selected<br />\nleges there is a very definite value ities, but they are so bowed down by<br />\ndistinctive Wedding,•Birthday,<br />\nGraduation and other gifts<br />\nplaced on associations, not only be- the weight of their intellects that<br />\ntween students, but also between stu- they do nothing at all. The clifonic<br />\ndents and professors. At Princeton, epidemic of Megalocephalus is unfor example, we find hoary old Ph. founded. In athletics, with the exFORDY,,CE E. C. CAMPBELL<br />\nD's sitting around their offices in ception of ldcrosse, there are no real<br />\n'1-'14dPKINS -ALIMNUS<br />\ntheir shirt sleeves talking to students stars. On the literary side, there<br />\nAll Lines of Insurance<br />\nPhone, Plaza 1062<br />\nin a perfectly matter of fact man- is but little more. With,the excepner. This .at Hopkins would be tion of the Sandburgian A. C. W.<br />\nheresy. Even between students we there is no one able to write without<br />\nfind- little more. On the other hand a heavy pedantic style, and even A.<br />\nwe see a decided lack of friendliness. C.W. is rather stingy with his offerTaAninoN: The only trouble ings. Last year -we saw more of<br />\nabout tradition at Hopkins is the him, but this year; one rather charmNo Deposit Required<br />\nfact that there isti't any,. despite the ing bit has been his only contribuJohns Hopkins University -Students<br />\nof<br />\nfact that thei;Y\" makes a feeble at- tion.<br />\nLight and LADACTIVITIES: The adtivities at<br />\ntempt each year in the \"Handbook\"<br />\nBuicks<br />\nbard Sts.<br />\nto advance the idea that there is. On Hopkins are surprisingly well supPLaza 6000<br />\nChevrolets<br />\nl723-25 N.<br />\npage thirty-Ove of this year's hand- ported and it is for this reason that<br />\nChryslers'<br />\nCharles St.<br />\nbook, under General Customs And they rank far al;ove the rest -of tit<br />\nVErnon 4049<br />\nHopmotsiles<br />\nlisted.<br />\nfor<br />\nThe<br />\nTen<br />\nthere<br />\nare<br />\ncollege.<br />\nNEWS-I,ETTER,<br />\nTraditions,<br />\n2402 Pennsylvania Ave. _<br />\nWillys-Knights<br />\nSectjon two tells us: \"The Gilman example, is well edited, well printed,<br />\nLAfayette 2000Me rial room is for the pleasure and all in all, very satisfacfory. The<br />\nBaltimore Concedes Milestone Supremacy<br />\nof se tors only.\" Just what this Blue Jay while it does not rank<br />\n\"pleasure\" is, no one has ever at- with the NEWS-LETTER, is about as<br />\ntempted to explain. Section -three good as the average and its covers<br />\nsays: \"Everyone is to tip his hat to are as good as any, though they bethe members of the faculty.\" If lie the contents. Since the Jay<br />\nyou will stand on ithe porch of Gil- has revised its policy, is it possible<br />\nman Hall some day and trace the that we can look for something betpath of one of the faculty members ter? Drawing our cloak about us<br />\ndown to the barn, you will be able we will step softly past the Debating<br />\nto count the number of hat tippings Council, vvhicht will assuredly be lost<br />\non one finger, and you really witliatt the leadership of the naive<br />\nwouldn't need that. S_ectism eigbt Norman. Gardiner, atiel pa •a -en to<br />\ninadt--A5<br />\ngoes number three one better. In the Barnstormers.jat last we<br />\niIdCuttoOli$ifiF the old Rutgers manner it gives find something worth having. AlESTABLW1;40<br />\nENGLI-514„-IJNIVtRSITY<br />\nvent to this utterance: \"Remember, though their productions could unSTYLES, TAILOREO-,OVER YOUTHFUL<br />\nit is a .Hopkins tradition to speak doubtedly be improyed7tifey are- alCHARTS SOLELY FOR DISTOIGUISHED<br />\nto every I?Iopkins man you pass on ready on a high 'plane. The stanSERVICE IN TPM fit'a-ITO STATES.<br />\nthe campus.\" Far from cherishing dard of work done by the men who<br />\nand carrying out this ideal, tht Hop- handle the \"props\" and scenery, the<br />\nkins man runs the other way anal- efficient business- management, thel<br />\nneglects to speak to anyone. It is devotion of \"Pop\" Swindell, all are<br />\nnot strange for two men who have things greatly to be admired. The<br />\nmet one day, to pass each other the one fault that could possibly be<br />\novercoats<br />\nnext v(ithout a nod. This situation, found with the Barnstormer produchowever, is not hard to account for. tions is that there are not enough<br />\n4§1<br />\nHopkins, after all, is composed of a of them. In the Barnstormers, HopBY SPECIAL APPOINTMENT<br />\nrather motley crew, most of whom _kins has something to livp up to.<br />\nare day students and have little<br />\nOUR STORE IS THE<br />\nCONCLUSION: Since there is<br />\nchance to contract others at the Uni- something lacking at Hopkins, what<br />\nversity. An explanation, however, is the remedy? As this article is<br />\ndoes not alleviate the condition, and not intended to be \"constructive\" I<br />\nit is highly probable that nothing have nothing to offer,<br />\nespecially as<br />\nOF BALTIMORE<br />\never will alleviate it. But until it it's getting late and I want to go<br />\nto<br />\nis remedied, and men get to know bed. (This is only an<br />\nexcuse. In<br />\nThe character of the suits and<br />\neach other, no trace of that indefin- reality my sterile brain<br />\nhas nothing<br />\novercoats<br />\ntailored by Charter House<br />\nable spirit, so essential to a college, to offer<br />\nanyway.) It is to be expectwill earn your most sincere liking.<br />\nwill ever-,e-sent.<br />\ned, considering the conditions, that<br />\nTHE HONOR SYSTEM: The Honor nothing ever will be offered. HopSystem is one of Hopkins' pets, and kins has sunk into a morass of \"inrightly so. We have it on good au- nocuous desuetude,\" from which it<br />\nliditimore. Charles and Fayette<br />\nthority that Hopkins. is one of the will probably n7r emerge. All<br />\nfew colleges at which such a.system very,<br />\nad.<br /><br />\nENUS<br />\nPENCILS<br /><br />\n20<br /><br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nGEORGE E. BANKS, JR.., '29<br />\nAssistant Managing Editor<br />\nGEORGE GUMP,'30<br /><br />\nManaging Editor<br />\nPHILIP W. NEN. '21<br /><br />\nAssociate Editors<br />\nRICHARD H. WOOD,'29<br /><br />\nWn.anot H. DRIVER, '29<br />\nRoman S. BAIRD, '30<br />\nJunior Editors<br />\nStetiritrt L. Smith, 'SO<br />\nLeonard B. Nolley.•'29<br />\nH. Garland Hershey, '29<br />\nPaul W. Spear, '30<br />\nGeorge H. Dowell, '31<br />\nCharles Harry, '31<br /><br />\nW. Purnell Hall, Jr.. '30<br />\nE. Foster Dowell, '29<br />\nRichard G. Hunt. '31<br />\nHarwood P.,Mullikin, Jr., '31<br />\nIrving S.C. Gordon, '29<br /><br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nJ. ROBERT MYERS. '29<br />\nGEORGE M. GLAZIER, '29<br />\nAdvertising Staff<br />\nOffice Staff<br />\nAlvin H. Blum, '30<br />\nTheodore A. Flefehninn, '31<br />\nGus Burke. '31<br />\nRandolph Rothchild, '31<br />\nJohn Lots, '30<br />\nLeroy Shwa, '31<br />\nGeorge S. Robertson, '31<br />\nJohn A Jamieson, '30<br />\nSidney Rattel, '31<br />\nStaff Photographer<br />\nWALTER D. SCHEIDT, '30<br />\nPrinted by The Read-Taylor Company, Lombard and South Streets,<br />\nBaltimore, Md.<br /><br />\nEDITORIAL COMMENT<br />\nBROTHER BABBITT<br />\n1MRATERNITIES are causing the American colleges-to turn gradually from the advancement of book learning .to the training of<br />\npractical business men. Universities were formerly dedicated to critical analysis, logical reasoning, aesthetic appreciation and ethical paination. Now veith the dominating influence of the Greek letter,'chapters over the members of the student body, our colleges are beginning'.<br />\nto instill into our American youth such moral qualities as the fighting<br />\nspirit, the will-to-win and initiative.<br />\nSuch is the interesting theory advanced by Max McConn, Dean<br />\nof Lehigh University, in the current issue of The North American<br />\nReview._ At the beginning of his treatise, the author reveals the informition that the Average college fraternity takes into account four<br />\nprincipal points in the rushing of freshmen: money; familY; the preparatory school which the rushee attended; and personal qualities.<br />\nThe financial standing of the candidate is of little importance to<br />\nthe fraternity rushing committee. If the freshman's father is an influential man in his home town and the frosh's mother is a social<br />\nleader, the rushee's chances of receiving a bid are materially increased.<br />\nThe social reputation of the preparatory school which he attended is<br />\nalso considered of great importance by the fraternity.<br />\nBut of the four criteria, the matter of \"personality\" stands foremost. A boy with a winning smile, a \"smooth line\" of conversation<br />\nand a pleasing manner, is certain to be taken. If he has won dis- •<br />\ntinction in athletics, dramatics or college publication work he be•<br />\n_<br />\ncomes even more desirable. - •<br />\nFraternities seem to put little or no emphasis on the matter of<br />\nscholastic perfection, in the opinion of the Lehigh educator. The<br />\nchapter is, of course, interested to the extent of seeing to it that its<br />\nmembers \"stay in college\".. Probation for a, member means that he<br />\nwill be debarred from athletic competition and participation in!outside activities. The typical fraternity house is distinctly non-intellectual in general atmosphere and any conversation of a \"high brow\"<br />\nnature is completely taboo.<br />\nBut the author hastens to explain that he.is not attempting anything in the nature of an \"indictment\" of the fraternity. He admits<br />\nthat the typical Greek fritter is an exceedingly_inaustrious and hard<br />\nworking young man. In addition to his periods of class room work<br />\nand studies, he must play on the teams, practice .for the glee club,<br />\nattend dramatic rehearsals, organize meetings, give dances, arrange<br />\nbanquets and sit on numberless boards and committees.. Students contend that these outside activities are a more valuable means of training than book learning. When they graduate, they send their sons<br />\nback to the campus to follow in their footsteps and become student<br />\nleaders. Dr. McConn makes no attempt to refute these claims—on<br />\nthe contrary, he admits that these contenions are sound and correct.<br />\nThese students, with their self-devised course of training, consisting of outside activities, stand for a conception of higher education, quite different from the traditional idea. In the last forty years,<br />\nstates the author, a new type of student has entered the American<br />\nuniversities—a student who is incapable of profiting by the old method<br />\nof book learning. Sponsored by the college fraternity„ he is obtaining<br />\nhis education through work on the student activities. A campus Babbitt, so to speak.<br />\nDr. McConn'a-discussion revolves about the old, old question of<br />\nthe relative value of student activities as opposed to academic work.<br />\nHe pictures the fraternities as pushing the student one way, while the<br />\northodox college professor is pulling him in another direction.<br />\nIt has long been our opinion that in this new world of high pre&amp;<br />\nsure business methods and rapid fire commercial activity, the apprenticeship served on the editorial staff of a college publication, or in,<br />\nsome other campus activity, is a valuable preparation for the struggle<br />\nfor existence after graduation. But'no one can deny the cultural and<br />\naesthetic value of academic work and book learning. Again, we enter<br />\nour plea for a sensible balance of these two important phases of college life.<br /><br />\nfit<br /><br />\nEdgew, orth<br /><br />\nSmoking Tobacco<br /><br />\nsuits $47a, ms,.50<br /><br />\nwel<br /><br />\nNola<br /><br />\nitrxterI oweIfie i.Hub<br /><br />\n••••I<br />\n•••••I<br />\nOEM<br /><br />\nf.<br /><br />\nDR. J<br /><br />\nquaiity pencil<br /><br />\na<br /><br />\nCOI<br />\nill an<br />\nSomet<br />\n- the rot<br />\nnatura<br />\nthe pa<br />\n• Tinie,<br />\norribl<br />\npenitei<br />\nfore t<br />\nquarte<br />\n- saw I<br />\nseeing<br />\n_ decide<br />\nnot be•<br />\nhad hi<br />\nof his<br />\nshot it<br />\nthe po<br />\nOn th<br />\ns deflect<br />\n• the bu<br />\n\"killed<br />\nV ie we(<br />\nfound<br />\n\"deap(<br />\nhad 1<br />\nstain<br />\nsaved<br />\ntence<br />\nthe w(<br />\nern p<br />\nbroug'<br />\nwas e<br />\nyears,<br />\nan igi<br />\na non<br />\npersen<br />\nshop<br />\nto'.sa,<br />\nitione)<br />\nPAfter<br />\nSNO<br />\nwit11. .<br /><br />\nfriiiloso<br />\ndenta/<br />\n. wood,<br />\n, playe(<br />\nfused<br />\neven<br />\nmini,<br />\nably L<br /><br />\n.1<br /><br />\nthrotn<br />\nthere<br />\ngentle<br />\nWilt) 1<br />\nnity.<br /><br />\nTIn<br />\ncilea<br />\ning<br /><br />\n\\<br />\n,wit, it<br />\nv.,<br />\nvigil<br />\nyear<br /><br />\n- ican 1<br /><br />\nlast i<br /><br />\nwhere<br />\nphysi(<br />\nrible<br />\nder a<br />\nhere<br />\na dist<br />\na rev<br />\ncomp]<br />\nRapp()<br />\n,garde<br />\nthe m<br />\ntestifi<br />\nand t<br />\n' grout<br />\ntime<br />\ninters<br />\nlutely<br />\ncurrel<br />\nbut w<br />\ntruce<br />\nthe d<br />\nbalani<br />\na mit<br />\nto his<br />\nlater,<br />\nthe n<br />\nceive(<br />\ntor's<br />\nbring<br />\n'C<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1928<br />\nDR. JOHN R. OLIVER<br />\nADDRESSES ASSEMBLY<br /><br />\nCOUNT IVA TOLSTOY TO<br />\nSPEAK HERE ON THURSDAY<br /><br />\n3<br /><br />\nBLUE JAYS NOSED OUT BY COLUMBIA<br />\nELEVEN IN THRILLING GRID BATTLE<br /><br />\nBOOKS<br />\neMANNIE BERG<br />\nBOUGHT, SOLD<br />\nContinued front Page 1, Col. 6<br />\nand EXCHANGED<br />\nThe Old Boy Himself\"<br />\nPippen's Book Store<br />\nComes to Interpret the Philosophy scoring another touchdown in the distributed megaphones to I,ion<br />\n605 N. EUTAW ST.<br />\nthird quarter. Caplan made a beau- rooters -bearing such slogans as<br />\nTrade Mark Reg<br />\nContinued from \"age 1, Col. 31<br />\nof His Father<br />\nAbove Franklin<br />\ntifulahoe-string catch of a forward \"Roar, Lion Rooter\" and \"Beat<br />\nin an absolutely i nocent manner. • Count Ilya Tolstoy has accepted<br />\nCollek,iate Furnishink5<br />\nSomething was stolen from one of an inyitation and will speak in the pass from Lyons and, after a twen- Johns I-Opkins,\" Some day this<br />\nYELLOW CAB STANDS<br />\nty-yard run, was brought down on game may become as important as<br />\nAT<br />\nthe rooms in the boarding house and C. E. Hall on Thursday, November<br />\nNORTH AVE. MARKET<br />\nHomewood Field<br />\n,naturally this man was suspected b) 15th, at 5 P. M. Count Tolstoy the tWo-yard line. Two line smashes the Harvard-Yale struggle. ,Who<br />\nhy the Joy fullback netted one and knows?<br />\nNORTH<br />\nEt? MARYLAND AVES.<br />\n35th<br />\n6'<br />\nSt<br />\nPaul<br />\nSts.<br />\ninnocent<br />\nof the is making his American tour ow the.<br />\nthe police. He was<br />\nhalf yards, giving Hopkins its sec31st &amp; St. Paul Sts.<br />\ni-rime, but had a terrible vision of a Mindredth anniversary of the birth a<br />\nond touchdown. The try-for-point<br />\nSafe and Efficient Service<br />\nThe Columbia players were<br />\nlorrible future period in that dread of the results of the Bolshevist revNo Charge for Extra Passenger:<br />\npenitentiary. lie was brought be- most famous writer and philosopher. missed the posts by a narrow mar- served drinking water from individgin.<br />\n'PHONE<br />\nual paper cups btit the Jays continfore the Sergeant at police head- who died in 1910. He comes to inAlthough heavily outweightd on ued to use the old fashioned water<br />\nVERNON 1 2 1 2<br />\nquarters to be questioned. The man terpret to America the phi:osopily<br />\nboth the line and in the backfield, bucket.<br />\nFOR A<br />\n• saw jail looming before him and of the elder Tolstoy and to speak<br />\nthe Jays fought a game battle and<br />\nseeing the,open door behind him, he ro the results of the Bolshevist revYELLOW<br />\nCAB<br />\n_decided to try to escape.: He had olution in Russia eleven, years a u. played heads-up football from the<br />\nThe Hopkins band, twenty-eight<br />\nPhone CAlvert 5975<br />\nopening whistle until the end of the<br />\nsearched<br />\nbeen<br />\nthoroughly<br />\nnot<br />\nand he<br />\nstrung, Marched about the field be- THE CHARLES E. MYERS CO.<br />\nPen Mightier. Than Sword<br />\ncontest. The Lions started their<br />\nhad his revolver in the -inside pocket<br />\nIncorporated<br />\ntween halves and got a big hand<br />\nLeo Tolstoy, it will be rem<br />\nManufacturer of<br />\nregular<br />\nfirst<br />\nstring<br />\nteam<br />\nagainst<br />\nthe<br />\nof his coat. ice drew it out and bered, was the one<br />\nfrom the Columbia stands. The<br />\nman who proved.<br />\n'RUBBER STAMPS<br />\nBlue Jays and kept their ranks prac- Columbia band made a good showshot into the air merely to frighten that the pen<br />\nis mightier than the<br />\nThe Service Shop<br />\n' the policemen antl affect his escape. sword. Born in 1828,<br />\nUnder the tically intact throughout the battle. ing in their dark capes. lined with<br />\n319 W. Redwood St.<br />\nOn the second shot, his arm was reign of Nicholas<br />\nblue,<br />\nand<br />\nwhite<br />\nhats.<br />\nLooked<br />\njust<br />\nI, the -most crud If Hopkins can show the same<br />\nt deflected by one of. the officers and autocrat of Russia, in a time when power and fight on Thanksgiving like movie ushers.<br />\n' the bullet struck an old turnkey and slavery and brute<br />\nforce were in Day, the Maryland eleven will have<br />\nkilled him. The •.man was inter- power, Tolstoy was<br />\nThe band, incidentally, had a hard'<br />\nhimself a mem- a busy afternoon in spite of their<br />\nviewed later by Dr. Oliver and ber,of the<br />\ntime getting to New York. Their.<br />\nmost aristocratic class.<br />\nsurprise<br />\nvictory<br />\nover<br />\nYale.<br />\nfound to be fzir different from the Ilis grandfather<br />\nE. E. ADAMS<br />\nwas a -prisoner in<br />\nbus ran out of gasoline'near Plain\"desperade that the _newspaners -the Napoleunic<br />\n—<br />\nSidelights<br />\n.war in 1814, and trafield,<br />\n.New<br />\njersey,<br />\nwhich.<br />\nis<br />\nabout<br />\nhad painted him. A-fter a hard dition has it<br />\nNew York newspaper writers inBAkW WETERIA<br />\nthat Napoleon was surfiftl, miles from. Manhattan.<br />\nstruggle if law the man's life was<br />\n4saiaed ihatuasiaArnjyjcgr sist on referring to the Jays as -the<br />\n_<br />\nsaved and. he was given a life sen- could speak<br />\n\"medicos,\"<br />\nFrench bettec-than him- \"doctor-S.,\" \"surgeons?<br />\n'<br />\nWhen things looked darkest for<br />\ntence in the penitentiary. To show self.<br />\n-and \"medical men.\" Something<br />\nColumbia, the Lions' band struck up<br />\nthe wonderful strides that the modWas Individualist<br />\ndrastic should be done about this.<br />\nern prison has taken, Dr. Oliver<br />\n\"Old Man Sunshine\" and the sky<br />\nLeo Tolstoy attended -the Russian<br />\nbrought out that this man actually Universities, and on one of his rejust _continued to get cloudier and<br />\nSign outside of Baker Field anWas educated during the past ten ports was the annotation \"Tolstoy<br />\ncloudier.<br />\nyears, and has been changed from ms e.specially weak in the Russian nounces \"Football Today, Columbia<br />\nan ignorant, useless human unit to language and in Russian literature.\" Vs. John Hopkins.\" When will the<br />\nA page of cartoons in the official<br />\na normally intelligent, quite useful At,•,?1 Tolstoy joined the•Army and world learn the difference between<br />\nprogram afforded much amusement<br />\nperson. He is-now head of the shoe became an officer. At that time he<br />\n\"John\" and \"Johns\"?<br />\nto Hopkins rooters. The Hopkins<br />\nshop at the jail and. has managed- had his own estate and several thouAlumni are pictured as hanging on<br />\nto save a considerable amount of sand peasant families. Tolstoy was<br />\nThe• Jays stayed •at the Commo- an ambulance as they inquire the dimoney, obtained from extra work. addicted to playing Cards and drink*After five years he had accumulated ing. An awakening conscience Soon dore Hotel during their New York rection of Baker Field.<br />\n$.<br />\nand calling for an ,,interview revealed itself in his writings. liar visit. This is one of the largest and<br />\n• wikt1101iv .1-.:, Ii requested that anti Peace, Amid K.urenina, Kreutz- most palatial of the Manhattan hosColumbia has two more hard bat.iill•el ' . I . I_ thlr money to the_ er Sonata, #esurrectii:in followed<br />\ntles before the end of the season.<br />\ntelries.'<br />\n'fwitle ---0 the man he • had acci- each other in rapid succession;and<br />\nClothiers and Haberdashers<br />\nhis week -they meet Pen<br />\nTnsylvania<br />\nFORDS*0•4 GEAR SHIFT CANS<br />\ndentally shot. This was indeed a sent his name and fame throughout<br />\nColumbia<br />\nseemed<br />\nho<br />\nbe.considFTat<br />\nFranklin<br />\nField<br />\nand<br />\non<br />\nThanksIt E. North Avenue<br />\n\"<br />\nT<br />\nI<br />\n. wonderful trait of character (Its- the world. Czar Alexander the 11,<br />\nVernon 2704<br />\nplayed, and although the widow re- When asked why he did not stop ably xorked up over the contest. A giving Day they will play Syracuse<br />\n17 E. Baltimore St.<br />\nfused the money, it is believed that 'folstoy's-startling revelations of po- haberdashery shop, near the cumpus, at New Vork.<br />\na<br />\n(Nett slu: respected the offer. This litical • life said, \"Tolstoy is more<br />\nman, it ‘N as brought out, will prob- powerful than I,\" and he- was left<br />\nably be sct free in a ftw more years to write. Famous guests came from<br />\nI hrough the goverias pardoul.and all over the world to visit Tolstoy.<br />\nJUST RELEASED FROM HOLLYWOOD...<br />\nthere will 'emerge then a perfect Esom America came_ William Jengentleman, and . a mined laborer nings .Bryan, while Thomas A. Edwho will be a credit to the commit ison scnt an engineer to make phonnitY.<br />\nograph records of his voice: Henry<br />\nGeorge, Jr., came to discuss the<br />\nPhysician Affected<br />\nThe second case WaS -that .1 a single tax question. Tolstoy's-views<br />\ncolleague of 1)r. ()liver while study- on the-church and on war became<br />\ning in' a mental -research • hospital. the chief topic of discussion for<br />\nDIRECTOR<br />\nThe victim as we may well call flint, 'many days. 'lie preached Christ's<br />\n.was it specialist in this field,- -.a pro- Doctrine of passive resistence and<br />\nfess.r in ps,chiatrics in a large f,w- said wars would stop if people<br />\n•• eign university, sent here for MIC won1(1 stop killing each other. Ile<br />\n* STAR *<br />\nyear of research work in the<br />\nndiVidttalist. At least 'Cola-va. au<br />\n.ican hospitals. 1 le'was a very bril- st,)y had found did God he had been<br />\nliant man, but unfortunately be dc:. seeking in the livcs of the humble<br />\nveloped a peculiar ,ort 1 insanitv_ peasants, tfittrllers• l[tlaY toil. 'He<br />\nwhereby lie believed that a certain did not want to profit from his<br />\nTHE CAST<br />\nphysician in the hoSpital tIltS It ter- writings and took no copyrights.<br />\n. .<br />\nrible enemy of his becapse of slanShort Story Writer<br />\n.SecApti Cigtilette<br />\n. • . OLD GOLD:<br />\nder and other practices. We have<br />\nCount Ilya Tolstoy, the son, has<br />\nThird Cigarette<br />\n. ..... . 17-`'<br />\nhere a man of super-intelligence,. of written many short stories of RusFourth<br />\nCigarette<br />\na distinctive reputation. He bought sian life which have-had a wide cira revolver and after putting in a culation and are at- present entirely<br />\n\"Making a blindfold test is like conducting a movie<br />\ncomplaint to the police about this out of print. Ice has, iti addifion<br />\ntryout. But in this competition I fc•und my star<br />\nsupposed enemy, which was disre2 to the abilities inherited from his<br />\n'right off the reel.' I named OLD GOLD for the lead<br />\n,garded through an oversight, he shot great father, it natural ability as a<br />\npart the moment I tasted its ihrilling flavor and<br />\nthe man.and killed him. Dr. Oliver speaker and has turned this to actestified in this case for the accused count in giving his ideas verbally<br />\n.its soothing gentleness to the tongue and throat.\"<br />\nand tried to save his life on the to audiences. On his last American<br />\ngrounds that he was insane at the tour in 1924 he was greeted as he<br />\ntime of the murder. The man Was himsaf puts it \"by large crowds<br />\ninterviewed in jail and was abso- from Portland to Portland.\" His<br />\nlutely ignorant of all that had oc- coming to Johns Hopkins should<br />\ncurred. He was finally almost hung, prove onc of the,most interesting<br />\nbut was saved and given a life sen- events of the season.<br />\ntence in the penitentiary. In jail<br />\nBARTHELMASS was •skcd to smoke. each of the lour leading brands,<br />\nclearing his<br />\n151 .15 et,ffec rit;earnitmokesiOnly ouc<br />\n\"(1 II,true<br />\ny.like best?\"<br />\n•<br />\nthe doctor's mind became more un- glue Jay To Be<br />\nbalanced and finally he was sent tc<br />\nIssued On Friday<br />\na mind institution and thence back<br />\nE. Bennet Kold, editor-in-chief of'<br />\nto his own country. A short time<br />\nlater, 13t. Oliver who .had -helped the Black and Blue Jay, announced<br />\nIhree types of leaves grow on the to- . . . and the heart-leaves. rich<br />\nr. Lorinoli Co.. kiir.<br />\nin cool<br />\nRICHARD BARTH ELM ESS..„endeared<br />\nbacco plant . . . coarse top-leaves,<br />\nto ruovie,goers the world over for hi• superb<br />\nand fragrant smoking qualities<br />\nthe man throughout the affair, re- that the first issue would be placed<br />\nMade from the heart-leaves of the<br />\nacting in such First National pictures •s,<br />\nirritating to the throat . . . withered<br />\nOnly<br />\nthe<br />\nheert-leevee<br />\npostoffice<br />\nare<br />\nitoxes<br />\nFriday<br />\nused<br />\nmornin<br />\nthe<br />\nis<br />\n*.The Patent Leather Kid,\"<br />\nceived a beautiful gift from the docNoise\"<br />\ntobacco plait<br />\nground-leave;without taste or aroma<br />\nOLD GOLDS.<br />\nand \"Out of thc Rums.\"<br />\ntor's foreign colleagues. This_story ing. The Blue Jay will be on sale<br />\nbrings out the necessity for imme- at the St. John's game Saturday afternoon.<br />\nCoittinued on Page 5, Col. 3<br />\nNoted Criminologist Discusses<br />\nSeveral Cases<br /><br />\nent a<br />\nnew DERS%<br />\n)0P'SAUN<br /><br />\ntr,<br /><br />\nDrive It Yourself<br /><br />\nYou'll never<br />\nhave to takeaback seat in<br />\na Braeburn<br />\nProm Tux.<br />\n$4°<br /><br />\nE IU<br /><br />\nThe<br /><br />\nBlindfold Cigarette Test<br /><br />\nDick Barthelmess<br /><br />\nL,D GOLD<br />\n•<br /><br />\nWhy you can pick them<br /><br />\nSMOOTHER AND BETTER—\"NOT A COUGH IN A CARLOA<br />\nD\"<br /><br />\n1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13,_<br /><br />\n4<br /><br />\nHOPKINS IS HOST<br />\nTO DOZEN COLLEGES<br /><br />\nINTER COLLEGIATE<br />\nNEWS<br /><br />\nHULL1BALOO BECOME HUMOROUS<br />\nPicture Schedule of<br />\nCAMPUS<br />\nBUT NOT aV HOME WOOD<br />\n-Hullabaloo Changed<br />\nevery four<br /><br />\nPI<br /><br />\nHAVE YOU<br />\none issue for<br />\nSomething 11 w_un4er the sun. erage of.<br />\nFollowing are the changes which<br />\nopiteatiatif some- years.<br />\nrathet,<br />\nOr,<br />\nhave been made in the Hullabaloo<br />\nYears ago, the editors of the<br />\nthing so old' ftat th renewal<br />\nEddy Conference Brings Over a<br />\nto<br />\nA compromise has been affected ...I ture schedule:<br />\nlopkins Hullahatoo' stalled •<br />\ncampu,<br />\nSIGNED<br />\nthe<br />\nwords<br />\nHundred Visiting Students<br />\nnew. In other<br />\nbetween the student body of Cornell<br />\ncopyright all of the publications<br />\nTUESDAY<br />\nUniversity 'and, the local theatre<br />\nworld has awaken,.<br />\ncontinpublication<br />\nbeen<br />\nhas<br />\nand this practice<br />\nDR. FRENCH SPEAKS<br />\nHOMEWOOD<br />\nManagement whereby, upon the<br />\nto the fact that we at Hopkins ued throughout the yearly issues:<br />\n,to deport 4.30—Football Team.<br />\nRemsen Hall Is Sce..e of Talks on agree:zit:at of the fortnc<br />\nare not the -only anes that p-rtb• What effect this copyright<br />\n4.45--Cross Country Team.<br />\nthemselves quietly dit week days,<br />\nreWorld and Domestic Issues<br />\na fiAtotoo. \\\\ lien. this have on the new \"Hullabaloo\"<br />\nlish<br />\nWEDNESDAY<br />\nthe management has ainsented Cr<br />\neditors<br />\nthe<br />\nbut<br />\nseen,<br />\nbe<br />\nis<br />\nto<br />\nit<br />\nmains<br />\n'function<br />\nS. E. HALL<br />\nnew paper began to<br />\nTwelve universities, colleges. and countenance all forms of disapproon this campus<br />\nnormal schools sent over, one hun- bation (the well-known razzberry) 4.10—Electrical Club.<br />\nnot possible to say at_this time. Of the year book<br />\nthe name<br />\nthat<br />\ndetermined<br />\nis<br />\ndred students to the Sherwood Eddy or even applause at the second show 420—A. S. C. E.<br />\nclaim<br />\nthe<br />\nare<br />\npage<br />\nOn the editorial<br />\nConference which was held at fohns every Saturday. We can scarcely<br />\nbe synonyMade that the paper was estab- \"Hullabaloo\" shall<br />\nTHURSDAY<br />\nHopkins from Friday to Sunday of term this a gentleman's agreement,<br />\nstately year<br />\nlished in 1894, yet side 'by side mous witliak good,<br />\nS. E. HALL<br />\nlast week. Four universities, John's however.<br />\n'<br />\nof<br />\ngenerations<br />\nof<br />\nyells<br />\nI2.25—Barnstormers.<br />\nwith this statement is the nor book, and<br />\n*<br />\nHopkins, Maryland, George Washon athletic<br />\nstudents<br />\nCouncil.<br />\nActivities<br />\nissue<br />\n12.30—Student<br />\nthe<br />\nHopkins<br />\nand<br />\n2<br />\nvolume<br />\nrePtewere<br />\nthe<br />\nDelaware,<br />\nof<br />\nber<br />\nington and<br />\nExperiments on- the consumption<br />\nconnected with<br />\nsented. Six colleges including Gou- of energy, by human beings are be- 12.35—Debating Council.<br />\n1. *It would seem that the stti- fields, and not be<br />\npublication,<br />\nMaryland,<br />\ncher, Hood, Western<br />\ning carried on by a certain profes- 12.50—Y. M. C. A. Council.<br />\ndepts of Franklin and Marshall. a semi-humorous<br />\nPLEDGE?<br />\nPennsylvania,<br />\nWashington College, Maryland Col- sor of University College, England.<br />\nof<br />\npaper.<br />\nwilds<br />\nthis<br />\nthe<br />\nhad<br />\npublish<br />\nfront<br />\nSeveral fraternities have<br />\nCollege, who<br />\nlege for Women and 'Morgan sent Among other *resting conclu- their designated time changed, to<br />\napof<br />\nreputation<br />\nthe courage—oi which has the<br />\nonly<br />\ndelegates. Students,from two nor- sions.developed, he has ascertained Wednesday night; but the exact have<br />\nnine pearing- very intermittently, at<br />\nmal school -Frostburg .and Mary- that an athlete in running the 100 time has not been definitely decided funds—to publish not over<br />\nissues in thirty-four years, an av, least !nice in every four' years.<br />\nland' State Normal, also attended. yarddasli in less than eleven sec, on.<br />\nThe Johns Hopkins delegation con- onds expend:5 an.antount of energy<br />\nsisted of a dozen men headed by W. equal fO !fiat 'which would be reFIDELITY - AND DEPOSIT CO..<br />\nPurnell Hall, Jr., president of. the quired :for a leapfal 650 feel into<br />\n-.<br />\n:<br />\nFETTING-__<br />\nH.<br />\neA.<br />\nwere<br />\nchairmen<br />\n\"Y.\" The conference<br />\nthe air—one hundi.ed-feet higher<br />\nof Maryland<br />\nMiss Gladys Wakk of Hood and than the famous Washington -MoncMANUFACTURING JEWELRY CO.<br />\nEdward Lockard ofjohns Hopkins. ument in the Capital City.<br />\nFidelity and Surety Bonds<br />\n* * *<br />\nThe conference sessions were held<br />\nBurglary -r and Plate Glass Insurance<br />\nManufacturers<br />\nin Remsen Hall. On Friday evening, Oregon State College has a footthe delegates were welcomed on be- ball novelty on hand thiS season it<br />\nBALTIMORE BRANCH OFFICE<br />\nGreek Letter Fraternity Jewelry<br />\nhalf of the University by Dr. John the pers'on of a barefooted kicker<br />\nGROUND FLOOR, FIDELITY BLDG.<br />\nC. French, Librarian.<br />\n(not related to the-barefoot boy).<br />\nPhone PLaza 0800<br />\nCHARLES STREET<br />\nD. C. HANDY, Manager<br />\nNORTH<br />\n314<br />\nHe is a half back who learned his<br />\nKellog Pact Is Praised<br />\nThe outlook for peace is distinct- football in Hawaii, where he became<br />\nly greater for that great pact,\" said xtremely proficient in the art of,<br />\nDr. Eddy at the opening session spiraling a punt down the field, tinwhen referring to the Kellogg- der the efficient propulsion of hi<br />\nBriand Treaty. Along with the bare foot. Indeed, this prodigy<br />\nLeague of Nations and the Locarno says he cannot secure satisfactory<br />\ntreaties he classed it as one of the results with his feet shod in the<br />\ngreat milestones of peace since the conventional regulation shoe. The<br />\n,war and declared that European coach is searching' now for a pair<br />\n('.5. Ill 14.2..,,IDES<br />\nstatesmen were impressed with it of shoes which this phenomenon<br />\n1.1,<br />\nV. D. LANDON<br />\n.Trun3 muter,<br />\nRadio<br />\ndespite its, reservations and -limita- may slip off.and on quiokly at will.<br />\nSouth htkota<br />\nDotroUt Junior<br />\n1.4 Mules,'24<br />\nollege, '22<br />\ntions. The significance of this treaty for the Oregon State mentor does<br />\nis threefold, it brings America back not want to risk his half back's un;<br />\ninto the international arena; it will shod feet in a scrimmage And inforce us to take dip logical \"neat tends that he should wear the boots<br />\nFront of the weeingh.mse radio cull,<br />\nsteps\"; and it takes secret,diplomacy when not kicking.<br />\n*<br />\n*<br />\n*<br />\nt3<br />\nit<br />\ngives<br />\nfrom the diplomats and<br />\nAn odd traditional combat', termthe people.<br />\nAN. I;errs<br />\ned the cane spree, which is practiMuuolini a War Menace<br />\nDesign of<br />\nTransmitters<br />\nIn the realm of world economics cally the only survival of freshmanniveruI,Y of<br />\nurgh,'27<br />\nis<br />\nPrinceton,<br />\nat<br />\nrivalry<br />\nsophomore<br />\nrich,the<br />\ntoday<br />\nStates,<br />\nUnited<br />\nthe<br />\nest nation on earth and chief gainer yet maintained at That institution<br />\nby the gar, should help the weaker The contest, is taken seriously and<br />\n.nations rather than present insistent three-man teams:are tutored by up,<br />\nweeks in.<br />\ndemands for payment of war debts. per classmen for severid<br />\npreparation.. All of the bouts are<br />\n\"although<br />\nDr. Eddy predicted that,<br />\nnine minutes in :length unless one<br />\nthe Dawes plan saved Germany and of the contestants succeeds in<br />\n0. B. G1JN RV<br />\nbreak<br />\nwill<br />\nit<br />\nEurope,<br />\nstabilized<br />\nwrenching the stick or \"cane\" front<br />\nPhoto5Z::::7iirision<br />\n,Dy,intion,'27<br />\ndown next year because Germany his opponent before that-time. If<br />\nwill not or will not be able to meet the \"cline\" is still in possession of<br />\nboth, however, at the., expiration of<br />\npayment. There- is not the will_Lo<br />\nthe nine minutes,.there is a short<br />\npay in France and Germany or on<br />\nrest period after Which the two rethe rest of the Continent bf Europe. engage until one or thc other wins<br />\nThey do ni3t believe that it is a just, out.<br />\n_<br />\n*<br />\n•<br />\n_<br />\nmoral obligation.\"..<br />\nJOHN COLEMAN<br />\n\"One of the primary purposes of<br />\nThe outlook for democracy in<br />\nRadio Endineer<br />\nH. I. IQ 1 If<br />\na college course,\" says Dean HewC.:anegic luititute,<br />\nON RECENT WESTINGHOUSE JOBS<br />\n1.,:rioprnent Engo neer<br />\noi echnolugy. '23<br />\n.Europe is very dark at. present:<br />\nfuvernity<br />\nitt of Williamette University, \"is<br />\nl'aohorgh. -26<br />\nOver half of that Continent is- now the finding 'Of a mate. People are<br />\nunder. dictatorships, of which Italy. irklined,to laugh at.a girl who goes<br />\nand Russia are the outstanding ex- to college only to find a beau, but<br />\namples. In the former Mussolini she is rather to be admired for her<br />\nis worse than Napoleon ; a greater purpose.\" (Which is rather a radand ical stand for any college dean.)<br />\nwar menace than Wilhelni'.<br />\nthe chief danger to the peace of Anyho‘V these remarks were utterOn the U. S. Navy Airplane signed, built, and , installed<br />\nWhere do young college men get in a large<br />\nEurope to-day. \"Mussolini has ed during a discussion of the quesindustrial. 4rganizaticn? Have they<br />\nCarriers \"Lexington” and \"Sara- Westinghouse<br />\nthe or,.zanizadone much for Italy but at the cost tion \"Why GO to College?\" at a<br />\nopportunity to exercise creative talent?<br />\ntoga\" the situation is met with tion which in i 920 established<br />\nof the liberties of 42,000,000 two- student meeting .of Williamette.<br />\n•<br />\nIs individual work recognized?<br />\ncrystal control transmitters de- KDKA, the pioneer radio broad* * *<br />\nple.\" In Russia the denial of libsigned to send on different wave, casting station of the world, and<br />\nA number of interesting facts<br />\nerty, atheism, and reliance on force<br />\ncarriers area re- lengths. Each plane's receiving Which also operatesstations KF K<br />\nare-the objectionable factors. To be concerning American 'colleges and<br />\nX,<br />\ncommended, there is the passion of universities are revealed in the recent development in naval set has its own wave length. A<br />\nKYW, WHZ, and W FIZA.<br />\nCommunism for sharing and the cent -Educational Directory putihistory—and they . haye a com- turn of the dial on the transmitI<br />\nf<br />\nlislied by the Bureau of Education.<br />\nlack of race prejudice.<br />\nmunication problem that calls for ter selects the wave length cor- Opportunities to do the historyColumbia is recognized as the<br />\nStudents Are Docile Minded<br />\nthe engineering resources of an responding to that of the plane making things in engineering fall<br />\nAs to American schools and col- largest university in the country,<br />\nnaturally to an organization with a<br />\norganization which has shown it to be reached with ajnessage'<br />\n'leges, Dr. Eddy said, \"I would class with 35,000 students and 1,500<br />\nrecord for making history in its field.<br />\n_an make radio history.<br />\nthis country as rifmincing the most teachers. Buena Vita College is<br />\nRadio equipinent on the \"Lex- And<br />\nWestinghouse,quite as naturally,<br />\ndocile minds in the world.\" In our the smallest with 21 students and<br />\nComplex maneuvers are di- ington\" and \"Saratoga\" was de- offers powc+,-.1<br />\natt,atioos to -!.thi-ise<br />\ninter-racial relatkons we are suffer- 16 faculty members. Howard is the<br />\ncc:mei, scouting ex---------/young college men<br />\ning more Iront race prejudice than oldest university, having been<br />\n„clitions controlled,<br />\nw nose initiative and<br />\nany other country in the world.\" -founded in 1636. William and<br />\nand far-tlyingaplanes<br />\nenterprise<br />\nfit them for<br />\nIn regard..to our great social prob- Mary College and Yale rank second<br />\nrecalled—by radio.<br />\nhistory-making tasks„<br />\nlem of unemployment, \"We don't and third in this respect, having<br />\nknow how many are unemployed be- been established in,1693 and<br />\n1701,<br />\ncause we don't care.\"<br />\nrespectively.<br /><br />\nCACF.<br /><br />\n(Bir<br />\nST.<br />\nYour 7<br /><br />\nSchool<br />\nUnex<br />\nMall<br /><br />\nG NN,<br />\nOrch<br /><br />\n19,<br /><br />\nTI-<br /><br />\nNewspa<br />\nBooks<br /><br />\nTh<br />\nPri<br /><br />\n150(<br /><br />\nCol<br /><br />\nIn sty<br />\nequal th<br />\nproduced<br /><br />\nAnd t<br /><br />\nYOUNGER COLLEGE MEN<br /><br />\nRadio Directs the Navy's Flyers &gt; &gt;<br /><br />\n11<br /><br />\nNEN<br /><br />\n•<br /><br />\nAIRPLAN<br /><br />\nestinghouse<br /><br />\nSuits<br /><br />\n$2<br /><br />\nWe<br />\nasso<br />\nin sl<br />\nvisi<br />\nherr<br /><br />\nDc<br /><br />\nCandi<br /><br />\nTA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1928<br />\n\"NEVER GO BACK\"<br /><br />\nPhone HOmewood 7908<br />\ns<br />\n'<br />\nCBirely<br /><br />\nPharmacy'<br /><br />\nST. PAUL at 33rd STREET<br /><br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br />\n_<br /><br />\nCOMMUNITY IN14<br /><br />\nPresident Dukehart of the,<br />\nClass of '32, announced today that there would be a<br />\nmeeting of. his class in the<br />\nC. E. Hall on Thursday following the Assembly. Donald Hiss, president of the<br />\nfudent Louncil,. will address the class at the gathering.. There will be no excuses accepted for absence.<br /><br />\nGWYNN LEASE<br /><br />\nOrchestras of Distinction<br /><br />\nGEORGE BOAS<br /><br />\nFRESHMEN CLASS TO<br />\nMEET ON THURSDAY<br /><br />\nSPEAKING<br /><br />\nOn the wall of a room in the<br />\nMemorial Hall there hangs a poem<br />\nby Margaret Johnston Graftlin<br />\nwhich the editor of this column believes is worth your attention.<br /><br />\nThe first novel of our own Dr.<br />\nBoas is not, we regret to predict,<br />\ndestined to be the long awaitea<br />\nepic of American college faculty<br />\nlife. For that it is too sketchy,<br />\nits length insufficient, its characters too few, the attention given<br />\nto yctra-collegiate _events_ too<br />\ngreat.<br />\nBut it is—and this 'may be<br />\nmore important—very delightful<br />\nreading-for'Ode who has had experience with college faculties,<br />\nand who is therefore anxious to<br />\nlook behind the scenes of their<br />\nacademic existence. This view<br />\nthe author, with quite shameless<br />\ncandor and quite biting sarcasm,<br />\nproceeds to give.<br />\nFrancis Harper, who is the author himself without doubt, is ,<br />\ncalled to Oralia University, in<br />\nCalifornia, as an instructor in<br />\nEnglish. 4'here, as a witty but<br />\nnot brilliant man of ready sallies<br />\nand few ideas, Harper is well received by his,fellow instructors,<br />\ninvited to their teas, their musicales, and their bickerings, all of<br />\nwhich are, of course, very informal.<br />\nWith his characters in these<br />\neasy attitudes, Dr. Boas begins<br />\nwith masterful strokes of satire<br />\nand really good bits of dialogue<br />\nto expose their souls. Here the<br />\nauthor reaches his greatest<br />\nheights, for character portrayal,<br />\nas those who have taken his<br />\ncourses here know, is his true<br />\nforte, as the satirical is his most<br />\nfluent farm of discourse. Calmly,<br />\nrelentlessly as a surgeon, the author dissects Harper and his<br />\nfriends, shows the. reader what<br />\nmanner of men'they afF,-changes<br />\nsome, sekvs -them tip again, and<br />\nsets them to work as they will.<br /><br />\nfr'unn-BMI<br />\nanide-gashionedatfords<br />\nTagselfassuranc,e and confidence that<br />\ncorrect clothes and correct foot gear<br />\ngive are as vital for success in college<br />\nas in the business world. Nunn-Bush<br />\nAnkle-Fashioned Oxfords are built<br />\nthe ankle as well as thefoot-no gapping, no slipping at the heel.<br />\nT<br /><br />\nC<br /><br />\n,<br /><br />\nUIrYaffor<br /><br />\nCollar Hug Clothes<br />\nBoit/more on, v.5enysfreea<br /><br />\nThis is what it says:<br />\n1156<br />\nThe Whitehall<br />\nimponed Black<br />\nTO MY SON<br />\nScotch Grab*.<br />\nDo you know that your soul<br />\nPhone Gamor 6886<br />\nIs of my soul such part<br />\n-79kat you seem to be fibre<br />\nF.<br />\nAfid core of my heart?'<br />\nSOUTHERN<br />\nTHE<br />\nlane other can. pain me<br />\nAs you, dear, can do;<br />\nHOTEL<br />\nBaltimore's Newest<br />\nNone other can please one<br />\nand Finest :-:<br />\nOr praise one as you.<br />\n\"A Hotel of Atmosphere<br />\n'The fact that there will be no<br />\n6<br />\nRemember the world<br />\nand, environment\"<br />\nArmy-Navy football game this year<br />\njgjllr be. quick' with its blame<br />\nis lamented by many football fans in<br />\nIf shadozb or stain<br />\nview of the excellent showing Navy<br />\nCommercial<br />\nNewspapers<br />\nEver darken your name.<br />\nWork<br />\nBooks<br />\nhas made in its recent games. How\"Like mother, like son,\"<br />\nEstablished 1880<br />\never, elegibility rules present a great<br />\nIs a saying sp true,<br />\nproblem to all colleges at this time.<br />\nThe world will judge largely<br />\nThomas Fe Evans<br />\nthree year rule at Hopkins, in<br />\nOf mother by you.<br />\nPrinting Company • view of.the new plan, would bring<br />\nBe yours then the task,<br />\nathletics to a quick end. However,<br />\n1506-15J8 Guiltord Avenue<br />\nIf task it shall be,<br />\nat larger colleges, it is maintained<br />\nTo force the proud world<br />\nBaltimore, Md.<br />\nthat this is the only fair system.<br />\nTo do lutinage to me.<br />\nThere is truth in this belief, but<br />\nPhone VErnon 1691<br />\nBe sure it will say,<br />\nwould these colleges rather have no<br />\nWhen its verdict you've won,<br />\ncontests With less fortunate insti\"She reaped as she sowed,<br />\nto<br />\ntutiOns, or will they be willing<br />\nFlat Tire<br />\n\"Lo, this is her son.\"<br />\nmake certain concessions.<br />\nCall Barry<br />\nSentimental, of course; poetry,<br />\nVernon 4183<br />\nbut in those .anapestic<br />\nThis problem will . be discussed scarcely;<br />\ncouplets (they are written as'quatHOOD TIRES<br />\nagain before the St. Jcihn:s game.<br />\nrains here to fit the width of the<br />\n\"We -•Hurry\"<br />\nThe question this time is the transcolumn) . there is. contained , much<br />\nfer rule._ Thompson _anct._Smith,<br />\nthat is basic-in family existence as<br />\n-two of the stars of the 'Annapolis<br />\nwe know it.<br />\nteam,' are transfers. ThompSon,<br />\nTheir work if interrupted by<br />\n' It is important, sometimes, in the<br />\ncoming front Swarthmore, is A•<br />\ndetached existence on Dorm resi- the war, in which Harper serves<br />\nviodsly not eligible, according to the<br />\nERE'S a good busi- much neater and more<br />\nof in France as a lieutenant. Overreminder<br />\na<br />\nsuch<br />\nhave<br />\nto<br />\ndents<br />\nrule which states, \"No man shall be<br />\nness proposition! Invest business-like they look<br />\nthe ties of family. It may keep a seas, of course, his character<br />\neligible during his first year of resin<br />\na Remington Portable when typewritten!<br />\nOrback<br />\nto<br />\nname.<br />\ngoes<br />\nchanges, but he<br />\nshadow from the family<br />\nidence after transferring from a deand reap dividends in the Examine the Remington<br />\nbelieving he can resume the<br />\nha<br />\nthings<br />\ntangible<br />\nmore<br />\nto<br />\nTurning<br />\nlowever,<br />\nI<br />\ngree conferring college.\"<br />\nform of bigger and better Portable. It is the smallest,<br />\nold life where he had left off. But<br />\nNavy does not 'confer any degree,' and more immediate needs, we -find<br />\nrest at night.<br />\nlightest, most compact and<br />\nhis friends,<br />\nnaturally<br />\nfor<br />\ncan't,<br />\nhe<br />\nrea<br />\nin<br />\npropounded<br />\nquestion<br />\nthis<br />\n'therefore Smith is eligible. This exMuch faster than writing most dependable portable<br />\ncannot<br />\nThey<br />\nchanged.<br />\nhave<br />\ntoo,<br />\n\"is<br />\nit<br />\nasked,<br />\nis<br />\n\"Why,\"<br />\n-letter.<br />\ncent<br />\nample shows excellently the injusby hand, this little Rem- with standard keyboard.<br />\nit that there were-grapefruit,. or appreciate the new standards Of<br />\ntices incurred by such rules.<br />\nenables you to fin- (Carrying case only 4<br />\nington<br />\ncannot<br />\nhe<br />\nlieutenant,<br />\nformer<br />\nthe<br />\ngradand<br />\nfaculty<br />\nthe<br />\non<br />\ngrapefruits,<br />\nlong reports or inches high. Weighs 8%<br />\nyour<br />\nish<br />\nworshiped<br />\nonce<br />\nhe<br />\nthat<br />\nbelieve<br />\nsuggestbeen<br />\nmorning<br />\nhave<br />\none<br />\nmethods<br />\ntables<br />\nMany<br />\nuate students'<br />\nfall asleep try- pounds, net.)<br />\ntheses—not<br />\ndisthis<br />\non<br />\nand<br />\ngods,<br />\ntribal<br />\nStadium<br />\ntheir<br />\nMunicipal<br />\nwhile the other taxpayep had to becd for filling the<br />\nfinish<br />\nthem. Not Monthly payments.<br />\nto<br />\ning<br />\nends.<br />\ntale<br />\ngames.<br />\nthe<br />\nnote<br />\ngin the day under the tremendous cordant<br />\nfor all the large football<br />\nLeader—in Sales<br />\nonly that, but think how The Recognized<br />\nIn style and quality \"Bostonians\" 'rho policy of letting sc oo i<br />\n-handicap of prunes?\"<br />\nand Popularity.<br />\nAs a work of characterization,<br />\nequal the most, expensive footwear in free to fill the empty seats is one<br />\nIf we were good enough to an- \"Never Go Back\" is in places unproduced today.<br />\nof the latest. This is a noble idea, swer this one, we wouldn't, because usually good, although the author<br />\nchil- then we would • have been entitled is somewhat less satisfactory in<br />\nAnd the saving is a big item. but just how much would these<br />\ndren get out of a football game to a seat at the graduates' table.<br />\nhis very difficult work of describWould it not be wiser to graduate DR. OLIVER AT ASSEMBLY ing himself. It is not for us to<br />\nMostly $7.50 to $10<br />\nthe prices of the tickets from two<br />\nContinued from Page 3, Col. 1<br />\ncomment upon its accuracy, but<br />\ndollars down to fifty cents? .V diate action in case of any suspicion as an anatomical treatise certainExclusively in Baltimore<br />\ndl<br />\nthree<br />\nor<br />\nOliver<br />\ntwo<br />\nDr.<br />\npayof Mental unbalance.<br />\n'those who now<br />\nly it is stimulating.<br />\nREMINGTON RAND<br />\nlar; for sets vould be present as1 mentioned that _six murders right<br />\nstudent<br />\nBUSINESS<br />\nman,<br />\nSERVICE, INC.,<br />\ncollege,<br />\nFor<br />\nthe<br />\nable<br />\nhere in Baltimore might have. been<br />\nwell as those interested-hut not<br />\n130 W. Fayette Street<br />\nor instructor, who does not mind<br />\nto pay -ttg prise, It woulk1. make' avoided if the families of the murMD.<br />\nBALTIMORE,<br />\nbeing laughed at, or stormed at,<br />\na far more colorful spectacle if all derers had reported signs of insaii:<br />\nto<br />\nnot<br />\nbook<br />\na<br />\nis<br />\nit<br />\nlampooned,<br />\nor<br />\n112 E. Baltimore Street<br />\nand had the men examined.<br />\nthe seats. were filled. At present,<br />\nbe missed.<br />\nthey are. all going to waste. This - The third case was the most disexperiment might be tried at least. agreeable, for the man was hung.<br />\nDr. Oliver feels that his life could<br />\nThere seems to be a great lack have been saved, but his case was<br />\nnumbe:<br />\nGRAYS<br />\nlarge<br />\nNEWLOXFORD<br />\nof college spirit in a<br />\ntoo radical. He was a person whom<br />\nof Hopkins students. The _sam- one would describe as being \"hardsupports and plays on boiled.\" According to Dr. Oliver<br />\nSuits Topcoats Overcoats small group<br />\nall the teams. Many others are not he was actually only \"half cooked/'<br />\nr Drink<br />\ninterested enough to help the Cage He was brought to Dr. Oliver's at$28.75 - $38.75<br />\nFund -with any contribution what- tention first after stealing an auto<br />\n1<br />\nsoever. This fund will aid all the in Baltimore at the age of eighteen.<br />\nWe just :received a new<br />\nmen on the Campus, not only He refused to converse but acted<br />\nDelicious and Refreshin<br />\nIn<br />\nassortment of Oxford Grays<br />\nthose athletically inclined.<br />\nthe \"wise guy.\" He was given two<br />\nathstar<br />\nfor<br />\nnot<br />\nis<br />\nreally<br />\nfact, it<br />\nin shadow striped, slightly<br />\nyears, \\freed and then after stealing<br />\nletes. It is to be used by all, prin- another car was sentenced to ten<br />\nvisible overplaids and'<br />\nparticipate<br />\nnot<br />\ncipally those who do<br />\nyears. He was still the \"know it<br />\nherringbone effects.<br />\n\"Ever precise in<br />\nin athletics but need some kind of all\" and refused to listen to any<br />\nphysical exercise. But again, it is \"nut\" doctors as he termed them.<br />\npromise keeping\"<br />\nDo not fail to see them<br />\nthe same group who support the He tried to escape from jail later,<br />\nThe point of Lucius remark is<br />\ncaution Money vouchers uceRi;d<br />\nCage Fund. Something is wrong killed a guard and was sentenced to<br />\nnot what hc said it about, but<br />\nwhat he said. It surely describes<br />\nwith the student body!<br />\nbe hung. He refused right up to<br />\n..41risr•<br />\nCoca-Cola, for consider these<br />\nNext Saturday St. John's will the end to even concede a pleasant<br />\nfacts:<br />\nbring the best team it has enjoyed word to Dr. Oliver, who continued<br />\nWILLARD<br />\nPure as Sunlight<br />\nin years to Homewood to try to to interview him. It is this type, it<br />\nAnd the proof of its purity is in<br />\nCORP.<br />\nTAILORING<br />\ndiscourages<br />\nthat<br />\nout,<br />\nbrought<br />\nwas<br />\nThe<br />\n1916.<br />\nsince<br />\nvictory<br />\nfirst<br />\ngain its<br />\nthe testing. Twenty-two scientific<br />\nFAYFTTF Si. AT HANOVIR<br />\ntests, catering every step in its<br />\n,ild rivalry with St. John's has fall- criminologists. This is the unmanly<br />\nFIRST FLOOR<br />\nwith<br />\nsafeguard this pure<br />\nreckoned<br />\nbe<br />\npreparation,<br />\ncannot<br />\nwhich<br />\ntype<br />\nyears<br />\nfew<br />\nlast<br />\nen off some in the<br />\ndrink of naturalflavors.<br />\nBy means of these three cases.<br />\nbut it should be revived this year<br />\nEASIIHE<br />\nFOR<br />\nMEASURE<br />\nCigarettes<br />\nClub Lounge<br />\nDu Coca-Co, Compaoy.Arlaat, Ga.<br />\n,CN<br />\nAet I, Scrim 2<br />\nas both teams are of about the same Dr. Oliver showed that each man<br />\nFree Phone<br />\ncalibre and a close fight is antici- has his lesson, and is reckoned with<br />\n8 million a day — T HAD TO BE GOOD TO GET WHERE IT Is<br />\nin different ways.<br />\npated.<br />\n1944 EDMONDSON AVENUE<br /><br />\nOF<br /><br />\n---Cs<br /><br />\nis<br /><br />\nBosioNLANSI<br />\nShoes 1<br />\nfor<br />\nMen<br /><br />\nless burning<br /><br />\nofthe midnight<br /><br />\noil/<br /><br />\nH<br /><br />\nCollege Men!<br /><br />\nRemington<br />\nPortable<br /><br />\nBOS-TONIAN SHOE STORE<br /><br />\nWhat Shakespear<br />\nsays about Coca-Co<br /><br />\n13, 1928<br />\nTHE JOHNS HOPKINS NPIWS-LEITER, NOVEMBER<br /><br />\n6<br /><br />\nGREAT FEAR PERMEATES NEWS-.<br />\nLETTER OFFICE ON JINX DAY<br />\n4.<br />\n,410<br />\n416<br /><br />\nWe've Graduated--<br /><br />\nI<br />\ntrawzmar.<br />\nVrne<br />\n••,<br /><br />\nto Finer ClutyLike<br />\n/<br /><br />\nNew Showrooms!<br /><br />\nAND CORDIALLY NVITE YOU TO VIEW THIS<br />\nSPLENDID NEW HOME - - OUR DISTINGUISHED<br />\nFALL STYLE VARIATIONS • - AND OUR NEW<br />\nAUTUMN FABRICS BY EMINENT WEAVERS • • •<br /><br />\nJustly<br />\nFamous'.<br /><br />\nCLOTHES FOR COLLEGE MEN<br /><br />\nFOUR NORTH HOWARD STREET<br />\nSecond and Third Floors<br /><br />\n==<br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br /><br />\nJ. A. RITTER 6? SON<br />\nflorists and Decorators<br />\nBALTIMORE, MD.<br /><br />\n1918 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br />\nDRESS SETS<br />\nfor evening wear.<br />\n'7 and 9 East IPOtimore Street<br /><br />\nProducers of - -<br /><br />\ncITIE JOHITS:HOPEERS<br />\nHEWS—LEGITEE<br /><br />\nFear dominates the publication of- struction of the printer's plant to<br />\nIf<br />\nfice and floods the editors' hearts. the misplacement of a comma.<br />\nNot for any of the usual reasons we could only be sure it would be<br />\ndo these conditions exist. Ordinar- no more than the latter, ,but who<br />\nily the sight of an editor feverishly are NEWS-LETTER editors to predict<br />\nrunning his hand through his hair, the Fates?<br />\nsing his pencil among its tangles, This singular coincidence is not<br />\nand consequently holding up the is- carried So far as it 'conceivably<br />\nsue while the entire staff joins in might be. For instance, the issue<br />\nthe search, means nothing more nor could have containedL thirteen colless than that there are twelve col- umns of news, or there might have<br />\numns to fill with only eight columns been thirteen members of the staff.<br />\nof copy, that the cut for the Ches- Nevertheless, there may be reason<br />\nterfield ad has net been received, for hope. Last year's thirteenth<br />\nand that a freshman candidate has number brought news of the frabeen thrown out of all the offices on ternities pledging ninety-five men<br />\nthe campus without getting a line of ,and Hopkins' decisive victory over<br />\nnews. This time, however, the St. John's. Maybe the jinx will<br />\ncause of editorial uneasiness super- cast favorable auspices on the Cocedes these comparative trivialities lumbia game.<br />\nand plunge's into the realm of the<br />\nmystic and the supernatural. The<br />\nWork On Foundation Of<br />\njinx is at work!<br />\nOn.Friday, the most fateful day<br />\nof the week, here we sit and fear as<br />\nwe prepare copy fot the thirteenth<br />\nissq of the year, to appear‘ on the<br />\nthirteenth day of the month. Small<br />\nwonder if the paper never even appears; the dread of ill fortune is<br />\nin itself capable of working the complete disintegration of the petrified staff.<br />\nA mere Friday the thirteenth<br />\nwould be tame compared to this situation. The worries would end with<br />\nthe end of that day—but imagine<br />\nthe suspension when Friday introduces a period of killing uncertainty that ends only after toe paper<br />\nreaches the post office the following<br />\nTuesday. •Anything can happen in<br />\nthe meantime from the total de-<br /><br />\nA meeting of the Varsity<br />\nClub will be held tomorrow,<br />\nWednesday, November 14,<br />\nin the C. E. Hall at 12.20.<br />\nDow Strader wants all lettermen to be present for this<br />\nmeeting.<br /><br />\nLereriug Hall Begun<br />\nWith the site of Levering Hall<br />\ntemporarily staked out, actual<br />\nwork on the foundation will soon<br />\nbegin. In fact, a building to be<br />\nused as combination office and<br />\ntool shed has already been constructed.<br />\n'<br /><br />\nHANDKERCHIEFS<br />\nLADIES' HOSE, UNDIES,<br />\nHOSE, TIES, HANDKERCHIEF'S<br /><br />\nMEN'S<br /><br />\nCOOKIES<br /><br />\nCANDIES<br /><br />\nJELLIES<br /><br />\nVOL. X:<br /><br />\nYou Can Buy Here for Leas<br />\nWhy Buy Elsewhere When<br /><br />\nChristmas is Near<br /><br />\nTHE COLLEGIATE SHOP<br /><br />\nSt. Jolt<br /><br />\nAnnounces its Opening on November 5th<br />\n2446<br />\nOpen<br /><br />\nN. CHARLES ST.<br /><br />\nt<br /><br />\nAlso<br /><br />\nand the boys (Hopkins) to help themselves.<br />\n• •Help the girls (Goucher)<br />\nhand-made novelties and home-made dainties<br />\nStop In to see their display of<br />\n•<br /><br />\nHERE IS THE PLAN<br /><br />\n•<br /><br />\nChristmas is almost here, why not make some extra pin money<br />\n'for a new coat, hat, etc., by bringing some homemade article to be sold<br />\nat the Goucher•Hopkins Exchange at 10% commission. Probably your<br />\nMothers and Sisters are helping you through College, therefore; why<br />\nnot have them make some candy, cakes,. or, in fact, anything. All helps<br />\nand everybody. will be out to help -Goucher and Hopkins students to<br />\nhelp themselves. Bring your articles now and remember the articles<br />\nthat are least expensive- sell the best.<br /><br />\nFast following this will be a<br />\nseven-foot fence which is to surTUTORING<br />\nround the entire building area. FIRST CHURCH OF CHRIST<br />\nAlgebra--Geometry--Trigonometry<br />\nSCIENTIST<br />\nThis fence will serve a twofold<br />\nWILLIAM H. JOLLY<br />\nBALTIMORE, MD.<br />\npurpose, as it will keep the Joose<br />\n2706 Gwynn Oak Ave,<br />\nTel. Woodlawn 276,W<br />\nannounces Free Lectures on<br />\nmaterial from scattering over the<br />\ncampus, and hinder the over-cur'<br />\nCHRISTIAN SCIENCE<br />\nous students from diverting the By Miss Margaret Murhey Glenn, C. S. B., Phone, CAI. 1380 Home—HO. 2095.J<br />\nof Boston, Mass., member of the Board of<br />\nFRANCES T. BANNON<br />\nworkers' attention by questions. Lectureship of The Mother Church, The Successor to<br />\nHARBAUGH Es' BANNON<br />\nChurch of. Christ, Scientist, in BosFirst<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nand by the worthless advice of ton, Mass., at<br />\n(Room 28)<br />\nwould-be engineering genii. YesFORD'S THEATRE<br />\nStenographic Dictation, Copying„<br />\nMultigraphing, Mimeographing<br />\nterday the top soil was removed, Thursday,'Nov. 15, 1928, at 12.10 Noon<br />\nBaltimore,. '<br />\n•<br />\nMaryland<br />\nand at<br />\nand the work of grading was be- FIRST CHUR:CH OF CHRIST, SCIENTIST<br />\n.<br />\nUniversity<br />\nParkway<br />\ngun. Several trees will necesFriday, Nov. 16, at 8.15 P. M.<br />\nFRANK'S<br />\nsarily be cut down, as the buildLight Lunch<br />\nAmplifiers will be installed in,<br />\ning extends some one hundred<br />\nSunday School room<br />\n5 W. Twenty-first St.<br />\nand eleven feet back from the The Public is Cordially invited to Attend<br />\nOpen 9.30 A. M. to Midnight<br />\nroad into the woods.<br /><br />\n-<br /><br />\nBALTIMORE. MD.<br /><br />\n- INTERIOR WOOD WORK<br /><br />\nDECORATIONS<br /><br />\n'Doubled and redoubled\"<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE'.<br />\nBALtIMORE, MD<br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nShow Rooms<br />\n343 N. Charles Streit<br /><br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto success--Opportunity waits beyond.<br /><br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND'FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nNEW LIFE FOR MOTORS<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil<br /><br />\nValue<br /><br />\nSTANDARD OIL COMPANY<br /><br />\nOF N.<br /><br />\nA leading<br /><br />\nbridge expert once said,\"The<br />\naces and kings play themselves; it's the little<br />\nspots that make games.\"<br />\nWhat's true in bridge seems equally true in<br />\nthe cigarette business. Aces to deuces, spades<br />\nto clubs—from the very first deal, Chesterfield<br />\nmade every card good!<br />\nNo risky finesses, no sharp double squeezes<br />\n— Chesterfield rose to world-wide popularity<br /><br />\nFRESE<br /><br />\nHOmewood 8680<br /><br />\nEvery Evbning<br /><br />\nTHE READ-TAYLOR CO.<br />\nAdvertising<br /><br />\nPAjAM<br />\n1<br /><br />\nby straight honest selling with a straight<br />\nhonest<br />\nproduct — an outstanding suFcess in cigarette<br />\nhistory.<br />\nSo Chesterfield can bid high. Tobacco<br />\nqttality, perfect blending, purity, mildness,<br />\nnatural<br />\nsweetness — with a hand like that, Chesterfield<br />\ncan redouble your smoking pleasure,,,and<br />\ntoday, next month, next year, keep right on<br />\nfulfilling the contract.<br /><br />\n1F1 ESTERTI ELI<br /><br />\nMILD enough for anybody.. and yei..<br />\nTHEY SATISFY<br /><br />\n1.11..GBTT az MYERS TOBACCO CO.<br /><br />\nAt sev,<br />\ntional St.<br />\nthe Barn.<br />\nticipants<br />\njamas o•<br />\nclothing.<br />\ndon this<br />\nare requo<br />\nner.<br />\nAll fr,<br />\ntend the<br />\npected tc<br />\nthe two<br />\nrequester<br /><br />\nAs is<br />\nand red<br />\nraders ai<br />\nposed of<br />\non the<br />\nIrhe f<br />\nGlittner<br />\nHere th,<br />\nthe chee<br />\ncape and<br />\ncheering<br />\non the ning will<br />\nat Nor<br />\nStreet.<br />\nwill wall<br />\nMontunt<br />\nbe made<br />\nscene of<br />\nin effigy,<br />\nwill disb<br /><br />\nMany<br />\nhave bet<br />\nof the cl<br />\nplayed<br />\nmarch.<br />\nPeen .11x<br />\nwill be<br />\nfew oth<br />\nduring •<br />\nancient •<br />\nwill co-ff<br />\nThe-old<br />\na.,ftaw!.<br />\nfor seve<br />\nof mare'<br />\nsiphonsr<br />\nFreslinir<br />\nbu<br />\nown risl<br /><br />\nThe S<br />\nunite ph<br />\nwho do<br />\nthe an<br />\ntags on<br />\nthem IV<br />\nnesday<br />\nbe distr<br />\nman wh<br />\nnightshi<br />\ntwo flat•<br />\now, ft,<br />\nrade fr<br />\nuleh( 5111<br />\nto h<br />\nform • o<br />\no'clock<br />\nhave no<br />\nbefore 1<br />\npropriat<br />\nted.<br /><br />\nThe<br />\nall men<br />\nrade WI<br />\nwill be<br />\nA bonfi<br />\nin defer<br />\nment.<br />\nSt. Jc<br />\nive'at Iorated t<br />\nHalt*ar<br />\ninsignia<br /><br />"}], "field_media_file": [{"target_id": 38304, "display": null, "description": null, "target_type": "file", "target_uuid": "4c245397-7a2e-4ac1-9924-e240eeedc463", "url": "http://digital.library.jhu.edu/system/files/2022-03/13341-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13341, "target_type": "node", "target_uuid": "da75161c-d931-44eb-b24f-d244441d261d", "url": "/node/13341"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9b691644-8b35-4e6a-bb23-435cbec26cf2"}]}