{"mid": [{"value": 37361}], "uuid": [{"value": "ba55d1ac-68df-4f30-a5e7-711b94339592"}], "vid": [{"value": 37361}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:04:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13315-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:04:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:04:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXII, No. 45<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 30, 1928<br />\n<br />\nVARSITY CLUB TO<br />\nHOLD SMOKER<br />\nPrep Stars to be Entertained at<br />\nBarn Tomorrow Night<br />\nLARGE<br />\n<br />\nCROWD<br />\n<br />\nINVITED<br />\n<br />\nDAVID KAUFMAN TO<br />\nBE MARRIED JUNE 21<br />\nDavid Kaufman' 28, has announced his engagement to<br />\nMiss Rose Levinson, daughter<br />\nof Mr. and Mrs. Morris Levinson of this city. The date<br />\nof the wedding has been set<br />\nfor June 21, and the couple<br />\nwill leave for Europe on June<br />\n23.<br />\nKaufman is treasurer of his<br />\nclass, chairman of the Varsity<br />\nClub, and varsity guard in<br />\nboth basketball and football.<br />\nHe is also a member of Omicron Delta Kappa.<br />\n<br />\nHOPKINS MEN ISSUE<br />\nFOUR NEW BOOKS<br />\nHopkins Press Prints Volumes<br />\nWritten By J. H. U.<br />\nProfessors<br />\n<br />\nFINAL HULLABALOO<br />\nPAYMENT DUE SOON<br />\nAll students, fraternities,<br />\nor activities, owing the Hullabaloo for individual or group<br />\nphotos and printing, must<br />\nmake final payment no later<br />\nthan Monday, Tuesday, Wednesday, April 2, 3 and 4, at<br />\nthe Hullabaloo office or to Mr.<br />\nMeyers, at the Post-office.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBANQUET SEASON<br />\nIN FULL SWING<br />\nStudent Council Puts Damper<br />\nOn Fresh-Soph Struggles<br />\n<br />\nFour new books by Johns HopSOPHS BANQUET MONDAY<br />\nkins men have been printed by the<br />\nJohns Hopkins Press. Dr. Johannes<br />\nSwindell, Leibensperger, and<br />\nFreshmen to Dine Tomorrow<br />\nAbsolutely nothing will be<br />\nMattern, assistant librarian, has<br />\nCoaches to Speak<br />\nat Hopkins Apartments<br />\nHullabaloo<br />\ninserted<br />\nthat<br />\nthe<br />\nin<br />\nwritten a book entitled \"Concepts of<br />\nhas not been paid for in full<br />\nState, Sovereignty and International<br />\nby the above specified dates.<br />\nLaw\" which is dedicated to ProPrep 'school stars will be the<br />\nFreshmen and sophomores will<br />\nfessor<br />\nWilloughby.<br />\nW.<br />\nDr.<br />\nW.<br />\nguests of the Varsity Club at a<br />\neat their banquet unmolested by<br />\nMattern has been doing research<br />\nTo Sell June Week<br />\nsmoker to be held at the Barn, at<br />\neach other in accordance with the<br />\nwork in the field of new European<br />\naffair,<br />\ntomorrow.<br />\nThe<br />\n8:00 P. M.<br />\nTags After Easter latest ruling of the Student Council.<br />\nconstitutions, particularly that of<br />\nBridge Tournament<br />\nGermany. The above book was<br />\nan annual one, is held in order to<br />\nsold dur- The freshmen banquet is at the HopIn Second Round originally intended as introductory June Week tags will be<br />\ninterest the seniors of the various<br />\ning the week after the Easter holi- kins apartments tomorrow night at<br />\nFraternities will swing into the to Dr. Mattern's \"Principles of the days, according to David Kaufman, 7:30 while<br />\nhigh schools in Hopkins activities<br />\nthe sophomores will dine<br />\nsecond<br />\nround of the interfraternity Constitutional Jurisprudence of the member of the June Week Commitand consequently in Hopkins. The<br />\nthis<br />\ncoming<br />\nMonday at the same<br />\nbridge tournament the first of this German National Republic.\" Howidea was conceived last year by J. week. Alpha Tan Omega and Kap- ever, during Professor Willoughby'p tee.<br />\ntime. According to the new decree<br />\nFurther plans for this year's June<br />\nAlbert Abraham, and _has been pa Sigma still maintain the lead as absence, Dr. Mattern presented this<br />\nall hostilities of the classes shall<br />\nWeek have not been definitely made,<br />\nbacked up both years by.0. D. K. a result of their victories in the first introduction as a course of lectures; but several topics are under consid- cease two hours before the hour of<br />\nOver one hundred students have round matches. All matches in the the students attending these lectures eration. These will be settled next the banquet.<br />\nfirst round have been played, and prevailed upon the author to expand week, according<br />\nto the report. EsSuch action was brought about by<br />\nbeen invited by different members competition<br />\nis getting keener. The and publish the material in the pres- timates have been<br />\nboth<br />\nthe<br />\nsubmitted<br />\non<br />\nthe trouble at Annapolis last<br />\nof<br />\nrepresent<br />\nall<br />\nThey<br />\nclub.<br />\nof the<br />\nsecond round should be over by the ent book.<br />\n• orchestra, favors, and programs,<br />\nyear<br />\nand<br />\nbut<br />\nother considerations. The<br />\nthe important schools of the city end of the week of March 26.<br />\nIn the Johns Hopkins University as yet no one of these has been se- opinion of the campus<br />\nis divided,<br />\nand vicinity, each school having<br />\nShould any chapter find it diffi- Studies in Historical and Political lected.<br />\nseemingly, quite equally on this new<br />\nbeen in charge of one of the mem- cult to meet another chapter on the Science, Dr. David M. Schneider<br />\nIn speaking of the favors, Kauf- proposal. On one hand many critics<br />\nspecified date, that chapter should has written \"The Workers' (Com- man stated<br />\nbers of the club.<br />\nthat four of those sub- lament the passing of the old order<br />\nplay all other games scheduled, and munist) Party and American Trade mitted<br />\nhave been selected from the in which it was customary to break<br />\nHonorary Guests<br />\nat a convenient time afterward meet Unions.\" The monograph contains<br />\n150 which were under consideration. quite a number of noses, while othThere have also been asked about any chapter which it has failed to a history and discussion of such One from these four will be se- ers call the attendance at the class<br />\nunions as the machinists and mine lected<br />\nfifty honorary guests, including meet previously.<br />\nnext week. The orchestra rush to mind and cite also the exworkers,<br />\nthe material for which was and<br />\nThe<br />\npairings<br />\nfor<br />\nthe<br />\nsecond<br />\nround<br />\nPresident Goodnow and Dean<br />\nprogram will also be singled out pense saved as points in favor of the<br />\nof the tournament between the collected during the author's study- at this meeting,<br />\nalthough the pro- Council's ruling.<br />\nAmes. All members of the basket- Greeks were<br />\nannounced. The ing in the Economic Seminary here. gram has practically been picked.<br />\nA vote taken at a meeting of the<br />\nball team that are not in the club games include:<br />\n\"Notes of Malthus' Principles of<br />\nThe<br />\nfreshman<br />\ncommittee<br />\nwishes<br />\nto<br />\nkeep<br />\nthe<br />\nclass recently showed that<br />\nare also invited. Others invited are<br />\nBeta Theta Pi vs. Delta Phi.<br />\nPolitical Economy\" by David Ri- budget as large as that of last year the first year men were evenly<br />\ndiPhi Gamma Delta vs. Kappa cardo is the title of a book edited and eliminate chances of deficit<br />\n\"Bill\" Hudginns, President of the<br />\na<br />\nby vided on the score. About fifty were<br />\nby Jacob H. Hollander and T. E. getting in money in advance. Last for and the same number against<br />\nAlumni Varsity Club, Alexander Sigma.<br />\nPi Kappa Chi vs. Omicron Kappa Gregory of this University. Mal- year's budget was $4,250.<br />\nRandall, Treasurer of the Alumni<br />\nThe price the new resolution.<br />\nOmicron.<br />\nthus' original book was published in of the tickets will be approximately<br />\nthe<br />\nSchmidt<br />\nof<br />\nCarl<br />\nVarsity Club;<br />\nChairmen Meet<br />\nDelta Gamma Theta vs. Alpha 1820 and has long been lost. This the same as last<br />\nyear's.<br />\nAthletic Council, Carl Levy, Tom Mu Tau.<br />\nrecovered copy is used through the<br />\nThe banquet dates and places have<br />\nOn the program, which is under<br />\nMcGill, Charley Wolpert, and I.<br />\nPhi Kappa Psi vs. Alpha Delta courtesy of a great-grandson of the consideration, one of the many been freely announced and even disPhi.<br />\nEvans Rodgers.<br />\nauthor.<br />\nfeatures is a \"Boat Ride and Swim- cussed between the chairmen of the<br />\nKappa<br />\nAlpha<br />\nvs.<br />\nAlpha<br />\nTau<br />\nProfessor Gilbert Chinard has ming Club\" afternoon.<br />\nbanquet committees of the two<br />\nThe Barn which is -to be made<br />\nOmega.<br />\nedited \"The Treaties of 1778 and<br />\nyears. First year men meet at the<br />\nin readiness this afternoon will<br />\nAlpha Kappa Phi vs. Sigma Tau Allied Documents\" which are taken<br />\nHopkins Apartments, which are just<br />\nbe decorated with black and blue Delta.<br />\nfrom the originals in the Departacross from the campus at 31st and<br />\nstreamers and with signs done by<br />\nThe Buccaneers—bye.<br />\nment of State.<br />\nTennis Season Opens St. Paul Streets, while the sophoJohn Eldridge listing the various acmores will hold their affair at the<br />\nDuring Holidays Southern<br />\nHotel.<br />\ntivities. It is requested that stu- INTELLIGENTSIA NUMBER OF JAY<br />\nKenneth<br />\nCaptain<br />\nProctor<br />\nlead<br />\nwill<br />\nThe<br />\ndents disturb nothing that is preresolution<br />\nof the Student<br />\nPRAISED AS TO ART WORK AND JOKES<br />\nthe Hopkins tennis team into action Council passed at a meeting of that<br />\npared.<br />\nThe Intelligentsia Number of the ous, the expression is generally<br />\nwith the beginning of the Easter organization at their last meeting<br />\nJay, making its presence when light. Nevertheless, we are certain holidays. Manager Polan has three Tuesday<br />\nSpeakers Announced<br />\nfollows:<br />\nthe fay is trying to remedy condi- matches listed with University of<br />\nDavid Kaufman, president of the scheduled, certainly shows a decided tions, and in taking<br />\nResolved:<br />\nAll hostilities and kidthis stand, we<br />\nClub, will act as toastmaster in the effort on the part of the \"powers have nought else to say but \"good- Virginia, Washington and Lee, and napping shall cease two hours before<br />\nVirginia Polytechnic on April 5, 6 the time of the banquet and shall<br />\nabsence of Fred. Baurenschmidt. that be\" to redeem themselves for work!\"<br />\nand<br />\n7, respectively.<br />\nnot re-commence until midnight folcustomary<br />\ntheir<br />\nlaxity. However, \"Seen From the Pit,\" a review<br />\nHe has arranged an attractive proof<br />\nThe<br />\nJay team held a practice last lowing the banquet.<br />\nour judgment must not be too se- current<br />\nplays by George Banks, is Wednesday at the Fifth Regiment<br />\ngram of speakers inlcuding:<br />\nvere—since, of late, the issues, when particularly<br />\nSophs Secretive<br />\ninformative, and shows Armory. Up to this week, practice<br />\nWalter B. Swindell, Jr.:\"My Un- they appear; are always regarded<br />\nreal thought on the part of the has been delayed on account of the<br />\nSatler Robertson is the chairman<br />\ndergraduate Days at the Univer- with interest by the student body. author. A review is not,<br />\nostensibly, holding of the Sun Tournament at of the banquet committee for the<br />\nIndeed,<br />\nwe<br />\ncommend<br />\nmust<br />\nthe Jay an easy matter, but in the above we<br />\nsity.\"<br />\nthe Armory.<br />\nfrosh. The chairman of the sophofor the arrangement of this new have a review<br />\nof quality. We feel<br />\n\"Father Bill\" Schmeisser: \"Hop- number.<br />\nIt is expected that the Homewood more class has not been divulged.<br />\ncertain that anyone reading this courts will be opened in a few days, The fees for both dinners<br />\nwill be<br />\nkins and Lacrosse.\"<br />\nIt is no easy matter to decorate page, lacking the time or money to and then the rounding<br />\nout of the the same, three dollars. The freshRe- the cover with something of an \"eye- witness the shows themselves, will team will go forward more rapidly. men<br />\nCoach Ray Van Orman:<br />\npayment may be made to<br />\nview of Athletics During the Last catching quality,\" but Don White has find it very enlightening and satisfyIn addition to the schedule al- Robert Kyle. The sophomores have<br />\nsucceded admirably in this respect. ing.<br />\nready printed in the columns of the an arrangement that one-half of the<br />\nFew Years.\"<br />\nLikewise with the rest of art work \"Books, B'Gosh,\" another<br />\npage NFWS-LETTER, a match is pending payment may be made at the present<br />\nCarroll Leibensperger:\"The Out- in this issue. The work has been<br />\ndevoted to reviews, is also well exe- with the Naval Academy.<br />\nwhile the other dollar and a half will<br />\nlook for the Lacrosse Team.\"<br />\napportioned between White, Banks, cuted. As to \"Ads\"—well, there<br />\nA list of men from whom the be taken from the caution money<br />\nare<br />\nLeonard Dalsemer:\"Non-athletic Sharretts, and the less productive enough of them, we think, or per- team will probably be picked include of the class<br />\nmembers.<br />\nmembers of the staff, in such a man- haps too many, if one must be frank. Proctor, Polan, E. Devereux, BrockActivities.\"<br />\nLively Time Promised<br />\nGeorge Darley: \"The Basketball ner as to make the issue very ef- We scarcely desire ,to see the Jay man, Leonard, Smithers, Seidel, and<br />\nfective<br />\nwith<br />\nrespect<br />\nto<br />\nits<br />\nappearSeason.\"<br />\nA lively time is promised at both<br />\nfall into that category of humorous Feingold.. These men have shown<br />\nRidgely Edwards: \"The Track ance. The smaller cuts are particu- magazines devoted to classified ad- up well in practice so far, but the banquets in spite of the absence of<br />\nlarly illustrative of the jokes record- vertisements. Why not fill the positions on the team are by no the customary roughhouse.<br />\nTeam.\"<br />\n\"Wine.<br />\ned under them. The jokes are dis- pages with more original work? At means certain and there is plenty of Women and Song\" is the motto of<br />\nEntertainment<br />\ntinctly of a higher calibre than any rate, if the present number of opportunity for men not on this list the frosh committee, which has obI. Evans Rodgers will entertain. usual — the assortment is more \"ads\" is a necessity, rather than scat- to work their way into the line-up. tained as toastmaster \"Pop\" SwinThere is also a possibility that the varied—in short, we may, without ter them promiscuously throughDevereux was first man on last dell. An eight-piece colored orchesPresident and Dean will be called any or very little effort, laugh.<br />\nout the magazine, it might be better year's freshman squad and played a tra will furnish the syncopation for<br />\non for a few words. After the<br />\nIf one has followed the editorials, to assign them a definite place. The consistently good game throughout the first year men's amusement.<br />\n, speeches there will be refreshments presumably written by the Editor- general appearance of the book will the season. Brockman, Leonard, Sophomore<br />\nplans are being kept<br />\nand music by the Blue Jay orches- in-Chief, one is impressed with the be sure to improve then—however, Feingold, and Leidel have been more in the dark<br />\nbut the Blue Jays<br />\ntra. Following this the guests will effort expended by him, in an at- the use of the salt shaker is in order, flashing fine form on Homewood<br />\nwill probably furnish the music<br />\nbe taken around the campus in order tempt to rid the campus of all its and should be used to suit the taste. courts for some time, while<br />\nSmithers while several dancers have been seto get them familiar with it.<br />\nevils. Though the thought is seriW. H. D. is a freshman.<br />\ncured.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nYES AND NO<br />\n<br />\nTHE LITTLE THEATRE<br />\nN. HOWARD ST. NEAR FRANKLIN<br />\nMotion Picture Guild Presents:<br />\n<br />\n£2.00<br />\n<br />\nSubscription<br />\n<br />\n\"POWER OF DARKNESS\" at<br />\nReverberations from a recent ar- the word. It is Gteek to them, virtue<br />\n1.45-3.45-6.00-8.00-10.00 P. M.<br />\nEntered as second-class matter December 3. 1909. at the Postotfice at ticle on the feminine sex which ap- is French, honesty is German, truth<br />\nFirst Baltimore Showing of<br />\nBaltimore. Md., under Act of Congress. November 3. 1879.<br />\npeared in these columns a short is Scandinavian, honor is Italian—<br />\nthe<br />\nCount<br />\nLYOF N. TOLSTOI'S<br />\nalong<br />\nthat<br />\nthese<br />\nechoing<br />\nthey<br />\nstill<br />\nproclaim<br />\nloudly<br />\nare<br />\nand<br />\nago<br />\nwhile<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nDRAMA<br />\nPOWERFUL<br />\nfollowing<br />\nUnited States have not joined the<br />\ncampus, it seems. The<br />\nHopkins University.<br />\nletter was received by the writer, League of Nations! Their judgment<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, who submits it for the edification of you cannot rely on; it is folly to<br />\nwith Moscow Art Theatre<br />\nHopkins University. All articles should be sent to the MANAGING EDITOR; the male undergraduates on the heed their wisdom; their taste is riPlayers<br />\nEDITOR-IN-CHIEF.<br />\nother communications to the<br />\ncampus—and for those members of diculous; their music is like the<br />\nA forceful portrayal of the struggle of<br />\nsex so ably de- croaking of a frog; their words<br />\nthe soul against passion by the world-faUniversity 0100 the short-skirted<br />\nTelephone<br />\nmous Russian writer, author of \"Anna<br />\nempty sounds; their presence intolfended below.<br />\nKarenina\" and \"Resurrection\".<br />\n\"After reading your slandering erable.<br />\nEDITORIAL DEPARTMENT<br />\nANOTHER MASTERPIECE<br />\nAnd, when they fall in love! You<br />\ncomments on girls, under an article<br />\nEditor-in-Chief<br />\n. WIENE<br />\nDirected by ROBERT<br />\nGEORGE E. BANKS, JR., '29<br />\nentitled \"Yes and No\" of March 20, might as well call out the Army,<br />\nWHO MADE \"CALIGARI\"<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nI was behooved to comment in a Navy and Marines. Heaven help<br />\nAnd Three Other Entertaining Short<br />\nGEORGE GUMP, '30<br />\nPHILIP W. NESS, '29<br />\nthe victim suffering from the erotic<br />\nsimilar fashion on boys.<br />\nSubjects<br />\nColumnist<br />\nVerily<br />\nthese<br />\nimbeciles.<br />\nof<br />\nwooings<br />\neffort<br />\nthe<br />\nLITTLE THEATRE ORCHESTRA<br />\n\"I certainly appreciate<br />\nDONALD HISS, '29<br />\nyou inspired, for it gave me an op- I say unto you, beware of the man<br />\nAssociate Editors<br />\nportunity . . . to boost our good in love!<br />\nRICHARD H. WOOD,'29<br />\nWILMER H. DRIVER, '29<br />\ncause (suffrage) along. You will<br />\nThey mock our bold display of<br />\nJunior Editors<br />\nconmy<br />\nin<br />\nwaver<br />\nnote that I did not<br />\nshapely limbs. And even so, they<br />\nE. FOSTER DOWELL,'29<br />\nLEONARD B. NOLLEY, '29<br />\nRICARD G. HUNT, '31<br />\nROBERT S. BAIRD, '30<br />\nHARWOOD F. MIILLIKAN, JR., '31<br />\nW. PuzNzira, HALL, JR.., '30<br />\nviction by calling my dissertation stand long hours on street corners<br />\nIRVING K. GORDON, '29<br />\nROBERT F. SICUTCH, JR., '30<br />\nSTEwAwr L. SMITH, '30<br />\n'Yes and No,' but emphatically arid appraising our—eyes. Yet, show<br />\nprominently christened it 'No and me the man who would dare expose<br />\nBUSINESS DEPARTMENT<br />\nhis repellent calves or his unsightly<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nAdam's Apple.<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nAnd withal, they question our suNO AND NO<br />\nJ. ROBERT MYERS, '29<br />\nGEORGE M. GLAZIER, '29<br />\n\"A Prescription\"<br />\nperior mentality, our sagacity, our<br />\nOffice Staff.<br />\nAdvertising Staff.<br />\nBoys.—What infamy the name discretion, our inherent potentialiHave you ever noticed<br />\nright after a meal<br />\nTHEODORE A. FLEISHMAN, .31.<br />\nALvirl H. Bunt, '30.<br />\nimplies! Creatures, vile creatures— ties. If they were forced to meet<br />\nHow tired and lazy<br />\nWILLIAM RAFFEL, '30.<br />\nGus BURKE, '31.<br />\nyou always feel?<br />\nto be disregarded, shunned, yea, the demands that are placed upon us<br />\nRANDOLPH ROTHCHILD, '31.<br />\nJOHN LOTZ, '30.<br />\nI'm telling you folks<br />\neven tortured. To be shunned—yes in a single week, the undertaker<br />\nit isn't a joke,<br />\nLEROY SHUGAR, '31.<br />\nA. H. MORTON, '30.<br />\nIt will freshen you up<br />\n—but how? Persistently they im- would require 'a C. P. A. to make<br />\nif you try a good smoke.<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. pose upon us their despicable con- out his income tax return. Every<br />\nBut whatever you do<br />\nthese lines you must heed,<br />\nviviality despite the feminine in- man (my apologies for belittling the<br />\nThere's a certain tobacco<br />\nof course, that you need.<br />\ngenunity employed in dodging them. word) has his own pet theory, hobby<br />\nIt's packed in a tin,<br />\nthe tin's colored blue.<br />\nThese masses of impedimenta—they or subject to expound to every girl<br />\nNot only the smoking<br />\ncanus—they<br />\nupon<br />\nhis<br />\nfor<br />\nhe meets, and that sufficies<br />\nare so dependent<br />\nbut the chewing kind too.<br />\nOf course if you never<br />\nnot dance without us, they cannot brilliancy, while she (whose mental<br />\nare bothered this way,<br />\nwill have passed. There will be no sing without us, they cannot eat scope is a barren waste with certain<br />\nJust keep the prescription<br />\nBANQUET SEASONS,<br />\nfrantic search to discover the lair of<br />\nfor some other day.<br />\n. Oh, definite bounds) must cope with the<br />\ncannot sl<br />\nPAST AND PRESENT<br />\nAsk for tobacco,<br />\nthe enemy. \"Free for all\" fights will without us, they<br />\nnonpractical,<br />\nphilosophical,<br />\nvarious<br />\nthe best that's on earth;<br />\nthese inebriated specimens—they sensical, or otherwise, topics of<br />\nbe a thing of the past.<br />\nTo shorten the story,<br />\nVEN banquet seasons, it seems,<br />\nwithout us! Dear these \"cultured savants.\" If one of<br />\njust call it \"Edgeworth.\"<br />\nThe season will certainly be safe simply cannot live<br />\nare bowing to the force of civChas. J. Butler<br />\ncountry?<br />\nfree<br />\na<br />\nyours<br />\nis<br />\nSam,<br />\nUncle<br />\npsychology,<br />\ntalks<br />\nenthusiasts<br />\nthese<br />\nilization which is sweeping through and sane but, at the same time, it will<br />\nOwensboro, Ky.<br />\nFeb. 2, 1927<br />\nthe Hopkins campus with the power be drab and uninteresting.<br />\nWe know you advocate such a she must do likewise; if another<br />\nof a hurricane and the destructivepolicy, but, Dear Uncle, why can talks religion, she must know both<br />\nness of a plague. First, the freshthe Old and New Testament; if anyou not secure the services of comman regulations slowly crumbled unother discusses science, or art or<br />\npetent officials (necessarily women) music, she must be scientist, artist<br />\nder its unseen strength, then the<br />\nExtra High Grade<br />\nto enforce this freedom about which and musician; if still another talks<br />\nvicious class battles passed away and HOOVER, THE<br />\nnow the usually colorful banquet sea- COLLEGES' CHOICE<br />\nso much is said and nothing done? books and contemporary literature,<br />\nson seems destined to become as peaceshe must have a background and enERBERT HOOVER'S decisive Must we continue to suffer, to be<br />\nful as a picnic at Druid Hill Park<br />\nChauvictory in the straw vote, con- annoyed, burdened, tormented and riched with everything from<br />\nand as lady-like as a Sunday-school ducted by the NEWS-LETTER, is being<br />\nto Shakespeare to Eliot to Shaw<br />\ncer<br />\nunappreciated by your undesirable and Mencken, and of course others<br />\nexcursion down to Tolchester.<br />\nrepeated in practically all of the other<br />\nwhy—I say, like Pope, Ibsen, Zola, etc. thrown<br />\nEven though this recent reform will colleges where the balloting is being nephews? Why, oh<br />\nA<br />\nboys!<br />\ncondithe<br />\nHang<br />\nsensible<br />\nin; if another is a bridge fiend, she<br />\nmore<br />\nheld. The Independent, the Boston<br />\nintroduce a much<br />\nonly<br />\ncan<br />\nplays<br />\nif<br />\nthe<br />\nanother<br />\nbridge;<br />\nbattlers<br />\nsponsoring<br />\nenjoy<br />\nmust<br />\nis<br />\nwhich<br />\nbanquet<br />\nmagazine<br />\nveteran<br />\ntion,<br />\nYELLOW CAB STAND<br />\nBut should I thus defame these<br />\nregard the new system with bowed nation wide election, reports that approaches to virility so earnestly, tennis, she must know her serves;<br />\nAT<br />\nif another doesn't want to indulge<br />\nheads and tear-stained eyes. Never throughout the nation Mr. Hoover<br />\nthe<br />\nof<br />\nside<br />\ncredit<br />\nthe<br />\nwithout noting<br />\nHOMEWOOD FIELD<br />\nin athletics, play cards or talk,<br />\nagain will the oaken tolackjack of an is the favorite with college students<br />\nthe ledger, or admitting that even hat well—she must comply anyway.<br />\nFrom<br />\nmembers.<br />\nfaculty<br />\nand<br />\nagainst<br />\nresound<br />\npoliceman<br />\nAnnapolis<br />\nNo Charge for Extra Passengers<br />\ngirls up at Wellesley, he received<br />\nthe cranium of an obstinate tussler. almost twice as many votes as all the racks serve some purpose—and then And yet we must laud the \"gallant<br />\n'PHONE<br />\nNever again will the delightful sound other candidates combined. Even in when a hat rack has a pocket book, garcons\" for their wonderful traits,<br />\ntable<br />\nwhile<br />\netc.,<br />\netc.<br />\nambitions, courage,<br />\nVERNON 1212<br />\nof crashing dishes and ripping<br />\nthe wild cactus covered plains of Ari- well—But I say, Hang the boys!<br />\nwe<br />\ncloths be heard among the clang and zona, he remains the outstanding canFORA<br />\n•<br />\nManly statures, crushing lips,<br />\nAnd what rapturous moments are<br />\nclatter of a banquet battle. Never didate among the students of that<br />\nYELLOW CAB<br />\nHeculean arms, whispers of sweet impelled by the names—Adolph,<br />\nagain will gluttonous diners be de- state.<br />\nnothings—can we resist? And the Lancelot, Jurgen. What vows of<br />\nlighted by the sight of their rivals'<br />\nCollege students, apparently realize next morning my best girl friend re- devotion, what burning desires, There is a place for you<br />\npresident, sitting manacled in their<br />\nMr. Hoover's ability as an adminisin the Dental Profession<br />\nwhat bliss, these names recall. How<br />\nmidst.<br />\ncites verbatim the ardent music that<br />\nNever before have there been such<br />\nthe<br />\nDuring<br />\nman.<br />\nbusiness<br />\nand<br />\ntrator<br />\neach<br />\nmemtender<br />\nlive<br />\nI<br />\nto<br />\nover<br />\nlong<br />\nlocal<br />\nthe<br />\nof<br />\nopportunities for men qualiIn the newspaper offices<br />\nwas \"for my ears alone.\" The de- ory, each day, each hour, each sec- excellent<br />\nfied as dentists and dental specialists.<br />\nproved<br />\nhe<br />\nCommissioner,<br />\nFood<br />\nas<br />\n.war,<br />\nwailmuch<br />\nbe<br />\nalso<br />\nwill<br />\njournals, there<br />\nTrain for a profession offering a broad<br />\ndirector. His ceitful wretches, the unfaithful ond! But, alas, Eve ate the apple! field in which you can make a place for<br />\ning and gnashing of teeth. City edi- himself to be a capable<br />\nSpecialization in dentistry<br />\nyourself.<br />\n* * * *<br />\nthe Mississippi flood brutes—oh, Lord, how I despise<br />\nopens the door to an assured future.<br />\ntors used to pounce on tales of how work in handling<br />\nThe Harvard University Dental School<br />\nThe house is still. I am alone, —the oldest dental school connected<br />\nsophomores had kidnapped freshmen relief also added much to his reputa- them.<br />\nwith any university in the United States<br />\nexecutive.<br />\nan<br />\nas<br />\nefficient<br />\ntion<br />\non soft, velvet pillows. —offers<br />\nreclining<br />\ndisthe<br />\nin<br />\ntrees<br />\nthorough well-balanced courses<br />\nto<br />\nroped<br />\nand left them<br />\n(Oh, why will Al insist on bring- The lamp lights burn low, casting in<br />\nall branches of dentistry. All modIn political circles, it has been ing another sap along?)<br />\nern equipment for practical work under<br />\ntant regions of Relay, there to pracshadows about the room. —Memo- supervision of men high in the profestice the wily art of Harry Houdini or rumored that Hoover will not have<br />\nsion.<br />\nries— Ah! the phone.—Yes, BenWrite for details and admission reThe<br />\nmasculine<br />\nboys.<br />\nAnd<br />\nstill<br />\nwill<br />\ntoo,<br />\nthe backing of the party leaders. It is<br />\nstarve to death. The police,<br />\nquirements to Leroy M. S. Miner, Dean,<br />\nI'll<br />\nvenuto,<br />\nbe<br />\nwaiting<br />\nimpatiently.<br />\nregret<br />\nof<br />\nHARVARD UNIVERSITY DENTAL SCHOOL<br />\npangs<br />\nComof<br />\nalleged that the Secretary<br />\nsex. They seem to have no brains.<br />\nprobably experience<br />\nBoston, Mass.<br />\nLongwood Ave.,<br />\nP.<br />\nM.<br />\nhas<br />\nseason<br />\nthe<br />\nthat<br />\nthat,<br />\nonce<br />\nown;<br />\nhis<br />\nof<br />\nlearn<br />\nwill<br />\na<br />\nhas<br />\nmerce<br />\nthey<br />\nwhen<br />\nThey are always positive, never negbecome more pacific in nature. Why, in office, he will refuse to assume the ative. They cannot even understand<br />\nthe Police Department could actually role of a piece of day in the hands of<br />\nEdwin H. Knopf and William P. Farnsworth<br />\nanything negative—to them, no<br />\narrest several criminals in a single the political dictators.<br />\nAnnounce for the week of April the Second<br />\nmeans yes and yes means yes. And<br />\nday! An unheard of accomplishUndoubtedly this characteristic<br />\nment!<br />\nof Mr. Hoover is one of the most gluttons—they are prize stock! Not<br />\nThe freshmen and sophomores, potent influences in giving him vic- only like *pigs d9 they eat, but like<br />\nby Walter Hackett<br />\nhowever, have deemed it otherwise. tory in the college poll. He is a per- fish they drink. They will not make<br />\nA rollicking, rousing and romantic story of<br />\nThey will undoubtedly have a quiet, sonality rather than a party man. The their abode in the sty and they canthe Spanish Main<br />\npleasant evening. The entertainers colleges have not chosen him because not make their abode in water. Oh.<br />\nNever<br />\nbefore in Baltimore<br />\nwill be as interesting as ever and the he was a Republican. They have Lord, what to do?<br />\nAsk about our special subscription plan<br />\njazz bands will blare out their synco- picked him because he is the most<br />\nMorals? They have none. They<br />\npated tunes. Still the old excitement dominant figure on the American poAUDITORIUM THEATRE<br />\ndo not even know the meaning of<br />\nand recklessness of banquet season litical horizon of the present day.<br />\n<br />\nPOWER OF DARKNESS<br />\n<br />\n4r,<br />\n<br />\nWaxes Poetic<br />\nOver Favorite<br />\nTobacco<br />\n<br />\nEPITORIAL COMMENT<br />\n<br />\nE<br />\n<br />\nwo<br />\ngre<br />\nthe<br />\nder<br />\n111z<br />\nby<br />\nMo<br />\nfar<br />\nPo<br />\n<br />\nme<br />\nCre<br />\nilig<br />\nSta<br />\n<br />\nino<br />\n1d<br />\nlut<br />\nfac<br />\ngro<br />\nthe<br />\ncci<br />\n<br />\nseq<br />\nfes<br />\nwi;<br />\nthe<br />\nan<br />\n<br />\nwil<br />\nwa<br />\nby<br />\ndul<br />\nthe<br />\n<br />\nRe<br />\n<br />\nof<br />\nins<br />\n<br />\nyoi<br />\nate<br />\ntrio<br />\n<br />\nwh<br />\nnoi<br />\nthe<br />\n<br />\nat<br />\nan<br />\n<br />\nEdgeworth<br />\n<br />\nfet<br />\n<br />\nSmoking Tobacco<br />\n<br />\ndi,<br />\nstr<br />\nin(<br />\ntie<br />\n<br />\nH<br />\n<br />\n\"CAPTAIN APPLEJACK\"<br />\n<br />\nni<br />\n<br />\nsle<br />\nly<br />\ntic<br />\n<br />\nat<br />\n<br />\nsic<br />\nad<br />\nas<br />\nbe<br />\n<br />\nwc<br />\nse<br />\n<br />\nha<br />\nwi<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\nThe latest ruling of the dean of<br />\nWomen at Ohio State Uniersity was<br />\ngreeted by a gnashing of teeth of<br />\nthe amorous swains among the undergraduates at that institution.<br />\nMany regretful sighs were heaved<br />\nby the young men recalling blissful<br />\nmoments passed bidding a tender<br />\ni farewell to their loving inamoratas.<br />\n'It For sad as it may be, after deep<br />\nI meditation the dean has augustly decreed that but five minutes of lingering in the hallway, when boy friends<br />\nstart to leave, will be allowed coeds<br />\nin sorority houses and dormitories.<br />\n<br />\nAn unlimited cut system has been<br />\ninaugurated at the University of<br />\nIdaho. Under the terms of this resolution which was adopted by the<br />\nfaculty those students having high<br />\ngrades will be allowed to absent<br />\nthemselves from classes without receiving questioning glances and consequent admonitions from their professors. The authorities, however,<br />\nWish it to be distinctly understood<br />\nthat upon any abuse of this privilege<br />\nan immediate repeal of the concession will follow.<br />\n<br />\nH. E. BOSLEY Est.<br />\nPharmacists<br />\nS. E. Corner Charles and 25th Streets<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nCAN N S<br />\n<br />\n\"JSennp\"<br />\nigoptIton—<br />\n<br />\n\"Collar-Hug\" Clothes<br />\n<br />\nHopkins<br />\nRepresentative<br />\n<br />\nUALITY SHOP<br />\nBaltimore and LibertySts.<br />\n<br />\nTuxedo Suits $35.00<br />\nWell tailored of fine all wool unfinished worsted, Peak and<br />\nnotch lapels. Satin faced and silk trimmed. \"111 sizes<br />\n<br />\nSTEWART& ICI<br />\n14 C0.1.1.10n<br />\n<br />\nWiffn brew Meta.,<br />\n<br />\nCo, New Y.sai.<br />\n<br />\nCALVERT 6060<br />\n<br />\nHOWARD and LEXINGTON STS.<br />\n<br />\nIT<br />\n<br />\nis no problem in the higher mathematics to find<br />\nwhat you want in Hutzler's. Selecting Suits and<br />\naccessories is as easy and pleasant as getting a date<br />\nfor your Fraternity Hop.<br />\n<br />\nStore For Men<br />\n<br />\nWhether you wear a<br />\nhatjauntily,or whether<br />\nyou wear a hat soberly<br />\nand sedately, Stetson<br />\noffers you a choice for<br />\nyour every mood and<br />\nfancy.<br />\n<br />\nFirst Floor, North Building<br />\n<br />\nINTZLEK BKITIEM<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nThe popular conception of the<br />\nWild, devil-may-care undergraduates<br />\nWas given a rude jolt the other day<br />\nby the results of a questionnaire conducted to discover the opinion of<br />\nthe students of the University of<br />\nRochester on the rather radical plan<br />\nof companionate marriage. At that<br />\ninstitution these sober, sensible<br />\nYoung gentlemen definitely repudiated the severe, puritanical critics of<br />\nmodern youth, when by an overwhelming vote of 282 to 88, they announced themselves in opposition to<br />\nthe theory.<br />\n<br />\nClotbos<br />\nifurnizbino<br />\nibetts(<br />\n*bats<br />\n<br />\nEight to<br />\nForty Dollars<br />\n<br />\nNEW LIFE<br />\nFOR MOTORS<br />\n<br />\nESSO<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\n<br />\nN HATS<br />\nSTETSO,„,19,1Cen<br />\nJyedjory<br />\n<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N. J.<br />\n<br />\n*<br />\n<br />\nThe director of physical education<br />\nat the University of Arizona is the<br />\nParty responsible for some rather<br />\namusing comments on the physical<br />\nfeatures of the modern coed to<br />\nWhich, as he states, her mentality is<br />\ndirectly responsible. Chubbily-constructed coeds (we imagine he<br />\nmeans rather more than merely<br />\nPleasingly plump), he says, are the<br />\nmost studious of the fair sex. Her<br />\nslender sister is more popular socially and consequently suffers a distraction from her scholastic endeavors.<br />\nFor some reason or other seniors<br />\nat Furman University have considered it necessary that they should<br />\nadopt some emblem of rank to serve<br />\nas a means of distinction from the<br />\nlower classes. Consequently it has<br />\nbeen decreed that the privilege to<br />\nWear a derby should be strictly reserved to a member of the class of<br />\n'28 and every member of that class<br />\nhas been urged to supply himself<br />\nWith this article of attire.<br />\n<br />\n6<br />\n<br />\nVERY MILID__AND<br />\n<br />\nYET -MEV SATIS1FY<br />\n<br />\nNOTICES<br />\nThere will be a meeting of<br />\nthe NEWS-LETTER Board of<br />\nControl in the office at 12.20<br />\ntoday.<br />\nCandidates and staff members of the Blue Jay will meet<br />\nat a smoker to be held in the<br />\nOmricron Kappa Omricron<br />\nhouse Tuesday at eight o'clock.<br />\nThere will be a dance tonight in the C. E. Hall following the debate with Lafayette<br />\nCollege on the following subject:<br />\nResolved, That the United<br />\nStates should ref use armed<br />\nprotection to American private<br />\ninterests abroad.<br />\nTickets are fifty cents apiece.<br />\n<br />\nWE STATE it as our honest belief that the tobaccos<br />\nused in Chesterfield cigarettes are of finer quality<br />\nand hence of better taste<br />\nthan in any other cigarette<br />\nat the price.<br />\nLIGGETT & MYERS TOBACCO CO.<br />\n<br />\nC11-1 ESTEVFI ELI)<br />\nCI GA RETTES<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br />\n<br />\n4<br />\n<br />\nCOLORS ON ROADSTER SEEN HERE<br />\nALL FOUR CLASSES REPRESENTED IN<br />\nEXTRY! EXTRY! Hopkins'<br />\nstudents come into their own at last.<br />\nThe publicity by the Y. M. C. A.<br />\nand notoriety acquired by our embattled banquets have not gone for<br />\nnaught. There it stands in all its<br />\nglory, the feast of all the covetous<br />\neyes of those bitter hostages of the<br />\nUnited. There it stands—the tribute<br />\nto the financial integrity and prosperity of the campus—a bright,<br />\nshiny, new Hupmobile Six. Imagine!—a Hopkins undergraduate possessing the cash, nay even the credit,<br />\nto buy an automobile.<br />\nTruly, our Baltimore auto dealers<br />\nare optimists. And more than optimists. See their sense of the fitness of things in the color combination they present. Cream yellow<br />\nwith green and black trimmings,<br />\n<br />\nand all shiny nickle. For verily,<br />\nthe creamy smoothness of the Duco<br />\nsets off the peaches-and-cream complexion of our seniors. And lo!—<br />\nhow well the shiny nickle pictures<br />\nthe coinage in our juniors' treasury.<br />\nAnd black—ah—black as our sophomores' hopes of returning to the<br />\nUniversity for the third year.<br />\nFreshmen? Yes, you guessed it.<br />\nGreen stands for our poor, pampered class of '31, as yet untainted<br />\nby the demoralizing Art of Fisticuffs. But watch—the crowd has<br />\nmade room; two of our uniformed<br />\nRot Club men step in; there's the<br />\nidea—dispense with uniforms, rifles,<br />\nsabers and such. Supply them all<br />\nwith roadsters, sport model, motherin-law seat and all. Excellent! But<br />\nwait. The next war will be fought<br />\nin the air.<br />\n<br />\nSALADS<br />\nPASTRIES<br />\nRolls and Fancy Cakes<br />\nPhone -- Homewood 8993<br />\n<br />\nFOOD SHOP BAKERY<br />\nDELICATESSEN<br />\nCONFECTIONERY<br />\n<br />\nBuy Your Car From<br />\n<br />\nJONES CHEVROLET SALES CO.<br />\nMT. ROYAL AVENUE 8z McMECHEN STREET<br />\n<br />\nFRED. MUELLER, Prop.<br />\n<br />\n20 East 21st Street<br />\nBaltimore, Md.<br />\nBox Lunches for Automobile<br />\nand Card Parties<br />\n<br />\nA BIGGER AND BETTER CHEVROLET<br />\nFOR LESS MONEY<br />\nAlso well assorted stock of used Chevrolets, Essex,<br />\nFords and Dodges—some good ones as low as $35<br />\n<br />\nA Nice New Car<br />\nChrysler — Hupmobile — Ford<br />\nRoadsters — Coupes — Sedans<br />\n<br />\nMildison .5355<br />\n<br />\nOpen Evenings<br />\n<br />\nIs Ready<br />\nfor your use this week-end.<br />\nThe cost is surprisingly low<br />\nand we are glad to extend the<br />\ncourtesy of \"No Deposit\" to<br />\nJohns Hopkins Students. Just<br />\nbring your caution money card<br />\nfor identification.<br />\n<br />\nou Jo le* More<br />\nMileage fro<br />\n<br />\nPhone for Reservation<br />\n<br />\nHIS NEW STORE<br />\nTHE SHOE<br />\nFOR YOU!<br />\n<br />\nSAUNDERS<br />\n<br />\nMILES OFSIVILE.S<br />\n<br />\nDrive It Yourself<br />\n<br />\nBETHOUNE<br />\n<br />\nSYSTEM<br />\n<br />\nO<br />\nS 161116<br />\n1 North Howard Street<br />\n<br />\n11 E. North Ave.<br />\nVErnon 2704<br />\nAsk for \"Mack\"<br />\n<br />\n`‘THE WONDER MOTOR FUEL7<br />\n<br />\nA few feet from Baltimore Street<br />\n<br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY<br />\nCO.<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br />\n<br />\nAUTO REPAIRING<br />\n<br />\nBATTERY SERVICE<br />\n<br />\nFOX & COURTENAY<br />\n4/1 E. 31st St.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nPersonal Attention H.D.Fox,'“M.E.,<br />\nto Each:Car.<br />\n<br />\nTEACHERS WANTED<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nSeniors and graduate students who<br />\nare planning to teach should call or<br />\nwrite the Baltimore Teachers' Agency,<br />\n11 East Lexington Street. We have<br />\nplaced many Hopkins graduates.<br />\n<br />\nPRINTERS OF<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n23 S. HANOVER ST.<br />\n<br />\nBALTIMORE<br />\n<br />\nBOOKS<br />\nThe NORMAN-REMINGTON CO.<br />\nMAIN STORE, 347 N.CHARLES ST<br />\nBranch Bargain, 1217 N. Charles St<br />\n<br />\nTHE LITTLE FLOWER SHOP<br />\n<br />\nIhe Summit<br />\nCompliments<br />\n<br />\n2438 St. Paul St., near 25th St.<br />\n<br />\niflotuers for all ocraoiono<br />\nOrders promptly delivered<br />\nGive us a trial Telephone—HOmewood 2577<br />\n<br />\nSILVER SLIPPER<br />\n<br />\nis the worlds largest<br />\nseller<br />\n<br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n<br />\n)<br />\n* AMOCO-GAS<br />\n,<br />\n<br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and Lombard Sts.<br />\nPlaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVernon 4049<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br />\n<br />\nThey say P-A-<br />\n<br />\nFords<br />\nBuicks<br />\nChevrolets<br />\nHupmobiles<br />\nWillys-Knights<br />\n<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nI DON'T doubt it, nor do I wonder why. Just<br />\nopen a tidy red tin and get that full fragrance<br />\nof Nature's noblest gift to pipe-smokers. Then<br />\ntuck a load in the business-end of your old<br />\njimmy-pipe.<br />\nNow you've got it—that taste—that Leadme-to-it, Gee-how-I-like-it taste! Cool as a<br />\ncondition. Sweet as making it up. Mellow<br />\nand satisfying. Try this mild, long-burning<br />\ntobacco, Fellows. I know you'll like it.<br />\n<br />\nORINGE ALBERT<br />\n—the national joy smoke!<br />\n<br />\nC 1928, R. J. Reynolds Tobacco<br />\nCompany, Winston-Salem, N. C.<br />\n<br />\n41,<br />\nVI I 1111111111111ln lir<br />\n<br />\nIil tt p111131.1 1E!RT<br />\n<br />\nYou can pay more<br />\nbut you can't get<br />\nmore in satisfaction.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXII, No. 45<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 30, 1928<br /><br />\nVARSITY CLUB TO<br />\nHOLD SMOKER<br />\nPrep Stars to be Entertained at<br />\nBarn Tomorrow Night<br />\nLARGE<br /><br />\nCROWD<br /><br />\nINVITED<br /><br />\nDAVID KAUFMAN TO<br />\nBE MARRIED JUNE 21<br />\nDavid Kaufman' 28, has announced his engagement to<br />\nMiss Rose Levinson, daughter<br />\nof Mr. and Mrs. Morris Levinson of this city. The date<br />\nof the wedding has been set<br />\nfor June 21, and the couple<br />\nwill leave for Europe on June<br />\n23.<br />\nKaufman is treasurer of his<br />\nclass, chairman of the Varsity<br />\nClub, and varsity guard in<br />\nboth basketball and football.<br />\nHe is also a member of Omicron Delta Kappa.<br /><br />\nHOPKINS MEN ISSUE<br />\nFOUR NEW BOOKS<br />\nHopkins Press Prints Volumes<br />\nWritten By J. H. U.<br />\nProfessors<br /><br />\nFINAL HULLABALOO<br />\nPAYMENT DUE SOON<br />\nAll students, fraternities,<br />\nor activities, owing the Hullabaloo for individual or group<br />\nphotos and printing, must<br />\nmake final payment no later<br />\nthan Monday, Tuesday, Wednesday, April 2, 3 and 4, at<br />\nthe Hullabaloo office or to Mr.<br />\nMeyers, at the Post-office.<br /><br />\nPRICE 5 CENTS<br /><br />\nBANQUET SEASON<br />\nIN FULL SWING<br />\nStudent Council Puts Damper<br />\nOn Fresh-Soph Struggles<br /><br />\nFour new books by Johns HopSOPHS BANQUET MONDAY<br />\nkins men have been printed by the<br />\nJohns Hopkins Press. Dr. Johannes<br />\nSwindell, Leibensperger, and<br />\nFreshmen to Dine Tomorrow<br />\nAbsolutely nothing will be<br />\nMattern, assistant librarian, has<br />\nCoaches to Speak<br />\nat Hopkins Apartments<br />\nHullabaloo<br />\ninserted<br />\nthat<br />\nthe<br />\nin<br />\nwritten a book entitled \"Concepts of<br />\nhas not been paid for in full<br />\nState, Sovereignty and International<br />\nby the above specified dates.<br />\nLaw\" which is dedicated to ProPrep 'school stars will be the<br />\nFreshmen and sophomores will<br />\nfessor<br />\nWilloughby.<br />\nW.<br />\nDr.<br />\nW.<br />\nguests of the Varsity Club at a<br />\neat their banquet unmolested by<br />\nMattern has been doing research<br />\nTo Sell June Week<br />\nsmoker to be held at the Barn, at<br />\neach other in accordance with the<br />\nwork in the field of new European<br />\naffair,<br />\ntomorrow.<br />\nThe<br />\n8:00 P. M.<br />\nTags After Easter latest ruling of the Student Council.<br />\nconstitutions, particularly that of<br />\nBridge Tournament<br />\nGermany. The above book was<br />\nan annual one, is held in order to<br />\nsold dur- The freshmen banquet is at the HopIn Second Round originally intended as introductory June Week tags will be<br />\ninterest the seniors of the various<br />\ning the week after the Easter holi- kins apartments tomorrow night at<br />\nFraternities will swing into the to Dr. Mattern's \"Principles of the days, according to David Kaufman, 7:30 while<br />\nhigh schools in Hopkins activities<br />\nthe sophomores will dine<br />\nsecond<br />\nround of the interfraternity Constitutional Jurisprudence of the member of the June Week Commitand consequently in Hopkins. The<br />\nthis<br />\ncoming<br />\nMonday at the same<br />\nbridge tournament the first of this German National Republic.\" Howidea was conceived last year by J. week. Alpha Tan Omega and Kap- ever, during Professor Willoughby'p tee.<br />\ntime. According to the new decree<br />\nFurther plans for this year's June<br />\nAlbert Abraham, and _has been pa Sigma still maintain the lead as absence, Dr. Mattern presented this<br />\nall hostilities of the classes shall<br />\nWeek have not been definitely made,<br />\nbacked up both years by.0. D. K. a result of their victories in the first introduction as a course of lectures; but several topics are under consid- cease two hours before the hour of<br />\nOver one hundred students have round matches. All matches in the the students attending these lectures eration. These will be settled next the banquet.<br />\nfirst round have been played, and prevailed upon the author to expand week, according<br />\nto the report. EsSuch action was brought about by<br />\nbeen invited by different members competition<br />\nis getting keener. The and publish the material in the pres- timates have been<br />\nboth<br />\nthe<br />\nsubmitted<br />\non<br />\nthe trouble at Annapolis last<br />\nof<br />\nrepresent<br />\nall<br />\nThey<br />\nclub.<br />\nof the<br />\nsecond round should be over by the ent book.<br />\n• orchestra, favors, and programs,<br />\nyear<br />\nand<br />\nbut<br />\nother considerations. The<br />\nthe important schools of the city end of the week of March 26.<br />\nIn the Johns Hopkins University as yet no one of these has been se- opinion of the campus<br />\nis divided,<br />\nand vicinity, each school having<br />\nShould any chapter find it diffi- Studies in Historical and Political lected.<br />\nseemingly, quite equally on this new<br />\nbeen in charge of one of the mem- cult to meet another chapter on the Science, Dr. David M. Schneider<br />\nIn speaking of the favors, Kauf- proposal. On one hand many critics<br />\nspecified date, that chapter should has written \"The Workers' (Com- man stated<br />\nbers of the club.<br />\nthat four of those sub- lament the passing of the old order<br />\nplay all other games scheduled, and munist) Party and American Trade mitted<br />\nhave been selected from the in which it was customary to break<br />\nHonorary Guests<br />\nat a convenient time afterward meet Unions.\" The monograph contains<br />\n150 which were under consideration. quite a number of noses, while othThere have also been asked about any chapter which it has failed to a history and discussion of such One from these four will be se- ers call the attendance at the class<br />\nunions as the machinists and mine lected<br />\nfifty honorary guests, including meet previously.<br />\nnext week. The orchestra rush to mind and cite also the exworkers,<br />\nthe material for which was and<br />\nThe<br />\npairings<br />\nfor<br />\nthe<br />\nsecond<br />\nround<br />\nPresident Goodnow and Dean<br />\nprogram will also be singled out pense saved as points in favor of the<br />\nof the tournament between the collected during the author's study- at this meeting,<br />\nalthough the pro- Council's ruling.<br />\nAmes. All members of the basket- Greeks were<br />\nannounced. The ing in the Economic Seminary here. gram has practically been picked.<br />\nA vote taken at a meeting of the<br />\nball team that are not in the club games include:<br />\n\"Notes of Malthus' Principles of<br />\nThe<br />\nfreshman<br />\ncommittee<br />\nwishes<br />\nto<br />\nkeep<br />\nthe<br />\nclass recently showed that<br />\nare also invited. Others invited are<br />\nBeta Theta Pi vs. Delta Phi.<br />\nPolitical Economy\" by David Ri- budget as large as that of last year the first year men were evenly<br />\ndiPhi Gamma Delta vs. Kappa cardo is the title of a book edited and eliminate chances of deficit<br />\n\"Bill\" Hudginns, President of the<br />\na<br />\nby vided on the score. About fifty were<br />\nby Jacob H. Hollander and T. E. getting in money in advance. Last for and the same number against<br />\nAlumni Varsity Club, Alexander Sigma.<br />\nPi Kappa Chi vs. Omicron Kappa Gregory of this University. Mal- year's budget was $4,250.<br />\nRandall, Treasurer of the Alumni<br />\nThe price the new resolution.<br />\nOmicron.<br />\nthus' original book was published in of the tickets will be approximately<br />\nthe<br />\nSchmidt<br />\nof<br />\nCarl<br />\nVarsity Club;<br />\nChairmen Meet<br />\nDelta Gamma Theta vs. Alpha 1820 and has long been lost. This the same as last<br />\nyear's.<br />\nAthletic Council, Carl Levy, Tom Mu Tau.<br />\nrecovered copy is used through the<br />\nThe banquet dates and places have<br />\nOn the program, which is under<br />\nMcGill, Charley Wolpert, and I.<br />\nPhi Kappa Psi vs. Alpha Delta courtesy of a great-grandson of the consideration, one of the many been freely announced and even disPhi.<br />\nEvans Rodgers.<br />\nauthor.<br />\nfeatures is a \"Boat Ride and Swim- cussed between the chairmen of the<br />\nKappa<br />\nAlpha<br />\nvs.<br />\nAlpha<br />\nTau<br />\nProfessor Gilbert Chinard has ming Club\" afternoon.<br />\nbanquet committees of the two<br />\nThe Barn which is -to be made<br />\nOmega.<br />\nedited \"The Treaties of 1778 and<br />\nyears. First year men meet at the<br />\nin readiness this afternoon will<br />\nAlpha Kappa Phi vs. Sigma Tau Allied Documents\" which are taken<br />\nHopkins Apartments, which are just<br />\nbe decorated with black and blue Delta.<br />\nfrom the originals in the Departacross from the campus at 31st and<br />\nstreamers and with signs done by<br />\nThe Buccaneers—bye.<br />\nment of State.<br />\nTennis Season Opens St. Paul Streets, while the sophoJohn Eldridge listing the various acmores will hold their affair at the<br />\nDuring Holidays Southern<br />\nHotel.<br />\ntivities. It is requested that stu- INTELLIGENTSIA NUMBER OF JAY<br />\nKenneth<br />\nCaptain<br />\nProctor<br />\nlead<br />\nwill<br />\nThe<br />\ndents disturb nothing that is preresolution<br />\nof the Student<br />\nPRAISED AS TO ART WORK AND JOKES<br />\nthe Hopkins tennis team into action Council passed at a meeting of that<br />\npared.<br />\nThe Intelligentsia Number of the ous, the expression is generally<br />\nwith the beginning of the Easter organization at their last meeting<br />\nJay, making its presence when light. Nevertheless, we are certain holidays. Manager Polan has three Tuesday<br />\nSpeakers Announced<br />\nfollows:<br />\nthe fay is trying to remedy condi- matches listed with University of<br />\nDavid Kaufman, president of the scheduled, certainly shows a decided tions, and in taking<br />\nResolved:<br />\nAll hostilities and kidthis stand, we<br />\nClub, will act as toastmaster in the effort on the part of the \"powers have nought else to say but \"good- Virginia, Washington and Lee, and napping shall cease two hours before<br />\nVirginia Polytechnic on April 5, 6 the time of the banquet and shall<br />\nabsence of Fred. Baurenschmidt. that be\" to redeem themselves for work!\"<br />\nand<br />\n7, respectively.<br />\nnot re-commence until midnight folcustomary<br />\ntheir<br />\nlaxity. However, \"Seen From the Pit,\" a review<br />\nHe has arranged an attractive proof<br />\nThe<br />\nJay team held a practice last lowing the banquet.<br />\nour judgment must not be too se- current<br />\nplays by George Banks, is Wednesday at the Fifth Regiment<br />\ngram of speakers inlcuding:<br />\nvere—since, of late, the issues, when particularly<br />\nSophs Secretive<br />\ninformative, and shows Armory. Up to this week, practice<br />\nWalter B. Swindell, Jr.:\"My Un- they appear; are always regarded<br />\nreal thought on the part of the has been delayed on account of the<br />\nSatler Robertson is the chairman<br />\ndergraduate Days at the Univer- with interest by the student body. author. A review is not,<br />\nostensibly, holding of the Sun Tournament at of the banquet committee for the<br />\nIndeed,<br />\nwe<br />\ncommend<br />\nmust<br />\nthe Jay an easy matter, but in the above we<br />\nsity.\"<br />\nthe Armory.<br />\nfrosh. The chairman of the sophofor the arrangement of this new have a review<br />\nof quality. We feel<br />\n\"Father Bill\" Schmeisser: \"Hop- number.<br />\nIt is expected that the Homewood more class has not been divulged.<br />\ncertain that anyone reading this courts will be opened in a few days, The fees for both dinners<br />\nwill be<br />\nkins and Lacrosse.\"<br />\nIt is no easy matter to decorate page, lacking the time or money to and then the rounding<br />\nout of the the same, three dollars. The freshRe- the cover with something of an \"eye- witness the shows themselves, will team will go forward more rapidly. men<br />\nCoach Ray Van Orman:<br />\npayment may be made to<br />\nview of Athletics During the Last catching quality,\" but Don White has find it very enlightening and satisfyIn addition to the schedule al- Robert Kyle. The sophomores have<br />\nsucceded admirably in this respect. ing.<br />\nready printed in the columns of the an arrangement that one-half of the<br />\nFew Years.\"<br />\nLikewise with the rest of art work \"Books, B'Gosh,\" another<br />\npage NFWS-LETTER, a match is pending payment may be made at the present<br />\nCarroll Leibensperger:\"The Out- in this issue. The work has been<br />\ndevoted to reviews, is also well exe- with the Naval Academy.<br />\nwhile the other dollar and a half will<br />\nlook for the Lacrosse Team.\"<br />\napportioned between White, Banks, cuted. As to \"Ads\"—well, there<br />\nA list of men from whom the be taken from the caution money<br />\nare<br />\nLeonard Dalsemer:\"Non-athletic Sharretts, and the less productive enough of them, we think, or per- team will probably be picked include of the class<br />\nmembers.<br />\nmembers of the staff, in such a man- haps too many, if one must be frank. Proctor, Polan, E. Devereux, BrockActivities.\"<br />\nLively Time Promised<br />\nGeorge Darley: \"The Basketball ner as to make the issue very ef- We scarcely desire ,to see the Jay man, Leonard, Smithers, Seidel, and<br />\nfective<br />\nwith<br />\nrespect<br />\nto<br />\nits<br />\nappearSeason.\"<br />\nA lively time is promised at both<br />\nfall into that category of humorous Feingold.. These men have shown<br />\nRidgely Edwards: \"The Track ance. The smaller cuts are particu- magazines devoted to classified ad- up well in practice so far, but the banquets in spite of the absence of<br />\nlarly illustrative of the jokes record- vertisements. Why not fill the positions on the team are by no the customary roughhouse.<br />\nTeam.\"<br />\n\"Wine.<br />\ned under them. The jokes are dis- pages with more original work? At means certain and there is plenty of Women and Song\" is the motto of<br />\nEntertainment<br />\ntinctly of a higher calibre than any rate, if the present number of opportunity for men not on this list the frosh committee, which has obI. Evans Rodgers will entertain. usual — the assortment is more \"ads\" is a necessity, rather than scat- to work their way into the line-up. tained as toastmaster \"Pop\" SwinThere is also a possibility that the varied—in short, we may, without ter them promiscuously throughDevereux was first man on last dell. An eight-piece colored orchesPresident and Dean will be called any or very little effort, laugh.<br />\nout the magazine, it might be better year's freshman squad and played a tra will furnish the syncopation for<br />\non for a few words. After the<br />\nIf one has followed the editorials, to assign them a definite place. The consistently good game throughout the first year men's amusement.<br />\n, speeches there will be refreshments presumably written by the Editor- general appearance of the book will the season. Brockman, Leonard, Sophomore<br />\nplans are being kept<br />\nand music by the Blue Jay orches- in-Chief, one is impressed with the be sure to improve then—however, Feingold, and Leidel have been more in the dark<br />\nbut the Blue Jays<br />\ntra. Following this the guests will effort expended by him, in an at- the use of the salt shaker is in order, flashing fine form on Homewood<br />\nwill probably furnish the music<br />\nbe taken around the campus in order tempt to rid the campus of all its and should be used to suit the taste. courts for some time, while<br />\nSmithers while several dancers have been seto get them familiar with it.<br />\nevils. Though the thought is seriW. H. D. is a freshman.<br />\ncured.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nYES AND NO<br /><br />\nTHE LITTLE THEATRE<br />\nN. HOWARD ST. NEAR FRANKLIN<br />\nMotion Picture Guild Presents:<br /><br />\n£2.00<br /><br />\nSubscription<br /><br />\n\"POWER OF DARKNESS\" at<br />\nReverberations from a recent ar- the word. It is Gteek to them, virtue<br />\n1.45-3.45-6.00-8.00-10.00 P. M.<br />\nEntered as second-class matter December 3. 1909. at the Postotfice at ticle on the feminine sex which ap- is French, honesty is German, truth<br />\nFirst Baltimore Showing of<br />\nBaltimore. Md., under Act of Congress. November 3. 1879.<br />\npeared in these columns a short is Scandinavian, honor is Italian—<br />\nthe<br />\nCount<br />\nLYOF N. TOLSTOI'S<br />\nalong<br />\nthat<br />\nthese<br />\nechoing<br />\nthey<br />\nstill<br />\nproclaim<br />\nloudly<br />\nare<br />\nand<br />\nago<br />\nwhile<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nDRAMA<br />\nPOWERFUL<br />\nfollowing<br />\nUnited States have not joined the<br />\ncampus, it seems. The<br />\nHopkins University.<br />\nletter was received by the writer, League of Nations! Their judgment<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, who submits it for the edification of you cannot rely on; it is folly to<br />\nwith Moscow Art Theatre<br />\nHopkins University. All articles should be sent to the MANAGING EDITOR; the male undergraduates on the heed their wisdom; their taste is riPlayers<br />\nEDITOR-IN-CHIEF.<br />\nother communications to the<br />\ncampus—and for those members of diculous; their music is like the<br />\nA forceful portrayal of the struggle of<br />\nsex so ably de- croaking of a frog; their words<br />\nthe soul against passion by the world-faUniversity 0100 the short-skirted<br />\nTelephone<br />\nmous Russian writer, author of \"Anna<br />\nempty sounds; their presence intolfended below.<br />\nKarenina\" and \"Resurrection\".<br />\n\"After reading your slandering erable.<br />\nEDITORIAL DEPARTMENT<br />\nANOTHER MASTERPIECE<br />\nAnd, when they fall in love! You<br />\ncomments on girls, under an article<br />\nEditor-in-Chief<br />\n. WIENE<br />\nDirected by ROBERT<br />\nGEORGE E. BANKS, JR., '29<br />\nentitled \"Yes and No\" of March 20, might as well call out the Army,<br />\nWHO MADE \"CALIGARI\"<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nI was behooved to comment in a Navy and Marines. Heaven help<br />\nAnd Three Other Entertaining Short<br />\nGEORGE GUMP, '30<br />\nPHILIP W. NESS, '29<br />\nthe victim suffering from the erotic<br />\nsimilar fashion on boys.<br />\nSubjects<br />\nColumnist<br />\nVerily<br />\nthese<br />\nimbeciles.<br />\nof<br />\nwooings<br />\neffort<br />\nthe<br />\nLITTLE THEATRE ORCHESTRA<br />\n\"I certainly appreciate<br />\nDONALD HISS, '29<br />\nyou inspired, for it gave me an op- I say unto you, beware of the man<br />\nAssociate Editors<br />\nportunity . . . to boost our good in love!<br />\nRICHARD H. WOOD,'29<br />\nWILMER H. DRIVER, '29<br />\ncause (suffrage) along. You will<br />\nThey mock our bold display of<br />\nJunior Editors<br />\nconmy<br />\nin<br />\nwaver<br />\nnote that I did not<br />\nshapely limbs. And even so, they<br />\nE. FOSTER DOWELL,'29<br />\nLEONARD B. NOLLEY, '29<br />\nRICARD G. HUNT, '31<br />\nROBERT S. BAIRD, '30<br />\nHARWOOD F. MIILLIKAN, JR., '31<br />\nW. PuzNzira, HALL, JR.., '30<br />\nviction by calling my dissertation stand long hours on street corners<br />\nIRVING K. GORDON, '29<br />\nROBERT F. SICUTCH, JR., '30<br />\nSTEwAwr L. SMITH, '30<br />\n'Yes and No,' but emphatically arid appraising our—eyes. Yet, show<br />\nprominently christened it 'No and me the man who would dare expose<br />\nBUSINESS DEPARTMENT<br />\nhis repellent calves or his unsightly<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nAdam's Apple.<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nAnd withal, they question our suNO AND NO<br />\nJ. ROBERT MYERS, '29<br />\nGEORGE M. GLAZIER, '29<br />\n\"A Prescription\"<br />\nperior mentality, our sagacity, our<br />\nOffice Staff.<br />\nAdvertising Staff.<br />\nBoys.—What infamy the name discretion, our inherent potentialiHave you ever noticed<br />\nright after a meal<br />\nTHEODORE A. FLEISHMAN, .31.<br />\nALvirl H. Bunt, '30.<br />\nimplies! Creatures, vile creatures— ties. If they were forced to meet<br />\nHow tired and lazy<br />\nWILLIAM RAFFEL, '30.<br />\nGus BURKE, '31.<br />\nyou always feel?<br />\nto be disregarded, shunned, yea, the demands that are placed upon us<br />\nRANDOLPH ROTHCHILD, '31.<br />\nJOHN LOTZ, '30.<br />\nI'm telling you folks<br />\neven tortured. To be shunned—yes in a single week, the undertaker<br />\nit isn't a joke,<br />\nLEROY SHUGAR, '31.<br />\nA. H. MORTON, '30.<br />\nIt will freshen you up<br />\n—but how? Persistently they im- would require 'a C. P. A. to make<br />\nif you try a good smoke.<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. pose upon us their despicable con- out his income tax return. Every<br />\nBut whatever you do<br />\nthese lines you must heed,<br />\nviviality despite the feminine in- man (my apologies for belittling the<br />\nThere's a certain tobacco<br />\nof course, that you need.<br />\ngenunity employed in dodging them. word) has his own pet theory, hobby<br />\nIt's packed in a tin,<br />\nthe tin's colored blue.<br />\nThese masses of impedimenta—they or subject to expound to every girl<br />\nNot only the smoking<br />\ncanus—they<br />\nupon<br />\nhis<br />\nfor<br />\nhe meets, and that sufficies<br />\nare so dependent<br />\nbut the chewing kind too.<br />\nOf course if you never<br />\nnot dance without us, they cannot brilliancy, while she (whose mental<br />\nare bothered this way,<br />\nwill have passed. There will be no sing without us, they cannot eat scope is a barren waste with certain<br />\nJust keep the prescription<br />\nBANQUET SEASONS,<br />\nfrantic search to discover the lair of<br />\nfor some other day.<br />\n. Oh, definite bounds) must cope with the<br />\ncannot sl<br />\nPAST AND PRESENT<br />\nAsk for tobacco,<br />\nthe enemy. \"Free for all\" fights will without us, they<br />\nnonpractical,<br />\nphilosophical,<br />\nvarious<br />\nthe best that's on earth;<br />\nthese inebriated specimens—they sensical, or otherwise, topics of<br />\nbe a thing of the past.<br />\nTo shorten the story,<br />\nVEN banquet seasons, it seems,<br />\nwithout us! Dear these \"cultured savants.\" If one of<br />\njust call it \"Edgeworth.\"<br />\nThe season will certainly be safe simply cannot live<br />\nare bowing to the force of civChas. J. Butler<br />\ncountry?<br />\nfree<br />\na<br />\nyours<br />\nis<br />\nSam,<br />\nUncle<br />\npsychology,<br />\ntalks<br />\nenthusiasts<br />\nthese<br />\nilization which is sweeping through and sane but, at the same time, it will<br />\nOwensboro, Ky.<br />\nFeb. 2, 1927<br />\nthe Hopkins campus with the power be drab and uninteresting.<br />\nWe know you advocate such a she must do likewise; if another<br />\nof a hurricane and the destructivepolicy, but, Dear Uncle, why can talks religion, she must know both<br />\nness of a plague. First, the freshthe Old and New Testament; if anyou not secure the services of comman regulations slowly crumbled unother discusses science, or art or<br />\npetent officials (necessarily women) music, she must be scientist, artist<br />\nder its unseen strength, then the<br />\nExtra High Grade<br />\nto enforce this freedom about which and musician; if still another talks<br />\nvicious class battles passed away and HOOVER, THE<br />\nnow the usually colorful banquet sea- COLLEGES' CHOICE<br />\nso much is said and nothing done? books and contemporary literature,<br />\nson seems destined to become as peaceshe must have a background and enERBERT HOOVER'S decisive Must we continue to suffer, to be<br />\nful as a picnic at Druid Hill Park<br />\nChauvictory in the straw vote, con- annoyed, burdened, tormented and riched with everything from<br />\nand as lady-like as a Sunday-school ducted by the NEWS-LETTER, is being<br />\nto Shakespeare to Eliot to Shaw<br />\ncer<br />\nunappreciated by your undesirable and Mencken, and of course others<br />\nexcursion down to Tolchester.<br />\nrepeated in practically all of the other<br />\nwhy—I say, like Pope, Ibsen, Zola, etc. thrown<br />\nEven though this recent reform will colleges where the balloting is being nephews? Why, oh<br />\nA<br />\nboys!<br />\ncondithe<br />\nHang<br />\nsensible<br />\nin; if another is a bridge fiend, she<br />\nmore<br />\nheld. The Independent, the Boston<br />\nintroduce a much<br />\nonly<br />\ncan<br />\nplays<br />\nif<br />\nthe<br />\nanother<br />\nbridge;<br />\nbattlers<br />\nsponsoring<br />\nenjoy<br />\nmust<br />\nis<br />\nwhich<br />\nbanquet<br />\nmagazine<br />\nveteran<br />\ntion,<br />\nYELLOW CAB STAND<br />\nBut should I thus defame these<br />\nregard the new system with bowed nation wide election, reports that approaches to virility so earnestly, tennis, she must know her serves;<br />\nAT<br />\nif another doesn't want to indulge<br />\nheads and tear-stained eyes. Never throughout the nation Mr. Hoover<br />\nthe<br />\nof<br />\nside<br />\ncredit<br />\nthe<br />\nwithout noting<br />\nHOMEWOOD FIELD<br />\nin athletics, play cards or talk,<br />\nagain will the oaken tolackjack of an is the favorite with college students<br />\nthe ledger, or admitting that even hat well—she must comply anyway.<br />\nFrom<br />\nmembers.<br />\nfaculty<br />\nand<br />\nagainst<br />\nresound<br />\npoliceman<br />\nAnnapolis<br />\nNo Charge for Extra Passengers<br />\ngirls up at Wellesley, he received<br />\nthe cranium of an obstinate tussler. almost twice as many votes as all the racks serve some purpose—and then And yet we must laud the \"gallant<br />\n'PHONE<br />\nNever again will the delightful sound other candidates combined. Even in when a hat rack has a pocket book, garcons\" for their wonderful traits,<br />\ntable<br />\nwhile<br />\netc.,<br />\netc.<br />\nambitions, courage,<br />\nVERNON 1212<br />\nof crashing dishes and ripping<br />\nthe wild cactus covered plains of Ari- well—But I say, Hang the boys!<br />\nwe<br />\ncloths be heard among the clang and zona, he remains the outstanding canFORA<br />\n•<br />\nManly statures, crushing lips,<br />\nAnd what rapturous moments are<br />\nclatter of a banquet battle. Never didate among the students of that<br />\nYELLOW CAB<br />\nHeculean arms, whispers of sweet impelled by the names—Adolph,<br />\nagain will gluttonous diners be de- state.<br />\nnothings—can we resist? And the Lancelot, Jurgen. What vows of<br />\nlighted by the sight of their rivals'<br />\nCollege students, apparently realize next morning my best girl friend re- devotion, what burning desires, There is a place for you<br />\npresident, sitting manacled in their<br />\nMr. Hoover's ability as an adminisin the Dental Profession<br />\nwhat bliss, these names recall. How<br />\nmidst.<br />\ncites verbatim the ardent music that<br />\nNever before have there been such<br />\nthe<br />\nDuring<br />\nman.<br />\nbusiness<br />\nand<br />\ntrator<br />\neach<br />\nmemtender<br />\nlive<br />\nI<br />\nto<br />\nover<br />\nlong<br />\nlocal<br />\nthe<br />\nof<br />\nopportunities for men qualiIn the newspaper offices<br />\nwas \"for my ears alone.\" The de- ory, each day, each hour, each sec- excellent<br />\nfied as dentists and dental specialists.<br />\nproved<br />\nhe<br />\nCommissioner,<br />\nFood<br />\nas<br />\n.war,<br />\nwailmuch<br />\nbe<br />\nalso<br />\nwill<br />\njournals, there<br />\nTrain for a profession offering a broad<br />\ndirector. His ceitful wretches, the unfaithful ond! But, alas, Eve ate the apple! field in which you can make a place for<br />\ning and gnashing of teeth. City edi- himself to be a capable<br />\nSpecialization in dentistry<br />\nyourself.<br />\n* * * *<br />\nthe Mississippi flood brutes—oh, Lord, how I despise<br />\nopens the door to an assured future.<br />\ntors used to pounce on tales of how work in handling<br />\nThe Harvard University Dental School<br />\nThe house is still. I am alone, —the oldest dental school connected<br />\nsophomores had kidnapped freshmen relief also added much to his reputa- them.<br />\nwith any university in the United States<br />\nexecutive.<br />\nan<br />\nas<br />\nefficient<br />\ntion<br />\non soft, velvet pillows. —offers<br />\nreclining<br />\ndisthe<br />\nin<br />\ntrees<br />\nthorough well-balanced courses<br />\nto<br />\nroped<br />\nand left them<br />\n(Oh, why will Al insist on bring- The lamp lights burn low, casting in<br />\nall branches of dentistry. All modIn political circles, it has been ing another sap along?)<br />\nern equipment for practical work under<br />\ntant regions of Relay, there to pracshadows about the room. —Memo- supervision of men high in the profestice the wily art of Harry Houdini or rumored that Hoover will not have<br />\nsion.<br />\nries— Ah! the phone.—Yes, BenWrite for details and admission reThe<br />\nmasculine<br />\nboys.<br />\nAnd<br />\nstill<br />\nwill<br />\ntoo,<br />\nthe backing of the party leaders. It is<br />\nstarve to death. The police,<br />\nquirements to Leroy M. S. Miner, Dean,<br />\nI'll<br />\nvenuto,<br />\nbe<br />\nwaiting<br />\nimpatiently.<br />\nregret<br />\nof<br />\nHARVARD UNIVERSITY DENTAL SCHOOL<br />\npangs<br />\nComof<br />\nalleged that the Secretary<br />\nsex. They seem to have no brains.<br />\nprobably experience<br />\nBoston, Mass.<br />\nLongwood Ave.,<br />\nP.<br />\nM.<br />\nhas<br />\nseason<br />\nthe<br />\nthat<br />\nthat,<br />\nonce<br />\nown;<br />\nhis<br />\nof<br />\nlearn<br />\nwill<br />\na<br />\nhas<br />\nmerce<br />\nthey<br />\nwhen<br />\nThey are always positive, never negbecome more pacific in nature. Why, in office, he will refuse to assume the ative. They cannot even understand<br />\nthe Police Department could actually role of a piece of day in the hands of<br />\nEdwin H. Knopf and William P. Farnsworth<br />\nanything negative—to them, no<br />\narrest several criminals in a single the political dictators.<br />\nAnnounce for the week of April the Second<br />\nmeans yes and yes means yes. And<br />\nday! An unheard of accomplishUndoubtedly this characteristic<br />\nment!<br />\nof Mr. Hoover is one of the most gluttons—they are prize stock! Not<br />\nThe freshmen and sophomores, potent influences in giving him vic- only like *pigs d9 they eat, but like<br />\nby Walter Hackett<br />\nhowever, have deemed it otherwise. tory in the college poll. He is a per- fish they drink. They will not make<br />\nA rollicking, rousing and romantic story of<br />\nThey will undoubtedly have a quiet, sonality rather than a party man. The their abode in the sty and they canthe Spanish Main<br />\npleasant evening. The entertainers colleges have not chosen him because not make their abode in water. Oh.<br />\nNever<br />\nbefore in Baltimore<br />\nwill be as interesting as ever and the he was a Republican. They have Lord, what to do?<br />\nAsk about our special subscription plan<br />\njazz bands will blare out their synco- picked him because he is the most<br />\nMorals? They have none. They<br />\npated tunes. Still the old excitement dominant figure on the American poAUDITORIUM THEATRE<br />\ndo not even know the meaning of<br />\nand recklessness of banquet season litical horizon of the present day.<br /><br />\nPOWER OF DARKNESS<br /><br />\n4r,<br /><br />\nWaxes Poetic<br />\nOver Favorite<br />\nTobacco<br /><br />\nEPITORIAL COMMENT<br /><br />\nE<br /><br />\nwo<br />\ngre<br />\nthe<br />\nder<br />\n111z<br />\nby<br />\nMo<br />\nfar<br />\nPo<br /><br />\nme<br />\nCre<br />\nilig<br />\nSta<br /><br />\nino<br />\n1d<br />\nlut<br />\nfac<br />\ngro<br />\nthe<br />\ncci<br /><br />\nseq<br />\nfes<br />\nwi;<br />\nthe<br />\nan<br /><br />\nwil<br />\nwa<br />\nby<br />\ndul<br />\nthe<br /><br />\nRe<br /><br />\nof<br />\nins<br /><br />\nyoi<br />\nate<br />\ntrio<br /><br />\nwh<br />\nnoi<br />\nthe<br /><br />\nat<br />\nan<br /><br />\nEdgeworth<br /><br />\nfet<br /><br />\nSmoking Tobacco<br /><br />\ndi,<br />\nstr<br />\nin(<br />\ntie<br /><br />\nH<br /><br />\n\"CAPTAIN APPLEJACK\"<br /><br />\nni<br /><br />\nsle<br />\nly<br />\ntic<br /><br />\nat<br /><br />\nsic<br />\nad<br />\nas<br />\nbe<br /><br />\nwc<br />\nse<br /><br />\nha<br />\nwi<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br />\nThe latest ruling of the dean of<br />\nWomen at Ohio State Uniersity was<br />\ngreeted by a gnashing of teeth of<br />\nthe amorous swains among the undergraduates at that institution.<br />\nMany regretful sighs were heaved<br />\nby the young men recalling blissful<br />\nmoments passed bidding a tender<br />\ni farewell to their loving inamoratas.<br />\n'It For sad as it may be, after deep<br />\nI meditation the dean has augustly decreed that but five minutes of lingering in the hallway, when boy friends<br />\nstart to leave, will be allowed coeds<br />\nin sorority houses and dormitories.<br /><br />\nAn unlimited cut system has been<br />\ninaugurated at the University of<br />\nIdaho. Under the terms of this resolution which was adopted by the<br />\nfaculty those students having high<br />\ngrades will be allowed to absent<br />\nthemselves from classes without receiving questioning glances and consequent admonitions from their professors. The authorities, however,<br />\nWish it to be distinctly understood<br />\nthat upon any abuse of this privilege<br />\nan immediate repeal of the concession will follow.<br /><br />\nH. E. BOSLEY Est.<br />\nPharmacists<br />\nS. E. Corner Charles and 25th Streets<br /><br />\n*<br /><br />\n*<br /><br />\nCAN N S<br /><br />\n\"JSennp\"<br />\nigoptIton—<br /><br />\n\"Collar-Hug\" Clothes<br /><br />\nHopkins<br />\nRepresentative<br /><br />\nUALITY SHOP<br />\nBaltimore and LibertySts.<br /><br />\nTuxedo Suits $35.00<br />\nWell tailored of fine all wool unfinished worsted, Peak and<br />\nnotch lapels. Satin faced and silk trimmed. \"111 sizes<br /><br />\nSTEWART&amp; ICI<br />\n14 C0.1.1.10n<br /><br />\nWiffn brew Meta.,<br /><br />\nCo, New Y.sai.<br /><br />\nCALVERT 6060<br /><br />\nHOWARD and LEXINGTON STS.<br /><br />\nIT<br /><br />\nis no problem in the higher mathematics to find<br />\nwhat you want in Hutzler's. Selecting Suits and<br />\naccessories is as easy and pleasant as getting a date<br />\nfor your Fraternity Hop.<br /><br />\nStore For Men<br /><br />\nWhether you wear a<br />\nhatjauntily,or whether<br />\nyou wear a hat soberly<br />\nand sedately, Stetson<br />\noffers you a choice for<br />\nyour every mood and<br />\nfancy.<br /><br />\nFirst Floor, North Building<br /><br />\nINTZLEK BKITIEM<br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nThe popular conception of the<br />\nWild, devil-may-care undergraduates<br />\nWas given a rude jolt the other day<br />\nby the results of a questionnaire conducted to discover the opinion of<br />\nthe students of the University of<br />\nRochester on the rather radical plan<br />\nof companionate marriage. At that<br />\ninstitution these sober, sensible<br />\nYoung gentlemen definitely repudiated the severe, puritanical critics of<br />\nmodern youth, when by an overwhelming vote of 282 to 88, they announced themselves in opposition to<br />\nthe theory.<br /><br />\nClotbos<br />\nifurnizbino<br />\nibetts(<br />\n*bats<br /><br />\nEight to<br />\nForty Dollars<br /><br />\nNEW LIFE<br />\nFOR MOTORS<br /><br />\nESSO<br /><br />\n\"STANDARD\" MOTOR OIL<br /><br />\nN HATS<br />\nSTETSO,„,19,1Cen<br />\nJyedjory<br /><br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N. J.<br /><br />\n*<br /><br />\nThe director of physical education<br />\nat the University of Arizona is the<br />\nParty responsible for some rather<br />\namusing comments on the physical<br />\nfeatures of the modern coed to<br />\nWhich, as he states, her mentality is<br />\ndirectly responsible. Chubbily-constructed coeds (we imagine he<br />\nmeans rather more than merely<br />\nPleasingly plump), he says, are the<br />\nmost studious of the fair sex. Her<br />\nslender sister is more popular socially and consequently suffers a distraction from her scholastic endeavors.<br />\nFor some reason or other seniors<br />\nat Furman University have considered it necessary that they should<br />\nadopt some emblem of rank to serve<br />\nas a means of distinction from the<br />\nlower classes. Consequently it has<br />\nbeen decreed that the privilege to<br />\nWear a derby should be strictly reserved to a member of the class of<br />\n'28 and every member of that class<br />\nhas been urged to supply himself<br />\nWith this article of attire.<br /><br />\n6<br /><br />\nVERY MILID__AND<br /><br />\nYET -MEV SATIS1FY<br /><br />\nNOTICES<br />\nThere will be a meeting of<br />\nthe NEWS-LETTER Board of<br />\nControl in the office at 12.20<br />\ntoday.<br />\nCandidates and staff members of the Blue Jay will meet<br />\nat a smoker to be held in the<br />\nOmricron Kappa Omricron<br />\nhouse Tuesday at eight o'clock.<br />\nThere will be a dance tonight in the C. E. Hall following the debate with Lafayette<br />\nCollege on the following subject:<br />\nResolved, That the United<br />\nStates should ref use armed<br />\nprotection to American private<br />\ninterests abroad.<br />\nTickets are fifty cents apiece.<br /><br />\nWE STATE it as our honest belief that the tobaccos<br />\nused in Chesterfield cigarettes are of finer quality<br />\nand hence of better taste<br />\nthan in any other cigarette<br />\nat the price.<br />\nLIGGETT &amp; MYERS TOBACCO CO.<br /><br />\nC11-1 ESTEVFI ELI)<br />\nCI GA RETTES<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 30, 1928<br /><br />\n4<br /><br />\nCOLORS ON ROADSTER SEEN HERE<br />\nALL FOUR CLASSES REPRESENTED IN<br />\nEXTRY! EXTRY! Hopkins'<br />\nstudents come into their own at last.<br />\nThe publicity by the Y. M. C. A.<br />\nand notoriety acquired by our embattled banquets have not gone for<br />\nnaught. There it stands in all its<br />\nglory, the feast of all the covetous<br />\neyes of those bitter hostages of the<br />\nUnited. There it stands—the tribute<br />\nto the financial integrity and prosperity of the campus—a bright,<br />\nshiny, new Hupmobile Six. Imagine!—a Hopkins undergraduate possessing the cash, nay even the credit,<br />\nto buy an automobile.<br />\nTruly, our Baltimore auto dealers<br />\nare optimists. And more than optimists. See their sense of the fitness of things in the color combination they present. Cream yellow<br />\nwith green and black trimmings,<br /><br />\nand all shiny nickle. For verily,<br />\nthe creamy smoothness of the Duco<br />\nsets off the peaches-and-cream complexion of our seniors. And lo!—<br />\nhow well the shiny nickle pictures<br />\nthe coinage in our juniors' treasury.<br />\nAnd black—ah—black as our sophomores' hopes of returning to the<br />\nUniversity for the third year.<br />\nFreshmen? Yes, you guessed it.<br />\nGreen stands for our poor, pampered class of '31, as yet untainted<br />\nby the demoralizing Art of Fisticuffs. But watch—the crowd has<br />\nmade room; two of our uniformed<br />\nRot Club men step in; there's the<br />\nidea—dispense with uniforms, rifles,<br />\nsabers and such. Supply them all<br />\nwith roadsters, sport model, motherin-law seat and all. Excellent! But<br />\nwait. The next war will be fought<br />\nin the air.<br /><br />\nSALADS<br />\nPASTRIES<br />\nRolls and Fancy Cakes<br />\nPhone -- Homewood 8993<br /><br />\nFOOD SHOP BAKERY<br />\nDELICATESSEN<br />\nCONFECTIONERY<br /><br />\nBuy Your Car From<br /><br />\nJONES CHEVROLET SALES CO.<br />\nMT. ROYAL AVENUE 8z McMECHEN STREET<br /><br />\nFRED. MUELLER, Prop.<br /><br />\n20 East 21st Street<br />\nBaltimore, Md.<br />\nBox Lunches for Automobile<br />\nand Card Parties<br /><br />\nA BIGGER AND BETTER CHEVROLET<br />\nFOR LESS MONEY<br />\nAlso well assorted stock of used Chevrolets, Essex,<br />\nFords and Dodges—some good ones as low as $35<br /><br />\nA Nice New Car<br />\nChrysler — Hupmobile — Ford<br />\nRoadsters — Coupes — Sedans<br /><br />\nMildison .5355<br /><br />\nOpen Evenings<br /><br />\nIs Ready<br />\nfor your use this week-end.<br />\nThe cost is surprisingly low<br />\nand we are glad to extend the<br />\ncourtesy of \"No Deposit\" to<br />\nJohns Hopkins Students. Just<br />\nbring your caution money card<br />\nfor identification.<br /><br />\nou Jo le* More<br />\nMileage fro<br /><br />\nPhone for Reservation<br /><br />\nHIS NEW STORE<br />\nTHE SHOE<br />\nFOR YOU!<br /><br />\nSAUNDERS<br /><br />\nMILES OFSIVILE.S<br /><br />\nDrive It Yourself<br /><br />\nBETHOUNE<br /><br />\nSYSTEM<br /><br />\nO<br />\nS 161116<br />\n1 North Howard Street<br /><br />\n11 E. North Ave.<br />\nVErnon 2704<br />\nAsk for \"Mack\"<br /><br />\n`‘THE WONDER MOTOR FUEL7<br /><br />\nA few feet from Baltimore Street<br /><br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY<br />\nCO.<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br /><br />\nAUTO REPAIRING<br /><br />\nBATTERY SERVICE<br /><br />\nFOX &amp; COURTENAY<br />\n4/1 E. 31st St.<br /><br />\nBaltimore, Md.<br /><br />\nPersonal Attention H.D.Fox,'“M.E.,<br />\nto Each:Car.<br /><br />\nTEACHERS WANTED<br /><br />\nJ. H. FURST CO.<br /><br />\nSeniors and graduate students who<br />\nare planning to teach should call or<br />\nwrite the Baltimore Teachers' Agency,<br />\n11 East Lexington Street. We have<br />\nplaced many Hopkins graduates.<br /><br />\nPRINTERS OF<br /><br />\nPhilological and Scientific<br />\nPublications<br />\n23 S. HANOVER ST.<br /><br />\nBALTIMORE<br /><br />\nBOOKS<br />\nThe NORMAN-REMINGTON CO.<br />\nMAIN STORE, 347 N.CHARLES ST<br />\nBranch Bargain, 1217 N. Charles St<br /><br />\nTHE LITTLE FLOWER SHOP<br /><br />\nIhe Summit<br />\nCompliments<br /><br />\n2438 St. Paul St., near 25th St.<br /><br />\niflotuers for all ocraoiono<br />\nOrders promptly delivered<br />\nGive us a trial Telephone—HOmewood 2577<br /><br />\nSILVER SLIPPER<br /><br />\nis the worlds largest<br />\nseller<br /><br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br /><br />\n)<br />\n* AMOCO-GAS<br />\n,<br /><br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and Lombard Sts.<br />\nPlaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVernon 4049<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br /><br />\nThey say P-A-<br /><br />\nFords<br />\nBuicks<br />\nChevrolets<br />\nHupmobiles<br />\nWillys-Knights<br /><br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nI DON'T doubt it, nor do I wonder why. Just<br />\nopen a tidy red tin and get that full fragrance<br />\nof Nature's noblest gift to pipe-smokers. Then<br />\ntuck a load in the business-end of your old<br />\njimmy-pipe.<br />\nNow you've got it—that taste—that Leadme-to-it, Gee-how-I-like-it taste! Cool as a<br />\ncondition. Sweet as making it up. Mellow<br />\nand satisfying. Try this mild, long-burning<br />\ntobacco, Fellows. I know you'll like it.<br /><br />\nORINGE ALBERT<br />\n—the national joy smoke!<br /><br />\nC 1928, R. J. Reynolds Tobacco<br />\nCompany, Winston-Salem, N. C.<br /><br />\n41,<br />\nVI I 1111111111111ln lir<br /><br />\nIil tt p111131.1 1E!RT<br /><br />\nYou can pay more<br />\nbut you can't get<br />\nmore in satisfaction.<br /><br />"}], "field_media_file": [{"target_id": 38251, "display": null, "description": null, "target_type": "file", "target_uuid": "cc7c29cb-770d-4375-a240-d163a3eae453", "url": "http://digital.library.jhu.edu/system/files/2022-03/13315-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13315, "target_type": "node", "target_uuid": "e24a40c6-d24c-4863-be91-07ea970e01e2", "url": "/node/13315"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "06d3cee4-ff15-436c-bff0-afb9bdc32d42"}]}