{"mid": [{"value": 36827}], "uuid": [{"value": "236a2599-461d-4c8c-865b-6532b76efc54"}], "vid": [{"value": 36827}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:26+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13049-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:26+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:26+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "EII<br />\nVOL. XXVII. No. 35<br />\n<br />\n1<br />\n<br />\nBALTIMORE, MD., MARCH 2, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nA. S. C. E. PREPARES ELAB- MANAGEMENT OF ELEC- R. 0. T. C. TO GIVE BENEFIT ANNUAL ELECTION OF Y. M. SWIMMING TEAM TO MEET<br />\nRUTGERS FOR MIDDLE<br />\nTRICAL CLUB TURNED<br />\nFIRST NIGHT OF \"PURPLE<br />\nORATE PLANS FOR<br />\nC. A. TO BE HELD<br />\nMONDAY<br />\nSTATES CHAMPIONSHIP<br />\nOVER TO JUNIORS<br />\nMASK\"<br />\nMARCH<br />\nProminent Engineers and Upper- Dixon Elected President. Glover Proceeds to Go to Band and Rifle Marsh Nominated for President to Rival Teams to Clash in B. A. C.<br />\nTeam. Night Classes in MiliPool Tonight. Black and Blue<br />\nSucceed Dean. Membership<br />\nP. Fallon Delivers Illustrated<br />\nclassmen to Address OrCampaign<br />\ntary<br />\nScience<br />\nMust Stop Giebel<br />\nProgressing<br />\nProgressing<br />\nLecture at Meeting<br />\nganization<br />\nTickets for the first night of the<br />\nThe annual election of officers<br />\nA t a meeting of the Hopkins<br />\nAlthough no meeting was held<br />\nSWIMMERS TO MEET<br />\nduring February, the March pro- Electrical Club, held last Friday Dramatic Club presentation, The for the Hopkins \"Y\" will be held<br />\nWEST POINT<br />\ngram of the Hopkins student chap- afternoon, the management of the Purple Mask,\" are in the hands at 12.30 on Monday, March 5, in<br />\nImmediately<br />\nafter the<br />\nter of the American Society of society was turned over by the reof the members of the Reserved Room 104, M. E. The election will<br />\nRutgers<br />\nmeet<br />\nHopkins<br />\nswimCivil Engineers is expected to be tiring Senior officers to the newlyOfficers'<br />\nmers<br />\nTraining<br />\nCorps<br />\nwill<br />\nbe<br />\nUnit,<br />\ncarried<br />\nentrain<br />\nunby<br />\non<br />\nthe<br />\nvotes<br />\nfor<br />\nof<br />\nWest<br />\nall<br />\nthe biggest yet attempted this year. elected members of the Junior<br />\nPoint<br />\nwhere<br />\nthe<br />\nArmy<br />\nteam<br />\nTwo meetings will be held; one Class. Those elected are J. T. Dix- der the leadership of the Hopkins active members of the \"Y\", meanwill<br />\nbe<br />\nencountered<br />\ndual<br />\nin<br />\na<br />\nmilitary<br />\ning<br />\ndepartment.<br />\nall<br />\nprices<br />\nmen<br />\nThe<br />\nwho<br />\npresident;<br />\nhave recently<br />\nduring the first part of the month, on,<br />\nP. K. Aubel, vicemeet<br />\non<br />\nSaturday<br />\nnight.<br />\nand the second during the latter. president; Ferdinand S. Hambur- of the seats are: $2.50 for box signed the membership card.<br />\nArmy and Hopkins defeated<br />\nAt each of these a Swell-known en- ger, Jr., treasurer, and J. H. Long, seats; $2.00 for orchestra seats up<br />\nThe nominating committee apLehigh<br />\nby about the same<br />\ngineer will address the members, Jr., secretary. Paul L. Betz was to and including row M; $1.50 for<br />\npointed by William G. Dean,<br />\nmargin<br />\nand a real battle<br />\nand the usual business meeting and elected chairman of the Program the remainder of the orchestra and<br />\npresident,<br />\nshould<br />\nhas<br />\ntake<br />\nsubmitted<br />\nplace when they<br />\nits<br />\nnomiCommittee; C. H. Black, chairman also for the first four rows of balsmoker will be held.<br />\ntogether.<br />\nget<br />\nnations<br />\nto<br />\nthe<br />\n\"Y\"<br />\ncabinet<br />\nto<br />\nbe<br />\nA speaker for the first meeting of the Membership Committee, and cony center, and the first two rows<br />\nof the month has not yet been se- C. 0. Rector, chairman of the Pub- of balcony right and left; and $1.00 voted upon at the election. The<br />\nfor the rest of the balcony. Before nominees are: President, T. R. Holding victories over Swarthcured, but the officers are endeavor- licity Committee.<br />\ning 'to secure a prominent bridge<br />\nThe successful season enjoyed by turning in the receipts for the tick- Marsh; vice-president, Paul Syl- more and Lehigh, the Johns Hopofficial from the Baltimore and club so far this year is due en- ets sold, each member of the unit vester; secretary, Karl E. Miller; kins swimming team meets RutOhio Railroad Central Office. The tirely to the untiring efforts of the is permitted to take $2.00 worth<br />\ngers tonight in the B. A. C. tank to<br />\ntreasurer, Randolph Norwood.<br />\nThese include of tickets for himself. This is in<br />\nsecond meeting of theTmonth will retiring officers.<br />\nThe committee chairmen and decide the swimming championship<br />\nbe addressed by Mr. V. Bernard William Alderson, president; Har- accordance with the provision made<br />\nof the Middle Atlantic States.<br />\nSiems, associate civil engineer in old. Breslau, vice-president; Calvin that each man paying his Students' the Student Advisory Council will<br />\nthe Baltimore Water Department, N. Warfield, secretary; Leroy Mat- Activities Fee is entitled to 2.00 be selected by the new cabinet, Rutgers is depending for a<br />\nand head of the water and construc- thews, treasurer, and Henry H. Vo- worth of tickets free. All under- which will be installed on the large part upon their captain and<br />\ntion division. His talk will be il- gel, chairman of the membership graduates not members of the R. Tuesday after the election. At star swimmer, Leo Giebel, to caplustrated by special lantern slides, committee. Through the work of 0. T. C. can get their tickets from<br />\nthat time the new officers will ture the meet. Giebel, who is one<br />\nand will be strictly technical. Mr. the latter, the membership of the George Shriver for the performof the foremost swimmers in colSiems will cover the design of the club was raised to thirty-five, prac- ance on Tuesday, March 13. There meet with the old cabinet and the<br />\nlegiate<br />\nranks, swam in Hopkinsnew water distributing system of tically all the junior and senior elec- will be a dance after the show on retiring men will make final reports of their work for the year, Rutgers dual meet at New Brunseach night.<br />\nBaltimore, and will give the high trical engineering students.<br />\nspots on the pitometer work of the<br />\nThe purpose of the benefit is to and turn over their duties to the wick last year and captured a first<br />\nAn excellent program was enWater Department.<br />\njoyed at all the meetings this sea- secure funds for the support of the new men. This meeting will be place in the fifty-yard and backProfessor John H. Gregory, head son through the work of C. L. band and rifle team. In order to held<br />\nstroke; also swimming on the vicover the banquet board at<br />\nof the department of civil engineer- White, chairman of the program accompany the f- ootball team on its<br />\ntorious relay. In the fifty, Giebel<br />\ning at Hopkins, who is also presi- committee. During the year sev- out-of-town games next fall, the the Johns Hopkins Club Tuesday,<br />\nequalled<br />\nthe intercollegiate record,<br />\ndent of the Baltimore section of the eral prominent engineers, includ- band needs money. The presence March 6, 6 P. M.<br />\nThe membership campaign is doing the distance in 25 seconds<br />\nA. S. C. E., announces that mem- ing pr. B. E. Sliackelford, of the of the band at games away from<br />\n.. A<br />\nbsers of the student chapter have Westinghouse Lamp Company, home is desirable from the stand- progressing<br />\ncue', in tne nrst part ot t e<br />\nvery well. Any one ia<br />\nbeen declared non-voting members and Mr. J. Lynch, of the Westing- point of both the team and Hopkins<br />\nwho signs the card thereby signi- present season lowered by several<br />\nof the Baltimore section of the so- house Electrical and Manufacturing rooters. The organization made<br />\nseconds the intercollegiate record<br />\nciety, and will be welcomed at the Company, addressed the society on one such pip last fall, to the Hav-4fying his sympathy with the<br />\nfor the 440-yard swim.<br />\nregular monthly meetings. These electrical topics. A number of the erford game, and helped greatly to principles thereon becomes an acare usually held on the last Tues- students, also, have spoken before \"pep\" things up for Hopkins. More tive member with voting power. Welsh is expected to give the<br />\nday of each month. Professor the society at various times. The trips will be made this fall if the The four principles are: 1. To New Brunswick star a close rub in<br />\nthe 100 or the 50, whichever the<br />\nGregory would like to see Hopkins last of these addresses was deliv- money is available. The rifle team lead students to faith<br />\nin God latter chooses to enter. Welsh<br />\nwell represented at future meet- ered by Glover P. Fallon. His sub- has hitherto been supported largethrough Jesus Christ. 2. To lead swam 100 in 583-5 at Columbia<br />\nings, which will be held at the En- ject was \"The Liberty Automatic ly by members of the military dethem into membership and service last week, while Giebel was only<br />\ngineers' Club.<br />\nTelephone Exchange.\" Mr. Fal- partment, since all Hopkins men,<br />\nin<br />\nthe Christian church. 3. To pro- able to do 2-5 of a second better at<br />\nAt the last meeting of the Balti- lon has worked for the Chesapeake whether members of the Reserved<br />\nmore section several Hopkins rep- and Potomac Telephone Company Officers' Training Corps or not, are mote their growth in Christian Lehigh.<br />\nMorrell may also give the Rutresentatives were present.<br />\nMr. during the summer months, and so eligible for the team, it ranks as a faith, especially through the study<br />\ngers captain a scare in the backLong, superintendent of bridges for was able to deliver a very interest- campus activity. The profits for of the Bible.<br />\n4. To challenge<br />\nstroke. Last year this event was the<br />\nthe Baltimore and Ohio Railroad, ing and authoritative talk. The next the first presentation of \"The Purthem to devote themselves in<br />\nmost closely contested on the pro\":spoke on the recently constructed meeting of the club will be held in ple Mask\" on Monday, March 12;<br />\nAllegany River bridge. Besides the the near future. The exact day and will be devoted entirely to both of united effort to make the will of gram in the dual meet, Giebel deGod effective in human society, feating the Hopkins man by inches.<br />\nusual maps and profiles, the actual time will be posted shortly on the these college activities.<br />\nand to extend His kingdom<br />\nconstruction and rolling of the E. E. Bulletin Board.<br />\nCoady will experience difficulty<br />\nMembers of the military unit are<br />\nbridge was shown. After the talk<br />\nin<br />\nwinning the fancy dive. Galplanning to attend the play in uni- throughout the world.<br />\nthe members asked several quesbraith<br />\nis one of the best divers in<br />\nStop in the \"Y\" office and sign<br />\nform. Instead of the usual khaki<br />\ntions, and then a report from the DRIVE FOR \"Y\" MEMBERS ON shirt,<br />\nthis<br />\npart<br />\nof the country, and has<br />\nhowever, a white shirt, with a card and become a member.<br />\nnational committee was read. This<br />\nnot<br />\nbeen<br />\ndefeated<br />\nduring the presThe drive for active members of a soft collar and black four-inmeeting is typical of all the regular<br />\nent<br />\nseason.<br />\nLubin,<br />\nalso of Rutthe University Y. M. C. A. has hand tie, will be worn.<br />\nmonthly meetings.<br />\ngers,<br />\nhas<br />\nbeen<br />\nshowing<br />\nexcellent<br />\nThe military department is well COPY FOR \"PROM\" NUMBER<br />\nbeen going on for the past week.<br />\nDuring the remainder of the year<br />\nform<br />\nin<br />\nthis<br />\nevent.<br />\nHe<br />\nis<br />\nMetroContinued on page 4, col. 3<br />\nTo date about thirty men have<br />\nOF BLUE JAY DUE TODAY<br />\nthe student chapter will inaugurate<br />\npolitan<br />\nchampion<br />\nin<br />\nthe<br />\nhigh<br />\ndive,<br />\nsigned the membership roll and sigCopy for the \"Prom\" number of having beaten<br />\nthe plan already in vogue with the<br />\nArmstrong,<br />\nof<br />\nPenn.,<br />\nnified their intention of backing the<br />\nNOTICE<br />\nthe Black and Blue Jay is due to- in this<br />\nMechanical and Electrical Clubs, of<br />\nevent. Galbraith last year<br />\n\"Y\" to the limit. Membership<br />\nday.<br />\nThis number will appear finished second<br />\nhaving members address the meetto Armstrong in the<br />\nAll<br />\nBlue<br />\nAd<br />\nJay<br />\nCopy<br />\nand<br />\nMarch 20.<br />\nings. The seniors and officers of costs nothing, and among the many<br />\nContracts must be in hands<br />\nintercollegiate<br />\nchampionships.<br />\nthe club will probably be the first privileges is the privilege of voting<br />\nof Business Manager by 1 P.<br />\nThe first dinner of the combined<br />\nDunning should have an easy<br />\nto speak under the new plan.<br />\nat the annual election of officers.<br />\nM. Friday.<br />\nBlue Jay staffs will be held at The time in the breast-stroke event.<br />\nBarn, Monday night at 6.30. The Potts, the Rutgers entrant, swam<br />\nBenefit Class 1923<br />\npurpose<br />\nof this dinner is to get the the distapce in 1.25 1-5 against<br />\nGoucher College<br />\neditorial,<br />\nart and business staffs in Swarthmore, while Dunning has<br />\nTuesday Night, March 6.<br />\ncloser<br />\nconjunction.<br />\nHitherto, the done the 100 yards in 1.18 2-5, in1923<br />\nboards<br />\nhave<br />\nbeen<br />\nworking<br />\nas sep- cidentally breaking the South AtAuditorium Theatre<br />\narate<br />\norganizations<br />\nand<br />\nit is the lantic record.<br />\n\"KEMPY\"<br />\npurpose<br />\nof<br />\nEditor-in-Chief<br />\nthe<br />\nand<br />\nINTERCOLLE<br />\nEASTERN<br />\nInquire at News-Letter Office<br />\nGIATE CHAMPIONSHIP<br />\nThe result of the meet probably<br />\nthe Business Manager to obtain<br />\nfor Tickets<br />\nhinges upon the result of the relay.<br />\ncloser working harmony between<br />\nHopkins will, in all probability, cap0. D. K. meeting Tuesday,<br />\nthe staffs.<br />\nture<br />\nthe 50 or the 100, the breast7.30 P. M., in Room 206<br />\nElections for next year's Board stroke and the plunge. The Black<br />\nTickets, $1.50 per couple<br />\n$1.00 Stag<br />\nM. E. Bldg.<br />\nof Control will take place at this and Blue can also count upon secickets obtainable from members of Swimming Team<br />\nCotillon Club Dance Satdinner. As is the custom the Se- onds in the backstroke, the 50 or<br />\nat Athletic Office<br />\nurday, 4.30 P. M., C. E.<br />\nniors on the staff will resign at the 100 and the 220, with a fair<br />\nHall.<br />\nthis time and other men will be chance for a first in any of these.<br />\nelected to fill their places.<br />\nContinued on page 3, col. 3<br />\n<br />\nHOPKINS-RUTGERS<br />\nSWIMMING MEET<br />\n<br />\nat B. A. C. Pool TONIGHT,8 P. M.<br />\n<br />\ni<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nFOUNDED 1897.<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD, '23.<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLL '24.<br />\nAssociate Editors<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nJunior Editors:<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\nW. EDWARD THOMSEN, '26.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nERNEST A. STRATHMAN, '26.<br />\n<br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN,'23.<br />\nCirculation Manager:<br />\nPHILIP W. HOWARD, '25.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nFITZGERALD DUNNING, '24.<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN C. LEWIS, JR., '23<br />\nJOHN T. DIXON, '24.<br />\nA. J. McKAY, '26.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., MARCH 2, 1923<br />\n\"THE PURPLE MASK\"<br />\nThe next event of importance on the Hopkins schedule and the<br />\nonly effort of its kind is the presentation by the Dramatic Club, a<br />\nweek from next Monday and Tuesday, of \"The Purple Mask.\"<br />\n<br />\nTICKETS FOR JUNIOR PROM SONGBOOK PAYMENTS SLOW<br />\nPLACED ON SALE<br />\nSeveral weeks ago, an article apTickets for the Junior Prom, to peared in the NEWS-LETTER exbe held March 23 in the C. E. Hall, plaining the deficit faced by the<br />\nhave been placed on sale and mem- managers of the 0. D. K. Hopkins<br />\nbers of the committee report a large Songbook and requesting that back<br />\ndemand for the pasteboards. On payments be made as soon as posaccount of this demand and the lim- sible. Very few students seem to<br />\nited capacity of the ball, it has been have taken the article seriously, but<br />\ndecided to limit the number attend- it is of utmost importance to 0. D.<br />\ning to 85 couples. Tickets are ob- K. that back bills be paid up at<br />\ntainable from members of the com- once by the students. If more remittee, which is composed of Ken- turns are not realized soon, each<br />\nnady, chairman; Leopold, G. M. debtor will receive in his postoffice<br />\nShriver, Jr., Dunning, Gardner, box a bill which it is hoped will be<br />\nMount, Hamburger and Devours. honored. As this will mean a great<br />\nFisher's orchesrta, six pieces, deal of trouble to the Society and<br />\nhas been procured for the event. some expense, the managers earAttractive favors have been select- nestly hope that the bills will be<br />\ned and Hamburger, in charge of voluntarily paid. Either Landy or<br />\nthe decorations, promises some- Norwood will receive payments or<br />\na note may be left in P. 0. Box No.<br />\nthing distinctive and unique.<br />\nThe Black and Blue Jay Business 415.<br />\nStaff is considering the matter of<br />\nA BAD STORY<br />\ndistributing the Prom Number of<br />\nIkey and Pat were wounded in<br />\nthe Blue Jay, which appears three<br />\ndays before the event, to the fair an engagement in the Argonne. A<br />\npriest making his rounds found<br />\nsex who are present.<br />\nAmong those whom the commit- them. After giving the Irishman<br />\ntee will attempt to secure as chap- the last rites he went over to Ikey<br />\nerones are: Dr. and Mrs. Goodnow, and said: \"Do you .believe in the<br />\nDr. and Mrs. Latane, Dr. and Mrs Father. Son and the Holy Ghost?\"<br />\n824<br />\nGrand Total<br />\nWhitehead, Major and Mrs. Garey. Ikey groaned and rolled over.<br />\nThis week the rifle team is in a<br />\n\"Oi, Oi! Here I am dying and<br />\nmatch with Iowa State. All four<br />\nyou ask me riddles.\"-Yellow Jackpositions will be used and all ten FRATERNITY OPINION IS et.<br />\nscores will count. The team will SOUGHT ON NEXT RUSHconsist of G. M. Ruoff, R. E.<br />\nING SEASON<br />\nParks, H. E. Wilgis, J. E. Mount, At the regular weekly meeting of<br />\nW. M. Rowland, F. E. Williams,<br />\nBoard, held last<br />\nJ. D. Virdin, F. T. Bates, J. A. the Interfraternity<br />\nCochran and A. E. Thiessen. At Monday at 12:30, questionnaires<br />\nthe same time, the fourth stage of were sent out to the various fraterthe intercollegiates, prone and sit- nities represented on the Board for<br />\nting, is being completed. H. E. the purpose of determining the senWilgis, G. M. Ruoff, W. M. Row- timent of the fraternities with reland, R. E. Parks, and J. E. Mount<br />\ngard to next year's rushing season.<br />\nare on this team.<br />\nDi rino- th week endin March When these questionnaires are<br />\n<br />\nHOPKINS RIFLEMEN MEET<br />\nPRINCETON AND COMPLETE 1 HIRD STAGE<br />\nPrinceton Wins_ 498 to 490. Iowa<br />\nState Being Met This Week<br />\nin Intercollegiates<br />\nPrinceton defeated Hopkins in<br />\na rifle match for the week ending<br />\nFebruary 23, by a score of 498 to<br />\n490. The shooting was done only<br />\nfrom the prone position, and only<br />\nthe five highest scores counted.<br />\nThe individual scores of the Hopkins team were as follows:<br />\nR. E. Parks, 100; G. M. Ruoff,<br />\n98; A. E. Thiessen,98; H. E. Wilgis, 97; W. M. Rowland, 97; J. E.<br />\nMount, 95; F. E. Williams, 94; J.<br />\nD. Virdin, 94; F. T. Bates, 93;<br />\nand J. A. Cochran, 89. Total of<br />\nfive highest, 490.<br />\nThe third stage of the intercollegiates from the prone and standing positions, was completed last<br />\nweek. The scores were as follows:<br />\nPr. St. Tl.<br />\n99 81 180<br />\nW. M. Rowland<br />\n98 78 176<br />\nH. E. Wilgis<br />\n75 171<br />\n96<br />\nCochran<br />\nA.<br />\nJ.<br />\nF. E. Williarns....100 59 159<br />\n93 45 138<br />\nR. E. Parks<br />\n<br />\nSOPHISTICATED<br />\n<br />\nle ciuu s o 'ering,<br />\n<br />\n9, Carnegie Tech will be met in filled out and returned, a commitKing,\" one of the dramatic critics of a local daily (and, incidentally, the prone and standing positions, tee will be appointed to consider<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\none of the most reliable critics in the country) expressed the belief and the University of Washing- them and to formulate a rushing<br />\nit all in a book, either. For<br />\nagreement.<br />\nthat the Hopkins Dramatic Club would find itself in the serious posi- ton in all four positions.<br />\ninstance-his clothes are<br />\ndreams and his grooming an<br />\nPlans for the proposed Interfration of having an extremely high standard to 'reach, in the attempt<br />\ninspiration.<br />\nto approach the artistic merit of its 1922 show. The play truly met CANE CLUB HOLDS \"TAP ternity Smoker, to be given by the<br />\nHe gets that finely turned-out<br />\nDAY\"<br />\nhead from\"Vaseline\"HairTonic.<br />\nnewly-initiated freshmen, are prowith the 100% approval of the student body as well as of the regular<br />\nIt smooths and grooms the hair.<br />\ntheatre-gQers. The students, the most critical audience in the world, The annual \"Tap Day\" of the gressing. The date will be anAt all drug stores and student<br />\nCane Club took place Monday at nounced in the near future.<br />\nbarber shgps.<br />\npronounced \"If I Were King\" a great show.<br />\nEvery\"Vaseline\"Isrocluct is<br />\nCane<br />\nwith<br />\naccordance<br />\nIn<br />\n:30.<br />\n12<br />\nrecommended everywhere<br />\nThose connected with the Dramatic Club unhesitatingly declare<br />\nbecause of its absolute pu.<br />\nClub customs, the initiates were<br />\nrity and effectiveness.<br />\nyear.<br />\nlast<br />\nof<br />\nthat<br />\nto<br />\nsuperior<br />\nbe<br />\nto<br />\nthe latest offering<br />\nlined up before Gilman Hall and the<br />\nNorah-What's wrong, sonny?<br />\nThe Monday night performance is under the management of the Club approached in chariots,<br />\nSonny-I-I burnt my h-hand in<br />\nR.0. T. C. for the benefit of the Rifle Team and the Band. The sec- hearses, shays, etc. The new memthe<br />\nh-h-hot water.<br />\nond night is devoted to the remainder of the student body. The pro- bers are: W. G. Packard, F. L.<br />\nNorah-Serves ye right, ye little<br />\nceeds of this night go into the coffers of the Student Activities Coun- Ross, J. W. Parsons, R. P. O'Concil.<br />\nnor, W. F. Passano, F. W. Rich, fool. Why didn't ye feel the waChesebrough Mfg.Co.<br />\nTickets are obtainable now at the Barn. If you doubt the value L. C. Muth, J. T. Baker, C. C. G. ter before ye put your hand in it?(consolidated)<br />\nEvans, J. S. V. B. Shriver and E. Jack-o-Lantern.<br />\nof the show, ask the man who saw \"If I Were King.\"<br />\nJones.<br />\nFollowing the \"tapping,\" the<br />\nClub had lunch at the College Inn.<br />\nOn Monday evening an elaborate<br />\n16<br />\nCAN SPRING BE FAR BEHIND?\"<br />\ndance was given at the Arundell<br />\nThough March has but begun, there is a certain balmy feeling in Club in 'honor of the new members.<br />\ns the way a JOHN HANCOCK salesman described<br />\nthe air, the first robin has been spotted, and a case of \"fevericus<br />\nFollowing the Princeton 'lacrosse<br />\n. his work. He is a college graduate and in five<br />\nspringum\" has already been reported to the Health Department. It game, the Cane Club will give an<br />\nyears has put himself at the very top of his<br />\nwill not be many days before an,observer at the Barn will see stu- old-fashioned tea dance, at which<br />\nbusiness.<br />\ndents lounging in chairs on the rim of the fountain, or even perched time the members will bring their<br />\nHe never yet has called upon a prospect without<br />\nin positions denoting physical and mental lassitude, on the ground. girls out in hacks.<br />\na previous appointment. The best life insurance<br />\nthe<br />\nof<br />\ncause<br />\nthe<br />\nto<br />\nas<br />\nspeculation<br />\ntoday work on that plan, making it a busiannual<br />\nsalesmen<br />\ntheir<br />\nbegin<br />\nProfessors will<br />\nsuch as any worthy and ambitious<br />\ndignity,<br />\nof<br />\nthe<br />\nness<br />\nbecause<br />\nthemselves<br />\nrebuke<br />\nwill<br />\nand<br />\ncuts<br />\nof<br />\nincreasing numbers<br />\nOHIO STATE HOLDS SPRING<br />\ncan find satisfying to his mental<br />\ngraduate<br />\ncollege<br />\nFOOTBALL PRACTICE<br />\nlast quiz was so hard that a majority of the class flunked.<br />\nremunerative as well.<br />\nhighly<br />\nand<br />\nneeds,<br />\nTaking advantage of the recent<br />\nis<br />\nthere<br />\nAnd<br />\nspring.<br />\nquoted is the John Hancock's<br />\nonly<br />\nabove<br />\nman<br />\nThe<br />\nis<br />\nit<br />\ndoctors,<br />\nDon't worry, learned<br />\n\"let down\" in the usual cold winThis shows what college<br />\nagent.<br />\ngeneral<br />\nyoungest<br />\nrecall,<br />\nwill<br />\nyou<br />\nIf<br />\nundergrads.<br />\nfellow<br />\nnothing wrong with your liver,<br />\nof<br />\nWilce,<br />\nW.<br />\ntry<br />\nJ.<br />\nCoach<br />\nblasts,<br />\ncan do in this business,<br />\ntype<br />\nright<br />\nthe<br />\nof<br />\ngraduates<br />\nyou experienced the same symptoms last March. You can't help Ohio State University, has already<br />\ncan build up earning power and at the<br />\nthey<br />\nhow<br />\nyourself. Medicine has not yet found a cure for leprosy. It never<br />\nsame time provide for an accumulated competence<br />\ninaugurated spring practice in foot.<br />\nthe years to come.<br />\nfor<br />\nwill find one for spring fever.<br />\nball, and has mapped out an intenis a vital period in your life and you<br />\nGraduation<br />\npart<br />\nfirst<br />\nThe<br />\nwith.<br />\nover<br />\nBut have your attack early and get it<br />\nsive spring campaign to teach his<br />\nare liable to hold to the business you start in. It<br />\nof March marks the opening of the Spring Season Ticket Sale. Ac- rookies the fundamentals of the<br />\nwould be well before making a definite decision to<br />\ninquire into life insurance as a career. Address,<br />\ncording to athletic authorities, $5,000 is needed to carry out our game by outdoor drills.<br />\n\"Agency Department.\"<br />\nspring schedule. There will be no demand for the tickets. The un- During these early practices, the<br />\ndergraduates must bear the brunt of the selling and hard work and gridiron warriors are clad in regapplied enthusiasm are necessary.<br />\nular uniform, and sprinting, puntThis is just a warning. The real campaign does not begin for ing and receiving the ball are in'AL<br />\nseveral weeks. Stretch in front of the Barn for two weeks; listen to dulged in. In the annual spring<br />\nCOMPANY<br />\nINSURANCE<br />\nLI<br />\nFE<br />\nin<br />\nOF BOSTON. MASSACHUSETTS<br />\nthe robins, if you can find them. But when the gong goes, jump to it. tournament, to be held early<br />\nexSell your quota of tickets and more. Then, if you wish, lie down on April, Coach Wilce will learn<br />\nLargest Fiduciary Institution in New England<br />\ntraining<br />\nthe<br />\nto<br />\nwho<br />\nresponded<br />\ng<br />\nactly<br />\nat<br />\nattack<br />\nyour<br />\nand<br />\nhave<br />\nsunshine<br />\nwarm<br />\nthe<br />\nthe grass, stretch in<br />\nand to what degree.<br />\nJ. L.<br />\nyour leisure.<br />\nLast year, commen mg upon<br />\n<br />\n1<br />\n<br />\nVaseline<br />\n<br />\nHAIR TONIC<br />\n<br />\n•<br />\na \"Best Paid Hard Work in the World\"<br />\n•<br />\n<br />\n111<br />\n<br />\nI<br />\n<br />\naaaaaaaaaaaaaaaaaaaaa<br />\n<br />\nat<br />\nill<br />\n<br />\nha<br />\nCl<br />\n0<br />\nAV<br />\n<br />\nSt<br />\noi<br />\nel<br />\n13<br />\nii<br />\n<br />\nt1<br />\nt(<br />\nti<br />\n1-<br />\n<br />\n-a<br />\n<br />\n1<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br />\n<br />\nthe<br />\nins<br />\ntck<br />\n<br />\nDSto<br />\n<br />\n)ut<br />\nD.<br />\nat<br />\nrech<br />\nice<br />\nbe<br />\nat<br />\nrid<br />\n<br />\nbe<br />\nor<br />\n<br />\nOr<br />\n<br />\no.<br />\n<br />\n220-yard Swim—Hopkins (CoaSTUPID STUDENTS MARRY Swimming Team to Meet,Rutgers Rutgers (Galbraith and Lubin).<br />\nTAU BETA PI DENIES THE<br />\nChampionship<br />\nStates<br />\nMiddle<br />\nfor<br />\nPlunge—Hopkins (Howard and dy); Rutgers (Redman and FosBright students marry bright<br />\nCHARGE OF DISContinued from page 1.<br />\nHambleton); Rutgers (Sparks and ter).<br />\nCRIMINATION<br />\nstudents and stupid students marry<br />\nteam is able Von Stanley).<br />\nA number of prominent Juniors stupid students, according to find- If the Hopkins relay<br />\n100-yard Swim—Hopkins (Bullseems likely<br />\nthe<br />\nrelay,<br />\nit<br />\ncapture<br />\nto<br />\nWashingUniversity<br />\nof<br />\nthe<br />\nand Seniors in the Civil Engineer- ings at<br />\nBack Stroke—Hopkins (Morrell<br />\nchampionStates<br />\nMiddle<br />\nthe<br />\nthat<br />\nrefrom<br />\nmade<br />\nrer and Welsh); Rutgers (Giebel<br />\ning Department of the University ton. The study was<br />\nBaltimore for a and Hambleton); Rutgers (Giehave recently charged the Hopkins ports of 200 married graduates by ship will reside in<br />\nand Rossetti).<br />\nbel).<br />\nChapter of the Tau Beta Pi Hon- the psychology department. There year.<br />\nFollowing the completion of the<br />\norary Engineering Fraternity is, however, no correlation of intelwith discriminating against the ligence between couples at a dance, meet, dancing will be held in the<br />\nstudents of their department in according to the report, because a B. A. C. gymnasium. The Blue<br />\nYou collegians who stroll along the campus will<br />\nthe choice of members. Several fellow does not choose a dancing Jay Six will furnish the music.<br />\nbe among the first to sense the coming of Spring.<br />\nof them claim that their grades partner on account of her intelli- Tickets may be obtained from memDoesn't that suggest something to you in the<br />\nbers of the swimming team or from<br />\nwere high enough to make them gence.<br />\nmatter of clothes?<br />\nOffice.<br />\nthe<br />\nAthletic<br />\nsociety.<br />\nin<br />\nthe<br />\nelection<br />\neligible for<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nFOOLED<br />\nThey maintain also that if the Tau<br />\nLineup:<br />\nSuits if you want to know college style at its best.<br />\nBeta Pi discriminates against civ- Her cheeks he said are roses red, 200-yard Relay—Hopkins (Coail engineering students it should<br />\ndy, Lord, Buhrer, Welsh); RutAnd lovely as can be;<br />\nbe refused recognition as a uni- Her ruby lips are treasure ships gers (Giebel, Cass, Foster, Ross).<br />\nversity organization. In this case<br />\nilaae1iand414r<br />\n200-yard Breast Stroke—HopThat speak of love to me;<br />\nthey advise the installation of anRutBuhrer)<br />\n;<br />\nBut when to kiss this little miss, kins (Dunning and<br />\nother honorary engineering fragers (Potts and Brenner).<br />\nThe booby took a notion,<br />\n(Y. M. B. 0. D.)<br />\nternity, preferably the Sigma Tau.<br />\n(Welsh<br />\nSwim—Hopkins<br />\n40-yard<br />\nHe found her lips were painted<br />\nCalvin N. Warfield, a Senior in<br />\nand Buhrer); Rutgers (Ross and<br />\nBaltimore and Hanover<br />\nships<br />\nthe Electrical Engineering DeCass).<br />\nUpon a painted ocean.<br />\npartment and president of the<br />\n—Burr.<br />\nFancy Dive—Hopkins (Coady);<br />\nHopkins chapter of the Tau Beta<br />\nPi, when interviewed _last Tuesday afternoon, said: \"These<br />\ncharges are absolutely groundless.<br />\nThe Tau Beta Pi never has and<br />\nnever will discriminate against<br />\nany class of engineering students.<br />\nThe reason no civil engineering<br />\nstudents were elected this year is<br />\nmerely that there were no men<br />\nin the department with sufficiently<br />\nhigh grades.\"<br />\n<br />\nY-401144<br />\n<br />\nINTERFRATERNITY SMOKER<br />\nCOMMITTEE MEETS<br />\nA meeting of the fraternity<br />\nfreshmen chosen to represent<br />\n•their various fraternities with reference to the arrangement of a<br />\nFreshman Smoker met in Room<br />\n113, Gilman Hall, at 12.30 P. M.<br />\ntoday. The- foilowing—m-en were<br />\npresent: Alpha Kappa, Powell;<br />\nPi Kappa Pi, Kidd; Silver Arrow,<br />\nDunnbeller ; Kappa Sigma, Sandsbury; Omicron Kappa Omicron,<br />\nPledge; Alpha Delta Phi, Hiss;<br />\nDelta Gamma Theta, Ningard ;<br />\nPi Kappa Chi, Townsend; Beta<br />\nTheta Pi; Webster; Kappa Alpha, Holls ; Sigma Tau Delta,<br />\nHudson; Phi Gamma Delta, Stick,<br />\nDelta Phi, Nelson.<br />\nKlinefelter, in behalf of the Interfraternity Board, explained the<br />\nmethod in which the smoker was<br />\nconducted last year, and told of<br />\ntheir mistakes, hoping that the<br />\ncommittee this year might profit<br />\nby them.<br />\nA meeting will be held today to<br />\ndecide upon the night and the<br />\ntime. At this meeting various<br />\nmen will take charge of the different plans for the smoker.<br />\n<br />\nPUBLIC SALES<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nshoes, sizes 51<br />\n/<br />\n2 to 12 which<br />\nwas the entire surplus stock<br />\nof one of the largest U. S.<br />\nGovernment shoe contractors.<br />\nThis shoe is guaranteed one<br />\nhundred per cent, solid leather, color dark tan, bellows<br />\ntongue, dirt and waterproof.<br />\nThe actual value of this shoe<br />\nis $6.00. Owing to this tremendous buy we can offer<br />\nsame to the public at $2.95.<br />\nSend correct size. Pay postman on<br />\ndelivery or send money order. If<br />\nshoes are not as represented we<br />\nwill cheerfully refund your money<br />\npromptly upon request.<br />\n<br />\nNalional Bay State<br />\nshoe Company<br />\n_296 Broadway, New York, N. Y.<br />\n<br />\nEngineering Levels Mountains<br />\nThe Pack Train has become a relic of the<br />\npast, along with the Prairie Schooner.<br />\nModern methods of transportation have<br />\nleveled mountains, brought San Francisco<br />\nnearer to New York, and widened the markets of all our great industries.<br />\nAnd the engineering brains and energy,<br />\nthat have developed transportation to the<br />\nprominence it holds in the business of the<br />\nworld today, are no longer employed in<br />\nimproving means of overland travel alone.<br />\nStreet Railways, Elevator Systems, Interurban Lines and Improved Shipping Lines—<br />\nthese are some of the accomplishments of<br />\nengineering in the development of better<br />\ntransportation.<br />\nNeither have the builders of such systems<br />\nbeen concerned only in the actual hauling of<br />\npeople and materials. A study of the methods<br />\nof handling passengers and freight at the<br />\nlarge terminals has developed the Terminal<br />\nEngineer, who has greatly improved existing<br />\n<br />\nACHIEVEMENT<br />\n<br />\nmethods, and has developed entirely new<br />\nones, as well.<br />\nEngineering, as it is applied to transportation, has had to concern itself with many<br />\nkinds of materials and many ways of handling<br />\nthem under all manner of circumstances.<br />\nFor instance the problems surrounding the<br />\nhandling of iron ore, in bulk, are vastly<br />\ndifferent from those encountered in moving<br />\nany one of the finished products manufactured from iron ore, that must also be<br />\ntransported in large quantities. But Engineering constantly meets each situation with<br />\nimproved transportation facilities.<br />\nIndustry, as a whole, and the nations and<br />\nthe people of the woad owe much to the<br />\nengineers, associate(i id' such large manufacturing industries as Westinghouse. They<br />\nhave not only brought about vast improvements, but they have done so at a constantly<br />\ndecreasing cost to those who derive the<br />\ngreatest benefit from them.<br />\n<br />\nOPPORTUNITY<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br />\n<br />\nAMERICAN STUDENTS TO<br />\nMAKE ITALIAN TOUR<br />\nMr. Paul D. Cravath, President<br />\n(THE BOOK MART)<br />\nof the Italy American Society, announced today that a group of<br />\nComplete Stock of<br />\nAmerica'<br />\ncollege students and inMedical Books and College<br />\nRequisites<br />\nstructors is being organized to travImporters and Dealers in Fine Books el in Italy next summer under the<br />\njoint auspices of the Italy Ameri301 N. CHARLES ST.<br />\ncan Society and the Institute of In.ternational Education. The anBaltimore, Md.<br />\nnouncmeent stated that the purpose<br />\n.r4<br />\nof the undertaking is \"to furnisii<br />\nan opportunity for American college and university students to<br />\nstudy, under scholarly guidance<br />\nand instruction, the monuments of<br />\nAncient Rome, the vast cultural and<br />\n°le) artistic bequests of Renaissance<br />\nie<br />\nv<br />\nXatter<br />\n-e<br />\n1<br />\n,<br />\n4<br />\nC(1<br />\n'<br />\nH.& OSCAR G•LE<br />\n‘j4<br />\nItaly, and the social, industrial and<br />\noWNERS<br />\ncommercial life of the Italy of to1•C4<br />\n?<br />\n.<br />\nitilbZ*..<br />\nday.\"<br />\n29 Baltimore St., East<br />\nThe students will sail from New<br />\nOne Door West of LiglA St.<br />\nYork on the S. S. \"Saxonia,\" on<br />\n910LE AGENTS FOR BALTIMORE<br />\nJune 30, 1923. After landing at<br />\nFor College Fraternity Banda<br />\n(Greek Letter Sodetios)<br />\nCherbourg, they will traverse<br />\nFrance and Switzerland, and enter<br />\nItaly through the Italian Lake District. They will -visit the great inPrinters of Philological and<br />\ndustrial plants near Genoa and TurScientific Works<br />\nin, and then will travel southward<br />\n23 S. HANOVER ST.<br />\nto Rome, Naples and its environs,<br />\nBaltimore, Md.<br />\nthe hill towns of Perugia and Assisi, Florence, Bologna, Ravenna,<br />\nVenice, the Italian battlefields in the<br />\nDolomites, the redeemed city of<br />\nTrento, and Milan. They will return to this country on September<br />\n4th.<br />\nThe \"faculty\" will include Dr.<br />\nAngelo Iipari, of the Department<br />\nof Romance Languages at the UniSOMETHING NEW<br />\nMUSIC<br />\nversity of Wisconsin, as lecturer on<br />\nBeginning March 5<br />\nModern Italy and as instructor in<br />\nEvery Afternoon Exceot Saturday<br />\nFrom 2 until 4 o'clock<br />\nthe Italian language; Professor Edn'-ncing after 3<br />\nward B. T. Spencer, six years a<br />\nM. to 7.30 ft M.<br />\n8, LIBERTY<br />\nresident<br />\nin Rome and now Profes11.3 , •<br />\nsor at Grinnell College, as lecturer<br />\nSARATO<br />\non Ancient Rome and classic art:<br />\n<br />\nThe Medical Standard Book C<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\n•<br />\n<br />\nFine Clothes<br />\nA suit by Lemmert gives the final<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more<br />\nfestive occasions.<br />\n<br />\nR.<br />\n<br />\n-- - - Give<br />\n---- ----- -F;rat<br />\n-Night of \"Purple Mask\"<br />\nContinued from page 1<br />\n<br />\nMARYLAND THEATRE<br />\n<br />\nPrinters of the<br />\n<br />\nWeek of March 5th, 1923<br />\nsatisfied with the progress of the<br />\nAESOP'S FILM FABLES<br />\nnight classes in military science.<br />\n&ftette'ere-de\"<br />\nRupert Ingalese<br />\nThe attendance has been very reg4<br />\n(One of the World's Finest Jugglers)<br />\n'<br />\n1<br />\nTHE<br />\nAND HIS FLUNKEYS<br />\nular, and there was no decrease in<br />\nIn a Refined Drawing-Room Entertainment<br />\n\\\\ ,..r.<br />\nRtiAP1 ...<br />\nthe enrollment. So well pleased is<br />\nSupported by Miss Angela Grey, the EmiC<br />\nclANI,014<br />\nnent Pianist, from the Queen's Hall,<br />\nMajor Garey with the success of<br />\nLondon<br />\n,<br />\nthe experiment that he believes<br />\n---,1<br />\nJoe Roberts<br />\nmany other universities, within the_ , bj<br />\nMaster Banjoist<br />\n1<br />\nnext five years, will follow our ex. ',u u<br />\nThe International Composer<br />\n-k<br />\nample and start night classes for<br />\nJos. E. Howard & Evelyn Clark<br />\n- Songs by Mr. Howard—Old and New<br />\nthe study of military science and<br />\ntactics.<br />\nHenry & Moore<br />\n441000 I<br />\n\"ESCORTS SUPPLIED\"<br />\n:This is quite the cat's pajamas,\"<br />\nMarga Waldron<br />\nCollege Literature<br />\nsaid the old gentleman, as he picked<br />\nPremiere Danseuse<br />\nIn a Unique Classical Offering<br />\nup some of his wife's lingerie.—<br />\nLOMBARD and SOUTH STREETS<br />\nINTERMISSION<br />\nW. & L. Mink.<br />\nJohns Hopkins News-Letter<br />\n<br />\nD,N,<br />\n<br />\nTOPICS OF THE DAY<br />\n<br />\nMary Haynes<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nIn \"EXCLUSIVE SONGS\"<br />\n<br />\nTom Patricola<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n$4.50<br />\nii-i<br />\n<br />\nWARNER<br />\n<br />\nup<br />\n<br />\n'<br />\n<br />\nt¼<br />\n<br />\nThe<br />\n<br />\nDato•Wg Pnool,<br />\n<br />\nwith<br />\n<br />\nHarriette Towne<br />\nHere Is the Best Jazz Band of Them All<br />\n<br />\nScranton Sirens<br />\n<br />\nCOMPANY<br />\n<br />\nWilliam Lustig. Director<br />\nThe Dancing Carnival Orchestra<br />\n<br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br />\n<br />\nAUDITORIUM<br />\n<br />\n—<br />\n<br />\nURNER'S<br />\n<br />\nNext Week<br />\n<br />\nAre You Enjoying<br />\nThe Benefits of<br />\n<br />\nMatinees Wednesday & Saturday<br />\n<br />\nMEN'S SHOES<br />\nRICHARD G. HERNDON<br />\n<br />\nOf the Better Class<br />\n<br />\nPresents<br />\n<br />\nk<br />\n<br />\n-The Wonder Motor Fuel\"<br />\nMore Power and Mileage<br />\nLess Caron Deposit<br />\n<br />\nThe Play With 1,000 Laughs<br />\n<br />\nURNER BROTHERS<br />\n<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\n\"KEMPY\"<br />\n<br />\n111<br />\n<br />\nE. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nWith<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nand individuality is offered here at prices that are not<br />\nMilii111111111.1111111111111111111111111111<br />\nand cannot be underquoted by any house at any time.<br />\nopkinson bmit , ot the<br />\nosep<br />\nBesides the reputation of an old-established firm<br />\nFriends' School. Brooklyn, as lecis back of each sale with a guarantee.<br />\nturer on Italian Medieval history,<br />\nand other members of college and<br />\nuniversity factulties.<br />\n<br />\nJ<br />\n<br />\nGrant Mitchell<br />\nand<br />\n<br />\nThe Nugents<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nFURNITURE<br />\n<br />\n,DECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\nFORD'S<br />\n<br />\n343 NORTH CHARLES STREET<br />\nA SONG WITHOUT WORDS<br />\nat<br />\nLEMMERT<br />\nWeek of March 5<br />\nannounced the butler.<br />\n19 Fayette Street, East<br />\nAs I bowed she rose and greeted<br />\nMatinees Wednesday & Saturday<br />\nDress Clothes me with a smile. \"— —,\" she inBusiness Suits<br />\nSport Togs<br />\nOvercoats<br />\nvited, making room for me on the<br />\nSAM H. HARRIS<br />\nsofa beside her.<br />\nStore<br />\nPresents<br />\nFine<br />\nof<br />\na<br />\nGreetings<br />\nThe<br />\n\"—,\" I replied.<br />\nHer eyes laughed saucily up at<br />\nMANUFACTURING JEWELERS<br />\nMARY RYAN<br />\nTo the Students of a Fine University<br />\nme.<br />\nLancaster, Pa.<br />\nIn<br />\nClass Rings, Pins, Fraternity Pins,<br />\nI moved closer.<br />\nEtc.<br />\nCups, Medals,<br />\n\"—,\" she threatened, putting a<br />\nStationery, Invitations, Programmes<br />\npillow between us as a safeguard<br />\n\"Makers of the Varsity Seals\"<br />\nHOCHSCHILD,KOHN &C°.<br />\n•<br />\nagainst such movements.<br />\nI turned my hack. Silence. I<br />\nBy Norman Houstan and<br />\nwaited.<br />\nSam Forrest<br />\n\"—,\" she coaxed.<br />\nNo reply.<br />\nCommercial Photography<br />\nWith<br />\n\"—,\" pouting now.<br />\nCircuit Photography<br />\nKrembs,<br />\nFrank M. Thomas,<br />\nFelix<br />\npilthe<br />\nViews<br />\nas<br />\nwhispered,<br />\nLights<br />\nI<br />\n\"—,\",<br />\nFlash<br />\nPaul Nicholson and others<br />\nEnlargements<br />\nfloor.<br />\nlow<br />\nfell<br />\nto<br />\nthe<br />\nGroups<br />\nStaged by Sam Forrest<br />\n\"—,\"struggling.<br />\nKODAK FINISHING<br />\n, The door opened. Wild confu325 N. Howard St.<br />\nsion.<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nMt. Vernon 4999<br />\n\"—,\" said she, clumsily, greeting<br />\nOrchestra—Dancing<br />\nher mother.<br />\nTelephone, Vernon 3442<br />\nNECKWEAR \"—,\" I added, looking up from<br />\nSHIRTS<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M<br />\nNow In Its<br />\nthe fire that I had been punching<br />\nTABLE D'HOTE<br />\nvigorously.<br />\nD1NNER—$1.00<br />\nLUNCHEON-60c<br />\nELEVENTH WEEK<br />\n421 N. HOWARD ST.<br />\n\"--,\" was her laughing reply.<br />\nSUNDAY D1NNER—$1.25<br />\nGLOVES<br />\nHOSIERY<br />\nThere was an embarrassing<br />\nANNE NICHOLS' LAUGHING<br />\npause. Molly poured out the tea.<br />\nSUCCESS<br />\nSTRATTON SHIRT MAKER<br />\nHer mother glared. I wished I<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00 had not come.<br />\nDress Shirts<br />\n$3.25 and $4.25 \"—,\" said I, looking at the heavy<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on 'clouds outside.<br />\nShirts<br />\n\"—,\" her mother answered, frig- YOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nAlso a Full Line of Men's<br />\nidly.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nFurnishings<br />\nI took my hat and gloves.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nEstablished 1873<br />\n\"—,\" said her mother, ignoring<br />\nproffered hand.<br />\nFetting Manig Jewelry Co. myMolly<br />\nblushed.<br />\nManufacturers<br />\n1724 N. CHARLES ST.<br />\nThe door closed behind me.<br />\nreek Letter Fraternity Jewelry<br />\nTHE PLAY THAT PUT<br />\n10 Minutes from Hopkins<br />\n\"—,\" said I, softly.—Stanford Vernon 3055<br />\nU IN HUMOR<br />\nST.,<br />\nBaltimore,<br />\nMd.<br />\n213 N. LIBERTY<br />\nChapparal.<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nSLAVEMAKER<br />\n<br />\nW.L. Mann<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nAcademy of Music<br />\n<br />\nLefranc & Ault<br />\n<br />\nIP f<br />\nRADIO!!<br />\n<br />\nRADIO<br />\n<br />\nSUPPLY CO.<br />\n<br />\nABIE'S<br />\nIRISH<br />\nROSE<br />\n<br />\nBI<br />\n<br />\n•<br />\n<br />\n\f", "format": "basic_html", "processed": "EII<br />\nVOL. XXVII. No. 35<br /><br />\n1<br /><br />\nBALTIMORE, MD., MARCH 2, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nA. S. C. E. PREPARES ELAB- MANAGEMENT OF ELEC- R. 0. T. C. TO GIVE BENEFIT ANNUAL ELECTION OF Y. M. SWIMMING TEAM TO MEET<br />\nRUTGERS FOR MIDDLE<br />\nTRICAL CLUB TURNED<br />\nFIRST NIGHT OF \"PURPLE<br />\nORATE PLANS FOR<br />\nC. A. TO BE HELD<br />\nMONDAY<br />\nSTATES CHAMPIONSHIP<br />\nOVER TO JUNIORS<br />\nMASK\"<br />\nMARCH<br />\nProminent Engineers and Upper- Dixon Elected President. Glover Proceeds to Go to Band and Rifle Marsh Nominated for President to Rival Teams to Clash in B. A. C.<br />\nTeam. Night Classes in MiliPool Tonight. Black and Blue<br />\nSucceed Dean. Membership<br />\nP. Fallon Delivers Illustrated<br />\nclassmen to Address OrCampaign<br />\ntary<br />\nScience<br />\nMust Stop Giebel<br />\nProgressing<br />\nProgressing<br />\nLecture at Meeting<br />\nganization<br />\nTickets for the first night of the<br />\nThe annual election of officers<br />\nA t a meeting of the Hopkins<br />\nAlthough no meeting was held<br />\nSWIMMERS TO MEET<br />\nduring February, the March pro- Electrical Club, held last Friday Dramatic Club presentation, The for the Hopkins \"Y\" will be held<br />\nWEST POINT<br />\ngram of the Hopkins student chap- afternoon, the management of the Purple Mask,\" are in the hands at 12.30 on Monday, March 5, in<br />\nImmediately<br />\nafter the<br />\nter of the American Society of society was turned over by the reof the members of the Reserved Room 104, M. E. The election will<br />\nRutgers<br />\nmeet<br />\nHopkins<br />\nswimCivil Engineers is expected to be tiring Senior officers to the newlyOfficers'<br />\nmers<br />\nTraining<br />\nCorps<br />\nwill<br />\nbe<br />\nUnit,<br />\ncarried<br />\nentrain<br />\nunby<br />\non<br />\nthe<br />\nvotes<br />\nfor<br />\nof<br />\nWest<br />\nall<br />\nthe biggest yet attempted this year. elected members of the Junior<br />\nPoint<br />\nwhere<br />\nthe<br />\nArmy<br />\nteam<br />\nTwo meetings will be held; one Class. Those elected are J. T. Dix- der the leadership of the Hopkins active members of the \"Y\", meanwill<br />\nbe<br />\nencountered<br />\ndual<br />\nin<br />\na<br />\nmilitary<br />\ning<br />\ndepartment.<br />\nall<br />\nprices<br />\nmen<br />\nThe<br />\nwho<br />\npresident;<br />\nhave recently<br />\nduring the first part of the month, on,<br />\nP. K. Aubel, vicemeet<br />\non<br />\nSaturday<br />\nnight.<br />\nand the second during the latter. president; Ferdinand S. Hambur- of the seats are: $2.50 for box signed the membership card.<br />\nArmy and Hopkins defeated<br />\nAt each of these a Swell-known en- ger, Jr., treasurer, and J. H. Long, seats; $2.00 for orchestra seats up<br />\nThe nominating committee apLehigh<br />\nby about the same<br />\ngineer will address the members, Jr., secretary. Paul L. Betz was to and including row M; $1.50 for<br />\npointed by William G. Dean,<br />\nmargin<br />\nand a real battle<br />\nand the usual business meeting and elected chairman of the Program the remainder of the orchestra and<br />\npresident,<br />\nshould<br />\nhas<br />\ntake<br />\nsubmitted<br />\nplace when they<br />\nits<br />\nnomiCommittee; C. H. Black, chairman also for the first four rows of balsmoker will be held.<br />\ntogether.<br />\nget<br />\nnations<br />\nto<br />\nthe<br />\n\"Y\"<br />\ncabinet<br />\nto<br />\nbe<br />\nA speaker for the first meeting of the Membership Committee, and cony center, and the first two rows<br />\nof the month has not yet been se- C. 0. Rector, chairman of the Pub- of balcony right and left; and $1.00 voted upon at the election. The<br />\nfor the rest of the balcony. Before nominees are: President, T. R. Holding victories over Swarthcured, but the officers are endeavor- licity Committee.<br />\ning 'to secure a prominent bridge<br />\nThe successful season enjoyed by turning in the receipts for the tick- Marsh; vice-president, Paul Syl- more and Lehigh, the Johns Hopofficial from the Baltimore and club so far this year is due en- ets sold, each member of the unit vester; secretary, Karl E. Miller; kins swimming team meets RutOhio Railroad Central Office. The tirely to the untiring efforts of the is permitted to take $2.00 worth<br />\ngers tonight in the B. A. C. tank to<br />\ntreasurer, Randolph Norwood.<br />\nThese include of tickets for himself. This is in<br />\nsecond meeting of theTmonth will retiring officers.<br />\nThe committee chairmen and decide the swimming championship<br />\nbe addressed by Mr. V. Bernard William Alderson, president; Har- accordance with the provision made<br />\nof the Middle Atlantic States.<br />\nSiems, associate civil engineer in old. Breslau, vice-president; Calvin that each man paying his Students' the Student Advisory Council will<br />\nthe Baltimore Water Department, N. Warfield, secretary; Leroy Mat- Activities Fee is entitled to 2.00 be selected by the new cabinet, Rutgers is depending for a<br />\nand head of the water and construc- thews, treasurer, and Henry H. Vo- worth of tickets free. All under- which will be installed on the large part upon their captain and<br />\ntion division. His talk will be il- gel, chairman of the membership graduates not members of the R. Tuesday after the election. At star swimmer, Leo Giebel, to caplustrated by special lantern slides, committee. Through the work of 0. T. C. can get their tickets from<br />\nthat time the new officers will ture the meet. Giebel, who is one<br />\nand will be strictly technical. Mr. the latter, the membership of the George Shriver for the performof the foremost swimmers in colSiems will cover the design of the club was raised to thirty-five, prac- ance on Tuesday, March 13. There meet with the old cabinet and the<br />\nlegiate<br />\nranks, swam in Hopkinsnew water distributing system of tically all the junior and senior elec- will be a dance after the show on retiring men will make final reports of their work for the year, Rutgers dual meet at New Brunseach night.<br />\nBaltimore, and will give the high trical engineering students.<br />\nspots on the pitometer work of the<br />\nThe purpose of the benefit is to and turn over their duties to the wick last year and captured a first<br />\nAn excellent program was enWater Department.<br />\njoyed at all the meetings this sea- secure funds for the support of the new men. This meeting will be place in the fifty-yard and backProfessor John H. Gregory, head son through the work of C. L. band and rifle team. In order to held<br />\nstroke; also swimming on the vicover the banquet board at<br />\nof the department of civil engineer- White, chairman of the program accompany the f- ootball team on its<br />\ntorious relay. In the fifty, Giebel<br />\ning at Hopkins, who is also presi- committee. During the year sev- out-of-town games next fall, the the Johns Hopkins Club Tuesday,<br />\nequalled<br />\nthe intercollegiate record,<br />\ndent of the Baltimore section of the eral prominent engineers, includ- band needs money. The presence March 6, 6 P. M.<br />\nThe membership campaign is doing the distance in 25 seconds<br />\nA. S. C. E., announces that mem- ing pr. B. E. Sliackelford, of the of the band at games away from<br />\n.. A<br />\nbsers of the student chapter have Westinghouse Lamp Company, home is desirable from the stand- progressing<br />\ncue', in tne nrst part ot t e<br />\nvery well. Any one ia<br />\nbeen declared non-voting members and Mr. J. Lynch, of the Westing- point of both the team and Hopkins<br />\nwho signs the card thereby signi- present season lowered by several<br />\nof the Baltimore section of the so- house Electrical and Manufacturing rooters. The organization made<br />\nseconds the intercollegiate record<br />\nciety, and will be welcomed at the Company, addressed the society on one such pip last fall, to the Hav-4fying his sympathy with the<br />\nfor the 440-yard swim.<br />\nregular monthly meetings. These electrical topics. A number of the erford game, and helped greatly to principles thereon becomes an acare usually held on the last Tues- students, also, have spoken before \"pep\" things up for Hopkins. More tive member with voting power. Welsh is expected to give the<br />\nday of each month. Professor the society at various times. The trips will be made this fall if the The four principles are: 1. To New Brunswick star a close rub in<br />\nthe 100 or the 50, whichever the<br />\nGregory would like to see Hopkins last of these addresses was deliv- money is available. The rifle team lead students to faith<br />\nin God latter chooses to enter. Welsh<br />\nwell represented at future meet- ered by Glover P. Fallon. His sub- has hitherto been supported largethrough Jesus Christ. 2. To lead swam 100 in 583-5 at Columbia<br />\nings, which will be held at the En- ject was \"The Liberty Automatic ly by members of the military dethem into membership and service last week, while Giebel was only<br />\ngineers' Club.<br />\nTelephone Exchange.\" Mr. Fal- partment, since all Hopkins men,<br />\nin<br />\nthe Christian church. 3. To pro- able to do 2-5 of a second better at<br />\nAt the last meeting of the Balti- lon has worked for the Chesapeake whether members of the Reserved<br />\nmore section several Hopkins rep- and Potomac Telephone Company Officers' Training Corps or not, are mote their growth in Christian Lehigh.<br />\nMorrell may also give the Rutresentatives were present.<br />\nMr. during the summer months, and so eligible for the team, it ranks as a faith, especially through the study<br />\ngers captain a scare in the backLong, superintendent of bridges for was able to deliver a very interest- campus activity. The profits for of the Bible.<br />\n4. To challenge<br />\nstroke. Last year this event was the<br />\nthe Baltimore and Ohio Railroad, ing and authoritative talk. The next the first presentation of \"The Purthem to devote themselves in<br />\nmost closely contested on the pro\":spoke on the recently constructed meeting of the club will be held in ple Mask\" on Monday, March 12;<br />\nAllegany River bridge. Besides the the near future. The exact day and will be devoted entirely to both of united effort to make the will of gram in the dual meet, Giebel deGod effective in human society, feating the Hopkins man by inches.<br />\nusual maps and profiles, the actual time will be posted shortly on the these college activities.<br />\nand to extend His kingdom<br />\nconstruction and rolling of the E. E. Bulletin Board.<br />\nCoady will experience difficulty<br />\nMembers of the military unit are<br />\nbridge was shown. After the talk<br />\nin<br />\nwinning the fancy dive. Galplanning to attend the play in uni- throughout the world.<br />\nthe members asked several quesbraith<br />\nis one of the best divers in<br />\nStop in the \"Y\" office and sign<br />\nform. Instead of the usual khaki<br />\ntions, and then a report from the DRIVE FOR \"Y\" MEMBERS ON shirt,<br />\nthis<br />\npart<br />\nof the country, and has<br />\nhowever, a white shirt, with a card and become a member.<br />\nnational committee was read. This<br />\nnot<br />\nbeen<br />\ndefeated<br />\nduring the presThe drive for active members of a soft collar and black four-inmeeting is typical of all the regular<br />\nent<br />\nseason.<br />\nLubin,<br />\nalso of Rutthe University Y. M. C. A. has hand tie, will be worn.<br />\nmonthly meetings.<br />\ngers,<br />\nhas<br />\nbeen<br />\nshowing<br />\nexcellent<br />\nThe military department is well COPY FOR \"PROM\" NUMBER<br />\nbeen going on for the past week.<br />\nDuring the remainder of the year<br />\nform<br />\nin<br />\nthis<br />\nevent.<br />\nHe<br />\nis<br />\nMetroContinued on page 4, col. 3<br />\nTo date about thirty men have<br />\nOF BLUE JAY DUE TODAY<br />\nthe student chapter will inaugurate<br />\npolitan<br />\nchampion<br />\nin<br />\nthe<br />\nhigh<br />\ndive,<br />\nsigned the membership roll and sigCopy for the \"Prom\" number of having beaten<br />\nthe plan already in vogue with the<br />\nArmstrong,<br />\nof<br />\nPenn.,<br />\nnified their intention of backing the<br />\nNOTICE<br />\nthe Black and Blue Jay is due to- in this<br />\nMechanical and Electrical Clubs, of<br />\nevent. Galbraith last year<br />\n\"Y\" to the limit. Membership<br />\nday.<br />\nThis number will appear finished second<br />\nhaving members address the meetto Armstrong in the<br />\nAll<br />\nBlue<br />\nAd<br />\nJay<br />\nCopy<br />\nand<br />\nMarch 20.<br />\nings. The seniors and officers of costs nothing, and among the many<br />\nContracts must be in hands<br />\nintercollegiate<br />\nchampionships.<br />\nthe club will probably be the first privileges is the privilege of voting<br />\nof Business Manager by 1 P.<br />\nThe first dinner of the combined<br />\nDunning should have an easy<br />\nto speak under the new plan.<br />\nat the annual election of officers.<br />\nM. Friday.<br />\nBlue Jay staffs will be held at The time in the breast-stroke event.<br />\nBarn, Monday night at 6.30. The Potts, the Rutgers entrant, swam<br />\nBenefit Class 1923<br />\npurpose<br />\nof this dinner is to get the the distapce in 1.25 1-5 against<br />\nGoucher College<br />\neditorial,<br />\nart and business staffs in Swarthmore, while Dunning has<br />\nTuesday Night, March 6.<br />\ncloser<br />\nconjunction.<br />\nHitherto, the done the 100 yards in 1.18 2-5, in1923<br />\nboards<br />\nhave<br />\nbeen<br />\nworking<br />\nas sep- cidentally breaking the South AtAuditorium Theatre<br />\narate<br />\norganizations<br />\nand<br />\nit is the lantic record.<br />\n\"KEMPY\"<br />\npurpose<br />\nof<br />\nEditor-in-Chief<br />\nthe<br />\nand<br />\nINTERCOLLE<br />\nEASTERN<br />\nInquire at News-Letter Office<br />\nGIATE CHAMPIONSHIP<br />\nThe result of the meet probably<br />\nthe Business Manager to obtain<br />\nfor Tickets<br />\nhinges upon the result of the relay.<br />\ncloser working harmony between<br />\nHopkins will, in all probability, cap0. D. K. meeting Tuesday,<br />\nthe staffs.<br />\nture<br />\nthe 50 or the 100, the breast7.30 P. M., in Room 206<br />\nElections for next year's Board stroke and the plunge. The Black<br />\nTickets, $1.50 per couple<br />\n$1.00 Stag<br />\nM. E. Bldg.<br />\nof Control will take place at this and Blue can also count upon secickets obtainable from members of Swimming Team<br />\nCotillon Club Dance Satdinner. As is the custom the Se- onds in the backstroke, the 50 or<br />\nat Athletic Office<br />\nurday, 4.30 P. M., C. E.<br />\nniors on the staff will resign at the 100 and the 220, with a fair<br />\nHall.<br />\nthis time and other men will be chance for a first in any of these.<br />\nelected to fill their places.<br />\nContinued on page 3, col. 3<br /><br />\nHOPKINS-RUTGERS<br />\nSWIMMING MEET<br /><br />\nat B. A. C. Pool TONIGHT,8 P. M.<br /><br />\ni<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nFOUNDED 1897.<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nManaging Editor:<br />\nJ. HUDSON HUFFARD, '23.<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLL '24.<br />\nAssociate Editors<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\nJunior Editors:<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\nW. EDWARD THOMSEN, '26.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nERNEST A. STRATHMAN, '26.<br /><br />\nBusiness Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN,'23.<br />\nCirculation Manager:<br />\nPHILIP W. HOWARD, '25.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nFITZGERALD DUNNING, '24.<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN C. LEWIS, JR., '23<br />\nJOHN T. DIXON, '24.<br />\nA. J. McKAY, '26.<br /><br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., MARCH 2, 1923<br />\n\"THE PURPLE MASK\"<br />\nThe next event of importance on the Hopkins schedule and the<br />\nonly effort of its kind is the presentation by the Dramatic Club, a<br />\nweek from next Monday and Tuesday, of \"The Purple Mask.\"<br /><br />\nTICKETS FOR JUNIOR PROM SONGBOOK PAYMENTS SLOW<br />\nPLACED ON SALE<br />\nSeveral weeks ago, an article apTickets for the Junior Prom, to peared in the NEWS-LETTER exbe held March 23 in the C. E. Hall, plaining the deficit faced by the<br />\nhave been placed on sale and mem- managers of the 0. D. K. Hopkins<br />\nbers of the committee report a large Songbook and requesting that back<br />\ndemand for the pasteboards. On payments be made as soon as posaccount of this demand and the lim- sible. Very few students seem to<br />\nited capacity of the ball, it has been have taken the article seriously, but<br />\ndecided to limit the number attend- it is of utmost importance to 0. D.<br />\ning to 85 couples. Tickets are ob- K. that back bills be paid up at<br />\ntainable from members of the com- once by the students. If more remittee, which is composed of Ken- turns are not realized soon, each<br />\nnady, chairman; Leopold, G. M. debtor will receive in his postoffice<br />\nShriver, Jr., Dunning, Gardner, box a bill which it is hoped will be<br />\nMount, Hamburger and Devours. honored. As this will mean a great<br />\nFisher's orchesrta, six pieces, deal of trouble to the Society and<br />\nhas been procured for the event. some expense, the managers earAttractive favors have been select- nestly hope that the bills will be<br />\ned and Hamburger, in charge of voluntarily paid. Either Landy or<br />\nthe decorations, promises some- Norwood will receive payments or<br />\na note may be left in P. 0. Box No.<br />\nthing distinctive and unique.<br />\nThe Black and Blue Jay Business 415.<br />\nStaff is considering the matter of<br />\nA BAD STORY<br />\ndistributing the Prom Number of<br />\nIkey and Pat were wounded in<br />\nthe Blue Jay, which appears three<br />\ndays before the event, to the fair an engagement in the Argonne. A<br />\npriest making his rounds found<br />\nsex who are present.<br />\nAmong those whom the commit- them. After giving the Irishman<br />\ntee will attempt to secure as chap- the last rites he went over to Ikey<br />\nerones are: Dr. and Mrs. Goodnow, and said: \"Do you .believe in the<br />\nDr. and Mrs. Latane, Dr. and Mrs Father. Son and the Holy Ghost?\"<br />\n824<br />\nGrand Total<br />\nWhitehead, Major and Mrs. Garey. Ikey groaned and rolled over.<br />\nThis week the rifle team is in a<br />\n\"Oi, Oi! Here I am dying and<br />\nmatch with Iowa State. All four<br />\nyou ask me riddles.\"-Yellow Jackpositions will be used and all ten FRATERNITY OPINION IS et.<br />\nscores will count. The team will SOUGHT ON NEXT RUSHconsist of G. M. Ruoff, R. E.<br />\nING SEASON<br />\nParks, H. E. Wilgis, J. E. Mount, At the regular weekly meeting of<br />\nW. M. Rowland, F. E. Williams,<br />\nBoard, held last<br />\nJ. D. Virdin, F. T. Bates, J. A. the Interfraternity<br />\nCochran and A. E. Thiessen. At Monday at 12:30, questionnaires<br />\nthe same time, the fourth stage of were sent out to the various fraterthe intercollegiates, prone and sit- nities represented on the Board for<br />\nting, is being completed. H. E. the purpose of determining the senWilgis, G. M. Ruoff, W. M. Row- timent of the fraternities with reland, R. E. Parks, and J. E. Mount<br />\ngard to next year's rushing season.<br />\nare on this team.<br />\nDi rino- th week endin March When these questionnaires are<br /><br />\nHOPKINS RIFLEMEN MEET<br />\nPRINCETON AND COMPLETE 1 HIRD STAGE<br />\nPrinceton Wins_ 498 to 490. Iowa<br />\nState Being Met This Week<br />\nin Intercollegiates<br />\nPrinceton defeated Hopkins in<br />\na rifle match for the week ending<br />\nFebruary 23, by a score of 498 to<br />\n490. The shooting was done only<br />\nfrom the prone position, and only<br />\nthe five highest scores counted.<br />\nThe individual scores of the Hopkins team were as follows:<br />\nR. E. Parks, 100; G. M. Ruoff,<br />\n98; A. E. Thiessen,98; H. E. Wilgis, 97; W. M. Rowland, 97; J. E.<br />\nMount, 95; F. E. Williams, 94; J.<br />\nD. Virdin, 94; F. T. Bates, 93;<br />\nand J. A. Cochran, 89. Total of<br />\nfive highest, 490.<br />\nThe third stage of the intercollegiates from the prone and standing positions, was completed last<br />\nweek. The scores were as follows:<br />\nPr. St. Tl.<br />\n99 81 180<br />\nW. M. Rowland<br />\n98 78 176<br />\nH. E. Wilgis<br />\n75 171<br />\n96<br />\nCochran<br />\nA.<br />\nJ.<br />\nF. E. Williarns....100 59 159<br />\n93 45 138<br />\nR. E. Parks<br /><br />\nSOPHISTICATED<br /><br />\nle ciuu s o 'ering,<br /><br />\n9, Carnegie Tech will be met in filled out and returned, a commitKing,\" one of the dramatic critics of a local daily (and, incidentally, the prone and standing positions, tee will be appointed to consider<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\none of the most reliable critics in the country) expressed the belief and the University of Washing- them and to formulate a rushing<br />\nit all in a book, either. For<br />\nagreement.<br />\nthat the Hopkins Dramatic Club would find itself in the serious posi- ton in all four positions.<br />\ninstance-his clothes are<br />\ndreams and his grooming an<br />\nPlans for the proposed Interfration of having an extremely high standard to 'reach, in the attempt<br />\ninspiration.<br />\nto approach the artistic merit of its 1922 show. The play truly met CANE CLUB HOLDS \"TAP ternity Smoker, to be given by the<br />\nHe gets that finely turned-out<br />\nDAY\"<br />\nhead from\"Vaseline\"HairTonic.<br />\nnewly-initiated freshmen, are prowith the 100% approval of the student body as well as of the regular<br />\nIt smooths and grooms the hair.<br />\ntheatre-gQers. The students, the most critical audience in the world, The annual \"Tap Day\" of the gressing. The date will be anAt all drug stores and student<br />\nCane Club took place Monday at nounced in the near future.<br />\nbarber shgps.<br />\npronounced \"If I Were King\" a great show.<br />\nEvery\"Vaseline\"Isrocluct is<br />\nCane<br />\nwith<br />\naccordance<br />\nIn<br />\n:30.<br />\n12<br />\nrecommended everywhere<br />\nThose connected with the Dramatic Club unhesitatingly declare<br />\nbecause of its absolute pu.<br />\nClub customs, the initiates were<br />\nrity and effectiveness.<br />\nyear.<br />\nlast<br />\nof<br />\nthat<br />\nto<br />\nsuperior<br />\nbe<br />\nto<br />\nthe latest offering<br />\nlined up before Gilman Hall and the<br />\nNorah-What's wrong, sonny?<br />\nThe Monday night performance is under the management of the Club approached in chariots,<br />\nSonny-I-I burnt my h-hand in<br />\nR.0. T. C. for the benefit of the Rifle Team and the Band. The sec- hearses, shays, etc. The new memthe<br />\nh-h-hot water.<br />\nond night is devoted to the remainder of the student body. The pro- bers are: W. G. Packard, F. L.<br />\nNorah-Serves ye right, ye little<br />\nceeds of this night go into the coffers of the Student Activities Coun- Ross, J. W. Parsons, R. P. O'Concil.<br />\nnor, W. F. Passano, F. W. Rich, fool. Why didn't ye feel the waChesebrough Mfg.Co.<br />\nTickets are obtainable now at the Barn. If you doubt the value L. C. Muth, J. T. Baker, C. C. G. ter before ye put your hand in it?(consolidated)<br />\nEvans, J. S. V. B. Shriver and E. Jack-o-Lantern.<br />\nof the show, ask the man who saw \"If I Were King.\"<br />\nJones.<br />\nFollowing the \"tapping,\" the<br />\nClub had lunch at the College Inn.<br />\nOn Monday evening an elaborate<br />\n16<br />\nCAN SPRING BE FAR BEHIND?\"<br />\ndance was given at the Arundell<br />\nThough March has but begun, there is a certain balmy feeling in Club in 'honor of the new members.<br />\ns the way a JOHN HANCOCK salesman described<br />\nthe air, the first robin has been spotted, and a case of \"fevericus<br />\nFollowing the Princeton 'lacrosse<br />\n. his work. He is a college graduate and in five<br />\nspringum\" has already been reported to the Health Department. It game, the Cane Club will give an<br />\nyears has put himself at the very top of his<br />\nwill not be many days before an,observer at the Barn will see stu- old-fashioned tea dance, at which<br />\nbusiness.<br />\ndents lounging in chairs on the rim of the fountain, or even perched time the members will bring their<br />\nHe never yet has called upon a prospect without<br />\nin positions denoting physical and mental lassitude, on the ground. girls out in hacks.<br />\na previous appointment. The best life insurance<br />\nthe<br />\nof<br />\ncause<br />\nthe<br />\nto<br />\nas<br />\nspeculation<br />\ntoday work on that plan, making it a busiannual<br />\nsalesmen<br />\ntheir<br />\nbegin<br />\nProfessors will<br />\nsuch as any worthy and ambitious<br />\ndignity,<br />\nof<br />\nthe<br />\nness<br />\nbecause<br />\nthemselves<br />\nrebuke<br />\nwill<br />\nand<br />\ncuts<br />\nof<br />\nincreasing numbers<br />\nOHIO STATE HOLDS SPRING<br />\ncan find satisfying to his mental<br />\ngraduate<br />\ncollege<br />\nFOOTBALL PRACTICE<br />\nlast quiz was so hard that a majority of the class flunked.<br />\nremunerative as well.<br />\nhighly<br />\nand<br />\nneeds,<br />\nTaking advantage of the recent<br />\nis<br />\nthere<br />\nAnd<br />\nspring.<br />\nquoted is the John Hancock's<br />\nonly<br />\nabove<br />\nman<br />\nThe<br />\nis<br />\nit<br />\ndoctors,<br />\nDon't worry, learned<br />\n\"let down\" in the usual cold winThis shows what college<br />\nagent.<br />\ngeneral<br />\nyoungest<br />\nrecall,<br />\nwill<br />\nyou<br />\nIf<br />\nundergrads.<br />\nfellow<br />\nnothing wrong with your liver,<br />\nof<br />\nWilce,<br />\nW.<br />\ntry<br />\nJ.<br />\nCoach<br />\nblasts,<br />\ncan do in this business,<br />\ntype<br />\nright<br />\nthe<br />\nof<br />\ngraduates<br />\nyou experienced the same symptoms last March. You can't help Ohio State University, has already<br />\ncan build up earning power and at the<br />\nthey<br />\nhow<br />\nyourself. Medicine has not yet found a cure for leprosy. It never<br />\nsame time provide for an accumulated competence<br />\ninaugurated spring practice in foot.<br />\nthe years to come.<br />\nfor<br />\nwill find one for spring fever.<br />\nball, and has mapped out an intenis a vital period in your life and you<br />\nGraduation<br />\npart<br />\nfirst<br />\nThe<br />\nwith.<br />\nover<br />\nBut have your attack early and get it<br />\nsive spring campaign to teach his<br />\nare liable to hold to the business you start in. It<br />\nof March marks the opening of the Spring Season Ticket Sale. Ac- rookies the fundamentals of the<br />\nwould be well before making a definite decision to<br />\ninquire into life insurance as a career. Address,<br />\ncording to athletic authorities, $5,000 is needed to carry out our game by outdoor drills.<br />\n\"Agency Department.\"<br />\nspring schedule. There will be no demand for the tickets. The un- During these early practices, the<br />\ndergraduates must bear the brunt of the selling and hard work and gridiron warriors are clad in regapplied enthusiasm are necessary.<br />\nular uniform, and sprinting, puntThis is just a warning. The real campaign does not begin for ing and receiving the ball are in'AL<br />\nseveral weeks. Stretch in front of the Barn for two weeks; listen to dulged in. In the annual spring<br />\nCOMPANY<br />\nINSURANCE<br />\nLI<br />\nFE<br />\nin<br />\nOF BOSTON. MASSACHUSETTS<br />\nthe robins, if you can find them. But when the gong goes, jump to it. tournament, to be held early<br />\nexSell your quota of tickets and more. Then, if you wish, lie down on April, Coach Wilce will learn<br />\nLargest Fiduciary Institution in New England<br />\ntraining<br />\nthe<br />\nto<br />\nwho<br />\nresponded<br />\ng<br />\nactly<br />\nat<br />\nattack<br />\nyour<br />\nand<br />\nhave<br />\nsunshine<br />\nwarm<br />\nthe<br />\nthe grass, stretch in<br />\nand to what degree.<br />\nJ. L.<br />\nyour leisure.<br />\nLast year, commen mg upon<br /><br />\n1<br /><br />\nVaseline<br /><br />\nHAIR TONIC<br /><br />\n•<br />\na \"Best Paid Hard Work in the World\"<br />\n•<br /><br />\n111<br /><br />\nI<br /><br />\naaaaaaaaaaaaaaaaaaaaa<br /><br />\nat<br />\nill<br /><br />\nha<br />\nCl<br />\n0<br />\nAV<br /><br />\nSt<br />\noi<br />\nel<br />\n13<br />\nii<br /><br />\nt1<br />\nt(<br />\nti<br />\n1-<br /><br />\n-a<br /><br />\n1<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br /><br />\nthe<br />\nins<br />\ntck<br /><br />\nDSto<br /><br />\n)ut<br />\nD.<br />\nat<br />\nrech<br />\nice<br />\nbe<br />\nat<br />\nrid<br /><br />\nbe<br />\nor<br /><br />\nOr<br /><br />\no.<br /><br />\n220-yard Swim—Hopkins (CoaSTUPID STUDENTS MARRY Swimming Team to Meet,Rutgers Rutgers (Galbraith and Lubin).<br />\nTAU BETA PI DENIES THE<br />\nChampionship<br />\nStates<br />\nMiddle<br />\nfor<br />\nPlunge—Hopkins (Howard and dy); Rutgers (Redman and FosBright students marry bright<br />\nCHARGE OF DISContinued from page 1.<br />\nHambleton); Rutgers (Sparks and ter).<br />\nCRIMINATION<br />\nstudents and stupid students marry<br />\nteam is able Von Stanley).<br />\nA number of prominent Juniors stupid students, according to find- If the Hopkins relay<br />\n100-yard Swim—Hopkins (Bullseems likely<br />\nthe<br />\nrelay,<br />\nit<br />\ncapture<br />\nto<br />\nWashingUniversity<br />\nof<br />\nthe<br />\nand Seniors in the Civil Engineer- ings at<br />\nBack Stroke—Hopkins (Morrell<br />\nchampionStates<br />\nMiddle<br />\nthe<br />\nthat<br />\nrefrom<br />\nmade<br />\nrer and Welsh); Rutgers (Giebel<br />\ning Department of the University ton. The study was<br />\nBaltimore for a and Hambleton); Rutgers (Giehave recently charged the Hopkins ports of 200 married graduates by ship will reside in<br />\nand Rossetti).<br />\nbel).<br />\nChapter of the Tau Beta Pi Hon- the psychology department. There year.<br />\nFollowing the completion of the<br />\norary Engineering Fraternity is, however, no correlation of intelwith discriminating against the ligence between couples at a dance, meet, dancing will be held in the<br />\nstudents of their department in according to the report, because a B. A. C. gymnasium. The Blue<br />\nYou collegians who stroll along the campus will<br />\nthe choice of members. Several fellow does not choose a dancing Jay Six will furnish the music.<br />\nbe among the first to sense the coming of Spring.<br />\nof them claim that their grades partner on account of her intelli- Tickets may be obtained from memDoesn't that suggest something to you in the<br />\nbers of the swimming team or from<br />\nwere high enough to make them gence.<br />\nmatter of clothes?<br />\nOffice.<br />\nthe<br />\nAthletic<br />\nsociety.<br />\nin<br />\nthe<br />\nelection<br />\neligible for<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nFOOLED<br />\nThey maintain also that if the Tau<br />\nLineup:<br />\nSuits if you want to know college style at its best.<br />\nBeta Pi discriminates against civ- Her cheeks he said are roses red, 200-yard Relay—Hopkins (Coail engineering students it should<br />\ndy, Lord, Buhrer, Welsh); RutAnd lovely as can be;<br />\nbe refused recognition as a uni- Her ruby lips are treasure ships gers (Giebel, Cass, Foster, Ross).<br />\nversity organization. In this case<br />\nilaae1iand414r<br />\n200-yard Breast Stroke—HopThat speak of love to me;<br />\nthey advise the installation of anRutBuhrer)<br />\n;<br />\nBut when to kiss this little miss, kins (Dunning and<br />\nother honorary engineering fragers (Potts and Brenner).<br />\nThe booby took a notion,<br />\n(Y. M. B. 0. D.)<br />\nternity, preferably the Sigma Tau.<br />\n(Welsh<br />\nSwim—Hopkins<br />\n40-yard<br />\nHe found her lips were painted<br />\nCalvin N. Warfield, a Senior in<br />\nand Buhrer); Rutgers (Ross and<br />\nBaltimore and Hanover<br />\nships<br />\nthe Electrical Engineering DeCass).<br />\nUpon a painted ocean.<br />\npartment and president of the<br />\n—Burr.<br />\nFancy Dive—Hopkins (Coady);<br />\nHopkins chapter of the Tau Beta<br />\nPi, when interviewed _last Tuesday afternoon, said: \"These<br />\ncharges are absolutely groundless.<br />\nThe Tau Beta Pi never has and<br />\nnever will discriminate against<br />\nany class of engineering students.<br />\nThe reason no civil engineering<br />\nstudents were elected this year is<br />\nmerely that there were no men<br />\nin the department with sufficiently<br />\nhigh grades.\"<br /><br />\nY-401144<br /><br />\nINTERFRATERNITY SMOKER<br />\nCOMMITTEE MEETS<br />\nA meeting of the fraternity<br />\nfreshmen chosen to represent<br />\n•their various fraternities with reference to the arrangement of a<br />\nFreshman Smoker met in Room<br />\n113, Gilman Hall, at 12.30 P. M.<br />\ntoday. The- foilowing—m-en were<br />\npresent: Alpha Kappa, Powell;<br />\nPi Kappa Pi, Kidd; Silver Arrow,<br />\nDunnbeller ; Kappa Sigma, Sandsbury; Omicron Kappa Omicron,<br />\nPledge; Alpha Delta Phi, Hiss;<br />\nDelta Gamma Theta, Ningard ;<br />\nPi Kappa Chi, Townsend; Beta<br />\nTheta Pi; Webster; Kappa Alpha, Holls ; Sigma Tau Delta,<br />\nHudson; Phi Gamma Delta, Stick,<br />\nDelta Phi, Nelson.<br />\nKlinefelter, in behalf of the Interfraternity Board, explained the<br />\nmethod in which the smoker was<br />\nconducted last year, and told of<br />\ntheir mistakes, hoping that the<br />\ncommittee this year might profit<br />\nby them.<br />\nA meeting will be held today to<br />\ndecide upon the night and the<br />\ntime. At this meeting various<br />\nmen will take charge of the different plans for the smoker.<br /><br />\nPUBLIC SALES<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nshoes, sizes 51<br />\n/<br />\n2 to 12 which<br />\nwas the entire surplus stock<br />\nof one of the largest U. S.<br />\nGovernment shoe contractors.<br />\nThis shoe is guaranteed one<br />\nhundred per cent, solid leather, color dark tan, bellows<br />\ntongue, dirt and waterproof.<br />\nThe actual value of this shoe<br />\nis $6.00. Owing to this tremendous buy we can offer<br />\nsame to the public at $2.95.<br />\nSend correct size. Pay postman on<br />\ndelivery or send money order. If<br />\nshoes are not as represented we<br />\nwill cheerfully refund your money<br />\npromptly upon request.<br /><br />\nNalional Bay State<br />\nshoe Company<br />\n_296 Broadway, New York, N. Y.<br /><br />\nEngineering Levels Mountains<br />\nThe Pack Train has become a relic of the<br />\npast, along with the Prairie Schooner.<br />\nModern methods of transportation have<br />\nleveled mountains, brought San Francisco<br />\nnearer to New York, and widened the markets of all our great industries.<br />\nAnd the engineering brains and energy,<br />\nthat have developed transportation to the<br />\nprominence it holds in the business of the<br />\nworld today, are no longer employed in<br />\nimproving means of overland travel alone.<br />\nStreet Railways, Elevator Systems, Interurban Lines and Improved Shipping Lines—<br />\nthese are some of the accomplishments of<br />\nengineering in the development of better<br />\ntransportation.<br />\nNeither have the builders of such systems<br />\nbeen concerned only in the actual hauling of<br />\npeople and materials. A study of the methods<br />\nof handling passengers and freight at the<br />\nlarge terminals has developed the Terminal<br />\nEngineer, who has greatly improved existing<br /><br />\nACHIEVEMENT<br /><br />\nmethods, and has developed entirely new<br />\nones, as well.<br />\nEngineering, as it is applied to transportation, has had to concern itself with many<br />\nkinds of materials and many ways of handling<br />\nthem under all manner of circumstances.<br />\nFor instance the problems surrounding the<br />\nhandling of iron ore, in bulk, are vastly<br />\ndifferent from those encountered in moving<br />\nany one of the finished products manufactured from iron ore, that must also be<br />\ntransported in large quantities. But Engineering constantly meets each situation with<br />\nimproved transportation facilities.<br />\nIndustry, as a whole, and the nations and<br />\nthe people of the woad owe much to the<br />\nengineers, associate(i id' such large manufacturing industries as Westinghouse. They<br />\nhave not only brought about vast improvements, but they have done so at a constantly<br />\ndecreasing cost to those who derive the<br />\ngreatest benefit from them.<br /><br />\nOPPORTUNITY<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 2, 1923<br /><br />\nAMERICAN STUDENTS TO<br />\nMAKE ITALIAN TOUR<br />\nMr. Paul D. Cravath, President<br />\n(THE BOOK MART)<br />\nof the Italy American Society, announced today that a group of<br />\nComplete Stock of<br />\nAmerica'<br />\ncollege students and inMedical Books and College<br />\nRequisites<br />\nstructors is being organized to travImporters and Dealers in Fine Books el in Italy next summer under the<br />\njoint auspices of the Italy Ameri301 N. CHARLES ST.<br />\ncan Society and the Institute of In.ternational Education. The anBaltimore, Md.<br />\nnouncmeent stated that the purpose<br />\n.r4<br />\nof the undertaking is \"to furnisii<br />\nan opportunity for American college and university students to<br />\nstudy, under scholarly guidance<br />\nand instruction, the monuments of<br />\nAncient Rome, the vast cultural and<br />\n°le) artistic bequests of Renaissance<br />\nie<br />\nv<br />\nXatter<br />\n-e<br />\n1<br />\n,<br />\n4<br />\nC(1<br />\n'<br />\nH.&amp; OSCAR G•LE<br />\n‘j4<br />\nItaly, and the social, industrial and<br />\noWNERS<br />\ncommercial life of the Italy of to1•C4<br />\n?<br />\n.<br />\nitilbZ*..<br />\nday.\"<br />\n29 Baltimore St., East<br />\nThe students will sail from New<br />\nOne Door West of LiglA St.<br />\nYork on the S. S. \"Saxonia,\" on<br />\n910LE AGENTS FOR BALTIMORE<br />\nJune 30, 1923. After landing at<br />\nFor College Fraternity Banda<br />\n(Greek Letter Sodetios)<br />\nCherbourg, they will traverse<br />\nFrance and Switzerland, and enter<br />\nItaly through the Italian Lake District. They will -visit the great inPrinters of Philological and<br />\ndustrial plants near Genoa and TurScientific Works<br />\nin, and then will travel southward<br />\n23 S. HANOVER ST.<br />\nto Rome, Naples and its environs,<br />\nBaltimore, Md.<br />\nthe hill towns of Perugia and Assisi, Florence, Bologna, Ravenna,<br />\nVenice, the Italian battlefields in the<br />\nDolomites, the redeemed city of<br />\nTrento, and Milan. They will return to this country on September<br />\n4th.<br />\nThe \"faculty\" will include Dr.<br />\nAngelo Iipari, of the Department<br />\nof Romance Languages at the UniSOMETHING NEW<br />\nMUSIC<br />\nversity of Wisconsin, as lecturer on<br />\nBeginning March 5<br />\nModern Italy and as instructor in<br />\nEvery Afternoon Exceot Saturday<br />\nFrom 2 until 4 o'clock<br />\nthe Italian language; Professor Edn'-ncing after 3<br />\nward B. T. Spencer, six years a<br />\nM. to 7.30 ft M.<br />\n8, LIBERTY<br />\nresident<br />\nin Rome and now Profes11.3 , •<br />\nsor at Grinnell College, as lecturer<br />\nSARATO<br />\non Ancient Rome and classic art:<br /><br />\nThe Medical Standard Book C<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\n•<br /><br />\nFine Clothes<br />\nA suit by Lemmert gives the final<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more<br />\nfestive occasions.<br /><br />\nR.<br /><br />\n-- - - Give<br />\n---- ----- -F;rat<br />\n-Night of \"Purple Mask\"<br />\nContinued from page 1<br /><br />\nMARYLAND THEATRE<br /><br />\nPrinters of the<br /><br />\nWeek of March 5th, 1923<br />\nsatisfied with the progress of the<br />\nAESOP'S FILM FABLES<br />\nnight classes in military science.<br />\n&amp;ftette'ere-de\"<br />\nRupert Ingalese<br />\nThe attendance has been very reg4<br />\n(One of the World's Finest Jugglers)<br />\n'<br />\n1<br />\nTHE<br />\nAND HIS FLUNKEYS<br />\nular, and there was no decrease in<br />\nIn a Refined Drawing-Room Entertainment<br />\n\\\\ ,..r.<br />\nRtiAP1 ...<br />\nthe enrollment. So well pleased is<br />\nSupported by Miss Angela Grey, the EmiC<br />\nclANI,014<br />\nnent Pianist, from the Queen's Hall,<br />\nMajor Garey with the success of<br />\nLondon<br />\n,<br />\nthe experiment that he believes<br />\n---,1<br />\nJoe Roberts<br />\nmany other universities, within the_ , bj<br />\nMaster Banjoist<br />\n1<br />\nnext five years, will follow our ex. ',u u<br />\nThe International Composer<br />\n-k<br />\nample and start night classes for<br />\nJos. E. Howard &amp; Evelyn Clark<br />\n- Songs by Mr. Howard—Old and New<br />\nthe study of military science and<br />\ntactics.<br />\nHenry &amp; Moore<br />\n441000 I<br />\n\"ESCORTS SUPPLIED\"<br />\n:This is quite the cat's pajamas,\"<br />\nMarga Waldron<br />\nCollege Literature<br />\nsaid the old gentleman, as he picked<br />\nPremiere Danseuse<br />\nIn a Unique Classical Offering<br />\nup some of his wife's lingerie.—<br />\nLOMBARD and SOUTH STREETS<br />\nINTERMISSION<br />\nW. &amp; L. Mink.<br />\nJohns Hopkins News-Letter<br /><br />\nD,N,<br /><br />\nTOPICS OF THE DAY<br /><br />\nMary Haynes<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nIn \"EXCLUSIVE SONGS\"<br /><br />\nTom Patricola<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n$4.50<br />\nii-i<br /><br />\nWARNER<br /><br />\nup<br /><br />\n'<br /><br />\nt¼<br /><br />\nThe<br /><br />\nDato•Wg Pnool,<br /><br />\nwith<br /><br />\nHarriette Towne<br />\nHere Is the Best Jazz Band of Them All<br /><br />\nScranton Sirens<br /><br />\nCOMPANY<br /><br />\nWilliam Lustig. Director<br />\nThe Dancing Carnival Orchestra<br /><br />\nHATTERS<br />\n222 W. BALTIMORE ST.<br /><br />\nAUDITORIUM<br /><br />\n—<br /><br />\nURNER'S<br /><br />\nNext Week<br /><br />\nAre You Enjoying<br />\nThe Benefits of<br /><br />\nMatinees Wednesday &amp; Saturday<br /><br />\nMEN'S SHOES<br />\nRICHARD G. HERNDON<br /><br />\nOf the Better Class<br /><br />\nPresents<br /><br />\nk<br /><br />\n-The Wonder Motor Fuel\"<br />\nMore Power and Mileage<br />\nLess Caron Deposit<br /><br />\nThe Play With 1,000 Laughs<br /><br />\nURNER BROTHERS<br /><br />\nSHERWOOD BROTHERS, INC.<br /><br />\n\"KEMPY\"<br /><br />\n111<br /><br />\nE. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nWith<br /><br />\nFURNITURE OF QUALITY<br /><br />\nand individuality is offered here at prices that are not<br />\nMilii111111111.1111111111111111111111111111<br />\nand cannot be underquoted by any house at any time.<br />\nopkinson bmit , ot the<br />\nosep<br />\nBesides the reputation of an old-established firm<br />\nFriends' School. Brooklyn, as lecis back of each sale with a guarantee.<br />\nturer on Italian Medieval history,<br />\nand other members of college and<br />\nuniversity factulties.<br /><br />\nJ<br /><br />\nGrant Mitchell<br />\nand<br /><br />\nThe Nugents<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nFURNITURE<br /><br />\n,DECORATIONS<br /><br />\nDRAPERIES<br /><br />\nFORD'S<br /><br />\n343 NORTH CHARLES STREET<br />\nA SONG WITHOUT WORDS<br />\nat<br />\nLEMMERT<br />\nWeek of March 5<br />\nannounced the butler.<br />\n19 Fayette Street, East<br />\nAs I bowed she rose and greeted<br />\nMatinees Wednesday &amp; Saturday<br />\nDress Clothes me with a smile. \"— —,\" she inBusiness Suits<br />\nSport Togs<br />\nOvercoats<br />\nvited, making room for me on the<br />\nSAM H. HARRIS<br />\nsofa beside her.<br />\nStore<br />\nPresents<br />\nFine<br />\nof<br />\na<br />\nGreetings<br />\nThe<br />\n\"—,\" I replied.<br />\nHer eyes laughed saucily up at<br />\nMANUFACTURING JEWELERS<br />\nMARY RYAN<br />\nTo the Students of a Fine University<br />\nme.<br />\nLancaster, Pa.<br />\nIn<br />\nClass Rings, Pins, Fraternity Pins,<br />\nI moved closer.<br />\nEtc.<br />\nCups, Medals,<br />\n\"—,\" she threatened, putting a<br />\nStationery, Invitations, Programmes<br />\npillow between us as a safeguard<br />\n\"Makers of the Varsity Seals\"<br />\nHOCHSCHILD,KOHN &amp;C°.<br />\n•<br />\nagainst such movements.<br />\nI turned my hack. Silence. I<br />\nBy Norman Houstan and<br />\nwaited.<br />\nSam Forrest<br />\n\"—,\" she coaxed.<br />\nNo reply.<br />\nCommercial Photography<br />\nWith<br />\n\"—,\" pouting now.<br />\nCircuit Photography<br />\nKrembs,<br />\nFrank M. Thomas,<br />\nFelix<br />\npilthe<br />\nViews<br />\nas<br />\nwhispered,<br />\nLights<br />\nI<br />\n\"—,\",<br />\nFlash<br />\nPaul Nicholson and others<br />\nEnlargements<br />\nfloor.<br />\nlow<br />\nfell<br />\nto<br />\nthe<br />\nGroups<br />\nStaged by Sam Forrest<br />\n\"—,\"struggling.<br />\nKODAK FINISHING<br />\n, The door opened. Wild confu325 N. Howard St.<br />\nsion.<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nMt. Vernon 4999<br />\n\"—,\" said she, clumsily, greeting<br />\nOrchestra—Dancing<br />\nher mother.<br />\nTelephone, Vernon 3442<br />\nNECKWEAR \"—,\" I added, looking up from<br />\nSHIRTS<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M<br />\nNow In Its<br />\nthe fire that I had been punching<br />\nTABLE D'HOTE<br />\nvigorously.<br />\nD1NNER—$1.00<br />\nLUNCHEON-60c<br />\nELEVENTH WEEK<br />\n421 N. HOWARD ST.<br />\n\"--,\" was her laughing reply.<br />\nSUNDAY D1NNER—$1.25<br />\nGLOVES<br />\nHOSIERY<br />\nThere was an embarrassing<br />\nANNE NICHOLS' LAUGHING<br />\npause. Molly poured out the tea.<br />\nSUCCESS<br />\nSTRATTON SHIRT MAKER<br />\nHer mother glared. I wished I<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00 had not come.<br />\nDress Shirts<br />\n$3.25 and $4.25 \"—,\" said I, looking at the heavy<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on 'clouds outside.<br />\nShirts<br />\n\"—,\" her mother answered, frig- YOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nAlso a Full Line of Men's<br />\nidly.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nFurnishings<br />\nI took my hat and gloves.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nEstablished 1873<br />\n\"—,\" said her mother, ignoring<br />\nproffered hand.<br />\nFetting Manig Jewelry Co. myMolly<br />\nblushed.<br />\nManufacturers<br />\n1724 N. CHARLES ST.<br />\nThe door closed behind me.<br />\nreek Letter Fraternity Jewelry<br />\nTHE PLAY THAT PUT<br />\n10 Minutes from Hopkins<br />\n\"—,\" said I, softly.—Stanford Vernon 3055<br />\nU IN HUMOR<br />\nST.,<br />\nBaltimore,<br />\nMd.<br />\n213 N. LIBERTY<br />\nChapparal.<br /><br />\nJ. F. Apple Co.<br /><br />\nSLAVEMAKER<br /><br />\nW.L. Mann<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nAcademy of Music<br /><br />\nLefranc &amp; Ault<br /><br />\nIP f<br />\nRADIO!!<br /><br />\nRADIO<br /><br />\nSUPPLY CO.<br /><br />\nABIE'S<br />\nIRISH<br />\nROSE<br /><br />\nBI<br /><br />\n•<br /><br />"}], "field_media_file": [{"target_id": 37717, "display": null, "description": null, "target_type": "file", "target_uuid": "066d2719-26a6-4c34-ba8e-255f11701c11", "url": "http://digital.library.jhu.edu/system/files/2022-03/13049-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13049, "target_type": "node", "target_uuid": "c4e80ca1-74c0-4eeb-9743-4b0e49f3ee5b", "url": "/node/13049"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "592d40d4-b35f-47de-a8cc-924278d01bed"}]}