{"mid": [{"value": 51429}], "uuid": [{"value": "3aed6e50-cd0f-4ec8-bb36-b4c8afdaca6a"}], "vid": [{"value": 51429}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T02:55:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16179-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T02:55:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T02:55:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\n—~vaugiv IYAAP UL LUE INEW VY HIUSUT QUAUrangie, Larrou Couity, lviaryiana<br />\nBy James P. Reger, David K. Brezinski, Scott Southworth and Heather A. Quinn<br />\n<br />\nGN<br />\n(State Plane Grid North)<br />\n<br />\n2004<br />\n<br />\nA reinterpretation of Fisher (1978)<br />\n<br />\n1<br />\n<br />\ne<br />\n<br />\nScale 1:24,000<br />\n<br />\n0 1 Miles<br />\n<br />\n <br />\n<br />\n1,000 2,000 3,000 4,000 5,000 6,000 7,000 Feet<br />\n<br />\n|<br />\n<br />\n05 0 1 Kilometers<br />\n<br />\n <br />\n<br />\nContour Interval 20’ Feet<br />\n<br />\nNational Geodetic Vertical Datum of 1929<br />\n(To convert elevations to the North American Vertical Datum of 1988, subtract 1 foot)<br />\n(To convert from feet to meters, multiply by 0.3048)<br />\n<br />\nSCHEMATIC CROSS SECTIONS A-A\", B-B', AND C-C\"<br />\n<br />\nSECTION ALONG TRACE OF AXIAL SURFACE<br />\n<br />\n  <br />\n<br />\nQuadrangle Location<br />\n<br />\n  <br />\n<br />\nAdjoining 7.5' Quadrangle Names<br />\nNew Windsor Quadrangle, shaded<br />\n<br />\n1. Taneytown<br />\n2. Littlestown<br />\n3. Manchester<br />\n4. Union Bridge<br />\n5. Westminister<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nFeetB<br />\n<br />\n1000 ©€Zscsr €Zsccpb<br />\n<br />\n    <br />\n  <br />\n<br />\n£Zscsrp<br />\n<br />\n <br />\n<br />\n <br />\n   <br />\n<br />\n   <br />\n<br />\n€Zscsr<br />\nZscmp<br />\n<br />\n-1000 €Zscepb<br />\n<br />\n <br />\n<br />\nWESTERN MARSTON SYNFORM<br />\n<br />\n <br />\n <br />\n<br />\n     <br />\n<br />\n6. Libertytown<br />\nNo Vertical exaggeration. 7. Winfield<br />\nSurficial deposits not shown. Relative motion of faults shown by arrows. 8. Finksburg<br />\nA'<br />\no SECTION ALONG TRACE OF AXIAL SURFACE .<br />\n3 EASTERN MARSTON SYNFORM<br />\n> 4<br />\n-<br />\n213<br />\nO 2 Au<br />\n<br />\n€Zsceqp<br />\n<br />\nC<br />\n<br />\nFeet<br />\n1000 €zsca €Zscq<br />\n<br />\nCZscep<br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n  <br />\n  <br />\n  <br />\n <br />\n <br />\n<br />\n <br />\n<br />\n€Zsccqp<br />\n<br />\n€Zsccqp<br />\n<br />\n€Zmb<br />\n€Zscmp<br />\n<br />\n <br />\n<br />\n€Zsccpa<br />\n<br />\n€Zsccp<br />\n<br />\n€Zscep €Zscmp<br />\n<br />\n <br />\n<br />\n€Zscmp<br />\n<br />\nNOTES ON THE GEOLOGIC STRUCTURE AND STRATIGRAPHY OF THE PIEDMONT ROCKS IN THE NEW WINDSOR QUADRANGLE<br />\n<br />\nGEOLOGIC SETTING<br />\n<br />\nWith the exception of a small area of Triassic sedimentary rocks<br />\nof the Gettysburg Basin in the northwest corner, the New Windsor<br />\n7.5-minute quadrangle lies within the Westminster terrane of the<br />\nwestern Piedmont Upland of Maryland. Rocks of the Westminster<br />\nterrane are metamorphic (greenschist facies) that reflect multiple<br />\nphases of deformation.<br />\n<br />\nRecent geologic mapping in the Piedmont has resulted in<br />\nstratigraphic and structural relationships for these rocks of the<br />\nWestminster terrane that differ from interpretations of Fisher, who<br />\nproduced a geologic map of this quadrangle in 1978. In general, the<br />\ncurrent map retains Fisher’'s geologic contacts and structural<br />\n“measurements but revises the structural and stratigraphic relationships<br />\n(including formation names) to offer an interpretation consistent with<br />\nthe recent regional interpretations. Limited field reconnaissance<br />\nduring the preparation of this current map resulted in a few relatively<br />\nminor revisions to Fisher’s contacts.<br />\n<br />\nRegional Piedmont mapping (e.g., Southworth and others, 2002)<br />\nindicates that the Westminster terrane consists of polymetamorphic<br />\nrocks that occur in fault-bounded packages, or assemblages. Each<br />\npackage contains a variety of lithologies that are often similar from<br />\none package to another but lithologies vary in their relative<br />\nproportions in different packages.<br />\n<br />\nIn the New Windsor quadrangle the lithologies can be grouped<br />\ninto two distinct assemblages of greenschist-facies metamorphic<br />\nrocks: one consisting mainly of metasedimentary rocks, the other<br />\ncontaining a considerable amount of metavolcanic rocks and marble<br />\nalong with metasedimentary rocks.<br />\n<br />\nThe mainly metasedimentary assemblage consists predominantly<br />\nof phyllites and schists, with subordinate metalimestone and<br />\nmetabasalt and minor amounts of quartzite. The Marburg Formation<br />\nand Prettyboy Schist constitute this assemblage in the map area.<br />\nThese rocks are thought to represent original sedimentary<br />\naccumulations in offshore, deep-water depositional environments.<br />\n<br />\nThe metavolcanic and metasedimentary assemblage includes<br />\nmetabasalt of the Sams Creek Formation as well as phyllites,<br />\nlimestone, quartzite, and large to small bodies of Wakeficld Marble.<br />\nThe metabasalts represent ocean floor deposits and possibly the<br />\nremains of volcanic islands or seamounts built on oceanic crust<br />\n(Smith and Barnes, 1994; Southworth, 1996). The associated marble<br />\nappears to represent shallow-water carbonates that formed in<br />\nproximity to volcanic islands or seamounts.<br />\n<br />\nThe ages of these two rock sequences have not been determined,<br />\nbut estimates range from as old as Late Proterozoic and Cambrian to<br />\nas young as Early Ordovician. Southworth and others (2002) depict<br />\nall metamorphic rocks of the Westminster terrane to have been<br />\ndeposited during the Late Proterozoic to Early Cambrian. These<br />\ndeposits were subsequently subjected to several phases of<br />\ndeformation and metamorphism during the Paleozoic<br />\n<br />\nThe Westminster terrane lies unconformably beneath the<br />\nLate Triassic New Oxford Formation in the northwest corner of the<br />\nquadrangle. It is also intruded with subparallel north-striking diabase<br />\ndikes of Jurassic age. Surficial deposits of Quaternary alluvium are<br />\nfound along modern streams.<br />\n<br />\nSTRUCTURE<br />\nSummary<br />\n<br />\nBedrock units of the Westminster terrane have a complex<br />\nstructural and metamorphic history. Regionally the Westminster<br />\nterrane 1s characterized by polydeformed and polymetamorphosed<br />\nrocks in a system of imbricate thrust sheets (e.g., Southworth, 1996,<br />\n1998, 1999; Southworth and others, 2002.)<br />\n<br />\nIn the New Windsor quadrangle, the metavolcanic and<br />\nmetasedimentary rocks of the Sams Creek Formation and the<br />\nassociated Wakefield Marble appear to be structurally separate from<br />\nthe areas underlain by the Marburg Formation and Prettyboy Schist.<br />\nThe precise structural disposition of these units is unclear, but may be<br />\na fault contact (Edwards, 1993a and 1993b; Southworth and others,<br />\n2002). This stands in clear contrast to mapping by Fisher (1978),<br />\nwho recognized fewer faults in the arca. High-angle faults of the<br />\nCranberry fault system, interpreted to be compressional in nature, cut<br />\nthrough the metasedimentary assemblage (Marburg Formation and<br />\nPrettyboy Schist) and appear to separate this assemblage from the<br />\nmetavolcanic-metasedimentary assemblage (Sams Creek Formation).<br />\nSouthworth (1998; 1999) and Southworth and others (2002) indicate<br />\nthat the contact between the Marburg and Sams Creek Formations is a<br />\nthrust fault.<br />\n<br />\nTriassic rocks of the New Oxford Formation, in the northwest<br />\ncorner of the map, represent part of the Gettysburg Basin. It is widely<br />\naccepted that early Mesozoic continental rifting formed the<br />\nGettysburg Basin. This basin was originally connected to a second<br />\nbasin, the Culpeper Basin, and together they formed a large down-<br />\nfaulted basin that filled with sediments eroding from Blue Ridge and<br />\nPiedmont highlands (Southworth and others, 2002).<br />\n<br />\nFolds<br />\n<br />\nFisher (1978) provided a detailed discussion of fold history in the<br />\n.New Windsor quadrangle. The current map has not altered Fisher’s<br />\n(1978) imnterpretation of fold history. Therefore, a summary of his<br />\ninterpretations is provided below; refer to Fisher’s 1978 map for full<br />\ndiscussion and details.<br />\n<br />\nFisher (1978) recognized three major generations of folding in the<br />\nNew Windsor quadrangle. These are, from oldest to youngest, the<br />\nWakefield Valley folds (W), the Marston folds (M), and the Jasontown<br />\nfolds (J). These folds are identified both on Fisher’s (1978) map and<br />\non the current geologic map by the letters W, M, and J, respectively,<br />\non the fold axes. There are some folds that are of uncertain age and<br />\nare unmarked on the map.<br />\n<br />\nFisher indicated that the earliest generation of folds, the<br />\nWakefield Valley folds, appear closest the original form along the<br />\naxis of the Marston synform where the effects of the subsequent<br />\ndeformation is minimized. Cross section A-A\" on this map follows<br />\nthat of Fisher (1978) and is a two-part (offset) cross section following<br />\nthe Marston synform.<br />\n<br />\nWakefield folds were deformed by the Marston generation of<br />\ndeformation. =~ Marston generation folds generally have north-<br />\nnortheast trending axial planes and are associated with cleavage that<br />\ntrends parallel to the fold axial planes. Subsequently, the Jasontown<br />\ngeneration of folding produced several steeply dipping, northeast<br />\ntrending kink zones that offset strike lines of the Marston cleavage.<br />\n<br />\nIn addition to the principal fold generations, there may have been<br />\none or more other generations of deformation based on complex<br />\ncrenulation cleavages and associated crinkles and minor folds visible<br />\nin many outcrops. These features do not appear to discernibly affect<br />\nthe map pattern and, because the time relationships are far from clear,<br />\nFisher did not divide them into named fold generations.<br />\n<br />\nFaults<br />\n<br />\nFisher (1978) recognized at least two generations of steeply<br />\ndipping faults in the New Windsor quadrangle. Those offsetting the<br />\nTriassic rocks are presumably normal faults associated with<br />\ncontinental rifting that formed the Gettysburg Basin during the<br />\nMesozoic. A much earlier set of faults appears to have been folded<br />\nby the Marston cleavage. Fisher’s cross sections indicated the “carly<br />\nfaults” dip to the southeast. Although Fisher showed this earlier set<br />\nas normal faults, he admitted that the relative sense of motion was<br />\nuncertain and that they could be reverse faults. Based on regional<br />\nmapping and related revisions to the structural-tectonic framework<br />\n(e.g., Edwards, written communication, 1997; Southworth and others,<br />\n2002), the current map shows Fisher’s “early faults™ as reverse faults,<br />\nsteeply dipping to the southeast. Presumably these early faults<br />\nresulted from compressional forces associated with orogenic events<br />\nduring the Paleozoic.<br />\n<br />\nMapping in the surrounding quadrangles by Edwards (1993a,<br />\n1993b, 1994, 1996) identified a series of additional subparallel faults,<br />\nwhich he collectively called the Cranberry fault system. Although he<br />\ninitially interpreted these as east-verging, high-angle reverse faults, he<br />\nlater considered them to be west-verging, high-angle reverse faults<br />\n(Edwards, written communication, 1997). Each fault is actually a<br />\nnarrow band, or zone, of closely spaced, parallel or en echelon faults.<br />\nIn places, some of the faults show a component of strike slip<br />\nmovement. Dips range from nearly vertical to steeply southeast.<br />\n<br />\nAlthough not mapped by Fisher (1978), two of those faults — the<br />\nCranberry fault and the Avondale fault — trend at approximately<br />\nN30°E as they cross the southeastern part of the New Windsor<br />\nquadrangle. The Avondale fault appears to form the boundary for the<br />\nrevised packaging of the lithologic units in the map area, separating<br />\nthe Sams Creek Formation-Wakefiecld Marble on the west (footwall)<br />\nfrom the Marburg Formation on the east side (hanging wall).<br />\n<br />\nRegionally, the traces of the Avondale and Cranberry faults are<br />\nrelatively straight and do not appear to be strongly affected by<br />\nfolding. Therefore, the Cranberry fault system appears to postdate<br />\nFisher’s “early faults.” Edwards (1993b) suggested that the Avondale<br />\nand Cranberry faults are likely to represent a final phase of Paleozoic<br />\ndeformation, presumably the Alleghenian orogeny. He speculated<br />\nthat faulting could be contemporaneous with Marston folding, given<br />\nprominent crenulation cleavage that parallels these faults in the<br />\nWestminster quadrangle (just east of New Windsor).<br />\n<br />\nSTRATIGRAPHY AND CORRELATION<br />\n<br />\nThe reinterpretation of the structural-lithologic framework of the<br />\nareca produces two fault-bounded assemblages in the map area: the<br />\nPrettyboy Schist-Marburg Formation to the east and the Sams Creek<br />\nFormation-Wakefield Marble to the west. Stratigraphic interpretation<br />\nand correlation of rock units are hampered by poor exposure and<br />\nstructural complexity, as well as by the lack of fossils and absolute<br />\ndates. Most primary sedimentary and volcanic structures in the rock<br />\nunits have been obscured or obliterated by folding, foliation, and<br />\nrecrystallization. To a large extent, carly-formed structures and<br />\nfoliation have been destroyed or modified by later episodes of<br />\ntectonism.<br />\n<br />\nSeveral of Fisher's (1978) rock units have been reassigned to<br />\nother formations in the current map. In general, the Wissahickon<br />\nalbite phyllite of Fisher (1978) is now mapped as the Prettyboy Schist<br />\necast of the Avondale Fault. Recent field reconnaissance shows that<br />\nphyllites formerly assigned to Wissahickon by Fisher (1978) are more<br />\nschistose than phyllitic. Fisher's Ijamsville phyllites west of the<br />\nAvondale fault are now mapped as phyllite members of the Sams<br />\nCreck Formation and east of the Avondale fault as phyllites of the<br />\nMarburg Formation and Prettyboy Schist. Fisher's Silver Run<br />\nLimestone has been reassigned to the Sams Creek Formation in the<br />\n<br />\ncurrent interpretation. The relatively small bodies of metabasalt east<br />\nof the Avondale fault, which were formerly identified as Sams Creek<br />\ngreenstone, are now mapped as part of the Marburg and Prettyboy<br />\nFormations. It is possible that these small bodies of metabasalt may<br />\nbe detached and isolated remnants of Sams Creck metabasalt or its<br />\nequivalent. Stratigraphic continuity, however, cannot be established.<br />\nOn this map, the Sams Creek Formation is absent east of the<br />\nAvondale fault, presumably as a result of erosion following tectonic<br />\ndeformation and faulting.<br />\n<br />\nThe Sams Creek Formation as shown of this map now includes<br />\nlithologies of metabasalt, phyllites, quartzite, limestone and marbles.<br />\nWith the reassignment of much of Fisher's (1978) Ijamsville phyllite<br />\nwest of Avondale fault into the revised Sams Creek Formation,<br />\nmetabasalt is no longer the dominant lithology, in terms of outcrop<br />\narea, in the Sams Creek Formation in the New Windsor quadrangle.<br />\nHowever, the formation still contains considerable amounts of<br />\nmetabasalt, more than any of the other formations on the current map.<br />\n<br />\nThe age of the Sams Creck Formation remains a matter of some<br />\nspeculation. Edwards (1993b) considered it the oldest unit in the<br />\nareca. Southworth and others (2002), however, suggest that the Sams<br />\nCreek Formation may stratigraphically overliec — and therefore be<br />\nyounger than — the Marburg Formation in this part of the Piedmont.<br />\n<br />\nFisher (1978) considered the Sams Creeck Formation to be<br />\nCambrian(?) or possibly young Ordovician(?) in age. Edwards<br />\n(1984) equated the Sams Creek with the Late Proterozoic Catoctin<br />\nFormation, and Southworth and others (2002) considered it to be Late<br />\nProterozoic(?) to Early Cambrian(?).<br />\n<br />\nThe Wakefield Marble is spatially associated with the Sams<br />\nCreek Formation and is most clearly expressed by the fold belt and<br />\nbroad valleys in the central and southwestern parts of the map area.<br />\nThe Wakefield Marble has been considered younger than the Sams<br />\nCreek Formation (e.g., Fisher, 1978), as a member within the Sams<br />\nCreek (e.g., Edwards, 1986), or even older than the Sams Creek (e.g.,<br />\nJonas and Stose, 1938). Due to the Wakefield Marble’s axial position<br />\nin the synforms and its being flanked by the Sams Creck metabasalt,<br />\nthe current map concurs with Fisher’s interpretation and retains<br />\nformation status for the Wakefield Marble, at least for the major<br />\noutcrop areas associated with the fold belt that occurs in the map area.<br />\n<br />\nThe Silver Run Limestone and associated phyllite member are<br />\nhere included in the Sams Creek Formation. Fisher (1978) included it<br />\nin the Ijamsville Phyllite, which is not recognized on the current map,<br />\nand Edwards (1986) included it as a member of the Marburg<br />\nFormation. As currently mapped, the Silver Run Limestone occurs at<br />\nor near the top of the Sams Creek Formation. Fisher (1978)<br />\ninterpreted the alternating graded clastic carbonate beds and<br />\nargillaceous material of the Silver Run as representing the periodic<br />\ninflux of carbonate debris (possibly turbidites or a polymictic slide<br />\nmass) derived from a Cambrian and Ordovician carbonate shelf to the<br />\nnorthwest into a shale basin. If so, the Silver Run probably represents<br />\nthe distal edge of an off-shelf carbonate wedge and associated slide<br />\nmasses represented by parts of the Frederick Formation, west of the<br />\nNew Windsor quadrangle (Brezinski, 2004).<br />\n<br />\nThe Marburg Formation is predominantly made up of various<br />\nphyllites with minor quartzite and metabasalt (greenstone) in the map<br />\nareca. The original depositional environment of the Marburg<br />\nFormation has been interpreted as offshore marine (deepwater-rise)<br />\n(e.g., Kunk and others, 2004). Edwards (1984, 1986) proposed a<br />\nCambrian to Ordovician age for the Marburg, though others suggest<br />\nages ranging from possibly Late Proterozoic and/or Cambrian (e.g.,<br />\nDrake, 1994; Southworth 1998; Southworth and others 2002).<br />\n<br />\nThe stratigraphic relationship between the Marburg Formation<br />\nand adjacent units is not fully defined. In the New Windsor<br />\nquadrangle, the contact between the Marburg and the Sams Creek<br />\nFormations is shown as a high-angle reverse fault (the Avondale<br />\nfault). Southworth and others (2002) suggest that the Marburg may<br />\nstratigraphically underlic the Sams Creek Formation and may<br />\nstructurally overlie the Prettyboy Schist in the vicinity. Due to<br />\nsimilarities in lithology, however, previous authors have suggested<br />\nthat the Marburg Formation and Prettyboy Schist may have originally<br />\nhad a facies relationship, with the Marburg more proximal and<br />\nPrettyboy Schist more distal (Drake, 1994; Howard, 1994).<br />\n<br />\nThe Prettyboy Schist is the uppermost unit in what was<br />\npreviously known as the Wissahickon Group, a name now abandoned<br />\nin Maryland (Gates and others, 1991). The current map shows<br />\nPrettyboy Schist where Fisher (1978) showed Wissahickon albite<br />\nphyllite east of the Avondale fault. The Prettyboy consists mainly of<br />\nuniform, fine-grained plagioclase-chlorite-muscovite-quartz schist,<br />\nwith euhedral albite porphyroblasts common.  However, the<br />\nPrettyboy, as shown on the current map, also contains boudins of<br />\nphyllite, metabasalt, and quartzite. Crowley (1976), who named the<br />\nPrettyboy Schist, assigned its age as Cambro-Ordovician(?).<br />\nHowever, Drake (1994) revised the age to Late Proterozoic and Early<br />\nCambrian, a designation continued in later mapping (e.g., Southworth<br />\nand others, 2002) and retained on the current map.<br />\n<br />\nCV<br />\n<br />\n     <br />\n<br />\n <br />\n<br />\n   <br />\n<br />\n€Zsceqp<br />\n<br />\n <br />\n  <br />\n<br />\nMeters<br />\n200<br />\n<br />\n <br />\n <br />\n <br />\n <br />\n<br />\n0<br />\n<br />\n€Zsccpa -200<br />\n<br />\n      <br />\n  <br />\n   <br />\n<br />\n<<br />\n€Zsccp -<br />\n<br />\n  <br />\n<br />\n€Zpg €Zpm €zZpg R'<br />\n_, Meters<br />\n<br />\n <br />\n<br />\n  <br />\n <br />\n <br />\n<br />\n <br />\n <br />\n <br />\n <br />\n <br />\n<br />\n£7sc €Zmb<br />\n<br />\n <br />\n    <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\nCZscmp<br />\nMeters<br />\n( .<br />\nExplanation of Map Symbols<br />\nGeologic Symbols<br />\nContacts .<br />\n.~ Geologic contact; approximately located L . Cross section line<br />\n> dotted where concealed A<br />\nFaults<br />\n\" Fault, dashed where inferred; Planar Features<br />\n<br />\nU’ dotted where concealed: For a single measurement, the point of observation<br />\n<br />\n/D lati e . is at the midpoint of the symbol. For multiple<br />\nISSUVE monon sown measurements (combined symbols), the point of<br />\nU Upthrown side observation is at the tail-end junction point common<br />\nD Downthrown side to all symbols.<br />\n<br />\nMajor Folds in Bedding Bedding<br />\n<br />\nApproximate trace of axial surface and direction of 2 ¢ ;<br />\n<br />\nplunge. Dotted where concealed. WV indicates folds / Inclined bedding<br />\n<br />\nof Wakefield Valley generation, unmarked folds are strike and degree of dip shown<br />\n<br />\nof uncertain age.<br />\n<br />\n#  Vertical bedding<br />\n<br />\n4 WV Overturned anticline strike shown<br />\n<br />\nFoliation<br />\n<br />\n4—*—L-V Syncline<br />\nStrike and dip of early schistosity or foliation--<br />\nApproximately parallel to axial planes of folds in<br />\n<br />\nWYY Overturned syncline<br />\nbedding; mostly developed during Wakefield Valley<br />\n<br />\nMajor Folds in Cleavage folding<br />\n<br />\nApproximate trace of axial surface and direction of<br />\nplunge. Dotted where concealed. M indicates<br />\nfolds of Marston generation, classified in terms of the<br />\nform of the Wakefield Valley cleavage. J indicates<br />\nfolds of the Jasontown generation, classified in terms<br />\nof the form of the Marston cleavage. Unmarked<br />\nfolds are classified in terms of the form of the locally<br />\ndominant cleavage, but are of uncertain age.<br />\n<br />\n<—¢—M~L Antiform<br />\nM Overturned antiform<br />\n4—*—M—J Synform<br />\n«M_ Overturned synform<br />\n<br />\nLineations<br />\n<br />\n/” Inclined foliation in metamorphic rock<br />\nstrike and degree of dip shown<br />\n<br />\n)( Vertical foliation in metamorphic rock<br />\nstrike shown<br />\n<br />\nCleavage<br />\n<br />\nStrike and dip of crenulation cleavage or second<br />\nschistosity--Approximately parallel to axial plane of<br />\nfolds in early schistosity; mostly produced during<br />\nMarston folding<br />\n<br />\n[ “ Inclined crenulation cleavage<br />\nstrike and degree of dip shown<br />\n<br />\nj Vertical crenulation cleavage<br />\nstrike shown<br />\n<br />\nStrike and dip of late crenulation cleavage cutting<br />\nearlier crenulation cleavages<br />\n<br />\n/ “ Inclined cleavage<br />\nstrike and degree of dip shown<br />\n<br />\nLineation at intersection of bedding<br />\nand Marston cleavage;<br />\nbearing and plunge shown<br />\n<br />\n}/ Lineation at intersection of Wakefield<br />\n<br />\nValley and Marston cleavages; ++  Horizontal cleavage<br />\n<br />\nbearing and plunge shown strike and degree of dip shown<br />\nBase Map Symbols<br />\nTopography Hydrography<br />\n<br />\n~_  Topographic index contour<br />\n<br />\n(100-ft interval) \"~  Stream<br />\n<br />\nWater body<br />\n<br />\n(eg. lakes, ponds, rivers)<br />\n<br />\n\"~ Topographic intermediate contour<br />\n(20-ft interval)<br />\n<br />\nSupplemental Information<br />\n<br />\nUse Constraints: These data represent the results of data collection/processing for a specific Department of Natural<br />\nResources, Maryland Geological Survey activity and indicate general existing conditions. As such, they are only valid<br />\nfor the intended use, content, time, and accuracy specifications. The user is responsible for the results of any<br />\napplication of the data for other than their intended purpose. The Maryland Geological Survery makes no warranty,<br />\nexpressed or implied, as to the use or appropriateness of the licensed data, and there are no warranties of<br />\nmerchantability or fitness for a particular purpose of use. The Maryland Geological Survey makes no representation to<br />\nthe accuracy or completeness of the data and may not be held liable for human error or defect. Data are only valid at<br />\n1:24,000 scale. Data should not be used at a scale greater than that.<br />\n<br />\nAcknowledgements: This geologic map was funded in part by the USGS National Cooperative Geologic Mapping<br />\nProgram. The views and conclusions contained in this document are those of the author(s) and should not be interpreted<br />\nas necessarily representing the official policies, either expressed or implied, of the U.S. Government.<br />\n<br />\nOriginal geologic field mapping conducted in 1967-1970 by G.W. Fisher, assisted by P. G. Robelen and Juergen<br />\nRhinehardt.  Limited field reconnaissance conducted in 1996-2000 by Scott Southworth. Limited field<br />\nreconnaissance conducted in 2003 and 2004 by J. P. Reger and D. K. Brezinski. Geologic map compiled in<br />\ndigital form and edited by Heather Quinn, Maryland Geological Survey and Brent Anderson and Catherine Luckhardt<br />\nof Towson University, Center for Geographic Information Sciences.<br />\n<br />\nThe facilities and services of the Maryland Department of Natural Resources are available to all without regard to race,<br />\ncolor, religion, sex, sexual orientation, age, national origin or physical or mental disability.<br />\n<br />\nPublished October 2004<br />\nVersion: NEWWI2004.1<br />\n<br />\n <br />\n<br />\nLate Prote<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n(1¥/3) that crops out west of the Avondale fault.<br />\n<br />\nMetabasalt “a”<br />\n<br />\nInterlayered massive to schistose metabasalt (“greenstone™)<br />\nand green to greenish blue chlorite phyllite that is virtually<br />\nindistinguishable from (€Zsc), but retained here as a separate<br />\nunit to aid in comparing this to Fisher’s (1978) map. Phyllite<br />\nlocally contains irregular, mottled patches of white mica and<br />\nquartz, resembling amygdaloidal volcanic clasts; metabasalt<br />\nlocally contains relict amygdules filled with quartz, albite,<br />\nepidote, and chlorite.  Corresponds to the Ijamsville<br />\nmetabasalt (1jgs) of Fisher (1978) that crops out west of the<br />\nAvondale fault.<br />\n<br />\nChlorite phyllite<br />\n<br />\nGreen to greenish blue chlorite phyllite.  Contains<br />\nsubordinate amounts of paragonite and muscovite and<br />\nvariable amounts of quartz. Chloritic laminac commonly<br />\nalternate with white mica-albite-quartz layers up to 5 mm<br />\n(0.2 inch) thick; most of these layers parallel axial-plain<br />\ncleavage and must be tectonic in origin, but some may be<br />\nrelict bedding laminations (Fisher, 1978). Locally contains<br />\nvolcaniclastic fragments or amygdaloidal phyllite up to 3 cm<br />\n(1.2 inches) long in a hematite-chlorite-white mica phyllite<br />\nmatrix. A few rocks contain scattered amygdules filled with<br />\nquartz, albite, epidote, and chlorite and flattened parallel to<br />\nthe cleavage. Corresponds to the Sams Creek chlorite<br />\nphyllite (sccp) of Fisher (1978).<br />\n<br />\nChlorite phyllite “a”<br />\n<br />\nTan to dark-greenish-blue albite-quartz-muscovite-chlorite<br />\nphyllite and albite-quartz-muscovite phyllite interbedded<br />\nwith chlorite phyllites and muscovite phyllites like those of<br />\nSams Creek chlorite phyllite “b”. Phyllite “a” may be<br />\ndistinguished from phyllite “b™ by the presence of euhedral<br />\nalbite porphyroblasts, commonly about 0.5 mm on a side.<br />\nWell exposed only along the major stream valleys; weathers<br />\nreadily to a thick, tan, quartzose saprolite that underlies the<br />\nhigher ridges in the eastern part of the quadrangle.<br />\nCorresponds to the Wissahickon albite phyllite (wap) of<br />\nFisher (1978) that crops out west of the Avondale fault.<br />\n<br />\nChlorite phyllite “b”<br />\n<br />\nDark-bluish  gray  quartz-paragonite-muscovite-chlorite<br />\nphyllite. Commonly contains limonite pseudomorphs after<br />\npyrite and minute disseminated flakes of hematite. This unit<br />\nincludes phyllites indistinguishable from those in (€Zsccp),<br />\nbut most are more micaceous and contain fewer<br />\nvolcaniclastic breccia fragments. Chloritic laminae<br />\ncommonly alternate with mica-albite-quartz layers up to 5<br />\nmm thick; much of the layering is axial to minor folds and<br />\nclearly metamorphic, but some may be relict bedding.<br />\nCorresponds to the Ijamsville chlorite phyllite (ijcp) of<br />\nFisher (1978) that crops out west of the Avondale fault.<br />\n<br />\nREFERENCES CITED<br />\n<br />\nBrezinski, DK., 2004, Stratigraphy of the Frederick Valley and its<br />\nRelationship to Karst Development: Maryland Geological Survey<br />\nReport of Investigations No. 75, 101 p.<br />\n<br />\nDrake, A.A., Jr., 1994, The Soldiers Delight Ultramafite in the<br />\nMaryland Piedmont, in Stratigraphic Notes, 1993: U.S.<br />\nGeological Survey Bulletin 2076, A1-A14.<br />\n<br />\nEdwards, Jonathan, Jr., 1986, Geologic map of the Union Bridge<br />\nquadrangle, Carroll and Frederick Counties, Maryland: Maryland<br />\nGeological Survey, scale 1:24,000.<br />\n<br />\n, 1993a, Geologic map of the Manchester quadrangle, Carroll<br />\nCounty, Maryland: Maryland Geological Survey, open-file map,<br />\nscale 1:24,000.<br />\n<br />\n, 1993b, Geologic map of the Westminster quadrangle, Carroll<br />\nCounty, Maryland: Maryland Geological Survey, open-file map,<br />\nscale 1:24,000.<br />\n<br />\n, 1994, Geologic map of the Libertytown quadrangle, Carroll<br />\nand Frederick Counties, Maryland: Maryland Geological Survey,<br />\nopen-file map, scale 1:24,000.<br />\n<br />\n, 1996, Geologic map of the Winfield quadrangle, Carroll and<br />\nFrederick Counties, Maryland: Maryland Geological Survey,<br />\nopen-file map, scale 1:24,000.<br />\n<br />\nFisher, G.W., 1978, Geologic map of the New Windsor quadrangle,<br />\nCarroll County, Maryland: U.S. Geological Survey Miscellaneous<br />\nInvestigations Series, Map 1-1037, 1 sheet, scale 1:24,000.<br />\n<br />\nGates, A.E., Muller, P.D., and Valentino, D.W_, 1991, Terranes and<br />\ntectonics of the Maryland and southeast Pennsylvania Piedmont,<br />\nin Schultz, A., and Compton-Gooding, E., Geologic evolution of<br />\nthe eastern United States, Field trip guidebook, NE-SE Geological<br />\nSociety of America: Virginia Museum of Natural History,<br />\nGuidebook 2, p. 1-27.<br />\n<br />\nHiggins, M. W., 1973, Superimposition of folding in the northeastern<br />\nMaryland Piedmont and its bearing on the history and tectonics of<br />\nthe central Appalachians: Am. Jour. Sci., v. 273-A, p. 150-195.<br />\nHoward, C.S., 1994, Structural and tectonic evolution of Late<br />\nProterozoic through Early Cambrian metasedimentary rocks, York<br />\nCounty, Pennsylvania: Newark, University of Delaware,<br />\nunpublished Ph.D. dissertation, 218 p.<br />\n<br />\nJonas, A L. and Stose, G.W., 1938, New formation names used on the<br />\ngeologic map of Frederick County, Maryland: Washington<br />\nAcademy of Sciences Journal, v. 28, no. 8, p. 345-348<br />\n<br />\nKunk, M. J., Froelich, A. J., and Gottfried, D., 1992, Timing of<br />\nemplacement of diabase dikes and sheets in the Culpeper basin<br />\nand vicinity, Virginia and Maryland; 40Ar/39Ar age spectrum<br />\nresults from hornblende and K-feldspar in granophyres [abs]:<br />\nGeological Society of America Abstracts with Programs, v. 24, no.<br />\n1, p.25.<br />\n<br />\nSTATE OF MARYLAND<br />\n<br />\nRobert L. Ehrlich, Jr.<br />\nGovernor<br />\n<br />\nMichael S. Steele<br />\nLieutenant Governor<br />\n<br />\nMARYLAND<br />\n<br />\n= DEPARTMENT OF<br />\nNATURAL RESOURCES<br />\n<br />\n  <br />\n<br />\ne<br />\n<br />\nDEPARTMENT OF NATURAL RESOURCES<br />\nC. Ronald Franks<br />\nSecretary<br />\n<br />\nMARYLAND GEOLOGICAL SURVEY<br />\nEmery T. Cleaves<br />\n<br />\nCopies of this map are available<br />\nn hard copy (paper) and digital form from:<br />\nMARYLAND GEOLOGICAL SURVEY<br />\n2300 Saint Paul Street<br />\n% Baltimore, MD 21218<br />\nPh: 410-554-5500<br />\nFax: 410-554-5502<br />\nhttp://www.mgs.md.gov/<br />\n<br />\n <br />\n<br />\n- occur within the Prettyboy Schist.<br />\n<br />\nA maw AAAAW LS SMAANAE WALIVL LW \\.ulmuvtwllotl\\aull_y arv buslcsawu ad><br />\npinstripe laminations spaced 1 to 3 cm (3/8 to 1 inch) apart<br />\nand parallel to cleavage. Disrupted fold hinges are locally<br />\npreserved between cleavage laminations.  Crops out<br />\nextensively and commonly forms low ridges capped by a thin<br />\nsandy soil. Corresponds to the Ijamsville mica-chlorite-<br />\nquartz phyllite (1jqp) of Fisher (1978) cast of the Avondale<br />\nfault.<br />\n<br />\nMetabasalt<br />\n<br />\nSchistose to massive metabasalt interlayered with green to<br />\ngreenish blue chlorite phyllite and minor gray hematite-<br />\nmuscovite phyllite. The metabasalt contains fine-grained<br />\nchlorite, actinolite, albite, epidote, and quartz with minor<br />\nsphene and magnetite. Most of the rock has a schistose<br />\ntexture, but locally epidote pods and porphyritic basaltic<br />\ntexture 1s well preserved. Corresponds to the Sams Creek<br />\nmetabasalt (scgs) of Fisher (1978) that is east of the<br />\nAvondale fault and occurs within the Prettyboy Schist or<br />\nmuscovite phyllite subunit.<br />\n<br />\n <br />\n<br />\nMarble<br />\n<br />\nLight gray to white, massive dolomitic marble.<br />\nDiscontinuous areas of marble that crop out east of the<br />\nAvondale fault were previously mapped as Wakefield<br />\nMarble, but the stratigraphic equivalency cannot be<br />\nestablished. This marble is moderately well exposed in<br />\nplaces; occupies topographic depressions and weathers to a<br />\n<br />\nthin red soil, locally covered by slope wash from adjacent<br />\nhills.<br />\n<br />\n <br />\n<br />\nMuscovite phyllite<br />\n<br />\nBuff to light-olive-green quartz-muscovite phyllite with<br />\nsubordinate silvery gray quartz-paragonite-muscovite-<br />\nchlorite phyllite and muscovite-quartz phyllite. Numerous<br />\nlimonite cubes, up to 2 cm (3/4 inch) on a side, are<br />\npseudomorphs after pyrite. Hematite and tourmaline are<br />\ncommon accessory minerals. Very poorly exposed; weathers<br />\neasily into a thick resistant saprolite containing abundant<br />\nchips of phyllite. Underlies broad, gently sloping hills.<br />\nCorresponds to select parts of the Ijamsville muscovite<br />\nphyllite (iymp) of Fisher (1978) east of the Avondale fault<br />\nthat are associated with the Prettyboy Schist.<br />\n<br />\nQuartzite<br />\n<br />\nLight gray to tan to reddish, schistose quartzite up to 6 m (20<br />\nfeet) thick with individual layers 15 to 60 cm (6 to 24 inches)<br />\nthick that are interbedded with muscovite phyllites and<br />\nchlorite phyllites. Lenses or pods of white vein quartz are<br />\nalso common. Corresponds to parts of the Ijamsville<br />\nquartzite (1)q) of Fisher (1978) east of the Avondale fault that<br />\n<br />\n <br />\n<br />\nREFERENCES CITED (continued)<br />\n<br />\nKunk, M.J., Wintsch, R.P., Southworth, C.S., Mulvey, B.K, Naeser,<br />\nC.W., and Naeser, N.D., 2004, Multiple Paleozoic metamorphic<br />\nhistories, fabrics, and faulting in the Westminster and Potomac<br />\nterranes, Central Appalachian Piedmont, Northern Virginia and<br />\nSouthern Maryland, in Southworth, Scott and Burton, William<br />\n(eds.), Geology of the National Capital Region — Field Trip<br />\nGuidebook, NE-SE Geological Society of America: U.S.<br />\nGeological Survey Circular 1264, p. 163-188.<br />\n<br />\nMuller, P.D., Candela, P.A., and Wylie, A.G., 1989, The Liberty<br />\nComplex; Polygenetic melange in the central Maryland Piedmont,<br />\nin Horton, JW_, Jr., and Rast, N., eds., Melanges and olistostromes<br />\nof the U.S. Appalachians: Geological Society of America Special<br />\nPaper 228, p. 113-134.<br />\n<br />\nRankin, D.W_, Drake, A.A., and Ratcliffe, N.M., 1990, Geologic map<br />\nof the U.S. Appalachians showing the Laurentian margin and the<br />\nTaconic orogen, plate 2, in Hatcher, R.D., Jr., Thomas, W.A., and<br />\nViele, G.W., eds., The Appalachian-Ouachita orogen in the United<br />\nStates: Geological Society of America, The Geology of North<br />\nAmerica, Boulder, v. F-2, scale 1:2,000,000.<br />\n<br />\nSmith, R.C., II, and Barnes, J.H., 1994, Geochemistry and geology of<br />\nmetabasalt in southeastern Pennsylvania and adjacent Maryland, in<br />\nFaill, R.T., and Sevon, W.D., eds., Various aspects of Piedmont<br />\ngeology in Lancaster and Chester Counties, Pennsylvania:<br />\nGuidebook, 59th Annual Field Conference of Pennsylvania<br />\nGeologists, p. 45-71.<br />\n<br />\nSouthworth, Scott, 1996, The Martic fault in Maryland and its tectonic<br />\nsetting in the central Appalachians, in Brezinski, D.K. and Reger,<br />\nJ.P., Studies in Maryland Geology: Maryland Geological Survey<br />\nSpecial Publication No. 3, p. 205-221.<br />\n<br />\n1998, Geologic map of the Poolesville quadrangle, Frederick<br />\nand Montgomery Counties, Maryland, and Loudoun County,<br />\nVirginia: U.S. Geological Survey, Geologic Quadrangle Map GQ-<br />\n1761, scale 1:24,000.<br />\n<br />\n, 1999, Geologic map of the Urbana quadrangle, Frederick and<br />\nMontgomery Counties, Maryland: U.S. Geological Survey, Geologic<br />\nQuadrangle Map GQ-1768, scale 1:24,000.<br />\n<br />\nSouthworth, Scott, Brezinski, D K., Drake, A.A., Burton, W.C.,<br />\nOrndorff, R.C., Froelich, A J., Reddy, J.E., and Denenny,<br />\nDanielle, 2002, Digital geologic map and database of the<br />\nFrederick 30 x 60 minute quadrangle, Maryland, Virginia, and<br />\nWest Virginia: U.S. Geological Survey, Open-File Report OF-02-<br />\n437, scale 1:100,000.<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nG3841<br />\n.C5<br />\ns24<br />\n<br />\nM3<br />\nNew Windsor<br />\nSheet 1<br />\n\f", "format": "basic_html", "processed": "<br /><br />\n—~vaugiv IYAAP UL LUE INEW VY HIUSUT QUAUrangie, Larrou Couity, lviaryiana<br />\nBy James P. Reger, David K. Brezinski, Scott Southworth and Heather A. Quinn<br /><br />\nGN<br />\n(State Plane Grid North)<br /><br />\n2004<br /><br />\nA reinterpretation of Fisher (1978)<br /><br />\n1<br /><br />\ne<br /><br />\nScale 1:24,000<br /><br />\n0 1 Miles<br /><br /><br /><br />\n1,000 2,000 3,000 4,000 5,000 6,000 7,000 Feet<br /><br />\n|<br /><br />\n05 0 1 Kilometers<br /><br /><br /><br />\nContour Interval 20’ Feet<br /><br />\nNational Geodetic Vertical Datum of 1929<br />\n(To convert elevations to the North American Vertical Datum of 1988, subtract 1 foot)<br />\n(To convert from feet to meters, multiply by 0.3048)<br /><br />\nSCHEMATIC CROSS SECTIONS A-A\", B-B', AND C-C\"<br /><br />\nSECTION ALONG TRACE OF AXIAL SURFACE<br /><br /><br /><br />\nQuadrangle Location<br /><br /><br /><br />\nAdjoining 7.5' Quadrangle Names<br />\nNew Windsor Quadrangle, shaded<br /><br />\n1. Taneytown<br />\n2. Littlestown<br />\n3. Manchester<br />\n4. Union Bridge<br />\n5. Westminister<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nFeetB<br /><br />\n1000 ©€Zscsr €Zsccpb<br /><br /><br /><br /><br />\n£Zscsrp<br /><br /><br /><br /><br /><br /><br /><br /><br />\n€Zscsr<br />\nZscmp<br /><br />\n-1000 €Zscepb<br /><br /><br /><br />\nWESTERN MARSTON SYNFORM<br /><br /><br /><br /><br /><br /><br />\n6. Libertytown<br />\nNo Vertical exaggeration. 7. Winfield<br />\nSurficial deposits not shown. Relative motion of faults shown by arrows. 8. Finksburg<br />\nA'<br />\no SECTION ALONG TRACE OF AXIAL SURFACE .<br />\n3 EASTERN MARSTON SYNFORM<br />\n&gt; 4<br />\n-<br />\n213<br />\nO 2 Au<br /><br />\n€Zsceqp<br /><br />\nC<br /><br />\nFeet<br />\n1000 €zsca €Zscq<br /><br />\nCZscep<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n€Zsccqp<br /><br />\n€Zsccqp<br /><br />\n€Zmb<br />\n€Zscmp<br /><br /><br /><br />\n€Zsccpa<br /><br />\n€Zsccp<br /><br />\n€Zscep €Zscmp<br /><br /><br /><br />\n€Zscmp<br /><br />\nNOTES ON THE GEOLOGIC STRUCTURE AND STRATIGRAPHY OF THE PIEDMONT ROCKS IN THE NEW WINDSOR QUADRANGLE<br /><br />\nGEOLOGIC SETTING<br /><br />\nWith the exception of a small area of Triassic sedimentary rocks<br />\nof the Gettysburg Basin in the northwest corner, the New Windsor<br />\n7.5-minute quadrangle lies within the Westminster terrane of the<br />\nwestern Piedmont Upland of Maryland. Rocks of the Westminster<br />\nterrane are metamorphic (greenschist facies) that reflect multiple<br />\nphases of deformation.<br /><br />\nRecent geologic mapping in the Piedmont has resulted in<br />\nstratigraphic and structural relationships for these rocks of the<br />\nWestminster terrane that differ from interpretations of Fisher, who<br />\nproduced a geologic map of this quadrangle in 1978. In general, the<br />\ncurrent map retains Fisher’'s geologic contacts and structural<br />\n“measurements but revises the structural and stratigraphic relationships<br />\n(including formation names) to offer an interpretation consistent with<br />\nthe recent regional interpretations. Limited field reconnaissance<br />\nduring the preparation of this current map resulted in a few relatively<br />\nminor revisions to Fisher’s contacts.<br /><br />\nRegional Piedmont mapping (e.g., Southworth and others, 2002)<br />\nindicates that the Westminster terrane consists of polymetamorphic<br />\nrocks that occur in fault-bounded packages, or assemblages. Each<br />\npackage contains a variety of lithologies that are often similar from<br />\none package to another but lithologies vary in their relative<br />\nproportions in different packages.<br /><br />\nIn the New Windsor quadrangle the lithologies can be grouped<br />\ninto two distinct assemblages of greenschist-facies metamorphic<br />\nrocks: one consisting mainly of metasedimentary rocks, the other<br />\ncontaining a considerable amount of metavolcanic rocks and marble<br />\nalong with metasedimentary rocks.<br /><br />\nThe mainly metasedimentary assemblage consists predominantly<br />\nof phyllites and schists, with subordinate metalimestone and<br />\nmetabasalt and minor amounts of quartzite. The Marburg Formation<br />\nand Prettyboy Schist constitute this assemblage in the map area.<br />\nThese rocks are thought to represent original sedimentary<br />\naccumulations in offshore, deep-water depositional environments.<br /><br />\nThe metavolcanic and metasedimentary assemblage includes<br />\nmetabasalt of the Sams Creek Formation as well as phyllites,<br />\nlimestone, quartzite, and large to small bodies of Wakeficld Marble.<br />\nThe metabasalts represent ocean floor deposits and possibly the<br />\nremains of volcanic islands or seamounts built on oceanic crust<br />\n(Smith and Barnes, 1994; Southworth, 1996). The associated marble<br />\nappears to represent shallow-water carbonates that formed in<br />\nproximity to volcanic islands or seamounts.<br /><br />\nThe ages of these two rock sequences have not been determined,<br />\nbut estimates range from as old as Late Proterozoic and Cambrian to<br />\nas young as Early Ordovician. Southworth and others (2002) depict<br />\nall metamorphic rocks of the Westminster terrane to have been<br />\ndeposited during the Late Proterozoic to Early Cambrian. These<br />\ndeposits were subsequently subjected to several phases of<br />\ndeformation and metamorphism during the Paleozoic<br /><br />\nThe Westminster terrane lies unconformably beneath the<br />\nLate Triassic New Oxford Formation in the northwest corner of the<br />\nquadrangle. It is also intruded with subparallel north-striking diabase<br />\ndikes of Jurassic age. Surficial deposits of Quaternary alluvium are<br />\nfound along modern streams.<br /><br />\nSTRUCTURE<br />\nSummary<br /><br />\nBedrock units of the Westminster terrane have a complex<br />\nstructural and metamorphic history. Regionally the Westminster<br />\nterrane 1s characterized by polydeformed and polymetamorphosed<br />\nrocks in a system of imbricate thrust sheets (e.g., Southworth, 1996,<br />\n1998, 1999; Southworth and others, 2002.)<br /><br />\nIn the New Windsor quadrangle, the metavolcanic and<br />\nmetasedimentary rocks of the Sams Creek Formation and the<br />\nassociated Wakefield Marble appear to be structurally separate from<br />\nthe areas underlain by the Marburg Formation and Prettyboy Schist.<br />\nThe precise structural disposition of these units is unclear, but may be<br />\na fault contact (Edwards, 1993a and 1993b; Southworth and others,<br />\n2002). This stands in clear contrast to mapping by Fisher (1978),<br />\nwho recognized fewer faults in the arca. High-angle faults of the<br />\nCranberry fault system, interpreted to be compressional in nature, cut<br />\nthrough the metasedimentary assemblage (Marburg Formation and<br />\nPrettyboy Schist) and appear to separate this assemblage from the<br />\nmetavolcanic-metasedimentary assemblage (Sams Creek Formation).<br />\nSouthworth (1998; 1999) and Southworth and others (2002) indicate<br />\nthat the contact between the Marburg and Sams Creek Formations is a<br />\nthrust fault.<br /><br />\nTriassic rocks of the New Oxford Formation, in the northwest<br />\ncorner of the map, represent part of the Gettysburg Basin. It is widely<br />\naccepted that early Mesozoic continental rifting formed the<br />\nGettysburg Basin. This basin was originally connected to a second<br />\nbasin, the Culpeper Basin, and together they formed a large down-<br />\nfaulted basin that filled with sediments eroding from Blue Ridge and<br />\nPiedmont highlands (Southworth and others, 2002).<br /><br />\nFolds<br /><br />\nFisher (1978) provided a detailed discussion of fold history in the<br />\n.New Windsor quadrangle. The current map has not altered Fisher’s<br />\n(1978) imnterpretation of fold history. Therefore, a summary of his<br />\ninterpretations is provided below; refer to Fisher’s 1978 map for full<br />\ndiscussion and details.<br /><br />\nFisher (1978) recognized three major generations of folding in the<br />\nNew Windsor quadrangle. These are, from oldest to youngest, the<br />\nWakefield Valley folds (W), the Marston folds (M), and the Jasontown<br />\nfolds (J). These folds are identified both on Fisher’s (1978) map and<br />\non the current geologic map by the letters W, M, and J, respectively,<br />\non the fold axes. There are some folds that are of uncertain age and<br />\nare unmarked on the map.<br /><br />\nFisher indicated that the earliest generation of folds, the<br />\nWakefield Valley folds, appear closest the original form along the<br />\naxis of the Marston synform where the effects of the subsequent<br />\ndeformation is minimized. Cross section A-A\" on this map follows<br />\nthat of Fisher (1978) and is a two-part (offset) cross section following<br />\nthe Marston synform.<br /><br />\nWakefield folds were deformed by the Marston generation of<br />\ndeformation. =~ Marston generation folds generally have north-<br />\nnortheast trending axial planes and are associated with cleavage that<br />\ntrends parallel to the fold axial planes. Subsequently, the Jasontown<br />\ngeneration of folding produced several steeply dipping, northeast<br />\ntrending kink zones that offset strike lines of the Marston cleavage.<br /><br />\nIn addition to the principal fold generations, there may have been<br />\none or more other generations of deformation based on complex<br />\ncrenulation cleavages and associated crinkles and minor folds visible<br />\nin many outcrops. These features do not appear to discernibly affect<br />\nthe map pattern and, because the time relationships are far from clear,<br />\nFisher did not divide them into named fold generations.<br /><br />\nFaults<br /><br />\nFisher (1978) recognized at least two generations of steeply<br />\ndipping faults in the New Windsor quadrangle. Those offsetting the<br />\nTriassic rocks are presumably normal faults associated with<br />\ncontinental rifting that formed the Gettysburg Basin during the<br />\nMesozoic. A much earlier set of faults appears to have been folded<br />\nby the Marston cleavage. Fisher’s cross sections indicated the “carly<br />\nfaults” dip to the southeast. Although Fisher showed this earlier set<br />\nas normal faults, he admitted that the relative sense of motion was<br />\nuncertain and that they could be reverse faults. Based on regional<br />\nmapping and related revisions to the structural-tectonic framework<br />\n(e.g., Edwards, written communication, 1997; Southworth and others,<br />\n2002), the current map shows Fisher’s “early faults™ as reverse faults,<br />\nsteeply dipping to the southeast. Presumably these early faults<br />\nresulted from compressional forces associated with orogenic events<br />\nduring the Paleozoic.<br /><br />\nMapping in the surrounding quadrangles by Edwards (1993a,<br />\n1993b, 1994, 1996) identified a series of additional subparallel faults,<br />\nwhich he collectively called the Cranberry fault system. Although he<br />\ninitially interpreted these as east-verging, high-angle reverse faults, he<br />\nlater considered them to be west-verging, high-angle reverse faults<br />\n(Edwards, written communication, 1997). Each fault is actually a<br />\nnarrow band, or zone, of closely spaced, parallel or en echelon faults.<br />\nIn places, some of the faults show a component of strike slip<br />\nmovement. Dips range from nearly vertical to steeply southeast.<br /><br />\nAlthough not mapped by Fisher (1978), two of those faults — the<br />\nCranberry fault and the Avondale fault — trend at approximately<br />\nN30°E as they cross the southeastern part of the New Windsor<br />\nquadrangle. The Avondale fault appears to form the boundary for the<br />\nrevised packaging of the lithologic units in the map area, separating<br />\nthe Sams Creek Formation-Wakefiecld Marble on the west (footwall)<br />\nfrom the Marburg Formation on the east side (hanging wall).<br /><br />\nRegionally, the traces of the Avondale and Cranberry faults are<br />\nrelatively straight and do not appear to be strongly affected by<br />\nfolding. Therefore, the Cranberry fault system appears to postdate<br />\nFisher’s “early faults.” Edwards (1993b) suggested that the Avondale<br />\nand Cranberry faults are likely to represent a final phase of Paleozoic<br />\ndeformation, presumably the Alleghenian orogeny. He speculated<br />\nthat faulting could be contemporaneous with Marston folding, given<br />\nprominent crenulation cleavage that parallels these faults in the<br />\nWestminster quadrangle (just east of New Windsor).<br /><br />\nSTRATIGRAPHY AND CORRELATION<br /><br />\nThe reinterpretation of the structural-lithologic framework of the<br />\nareca produces two fault-bounded assemblages in the map area: the<br />\nPrettyboy Schist-Marburg Formation to the east and the Sams Creek<br />\nFormation-Wakefield Marble to the west. Stratigraphic interpretation<br />\nand correlation of rock units are hampered by poor exposure and<br />\nstructural complexity, as well as by the lack of fossils and absolute<br />\ndates. Most primary sedimentary and volcanic structures in the rock<br />\nunits have been obscured or obliterated by folding, foliation, and<br />\nrecrystallization. To a large extent, carly-formed structures and<br />\nfoliation have been destroyed or modified by later episodes of<br />\ntectonism.<br /><br />\nSeveral of Fisher's (1978) rock units have been reassigned to<br />\nother formations in the current map. In general, the Wissahickon<br />\nalbite phyllite of Fisher (1978) is now mapped as the Prettyboy Schist<br />\necast of the Avondale Fault. Recent field reconnaissance shows that<br />\nphyllites formerly assigned to Wissahickon by Fisher (1978) are more<br />\nschistose than phyllitic. Fisher's Ijamsville phyllites west of the<br />\nAvondale fault are now mapped as phyllite members of the Sams<br />\nCreck Formation and east of the Avondale fault as phyllites of the<br />\nMarburg Formation and Prettyboy Schist. Fisher's Silver Run<br />\nLimestone has been reassigned to the Sams Creek Formation in the<br /><br />\ncurrent interpretation. The relatively small bodies of metabasalt east<br />\nof the Avondale fault, which were formerly identified as Sams Creek<br />\ngreenstone, are now mapped as part of the Marburg and Prettyboy<br />\nFormations. It is possible that these small bodies of metabasalt may<br />\nbe detached and isolated remnants of Sams Creck metabasalt or its<br />\nequivalent. Stratigraphic continuity, however, cannot be established.<br />\nOn this map, the Sams Creek Formation is absent east of the<br />\nAvondale fault, presumably as a result of erosion following tectonic<br />\ndeformation and faulting.<br /><br />\nThe Sams Creek Formation as shown of this map now includes<br />\nlithologies of metabasalt, phyllites, quartzite, limestone and marbles.<br />\nWith the reassignment of much of Fisher's (1978) Ijamsville phyllite<br />\nwest of Avondale fault into the revised Sams Creek Formation,<br />\nmetabasalt is no longer the dominant lithology, in terms of outcrop<br />\narea, in the Sams Creek Formation in the New Windsor quadrangle.<br />\nHowever, the formation still contains considerable amounts of<br />\nmetabasalt, more than any of the other formations on the current map.<br /><br />\nThe age of the Sams Creck Formation remains a matter of some<br />\nspeculation. Edwards (1993b) considered it the oldest unit in the<br />\nareca. Southworth and others (2002), however, suggest that the Sams<br />\nCreek Formation may stratigraphically overliec — and therefore be<br />\nyounger than — the Marburg Formation in this part of the Piedmont.<br /><br />\nFisher (1978) considered the Sams Creeck Formation to be<br />\nCambrian(?) or possibly young Ordovician(?) in age. Edwards<br />\n(1984) equated the Sams Creek with the Late Proterozoic Catoctin<br />\nFormation, and Southworth and others (2002) considered it to be Late<br />\nProterozoic(?) to Early Cambrian(?).<br /><br />\nThe Wakefield Marble is spatially associated with the Sams<br />\nCreek Formation and is most clearly expressed by the fold belt and<br />\nbroad valleys in the central and southwestern parts of the map area.<br />\nThe Wakefield Marble has been considered younger than the Sams<br />\nCreek Formation (e.g., Fisher, 1978), as a member within the Sams<br />\nCreek (e.g., Edwards, 1986), or even older than the Sams Creek (e.g.,<br />\nJonas and Stose, 1938). Due to the Wakefield Marble’s axial position<br />\nin the synforms and its being flanked by the Sams Creck metabasalt,<br />\nthe current map concurs with Fisher’s interpretation and retains<br />\nformation status for the Wakefield Marble, at least for the major<br />\noutcrop areas associated with the fold belt that occurs in the map area.<br /><br />\nThe Silver Run Limestone and associated phyllite member are<br />\nhere included in the Sams Creek Formation. Fisher (1978) included it<br />\nin the Ijamsville Phyllite, which is not recognized on the current map,<br />\nand Edwards (1986) included it as a member of the Marburg<br />\nFormation. As currently mapped, the Silver Run Limestone occurs at<br />\nor near the top of the Sams Creek Formation. Fisher (1978)<br />\ninterpreted the alternating graded clastic carbonate beds and<br />\nargillaceous material of the Silver Run as representing the periodic<br />\ninflux of carbonate debris (possibly turbidites or a polymictic slide<br />\nmass) derived from a Cambrian and Ordovician carbonate shelf to the<br />\nnorthwest into a shale basin. If so, the Silver Run probably represents<br />\nthe distal edge of an off-shelf carbonate wedge and associated slide<br />\nmasses represented by parts of the Frederick Formation, west of the<br />\nNew Windsor quadrangle (Brezinski, 2004).<br /><br />\nThe Marburg Formation is predominantly made up of various<br />\nphyllites with minor quartzite and metabasalt (greenstone) in the map<br />\nareca. The original depositional environment of the Marburg<br />\nFormation has been interpreted as offshore marine (deepwater-rise)<br />\n(e.g., Kunk and others, 2004). Edwards (1984, 1986) proposed a<br />\nCambrian to Ordovician age for the Marburg, though others suggest<br />\nages ranging from possibly Late Proterozoic and/or Cambrian (e.g.,<br />\nDrake, 1994; Southworth 1998; Southworth and others 2002).<br /><br />\nThe stratigraphic relationship between the Marburg Formation<br />\nand adjacent units is not fully defined. In the New Windsor<br />\nquadrangle, the contact between the Marburg and the Sams Creek<br />\nFormations is shown as a high-angle reverse fault (the Avondale<br />\nfault). Southworth and others (2002) suggest that the Marburg may<br />\nstratigraphically underlic the Sams Creek Formation and may<br />\nstructurally overlie the Prettyboy Schist in the vicinity. Due to<br />\nsimilarities in lithology, however, previous authors have suggested<br />\nthat the Marburg Formation and Prettyboy Schist may have originally<br />\nhad a facies relationship, with the Marburg more proximal and<br />\nPrettyboy Schist more distal (Drake, 1994; Howard, 1994).<br /><br />\nThe Prettyboy Schist is the uppermost unit in what was<br />\npreviously known as the Wissahickon Group, a name now abandoned<br />\nin Maryland (Gates and others, 1991). The current map shows<br />\nPrettyboy Schist where Fisher (1978) showed Wissahickon albite<br />\nphyllite east of the Avondale fault. The Prettyboy consists mainly of<br />\nuniform, fine-grained plagioclase-chlorite-muscovite-quartz schist,<br />\nwith euhedral albite porphyroblasts common.  However, the<br />\nPrettyboy, as shown on the current map, also contains boudins of<br />\nphyllite, metabasalt, and quartzite. Crowley (1976), who named the<br />\nPrettyboy Schist, assigned its age as Cambro-Ordovician(?).<br />\nHowever, Drake (1994) revised the age to Late Proterozoic and Early<br />\nCambrian, a designation continued in later mapping (e.g., Southworth<br />\nand others, 2002) and retained on the current map.<br /><br />\nCV<br /><br /><br /><br /><br /><br /><br /><br />\n€Zsceqp<br /><br /><br /><br /><br />\nMeters<br />\n200<br /><br /><br /><br /><br /><br /><br />\n0<br /><br />\n€Zsccpa -200<br /><br /><br /><br /><br /><br />\n&lt;<br />\n€Zsccp -<br /><br /><br /><br />\n€Zpg €Zpm €zZpg R'<br />\n_, Meters<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n£7sc €Zmb<br /><br /><br /><br /><br /><br /><br /><br /><br />\nCZscmp<br />\nMeters<br />\n( .<br />\nExplanation of Map Symbols<br />\nGeologic Symbols<br />\nContacts .<br />\n.~ Geologic contact; approximately located L . Cross section line<br />\n&gt; dotted where concealed A<br />\nFaults<br />\n\" Fault, dashed where inferred; Planar Features<br /><br />\nU’ dotted where concealed: For a single measurement, the point of observation<br /><br />\n/D lati e . is at the midpoint of the symbol. For multiple<br />\nISSUVE monon sown measurements (combined symbols), the point of<br />\nU Upthrown side observation is at the tail-end junction point common<br />\nD Downthrown side to all symbols.<br /><br />\nMajor Folds in Bedding Bedding<br /><br />\nApproximate trace of axial surface and direction of 2 ¢ ;<br /><br />\nplunge. Dotted where concealed. WV indicates folds / Inclined bedding<br /><br />\nof Wakefield Valley generation, unmarked folds are strike and degree of dip shown<br /><br />\nof uncertain age.<br /><br />\n#  Vertical bedding<br /><br />\n4 WV Overturned anticline strike shown<br /><br />\nFoliation<br /><br />\n4—*—L-V Syncline<br />\nStrike and dip of early schistosity or foliation--<br />\nApproximately parallel to axial planes of folds in<br /><br />\nWYY Overturned syncline<br />\nbedding; mostly developed during Wakefield Valley<br /><br />\nMajor Folds in Cleavage folding<br /><br />\nApproximate trace of axial surface and direction of<br />\nplunge. Dotted where concealed. M indicates<br />\nfolds of Marston generation, classified in terms of the<br />\nform of the Wakefield Valley cleavage. J indicates<br />\nfolds of the Jasontown generation, classified in terms<br />\nof the form of the Marston cleavage. Unmarked<br />\nfolds are classified in terms of the form of the locally<br />\ndominant cleavage, but are of uncertain age.<br /><br />\n&lt;—¢—M~L Antiform<br />\nM Overturned antiform<br />\n4—*—M—J Synform<br />\n«M_ Overturned synform<br /><br />\nLineations<br /><br />\n/” Inclined foliation in metamorphic rock<br />\nstrike and degree of dip shown<br /><br />\n)( Vertical foliation in metamorphic rock<br />\nstrike shown<br /><br />\nCleavage<br /><br />\nStrike and dip of crenulation cleavage or second<br />\nschistosity--Approximately parallel to axial plane of<br />\nfolds in early schistosity; mostly produced during<br />\nMarston folding<br /><br />\n[ “ Inclined crenulation cleavage<br />\nstrike and degree of dip shown<br /><br />\nj Vertical crenulation cleavage<br />\nstrike shown<br /><br />\nStrike and dip of late crenulation cleavage cutting<br />\nearlier crenulation cleavages<br /><br />\n/ “ Inclined cleavage<br />\nstrike and degree of dip shown<br /><br />\nLineation at intersection of bedding<br />\nand Marston cleavage;<br />\nbearing and plunge shown<br /><br />\n}/ Lineation at intersection of Wakefield<br /><br />\nValley and Marston cleavages; ++  Horizontal cleavage<br /><br />\nbearing and plunge shown strike and degree of dip shown<br />\nBase Map Symbols<br />\nTopography Hydrography<br /><br />\n~_  Topographic index contour<br /><br />\n(100-ft interval) \"~  Stream<br /><br />\nWater body<br /><br />\n(eg. lakes, ponds, rivers)<br /><br />\n\"~ Topographic intermediate contour<br />\n(20-ft interval)<br /><br />\nSupplemental Information<br /><br />\nUse Constraints: These data represent the results of data collection/processing for a specific Department of Natural<br />\nResources, Maryland Geological Survey activity and indicate general existing conditions. As such, they are only valid<br />\nfor the intended use, content, time, and accuracy specifications. The user is responsible for the results of any<br />\napplication of the data for other than their intended purpose. The Maryland Geological Survery makes no warranty,<br />\nexpressed or implied, as to the use or appropriateness of the licensed data, and there are no warranties of<br />\nmerchantability or fitness for a particular purpose of use. The Maryland Geological Survey makes no representation to<br />\nthe accuracy or completeness of the data and may not be held liable for human error or defect. Data are only valid at<br />\n1:24,000 scale. Data should not be used at a scale greater than that.<br /><br />\nAcknowledgements: This geologic map was funded in part by the USGS National Cooperative Geologic Mapping<br />\nProgram. The views and conclusions contained in this document are those of the author(s) and should not be interpreted<br />\nas necessarily representing the official policies, either expressed or implied, of the U.S. Government.<br /><br />\nOriginal geologic field mapping conducted in 1967-1970 by G.W. Fisher, assisted by P. G. Robelen and Juergen<br />\nRhinehardt.  Limited field reconnaissance conducted in 1996-2000 by Scott Southworth. Limited field<br />\nreconnaissance conducted in 2003 and 2004 by J. P. Reger and D. K. Brezinski. Geologic map compiled in<br />\ndigital form and edited by Heather Quinn, Maryland Geological Survey and Brent Anderson and Catherine Luckhardt<br />\nof Towson University, Center for Geographic Information Sciences.<br /><br />\nThe facilities and services of the Maryland Department of Natural Resources are available to all without regard to race,<br />\ncolor, religion, sex, sexual orientation, age, national origin or physical or mental disability.<br /><br />\nPublished October 2004<br />\nVersion: NEWWI2004.1<br /><br /><br /><br />\nLate Prote<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n(1¥/3) that crops out west of the Avondale fault.<br /><br />\nMetabasalt “a”<br /><br />\nInterlayered massive to schistose metabasalt (“greenstone™)<br />\nand green to greenish blue chlorite phyllite that is virtually<br />\nindistinguishable from (€Zsc), but retained here as a separate<br />\nunit to aid in comparing this to Fisher’s (1978) map. Phyllite<br />\nlocally contains irregular, mottled patches of white mica and<br />\nquartz, resembling amygdaloidal volcanic clasts; metabasalt<br />\nlocally contains relict amygdules filled with quartz, albite,<br />\nepidote, and chlorite.  Corresponds to the Ijamsville<br />\nmetabasalt (1jgs) of Fisher (1978) that crops out west of the<br />\nAvondale fault.<br /><br />\nChlorite phyllite<br /><br />\nGreen to greenish blue chlorite phyllite.  Contains<br />\nsubordinate amounts of paragonite and muscovite and<br />\nvariable amounts of quartz. Chloritic laminac commonly<br />\nalternate with white mica-albite-quartz layers up to 5 mm<br />\n(0.2 inch) thick; most of these layers parallel axial-plain<br />\ncleavage and must be tectonic in origin, but some may be<br />\nrelict bedding laminations (Fisher, 1978). Locally contains<br />\nvolcaniclastic fragments or amygdaloidal phyllite up to 3 cm<br />\n(1.2 inches) long in a hematite-chlorite-white mica phyllite<br />\nmatrix. A few rocks contain scattered amygdules filled with<br />\nquartz, albite, epidote, and chlorite and flattened parallel to<br />\nthe cleavage. Corresponds to the Sams Creek chlorite<br />\nphyllite (sccp) of Fisher (1978).<br /><br />\nChlorite phyllite “a”<br /><br />\nTan to dark-greenish-blue albite-quartz-muscovite-chlorite<br />\nphyllite and albite-quartz-muscovite phyllite interbedded<br />\nwith chlorite phyllites and muscovite phyllites like those of<br />\nSams Creek chlorite phyllite “b”. Phyllite “a” may be<br />\ndistinguished from phyllite “b™ by the presence of euhedral<br />\nalbite porphyroblasts, commonly about 0.5 mm on a side.<br />\nWell exposed only along the major stream valleys; weathers<br />\nreadily to a thick, tan, quartzose saprolite that underlies the<br />\nhigher ridges in the eastern part of the quadrangle.<br />\nCorresponds to the Wissahickon albite phyllite (wap) of<br />\nFisher (1978) that crops out west of the Avondale fault.<br /><br />\nChlorite phyllite “b”<br /><br />\nDark-bluish  gray  quartz-paragonite-muscovite-chlorite<br />\nphyllite. Commonly contains limonite pseudomorphs after<br />\npyrite and minute disseminated flakes of hematite. This unit<br />\nincludes phyllites indistinguishable from those in (€Zsccp),<br />\nbut most are more micaceous and contain fewer<br />\nvolcaniclastic breccia fragments. Chloritic laminae<br />\ncommonly alternate with mica-albite-quartz layers up to 5<br />\nmm thick; much of the layering is axial to minor folds and<br />\nclearly metamorphic, but some may be relict bedding.<br />\nCorresponds to the Ijamsville chlorite phyllite (ijcp) of<br />\nFisher (1978) that crops out west of the Avondale fault.<br /><br />\nREFERENCES CITED<br /><br />\nBrezinski, DK., 2004, Stratigraphy of the Frederick Valley and its<br />\nRelationship to Karst Development: Maryland Geological Survey<br />\nReport of Investigations No. 75, 101 p.<br /><br />\nDrake, A.A., Jr., 1994, The Soldiers Delight Ultramafite in the<br />\nMaryland Piedmont, in Stratigraphic Notes, 1993: U.S.<br />\nGeological Survey Bulletin 2076, A1-A14.<br /><br />\nEdwards, Jonathan, Jr., 1986, Geologic map of the Union Bridge<br />\nquadrangle, Carroll and Frederick Counties, Maryland: Maryland<br />\nGeological Survey, scale 1:24,000.<br /><br />\n, 1993a, Geologic map of the Manchester quadrangle, Carroll<br />\nCounty, Maryland: Maryland Geological Survey, open-file map,<br />\nscale 1:24,000.<br /><br />\n, 1993b, Geologic map of the Westminster quadrangle, Carroll<br />\nCounty, Maryland: Maryland Geological Survey, open-file map,<br />\nscale 1:24,000.<br /><br />\n, 1994, Geologic map of the Libertytown quadrangle, Carroll<br />\nand Frederick Counties, Maryland: Maryland Geological Survey,<br />\nopen-file map, scale 1:24,000.<br /><br />\n, 1996, Geologic map of the Winfield quadrangle, Carroll and<br />\nFrederick Counties, Maryland: Maryland Geological Survey,<br />\nopen-file map, scale 1:24,000.<br /><br />\nFisher, G.W., 1978, Geologic map of the New Windsor quadrangle,<br />\nCarroll County, Maryland: U.S. Geological Survey Miscellaneous<br />\nInvestigations Series, Map 1-1037, 1 sheet, scale 1:24,000.<br /><br />\nGates, A.E., Muller, P.D., and Valentino, D.W_, 1991, Terranes and<br />\ntectonics of the Maryland and southeast Pennsylvania Piedmont,<br />\nin Schultz, A., and Compton-Gooding, E., Geologic evolution of<br />\nthe eastern United States, Field trip guidebook, NE-SE Geological<br />\nSociety of America: Virginia Museum of Natural History,<br />\nGuidebook 2, p. 1-27.<br /><br />\nHiggins, M. W., 1973, Superimposition of folding in the northeastern<br />\nMaryland Piedmont and its bearing on the history and tectonics of<br />\nthe central Appalachians: Am. Jour. Sci., v. 273-A, p. 150-195.<br />\nHoward, C.S., 1994, Structural and tectonic evolution of Late<br />\nProterozoic through Early Cambrian metasedimentary rocks, York<br />\nCounty, Pennsylvania: Newark, University of Delaware,<br />\nunpublished Ph.D. dissertation, 218 p.<br /><br />\nJonas, A L. and Stose, G.W., 1938, New formation names used on the<br />\ngeologic map of Frederick County, Maryland: Washington<br />\nAcademy of Sciences Journal, v. 28, no. 8, p. 345-348<br /><br />\nKunk, M. J., Froelich, A. J., and Gottfried, D., 1992, Timing of<br />\nemplacement of diabase dikes and sheets in the Culpeper basin<br />\nand vicinity, Virginia and Maryland; 40Ar/39Ar age spectrum<br />\nresults from hornblende and K-feldspar in granophyres [abs]:<br />\nGeological Society of America Abstracts with Programs, v. 24, no.<br />\n1, p.25.<br /><br />\nSTATE OF MARYLAND<br /><br />\nRobert L. Ehrlich, Jr.<br />\nGovernor<br /><br />\nMichael S. Steele<br />\nLieutenant Governor<br /><br />\nMARYLAND<br /><br />\n= DEPARTMENT OF<br />\nNATURAL RESOURCES<br /><br /><br /><br />\ne<br /><br />\nDEPARTMENT OF NATURAL RESOURCES<br />\nC. Ronald Franks<br />\nSecretary<br /><br />\nMARYLAND GEOLOGICAL SURVEY<br />\nEmery T. Cleaves<br /><br />\nCopies of this map are available<br />\nn hard copy (paper) and digital form from:<br />\nMARYLAND GEOLOGICAL SURVEY<br />\n2300 Saint Paul Street<br />\n% Baltimore, MD 21218<br />\nPh: 410-554-5500<br />\nFax: 410-554-5502<br />\nhttp://www.mgs.md.gov/<br /><br /><br /><br />\n- occur within the Prettyboy Schist.<br /><br />\nA maw AAAAW LS SMAANAE WALIVL LW \\.ulmuvtwllotl\\aull_y arv buslcsawu ad&gt;<br />\npinstripe laminations spaced 1 to 3 cm (3/8 to 1 inch) apart<br />\nand parallel to cleavage. Disrupted fold hinges are locally<br />\npreserved between cleavage laminations.  Crops out<br />\nextensively and commonly forms low ridges capped by a thin<br />\nsandy soil. Corresponds to the Ijamsville mica-chlorite-<br />\nquartz phyllite (1jqp) of Fisher (1978) cast of the Avondale<br />\nfault.<br /><br />\nMetabasalt<br /><br />\nSchistose to massive metabasalt interlayered with green to<br />\ngreenish blue chlorite phyllite and minor gray hematite-<br />\nmuscovite phyllite. The metabasalt contains fine-grained<br />\nchlorite, actinolite, albite, epidote, and quartz with minor<br />\nsphene and magnetite. Most of the rock has a schistose<br />\ntexture, but locally epidote pods and porphyritic basaltic<br />\ntexture 1s well preserved. Corresponds to the Sams Creek<br />\nmetabasalt (scgs) of Fisher (1978) that is east of the<br />\nAvondale fault and occurs within the Prettyboy Schist or<br />\nmuscovite phyllite subunit.<br /><br /><br /><br />\nMarble<br /><br />\nLight gray to white, massive dolomitic marble.<br />\nDiscontinuous areas of marble that crop out east of the<br />\nAvondale fault were previously mapped as Wakefield<br />\nMarble, but the stratigraphic equivalency cannot be<br />\nestablished. This marble is moderately well exposed in<br />\nplaces; occupies topographic depressions and weathers to a<br /><br />\nthin red soil, locally covered by slope wash from adjacent<br />\nhills.<br /><br /><br /><br />\nMuscovite phyllite<br /><br />\nBuff to light-olive-green quartz-muscovite phyllite with<br />\nsubordinate silvery gray quartz-paragonite-muscovite-<br />\nchlorite phyllite and muscovite-quartz phyllite. Numerous<br />\nlimonite cubes, up to 2 cm (3/4 inch) on a side, are<br />\npseudomorphs after pyrite. Hematite and tourmaline are<br />\ncommon accessory minerals. Very poorly exposed; weathers<br />\neasily into a thick resistant saprolite containing abundant<br />\nchips of phyllite. Underlies broad, gently sloping hills.<br />\nCorresponds to select parts of the Ijamsville muscovite<br />\nphyllite (iymp) of Fisher (1978) east of the Avondale fault<br />\nthat are associated with the Prettyboy Schist.<br /><br />\nQuartzite<br /><br />\nLight gray to tan to reddish, schistose quartzite up to 6 m (20<br />\nfeet) thick with individual layers 15 to 60 cm (6 to 24 inches)<br />\nthick that are interbedded with muscovite phyllites and<br />\nchlorite phyllites. Lenses or pods of white vein quartz are<br />\nalso common. Corresponds to parts of the Ijamsville<br />\nquartzite (1)q) of Fisher (1978) east of the Avondale fault that<br /><br /><br /><br />\nREFERENCES CITED (continued)<br /><br />\nKunk, M.J., Wintsch, R.P., Southworth, C.S., Mulvey, B.K, Naeser,<br />\nC.W., and Naeser, N.D., 2004, Multiple Paleozoic metamorphic<br />\nhistories, fabrics, and faulting in the Westminster and Potomac<br />\nterranes, Central Appalachian Piedmont, Northern Virginia and<br />\nSouthern Maryland, in Southworth, Scott and Burton, William<br />\n(eds.), Geology of the National Capital Region — Field Trip<br />\nGuidebook, NE-SE Geological Society of America: U.S.<br />\nGeological Survey Circular 1264, p. 163-188.<br /><br />\nMuller, P.D., Candela, P.A., and Wylie, A.G., 1989, The Liberty<br />\nComplex; Polygenetic melange in the central Maryland Piedmont,<br />\nin Horton, JW_, Jr., and Rast, N., eds., Melanges and olistostromes<br />\nof the U.S. Appalachians: Geological Society of America Special<br />\nPaper 228, p. 113-134.<br /><br />\nRankin, D.W_, Drake, A.A., and Ratcliffe, N.M., 1990, Geologic map<br />\nof the U.S. Appalachians showing the Laurentian margin and the<br />\nTaconic orogen, plate 2, in Hatcher, R.D., Jr., Thomas, W.A., and<br />\nViele, G.W., eds., The Appalachian-Ouachita orogen in the United<br />\nStates: Geological Society of America, The Geology of North<br />\nAmerica, Boulder, v. F-2, scale 1:2,000,000.<br /><br />\nSmith, R.C., II, and Barnes, J.H., 1994, Geochemistry and geology of<br />\nmetabasalt in southeastern Pennsylvania and adjacent Maryland, in<br />\nFaill, R.T., and Sevon, W.D., eds., Various aspects of Piedmont<br />\ngeology in Lancaster and Chester Counties, Pennsylvania:<br />\nGuidebook, 59th Annual Field Conference of Pennsylvania<br />\nGeologists, p. 45-71.<br /><br />\nSouthworth, Scott, 1996, The Martic fault in Maryland and its tectonic<br />\nsetting in the central Appalachians, in Brezinski, D.K. and Reger,<br />\nJ.P., Studies in Maryland Geology: Maryland Geological Survey<br />\nSpecial Publication No. 3, p. 205-221.<br /><br />\n1998, Geologic map of the Poolesville quadrangle, Frederick<br />\nand Montgomery Counties, Maryland, and Loudoun County,<br />\nVirginia: U.S. Geological Survey, Geologic Quadrangle Map GQ-<br />\n1761, scale 1:24,000.<br /><br />\n, 1999, Geologic map of the Urbana quadrangle, Frederick and<br />\nMontgomery Counties, Maryland: U.S. Geological Survey, Geologic<br />\nQuadrangle Map GQ-1768, scale 1:24,000.<br /><br />\nSouthworth, Scott, Brezinski, D K., Drake, A.A., Burton, W.C.,<br />\nOrndorff, R.C., Froelich, A J., Reddy, J.E., and Denenny,<br />\nDanielle, 2002, Digital geologic map and database of the<br />\nFrederick 30 x 60 minute quadrangle, Maryland, Virginia, and<br />\nWest Virginia: U.S. Geological Survey, Open-File Report OF-02-<br />\n437, scale 1:100,000.<br /><br /><br /><br /><br /><br />\nG3841<br />\n.C5<br />\ns24<br /><br />\nM3<br />\nNew Windsor<br />\nSheet 1<br />"}], "field_media_file": [{"target_id": 52352, "display": null, "description": null, "target_type": "file", "target_uuid": "3dbbc0fb-af9f-4c36-b7bb-67a0b2f1ce14", "url": "http://digital.library.jhu.edu/system/files/2022-03/16179-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16179, "target_type": "node", "target_uuid": "7f5a1b7e-25ca-45bf-b0e7-58e2f9e1b8a5", "url": "/node/16179"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d03509d8-f2ad-4cc7-b992-b19cfbec3272"}]}