{"mid": [{"value": 38181}], "uuid": [{"value": "43fdf561-64d6-49d6-84a7-b57b7a2fbf61"}], "vid": [{"value": 38181}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12748-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:54+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nIpts iqopkins Dirtuarattrr<br />\n<br />\nGET SEMESTER MARKS<br />\nFROM YOUR ADVISOR<br />\nON FEBRUARY 3<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br />\n<br />\nVOL. XLI, NO. 21<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nG-Man To Talk Electrical Dept. Annual Down Bay Musical Club Ends Cotillion Board Announces<br />\nSet For Engineering Conference To Take FirstPart OfSeason Hal Kemp And Orchestra<br />\nAt 1st Assembly Show<br />\nIn February Place February 6,7 WithThreeConcerts<br />\nFor Second Affair, Feb. 22<br />\nUnder New Plan Celebration To Be Held In Henry Leber, President Of Musicale At Maryland Cas•<br />\n<br />\nHugh H. Clegg, Ass't. Director Of F.B.I. To Speak<br />\nOn Crime Detection<br />\n<br />\nHonor Of Twenty-Fifth<br />\nAnniversary Of School<br />\n<br />\n'I\" Is Chairman Of<br />\nConference<br />\n<br />\nualty Last Sunday Featured By Glee Club<br />\n<br />\nComes As<br />\nProfessor Russell Announcement<br />\nSurprise; Marks Kemp's<br />\n2nd Appearance Here<br />\nAt Gives Dohme Talk<br />\n<br />\nMany Spectacular Exhibits Fifteen Members From Hop- Next Event Scheduled<br />\nMaryland College For<br />\nkins To Attend Meeting<br />\nPlanned Including ArtiENNIS TO VOCALIZE<br />\nATTORNEY TO SPEAK<br />\nGases<br />\nReveals<br />\nPlanets<br />\nRetain<br />\nWomen,<br />\nFebruary<br />\n5<br />\nIn Virginia<br />\nficial Lightning<br />\nIn Proportion To Size<br />\nLord Baltimore Chosen As<br />\nArthur Garfield Hayes To The passage of light over a sound The annual Down the Bay Confer- Three concerts over last week-end<br />\nAnd<br />\nWeight<br />\nScene Of Affair; ComMake Annual Visit On<br />\nbeam, a miniature dial telephone ex- ence, sponsored by the Student Y's in concluded the first part of the current<br />\nMaryland, Washington, and Virginia, season by the Johns Hopkins Musical<br />\nmemoration Night<br />\nDr. Henry Norris Russell, Professor<br />\nMarch 11th<br />\nchange showing what actually hapwill be held Saturday and Sunday,<br />\n--Astronomy<br />\nUniverat<br />\nPrinceton<br />\nof<br />\nFriday,<br />\nJanuary<br />\n15,<br />\nthe<br />\norClub.<br />\nOn<br />\npens when a call is made, a demon- February 6th and 7. Henry Leber,<br />\nOnce more Hopkins men will lift<br />\nThe first Assembly under the new<br />\nsity, delivered one in a series of<br />\n<br />\nstration of a modern power transmis- President of the Hopkins \"Y,\" is ganization traveled to Annapolis to<br />\nDohme Lectures yesterday afternoon their tired dogs to gaily trip the<br />\npresent its program before the Annapsion line, and many other exhibits Chairman of the Conference.<br />\nat 4:00 in Remson Hall. His topic was light fantastic to the sweet, scintilfeat-LETTER,<br />\nwill<br />\nNEWS<br />\nthe<br />\nCouncil by<br />\nThe theme of this year's conference olis High School. Roberts Beach \"The Atmospheres of the Planets.\"<br />\nshowing the phenomena of fundamenlating rhythms of Hal Kemp and his<br />\nDiAssistant<br />\nClegg,<br />\nH.<br />\nure Mr. Hugh<br />\ntal electrical engineering will be among is to be Social Security, and among School was the scene for the concert<br />\nIntroduced by Dr. Hubbard, of the Orchestra, at the second Cotillion.<br />\nof<br />\nInBureau<br />\nFederal<br />\nof<br />\nthe<br />\nrector<br />\nthe leaders are:<br />\non Saturday, January 16. As part of Physics department as being \"the<br />\nthe features in the exhibits presented<br />\nvestigation, who will address the<br />\nWinant, Chair- the Maryland Casualty Musical series, greatest astronomer in America,\" his Surprising almost everyone, the CoHonorable<br />\nJohn<br />\nG.<br />\nby the Electrical Department for the<br />\ntillion Board suddenly announced<br />\nman of the Social Security Board,<br />\nstudents on February 11, on \"Scien- Engineering Show, to be held in Febthe Hopkins Glee Club and soloists lecture was judged as being extremely<br />\nthat<br />\nformer<br />\nGovernor<br />\nof<br />\nNew<br />\nHampthe Kemp outfit had been definteresting<br />\nand<br />\ninformative<br />\nby<br />\nthose<br />\ntific Crime Detection.\"<br />\nruary.<br />\ngave a concert on Sunday, January 17.<br />\nshire<br />\ninitely<br />\nselected to mete out melody<br />\nWho<br />\nattended.<br />\nOn March 11, Arthur Garfield<br />\nThe Engineering Show is being preIn the presentations at Annapolis<br />\nRoss W. Sanderson, Executive Sec'Spots' Indicate Planet Composition at the Lord Baltimore on February<br />\nHayes, Attorney for the American sented in conjunction with the celeretary of Baltimore Federation of and the Roberts Beach School, all of<br />\nDr. Russell told first of the various 22nd.<br />\nCivil Liberties Union, will be the bration of the twenty-fifth anniverChurches<br />\nthe<br />\ndepartments<br />\nof<br />\nthe<br />\nclub,<br />\nincludOne of the nation's outstand_ dance<br />\nplanets; Jupiter, Mrs. Saturn, the<br />\nsary of the Engineering School. It<br />\nguest speaker.<br />\nRev. Joseph Novak, Pastor of St.<br />\ning the Glee Club, Banjo Club, Blue Moon, Venus, etc., and explained about aggregations, the Kemp men have<br />\nwill consist of a great variety of exPaul's Presbyterian Church<br />\nFirst Speaker<br />\nhad no \"Date with an Angel\" at the<br />\nhibits presented by each of the EnMr. Paul Rotham, Executive Sec- Jay Orchestra, Hawaiian Troupe, their \"spots,\" and \"twilight effects.\"<br />\nAssistant Director Clegg has been gineering Departments. The ElectriHopkins<br />\nsince June, 1935, when they<br />\nMars<br />\nhas<br />\nconstant<br />\nspots;<br />\nin<br />\nJupiter<br />\nretary, Baltimore Local No. 4 of Quartet, and soloists, joined in the<br />\nwith the Bureau of Investigation cal Engineering exhibits will be found<br />\nserenaded the Juniors at their promare<br />\nirregular<br />\nattendance;<br />\nthey<br />\nin<br />\nSatthe American Radio-Telegraphers programs, which were given in the<br />\nurn's are faint and irregular, appear- enade. The smooth song stylists have<br />\nsince 1926. Since that time, he has in Maryland Hall.<br />\nAssociation<br />\nevening. At the Maryland Casualty, in<br />\ngand disappearing suddenly; the kept college men all over the counOfficer<br />\nAdministrative<br />\nspectacular<br />\nexhibserved as an<br />\nOne of the most<br />\nLuther Becker of the Federal Social<br />\n•the Glee Club and soloists presented planet Venus shows in ultra violet try agog, however, with their inimitmoda<br />\nits<br />\nwill<br />\nbe<br />\na<br />\ndemonstration<br />\nof<br />\nSecurity<br />\nBoard.<br />\ncharge<br />\nof<br />\nand as Special Agent in<br />\nable rhythm, and arrangements, retranmission line, showing<br />\nWilliam J. Lahan of the Baltimore a concert in a series in which well- light the twilight effect; and the<br />\nthe Atlanta, Georgia, Washington, ern power<br />\ncording, and broacasts, as well as<br />\nthe effect produced when the wires or<br />\nBranch of the Federal Social Se- known music organizations, including Moon has no twilight effects, refracD.C., and Chicago, Illinois, Field Divtion, or star occultation. These facts personal appearances.<br />\ntowers are struck by lightning. This<br />\ncurity Board.<br />\n•<br />\nthe 8 and 0 Glee Club, U. S. Army<br />\nindicate certain characteristics conisions. He was appointed an Inspect- exhibit shows an actual lightning<br />\nCollegiate Band<br />\nPhilip Jacob, Yale 1935, Represent- Band, and others participated.<br />\ncerning the composition of the atmosor in 1930, and in 1932 was made stroke in miniature, and the resultant<br />\nHal Kemp has a typical and perative of the Youth Section of the<br />\nGlee Club Card<br />\npheres of the planets. By ultra violet fect college man's band. Himself<br />\neffect on the power system.<br />\nEmergency Peace Campaign.<br />\na<br />\nAssistant Director of the Bureau.<br />\nOn<br />\nthe<br />\ncard<br />\nof the Glee Club were ray study, by the use of balometers, North Carolina man, Hal favors<br />\nAs<br />\nthe<br />\nname<br />\npoints<br />\nout,<br />\nthe<br />\nconany<br />\nArtificial Lightning<br />\nA graduate of Millsaps College, in<br />\nspectroscopes and other intruments, and all with his deep southern<br />\nthe following selections:<br />\nacExperiments<br />\nshowing<br />\nartificial ference is held on shipboard going<br />\nJackson, Mississippi, Mr. Clegg also<br />\nmuch definite information has been cent in conversation at any time—<br />\nOde<br />\nby<br />\nDevries<br />\nand<br />\ndown<br />\nthe<br />\nChesapeake<br />\nBay<br />\nand<br />\nthe<br />\nJohns<br />\nHopkins<br />\nas<br />\nhigh<br />\nfrequency<br />\nlightning<br />\nas<br />\nwell<br />\nholds an LL.B. degree from George<br />\ngained. It has been ascertained that that is, of course, if anyone gets<br />\nStarr<br />\nvoltage of the order of 1,000,000 volts general session will be held Sunday at<br />\nMars and Venus have atmospheres through the twenty deep crowd<br />\nWashington University. Before joinVirginia.<br />\nHampton<br />\nInstitute,<br />\nthat<br />\nI Love Life by Mana Zucca<br />\nwill also be demonstrated. A spark of<br />\nwhich are analagous to ours. The constantly surrounds him.<br />\ning the Bureau of Investigation, he<br />\nThe<br />\nHopkins<br />\ndelegation<br />\nunder<br />\nthe<br />\nfrom three to four feet in length has<br />\nThe Lord's Prayer by Albert Hay three planets Earth, Venus and Mars<br />\ntaught Latin, Chemistry, and Physleadership of Bryant Mather will join<br />\nThe whole bunch, in fact, is apbeen developed in this apparatus.<br />\nMallotte<br />\nare called the \"terrestrial planets\"<br />\nics at Millsaps College, Wood Junwith the representatives of 15 colleges<br />\nparently tetched in the haid. They are<br />\nanother<br />\nIn<br />\nexhibit various methods<br />\nHigh Barbary by Arthur E. Hall and come midway between the smaller<br />\nior College and Emerson Institute.<br />\nIn the vicinity of Baltimore, and<br />\nprobably the only band in the counHe is also a major in the Military of illumination will be shown. The board the boat at Baltimore. Their<br />\nShenandoah by Marshall Barthol- planets like Mercury and the Moon, try who can start a difficult<br />\narrangeand the bigger planets like Jupiter.<br />\nIntelligence Division of the Officers mercury vapor light and the sodium conference will take place enroute to<br />\nomew<br />\nment, and while carrying through to<br />\nlight<br />\nvapor<br />\nwill<br />\nbe<br />\namong<br />\nthese.<br />\nTests<br />\nReserve Corps, United States Army.<br />\nThe meat of the lecture might be the end perfectly<br />\nHampton Institute, Virginia, where<br />\nSalt Beef by Thomas Word<br />\nwithout a break,<br />\nwill be made to show the effect of there will be a general meeting on<br />\nAssembly Plan<br />\nWanderer's Song by Robert Schu- discovered in a careful consideration carry on a wrestling match, exchange<br />\nthese and other types of lights on nat- Sunday.<br />\nof what Dr. Russell had to say con- remarks with the dancers„ and otherThe Assemblies during the months<br />\nman<br />\nural colors.<br />\nFifteen students from Hopkins have<br />\ncerning the relative sizes of the plan- wise direct both themselves and their<br />\nof February and March are to be run<br />\nDear Old Johnny Hopkins arr. by<br />\nTwo Way Radio Communication<br />\nets, their proportional strength of listeners.<br />\nsigned up to make the trip. Any other<br />\nby students under the joint organiSteinwald<br />\nwho<br />\nconferstudents<br />\nwish<br />\nto<br />\njoin<br />\nthe<br />\ngravitational forces, an dthe gases<br />\ntwo-way<br />\nradio<br />\ntelephone<br />\nA<br />\ncommuzation of the NEWS-LETTER and the<br />\nThe orchestra is especially noted<br />\nHopkins Medley arr. by Steinwald which, because of the weakness or<br />\nStudent Council. Plans for speakers nication between an automobile on the ence are asked to get in touch with<br />\nfor its trumpets and rhythm section<br />\nConrad Gebelein has charge of the strength of the gravity on any one of<br />\nand rules for attendance are those campus and a station in Maryland Henry Leber immediately.<br />\nin general.<br />\nThe entire cost, including stateroom Hawaiian Troupe and Banjo Club, the planets, is either held to the<br />\nsuggested by the NEWS-LETTER, and Hall will be operated during the show.<br />\nPlaying with perfect precision and<br />\nthe Student Council has consented to \"Five meter\" radio phone transmit- on the boat, meals, and Registra- while Osmar P. Steinwald directs the planet, or flies off it into space. Small<br />\na<br />\ntriple-tonguing<br />\neffect that is unique,<br />\nplanets, where the gravity is low canters will be used, and the conversation tion fee, is $8.75.<br />\ncooperate in this experiment.<br />\nGlee Club and Quartet.<br />\nand which no other band has been<br />\nnot<br />\nhold<br />\non<br />\nto<br />\neven<br />\nthe<br />\nheaviest<br />\nof<br />\nAs stated in last week's NEWS- will be available to the audience from<br />\nSchedule Listed<br />\ngases in their atmospheres. The ter- able to achieve, they form a perfect<br />\nLETTER, \"It (the experiment) arises loud speakers.<br />\nH. Thatcher Procured<br />\nAmong other concerts scheduled restrial planets can, by virtue of their background that is subdued and yet<br />\nA polarized light experiment showfrom a desire to permit such an exBy Friends Of Music are:<br />\nincreased gravitational forces, hold on unforgettable. It is this very rhythm<br />\nperiment to prove its worth, and the ing how the glare of automobile headMaryland College for Women, Feb- to the heavier gases, but allow such that makes the new Kemp rendition<br />\noutcome to clear up many questions lights can be avoided by use of a reA lecture on \"The Fugue as a<br />\ngases like hydrogen, a very light of Cole Porters I've Got You Under<br />\nruary 5<br />\nconnected with assemblies in gen- cently patented invention. A trans- Form\" will be delivered by Howard<br />\nmolecule, to leave their atmospheres. My Skin, such a sensation the counGuilford Church, February 12<br />\nparent material will be placed over<br />\neral.\"<br />\nR. Thatcher of the Peabody ConThe<br />\nlargest planets, like Jupiter, are try over.<br />\nthe windshield. The light passing<br />\nNational Park Seminary, Februservatory of Music under the ausThey can always be counted on for<br />\nable to hold on to all the gases, even<br />\nthrough these two materials will be<br />\nary 20<br />\npices of the Friends of Music Sohydrogen. Dr. Russell explained in \"I've Got a Date with an Angel,\"<br />\ncompletely blocked out.<br />\nHome Concert, February 26<br />\nciety of the Johns Hopkins Univerdetail how astronomers have arrived having played it for so long and so<br />\nWeather Bureau Exhibit<br />\nAtlantic City, March 6<br />\nsity on Friday, February 5. The adtypically, that to mention one is to<br />\nat the above conclusions.<br />\nSome former Hopkins men now con- dress is to be delivered in the parlor<br />\nCatonsville High School, March 12<br />\nDr. Russell, born at Oyster Bay, think of the other. The vocal here is<br />\nnected with the Weather Bureau will of Levering Hall at 8 P.M. It is to be<br />\nOfficers of the Club are John New York,in 1877 took his A.B. degree led by Skinny Ennis, with the whole<br />\nhave an exhibit here showing meth- a purely non-technical discussion with<br />\nat Princeton and his Masters one year band assisting.<br />\nMarks To Be Obtained From ods of making observations. A cello- illustrations on the piano of the var- Steeper, president; J. Judge Mehl- later.<br />\nKemp himself can be counted on to<br />\nThe degree of Doctor of Philing, business manager; Allan L. Pink(Continued on Page 3, Col. 2)<br />\nious points of the lecture.<br />\nAdvisor As In Other<br />\nosophy was conferred on him in 1900. play either saxophone or clarinet,<br />\nerton and John J. Ghinger, vice-pres- From 1902 to 1903, he was a research being a master of both. Long, lean,<br />\nSchools<br />\nidents; Bradford Johnson and Thom- student at Kings College, Cambridge, and lanky, he is a perfect showman<br />\nas E. Ellis, junior business managers; England, and from 1903 to 1905, he to boot.<br />\nBreaking a long established HopFour-Star Vocalists<br />\nkins proceedure, term marks will not<br />\nand Stanley M. Finkel, publicity man- served at Cambridge as Research Assistant of the Carnegie Institution.<br />\nThe Kemp aggregation features its<br />\nbe posted, following the period of exager.<br />\nReturning to America in 1905, he four four-star vocalists. Skinny Ennis,<br />\naminations this year. Instead, each<br />\nbecame an instructor in Astronomy at as ever, when not at his traps, imstudent will see his advisor, who will<br />\nPrinceton, being advanced to Assist- parts that breathless quality to a set<br />\nhave been notified of the grades Jay Orators Enthusiastic But Need More Support; Next<br />\nant Professor in 1908. In 1911, he be- of lyrics whch makes one gasp and<br />\nearned by the student.<br />\nContest Will Be Held In<br />\ncame Professor of Astronomy, the po- writhe. Hugging the microphone to<br />\nThis system has been adopted at<br />\nLevering Hall<br />\nsition which he now holds. Joining death, he pours his heart and soul<br />\nother universities, though for differthe staff of the Mount Wilson Ob- into the romance of the melody, and<br />\nClub<br />\nAlso<br />\nBiology<br />\nJournal<br />\nHears<br />\nMiss<br />\nent reasons than caused Hopkins'<br />\nthoughts of sleep forgotten in an ex\"Bang, Bang!\"<br />\nservatory in 1912 as Director of Ob- the result is enough to make a refrigMutations<br />\nCrouse<br />\nOn<br />\nHelen<br />\nchange. Elsewhere, posting of differAnd your correspondent, awakened cess of enthusiasm.<br />\nservation, he became a Research As- erator amorous.<br />\nin Drosophila<br />\nent grades has led to various forms<br />\nfrom a sound sleep on an early Sunsociate<br />\nin 1921 and Research Profesweek,<br />\nin<br />\nthe<br />\nThe<br />\nfollowing<br />\nevening<br />\nof the tutoring racket, and even<br />\nSaxy Dowell, maddest of the mad<br />\nday morning (11.40 .M.), is uncer- this time, another debate was held.<br />\nMembers of the Biology Journal sor in 1927.<br />\nthough offers made a student may be<br />\ncrew, when not yelling out some<br />\nemoniously dragged out of bed by an This time, the crowd was even smaller Club yesterday heard U. L. HiginDr. Russell is a member of the Nahonest, public notice of failure has<br />\ncatchy novelty tune does his turn at<br />\nexcited youth with a fever in his eye due to the fact that the students<br />\ntional Academy of Sciences; Ameribeen found inadvisable.<br />\nbotham, graduate student in botany,<br />\nsecond sax. Master musician and<br />\nto be conscripted as an \"audience.\"<br />\ncan Philosophical Society, of which he<br />\nweren't in their rooms at the time<br />\nclown, Saxy affords the comic relief to<br />\npresent a review of \"Growth Hor- was<br />\npresident from 1931 to 1932;<br />\nThis scene, duplicated in other parts that the \"collection\" began. The few<br />\nsuper-syncopation.<br />\nChemistry Journal Club<br />\nof the dormitory had, as its ultimate who had heard the mumbled an- mones in Plants,\" written by Boyce American Academy of Arts and SciMaxine Grey, eyeliner extraordiBegins Lecture Series purpose, the accumulation of a fairly nouncement at dinner didn't take it Jensen and translated into English by ences; American Astronomical Soci- nary, lends feminine sweetness<br />\nand<br />\nety,<br />\nof<br />\nwhich<br />\nhe<br />\nwas<br />\npresident<br />\nfrom<br />\nsize<br />\naudience<br />\nto<br />\nabout<br />\nthe<br />\nlisten to a de- seriously, or, uninformed<br />\nlarge<br />\nAvery and Birkholdbr. It is the first<br />\ncharm,<br />\ncoupled<br />\nwith<br />\na<br />\nsmooth,<br />\nlovely<br />\nThe Chemistry Journal Club has in- bate between the Johns Hopkins and interest in listening to a well-prepared volume on the subject which has been 1934 to 1936; American Physical Society; and the Royal Astronomical voice. Last, but by no means least,<br />\ndebate, didn't bother to attend.<br />\naugurated a series of student lectures, the Manhattan College forenseurs.<br />\ntranslated into English.<br />\nSociety (London), where he was the Is Bob Allen, tenor romanticist, once<br />\nThe second debate was held against<br />\nAbout a dozen sleepy-eyed stupresented every Tuesday afternoon at<br />\nheard, never forgotten.<br />\ndone gold medalist in 1921.<br />\nwho<br />\nhas<br />\nCrouse,<br />\nMiss<br />\nHelen<br />\n4.00 o'clock in Room 221, Remsen dents, not knowing or caring whether the University of Pennsylvania. It<br />\nexCollege<br />\nSmith<br />\nIn<br />\n1912,<br />\nhe<br />\nwas<br />\nwork<br />\nat<br />\nawarded<br />\ngraduate<br />\nthe<br />\nHenry<br />\nfirst,<br />\nand<br />\nwitnessing<br />\na<br />\nhotter<br />\nthan<br />\nthe<br />\nHall.<br />\nwedding or was even<br />\nthey were<br />\nThe first lecture, delivered last execution, were dragged down to the the sparse audience and the corres- perimenting with fruit-flies and their Draper Medal by the National AcadCall For Meeting<br />\nemy of Sciences, and the Lelande<br />\nTuesday by Mr. A. L. Sklar dealt with Commons Room that morning. Hardly ponding weakness of applause was no reactions to different temperatures,<br />\nThere will be an important meet\"Absorption of Light by Organic had they been there five minutes, detriment to the spirit with which the spoke on \"Body Mutations Produced Medal by the French Academy. Three<br />\nCompounds.\" The next lecture will be when they sat up, rubbed their eyes, debaters conducted their forensic bat- in Drosophila by Exposures of Larva years later, the Astronomical Society ing of the members of the NEWSto Sub-Lethal 'llemperatures:\" She Pacific awarded him the Bruce Medal, LETTER staff after examinations on<br />\ngiven February 9, by Mr. C. F. Squires and asked what \"all the shootin' was tling.<br />\n',Ain. ft,. A rriorinan A no riarri.r nf A rta<br />\n_<br />\n_<br />\nThe inability of the Debating Team also cnseusseu me wont clone uy ±.)r.<br />\nFriday, February 5, at 12.20. 5iecon \"Specific Heat of Nickel,\" and the fur\". Shortly afterwards theye were<br />\nand<br />\nSciences<br />\nconferred<br />\nupon<br />\nhim<br />\nthe<br />\nworking<br />\nhas<br />\nbeen<br />\ntion for editor will be held at this<br />\nfollowing week, Mr. W. D. Kirkpat- giving excellent interpretations of to raise audiences is explained by the H. H. Plough, who<br />\nrick will speak on \"Compounds of the rabid racetrack fans watching the lack of advertisement accompanying on this same subject for the last two Rumford Medal. In 1934, he was retime.<br />\ncipient of the Franklin Medal.<br />\ndecades.<br />\n(Continued on Page 3, Col. 2)<br />\nfavorite nose ahead to the win„ all<br />\nInert Gases.\"<br />\nplan as suggested<br />\n<br />\nto the Student<br />\n<br />\nPosting Of Marks<br />\nCeases This Year<br />\n<br />\nAudience Roused From Arms<br />\nOf Morpheus To Hear Debate<br />\n<br />\nGrad Student Talks<br />\nOn Plant Hormones<br />\n<br />\n1<br />\n<br />\n\fHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br />\n<br />\n2<br />\n<br />\nTEbt 3obris jOopturts<br />\nletter<br />\n<br />\nand effort for the enjoyment derived<br />\nfrom this activity.<br />\nWe extend our congratulations to<br />\nthese men, the officers, and the directors--\"Gebbie\" Gebelein and \"Os\"<br />\nSteinwald.<br />\n<br />\nC<br />\n<br />\nAMPUS<br />\nOMMENT<br />\n<br />\nStudent Strikes<br />\nhisa•cniniuu ger yea.,<br />\nBy Mail<br />\n<br />\nElection By-Laws<br />\n<br />\nWhilst we here prepared to crowd a<br />\n<br />\nIntercollegiates<br />\nHanover, N.H. (A.C.P.)—War has down—no matter the excess yardage<br />\nput in its appearance on the extra- made, each forward or later pass<br />\ncurricular study program of Dart- completed and resulting in gain, each<br />\nmouth College.<br />\nforward pass intercepted, each fumble<br />\nInterest in warfare has been so<br />\nrecovered, and each kick that rolled<br />\nmanifest that certain members of<br />\noutside within the ten yard line.<br />\nthe Dartmouth faculty—not the colThe team would also lose a point<br />\nlege itself, have organized a course<br />\nfor<br />\nfumbling and not recovering or<br />\nof<br />\nvarious<br />\nphases<br />\nthat deals with the<br />\nconflict.<br />\nfor each fifteen yard penalty inflicted<br />\nProf. Bruce W. Knight, sponsor of upon it.<br />\nthe new course, has announced that<br />\nMadison, Wisconsin - - Another atthe series of eighteen evening meettack of severe investigation - itis<br />\nings is open, with fee, to anyone who<br />\nwishes to enroll. Many of the sixteen struck the University of Wisconsin<br />\n<br />\nAround<br />\nWashington<br />\nWashington, D.C.—When Congress<br />\nassembled this week for its first ses-<br />\n<br />\nwork into three short<br />\nsion, there arose to take his oath of<br />\nweeks the students out in Wisconsin<br />\noffice a new member who Jooked<br />\nwere on strike because they don't like<br />\nyoung enough to be a college senior<br />\nhaving the governor of the state<br />\nrather<br />\nthan a Representative in the<br />\n3,<br />\nDecember<br />\nmatter<br />\nEntered as second class<br />\nmake decisions about the personnel<br />\n1999, at the Postothce in Baltimore, Md., under<br />\nNational<br />\nCongress. As a matter of<br />\n1879.<br />\ntbe Act of Congiess, November 3,<br />\nand policy of their school.The students<br />\nonly slightly older than<br />\nfact,<br />\nhe<br />\nis<br />\nJune,<br />\nhave decided that they want Glenn<br />\nPublished semi-weekly from October to<br />\neacept during ex.anunatiun and college holiday<br />\nwhat<br />\nis<br />\nmuch<br />\nand,<br />\nas<br />\npresident,<br />\nFrank<br />\ncollege<br />\nmany<br />\nseniors and, perhaps,<br />\nperiods by undergraduates of the Johns Hopkins<br />\nLJaiversity.<br />\nmore important, they haven't merely<br />\nnot as old as many students who comEDITORIAL STAFF<br />\nmade a decision, they have done someplete their undergraduate work and<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nspeakers who have agreed to lecture again early this month, and this time<br />\nthing about it.<br />\nAssociate Editor<br />\n..<br />\nStanley<br />\ngo on -to professional schools to preJames Morrow, David Caplan Managing Editors<br />\nDr. Board of Regents removed Pres.<br />\nStudent strikes, despite the annoy- saw service in the World War.<br />\nSpOrti Editor<br />\nBernard D. Pinch.<br />\nBenjamin Rout, Wethered Barroll, Jr.<br />\n\"No college, so far as I know,\" said Glenn Frank to cure another attack pare themselves for the practice of<br />\nThe rules ( ?) if not circumvented, ance they cause to peace-loving folk,<br />\nAssistant Managing Editors<br />\nmedicine or law.<br />\nAssistant Sports Editor if given rigid supervision by a dis- are a very healthy symptom. They Prof. Knight, \"offers a general course of the<br />\nHarold Zheutlin<br />\ndisease that twice last year<br />\nColumnist<br />\n.<br />\nPaul Berge<br />\nThe \"Baby - Congressman\" is 27Reporters--Max Iskowitz, Nathaniel Finkelstein, passionate S.A.C., if followed in an demonstrate a certain vitality which on war. This apparently strange gap forced other members of its staff to be<br />\nJewett Goldsmith, Howard Reizenstein, Jul- honorable spirit, ought to insure fair we at the University might do well to in the curriculum may be due to sharp<br />\nyear-old Lyle H. Boren of Oklahoma<br />\nian Adler, Carl Rastn, Leonard Ruhinger,<br />\ndisplaced.<br />\nMorris Wessel, Arthur Katz, Martin elections. However until a real test emulate occasionally. It is good to departmental cleavages of the social<br />\nwho defeated the incumbent \"Cowboy<br />\nKrieger, Lester Rosenthal, Murray Kempton.<br />\nAfter a two-day operation that ascourse<br />\nthe<br />\nproblem<br />\nis<br />\na<br />\nsciences.<br />\nOf<br />\nwait<br />\nanxlaws,<br />\nwe<br />\nis<br />\ntheir<br />\nmade<br />\nof<br />\nadministratake a real interest in the<br />\nVictor Victoroff, Charles Diggs, William<br />\nCongressman\" Gassaway and a field<br />\nBurford, Jack Handelsman.<br />\nbroad one. A teacher in a given de- sumed the proportions of a great speciously and not a little unconfidently. tion of your school.<br />\nBUSINESS STAFF<br />\nof eight other candidates to win his<br />\nBusiness Manager<br />\nWilliam B. Kempton.<br />\nto elect SFA repre- partment knows something of war tacle, the board that was accused of<br />\nIt<br />\nis<br />\nnot<br />\nenough<br />\nMelville Locker .. Assistant Business Manager<br />\nmainly<br />\nimmediate<br />\nto<br />\nhis<br />\nbut<br />\nthe<br />\npart<br />\nseat<br />\nin the House.<br />\nAdvertising Manager<br />\nsentatives to elect committees to<br />\nWm. C. Erlanger<br />\ntaking orders from Gov. Philip F.<br />\nCirculation Manager<br />\nown field.<br />\nGerald Willen<br />\nWe<br />\nhear a lot about the need for<br />\nIt<br />\nis<br />\nnot<br />\ndance<br />\nchairmen.<br />\nchoose<br />\nOffice Manager<br />\nHoward Linkoff<br />\nLaFollette voted, as newspapers preAs most of you know, no mid-year enough to participate enthusiastically<br />\nCopy and Filing Manager<br />\n\"This is a study of war, not a chance<br />\nNathaniel Soifer<br />\nyoung people in politics; and here is<br />\ngrades will be posted; all marks will in pep assemblies. It is valid for stu- for confirmed pacifists to blow off dicted last July, 8-to-7 to remove Dr.<br />\none. Boren finished his studies at<br />\nMember<br />\n1436<br />\nl937<br />\nbe discovered at once from each stu- dents also to directly challenge their steam. We have taken the precautions Frank. The eight members who voted<br />\nOklahoma A. and M. in 1932 and now,<br />\ndent's adviser on Wednesday, Februto keep thrill - hunters out of the to remove the president are all Proeducational faculties.<br />\nary 3.<br />\ncourse. Nevertheless, we have found gressives and LaFollette appointees. less than four years later, he's in ConDistributors el<br />\nWe should like to add, lest there<br />\ngress. He was doing graduate work<br />\nenough students willing to do the<br />\nThis innovation has obvious merits,<br />\nbe some mistake as to our point of<br />\nKited to the prominence of a nawork without college -credit and<br />\nand we are surprised that it was not<br />\nat the A. and M. school after being<br />\nview, that we hold no particular brief<br />\nenough teachers ready to present it in tional spectacle, the chief concern of graduated from East Central Teachinstituted long ago. To begin with, no<br />\nHe<br />\nmay<br />\nhave<br />\nfor<br />\nGlenn<br />\nFrank.<br />\nbeen<br />\n.....UNTIED POR NATIONAL ADVERTISING ST<br />\naddition to their regular work.<br />\nlonger will students be running from<br />\nthe press and the nation's educators<br />\ners' College at Ada, Oklahoma in 1929.<br />\nAdvertising Service, Inc. one bulletin board to another, and genuinely unprogressive in the non- \"The whole thing is roughly divided<br />\nwas that the action of the board and<br />\npartisan sense of the word, or he may<br />\nCollege Publishers Representative<br />\nThe young Congressman taught<br />\nusually returning several times beNEW YORK. N.Y.<br />\n420 MADISON Avg.<br />\nhave been the victim of a political into three parts: first, the nature of the procedure preceeding that action<br />\n. r.40STON . SAN FRANCISCO<br />\nschool<br />\nfor a while after finishing colfore the grade is finally obtained. No<br />\nP<br />\nLos ANGEL.*<br />\nmachine. It may be that, as the war along its various fronts—politi- were not such as to preserve freedom<br />\nmore should faculty members be disworked<br />\nfor the government,<br />\nlege,<br />\nelected representative of the people, cal, propaganda, military, economic of thought from the power of governFriday, January 22, 1937<br />\nturbed and pestered. (We say should<br />\nso<br />\non;<br />\nsecond,<br />\nof<br />\nwar<br />\nand<br />\nthe<br />\ncosts<br />\n\"Who<br />\nIs<br />\nWho In Oklahoma\"<br />\nwrote<br />\nment and to give Pres. Frank a hearGovernor LaFollette is justified in<br />\nbecause we fear that to some degree<br />\nousting as the head of a university, ----economic, cultural, eugenic; third, ing by his peers.<br />\nand devoted himself to other literary<br />\nthis will be continued anyhow). No<br />\nfor which the people pay taxes, a man the means of preserving peace as reFormal charges were made against work.<br />\nmore will sensitive \"F\" students be<br />\nwhose political philosophy does not lated to the leading causes of war.\" Dr. Frank by the regent president,<br />\nCollege students who eye the future<br />\nPhiladelphia, Pa. (ACP) — When<br />\nIt is a slow but gradual process that subjected to the ridicule of their fel- coincide with that of the majority of<br />\nbut the former's answers were as well<br />\nsuccess may<br />\ndiscussion of reproduction and the sex low students; no more will conceited the people in his state. As to the pros sports writers had finished their all- documented as the latter's charges, with hopes of 'political<br />\n\"H\" students be given the inflating<br />\npicking,<br />\nthe<br />\nUniversity<br />\nstar<br />\nof<br />\nPennBoren's career with interest.<br />\nand cons of the case we are not comproblem in general is being transbetter many observers declared. No watch<br />\npraise of their comrades.<br />\nsylvania faculty took advantage of<br />\nIt<br />\nmay<br />\nbe worthwhile to compare the<br />\njudge<br />\nat<br />\nthis<br />\ndistance.<br />\npetent<br />\nto<br />\nopinion<br />\nof<br />\nthe<br />\nmatter<br />\nwhat<br />\none's<br />\nan<br />\nto<br />\nwhispering<br />\nformed from secret<br />\nthe lull and did a little choosing on its<br />\nYes, the method is a decided imwas,<br />\nanswers<br />\none's<br />\nvercharges<br />\nand<br />\nof the baby House member<br />\ntactics<br />\ntoo,<br />\nBut<br />\npoint<br />\nis<br />\nthat<br />\nstudents,<br />\nthe<br />\nimportant<br />\nenlightened approach to an<br />\nown account--but not in the sports<br />\nprovement over the old scheme. Studict on the regents' verdict against with that of the baby Senator, Rush<br />\nshould have something to say in the<br />\nmenfield.<br />\nquestion. Taboos built about any<br />\ndents should lend their needed coopDr. Frank was usually dictated by<br />\nmatter. Granted that we are young<br />\nGiven the opportunity of voting for politics, prejudices, educational theory Holt of West Virginia.<br />\ntion of this subject are slowly dis- eration to this plan.<br />\nand immature it is nevertheless we<br />\nHolt was elected to the Senate two<br />\na mythical all-star faculty of ten or just plain personalities.<br />\nintegrating. In social centers discuswho are attending the universities and<br />\nmembers<br />\nfrom<br />\nall<br />\nthe<br />\nhistory<br />\nof<br />\nthe<br />\nyears<br />\nago when he was 29 and had to<br />\nnot the governors, boards of trustees,<br />\nThe verdict of most Madisonians<br />\nsion groups treating this topic are<br />\nworld and from any field of knowledge<br />\nmonths before he could<br />\nwait<br />\nseveral<br />\nal.<br />\nboards<br />\nor<br />\nregents,<br />\net<br />\nrailroaded<br />\nwas<br />\nthat<br />\nDr.<br />\nFrank<br />\nwas<br />\nrapidly growing up. Venereal disease<br />\nDisregarding the counsel of the<br />\nand work, faculty men and women of<br />\noffice. Soon thereafter<br />\nhis<br />\noath<br />\nof<br />\nmajortake<br />\nout<br />\njob<br />\nby<br />\na<br />\nProgressive<br />\nof<br />\nhis<br />\nNews<br />\n—Pitt<br />\nsuperstitions are being propagandized sages who claim that advice a propos<br />\nthe University Pennsylvania selected<br />\nity that would have voted as it did he went on the warpath against his<br />\nexams is useless—freshmen being too<br />\nDr. Albert Einstein, Socrates, Plato,<br />\naway.<br />\nno matter what was said during the colleague from West Virginia, SenaAristotle, Da Vinci, Shakespeare, GalThis educational process is the dumb to listen to it and other classcourse of the \"trial.\"<br />\ntor Neely, as well as various other<br />\nmen being too smart—we will give a<br />\n\"Hereafter no part of any appropri- ileo, Newton, Darwin and Pasteur.<br />\nsanest and surest way to bring the<br />\nFollowing<br />\nthe<br />\nBascom<br />\nHall<br />\nspecincluding Relief Administraofficials<br />\nDr.<br />\nliving<br />\nman<br />\nEinstein is the only<br />\nfew choice morsels, mostly for the ation for the public schools shall be<br />\ntacle and the student strike that con- tor Harry Hopkins and President<br />\ndiscussion of reproduction in its de- freshmen.<br />\nincluded.<br />\navailable for the payment of any percluded it, a movement was started to Roosevelt. Last fall he campaigned<br />\nserved open and respected position.<br />\nNew York, N.Y. (ACP)—In -order<br />\nFirst, examination period is an over- son teaching or advocating Communhave the manner of selecting univer- against the nominees of his party<br />\npressmany<br />\nof<br />\nending<br />\nthe<br />\nto deal more effectively with legal,<br />\nIt will mean<br />\nrated terror. Fear and worry are ism.\"<br />\nsity regents by gubernatorial appoint- although he was elected as a Demoing problems--both to individuals and worse than ignorance. The instructor<br />\nThis little gem of legislation could ethical, social and economic prob- ment changed to some less political crat. His tactics caused the Adminthe<br />\nmarking<br />\nless<br />\nthan<br />\nenjoys<br />\nyou<br />\ndo<br />\nwell be the product of a Hitler, a lems that confront law school stu- method. Observers close to the scene istration to strip him of his patronsociety.<br />\nthe answering. So, do not be fright- Mussolini, or any other fascist dicta- dents, the American Law Students<br />\nto<br />\nHopkins<br />\npredict that this will be a \"must age and the Senators, in resentment<br />\nWe are fortunate at the<br />\nened by this bugagoo. Take matters tor or fascistic legislature. But as a Association has been formed by stumeasure on the docket of the state against his conduct, walk out of the<br />\nbe given an opportunity to participate calmly, and think hard.<br />\nmatter of fact it is the notorious Blan- dents from six eastern law schools.<br />\nlegislature this month.<br />\nchamber When he rises to address<br />\nin an informal discussion course in<br />\nInstitutions represented are ColumDo not stay up all night or even ton rider inserted by that since-deAnother legislative possibility is them.<br />\nhuman reproduction, conducted by a to a very late hour. A clear head is feated Congressman in the 1935 Dis- bia University, New York University,<br />\nSenator Neely, reelected despite the<br />\nthat Wisconsin solons will investigate<br />\nformer student at the Hopkins who is one of the prime requisites for ex- trict of Columbia appropriations bill St. John's University and Brooklyn the \"trial\" given to Dr. Frank by the opposition of the baby Senator, broke<br />\nLaw School in New York City, and<br />\nnow a recognized authority and aminations. Dress as comfortably as to prevent the discussion of Communregents, for many of them feel that a long standing tradition when he<br />\nHarvard and Yale.<br />\nwish,<br />\nand<br />\nuse<br />\nyou<br />\nup<br />\nall<br />\nthe<br />\nblue<br />\npublic<br />\nschools<br />\nWashington<br />\nthe<br />\nism<br />\nin<br />\nthere is something \"fishy\" in the walked up to take the oath of office<br />\nscholar in this field. Dr. Alan F.<br />\nbooks you want. Analyze your inChief topic of interest for its mem- whole affair.<br />\nThe interesting effects of the rider,<br />\nwith Senator Robinson instead of the<br />\nGuttmacher, associate in Obstetrics structor as well as your course, and<br />\ncolleague from his own state. Afteraside from the storm of liberal protest bers is the economic difficulties that<br />\nMadisonians<br />\ntopic<br />\nof<br />\nfor<br />\nmany<br />\nChief<br />\nat the Medical School, possesses the write accordingly.<br />\n•aroused when the spotlight was will be barriers for them as law clerks weeks now, the \"Frank affair\" has ward Senator Neely was quoted as<br />\nrare combination of effective, enlivenLooking over past examinations is turned on it after its unnoticed pas- and young lawyers. However, no def- now boiled down to a lot of head shak- saying that he would not allow the<br />\nof<br />\nwealth<br />\nwith<br />\na<br />\nability<br />\na<br />\npositive<br />\nhelp. So are group discus- sage, are summed up in the following inite stand was taken on minimum ing and a guessing game over the youthful Holt to accompany him \"to<br />\nspeaking<br />\ning<br />\nknowledge in his field. He is the sions in certain subjects. Do not try quotation, taken from an article by wages for law clerks.<br />\nsuccessor to the first of the nation's a dog fight.\"<br />\nThe group has voted in favor of \"boy presidents.\"<br />\nHolt's antics, however idealistically<br />\nauthor of Life in the Making, a popu- to make up a whole term's work in a Ellen Thomas in the December issue<br />\ntaking \"adequate steps, in conjunctinspired, tend to discredit young peolar, authoritative, and interesting night; rather get the important ele- of Progressive Education.<br />\n\"Blue-Monday\" at Louisiana Tech<br />\nments and concentrate. Do not worry<br />\nbook on reproduction.<br />\n\"During the past year and a half, tion with bar associations, law school is more than half blue—from the ple who aspire to high office, but perhaps Boren's conduct will be such as<br />\nHome has ceased to be (if it has too much about devising systems of Russia, as seen from district school- faculties, and other legal groups, to laundryman's point of view.<br />\nto regain for young people the presever been) a means of creating a studying; each person usually has rooms, has been a blank space on the improve the economic well-being of<br />\nOf the 1,100-odd men's shirts col- tige in politics that Senator Holt has<br />\nwholesome and scientific attitude to- his own. If you want any models, map. Instruction in Russian geogra- law students, law clerks, and young<br />\neach Monday morning by the lost.<br />\nlected<br />\nwards this problem. We must look to ask the brighter students.<br />\nphy, history, government, art, music, attorneys.\"<br />\nschool's<br />\nlaundry trucks, more than<br />\nNumerous young men have brought<br />\nMembership<br />\nin<br />\nthe<br />\nassociation<br />\nis<br />\nIf possible go to a movie or any and literature has been omitted from<br />\nthe school to replace it. Various<br />\n575 are that color, ranging in shades credit to themselves and their electlimited<br />\nto<br />\nschools<br />\nin<br />\nthe<br />\nnortheastern<br />\nnotions and restrictions prevent intel- occasional recreation; it is a definite Washington's education programs.<br />\nfrom mild baby-blue to the mighty orate despite their youth. Senator<br />\nligent discussions in the high schools; mental refreshment. Get plenty of Yet during this same year and a half, area but eventually it will be extended tones of midnight-blue.<br />\nRichard B. Russell, Jr., of Georgia is<br />\nschools<br />\nin<br />\nall<br />\nparts<br />\nof<br />\nto<br />\nthe<br />\nU.S.<br />\nso it is left to the colleges to fill such restful sleep. Study in an orderly the students so protected have develUniversity of Chicago fraternity an example of this. Still in his thirties,<br />\nNew<br />\nYork,<br />\nN.Y.<br />\n(ACP)—Plans<br />\nto<br />\na role. In most cases they fail to do fashion.<br />\noped an interest in Communism never<br />\nmake drastic changes in the curricula men are going gigolo to furnish ma- he has served as speaker of his state<br />\nSO.<br />\nWhether you listen to any of this before equalled.\"<br />\nof freshmen and sophomore students terial for the newly established Es- house of representatives, governor of<br />\nUnder the auspices of the American advice or not, the best of luck to you!<br />\nIf ex-Representative Blanton read<br />\nat Columbia College have been placed cort Bureau. To quality as \"dowager- Georgia, and has just entered upon his<br />\nStudent Union, such a discussion<br />\nthe article he must have turned over<br />\nfifth year in the Senate, having been<br />\nbefore the entire faculty by the sub- thrillers\" bureau men must:<br />\ncourse will be offered. This question<br />\nin his political grave. It tells how stucommittee on curriculum, which has<br />\nBe physically presentable; have per- overwhelmingly reelected to a full<br />\nis one that affects every college students have read avidly chapters on<br />\nworked on the course-reshaping pro- sonality and an easy manner; be a term after serving four years of an<br />\nA cord of commendation is due the Russia skipped in class assignments,<br />\ndent; it is a problem that needs inject for the past year and one-half.<br />\ngentleman of the Lord Chesterfield unexpired term.<br />\nwho<br />\noverwhelmed<br />\nthe how they have attended lectures on<br />\ntelligent thinking and enlightened tankmen<br />\nCollege men and women who aspire<br />\nThe sub-committee proposes that a type; possess knowledge in at least<br />\ndiscussion to fully understand and Swarthmorth swimming team in a Communism and Communistic meetcourse in humanities, embracing the one social activity — opera, bridge, to public office may find a number of<br />\ntriumphant upset and later whipped ings, have they have devoured Commeet.<br />\nstudy of literature, philosophy, music conversation or ordering from a inspirations in the present Congress.<br />\nEveryone ought to take advantage the Lafayette squad. Shadowed by munist literature obtained by fellow and the fine arts supplant the now- menu; be a good dancer and be well<br />\nof the informal Thursday meetings, the prominence granted basketball in classmates interested in the subject required English A course.<br />\nknown on the campus.<br />\nduring an exam makes a test sweeter<br />\nthe winter sports program, the swim- by the Congressional taboo, how they<br />\nstarting February 11.<br />\nDuring the freshman year, students,<br />\nThe coeds hire more tall brunettes to take.<br />\nmers have had to blaze their path have beaten paths to the Library of<br />\nunder this proposal, would meet four than any of the other types.<br />\nDuring one of the past three-hour<br />\npractically unheralded.<br />\nCongress to read the books pro- hours weekly for lectures in literature<br />\nexams, some of the students comUpon<br />\nbeing<br />\nselected<br />\nto<br />\nconform<br />\nHandicapped by the lack of a cam- nounced dangerous by Mr. Blanton.<br />\nand philosophy and would be required<br />\nwith the woman's specifications, the plained that they were too tired to<br />\nThe Hopkins Musical Club con- pus pool and a meagre appropriation,<br />\nAs democratic Americans vitally to do reading in conjunction.<br />\nwrite at the close of the<br />\nyoung man meets her at a designated think and<br />\ncluded a busy week-end by being sin- the men who comprise the swimming interested in the preservation of acaDuring the sophomore year, stutest.<br />\ngular'sy honored in the musical world team have, by persistence and deter- demic freedom we can hardly be proud dents would be required to enroll in spot and is free to use his own name<br />\n\"I guess I'll serve tea next time,\"<br />\nwith a concert in the Maryland Cas- mination, rounded themselves into a of the Blanton rider. No study of the concurrent and unified studies of the or a fictitious one. Thereafter he is replied Prof. Weeks.<br />\nthe<br />\nthe<br />\nresponsible<br />\nfor<br />\nsuccess<br />\nof<br />\nualty series last Sunday afteroon. formidable group of natators. Their social sciences can be complete with- fine arts and music, one hour a week<br />\nAt the last exam, he and his two<br />\nevening.<br />\nSome renowned organizations have efforts are rewarded only by the satis- out a discussion .4?f the pros and cons for each subject.<br />\nassistants passed out steaming cups<br />\nThe only thing for which Earl Waspresented programs, and a high stand- faction they feel in doing a job well. 'of every major school of thought<br />\nWashington, D.C. (ACP)—Assertof tea and dozens of filled cookies.<br />\nUniard of musical quality has always<br />\nThe student body has been slow And teaching 'becomes propaga.ndiz: ing that the present football scoring serman, young instructor at the<br />\nA University of Wisconsin prankbeen adhered to. Judging from the in appreciating the value of such an ing when teachers and students are system does not always allow the best versity of Baltimore, hasn't time is a ster took it upon himself to remedy<br />\napplause and comments of the audi- activity, and miserly in contributing forbidden to discuss or study oppos- team to win, Col. E. A. Hickman, F.D.,<br />\nthe situation after ex-President Glenn<br />\nIn addition to teaching English Frank had been removed from office<br />\nence, the Hopkins group can well be to support. Few Jay rooters offer ing views on controversial subjects. United States Army, on duty as finproud of themselves.<br />\nencouragement at meets; many are William Randolph Hearst to the con- ance officer of the 3rd Corps Area, has classes at three different colleges in by an eight to seven vote of the reBaltimore, Wasserman is working for gents.<br />\nTwo other concerts were given last often unaware of these contests. trary, we believe strongly that educa- offer a new scoring method.<br />\nHe suggested that the value of the his Ph.D. at the Johns Hopkins Uniweek to spread our musical fame into Swimming teams at Hopkins have not tion in the social sciences in VV1Eu3hHe thumb-tacked a \"Man-Wanted\"<br />\nCatonsville and Annapolis, continuing always been winning teams, but they ington public schools will be unworthy touchdown and the field goal be re- versity and is making a study of the sign on the ex-president's office door.<br />\nElliott Roosevelt, the President's<br />\nan active career of the largest cam- have always been spirited, fighting of the name until the half-buried Blan- duced from six points to five and from 'Elizabethan Revival.\"<br />\nStudents of organic chemistry at son, has been appointed as a member<br />\npus activity. Many students partici- combinations, giving their best efforts. ton rider is removed from the statute three points to two respectively.<br />\nThe tankrnen merit the enthusiastic books.<br />\nCol. Hickman declared that a team Colby College who study under Prof. of the board of directors of Texas A.<br />\npate in varied departments of the<br />\n—Swarthmore Phoenix<br />\ncould earn one point for each first Lester F. Weeks have found that tea and M. College.<br />\nClub and have willingly given time support of the entire student body.<br />\n--- --$2.50<br />\n<br />\nRemit subi.cription fees to Treasurer, Student<br />\n.ketivities Council, Remsen flail, Postailice, Johns<br />\nHopkins University.<br />\n<br />\nWe think the election by-laws, recently issued by the S.A.C., on the<br />\nwhole to be apparently round principles that will go a long way to eliminating some of the past election<br />\nevils. They should prove workable,<br />\nalthough in practice we fear that a<br />\nmajor portion of unfair activity in elections will not be altered. Of course, to<br />\na great extent, this depends on the<br />\nimpartiality, courage, and strength of<br />\nthe S.A.C.<br />\n<br />\nsemester's<br />\n<br />\nA Step Forward<br />\n<br />\nAssociated Colleektie Press<br />\n<br />\nJay<br />\nLe<br />\nTo<br />\n<br />\nBlue (<br />\nIn<br />\n<br />\nJAY<br />\n<br />\nSavag<br />\n<br />\nsta<br />\n<br />\nThe .<br />\n<br />\nIisiquish<br />\n<br />\nConegia<br />\n<br />\nTuesda2<br />\n<br />\nthey si<br />\n<br />\nfast bis<br />\n<br />\nMary's.<br />\nglue te<br />\n<br />\nThus fi<br />\n<br />\ndroppec<br />\ntwo tr<br />\n<br />\nWashin<br />\n<br />\nColleolate Died<br />\n<br />\nNational<br />\n<br />\nNeeded Information<br />\n<br />\nVoice of Experience<br />\n<br />\nLittle Red Riding Hood<br />\n<br />\nAnother Winner<br />\n<br />\nWe Point With Pride<br />\n<br />\nThe<br />\n<br />\ndefinite<br />\n<br />\nfairly I<br />\nby onl<br />\n<br />\nthat hi<br />\nWere ai<br />\nball, a<br />\naffair,<br />\nPoints<br />\n<br />\nthe se<br />\n<br />\nscorinf<br />\n<br />\nThe<br />\nary fe(<br />\n<br />\nization<br />\nfield<br />\nhome<br />\nPoints<br />\n<br />\nSplit<br />\n<br />\ni<br />\n<br />\nutes o<br />\n<br />\nkpich<br />\nvisitor<br />\nthem<br />\n<br />\nin oni<br />\ntime<br />\n<br />\nwas n<br />\n<br />\nOf pla<br />\n<br />\nkins N<br />\nally ti<br />\n<br />\nAm<br />\ncomir<br />\nhis te<br />\ngame<br />\nBig I<br />\nPoint,<br />\nstarti<br />\ngYrnr<br />\ncendc<br />\njunic<br />\nNorn<br />\n<br />\nit a<br />\nSt;<br />\ncot<br />\ndel<br />\nBE<br />\nliop]<br />\nCrea<br />\nfern<br />\narr10<br />\n<br />\ntrnii<br />\nbeer<br />\nlege,<br />\nform<br />\nacts<br />\ntii<br />\nleg<br />\nforr<br />\n81gr<br />\n<br />\nthe<br />\nPet<br />\nmsh<br />\nson<br />\n<br />\nOr(<br />\n<br />\n\fI<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br />\n<br />\nJays Relinquish<br />\nLeague Lead<br />\nTo Mount Five<br />\n<br />\nTEAMS<br />\nMt. St. Mary's<br />\nJohns Hopkins<br />\nW. Maryland<br />\nWashington<br />\nLoyola<br />\nSt. John's<br />\n<br />\nW.<br />\n3<br />\n2<br />\n1<br />\n1<br />\n0<br />\n0<br />\n<br />\nL.<br />\n0<br />\n1<br />\n1<br />\n2<br />\n1<br />\n2<br />\n<br />\nP.C.<br />\n1.000<br />\n.667<br />\n.500<br />\n.353<br />\n.000<br />\n.000<br />\n<br />\nJays Launch Season With Remarkable Performance; Team<br />\nLooms As Contender For Eastern Collegiate Plaque;<br />\nWeiner, Radner, Adler Brilliant<br />\n<br />\nNew Intramural<br />\nPlan For Frosh<br />\nIn Progress<br />\n<br />\nSchool Boxing Tourney<br />\nSlated To Start Feb. 25<br />\nBeginning February 25 or 26<br />\nthere will be held the second intramural boxing tournament. After<br />\nexams, Ed Lotz will offer boxing<br />\ninstruction every Friday to those<br />\nwho wish t4o be active in the tourney.<br />\nrules<br />\nRegular intercollegiate<br />\nwill be in effect for the bouts.<br />\nThree two-minute rounds are<br />\nfought and the judges must give<br />\na decision.<br />\nEight weight classes will be represented; 115, 125, 135, 145, 155,<br />\n165, 175, and Heavyweight.<br />\nLast year's champions were:<br />\n125 H. Glasser<br />\n135 J. Hoffman<br />\n145 J. Stevens<br />\nHeavyweight J. Pinsky<br />\n<br />\nThe intramural sports department<br />\nAvenging a stunning defeat suf- Chambliss gained first and third rehas announced a new policy of organifered last year, the Johns Hopkins spectively in the breast stroke; Lou<br />\nzation. According to Reuben Baer,<br />\nAdler nosed out the Swarthmorites in<br />\ntank team with a surprising show of<br />\nunder the new system the freshmen<br />\nthe 100.<br />\npower swamped Swarthmore under an<br />\nclass<br />\nhas been divided up intb four<br />\nBy this time Coach Hambleton's<br />\navalanche of first places, winning by<br />\ngroups of twenty five each. Each of<br />\nmeet on ice, but to put<br />\nmen<br />\nhad<br />\nthe<br />\nthe score of 51-23. It was the opening<br />\non the finishing touch, the Black and<br />\nthese groups is to compete in all<br />\ncollege meet of the season for the<br />\nBlue quartet, made up of Hill, Adler,<br />\nSavage And Apichella Outsports and is to remain a<br />\nintramural<br />\nby<br />\nperfortheir<br />\nJays, who showed<br />\nAbrahams, and Radner swamped<br />\nthe<br />\nsquad<br />\nthat<br />\nlast<br />\nSaturdey<br />\nmance<br />\nTriumph;<br />\nunit<br />\nthe four years of school.<br />\nduring<br />\nIn<br />\nstanding<br />\ntheir opponents in the 440 yard relay,<br />\nis undoubtedly the strongest to reprebeen selected for each<br />\nA<br />\nhas<br />\nleader<br />\nSiegel Shines<br />\nlast event on the program.<br />\nSwordsmen Nose Out Strong sent the University in recent years. theThe<br />\ngroup and this leader will be responsishowing of the Hopkins swimAs the Garnet, with exactly the<br />\nState Rivals At<br />\nThe Johns Hopkins hoopsters remers on the whole seems to indicate<br />\nble for the appearance of his team at<br />\nsame team, trounced Hopkins in a<br />\nanother win tomorrow night, when<br />\nlinquished their hold on the Maryland<br />\nRitchie Gym<br />\nany<br />\nscheduled event. In this way the<br />\nnot<br />\nit<br />\nin<br />\nwas<br />\n1936,<br />\nmanner<br />\nsimilar<br />\nthey swim against George WashingCollegiate Basketball League lead last<br />\nresponsibility is fixed and there will<br />\nsurprising that they left the City Colton in the latter's pool. The Jays have<br />\nTuesday night at Homewood when Sherman Leads Team With lege pool in somewhat of a daze.<br />\nbe no haphazard guessing as to<br />\nnever been defeated by their foes from<br />\nSince Swarthmore defeated Delaware,<br />\nwhether or not teams will appear to<br />\nthey succumbed to a fast-moving,<br />\nCapitol.<br />\nthe<br />\nFive Wins In Seven<br />\na perennially powerful aggregation,<br />\ncompete.<br />\nfast breaking quintet from Mount St.<br />\nThe results:<br />\nMatches<br />\nthe Black and Blue victory marks<br />\nEach group will have its own uniMary's. The final score, putting the<br />\n240-Yard Medley Relay-Won by<br />\nthem as a likely contender for the<br />\nand instead of having the men<br />\nforms,<br />\nand<br />\nHill),<br />\nBlucher,<br />\n(Weiner,<br />\nHopkins,<br />\n39-21.<br />\nwas<br />\nplace,<br />\nsecond<br />\nin<br />\nalue team<br />\nThe Blue Jay swordsmen opened plaque offered to the best team in the<br />\nthe uniforms, a dance is befor<br />\npay<br />\n45 3-5s.<br />\nThus far the Mallonee machine has the current season by eking out a Eastern Intercollegiate Association. Time, 2m,<br />\ning planned, the proceeds of which go<br />\n40-Yard Free Style-Won by Raddropped one title contest, as against 9 to 8 victory over its state rival, The Jays for many years have been<br />\nner, Hopkins; second, J. Adler, Hop- Jay Matmen Pin Opponents toward the purchase of the desired<br />\ntwo triumphs over St. John's and University of Maryland, at the Rit- a member of the organization, along kins; third, Thomas, Swarthmore,<br />\nequipment. Organization meetings<br />\nIn Five Of Eight<br />\nchie Gymnasium, last Thursday even- with such schools as Rutgers, Pittshave already been held, and the groups<br />\nWashington College respectively.<br />\nTime, 20 2-5s.<br />\nburgh, N. Y. U., Lafayette, C. C. N. Y.<br />\ning.<br />\nare now fairly compact and will be<br />\nMatches<br />\nAbraby<br />\n-Won<br />\nFree<br />\nStyle<br />\n220-Yard<br />\nMounts Lead At Half<br />\nSherman, a mainstay from last and Lehigh.<br />\nready to take part in the spring prosecond J. Adler, HopHopkins;<br />\nhams,<br />\nThe play during the first period was season's championship team, was the<br />\nTuesday night the Hopkins matmen gram.<br />\nRelay Team Wins<br />\nkins; third, Carroll, Swathmore. Time,<br />\ndefinite, exact, and the scoring was outstanding star in the Hopkins victravelled to College Park, where they<br />\nThe Hopkins began auspicously 2m, 44 1-5s.<br />\nfairly even, with the Mounts leading tory. He defeated his opponent in when the medley relay team, composDive-Won by Clavenger, Swarth- were decided victors over the Univerof his seven matches. He ed of Capt. Dan Weiner, John Blucher<br />\nbY only 6 points at the conclusion of five out<br />\nmore, second, Strong, Swarthmore.<br />\nsity of Maryland by the score of 25-11.<br />\nwon twice in the foils event, once in and Alan Hill outswam theis oppothat half. The counters at that time<br />\nRad- The Blue Jays pinned five men in<br />\nby<br />\nStyle--Won<br />\nFree<br />\n440-Yard<br />\nthe epee division, and twice again nents in an exciting finish. This seemWere arranged 17-11. Playing masterly with the saber.<br />\nner, Hopkins, second, Carroll, Swarth- the eight matches.<br />\ned to surprise the Jays, who captured<br />\nmore; third, Abrahams, Hopkins,<br />\nthe<br />\nball, and completely dominating<br />\nVernon Wins<br />\nThe Black and Blue squad will again first and second in the next two<br />\n6m, 5 3-55.<br />\nTime,<br />\n22<br />\nIn the 115 lb. class, Bob Vernon,<br />\naffair, Mount St. Mary's tossed in<br />\nengage the Maryland team on Febru- events. Zoel Radner and Louis Adler<br />\n150-Yard Back Stroke-Won by<br />\nfinished well ahead of the SwathPoints to 10 by the Hopkins array in ary 17, at Homewood.<br />\nof the Hopkins, pinned F. Lewis in<br />\nWeiner hopkins; second, Brown,<br />\nyard<br />\n40<br />\nthe<br />\nin<br />\nrepresentatives<br />\nmore<br />\nThe results:<br />\nminutes, 18 seconds. Don Hoffman,<br />\n4<br />\nthe second period to complete the<br />\nHopkins,<br />\nsprint, while Morton Abrahams led Swarthmore; third, Macgill,<br />\nFOIL<br />\nscoring for the game.<br />\nof<br />\nMaryland, lost the 126 lb. match<br />\nTime, lm, 58 1-5s.<br />\nhome Buddy Adler in the 220.<br />\nSmall, Hopkins, defeated Schulby a fall in 1 minute,<br />\nLinthicum<br />\nto<br />\nWHAT'S EATING YOU,FROSH ?<br />\nSlow Contest<br />\nby<br />\n-Won<br />\n200-Yard Breaststroke<br />\nThe runaway of the Jays was<br />\n5 to 4.<br />\n46 seconds. Sam Rosenstein added<br />\nMawhinney,<br />\nThe fray started with the custom- bridge,<br />\nsecond,<br />\nHopkins;<br />\nBlucher,<br />\nabruptly halted here when the Garnet<br />\nscore<br />\nSherman, Hopkins, defeated Ellison,<br />\nChambliss, Hop- another match to the Hopkins<br />\nary feeling-out process by both organautomatically received first and sec- Swarthmore; third,<br />\nwhen he put R. Porter's shoulders to<br />\n5 to 2.<br />\n2-5s.<br />\n22<br />\n2m,<br />\nTime,<br />\nond in the dive, both of the Hopkins kins,<br />\nizations, wit,h Melvin putting away a<br />\nthe floor in the 135 lb. class.<br />\nAbrams, Maryland, defeated Star320-Yard Relay-Won by Hopkins,<br />\ndivers being absent.<br />\nfield goal to give first blood to the ling, 5 to 4.<br />\nDue to injuries received in the Hop(Hill, J. Adler, Abrahams and RadWeiner Wins<br />\nborne team. After a see-sawing of<br />\nBra.nda, Maryland, defeated Sherburg match last week,<br />\nkins-Gettys<br />\nner). Time, 3m. 13 1-15s.<br />\nto<br />\nback<br />\ncame<br />\nhowever,<br />\nRadner,<br />\n3.<br />\nto<br />\n9-9<br />\n5<br />\nman,<br />\na<br />\nthe regular 145 lb. class<br />\nKatz,<br />\nshowed<br />\nLink<br />\nbook<br />\nscorer's<br />\nthe<br />\nPoints<br />\n100-Yard Free Style--Won by J. Mentor, was unable to participate in<br />\nscore his second triumph in the 440<br />\nPeralto,<br />\ndefeated<br />\nHopkins,<br />\nReed,<br />\nminfive<br />\nabout<br />\nwith<br />\n8Plit in honors<br />\nsecond, Thomas,<br />\nYOU GOTTA LEARN HOW TO STUDY,Alsit<br />\nyard grind, and the stream of vic- Adler, Hopkins;<br />\nthe meet. After much difficulty a<br />\nlates of the second quarter remaining. 5 to 4.<br />\nStone, Swarththird,<br />\nSwarthmore;<br />\nGET YOUR PIPE,RELAX WITH<br />\nthe<br />\nwon<br />\nWeiner<br />\nagain.<br />\nbegan<br />\ntories<br />\nof<br />\nperson<br />\nthe<br />\nin<br />\nfound<br />\nwas<br />\nsubstitute<br />\nLandon, Maryland, defeated Small,<br />\nA LOAD OF EDGE WORTH JR.<br />\n3-5s.<br />\nAPichilla and Savage then led the<br />\n150 yard back stroke; Blucher and more, Time, 1<br />\nformer New England<br />\nO'Keefe,<br />\nArty<br />\nvisitors on a scoring spree that netted 5 to 3.<br />\nScholastic 135 lb. Wrestling Champ.<br />\nSherman, Hopkins, defeated Schulthem 8 points while the Jays swished<br />\nHe wrestled Edward in the 145 lb.<br />\n3.<br />\nto<br />\n5<br />\nIn only one field goal to give the half- bridge,<br />\nand lost by a 5 minute and 40<br />\nclass<br />\nEllison, Maryland, defeated Reed,<br />\nUtile set-up at 17-11. Mt. St. Mary's<br />\ntime advantage, only after an<br />\nsecond<br />\nwas never headed in the next section 5 to 3.<br />\nexcellent struggle.<br />\nEPEE<br />\nof play and scored confidently. HopEd Clautice won the 155 lb. class<br />\nSAY,THATS ONE<br />\nSherman, Hopkins, defeated Abrams<br />\nkins was only able to click sporadicby default and wrestled an exmatch<br />\nSMOOTH SMOKE!<br />\n2 to 1.<br />\nally to keep up the pace.<br />\nTome<br />\nFive Triumph Over Towson;<br />\nFrosh<br />\nGives<br />\nPace<br />\nEarly<br />\nhibition match with C. Watson, of<br />\nSherdefeated<br />\nMaryland,<br />\nSchwartz,<br />\nAmong other things: Herb Siegel<br />\nCollege Park. Charles Barnett, the<br />\nRallies In Last Half To Overcome Jay<br />\ncorning from a sick bed to try to help man, 2 to 1.<br />\nBlue Jay Captain, dropped the 165 lb.<br />\nDavis,<br />\ndefeated<br />\nMaryland,<br />\nSchwartz,<br />\nhis team-mates ... Turning in a sweet<br />\nLead And Win<br />\nmatch to Isriel Leiter on a time adgame for a 'sick' man, he led the 2 to 1.<br />\nof 4 minutes, 20 seconds. F.<br />\nYOU BET! THAT'S<br />\nvantage<br />\nRoth,<br />\nThaler,<br />\ndefeated<br />\nBumbel, Maryland,<br />\naig Blue squad with a total of nine<br />\nCoach Frank Dotterweich swung saw action were Brayshaw,<br />\nWHY ITS CALLED THE COLLEGE<br />\nLawson won the third match for the<br />\nFreyer,<br />\nLitowitz,<br />\nAlmquist,<br />\n1.<br />\nButt,<br />\nto<br />\n2<br />\nPoints . . . The spirit of the crowd,<br />\nMAN'S SMOKE !*<br />\nhis squad of freshmen ibasketeers into<br />\nTerrapins by throwing Tom Brown in<br />\nSABRE<br />\n*MILD DOWN 44<br />\n•<br />\nstarting its own cheers to swell the<br />\naction this past week against two of Thaynor, and McGovern.<br />\nheavyweight<br />\nThe<br />\nthe 175 lb. class.<br />\nTO THE HEEL<br />\nStarling, Maryland, defeated Peel, the leading local schoolboy quintets.<br />\nThe box scores:<br />\ng'ymnasium with ever-increasing cresmatch was won by Bill Lamble when<br />\nTOME<br />\ncendo . . • The 14-12 triumph of the 5 to 3.<br />\nAgainst Towson High School, the<br />\npinned Douglas McChemsey of the<br />\nhe<br />\nT.<br />\nFarleat,<br />\nF.<br />\nG.<br />\ndefeated<br />\nPeel, Hopkins,<br />\nJUnior Varsity over that of Towson<br />\nFrosh were triumphant; but against<br />\nUniversity of Maryland.<br />\n0<br />\n0<br />\n0<br />\n150<br />\n4.<br />\nAnderson,f<br />\nbattle.<br />\nto<br />\npitcher's<br />\n5<br />\nA<br />\nfound<br />\nNormal . . .<br />\nthe Tome outfit the Jay Frosh<br />\nA TIN<br />\n0 0<br />\n0<br />\nISherman, Hopkins, defeated Star- themselves at the lower end of a Reid, f<br />\nHOPKINS FRESHMEN<br />\n7<br />\n1<br />\n3<br />\nf<br />\nling, 5 to 3.<br />\nDehner,<br />\n21-16 score.<br />\nG. F. T.<br />\n2<br />\n0<br />\n1<br />\nSherman, Hopkins, defeated FarRobinson, f<br />\nEarly Lead<br />\n4<br />\n0-0<br />\n2<br />\nf<br />\nBrayshaw,<br />\n2<br />\n0<br />\n1<br />\nleat, 5 to 2.<br />\nAt Towson, an early scoring attack Murphy, c<br />\n2<br />\n1 0-0<br />\nf<br />\nWhitelock,<br />\n0<br />\n0<br />\n0<br />\ng<br />\nMiller,<br />\nschoolthe<br />\n0<br />\nproved the downfall of<br />\n2<br />\n0-0<br />\n1<br />\n9<br />\nf<br />\nMcGovern,<br />\n8<br />\n3<br />\nboys. The yearlings bombarded the McDivitt, g<br />\n8<br />\n4 0-0<br />\n0 2 Thaler, c<br />\n1<br />\ncords for 22 points &ding the first Kaighen, g<br />\n4<br />\n.. 2 0-0<br />\n- Almquist, g<br />\nvic28-26<br />\na<br />\nLadinto<br />\nStudent<br />\nGrad<br />\ncoasted<br />\nCollege,<br />\nstanza and<br />\n8<br />\n4 0-0<br />\n3 21 Litowitz, g<br />\n9<br />\nTotals<br />\ntory.<br />\nders To Help Select Official<br />\nHOPKINS FRESHMEN<br />\nRecovering from the early bomSo much has been said, of late, con14 0-0 28<br />\nTotals<br />\nG. F. T.<br />\nBlue Jay Team<br />\nstarted<br />\nlads<br />\nTowson<br />\nthe<br />\nbardment,<br />\ngainof<br />\ncerning The Hopkins' chances<br />\nHIGH<br />\nTOWSON<br />\n6<br />\n2<br />\n2<br />\nf<br />\nBrayshaw,<br />\nduring the leadership in the Maryland finding the loop with consistency<br />\nG. F. T.<br />\n1 0 2<br />\nBadminton, the newest sport on the<br />\nf<br />\nLeague, that very little ing the last two quarters. However, Thaler,<br />\nIntercollegiate<br />\n2<br />\n1 0-1<br />\nf<br />\nHeld,<br />\n2<br />\n0<br />\nRopkins campus, showed its ever-in1<br />\nf<br />\nButt,<br />\nhas been given to the efforts the Hopkins Frosh clung to its lead<br />\n6<br />\n3 0-1<br />\nJacobson, f<br />\ncreasing popularity this week in the attention<br />\n1<br />\n1<br />\n0<br />\nf<br />\nAlmquist,<br />\nadvances<br />\nenemy<br />\nall<br />\nVarsity quintet. While and frustrated<br />\n3<br />\n1 1-1<br />\nform of an elimination tournament of the Junior<br />\n2 Carr, c<br />\n0 2<br />\nLitowitz, g<br />\nhave rolled along with amazing defensive tactics.<br />\nteams<br />\nVarsity<br />\nthe<br />\n5<br />\n1 3-4<br />\ng<br />\nRebaugh,<br />\n0<br />\n0<br />\namong all those connected with the<br />\n0<br />\ng<br />\nFreyer,<br />\nup<br />\nrang<br />\nThaler and Litowitz each<br />\nlosing games in a none8<br />\n4 0-1<br />\nUniversity. Five ladders have already winning and<br />\n1 Canavan, g<br />\n1<br />\n0<br />\nCoach Ed four baskets to lead the offensive. Thaynor, c<br />\nfashion,<br />\nevastating<br />\ntoo-d<br />\n2<br />\n1 0-0<br />\ng<br />\nBranard,<br />\nbeen composed, with the various col2<br />\n0<br />\n1<br />\nc<br />\nMcGovern,<br />\nbeen compiling Almquist and Brayshaw both turned<br />\n-leges, and graduate student bodies Lotz's charges have<br />\nIN YOUR COLLEGE COLORS<br />\nin excellent general court perforrecord.<br />\n11 4-8 26<br />\nforming the different divisions. The a really noteworthy<br />\nTotals<br />\nWe make this amazing offer<br />\n16<br />\n6<br />\n5<br />\nTotals<br />\nmances. At other moments Whitelock<br />\nVarsity understudies have won ten<br />\nof a $1.00 English Type<br />\nactual eliminations will not start unbrilof<br />\ntraces<br />\nrevealed<br />\nand McGovern<br />\nFoisting Pouch in Rep Cloth<br />\ntil after the examination period, giv- games in a row, eight in the latter<br />\nliance.<br />\nwith Rubberized Liner for<br />\nthis<br />\nof<br />\nboth<br />\nand<br />\nyear,<br />\nlast<br />\nof<br />\nthis<br />\npart<br />\nnovel<br />\nin<br />\ninterested<br />\ning all those<br />\nTome Leads<br />\nonly 10¢ and one wrapper<br />\nform of exercise an opportunity to season's only engagements. Having<br />\nto persuade you to try EdgeMatching shot for shot, the Jay<br />\nSign up for a new ladder. Winners in routed the Junior Varsities of State<br />\nworth Jr. Send the inside<br />\ncourtTome<br />\nthe<br />\nwith<br />\npace<br />\nkept<br />\nFrosh<br />\nthe separate groupings will then com- Teachers College and St. John's, the<br />\nwhite paraffin wrapper and<br />\nwent<br />\nhalf<br />\nand<br />\nfirst<br />\nmen for the entire<br />\nPete for the championship of the wearers of the Blue(figuratively<br />\nyour dime together with<br />\nleading<br />\nintermission<br />\nthe<br />\nduring<br />\nout<br />\nthe youpon (or print your<br />\nschool. The runner-ups will join their speaking, for their uniforms are<br />\ncords<br />\n12-11. With McDivitt hitting the<br />\nname, college and address<br />\nconquerors and an official Hopkins white) are looking forward to the five<br />\nall angles, the high-schoolers<br />\nthe wrapper)-and we<br />\non<br />\nso<br />\nmuch<br />\nat<br />\nhalf<br />\nHutzler's<br />\nit<br />\nwhere<br />\nthey<br />\ndon't<br />\nmind<br />\nus<br />\ntell<br />\n8adm1nton team will thus be formed. remaining contests on their schedule. from<br />\nthey<br />\nBut<br />\nstanlast<br />\nthe<br />\nduring<br />\nsend your pouch. Only<br />\nwill<br />\nfore<br />\nthe<br />\nto<br />\nwent<br />\nThe entire schedule consists of home<br />\none to a customer.<br />\nza and won the contest 21-16.<br />\nJohn's,<br />\nSt.<br />\nseries<br />\nwith<br />\nhome<br />\nand<br />\nRifle Team Scores<br />\nCoach Dotterweich used most of<br />\nWhat you want is easy to find.<br />\nTowson Teachers, Loyola, and WestSPECIAL<br />\nhis squad in an effort to check the<br />\nWin Over Georgetown ern Maryland.<br />\nYou get efficient service.<br />\nOFFER<br />\nenemy's barrage of points. Those who<br />\nare<br />\nreasonable.<br />\nPrices<br />\nShooting with astounding accuracy<br />\nCharles Lander, Prop.<br />\nthe Johns Hopkins rifle team once<br />\nHair Cutting, 40c<br />\nMN MI MI MI NM 111=1<br />\nBOULEVARD BARBER SHOP<br />\nagain proved superior to the Georged, Va.<br />\nLams & Bro. Co., Rich<br />\nStreet<br />\n33rd<br />\nOn<br />\nEnclosed find 10t and one inside white<br />\ntown aggregation. The score of the<br />\nStreets<br />\nCalvert<br />\ntin<br />\nEdgeworth<br />\nof<br />\n•<br />\nparaffin wrapper fr<br />\nBetween St. Paul And<br />\nVictory was 1,283 to 1,249. Lewis,<br />\nSaturday<br />\nJr., for which send Inc 8E00 value<br />\nWeek Days<br />\nstar of the Hoya squad was high 8 A.M. To 7.30 P.M. 8 A.M. To 9 P.M.<br />\ntobacco pouch in my college colors. Hewn.<br />\nprint.)<br />\nPoint scorer in the match with 276<br />\n<br />\nBlue Quintet Far Off Form<br />\nIn Defeat By Superior<br />\nSaints<br />\n<br />\nJAYS NOW<br />\n<br />\nci<br />\n<br />\nNatators Show Surging Power<br />\nIn SwampingSwarthmore51-23<br />\n<br />\nMaryland Intercollegiate<br />\nLeague Standings<br />\n<br />\nBlue Jay Fencers<br />\nSECOND Eke Out 9 to 8 Win<br />\nOver Terp Combine<br />\n<br />\nGrapplers Trim<br />\nU. of Maryland<br />\nBy 25-11 Score<br />\n<br />\nFreshmen Basketeers Trim<br />\nTowson High; Lose To Tome<br />\n<br />\nBadminton Play<br />\nStarts After Exams<br />\n<br />\nJunior Varsity Five<br />\nHas Fine Record<br />\n<br />\nWRAPPER AND<br />\n11Y GET THIS<br />\n$1.22 POUCH<br />\n<br />\nIN&<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\n<br />\nJay.<br />\n<br />\nHUTZLER BitiliM<br />\n<br />\nNam<br />\n<br />\nNEW YORK LOAN OFFICE<br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\ninstruments, slide rules.<br />\n<br />\n118<br />\nlar<br />\n<br />\nNorth Liberty Street<br />\n<br />\n1<br />\n<br />\nPlaza 3495<br />\n<br />\nLUSCO'S<br />\nLocated at the North End Basement of<br />\nLevering Hall, for the convenience of the<br />\nstudent body and faculty.<br />\nHOURS-9 to 5 P.M.<br />\n<br />\nCAMPUS BARBER SHOP<br />\n<br />\nFor Your<br />\nLiquors<br />\n<br />\nSeeHARRY<br />\n3113 GREENMOUNT AVE.<br />\nPhone UN. 4883<br />\nFor Delivery<br />\n•••••••••••11,11.....<br />\n<br />\nAddress<br />\n<br />\nCity<br />\n<br />\n-%de<br />\n<br />\nOilir good for only 30 days<br />\nMIN MB MEI OM INN =I WO IMO<br />\n<br />\nI<br />\n<br />\n\f4<br />\n<br />\nHOMEWOOD, BALTIMORE,<br />\n<br />\nElectrical Dept. Students Recruited<br />\nSet For Engineering From Their Beds<br />\nShow In February To Hear Debate<br />\nCelebration To Be Held In Correspondent Relates How<br />\nHonor Of Twenty-Fifth<br />\nHopkins Team Entertains<br />\nAnniversary Of School<br />\nImprovised Audiences<br />\n(Continued from Page 1, Col. 2)<br />\nphane balloon which rises in the air<br />\nis also included in the apparatus.<br />\nIt contains a radio apparatus which<br />\n<br />\nFuture Debates To Be Held<br />\nIn Levering; Publicity<br />\nIs Needed<br />\n<br />\nsignals down readings of pressure and<br />\n<br />\nNE'<br />\n<br />\n:-:<br />\n<br />\nAround The Colleges<br />\n<br />\nIn Chicago, Miami University's Dr.<br />\nRead Bain told the American Sociological Society that state legislatures<br />\nshould be made into single houses and<br />\nshould appoint state managers to run<br />\nour commenwealths.<br />\nIn Providence, R.I., Prof. C. H. McDwain of Harvard charged the assembled members of the American<br />\nHistorical Association with allowing<br />\ntheir work to edge too close to the<br />\nborders of romance, and called them<br />\nback from their self-imposed task of<br />\nrewriting history to bring it into line<br />\nwith modern modes of thought and<br />\naction.<br />\n<br />\n(Continued from Page 1, Col. 3)<br />\nother such observations. When the the events. A small notice posted on a<br />\nIn Cincinnati, Dr. Francis P. Shepballoon reaches a certain height, it The boys on the team, while for great- ard,<br />\nUniversity of Illinois, described<br />\nbreaks open due to the pressure of the er part are raw men, have the ability to the convention of Geological, Minexpanding gas on the inside. At this of trained and experienced debaters. eralogical and Paleontological Socipoint the radio apparatus begins to bulletin board is not sufficient to rouse eties of America an oil field under the<br />\nGulf of Mexico that rivals the great<br />\nfall, but suddenly a parachute opens interest in an activity like debating.<br />\nfields of Texas in richness.<br />\nup and carries it to safety.<br />\nThe question to bed ebated for the<br />\nIn Williamsburg, Va., New York<br />\nIn the undergraduate laboratories current year is \"Resolved: that ConUniversity's Dr. Carleton Brown,<br />\nthe regular experiments as perfected gress be empowered to make legisla- speaking before the Modern<br />\nLanguage<br />\nby the students will tie shown. The tion for minimum wages and maxi- Association of America, made a sharp<br />\noperation of direct current generators mum hours in industry,\"--one which attack on what he called efforts to<br />\ntear down established teaching methand motors, speed regulation by the is of importance and particular releods, on which, he said, \"the foreign<br />\nWard-Leonard system, testing of rail- vance to the times.<br />\nlabel is easily discernible.\"<br />\nway motors, synchronizing of alterFuture debates are to be held in<br />\nIn Atlantic City, Miss Pearl Gardnating current generators, demonstra- Levering Hall. With a little extra pub- near, Cornell University agriculturtion of a new type of variable speed licity instead of the strong-arm tact- alist, reported that after five years of<br />\ninduction motor, synchronous motor ics used in the past, audiences will experimentation she had determined<br />\noperating and calibration of different be considerably increased in size; that the cow is more intelligent than<br />\nthe horse.<br />\ntypes of meters, are all included<br />\nwith the passing of the weeks, deAnd that all of the scientific reports<br />\namong these experiments.<br />\nbates will become more interesting added to the \"cow sense\" of the world,<br />\nIn the field of radio fundamental<br />\nnot the \"horse sense.\"<br />\nexperiments will demonstrate various and the debaters more experienced.<br />\nfunctions of radio circuits, and typical<br />\nradio measurements, such as percentage of modulations. Various exhibits<br />\nin the field of illumination will show<br />\nthe measurement of candle power of<br />\nlamps, and the method and instruments for measurement of general illuminators. The electrical measurements laboratory will present a display of old and new types of standard<br />\nelectrical measuring devices.<br />\nThe Electrical Engineering Research Laboratories will have in operation on display the actual apparatus which is being used for investiga-<br />\n<br />\ntion on high voltage cables. Oxidation<br />\nin insulating oils and insulating papers will be shown, and the methods<br />\nof testing will be exhibited. Moreover,<br />\na new electrical method of testing<br />\nWells will be demonstrated.<br />\n<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br />\n<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nWASHINGTON'S<br />\n<br />\n1<br />\nINE flavor is only<br />\nhalf the story ...<br />\nthere is, in National<br />\nBeer, the deep<br />\ndown wholesomeness of extra costly<br />\ningredients. ....<br />\n<br />\nF<br />\n<br />\nLapel Watch<br />\nPhysics Lab On Monday<br />\nReward<br />\nBox 1053<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\n:-:<br />\n<br />\nNew York City—When it comes to<br />\n\"What is the difference between<br />\nmaking speeches, the college athlet- payment and non-payment of a colic coaches and directors take all<br />\nlege athlete so long as he keeps his<br />\nprizes.<br />\nscholastic work up to the proper<br />\nAt their annual conclave here a<br />\nstandard and conducts himself like<br />\ncouple of weeks ago they broke the<br />\nsilence that characterize them during a gentleman,\" he said.<br />\nDr. J. N. Nichols, director of athplaying days and harangued on a lot<br />\nof things that have been bothering letics at Oberlin College, suggested<br />\ncoaches, fans and players for a long professionalism<br />\nfor small colleges but<br />\ntime, and then held several roasting<br />\nalong a different route. The chief<br />\nsessions that did not exclude the fellow that foots the bill for it all, the points in his program are: the elimination of gate receipts; the financing<br />\nfan.<br />\nof<br />\nathletics in the same way in which<br />\nAfter hotel janitors had started to<br />\nclean up after the final sessions of other college activities are financed;<br />\nthe conventions of the National Col- the abolition of leagues and conferlegiate Association and the American ences; the matching<br />\nof schools of the<br />\nFootball Coaches Association, dele- same size; the establishmen<br />\nt of<br />\ngates sat down to rest and recount coaches on a full time basis<br />\nand the<br />\nhighlights of the meetings. Here's simplification of eligibility<br />\nrules.<br />\ntheir summary:<br />\nIn Tuscaloosa, Alabama, the meetAt the opening meeting of the N.C. ing of the Southeastern Conference<br />\nCA., Dr. William L. Hughes, associ- baried movies for scounting and inlate profesor of physical education, structional purposes and vetoed a proColumbia University, suggested open posal that each member of the conpayment of college footballs in order ference should have to play at least<br />\nto end \"hypocrisy.\"<br />\nfive intra-league games a season.<br />\n<br />\nL 0 S T ...<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nUnexcelled Fountain Service<br />\n<br />\nJANUARY 22, 1937<br />\n<br />\nBIRTHDAY<br />\nWill Find<br />\n<br />\nHAL KEIVIP<br />\nAt The<br />\n<br />\nLord Baltimore<br />\n<br />\nMow<br />\nTo'<br />\nPATRONIZE<br />\nTFIE SECOND COTILLION<br />\n<br />\n1. 0.?<br />\nDo you Fall for so-called \"giveaway ,prices in so-called\"clearance<br />\nsales?' Or do you insist on<br />\nGOOD Clothes at a generous but<br />\nGENUINE discount? Here's the<br />\nanswer (don't look.)<br />\n<br />\nOppc<br />\nI A'<br />\n<br />\nMelv<br />\nSiege<br />\nCross<br />\nZheu<br />\nRasir<br />\n<br />\nThe<br />\n14]inmit<br />\nto ha<br />\nMary':<br />\nOf the<br />\nare nc<br />\nMaryll<br />\nLea.gui<br />\n<br />\nDistinguished (Ready-to-wear)<br />\nSuits, Topcoats & Overcoats at The<br />\nthe<br />\n$35. to S80. Clothes Reduced • Univet<br />\n<br />\n$26.25 to $60<br />\n& Son<br />\nEast Lexington St.<br />\n<br />\nBrewing Co.<br />\n<br />\nNo. 3-B<br />\n<br />\nBALTIMORE. MO.<br />\n<br />\n....<br />\n<br />\nBLUI<br />\n<br />\nWHAT'S YOUR<br />\n<br />\nJos. Schloss<br />\nThe Natioi<br />\n<br />\nVOL.<br />\nBit!<br />\nMe<br />\nQu<br />\n<br />\n• ......<br />\n<br />\n(nowhere else)<br />\n<br />\nfew sl<br />\n<br />\nnot, h(<br />\ning<br />\n<br />\nof<br />\n<br />\nWit]<br />\nWorrie<br />\nquint<br />\nbest a<br />\nstiffiei(<br />\nthan<br />\nhave<br />\ndicatic<br />\nLas<br />\nrnen r<br />\nsonud<br />\nthat ,<br />\nComp<br />\n<br />\n•<br />\n<br />\nNAY NAY LAD<br />\nYE CANNA GIE ME THOSE<br />\nILL BUY MY OWN KIND<br />\nI KEN WHAT THEY DO...<br />\n<br />\nterto<br />\nhands<br />\nthat<br />\n/nate'<br />\nSh<br />\neente<br />\nOf tr<br />\nand<br />\nberth<br />\nThe f<br />\nby th<br />\ndribb'<br />\nThi<br />\nhardy<br />\nrathe<br />\nbeter<br />\ntack.<br />\nTh<br />\nto ir<br />\nRoo<br />\nto pi<br />\nfight<br />\nAp<br />\nStay<br />\n<br />\nhe is<br />\nella<br />\nscori<br />\nProvi<br />\nthe<br />\nhard<br />\nIli NA,<br />\nnedy<br />\ncorn]<br />\nTi<br />\nMar,<br />\n<br />\nGl<br />\nN(<br />\n<br />\nFir<br />\n<br />\nAla<br />\nOb<br />\n<br />\nWhen smokers find out the good things<br />\nthat Chesterfields give them<br />\n<br />\nede<br />\n<br />\nteal<br />\nGill<br />\nThE<br />\nis<br />\n°ha<br />\n<br />\nUn<br />\nVitr<br />\n<br />\nin<br />\n'gr<br />\n<br />\na. d<br />\nhui<br />\nha.!<br />\nco/<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nIpts iqopkins Dirtuarattrr<br /><br />\nGET SEMESTER MARKS<br />\nFROM YOUR ADVISOR<br />\nON FEBRUARY 3<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br /><br />\nVOL. XLI, NO. 21<br /><br />\nPRICE 5 CENTS<br /><br />\nG-Man To Talk Electrical Dept. Annual Down Bay Musical Club Ends Cotillion Board Announces<br />\nSet For Engineering Conference To Take FirstPart OfSeason Hal Kemp And Orchestra<br />\nAt 1st Assembly Show<br />\nIn February Place February 6,7 WithThreeConcerts<br />\nFor Second Affair, Feb. 22<br />\nUnder New Plan Celebration To Be Held In Henry Leber, President Of Musicale At Maryland Cas•<br /><br />\nHugh H. Clegg, Ass't. Director Of F.B.I. To Speak<br />\nOn Crime Detection<br /><br />\nHonor Of Twenty-Fifth<br />\nAnniversary Of School<br /><br />\n'I\" Is Chairman Of<br />\nConference<br /><br />\nualty Last Sunday Featured By Glee Club<br /><br />\nComes As<br />\nProfessor Russell Announcement<br />\nSurprise; Marks Kemp's<br />\n2nd Appearance Here<br />\nAt Gives Dohme Talk<br /><br />\nMany Spectacular Exhibits Fifteen Members From Hop- Next Event Scheduled<br />\nMaryland College For<br />\nkins To Attend Meeting<br />\nPlanned Including ArtiENNIS TO VOCALIZE<br />\nATTORNEY TO SPEAK<br />\nGases<br />\nReveals<br />\nPlanets<br />\nRetain<br />\nWomen,<br />\nFebruary<br />\n5<br />\nIn Virginia<br />\nficial Lightning<br />\nIn Proportion To Size<br />\nLord Baltimore Chosen As<br />\nArthur Garfield Hayes To The passage of light over a sound The annual Down the Bay Confer- Three concerts over last week-end<br />\nAnd<br />\nWeight<br />\nScene Of Affair; ComMake Annual Visit On<br />\nbeam, a miniature dial telephone ex- ence, sponsored by the Student Y's in concluded the first part of the current<br />\nMaryland, Washington, and Virginia, season by the Johns Hopkins Musical<br />\nmemoration Night<br />\nDr. Henry Norris Russell, Professor<br />\nMarch 11th<br />\nchange showing what actually hapwill be held Saturday and Sunday,<br />\n--Astronomy<br />\nUniverat<br />\nPrinceton<br />\nof<br />\nFriday,<br />\nJanuary<br />\n15,<br />\nthe<br />\norClub.<br />\nOn<br />\npens when a call is made, a demon- February 6th and 7. Henry Leber,<br />\nOnce more Hopkins men will lift<br />\nThe first Assembly under the new<br />\nsity, delivered one in a series of<br /><br />\nstration of a modern power transmis- President of the Hopkins \"Y,\" is ganization traveled to Annapolis to<br />\nDohme Lectures yesterday afternoon their tired dogs to gaily trip the<br />\npresent its program before the Annapsion line, and many other exhibits Chairman of the Conference.<br />\nat 4:00 in Remson Hall. His topic was light fantastic to the sweet, scintilfeat-LETTER,<br />\nwill<br />\nNEWS<br />\nthe<br />\nCouncil by<br />\nThe theme of this year's conference olis High School. Roberts Beach \"The Atmospheres of the Planets.\"<br />\nshowing the phenomena of fundamenlating rhythms of Hal Kemp and his<br />\nDiAssistant<br />\nClegg,<br />\nH.<br />\nure Mr. Hugh<br />\ntal electrical engineering will be among is to be Social Security, and among School was the scene for the concert<br />\nIntroduced by Dr. Hubbard, of the Orchestra, at the second Cotillion.<br />\nof<br />\nInBureau<br />\nFederal<br />\nof<br />\nthe<br />\nrector<br />\nthe leaders are:<br />\non Saturday, January 16. As part of Physics department as being \"the<br />\nthe features in the exhibits presented<br />\nvestigation, who will address the<br />\nWinant, Chair- the Maryland Casualty Musical series, greatest astronomer in America,\" his Surprising almost everyone, the CoHonorable<br />\nJohn<br />\nG.<br />\nby the Electrical Department for the<br />\ntillion Board suddenly announced<br />\nman of the Social Security Board,<br />\nstudents on February 11, on \"Scien- Engineering Show, to be held in Febthe Hopkins Glee Club and soloists lecture was judged as being extremely<br />\nthat<br />\nformer<br />\nGovernor<br />\nof<br />\nNew<br />\nHampthe Kemp outfit had been definteresting<br />\nand<br />\ninformative<br />\nby<br />\nthose<br />\ntific Crime Detection.\"<br />\nruary.<br />\ngave a concert on Sunday, January 17.<br />\nshire<br />\ninitely<br />\nselected to mete out melody<br />\nWho<br />\nattended.<br />\nOn March 11, Arthur Garfield<br />\nThe Engineering Show is being preIn the presentations at Annapolis<br />\nRoss W. Sanderson, Executive Sec'Spots' Indicate Planet Composition at the Lord Baltimore on February<br />\nHayes, Attorney for the American sented in conjunction with the celeretary of Baltimore Federation of and the Roberts Beach School, all of<br />\nDr. Russell told first of the various 22nd.<br />\nCivil Liberties Union, will be the bration of the twenty-fifth anniverChurches<br />\nthe<br />\ndepartments<br />\nof<br />\nthe<br />\nclub,<br />\nincludOne of the nation's outstand_ dance<br />\nplanets; Jupiter, Mrs. Saturn, the<br />\nsary of the Engineering School. It<br />\nguest speaker.<br />\nRev. Joseph Novak, Pastor of St.<br />\ning the Glee Club, Banjo Club, Blue Moon, Venus, etc., and explained about aggregations, the Kemp men have<br />\nwill consist of a great variety of exPaul's Presbyterian Church<br />\nFirst Speaker<br />\nhad no \"Date with an Angel\" at the<br />\nhibits presented by each of the EnMr. Paul Rotham, Executive Sec- Jay Orchestra, Hawaiian Troupe, their \"spots,\" and \"twilight effects.\"<br />\nAssistant Director Clegg has been gineering Departments. The ElectriHopkins<br />\nsince June, 1935, when they<br />\nMars<br />\nhas<br />\nconstant<br />\nspots;<br />\nin<br />\nJupiter<br />\nretary, Baltimore Local No. 4 of Quartet, and soloists, joined in the<br />\nwith the Bureau of Investigation cal Engineering exhibits will be found<br />\nserenaded the Juniors at their promare<br />\nirregular<br />\nattendance;<br />\nthey<br />\nin<br />\nSatthe American Radio-Telegraphers programs, which were given in the<br />\nurn's are faint and irregular, appear- enade. The smooth song stylists have<br />\nsince 1926. Since that time, he has in Maryland Hall.<br />\nAssociation<br />\nevening. At the Maryland Casualty, in<br />\ngand disappearing suddenly; the kept college men all over the counOfficer<br />\nAdministrative<br />\nspectacular<br />\nexhibserved as an<br />\nOne of the most<br />\nLuther Becker of the Federal Social<br />\n•the Glee Club and soloists presented planet Venus shows in ultra violet try agog, however, with their inimitmoda<br />\nits<br />\nwill<br />\nbe<br />\na<br />\ndemonstration<br />\nof<br />\nSecurity<br />\nBoard.<br />\ncharge<br />\nof<br />\nand as Special Agent in<br />\nable rhythm, and arrangements, retranmission line, showing<br />\nWilliam J. Lahan of the Baltimore a concert in a series in which well- light the twilight effect; and the<br />\nthe Atlanta, Georgia, Washington, ern power<br />\ncording, and broacasts, as well as<br />\nthe effect produced when the wires or<br />\nBranch of the Federal Social Se- known music organizations, including Moon has no twilight effects, refracD.C., and Chicago, Illinois, Field Divtion, or star occultation. These facts personal appearances.<br />\ntowers are struck by lightning. This<br />\ncurity Board.<br />\n•<br />\nthe 8 and 0 Glee Club, U. S. Army<br />\nindicate certain characteristics conisions. He was appointed an Inspect- exhibit shows an actual lightning<br />\nCollegiate Band<br />\nPhilip Jacob, Yale 1935, Represent- Band, and others participated.<br />\ncerning the composition of the atmosor in 1930, and in 1932 was made stroke in miniature, and the resultant<br />\nHal Kemp has a typical and perative of the Youth Section of the<br />\nGlee Club Card<br />\npheres of the planets. By ultra violet fect college man's band. Himself<br />\neffect on the power system.<br />\nEmergency Peace Campaign.<br />\na<br />\nAssistant Director of the Bureau.<br />\nOn<br />\nthe<br />\ncard<br />\nof the Glee Club were ray study, by the use of balometers, North Carolina man, Hal favors<br />\nAs<br />\nthe<br />\nname<br />\npoints<br />\nout,<br />\nthe<br />\nconany<br />\nArtificial Lightning<br />\nA graduate of Millsaps College, in<br />\nspectroscopes and other intruments, and all with his deep southern<br />\nthe following selections:<br />\nacExperiments<br />\nshowing<br />\nartificial ference is held on shipboard going<br />\nJackson, Mississippi, Mr. Clegg also<br />\nmuch definite information has been cent in conversation at any time—<br />\nOde<br />\nby<br />\nDevries<br />\nand<br />\ndown<br />\nthe<br />\nChesapeake<br />\nBay<br />\nand<br />\nthe<br />\nJohns<br />\nHopkins<br />\nas<br />\nhigh<br />\nfrequency<br />\nlightning<br />\nas<br />\nwell<br />\nholds an LL.B. degree from George<br />\ngained. It has been ascertained that that is, of course, if anyone gets<br />\nStarr<br />\nvoltage of the order of 1,000,000 volts general session will be held Sunday at<br />\nMars and Venus have atmospheres through the twenty deep crowd<br />\nWashington University. Before joinVirginia.<br />\nHampton<br />\nInstitute,<br />\nthat<br />\nI Love Life by Mana Zucca<br />\nwill also be demonstrated. A spark of<br />\nwhich are analagous to ours. The constantly surrounds him.<br />\ning the Bureau of Investigation, he<br />\nThe<br />\nHopkins<br />\ndelegation<br />\nunder<br />\nthe<br />\nfrom three to four feet in length has<br />\nThe Lord's Prayer by Albert Hay three planets Earth, Venus and Mars<br />\ntaught Latin, Chemistry, and Physleadership of Bryant Mather will join<br />\nThe whole bunch, in fact, is apbeen developed in this apparatus.<br />\nMallotte<br />\nare called the \"terrestrial planets\"<br />\nics at Millsaps College, Wood Junwith the representatives of 15 colleges<br />\nparently tetched in the haid. They are<br />\nanother<br />\nIn<br />\nexhibit various methods<br />\nHigh Barbary by Arthur E. Hall and come midway between the smaller<br />\nior College and Emerson Institute.<br />\nIn the vicinity of Baltimore, and<br />\nprobably the only band in the counHe is also a major in the Military of illumination will be shown. The board the boat at Baltimore. Their<br />\nShenandoah by Marshall Barthol- planets like Mercury and the Moon, try who can start a difficult<br />\narrangeand the bigger planets like Jupiter.<br />\nIntelligence Division of the Officers mercury vapor light and the sodium conference will take place enroute to<br />\nomew<br />\nment, and while carrying through to<br />\nlight<br />\nvapor<br />\nwill<br />\nbe<br />\namong<br />\nthese.<br />\nTests<br />\nReserve Corps, United States Army.<br />\nThe meat of the lecture might be the end perfectly<br />\nHampton Institute, Virginia, where<br />\nSalt Beef by Thomas Word<br />\nwithout a break,<br />\nwill be made to show the effect of there will be a general meeting on<br />\nAssembly Plan<br />\nWanderer's Song by Robert Schu- discovered in a careful consideration carry on a wrestling match, exchange<br />\nthese and other types of lights on nat- Sunday.<br />\nof what Dr. Russell had to say con- remarks with the dancers„ and otherThe Assemblies during the months<br />\nman<br />\nural colors.<br />\nFifteen students from Hopkins have<br />\ncerning the relative sizes of the plan- wise direct both themselves and their<br />\nof February and March are to be run<br />\nDear Old Johnny Hopkins arr. by<br />\nTwo Way Radio Communication<br />\nets, their proportional strength of listeners.<br />\nsigned up to make the trip. Any other<br />\nby students under the joint organiSteinwald<br />\nwho<br />\nconferstudents<br />\nwish<br />\nto<br />\njoin<br />\nthe<br />\ngravitational forces, an dthe gases<br />\ntwo-way<br />\nradio<br />\ntelephone<br />\nA<br />\ncommuzation of the NEWS-LETTER and the<br />\nThe orchestra is especially noted<br />\nHopkins Medley arr. by Steinwald which, because of the weakness or<br />\nStudent Council. Plans for speakers nication between an automobile on the ence are asked to get in touch with<br />\nfor its trumpets and rhythm section<br />\nConrad Gebelein has charge of the strength of the gravity on any one of<br />\nand rules for attendance are those campus and a station in Maryland Henry Leber immediately.<br />\nin general.<br />\nThe entire cost, including stateroom Hawaiian Troupe and Banjo Club, the planets, is either held to the<br />\nsuggested by the NEWS-LETTER, and Hall will be operated during the show.<br />\nPlaying with perfect precision and<br />\nthe Student Council has consented to \"Five meter\" radio phone transmit- on the boat, meals, and Registra- while Osmar P. Steinwald directs the planet, or flies off it into space. Small<br />\na<br />\ntriple-tonguing<br />\neffect that is unique,<br />\nplanets, where the gravity is low canters will be used, and the conversation tion fee, is $8.75.<br />\ncooperate in this experiment.<br />\nGlee Club and Quartet.<br />\nand which no other band has been<br />\nnot<br />\nhold<br />\non<br />\nto<br />\neven<br />\nthe<br />\nheaviest<br />\nof<br />\nAs stated in last week's NEWS- will be available to the audience from<br />\nSchedule Listed<br />\ngases in their atmospheres. The ter- able to achieve, they form a perfect<br />\nLETTER, \"It (the experiment) arises loud speakers.<br />\nH. Thatcher Procured<br />\nAmong other concerts scheduled restrial planets can, by virtue of their background that is subdued and yet<br />\nA polarized light experiment showfrom a desire to permit such an exBy Friends Of Music are:<br />\nincreased gravitational forces, hold on unforgettable. It is this very rhythm<br />\nperiment to prove its worth, and the ing how the glare of automobile headMaryland College for Women, Feb- to the heavier gases, but allow such that makes the new Kemp rendition<br />\noutcome to clear up many questions lights can be avoided by use of a reA lecture on \"The Fugue as a<br />\ngases like hydrogen, a very light of Cole Porters I've Got You Under<br />\nruary 5<br />\nconnected with assemblies in gen- cently patented invention. A trans- Form\" will be delivered by Howard<br />\nmolecule, to leave their atmospheres. My Skin, such a sensation the counGuilford Church, February 12<br />\nparent material will be placed over<br />\neral.\"<br />\nR. Thatcher of the Peabody ConThe<br />\nlargest planets, like Jupiter, are try over.<br />\nthe windshield. The light passing<br />\nNational Park Seminary, Februservatory of Music under the ausThey can always be counted on for<br />\nable to hold on to all the gases, even<br />\nthrough these two materials will be<br />\nary 20<br />\npices of the Friends of Music Sohydrogen. Dr. Russell explained in \"I've Got a Date with an Angel,\"<br />\ncompletely blocked out.<br />\nHome Concert, February 26<br />\nciety of the Johns Hopkins Univerdetail how astronomers have arrived having played it for so long and so<br />\nWeather Bureau Exhibit<br />\nAtlantic City, March 6<br />\nsity on Friday, February 5. The adtypically, that to mention one is to<br />\nat the above conclusions.<br />\nSome former Hopkins men now con- dress is to be delivered in the parlor<br />\nCatonsville High School, March 12<br />\nDr. Russell, born at Oyster Bay, think of the other. The vocal here is<br />\nnected with the Weather Bureau will of Levering Hall at 8 P.M. It is to be<br />\nOfficers of the Club are John New York,in 1877 took his A.B. degree led by Skinny Ennis, with the whole<br />\nhave an exhibit here showing meth- a purely non-technical discussion with<br />\nat Princeton and his Masters one year band assisting.<br />\nMarks To Be Obtained From ods of making observations. A cello- illustrations on the piano of the var- Steeper, president; J. Judge Mehl- later.<br />\nKemp himself can be counted on to<br />\nThe degree of Doctor of Philing, business manager; Allan L. Pink(Continued on Page 3, Col. 2)<br />\nious points of the lecture.<br />\nAdvisor As In Other<br />\nosophy was conferred on him in 1900. play either saxophone or clarinet,<br />\nerton and John J. Ghinger, vice-pres- From 1902 to 1903, he was a research being a master of both. Long, lean,<br />\nSchools<br />\nidents; Bradford Johnson and Thom- student at Kings College, Cambridge, and lanky, he is a perfect showman<br />\nas E. Ellis, junior business managers; England, and from 1903 to 1905, he to boot.<br />\nBreaking a long established HopFour-Star Vocalists<br />\nkins proceedure, term marks will not<br />\nand Stanley M. Finkel, publicity man- served at Cambridge as Research Assistant of the Carnegie Institution.<br />\nThe Kemp aggregation features its<br />\nbe posted, following the period of exager.<br />\nReturning to America in 1905, he four four-star vocalists. Skinny Ennis,<br />\naminations this year. Instead, each<br />\nbecame an instructor in Astronomy at as ever, when not at his traps, imstudent will see his advisor, who will<br />\nPrinceton, being advanced to Assist- parts that breathless quality to a set<br />\nhave been notified of the grades Jay Orators Enthusiastic But Need More Support; Next<br />\nant Professor in 1908. In 1911, he be- of lyrics whch makes one gasp and<br />\nearned by the student.<br />\nContest Will Be Held In<br />\ncame Professor of Astronomy, the po- writhe. Hugging the microphone to<br />\nThis system has been adopted at<br />\nLevering Hall<br />\nsition which he now holds. Joining death, he pours his heart and soul<br />\nother universities, though for differthe staff of the Mount Wilson Ob- into the romance of the melody, and<br />\nClub<br />\nAlso<br />\nBiology<br />\nJournal<br />\nHears<br />\nMiss<br />\nent reasons than caused Hopkins'<br />\nthoughts of sleep forgotten in an ex\"Bang, Bang!\"<br />\nservatory in 1912 as Director of Ob- the result is enough to make a refrigMutations<br />\nCrouse<br />\nOn<br />\nHelen<br />\nchange. Elsewhere, posting of differAnd your correspondent, awakened cess of enthusiasm.<br />\nservation, he became a Research As- erator amorous.<br />\nin Drosophila<br />\nent grades has led to various forms<br />\nfrom a sound sleep on an early Sunsociate<br />\nin 1921 and Research Profesweek,<br />\nin<br />\nthe<br />\nThe<br />\nfollowing<br />\nevening<br />\nof the tutoring racket, and even<br />\nSaxy Dowell, maddest of the mad<br />\nday morning (11.40 .M.), is uncer- this time, another debate was held.<br />\nMembers of the Biology Journal sor in 1927.<br />\nthough offers made a student may be<br />\ncrew, when not yelling out some<br />\nemoniously dragged out of bed by an This time, the crowd was even smaller Club yesterday heard U. L. HiginDr. Russell is a member of the Nahonest, public notice of failure has<br />\ncatchy novelty tune does his turn at<br />\nexcited youth with a fever in his eye due to the fact that the students<br />\ntional Academy of Sciences; Ameribeen found inadvisable.<br />\nbotham, graduate student in botany,<br />\nsecond sax. Master musician and<br />\nto be conscripted as an \"audience.\"<br />\ncan Philosophical Society, of which he<br />\nweren't in their rooms at the time<br />\nclown, Saxy affords the comic relief to<br />\npresent a review of \"Growth Hor- was<br />\npresident from 1931 to 1932;<br />\nThis scene, duplicated in other parts that the \"collection\" began. The few<br />\nsuper-syncopation.<br />\nChemistry Journal Club<br />\nof the dormitory had, as its ultimate who had heard the mumbled an- mones in Plants,\" written by Boyce American Academy of Arts and SciMaxine Grey, eyeliner extraordiBegins Lecture Series purpose, the accumulation of a fairly nouncement at dinner didn't take it Jensen and translated into English by ences; American Astronomical Soci- nary, lends feminine sweetness<br />\nand<br />\nety,<br />\nof<br />\nwhich<br />\nhe<br />\nwas<br />\npresident<br />\nfrom<br />\nsize<br />\naudience<br />\nto<br />\nabout<br />\nthe<br />\nlisten to a de- seriously, or, uninformed<br />\nlarge<br />\nAvery and Birkholdbr. It is the first<br />\ncharm,<br />\ncoupled<br />\nwith<br />\na<br />\nsmooth,<br />\nlovely<br />\nThe Chemistry Journal Club has in- bate between the Johns Hopkins and interest in listening to a well-prepared volume on the subject which has been 1934 to 1936; American Physical Society; and the Royal Astronomical voice. Last, but by no means least,<br />\ndebate, didn't bother to attend.<br />\naugurated a series of student lectures, the Manhattan College forenseurs.<br />\ntranslated into English.<br />\nSociety (London), where he was the Is Bob Allen, tenor romanticist, once<br />\nThe second debate was held against<br />\nAbout a dozen sleepy-eyed stupresented every Tuesday afternoon at<br />\nheard, never forgotten.<br />\ndone gold medalist in 1921.<br />\nwho<br />\nhas<br />\nCrouse,<br />\nMiss<br />\nHelen<br />\n4.00 o'clock in Room 221, Remsen dents, not knowing or caring whether the University of Pennsylvania. It<br />\nexCollege<br />\nSmith<br />\nIn<br />\n1912,<br />\nhe<br />\nwas<br />\nwork<br />\nat<br />\nawarded<br />\ngraduate<br />\nthe<br />\nHenry<br />\nfirst,<br />\nand<br />\nwitnessing<br />\na<br />\nhotter<br />\nthan<br />\nthe<br />\nHall.<br />\nwedding or was even<br />\nthey were<br />\nThe first lecture, delivered last execution, were dragged down to the the sparse audience and the corres- perimenting with fruit-flies and their Draper Medal by the National AcadCall For Meeting<br />\nemy of Sciences, and the Lelande<br />\nTuesday by Mr. A. L. Sklar dealt with Commons Room that morning. Hardly ponding weakness of applause was no reactions to different temperatures,<br />\nThere will be an important meet\"Absorption of Light by Organic had they been there five minutes, detriment to the spirit with which the spoke on \"Body Mutations Produced Medal by the French Academy. Three<br />\nCompounds.\" The next lecture will be when they sat up, rubbed their eyes, debaters conducted their forensic bat- in Drosophila by Exposures of Larva years later, the Astronomical Society ing of the members of the NEWSto Sub-Lethal 'llemperatures:\" She Pacific awarded him the Bruce Medal, LETTER staff after examinations on<br />\ngiven February 9, by Mr. C. F. Squires and asked what \"all the shootin' was tling.<br />\n',Ain. ft,. A rriorinan A no riarri.r nf A rta<br />\n_<br />\n_<br />\nThe inability of the Debating Team also cnseusseu me wont clone uy ±.)r.<br />\nFriday, February 5, at 12.20. 5iecon \"Specific Heat of Nickel,\" and the fur\". Shortly afterwards theye were<br />\nand<br />\nSciences<br />\nconferred<br />\nupon<br />\nhim<br />\nthe<br />\nworking<br />\nhas<br />\nbeen<br />\ntion for editor will be held at this<br />\nfollowing week, Mr. W. D. Kirkpat- giving excellent interpretations of to raise audiences is explained by the H. H. Plough, who<br />\nrick will speak on \"Compounds of the rabid racetrack fans watching the lack of advertisement accompanying on this same subject for the last two Rumford Medal. In 1934, he was retime.<br />\ncipient of the Franklin Medal.<br />\ndecades.<br />\n(Continued on Page 3, Col. 2)<br />\nfavorite nose ahead to the win„ all<br />\nInert Gases.\"<br />\nplan as suggested<br /><br />\nto the Student<br /><br />\nPosting Of Marks<br />\nCeases This Year<br /><br />\nAudience Roused From Arms<br />\nOf Morpheus To Hear Debate<br /><br />\nGrad Student Talks<br />\nOn Plant Hormones<br /><br />\n1<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br /><br />\n2<br /><br />\nTEbt 3obris jOopturts<br />\nletter<br /><br />\nand effort for the enjoyment derived<br />\nfrom this activity.<br />\nWe extend our congratulations to<br />\nthese men, the officers, and the directors--\"Gebbie\" Gebelein and \"Os\"<br />\nSteinwald.<br /><br />\nC<br /><br />\nAMPUS<br />\nOMMENT<br /><br />\nStudent Strikes<br />\nhisa•cniniuu ger yea.,<br />\nBy Mail<br /><br />\nElection By-Laws<br /><br />\nWhilst we here prepared to crowd a<br /><br />\nIntercollegiates<br />\nHanover, N.H. (A.C.P.)—War has down—no matter the excess yardage<br />\nput in its appearance on the extra- made, each forward or later pass<br />\ncurricular study program of Dart- completed and resulting in gain, each<br />\nmouth College.<br />\nforward pass intercepted, each fumble<br />\nInterest in warfare has been so<br />\nrecovered, and each kick that rolled<br />\nmanifest that certain members of<br />\noutside within the ten yard line.<br />\nthe Dartmouth faculty—not the colThe team would also lose a point<br />\nlege itself, have organized a course<br />\nfor<br />\nfumbling and not recovering or<br />\nof<br />\nvarious<br />\nphases<br />\nthat deals with the<br />\nconflict.<br />\nfor each fifteen yard penalty inflicted<br />\nProf. Bruce W. Knight, sponsor of upon it.<br />\nthe new course, has announced that<br />\nMadison, Wisconsin - - Another atthe series of eighteen evening meettack of severe investigation - itis<br />\nings is open, with fee, to anyone who<br />\nwishes to enroll. Many of the sixteen struck the University of Wisconsin<br /><br />\nAround<br />\nWashington<br />\nWashington, D.C.—When Congress<br />\nassembled this week for its first ses-<br /><br />\nwork into three short<br />\nsion, there arose to take his oath of<br />\nweeks the students out in Wisconsin<br />\noffice a new member who Jooked<br />\nwere on strike because they don't like<br />\nyoung enough to be a college senior<br />\nhaving the governor of the state<br />\nrather<br />\nthan a Representative in the<br />\n3,<br />\nDecember<br />\nmatter<br />\nEntered as second class<br />\nmake decisions about the personnel<br />\n1999, at the Postothce in Baltimore, Md., under<br />\nNational<br />\nCongress. As a matter of<br />\n1879.<br />\ntbe Act of Congiess, November 3,<br />\nand policy of their school.The students<br />\nonly slightly older than<br />\nfact,<br />\nhe<br />\nis<br />\nJune,<br />\nhave decided that they want Glenn<br />\nPublished semi-weekly from October to<br />\neacept during ex.anunatiun and college holiday<br />\nwhat<br />\nis<br />\nmuch<br />\nand,<br />\nas<br />\npresident,<br />\nFrank<br />\ncollege<br />\nmany<br />\nseniors and, perhaps,<br />\nperiods by undergraduates of the Johns Hopkins<br />\nLJaiversity.<br />\nmore important, they haven't merely<br />\nnot as old as many students who comEDITORIAL STAFF<br />\nmade a decision, they have done someplete their undergraduate work and<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nspeakers who have agreed to lecture again early this month, and this time<br />\nthing about it.<br />\nAssociate Editor<br />\n..<br />\nStanley<br />\ngo on -to professional schools to preJames Morrow, David Caplan Managing Editors<br />\nDr. Board of Regents removed Pres.<br />\nStudent strikes, despite the annoy- saw service in the World War.<br />\nSpOrti Editor<br />\nBernard D. Pinch.<br />\nBenjamin Rout, Wethered Barroll, Jr.<br />\n\"No college, so far as I know,\" said Glenn Frank to cure another attack pare themselves for the practice of<br />\nThe rules ( ?) if not circumvented, ance they cause to peace-loving folk,<br />\nAssistant Managing Editors<br />\nmedicine or law.<br />\nAssistant Sports Editor if given rigid supervision by a dis- are a very healthy symptom. They Prof. Knight, \"offers a general course of the<br />\nHarold Zheutlin<br />\ndisease that twice last year<br />\nColumnist<br />\n.<br />\nPaul Berge<br />\nThe \"Baby - Congressman\" is 27Reporters--Max Iskowitz, Nathaniel Finkelstein, passionate S.A.C., if followed in an demonstrate a certain vitality which on war. This apparently strange gap forced other members of its staff to be<br />\nJewett Goldsmith, Howard Reizenstein, Jul- honorable spirit, ought to insure fair we at the University might do well to in the curriculum may be due to sharp<br />\nyear-old Lyle H. Boren of Oklahoma<br />\nian Adler, Carl Rastn, Leonard Ruhinger,<br />\ndisplaced.<br />\nMorris Wessel, Arthur Katz, Martin elections. However until a real test emulate occasionally. It is good to departmental cleavages of the social<br />\nwho defeated the incumbent \"Cowboy<br />\nKrieger, Lester Rosenthal, Murray Kempton.<br />\nAfter a two-day operation that ascourse<br />\nthe<br />\nproblem<br />\nis<br />\na<br />\nsciences.<br />\nOf<br />\nwait<br />\nanxlaws,<br />\nwe<br />\nis<br />\ntheir<br />\nmade<br />\nof<br />\nadministratake a real interest in the<br />\nVictor Victoroff, Charles Diggs, William<br />\nCongressman\" Gassaway and a field<br />\nBurford, Jack Handelsman.<br />\nbroad one. A teacher in a given de- sumed the proportions of a great speciously and not a little unconfidently. tion of your school.<br />\nBUSINESS STAFF<br />\nof eight other candidates to win his<br />\nBusiness Manager<br />\nWilliam B. Kempton.<br />\nto elect SFA repre- partment knows something of war tacle, the board that was accused of<br />\nIt<br />\nis<br />\nnot<br />\nenough<br />\nMelville Locker .. Assistant Business Manager<br />\nmainly<br />\nimmediate<br />\nto<br />\nhis<br />\nbut<br />\nthe<br />\npart<br />\nseat<br />\nin the House.<br />\nAdvertising Manager<br />\nsentatives to elect committees to<br />\nWm. C. Erlanger<br />\ntaking orders from Gov. Philip F.<br />\nCirculation Manager<br />\nown field.<br />\nGerald Willen<br />\nWe<br />\nhear a lot about the need for<br />\nIt<br />\nis<br />\nnot<br />\ndance<br />\nchairmen.<br />\nchoose<br />\nOffice Manager<br />\nHoward Linkoff<br />\nLaFollette voted, as newspapers preAs most of you know, no mid-year enough to participate enthusiastically<br />\nCopy and Filing Manager<br />\n\"This is a study of war, not a chance<br />\nNathaniel Soifer<br />\nyoung people in politics; and here is<br />\ngrades will be posted; all marks will in pep assemblies. It is valid for stu- for confirmed pacifists to blow off dicted last July, 8-to-7 to remove Dr.<br />\none. Boren finished his studies at<br />\nMember<br />\n1436<br />\nl937<br />\nbe discovered at once from each stu- dents also to directly challenge their steam. We have taken the precautions Frank. The eight members who voted<br />\nOklahoma A. and M. in 1932 and now,<br />\ndent's adviser on Wednesday, Februto keep thrill - hunters out of the to remove the president are all Proeducational faculties.<br />\nary 3.<br />\ncourse. Nevertheless, we have found gressives and LaFollette appointees. less than four years later, he's in ConDistributors el<br />\nWe should like to add, lest there<br />\ngress. He was doing graduate work<br />\nenough students willing to do the<br />\nThis innovation has obvious merits,<br />\nbe some mistake as to our point of<br />\nKited to the prominence of a nawork without college -credit and<br />\nand we are surprised that it was not<br />\nat the A. and M. school after being<br />\nview, that we hold no particular brief<br />\nenough teachers ready to present it in tional spectacle, the chief concern of graduated from East Central Teachinstituted long ago. To begin with, no<br />\nHe<br />\nmay<br />\nhave<br />\nfor<br />\nGlenn<br />\nFrank.<br />\nbeen<br />\n.....UNTIED POR NATIONAL ADVERTISING ST<br />\naddition to their regular work.<br />\nlonger will students be running from<br />\nthe press and the nation's educators<br />\ners' College at Ada, Oklahoma in 1929.<br />\nAdvertising Service, Inc. one bulletin board to another, and genuinely unprogressive in the non- \"The whole thing is roughly divided<br />\nwas that the action of the board and<br />\npartisan sense of the word, or he may<br />\nCollege Publishers Representative<br />\nThe young Congressman taught<br />\nusually returning several times beNEW YORK. N.Y.<br />\n420 MADISON Avg.<br />\nhave been the victim of a political into three parts: first, the nature of the procedure preceeding that action<br />\n. r.40STON . SAN FRANCISCO<br />\nschool<br />\nfor a while after finishing colfore the grade is finally obtained. No<br />\nP<br />\nLos ANGEL.*<br />\nmachine. It may be that, as the war along its various fronts—politi- were not such as to preserve freedom<br />\nmore should faculty members be disworked<br />\nfor the government,<br />\nlege,<br />\nelected representative of the people, cal, propaganda, military, economic of thought from the power of governFriday, January 22, 1937<br />\nturbed and pestered. (We say should<br />\nso<br />\non;<br />\nsecond,<br />\nof<br />\nwar<br />\nand<br />\nthe<br />\ncosts<br />\n\"Who<br />\nIs<br />\nWho In Oklahoma\"<br />\nwrote<br />\nment and to give Pres. Frank a hearGovernor LaFollette is justified in<br />\nbecause we fear that to some degree<br />\nousting as the head of a university, ----economic, cultural, eugenic; third, ing by his peers.<br />\nand devoted himself to other literary<br />\nthis will be continued anyhow). No<br />\nfor which the people pay taxes, a man the means of preserving peace as reFormal charges were made against work.<br />\nmore will sensitive \"F\" students be<br />\nwhose political philosophy does not lated to the leading causes of war.\" Dr. Frank by the regent president,<br />\nCollege students who eye the future<br />\nPhiladelphia, Pa. (ACP) — When<br />\nIt is a slow but gradual process that subjected to the ridicule of their fel- coincide with that of the majority of<br />\nbut the former's answers were as well<br />\nsuccess may<br />\ndiscussion of reproduction and the sex low students; no more will conceited the people in his state. As to the pros sports writers had finished their all- documented as the latter's charges, with hopes of 'political<br />\n\"H\" students be given the inflating<br />\npicking,<br />\nthe<br />\nUniversity<br />\nstar<br />\nof<br />\nPennBoren's career with interest.<br />\nand cons of the case we are not comproblem in general is being transbetter many observers declared. No watch<br />\npraise of their comrades.<br />\nsylvania faculty took advantage of<br />\nIt<br />\nmay<br />\nbe worthwhile to compare the<br />\njudge<br />\nat<br />\nthis<br />\ndistance.<br />\npetent<br />\nto<br />\nopinion<br />\nof<br />\nthe<br />\nmatter<br />\nwhat<br />\none's<br />\nan<br />\nto<br />\nwhispering<br />\nformed from secret<br />\nthe lull and did a little choosing on its<br />\nYes, the method is a decided imwas,<br />\nanswers<br />\none's<br />\nvercharges<br />\nand<br />\nof the baby House member<br />\ntactics<br />\ntoo,<br />\nBut<br />\npoint<br />\nis<br />\nthat<br />\nstudents,<br />\nthe<br />\nimportant<br />\nenlightened approach to an<br />\nown account--but not in the sports<br />\nprovement over the old scheme. Studict on the regents' verdict against with that of the baby Senator, Rush<br />\nshould have something to say in the<br />\nmenfield.<br />\nquestion. Taboos built about any<br />\ndents should lend their needed coopDr. Frank was usually dictated by<br />\nmatter. Granted that we are young<br />\nGiven the opportunity of voting for politics, prejudices, educational theory Holt of West Virginia.<br />\ntion of this subject are slowly dis- eration to this plan.<br />\nand immature it is nevertheless we<br />\nHolt was elected to the Senate two<br />\na mythical all-star faculty of ten or just plain personalities.<br />\nintegrating. In social centers discuswho are attending the universities and<br />\nmembers<br />\nfrom<br />\nall<br />\nthe<br />\nhistory<br />\nof<br />\nthe<br />\nyears<br />\nago when he was 29 and had to<br />\nnot the governors, boards of trustees,<br />\nThe verdict of most Madisonians<br />\nsion groups treating this topic are<br />\nworld and from any field of knowledge<br />\nmonths before he could<br />\nwait<br />\nseveral<br />\nal.<br />\nboards<br />\nor<br />\nregents,<br />\net<br />\nrailroaded<br />\nwas<br />\nthat<br />\nDr.<br />\nFrank<br />\nwas<br />\nrapidly growing up. Venereal disease<br />\nDisregarding the counsel of the<br />\nand work, faculty men and women of<br />\noffice. Soon thereafter<br />\nhis<br />\noath<br />\nof<br />\nmajortake<br />\nout<br />\njob<br />\nby<br />\na<br />\nProgressive<br />\nof<br />\nhis<br />\nNews<br />\n—Pitt<br />\nsuperstitions are being propagandized sages who claim that advice a propos<br />\nthe University Pennsylvania selected<br />\nity that would have voted as it did he went on the warpath against his<br />\nexams is useless—freshmen being too<br />\nDr. Albert Einstein, Socrates, Plato,<br />\naway.<br />\nno matter what was said during the colleague from West Virginia, SenaAristotle, Da Vinci, Shakespeare, GalThis educational process is the dumb to listen to it and other classcourse of the \"trial.\"<br />\ntor Neely, as well as various other<br />\nmen being too smart—we will give a<br />\n\"Hereafter no part of any appropri- ileo, Newton, Darwin and Pasteur.<br />\nsanest and surest way to bring the<br />\nFollowing<br />\nthe<br />\nBascom<br />\nHall<br />\nspecincluding Relief Administraofficials<br />\nDr.<br />\nliving<br />\nman<br />\nEinstein is the only<br />\nfew choice morsels, mostly for the ation for the public schools shall be<br />\ntacle and the student strike that con- tor Harry Hopkins and President<br />\ndiscussion of reproduction in its de- freshmen.<br />\nincluded.<br />\navailable for the payment of any percluded it, a movement was started to Roosevelt. Last fall he campaigned<br />\nserved open and respected position.<br />\nNew York, N.Y. (ACP)—In -order<br />\nFirst, examination period is an over- son teaching or advocating Communhave the manner of selecting univer- against the nominees of his party<br />\npressmany<br />\nof<br />\nending<br />\nthe<br />\nto deal more effectively with legal,<br />\nIt will mean<br />\nrated terror. Fear and worry are ism.\"<br />\nsity regents by gubernatorial appoint- although he was elected as a Demoing problems--both to individuals and worse than ignorance. The instructor<br />\nThis little gem of legislation could ethical, social and economic prob- ment changed to some less political crat. His tactics caused the Adminthe<br />\nmarking<br />\nless<br />\nthan<br />\nenjoys<br />\nyou<br />\ndo<br />\nwell be the product of a Hitler, a lems that confront law school stu- method. Observers close to the scene istration to strip him of his patronsociety.<br />\nthe answering. So, do not be fright- Mussolini, or any other fascist dicta- dents, the American Law Students<br />\nto<br />\nHopkins<br />\npredict that this will be a \"must age and the Senators, in resentment<br />\nWe are fortunate at the<br />\nened by this bugagoo. Take matters tor or fascistic legislature. But as a Association has been formed by stumeasure on the docket of the state against his conduct, walk out of the<br />\nbe given an opportunity to participate calmly, and think hard.<br />\nmatter of fact it is the notorious Blan- dents from six eastern law schools.<br />\nlegislature this month.<br />\nchamber When he rises to address<br />\nin an informal discussion course in<br />\nInstitutions represented are ColumDo not stay up all night or even ton rider inserted by that since-deAnother legislative possibility is them.<br />\nhuman reproduction, conducted by a to a very late hour. A clear head is feated Congressman in the 1935 Dis- bia University, New York University,<br />\nSenator Neely, reelected despite the<br />\nthat Wisconsin solons will investigate<br />\nformer student at the Hopkins who is one of the prime requisites for ex- trict of Columbia appropriations bill St. John's University and Brooklyn the \"trial\" given to Dr. Frank by the opposition of the baby Senator, broke<br />\nLaw School in New York City, and<br />\nnow a recognized authority and aminations. Dress as comfortably as to prevent the discussion of Communregents, for many of them feel that a long standing tradition when he<br />\nHarvard and Yale.<br />\nwish,<br />\nand<br />\nuse<br />\nyou<br />\nup<br />\nall<br />\nthe<br />\nblue<br />\npublic<br />\nschools<br />\nWashington<br />\nthe<br />\nism<br />\nin<br />\nthere is something \"fishy\" in the walked up to take the oath of office<br />\nscholar in this field. Dr. Alan F.<br />\nbooks you want. Analyze your inChief topic of interest for its mem- whole affair.<br />\nThe interesting effects of the rider,<br />\nwith Senator Robinson instead of the<br />\nGuttmacher, associate in Obstetrics structor as well as your course, and<br />\ncolleague from his own state. Afteraside from the storm of liberal protest bers is the economic difficulties that<br />\nMadisonians<br />\ntopic<br />\nof<br />\nfor<br />\nmany<br />\nChief<br />\nat the Medical School, possesses the write accordingly.<br />\n•aroused when the spotlight was will be barriers for them as law clerks weeks now, the \"Frank affair\" has ward Senator Neely was quoted as<br />\nrare combination of effective, enlivenLooking over past examinations is turned on it after its unnoticed pas- and young lawyers. However, no def- now boiled down to a lot of head shak- saying that he would not allow the<br />\nof<br />\nwealth<br />\nwith<br />\na<br />\nability<br />\na<br />\npositive<br />\nhelp. So are group discus- sage, are summed up in the following inite stand was taken on minimum ing and a guessing game over the youthful Holt to accompany him \"to<br />\nspeaking<br />\ning<br />\nknowledge in his field. He is the sions in certain subjects. Do not try quotation, taken from an article by wages for law clerks.<br />\nsuccessor to the first of the nation's a dog fight.\"<br />\nThe group has voted in favor of \"boy presidents.\"<br />\nHolt's antics, however idealistically<br />\nauthor of Life in the Making, a popu- to make up a whole term's work in a Ellen Thomas in the December issue<br />\ntaking \"adequate steps, in conjunctinspired, tend to discredit young peolar, authoritative, and interesting night; rather get the important ele- of Progressive Education.<br />\n\"Blue-Monday\" at Louisiana Tech<br />\nments and concentrate. Do not worry<br />\nbook on reproduction.<br />\n\"During the past year and a half, tion with bar associations, law school is more than half blue—from the ple who aspire to high office, but perhaps Boren's conduct will be such as<br />\nHome has ceased to be (if it has too much about devising systems of Russia, as seen from district school- faculties, and other legal groups, to laundryman's point of view.<br />\nto regain for young people the presever been) a means of creating a studying; each person usually has rooms, has been a blank space on the improve the economic well-being of<br />\nOf the 1,100-odd men's shirts col- tige in politics that Senator Holt has<br />\nwholesome and scientific attitude to- his own. If you want any models, map. Instruction in Russian geogra- law students, law clerks, and young<br />\neach Monday morning by the lost.<br />\nlected<br />\nwards this problem. We must look to ask the brighter students.<br />\nphy, history, government, art, music, attorneys.\"<br />\nschool's<br />\nlaundry trucks, more than<br />\nNumerous young men have brought<br />\nMembership<br />\nin<br />\nthe<br />\nassociation<br />\nis<br />\nIf possible go to a movie or any and literature has been omitted from<br />\nthe school to replace it. Various<br />\n575 are that color, ranging in shades credit to themselves and their electlimited<br />\nto<br />\nschools<br />\nin<br />\nthe<br />\nnortheastern<br />\nnotions and restrictions prevent intel- occasional recreation; it is a definite Washington's education programs.<br />\nfrom mild baby-blue to the mighty orate despite their youth. Senator<br />\nligent discussions in the high schools; mental refreshment. Get plenty of Yet during this same year and a half, area but eventually it will be extended tones of midnight-blue.<br />\nRichard B. Russell, Jr., of Georgia is<br />\nschools<br />\nin<br />\nall<br />\nparts<br />\nof<br />\nto<br />\nthe<br />\nU.S.<br />\nso it is left to the colleges to fill such restful sleep. Study in an orderly the students so protected have develUniversity of Chicago fraternity an example of this. Still in his thirties,<br />\nNew<br />\nYork,<br />\nN.Y.<br />\n(ACP)—Plans<br />\nto<br />\na role. In most cases they fail to do fashion.<br />\noped an interest in Communism never<br />\nmake drastic changes in the curricula men are going gigolo to furnish ma- he has served as speaker of his state<br />\nSO.<br />\nWhether you listen to any of this before equalled.\"<br />\nof freshmen and sophomore students terial for the newly established Es- house of representatives, governor of<br />\nUnder the auspices of the American advice or not, the best of luck to you!<br />\nIf ex-Representative Blanton read<br />\nat Columbia College have been placed cort Bureau. To quality as \"dowager- Georgia, and has just entered upon his<br />\nStudent Union, such a discussion<br />\nthe article he must have turned over<br />\nfifth year in the Senate, having been<br />\nbefore the entire faculty by the sub- thrillers\" bureau men must:<br />\ncourse will be offered. This question<br />\nin his political grave. It tells how stucommittee on curriculum, which has<br />\nBe physically presentable; have per- overwhelmingly reelected to a full<br />\nis one that affects every college students have read avidly chapters on<br />\nworked on the course-reshaping pro- sonality and an easy manner; be a term after serving four years of an<br />\nA cord of commendation is due the Russia skipped in class assignments,<br />\ndent; it is a problem that needs inject for the past year and one-half.<br />\ngentleman of the Lord Chesterfield unexpired term.<br />\nwho<br />\noverwhelmed<br />\nthe how they have attended lectures on<br />\ntelligent thinking and enlightened tankmen<br />\nCollege men and women who aspire<br />\nThe sub-committee proposes that a type; possess knowledge in at least<br />\ndiscussion to fully understand and Swarthmorth swimming team in a Communism and Communistic meetcourse in humanities, embracing the one social activity — opera, bridge, to public office may find a number of<br />\ntriumphant upset and later whipped ings, have they have devoured Commeet.<br />\nstudy of literature, philosophy, music conversation or ordering from a inspirations in the present Congress.<br />\nEveryone ought to take advantage the Lafayette squad. Shadowed by munist literature obtained by fellow and the fine arts supplant the now- menu; be a good dancer and be well<br />\nof the informal Thursday meetings, the prominence granted basketball in classmates interested in the subject required English A course.<br />\nknown on the campus.<br />\nduring an exam makes a test sweeter<br />\nthe winter sports program, the swim- by the Congressional taboo, how they<br />\nstarting February 11.<br />\nDuring the freshman year, students,<br />\nThe coeds hire more tall brunettes to take.<br />\nmers have had to blaze their path have beaten paths to the Library of<br />\nunder this proposal, would meet four than any of the other types.<br />\nDuring one of the past three-hour<br />\npractically unheralded.<br />\nCongress to read the books pro- hours weekly for lectures in literature<br />\nexams, some of the students comUpon<br />\nbeing<br />\nselected<br />\nto<br />\nconform<br />\nHandicapped by the lack of a cam- nounced dangerous by Mr. Blanton.<br />\nand philosophy and would be required<br />\nwith the woman's specifications, the plained that they were too tired to<br />\nThe Hopkins Musical Club con- pus pool and a meagre appropriation,<br />\nAs democratic Americans vitally to do reading in conjunction.<br />\nwrite at the close of the<br />\nyoung man meets her at a designated think and<br />\ncluded a busy week-end by being sin- the men who comprise the swimming interested in the preservation of acaDuring the sophomore year, stutest.<br />\ngular'sy honored in the musical world team have, by persistence and deter- demic freedom we can hardly be proud dents would be required to enroll in spot and is free to use his own name<br />\n\"I guess I'll serve tea next time,\"<br />\nwith a concert in the Maryland Cas- mination, rounded themselves into a of the Blanton rider. No study of the concurrent and unified studies of the or a fictitious one. Thereafter he is replied Prof. Weeks.<br />\nthe<br />\nthe<br />\nresponsible<br />\nfor<br />\nsuccess<br />\nof<br />\nualty series last Sunday afteroon. formidable group of natators. Their social sciences can be complete with- fine arts and music, one hour a week<br />\nAt the last exam, he and his two<br />\nevening.<br />\nSome renowned organizations have efforts are rewarded only by the satis- out a discussion .4?f the pros and cons for each subject.<br />\nassistants passed out steaming cups<br />\nThe only thing for which Earl Waspresented programs, and a high stand- faction they feel in doing a job well. 'of every major school of thought<br />\nWashington, D.C. (ACP)—Assertof tea and dozens of filled cookies.<br />\nUniard of musical quality has always<br />\nThe student body has been slow And teaching 'becomes propaga.ndiz: ing that the present football scoring serman, young instructor at the<br />\nA University of Wisconsin prankbeen adhered to. Judging from the in appreciating the value of such an ing when teachers and students are system does not always allow the best versity of Baltimore, hasn't time is a ster took it upon himself to remedy<br />\napplause and comments of the audi- activity, and miserly in contributing forbidden to discuss or study oppos- team to win, Col. E. A. Hickman, F.D.,<br />\nthe situation after ex-President Glenn<br />\nIn addition to teaching English Frank had been removed from office<br />\nence, the Hopkins group can well be to support. Few Jay rooters offer ing views on controversial subjects. United States Army, on duty as finproud of themselves.<br />\nencouragement at meets; many are William Randolph Hearst to the con- ance officer of the 3rd Corps Area, has classes at three different colleges in by an eight to seven vote of the reBaltimore, Wasserman is working for gents.<br />\nTwo other concerts were given last often unaware of these contests. trary, we believe strongly that educa- offer a new scoring method.<br />\nHe suggested that the value of the his Ph.D. at the Johns Hopkins Uniweek to spread our musical fame into Swimming teams at Hopkins have not tion in the social sciences in VV1Eu3hHe thumb-tacked a \"Man-Wanted\"<br />\nCatonsville and Annapolis, continuing always been winning teams, but they ington public schools will be unworthy touchdown and the field goal be re- versity and is making a study of the sign on the ex-president's office door.<br />\nElliott Roosevelt, the President's<br />\nan active career of the largest cam- have always been spirited, fighting of the name until the half-buried Blan- duced from six points to five and from 'Elizabethan Revival.\"<br />\nStudents of organic chemistry at son, has been appointed as a member<br />\npus activity. Many students partici- combinations, giving their best efforts. ton rider is removed from the statute three points to two respectively.<br />\nThe tankrnen merit the enthusiastic books.<br />\nCol. Hickman declared that a team Colby College who study under Prof. of the board of directors of Texas A.<br />\npate in varied departments of the<br />\n—Swarthmore Phoenix<br />\ncould earn one point for each first Lester F. Weeks have found that tea and M. College.<br />\nClub and have willingly given time support of the entire student body.<br />\n--- --$2.50<br /><br />\nRemit subi.cription fees to Treasurer, Student<br />\n.ketivities Council, Remsen flail, Postailice, Johns<br />\nHopkins University.<br /><br />\nWe think the election by-laws, recently issued by the S.A.C., on the<br />\nwhole to be apparently round principles that will go a long way to eliminating some of the past election<br />\nevils. They should prove workable,<br />\nalthough in practice we fear that a<br />\nmajor portion of unfair activity in elections will not be altered. Of course, to<br />\na great extent, this depends on the<br />\nimpartiality, courage, and strength of<br />\nthe S.A.C.<br /><br />\nsemester's<br /><br />\nA Step Forward<br /><br />\nAssociated Colleektie Press<br /><br />\nJay<br />\nLe<br />\nTo<br /><br />\nBlue (<br />\nIn<br /><br />\nJAY<br /><br />\nSavag<br /><br />\nsta<br /><br />\nThe .<br /><br />\nIisiquish<br /><br />\nConegia<br /><br />\nTuesda2<br /><br />\nthey si<br /><br />\nfast bis<br /><br />\nMary's.<br />\nglue te<br /><br />\nThus fi<br /><br />\ndroppec<br />\ntwo tr<br /><br />\nWashin<br /><br />\nColleolate Died<br /><br />\nNational<br /><br />\nNeeded Information<br /><br />\nVoice of Experience<br /><br />\nLittle Red Riding Hood<br /><br />\nAnother Winner<br /><br />\nWe Point With Pride<br /><br />\nThe<br /><br />\ndefinite<br /><br />\nfairly I<br />\nby onl<br /><br />\nthat hi<br />\nWere ai<br />\nball, a<br />\naffair,<br />\nPoints<br /><br />\nthe se<br /><br />\nscorinf<br /><br />\nThe<br />\nary fe(<br /><br />\nization<br />\nfield<br />\nhome<br />\nPoints<br /><br />\nSplit<br /><br />\ni<br /><br />\nutes o<br /><br />\nkpich<br />\nvisitor<br />\nthem<br /><br />\nin oni<br />\ntime<br /><br />\nwas n<br /><br />\nOf pla<br /><br />\nkins N<br />\nally ti<br /><br />\nAm<br />\ncomir<br />\nhis te<br />\ngame<br />\nBig I<br />\nPoint,<br />\nstarti<br />\ngYrnr<br />\ncendc<br />\njunic<br />\nNorn<br /><br />\nit a<br />\nSt;<br />\ncot<br />\ndel<br />\nBE<br />\nliop]<br />\nCrea<br />\nfern<br />\narr10<br /><br />\ntrnii<br />\nbeer<br />\nlege,<br />\nform<br />\nacts<br />\ntii<br />\nleg<br />\nforr<br />\n81gr<br /><br />\nthe<br />\nPet<br />\nmsh<br />\nson<br /><br />\nOr(<br /><br />\nI<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 22, 1937<br /><br />\nJays Relinquish<br />\nLeague Lead<br />\nTo Mount Five<br /><br />\nTEAMS<br />\nMt. St. Mary's<br />\nJohns Hopkins<br />\nW. Maryland<br />\nWashington<br />\nLoyola<br />\nSt. John's<br /><br />\nW.<br />\n3<br />\n2<br />\n1<br />\n1<br />\n0<br />\n0<br /><br />\nL.<br />\n0<br />\n1<br />\n1<br />\n2<br />\n1<br />\n2<br /><br />\nP.C.<br />\n1.000<br />\n.667<br />\n.500<br />\n.353<br />\n.000<br />\n.000<br /><br />\nJays Launch Season With Remarkable Performance; Team<br />\nLooms As Contender For Eastern Collegiate Plaque;<br />\nWeiner, Radner, Adler Brilliant<br /><br />\nNew Intramural<br />\nPlan For Frosh<br />\nIn Progress<br /><br />\nSchool Boxing Tourney<br />\nSlated To Start Feb. 25<br />\nBeginning February 25 or 26<br />\nthere will be held the second intramural boxing tournament. After<br />\nexams, Ed Lotz will offer boxing<br />\ninstruction every Friday to those<br />\nwho wish t4o be active in the tourney.<br />\nrules<br />\nRegular intercollegiate<br />\nwill be in effect for the bouts.<br />\nThree two-minute rounds are<br />\nfought and the judges must give<br />\na decision.<br />\nEight weight classes will be represented; 115, 125, 135, 145, 155,<br />\n165, 175, and Heavyweight.<br />\nLast year's champions were:<br />\n125 H. Glasser<br />\n135 J. Hoffman<br />\n145 J. Stevens<br />\nHeavyweight J. Pinsky<br /><br />\nThe intramural sports department<br />\nAvenging a stunning defeat suf- Chambliss gained first and third rehas announced a new policy of organifered last year, the Johns Hopkins spectively in the breast stroke; Lou<br />\nzation. According to Reuben Baer,<br />\nAdler nosed out the Swarthmorites in<br />\ntank team with a surprising show of<br />\nunder the new system the freshmen<br />\nthe 100.<br />\npower swamped Swarthmore under an<br />\nclass<br />\nhas been divided up intb four<br />\nBy this time Coach Hambleton's<br />\navalanche of first places, winning by<br />\ngroups of twenty five each. Each of<br />\nmeet on ice, but to put<br />\nmen<br />\nhad<br />\nthe<br />\nthe score of 51-23. It was the opening<br />\non the finishing touch, the Black and<br />\nthese groups is to compete in all<br />\ncollege meet of the season for the<br />\nBlue quartet, made up of Hill, Adler,<br />\nSavage And Apichella Outsports and is to remain a<br />\nintramural<br />\nby<br />\nperfortheir<br />\nJays, who showed<br />\nAbrahams, and Radner swamped<br />\nthe<br />\nsquad<br />\nthat<br />\nlast<br />\nSaturdey<br />\nmance<br />\nTriumph;<br />\nunit<br />\nthe four years of school.<br />\nduring<br />\nIn<br />\nstanding<br />\ntheir opponents in the 440 yard relay,<br />\nis undoubtedly the strongest to reprebeen selected for each<br />\nA<br />\nhas<br />\nleader<br />\nSiegel Shines<br />\nlast event on the program.<br />\nSwordsmen Nose Out Strong sent the University in recent years. theThe<br />\ngroup and this leader will be responsishowing of the Hopkins swimAs the Garnet, with exactly the<br />\nState Rivals At<br />\nThe Johns Hopkins hoopsters remers on the whole seems to indicate<br />\nble for the appearance of his team at<br />\nsame team, trounced Hopkins in a<br />\nanother win tomorrow night, when<br />\nlinquished their hold on the Maryland<br />\nRitchie Gym<br />\nany<br />\nscheduled event. In this way the<br />\nnot<br />\nit<br />\nin<br />\nwas<br />\n1936,<br />\nmanner<br />\nsimilar<br />\nthey swim against George WashingCollegiate Basketball League lead last<br />\nresponsibility is fixed and there will<br />\nsurprising that they left the City Colton in the latter's pool. The Jays have<br />\nTuesday night at Homewood when Sherman Leads Team With lege pool in somewhat of a daze.<br />\nbe no haphazard guessing as to<br />\nnever been defeated by their foes from<br />\nSince Swarthmore defeated Delaware,<br />\nwhether or not teams will appear to<br />\nthey succumbed to a fast-moving,<br />\nCapitol.<br />\nthe<br />\nFive Wins In Seven<br />\na perennially powerful aggregation,<br />\ncompete.<br />\nfast breaking quintet from Mount St.<br />\nThe results:<br />\nMatches<br />\nthe Black and Blue victory marks<br />\nEach group will have its own uniMary's. The final score, putting the<br />\n240-Yard Medley Relay-Won by<br />\nthem as a likely contender for the<br />\nand instead of having the men<br />\nforms,<br />\nand<br />\nHill),<br />\nBlucher,<br />\n(Weiner,<br />\nHopkins,<br />\n39-21.<br />\nwas<br />\nplace,<br />\nsecond<br />\nin<br />\nalue team<br />\nThe Blue Jay swordsmen opened plaque offered to the best team in the<br />\nthe uniforms, a dance is befor<br />\npay<br />\n45 3-5s.<br />\nThus far the Mallonee machine has the current season by eking out a Eastern Intercollegiate Association. Time, 2m,<br />\ning planned, the proceeds of which go<br />\n40-Yard Free Style-Won by Raddropped one title contest, as against 9 to 8 victory over its state rival, The Jays for many years have been<br />\nner, Hopkins; second, J. Adler, Hop- Jay Matmen Pin Opponents toward the purchase of the desired<br />\ntwo triumphs over St. John's and University of Maryland, at the Rit- a member of the organization, along kins; third, Thomas, Swarthmore,<br />\nequipment. Organization meetings<br />\nIn Five Of Eight<br />\nchie Gymnasium, last Thursday even- with such schools as Rutgers, Pittshave already been held, and the groups<br />\nWashington College respectively.<br />\nTime, 20 2-5s.<br />\nburgh, N. Y. U., Lafayette, C. C. N. Y.<br />\ning.<br />\nare now fairly compact and will be<br />\nMatches<br />\nAbraby<br />\n-Won<br />\nFree<br />\nStyle<br />\n220-Yard<br />\nMounts Lead At Half<br />\nSherman, a mainstay from last and Lehigh.<br />\nready to take part in the spring prosecond J. Adler, HopHopkins;<br />\nhams,<br />\nThe play during the first period was season's championship team, was the<br />\nTuesday night the Hopkins matmen gram.<br />\nRelay Team Wins<br />\nkins; third, Carroll, Swathmore. Time,<br />\ndefinite, exact, and the scoring was outstanding star in the Hopkins victravelled to College Park, where they<br />\nThe Hopkins began auspicously 2m, 44 1-5s.<br />\nfairly even, with the Mounts leading tory. He defeated his opponent in when the medley relay team, composDive-Won by Clavenger, Swarth- were decided victors over the Univerof his seven matches. He ed of Capt. Dan Weiner, John Blucher<br />\nbY only 6 points at the conclusion of five out<br />\nmore, second, Strong, Swarthmore.<br />\nsity of Maryland by the score of 25-11.<br />\nwon twice in the foils event, once in and Alan Hill outswam theis oppothat half. The counters at that time<br />\nRad- The Blue Jays pinned five men in<br />\nby<br />\nStyle--Won<br />\nFree<br />\n440-Yard<br />\nthe epee division, and twice again nents in an exciting finish. This seemWere arranged 17-11. Playing masterly with the saber.<br />\nner, Hopkins, second, Carroll, Swarth- the eight matches.<br />\ned to surprise the Jays, who captured<br />\nmore; third, Abrahams, Hopkins,<br />\nthe<br />\nball, and completely dominating<br />\nVernon Wins<br />\nThe Black and Blue squad will again first and second in the next two<br />\n6m, 5 3-55.<br />\nTime,<br />\n22<br />\nIn the 115 lb. class, Bob Vernon,<br />\naffair, Mount St. Mary's tossed in<br />\nengage the Maryland team on Febru- events. Zoel Radner and Louis Adler<br />\n150-Yard Back Stroke-Won by<br />\nfinished well ahead of the SwathPoints to 10 by the Hopkins array in ary 17, at Homewood.<br />\nof the Hopkins, pinned F. Lewis in<br />\nWeiner hopkins; second, Brown,<br />\nyard<br />\n40<br />\nthe<br />\nin<br />\nrepresentatives<br />\nmore<br />\nThe results:<br />\nminutes, 18 seconds. Don Hoffman,<br />\n4<br />\nthe second period to complete the<br />\nHopkins,<br />\nsprint, while Morton Abrahams led Swarthmore; third, Macgill,<br />\nFOIL<br />\nscoring for the game.<br />\nof<br />\nMaryland, lost the 126 lb. match<br />\nTime, lm, 58 1-5s.<br />\nhome Buddy Adler in the 220.<br />\nSmall, Hopkins, defeated Schulby a fall in 1 minute,<br />\nLinthicum<br />\nto<br />\nWHAT'S EATING YOU,FROSH ?<br />\nSlow Contest<br />\nby<br />\n-Won<br />\n200-Yard Breaststroke<br />\nThe runaway of the Jays was<br />\n5 to 4.<br />\n46 seconds. Sam Rosenstein added<br />\nMawhinney,<br />\nThe fray started with the custom- bridge,<br />\nsecond,<br />\nHopkins;<br />\nBlucher,<br />\nabruptly halted here when the Garnet<br />\nscore<br />\nSherman, Hopkins, defeated Ellison,<br />\nChambliss, Hop- another match to the Hopkins<br />\nary feeling-out process by both organautomatically received first and sec- Swarthmore; third,<br />\nwhen he put R. Porter's shoulders to<br />\n5 to 2.<br />\n2-5s.<br />\n22<br />\n2m,<br />\nTime,<br />\nond in the dive, both of the Hopkins kins,<br />\nizations, wit,h Melvin putting away a<br />\nthe floor in the 135 lb. class.<br />\nAbrams, Maryland, defeated Star320-Yard Relay-Won by Hopkins,<br />\ndivers being absent.<br />\nfield goal to give first blood to the ling, 5 to 4.<br />\nDue to injuries received in the Hop(Hill, J. Adler, Abrahams and RadWeiner Wins<br />\nborne team. After a see-sawing of<br />\nBra.nda, Maryland, defeated Sherburg match last week,<br />\nkins-Gettys<br />\nner). Time, 3m. 13 1-15s.<br />\nto<br />\nback<br />\ncame<br />\nhowever,<br />\nRadner,<br />\n3.<br />\nto<br />\n9-9<br />\n5<br />\nman,<br />\na<br />\nthe regular 145 lb. class<br />\nKatz,<br />\nshowed<br />\nLink<br />\nbook<br />\nscorer's<br />\nthe<br />\nPoints<br />\n100-Yard Free Style--Won by J. Mentor, was unable to participate in<br />\nscore his second triumph in the 440<br />\nPeralto,<br />\ndefeated<br />\nHopkins,<br />\nReed,<br />\nminfive<br />\nabout<br />\nwith<br />\n8Plit in honors<br />\nsecond, Thomas,<br />\nYOU GOTTA LEARN HOW TO STUDY,Alsit<br />\nyard grind, and the stream of vic- Adler, Hopkins;<br />\nthe meet. After much difficulty a<br />\nlates of the second quarter remaining. 5 to 4.<br />\nStone, Swarththird,<br />\nSwarthmore;<br />\nGET YOUR PIPE,RELAX WITH<br />\nthe<br />\nwon<br />\nWeiner<br />\nagain.<br />\nbegan<br />\ntories<br />\nof<br />\nperson<br />\nthe<br />\nin<br />\nfound<br />\nwas<br />\nsubstitute<br />\nLandon, Maryland, defeated Small,<br />\nA LOAD OF EDGE WORTH JR.<br />\n3-5s.<br />\nAPichilla and Savage then led the<br />\n150 yard back stroke; Blucher and more, Time, 1<br />\nformer New England<br />\nO'Keefe,<br />\nArty<br />\nvisitors on a scoring spree that netted 5 to 3.<br />\nScholastic 135 lb. Wrestling Champ.<br />\nSherman, Hopkins, defeated Schulthem 8 points while the Jays swished<br />\nHe wrestled Edward in the 145 lb.<br />\n3.<br />\nto<br />\n5<br />\nIn only one field goal to give the half- bridge,<br />\nand lost by a 5 minute and 40<br />\nclass<br />\nEllison, Maryland, defeated Reed,<br />\nUtile set-up at 17-11. Mt. St. Mary's<br />\ntime advantage, only after an<br />\nsecond<br />\nwas never headed in the next section 5 to 3.<br />\nexcellent struggle.<br />\nEPEE<br />\nof play and scored confidently. HopEd Clautice won the 155 lb. class<br />\nSAY,THATS ONE<br />\nSherman, Hopkins, defeated Abrams<br />\nkins was only able to click sporadicby default and wrestled an exmatch<br />\nSMOOTH SMOKE!<br />\n2 to 1.<br />\nally to keep up the pace.<br />\nTome<br />\nFive Triumph Over Towson;<br />\nFrosh<br />\nGives<br />\nPace<br />\nEarly<br />\nhibition match with C. Watson, of<br />\nSherdefeated<br />\nMaryland,<br />\nSchwartz,<br />\nAmong other things: Herb Siegel<br />\nCollege Park. Charles Barnett, the<br />\nRallies In Last Half To Overcome Jay<br />\ncorning from a sick bed to try to help man, 2 to 1.<br />\nBlue Jay Captain, dropped the 165 lb.<br />\nDavis,<br />\ndefeated<br />\nMaryland,<br />\nSchwartz,<br />\nhis team-mates ... Turning in a sweet<br />\nLead And Win<br />\nmatch to Isriel Leiter on a time adgame for a 'sick' man, he led the 2 to 1.<br />\nof 4 minutes, 20 seconds. F.<br />\nYOU BET! THAT'S<br />\nvantage<br />\nRoth,<br />\nThaler,<br />\ndefeated<br />\nBumbel, Maryland,<br />\naig Blue squad with a total of nine<br />\nCoach Frank Dotterweich swung saw action were Brayshaw,<br />\nWHY ITS CALLED THE COLLEGE<br />\nLawson won the third match for the<br />\nFreyer,<br />\nLitowitz,<br />\nAlmquist,<br />\n1.<br />\nButt,<br />\nto<br />\n2<br />\nPoints . . . The spirit of the crowd,<br />\nMAN'S SMOKE !*<br />\nhis squad of freshmen ibasketeers into<br />\nTerrapins by throwing Tom Brown in<br />\nSABRE<br />\n*MILD DOWN 44<br />\n•<br />\nstarting its own cheers to swell the<br />\naction this past week against two of Thaynor, and McGovern.<br />\nheavyweight<br />\nThe<br />\nthe 175 lb. class.<br />\nTO THE HEEL<br />\nStarling, Maryland, defeated Peel, the leading local schoolboy quintets.<br />\nThe box scores:<br />\ng'ymnasium with ever-increasing cresmatch was won by Bill Lamble when<br />\nTOME<br />\ncendo . . • The 14-12 triumph of the 5 to 3.<br />\nAgainst Towson High School, the<br />\npinned Douglas McChemsey of the<br />\nhe<br />\nT.<br />\nFarleat,<br />\nF.<br />\nG.<br />\ndefeated<br />\nPeel, Hopkins,<br />\nJUnior Varsity over that of Towson<br />\nFrosh were triumphant; but against<br />\nUniversity of Maryland.<br />\n0<br />\n0<br />\n0<br />\n150<br />\n4.<br />\nAnderson,f<br />\nbattle.<br />\nto<br />\npitcher's<br />\n5<br />\nA<br />\nfound<br />\nNormal . . .<br />\nthe Tome outfit the Jay Frosh<br />\nA TIN<br />\n0 0<br />\n0<br />\nISherman, Hopkins, defeated Star- themselves at the lower end of a Reid, f<br />\nHOPKINS FRESHMEN<br />\n7<br />\n1<br />\n3<br />\nf<br />\nling, 5 to 3.<br />\nDehner,<br />\n21-16 score.<br />\nG. F. T.<br />\n2<br />\n0<br />\n1<br />\nSherman, Hopkins, defeated FarRobinson, f<br />\nEarly Lead<br />\n4<br />\n0-0<br />\n2<br />\nf<br />\nBrayshaw,<br />\n2<br />\n0<br />\n1<br />\nleat, 5 to 2.<br />\nAt Towson, an early scoring attack Murphy, c<br />\n2<br />\n1 0-0<br />\nf<br />\nWhitelock,<br />\n0<br />\n0<br />\n0<br />\ng<br />\nMiller,<br />\nschoolthe<br />\n0<br />\nproved the downfall of<br />\n2<br />\n0-0<br />\n1<br />\n9<br />\nf<br />\nMcGovern,<br />\n8<br />\n3<br />\nboys. The yearlings bombarded the McDivitt, g<br />\n8<br />\n4 0-0<br />\n0 2 Thaler, c<br />\n1<br />\ncords for 22 points &amp;ding the first Kaighen, g<br />\n4<br />\n.. 2 0-0<br />\n- Almquist, g<br />\nvic28-26<br />\na<br />\nLadinto<br />\nStudent<br />\nGrad<br />\ncoasted<br />\nCollege,<br />\nstanza and<br />\n8<br />\n4 0-0<br />\n3 21 Litowitz, g<br />\n9<br />\nTotals<br />\ntory.<br />\nders To Help Select Official<br />\nHOPKINS FRESHMEN<br />\nRecovering from the early bomSo much has been said, of late, con14 0-0 28<br />\nTotals<br />\nG. F. T.<br />\nBlue Jay Team<br />\nstarted<br />\nlads<br />\nTowson<br />\nthe<br />\nbardment,<br />\ngainof<br />\ncerning The Hopkins' chances<br />\nHIGH<br />\nTOWSON<br />\n6<br />\n2<br />\n2<br />\nf<br />\nBrayshaw,<br />\nduring the leadership in the Maryland finding the loop with consistency<br />\nG. F. T.<br />\n1 0 2<br />\nBadminton, the newest sport on the<br />\nf<br />\nLeague, that very little ing the last two quarters. However, Thaler,<br />\nIntercollegiate<br />\n2<br />\n1 0-1<br />\nf<br />\nHeld,<br />\n2<br />\n0<br />\nRopkins campus, showed its ever-in1<br />\nf<br />\nButt,<br />\nhas been given to the efforts the Hopkins Frosh clung to its lead<br />\n6<br />\n3 0-1<br />\nJacobson, f<br />\ncreasing popularity this week in the attention<br />\n1<br />\n1<br />\n0<br />\nf<br />\nAlmquist,<br />\nadvances<br />\nenemy<br />\nall<br />\nVarsity quintet. While and frustrated<br />\n3<br />\n1 1-1<br />\nform of an elimination tournament of the Junior<br />\n2 Carr, c<br />\n0 2<br />\nLitowitz, g<br />\nhave rolled along with amazing defensive tactics.<br />\nteams<br />\nVarsity<br />\nthe<br />\n5<br />\n1 3-4<br />\ng<br />\nRebaugh,<br />\n0<br />\n0<br />\namong all those connected with the<br />\n0<br />\ng<br />\nFreyer,<br />\nup<br />\nrang<br />\nThaler and Litowitz each<br />\nlosing games in a none8<br />\n4 0-1<br />\nUniversity. Five ladders have already winning and<br />\n1 Canavan, g<br />\n1<br />\n0<br />\nCoach Ed four baskets to lead the offensive. Thaynor, c<br />\nfashion,<br />\nevastating<br />\ntoo-d<br />\n2<br />\n1 0-0<br />\ng<br />\nBranard,<br />\nbeen composed, with the various col2<br />\n0<br />\n1<br />\nc<br />\nMcGovern,<br />\nbeen compiling Almquist and Brayshaw both turned<br />\n-leges, and graduate student bodies Lotz's charges have<br />\nIN YOUR COLLEGE COLORS<br />\nin excellent general court perforrecord.<br />\n11 4-8 26<br />\nforming the different divisions. The a really noteworthy<br />\nTotals<br />\nWe make this amazing offer<br />\n16<br />\n6<br />\n5<br />\nTotals<br />\nmances. At other moments Whitelock<br />\nVarsity understudies have won ten<br />\nof a $1.00 English Type<br />\nactual eliminations will not start unbrilof<br />\ntraces<br />\nrevealed<br />\nand McGovern<br />\nFoisting Pouch in Rep Cloth<br />\ntil after the examination period, giv- games in a row, eight in the latter<br />\nliance.<br />\nwith Rubberized Liner for<br />\nthis<br />\nof<br />\nboth<br />\nand<br />\nyear,<br />\nlast<br />\nof<br />\nthis<br />\npart<br />\nnovel<br />\nin<br />\ninterested<br />\ning all those<br />\nTome Leads<br />\nonly 10¢ and one wrapper<br />\nform of exercise an opportunity to season's only engagements. Having<br />\nto persuade you to try EdgeMatching shot for shot, the Jay<br />\nSign up for a new ladder. Winners in routed the Junior Varsities of State<br />\nworth Jr. Send the inside<br />\ncourtTome<br />\nthe<br />\nwith<br />\npace<br />\nkept<br />\nFrosh<br />\nthe separate groupings will then com- Teachers College and St. John's, the<br />\nwhite paraffin wrapper and<br />\nwent<br />\nhalf<br />\nand<br />\nfirst<br />\nmen for the entire<br />\nPete for the championship of the wearers of the Blue(figuratively<br />\nyour dime together with<br />\nleading<br />\nintermission<br />\nthe<br />\nduring<br />\nout<br />\nthe youpon (or print your<br />\nschool. The runner-ups will join their speaking, for their uniforms are<br />\ncords<br />\n12-11. With McDivitt hitting the<br />\nname, college and address<br />\nconquerors and an official Hopkins white) are looking forward to the five<br />\nall angles, the high-schoolers<br />\nthe wrapper)-and we<br />\non<br />\nso<br />\nmuch<br />\nat<br />\nhalf<br />\nHutzler's<br />\nit<br />\nwhere<br />\nthey<br />\ndon't<br />\nmind<br />\nus<br />\ntell<br />\n8adm1nton team will thus be formed. remaining contests on their schedule. from<br />\nthey<br />\nBut<br />\nstanlast<br />\nthe<br />\nduring<br />\nsend your pouch. Only<br />\nwill<br />\nfore<br />\nthe<br />\nto<br />\nwent<br />\nThe entire schedule consists of home<br />\none to a customer.<br />\nza and won the contest 21-16.<br />\nJohn's,<br />\nSt.<br />\nseries<br />\nwith<br />\nhome<br />\nand<br />\nRifle Team Scores<br />\nCoach Dotterweich used most of<br />\nWhat you want is easy to find.<br />\nTowson Teachers, Loyola, and WestSPECIAL<br />\nhis squad in an effort to check the<br />\nWin Over Georgetown ern Maryland.<br />\nYou get efficient service.<br />\nOFFER<br />\nenemy's barrage of points. Those who<br />\nare<br />\nreasonable.<br />\nPrices<br />\nShooting with astounding accuracy<br />\nCharles Lander, Prop.<br />\nthe Johns Hopkins rifle team once<br />\nHair Cutting, 40c<br />\nMN MI MI MI NM 111=1<br />\nBOULEVARD BARBER SHOP<br />\nagain proved superior to the Georged, Va.<br />\nLams &amp; Bro. Co., Rich<br />\nStreet<br />\n33rd<br />\nOn<br />\nEnclosed find 10t and one inside white<br />\ntown aggregation. The score of the<br />\nStreets<br />\nCalvert<br />\ntin<br />\nEdgeworth<br />\nof<br />\n•<br />\nparaffin wrapper fr<br />\nBetween St. Paul And<br />\nVictory was 1,283 to 1,249. Lewis,<br />\nSaturday<br />\nJr., for which send Inc 8E00 value<br />\nWeek Days<br />\nstar of the Hoya squad was high 8 A.M. To 7.30 P.M. 8 A.M. To 9 P.M.<br />\ntobacco pouch in my college colors. Hewn.<br />\nprint.)<br />\nPoint scorer in the match with 276<br /><br />\nBlue Quintet Far Off Form<br />\nIn Defeat By Superior<br />\nSaints<br /><br />\nJAYS NOW<br /><br />\nci<br /><br />\nNatators Show Surging Power<br />\nIn SwampingSwarthmore51-23<br /><br />\nMaryland Intercollegiate<br />\nLeague Standings<br /><br />\nBlue Jay Fencers<br />\nSECOND Eke Out 9 to 8 Win<br />\nOver Terp Combine<br /><br />\nGrapplers Trim<br />\nU. of Maryland<br />\nBy 25-11 Score<br /><br />\nFreshmen Basketeers Trim<br />\nTowson High; Lose To Tome<br /><br />\nBadminton Play<br />\nStarts After Exams<br /><br />\nJunior Varsity Five<br />\nHas Fine Record<br /><br />\nWRAPPER AND<br />\n11Y GET THIS<br />\n$1.22 POUCH<br /><br />\nIN&amp;<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br /><br />\nJay.<br /><br />\nHUTZLER BitiliM<br /><br />\nNam<br /><br />\nNEW YORK LOAN OFFICE<br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\ninstruments, slide rules.<br /><br />\n118<br />\nlar<br /><br />\nNorth Liberty Street<br /><br />\n1<br /><br />\nPlaza 3495<br /><br />\nLUSCO'S<br />\nLocated at the North End Basement of<br />\nLevering Hall, for the convenience of the<br />\nstudent body and faculty.<br />\nHOURS-9 to 5 P.M.<br /><br />\nCAMPUS BARBER SHOP<br /><br />\nFor Your<br />\nLiquors<br /><br />\nSeeHARRY<br />\n3113 GREENMOUNT AVE.<br />\nPhone UN. 4883<br />\nFor Delivery<br />\n•••••••••••11,11.....<br /><br />\nAddress<br /><br />\nCity<br /><br />\n-%de<br /><br />\nOilir good for only 30 days<br />\nMIN MB MEI OM INN =I WO IMO<br /><br />\nI<br /><br />\n4<br /><br />\nHOMEWOOD, BALTIMORE,<br /><br />\nElectrical Dept. Students Recruited<br />\nSet For Engineering From Their Beds<br />\nShow In February To Hear Debate<br />\nCelebration To Be Held In Correspondent Relates How<br />\nHonor Of Twenty-Fifth<br />\nHopkins Team Entertains<br />\nAnniversary Of School<br />\nImprovised Audiences<br />\n(Continued from Page 1, Col. 2)<br />\nphane balloon which rises in the air<br />\nis also included in the apparatus.<br />\nIt contains a radio apparatus which<br /><br />\nFuture Debates To Be Held<br />\nIn Levering; Publicity<br />\nIs Needed<br /><br />\nsignals down readings of pressure and<br /><br />\nNE'<br /><br />\n:-:<br /><br />\nAround The Colleges<br /><br />\nIn Chicago, Miami University's Dr.<br />\nRead Bain told the American Sociological Society that state legislatures<br />\nshould be made into single houses and<br />\nshould appoint state managers to run<br />\nour commenwealths.<br />\nIn Providence, R.I., Prof. C. H. McDwain of Harvard charged the assembled members of the American<br />\nHistorical Association with allowing<br />\ntheir work to edge too close to the<br />\nborders of romance, and called them<br />\nback from their self-imposed task of<br />\nrewriting history to bring it into line<br />\nwith modern modes of thought and<br />\naction.<br /><br />\n(Continued from Page 1, Col. 3)<br />\nother such observations. When the the events. A small notice posted on a<br />\nIn Cincinnati, Dr. Francis P. Shepballoon reaches a certain height, it The boys on the team, while for great- ard,<br />\nUniversity of Illinois, described<br />\nbreaks open due to the pressure of the er part are raw men, have the ability to the convention of Geological, Minexpanding gas on the inside. At this of trained and experienced debaters. eralogical and Paleontological Socipoint the radio apparatus begins to bulletin board is not sufficient to rouse eties of America an oil field under the<br />\nGulf of Mexico that rivals the great<br />\nfall, but suddenly a parachute opens interest in an activity like debating.<br />\nfields of Texas in richness.<br />\nup and carries it to safety.<br />\nThe question to bed ebated for the<br />\nIn Williamsburg, Va., New York<br />\nIn the undergraduate laboratories current year is \"Resolved: that ConUniversity's Dr. Carleton Brown,<br />\nthe regular experiments as perfected gress be empowered to make legisla- speaking before the Modern<br />\nLanguage<br />\nby the students will tie shown. The tion for minimum wages and maxi- Association of America, made a sharp<br />\noperation of direct current generators mum hours in industry,\"--one which attack on what he called efforts to<br />\ntear down established teaching methand motors, speed regulation by the is of importance and particular releods, on which, he said, \"the foreign<br />\nWard-Leonard system, testing of rail- vance to the times.<br />\nlabel is easily discernible.\"<br />\nway motors, synchronizing of alterFuture debates are to be held in<br />\nIn Atlantic City, Miss Pearl Gardnating current generators, demonstra- Levering Hall. With a little extra pub- near, Cornell University agriculturtion of a new type of variable speed licity instead of the strong-arm tact- alist, reported that after five years of<br />\ninduction motor, synchronous motor ics used in the past, audiences will experimentation she had determined<br />\noperating and calibration of different be considerably increased in size; that the cow is more intelligent than<br />\nthe horse.<br />\ntypes of meters, are all included<br />\nwith the passing of the weeks, deAnd that all of the scientific reports<br />\namong these experiments.<br />\nbates will become more interesting added to the \"cow sense\" of the world,<br />\nIn the field of radio fundamental<br />\nnot the \"horse sense.\"<br />\nexperiments will demonstrate various and the debaters more experienced.<br />\nfunctions of radio circuits, and typical<br />\nradio measurements, such as percentage of modulations. Various exhibits<br />\nin the field of illumination will show<br />\nthe measurement of candle power of<br />\nlamps, and the method and instruments for measurement of general illuminators. The electrical measurements laboratory will present a display of old and new types of standard<br />\nelectrical measuring devices.<br />\nThe Electrical Engineering Research Laboratories will have in operation on display the actual apparatus which is being used for investiga-<br /><br />\ntion on high voltage cables. Oxidation<br />\nin insulating oils and insulating papers will be shown, and the methods<br />\nof testing will be exhibited. Moreover,<br />\na new electrical method of testing<br />\nWells will be demonstrated.<br /><br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br /><br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nWASHINGTON'S<br /><br />\n1<br />\nINE flavor is only<br />\nhalf the story ...<br />\nthere is, in National<br />\nBeer, the deep<br />\ndown wholesomeness of extra costly<br />\ningredients. ....<br /><br />\nF<br /><br />\nLapel Watch<br />\nPhysics Lab On Monday<br />\nReward<br />\nBox 1053<br /><br />\nJ. H. FURST CO.<br /><br />\n:-:<br /><br />\nNew York City—When it comes to<br />\n\"What is the difference between<br />\nmaking speeches, the college athlet- payment and non-payment of a colic coaches and directors take all<br />\nlege athlete so long as he keeps his<br />\nprizes.<br />\nscholastic work up to the proper<br />\nAt their annual conclave here a<br />\nstandard and conducts himself like<br />\ncouple of weeks ago they broke the<br />\nsilence that characterize them during a gentleman,\" he said.<br />\nDr. J. N. Nichols, director of athplaying days and harangued on a lot<br />\nof things that have been bothering letics at Oberlin College, suggested<br />\ncoaches, fans and players for a long professionalism<br />\nfor small colleges but<br />\ntime, and then held several roasting<br />\nalong a different route. The chief<br />\nsessions that did not exclude the fellow that foots the bill for it all, the points in his program are: the elimination of gate receipts; the financing<br />\nfan.<br />\nof<br />\nathletics in the same way in which<br />\nAfter hotel janitors had started to<br />\nclean up after the final sessions of other college activities are financed;<br />\nthe conventions of the National Col- the abolition of leagues and conferlegiate Association and the American ences; the matching<br />\nof schools of the<br />\nFootball Coaches Association, dele- same size; the establishmen<br />\nt of<br />\ngates sat down to rest and recount coaches on a full time basis<br />\nand the<br />\nhighlights of the meetings. Here's simplification of eligibility<br />\nrules.<br />\ntheir summary:<br />\nIn Tuscaloosa, Alabama, the meetAt the opening meeting of the N.C. ing of the Southeastern Conference<br />\nCA., Dr. William L. Hughes, associ- baried movies for scounting and inlate profesor of physical education, structional purposes and vetoed a proColumbia University, suggested open posal that each member of the conpayment of college footballs in order ference should have to play at least<br />\nto end \"hypocrisy.\"<br />\nfive intra-league games a season.<br /><br />\nL 0 S T ...<br /><br />\nBirely's Pharmacy<br /><br />\nUnexcelled Fountain Service<br /><br />\nJANUARY 22, 1937<br /><br />\nBIRTHDAY<br />\nWill Find<br /><br />\nHAL KEIVIP<br />\nAt The<br /><br />\nLord Baltimore<br /><br />\nMow<br />\nTo'<br />\nPATRONIZE<br />\nTFIE SECOND COTILLION<br /><br />\n1. 0.?<br />\nDo you Fall for so-called \"giveaway ,prices in so-called\"clearance<br />\nsales?' Or do you insist on<br />\nGOOD Clothes at a generous but<br />\nGENUINE discount? Here's the<br />\nanswer (don't look.)<br /><br />\nOppc<br />\nI A'<br /><br />\nMelv<br />\nSiege<br />\nCross<br />\nZheu<br />\nRasir<br /><br />\nThe<br />\n14]inmit<br />\nto ha<br />\nMary':<br />\nOf the<br />\nare nc<br />\nMaryll<br />\nLea.gui<br /><br />\nDistinguished (Ready-to-wear)<br />\nSuits, Topcoats &amp; Overcoats at The<br />\nthe<br />\n$35. to S80. Clothes Reduced • Univet<br /><br />\n$26.25 to $60<br />\n&amp; Son<br />\nEast Lexington St.<br /><br />\nBrewing Co.<br /><br />\nNo. 3-B<br /><br />\nBALTIMORE. MO.<br /><br />\n....<br /><br />\nBLUI<br /><br />\nWHAT'S YOUR<br /><br />\nJos. Schloss<br />\nThe Natioi<br /><br />\nVOL.<br />\nBit!<br />\nMe<br />\nQu<br /><br />\n• ......<br /><br />\n(nowhere else)<br /><br />\nfew sl<br /><br />\nnot, h(<br />\ning<br /><br />\nof<br /><br />\nWit]<br />\nWorrie<br />\nquint<br />\nbest a<br />\nstiffiei(<br />\nthan<br />\nhave<br />\ndicatic<br />\nLas<br />\nrnen r<br />\nsonud<br />\nthat ,<br />\nComp<br /><br />\n•<br /><br />\nNAY NAY LAD<br />\nYE CANNA GIE ME THOSE<br />\nILL BUY MY OWN KIND<br />\nI KEN WHAT THEY DO...<br /><br />\nterto<br />\nhands<br />\nthat<br />\n/nate'<br />\nSh<br />\neente<br />\nOf tr<br />\nand<br />\nberth<br />\nThe f<br />\nby th<br />\ndribb'<br />\nThi<br />\nhardy<br />\nrathe<br />\nbeter<br />\ntack.<br />\nTh<br />\nto ir<br />\nRoo<br />\nto pi<br />\nfight<br />\nAp<br />\nStay<br /><br />\nhe is<br />\nella<br />\nscori<br />\nProvi<br />\nthe<br />\nhard<br />\nIli NA,<br />\nnedy<br />\ncorn]<br />\nTi<br />\nMar,<br /><br />\nGl<br />\nN(<br /><br />\nFir<br /><br />\nAla<br />\nOb<br /><br />\nWhen smokers find out the good things<br />\nthat Chesterfields give them<br /><br />\nede<br /><br />\nteal<br />\nGill<br />\nThE<br />\nis<br />\n°ha<br /><br />\nUn<br />\nVitr<br /><br />\nin<br />\n'gr<br /><br />\na. d<br />\nhui<br />\nha.!<br />\nco/<br /><br />"}], "field_media_file": [{"target_id": 39072, "display": null, "description": null, "target_type": "file", "target_uuid": "35fe995d-3e6b-473d-82c6-b9e14ec0fb68", "url": "http://digital.library.jhu.edu/system/files/2022-03/12748-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12748, "target_type": "node", "target_uuid": "890e71f3-f804-42d9-bb2d-f1acd6a0a10d", "url": "/node/12748"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "446aff55-1c66-4ee4-bd1e-9376f6a036c3"}]}