{"mid": [{"value": 39300}], "uuid": [{"value": "4946b77d-9aad-444d-893e-3f5dd854e3d5"}], "vid": [{"value": 39300}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:27:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13910-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:27:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:27:06+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "elpt<br />\nVOL. LXXI, NO. 5<br />\n<br />\nNano<br />\n<br />\n414.fttgr<br />\n71ST YEAR<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, OCTOBER 28, 1966<br />\n<br />\nMahoney Ignored<br />\nBy Organization<br />\n<br />\nL<br />\n<br />\nBy WILLIAM FATTEN<br />\nGeorge Mahoney is no newcomer to politics. In the<br />\npast sixteen years he has made six attempts to gain<br />\npublic office. His only conquest has been a seat on<br />\nthe Maryland State Racing Commission, held in the<br />\n1.940's. A curiosity in the present election, (Mahoney's<br />\nSeventh), is that a man so enveloped by politics should<br />\napparently lack an entourage of committed supporters.<br />\ntIowhem can we find the \"Mahoney organization\", the<br />\n*Mahoney men\". His headquarters lack the starryeyed young girls folding letters and answering the<br />\nphone (it seldom rings). The billboard and bumper<br />\nSticker advertisements are sparse. Testimonial banquets,<br />\ntelevision appearances and rallies have been confined<br />\nto the Republicans.<br />\nMahoney claims that he isn't running against another<br />\ncandidate but against the present condition \"of things\".<br />\nTherefore he needs no political alliances or wham-bha.m<br />\nCampaigns.\"The great body politic knows where George<br />\n„Mahoney stands.\" One must wonder whether this is the<br />\nCase or was Mahoney left to fend for himself by the<br />\nembarrassed political chieftains.<br />\nControls Districts<br />\nThe most powerful political \"boss\" In Baltimore is<br />\ndames H. (Jack) Pollack. His \"Trenton Democratic<br />\nClub\" controls the Fourth and Fifth Districts in Baltimore City, and branches occasionally into contested<br />\nterritory. He has manipulated elections, the Baltimore<br />\nCity Council and an occasional judge for three decades.<br />\nFor two decades George Mahoney and Jack Pollack<br />\nMillard<br />\nhave been close political allies united against<br />\nundesirable<br />\nMahoney<br />\nmade<br />\noften<br />\nunion<br />\nTawes. This<br />\nHyman Pressin the eyes of political \"moralists\" like<br />\neffective<br />\nman but Pollack's support was a coveted and<br />\nprize.<br />\nseems<br />\nPollack's participation in the present campaign<br />\nof some hankyto be minimal. There have been reports<br />\nPollack<br />\npanky in the primary but it doesn't seem that<br />\nit.<br />\nin<br />\nheart<br />\nhis<br />\nhas<br />\nPollack's<br />\nMahoney might rightfully feel cheated bydistributed<br />\nsupport. As yet no sample ballots have been<br />\nthere's reasonin the Fourth and Fifth Districts and<br />\nPollack is<br />\nable doubt Mahoney would head them. If<br />\nthe<br />\nspending money today like he did in 1958 when<br />\nthis<br />\ndoes<br />\nit<br />\n(as<br />\nMaryland<br />\nignoring<br />\nflational party was<br />\nfar Marear), then it isn't evident to the public. So<br />\nfinanced from<br />\nhoney's campaign could easily have been<br />\nhis own pocket.<br />\nPollack Hesitant<br />\npossibilities<br />\nWhy would Pollack be so hesitant? Two<br />\nDemocratic<br />\nTrenton<br />\nthe<br />\ncomprising<br />\ndistricts<br />\narise. The<br />\nJews<br />\nClub are dominated by Negroes (the Fourth) and<br />\n.(the Fifth). Pollack would have to spend a lot of<br />\nfavors within his own family to whip up support for<br />\nMahoney and his crusade against open-occupancy.<br />\nThe second reason, related to the first, is that Pollack's power source is declining rapidly. Not only is he<br />\nhesitant to exhaust it, but it is possible that his next<br />\nmistake will be his last and Mahoney offers little security. Attorney-General Finan has labeled Mahoney's<br />\ncampaign \"Pollack's last stand.\"<br />\nWith the figureheads of the Democratic party (Tydtngs, Brewster, Tawes, Sickles) avoiding Mahoney. the<br />\ntack of organiZational support •leaves the Democratic<br />\nnominee one alternative—the people. There is no need<br />\ntor Mahoney to energetically campaign if the people<br />\nalrady know (in their hearts?) that he is right. He<br />\ndoesn't have to discuss the issues, confront his opponents or spend a lot of money.<br />\nOn the other hand, with a glaring absence of supporters. did he ever have the choice?<br />\n<br />\npLuRYING. IN THE MAT<br />\n<br />\nSPIRO T. AGNEW<br />\n<br />\nGEORGE P. MAHONEY<br />\n<br />\nGroup Formed To Stop Mahoney;<br />\nSeeks Volunteers From Hopkins<br />\nBy DENN-I ESTIS<br />\n\"Democrats may have nominated for Governor one<br />\nof the worst racist bigots in the history of Maryland<br />\npolitics.\" This opinion was expressed by James Reston,<br />\nveteran New York Times columnist, in his description<br />\nthe Democratic candidate for governor, George P. Mahoney, on October 9.<br />\nSimilar statements have been echoed by many diverse national organizations including the Americans<br />\nfor Democratic Action, The New Republic, The Washington Post, and the New York Tines.<br />\nTowson State Demonstrations<br />\nSpurred on by recent racist demonstrations held by<br />\nthe National States Rights Party and the Klu Klux<br />\nKlan at Towson State College in support of Mr. Mahoney, several concerned Johns Hopkins University<br />\ngraduate studentsDemocrats, Republicans, and Independents—deciding that a Mahoney win was a distinct<br />\npossibility, formed an independent organization devoid<br />\nof the Republican and Democratic partisanship called<br />\nthe Citizens To Stop Mahoney.<br />\nThe new group's philosophy is to get every possible<br />\nvoter out in a last determined move. William Dobelle,<br />\na Hopkins graduate student in the biophysics department and coordinator of the organization, said that<br />\n\"If there's a vote left, let's get it!\"<br />\nHopkins Students Needed<br />\nThe Stop Mahoney group, in hoping to maintain a<br />\none week sustained campaign, desires to enlist the help<br />\nof many Hopkins students in this fight. They are in<br />\nneed of \"warm bodies and willing workers,\" who will<br />\nachieve their three fold purpose.<br />\nFirst, the group mebers are attempting to get the<br />\nvote out in the City of Baltimore for Spiro T. Agnew,<br />\nRepublican candidate for governor, pointing out the<br />\nfact that Carlton Sickles had been defeated by Mahoney in the primary by some 2,000 votes, or one vote<br />\nper Maryland precinct.<br />\nToo Late For Nine Changing<br />\nSecondly, the Stop Mahoney group realizes as Dobelle<br />\nsays that \"it is too late to start changing peoples'<br />\nminds. We are not planning to get anyone who plans to<br />\nvote for Mahoney to vote for Agnew. No time remains<br />\n1,0 go around changing peoples' minds.\" Instead they<br />\nare concern.ecl with running an all out effort designed<br />\nespecially at 'those districts in the city where voting<br />\nwas light during the primary and where many individuals, especially in the Negro population misinterpreted Mr. Mahoney's slogan that \"Your Home Is Your<br />\nCastle.\"<br />\nThirdly, the group hopes to incite an interest for<br />\nAgnew among Independent Gubernatorial candidate<br />\nHyman Pressman's supporters, hoping to make them<br />\nrealize the dangers which will result in the event of a<br />\nsplit vote including the possibility of a Mahoney victory with less than a voting majority.<br />\n<br />\nThe organization is urging that all interested persons<br />\nattend a special volunteers' meeting at the Charles<br />\nTheatre, 1711 N. Charles Street, on Saturday, October<br />\n29 at 10:00 P.M. Hopkins students are particularly encouraged as the results of this election will have definite<br />\neffects on the nation especially in the area of human<br />\nrights and politics. Among the various jobs to be performed include the canvassing of precincts—on and<br />\nbefore election day—making telephone calls, and working in the group's main headquarters at 25th Street<br />\nand Maryland Avenue.<br />\nThe bipartisan Agnew supporters _decided to support<br />\nthe Republican candidate over Mr. Pressman because<br />\nthey felt that the former was \"eminently qualified\" for<br />\nthe job, and the fact that as Republican organization<br />\ncandidate he immediately starts out with three hundred<br />\nthousand votes and proper financial backing.<br />\n• Publicity Hound<br />\nIn addition, they consider Pressman \"a publicity<br />\nhound, not the kind of man you want for administrative chief of staff.\"<br />\nThe Washington Post feels that \"Mr. Pressman is<br />\na decent and honest man, but he is not an acceptable<br />\npossibility fcl• the Governor's chair. He represents, in<br />\ngeneral, an achronistic passion for low cost, low-tax<br />\ngovernment with limited public services. His proposals<br />\nfor legalized gambling and lotteries only open the<br />\nprospect for increased crime and the unhappy social<br />\nside-effects that Southern Maryland encountered with<br />\nits slot machines.\"<br />\nPolicy Positions<br />\nRegarding the policy positions of the two major<br />\ncandidates, Mahoney has, as cited in the Washington<br />\nPost, followed a policy • of \"persistent refusal . . . to<br />\ntalk about the State's real affairs.\" When he has taken<br />\na stand, he completely evades the issues in regard to<br />\nthe tax problem, transit, crime, and highway safety.<br />\nThe Democratic candidate fails to say how or really<br />\nwhat he plans to do as governor. His only actual stand<br />\nhas been on the question of open housing, which he is<br />\ncompletely against; but even in this area, he has shown<br />\nhis lack of true knowledge of this complex issue?<br />\nMahoney has been recognized as the bosses' candidates. He is particularly noted through his long but<br />\nunsuccessful political career as a follower and \"yes\"<br />\nman.<br />\nPreferable to Mahoney<br />\nAgnew, on the other hand, has taken definite stands<br />\non all the primary issues confronting a state of Maryland's capabilities. He may not be considered a devout<br />\nliberal on the question of open housing, but his backing of the recently defeated civil rights bill is, as the<br />\nNew York Times felt, \"distinctly preferable to that of<br />\nMr. Mahoney, whose nomination was largely attributable to a 'white backlash' vote.\"<br />\n<br />\n\fPAGE TWO<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br />\n<br />\nElection Results Predicted to Maintain Trends<br />\n<br />\nBy GEOFFREY LEBAR<br />\nMr. Gallup points out that a centralization. At any<br />\nrate, in am able to visualize John Tower,<br />\nBefore the final day of reckon- similar Republican trend<br />\nsure the Republicans would have<br />\noc- 1966 Romney, Reagan, Rockefelone of the most conservative Re- held a<br />\ning on November 8th, I must curred in 1962.<br />\nhealthy group in Congress.<br />\nler (Nelson & Winthrop), Agnew,<br />\nrecord my Predictions and imWhy the success of Republi- Percy, Tower, Bo Callaway, Ed- publican Senators and a gradu- The Republicans have two courpressions of this interesting cans<br />\nnow and the failure in 1964? ward Brooke, Clifford Case, Ger- ate of the London School of Eco- ses which they can<br />\nfollow to<br />\ncampaign. As a semi-professional<br />\nBarry Goldwater is only part of ald Ford, and Mark Hatfield, all nomics, sitting next to Edward<br />\nachieve success. 1) They can dispollster in Maryland this year,<br />\nthat answer. The real answer is seem to be doing all right in Brooke, a Massachu<br />\nsetts Negro, mantle the National Committ<br />\nI have felt the pulse of the peoee<br />\nthat Republicans prosper in off- their respective spheres of influwithout much emotional or politple from a new vantage point.<br />\nand fail to run candidates for<br />\nyear elections and generally lose ence. But picture these men two<br />\nAlthough, I predict a Republican,<br />\nin presidential years. This trend years from now. There is no hope ical difficulty. Yes, there are wide President, while concentrating on<br />\nSpiro T. Agnew, will be. elected<br />\nhas existed since 1936 except for for unity. The Republican party political differences, but there local offices or<br />\n2) they can start<br />\ngovernor of Maryland by more<br />\nDwight Eisenhower's victory. Is a cult of individualists. And are intellectual similarities which<br />\nelecting quality men to their nathan 13.000 votes, there is more<br />\nSignificant gains in Congress for this is something to be proud of. make capable a resolution of difto my findings. Although nationtional conventions. Obviously the<br />\nREpublicans in 1938 and 1946 are<br />\nAlso these individuals, by and ferences in a civil manner. For first<br />\n-ally, Republicans will gain over<br />\npossibility is the easiest.<br />\nan example. General Eisenhower<br />\nsome reason, I can't put a Lester<br />\n'700 state representatives, 58 U.S.<br />\nwas a pleasant exception to this large, are good men (better than<br />\nThe<br />\ntrouble simply put is that<br />\nCongressmen, 3 Senators, and 6<br />\ntrend. But unless President their Democratic opponents, any- Maddox, a grammar school<br />\nGovernors, there is still more sigthe Republican party is no<br />\ngraduate with a history of Negro<br />\nJohnson is planning to make a way.)<br />\nnificance to this election. Belonger a national party, and its<br />\nfew more Republican war heroes<br />\nanimosit<br />\ny in the same camp with<br />\nWithout<br />\nL.B.J. at the helm,<br />\ncause predictions are often<br />\nnational leaders (Nixon, Goldin Vietnam, we can discount<br />\nJohn<br />\na<br />\nTower. And perhaps the<br />\nwrong (as were some printed in<br />\nthe Democratic second level rears<br />\nthis type of reoccurence.<br />\nwater,<br />\nRomney, Scranton, and<br />\nthis column last year), politiits ugly face. Yes there's George people in general feel the same Rockefel<br />\nler) are only successful<br />\ncians must learn more from each<br />\nPresidential Jinx<br />\nMahoney, Lurleen Wallace, Wag- way.<br />\nelection.<br />\non a local level. I'm for a blank<br />\nBut how should Republicans goner Carr, Pat Brown, Frank<br />\nAlternatives<br />\nGeorge Gallup, our great correct this presidential year<br />\nspace on the 1968 ballot. (P.S.<br />\nO'Connor, Paul Douglas, EndiAmerican opinionator, shows jinx? It is apparent that<br />\nI often muse as to what would I'b only joking, Mr. Nixon.)<br />\noffthat at the Congressional level, year elections give the Republi- cott Peabody, Lester Maddox,<br />\nhave happened if the Republioutside the South, the Republi- can and Democratic state parties Zolton Ferency, Warren Wiientz,<br />\ncans<br />\nhad failed to nominate anycan party is at its greatest height their best opportun<br />\nGraduate Women<br />\nity to cam- Robert Duncan, and Jim Johnone to run against President<br />\nIn 10 years. 51% of the people paign. Republican<br />\nThe Graduate Women and<br />\nstate parties son on the Democratic side. If<br />\nprefer Republican candidates do a better job of this than<br />\nJohnson in 1964. With just a<br />\nWives Association is sponsorDemyou are up to date on your poland only 49% prefer Democratic ocrats. Perhaps it has somethi<br />\ning discussion grdups on<br />\nblank space on the ballot, I'm<br />\nng<br />\ncandidates outside the South. In to do with the general Republi- itics you can match the Repubhandicraft, child care, and<br />\nthe South only 31% of the peo- can policy of decentralization lican and Democratic opponents<br />\nliterature. Undergraduates and<br />\nple prefer Republican candidates. versus the Democratic policy<br />\nundergraduate wives are also<br />\nof I've mentioned. But somehow I<br />\nIncompletes<br />\nwelcome. Contact Dee HeiStudents having Incompletes<br />\nman, 467-2676, for information.<br />\nfrom spring semester on their<br />\nrecords must resolve them by<br />\nFRIDAY, OCTOBER 28TH, or<br />\nA button-down in a basket weave.<br />\naccept \"F's\" for the courses.<br />\n1966 Yearbooks<br />\n(Something old,something new.)<br />\nContact the Associate Dean<br />\n1966 yearbooks are now<br />\nfor Undergraduate Studies, F.<br />\navailable at The Barn from<br />\nThis Arrow shirt gives you best of<br />\nG. Dierman.<br />\n9 a.m. until 4 p.m.<br />\nboth<br />\n<br />\n1<br />\n<br />\nworlds.(1)A long-pointed<br />\ncollar roll in the most authentic<br />\ntradition.(2)A husky-looking<br />\nbasket weave that updates<br />\nordinary oxford. For other<br />\ninteresting features, check the<br />\ntapered body; back pleat and<br />\nback collar button. Lots of<br />\nstripes, solids and whites.<br />\n\"Sanforized\" labeled. $5.00.<br />\nBold New Breed from<br />\n<br />\nTh**\\<br />\n<br />\n1<br />\n<br />\nAdvertisement<br />\n<br />\nTED AGNEW NEEDS YOUR<br />\nHELP TO STOP MAHONEY!<br />\nNon-partisan volunteers are urgently needed during<br />\nthe final,<br />\ncrucial week of this nationally important campaign.<br />\nIf you<br />\nare concerned about human rights and responsible<br />\ngovernment in Maryland, you must ACT. A non-partisan<br />\nmeeting<br />\nis being held—your assistance will be invaluable,<br />\nregardless<br />\nof experience or amount of time you can offer. If<br />\nyou are a<br />\nregistered voter, please briny your I.D. Card so<br />\nwe can record<br />\nWard (or District) and Precinct number.<br />\n•<br />\n<br />\nVOLUNTEER MEETING<br />\nSATURDAY, OCTOBER 29th-10 A.M.<br />\nCHARLES THEATRE<br />\n1711 N. Charles Street<br />\nTransportation — Saturday, 9 a.m.; Johns Hopkins<br />\nLevering Hall — Goucher — College Center.<br />\n<br />\nFor Further Information: Czll CII 3-0055 (24 Hours)<br />\n<br />\nPlacement Bureau Announcements<br />\nGRADUATE SCHOOL INTERVIEWS—SEN/ORS<br />\nTuesday. November 1 — Northeastern University (Graduate Cooperative Program)<br />\nFriday. November 4 — U. of Chicago Grad Sch of Business<br />\nWednesday. November 9 — Columbia U. Grad Sch of Business<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL<br />\nTO ARRANGE FOR INTERVIEW<br />\n<br />\nINTERNATIONAL VOLUNTARY SEtIVICES<br />\nRepresentative will be on campus Friday, October 28 to talk<br />\non<br />\nwork of IVS. Arrange for interview in PLACEMENT BUREAU,<br />\n100<br />\nWhitehead Hall<br />\n<br />\nEXAMINATION DATES (Federal government. Dept.<br />\nof State, etc.)<br />\n<br />\nC AMPLE<br />\nJTORE<br />\nOPEN EVERY EVENING<br />\n'TIL 9 P.M.<br />\n<br />\nOnly A Few Blocks<br />\nFrom The Hopkins Campus<br />\nAt 31st & Greenmount Ave.<br />\n<br />\nNaional Security Agency — file by November 25 to<br />\ntake test on<br />\nDecember 10<br />\nSummer employment in Federal Government — file by October<br />\nto take test on November 26; file by Dec. 9 to take test 26<br />\non<br />\nJon. 7, 1967<br />\nGraduate students and seniors in non<br />\n-science fielsls who are interested in<br />\ngovernment careers should take Federal<br />\nEntrance Exam early in<br />\nacademic year. Exams are given monthlytier, ice<br />\nthrough May.<br />\nGraduate students and seniors going to<br />\ngrad school in engineering, math.<br />\nphysics, and chemistry- who are interested<br />\nsummer employment should<br />\nregister immediately at Placement Hureau. in<br />\nSeniors ss ho have not received August letter from<br />\nPlacement Bureau and<br />\nthose who receiNed letter. but have not responded<br />\nshould contact Placement<br />\nHureau as soon as possible.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br />\n<br />\nkministration Explains Outlook<br />\nOn Discrimination in Housing<br />\nThe number of commercial and<br />\nprivate off-campus housing accommodations listed with the<br />\nUniversity Housing Office in Wolman Hall has dropped from 482<br />\nin 1965 to a present total of 122,<br />\naccording to Victor H. Dates,<br />\nDirector of Special Programs at<br />\nHopkins and administration advisor on civil rights.<br />\nThis school year is the first in<br />\nwhich all private and commercial<br />\nlandlords have been required to<br />\nsign a non-discrimination pledge<br />\nbefore being listed by the University. Over 600 accommodations<br />\nwere listed several years ago before the establishment of a<br />\npledge card system for all commercial landlords in 1964.<br />\nPosition Clarified<br />\nIn an effort to clarify the University's position on human<br />\nrights, following much agitation<br />\nby the Basic Freedoms Committee last November, Secretary<br />\nRoss Jones made public a letter<br />\nto officers, faculty, students, and<br />\nemployees in December, 1965. He<br />\nendorsed the University's problems of complete non-discrimination at all levels of endeavor.<br />\nWithin a month of the publication of Mr. Jones's letter, Dr.<br />\nMilton S. Eisenhower announced<br />\nthe major change in pledge card<br />\npolicies. In light of debates over<br />\nlocal open occupancy and charges<br />\nof discrimination, Dr. Eisenhower re-emphasized that the<br />\nUniversity could not in good<br />\nconscience continue to list real<br />\nestate holdings of landlords<br />\nwhose feelings did not coincide<br />\nwith its own.<br />\nAccording to the rule, which<br />\nwent into effect this fall, all<br />\nlandlords wishing to be included<br />\non the University list must sign<br />\na pledge card stating that they<br />\nare in agreement with Hopkins'<br />\nnon-discriminatory policies and<br />\nare willing to rent their property<br />\nwithout regard to race, creed or<br />\nnational origin.<br />\nN-L Research<br />\nRecent News-Letter research<br />\namong a cross sampling of local<br />\nlandlords located east of the<br />\ncampus produced no evidence of<br />\nany discrimination. The paper<br />\nwas aided in its research by sev-<br />\n<br />\nThe one-and-only<br />\nSNOOPY<br />\nin his first<br />\nfull-length<br />\nnovel!<br />\n<br />\nPartridge Named Admin. Veep<br />\n<br />\nDr. Bruce J. Partridge has assumed new duties as the Unieral members of the class of versity's Treasurer and Vice<br />\n1970, including two Negroes.<br />\nPresident for Administration.<br />\nIn the fall of 1965, 30 commerFormerly Vice President for<br />\ncial landlords listed accommodations and pledge cards with the Finance and Treasurer, Dr. PartUniversity. Negroes were sent to ridge now directs additional Ldthese apartments and were acministrative activities in the areas<br />\ncepted at two places without inof personnel, contracts and<br />\ndenied<br />\nwas<br />\nthird<br />\na<br />\ncident. But<br />\nhousing. The landlord breaking grants, and governmental relathe pledge was dropped from the tions.<br />\nlist. Again last fall the University<br />\nThe duties of the late P. Stewsent letters to all private landMacaulay as Executive Vice<br />\nart<br />\nlords in the area urging them to<br />\nrent their facilities to Hopkins President of the University have<br />\nstudents and faculty.<br />\nbeen assumed by Partridge and<br />\nAccording to Mr. Dates, approx- Dr. William Bevan, Vice Presiimately 1700 grad students seek dent for Academic Affairs. Mr.<br />\noff-campus housing annually. A<br />\nMacaulay retired last June after<br />\nmajority of these are steered<br />\nthirty years' service at Hopkins.<br />\nthe<br />\nUniversity-owned<br />\ntoward<br />\nDr. Partridge will continue his<br />\nbuildings, Wolman and Greenway.<br />\nSeveral hundred undergraduates responsibilities in administering<br />\nand faculty members also look the Hopkins financial program.<br />\nHe served as a member of the<br />\nfor apartments each year.<br />\n<br />\nof.)<br />\n<br />\nPAGE THREE<br />\n<br />\nNEWS -LETTER<br />\n<br />\nUniversity's Long Range Planning Committee from 1964-1966.<br />\nA graduate of Oberlin College<br />\nand the holder of two law degrees from the Blackstone College of Law, Dr. Partridge<br />\n<br />\njoined the Hopkins administrative staff in September, 1964.<br />\nFrom 1958 to 1964, he was Vice<br />\nPresident for Business Management at the University of Delaware.<br />\n<br />\n&gaitPiki%SOW<br />\nTHE<br />\nSLEEP Now<br />\n/*fr<br />\nokt<br />\nMARKED<br />\n‘11.. •<br />\nWOMAN<br />\n/0i-ft% •..••••.•...<br />\nomit.%<br />\nPETRIFIED<br />\nFOREST<br />\n\"<br />\nTHEY DRIVE SUN.<br />\nBY NIGHT<br />\n<br />\nEZIAL<br />\nNorth at Charles<br />\n<br />\nACADEME; ADMIS.CI311 OF 75F<br />\nwith Proper Identification.<br />\nC:ood at all times exceptine<br />\nafter 6:10 P.N.<br />\nSaturda<br />\nNS\\ N<br />\n<br />\n1VE 7 — 19561<br />\n<br />\nDEAR<br />\nr*<br />\n:*<br />\n•A IEI3II<br />\nEven When She Answers, He Still Gets the Busy Signal.<br />\nDEAR REB:<br />\n<br />\nLately, every timel call my girl, she's either \"not in\" or \"not interested.\" Last week I called her 23 times and couldn't even make a<br />\ncoffee date. The trouble started when she started dating a guy<br />\nwho owns a Dodge Coronet. Now she goes to parties with him,<br />\ndances, football games,etc. Do you think I should call her again,<br />\nor should I forget her and break her heart?<br />\nBAD CONNECTIONS<br />\nDEAR BAD CONNECTIONS:<br />\n<br />\nI think your next call should be to your Dodge Dealer. Then make<br />\na date to see the '67 Coronet, the car that's breaking hearts all<br />\nover America. You'll find that its good looks are pretty hard to<br />\nresist. Now, before you break your girl's heart, give her another<br />\nbreak. Ask her to go for a ride in your new Coronet. I think she'll<br />\nget the signal.<br />\n,<br />\n<br />\n•cotY -<br />\n<br />\neJ<br />\n<br />\nSNOOPY<br />\nAND THE<br />\nRED<br />\nBARON<br />\nby Charles M. Schulz<br />\nIt's a war story filled with<br />\nraw drama, romance, guts,<br />\nand tears. And there's a picture of Snoopy on every<br />\npage.<br />\n<br />\n$2 at your college bookstore<br />\nHolt, Rinehart and Winston, Inc.<br />\nAvailable At<br />\n<br />\nJOHNS HOPKINS<br />\nBOOKSTORE<br />\n<br />\nDodge Coronet 500. A campus favorite with its great new looks, ride,<br />\nHere's the heartbreaker<br />\nand list of extras that are standard. like bucket seats with either a companion seat in the middle or a<br />\ncenter console. Plush carpeting. Padded instrument panel. Padded sun visors. Seat belts, front and<br />\nrear. A choice of Six or V8 models. And lots more. So get with '67 Dodge Coronet and get busy.<br />\n<br />\nCHRYSLER<br />\nDODGE DIVISION 41116/<br />\n'<br />\n<br />\nINIDGE REBELLION OPERATION'61<br />\n<br />\n\fPAGE FOUR<br />\n<br />\nNEWS -LETTER<br />\n<br />\nOly. 31alifts fovkins tittuo-trittr<br />\nEditors-in-Chief<br />\nHenry J. Korn<br />\n<br />\nMelvin R. Shuster<br />\n<br />\nTHE BOARD OF CONTROL<br />\nBu.iness Managers<br />\nWilliam Z. Schenck<br />\nExecutive Editor<br />\nGarth Mackenzie<br />\n<br />\nAllan Eudell<br />\nManaging Editor<br />\nRoger C. Toll<br />\nGregory A Itsehuh<br />\n<br />\nAssociate Editors<br />\nHenry Hocherm an<br />\n<br />\nMarshall Paul<br />\n<br />\nSTOP MAHONEY<br />\nAfter five futile attempts, it appears that George<br />\nP. Mahoney is on the verge of succeeding in his perennial<br />\nquest for the governorship of Maryland.<br />\nSupported by the everpresent undercurrent of racial<br />\nprejudice and the recently generated swell of white backlash, the candidacy of Mahoney threatens to introduce<br />\nin to the State House the type of government reminiscent<br />\nof the Reconstruction era.<br />\nUnlike his two opponents, Mahoney has shown himself to be manifestly incapable of presenting_ a sound<br />\nprogram dealing with the issues of state finance, education, pollution control, and transportation. He has succeeded in obscuring these points through his emotional<br />\nappeals for closed housing, and the election will unfortunately hinge on the degree to which his philosophy<br />\nis shared by Maryland voters.<br />\nIn an attempt to overcome Mahoney's apparent appeal to the public, a non-partisan \"Citizens To Stop<br />\nMahoney\" organization has been formed. Its plan is to<br />\ngo into Baltimore precincts where the turnout was light<br />\nin the primary, and to convince the residents to vote<br />\nagainst Mahoney by casting their ballots for the Republican candidate, Spiro T. Agnew.<br />\nIn a state where a plurality of votes is sufficient for<br />\nelection, Mahoney is conceded to have already amassed<br />\nthe support of at least one-third of the electorate. Realizing that Independent Hyman Pressman's support is<br />\nwoefully limited to the Baltimore area, the Stop Mahoney group is playing practical politics and supporting<br />\nAgnew. Pressman, who either does not grasp the full<br />\nmeaning of the situation or is overcome with ambition,<br />\nadamantly refuses to withdraw his candidacy, a move<br />\nwhich would assure majority rule and give the voters a<br />\nclear choice.<br />\nIn order to achieve its goal, the Stop Mahoney<br />\norganization needs volunteers, and has turned to Hopkins students to enlist their all. While we recopize that<br />\nthe majority of students here are from out of town, we<br />\nstill urge that Hopkins heed this request.<br />\nFor one thing, the election has taken on national<br />\nimplications. Indicative of this is Richard Nixon's recent observation that \"the party of Jefferson, Jackson,<br />\nand Wilson has become the party of Maddox, Mahoney,<br />\nand Wallace.\"<br />\nAs a border state, Maryland becomes an important<br />\nbarometer for the fortunes of the enforcement of basic<br />\ncivil rights. While northern politicians may ignore the<br />\nelection of Wallace or Maddox, Alahoney's election would<br />\nserve to restrain enthusiastic furtherance of civil rights.<br />\nThere is yet a more compelling reason. To any student who believes that knowledge must supplant<br />\nprejudice and that freedom should breed responsibility,<br />\nthe candidacy of Mahoney is as gross an insult to him<br />\nas to the Maryland body politic. For Hopkins to remain<br />\npassive in this election is to allow Veritas Vos Liberabit<br />\nto be cruelly mocked by \"Your Home Is Your Castle.\"<br />\nOne need only consider his reaction were Mahoney<br />\nrunning for governor in his own state. That he is doing<br />\nso in Maryland seems to us to be no less a catastrophe<br />\nthan if he were a candidate in Pennsylvania or New York.<br />\n\"The actions of men,\" wrote John Locke, \"are<br />\nthe hest interpreters of their thoughts.\" In volunteering<br />\nto aid the Stop Mahoney group, Hopkins students have<br />\nthe opportunity to play a significant role in the outcome<br />\nof the election, remaining loyal, at least, to the concepts<br />\nfor which the University stands. Should Mahoney be<br />\nelected, no one will ever mistake the government of<br />\nFree State as the embodiment of Truth.<br />\n<br />\nCANUCK! CANUCK!<br />\nAmong its many interests the News-Letter takes it<br />\nupon itself to keep tabs on its brother student publications at Hopkins. We note with a mixture of superiority<br />\nand shame the failure of the current edition of the<br />\nHullabaloo to keep pace with new standards of Journalistic endeavor undertaken by the News-Letter, Vector,<br />\nand Charles Street Review.<br />\nWe might certainly agree that the 1965 Hullabaloo<br />\nwas a hard act to follow. It combined a new size and<br />\ncreative layout with a high standard of photography to<br />\nproduce the most memorably excellent yearbook in the<br />\nrecorded history of yearbooks.<br />\nNevertheless for the editors of the 1966 Hullabaloo<br />\nto attempt to erase the fine memory of their predecessor<br />\nby producing 200 pages of cliche was as disappointing as<br />\nit was dull.<br />\nThis, however, is no reason not to pick it up since<br />\nmost of you have already paid for it and next year is<br />\nanother year as tomorrow is another day, or something<br />\nlike that.<br />\n<br />\nI<br />\n<br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1960<br />\n<br />\nlite alkeinewead Scene<br />\n<br />\nBorn Rich<br />\nWhile glancing through the<br />\neducation section of the voluminous Sunday Times last week, this<br />\nreporter stumbled upon a startling fact. Amidst the great competitive maelstrom of modern<br />\nacademe, amidst the selective and<br />\nsuper selective schools that one<br />\nlinks with higher education in<br />\nAmerica, is a group of schools<br />\nthat advertise. It's true. They run<br />\nglorious ads in the New York<br />\nTimes telling of air conditioned<br />\nclassrooms and swimming and<br />\nmaid service, and degrees even,<br />\nand all without the anxiety of<br />\ncompetion or the trouble of taking great banks of multiple<br />\nchoice brain teasers.<br />\nFor the price of a postage<br />\nstamp one can bid for a seat<br />\nat the Pumblechook College of<br />\nMining and Dentistry, sip from<br />\nthe springs of scholarship at<br />\nPowhaten J.C., or sup at the seat<br />\nof success amidst the ivy covered walls of Balaclava Academy<br />\nof Music and Dressmaking. These<br />\nschools are seldom filled to<br />\ncapacity, and bring truth to the<br />\ngreat egalitarian maxim that<br />\neveryone can find a place in<br />\ncollege.<br />\n<br />\nplications. They have been advertising covertly for years, in the<br />\nform of speakers and films sent<br />\nto high schools, and it's only a<br />\nmatter of time, this reporter<br />\nfeels, until the mass media are<br />\nbesieged with college ads that<br />\nmay sound a bit like this:<br />\n<br />\nShe: Only a handshake, never<br />\na good night kiss, why is it<br />\nthat Jim doesn't like me?<br />\nWith the end of the post war<br />\nCould I have bad breath?<br />\nboom babies' siege on American<br />\nFriend:<br />\nWell, you asked, so I'll<br />\nCollege Campuses and the actell you. It's not your breath,<br />\ncompanying decline in applicait's your school. Leave sections and the lowering of standond rate Podunc A and M<br />\nards, one can only wonder when<br />\nand come to Wellesley. Sursome of our more venerated inveys show that Wellesley<br />\nstitutions of learning, the Hopgirls get 23% fewer handkins among them, will bow to<br />\nshakes.<br />\nnecessity and turn to Madison<br />\nAvenue for aid in soliciting apThe Hopkins, not to be out-<br />\n<br />\ndone, would take full advantage<br />\nof radio, T.V., newspapers, and<br />\nother methods of mass communication to bring home the message \"Veritas Vos Liberabit.\"<br />\nStudying more now, but enjoying it less, come up, come up,<br />\ncome all the way up, to Hopkins.<br />\nHopkins teaches good,'like a University should. Hop to Hopkins,<br />\nit satisfies. You're in the Hopkins<br />\ngeneration. The pressure on high<br />\nschoolers will build and build.<br />\nAds will appear on Phisohex<br />\nbottles, on Great Shakes boxes,<br />\nand to get to the younger generation, on the back of shredded<br />\nwheat. For only 25c and four<br />\nmillion boxtops you get, first, an<br />\nofficial JHU \"Guide to Universal<br />\nTruth\" (illustrated), plus, for<br />\nyour very own, a Hopkins sweatshirt, guaranteed to out cool everyone on your block. For no extra charge, if you send your<br />\nquarter in cash, you get four NoDoz, a Goucher Girl, a tour of<br />\nthe Block, a Baltimore City<br />\npoliceman for your very very<br />\nown, a genuine reproduction of<br />\nthe school ring, an autographed<br />\npicture of Mr. Vane, an honor<br />\ncode, a Homewood brick, sixteen<br />\npsychiatric treatments, a partridge in a pear tree, a picture<br />\npost card of Homewood house,<br />\na rubber doll of Daniel Gilman,<br />\nan apathy ( with dust cover),<br />\ntwelve graduate instructors, an<br />\nulcer, a case of national Bo, a<br />\nTep, and a free subscription to<br />\nNews-Letter. Offer void where<br />\ntaxed or prohibited by law.<br />\n<br />\nSymposium Keys Understanding<br />\nBy BARON WORMSER<br />\nThe London Times in a recent<br />\nand rather caustic editorial (reflecting a speech given by Saul<br />\nBellow) characterized American<br />\ncriticism as a perpetual struggle<br />\nbetween \"warring gangs of<br />\nacademicians.\" A...crican criticism has been charged among<br />\nmany things with the employment of \"symbol searching machines\"<br />\n(Hemingway),<br />\nwith<br />\npointless and unnecessarily voluminous studies, and a distinct<br />\nrefusal to soil its respective<br />\nhands with the findings of other<br />\ndisciplines. In short, even allowing for generalization it is not<br />\nan especially pretty picture.<br />\nIn light of this, the First International Structural Symposium must be counted as an important<br />\nevent for<br />\nWestern<br />\nAcademe. While a direct assessment of the speeches and dialogues of the Oct. 18-21 symposium is foolhardy without the<br />\naid of reflective retrospection<br />\n(the proceedings will be published next year by the Hopkins<br />\nPress), the symposium succeeded—according to Prof. Richard<br />\nMacksey—most invaluably on the<br />\nelemental level of communication. Philosophers, literary critics, sociologists, linguists, and anthropologilts were given their<br />\nfirst chance to explore a not-soold movement which is now emerging in a clearer focus on both<br />\nan inter-disciplinary and transatlantic basis.<br />\nExamples<br />\nThe problem of defining structuralism is a decidely heady one.<br />\nWhile not begging the question,<br />\nit can be said that there is no<br />\nclear cut \"structuralism,\" but<br />\nrather<br />\nstructuralisms.<br />\nmany<br />\nThough all, the disciplines present<br />\nare interested in what C. E.<br />\nPeirce termed the \"method of<br />\n<br />\nmethodology,\" and the patterns<br />\nof the phenomenon of man;<br />\neach discipline is intent upon the<br />\nstructure of its respective subt.<br />\n<br />\nthes); totalization of the work<br />\n(Prof. Charles Singleton); and<br />\ntime<br />\nand<br />\nspace<br />\ncategories<br />\n(Georges Poulet).<br />\n<br />\nHowever, all the structuralist<br />\nviewpoints are linked in their<br />\nbelief that one should read a<br />\nnovel .as if one were at<br />\nonce<br />\nreading it for the first time<br />\nAND<br />\nre-reading it, all at once.<br />\nStructuralism therefore recognizes the consequences of<br />\nbringing another consciousness<br />\nto the<br />\nwork (in Levi-Straus<br />\nthis appears in the relation of<br />\nthe observer to the observed)<br />\nor in<br />\nmore jargoned terms is<br />\nconcerned with the alienation<br />\nof subjectivity. The structuralist,<br />\nhowever, as Prof. Macksey<br />\nstressed<br />\nmust also come to grips with<br />\nthe<br />\nfact that there is no<br />\n\"science\"<br />\nof criticism and that a<br />\nstance of<br />\ncomplete objectivity is<br />\nabsurd.<br />\nMeeting Evaluated<br />\nAs one of the last<br />\nspeakers<br />\nNicolas Ruwet)<br />\nsuggested, a<br />\nfrank acceptance of the<br />\nlimits<br />\nand concepts of<br />\nstructures must)<br />\nIdea's Development<br />\nbe realized along with<br />\nthe recAs a critical phenomenon, ognition that there<br />\nis too much<br />\nstructuralism is primarily a re- metaphysics in the<br />\naction to the atomistic view of turalisms and not various strucenough axiolo19i,h Century positivism. The gy. However these<br />\nconcerns reidea of appropriating a total led t most<br />\nencouragingly what<br />\nstructure of meaning is in op- Lucien Goldmann<br />\nstated when<br />\nposition to the belief held by he said the<br />\nsymposium left a<br />\nCc__ite that an enumeration of great deal<br />\nunanswered.<br />\nthe parts gives the whole.<br />\nThe symposium was in<br />\nany<br />\nAs structuralism is a distinctly case, with its<br />\nfree cat times<br />\nacademic phenomenon, the role frantic)<br />\ncommunication between<br />\nof literary criticism cm be con- the various<br />\ndisciplines, its proof<br />\nsi.--red as one of its major con- that the University<br />\ncan foster<br />\ncerns. Again, to label a man a original intellectual<br />\nthought, and<br />\nstructuralist .aitic is an over- its consonant<br />\ncontemporary elesimplification as the participants ment a healthy<br />\nrebuttal to the<br />\napproached the problem of the Times' doleful<br />\ncomments,<br />\nreading of a book from such Whether structuralism<br />\nis another<br />\nvaried viewpoints as; the impor- intellectual fad or not<br />\nremains<br />\ntance of the social aspects of the to be seen but it<br />\ncertainly was<br />\nwork ( Lucien Goldmann); very nice here for<br />\nthose PAW<br />\nliguistic effects (Roland Bar- days.<br />\nFor example, the work of the<br />\nFrench anthropologist Claude<br />\nLevi-Straus has made use of the<br />\nanalysis of ritual practice in<br />\nprimitive Brazilian tribes in order to be able to view their society as a game-pattern with certain rules, penalties, and rewards.<br />\nSimilarly the first structuralist<br />\napproach to linguistics is to be<br />\nfound in the work of the Swiss<br />\nscholar Sausaere (writing from<br />\n1905-11) who studied the meaning of language. In this light the<br />\nFrenth critic Roland Barthes has<br />\nmade use of formalistic analysis<br />\nof a literary work by such \"structures\" as tense sequence. Hence<br />\nwhile there.certainly ar'i tangible<br />\nbonds among the various disciplines, there is no structuralist<br />\nmovement in the way one could<br />\nlabel surrealism an interdisciplinary movement.<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\n\" HOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br />\n<br />\nPAGE FIVE<br />\n<br />\nWeaver Criticizes Ghettoes; Gouch. Seeks Lady-Killers<br />\nDeplores Need for Violence<br />\ndiscrimination and by not acting on employment problems until after violence had occurred.\"<br />\nWeaver emphasized the importance of integration and elimination of the ghetto in ensuring<br />\nadequate housing for all. He<br />\nspoke of the danger of black<br />\nnationalism, a dedicated foe of<br />\nThe Secretary of Housing and integration, in the fight for fairUrban Development made his re- housing.<br />\nmarks as the Albert and Gloria<br />\nSociety's Responsiveness<br />\nLyons Lecturer for this year,<br />\nIn direct connection with this<br />\nspeaking on the topic of \"New crucial crisis Secretary Weaver<br />\nDirections in Housing and Urban stated: \"If the press, local govDevelopment.\"<br />\nernment and what they (poor<br />\nAfter listing various complex Negroes) have learned to identiurban ills which confront the fy as the power structure are<br />\nnation, Dr. Weaver stated that more responsive to the racial<br />\none goal of urban renewal should nationalists than to the integrabe low cost housing in suburban tionists, a growing number of<br />\nareas to provide more job mo- Negroes will unconsciously bebility for residents of the city. come racial nationalists.\"<br />\n\"There will never be enough, or<br />\nAbove all however, Weaver<br />\nsufficient diversity of jobs in the stated, new legislation must be<br />\nghetto to meet the requirements enacted to provide both the ecoof its residents.\"<br />\nnomic means and the technical<br />\nknow-how to put a broad proRacial Imbalance<br />\nThroughout his lecture, Weaver gram of public housing into efstressed the part played by ra- fect. He commented that the<br />\ncial imbalance in maintaining goal of urban renewal should be<br />\nthe current substandard levels \"low cost housing in suburban<br />\nof housing in the core, city In areas to provide more job moconnection with this he chided bility for residents of the inner<br />\nsociety in general for its fail- city.\"<br />\nure to assist the Negro without<br />\nthe stimulant of violence.<br />\nSpecifically with regard to the<br />\nHopkins students,<br />\nabove Weaver commented: Society, including the press and<br />\ngovernment, is encouraging violence by keeping up barriers of<br />\nAddressing an audience of over<br />\n600 people, only 150 of whom<br />\nwere Hopkins undergraduates,<br />\nDr. Robert Weaver warned last<br />\nSunday that \"We must not lose<br />\nsight of the fact that rehabilitation will never produce a lasting benefit while the walls of<br />\nthe ghetto stand.\"<br />\n<br />\n\"Kill, Kill,\" a cry once heard small. This is a challange that I sundry that while Hopkins men<br />\nonly on the ROTC drill field will car not be passed up. Here is a may be short and unattr, ctive,<br />\nnow be heard throughout the chance to demonstrate to all and they are not manly deD:..ient.<br />\nHopkins and Goucher campuses,<br />\nand the miles in between, as the<br />\nGoucher sophomore class invites<br />\nthe Hopkins juniors to participate in a Hunt, a la \"Tenth Vic\"SHOCKING AND CONTINUOUSLY PROVOCATIVE!<br />\ntim.\" The object of the Hunt, to<br />\nkill, kill. The place, anywhere.<br />\nCONSTANTLY CAPTIVATES THE EYE AND MIND.<br />\nThe time, between now and the<br />\nMiss Varda's dissection of amour is strikingly adult and<br />\nday that some hunter or huntress<br />\nin its depiction of the variety of love ...<br />\nunembarrassed<br />\nhas eradicated ten victims, and<br />\nswitches from boudoir to boudoir to beautiful bucolic<br />\nwins the Goucher-Hopkins homicide cup.<br />\nvignettes with artistic and technical grace. A<br />\nThe brainchild at Goucher, of<br />\nRenoir background. A memorable view of the<br />\none Callie Angel, the Hunt has<br />\nmale and female—awash in familiar<br />\ncampuses<br />\non<br />\nhunted<br />\nbeen<br />\nfinand<br />\ncountry<br />\nthe<br />\ntogetherness, sacred sex and frank<br />\nthroughout<br />\nally comes to Baltimore (always<br />\nadultery.\"<br />\n.._ A. H. Weiler, N. Y Tirn•s<br />\na bit late), through the kind<br />\nsponsorship Of the Goucher Class<br />\nof '69, under the direction of<br />\nPresident Carlotta Washington.<br />\n\"A VERY UNUSUAL PICContestants, who may sign up<br />\nTURE! Beautiful! A fine,<br />\nat Gilman mail room, will be<br />\nassigned either a victim or a<br />\nconsistent originality and beauty of texture<br />\nhunter, and will have ten days<br />\nthat merits attention from all movie-goers!\"<br />\nto kill or be killed. Hunters/<br />\nWinsho, N. Y. Post<br />\nvictims may wear bullet proof<br />\nclothing and use all devious<br />\nmethods they can conjure up to<br />\n\"AGNES VARDA has skillfully constructed an unusual<br />\nkill their prey.<br />\nThe women of Goucher have<br />\ntour de force bound to thrust movie-goers into oplaid down the gauntlet, and the<br />\nposing camps! I found the film refreshing, provocatime has come for all good men<br />\nAt<br />\nup.<br />\nand exquisite to behold! Warning to men: this<br />\nit<br />\ntive,<br />\npick<br />\nto step forth and<br />\nlast reports, Goucher signees<br />\nfilm may upset either wife or mistress. Above all,<br />\nnumbered over one hundred,<br />\ndon't go see it as a threesome.'!_winion, Wolf, Cut Magozioo<br />\nwhile Hopkins' showing was<br />\n<br />\n\"LE BONHEUR is a tale with a moral, or<br />\nrather an amoral ... for adults about adultery. Love—which the film follows with<br />\nadult frankness and without<br />\nO'Dohorty,<br />\nembarrassment,\" 1;f•<br />\n<br />\nnew and old, try:<br />\n<br />\nPecora's Restaurant<br />\n<br />\nMOValitli<br />\n<br />\nfor the finest Italian food in town<br />\n<br />\nSTUDENT-PART TIME<br />\n<br />\n\"WELL, IT'S ABOUT TIME: A<br />\n<br />\n3320 Greenrnount Ave.<br />\nCARRY OUT SERVICE<br />\n<br />\nSPAGHETTI MEALS<br />\n<br />\nWork 3 evenings 3-10 or<br />\n2 evenings & Saturday 9-5.<br />\n<br />\nCALL 889-3831<br />\n<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\n$60<br />\n<br />\nWhat Does Religion Mean to a Quaker?<br />\n<br />\nCALL 837-8152<br />\n<br />\nTo members of the Religious Society of Friends, religion is a matter of inward, immediate experience:- faith<br />\nis directly expressed in living. In silent worship Friends<br />\nsense an overpowering oneness of humanity which so often<br />\nsends them out to relieve suffering and to build relationships among men.<br />\n<br />\nSeniors Desiring a position on<br />\nthe student activities commission S.A.C. Apply for Interview P.O. Box 1246 by Today.<br />\n<br />\nYou are welcome to share Meeting for Worship with<br />\nus, at eleven on Sunday mornings.<br />\n<br />\nJOHN P. NUGENT, JR.<br />\n5116 North Charles St.<br />\nID 5-3773<br />\n<br />\n243-7961<br />\n<br />\n\"AN EXQUISITE FABLE OF INFIDELITY,'<br />\n,, Magazine<br />\n.-Ti,,<br />\n<br />\n\"AN EXCEPTIONALLY BEAUTIFUL MOVIE. The<br />\nphotography is very nearly as exquisite as the<br />\n—Brendan GA Now Yorlrer Magoz;no<br />\nmusic.\"<br />\n\"ONE OF THE MOST BEAUTIFUL<br />\nfilms that I think you will ever see.\"<br />\n<br />\nStony Run Friends Meeting<br />\n<br />\nLife & Health<br />\nInsurance<br />\n<br />\npicture wholly pure, where<br />\nlove Is joy! Intoxication of the<br />\neye! They make love (and<br />\nthey do tenderly and<br />\noften)...these are real<br />\npeople with a sensibility and honesty that gives grace<br />\nto anything they do or feel! You find yourself smack in<br />\n— Moon, Mortnet, VOtin MOSI02111.<br />\nan idyll!\"<br />\n<br />\nCritt, Todoy Show<br />\n<br />\nHARLEY'S<br />\nTIDEWATER FARMS<br />\n32ND & OLD YORK ROAD<br />\n<br />\n• STEAK • FRIED CHICKEN<br />\n• SEAFOOD<br />\nWITH<br />\nSALAD,<br />\nFR. FRIES<br />\n<br />\n1.95<br />\n<br />\nGeorGe ROTH maws<br />\nAGnes varda's<br />\n<br />\nFRESH<br />\nBREAD & BUTTER<br />\n<br />\nHARLEY OWNED & OPERATED<br />\nALSO SANDWICHES, CHILI<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4( '4( -4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n-9(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\nir<br />\n<br />\n4(<br />\n<br />\n4c<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n\f'Cagey' Hobart<br />\n1 Gridders Test<br />\nParthemore Sparks<br />\n<br />\n41111.1.1.11CIMMECIZIONININNEC<br />\n<br />\nT<br />\n<br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nCarat:us Notes<br />\n7vtors Sought<br />\n<br />\nPeo - le are needed desperately<br />\nfor Levering Hall's tutoring programs, particularly at Clifton<br />\nPark Jr. High. Advisors are needed for the Boys' Club, coaches<br />\nand referees are needed in intramural athletics, and'advisors are<br />\nneeded for specialty Clubs. Any<br />\nother skills or ideas can be used.<br />\nDrivers are needed for tutors.<br />\nAnyone interested, please contact<br />\nJohn O'Brien, Jim Winship, or<br />\nJoe Weinberg at Levering Hall,<br />\n243-2810.<br />\n<br />\nSAC Position<br />\nToday is the last day for all<br />\nseniors interested in a position<br />\non the S.A.C. to place his name<br />\nand box number in P.O. Box 1246.<br />\nInterviews will be assigned next<br />\nweek.<br />\n<br />\nStudents Tickets<br />\n<br />\nwell known English actress Maria<br />\nCorvin on October 26.<br />\nIn addition, Theater Hopkins<br />\ntickets are on sale there. All Friday and Saturday night performances have been sold out; how(Continued from Page 8)<br />\never, Thursday and Sunday night<br />\nHampdenand<br />\nwell-coached<br />\nseating is still available.<br />\nSydney unit, varsity coach Alex<br />\nSotir saw some signs of improveBus to Goucher<br />\nThe Hopkins Student Council ment in his squad and retains a<br />\nand Goucher Student Organiza- liLle optimism for tomorrow.<br />\n<br />\nMentor Wary Of<br />\nFoes' Gambling Spirited Grid Squad<br />\n<br />\ntion agreed this week to establish<br />\nweekend shuttle bus service between the two schools on a twomonth trial basis.<br />\nThe Goucher-Hopkins bus will<br />\noperate on Friday and Saturday<br />\nevenings. One-way fare will probably be twenty-five cents, with<br />\nspecial rates for those who will<br />\nride more than once during the<br />\nevening.<br />\nThe two student organizations<br />\nanticipate that the bus service<br />\nwill enable more students to take<br />\nadvantage of the cultural and<br />\nsocial attractions offered by<br />\nGoucher and Hopkins.<br />\n<br />\nUnder the sponsorship of the<br />\nOffice of Special Events, the<br />\nKappa Mu Chapter of the Alpha<br />\nOmega National Service FraternRoom at Top<br />\nity has opened a ticket office<br />\nThe Room at the Top re-opens<br />\non the ground floor of Shriver<br />\nHall next to the Office of Special again tonight after a week layoff during the Big Fall WeekEvents.<br />\nend. Tonight's show features the<br />\nAvailable are tickets to the \"Fore-Goers\", with JHU Junior<br />\nopera La Boheme by Puccini, to Rick Statman coming in Saturbe presented at the Lyric Theater, day. Rick, who works in the style<br />\nand to the April 19 Lyric concert of Eric Anderson, writes all his<br />\nfeaturing cellist Mstislav Rostrop- own material. Dave Kausal and<br />\novich.<br />\nJohn Shanck are also expected<br />\nThe office also handles special for short sets.<br />\nSomething new has been added<br />\nStudent Subscriptions to the Baltimore Symphony Orchestra and by the kitchen: In response to<br />\ntickets to a dramatic reading of popular demand, hot cider has<br />\n\"Out of Africa\" to be given by been placed on the menu.<br />\n<br />\nFirst,Michael Harrington started<br />\na war.<br />\nz<br />\nNow he's<br />\nturned to<br />\nMichael<br />\nHarrington<br />\nrevolution!<br />\nThe<br />\na Nakao. Ilarai<br />\n<br />\nAccidental<br />\nCentury<br />\n<br />\n\"Generally speaking, we did<br />\nbetter,\" he related. \"In fact, if<br />\nwe'd played the way we did last<br />\nSaturday in our first three<br />\ngames, we'd have won at least<br />\ntwo of them.',<br />\n\"Some people,\" he continued,<br />\n\"who hadn't done too well this<br />\nyear played up to their abilities<br />\nfor the first time since I've been<br />\nassociated with them; we hit,<br />\nand got hit back, harder than we<br />\nhave all season.\"<br />\nScore 'ofsibly Lower<br />\nElaborating on his optimistic<br />\ntheme, Sotir opined that last<br />\nSaturday's score could have just<br />\nas easily been 7-0 or 14-0, pointing out that Hampden-Sydney<br />\nintercepted three pa-sses in the<br />\nfirst quarter, scored one of its<br />\ntouchdowns on a long bomb, and<br />\nwas generally held on even terms<br />\nthe whole second half.<br />\nThe attack was generally less<br />\neffective, rarely getting more<br />\nthan two or three first downs in<br />\na row, reaching no closer to a<br />\nscore than around the HampdenSydney ten, and amassing only<br />\n203 yards total offense. Mark<br />\nCroft led the ball carriers with<br />\n47 yards on 18 carries.<br />\nPhil Parthemore, recovering a<br />\nbit from his three first quarter<br />\nmissthrows, completed nine of<br />\nnineteen passes for 88 yards,<br />\nwhile Mike Shaw, appearing at<br />\nthe game's conclusion, hit two of<br />\nthree for 76 yards, one a 70 yard<br />\nheave to Tom McDonough.<br />\n<br />\n(Continued from Page 8)<br />\na freshman at Lehigh College in<br />\nBethlehem, Pennsylvania, Phil<br />\nserved a six month term in the<br />\nMarine Corps.<br />\nPassing Prowess<br />\nIn 1965 Parthemore came to<br />\nJohns Hopkins and waited out<br />\nhis one year of ineligibility.<br />\nThen, as a junior, he donned the<br />\nnumber 44 jersey and found<br />\nhimself in the starting quarterback slot. Coach Wilson Fewster's passing strategy soon enabled him to demonstrate his<br />\naerial ability. He completed 46<br />\nout of 90 attempts for 529 yards<br />\nand five touchdowns.<br />\nWhen Alex Sotir took over the<br />\nreins as coach this year, he<br />\npromised to restore the ground<br />\nattack to Hopkins' offense. It<br />\nParthemore's<br />\nappeared<br />\nthat<br />\npassing threat would take a back<br />\nseat to the running of Bob Shannon and Mark Croft. Parthemore<br />\nhas stated, on the contrary, that<br />\nthis year's running game has<br />\n<br />\nz<br />\n<br />\nFREE...<br />\nfor the man who takes<br />\nhis pipe seriously.<br />\n<br />\nby WI oothof of T.OT'.ANt<br />\n<br />\nMichael Harrington's THE OTHER AMERICA has been credited with playing an important<br />\nrole in starting the War on Poverty. As Eliot Fremont-Smith wrote in The New York<br />\nTimes, \"It therefore has the distinction of being one of those rare books that directly<br />\nInfluence political action.\"<br />\n<br />\nWe've just perfected a completely new pipe mixture, called<br />\nLuxembourg. It's for the man who has graduated from the<br />\nsyrupy-sweet tobaccos. Blended from choice U.S., European,<br />\nMiddle Eastern, African and Asian leaf...and subtly enriched<br />\nwith one of the rarest honeys in the world.<br />\nWe'd like you to try a pack on us. How come?<br />\nWe figure one pack is just about what it'll take to convince you<br />\nthat it's the finest pipe mixture around.<br />\nAfter that, who knows ,.. you might make it your regular smoke.<br />\n<br />\nenhanced his potential through<br />\nthe air by drawing off opponents'<br />\ncoverage. '1 ._e facts bear him<br />\nout.<br />\nStrictly Statistics<br />\nThis year, the senior has completed almost fifty percent of his<br />\npass attempts — 34 for 73.<br />\nSteve Latson and Jim Feely have<br />\nfound themselves at the other<br />\nend most of the time. He posts<br />\nfour touchdown passes and one<br />\ntwo-point conversion. In ninetynine plays, Parthemore has<br />\ngained a total of 401 yards. Until the game last week, he had<br />\naccumulated forty-nine yards<br />\niushing. The Tigers threw him<br />\nfor losses totalling thirty-seven<br />\nyards.)<br />\nThe Jay quarterback also<br />\ncovers the punting assignment<br />\nand has done an excellent job<br />\nso far this season. He has booted<br />\nthe pigskin twenty-six times for<br />\n931 yards — an average of 35.4.<br />\nSotir employs a deep setback<br />\nposition which has the punter<br />\nkicking five yards further back<br />\nthan most formations. This,<br />\nalong with Phil's high kicks, has<br />\nenabled the Jays' defensemen, to<br />\nhold opponents to short punt returns.<br />\nThe Boss- Boasts<br />\nSotir lids called Parthemore an<br />\n\"excellent leader and great asset to the team. He has led the<br />\nsquad by example, and not by<br />\nword of mouth.\" The varsity<br />\nmentor opined that Phil and his<br />\nco-captain Pete Dilks, are a<br />\n\"tremendous nucleus,\" and stated<br />\nthat they have greatly aided him<br />\nin assuming his new position as<br />\nhead football coach.<br />\nTrainer Jimmy Beffson also<br />\npointed out Parthemore's leadership talent, his athletic ability,<br />\nand his love GI' football competition. \"You can tell the kind of<br />\nteam we're going to play by looking at his face before the game,\"<br />\nsays Jimmy. \"If they're very<br />\ntough, he's straight-faced; if<br />\nthey're average, he's smiling. But<br />\none thing — he is always determined, always ready to play.\"<br />\nPhil stated that if the Jays<br />\nhave a weakpoint this year, he<br />\nwould consider it to be the lack<br />\nof a consistant attack throughout a game.<br />\nHe says however, \"The guys<br />\nwho came out for the team really want to play — nobody quits.<br />\nThey're out there because they<br />\nlike it. We tire near the end of<br />\nthe game,\" he admits, \"but it's<br />\nnot just lack of depth. It's a<br />\nmatter of getting up for each<br />\nplay, not just for the game. It's<br />\na mental thing.\"<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br />\n<br />\nIn his new book, THE ACCIDENTAL CENTURY, Michael Harrington examines the cultural<br />\nand intellectual crisis confronting the United States and the rest of the Western world<br />\nin the 20th century. This crisis has been brought about by the \"accidental revolution,\"<br />\nin which an unplanned social and creative technology has haphazardly reshaped our<br />\nlives and put in doubt all our ideologies and beliefs. The resulting decadence threatens<br />\nto destroy Western civilization and with it the Western concept of man.<br />\n<br />\nCOLD SEASON<br />\nIS HERE<br />\n<br />\nThis exciting and provocative book by one of the most brilliant social critics of our time<br />\nis being widely read ...widely discussed on and off campuses all over America. Don't<br />\nmiss it. $1.25<br />\n<br />\nComplete Selection<br />\nof<br />\nCough and<br />\nCold Remedies<br />\n<br />\nOTHER CURRENT PENGUINS TO LOOK FOR AT YOUR CAMPUS BOOKSTORE<br />\n<br />\nGREEN WAY<br />\nPHARMACY<br />\n<br />\nBEFORE THE MAYFLOWER: A HISTORY OF THE NEGRO IN AMERICA 1619-1964 (Revised<br />\n$2.45<br />\nEdition). Lerone Bennett, Jr.<br />\n$2.45<br />\nCONFRONTATION: BLACK AND WHITE. Lerone Bennett, Jr.<br />\nTHE LEAN YEARS: A HISTORY OF THE AMERICAN WORKER 1920-1933. Irving Bernstein.<br />\n$2.25<br />\nVENEREAL DISEASES. R. S. Morton<br />\n<br />\n950<br />\n<br />\nTHE GREAT SALAD OIL SWINDLE. Norman C. Miller<br />\n<br />\n$1.25<br />\n<br />\nTHE PELICAN HISTORY OF GREECE. A. R. Burn<br />\n<br />\n$1.95<br />\n<br />\nPENGUIN BOOKS INC<br />\n3300 Clipper Mill Road, Baltimore, Md. 21211<br />\n<br />\nAvailable at<br />\n<br />\nJohns Hopkins Bookstore<br />\nGILMAN HALL<br />\n<br />\n(4<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br />\n<br />\nThe Imported luxury pipe mixture<br />\nP. LORILLARD COMPANY<br />\nDept. L, 200 East 42nd Street, New York, N.Y. 10017<br />\nPlease send roe a free package of Luxembourg Pipe Mixture.<br />\nName<br />\nStreet<br />\nCity<br />\n<br />\nZone<br />\n<br />\nState<br />\n<br />\nEARN FREE TRIP<br />\nTO EUROPE<br />\nOne of the largest and oldest<br />\nfirms dealing in European car<br />\ntravel seeks campus representative. Must be serious.<br />\nenterprising; preferably married graduate student, European travelled. Send resume<br />\nand reasons for applying.<br />\nCAR-TOURS IN EUROPE,<br />\nINC.<br />\n555 Fifth Ave. N.Y. 17.<br />\n(212) PL 1-3550<br />\n<br />\n\fHOMEWOOD, BALTIMORE, OCTOBER 20, 1966<br />\n<br />\nNEWS -LETTER<br />\n<br />\nThe Evening Before<br />\n<br />\nPAGE SEVEN<br />\n<br />\nB. I. A. NOTES<br />\n<br />\nTurned Down Day<br />\n`-i'o far this fall, the Jay football team has compiled a record<br />\n-of 0-3-1, and the soccer team is<br />\n0-4; thus many Hoppies are beginning to give up on fall sports<br />\n(if in fact they ever cared at all).<br />\n4.!<br />\n<br />\nThe campus is again talking<br />\nabout Maryland, Army and Navy<br />\n—not, of course, concerning their<br />\nfootball teams this fall, but their<br />\nlacrosse teams next spring. Our<br />\nlacrosse aces already can be seen<br />\nWorking-out on various after-<br />\n<br />\nHarriers Face<br />\nTowson Today<br />\n(Continued from Page 8)<br />\nobviously be a power again next<br />\nseason.<br />\nHoping to improve on their<br />\nPresent 1-3 record, the harriers<br />\nface Towson State this afternoon. Third in the conference<br />\nlast year, Towson has most of<br />\nits top runners returning. Still,<br />\nit is believed that, they are not<br />\nquite as fast as last year, and the<br />\nthinclads aim to gain their second victory.<br />\nHopkins' top runner this season has been Cliff Cyr. Cyr a<br />\njunior from Northbridge, Mass.,<br />\nhas been participating in this<br />\ngrueling sport for the past seven<br />\nyears. A chemistry major, he gets<br />\na great sense of satisfaction out<br />\nof running but feels that this<br />\nyear's team does not have enough<br />\ngood material\".<br />\n\"We lost our top two runners<br />\nin graduation\", said Cyr, \"and<br />\nto top it off, our captain Jack<br />\nLoomis, was unable to compete<br />\nthis season.\" Another major factor in the lack of depth is the<br />\nfact-that the three leading runners of the '65-66 freshman team<br />\nalso are not competing this year.<br />\nSpiked Shoe Meet<br />\nAn interesting note of upcoming cross country activity is the<br />\nannual Spiked Shoe Meet on Saturday. This event is sponsored<br />\nby members of the Johns Hopkins cross country and track<br />\nteams for between twenty and<br />\ntwenty-five high school teams<br />\nfrom the state (usually almost<br />\n150 boys). At this time, the Baltimore city teams clash with<br />\nthose from Baltimore county.<br />\n<br />\n\"SCHOOL DAYS, school di<br />\n/<br />\nDear old break-the-rule days; /<br />\nThreading a Molotov Cocktail<br />\nwick, / Taught to the tune<br />\nof a chick from 'Snick.' / You<br />\nbugged the Dean at Berkeley<br />\nso, / I let n.y hair and toenails grow. . / You wrote on<br />\nmy slate: 'Magnifico!' / When<br />\nwe were<br />\nF`\" ° fre• coPY of the<br />\ncouple oi , current<br />\nissue of NAids.\"<br />\nTIONAL REVIEW, write<br />\n•<br />\n• to Dept. CP-4, 150 E.<br />\nIIIMMENEENEL, 35 St., N. Y. 16, N. Y.<br />\n<br />\n* * * * * * * *<br />\n<br />\n\"Who makes the hest .. .<br />\nthat is the question...Harry<br />\nLittle Carry Out Shops, the<br />\nonly suggestion.\"<br />\n<br />\nBy JED LUCHOW<br />\nexactly four only on kick-offs<br />\nThe Board of Intramural Ath- and punt returns.<br />\nletics' touch football competition<br />\nThe second rule concerns an<br />\nwas somewhat limited last week option on an offensive infraction.<br />\nBy STEVE PUTNAM<br />\nbecause of'rain.<br />\nFor such an infraction there will<br />\nnoons, taking time out only for<br />\nIn fraternity games that were be a penalty of nine paces and<br />\nfraternity football, where the played, however, Beta wiped out the down replayed or the loss of<br />\nBeta pOwerhouse seems capable DU 27-0; Phi Gam shut out AD down.<br />\nof taking on the Ivy League.<br />\n25-0; ZBT downed Sig Ep 12-8,<br />\nB.I.A. B-Ball<br />\nAll teams entering B.I.A. basMeanwhile, back at the Ath- and Phi Ep edged Phi Psi, 7-6.<br />\nUpperclass dorm competition ketball competition must make<br />\nletic Center, the varsity football and soccer teams are still saw Wood defeat Royce 33-6 and an official entry at the Athletic<br />\nCenter by November 11. At this<br />\nin existence, and despite the Sylvester edge Wilson 7-6.<br />\nIn the only independent league time in the forfeiture fee must<br />\nprevailing cynicism on campus,<br />\ngame played, the Canterbury also be paid.<br />\nwill both play tomorrow.<br />\nClowns lost to Student Activities<br />\nThe Board of Intramural AthHard Luck<br />\n13-9.<br />\nletics will present the Alumni<br />\nOn paper, the statistics indiGallop<br />\nTrophy, finally, at half-time of<br />\ncate strong teams except for orle<br />\nThe Goucher Gallop will be the Hobart-Hopkins game tomorrather important area—the won- held tomorrow at 12:00 noon row.<br />\nlost column. The football team in (PROMPTLY). All contestants<br />\nCol. J. Robert Serena, faculty<br />\nits first three games matched if are to assemble at the tennis<br />\nnot exceeded its opponents per- courts near Levering Hall. All advisor of the B.I.A., was elected<br />\nformances in all statistical cate- house athletic managers have to the office of secretary-treasgories, being outscored overall by maps of the course. B.I.A. rep- urer of the Hopkins Chapter of<br />\nODK.<br />\nonly 11 points, 58-47.<br />\nresentatives will be stationed<br />\nLast weeks loss, seemingly a along the route. Participants not<br />\nrout, was actually a much closer following the designated route<br />\nGlee Club<br />\nbattle than the score indicates, will be disqualified immediately.<br />\nThe Glee Club is in need<br />\nConsidering the exceptionally<br />\nRule Change<br />\nof an accompanist for restrong opponent the team faced,<br />\nTwo new rules have gone into<br />\nhearsals and concerts. Rehearit did a remarkable job in many effect in the touch football comsals are held Tuesday and<br />\nrespects.<br />\npetition. Exactly four men must<br />\nThursdays at 4:15 P.M. in LevThe soccer team has had even remain on the offensive line, but<br />\nering Hall.<br />\nmore disappointing results, when the defensive line is restricted to<br />\none realizes that the Jays have<br />\ndominated play, time-wise; and<br />\nhave out shot opponents almost<br />\n2-1. Close losses are certainly<br />\ndemoralizing, but the sign of a<br />\nteam, if it is a team, is its comeThe Catholic Center for Johns Hopkins<br />\nback ability. The football and<br />\nsoccer teams both face tough<br />\n2941 N. Charles<br />\nBE 5-9271<br />\nopponents, and if either or both<br />\ncould break through with a win<br />\n•<br />\ntomorrow, it would finally be our<br />\nfall \"Big Weekend.\"<br />\n<br />\nWe need your head in our<br />\nbusiness<br />\n<br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie's<br />\n<br />\nNEWMAN HOUSE<br />\n'MORALS, LAW OR SITUATION?\"<br />\n<br />\nMets Fans Rally<br />\nMeanwhile, back at the campus, most fans are sitting it out<br />\nuntil the Spring, perhaps a few<br />\neven for basketball. The fairweather fan at Hopkins is a<br />\nclassic. Two weeks ago at the<br />\ngame against Haver.ford, most<br />\neveryone pulled out when they<br />\nscored their 3rd touchdown, pausing only momentarily to watch<br />\nour final tally. Hard core, diehard fans — like the Fijis —<br />\ncertainly don't hurt athletic efforts at the Hop. In fact, in close<br />\ngames throughout the year, diehard spirit could be decisive. So<br />\nwhy did the Mets finish ninth?<br />\nLOYOLA AT NOON<br />\nHOMEWOOD AT TWO<br />\n<br />\nA Discussion<br />\nSunday, October 30th<br />\n<br />\n7:30-9 P.M.<br />\n•<br />\n<br />\nALL SAINTS DAY—Tuesday, November 1st<br />\nA Holy Day of Oblirgtion<br />\nMasses (at Newman House) 4:30 and 7:30 P.M.<br />\n•<br />\n<br />\nREGULAR MASS SCHEDULE:<br />\nSundays-10:30 A.M. (at Levering Hall)<br />\nWeekdays (expt. Sat.)—4:30 P.M. (at Newman House)<br />\n(Confessions heard before all Masses)<br />\n<br />\na winter's tail...<br />\n<br />\nThE<br />\nepo<br />\n<br />\nWenn Sie<br />\n18 Jahre<br />\noder alter<br />\nsind und<br />\neinigermassen<br />\nmit ihrem<br />\nDeutsch<br />\nzurechtkommen,<br />\ndann senden<br />\nSie diesen<br />\nGutschein<br />\nein,<br />\nEr konnte<br />\nIhnen<br />\nVergniigen<br />\nund<br />\nvielleicht<br />\nsogar Nutzen<br />\nbringen!<br />\n<br />\nP,„ id<br />\nIt's a college man's best friend—the<br />\npopular long-tail look plus the authentic<br />\nCPO look,both in one versatile shirt!<br />\nGreat for before-, during- and after-class,<br />\nit's tailored of rugged wool with<br />\nbutton-down patch pockets, navy anchor<br />\nbuttons. Rich melton solids or colorful<br />\nplaids. S,M,L,XL. About $13.95<br />\n<br />\n1<br />\n<br />\nLufthansa German Airlines, Dept. UX122<br />\n410 Park Avenue<br />\nNew York, N.Y. 10022<br />\n<br />\nBitte senden Sic mir em n Antragsformular<br />\nund Informationsmaterial bber Arbeitsmaglichkeden tOrStudenten wahrend der<br />\nSommerterien 1967 in Deutschland.<br />\n<br />\nt4 AM E•<br />\n<br />\nUNIVERSIT;T•<br />\n<br />\nCMESTER•<br />\n<br />\nSPIarnarines • Pizza<br />\nWOHNORT.<br />\n<br />\nSpaghetti • Sour Beef<br />\n<br />\nFA'fiE•<br />\n<br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br />\n<br />\nat<br />\n<br />\nThe Jas. Brentley Co.—Baltimore<br />\nFrank Leonard University Shop—Baitirnore<br />\n<br />\nSTAAT:<br />\n<br />\n71P-<br />\n<br />\ne Lufthansa<br />\n* * * * * * * *<br />\n<br />\n\fPAGO EIGHT<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHOivIEWOOD, BALTIMORE, OCTOBER 28, 1964<br />\n<br />\nailM.=••••••••.,<br />\n<br />\nNEWS<br />\n<br />\nsp<br />\n<br />\nLETTER<br />\n<br />\nLuckless Pitchmen Towson On Tap<br />\nSeek Loyola Upset For Harriers<br />\nBy JEFF LAUREN<br />\nThe varsity soccer team travels<br />\nup Charles Street tomorrow to<br />\nchallenge the Greyhounds of Loyola.<br />\nThe Bluejays dropped their last<br />\ntwo decisions, with an acute<br />\nshortage of goals being the problem. Losing 2-1 to Delaware and<br />\n1-0 to Franklin & Marshall, Hopkins has reached a frustrating<br />\nlevel in mid-season.<br />\nIn both games, the Jays had<br />\n•completely controlled the entire<br />\n••• ••••<br />\n••<br />\nplay. The defense had done an<br />\nexcellent job with soph Roger<br />\nPurdom turning in some outstanding defensive plays. In the<br />\nF&M game, which was played<br />\nbefore many Big Fall Weekend<br />\nSHOT — Hopkins' varsity soccer co-captain Pablo Drobny, running spectators, the varsity booters<br />\nen a bruised ankle, drives past F&M defenseman.<br />\ndid everything right—except put<br />\nthe ball in the goal.<br />\n<br />\n'Cagey' Hobart Here<br />\nFor Sat. Grid Test<br />\nBy MIKE PHILLIPS<br />\nAfter showing increased spark<br />\ndespite a one-sided loss, the<br />\nvarsity football team gets some<br />\ntough and interesting opposition<br />\ntomorrow when it faces Hobart<br />\nhere at 2:00 P.M.<br />\nThe New York squad. 2-3<br />\nagainst opponents slightly<br />\nrougher than those to which the<br />\nJays are accustomed, uses a<br />\nwide variety of offensive and defensive sets. If nothing else, Hobart should give Homewood fans<br />\nan augmented appreciation of<br />\nfootball's strategic intracacies.<br />\nMost of this collegiate unorthodoxy can be observed when<br />\nthe defensive unit takes the field.<br />\nFrosh coach Bob Scott, who<br />\nscouted Hobart, reports that it<br />\ndisplays a wild variety of defensive formations, makes liberal<br />\nuse of an equally great amount<br />\nof stunts and blitzes, and by virtue of its aggressive gambling<br />\nstyle is virtually impossible to<br />\nanticipate.<br />\nI Formation<br />\nThe offense is somewhat more<br />\nnormal, utilizing an I formation<br />\nin which a blocking back is usually set between guard and tackle, but can be postioned as a<br />\nflanker.<br />\nSetbaks in the I are 5-8 168<br />\npound Mark Perkins, who made<br />\nthe Eastern Collegiate Athletic<br />\nConference's All Star Team when<br />\nhe went for 135 yards on 22 carries against Hamilton, and 5-8,<br />\n<br />\n172 pound Tom Morley. Quarterback Mike Hanna (171 yards<br />\npassing in a 7-6 win over Union)<br />\nleads an excellent air attack and<br />\nhas an inviting target in 6-2, 182<br />\npound speedster Bill Breck.<br />\nSome Improvement<br />\nDespite a 28-0 pasting last<br />\nweek at the hands of a strong<br />\n(Continued on Page 6)<br />\n<br />\nAll-Around Q. B.<br />\nSparks Eleven<br />\n<br />\nTough Breaks<br />\nIn the frustrating loss to the<br />\nDiplomats, Hopkins outshot F&M<br />\n24-13. The players executed drilling techniques exactly. The Jays<br />\nwere beating them at midfield<br />\nconstantly and kept the pressure<br />\non throughout the entire game.<br />\nThey were in F&M territory so<br />\nfrequently that the players jammed up in front of the goal and<br />\nthey never had very clear shots.<br />\nAgainst Delaware, Hopkins<br />\nclearly controlled the offense<br />\ntaking 27 shots to Delaware's 12.<br />\nYet, they lost 2-1. Kit Batenfeld<br />\nwas the only Bluejay able to<br />\nscore. Pablo Drobny, the team's<br />\ntop scorer, has been slowed down<br />\nby a painful ankle injury in the<br />\npast two games.<br />\nMaintaining their confidence<br />\nwill be Hopkins' toughest.job in<br />\n<br />\nfacing Loyola tomorrow. In the<br />\npast two games, the Jays have<br />\ntaken over fifty shots at the<br />\ngoal with only one score. Hopefully their luck will change for<br />\nthe better tomorrow. The Greyhounds are a much improved<br />\nteam this year and are in an<br />\nupswing. They are favorites in<br />\nthis contest because of their 4-3<br />\nrecord and well-played loss to<br />\nBaltimore University, 3-2. B.U.<br />\nin a pre-season scrimmage defeated Hopkins 4-6.<br />\nLoyola Scouted<br />\nThe Loyola squad is sparked<br />\nby the superior play of veteran<br />\nhalfbacks, Bob Szcapniack and<br />\nHarry Biedronski. Hopkins defeated Loyola last year 5-3 in a<br />\nwide.open game, but they should<br />\nhave their hands full tomorrow.<br />\nThe Bluejays will probably attempt to diversify their attack<br />\nby mixing up the offensive a<br />\nlittle and by kicking some long<br />\nshots.<br />\nA Favorite Rendes Wu<br />\nfor Hopkins Men<br />\n<br />\n•<br />\n<br />\nBy STEVE OLLOVE<br />\nIn the process of breaking a<br />\nHopkins course record, a strong<br />\nCatholic University squad stunned the varsity cross country<br />\nteam by the perfect score of<br />\n15-50.<br />\n<br />\nAlthough the Hopkins harriers<br />\nwere all able to lower their times<br />\nconsiderably, their top man finished only eighth. After the first<br />\nseven Catholic runners placed,<br />\nJohn Gardner finished for the<br />\nhome team. Following Gardner<br />\nwere Cliff Cyr, Larry Hopwood,<br />\nEd Minch and Mark Sokolay.<br />\nNew Record Set<br />\nFreshman Jerry Price of Catholic crossed the finish line in<br />\n23 minutes, breaking the mark of<br />\n23.39.2 recently set by Silas<br />\nLittle of Haverford.<br />\nCatholic was described as \"definitely the strongest team we<br />\nhave faced this year\". With no<br />\nseniors on the. squad, they will<br />\n(Continued on Page 7)<br />\n<br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY & FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nJIMMY WU'S<br />\n<br />\nNEW<br />\nCHINA INN<br />\nCharles Street below 25th<br />\n<br />\nWaverly Laundromat<br />\n<br />\nJIMMY VVU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br />\n<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br />\n<br />\n\"THE WRONG BOX is the<br />\nright movie and an irresistibly<br />\ndelicious delight!\"-N8C-Tv Today Show<br />\nCOLUMBIA PICTURES Presents<br />\n<br />\nBy JIM SLOAN<br />\nIt's tough to play on a team<br />\nwith only twenty-five guys, but<br />\nnobody's tougher than an exMarine.<br />\nBut ask Phil Parthemore if he's<br />\ntough—and he'll probably laugh<br />\nat you.<br />\nA 5' 11\", 175 pound senior.<br />\nParthemore is co-captain, a letterman, and offensive commander of the varsity football team.<br />\nThe Jay quarterback comes<br />\nfrom Villanova, Pennsylvania<br />\nwhere he attended Lower Merion<br />\nHigh School and played football<br />\nfor three years. Later he was a<br />\nleading defenseman and also a<br />\nlacrosse player at Deerfield<br />\nAcademy, a college preparatory<br />\nschool. After playing football as<br />\n(Continued on Page 6)<br />\n<br />\nBRYAN FORBES'<br />\nPRODUCTION OF<br />\n<br />\nFor Sale<br />\n<br />\n1962 VW Sunroof<br />\nGood Condition—$995<br />\n<br />\n.; •<br />\n<br />\nti<br />\n<br />\nTHE MINNMOMMAX<br />\nWRONG BOX<br />\n<br />\n1 Owner<br />\n<br />\nphone:974-1254<br />\n<br />\nc west<br />\n<br />\n1VE<br />\n<br />\n— 19561<br />\n<br />\nNorth at Charles<br />\n<br />\nLast<br />\nWeeks!<br />\n<br />\n•<br />\n<br />\nENDLESS RAVES FOR<br />\nTHE\"ENDLESS SUMMER\"<br />\n<br />\n•<br />\n<br />\nelle••<br />\n<br />\n\"CONTINUOUS EXCITEMENT \"BRILLIANT... A PERFECT<br />\n...HYPNOTIC BEAUTY... MOVIE. OUTOFSIGHT.\"<br />\n—New Yorker<br />\nBUOYANT FUN.\"<br />\n<br />\nwith Old Spice Lime<br />\n<br />\n—Vincent Canby, N.Y. Times<br />\n<br />\n\"SOMETHING VERY SPECIAL.\"<br />\n—Archer Win sten, N.Y. Post<br />\n<br />\nPrecisely what things depends on what you have in<br />\nmind. Whatever it is, Old Spice LIME can help.<br />\nIts spicy, lime-spiked aroma is very persuasive...but<br />\nso subtle, even the most wary woman is trapped<br />\nbefore she knows it! Worth trying? You bet it is!<br />\n<br />\n\"EXTRAORDINARY ENTERTAINMENT.\"<br />\n—Wanda Hale, N.Y. Daily News<br />\n<br />\n\"A KNOCKOUT OF A MOVIE.\"<br />\n—William Wolf, Cue Magazine<br />\n<br />\n71k<br />\n*1<br />\n<br />\n5<br />\n<br />\nNEXT!<br />\nwest<br />\n<br />\nIVE 7 — 19561<br />\n<br />\nNorth at Charles<br />\n<br />\nEndless Summer<br />\n<br />\nOld Spice LIME Cologne, After Shave, Gift Sets. By the makers of original Old Spice.<br />\n<br />\nA BRUCE DROWN FILM 1ff COLOR<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n\f", "format": "basic_html", "processed": "elpt<br />\nVOL. LXXI, NO. 5<br /><br />\nNano<br /><br />\n414.fttgr<br />\n71ST YEAR<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, OCTOBER 28, 1966<br /><br />\nMahoney Ignored<br />\nBy Organization<br /><br />\nL<br /><br />\nBy WILLIAM FATTEN<br />\nGeorge Mahoney is no newcomer to politics. In the<br />\npast sixteen years he has made six attempts to gain<br />\npublic office. His only conquest has been a seat on<br />\nthe Maryland State Racing Commission, held in the<br />\n1.940's. A curiosity in the present election, (Mahoney's<br />\nSeventh), is that a man so enveloped by politics should<br />\napparently lack an entourage of committed supporters.<br />\ntIowhem can we find the \"Mahoney organization\", the<br />\n*Mahoney men\". His headquarters lack the starryeyed young girls folding letters and answering the<br />\nphone (it seldom rings). The billboard and bumper<br />\nSticker advertisements are sparse. Testimonial banquets,<br />\ntelevision appearances and rallies have been confined<br />\nto the Republicans.<br />\nMahoney claims that he isn't running against another<br />\ncandidate but against the present condition \"of things\".<br />\nTherefore he needs no political alliances or wham-bha.m<br />\nCampaigns.\"The great body politic knows where George<br />\n„Mahoney stands.\" One must wonder whether this is the<br />\nCase or was Mahoney left to fend for himself by the<br />\nembarrassed political chieftains.<br />\nControls Districts<br />\nThe most powerful political \"boss\" In Baltimore is<br />\ndames H. (Jack) Pollack. His \"Trenton Democratic<br />\nClub\" controls the Fourth and Fifth Districts in Baltimore City, and branches occasionally into contested<br />\nterritory. He has manipulated elections, the Baltimore<br />\nCity Council and an occasional judge for three decades.<br />\nFor two decades George Mahoney and Jack Pollack<br />\nMillard<br />\nhave been close political allies united against<br />\nundesirable<br />\nMahoney<br />\nmade<br />\noften<br />\nunion<br />\nTawes. This<br />\nHyman Pressin the eyes of political \"moralists\" like<br />\neffective<br />\nman but Pollack's support was a coveted and<br />\nprize.<br />\nseems<br />\nPollack's participation in the present campaign<br />\nof some hankyto be minimal. There have been reports<br />\nPollack<br />\npanky in the primary but it doesn't seem that<br />\nit.<br />\nin<br />\nheart<br />\nhis<br />\nhas<br />\nPollack's<br />\nMahoney might rightfully feel cheated bydistributed<br />\nsupport. As yet no sample ballots have been<br />\nthere's reasonin the Fourth and Fifth Districts and<br />\nPollack is<br />\nable doubt Mahoney would head them. If<br />\nthe<br />\nspending money today like he did in 1958 when<br />\nthis<br />\ndoes<br />\nit<br />\n(as<br />\nMaryland<br />\nignoring<br />\nflational party was<br />\nfar Marear), then it isn't evident to the public. So<br />\nfinanced from<br />\nhoney's campaign could easily have been<br />\nhis own pocket.<br />\nPollack Hesitant<br />\npossibilities<br />\nWhy would Pollack be so hesitant? Two<br />\nDemocratic<br />\nTrenton<br />\nthe<br />\ncomprising<br />\ndistricts<br />\narise. The<br />\nJews<br />\nClub are dominated by Negroes (the Fourth) and<br />\n.(the Fifth). Pollack would have to spend a lot of<br />\nfavors within his own family to whip up support for<br />\nMahoney and his crusade against open-occupancy.<br />\nThe second reason, related to the first, is that Pollack's power source is declining rapidly. Not only is he<br />\nhesitant to exhaust it, but it is possible that his next<br />\nmistake will be his last and Mahoney offers little security. Attorney-General Finan has labeled Mahoney's<br />\ncampaign \"Pollack's last stand.\"<br />\nWith the figureheads of the Democratic party (Tydtngs, Brewster, Tawes, Sickles) avoiding Mahoney. the<br />\ntack of organiZational support •leaves the Democratic<br />\nnominee one alternative—the people. There is no need<br />\ntor Mahoney to energetically campaign if the people<br />\nalrady know (in their hearts?) that he is right. He<br />\ndoesn't have to discuss the issues, confront his opponents or spend a lot of money.<br />\nOn the other hand, with a glaring absence of supporters. did he ever have the choice?<br /><br />\npLuRYING. IN THE MAT<br /><br />\nSPIRO T. AGNEW<br /><br />\nGEORGE P. MAHONEY<br /><br />\nGroup Formed To Stop Mahoney;<br />\nSeeks Volunteers From Hopkins<br />\nBy DENN-I ESTIS<br />\n\"Democrats may have nominated for Governor one<br />\nof the worst racist bigots in the history of Maryland<br />\npolitics.\" This opinion was expressed by James Reston,<br />\nveteran New York Times columnist, in his description<br />\nthe Democratic candidate for governor, George P. Mahoney, on October 9.<br />\nSimilar statements have been echoed by many diverse national organizations including the Americans<br />\nfor Democratic Action, The New Republic, The Washington Post, and the New York Tines.<br />\nTowson State Demonstrations<br />\nSpurred on by recent racist demonstrations held by<br />\nthe National States Rights Party and the Klu Klux<br />\nKlan at Towson State College in support of Mr. Mahoney, several concerned Johns Hopkins University<br />\ngraduate studentsDemocrats, Republicans, and Independents—deciding that a Mahoney win was a distinct<br />\npossibility, formed an independent organization devoid<br />\nof the Republican and Democratic partisanship called<br />\nthe Citizens To Stop Mahoney.<br />\nThe new group's philosophy is to get every possible<br />\nvoter out in a last determined move. William Dobelle,<br />\na Hopkins graduate student in the biophysics department and coordinator of the organization, said that<br />\n\"If there's a vote left, let's get it!\"<br />\nHopkins Students Needed<br />\nThe Stop Mahoney group, in hoping to maintain a<br />\none week sustained campaign, desires to enlist the help<br />\nof many Hopkins students in this fight. They are in<br />\nneed of \"warm bodies and willing workers,\" who will<br />\nachieve their three fold purpose.<br />\nFirst, the group mebers are attempting to get the<br />\nvote out in the City of Baltimore for Spiro T. Agnew,<br />\nRepublican candidate for governor, pointing out the<br />\nfact that Carlton Sickles had been defeated by Mahoney in the primary by some 2,000 votes, or one vote<br />\nper Maryland precinct.<br />\nToo Late For Nine Changing<br />\nSecondly, the Stop Mahoney group realizes as Dobelle<br />\nsays that \"it is too late to start changing peoples'<br />\nminds. We are not planning to get anyone who plans to<br />\nvote for Mahoney to vote for Agnew. No time remains<br />\n1,0 go around changing peoples' minds.\" Instead they<br />\nare concern.ecl with running an all out effort designed<br />\nespecially at 'those districts in the city where voting<br />\nwas light during the primary and where many individuals, especially in the Negro population misinterpreted Mr. Mahoney's slogan that \"Your Home Is Your<br />\nCastle.\"<br />\nThirdly, the group hopes to incite an interest for<br />\nAgnew among Independent Gubernatorial candidate<br />\nHyman Pressman's supporters, hoping to make them<br />\nrealize the dangers which will result in the event of a<br />\nsplit vote including the possibility of a Mahoney victory with less than a voting majority.<br /><br />\nThe organization is urging that all interested persons<br />\nattend a special volunteers' meeting at the Charles<br />\nTheatre, 1711 N. Charles Street, on Saturday, October<br />\n29 at 10:00 P.M. Hopkins students are particularly encouraged as the results of this election will have definite<br />\neffects on the nation especially in the area of human<br />\nrights and politics. Among the various jobs to be performed include the canvassing of precincts—on and<br />\nbefore election day—making telephone calls, and working in the group's main headquarters at 25th Street<br />\nand Maryland Avenue.<br />\nThe bipartisan Agnew supporters _decided to support<br />\nthe Republican candidate over Mr. Pressman because<br />\nthey felt that the former was \"eminently qualified\" for<br />\nthe job, and the fact that as Republican organization<br />\ncandidate he immediately starts out with three hundred<br />\nthousand votes and proper financial backing.<br />\n• Publicity Hound<br />\nIn addition, they consider Pressman \"a publicity<br />\nhound, not the kind of man you want for administrative chief of staff.\"<br />\nThe Washington Post feels that \"Mr. Pressman is<br />\na decent and honest man, but he is not an acceptable<br />\npossibility fcl• the Governor's chair. He represents, in<br />\ngeneral, an achronistic passion for low cost, low-tax<br />\ngovernment with limited public services. His proposals<br />\nfor legalized gambling and lotteries only open the<br />\nprospect for increased crime and the unhappy social<br />\nside-effects that Southern Maryland encountered with<br />\nits slot machines.\"<br />\nPolicy Positions<br />\nRegarding the policy positions of the two major<br />\ncandidates, Mahoney has, as cited in the Washington<br />\nPost, followed a policy • of \"persistent refusal . . . to<br />\ntalk about the State's real affairs.\" When he has taken<br />\na stand, he completely evades the issues in regard to<br />\nthe tax problem, transit, crime, and highway safety.<br />\nThe Democratic candidate fails to say how or really<br />\nwhat he plans to do as governor. His only actual stand<br />\nhas been on the question of open housing, which he is<br />\ncompletely against; but even in this area, he has shown<br />\nhis lack of true knowledge of this complex issue?<br />\nMahoney has been recognized as the bosses' candidates. He is particularly noted through his long but<br />\nunsuccessful political career as a follower and \"yes\"<br />\nman.<br />\nPreferable to Mahoney<br />\nAgnew, on the other hand, has taken definite stands<br />\non all the primary issues confronting a state of Maryland's capabilities. He may not be considered a devout<br />\nliberal on the question of open housing, but his backing of the recently defeated civil rights bill is, as the<br />\nNew York Times felt, \"distinctly preferable to that of<br />\nMr. Mahoney, whose nomination was largely attributable to a 'white backlash' vote.\"<br /><br />\nPAGE TWO<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br /><br />\nElection Results Predicted to Maintain Trends<br /><br />\nBy GEOFFREY LEBAR<br />\nMr. Gallup points out that a centralization. At any<br />\nrate, in am able to visualize John Tower,<br />\nBefore the final day of reckon- similar Republican trend<br />\nsure the Republicans would have<br />\noc- 1966 Romney, Reagan, Rockefelone of the most conservative Re- held a<br />\ning on November 8th, I must curred in 1962.<br />\nhealthy group in Congress.<br />\nler (Nelson &amp; Winthrop), Agnew,<br />\nrecord my Predictions and imWhy the success of Republi- Percy, Tower, Bo Callaway, Ed- publican Senators and a gradu- The Republicans have two courpressions of this interesting cans<br />\nnow and the failure in 1964? ward Brooke, Clifford Case, Ger- ate of the London School of Eco- ses which they can<br />\nfollow to<br />\ncampaign. As a semi-professional<br />\nBarry Goldwater is only part of ald Ford, and Mark Hatfield, all nomics, sitting next to Edward<br />\nachieve success. 1) They can dispollster in Maryland this year,<br />\nthat answer. The real answer is seem to be doing all right in Brooke, a Massachu<br />\nsetts Negro, mantle the National Committ<br />\nI have felt the pulse of the peoee<br />\nthat Republicans prosper in off- their respective spheres of influwithout much emotional or politple from a new vantage point.<br />\nand fail to run candidates for<br />\nyear elections and generally lose ence. But picture these men two<br />\nAlthough, I predict a Republican,<br />\nin presidential years. This trend years from now. There is no hope ical difficulty. Yes, there are wide President, while concentrating on<br />\nSpiro T. Agnew, will be. elected<br />\nhas existed since 1936 except for for unity. The Republican party political differences, but there local offices or<br />\n2) they can start<br />\ngovernor of Maryland by more<br />\nDwight Eisenhower's victory. Is a cult of individualists. And are intellectual similarities which<br />\nelecting quality men to their nathan 13.000 votes, there is more<br />\nSignificant gains in Congress for this is something to be proud of. make capable a resolution of difto my findings. Although nationtional conventions. Obviously the<br />\nREpublicans in 1938 and 1946 are<br />\nAlso these individuals, by and ferences in a civil manner. For first<br />\n-ally, Republicans will gain over<br />\npossibility is the easiest.<br />\nan example. General Eisenhower<br />\nsome reason, I can't put a Lester<br />\n'700 state representatives, 58 U.S.<br />\nwas a pleasant exception to this large, are good men (better than<br />\nThe<br />\ntrouble simply put is that<br />\nCongressmen, 3 Senators, and 6<br />\ntrend. But unless President their Democratic opponents, any- Maddox, a grammar school<br />\nGovernors, there is still more sigthe Republican party is no<br />\ngraduate with a history of Negro<br />\nJohnson is planning to make a way.)<br />\nnificance to this election. Belonger a national party, and its<br />\nfew more Republican war heroes<br />\nanimosit<br />\ny in the same camp with<br />\nWithout<br />\nL.B.J. at the helm,<br />\ncause predictions are often<br />\nnational leaders (Nixon, Goldin Vietnam, we can discount<br />\nJohn<br />\na<br />\nTower. And perhaps the<br />\nwrong (as were some printed in<br />\nthe Democratic second level rears<br />\nthis type of reoccurence.<br />\nwater,<br />\nRomney, Scranton, and<br />\nthis column last year), politiits ugly face. Yes there's George people in general feel the same Rockefel<br />\nler) are only successful<br />\ncians must learn more from each<br />\nPresidential Jinx<br />\nMahoney, Lurleen Wallace, Wag- way.<br />\nelection.<br />\non a local level. I'm for a blank<br />\nBut how should Republicans goner Carr, Pat Brown, Frank<br />\nAlternatives<br />\nGeorge Gallup, our great correct this presidential year<br />\nspace on the 1968 ballot. (P.S.<br />\nO'Connor, Paul Douglas, EndiAmerican opinionator, shows jinx? It is apparent that<br />\nI often muse as to what would I'b only joking, Mr. Nixon.)<br />\noffthat at the Congressional level, year elections give the Republi- cott Peabody, Lester Maddox,<br />\nhave happened if the Republioutside the South, the Republi- can and Democratic state parties Zolton Ferency, Warren Wiientz,<br />\ncans<br />\nhad failed to nominate anycan party is at its greatest height their best opportun<br />\nGraduate Women<br />\nity to cam- Robert Duncan, and Jim Johnone to run against President<br />\nIn 10 years. 51% of the people paign. Republican<br />\nThe Graduate Women and<br />\nstate parties son on the Democratic side. If<br />\nprefer Republican candidates do a better job of this than<br />\nJohnson in 1964. With just a<br />\nWives Association is sponsorDemyou are up to date on your poland only 49% prefer Democratic ocrats. Perhaps it has somethi<br />\ning discussion grdups on<br />\nblank space on the ballot, I'm<br />\nng<br />\ncandidates outside the South. In to do with the general Republi- itics you can match the Repubhandicraft, child care, and<br />\nthe South only 31% of the peo- can policy of decentralization lican and Democratic opponents<br />\nliterature. Undergraduates and<br />\nple prefer Republican candidates. versus the Democratic policy<br />\nundergraduate wives are also<br />\nof I've mentioned. But somehow I<br />\nIncompletes<br />\nwelcome. Contact Dee HeiStudents having Incompletes<br />\nman, 467-2676, for information.<br />\nfrom spring semester on their<br />\nrecords must resolve them by<br />\nFRIDAY, OCTOBER 28TH, or<br />\nA button-down in a basket weave.<br />\naccept \"F's\" for the courses.<br />\n1966 Yearbooks<br />\n(Something old,something new.)<br />\nContact the Associate Dean<br />\n1966 yearbooks are now<br />\nfor Undergraduate Studies, F.<br />\navailable at The Barn from<br />\nThis Arrow shirt gives you best of<br />\nG. Dierman.<br />\n9 a.m. until 4 p.m.<br />\nboth<br /><br />\n1<br /><br />\nworlds.(1)A long-pointed<br />\ncollar roll in the most authentic<br />\ntradition.(2)A husky-looking<br />\nbasket weave that updates<br />\nordinary oxford. For other<br />\ninteresting features, check the<br />\ntapered body; back pleat and<br />\nback collar button. Lots of<br />\nstripes, solids and whites.<br />\n\"Sanforized\" labeled. $5.00.<br />\nBold New Breed from<br /><br />\nTh**\\<br /><br />\n1<br /><br />\nAdvertisement<br /><br />\nTED AGNEW NEEDS YOUR<br />\nHELP TO STOP MAHONEY!<br />\nNon-partisan volunteers are urgently needed during<br />\nthe final,<br />\ncrucial week of this nationally important campaign.<br />\nIf you<br />\nare concerned about human rights and responsible<br />\ngovernment in Maryland, you must ACT. A non-partisan<br />\nmeeting<br />\nis being held—your assistance will be invaluable,<br />\nregardless<br />\nof experience or amount of time you can offer. If<br />\nyou are a<br />\nregistered voter, please briny your I.D. Card so<br />\nwe can record<br />\nWard (or District) and Precinct number.<br />\n•<br /><br />\nVOLUNTEER MEETING<br />\nSATURDAY, OCTOBER 29th-10 A.M.<br />\nCHARLES THEATRE<br />\n1711 N. Charles Street<br />\nTransportation — Saturday, 9 a.m.; Johns Hopkins<br />\nLevering Hall — Goucher — College Center.<br /><br />\nFor Further Information: Czll CII 3-0055 (24 Hours)<br /><br />\nPlacement Bureau Announcements<br />\nGRADUATE SCHOOL INTERVIEWS—SEN/ORS<br />\nTuesday. November 1 — Northeastern University (Graduate Cooperative Program)<br />\nFriday. November 4 — U. of Chicago Grad Sch of Business<br />\nWednesday. November 9 — Columbia U. Grad Sch of Business<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL<br />\nTO ARRANGE FOR INTERVIEW<br /><br />\nINTERNATIONAL VOLUNTARY SEtIVICES<br />\nRepresentative will be on campus Friday, October 28 to talk<br />\non<br />\nwork of IVS. Arrange for interview in PLACEMENT BUREAU,<br />\n100<br />\nWhitehead Hall<br /><br />\nEXAMINATION DATES (Federal government. Dept.<br />\nof State, etc.)<br /><br />\nC AMPLE<br />\nJTORE<br />\nOPEN EVERY EVENING<br />\n'TIL 9 P.M.<br /><br />\nOnly A Few Blocks<br />\nFrom The Hopkins Campus<br />\nAt 31st &amp; Greenmount Ave.<br /><br />\nNaional Security Agency — file by November 25 to<br />\ntake test on<br />\nDecember 10<br />\nSummer employment in Federal Government — file by October<br />\nto take test on November 26; file by Dec. 9 to take test 26<br />\non<br />\nJon. 7, 1967<br />\nGraduate students and seniors in non<br />\n-science fielsls who are interested in<br />\ngovernment careers should take Federal<br />\nEntrance Exam early in<br />\nacademic year. Exams are given monthlytier, ice<br />\nthrough May.<br />\nGraduate students and seniors going to<br />\ngrad school in engineering, math.<br />\nphysics, and chemistry- who are interested<br />\nsummer employment should<br />\nregister immediately at Placement Hureau. in<br />\nSeniors ss ho have not received August letter from<br />\nPlacement Bureau and<br />\nthose who receiNed letter. but have not responded<br />\nshould contact Placement<br />\nHureau as soon as possible.<br /><br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br /><br />\nkministration Explains Outlook<br />\nOn Discrimination in Housing<br />\nThe number of commercial and<br />\nprivate off-campus housing accommodations listed with the<br />\nUniversity Housing Office in Wolman Hall has dropped from 482<br />\nin 1965 to a present total of 122,<br />\naccording to Victor H. Dates,<br />\nDirector of Special Programs at<br />\nHopkins and administration advisor on civil rights.<br />\nThis school year is the first in<br />\nwhich all private and commercial<br />\nlandlords have been required to<br />\nsign a non-discrimination pledge<br />\nbefore being listed by the University. Over 600 accommodations<br />\nwere listed several years ago before the establishment of a<br />\npledge card system for all commercial landlords in 1964.<br />\nPosition Clarified<br />\nIn an effort to clarify the University's position on human<br />\nrights, following much agitation<br />\nby the Basic Freedoms Committee last November, Secretary<br />\nRoss Jones made public a letter<br />\nto officers, faculty, students, and<br />\nemployees in December, 1965. He<br />\nendorsed the University's problems of complete non-discrimination at all levels of endeavor.<br />\nWithin a month of the publication of Mr. Jones's letter, Dr.<br />\nMilton S. Eisenhower announced<br />\nthe major change in pledge card<br />\npolicies. In light of debates over<br />\nlocal open occupancy and charges<br />\nof discrimination, Dr. Eisenhower re-emphasized that the<br />\nUniversity could not in good<br />\nconscience continue to list real<br />\nestate holdings of landlords<br />\nwhose feelings did not coincide<br />\nwith its own.<br />\nAccording to the rule, which<br />\nwent into effect this fall, all<br />\nlandlords wishing to be included<br />\non the University list must sign<br />\na pledge card stating that they<br />\nare in agreement with Hopkins'<br />\nnon-discriminatory policies and<br />\nare willing to rent their property<br />\nwithout regard to race, creed or<br />\nnational origin.<br />\nN-L Research<br />\nRecent News-Letter research<br />\namong a cross sampling of local<br />\nlandlords located east of the<br />\ncampus produced no evidence of<br />\nany discrimination. The paper<br />\nwas aided in its research by sev-<br /><br />\nThe one-and-only<br />\nSNOOPY<br />\nin his first<br />\nfull-length<br />\nnovel!<br /><br />\nPartridge Named Admin. Veep<br /><br />\nDr. Bruce J. Partridge has assumed new duties as the Unieral members of the class of versity's Treasurer and Vice<br />\n1970, including two Negroes.<br />\nPresident for Administration.<br />\nIn the fall of 1965, 30 commerFormerly Vice President for<br />\ncial landlords listed accommodations and pledge cards with the Finance and Treasurer, Dr. PartUniversity. Negroes were sent to ridge now directs additional Ldthese apartments and were acministrative activities in the areas<br />\ncepted at two places without inof personnel, contracts and<br />\ndenied<br />\nwas<br />\nthird<br />\na<br />\ncident. But<br />\nhousing. The landlord breaking grants, and governmental relathe pledge was dropped from the tions.<br />\nlist. Again last fall the University<br />\nThe duties of the late P. Stewsent letters to all private landMacaulay as Executive Vice<br />\nart<br />\nlords in the area urging them to<br />\nrent their facilities to Hopkins President of the University have<br />\nstudents and faculty.<br />\nbeen assumed by Partridge and<br />\nAccording to Mr. Dates, approx- Dr. William Bevan, Vice Presiimately 1700 grad students seek dent for Academic Affairs. Mr.<br />\noff-campus housing annually. A<br />\nMacaulay retired last June after<br />\nmajority of these are steered<br />\nthirty years' service at Hopkins.<br />\nthe<br />\nUniversity-owned<br />\ntoward<br />\nDr. Partridge will continue his<br />\nbuildings, Wolman and Greenway.<br />\nSeveral hundred undergraduates responsibilities in administering<br />\nand faculty members also look the Hopkins financial program.<br />\nHe served as a member of the<br />\nfor apartments each year.<br /><br />\nof.)<br /><br />\nPAGE THREE<br /><br />\nNEWS -LETTER<br /><br />\nUniversity's Long Range Planning Committee from 1964-1966.<br />\nA graduate of Oberlin College<br />\nand the holder of two law degrees from the Blackstone College of Law, Dr. Partridge<br /><br />\njoined the Hopkins administrative staff in September, 1964.<br />\nFrom 1958 to 1964, he was Vice<br />\nPresident for Business Management at the University of Delaware.<br /><br />\n&amp;gaitPiki%SOW<br />\nTHE<br />\nSLEEP Now<br />\n/*fr<br />\nokt<br />\nMARKED<br />\n‘11.. •<br />\nWOMAN<br />\n/0i-ft% •..••••.•...<br />\nomit.%<br />\nPETRIFIED<br />\nFOREST<br />\n\"<br />\nTHEY DRIVE SUN.<br />\nBY NIGHT<br /><br />\nEZIAL<br />\nNorth at Charles<br /><br />\nACADEME; ADMIS.CI311 OF 75F<br />\nwith Proper Identification.<br />\nC:ood at all times exceptine<br />\nafter 6:10 P.N.<br />\nSaturda<br />\nNS\\ N<br /><br />\n1VE 7 — 19561<br /><br />\nDEAR<br />\nr*<br />\n:*<br />\n•A IEI3II<br />\nEven When She Answers, He Still Gets the Busy Signal.<br />\nDEAR REB:<br /><br />\nLately, every timel call my girl, she's either \"not in\" or \"not interested.\" Last week I called her 23 times and couldn't even make a<br />\ncoffee date. The trouble started when she started dating a guy<br />\nwho owns a Dodge Coronet. Now she goes to parties with him,<br />\ndances, football games,etc. Do you think I should call her again,<br />\nor should I forget her and break her heart?<br />\nBAD CONNECTIONS<br />\nDEAR BAD CONNECTIONS:<br /><br />\nI think your next call should be to your Dodge Dealer. Then make<br />\na date to see the '67 Coronet, the car that's breaking hearts all<br />\nover America. You'll find that its good looks are pretty hard to<br />\nresist. Now, before you break your girl's heart, give her another<br />\nbreak. Ask her to go for a ride in your new Coronet. I think she'll<br />\nget the signal.<br />\n,<br /><br />\n•cotY -<br /><br />\neJ<br /><br />\nSNOOPY<br />\nAND THE<br />\nRED<br />\nBARON<br />\nby Charles M. Schulz<br />\nIt's a war story filled with<br />\nraw drama, romance, guts,<br />\nand tears. And there's a picture of Snoopy on every<br />\npage.<br /><br />\n$2 at your college bookstore<br />\nHolt, Rinehart and Winston, Inc.<br />\nAvailable At<br /><br />\nJOHNS HOPKINS<br />\nBOOKSTORE<br /><br />\nDodge Coronet 500. A campus favorite with its great new looks, ride,<br />\nHere's the heartbreaker<br />\nand list of extras that are standard. like bucket seats with either a companion seat in the middle or a<br />\ncenter console. Plush carpeting. Padded instrument panel. Padded sun visors. Seat belts, front and<br />\nrear. A choice of Six or V8 models. And lots more. So get with '67 Dodge Coronet and get busy.<br /><br />\nCHRYSLER<br />\nDODGE DIVISION 41116/<br />\n'<br /><br />\nINIDGE REBELLION OPERATION'61<br /><br />\nPAGE FOUR<br /><br />\nNEWS -LETTER<br /><br />\nOly. 31alifts fovkins tittuo-trittr<br />\nEditors-in-Chief<br />\nHenry J. Korn<br /><br />\nMelvin R. Shuster<br /><br />\nTHE BOARD OF CONTROL<br />\nBu.iness Managers<br />\nWilliam Z. Schenck<br />\nExecutive Editor<br />\nGarth Mackenzie<br /><br />\nAllan Eudell<br />\nManaging Editor<br />\nRoger C. Toll<br />\nGregory A Itsehuh<br /><br />\nAssociate Editors<br />\nHenry Hocherm an<br /><br />\nMarshall Paul<br /><br />\nSTOP MAHONEY<br />\nAfter five futile attempts, it appears that George<br />\nP. Mahoney is on the verge of succeeding in his perennial<br />\nquest for the governorship of Maryland.<br />\nSupported by the everpresent undercurrent of racial<br />\nprejudice and the recently generated swell of white backlash, the candidacy of Mahoney threatens to introduce<br />\nin to the State House the type of government reminiscent<br />\nof the Reconstruction era.<br />\nUnlike his two opponents, Mahoney has shown himself to be manifestly incapable of presenting_ a sound<br />\nprogram dealing with the issues of state finance, education, pollution control, and transportation. He has succeeded in obscuring these points through his emotional<br />\nappeals for closed housing, and the election will unfortunately hinge on the degree to which his philosophy<br />\nis shared by Maryland voters.<br />\nIn an attempt to overcome Mahoney's apparent appeal to the public, a non-partisan \"Citizens To Stop<br />\nMahoney\" organization has been formed. Its plan is to<br />\ngo into Baltimore precincts where the turnout was light<br />\nin the primary, and to convince the residents to vote<br />\nagainst Mahoney by casting their ballots for the Republican candidate, Spiro T. Agnew.<br />\nIn a state where a plurality of votes is sufficient for<br />\nelection, Mahoney is conceded to have already amassed<br />\nthe support of at least one-third of the electorate. Realizing that Independent Hyman Pressman's support is<br />\nwoefully limited to the Baltimore area, the Stop Mahoney group is playing practical politics and supporting<br />\nAgnew. Pressman, who either does not grasp the full<br />\nmeaning of the situation or is overcome with ambition,<br />\nadamantly refuses to withdraw his candidacy, a move<br />\nwhich would assure majority rule and give the voters a<br />\nclear choice.<br />\nIn order to achieve its goal, the Stop Mahoney<br />\norganization needs volunteers, and has turned to Hopkins students to enlist their all. While we recopize that<br />\nthe majority of students here are from out of town, we<br />\nstill urge that Hopkins heed this request.<br />\nFor one thing, the election has taken on national<br />\nimplications. Indicative of this is Richard Nixon's recent observation that \"the party of Jefferson, Jackson,<br />\nand Wilson has become the party of Maddox, Mahoney,<br />\nand Wallace.\"<br />\nAs a border state, Maryland becomes an important<br />\nbarometer for the fortunes of the enforcement of basic<br />\ncivil rights. While northern politicians may ignore the<br />\nelection of Wallace or Maddox, Alahoney's election would<br />\nserve to restrain enthusiastic furtherance of civil rights.<br />\nThere is yet a more compelling reason. To any student who believes that knowledge must supplant<br />\nprejudice and that freedom should breed responsibility,<br />\nthe candidacy of Mahoney is as gross an insult to him<br />\nas to the Maryland body politic. For Hopkins to remain<br />\npassive in this election is to allow Veritas Vos Liberabit<br />\nto be cruelly mocked by \"Your Home Is Your Castle.\"<br />\nOne need only consider his reaction were Mahoney<br />\nrunning for governor in his own state. That he is doing<br />\nso in Maryland seems to us to be no less a catastrophe<br />\nthan if he were a candidate in Pennsylvania or New York.<br />\n\"The actions of men,\" wrote John Locke, \"are<br />\nthe hest interpreters of their thoughts.\" In volunteering<br />\nto aid the Stop Mahoney group, Hopkins students have<br />\nthe opportunity to play a significant role in the outcome<br />\nof the election, remaining loyal, at least, to the concepts<br />\nfor which the University stands. Should Mahoney be<br />\nelected, no one will ever mistake the government of<br />\nFree State as the embodiment of Truth.<br /><br />\nCANUCK! CANUCK!<br />\nAmong its many interests the News-Letter takes it<br />\nupon itself to keep tabs on its brother student publications at Hopkins. We note with a mixture of superiority<br />\nand shame the failure of the current edition of the<br />\nHullabaloo to keep pace with new standards of Journalistic endeavor undertaken by the News-Letter, Vector,<br />\nand Charles Street Review.<br />\nWe might certainly agree that the 1965 Hullabaloo<br />\nwas a hard act to follow. It combined a new size and<br />\ncreative layout with a high standard of photography to<br />\nproduce the most memorably excellent yearbook in the<br />\nrecorded history of yearbooks.<br />\nNevertheless for the editors of the 1966 Hullabaloo<br />\nto attempt to erase the fine memory of their predecessor<br />\nby producing 200 pages of cliche was as disappointing as<br />\nit was dull.<br />\nThis, however, is no reason not to pick it up since<br />\nmost of you have already paid for it and next year is<br />\nanother year as tomorrow is another day, or something<br />\nlike that.<br /><br />\nI<br /><br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1960<br /><br />\nlite alkeinewead Scene<br /><br />\nBorn Rich<br />\nWhile glancing through the<br />\neducation section of the voluminous Sunday Times last week, this<br />\nreporter stumbled upon a startling fact. Amidst the great competitive maelstrom of modern<br />\nacademe, amidst the selective and<br />\nsuper selective schools that one<br />\nlinks with higher education in<br />\nAmerica, is a group of schools<br />\nthat advertise. It's true. They run<br />\nglorious ads in the New York<br />\nTimes telling of air conditioned<br />\nclassrooms and swimming and<br />\nmaid service, and degrees even,<br />\nand all without the anxiety of<br />\ncompetion or the trouble of taking great banks of multiple<br />\nchoice brain teasers.<br />\nFor the price of a postage<br />\nstamp one can bid for a seat<br />\nat the Pumblechook College of<br />\nMining and Dentistry, sip from<br />\nthe springs of scholarship at<br />\nPowhaten J.C., or sup at the seat<br />\nof success amidst the ivy covered walls of Balaclava Academy<br />\nof Music and Dressmaking. These<br />\nschools are seldom filled to<br />\ncapacity, and bring truth to the<br />\ngreat egalitarian maxim that<br />\neveryone can find a place in<br />\ncollege.<br /><br />\nplications. They have been advertising covertly for years, in the<br />\nform of speakers and films sent<br />\nto high schools, and it's only a<br />\nmatter of time, this reporter<br />\nfeels, until the mass media are<br />\nbesieged with college ads that<br />\nmay sound a bit like this:<br /><br />\nShe: Only a handshake, never<br />\na good night kiss, why is it<br />\nthat Jim doesn't like me?<br />\nWith the end of the post war<br />\nCould I have bad breath?<br />\nboom babies' siege on American<br />\nFriend:<br />\nWell, you asked, so I'll<br />\nCollege Campuses and the actell you. It's not your breath,<br />\ncompanying decline in applicait's your school. Leave sections and the lowering of standond rate Podunc A and M<br />\nards, one can only wonder when<br />\nand come to Wellesley. Sursome of our more venerated inveys show that Wellesley<br />\nstitutions of learning, the Hopgirls get 23% fewer handkins among them, will bow to<br />\nshakes.<br />\nnecessity and turn to Madison<br />\nAvenue for aid in soliciting apThe Hopkins, not to be out-<br /><br />\ndone, would take full advantage<br />\nof radio, T.V., newspapers, and<br />\nother methods of mass communication to bring home the message \"Veritas Vos Liberabit.\"<br />\nStudying more now, but enjoying it less, come up, come up,<br />\ncome all the way up, to Hopkins.<br />\nHopkins teaches good,'like a University should. Hop to Hopkins,<br />\nit satisfies. You're in the Hopkins<br />\ngeneration. The pressure on high<br />\nschoolers will build and build.<br />\nAds will appear on Phisohex<br />\nbottles, on Great Shakes boxes,<br />\nand to get to the younger generation, on the back of shredded<br />\nwheat. For only 25c and four<br />\nmillion boxtops you get, first, an<br />\nofficial JHU \"Guide to Universal<br />\nTruth\" (illustrated), plus, for<br />\nyour very own, a Hopkins sweatshirt, guaranteed to out cool everyone on your block. For no extra charge, if you send your<br />\nquarter in cash, you get four NoDoz, a Goucher Girl, a tour of<br />\nthe Block, a Baltimore City<br />\npoliceman for your very very<br />\nown, a genuine reproduction of<br />\nthe school ring, an autographed<br />\npicture of Mr. Vane, an honor<br />\ncode, a Homewood brick, sixteen<br />\npsychiatric treatments, a partridge in a pear tree, a picture<br />\npost card of Homewood house,<br />\na rubber doll of Daniel Gilman,<br />\nan apathy ( with dust cover),<br />\ntwelve graduate instructors, an<br />\nulcer, a case of national Bo, a<br />\nTep, and a free subscription to<br />\nNews-Letter. Offer void where<br />\ntaxed or prohibited by law.<br /><br />\nSymposium Keys Understanding<br />\nBy BARON WORMSER<br />\nThe London Times in a recent<br />\nand rather caustic editorial (reflecting a speech given by Saul<br />\nBellow) characterized American<br />\ncriticism as a perpetual struggle<br />\nbetween \"warring gangs of<br />\nacademicians.\" A...crican criticism has been charged among<br />\nmany things with the employment of \"symbol searching machines\"<br />\n(Hemingway),<br />\nwith<br />\npointless and unnecessarily voluminous studies, and a distinct<br />\nrefusal to soil its respective<br />\nhands with the findings of other<br />\ndisciplines. In short, even allowing for generalization it is not<br />\nan especially pretty picture.<br />\nIn light of this, the First International Structural Symposium must be counted as an important<br />\nevent for<br />\nWestern<br />\nAcademe. While a direct assessment of the speeches and dialogues of the Oct. 18-21 symposium is foolhardy without the<br />\naid of reflective retrospection<br />\n(the proceedings will be published next year by the Hopkins<br />\nPress), the symposium succeeded—according to Prof. Richard<br />\nMacksey—most invaluably on the<br />\nelemental level of communication. Philosophers, literary critics, sociologists, linguists, and anthropologilts were given their<br />\nfirst chance to explore a not-soold movement which is now emerging in a clearer focus on both<br />\nan inter-disciplinary and transatlantic basis.<br />\nExamples<br />\nThe problem of defining structuralism is a decidely heady one.<br />\nWhile not begging the question,<br />\nit can be said that there is no<br />\nclear cut \"structuralism,\" but<br />\nrather<br />\nstructuralisms.<br />\nmany<br />\nThough all, the disciplines present<br />\nare interested in what C. E.<br />\nPeirce termed the \"method of<br /><br />\nmethodology,\" and the patterns<br />\nof the phenomenon of man;<br />\neach discipline is intent upon the<br />\nstructure of its respective subt.<br /><br />\nthes); totalization of the work<br />\n(Prof. Charles Singleton); and<br />\ntime<br />\nand<br />\nspace<br />\ncategories<br />\n(Georges Poulet).<br /><br />\nHowever, all the structuralist<br />\nviewpoints are linked in their<br />\nbelief that one should read a<br />\nnovel .as if one were at<br />\nonce<br />\nreading it for the first time<br />\nAND<br />\nre-reading it, all at once.<br />\nStructuralism therefore recognizes the consequences of<br />\nbringing another consciousness<br />\nto the<br />\nwork (in Levi-Straus<br />\nthis appears in the relation of<br />\nthe observer to the observed)<br />\nor in<br />\nmore jargoned terms is<br />\nconcerned with the alienation<br />\nof subjectivity. The structuralist,<br />\nhowever, as Prof. Macksey<br />\nstressed<br />\nmust also come to grips with<br />\nthe<br />\nfact that there is no<br />\n\"science\"<br />\nof criticism and that a<br />\nstance of<br />\ncomplete objectivity is<br />\nabsurd.<br />\nMeeting Evaluated<br />\nAs one of the last<br />\nspeakers<br />\nNicolas Ruwet)<br />\nsuggested, a<br />\nfrank acceptance of the<br />\nlimits<br />\nand concepts of<br />\nstructures must)<br />\nIdea's Development<br />\nbe realized along with<br />\nthe recAs a critical phenomenon, ognition that there<br />\nis too much<br />\nstructuralism is primarily a re- metaphysics in the<br />\naction to the atomistic view of turalisms and not various strucenough axiolo19i,h Century positivism. The gy. However these<br />\nconcerns reidea of appropriating a total led t most<br />\nencouragingly what<br />\nstructure of meaning is in op- Lucien Goldmann<br />\nstated when<br />\nposition to the belief held by he said the<br />\nsymposium left a<br />\nCc__ite that an enumeration of great deal<br />\nunanswered.<br />\nthe parts gives the whole.<br />\nThe symposium was in<br />\nany<br />\nAs structuralism is a distinctly case, with its<br />\nfree cat times<br />\nacademic phenomenon, the role frantic)<br />\ncommunication between<br />\nof literary criticism cm be con- the various<br />\ndisciplines, its proof<br />\nsi.--red as one of its major con- that the University<br />\ncan foster<br />\ncerns. Again, to label a man a original intellectual<br />\nthought, and<br />\nstructuralist .aitic is an over- its consonant<br />\ncontemporary elesimplification as the participants ment a healthy<br />\nrebuttal to the<br />\napproached the problem of the Times' doleful<br />\ncomments,<br />\nreading of a book from such Whether structuralism<br />\nis another<br />\nvaried viewpoints as; the impor- intellectual fad or not<br />\nremains<br />\ntance of the social aspects of the to be seen but it<br />\ncertainly was<br />\nwork ( Lucien Goldmann); very nice here for<br />\nthose PAW<br />\nliguistic effects (Roland Bar- days.<br />\nFor example, the work of the<br />\nFrench anthropologist Claude<br />\nLevi-Straus has made use of the<br />\nanalysis of ritual practice in<br />\nprimitive Brazilian tribes in order to be able to view their society as a game-pattern with certain rules, penalties, and rewards.<br />\nSimilarly the first structuralist<br />\napproach to linguistics is to be<br />\nfound in the work of the Swiss<br />\nscholar Sausaere (writing from<br />\n1905-11) who studied the meaning of language. In this light the<br />\nFrenth critic Roland Barthes has<br />\nmade use of formalistic analysis<br />\nof a literary work by such \"structures\" as tense sequence. Hence<br />\nwhile there.certainly ar'i tangible<br />\nbonds among the various disciplines, there is no structuralist<br />\nmovement in the way one could<br />\nlabel surrealism an interdisciplinary movement.<br /><br />\nNEWS-LETTER<br /><br />\n\" HOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br /><br />\nPAGE FIVE<br /><br />\nWeaver Criticizes Ghettoes; Gouch. Seeks Lady-Killers<br />\nDeplores Need for Violence<br />\ndiscrimination and by not acting on employment problems until after violence had occurred.\"<br />\nWeaver emphasized the importance of integration and elimination of the ghetto in ensuring<br />\nadequate housing for all. He<br />\nspoke of the danger of black<br />\nnationalism, a dedicated foe of<br />\nThe Secretary of Housing and integration, in the fight for fairUrban Development made his re- housing.<br />\nmarks as the Albert and Gloria<br />\nSociety's Responsiveness<br />\nLyons Lecturer for this year,<br />\nIn direct connection with this<br />\nspeaking on the topic of \"New crucial crisis Secretary Weaver<br />\nDirections in Housing and Urban stated: \"If the press, local govDevelopment.\"<br />\nernment and what they (poor<br />\nAfter listing various complex Negroes) have learned to identiurban ills which confront the fy as the power structure are<br />\nnation, Dr. Weaver stated that more responsive to the racial<br />\none goal of urban renewal should nationalists than to the integrabe low cost housing in suburban tionists, a growing number of<br />\nareas to provide more job mo- Negroes will unconsciously bebility for residents of the city. come racial nationalists.\"<br />\n\"There will never be enough, or<br />\nAbove all however, Weaver<br />\nsufficient diversity of jobs in the stated, new legislation must be<br />\nghetto to meet the requirements enacted to provide both the ecoof its residents.\"<br />\nnomic means and the technical<br />\nknow-how to put a broad proRacial Imbalance<br />\nThroughout his lecture, Weaver gram of public housing into efstressed the part played by ra- fect. He commented that the<br />\ncial imbalance in maintaining goal of urban renewal should be<br />\nthe current substandard levels \"low cost housing in suburban<br />\nof housing in the core, city In areas to provide more job moconnection with this he chided bility for residents of the inner<br />\nsociety in general for its fail- city.\"<br />\nure to assist the Negro without<br />\nthe stimulant of violence.<br />\nSpecifically with regard to the<br />\nHopkins students,<br />\nabove Weaver commented: Society, including the press and<br />\ngovernment, is encouraging violence by keeping up barriers of<br />\nAddressing an audience of over<br />\n600 people, only 150 of whom<br />\nwere Hopkins undergraduates,<br />\nDr. Robert Weaver warned last<br />\nSunday that \"We must not lose<br />\nsight of the fact that rehabilitation will never produce a lasting benefit while the walls of<br />\nthe ghetto stand.\"<br /><br />\n\"Kill, Kill,\" a cry once heard small. This is a challange that I sundry that while Hopkins men<br />\nonly on the ROTC drill field will car not be passed up. Here is a may be short and unattr, ctive,<br />\nnow be heard throughout the chance to demonstrate to all and they are not manly deD:..ient.<br />\nHopkins and Goucher campuses,<br />\nand the miles in between, as the<br />\nGoucher sophomore class invites<br />\nthe Hopkins juniors to participate in a Hunt, a la \"Tenth Vic\"SHOCKING AND CONTINUOUSLY PROVOCATIVE!<br />\ntim.\" The object of the Hunt, to<br />\nkill, kill. The place, anywhere.<br />\nCONSTANTLY CAPTIVATES THE EYE AND MIND.<br />\nThe time, between now and the<br />\nMiss Varda's dissection of amour is strikingly adult and<br />\nday that some hunter or huntress<br />\nin its depiction of the variety of love ...<br />\nunembarrassed<br />\nhas eradicated ten victims, and<br />\nswitches from boudoir to boudoir to beautiful bucolic<br />\nwins the Goucher-Hopkins homicide cup.<br />\nvignettes with artistic and technical grace. A<br />\nThe brainchild at Goucher, of<br />\nRenoir background. A memorable view of the<br />\none Callie Angel, the Hunt has<br />\nmale and female—awash in familiar<br />\ncampuses<br />\non<br />\nhunted<br />\nbeen<br />\nfinand<br />\ncountry<br />\nthe<br />\ntogetherness, sacred sex and frank<br />\nthroughout<br />\nally comes to Baltimore (always<br />\nadultery.\"<br />\n.._ A. H. Weiler, N. Y Tirn•s<br />\na bit late), through the kind<br />\nsponsorship Of the Goucher Class<br />\nof '69, under the direction of<br />\nPresident Carlotta Washington.<br />\n\"A VERY UNUSUAL PICContestants, who may sign up<br />\nTURE! Beautiful! A fine,<br />\nat Gilman mail room, will be<br />\nassigned either a victim or a<br />\nconsistent originality and beauty of texture<br />\nhunter, and will have ten days<br />\nthat merits attention from all movie-goers!\"<br />\nto kill or be killed. Hunters/<br />\nWinsho, N. Y. Post<br />\nvictims may wear bullet proof<br />\nclothing and use all devious<br />\nmethods they can conjure up to<br />\n\"AGNES VARDA has skillfully constructed an unusual<br />\nkill their prey.<br />\nThe women of Goucher have<br />\ntour de force bound to thrust movie-goers into oplaid down the gauntlet, and the<br />\nposing camps! I found the film refreshing, provocatime has come for all good men<br />\nAt<br />\nup.<br />\nand exquisite to behold! Warning to men: this<br />\nit<br />\ntive,<br />\npick<br />\nto step forth and<br />\nlast reports, Goucher signees<br />\nfilm may upset either wife or mistress. Above all,<br />\nnumbered over one hundred,<br />\ndon't go see it as a threesome.'!_winion, Wolf, Cut Magozioo<br />\nwhile Hopkins' showing was<br /><br />\n\"LE BONHEUR is a tale with a moral, or<br />\nrather an amoral ... for adults about adultery. Love—which the film follows with<br />\nadult frankness and without<br />\nO'Dohorty,<br />\nembarrassment,\" 1;f•<br /><br />\nnew and old, try:<br /><br />\nPecora's Restaurant<br /><br />\nMOValitli<br /><br />\nfor the finest Italian food in town<br /><br />\nSTUDENT-PART TIME<br /><br />\n\"WELL, IT'S ABOUT TIME: A<br /><br />\n3320 Greenrnount Ave.<br />\nCARRY OUT SERVICE<br /><br />\nSPAGHETTI MEALS<br /><br />\nWork 3 evenings 3-10 or<br />\n2 evenings &amp; Saturday 9-5.<br /><br />\nCALL 889-3831<br /><br />\nPIZZA PIE A SPECIALTY<br /><br />\n$60<br /><br />\nWhat Does Religion Mean to a Quaker?<br /><br />\nCALL 837-8152<br /><br />\nTo members of the Religious Society of Friends, religion is a matter of inward, immediate experience:- faith<br />\nis directly expressed in living. In silent worship Friends<br />\nsense an overpowering oneness of humanity which so often<br />\nsends them out to relieve suffering and to build relationships among men.<br /><br />\nSeniors Desiring a position on<br />\nthe student activities commission S.A.C. Apply for Interview P.O. Box 1246 by Today.<br /><br />\nYou are welcome to share Meeting for Worship with<br />\nus, at eleven on Sunday mornings.<br /><br />\nJOHN P. NUGENT, JR.<br />\n5116 North Charles St.<br />\nID 5-3773<br /><br />\n243-7961<br /><br />\n\"AN EXQUISITE FABLE OF INFIDELITY,'<br />\n,, Magazine<br />\n.-Ti,,<br /><br />\n\"AN EXCEPTIONALLY BEAUTIFUL MOVIE. The<br />\nphotography is very nearly as exquisite as the<br />\n—Brendan GA Now Yorlrer Magoz;no<br />\nmusic.\"<br />\n\"ONE OF THE MOST BEAUTIFUL<br />\nfilms that I think you will ever see.\"<br /><br />\nStony Run Friends Meeting<br /><br />\nLife &amp; Health<br />\nInsurance<br /><br />\npicture wholly pure, where<br />\nlove Is joy! Intoxication of the<br />\neye! They make love (and<br />\nthey do tenderly and<br />\noften)...these are real<br />\npeople with a sensibility and honesty that gives grace<br />\nto anything they do or feel! You find yourself smack in<br />\n— Moon, Mortnet, VOtin MOSI02111.<br />\nan idyll!\"<br /><br />\nCritt, Todoy Show<br /><br />\nHARLEY'S<br />\nTIDEWATER FARMS<br />\n32ND &amp; OLD YORK ROAD<br /><br />\n• STEAK • FRIED CHICKEN<br />\n• SEAFOOD<br />\nWITH<br />\nSALAD,<br />\nFR. FRIES<br /><br />\n1.95<br /><br />\nGeorGe ROTH maws<br />\nAGnes varda's<br /><br />\nFRESH<br />\nBREAD &amp; BUTTER<br /><br />\nHARLEY OWNED &amp; OPERATED<br />\nALSO SANDWICHES, CHILI<br /><br />\n4(<br /><br />\n4(<br /><br />\n4( '4( -4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n-9(<br /><br />\n4(<br /><br />\n4(<br /><br />\nir<br /><br />\n4(<br /><br />\n4c<br /><br />\n4(<br /><br />\n4(<br /><br />\n'Cagey' Hobart<br />\n1 Gridders Test<br />\nParthemore Sparks<br /><br />\n41111.1.1.11CIMMECIZIONININNEC<br /><br />\nT<br /><br />\nHOMEWOOD, BALTIMORE, OCTOBER 28, 1966<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SIX<br /><br />\nCarat:us Notes<br />\n7vtors Sought<br /><br />\nPeo - le are needed desperately<br />\nfor Levering Hall's tutoring programs, particularly at Clifton<br />\nPark Jr. High. Advisors are needed for the Boys' Club, coaches<br />\nand referees are needed in intramural athletics, and'advisors are<br />\nneeded for specialty Clubs. Any<br />\nother skills or ideas can be used.<br />\nDrivers are needed for tutors.<br />\nAnyone interested, please contact<br />\nJohn O'Brien, Jim Winship, or<br />\nJoe Weinberg at Levering Hall,<br />\n243-2810.<br /><br />\nSAC Position<br />\nToday is the last day for all<br />\nseniors interested in a position<br />\non the S.A.C. to place his name<br />\nand box number in P.O. Box 1246.<br />\nInterviews will be assigned next<br />\nweek.<br /><br />\nStudents Tickets<br /><br />\nwell known English actress Maria<br />\nCorvin on October 26.<br />\nIn addition, Theater Hopkins<br />\ntickets are on sale there. All Friday and Saturday night performances have been sold out; how(Continued from Page 8)<br />\never, Thursday and Sunday night<br />\nHampdenand<br />\nwell-coached<br />\nseating is still available.<br />\nSydney unit, varsity coach Alex<br />\nSotir saw some signs of improveBus to Goucher<br />\nThe Hopkins Student Council ment in his squad and retains a<br />\nand Goucher Student Organiza- liLle optimism for tomorrow.<br /><br />\nMentor Wary Of<br />\nFoes' Gambling Spirited Grid Squad<br /><br />\ntion agreed this week to establish<br />\nweekend shuttle bus service between the two schools on a twomonth trial basis.<br />\nThe Goucher-Hopkins bus will<br />\noperate on Friday and Saturday<br />\nevenings. One-way fare will probably be twenty-five cents, with<br />\nspecial rates for those who will<br />\nride more than once during the<br />\nevening.<br />\nThe two student organizations<br />\nanticipate that the bus service<br />\nwill enable more students to take<br />\nadvantage of the cultural and<br />\nsocial attractions offered by<br />\nGoucher and Hopkins.<br /><br />\nUnder the sponsorship of the<br />\nOffice of Special Events, the<br />\nKappa Mu Chapter of the Alpha<br />\nOmega National Service FraternRoom at Top<br />\nity has opened a ticket office<br />\nThe Room at the Top re-opens<br />\non the ground floor of Shriver<br />\nHall next to the Office of Special again tonight after a week layoff during the Big Fall WeekEvents.<br />\nend. Tonight's show features the<br />\nAvailable are tickets to the \"Fore-Goers\", with JHU Junior<br />\nopera La Boheme by Puccini, to Rick Statman coming in Saturbe presented at the Lyric Theater, day. Rick, who works in the style<br />\nand to the April 19 Lyric concert of Eric Anderson, writes all his<br />\nfeaturing cellist Mstislav Rostrop- own material. Dave Kausal and<br />\novich.<br />\nJohn Shanck are also expected<br />\nThe office also handles special for short sets.<br />\nSomething new has been added<br />\nStudent Subscriptions to the Baltimore Symphony Orchestra and by the kitchen: In response to<br />\ntickets to a dramatic reading of popular demand, hot cider has<br />\n\"Out of Africa\" to be given by been placed on the menu.<br /><br />\nFirst,Michael Harrington started<br />\na war.<br />\nz<br />\nNow he's<br />\nturned to<br />\nMichael<br />\nHarrington<br />\nrevolution!<br />\nThe<br />\na Nakao. Ilarai<br /><br />\nAccidental<br />\nCentury<br /><br />\n\"Generally speaking, we did<br />\nbetter,\" he related. \"In fact, if<br />\nwe'd played the way we did last<br />\nSaturday in our first three<br />\ngames, we'd have won at least<br />\ntwo of them.',<br />\n\"Some people,\" he continued,<br />\n\"who hadn't done too well this<br />\nyear played up to their abilities<br />\nfor the first time since I've been<br />\nassociated with them; we hit,<br />\nand got hit back, harder than we<br />\nhave all season.\"<br />\nScore 'ofsibly Lower<br />\nElaborating on his optimistic<br />\ntheme, Sotir opined that last<br />\nSaturday's score could have just<br />\nas easily been 7-0 or 14-0, pointing out that Hampden-Sydney<br />\nintercepted three pa-sses in the<br />\nfirst quarter, scored one of its<br />\ntouchdowns on a long bomb, and<br />\nwas generally held on even terms<br />\nthe whole second half.<br />\nThe attack was generally less<br />\neffective, rarely getting more<br />\nthan two or three first downs in<br />\na row, reaching no closer to a<br />\nscore than around the HampdenSydney ten, and amassing only<br />\n203 yards total offense. Mark<br />\nCroft led the ball carriers with<br />\n47 yards on 18 carries.<br />\nPhil Parthemore, recovering a<br />\nbit from his three first quarter<br />\nmissthrows, completed nine of<br />\nnineteen passes for 88 yards,<br />\nwhile Mike Shaw, appearing at<br />\nthe game's conclusion, hit two of<br />\nthree for 76 yards, one a 70 yard<br />\nheave to Tom McDonough.<br /><br />\n(Continued from Page 8)<br />\na freshman at Lehigh College in<br />\nBethlehem, Pennsylvania, Phil<br />\nserved a six month term in the<br />\nMarine Corps.<br />\nPassing Prowess<br />\nIn 1965 Parthemore came to<br />\nJohns Hopkins and waited out<br />\nhis one year of ineligibility.<br />\nThen, as a junior, he donned the<br />\nnumber 44 jersey and found<br />\nhimself in the starting quarterback slot. Coach Wilson Fewster's passing strategy soon enabled him to demonstrate his<br />\naerial ability. He completed 46<br />\nout of 90 attempts for 529 yards<br />\nand five touchdowns.<br />\nWhen Alex Sotir took over the<br />\nreins as coach this year, he<br />\npromised to restore the ground<br />\nattack to Hopkins' offense. It<br />\nParthemore's<br />\nappeared<br />\nthat<br />\npassing threat would take a back<br />\nseat to the running of Bob Shannon and Mark Croft. Parthemore<br />\nhas stated, on the contrary, that<br />\nthis year's running game has<br /><br />\nz<br /><br />\nFREE...<br />\nfor the man who takes<br />\nhis pipe seriously.<br /><br />\nby WI oothof of T.OT'.ANt<br /><br />\nMichael Harrington's THE OTHER AMERICA has been credited with playing an important<br />\nrole in starting the War on Poverty. As Eliot Fremont-Smith wrote in The New York<br />\nTimes, \"It therefore has the distinction of being one of those rare books that directly<br />\nInfluence political action.\"<br /><br />\nWe've just perfected a completely new pipe mixture, called<br />\nLuxembourg. It's for the man who has graduated from the<br />\nsyrupy-sweet tobaccos. Blended from choice U.S., European,<br />\nMiddle Eastern, African and Asian leaf...and subtly enriched<br />\nwith one of the rarest honeys in the world.<br />\nWe'd like you to try a pack on us. How come?<br />\nWe figure one pack is just about what it'll take to convince you<br />\nthat it's the finest pipe mixture around.<br />\nAfter that, who knows ,.. you might make it your regular smoke.<br /><br />\nenhanced his potential through<br />\nthe air by drawing off opponents'<br />\ncoverage. '1 ._e facts bear him<br />\nout.<br />\nStrictly Statistics<br />\nThis year, the senior has completed almost fifty percent of his<br />\npass attempts — 34 for 73.<br />\nSteve Latson and Jim Feely have<br />\nfound themselves at the other<br />\nend most of the time. He posts<br />\nfour touchdown passes and one<br />\ntwo-point conversion. In ninetynine plays, Parthemore has<br />\ngained a total of 401 yards. Until the game last week, he had<br />\naccumulated forty-nine yards<br />\niushing. The Tigers threw him<br />\nfor losses totalling thirty-seven<br />\nyards.)<br />\nThe Jay quarterback also<br />\ncovers the punting assignment<br />\nand has done an excellent job<br />\nso far this season. He has booted<br />\nthe pigskin twenty-six times for<br />\n931 yards — an average of 35.4.<br />\nSotir employs a deep setback<br />\nposition which has the punter<br />\nkicking five yards further back<br />\nthan most formations. This,<br />\nalong with Phil's high kicks, has<br />\nenabled the Jays' defensemen, to<br />\nhold opponents to short punt returns.<br />\nThe Boss- Boasts<br />\nSotir lids called Parthemore an<br />\n\"excellent leader and great asset to the team. He has led the<br />\nsquad by example, and not by<br />\nword of mouth.\" The varsity<br />\nmentor opined that Phil and his<br />\nco-captain Pete Dilks, are a<br />\n\"tremendous nucleus,\" and stated<br />\nthat they have greatly aided him<br />\nin assuming his new position as<br />\nhead football coach.<br />\nTrainer Jimmy Beffson also<br />\npointed out Parthemore's leadership talent, his athletic ability,<br />\nand his love GI' football competition. \"You can tell the kind of<br />\nteam we're going to play by looking at his face before the game,\"<br />\nsays Jimmy. \"If they're very<br />\ntough, he's straight-faced; if<br />\nthey're average, he's smiling. But<br />\none thing — he is always determined, always ready to play.\"<br />\nPhil stated that if the Jays<br />\nhave a weakpoint this year, he<br />\nwould consider it to be the lack<br />\nof a consistant attack throughout a game.<br />\nHe says however, \"The guys<br />\nwho came out for the team really want to play — nobody quits.<br />\nThey're out there because they<br />\nlike it. We tire near the end of<br />\nthe game,\" he admits, \"but it's<br />\nnot just lack of depth. It's a<br />\nmatter of getting up for each<br />\nplay, not just for the game. It's<br />\na mental thing.\"<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br /><br />\nIn his new book, THE ACCIDENTAL CENTURY, Michael Harrington examines the cultural<br />\nand intellectual crisis confronting the United States and the rest of the Western world<br />\nin the 20th century. This crisis has been brought about by the \"accidental revolution,\"<br />\nin which an unplanned social and creative technology has haphazardly reshaped our<br />\nlives and put in doubt all our ideologies and beliefs. The resulting decadence threatens<br />\nto destroy Western civilization and with it the Western concept of man.<br /><br />\nCOLD SEASON<br />\nIS HERE<br /><br />\nThis exciting and provocative book by one of the most brilliant social critics of our time<br />\nis being widely read ...widely discussed on and off campuses all over America. Don't<br />\nmiss it. $1.25<br /><br />\nComplete Selection<br />\nof<br />\nCough and<br />\nCold Remedies<br /><br />\nOTHER CURRENT PENGUINS TO LOOK FOR AT YOUR CAMPUS BOOKSTORE<br /><br />\nGREEN WAY<br />\nPHARMACY<br /><br />\nBEFORE THE MAYFLOWER: A HISTORY OF THE NEGRO IN AMERICA 1619-1964 (Revised<br />\n$2.45<br />\nEdition). Lerone Bennett, Jr.<br />\n$2.45<br />\nCONFRONTATION: BLACK AND WHITE. Lerone Bennett, Jr.<br />\nTHE LEAN YEARS: A HISTORY OF THE AMERICAN WORKER 1920-1933. Irving Bernstein.<br />\n$2.25<br />\nVENEREAL DISEASES. R. S. Morton<br /><br />\n950<br /><br />\nTHE GREAT SALAD OIL SWINDLE. Norman C. Miller<br /><br />\n$1.25<br /><br />\nTHE PELICAN HISTORY OF GREECE. A. R. Burn<br /><br />\n$1.95<br /><br />\nPENGUIN BOOKS INC<br />\n3300 Clipper Mill Road, Baltimore, Md. 21211<br /><br />\nAvailable at<br /><br />\nJohns Hopkins Bookstore<br />\nGILMAN HALL<br /><br />\n(4<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rx<br /><br />\nThe Imported luxury pipe mixture<br />\nP. LORILLARD COMPANY<br />\nDept. L, 200 East 42nd Street, New York, N.Y. 10017<br />\nPlease send roe a free package of Luxembourg Pipe Mixture.<br />\nName<br />\nStreet<br />\nCity<br /><br />\nZone<br /><br />\nState<br /><br />\nEARN FREE TRIP<br />\nTO EUROPE<br />\nOne of the largest and oldest<br />\nfirms dealing in European car<br />\ntravel seeks campus representative. Must be serious.<br />\nenterprising; preferably married graduate student, European travelled. Send resume<br />\nand reasons for applying.<br />\nCAR-TOURS IN EUROPE,<br />\nINC.<br />\n555 Fifth Ave. N.Y. 17.<br />\n(212) PL 1-3550<br /><br />\nHOMEWOOD, BALTIMORE, OCTOBER 20, 1966<br /><br />\nNEWS -LETTER<br /><br />\nThe Evening Before<br /><br />\nPAGE SEVEN<br /><br />\nB. I. A. NOTES<br /><br />\nTurned Down Day<br />\n`-i'o far this fall, the Jay football team has compiled a record<br />\n-of 0-3-1, and the soccer team is<br />\n0-4; thus many Hoppies are beginning to give up on fall sports<br />\n(if in fact they ever cared at all).<br />\n4.!<br /><br />\nThe campus is again talking<br />\nabout Maryland, Army and Navy<br />\n—not, of course, concerning their<br />\nfootball teams this fall, but their<br />\nlacrosse teams next spring. Our<br />\nlacrosse aces already can be seen<br />\nWorking-out on various after-<br /><br />\nHarriers Face<br />\nTowson Today<br />\n(Continued from Page 8)<br />\nobviously be a power again next<br />\nseason.<br />\nHoping to improve on their<br />\nPresent 1-3 record, the harriers<br />\nface Towson State this afternoon. Third in the conference<br />\nlast year, Towson has most of<br />\nits top runners returning. Still,<br />\nit is believed that, they are not<br />\nquite as fast as last year, and the<br />\nthinclads aim to gain their second victory.<br />\nHopkins' top runner this season has been Cliff Cyr. Cyr a<br />\njunior from Northbridge, Mass.,<br />\nhas been participating in this<br />\ngrueling sport for the past seven<br />\nyears. A chemistry major, he gets<br />\na great sense of satisfaction out<br />\nof running but feels that this<br />\nyear's team does not have enough<br />\ngood material\".<br />\n\"We lost our top two runners<br />\nin graduation\", said Cyr, \"and<br />\nto top it off, our captain Jack<br />\nLoomis, was unable to compete<br />\nthis season.\" Another major factor in the lack of depth is the<br />\nfact-that the three leading runners of the '65-66 freshman team<br />\nalso are not competing this year.<br />\nSpiked Shoe Meet<br />\nAn interesting note of upcoming cross country activity is the<br />\nannual Spiked Shoe Meet on Saturday. This event is sponsored<br />\nby members of the Johns Hopkins cross country and track<br />\nteams for between twenty and<br />\ntwenty-five high school teams<br />\nfrom the state (usually almost<br />\n150 boys). At this time, the Baltimore city teams clash with<br />\nthose from Baltimore county.<br /><br />\n\"SCHOOL DAYS, school di<br />\n/<br />\nDear old break-the-rule days; /<br />\nThreading a Molotov Cocktail<br />\nwick, / Taught to the tune<br />\nof a chick from 'Snick.' / You<br />\nbugged the Dean at Berkeley<br />\nso, / I let n.y hair and toenails grow. . / You wrote on<br />\nmy slate: 'Magnifico!' / When<br />\nwe were<br />\nF`\" ° fre• coPY of the<br />\ncouple oi , current<br />\nissue of NAids.\"<br />\nTIONAL REVIEW, write<br />\n•<br />\n• to Dept. CP-4, 150 E.<br />\nIIIMMENEENEL, 35 St., N. Y. 16, N. Y.<br /><br />\n* * * * * * * *<br /><br />\n\"Who makes the hest .. .<br />\nthat is the question...Harry<br />\nLittle Carry Out Shops, the<br />\nonly suggestion.\"<br /><br />\nBy JED LUCHOW<br />\nexactly four only on kick-offs<br />\nThe Board of Intramural Ath- and punt returns.<br />\nletics' touch football competition<br />\nThe second rule concerns an<br />\nwas somewhat limited last week option on an offensive infraction.<br />\nBy STEVE PUTNAM<br />\nbecause of'rain.<br />\nFor such an infraction there will<br />\nnoons, taking time out only for<br />\nIn fraternity games that were be a penalty of nine paces and<br />\nfraternity football, where the played, however, Beta wiped out the down replayed or the loss of<br />\nBeta pOwerhouse seems capable DU 27-0; Phi Gam shut out AD down.<br />\nof taking on the Ivy League.<br />\n25-0; ZBT downed Sig Ep 12-8,<br />\nB.I.A. B-Ball<br />\nAll teams entering B.I.A. basMeanwhile, back at the Ath- and Phi Ep edged Phi Psi, 7-6.<br />\nUpperclass dorm competition ketball competition must make<br />\nletic Center, the varsity football and soccer teams are still saw Wood defeat Royce 33-6 and an official entry at the Athletic<br />\nCenter by November 11. At this<br />\nin existence, and despite the Sylvester edge Wilson 7-6.<br />\nIn the only independent league time in the forfeiture fee must<br />\nprevailing cynicism on campus,<br />\ngame played, the Canterbury also be paid.<br />\nwill both play tomorrow.<br />\nClowns lost to Student Activities<br />\nThe Board of Intramural AthHard Luck<br />\n13-9.<br />\nletics will present the Alumni<br />\nOn paper, the statistics indiGallop<br />\nTrophy, finally, at half-time of<br />\ncate strong teams except for orle<br />\nThe Goucher Gallop will be the Hobart-Hopkins game tomorrather important area—the won- held tomorrow at 12:00 noon row.<br />\nlost column. The football team in (PROMPTLY). All contestants<br />\nCol. J. Robert Serena, faculty<br />\nits first three games matched if are to assemble at the tennis<br />\nnot exceeded its opponents per- courts near Levering Hall. All advisor of the B.I.A., was elected<br />\nformances in all statistical cate- house athletic managers have to the office of secretary-treasgories, being outscored overall by maps of the course. B.I.A. rep- urer of the Hopkins Chapter of<br />\nODK.<br />\nonly 11 points, 58-47.<br />\nresentatives will be stationed<br />\nLast weeks loss, seemingly a along the route. Participants not<br />\nrout, was actually a much closer following the designated route<br />\nGlee Club<br />\nbattle than the score indicates, will be disqualified immediately.<br />\nThe Glee Club is in need<br />\nConsidering the exceptionally<br />\nRule Change<br />\nof an accompanist for restrong opponent the team faced,<br />\nTwo new rules have gone into<br />\nhearsals and concerts. Rehearit did a remarkable job in many effect in the touch football comsals are held Tuesday and<br />\nrespects.<br />\npetition. Exactly four men must<br />\nThursdays at 4:15 P.M. in LevThe soccer team has had even remain on the offensive line, but<br />\nering Hall.<br />\nmore disappointing results, when the defensive line is restricted to<br />\none realizes that the Jays have<br />\ndominated play, time-wise; and<br />\nhave out shot opponents almost<br />\n2-1. Close losses are certainly<br />\ndemoralizing, but the sign of a<br />\nteam, if it is a team, is its comeThe Catholic Center for Johns Hopkins<br />\nback ability. The football and<br />\nsoccer teams both face tough<br />\n2941 N. Charles<br />\nBE 5-9271<br />\nopponents, and if either or both<br />\ncould break through with a win<br />\n•<br />\ntomorrow, it would finally be our<br />\nfall \"Big Weekend.\"<br /><br />\nWe need your head in our<br />\nbusiness<br /><br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie's<br /><br />\nNEWMAN HOUSE<br />\n'MORALS, LAW OR SITUATION?\"<br /><br />\nMets Fans Rally<br />\nMeanwhile, back at the campus, most fans are sitting it out<br />\nuntil the Spring, perhaps a few<br />\neven for basketball. The fairweather fan at Hopkins is a<br />\nclassic. Two weeks ago at the<br />\ngame against Haver.ford, most<br />\neveryone pulled out when they<br />\nscored their 3rd touchdown, pausing only momentarily to watch<br />\nour final tally. Hard core, diehard fans — like the Fijis —<br />\ncertainly don't hurt athletic efforts at the Hop. In fact, in close<br />\ngames throughout the year, diehard spirit could be decisive. So<br />\nwhy did the Mets finish ninth?<br />\nLOYOLA AT NOON<br />\nHOMEWOOD AT TWO<br /><br />\nA Discussion<br />\nSunday, October 30th<br /><br />\n7:30-9 P.M.<br />\n•<br /><br />\nALL SAINTS DAY—Tuesday, November 1st<br />\nA Holy Day of Oblirgtion<br />\nMasses (at Newman House) 4:30 and 7:30 P.M.<br />\n•<br /><br />\nREGULAR MASS SCHEDULE:<br />\nSundays-10:30 A.M. (at Levering Hall)<br />\nWeekdays (expt. Sat.)—4:30 P.M. (at Newman House)<br />\n(Confessions heard before all Masses)<br /><br />\na winter's tail...<br /><br />\nThE<br />\nepo<br /><br />\nWenn Sie<br />\n18 Jahre<br />\noder alter<br />\nsind und<br />\neinigermassen<br />\nmit ihrem<br />\nDeutsch<br />\nzurechtkommen,<br />\ndann senden<br />\nSie diesen<br />\nGutschein<br />\nein,<br />\nEr konnte<br />\nIhnen<br />\nVergniigen<br />\nund<br />\nvielleicht<br />\nsogar Nutzen<br />\nbringen!<br /><br />\nP,„ id<br />\nIt's a college man's best friend—the<br />\npopular long-tail look plus the authentic<br />\nCPO look,both in one versatile shirt!<br />\nGreat for before-, during- and after-class,<br />\nit's tailored of rugged wool with<br />\nbutton-down patch pockets, navy anchor<br />\nbuttons. Rich melton solids or colorful<br />\nplaids. S,M,L,XL. About $13.95<br /><br />\n1<br /><br />\nLufthansa German Airlines, Dept. UX122<br />\n410 Park Avenue<br />\nNew York, N.Y. 10022<br /><br />\nBitte senden Sic mir em n Antragsformular<br />\nund Informationsmaterial bber Arbeitsmaglichkeden tOrStudenten wahrend der<br />\nSommerterien 1967 in Deutschland.<br /><br />\nt4 AM E•<br /><br />\nUNIVERSIT;T•<br /><br />\nCMESTER•<br /><br />\nSPIarnarines • Pizza<br />\nWOHNORT.<br /><br />\nSpaghetti • Sour Beef<br /><br />\nFA'fiE•<br /><br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br /><br />\nat<br /><br />\nThe Jas. Brentley Co.—Baltimore<br />\nFrank Leonard University Shop—Baitirnore<br /><br />\nSTAAT:<br /><br />\n71P-<br /><br />\ne Lufthansa<br />\n* * * * * * * *<br /><br />\nPAGO EIGHT<br /><br />\nNEWS-LETTER<br /><br />\nHOivIEWOOD, BALTIMORE, OCTOBER 28, 1964<br /><br />\nailM.=••••••••.,<br /><br />\nNEWS<br /><br />\nsp<br /><br />\nLETTER<br /><br />\nLuckless Pitchmen Towson On Tap<br />\nSeek Loyola Upset For Harriers<br />\nBy JEFF LAUREN<br />\nThe varsity soccer team travels<br />\nup Charles Street tomorrow to<br />\nchallenge the Greyhounds of Loyola.<br />\nThe Bluejays dropped their last<br />\ntwo decisions, with an acute<br />\nshortage of goals being the problem. Losing 2-1 to Delaware and<br />\n1-0 to Franklin &amp; Marshall, Hopkins has reached a frustrating<br />\nlevel in mid-season.<br />\nIn both games, the Jays had<br />\n•completely controlled the entire<br />\n••• ••••<br />\n••<br />\nplay. The defense had done an<br />\nexcellent job with soph Roger<br />\nPurdom turning in some outstanding defensive plays. In the<br />\nF&amp;M game, which was played<br />\nbefore many Big Fall Weekend<br />\nSHOT — Hopkins' varsity soccer co-captain Pablo Drobny, running spectators, the varsity booters<br />\nen a bruised ankle, drives past F&amp;M defenseman.<br />\ndid everything right—except put<br />\nthe ball in the goal.<br /><br />\n'Cagey' Hobart Here<br />\nFor Sat. Grid Test<br />\nBy MIKE PHILLIPS<br />\nAfter showing increased spark<br />\ndespite a one-sided loss, the<br />\nvarsity football team gets some<br />\ntough and interesting opposition<br />\ntomorrow when it faces Hobart<br />\nhere at 2:00 P.M.<br />\nThe New York squad. 2-3<br />\nagainst opponents slightly<br />\nrougher than those to which the<br />\nJays are accustomed, uses a<br />\nwide variety of offensive and defensive sets. If nothing else, Hobart should give Homewood fans<br />\nan augmented appreciation of<br />\nfootball's strategic intracacies.<br />\nMost of this collegiate unorthodoxy can be observed when<br />\nthe defensive unit takes the field.<br />\nFrosh coach Bob Scott, who<br />\nscouted Hobart, reports that it<br />\ndisplays a wild variety of defensive formations, makes liberal<br />\nuse of an equally great amount<br />\nof stunts and blitzes, and by virtue of its aggressive gambling<br />\nstyle is virtually impossible to<br />\nanticipate.<br />\nI Formation<br />\nThe offense is somewhat more<br />\nnormal, utilizing an I formation<br />\nin which a blocking back is usually set between guard and tackle, but can be postioned as a<br />\nflanker.<br />\nSetbaks in the I are 5-8 168<br />\npound Mark Perkins, who made<br />\nthe Eastern Collegiate Athletic<br />\nConference's All Star Team when<br />\nhe went for 135 yards on 22 carries against Hamilton, and 5-8,<br /><br />\n172 pound Tom Morley. Quarterback Mike Hanna (171 yards<br />\npassing in a 7-6 win over Union)<br />\nleads an excellent air attack and<br />\nhas an inviting target in 6-2, 182<br />\npound speedster Bill Breck.<br />\nSome Improvement<br />\nDespite a 28-0 pasting last<br />\nweek at the hands of a strong<br />\n(Continued on Page 6)<br /><br />\nAll-Around Q. B.<br />\nSparks Eleven<br /><br />\nTough Breaks<br />\nIn the frustrating loss to the<br />\nDiplomats, Hopkins outshot F&amp;M<br />\n24-13. The players executed drilling techniques exactly. The Jays<br />\nwere beating them at midfield<br />\nconstantly and kept the pressure<br />\non throughout the entire game.<br />\nThey were in F&amp;M territory so<br />\nfrequently that the players jammed up in front of the goal and<br />\nthey never had very clear shots.<br />\nAgainst Delaware, Hopkins<br />\nclearly controlled the offense<br />\ntaking 27 shots to Delaware's 12.<br />\nYet, they lost 2-1. Kit Batenfeld<br />\nwas the only Bluejay able to<br />\nscore. Pablo Drobny, the team's<br />\ntop scorer, has been slowed down<br />\nby a painful ankle injury in the<br />\npast two games.<br />\nMaintaining their confidence<br />\nwill be Hopkins' toughest.job in<br /><br />\nfacing Loyola tomorrow. In the<br />\npast two games, the Jays have<br />\ntaken over fifty shots at the<br />\ngoal with only one score. Hopefully their luck will change for<br />\nthe better tomorrow. The Greyhounds are a much improved<br />\nteam this year and are in an<br />\nupswing. They are favorites in<br />\nthis contest because of their 4-3<br />\nrecord and well-played loss to<br />\nBaltimore University, 3-2. B.U.<br />\nin a pre-season scrimmage defeated Hopkins 4-6.<br />\nLoyola Scouted<br />\nThe Loyola squad is sparked<br />\nby the superior play of veteran<br />\nhalfbacks, Bob Szcapniack and<br />\nHarry Biedronski. Hopkins defeated Loyola last year 5-3 in a<br />\nwide.open game, but they should<br />\nhave their hands full tomorrow.<br />\nThe Bluejays will probably attempt to diversify their attack<br />\nby mixing up the offensive a<br />\nlittle and by kicking some long<br />\nshots.<br />\nA Favorite Rendes Wu<br />\nfor Hopkins Men<br /><br />\n•<br /><br />\nBy STEVE OLLOVE<br />\nIn the process of breaking a<br />\nHopkins course record, a strong<br />\nCatholic University squad stunned the varsity cross country<br />\nteam by the perfect score of<br />\n15-50.<br /><br />\nAlthough the Hopkins harriers<br />\nwere all able to lower their times<br />\nconsiderably, their top man finished only eighth. After the first<br />\nseven Catholic runners placed,<br />\nJohn Gardner finished for the<br />\nhome team. Following Gardner<br />\nwere Cliff Cyr, Larry Hopwood,<br />\nEd Minch and Mark Sokolay.<br />\nNew Record Set<br />\nFreshman Jerry Price of Catholic crossed the finish line in<br />\n23 minutes, breaking the mark of<br />\n23.39.2 recently set by Silas<br />\nLittle of Haverford.<br />\nCatholic was described as \"definitely the strongest team we<br />\nhave faced this year\". With no<br />\nseniors on the. squad, they will<br />\n(Continued on Page 7)<br /><br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY &amp; FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nJIMMY WU'S<br /><br />\nNEW<br />\nCHINA INN<br />\nCharles Street below 25th<br /><br />\nWaverly Laundromat<br /><br />\nJIMMY VVU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br /><br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br /><br />\n\"THE WRONG BOX is the<br />\nright movie and an irresistibly<br />\ndelicious delight!\"-N8C-Tv Today Show<br />\nCOLUMBIA PICTURES Presents<br /><br />\nBy JIM SLOAN<br />\nIt's tough to play on a team<br />\nwith only twenty-five guys, but<br />\nnobody's tougher than an exMarine.<br />\nBut ask Phil Parthemore if he's<br />\ntough—and he'll probably laugh<br />\nat you.<br />\nA 5' 11\", 175 pound senior.<br />\nParthemore is co-captain, a letterman, and offensive commander of the varsity football team.<br />\nThe Jay quarterback comes<br />\nfrom Villanova, Pennsylvania<br />\nwhere he attended Lower Merion<br />\nHigh School and played football<br />\nfor three years. Later he was a<br />\nleading defenseman and also a<br />\nlacrosse player at Deerfield<br />\nAcademy, a college preparatory<br />\nschool. After playing football as<br />\n(Continued on Page 6)<br /><br />\nBRYAN FORBES'<br />\nPRODUCTION OF<br /><br />\nFor Sale<br /><br />\n1962 VW Sunroof<br />\nGood Condition—$995<br /><br />\n.; •<br /><br />\nti<br /><br />\nTHE MINNMOMMAX<br />\nWRONG BOX<br /><br />\n1 Owner<br /><br />\nphone:974-1254<br /><br />\nc west<br /><br />\n1VE<br /><br />\n— 19561<br /><br />\nNorth at Charles<br /><br />\nLast<br />\nWeeks!<br /><br />\n•<br /><br />\nENDLESS RAVES FOR<br />\nTHE\"ENDLESS SUMMER\"<br /><br />\n•<br /><br />\nelle••<br /><br />\n\"CONTINUOUS EXCITEMENT \"BRILLIANT... A PERFECT<br />\n...HYPNOTIC BEAUTY... MOVIE. OUTOFSIGHT.\"<br />\n—New Yorker<br />\nBUOYANT FUN.\"<br /><br />\nwith Old Spice Lime<br /><br />\n—Vincent Canby, N.Y. Times<br /><br />\n\"SOMETHING VERY SPECIAL.\"<br />\n—Archer Win sten, N.Y. Post<br /><br />\nPrecisely what things depends on what you have in<br />\nmind. Whatever it is, Old Spice LIME can help.<br />\nIts spicy, lime-spiked aroma is very persuasive...but<br />\nso subtle, even the most wary woman is trapped<br />\nbefore she knows it! Worth trying? You bet it is!<br /><br />\n\"EXTRAORDINARY ENTERTAINMENT.\"<br />\n—Wanda Hale, N.Y. Daily News<br /><br />\n\"A KNOCKOUT OF A MOVIE.\"<br />\n—William Wolf, Cue Magazine<br /><br />\n71k<br />\n*1<br /><br />\n5<br /><br />\nNEXT!<br />\nwest<br /><br />\nIVE 7 — 19561<br /><br />\nNorth at Charles<br /><br />\nEndless Summer<br /><br />\nOld Spice LIME Cologne, After Shave, Gift Sets. By the makers of original Old Spice.<br /><br />\nA BRUCE DROWN FILM 1ff COLOR<br /><br />\n•<br /><br />\n•<br /><br />"}], "field_media_file": [{"target_id": 40192, "display": null, "description": null, "target_type": "file", "target_uuid": "9497579f-f82a-43ea-844e-1e2cec8c01b6", "url": "http://digital.library.jhu.edu/system/files/2022-03/13910-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13910, "target_type": "node", "target_uuid": "5457d64d-b8df-4e95-a1d6-53637cfaa029", "url": "/node/13910"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "ff8889e2-a96b-4973-bd90-e69027459892"}]}