{"mid": [{"value": 36887}], "uuid": [{"value": "b6565139-d0ec-4b41-9c9a-0a45b39ce343"}], "vid": [{"value": 36887}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13078-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 6<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br />\n<br />\nNEW CAMPUS STYLE SET BY DR. GILDERSLEEVE -92 TO- MUSICIANS ENTERTAIN ASDAY. HAS ACTIVE INTERCLASS OF C. E. SENIORS<br />\nSEMBLY WITH GUITAR<br />\nEST IN WORLD AFFAIRS<br />\nFormal Wing Collars With Ties of VaSELECTIONS<br />\nried Hue Worn to Wednesdai<br />\nRecitations<br />\n<br />\nOne of Two Surviving \"Immortals\" Has \"Amateur Night\" for Cheer Leaders.<br />\nHad Distinguished Career. Writes<br />\nAnnouncements Again Numerous.<br />\nBeautiful Greek Poetry<br />\nTribute Paid to Mr. Ball<br />\nA new standard of dignity and<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS BLANKS ALBRIGHT<br />\nIN ONE-SIDED CONTEST<br />\n<br />\nDr. Basil Tanneau Gildersleeve, The principal attraction at the Black and Blue Team Has Little Difficulty in Piling<br />\nstyle was set for lower classmen at<br />\nUp 41 Points against Visitors<br />\nHopkins by the class of civil engi- our revered and beloved ex-Profes- Assembly last Thursday was the<br />\nneering seniors when its nine mem- sor of Greek, celebrates his ninety- performance of Fargo and HamThe Johns Hopkins football team proved itself far superior to its<br />\nbers appeared at all morning reci- second birthday today. Dr. Gil- bleton on the Hawaiian guitar. rivals<br />\nin the game with Albright College last Saturday afternoon at<br />\ntations last Wednesday, October 17, dersleeve was born in Charles- The pair played numerous selec- Homewood<br />\nField. Playing before a crowd of nearly five thousand<br />\nattired in formal wing collars. Bow ton, South Carolina, October 23, tions, some old, some new, but all people<br />\nthe Black and Blue gridders completely swamped their opponents.<br />\nties of colors running the complete 1831. After preparatory education of them, judging from the enthu- At<br />\ntimes the Myerstown lads looked like they were going to register a<br />\ngamut of the solar spectrum added he entered Princeton University, siastic applause Of the audience, few points on their side<br />\nof the score, but the local squad held them when<br />\na picturesque and informal note to where he received the degrees of extremely popular. The musical they most eeded<br />\nto gain.<br />\nthe unusual picture. ,<br />\nA. B. and A. M. In 1853, after entertainment was rather a surPerfect football weather made<br />\nThis addition of van -colored and a year's study in Germany, he re- prise, and was, therefore, all, the<br />\nFRESHMAN NUMBER OF THE the game attractive to both spectapatterned ties to the formal wing ceived the degree of Doctor ot more appreciated.<br />\nBLACK AND BLUE JAY<br />\ntors and players; it was not too cold<br />\ncollars, instead of the customary Philosophy. From Germany he<br />\nRandolph Norwood, president<br />\nGOES TO PRESS<br />\nto sit in the stands nor was it so<br />\nfiat white or black tie, is claimed returned to his native land, and of the Student Council, called for<br />\nInitial 1923 Number to Appear Early<br />\nby the members of the class to be was made Professor of Greek at volunteers from<br />\nwarm that the players were fatigued<br />\nthe Freshman<br />\nin November. Appointments to<br />\nan absolutely unique innovation to the University of Virgina in 1856. class to form a small<br />\nStaff<br />\nAnnounced<br />\nby<br />\nthe heat. An unforturiate cirsized parade<br />\nthe men's styles this season. It is He continued at this institution for to advertise last<br />\nSaturday's game. The Black and Blue Jay went to cumstance resulted in an injury to<br />\nsaid that the next appearance of 20 years, teaching both Latin and According to plans, the Freshmen press last Friday and the FreshCaptain \"Buck\" Bonner, causing<br />\nthe \"piccadillies\" on the<br />\n. campus Greek, and publishing some of his were to meet at the athletic of- man number is scheduled to appear<br />\nhis<br />\nwithdrawal from the game at<br />\nWill be marked by specially made writings, notably his famous Latin fice at ten o'clock in the<br />\nmorning, on the campus during the early<br />\nGrammar.<br />\nPolka dot ties.<br />\nand, accompanied by the band, part of November. From all indi- the beginning of the second quar•<br />\nIn<br />\n1876<br />\nprominent<br />\nJohns<br />\nmemAccording to a<br />\nHopkins was were to parade through the down cations this issue will surpass all ter. Bonner was unable to return<br />\nber of the class interviewed yester- opened, and Dr. Gildersleeve was town streets, carrying banners ad- previous editions in color, quantity to the game, but it is not likely that<br />\nday, \"The outside world must form called to the chair of Greek, which vertising the game. After that, and quality.<br />\nhe will be on the side lines next<br />\na new impression of the dignity of he occupied until 1915. Dr. Gil- they were invited to attend the<br />\nA letter has been received from Saturday. There was no other inmen who have the high status of a dersleeve was one of President game between the Frosh football the Literary Digest requesting percident to mar the day.<br />\ncollege senior. Ordinary informal Gilman's \"six immortals,\" and is team and the City College second mission to reprint several of the<br />\nTurnbull's kicking was again a<br />\ncollars tend to prevent such an im- the last surviving member, except- team at 12:30. And after that jokes in its screen feature, \"Fun<br />\npression from forming and our idea ing Dr. Remsen, of the original they were to form on the upper from the Press.\" This is further feature of the game. 'The Hopkins<br />\nis to create an air of staidness and faculty: Gildersleeve, Sylvester, quadrangle at 1 :00<br />\nP. M.to march recognition of the Jay's superior hooter punted steadily throughout<br />\ndignity. by wearing formal neck:- Remsen, Martin, Brooks and Row- over to the field for the game with caliber.<br />\n•<br />\nthe contest, outdistancing the rival<br />\nland. During his stay at Hopkins Albright.<br />\nwear.\"<br />\nTwo new men, Roger Shaw, '25, kicker continuously. When the<br />\nAnother man interviewed claimed he received a great many honors. Norwood<br />\ncalled the attention of and Robert Heyn,'26, were appoint- Black and Blue blacks were able<br />\nthat the nucleus of the idea was It is recorded that a young Ph. ID. the<br />\nupperclassmen to the fact that ed, respectively, to the editorial to gain through the line Turnbull's<br />\nfound in a graduate student of the following Drs. Gilman and Gilderthey are expected to sit in the and art 'staffs. The positions were toe put the ball at a safe distance<br />\nSanitary Engineering class, at the sleeve reverently down the street<br />\nrooters' section and cheer for the left vacant by the resignation of up• the field. The Hopkins halfJohns Hopkins School of Hygiene, was astonished to hear them comteam at all games. The rooters' B. T. Rome and J. Scheineman back retained his leadership of the<br />\nwho habitually wore the formal plain of being bothered with invisection is for Hopkins students The new men were selected from a State try for point kickers, alpiccadillies.\" It appears that his tations to accept honorary degrees.<br />\nonly; but they are expected to long list of prospects for their abil- though he missed the bar after the<br />\nquiet air of dignity so charmed the During this time Dr. Gildersleeve<br />\nity and talent.<br />\nmake good use of it.<br />\nfifth touchdown, succeeding in the<br />\nmembers that they unanimously re- published many important works<br />\nA meeting of the editorial and other five attempts.<br />\nFor<br />\nthe<br />\nfirst<br />\nThis makes his<br />\ntime<br />\nthis<br />\nyear<br />\nthe<br />\nsolved to wear similar neckwear at on Latin and Greek.<br />\nart staffs will be held today at 12:20 record nine<br />\nAssembly<br />\nwas<br />\nsuccesses<br />\nout of ten<br />\nopened<br />\nwith<br />\nthe<br />\nthe next meeting of the class.<br />\nThen in 1915, after 39 years at<br />\nand on every Tuesday thereafter. tries.<br />\nsinging<br />\nof<br />\n\"Veritas<br />\nVos<br />\nLiberabThe psychological effect of the the University and 59 of teaching<br />\nThe purpose of these combined<br />\nThe most consistent ground-gainnew idea was found to _he tremend- and writing, Dr. Gildersleeve re- it\". The effect was extremely meetings is to secure better co-oppoor;<br />\nand<br />\nNorwood<br />\ner<br />\nemphasized<br />\nin the first quarter was Bonner,<br />\nous. Professors who met the class tired to spend the rest of his days<br />\neration and co-ordination between<br />\nthe<br />\nfact<br />\nthat<br />\nall<br />\nundergraduates<br />\nwhose<br />\nfast end runs took the vislast Wednesday found no levity, no in leisure. But this leisure is anthe two departments, editorial and<br />\nitors by surprise. The local halflack of concentration, but only a other man's work. He spends are expected to know, and should art. Under the old regime<br />\neach<br />\nstrict absorption to the subject at most of his time in his study at take pride in knowing, the Uni- staff working separately a proper backs were able to plow through<br />\nhand. Although rather more than his home on Calvert street. He versity Ode. Norwood asked that unity of purpose was lacking. This the opposite line for six and eight<br />\nmildly surprised at first by the un- takes occasional walks, but most notices for the Assembly be put in situation shall be remedied this year. yards at a time, the first touchdown<br />\ncoming after a steady march up the<br />\nusual spectacle they declared that of his time is occupied with intel- Box No. 444 before half past ten<br />\nA call for candidates was issued<br />\nThursday morning.<br />\nfield, which Albright was powerless<br />\nthey were strongly in favor of such lectual pursuits.<br />\nseveral weeks ago by the Jay and<br />\nDean<br />\nLatane<br />\nto stop. The second tally, which<br />\nreminded<br />\nthe<br />\nstuattire if it had such a remarkable<br />\nGreek poetry has always been a<br />\napplicants are still pouring in to<br />\ndents<br />\nthat<br />\ntheir<br />\ncame<br />\nsoon after the first, was won<br />\nschedules<br />\nof<br />\neffect on the seniors.<br />\nfavorite form of literature with Dr.<br />\nthe office. The hearty support is<br />\nhours<br />\nmust<br />\nbe<br />\nby<br />\nfiled<br />\nwith<br />\nforward<br />\nthe<br />\nRegpasses. A long pass by<br />\nPeople outside the campus were Gildersleeve. He now both reads<br />\ndue in part to the freshman regulaistrar<br />\nat<br />\nonce.<br />\nIf<br />\nout-,of-town<br />\nTaylor<br />\nto<br />\nBerndt placed the ball<br />\nvis- tion requiring participation<br />\neven more surprised than the pro- and writes it. Dr. Baker, of the<br />\nin some<br />\nfessors and undergraduates. Per- Greek Department of the Univer- itors come to the University in activity, but chiefly it is the result well within the enemy's territory,<br />\n'sons—whole groups of them—who sity, frequently reads Greek Po- search of a student, it is impossi- of voluntary desire to win a cov- and another long throw from Maxhad before hardly noticed the par- etry to Dr. Gildersleeve. He takes ble to find him unless his schedule eted position of the Black and Blue well to Bonner enabled the local<br />\nty of students on their journey to a keen interest in it; enjoys the is in the hands of the Registrar. Jay staff. Among the newcomers player to cross the goal-line for six<br />\nthe School of Hygiene stopped to beauty of it more than ever, and The Dean announced also that no a large amount of talent has been more points. Bonner's injury came<br />\nstare at them for minutes at a time, knows it better than most men, disorder or misconduct of any disclosed. Appointments shall not soon after this.<br />\nevidently impressed by their new even learned men, know the litera- kind would be tolerated at assem- be made until December so that<br />\nYoeman, who replaced Bonner,<br />\nblies.<br />\ndisplayed<br />\nfound dignity.<br />\na fine brand of football.<br />\nture of their native tongue. Then,<br />\nevery man shall be given ample opRobert Griffith,'25, called upon<br />\nThe<br />\nAt the present time it is unknown when he has no one at hand to<br />\ntall<br />\nfreshman<br />\nproved himself<br />\nportunity to try out.<br />\non<br />\nthe<br />\nfirst<br />\nplay<br />\nWhether another, wearing of the read aloud, Dr. Gildersleeve will the assembly to contribute to a<br />\nafter<br />\nhe went on<br />\nThe financial aspect for this year<br />\npiccadillies\" will be made in the write Greek Poetry himself. He fund to purchase a suitable token is very bright. Due to the splendid the field by making interference for<br />\nnear future. The first wearing was says that it is not for publication, of the undergraduates' recognition management of last year a substan- Taylor who carried the pigskin over<br />\nSO absolutely a success, however, but little has found its way into of the services of Mr. Thomas R.<br />\na<br />\ntial surplus was left. It will be the line for the third addition to<br />\nthat it is a practical certainty that print from time to time. At 92 3a11, who recently resigned his po- utilized in the publication of an<br />\nad- the score. The second period endundergraduates will not have long years of age Dr. Gildersleeve takes sition after serving the University ded issue, six issues in place of ed with the score 21-0, favor Hopto wait for the unusual spectacle of a keen interest in life, and in as Registrar for forty-six years. seven, and besides each magazine kins.<br />\nAlbright profited by the rest beseniors in formal neckwear and world news. He has decided opin- Griffith said little on the subject, shall be larger.<br />\nfor,<br />\nas<br />\nhe<br />\nremarked,<br />\nMr.<br />\nPolka dot ties.<br />\nBall<br />\nis<br />\ntween<br />\nhalves and showed a much<br />\nions on all matters of importance.<br />\ntoo<br />\nwell<br />\nknown<br />\nand<br />\ntoo<br />\nwell<br />\nloved<br />\ngame,<br />\nbetter<br />\nespecially in the third<br />\nBut in the end he turns to his bequarter, when they threatened to<br />\nloved Greek for true joy and by the undergraduates of Johns<br />\nHopkins for it to be necessary to<br />\nNOTICE<br />\nprevent a blanket score. Forward<br />\npleasure.<br />\nsay<br />\nmuch<br />\nabout<br />\nhim.<br />\npasses were the Pennsylvanians'<br />\nVS.<br />\nDr. John C. French, Direc\"Tom\" Jenifer, head cheer leadstrongest method of attack. Half<br />\ntor of the Bureau of Appointer, reported that the Graduate<br />\nmen's, has announced that<br />\na dozen times they tried and comNOTICE<br />\nthere are several positions<br />\nManager of Athletics, Norman C.<br />\npleted passes which took them much<br />\nAT HOMEWOOD FIELD<br />\nOpen to undergraduate stuMeeting of candidates for<br />\nKeyes, is keeping tab on the atnearer to the goal than they could<br />\ndents. For further informaSATURDAY, OCTOBER 27<br />\nFditorial Staff of 1924 Hultendance<br />\nat<br />\nthe<br />\ngames<br />\nby<br />\nmeans<br />\nhave got through the line. One of<br />\ntien, call at Room 215, Gillabaloo today at Barn, 12.20<br />\nof the signed athletic tickets. The<br />\n11.00<br />\nA.<br />\nAT<br />\nM.<br />\nman Hall.<br />\nthrows was intercepted by a<br />\ntheir<br />\nP.M.<br />\nContinued on Page 3, col. 3<br />\nContinued on page 3 col. 4<br />\nALL OUT<br />\n<br />\nHOPKINS<br />\n<br />\nHAVERFORD<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\nFROSH AGAIN VICTORIOUS<br />\nIN INTERCLASS BASEBALL<br />\nSend Seniors Down to Defeat, 13-10<br />\n<br />\n1923 PLANS REUNION<br />\nThe 1923 Class Reunion Committee, headed by \"Tom\" Landy,<br />\nheld a meeting last night after the<br />\n0. D. K. meeting in 206, M. E.<br />\nBuilding. The committee is considering holding the reunion after<br />\nthe St. John's or Maryland State<br />\ngame, probably to be followed by a<br />\n<br />\nUNIVERSITY OF NORTH CAROLINA TO ESTABLISH A<br />\nBUREAU OF VOCATION- ,<br />\nAL INFORMATION<br />\nThe Hopkins English Department has received a request for information from the University of<br />\nNorth Carolina regarding the vocational assistance that is accorded<br />\nHopkins students. The request is<br />\nthe result of the decision of that<br />\nuniversity to found an efficient Bureau of Vocational Information.<br />\nThis bureau is expected to place<br />\nat the student's disposal a considerable quantity of vocational<br />\nformation, including books and various statistics. It is also designed<br />\nto 'aid the student in choosing a<br />\ncourse which will prepare him best<br />\nfor his lifework. This department<br />\nwill be an extension of the idea<br />\nthat the courses of the pre-medical<br />\nstudents at Hopkins shall be decided upon by the faculty.<br />\nThe Hopkins vocational service<br />\nis practically limited to the requirements of English Composition<br />\nwhich every freshman must take.<br />\n<br />\nThe Freshman team won its second game of the season when it<br />\n$2.00 conquered the Seniors on the<br />\nSubscription<br />\n0-rounds back of the M. E. BuildEntered as second-class matter December 3, 1909, at the Postoffice at ing, Tuesday, October 16.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nThe game started about 4.15.<br />\nWard,<br />\nlead-off man for the Fresh- dance.<br />\nJohns<br />\nof<br />\nstudents<br />\nby<br />\nthe<br />\nPublished semi-weekly from October to June<br />\nHopkins University.<br />\nies, knocked a clean single and<br />\nBusiness communications should be addressed to the BUSINESS MAN- went to third on Newman's error. FIELD CLUB TO MAKE TRIP TO<br />\nCALVERT COUNTY<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Lowman went out at first. Keen<br />\nihould be sent to the MANAGING EDITOR.<br />\nThe Field Club is planning a<br />\nsingled, bringing Ward in. Comtrip<br />\nto the shore of the ChesaHomewood 100 mand got on when Lamar turn,<br />\nCelephone<br />\nbled, but Langluttig, forced him, peake, which borders on Calvert<br />\nManager<br />\nBusiness<br />\nEditor-in-Chief<br />\nKeen coming home. Langluttig county to make a study of the miJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nscored when Newman muffed ocene beds, so abundant from this<br />\nWheeler's long fly. Baird was point to Yorktown, Virginia. If<br />\nManaging Editor<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\nthrown out at first.<br />\nthe men planning the excursion<br />\nFITZGERALD DUNNING, '24.<br />\nThe Seniors did nothing in their can succeed in arranging reasonAssistant Managing Editor<br />\nhalf of the inning, but Tebo nearly able rates, the party headed by<br />\nT. REESE MARSH, '24.<br />\nCirculation Manager<br />\nscored<br />\nwhen Jenifer ran on a Albert Dickman will probably go<br />\nAssociate Editors<br />\nJOHN C. LEWIS, JR., '24.<br />\ndropped third strike. Lowman next Saturday. The trip will withRICHARD C. TILGHMAN, '25.<br />\nthrew him out with a pretty peg out doubt be one of the most inJOHN W. PARSONS, '25.<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME, '25.<br />\nafter putting Jenifer out.<br />\nteresting and instructive made<br />\nJunior Editors<br />\nD. MILES MARRIAN, '25.<br />\nThe -second inning started oft this year, and it is to be hoped the<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nG. DONALD GIESKE, '25.<br />\nwell for the Frosh. McAllister club will attend in a body.<br />\nARTHUR L. NELSON, '26.<br />\nJOHN T. DIXON,'24.<br />\nERNEST A. STRATHMAN, '26.<br />\nwalked. McNeil singled, then<br />\nA. J. MCKAY, '26.<br />\nLEO C. MUTH, '24.<br />\nWard went out at first. Lowman<br />\nC. EUGENE TOVELI„ '24.<br />\nALGER G. HISS, '26<br />\nOTHO J. KELLER, III, '25<br />\nEDWARD 0. MICHEL, '26.<br />\nsingled and went to second while<br />\neggirovriffir<br />\nJ. JACKSON KIDD, '26<br />\nCHARLES G. HUTZLER, '24.<br />\nMcAllister and McNeil scored.<br />\n-:• kmiliN011.111110<br />\n:<br />\n11 1<br />\n;Speawarrm:<br />\n:4•Nimminow<br />\n'....11.111161°°<br />\n1<br />\n:4<br />\n.<br />\n?<br />\n.<br />\n- 0--eamminimes<br />\n40.111<br />\n6<br />\nt'atiffaileffogliff<br />\nspi<br />\nKeen was hit by a pitched ball.<br />\ndmwardwritw<br />\n1.11111.11110riair<br />\nLowman scored when Adams<br />\n.<br />\n11111111.10014.e<br />\nMember Southern Intercollegiate Newspaper Association<br />\ntwordirape ite<br />\ncaught a foul fly back of first,<br />\nSIM Omof4(kr6./<br />\n11110III67 5,0111111L..<br />\n17aNtr,<br />\nLangluttig went out, retiring the<br />\ngiiO,0<br />\n34<br />\nas<br />\nuw<br />\nig,\"1<br />\n1<br />\n0<br />\n,4<br />\n40,t1<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nside.<br />\n'4W<br />\n0011170%.<br />\nO'Connor led off for the Seniors<br />\nwith a double. Bushey went out<br />\nBALTIMORE, MD., OCTOBER 23, 1923<br />\nat first. Oates doubled, bringing<br />\nin O'Connor. Oates went to third<br />\nNLY those who have<br />\non a passed ball and scored on a<br />\nwild pitch. The other men up<br />\nCOLLEGIATE BOARD REGULATIONS<br />\nsmoked Melachrinos<br />\nwent out.<br />\ncan judge the quality<br />\nWe wonder if the undergraduate students have forgotten that sevThe Frosh did nothing in the<br />\nof the finest Turkish<br />\neral important regulations were passed by the Board of Collegiate Studies third, but Tebo made a wonderful<br />\ncatch of McNeil's long fly and<br />\ntobacco.<br />\nlast spring. In order to prevent, if possible, embarrassing situations next robbed him of at least a double.<br />\nJune we are publishing in this column the text of these rulings, the most<br />\nAdams drew a pass. Lamar sinORIGINAL<br />\nO'Connor forced him. Jcnigled.<br />\nimportant of which says that no student may graduate with an unabfer struck out. Bushey singled,<br />\nsolved failure (due to the changing of a course) against him.<br />\nscoring Adams and O'Connor ana<br />\nwas caught off second by McNeil.<br />\nOther regulations follow:<br />\nThe fourth inning saw things<br />\n\"The One Cigarette Sold the World Over\"<br />\n\"If for any reason a student does not repeat or otherwise absolve liven up when the Freshman came<br />\na course in which he has failed, he may, with the consent of his adviser, up. Ward singled, Lowman singled and Keen singled. Command<br />\nsubstitute another course of equal value, but in every such case he will<br />\ntripled, Laugluttig singled and<br />\nbe required as a penalty for leaving a course uncompleted, to take an Wheeler doubled. O'Connor then<br />\nadditional course which will not be credited toward the 125 points re- went in the box for '24 and threw<br />\none man out at third and struck<br />\nquired for graduation.<br />\nout two more.<br />\nThe Seniors went out, 1, 2, 3.<br />\n\"No student may count for graduation more than two courses in which<br />\nIn the fifth all three outs were<br />\nhis grade for the year is below 7.<br />\nstrike-outs, but they came too far<br />\n\"A student transferring • from one undergraduate school to an- apart. Ward and Lowman struck<br />\nout. Keen singled and scored on<br />\nother, and having a failure in the former, must, in addition to the regerrors. Command drew a pass and<br />\nular requirements for a degree in the school which he is entering, make stole second and third. Langluttig<br />\ngot a base on balls. Command<br />\nup the failure or offer an additional equivalent course.\"<br />\nscored and Wheeler struck out.<br />\nAt bat for the last time the<br />\nSeniors made a futile attempt to<br />\ntie the score. Adams was walked.<br />\nWE TOLD YOU SO<br />\nLamar flied out. Jenifer singled.<br />\nAdams scored on a passed ball.<br />\n\"nothing<br />\nphilosopher<br />\nhe<br />\nknew<br />\nthat<br />\nonce said<br />\nA famous French<br />\nJenifer<br />\nscored on O'Connor's sinmore inept then the expression \"I told you so.\" Agreeing with him fully,<br />\ngle. Bushey singled. Oates flied<br />\nwe endeavored to keep from using this phrase. We could, however, out. Wasson singled and O'Confind no other that conveyed so well the meaning expressed by these four nor scored. Bushey came home on<br />\nAshton's hit. Tebo drew a pass.<br />\nwords.<br />\nWasson and Ashton scored on<br />\nTwo weeks ago an editorial appeared in the NEWS-LETTER which passed balls. Adams struck out.<br />\nLineup:<br />\nasked that someone discover or write a Hopkins \"Alma Mater.\" This<br />\nSeniors-Tebo, c and If; Adams,<br />\neditorial argued that, although the \"University Ode\" was valuable because lb; Lamar, 2b; Jenifer, ss ; O'Conof tradition, its words and difficult score rendered it unsuitable for in- nor, 3b; Bushey, cf ; Newman, rf ;<br />\nformal or semi-formal occasions. This argument was well proven at Oates, c; Wasson, If; Ashton, p.<br />\nFroshWard,2b; Lowman, 1b<br />\nthe last Weekly Assembly, when the undergraduate body was called Keen, ss ; Command, cf ; Langlutupon to sing the \"Ode\" and freshmen and upperclassmen demonstrated tif, If; Wheeler, 3b; Baird, rf ; McTHE smartness of a Stetson is only<br />\nMcNeil,<br />\np.<br />\nc;<br />\nCallister,<br />\nwords<br />\nand<br />\nmusic.<br />\nthat they were unfamiliar with both<br />\nthe first step-real appreciation of<br />\nUmpires-Marrian and Thomas.<br />\nStetson quality comes after long wear.<br />\nWe shan't say again, \"We told you so!\" We will only remark that<br />\nScore by innings:<br />\nwe are glad that no strangers were present and ask once more that some Seniors<br />\nSTYLJ:D FOR YOUNG MEN<br />\n0 2 2 0 6-10<br />\nsuitable<br />\nAlma<br />\nMater.<br />\ncomposing<br />\na<br />\nunearthing<br />\nor<br />\ntoward<br />\nmade<br />\nFrosh<br />\n3<br />\n3<br />\n0<br />\n5<br />\n2-13<br />\n.effort be<br />\nFOUNDED 1897.<br />\n<br />\nO<br />\n<br />\nMELACHRINO<br />\n.-.-<br />\n<br />\nSTETSON,c-P<br />\nHats<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS- LETTER, OCTOBER 23; 1923<br />\n,R-<br />\n<br />\n.rtinof<br />\nled<br />\nis<br />\niat<br />\nhiIce<br />\nidin-<br />\n<br />\nvaled<br />\n;a<br />\nest<br />\n2nt<br />\n<br />\nlea<br />\ncal<br />\ndeice<br />\n<br />\nreke.<br />\n<br />\nDORMITORY BOARDERS ORGANIZE CANDIDATES FOR<br />\nEDITORI- MUSICIANS ENTERTAIN ASSEMBLY HOPKINS BLANKS ALBRIGHT<br />\nGOVERNING COMMITTEE<br />\nWITH GUITAR SELECTIONS<br />\nAL<br />\nSTAFF<br />\nIN ONE-SIDED CONTEST<br />\nOF<br />\nHULLABA<br />\nThe initial step toward organizaContinued from page 1<br />\nLOO<br />\nHOLD<br />\nContinued from page.]<br />\nMEETING<br />\ntion of the new Alumni Memorial<br />\n<br />\n3<br />\n<br />\nYoung for Magill, Cook for Turnbull;<br />\nAlbright, Jones for Grigolonis, Gasull<br />\nfor Hollenbaugh, Hollenbaugh for<br />\nLeimbach, Fisher for Crumbling,<br />\nHopkins player, thus spoiling Al- Grigolonis for Jones. Hopkins scoring—Touchdowns, Turnbull, Maxbright's only chance to tally.<br />\n'well (2), Bonner, Taylor, Yeoman.<br />\nPoint after touchdowns—Turnbull, 6<br />\nIn the last period of the game (place kicks). Referee—Watkeys,<br />\nHopkins scored three touchdowns, Syracuse. Umpire—Thomas, Lafayette. Head linesman—Price, Swarthliterally running away from the more.<br />\n<br />\nA meeting of the prospective ed- records show that thirty-five per<br />\nDormitory was taken at a general<br />\nmass-meeting of the resident mem- itorial board of the 1924 Hullaba- cent. of the Freshman class, and<br />\nbers when a chairman of the House loo Was called last Wednesday by about the same percentage of upCommittee and six committeemen Editor Dunning. Only seniors will per classmen were unaccounted<br />\nwere elected last Tuesday night. be on the Board, and it was clear- for at the St. Mary's game. JeniThe honor of being the chairman of ly understood that any man failing fer called for better attendance<br />\nat Myerstown eleven. Of these Maxthe first House Committee in a to work hard for the support of the games. He asked<br />\nthat as well carried the first over the goal DONALDSON ELECTED JUNIOR<br />\nHopkins Dormitory fell to Ralph the book would be dropped from many as possible try their hand line; Yoeman being responsible<br />\nCLASS PRESIDENT BY RE-VOTE<br />\nfor<br />\n\"Prince\" Wales, while the six men the staff.<br />\nat writing songs and yells for use the other two.<br />\nEarl Donaldson was elected to<br />\nelected to work with him are as<br />\nTo have all editorial work com- later in the season. The HaverLINE-UP<br />\nhead this year's Junior Class, on<br />\nfollows: Albert Shaw, Donald pleted by January, \"write ups\" ford game will be played at 11<br />\nHOPKINS<br />\nALBRIGHT<br />\nA. Berndt<br />\nL.E<br />\nGrigolonis last Friday. When the votes were<br />\nVanneman, Richard Cox, Hubert must be begun immediately upon M., on October 27, to avoid<br />\ncon- Magill<br />\nL.T.<br />\nEverett added<br />\nup it was found that he had<br />\n\"Tex\" Barton, Edward Mount, and the selection of the Board. Art out- flict with the Princeton-Nav Wolbert<br />\nLG<br />\nLang°<br />\ny Day<br />\nC.<br />\nCrumbling<br />\nDonald Wilson. The approval ac- of-town concern has been given the game; and it must<br />\ndefeated Donald Reese by a bare<br />\nbe well adver- Barton<br />\nR.G.<br />\nSnyder<br />\ncorded these men on their election contract for engravings, so that this tised to pay<br />\nCarter<br />\nR<br />\nT<br />\nSheeley majority.<br />\nfor the increase in<br />\nRich<br />\nRE<br />\nTrumbauer<br />\nwould seem to indicate that all con- date may not be postponed.<br />\nHaverford's guarantee. Aspirants Taylor<br />\nThe following officers will asQ.B<br />\nMiller<br />\nfidence in their ability to start the<br />\nR.H<br />\nHollenbaugh sist Mr. Donaldson in the carryOnly three appointments have for positions as assistant cheer Turnbull<br />\nBonner<br />\nL.H<br />\nKengle<br />\nsystem right and to keep it running been made to<br />\nthe editorial staff: leaders were given an opportunity Maxwell<br />\nF.B<br />\nLeimbach ing out of the class functions.<br />\nso has been placed in them.<br />\nLeopold, managing editor; Howard to lead the assembly in yell and<br />\nScore by periods:<br />\nThey are: Vice-president, Albert<br />\nThis first movement made toward and Passano, photographi editors. song<br />\n14 7 0 20-41<br />\npractice. Something ap- Hopkins<br />\nc<br />\nAlbright<br />\n.0<br />\n0 0 0— 0 B. Asendorf ; secretary, William<br />\na governing committee for the new Other<br />\nmembers will be. announced proaching an \"amateur night\" was<br />\nSubstitution<br />\ns — Hopkins, Yeoman P. Calhoun; treasurer, Kelso MorAlumni MemOrial Dormitory was at the next meeting,<br />\nto be held the result, to the great delight of for Bonner, Slowik for Carter, Gillis rill, and sergeant-at-arms, Ralph<br />\nmade at a general mass-meeting Tuesday,<br />\nfor Berndt, Miliaunsky for Wolbert,<br />\nthe assembly.<br />\nOctober 23.<br />\nVanborne for Taylor, Carr for Day, G. Wales.<br />\nheld early in the week. The meeting was called by the- Faculty Committee on .the Dorms, consisting of<br />\nDean Latane, Dr. Bliss and Dr.<br />\nMathews. Dr. Bliss made a short<br />\nopening speech in whicli he strongly<br />\nstressed the 'point that the new<br />\nbuilding is in effect really more<br />\nthan'a dorm, it is a man's club. The<br />\nvery fact the building is different<br />\nfrom those of other colleges substantiates his statement. He held,<br />\ntherefore, the opinion that every<br />\nman will conduct himself as a gentleman and that few rules will be<br />\nnecessary for government.<br />\nAt the end of the meeting a collection was taken up- for subscriptions to different magazines and<br />\npapers for the reading tables in the<br />\nCommons room. A fair-sized sum<br />\nwas realized and it is expected that<br />\nthe tables will soon be supplied with<br />\nreading matter, both interesting and<br />\namusing.<br />\nPreparations are under way for<br />\na songfest to be held this week. The<br />\nfact that a piano, a most necessary<br />\nadjunct to any musical affair, is<br />\nstill in the minus quantity has held<br />\nup the good time so far, but it is<br />\nexpected that one will be forthcoming in time for the first Dorm getThe Pack Train has become a relic of the<br />\ntogether. Edward Mount, who has<br />\nmethods, and has developed entirely new<br />\ncharge of the program for the<br />\npast, along with the Prairie Schooner.<br />\nones, as well.<br />\nnight, has asked that every man<br />\nModern methods of transportation have<br />\nEngineering, as it is applied to transportawho can sing, play a musical instruleveled mountains, brought San Francisco<br />\ntion, has had to concern itself with many<br />\nment, or put on a little fancy dance<br />\nnearer to New York, and widened the markinds of materials and many ways of handling<br />\nreport to him at the earliest possikets of all our great industries.<br />\nthem<br />\nunder all manner of circumstances.<br />\nble time so as to assure place on<br />\nengineering<br />\nAnd<br />\nthe<br />\nbrains<br />\nand<br />\nenergy,<br />\nFor<br />\ninstance<br />\nthe problems surrounding the<br />\nthe line-up.<br />\nthat have developed transportation to the<br />\nhandling of iron ore, in bulk, are vastly<br />\nprominence it holds in the business of the<br />\ndifferent from those encountered in moving<br />\nworld today, are no longer employed in<br />\nany one of the finished products manufacimproving means of overland travel alone.<br />\ntured from iron ore, that must also be<br />\nStreet Railways, Elevator Systems, Intertransported in large quantities. But Enginurban Lines and Improved Shipping Lines—<br />\neering constantly meets each situation with<br />\nthese are some of the accomplishments of<br />\nimproved transportation facilities.<br />\nengineering in the development of better<br />\nIndustry, as a whole, and the nations and<br />\ntransportation.<br />\nthe people of the world owe much to the<br />\nNeither have the builders of such systems<br />\nengineers, associated with such large manubeen concerned only in the actual hauling of<br />\nfacturing industries as Westinghouse. They<br />\npeople and materials. A study of the methods<br />\nhave not only brought about vast improveof handling passengers and freight at the<br />\nments, but they have done so at a constantly<br />\nlarge terminals has developed the Terminal<br />\ndecreasing cost to those who derive the<br />\nEngineer, who has greatly improved existing<br />\nOU bet he is! He's making a tregreatest benefit from them.<br />\nmendous hit! She has just<br />\n<br />\nEngineering Levels Mountains<br />\n<br />\nTHRILLED?<br />\n<br />\nY<br />\n<br />\ntold<br />\nhim that he has hair like Rudy<br />\nValentino's. But he doesn't know<br />\nWhether to pretend that it came that<br />\nway or confess that he did it with his<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\nHe owes a lot of his manly beauty to<br />\nthat bottle. \"Vaseline\" Hair Tonic'<br />\npromotes the growth of the hair and<br />\nKeeps the scalp in the healthiest condition. At all drug stores and student<br />\nbarber shops.<br />\n<br />\nCHESEBROUGH MFG. CO.<br />\n(Consolidated)<br />\nState Street<br />\nNew York<br />\n<br />\nVaseline<br />\nREQ.U.S.PAT.OPP,<br />\n<br />\nHAIR TONIC<br />\nEvrr.v.<br />\n'Vaseline\" Product is recommended everywhere because ofitsabsolutsburityandesctivniass.<br />\n<br />\nACHIEVEMENT<br />\n<br />\nOPPORTUNITY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br />\n<br />\n4<br />\nU<br />\n<br />\n'SANFORDS<br />\n<br />\nLORD'S DAY ALLIANCE OFFERS PRIZES FOR THE<br />\nBEST ESSAYS<br />\n<br />\n1923 RUSHING DATES DRAWN AT<br />\nINTERFRATERNITY BOARD<br />\nMEETING<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nInterest ran high at the meeting<br />\nand individuality is offered here at prices that are not<br />\nMaryof<br />\nColleges<br />\nof<br />\nthe Interfraternity Board last<br />\nJuniors<br />\nof<br />\nto<br />\nOpen<br />\nFOUNTAIN PEN INK<br />\nand cannot be underquoted by any house at any time.<br />\nland<br />\nThursday when dates for rushing<br />\nC.Besides the reputation of an old-established firm<br />\nWill Improve the Action<br />\nDr. John C. French, chairman parties were drawn by lot. The<br />\nis back of each sale with a guarantee.<br />\nof Any<br />\nof the Bureau of Appointment, final assignments were as follows:<br />\nlpilitll[1.0(lig1111!<br />\nFountain<br />\nNovember 3—Delta Gamma<br />\nwishes to call attention to an anPen<br />\nTheta.<br />\nnouncement of a prize competiDECORATIONS<br />\nDRAPERIES<br />\nNovember 5—Beta Theta Pi.<br />\n•<br />\nFURNITURE<br />\ntion which was recently received<br />\nPhi.<br />\n-1111 1111 ill<br />\n343 NORTH CHARLES STREET<br />\nNovember 6—Delta<br />\nALL<br />\n•„,,,uffirlii1111111111<br />\nfrom the Lord's Day Alliance.<br />\nCOLORS<br />\nNovember 7—Alpha Kappa Phi.<br />\nNovember 8—Pi Kappa Chi.<br />\nThe subject of the competition is<br />\netif<br />\n,,ty<br />\n5sit:,,<br />\np,<br />\noCK<br />\nALL<br />\n9—Omicron Kappa<br />\nNovember<br />\nDay—Why<br />\nLord's<br />\nthe<br />\nis<br />\n\"What<br />\nSIZES<br />\nSuccessful<br />\nOmicron.<br />\nShould it be Kept?\"<br />\n•<br />\n10—Phi Kappa Psi.<br />\nNovember<br />\nMen and<br />\nThe prizes, which are limited to<br />\n\"The Ink That Made<br />\n, November 12—Alpha Delta Phi.<br />\nWomen<br />\nThe Fountain Pen Possible\" competitors in the Junior Classes November 13—Phi Gamma Del- Write Out<br />\nof the colleges of Maryland are ta.<br />\nTheirIdeas<br />\nNovember 14—Kappa Alpha.<br />\n$25 for the winning essay and $15<br />\n15—Silver<br />\nArrow<br />\nNovember<br />\nfor the second best contribution.<br />\nThe competitor who submits Club.<br />\nNovember 16—Kappa Sigma.<br />\nthe best paper in each college will<br />\nNovember 17—Sigma Tau Delbe eligible to compete in an Oratorical Contest on the same sub- ta.<br />\nOn these dates every fraternity<br />\nject, the winner of which will rehave an opportunity to make<br />\nwill<br />\nceive a prize of $25. The date of<br />\nwith rushees. Dates will<br />\none<br />\none,<br />\ndate<br />\ncontest will be announced later.<br />\nLimited<br />\nfraternity houses and<br />\nin<br />\nbe<br />\nThe only rules of the competo six hours duralimited<br />\nbe<br />\nwill<br />\nBARN CAFETERIA tition are: That the essays must tion, ,rushees leaving the house by<br />\nbe between 800 and 1,000 words,<br />\none o'clock A. M.<br />\nand must be submitted by Decem0<br />\nF2<br />\nDID<br />\nThis feature will open the rushgENEIgfTlYlt<br />\nDITEEIXEIHNIEEIEIMILaillait<br />\nber 5, 1923. Address all contriing<br />\nseason, after which a pause<br />\nbutions to the Lord's Day Alliuntil December 10 will ensue. Then<br />\nance, P. 0. Box 724.\"<br />\nthe rushing season will come to a<br />\nclimax with a period of silence, and<br />\nCoznbine the habitof research,which you are forming now,<br />\nPROFESSOR MAGOFFIN<br />\nthe bidding of men to various fraa little imagination, and you've started something.<br />\nWith<br />\nNow that Cicero, Horace, Plato, ternities.<br />\nFrom the time you are in college and as long as you<br />\nand Tom Thorp have returned<br />\nyour success in life and business will depend upon<br />\nlive,<br />\n\"The King of Lubricants\" from their vacations, let us look to Y. M. C. A. HOLDS FRATERability to work out ideas. Outline your ideas, write<br />\nNITY COUNCIL DINNER<br />\nour reborn classical department,<br />\nyour papers and lecture notes, your themes and your<br />\nA Friendship Council dinner was<br />\nSHERWOOD BROTHERS, INC.<br />\nwhile Doctors Sihler and Waters<br />\nletters, on a Remington Portable. A few days' practice<br />\nby the Hopkins Y. M. C. A.<br />\nheld<br />\nand it's faster than long hand.<br />\nare enjoying their well deserved<br />\nEsEEKCIEEEEERECIEMENHHEE<br />\nrest. In their sfead we have Dr. at the Friends Meeting House last<br />\nThe Remington Portable has the four-row keyboard—<br />\nInlike the big machines. It fits in a case only four inches<br />\nMagoffin, erstwhile Professor of Friday evening from 6 to 7:30.<br />\nof<br />\nhigh. You can use it on your lap, if you wish, for it carthe Classics at Johns Hopkins vitations were sent to a number<br />\nBoys, the place to get your<br />\nstuday<br />\nto<br />\nries<br />\nits table on its back.<br />\ndormitories,<br />\nthe<br />\nin<br />\nmen<br />\nUniversity. Dr. Magoffin assumes<br />\nmeals—and they are honin<br />\nmen<br />\nthree<br />\nabout<br />\nto<br />\nand<br />\ndents<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\nthe chair after having acquired a<br />\nest-to-goodness meals, well<br />\nhigh reputation for scholarship each fraternity on the campus.<br />\nwas to<br />\nserved, and reasonably<br />\nand teaching ability at the Mary- The object of the dinner<br />\nformathe<br />\n-for<br />\ncampaign<br />\na<br />\nlaunch<br />\npriced—is at<br />\nland institution:<br />\n25 W. FAYETTE STREET<br />\nmeet<br />\nto<br />\ngroups<br />\ndiscussion<br />\nof<br />\ntion<br />\nnow<br />\nto<br />\ndo<br />\nright<br />\nHe has much<br />\nBALTIMORE<br />\nM. C.<br />\nand as it may be some time before under the auspices of the Y.<br />\nweek,<br />\nhe gets his \"system\" working, we A. They are to meet once a<br />\nman to<br />\nmust take him to ourselves and under the supervision of a<br />\ndiscuss<br />\nto<br />\ngroup,<br />\n.each<br />\nby<br />\nchosen<br />\nbe<br />\nhelp him so that he may help us.<br />\ninterest<br />\nreligious<br />\nof<br />\nPRESCRIPTION DRUGGISTS<br />\nquestions<br />\nIt is to be hoped that he continues<br />\n1817 N. Charles St.<br />\nY.<br />\nthe<br />\nby<br />\nchosen<br />\nbeen<br />\nhave<br />\nwhich<br />\nTWO STORES:<br />\nthe daily Latin prose exercises to<br />\n(Half Block below North Ave.)<br />\nEutaw Place and North Ave.<br />\nCharles and Chase Sts.<br />\nwhich Dr. Sihler rigidly adhered M. C. A.<br />\nform<br />\nto<br />\nhopes<br />\nA.<br />\nC.<br />\nM.<br />\nY.<br />\nThe<br />\nMadison 0405<br />\nVernon 0890<br />\nand from which his students cerin<br />\ngroup<br />\na<br />\nand<br />\ngroup<br />\ndormitory<br />\nNicholas Brown, Mgr.<br />\ntainly gained much. Just as they a<br />\nwho are<br />\nwere a great aid in translation, so each fraternity. All men<br />\nare<br />\ngroups<br />\nthese<br />\nin<br />\ncltd they serve to keep the funda- not included<br />\nM.<br />\nP.<br />\n4<br />\nat<br />\ninvited to meet Tuesdays<br />\nNECKWEAR mentals of Latin grammar before<br />\nSHIRTS<br />\nus throughout the course. This. is in Room 206, M. E. Building.<br />\nM. C.<br />\na factor not recognized by all in- The _topics which the Y.<br />\nfollows:<br />\nas<br />\nare<br />\nsuggests<br />\nA.<br />\nAt the Washington Monument<br />\nstructors of the Roman language<br />\n421 N. HOWARD ST.<br />\nredoes<br />\n21-27—Where<br />\nOctober<br />\nif it were, the colleges would be<br />\nOscar Thomas Olson, D.D.<br />\nGLOVES<br />\nHOSIERY<br />\nturning out better Latin scholars. ligion come in?<br />\nMinister<br />\nOctober 28-November 3—RelaIt is a great task to take over a<br />\nstudy.<br />\nscientific<br />\nto<br />\nreligion<br />\nof<br />\ntion<br />\nclassical department and possibly<br />\nHopkins Students Are Invited to<br />\nNovember 4-10—What deterfind its constituent courses having<br />\nMake This Their Church Home<br />\nvalue of a man?<br />\nbeen taught in a different manner mines the<br />\nPrinters of Philological and<br />\nfair<br />\na<br />\nis<br />\n11-17—What<br />\nNovember<br />\nScientific Works<br />\nfrom one's own pet mode of teachThe purpose and program of this<br />\n23 S. HANOVER ST.<br />\ning. That is something Professor chance for all?<br />\nwill appeal to you. Look in<br />\nChurch<br />\ncan<br />\nfar<br />\n18-24—How<br />\nBaltimore, Md.<br />\nNovember<br />\nMagoffin realizes and something<br />\n-afternoon -At Home\"<br />\non<br />\nthe<br />\nSunday<br />\ngood<br />\nof<br />\nprinciples<br />\nthe<br />\nhe will have to surmount this year. we carry<br />\nseven.<br />\nto<br />\nfrom<br />\nfive<br />\nwill?<br />\nThe Flag, Banner & Pennant Shop However, the task won't be so coNovember 25-December 1—Can<br />\nlossal when we realize that the<br />\nSunday morning worship at 1 I o'clock.<br />\n(Successors to Sisco Brothers)<br />\na man be a Christian and get ahead<br />\nFlags, Banners, Pennants, Arm Bands, majority of his followers are freshSunday evening service at 8 o'clock.<br />\nEmblems, Silk Banners for Schools, men. But still, Dr. Sihler main- in life?<br />\nSocieties and Fraternities<br />\nMusic by vested chorus—choir of soloists.<br />\n302 PARK AVE., BALTIMORE, MD. tained that freshmen have to be<br />\nR. H. Taylor untaught most of their high school<br />\nVernon 2355<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br />\nina'ams silly- pseudo-teaching. We<br />\nof<br />\nalso<br />\nis<br />\nDr.<br />\nMagoffin<br />\nwonder if<br />\nthe same mind!<br />\nThe Department of Classics is<br />\nan important part of the college<br />\nDRIVE IT YOURSELF!<br />\nsystem and must not be regarded<br />\nas the girders of an adjoining wing<br />\nALL NEW,CLEAN CARS<br />\nMEN'S SHOES<br />\nbut as the cemented,pillars of the<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nOf the Better Class<br />\ngreat superstructure of education.<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\nTherefore, this change that has<br />\nURNER BROTHERS<br />\nnow taken place must be considPrinters or<br />\n1 1 I E. BALTIMORE STREET<br />\nered of great moment and campus<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nBaltimore<br />\nThe Johns Hopkins<br />\ninterest.—New York University<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\nNEWS-LETTER<br />\nDaily.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\ncoifs<br />\nfoutfrARIIT!P`)<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nRemington Portable<br />\n<br />\nL-1<br />\n<br />\nii\\wucom ci<br />\n<br />\nyour<br />\n<br />\nREMINGTON TYPEWRITER Co.<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nLeFranc & Ault<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nURNER'S<br />\n<br />\nRENT A CAR<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 6<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br /><br />\nNEW CAMPUS STYLE SET BY DR. GILDERSLEEVE -92 TO- MUSICIANS ENTERTAIN ASDAY. HAS ACTIVE INTERCLASS OF C. E. SENIORS<br />\nSEMBLY WITH GUITAR<br />\nEST IN WORLD AFFAIRS<br />\nFormal Wing Collars With Ties of VaSELECTIONS<br />\nried Hue Worn to Wednesdai<br />\nRecitations<br /><br />\nOne of Two Surviving \"Immortals\" Has \"Amateur Night\" for Cheer Leaders.<br />\nHad Distinguished Career. Writes<br />\nAnnouncements Again Numerous.<br />\nBeautiful Greek Poetry<br />\nTribute Paid to Mr. Ball<br />\nA new standard of dignity and<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS BLANKS ALBRIGHT<br />\nIN ONE-SIDED CONTEST<br /><br />\nDr. Basil Tanneau Gildersleeve, The principal attraction at the Black and Blue Team Has Little Difficulty in Piling<br />\nstyle was set for lower classmen at<br />\nUp 41 Points against Visitors<br />\nHopkins by the class of civil engi- our revered and beloved ex-Profes- Assembly last Thursday was the<br />\nneering seniors when its nine mem- sor of Greek, celebrates his ninety- performance of Fargo and HamThe Johns Hopkins football team proved itself far superior to its<br />\nbers appeared at all morning reci- second birthday today. Dr. Gil- bleton on the Hawaiian guitar. rivals<br />\nin the game with Albright College last Saturday afternoon at<br />\ntations last Wednesday, October 17, dersleeve was born in Charles- The pair played numerous selec- Homewood<br />\nField. Playing before a crowd of nearly five thousand<br />\nattired in formal wing collars. Bow ton, South Carolina, October 23, tions, some old, some new, but all people<br />\nthe Black and Blue gridders completely swamped their opponents.<br />\nties of colors running the complete 1831. After preparatory education of them, judging from the enthu- At<br />\ntimes the Myerstown lads looked like they were going to register a<br />\ngamut of the solar spectrum added he entered Princeton University, siastic applause Of the audience, few points on their side<br />\nof the score, but the local squad held them when<br />\na picturesque and informal note to where he received the degrees of extremely popular. The musical they most eeded<br />\nto gain.<br />\nthe unusual picture. ,<br />\nA. B. and A. M. In 1853, after entertainment was rather a surPerfect football weather made<br />\nThis addition of van -colored and a year's study in Germany, he re- prise, and was, therefore, all, the<br />\nFRESHMAN NUMBER OF THE the game attractive to both spectapatterned ties to the formal wing ceived the degree of Doctor ot more appreciated.<br />\nBLACK AND BLUE JAY<br />\ntors and players; it was not too cold<br />\ncollars, instead of the customary Philosophy. From Germany he<br />\nRandolph Norwood, president<br />\nGOES TO PRESS<br />\nto sit in the stands nor was it so<br />\nfiat white or black tie, is claimed returned to his native land, and of the Student Council, called for<br />\nInitial 1923 Number to Appear Early<br />\nby the members of the class to be was made Professor of Greek at volunteers from<br />\nwarm that the players were fatigued<br />\nthe Freshman<br />\nin November. Appointments to<br />\nan absolutely unique innovation to the University of Virgina in 1856. class to form a small<br />\nStaff<br />\nAnnounced<br />\nby<br />\nthe heat. An unforturiate cirsized parade<br />\nthe men's styles this season. It is He continued at this institution for to advertise last<br />\nSaturday's game. The Black and Blue Jay went to cumstance resulted in an injury to<br />\nsaid that the next appearance of 20 years, teaching both Latin and According to plans, the Freshmen press last Friday and the FreshCaptain \"Buck\" Bonner, causing<br />\nthe \"piccadillies\" on the<br />\n. campus Greek, and publishing some of his were to meet at the athletic of- man number is scheduled to appear<br />\nhis<br />\nwithdrawal from the game at<br />\nWill be marked by specially made writings, notably his famous Latin fice at ten o'clock in the<br />\nmorning, on the campus during the early<br />\nGrammar.<br />\nPolka dot ties.<br />\nand, accompanied by the band, part of November. From all indi- the beginning of the second quar•<br />\nIn<br />\n1876<br />\nprominent<br />\nJohns<br />\nmemAccording to a<br />\nHopkins was were to parade through the down cations this issue will surpass all ter. Bonner was unable to return<br />\nber of the class interviewed yester- opened, and Dr. Gildersleeve was town streets, carrying banners ad- previous editions in color, quantity to the game, but it is not likely that<br />\nday, \"The outside world must form called to the chair of Greek, which vertising the game. After that, and quality.<br />\nhe will be on the side lines next<br />\na new impression of the dignity of he occupied until 1915. Dr. Gil- they were invited to attend the<br />\nA letter has been received from Saturday. There was no other inmen who have the high status of a dersleeve was one of President game between the Frosh football the Literary Digest requesting percident to mar the day.<br />\ncollege senior. Ordinary informal Gilman's \"six immortals,\" and is team and the City College second mission to reprint several of the<br />\nTurnbull's kicking was again a<br />\ncollars tend to prevent such an im- the last surviving member, except- team at 12:30. And after that jokes in its screen feature, \"Fun<br />\npression from forming and our idea ing Dr. Remsen, of the original they were to form on the upper from the Press.\" This is further feature of the game. 'The Hopkins<br />\nis to create an air of staidness and faculty: Gildersleeve, Sylvester, quadrangle at 1 :00<br />\nP. M.to march recognition of the Jay's superior hooter punted steadily throughout<br />\ndignity. by wearing formal neck:- Remsen, Martin, Brooks and Row- over to the field for the game with caliber.<br />\n•<br />\nthe contest, outdistancing the rival<br />\nland. During his stay at Hopkins Albright.<br />\nwear.\"<br />\nTwo new men, Roger Shaw, '25, kicker continuously. When the<br />\nAnother man interviewed claimed he received a great many honors. Norwood<br />\ncalled the attention of and Robert Heyn,'26, were appoint- Black and Blue blacks were able<br />\nthat the nucleus of the idea was It is recorded that a young Ph. ID. the<br />\nupperclassmen to the fact that ed, respectively, to the editorial to gain through the line Turnbull's<br />\nfound in a graduate student of the following Drs. Gilman and Gilderthey are expected to sit in the and art 'staffs. The positions were toe put the ball at a safe distance<br />\nSanitary Engineering class, at the sleeve reverently down the street<br />\nrooters' section and cheer for the left vacant by the resignation of up• the field. The Hopkins halfJohns Hopkins School of Hygiene, was astonished to hear them comteam at all games. The rooters' B. T. Rome and J. Scheineman back retained his leadership of the<br />\nwho habitually wore the formal plain of being bothered with invisection is for Hopkins students The new men were selected from a State try for point kickers, alpiccadillies.\" It appears that his tations to accept honorary degrees.<br />\nonly; but they are expected to long list of prospects for their abil- though he missed the bar after the<br />\nquiet air of dignity so charmed the During this time Dr. Gildersleeve<br />\nity and talent.<br />\nmake good use of it.<br />\nfifth touchdown, succeeding in the<br />\nmembers that they unanimously re- published many important works<br />\nA meeting of the editorial and other five attempts.<br />\nFor<br />\nthe<br />\nfirst<br />\nThis makes his<br />\ntime<br />\nthis<br />\nyear<br />\nthe<br />\nsolved to wear similar neckwear at on Latin and Greek.<br />\nart staffs will be held today at 12:20 record nine<br />\nAssembly<br />\nwas<br />\nsuccesses<br />\nout of ten<br />\nopened<br />\nwith<br />\nthe<br />\nthe next meeting of the class.<br />\nThen in 1915, after 39 years at<br />\nand on every Tuesday thereafter. tries.<br />\nsinging<br />\nof<br />\n\"Veritas<br />\nVos<br />\nLiberabThe psychological effect of the the University and 59 of teaching<br />\nThe purpose of these combined<br />\nThe most consistent ground-gainnew idea was found to _he tremend- and writing, Dr. Gildersleeve re- it\". The effect was extremely meetings is to secure better co-oppoor;<br />\nand<br />\nNorwood<br />\ner<br />\nemphasized<br />\nin the first quarter was Bonner,<br />\nous. Professors who met the class tired to spend the rest of his days<br />\neration and co-ordination between<br />\nthe<br />\nfact<br />\nthat<br />\nall<br />\nundergraduates<br />\nwhose<br />\nfast end runs took the vislast Wednesday found no levity, no in leisure. But this leisure is anthe two departments, editorial and<br />\nitors by surprise. The local halflack of concentration, but only a other man's work. He spends are expected to know, and should art. Under the old regime<br />\neach<br />\nstrict absorption to the subject at most of his time in his study at take pride in knowing, the Uni- staff working separately a proper backs were able to plow through<br />\nhand. Although rather more than his home on Calvert street. He versity Ode. Norwood asked that unity of purpose was lacking. This the opposite line for six and eight<br />\nmildly surprised at first by the un- takes occasional walks, but most notices for the Assembly be put in situation shall be remedied this year. yards at a time, the first touchdown<br />\ncoming after a steady march up the<br />\nusual spectacle they declared that of his time is occupied with intel- Box No. 444 before half past ten<br />\nA call for candidates was issued<br />\nThursday morning.<br />\nfield, which Albright was powerless<br />\nthey were strongly in favor of such lectual pursuits.<br />\nseveral weeks ago by the Jay and<br />\nDean<br />\nLatane<br />\nto stop. The second tally, which<br />\nreminded<br />\nthe<br />\nstuattire if it had such a remarkable<br />\nGreek poetry has always been a<br />\napplicants are still pouring in to<br />\ndents<br />\nthat<br />\ntheir<br />\ncame<br />\nsoon after the first, was won<br />\nschedules<br />\nof<br />\neffect on the seniors.<br />\nfavorite form of literature with Dr.<br />\nthe office. The hearty support is<br />\nhours<br />\nmust<br />\nbe<br />\nby<br />\nfiled<br />\nwith<br />\nforward<br />\nthe<br />\nRegpasses. A long pass by<br />\nPeople outside the campus were Gildersleeve. He now both reads<br />\ndue in part to the freshman regulaistrar<br />\nat<br />\nonce.<br />\nIf<br />\nout-,of-town<br />\nTaylor<br />\nto<br />\nBerndt placed the ball<br />\nvis- tion requiring participation<br />\neven more surprised than the pro- and writes it. Dr. Baker, of the<br />\nin some<br />\nfessors and undergraduates. Per- Greek Department of the Univer- itors come to the University in activity, but chiefly it is the result well within the enemy's territory,<br />\n'sons—whole groups of them—who sity, frequently reads Greek Po- search of a student, it is impossi- of voluntary desire to win a cov- and another long throw from Maxhad before hardly noticed the par- etry to Dr. Gildersleeve. He takes ble to find him unless his schedule eted position of the Black and Blue well to Bonner enabled the local<br />\nty of students on their journey to a keen interest in it; enjoys the is in the hands of the Registrar. Jay staff. Among the newcomers player to cross the goal-line for six<br />\nthe School of Hygiene stopped to beauty of it more than ever, and The Dean announced also that no a large amount of talent has been more points. Bonner's injury came<br />\nstare at them for minutes at a time, knows it better than most men, disorder or misconduct of any disclosed. Appointments shall not soon after this.<br />\nevidently impressed by their new even learned men, know the litera- kind would be tolerated at assem- be made until December so that<br />\nYoeman, who replaced Bonner,<br />\nblies.<br />\ndisplayed<br />\nfound dignity.<br />\na fine brand of football.<br />\nture of their native tongue. Then,<br />\nevery man shall be given ample opRobert Griffith,'25, called upon<br />\nThe<br />\nAt the present time it is unknown when he has no one at hand to<br />\ntall<br />\nfreshman<br />\nproved himself<br />\nportunity to try out.<br />\non<br />\nthe<br />\nfirst<br />\nplay<br />\nWhether another, wearing of the read aloud, Dr. Gildersleeve will the assembly to contribute to a<br />\nafter<br />\nhe went on<br />\nThe financial aspect for this year<br />\npiccadillies\" will be made in the write Greek Poetry himself. He fund to purchase a suitable token is very bright. Due to the splendid the field by making interference for<br />\nnear future. The first wearing was says that it is not for publication, of the undergraduates' recognition management of last year a substan- Taylor who carried the pigskin over<br />\nSO absolutely a success, however, but little has found its way into of the services of Mr. Thomas R.<br />\na<br />\ntial surplus was left. It will be the line for the third addition to<br />\nthat it is a practical certainty that print from time to time. At 92 3a11, who recently resigned his po- utilized in the publication of an<br />\nad- the score. The second period endundergraduates will not have long years of age Dr. Gildersleeve takes sition after serving the University ded issue, six issues in place of ed with the score 21-0, favor Hopto wait for the unusual spectacle of a keen interest in life, and in as Registrar for forty-six years. seven, and besides each magazine kins.<br />\nAlbright profited by the rest beseniors in formal neckwear and world news. He has decided opin- Griffith said little on the subject, shall be larger.<br />\nfor,<br />\nas<br />\nhe<br />\nremarked,<br />\nMr.<br />\nPolka dot ties.<br />\nBall<br />\nis<br />\ntween<br />\nhalves and showed a much<br />\nions on all matters of importance.<br />\ntoo<br />\nwell<br />\nknown<br />\nand<br />\ntoo<br />\nwell<br />\nloved<br />\ngame,<br />\nbetter<br />\nespecially in the third<br />\nBut in the end he turns to his bequarter, when they threatened to<br />\nloved Greek for true joy and by the undergraduates of Johns<br />\nHopkins for it to be necessary to<br />\nNOTICE<br />\nprevent a blanket score. Forward<br />\npleasure.<br />\nsay<br />\nmuch<br />\nabout<br />\nhim.<br />\npasses were the Pennsylvanians'<br />\nVS.<br />\nDr. John C. French, Direc\"Tom\" Jenifer, head cheer leadstrongest method of attack. Half<br />\ntor of the Bureau of Appointer, reported that the Graduate<br />\nmen's, has announced that<br />\na dozen times they tried and comNOTICE<br />\nthere are several positions<br />\nManager of Athletics, Norman C.<br />\npleted passes which took them much<br />\nAT HOMEWOOD FIELD<br />\nOpen to undergraduate stuMeeting of candidates for<br />\nKeyes, is keeping tab on the atnearer to the goal than they could<br />\ndents. For further informaSATURDAY, OCTOBER 27<br />\nFditorial Staff of 1924 Hultendance<br />\nat<br />\nthe<br />\ngames<br />\nby<br />\nmeans<br />\nhave got through the line. One of<br />\ntien, call at Room 215, Gillabaloo today at Barn, 12.20<br />\nof the signed athletic tickets. The<br />\n11.00<br />\nA.<br />\nAT<br />\nM.<br />\nman Hall.<br />\nthrows was intercepted by a<br />\ntheir<br />\nP.M.<br />\nContinued on Page 3, col. 3<br />\nContinued on page 3 col. 4<br />\nALL OUT<br /><br />\nHOPKINS<br /><br />\nHAVERFORD<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\nFROSH AGAIN VICTORIOUS<br />\nIN INTERCLASS BASEBALL<br />\nSend Seniors Down to Defeat, 13-10<br /><br />\n1923 PLANS REUNION<br />\nThe 1923 Class Reunion Committee, headed by \"Tom\" Landy,<br />\nheld a meeting last night after the<br />\n0. D. K. meeting in 206, M. E.<br />\nBuilding. The committee is considering holding the reunion after<br />\nthe St. John's or Maryland State<br />\ngame, probably to be followed by a<br /><br />\nUNIVERSITY OF NORTH CAROLINA TO ESTABLISH A<br />\nBUREAU OF VOCATION- ,<br />\nAL INFORMATION<br />\nThe Hopkins English Department has received a request for information from the University of<br />\nNorth Carolina regarding the vocational assistance that is accorded<br />\nHopkins students. The request is<br />\nthe result of the decision of that<br />\nuniversity to found an efficient Bureau of Vocational Information.<br />\nThis bureau is expected to place<br />\nat the student's disposal a considerable quantity of vocational<br />\nformation, including books and various statistics. It is also designed<br />\nto 'aid the student in choosing a<br />\ncourse which will prepare him best<br />\nfor his lifework. This department<br />\nwill be an extension of the idea<br />\nthat the courses of the pre-medical<br />\nstudents at Hopkins shall be decided upon by the faculty.<br />\nThe Hopkins vocational service<br />\nis practically limited to the requirements of English Composition<br />\nwhich every freshman must take.<br /><br />\nThe Freshman team won its second game of the season when it<br />\n$2.00 conquered the Seniors on the<br />\nSubscription<br />\n0-rounds back of the M. E. BuildEntered as second-class matter December 3, 1909, at the Postoffice at ing, Tuesday, October 16.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nThe game started about 4.15.<br />\nWard,<br />\nlead-off man for the Fresh- dance.<br />\nJohns<br />\nof<br />\nstudents<br />\nby<br />\nthe<br />\nPublished semi-weekly from October to June<br />\nHopkins University.<br />\nies, knocked a clean single and<br />\nBusiness communications should be addressed to the BUSINESS MAN- went to third on Newman's error. FIELD CLUB TO MAKE TRIP TO<br />\nCALVERT COUNTY<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Lowman went out at first. Keen<br />\nihould be sent to the MANAGING EDITOR.<br />\nThe Field Club is planning a<br />\nsingled, bringing Ward in. Comtrip<br />\nto the shore of the ChesaHomewood 100 mand got on when Lamar turn,<br />\nCelephone<br />\nbled, but Langluttig, forced him, peake, which borders on Calvert<br />\nManager<br />\nBusiness<br />\nEditor-in-Chief<br />\nKeen coming home. Langluttig county to make a study of the miJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nscored when Newman muffed ocene beds, so abundant from this<br />\nWheeler's long fly. Baird was point to Yorktown, Virginia. If<br />\nManaging Editor<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\nthrown out at first.<br />\nthe men planning the excursion<br />\nFITZGERALD DUNNING, '24.<br />\nThe Seniors did nothing in their can succeed in arranging reasonAssistant Managing Editor<br />\nhalf of the inning, but Tebo nearly able rates, the party headed by<br />\nT. REESE MARSH, '24.<br />\nCirculation Manager<br />\nscored<br />\nwhen Jenifer ran on a Albert Dickman will probably go<br />\nAssociate Editors<br />\nJOHN C. LEWIS, JR., '24.<br />\ndropped third strike. Lowman next Saturday. The trip will withRICHARD C. TILGHMAN, '25.<br />\nthrew him out with a pretty peg out doubt be one of the most inJOHN W. PARSONS, '25.<br />\nAssistant Business Managers<br />\nBENJAMIN T. ROME, '25.<br />\nafter putting Jenifer out.<br />\nteresting and instructive made<br />\nJunior Editors<br />\nD. MILES MARRIAN, '25.<br />\nThe -second inning started oft this year, and it is to be hoped the<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nG. DONALD GIESKE, '25.<br />\nwell for the Frosh. McAllister club will attend in a body.<br />\nARTHUR L. NELSON, '26.<br />\nJOHN T. DIXON,'24.<br />\nERNEST A. STRATHMAN, '26.<br />\nwalked. McNeil singled, then<br />\nA. J. MCKAY, '26.<br />\nLEO C. MUTH, '24.<br />\nWard went out at first. Lowman<br />\nC. EUGENE TOVELI„ '24.<br />\nALGER G. HISS, '26<br />\nOTHO J. KELLER, III, '25<br />\nEDWARD 0. MICHEL, '26.<br />\nsingled and went to second while<br />\neggirovriffir<br />\nJ. JACKSON KIDD, '26<br />\nCHARLES G. HUTZLER, '24.<br />\nMcAllister and McNeil scored.<br />\n-:• kmiliN011.111110<br />\n:<br />\n11 1<br />\n;Speawarrm:<br />\n:4•Nimminow<br />\n'....11.111161°°<br />\n1<br />\n:4<br />\n.<br />\n?<br />\n.<br />\n- 0--eamminimes<br />\n40.111<br />\n6<br />\nt'atiffaileffogliff<br />\nspi<br />\nKeen was hit by a pitched ball.<br />\ndmwardwritw<br />\n1.11111.11110riair<br />\nLowman scored when Adams<br />\n.<br />\n11111111.10014.e<br />\nMember Southern Intercollegiate Newspaper Association<br />\ntwordirape ite<br />\ncaught a foul fly back of first,<br />\nSIM Omof4(kr6./<br />\n11110III67 5,0111111L..<br />\n17aNtr,<br />\nLangluttig went out, retiring the<br />\ngiiO,0<br />\n34<br />\nas<br />\nuw<br />\nig,\"1<br />\n1<br />\n0<br />\n,4<br />\n40,t1<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nside.<br />\n'4W<br />\n0011170%.<br />\nO'Connor led off for the Seniors<br />\nwith a double. Bushey went out<br />\nBALTIMORE, MD., OCTOBER 23, 1923<br />\nat first. Oates doubled, bringing<br />\nin O'Connor. Oates went to third<br />\nNLY those who have<br />\non a passed ball and scored on a<br />\nwild pitch. The other men up<br />\nCOLLEGIATE BOARD REGULATIONS<br />\nsmoked Melachrinos<br />\nwent out.<br />\ncan judge the quality<br />\nWe wonder if the undergraduate students have forgotten that sevThe Frosh did nothing in the<br />\nof the finest Turkish<br />\neral important regulations were passed by the Board of Collegiate Studies third, but Tebo made a wonderful<br />\ncatch of McNeil's long fly and<br />\ntobacco.<br />\nlast spring. In order to prevent, if possible, embarrassing situations next robbed him of at least a double.<br />\nJune we are publishing in this column the text of these rulings, the most<br />\nAdams drew a pass. Lamar sinORIGINAL<br />\nO'Connor forced him. Jcnigled.<br />\nimportant of which says that no student may graduate with an unabfer struck out. Bushey singled,<br />\nsolved failure (due to the changing of a course) against him.<br />\nscoring Adams and O'Connor ana<br />\nwas caught off second by McNeil.<br />\nOther regulations follow:<br />\nThe fourth inning saw things<br />\n\"The One Cigarette Sold the World Over\"<br />\n\"If for any reason a student does not repeat or otherwise absolve liven up when the Freshman came<br />\na course in which he has failed, he may, with the consent of his adviser, up. Ward singled, Lowman singled and Keen singled. Command<br />\nsubstitute another course of equal value, but in every such case he will<br />\ntripled, Laugluttig singled and<br />\nbe required as a penalty for leaving a course uncompleted, to take an Wheeler doubled. O'Connor then<br />\nadditional course which will not be credited toward the 125 points re- went in the box for '24 and threw<br />\none man out at third and struck<br />\nquired for graduation.<br />\nout two more.<br />\nThe Seniors went out, 1, 2, 3.<br />\n\"No student may count for graduation more than two courses in which<br />\nIn the fifth all three outs were<br />\nhis grade for the year is below 7.<br />\nstrike-outs, but they came too far<br />\n\"A student transferring • from one undergraduate school to an- apart. Ward and Lowman struck<br />\nout. Keen singled and scored on<br />\nother, and having a failure in the former, must, in addition to the regerrors. Command drew a pass and<br />\nular requirements for a degree in the school which he is entering, make stole second and third. Langluttig<br />\ngot a base on balls. Command<br />\nup the failure or offer an additional equivalent course.\"<br />\nscored and Wheeler struck out.<br />\nAt bat for the last time the<br />\nSeniors made a futile attempt to<br />\ntie the score. Adams was walked.<br />\nWE TOLD YOU SO<br />\nLamar flied out. Jenifer singled.<br />\nAdams scored on a passed ball.<br />\n\"nothing<br />\nphilosopher<br />\nhe<br />\nknew<br />\nthat<br />\nonce said<br />\nA famous French<br />\nJenifer<br />\nscored on O'Connor's sinmore inept then the expression \"I told you so.\" Agreeing with him fully,<br />\ngle. Bushey singled. Oates flied<br />\nwe endeavored to keep from using this phrase. We could, however, out. Wasson singled and O'Confind no other that conveyed so well the meaning expressed by these four nor scored. Bushey came home on<br />\nAshton's hit. Tebo drew a pass.<br />\nwords.<br />\nWasson and Ashton scored on<br />\nTwo weeks ago an editorial appeared in the NEWS-LETTER which passed balls. Adams struck out.<br />\nLineup:<br />\nasked that someone discover or write a Hopkins \"Alma Mater.\" This<br />\nSeniors-Tebo, c and If; Adams,<br />\neditorial argued that, although the \"University Ode\" was valuable because lb; Lamar, 2b; Jenifer, ss ; O'Conof tradition, its words and difficult score rendered it unsuitable for in- nor, 3b; Bushey, cf ; Newman, rf ;<br />\nformal or semi-formal occasions. This argument was well proven at Oates, c; Wasson, If; Ashton, p.<br />\nFroshWard,2b; Lowman, 1b<br />\nthe last Weekly Assembly, when the undergraduate body was called Keen, ss ; Command, cf ; Langlutupon to sing the \"Ode\" and freshmen and upperclassmen demonstrated tif, If; Wheeler, 3b; Baird, rf ; McTHE smartness of a Stetson is only<br />\nMcNeil,<br />\np.<br />\nc;<br />\nCallister,<br />\nwords<br />\nand<br />\nmusic.<br />\nthat they were unfamiliar with both<br />\nthe first step-real appreciation of<br />\nUmpires-Marrian and Thomas.<br />\nStetson quality comes after long wear.<br />\nWe shan't say again, \"We told you so!\" We will only remark that<br />\nScore by innings:<br />\nwe are glad that no strangers were present and ask once more that some Seniors<br />\nSTYLJ:D FOR YOUNG MEN<br />\n0 2 2 0 6-10<br />\nsuitable<br />\nAlma<br />\nMater.<br />\ncomposing<br />\na<br />\nunearthing<br />\nor<br />\ntoward<br />\nmade<br />\nFrosh<br />\n3<br />\n3<br />\n0<br />\n5<br />\n2-13<br />\n.effort be<br />\nFOUNDED 1897.<br /><br />\nO<br /><br />\nMELACHRINO<br />\n.-.-<br /><br />\nSTETSON,c-P<br />\nHats<br /><br />\nTHE JOHNS HOPKINS NEWS- LETTER, OCTOBER 23; 1923<br />\n,R-<br /><br />\n.rtinof<br />\nled<br />\nis<br />\niat<br />\nhiIce<br />\nidin-<br /><br />\nvaled<br />\n;a<br />\nest<br />\n2nt<br /><br />\nlea<br />\ncal<br />\ndeice<br /><br />\nreke.<br /><br />\nDORMITORY BOARDERS ORGANIZE CANDIDATES FOR<br />\nEDITORI- MUSICIANS ENTERTAIN ASSEMBLY HOPKINS BLANKS ALBRIGHT<br />\nGOVERNING COMMITTEE<br />\nWITH GUITAR SELECTIONS<br />\nAL<br />\nSTAFF<br />\nIN ONE-SIDED CONTEST<br />\nOF<br />\nHULLABA<br />\nThe initial step toward organizaContinued from page 1<br />\nLOO<br />\nHOLD<br />\nContinued from page.]<br />\nMEETING<br />\ntion of the new Alumni Memorial<br /><br />\n3<br /><br />\nYoung for Magill, Cook for Turnbull;<br />\nAlbright, Jones for Grigolonis, Gasull<br />\nfor Hollenbaugh, Hollenbaugh for<br />\nLeimbach, Fisher for Crumbling,<br />\nHopkins player, thus spoiling Al- Grigolonis for Jones. Hopkins scoring—Touchdowns, Turnbull, Maxbright's only chance to tally.<br />\n'well (2), Bonner, Taylor, Yeoman.<br />\nPoint after touchdowns—Turnbull, 6<br />\nIn the last period of the game (place kicks). Referee—Watkeys,<br />\nHopkins scored three touchdowns, Syracuse. Umpire—Thomas, Lafayette. Head linesman—Price, Swarthliterally running away from the more.<br /><br />\nA meeting of the prospective ed- records show that thirty-five per<br />\nDormitory was taken at a general<br />\nmass-meeting of the resident mem- itorial board of the 1924 Hullaba- cent. of the Freshman class, and<br />\nbers when a chairman of the House loo Was called last Wednesday by about the same percentage of upCommittee and six committeemen Editor Dunning. Only seniors will per classmen were unaccounted<br />\nwere elected last Tuesday night. be on the Board, and it was clear- for at the St. Mary's game. JeniThe honor of being the chairman of ly understood that any man failing fer called for better attendance<br />\nat Myerstown eleven. Of these Maxthe first House Committee in a to work hard for the support of the games. He asked<br />\nthat as well carried the first over the goal DONALDSON ELECTED JUNIOR<br />\nHopkins Dormitory fell to Ralph the book would be dropped from many as possible try their hand line; Yoeman being responsible<br />\nCLASS PRESIDENT BY RE-VOTE<br />\nfor<br />\n\"Prince\" Wales, while the six men the staff.<br />\nat writing songs and yells for use the other two.<br />\nEarl Donaldson was elected to<br />\nelected to work with him are as<br />\nTo have all editorial work com- later in the season. The HaverLINE-UP<br />\nhead this year's Junior Class, on<br />\nfollows: Albert Shaw, Donald pleted by January, \"write ups\" ford game will be played at 11<br />\nHOPKINS<br />\nALBRIGHT<br />\nA. Berndt<br />\nL.E<br />\nGrigolonis last Friday. When the votes were<br />\nVanneman, Richard Cox, Hubert must be begun immediately upon M., on October 27, to avoid<br />\ncon- Magill<br />\nL.T.<br />\nEverett added<br />\nup it was found that he had<br />\n\"Tex\" Barton, Edward Mount, and the selection of the Board. Art out- flict with the Princeton-Nav Wolbert<br />\nLG<br />\nLang°<br />\ny Day<br />\nC.<br />\nCrumbling<br />\nDonald Wilson. The approval ac- of-town concern has been given the game; and it must<br />\ndefeated Donald Reese by a bare<br />\nbe well adver- Barton<br />\nR.G.<br />\nSnyder<br />\ncorded these men on their election contract for engravings, so that this tised to pay<br />\nCarter<br />\nR<br />\nT<br />\nSheeley majority.<br />\nfor the increase in<br />\nRich<br />\nRE<br />\nTrumbauer<br />\nwould seem to indicate that all con- date may not be postponed.<br />\nHaverford's guarantee. Aspirants Taylor<br />\nThe following officers will asQ.B<br />\nMiller<br />\nfidence in their ability to start the<br />\nR.H<br />\nHollenbaugh sist Mr. Donaldson in the carryOnly three appointments have for positions as assistant cheer Turnbull<br />\nBonner<br />\nL.H<br />\nKengle<br />\nsystem right and to keep it running been made to<br />\nthe editorial staff: leaders were given an opportunity Maxwell<br />\nF.B<br />\nLeimbach ing out of the class functions.<br />\nso has been placed in them.<br />\nLeopold, managing editor; Howard to lead the assembly in yell and<br />\nScore by periods:<br />\nThey are: Vice-president, Albert<br />\nThis first movement made toward and Passano, photographi editors. song<br />\n14 7 0 20-41<br />\npractice. Something ap- Hopkins<br />\nc<br />\nAlbright<br />\n.0<br />\n0 0 0— 0 B. Asendorf ; secretary, William<br />\na governing committee for the new Other<br />\nmembers will be. announced proaching an \"amateur night\" was<br />\nSubstitution<br />\ns — Hopkins, Yeoman P. Calhoun; treasurer, Kelso MorAlumni MemOrial Dormitory was at the next meeting,<br />\nto be held the result, to the great delight of for Bonner, Slowik for Carter, Gillis rill, and sergeant-at-arms, Ralph<br />\nmade at a general mass-meeting Tuesday,<br />\nfor Berndt, Miliaunsky for Wolbert,<br />\nthe assembly.<br />\nOctober 23.<br />\nVanborne for Taylor, Carr for Day, G. Wales.<br />\nheld early in the week. The meeting was called by the- Faculty Committee on .the Dorms, consisting of<br />\nDean Latane, Dr. Bliss and Dr.<br />\nMathews. Dr. Bliss made a short<br />\nopening speech in whicli he strongly<br />\nstressed the 'point that the new<br />\nbuilding is in effect really more<br />\nthan'a dorm, it is a man's club. The<br />\nvery fact the building is different<br />\nfrom those of other colleges substantiates his statement. He held,<br />\ntherefore, the opinion that every<br />\nman will conduct himself as a gentleman and that few rules will be<br />\nnecessary for government.<br />\nAt the end of the meeting a collection was taken up- for subscriptions to different magazines and<br />\npapers for the reading tables in the<br />\nCommons room. A fair-sized sum<br />\nwas realized and it is expected that<br />\nthe tables will soon be supplied with<br />\nreading matter, both interesting and<br />\namusing.<br />\nPreparations are under way for<br />\na songfest to be held this week. The<br />\nfact that a piano, a most necessary<br />\nadjunct to any musical affair, is<br />\nstill in the minus quantity has held<br />\nup the good time so far, but it is<br />\nexpected that one will be forthcoming in time for the first Dorm getThe Pack Train has become a relic of the<br />\ntogether. Edward Mount, who has<br />\nmethods, and has developed entirely new<br />\ncharge of the program for the<br />\npast, along with the Prairie Schooner.<br />\nones, as well.<br />\nnight, has asked that every man<br />\nModern methods of transportation have<br />\nEngineering, as it is applied to transportawho can sing, play a musical instruleveled mountains, brought San Francisco<br />\ntion, has had to concern itself with many<br />\nment, or put on a little fancy dance<br />\nnearer to New York, and widened the markinds of materials and many ways of handling<br />\nreport to him at the earliest possikets of all our great industries.<br />\nthem<br />\nunder all manner of circumstances.<br />\nble time so as to assure place on<br />\nengineering<br />\nAnd<br />\nthe<br />\nbrains<br />\nand<br />\nenergy,<br />\nFor<br />\ninstance<br />\nthe problems surrounding the<br />\nthe line-up.<br />\nthat have developed transportation to the<br />\nhandling of iron ore, in bulk, are vastly<br />\nprominence it holds in the business of the<br />\ndifferent from those encountered in moving<br />\nworld today, are no longer employed in<br />\nany one of the finished products manufacimproving means of overland travel alone.<br />\ntured from iron ore, that must also be<br />\nStreet Railways, Elevator Systems, Intertransported in large quantities. But Enginurban Lines and Improved Shipping Lines—<br />\neering constantly meets each situation with<br />\nthese are some of the accomplishments of<br />\nimproved transportation facilities.<br />\nengineering in the development of better<br />\nIndustry, as a whole, and the nations and<br />\ntransportation.<br />\nthe people of the world owe much to the<br />\nNeither have the builders of such systems<br />\nengineers, associated with such large manubeen concerned only in the actual hauling of<br />\nfacturing industries as Westinghouse. They<br />\npeople and materials. A study of the methods<br />\nhave not only brought about vast improveof handling passengers and freight at the<br />\nments, but they have done so at a constantly<br />\nlarge terminals has developed the Terminal<br />\ndecreasing cost to those who derive the<br />\nEngineer, who has greatly improved existing<br />\nOU bet he is! He's making a tregreatest benefit from them.<br />\nmendous hit! She has just<br /><br />\nEngineering Levels Mountains<br /><br />\nTHRILLED?<br /><br />\nY<br /><br />\ntold<br />\nhim that he has hair like Rudy<br />\nValentino's. But he doesn't know<br />\nWhether to pretend that it came that<br />\nway or confess that he did it with his<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\nHe owes a lot of his manly beauty to<br />\nthat bottle. \"Vaseline\" Hair Tonic'<br />\npromotes the growth of the hair and<br />\nKeeps the scalp in the healthiest condition. At all drug stores and student<br />\nbarber shops.<br /><br />\nCHESEBROUGH MFG. CO.<br />\n(Consolidated)<br />\nState Street<br />\nNew York<br /><br />\nVaseline<br />\nREQ.U.S.PAT.OPP,<br /><br />\nHAIR TONIC<br />\nEvrr.v.<br />\n'Vaseline\" Product is recommended everywhere because ofitsabsolutsburityandesctivniass.<br /><br />\nACHIEVEMENT<br /><br />\nOPPORTUNITY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 23, 1923<br /><br />\n4<br />\nU<br /><br />\n'SANFORDS<br /><br />\nLORD'S DAY ALLIANCE OFFERS PRIZES FOR THE<br />\nBEST ESSAYS<br /><br />\n1923 RUSHING DATES DRAWN AT<br />\nINTERFRATERNITY BOARD<br />\nMEETING<br /><br />\nFURNITURE OF QUALITY<br /><br />\nInterest ran high at the meeting<br />\nand individuality is offered here at prices that are not<br />\nMaryof<br />\nColleges<br />\nof<br />\nthe Interfraternity Board last<br />\nJuniors<br />\nof<br />\nto<br />\nOpen<br />\nFOUNTAIN PEN INK<br />\nand cannot be underquoted by any house at any time.<br />\nland<br />\nThursday when dates for rushing<br />\nC.Besides the reputation of an old-established firm<br />\nWill Improve the Action<br />\nDr. John C. French, chairman parties were drawn by lot. The<br />\nis back of each sale with a guarantee.<br />\nof Any<br />\nof the Bureau of Appointment, final assignments were as follows:<br />\nlpilitll[1.0(lig1111!<br />\nFountain<br />\nNovember 3—Delta Gamma<br />\nwishes to call attention to an anPen<br />\nTheta.<br />\nnouncement of a prize competiDECORATIONS<br />\nDRAPERIES<br />\nNovember 5—Beta Theta Pi.<br />\n•<br />\nFURNITURE<br />\ntion which was recently received<br />\nPhi.<br />\n-1111 1111 ill<br />\n343 NORTH CHARLES STREET<br />\nNovember 6—Delta<br />\nALL<br />\n•„,,,uffirlii1111111111<br />\nfrom the Lord's Day Alliance.<br />\nCOLORS<br />\nNovember 7—Alpha Kappa Phi.<br />\nNovember 8—Pi Kappa Chi.<br />\nThe subject of the competition is<br />\netif<br />\n,,ty<br />\n5sit:,,<br />\np,<br />\noCK<br />\nALL<br />\n9—Omicron Kappa<br />\nNovember<br />\nDay—Why<br />\nLord's<br />\nthe<br />\nis<br />\n\"What<br />\nSIZES<br />\nSuccessful<br />\nOmicron.<br />\nShould it be Kept?\"<br />\n•<br />\n10—Phi Kappa Psi.<br />\nNovember<br />\nMen and<br />\nThe prizes, which are limited to<br />\n\"The Ink That Made<br />\n, November 12—Alpha Delta Phi.<br />\nWomen<br />\nThe Fountain Pen Possible\" competitors in the Junior Classes November 13—Phi Gamma Del- Write Out<br />\nof the colleges of Maryland are ta.<br />\nTheirIdeas<br />\nNovember 14—Kappa Alpha.<br />\n$25 for the winning essay and $15<br />\n15—Silver<br />\nArrow<br />\nNovember<br />\nfor the second best contribution.<br />\nThe competitor who submits Club.<br />\nNovember 16—Kappa Sigma.<br />\nthe best paper in each college will<br />\nNovember 17—Sigma Tau Delbe eligible to compete in an Oratorical Contest on the same sub- ta.<br />\nOn these dates every fraternity<br />\nject, the winner of which will rehave an opportunity to make<br />\nwill<br />\nceive a prize of $25. The date of<br />\nwith rushees. Dates will<br />\none<br />\none,<br />\ndate<br />\ncontest will be announced later.<br />\nLimited<br />\nfraternity houses and<br />\nin<br />\nbe<br />\nThe only rules of the competo six hours duralimited<br />\nbe<br />\nwill<br />\nBARN CAFETERIA tition are: That the essays must tion, ,rushees leaving the house by<br />\nbe between 800 and 1,000 words,<br />\none o'clock A. M.<br />\nand must be submitted by Decem0<br />\nF2<br />\nDID<br />\nThis feature will open the rushgENEIgfTlYlt<br />\nDITEEIXEIHNIEEIEIMILaillait<br />\nber 5, 1923. Address all contriing<br />\nseason, after which a pause<br />\nbutions to the Lord's Day Alliuntil December 10 will ensue. Then<br />\nance, P. 0. Box 724.\"<br />\nthe rushing season will come to a<br />\nclimax with a period of silence, and<br />\nCoznbine the habitof research,which you are forming now,<br />\nPROFESSOR MAGOFFIN<br />\nthe bidding of men to various fraa little imagination, and you've started something.<br />\nWith<br />\nNow that Cicero, Horace, Plato, ternities.<br />\nFrom the time you are in college and as long as you<br />\nand Tom Thorp have returned<br />\nyour success in life and business will depend upon<br />\nlive,<br />\n\"The King of Lubricants\" from their vacations, let us look to Y. M. C. A. HOLDS FRATERability to work out ideas. Outline your ideas, write<br />\nNITY COUNCIL DINNER<br />\nour reborn classical department,<br />\nyour papers and lecture notes, your themes and your<br />\nA Friendship Council dinner was<br />\nSHERWOOD BROTHERS, INC.<br />\nwhile Doctors Sihler and Waters<br />\nletters, on a Remington Portable. A few days' practice<br />\nby the Hopkins Y. M. C. A.<br />\nheld<br />\nand it's faster than long hand.<br />\nare enjoying their well deserved<br />\nEsEEKCIEEEEERECIEMENHHEE<br />\nrest. In their sfead we have Dr. at the Friends Meeting House last<br />\nThe Remington Portable has the four-row keyboard—<br />\nInlike the big machines. It fits in a case only four inches<br />\nMagoffin, erstwhile Professor of Friday evening from 6 to 7:30.<br />\nof<br />\nhigh. You can use it on your lap, if you wish, for it carthe Classics at Johns Hopkins vitations were sent to a number<br />\nBoys, the place to get your<br />\nstuday<br />\nto<br />\nries<br />\nits table on its back.<br />\ndormitories,<br />\nthe<br />\nin<br />\nmen<br />\nUniversity. Dr. Magoffin assumes<br />\nmeals—and they are honin<br />\nmen<br />\nthree<br />\nabout<br />\nto<br />\nand<br />\ndents<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\nthe chair after having acquired a<br />\nest-to-goodness meals, well<br />\nhigh reputation for scholarship each fraternity on the campus.<br />\nwas to<br />\nserved, and reasonably<br />\nand teaching ability at the Mary- The object of the dinner<br />\nformathe<br />\n-for<br />\ncampaign<br />\na<br />\nlaunch<br />\npriced—is at<br />\nland institution:<br />\n25 W. FAYETTE STREET<br />\nmeet<br />\nto<br />\ngroups<br />\ndiscussion<br />\nof<br />\ntion<br />\nnow<br />\nto<br />\ndo<br />\nright<br />\nHe has much<br />\nBALTIMORE<br />\nM. C.<br />\nand as it may be some time before under the auspices of the Y.<br />\nweek,<br />\nhe gets his \"system\" working, we A. They are to meet once a<br />\nman to<br />\nmust take him to ourselves and under the supervision of a<br />\ndiscuss<br />\nto<br />\ngroup,<br />\n.each<br />\nby<br />\nchosen<br />\nbe<br />\nhelp him so that he may help us.<br />\ninterest<br />\nreligious<br />\nof<br />\nPRESCRIPTION DRUGGISTS<br />\nquestions<br />\nIt is to be hoped that he continues<br />\n1817 N. Charles St.<br />\nY.<br />\nthe<br />\nby<br />\nchosen<br />\nbeen<br />\nhave<br />\nwhich<br />\nTWO STORES:<br />\nthe daily Latin prose exercises to<br />\n(Half Block below North Ave.)<br />\nEutaw Place and North Ave.<br />\nCharles and Chase Sts.<br />\nwhich Dr. Sihler rigidly adhered M. C. A.<br />\nform<br />\nto<br />\nhopes<br />\nA.<br />\nC.<br />\nM.<br />\nY.<br />\nThe<br />\nMadison 0405<br />\nVernon 0890<br />\nand from which his students cerin<br />\ngroup<br />\na<br />\nand<br />\ngroup<br />\ndormitory<br />\nNicholas Brown, Mgr.<br />\ntainly gained much. Just as they a<br />\nwho are<br />\nwere a great aid in translation, so each fraternity. All men<br />\nare<br />\ngroups<br />\nthese<br />\nin<br />\ncltd they serve to keep the funda- not included<br />\nM.<br />\nP.<br />\n4<br />\nat<br />\ninvited to meet Tuesdays<br />\nNECKWEAR mentals of Latin grammar before<br />\nSHIRTS<br />\nus throughout the course. This. is in Room 206, M. E. Building.<br />\nM. C.<br />\na factor not recognized by all in- The _topics which the Y.<br />\nfollows:<br />\nas<br />\nare<br />\nsuggests<br />\nA.<br />\nAt the Washington Monument<br />\nstructors of the Roman language<br />\n421 N. HOWARD ST.<br />\nredoes<br />\n21-27—Where<br />\nOctober<br />\nif it were, the colleges would be<br />\nOscar Thomas Olson, D.D.<br />\nGLOVES<br />\nHOSIERY<br />\nturning out better Latin scholars. ligion come in?<br />\nMinister<br />\nOctober 28-November 3—RelaIt is a great task to take over a<br />\nstudy.<br />\nscientific<br />\nto<br />\nreligion<br />\nof<br />\ntion<br />\nclassical department and possibly<br />\nHopkins Students Are Invited to<br />\nNovember 4-10—What deterfind its constituent courses having<br />\nMake This Their Church Home<br />\nvalue of a man?<br />\nbeen taught in a different manner mines the<br />\nPrinters of Philological and<br />\nfair<br />\na<br />\nis<br />\n11-17—What<br />\nNovember<br />\nScientific Works<br />\nfrom one's own pet mode of teachThe purpose and program of this<br />\n23 S. HANOVER ST.<br />\ning. That is something Professor chance for all?<br />\nwill appeal to you. Look in<br />\nChurch<br />\ncan<br />\nfar<br />\n18-24—How<br />\nBaltimore, Md.<br />\nNovember<br />\nMagoffin realizes and something<br />\n-afternoon -At Home\"<br />\non<br />\nthe<br />\nSunday<br />\ngood<br />\nof<br />\nprinciples<br />\nthe<br />\nhe will have to surmount this year. we carry<br />\nseven.<br />\nto<br />\nfrom<br />\nfive<br />\nwill?<br />\nThe Flag, Banner &amp; Pennant Shop However, the task won't be so coNovember 25-December 1—Can<br />\nlossal when we realize that the<br />\nSunday morning worship at 1 I o'clock.<br />\n(Successors to Sisco Brothers)<br />\na man be a Christian and get ahead<br />\nFlags, Banners, Pennants, Arm Bands, majority of his followers are freshSunday evening service at 8 o'clock.<br />\nEmblems, Silk Banners for Schools, men. But still, Dr. Sihler main- in life?<br />\nSocieties and Fraternities<br />\nMusic by vested chorus—choir of soloists.<br />\n302 PARK AVE., BALTIMORE, MD. tained that freshmen have to be<br />\nR. H. Taylor untaught most of their high school<br />\nVernon 2355<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br />\nina'ams silly- pseudo-teaching. We<br />\nof<br />\nalso<br />\nis<br />\nDr.<br />\nMagoffin<br />\nwonder if<br />\nthe same mind!<br />\nThe Department of Classics is<br />\nan important part of the college<br />\nDRIVE IT YOURSELF!<br />\nsystem and must not be regarded<br />\nas the girders of an adjoining wing<br />\nALL NEW,CLEAN CARS<br />\nMEN'S SHOES<br />\nbut as the cemented,pillars of the<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nOf the Better Class<br />\ngreat superstructure of education.<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\nTherefore, this change that has<br />\nURNER BROTHERS<br />\nnow taken place must be considPrinters or<br />\n1 1 I E. BALTIMORE STREET<br />\nered of great moment and campus<br />\nVERNON 4049<br />\n1725 N. CHARLES ST.<br />\nBaltimore<br />\nThe Johns Hopkins<br />\ninterest.—New York University<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\nNEWS-LETTER<br />\nDaily.<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\ncoifs<br />\nfoutfrARIIT!P`)<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nRemington Portable<br /><br />\nL-1<br /><br />\nii\\wucom ci<br /><br />\nyour<br /><br />\nREMINGTON TYPEWRITER Co.<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nHYNSON, WESTCOTT and DUNNING<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nLeFranc &amp; Ault<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nURNER'S<br /><br />\nRENT A CAR<br /><br />\nDRIVE IT YOURSELF CO.<br /><br />"}], "field_media_file": [{"target_id": 37777, "display": null, "description": null, "target_type": "file", "target_uuid": "8800802c-0af2-4380-9545-4a0bfdd69a37", "url": "http://digital.library.jhu.edu/system/files/2022-03/13078-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13078, "target_type": "node", "target_uuid": "90c202ac-5637-42cf-ad9e-ccb74da5145b", "url": "/node/13078"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "1e500b85-da45-43ee-a33e-ba4c9e3e7d79"}]}