{"mid": [{"value": 38043}], "uuid": [{"value": "6c6fea20-9fae-4ec0-a45c-987d5d90511b"}], "vid": [{"value": 38043}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:46:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12611-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:46:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:46:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\natiint,5 iqopkins Nrius-itirttrr<br />\n<br />\nVol. XXXIX—No.41.<br />\n<br />\nBE PRESENT AT STRIKE<br />\nAt Levering Or In Latrobe<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, APRIL 12, 1935.<br />\n<br />\nPrice, 5 Cants<br />\n<br />\nSeven Faculty Members To Speak At Student<br />\nStrike Against War And Oath Bill, 11 a.m.Today<br />\nInterfrat Ball<br />\nWill Be Held<br />\nTomorrow,10-2<br />\n<br />\nGives His Stand<br />\n<br />\nAmong Participants In Strike<br />\n<br />\nVisits State Capital<br />\n<br />\nClasses To Be<br />\nSuspended For<br />\nDemonstration<br />\n<br />\nBlue Moon Orchestra Secured To Play At Maryland Country Club Hall<br />\n<br />\nDrs. Lovejoy, Hollander,<br />\nHolt, Berry, Mitchell And<br />\nBlumberg To Give Talks<br />\n<br />\nTickets Two Dollars<br />\n<br />\nLevering Is Scene<br />\n<br />\nMiss Ruth Koch Chosen As<br />\nSponsor; Miss Kathleen M.<br />\nVinup As Guest Of Honor<br />\n<br />\nNumerous Student Speakers<br />\nAlso Plan To Register Protest At Group Meeting<br />\n<br />\nMembers of the Interfraternity<br />\n<br />\nBy STANLEY E.'BLUMBERG<br />\nAnti-War Correspondent<br />\nApparently repulsed in their rather<br />\nly feuds to combine in presenting the<br />\nconservative attempt to decry and<br />\nannual Interfraternity Ball, which<br />\n—Courtesv S<br />\nPr,s<br />\ndefeat the Teachers' Oath Bill at An-Courtesv<br />\nn<br />\n,<br />\nS<br />\n?<br />\n,<br />\ners<br />\nWill be supplied by the Blue Moon<br />\nDR. W. B. KOUWENHOVEN<br />\nDR. JACOB HOLLANDER<br />\nPRESIDENT J. S. AMES<br />\nnapolis on Wednesday, members of<br />\nBand from 10 until 2 tomorrow night.<br />\nthe administration and the faculty<br />\n—Courtesy Sunpapers<br />\nMiss Ruth Koch, daughter of Mrs.<br />\nwill renew their efforts at 11 a. m.<br />\nDR. A. 0. LOVEJOY<br />\ntoday in collaboration with the stuB. L. Koch of Ruxton, has been chosdent protest against war. Seven repen as the sponsor, while Miss Kathresentatives of the University's proleen M. Vinup, daughter of Colonel<br />\nfessional corps are to address the unand Mrs. Frederick H. Vinup, will be<br />\ndergraduate student body from the<br />\nthe guest of honor.<br />\nsteps of Levering Hall as part of the<br />\ndemonstration which received official<br />\nTickets which are now on sale are<br />\nsanction<br />\nfrom President Ames and<br />\ntwo dollars stag or couple. These may<br />\nDean Berry several days ago.<br />\nbe purchased from John Murphy, the Loss Of $67,000 Will Not<br />\nDr. Arthur 0. Lovejoy, leader of<br />\nMean Abolition Of School<br />\nChairman of the committee, or else<br />\nthe group which converged upon GovDr.<br />\nLovejoy<br />\nLeads<br />\nAttack<br />\nat the dance that night.<br />\nOf Engineering, He Says<br />\nernor Nice, is listed as one of the<br />\nOf Intelligentsia; McNulty speakers.<br />\nOrchestra From New York<br />\nBrief addresses are also to<br />\nIn commenting on the annual afIf the so-called Teachers' Oath Bill<br />\nHeads Legion Forces<br />\nbe made by Drs. Jacob Hollander, E.<br />\nW. Berry, W. B. Kouwenhoven, Wilfair, Murphy said, \"I firmly believe now before Governor Nice becomes a<br />\nBy NEAL POTTER<br />\nliam S. Holt, Broadus Mitchell, and<br />\nthat those who come to the Interfra- law, President Ames, according to a<br />\nNEWS-LETTER Rep. at Annapolis<br />\nAlbert Blumberg. Neither the specific<br />\nternity Ball will have a very delight- statement which he made when speakScholarship and \"patriotism\" came topic nor the approach of these men<br />\nful time at the beautiful Maryland ing before the Alumni Association in<br />\nto groups Wednesday afternoon in a is known, since they were requested to<br />\nCountry Club. This is your chance to New York last Friday, stated that he<br />\nbattle of words over the Teachers' speak on that phase of the situation<br />\nhave an evening together with the would recommend to the Board of<br />\nOath Bill, during a hearing before which held the greatest interest for<br />\nrest of our fraternity brothers. TaGovernor Harry W. Nice, who has them. It is expected, however, that<br />\nTrustees of the Johns Hopkins Unible reservations may be secured from<br />\nthus far withheld his signature from they will tie up the twin protest measversity to forego all financial aid from<br />\nine or from any other member of the<br />\nthe bill.<br />\nures of war and the Oath Bill.<br />\nState of Maryland, inasmuch as<br />\nthe<br />\nAn attempt to be logical on the<br />\nCommittee.\"<br />\nClasses Out At 11<br />\nit would not be possible in his opinpart of the intelligentsia, led by Dr.<br />\nAll undergraduate classes will be<br />\nThe Blue Moon orchestra, under the<br />\nion for the University to operate unA. 0. Lovejoy of the Hopkins, was dismissed at 11 a. m., at which<br />\ndirection of Steve Tassey, will come<br />\ntime<br />\nder the conditions imposed by the<br />\nDEAN E. W. BERRY<br />\nmet by fire and thunder from the Student Council President McClean<br />\ndirectly from New York. The band<br />\n—Courtesy Sun papers.<br />\nis<br />\nbill.<br />\nforces supporting the bill, led by John to set the strike into motion. Student<br />\nDR. BROADUS MITCHELL<br />\nPlayed here three years ago at a<br />\nAt the present time the University<br />\nT. _<br />\ncommander of the Mary- speakers will include George Douglas,<br />\nPrinceton University dance at the<br />\nland division of the American Legion. representing the Y. M. C. A.; Neal<br />\n8elvedere Hotel. The Club Soiree en- receives from the state of Maryland<br />\na grant of $67,500, this sum being<br />\nThe forces of the teachers attacked Potter, the NEWS-LETTER; Harold<br />\ngaged their services last year.<br />\nused according to law towards the<br />\nthe bill on the basis that it was en- Sampson, American League Against<br />\nThe members of the Interfraternity<br />\nsupport in the form of scholarships<br />\ntirely unnecessary, was \"rank class War and Fascism; and Stanley<br />\nBall Committee besides Murphy inRapand other gifts for a number of stulegislation,\" that it would prove a paport, National Student<br />\nLeague.<br />\nelude Bill McFeeley and Richter<br />\ndents in the School of Engineering.<br />\ngreat detriment to schools who sought Other students are to address<br />\nsimilar<br />\nWiggall.<br />\nWhat effect the relinquishment of this<br />\nThe \"strike\" this morning promises to'<br />\nbe one of the most interesting and to get foreign lecturers, and that it gatherings at Goucher College and<br />\nsum would have upon the School of worthwhile affairs on this campus in many years. It has come far from<br />\nthe was so drawn that it did not mean Morgan College.<br />\nEngineering is not possible to say at disorderly combat among opposing forces within the University<br />\nMcClean was negotiating yesterday<br />\nwhich we anything.<br />\nthe present time, Dr. Ames said. Le- witnessed last year. A common interest and a common recognition<br />\nfor the installation of an amplifying<br />\nNice Attacks Argument<br />\nof the<br />\ngal opinion would have to be taken present dangers have thrown the different groups together in a<br />\nGovernor Nice attacked Dr. Love- system. Barring rain., the meeting<br />\nmore serious<br />\nbefore any definite statement could attempt to come to a solution of the most important problem of our<br />\nday, that joy's argument at the beginning by will be held in front of Levering, with<br />\nlint Banks To Choose Players In be made, he added.<br />\nof the threat of war.<br />\nasking him if he would support a the steps serving as a platform for<br />\n\"Road To Rome\", To Be Given<br />\nThe approach should be more intelligent and coherent this year than properly drawn bill providing penal(Continued on Page 3 Col. 3)<br />\nEarly In May<br />\nlast, and should bring some concrete results in the way of action on the more ties for any teacher who gave out<br />\nserious and immediate threats now apparent. In seeking the solution, stu- \"propaganda\" in their classes. After<br />\nPor the past two weeks the Barndents will be aided to a great degree by the co-operation of the faculty. repeated attempts to state his position<br />\nstormers have been casting for their<br />\nThough the older generation has not actually solved the problems, its experi- exactly, during which the Governor<br />\nAt the latest count of the Old Gold ence and knowledge must prove of great help to the younger generation in its pressed him for a \"yes or no\" answer<br />\nePring production, \"The Road to<br />\nContest,<br />\nit was revealed that Phi Al- attack on them. Much can be done by it to show the lines that the strug- to his question, Dr. Lovejoy stated<br />\n4°Tne.\" The cast will be chosen dellpha was leading the fraternities, while gle against war must take, in a campaign that may prove long, but which is that he thought he would support such<br />\nIlltelY by next week, and more intenThe forces of the American Legion<br />\nKoenig and Safier were running neck eminently worth the fighting. In action as well as in classroom discussions,<br />\nDr. Isaiah Bowman, president-elect<br />\n3iVe rehearsing will start.<br />\nand neck for individual honors. Be- the older scholars should prove of great use in coming to reasonable, scien- came back with the argument, put of the Johns Hopkins University, told<br />\nThe task of assigning the various hind the winning fraternity was Kap- tific, and useful conclusions.<br />\nforth by Delegate White, introducer a meeting of Phi Beta Kappa alumni,<br />\nThe real test this morning will be with the audience as well as the of the bill in the Assembly, that they<br />\nParts fell on Bill Banks '29, co-coach pa Alpha and Delta Upsilon. Levinheld at the Savoy-Plaza in New York<br />\nt3f the club, since \"Howie\" Caplan son is in third plae in the unaffiliated speakers. Will all these groups, having, many of them, diametrically op- could not see that it was any disgrace Wednesday night, April 3, that modposed ideas, listen to those of the different sides and attempt to come to or hardship to the teachers to take an<br />\nclass.<br />\nern scholarship, broadly conceived<br />\nthe other director, will not be<br />\na real solution, recognizing that everyone can not be right as things stand oath, since they were \"paid by the and applied,<br />\nmust set itself the task<br />\nGoldberg,<br />\nRay<br />\nwho<br />\nin<br />\nis<br />\ncharge<br />\nof<br />\nable to help until next week.<br />\nat present? Will they recognize that they may be wrong, that the other government,\" and that a great many to \"fabricate new<br />\ndesigns for living.\"<br />\nthe competition, announces that the<br />\nThe officers and coaches of the club<br />\nfellow may have a more nearly correct analysis? Will they realize that no other public servants had to take<br />\nTo create such designs, Dr. Bowman<br />\ncontest will end midnight, April 21.<br />\nsolution of the problem can be reached as long as each side sticks to its oaths before assuming their tasks.<br />\nbelieve they have the making of an<br />\nsaid, modern scholarship must aim to<br />\nIt offers three prizes for the fraekeellent play in \"The Road to Rome\", ternity placing the most Old Gold own ideas tenaciously, and merely tries to spread them? Will they, most Declaring that the only reason for develop not only leaders, but a \"willof all, realize that the problem is one of the vastest importance to them, which the teachers could reasonably ingness to be led\";<br />\nnot alone to dis2<br />\n\\4 1len will be staged May 11 at the wrappers in the two ballot-boxes at however remote it may<br />\nseem at the present moment, and that it is worth a oppose the bill was that they wished cover truth,<br />\nbut also to produce a<br />\nthe postoffice and soda fountain. For<br />\n\"klIT'Yland Casualty Auditorium.<br />\ngreat deal of their time and effort to find the truth in the matter?<br />\nto teach \"radical\" propaganda, the state of mind that would be ready to<br />\nThe production staff has started the leading group a ping-pong table<br />\nSimply stating that war is a far-off thing will do no good in preventing Legion attacked Dr. Lovejoy for accept the truth<br />\nand to put it into<br />\nwith full equipment will be given.<br />\nWork on the set, which is a rather Second and third awards are a bridge it. The forces of war are already at work, and have been for a long time. \"hedging.\" The rest of the hearing, practice.<br />\nelaborate undertaking, under the dl- table with four chairs and a bridge The most eminent foreign commentators, including Frank Simonds, who lasting until well into the evening,<br />\nHe continued by saying that four<br />\nlectured here this week, agree that the war clouds are ready to break over consisted of declarations of patriot- propositions are<br />\nfundamental to any<br />\nlamp, respectively.<br />\nof Frank Hirschman.<br />\nEurope, and that the situation in the United States may easily lead to a ism.<br />\ndesigns<br />\nin<br />\nscholarship.<br />\nThe first, from<br />\nFor the individual winner there is<br />\ner'rlie business staff is planning sevrepetition of what happened in 1917.<br />\nan old Maya glyph, is \"always in the<br />\nti el novel publicity stunts to adver- but one prize—a cash award of ten<br />\nTaking a defeatist attitude, and declaring that a few people can do<br />\nWednesday Dues Deadline centre shall come a new word.\" The<br />\ne the play. Allen Delevett is bus- dollars.<br />\nnothing about the situation is a foolish approach, also. Those who have the<br />\nsecond is \"time does not walk backManager and William McFeely<br />\ninformation and the scientific approach can and must take the lead in forward\"; the third, \"to think fruitfully<br />\nThose seniors who have not paid<br />\nCharge of the advertising. Zenas Dohme Lecture Postponed<br />\nwarding a proper solution throughout this country and the world.<br />\nrequires us to see the relations of<br />\nclass<br />\ntheir<br />\ndues<br />\nWednesday<br />\nby<br />\nwill<br />\n:<br />\ner rs Is president of the BarnstormOf course, we realize that there cannot be expected a real unanimity<br />\nparts,\" and the fourth, \"progress by<br />\nnot have their pictures included<br />\nWhile Harold Kropman is secreDue to the fact that the next on all points, even among scholars. Inevitably, differences arise, and offer<br />\nabstractions, or generalization, for<br />\nin the 1935 Hullabaloo, according<br />\nrY-treasurer.<br />\nDohme lecture was scheduled to be problems which require further research. But this research should be done<br />\nsociety as a whole is hard and slow.\"<br />\nto John B. DeHoff, editor-in-chief<br />\n,AITIong those who are out for roles given on Good Friday, Dr. Kharasch's in an open-minded way. People frequently laugh at each other for pretendDr. Bowman added that \"the conof the publication.<br />\nst- this play are Gerald Branower, talk for that day will be indefinitely ing to \"solve all the problems of the world.\" Yet they act and think to<br />\nclusions that emerge from a discusHe added that every student is<br />\n\"1<br />\nHartman, Harold Kropman, postponed, announces the chemistry themselves as if they actually had schved all the problems, when it comes to<br />\nassured of a book, and that the sion of the four propositions run someMisa Swan, Kitty Forsyth, Bunny department. A sprained back origi- actua practice. Why not face things realistically, and recognize<br />\nthat some<br />\nwhat as follows: That an acceptabook will be of a quality equal to<br />\n.4,,,,<br />\nWilliam L. Snyder, Stanley nally prevented his giving the lecture things are not yet settled,—that we are still seeking a solution?<br />\nble modern design tioaip... rship<br />\nthe 1934 edition.<br />\nPrager, and Merrill Harmel.<br />\nas originally scheduled on March 15.<br />\n(Continued on Page 2, Col. 1)<br />\n(Continued on r-Board will drop their habitual friend-<br />\n<br />\nDr. Ames To Drop<br />\nState Financial Aid<br />\nIf Nice Signs Bill<br />\n<br />\nTeachers)'Patriots'<br />\nHave Verbal Battle<br />\nOver Oath Measure<br />\n<br />\nEDITORIAL<br />\nPotentialities Of The Day<br />\n<br />\n'Stormers To Pick<br />\nCast Next Week<br />\n<br />\nPhi Alpha Leads<br />\nOld Gold Contest<br />\n<br />\nBowman Describes<br />\nProblems, Aims Of<br />\nModern Scholarship<br />\n<br />\n\fHOME WOOD,BALTIMORE, MD., FRIDAY, APRIL 12, 1935.<br />\n<br />\ntcb e Ilevosoollet ter Q uad Quips<br />\nrOUNDED 1E27<br />\nSubscription per year_-42.00<br />\n$2.50<br />\nBy Mail<br />\n<br />\nBy JACK STEIN<br />\n<br />\nThe Snobs Of Delta Alpha<br />\nA College Tragedy—Being Necessarily Anonymous<br />\nCAST OF CHARACTERS<br />\nFRATER SUPERIOR, leader of the house,<br />\ndistinguished like the great apes<br />\nby his sheer bulk, and despite his<br />\nsize, gravely preoccupied with the<br />\nsmallest of matters.<br />\nFRATER SMYTHE, a formalist, the only<br />\nmember who has read the frat's<br />\nconstitution.<br />\nFRATER CABOTT, a snob.<br />\nSUNDRY FRATERS, somewhat cowed by<br />\nthe above, taken in probably because of their monetary contribu-<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council, Items= Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br />\n<br />\nLouis, first.<br />\nSergeant: I'm afraid I can't wait.<br />\nI've got to be off hunting Communists. My time is valuable.<br />\nSmythe: Well, Weed is a Commu-<br />\n<br />\nSergeant: Ah, young blackguard,<br />\ndid you throw that flowerpot on my<br />\nhead?<br />\nCabott: Here, here, my good man,<br />\n<br />\nBut let me introduce myself. I am<br />\nSergeant James K. Cabott—and I,<br />\nBrother Cabott, come from a family<br />\nof North Irish potato farmers.<br />\nCabott (somewhat upset): I suppose you are related to the Cabotts<br />\nof Schenectady?<br />\nSergeant: Why yes, of course.<br />\nCabott: Ah, sergeant, let me congratulate you. Thank heavens I have<br />\nno relatives outside of Boston.<br />\n<br />\nnist. So you might as well take Win<br />\nalong with you.<br />\nSergeant: A Communist? Why?<br />\nSmythe: Sure, he's Russian, isn't<br />\n<br />\nhe?<br />\nnot on yours..<br />\nSergeant: Well, if that ain't ignorSuperior: Frater Cabott, what have<br />\nYou know the trouble with yoU<br />\nance.<br />\nyou been doing up there?<br />\nboys is that you ain't educated. The<br />\nCabott: Reading—sure, reading the<br />\nyou go to haven't taught you<br />\ncolleges<br />\nconstitution.<br />\nPublished semi-weekly from Octothat there are better things than<br />\nSmythe: I beg pardon, Frater Suber to June, except during examinayour cocktails and your superstitious<br />\ntion and college noliday periods by<br />\nperior. But may I suggest that CabCouncils. Why look at that<br />\nGrand<br />\nunciergraduate.s of the Johns Hopkins<br />\n!<br />\nheavens<br />\nThank<br />\nAll:<br />\nott's been gambling on the second<br />\nHe's posiUniversity.<br />\nCabott: You see, sergeant, all men guy Smythe over there.<br />\nfloor again, so he won't have to pay<br />\na thing<br />\nread<br />\nain't<br />\nHe<br />\ne.<br />\nilliterat<br />\ntively<br />\n—<br />\ntions.<br />\nour gambling tax. You know the rule feel the urge to destroy or murder<br />\nEDITORIAL DEPARTMENT<br />\noutside that stubet,<br />\nI'll<br />\nlife,<br />\nhis<br />\nIn<br />\nSuthe<br />\nof<br />\nf<br />\nto<br />\nrebeloved<br />\ntries<br />\n-in-Chie<br />\nE,<br />\nsociety<br />\nwhich<br />\nurge<br />\nan<br />\nEditor<br />\nHORTENS<br />\nthe<br />\non<br />\nCOED<br />\nJESRF. N BORDEN<br />\nCabott: Sir, I never gamble<br />\nsyspess with often harmful results. So pid constitution. Sure, the whole<br />\nperior.<br />\nNEAL POTTER, IRVING LEBEB\".FELD,<br />\nsecond floor.<br />\nfailed<br />\nhas<br />\nn<br />\neducatio<br />\ncollege<br />\nof<br />\ntem<br />\nSERPOLICE<br />\nthe<br />\na<br />\ntype<br />\nand<br />\ny<br />\nas<br />\nWEED<br />\nsnobber<br />\nManaging Editors<br />\nPLEDGE<br />\nSergeant: Bounders—the lot of you. we have adopted<br />\ny. I,. who am self-educated,<br />\nSports Editor<br />\nGEANT.<br />\nKENNETH ZiERLER.<br />\nDon't switch the subject. Now, WHO of refined murder. We get all its miserabl<br />\nbroader person than—<br />\nmuch<br />\na<br />\nAlpha,<br />\nam<br />\nDelta<br />\nof<br />\nEditor<br />\nHome<br />\nany<br />\nteatiore<br />\nSCENE: The<br />\nhealthful joy and relief without<br />\nti.EMLrat.<br />\nTHREW THAT FLOWERPOT?<br />\nsergeant, at least yoll<br />\nin<br />\nBut,<br />\ny,<br />\nContrib. Editor<br />\nd.<br />\nfirst floor.<br />\nCabott:<br />\nSnobber<br />\nugly<br />\nits<br />\nbloodshe<br />\nof<br />\n,<br />\nthat<br />\nSuperior: I'm afraid, sergeant<br />\nof \"Varieties\"<br />\nsy<br />\n—Courte<br />\nTELN,<br />\nriAltuLu vi. hRuelvIAN J AC&<br />\nwe'll have to hold a meeting to de- the form of slave-snobbing, is what will help us get rid of Smythe.<br />\nColumnists<br />\nGull-berg: \"Look, Able, there's<br />\nThe curtain opens. Cabott is up- cide.<br />\nA Frater (rushing in): He won't<br />\nmade our Southern aristocrats beReporters<br />\nHitler down there.\"<br />\nindiof<br />\ned<br />\nstairs. The Brothers and Hortense<br />\nto, Brother Cabott. Weed hil$<br />\nbest-balanc<br />\nhave<br />\nthe<br />\n1860<br />\nfore<br />\nSmythe: But, superior, you can't<br />\nJonn C. Bra.snears, btramey M. leinKel,<br />\nstein: \"Well, what are we are awaiting the return of their have a policeman attend a meeting viduals. In India, there is a whole just run off with Hortense—and they<br />\nGullBenjamin sliternick, JeweLt<br />\npledge. They've been holding their<br />\nsnubs are getting married to night.<br />\nvv'mass waiting for?\"<br />\njiteoLioii,<br />\nof Delta Alpha! The Grand Council herarchy of snobs; one group<br />\n* *<br />\nmost provocative discussion in weeks<br />\nultithe<br />\nSuperior (shocked): Hortense gone!<br />\nuntil<br />\ndown<br />\non<br />\nand<br />\nanother<br />\ntion—<br />\nKempton, Sigmund Saner, Marvin<br />\nwon't hear of it! The constitu<br />\nstyle<br />\n'v iiiiaiii<br />\na<br />\nnew<br />\na<br />\nwith<br />\nof<br />\ntalking<br />\ncolumn<br />\ndly<br />\nthis<br />\n, rierbliner (..;1.0b6,<br />\n—excite<br />\nUL,t1C1.<br />\noff<br />\nI can't believe it- I can't beats<br />\nstart<br />\na<br />\nWeed!<br />\nfew<br />\nscapego<br />\non<br />\nWe'll<br />\nSuperior: Say, Smythe, this is too mate snub settles<br />\nsnider, ilowaru rteizensiein, Jonas<br />\nfew days ago, cigarette lighter. Then—<br />\na<br />\nacross<br />\nbody would pull any thing<br />\nany<br />\nran<br />\nlieve<br />\nI<br />\nables.<br />\nfact<br />\nUntouch<br />\nunhappy<br />\nLester<br />\n—the<br />\nJane,<br />\ncollen, Leonard<br />\nmuch. Are you the constitution, or<br />\nHortense: Look, dear, it's started<br />\nht deceitful. There, brodownrig<br />\nCaplan, Bernard Pines., Julian. Au- and which appealed to my very inso<br />\n,<br />\nor<br />\nSuperior<br />\nFrater<br />\nOh<br />\nt:<br />\nit?<br />\nis<br />\nSergean<br />\nwhere the devil<br />\nler, William Diamond, Daniel Ler- definite sense of humor.<br />\nto rain. You really shouldn't have<br />\n.<br />\ntherhood<br />\nSmythe: I beg pardon, sir, but it's whatever foolishness you are, do I<br />\nner, David Caplan.<br />\nout there in his unThe ungrateful wretch!<br />\ntsUSINESS DEPARTMENT<br />\nAn old college professor recently sent poor Weed<br />\nCabott:<br />\nin Greek on the flag over take this as an official statement?<br />\nwritten<br />\n_Business Manager died, and left an inheritance of $100,- derwear. He'll catch cold.<br />\nDAVID LEVY<br />\nthat our most scruptithink<br />\nto<br />\nCabott<br />\nGod,<br />\nno.<br />\ny,<br />\n:<br />\nOfficiall<br />\nSuperior<br />\nthere.<br />\nSuperior: Bah! I went out that<br />\nAdvertising Manager.....JULIAN COHEN 000. When this face became known,<br />\nbe but in vain!<br />\ny<br />\nshould<br />\nlous<br />\nI<br />\nsnobber<br />\nmust<br />\n.<br />\nSergeant: Greek be damned! Is it talks, but I am his superior<br />\nROBERT WATKINS it immediately debunked all previous way—and I'd do it again just for the<br />\nOffice lkianager<br />\nEnd)<br />\n(The<br />\nSt.<br />\nin<br />\nCouncil<br />\nGrand<br />\nthe<br />\ncountry<br />\nthis<br />\nconsult<br />\nof<br />\nlaw<br />\nor is it not the<br />\nyou.<br />\nROBERT LEVI<br />\nCircul,ation Manager<br />\ntheories concerning the \"poor old pro- fresh air it gives<br />\nmore important than your idiotic litn,<br />\nbarbaria<br />\na<br />\n,<br />\nYou're<br />\ne:<br />\nManager<br />\nHortens<br />\nFiling<br />\nhowand<br />\nCopy<br />\nfessor.\" Within a short time,<br />\nfraternity?<br />\ntle<br />\nfootball<br />\nPRAGER<br />\nThat<br />\nSTANLEY<br />\nThat's it.<br />\never, his \"success\" story was uncov- Henry.<br />\nCabott: Brothers, brothers. Let us<br />\ncomyou<br />\nmade<br />\nhas<br />\nyours<br />\nof<br />\nered. He had saved wisely during his training<br />\nCouncil and ask<br />\nFriday, April 12, 1935.<br />\nfor the niceties of so- write to the Grand<br />\ntraining and teaching period; he made pletely unfit<br />\nthe impertinence of<br />\nforgive<br />\nthey<br />\nthat<br />\nine!<br />\nar—imag<br />\nunderwe<br />\nhis<br />\nsmart investments, and watched them ciety. In<br />\nthis poor police force. For your inPotentialities Of The Day grow, and in addition a rich uncle Superior: Bah!<br />\non, sergeant, let me say that<br />\nformati<br />\nyou're<br />\nthat,<br />\nfor<br />\nJust<br />\nHortense:<br />\ndied and left him $99,000.<br />\n(Continued from Page 1, Col. 4)<br />\nbeen carried to the Sagoing to let me take charge of him our flag has<br />\nThis morning's strike, with faculty<br />\nThis gentleman was not a profesthe shores of the Into<br />\nDesert,<br />\nhara<br />\nwhen he gets back.<br />\nand students together on the joint sor at Hopkins, for no professor here<br />\nto the South Pole. And<br />\nOcean,<br />\ndian<br />\nconstithe<br />\n,<br />\nsuperior<br />\nBut,<br />\nSmythe:<br />\nproblems of war and free speech— could manage to save $1,000.<br />\nyou rudely with the sweep of your<br />\ntution says no women—<br />\n*<br />\n*<br />\n*<br />\nfor this is what the Teachers' Oath<br />\nwould ravish this splendid traclub<br />\nlove<br />\nI<br />\nSmythe,<br />\nEnough,<br />\n:<br />\nSuperior<br />\nBill inevitably strikes at—has the<br />\nThis 16-word masterpiece of literAnd love rates with, if not dition.<br />\nher.<br />\npotentialities of a move of real value. ature won the \"Phewlitzer\" prize:<br />\nSergeant: Stand back there, you.<br />\nabove, the constitution.<br />\na<br />\nas<br />\nfaculty<br />\nAlgy saw a bear;<br />\nWill the students and<br />\nas of a We'll teach you to trifle. College<br />\noutside<br />\nheard<br />\nis<br />\ncrash<br />\n(A<br />\nwhole be present and face things with<br />\nThe bear saw Algy;<br />\ndepression<br />\nflowerpot falling to earth from a great boys—and I thought the<br />\nThe bear was bulgy;<br />\na real view to solution? Tne anhad killed your conceit. I'm calling<br />\nheight.)<br />\nThe bulge was Algy.<br />\nswer to this question is of greatest<br />\nthrow the<br />\nHortense: Hear that? Starting the riot squad, see, to<br />\n*<br />\n*<br />\n*<br />\nimportance to the University as well<br />\njail!<br />\nin<br />\nbunch<br />\ncomHe's<br />\nwhole<br />\nSssh.<br />\n.<br />\nsee<br />\nto thunder,<br />\nas to the movement for peace.<br />\nHe's a fraternity man.<br />\nCabott: Very well. Insist on bruing.<br />\nTHE EDITORS.<br />\nHow do you know?<br />\nin<br />\nd<br />\nand we can do nothing. But<br />\ntality<br />\ndrenche<br />\nenters,<br />\n(Pledge Weed<br />\nHe answered to four names in class<br />\nremember, sergeant, it was just such<br />\nhis underwear.)<br />\nthis morning.—Banger.<br />\nThe Hopkins Leads<br />\nWeed: Sacred cow, what embar- conduct as yours that the Arabs disCame across this slip in the Collet! I feel like one of the nudes played when they burned the secrets<br />\nrassmen<br />\nh<br />\nlight For free Speec<br />\ngiate Digest, which as you know is<br />\nof the Orient at Alexandria . .<br />\nLouvre.<br />\nthe<br />\nin<br />\nTuesday in your mail<br />\nWhether they like it or not, the placed every<br />\nthe<br />\nthat<br />\nis<br />\ne!<br />\nman,<br />\nPhilistin<br />\nYoung<br />\ne:<br />\nHortens<br />\nhave found that the Collemembers of the Johns Hopkins Uni- boxes. I<br />\n: Quiet, Cabott. We must<br />\nprospective suyour<br />\nSuperior<br />\naddress<br />\nto<br />\nway<br />\nDigest is a boon to Hopkins men,<br />\nnothing more to say.<br />\nThere's<br />\nversity have become the first ranks giate<br />\nsubmit.<br />\nperior?<br />\nthat it offers embryo artists a<br />\nHorty. I for- Now first, sergeant tell us what you<br />\nin the struggle for free speech in in<br />\nsorry,<br />\nI'm<br />\nWeed:<br />\nchance to elaborate on the photos of<br />\nThe law of diminishing returns holds no terror for<br />\nMayla.nd. The attacks of the Amerwere doing in our neighborhood.<br />\ngot.<br />\nwomen.<br />\nand<br />\nmen<br />\ne<br />\nhandsom<br />\ne<br />\notherwis<br />\nArrow Sanforized-Shrunk Shorts. They cannot<br />\nican Legion at Annapolis last WedSergeant: I was chasing some darn<br />\nHortense: Quiet, And you forgot<br />\nas it may, here is the fauxthat<br />\nBe<br />\nthat<br />\nof<br />\nwas<br />\nno matter how often the garment is washed.<br />\nI<br />\ndoubt<br />\nty.<br />\nshrink<br />\nno<br />\nwhen<br />\nar<br />\nfool in his underwe<br />\nnesday could leave<br />\nthe customary sign of your inferiori<br />\npas:<br />\nthe<br />\nhorror<br />\nWith<br />\nthe only process of its kind, guarmind.<br />\nzing,<br />\n's<br />\nSanfori<br />\nanybody<br />\nBow.<br />\nstruck.<br />\n.<br />\n.<br />\nin<br />\n.<br />\nOne loose-leaf binder for your<br />\n: That, I take it, was Weed.<br />\n: That'll do. Now, where's<br />\nent fit forever.<br />\n\"patriotic soldiers\" and \"mothers\"<br />\nSuperior<br />\nSuperior<br />\nantees<br />\nperman<br />\ncopies of \"Collegiate Digest\", valblanket you were supposed<br />\nt: One of your brothers,<br />\nhorse<br />\nthe<br />\nSergean<br />\nspoke in attack on anyone who could<br />\nued at one dollar, plus one unuDon't resign yourself to underwear that continuThe first of your twelve eh? Well, I thought so. I'll have to<br />\nto bring?<br />\neven listen to a person with a word<br />\ncolored copy of \"A Cartosual,<br />\nally<br />\ncreeps up on you, cuts you in two, and genany<br />\nfor<br />\nyou<br />\nthat<br />\ny<br />\nprove<br />\nto<br />\nHerculean labors—<br />\nabout socialism or sympath<br />\narrest him, too.<br />\ngraph or Collegland,\" valued at<br />\nerally<br />\nruins your disposition. Arrow Shorts give<br />\nhis<br />\ntn.<br />\nin<br />\nn<br />\nExcellen<br />\nattentio<br />\nour<br />\nAmerica<br />\nmerit<br />\nGoodthe<br />\nbut<br />\nCabott:<br />\nother people<br />\ntwenty-five cents—both for only<br />\nsnuck<br />\nfor<br />\nu<br />\nsir—I<br />\nsee,<br />\nyou<br />\nWell,<br />\nwhere you really need it—they are<br />\nyou—yo<br />\nyou<br />\ncomfort<br />\nand<br />\nWeed:<br />\nbeYes,<br />\nt:<br />\nvaster<br />\nSergean<br />\nthe<br />\nis<br />\nhorror<br />\nTheir<br />\nmouth.<br />\na dollar and a quarter. Sounds<br />\nthe<br />\nboy<br />\nover<br />\nthe<br />\nhit<br />\nstables,<br />\nme.<br />\nthe<br />\nat<br />\nin<br />\nfull cut with ample leg room—that bedeviling<br />\nthrowing the pot<br />\ncause they know virtually nothing<br />\ngoods, doesn't it?<br />\nleast fifty darkies<br />\nat<br />\nthis<br />\nthen<br />\nGet<br />\nand<br />\nhead,<br />\nofficer.<br />\nListen,<br />\nCabott:<br />\ncenter seam has been replaced with a saddle seat<br />\nTheirs<br />\nabout that of which they speak.<br />\nThat's like giving away snow in the<br />\nrushing at me with open razors. straight. You can do what you want<br />\ncame<br />\ne<br />\n—the garment is tailored throughout with your<br />\n\"fugitiv<br />\na<br />\nis what Milton termed<br />\nwinter time.<br />\nSuperior: Don't lie. Where's the with Weed. But I didn't throw the<br />\n*<br />\nface<br />\n*<br />\nto<br />\n*<br />\nafraid<br />\nin mind. See your Arrow dealer today.<br />\ncomfort<br />\nvirtue,\"<br />\ned<br />\ncloister<br />\nand<br />\nhorse blanket?<br />\npot at you.<br />\nthe truth; or at least they would be- The Wedding Guest, he beat his breast<br />\nWeed: I swear it sir. I had the<br />\nSergeant: No? Then at someone<br />\nArrow Undershirts<br />\nArrow Shorts<br />\nlieve all others' to be so.<br />\nThe bells began to toll;<br />\nI had no pockets in else, I suppose.<br />\nlook,<br />\nBut<br />\nthing.<br />\nIt becomes the task of the Hopkins But still the stud refused to go<br />\n50c up<br />\n65c up<br />\nmy underwear to carry it in and I<br />\nCabott: Yes.<br />\nthen, to rene,w its faith in truth, and<br />\nInto the button hole.<br />\nbesides, I didn't<br />\nand,<br />\nit<br />\nhide<br />\ncouldn't<br />\nWho?<br />\nt:<br />\nSergean<br />\n—Tiger.<br />\nto seek to establish it in the minds<br />\nthink there were any horses up here<br />\nCabott: Well, if it interests you, I<br />\n*<br />\n*<br />\nof the many who are at present so<br />\nanyway.<br />\nit at Weed—the little snip.<br />\nthrew<br />\nof<br />\nfurther,<br />\nfew<br />\na<br />\ngo<br />\nmust<br />\nIndiana<br />\nof<br />\nIt<br />\nty<br />\nrmed.<br />\nmisinfo<br />\nAt the Universi<br />\nSuperior: Enough! You have failed!<br />\nt: You mean your own<br />\nSergean<br />\ncourse, and transform its beliefs into weeks ago in a math class, the proYou do not love your fraternity!<br />\nDon't bluff, son. It'll go all<br />\n?<br />\nbrother<br />\nthe<br />\nng<br />\nan<br />\norganizi<br />\nof<br />\nby<br />\nname<br />\naction, specifically,<br />\nfessor came across the<br />\ne: But dearest, he looks so the worse with you.<br />\nHortens<br />\nSANFORIZED SHRUNK<br />\nvotes of the Legislature against any absent student. \"Miss Usel, once,\"<br />\nwretched. . . . Weed, come along with<br />\ntraitor!<br />\na<br />\nCabott<br />\nWhat,<br />\n:<br />\nSuperior<br />\nwill<br />\nfight<br />\nrestriction of speech. The<br />\nhe said, \"Miss Usel, twice?\" \"Miss me and we'll fix you a whiskey soda.<br />\nCLIYETT, PEABODY &CO., INC., TROY, N. Y.<br />\nSmythe: It'll go hard, Cabott. The<br />\nbe hard, no doubt, because, in the first Usel three times.\" \"Sold,\" answered<br />\nBut<br />\ndarling.<br />\nright,<br />\nAll<br />\nd:<br />\nSuperio<br />\nconstitution knows how to treat with<br />\nplace, if the Teacher's Oath Bill be- a sleepy freshman in the back row.<br />\npromise me, you won't get drunk double-dealers.<br />\nGovby<br />\nessig\"\"7„.<br />\njudging<br />\n(which,<br />\ncomes law<br />\n01111111111MILIME1111.1111111111111111111111.111.11111,<br />\nagain. And don't give him too much.<br />\nCabott: Well, all of you listen. I<br />\nernor Nice's attitude Wednesday, it<br />\nHortense: Sure, you old sot. (They was looking over Weed's ancestors in<br />\nwill), the University will have to give<br />\nexit Outside there is a terrible belthe society lists in our private files.<br />\nup State aid to the extent of $67,500;<br />\nlowing. The door opens. An enraged And I found after careful searching—<br />\nand, in the second place, because We cigarette the following:<br />\nbull enters.)<br />\nSuperior: You found he's not in the<br />\nit will have to fight the American LeDR. KELSO MORRILL, head laPolice Sergeant: Of all the incon- Blue Book?<br />\ngion, one of the strongest and most crosse coach and instructor in math- siderate places I ever seen—who the<br />\nCabott: Worse than that.<br />\nvicious lobbies in the country, which ematics, \"whose stickmen solved the devil threw that consarned flowerpot<br />\nSuperior: He's not on the Mayflowis set on establishing its prestige Dartmouth equation, 19 to 4,\" last on my head?<br />\ner list—professed or genuine?<br />\n(probably smelling more bonus, etc., Saturday.<br />\nSmythe: I fear you have the wrong<br />\nCabott: Far worse. I don't even like<br />\ncountry<br />\nthe<br />\nout<br />\nelected<br />\nthrough<br />\nin the offing)<br />\nJULIUS GELBER, recently<br />\nplace, sir. Our constitution forbids<br />\nby getting one of these bills passed captain of the wrestling team, for such activity. And I'm here to say to mention it.<br />\nAll: What is it?<br />\nin every state, according to its work rendered.<br />\nthat the constitution can NEVER be<br />\nCabott: I have found without a<br />\nbhsiformer<br />\nRG,<br />\nGOLDBE<br />\navowed intentions.<br />\nRAY B.<br />\nchanged!<br />\nof a doubt that Weed is dewith<br />\nshadow<br />\nThe Hopkins is thus faced<br />\nness manager of the NEWS-LETTER,<br />\nSergeant: Never mind that. Which<br />\nfrom a family of South Rusfor<br />\nfight<br />\nscended<br />\nide<br />\ndues.<br />\nnation-w<br />\na<br />\nSenior<br />\non<br />\njoining in<br />\nfor collecting the most<br />\nof you done it? Fast now. Speak<br />\nsian plumbers.<br />\nfree speech, for any amount of minLORRAINE WAGNER, a member up.<br />\n. All (in unison): Oh good heavens!<br />\nimizing the present measures will not of the Literature and Language group,<br />\nSuperior: I resent your promiscuity,<br />\nremove the fact that the Legion and for his successful completion of a sergeant. I alone am responsible here. And he hid it from us all this time!<br />\nAnd I always thought Weed was as<br />\nits allies are set upon preventing the 121-page thesis.<br />\nSergeant: My what? Listen you;<br />\nof<br />\ns as Grass or Alfalfa!<br />\nmeans<br />\nharmles<br />\nlawful<br />\nby<br />\nation<br />\ndissemin<br />\nmayor's nervous system. InThe question is whether we I am the<br />\nt: Why you damned snobs!<br />\nSergean<br />\nanything which they consider \"radi- at stake.<br />\nthe<br />\ninsulted<br />\nhave<br />\npeople whose ideas sult me, and you<br />\nlet<br />\nto<br />\ngoing<br />\nare<br />\nwho<br />\nmay be all right. And sureone<br />\nboy<br />\nNo<br />\nThat<br />\notic.\"<br />\ncal\" or \"unpatri<br />\nRemember<br />\nadministration.<br />\nwell as their hats are out of style entire<br />\nly a plumber is a credit to any nalistened to the arguments at the as<br />\nthat—<br />\nreverse<br />\nour thoughts to us.<br />\ntion—especially, gentlemen, to Russia.<br />\nThis new shoe comes in a fine, scratch-proof<br />\nhearing on the bill could mistake this dictate<br />\nSuperior: Well, no one threw anycomfortable<br />\nresponsi<br />\nreal<br />\na<br />\nhas<br />\nHopkins<br />\nThe<br />\n.<br />\nully<br />\nWonderf<br />\nsergeant<br />\nwhite.<br />\nin<br />\nabsurd,<br />\nbe<br />\nnot<br />\nor<br />\nif<br />\nDon't<br />\nfact<br />\ngrey<br />\nCabott:<br />\nin<br />\n,<br />\nbrown,<br />\nin<br />\nFascism<br />\ncalf<br />\npurpose.<br />\nyou here, unless upstairs—<br />\noutdoor<br />\nresting upon it. The problem thing at<br />\nWe merely<br />\n. . . and easy to clean. Smart and efficient for<br />\nname, is reaching out for a grip on bility<br />\nthat's it. Upstairs. We don't say he's bad.<br />\nSure,<br />\nt:<br />\nSergean<br />\na<br />\nwith<br />\nbility<br />\nresponsi<br />\nthat<br />\nmeet<br />\nto<br />\nis<br />\nacyet<br />\nas<br />\nhasn't<br />\nsociety<br />\nsay that<br />\nor campus wear.<br />\nthe United States.<br />\nhim.<br />\nthat will prove genuinely I seen<br />\nFreedom of thought and expres- response<br />\nSwell cepted him. If we take him in, it<br />\nCabott.<br />\nits<br />\nbet<br />\nI'll<br />\n:<br />\nSuperior<br />\n\"Lou\" Reuling<br />\nfight<br />\neffective, and to carry on the<br />\ndown the barrier that digsion and the ability of the people of<br />\ncalls upstairs.) Oh Cabott . . . will break<br />\n(He<br />\nAs<br />\nlate.<br />\ntoo<br />\nCallahan—Representing<br />\nis<br />\nit<br />\n\"Tom\"<br />\nbefore<br />\nwith energy<br />\nexalts us. I threw a<br />\nthe country to change their governCabott. Come on down There's some nifies us—that<br />\nfor<br />\nkeep<br />\nhonestly<br />\ncan<br />\nthey<br />\nas<br />\nlong<br />\nown<br />\npot at him as a gesture for my<br />\nment by peaceful means, things on<br />\n.to see you. (Enter Cabott)<br />\nmotto \"Veritas vos liberabit,\" one<br />\nwhich this country has long prided their<br />\nsick. social security. If I missed, I apolohe's<br />\nbet<br />\nI'll<br />\nha.<br />\nHa,<br />\nCabott:<br />\nStreet<br />\nmen will fight for freedom<br />\nitself uhe threatened by groups which Hopkins<br />\ndisheveled.) gize to all of you.<br />\n8 East Baltimore<br />\nof Honor Since 1873<br />\nplace of every (See the sergeant quite<br />\nSoles<br />\nthe<br />\nis<br />\nIt<br />\n.<br />\nthought<br />\nof<br />\nvery<br />\nn.\"<br />\nall<br />\nthat's<br />\nAmerica<br />\neeallree Straeg. \"truly<br />\nSergeant: Well, son,<br />\nme,<br />\nin the Oh, oh, Superior, you don't want<br />\nreirst it was Leiamodern scholarship, scholar and student to join<br />\nwell. And your name is Cabott, eh?<br />\nsure.<br />\nI'm<br />\nN. P.<br />\nwas Himes to Hoilination of facts, is common defense.<br />\n<br />\nEntered as second-class matter December 3, 100a, at the Postotiace in<br />\nBaltimore, Md., under the Act of Congress, November 3, 187a.<br />\n<br />\nArrow Shorts<br />\nwon't grow shorter<br />\n<br />\n1Men Of The Week<br />\n<br />\nWe Recommend<br />\nTHE<br />\n<br />\n\"FRIAR<br />\n<br />\nAn<br />\nOutstanding<br />\nNew Shoe<br />\nBy Hess<br />\n$5.95<br />\n<br />\nS.. II-I IlLSS' SO SS<br />\n<br />\n\fHOME WOOD,BALTIMORE, MD., APRIL 12, 1935.<br />\n<br />\nt.<br />\n<br />\nDescribes Seven Of Faculty<br />\nJays To Play Bowman<br />\nScholarship's Aims<br />\nTo Speak At Strike<br />\nAt Dance For<br />\nAthletic Awards<br />\n<br />\n(Continued from Page 1, Col. 6)<br />\nshould have some relation to the per(Continued from Page 1, Col. 6)<br />\nsonal good of the individual to the the speakers. In case of inclement<br />\ntoil of the day, to the job; that in this weather, the group will adjourn to the<br />\njob if you do things for praise and Latrobe assembly hall.<br />\nfor recognition only at the beginning;<br />\nAs has been previously stated, the<br />\nthat scholarship itself and all its re- local demonstration is part of a nasources should quickly drive a man tion-wide movement in colleges and<br />\ninto the second step—that the work universities to register student opposhould be done whether or not rec- sition to war. The Hopkins strike<br />\nognition comes—and finally, to the committee issued the following statefunds<br />\nadditional<br />\nraise<br />\nto<br />\norder<br />\nIn<br />\nstage of full maturity—that, the ment late yesterday afternoon:<br />\nlast<br />\nfor athletic sweaters and awards for<br />\nbeing done, one does not miss<br />\nwork<br />\n\"Advance reports indicate that the<br />\ncomintramural and inter-fratenity<br />\nexpect the praise.<br />\ndemonstration will be one of the bigpetition, the Johns Hopkins Cotillion or<br />\n\"Progress in abstraction is made gest events in the history of organBoard will hold a benefit dance next<br />\nposition won for it not only by ized intercollegiate activity. Between<br />\nSaturday, April 20, from 9 to 12, in and<br />\nand protracted thinking, but 100,000 and 150,000 students will parvigorous<br />\nLevering Hall.<br />\nalso by a willingness—however re- ticipate in more than 100 institutions.<br />\nThe dance will be the last one given<br />\nluctant or partial it may still be--to The National Council of Methodist<br />\nby the board this year. Music will be<br />\nfollow the thinkers. That is one of Youth has urged all of its 70 member<br />\nsupplied by Frank Orchard's Jays.<br />\nthe great difficulties of the time.<br />\ncolleges to co-operate.<br />\nTickets are being sold at $5 stag or<br />\n\"It has been well said that many<br />\n\"Here at the Johns Hopkins we<br />\ncouple, and may be secured from the<br />\nof our problems are intellectually have sought to conduct the strike on<br />\nor<br />\nBoard<br />\nCotillion<br />\nmembers of the<br />\neasy. We know in a good many in- a dignified and democratic basis. It<br />\nfrom candidates.<br />\nstances what the answer is, or at least has been essentially an undergraduate<br />\nAccording to T. Rogers Bartlett, we know a workable answer. It is the<br />\nproject and a group project. No one<br />\nJr., president of the board, the money acceptance of the truth, no less than organization has been allowed to domrealized from the project will be en- the discovery of the truth, that calls inate the proceedings. We are looktirely turned over to the Athletic for new thought and leadership.<br />\ning forward to a large turnout toBoard to help pay for the remaining<br />\n\"Discovery may be generally hard, morrow and can promise a stimulatsweaters.<br />\nbut once in a while it may come in ing program.\"<br />\nThis is the second time this year flashes of insight. Such experiences<br />\nthat the undergraduate students have are in many cases sweet only when Our interest is in the future, but alas:<br />\ncome to the aid of the athletic activ- detached from current human expe- experience is in the past, and human<br />\nities. The \"gymboree\" aided in the rience. The hard way begins when it wisdom as yet furnishes only a frail<br />\npayment of the football sweaters.<br />\nis sought to carry the truth forward bridge, a mere catwalk between these<br />\ntwo sharply separated regions.<br />\nLast year the board financed a into human life.<br />\n\"There are many contending voices<br />\ntraining table for the football team<br />\ncourwith<br />\nmust<br />\nface<br />\n\"Every one<br />\nbut it was not reintroduced this year. age one of the severest limitations in the market place. Plato's dictum<br />\nIn previous years athletic scholar- set by fate upon human affairs, that goes unheeded, that there should be a<br />\nships to keep valuable athletes in the understanding always comes too late. special penalty for pretended wisdom.\"<br />\nUniversity were also furnished.<br />\nOther officers of the Cotillion<br />\nBoard, besides Bartlett, who is president of this year's group, are Lewis<br />\nE. Reuling, treasurer; and D. Mead<br />\nJohnson, who is secretary. Members<br />\nof the body are Bill McConnell, Burton Cannon, Dave Erck, James Bradford and Brian Murphy.<br />\nIf the new project proves to be well<br />\nreceived and successful among the<br />\nstudent body, the board will give othTUXEDO 1400<br />\n5315 YORK ROAD<br />\ner benefit dances next year to buy<br />\nIntramural trophies or cups for winall1111=1M1111111111111111101111Lning teams in the basketball league.<br />\n<br />\n4 de Aii4kit<br />\n•••<br />\nifte<br />\ndc5ut S,Ce, Wm-A(7r<br />\n<br />\nCotillion Board's Last Dance<br />\nTo Be Held In Levering<br />\nHall Next Saturday Night<br />\n<br />\nSAY IT WITH FLOWERS<br />\n<br />\nI. H. MOSS,INC.<br />\n<br />\nFLOWERS FOR ALL OCCASIONS<br />\n<br />\n(4, qvutiat/ty<br />\n344,11<br />\nArAre<br />\n.xt,<br />\n<br />\n•i•<br />\n<br />\nWhat the Governor means is<br />\nthat crossing on a German<br />\nLinergives an opportunityfor<br />\nfirst-hand observation on<br />\nwhat he terms \"combining the Science ofNavigation<br />\nwith the ArtofFine Living.\"<br />\n<br />\n•<br />\n•<br />\n,4kv..4<br />\n,. 1,4:441kkv<br />\n<br />\n•:5:9,1,:•••<br />\n<br />\nis<br />\n<br />\nlike orchestral playing<br />\n5OMETHING<br />\nthis running of ships across the ocean—a<br />\nwork required of<br />\n<br />\nspecial aptitude for ensemble<br />\nall members ... You find it on German Ships:<br />\nEvery steward, seaman, officer born to a part,<br />\ntrained by years in working in unison. Ships<br />\nand equipment as fine as can be made, kept in<br />\nperfect order. And a tradition that has its<br />\nhand on every shoulder. day and night.<br />\nFastest Way to France, England, Germany-<br />\n<br />\n13remen - Europa<br />\nThe de luxe Columbus leaves June 29 — the<br />\nSpecial Student Sailing—for Ireland, England, France, Germany, and every Wednesday<br />\nMidnight a sailing of the \"Famous Four\"<br />\nnew yorh . . Deutschlanb<br />\nqamburg . . Albert Bailin<br />\nCabin Liners St. Louis . . Berlin . . Stuttgart<br />\nto Ireland, England. France. Germany.<br />\n<br />\nAssistance and Advice to Students going abroad for<br />\ntravel or study. Write Educational Service Department, in any of our offices.<br />\n<br />\nAlustratett Literature on all Ships, all Classes. ijour focal Trawl Agent, or<br />\n<br />\nfiamburg-rimericon fine • north Oman Ito<br />\n323<br />\n<br />\nNorth Charles Street, Baltimore<br />\n<br />\n:•::?<br />\n<br />\n•:'<br />\n<br />\n•}1<br />\n<br />\ns<br />\n<br />\nWhen two is company I don't make a crowd<br />\n<br />\nOP'<br />\n<br />\nNever a bitter, undeveloped top<br />\nleaf in me. Never a grimy, tough<br />\nbottom leaf. I use only the fra-<br />\n<br />\nleaves...the leaves that give you<br />\nthe mildest, best-tasting smoke.<br />\nI do not irritate your throat. No<br />\nwonder I'm your best friend.<br />\n<br />\nLUCKIES USE ONLY THE CENTER LEAVES... CENTER LEAVES GIVE YO<br />\n<br />\n44.<br />\n<br />\nCopyrhibt 193.5, The American Tobacco Company.<br />\n<br />\ngë -<br />\n<br />\n\fHOME WOOD,BALTIMORE, MD., APRIL 12, 1935.<br />\n<br />\nDelaware Runners To Supply<br />\nOpposition For Jaymen In<br />\nInitial Meet At Homewood<br />\n<br />\nBoo! Roo! We Lose<br />\nNetmen Debut Against Strong<br />\nNavy Team Results In<br />\n9 To 0 Whitewash<br />\nThe Hopkins racquet wielders opened their 1935 season Wednesday aft-<br />\n<br />\nLambert Ace Of Blue Hens;<br />\nCapt. Neu And Clark<br />\nLead Jay Speedsters<br />\nBy JULIAN ADLER<br />\nIn augurating their season against<br />\none of the strongest opponents scheduled, the Johns Hopkins runners will<br />\nmeet Delaware University at Homewood tomorrow afternoon. The field<br />\n<br />\nbecause of the fact that this is the<br />\nrubber encounter, both teams having<br />\ncaptured two of the last four contests. As every meet has been won<br />\nby the home team, the Jays have a<br />\npsychological advantage, but on paper the visitors seem to possess a<br />\n<br />\nNIM111<br />\n•<br />\n111111101.01..11.1•111=11111111110 SWUM<br />\n<br />\n-Courtesy<br />\n<br />\nNews-Post<br />\n<br />\nJEAN HOFMEISTER<br />\n<br />\nStudents Selected<br />\nTo Referee Games<br />\nTen Students Named By Baer<br />\nTo Umpire Class Games;<br />\nR. Levy In Charge<br />\n<br />\nslightly stronger aggregation.<br />\nLambert Outstanding<br />\nOne of the outstanding members<br />\nof the opposition is Lambert, a sprinter and broad-jumper, who has proven<br />\nhimself a consistent winner against<br />\nthe Black and Blue. Ted Graziano and<br />\nWillard Neu are the Hopkins men<br />\nwho will attempt to match the Delaware ace's speed, and a close duel is<br />\nanticipated when these runners meet.<br />\nGeorge Carey is another competitor who is expected to prove a worthy<br />\nfoe to the Hopkins' weight men since<br />\nhe secured first in three events against<br />\nthe Jays last year. Carey, who also<br />\nstarred on the Delaware swimming<br />\nsquad that recently defeated the<br />\nJays, will attempt to duplicate his<br />\ntank victories on the track. The men<br />\ncompeting in the weights for Hopkins<br />\nare Marovek, Chancellor, Ellis, Craziano, and Carlin. The first two are<br />\nveterans who have been coming close<br />\nto Carey for the last two years, and<br />\nwho hope to finally turn the tables on<br />\ntheir opponent tomorrow.<br />\nDelaware Strong<br />\nIn 1934 the Delaware team was<br />\nstrongest in the field events, holding<br />\nthe Black and Blue to 7 points. Hopkins, however, is now definitely<br />\nstronger in this department than they<br />\nwere, and expects to make a more<br />\ncreditable showing. Outstanding for<br />\nthe Jays are Neu in the broad jump,<br />\nand B ac and Jarmon in the high jump.<br />\nHopkins undoubtedly will be favored in the distances. Last year the<br />\nBlue Jays scored 26 out of 27 markers in these races, and most of the<br />\nmen who accounted for this total will<br />\nawait the starters' gun again tomorrow. Some of the men who scored<br />\nheavily in 1934 are Paul Holtzman,<br />\nLeonard Emmert, Earl Sholtes, and<br />\nRoland Clark. The former two will<br />\nrun the mile and two-mile respectively; Sholtes will compete in the mile<br />\nand half-mile, whie Clark is entered<br />\nin the latter event. In addition to<br />\nthese men, others who will add to the<br />\nJays' strength are Brown, Lyman,<br />\nHughes Castelle, Maisel, Johnson, and<br />\nMiller<br />\n<br />\nBy SIGMUND M. SAFIER<br />\nInterfraternity and class softball<br />\nAfter the recent frat volleyball football, Pi Lam worked up in speedy<br />\nleagues<br />\nhave been formed, and schedplayoff<br />\nin which Pi Lamba Phi de- stages to 105 in volleyball to win the<br />\nDespite the one-sided score, most<br />\nules arranged through the efforts of<br />\nSigma<br />\nfeated<br />\nPhi<br />\nEpsilon,<br />\nmemthe<br />\nof the matches were closely-contested,<br />\nleague championship. In basketball Reuben Baer of the Physical Trainbers of the physical training departCaptain Siverd, Hartman and Goldberg<br />\nPi Lam dribblers finished in a ing Department.<br />\nthe<br />\nment, who take care of frat and class<br />\nshowing flashes of good form. Coach activities, made a<br />\ntie for third place with a score<br />\ntriple<br />\nAll freshmen teams will play erecord of the scores<br />\nHofmeister remarked at the conclu- held by each fratertlity thus fan of 85.<br />\nery Friday, sophomores every Wednesday, juniors on Thursday, and the<br />\nsion of the encounter he was much These records are based on the rePhi Sig Most Consistent<br />\nseniors each Tuesday. The games will<br />\nmore pleased with the team than sults of the frat touch football, basthroughconsistency<br />\ngreatest<br />\nThe<br />\nstart at 4.15 and last seven innings.<br />\nketball and volleyball leagues.<br />\nthe score warranted, and he expected<br />\nout the three activities was shown by Except in extremely bad weather, all<br />\nPhi Sig Leads Frats<br />\nthe Jays to win their full share of<br />\nthe Phi Sig sportsmen. Although they games will be played as scheduled,<br />\nPhi Sigma Delta leads the sixteen<br />\nmatches.<br />\nfailed to gain a first place, their but in case a team must postpone a<br />\nfraternities with a total score of 255.<br />\nThe next opponent to be met will be<br />\ngame for reasons other than inclemClose behind in second place is Delta second in touch football, tie for third<br />\nent weather, Reuben Baer must be<br />\nSt. John's and the affair is schedUpsilon with a score of 250, while place in basketball, and third place<br />\nnotified at least twenty-four hours beuled to take place this afternoon at Sigma Phi Epsilon is third with a<br />\nin volleyball was enough to bring fore game time. Failure to do so will<br />\nHomewood. If the courts are in poor score of 225.<br />\nthem out on top with 255 points.<br />\nresult in the forfeiture of the game.<br />\ncondition, efforts will be made to<br />\nIn the touch football league held<br />\nAll-Stars To Be Chosen<br />\nThe following rules will prevail:<br />\nchange the site to the cement courts during December, Phi Kappa Psi got<br />\nAs in touch football, it is expected<br />\n1. The base runner must keep his<br />\nin Druid Hill Park. Following to- off to a good start by winning with that all-star selections will be made<br />\non base until the catcher touches<br />\nfoot<br />\nday's encounter, the team travels to a score of 105. However, in the other In basketball and volleyball. At the<br />\nthe<br />\nball or until the ball is hit by<br />\ntwo<br />\nactivities,<br />\nPhi<br />\nKappa dropped present time the same frats are parPhiladelphia for an engagement with<br />\nthe batter.<br />\nSwarthmore Saturday. At the same back and finished in the three sports ticipating in a softball tournament.<br />\n2. There is no bunting.<br />\ntime, the junior varsity team will be with a low of 125. Phi Sig took sec- An inter-fraternity tennis tourney is<br />\n3. A batter cannot run to first base<br />\nmeeting Episcopal High at Alexan- ond place with 90 and third place in the process of being organized.<br />\nwent to D. U. with a score of 80. Phi<br />\non his third strike.<br />\ndria, Va.<br />\nThe standings to date:<br />\nKappa Psi further showed its right to<br />\n4. A runner leaving his base too<br />\nThe Hopkins-Navy matches:<br />\nTouch Basket- Volley<br />\nthe touch football title by placing two<br />\nsoon on a hit ball is out; otherwise<br />\nSINGLES<br />\nFootball ball 'ball Total he must return to his former base.<br />\nmen on the all-star team selected by<br />\nJ. Mann defeated Siverd, 4-6, 6-3, Ed Lotz.<br />\nFraternity<br />\nThe runner may be tagged out be6-4.<br />\n80<br />\n85<br />\n255 tween bases; however, if he makes<br />\nPhi Sig. Delt 90<br />\nD. U. Upsets Phi Gam<br />\nGay defeated Hartman, 10-8, 6-3.<br />\n250 the next base after having left too<br />\n65<br />\n105<br />\n80<br />\nThe basketball title was more close- Delta Up<br />\nKimmel defeated Kramer, 6-1, 6-2.<br />\nsoon, he must return to the former<br />\nly contested. In the final contest, held Sig. Phi Ep 65<br />\n225<br />\n80<br />\n80<br />\nNoel defeated Buck, 6-1, 6-2.<br />\nbase.<br />\nlate<br />\nin<br />\nMarch,<br />\nD.<br />\nU.<br />\ndefeated<br />\nPhi Phi Gam. D 65<br />\nOelheim defeated Goldberg, 6-3, 2-6,<br />\n220<br />\n55<br />\n100<br />\n5. A runner may score a run only<br />\nGam 24 to 22 to take the champion6-4.<br />\n85<br />\n30<br />\nPi Lam. Phi<br />\n220 on a hit ball.<br />\n105<br />\nship. D. U. finished the season with<br />\nH. Mann defeated Tillman, 6-1, 6-4.<br />\n6. A pitcher is in his box when<br />\n85<br />\n215<br />\n70<br />\na total score of 105 while Phi Gain Beta Theta Pi 60<br />\nfeet are on the box.<br />\nboth<br />\nDOUBLES:<br />\n65<br />\nSigma<br />\n200<br />\nKappa<br />\n60<br />\n75<br />\nwas 5 points behind with an even 100.<br />\n7. A runner may advance only one<br />\nJ. Mann and Kimmel defeated Si- The close rivalry between the frats is Alpha T. 0<br />\n65<br />\n200<br />\n60<br />\n75<br />\nbase on an overthrow at home, first,<br />\nverd and Hartman, 6-3, 3-6, 6-3.<br />\nshown by the three ties for third Phi Alpha<br />\n155 or third.<br />\n50<br />\n60<br />\n45<br />\nGay and Noel defeated Buck and place between Phi Sigma Delta, Pi<br />\n140<br />\n25<br />\n55<br />\n60<br />\nKap. Alpha<br />\nGoldberg, 6-2, 6-2.<br />\nLambda Phi, and Beta Theta Phi.<br />\n125<br />\n5<br />\n15<br />\nH. Mann and Grantham defeated Each team finished with a score of 85. Phi Kap. Psi 105<br />\nPhone Belmont 7908<br />\nTillman and Stine, 6-2, 6-2.<br />\n90<br />\n40<br />\n50<br />\nIn the recently played off volleyball T. A. Phi<br />\n75<br />\n25<br />\n30<br />\n20<br />\ncontest, Pi Lam captured the frat Delta Phi<br />\nSt. Paul at 33rd Street<br />\nPOSTPONED GAMES<br />\ncrown by defeating Sigma Phi. The 0 K 0<br />\n50<br />\n50<br />\nPreecriptions-School Supplies-Candy<br />\nlatter frat topped Division I with 80 T. A. Omega 25<br />\nCigars - Unexcelled<br />\n20<br />\n45<br />\nAccording to an announcement<br />\nFountain Service<br />\npoints, while the former group led<br />\nA.<br />\nD.<br />\n30<br />\nPhi<br />\n5<br />\n35<br />\n•<br />\nmade by Reuben Baer of the Physboth Divisions with 105 points. Phi<br />\nical Training Department, all interSig was a close third with 80 points,<br />\nclass games postponed due to bad<br />\nHOPKINS BELTS, BUCKLES<br />\nlosing to the Pi Lam volleyballera in<br />\n•<br />\n•<br />\nweather will be played during the<br />\n$2.50<br />\nthe Division II playoff. The Pi Lambda<br />\nPrinters of<br />\nlast week of April. Postponed frat Phi athletes, after a slow start, ralPay 50 Cents A Week<br />\nPHILOLOGICAL and SCIENTIFIC<br />\ngames, however, will be played<br />\nlied in time to finish in a tie for fourth<br />\nPUBLICATIONS<br />\nduring the course of the season.<br />\nplace with a total score of 220 for all<br />\n12-20 HOPKINS PLACE, BALTIMORE<br />\n105-113 N. Charles Street<br />\nthree sports. From a low 30 in touch<br />\nNavy team at Annapolis.<br />\n<br />\nDelaware Strong<br />\n<br />\npetition fifteen minutes later.<br />\nThe duel will be doubly interesting<br />\n<br />\nPhi Sig Leading Race By Five-Point Margin; Delta Upsilon Modification Of Rules InIn Second Place; Pi Lam Victor In Volleyball; Spring<br />\ncludes 7 New Points; To<br />\nProgram Calls For Softball Leagues<br />\nPlay Once A Week<br />\n<br />\nernoon with a 9-0 loss to a superior<br />\n<br />\nMeet Saturday In Fifth Contest Between Two Teams;<br />\nEach Hold Two Wins<br />\n<br />\nevents will start at 1.30 p. m., while<br />\nthe trackmen will begin their com-<br />\n<br />\nSix Teams Waging Close Race Class, Frat Softball<br />\nIn Interfrat League Tourney Leagues Organized<br />\n<br />\nSudent umpires for football games<br />\nwere announced Wednesday afternoon<br />\nby Reuben Baer, who is in charge of<br />\nthe softball tournament.<br />\nThose who were selected to umpire<br />\nthe games are: Bernie Cherry, Al<br />\nSavage, Dick Byer, Ray Fertig, Arnold Glantz, Ernie Pieper, Abe Edelman, Hal Zheutlin, Dan Goldman, and<br />\nDick Pasternak. At the head of all<br />\nthese umpires is Ronald Levy, a former Hopkins student and now a graduate student. He will be the highest<br />\nofficial in all cases.<br />\nThe schedule of umpires for each<br />\nday follows:<br />\nTuesday-Frat Games: Levy, Cherry. Class Games: Goldman, Paterflak.<br />\nWednesday -Frat Games Levy,<br />\nByer. Class Games: Fertig, Cherry,<br />\nSavage.<br />\nThursday-Frat Games: Levy, Savage. Class Games: Zheutlin, Fertig.<br />\n<br />\n131r• ely's Pharmacy<br />\n<br />\nS. & N. KATZ<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n\"Sure, enjoy yourself,\"<br />\nsaid Jim. \"It's a ding<br />\ngood cigarette.\"<br />\n<br />\nNewcomers In Line-Up<br />\nIn the high hurdles Buc and Jarman stand out for the Black and<br />\nBlue, while Lelmeis, Dertzbaugh and<br />\nWingert will face the opposition in<br />\nthe low-hurdle event.<br />\nAside from last year's veterans,<br />\nHopkins possesses several newcomers in the sprints who promise to<br />\nbalance the Jay line-up. Lankford has<br />\nshown great ability in the 440, while<br />\nLitwin, Willen, Lyle and Charley Kelly have been teaming up the cinders<br />\nIn the shorter dashes.<br />\nThe latter<br />\nproved that he had great natural<br />\nspeed on the gridiron last fall, and is<br />\nattempting to apply it to track. This<br />\nnecessitates an adaption of stride<br />\nwhich is difficult to achieve, but<br />\nCoach Hambleton has been working<br />\nwith Kelly, and believes that he has<br />\ngood potentialities.<br />\n<br />\nI was working way late at the<br />\noffice one nightand ran out ofcigarettes,<br />\nWhen Jim the watchman came through<br />\nI tackled him for a smoke.<br />\n\"Sure,\" says Jim, and he handed<br />\noverapack ofChesterfields.\"Go ahead,<br />\nMr. Kent, take three or four.\"<br />\nJim said he'd smoked a lot ofcigarettes in his time, but he'd put Chesterfield up in front of any of'em when<br />\nit came to taste.<br />\n... \"and they ain't a bit strong<br />\neither,\" is the way Jim put it.<br />\nThat was the first Chesterfield I<br />\never smoked. And I'm right there with<br />\nhim, too, when he says it's a ding<br />\ngood cigarette.<br />\n<br />\nMile Relay Probable<br />\nWhile the regular meet will end at<br />\n3.00 p m., Hambleton intends to suggest a mile relay to be run between<br />\nthe halves of the lacrosse game. Although this event won't ennnt on the<br />\nscore, it should provide excellent<br />\ntraining for the Penn relays, in which<br />\nHopkins plans to compete.<br />\n'01935. 1.2ccarr & MYERS TOBACCO CO.<br />\nlarship,<br />\nt<br />\nZacts, Is C•<br />\nas Him(<br />\n<br />\nLefte loco%/c/tadahuP<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\natiint,5 iqopkins Nrius-itirttrr<br /><br />\nVol. XXXIX—No.41.<br /><br />\nBE PRESENT AT STRIKE<br />\nAt Levering Or In Latrobe<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, APRIL 12, 1935.<br /><br />\nPrice, 5 Cants<br /><br />\nSeven Faculty Members To Speak At Student<br />\nStrike Against War And Oath Bill, 11 a.m.Today<br />\nInterfrat Ball<br />\nWill Be Held<br />\nTomorrow,10-2<br /><br />\nGives His Stand<br /><br />\nAmong Participants In Strike<br /><br />\nVisits State Capital<br /><br />\nClasses To Be<br />\nSuspended For<br />\nDemonstration<br /><br />\nBlue Moon Orchestra Secured To Play At Maryland Country Club Hall<br /><br />\nDrs. Lovejoy, Hollander,<br />\nHolt, Berry, Mitchell And<br />\nBlumberg To Give Talks<br /><br />\nTickets Two Dollars<br /><br />\nLevering Is Scene<br /><br />\nMiss Ruth Koch Chosen As<br />\nSponsor; Miss Kathleen M.<br />\nVinup As Guest Of Honor<br /><br />\nNumerous Student Speakers<br />\nAlso Plan To Register Protest At Group Meeting<br /><br />\nMembers of the Interfraternity<br /><br />\nBy STANLEY E.'BLUMBERG<br />\nAnti-War Correspondent<br />\nApparently repulsed in their rather<br />\nly feuds to combine in presenting the<br />\nconservative attempt to decry and<br />\nannual Interfraternity Ball, which<br />\n—Courtesv S<br />\nPr,s<br />\ndefeat the Teachers' Oath Bill at An-Courtesv<br />\nn<br />\n,<br />\nS<br />\n?<br />\n,<br />\ners<br />\nWill be supplied by the Blue Moon<br />\nDR. W. B. KOUWENHOVEN<br />\nDR. JACOB HOLLANDER<br />\nPRESIDENT J. S. AMES<br />\nnapolis on Wednesday, members of<br />\nBand from 10 until 2 tomorrow night.<br />\nthe administration and the faculty<br />\n—Courtesy Sunpapers<br />\nMiss Ruth Koch, daughter of Mrs.<br />\nwill renew their efforts at 11 a. m.<br />\nDR. A. 0. LOVEJOY<br />\ntoday in collaboration with the stuB. L. Koch of Ruxton, has been chosdent protest against war. Seven repen as the sponsor, while Miss Kathresentatives of the University's proleen M. Vinup, daughter of Colonel<br />\nfessional corps are to address the unand Mrs. Frederick H. Vinup, will be<br />\ndergraduate student body from the<br />\nthe guest of honor.<br />\nsteps of Levering Hall as part of the<br />\ndemonstration which received official<br />\nTickets which are now on sale are<br />\nsanction<br />\nfrom President Ames and<br />\ntwo dollars stag or couple. These may<br />\nDean Berry several days ago.<br />\nbe purchased from John Murphy, the Loss Of $67,000 Will Not<br />\nDr. Arthur 0. Lovejoy, leader of<br />\nMean Abolition Of School<br />\nChairman of the committee, or else<br />\nthe group which converged upon GovDr.<br />\nLovejoy<br />\nLeads<br />\nAttack<br />\nat the dance that night.<br />\nOf Engineering, He Says<br />\nernor Nice, is listed as one of the<br />\nOf Intelligentsia; McNulty speakers.<br />\nOrchestra From New York<br />\nBrief addresses are also to<br />\nIn commenting on the annual afIf the so-called Teachers' Oath Bill<br />\nHeads Legion Forces<br />\nbe made by Drs. Jacob Hollander, E.<br />\nW. Berry, W. B. Kouwenhoven, Wilfair, Murphy said, \"I firmly believe now before Governor Nice becomes a<br />\nBy NEAL POTTER<br />\nliam S. Holt, Broadus Mitchell, and<br />\nthat those who come to the Interfra- law, President Ames, according to a<br />\nNEWS-LETTER Rep. at Annapolis<br />\nAlbert Blumberg. Neither the specific<br />\nternity Ball will have a very delight- statement which he made when speakScholarship and \"patriotism\" came topic nor the approach of these men<br />\nful time at the beautiful Maryland ing before the Alumni Association in<br />\nto groups Wednesday afternoon in a is known, since they were requested to<br />\nCountry Club. This is your chance to New York last Friday, stated that he<br />\nbattle of words over the Teachers' speak on that phase of the situation<br />\nhave an evening together with the would recommend to the Board of<br />\nOath Bill, during a hearing before which held the greatest interest for<br />\nrest of our fraternity brothers. TaGovernor Harry W. Nice, who has them. It is expected, however, that<br />\nTrustees of the Johns Hopkins Unible reservations may be secured from<br />\nthus far withheld his signature from they will tie up the twin protest measversity to forego all financial aid from<br />\nine or from any other member of the<br />\nthe bill.<br />\nures of war and the Oath Bill.<br />\nState of Maryland, inasmuch as<br />\nthe<br />\nAn attempt to be logical on the<br />\nCommittee.\"<br />\nClasses Out At 11<br />\nit would not be possible in his opinpart of the intelligentsia, led by Dr.<br />\nAll undergraduate classes will be<br />\nThe Blue Moon orchestra, under the<br />\nion for the University to operate unA. 0. Lovejoy of the Hopkins, was dismissed at 11 a. m., at which<br />\ndirection of Steve Tassey, will come<br />\ntime<br />\nder the conditions imposed by the<br />\nDEAN E. W. BERRY<br />\nmet by fire and thunder from the Student Council President McClean<br />\ndirectly from New York. The band<br />\n—Courtesy Sun papers.<br />\nis<br />\nbill.<br />\nforces supporting the bill, led by John to set the strike into motion. Student<br />\nDR. BROADUS MITCHELL<br />\nPlayed here three years ago at a<br />\nAt the present time the University<br />\nT. _<br />\ncommander of the Mary- speakers will include George Douglas,<br />\nPrinceton University dance at the<br />\nland division of the American Legion. representing the Y. M. C. A.; Neal<br />\n8elvedere Hotel. The Club Soiree en- receives from the state of Maryland<br />\na grant of $67,500, this sum being<br />\nThe forces of the teachers attacked Potter, the NEWS-LETTER; Harold<br />\ngaged their services last year.<br />\nused according to law towards the<br />\nthe bill on the basis that it was en- Sampson, American League Against<br />\nThe members of the Interfraternity<br />\nsupport in the form of scholarships<br />\ntirely unnecessary, was \"rank class War and Fascism; and Stanley<br />\nBall Committee besides Murphy inRapand other gifts for a number of stulegislation,\" that it would prove a paport, National Student<br />\nLeague.<br />\nelude Bill McFeeley and Richter<br />\ndents in the School of Engineering.<br />\ngreat detriment to schools who sought Other students are to address<br />\nsimilar<br />\nWiggall.<br />\nWhat effect the relinquishment of this<br />\nThe \"strike\" this morning promises to'<br />\nbe one of the most interesting and to get foreign lecturers, and that it gatherings at Goucher College and<br />\nsum would have upon the School of worthwhile affairs on this campus in many years. It has come far from<br />\nthe was so drawn that it did not mean Morgan College.<br />\nEngineering is not possible to say at disorderly combat among opposing forces within the University<br />\nMcClean was negotiating yesterday<br />\nwhich we anything.<br />\nthe present time, Dr. Ames said. Le- witnessed last year. A common interest and a common recognition<br />\nfor the installation of an amplifying<br />\nNice Attacks Argument<br />\nof the<br />\ngal opinion would have to be taken present dangers have thrown the different groups together in a<br />\nGovernor Nice attacked Dr. Love- system. Barring rain., the meeting<br />\nmore serious<br />\nbefore any definite statement could attempt to come to a solution of the most important problem of our<br />\nday, that joy's argument at the beginning by will be held in front of Levering, with<br />\nlint Banks To Choose Players In be made, he added.<br />\nof the threat of war.<br />\nasking him if he would support a the steps serving as a platform for<br />\n\"Road To Rome\", To Be Given<br />\nThe approach should be more intelligent and coherent this year than properly drawn bill providing penal(Continued on Page 3 Col. 3)<br />\nEarly In May<br />\nlast, and should bring some concrete results in the way of action on the more ties for any teacher who gave out<br />\nserious and immediate threats now apparent. In seeking the solution, stu- \"propaganda\" in their classes. After<br />\nPor the past two weeks the Barndents will be aided to a great degree by the co-operation of the faculty. repeated attempts to state his position<br />\nstormers have been casting for their<br />\nThough the older generation has not actually solved the problems, its experi- exactly, during which the Governor<br />\nAt the latest count of the Old Gold ence and knowledge must prove of great help to the younger generation in its pressed him for a \"yes or no\" answer<br />\nePring production, \"The Road to<br />\nContest,<br />\nit was revealed that Phi Al- attack on them. Much can be done by it to show the lines that the strug- to his question, Dr. Lovejoy stated<br />\n4°Tne.\" The cast will be chosen dellpha was leading the fraternities, while gle against war must take, in a campaign that may prove long, but which is that he thought he would support such<br />\nIlltelY by next week, and more intenThe forces of the American Legion<br />\nKoenig and Safier were running neck eminently worth the fighting. In action as well as in classroom discussions,<br />\nDr. Isaiah Bowman, president-elect<br />\n3iVe rehearsing will start.<br />\nand neck for individual honors. Be- the older scholars should prove of great use in coming to reasonable, scien- came back with the argument, put of the Johns Hopkins University, told<br />\nThe task of assigning the various hind the winning fraternity was Kap- tific, and useful conclusions.<br />\nforth by Delegate White, introducer a meeting of Phi Beta Kappa alumni,<br />\nThe real test this morning will be with the audience as well as the of the bill in the Assembly, that they<br />\nParts fell on Bill Banks '29, co-coach pa Alpha and Delta Upsilon. Levinheld at the Savoy-Plaza in New York<br />\nt3f the club, since \"Howie\" Caplan son is in third plae in the unaffiliated speakers. Will all these groups, having, many of them, diametrically op- could not see that it was any disgrace Wednesday night, April 3, that modposed ideas, listen to those of the different sides and attempt to come to or hardship to the teachers to take an<br />\nclass.<br />\nern scholarship, broadly conceived<br />\nthe other director, will not be<br />\na real solution, recognizing that everyone can not be right as things stand oath, since they were \"paid by the and applied,<br />\nmust set itself the task<br />\nGoldberg,<br />\nRay<br />\nwho<br />\nin<br />\nis<br />\ncharge<br />\nof<br />\nable to help until next week.<br />\nat present? Will they recognize that they may be wrong, that the other government,\" and that a great many to \"fabricate new<br />\ndesigns for living.\"<br />\nthe competition, announces that the<br />\nThe officers and coaches of the club<br />\nfellow may have a more nearly correct analysis? Will they realize that no other public servants had to take<br />\nTo create such designs, Dr. Bowman<br />\ncontest will end midnight, April 21.<br />\nsolution of the problem can be reached as long as each side sticks to its oaths before assuming their tasks.<br />\nbelieve they have the making of an<br />\nsaid, modern scholarship must aim to<br />\nIt offers three prizes for the fraekeellent play in \"The Road to Rome\", ternity placing the most Old Gold own ideas tenaciously, and merely tries to spread them? Will they, most Declaring that the only reason for develop not only leaders, but a \"willof all, realize that the problem is one of the vastest importance to them, which the teachers could reasonably ingness to be led\";<br />\nnot alone to dis2<br />\n\\4 1len will be staged May 11 at the wrappers in the two ballot-boxes at however remote it may<br />\nseem at the present moment, and that it is worth a oppose the bill was that they wished cover truth,<br />\nbut also to produce a<br />\nthe postoffice and soda fountain. For<br />\n\"klIT'Yland Casualty Auditorium.<br />\ngreat deal of their time and effort to find the truth in the matter?<br />\nto teach \"radical\" propaganda, the state of mind that would be ready to<br />\nThe production staff has started the leading group a ping-pong table<br />\nSimply stating that war is a far-off thing will do no good in preventing Legion attacked Dr. Lovejoy for accept the truth<br />\nand to put it into<br />\nwith full equipment will be given.<br />\nWork on the set, which is a rather Second and third awards are a bridge it. The forces of war are already at work, and have been for a long time. \"hedging.\" The rest of the hearing, practice.<br />\nelaborate undertaking, under the dl- table with four chairs and a bridge The most eminent foreign commentators, including Frank Simonds, who lasting until well into the evening,<br />\nHe continued by saying that four<br />\nlectured here this week, agree that the war clouds are ready to break over consisted of declarations of patriot- propositions are<br />\nfundamental to any<br />\nlamp, respectively.<br />\nof Frank Hirschman.<br />\nEurope, and that the situation in the United States may easily lead to a ism.<br />\ndesigns<br />\nin<br />\nscholarship.<br />\nThe first, from<br />\nFor the individual winner there is<br />\ner'rlie business staff is planning sevrepetition of what happened in 1917.<br />\nan old Maya glyph, is \"always in the<br />\nti el novel publicity stunts to adver- but one prize—a cash award of ten<br />\nTaking a defeatist attitude, and declaring that a few people can do<br />\nWednesday Dues Deadline centre shall come a new word.\" The<br />\ne the play. Allen Delevett is bus- dollars.<br />\nnothing about the situation is a foolish approach, also. Those who have the<br />\nsecond is \"time does not walk backManager and William McFeely<br />\ninformation and the scientific approach can and must take the lead in forward\"; the third, \"to think fruitfully<br />\nThose seniors who have not paid<br />\nCharge of the advertising. Zenas Dohme Lecture Postponed<br />\nwarding a proper solution throughout this country and the world.<br />\nrequires us to see the relations of<br />\nclass<br />\ntheir<br />\ndues<br />\nWednesday<br />\nby<br />\nwill<br />\n:<br />\ner rs Is president of the BarnstormOf course, we realize that there cannot be expected a real unanimity<br />\nparts,\" and the fourth, \"progress by<br />\nnot have their pictures included<br />\nWhile Harold Kropman is secreDue to the fact that the next on all points, even among scholars. Inevitably, differences arise, and offer<br />\nabstractions, or generalization, for<br />\nin the 1935 Hullabaloo, according<br />\nrY-treasurer.<br />\nDohme lecture was scheduled to be problems which require further research. But this research should be done<br />\nsociety as a whole is hard and slow.\"<br />\nto John B. DeHoff, editor-in-chief<br />\n,AITIong those who are out for roles given on Good Friday, Dr. Kharasch's in an open-minded way. People frequently laugh at each other for pretendDr. Bowman added that \"the conof the publication.<br />\nst- this play are Gerald Branower, talk for that day will be indefinitely ing to \"solve all the problems of the world.\" Yet they act and think to<br />\nclusions that emerge from a discusHe added that every student is<br />\n\"1<br />\nHartman, Harold Kropman, postponed, announces the chemistry themselves as if they actually had schved all the problems, when it comes to<br />\nassured of a book, and that the sion of the four propositions run someMisa Swan, Kitty Forsyth, Bunny department. A sprained back origi- actua practice. Why not face things realistically, and recognize<br />\nthat some<br />\nwhat as follows: That an acceptabook will be of a quality equal to<br />\n.4,,,,<br />\nWilliam L. Snyder, Stanley nally prevented his giving the lecture things are not yet settled,—that we are still seeking a solution?<br />\nble modern design tioaip... rship<br />\nthe 1934 edition.<br />\nPrager, and Merrill Harmel.<br />\nas originally scheduled on March 15.<br />\n(Continued on Page 2, Col. 1)<br />\n(Continued on r-Board will drop their habitual friend-<br /><br />\nDr. Ames To Drop<br />\nState Financial Aid<br />\nIf Nice Signs Bill<br /><br />\nTeachers)'Patriots'<br />\nHave Verbal Battle<br />\nOver Oath Measure<br /><br />\nEDITORIAL<br />\nPotentialities Of The Day<br /><br />\n'Stormers To Pick<br />\nCast Next Week<br /><br />\nPhi Alpha Leads<br />\nOld Gold Contest<br /><br />\nBowman Describes<br />\nProblems, Aims Of<br />\nModern Scholarship<br /><br />\nHOME WOOD,BALTIMORE, MD., FRIDAY, APRIL 12, 1935.<br /><br />\ntcb e Ilevosoollet ter Q uad Quips<br />\nrOUNDED 1E27<br />\nSubscription per year_-42.00<br />\n$2.50<br />\nBy Mail<br /><br />\nBy JACK STEIN<br /><br />\nThe Snobs Of Delta Alpha<br />\nA College Tragedy—Being Necessarily Anonymous<br />\nCAST OF CHARACTERS<br />\nFRATER SUPERIOR, leader of the house,<br />\ndistinguished like the great apes<br />\nby his sheer bulk, and despite his<br />\nsize, gravely preoccupied with the<br />\nsmallest of matters.<br />\nFRATER SMYTHE, a formalist, the only<br />\nmember who has read the frat's<br />\nconstitution.<br />\nFRATER CABOTT, a snob.<br />\nSUNDRY FRATERS, somewhat cowed by<br />\nthe above, taken in probably because of their monetary contribu-<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council, Items= Hall, Postoffice, Johns Hopkins<br />\nUniversity.<br /><br />\nLouis, first.<br />\nSergeant: I'm afraid I can't wait.<br />\nI've got to be off hunting Communists. My time is valuable.<br />\nSmythe: Well, Weed is a Commu-<br /><br />\nSergeant: Ah, young blackguard,<br />\ndid you throw that flowerpot on my<br />\nhead?<br />\nCabott: Here, here, my good man,<br /><br />\nBut let me introduce myself. I am<br />\nSergeant James K. Cabott—and I,<br />\nBrother Cabott, come from a family<br />\nof North Irish potato farmers.<br />\nCabott (somewhat upset): I suppose you are related to the Cabotts<br />\nof Schenectady?<br />\nSergeant: Why yes, of course.<br />\nCabott: Ah, sergeant, let me congratulate you. Thank heavens I have<br />\nno relatives outside of Boston.<br /><br />\nnist. So you might as well take Win<br />\nalong with you.<br />\nSergeant: A Communist? Why?<br />\nSmythe: Sure, he's Russian, isn't<br /><br />\nhe?<br />\nnot on yours..<br />\nSergeant: Well, if that ain't ignorSuperior: Frater Cabott, what have<br />\nYou know the trouble with yoU<br />\nance.<br />\nyou been doing up there?<br />\nboys is that you ain't educated. The<br />\nCabott: Reading—sure, reading the<br />\nyou go to haven't taught you<br />\ncolleges<br />\nconstitution.<br />\nPublished semi-weekly from Octothat there are better things than<br />\nSmythe: I beg pardon, Frater Suber to June, except during examinayour cocktails and your superstitious<br />\ntion and college noliday periods by<br />\nperior. But may I suggest that CabCouncils. Why look at that<br />\nGrand<br />\nunciergraduate.s of the Johns Hopkins<br />\n!<br />\nheavens<br />\nThank<br />\nAll:<br />\nott's been gambling on the second<br />\nHe's posiUniversity.<br />\nCabott: You see, sergeant, all men guy Smythe over there.<br />\nfloor again, so he won't have to pay<br />\na thing<br />\nread<br />\nain't<br />\nHe<br />\ne.<br />\nilliterat<br />\ntively<br />\n—<br />\ntions.<br />\nour gambling tax. You know the rule feel the urge to destroy or murder<br />\nEDITORIAL DEPARTMENT<br />\noutside that stubet,<br />\nI'll<br />\nlife,<br />\nhis<br />\nIn<br />\nSuthe<br />\nof<br />\nf<br />\nto<br />\nrebeloved<br />\ntries<br />\n-in-Chie<br />\nE,<br />\nsociety<br />\nwhich<br />\nurge<br />\nan<br />\nEditor<br />\nHORTENS<br />\nthe<br />\non<br />\nCOED<br />\nJESRF. N BORDEN<br />\nCabott: Sir, I never gamble<br />\nsyspess with often harmful results. So pid constitution. Sure, the whole<br />\nperior.<br />\nNEAL POTTER, IRVING LEBEB\".FELD,<br />\nsecond floor.<br />\nfailed<br />\nhas<br />\nn<br />\neducatio<br />\ncollege<br />\nof<br />\ntem<br />\nSERPOLICE<br />\nthe<br />\na<br />\ntype<br />\nand<br />\ny<br />\nas<br />\nWEED<br />\nsnobber<br />\nManaging Editors<br />\nPLEDGE<br />\nSergeant: Bounders—the lot of you. we have adopted<br />\ny. I,. who am self-educated,<br />\nSports Editor<br />\nGEANT.<br />\nKENNETH ZiERLER.<br />\nDon't switch the subject. Now, WHO of refined murder. We get all its miserabl<br />\nbroader person than—<br />\nmuch<br />\na<br />\nAlpha,<br />\nam<br />\nDelta<br />\nof<br />\nEditor<br />\nHome<br />\nany<br />\nteatiore<br />\nSCENE: The<br />\nhealthful joy and relief without<br />\nti.EMLrat.<br />\nTHREW THAT FLOWERPOT?<br />\nsergeant, at least yoll<br />\nin<br />\nBut,<br />\ny,<br />\nContrib. Editor<br />\nd.<br />\nfirst floor.<br />\nCabott:<br />\nSnobber<br />\nugly<br />\nits<br />\nbloodshe<br />\nof<br />\n,<br />\nthat<br />\nSuperior: I'm afraid, sergeant<br />\nof \"Varieties\"<br />\nsy<br />\n—Courte<br />\nTELN,<br />\nriAltuLu vi. hRuelvIAN J AC&amp;<br />\nwe'll have to hold a meeting to de- the form of slave-snobbing, is what will help us get rid of Smythe.<br />\nColumnists<br />\nGull-berg: \"Look, Able, there's<br />\nThe curtain opens. Cabott is up- cide.<br />\nA Frater (rushing in): He won't<br />\nmade our Southern aristocrats beReporters<br />\nHitler down there.\"<br />\nindiof<br />\ned<br />\nstairs. The Brothers and Hortense<br />\nto, Brother Cabott. Weed hil$<br />\nbest-balanc<br />\nhave<br />\nthe<br />\n1860<br />\nfore<br />\nSmythe: But, superior, you can't<br />\nJonn C. Bra.snears, btramey M. leinKel,<br />\nstein: \"Well, what are we are awaiting the return of their have a policeman attend a meeting viduals. In India, there is a whole just run off with Hortense—and they<br />\nGullBenjamin sliternick, JeweLt<br />\npledge. They've been holding their<br />\nsnubs are getting married to night.<br />\nvv'mass waiting for?\"<br />\njiteoLioii,<br />\nof Delta Alpha! The Grand Council herarchy of snobs; one group<br />\n* *<br />\nmost provocative discussion in weeks<br />\nultithe<br />\nSuperior (shocked): Hortense gone!<br />\nuntil<br />\ndown<br />\non<br />\nand<br />\nanother<br />\ntion—<br />\nKempton, Sigmund Saner, Marvin<br />\nwon't hear of it! The constitu<br />\nstyle<br />\n'v iiiiaiii<br />\na<br />\nnew<br />\na<br />\nwith<br />\nof<br />\ntalking<br />\ncolumn<br />\ndly<br />\nthis<br />\n, rierbliner (..;1.0b6,<br />\n—excite<br />\nUL,t1C1.<br />\noff<br />\nI can't believe it- I can't beats<br />\nstart<br />\na<br />\nWeed!<br />\nfew<br />\nscapego<br />\non<br />\nWe'll<br />\nSuperior: Say, Smythe, this is too mate snub settles<br />\nsnider, ilowaru rteizensiein, Jonas<br />\nfew days ago, cigarette lighter. Then—<br />\na<br />\nacross<br />\nbody would pull any thing<br />\nany<br />\nran<br />\nlieve<br />\nI<br />\nables.<br />\nfact<br />\nUntouch<br />\nunhappy<br />\nLester<br />\n—the<br />\nJane,<br />\ncollen, Leonard<br />\nmuch. Are you the constitution, or<br />\nHortense: Look, dear, it's started<br />\nht deceitful. There, brodownrig<br />\nCaplan, Bernard Pines., Julian. Au- and which appealed to my very inso<br />\n,<br />\nor<br />\nSuperior<br />\nFrater<br />\nOh<br />\nt:<br />\nit?<br />\nis<br />\nSergean<br />\nwhere the devil<br />\nler, William Diamond, Daniel Ler- definite sense of humor.<br />\nto rain. You really shouldn't have<br />\n.<br />\ntherhood<br />\nSmythe: I beg pardon, sir, but it's whatever foolishness you are, do I<br />\nner, David Caplan.<br />\nout there in his unThe ungrateful wretch!<br />\ntsUSINESS DEPARTMENT<br />\nAn old college professor recently sent poor Weed<br />\nCabott:<br />\nin Greek on the flag over take this as an official statement?<br />\nwritten<br />\n_Business Manager died, and left an inheritance of $100,- derwear. He'll catch cold.<br />\nDAVID LEVY<br />\nthat our most scruptithink<br />\nto<br />\nCabott<br />\nGod,<br />\nno.<br />\ny,<br />\n:<br />\nOfficiall<br />\nSuperior<br />\nthere.<br />\nSuperior: Bah! I went out that<br />\nAdvertising Manager.....JULIAN COHEN 000. When this face became known,<br />\nbe but in vain!<br />\ny<br />\nshould<br />\nlous<br />\nI<br />\nsnobber<br />\nmust<br />\n.<br />\nSergeant: Greek be damned! Is it talks, but I am his superior<br />\nROBERT WATKINS it immediately debunked all previous way—and I'd do it again just for the<br />\nOffice lkianager<br />\nEnd)<br />\n(The<br />\nSt.<br />\nin<br />\nCouncil<br />\nGrand<br />\nthe<br />\ncountry<br />\nthis<br />\nconsult<br />\nof<br />\nlaw<br />\nor is it not the<br />\nyou.<br />\nROBERT LEVI<br />\nCircul,ation Manager<br />\ntheories concerning the \"poor old pro- fresh air it gives<br />\nmore important than your idiotic litn,<br />\nbarbaria<br />\na<br />\n,<br />\nYou're<br />\ne:<br />\nManager<br />\nHortens<br />\nFiling<br />\nhowand<br />\nCopy<br />\nfessor.\" Within a short time,<br />\nfraternity?<br />\ntle<br />\nfootball<br />\nPRAGER<br />\nThat<br />\nSTANLEY<br />\nThat's it.<br />\never, his \"success\" story was uncov- Henry.<br />\nCabott: Brothers, brothers. Let us<br />\ncomyou<br />\nmade<br />\nhas<br />\nyours<br />\nof<br />\nered. He had saved wisely during his training<br />\nCouncil and ask<br />\nFriday, April 12, 1935.<br />\nfor the niceties of so- write to the Grand<br />\ntraining and teaching period; he made pletely unfit<br />\nthe impertinence of<br />\nforgive<br />\nthey<br />\nthat<br />\nine!<br />\nar—imag<br />\nunderwe<br />\nhis<br />\nsmart investments, and watched them ciety. In<br />\nthis poor police force. For your inPotentialities Of The Day grow, and in addition a rich uncle Superior: Bah!<br />\non, sergeant, let me say that<br />\nformati<br />\nyou're<br />\nthat,<br />\nfor<br />\nJust<br />\nHortense:<br />\ndied and left him $99,000.<br />\n(Continued from Page 1, Col. 4)<br />\nbeen carried to the Sagoing to let me take charge of him our flag has<br />\nThis morning's strike, with faculty<br />\nThis gentleman was not a profesthe shores of the Into<br />\nDesert,<br />\nhara<br />\nwhen he gets back.<br />\nand students together on the joint sor at Hopkins, for no professor here<br />\nto the South Pole. And<br />\nOcean,<br />\ndian<br />\nconstithe<br />\n,<br />\nsuperior<br />\nBut,<br />\nSmythe:<br />\nproblems of war and free speech— could manage to save $1,000.<br />\nyou rudely with the sweep of your<br />\ntution says no women—<br />\n*<br />\n*<br />\n*<br />\nfor this is what the Teachers' Oath<br />\nwould ravish this splendid traclub<br />\nlove<br />\nI<br />\nSmythe,<br />\nEnough,<br />\n:<br />\nSuperior<br />\nBill inevitably strikes at—has the<br />\nThis 16-word masterpiece of literAnd love rates with, if not dition.<br />\nher.<br />\npotentialities of a move of real value. ature won the \"Phewlitzer\" prize:<br />\nSergeant: Stand back there, you.<br />\nabove, the constitution.<br />\na<br />\nas<br />\nfaculty<br />\nAlgy saw a bear;<br />\nWill the students and<br />\nas of a We'll teach you to trifle. College<br />\noutside<br />\nheard<br />\nis<br />\ncrash<br />\n(A<br />\nwhole be present and face things with<br />\nThe bear saw Algy;<br />\ndepression<br />\nflowerpot falling to earth from a great boys—and I thought the<br />\nThe bear was bulgy;<br />\na real view to solution? Tne anhad killed your conceit. I'm calling<br />\nheight.)<br />\nThe bulge was Algy.<br />\nswer to this question is of greatest<br />\nthrow the<br />\nHortense: Hear that? Starting the riot squad, see, to<br />\n*<br />\n*<br />\n*<br />\nimportance to the University as well<br />\njail!<br />\nin<br />\nbunch<br />\ncomHe's<br />\nwhole<br />\nSssh.<br />\n.<br />\nsee<br />\nto thunder,<br />\nas to the movement for peace.<br />\nHe's a fraternity man.<br />\nCabott: Very well. Insist on bruing.<br />\nTHE EDITORS.<br />\nHow do you know?<br />\nin<br />\nd<br />\nand we can do nothing. But<br />\ntality<br />\ndrenche<br />\nenters,<br />\n(Pledge Weed<br />\nHe answered to four names in class<br />\nremember, sergeant, it was just such<br />\nhis underwear.)<br />\nthis morning.—Banger.<br />\nThe Hopkins Leads<br />\nWeed: Sacred cow, what embar- conduct as yours that the Arabs disCame across this slip in the Collet! I feel like one of the nudes played when they burned the secrets<br />\nrassmen<br />\nh<br />\nlight For free Speec<br />\ngiate Digest, which as you know is<br />\nof the Orient at Alexandria . .<br />\nLouvre.<br />\nthe<br />\nin<br />\nTuesday in your mail<br />\nWhether they like it or not, the placed every<br />\nthe<br />\nthat<br />\nis<br />\ne!<br />\nman,<br />\nPhilistin<br />\nYoung<br />\ne:<br />\nHortens<br />\nhave found that the Collemembers of the Johns Hopkins Uni- boxes. I<br />\n: Quiet, Cabott. We must<br />\nprospective suyour<br />\nSuperior<br />\naddress<br />\nto<br />\nway<br />\nDigest is a boon to Hopkins men,<br />\nnothing more to say.<br />\nThere's<br />\nversity have become the first ranks giate<br />\nsubmit.<br />\nperior?<br />\nthat it offers embryo artists a<br />\nHorty. I for- Now first, sergeant tell us what you<br />\nin the struggle for free speech in in<br />\nsorry,<br />\nI'm<br />\nWeed:<br />\nchance to elaborate on the photos of<br />\nThe law of diminishing returns holds no terror for<br />\nMayla.nd. The attacks of the Amerwere doing in our neighborhood.<br />\ngot.<br />\nwomen.<br />\nand<br />\nmen<br />\ne<br />\nhandsom<br />\ne<br />\notherwis<br />\nArrow Sanforized-Shrunk Shorts. They cannot<br />\nican Legion at Annapolis last WedSergeant: I was chasing some darn<br />\nHortense: Quiet, And you forgot<br />\nas it may, here is the fauxthat<br />\nBe<br />\nthat<br />\nof<br />\nwas<br />\nno matter how often the garment is washed.<br />\nI<br />\ndoubt<br />\nty.<br />\nshrink<br />\nno<br />\nwhen<br />\nar<br />\nfool in his underwe<br />\nnesday could leave<br />\nthe customary sign of your inferiori<br />\npas:<br />\nthe<br />\nhorror<br />\nWith<br />\nthe only process of its kind, guarmind.<br />\nzing,<br />\n's<br />\nSanfori<br />\nanybody<br />\nBow.<br />\nstruck.<br />\n.<br />\n.<br />\nin<br />\n.<br />\nOne loose-leaf binder for your<br />\n: That, I take it, was Weed.<br />\n: That'll do. Now, where's<br />\nent fit forever.<br />\n\"patriotic soldiers\" and \"mothers\"<br />\nSuperior<br />\nSuperior<br />\nantees<br />\nperman<br />\ncopies of \"Collegiate Digest\", valblanket you were supposed<br />\nt: One of your brothers,<br />\nhorse<br />\nthe<br />\nSergean<br />\nspoke in attack on anyone who could<br />\nued at one dollar, plus one unuDon't resign yourself to underwear that continuThe first of your twelve eh? Well, I thought so. I'll have to<br />\nto bring?<br />\neven listen to a person with a word<br />\ncolored copy of \"A Cartosual,<br />\nally<br />\ncreeps up on you, cuts you in two, and genany<br />\nfor<br />\nyou<br />\nthat<br />\ny<br />\nprove<br />\nto<br />\nHerculean labors—<br />\nabout socialism or sympath<br />\narrest him, too.<br />\ngraph or Collegland,\" valued at<br />\nerally<br />\nruins your disposition. Arrow Shorts give<br />\nhis<br />\ntn.<br />\nin<br />\nn<br />\nExcellen<br />\nattentio<br />\nour<br />\nAmerica<br />\nmerit<br />\nGoodthe<br />\nbut<br />\nCabott:<br />\nother people<br />\ntwenty-five cents—both for only<br />\nsnuck<br />\nfor<br />\nu<br />\nsir—I<br />\nsee,<br />\nyou<br />\nWell,<br />\nwhere you really need it—they are<br />\nyou—yo<br />\nyou<br />\ncomfort<br />\nand<br />\nWeed:<br />\nbeYes,<br />\nt:<br />\nvaster<br />\nSergean<br />\nthe<br />\nis<br />\nhorror<br />\nTheir<br />\nmouth.<br />\na dollar and a quarter. Sounds<br />\nthe<br />\nboy<br />\nover<br />\nthe<br />\nhit<br />\nstables,<br />\nme.<br />\nthe<br />\nat<br />\nin<br />\nfull cut with ample leg room—that bedeviling<br />\nthrowing the pot<br />\ncause they know virtually nothing<br />\ngoods, doesn't it?<br />\nleast fifty darkies<br />\nat<br />\nthis<br />\nthen<br />\nGet<br />\nand<br />\nhead,<br />\nofficer.<br />\nListen,<br />\nCabott:<br />\ncenter seam has been replaced with a saddle seat<br />\nTheirs<br />\nabout that of which they speak.<br />\nThat's like giving away snow in the<br />\nrushing at me with open razors. straight. You can do what you want<br />\ncame<br />\ne<br />\n—the garment is tailored throughout with your<br />\n\"fugitiv<br />\na<br />\nis what Milton termed<br />\nwinter time.<br />\nSuperior: Don't lie. Where's the with Weed. But I didn't throw the<br />\n*<br />\nface<br />\n*<br />\nto<br />\n*<br />\nafraid<br />\nin mind. See your Arrow dealer today.<br />\ncomfort<br />\nvirtue,\"<br />\ned<br />\ncloister<br />\nand<br />\nhorse blanket?<br />\npot at you.<br />\nthe truth; or at least they would be- The Wedding Guest, he beat his breast<br />\nWeed: I swear it sir. I had the<br />\nSergeant: No? Then at someone<br />\nArrow Undershirts<br />\nArrow Shorts<br />\nlieve all others' to be so.<br />\nThe bells began to toll;<br />\nI had no pockets in else, I suppose.<br />\nlook,<br />\nBut<br />\nthing.<br />\nIt becomes the task of the Hopkins But still the stud refused to go<br />\n50c up<br />\n65c up<br />\nmy underwear to carry it in and I<br />\nCabott: Yes.<br />\nthen, to rene,w its faith in truth, and<br />\nInto the button hole.<br />\nbesides, I didn't<br />\nand,<br />\nit<br />\nhide<br />\ncouldn't<br />\nWho?<br />\nt:<br />\nSergean<br />\n—Tiger.<br />\nto seek to establish it in the minds<br />\nthink there were any horses up here<br />\nCabott: Well, if it interests you, I<br />\n*<br />\n*<br />\nof the many who are at present so<br />\nanyway.<br />\nit at Weed—the little snip.<br />\nthrew<br />\nof<br />\nfurther,<br />\nfew<br />\na<br />\ngo<br />\nmust<br />\nIndiana<br />\nof<br />\nIt<br />\nty<br />\nrmed.<br />\nmisinfo<br />\nAt the Universi<br />\nSuperior: Enough! You have failed!<br />\nt: You mean your own<br />\nSergean<br />\ncourse, and transform its beliefs into weeks ago in a math class, the proYou do not love your fraternity!<br />\nDon't bluff, son. It'll go all<br />\n?<br />\nbrother<br />\nthe<br />\nng<br />\nan<br />\norganizi<br />\nof<br />\nby<br />\nname<br />\naction, specifically,<br />\nfessor came across the<br />\ne: But dearest, he looks so the worse with you.<br />\nHortens<br />\nSANFORIZED SHRUNK<br />\nvotes of the Legislature against any absent student. \"Miss Usel, once,\"<br />\nwretched. . . . Weed, come along with<br />\ntraitor!<br />\na<br />\nCabott<br />\nWhat,<br />\n:<br />\nSuperior<br />\nwill<br />\nfight<br />\nrestriction of speech. The<br />\nhe said, \"Miss Usel, twice?\" \"Miss me and we'll fix you a whiskey soda.<br />\nCLIYETT, PEABODY &amp;CO., INC., TROY, N. Y.<br />\nSmythe: It'll go hard, Cabott. The<br />\nbe hard, no doubt, because, in the first Usel three times.\" \"Sold,\" answered<br />\nBut<br />\ndarling.<br />\nright,<br />\nAll<br />\nd:<br />\nSuperio<br />\nconstitution knows how to treat with<br />\nplace, if the Teacher's Oath Bill be- a sleepy freshman in the back row.<br />\npromise me, you won't get drunk double-dealers.<br />\nGovby<br />\nessig\"\"7„.<br />\njudging<br />\n(which,<br />\ncomes law<br />\n01111111111MILIME1111.1111111111111111111111.111.11111,<br />\nagain. And don't give him too much.<br />\nCabott: Well, all of you listen. I<br />\nernor Nice's attitude Wednesday, it<br />\nHortense: Sure, you old sot. (They was looking over Weed's ancestors in<br />\nwill), the University will have to give<br />\nexit Outside there is a terrible belthe society lists in our private files.<br />\nup State aid to the extent of $67,500;<br />\nlowing. The door opens. An enraged And I found after careful searching—<br />\nand, in the second place, because We cigarette the following:<br />\nbull enters.)<br />\nSuperior: You found he's not in the<br />\nit will have to fight the American LeDR. KELSO MORRILL, head laPolice Sergeant: Of all the incon- Blue Book?<br />\ngion, one of the strongest and most crosse coach and instructor in math- siderate places I ever seen—who the<br />\nCabott: Worse than that.<br />\nvicious lobbies in the country, which ematics, \"whose stickmen solved the devil threw that consarned flowerpot<br />\nSuperior: He's not on the Mayflowis set on establishing its prestige Dartmouth equation, 19 to 4,\" last on my head?<br />\ner list—professed or genuine?<br />\n(probably smelling more bonus, etc., Saturday.<br />\nSmythe: I fear you have the wrong<br />\nCabott: Far worse. I don't even like<br />\ncountry<br />\nthe<br />\nout<br />\nelected<br />\nthrough<br />\nin the offing)<br />\nJULIUS GELBER, recently<br />\nplace, sir. Our constitution forbids<br />\nby getting one of these bills passed captain of the wrestling team, for such activity. And I'm here to say to mention it.<br />\nAll: What is it?<br />\nin every state, according to its work rendered.<br />\nthat the constitution can NEVER be<br />\nCabott: I have found without a<br />\nbhsiformer<br />\nRG,<br />\nGOLDBE<br />\navowed intentions.<br />\nRAY B.<br />\nchanged!<br />\nof a doubt that Weed is dewith<br />\nshadow<br />\nThe Hopkins is thus faced<br />\nness manager of the NEWS-LETTER,<br />\nSergeant: Never mind that. Which<br />\nfrom a family of South Rusfor<br />\nfight<br />\nscended<br />\nide<br />\ndues.<br />\nnation-w<br />\na<br />\nSenior<br />\non<br />\njoining in<br />\nfor collecting the most<br />\nof you done it? Fast now. Speak<br />\nsian plumbers.<br />\nfree speech, for any amount of minLORRAINE WAGNER, a member up.<br />\n. All (in unison): Oh good heavens!<br />\nimizing the present measures will not of the Literature and Language group,<br />\nSuperior: I resent your promiscuity,<br />\nremove the fact that the Legion and for his successful completion of a sergeant. I alone am responsible here. And he hid it from us all this time!<br />\nAnd I always thought Weed was as<br />\nits allies are set upon preventing the 121-page thesis.<br />\nSergeant: My what? Listen you;<br />\nof<br />\ns as Grass or Alfalfa!<br />\nmeans<br />\nharmles<br />\nlawful<br />\nby<br />\nation<br />\ndissemin<br />\nmayor's nervous system. InThe question is whether we I am the<br />\nt: Why you damned snobs!<br />\nSergean<br />\nanything which they consider \"radi- at stake.<br />\nthe<br />\ninsulted<br />\nhave<br />\npeople whose ideas sult me, and you<br />\nlet<br />\nto<br />\ngoing<br />\nare<br />\nwho<br />\nmay be all right. And sureone<br />\nboy<br />\nNo<br />\nThat<br />\notic.\"<br />\ncal\" or \"unpatri<br />\nRemember<br />\nadministration.<br />\nwell as their hats are out of style entire<br />\nly a plumber is a credit to any nalistened to the arguments at the as<br />\nthat—<br />\nreverse<br />\nour thoughts to us.<br />\ntion—especially, gentlemen, to Russia.<br />\nThis new shoe comes in a fine, scratch-proof<br />\nhearing on the bill could mistake this dictate<br />\nSuperior: Well, no one threw anycomfortable<br />\nresponsi<br />\nreal<br />\na<br />\nhas<br />\nHopkins<br />\nThe<br />\n.<br />\nully<br />\nWonderf<br />\nsergeant<br />\nwhite.<br />\nin<br />\nabsurd,<br />\nbe<br />\nnot<br />\nor<br />\nif<br />\nDon't<br />\nfact<br />\ngrey<br />\nCabott:<br />\nin<br />\n,<br />\nbrown,<br />\nin<br />\nFascism<br />\ncalf<br />\npurpose.<br />\nyou here, unless upstairs—<br />\noutdoor<br />\nresting upon it. The problem thing at<br />\nWe merely<br />\n. . . and easy to clean. Smart and efficient for<br />\nname, is reaching out for a grip on bility<br />\nthat's it. Upstairs. We don't say he's bad.<br />\nSure,<br />\nt:<br />\nSergean<br />\na<br />\nwith<br />\nbility<br />\nresponsi<br />\nthat<br />\nmeet<br />\nto<br />\nis<br />\nacyet<br />\nas<br />\nhasn't<br />\nsociety<br />\nsay that<br />\nor campus wear.<br />\nthe United States.<br />\nhim.<br />\nthat will prove genuinely I seen<br />\nFreedom of thought and expres- response<br />\nSwell cepted him. If we take him in, it<br />\nCabott.<br />\nits<br />\nbet<br />\nI'll<br />\n:<br />\nSuperior<br />\n\"Lou\" Reuling<br />\nfight<br />\neffective, and to carry on the<br />\ndown the barrier that digsion and the ability of the people of<br />\ncalls upstairs.) Oh Cabott . . . will break<br />\n(He<br />\nAs<br />\nlate.<br />\ntoo<br />\nCallahan—Representing<br />\nis<br />\nit<br />\n\"Tom\"<br />\nbefore<br />\nwith energy<br />\nexalts us. I threw a<br />\nthe country to change their governCabott. Come on down There's some nifies us—that<br />\nfor<br />\nkeep<br />\nhonestly<br />\ncan<br />\nthey<br />\nas<br />\nlong<br />\nown<br />\npot at him as a gesture for my<br />\nment by peaceful means, things on<br />\n.to see you. (Enter Cabott)<br />\nmotto \"Veritas vos liberabit,\" one<br />\nwhich this country has long prided their<br />\nsick. social security. If I missed, I apolohe's<br />\nbet<br />\nI'll<br />\nha.<br />\nHa,<br />\nCabott:<br />\nStreet<br />\nmen will fight for freedom<br />\nitself uhe threatened by groups which Hopkins<br />\ndisheveled.) gize to all of you.<br />\n8 East Baltimore<br />\nof Honor Since 1873<br />\nplace of every (See the sergeant quite<br />\nSoles<br />\nthe<br />\nis<br />\nIt<br />\n.<br />\nthought<br />\nof<br />\nvery<br />\nn.\"<br />\nall<br />\nthat's<br />\nAmerica<br />\neeallree Straeg. \"truly<br />\nSergeant: Well, son,<br />\nme,<br />\nin the Oh, oh, Superior, you don't want<br />\nreirst it was Leiamodern scholarship, scholar and student to join<br />\nwell. And your name is Cabott, eh?<br />\nsure.<br />\nI'm<br />\nN. P.<br />\nwas Himes to Hoilination of facts, is common defense.<br /><br />\nEntered as second-class matter December 3, 100a, at the Postotiace in<br />\nBaltimore, Md., under the Act of Congress, November 3, 187a.<br /><br />\nArrow Shorts<br />\nwon't grow shorter<br /><br />\n1Men Of The Week<br /><br />\nWe Recommend<br />\nTHE<br /><br />\n\"FRIAR<br /><br />\nAn<br />\nOutstanding<br />\nNew Shoe<br />\nBy Hess<br />\n$5.95<br /><br />\nS.. II-I IlLSS' SO SS<br /><br />\nHOME WOOD,BALTIMORE, MD., APRIL 12, 1935.<br /><br />\nt.<br /><br />\nDescribes Seven Of Faculty<br />\nJays To Play Bowman<br />\nScholarship's Aims<br />\nTo Speak At Strike<br />\nAt Dance For<br />\nAthletic Awards<br /><br />\n(Continued from Page 1, Col. 6)<br />\nshould have some relation to the per(Continued from Page 1, Col. 6)<br />\nsonal good of the individual to the the speakers. In case of inclement<br />\ntoil of the day, to the job; that in this weather, the group will adjourn to the<br />\njob if you do things for praise and Latrobe assembly hall.<br />\nfor recognition only at the beginning;<br />\nAs has been previously stated, the<br />\nthat scholarship itself and all its re- local demonstration is part of a nasources should quickly drive a man tion-wide movement in colleges and<br />\ninto the second step—that the work universities to register student opposhould be done whether or not rec- sition to war. The Hopkins strike<br />\nognition comes—and finally, to the committee issued the following statefunds<br />\nadditional<br />\nraise<br />\nto<br />\norder<br />\nIn<br />\nstage of full maturity—that, the ment late yesterday afternoon:<br />\nlast<br />\nfor athletic sweaters and awards for<br />\nbeing done, one does not miss<br />\nwork<br />\n\"Advance reports indicate that the<br />\ncomintramural and inter-fratenity<br />\nexpect the praise.<br />\ndemonstration will be one of the bigpetition, the Johns Hopkins Cotillion or<br />\n\"Progress in abstraction is made gest events in the history of organBoard will hold a benefit dance next<br />\nposition won for it not only by ized intercollegiate activity. Between<br />\nSaturday, April 20, from 9 to 12, in and<br />\nand protracted thinking, but 100,000 and 150,000 students will parvigorous<br />\nLevering Hall.<br />\nalso by a willingness—however re- ticipate in more than 100 institutions.<br />\nThe dance will be the last one given<br />\nluctant or partial it may still be--to The National Council of Methodist<br />\nby the board this year. Music will be<br />\nfollow the thinkers. That is one of Youth has urged all of its 70 member<br />\nsupplied by Frank Orchard's Jays.<br />\nthe great difficulties of the time.<br />\ncolleges to co-operate.<br />\nTickets are being sold at $5 stag or<br />\n\"It has been well said that many<br />\n\"Here at the Johns Hopkins we<br />\ncouple, and may be secured from the<br />\nof our problems are intellectually have sought to conduct the strike on<br />\nor<br />\nBoard<br />\nCotillion<br />\nmembers of the<br />\neasy. We know in a good many in- a dignified and democratic basis. It<br />\nfrom candidates.<br />\nstances what the answer is, or at least has been essentially an undergraduate<br />\nAccording to T. Rogers Bartlett, we know a workable answer. It is the<br />\nproject and a group project. No one<br />\nJr., president of the board, the money acceptance of the truth, no less than organization has been allowed to domrealized from the project will be en- the discovery of the truth, that calls inate the proceedings. We are looktirely turned over to the Athletic for new thought and leadership.<br />\ning forward to a large turnout toBoard to help pay for the remaining<br />\n\"Discovery may be generally hard, morrow and can promise a stimulatsweaters.<br />\nbut once in a while it may come in ing program.\"<br />\nThis is the second time this year flashes of insight. Such experiences<br />\nthat the undergraduate students have are in many cases sweet only when Our interest is in the future, but alas:<br />\ncome to the aid of the athletic activ- detached from current human expe- experience is in the past, and human<br />\nities. The \"gymboree\" aided in the rience. The hard way begins when it wisdom as yet furnishes only a frail<br />\npayment of the football sweaters.<br />\nis sought to carry the truth forward bridge, a mere catwalk between these<br />\ntwo sharply separated regions.<br />\nLast year the board financed a into human life.<br />\n\"There are many contending voices<br />\ntraining table for the football team<br />\ncourwith<br />\nmust<br />\nface<br />\n\"Every one<br />\nbut it was not reintroduced this year. age one of the severest limitations in the market place. Plato's dictum<br />\nIn previous years athletic scholar- set by fate upon human affairs, that goes unheeded, that there should be a<br />\nships to keep valuable athletes in the understanding always comes too late. special penalty for pretended wisdom.\"<br />\nUniversity were also furnished.<br />\nOther officers of the Cotillion<br />\nBoard, besides Bartlett, who is president of this year's group, are Lewis<br />\nE. Reuling, treasurer; and D. Mead<br />\nJohnson, who is secretary. Members<br />\nof the body are Bill McConnell, Burton Cannon, Dave Erck, James Bradford and Brian Murphy.<br />\nIf the new project proves to be well<br />\nreceived and successful among the<br />\nstudent body, the board will give othTUXEDO 1400<br />\n5315 YORK ROAD<br />\ner benefit dances next year to buy<br />\nIntramural trophies or cups for winall1111=1M1111111111111111101111Lning teams in the basketball league.<br /><br />\n4 de Aii4kit<br />\n•••<br />\nifte<br />\ndc5ut S,Ce, Wm-A(7r<br /><br />\nCotillion Board's Last Dance<br />\nTo Be Held In Levering<br />\nHall Next Saturday Night<br /><br />\nSAY IT WITH FLOWERS<br /><br />\nI. H. MOSS,INC.<br /><br />\nFLOWERS FOR ALL OCCASIONS<br /><br />\n(4, qvutiat/ty<br />\n344,11<br />\nArAre<br />\n.xt,<br /><br />\n•i•<br /><br />\nWhat the Governor means is<br />\nthat crossing on a German<br />\nLinergives an opportunityfor<br />\nfirst-hand observation on<br />\nwhat he terms \"combining the Science ofNavigation<br />\nwith the ArtofFine Living.\"<br /><br />\n•<br />\n•<br />\n,4kv..4<br />\n,. 1,4:441kkv<br /><br />\n•:5:9,1,:•••<br /><br />\nis<br /><br />\nlike orchestral playing<br />\n5OMETHING<br />\nthis running of ships across the ocean—a<br />\nwork required of<br /><br />\nspecial aptitude for ensemble<br />\nall members ... You find it on German Ships:<br />\nEvery steward, seaman, officer born to a part,<br />\ntrained by years in working in unison. Ships<br />\nand equipment as fine as can be made, kept in<br />\nperfect order. And a tradition that has its<br />\nhand on every shoulder. day and night.<br />\nFastest Way to France, England, Germany-<br /><br />\n13remen - Europa<br />\nThe de luxe Columbus leaves June 29 — the<br />\nSpecial Student Sailing—for Ireland, England, France, Germany, and every Wednesday<br />\nMidnight a sailing of the \"Famous Four\"<br />\nnew yorh . . Deutschlanb<br />\nqamburg . . Albert Bailin<br />\nCabin Liners St. Louis . . Berlin . . Stuttgart<br />\nto Ireland, England. France. Germany.<br /><br />\nAssistance and Advice to Students going abroad for<br />\ntravel or study. Write Educational Service Department, in any of our offices.<br /><br />\nAlustratett Literature on all Ships, all Classes. ijour focal Trawl Agent, or<br /><br />\nfiamburg-rimericon fine • north Oman Ito<br />\n323<br /><br />\nNorth Charles Street, Baltimore<br /><br />\n:•::?<br /><br />\n•:'<br /><br />\n•}1<br /><br />\ns<br /><br />\nWhen two is company I don't make a crowd<br /><br />\nOP'<br /><br />\nNever a bitter, undeveloped top<br />\nleaf in me. Never a grimy, tough<br />\nbottom leaf. I use only the fra-<br /><br />\nleaves...the leaves that give you<br />\nthe mildest, best-tasting smoke.<br />\nI do not irritate your throat. No<br />\nwonder I'm your best friend.<br /><br />\nLUCKIES USE ONLY THE CENTER LEAVES... CENTER LEAVES GIVE YO<br /><br />\n44.<br /><br />\nCopyrhibt 193.5, The American Tobacco Company.<br /><br />\ngë -<br /><br />\nHOME WOOD,BALTIMORE, MD., APRIL 12, 1935.<br /><br />\nDelaware Runners To Supply<br />\nOpposition For Jaymen In<br />\nInitial Meet At Homewood<br /><br />\nBoo! Roo! We Lose<br />\nNetmen Debut Against Strong<br />\nNavy Team Results In<br />\n9 To 0 Whitewash<br />\nThe Hopkins racquet wielders opened their 1935 season Wednesday aft-<br /><br />\nLambert Ace Of Blue Hens;<br />\nCapt. Neu And Clark<br />\nLead Jay Speedsters<br />\nBy JULIAN ADLER<br />\nIn augurating their season against<br />\none of the strongest opponents scheduled, the Johns Hopkins runners will<br />\nmeet Delaware University at Homewood tomorrow afternoon. The field<br /><br />\nbecause of the fact that this is the<br />\nrubber encounter, both teams having<br />\ncaptured two of the last four contests. As every meet has been won<br />\nby the home team, the Jays have a<br />\npsychological advantage, but on paper the visitors seem to possess a<br /><br />\nNIM111<br />\n•<br />\n111111101.01..11.1•111=11111111110 SWUM<br /><br />\n-Courtesy<br /><br />\nNews-Post<br /><br />\nJEAN HOFMEISTER<br /><br />\nStudents Selected<br />\nTo Referee Games<br />\nTen Students Named By Baer<br />\nTo Umpire Class Games;<br />\nR. Levy In Charge<br /><br />\nslightly stronger aggregation.<br />\nLambert Outstanding<br />\nOne of the outstanding members<br />\nof the opposition is Lambert, a sprinter and broad-jumper, who has proven<br />\nhimself a consistent winner against<br />\nthe Black and Blue. Ted Graziano and<br />\nWillard Neu are the Hopkins men<br />\nwho will attempt to match the Delaware ace's speed, and a close duel is<br />\nanticipated when these runners meet.<br />\nGeorge Carey is another competitor who is expected to prove a worthy<br />\nfoe to the Hopkins' weight men since<br />\nhe secured first in three events against<br />\nthe Jays last year. Carey, who also<br />\nstarred on the Delaware swimming<br />\nsquad that recently defeated the<br />\nJays, will attempt to duplicate his<br />\ntank victories on the track. The men<br />\ncompeting in the weights for Hopkins<br />\nare Marovek, Chancellor, Ellis, Craziano, and Carlin. The first two are<br />\nveterans who have been coming close<br />\nto Carey for the last two years, and<br />\nwho hope to finally turn the tables on<br />\ntheir opponent tomorrow.<br />\nDelaware Strong<br />\nIn 1934 the Delaware team was<br />\nstrongest in the field events, holding<br />\nthe Black and Blue to 7 points. Hopkins, however, is now definitely<br />\nstronger in this department than they<br />\nwere, and expects to make a more<br />\ncreditable showing. Outstanding for<br />\nthe Jays are Neu in the broad jump,<br />\nand B ac and Jarmon in the high jump.<br />\nHopkins undoubtedly will be favored in the distances. Last year the<br />\nBlue Jays scored 26 out of 27 markers in these races, and most of the<br />\nmen who accounted for this total will<br />\nawait the starters' gun again tomorrow. Some of the men who scored<br />\nheavily in 1934 are Paul Holtzman,<br />\nLeonard Emmert, Earl Sholtes, and<br />\nRoland Clark. The former two will<br />\nrun the mile and two-mile respectively; Sholtes will compete in the mile<br />\nand half-mile, whie Clark is entered<br />\nin the latter event. In addition to<br />\nthese men, others who will add to the<br />\nJays' strength are Brown, Lyman,<br />\nHughes Castelle, Maisel, Johnson, and<br />\nMiller<br /><br />\nBy SIGMUND M. SAFIER<br />\nInterfraternity and class softball<br />\nAfter the recent frat volleyball football, Pi Lam worked up in speedy<br />\nleagues<br />\nhave been formed, and schedplayoff<br />\nin which Pi Lamba Phi de- stages to 105 in volleyball to win the<br />\nDespite the one-sided score, most<br />\nules arranged through the efforts of<br />\nSigma<br />\nfeated<br />\nPhi<br />\nEpsilon,<br />\nmemthe<br />\nof the matches were closely-contested,<br />\nleague championship. In basketball Reuben Baer of the Physical Trainbers of the physical training departCaptain Siverd, Hartman and Goldberg<br />\nPi Lam dribblers finished in a ing Department.<br />\nthe<br />\nment, who take care of frat and class<br />\nshowing flashes of good form. Coach activities, made a<br />\ntie for third place with a score<br />\ntriple<br />\nAll freshmen teams will play erecord of the scores<br />\nHofmeister remarked at the conclu- held by each fratertlity thus fan of 85.<br />\nery Friday, sophomores every Wednesday, juniors on Thursday, and the<br />\nsion of the encounter he was much These records are based on the rePhi Sig Most Consistent<br />\nseniors each Tuesday. The games will<br />\nmore pleased with the team than sults of the frat touch football, basthroughconsistency<br />\ngreatest<br />\nThe<br />\nstart at 4.15 and last seven innings.<br />\nketball and volleyball leagues.<br />\nthe score warranted, and he expected<br />\nout the three activities was shown by Except in extremely bad weather, all<br />\nPhi Sig Leads Frats<br />\nthe Jays to win their full share of<br />\nthe Phi Sig sportsmen. Although they games will be played as scheduled,<br />\nPhi Sigma Delta leads the sixteen<br />\nmatches.<br />\nfailed to gain a first place, their but in case a team must postpone a<br />\nfraternities with a total score of 255.<br />\nThe next opponent to be met will be<br />\ngame for reasons other than inclemClose behind in second place is Delta second in touch football, tie for third<br />\nent weather, Reuben Baer must be<br />\nSt. John's and the affair is schedUpsilon with a score of 250, while place in basketball, and third place<br />\nnotified at least twenty-four hours beuled to take place this afternoon at Sigma Phi Epsilon is third with a<br />\nin volleyball was enough to bring fore game time. Failure to do so will<br />\nHomewood. If the courts are in poor score of 225.<br />\nthem out on top with 255 points.<br />\nresult in the forfeiture of the game.<br />\ncondition, efforts will be made to<br />\nIn the touch football league held<br />\nAll-Stars To Be Chosen<br />\nThe following rules will prevail:<br />\nchange the site to the cement courts during December, Phi Kappa Psi got<br />\nAs in touch football, it is expected<br />\n1. The base runner must keep his<br />\nin Druid Hill Park. Following to- off to a good start by winning with that all-star selections will be made<br />\non base until the catcher touches<br />\nfoot<br />\nday's encounter, the team travels to a score of 105. However, in the other In basketball and volleyball. At the<br />\nthe<br />\nball or until the ball is hit by<br />\ntwo<br />\nactivities,<br />\nPhi<br />\nKappa dropped present time the same frats are parPhiladelphia for an engagement with<br />\nthe batter.<br />\nSwarthmore Saturday. At the same back and finished in the three sports ticipating in a softball tournament.<br />\n2. There is no bunting.<br />\ntime, the junior varsity team will be with a low of 125. Phi Sig took sec- An inter-fraternity tennis tourney is<br />\n3. A batter cannot run to first base<br />\nmeeting Episcopal High at Alexan- ond place with 90 and third place in the process of being organized.<br />\nwent to D. U. with a score of 80. Phi<br />\non his third strike.<br />\ndria, Va.<br />\nThe standings to date:<br />\nKappa Psi further showed its right to<br />\n4. A runner leaving his base too<br />\nThe Hopkins-Navy matches:<br />\nTouch Basket- Volley<br />\nthe touch football title by placing two<br />\nsoon on a hit ball is out; otherwise<br />\nSINGLES<br />\nFootball ball 'ball Total he must return to his former base.<br />\nmen on the all-star team selected by<br />\nJ. Mann defeated Siverd, 4-6, 6-3, Ed Lotz.<br />\nFraternity<br />\nThe runner may be tagged out be6-4.<br />\n80<br />\n85<br />\n255 tween bases; however, if he makes<br />\nPhi Sig. Delt 90<br />\nD. U. Upsets Phi Gam<br />\nGay defeated Hartman, 10-8, 6-3.<br />\n250 the next base after having left too<br />\n65<br />\n105<br />\n80<br />\nThe basketball title was more close- Delta Up<br />\nKimmel defeated Kramer, 6-1, 6-2.<br />\nsoon, he must return to the former<br />\nly contested. In the final contest, held Sig. Phi Ep 65<br />\n225<br />\n80<br />\n80<br />\nNoel defeated Buck, 6-1, 6-2.<br />\nbase.<br />\nlate<br />\nin<br />\nMarch,<br />\nD.<br />\nU.<br />\ndefeated<br />\nPhi Phi Gam. D 65<br />\nOelheim defeated Goldberg, 6-3, 2-6,<br />\n220<br />\n55<br />\n100<br />\n5. A runner may score a run only<br />\nGam 24 to 22 to take the champion6-4.<br />\n85<br />\n30<br />\nPi Lam. Phi<br />\n220 on a hit ball.<br />\n105<br />\nship. D. U. finished the season with<br />\nH. Mann defeated Tillman, 6-1, 6-4.<br />\n6. A pitcher is in his box when<br />\n85<br />\n215<br />\n70<br />\na total score of 105 while Phi Gain Beta Theta Pi 60<br />\nfeet are on the box.<br />\nboth<br />\nDOUBLES:<br />\n65<br />\nSigma<br />\n200<br />\nKappa<br />\n60<br />\n75<br />\nwas 5 points behind with an even 100.<br />\n7. A runner may advance only one<br />\nJ. Mann and Kimmel defeated Si- The close rivalry between the frats is Alpha T. 0<br />\n65<br />\n200<br />\n60<br />\n75<br />\nbase on an overthrow at home, first,<br />\nverd and Hartman, 6-3, 3-6, 6-3.<br />\nshown by the three ties for third Phi Alpha<br />\n155 or third.<br />\n50<br />\n60<br />\n45<br />\nGay and Noel defeated Buck and place between Phi Sigma Delta, Pi<br />\n140<br />\n25<br />\n55<br />\n60<br />\nKap. Alpha<br />\nGoldberg, 6-2, 6-2.<br />\nLambda Phi, and Beta Theta Phi.<br />\n125<br />\n5<br />\n15<br />\nH. Mann and Grantham defeated Each team finished with a score of 85. Phi Kap. Psi 105<br />\nPhone Belmont 7908<br />\nTillman and Stine, 6-2, 6-2.<br />\n90<br />\n40<br />\n50<br />\nIn the recently played off volleyball T. A. Phi<br />\n75<br />\n25<br />\n30<br />\n20<br />\ncontest, Pi Lam captured the frat Delta Phi<br />\nSt. Paul at 33rd Street<br />\nPOSTPONED GAMES<br />\ncrown by defeating Sigma Phi. The 0 K 0<br />\n50<br />\n50<br />\nPreecriptions-School Supplies-Candy<br />\nlatter frat topped Division I with 80 T. A. Omega 25<br />\nCigars - Unexcelled<br />\n20<br />\n45<br />\nAccording to an announcement<br />\nFountain Service<br />\npoints, while the former group led<br />\nA.<br />\nD.<br />\n30<br />\nPhi<br />\n5<br />\n35<br />\n•<br />\nmade by Reuben Baer of the Physboth Divisions with 105 points. Phi<br />\nical Training Department, all interSig was a close third with 80 points,<br />\nclass games postponed due to bad<br />\nHOPKINS BELTS, BUCKLES<br />\nlosing to the Pi Lam volleyballera in<br />\n•<br />\n•<br />\nweather will be played during the<br />\n$2.50<br />\nthe Division II playoff. The Pi Lambda<br />\nPrinters of<br />\nlast week of April. Postponed frat Phi athletes, after a slow start, ralPay 50 Cents A Week<br />\nPHILOLOGICAL and SCIENTIFIC<br />\ngames, however, will be played<br />\nlied in time to finish in a tie for fourth<br />\nPUBLICATIONS<br />\nduring the course of the season.<br />\nplace with a total score of 220 for all<br />\n12-20 HOPKINS PLACE, BALTIMORE<br />\n105-113 N. Charles Street<br />\nthree sports. From a low 30 in touch<br />\nNavy team at Annapolis.<br /><br />\nDelaware Strong<br /><br />\npetition fifteen minutes later.<br />\nThe duel will be doubly interesting<br /><br />\nPhi Sig Leading Race By Five-Point Margin; Delta Upsilon Modification Of Rules InIn Second Place; Pi Lam Victor In Volleyball; Spring<br />\ncludes 7 New Points; To<br />\nProgram Calls For Softball Leagues<br />\nPlay Once A Week<br /><br />\nernoon with a 9-0 loss to a superior<br /><br />\nMeet Saturday In Fifth Contest Between Two Teams;<br />\nEach Hold Two Wins<br /><br />\nevents will start at 1.30 p. m., while<br />\nthe trackmen will begin their com-<br /><br />\nSix Teams Waging Close Race Class, Frat Softball<br />\nIn Interfrat League Tourney Leagues Organized<br /><br />\nSudent umpires for football games<br />\nwere announced Wednesday afternoon<br />\nby Reuben Baer, who is in charge of<br />\nthe softball tournament.<br />\nThose who were selected to umpire<br />\nthe games are: Bernie Cherry, Al<br />\nSavage, Dick Byer, Ray Fertig, Arnold Glantz, Ernie Pieper, Abe Edelman, Hal Zheutlin, Dan Goldman, and<br />\nDick Pasternak. At the head of all<br />\nthese umpires is Ronald Levy, a former Hopkins student and now a graduate student. He will be the highest<br />\nofficial in all cases.<br />\nThe schedule of umpires for each<br />\nday follows:<br />\nTuesday-Frat Games: Levy, Cherry. Class Games: Goldman, Paterflak.<br />\nWednesday -Frat Games Levy,<br />\nByer. Class Games: Fertig, Cherry,<br />\nSavage.<br />\nThursday-Frat Games: Levy, Savage. Class Games: Zheutlin, Fertig.<br /><br />\n131r• ely's Pharmacy<br /><br />\nS. &amp; N. KATZ<br /><br />\n•<br /><br />\n•<br /><br />\n\"Sure, enjoy yourself,\"<br />\nsaid Jim. \"It's a ding<br />\ngood cigarette.\"<br /><br />\nNewcomers In Line-Up<br />\nIn the high hurdles Buc and Jarman stand out for the Black and<br />\nBlue, while Lelmeis, Dertzbaugh and<br />\nWingert will face the opposition in<br />\nthe low-hurdle event.<br />\nAside from last year's veterans,<br />\nHopkins possesses several newcomers in the sprints who promise to<br />\nbalance the Jay line-up. Lankford has<br />\nshown great ability in the 440, while<br />\nLitwin, Willen, Lyle and Charley Kelly have been teaming up the cinders<br />\nIn the shorter dashes.<br />\nThe latter<br />\nproved that he had great natural<br />\nspeed on the gridiron last fall, and is<br />\nattempting to apply it to track. This<br />\nnecessitates an adaption of stride<br />\nwhich is difficult to achieve, but<br />\nCoach Hambleton has been working<br />\nwith Kelly, and believes that he has<br />\ngood potentialities.<br /><br />\nI was working way late at the<br />\noffice one nightand ran out ofcigarettes,<br />\nWhen Jim the watchman came through<br />\nI tackled him for a smoke.<br />\n\"Sure,\" says Jim, and he handed<br />\noverapack ofChesterfields.\"Go ahead,<br />\nMr. Kent, take three or four.\"<br />\nJim said he'd smoked a lot ofcigarettes in his time, but he'd put Chesterfield up in front of any of'em when<br />\nit came to taste.<br />\n... \"and they ain't a bit strong<br />\neither,\" is the way Jim put it.<br />\nThat was the first Chesterfield I<br />\never smoked. And I'm right there with<br />\nhim, too, when he says it's a ding<br />\ngood cigarette.<br /><br />\nMile Relay Probable<br />\nWhile the regular meet will end at<br />\n3.00 p m., Hambleton intends to suggest a mile relay to be run between<br />\nthe halves of the lacrosse game. Although this event won't ennnt on the<br />\nscore, it should provide excellent<br />\ntraining for the Penn relays, in which<br />\nHopkins plans to compete.<br />\n'01935. 1.2ccarr &amp; MYERS TOBACCO CO.<br />\nlarship,<br />\nt<br />\nZacts, Is C•<br />\nas Him(<br /><br />\nLefte loco%/c/tadahuP<br /><br />"}], "field_media_file": [{"target_id": 38934, "display": null, "description": null, "target_type": "file", "target_uuid": "5cb1481c-decd-4379-a486-d04997418b70", "url": "http://digital.library.jhu.edu/system/files/2022-03/12611-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12611, "target_type": "node", "target_uuid": "0fb901d5-18e8-48ed-a775-5be7a71ec9a4", "url": "/node/12611"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e5d67a98-b61a-43c5-8630-e45149e7947a"}]}