{"mid": [{"value": 35679}], "uuid": [{"value": "8da221af-7b7b-4ae5-8a3b-189f9e581a91"}], "vid": [{"value": 35679}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12218-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "*<br />\nOctober 23, 1902<br />\n<br />\nVol. VII, No.<br />\n<br />\nTHE<br />\n<br />\nLETTER<br />\n<br />\n•<br />\n<br />\nBEING<br />\n<br />\nTHE<br />\n<br />\nFIRST NUMBER<br />\n<br />\nOF<br />\n<br />\nVOLUME SEVEN<br />\n<br />\n1906<br />\n<br />\n1905<br />\n1904<br />\n<br />\n1903<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fTile Johns Hopkins Universitu<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n11.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1,<br />\n<br />\n1902.<br />\n<br />\nPresident: litit Its:stscri; Dean off the Medical Facu/ty:<br />\nwILLIA st H. Howeet ; Dean, of the Colieu& Facuity:<br />\nNowA Ito H. (IntreiN.<br />\n<br />\nInstruction.<br />\nFOR GRADUATE+ STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for trio degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians<br />\n<br />\nFOR UNDERGRADUATES:<br />\ntel As candidates for the degree of B. A.<br />\n(d) As special students.<br />\nLibraries.<br />\nUniversity,<br />\nPeabody Institute,<br />\nPratt, Library,<br />\n<br />\n105,000 volumes.<br />\n145,000 volumes.<br />\n200,003 ol iii iii a.<br />\n<br />\nLaboratories.<br />\n<br />\nUirectors.<br />\n<br />\nChemistry.<br />\nPhyeics.<br />\n(ieology and Mineralogy,<br />\nZoology<br />\nAnatomy.<br />\nPhysielngv.<br />\nPathology and Bacteriolog.Y•<br />\nPhermacologv.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nra<br />\n.1o.woh<br />\nAmes.<br />\nWilliam 11. Clark.<br />\nWilliam K. Brookm.<br />\nFro'actin 1'. Mall.<br />\nWilliam If.<br />\nIVIllIani 11. Welch.<br />\n.101111 J. Abel.<br />\njilhit J. Abel.<br />\n1111liam Oster.<br />\n<br />\nSeminaries<br />\n(I reek.<br />\nLatin.<br />\nSansk it<br />\nSmell ie.<br />\n<br />\nDirectors.<br />\nL. Uildersleere.<br />\nii'. Smith.<br />\nMaur ice 13loomIteld.<br />\nPaul lIattpt.<br />\n110011.<br />\n.,ifershall<br />\n.1ames IV. 'frigid.<br />\n.1oho, M. ITiroccol.<br />\n.1. 11. liollander<br />\n.ilorleti.<br />\nh'ra<br />\n.1oxes,11 s. A tm,.<br />\nii<br />\n<br />\n110111,1111'1..<br />\nEnglish.<br />\nHistory<br />\nEconomies.<br />\nMathematics.<br />\nPh ymies.<br />\n<br />\n'Hmerican 3ournal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V In progress. 115 per volume.<br />\n<br />\nVolume<br />\n<br />\n11.<br />\n<br />\nlimerican Chemical 3ourna1.<br />\nI. REMSPIN. Editor. Monthly. See. Volume<br />\nX X VIII in progress. $5 per volume.<br />\n111. limerican'journal of iiMailolOgy.<br />\nII. L. GILDERSLEEVE, Editor. Quarterly. Svo<br />\nVolume X XI II. in progress. $3 Per volume.<br />\n111).<br />\nRitubies from the 'Biological laboratory.<br />\nSive.<br />\nVolume V eomplete. $5 per volume.<br />\nW.<br />\nStubles in \"historical anti Political Science.<br />\nMonthly. two Series X X in progress. $3 per<br />\nvolunie.<br />\n1111,.<br />\n<br />\n3ohne lbopkins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress $1 per year.<br />\n<br />\n11)11.<br />\n<br />\n3obno lbophins<br />\n<br />\n1X.<br />\n<br />\nContributious to lisayriology<br />\nSemitic iliDbitoloay, ( Reit rage<br />\nVol, IV complete.<br />\n<br />\nX,<br />\n<br />\nMemoirs from the 'Biological laboratory.<br />\nW. K. BROOKS, Editor. Volume IV eomplete.<br />\n$7.50 per volume.<br />\n<br />\nXl,<br />\n<br />\nabobern language Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to.<br />\nXVII in progress. $1.50 per volume.<br />\n<br />\nMonthly. 4to.<br />\nbospital 'Bulletin<br />\nVolume XIII in progress. $1 per year.<br />\nWill. 3ohne bophins lbospital 'Reports. 4to. Vohime X<br />\nIn progress. $5 per volume.<br />\nant' CoMParatiVC<br />\nAssyriologie, etc.)<br />\n<br />\nVolunae<br />\n<br />\nmit.'Journal of ISM/Wm:Mal ebebicinc.<br />\nW I:. WELCH Editor. Ill-monthly. MVO.<br />\nV I in progress. $5 per velume.<br />\n<br />\nV01111111'<br />\n<br />\nX111. linterican 3ournal of Insanity.<br />\nHEN It V M. HURI), Ed I tor. Quarterly.Ito., $5 per<br />\nvolume.<br />\nX1111. iffeporte of abarylanb afeological Servo?.<br />\nWILLIAM It. CLARE, Editor.<br />\ntU.<br />\n<br />\nterrestrial /Magnetism anb 7Atmospbcric Elec.<br />\ntricity I. A. BAIT ER, Editor. Quarterly. See.<br />\nVolume VII in progress. $2.50 per volume.<br />\n<br />\nftlril. Mutual *Report.<br />\nPresented by mite President of the Board of Trus<br />\n104, , reviewing the operations a I he UnIVOUNItY<br />\n1111ring the past, scademic year.<br />\n1111 limmalleceister<br />\nvi rig the list of officers and students. and stating<br />\nt he regulations, etc., of the University. Pub •<br />\nished tel the clime of 1 he arofie Ma. yea r.<br />\n<br />\nUndergraduate Courses ileading to B. A.)<br />\n(;rOU)1X.<br />\n<br />\nI. Classiest<br />\n(the \"(01(1 eel lege course\").<br />\n•!.. Mathematical- Physical<br />\n(l(ading up to engineering).<br />\n('iwritietil- Biological<br />\ni!eading un to me(hicine).<br />\nI ( i.ological-Biological<br />\nLatin-Mathematical.<br />\n•1Ii.<br />\nII istories1 Political<br />\n(leading up to law).<br />\n7. Thi)lern Latigusges.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathemat les vol XXV ).<br />\nA merictm Chemical Journal (vol. XXVIII ).<br />\nAmerican Journal of Ph ilology (vol XX 1W.<br />\ns tielies in II 1..torical and Political Selence Vol.i<br />\nX X.)<br />\nm.),Iern Language Notes (vol. XVII ).<br />\nMemoirs from the Biological Laboratory (vol. V ).<br />\non I riniltions to A148yriOlOgy (Vol. IV).<br />\n<br />\nTerrestrial Magnetism (Vol VII ),<br />\niiiveri4ity Circulars (vol. XXII ).<br />\nProgrammes of the courses offered to graduate situ<br />\ndenim in Phi osophy and the Arts and in the department<br />\nor mv(lieltie, and also of the undergraduate or collegiate<br />\neourses, will be 14ell t 011 application to the Registrar.<br />\n<br />\nIn addition to the serials above 'mined, copies may<br />\nlie obtained of the works mentioned below:<br />\n1.(<br />\n1<br />\n.1ected PhysicalHn<br />\nPapers of<br />\nThe 717:<br />\nery A. Howland.<br />\nThe Critical Edit ion of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. Paul Him pt. Prompee<br />\ntrts on application.<br />\nHow land's Pied ogre pits of the Normal tolar Spcd 111111.<br />\ni0 plates. $20.00.<br />\n1 lescription of the Jehns Hopkins Hospital. .1. S. Billings, Editor. 11e pp. it°. 511 plates. $7.50 (.101 h.<br />\nThe Teaching of the A p(istles. Cemplete foe simile edition. Edited by .1. Itendel. I lands. 110 pp. ito. 10<br />\nplates. $5.00. ,<br />\nReproduction in Phototype of Sy rine MSS with A millie<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis Part I. Philology. Parts<br />\nI I -I II. Chemistry, Mineralogy and (iewohty. hats<br />\nI V-V-V I. Physics A sti()fenny m)1i Met hematics.<br />\nis VO. 30 cents Tel part.<br />\n-El full list of publications will be<br />\n<br />\n1,1311t<br />\n<br />\non application.<br />\n<br />\n, Communications in respect to exchanges and rein Mance%<br />\ni ma g he sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nOCTOBER 23, 1902.<br />\n<br />\nNo. 1.<br />\n<br />\nTHE POPULAR SONG.<br />\nr ANY persons think it an extremely difficult matter to write a popular<br />\nsong. As a matter of fact, few tasks are more simple. The rub comes<br />\nafter the song is written, and the real work consists in making a popular song popular. There is only one way under the sun to do this and that is<br />\nto let people hear it.<br />\nI have received hundreds of letters reading about like this:<br />\n\"DEAR MR. HAVRZ-I have just completed a song and want you to tell me<br />\nhow to make it popular. It strikes me as possessing all the catchy features of<br />\nthe present day 'hits,' and I don't see why it shouldn't be a go, etc., etc.\"<br />\nMy invariable reply is, \"Get someone on the stage to sing it.\" This is the<br />\ntrue secret of making a song popular. Just about ninety per cent. of the hits<br />\nof today in the song field are the most inane things imaginable, and anybody<br />\nWho would prophecy success for any one of them before it was produced would<br />\nbe voted crazy by a jury of his fellows; but the fact remains that the most<br />\nmediocre song in the world, if pumped into the public ear night after night,<br />\nwill make some kind of a hit.<br />\nNowadays, publishers pay actresses, excuse the word, for singing their<br />\nsongs. About fifty soubrettes were warbling \"Dolly Gray\" for' a specified<br />\nsum per week. The result was it made a hit. \"I must a been Dreamin'\" was<br />\nanother that had to be pushed with money. Yet it scored heavily. Both these<br />\nsongs were purchased by the publisher in a bunch of fifty or more ditties<br />\nacquired by a firm that failed, which were afterwards disposed of for almost<br />\nnothing.<br />\n\"Annie Moore,\" that nightmare of harmony, lay in a publisher's safe about<br />\nfive years before he thought fit to put it out. \"Hello, my Baby,\" was hawked<br />\nabout to many New York ,publishers, all of whom refused it, saying that it was<br />\nrot. It was finally sold to one publisher for $5, and when he bought it he<br />\nthought he had been buncoed.<br />\nA stranger with a bundle of songs stands as much chance in New York<br />\namong the publishers as a book agent. He is put off, told to wait, asked to<br />\nCome in again, or told the manager is busy and can't see him. I have seen<br />\nmany a sad sight in the New York publishing houses. Composers with really<br />\ngood material, anxious to play their work to the publisher, wait in vain for an<br />\nopportunity.<br />\nOn one occasion I was sitting in the private office of a large publisher when<br />\nthe outer guard, if I may so call him, entered and said that there was a young<br />\nman outside with three songs to submit. \"Tell him I'm busy or I'm out or in<br />\nChicago, or anything,\" said the publisher, and turning to me, continued:<br />\n<br />\nTi<br />\n<br />\nse<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n\"You have no idea of the manner in which I'm bothered by these people.<br />\nWhy if I listened to all their rot I wouldn't have time to attend to any part of<br />\nmy business.\"<br />\nMy mission being ended, I went into the outer office and saw a picture of woe. The man who had asked for the publisher had a bundle of badly<br />\nsoiled songs under his arm. and a woe-begone expression on his face. Notwithstanding the fact that there was a heavy snowfall, his shoes were so worn<br />\nthat his toes protruded. I took him into one of the palatial rooms near by,<br />\nand motioned him to the piano. He drew his hands from his trousers pockets<br />\nand tried to play, but his fingers were numb with the cold. I sent out for some<br />\nbrandy for him and under its influence he was soon able to use his fingers. He<br />\nthen played three excessively pretty songs, which I insisted on the publisher<br />\nhearing. The result was that all three songs were accepted; one of them is at<br />\nthe present time a distinct hit.<br />\nHow different it is with a man or a woman who has written a successful<br />\nsong! The moment a successful song writer walks into a publisher's office, he<br />\nis almost hugged. His slightest word is eagerly listened to, and every comment<br />\nhe makes is carefully taken note of. Everything is done to make him comfortable, and be feels a degree of elation that is remarkable. All this because<br />\nhe has written something in the popular vein, and the publisher wants another<br />\nmoney-maker from him.<br />\nIt is a senseless method of procedure to publish a song anywhere except in<br />\nNew York City. That is the home .of the actor and singer. and consequently<br />\nthe stronghold of the publisher. It is a thousand to one bet that a hit cannot<br />\nbe made of a song except when it is published in New York<br />\nLast, but not least, no publisher will take up a song that is in any degree<br />\ncomplicated or \"good.\" The music must be commonplace and the words even<br />\nmore so. The publisher says: ''The public want trash; why not give it to<br />\nJEAN C. HAVEZ.<br />\nthem ?\" And there you are.<br />\nA PLEA FOR SIMPLICITY IN DICTION.<br />\nOW often are we imposed upon by the clang of cymbals and the clash of<br />\nsounding brass! How often the very makers of this noise deceive themselves! Writers and speakers are often prone to swell their periods with<br />\nhigh-sounding words, merely for the sake of sound. Not only is this to be found<br />\nin the speeches of the curbstone orator and of the ranting preacher, but even<br />\nin higher intellectual strata. Charlatans are more numerous in literary fields<br />\nto-day than they ever were in the time of the original magician. We have dross '<br />\nshowered upon us. We are stormed at until our ear-drums protest against the<br />\nstrain.<br />\nThere are two great reasons for the existence of this empty fiuff ball style<br />\nof language. The first is a desire to dress up in tinsel; the second cause, and<br />\nprobably the most usual, is the lack of cogent, logical thought upon the subject<br />\nmatter.<br />\n<br />\ng<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nIt is not surprising that a student who has just made his acquaintance with<br />\na number of \"large\" words should be anxious to exercise his vocabulary to its<br />\nfull extent. In a debate in our halls, a \"senator\" relieved himself of the following sententious bundle of words which had been weighing upon his mind:<br />\nGentlemen, we postulate our position under the orderly march of cumulative<br />\nfacts.\" Having howled this out, his face beamed with conscious pride, and his<br />\nchest was strained to its utmost capacity.<br />\nNor is the undergraduate the only one who seeks to impress his audience.<br />\nA graduate student of several years standing perplexed a seminary meeting by<br />\nusing the term \"altruistic individualism.\" \"Subjective-objectivity\" was once<br />\nventured in a lecture room.<br />\nNor again have we reached the limit to which this sin pervades our halls of<br />\nlearning. I have heard even worthy instructors upon \"off days\" spin out the<br />\nthread of their discourse so thin that it was in imminent danger of being worn<br />\nout in the process.<br />\nUpon one occasion while taking notes in a lecture, my mind wandered, and<br />\nmy note taking became merely mechanical. Upon reading the note-book over,<br />\nI found one simple proposition stated in six different ways.<br />\nOnce upon a time a Spaniard, without any knowledge whatever of the Ung•<br />\nlish language, attempted to translate with the aid of a bilingual dictionary the<br />\nClassics of his tongue into English. The result is most grotesque—a conglomeration of words thrown higglity-pigglity upon the page, full of sound but<br />\nmeaningless.<br />\nThis poor Spaniard knew no better, and may be pardoned with a pitying<br />\nsmile, but for the deliberate villian who stones us with mere \"words, words,<br />\nwords,\" no fate is too hard.<br />\nSometimes the long-winded, gorgeous-hued language conveys ideas worth<br />\ngetting, but one is very apt to be so engrossed in examining the wax flowers as<br />\nto miss the meaning, disproportionate as it is to the sound and length of the<br />\nexpressing medium.<br />\nA famous lawyer, while addressing a jury, having used all the epithetics<br />\nin the dictionary, hesitated a moment, and then added, \"this naufrageons ruffian.\" He was afterwards asked what the word meant, and replied that he did<br />\nnot know, but \"he thought it sounded well.\"<br />\nThat is the raison d'etre of so many a speech; sound instead of sense. Now,<br />\nIn our \"hurry up\" day, we have not the time to waste upon mere sound.<br />\nThose who enjoy it had better take themselves to a \"boiler shop.\" The<br />\nSpeech abounding in \"glittering generalities,\" which states the proposition<br />\nthat 2+2-4 in language worthy of Cicero, is aptly described by the slang expression \"hot air.\"<br />\nTo escape the charge of \"hot airing\" myself, I will drop my pen before<br />\nexhibiting too many examples of the evil I have been abusing.<br />\nR. M. D., '02.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nALUMNI.<br />\nHugh J. Jewett, Jr., was married on the 15th to Miss Anne Ingraham,<br />\nof Washington.<br />\nThe approaching marriage is announced of Dr. Thomas R. Brown to Miss<br />\nJeanne Albert, of Baltimore.<br />\nJoseph Mullen, Jr., was married yesterday to Miss E. W. Cocke, of<br />\n'95<br />\nSt. Louis. He is at present in the Engineering Corps stationed in the Indian<br />\nTerritor<br />\nDr. Wm. Whitridge Williams has been reappointed to the post of Assistant<br />\nin Pathology at the Harvard Medical School.<br />\n997<br />\nThe engagement is announced of F. Henry Baetjer to Miss Mary<br />\n<br />\n'92<br />\n<br />\nVarna11 Carey, of Baltimore.<br />\nYesterday, the 22nd, the marriage took place of Henry M. Wilson to Miss<br />\nTurner, of Charlotte, N, C.<br />\nCharles E. Lyon has been appointed to the post of instructor in German at<br />\nPrinceton University. He passed his examinatian for a Hopkins Ph. D. last<br />\nweek, and will receive the degree in February.<br />\nAlbert Carroll has sailed for South Africa, where he will combine business<br />\nwith pleasure by the preparation of illustrated magazine articles.<br />\nPowhatan J. Wooldridge is to be married on the 28th to Miss Margaret Cox, of Louisville, Ky.<br />\nVictor E. Smith, '98, who has been absent from the University for a year,<br />\nhas returned to his work in the Economics department.<br />\n<br />\n'98<br />\n<br />\nJohn H. King, who took his Doctor's degree in chemistry last spring<br />\nhas entered the Medical School.<br />\nHoward Baetjer has left the Boston Tech., and is now employed with<br />\n'00<br />\nthe American Bridge Company, at Wissahickon, Pa.<br />\n<br />\n99'<br />\n<br />\nLeonard L. Mackall has stopped his work at the Harvard Law School, and<br />\nhas gone to Germany, for a year, to study the language and literature.<br />\nWilliam M. James is now studying at the University of Virginia Law<br />\n'01<br />\nSchool. He writes: ``This place is all right, but-.' He reports himself as<br />\nprominent on the Musical Clubs of the U. Va..<br />\nLeyburn G. Fishach, who has been teaching at the Nautical Academy,<br />\n<br />\nEaston, Md., during the past year, has returned to the University for graduate<br />\nstudy in the Romance language department. He will work for a Ph. D.<br />\nJ. Gresham Machen is a student of the Princeton Theological Seminary.<br />\nLindsay 'C. Spencer, after having passed the Maryland University Law<br />\ncourse in two years, has been admitted to the bar, and is practising in the office<br />\nof Mr. E. J. Farber.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nLewis J. White is working for the B. & 0. Railroad, in the Baltimore<br />\nTransportation Department.<br />\n<br />\n'02<br />\n<br />\nGibson E. Sisco is employed in the Pennsylvania Railroad shops at Fort<br />\nWayne, Ind. •<br />\nWilliam B. Hill is Assistant Auditor for the Maryland Casualty Company.<br />\nHe is now stationed in Milwaukee, Wis.<br />\nJ. P. Hand is back at the University, taking courses in Hebrew and Philosophy, with the intention of entering the ministry.<br />\nJohn G. Campbell has joined the faculty of McDonough School, McDonough, Md.<br />\n'03<br />\nThe list of \"Sometime Members' of the present Senior class has been<br />\nincreased by four during the summer.<br />\nFrank N. Iglehart is employed in the grain house* of Gill and Fisher.<br />\nCarroll Mason Sparrow has obtained a civil service post in the U. S. Coast<br />\nand Geodetic Survey. He is at present stationed on board the schooner<br />\n\"gagre,\" which is taking soundings on the Choptank river.<br />\nJ. M. Combs and Harry B. Snively have also left the University.<br />\n<br />\nDr. J. B. Crenshaw, Ph. D. '93, former instructor in athletics at the<br />\nUniversity, was married to Miss Julia Leach on October 18.<br />\nDr. Alfred W. Stratton, Ph. D., of the University in 1892, died of fever in<br />\nAugust 23, at Gulmar, India. At the time of his death Dr. Stratton was principal of the Oriental College of Lahore, and registrar of the University of<br />\nPunjah, India.<br />\nThe engagement is announced of Leroy Gresham, formerly a graduate<br />\nstudent in the University, to Miss Jessie Rhett, of Virginia.<br />\nRobert Garrett has discontinued his graduate work in the Economics<br />\nSeminary, and will live for a year at Princeton.<br />\nWin. H. Maddren, M. D., '01, is to be married to Miss Helen Howard, of<br />\nBrooklyn.<br />\n<br />\nKIND FRIEND: Come on, Jack, and go to bed; you're drunk and you'd<br />\nbetter go to sleep.<br />\nJACK: No, you don't. This jag has cost me $25 and I don't intend to<br />\nsleep it off.<br />\n\"That,\" said the pelican as Ile grasped the fish, \"will just about fill the<br />\nbill.\"—Cornell Widow.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 22, 1902.<br />\nSubscription $1.50 per year.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\nROBERT S. LANIER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nSoLomoN BLum, 1903.<br />\n.<br />\nGEORGE A. FOSTER, 1904.<br />\n<br />\nREGINAL'D S. OPIE, 1904.<br />\nW. S. BIRD 1908.<br />\nHARRY BAETJER, 1903.<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 898, Medical School of Johns Hopkins Hospital.<br />\n<br />\nN making its bow for the season of 1902-1903, THE NEWS-LETTER would<br />\nlike to improve the occasion with a few words.<br />\nFirst of all, to the entering classes. THE NEws-LnTTER is the only<br />\nstudent periodical publication of the University. It has to combine, in greater<br />\nor less degree, the features of a news weekly, a literary monthly, and a comic<br />\npaper. In preparing and stirring up such a mixture, the editors have their<br />\ntroubles. The recompense they are looking to is your hearty support, not<br />\nonly with your subscriptions, but in no less degree with contributions of matter suitable for publication.<br />\nNext, to our critics. It is true that criticism is a salutary thing; the editors fully realize this, and are duly thankful for having been saved so often.<br />\nBut we cannot help thinking sometimes: If you are so solicitous about the<br />\nreputation of the paper, why don't you help to improve it? The little trouble<br />\nneeded to jot down and hand in the idea for an article, sketch, or poem, would<br />\nvery often bring about an attractive feature in the next number. And to those<br />\nfew,—for there are a few,—who confess to a lack of immediate interest in the<br />\npaper, we would say: Did you ever think that the THE NEWS-LETTER iS exchanged to most colleges of note in the United States and Canada, and that<br />\nfrom it many men in these colleges will get their idea of the quantity and<br />\nquality of spirit in our undergradnate life? If you have at heart, in the slightest degree, the reputation of the college, you will put some little effort into<br />\nhelping its official representative abroad.<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nFinally, to our friends. The appearance of the sheet is changed somewhat,<br />\nand it is intended to have a different cover with each issue. The paper is circulating more widely among the alumni, and for this reason it is desired to enlarge the colutim of alumni news much as possible. In getting ideas and notes<br />\nin these departments, we ask for the same cordial co-operation that you have<br />\nshown us so often in the past.<br />\nWO places are open to candidates on the Board of Editors. One, for a '05<br />\nman, is the post of assistant athletic editor; the other, that of assistant<br />\nbusiness manager, which leads to the business managership next year,<br />\nand is, therefore, open to all Juniors, For information about the work to be<br />\ndone in getting these places, apply to any of the board.<br />\n<br />\nZ<br />\n<br />\nHE question of the existence of a 1902 foot-ball team is the first that will<br />\noccupy the attention of the newly elected Athletic Board. Since 1897,<br />\nthe University has had a team each season, and it has always been well<br />\nsupported and creditable. This year, however, the prospect is very doubtful.<br />\nThere are not more than half a dozen men in the undergraduate department<br />\nwho are up to the standard of a Hopkins team, and some difficulty has been experienced in making up the number at the medical school. It would seem that<br />\namong our entering class of 101, from colleges in every part of the States, a few<br />\nenthusiasts could be found. But the change in the schedule of the first-year work<br />\nis keeping the class so busy that even the most enthusiastic dread to lose from<br />\ntheir courses the time of steady foot-ball practice. Captain Blanck and those<br />\nwho have the welfare of the team at heart are, of course, unwilling to have the<br />\nUniversity represented by light, inexperienced players, who would prove easy<br />\nmarks for our opponents. Mr Garwood, the coach for this year, is confident<br />\nthat he can produce the necessary men from the Medical School if some enthusiasm is shown on this side of town. And so the matter stands. The decision<br />\nof the Athletic Board will be announced this afternoon. If it is for the team, it<br />\nwill then be \"up to\" every student who has the slightest ability to get on his<br />\nfoot-ball clothes and attend practice regularly. Every effort will be needed, for<br />\nour honor will be at stake.<br />\n<br />\nC<br />\n<br />\nHE prospect of a Hopkins athletic field is one that opens to our view every<br />\nfall, and disappears with the same regularity in the summer. But this<br />\nyear it really seems that something will be done, President Remsen, at<br />\nthe Freshmen reception, announced that the trustees had in mind the project<br />\nof using some part of the Homestead grounds as an athletic field, and that the'<br />\nmatter was being attended to as rapidly as circumstances permitted. Moreover,<br />\nthe report of ex-Treasurer Gillespie, of the Athletic Board, read at the election<br />\nby Mr. Abercrombie, showed that the prosperous lacrosse season last spring<br />\nhad added $780 to the $1173, which then constituted our athletic field fund, so<br />\nthat there is now in bank a balance of $1953 for this purpose. It seems more<br />\nthan possible th;it the lacrosse games next spring can be played on our own<br />\n<br />\nt<br />\n<br />\ncampus.<br />\n<br />\n\fTHE N EWS—LETTE R,<br />\nT one of the gentle controversies with which Freshmen and Juniors have<br />\nrecently been delighting all beholders, some Seniors present called for a<br />\ncessation of hostilities, after matters had proceeded to a gory and dusty<br />\nclimax. Much to the surprise of all present, a few revolutionary spirits announced that it was their own affair, and that no interference was wanted, so<br />\nmuch so that a little physical suasion had to be applied until the rest of the<br />\ncombatants filed out. This attitude of the underclassmen is by no means a<br />\nnew one, but it is none the less thoroughly mistaken. Because the Senior's<br />\nparticipation in such affairs is no longer active, it does not follow that he is a<br />\n\"has-been,\" and should show no interest. It is his duty, no less than his inclination, to be on hand at all class troubles, and to be responsible for their<br />\nproper conducting. He has been through it all; he has sprawled in defeat, and<br />\ncrowed in triumph, and no one knows better when there has been enough. At<br />\na Northern college visited by the writer this fall, there was an unwritten law<br />\nthat no hazing should take place without the presence of an upperclassman.<br />\nThe principle illustrated is the right one. There should be no repetition of the<br />\nspectacle of Seniors exerting force to show their authority.<br />\nFOR THE UNDERGRADUATE.<br />\n.T the first meeting of the year of the Junior class, the following officers<br />\nwere elected: Thomas S. Strohbar, president; R. Gordon Dulaney, vicepresident; J. C. L. Hawkins, secretary; W. L. LeCron, treasurer; R.<br />\nS. Opie, historian; H. S. Evans, sergeant-at arms. For the football team, Sifford Pearre was chosen captain, and G. A. Foster manager. Two new members<br />\nof the class were elected: H. S. Evans, of Lehigh. and H. B. Heald, a former<br />\nstudent of the University. The Yell Committee is Licking, Crozier, and Foster.<br />\n<br />\n11<br />\n<br />\nDr. J. S. Ames has decided that no more Freshmen will be permitted to<br />\nenter the class in Minor Physics. A large percentage of the students who have<br />\nfailed in this course during recent years have been Freshmen, and so it has<br />\nbeen arranged that those desiring to enter it must previously spend at least a<br />\nyear in the enlightening atmosphere of the University.<br />\nAndrew D. Jones. Jr., who had been absent from the University for several<br />\nyears, has returned to work for his bachelor's degree.<br />\nH. K. Tootle, '03, has accepted the position of Mopkins correspondent of<br />\nNews, and will receive subscriptions for the same.<br />\nIntercollegiate<br />\nthe<br />\nThe special examination for Freshman scholarships resulted fortunately<br />\nfor the following men: G. Pausch, B. A. Bernstein, S B. Cohen, W. H.<br />\nHudgins, H. V. Morse.<br />\nThe Senate Senior Debating officers are as follows: W. W. Ammen, leader<br />\nof the Government; J. B. G. Custis, leader of the Opposition; John A. Addison,<br />\nsecretary; F. C. Blanck, sergeant-at arms. The first debate, on October 29th,<br />\nwill be on the subject: \"Resolved, That the coal operators were justified in rejecting the proposition made to them by the Mine Workers Union at the Wash-<br />\n<br />\n\fAPI<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nington conference.\" For the affirmative, Plaggemeyer, Pagon, and Murkland<br />\nwill speak; for the negative, Blum, Strayer, and one unchosen. The House of<br />\nRepresentatives (Junior Debating) officers are: R. S. Licking, speaker; J. C.<br />\nL. Hawkins, speaker pro tern.; J. R. B. Branch, secretary; S. Erlanger, ser<br />\ngeant-at-arms.<br />\nThe Freshman class elections resulted in the choice of the following men:<br />\nLawrence Wroth, president; Robertson Griswold, vice-Piesident; Walter<br />\nBaetjer, secretary; R. N. Jackson, Jr., treasurer; Wallace Murkland, historian; W. R. Straughn, poet; Lurrnan Stewart, sergeant-at arms. Clarence<br />\nStone was appointed temporary captain of the football team.<br />\nThe Hullabaloo Club is to have the first \"blow-out\" in its new quarters,<br />\n605 N. Eutaw Street, on Monday night. The committee announces that the<br />\nrooms will be furnished with chairs, clay pipes and a piano—the bare essentials of a good time. Luxuries, such as velvet footed waiters, potted plants,<br />\nand a permanent orchestra, will appear by degrees, as the treasury is in a<br />\nflourishing condition.<br />\nThe new course in Major Economics, under Dr. J. H. Hollander and Dr.<br />\nGeo. E. Barnett, is being well attended by those who wish to add to their<br />\nknowledge of the distribution of wealth, and also to learn a little something of<br />\nits production.<br />\nThe high ideals brought on by higher education were well exemplified in<br />\nan occurrence last week. A Senior lost a pocket book containing $3 50. In<br />\ndesperation, he tried the last chance of a notice on the bulletin board. To his<br />\nsurprise and joy, the missing wallet was returned by a graduate student, and<br />\nwhen opened was found to contain $3.49.<br />\nIn spite of the assertions in our reliable daily contemporaries, E. C. Hill,<br />\n'02, president of the Musical Clubs, did not accompany Manager R. C. Pagon,<br />\n'03, on his trip to Norfolk last Friday, to arrange for the Christmas trip of the<br />\nClubs.<br />\nMembers of the Press Club this year are as follows: Win. M. Hunley,<br />\n'03, the Sun; Wm. S. Bird, '03, the Herald; H. K. Tootle, '03, the American;<br />\nZ. M. Ballard, '98, the News.<br />\nThe exact figures of undergraduate registration have been given out. Out<br />\nof a total of 63 entering students, 8 go to 1906, 54 to 1905 and 1 to 1904. Last<br />\nyear's sub Freshmen numbered five, which gives a total of 59 for the Freshmen.<br />\nContributions for the 1903 HULLABALOO may be handed in to Box 374.<br />\nSketches, songs, stories, individual and general satire, are all welcome.<br />\n<br />\nSUNDAY SCHOOL THACHER—\"And so Lot's wife was turned to salt.<br />\nany one tell why?\"<br />\n.WILLIE (from the rear)—\"She was too fresh.\"—Harvard Lamfioon,<br />\n<br />\nCan<br />\n<br />\n\fit)<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHE NEW ATHLETIC BOARD.<br />\nN Friday, October 17th, the annual election of officers of the General Athletic Association was held in Hopkins Hall. A very good attendance<br />\nwas noted, and no particular incident marred the ballot. The result<br />\nwas as follows: Ronald T. Abercrombie, President; W. Sellman Bird, VicePresident; Joseph T. Smith, Corresponding Secretary; B. L. Pessagno, Recording Secretary; W. E. Hoffman, Treasurer; Dr. E. Renouf and Prof. Wm M.<br />\nMackdermott, Faculty atlegates; Dr B. B. Lanier, Alumni Delegate; H. B.<br />\nStone, Medical Delegate; H. A. Converse, Graduate Delegate; R. C. Hoffman<br />\nand Fred. C. Blank, Senior Delegates; Pearre and Porter, Junior Delegates;<br />\nStone, Freshman Delegate.<br />\nThe official '`II\" was awarded to W. L. Lindsay, R. C. Hoffman, H B. Stone<br />\nand H. K. Tootle, for track and field work. \"H. A. A.\" was awarded Porter, LeCron, Emig and Branham.<br />\n<br />\nO<br />\n<br />\nTRACK AND FIELD.<br />\nAt such an early date, very little can be said regarding track and field<br />\nprospects for the coming year. Judging from numbers and appearances, however, Hopkins should be able to perform the same \"stunts\" at the local track<br />\nand field contests held during the winter and spring.<br />\nCaptain R. C. Hoffman called a meeting of candidates last week and 36<br />\nchesty men responded. The large majority were new men, but most of these<br />\nwere very prepossessing in appearance, and some good material should be<br />\ngotten out of their midst.<br />\nNext light work will begin consisting mainly in using the gymnasium apparatus and learning points about the all-important start. It will take hard<br />\nsystematie work to develop men to take the iplaces of such cracks as Riggs,<br />\nScholl, Lindsay and others, but \"Curzon \"is known as a conscientious hustler<br />\nand may be depended upon to \"get busy\" and keep it up<br />\n\"Bill \"Hoffman and \"Joe\" England are still beneath the Black and Blue<br />\non the other side of town and may be depended upon to help in every possible<br />\nway. Harvey Stone is also among the\"meds.\" Altogether the prospects in<br />\ntrack and field work are fairly good. It is not likely that a J. H• U. meet will<br />\nbe held before January, but something has already been said about a set of<br />\ngames between the Senior, Junior and Freshman classes. All sorts of events<br />\n<br />\n\fI<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nare proposed and the grand finale is to be a relay race to be crowed over in the<br />\ntrophy room each year by the victorious class. The idea seems to be a good<br />\none and it might be well for the classes to consider the matter.<br />\nFRESHMAN -JUNIOR FOOTBALL.<br />\nHE apparent lack of 'Varsity football material seems to have brought the<br />\n• candidates for the Junior and Freshman class teams into prominence. In<br />\nformer years very little has been done toward organizing class teams<br />\nuntil the end of the 'Varsity schedule. The fact that there may be no schedule<br />\nthis year probably accounts for such early action among the Juniors and the<br />\nFreshmen. From such indications the annual clash shoula be unusually interesting.<br />\nFollowing are the men who have handed in their names as candidates for<br />\nthe class teams : Juniors—Branham, Peat-re, Rosenfeldt, Foster, Strohbar,<br />\nEmig, Crozier, Lewis, Evans, Licking, Erlanger, LeCron, Porter, Rosenheim,<br />\nKohn.<br />\nFreshmen—Boyce, Wroth, Stone, Hudgins, Goldman, Hacket, W. Baetjer,<br />\nDill, Bowie, Jacobs, Campbell, Mifflin, Straughn.<br />\nShould it be decided to give up a 'Varsity eleven for the present season, the<br />\nclass game will be played earlier than usual.<br />\n<br />\nt<br />\n<br />\nA LOVE SET.<br />\nLove is but a game of ping-pong,<br />\nSometimes filled with ups and downs,<br />\nOften but a dreary sing-song,<br />\nSometimes smiles and sometimes frowns.<br />\nThere are some games which are boring,<br />\nOther games are played quite well,<br />\nAnd the system used in scoring<br />\nFinds in life a parallel.<br />\nFifteen-love is very silly,<br />\nWith a sweetness sickening;<br />\nThere's no thought that life is hilly,<br />\nOnly love is the real thing.<br />\nThirty-Love is warm and tender,<br />\nNuw's the time to woo and win.<br />\nEven if the purse be slender<br />\nTake her—let the game begin.<br />\nForty-Love is ripe and mellow<br />\nWith a happy, genial glow,<br />\nBeing now a staid old fellow<br />\nMatrimony's voted slow.<br />\nHe is done for now—he's fifty,<br />\nTake ono glance and close the book;<br />\nCreeping age has made him thrifty,-He is married to his cook.<br />\n- '03,<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\nALMA MATER.<br />\nWe sing a song of youth and golden days spent<br />\nIn cloistered shades of learning rare,<br />\nWe sing a song of youth and silvery nights rent<br />\nBy wassail shout and discord's blare.<br />\nWhile hearts are young and blood flows thick and fast, then<br />\nNo motives base our friendships stain;—<br />\nWe gather now the moments that will last, when<br />\nAll else is gone, they will remain.<br />\nCHORUS:<br />\nThen, Alma Mater, Mother of our Youth,<br />\nTeaching wisdom, manliness and truth:<br />\nFor thee there beats in every breast<br />\nThe truest, loyalest, and best:—<br />\nBeside thee what care we for wine, and women, and the rest.<br />\n<br />\nAir:<br />\n<br />\nThe hasty flight of years we will not now mourn,<br />\nBut lightly take our little fling;<br />\nSome day we'll miss in loneliness our friends gone,<br />\nFor life is not eternal spring.<br />\nYet, when we wake to find no quicker heart-beat<br />\nFrom hope or love or joy or pain,<br />\nWe'll keep the soul alive and Father Time cheat,—<br />\nOn memories grow young again CHORUS:<br />\nJ1'u njeivlj, .fiatieula.<br />\nJOHN M. BOOKER, '01.<br />\n<br />\nTHE TOAST WE DRINK TO-NIGHT.<br />\nIf you've ever seen a college<br />\nin a Southern city fair,<br />\nWhere seekers after knowledge<br />\nand good-fellowship repair;<br />\nIf you know its fame from Sea to Sea,<br />\nits future's promise bright,<br />\nThen you know the Hopkins 'Varsity,<br />\nthe toast we drink to-night!<br />\nIf you've ever seen twelve hefty men<br />\nwho check and dodge and throw,<br />\nWho've vanquished Swarthmore, humbled Penn,<br />\nand laid the Crimson low;<br />\nIf you've seen the banners that proclaim<br />\nour champions' skill and might,<br />\nThen you know lacrosse, the Hopkins game,<br />\nthe toast we drink to-night!<br />\nIf you've ever seen a pretty maid<br />\ngo tripping on her way,<br />\nAnd niarked the Black and Blue displayed<br />\nin flutt'ring ribbons gay;<br />\nIf your heart and head are set awhirl<br />\nby smiles and glances bright,<br />\nThen you know the loyal Hopkins girl,<br />\nthe toast we drink to-night!<br />\nROBERT S. LANIER, '08.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nTHE MUSICAL CLUBS.<br />\nClubs are very fair. FinanHE prospects of a good season for the Musical<br />\nion for the two years past,<br />\ncially, the clubs have been in excellent condit<br />\nssiveness of its imme •<br />\nprogre<br />\nand if the present management displays the<br />\nsuch an organization<br />\nof<br />\nss<br />\n(hate predecessors, all will go well. The final succe<br />\nrmances at the con<br />\nperfo<br />\nof its<br />\nalways depends, however, upon the character<br />\nand quality of the<br />\nity<br />\nquant<br />\nthe<br />\ncerts; which, in turn, is regulated entirely by<br />\nis in the hands of<br />\nr<br />\nmatte<br />\nthis<br />\nmaterial at the disposition of the leaders. And<br />\nn Freshmen<br />\n-doze<br />\nhalf-a<br />\nthe students. At the first Glee Club rehearsal, barely<br />\nr. It must<br />\nnumbe<br />\nthis<br />\ntimes<br />\nfour<br />\nwere present; there should have been three or<br />\nback at the<br />\nare<br />\nas<br />\nrs<br />\nmembe<br />\nnot be thought that, because such of the former<br />\nd on the<br />\nwante<br />\nblood<br />\nnew<br />\nno<br />\nUniversity have their places assured, there is<br />\nare the<br />\nthey<br />\nsince<br />\nd,<br />\nwante<br />\nClubs. It is the underclassmen who are especially<br />\nin the<br />\nthem<br />\ne<br />\nmanag<br />\nand<br />\nmen who will grow up with the Clubs, and will lead<br />\nyears to come.<br />\n35, and was rushed<br />\nThe first Glee Club rehearsal was attended by about<br />\n\"University Ode\"<br />\nThe<br />\nstyle.<br />\nthrough by Leader Carver in the most approved<br />\nand recognizaiastic<br />\nenthus<br />\nand \"Black and Blue\" were, if not finished, at least<br />\n1902 medThe<br />\nsals.<br />\nrehear<br />\nble, which is more than could be said of most first<br />\nstart.<br />\ngood<br />\nhis<br />\non<br />\nd<br />\ntulate<br />\nley is now in preparation. Mr. Carver is to be congra<br />\nay<br />\nTuesd<br />\non<br />\nsals<br />\nrehear<br />\nThe Banjo and Mandolin Clubs held their first<br />\nenterthe<br />\nfrom<br />\nup<br />\nd<br />\nturne<br />\nnight. Many new candidates for the Mandolin Club<br />\n. The Banjo Club will be<br />\ning classes, including several mandolins and a violin<br />\nmedical student who has<br />\nmuch helped by the presence this year of a first year<br />\nplayed for four years on the Yale Club.<br />\nIt is to be \"Down the<br />\nThe Christmas trip is a new departure this year.<br />\niment, but it is felt<br />\nexper<br />\nan<br />\nBay\" to Norfolk and Richmond, Va. This trip is<br />\nthat it will prove a great succes.<br />\nfor Friday evening. Decem<br />\nThe Opera House at Norfolk has been engaged<br />\nto receive the visitors.<br />\nber 30th, and elaborate preparations will be made<br />\nlk, Va., and we trust<br />\nThe University has a great many admirers at Norfo<br />\nrs to greet the Musical Clubs.<br />\nand feel that they will turn out in great numbe<br />\ngements with the Chesapeake<br />\nR. C. Pegon, ('03,) Manager, has made arran<br />\nthe transportation, and the<br />\nSteamship Company, \"Chesapeake Line,\" for<br />\nChism, General Ticket Agent, and<br />\nspecial courtesies extended by Mr. E. J.<br />\nAgent, in offering low rates is<br />\nMr. T. H. McDannel, Traveling Passenger<br />\ngreatly appreciated.<br />\nhave friends in Norfolk and<br />\nIt is asked that all Hopkins students that<br />\nencourage their friends to visit<br />\nRichmond will write to them and ask them to<br />\nClub.<br />\nthe Opera House on December 30th, to greet the<br />\nof the Club to have as<br />\nement<br />\nmanag<br />\nthe<br />\nof<br />\nwish<br />\nIt is also the desire and<br />\ncan conveniently arrange to go.<br />\nmany men accompany the Club on the trip as<br />\n<br />\nt<br />\n<br />\nblank in this copy.<br />\n*Please fill out and return the subscription<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nII I 11 11111111111111111111 111111111111 11111111111111 11111 1 1<br />\n<br />\n1 1 1 Iii 1 I/ 1 1 I 11111111111111111 1111 1 111111110 111111111 1 1U111 11111 1<br />\n<br />\n10110111<br />\n,<br />\n<br />\n•<br />\n<br />\n,<br />\n<br />\n7,,mElMillimaritiamillininuritIgnithilinthitIliguatilliliillainiiifigulAhunnignniu<br />\n<br />\n1/<br />\n<br />\nILA<br />\n<br />\n11TER a year's leave of absence spent in studying in France, Spain and<br />\nItaly, Dr. Philip Ogden has returned to the University to resume his<br />\nwork as instructor in French.<br />\n<br />\nThe Geographical Society of Baltimore, organized on Friday last at the<br />\nhome of ex-president D C. Gilman, has among its offic rs Dr. D. C. Gilman,<br />\npresident; Mr. Robert Garrett, treasurer; Dr. Geo. B. Shattuck, secretary.<br />\nThe object of the Society is the diffusion of geographical knowledge of every<br />\nkind, with especial reference to the commercial needs of Baltimore.<br />\nThe first meeting of the Pedagogical Society was held on Wednesday,<br />\nOctober 15. The object of this society is to interest and instruct all Hopkins<br />\nmen who intend to engage in pedagogical work. The meeting, which was<br />\nattended by fourteen students representing the graduate department and the<br />\nsenior class, was opened with an address by Dean Griffin, in which he outlined<br />\npossible methods of work, and assured the society of the sympathy and cooperation of the faculty. The following officers were elected: President, C. C.<br />\nGrove, grad.; vice-president, W. E. McDonald, grad.; Secretary, G. D.<br />\nStrayer, '03.<br />\nFACULTY VACATIONS.<br />\n<br />\nT<br />\n<br />\nRESIDENT REMSEN spent the summer months at his country home in<br />\nMaine. He found time to revise his book on organic chemistry, and the<br />\nmanuscript is now in the hands of the publishers.<br />\n<br />\nDr. A. Marshall Elliott, director of the department of Romance Language,<br />\nwas taken ill during his stay in London. On his recovery he rested awhile<br />\nin<br />\nsouthern France.<br />\nDr. Henry F. Reid, professor of Geological Physics, was in<br />\nSwitzerland,<br />\nwhere he made a special study of the Swiss glaciers.<br />\nDr. James W. Bright, head of the English department, remained in<br />\nBaltimore during the vacation.<br />\nDr. Wm. B. Clark, professor of geology, passed the summer months in the<br />\nNew England States.<br />\nDr. Maurice Bloomfield spent a month in Vienna, where<br />\nhe completed his<br />\nwork on\"A Concordance of the Vedas,' after which be visited other<br />\ncities on<br />\nthe continent.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nsummer sketchMr. S. Edwin Whiteman, instructor in drawing. passed the<br />\ning on Long Island Sound.<br />\nGermany<br />\nDr. Wm. Kurrelmeyer, of the Germanic department, was in<br />\nthe time<br />\nbefore<br />\nextant<br />\nn<br />\nBibles<br />\nstudying and collecting the texts of the Germa<br />\nof Luther.<br />\nDr. Paul Haupt travelled in Germany during the vacation.<br />\nDr. Wm. H. Browne was in West Virginia during the summer.<br />\nr in northern<br />\nDr. Roscoe Guernsey, instructor in Latin, spent the summe<br />\nNew York.<br />\nnia and<br />\nDr. Henry Wood, professor of physics, travelled through Califor<br />\nother Western States.<br />\nDr. Kirby Smith was at his country home in Carroll county.<br />\nDean Griffin passed the summer in the White Mountains.<br />\n<br />\nY. M. C. A.<br />\nl and four<br />\nOPKINS had three graduate, four undergraduate, two medica<br />\n27 to July<br />\nJune<br />\nence,<br />\nprep school men at the Northfield Student Confer<br />\nce on<br />\neviden<br />\nin<br />\nmuch<br />\n6. The Black and Blue and Hopkins yells were<br />\nlast<br />\nof<br />\ncut<br />\nfine<br />\nvery<br />\nbore a<br />\nall occasions at the camp. The camp letterheads<br />\ng<br />\nor<br />\nLickin<br />\nSmith,<br />\nJoe<br />\nn,<br />\nyear's camping party. Ask Edmunds, Graff, Addiso<br />\nEmrig about the good time.<br />\nBible readings were<br />\nJoining with Dartmouth and Vermont, a series of daily<br />\nr. Our own comsumme<br />\nthe<br />\nfor<br />\nrs<br />\nreprinted from Yale's list and sent to membe<br />\nmonths of Unithree<br />\nfirst<br />\nthe<br />\nfor<br />\nmittee did good work in preparing a series<br />\nversity work.<br />\nTopic cards for October are also out.<br />\nare invited to attend.<br />\nMorning prayers are held as usual at 8.45 and all men<br />\nThey are making a good start.<br />\ng was led by Dr. Kelly<br />\nThe 5 o'clock Tuesday afternoon devotional meetin<br />\nthe Northfield delegation on<br />\non October 14th, with attendance of 43, and by<br />\nOctober 21st.<br />\nwas very pleasant and<br />\nThe reception at Mr. Leverity2's on Friday, the 17th,<br />\nclass and graduate department<br />\nthe work well organized. Bible classes for each<br />\nMission study course will be<br />\nwill arrange most convenient time for meeting.<br />\ncarried through the year on India and the Philippines.<br />\non Saturday with a<br />\nThe social settlement work at Lawrence House opened<br />\nnight.<br />\nns<br />\nHopki<br />\nbe<br />\nwill<br />\ngood number of workers. Saturday night<br />\nin the Association.<br />\ny<br />\nactivit<br />\nus<br />\nreligio<br />\nHere are a number of opportunities for<br />\nThe officers are<br />\n.<br />\nfailure<br />\nor<br />\ns<br />\nIt is up to every member to make them a succes<br />\nnot responsible for all of the work.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nIN THE GOOD OLD SUMMER TIME<br />\nJUNIORS.<br />\nBranch spent a short time in New York and a long time in Maryland.<br />\nBuckler laid the foundations of his fortune at the Carnegie Steel Company,<br />\nPittsburgh.<br />\nCator golfed during the summer at Sudbrook.<br />\nDulaney, after idling through the weary days at Atlantic City for a while,<br />\nfaded away to Magnolia, Mass., and Portland, Maine.<br />\nEmig studied in Baltimore most of the summer. He attended the Northfield Conference.<br />\nErlanger and Rosenheim adorned the rural society of Lake Sebago, Maine.<br />\nWallace was accompanied by an engineering corps through Western Pennsylvania.<br />\nStollenwerck was at his home in Alabama.<br />\nHumrichouse canoed on the Potomac.<br />\nEvans, who went to Lehigh last year, has entered the Junior class. During<br />\nthe summer be traveled through Colorado.<br />\nOttomar Fuerbringer recuperated at Saginaw, Michigan.<br />\nMaynard summered on his estate in Caroline County.<br />\nShapiro passed the summer in impressing upon certain youths the fact that<br />\nhis knowledge was vaster than theirs.<br />\nPorter glided through the warm weather at Emory Grove.<br />\nAustrian and Rosenfeld conferred the honor of their presence upon Atlantic<br />\nCity.<br />\nPearre sailed, yachted and fished around Nova Scotia.<br />\nStrohbar \"went to Halifax\" on a schooner.<br />\nLeCron worked for the United Fruit Company.<br />\nSENIORS.<br />\nGlocker spent the vacation near Frederick, Maryland.<br />\nHaughton summered at Cape May, New York.<br />\nAmmen rusticated on the Eastern Shore and in Virginia.<br />\nJ. Smith attended the Northfield Conference and spent the remainder of his<br />\ntime at Eaglesmere.<br />\nBaldauf was most of the time at his home in Henderson, Kentucky.<br />\nDochez toured Europe.<br />\nToms spent the summer at Braddock's Heights, Maryland.<br />\nPlaggemeyer traveled the Middle West. He visited St. Paul, Chicago and<br />\nMinneapolis.<br />\nBamberger and I3lum spent six weeks of the summer at Cornell and the<br />\nremainder in Center Lovell, Maine.<br />\nHildt was at Fishkill on-Hudson.<br />\nStrayer remained in Baltimore and tutored. .<br />\nStraus spent most of the summer at Lake Sebago, Maine, and then went to<br />\nBuena Vista<br />\nHazelhurst was in Europe.<br />\nTootle stayed at his home in Missouri.<br />\nBryan spent his summer in battling with typhoid.<br />\nHendry was in Washington and Frederick.<br />\nTownsend was in Baltimore part of the time and the remainder of the<br />\nsummer in Snow Hill.<br />\nLather enjoyed himself in the Adirondacks.<br />\n<br />\n\f4<br />\n<br />\n\fDrovers & Mechanics Nat'l Bank,<br />\n<br />\nSTIEFF PIANOS<br />\n<br />\nOF BALTIMORE. MD<br />\nMADIC OF THIC<br />\n<br />\n'LS MONICY<br />\n<br />\nAND ICX1.11:121ENCIC(AN<br />\n<br />\n• CAPITAL STOCK, $300,000.<br />\n<br />\nBUY.<br />\n<br />\nWAREHOOM410<br />\n<br />\nN,<br />\n<br />\nSURPLUS & PROFITS, $375.000.<br />\n<br />\n1.4.11114.1RT<br />\n<br />\n41F- Transacts a General Banking Business.<br />\n<br />\nNC ST.<br />\n<br />\nGUSHING ScGOMPANY'<br />\n<br />\nBooksellers and<br />\nStationers.<br />\n34 W. BALTIMORE STREET.<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKelp eonsta liE y on hand the Text Books used<br />\nIn .1 oiin Hopkins Foiversity and the woman's<br />\nI !ollege of Baltimore<br />\n91,<br />\nAle<br />\n*<br />\nSTATIOMBRY For School. farniiii, Office and Bank.<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books,<br />\n.<br />\nillad/S0t/ eg<br />\nStudent's Suurlies.<br />\n<br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\n11111111111111111=11111111111.11111111111111.1.111111. Hosiery, Etc.<br />\nSHIRTSTO ORDER A SPECIALTY.<br />\n<br />\nIlgenfritz Studio<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nOn Bale The 3. If II. l'omettritg,[yid ail other College<br />\nl'emiants.<br />\n<br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURER<br />\n<br />\nHoward Sts.<br />\n<br />\nSiweessor to Cummins.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nFOR<br />\n<br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\n<br />\nOF<br />\n<br />\nOrech letter fraternal? jeweirr,.<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\niplcroe Call ant+ Examinc our line IBefore Vurchasinit.<br />\n<br />\n1.6ORT & LOUISA&<br />\n<br />\nSTS.<br />\n<br />\nPUBLISHERS.<br />\n<br />\nTHE NEWS LETTER<br />\nIS FROM THE<br />\nPRESS OF<br />\n<br />\n• 7?:24,4,-\"<br />\n<br />\nPRINTERS<br />\n<br />\nC'e2..e.<br />\nN,Ilt I f e,<br />\n*<br />\nri I (,(111 fiAl!UAW..A<br />\n<br />\nBA 1:11,A1,:2111. „Yd.)<br />\n<br />\nAND<br />\nSTATICNERs<br />\n<br />\nNORTH GERMAN<br />\nLLOYD S. S. 60.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Brennm, London, rails, Gibraltar, Naples, Genoa, Etc.,<br />\nBALTIMORE TO BRE,MEN DIRECT.<br />\nFor partItallars a pull' to<br />\n<br />\nft. S6HUM116tIER Sc GO., General Agents.<br />\nBE314)rAi, NOTICE,<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS'. HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n73altirnore, Md.<br />\n<br />\nThe attention of the Students of the University<br />\n<br />\nlE4<br />\n<br />\nthroated to the feet that the Thos. Blake Co., have<br />\nremoved their I kmts' Furnishing Store to 219 K. Baltimore St. Their ad vertisment will be found elsewhere<br />\nIn this lio.ne.<br />\n<br />\n\f", "format": "basic_html", "processed": "*<br />\nOctober 23, 1902<br /><br />\nVol. VII, No.<br /><br />\nTHE<br /><br />\nLETTER<br /><br />\n•<br /><br />\nBEING<br /><br />\nTHE<br /><br />\nFIRST NUMBER<br /><br />\nOF<br /><br />\nVOLUME SEVEN<br /><br />\n1906<br /><br />\n1905<br />\n1904<br /><br />\n1903<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nTile Johns Hopkins Universitu<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORE, MARYLAND.<br />\n11.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1,<br /><br />\n1902.<br /><br />\nPresident: litit Its:stscri; Dean off the Medical Facu/ty:<br />\nwILLIA st H. Howeet ; Dean, of the Colieu&amp; Facuity:<br />\nNowA Ito H. (IntreiN.<br /><br />\nInstruction.<br />\nFOR GRADUATE+ STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for trio degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians<br /><br />\nFOR UNDERGRADUATES:<br />\ntel As candidates for the degree of B. A.<br />\n(d) As special students.<br />\nLibraries.<br />\nUniversity,<br />\nPeabody Institute,<br />\nPratt, Library,<br /><br />\n105,000 volumes.<br />\n145,000 volumes.<br />\n200,003 ol iii iii a.<br /><br />\nLaboratories.<br /><br />\nUirectors.<br /><br />\nChemistry.<br />\nPhyeics.<br />\n(ieology and Mineralogy,<br />\nZoology<br />\nAnatomy.<br />\nPhysielngv.<br />\nPathology and Bacteriolog.Y•<br />\nPhermacologv.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nra<br />\n.1o.woh<br />\nAmes.<br />\nWilliam 11. Clark.<br />\nWilliam K. Brookm.<br />\nFro'actin 1'. Mall.<br />\nWilliam If.<br />\nIVIllIani 11. Welch.<br />\n.101111 J. Abel.<br />\njilhit J. Abel.<br />\n1111liam Oster.<br /><br />\nSeminaries<br />\n(I reek.<br />\nLatin.<br />\nSansk it<br />\nSmell ie.<br /><br />\nDirectors.<br />\nL. Uildersleere.<br />\nii'. Smith.<br />\nMaur ice 13loomIteld.<br />\nPaul lIattpt.<br />\n110011.<br />\n.,ifershall<br />\n.1ames IV. 'frigid.<br />\n.1oho, M. ITiroccol.<br />\n.1. 11. liollander<br />\n.ilorleti.<br />\nh'ra<br />\n.1oxes,11 s. A tm,.<br />\nii<br /><br />\n110111,1111'1..<br />\nEnglish.<br />\nHistory<br />\nEconomies.<br />\nMathematics.<br />\nPh ymies.<br /><br />\n'Hmerican 3ournal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V In progress. 115 per volume.<br /><br />\nVolume<br /><br />\n11.<br /><br />\nlimerican Chemical 3ourna1.<br />\nI. REMSPIN. Editor. Monthly. See. Volume<br />\nX X VIII in progress. $5 per volume.<br />\n111. limerican'journal of iiMailolOgy.<br />\nII. L. GILDERSLEEVE, Editor. Quarterly. Svo<br />\nVolume X XI II. in progress. $3 Per volume.<br />\n111).<br />\nRitubies from the 'Biological laboratory.<br />\nSive.<br />\nVolume V eomplete. $5 per volume.<br />\nW.<br />\nStubles in \"historical anti Political Science.<br />\nMonthly. two Series X X in progress. $3 per<br />\nvolunie.<br />\n1111,.<br /><br />\n3ohne lbopkins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress $1 per year.<br /><br />\n11)11.<br /><br />\n3obno lbophins<br /><br />\n1X.<br /><br />\nContributious to lisayriology<br />\nSemitic iliDbitoloay, ( Reit rage<br />\nVol, IV complete.<br /><br />\nX,<br /><br />\nMemoirs from the 'Biological laboratory.<br />\nW. K. BROOKS, Editor. Volume IV eomplete.<br />\n$7.50 per volume.<br /><br />\nXl,<br /><br />\nabobern language Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to.<br />\nXVII in progress. $1.50 per volume.<br /><br />\nMonthly. 4to.<br />\nbospital 'Bulletin<br />\nVolume XIII in progress. $1 per year.<br />\nWill. 3ohne bophins lbospital 'Reports. 4to. Vohime X<br />\nIn progress. $5 per volume.<br />\nant' CoMParatiVC<br />\nAssyriologie, etc.)<br /><br />\nVolunae<br /><br />\nmit.'Journal of ISM/Wm:Mal ebebicinc.<br />\nW I:. WELCH Editor. Ill-monthly. MVO.<br />\nV I in progress. $5 per velume.<br /><br />\nV01111111'<br /><br />\nX111. linterican 3ournal of Insanity.<br />\nHEN It V M. HURI), Ed I tor. Quarterly.Ito., $5 per<br />\nvolume.<br />\nX1111. iffeporte of abarylanb afeological Servo?.<br />\nWILLIAM It. CLARE, Editor.<br />\ntU.<br /><br />\nterrestrial /Magnetism anb 7Atmospbcric Elec.<br />\ntricity I. A. BAIT ER, Editor. Quarterly. See.<br />\nVolume VII in progress. $2.50 per volume.<br /><br />\nftlril. Mutual *Report.<br />\nPresented by mite President of the Board of Trus<br />\n104, , reviewing the operations a I he UnIVOUNItY<br />\n1111ring the past, scademic year.<br />\n1111 limmalleceister<br />\nvi rig the list of officers and students. and stating<br />\nt he regulations, etc., of the University. Pub •<br />\nished tel the clime of 1 he arofie Ma. yea r.<br /><br />\nUndergraduate Courses ileading to B. A.)<br />\n(;rOU)1X.<br /><br />\nI. Classiest<br />\n(the \"(01(1 eel lege course\").<br />\n•!.. Mathematical- Physical<br />\n(l(ading up to engineering).<br />\n('iwritietil- Biological<br />\ni!eading un to me(hicine).<br />\nI ( i.ological-Biological<br />\nLatin-Mathematical.<br />\n•1Ii.<br />\nII istories1 Political<br />\n(leading up to law).<br />\n7. Thi)lern Latigusges.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathemat les vol XXV ).<br />\nA merictm Chemical Journal (vol. XXVIII ).<br />\nAmerican Journal of Ph ilology (vol XX 1W.<br />\ns tielies in II 1..torical and Political Selence Vol.i<br />\nX X.)<br />\nm.),Iern Language Notes (vol. XVII ).<br />\nMemoirs from the Biological Laboratory (vol. V ).<br />\non I riniltions to A148yriOlOgy (Vol. IV).<br /><br />\nTerrestrial Magnetism (Vol VII ),<br />\niiiveri4ity Circulars (vol. XXII ).<br />\nProgrammes of the courses offered to graduate situ<br />\ndenim in Phi osophy and the Arts and in the department<br />\nor mv(lieltie, and also of the undergraduate or collegiate<br />\neourses, will be 14ell t 011 application to the Registrar.<br /><br />\nIn addition to the serials above 'mined, copies may<br />\nlie obtained of the works mentioned below:<br />\n1.(<br />\n1<br />\n.1ected PhysicalHn<br />\nPapers of<br />\nThe 717:<br />\nery A. Howland.<br />\nThe Critical Edit ion of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. Paul Him pt. Prompee<br />\ntrts on application.<br />\nHow land's Pied ogre pits of the Normal tolar Spcd 111111.<br />\ni0 plates. $20.00.<br />\n1 lescription of the Jehns Hopkins Hospital. .1. S. Billings, Editor. 11e pp. it°. 511 plates. $7.50 (.101 h.<br />\nThe Teaching of the A p(istles. Cemplete foe simile edition. Edited by .1. Itendel. I lands. 110 pp. ito. 10<br />\nplates. $5.00. ,<br />\nReproduction in Phototype of Sy rine MSS with A millie<br />\ngomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis Part I. Philology. Parts<br />\nI I -I II. Chemistry, Mineralogy and (iewohty. hats<br />\nI V-V-V I. Physics A sti()fenny m)1i Met hematics.<br />\nis VO. 30 cents Tel part.<br />\n-El full list of publications will be<br /><br />\n1,1311t<br /><br />\non application.<br /><br />\n, Communications in respect to exchanges and rein Mance%<br />\ni ma g he sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nOCTOBER 23, 1902.<br /><br />\nNo. 1.<br /><br />\nTHE POPULAR SONG.<br />\nr ANY persons think it an extremely difficult matter to write a popular<br />\nsong. As a matter of fact, few tasks are more simple. The rub comes<br />\nafter the song is written, and the real work consists in making a popular song popular. There is only one way under the sun to do this and that is<br />\nto let people hear it.<br />\nI have received hundreds of letters reading about like this:<br />\n\"DEAR MR. HAVRZ-I have just completed a song and want you to tell me<br />\nhow to make it popular. It strikes me as possessing all the catchy features of<br />\nthe present day 'hits,' and I don't see why it shouldn't be a go, etc., etc.\"<br />\nMy invariable reply is, \"Get someone on the stage to sing it.\" This is the<br />\ntrue secret of making a song popular. Just about ninety per cent. of the hits<br />\nof today in the song field are the most inane things imaginable, and anybody<br />\nWho would prophecy success for any one of them before it was produced would<br />\nbe voted crazy by a jury of his fellows; but the fact remains that the most<br />\nmediocre song in the world, if pumped into the public ear night after night,<br />\nwill make some kind of a hit.<br />\nNowadays, publishers pay actresses, excuse the word, for singing their<br />\nsongs. About fifty soubrettes were warbling \"Dolly Gray\" for' a specified<br />\nsum per week. The result was it made a hit. \"I must a been Dreamin'\" was<br />\nanother that had to be pushed with money. Yet it scored heavily. Both these<br />\nsongs were purchased by the publisher in a bunch of fifty or more ditties<br />\nacquired by a firm that failed, which were afterwards disposed of for almost<br />\nnothing.<br />\n\"Annie Moore,\" that nightmare of harmony, lay in a publisher's safe about<br />\nfive years before he thought fit to put it out. \"Hello, my Baby,\" was hawked<br />\nabout to many New York ,publishers, all of whom refused it, saying that it was<br />\nrot. It was finally sold to one publisher for $5, and when he bought it he<br />\nthought he had been buncoed.<br />\nA stranger with a bundle of songs stands as much chance in New York<br />\namong the publishers as a book agent. He is put off, told to wait, asked to<br />\nCome in again, or told the manager is busy and can't see him. I have seen<br />\nmany a sad sight in the New York publishing houses. Composers with really<br />\ngood material, anxious to play their work to the publisher, wait in vain for an<br />\nopportunity.<br />\nOn one occasion I was sitting in the private office of a large publisher when<br />\nthe outer guard, if I may so call him, entered and said that there was a young<br />\nman outside with three songs to submit. \"Tell him I'm busy or I'm out or in<br />\nChicago, or anything,\" said the publisher, and turning to me, continued:<br /><br />\nTi<br /><br />\nse<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\n\"You have no idea of the manner in which I'm bothered by these people.<br />\nWhy if I listened to all their rot I wouldn't have time to attend to any part of<br />\nmy business.\"<br />\nMy mission being ended, I went into the outer office and saw a picture of woe. The man who had asked for the publisher had a bundle of badly<br />\nsoiled songs under his arm. and a woe-begone expression on his face. Notwithstanding the fact that there was a heavy snowfall, his shoes were so worn<br />\nthat his toes protruded. I took him into one of the palatial rooms near by,<br />\nand motioned him to the piano. He drew his hands from his trousers pockets<br />\nand tried to play, but his fingers were numb with the cold. I sent out for some<br />\nbrandy for him and under its influence he was soon able to use his fingers. He<br />\nthen played three excessively pretty songs, which I insisted on the publisher<br />\nhearing. The result was that all three songs were accepted; one of them is at<br />\nthe present time a distinct hit.<br />\nHow different it is with a man or a woman who has written a successful<br />\nsong! The moment a successful song writer walks into a publisher's office, he<br />\nis almost hugged. His slightest word is eagerly listened to, and every comment<br />\nhe makes is carefully taken note of. Everything is done to make him comfortable, and be feels a degree of elation that is remarkable. All this because<br />\nhe has written something in the popular vein, and the publisher wants another<br />\nmoney-maker from him.<br />\nIt is a senseless method of procedure to publish a song anywhere except in<br />\nNew York City. That is the home .of the actor and singer. and consequently<br />\nthe stronghold of the publisher. It is a thousand to one bet that a hit cannot<br />\nbe made of a song except when it is published in New York<br />\nLast, but not least, no publisher will take up a song that is in any degree<br />\ncomplicated or \"good.\" The music must be commonplace and the words even<br />\nmore so. The publisher says: ''The public want trash; why not give it to<br />\nJEAN C. HAVEZ.<br />\nthem ?\" And there you are.<br />\nA PLEA FOR SIMPLICITY IN DICTION.<br />\nOW often are we imposed upon by the clang of cymbals and the clash of<br />\nsounding brass! How often the very makers of this noise deceive themselves! Writers and speakers are often prone to swell their periods with<br />\nhigh-sounding words, merely for the sake of sound. Not only is this to be found<br />\nin the speeches of the curbstone orator and of the ranting preacher, but even<br />\nin higher intellectual strata. Charlatans are more numerous in literary fields<br />\nto-day than they ever were in the time of the original magician. We have dross '<br />\nshowered upon us. We are stormed at until our ear-drums protest against the<br />\nstrain.<br />\nThere are two great reasons for the existence of this empty fiuff ball style<br />\nof language. The first is a desire to dress up in tinsel; the second cause, and<br />\nprobably the most usual, is the lack of cogent, logical thought upon the subject<br />\nmatter.<br /><br />\ng<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nIt is not surprising that a student who has just made his acquaintance with<br />\na number of \"large\" words should be anxious to exercise his vocabulary to its<br />\nfull extent. In a debate in our halls, a \"senator\" relieved himself of the following sententious bundle of words which had been weighing upon his mind:<br />\nGentlemen, we postulate our position under the orderly march of cumulative<br />\nfacts.\" Having howled this out, his face beamed with conscious pride, and his<br />\nchest was strained to its utmost capacity.<br />\nNor is the undergraduate the only one who seeks to impress his audience.<br />\nA graduate student of several years standing perplexed a seminary meeting by<br />\nusing the term \"altruistic individualism.\" \"Subjective-objectivity\" was once<br />\nventured in a lecture room.<br />\nNor again have we reached the limit to which this sin pervades our halls of<br />\nlearning. I have heard even worthy instructors upon \"off days\" spin out the<br />\nthread of their discourse so thin that it was in imminent danger of being worn<br />\nout in the process.<br />\nUpon one occasion while taking notes in a lecture, my mind wandered, and<br />\nmy note taking became merely mechanical. Upon reading the note-book over,<br />\nI found one simple proposition stated in six different ways.<br />\nOnce upon a time a Spaniard, without any knowledge whatever of the Ung•<br />\nlish language, attempted to translate with the aid of a bilingual dictionary the<br />\nClassics of his tongue into English. The result is most grotesque—a conglomeration of words thrown higglity-pigglity upon the page, full of sound but<br />\nmeaningless.<br />\nThis poor Spaniard knew no better, and may be pardoned with a pitying<br />\nsmile, but for the deliberate villian who stones us with mere \"words, words,<br />\nwords,\" no fate is too hard.<br />\nSometimes the long-winded, gorgeous-hued language conveys ideas worth<br />\ngetting, but one is very apt to be so engrossed in examining the wax flowers as<br />\nto miss the meaning, disproportionate as it is to the sound and length of the<br />\nexpressing medium.<br />\nA famous lawyer, while addressing a jury, having used all the epithetics<br />\nin the dictionary, hesitated a moment, and then added, \"this naufrageons ruffian.\" He was afterwards asked what the word meant, and replied that he did<br />\nnot know, but \"he thought it sounded well.\"<br />\nThat is the raison d'etre of so many a speech; sound instead of sense. Now,<br />\nIn our \"hurry up\" day, we have not the time to waste upon mere sound.<br />\nThose who enjoy it had better take themselves to a \"boiler shop.\" The<br />\nSpeech abounding in \"glittering generalities,\" which states the proposition<br />\nthat 2+2-4 in language worthy of Cicero, is aptly described by the slang expression \"hot air.\"<br />\nTo escape the charge of \"hot airing\" myself, I will drop my pen before<br />\nexhibiting too many examples of the evil I have been abusing.<br />\nR. M. D., '02.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nALUMNI.<br />\nHugh J. Jewett, Jr., was married on the 15th to Miss Anne Ingraham,<br />\nof Washington.<br />\nThe approaching marriage is announced of Dr. Thomas R. Brown to Miss<br />\nJeanne Albert, of Baltimore.<br />\nJoseph Mullen, Jr., was married yesterday to Miss E. W. Cocke, of<br />\n'95<br />\nSt. Louis. He is at present in the Engineering Corps stationed in the Indian<br />\nTerritor<br />\nDr. Wm. Whitridge Williams has been reappointed to the post of Assistant<br />\nin Pathology at the Harvard Medical School.<br />\n997<br />\nThe engagement is announced of F. Henry Baetjer to Miss Mary<br /><br />\n'92<br /><br />\nVarna11 Carey, of Baltimore.<br />\nYesterday, the 22nd, the marriage took place of Henry M. Wilson to Miss<br />\nTurner, of Charlotte, N, C.<br />\nCharles E. Lyon has been appointed to the post of instructor in German at<br />\nPrinceton University. He passed his examinatian for a Hopkins Ph. D. last<br />\nweek, and will receive the degree in February.<br />\nAlbert Carroll has sailed for South Africa, where he will combine business<br />\nwith pleasure by the preparation of illustrated magazine articles.<br />\nPowhatan J. Wooldridge is to be married on the 28th to Miss Margaret Cox, of Louisville, Ky.<br />\nVictor E. Smith, '98, who has been absent from the University for a year,<br />\nhas returned to his work in the Economics department.<br /><br />\n'98<br /><br />\nJohn H. King, who took his Doctor's degree in chemistry last spring<br />\nhas entered the Medical School.<br />\nHoward Baetjer has left the Boston Tech., and is now employed with<br />\n'00<br />\nthe American Bridge Company, at Wissahickon, Pa.<br /><br />\n99'<br /><br />\nLeonard L. Mackall has stopped his work at the Harvard Law School, and<br />\nhas gone to Germany, for a year, to study the language and literature.<br />\nWilliam M. James is now studying at the University of Virginia Law<br />\n'01<br />\nSchool. He writes: ``This place is all right, but-.' He reports himself as<br />\nprominent on the Musical Clubs of the U. Va..<br />\nLeyburn G. Fishach, who has been teaching at the Nautical Academy,<br /><br />\nEaston, Md., during the past year, has returned to the University for graduate<br />\nstudy in the Romance language department. He will work for a Ph. D.<br />\nJ. Gresham Machen is a student of the Princeton Theological Seminary.<br />\nLindsay 'C. Spencer, after having passed the Maryland University Law<br />\ncourse in two years, has been admitted to the bar, and is practising in the office<br />\nof Mr. E. J. Farber.<br /><br />\nTHE NEWS-LETTER.<br />\nLewis J. White is working for the B. &amp; 0. Railroad, in the Baltimore<br />\nTransportation Department.<br /><br />\n'02<br /><br />\nGibson E. Sisco is employed in the Pennsylvania Railroad shops at Fort<br />\nWayne, Ind. •<br />\nWilliam B. Hill is Assistant Auditor for the Maryland Casualty Company.<br />\nHe is now stationed in Milwaukee, Wis.<br />\nJ. P. Hand is back at the University, taking courses in Hebrew and Philosophy, with the intention of entering the ministry.<br />\nJohn G. Campbell has joined the faculty of McDonough School, McDonough, Md.<br />\n'03<br />\nThe list of \"Sometime Members' of the present Senior class has been<br />\nincreased by four during the summer.<br />\nFrank N. Iglehart is employed in the grain house* of Gill and Fisher.<br />\nCarroll Mason Sparrow has obtained a civil service post in the U. S. Coast<br />\nand Geodetic Survey. He is at present stationed on board the schooner<br />\n\"gagre,\" which is taking soundings on the Choptank river.<br />\nJ. M. Combs and Harry B. Snively have also left the University.<br /><br />\nDr. J. B. Crenshaw, Ph. D. '93, former instructor in athletics at the<br />\nUniversity, was married to Miss Julia Leach on October 18.<br />\nDr. Alfred W. Stratton, Ph. D., of the University in 1892, died of fever in<br />\nAugust 23, at Gulmar, India. At the time of his death Dr. Stratton was principal of the Oriental College of Lahore, and registrar of the University of<br />\nPunjah, India.<br />\nThe engagement is announced of Leroy Gresham, formerly a graduate<br />\nstudent in the University, to Miss Jessie Rhett, of Virginia.<br />\nRobert Garrett has discontinued his graduate work in the Economics<br />\nSeminary, and will live for a year at Princeton.<br />\nWin. H. Maddren, M. D., '01, is to be married to Miss Helen Howard, of<br />\nBrooklyn.<br /><br />\nKIND FRIEND: Come on, Jack, and go to bed; you're drunk and you'd<br />\nbetter go to sleep.<br />\nJACK: No, you don't. This jag has cost me $25 and I don't intend to<br />\nsleep it off.<br />\n\"That,\" said the pelican as Ile grasped the fish, \"will just about fill the<br />\nbill.\"—Cornell Widow.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 22, 1902.<br />\nSubscription $1.50 per year.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\nROBERT S. LANIER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nSoLomoN BLum, 1903.<br />\n.<br />\nGEORGE A. FOSTER, 1904.<br /><br />\nREGINAL'D S. OPIE, 1904.<br />\nW. S. BIRD 1908.<br />\nHARRY BAETJER, 1903.<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 898, Medical School of Johns Hopkins Hospital.<br /><br />\nN making its bow for the season of 1902-1903, THE NEWS-LETTER would<br />\nlike to improve the occasion with a few words.<br />\nFirst of all, to the entering classes. THE NEws-LnTTER is the only<br />\nstudent periodical publication of the University. It has to combine, in greater<br />\nor less degree, the features of a news weekly, a literary monthly, and a comic<br />\npaper. In preparing and stirring up such a mixture, the editors have their<br />\ntroubles. The recompense they are looking to is your hearty support, not<br />\nonly with your subscriptions, but in no less degree with contributions of matter suitable for publication.<br />\nNext, to our critics. It is true that criticism is a salutary thing; the editors fully realize this, and are duly thankful for having been saved so often.<br />\nBut we cannot help thinking sometimes: If you are so solicitous about the<br />\nreputation of the paper, why don't you help to improve it? The little trouble<br />\nneeded to jot down and hand in the idea for an article, sketch, or poem, would<br />\nvery often bring about an attractive feature in the next number. And to those<br />\nfew,—for there are a few,—who confess to a lack of immediate interest in the<br />\npaper, we would say: Did you ever think that the THE NEWS-LETTER iS exchanged to most colleges of note in the United States and Canada, and that<br />\nfrom it many men in these colleges will get their idea of the quantity and<br />\nquality of spirit in our undergradnate life? If you have at heart, in the slightest degree, the reputation of the college, you will put some little effort into<br />\nhelping its official representative abroad.<br /><br />\n3<br /><br />\nTHE NEWS—LETTER.<br />\nFinally, to our friends. The appearance of the sheet is changed somewhat,<br />\nand it is intended to have a different cover with each issue. The paper is circulating more widely among the alumni, and for this reason it is desired to enlarge the colutim of alumni news much as possible. In getting ideas and notes<br />\nin these departments, we ask for the same cordial co-operation that you have<br />\nshown us so often in the past.<br />\nWO places are open to candidates on the Board of Editors. One, for a '05<br />\nman, is the post of assistant athletic editor; the other, that of assistant<br />\nbusiness manager, which leads to the business managership next year,<br />\nand is, therefore, open to all Juniors, For information about the work to be<br />\ndone in getting these places, apply to any of the board.<br /><br />\nZ<br /><br />\nHE question of the existence of a 1902 foot-ball team is the first that will<br />\noccupy the attention of the newly elected Athletic Board. Since 1897,<br />\nthe University has had a team each season, and it has always been well<br />\nsupported and creditable. This year, however, the prospect is very doubtful.<br />\nThere are not more than half a dozen men in the undergraduate department<br />\nwho are up to the standard of a Hopkins team, and some difficulty has been experienced in making up the number at the medical school. It would seem that<br />\namong our entering class of 101, from colleges in every part of the States, a few<br />\nenthusiasts could be found. But the change in the schedule of the first-year work<br />\nis keeping the class so busy that even the most enthusiastic dread to lose from<br />\ntheir courses the time of steady foot-ball practice. Captain Blanck and those<br />\nwho have the welfare of the team at heart are, of course, unwilling to have the<br />\nUniversity represented by light, inexperienced players, who would prove easy<br />\nmarks for our opponents. Mr Garwood, the coach for this year, is confident<br />\nthat he can produce the necessary men from the Medical School if some enthusiasm is shown on this side of town. And so the matter stands. The decision<br />\nof the Athletic Board will be announced this afternoon. If it is for the team, it<br />\nwill then be \"up to\" every student who has the slightest ability to get on his<br />\nfoot-ball clothes and attend practice regularly. Every effort will be needed, for<br />\nour honor will be at stake.<br /><br />\nC<br /><br />\nHE prospect of a Hopkins athletic field is one that opens to our view every<br />\nfall, and disappears with the same regularity in the summer. But this<br />\nyear it really seems that something will be done, President Remsen, at<br />\nthe Freshmen reception, announced that the trustees had in mind the project<br />\nof using some part of the Homestead grounds as an athletic field, and that the'<br />\nmatter was being attended to as rapidly as circumstances permitted. Moreover,<br />\nthe report of ex-Treasurer Gillespie, of the Athletic Board, read at the election<br />\nby Mr. Abercrombie, showed that the prosperous lacrosse season last spring<br />\nhad added $780 to the $1173, which then constituted our athletic field fund, so<br />\nthat there is now in bank a balance of $1953 for this purpose. It seems more<br />\nthan possible th;it the lacrosse games next spring can be played on our own<br /><br />\nt<br /><br />\ncampus.<br /><br />\nTHE N EWS—LETTE R,<br />\nT one of the gentle controversies with which Freshmen and Juniors have<br />\nrecently been delighting all beholders, some Seniors present called for a<br />\ncessation of hostilities, after matters had proceeded to a gory and dusty<br />\nclimax. Much to the surprise of all present, a few revolutionary spirits announced that it was their own affair, and that no interference was wanted, so<br />\nmuch so that a little physical suasion had to be applied until the rest of the<br />\ncombatants filed out. This attitude of the underclassmen is by no means a<br />\nnew one, but it is none the less thoroughly mistaken. Because the Senior's<br />\nparticipation in such affairs is no longer active, it does not follow that he is a<br />\n\"has-been,\" and should show no interest. It is his duty, no less than his inclination, to be on hand at all class troubles, and to be responsible for their<br />\nproper conducting. He has been through it all; he has sprawled in defeat, and<br />\ncrowed in triumph, and no one knows better when there has been enough. At<br />\na Northern college visited by the writer this fall, there was an unwritten law<br />\nthat no hazing should take place without the presence of an upperclassman.<br />\nThe principle illustrated is the right one. There should be no repetition of the<br />\nspectacle of Seniors exerting force to show their authority.<br />\nFOR THE UNDERGRADUATE.<br />\n.T the first meeting of the year of the Junior class, the following officers<br />\nwere elected: Thomas S. Strohbar, president; R. Gordon Dulaney, vicepresident; J. C. L. Hawkins, secretary; W. L. LeCron, treasurer; R.<br />\nS. Opie, historian; H. S. Evans, sergeant-at arms. For the football team, Sifford Pearre was chosen captain, and G. A. Foster manager. Two new members<br />\nof the class were elected: H. S. Evans, of Lehigh. and H. B. Heald, a former<br />\nstudent of the University. The Yell Committee is Licking, Crozier, and Foster.<br /><br />\n11<br /><br />\nDr. J. S. Ames has decided that no more Freshmen will be permitted to<br />\nenter the class in Minor Physics. A large percentage of the students who have<br />\nfailed in this course during recent years have been Freshmen, and so it has<br />\nbeen arranged that those desiring to enter it must previously spend at least a<br />\nyear in the enlightening atmosphere of the University.<br />\nAndrew D. Jones. Jr., who had been absent from the University for several<br />\nyears, has returned to work for his bachelor's degree.<br />\nH. K. Tootle, '03, has accepted the position of Mopkins correspondent of<br />\nNews, and will receive subscriptions for the same.<br />\nIntercollegiate<br />\nthe<br />\nThe special examination for Freshman scholarships resulted fortunately<br />\nfor the following men: G. Pausch, B. A. Bernstein, S B. Cohen, W. H.<br />\nHudgins, H. V. Morse.<br />\nThe Senate Senior Debating officers are as follows: W. W. Ammen, leader<br />\nof the Government; J. B. G. Custis, leader of the Opposition; John A. Addison,<br />\nsecretary; F. C. Blanck, sergeant-at arms. The first debate, on October 29th,<br />\nwill be on the subject: \"Resolved, That the coal operators were justified in rejecting the proposition made to them by the Mine Workers Union at the Wash-<br /><br />\nAPI<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nington conference.\" For the affirmative, Plaggemeyer, Pagon, and Murkland<br />\nwill speak; for the negative, Blum, Strayer, and one unchosen. The House of<br />\nRepresentatives (Junior Debating) officers are: R. S. Licking, speaker; J. C.<br />\nL. Hawkins, speaker pro tern.; J. R. B. Branch, secretary; S. Erlanger, ser<br />\ngeant-at-arms.<br />\nThe Freshman class elections resulted in the choice of the following men:<br />\nLawrence Wroth, president; Robertson Griswold, vice-Piesident; Walter<br />\nBaetjer, secretary; R. N. Jackson, Jr., treasurer; Wallace Murkland, historian; W. R. Straughn, poet; Lurrnan Stewart, sergeant-at arms. Clarence<br />\nStone was appointed temporary captain of the football team.<br />\nThe Hullabaloo Club is to have the first \"blow-out\" in its new quarters,<br />\n605 N. Eutaw Street, on Monday night. The committee announces that the<br />\nrooms will be furnished with chairs, clay pipes and a piano—the bare essentials of a good time. Luxuries, such as velvet footed waiters, potted plants,<br />\nand a permanent orchestra, will appear by degrees, as the treasury is in a<br />\nflourishing condition.<br />\nThe new course in Major Economics, under Dr. J. H. Hollander and Dr.<br />\nGeo. E. Barnett, is being well attended by those who wish to add to their<br />\nknowledge of the distribution of wealth, and also to learn a little something of<br />\nits production.<br />\nThe high ideals brought on by higher education were well exemplified in<br />\nan occurrence last week. A Senior lost a pocket book containing $3 50. In<br />\ndesperation, he tried the last chance of a notice on the bulletin board. To his<br />\nsurprise and joy, the missing wallet was returned by a graduate student, and<br />\nwhen opened was found to contain $3.49.<br />\nIn spite of the assertions in our reliable daily contemporaries, E. C. Hill,<br />\n'02, president of the Musical Clubs, did not accompany Manager R. C. Pagon,<br />\n'03, on his trip to Norfolk last Friday, to arrange for the Christmas trip of the<br />\nClubs.<br />\nMembers of the Press Club this year are as follows: Win. M. Hunley,<br />\n'03, the Sun; Wm. S. Bird, '03, the Herald; H. K. Tootle, '03, the American;<br />\nZ. M. Ballard, '98, the News.<br />\nThe exact figures of undergraduate registration have been given out. Out<br />\nof a total of 63 entering students, 8 go to 1906, 54 to 1905 and 1 to 1904. Last<br />\nyear's sub Freshmen numbered five, which gives a total of 59 for the Freshmen.<br />\nContributions for the 1903 HULLABALOO may be handed in to Box 374.<br />\nSketches, songs, stories, individual and general satire, are all welcome.<br /><br />\nSUNDAY SCHOOL THACHER—\"And so Lot's wife was turned to salt.<br />\nany one tell why?\"<br />\n.WILLIE (from the rear)—\"She was too fresh.\"—Harvard Lamfioon,<br /><br />\nCan<br /><br />\nit)<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHE NEW ATHLETIC BOARD.<br />\nN Friday, October 17th, the annual election of officers of the General Athletic Association was held in Hopkins Hall. A very good attendance<br />\nwas noted, and no particular incident marred the ballot. The result<br />\nwas as follows: Ronald T. Abercrombie, President; W. Sellman Bird, VicePresident; Joseph T. Smith, Corresponding Secretary; B. L. Pessagno, Recording Secretary; W. E. Hoffman, Treasurer; Dr. E. Renouf and Prof. Wm M.<br />\nMackdermott, Faculty atlegates; Dr B. B. Lanier, Alumni Delegate; H. B.<br />\nStone, Medical Delegate; H. A. Converse, Graduate Delegate; R. C. Hoffman<br />\nand Fred. C. Blank, Senior Delegates; Pearre and Porter, Junior Delegates;<br />\nStone, Freshman Delegate.<br />\nThe official '`II\" was awarded to W. L. Lindsay, R. C. Hoffman, H B. Stone<br />\nand H. K. Tootle, for track and field work. \"H. A. A.\" was awarded Porter, LeCron, Emig and Branham.<br /><br />\nO<br /><br />\nTRACK AND FIELD.<br />\nAt such an early date, very little can be said regarding track and field<br />\nprospects for the coming year. Judging from numbers and appearances, however, Hopkins should be able to perform the same \"stunts\" at the local track<br />\nand field contests held during the winter and spring.<br />\nCaptain R. C. Hoffman called a meeting of candidates last week and 36<br />\nchesty men responded. The large majority were new men, but most of these<br />\nwere very prepossessing in appearance, and some good material should be<br />\ngotten out of their midst.<br />\nNext light work will begin consisting mainly in using the gymnasium apparatus and learning points about the all-important start. It will take hard<br />\nsystematie work to develop men to take the iplaces of such cracks as Riggs,<br />\nScholl, Lindsay and others, but \"Curzon \"is known as a conscientious hustler<br />\nand may be depended upon to \"get busy\" and keep it up<br />\n\"Bill \"Hoffman and \"Joe\" England are still beneath the Black and Blue<br />\non the other side of town and may be depended upon to help in every possible<br />\nway. Harvey Stone is also among the\"meds.\" Altogether the prospects in<br />\ntrack and field work are fairly good. It is not likely that a J. H• U. meet will<br />\nbe held before January, but something has already been said about a set of<br />\ngames between the Senior, Junior and Freshman classes. All sorts of events<br /><br />\nI<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nare proposed and the grand finale is to be a relay race to be crowed over in the<br />\ntrophy room each year by the victorious class. The idea seems to be a good<br />\none and it might be well for the classes to consider the matter.<br />\nFRESHMAN -JUNIOR FOOTBALL.<br />\nHE apparent lack of 'Varsity football material seems to have brought the<br />\n• candidates for the Junior and Freshman class teams into prominence. In<br />\nformer years very little has been done toward organizing class teams<br />\nuntil the end of the 'Varsity schedule. The fact that there may be no schedule<br />\nthis year probably accounts for such early action among the Juniors and the<br />\nFreshmen. From such indications the annual clash shoula be unusually interesting.<br />\nFollowing are the men who have handed in their names as candidates for<br />\nthe class teams : Juniors—Branham, Peat-re, Rosenfeldt, Foster, Strohbar,<br />\nEmig, Crozier, Lewis, Evans, Licking, Erlanger, LeCron, Porter, Rosenheim,<br />\nKohn.<br />\nFreshmen—Boyce, Wroth, Stone, Hudgins, Goldman, Hacket, W. Baetjer,<br />\nDill, Bowie, Jacobs, Campbell, Mifflin, Straughn.<br />\nShould it be decided to give up a 'Varsity eleven for the present season, the<br />\nclass game will be played earlier than usual.<br /><br />\nt<br /><br />\nA LOVE SET.<br />\nLove is but a game of ping-pong,<br />\nSometimes filled with ups and downs,<br />\nOften but a dreary sing-song,<br />\nSometimes smiles and sometimes frowns.<br />\nThere are some games which are boring,<br />\nOther games are played quite well,<br />\nAnd the system used in scoring<br />\nFinds in life a parallel.<br />\nFifteen-love is very silly,<br />\nWith a sweetness sickening;<br />\nThere's no thought that life is hilly,<br />\nOnly love is the real thing.<br />\nThirty-Love is warm and tender,<br />\nNuw's the time to woo and win.<br />\nEven if the purse be slender<br />\nTake her—let the game begin.<br />\nForty-Love is ripe and mellow<br />\nWith a happy, genial glow,<br />\nBeing now a staid old fellow<br />\nMatrimony's voted slow.<br />\nHe is done for now—he's fifty,<br />\nTake ono glance and close the book;<br />\nCreeping age has made him thrifty,-He is married to his cook.<br />\n- '03,<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br />\nALMA MATER.<br />\nWe sing a song of youth and golden days spent<br />\nIn cloistered shades of learning rare,<br />\nWe sing a song of youth and silvery nights rent<br />\nBy wassail shout and discord's blare.<br />\nWhile hearts are young and blood flows thick and fast, then<br />\nNo motives base our friendships stain;—<br />\nWe gather now the moments that will last, when<br />\nAll else is gone, they will remain.<br />\nCHORUS:<br />\nThen, Alma Mater, Mother of our Youth,<br />\nTeaching wisdom, manliness and truth:<br />\nFor thee there beats in every breast<br />\nThe truest, loyalest, and best:—<br />\nBeside thee what care we for wine, and women, and the rest.<br /><br />\nAir:<br /><br />\nThe hasty flight of years we will not now mourn,<br />\nBut lightly take our little fling;<br />\nSome day we'll miss in loneliness our friends gone,<br />\nFor life is not eternal spring.<br />\nYet, when we wake to find no quicker heart-beat<br />\nFrom hope or love or joy or pain,<br />\nWe'll keep the soul alive and Father Time cheat,—<br />\nOn memories grow young again CHORUS:<br />\nJ1'u njeivlj, .fiatieula.<br />\nJOHN M. BOOKER, '01.<br /><br />\nTHE TOAST WE DRINK TO-NIGHT.<br />\nIf you've ever seen a college<br />\nin a Southern city fair,<br />\nWhere seekers after knowledge<br />\nand good-fellowship repair;<br />\nIf you know its fame from Sea to Sea,<br />\nits future's promise bright,<br />\nThen you know the Hopkins 'Varsity,<br />\nthe toast we drink to-night!<br />\nIf you've ever seen twelve hefty men<br />\nwho check and dodge and throw,<br />\nWho've vanquished Swarthmore, humbled Penn,<br />\nand laid the Crimson low;<br />\nIf you've seen the banners that proclaim<br />\nour champions' skill and might,<br />\nThen you know lacrosse, the Hopkins game,<br />\nthe toast we drink to-night!<br />\nIf you've ever seen a pretty maid<br />\ngo tripping on her way,<br />\nAnd niarked the Black and Blue displayed<br />\nin flutt'ring ribbons gay;<br />\nIf your heart and head are set awhirl<br />\nby smiles and glances bright,<br />\nThen you know the loyal Hopkins girl,<br />\nthe toast we drink to-night!<br />\nROBERT S. LANIER, '08.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nTHE MUSICAL CLUBS.<br />\nClubs are very fair. FinanHE prospects of a good season for the Musical<br />\nion for the two years past,<br />\ncially, the clubs have been in excellent condit<br />\nssiveness of its imme •<br />\nprogre<br />\nand if the present management displays the<br />\nsuch an organization<br />\nof<br />\nss<br />\n(hate predecessors, all will go well. The final succe<br />\nrmances at the con<br />\nperfo<br />\nof its<br />\nalways depends, however, upon the character<br />\nand quality of the<br />\nity<br />\nquant<br />\nthe<br />\ncerts; which, in turn, is regulated entirely by<br />\nis in the hands of<br />\nr<br />\nmatte<br />\nthis<br />\nmaterial at the disposition of the leaders. And<br />\nn Freshmen<br />\n-doze<br />\nhalf-a<br />\nthe students. At the first Glee Club rehearsal, barely<br />\nr. It must<br />\nnumbe<br />\nthis<br />\ntimes<br />\nfour<br />\nwere present; there should have been three or<br />\nback at the<br />\nare<br />\nas<br />\nrs<br />\nmembe<br />\nnot be thought that, because such of the former<br />\nd on the<br />\nwante<br />\nblood<br />\nnew<br />\nno<br />\nUniversity have their places assured, there is<br />\nare the<br />\nthey<br />\nsince<br />\nd,<br />\nwante<br />\nClubs. It is the underclassmen who are especially<br />\nin the<br />\nthem<br />\ne<br />\nmanag<br />\nand<br />\nmen who will grow up with the Clubs, and will lead<br />\nyears to come.<br />\n35, and was rushed<br />\nThe first Glee Club rehearsal was attended by about<br />\n\"University Ode\"<br />\nThe<br />\nstyle.<br />\nthrough by Leader Carver in the most approved<br />\nand recognizaiastic<br />\nenthus<br />\nand \"Black and Blue\" were, if not finished, at least<br />\n1902 medThe<br />\nsals.<br />\nrehear<br />\nble, which is more than could be said of most first<br />\nstart.<br />\ngood<br />\nhis<br />\non<br />\nd<br />\ntulate<br />\nley is now in preparation. Mr. Carver is to be congra<br />\nay<br />\nTuesd<br />\non<br />\nsals<br />\nrehear<br />\nThe Banjo and Mandolin Clubs held their first<br />\nenterthe<br />\nfrom<br />\nup<br />\nd<br />\nturne<br />\nnight. Many new candidates for the Mandolin Club<br />\n. The Banjo Club will be<br />\ning classes, including several mandolins and a violin<br />\nmedical student who has<br />\nmuch helped by the presence this year of a first year<br />\nplayed for four years on the Yale Club.<br />\nIt is to be \"Down the<br />\nThe Christmas trip is a new departure this year.<br />\niment, but it is felt<br />\nexper<br />\nan<br />\nBay\" to Norfolk and Richmond, Va. This trip is<br />\nthat it will prove a great succes.<br />\nfor Friday evening. Decem<br />\nThe Opera House at Norfolk has been engaged<br />\nto receive the visitors.<br />\nber 30th, and elaborate preparations will be made<br />\nlk, Va., and we trust<br />\nThe University has a great many admirers at Norfo<br />\nrs to greet the Musical Clubs.<br />\nand feel that they will turn out in great numbe<br />\ngements with the Chesapeake<br />\nR. C. Pegon, ('03,) Manager, has made arran<br />\nthe transportation, and the<br />\nSteamship Company, \"Chesapeake Line,\" for<br />\nChism, General Ticket Agent, and<br />\nspecial courtesies extended by Mr. E. J.<br />\nAgent, in offering low rates is<br />\nMr. T. H. McDannel, Traveling Passenger<br />\ngreatly appreciated.<br />\nhave friends in Norfolk and<br />\nIt is asked that all Hopkins students that<br />\nencourage their friends to visit<br />\nRichmond will write to them and ask them to<br />\nClub.<br />\nthe Opera House on December 30th, to greet the<br />\nof the Club to have as<br />\nement<br />\nmanag<br />\nthe<br />\nof<br />\nwish<br />\nIt is also the desire and<br />\ncan conveniently arrange to go.<br />\nmany men accompany the Club on the trip as<br /><br />\nt<br /><br />\nblank in this copy.<br />\n*Please fill out and return the subscription<br /><br />\nTHE NEWS-LETTER.<br />\nII I 11 11111111111111111111 111111111111 11111111111111 11111 1 1<br /><br />\n1 1 1 Iii 1 I/ 1 1 I 11111111111111111 1111 1 111111110 111111111 1 1U111 11111 1<br /><br />\n10110111<br />\n,<br /><br />\n•<br /><br />\n,<br /><br />\n7,,mElMillimaritiamillininuritIgnithilinthitIliguatilliliillainiiifigulAhunnignniu<br /><br />\n1/<br /><br />\nILA<br /><br />\n11TER a year's leave of absence spent in studying in France, Spain and<br />\nItaly, Dr. Philip Ogden has returned to the University to resume his<br />\nwork as instructor in French.<br /><br />\nThe Geographical Society of Baltimore, organized on Friday last at the<br />\nhome of ex-president D C. Gilman, has among its offic rs Dr. D. C. Gilman,<br />\npresident; Mr. Robert Garrett, treasurer; Dr. Geo. B. Shattuck, secretary.<br />\nThe object of the Society is the diffusion of geographical knowledge of every<br />\nkind, with especial reference to the commercial needs of Baltimore.<br />\nThe first meeting of the Pedagogical Society was held on Wednesday,<br />\nOctober 15. The object of this society is to interest and instruct all Hopkins<br />\nmen who intend to engage in pedagogical work. The meeting, which was<br />\nattended by fourteen students representing the graduate department and the<br />\nsenior class, was opened with an address by Dean Griffin, in which he outlined<br />\npossible methods of work, and assured the society of the sympathy and cooperation of the faculty. The following officers were elected: President, C. C.<br />\nGrove, grad.; vice-president, W. E. McDonald, grad.; Secretary, G. D.<br />\nStrayer, '03.<br />\nFACULTY VACATIONS.<br /><br />\nT<br /><br />\nRESIDENT REMSEN spent the summer months at his country home in<br />\nMaine. He found time to revise his book on organic chemistry, and the<br />\nmanuscript is now in the hands of the publishers.<br /><br />\nDr. A. Marshall Elliott, director of the department of Romance Language,<br />\nwas taken ill during his stay in London. On his recovery he rested awhile<br />\nin<br />\nsouthern France.<br />\nDr. Henry F. Reid, professor of Geological Physics, was in<br />\nSwitzerland,<br />\nwhere he made a special study of the Swiss glaciers.<br />\nDr. James W. Bright, head of the English department, remained in<br />\nBaltimore during the vacation.<br />\nDr. Wm. B. Clark, professor of geology, passed the summer months in the<br />\nNew England States.<br />\nDr. Maurice Bloomfield spent a month in Vienna, where<br />\nhe completed his<br />\nwork on\"A Concordance of the Vedas,' after which be visited other<br />\ncities on<br />\nthe continent.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nsummer sketchMr. S. Edwin Whiteman, instructor in drawing. passed the<br />\ning on Long Island Sound.<br />\nGermany<br />\nDr. Wm. Kurrelmeyer, of the Germanic department, was in<br />\nthe time<br />\nbefore<br />\nextant<br />\nn<br />\nBibles<br />\nstudying and collecting the texts of the Germa<br />\nof Luther.<br />\nDr. Paul Haupt travelled in Germany during the vacation.<br />\nDr. Wm. H. Browne was in West Virginia during the summer.<br />\nr in northern<br />\nDr. Roscoe Guernsey, instructor in Latin, spent the summe<br />\nNew York.<br />\nnia and<br />\nDr. Henry Wood, professor of physics, travelled through Califor<br />\nother Western States.<br />\nDr. Kirby Smith was at his country home in Carroll county.<br />\nDean Griffin passed the summer in the White Mountains.<br /><br />\nY. M. C. A.<br />\nl and four<br />\nOPKINS had three graduate, four undergraduate, two medica<br />\n27 to July<br />\nJune<br />\nence,<br />\nprep school men at the Northfield Student Confer<br />\nce on<br />\neviden<br />\nin<br />\nmuch<br />\n6. The Black and Blue and Hopkins yells were<br />\nlast<br />\nof<br />\ncut<br />\nfine<br />\nvery<br />\nbore a<br />\nall occasions at the camp. The camp letterheads<br />\ng<br />\nor<br />\nLickin<br />\nSmith,<br />\nJoe<br />\nn,<br />\nyear's camping party. Ask Edmunds, Graff, Addiso<br />\nEmrig about the good time.<br />\nBible readings were<br />\nJoining with Dartmouth and Vermont, a series of daily<br />\nr. Our own comsumme<br />\nthe<br />\nfor<br />\nrs<br />\nreprinted from Yale's list and sent to membe<br />\nmonths of Unithree<br />\nfirst<br />\nthe<br />\nfor<br />\nmittee did good work in preparing a series<br />\nversity work.<br />\nTopic cards for October are also out.<br />\nare invited to attend.<br />\nMorning prayers are held as usual at 8.45 and all men<br />\nThey are making a good start.<br />\ng was led by Dr. Kelly<br />\nThe 5 o'clock Tuesday afternoon devotional meetin<br />\nthe Northfield delegation on<br />\non October 14th, with attendance of 43, and by<br />\nOctober 21st.<br />\nwas very pleasant and<br />\nThe reception at Mr. Leverity2's on Friday, the 17th,<br />\nclass and graduate department<br />\nthe work well organized. Bible classes for each<br />\nMission study course will be<br />\nwill arrange most convenient time for meeting.<br />\ncarried through the year on India and the Philippines.<br />\non Saturday with a<br />\nThe social settlement work at Lawrence House opened<br />\nnight.<br />\nns<br />\nHopki<br />\nbe<br />\nwill<br />\ngood number of workers. Saturday night<br />\nin the Association.<br />\ny<br />\nactivit<br />\nus<br />\nreligio<br />\nHere are a number of opportunities for<br />\nThe officers are<br />\n.<br />\nfailure<br />\nor<br />\ns<br />\nIt is up to every member to make them a succes<br />\nnot responsible for all of the work.<br /><br />\nTHE NEWS-LETTER.<br />\nIN THE GOOD OLD SUMMER TIME<br />\nJUNIORS.<br />\nBranch spent a short time in New York and a long time in Maryland.<br />\nBuckler laid the foundations of his fortune at the Carnegie Steel Company,<br />\nPittsburgh.<br />\nCator golfed during the summer at Sudbrook.<br />\nDulaney, after idling through the weary days at Atlantic City for a while,<br />\nfaded away to Magnolia, Mass., and Portland, Maine.<br />\nEmig studied in Baltimore most of the summer. He attended the Northfield Conference.<br />\nErlanger and Rosenheim adorned the rural society of Lake Sebago, Maine.<br />\nWallace was accompanied by an engineering corps through Western Pennsylvania.<br />\nStollenwerck was at his home in Alabama.<br />\nHumrichouse canoed on the Potomac.<br />\nEvans, who went to Lehigh last year, has entered the Junior class. During<br />\nthe summer be traveled through Colorado.<br />\nOttomar Fuerbringer recuperated at Saginaw, Michigan.<br />\nMaynard summered on his estate in Caroline County.<br />\nShapiro passed the summer in impressing upon certain youths the fact that<br />\nhis knowledge was vaster than theirs.<br />\nPorter glided through the warm weather at Emory Grove.<br />\nAustrian and Rosenfeld conferred the honor of their presence upon Atlantic<br />\nCity.<br />\nPearre sailed, yachted and fished around Nova Scotia.<br />\nStrohbar \"went to Halifax\" on a schooner.<br />\nLeCron worked for the United Fruit Company.<br />\nSENIORS.<br />\nGlocker spent the vacation near Frederick, Maryland.<br />\nHaughton summered at Cape May, New York.<br />\nAmmen rusticated on the Eastern Shore and in Virginia.<br />\nJ. Smith attended the Northfield Conference and spent the remainder of his<br />\ntime at Eaglesmere.<br />\nBaldauf was most of the time at his home in Henderson, Kentucky.<br />\nDochez toured Europe.<br />\nToms spent the summer at Braddock's Heights, Maryland.<br />\nPlaggemeyer traveled the Middle West. He visited St. Paul, Chicago and<br />\nMinneapolis.<br />\nBamberger and I3lum spent six weeks of the summer at Cornell and the<br />\nremainder in Center Lovell, Maine.<br />\nHildt was at Fishkill on-Hudson.<br />\nStrayer remained in Baltimore and tutored. .<br />\nStraus spent most of the summer at Lake Sebago, Maine, and then went to<br />\nBuena Vista<br />\nHazelhurst was in Europe.<br />\nTootle stayed at his home in Missouri.<br />\nBryan spent his summer in battling with typhoid.<br />\nHendry was in Washington and Frederick.<br />\nTownsend was in Baltimore part of the time and the remainder of the<br />\nsummer in Snow Hill.<br />\nLather enjoyed himself in the Adirondacks.<br /><br />\n4<br /><br />\nDrovers &amp; Mechanics Nat'l Bank,<br /><br />\nSTIEFF PIANOS<br /><br />\nOF BALTIMORE. MD<br />\nMADIC OF THIC<br /><br />\n'LS MONICY<br /><br />\nAND ICX1.11:121ENCIC(AN<br /><br />\n• CAPITAL STOCK, $300,000.<br /><br />\nBUY.<br /><br />\nWAREHOOM410<br /><br />\nN,<br /><br />\nSURPLUS &amp; PROFITS, $375.000.<br /><br />\n1.4.11114.1RT<br /><br />\n41F- Transacts a General Banking Business.<br /><br />\nNC ST.<br /><br />\nGUSHING ScGOMPANY'<br /><br />\nBooksellers and<br />\nStationers.<br />\n34 W. BALTIMORE STREET.<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKelp eonsta liE y on hand the Text Books used<br />\nIn .1 oiin Hopkins Foiversity and the woman's<br />\nI !ollege of Baltimore<br />\n91,<br />\nAle<br />\n*<br />\nSTATIOMBRY For School. farniiii, Office and Bank.<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books. Note Books,<br />\n.<br />\nillad/S0t/ eg<br />\nStudent's Suurlies.<br /><br />\nHaberdashers,<br />\nShirts, Nea1 wear,Underwear<br />\n11111111111111111=11111111111.11111111111111.1.111111. Hosiery, Etc.<br />\nSHIRTSTO ORDER A SPECIALTY.<br /><br />\nIlgenfritz Studio<br /><br />\nTHOS.BLAKE CO<br /><br />\nOn Bale The 3. If II. l'omettritg,[yid ail other College<br />\nl'emiants.<br /><br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURER<br /><br />\nHoward Sts.<br /><br />\nSiweessor to Cummins.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nFOR<br /><br />\nADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br /><br />\nOF<br /><br />\nOrech letter fraternal? jeweirr,.<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\niplcroe Call ant+ Examinc our line IBefore Vurchasinit.<br /><br />\n1.6ORT &amp; LOUISA&amp;<br /><br />\nSTS.<br /><br />\nPUBLISHERS.<br /><br />\nTHE NEWS LETTER<br />\nIS FROM THE<br />\nPRESS OF<br /><br />\n• 7?:24,4,-\"<br /><br />\nPRINTERS<br /><br />\nC'e2..e.<br />\nN,Ilt I f e,<br />\n*<br />\nri I (,(111 fiAl!UAW..A<br /><br />\nBA 1:11,A1,:2111. „Yd.)<br /><br />\nAND<br />\nSTATICNERs<br /><br />\nNORTH GERMAN<br />\nLLOYD S. S. 60.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nNew York to Brennm, London, rails, Gibraltar, Naples, Genoa, Etc.,<br />\nBALTIMORE TO BRE,MEN DIRECT.<br />\nFor partItallars a pull' to<br /><br />\nft. S6HUM116tIER Sc GO., General Agents.<br />\nBE314)rAi, NOTICE,<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS'. HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\n73altirnore, Md.<br /><br />\nThe attention of the Students of the University<br /><br />\nlE4<br /><br />\nthroated to the feet that the Thos. Blake Co., have<br />\nremoved their I kmts' Furnishing Store to 219 K. Baltimore St. Their ad vertisment will be found elsewhere<br />\nIn this lio.ne.<br /><br />"}], "field_media_file": [{"target_id": 36237, "display": null, "description": null, "target_type": "file", "target_uuid": "2dfd00e8-b6d1-4479-9c07-3026c2e67463", "url": "http://digital.library.jhu.edu/system/files/2022-03/12218-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12218, "target_type": "node", "target_uuid": "a1fcf875-ed8d-48f6-88e9-dc4cd6337ebe", "url": "/node/12218"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "63ed8efb-251e-4228-8a35-8f249533ee57"}]}