{"mid": [{"value": 36833}], "uuid": [{"value": "175c2c97-d87b-48c5-a61e-bf82a7cad891"}], "vid": [{"value": 36833}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13052-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "'e.<br />\n<br />\n3<br />\n<br />\nVOL. XXVII. No. 38<br />\n<br />\nBALTIMORE, MD., MARCH 13, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nCARRIES OFF TOP<br />\nMUSICAL CLUB GIVES FIFTH TRIANGULAR 6EB E POST- DEAN LATANE CALLS HALT COACH VAN ORMAN MAK- RUTGERS<br />\nHONORS<br />\nAT EASTERN<br />\nING PLANS FOR BASKETON ABSENCES FROM<br />\nPONED BECAUSE OF EXCONCERT OF SEASON AT<br />\nINTERCOLLEGIATES<br />\nBALL TEAM<br />\nASSEMBLY<br />\nAMINATIONS<br />\nWESTMINSTER<br />\nof Team Next Year Johns Hopkins Finishes Second.<br />\nPossibility<br />\nWestern Maryland College Host Hopkins to Participate at Lexing- Objects to Disorder and Bad AtClose Races in Order. Von<br />\nPlenty of MaGood.<br />\nSeems<br />\ntendance. Criticism Well<br />\nton and Homewood Tryouts<br />\nto Black and, Blue Songsters<br />\nStemley Breaks Plunge<br />\nterial in School<br />\nfor Tocqueville Contest<br />\nTaken by Students<br />\nLast Friday Night<br />\nSwimming true to the dope<br />\nBecause of the increasing deAt the last assembly, Dean LaAt the request of the WashingThree hundred and fifty people<br />\nthe Rutgers College tanksheet,<br />\nthe<br />\nand<br />\nthe<br />\ncampus<br />\nmands<br />\nabout<br />\nheard the Hopkins Musical Club ton and Lee University, the Trian- tane expressed extreme dissatisfac- general popularity of the , sport, men. carried off top honors with<br />\nrender its fifth concert of this sea- gular Debates were postponed for tion with the order and attendance. there has been an unusual amount ease at the annual championships<br />\nson in the Alumni Assembly Hall one week, in view of the fact that At recent mass meetings the disorof effort expended to place a of the Eastern Intercollegiate<br />\nof the Western Maryland College their spring examination conflicted der has been especially noticeable<br />\nBlack and Blue basketball team Swimming Association held in<br />\nin Westminster last Friday night. with the original date of March 17.<br />\nattendance,<br />\nobjectionable.<br />\nThe<br />\non the floor next year. While the Swarthmore pool last Saturand<br />\nThe members of the club made The debates will be held on Saturtoo, has been far below what it there has been little said about the day.<br />\nthe trip to the up-state town in day, March 24, at 8 o'clock.<br />\nAlthough close races were in<br />\nshould be. Although the presence possibilities of a team so far this<br />\nmotor-buses arriving at the conuniformly slow times were<br />\norder,<br />\nLawrence B. Fenneman, Presiyear, the idea of having one has alcert hall just in time to start the dent of the Debating Council, an- of only freshmen and sophomores is<br />\nthe only record being<br />\nregistered,<br />\nways been present in the minds of<br />\nperformance on the hour sched- nounced that it has been finally required, the Dean would like to<br />\nthat of the plunge, in<br />\nbroken<br />\nwas<br />\nthe authorities. That Hopkins will<br />\nuled. The audiente which was agreed that the wording of the have as many upperclassmen as posStanley, the Rutgers<br />\nVon<br />\nwhich<br />\nbe represented on the basketball<br />\ncomposed principally of college question to be debated is as follows:<br />\nbantamweight,<br />\nwent 75 feet in<br />\nsible attend- the weekly meetings. court next year is now more than<br />\nstudents and _townspeople re- \"Resolved, That the United States<br />\nformer record<br />\nThe<br />\nseconds.<br />\n47<br />\n3-5<br />\na possibility. The game, since it is<br />\nceived the presentations with en- should. favor the cancellation of the The purpose of the assemblies is to<br />\nby Regad of<br />\nwas<br />\nheld<br />\nfeet<br />\nof<br />\n70<br />\nplayed indoors and the swift action<br />\nthusiasm, demanding encores to Inter-Allied war debt on condition create .and sustain college spirit in<br />\nLehigh.<br />\nmakes it especially interesting, has<br />\nfreshman and sophomore<br />\nnearly every number.<br />\nThe prowess of the Rutgers<br />\nthat the German indemnity be ma- the<br />\ndrawn<br />\nlarge crowds in Baltimore all<br />\nThe concert was started by The<br />\nthis<br />\nply-PCr^rnp1;<br />\n11<br />\nclasses.<br />\nmermen<br />\nis demonstrated by the<br />\nterially reduced.\" These debates<br />\ninter. If Hopkins should 'present<br />\nGlee Club singing \"Old Black<br />\none of their number finfact<br />\nthat<br />\nshould be very well attended be- pose, the presence of a large num- a first-class combination and should<br />\nJoe,\" and \"Honey, I Wants Yer<br />\nin every event except<br />\nished<br />\nfirst<br />\ncause of their immediate interest. ber of upperclassmen is necessary. engage in games with the best of<br />\nNow.\" Although this organization<br />\ndash, in which Crownthe<br />\n50<br />\nyard<br />\nThe negative team will entrain for<br />\nIn regard to the disorder, Dr. colleges and universities, according<br />\nwas weakened by the Absence of<br />\nSwarthmore<br />\nace, nosed<br />\nthe<br />\nover,<br />\nLexington, Virginia, where they<br />\nLatane said that he believed it was to athletic authorities, the success out Bob Welsh of Hopkins by a<br />\nseveral basses and three tenors,<br />\nwill engage the Washington and<br />\nof such a team as a drawing card<br />\nthese pieces were renderd with<br />\nlargely the result of thoughtlessmatter of inches. Both Welsh and<br />\nin heated arguUniversity<br />\nLee<br />\nwould be assured.<br />\nexthat<br />\nwas<br />\nthe same versatility<br />\nfinished ahead in their<br />\nreminded<br />\nI3uhrer<br />\nthe students<br />\nment. Those on the team are: ness. He<br />\nThe Fifth Regiment officials have<br />\nhibited at the Maryland Casualty<br />\nMessrs. Charles C. G. Evans, Sam- that a decent respect for others, made several propositions to Dr. heats.<br />\nClub concert.<br />\nGiebel was again the individual<br />\nuel S. Isenberg and Rignal W. resulting from a proper self-respect, Ray Van Orman. They propose<br />\nThe Mandolin Club was reBaldwin, Jr., as alternate. • Mr. should be felt and shown at all to have Hopkins stage games in star of the meet. The Rutgers<br />\nceived with great applause, being<br />\nEvans; an experienced debater, aid- times on the campus and at these conjunction with the Fifth Regi- captain finished first in the 100literally forced to play two extra<br />\ned in 'be victory over the Iiniver- meetings. The Dean advised the ment Association. The Fifth Reg- yard swim and the back stroke<br />\npieces. Mr. McCauley's charges<br />\nMaryland a few weeks.ago, cultivation of self-reverence, self- iment could, according to the prop- and swam anchor man on the vicwere met with the same appre- sib,- of<br />\nwas a potent factor in the win- knowledge, and self-control as as- osition, stage their games first and torious relay.<br />\nciation that has been accorded and<br />\nIn the back stroke, Leo had<br />\ndebate in the early sets that would be of value the Hopkins attraction would folthem at each concert this year. ning of his class<br />\nthings<br />\nhis own way but in the 100<br />\nthe year. Mr. Isenbcg, it throughout life.<br />\nlow. A dance would complete the<br />\n\"The Minute March,\" their first part of<br />\ngave him the scare of his<br />\nWelsh<br />\ntecalled, helped his class<br />\nAfter the roll was called the program,. with music furnished by life. Despite the prevailing slow<br />\npiece, was followed by a selection will he<br />\nAdams Delate Dean stated that all absentees will the undergraduate orchestra. •<br />\nof popular songs. The audience materially in the<br />\ntimes this race was swum off in<br />\nAli be required to meet him at an aSoratory_<br />\nbrilliant<br />\nwith<br />\nAftcr two years' absence from<br />\ngreeted the maridolin aird banit.)<br />\n58 seconds with Welsh pressing<br />\nplayers with the same enthusi- Baldwin was alternate in the latter sembly at a time which he will.des- the court a team would be wel- the Rutgers star throughout the<br />\ndebate.<br />\nignate, in order that he may re- comed by the men in the university distance.<br />\nasm each time they appeared.<br />\nThe affirmative team will engage mind them of what is required in who have the ability to play but beOwing to the failure of one<br />\nThe 100 yard breast stroke<br />\ncause of the lack of a team have caused a few thrills. Potts of Rutmember to appear, the quartet the University of North Carolina at regard to attendance and order.<br />\nwas reduced to a trio. In spite of Homewood.in a verbal battle:Those<br />\nPrevious to Dean Latane's talk, been prevented from participating gers and Dunning of Hopkins<br />\nthe reduction this organization who will represent Hopkins are: President Sherwood, of the Stu- in the sport.<br />\nstarted of neck and neck. They<br />\nDr. Van Orman has already re- kept on even terms throughout<br />\nwas accorded as hearty a recep- Frederick L. Moehle, Bernard T. dent Council, also called the stution as ever. After singing \"If I Bamberger and William R. Barn- dents' attention to the disorder ceived several requests for games the race, Potts winning the event<br />\nWere a Cat,\" John Sherwood and hart as alternate: Bamberger was which has been so noticeable. The for next year, and, at present, is by an eyelash.<br />\nhis two aiding voices were joined alternate in the Hopkins-Maryland, students showed their approval of planning a tentative schedule.<br />\nRidgely Howard gave Von<br />\nby Don Vanneman for a presen- and Adams. Debates, and spoke the Dean's talk by cheering him There is believed to be a valuable Stanley a rub in the plunge the entation of \"Johnny Schmoker.\" in the class debate last year. Moehle heartily at the close of the assem- amount of talent available for this tire length of the pool for a secThis ancient ditty set the audience upheld the rebuttal in the class de- bly.<br />\nteam.<br />\nond place. He took the entire time<br />\nbates during his. freshman and<br />\ninto gales of laughter.<br />\nallowed for this feat.<br />\nTheir mirth was added to by sophomore years.<br />\nSPRING SPORT TICKET SALE MR. SHAEFFER'S ADDRESS<br />\nRutgers got a runn;ng start in<br />\nFEATURES ELECTRICAL<br />\nThe two presentation speeches<br />\nJoe Moran in his amusing imperTO BEGIN SOON<br />\nthe<br />\n200 yard relay and captured<br />\nCLUB MEETING<br />\nsonation of Joe Cook. He was will be 25 minutes in length, while<br />\nthis<br />\nevent by several yards, HopGraduate Manager Norman C. The first meeting of the Johns<br />\nably assisted by Dal Kirwan, the rebuttal will have only ten min- Keyes is now formulating<br />\nkins,<br />\nSwarthmore and Lehigh finplans Hopkins Electrical Club since the<br />\nwho had previously drawn hearty utes.<br />\nishing<br />\nin the order named. Coady,<br />\nfor the annual spring ticket sale election of the new officers was<br />\nC9ntinued on page 2, col. 3<br />\napplause in his own solo act. Imcampaign which is to begin held last Friday afternoon in the swimming first for the Black and<br />\nmediately following Moran's imwithin the next fortnight. The M. E. Building. The members were Blue, obtained a poor start. The<br />\npersonation the Blue Jay Jazz SOPHOMORES ELECT KLINEentire<br />\nundergraduate body will addressed by Mr. Shaeffer, who remaining Hopkins swimmers<br />\nFELTER TREASURER<br />\nBand played the latest dance hits.<br />\nAt a special meeting of the be organized for the campaign. took for his subject \"Thermonic closed up the gap but found themAs a proof of the Jazz Band's<br />\nSophomore Class held in the C. Teams, such as were utilized last Tubes in Radio Telegraphy and selves unable to forge to the front.<br />\nability to produce sufficient syn- E. Hall last Wednesday at 12:20<br />\nAt the annual meeting of the E.<br />\nyear, will be drawn up and ac- Telephony.\" Due to the timely subcopation for modern \"stepping\",<br />\nP. M., George Klinefelter was tive inter-team competition will ject, and its particular interest to I. S. A. A. bronze tablets were<br />\nClarence Adams did a clog to the<br />\nelected to succeed \"Bill\" Towner ensue. Prizes will be given for electrical men, the meeting was awarded to Rutgers and Lehigh<br />\ntune of \"Three O'clock.\" Adams<br />\nfor winning the championship of<br />\nas class treasurer. After a re- the team, individual and class well attended by members.<br />\ngained in Westminster the disthe league (computed by standing<br />\ncount of ballots it was found selling the most tickets.<br />\nThe new officials at the meeting<br />\ntinction of being one who can<br />\nthat George Klinefelter had won<br />\nAccording to athletic authori- were J. T. Dixon, president P. K. in dual meets) in 1923 and 1922,<br />\n\"sho' strut his stuff.\"<br />\nassociation<br />\nrespectively. The<br />\nInstrumental solos were ren- over \"Mike\" Tilghman by a ties, five thousand dollars is nec- Aubel, vice-president: Ferdinand changed the 100 yard backstroke<br />\nplurality of one vote.<br />\nessary to carry on the spring S. Hamburger, Jr., treasurer, and<br />\ndered by Hambleton on the guitar,<br />\nevent to 150 yards and the 100<br />\ndesign<br />\nfor<br />\na<br />\nring<br />\nThe<br />\nwas<br />\nsubsports, the best colleges in thee J. H. Long, Jr., secretary. The<br />\nSater on the piano and Mr. Mcbreast stroke to 200 yards. The<br />\nCauley on the banjo. Bill Fargo mitted to the class by the ring East will compete at Homewood other officers who were elected at names of Catholic University and<br />\nplayed a guitar accompaniment and pin committee, and formally and liberal guarantees have been the last meeting are Paul L. Betz, of New York University were prochairman of the Program Commitfor Hambleton. Sater's piano solo accepted. It will be of solid gold offered.<br />\nposed and discussed as to memAs usual, a discount on the tee: C. H. Black, chairman of the<br />\nwas received by a hearty applause and have the University seal debership in the league but definite<br />\nand a demand for an encore. Mr. signed on one side. Upon the tickets will be allowed prepara- Menibership Committee, and C. 0. action was postponed.<br />\nother side, with the student's tory school pupils. At the time Rector chairman of the Publicity<br />\nContinued on page 3 col. 2.<br />\nAt this meeting Fitzgerald<br />\nclass numerals, will be a symbol, that the campaign opens, the Committee.<br />\nDunning of Johns Hopkins, was<br />\nrepresenting the department of spring schedules will be officialThe programs for the future unanimously elected vice-presiTocqueville Contest trythe university with which the ly released. The tickets will in- monthly meetings of the club will<br />\ndent of the association for the enouts Thursday, March 15th,<br />\nstudent is affiliated. That is, clude admission to all baseball, continue to feature addresses by<br />\nsuing year.<br />\nSee Mount. •<br />\nacademic, engineering or medi- track and lacrosse games on prominent engineers and students.<br />\nSummaries:<br />\ncal. A bloodstone onyx or some Homewood Field, excluding the So far this year meetings have<br />\nMeeting of entire News50-yard Dash—Heats: First,<br />\nother'stone of similar value may contests held during June Week, proved very successful, and the won by Buhrer, Hopkins; second,<br />\nLetter Staff today at 12.30.<br />\nElection next year's Board<br />\nbe chosen by the individual. which will be under control of new officers will adhere to the same Baker, Swarthmore; third, Schaefof eontrol.<br />\nContinued on page 3, col. 3<br />\nthe June Week Committee.<br />\nplans in selecting programs.<br />\nContinuod on page 3, col. 1<br />\n<br />\nTo<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1923<br />\nTriangular Debate Postponed<br />\nContinued from page 1<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\n<br />\n_<br />\n<br />\nThe debates will be under the supervision of the Debating Council.<br />\nFOUNDED 1897.<br />\nDr. John C. French will act as<br />\nchairman at the Homewood debate.<br />\nFollowing the conclusion of the arSubscription<br />\n$2.00 guments, an informal dance will be<br />\ngiven, the music will ,be furnished<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nby \"The Blue Jay Six.\"<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nParker C. Williams was chosen<br />\nPublished semi-weekly from October to June by the students of Johns by Dr. French from a large numHopkins University.<br />\nber of candidates to represent Hopkins in the Southern Oratorical<br />\nBusiness communications should be addressed to the BUSINESS MAN- Contest. The reward<br />\nfor the winAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nner of this contest, which will be<br />\nheld at Homewood April 14, will<br />\nHomewood<br />\n100<br />\nTelephone<br />\nbe a sum of money and the title of<br />\n\"Southern Collegiate Orator.\" Dr.<br />\nFrench is desirous that Hopkins<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nshould<br />\nretain the title won for it<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nlast<br />\nyear<br />\nat the University of TenManaging Editor:<br />\nAdvertising Manager:<br />\nnessee, by Albert G. Langeluttig,<br />\nJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nJr., who is president of the League.<br />\nAssistant Managing Editor:<br />\nCirculation Manager:<br />\nThe Universities in the Southern<br />\nJOSEPH S. LEOPOLL '24.<br />\nPHILIP<br />\nW.<br />\nHOWARD,<br />\n'25.<br />\nOratorical<br />\nLeague are Johns HopAssociate Editors<br />\nkins,<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nKentucky, Sewanee, North<br />\nAssistant Business Managers:<br />\nWILLIAM G. DEAN, JR., '24.<br />\nCarolina,<br />\nAlabama and Vanderbilt.<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nThe tryouts for the Adams ConT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\ntest in oratory and the Tocqueville<br />\nJunior Editors:<br />\nD. MILES MARRIAN, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\nContest in oral discussion will be<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nheld<br />\nin the near future by Dr.<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nFrench. The Debating Council<br />\nW. EDWARD THOMSEN, '26.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nwill hold an election of officers<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\nshortly and at the same time will<br />\nelect one Freshman,_ one Sophomore, and one Junior to the<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nCouncil to represent their respective classes next year.<br />\nPrinted by The Read-Taylor Co., Lo mbard and South Sts.; Baltimore, Md.<br />\n<br />\nQ.E.D.<br />\nHOW me,\" says the math. teacher—and<br />\nwhen the chalk clouds have settled down<br />\nthere are a lot of figures signed\"O.E.D.\"<br />\nwhich aren't \"Q. E. D\" at all.<br />\nSay \"Show me\" to the shaving cream you're<br />\nusing and see what answer you get. Will it soften<br />\nyour beard right down to the base before the<br />\nbreakfast bell has rung twice? Will it leave your<br />\nskin smooth and supple after every shave and give<br />\nyou the well-groomed look of perfect skin health?<br />\nEvery day men are finding how much easier<br />\nshaving can be made because of the speed and<br />\nthoroughness with which<br />\nNotice the hinged<br />\ncap. You can't<br />\nWilliams' softens the<br />\nlose it—and the<br />\ntube hangs up 1<br />\nbeard. Likewise,they are<br />\nfinding a help for their<br />\nskin in Williams'thatthey<br />\nnever found in any other<br />\nshaving cream. Try it<br />\nyourself. The difference<br />\nmay surprise you.<br />\n<br />\ntt<br />\n<br />\nAMIN<br />\n<br />\nWilliami<br />\nShaving Cream<br />\n<br />\nBALTIMORE, MD., MARCH 13, 1923<br />\nROBB .2Z_77<br />\n<br />\n.3 0 1\"L E<br />\n<br />\nA<br />\n<br />\nX ..R.....<br />\n<br />\n..P<br />\n<br />\nU M _ZD<br />\n<br />\nST. JOHN'S PRESIDENT-ELECT<br />\nIf Professor R. V. D. Magoffin accepts the presidency of St. John's<br />\nCollege, the undergraduates of Johns Hopkins will lose one of their best<br />\nfriends. The genial instructor of archaeology is by far one of the most<br />\npopular members of the faculty.<br />\nThe seniors recently showed their appreciation of Dr. Magoffin's<br />\ninterest in student affairs by selecting him as the faculty member of<br />\nJune Week Committee. He is one of that rare variety of professors<br />\n• that is as broad of heart as of mind. It is a safe venture to say that<br />\nhe has a closer understanding of students than any of our faculty members. Most any day he may be found during lunch hour mingling with<br />\nthe \"young hope.\" The democratic smile and friendly chat will be<br />\nmissed.<br />\nDr. Magoffin could, probably, work wonders at St. John's; yet<br />\nwe can hardly help but hope that he will risk the chance of future advancement at Hopkins. Dr. Fell presided over the Annapolis institution for twenty-seven years, if press accounts may be trusted, yet the<br />\ncollege has received a lower rating in the past few years. And if memory serves, the first president of the University of Pennsylvania was<br />\ntaken from the president's chair at St. John's. If Dr. Magoffin will<br />\neventually attain the position that his personality deserves, we will, with<br />\nregret, be willing to part with him. But unless he will be allowed to<br />\nplace himself and his institution upon the plane where they belong, we<br />\nprefer that he will remain with us.<br />\nWe congratulate Dr. Magoffin on his election. We congratulate<br />\nSt. John's on her selection, and we further congratulate her if the<br />\nDoctor accepts.<br />\nHopkins' loss will be St. Johni's gain!<br />\n<br />\nThe \"PRACTICAL\" Alchemist and<br />\n\"THEORETICAL\" Robert Boyle<br />\nHE alchemists wrote<br />\nvaguely of \"fluids\" and<br />\n\"principles.\" Copper<br />\nwas potentially silver.<br />\nRid it of its red color and the<br />\n\"principle\" of silver would assert<br />\nitself, so that silver would remain.<br />\nWith a certain amount of philosopher's stone (itself a mysterious<br />\n\"principle\") a base metal could be<br />\nconverted into a quantity of gold<br />\na million times as great.<br />\nThis all sounded so \"practical\"<br />\nthat Kings listened credulously,<br />\nbut the only tangible result was<br />\nthat they were enriched with much<br />\nbogus gold.<br />\nScientific theorists like Robert<br />\nBoyle (I62.7-1691) proved more<br />\n\"practical\" by testing matter, discovering its composition and then<br />\ndrawing scientific conclusions that<br />\ncould thereafter be usefully and<br />\nhonestly applied. Alchemists conjectured and died;he experimented<br />\nand lived.<br />\nUsing the air pump Boyle undertook a \"theoretical\" but sci-<br />\n<br />\nADVANCEMENT OF ELECTIONS<br />\nOne of our greatest difficulties in student activities has been the<br />\ninexperience of the officers, upon assuming their duties at the start<br />\nof the year. The executives of the preceding term have usually graduated and the usual errors of the office repeated instead of eliminated.<br />\nThe Omicron Delta Kappa Society has realized this fact and has,<br />\nconsequently, been endeavoring for the past few months to have the<br />\ntime of elections moved up to a date as near the beginning of the second<br />\nsemester as possible. All of the organizations, with the exceptions of<br />\nthe Athletic Board and the Student Council, have agreed to elect at<br />\nthis date.<br />\nIt is believed that a greater efficiency and a more responsible method<br />\nof financing will result. Seniors who hold office have lesser interest in<br />\nthe financial success of their respective organizations when they realize<br />\nthat they will not have to worry one way or the other. A junior, however, will aim to protect himself for the ensuing year.<br />\nThe plan should mean a great improvement.<br />\n<br />\nentific experimental study of the<br />\natmosphere and discovered that<br />\nit had a \"spring\" in it, or in other<br />\nwords that it could expand. He<br />\nalso established the .connection.<br />\nbetween the Boiling point of water<br />\nand atmospheric pressure, a very<br />\n\"theoretical\" discovery in his day<br />\nbut one which every steam engineer now applies.<br />\nHe was the first to use the term<br />\n\"analysis\" in the modern chemical sense, the first to define an<br />\nelement as a body which cannot<br />\nbe subdivided, and from which<br />\ncompounds can be reconstituted.<br />\nBoyle's work has not ended.<br />\nToday in the Research Laboratories of the General Electric<br />\nCompany it is being continued.<br />\nMuch light has there been shed<br />\non the chemical reactions that<br />\noccur in a vessel in which a nearly<br />\nperfect vacuum has been produced.<br />\nOne practical result of this work<br />\nis the vacuum tube which plays an<br />\nessential part in radio work and<br />\nroentgenology.<br />\n<br />\nGen.er al Elediric<br />\nOffice company<br />\ngeneral<br />\n<br />\n4-<br />\n<br />\nSchenectaily,N.Y:<br />\n95-625D<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1923<br />\n<br />\n3<br />\n<br />\nCOLLEGE MEN AND<br />\nIMAGINATION<br />\n\"The -college man does not<br />\nthink for himself; he lacks originality and imagination.\" This is<br />\nthe expressed opinion of many socalled self-made men.<br />\nAt first the statement appears<br />\ntoo broad and generally unfounded to merit any great degree of<br />\nN.Charles Street<br />\nStacomb keeps hair in place<br />\nconsideration. It is, however, an<br />\nBRANCH<br />\nTOM LANDY,<br />\n, all day—No more trouble<br />\nopinion current in certain not too<br />\nAT THE BARN<br />\nManager<br />\nwith rumpled hair.<br />\nwell informed circles and for that<br />\nyour<br />\nwashing<br />\nafter<br />\nalso<br />\nIdeal<br />\nhair—supplies natural, benereason should be refuted and exficial oils which add life and<br />\nThe Flag, Banner & Pennant Shop<br />\nplained.<br />\nORDERS RECEIVED FOR<br />\nlustre and keep the hair in place.<br />\n(Successors to Sisco Brothers)<br />\nSome great thinker once said<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nAsk your barber for a StaEmblems, Silk Banners for Schools,<br />\nCOGGINS'<br />\ncomb Rub.<br />\nthat no man thinks originally or<br />\nSocieties and Fraternities<br />\nall<br />\nAt<br />\ndruggists.<br />\ngives his imagination full play as<br />\nand Baggage Express<br />\nTransfer<br />\nREC. U.S. PAT. OFFICE<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nAUTOMOBILE SERVICE<br />\nlong as he moves in the associaVernon 2355<br />\nR. H. Taylor<br />\nMakes the Hair Stay Combed<br />\ntion of other men. He is bound to<br />\nPHONE, HOMEWOOD 6886<br />\nassimilate; to learn and to embellish his own ideas with the viewpoint of another. The only man<br />\n1 W. University Parkway<br />\nwho can absolutely think for himOpposite J. H. U. Athletic Field<br />\nself is he who can-- utterly isolate<br />\nDRUG STORE for J. H. U. BOYS<br />\nhimself from the environment of<br />\nPHONE, HOMEWOOD 2121<br />\nWe have purchased 122,000<br />\nother men and who sets himself<br />\npair U. S. Army Munson last<br />\n2 to 12 which<br />\n/<br />\nHot Dinners, Sandwiches,<br />\nshoes, sizes 51<br />\nfar enough from civilization to be<br />\nwas the entire surplus stock<br />\nalone. There he can best approxiCandies, Sodas, Cigarettes,<br />\nof one of the largest U. S.<br />\nPrinters of Philological and<br />\nmate the--mGn- who_ pioneered-contracshoe<br />\nGovernment<br />\nScientific Works<br />\nTobacco, etc.<br />\nwho had to meet necessity upon<br />\ntors.<br />\noscAR G.1-51<br />\n23<br />\nS. HANOVER ST.<br />\none<br />\nno<br />\nWith<br />\ntheir own resources.<br />\nowNERs<br />\nThis shoe is guaranteed one<br />\nAT THE BARN<br />\nBaltimore, Md.<br />\nabout them they can -indulge in a<br />\nhundred per cent. solid leathilbt•C\"4 r4<br />\nwill<br />\nwhich<br />\ndegree of introspection<br />\ner, color dark tan, bellows<br />\n29 Baltimore St., Eust<br />\ntongue, dirt and waterproof.<br />\nland them on a basis for original<br />\nOns Door West of LiglA St.<br />\nThe actual value of this shoe<br />\nand imaginative thought.<br />\nSOLE AGENTS FOR BALTIMORE<br />\n$6.00. Owing to this treis<br />\nman<br />\nno<br />\nFor College Fraternity Bands<br />\nThus it is obvious that<br />\nmendous buy we can offer<br />\n(Greek Letter Societies)<br />\nmoving in society is free from the<br />\nsame to the public at $2.95.<br />\ninfluence of environment. He is Send correct size. Pay postman on<br />\nconstantly learning from others. delivery or send money order. If<br />\n'<br />\n``The King of Lubricants.<br />\nHe has little time to shut himself shoes are not as represented we<br />\nmoney<br />\nyour<br />\nrefund<br />\ncheerfully<br />\noff long enough to let his mind will<br />\noperate originally on his own par- promptly upon request.<br />\nticular line.<br />\nAmerican Journal of Mathematics. Edited by Frank Morley, A. Cohen,-AsHow much more, then, is it imsistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\npossible for a man in college to<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nper volume. (Foreign postage fifty cents.)<br />\nemploy much imagination. His en- 296 Broadway, New York, N. Y.<br />\nAmerican Journal of Philology. Edited by C. W.E. Miller, with the co-operatire time and energy is taken up<br />\nPerfected by the Makers<br />\ntion of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robinwith the assimilation of facts<br />\nOf Betholine<br />\nson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\nBack<br />\nStroke—Won-by<br />\n100-yar4<br />\nfrom others— and with learning<br />\n(Foreign postage, fifty cents.)<br />\nSHERWOOD BROTHERS, INC.<br />\nmen and their ideas. If ever in his Giebgl, Rutgers; second, Mitchell,<br />\nAmerican Journal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nlife he is justified in lacking origi- Rutgers; third, Morrell, Hopkins; 1:3:1111EITIMMETIMIIIII1713111:11.12111:113EMETal<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nnal thought it is in college for fourth, Quick, Lehigh. Time,<br />\nSophomores Elect Klinefelter Beitrage zur Assyriologie und semitischen Sprachwissenschaft. Paul Haupt<br />\nthere his business is to take on 1 :11 4-5.<br />\nand Friedrich Delitzsch, Editors. Volume X in progress.<br />\nTreasurer<br />\n100-yard Breast Stroke—Won<br />\nknowledge and acquire the tools<br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nContinued from page 1.<br />\nwith which his imagination may by Potts, Rutgers; second, DunSeventeen numbers have appeared.<br />\nBrenner,<br />\nthird,<br />\nHopkins;<br />\nning,<br />\nall<br />\n11<br />\nto<br />\nvi<br />\n\\<br />\ndesign<br />\nbe<br />\nreferred<br />\nThis<br />\nyears.<br />\nlater<br />\nwork in<br />\nJohns<br />\nHopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progThe whole fault with the above Rutgers; fourth, Glenn, Rutgers. the classes for approval and the<br />\nress. $4 per year. (Foreign postage, fifty cents.)<br />\nSophomore class hope that Omistatement in regard to college Time, 1 :21 1-5.<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nRoss,<br />\nby<br />\nSwim—Won<br />\n220-yard<br />\nwith<br />\nand<br />\ncom<br />\noriginality<br />\nDelta Kappa will support<br />\nmen lacking<br />\nvolume. (Foreign postage, fifty cents.)<br />\nthose who advanced this idea is, Rutgers; second, Redmond, Rut- them in their effort to have a Johns Hopkins University Circular, including the Presidents' Report, Annual<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\nthat they have taken a bare state- gers; third, Coady, Hopkins; uniform Hopkins ring adopted.<br />\n$1 per year.<br />\nment out of its context and _have fourth, Foster, Rutgers. Time, Attention is called to the Forattempted to establish it. Throw 2:383-5 (time heats).<br />\nmal Sophomore Prom, to be held Johns Hopkins University Studies in Education. E. F. Buchner, Editor. 8vo.<br />\nSeven numbers have appeared.<br />\nStanley,<br />\nVon<br />\nby<br />\nPlunge—Won<br />\nthethe light of reason on such a<br />\nin the C. E. Hall on April 20.<br />\nHopHoward,<br />\nsecond,<br />\nJohns<br />\nRutgers;<br />\nHopkins University Studies in Geology. E. B. Mathews, Editor. 8vo.<br />\nand<br />\nory and find out the clauses<br />\nTickets are for sale at three<br />\nFour numbers have appeared.<br />\nRutgers;<br />\nSparks,<br />\nthird,<br />\nkins;<br />\ndeconditions which justify and<br />\ndollars a piece. It should be<br />\nHopkins University Studies in Historical and Political Science. Under<br />\nfine it, and you have a condition fourth, Hambleton. Distance, 75 remembered that a limited sup- Johns<br />\nthe direction of the Departments of History, Political Economy and Politisec.<br />\n3-5<br />\n47<br />\nft.,<br />\ncal Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nnot at all uncomplimentary to colply will be sold.<br />\nFancy. Dive—Won by Gallege men. It is perfectly natural<br />\nModern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum, W.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nand in the due course of things. It braith, Rutgers; second, Subin,<br />\nTAG DAY TOMORROW<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nRutgers; third, Repp, Swarthshould not be otherwise.<br />\nFriTomorrow, Thursday and<br />\nof Economic Tracts. J. H. Hollander, Editor. Fourth series in progAcquire an education in college more; fourth, Childs, Lehigh.<br />\nday will constitute one of the last: Reprint<br />\nress. $2.00.<br />\nRutby<br />\nRelay—Won<br />\n200-yard<br />\nand it will serve as the basis for<br />\nseries of \"Tag Days\" for the year.<br />\nimagination and original thought gers (Foster, Ross, Enander and It is particularly necessary that the Reports of the Maryland Geological Survey. Edited by E. B. Mathews.<br />\nin business and professional life. Giebel); second, Hopkins (Coady, whole student body support the Terrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nLor(l, Buhrer and Welsh); third,<br />\n—Daily Californ;an.<br />\ncommittee to the limit.<br />\npostage, 25 cents.)<br />\nSwarthmore (Martin, Ruah, BaCommittee<br />\nThe<br />\nhas<br />\nWeek<br />\nJune<br />\nRUTGERS CARRIES OFF TOP HON- ker and Crownover); fourth, Leengaczed the entire twelfth floor of<br />\nORS AT EASTERN INhigh. Time, 1 :48 3-5.<br />\nTERCOLLEGIATES<br />\nthe<br />\nBelvedere Hotel for the evenScore—Rutgers, 56;<br />\nPoint<br />\nContinued from page 1<br />\n156 pp. $1.50.<br />\ning<br />\nof June 12. This includes all The Eclogues of Baptista Mantuanus. By W. P. Mustard,<br />\nfer, Lehigh. Time, :27 1-5.<br />\nJohns Hopkins, 23; Swarthmore,<br />\nthree ballrooms. An elaborate buf- The Piscatory Eclogues of Jacopo Sannazaro. By W. P. Mustard. 94 pp. $1.25.<br />\nSecond Heat: Won by Welsh, 13; Lehigh, 5.<br />\nfet supper has been arranged The Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W.P. MusHopkins; second, Enander, Ruttard. 123 pp. $1.50.<br />\nand the Pennsylvania Serenaders<br />\ngers; third, Martin, Swarthmore. MUSICAL CLUB GIVES FIFTH CONWest Florida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nhave been definitely engaged.<br />\nCERT OF SEASON<br />\nTime, :27.<br />\nAll this has been contracted for An Outline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nContinued from page 1<br />\nThird Heat: Won by Crownnot The Life and Stories of the Jaina Savior Pargvanfitha. By M. Bloomfield.<br />\nover, Swarthtmcre';' second, Ca8s, McCdtiley as usual astonished the and while the contractors. do<br />\n256 pp. $3.00.<br />\ndo<br />\nthey<br />\ndemand<br />\ndeposits,<br />\ndemand<br />\n\"make<br />\nto<br />\nability<br />\nhis<br />\nby<br />\nutgers; third, Cheel, Lehigh. listeners<br />\nbank references. Hence the com- American Citizenship and Economic Welfare. By J. H. Hollander. 132 pp. $1.25.<br />\nhis banjo talk.\"<br />\nTime, :26 3-5.<br />\nmittee is anxious to get as much Martial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nfollowing<br />\nThere was no dance<br />\nFinal Heat: Won by CrownW. P. Mustard. 180 pp. $2.<br />\nmoney as possible in order to have<br />\nwhich<br />\nin<br />\nover, Swarthmore; second, Welsh, the concert as the hall.<br />\nHistory of Rome to the End of the Republic. By Tenney Frank.<br />\nEconomic<br />\nAn<br />\nHopkins; third, Cass, Rutgers; the performance was given is built a presentable bank account.<br />\n310 pp. $2.50.<br />\nfourth, Cheel, Lehigh. Time, as an auditorium with tiers of The definite program for June Public Health and Insurance: American Addresses. By Sir Arthur Newsholme.284 pp. $2.50.<br />\nseats. This hall was the only one Week is nearing completion, and<br />\n:27 1-5.<br />\n100-yard Dash—Won by Gie- available in. Westminster, the ar- will Soon be released. A combina- China at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nbel, Rutgers; second, Welsh, mory which was to have been tion ticket will be sold. This will Tables of V1—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nBy J. R. Miner. 50 pp. $1.50.<br />\nCrownover, used having suffered from the ex- admit to all the functions of the<br />\nthird,<br />\nHopkins;<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\nVector<br />\nSwarEimore ; fourth, Ross, Rut- plosion of a heating boiler a few week. The price will depend upon<br />\n$2.75.<br />\nthe returns of this tag day.<br />\ndays before.<br />\nA complete list of publications sent on request.<br />\ngers. Time, :58.<br />\n<br />\nMakes Hair<br />\nStay Combed<br />\n<br />\ncusk\"<br />\n<br />\nR.G.by & Company<br />\n<br />\nThe BARN<br />\n<br />\nPUBLIC SALES<br />\n<br />\nCAFETERIA<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nThe Johns Hopkins Press<br />\nof Baltimore<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1 92 _?<br />\nJUNIOR PROM TICKETS SELLING FAST<br />\n<br />\nWHY A GIRL CLOSES HER<br />\nEYES WHEN SHE IS<br />\nKISSED<br />\nAccording to Conrad R. Ken(THE BOOK MART)<br />\nnedy, chairman of .the Junior<br />\nYes, it is perfectly true that a<br />\nComplete Stock of<br />\nProm Committee, tickets for the girl closes her eyes when she is<br />\nMedical Books and College<br />\nJunior formal affair to be held in kissed. Not being a girl,<br />\nI can't<br />\nRequisites<br />\nthe Civil<br />\nEngineering Hall<br />\nspeak from exeprience, but I have<br />\nImporters and Dealers in Fine Books<br />\nMarch 23 are being snatched up<br />\ntaken a peep now and then and sure<br />\nwith rapidity.<br />\n301 N. CHARLES ST.<br />\nDue to the limited space in the. enough what people say is perfectBaltimore, Md.<br />\nhall, the sale of tickets has been ly right. Why ? That's really too<br />\nrestricted and each of the eight easy to answer—about as easy as<br />\nmembers of the committee has writing in Hebrew what the Sphinx<br />\nPrinters of the<br />\nbeen allowed but ten tickets to is thinking in some other dead and<br />\nJohns Hopkins News..Letter<br />\n(lispose of. Some of the mem- forgotten language.<br />\nBefore a person can get very far<br />\nbers already report that all of<br />\ntheir tickets have been sold. The along with an explanation, he must<br />\ndance is to be open to the entire understand just what a kiss really<br />\nUniversity and members of the is. Now a kiss is only a spontanJunior Class who are desirous of eous generation of the demonstraattending are advised to procure tion of the affection expressed in<br />\nterms of two red lips pressed close<br />\ntheir tickets immediately.<br />\ntogether;<br />\na sublime blissful etherAs has been previously aneal<br />\nmoment<br />\nwhen for the time benounced, Louis Fisher's welling there are only two people in<br />\nknown orchestra will furnish the<br />\nmusic. Decorations for the af- the world and all the rest does not<br />\nmatter; a never-to-beforgotten secfair are in charge of Isaac Hamond which is snatched from the<br />\nburger, Art Director of the Dravery hands of time; and last, a kiss<br />\nmatic Club, and the hall promises<br />\nis love's expression that makes itto be elaborately adorned.<br />\nCollege Literature<br />\nself felt long after the kiss is only<br />\nFourteen dances and four exa memory of one supreme moment<br />\nLOMBARD and SOUTH STREETS<br />\ntras have been arranged by the<br />\nwhen the entire Universe stood still<br />\n518 N. CHARLES STREET,BALTIMORE<br />\ncommittee. Intermission will be<br />\nand waited, and when old Father<br />\nheld and supper served after the<br />\nTelephone, Vernon 3442<br />\nOrchestra—Dancing<br />\nHopkins Press to Publish Books eighth dance. Dancing will last Time showed signs of weakening,<br />\nfor once allowing the seconds to<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nIssued by the Institute for<br />\nfrom nine until one.<br />\npass<br />\nby<br />\nwithout<br />\ncounting<br />\nthem.<br />\nTABLE<br />\nD'HOTE<br />\nGovernment<br />\n•<br />\nResearch<br />\nThe Prom issue of the \"Black<br />\nThat<br />\nis<br />\na<br />\nkiss.<br />\nLUNCHEON-60c<br />\nDINNER—s1.00<br />\nThe Johns Hopkins Press has re- and Blue Jay,\" appearing March<br />\nNow since a kiss has been exSUNDAY DINNER—$1.25<br />\ncently taken over the publication of 20th, will be distributed to memplained, it is clear that there are<br />\nbooks issued by the Institute for bers of the fair sex attending the many good reasons<br />\nwhy a girl<br />\nGovernment Research. This will affair.<br />\nshould close her eyes when she is<br />\nThe subscription for the Junior being<br />\ninclude books heretofore published<br />\nkissed. She closes her eyes<br />\nProm is $3.50.<br />\nin<br />\norder<br />\nto forget all except that<br />\nand not out of print, as well as<br />\nAt the Washington Monument<br />\none<br />\nkiss;<br />\nshe closes her eyes to forths-.)se selected for publication from<br />\nPRINCETON PHYSICAL DIthat<br />\nget<br />\ntime is time ; she wants to<br />\nnow on. The Press has also brought<br />\nOscar Thomas Olson, D.D.<br />\nRECTOR WOULD LIMIT<br />\nshut out all material things and<br />\nout two new numbers in the series<br />\nMinister<br />\nATHLETICS<br />\nreally live for a moment if no Ionof Johns Hopkins University StudRadical chances in the contro'<br />\nr ; she wants to dream. for if she<br />\nies in Education, edited by ProfesHopkins Students Are Invited to<br />\nof<br />\nintercollegiate athletics are were to realize that the kiss were<br />\nsor Edward F. Buchner.<br />\nMake This Their Church Home<br />\nThe Institute for • Government suggested by Dr. Joseph E. Ray- really a fact, then she might have<br />\nResearch is an association of citi- croft, director of physical educa- heart failure from sheer happiness:<br />\nThe Sunday afternoon -At Home\"<br />\nzens for co-operating with public tion at Princeton. According to she tries to hide her eyes from het<br />\nin the 'Blue and Grey Room- from<br />\nlover, for she wishes to make him<br />\nofficials in the scientific study of<br />\nfive to seven, followed by the young<br />\nDr. Raycraft, consideration of think<br />\nthat he alone is being granted<br />\npeople's service will appeal to you.<br />\ngovernments.\" - Many very promithis<br />\nproblem<br />\nbrings<br />\nus<br />\nat<br />\nonce<br />\ngreat<br />\nprivilege; in short, and in<br />\nYou are invited.<br />\nnent men are connected with it as<br />\ntrustees. President Goodnow is a into touch with two relatively place of telling the thousand and<br />\nSunday morning worship at 1 1 o'clock—<br />\ntrustee and vice-chairman. Mr. W. new educational problems; the one other reasons that might be adSunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nF. Willoughby, lecturer at this uni- relation of athletics to other vanced, a girl closes her eyes when<br />\nwork<br />\nin<br />\nthe<br />\ninstitution,<br />\nand<br />\nthe<br />\nshe<br />\nis kissed because for one sweet<br />\nversity, is a director.<br />\nALL SEATS FREE<br />\nThe Institute has published a relations among educational in- moment she desires to forget that<br />\nstitutions<br />\nwhose<br />\npoints<br />\nconof<br />\nshe is mortal, desires to live above<br />\nlarge number of books dealing with<br />\nquestions of political science and tact have been greatly increased the clouds for a lifetime in one<br />\npolitical economy. These have been by intercollegiate competition. short span of seconds.<br />\nIn discussing these problems, Does that not explain why a girl<br />\nhandled by D. Appleton & Co., but<br />\nare now all obtainable through the in the Princeton Alumni Weekly, closes her eyes when she is kissed?<br />\nbook stores. The first book of the Dr. Raycroft draws an interest- If, kind reader, you think that it<br />\nTAILORS<br />\nInstitute to be published originally ing comparison between the old does not, then just let me know.<br />\nUniforms and Liveries<br />\nby the Hopkins Press is by Mr. Greek games and our present- From full experience—not being a<br />\nyou know—I will take you by<br />\n128 W. Fayette St., Near Liberty St.<br />\nWilloughby himself, \"The Reor- day era of athletics on a large<br />\nscale.<br />\nhand<br />\nthe<br />\nSeveral<br />\nlead<br />\nand<br />\namong<br />\nyou<br />\nthe<br />\nmodifications of<br />\n7-anization of the Administrative<br />\nBaltimore, Md.<br />\nBranch of the National Govern- our present athletic system are paths that only a favored few are<br />\nment.\" The first part of the book suggested by him, among which allowed to tread.—Clemson Tiger.<br />\ndescribes in great detail the present are the abolition of the training<br />\norganization of the administrative table, which he considers undem- CHRISTIAN SERVICE CLUB<br />\nNOTICE<br />\nin<br />\nthe<br />\ndepartments. The second suggests ocratic; a decrease<br />\nand individuality is offered here at prices that are not<br />\nThe meeting of the Christian<br />\nc:iarrzes—additions and rearrange- amount of money spent on coland<br />\ncannot be underquoted by any house at any time.<br />\nments—among the various depart- teg-e athletics, and the limiting Service Club, which was scheduled<br />\n41<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nments, with a view of making each of an athlete's eligibility from for tonight, has been postponed unis<br />\nback<br />\nof<br />\neach sale with a guarantee.<br />\nmore of a unit, and thus more ef- three years to two or even one. til Thursday, March 15, because of<br />\nExtracts from Dr. Raycroft's the Dramatic Club production. Dr.<br />\nficient.<br />\nCraig Stewart, of Illinois, who has<br />\nThe two new Studies in Educa- article follow :<br />\nFURNI1URE<br />\niDECORATIONS<br />\nDRAPERIES<br />\npreaching at Old St. Paul's<br />\nbeen<br />\ntion are \"The Measurement of \"One of the most serious feaNORTH<br />\n343<br />\nCHARLES<br />\nSTREET<br />\nAchievement in Shorthand,\" by El- tures of intercollegiate competi- Episcopal Church during the Lenmer R. Hoke, professor of Educa- tion is the tendency that crops ten season, will deliver an address.<br />\nBe good and you will be happy<br />\ntion at Lebanon Valley College, and out now and again toward an at\"The Improvement of Speed and titude of distrust and suspicion. —but you may be lonesome.—McAccuracy in Typewriting,\" by Roy This situation could be greatly Gill<br />\nEdward Hoke, professor of Educa- improved by arranging for more<br />\ntion at Birmingham Southern Col- opportunities for athletes and against unauthorized reports.<br />\nlege. The announcement of the lat- athletic authorities to meet sim\"In order to secure the full<br />\nter book states that the author ilar groups from other institu- value of athletic competitions<br />\n\"claims that a marked improve- tions. Sucli meetings would we need to inject in our athletic<br />\nment in speed and accuracy must make it possible for those most affairs more of the spirit, tradiinevitably follow [the adoption of concerned to become acquainted, tions and customs that are in<br />\nhis suggestions]. This Study should would serve as a sort of psycho- harmony with the ethical ideals<br />\nbring about a revolution in the field logical stabilizer, and would be and high purpose of educational<br />\nof typewriting.\"<br />\neffective<br />\nprotection institutions.\"<br />\na most<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nCLOTHES<br />\n<br />\nAthletic-looking<br />\nspring clothes you<br />\nare sure to like<br />\n<br />\nREADY-FOR-SERVICE<br />\n$30 UPWARD<br />\n<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nCH<br />\n<br />\nILLY<br />\n<br />\nRestaurant Francais<br />\n<br />\nMount Vernon Place Methodist Episcopal Church<br />\n<br />\nA. JACOBS 8z SONS<br />\n<br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nCorrect Furnishings for<br />\nthe College Man<br />\n<br />\nHUTZLER MEM<br />\n<br />\ne<br />\n<br />\n\f", "format": "basic_html", "processed": "'e.<br /><br />\n3<br /><br />\nVOL. XXVII. No. 38<br /><br />\nBALTIMORE, MD., MARCH 13, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nCARRIES OFF TOP<br />\nMUSICAL CLUB GIVES FIFTH TRIANGULAR 6EB E POST- DEAN LATANE CALLS HALT COACH VAN ORMAN MAK- RUTGERS<br />\nHONORS<br />\nAT EASTERN<br />\nING PLANS FOR BASKETON ABSENCES FROM<br />\nPONED BECAUSE OF EXCONCERT OF SEASON AT<br />\nINTERCOLLEGIATES<br />\nBALL TEAM<br />\nASSEMBLY<br />\nAMINATIONS<br />\nWESTMINSTER<br />\nof Team Next Year Johns Hopkins Finishes Second.<br />\nPossibility<br />\nWestern Maryland College Host Hopkins to Participate at Lexing- Objects to Disorder and Bad AtClose Races in Order. Von<br />\nPlenty of MaGood.<br />\nSeems<br />\ntendance. Criticism Well<br />\nton and Homewood Tryouts<br />\nto Black and, Blue Songsters<br />\nStemley Breaks Plunge<br />\nterial in School<br />\nfor Tocqueville Contest<br />\nTaken by Students<br />\nLast Friday Night<br />\nSwimming true to the dope<br />\nBecause of the increasing deAt the last assembly, Dean LaAt the request of the WashingThree hundred and fifty people<br />\nthe Rutgers College tanksheet,<br />\nthe<br />\nand<br />\nthe<br />\ncampus<br />\nmands<br />\nabout<br />\nheard the Hopkins Musical Club ton and Lee University, the Trian- tane expressed extreme dissatisfac- general popularity of the , sport, men. carried off top honors with<br />\nrender its fifth concert of this sea- gular Debates were postponed for tion with the order and attendance. there has been an unusual amount ease at the annual championships<br />\nson in the Alumni Assembly Hall one week, in view of the fact that At recent mass meetings the disorof effort expended to place a of the Eastern Intercollegiate<br />\nof the Western Maryland College their spring examination conflicted der has been especially noticeable<br />\nBlack and Blue basketball team Swimming Association held in<br />\nin Westminster last Friday night. with the original date of March 17.<br />\nattendance,<br />\nobjectionable.<br />\nThe<br />\non the floor next year. While the Swarthmore pool last Saturand<br />\nThe members of the club made The debates will be held on Saturtoo, has been far below what it there has been little said about the day.<br />\nthe trip to the up-state town in day, March 24, at 8 o'clock.<br />\nAlthough close races were in<br />\nshould be. Although the presence possibilities of a team so far this<br />\nmotor-buses arriving at the conuniformly slow times were<br />\norder,<br />\nLawrence B. Fenneman, Presiyear, the idea of having one has alcert hall just in time to start the dent of the Debating Council, an- of only freshmen and sophomores is<br />\nthe only record being<br />\nregistered,<br />\nways been present in the minds of<br />\nperformance on the hour sched- nounced that it has been finally required, the Dean would like to<br />\nthat of the plunge, in<br />\nbroken<br />\nwas<br />\nthe authorities. That Hopkins will<br />\nuled. The audiente which was agreed that the wording of the have as many upperclassmen as posStanley, the Rutgers<br />\nVon<br />\nwhich<br />\nbe represented on the basketball<br />\ncomposed principally of college question to be debated is as follows:<br />\nbantamweight,<br />\nwent 75 feet in<br />\nsible attend- the weekly meetings. court next year is now more than<br />\nstudents and _townspeople re- \"Resolved, That the United States<br />\nformer record<br />\nThe<br />\nseconds.<br />\n47<br />\n3-5<br />\na possibility. The game, since it is<br />\nceived the presentations with en- should. favor the cancellation of the The purpose of the assemblies is to<br />\nby Regad of<br />\nwas<br />\nheld<br />\nfeet<br />\nof<br />\n70<br />\nplayed indoors and the swift action<br />\nthusiasm, demanding encores to Inter-Allied war debt on condition create .and sustain college spirit in<br />\nLehigh.<br />\nmakes it especially interesting, has<br />\nfreshman and sophomore<br />\nnearly every number.<br />\nThe prowess of the Rutgers<br />\nthat the German indemnity be ma- the<br />\ndrawn<br />\nlarge crowds in Baltimore all<br />\nThe concert was started by The<br />\nthis<br />\nply-PCr^rnp1;<br />\n11<br />\nclasses.<br />\nmermen<br />\nis demonstrated by the<br />\nterially reduced.\" These debates<br />\ninter. If Hopkins should 'present<br />\nGlee Club singing \"Old Black<br />\none of their number finfact<br />\nthat<br />\nshould be very well attended be- pose, the presence of a large num- a first-class combination and should<br />\nJoe,\" and \"Honey, I Wants Yer<br />\nin every event except<br />\nished<br />\nfirst<br />\ncause of their immediate interest. ber of upperclassmen is necessary. engage in games with the best of<br />\nNow.\" Although this organization<br />\ndash, in which Crownthe<br />\n50<br />\nyard<br />\nThe negative team will entrain for<br />\nIn regard to the disorder, Dr. colleges and universities, according<br />\nwas weakened by the Absence of<br />\nSwarthmore<br />\nace, nosed<br />\nthe<br />\nover,<br />\nLexington, Virginia, where they<br />\nLatane said that he believed it was to athletic authorities, the success out Bob Welsh of Hopkins by a<br />\nseveral basses and three tenors,<br />\nwill engage the Washington and<br />\nof such a team as a drawing card<br />\nthese pieces were renderd with<br />\nlargely the result of thoughtlessmatter of inches. Both Welsh and<br />\nin heated arguUniversity<br />\nLee<br />\nwould be assured.<br />\nexthat<br />\nwas<br />\nthe same versatility<br />\nfinished ahead in their<br />\nreminded<br />\nI3uhrer<br />\nthe students<br />\nment. Those on the team are: ness. He<br />\nThe Fifth Regiment officials have<br />\nhibited at the Maryland Casualty<br />\nMessrs. Charles C. G. Evans, Sam- that a decent respect for others, made several propositions to Dr. heats.<br />\nClub concert.<br />\nGiebel was again the individual<br />\nuel S. Isenberg and Rignal W. resulting from a proper self-respect, Ray Van Orman. They propose<br />\nThe Mandolin Club was reBaldwin, Jr., as alternate. • Mr. should be felt and shown at all to have Hopkins stage games in star of the meet. The Rutgers<br />\nceived with great applause, being<br />\nEvans; an experienced debater, aid- times on the campus and at these conjunction with the Fifth Regi- captain finished first in the 100literally forced to play two extra<br />\ned in 'be victory over the Iiniver- meetings. The Dean advised the ment Association. The Fifth Reg- yard swim and the back stroke<br />\npieces. Mr. McCauley's charges<br />\nMaryland a few weeks.ago, cultivation of self-reverence, self- iment could, according to the prop- and swam anchor man on the vicwere met with the same appre- sib,- of<br />\nwas a potent factor in the win- knowledge, and self-control as as- osition, stage their games first and torious relay.<br />\nciation that has been accorded and<br />\nIn the back stroke, Leo had<br />\ndebate in the early sets that would be of value the Hopkins attraction would folthem at each concert this year. ning of his class<br />\nthings<br />\nhis own way but in the 100<br />\nthe year. Mr. Isenbcg, it throughout life.<br />\nlow. A dance would complete the<br />\n\"The Minute March,\" their first part of<br />\ngave him the scare of his<br />\nWelsh<br />\ntecalled, helped his class<br />\nAfter the roll was called the program,. with music furnished by life. Despite the prevailing slow<br />\npiece, was followed by a selection will he<br />\nAdams Delate Dean stated that all absentees will the undergraduate orchestra. •<br />\nof popular songs. The audience materially in the<br />\ntimes this race was swum off in<br />\nAli be required to meet him at an aSoratory_<br />\nbrilliant<br />\nwith<br />\nAftcr two years' absence from<br />\ngreeted the maridolin aird banit.)<br />\n58 seconds with Welsh pressing<br />\nplayers with the same enthusi- Baldwin was alternate in the latter sembly at a time which he will.des- the court a team would be wel- the Rutgers star throughout the<br />\ndebate.<br />\nignate, in order that he may re- comed by the men in the university distance.<br />\nasm each time they appeared.<br />\nThe affirmative team will engage mind them of what is required in who have the ability to play but beOwing to the failure of one<br />\nThe 100 yard breast stroke<br />\ncause of the lack of a team have caused a few thrills. Potts of Rutmember to appear, the quartet the University of North Carolina at regard to attendance and order.<br />\nwas reduced to a trio. In spite of Homewood.in a verbal battle:Those<br />\nPrevious to Dean Latane's talk, been prevented from participating gers and Dunning of Hopkins<br />\nthe reduction this organization who will represent Hopkins are: President Sherwood, of the Stu- in the sport.<br />\nstarted of neck and neck. They<br />\nDr. Van Orman has already re- kept on even terms throughout<br />\nwas accorded as hearty a recep- Frederick L. Moehle, Bernard T. dent Council, also called the stution as ever. After singing \"If I Bamberger and William R. Barn- dents' attention to the disorder ceived several requests for games the race, Potts winning the event<br />\nWere a Cat,\" John Sherwood and hart as alternate: Bamberger was which has been so noticeable. The for next year, and, at present, is by an eyelash.<br />\nhis two aiding voices were joined alternate in the Hopkins-Maryland, students showed their approval of planning a tentative schedule.<br />\nRidgely Howard gave Von<br />\nby Don Vanneman for a presen- and Adams. Debates, and spoke the Dean's talk by cheering him There is believed to be a valuable Stanley a rub in the plunge the entation of \"Johnny Schmoker.\" in the class debate last year. Moehle heartily at the close of the assem- amount of talent available for this tire length of the pool for a secThis ancient ditty set the audience upheld the rebuttal in the class de- bly.<br />\nteam.<br />\nond place. He took the entire time<br />\nbates during his. freshman and<br />\ninto gales of laughter.<br />\nallowed for this feat.<br />\nTheir mirth was added to by sophomore years.<br />\nSPRING SPORT TICKET SALE MR. SHAEFFER'S ADDRESS<br />\nRutgers got a runn;ng start in<br />\nFEATURES ELECTRICAL<br />\nThe two presentation speeches<br />\nJoe Moran in his amusing imperTO BEGIN SOON<br />\nthe<br />\n200 yard relay and captured<br />\nCLUB MEETING<br />\nsonation of Joe Cook. He was will be 25 minutes in length, while<br />\nthis<br />\nevent by several yards, HopGraduate Manager Norman C. The first meeting of the Johns<br />\nably assisted by Dal Kirwan, the rebuttal will have only ten min- Keyes is now formulating<br />\nkins,<br />\nSwarthmore and Lehigh finplans Hopkins Electrical Club since the<br />\nwho had previously drawn hearty utes.<br />\nishing<br />\nin the order named. Coady,<br />\nfor the annual spring ticket sale election of the new officers was<br />\nC9ntinued on page 2, col. 3<br />\napplause in his own solo act. Imcampaign which is to begin held last Friday afternoon in the swimming first for the Black and<br />\nmediately following Moran's imwithin the next fortnight. The M. E. Building. The members were Blue, obtained a poor start. The<br />\npersonation the Blue Jay Jazz SOPHOMORES ELECT KLINEentire<br />\nundergraduate body will addressed by Mr. Shaeffer, who remaining Hopkins swimmers<br />\nFELTER TREASURER<br />\nBand played the latest dance hits.<br />\nAt a special meeting of the be organized for the campaign. took for his subject \"Thermonic closed up the gap but found themAs a proof of the Jazz Band's<br />\nSophomore Class held in the C. Teams, such as were utilized last Tubes in Radio Telegraphy and selves unable to forge to the front.<br />\nability to produce sufficient syn- E. Hall last Wednesday at 12:20<br />\nAt the annual meeting of the E.<br />\nyear, will be drawn up and ac- Telephony.\" Due to the timely subcopation for modern \"stepping\",<br />\nP. M., George Klinefelter was tive inter-team competition will ject, and its particular interest to I. S. A. A. bronze tablets were<br />\nClarence Adams did a clog to the<br />\nelected to succeed \"Bill\" Towner ensue. Prizes will be given for electrical men, the meeting was awarded to Rutgers and Lehigh<br />\ntune of \"Three O'clock.\" Adams<br />\nfor winning the championship of<br />\nas class treasurer. After a re- the team, individual and class well attended by members.<br />\ngained in Westminster the disthe league (computed by standing<br />\ncount of ballots it was found selling the most tickets.<br />\nThe new officials at the meeting<br />\ntinction of being one who can<br />\nthat George Klinefelter had won<br />\nAccording to athletic authori- were J. T. Dixon, president P. K. in dual meets) in 1923 and 1922,<br />\n\"sho' strut his stuff.\"<br />\nassociation<br />\nrespectively. The<br />\nInstrumental solos were ren- over \"Mike\" Tilghman by a ties, five thousand dollars is nec- Aubel, vice-president: Ferdinand changed the 100 yard backstroke<br />\nplurality of one vote.<br />\nessary to carry on the spring S. Hamburger, Jr., treasurer, and<br />\ndered by Hambleton on the guitar,<br />\nevent to 150 yards and the 100<br />\ndesign<br />\nfor<br />\na<br />\nring<br />\nThe<br />\nwas<br />\nsubsports, the best colleges in thee J. H. Long, Jr., secretary. The<br />\nSater on the piano and Mr. Mcbreast stroke to 200 yards. The<br />\nCauley on the banjo. Bill Fargo mitted to the class by the ring East will compete at Homewood other officers who were elected at names of Catholic University and<br />\nplayed a guitar accompaniment and pin committee, and formally and liberal guarantees have been the last meeting are Paul L. Betz, of New York University were prochairman of the Program Commitfor Hambleton. Sater's piano solo accepted. It will be of solid gold offered.<br />\nposed and discussed as to memAs usual, a discount on the tee: C. H. Black, chairman of the<br />\nwas received by a hearty applause and have the University seal debership in the league but definite<br />\nand a demand for an encore. Mr. signed on one side. Upon the tickets will be allowed prepara- Menibership Committee, and C. 0. action was postponed.<br />\nother side, with the student's tory school pupils. At the time Rector chairman of the Publicity<br />\nContinued on page 3 col. 2.<br />\nAt this meeting Fitzgerald<br />\nclass numerals, will be a symbol, that the campaign opens, the Committee.<br />\nDunning of Johns Hopkins, was<br />\nrepresenting the department of spring schedules will be officialThe programs for the future unanimously elected vice-presiTocqueville Contest trythe university with which the ly released. The tickets will in- monthly meetings of the club will<br />\ndent of the association for the enouts Thursday, March 15th,<br />\nstudent is affiliated. That is, clude admission to all baseball, continue to feature addresses by<br />\nsuing year.<br />\nSee Mount. •<br />\nacademic, engineering or medi- track and lacrosse games on prominent engineers and students.<br />\nSummaries:<br />\ncal. A bloodstone onyx or some Homewood Field, excluding the So far this year meetings have<br />\nMeeting of entire News50-yard Dash—Heats: First,<br />\nother'stone of similar value may contests held during June Week, proved very successful, and the won by Buhrer, Hopkins; second,<br />\nLetter Staff today at 12.30.<br />\nElection next year's Board<br />\nbe chosen by the individual. which will be under control of new officers will adhere to the same Baker, Swarthmore; third, Schaefof eontrol.<br />\nContinued on page 3, col. 3<br />\nthe June Week Committee.<br />\nplans in selecting programs.<br />\nContinuod on page 3, col. 1<br /><br />\nTo<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1923<br />\nTriangular Debate Postponed<br />\nContinued from page 1<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br /><br />\n_<br /><br />\nThe debates will be under the supervision of the Debating Council.<br />\nFOUNDED 1897.<br />\nDr. John C. French will act as<br />\nchairman at the Homewood debate.<br />\nFollowing the conclusion of the arSubscription<br />\n$2.00 guments, an informal dance will be<br />\ngiven, the music will ,be furnished<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nby \"The Blue Jay Six.\"<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nParker C. Williams was chosen<br />\nPublished semi-weekly from October to June by the students of Johns by Dr. French from a large numHopkins University.<br />\nber of candidates to represent Hopkins in the Southern Oratorical<br />\nBusiness communications should be addressed to the BUSINESS MAN- Contest. The reward<br />\nfor the winAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nner of this contest, which will be<br />\nheld at Homewood April 14, will<br />\nHomewood<br />\n100<br />\nTelephone<br />\nbe a sum of money and the title of<br />\n\"Southern Collegiate Orator.\" Dr.<br />\nFrench is desirous that Hopkins<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nshould<br />\nretain the title won for it<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nlast<br />\nyear<br />\nat the University of TenManaging Editor:<br />\nAdvertising Manager:<br />\nnessee, by Albert G. Langeluttig,<br />\nJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nJr., who is president of the League.<br />\nAssistant Managing Editor:<br />\nCirculation Manager:<br />\nThe Universities in the Southern<br />\nJOSEPH S. LEOPOLL '24.<br />\nPHILIP<br />\nW.<br />\nHOWARD,<br />\n'25.<br />\nOratorical<br />\nLeague are Johns HopAssociate Editors<br />\nkins,<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nKentucky, Sewanee, North<br />\nAssistant Business Managers:<br />\nWILLIAM G. DEAN, JR., '24.<br />\nCarolina,<br />\nAlabama and Vanderbilt.<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nThe tryouts for the Adams ConT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\ntest in oratory and the Tocqueville<br />\nJunior Editors:<br />\nD. MILES MARRIAN, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\nContest in oral discussion will be<br />\nG. DONALD GIESKE, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nheld<br />\nin the near future by Dr.<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nFrench. The Debating Council<br />\nW. EDWARD THOMSEN, '26.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nwill hold an election of officers<br />\nERNEST A. STRATHMAN, '26.<br />\nA. J. McKAY, '26.<br />\nshortly and at the same time will<br />\nelect one Freshman,_ one Sophomore, and one Junior to the<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nCouncil to represent their respective classes next year.<br />\nPrinted by The Read-Taylor Co., Lo mbard and South Sts.; Baltimore, Md.<br /><br />\nQ.E.D.<br />\nHOW me,\" says the math. teacher—and<br />\nwhen the chalk clouds have settled down<br />\nthere are a lot of figures signed\"O.E.D.\"<br />\nwhich aren't \"Q. E. D\" at all.<br />\nSay \"Show me\" to the shaving cream you're<br />\nusing and see what answer you get. Will it soften<br />\nyour beard right down to the base before the<br />\nbreakfast bell has rung twice? Will it leave your<br />\nskin smooth and supple after every shave and give<br />\nyou the well-groomed look of perfect skin health?<br />\nEvery day men are finding how much easier<br />\nshaving can be made because of the speed and<br />\nthoroughness with which<br />\nNotice the hinged<br />\ncap. You can't<br />\nWilliams' softens the<br />\nlose it—and the<br />\ntube hangs up 1<br />\nbeard. Likewise,they are<br />\nfinding a help for their<br />\nskin in Williams'thatthey<br />\nnever found in any other<br />\nshaving cream. Try it<br />\nyourself. The difference<br />\nmay surprise you.<br /><br />\ntt<br /><br />\nAMIN<br /><br />\nWilliami<br />\nShaving Cream<br /><br />\nBALTIMORE, MD., MARCH 13, 1923<br />\nROBB .2Z_77<br /><br />\n.3 0 1\"L E<br /><br />\nA<br /><br />\nX ..R.....<br /><br />\n..P<br /><br />\nU M _ZD<br /><br />\nST. JOHN'S PRESIDENT-ELECT<br />\nIf Professor R. V. D. Magoffin accepts the presidency of St. John's<br />\nCollege, the undergraduates of Johns Hopkins will lose one of their best<br />\nfriends. The genial instructor of archaeology is by far one of the most<br />\npopular members of the faculty.<br />\nThe seniors recently showed their appreciation of Dr. Magoffin's<br />\ninterest in student affairs by selecting him as the faculty member of<br />\nJune Week Committee. He is one of that rare variety of professors<br />\n• that is as broad of heart as of mind. It is a safe venture to say that<br />\nhe has a closer understanding of students than any of our faculty members. Most any day he may be found during lunch hour mingling with<br />\nthe \"young hope.\" The democratic smile and friendly chat will be<br />\nmissed.<br />\nDr. Magoffin could, probably, work wonders at St. John's; yet<br />\nwe can hardly help but hope that he will risk the chance of future advancement at Hopkins. Dr. Fell presided over the Annapolis institution for twenty-seven years, if press accounts may be trusted, yet the<br />\ncollege has received a lower rating in the past few years. And if memory serves, the first president of the University of Pennsylvania was<br />\ntaken from the president's chair at St. John's. If Dr. Magoffin will<br />\neventually attain the position that his personality deserves, we will, with<br />\nregret, be willing to part with him. But unless he will be allowed to<br />\nplace himself and his institution upon the plane where they belong, we<br />\nprefer that he will remain with us.<br />\nWe congratulate Dr. Magoffin on his election. We congratulate<br />\nSt. John's on her selection, and we further congratulate her if the<br />\nDoctor accepts.<br />\nHopkins' loss will be St. Johni's gain!<br /><br />\nThe \"PRACTICAL\" Alchemist and<br />\n\"THEORETICAL\" Robert Boyle<br />\nHE alchemists wrote<br />\nvaguely of \"fluids\" and<br />\n\"principles.\" Copper<br />\nwas potentially silver.<br />\nRid it of its red color and the<br />\n\"principle\" of silver would assert<br />\nitself, so that silver would remain.<br />\nWith a certain amount of philosopher's stone (itself a mysterious<br />\n\"principle\") a base metal could be<br />\nconverted into a quantity of gold<br />\na million times as great.<br />\nThis all sounded so \"practical\"<br />\nthat Kings listened credulously,<br />\nbut the only tangible result was<br />\nthat they were enriched with much<br />\nbogus gold.<br />\nScientific theorists like Robert<br />\nBoyle (I62.7-1691) proved more<br />\n\"practical\" by testing matter, discovering its composition and then<br />\ndrawing scientific conclusions that<br />\ncould thereafter be usefully and<br />\nhonestly applied. Alchemists conjectured and died;he experimented<br />\nand lived.<br />\nUsing the air pump Boyle undertook a \"theoretical\" but sci-<br /><br />\nADVANCEMENT OF ELECTIONS<br />\nOne of our greatest difficulties in student activities has been the<br />\ninexperience of the officers, upon assuming their duties at the start<br />\nof the year. The executives of the preceding term have usually graduated and the usual errors of the office repeated instead of eliminated.<br />\nThe Omicron Delta Kappa Society has realized this fact and has,<br />\nconsequently, been endeavoring for the past few months to have the<br />\ntime of elections moved up to a date as near the beginning of the second<br />\nsemester as possible. All of the organizations, with the exceptions of<br />\nthe Athletic Board and the Student Council, have agreed to elect at<br />\nthis date.<br />\nIt is believed that a greater efficiency and a more responsible method<br />\nof financing will result. Seniors who hold office have lesser interest in<br />\nthe financial success of their respective organizations when they realize<br />\nthat they will not have to worry one way or the other. A junior, however, will aim to protect himself for the ensuing year.<br />\nThe plan should mean a great improvement.<br /><br />\nentific experimental study of the<br />\natmosphere and discovered that<br />\nit had a \"spring\" in it, or in other<br />\nwords that it could expand. He<br />\nalso established the .connection.<br />\nbetween the Boiling point of water<br />\nand atmospheric pressure, a very<br />\n\"theoretical\" discovery in his day<br />\nbut one which every steam engineer now applies.<br />\nHe was the first to use the term<br />\n\"analysis\" in the modern chemical sense, the first to define an<br />\nelement as a body which cannot<br />\nbe subdivided, and from which<br />\ncompounds can be reconstituted.<br />\nBoyle's work has not ended.<br />\nToday in the Research Laboratories of the General Electric<br />\nCompany it is being continued.<br />\nMuch light has there been shed<br />\non the chemical reactions that<br />\noccur in a vessel in which a nearly<br />\nperfect vacuum has been produced.<br />\nOne practical result of this work<br />\nis the vacuum tube which plays an<br />\nessential part in radio work and<br />\nroentgenology.<br /><br />\nGen.er al Elediric<br />\nOffice company<br />\ngeneral<br /><br />\n4-<br /><br />\nSchenectaily,N.Y:<br />\n95-625D<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1923<br /><br />\n3<br /><br />\nCOLLEGE MEN AND<br />\nIMAGINATION<br />\n\"The -college man does not<br />\nthink for himself; he lacks originality and imagination.\" This is<br />\nthe expressed opinion of many socalled self-made men.<br />\nAt first the statement appears<br />\ntoo broad and generally unfounded to merit any great degree of<br />\nN.Charles Street<br />\nStacomb keeps hair in place<br />\nconsideration. It is, however, an<br />\nBRANCH<br />\nTOM LANDY,<br />\n, all day—No more trouble<br />\nopinion current in certain not too<br />\nAT THE BARN<br />\nManager<br />\nwith rumpled hair.<br />\nwell informed circles and for that<br />\nyour<br />\nwashing<br />\nafter<br />\nalso<br />\nIdeal<br />\nhair—supplies natural, benereason should be refuted and exficial oils which add life and<br />\nThe Flag, Banner &amp; Pennant Shop<br />\nplained.<br />\nORDERS RECEIVED FOR<br />\nlustre and keep the hair in place.<br />\n(Successors to Sisco Brothers)<br />\nSome great thinker once said<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nAsk your barber for a StaEmblems, Silk Banners for Schools,<br />\nCOGGINS'<br />\ncomb Rub.<br />\nthat no man thinks originally or<br />\nSocieties and Fraternities<br />\nall<br />\nAt<br />\ndruggists.<br />\ngives his imagination full play as<br />\nand Baggage Express<br />\nTransfer<br />\nREC. U.S. PAT. OFFICE<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nAUTOMOBILE SERVICE<br />\nlong as he moves in the associaVernon 2355<br />\nR. H. Taylor<br />\nMakes the Hair Stay Combed<br />\ntion of other men. He is bound to<br />\nPHONE, HOMEWOOD 6886<br />\nassimilate; to learn and to embellish his own ideas with the viewpoint of another. The only man<br />\n1 W. University Parkway<br />\nwho can absolutely think for himOpposite J. H. U. Athletic Field<br />\nself is he who can-- utterly isolate<br />\nDRUG STORE for J. H. U. BOYS<br />\nhimself from the environment of<br />\nPHONE, HOMEWOOD 2121<br />\nWe have purchased 122,000<br />\nother men and who sets himself<br />\npair U. S. Army Munson last<br />\n2 to 12 which<br />\n/<br />\nHot Dinners, Sandwiches,<br />\nshoes, sizes 51<br />\nfar enough from civilization to be<br />\nwas the entire surplus stock<br />\nalone. There he can best approxiCandies, Sodas, Cigarettes,<br />\nof one of the largest U. S.<br />\nPrinters of Philological and<br />\nmate the--mGn- who_ pioneered-contracshoe<br />\nGovernment<br />\nScientific Works<br />\nTobacco, etc.<br />\nwho had to meet necessity upon<br />\ntors.<br />\noscAR G.1-51<br />\n23<br />\nS. HANOVER ST.<br />\none<br />\nno<br />\nWith<br />\ntheir own resources.<br />\nowNERs<br />\nThis shoe is guaranteed one<br />\nAT THE BARN<br />\nBaltimore, Md.<br />\nabout them they can -indulge in a<br />\nhundred per cent. solid leathilbt•C\"4 r4<br />\nwill<br />\nwhich<br />\ndegree of introspection<br />\ner, color dark tan, bellows<br />\n29 Baltimore St., Eust<br />\ntongue, dirt and waterproof.<br />\nland them on a basis for original<br />\nOns Door West of LiglA St.<br />\nThe actual value of this shoe<br />\nand imaginative thought.<br />\nSOLE AGENTS FOR BALTIMORE<br />\n$6.00. Owing to this treis<br />\nman<br />\nno<br />\nFor College Fraternity Bands<br />\nThus it is obvious that<br />\nmendous buy we can offer<br />\n(Greek Letter Societies)<br />\nmoving in society is free from the<br />\nsame to the public at $2.95.<br />\ninfluence of environment. He is Send correct size. Pay postman on<br />\nconstantly learning from others. delivery or send money order. If<br />\n'<br />\n``The King of Lubricants.<br />\nHe has little time to shut himself shoes are not as represented we<br />\nmoney<br />\nyour<br />\nrefund<br />\ncheerfully<br />\noff long enough to let his mind will<br />\noperate originally on his own par- promptly upon request.<br />\nticular line.<br />\nAmerican Journal of Mathematics. Edited by Frank Morley, A. Cohen,-AsHow much more, then, is it imsistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\npossible for a man in college to<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nper volume. (Foreign postage fifty cents.)<br />\nemploy much imagination. His en- 296 Broadway, New York, N. Y.<br />\nAmerican Journal of Philology. Edited by C. W.E. Miller, with the co-operatire time and energy is taken up<br />\nPerfected by the Makers<br />\ntion of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robinwith the assimilation of facts<br />\nOf Betholine<br />\nson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\nBack<br />\nStroke—Won-by<br />\n100-yar4<br />\nfrom others— and with learning<br />\n(Foreign postage, fifty cents.)<br />\nSHERWOOD BROTHERS, INC.<br />\nmen and their ideas. If ever in his Giebgl, Rutgers; second, Mitchell,<br />\nAmerican Journal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nlife he is justified in lacking origi- Rutgers; third, Morrell, Hopkins; 1:3:1111EITIMMETIMIIIII1713111:11.12111:113EMETal<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nnal thought it is in college for fourth, Quick, Lehigh. Time,<br />\nSophomores Elect Klinefelter Beitrage zur Assyriologie und semitischen Sprachwissenschaft. Paul Haupt<br />\nthere his business is to take on 1 :11 4-5.<br />\nand Friedrich Delitzsch, Editors. Volume X in progress.<br />\nTreasurer<br />\n100-yard Breast Stroke—Won<br />\nknowledge and acquire the tools<br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nContinued from page 1.<br />\nwith which his imagination may by Potts, Rutgers; second, DunSeventeen numbers have appeared.<br />\nBrenner,<br />\nthird,<br />\nHopkins;<br />\nning,<br />\nall<br />\n11<br />\nto<br />\nvi<br />\n\\<br />\ndesign<br />\nbe<br />\nreferred<br />\nThis<br />\nyears.<br />\nlater<br />\nwork in<br />\nJohns<br />\nHopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progThe whole fault with the above Rutgers; fourth, Glenn, Rutgers. the classes for approval and the<br />\nress. $4 per year. (Foreign postage, fifty cents.)<br />\nSophomore class hope that Omistatement in regard to college Time, 1 :21 1-5.<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nRoss,<br />\nby<br />\nSwim—Won<br />\n220-yard<br />\nwith<br />\nand<br />\ncom<br />\noriginality<br />\nDelta Kappa will support<br />\nmen lacking<br />\nvolume. (Foreign postage, fifty cents.)<br />\nthose who advanced this idea is, Rutgers; second, Redmond, Rut- them in their effort to have a Johns Hopkins University Circular, including the Presidents' Report, Annual<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\nthat they have taken a bare state- gers; third, Coady, Hopkins; uniform Hopkins ring adopted.<br />\n$1 per year.<br />\nment out of its context and _have fourth, Foster, Rutgers. Time, Attention is called to the Forattempted to establish it. Throw 2:383-5 (time heats).<br />\nmal Sophomore Prom, to be held Johns Hopkins University Studies in Education. E. F. Buchner, Editor. 8vo.<br />\nSeven numbers have appeared.<br />\nStanley,<br />\nVon<br />\nby<br />\nPlunge—Won<br />\nthethe light of reason on such a<br />\nin the C. E. Hall on April 20.<br />\nHopHoward,<br />\nsecond,<br />\nJohns<br />\nRutgers;<br />\nHopkins University Studies in Geology. E. B. Mathews, Editor. 8vo.<br />\nand<br />\nory and find out the clauses<br />\nTickets are for sale at three<br />\nFour numbers have appeared.<br />\nRutgers;<br />\nSparks,<br />\nthird,<br />\nkins;<br />\ndeconditions which justify and<br />\ndollars a piece. It should be<br />\nHopkins University Studies in Historical and Political Science. Under<br />\nfine it, and you have a condition fourth, Hambleton. Distance, 75 remembered that a limited sup- Johns<br />\nthe direction of the Departments of History, Political Economy and Politisec.<br />\n3-5<br />\n47<br />\nft.,<br />\ncal Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nnot at all uncomplimentary to colply will be sold.<br />\nFancy. Dive—Won by Gallege men. It is perfectly natural<br />\nModern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum, W.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nand in the due course of things. It braith, Rutgers; second, Subin,<br />\nTAG DAY TOMORROW<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nRutgers; third, Repp, Swarthshould not be otherwise.<br />\nFriTomorrow, Thursday and<br />\nof Economic Tracts. J. H. Hollander, Editor. Fourth series in progAcquire an education in college more; fourth, Childs, Lehigh.<br />\nday will constitute one of the last: Reprint<br />\nress. $2.00.<br />\nRutby<br />\nRelay—Won<br />\n200-yard<br />\nand it will serve as the basis for<br />\nseries of \"Tag Days\" for the year.<br />\nimagination and original thought gers (Foster, Ross, Enander and It is particularly necessary that the Reports of the Maryland Geological Survey. Edited by E. B. Mathews.<br />\nin business and professional life. Giebel); second, Hopkins (Coady, whole student body support the Terrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nLor(l, Buhrer and Welsh); third,<br />\n—Daily Californ;an.<br />\ncommittee to the limit.<br />\npostage, 25 cents.)<br />\nSwarthmore (Martin, Ruah, BaCommittee<br />\nThe<br />\nhas<br />\nWeek<br />\nJune<br />\nRUTGERS CARRIES OFF TOP HON- ker and Crownover); fourth, Leengaczed the entire twelfth floor of<br />\nORS AT EASTERN INhigh. Time, 1 :48 3-5.<br />\nTERCOLLEGIATES<br />\nthe<br />\nBelvedere Hotel for the evenScore—Rutgers, 56;<br />\nPoint<br />\nContinued from page 1<br />\n156 pp. $1.50.<br />\ning<br />\nof June 12. This includes all The Eclogues of Baptista Mantuanus. By W. P. Mustard,<br />\nfer, Lehigh. Time, :27 1-5.<br />\nJohns Hopkins, 23; Swarthmore,<br />\nthree ballrooms. An elaborate buf- The Piscatory Eclogues of Jacopo Sannazaro. By W. P. Mustard. 94 pp. $1.25.<br />\nSecond Heat: Won by Welsh, 13; Lehigh, 5.<br />\nfet supper has been arranged The Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W.P. MusHopkins; second, Enander, Ruttard. 123 pp. $1.50.<br />\nand the Pennsylvania Serenaders<br />\ngers; third, Martin, Swarthmore. MUSICAL CLUB GIVES FIFTH CONWest Florida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nhave been definitely engaged.<br />\nCERT OF SEASON<br />\nTime, :27.<br />\nAll this has been contracted for An Outline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nContinued from page 1<br />\nThird Heat: Won by Crownnot The Life and Stories of the Jaina Savior Pargvanfitha. By M. Bloomfield.<br />\nover, Swarthtmcre';' second, Ca8s, McCdtiley as usual astonished the and while the contractors. do<br />\n256 pp. $3.00.<br />\ndo<br />\nthey<br />\ndemand<br />\ndeposits,<br />\ndemand<br />\n\"make<br />\nto<br />\nability<br />\nhis<br />\nby<br />\nutgers; third, Cheel, Lehigh. listeners<br />\nbank references. Hence the com- American Citizenship and Economic Welfare. By J. H. Hollander. 132 pp. $1.25.<br />\nhis banjo talk.\"<br />\nTime, :26 3-5.<br />\nmittee is anxious to get as much Martial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nfollowing<br />\nThere was no dance<br />\nFinal Heat: Won by CrownW. P. Mustard. 180 pp. $2.<br />\nmoney as possible in order to have<br />\nwhich<br />\nin<br />\nover, Swarthmore; second, Welsh, the concert as the hall.<br />\nHistory of Rome to the End of the Republic. By Tenney Frank.<br />\nEconomic<br />\nAn<br />\nHopkins; third, Cass, Rutgers; the performance was given is built a presentable bank account.<br />\n310 pp. $2.50.<br />\nfourth, Cheel, Lehigh. Time, as an auditorium with tiers of The definite program for June Public Health and Insurance: American Addresses. By Sir Arthur Newsholme.284 pp. $2.50.<br />\nseats. This hall was the only one Week is nearing completion, and<br />\n:27 1-5.<br />\n100-yard Dash—Won by Gie- available in. Westminster, the ar- will Soon be released. A combina- China at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nbel, Rutgers; second, Welsh, mory which was to have been tion ticket will be sold. This will Tables of V1—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nBy J. R. Miner. 50 pp. $1.50.<br />\nCrownover, used having suffered from the ex- admit to all the functions of the<br />\nthird,<br />\nHopkins;<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\nVector<br />\nSwarEimore ; fourth, Ross, Rut- plosion of a heating boiler a few week. The price will depend upon<br />\n$2.75.<br />\nthe returns of this tag day.<br />\ndays before.<br />\nA complete list of publications sent on request.<br />\ngers. Time, :58.<br /><br />\nMakes Hair<br />\nStay Combed<br /><br />\ncusk\"<br /><br />\nR.G.by &amp; Company<br /><br />\nThe BARN<br /><br />\nPUBLIC SALES<br /><br />\nCAFETERIA<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nThe Johns Hopkins Press<br />\nof Baltimore<br /><br />\nNational Bay State<br />\nShoe Company<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 13, 1 92 _?<br />\nJUNIOR PROM TICKETS SELLING FAST<br /><br />\nWHY A GIRL CLOSES HER<br />\nEYES WHEN SHE IS<br />\nKISSED<br />\nAccording to Conrad R. Ken(THE BOOK MART)<br />\nnedy, chairman of .the Junior<br />\nYes, it is perfectly true that a<br />\nComplete Stock of<br />\nProm Committee, tickets for the girl closes her eyes when she is<br />\nMedical Books and College<br />\nJunior formal affair to be held in kissed. Not being a girl,<br />\nI can't<br />\nRequisites<br />\nthe Civil<br />\nEngineering Hall<br />\nspeak from exeprience, but I have<br />\nImporters and Dealers in Fine Books<br />\nMarch 23 are being snatched up<br />\ntaken a peep now and then and sure<br />\nwith rapidity.<br />\n301 N. CHARLES ST.<br />\nDue to the limited space in the. enough what people say is perfectBaltimore, Md.<br />\nhall, the sale of tickets has been ly right. Why ? That's really too<br />\nrestricted and each of the eight easy to answer—about as easy as<br />\nmembers of the committee has writing in Hebrew what the Sphinx<br />\nPrinters of the<br />\nbeen allowed but ten tickets to is thinking in some other dead and<br />\nJohns Hopkins News..Letter<br />\n(lispose of. Some of the mem- forgotten language.<br />\nBefore a person can get very far<br />\nbers already report that all of<br />\ntheir tickets have been sold. The along with an explanation, he must<br />\ndance is to be open to the entire understand just what a kiss really<br />\nUniversity and members of the is. Now a kiss is only a spontanJunior Class who are desirous of eous generation of the demonstraattending are advised to procure tion of the affection expressed in<br />\nterms of two red lips pressed close<br />\ntheir tickets immediately.<br />\ntogether;<br />\na sublime blissful etherAs has been previously aneal<br />\nmoment<br />\nwhen for the time benounced, Louis Fisher's welling there are only two people in<br />\nknown orchestra will furnish the<br />\nmusic. Decorations for the af- the world and all the rest does not<br />\nmatter; a never-to-beforgotten secfair are in charge of Isaac Hamond which is snatched from the<br />\nburger, Art Director of the Dravery hands of time; and last, a kiss<br />\nmatic Club, and the hall promises<br />\nis love's expression that makes itto be elaborately adorned.<br />\nCollege Literature<br />\nself felt long after the kiss is only<br />\nFourteen dances and four exa memory of one supreme moment<br />\nLOMBARD and SOUTH STREETS<br />\ntras have been arranged by the<br />\nwhen the entire Universe stood still<br />\n518 N. CHARLES STREET,BALTIMORE<br />\ncommittee. Intermission will be<br />\nand waited, and when old Father<br />\nheld and supper served after the<br />\nTelephone, Vernon 3442<br />\nOrchestra—Dancing<br />\nHopkins Press to Publish Books eighth dance. Dancing will last Time showed signs of weakening,<br />\nfor once allowing the seconds to<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nIssued by the Institute for<br />\nfrom nine until one.<br />\npass<br />\nby<br />\nwithout<br />\ncounting<br />\nthem.<br />\nTABLE<br />\nD'HOTE<br />\nGovernment<br />\n•<br />\nResearch<br />\nThe Prom issue of the \"Black<br />\nThat<br />\nis<br />\na<br />\nkiss.<br />\nLUNCHEON-60c<br />\nDINNER—s1.00<br />\nThe Johns Hopkins Press has re- and Blue Jay,\" appearing March<br />\nNow since a kiss has been exSUNDAY DINNER—$1.25<br />\ncently taken over the publication of 20th, will be distributed to memplained, it is clear that there are<br />\nbooks issued by the Institute for bers of the fair sex attending the many good reasons<br />\nwhy a girl<br />\nGovernment Research. This will affair.<br />\nshould close her eyes when she is<br />\nThe subscription for the Junior being<br />\ninclude books heretofore published<br />\nkissed. She closes her eyes<br />\nProm is $3.50.<br />\nin<br />\norder<br />\nto forget all except that<br />\nand not out of print, as well as<br />\nAt the Washington Monument<br />\none<br />\nkiss;<br />\nshe closes her eyes to forths-.)se selected for publication from<br />\nPRINCETON PHYSICAL DIthat<br />\nget<br />\ntime is time ; she wants to<br />\nnow on. The Press has also brought<br />\nOscar Thomas Olson, D.D.<br />\nRECTOR WOULD LIMIT<br />\nshut out all material things and<br />\nout two new numbers in the series<br />\nMinister<br />\nATHLETICS<br />\nreally live for a moment if no Ionof Johns Hopkins University StudRadical chances in the contro'<br />\nr ; she wants to dream. for if she<br />\nies in Education, edited by ProfesHopkins Students Are Invited to<br />\nof<br />\nintercollegiate athletics are were to realize that the kiss were<br />\nsor Edward F. Buchner.<br />\nMake This Their Church Home<br />\nThe Institute for • Government suggested by Dr. Joseph E. Ray- really a fact, then she might have<br />\nResearch is an association of citi- croft, director of physical educa- heart failure from sheer happiness:<br />\nThe Sunday afternoon -At Home\"<br />\nzens for co-operating with public tion at Princeton. According to she tries to hide her eyes from het<br />\nin the 'Blue and Grey Room- from<br />\nlover, for she wishes to make him<br />\nofficials in the scientific study of<br />\nfive to seven, followed by the young<br />\nDr. Raycraft, consideration of think<br />\nthat he alone is being granted<br />\npeople's service will appeal to you.<br />\ngovernments.\" - Many very promithis<br />\nproblem<br />\nbrings<br />\nus<br />\nat<br />\nonce<br />\ngreat<br />\nprivilege; in short, and in<br />\nYou are invited.<br />\nnent men are connected with it as<br />\ntrustees. President Goodnow is a into touch with two relatively place of telling the thousand and<br />\nSunday morning worship at 1 1 o'clock—<br />\ntrustee and vice-chairman. Mr. W. new educational problems; the one other reasons that might be adSunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nF. Willoughby, lecturer at this uni- relation of athletics to other vanced, a girl closes her eyes when<br />\nwork<br />\nin<br />\nthe<br />\ninstitution,<br />\nand<br />\nthe<br />\nshe<br />\nis kissed because for one sweet<br />\nversity, is a director.<br />\nALL SEATS FREE<br />\nThe Institute has published a relations among educational in- moment she desires to forget that<br />\nstitutions<br />\nwhose<br />\npoints<br />\nconof<br />\nshe is mortal, desires to live above<br />\nlarge number of books dealing with<br />\nquestions of political science and tact have been greatly increased the clouds for a lifetime in one<br />\npolitical economy. These have been by intercollegiate competition. short span of seconds.<br />\nIn discussing these problems, Does that not explain why a girl<br />\nhandled by D. Appleton &amp; Co., but<br />\nare now all obtainable through the in the Princeton Alumni Weekly, closes her eyes when she is kissed?<br />\nbook stores. The first book of the Dr. Raycroft draws an interest- If, kind reader, you think that it<br />\nTAILORS<br />\nInstitute to be published originally ing comparison between the old does not, then just let me know.<br />\nUniforms and Liveries<br />\nby the Hopkins Press is by Mr. Greek games and our present- From full experience—not being a<br />\nyou know—I will take you by<br />\n128 W. Fayette St., Near Liberty St.<br />\nWilloughby himself, \"The Reor- day era of athletics on a large<br />\nscale.<br />\nhand<br />\nthe<br />\nSeveral<br />\nlead<br />\nand<br />\namong<br />\nyou<br />\nthe<br />\nmodifications of<br />\n7-anization of the Administrative<br />\nBaltimore, Md.<br />\nBranch of the National Govern- our present athletic system are paths that only a favored few are<br />\nment.\" The first part of the book suggested by him, among which allowed to tread.—Clemson Tiger.<br />\ndescribes in great detail the present are the abolition of the training<br />\norganization of the administrative table, which he considers undem- CHRISTIAN SERVICE CLUB<br />\nNOTICE<br />\nin<br />\nthe<br />\ndepartments. The second suggests ocratic; a decrease<br />\nand individuality is offered here at prices that are not<br />\nThe meeting of the Christian<br />\nc:iarrzes—additions and rearrange- amount of money spent on coland<br />\ncannot be underquoted by any house at any time.<br />\nments—among the various depart- teg-e athletics, and the limiting Service Club, which was scheduled<br />\n41<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nments, with a view of making each of an athlete's eligibility from for tonight, has been postponed unis<br />\nback<br />\nof<br />\neach sale with a guarantee.<br />\nmore of a unit, and thus more ef- three years to two or even one. til Thursday, March 15, because of<br />\nExtracts from Dr. Raycroft's the Dramatic Club production. Dr.<br />\nficient.<br />\nCraig Stewart, of Illinois, who has<br />\nThe two new Studies in Educa- article follow :<br />\nFURNI1URE<br />\niDECORATIONS<br />\nDRAPERIES<br />\npreaching at Old St. Paul's<br />\nbeen<br />\ntion are \"The Measurement of \"One of the most serious feaNORTH<br />\n343<br />\nCHARLES<br />\nSTREET<br />\nAchievement in Shorthand,\" by El- tures of intercollegiate competi- Episcopal Church during the Lenmer R. Hoke, professor of Educa- tion is the tendency that crops ten season, will deliver an address.<br />\nBe good and you will be happy<br />\ntion at Lebanon Valley College, and out now and again toward an at\"The Improvement of Speed and titude of distrust and suspicion. —but you may be lonesome.—McAccuracy in Typewriting,\" by Roy This situation could be greatly Gill<br />\nEdward Hoke, professor of Educa- improved by arranging for more<br />\ntion at Birmingham Southern Col- opportunities for athletes and against unauthorized reports.<br />\nlege. The announcement of the lat- athletic authorities to meet sim\"In order to secure the full<br />\nter book states that the author ilar groups from other institu- value of athletic competitions<br />\n\"claims that a marked improve- tions. Sucli meetings would we need to inject in our athletic<br />\nment in speed and accuracy must make it possible for those most affairs more of the spirit, tradiinevitably follow [the adoption of concerned to become acquainted, tions and customs that are in<br />\nhis suggestions]. This Study should would serve as a sort of psycho- harmony with the ethical ideals<br />\nbring about a revolution in the field logical stabilizer, and would be and high purpose of educational<br />\nof typewriting.\"<br />\neffective<br />\nprotection institutions.\"<br />\na most<br /><br />\nThe Medical Standard Book Co.<br /><br />\nCLOTHES<br /><br />\nAthletic-looking<br />\nspring clothes you<br />\nare sure to like<br /><br />\nREADY-FOR-SERVICE<br />\n$30 UPWARD<br /><br />\n211-213 E. BALTIMORE ST.<br /><br />\nCH<br /><br />\nILLY<br /><br />\nRestaurant Francais<br /><br />\nMount Vernon Place Methodist Episcopal Church<br /><br />\nA. JACOBS 8z SONS<br /><br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nCorrect Furnishings for<br />\nthe College Man<br /><br />\nHUTZLER MEM<br /><br />\ne<br /><br />"}], "field_media_file": [{"target_id": 37723, "display": null, "description": null, "target_type": "file", "target_uuid": "b923df25-ab0c-4934-88c7-a2304bdd4013", "url": "http://digital.library.jhu.edu/system/files/2022-03/13052-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13052, "target_type": "node", "target_uuid": "96e9952f-bcd8-4512-ae8c-4929c13a7d36", "url": "/node/13052"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cfdc6f27-1f7a-4d34-b4ba-393a23f06989"}]}