{"mid": [{"value": 35693}], "uuid": [{"value": "dfa3fa4f-5597-416b-894f-c413aebbb355"}], "vid": [{"value": 35693}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12230-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "January 22, 1903<br />\n<br />\nVol. VII, No. 7<br />\n<br />\n,<br />\n<br />\nTHE<br />\n<br />\nxFws rise. I<br />\n<br />\n4<br />\n<br />\nT<br />\n<br />\nR<br />\n<br />\n- 01\"7:151-14 .0.M4<br />\n2<br />\nCar<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\f, se,s-e-ee-eseessreeseesseeeseeeseessee<br />\n<br />\neses-e-sessees.<br />\n<br />\nes,<br />\n<br />\ns<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October I, 1902.<br />\n.M SRN • /bun el Ow Medical Faculty:<br />\nPreside : 1 It A HI,<br />\nWILLIAM H. HOW KI.L. Ikon of the 0,11,ye Faculty:<br />\nEowAsus Ii. (.1111FFIN.<br />\n<br />\nInstruction.<br />\nFoil GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. 11.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of II. A.<br />\n01) As special students.<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nIra Hemmen. _<br />\nJoseph S. Ames.<br />\nWitilani B. Clark.<br />\nWilliam K. Brooks.<br />\nFrank!in P. Mall.<br />\nWilliam H. Howell.<br />\n1,Villiarn H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics..<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nl'aul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\n.1. If. Hollander.<br />\nFrank Morley.<br />\nJoseph 5. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Blological<br />\n•(leading ue to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nA merican Journal of Mathe mat ics(vol X X V).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXI II).<br />\nStudies in Historical arid Political Science (vol. XX I).<br />\nModern Language Notes (vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol<br />\nUniversity Circulars (vol. X X I<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\n.79<br />\n,<br />\n9!..,<br />\n\" .71,<br />\n1:•,..-.<br />\n<br />\nItmcrican 3ourna( of Mathematics.<br />\nF. m1)111,141 Y, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br />\n<br />\n1.<br />\n<br />\nVolume<br />\n<br />\nBincrican ehenitcal lournal.<br />\nI. RENSEN, Editor Monthly, svo. Volume<br />\nxxrx in progress. $5 per volume.<br />\n111. limerican 3ournall of 'Philology.<br />\nH. I,. GILDERSLEEVE, Editor. Quarterly. svo.<br />\nVolume XXIil in progress s:i per volume.<br />\n11.<br />\n<br />\n8vo.<br />\n%Miles from the Eioloaicall 'Laboratory.<br />\n.<br />\nVolume V complete. $5 per volume.:<br />\n%Mies in thistorical sub !Political Science.<br />\nW.<br />\nMonthly. svo. Series X X I in progre.s. $:;<br />\n%.olum(1.<br />\nDl.3obtts lhophins 'Wilmette eirculare.<br />\nContaining reports of scientific and literary work<br />\nIn progress In Baltimore. 4to. Vol. XXI 1 in<br />\nprogrese. $1 per year.<br />\n<br />\n11P.<br />\n<br />\n11111. Johns lbopkins tospital ulLctIn. Monthly. the<br />\nVolume XIV in isrogress<br />\n1101. year.<br />\nPM.lohns 13c:spiting 113ostatal Ileports. Ito. Volume XI<br />\nin progress, $5 per volume.<br />\nIX.<br />\n<br />\nContributions to Esserioloay ane Comparative<br />\nSemitic IPblloiodv,( Hs itesge 'fur ssy rmlogio, etc.)<br />\nVet. I ceminete.<br />\n<br />\nX.<br />\n<br />\nMemoirs from the kiolooteal latloraforr.<br />\nW. K. BROOKS, Editer. Volume I V emu isle to.<br />\n$7.50 per volume.<br />\n<br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\n200,000 volumes.<br />\nPratt Library,<br />\n<br />\n•<br />\n<br />\nThe Jails Hopkins Press.<br />\n<br />\nThe Johns tionkins UniversitU<br />\nBALTIMORE, MARYLAND.<br />\n<br />\n•<br />\n<br />\nMobern language Votes.<br />\nEditor.' Monthly. 4to. Volume<br />\nA. M It<br />\nX VII I in progress. $1 50 per volume<br />\nX11. 3ournai of Experimental fleebicitie.<br />\nW. IL WELCH, Editor Hi-monthly. 8vo.<br />\nV I in progress. $5 per volume.<br />\nXIII. limerican'Journal of Insanity.<br />\nEditor. Quarterly.4to. $5 per<br />\nII EN RI' M. H<br />\nvolume.<br />\nXIV. lfleports of Marylane Seoloaleal Surrey.<br />\nWILLIAM It. t7LARK, Editor.<br />\nD.<br />\n<br />\nterrestrial Magnetism ane litmospheriC Elec.<br />\ntricity. L. A. BA l ER, Editor. Quarterly. 8vo.<br />\nVolume V11 in progress. $2.50 per volume.<br />\nEnnual IftepOrt.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\n<br />\nX1,111.<br />\nGiving the list of officers and students, arid stating<br />\nthe regulations, etc., of the University. Pub.Mated at the close of the arodent le year.<br />\n<br />\nIn addition to the serials s bOVO MOIRA, copies may<br />\nbe obtained of tin' works mentioned below:<br />\nThe Collected Physical Papers of Henry A. !lowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament.. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n.10 plates. $20.00.<br />\nDescription of the Johns Hopkins II Aspital. .1. S. Billing's, Editor. lit) pp. 4to. 511 plates. $7.50 cloth.<br />\nThe Teaching of the A pretties. Cemplete lac-simile edition. Edited be J. bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A utilegomena Epistles. Edited by I. 11. Hall. $3.00.<br />\nBibliographia Hopkinsiensfs. Part T. Philology. Parts<br />\nII-I I 1. Chemistry, Mineralogy and Geology. Parts<br />\nIV- V-VI. Physics,Astronomy and Mathematics.<br />\n8 Vo. :10 cents per part.<br />\nII full list ol publications will be sent on application.<br />\n<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n1<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nJANUARY 22, 1903.<br />\n<br />\nNo 7.<br />\n<br />\nSOME EDUCATIONAL PRINCIPLES UNDERLYI<br />\nNG COLLEGE<br />\nINSTRUCTION<br />\nHAVE been asked to present for our consideration to day<br />\nsome educational principles<br />\nthat bear most directly upon the instruction of college<br />\nclasses. It is a field that has<br />\nnever been seriously entered upon with a scientific spirit<br />\nEducators, and by this<br />\nterm I mean student<br />\ns of education, have not done so, for not only the reason that the proper<br />\neducation of the masses in the common and secondary schools<br />\nhas appealed to them more<br />\nstrongly, but for the further reason that practically from<br />\nthis source alone has come the<br />\ndemand for their services.<br />\nThe college instructor seemingly has felt little need for<br />\nreflection upon questions of<br />\nmethod; in fact, many of them have been afforded much<br />\namusement in the contemplation<br />\nof the serious manner<br />\nin which questions that seemed utter foolishness to them, were considered. A careful and thorough investigation as to the ways<br />\nin which the college students<br />\nShould be dealt with in order to accomplish for them<br />\nthe maximum good has been con<br />\ndemned as useless and inane. The college instructor has<br />\nbeen content with doing as his<br />\nold teachers had done before<br />\nhim, except perhaps where he has been influenced by the university ideals, either because he honestly thinks its mode<br />\nof procedure is the method for the<br />\nlower, as well as for the higher institutions, or that it gives<br />\nhim more time to himself for<br />\nfurther study and research Whether these be the true reasons<br />\n, or whether there be others,<br />\nthe fact still remains that there<br />\nhas never been an attempt of any consequence at a scientific formulation of educational principles for the college.<br />\nIn justice to the college man it must, however, be said, that<br />\nwere all other considera<br />\ntious equal, there is not for him so great a need for an elabora<br />\ntion of educational doctrines,<br />\nfor in the individuals of 18 to 22 individuality<br />\nenters more into the formation of character<br />\nthan does environment. Then, too, definiteness<br />\nof cla4sifleation and generality of laws are!<br />\nnot Possible to nearly so great an extent as with childre<br />\nn, for individuals become through<br />\nhabit more w idely differentiated with each successive year.<br />\nYet this fact does not prove, it<br />\nseems to me, that it is not worth while; that it is not a practical underta<br />\nking. If fewer<br />\ngeneralizations can be formulated, and of these have a greater number of excepti<br />\nons, this<br />\ncondition will not gainsay the existence of certain fundamental laws which<br />\nare far-reaching in their application, and which if recognized, would result in<br />\na higher quality of product in student acquisition and capacity.<br />\nIt will be my endeavor to-day to present some facts that have been establis<br />\nhed by<br />\nscientific method, to draw from them certain general principles; and then to make<br />\nsome<br />\napplication of them to college life as we find it to-day. Let me disclaim at the outset<br />\nany<br />\ninference of personal investigation or of infallibility in these conclusions, or of pretent<br />\niousness in this paper I have simply gathered together facts which seem to<br />\nme to have been<br />\nwell established by others, and have reasoned from these facts to my conclus<br />\nions. The<br />\nonly claim for originality that could be considered is the point<br />\nof view, and it is original<br />\nonly in reference to the subject treated.<br />\nThe science of education has a three fold basis, three auxiliary sciences<br />\n; physiology<br />\nfurnishes it with its laws of physical processes and development; from psychol<br />\nogy it<br />\nsecures its laws of mental action and growth; while the sociological sciences<br />\nprovide its<br />\nideals. The proper adjustment and correlation of the laws from these three<br />\nfields result in<br />\ntrue educational principles. The facts which I am to present to-day,<br />\nhowever, are to be<br />\n•<br />\n<br />\n3<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\ndrawn from psychology alone, and I shall take for granted that the laws of physiology and<br />\nof the sociological sciences are properly observed in those things to which the principles<br />\ndrawn from psychology are applied.<br />\nThe college boy or girl is, in the language of genetic psychology, an adolescent. This<br />\nstage of the development of the individual is marked off at its beginning by the advent of<br />\npuberty and at its close by the full maturity of the reproductive organs. In boys this<br />\ncovers the time front about the fourteenth to the twenty fifth year, and in girls front about<br />\nthe thirteenth to the twenty•second year. The college student is, thus, in the latter part<br />\nof this stage of development. We shall then have to inquire into the characteristics of the<br />\nadolescent in general, and then call especial attention to the manner and extent of the<br />\nmanifestations of those characteristics in the latter part of this stage of development.<br />\nRousseau defines this period as the time when the child is born again, having at birth<br />\nbeen born cc an individual, and itow into the life of the race. There is much truth in this<br />\nstatement, even though we may not wish to follow it out to all its logical consequences.<br />\nThe addition of the sexual functions to his<br />\nThe child is in many respects \"born again.<br />\nbodily organism, wi.h the changes in bodily carriage, facial features, and the increased<br />\ngrowth and strength is sufficient to warrant the use of such language. And, indeed, its<br />\nimportance has, so far as we know, been ever recognized even among uncivilized tribes<br />\nBut front the mental standpoint the change is even more marked. And since it is this<br />\nalone that concerns us today, we may pass on without further comment upon the physical<br />\ndevelopment of this period, and the laws of physical hygiene to be observed during its<br />\ncontinuance.<br />\nAccompanying these physical changes there is a tremendous increase in the store of<br />\nnervous energy, which must have some outlet. He is fully awakened and aroused to<br />\neverything in his environment. Everything takes on a new meaning because he penetrates<br />\ndeeper into the inter relations of things, and for the first time the interpretation of events<br />\nand things given by the adult, begins to dawn in its reality. The change in point of view<br />\nfrom that of the girl to that of the adult takes place rapidly, far more so than most of us<br />\nthink, and in its non.recognition lie many of the errors of parents and teachers to day.<br />\nOne day he is a boy, the next he is a man, is almost literally true. Certainly the time of<br />\ntransition is not many months in length. To be sure, the way has been prepared, and the<br />\nobserver can easily see the bearing of the acts of the pre-adolescent toward this culmination<br />\nperiod, and to the careless observer there seems no distant separation, but I thoroughly<br />\nbelieve that there is a time when the boy or girl conies to a distinct consciousness that now<br />\nI am a man or a woman, whereas, before I was a boy or a girl, and that from that time<br />\nthere is such a new element in his personality, discernable to the keen sympathetic companion, that must be reckoned with in all dealings with him to such an extent as to<br />\nrequire in some respects a radically different attitude toward him.<br />\nIn this great outpouring of nervous energy into new channels, naturally the emotional<br />\nside is most in evidence. The new desires, the new interests which must necessarily result from this great outpouring, cannot help going to great and extreme bounds in their<br />\nmanifestations. Use is made of the intellectual powers already possessed in the new<br />\nfields, but those powers are limited necessarily. Judgment and reason and experience being deficient, what wonder is it that there are such ludicrous hopes, such senseless dreams,<br />\nsuch impossible ambitions as are secretly guiding the acts, and really almost entirely the<br />\nbeing the lives of these young people It is not often that another is allowed, to enter this<br />\nholy of holies; but we can easily conjecture what is therein, and so help take care of the<br />\ntreasure that it may some day yield its full increase in the service of the world. This is<br />\nthe key which unlocks the gate to the avenue of success for all those who are concerned<br />\nwith the development of youth into true vigorous adulthood—the protection of this holy of<br />\nholies, seeing as far as is possible only those things which count for good remain long<br />\ntherein.<br />\nA further analysis of the emotions is necessary. First and most important, and true in<br />\nall the other sides of mental life as well, there is a striking difference in the emotional<br />\n<br />\n•<br />\n<br />\na<br />\nti<br />\n:11<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nlife of different individuals Each case stands alone; no two are seemingly exactly alike.<br />\nThis might be interpreted to mean that there is no generalization possible; but we go on.<br />\nSecond, the emotional life is very intense, there are strong loves, deep hatreds, bitter jealousies, strong rivalries, cordial loyalties, wonderful displays of courage. The individual<br />\ni8 quite apt to be unduly proud or modest. Third, the emotional life is fitful; there are<br />\ntimes of extreme elation and depression. Fourth, it is for the most part altruistic, extreme<br />\ncases of self sacrifice being common. Fifth, they reach out to many sides of the environment, the interests awakened are wide ranged. Sixth. they are directed in upon themyes—introspective. Seventh, at the beginning they are non-intellectualized, that is,<br />\nthey are not under the control of the reason.<br />\nTurning next to the intellectual life of the adolescent, we find these new increased and<br />\ndeeper interests causing more keen perceptions over a wider range of matter. Wider gen eralization, and more definiteness and accuracy in the analysis and synthesis of more<br />\nabundant details are possible. That is, his capacity has grown both extensively and in.<br />\n. He can embrace a wider range, and at the same time keep in hand a more refined elaboration of the facts already known as wholes. It is the age of the reason preeminently, when each for himself establishes the interrelatedness of things in his own life<br />\nand in his environment It differs from the previous age in that in the former he does not<br />\ninquire into the interdependences of phenomena in any more than a superficial way. He<br />\ntakes the explanations offered as sufficient, and is not disposed to go back of them. While<br />\nin this latter period this new energy forces him beyond, and he will not be satisfied until<br />\nhe has exhausted for himself all those resources which he can command or comprehend.<br />\nIn the execution of his thoughts and desires, the adolescent at this period for the first<br />\ntime really enters upon the plane of independent action. He feels the power within him<br />\nto do as he pleases. The influence of parents is apt to diminish, unless he is approached upon<br />\nthis new plane; authority as represented in the school declines as well, if not properly<br />\nadapted. In any case he obeys the tribunal within his own mind; he has become fully<br />\nself-determining. He obeys not from force of compulsion, but of his own inner freedom,<br />\nand he wishes to be held responsible for his acts. His acts of will will now be much<br />\nlonger sustained than formerly; he has greater powers of application with frequent spells<br />\nof inaction and activity, occuring less often with advancing age; he is not so easily turned<br />\naside from the accomplishment of his desires. All in all, it is a time of intense, enthusiastic, indedendent activity.<br />\nMorally, the adolescent is an uncertain quantity, in some cases almost wholly good, in<br />\nothers almost wholly bad, usually an admixture of the two, and his life is the struggle for<br />\nthe mastery by these two forces. Extreme cases of evil in youths, whose acts are usually<br />\nstrictly moral, are not really so abnormal as most people think. On the opposite extreme<br />\nWe meet self infliction of penance in an undue degree for little or imaginary wrongs. It<br />\nis the time when vows and pledges are made, and when the religious life is intelligently<br />\nentered upon. There is in all this a patient persistent seeking for the foundation and true<br />\ninterpretation of things in the moral life, as well as in the strictly intellectual.<br />\nHe becomes more active in his social relations than ever before. The realization that<br />\nhe is but a unit in a great social whole, upon which he is dependent, and from which he<br />\ngains most that he has, and to which he must in turn contribute his share begins to make<br />\nitself felt gradually. The institutions of society take on a new meaning, and he re-adapts<br />\nhimself to them in a new way. He plans as to what place he shall take in the social group,<br />\ninquires into its constitution more closely, find weaknesses or needs and plans reforms.<br />\nMethods whereby his fellows may be united for the accomplishment of some end which<br />\nhe has in view, with himself at the head, are studied and put into practice. The closest<br />\nfriendships of life, and which often last through its course, are at this time formed, as well<br />\nas those loves which later develop into the relations of the marital life.<br />\nHARLAN UPDEGRAFF.<br />\n(To be concluded.)<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n111<br />\n<br />\nM111111111111111111111111111111111111M11111111111111111IN<br />\n<br />\n111111111111111111111111111 ii<br />\n<br />\nI<br />\n<br />\n(11<br />\n<br />\nI III! Jill<br />\n<br />\nR. JACOB H. HOLLANDER delivered an address before the Baltimote<br />\nChapter of the American Institution of Bank Clerks in the rooms of the<br />\nM. & M. Association, on January 15. Dr. Hollander's subject was<br />\n\"Theory and Practice in Finance.\"<br />\nDrs. B. C. Steiner and Wm. H. Welsh were on the committee in charge of<br />\nthe annual meeting and banquet of the Yale Alumni Association, will be held<br />\nat the Carrollton Hotel on January 23.<br />\nMr. Batley Willis, of the U. S. Geological Survey, is delivering a course of<br />\ni‘oks<br />\nlectures in the Geological lecture room on \"Paleoi\\Geography.\" •<br />\n<br />\nS<br />\n<br />\nMr. John Hays Hammond, widely known for his connection with Dr.<br />\nJameson's raid in South Africa, and regarded by many as the leading mining<br />\nengineer in the world, delivered a lecture in McCoy Hall on last Monday evening, on \"King Solomon's Mines, or the Mines of Ophir.\" Mr. Hammond told<br />\nof his discovery, during explorations in Rhodesia, of rich gold deposits which<br />\nshow evidences of having been worked in ancient times, and which from records<br />\nhe has read, and from inscriptions found, be believes to be the ancient mines of<br />\n\"Ophir.\" The lecture, which was largely attended, was one of the most interesting heard in McCoy Hall for some time.<br />\nPresident Alderman, of Tulane University, New Orleans, will deliver the<br />\nprincipal address at the University commemoration exercises, which will be<br />\nheld in McCoy Hall, on February 23. Dr. Alderman, it will be remembered,<br />\nspoke at the Alumni dinner held last February.<br />\nDr. Wm. H. Welch represented the M.aryland State Board of Health at the<br />\nconference of State Health Boards, which met in Washington on last Monday.<br />\nThe annual meeting of the Municipal Art Society was held in McCoy Hall<br />\n0:; the night of January 14, at which Mr F. Hopkinson Smith, artist, author,<br />\nengineer, and lecturer, spoke on \"Venice the Beautiful.\"<br />\nA course of five lectures on subjects connected with educational problems<br />\nis being delivered by Dr. Daniel C. Gilman on successive Tuesday evenings in<br />\nthe Donavan Room. The topics are as follows:<br />\n1. The new movement in the South for promoting education by the cooperation of the Peabody, Slater, Southern Education and General Education<br />\nBoards.<br />\n<br />\n\fTHE NEWS-LETTEk.<br />\n<br />\n5<br />\n<br />\n2. The development of the Carnegie Institution during its first year, 1902.<br />\nThe relations of a liberal education to professional schools, now under<br />\ndiscussion in the Northern universities. Should the college course be curtailed?<br />\n4. The examinations of the United States Civil Service Commission; their<br />\neducational significance.<br />\n5. University sites and university architecture, abroad and at home.<br />\nDr. Gilman's series of lectures on \"University Education,\" delivered a<br />\nyear ago, is still fresh in the minds of all who had the pleasure of attending<br />\nthem, and there is no doubt but that the forthcoming course will be largely<br />\nattended, since they deal with live educational questions, subjects on which<br />\nDr. Gilman is thoroughly grounded.<br />\n3.<br />\n<br />\nUNDERGRADUATES NOTES.<br />\n<br />\nZ<br />\n<br />\nHE Senior banquet will take place January 3oth. The banquet committee<br />\nconsists of the following men : Blanck, chairman ; Stubenrauch and<br />\nStraus.<br />\n<br />\nAt the last Junior class meeting, the following committee of six was appointed by the President to arrange lb! the class banquet : Nutnsen, Dulaney,<br />\nErlanger, Branch, Evans, Opie, chairman. Frank Stollenwerck, Jr., was<br />\nelected toast-master.<br />\nJohn Alan Houghton is back at the University after a severe illness of a<br />\nweek's duration.<br />\nAt a recent class meeting, the Freshmen elected an executive committee<br />\nof seven : Hudgins, Owings, Miller, Stone, Hackett, Eiseman, Boyce, chair man. Also a committee to make arrangements for the Freshman banquet was<br />\nappointed: Dill, Goodenow, Kinane, Boynton<br />\nFrom an artistic point of view the concert given at Homestead M. E.<br />\nChurch, January 13th, was far from satisfactory. The Mandolin and Glee<br />\nClubs were seriously disabled by the absence of their leaders. Banjo solos by<br />\nSmith and Marshall, and selections by a quartette cotnposed of Snowden, Smith,<br />\nNelson and Marshall, saved the clubs from entirely wrecking their reputations.<br />\nThe next concert will be at National Park Seminary on January 24th.<br />\nThe Debating Society which has been in a somnolent condition since last<br />\nSpring, is about to be revived.<br />\nDr Bardeen gave his first lecture on the nervous system before the Senior<br />\nclass on January t6th.<br />\nThere was a young lady named Ghio,<br />\nWho slipped on the ice in Ohio,<br />\nShe stood on her head,<br />\nHer face, it turned red,<br />\nAnd those looking on said, \"Oh—My—Ohl\"—The Bachelor.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nTHE JOHNS<br />\nPublished Fortnightly during the University Year by the Students of<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nJANUARY 22, 1903.<br />\n<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\n<br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\n. GEORGE A. FOSTER, 1904.<br />\nREOINALD S. OPIE, 1904.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nW. S. BIRD, 1903.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BARTJER, 1903.<br />\n.<br />\n. RiuoiN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University,.Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BARMIER,<br />\n.T. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\nIMININI11.1111.<br />\n<br />\nHE second of the open meetings of The Pedagogical Club was attended by<br />\na large number of students, both graduate and undergraduate, last Saturday. It seems evidently fitting that, in an institution in which so large a<br />\npercentage of the students are prepared to teach, subjects similar to that which<br />\nwas treated last Saturday should be discussed. Mr. Updegraff's address on<br />\n\"Some Educational Principles Underlying College Instruction\" was a revelation<br />\nto some of those who are inclined to be skeptical concerning the importance of<br />\nmethod in college teaching. The suggestion that the library of the col'ege<br />\nshould be provided with several copies of the texts used for collateral reading<br />\nappealed very strongly to some ot the undergraduates who were present.<br />\nThe Pedagogical Club is a student organization which, it seems to us,<br />\nshould appeal to all men who expect to teach; and, if the discussions which<br />\ntake place at the regular meetings of the Club are as interesting to the general<br />\nstudent as was last Saturday's address, we believe that any student would<br />\nreceive both profit and pleasure by associating himself with the organization.<br />\n<br />\nt<br />\n<br />\n\fTHA N EWS—LETTR,<br />\nUST at this time, before the actual opening of hostilities, as it were, it will<br />\nnot be altogether inappropriate to take a momentary retrospect of our<br />\npast achievements in the athletic world. Let it be clearly understood,<br />\nhowever, that this mention is made, not out of any spirit of egotism, but merely<br />\nto give Hopkins her just dues—as if we were a disinterested party—by a simple<br />\nstatement of facts that are unfortunately unknown to many of our members.<br />\nPrincipal among these facts, is that all the State Records, with but two exceptions, are held by our men. Every loyal son of Hopkins should feel in this a<br />\npersonal pride, as well as an individual responsibility, in holding these records.<br />\nWe cannot afford to rest content with the laurels won in the past, but must strive<br />\nto emulate and even to surpass the feats of our predecessors. By relaxing our<br />\nefforts, even for a single moment, we may lose a reputation that it has taken<br />\nyears to acquire. As it is not improbable that some of the present records will<br />\nbe broken during the coming season, and as other collegeg and clubs are pro<br />\nducing good men who will push ours to the limit, we should all be possessed<br />\nwith a grim determination to keep these records right \"in the family,\" In<br />\naddition to this list of enviable records, our athletic prowess is further shown in<br />\nthat we have won the Inter Collegiate Championship of Mar)land and the District of Columbia every .year from 1897 to 1901, when the League disbanded,<br />\nexcept in 1899, when we did not compete. Also, in the University of Pennsylvania Relay Races, out of seven annual contests from 1896 to date, we have<br />\nwon four firsts, two seconds, and one third. The banners on the walls of the<br />\nTrophy Room, as well as the cabinet well filled with other trophies, bear witness to our athletic prowess. Each is indicative of a close contest and a hardearned victory. Our past has been an unbroken series of triumphs, may our<br />\nfuture surpass even our former efforts!<br />\n<br />\n3<br />\n<br />\nSUBJECT has been selected for debate, the candidates for the teams are<br />\nhard at work, and it only remaims for the University to give the men<br />\nthe cordial support they deserve in order to turn out a winning team in<br />\nthe inter collegiate contest The inter class debate is important, but, after all,<br />\nit is only a stepping stone to the debate with North Carolina. Any man who<br />\nthinks of a single point bearing on the debate, whether it be pro or con, owes<br />\nit to his Alma Mater to see that his idea bearing upon the debate is brought<br />\nbefore the debating team in proper form<br />\nThree men will be sent to Chapel Hill, N. C„ some time in April. These<br />\nmen go there to represent the University in the inter-collegiate debate. As yet<br />\nnothing has been said about funds, yet it is fair to presume that the student<br />\nbody will volunteer to pay a large part of the expense of the trip. So few calls<br />\nare made upon he students here, in comparison with the demands made at<br />\nother universities, that any call for contributions for this purpose should meet<br />\nwith a generous response on the part of the undergraduates. It is distinctly an<br />\nundergraduate debate, and all the men should assist their team in any and every<br />\nway possible.<br />\n<br />\n4<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nHE present undergraduate can only heave a sigh of regret when in his<br />\nmind's eye he contrasts his condition with the condition of his favored<br />\nyounger brother of the future. Hopkins will be located upon such a commanding site at Homewood that it cannot help but compel the attention and<br />\nadmiration of all beholders To us the idea of a real, real campus, and a stately<br />\ngroup of lmildings, laboratories, libraries, professors' homes, and dormatories;<br />\nto us, we repeat, all this is but an iridescent dream Yet the activity of publicspirited Baltimoreans is making all this a possibility of . the near future. The<br />\nHomestead tract, comprising the University property and Wyman Park, is to<br />\nplay an important part in the scheme of development for beautifying Baltimore<br />\noutlined by the Municipal Art Society. With a boulevard connecting Clifton<br />\nand Druid Hill Parks by way of Wyman Park, the new home of the University<br />\nwill be located upon two of the city's most charming driveways.<br />\nWhen all the plans at present contemplated will have been carried out,<br />\nHopkins will no longer have the rather anomalous distinction of being better<br />\nknown in Europe than in Baltimore.<br />\n<br />\nZ<br />\n<br />\nPLANS OF THE DEBATERS<br />\nOW that tile subject of debate with North Carolina has been selected, the<br />\nmen are getting down to work in earnest. Although no definite dates<br />\nhave been decided upon, it is thought that the inter-class debate will<br />\ntake place the third week in March, and the inter.collegiate debate, at Chapel<br />\nHill, N. C., the second week after Easter. Such arrangement necessarily precludes any hope of a debate with Leland Stanford, Jr.<br />\nThe organization of the Seniors has been effected with Mr. Strayer as<br />\nchairman and Mr. Blum as secretary. It has .been decided that meetings shall<br />\nwith<br />\nbe held every Saturday morning for the purpose of familiarizing each man<br />\nare<br />\nteam<br />\nthe<br />\non<br />\nplaces<br />\nfor<br />\ntrying<br />\nare<br />\nThose<br />\nwho<br />\nthe material for debate.<br />\nIn<br />\nTootle.<br />\nand<br />\nStrayer<br />\nPlaggemeyer,<br />\nCustis,<br />\nGlocker,<br />\nBevan, Blum, Addison,<br />\npreparing<br />\nin<br />\nassist<br />\nto<br />\nvolunteered<br />\naddition to these a number of men have<br />\nmaterial for debate. The men who will assist the candidates for the team are<br />\nLanier, Parsons, Straus, Stubenrauch, Annuen, Adelsdorf and Hendry. By<br />\nand<br />\n' the middle of February the men expect to finish preparing their material,<br />\nto begin the serious work of trial debates.<br />\nThe Junior Class has not been less active. From the number of men who<br />\nare trying for the team, it will be hard work to pick the final three. Hum—<br />\nrichouse, Licking, Emig, Fosi.er, Rosenheim, Stollenwerck, Geiger, Louis,<br />\nWallis, McGlone and Shapiro are the contestants for places on the Junior team.<br />\nFrom the candidates of the two classes will be chosen the two men who<br />\nwill represent us in the debate with North Carolina. Last year a Junior and a<br />\nSenior composed the team; as yet it is too early to attempt to make a forecast<br />\nof the team this years<br />\nThe Freshman Class will be represented on the night of the inter class<br />\ndebate by three men who will contest for the medal offered by Dr. Lee.<br />\n<br />\nal<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nAMONG THE COLLEGES.<br />\nT THE Harvard Law School, there are 627 college graduates, representing<br />\n94 colleges and universities. Harvard has 240 graduates, Yale 24,<br />\nBrown 31, University of California 17, Amherst 12, Princeton 12, and<br />\nWilliams ii.<br />\n<br />\n4<br />\n<br />\nThe trustees of the University of Chicago, by a vote of 13 to 3, have<br />\ndeclared that the segregation of the sexes be brought about in the Freshmen<br />\nand Sophomore classes. This action is practically a blow at co education Some<br />\nof the arguments brought forward against co-education are rather peculiar, as,<br />\nfor example, •‘ Monopolizing of corridors, stairs, and grounds, by girls.\"<br />\nThe University of Michigan makes provision for communicating at least<br />\nonce each year with every living former student whose address is known, and<br />\nevery effort is made to keep a correct and complete list of addresses The work<br />\nis delegated by the Board of Regents to the Alumni Association of the University, which is at present composed of about thirty-five hundred members. Over<br />\n$40,000 has been subscribed to the permanent endowment fund of the Association.<br />\nOne thousand two hundred and forty-six volumes were added to the library<br />\nof the University of Columbia in the one month of October.<br />\nAt present, basket ball seems to arouse most interest in athletic circles at<br />\nLehigh.<br />\nThe question for the Pennsylvania and Cornell Debate, which took place in<br />\nDecember, was: \"Resolved, \"That the present tariff on the raw materials and<br />\nrough products of iron and steel, such as bar iron, pig iron, rails, steel ingots,<br />\netc., is justified on the ground of the protection of American industry against<br />\nforeign competition \"<br />\nA rule has been recently passed by the Board of Trustees of Cornell that<br />\nprofessors shall be retired at the age of seventy, with a salary of $1,500 a year.<br />\nThe ground has been broken up for an entirely new group of buildings of<br />\nthe College of the City of New York.<br />\nThe Harvard Camera Club has recently sent a challenge to Yale, Prince<br />\nton, University of Pennsylvania, and Columbia, for a photographic contest, to<br />\ntake place in February or March. Each of the four Universities will submit<br />\nfifty pictures, to be judged by a competent committee.<br />\nA very interesting collection is that which has recently come to light of<br />\nDean Currier of the College of Liberal Arts at the State University of Iowa.<br />\nThis collection is composed of all the student publications which have appeared<br />\nsince the opening of the University—the college papers, the year books, the<br />\nclass invitations, etc. The first paper was published in 1868.<br />\nCornell has decided to erect six new buildings, for which sixteen acres of<br />\nground have been purchased.<br />\nResolved, \"That hazing of the Freshman is a beneficial part of their college<br />\ntraining,\" was debated before the Philomathian Society at the University of<br />\nPennsylvania.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER<br />\nVISIT OF MR. JAYS.<br />\n<br />\nHE recent visit of Mr. Tom. Jays to the colleges of Baltimore has been<br />\naccompanied with considerable interest to a good many men.<br />\nMr. Jays arrived in town Thursday afternoon, January 8th, and was<br />\nput up at the Hopkins Club. That e-ening he met the leaders of the medical<br />\nand dental school associations at a supper at the Central Y. M. C. A. Friday<br />\nand Saturday were spent visiting these colleges, where he was given the time<br />\nof some lecture and spoke to between moo and 1200 men.<br />\nOn Saturday afternoon, in Levering Hall, he met twenty of the student<br />\nvolunteers of the city and encouraged and inspired them by his intense earnestness and power.<br />\nFollowing this, at 6.30 twenty.eight men from Hopkins and a few other<br />\ncolleges sat down to an informal supper in the reading room of Levering Hall.<br />\nAfter the supper Dr. Wilson introduced Mr. Jays, and he gave us a short talk<br />\non the call to Christian men to devote their lives to the christianizing and<br />\ncivilizing the people of foreign lands. When he sat down the men began to<br />\nask questions. In this way were brought out, in a very informal, pleasant way,<br />\nmany interesting and instructive points about such work.<br />\nOur arrangements for Sunday were interfered with by the very bad weather,<br />\nbut about forty men gathered in Levering Hall in the afternoon when Mr. Jays<br />\nagain made a strong appeal and told some interesting experiences. The men<br />\nwere so extremely interested that the talk seemed too short. As a result of<br />\nthese two meetings quite a number of Hopkins men arranged for personal inter_<br />\nviews on Tuesday. In this way the day was well filled until five o'clock, when<br />\nhe again spoke to about twenty men, presenting the personal Christ to them<br />\nvery forcibly.<br />\nMonday was spent chiefly at the Medical School where he attended some<br />\nof the clinics. Mr. Jays says Hopkins is considered in England as a \"mecca\"<br />\nfor medical men. In the evening he spoke to an interested group of students<br />\nand faculty members in the Association Reading Room at the hospital.<br />\nIt will be a difficult matter to estimate the results of this visit. It will take<br />\ntime to tell what they will be. Many men realize more than ever before in their<br />\nlives that the whole world is open to them to choose a place to invest their<br />\nlife, that Jesus Christ has a claim on their lives for best investment, and they<br />\ncan never again be excused for not thinking about it. It means men interested<br />\nin the cause of foreign missions whether they go or stay at home. And by<br />\nGod's blessing it means some men give their lives very definitely for this form<br />\nof service. It is not a far-off question. It is, which of us shall it be?<br />\nM. B. GRAFF'.<br />\n<br />\nC<br />\n<br />\nShe meditated with growing anger. Suddenly she grasped a bottle of<br />\nHairine, and hurling it across the room, shrieked: \"Ha, the dye is cast!\"—<br />\nPrinceton Yiger.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nTHE TRACK AND FIELD TEAM.<br />\nGAMES SCHEDULED TO DATE.<br />\nJanuary 29th—Inter-Class Scratch Games.<br />\nFebruary 14th—Baltimore Athletic Club, Fifth Regiment Armory.<br />\nFebruary 21st or 28th—Johns Hopkins University, Open Handicap Games.<br />\nMarch 7th—Georgetown University, Washington, D. C.<br />\nApril 25th—University of Pennsylvania, Relay Races.<br />\n<br />\nFTER a period of restless inactivity, the Track and Field Team has again<br />\nsettled down to hard, sytematic work, so that from now on we must be<br />\nprepared for all kinds of new and startling developments in this line.<br />\nEvery afternoon an apparently endless string of men extending nearly the<br />\nentire length of the track, may be seen in the Cage, first walking, then running,<br />\nand finally going through certain nameless, indescribable, unintelligle movements and motions, which mean so much to the unitiated, but are hopeless .<br />\nbeyond the conception of other poor mortals. Each candidate is being gradually<br />\nbrought to his best form in order that Hopkins may make a most creditable<br />\nshowing during the coming season. The present outlook is unusually encour—<br />\naging, for, although the ranks have been somewhat depleted by the loss of one<br />\nor two old men, yet most of the old \"stand-bys\" are back \"doing business at<br />\nthe old stand,\" and among the freshmen are several likely chaps who give<br />\npromise of being able to uphold their end of the work.<br />\nThat the management has gotten busy may be seen by the above schedule<br />\nof games. Due preparation will be made in time for each of these events, but<br />\nat present all interest is centered in the Inter Class Games to be he'd in the<br />\nCage next Thursday evening. At this time no official list of entries can be<br />\ngiven, as the Class Representatives are to select the participants from their<br />\nrespective classes, and to submit them to the tender care of Father Bill, who<br />\nwill not announce them till shortly before the events. However, every man<br />\nwho has been out, will undoubted be urged to enter every event for which he<br />\nseems to have ability. The events, as arranged, will consist of 35 yard and<br />\n440 yard dashes, half mile and one mile runs, standing broad and running high<br />\njumps, putting of the L2 lb. shot, and a Class Relay Race Aside from stirring<br />\nup enthusiasm and giving confidence to the new men, these games will afford a<br />\nmore definite means of classifying them, so that each one may, with singleness<br />\nof purpose, devote himself exclusively to that kind of work for which he seems<br />\nto be best fitted, While it is of course impossible for all of us to engage actively<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n12<br />\n<br />\nin the games, yet every one can and should be on hand to contribute his share<br />\nof vigor and enthusiasm.<br />\nAt the regular monthly meeting of the Athletic Board, on January t 6th,<br />\nsituat;on of the past season was discussed, and after careful confootball<br />\nthe<br />\nsideration it was decided not to award the official \"H\" to members of the team.<br />\nThe ground for this action was that, as the \"H\" is a reward of personal ability<br />\nand not of faithfulness and perseverence—which would embrace half the members of the University—they could not feel justified, under the existing circumstances, in awarding them.<br />\nCaptain Blanck in his report highly commended the faithful work of the<br />\nmen. Manager Matthai was unable to make a full report, but stated that the<br />\nseason was a success financially and that there was a comfortable balance on<br />\nhand.<br />\nThe question of the Annual Athletic \"Feed\" was laid on the table.<br />\nIn a circular just issued, a strong appeal is made to all men of any ability<br />\nwhatever to come out and have that ability developed. The medical men<br />\nespecially are urged to do their share towards making this season's work successful; for, although it is well known that some of the best men on the foot<br />\nball, base ball and lacrosse teams have been recruited from the Medical School,<br />\nyet in track work the candidates from that source are painfully scarce. The<br />\nmanagement of the Track and Field Team should have the hearty co-operation<br />\nand support of the Medical School in its praiseworthy efforts to turn out a win_<br />\nning team for Hopkins.<br />\n<br />\nLT<br />\n<br />\nLACROSSE DOINGS.<br />\n<br />\nHOUGH there is no great amount of real lacrosse news since our last<br />\nissue, still it is a pleasure to note that everything is progressing in a<br />\nhighly satisfactory manner. The practice last Saturday, which is<br />\nalways the most important of the week, must have been especially encouraging<br />\nto Captain Strauss. Not only were every one of the old men—Putts, B. Bernheim, Bird, Tough, Blanck, R. Schmeisser and H. Strauss—out in the cage<br />\nready kr work, but 20 scrubs, several of whom are very promising, helped to<br />\nfrom an unusually large squad for this time ot the year. Besides these, Coach<br />\nR T Abercrombie and ex-Captain William Schmeisser were on hand to give<br />\nable assistance in the fine points of the game. On the whole, the passing was<br />\nclean and the attack made several pretty goals on fast team work, despite the<br />\nfact that the defense covered up well. In one or two instances the men seemed<br />\nto be in too big a hurry, and a number of passes were made by the attack before<br />\nthe defense man had been drawn out far enough. To this mistake were due<br />\nnumerous intercepted passes. The very same thing happens at the beginning<br />\nof every season, however, and in a few weeks it may reasonably be expected to<br />\nsee these defects disappear.<br />\nIt is somewhat early to make predictions regarding vacancies on the team<br />\nand those who may fill them. However, a few remarks regarding the most<br />\npromising men may not be out of order.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nShould Putts at in home, B. Bernheim at out-home, and Bird at second<br />\nattack keep the same places this season, the attack positions open to new men<br />\nwill be first attack, second attack, and centre. Judging from last Saturday's<br />\npractice, there are a number of scrubs who will fill these positions with credit.<br />\nAmong them is Taylor, one of those flying Quakers from Swarthmure, whose<br />\nlegs seem to run straight up to their collar buttons. In appearance he resem_<br />\nbles Harris of last year's team, about whom some one said \"No use trying to<br />\ncatch him; somebody head him off!\" Taylor is said to be exceptionally fast<br />\nand able with his body. A little more speed and dexterity with his stick and<br />\nhe will make a valuable attack man. At centre, Matthai is playing a very<br />\nclean game. He generally manages to get the ball on the face-off and uses both<br />\nhis head and stick in an encouraging manner. Strobliar is another scrub whose<br />\nwork is placing him among those attack aspirants who have a chance for the<br />\n'Varsity. He is very fast and his stick work shows steady improvement. If<br />\nPearre continues to improve, he will make another man whom the 'Varsity<br />\nmay be able to use to advantage. Rosenheim also shows promise, and Hazleburst, Erlanger and Dill are doing well.<br />\nAt goal, Phil Straus displays a keen eye and a clear head. Should Briscoe<br />\nfail to return to the Medical School, Straus will stand a very good chance for<br />\nthe position.<br />\nThe defense does not offer half so many opportunities to the scrubs as the<br />\nattack, there being but one vacancy in the line For this place several men<br />\nare working hard, notably Gregg Custis, who played in the first 'Varsity game<br />\nlast season against the University of Pennsylvania at Philadelphia. Aside<br />\nfrom his ability, the continued hard, conscientious work which Custis has done,<br />\nshould entitle him to unusual consideration as a defense candidate. Riley and<br />\nWinternitz may likewise be numbered among the faithful. \"Bill\" Hoffman is<br />\nout with the squad this year, and when his head and arms are able to equal his<br />\nlegs in merit, he will be of no little use to tf,e 'Varsity. Outside of the foregoing and the old men, Captain Straus has a trump card up his sleeve which<br />\ncannot be played at this stage of the game It has been played with great<br />\neffect in other decks, and, it is to be hoped, may be placed in the shuffle again<br />\nthis season.<br />\nAs regards the schedule, we are still dealing in glittering generalities. The<br />\nSwarthmore, Stevens, Lehigh and Crescent gatnes are arranged, but the Cornell,<br />\nand Cambridge-Oxford contests are uncertain. The recent predictions in THE<br />\nNEWS LKTTlilt to the effect that Cornell is not over anxious to tackle Hopkins,<br />\nat Ithaca, have been confirmed by one or two communications, recently received<br />\nby Manager J. A. Addison. On account of the ridiculously small guarantee<br />\noffered by Cornell, most of the Hopkins players agreed to chip in several dollars<br />\neach for the sake of the trip and for the sake of putting at rest all doubts regarding the relative strength of the two teams which usually win the champion<br />\nships of the inter collegiate and of the inter university leagues. Evidently such<br />\na display of determination on the part of Hopkins to bring about a contest must<br />\nhave jarred Cornell considerably, for they replied promptly, stating that they<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nreally did not see how, owing to financial embarrassment, a game could be<br />\narranged. Oh, dear! Fudge! Fury! Looks suspicious! \"So say we all of us!\"<br />\nWith the Englishmen, our chances are better. Manager Addison has<br />\nreceived word from the Oxford-Cambridge management, saying that Harvard<br />\nwill arrange all the exhibition games which the Englishmen are to play in the<br />\nUnited States. The visitors evidently intend to engage in a series of contests,<br />\nand there is no reason why Hopkins should not have a shot at the goose.<br />\nEverything points to a truly great lacrosse season. Get to work, scrubs,<br />\nand win your spurs! The game is well worth the candle!<br />\nThe candidates were glad to see a large number of students watching the<br />\npractice from the gallery last Saturday afternoon. Such interest is very<br />\nencouraging.<br />\nTRACK TEAM STATISTICS.<br />\n<br />\nAll Track Men.<br />\nR C. Hoffman, '03, (Capt.)<br />\nH. K. Tootle, '03,<br />\n'03,<br />\nWilliams,<br />\n'03,<br />\nPassagno,<br />\n'03,<br />\nBlanck,<br />\n'03,<br />\nNelson,<br />\n'03,<br />\nSmith,<br />\n'03,<br />\nTough,<br />\n,03,<br />\nYearley,<br />\n'03,<br />\nBird,<br />\n'03,<br />\nSchmeisser,<br />\nPorter,<br />\n'04,<br />\nBranham,<br />\n'04,<br />\nEmig,<br />\n'04,<br />\nKohn,<br />\n'04,<br />\n'05,<br />\nChism,<br />\n'05,<br />\nStone,<br />\n'05,<br />\nSuper,<br />\n'05,<br />\nGoodenow,<br />\n'05,<br />\nJackson,<br />\n'05,<br />\nWroth,<br />\n'05,<br />\nMorse,<br />\nW. E. Hoffman, Jr., Graduate,<br />\nic<br />\nEngland,<br />\n<br />\nAge.<br />\n21<br />\n<br />\nWeight (stripped)<br />\n<br />\nIleig-ht.<br />\n6o<br />\n<br />\n20<br />\n<br />\n5.8<br />\n<br />\n1 48<br />\n1231%<br />\n<br />\n21<br />\n<br />\n5.10<br />\n<br />\n133<br />\n<br />\n22<br />\n<br />\n5-7 Y3<br />\n<br />\n127<br />\n<br />\n21<br />\n<br />\n5.11<br />\n<br />\n1 75<br />\n<br />\n19<br />\n<br />\n132<br />\n<br />\n21<br />\n<br />\n5. 10,<br />\n6.2<br />\n<br />\n21<br />\n<br />\n5 10<br />\n<br />\n152<br />\n<br />\n185<br />\n<br />\n1.48<br />\n<br />\n19<br />\n<br />\n6.1%<br />\n<br />\n22<br />\n<br />\n5.10<br />\n<br />\n1.48<br />\n<br />\n21<br />\n<br />\n5.11<br />\n<br />\n157<br />\n<br />\n[9<br />\n18<br />\n<br />\n115<br />\n<br />\n18<br />\n<br />\n5•5<br />\n5.8<br />\n5.9%<br />\n5.5<br />\n<br />\n21<br />\n<br />\n5.8<br />\n<br />\n1 42<br />\n<br />\n17<br />\n[8<br />\n[7<br />\n[9<br />\n19<br />\n19<br />\n<br />\n5.9<br />\n5.8<br />\n5.9<br />\n5.8<br />\n5.8J4<br />\n5.11<br />\n<br />\n1 48<br />\n<br />\n20<br />\n<br />\n21<br />\n<br />\n5.10<br />\n<br />\n19<br />\n<br />\n6<br />\n<br />\n125<br />\n132<br />\n130<br />\n<br />\n4<br />\n<br />\n125<br />\n130<br />\n122<br />\n130<br />\n132<br />\n1 40<br />\n1 45<br />\n<br />\n\"Foiled again!\" hissed the sweet chocolate, as they wrapped it in silvery<br />\npaper.—Cornell Widow.<br />\nHIS COUSIN: So you are a Junior this year. And next year what will<br />\nyou be, a Senior?<br />\nOh, that depends on conditions.—Cornell Widow.<br />\n<br />\n\fTIM NEWS-LEVrEit,<br />\n<br />\n15<br />\n<br />\nA DESSERTATION ON SONNETS.<br />\nHE Angry Mob was sitting quietly in the barber shop when the Poet<br />\nstarted the discussion. \"I see,\" he remarked casually, \"that the season<br />\nof the year is approaching when it behooves the Junior Class to hand in<br />\nsome sonnets to keep Dr. Greene from reading Anglo-Saxon to them.\"<br />\n\"I tried to write a sonnet once,\" confessed the Fusser, \"but there were too<br />\nfew words to rhyme with love and with sorrow; love, dove, glove, above, borrow, sorrow, tomorrow, that about exhausts the supply.\"<br />\n\"Was it an Italian Sonnet ?\" queried the Italian, whom the Bugologist<br />\naddresses as Mr. Dinklebender.<br />\n\"It was not, it was better,\" said the Fusser, \"it was a sonnet I originated.\" At this moment the Cdief Supe broke in.<br />\n\"Malatesta! Say nothing against the Italian.\" The Captain of the Supes<br />\nsquelched the Chief Supe with one lightning glance. The Poet brought them<br />\nback to the matter in hand<br />\n\"I am preparing some sonnets,\" he ventured timidly, \"which might be of<br />\nuse to the members of the Junior Class—at the usual market rates. There is<br />\nnothing hard about a sonnet.\"<br />\nThe Fusser sighed, the Bugologist looked incredulous, and Walter absentmindedly lathered the hair of the Chief Supe.<br />\n\"All that is necessary is to understand the words which you want to use,<br />\nand then put them together. I have taken the following rhymes, after the<br />\nusual a, b, b, a, manner, and fitted them together in the most approved<br />\npoetic fashion: steal, heart, apart, unseal, feel, start, chart, reveal. That shall<br />\nbe my octave; now for the sestet, learn, past, guide, return, cast, purified.<br />\nGood. Now, gentlemen, what shall it be first?\"<br />\nThe Objector, skilled in opposition in the senate, thought to stump the<br />\npoet; \"Give us,\" he cried, \"something in contemplation's deepest mood.\"<br />\nThe poet turned as pale as the Chief Supe's hair. Pulling himself together,<br />\nhowever, he produced the following:<br />\n<br />\nZ<br />\n<br />\nSOLITUDB.<br />\n<br />\nThere is a balm in silence which doth steal<br />\nWith soothing power into the weary heart,<br />\nWhat joy we find it is to dwell apart<br />\nIn realms of silence where we can unseal<br />\nThe inmost chambers of the heart, and feel<br />\nNo searching eye is here to make us start<br />\nWith dread surprise by gazing on the chart<br />\nOf our life's deeds which doth the past reveal.<br />\nSo in the sacred silence do we learn<br />\nTo live aright by thinking on the past;<br />\nAnd by the past our future steps to guide.<br />\nWhen once again we to the world return,—<br />\nThat busy mart, wherein our lives are cast,—<br />\nBy silence have our hearts been purified.<br />\n<br />\n.41<br />\n<br />\n\f16<br />\n<br />\n'i'ii i<br />\n<br />\nNEWS—LETTER.<br />\n<br />\nIt was too erudite for the audience. The Bugologist whispered to the Objector that it would be `foine und doisy' if an explanatory chart was annexed.<br />\nThe Captain of the Supes remarked that anyone would have to be pretty foolish<br />\nto write a thing like that, The Chief Supe then said, \"Let us see if you cannot do better in lighter vein. Use the same rhymes for a sonnet which would<br />\nsuit the men who frequent the back room of the Hullabaloo Club.\"<br />\nThe Poet was shocked<br />\nAfter much persuasion he evolved the following<br />\nsonnet, much to the delight of the stein-men—including the Fusser, who loved<br />\na stein almost as much as he did a pretty face.<br />\nTOMMY'S RESTFUL RETREAT FOR HOPELESS HOPKINSON1ANS.<br />\n<br />\nBetween the hours of twelve and one I steal<br />\nTo a resort, built after my own heart,<br />\nWhere liquids, oysters, crackers, form a part<br />\nOf the long bill of fare. I can unseal<br />\nMy heart the better o'er a stein, and feel<br />\nMost eloquent when once I get a start.<br />\nWhen I've had maybe five, I draw a chart<br />\nOf all my debts and see what they reveal.<br />\nAt ten I feel there's nothing I can learn,<br />\nMy debts are things of the long distant past.<br />\nMy steps unsteadily I try to guide<br />\nWhen to the Hopkins I would make return.<br />\nAnd when in Walter's chair my frame I've cast<br />\nBy a shampoo my head is purified.<br />\n<br />\n\"That is better,\" said the Chief Supe, \"but anyone of us could do as<br />\nwell.\"<br />\n\"With the same rhymes?' said the poet triumphantly.<br />\n\"With the same rhymes,\" said the Angry Mob in unison, \"we'll show you<br />\nat the next meeting.\"<br />\nThe mob retired, leaving the poet the possessor of the barber shop, but<br />\nhe telt that at the next meeting they would show him a few things he did not<br />\nknow.<br />\n(To be concluded.)<br />\n<br />\nGYMNASIUM PROPRIETOR : We always have a competent \"Force\" of<br />\ninstructors.<br />\n<br />\nINSPECTING FEMALE: And such a nice \"Sunny Jim.\"—Lampoon.<br />\nALPHONSE : Has he got a good room?<br />\nGASTON : Peach! He's got a policeman's helmet, three \"Subway to Park<br />\nSt.\" signs, and a life-size portrait of Anna Held.—Lamfioon.<br />\n<br />\nQUERY:<br />\n<br />\nDo sleigh belles attend snow balls?—Lamftoon.<br />\n<br />\nMOTHER: Johnny, I am ashamed of you ! What did you mean by laughing and giggling at your dear uncle's funeral?<br />\nJOHNNY : Gee! I was so glad it wasn't my own.—Princelon Tiger.<br />\n<br />\n\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAMISON 0 WATTS,<br />\nw-,3Drug $'torcsAl.<br />\nHocward and Franklin Streets.<br />\n1Druget Vino? Goo. Iperttuncir,<br />\n<br />\nTHE CHEAPEST PLACE<br />\n<br />\nBaltimore and Eutaw Streets.<br />\notLtBrtiCICS, Cigare, $00a ttaatcr.<br />\n<br />\n&<br />\n<br />\n\"Phone xvio- V.A-6<br />\n<br />\nHENRY N. ORUNS,<br />\n<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nSt udents' Sundries.<br />\n<br />\nH. S. WRIGHT 8G CO •<br />\n704 MADISON AVE.<br />\n<br />\nN. W. Corner<br />\nLexinoton ,uid Liberty Sts.<br />\nAgent<br />\n<br />\nt•—••• I<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nM. MEADE, OF<br />\n<br />\nLONDON,<br />\n<br />\nEXPERT CLEANER AND DYER.<br />\n1213 N. LlITAW ST. (2nd and 3rd floorS).<br />\n<br />\nThe most complete and modern department for<br />\ndyeing and altering Gents' and Ladies,<br />\ngarments.<br />\nIt's time your Winter Clothing was nut in order.<br />\nDoes it need to he eleftned, dyed, altered or repaired? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to<br />\nlook like new, and yon won't have to pay very much<br />\neither. The Price List speaks for itself.<br />\n•<br />\n<br />\nM. BERNSTEIN & CO.<br />\n1.0N noN A ni it icA N<br />\n_TAILORS<br />\n<br />\n.`1i0lienntlicul ;Anti Surve.ylnu<br />\niiil Ilnolneers' Supplies<br />\n<br />\nAND<br />\n<br />\nIMPORTERS_<br />\n<br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that lit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can fl nd nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that Is less<br />\nParticular, It's our way.<br />\nWe are prepared to show you a large line of ,imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NORTH it ITAW :••;1121]11T.<br />\n(Second door above Joel Gutman & Co.)<br />\n<br />\ncull,. I<br />\n<br />\nHenderson's<br />\n<br />\nL'sscr C'o<br />\n<br />\nliAL1'IMQ121],.;'11).<br />\n<br />\n0,1\" Vitr York.<br />\n<br />\n,<br />\n,• a4<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText, Books, Nitto Books,<br />\nMadison<br />\nstudents' Supplies.<br />\n<br />\n& Hocrvard Sts.<br />\n<br />\nGENTLEMEN'S<br />\n<br />\nPRESSED<br />\n<br />\nCLOTHING<br />\n<br />\nBY<br />\n<br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRicEs ll'Olt DRY CLEANING. AND DYEING.<br />\nGentlemen's Suits cleaned and pressed<br />\n•<br />\n$1.00<br />\n_<br />\n.•.<br />\n._<br />\nTrousers,<br />\n..-do<br />\nCoats,<br />\nVests,<br />\n•..<br />\n_<br />\n_<br />\n_<br />\nI ivercoats,<br />\n1.00<br />\nBoys' Suits, according to size, .50..75 mid 1.(Xt<br />\nVelvet collars in overcoats,<br />\n.75<br />\nRELINING. -A new lining will often make a garment which you have discarded good for another<br />\nSeason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\n111Y El NIL<br />\nGentlemen's Suits dyed tutu l pressed,<br />\nV.00<br />\n_<br />\nI iveireonts,<br />\n1.50<br />\nBoys' Suits, according to size<br />\nWI, 1.25 and 1.50<br />\n<br />\nCLOTHES MADE TO ORDER.<br />\nTho illustrations show how the clotIWR we make fit<br />\nand look--the wear you'll learn about. later.<br />\nThe Bah, overemit is 1111 eSpeeially RIM ppy garment<br />\nThe Stiek Suit is Olt titter the very newest. too tterri.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nIntl II could wish.<br />\nWe make all other proper styles, ot course; dreas,<br />\ncutaway, double-breasted, four-1.1mm) sack and<br />\nNorfolk snits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low—we rover learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWESIT PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nwill be the best you ever Saw.<br />\nfect fit.<br />\nYour money back If you are dissatisfied.<br />\n126 N. I Mt.iiW St.<br />\n/%1. BERNSTEIN & CO.<br />\ns.EI OUR PRICE LIST FOR CLEANIN, DYFINC; AND ACTFRINO.<br />\n<br />\n\fCapilal $300,000. Surplus alla Uflwiei1 Pf011.8 $400 000<br />\n<br />\nSTIEFF PIANOS<br />\nMATEFCIAll.t.1 MONEY<br />\n<br />\nMADE 010<br />\n<br />\nEXPE121114.;NCE CA N<br />\n<br />\nNV Alt IfIlt11(imi...<br />\n<br />\nDrovers & Mechanics Nat'l Bank,<br />\nOr<br />\n<br />\nIII TI.<br />\n<br />\n9 N. IA<br />\n<br />\nNT V<br />\n<br />\nsT.<br />\n<br />\nrs and<br />\nGUSHING ScGOMPANY'Botaotkisent',<br />\noners.<br />\n<br />\nBALTIMORE.<br />\n<br />\nJas. Clark, Prest<br />\nChas. S. M Wen, Cashier.<br />\n<br />\nL. Strouse,<br />\nEdw. I'. Hayden. ;Isn't Cashier.<br />\n<br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for. Rent<br />\nfrom 1 p r year arid upward.<br />\n<br />\nIAGGOIfiltS<br />\n<br />\n34 W. BUTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\n;n Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\nSIR TIONBRY—For School, Pamil, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Neck\"' wear,Underwear<br />\nHosiery, etc.<br />\nMMINNI<br />\nMONIIIII<br />\nNIIMMINI<br />\nIIINNIUM<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale Tho .1. II. U. Pennants, ii!A all 011141 College<br />\n<br />\nTHOS.BLAKE CO<br />\nPennants.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFH MAN & SON,<br />\nFOR<br />\n<br />\nJORDAN STABLER GO.<br />\n<br />\nAVE.<br />\nM<br />\nSamples submitted of<br />\nReads as follows:<br />\nadulterants, no coloring, tine quality.<br />\nFrench liritudy<br />\nOporto Port absolutely pure, oi superior quality.<br />\nSherry—no coloring or 11OUlt crams. absolutely pure wine.<br />\nRye Whimkey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar- -natural cider vinegar, strictly pule and<br />\nstrong.<br />\nSix Ground Spieem—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUFACTURER<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\n(Steck letter ffraternitv jewelrp,<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\n.<br />\nPlc ai,c. Call ant; Examiac our %Lac Vet ore 1Purchasina<br />\n<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. o's V. telephone 445-v.<br />\n<br />\n1 KM 1 IA<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. Ar<br />\n<br />\n.Sc 1 I()RS DN.<br />\n<br />\nJENNIN(<br />\n<br />\nRUZICKA<br />\n<br />\nN'y<br />\n<br />\n. l•'<br />\n<br />\nSTIR Kan%<br />\n<br />\nBOOKS<br />\nND!!<br />\nSECOND=HA<br />\nMiscellaneous,<br />\nSchool, Medical and<br />\nBought, Sold and<br />\n<br />\nExchanged.<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 N. ELIT/VW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old 'Book Store.<br />\n<br />\n6<br />\n<br />\nBookbinder,<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609<br />\n<br />\nN. Eutaw St.<br />\nJAMES R. PAINE•<br />\n<br />\nTHEO. WARNER-<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\nBALTIMORE STREET.<br />\nWEST<br />\n34<br />\nManufacturers of<br />\n•<br />\n71 S<br />\nilop<br />\nSilk and CaSsimore lists. tAC<br />\n<br />\nCaps<br />\n<br />\nki<br />\n<br />\n-<br />\n<br />\nMORTfl GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE fa LOW RATES.<br />\n<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBIALTIMORE TO BREMEN DIREGT.<br />\n<br />\nSGAUMAGHLR Sc GO., General<br />\n<br />\nor particulars apply to<br />\n<br />\nISAAC H. DIXON. PRr.4,4.<br />\nJAS. R. RICHARDS,<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\nBaltimore, Md.<br />\n<br />\nRunts.<br />\n<br />\nVICE-PREST,<br />\n<br />\nTHE AS.<br />\n<br />\nSmith, Dixon Co.<br />\n<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard Si.,<br />\n<br />\nME 51 L,<br />\n<br />\n29 -<br />\n<br />\n31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "January 22, 1903<br /><br />\nVol. VII, No. 7<br /><br />\n,<br /><br />\nTHE<br /><br />\nxFws rise. I<br /><br />\n4<br /><br />\nT<br /><br />\nR<br /><br />\n- 01\"7:151-14 .0.M4<br />\n2<br />\nCar<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\n, se,s-e-ee-eseessreeseesseeeseeeseessee<br /><br />\neses-e-sessees.<br /><br />\nes,<br /><br />\ns<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October I, 1902.<br />\n.M SRN • /bun el Ow Medical Faculty:<br />\nPreside : 1 It A HI,<br />\nWILLIAM H. HOW KI.L. Ikon of the 0,11,ye Faculty:<br />\nEowAsus Ii. (.1111FFIN.<br /><br />\nInstruction.<br />\nFoil GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. 11.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of II. A.<br />\n01) As special students.<br /><br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nIra Hemmen. _<br />\nJoseph S. Ames.<br />\nWitilani B. Clark.<br />\nWilliam K. Brooks.<br />\nFrank!in P. Mall.<br />\nWilliam H. Howell.<br />\n1,Villiarn H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics..<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nl'aul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\n.1. If. Hollander.<br />\nFrank Morley.<br />\nJoseph 5. Ames.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Blological<br />\n•(leading ue to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nA merican Journal of Mathe mat ics(vol X X V).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXI II).<br />\nStudies in Historical arid Political Science (vol. XX I).<br />\nModern Language Notes (vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol<br />\nUniversity Circulars (vol. X X I<br />\nProgrammes of the courses offered to graduate students in Philosophy and the A rts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\n.79<br />\n,<br />\n9!..,<br />\n\" .71,<br />\n1:•,..-.<br /><br />\nItmcrican 3ourna( of Mathematics.<br />\nF. m1)111,141 Y, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br /><br />\n1.<br /><br />\nVolume<br /><br />\nBincrican ehenitcal lournal.<br />\nI. RENSEN, Editor Monthly, svo. Volume<br />\nxxrx in progress. $5 per volume.<br />\n111. limerican 3ournall of 'Philology.<br />\nH. I,. GILDERSLEEVE, Editor. Quarterly. svo.<br />\nVolume XXIil in progress s:i per volume.<br />\n11.<br /><br />\n8vo.<br />\n%Miles from the Eioloaicall 'Laboratory.<br />\n.<br />\nVolume V complete. $5 per volume.:<br />\n%Mies in thistorical sub !Political Science.<br />\nW.<br />\nMonthly. svo. Series X X I in progre.s. $:;<br />\n%.olum(1.<br />\nDl.3obtts lhophins 'Wilmette eirculare.<br />\nContaining reports of scientific and literary work<br />\nIn progress In Baltimore. 4to. Vol. XXI 1 in<br />\nprogrese. $1 per year.<br /><br />\n11P.<br /><br />\n11111. Johns lbopkins tospital ulLctIn. Monthly. the<br />\nVolume XIV in isrogress<br />\n1101. year.<br />\nPM.lohns 13c:spiting 113ostatal Ileports. Ito. Volume XI<br />\nin progress, $5 per volume.<br />\nIX.<br /><br />\nContributions to Esserioloay ane Comparative<br />\nSemitic IPblloiodv,( Hs itesge 'fur ssy rmlogio, etc.)<br />\nVet. I ceminete.<br /><br />\nX.<br /><br />\nMemoirs from the kiolooteal latloraforr.<br />\nW. K. BROOKS, Editer. Volume I V emu isle to.<br />\n$7.50 per volume.<br /><br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\n200,000 volumes.<br />\nPratt Library,<br /><br />\n•<br /><br />\nThe Jails Hopkins Press.<br /><br />\nThe Johns tionkins UniversitU<br />\nBALTIMORE, MARYLAND.<br /><br />\n•<br /><br />\nMobern language Votes.<br />\nEditor.' Monthly. 4to. Volume<br />\nA. M It<br />\nX VII I in progress. $1 50 per volume<br />\nX11. 3ournai of Experimental fleebicitie.<br />\nW. IL WELCH, Editor Hi-monthly. 8vo.<br />\nV I in progress. $5 per volume.<br />\nXIII. limerican'Journal of Insanity.<br />\nEditor. Quarterly.4to. $5 per<br />\nII EN RI' M. H<br />\nvolume.<br />\nXIV. lfleports of Marylane Seoloaleal Surrey.<br />\nWILLIAM It. t7LARK, Editor.<br />\nD.<br /><br />\nterrestrial Magnetism ane litmospheriC Elec.<br />\ntricity. L. A. BA l ER, Editor. Quarterly. 8vo.<br />\nVolume V11 in progress. $2.50 per volume.<br />\nEnnual IftepOrt.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br /><br />\nX1,111.<br />\nGiving the list of officers and students, arid stating<br />\nthe regulations, etc., of the University. Pub.Mated at the close of the arodent le year.<br /><br />\nIn addition to the serials s bOVO MOIRA, copies may<br />\nbe obtained of tin' works mentioned below:<br />\nThe Collected Physical Papers of Henry A. !lowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament.. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n.10 plates. $20.00.<br />\nDescription of the Johns Hopkins II Aspital. .1. S. Billing's, Editor. lit) pp. 4to. 511 plates. $7.50 cloth.<br />\nThe Teaching of the A pretties. Cemplete lac-simile edition. Edited be J. bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A utilegomena Epistles. Edited by I. 11. Hall. $3.00.<br />\nBibliographia Hopkinsiensfs. Part T. Philology. Parts<br />\nII-I I 1. Chemistry, Mineralogy and Geology. Parts<br />\nIV- V-VI. Physics,Astronomy and Mathematics.<br />\n8 Vo. :10 cents per part.<br />\nII full list ol publications will be sent on application.<br /><br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\n1<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nJANUARY 22, 1903.<br /><br />\nNo 7.<br /><br />\nSOME EDUCATIONAL PRINCIPLES UNDERLYI<br />\nNG COLLEGE<br />\nINSTRUCTION<br />\nHAVE been asked to present for our consideration to day<br />\nsome educational principles<br />\nthat bear most directly upon the instruction of college<br />\nclasses. It is a field that has<br />\nnever been seriously entered upon with a scientific spirit<br />\nEducators, and by this<br />\nterm I mean student<br />\ns of education, have not done so, for not only the reason that the proper<br />\neducation of the masses in the common and secondary schools<br />\nhas appealed to them more<br />\nstrongly, but for the further reason that practically from<br />\nthis source alone has come the<br />\ndemand for their services.<br />\nThe college instructor seemingly has felt little need for<br />\nreflection upon questions of<br />\nmethod; in fact, many of them have been afforded much<br />\namusement in the contemplation<br />\nof the serious manner<br />\nin which questions that seemed utter foolishness to them, were considered. A careful and thorough investigation as to the ways<br />\nin which the college students<br />\nShould be dealt with in order to accomplish for them<br />\nthe maximum good has been con<br />\ndemned as useless and inane. The college instructor has<br />\nbeen content with doing as his<br />\nold teachers had done before<br />\nhim, except perhaps where he has been influenced by the university ideals, either because he honestly thinks its mode<br />\nof procedure is the method for the<br />\nlower, as well as for the higher institutions, or that it gives<br />\nhim more time to himself for<br />\nfurther study and research Whether these be the true reasons<br />\n, or whether there be others,<br />\nthe fact still remains that there<br />\nhas never been an attempt of any consequence at a scientific formulation of educational principles for the college.<br />\nIn justice to the college man it must, however, be said, that<br />\nwere all other considera<br />\ntious equal, there is not for him so great a need for an elabora<br />\ntion of educational doctrines,<br />\nfor in the individuals of 18 to 22 individuality<br />\nenters more into the formation of character<br />\nthan does environment. Then, too, definiteness<br />\nof cla4sifleation and generality of laws are!<br />\nnot Possible to nearly so great an extent as with childre<br />\nn, for individuals become through<br />\nhabit more w idely differentiated with each successive year.<br />\nYet this fact does not prove, it<br />\nseems to me, that it is not worth while; that it is not a practical underta<br />\nking. If fewer<br />\ngeneralizations can be formulated, and of these have a greater number of excepti<br />\nons, this<br />\ncondition will not gainsay the existence of certain fundamental laws which<br />\nare far-reaching in their application, and which if recognized, would result in<br />\na higher quality of product in student acquisition and capacity.<br />\nIt will be my endeavor to-day to present some facts that have been establis<br />\nhed by<br />\nscientific method, to draw from them certain general principles; and then to make<br />\nsome<br />\napplication of them to college life as we find it to-day. Let me disclaim at the outset<br />\nany<br />\ninference of personal investigation or of infallibility in these conclusions, or of pretent<br />\niousness in this paper I have simply gathered together facts which seem to<br />\nme to have been<br />\nwell established by others, and have reasoned from these facts to my conclus<br />\nions. The<br />\nonly claim for originality that could be considered is the point<br />\nof view, and it is original<br />\nonly in reference to the subject treated.<br />\nThe science of education has a three fold basis, three auxiliary sciences<br />\n; physiology<br />\nfurnishes it with its laws of physical processes and development; from psychol<br />\nogy it<br />\nsecures its laws of mental action and growth; while the sociological sciences<br />\nprovide its<br />\nideals. The proper adjustment and correlation of the laws from these three<br />\nfields result in<br />\ntrue educational principles. The facts which I am to present to-day,<br />\nhowever, are to be<br />\n•<br /><br />\n3<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\ndrawn from psychology alone, and I shall take for granted that the laws of physiology and<br />\nof the sociological sciences are properly observed in those things to which the principles<br />\ndrawn from psychology are applied.<br />\nThe college boy or girl is, in the language of genetic psychology, an adolescent. This<br />\nstage of the development of the individual is marked off at its beginning by the advent of<br />\npuberty and at its close by the full maturity of the reproductive organs. In boys this<br />\ncovers the time front about the fourteenth to the twenty fifth year, and in girls front about<br />\nthe thirteenth to the twenty•second year. The college student is, thus, in the latter part<br />\nof this stage of development. We shall then have to inquire into the characteristics of the<br />\nadolescent in general, and then call especial attention to the manner and extent of the<br />\nmanifestations of those characteristics in the latter part of this stage of development.<br />\nRousseau defines this period as the time when the child is born again, having at birth<br />\nbeen born cc an individual, and itow into the life of the race. There is much truth in this<br />\nstatement, even though we may not wish to follow it out to all its logical consequences.<br />\nThe addition of the sexual functions to his<br />\nThe child is in many respects \"born again.<br />\nbodily organism, wi.h the changes in bodily carriage, facial features, and the increased<br />\ngrowth and strength is sufficient to warrant the use of such language. And, indeed, its<br />\nimportance has, so far as we know, been ever recognized even among uncivilized tribes<br />\nBut front the mental standpoint the change is even more marked. And since it is this<br />\nalone that concerns us today, we may pass on without further comment upon the physical<br />\ndevelopment of this period, and the laws of physical hygiene to be observed during its<br />\ncontinuance.<br />\nAccompanying these physical changes there is a tremendous increase in the store of<br />\nnervous energy, which must have some outlet. He is fully awakened and aroused to<br />\neverything in his environment. Everything takes on a new meaning because he penetrates<br />\ndeeper into the inter relations of things, and for the first time the interpretation of events<br />\nand things given by the adult, begins to dawn in its reality. The change in point of view<br />\nfrom that of the girl to that of the adult takes place rapidly, far more so than most of us<br />\nthink, and in its non.recognition lie many of the errors of parents and teachers to day.<br />\nOne day he is a boy, the next he is a man, is almost literally true. Certainly the time of<br />\ntransition is not many months in length. To be sure, the way has been prepared, and the<br />\nobserver can easily see the bearing of the acts of the pre-adolescent toward this culmination<br />\nperiod, and to the careless observer there seems no distant separation, but I thoroughly<br />\nbelieve that there is a time when the boy or girl conies to a distinct consciousness that now<br />\nI am a man or a woman, whereas, before I was a boy or a girl, and that from that time<br />\nthere is such a new element in his personality, discernable to the keen sympathetic companion, that must be reckoned with in all dealings with him to such an extent as to<br />\nrequire in some respects a radically different attitude toward him.<br />\nIn this great outpouring of nervous energy into new channels, naturally the emotional<br />\nside is most in evidence. The new desires, the new interests which must necessarily result from this great outpouring, cannot help going to great and extreme bounds in their<br />\nmanifestations. Use is made of the intellectual powers already possessed in the new<br />\nfields, but those powers are limited necessarily. Judgment and reason and experience being deficient, what wonder is it that there are such ludicrous hopes, such senseless dreams,<br />\nsuch impossible ambitions as are secretly guiding the acts, and really almost entirely the<br />\nbeing the lives of these young people It is not often that another is allowed, to enter this<br />\nholy of holies; but we can easily conjecture what is therein, and so help take care of the<br />\ntreasure that it may some day yield its full increase in the service of the world. This is<br />\nthe key which unlocks the gate to the avenue of success for all those who are concerned<br />\nwith the development of youth into true vigorous adulthood—the protection of this holy of<br />\nholies, seeing as far as is possible only those things which count for good remain long<br />\ntherein.<br />\nA further analysis of the emotions is necessary. First and most important, and true in<br />\nall the other sides of mental life as well, there is a striking difference in the emotional<br /><br />\n•<br /><br />\na<br />\nti<br />\n:11<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nlife of different individuals Each case stands alone; no two are seemingly exactly alike.<br />\nThis might be interpreted to mean that there is no generalization possible; but we go on.<br />\nSecond, the emotional life is very intense, there are strong loves, deep hatreds, bitter jealousies, strong rivalries, cordial loyalties, wonderful displays of courage. The individual<br />\ni8 quite apt to be unduly proud or modest. Third, the emotional life is fitful; there are<br />\ntimes of extreme elation and depression. Fourth, it is for the most part altruistic, extreme<br />\ncases of self sacrifice being common. Fifth, they reach out to many sides of the environment, the interests awakened are wide ranged. Sixth. they are directed in upon themyes—introspective. Seventh, at the beginning they are non-intellectualized, that is,<br />\nthey are not under the control of the reason.<br />\nTurning next to the intellectual life of the adolescent, we find these new increased and<br />\ndeeper interests causing more keen perceptions over a wider range of matter. Wider gen eralization, and more definiteness and accuracy in the analysis and synthesis of more<br />\nabundant details are possible. That is, his capacity has grown both extensively and in.<br />\n. He can embrace a wider range, and at the same time keep in hand a more refined elaboration of the facts already known as wholes. It is the age of the reason preeminently, when each for himself establishes the interrelatedness of things in his own life<br />\nand in his environment It differs from the previous age in that in the former he does not<br />\ninquire into the interdependences of phenomena in any more than a superficial way. He<br />\ntakes the explanations offered as sufficient, and is not disposed to go back of them. While<br />\nin this latter period this new energy forces him beyond, and he will not be satisfied until<br />\nhe has exhausted for himself all those resources which he can command or comprehend.<br />\nIn the execution of his thoughts and desires, the adolescent at this period for the first<br />\ntime really enters upon the plane of independent action. He feels the power within him<br />\nto do as he pleases. The influence of parents is apt to diminish, unless he is approached upon<br />\nthis new plane; authority as represented in the school declines as well, if not properly<br />\nadapted. In any case he obeys the tribunal within his own mind; he has become fully<br />\nself-determining. He obeys not from force of compulsion, but of his own inner freedom,<br />\nand he wishes to be held responsible for his acts. His acts of will will now be much<br />\nlonger sustained than formerly; he has greater powers of application with frequent spells<br />\nof inaction and activity, occuring less often with advancing age; he is not so easily turned<br />\naside from the accomplishment of his desires. All in all, it is a time of intense, enthusiastic, indedendent activity.<br />\nMorally, the adolescent is an uncertain quantity, in some cases almost wholly good, in<br />\nothers almost wholly bad, usually an admixture of the two, and his life is the struggle for<br />\nthe mastery by these two forces. Extreme cases of evil in youths, whose acts are usually<br />\nstrictly moral, are not really so abnormal as most people think. On the opposite extreme<br />\nWe meet self infliction of penance in an undue degree for little or imaginary wrongs. It<br />\nis the time when vows and pledges are made, and when the religious life is intelligently<br />\nentered upon. There is in all this a patient persistent seeking for the foundation and true<br />\ninterpretation of things in the moral life, as well as in the strictly intellectual.<br />\nHe becomes more active in his social relations than ever before. The realization that<br />\nhe is but a unit in a great social whole, upon which he is dependent, and from which he<br />\ngains most that he has, and to which he must in turn contribute his share begins to make<br />\nitself felt gradually. The institutions of society take on a new meaning, and he re-adapts<br />\nhimself to them in a new way. He plans as to what place he shall take in the social group,<br />\ninquires into its constitution more closely, find weaknesses or needs and plans reforms.<br />\nMethods whereby his fellows may be united for the accomplishment of some end which<br />\nhe has in view, with himself at the head, are studied and put into practice. The closest<br />\nfriendships of life, and which often last through its course, are at this time formed, as well<br />\nas those loves which later develop into the relations of the marital life.<br />\nHARLAN UPDEGRAFF.<br />\n(To be concluded.)<br /><br />\nTHE NEWS—LETTER.<br /><br />\n111<br /><br />\nM111111111111111111111111111111111111M11111111111111111IN<br /><br />\n111111111111111111111111111 ii<br /><br />\nI<br /><br />\n(11<br /><br />\nI III! Jill<br /><br />\nR. JACOB H. HOLLANDER delivered an address before the Baltimote<br />\nChapter of the American Institution of Bank Clerks in the rooms of the<br />\nM. &amp; M. Association, on January 15. Dr. Hollander's subject was<br />\n\"Theory and Practice in Finance.\"<br />\nDrs. B. C. Steiner and Wm. H. Welsh were on the committee in charge of<br />\nthe annual meeting and banquet of the Yale Alumni Association, will be held<br />\nat the Carrollton Hotel on January 23.<br />\nMr. Batley Willis, of the U. S. Geological Survey, is delivering a course of<br />\ni‘oks<br />\nlectures in the Geological lecture room on \"Paleoi\\Geography.\" •<br /><br />\nS<br /><br />\nMr. John Hays Hammond, widely known for his connection with Dr.<br />\nJameson's raid in South Africa, and regarded by many as the leading mining<br />\nengineer in the world, delivered a lecture in McCoy Hall on last Monday evening, on \"King Solomon's Mines, or the Mines of Ophir.\" Mr. Hammond told<br />\nof his discovery, during explorations in Rhodesia, of rich gold deposits which<br />\nshow evidences of having been worked in ancient times, and which from records<br />\nhe has read, and from inscriptions found, be believes to be the ancient mines of<br />\n\"Ophir.\" The lecture, which was largely attended, was one of the most interesting heard in McCoy Hall for some time.<br />\nPresident Alderman, of Tulane University, New Orleans, will deliver the<br />\nprincipal address at the University commemoration exercises, which will be<br />\nheld in McCoy Hall, on February 23. Dr. Alderman, it will be remembered,<br />\nspoke at the Alumni dinner held last February.<br />\nDr. Wm. H. Welch represented the M.aryland State Board of Health at the<br />\nconference of State Health Boards, which met in Washington on last Monday.<br />\nThe annual meeting of the Municipal Art Society was held in McCoy Hall<br />\n0:; the night of January 14, at which Mr F. Hopkinson Smith, artist, author,<br />\nengineer, and lecturer, spoke on \"Venice the Beautiful.\"<br />\nA course of five lectures on subjects connected with educational problems<br />\nis being delivered by Dr. Daniel C. Gilman on successive Tuesday evenings in<br />\nthe Donavan Room. The topics are as follows:<br />\n1. The new movement in the South for promoting education by the cooperation of the Peabody, Slater, Southern Education and General Education<br />\nBoards.<br /><br />\nTHE NEWS-LETTEk.<br /><br />\n5<br /><br />\n2. The development of the Carnegie Institution during its first year, 1902.<br />\nThe relations of a liberal education to professional schools, now under<br />\ndiscussion in the Northern universities. Should the college course be curtailed?<br />\n4. The examinations of the United States Civil Service Commission; their<br />\neducational significance.<br />\n5. University sites and university architecture, abroad and at home.<br />\nDr. Gilman's series of lectures on \"University Education,\" delivered a<br />\nyear ago, is still fresh in the minds of all who had the pleasure of attending<br />\nthem, and there is no doubt but that the forthcoming course will be largely<br />\nattended, since they deal with live educational questions, subjects on which<br />\nDr. Gilman is thoroughly grounded.<br />\n3.<br /><br />\nUNDERGRADUATES NOTES.<br /><br />\nZ<br /><br />\nHE Senior banquet will take place January 3oth. The banquet committee<br />\nconsists of the following men : Blanck, chairman ; Stubenrauch and<br />\nStraus.<br /><br />\nAt the last Junior class meeting, the following committee of six was appointed by the President to arrange lb! the class banquet : Nutnsen, Dulaney,<br />\nErlanger, Branch, Evans, Opie, chairman. Frank Stollenwerck, Jr., was<br />\nelected toast-master.<br />\nJohn Alan Houghton is back at the University after a severe illness of a<br />\nweek's duration.<br />\nAt a recent class meeting, the Freshmen elected an executive committee<br />\nof seven : Hudgins, Owings, Miller, Stone, Hackett, Eiseman, Boyce, chair man. Also a committee to make arrangements for the Freshman banquet was<br />\nappointed: Dill, Goodenow, Kinane, Boynton<br />\nFrom an artistic point of view the concert given at Homestead M. E.<br />\nChurch, January 13th, was far from satisfactory. The Mandolin and Glee<br />\nClubs were seriously disabled by the absence of their leaders. Banjo solos by<br />\nSmith and Marshall, and selections by a quartette cotnposed of Snowden, Smith,<br />\nNelson and Marshall, saved the clubs from entirely wrecking their reputations.<br />\nThe next concert will be at National Park Seminary on January 24th.<br />\nThe Debating Society which has been in a somnolent condition since last<br />\nSpring, is about to be revived.<br />\nDr Bardeen gave his first lecture on the nervous system before the Senior<br />\nclass on January t6th.<br />\nThere was a young lady named Ghio,<br />\nWho slipped on the ice in Ohio,<br />\nShe stood on her head,<br />\nHer face, it turned red,<br />\nAnd those looking on said, \"Oh—My—Ohl\"—The Bachelor.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nTHE JOHNS<br />\nPublished Fortnightly during the University Year by the Students of<br />\nHOPKINS UNIVERSITY.<br /><br />\nJANUARY 22, 1903.<br /><br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br /><br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\n. GEORGE A. FOSTER, 1904.<br />\nREOINALD S. OPIE, 1904.<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nW. S. BIRD, 1903.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BARTJER, 1903.<br />\n.<br />\n. RiuoiN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University,.Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BARMIER,<br />\n.T. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\nIMININI11.1111.<br /><br />\nHE second of the open meetings of The Pedagogical Club was attended by<br />\na large number of students, both graduate and undergraduate, last Saturday. It seems evidently fitting that, in an institution in which so large a<br />\npercentage of the students are prepared to teach, subjects similar to that which<br />\nwas treated last Saturday should be discussed. Mr. Updegraff's address on<br />\n\"Some Educational Principles Underlying College Instruction\" was a revelation<br />\nto some of those who are inclined to be skeptical concerning the importance of<br />\nmethod in college teaching. The suggestion that the library of the col'ege<br />\nshould be provided with several copies of the texts used for collateral reading<br />\nappealed very strongly to some ot the undergraduates who were present.<br />\nThe Pedagogical Club is a student organization which, it seems to us,<br />\nshould appeal to all men who expect to teach; and, if the discussions which<br />\ntake place at the regular meetings of the Club are as interesting to the general<br />\nstudent as was last Saturday's address, we believe that any student would<br />\nreceive both profit and pleasure by associating himself with the organization.<br /><br />\nt<br /><br />\nTHA N EWS—LETTR,<br />\nUST at this time, before the actual opening of hostilities, as it were, it will<br />\nnot be altogether inappropriate to take a momentary retrospect of our<br />\npast achievements in the athletic world. Let it be clearly understood,<br />\nhowever, that this mention is made, not out of any spirit of egotism, but merely<br />\nto give Hopkins her just dues—as if we were a disinterested party—by a simple<br />\nstatement of facts that are unfortunately unknown to many of our members.<br />\nPrincipal among these facts, is that all the State Records, with but two exceptions, are held by our men. Every loyal son of Hopkins should feel in this a<br />\npersonal pride, as well as an individual responsibility, in holding these records.<br />\nWe cannot afford to rest content with the laurels won in the past, but must strive<br />\nto emulate and even to surpass the feats of our predecessors. By relaxing our<br />\nefforts, even for a single moment, we may lose a reputation that it has taken<br />\nyears to acquire. As it is not improbable that some of the present records will<br />\nbe broken during the coming season, and as other collegeg and clubs are pro<br />\nducing good men who will push ours to the limit, we should all be possessed<br />\nwith a grim determination to keep these records right \"in the family,\" In<br />\naddition to this list of enviable records, our athletic prowess is further shown in<br />\nthat we have won the Inter Collegiate Championship of Mar)land and the District of Columbia every .year from 1897 to 1901, when the League disbanded,<br />\nexcept in 1899, when we did not compete. Also, in the University of Pennsylvania Relay Races, out of seven annual contests from 1896 to date, we have<br />\nwon four firsts, two seconds, and one third. The banners on the walls of the<br />\nTrophy Room, as well as the cabinet well filled with other trophies, bear witness to our athletic prowess. Each is indicative of a close contest and a hardearned victory. Our past has been an unbroken series of triumphs, may our<br />\nfuture surpass even our former efforts!<br /><br />\n3<br /><br />\nSUBJECT has been selected for debate, the candidates for the teams are<br />\nhard at work, and it only remaims for the University to give the men<br />\nthe cordial support they deserve in order to turn out a winning team in<br />\nthe inter collegiate contest The inter class debate is important, but, after all,<br />\nit is only a stepping stone to the debate with North Carolina. Any man who<br />\nthinks of a single point bearing on the debate, whether it be pro or con, owes<br />\nit to his Alma Mater to see that his idea bearing upon the debate is brought<br />\nbefore the debating team in proper form<br />\nThree men will be sent to Chapel Hill, N. C„ some time in April. These<br />\nmen go there to represent the University in the inter-collegiate debate. As yet<br />\nnothing has been said about funds, yet it is fair to presume that the student<br />\nbody will volunteer to pay a large part of the expense of the trip. So few calls<br />\nare made upon he students here, in comparison with the demands made at<br />\nother universities, that any call for contributions for this purpose should meet<br />\nwith a generous response on the part of the undergraduates. It is distinctly an<br />\nundergraduate debate, and all the men should assist their team in any and every<br />\nway possible.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br />\nHE present undergraduate can only heave a sigh of regret when in his<br />\nmind's eye he contrasts his condition with the condition of his favored<br />\nyounger brother of the future. Hopkins will be located upon such a commanding site at Homewood that it cannot help but compel the attention and<br />\nadmiration of all beholders To us the idea of a real, real campus, and a stately<br />\ngroup of lmildings, laboratories, libraries, professors' homes, and dormatories;<br />\nto us, we repeat, all this is but an iridescent dream Yet the activity of publicspirited Baltimoreans is making all this a possibility of . the near future. The<br />\nHomestead tract, comprising the University property and Wyman Park, is to<br />\nplay an important part in the scheme of development for beautifying Baltimore<br />\noutlined by the Municipal Art Society. With a boulevard connecting Clifton<br />\nand Druid Hill Parks by way of Wyman Park, the new home of the University<br />\nwill be located upon two of the city's most charming driveways.<br />\nWhen all the plans at present contemplated will have been carried out,<br />\nHopkins will no longer have the rather anomalous distinction of being better<br />\nknown in Europe than in Baltimore.<br /><br />\nZ<br /><br />\nPLANS OF THE DEBATERS<br />\nOW that tile subject of debate with North Carolina has been selected, the<br />\nmen are getting down to work in earnest. Although no definite dates<br />\nhave been decided upon, it is thought that the inter-class debate will<br />\ntake place the third week in March, and the inter.collegiate debate, at Chapel<br />\nHill, N. C., the second week after Easter. Such arrangement necessarily precludes any hope of a debate with Leland Stanford, Jr.<br />\nThe organization of the Seniors has been effected with Mr. Strayer as<br />\nchairman and Mr. Blum as secretary. It has .been decided that meetings shall<br />\nwith<br />\nbe held every Saturday morning for the purpose of familiarizing each man<br />\nare<br />\nteam<br />\nthe<br />\non<br />\nplaces<br />\nfor<br />\ntrying<br />\nare<br />\nThose<br />\nwho<br />\nthe material for debate.<br />\nIn<br />\nTootle.<br />\nand<br />\nStrayer<br />\nPlaggemeyer,<br />\nCustis,<br />\nGlocker,<br />\nBevan, Blum, Addison,<br />\npreparing<br />\nin<br />\nassist<br />\nto<br />\nvolunteered<br />\naddition to these a number of men have<br />\nmaterial for debate. The men who will assist the candidates for the team are<br />\nLanier, Parsons, Straus, Stubenrauch, Annuen, Adelsdorf and Hendry. By<br />\nand<br />\n' the middle of February the men expect to finish preparing their material,<br />\nto begin the serious work of trial debates.<br />\nThe Junior Class has not been less active. From the number of men who<br />\nare trying for the team, it will be hard work to pick the final three. Hum—<br />\nrichouse, Licking, Emig, Fosi.er, Rosenheim, Stollenwerck, Geiger, Louis,<br />\nWallis, McGlone and Shapiro are the contestants for places on the Junior team.<br />\nFrom the candidates of the two classes will be chosen the two men who<br />\nwill represent us in the debate with North Carolina. Last year a Junior and a<br />\nSenior composed the team; as yet it is too early to attempt to make a forecast<br />\nof the team this years<br />\nThe Freshman Class will be represented on the night of the inter class<br />\ndebate by three men who will contest for the medal offered by Dr. Lee.<br /><br />\nal<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nAMONG THE COLLEGES.<br />\nT THE Harvard Law School, there are 627 college graduates, representing<br />\n94 colleges and universities. Harvard has 240 graduates, Yale 24,<br />\nBrown 31, University of California 17, Amherst 12, Princeton 12, and<br />\nWilliams ii.<br /><br />\n4<br /><br />\nThe trustees of the University of Chicago, by a vote of 13 to 3, have<br />\ndeclared that the segregation of the sexes be brought about in the Freshmen<br />\nand Sophomore classes. This action is practically a blow at co education Some<br />\nof the arguments brought forward against co-education are rather peculiar, as,<br />\nfor example, •‘ Monopolizing of corridors, stairs, and grounds, by girls.\"<br />\nThe University of Michigan makes provision for communicating at least<br />\nonce each year with every living former student whose address is known, and<br />\nevery effort is made to keep a correct and complete list of addresses The work<br />\nis delegated by the Board of Regents to the Alumni Association of the University, which is at present composed of about thirty-five hundred members. Over<br />\n$40,000 has been subscribed to the permanent endowment fund of the Association.<br />\nOne thousand two hundred and forty-six volumes were added to the library<br />\nof the University of Columbia in the one month of October.<br />\nAt present, basket ball seems to arouse most interest in athletic circles at<br />\nLehigh.<br />\nThe question for the Pennsylvania and Cornell Debate, which took place in<br />\nDecember, was: \"Resolved, \"That the present tariff on the raw materials and<br />\nrough products of iron and steel, such as bar iron, pig iron, rails, steel ingots,<br />\netc., is justified on the ground of the protection of American industry against<br />\nforeign competition \"<br />\nA rule has been recently passed by the Board of Trustees of Cornell that<br />\nprofessors shall be retired at the age of seventy, with a salary of $1,500 a year.<br />\nThe ground has been broken up for an entirely new group of buildings of<br />\nthe College of the City of New York.<br />\nThe Harvard Camera Club has recently sent a challenge to Yale, Prince<br />\nton, University of Pennsylvania, and Columbia, for a photographic contest, to<br />\ntake place in February or March. Each of the four Universities will submit<br />\nfifty pictures, to be judged by a competent committee.<br />\nA very interesting collection is that which has recently come to light of<br />\nDean Currier of the College of Liberal Arts at the State University of Iowa.<br />\nThis collection is composed of all the student publications which have appeared<br />\nsince the opening of the University—the college papers, the year books, the<br />\nclass invitations, etc. The first paper was published in 1868.<br />\nCornell has decided to erect six new buildings, for which sixteen acres of<br />\nground have been purchased.<br />\nResolved, \"That hazing of the Freshman is a beneficial part of their college<br />\ntraining,\" was debated before the Philomathian Society at the University of<br />\nPennsylvania.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER<br />\nVISIT OF MR. JAYS.<br /><br />\nHE recent visit of Mr. Tom. Jays to the colleges of Baltimore has been<br />\naccompanied with considerable interest to a good many men.<br />\nMr. Jays arrived in town Thursday afternoon, January 8th, and was<br />\nput up at the Hopkins Club. That e-ening he met the leaders of the medical<br />\nand dental school associations at a supper at the Central Y. M. C. A. Friday<br />\nand Saturday were spent visiting these colleges, where he was given the time<br />\nof some lecture and spoke to between moo and 1200 men.<br />\nOn Saturday afternoon, in Levering Hall, he met twenty of the student<br />\nvolunteers of the city and encouraged and inspired them by his intense earnestness and power.<br />\nFollowing this, at 6.30 twenty.eight men from Hopkins and a few other<br />\ncolleges sat down to an informal supper in the reading room of Levering Hall.<br />\nAfter the supper Dr. Wilson introduced Mr. Jays, and he gave us a short talk<br />\non the call to Christian men to devote their lives to the christianizing and<br />\ncivilizing the people of foreign lands. When he sat down the men began to<br />\nask questions. In this way were brought out, in a very informal, pleasant way,<br />\nmany interesting and instructive points about such work.<br />\nOur arrangements for Sunday were interfered with by the very bad weather,<br />\nbut about forty men gathered in Levering Hall in the afternoon when Mr. Jays<br />\nagain made a strong appeal and told some interesting experiences. The men<br />\nwere so extremely interested that the talk seemed too short. As a result of<br />\nthese two meetings quite a number of Hopkins men arranged for personal inter_<br />\nviews on Tuesday. In this way the day was well filled until five o'clock, when<br />\nhe again spoke to about twenty men, presenting the personal Christ to them<br />\nvery forcibly.<br />\nMonday was spent chiefly at the Medical School where he attended some<br />\nof the clinics. Mr. Jays says Hopkins is considered in England as a \"mecca\"<br />\nfor medical men. In the evening he spoke to an interested group of students<br />\nand faculty members in the Association Reading Room at the hospital.<br />\nIt will be a difficult matter to estimate the results of this visit. It will take<br />\ntime to tell what they will be. Many men realize more than ever before in their<br />\nlives that the whole world is open to them to choose a place to invest their<br />\nlife, that Jesus Christ has a claim on their lives for best investment, and they<br />\ncan never again be excused for not thinking about it. It means men interested<br />\nin the cause of foreign missions whether they go or stay at home. And by<br />\nGod's blessing it means some men give their lives very definitely for this form<br />\nof service. It is not a far-off question. It is, which of us shall it be?<br />\nM. B. GRAFF'.<br /><br />\nC<br /><br />\nShe meditated with growing anger. Suddenly she grasped a bottle of<br />\nHairine, and hurling it across the room, shrieked: \"Ha, the dye is cast!\"—<br />\nPrinceton Yiger.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nTHE TRACK AND FIELD TEAM.<br />\nGAMES SCHEDULED TO DATE.<br />\nJanuary 29th—Inter-Class Scratch Games.<br />\nFebruary 14th—Baltimore Athletic Club, Fifth Regiment Armory.<br />\nFebruary 21st or 28th—Johns Hopkins University, Open Handicap Games.<br />\nMarch 7th—Georgetown University, Washington, D. C.<br />\nApril 25th—University of Pennsylvania, Relay Races.<br /><br />\nFTER a period of restless inactivity, the Track and Field Team has again<br />\nsettled down to hard, sytematic work, so that from now on we must be<br />\nprepared for all kinds of new and startling developments in this line.<br />\nEvery afternoon an apparently endless string of men extending nearly the<br />\nentire length of the track, may be seen in the Cage, first walking, then running,<br />\nand finally going through certain nameless, indescribable, unintelligle movements and motions, which mean so much to the unitiated, but are hopeless .<br />\nbeyond the conception of other poor mortals. Each candidate is being gradually<br />\nbrought to his best form in order that Hopkins may make a most creditable<br />\nshowing during the coming season. The present outlook is unusually encour—<br />\naging, for, although the ranks have been somewhat depleted by the loss of one<br />\nor two old men, yet most of the old \"stand-bys\" are back \"doing business at<br />\nthe old stand,\" and among the freshmen are several likely chaps who give<br />\npromise of being able to uphold their end of the work.<br />\nThat the management has gotten busy may be seen by the above schedule<br />\nof games. Due preparation will be made in time for each of these events, but<br />\nat present all interest is centered in the Inter Class Games to be he'd in the<br />\nCage next Thursday evening. At this time no official list of entries can be<br />\ngiven, as the Class Representatives are to select the participants from their<br />\nrespective classes, and to submit them to the tender care of Father Bill, who<br />\nwill not announce them till shortly before the events. However, every man<br />\nwho has been out, will undoubted be urged to enter every event for which he<br />\nseems to have ability. The events, as arranged, will consist of 35 yard and<br />\n440 yard dashes, half mile and one mile runs, standing broad and running high<br />\njumps, putting of the L2 lb. shot, and a Class Relay Race Aside from stirring<br />\nup enthusiasm and giving confidence to the new men, these games will afford a<br />\nmore definite means of classifying them, so that each one may, with singleness<br />\nof purpose, devote himself exclusively to that kind of work for which he seems<br />\nto be best fitted, While it is of course impossible for all of us to engage actively<br /><br />\nTHE NEWS-LETTER.<br /><br />\n12<br /><br />\nin the games, yet every one can and should be on hand to contribute his share<br />\nof vigor and enthusiasm.<br />\nAt the regular monthly meeting of the Athletic Board, on January t 6th,<br />\nsituat;on of the past season was discussed, and after careful confootball<br />\nthe<br />\nsideration it was decided not to award the official \"H\" to members of the team.<br />\nThe ground for this action was that, as the \"H\" is a reward of personal ability<br />\nand not of faithfulness and perseverence—which would embrace half the members of the University—they could not feel justified, under the existing circumstances, in awarding them.<br />\nCaptain Blanck in his report highly commended the faithful work of the<br />\nmen. Manager Matthai was unable to make a full report, but stated that the<br />\nseason was a success financially and that there was a comfortable balance on<br />\nhand.<br />\nThe question of the Annual Athletic \"Feed\" was laid on the table.<br />\nIn a circular just issued, a strong appeal is made to all men of any ability<br />\nwhatever to come out and have that ability developed. The medical men<br />\nespecially are urged to do their share towards making this season's work successful; for, although it is well known that some of the best men on the foot<br />\nball, base ball and lacrosse teams have been recruited from the Medical School,<br />\nyet in track work the candidates from that source are painfully scarce. The<br />\nmanagement of the Track and Field Team should have the hearty co-operation<br />\nand support of the Medical School in its praiseworthy efforts to turn out a win_<br />\nning team for Hopkins.<br /><br />\nLT<br /><br />\nLACROSSE DOINGS.<br /><br />\nHOUGH there is no great amount of real lacrosse news since our last<br />\nissue, still it is a pleasure to note that everything is progressing in a<br />\nhighly satisfactory manner. The practice last Saturday, which is<br />\nalways the most important of the week, must have been especially encouraging<br />\nto Captain Strauss. Not only were every one of the old men—Putts, B. Bernheim, Bird, Tough, Blanck, R. Schmeisser and H. Strauss—out in the cage<br />\nready kr work, but 20 scrubs, several of whom are very promising, helped to<br />\nfrom an unusually large squad for this time ot the year. Besides these, Coach<br />\nR T Abercrombie and ex-Captain William Schmeisser were on hand to give<br />\nable assistance in the fine points of the game. On the whole, the passing was<br />\nclean and the attack made several pretty goals on fast team work, despite the<br />\nfact that the defense covered up well. In one or two instances the men seemed<br />\nto be in too big a hurry, and a number of passes were made by the attack before<br />\nthe defense man had been drawn out far enough. To this mistake were due<br />\nnumerous intercepted passes. The very same thing happens at the beginning<br />\nof every season, however, and in a few weeks it may reasonably be expected to<br />\nsee these defects disappear.<br />\nIt is somewhat early to make predictions regarding vacancies on the team<br />\nand those who may fill them. However, a few remarks regarding the most<br />\npromising men may not be out of order.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nShould Putts at in home, B. Bernheim at out-home, and Bird at second<br />\nattack keep the same places this season, the attack positions open to new men<br />\nwill be first attack, second attack, and centre. Judging from last Saturday's<br />\npractice, there are a number of scrubs who will fill these positions with credit.<br />\nAmong them is Taylor, one of those flying Quakers from Swarthmure, whose<br />\nlegs seem to run straight up to their collar buttons. In appearance he resem_<br />\nbles Harris of last year's team, about whom some one said \"No use trying to<br />\ncatch him; somebody head him off!\" Taylor is said to be exceptionally fast<br />\nand able with his body. A little more speed and dexterity with his stick and<br />\nhe will make a valuable attack man. At centre, Matthai is playing a very<br />\nclean game. He generally manages to get the ball on the face-off and uses both<br />\nhis head and stick in an encouraging manner. Strobliar is another scrub whose<br />\nwork is placing him among those attack aspirants who have a chance for the<br />\n'Varsity. He is very fast and his stick work shows steady improvement. If<br />\nPearre continues to improve, he will make another man whom the 'Varsity<br />\nmay be able to use to advantage. Rosenheim also shows promise, and Hazleburst, Erlanger and Dill are doing well.<br />\nAt goal, Phil Straus displays a keen eye and a clear head. Should Briscoe<br />\nfail to return to the Medical School, Straus will stand a very good chance for<br />\nthe position.<br />\nThe defense does not offer half so many opportunities to the scrubs as the<br />\nattack, there being but one vacancy in the line For this place several men<br />\nare working hard, notably Gregg Custis, who played in the first 'Varsity game<br />\nlast season against the University of Pennsylvania at Philadelphia. Aside<br />\nfrom his ability, the continued hard, conscientious work which Custis has done,<br />\nshould entitle him to unusual consideration as a defense candidate. Riley and<br />\nWinternitz may likewise be numbered among the faithful. \"Bill\" Hoffman is<br />\nout with the squad this year, and when his head and arms are able to equal his<br />\nlegs in merit, he will be of no little use to tf,e 'Varsity. Outside of the foregoing and the old men, Captain Straus has a trump card up his sleeve which<br />\ncannot be played at this stage of the game It has been played with great<br />\neffect in other decks, and, it is to be hoped, may be placed in the shuffle again<br />\nthis season.<br />\nAs regards the schedule, we are still dealing in glittering generalities. The<br />\nSwarthmore, Stevens, Lehigh and Crescent gatnes are arranged, but the Cornell,<br />\nand Cambridge-Oxford contests are uncertain. The recent predictions in THE<br />\nNEWS LKTTlilt to the effect that Cornell is not over anxious to tackle Hopkins,<br />\nat Ithaca, have been confirmed by one or two communications, recently received<br />\nby Manager J. A. Addison. On account of the ridiculously small guarantee<br />\noffered by Cornell, most of the Hopkins players agreed to chip in several dollars<br />\neach for the sake of the trip and for the sake of putting at rest all doubts regarding the relative strength of the two teams which usually win the champion<br />\nships of the inter collegiate and of the inter university leagues. Evidently such<br />\na display of determination on the part of Hopkins to bring about a contest must<br />\nhave jarred Cornell considerably, for they replied promptly, stating that they<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nreally did not see how, owing to financial embarrassment, a game could be<br />\narranged. Oh, dear! Fudge! Fury! Looks suspicious! \"So say we all of us!\"<br />\nWith the Englishmen, our chances are better. Manager Addison has<br />\nreceived word from the Oxford-Cambridge management, saying that Harvard<br />\nwill arrange all the exhibition games which the Englishmen are to play in the<br />\nUnited States. The visitors evidently intend to engage in a series of contests,<br />\nand there is no reason why Hopkins should not have a shot at the goose.<br />\nEverything points to a truly great lacrosse season. Get to work, scrubs,<br />\nand win your spurs! The game is well worth the candle!<br />\nThe candidates were glad to see a large number of students watching the<br />\npractice from the gallery last Saturday afternoon. Such interest is very<br />\nencouraging.<br />\nTRACK TEAM STATISTICS.<br /><br />\nAll Track Men.<br />\nR C. Hoffman, '03, (Capt.)<br />\nH. K. Tootle, '03,<br />\n'03,<br />\nWilliams,<br />\n'03,<br />\nPassagno,<br />\n'03,<br />\nBlanck,<br />\n'03,<br />\nNelson,<br />\n'03,<br />\nSmith,<br />\n'03,<br />\nTough,<br />\n,03,<br />\nYearley,<br />\n'03,<br />\nBird,<br />\n'03,<br />\nSchmeisser,<br />\nPorter,<br />\n'04,<br />\nBranham,<br />\n'04,<br />\nEmig,<br />\n'04,<br />\nKohn,<br />\n'04,<br />\n'05,<br />\nChism,<br />\n'05,<br />\nStone,<br />\n'05,<br />\nSuper,<br />\n'05,<br />\nGoodenow,<br />\n'05,<br />\nJackson,<br />\n'05,<br />\nWroth,<br />\n'05,<br />\nMorse,<br />\nW. E. Hoffman, Jr., Graduate,<br />\nic<br />\nEngland,<br /><br />\nAge.<br />\n21<br /><br />\nWeight (stripped)<br /><br />\nIleig-ht.<br />\n6o<br /><br />\n20<br /><br />\n5.8<br /><br />\n1 48<br />\n1231%<br /><br />\n21<br /><br />\n5.10<br /><br />\n133<br /><br />\n22<br /><br />\n5-7 Y3<br /><br />\n127<br /><br />\n21<br /><br />\n5.11<br /><br />\n1 75<br /><br />\n19<br /><br />\n132<br /><br />\n21<br /><br />\n5. 10,<br />\n6.2<br /><br />\n21<br /><br />\n5 10<br /><br />\n152<br /><br />\n185<br /><br />\n1.48<br /><br />\n19<br /><br />\n6.1%<br /><br />\n22<br /><br />\n5.10<br /><br />\n1.48<br /><br />\n21<br /><br />\n5.11<br /><br />\n157<br /><br />\n[9<br />\n18<br /><br />\n115<br /><br />\n18<br /><br />\n5•5<br />\n5.8<br />\n5.9%<br />\n5.5<br /><br />\n21<br /><br />\n5.8<br /><br />\n1 42<br /><br />\n17<br />\n[8<br />\n[7<br />\n[9<br />\n19<br />\n19<br /><br />\n5.9<br />\n5.8<br />\n5.9<br />\n5.8<br />\n5.8J4<br />\n5.11<br /><br />\n1 48<br /><br />\n20<br /><br />\n21<br /><br />\n5.10<br /><br />\n19<br /><br />\n6<br /><br />\n125<br />\n132<br />\n130<br /><br />\n4<br /><br />\n125<br />\n130<br />\n122<br />\n130<br />\n132<br />\n1 40<br />\n1 45<br /><br />\n\"Foiled again!\" hissed the sweet chocolate, as they wrapped it in silvery<br />\npaper.—Cornell Widow.<br />\nHIS COUSIN: So you are a Junior this year. And next year what will<br />\nyou be, a Senior?<br />\nOh, that depends on conditions.—Cornell Widow.<br /><br />\nTIM NEWS-LEVrEit,<br /><br />\n15<br /><br />\nA DESSERTATION ON SONNETS.<br />\nHE Angry Mob was sitting quietly in the barber shop when the Poet<br />\nstarted the discussion. \"I see,\" he remarked casually, \"that the season<br />\nof the year is approaching when it behooves the Junior Class to hand in<br />\nsome sonnets to keep Dr. Greene from reading Anglo-Saxon to them.\"<br />\n\"I tried to write a sonnet once,\" confessed the Fusser, \"but there were too<br />\nfew words to rhyme with love and with sorrow; love, dove, glove, above, borrow, sorrow, tomorrow, that about exhausts the supply.\"<br />\n\"Was it an Italian Sonnet ?\" queried the Italian, whom the Bugologist<br />\naddresses as Mr. Dinklebender.<br />\n\"It was not, it was better,\" said the Fusser, \"it was a sonnet I originated.\" At this moment the Cdief Supe broke in.<br />\n\"Malatesta! Say nothing against the Italian.\" The Captain of the Supes<br />\nsquelched the Chief Supe with one lightning glance. The Poet brought them<br />\nback to the matter in hand<br />\n\"I am preparing some sonnets,\" he ventured timidly, \"which might be of<br />\nuse to the members of the Junior Class—at the usual market rates. There is<br />\nnothing hard about a sonnet.\"<br />\nThe Fusser sighed, the Bugologist looked incredulous, and Walter absentmindedly lathered the hair of the Chief Supe.<br />\n\"All that is necessary is to understand the words which you want to use,<br />\nand then put them together. I have taken the following rhymes, after the<br />\nusual a, b, b, a, manner, and fitted them together in the most approved<br />\npoetic fashion: steal, heart, apart, unseal, feel, start, chart, reveal. That shall<br />\nbe my octave; now for the sestet, learn, past, guide, return, cast, purified.<br />\nGood. Now, gentlemen, what shall it be first?\"<br />\nThe Objector, skilled in opposition in the senate, thought to stump the<br />\npoet; \"Give us,\" he cried, \"something in contemplation's deepest mood.\"<br />\nThe poet turned as pale as the Chief Supe's hair. Pulling himself together,<br />\nhowever, he produced the following:<br /><br />\nZ<br /><br />\nSOLITUDB.<br /><br />\nThere is a balm in silence which doth steal<br />\nWith soothing power into the weary heart,<br />\nWhat joy we find it is to dwell apart<br />\nIn realms of silence where we can unseal<br />\nThe inmost chambers of the heart, and feel<br />\nNo searching eye is here to make us start<br />\nWith dread surprise by gazing on the chart<br />\nOf our life's deeds which doth the past reveal.<br />\nSo in the sacred silence do we learn<br />\nTo live aright by thinking on the past;<br />\nAnd by the past our future steps to guide.<br />\nWhen once again we to the world return,—<br />\nThat busy mart, wherein our lives are cast,—<br />\nBy silence have our hearts been purified.<br /><br />\n.41<br /><br />\n16<br /><br />\n'i'ii i<br /><br />\nNEWS—LETTER.<br /><br />\nIt was too erudite for the audience. The Bugologist whispered to the Objector that it would be `foine und doisy' if an explanatory chart was annexed.<br />\nThe Captain of the Supes remarked that anyone would have to be pretty foolish<br />\nto write a thing like that, The Chief Supe then said, \"Let us see if you cannot do better in lighter vein. Use the same rhymes for a sonnet which would<br />\nsuit the men who frequent the back room of the Hullabaloo Club.\"<br />\nThe Poet was shocked<br />\nAfter much persuasion he evolved the following<br />\nsonnet, much to the delight of the stein-men—including the Fusser, who loved<br />\na stein almost as much as he did a pretty face.<br />\nTOMMY'S RESTFUL RETREAT FOR HOPELESS HOPKINSON1ANS.<br /><br />\nBetween the hours of twelve and one I steal<br />\nTo a resort, built after my own heart,<br />\nWhere liquids, oysters, crackers, form a part<br />\nOf the long bill of fare. I can unseal<br />\nMy heart the better o'er a stein, and feel<br />\nMost eloquent when once I get a start.<br />\nWhen I've had maybe five, I draw a chart<br />\nOf all my debts and see what they reveal.<br />\nAt ten I feel there's nothing I can learn,<br />\nMy debts are things of the long distant past.<br />\nMy steps unsteadily I try to guide<br />\nWhen to the Hopkins I would make return.<br />\nAnd when in Walter's chair my frame I've cast<br />\nBy a shampoo my head is purified.<br /><br />\n\"That is better,\" said the Chief Supe, \"but anyone of us could do as<br />\nwell.\"<br />\n\"With the same rhymes?' said the poet triumphantly.<br />\n\"With the same rhymes,\" said the Angry Mob in unison, \"we'll show you<br />\nat the next meeting.\"<br />\nThe mob retired, leaving the poet the possessor of the barber shop, but<br />\nhe telt that at the next meeting they would show him a few things he did not<br />\nknow.<br />\n(To be concluded.)<br /><br />\nGYMNASIUM PROPRIETOR : We always have a competent \"Force\" of<br />\ninstructors.<br /><br />\nINSPECTING FEMALE: And such a nice \"Sunny Jim.\"—Lampoon.<br />\nALPHONSE : Has he got a good room?<br />\nGASTON : Peach! He's got a policeman's helmet, three \"Subway to Park<br />\nSt.\" signs, and a life-size portrait of Anna Held.—Lamfioon.<br /><br />\nQUERY:<br /><br />\nDo sleigh belles attend snow balls?—Lamftoon.<br /><br />\nMOTHER: Johnny, I am ashamed of you ! What did you mean by laughing and giggling at your dear uncle's funeral?<br />\nJOHNNY : Gee! I was so glad it wasn't my own.—Princelon Tiger.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAMISON 0 WATTS,<br />\nw-,3Drug $'torcsAl.<br />\nHocward and Franklin Streets.<br />\n1Druget Vino? Goo. Iperttuncir,<br /><br />\nTHE CHEAPEST PLACE<br /><br />\nBaltimore and Eutaw Streets.<br />\notLtBrtiCICS, Cigare, $00a ttaatcr.<br /><br />\n&amp;<br /><br />\n\"Phone xvio- V.A-6<br /><br />\nHENRY N. ORUNS,<br /><br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nSt udents' Sundries.<br /><br />\nH. S. WRIGHT 8G CO •<br />\n704 MADISON AVE.<br /><br />\nN. W. Corner<br />\nLexinoton ,uid Liberty Sts.<br />\nAgent<br /><br />\nt•—••• I<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nM. MEADE, OF<br /><br />\nLONDON,<br /><br />\nEXPERT CLEANER AND DYER.<br />\n1213 N. LlITAW ST. (2nd and 3rd floorS).<br /><br />\nThe most complete and modern department for<br />\ndyeing and altering Gents' and Ladies,<br />\ngarments.<br />\nIt's time your Winter Clothing was nut in order.<br />\nDoes it need to he eleftned, dyed, altered or repaired? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to<br />\nlook like new, and yon won't have to pay very much<br />\neither. The Price List speaks for itself.<br />\n•<br /><br />\nM. BERNSTEIN &amp; CO.<br />\n1.0N noN A ni it icA N<br />\n_TAILORS<br /><br />\n.`1i0lienntlicul ;Anti Surve.ylnu<br />\niiil Ilnolneers' Supplies<br /><br />\nAND<br /><br />\nIMPORTERS_<br /><br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that lit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can fl nd nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that Is less<br />\nParticular, It's our way.<br />\nWe are prepared to show you a large line of ,imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NORTH it ITAW :••;1121]11T.<br />\n(Second door above Joel Gutman &amp; Co.)<br /><br />\ncull,. I<br /><br />\nHenderson's<br /><br />\nL'sscr C'o<br /><br />\nliAL1'IMQ121],.;'11).<br /><br />\n0,1\" Vitr York.<br /><br />\n,<br />\n,• a4<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText, Books, Nitto Books,<br />\nMadison<br />\nstudents' Supplies.<br /><br />\n&amp; Hocrvard Sts.<br /><br />\nGENTLEMEN'S<br /><br />\nPRESSED<br /><br />\nCLOTHING<br /><br />\nBY<br /><br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRicEs ll'Olt DRY CLEANING. AND DYEING.<br />\nGentlemen's Suits cleaned and pressed<br />\n•<br />\n$1.00<br />\n_<br />\n.•.<br />\n._<br />\nTrousers,<br />\n..-do<br />\nCoats,<br />\nVests,<br />\n•..<br />\n_<br />\n_<br />\n_<br />\nI ivercoats,<br />\n1.00<br />\nBoys' Suits, according to size, .50..75 mid 1.(Xt<br />\nVelvet collars in overcoats,<br />\n.75<br />\nRELINING. -A new lining will often make a garment which you have discarded good for another<br />\nSeason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\n111Y El NIL<br />\nGentlemen's Suits dyed tutu l pressed,<br />\nV.00<br />\n_<br />\nI iveireonts,<br />\n1.50<br />\nBoys' Suits, according to size<br />\nWI, 1.25 and 1.50<br /><br />\nCLOTHES MADE TO ORDER.<br />\nTho illustrations show how the clotIWR we make fit<br />\nand look--the wear you'll learn about. later.<br />\nThe Bah, overemit is 1111 eSpeeially RIM ppy garment<br />\nThe Stiek Suit is Olt titter the very newest. too tterri.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nIntl II could wish.<br />\nWe make all other proper styles, ot course; dreas,<br />\ncutaway, double-breasted, four-1.1mm) sack and<br />\nNorfolk snits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low—we rover learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWESIT PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nwill be the best you ever Saw.<br />\nfect fit.<br />\nYour money back If you are dissatisfied.<br />\n126 N. I Mt.iiW St.<br />\n/%1. BERNSTEIN &amp; CO.<br />\ns.EI OUR PRICE LIST FOR CLEANIN, DYFINC; AND ACTFRINO.<br /><br />\nCapilal $300,000. Surplus alla Uflwiei1 Pf011.8 $400 000<br /><br />\nSTIEFF PIANOS<br />\nMATEFCIAll.t.1 MONEY<br /><br />\nMADE 010<br /><br />\nEXPE121114.;NCE CA N<br /><br />\nNV Alt IfIlt11(imi...<br /><br />\nDrovers &amp; Mechanics Nat'l Bank,<br />\nOr<br /><br />\nIII TI.<br /><br />\n9 N. IA<br /><br />\nNT V<br /><br />\nsT.<br /><br />\nrs and<br />\nGUSHING ScGOMPANY'Botaotkisent',<br />\noners.<br /><br />\nBALTIMORE.<br /><br />\nJas. Clark, Prest<br />\nChas. S. M Wen, Cashier.<br /><br />\nL. Strouse,<br />\nEdw. I'. Hayden. ;Isn't Cashier.<br /><br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for. Rent<br />\nfrom 1 p r year arid upward.<br /><br />\nIAGGOIfiltS<br /><br />\n34 W. BUTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\n;n Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\nSIR TIONBRY—For School, Pamil, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Neck\"' wear,Underwear<br />\nHosiery, etc.<br />\nMMINNI<br />\nMONIIIII<br />\nNIIMMINI<br />\nIIINNIUM<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale Tho .1. II. U. Pennants, ii!A all 011141 College<br /><br />\nTHOS.BLAKE CO<br />\nPennants.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFH MAN &amp; SON,<br />\nFOR<br /><br />\nJORDAN STABLER GO.<br /><br />\nAVE.<br />\nM<br />\nSamples submitted of<br />\nReads as follows:<br />\nadulterants, no coloring, tine quality.<br />\nFrench liritudy<br />\nOporto Port absolutely pure, oi superior quality.<br />\nSherry—no coloring or 11OUlt crams. absolutely pure wine.<br />\nRye Whimkey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar- -natural cider vinegar, strictly pule and<br />\nstrong.<br />\nSix Ground Spieem—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANUFACTURER<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\n(Steck letter ffraternitv jewelrp,<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\n.<br />\nPlc ai,c. Call ant; Examiac our %Lac Vet ore 1Purchasina<br /><br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. o's V. telephone 445-v.<br /><br />\n1 KM 1 IA<br /><br />\nLibraries arranged and put in<br />\norder without removal. Ar<br /><br />\n.Sc 1 I()RS DN.<br /><br />\nJENNIN(<br /><br />\nRUZICKA<br /><br />\nN'y<br /><br />\n. l•'<br /><br />\nSTIR Kan%<br /><br />\nBOOKS<br />\nND!!<br />\nSECOND=HA<br />\nMiscellaneous,<br />\nSchool, Medical and<br />\nBought, Sold and<br /><br />\nExchanged.<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 N. ELIT/VW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old 'Book Store.<br /><br />\n6<br /><br />\nBookbinder,<br /><br />\nJ. H. U. Binder.<br /><br />\n609<br /><br />\nN. Eutaw St.<br />\nJAMES R. PAINE•<br /><br />\nTHEO. WARNER-<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\nBALTIMORE STREET.<br />\nWEST<br />\n34<br />\nManufacturers of<br />\n•<br />\n71 S<br />\nilop<br />\nSilk and CaSsimore lists. tAC<br /><br />\nCaps<br /><br />\nki<br /><br />\n-<br /><br />\nMORTfl GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE fa LOW RATES.<br /><br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBIALTIMORE TO BREMEN DIREGT.<br /><br />\nSGAUMAGHLR Sc GO., General<br /><br />\nor particulars apply to<br /><br />\nISAAC H. DIXON. PRr.4,4.<br />\nJAS. R. RICHARDS,<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br />\nBaltimore, Md.<br /><br />\nRunts.<br /><br />\nVICE-PREST,<br /><br />\nTHE AS.<br /><br />\nSmith, Dixon Co.<br /><br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard Si.,<br /><br />\nME 51 L,<br /><br />\n29 -<br /><br />\n31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36251, "display": null, "description": null, "target_type": "file", "target_uuid": "b9948da7-fec5-4b35-a96f-5228def1dd76", "url": "http://digital.library.jhu.edu/system/files/2022-03/12230-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12230, "target_type": "node", "target_uuid": "e9ca0c3d-3f07-4843-9e01-328414784cbb", "url": "/node/12230"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3f2e804b-83f1-4488-bd62-99ac753fd1f1"}]}