{"mid": [{"value": 38141}], "uuid": [{"value": "e3e4351e-6c0d-46f3-9c31-3b534a3b7b32"}], "vid": [{"value": 38141}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:48:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12708-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:48:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:48:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nXIIIlug iqopking Nrius-Krttrr<br />\n<br />\nVOLUME XLI, NO. 4<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br />\n<br />\nJohn E. Desch Dr. Sherwood Eddy'Playshop' To<br />\nPickedToCoach To Present Film BringHedgerow<br />\nOn Soviet Russia<br />\nBarnstormers Renowned World Traveler Players Here<br />\nFormer Member Elected<br />\nTo Direct First Production<br />\nOf Season<br />\n<br />\nTo Speak At Assembly<br />\nThursday<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHeads New Yor.k Alumni Group<br />\n<br />\nRenowned Repertory Group<br />\nTo Present Double Bill<br />\nAt Auditorium<br />\n<br />\nRECEPTION<br />\n<br />\n'News-Letter' Staff Hullabaloo Pleads<br />\nTo Hear Macaulay Case Before Seniors<br />\nWednesday At 4 AtThursdayMeeting<br />\n<br />\n1,412 Of Students Are Marylanders—Total Of 2,103 Sets<br />\nNew Record<br />\nMiss Alma H. Prienkert, registrar<br />\nof the University of Maryland, announced today that students from this<br />\nState made up sixty-seven per cent.<br />\nof the total enrollment.<br />\nOf the 2,103 students enrolled—<br />\na new high for the university-1,412<br />\nare residents of Maryland, 197 more<br />\nthan last year. There are 34 more<br />\nfrom the District of Columbia and<br />\nonly 2 more from out of the State.<br />\nThe Graduate School, with a sixtyfive per cent. increase, was the only<br />\ndivision to show a substantial increase among out-of-State students.<br />\nOf the 757 freshmen, the largest<br />\nfirst-year class ever to enroll, seventy-one per cent. are from Maryland, a<br />\ntwenty-three per cent. increase over<br />\nlast year.<br />\n<br />\nIf any of the handsome Adonis to ben very mediocre—of the many hunwhom the Hopkins student body may dred schemes tried by me, all I can<br />\none has done any<br />\nlay claim are suffering from a fear say is that not<br />\nharm, as far as I know. These schemes<br />\nthat in future years their pristine<br />\nhave ranged from the use of mustard<br />\nbeauty will be marred by a bald head,<br />\nplasters to a sympathectomy on the<br />\nthey may cease their worrying immetemporal artery.\"<br />\ndiately, for others who have already<br />\nHis latest attempt has been the use<br />\nsuffered from this complaint are conof electrical energy! According to him,<br />\nstantly experimenting in an effort<br />\nthe only appartus necessary is two auwhich practically parallels growing<br />\ntomobile batteries, two electrodes a<br />\nhair on a billiard ball. Who knows,<br />\nstrong nervous system, and plenty of<br />\nperhaps some day some genius will<br />\nfaith. If any readers determine to venhit upon a discovery which will banture an attempt under the above condreaded<br />\nenemy<br />\nthis<br />\nof<br />\nish<br />\nbeauty?<br />\nditions, they may desire to ask the<br />\nRecently one despairing soul whose same questions which this brilliant<br />\nhairs are evidently very meager has saviour of manhood's crowning glory<br />\nhit upon the unique idea of applying has addressed to Dr. W. B. Kouwenelectricity to the head to stimulate hoven. He seemed most anxious to<br />\nthe growth of the hair. According to find out whether the current would<br />\ncorrespondence with the Electrical travel superficially through the scalp<br />\nEngineering Department he writes and not penetrate deeply enough to<br />\nthat \"for the past fifteen years I affect the brain substance. It is wellhave had hallucinations concerning known scientific fact that bone is of<br />\nthe therapeutic values of different high resistance. Therefore, as it is imtreatments, drugs and gadgets. Un- portant that the letter writer has a<br />\nfortunately, to date my results have thick skull, the danger is slight.<br />\n<br />\nRemsenClubHears<br />\nHarker At Meeting<br />\n--Club Makes Plans Concerning Acquisition Of New<br />\nMembers<br />\nThe Remsen Chemical Society inaugurated its 1986-37 season with a<br />\nmeeting held last Thursday afternoon in Room 221, Remsen Hall.<br />\nDr. David Harker, newly appointed<br />\nlecturer in elementary chemistry, addressed the meeting briefly; offering, on behalf a the Chemistry Department, the use of a laboratory<br />\nwhich was donated by Dr. Walter<br />\nA. Patrick, the only restriction placed<br />\nupon the members in the use of<br />\nwhich is that they undertake no<br />\ndangerous research.<br />\nDr. Harker added several suggestions concerning the acquisition of<br />\nnew members. He recommended that<br />\nonly those students particularly interested in chemistry be admitted<br />\n(Continued on page 3, col. 6)<br />\n<br />\nFOLLOWS<br />\n<br />\nSchweitzer, Head, Has Revived Eastern Alumni<br />\nGroup<br />\n<br />\nJohn E. Desch, '28, former member<br />\nthe assembly hall of Latrobe Hall, he 37 is an engagement of the Hedgerow<br />\nof the Barnstormers and prominent will present a color film of<br />\nRussia, Players, under the direction of Jasper<br />\nlocal dramatics coach, has been se- taken this past summer. It was made Deeter, to be supplemented by other<br />\nlected to direct the first production of in connection with the annual Euro- plays and lectures through the winter.<br />\nthe 1936-37 dramatics season of the pean Seminar given by Dr. Eddy for Dr. N. Brillion Fagin, director of the<br />\nAmerican Statesmen, religious lead- Playshop, has planned the activities<br />\nJohns Hopkins Barnstormers, accorders, and educators. The entire school, to include a series of lectures and two<br />\ning to Marty Levine, president of that students, faculty,<br />\nand the general pub- plays to e presented by Hopkins playorganization.<br />\nblic are invited. The film is titled, ers at the Playshop, on the campus.<br />\nThe Hedgerow players come to<br />\n\"We are exceedingly fortunate in \"Life In Russia.\"<br />\nAt<br />\n1.00<br />\nP.M.<br />\nthere<br />\nfor the first time, to preBaltimore<br />\nwill<br />\nbe<br />\na<br />\nlunchMr.<br />\nof<br />\nservices<br />\nhaving obtained the<br />\nDesch,\" said Levine. \"His record of eon in Levering Hall. Dr. Eddy and sent two bills at the Auditorium Theathe plays he has directed and produced Mr. Sam Franklin, of the Delta Co- tre on November 18. Considered by<br />\nIn the last several years is amazing, operative Farm of Hill House, will be many to be the finest repertory group<br />\nand we're sure that whatever play is heard speaking on this famous co- in America, this organization enjoys<br />\nchosen to be presented will uphold operative venture. This luncheon is a national reputation, based upon the<br />\nthe standard and continue the prestige open to all, arrangements to be made past production of thirty-five different<br />\nplays, given in three hundred and<br />\nthat the Barnstormers have gained through the Y.M.C.A.<br />\nthirty performances. Under the exTo Speak At Goucher<br />\nfor themselves in past performances.\"<br />\nAt 4.00, Dr. Eddy will be heard at tremely capable leadership of Jasper<br />\nMr. Desch, who among other things<br />\nis dramatics coach at the Baltimore Bennett Hall, Goucher College. In the Deeter, acknowledged by most critics<br />\nCity College, has produced such evening, at seven, there will be an op- to be a genius in the theatre, and subBroadway successes there as The Poor en Cabinet meeting at the Hopkins, ject of a recent article by Sherwood<br />\nCHANNING E. SWEITZER<br />\nNut, The Queen's Husband, The Ner- to which everyone is invited. Mr. Anderson in Esquire,this experimental<br />\n1/014.9 Wreck, Once In A Lifetime, and Franklin will speak on the farm, of theatre, with headquarters in Rose<br />\nShe Loves Me Not. He is somewhat which he is manager, telling some- Valley, Pennsylvania, has just played<br />\nof a Gilberterian, having directed the thing of the plan which operates this an engagement in Philadelphia, where<br />\nGilbert and Sullivan operettas Pirates venture, called by some \"the greatest the critics were unanimous in lavishcooperative economic experiment in ing praise upon their work.<br />\nOf Penzance and The Mikado.<br />\nThe plays will be; The Emperor's<br />\n\"I am very honored at being elected the country.\" It is located in the sharecoach of the Barnstormers, an organ- cropper district of Mississippi, and New Clothes, a play for children, at<br />\nization of which I was a member for operated and controlled by both ne- 4. p. m., and Getting Married, one of<br />\nBernard Shaw's most biting satires,<br />\nfive years,\" stated the newly chosen groes and whites.<br />\nDr.<br />\nEddy<br />\nis<br />\njust<br />\nback<br />\nfrom<br />\na<br />\nlong<br />\n8.30 p. m. The scale of prices for the<br />\nat<br />\ncoach. \"And I hope to carry on the<br />\nFormer 'Sun' Staff Writer 'Hulabaloo Cost To Be<br />\nmany traditions associated with this trip to China. His visit was at the un- performances is to be: afternoon, 25,<br />\nsnimous<br />\n1.00,<br />\n$50.<br />\nevening,<br />\ncents;<br />\nrequest<br />\nChinese<br />\nof<br />\nY.M.<br />\nthe<br />\nand<br />\n50<br />\n35,<br />\nTo Speak In Levering Hall<br />\nSeparate From Senior<br />\ngreat organization. I hope to uphold<br />\nthe standard of old Barnstormer plays, C.A. leaders, who are attempting to 1.50 and 2.00.<br />\nAt<br />\n4<br />\nP.<br />\nM.<br />\nDues<br />\nIn February, Hopkins players will<br />\nand I am particularly interested in inaugurate a campaign of Christianbringing the new note of music, sing- ity in that famine-stricken country. He present August Strindberg's The<br />\nP. Stewart Macauley, Secretary of<br />\nHenry Kramer, Business Manager<br />\ning, and dancing to the comedies of was eye-witness to the Japanese occu- Father, one of the better-known plays<br />\nthe<br />\nUniversity,<br />\nwill<br />\naddress<br />\nthe<br />\nstaff<br />\nof<br />\nthe Hullabaloo, Robert Austrian,<br />\npation of Mukden, and acted as agent in the theatre world. Later, in April,<br />\nthe current season.<br />\nfor the neutrals in that city by cabling there will be a presentation of a new of the NEWS LETTER and the candi- Editor of the Hullabaloo, and Holt<br />\nMr.<br />\n\"As in the past,\" continued<br />\nGeneva, England and America. He comedy by an American playwright, dates to the staff on Wednesday morn- M,aulsby, President of the Student<br />\nDesch, \"the rehearsals will be fun—<br />\naccused by the Japanese of aband- which has not yet been selected.<br />\nwas<br />\ning, October 14, at 11.30. Mr. Mac- Activities Committee, unsuccessfully<br />\nand then more fun for everybody who<br />\noning his role of observer, and replied<br />\nIn addition to these major produc- auley has been the<br />\nturns out. The plays we have in mind<br />\nsecretary of the pleaded the case of the yearbook bewas opposed to militarism, tions, a number of lectures will be ofrequire large casts, so I hope that sev- that he<br />\nUniversity since December of last fore the Senior Class at a meeting held<br />\neral hundred students will attend the whether home or abroad, as a menace fered to season subscribers. The first<br />\nChristianity.<br />\nis scheduled for Latrobe Hall, on year, when he was selected to fill the last Friday in Latrobe Hall.<br />\nfirst rehearsal. This is an invitation to peace and<br />\nNovember ninth, when Professor Ha- new position. He graduated from HopFamed As Traveler<br />\nSince the Hullaba'oo is no longer<br />\nto the entire student body.\"<br />\nDr. Eddy's fame as a world traveler zelton .Spencer, of the English Depart- kins in 1923, and became associated subsidized by the University,<br />\neach stuLiterally born on the stage, Desch<br />\nand lecturer springs from his lifetime ment, will speak on George Bernard with the Sunpapers, holding the posident who desires a copy is to be<br />\nbegan his acting career in the arms<br />\nspent upon the lecture platform, and Shaw, and his importance in the World tion of assistant city editor of The Sun,<br />\nof his grandmother at the age of six<br />\nmany books of his experiences. He Theatre. The address will be followed from 1925 to 1930. From that time on, charged the regular fee, $3.50 for<br />\n(months in the Birth of a Nation. After<br />\ngraduated from Yale in 1891, going to by reading from Shaw's plays. Other he was staff writer for the Evening Frosh Sophs, and Juniors, and $10 for<br />\nattending McDonogh, he became promIndia, where he served fifteen years speakers in the series will be Donald Sun. Throughout his work, he main- Seniors. The Senior charge includes<br />\ninent in dramatics at Hopkins, usualy<br />\namong the students of the Empire. Kirkley, dramatic critic for the Bal- tained close connection with the uni- the privilege of having a formal picportraying the leading \"feminine\"<br />\nCalled at last to be the Secretary for timore Sun, Dr. Anne Irene Miller of versity, and was prominent among the<br />\nture and an informal \"shot\" in the<br />\nsuccesses<br />\nBarnstormer<br />\nroles in the<br />\nAsia for the National Council of the Goucher College, and Dr. Fagin, di- Alumni for his scholarly approach to<br />\nof that era. He has in the past, also<br />\nspecial<br />\nSenior section of the book.<br />\nY.M.C.A., he devoted the next years to rector of the Playshop.<br />\nthe study of its problems.<br />\ntaken part in various plays presented<br />\nNot<br />\nAssuming Past Debts<br />\nuntiring service among the officials<br />\nDr. Fagin expressed the hope that<br />\nHis skill as a writer is well known,<br />\nby the Johns Hopkins Playshop and<br />\nand young people's groups of India, the students would avail themselves<br />\n\"It is to be definitely understood\",<br />\nand<br />\nhis<br />\nUniversity<br />\nexperience<br />\nrepas<br />\nthe Vagabonds.<br />\n'China, Japan, and the Near East. He of the unusual opportunity offered by<br />\nresentative in relations with the press, said Business Manager Kramer, \"that<br />\nAmong the plays under consider- has made six visits to Russia,<br />\nfour of this excellent program and thereby as well as his years of actual service we are not assuming<br />\nany past debts<br />\nation by the play-reading committee, them since the Soviet Regime.<br />\nsupport a Hopkins enterprise. Season on newspapers, qualify him as a man<br />\nof the yearbook. We are producing<br />\nconsisting of Gerald Branower, Mere!<br />\nIn spite of his untiring activity and tickets will be sold in the Reading who will have much to say to the<br />\nHarmel, Stanley Prager, and Marty<br />\nour book independently of any other<br />\nwork on lecture platforms, Dr. Eddy Room of the library at two dollars staff of the paper..<br />\nLevine are as follows: I Love An Acstudent organization, and in doing it<br />\nhad time for writing. His books pub- each. These include all the activities,<br />\nLast year Mr. Miacauley spoke to<br />\ntress, Once In A Lifetime, The Bishop<br />\n(Continued on page 3, col. 4)<br />\n(Continued on page 3, col. 1)<br />\nthe staff about his experiences as a this way we feel that we can put out<br />\nMisbehaves, and Louder Please. They<br />\nreporter on The Sun. Thursday he will a better book and keep the yearbook<br />\nare all recent Broadway successes. The<br />\nspeak on the relations between the out of debt.\"<br />\nselection of the play will be announced<br />\nstaff of a paper and the work involved<br />\nLast year the Hullabaloo money was<br />\nshortly.<br />\nin preparing a paper for press.<br />\nused to provide capital for June Week,<br />\n<br />\nBaldheaded Men Face Relief<br />\nAs Genius Uses Electricity<br />\n<br />\nAlumni To Hold<br />\nBanquet In New<br />\nYork Friday Eve<br />\nDr. Bowman Scheduled As<br />\nPrincipal Speaker<br />\nFor Occasion<br />\n<br />\nSam Franklin, Manager Of<br />\nFORMER HOPKINS MAN Delta Cooperative Farm, DATED FOR NOV. 19<br />\nTo Speak Also<br />\nGroup To Offer Shaw<br />\nLevine, Dramatics President Dr. Sherwood Eddy, noted world<br />\nSatire, Dr. Fagin<br />\ntraveler and author, is to be at HopAnnounces Selection<br />\nAnnounces<br />\nkins on Thursday, under the auspices<br />\nAfter Meeting<br />\nof the Young Men's Christian Asso--- Heading the Playshop bill for 1936ciation. In the morning, at 11.30, in<br />\n<br />\nU.OfM.Enrollment<br />\n67P.C.From State<br />\n<br />\nSENIOR<br />\nCLASS MEETING<br />\nTOMORROW<br />\n<br />\nand when June Week went into debt,<br />\nthe Hul'abaloo went into the red also,<br />\nand the Administration was forced to<br />\ncover the deficit. The University Ad'ministration has definitely refused to<br />\n(pay any more debts for the Hullabaloo.<br />\nThe Hullabaloo staff feels that by<br />\nrunning its financial business separately from June Week, Senior dues, or<br />\nany other student activity, it can put<br />\nout a better book and meet with financial success.<br />\nSeniors Uncertain<br />\nThe members of the Senior class are<br />\nhaving difficulty in seeing why the<br />\nHullaba.loo must cost $10, when the<br />\nentire Senior Dues last year was only<br />\n$18. The answer lies in the fact that<br />\nlast year the accumulated debt of<br />\nJune Week and the Hullabaloo was<br />\nover $500.<br />\nThis year's annual will be dedicated<br />\nthe The Engineering School and will<br />\ncarry special \"shots\" of the Anniversary celebration in February.<br />\nIt is important that Seniors make<br />\nup their minds before the next meeting<br />\n'whether or not they will subscribe to<br />\nthe new plan of the Yearbook.<br />\n<br />\nApproximately 500 Hopkins alumni from New York City and nearby<br />\nsections in New York State, New<br />\nJersey and Connecticut will gather<br />\nfor the annual banquet of the New<br />\nYork, New Jersey and Connecticut<br />\nAlumni Association at the Hotel<br />\nPennsylvania<br />\n<br />\non<br />\n<br />\nFriday<br />\n<br />\nevening,<br />\n<br />\nOctober 16.<br />\nDr. Isaiah Bowman,President of the<br />\nUniversity, will be the principal<br />\nspeaker on the occasion. Other speakers will include Daniel Willard, President of the Board of Trustees; Walter S. Gifford, a Trustee, who is President of the American Telephone and<br />\nTelegraph Company; and Dr. Henry<br />\nA. Christian, former Dean of Medicine<br />\nof the Harvard Medical School and<br />\nnow Physician-in-Chief of the Peter<br />\nBent Brigham Hospital, Boston. Dr.<br />\nChristian received his M.D. at Hopkins in 1900.<br />\nReception Follows Dinner<br />\nFollowing the dinner there will be<br />\na reception and dancing, music for<br />\nthe latter to be provided by the Hotel<br />\nPennsylvania Orchestra.<br />\nThe banquet comes as a climax of<br />\na year in which the New York, New<br />\nJersey and Connecticut Association<br />\nhas undergone a remarkable revival<br />\nunder the presidency of Charming E.<br />\nSweitzer. During the year the membership of the Association increased and<br />\nthe Johns Hopkins Club of New York,<br />\nwith quarters in the Columbia University Club, was established.<br />\nClass Of 1908<br />\nThe President of the Association is<br />\nan A.B. of the Class of 1908. After<br />\nleaving Hopkins he studied at the University of Pennsylvania, New York<br />\nUniversity, Columbia and Harvard.<br />\nFor some time he was head of the Department of History and Government<br />\nat Shippensburg State Teachers College and Mercersburg Academy,<br />\nPennsylvania. He has been a member<br />\nof the staff of the Bureau of Municipal<br />\nResearch, New York; he served under<br />\nCalvin Coolidge in helping to frame a<br />\nplan for reorganizing the Massachusetts State Government and he was<br />\nAssistant Chief of Staff of the Committee on Retrenchment and Reorganization of the New York State Government in the administration of Governor Smith.<br />\nMr. Sweitzer is now Managing Director and Treasurer of the National<br />\nRetail Dry Goods Association. Last<br />\nyear he was elected to honorary membership in the Beta Circle of Omicron<br />\nDelta Kappa.<br />\nIn addition to his leadership in the<br />\nAlumni Association and the New York<br />\nClub, Mr. Sweitzer has been extremely<br />\nactive during the campaign for a Sustaining Fund for the University. He<br />\nwas chairman of the New York Advisory Board and he provided the<br />\noffice space which served as campaign<br />\nheadquarters in New York.<br />\nMembers Of Committee<br />\nWhile the annual banquet of the Association has no connection with the<br />\ncampaign for funds (the campaign<br />\ncloses officially in New York on<br />\nOctober 15) committees organized for<br />\n(Continued on page 3, col. 6)<br />\n<br />\nRifle Club To Hold First<br />\nMeeting In November<br />\nThe '36 edition of the R.O.T.C. made<br />\nits official debut last Tuesday with the<br />\nfirst drill of the new season. With enthusiasm running high among the men<br />\nand ifficers the unit has in prospect<br />\nanother fine year.<br />\nThe rifle club which is sponsored<br />\nby the organization but open to all students will have its first meeting about<br />\nNovember 1st. The club makes use of<br />\nthe North Loft of Gilman Hall for its<br />\npractices.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br />\n<br />\n2<br />\nuate activities. There is little to be<br />\n<br />\nObe jobrai Appkinfi said here beyond the mere fact that On The Literary<br />\nthe Administration has been forced to<br />\n<br />\n00 K<br />\nREVIEW<br />\n<br />\n:-: LETTERS TO THE EDITOR :-:<br />\n<br />\nHorizon<br />\n<br />\nA WARNING FROM HOPKINS ACE ability to beat the next fellow to<br />\nthe bread and butter—it includes<br />\nLIBERAL-IL DUCE<br />\ncial aid to the Hullabaloo, and what<br />\nTo the Editor of the \"News-Letter\"— religion, social adaptation, a long<br />\nAfter The New Deal, What?<br />\nbook<br />\nMarion<br />\nnew<br />\nRawson's<br />\nNichol'<br />\nlittle is offered the staff of the yearSir:<br />\nBy<br />\nNorman Thomas. New York:<br />\nrace,<br />\nthe<br />\nview<br />\nof<br />\nhuman<br />\n(and<br />\nbroad)<br />\nare<br />\nDuttons<br />\nHandwrought Ancestors,<br />\nbook is too small to risk the financial<br />\nNow the time has come to warn the and the answer to the questions,<br />\nThe MacMillan Co. $2.00<br />\npublishing October 9th. Mrs. Rawson<br />\n$2.00<br />\nbankruptcies of the past few years.<br />\nSubscription per year<br />\nfreshmen and other men of the campus where are we going, where should we<br />\nhas made early American lifer her<br />\n$2.50<br />\nBy Mail<br />\nNorman Thomas, by virtue of his<br />\nThere was only one solution possiagainst the Red Peril. Don't let our be going, and how can we get there.<br />\nfield and Handwrought Anspecial<br />\nselfless<br />\ncourage and his personal infamous University become another<br />\nRemit subscription fees to Treasur- ble—the placing of the yearbook on a<br />\nThe relation of technique and of<br />\nher sixth book dealing with \"Little Red Schoolhouse.\" A certain<br />\nis<br />\ncestors<br />\ntegrity, has won the admiration of<br />\ner, Student Activities Council, Rem- subscription basis, with of course,<br />\nscientific thought to these vital quespen Hall, Postoffice, Johns Hopkins higher rates for seniors than for other her adventures into the American bushy-headed group on the campus<br />\na great many Americans. This, howtions could be sharply pointed by<br />\npast. Mrs. Rawson spent the Summer will so try to distort the facts to<br />\nUniversity.<br />\never does not affect the absolute<br />\nundergraduates because each senior<br />\nand around choosing a topic where such relaclassrom<br />\nthe<br />\nin<br />\nyou,<br />\nboth<br />\nin New Hampshire, gathering mateworth of his pronouncements.<br />\nthat<br />\nindicating<br />\nby<br />\nand<br />\nin,<br />\nenter<br />\ntions<br />\nin<br />\nthe<br />\nhave<br />\nan<br />\npicture<br />\nwill<br />\nindividual<br />\nare<br />\nThe<br />\nCommunists<br />\ncampus.<br />\nDethe<br />\nEntered as second-class matter<br />\nrial for her next book, which she says,<br />\nAfter The New Deal, What? was<br />\nno longer a group holding smoking the development of these relations<br />\ncember 3, 1909, at the Postoffice in book.<br />\nhas to do with \"local town history.\" bombs, but are glib-tongued experts will be the primary consideration in written by the Socialist Party perBaltimore, Md., under the Act of ConBy refusing the paltry sum at the<br />\nP\"Like a bird,\" she writes, \"I seem to in converting you to their false and judging the papers. The topics of ennial, not as a mere campaign docgress, November 3, 1879.<br />\ndisposal of the University, the Hullathe last couple of years are, in the<br />\nhave just two trails in life these days, dangerous doctrines.<br />\nument—something to be discarded<br />\nPublished semi-weekly from Octo- baloo is more certain of sound finanis synonymous with writer's opinion, quite sterile in this<br />\nCommunism<br />\nber to June, except during examina- cial grounding since it will receive one South in the Fall and one North world revolution, and seeks the de- respect. Moreover, the choice of a the second wek of November—but<br />\nin the Spring. However, this at least struction of all nations, including topic such that advanced and speci- as a book whose major contentions<br />\ntion and college holiday periods by<br />\nmore money per student and consebelieves will be valid<br />\nundergraduates of the Johns Hopkins<br />\ngives me variety.\"...<br />\nabolition of patriotism, religion, mar- alized training is required for any the author<br />\nquently more money per book. By dielected and for the years<br />\nis<br />\nwhoever<br />\nUniversity.<br />\nwill<br />\ntreatment,<br />\nintelligent<br />\nreasonably<br />\nproperty<br />\nprivate<br />\nfamily,<br />\nthe<br />\nCzechoa<br />\nriage,<br />\nis<br />\nDr. Jaroslav Durych<br />\nvorcing itself from any connection<br />\nbe equally sterile in respect to the vital and timely one, handling in the<br />\nslovakian surgeon, fifty years old, and all political and civil liberties,<br />\nEDITORIAL STAFF<br />\nwith senior dues, the HuPabaloo<br />\nbenefit to be derived by the students quiet, sincere, and effective Thomas<br />\nworlda<br />\nof<br />\nand the establishment<br />\nEditor-in-Chief avoids the all-too-common danger of wilose main interest in life, outside his wide dictatorship of the so-called in pursuing the subject. In the ma- ahead. Nevertheless, the book is a<br />\nWilliam Diamond<br />\nStanley Finkel<br />\nAssociate Editor<br />\nprofession, he says is his work for proletariat, which is an autocratic jority of cases the inevitable result fashion, the story of the present nabeing forced into bailing June Week<br />\nJames Morrow, David Caplan<br />\n\"rehabilitation of Catholicism in small group of self-perpetuating rev- of such a choice is that the student tional administration, the devolopemManaging Editors out of debt to its own financial<br />\nwades through a mass of material merit of American fascism and its<br />\nthe Czechoslovakian Republic.\" Dr. olutionists.<br />\nSports Editor barrassment. And at the same time<br />\nBernard D. Pinck<br />\nmore or less unintelligible to him, probable crystallization after the New<br />\nfound<br />\ncommittee<br />\nA<br />\nCongressional<br />\nDurych now comes forwar with a<br />\na<br />\nBenjamin Root<br />\nit means a substantial economy to<br />\nthat fully ninety per cent of the act- and proceeds to regurgitate the same Deal ,the counter devolopment of<br />\nAssistant Managing Editor those seniors who are interested only moving and colorful historical novel ivities of the American Civil Liber- (sometimes in identical phraseology), farmer-labor party of progresives and<br />\nbuilt around the story of the Thirty ties Union are on behalf of Com- sandwiched in between an Introduc- radicals, his quarrel with the CommunArnold Glantz, Harold Zheutlin<br />\nin the Hullabaloo.<br />\nAssistant Sports Editors<br />\nYears War, which he calls \"The De- munists. Its leader, Roger N. Bald- tion and a Conclusion, and followed ists, and his announcement that the<br />\nMuch of the Senior protest has<br />\ncapitalism<br />\nIsadore Gertman, Wethered Barroll<br />\nwin, told a Congressional committee by an imposing bibliography. Far issue in this campaign is<br />\nscent of the Idol.\"<br />\nsocialism.<br />\nor<br />\nNews Editors come from the Engineering School.<br />\nis<br />\nhe<br />\ninwits,<br />\nhis<br />\nsharpening<br />\nfrom<br />\nDuttons announce it for publication it upholds the rights of Americans<br />\nMr. Thomas makes his first big<br />\nReporters—Sigmund Safier, Max Is- In view of the fact that the 1937 yearor aliens to advocate force or vio- troduced to the pernicious practice<br />\nkowitz, Nathaniel Finkelstein, Jew- book is to be dedicated to the Engin- October 19th. The doctor has made lence for the overthrow of the Gov- of trying to say nothing at sufficient mistake when he assumes that it is<br />\nWallenstein, conquerer of Gustavus ernment.<br />\nett Goldsmith, Howard Reizenstein,<br />\nlength to make it appear that he has a matter of indifference which of two<br />\neering School in commemoration of<br />\nJulian Adler, Carl Rasin, Floyd<br />\nthis<br />\na great deal. Inertia, sloppy capitalist candidates is elected. To my<br />\nin<br />\nsaid<br />\nfigure<br />\nAdolphus, his central<br />\nLet us keep America from becoman attitude<br />\nKatske, Malcolm Boshnack, Leonard its 25th anniversary, such<br />\nand scientific (?) hypoc- mind, our system of capitalist econthinking,<br />\nwith<br />\nCommunDown<br />\ning<br />\nsovietized!<br />\nnestirring novel; but he has not<br />\nRubinger, Morris Wessel, Arthur is hardly understandable. Forgetting<br />\nrisy follow, by the well-known prin- omy is not so narrow that all its supglected the minor prelates and princes ism and the beguiling Reds!<br />\nKatz, Martin Krieger, Lester Rosen- the three main reasons for subscriphuman, will follow the path of least porters form a single homogenous<br />\nDuce<br />\nGrahame<br />\n—Gordon<br />\nand their innumerable intrigues, nor<br />\nthal, Sidney Baum.<br />\nresistance, if given the slightest en- mass.<br />\ntions this year, it seems that at least<br />\nSecondly, Mr. Thomas' differences<br />\nthe romance of George and Angela<br />\nBUSINESS STAFF<br />\ncouragement.<br />\nPROTESTS SENIOR ESSAY<br />\nevery Engineer ought to be on the<br />\nWilliam B. Kempton....<br />\nParticularly in the case of pre- with the Communist Party, to the<br />\nwhich stands out in vivid contrast to To the Editor of the \"News-Letter\"-Business Manager subscription list.<br />\nmedical students should there be an expression of which he devotes disthe religious fanaticism which is his Sir:<br />\nMelville Locker<br />\neffort to introduce him to the prac- proportionate space, seem to me to<br />\nthe<br />\nof<br />\ntopic<br />\nthe<br />\nof<br />\nAnnouncement<br />\nbackground.<br />\nmore than quibbling<br />\nAssistant Business Manager<br />\nessay to be written by Seniors in tice of approaching problems inde- amount to little<br />\nEdward Garnett, who reported on<br />\nall the Left<br />\nWm. C. Erlanger<br />\nNatural Science for 1936-37 seems pendently, under his own power. that tends to discredit<br />\ntnis book for E. P. Dutton and Com- to call for undergradute comment Spineless dependence upon textbook parties. It would seem more logical<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nGerald Willen<br />\npany, previous to publication, wrote through your columns. In the writ- dicta has often greased the way to for Mr. Thomas to brush aside these<br />\nnot often go<br />\ndoes<br />\nLETTER<br />\nTheNEws<br />\nlesser grievances, and form, with the<br />\nOffice Manager<br />\nHoward Linkoff<br />\nthat it belongs to the \"old-fashioned er's opinion such comment should failure (with its grim implications<br />\nCommunists, the trade-unionists, proout of its way to shower praise. But<br />\nsituations<br />\nin<br />\npractice)<br />\nmedical<br />\nNathaniel Soifer<br />\nin<br />\nsince,<br />\nClass of historical novel of romance have been forthcoming long<br />\nthe other<br />\nCopy and Filing Manager a brief digression from tradition is<br />\nand in view of its absence hereto- where a little independent mental gressive church groups, and<br />\n'and adventure which never reads dry,<br />\nthe<br />\nAmerica,<br />\nin<br />\nforces<br />\nprogressive<br />\nclear<br />\nassured<br />\nhave<br />\nwould<br />\narithmetic<br />\nfore, he believes it his duty to pronow in order.<br />\nFarmer-Labor Party which he advobut perennially crops up every few vide some sort of student expression sailing.<br />\n1936<br />\nMember<br />\n1937<br />\nThe Alumni Memorial Hall is en(Continued on page 3, col. 5)<br />\nI do not believe that this is irrelyears. It may be likened to Sionke- in regard to the choice of topics and<br />\ntering its New Deal period. When the<br />\nbe<br />\ncan<br />\nThere<br />\nquestion.<br />\nour<br />\nto<br />\nevant<br />\nthereby<br />\nattitude,<br />\npedagogic<br />\nthe<br />\nand<br />\nwicz's Fire and Sword and other PoDistributors of<br />\nDormitory Activities Committee was<br />\nare in charge no doubt that the habits and attilish historical romances,\" said Mr. indicated, of those who<br />\ntude instilled in a student in the<br />\nformed late last year, optimism ran<br />\nof this matter.<br />\nGarnett, \"which has a big vogue and<br />\nThe writing of such a paper pro- course of his college training will be<br />\nhigh; after the first dance held in the<br />\na oig sale thirty years ago.\"<br />\nTuesday, October 13, 1936<br />\nvides a powerful tool with which to the almost exclusive determining inCommons Room and after the first<br />\nLiterary vogues have a way of stimulate in the students a certain fluence on the grade of his future<br />\nlectures sponsored by the group, plans<br />\nusefulness<br />\n'coming and going, like the seasons; amount of original thought; and work, and hence on his<br />\nfor the future abounded. But that an<br />\nto the community. The comprehenaccomtopic,<br />\nthe<br />\nof<br />\nchoice<br />\nproper<br />\niowever the historical novel is back<br />\nextensive program—including lectures,<br />\npanied by the proper attitude on the sive paper is a vital part of the UniThe plight of the Hullabaloo reagain and Duttons believe that \"The<br />\nof those directing the students, versity training, or should be so,<br />\npart<br />\nchess and ping-pong tournaments,<br />\nquires an explanation. Much of the<br />\nDescent of the Idol\" has all of these could provide opportunity for more and is to be regarded as such by facdances, after-dinner speeches, Sunday<br />\nmisunderstanding that has arisen,<br />\n'attributes which will make it appeal genuine education than several years ulty and undergraduates alike. It<br />\nafternoon musicales, and athletic<br />\nupon the stuparticularly between the Senior Class<br />\nto large masses of readers in this of formal classroom instruction. should not be forced<br />\nnecessary, but<br />\na<br />\nof<br />\nform<br />\nthe<br />\nin<br />\ntournaments--should be drawn up and country.<br />\ndent<br />\nterm<br />\nthe<br />\nby<br />\nis<br />\n(What<br />\nmeant here<br />\nand the staff of the yearbook, comes<br />\nThe<br />\nunpleasant, formality. It<br />\nhighly<br />\nI<br />\nbefore<br />\nwill<br />\nbe<br />\n'proper'<br />\napparent<br />\nset into motion within less than two<br />\nThomas<br />\nfrom<br />\nletter<br />\na<br />\nThey report<br />\nhoney Ii<br />\nfrom a genuine ignorance of the facts<br />\nto<br />\nsevaddressed<br />\ncarefully<br />\nbe<br />\nshould<br />\nhave<br />\nUniversities<br />\nthe briar<br />\nweeks was more than anyone could Mann to the author in which Mr. have finished.)<br />\nrather than from a difference of<br />\neral aims: namely, to put point to<br />\nkeeps the pipe<br />\nMann said that he considers Dr. been accused of failing to show the<br />\nhave forseen.<br />\nsweet.<br />\nthe lecture room; to synthesize the<br />\nopinion.<br />\n'Durych's book a \"wonderful achieve- students a connection between their<br />\n'09h-efficiency'<br />\nBernie Pinck and his Activities<br />\nto relate<br />\nthere;<br />\nrequired<br />\nmaterial<br />\nbefore<br />\nlies<br />\nwhich<br />\njob<br />\nthe<br />\nand<br />\nstudies<br />\nLast year the Senior Class of the<br />\nment. I have not read,\" he says, \"a<br />\nCondensor cleans,pufitles<br />\nCommittee deserve the congratula- historical novel with such rapt atten- them after graduation. It is claimed the same to life; to stimulate original<br />\nsmoke.Traps moisture. NoclogUniversity was forced to use funds<br />\nsing. No trouble.Prove it yourseat<br />\ntions and support of the entire student tion. As fare as the portrayal of the that seclusion renders them unequal thinking and reflection upon this rebelonging to the Hullabaloo as collation.<br />\nreto<br />\nwell<br />\nis<br />\nit<br />\nand<br />\noutside:<br />\nlife<br />\nto<br />\nit<br />\nin<br />\n'battle of Luetzen is concerned,<br />\nbody, and particularly of the men<br />\n—\"Senior\"<br />\nlateral capital for June Week. The<br />\nbeems to me to be on the same level member that life includes more than<br />\nthe dormitory.<br />\nJune Week committee went heavily<br />\nWith Tolstoy; but, even apart from<br />\n<br />\nPritni<br />\n<br />\nletter<br />\n<br />\nwithdraw practically all of its finan-<br />\n<br />\nOrchids<br />\n<br />\nRssocialed Colleeiate Press<br />\n<br />\nGDileelicde DieSest<br />\n<br />\nNeeded Explanation<br />\n<br />\n\"At Your Dealer\"<br />\n<br />\nCampus News<br />\n<br />\nInto debt—to the tune of several hun-<br />\n<br />\nthat, what a glowing ardour and richness and colour! I firmly believe that<br />\nthe name of Jaroslav Durych will bewere used to clear up the deficit. The<br />\ntome famous throughout the world.\"<br />\nyearbook itself was thus forced into<br />\nWilliam Wash Williams, whose porLast Spring Columbia University<br />\nthe red, and the University had to<br />\nof 0. Henry, The Quiet Lodger of<br />\ntrait<br />\naccepted an invitation to attend HeidIrving Place, Duttons announce for<br />\ncover the debts.<br />\nelberg's ciPuincentenary celebrations<br />\npulication October 14th, was the man<br />\nThis was not the first time such<br />\nin Germany. Students protested and 'who first brought 0. Henry and the<br />\na situation had occurred. Rightfully<br />\nheld demonstrations on the Campus Old New York World together. In his<br />\nindignant, the University Administrabook Mr. Williams tells the story of<br />\nand at Presidents Butler's home.<br />\ntion has refused to pay any future<br />\nmeeting with 0. Henry when he<br />\nthis<br />\nColumbia's<br />\nof<br />\none<br />\nRobert Burke,<br />\ndebts for the Hullabaloo. The yearWas sent out by the Sunday Editor of<br />\nwas<br />\nmost prominent undergraduates,<br />\nthe World to get his man.<br />\nbook is thus faced with the necessity<br />\none of the leaders of the protest. The<br />\n\"When 0. Henry came to New<br />\nof balancing its budget both theoretiUniversity Administration expelled 'York,\" he says, \"I was a cub reporter<br />\ncally and actually.<br />\nBurke for his participation in the on the Sunday World, accepting small<br />\nAnother factor was taken into conbeing of tremendous<br />\ndemonstration. Court action has been (assignments as<br />\nsideration by the yearbook manageimportance, running my legs off after<br />\ntaken. September 29 saw the mobilithipmunks and rabbits, which, in my<br />\nment before it decided to put the book<br />\nzation of the entire Campus in an mind, assumed the proportions of<br />\npast<br />\nDuring<br />\nupon a subscription basis.<br />\neffort to secure Burke's reinstate- lions and tigers and elephants in the<br />\nyears, Senior Class dues have been<br />\njungle of feature news, an writing<br />\nment.<br />\nalmost prohibitive for quite a large<br />\nonce<br />\nMeanwhile Columbia University is about it all in a style described<br />\nnumber of the class. These dues have<br />\nby a young lady copy reader as 'quintsilent and Burke is collegeless because<br />\nly impossible.' .. . Nelson Hersh,\" he<br />\nbeen divided between the Hullabaloo<br />\nhe expressed an opinion.<br />\nsays, \"who was then editor of the<br />\nand June Week. There were many—<br />\nSeveral weeks ago, Don Ellinger, Sunday World, sent for me to come<br />\nand there always will be many—to<br />\na senior at Washington University into the little cubbyhole he called his<br />\nwhom June Week offers no excite(St. Louis) wrote letters to freshmen bffice.<br />\nwas<br />\ninterest<br />\nment—whose only<br />\n'Williams,' he began, when I arentering the University in which he<br />\nrived alongside of the big desk, 'there's<br />\nin the Hullabaloo.<br />\nactivities of the some fellow who signs his stuff 0.<br />\nthe<br />\nattacked<br />\nThese men are faced with the probwas a holder of a Henry, writing for the magazines and<br />\nHe<br />\nC.<br />\nT.<br />\n0.<br />\nR.<br />\nlem of whether or not to pay their<br />\nof his tuition. I want to get hold of him. 0. Henry<br />\nhalf<br />\nfor<br />\nscholarship<br />\nget<br />\nthey<br />\ndues,<br />\ntheir<br />\ndues. If they pay<br />\napproximately half its value in re- When his letters were called to the at- is evidently a pen-name and I have<br />\nturn, since they have no intention of tention of the university administra- made a few little passes over the<br />\nphone in an effort to get a line on<br />\ncapitalizing on their June Week privtion, his scholarship was withdrawn. him, as to who he is and where he is,<br />\nileges. And not many undergraduates<br />\nPhillip Monypenny, a graduate but haven't anything that will give<br />\ncan afford to throw away eight or nine<br />\ndollars, even for sentimental reasons. school student at the same university, 'you a lead. He may be here in New<br />\nThe alternative is not to pay any dues circulated letters among all freshmen York, or he may be in Oshkosh mailI want<br />\nat all. But in that case there will be no saying that only \"suckers\" would en- ing his stuff in, but, anyway,<br />\nNew<br />\nin<br />\nis<br />\nhe<br />\nif<br />\nand<br />\nup,<br />\nhim<br />\ndig<br />\nto<br />\nyou<br />\npicture in the Hullabaloo.<br />\nroll in the R. 0. T. C. His $100 schol- York, get him down here where I<br />\nis,<br />\nsituation<br />\nthe<br />\nin<br />\nfactor<br />\nThe third<br />\narship has been withdrawn, it was an- tan have a talk with him.\"<br />\nof course, the University's forced re(Continued on page 3, col. 1)<br />\ntrenchment in the field of undergrad- nounced Saturday by the university.<br />\n<br />\ndred dollars, and the Hullabaloo funds<br />\n<br />\nFree Speech<br />\n<br />\nIn/<br />\ni<br />\n<br />\nBIGGER AND BETTER TURBINES<br />\nrirHE new 110,000-kilowatt turbine-generator,<br />\nbuilt by General Electric and recently<br />\nplaced in service in the River Rouge plant of<br />\nthe Ford Motor Company, sets several new<br />\nrecords in turbine construction.<br />\nIt is the first large unit in the world to operate<br />\nat 1200 pounds pressure and at 900 Fahrenheit.<br />\nAlthough weighing approximately 2,000,000<br />\npounds, it occupies less than a cubic foot for<br />\neach kilowatt of output. Because of its extremely high efficiency, less than a pound of<br />\ncoal generates a kilowatt-hour.<br />\nThe high-pressure turbine and generator are<br />\nmounted directly above the low-pressure unit.<br />\nSuperheated steam enters the upper unit at 12<br />\npounds and 900 degrees and, after producing<br />\n55,000 kilowatts, flows directly into the lowpressure unit where it produces another 55,000<br />\nkilowatts. This is the first 1200-pound turbine<br />\nin which the steam enters the low-pressure<br />\nstage without reheating.<br />\nCOFFIN FELLOWSHIPS<br />\nHIS fall eight young men will be carrying<br />\non advanced research in seven American<br />\nuniversities under fellowship grants from the<br />\nCharles A. Coffin Foundation. The recipients:<br />\nGeorge E. Boyd, U. of Chicago '33. At<br />\nChicago.<br />\nLyman R. Fink, U. of California '33. At<br />\nCalifornia. Second grant of fellowship.<br />\nAlvin II. Howell, U. of Kansas '29. At<br />\nM.I.T.<br />\nRussell A. Nielsen, Stanford '33. At Stanford.<br />\n<br />\nT<br />\n<br />\nRichard W. Porter, U. of Kansas '34. At<br />\nYale. Second grant.<br />\nJulian S. Schwinger, Columbia '36. At<br />\nColumbia.<br />\nChauncey Starr, R.P.I. '32. At Harvard.<br />\nSecond grant.<br />\nHarold G. Vogt, U. of Buffalo '31. At<br />\nHarvard.<br />\nSince 1922,when the General Electric Company<br />\nestablished the Charles A. Coffin Foundation in<br />\nhonor of the Company's first president, 113<br />\nfellowships have been awarded for advanced<br />\nwork in electricity, physics, and physical<br />\nchemistry.<br />\n<br />\nELECTRIC HEAT FOR SOILLESS<br />\nGARDENS<br />\nCALIFORNIA nurserymen are growing<br />\ntomatoes, strawberries, and sweet peas in<br />\nchemically treated water heated by electricity.<br />\nThe method, developed by Dr. W. F. Gericke,<br />\nof the University of California, has been extended to commercial installations. Tomato<br />\nplants, grown in this way, produced unusually<br />\nhigh-quality tomatoes. The yield was large, and<br />\nthey matured ahead of tomatoes grown in<br />\nsoil.<br />\nNourishment is provided by special chemicals<br />\ndissolved in the water. Because the water temperature must be accurately maintained, a controllable heat source is required, and General<br />\nElectric engineers have supplied heating cable<br />\nand thermostats both for the experimental<br />\ninstallation and for commercial installations<br />\nwhich have followed.<br />\n<br />\nGENERAL&ELECT<br />\n_ RIC<br />\n`1111/<br />\n<br />\n•NI<br />\n<br />\n\"Mir'<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br />\n<br />\nGrid Captain<br />\nNamed Head<br />\nOf A. A. Board<br />\nhis<br />\nInof<br />\nowlute<br />\nwas<br />\nperoc•ded<br />\nbut<br />\nions<br />\nalid<br />\n.ars<br />\nthe<br />\nin as<br />\ns a<br />\nnalopits<br />\new<br />\n)f a<br />\nand<br />\nunthe<br />\nism<br />\nbig<br />\nt is<br />\ntwo<br />\nmy<br />\nonupious<br />\n<br />\nces<br />\nthe<br />\ndisto<br />\nling<br />\n',eft<br />\nical<br />\nese<br />\nthe<br />\nprotiler<br />\nthe<br />\nvo-<br />\n<br />\nGraziano Elected At Thursday Meeting Of Campus<br />\nGroup<br />\n<br />\nThe class of 1931 will have its<br />\nreunion on October 17, Saturday.<br />\nThe occasion ill be celebrated by a<br />\nparty in the Barn, with beer provided for the ttending members.<br />\nTwonsend Parks, '31, is in charge<br />\nof festivities, and promises a swell<br />\ntime to all those who can attend<br />\nthe reunion.<br />\n<br />\nBUILD UP ATHLETICS<br />\n<br />\nZierler Addresses<br />\nCooperation Of A. A. With<br />\nStudent Union's<br />\nHeads Of Sport<br />\nIncreasing Activity<br />\nOpening Meeting<br />\nAt the meeting of the Athletic Asso-<br />\n<br />\nciation Board held last week, Theodore<br />\nGraziano, captain of the football team,<br />\nwas elected president of the Board of<br />\nGovernors. Other men elected to the<br />\nBoard were Brian Murphy, football<br />\nmanager, secretary-treasurer; Anthony DiPaula, track manager; Pete<br />\nBernheim, soccer captain; and Bill<br />\nMcFeeley as the three members at<br />\nlarge.<br />\nThe Athletic Association Board<br />\nconsisting of the captain and managers of all major sports and one representative from each minor sport<br />\nset up a Board of Governors at the<br />\nbeginning of last year.<br />\nThe reason for cutting down the<br />\nsize of the governing body of the<br />\nAssociation was to assure a more flexible group in which matters may be<br />\ndiscussed more thoroughly than is<br />\npossible with the entire organization<br />\nof eighteen or twenty men. The A.A.<br />\nBoard, however, is still called upon for<br />\nadvice if the situation warrants such.<br />\n<br />\n:-: LETTERS TO THE EDITOR :-:<br />\n<br />\nClass of 1931 To<br />\nHold Reunion Saturday<br />\n<br />\nOutlines Plans For Hopkins<br />\nBranch; Plans Political<br />\nTalks On Campus<br />\n<br />\nNOTES INACCURACIES IN<br />\n<br />\nminimum wage law in 1925, Mr. Lan-<br />\n<br />\nPOLITICAL ARGUMENTS<br />\n<br />\ndon has made no attempt to \"ofrce\"<br />\n<br />\nTo the Editor of the \"News-Letter\"-- any substitute legislation. As a matter of fact, he has never even advo-<br />\n<br />\nSir:<br />\n<br />\nIn the article on the presidential cated it. Unfortunately, the Repubprinted in the \"News- licans cannot point to his silence on<br />\n<br />\ncampaign<br />\n<br />\nLetter\" last Friday under the title, this matter as proof of his devotion<br />\n\"The Man For Our Country,\" there to the spirit of the Constitution. For,<br />\nis a typical example of the omission he went to the wall with his legislaof part of the truth to emphasize a tre for a farm-moratorium act which<br />\nwas later the object of some rather<br />\npoint of doubtful verity.<br />\nSpeaking of President Roosevelt, pointed language during the course<br />\nthe article informs us that \" as Gov- of being thrown out the window by<br />\nernor, he inherited the richest of the the state Supreme Court.<br />\nI'm afraid that I, for one, can<br />\nforty-eight states from Al Smith with<br />\na substantial surplus in the treasury— place very little faith in Mr. Landon's<br />\nand left it with the largest debt New vaunted honesty after his recent<br />\nYork had ever had.\" Since there is no brush over the Administration's Sofurther mention of this matter in the cial Security Act. In the fact of critarticle, the direct implication of this icism of his position, the Governor<br />\n<br />\nsentence is that the chief cause of the<br />\nAt the first meeting of the Johns deficit was Governor Roosevelt. The<br />\nHopkins chapter of the American economic condition of America at the<br />\nStudent Union, Kenneth Zierler, re- time is serenely ignored in favor of<br />\n<br />\ncited an unpublished report of the<br />\nTwentieth Century Fund prepared by<br />\n\"some of the most competent men<br />\n<br />\nin the country in this field.\" The<br />\ntiring chairman, started his belief that placing all the blame on the man who Twentieth Century Fund,\" he added,<br />\nthe winter would see the need for an held the governorship.<br />\n\"is a subsidiary of the 'Filene Found-<br />\n<br />\nGraduate Committee ReReception Opens Season<br />\nThe Graduate Student Committee inaugurated its 1936-'37 season<br />\nlast Friday, with a reception<br />\nwhich featured a talk by Dean<br />\nEdward W. Berry, of the College<br />\nof Arts and Sciences and a short<br />\nmusical program.<br />\nIt was announced that $2740.00<br />\nhas been collected in the graduate<br />\ncampaign for the University Fund.<br />\nMr. Richard Boys, a graduate<br />\nstudent in the Department of English has been elected chairman of<br />\nthe Graduate Student Committee.<br />\n<br />\nCivil Engineering<br />\nFaculty Serves On<br />\nNational Projects<br />\nProfessor Thompson Draws<br />\nUp Report On Regulation Of Autos<br />\n<br />\nAlumni To Hold<br />\nBanquet In New<br />\nYork Friday Eve<br />\nDr. Bowman Scheduled As<br />\nPrincipal Speaker<br />\nFor Occasion<br />\nRECEPTION TO FOLLOW<br />\nSchweitzer, Head, Hhas Revived Eastern Alumni<br />\nGroup<br />\n(Continued from page 1, col. 6)<br />\nthe purposes of the campaign have<br />\nbeen active in preparing for the banquet. The chairman of the banquet<br />\ncommittee is W. Nelson Young; Allan<br />\nM. Mleaveland is vice chairman. Members of the advisory board of the campaign will serve as reception committee of the banquet. They are:<br />\n<br />\nDuring the past summer, several<br />\nChanning E. Sweitzer, chairman;<br />\nWhen Al Smith left office in 1928 ation,' which had witheld publication members of the Faculty of the Civil Clarence M. •Guggenheimer, Edmund<br />\ndom on the campus, as well as a new the United States was reaching the because of the effect on the Roose- Engineering Department of the Johns C. Lynch, Dorsey Richardson, coand larger strike against war on the climax of a period of extraordinary ec- velt campaign. The Nation of Oct- Hopkins Engineering College were chairmen.<br />\npart of the students.<br />\nonomic prosperity and credit expan- ober 10th sums up its conclusions employed in numerous important unOliver F. Allen, Edward M. Armdertakings of both local and national strong, John R. Bartels, George S.<br />\nIn his talk outlining the past his- sion. State revenues had, for several thus:<br />\n\"Unfortunately for Mr. Landon it nature.<br />\ntory and future plans of this nation- years, been abnormally large, and the<br />\nBrown, Milton S. Erlanger, Sidney C.<br />\n<br />\norganized defence of academic free-<br />\n<br />\nwide organization, Zierler, the re- creation of a treasury surplus was no soon developed that (1) there is no<br />\ntiring chairman, addressed a small difficult task. One year after Roose- 'Filene Foundation'; (2) the docugathering of prospective and former velt became Governor of New York, ment was not a report of the Commembers, on the five principle aims America was prostrated by a business mittee on Old Age Security, but a<br />\nof this group, summed up as, peace, depression famous for its severity. preliminary report prepared by a<br />\n<br />\nProfessor J. Trueman Thompson Erlanger, John H. Finley, Simon Flexwas engaged in drawing up a set of nr, Fabrian Franklin, Walter S. Gifregulations controlling the manufac- ford, John M. Glenn, J. W. Griffin,<br />\nture of commercial motor vehicles. Henry Lanahan, James B. Rather, G.<br />\nHis report will be submitted in De- Canby Robinson, Albert Shaw, Charl<br />\n<br />\nand State revenues along with private in- member of the research staff . . . cember to the Highway Transport S. Stern, Leo Wolman.<br />\nThe general banquet committee inequality. In addition, he discussed the comes had shrunk to a fraction of yet to be considered by the commit- Committee of the American AssociaImportant matters recently dis- specific nature of this program on the their previous amounts, while the de- tee; (3) a draft of the report had tion of Sate Highway Officials. This cludes all members of the campaign<br />\ncussed were the exact duties of the<br />\ncampus. These would include aolition mand for state aid to the sudden host been given Landon with instructions report is the outgrowth of a similar executive committee as follows:<br />\nmanager, the revision of the constituSidney Adler, George Armstrong,<br />\nof the R. 0. T. C. as an organization of jobless increased hugely. It is no that it was to be considered confi- set of regulations which were pretion, and the necessary requirements<br />\ndential . . . and (4) Governor Lan- sented to the Society of Automotive Jr., John R. Bartels, Raphael A. BenRoosevelt<br />\nmore<br />\nsensible<br />\ndescribe<br />\nto<br />\nfavoring<br />\nand<br />\nattitude<br />\nmilitary<br />\nthe<br />\nfor an award in each sport.<br />\ndon's conclusion are diametrically op- Engineers in a paper entitled \"Leg- dove, Edward C. Billheimer, Walter<br />\nAs a result of the cooperation of the doctrine of preparedness, and the as the chief reason for the existence<br />\nBrecher, Frank G. Breyer, Willard<br />\nA. A. Board with those in charge of whole-hearted acceptance of the Ox- of a deficit in New York State than posed to those contained in the doc- islative Regulations of Motor Vehi- Brown, Carl W. Buchheister, George<br />\nathletics here at the Hopkins, the ath- ford pledge, with the student body it is to blame Hoover for the stock ument he released to the press.<br />\ncles\", compiled by Thomas H. Mac- S. Cattanach, George E. Chinn, Allan<br />\nletic program has been built up<br />\nOn<br />\nthe<br />\nethics<br />\nof<br />\ngiving<br />\nout<br />\na<br />\nconDonald, Chief of the United States M. Cleaveland, Edith S. Currier, Edmarket<br />\ncrash.<br />\nrefusing support to the country in any<br />\ngreatly. They have given every stufidential<br />\nreport<br />\nlittle<br />\nneed<br />\nbe,<br />\nsaid.<br />\nBureau of Public Roads; and Professor ward D. Crouch, Don S. Colt, Jr.,<br />\nnegligence<br />\n.<br />\nward<br />\nto<br />\nobvious<br />\nSuch<br />\ndent a chance to participate in some aggressive war.<br />\nCharles E. Dean,<br />\nIt<br />\nappears<br />\nobvious<br />\nthat<br />\na<br />\nman<br />\nwho<br />\nThompson<br />\nabcase<br />\nanother<br />\nof<br />\nof Johns Hopkins.<br />\nis<br />\nfacts<br />\npertinent<br />\nAs a part of the program to supsport of recreational and healthful<br />\nA. Herbert Fedder, M. Harry FeldThe present regulations involve im- man,<br />\nsport, either varsity or intra-mural. port free academic speech for teachers surd campaign propaganda which may would 'violate a confidence merely beFrank R. Ferlaino, Edward M.<br />\nThe University now has the follow- and school publications, the Union give a serious presidential contest the cause it seemed to further his polit- portant safety features of motor ve- Finesilver, Theodore G. Fischer, Benical ambitions is unworthy of the of- hicle operation which will help to jamin Fleisher, Ernest R. Fleisher,<br />\ning sports putting teams in recog- was determined to prevent any thrott- appearance of a political squabble.<br />\nnized<br />\nintercollegiate<br />\ncompetition: ling of the NEWS LETTER, or of stuI did not intend to criticize unduly fice to which Mr. Landon aspires.\" make commercial vehicle operation Fabius S. Fox, Henry W. Frey, Philfootball lacrosse, basketball, track,<br />\nAs an evidence of spiritual bank- much safer than it is now. In order 'more W. Geoghegan, Dal Ghent, Malthrough state bills either the author of the article from<br />\ntennis, baseball, wrestling, handball, dents and teachers,<br />\ncolm R. Gilpin, Jr., John M. Glenn,<br />\nruptcy,<br />\nthe whole matter is rec- to arrive at definite conclusions, it<br />\nwhich I have quoted or the sources<br />\ngolf, fencing, swimming, cross coun- for teacher's oaths. A program of edEugene W. Greenfield, Morton Gutkin,<br />\ncommended to the attention of in- was necessary for Professor Thomptry, soccer, and rifle.<br />\nucation rofthe students at Hopkins of his information, for, Lord knows,<br />\nDavid Gutman, Robert E. Heyn, G.<br />\nterested moral philosophers.<br />\nson and his staff to make, during the Warfield Hobbs, III, Bernard J. Hoffwas outlined, to bring before them both major parties are equally guilty<br />\nWhat's more I'm still pretty dis- summer, a numer of studies and tests man, Jr., Norman N. Holland, Albert<br />\ndescribe the needs of this type of misleading argument.<br />\nwould<br />\nwho<br />\nmen<br />\nHedgerow Players Feature<br />\nsatisfied with Mr. Landon's labor of the actual operation of motor trucks P. Johnson, J. David Jutkowitz, Wilfor youth action and organization in But for partially nullifying the force<br />\nPlayshop Season Here the orld today. The American Youth of so competent a defense of his presi- stand. As an oil operator he con- and busses on several of the most im- liam R. Kahl, Morris R. Keen, Josef A.<br />\nKindwall.<br />\nsistently maintained the open shop— portant trunk highways in the United<br />\nAct, which is now before Congress, dential choice, he deserves at least a<br />\nOverton H. Klinefelter, M. L. Kruler,<br />\n(Continued from page 1, col. 3)<br />\nIn June, the Kansas Federation of States.<br />\nBernhard Kurrelmeyer, Joseph Levy,<br />\nand a $1.00 evening seat to the Hedge- and provides for aid to students who few words of criticism.<br />\n,Professor Thomas F. Comber, Jr.,<br />\nLabor passed a resolution excoriatJohn C. Lewis, Jr., Lawrence Littrow players production.<br />\n—Sheldon Fuchs<br />\nare dnable to attend college, is conof the Civil Engineering Department,<br />\nman, James R. Lomauro, Thomas P.<br />\ning the Governor for calling out the<br />\nDr. Fagin has published the follow- sidered an integral part of these needs,<br />\nwas employed by the J. E. Greiner<br />\nMagill, J. Hammond Mallery, George<br />\ning announcement.<br />\nmilitia in the Lead and Zinc Workers Co., Consulting<br />\nEngineers of Balti- E. Marley,<br />\nand must e administered by youth<br />\nRobert L. McAll, James<br />\nstrike last year. It's a sorry showing more, as a designing engineer on an<br />\n\"The Playshop has undertaken this<br />\nMR. KEMPTON REPLIES<br />\nand men used to dealing with their<br />\nA. Mitchell, Edward K. Morrison, Alyear something which we feel BalTo the Editor of the \"News-Letter\": to put up against an administration important bridge for the State of Vir- bert M. Musgrove, Jr., Morris Myers,<br />\ntimore playgoers will appreciate. We problems. The present N.Y.A. organwhich was the first to recognize the ginia and also on the bridges and via- William F. Nickel, Jr., Philip E. NutSir:<br />\nare bringing to the Auditorium on ization was ismissed as inadequate,<br />\nducts of the Howard Street Extentle, Sidney Robbin, Joseph F. Rooney,<br />\nI would like to borrow this space right of labor to bargain collectively<br />\nNovember 18, the Hedgerow Theatre and not near enough to the actual<br />\nsion.<br />\nErnest H. Salter, Roger Shaw, Norto congratulate Mr. Fales on his through representatives of its own<br />\nfor two productions. At 4 o'clock on<br />\nMr. F. W. Medaugh, also of the Civil<br />\npulse of young peoples' problems.<br />\nman J. Small, Robert Tynes Smith,<br />\nthat day, the Hedgerow will present<br />\nsincere, balanced, completely honest choosing. Both sides of the present Engineering Department, was enfor<br />\ncampaign<br />\nDuring the coming<br />\nIII, Agnes Snyder, M.Edmund Speare,<br />\n\"The Emporer's New Clothes,\" a<br />\npresentation of the case for Alf AFOL-CIO struggle appreciate this gaged in preparing a code for the Ludwig A. Staib, Jr.<br />\ncharming play for children which the presidentian election, the Union<br />\nLandon. And let me assure him that stand. Men as diametrically opposed Maryland State Health Department<br />\nAlex A. Steinbach, John M. Stewart,<br />\nhas been packing them in as a has voted to sponsor an Assembly of<br />\nas Daniel Tobin and John Lewis are to govern tre design and construction Basil D. Storrs, Hyman Strauss, VerWPA project in New York City for the students on October twenty-sec- such praise is grudgingly given, for<br />\nof same.<br />\nnon E. Stuart, Charles L. Suttles,<br />\nin the forefront of the Roosevelt<br />\nthe past six months.<br />\nMr. Thomas F. Hubard, acted as<br />\nond„ in collaboration with the NEWS- I finished his article with the unChanning E. Sweitzer, Helen H. Tancampaign.<br />\ncomfortable sensation that all was<br />\nIn the evening of the same day, LETTER and the<br />\nAssociate Consultant to the National<br />\nY.M.C.A. At this aszer, Harry King Tootle, George G.<br />\nEven Landon's tax claims seem Resources Committee and under his<br />\nthe Hedgerow will offer \"Getting<br />\nnot<br />\nwell<br />\nwith<br />\nmy<br />\nown<br />\npoor<br />\neffort.<br />\nTrattner, Vladimir S. Veden, Mabel<br />\n'aembly, to be held in Latrobe Hall,<br />\nMarried,\" by George Bernard Shaw,<br />\nAs a matter of sober fact, I should pretty feeble after a little cold analy- supervision a Federal Statistical and L. Walker, Richard L. Waterfall,<br />\nspeakers<br />\nchosen<br />\nbe<br />\nfrom<br />\nwill<br />\nthe<br />\nthere<br />\nwhich the Media (Pa.) organization<br />\nsis. In the \"New Republic\" of June Research Project was conducted for<br />\nCharles E. Waters, Roxie A. Weber,<br />\nfeel pretty flat about the whole thing.<br />\nhas just revived with acclaim in its major parties in the fall elections.<br />\n10th, Morton Taylor write that dur- the Works Progress Administration.<br />\nLeo Wolman, Richard H. Woodward,<br />\nBut,<br />\nbefore<br />\nthe<br />\nproffered<br />\nsunflower<br />\nown little theatre. I believe this will<br />\ning his administration \"there was an<br />\nThe Civil Engineering Department<br />\nIt has been decided to send a repreChurch Yearley, John I Yellott,<br />\nJr.,<br />\nbe the first time the play will be sentative to the meetings of the Balti- is pressed to my shrinking bosom, I increase over the 1932 levy of 21 has had considerable increase in the<br />\nNelson Young.<br />\nJr.,<br />\nW.<br />\nseen in Baltimore, and I know it more 'Council of the American Youth feel called upon to submit some ad- percent for the first year, 28 percent number of graduate students attendIn addition to the speaking promarks the first appearance of the Congress this winter. The states of denda on the gentleman<br />\nfrom Kansas. for the second, and 31 percent for ing its courses. At the present time, gram, the banquet will include a busiHedgerow in the city.<br />\nthe third.\"<br />\ntwo important researches are under<br />\nMaryland, Virginia, Delamare, and<br />\nFirst there are several points to<br />\nness session at which officers for the<br />\n(Continued bottom col 3)<br />\nI hope Mr. Fales doesn't think it way. One has to do with the calibrathe District of Columbia are to send<br />\nensuing year will be elected. A reorsupport the contention that \"Mr.<br />\nunfair for me to introduce this mate- tion of orifces for measuring the flow<br />\ndelegates to a discussion of plans and<br />\nLandon is no coercer.\" I have in rial after previously resting my case. of water and the other with the inves- ganization of the Association, to effurther growth of the Youth Congress<br />\nfect a more complete representation<br />\nat a regional congress to be held in mind his record on civil service. Al- Still and all, I feel that it has some tgation of a new method of designing of alumni in the tri-state area, is<br />\nBaltimore, November 7 and 8, 1936. though there is a civil-service law degree of pertinence in the discus- and constructing deep foundations contemplated. The present officers,<br />\nTo interested students, an invitation on the statute books of Kansas, the sion. And, what's more, if he's in- for bridges.<br />\nbeside Mr. Sweitzer, are: Dr. John<br />\nterested, I have some cold figures on<br />\nto membership was extended, even to<br />\n(Continued from Page 2, Col. 3)<br />\nM. Glenn, vice-president; W. Nelson<br />\nGovernor has not seen fit to \"coerce\"<br />\nmy man, too.<br />\nMr. Williams found 0. Henry and those interested in only one of the the legislature into the appropriaYoung, secretary; Allan M. CleaveGratefully,<br />\nmajor<br />\nUnion.<br />\nStudent<br />\nthe<br />\nof<br />\nissues<br />\nland, treasurer.<br />\nfrom their meeting on the two betion of funds to support it. His enJ. M. Kempton<br />\nNational membership cards are to be<br />\n(Continued from Page 2, Col. 6)<br />\ntirely justified reluctance in this recame good friends. They were alike<br />\navailable shortly, and will be discates as the alternate choice to fasspect<br />\nalso<br />\nshows<br />\nup<br />\nin<br />\nhis<br />\nrecord<br />\nin many ways. Williams, like 0. tributed to those applyin. Dues are<br />\ncism after the New Deal.<br />\non wage legislation. Since the Kan- Sherwood Eddy To Give<br />\nHenry, so the story goes, could re- fifty cents a year, or one dollar, inthis is a book to be studsas Supreme Court voided the state<br />\nMovie Here Thursday Certainly,<br />\nmain \"richly mute for long spaces. clding all publications of the Ameried by those who are sincere in wantStudent Union at no extra cost.<br />\ning a complete picture of this very<br />\nTennyson and Carlyle had no more ican<br />\nThe Shaw play is part of a cele(Continued from Page 1, Col. 2)<br />\n(Continued from Page 1, Col. 4)<br />\nThe day and hour of the next meeting<br />\nbration signalizing the eightieth an- fished recently include \"The Challenge urgent presidential campaign. All and suggested that freshman memeloquently speechless intervals, than<br />\nannounced,<br />\nnot<br />\nsince<br />\nthere w s<br />\nwere<br />\nfair-minded students will want this<br />\nthese two men. Their friendship jog- too small a group present to make any niversary of Shaw's birth. A first of the East,\" \"Religion and Social<br />\nbership be particularly encouraged.<br />\npart<br />\nof this celebration will be staged Justice,\" \"The Supreme Decision,\" sober product of a calm mind.<br />\nSpeakers Each Week<br />\nged along. To each the other simply decisions affecting the entire group.<br />\nat Latrobe Hall on the Hopkins and \"The New Era in Asia.\" In thirty<br />\nFollowing Dr. Harker's short ad'was.\" Perhaps more than any other<br />\ncampus on the evening of November countries of Asia and Europe he SENIOR CLASS TO HOLD<br />\ndress, it was decided that there would<br />\nperson who know 0. Henry, Bill Wil- Students Must File<br />\n9, when George Boas, professor of has worked among students and leadIMPORTANT MEETING<br />\nbe a speaker scheduled for every<br />\nSchedules Before Week Ends<br />\nliams, through a rare sort of inofphilosophy at the Hopkins, will ers in all departments of life, includThursday afternoon, and that all regspeak on \"Shavianism as a Philoso- ing great names and little-known<br />\nfensive silence learned to know his<br />\nThere will be an important meet- ular meetings are to be open to anyphy\", and Hazleton Spencer, associate workers. He brings a story of comone interested enough in the subjects<br />\nAll students must file their<br />\nfriend. And how he got to know him<br />\ning of the Senior Class on Wedprofessor of English, will discuss pelling interest and vivid narrative,<br />\nto attend.<br />\nschedules at the Registrar's ofthrough the hours of 0th talk and<br />\nnesday, October 14, at 12.00 in<br />\n\"Shavianism as Drama and will which will interest all alike, but more<br />\nThe members have decided to hold<br />\nSilence, he records in a gentle, kindly, fice before October 16, 1936.<br />\nillustrate by readings from Shaw's especially students and other youth Latrobe Hall.<br />\ndaily gatherings in the laboratory<br />\nhuman ook.....<br />\nplays.<br />\ngroups.<br />\nduring the lunch period.<br />\nfreedom,<br />\n<br />\nsecurity,<br />\n<br />\neducation,<br />\n<br />\nOn The Literary<br />\nHorizon<br />\n<br />\nBOOK REVIEW<br />\n<br />\nRemsen Club Hears<br />\nHarker At Meeting<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br />\n<br />\n4<br />\n<br />\nPi Lams To Guard Hill Andl Dalers Gettysburg Rooters Battle<br />\nJays Decisively Trounced<br />\nIn Touch Hold Time Trial Jay Soccermen Two Extra<br />\nBy Powerful Lehigh Eleven; Crown<br />\nFootball League Over Mile Course<br />\nPeriods Before Winning 3-2<br />\nLose By 20 Point Margin Keen Competition Is ExBe TraSuperior Power Gives Brown<br />\nAnd White Second<br />\nVictory<br />\nJAYS<br />\n<br />\nFIGHT<br />\n<br />\nHARD<br />\n<br />\nPopow, Ellis, And Kahl<br />\nStand Out; Defense<br />\nGood<br />\n<br />\nGrid Foes Busy<br />\nOver Week End<br />\nOf Hopkins' next three gridiron foes<br />\nonly Washington College survived<br />\nthe week-end encounters with any<br />\ndegree of success. In a hard fought<br />\n<br />\ngame with the highly touted Upsala<br />\nCollege eleven, Washington, paced by<br />\nThe Blue Jay gridders opened their Young, emerged with a 7-7 tie. Washseason last Saturday with a trounc- ington scored on a pass from<br />\ning at the hands of a strong Lehigh Young to Solter in the first quarter.<br />\neleven at the latter's home field. Upsala managed to tie the game up<br />\nin the second period on a sustained<br />\nThe Bethlehem engineers rolled up<br />\ndrive from midfield to the goal line.<br />\ntwenty points to the Hopkins' 0,<br />\nHaverford, the Jays' rival on Octomaking two additional touchdowns, ber 25th, was forced to bow 46-0 to<br />\nboth of which were nullified because a overwhelmingly powerful Williams<br />\nCollege team. Haverford showed a<br />\nof penalties.<br />\nLehigh had the Jays on the de- totally ineffective offensive as well<br />\nfensive throughout the entire tilt. as a vulnerable defense.<br />\nTwo of the teams to be met later<br />\nThe Hopkins never once threatened<br />\ntheir opponents; from the start the in the season, St. Johns and RanJays were backed up against their dolph-Macon come together on the<br />\nown goal posts and there weren't latters' home field. The Yellow Jackmany times during the afternoon ets, who resisted stubbornly, yielded<br />\nwhen they were out of that situa- to the Johnnies in the third quarter.<br />\ntion.<br />\nLehigh Scores<br />\nDuring the first period the Engineers were twice thwarted in their<br />\nbid for the initial score. But their<br />\nsuperior power could not long be<br />\ndenied; for in the second quarter<br />\nHeller passed to Jamieson down on<br />\nthe Blue Jay eight yard line. From<br />\nthis point Ellstrom, a substitute for<br />\nPeet, crashed over the touchdown<br />\nmarker on two line plunges. Heller<br />\nconverted to make the score 7-0<br />\nLehigh threatened often but was limited to this lone tally during the first<br />\nhalf.<br />\nTwo More For Lehigh<br />\n'Early in the third period Lehigh<br />\nagain moved down to the visitors'<br />\n8 yard line. But the Hopkins' line<br />\nstopped the threatening advance. This<br />\nInspired defensive play went for<br />\nnought, however, for Heller intercepted a Hopkins pass to set the<br />\nstage for another touchdown. Millbank took the ball on a spinner into<br />\nthe line, broke loose, and dashed<br />\nforty yards for the second score.<br />\nHeller again converted.<br />\nThe final tally came in the last<br />\nquarter on a six yard off - tackle<br />\nsmash by Penauchi—the culmination<br />\nof a powerful drive. The game ended<br />\nwith the ball in Lehigh's possession<br />\non the Hopkins' 10 yard line.<br />\nJays' Defense Good<br />\nHopkins play was not completely<br />\nlacking in brilliancy. During the<br />\ncourse of the contest the line demonstrated remarkable ability to tighten<br />\nup in the clutches. Despite the<br />\nfact that Lehigh was far superior<br />\nboth in weight and offensive prowess, the Blue Jay linesmen, led by<br />\ntackles Popow and Ellis, showed up<br />\nvery well. More than a few times the<br />\nLehigh backs were forced to fumble<br />\nand thrown for heavy losses. The<br />\nHopkins boys played hard and tackled hard. Their defense was just<br />\nabout as good as their opponents'.<br />\nBut with the ball in their possession<br />\nthey could do nothing. Kahl was<br />\nabout the most effective runner in<br />\nthe backfield. Only one pass was<br />\ncompleted, and that for no gain.<br />\nHopkins Needs Drilling<br />\nThe Jays did as well as could be<br />\nexpected in an opening contest with<br />\nthe limited practice they had had.<br />\nPitted against an eleven which surpassed them in weight, training, experience, and reserve power, they<br />\nput up a gallant fight. Lehigh was<br />\nadmittedly \"out of their class\"—before the game; but after sixty minutes of play there were many who<br />\nfelt that with a little more preliminary training and a better drilled<br />\nbackfield the tale would have been<br />\nentirely different.<br />\nThe line-up:<br />\nLehigh<br />\nJohns Hopkins<br />\nHoppock<br />\nLE<br />\nBaetjer<br />\nRozella<br />\nL.T<br />\nPopow<br />\nBayer<br />\nL.G<br />\nDay<br />\nFamighetti<br />\nC<br />\nRoyster<br />\nKirkpatrick<br />\nHopkins<br />\nR.G<br />\nSterngold<br />\nR.T<br />\nEllis<br />\nWalton<br />\nR.E<br />\nVickers<br />\nPeet<br />\nQ.B<br />\nGraziano<br />\nMillbank<br />\nL.H<br />\nWard<br />\nWertz<br />\nR.H<br />\nVincenti<br />\nPennauchi<br />\nF.B<br />\nKahl<br />\nScore by periods:<br />\n00000<br />\nJohns Hopkins<br />\n0 7 7 6--20<br />\nLehigh<br />\nTouchdowns: Lehigh— Ellstrom<br />\n(substitute for Peet.) Milbanks, Pennauchi. Points after touchdown—Heller' (2) (substitute for Wertz.)<br />\n<br />\nSOCCER SCHEDULE<br />\nPlace<br />\nOpponent<br />\nDate<br />\nOct. 17—Salisbury Teach.—Home<br />\nOct. 24—Maryland—Reading<br />\nOct. 27—State Teachers—Towson<br />\nOct. 31—State Teachers—Home<br />\nNov. 7—Maryland—Pending<br />\nNov. 14—Salisbury Teach.—Away<br />\nNov. 18—Army—Away<br />\nDec. 5--Western Maryland—Home<br />\n<br />\npected From The<br />\nFraternity Teams<br />\nWith play starting today in the<br />\nfraternity touch football league, Pi<br />\nLambda Phi will defend its championship. Phi Psi, Omicron Kappa<br />\nOmicron, Phi Sigma Delta and Sigma Phi Epsilon will provide opposition.<br />\nThis league is part of the intramural program, and each fraternity<br />\nis represented. There will be two<br />\ndivisions, eight teams in each. Seven<br />\ngames will be played by each entry.<br />\nOn the Tuesday preceeding the<br />\nThanksgiving holidays activities will<br />\nreach a climax. All sixteen teams<br />\nare to play on that date on the regular football field and the one beside<br />\nLevering Hall. After Thanksgiving there is scheduled a play off between the winners of each division.<br />\nA plaque will be awarded to the victorious fraters. Also points per contest will go towards the winning of<br />\nthe Turbyville trophy.<br />\nReferees Chosen<br />\nAt a meting of the Fraternity Athletic Council held last Wednesday,<br />\nplans for the year were discussed.<br />\nBesides this, rules were approved<br />\nand referees and supervisors appointed.<br />\nTouch football is the same as the<br />\nregulation game except in a few<br />\nrespects. Only seven men compose a<br />\nteam and five downs are allowed<br />\nin an attempt for a touchdown. The<br />\ntime of the game is 40 minutes,<br />\nplayed in two halves. Minor changes<br />\nfrom varsity football restrict the<br />\ndangers of the game.<br />\n<br />\nRegular Course To<br />\nversed This Week For<br />\nFirst Time<br />\n<br />\nThe Jay cross country men are<br />\n<br />\nHambleton Holds<br />\nFall Track Drills<br />\n<br />\nVO<br />\n<br />\nBlue Booters Drop Season<br />\nOpener After Long<br />\nStruggle<br />\n<br />\nThe Johns Hopkins soccer team<br />\nFall track practice is now getting<br />\nits first encounter of the sealost<br />\nCoach Hambleton held the first time<br />\nunder way. Veterans and candidates son to a more experienced fast boottrials Friday afternoon, October 9.<br />\nalike are working off their leg and ing Gettysburg team by a score of<br />\nThe distance covered was only cne<br />\narm kinks. Two old timers, Dugan 3-2 at Gettysburg, Saturday. The<br />\nmile, but was certainly an acid test<br />\nopened the fray<br />\nand Johnson, are back in spikes and Blue Jay booters<br />\nconsidering the tough hill in back<br />\nwith an offensive play which yielded<br />\nseem to be in good condition. Gebethem a score in the first three minof Wyman Park. The competitive<br />\nlein, the 220 and 440 streak, was in- utes of the game.<br />\nrun is usually between four and five<br />\njured this past summer, but he is<br />\nScore Tied<br />\nmiles, and the hill and dalers should<br />\nThe game opened in the third<br />\nback on the cinder path showing<br />\nbe ready for it in a week or so.<br />\nquarter with the Gettysburg booters<br />\nform and speed.<br />\nMany berths are still vacant, and<br />\nscoring on a free kick awarded<br />\nGilman's loss was Hopkin's gain<br />\nthem on a foul by Hartke. FollowCoach Hambleton urges all sturdy,<br />\nwhen Donovan graduated. The new- ing a series of passes the booters<br />\nlong-winded men to report for praccomer takes both the low and high' from the Keystone State succeeded<br />\ntice any afternoon at four. The workhurdles in good time and looks very in edging out the Blue Jays by hangouts will help those who are going<br />\nthird<br />\npromising, as does Carlton and the ing up another tally as the<br />\nout for winter sports to get in shape.<br />\nclose.<br />\na<br />\nto<br />\ncame<br />\nquarter<br />\nNew Jersey high hurdler, Belcher.<br />\nRetaliating in the last quarter, the<br />\nThe first obstacle is Lehigh Uni- In the field events, we find Zheutbooters came out with a ralHopkins<br />\nversity, and it ought to be a close lin again throwing the discus and<br />\nlying series of fast and furious punts,<br />\nshot.<br />\nthe<br />\nputting<br />\nand interesting meet. Our team is<br />\nHartke<br />\nThose who are interested in learn- and on a corner kick from<br />\nhost, and the date is October 14.<br />\ning the technique in field events, Phillips drove the ball into the net<br />\nperiod<br />\nhurdling, or running should report to tie the score. The first extra<br />\nboth<br />\nfor<br />\nunavailing<br />\nbe<br />\nto<br />\nproved<br />\nHANDBALL NOTICE<br />\nfield.<br />\nthe<br />\nat<br />\nnow to Coach Hambleton<br />\nThere is no official practice, and you teams.<br />\nIn the second extra period under<br />\nA handball tournament, open to may come out two or three times a<br />\na barrage of boots, the Pennsylvanians<br />\nmen<br />\nshould<br />\nfast,<br />\nrangy<br />\nTall,<br />\nweek.<br />\nall Hopkins students will begin on<br />\nsank the winning goal.<br />\ncertainly report.<br />\nthe first of November. All men internow beginning to hit their stride.<br />\n<br />\nested in participating are asked to<br />\nto apply at once to Manager Red<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nGlanz, Box 333, for a place on the<br />\n<br />\nPrinters of<br />\n<br />\nladder. The finalists and semi-finalists will be awarded medals and posi-<br />\n<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nJo<br />\nrno<br />\ncan<br />\nsuit<br />\npoi<br />\nthe<br />\nto<br />\ndue<br />\nHo<br />\n<br />\nWillie Hugh Laundry<br />\n<br />\nAl<br />\n<br />\nSpecial Prices For Hopkins Men<br />\n2815 GREENMOUNT AVE.<br />\n<br />\nopi<br />\n<br />\nCHesapeake 5474<br />\n<br />\nthe<br />\n<br />\ntions on the varsity handball team.<br />\n<br />\nHo<br />\n<br />\n•<br />\n<br />\nwit<br />\nV<br />\n<br />\nV<br />\n<br />\nvot<br />\nne<br />\nUs<br />\n<br />\nare<br />\n<br />\n614<br />\nIt's a Light Smoke!<br />\n<br />\nfor<br />\n<br />\nult<br />\n<br />\nfor<br />\n<br />\nun<br />\na<br />\n<br />\nNE<br />\n<br />\nar<br />\n<br />\nbe<br />\n<br />\nre<br />\n<br />\nTo feel good after smoking —<br />\nIt's not just the pleasure a fellow gets out ot<br />\nsmoking Lucky Strikes...it's feeling good after<br />\nsmoking! Fresh as a daisy. A clean taste in<br />\nyour mouth. And when you start singing in<br />\nyour bath—your voice clear as a bell! That's<br />\nthe great thing about a light smoke. Lucky<br />\nStrikes—being made from the finest centerleaftobaccos —tastegood. And because they're<br />\na light smoke, you feel good smoking them.<br />\nAnd after smoking them, too!<br />\n<br />\n* * NEWS FLASH! * *<br />\n\"Sweepstakes\" bring pleasure<br />\nto war veterans<br />\n<br />\nA LIGHT SMOKE<br />\n<br />\n•<br />\n<br />\nLEAVES A<br />\nCLEAN TASTE<br />\nA clean taste—a clear<br />\nthroat—what a joy<br />\nwhen you wake up in<br />\nthe morning! You'll be<br />\nthankful that last evening you chose a Lit<br />\nsmoke —Luckies.<br />\n<br />\nOF RICH, RIPE-BODIED<br />\nCopyright 1930. The American Tobacco Company<br />\n<br />\nFrom a veterans'home in Legion,Texas,<br />\na number ofentries allin the same handwriting come in each week. Of course<br />\nwe checked up to make sure that the<br />\nentries conformed to the rules,and one<br />\nofthe men explained:\"Most of the boys<br />\ncan't get around—but I do and so I fill<br />\nout their cards for them.\"<br />\nWe're glad to say that the boys have<br />\nbeen pretty good pickers,too.<br />\nHave you entered yet? Have you won<br />\nyour delicious Lucky Strikes? Tune in<br />\n\"Your Hit Parade\" — Wednesday and<br />\nSaturday evenings. Listen, judge, and<br />\ncompare the tunes—then try Your<br />\nLucky Strike \"Sweepstakes.\" And if<br />\nyou're not alreadysmoking Luckies,buy<br />\na pack today and try them, too. Maybe<br />\nyou've been missing something. You'll<br />\nappreciate the advantages ofLuckies—a<br />\nLightSmoke ofticb,tipe-bodied tobacco.<br />\n<br />\nTOBACCO — \"IT'S TO.A6TED\"<br />\n<br />\nci<br />\n<br />\nL.<br />\n<br />\na4<br />\n<br />\ntl<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nXIIIlug iqopking Nrius-Krttrr<br /><br />\nVOLUME XLI, NO. 4<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br /><br />\nJohn E. Desch Dr. Sherwood Eddy'Playshop' To<br />\nPickedToCoach To Present Film BringHedgerow<br />\nOn Soviet Russia<br />\nBarnstormers Renowned World Traveler Players Here<br />\nFormer Member Elected<br />\nTo Direct First Production<br />\nOf Season<br /><br />\nTo Speak At Assembly<br />\nThursday<br /><br />\nPRICE 5 CENTS<br /><br />\nHeads New Yor.k Alumni Group<br /><br />\nRenowned Repertory Group<br />\nTo Present Double Bill<br />\nAt Auditorium<br /><br />\nRECEPTION<br /><br />\n'News-Letter' Staff Hullabaloo Pleads<br />\nTo Hear Macaulay Case Before Seniors<br />\nWednesday At 4 AtThursdayMeeting<br /><br />\n1,412 Of Students Are Marylanders—Total Of 2,103 Sets<br />\nNew Record<br />\nMiss Alma H. Prienkert, registrar<br />\nof the University of Maryland, announced today that students from this<br />\nState made up sixty-seven per cent.<br />\nof the total enrollment.<br />\nOf the 2,103 students enrolled—<br />\na new high for the university-1,412<br />\nare residents of Maryland, 197 more<br />\nthan last year. There are 34 more<br />\nfrom the District of Columbia and<br />\nonly 2 more from out of the State.<br />\nThe Graduate School, with a sixtyfive per cent. increase, was the only<br />\ndivision to show a substantial increase among out-of-State students.<br />\nOf the 757 freshmen, the largest<br />\nfirst-year class ever to enroll, seventy-one per cent. are from Maryland, a<br />\ntwenty-three per cent. increase over<br />\nlast year.<br /><br />\nIf any of the handsome Adonis to ben very mediocre—of the many hunwhom the Hopkins student body may dred schemes tried by me, all I can<br />\none has done any<br />\nlay claim are suffering from a fear say is that not<br />\nharm, as far as I know. These schemes<br />\nthat in future years their pristine<br />\nhave ranged from the use of mustard<br />\nbeauty will be marred by a bald head,<br />\nplasters to a sympathectomy on the<br />\nthey may cease their worrying immetemporal artery.\"<br />\ndiately, for others who have already<br />\nHis latest attempt has been the use<br />\nsuffered from this complaint are conof electrical energy! According to him,<br />\nstantly experimenting in an effort<br />\nthe only appartus necessary is two auwhich practically parallels growing<br />\ntomobile batteries, two electrodes a<br />\nhair on a billiard ball. Who knows,<br />\nstrong nervous system, and plenty of<br />\nperhaps some day some genius will<br />\nfaith. If any readers determine to venhit upon a discovery which will banture an attempt under the above condreaded<br />\nenemy<br />\nthis<br />\nof<br />\nish<br />\nbeauty?<br />\nditions, they may desire to ask the<br />\nRecently one despairing soul whose same questions which this brilliant<br />\nhairs are evidently very meager has saviour of manhood's crowning glory<br />\nhit upon the unique idea of applying has addressed to Dr. W. B. Kouwenelectricity to the head to stimulate hoven. He seemed most anxious to<br />\nthe growth of the hair. According to find out whether the current would<br />\ncorrespondence with the Electrical travel superficially through the scalp<br />\nEngineering Department he writes and not penetrate deeply enough to<br />\nthat \"for the past fifteen years I affect the brain substance. It is wellhave had hallucinations concerning known scientific fact that bone is of<br />\nthe therapeutic values of different high resistance. Therefore, as it is imtreatments, drugs and gadgets. Un- portant that the letter writer has a<br />\nfortunately, to date my results have thick skull, the danger is slight.<br /><br />\nRemsenClubHears<br />\nHarker At Meeting<br />\n--Club Makes Plans Concerning Acquisition Of New<br />\nMembers<br />\nThe Remsen Chemical Society inaugurated its 1986-37 season with a<br />\nmeeting held last Thursday afternoon in Room 221, Remsen Hall.<br />\nDr. David Harker, newly appointed<br />\nlecturer in elementary chemistry, addressed the meeting briefly; offering, on behalf a the Chemistry Department, the use of a laboratory<br />\nwhich was donated by Dr. Walter<br />\nA. Patrick, the only restriction placed<br />\nupon the members in the use of<br />\nwhich is that they undertake no<br />\ndangerous research.<br />\nDr. Harker added several suggestions concerning the acquisition of<br />\nnew members. He recommended that<br />\nonly those students particularly interested in chemistry be admitted<br />\n(Continued on page 3, col. 6)<br /><br />\nFOLLOWS<br /><br />\nSchweitzer, Head, Has Revived Eastern Alumni<br />\nGroup<br /><br />\nJohn E. Desch, '28, former member<br />\nthe assembly hall of Latrobe Hall, he 37 is an engagement of the Hedgerow<br />\nof the Barnstormers and prominent will present a color film of<br />\nRussia, Players, under the direction of Jasper<br />\nlocal dramatics coach, has been se- taken this past summer. It was made Deeter, to be supplemented by other<br />\nlected to direct the first production of in connection with the annual Euro- plays and lectures through the winter.<br />\nthe 1936-37 dramatics season of the pean Seminar given by Dr. Eddy for Dr. N. Brillion Fagin, director of the<br />\nAmerican Statesmen, religious lead- Playshop, has planned the activities<br />\nJohns Hopkins Barnstormers, accorders, and educators. The entire school, to include a series of lectures and two<br />\ning to Marty Levine, president of that students, faculty,<br />\nand the general pub- plays to e presented by Hopkins playorganization.<br />\nblic are invited. The film is titled, ers at the Playshop, on the campus.<br />\nThe Hedgerow players come to<br />\n\"We are exceedingly fortunate in \"Life In Russia.\"<br />\nAt<br />\n1.00<br />\nP.M.<br />\nthere<br />\nfor the first time, to preBaltimore<br />\nwill<br />\nbe<br />\na<br />\nlunchMr.<br />\nof<br />\nservices<br />\nhaving obtained the<br />\nDesch,\" said Levine. \"His record of eon in Levering Hall. Dr. Eddy and sent two bills at the Auditorium Theathe plays he has directed and produced Mr. Sam Franklin, of the Delta Co- tre on November 18. Considered by<br />\nIn the last several years is amazing, operative Farm of Hill House, will be many to be the finest repertory group<br />\nand we're sure that whatever play is heard speaking on this famous co- in America, this organization enjoys<br />\nchosen to be presented will uphold operative venture. This luncheon is a national reputation, based upon the<br />\nthe standard and continue the prestige open to all, arrangements to be made past production of thirty-five different<br />\nplays, given in three hundred and<br />\nthat the Barnstormers have gained through the Y.M.C.A.<br />\nthirty performances. Under the exTo Speak At Goucher<br />\nfor themselves in past performances.\"<br />\nAt 4.00, Dr. Eddy will be heard at tremely capable leadership of Jasper<br />\nMr. Desch, who among other things<br />\nis dramatics coach at the Baltimore Bennett Hall, Goucher College. In the Deeter, acknowledged by most critics<br />\nCity College, has produced such evening, at seven, there will be an op- to be a genius in the theatre, and subBroadway successes there as The Poor en Cabinet meeting at the Hopkins, ject of a recent article by Sherwood<br />\nCHANNING E. SWEITZER<br />\nNut, The Queen's Husband, The Ner- to which everyone is invited. Mr. Anderson in Esquire,this experimental<br />\n1/014.9 Wreck, Once In A Lifetime, and Franklin will speak on the farm, of theatre, with headquarters in Rose<br />\nShe Loves Me Not. He is somewhat which he is manager, telling some- Valley, Pennsylvania, has just played<br />\nof a Gilberterian, having directed the thing of the plan which operates this an engagement in Philadelphia, where<br />\nGilbert and Sullivan operettas Pirates venture, called by some \"the greatest the critics were unanimous in lavishcooperative economic experiment in ing praise upon their work.<br />\nOf Penzance and The Mikado.<br />\nThe plays will be; The Emperor's<br />\n\"I am very honored at being elected the country.\" It is located in the sharecoach of the Barnstormers, an organ- cropper district of Mississippi, and New Clothes, a play for children, at<br />\nization of which I was a member for operated and controlled by both ne- 4. p. m., and Getting Married, one of<br />\nBernard Shaw's most biting satires,<br />\nfive years,\" stated the newly chosen groes and whites.<br />\nDr.<br />\nEddy<br />\nis<br />\njust<br />\nback<br />\nfrom<br />\na<br />\nlong<br />\n8.30 p. m. The scale of prices for the<br />\nat<br />\ncoach. \"And I hope to carry on the<br />\nFormer 'Sun' Staff Writer 'Hulabaloo Cost To Be<br />\nmany traditions associated with this trip to China. His visit was at the un- performances is to be: afternoon, 25,<br />\nsnimous<br />\n1.00,<br />\n$50.<br />\nevening,<br />\ncents;<br />\nrequest<br />\nChinese<br />\nof<br />\nY.M.<br />\nthe<br />\nand<br />\n50<br />\n35,<br />\nTo Speak In Levering Hall<br />\nSeparate From Senior<br />\ngreat organization. I hope to uphold<br />\nthe standard of old Barnstormer plays, C.A. leaders, who are attempting to 1.50 and 2.00.<br />\nAt<br />\n4<br />\nP.<br />\nM.<br />\nDues<br />\nIn February, Hopkins players will<br />\nand I am particularly interested in inaugurate a campaign of Christianbringing the new note of music, sing- ity in that famine-stricken country. He present August Strindberg's The<br />\nP. Stewart Macauley, Secretary of<br />\nHenry Kramer, Business Manager<br />\ning, and dancing to the comedies of was eye-witness to the Japanese occu- Father, one of the better-known plays<br />\nthe<br />\nUniversity,<br />\nwill<br />\naddress<br />\nthe<br />\nstaff<br />\nof<br />\nthe Hullabaloo, Robert Austrian,<br />\npation of Mukden, and acted as agent in the theatre world. Later, in April,<br />\nthe current season.<br />\nfor the neutrals in that city by cabling there will be a presentation of a new of the NEWS LETTER and the candi- Editor of the Hullabaloo, and Holt<br />\nMr.<br />\n\"As in the past,\" continued<br />\nGeneva, England and America. He comedy by an American playwright, dates to the staff on Wednesday morn- M,aulsby, President of the Student<br />\nDesch, \"the rehearsals will be fun—<br />\naccused by the Japanese of aband- which has not yet been selected.<br />\nwas<br />\ning, October 14, at 11.30. Mr. Mac- Activities Committee, unsuccessfully<br />\nand then more fun for everybody who<br />\noning his role of observer, and replied<br />\nIn addition to these major produc- auley has been the<br />\nturns out. The plays we have in mind<br />\nsecretary of the pleaded the case of the yearbook bewas opposed to militarism, tions, a number of lectures will be ofrequire large casts, so I hope that sev- that he<br />\nUniversity since December of last fore the Senior Class at a meeting held<br />\neral hundred students will attend the whether home or abroad, as a menace fered to season subscribers. The first<br />\nChristianity.<br />\nis scheduled for Latrobe Hall, on year, when he was selected to fill the last Friday in Latrobe Hall.<br />\nfirst rehearsal. This is an invitation to peace and<br />\nNovember ninth, when Professor Ha- new position. He graduated from HopFamed As Traveler<br />\nSince the Hullaba'oo is no longer<br />\nto the entire student body.\"<br />\nDr. Eddy's fame as a world traveler zelton .Spencer, of the English Depart- kins in 1923, and became associated subsidized by the University,<br />\neach stuLiterally born on the stage, Desch<br />\nand lecturer springs from his lifetime ment, will speak on George Bernard with the Sunpapers, holding the posident who desires a copy is to be<br />\nbegan his acting career in the arms<br />\nspent upon the lecture platform, and Shaw, and his importance in the World tion of assistant city editor of The Sun,<br />\nof his grandmother at the age of six<br />\nmany books of his experiences. He Theatre. The address will be followed from 1925 to 1930. From that time on, charged the regular fee, $3.50 for<br />\n(months in the Birth of a Nation. After<br />\ngraduated from Yale in 1891, going to by reading from Shaw's plays. Other he was staff writer for the Evening Frosh Sophs, and Juniors, and $10 for<br />\nattending McDonogh, he became promIndia, where he served fifteen years speakers in the series will be Donald Sun. Throughout his work, he main- Seniors. The Senior charge includes<br />\ninent in dramatics at Hopkins, usualy<br />\namong the students of the Empire. Kirkley, dramatic critic for the Bal- tained close connection with the uni- the privilege of having a formal picportraying the leading \"feminine\"<br />\nCalled at last to be the Secretary for timore Sun, Dr. Anne Irene Miller of versity, and was prominent among the<br />\nture and an informal \"shot\" in the<br />\nsuccesses<br />\nBarnstormer<br />\nroles in the<br />\nAsia for the National Council of the Goucher College, and Dr. Fagin, di- Alumni for his scholarly approach to<br />\nof that era. He has in the past, also<br />\nspecial<br />\nSenior section of the book.<br />\nY.M.C.A., he devoted the next years to rector of the Playshop.<br />\nthe study of its problems.<br />\ntaken part in various plays presented<br />\nNot<br />\nAssuming Past Debts<br />\nuntiring service among the officials<br />\nDr. Fagin expressed the hope that<br />\nHis skill as a writer is well known,<br />\nby the Johns Hopkins Playshop and<br />\nand young people's groups of India, the students would avail themselves<br />\n\"It is to be definitely understood\",<br />\nand<br />\nhis<br />\nUniversity<br />\nexperience<br />\nrepas<br />\nthe Vagabonds.<br />\n'China, Japan, and the Near East. He of the unusual opportunity offered by<br />\nresentative in relations with the press, said Business Manager Kramer, \"that<br />\nAmong the plays under consider- has made six visits to Russia,<br />\nfour of this excellent program and thereby as well as his years of actual service we are not assuming<br />\nany past debts<br />\nation by the play-reading committee, them since the Soviet Regime.<br />\nsupport a Hopkins enterprise. Season on newspapers, qualify him as a man<br />\nof the yearbook. We are producing<br />\nconsisting of Gerald Branower, Mere!<br />\nIn spite of his untiring activity and tickets will be sold in the Reading who will have much to say to the<br />\nHarmel, Stanley Prager, and Marty<br />\nour book independently of any other<br />\nwork on lecture platforms, Dr. Eddy Room of the library at two dollars staff of the paper..<br />\nLevine are as follows: I Love An Acstudent organization, and in doing it<br />\nhad time for writing. His books pub- each. These include all the activities,<br />\nLast year Mr. Miacauley spoke to<br />\ntress, Once In A Lifetime, The Bishop<br />\n(Continued on page 3, col. 4)<br />\n(Continued on page 3, col. 1)<br />\nthe staff about his experiences as a this way we feel that we can put out<br />\nMisbehaves, and Louder Please. They<br />\nreporter on The Sun. Thursday he will a better book and keep the yearbook<br />\nare all recent Broadway successes. The<br />\nspeak on the relations between the out of debt.\"<br />\nselection of the play will be announced<br />\nstaff of a paper and the work involved<br />\nLast year the Hullabaloo money was<br />\nshortly.<br />\nin preparing a paper for press.<br />\nused to provide capital for June Week,<br /><br />\nBaldheaded Men Face Relief<br />\nAs Genius Uses Electricity<br /><br />\nAlumni To Hold<br />\nBanquet In New<br />\nYork Friday Eve<br />\nDr. Bowman Scheduled As<br />\nPrincipal Speaker<br />\nFor Occasion<br /><br />\nSam Franklin, Manager Of<br />\nFORMER HOPKINS MAN Delta Cooperative Farm, DATED FOR NOV. 19<br />\nTo Speak Also<br />\nGroup To Offer Shaw<br />\nLevine, Dramatics President Dr. Sherwood Eddy, noted world<br />\nSatire, Dr. Fagin<br />\ntraveler and author, is to be at HopAnnounces Selection<br />\nAnnounces<br />\nkins on Thursday, under the auspices<br />\nAfter Meeting<br />\nof the Young Men's Christian Asso--- Heading the Playshop bill for 1936ciation. In the morning, at 11.30, in<br /><br />\nU.OfM.Enrollment<br />\n67P.C.From State<br /><br />\nSENIOR<br />\nCLASS MEETING<br />\nTOMORROW<br /><br />\nand when June Week went into debt,<br />\nthe Hul'abaloo went into the red also,<br />\nand the Administration was forced to<br />\ncover the deficit. The University Ad'ministration has definitely refused to<br />\n(pay any more debts for the Hullabaloo.<br />\nThe Hullabaloo staff feels that by<br />\nrunning its financial business separately from June Week, Senior dues, or<br />\nany other student activity, it can put<br />\nout a better book and meet with financial success.<br />\nSeniors Uncertain<br />\nThe members of the Senior class are<br />\nhaving difficulty in seeing why the<br />\nHullaba.loo must cost $10, when the<br />\nentire Senior Dues last year was only<br />\n$18. The answer lies in the fact that<br />\nlast year the accumulated debt of<br />\nJune Week and the Hullabaloo was<br />\nover $500.<br />\nThis year's annual will be dedicated<br />\nthe The Engineering School and will<br />\ncarry special \"shots\" of the Anniversary celebration in February.<br />\nIt is important that Seniors make<br />\nup their minds before the next meeting<br />\n'whether or not they will subscribe to<br />\nthe new plan of the Yearbook.<br /><br />\nApproximately 500 Hopkins alumni from New York City and nearby<br />\nsections in New York State, New<br />\nJersey and Connecticut will gather<br />\nfor the annual banquet of the New<br />\nYork, New Jersey and Connecticut<br />\nAlumni Association at the Hotel<br />\nPennsylvania<br /><br />\non<br /><br />\nFriday<br /><br />\nevening,<br /><br />\nOctober 16.<br />\nDr. Isaiah Bowman,President of the<br />\nUniversity, will be the principal<br />\nspeaker on the occasion. Other speakers will include Daniel Willard, President of the Board of Trustees; Walter S. Gifford, a Trustee, who is President of the American Telephone and<br />\nTelegraph Company; and Dr. Henry<br />\nA. Christian, former Dean of Medicine<br />\nof the Harvard Medical School and<br />\nnow Physician-in-Chief of the Peter<br />\nBent Brigham Hospital, Boston. Dr.<br />\nChristian received his M.D. at Hopkins in 1900.<br />\nReception Follows Dinner<br />\nFollowing the dinner there will be<br />\na reception and dancing, music for<br />\nthe latter to be provided by the Hotel<br />\nPennsylvania Orchestra.<br />\nThe banquet comes as a climax of<br />\na year in which the New York, New<br />\nJersey and Connecticut Association<br />\nhas undergone a remarkable revival<br />\nunder the presidency of Charming E.<br />\nSweitzer. During the year the membership of the Association increased and<br />\nthe Johns Hopkins Club of New York,<br />\nwith quarters in the Columbia University Club, was established.<br />\nClass Of 1908<br />\nThe President of the Association is<br />\nan A.B. of the Class of 1908. After<br />\nleaving Hopkins he studied at the University of Pennsylvania, New York<br />\nUniversity, Columbia and Harvard.<br />\nFor some time he was head of the Department of History and Government<br />\nat Shippensburg State Teachers College and Mercersburg Academy,<br />\nPennsylvania. He has been a member<br />\nof the staff of the Bureau of Municipal<br />\nResearch, New York; he served under<br />\nCalvin Coolidge in helping to frame a<br />\nplan for reorganizing the Massachusetts State Government and he was<br />\nAssistant Chief of Staff of the Committee on Retrenchment and Reorganization of the New York State Government in the administration of Governor Smith.<br />\nMr. Sweitzer is now Managing Director and Treasurer of the National<br />\nRetail Dry Goods Association. Last<br />\nyear he was elected to honorary membership in the Beta Circle of Omicron<br />\nDelta Kappa.<br />\nIn addition to his leadership in the<br />\nAlumni Association and the New York<br />\nClub, Mr. Sweitzer has been extremely<br />\nactive during the campaign for a Sustaining Fund for the University. He<br />\nwas chairman of the New York Advisory Board and he provided the<br />\noffice space which served as campaign<br />\nheadquarters in New York.<br />\nMembers Of Committee<br />\nWhile the annual banquet of the Association has no connection with the<br />\ncampaign for funds (the campaign<br />\ncloses officially in New York on<br />\nOctober 15) committees organized for<br />\n(Continued on page 3, col. 6)<br /><br />\nRifle Club To Hold First<br />\nMeeting In November<br />\nThe '36 edition of the R.O.T.C. made<br />\nits official debut last Tuesday with the<br />\nfirst drill of the new season. With enthusiasm running high among the men<br />\nand ifficers the unit has in prospect<br />\nanother fine year.<br />\nThe rifle club which is sponsored<br />\nby the organization but open to all students will have its first meeting about<br />\nNovember 1st. The club makes use of<br />\nthe North Loft of Gilman Hall for its<br />\npractices.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br /><br />\n2<br />\nuate activities. There is little to be<br /><br />\nObe jobrai Appkinfi said here beyond the mere fact that On The Literary<br />\nthe Administration has been forced to<br /><br />\n00 K<br />\nREVIEW<br /><br />\n:-: LETTERS TO THE EDITOR :-:<br /><br />\nHorizon<br /><br />\nA WARNING FROM HOPKINS ACE ability to beat the next fellow to<br />\nthe bread and butter—it includes<br />\nLIBERAL-IL DUCE<br />\ncial aid to the Hullabaloo, and what<br />\nTo the Editor of the \"News-Letter\"— religion, social adaptation, a long<br />\nAfter The New Deal, What?<br />\nbook<br />\nMarion<br />\nnew<br />\nRawson's<br />\nNichol'<br />\nlittle is offered the staff of the yearSir:<br />\nBy<br />\nNorman Thomas. New York:<br />\nrace,<br />\nthe<br />\nview<br />\nof<br />\nhuman<br />\n(and<br />\nbroad)<br />\nare<br />\nDuttons<br />\nHandwrought Ancestors,<br />\nbook is too small to risk the financial<br />\nNow the time has come to warn the and the answer to the questions,<br />\nThe MacMillan Co. $2.00<br />\npublishing October 9th. Mrs. Rawson<br />\n$2.00<br />\nbankruptcies of the past few years.<br />\nSubscription per year<br />\nfreshmen and other men of the campus where are we going, where should we<br />\nhas made early American lifer her<br />\n$2.50<br />\nBy Mail<br />\nNorman Thomas, by virtue of his<br />\nThere was only one solution possiagainst the Red Peril. Don't let our be going, and how can we get there.<br />\nfield and Handwrought Anspecial<br />\nselfless<br />\ncourage and his personal infamous University become another<br />\nRemit subscription fees to Treasur- ble—the placing of the yearbook on a<br />\nThe relation of technique and of<br />\nher sixth book dealing with \"Little Red Schoolhouse.\" A certain<br />\nis<br />\ncestors<br />\ntegrity, has won the admiration of<br />\ner, Student Activities Council, Rem- subscription basis, with of course,<br />\nscientific thought to these vital quespen Hall, Postoffice, Johns Hopkins higher rates for seniors than for other her adventures into the American bushy-headed group on the campus<br />\na great many Americans. This, howtions could be sharply pointed by<br />\npast. Mrs. Rawson spent the Summer will so try to distort the facts to<br />\nUniversity.<br />\never does not affect the absolute<br />\nundergraduates because each senior<br />\nand around choosing a topic where such relaclassrom<br />\nthe<br />\nin<br />\nyou,<br />\nboth<br />\nin New Hampshire, gathering mateworth of his pronouncements.<br />\nthat<br />\nindicating<br />\nby<br />\nand<br />\nin,<br />\nenter<br />\ntions<br />\nin<br />\nthe<br />\nhave<br />\nan<br />\npicture<br />\nwill<br />\nindividual<br />\nare<br />\nThe<br />\nCommunists<br />\ncampus.<br />\nDethe<br />\nEntered as second-class matter<br />\nrial for her next book, which she says,<br />\nAfter The New Deal, What? was<br />\nno longer a group holding smoking the development of these relations<br />\ncember 3, 1909, at the Postoffice in book.<br />\nhas to do with \"local town history.\" bombs, but are glib-tongued experts will be the primary consideration in written by the Socialist Party perBaltimore, Md., under the Act of ConBy refusing the paltry sum at the<br />\nP\"Like a bird,\" she writes, \"I seem to in converting you to their false and judging the papers. The topics of ennial, not as a mere campaign docgress, November 3, 1879.<br />\ndisposal of the University, the Hullathe last couple of years are, in the<br />\nhave just two trails in life these days, dangerous doctrines.<br />\nument—something to be discarded<br />\nPublished semi-weekly from Octo- baloo is more certain of sound finanis synonymous with writer's opinion, quite sterile in this<br />\nCommunism<br />\nber to June, except during examina- cial grounding since it will receive one South in the Fall and one North world revolution, and seeks the de- respect. Moreover, the choice of a the second wek of November—but<br />\nin the Spring. However, this at least struction of all nations, including topic such that advanced and speci- as a book whose major contentions<br />\ntion and college holiday periods by<br />\nmore money per student and consebelieves will be valid<br />\nundergraduates of the Johns Hopkins<br />\ngives me variety.\"...<br />\nabolition of patriotism, religion, mar- alized training is required for any the author<br />\nquently more money per book. By dielected and for the years<br />\nis<br />\nwhoever<br />\nUniversity.<br />\nwill<br />\ntreatment,<br />\nintelligent<br />\nreasonably<br />\nproperty<br />\nprivate<br />\nfamily,<br />\nthe<br />\nCzechoa<br />\nriage,<br />\nis<br />\nDr. Jaroslav Durych<br />\nvorcing itself from any connection<br />\nbe equally sterile in respect to the vital and timely one, handling in the<br />\nslovakian surgeon, fifty years old, and all political and civil liberties,<br />\nEDITORIAL STAFF<br />\nwith senior dues, the HuPabaloo<br />\nbenefit to be derived by the students quiet, sincere, and effective Thomas<br />\nworlda<br />\nof<br />\nand the establishment<br />\nEditor-in-Chief avoids the all-too-common danger of wilose main interest in life, outside his wide dictatorship of the so-called in pursuing the subject. In the ma- ahead. Nevertheless, the book is a<br />\nWilliam Diamond<br />\nStanley Finkel<br />\nAssociate Editor<br />\nprofession, he says is his work for proletariat, which is an autocratic jority of cases the inevitable result fashion, the story of the present nabeing forced into bailing June Week<br />\nJames Morrow, David Caplan<br />\n\"rehabilitation of Catholicism in small group of self-perpetuating rev- of such a choice is that the student tional administration, the devolopemManaging Editors out of debt to its own financial<br />\nwades through a mass of material merit of American fascism and its<br />\nthe Czechoslovakian Republic.\" Dr. olutionists.<br />\nSports Editor barrassment. And at the same time<br />\nBernard D. Pinck<br />\nmore or less unintelligible to him, probable crystallization after the New<br />\nfound<br />\ncommittee<br />\nA<br />\nCongressional<br />\nDurych now comes forwar with a<br />\na<br />\nBenjamin Root<br />\nit means a substantial economy to<br />\nthat fully ninety per cent of the act- and proceeds to regurgitate the same Deal ,the counter devolopment of<br />\nAssistant Managing Editor those seniors who are interested only moving and colorful historical novel ivities of the American Civil Liber- (sometimes in identical phraseology), farmer-labor party of progresives and<br />\nbuilt around the story of the Thirty ties Union are on behalf of Com- sandwiched in between an Introduc- radicals, his quarrel with the CommunArnold Glantz, Harold Zheutlin<br />\nin the Hullabaloo.<br />\nAssistant Sports Editors<br />\nYears War, which he calls \"The De- munists. Its leader, Roger N. Bald- tion and a Conclusion, and followed ists, and his announcement that the<br />\nMuch of the Senior protest has<br />\ncapitalism<br />\nIsadore Gertman, Wethered Barroll<br />\nwin, told a Congressional committee by an imposing bibliography. Far issue in this campaign is<br />\nscent of the Idol.\"<br />\nsocialism.<br />\nor<br />\nNews Editors come from the Engineering School.<br />\nis<br />\nhe<br />\ninwits,<br />\nhis<br />\nsharpening<br />\nfrom<br />\nDuttons announce it for publication it upholds the rights of Americans<br />\nMr. Thomas makes his first big<br />\nReporters—Sigmund Safier, Max Is- In view of the fact that the 1937 yearor aliens to advocate force or vio- troduced to the pernicious practice<br />\nkowitz, Nathaniel Finkelstein, Jew- book is to be dedicated to the Engin- October 19th. The doctor has made lence for the overthrow of the Gov- of trying to say nothing at sufficient mistake when he assumes that it is<br />\nWallenstein, conquerer of Gustavus ernment.<br />\nett Goldsmith, Howard Reizenstein,<br />\nlength to make it appear that he has a matter of indifference which of two<br />\neering School in commemoration of<br />\nJulian Adler, Carl Rasin, Floyd<br />\nthis<br />\na great deal. Inertia, sloppy capitalist candidates is elected. To my<br />\nin<br />\nsaid<br />\nfigure<br />\nAdolphus, his central<br />\nLet us keep America from becoman attitude<br />\nKatske, Malcolm Boshnack, Leonard its 25th anniversary, such<br />\nand scientific (?) hypoc- mind, our system of capitalist econthinking,<br />\nwith<br />\nCommunDown<br />\ning<br />\nsovietized!<br />\nnestirring novel; but he has not<br />\nRubinger, Morris Wessel, Arthur is hardly understandable. Forgetting<br />\nrisy follow, by the well-known prin- omy is not so narrow that all its supglected the minor prelates and princes ism and the beguiling Reds!<br />\nKatz, Martin Krieger, Lester Rosen- the three main reasons for subscriphuman, will follow the path of least porters form a single homogenous<br />\nDuce<br />\nGrahame<br />\n—Gordon<br />\nand their innumerable intrigues, nor<br />\nthal, Sidney Baum.<br />\nresistance, if given the slightest en- mass.<br />\ntions this year, it seems that at least<br />\nSecondly, Mr. Thomas' differences<br />\nthe romance of George and Angela<br />\nBUSINESS STAFF<br />\ncouragement.<br />\nPROTESTS SENIOR ESSAY<br />\nevery Engineer ought to be on the<br />\nWilliam B. Kempton....<br />\nParticularly in the case of pre- with the Communist Party, to the<br />\nwhich stands out in vivid contrast to To the Editor of the \"News-Letter\"-Business Manager subscription list.<br />\nmedical students should there be an expression of which he devotes disthe religious fanaticism which is his Sir:<br />\nMelville Locker<br />\neffort to introduce him to the prac- proportionate space, seem to me to<br />\nthe<br />\nof<br />\ntopic<br />\nthe<br />\nof<br />\nAnnouncement<br />\nbackground.<br />\nmore than quibbling<br />\nAssistant Business Manager<br />\nessay to be written by Seniors in tice of approaching problems inde- amount to little<br />\nEdward Garnett, who reported on<br />\nall the Left<br />\nWm. C. Erlanger<br />\nNatural Science for 1936-37 seems pendently, under his own power. that tends to discredit<br />\ntnis book for E. P. Dutton and Com- to call for undergradute comment Spineless dependence upon textbook parties. It would seem more logical<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nGerald Willen<br />\npany, previous to publication, wrote through your columns. In the writ- dicta has often greased the way to for Mr. Thomas to brush aside these<br />\nnot often go<br />\ndoes<br />\nLETTER<br />\nTheNEws<br />\nlesser grievances, and form, with the<br />\nOffice Manager<br />\nHoward Linkoff<br />\nthat it belongs to the \"old-fashioned er's opinion such comment should failure (with its grim implications<br />\nCommunists, the trade-unionists, proout of its way to shower praise. But<br />\nsituations<br />\nin<br />\npractice)<br />\nmedical<br />\nNathaniel Soifer<br />\nin<br />\nsince,<br />\nClass of historical novel of romance have been forthcoming long<br />\nthe other<br />\nCopy and Filing Manager a brief digression from tradition is<br />\nand in view of its absence hereto- where a little independent mental gressive church groups, and<br />\n'and adventure which never reads dry,<br />\nthe<br />\nAmerica,<br />\nin<br />\nforces<br />\nprogressive<br />\nclear<br />\nassured<br />\nhave<br />\nwould<br />\narithmetic<br />\nfore, he believes it his duty to pronow in order.<br />\nFarmer-Labor Party which he advobut perennially crops up every few vide some sort of student expression sailing.<br />\n1936<br />\nMember<br />\n1937<br />\nThe Alumni Memorial Hall is en(Continued on page 3, col. 5)<br />\nI do not believe that this is irrelyears. It may be likened to Sionke- in regard to the choice of topics and<br />\ntering its New Deal period. When the<br />\nbe<br />\ncan<br />\nThere<br />\nquestion.<br />\nour<br />\nto<br />\nevant<br />\nthereby<br />\nattitude,<br />\npedagogic<br />\nthe<br />\nand<br />\nwicz's Fire and Sword and other PoDistributors of<br />\nDormitory Activities Committee was<br />\nare in charge no doubt that the habits and attilish historical romances,\" said Mr. indicated, of those who<br />\ntude instilled in a student in the<br />\nformed late last year, optimism ran<br />\nof this matter.<br />\nGarnett, \"which has a big vogue and<br />\nThe writing of such a paper pro- course of his college training will be<br />\nhigh; after the first dance held in the<br />\na oig sale thirty years ago.\"<br />\nTuesday, October 13, 1936<br />\nvides a powerful tool with which to the almost exclusive determining inCommons Room and after the first<br />\nLiterary vogues have a way of stimulate in the students a certain fluence on the grade of his future<br />\nlectures sponsored by the group, plans<br />\nusefulness<br />\n'coming and going, like the seasons; amount of original thought; and work, and hence on his<br />\nfor the future abounded. But that an<br />\nto the community. The comprehenaccomtopic,<br />\nthe<br />\nof<br />\nchoice<br />\nproper<br />\niowever the historical novel is back<br />\nextensive program—including lectures,<br />\npanied by the proper attitude on the sive paper is a vital part of the UniThe plight of the Hullabaloo reagain and Duttons believe that \"The<br />\nof those directing the students, versity training, or should be so,<br />\npart<br />\nchess and ping-pong tournaments,<br />\nquires an explanation. Much of the<br />\nDescent of the Idol\" has all of these could provide opportunity for more and is to be regarded as such by facdances, after-dinner speeches, Sunday<br />\nmisunderstanding that has arisen,<br />\n'attributes which will make it appeal genuine education than several years ulty and undergraduates alike. It<br />\nafternoon musicales, and athletic<br />\nupon the stuparticularly between the Senior Class<br />\nto large masses of readers in this of formal classroom instruction. should not be forced<br />\nnecessary, but<br />\na<br />\nof<br />\nform<br />\nthe<br />\nin<br />\ntournaments--should be drawn up and country.<br />\ndent<br />\nterm<br />\nthe<br />\nby<br />\nis<br />\n(What<br />\nmeant here<br />\nand the staff of the yearbook, comes<br />\nThe<br />\nunpleasant, formality. It<br />\nhighly<br />\nI<br />\nbefore<br />\nwill<br />\nbe<br />\n'proper'<br />\napparent<br />\nset into motion within less than two<br />\nThomas<br />\nfrom<br />\nletter<br />\na<br />\nThey report<br />\nhoney Ii<br />\nfrom a genuine ignorance of the facts<br />\nto<br />\nsevaddressed<br />\ncarefully<br />\nbe<br />\nshould<br />\nhave<br />\nUniversities<br />\nthe briar<br />\nweeks was more than anyone could Mann to the author in which Mr. have finished.)<br />\nrather than from a difference of<br />\neral aims: namely, to put point to<br />\nkeeps the pipe<br />\nMann said that he considers Dr. been accused of failing to show the<br />\nhave forseen.<br />\nsweet.<br />\nthe lecture room; to synthesize the<br />\nopinion.<br />\n'Durych's book a \"wonderful achieve- students a connection between their<br />\n'09h-efficiency'<br />\nBernie Pinck and his Activities<br />\nto relate<br />\nthere;<br />\nrequired<br />\nmaterial<br />\nbefore<br />\nlies<br />\nwhich<br />\njob<br />\nthe<br />\nand<br />\nstudies<br />\nLast year the Senior Class of the<br />\nment. I have not read,\" he says, \"a<br />\nCondensor cleans,pufitles<br />\nCommittee deserve the congratula- historical novel with such rapt atten- them after graduation. It is claimed the same to life; to stimulate original<br />\nsmoke.Traps moisture. NoclogUniversity was forced to use funds<br />\nsing. No trouble.Prove it yourseat<br />\ntions and support of the entire student tion. As fare as the portrayal of the that seclusion renders them unequal thinking and reflection upon this rebelonging to the Hullabaloo as collation.<br />\nreto<br />\nwell<br />\nis<br />\nit<br />\nand<br />\noutside:<br />\nlife<br />\nto<br />\nit<br />\nin<br />\n'battle of Luetzen is concerned,<br />\nbody, and particularly of the men<br />\n—\"Senior\"<br />\nlateral capital for June Week. The<br />\nbeems to me to be on the same level member that life includes more than<br />\nthe dormitory.<br />\nJune Week committee went heavily<br />\nWith Tolstoy; but, even apart from<br /><br />\nPritni<br /><br />\nletter<br /><br />\nwithdraw practically all of its finan-<br /><br />\nOrchids<br /><br />\nRssocialed Colleeiate Press<br /><br />\nGDileelicde DieSest<br /><br />\nNeeded Explanation<br /><br />\n\"At Your Dealer\"<br /><br />\nCampus News<br /><br />\nInto debt—to the tune of several hun-<br /><br />\nthat, what a glowing ardour and richness and colour! I firmly believe that<br />\nthe name of Jaroslav Durych will bewere used to clear up the deficit. The<br />\ntome famous throughout the world.\"<br />\nyearbook itself was thus forced into<br />\nWilliam Wash Williams, whose porLast Spring Columbia University<br />\nthe red, and the University had to<br />\nof 0. Henry, The Quiet Lodger of<br />\ntrait<br />\naccepted an invitation to attend HeidIrving Place, Duttons announce for<br />\ncover the debts.<br />\nelberg's ciPuincentenary celebrations<br />\npulication October 14th, was the man<br />\nThis was not the first time such<br />\nin Germany. Students protested and 'who first brought 0. Henry and the<br />\na situation had occurred. Rightfully<br />\nheld demonstrations on the Campus Old New York World together. In his<br />\nindignant, the University Administrabook Mr. Williams tells the story of<br />\nand at Presidents Butler's home.<br />\ntion has refused to pay any future<br />\nmeeting with 0. Henry when he<br />\nthis<br />\nColumbia's<br />\nof<br />\none<br />\nRobert Burke,<br />\ndebts for the Hullabaloo. The yearWas sent out by the Sunday Editor of<br />\nwas<br />\nmost prominent undergraduates,<br />\nthe World to get his man.<br />\nbook is thus faced with the necessity<br />\none of the leaders of the protest. The<br />\n\"When 0. Henry came to New<br />\nof balancing its budget both theoretiUniversity Administration expelled 'York,\" he says, \"I was a cub reporter<br />\ncally and actually.<br />\nBurke for his participation in the on the Sunday World, accepting small<br />\nAnother factor was taken into conbeing of tremendous<br />\ndemonstration. Court action has been (assignments as<br />\nsideration by the yearbook manageimportance, running my legs off after<br />\ntaken. September 29 saw the mobilithipmunks and rabbits, which, in my<br />\nment before it decided to put the book<br />\nzation of the entire Campus in an mind, assumed the proportions of<br />\npast<br />\nDuring<br />\nupon a subscription basis.<br />\neffort to secure Burke's reinstate- lions and tigers and elephants in the<br />\nyears, Senior Class dues have been<br />\njungle of feature news, an writing<br />\nment.<br />\nalmost prohibitive for quite a large<br />\nonce<br />\nMeanwhile Columbia University is about it all in a style described<br />\nnumber of the class. These dues have<br />\nby a young lady copy reader as 'quintsilent and Burke is collegeless because<br />\nly impossible.' .. . Nelson Hersh,\" he<br />\nbeen divided between the Hullabaloo<br />\nhe expressed an opinion.<br />\nsays, \"who was then editor of the<br />\nand June Week. There were many—<br />\nSeveral weeks ago, Don Ellinger, Sunday World, sent for me to come<br />\nand there always will be many—to<br />\na senior at Washington University into the little cubbyhole he called his<br />\nwhom June Week offers no excite(St. Louis) wrote letters to freshmen bffice.<br />\nwas<br />\ninterest<br />\nment—whose only<br />\n'Williams,' he began, when I arentering the University in which he<br />\nrived alongside of the big desk, 'there's<br />\nin the Hullabaloo.<br />\nactivities of the some fellow who signs his stuff 0.<br />\nthe<br />\nattacked<br />\nThese men are faced with the probwas a holder of a Henry, writing for the magazines and<br />\nHe<br />\nC.<br />\nT.<br />\n0.<br />\nR.<br />\nlem of whether or not to pay their<br />\nof his tuition. I want to get hold of him. 0. Henry<br />\nhalf<br />\nfor<br />\nscholarship<br />\nget<br />\nthey<br />\ndues,<br />\ntheir<br />\ndues. If they pay<br />\napproximately half its value in re- When his letters were called to the at- is evidently a pen-name and I have<br />\nturn, since they have no intention of tention of the university administra- made a few little passes over the<br />\nphone in an effort to get a line on<br />\ncapitalizing on their June Week privtion, his scholarship was withdrawn. him, as to who he is and where he is,<br />\nileges. And not many undergraduates<br />\nPhillip Monypenny, a graduate but haven't anything that will give<br />\ncan afford to throw away eight or nine<br />\ndollars, even for sentimental reasons. school student at the same university, 'you a lead. He may be here in New<br />\nThe alternative is not to pay any dues circulated letters among all freshmen York, or he may be in Oshkosh mailI want<br />\nat all. But in that case there will be no saying that only \"suckers\" would en- ing his stuff in, but, anyway,<br />\nNew<br />\nin<br />\nis<br />\nhe<br />\nif<br />\nand<br />\nup,<br />\nhim<br />\ndig<br />\nto<br />\nyou<br />\npicture in the Hullabaloo.<br />\nroll in the R. 0. T. C. His $100 schol- York, get him down here where I<br />\nis,<br />\nsituation<br />\nthe<br />\nin<br />\nfactor<br />\nThe third<br />\narship has been withdrawn, it was an- tan have a talk with him.\"<br />\nof course, the University's forced re(Continued on page 3, col. 1)<br />\ntrenchment in the field of undergrad- nounced Saturday by the university.<br /><br />\ndred dollars, and the Hullabaloo funds<br /><br />\nFree Speech<br /><br />\nIn/<br />\ni<br /><br />\nBIGGER AND BETTER TURBINES<br />\nrirHE new 110,000-kilowatt turbine-generator,<br />\nbuilt by General Electric and recently<br />\nplaced in service in the River Rouge plant of<br />\nthe Ford Motor Company, sets several new<br />\nrecords in turbine construction.<br />\nIt is the first large unit in the world to operate<br />\nat 1200 pounds pressure and at 900 Fahrenheit.<br />\nAlthough weighing approximately 2,000,000<br />\npounds, it occupies less than a cubic foot for<br />\neach kilowatt of output. Because of its extremely high efficiency, less than a pound of<br />\ncoal generates a kilowatt-hour.<br />\nThe high-pressure turbine and generator are<br />\nmounted directly above the low-pressure unit.<br />\nSuperheated steam enters the upper unit at 12<br />\npounds and 900 degrees and, after producing<br />\n55,000 kilowatts, flows directly into the lowpressure unit where it produces another 55,000<br />\nkilowatts. This is the first 1200-pound turbine<br />\nin which the steam enters the low-pressure<br />\nstage without reheating.<br />\nCOFFIN FELLOWSHIPS<br />\nHIS fall eight young men will be carrying<br />\non advanced research in seven American<br />\nuniversities under fellowship grants from the<br />\nCharles A. Coffin Foundation. The recipients:<br />\nGeorge E. Boyd, U. of Chicago '33. At<br />\nChicago.<br />\nLyman R. Fink, U. of California '33. At<br />\nCalifornia. Second grant of fellowship.<br />\nAlvin II. Howell, U. of Kansas '29. At<br />\nM.I.T.<br />\nRussell A. Nielsen, Stanford '33. At Stanford.<br /><br />\nT<br /><br />\nRichard W. Porter, U. of Kansas '34. At<br />\nYale. Second grant.<br />\nJulian S. Schwinger, Columbia '36. At<br />\nColumbia.<br />\nChauncey Starr, R.P.I. '32. At Harvard.<br />\nSecond grant.<br />\nHarold G. Vogt, U. of Buffalo '31. At<br />\nHarvard.<br />\nSince 1922,when the General Electric Company<br />\nestablished the Charles A. Coffin Foundation in<br />\nhonor of the Company's first president, 113<br />\nfellowships have been awarded for advanced<br />\nwork in electricity, physics, and physical<br />\nchemistry.<br /><br />\nELECTRIC HEAT FOR SOILLESS<br />\nGARDENS<br />\nCALIFORNIA nurserymen are growing<br />\ntomatoes, strawberries, and sweet peas in<br />\nchemically treated water heated by electricity.<br />\nThe method, developed by Dr. W. F. Gericke,<br />\nof the University of California, has been extended to commercial installations. Tomato<br />\nplants, grown in this way, produced unusually<br />\nhigh-quality tomatoes. The yield was large, and<br />\nthey matured ahead of tomatoes grown in<br />\nsoil.<br />\nNourishment is provided by special chemicals<br />\ndissolved in the water. Because the water temperature must be accurately maintained, a controllable heat source is required, and General<br />\nElectric engineers have supplied heating cable<br />\nand thermostats both for the experimental<br />\ninstallation and for commercial installations<br />\nwhich have followed.<br /><br />\nGENERAL&amp;ELECT<br />\n_ RIC<br />\n`1111/<br /><br />\n•NI<br /><br />\n\"Mir'<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br /><br />\nGrid Captain<br />\nNamed Head<br />\nOf A. A. Board<br />\nhis<br />\nInof<br />\nowlute<br />\nwas<br />\nperoc•ded<br />\nbut<br />\nions<br />\nalid<br />\n.ars<br />\nthe<br />\nin as<br />\ns a<br />\nnalopits<br />\new<br />\n)f a<br />\nand<br />\nunthe<br />\nism<br />\nbig<br />\nt is<br />\ntwo<br />\nmy<br />\nonupious<br /><br />\nces<br />\nthe<br />\ndisto<br />\nling<br />\n',eft<br />\nical<br />\nese<br />\nthe<br />\nprotiler<br />\nthe<br />\nvo-<br /><br />\nGraziano Elected At Thursday Meeting Of Campus<br />\nGroup<br /><br />\nThe class of 1931 will have its<br />\nreunion on October 17, Saturday.<br />\nThe occasion ill be celebrated by a<br />\nparty in the Barn, with beer provided for the ttending members.<br />\nTwonsend Parks, '31, is in charge<br />\nof festivities, and promises a swell<br />\ntime to all those who can attend<br />\nthe reunion.<br /><br />\nBUILD UP ATHLETICS<br /><br />\nZierler Addresses<br />\nCooperation Of A. A. With<br />\nStudent Union's<br />\nHeads Of Sport<br />\nIncreasing Activity<br />\nOpening Meeting<br />\nAt the meeting of the Athletic Asso-<br /><br />\nciation Board held last week, Theodore<br />\nGraziano, captain of the football team,<br />\nwas elected president of the Board of<br />\nGovernors. Other men elected to the<br />\nBoard were Brian Murphy, football<br />\nmanager, secretary-treasurer; Anthony DiPaula, track manager; Pete<br />\nBernheim, soccer captain; and Bill<br />\nMcFeeley as the three members at<br />\nlarge.<br />\nThe Athletic Association Board<br />\nconsisting of the captain and managers of all major sports and one representative from each minor sport<br />\nset up a Board of Governors at the<br />\nbeginning of last year.<br />\nThe reason for cutting down the<br />\nsize of the governing body of the<br />\nAssociation was to assure a more flexible group in which matters may be<br />\ndiscussed more thoroughly than is<br />\npossible with the entire organization<br />\nof eighteen or twenty men. The A.A.<br />\nBoard, however, is still called upon for<br />\nadvice if the situation warrants such.<br /><br />\n:-: LETTERS TO THE EDITOR :-:<br /><br />\nClass of 1931 To<br />\nHold Reunion Saturday<br /><br />\nOutlines Plans For Hopkins<br />\nBranch; Plans Political<br />\nTalks On Campus<br /><br />\nNOTES INACCURACIES IN<br /><br />\nminimum wage law in 1925, Mr. Lan-<br /><br />\nPOLITICAL ARGUMENTS<br /><br />\ndon has made no attempt to \"ofrce\"<br /><br />\nTo the Editor of the \"News-Letter\"-- any substitute legislation. As a matter of fact, he has never even advo-<br /><br />\nSir:<br /><br />\nIn the article on the presidential cated it. Unfortunately, the Repubprinted in the \"News- licans cannot point to his silence on<br /><br />\ncampaign<br /><br />\nLetter\" last Friday under the title, this matter as proof of his devotion<br />\n\"The Man For Our Country,\" there to the spirit of the Constitution. For,<br />\nis a typical example of the omission he went to the wall with his legislaof part of the truth to emphasize a tre for a farm-moratorium act which<br />\nwas later the object of some rather<br />\npoint of doubtful verity.<br />\nSpeaking of President Roosevelt, pointed language during the course<br />\nthe article informs us that \" as Gov- of being thrown out the window by<br />\nernor, he inherited the richest of the the state Supreme Court.<br />\nI'm afraid that I, for one, can<br />\nforty-eight states from Al Smith with<br />\na substantial surplus in the treasury— place very little faith in Mr. Landon's<br />\nand left it with the largest debt New vaunted honesty after his recent<br />\nYork had ever had.\" Since there is no brush over the Administration's Sofurther mention of this matter in the cial Security Act. In the fact of critarticle, the direct implication of this icism of his position, the Governor<br /><br />\nsentence is that the chief cause of the<br />\nAt the first meeting of the Johns deficit was Governor Roosevelt. The<br />\nHopkins chapter of the American economic condition of America at the<br />\nStudent Union, Kenneth Zierler, re- time is serenely ignored in favor of<br /><br />\ncited an unpublished report of the<br />\nTwentieth Century Fund prepared by<br />\n\"some of the most competent men<br /><br />\nin the country in this field.\" The<br />\ntiring chairman, started his belief that placing all the blame on the man who Twentieth Century Fund,\" he added,<br />\nthe winter would see the need for an held the governorship.<br />\n\"is a subsidiary of the 'Filene Found-<br /><br />\nGraduate Committee ReReception Opens Season<br />\nThe Graduate Student Committee inaugurated its 1936-'37 season<br />\nlast Friday, with a reception<br />\nwhich featured a talk by Dean<br />\nEdward W. Berry, of the College<br />\nof Arts and Sciences and a short<br />\nmusical program.<br />\nIt was announced that $2740.00<br />\nhas been collected in the graduate<br />\ncampaign for the University Fund.<br />\nMr. Richard Boys, a graduate<br />\nstudent in the Department of English has been elected chairman of<br />\nthe Graduate Student Committee.<br /><br />\nCivil Engineering<br />\nFaculty Serves On<br />\nNational Projects<br />\nProfessor Thompson Draws<br />\nUp Report On Regulation Of Autos<br /><br />\nAlumni To Hold<br />\nBanquet In New<br />\nYork Friday Eve<br />\nDr. Bowman Scheduled As<br />\nPrincipal Speaker<br />\nFor Occasion<br />\nRECEPTION TO FOLLOW<br />\nSchweitzer, Head, Hhas Revived Eastern Alumni<br />\nGroup<br />\n(Continued from page 1, col. 6)<br />\nthe purposes of the campaign have<br />\nbeen active in preparing for the banquet. The chairman of the banquet<br />\ncommittee is W. Nelson Young; Allan<br />\nM. Mleaveland is vice chairman. Members of the advisory board of the campaign will serve as reception committee of the banquet. They are:<br /><br />\nDuring the past summer, several<br />\nChanning E. Sweitzer, chairman;<br />\nWhen Al Smith left office in 1928 ation,' which had witheld publication members of the Faculty of the Civil Clarence M. •Guggenheimer, Edmund<br />\ndom on the campus, as well as a new the United States was reaching the because of the effect on the Roose- Engineering Department of the Johns C. Lynch, Dorsey Richardson, coand larger strike against war on the climax of a period of extraordinary ec- velt campaign. The Nation of Oct- Hopkins Engineering College were chairmen.<br />\npart of the students.<br />\nonomic prosperity and credit expan- ober 10th sums up its conclusions employed in numerous important unOliver F. Allen, Edward M. Armdertakings of both local and national strong, John R. Bartels, George S.<br />\nIn his talk outlining the past his- sion. State revenues had, for several thus:<br />\n\"Unfortunately for Mr. Landon it nature.<br />\ntory and future plans of this nation- years, been abnormally large, and the<br />\nBrown, Milton S. Erlanger, Sidney C.<br /><br />\norganized defence of academic free-<br /><br />\nwide organization, Zierler, the re- creation of a treasury surplus was no soon developed that (1) there is no<br />\ntiring chairman, addressed a small difficult task. One year after Roose- 'Filene Foundation'; (2) the docugathering of prospective and former velt became Governor of New York, ment was not a report of the Commembers, on the five principle aims America was prostrated by a business mittee on Old Age Security, but a<br />\nof this group, summed up as, peace, depression famous for its severity. preliminary report prepared by a<br /><br />\nProfessor J. Trueman Thompson Erlanger, John H. Finley, Simon Flexwas engaged in drawing up a set of nr, Fabrian Franklin, Walter S. Gifregulations controlling the manufac- ford, John M. Glenn, J. W. Griffin,<br />\nture of commercial motor vehicles. Henry Lanahan, James B. Rather, G.<br />\nHis report will be submitted in De- Canby Robinson, Albert Shaw, Charl<br /><br />\nand State revenues along with private in- member of the research staff . . . cember to the Highway Transport S. Stern, Leo Wolman.<br />\nThe general banquet committee inequality. In addition, he discussed the comes had shrunk to a fraction of yet to be considered by the commit- Committee of the American AssociaImportant matters recently dis- specific nature of this program on the their previous amounts, while the de- tee; (3) a draft of the report had tion of Sate Highway Officials. This cludes all members of the campaign<br />\ncussed were the exact duties of the<br />\ncampus. These would include aolition mand for state aid to the sudden host been given Landon with instructions report is the outgrowth of a similar executive committee as follows:<br />\nmanager, the revision of the constituSidney Adler, George Armstrong,<br />\nof the R. 0. T. C. as an organization of jobless increased hugely. It is no that it was to be considered confi- set of regulations which were pretion, and the necessary requirements<br />\ndential . . . and (4) Governor Lan- sented to the Society of Automotive Jr., John R. Bartels, Raphael A. BenRoosevelt<br />\nmore<br />\nsensible<br />\ndescribe<br />\nto<br />\nfavoring<br />\nand<br />\nattitude<br />\nmilitary<br />\nthe<br />\nfor an award in each sport.<br />\ndon's conclusion are diametrically op- Engineers in a paper entitled \"Leg- dove, Edward C. Billheimer, Walter<br />\nAs a result of the cooperation of the doctrine of preparedness, and the as the chief reason for the existence<br />\nBrecher, Frank G. Breyer, Willard<br />\nA. A. Board with those in charge of whole-hearted acceptance of the Ox- of a deficit in New York State than posed to those contained in the doc- islative Regulations of Motor Vehi- Brown, Carl W. Buchheister, George<br />\nathletics here at the Hopkins, the ath- ford pledge, with the student body it is to blame Hoover for the stock ument he released to the press.<br />\ncles\", compiled by Thomas H. Mac- S. Cattanach, George E. Chinn, Allan<br />\nletic program has been built up<br />\nOn<br />\nthe<br />\nethics<br />\nof<br />\ngiving<br />\nout<br />\na<br />\nconDonald, Chief of the United States M. Cleaveland, Edith S. Currier, Edmarket<br />\ncrash.<br />\nrefusing support to the country in any<br />\ngreatly. They have given every stufidential<br />\nreport<br />\nlittle<br />\nneed<br />\nbe,<br />\nsaid.<br />\nBureau of Public Roads; and Professor ward D. Crouch, Don S. Colt, Jr.,<br />\nnegligence<br />\n.<br />\nward<br />\nto<br />\nobvious<br />\nSuch<br />\ndent a chance to participate in some aggressive war.<br />\nCharles E. Dean,<br />\nIt<br />\nappears<br />\nobvious<br />\nthat<br />\na<br />\nman<br />\nwho<br />\nThompson<br />\nabcase<br />\nanother<br />\nof<br />\nof Johns Hopkins.<br />\nis<br />\nfacts<br />\npertinent<br />\nAs a part of the program to supsport of recreational and healthful<br />\nA. Herbert Fedder, M. Harry FeldThe present regulations involve im- man,<br />\nsport, either varsity or intra-mural. port free academic speech for teachers surd campaign propaganda which may would 'violate a confidence merely beFrank R. Ferlaino, Edward M.<br />\nThe University now has the follow- and school publications, the Union give a serious presidential contest the cause it seemed to further his polit- portant safety features of motor ve- Finesilver, Theodore G. Fischer, Benical ambitions is unworthy of the of- hicle operation which will help to jamin Fleisher, Ernest R. Fleisher,<br />\ning sports putting teams in recog- was determined to prevent any thrott- appearance of a political squabble.<br />\nnized<br />\nintercollegiate<br />\ncompetition: ling of the NEWS LETTER, or of stuI did not intend to criticize unduly fice to which Mr. Landon aspires.\" make commercial vehicle operation Fabius S. Fox, Henry W. Frey, Philfootball lacrosse, basketball, track,<br />\nAs an evidence of spiritual bank- much safer than it is now. In order 'more W. Geoghegan, Dal Ghent, Malthrough state bills either the author of the article from<br />\ntennis, baseball, wrestling, handball, dents and teachers,<br />\ncolm R. Gilpin, Jr., John M. Glenn,<br />\nruptcy,<br />\nthe whole matter is rec- to arrive at definite conclusions, it<br />\nwhich I have quoted or the sources<br />\ngolf, fencing, swimming, cross coun- for teacher's oaths. A program of edEugene W. Greenfield, Morton Gutkin,<br />\ncommended to the attention of in- was necessary for Professor Thomptry, soccer, and rifle.<br />\nucation rofthe students at Hopkins of his information, for, Lord knows,<br />\nDavid Gutman, Robert E. Heyn, G.<br />\nterested moral philosophers.<br />\nson and his staff to make, during the Warfield Hobbs, III, Bernard J. Hoffwas outlined, to bring before them both major parties are equally guilty<br />\nWhat's more I'm still pretty dis- summer, a numer of studies and tests man, Jr., Norman N. Holland, Albert<br />\ndescribe the needs of this type of misleading argument.<br />\nwould<br />\nwho<br />\nmen<br />\nHedgerow Players Feature<br />\nsatisfied with Mr. Landon's labor of the actual operation of motor trucks P. Johnson, J. David Jutkowitz, Wilfor youth action and organization in But for partially nullifying the force<br />\nPlayshop Season Here the orld today. The American Youth of so competent a defense of his presi- stand. As an oil operator he con- and busses on several of the most im- liam R. Kahl, Morris R. Keen, Josef A.<br />\nKindwall.<br />\nsistently maintained the open shop— portant trunk highways in the United<br />\nAct, which is now before Congress, dential choice, he deserves at least a<br />\nOverton H. Klinefelter, M. L. Kruler,<br />\n(Continued from page 1, col. 3)<br />\nIn June, the Kansas Federation of States.<br />\nBernhard Kurrelmeyer, Joseph Levy,<br />\nand a $1.00 evening seat to the Hedge- and provides for aid to students who few words of criticism.<br />\n,Professor Thomas F. Comber, Jr.,<br />\nLabor passed a resolution excoriatJohn C. Lewis, Jr., Lawrence Littrow players production.<br />\n—Sheldon Fuchs<br />\nare dnable to attend college, is conof the Civil Engineering Department,<br />\nman, James R. Lomauro, Thomas P.<br />\ning the Governor for calling out the<br />\nDr. Fagin has published the follow- sidered an integral part of these needs,<br />\nwas employed by the J. E. Greiner<br />\nMagill, J. Hammond Mallery, George<br />\ning announcement.<br />\nmilitia in the Lead and Zinc Workers Co., Consulting<br />\nEngineers of Balti- E. Marley,<br />\nand must e administered by youth<br />\nRobert L. McAll, James<br />\nstrike last year. It's a sorry showing more, as a designing engineer on an<br />\n\"The Playshop has undertaken this<br />\nMR. KEMPTON REPLIES<br />\nand men used to dealing with their<br />\nA. Mitchell, Edward K. Morrison, Alyear something which we feel BalTo the Editor of the \"News-Letter\": to put up against an administration important bridge for the State of Vir- bert M. Musgrove, Jr., Morris Myers,<br />\ntimore playgoers will appreciate. We problems. The present N.Y.A. organwhich was the first to recognize the ginia and also on the bridges and via- William F. Nickel, Jr., Philip E. NutSir:<br />\nare bringing to the Auditorium on ization was ismissed as inadequate,<br />\nducts of the Howard Street Extentle, Sidney Robbin, Joseph F. Rooney,<br />\nI would like to borrow this space right of labor to bargain collectively<br />\nNovember 18, the Hedgerow Theatre and not near enough to the actual<br />\nsion.<br />\nErnest H. Salter, Roger Shaw, Norto congratulate Mr. Fales on his through representatives of its own<br />\nfor two productions. At 4 o'clock on<br />\nMr. F. W. Medaugh, also of the Civil<br />\npulse of young peoples' problems.<br />\nman J. Small, Robert Tynes Smith,<br />\nthat day, the Hedgerow will present<br />\nsincere, balanced, completely honest choosing. Both sides of the present Engineering Department, was enfor<br />\ncampaign<br />\nDuring the coming<br />\nIII, Agnes Snyder, M.Edmund Speare,<br />\n\"The Emporer's New Clothes,\" a<br />\npresentation of the case for Alf AFOL-CIO struggle appreciate this gaged in preparing a code for the Ludwig A. Staib, Jr.<br />\ncharming play for children which the presidentian election, the Union<br />\nLandon. And let me assure him that stand. Men as diametrically opposed Maryland State Health Department<br />\nAlex A. Steinbach, John M. Stewart,<br />\nhas been packing them in as a has voted to sponsor an Assembly of<br />\nas Daniel Tobin and John Lewis are to govern tre design and construction Basil D. Storrs, Hyman Strauss, VerWPA project in New York City for the students on October twenty-sec- such praise is grudgingly given, for<br />\nof same.<br />\nnon E. Stuart, Charles L. Suttles,<br />\nin the forefront of the Roosevelt<br />\nthe past six months.<br />\nMr. Thomas F. Hubard, acted as<br />\nond„ in collaboration with the NEWS- I finished his article with the unChanning E. Sweitzer, Helen H. Tancampaign.<br />\ncomfortable sensation that all was<br />\nIn the evening of the same day, LETTER and the<br />\nAssociate Consultant to the National<br />\nY.M.C.A. At this aszer, Harry King Tootle, George G.<br />\nEven Landon's tax claims seem Resources Committee and under his<br />\nthe Hedgerow will offer \"Getting<br />\nnot<br />\nwell<br />\nwith<br />\nmy<br />\nown<br />\npoor<br />\neffort.<br />\nTrattner, Vladimir S. Veden, Mabel<br />\n'aembly, to be held in Latrobe Hall,<br />\nMarried,\" by George Bernard Shaw,<br />\nAs a matter of sober fact, I should pretty feeble after a little cold analy- supervision a Federal Statistical and L. Walker, Richard L. Waterfall,<br />\nspeakers<br />\nchosen<br />\nbe<br />\nfrom<br />\nwill<br />\nthe<br />\nthere<br />\nwhich the Media (Pa.) organization<br />\nsis. In the \"New Republic\" of June Research Project was conducted for<br />\nCharles E. Waters, Roxie A. Weber,<br />\nfeel pretty flat about the whole thing.<br />\nhas just revived with acclaim in its major parties in the fall elections.<br />\n10th, Morton Taylor write that dur- the Works Progress Administration.<br />\nLeo Wolman, Richard H. Woodward,<br />\nBut,<br />\nbefore<br />\nthe<br />\nproffered<br />\nsunflower<br />\nown little theatre. I believe this will<br />\ning his administration \"there was an<br />\nThe Civil Engineering Department<br />\nIt has been decided to send a repreChurch Yearley, John I Yellott,<br />\nJr.,<br />\nbe the first time the play will be sentative to the meetings of the Balti- is pressed to my shrinking bosom, I increase over the 1932 levy of 21 has had considerable increase in the<br />\nNelson Young.<br />\nJr.,<br />\nW.<br />\nseen in Baltimore, and I know it more 'Council of the American Youth feel called upon to submit some ad- percent for the first year, 28 percent number of graduate students attendIn addition to the speaking promarks the first appearance of the Congress this winter. The states of denda on the gentleman<br />\nfrom Kansas. for the second, and 31 percent for ing its courses. At the present time, gram, the banquet will include a busiHedgerow in the city.<br />\nthe third.\"<br />\ntwo important researches are under<br />\nMaryland, Virginia, Delamare, and<br />\nFirst there are several points to<br />\nness session at which officers for the<br />\n(Continued bottom col 3)<br />\nI hope Mr. Fales doesn't think it way. One has to do with the calibrathe District of Columbia are to send<br />\nensuing year will be elected. A reorsupport the contention that \"Mr.<br />\nunfair for me to introduce this mate- tion of orifces for measuring the flow<br />\ndelegates to a discussion of plans and<br />\nLandon is no coercer.\" I have in rial after previously resting my case. of water and the other with the inves- ganization of the Association, to effurther growth of the Youth Congress<br />\nfect a more complete representation<br />\nat a regional congress to be held in mind his record on civil service. Al- Still and all, I feel that it has some tgation of a new method of designing of alumni in the tri-state area, is<br />\nBaltimore, November 7 and 8, 1936. though there is a civil-service law degree of pertinence in the discus- and constructing deep foundations contemplated. The present officers,<br />\nTo interested students, an invitation on the statute books of Kansas, the sion. And, what's more, if he's in- for bridges.<br />\nbeside Mr. Sweitzer, are: Dr. John<br />\nterested, I have some cold figures on<br />\nto membership was extended, even to<br />\n(Continued from Page 2, Col. 3)<br />\nM. Glenn, vice-president; W. Nelson<br />\nGovernor has not seen fit to \"coerce\"<br />\nmy man, too.<br />\nMr. Williams found 0. Henry and those interested in only one of the the legislature into the appropriaYoung, secretary; Allan M. CleaveGratefully,<br />\nmajor<br />\nUnion.<br />\nStudent<br />\nthe<br />\nof<br />\nissues<br />\nland, treasurer.<br />\nfrom their meeting on the two betion of funds to support it. His enJ. M. Kempton<br />\nNational membership cards are to be<br />\n(Continued from Page 2, Col. 6)<br />\ntirely justified reluctance in this recame good friends. They were alike<br />\navailable shortly, and will be discates as the alternate choice to fasspect<br />\nalso<br />\nshows<br />\nup<br />\nin<br />\nhis<br />\nrecord<br />\nin many ways. Williams, like 0. tributed to those applyin. Dues are<br />\ncism after the New Deal.<br />\non wage legislation. Since the Kan- Sherwood Eddy To Give<br />\nHenry, so the story goes, could re- fifty cents a year, or one dollar, inthis is a book to be studsas Supreme Court voided the state<br />\nMovie Here Thursday Certainly,<br />\nmain \"richly mute for long spaces. clding all publications of the Ameried by those who are sincere in wantStudent Union at no extra cost.<br />\ning a complete picture of this very<br />\nTennyson and Carlyle had no more ican<br />\nThe Shaw play is part of a cele(Continued from Page 1, Col. 2)<br />\n(Continued from Page 1, Col. 4)<br />\nThe day and hour of the next meeting<br />\nbration signalizing the eightieth an- fished recently include \"The Challenge urgent presidential campaign. All and suggested that freshman memeloquently speechless intervals, than<br />\nannounced,<br />\nnot<br />\nsince<br />\nthere w s<br />\nwere<br />\nfair-minded students will want this<br />\nthese two men. Their friendship jog- too small a group present to make any niversary of Shaw's birth. A first of the East,\" \"Religion and Social<br />\nbership be particularly encouraged.<br />\npart<br />\nof this celebration will be staged Justice,\" \"The Supreme Decision,\" sober product of a calm mind.<br />\nSpeakers Each Week<br />\nged along. To each the other simply decisions affecting the entire group.<br />\nat Latrobe Hall on the Hopkins and \"The New Era in Asia.\" In thirty<br />\nFollowing Dr. Harker's short ad'was.\" Perhaps more than any other<br />\ncampus on the evening of November countries of Asia and Europe he SENIOR CLASS TO HOLD<br />\ndress, it was decided that there would<br />\nperson who know 0. Henry, Bill Wil- Students Must File<br />\n9, when George Boas, professor of has worked among students and leadIMPORTANT MEETING<br />\nbe a speaker scheduled for every<br />\nSchedules Before Week Ends<br />\nliams, through a rare sort of inofphilosophy at the Hopkins, will ers in all departments of life, includThursday afternoon, and that all regspeak on \"Shavianism as a Philoso- ing great names and little-known<br />\nfensive silence learned to know his<br />\nThere will be an important meet- ular meetings are to be open to anyphy\", and Hazleton Spencer, associate workers. He brings a story of comone interested enough in the subjects<br />\nAll students must file their<br />\nfriend. And how he got to know him<br />\ning of the Senior Class on Wedprofessor of English, will discuss pelling interest and vivid narrative,<br />\nto attend.<br />\nschedules at the Registrar's ofthrough the hours of 0th talk and<br />\nnesday, October 14, at 12.00 in<br />\n\"Shavianism as Drama and will which will interest all alike, but more<br />\nThe members have decided to hold<br />\nSilence, he records in a gentle, kindly, fice before October 16, 1936.<br />\nillustrate by readings from Shaw's especially students and other youth Latrobe Hall.<br />\ndaily gatherings in the laboratory<br />\nhuman ook.....<br />\nplays.<br />\ngroups.<br />\nduring the lunch period.<br />\nfreedom,<br /><br />\nsecurity,<br /><br />\neducation,<br /><br />\nOn The Literary<br />\nHorizon<br /><br />\nBOOK REVIEW<br /><br />\nRemsen Club Hears<br />\nHarker At Meeting<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 13, 1936<br /><br />\n4<br /><br />\nPi Lams To Guard Hill Andl Dalers Gettysburg Rooters Battle<br />\nJays Decisively Trounced<br />\nIn Touch Hold Time Trial Jay Soccermen Two Extra<br />\nBy Powerful Lehigh Eleven; Crown<br />\nFootball League Over Mile Course<br />\nPeriods Before Winning 3-2<br />\nLose By 20 Point Margin Keen Competition Is ExBe TraSuperior Power Gives Brown<br />\nAnd White Second<br />\nVictory<br />\nJAYS<br /><br />\nFIGHT<br /><br />\nHARD<br /><br />\nPopow, Ellis, And Kahl<br />\nStand Out; Defense<br />\nGood<br /><br />\nGrid Foes Busy<br />\nOver Week End<br />\nOf Hopkins' next three gridiron foes<br />\nonly Washington College survived<br />\nthe week-end encounters with any<br />\ndegree of success. In a hard fought<br /><br />\ngame with the highly touted Upsala<br />\nCollege eleven, Washington, paced by<br />\nThe Blue Jay gridders opened their Young, emerged with a 7-7 tie. Washseason last Saturday with a trounc- ington scored on a pass from<br />\ning at the hands of a strong Lehigh Young to Solter in the first quarter.<br />\neleven at the latter's home field. Upsala managed to tie the game up<br />\nin the second period on a sustained<br />\nThe Bethlehem engineers rolled up<br />\ndrive from midfield to the goal line.<br />\ntwenty points to the Hopkins' 0,<br />\nHaverford, the Jays' rival on Octomaking two additional touchdowns, ber 25th, was forced to bow 46-0 to<br />\nboth of which were nullified because a overwhelmingly powerful Williams<br />\nCollege team. Haverford showed a<br />\nof penalties.<br />\nLehigh had the Jays on the de- totally ineffective offensive as well<br />\nfensive throughout the entire tilt. as a vulnerable defense.<br />\nTwo of the teams to be met later<br />\nThe Hopkins never once threatened<br />\ntheir opponents; from the start the in the season, St. Johns and RanJays were backed up against their dolph-Macon come together on the<br />\nown goal posts and there weren't latters' home field. The Yellow Jackmany times during the afternoon ets, who resisted stubbornly, yielded<br />\nwhen they were out of that situa- to the Johnnies in the third quarter.<br />\ntion.<br />\nLehigh Scores<br />\nDuring the first period the Engineers were twice thwarted in their<br />\nbid for the initial score. But their<br />\nsuperior power could not long be<br />\ndenied; for in the second quarter<br />\nHeller passed to Jamieson down on<br />\nthe Blue Jay eight yard line. From<br />\nthis point Ellstrom, a substitute for<br />\nPeet, crashed over the touchdown<br />\nmarker on two line plunges. Heller<br />\nconverted to make the score 7-0<br />\nLehigh threatened often but was limited to this lone tally during the first<br />\nhalf.<br />\nTwo More For Lehigh<br />\n'Early in the third period Lehigh<br />\nagain moved down to the visitors'<br />\n8 yard line. But the Hopkins' line<br />\nstopped the threatening advance. This<br />\nInspired defensive play went for<br />\nnought, however, for Heller intercepted a Hopkins pass to set the<br />\nstage for another touchdown. Millbank took the ball on a spinner into<br />\nthe line, broke loose, and dashed<br />\nforty yards for the second score.<br />\nHeller again converted.<br />\nThe final tally came in the last<br />\nquarter on a six yard off - tackle<br />\nsmash by Penauchi—the culmination<br />\nof a powerful drive. The game ended<br />\nwith the ball in Lehigh's possession<br />\non the Hopkins' 10 yard line.<br />\nJays' Defense Good<br />\nHopkins play was not completely<br />\nlacking in brilliancy. During the<br />\ncourse of the contest the line demonstrated remarkable ability to tighten<br />\nup in the clutches. Despite the<br />\nfact that Lehigh was far superior<br />\nboth in weight and offensive prowess, the Blue Jay linesmen, led by<br />\ntackles Popow and Ellis, showed up<br />\nvery well. More than a few times the<br />\nLehigh backs were forced to fumble<br />\nand thrown for heavy losses. The<br />\nHopkins boys played hard and tackled hard. Their defense was just<br />\nabout as good as their opponents'.<br />\nBut with the ball in their possession<br />\nthey could do nothing. Kahl was<br />\nabout the most effective runner in<br />\nthe backfield. Only one pass was<br />\ncompleted, and that for no gain.<br />\nHopkins Needs Drilling<br />\nThe Jays did as well as could be<br />\nexpected in an opening contest with<br />\nthe limited practice they had had.<br />\nPitted against an eleven which surpassed them in weight, training, experience, and reserve power, they<br />\nput up a gallant fight. Lehigh was<br />\nadmittedly \"out of their class\"—before the game; but after sixty minutes of play there were many who<br />\nfelt that with a little more preliminary training and a better drilled<br />\nbackfield the tale would have been<br />\nentirely different.<br />\nThe line-up:<br />\nLehigh<br />\nJohns Hopkins<br />\nHoppock<br />\nLE<br />\nBaetjer<br />\nRozella<br />\nL.T<br />\nPopow<br />\nBayer<br />\nL.G<br />\nDay<br />\nFamighetti<br />\nC<br />\nRoyster<br />\nKirkpatrick<br />\nHopkins<br />\nR.G<br />\nSterngold<br />\nR.T<br />\nEllis<br />\nWalton<br />\nR.E<br />\nVickers<br />\nPeet<br />\nQ.B<br />\nGraziano<br />\nMillbank<br />\nL.H<br />\nWard<br />\nWertz<br />\nR.H<br />\nVincenti<br />\nPennauchi<br />\nF.B<br />\nKahl<br />\nScore by periods:<br />\n00000<br />\nJohns Hopkins<br />\n0 7 7 6--20<br />\nLehigh<br />\nTouchdowns: Lehigh— Ellstrom<br />\n(substitute for Peet.) Milbanks, Pennauchi. Points after touchdown—Heller' (2) (substitute for Wertz.)<br /><br />\nSOCCER SCHEDULE<br />\nPlace<br />\nOpponent<br />\nDate<br />\nOct. 17—Salisbury Teach.—Home<br />\nOct. 24—Maryland—Reading<br />\nOct. 27—State Teachers—Towson<br />\nOct. 31—State Teachers—Home<br />\nNov. 7—Maryland—Pending<br />\nNov. 14—Salisbury Teach.—Away<br />\nNov. 18—Army—Away<br />\nDec. 5--Western Maryland—Home<br /><br />\npected From The<br />\nFraternity Teams<br />\nWith play starting today in the<br />\nfraternity touch football league, Pi<br />\nLambda Phi will defend its championship. Phi Psi, Omicron Kappa<br />\nOmicron, Phi Sigma Delta and Sigma Phi Epsilon will provide opposition.<br />\nThis league is part of the intramural program, and each fraternity<br />\nis represented. There will be two<br />\ndivisions, eight teams in each. Seven<br />\ngames will be played by each entry.<br />\nOn the Tuesday preceeding the<br />\nThanksgiving holidays activities will<br />\nreach a climax. All sixteen teams<br />\nare to play on that date on the regular football field and the one beside<br />\nLevering Hall. After Thanksgiving there is scheduled a play off between the winners of each division.<br />\nA plaque will be awarded to the victorious fraters. Also points per contest will go towards the winning of<br />\nthe Turbyville trophy.<br />\nReferees Chosen<br />\nAt a meting of the Fraternity Athletic Council held last Wednesday,<br />\nplans for the year were discussed.<br />\nBesides this, rules were approved<br />\nand referees and supervisors appointed.<br />\nTouch football is the same as the<br />\nregulation game except in a few<br />\nrespects. Only seven men compose a<br />\nteam and five downs are allowed<br />\nin an attempt for a touchdown. The<br />\ntime of the game is 40 minutes,<br />\nplayed in two halves. Minor changes<br />\nfrom varsity football restrict the<br />\ndangers of the game.<br /><br />\nRegular Course To<br />\nversed This Week For<br />\nFirst Time<br /><br />\nThe Jay cross country men are<br /><br />\nHambleton Holds<br />\nFall Track Drills<br /><br />\nVO<br /><br />\nBlue Booters Drop Season<br />\nOpener After Long<br />\nStruggle<br /><br />\nThe Johns Hopkins soccer team<br />\nFall track practice is now getting<br />\nits first encounter of the sealost<br />\nCoach Hambleton held the first time<br />\nunder way. Veterans and candidates son to a more experienced fast boottrials Friday afternoon, October 9.<br />\nalike are working off their leg and ing Gettysburg team by a score of<br />\nThe distance covered was only cne<br />\narm kinks. Two old timers, Dugan 3-2 at Gettysburg, Saturday. The<br />\nmile, but was certainly an acid test<br />\nopened the fray<br />\nand Johnson, are back in spikes and Blue Jay booters<br />\nconsidering the tough hill in back<br />\nwith an offensive play which yielded<br />\nseem to be in good condition. Gebethem a score in the first three minof Wyman Park. The competitive<br />\nlein, the 220 and 440 streak, was in- utes of the game.<br />\nrun is usually between four and five<br />\njured this past summer, but he is<br />\nScore Tied<br />\nmiles, and the hill and dalers should<br />\nThe game opened in the third<br />\nback on the cinder path showing<br />\nbe ready for it in a week or so.<br />\nquarter with the Gettysburg booters<br />\nform and speed.<br />\nMany berths are still vacant, and<br />\nscoring on a free kick awarded<br />\nGilman's loss was Hopkin's gain<br />\nthem on a foul by Hartke. FollowCoach Hambleton urges all sturdy,<br />\nwhen Donovan graduated. The new- ing a series of passes the booters<br />\nlong-winded men to report for praccomer takes both the low and high' from the Keystone State succeeded<br />\ntice any afternoon at four. The workhurdles in good time and looks very in edging out the Blue Jays by hangouts will help those who are going<br />\nthird<br />\npromising, as does Carlton and the ing up another tally as the<br />\nout for winter sports to get in shape.<br />\nclose.<br />\na<br />\nto<br />\ncame<br />\nquarter<br />\nNew Jersey high hurdler, Belcher.<br />\nRetaliating in the last quarter, the<br />\nThe first obstacle is Lehigh Uni- In the field events, we find Zheutbooters came out with a ralHopkins<br />\nversity, and it ought to be a close lin again throwing the discus and<br />\nlying series of fast and furious punts,<br />\nshot.<br />\nthe<br />\nputting<br />\nand interesting meet. Our team is<br />\nHartke<br />\nThose who are interested in learn- and on a corner kick from<br />\nhost, and the date is October 14.<br />\ning the technique in field events, Phillips drove the ball into the net<br />\nperiod<br />\nhurdling, or running should report to tie the score. The first extra<br />\nboth<br />\nfor<br />\nunavailing<br />\nbe<br />\nto<br />\nproved<br />\nHANDBALL NOTICE<br />\nfield.<br />\nthe<br />\nat<br />\nnow to Coach Hambleton<br />\nThere is no official practice, and you teams.<br />\nIn the second extra period under<br />\nA handball tournament, open to may come out two or three times a<br />\na barrage of boots, the Pennsylvanians<br />\nmen<br />\nshould<br />\nfast,<br />\nrangy<br />\nTall,<br />\nweek.<br />\nall Hopkins students will begin on<br />\nsank the winning goal.<br />\ncertainly report.<br />\nthe first of November. All men internow beginning to hit their stride.<br /><br />\nested in participating are asked to<br />\nto apply at once to Manager Red<br /><br />\nJ. H. FURST CO.<br /><br />\nGlanz, Box 333, for a place on the<br /><br />\nPrinters of<br /><br />\nladder. The finalists and semi-finalists will be awarded medals and posi-<br /><br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nJo<br />\nrno<br />\ncan<br />\nsuit<br />\npoi<br />\nthe<br />\nto<br />\ndue<br />\nHo<br /><br />\nWillie Hugh Laundry<br /><br />\nAl<br /><br />\nSpecial Prices For Hopkins Men<br />\n2815 GREENMOUNT AVE.<br /><br />\nopi<br /><br />\nCHesapeake 5474<br /><br />\nthe<br /><br />\ntions on the varsity handball team.<br /><br />\nHo<br /><br />\n•<br /><br />\nwit<br />\nV<br /><br />\nV<br /><br />\nvot<br />\nne<br />\nUs<br /><br />\nare<br /><br />\n614<br />\nIt's a Light Smoke!<br /><br />\nfor<br /><br />\nult<br /><br />\nfor<br /><br />\nun<br />\na<br /><br />\nNE<br /><br />\nar<br /><br />\nbe<br /><br />\nre<br /><br />\nTo feel good after smoking —<br />\nIt's not just the pleasure a fellow gets out ot<br />\nsmoking Lucky Strikes...it's feeling good after<br />\nsmoking! Fresh as a daisy. A clean taste in<br />\nyour mouth. And when you start singing in<br />\nyour bath—your voice clear as a bell! That's<br />\nthe great thing about a light smoke. Lucky<br />\nStrikes—being made from the finest centerleaftobaccos —tastegood. And because they're<br />\na light smoke, you feel good smoking them.<br />\nAnd after smoking them, too!<br /><br />\n* * NEWS FLASH! * *<br />\n\"Sweepstakes\" bring pleasure<br />\nto war veterans<br /><br />\nA LIGHT SMOKE<br /><br />\n•<br /><br />\nLEAVES A<br />\nCLEAN TASTE<br />\nA clean taste—a clear<br />\nthroat—what a joy<br />\nwhen you wake up in<br />\nthe morning! You'll be<br />\nthankful that last evening you chose a Lit<br />\nsmoke —Luckies.<br /><br />\nOF RICH, RIPE-BODIED<br />\nCopyright 1930. The American Tobacco Company<br /><br />\nFrom a veterans'home in Legion,Texas,<br />\na number ofentries allin the same handwriting come in each week. Of course<br />\nwe checked up to make sure that the<br />\nentries conformed to the rules,and one<br />\nofthe men explained:\"Most of the boys<br />\ncan't get around—but I do and so I fill<br />\nout their cards for them.\"<br />\nWe're glad to say that the boys have<br />\nbeen pretty good pickers,too.<br />\nHave you entered yet? Have you won<br />\nyour delicious Lucky Strikes? Tune in<br />\n\"Your Hit Parade\" — Wednesday and<br />\nSaturday evenings. Listen, judge, and<br />\ncompare the tunes—then try Your<br />\nLucky Strike \"Sweepstakes.\" And if<br />\nyou're not alreadysmoking Luckies,buy<br />\na pack today and try them, too. Maybe<br />\nyou've been missing something. You'll<br />\nappreciate the advantages ofLuckies—a<br />\nLightSmoke ofticb,tipe-bodied tobacco.<br /><br />\nTOBACCO — \"IT'S TO.A6TED\"<br /><br />\nci<br /><br />\nL.<br /><br />\na4<br /><br />\ntl<br /><br />"}], "field_media_file": [{"target_id": 39032, "display": null, "description": null, "target_type": "file", "target_uuid": "87097506-5b0f-48a9-ab21-01842a71b5c0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12708-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12708, "target_type": "node", "target_uuid": "15b46b50-67d7-40b3-8534-e4a52c29c882", "url": "/node/12708"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2c91e6cf-15d5-4734-bb43-ffd422543daa"}]}