{"mid": [{"value": 40329}], "uuid": [{"value": "6388b45f-36a8-43aa-bec6-ef8448a83cdb"}], "vid": [{"value": 40329}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:03:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14357-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:03:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:03:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Dr. Merman<br />\nfired!!!!<br />\nMuller calls<br />\ntwo friends<br />\n\"Mr. Warmth\"<br />\nAND<br />\nChucky Baby<br />\nAs a result of the Friday News-Letter's published poll,<br />\nwhich revealed student disfavor with Dr. Dierman by a<br />\nthree to one margin, the aged bureaucrat has been<br />\ndismissed. Never people to waste any time, the<br />\nAdministration brought to Baltimore yesterday two<br />\nprospective replacements, Donald Rickles and Chuck<br />\nBarris. The News-Letter was lucky enough to snare both<br />\nof these distinguished celebrities for quick interviews.<br />\nFirst, Mr. Warmth himself, Don Rickles. Ric kles,: All<br />\nright, you hockey puck, let's get on with it. r 'gotta go<br />\ndown to Annapolis andr stick needles into MArvin's head<br />\nand see if I get any reaction.<br />\nN-L$ Well, what do you think of Johns Hopkins?<br />\nRickles: I was here once before. I spent a week here one<br />\nnight. Muller lied to me. He didn't tell me this place is in<br />\nHarpp den. I think Al Capp already turned the job down.<br />\nif! 'wanted this kind of action, I could have auditioned<br />\nfor the travelling company of \"Tobacco Road.\"<br />\nN-L: You don't like this place very much, do you?<br />\nAdams portabie Jokefile for $28.50. Everyone in the<br />\nicklesl They gave me a trial run this morning. 8 pre-med<br />\nbusiness has •one. Joey has not worked clubs in<br />\ncame in. I won't tell you what his nationality W2,but he<br />\ntwenty-five years. He st5nds on the corner of Hollywood<br />\noffered me a television set as a bribe. He asked me when<br />\nand Vine and he peddles the fakoktah book.<br />\nhe could go to med school. I told him to finish the bridge<br />\n-L1 What's that?.<br />\nfirst. I gave him a rice cookie and some raw fish. And he<br />\nRickles: Fakoktah? It's an Indonesian word Jerry Lewis<br />\nwent away.<br />\nuses a lot. And look where he is now. He works only one<br />\nN-L: You sound very hostile.<br />\nday a year -- Labor Day. And the rest 4f the tune he sits<br />\nRicklesl You're Hungarian aren't you Casmir. Where did<br />\nin The Brown Derby going,\"I'm a big star. Ask Dean.\"<br />\nyou steal the tape recorder? No,6 kid. Hungarians are my N-L: In France they •consider Lewis a genius.<br />\nRicklesl Well, insurance , they stomp on kitty litter to<br />\nfavorite people. I t8lked to Brezhnev this morning and the<br />\nIankL, are in your mother's living room right now.<br />\nmake wine. But 6 tell you this lang, 6 took this job at<br />\nN-L: Actually, I'm not a Bohunk (laughs). I'm really a<br />\nHopkins for one reason. zo make enough money to join<br />\nSlovak. Rickles: What? That's better?<br />\nthe rest of my family in Argentina.<br />\nN-L: Did you talk to Steve Muller today?<br />\nN-Lo What's yourr predecessor Dr. Dierman doing nog?<br />\nRickles: A morning with Steve Muller is like watching a<br />\nRickles: He's explaining to the tribunal he was just<br />\ncasket warp.<br />\nfollowing orders.<br />\nN-L: So why did you come all the way from the coast to<br />\nN-L: Who else have you met at Hopkins?<br />\n•see him?<br />\nRickles: I met that meatball, Chris Colombo. He's a good<br />\nRickles: I'm so lonely.<br />\nfriend of my manager, Jo Scandori. They both came<br />\nN-L: Lonely?<br />\nover on the sa e oil slick.<br />\nRicklesl They cancelled my show. I can't hang out with<br />\nN-L Mr.Rickles , I just don't think you're right for this<br />\nthe sailors apymore. My wife's getting scared. She thinks job.<br />\nrni going,. to. bother her again. Last time I did, she said,<br />\n\"Pillows, get your pillows.\"<br />\n'All right but it's going to cost you.\"<br />\nN-L: Hey that's a good one.<br />\nRickles: Where does it say the wimp from Jersey gets a<br />\nRI kles: f you like that one, yo-yo, I can show you<br />\nlaugh? What do you know? After graduation, y u re going<br />\nwhere I get the rest of my material. It's from the Joey<br />\nback to your job in Tiajuana at the bullring going<br />\n\"Pillows, get your pillows!\"<br />\nN-L: What does that line mean?<br />\nRickles: How should I know, goulash breath? It gets laughs<br />\nin Vegas.<br />\nN-L: What is your conception of the job of advising and<br />\ncounseling?<br />\nRicklesl Make sure only my people get into med school.<br />\nIt's as simple as that.<br />\nN-L: Thank you Mr. Rickles.<br />\nRicklesl My pleasure. You've been a beautiful audience.<br />\nOrdinarily I don't accept ,mercy bookings but 1, enjoyed<br />\nit. God love you.<br />\nThe second candidate for the post of Director of<br />\nAdvising and Counseling is the star of The Gong Show,<br />\nthe incredible Mr. Chuck Barris.<br />\nN-L: Chuck, what do you think of Johns Hopkins?<br />\nBarris: Oh! 0!! REALLY like that guy! But, then again, I<br />\nlike bubonic plague.<br />\nN-L: But seriously, Chuck, what changes do you plan to<br />\nmake if you are named to replace Fred Dierman?.<br />\nBarris: There are so many things that have to be done if<br />\nour school is to win a respectable audience share of<br />\napplications and contributions. But the admissions<br />\nprocess is what really determines whether you have a hit<br />\nor a turkey on your hands. Now what I've proposed to El<br />\n<br />\nPresidente is this. Stevie Baby, I said, we set up a,<br />\nthree-member celebrity admissions panel and each student<br />\nact will be auditioned and ranked from ()lie to ten-unless, after fo 45 seconds, any member of the panel<br />\ndecides that the student has no talent.<br />\nN-L: What happens then?<br />\nBarris: Hah Hah! That's when you get the old gongeroo!<br />\nIf all three panelists hate the candidate, he or she can set<br />\ngang-gonged!<br />\nN-L: Isn't that a bit cruel?<br />\nBarris: Maybe, but that's the way things go on the ol'<br />\nGong Show, and after I take over that's the way it will be<br />\nhere on the ol' Hop Show.<br />\nN-L: How often do you anticipate using the gong?<br />\nBarris: Well, every day on tee wee coast to coast we have<br />\na turkey to talent ratio of 5 to 2. I think the admissions<br />\ngame will be run along similar lines. The ol' gong will be<br />\ngetting a good workout. But that's what our audience<br />\nlikes.<br />\nN-L: Do you plan to televise these proceedings?<br />\nBarris: You bet your bong we do! I'm in business. I call it<br />\nthe \"open admissions\" game. I've taken every function of<br />\nlife and put it on the tube. I created the Dating Game, the<br />\nNewlywed Game, I gave George Carlin the idea for the<br />\nDivorce Game. Why not the Admissions Game? If it click<br />\nwe put the Med School Game on as a mid-season spin-off<br />\nreplacement.<br />\n-L: And all the action starts right here at homewood?<br />\nBarris: Absolutely! From Baltimore, almost live.<br />\nN-L: What band are you going to use to add to the fun? B<br />\nBarris: The Hopkins Band, of course. They're just as bad<br />\nas Mil,ton DeLugg and his Band With A Thug and they<br />\nwork cheaper.<br />\nN-L: What kind of panelists will uou use on the show?<br />\nBarris: Local people with no talent and no brains. Maybe<br />\nVince Bagli, Wally Orlinsky, and Barbara Mikulski to<br />\nstart.<br />\nN-L: There's more to your job than admissions, In fact, in<br />\nthe past, admissions did not even come under your<br />\nposition. You're supposed to be advising and counseling.<br />\nBarris: Well, I did advise one former News-Letter editor<br />\nwho thinks he can write. Bob, I said, there's a bus leaving<br />\nfor Missouri in five minutes. Be under it. Actually, the job<br />\nis what I want it to.be.When you're as big in the business<br />\nas I am, you write you own ticket. Then you take it to<br />\nJudge Hardy to have it fixed. But that's before your time.<br />\nN-L: Thank you, Chuck.<br />\nBarris: Well, this can't be the end. I have so much more to<br />\nsay. Did you know I wrot \"Palisades Park\" for Freddie<br />\nBoom Boom Cannon in 1962? Did you know I wrote<br />\nbestselling nowel, You and Me, Babe...<br />\n(The man with the net leads Mr. Barris away.)to come<br />\n<br />\n\fpage 2/news-letter/may 3, 1977<br />\nThe final Young Damocrats meeting of the 76-77 academic year<br />\nwill be held on Tuesday, May 3, at<br />\n7:00 pm in Conference Room A.Please try to attend.<br />\n<br />\nNotes<br />\nfor<br />\n<br />\nSummer Language Institute offering intensive Greek, Latin,<br />\nFrench, and German — May 31 - July 22. Deadline extended to<br />\nMay 7. Applications available in Classics Dept. 121 Gilman Hall.<br />\nFor information call J. S. Clay, 338-7560 or 235-5871.<br />\nThe Junior Class would like to express its thanks to those who<br />\nworked long, hot hours during the Spring Fair at the class Taco<br />\nBooth. A special thanks to Taco Bueno and Rogers House.<br />\nThis year's final meeting of the Hopkins Christian Fellowship.<br />\nwill be this Thursday May 5 at 7:00 .pm in the Great Hall in<br />\nLevering. Debbie and Otis Stroup will be our special guests, giving<br />\na musical (piano and voice) presentation of the Gospel.<br />\nRefreshments will be served. All are welcome to come and enjoy<br />\nthe music.<br />\nThe Blue Key Society, in conjunction with the Admissions<br />\nOffice, will be offering summer tours for prospective students and.<br />\nother interested persons. If you are planning to be in Baltimore<br />\nfor the summer (or part of it) and would like to give tours of the<br />\nHomewood campus, please contact Cindy Simon at Box 784 or at<br />\n825-0483 and leave your name, box, and phone number. All<br />\nHopkins undergraduates are invited to participate.<br />\n<br />\n-nico<br />\n<br />\nThe International Studies Forum will hold a last vital, but<br />\nshort, meeting of the year today at 7 pm in Gilman 42. The only<br />\nbusiness will be elections of next year's officers.<br />\nATTENTION!!! The Junior Class would like to announce that<br />\ntickets for the Dinner Dance on the Chesapeake are on sale at the<br />\n'Union Desk for the low price of $25.00/couple. Free champagne<br />\nfor all.<br />\n<br />\ngoats<br />\n<br />\nAttention Sophomores: There will be a meeting in the Dorm<br />\nSocial Lounge on Saturday, May 7 at 11:00 am to discuss next<br />\nyear's activities. Anyone interested in planning movies, a brunch, a<br />\nsemiformal or any new ideas for our junior year is welcome.<br />\n<br />\nThe JHU Gay Caucus will hold its last meeting of this academic<br />\nyear tomight, Tuesday May 3, at 8:30 pm in Conf. Rm. A.<br />\nMambers should remember the BGA dance, May 14 at the Alcazar<br />\nBallroom. For more information, call 366-0488. After May 15,<br />\nthe phone number for the Caucus will be 243-4435.<br />\n<br />\nSeniors— Be sur to stay in Baltimore for Commencement Week!<br />\nKeep checking yourGilman mail box for information concerning<br />\nthe week of events. Note reservation deadlines — no dinner-dance<br />\nreservations after May 12. Tickets for the Bull Roast go up to<br />\n$4.00 after May 18. For more information call 366-7188.<br />\n<br />\n• Doc Hepsburger — You have not claimed your prize yet! What<br />\nhappened? Send word to the Gatehouse by Wednesday,4 May, or<br />\ncome by today at 5:30. Otherwise, the price will be donMed to<br />\nthe Little Sisters of Dundalk Mission.<br />\n<br />\nThe G. Wilson Shaffer Award will be given May 7 at the Navy<br />\nlax game. Forms are available at the gym office for nominating<br />\nnon-varsity graduating seniors for this covetted scholar-athlete<br />\naward. For details calls 243-2305.<br />\n<br />\nSigma Nu today announced the results of the Red Cross Blood<br />\nDrive Competition. Blood-letting was led by sponsor Sigma Nu,<br />\nfollowed by the Dry Tep contingent. The mid-April contest was<br />\nbased on the percentage of student organization members who<br />\ndonated blood. In a serious vein, Sigma Nu thanks all participants.<br />\n<br />\nThe Office of the Chaplain and the Young Democrats will<br />\npresent \"the Testimony\", a film which will convince you to<br />\nBoycott J.P. Stevens Products, on Thursday April 28 at noon in<br />\nthe xreat Hall. We urge everyone to see this film.<br />\n<br />\nThe Board of Intramural Athletics is seeking new members.<br />\nForms are available at the gym office. Deadline—tomorrow.<br />\nInterviews—Thursday. For details, call Tom at 243-2305.<br />\n<br />\nThe new Palantir is out! At the Union Desk now. Our best issue<br />\never. Special student price. Buy the first issue at the Hopsfa carrell<br />\nweekdays at noon.<br />\n<br />\nBig nukes cause big pain for big powers<br />\nBy KATHLEENTROY<br />\nthe problem and not just its frequent recurrances.<br />\nThe problem of nuclear proliferation is erupting again.<br />\nThere are two situations in which the threat of nuclear<br />\nThe spread of nuclear weapons is not a new disease, but<br />\nwar would be averted with almost complete ceit inty; in<br />\nhas been festering since we demonarated the superiority<br />\nthe first instance, if not one country an, earth possessed<br />\nof American nuclear technology in 1945/There have been<br />\nan atomic bomb (unfortunately fear and 'progress' would<br />\nnumerous futile attempts at limiting •the number of'<br />\ncountries that share the distinction of wielding massive<br />\ndestructive power as well as causing atmospheric<br />\ncontamination in the event of war. It is with a noble heart<br />\nthat the United States and other signers of the 1967<br />\nTreaty for the Non-Proliferation of Nuclear Arms, are<br />\nwilling to take full responsibility for deciding this issue for,<br />\nthe rest of the countries of the world. The question at this<br />\ndate is not who shall possess a bomb, but why should the<br />\nU.S., under the provisions of President Carter's new<br />\nproposals to Congress, impose ineffective sanctions on<br />\nother countries that choose to sell nuclear technology?<br />\nThe President's newest proposals would give him the<br />\npower to sanction countries that do not comply with U.S.'<br />\nguidelines on dissemination (by with-holding fuel for<br />\nnuclear reactors). But the fact that West Germany and<br />\nFrance among others do not agree with Carter poses<br />\nseveral problems. These countries argue that the sale of<br />\nnuclear reactors and reprocessing plants is a major<br />\nelement of their present and future export trade<br />\nConsidering this position, .Carter should rpore carefully<br />\nweigh the effectiveness of his approach to the problem of<br />\nnuclear proliferation.<br />\nIt is a fact that many nations desire the knowledge and<br />\nmeans to produce nuclear weapons and it is also true that<br />\nwe cannot prevent these countries from acquiring the<br />\nbomb in the future. One by one, technicians in<br />\nunderdeveloped countries are discovering the secrets of<br />\nthe atom for themselves and with or without our<br />\napproval, me numner ot nuclear powers will continue to<br />\ngrow. Simply stalling the rate at which nations arel<br />\nacquiring the bomb does not solve the problem. The \"Say the secret woid and win anatom boilib.<br />\npossibility of atomic warfare is a recurring nightmare that,<br />\nmust be realistically dealt with; if Jimmy Carter wants to<br />\nsomething you see everyday<br />\nfree us of this spectre, he must attack the roots of<br />\n<br />\n--)<br />\n<br />\n,<br />\n<br />\n(<br />\n<br />\n.<br />\n<br />\n‘<br />\n<br />\n,<br />\n.1.><br />\n<br />\nP<br />\n<br />\n*<br />\n•<br />\nir<br />\n•f 1 v<br />\n//•ff<br />\n<br />\n4<br />\n<br />\n74<br />\n<br />\n1<br />\n<br />\nq ?,f461<br />\n<br />\n,<br />\n<br />\n-4\\114<br />\n<br />\n,<br />\n•„<br />\n<br />\nnot allow us to return to this ideal) and secondly, if every<br />\nnation had the bomb. Before the horror of this possibility<br />\nclouds the rational thought process, consider what a<br />\npowerful deterent the universal possession of the bomb<br />\nwould be. Any nation that would dare to employ the<br />\nbomb against any other would be guaranteed total<br />\ndestruction. Actually, the idea is not as ridiculous as it<br />\nfirst appears, the mutual knowledge that both the U.S.<br />\nand the U.S.S.R.. wield weapons powerful enough to<br />\nannihalate tifeir populations, cities, in 1-rort everything of<br />\nvalue, has kept them from ever using them. (Or should<br />\nwe attribute our restraint to our more 'civilized' nature?)<br />\nThere is every reason to believe another nation faced with<br />\nthe consequences of nuclear war would as well be<br />\ndeterred. It is only the case in whic imbalance exists that<br />\na leader would be tempted to use the bomb.<br />\nBut however unlikely the first scenario may be and as<br />\nimminent as is the second, the point is that President<br />\nCarter undoubtedly harbors good intentions in trying to<br />\navert nuclear war by calling for agreement on<br />\nnon-proliferation, but his methods are doomed to failure.<br />\nHis choice of \"the establishment of common international<br />\nsanctions\" will not only fail to prevent the spread of<br />\nnuclear capability, but as he admits, it will 'adversely<br />\naffect certain allies whose cooperation is needed if we re<br />\nto achieve our ultimate obtctive of non-proliferation.\"<br />\nOstensibly, Mr. Carter is wL.1ng to risk the animosity of<br />\nour allies so that he can achieve his goal of short-term<br />\nnon-proliferation.<br />\nThose not possessing the bomb want it and whether<br />\nthey develop it themselves or acquire the technology<br />\nelsewhere does not matter; the result will be the same.<br />\nNon-proliferation does not dissolve the spectre of nuclear<br />\nholocaust, it only defines who will have the honor of<br />\ntaking art in the deadly game. Nobody wants a nuclear<br />\nwar, but sanctioning those countries, often our West<br />\n;propean allies that choose not to abide by our policy of<br />\nton-proliferation, is not only failing to stop the spread<br />\nf- -.nuclear capability, but is also creating avoidable<br />\nresentment and strain in our relations.<br />\n<br />\n,•'.<br />\n,<br />\ni<br />\n<br />\nI.<br />\n4,.\\<br />\n<br />\nny<br />\n<br />\n(I<br />\n<br />\nN<br />\n<br />\n•<br />\n<br />\n1.....1,0 °,,v.„,r<br />\nth<br />\n<br />\n\fmay 3, 1977/news-letter/page 3<br />\n<br />\nForeign language requirement to return?<br />\nBy'GAYLE COHEN<br />\nAll Bachelor of Arts degree candidates could be<br />\nrequired to study a foreign language through the<br />\nintertnediate,level, according to a proposal,. the Academic<br />\nCouncil will consider tomorrow night—The proposal,<br />\nwhich informed sources predict will almost certainly pass,<br />\nmay be the first step in a series of course requirement<br />\nchanges.<br />\n\"There are clearly a number of things about the<br />\ncurriculum that we are interested in looking into. There<br />\nshould be a coupling of this requirement with a concerted<br />\nlook at the general goals of the education of<br />\nundergraduates,\" Dean of Undergraduate and Graduate<br />\nStudies Sigmund R. Suskind said. Ther proposal was<br />\nsubmitted by the Committee on Underbraduate Studies in<br />\nresponse to faoulty complaints of student illiteracy. CUS<br />\nis a subcommittee of the Academic Council which is<br />\ncomposed of five faculty and four student<br />\nmembers. \"We are constantly getting complaints from<br />\nfaculty members that students cannot write papers and<br />\nthat they c annot sit in a class and communicate their<br />\nideas clearly,\" said CUS member Charles<br />\nHenderson.<br />\nThe University dropped its foreign language<br />\nrequirement in 1968, leaving the establishment of<br />\nlanguage requirements to individual academic<br />\ndepartments. CUS member Alfredo Holt would like to<br />\nsee this arrangement maintained. \"I would prefer to have<br />\nit as it is now, wher the departments themselves set the<br />\nrequirements. I have doubts about the proposal. Certain<br />\ndisciplines do not demand it.\" He cited American political<br />\nsciences as an area that does not require knowledge of a<br />\n<br />\nforeign language, and mentioned that some students, such<br />\nas history of art majors, need only a specialized<br />\nvocabulary.<br />\nThe department of political economy<br />\nbecame the most recent department to omit compulsory<br />\nlanguage study when it dropped the language requirement<br />\nfor economics majors this year. \"We felt that a foreign<br />\nlanguage was not really required for undergraduate study.<br />\nThe main articles in basic theory are written in English,\"<br />\nDepartment Chairman Peter Newman said. He said he<br />\nwould perfer not to use his department to enforce a<br />\nlanguage requirement, granting the imposition of such a<br />\nrequirement to the University.<br />\nCharles Henderson, who<br />\nvoted in favor of the mandatory language study, said, \"I<br />\ndon't think it's unreasonable that students should be<br />\nconversant in a foreign language.\" He suggested that<br />\nadvisors from individual departments direct students to<br />\nenroll in non-required, but useful, courses.<br />\n\"I was<br />\nunder the general impression that neither the English or<br />\nWriting Seminars department was prepared to undertake a<br />\nlanguage skills development program, but I'd like to see a<br />\nbasic writing course/offered.\" He mentioned that by<br />\nstudying a foreign language, students will learn at least the<br />\nrudiments of grammar.<br />\nNo Guidelines<br />\nAs submitted to the Academic<br />\nCouncil, the CUS proposal lacks clear administrative<br />\nguidelines. It has no provisions for exempting students<br />\nthrough their performance on tests. It also fails to take<br />\ninto account possible growth in the language departments<br />\nand- increased use of language laboratory facilities.<br />\n<br />\nLimits planned for Hopkins- Peabody co-op<br />\nBy ROBERT RIGGS<br />\nUnder a dozen Johns Hopkins students will be<br />\npermitted to take courses at Peabody in September under<br />\nan \"informal agreement,\" according to Dean of<br />\nUndergraduate and Graduate Studies Sigmund R.<br />\nSuskind. In conjunction with Associate Dean of- the<br />\nPeabody Conservatory Tinka Knopf, Suskind has worked<br />\nout an \"unofficial mechanism\" for allowing Hopkins<br />\nstudents to enroll in undergraduate courses at Peabody,<br />\nand Peabody undergraduates to take courses at<br />\nHopkins. Selection of this small group of students will<br />\ntake place in the near future on a \"strictly individual<br />\nbasis,\" according to Suskind. Private instrumental lessons<br />\nwill not be available, but these students will be able to<br />\ntake music area courses such as Theory and History of<br />\nMusic, if they have enough background to pass a<br />\nplacement test. No additional tuition will be charged,<br />\nSuskind said.<br />\nThe exchange remains a \"non-program.\" Suskind<br />\nemphasized, until a formal academic affiliation can be<br />\nworked out. An administrative affiliation between the the<br />\n<br />\ntwo institutions will go into effect July 1, 1977. An<br />\nacademic affiliation would have to be be approved by the<br />\nCommittee for Undergraduate Studies and the Academic<br />\nCouncil, and probably will not be finalized until<br />\nSeptember, 1978, according to Suskind., \"There is no<br />\nagreement yet,\" he said, \"this arrangement will just give<br />\nus some idea of how things will work on a larger scale. It<br />\nhas been done and mutually set up between the two deans<br />\nto let the interested students involved get a chance to take<br />\nsome courses at the other school. It is not a formal<br />\nprogram.\" For this reason, Suskind continued, the<br />\nnumber of students involved must be kept small. \"Under<br />\na dozen\" will be selected from Hopkins, on the basis of<br />\n\"interest, relevance to programs, and ability.\" They will<br />\nbe first-rate students, and they will have to have a clear<br />\nreason why they should<br />\ntake courses at Peabody,\"<br />\nSuskind commented. Dean Knopf stated that \"a limited<br />\nnumber\" of Peabody students will be allowed to<br />\nenroll in courses at Hopkins. Thus far, only four of seven<br />\ncandidates have been selected. The criteria for Peabody<br />\nstudents to take courses at Hopkins, according to Knopf,<br />\nare combined scored of at least 1150-1?00 on the<br />\n<br />\nScholastic Aptitude Test and a \"demonstrated grade<br />\nrecord\" at Peabody. The main course areas in which they<br />\nhave shown interest are the Classics and Russian.<br />\nKnopf predicts the number of Peabody students<br />\npermitted to take courses at Hopkins will rise in future<br />\nyears. \"We want to see how it works out first. As we<br />\ngrow, obviously more exchange possibilities will become<br />\navailable.\" She noted that Peabody students are limited<br />\nby the rigid five-day class scheduling there, which makes<br />\nthe trip to Hopkins very difficult for many students.<br />\nFuture attendance of Hopkins studentsin Peabody<br />\nclasses an academic affiliation will be limited, Knopf<br />\nstated, by placement examinations and available space.<br />\nThere are about 350 undergraduates at Peabody, so any<br />\nmajor influx of Hopkins students could seriously damage<br />\nacademic opportunities for Peabody students. \"I've<br />\nalready had numerous phone calls from Hopkins students<br />\nwho have expressed desire to come her,\" Knopf<br />\ncontinued. \"The faculty has been fascinated by the<br />\npossibility of having Hopkins students come down here. I<br />\nthing it's going to be very positive experience for both<br />\nschools.\"<br />\niglarirArar114/AntrAgirArarAr4,411%.\"4\".<br />\n<br />\nrayrsymposium set<br />\n\"Television and Society the<br />\nWorld in 21\" (diagonally) is the<br />\ntopic of the eleventh annual<br />\nMilton S. Eisenhower<br />\nSymposium. Serving as chairmen<br />\nof the symposium which will<br />\nextend through October and<br />\nNovember 'are Carole Jaffe, Jill<br />\nLeukhardt and Steve Simms.<br />\n\"Our goal is to make people<br />\naware of the myriad ways that<br />\ntelevision effects them. After all,<br />\nthe average American has spent<br />\nthree years of his life watching<br />\nTV by the time he's eighteen.<br />\nTelevision influences everything<br />\nfrom buying habits to voting<br />\npatterns,\"Jaffe said.<br />\nThe symposium was<br />\nestablished in 1967 as a tribute<br />\nto Dr. Eisenhower for his<br />\ndistinguished service as<br />\nUniversity president. Past topics<br />\nhave included \"Living with<br />\nChange,\" \"The Pen as the Sword<br />\n- the Dynamics of the Written<br />\n<br />\nI<br />\n<br />\nMedia\" and \"A Question of<br />\nFreedom.\" Over the first ten<br />\nsymposia such diverse .and<br />\nnotable participants as Dr. Jean<br />\nPiaget, the Honorable Earl<br />\nWarren,- Dr. R. Buckminster<br />\nFuller, Carl Bernstein and Dr.<br />\nNaom Chomsky have spoken.<br />\nEach year symposium<br />\nproposals appear on the ballot<br />\nduring Student Council executive<br />\nelections. Voters are asked to<br />\nindicate three preferences for<br />\ntopics. Unless one topic receives<br />\na mjaority of the votes cast, the<br />\nauthors of the three topics which<br />\ngarner the most votes are<br />\ninterviewed by the Student<br />\nCouncil selections committee,<br />\nthen the committee makes a<br />\nrecommendation to the full<br />\nCouncil. This year, the interview<br />\nprocess was unnecessary as<br />\n\"Television and Society\"<br />\nreceived more than 50% of the<br />\nvotes.<br />\n<br />\n\fTHE PEOPLE'S<br />\nPAPER<br />\n<br />\nThis is the last issue of the News-Letter this year (please, no applause). It's been a pretty dull year<br />\nand sometimes we really had to bust our brains thinking of editorial topics. Today is no exception. So<br />\nhere we present little summaries of the \"major\" issues of the year;<br />\n1. Chesanow--What can be said of this well-rounded, All-American scholar that hasn't been said<br />\nbefore? We only hope he keeps his campaign promise of \"pot for every chicken\" and takes a more<br />\nvisible, active role in student government than his two predecessors.<br />\n2. Calendar change--President Steven Muller and Provost Richard L:ongaker maintained their<br />\n..-ucumber stance though faced with considerable dissent from student objectors. Secruring an<br />\nintersession while avoiding Saturday classes, students won this battle for input in University affairs<br />\ndirectly affecting their lot. We'll have to wait until 1978 to see if the golden unification concept was<br />\nworth the hassle to the men in Garland Hall.<br />\n3. \"Coonskin\"--Censorship of any kind faces a heavy burden of justification. But the question<br />\nCouncil, where a majority spoke<br />\nremains whether the cancellation of a film sponsored by the _Student<br />\n_<br />\nagainst the film, amounts to censorship.<br />\nlacrosse<br />\n4. Swimmers--Let's 'hear it for the swimming team! They did something only Hopkins<br />\nteams lacrosse teams areexpected to do--they won the NCAA Division III National Championship.<br />\n<br />\neditors-in-chief<br />\nMike Deak,Mike Krug<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editor<br />\nDave DeSmith<br />\nnews editor Gayle Cohen<br />\n<br />\nvol. lxxxi, no.50<br />\nThis is a Johns Hopkins paper.<br />\nThank you very much. Dante.<br />\n<br />\nsports editor<br />\nDavid Kraus<br />\nphoto-production manager<br />\nJennifer Bishop<br />\n<br />\nBy THOMAS DAHLBERG<br />\nMany different sexual statuses have \"come out of thL,<br />\ncloset\" these days. The male homosexuals have come out,<br />\nand the lesbians, and promiscuity is beginning to take on<br />\nthe guise of normality. There is alot of talk about the<br />\nmale homosexuals \"rights\", some talk about lesbian<br />\n\"rights\" and there's still a little talk left (it's rarely found<br />\ndefensively necessary these days) about the \"right\" to<br />\nlet around\" without the repression of traditional<br />\n\"mores.\" Of course these \"rights\", though sometimes<br />\npolitical in the case of male homosexuals and lesbians, are<br />\noften just social \"rights\"—i.e., the word \"right\" is used<br />\nloosely within contexts where what the male homosexual,<br />\nor the lesbian, or the \"sexually active\" are actually<br />\npleading for is a society where they can be what they are<br />\ncomfortably, without a sense of social failure and<br />\noppression. Gays, for example, claim that there are social<br />\nproblems attached to being gay which are extremely<br />\nimportant to them no matter how petty they seem to<br />\nothers. They plead for a destigmatized status which will<br />\nmake normal socializing possible for them. O.K. Fine. It's<br />\nall pouring \"out of the closet\" 'cause we're all nice<br />\nliberals and we done opened the door wide. And now,<br />\ndarnmit, at the end of the flood, come the virgins.<br />\nThat's right, the virgins gotta get out of the closet and<br />\ninto the streets. They have been socially disenfranchised<br />\nand they have to start fighting for their (social) \"rights.\"<br />\nMost of the following holds true for non-virgins who,<br />\nalong with many virgins, do not care for presumptuous<br />\nsocial pressure. I will discuss virgins almost exclusively<br />\nbecause I wish to dispel certain myths that surround them<br />\nin particular. The problem from a gregarious, fun-loving<br />\nvirgin's point of view is that many of the people who,<br />\nscrew are making normal socializing impossible for<br />\nhim/her. There are still plenty of women out there, for<br />\nexample, who would love to go out with alot of different<br />\nmen, have a good time talking to them, and go home to<br />\ntheir own bed sans date. Some of them are the most<br />\nparanoid people alive these days. They're getting glares<br />\nwhen they close the door leaving him on the outside,<br />\nreputation as a real bitch, and sometimes they actually get<br />\ncussed out. They don't know if they can accept an<br />\ninvitation or not anymore because they are all too often<br />\nput under pressures that they may actually consider<br />\nvulgar. They meet someone new and they don't know<br />\nwhat to think. \"Does he want to make it? Will he put the<br />\npressure on? Should I take a chance and go out with<br />\nhim?\" And since she's had too many bad experiences<br />\nalready she says \"no\"—possibly to someone with perfect<br />\nmanners.<br />\n<br />\nAnd that brings us to the problem from a male virgin's ,<br />\npoint of view. Not only does he resent the assumptions;<br />\nand presumptions of the women who use men just a:.;<br />\nreadily as men use women, he may not be able to mak.€<br />\ncontact with the girls he'd really like to know because<br />\nthey may be operating on the assumption that he's just<br />\nanother horny bore. (They may consider this statistically<br />\nprobable in the light of their experience.) The virgin lives<br />\nin a youth culture that always has him/her guessing and<br />\nsecond-guessing about what his date or acquaintance<br />\n<br />\nVirgin's rights:<br />\n<br />\nCome out of the closet<br />\nexpects. The trouble isn't necessarily that virgins feel<br />\ncompelled to do what they don't want to do; if they're<br />\nvirgins today they're probably too strong to be serviously<br />\nbothered by the pressures—they just tell whomever it is<br />\nthat they can bloody well go to hell. The trouble is that a<br />\nvirgin may want to socialize normally with members of<br />\nthe opposite sex (or whomever) who do hit the sack; they<br />\ncan handle the pressure these people may implicitly or<br />\nexplicitly apply, they just don't want to be bothered by<br />\nit.<br />\n<br />\nOne of the social difficulties attached to being a virgin<br />\nresides in the fact that there are all kinds of myths<br />\nsurrounding virginity (just like there are all kinds of<br />\nmyths surrounding blacks, indians, poles, etc.). These<br />\nmyths stigmatize the virgin. For example, one myth is<br />\nthat virgins are impotent or frigid. Of course some virgins<br />\nmay be impotent or frigid, and this may very well by why<br />\nthey are virgins, but there are plenty whose equipment is<br />\nin perfect operating condition and who are virgins for<br />\nreligious reasons, or moral reasons without theological<br />\ninterpretation, or, Lord knows, for health reasons.<br />\nAnother myth is that virgins are virgins because they are<br />\nundesirable and have been forced into it. Like the myth I<br />\nhave just described, this is nonsense if it is taken as a<br />\ngeneralization. There are plenty of virgins who are<br />\ngorgeous, interesting, and engaging human beings. Still<br />\nanother myth surrounding virginity is that virgins are<br />\nashamed of their bodies and sex. In many, if not most<br />\ncases, nothing could be further from the truth. The<br />\nimplicit position of many virgins as such is that sex is<br />\nvery, very good, and because they believe this they<br />\nprotect it from anything that may do it harm according to<br />\ntheir belief system about it. For example, a virgin may<br />\nbelieve that sex ought to have a certain meaning. He/she<br />\ndoes not engage in sex under certain circumstances simply<br />\nbecause he/she is insisting that sex mean such and such<br />\n(e.g., marital commitment, \"real\" love, etc.). It won't do<br />\nto adopt the ridiculous position that sex is a brute fact<br />\nwithout meaning—so is language outside of the rules and<br />\nconventions that people, as rational creatures, invent for<br />\nit. Sex, like language, may take on meaning, and giving it<br />\na certain meaning may be intuited as morally ideal. There<br />\nmay be many good reasons for insisting on a certain<br />\nmeaning in sex; one of them simply being that the<br />\nindividual who does so insist cannot really enjoy sex<br />\nwithout it.<br />\nThe condition, the attitudes, and the beliefs of the<br />\nvirgin must be respected. If .we believe in behaving<br />\nrespectfully toward other minority groups we should<br />\nbehave respectfully toward virgins. There are two<br />\nconcrete proposals to make: 1) do not operate on<br />\nassumptions about virgins that may be nothing but<br />\nridiculous myths, and 2) do not operate on the<br />\nassumption that the new acquaintance, the friend or<br />\nwhomever, wants to screw just because they clearly like<br />\nand enjoy you, and/or accept a date. \"Keepa you hands<br />\noff\" unles in one way or another, you're asked.<br />\nThomas Dahlberg, a graduate student in Philosophy, did<br />\nnot say whether he was a virgin or not. We can onlY<br />\nspeculate.<br />\n<br />\nLetters we got lots and lots of letters<br />\nTo the editor:<br />\nOn Tuesday, April 12, a panel of the Undergraduate<br />\nAcademic Ethics Board met to hear charges against a<br />\nstudent who had been accused of cheating on an<br />\nIntroductory Chemistry examination. The student pled<br />\nguilty, and was subsequently failed in the course by<br />\nrecommendation of the hearing panel.<br />\nAs Presiding Official of the hearing, I was responsible<br />\nfor making the above mentioned facts known to the<br />\nHopkins community. The following day, I personally<br />\ndelivered to Eric Garland, editor of the Friday edition of<br />\nthe News-Letter, a summary of the hearing that included<br />\nthose facts. Mr. Garland verbally assured me that this<br />\ninformation, in its original form, would be printed in the<br />\nFriday (April 15) issue of the N-L. It was not. I spoke to<br />\nMr. Garland about the deletion that same day, and he<br />\npromised to have Mike Deak, editor of the 'Tuesday<br />\nedition, include the summary that Tuesday. It was not<br />\ndone. I again contacted Mr. Garland, who graciously<br />\nshifted the blame to Mr. Deak, and 'again promised to<br />\nplace the Ethics Board's five-line insert in the next Friday<br />\nedition (April 22).<br />\nOn Friday, htere appeared a boxed insert on the<br />\n<br />\nbottom of page three entitled \"Ethics Board.\" What was<br />\nprinted, however, was not the simple statement that I had<br />\nsubmitted, but rather a typically irresponsible<br />\nNews-Letter comedy revue.<br />\nThis ill-founded attempt at satire, it seems, srlved only<br />\nto amuse the editorial staff of Hopkins' answel- to The<br />\nNational Lampoon, the irresponsible Friday News-Letter.<br />\nIt distresses me that the News-Letter feels free to<br />\nhandle the serious issue of academic integrity in such a<br />\nfarcical manner. At a time when academic integrity at<br />\nHopkins may be approaching its nadir, it was certainly<br />\ninappropriate and grossly irresponsible to act as you did.<br />\nClean up your act. ,<br />\nLawrence A. Kessner<br />\nto the Ethics<br />\napologize<br />\nsincerely<br />\nThe Tuesday editors<br />\nBoard for any misunderstanding that might have<br />\noccurred. The reason the statement did not appear in<br />\nTuesday's News-Letter was that there took place a<br />\nbureaucratic mix-up between the two editors that resulted<br />\nin the temporary (if not permanent) loss-of the original<br />\nstatement.<br />\nTo the editor:<br />\n<br />\nWe read with some dismay the article in the Friday<br />\nNews-Letter concerning the state of cinema in Baltimore.<br />\nAs regards this past spring, the Graduate Club of Johns<br />\nHopkins University presented what we felt to be a<br />\nselection of films, free to all, representative of various<br />\ntechniques, eras and cultures. Since January, three<br />\nKurosawa movies alone have been shown, as well as films<br />\nby Mizoguchi, Ozu, Renoir, Resnais, Eisenstein, Griffith,<br />\nKeaton, Von Stroheim and Clair have been screened.<br />\nFurthermore, the series will continue all summer, and for<br />\na list of future films we refer the reader to an<br />\nadvertisement which appears elsewhere in this edition of<br />\nthe News-Letter.<br />\nIt was unfortunate that Friday's article slighted such a<br />\nseries as this, and we suggest that in the future, before<br />\ngoing to Howard Community College to check out the<br />\nmovies, the staff should check across Charles St. in the<br />\nGrad Club, and in its files of Campus notes(!) for records<br />\nof our paq movies.<br />\nR.L. Powell<br />\nPresident of Graduate Club<br />\nR.A. Kline<br />\nFilm Series Coordinator<br />\n<br />\n\fo be dangerous. but I knew I could do<br />\noing to crash a White House press<br />\nThere were four actual events that I was to \"cover\"<br />\nthat dreary March day. The first was a pboto session in<br />\nthe Cabinet room where Jimmy Carter formally accepted<br />\nthe papers of the Woodcock delegation. This was the<br />\npanel sent to Hanoi to inquire into the MIA's and the<br />\ndiplomatic opportunities. The delegation consisted of<br />\nLeonard Woodcock, President of the United Auto<br />\nWorkers, Senator Mike Mansfield, former ambassador<br />\nCharles Yost, Mrs. Mary Wright Edelman, and<br />\nCongressman G.V. Montgomery. Everyone (press) lined<br />\nup in front of the Cabinet room door and when the lights<br />\nwere turned on (the signal to inter) we rushed in and<br />\nstarted taking pictures. They only allowed 36 seconds for<br />\nthis session—the time varies for each session.<br />\nAfter this photo session, there was a press conference<br />\nin the press room with Secretary of the Interior, Cecil<br />\nAndrus, and Secretary of the Agriculture, Bob Bergland.<br />\nThey were discussing the Administration's evaluation and<br />\naction dealing with the drought experienced in the West<br />\nand Midwest. It was during this session that I had my first<br />\ncrack at the White House press. They were cocky, biting,<br />\nrude, and very effective. At first I was surprised, but then<br />\nI talked to a few of the \"old pros\". They all echoed the<br />\nsame thing—it's a job, and as a job you must come to<br />\nterms with the way you approach it. It was still a little<br />\nhard for me to swallow, but my day was young.<br />\nAt the conclusion of the drought conferen z the<br />\nPePresident surprised everyone by coming in to introduce<br />\nthe Woodcock delegation. Leonard Woodcock gave a<br />\nshort speech followed by a question session. Apparently<br />\nthere were discrepancies in statements among the panel<br />\nmembers prior to the conference. This was enough to<br />\nopen the gates to a wave of questions, many openly<br />\ncynical.<br />\nI made it through these sessions in one piece, and<br />\n<br />\nreturned after lunch. There was going to be another photo<br />\nsession in the Oval Office with the President as he was<br />\naccepting official portfolios from some foreign<br />\nambassadors. After we marched into the Roosevelt Room<br />\nacross the hall from the Oval Office, we were informed of<br />\nthe procedure. We would be allowed in for 45 seconds of<br />\npicture taking, then about 3-5 minutes to leave and return<br />\nto the Roosevelt Room. Because of the time limit people<br />\nwere pushing and shoving. I even saw a punch thrown.<br />\nThe five ambassadors were from Austria, Chile, Kenya,<br />\nGuinea, and Swaziland. We<br />\nwere having a difficult time trying to figure out what<br />\ncountry each ambassador was from, and much to my<br />\nsurprise, one of the photographers had word sent in that<br />\nwe would appreciate a little introduction. Well, next time<br />\nwe went in and Jimmy Carter introduces the ambassador<br />\nas his good friend from Kenya. I couldn't believe it. It was<br />\nlights, camera, action, and we even added a little dialogue!<br />\nNot that I'm knocking Carter's sincerity. In fact, you<br />\ncould see the true concern and grief in his face when he<br />\nearlier spoke of the MIA's. It's just that I was naive—not<br />\nthat I didn't know of the PR bullshit, but the depth and<br />\nthe strength of the PR really shook me. There I was<br />\nstanding in front of the President's desk in the Oval Office<br />\nand I felt like saying \"cut, take it from the t p, and<br />\nJimmy, do you think you could put your arm around his<br />\nshoulder this time?\" But my day still had many pages left.<br />\nAfter the photo session in the Oval Office, I went back<br />\nto the Press room, where they were preparing to begin a<br />\npress coliteLeilLe Wait Jouy Foweit. it is at tills press<br />\nconference that I felt that some members of the press<br />\nshowed poor taste and outright obnoxious manners. As an<br />\nexample, one of the 12 returned bodies from Vietnam<br />\nwas actually discovered to be an Oriental. Mondale had<br />\npersonally notified the family of the \"mistake\".(The 12<br />\n<br />\n_families had been given prior notice that the bodies were<br />\nbeing returned). Jody Powell did not disclose the name of'<br />\nthe family since he felt that their grief need not be<br />\ncompounded by the press' harrassment. It made sense ot<br />\nme, but reporters from all over were demanding the<br />\nfamily's name. One went far enough to threaten Powell<br />\nby saying that he would get 50 volunteers to call 10 of<br />\nthe MIA's families (this would cover all the families), and<br />\nin this way he would find the names of all 12 families. I<br />\noverheard another national reporter bragging among his<br />\ncohorts that he'd have the name that very afternoon. I<br />\ncould stand it no longer, and asked him why he wanted it.<br />\nHe threw a lot of crap about it being newsworthy, and I<br />\n. again asked why. Well, he told me how naive and young<br />\nand stupid I was, and I told him what i thought of his<br />\n\"newsworthy\" reporting. Well, one less invitation to<br />\ngraduation.<br />\nAnother matter which bothered me was the security. It<br />\nseems to me that if I had had a gun, I could easily have<br />\nsent Mr. Carter back amongst his forefathers. Admittedly,<br />\n1 had had a Secret Service clearance, but all the<br />\ninformation was Oven over the phone. I'm not saying I<br />\ncould get away with it, but what about the person willing<br />\nto give his life to bring the spotlight to his cause? But, as<br />\nI've learned, the side order for democracy is exposure.<br />\nAll in all, I had a great time and was both impressed<br />\nand irritated with the press. I can't help but think that a<br />\nlittle respect might go a long way. It's true that the press<br />\nmust analyze its information critically, but must they<br />\nobtain it inconsiderately? Perhaps I've singled out the<br />\nexceptions, and maybe in my nervousness they made a<br />\nstronger impression. Whatever, I've learned there's an<br />\nawful lot that goes on behind the newspapers we read<br />\neach day we wouldn't write home to Mother about.<br />\nBarry Muradian'<br />\n<br />\nStudent, defend thyself:Get those shoeracks<br />\nBY DAVE DE SMITH<br />\nVisitors to our Johns<br />\nhopkins campus see a group of nice buildings and lawns,<br />\nseemingly secure. The fortresses of Garland and Barton<br />\nHalls defy entry by any criminal;besides, everything at<br />\nHopkins has a lock. It must be remembered, however,<br />\nthat no placein ilaltimore is totally secure, even Hopkins.<br />\nThe riff-raff that all too often make.theirpresence felt in<br />\nthis city are not really kept off campus. Hopkins has not,<br />\nand probably will not,decide to become more isolationist,<br />\nmore protective, unless force to. Since the university<br />\nhas adopted the \"good neighbor\" policy instead of<br />\nerecting thirty-foot\" fences, anyonce erecting 30-foot<br />\nfences, anyone can walk on campus. Even before<br />\nHopkins' annual open house, many non-students were<br />\nknown to be wabdering the quads of Homewood.<br />\nCoupled with open dormitory doors, this oftern leads to<br />\ntrouble. Campus police are as helpful in preventing crime<br />\nas the non-existent fences. Homewood is a well-lit<br />\ncampus; there is usually no problem seeing any criminal<br />\n<br />\nacts as they progress. The problem lies in the preventative<br />\nmeasures. All students were asked to keep their doors and<br />\nwindows locked when not at home. Most students have<br />\ndone so. All housemasters have been asked to keep front<br />\ndoors locked. Few are even closed before eleven o'clock.<br />\nBasement doors in the dorms<br />\nare seldom locked,<br />\n<br />\nCrime!<br />\nproviding easy entry and exit.<br />\nThough the campus police are trained and conduct<br />\nregular patrols of the campus, they cannot be everywhere.<br />\nWhen a situation calls for police action, the campus patrol<br />\nmust be called. They are not likely to be already on their<br />\nway.<br />\nAs most of you know, and expected, there was crime at<br />\n<br />\nthe Spring Fair. The mardi gras atmosphere is one which<br />\nhas encouraged _rowdiness and activity here at Hopkins,<br />\nbut one which is produced at the students' expense. By<br />\nnow you may have had time to to forget about the fair's<br />\ncrime. Or you may have veen informed by now that ,lite<br />\ninjured Hopkins undergrad wasm't hurt? the<br />\nincident stirred a lot of discussion abouttecurity and the<br />\nvalue of the Spring Fair itself. If we must put \"3400 On<br />\nStage.\" we'd better be more prepared. The time to Make<br />\ncertain that security is working is before it has a chance to<br />\n'fail, as it did at the fair. If our university insists on<br />\ncreating potentially dangerous situations on our own<br />\ncampus without providing adequate protection, it is time<br />\nto have a'talk with the universiyt. That we do not have<br />\nlocking gences is okay, as long as we remember how to<br />\nbuild them. Above all, don't despair. Hopkins is as safe as<br />\nyou can get in Baltimore, and if this article has mad e any<br />\nstudents uncomfortable in their dorm room,look in your<br />\ncloset. The two iron bars acting- as a shoerack, when<br />\n,removed, amke excellent defensive weapons.<br />\n<br />\n\fe.•<br />\n<br />\npage 6/news-letter/may 3, 1977<br />\nTo M.P.11<br />\nII rriglicr lath°<br />\n<br />\nGRADUATE'STUDENT PICNIC<br />\non thr ower quad (ohrIver hall)<br />\nsponsored by<br />\nTHE GRAD CLUB<br />\n<br />\nss1i2nola Jam)<br />\nopTsAilunop `urnetT<br />\n-crew'am `,1E1 `21.1!Ari UliEj `satov limo 7<br />\nmg/A 'vs JED„<br />\n„znoA<br />\nS11101-1 UOSVEl `1.1.10pEH `s4uAploolET `XLIO-If{ • T<br />\n<br />\nby Bob Buchanan<br />\nOn'living50<br />\n<br />\nBetter than the others,<br />\nwho grope with decision<br />\nandfight their useless battle<br />\n<br />\noiptiosoN •c<br />\ntiorog ro3o3<br />\n=E03<br />\nuoisog •E<br />\nxtuootld •z<br />\no2rom •<br />\n<br />\nIjust maintain my identity<br />\n(can't swim with those nfinnows)<br />\nas the only true<br />\nsculptor ofour language<br />\n<br />\nYou all know me<br />\nthe man ofmen here<br />\nStoical presence, syn2bol<br />\nofproper usage<br />\nSpent6 months out West<br />\nwith Jerry, with Jackson<br />\nworking on my style<br />\nwhile swrdlerin'countless dishes<br />\noforange danish<br />\n<br />\nReturned tofind my nemesis<br />\nrelieved ofhis command<br />\nwith no ability to replace me<br />\nthe slum<br />\nLooldn'nowfor a light daily<br />\nRestaurant reviewer<br />\nwill do mefine<br />\nYou seeIcannot go<br />\nNo,Ican't go on forever<br />\nRollin', albeit stoned<br />\n<br />\nA Boorish Affair<br />\nBy 1t P. Duvoidien<br />\nMy hopefora world<br />\nfull ofprecise diction,<br />\nunflawed construction,<br />\n<br />\ng '0I<br />\nEl '6<br />\nD'S<br />\nV L<br />\n1'9<br />\n'S<br />\nI 't7<br />\nH •£<br />\n'Z<br />\n'I<br />\nsiomsuV<br />\n<br />\nFREE BEER &SANGRIA<br />\nvolleyball,soceer,softball<br />\nSUNDAY NIAY22 lp.m.<br />\nALL GRAD STUDENTS&FAMILIES<br />\nINVITED<br />\n<br />\nUBS 1977<br />\n<br />\nCharter Tours<br />\n<br />\n;C)UCH<br />\n<br />\n& Balto Departures<br />\naaaaaaaaiaaaaaaaaaaaiaasaaaass<br />\n<br />\nLondon<br />\n<br />\n20-july15 Session ll•j<br />\nwoe<br />\nY/8.4<br />\n<br />\n1.2 & 3 week charters<br />\nMarch—Dec. 30 Weekend<br />\nDepartures. via British<br />\nCaledonian Airways<br />\n<br />\nSome courses offered are:<br />\n<br />\nRoots: A Practicum in<br />\nGenealogy.<br />\nDance Therapy,<br />\nIntroduction to<br />\nComputing ,<br />\nPolitics of Women's<br />\nLiberation.<br />\nCollege<br />\nComposition.<br />\n<br />\nair only<br />\n<br />\n11111111111111111<br />\nfrom<br />\n<br />\nBahamasJmualyr--N%-:,3259 9 $299<br />\n17 weekend departures<br />\nAir, Hotel, Tax Piedmont Airlines<br />\nall inclusive<br />\n<br />\n•1111•1111101111111111111111111111111111151111•11•11•111111111111111111<br />\nAcapulco $315-9 depar- from<br />\n<br />\nPAexico<br />\nABC & OTC<br />\n<br />\n15<br />\n<br />\nFOR FURTHER INFORMATION CALL 825-3300, EXT.410<br />\nGoucher College admits students of any race, color and national or ethnic origin.<br />\n<br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $410.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 thru<br />\nApril 30 and $430 from May 1 thru June 14.) All you<br />\nhave to do is be under the age of 26.<br />\nThere are no booking restrictions. We give you the same<br />\nservice you'd get from other airlines, without the same high<br />\ncosts. So,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to. We'll give you be best deal<br />\non fares and on our New Horizon Escorted Tours,too.<br />\n<br />\nM:<br />\n6<br />\na r -Der $345<br />\nepa<br />\nlia<br />\nrlan<br />\ntwlafrom 4<br />\n11141<br />\n71tdillia<br />\n<br />\nAmerican & United Ahlines<br />\n<br />\nair only<br />\n<br />\n11111•111•111111111111111•111111111111111111111111111111111111111111111<br />\n<br />\nIreland .<br />\nPlease call<br />\n<br />\nBURCH.<br />\nTRAVEL LTD<br />\n<br />\nimpeccably grammatical sentences,<br />\nunquestionerl excellence ofusage<br />\n<br />\n4674900<br />\n<br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br />\n<br />\nNo matter to substance<br />\npay no heed to proper understanding<br />\nAre the t's crossed, the words right,<br />\nthe phrasing completely parallel?<br />\n<br />\nInc worldfull ofuncertainty,<br />\n's and<br />\nfull ofthe Mr. D's,,<br />\nthe J. D. 's<br />\nlet us confine our attention<br />\nto the dramatic and dashing,<br />\nthe wresting gesture or word<br />\nStrivefor conciseness<br />\nand proper phrasing<br />\nAllay this tenuous notion<br />\nofa concernfor substance,<br />\nfor leadership,<br />\nfor great wisdom<br />\n<br />\nwill they never understand<br />\nthe necessity<br />\nofvacuum-cleaned language<br />\nAllay myfears<br />\nPlease do not reveal<br />\nmy unabashed ignorance<br />\nofthe issues involved<br />\n<br />\n,:<br />\n<br />\nTarot, the Psychic<br />\nand the Occult<br />\nFieldwork in<br />\nPsycho.logy<br />\nSociology of Sport<br />\nAging as a Social<br />\nIssue<br />\nPersonality Theory<br />\n'Semester in<br />\nWashington<br />\n<br />\nCourses are also offered in Biological Sciences, Chemistry,<br />\nPhysics. French. Russian and Spanish.<br />\n<br />\ntures Feb Dec: Tri Mexico $<br />\nPut4<br />\na grattruie/Pjeetcrt)<br />\nvalrarta $399-July 22-29<br />\nAir. Hotel, Tax American & United Airlines<br />\nall inclusive<br />\nOTC & ITC<br />\n111111•••ail11.111••111111•1111/111•1111•11 MINN 1111••<br />\nfrom<br />\non Waildid Vita<br />\n:<br />\nl '12,9<br />\n<br />\nHawaii<br />\n<br />\nWOMEN<br />\n<br />\nOPEN TO MEN AND<br />\n<br />\n$<br />\n<br />\nParadise island<br />\nHoliday Inn<br />\n<br />\n(Igo<br />\nStp<br />\n<br />\nOXN\"<br />\n<br />\nfrom<br />\n<br />\nABC & TGC<br />\n<br />\nOTC<br />\n<br />\n1977 SUMMER<br />\nSESSIONS<br />\n<br />\nGOUCHER<br />\nCOLLEGE<br />\n<br />\nSPENDING THE SUMMER<br />\nIN NEW YORK?<br />\nADVANCE YOUR COLLEGE CAREER.<br />\nTAKE SOME COURSES AT HUNTER.<br />\nArt<br />\nBiology<br />\nBlack Studies<br />\nChemistry<br />\nCinema<br />\nClassics<br />\nCommunications<br />\nEc:onomics<br />\nEducation<br />\n<br />\nEnglish<br />\nForeign Languages<br />\nGeology/Geography<br />\nHealth & Physical<br />\nEducation<br />\nHistory<br />\nHome Economics<br />\nMathematics<br />\nMusic<br />\n<br />\nName<br />\nAddress<br />\n<br />\nIcelandic<br />\nCity<br />\n<br />\nPuerto Rican<br />\nStudies<br />\nPhilosophy<br />\nPhysics and<br />\nAstronomy<br />\nPoitical Science<br />\nPsychology<br />\nSociology<br />\nUrban Affairs<br />\n<br />\nState .<br />\n<br />\nZip<br />\n<br />\nj<br />\n<br />\nLyares subject to change and govt.approval.<br />\n<br />\n4111<br />\n<br />\nLowest Jet fares to turope of any scheduled airline.<br />\n<br />\nThe distinguished Hunter Faculty teaches during the six week<br />\nSummer Session (both day and evening). Reasonable fees are<br />\nmade possible by the support of the City and State of New'York.<br />\nThe college is conveniently located on the Upper East Side at<br />\n68th Street between Park and Lexington.<br />\n<br />\n_<br />\n<br />\nBURCH TRAVEL LTD<br />\n<br />\nFor further information write or call:<br />\n<br />\nSCHOOL OF GENERAL STUDIES<br />\n<br />\n1<br />\n<br />\nHUNTER COLLEGE<br />\n<br />\nIt<br />\n<br />\nOF THE CITY UNIVERSITY OF NEW YORK<br />\n<br />\n695 PARK AVENUE, NEW YORK, N.Y. 10021<br />\n(212) 570-5646<br />\n<br />\n—1<br />\n<br />\n1—lc landic Airlines, Dept.#CN<br />\nPt/ Box 105, West Hempstead, N.Y. 11552<br />\nSee your travel agent. Or call toll free:(800)555-1212.<br />\nPlease send information on Icelandic's low-cost fares and New<br />\nHorizon Escorted Tours of Europe.<br />\n<br />\n4<br />\n'<br />\n<br />\n3990 N. Charles St.<br />\n467-3900<br />\nWe enjoy helping the<br />\n<br />\nHopkins Community with<br />\ntheir travel plans.<br />\n•<br />\n<br />\n\fmay 3, 1977/news-letter/page 7<br />\n<br />\nCOMMENCEMENT WEEK<br />\nWednesday, May 25<br />\n<br />\nNoon to 5:00 p.m.<br />\n<br />\nBULL ROAST<br />\nSaturday, May 21<br />\n<br />\n9:00 p.m. to 1:00 a.m.<br />\n<br />\nSPEAKEASY — RAMSKELLAR<br />\nMixed drinks<br />\nDancing<br />\n<br />\nEvergreen House<br />\n4545 North Charles Street<br />\nAll You Can Eat<br />\nLive Tlimd<br />\n<br />\n$3.00<br />\n$4.00 After May 18<br />\n<br />\nProper Dress Required<br />\nFree to Seniors and Guests<br />\n<br />\nThursday, May 26<br />\nMonday, May 23<br />\n<br />\n9:00 p.m. to ???<br />\n<br />\n5:00 p.m. to 7:00 p.m.<br />\n<br />\nCOCKTAIL RECEPTION<br />\n<br />\nSENIOR BLOW—OUT<br />\n<br />\nfor<br />\nEimily, Friends<br />\n<br />\nCome as you are to<br />\n4220 North Charles Street<br />\nDU Fraternity<br />\n<br />\nGlass Pavilion<br />\n<br />\nMixed Drinks Provided<br />\nFree to Seniors and Guests<br />\n<br />\nTuesday, May 24<br />\n<br />\nB.Y.O. Beer<br />\nExpect Anything!<br />\n<br />\n8:00 p.m. to 1:00 a.m.<br />\n<br />\nGRADUATION DINNER DANCE<br />\nHoliday Inn Downtown<br />\nHoward and Lombard Streets<br />\nSemi-formal Attire<br />\n<br />\nSingles Welcome<br />\n$6.00 per Person<br />\nNo Reservations Taken After May 12.<br />\n<br />\nFriday, May 27<br />\n<br />\nAll Day<br />\nTHE GRADUATION<br />\n<br />\n9:00 — University Commencement Ceremony<br />\nGuest Speaker Dr. William D. McElroy<br />\nChancellor, University of California, San Diego<br />\n2:00-- Undergiaduate Diploma Ceremony<br />\nGuest Speaker -- Dr. Isaac Asimov<br />\nDistinguished Author and Biochemist<br />\n<br />\nAll events are open to Seniors, their families, and guests.<br />\n<br />\nSeniors - Check Your Mail Box<br />\n<br />\nFINAL DAY<br />\n<br />\nSALE<br />\nMEN's TRADITIONAL<br />\nSILADIUM RING<br />\n<br />\nONLY $59.95<br />\nRegularly 5 75.00 cusiom<br />\n<br />\nHU BOOK CENTER<br />\nMY 9th<br />\nTHRU<br />\nMAY 19,th 1977<br />\n<br />\n,-<br />\n<br />\n0 ! HERE IS A PARTIAL LIST OF THE MANY TITLES WE WILL BE BUYI G:<br />\n4 i<br />\nA<br />\nI.<br />\n1.11<br />\n0<br />\n0<br />\n1<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\nF.<br />\n1-4<br />\n0<br />\n4<br />\n<br />\nNi<br />\n<br />\nLinear Algebra<br />\n<br />\n3rd Edition<br />\n<br />\nAllyn & Bacon<br />\n<br />\n$8.00<br />\n<br />\nCurtis<br />\nHartt<br />\n<br />\nArt<br />\n<br />\n1976 Ed.<br />\n<br />\nPrentice-Hall<br />\n<br />\n$5,.00<br />\n<br />\nPsychology<br />\n<br />\nHulse<br />\n<br />\n4th Ed.<br />\n<br />\nMcGraw-Hill<br />\n<br />\n-$10.00<br />\n<br />\nMorrison Organic Chemistry 3rd Ed.<br />\n<br />\nAllyn & Bacon<br />\n<br />\nDifferential<br />\nEquations<br />\nCalculus and<br />\nThomas<br />\nAnalytic Geom..<br />\nWilliamson Calculus<br />\n<br />\nMcGraw-Hill<br />\n<br />\n$8.00<br />\n<br />\nAddison-Wd.My<br />\n<br />\n$9.00,<br />\n<br />\nPrentice-Hall<br />\n<br />\n$8.00<br />\n<br />\nWiley<br />\n<br />\n$8.00<br />\n<br />\nSimmons<br />\n<br />\n1972 Ed.<br />\n<br />\n3rd Ed.<br />\n<br />\nplace:<br />\n<br />\n!I<br />\n.<br />\n0<br />\n0<br />\n<br />\n$6.50<br />\n<br />\nZafiTatos<br />\n<br />\nPhysics<br />\n<br />\n1976 Ed.<br />\n<br />\nPRICE ON HUNDREDS OF TITLES.<br />\nTO 507. OF THE ORIGINAL<br />\nTHE BOOK CrNTER WILL PAY or<br />\nCENTER FOR PRICES<br />\nBOOK<br />\nTHE<br />\nTO<br />\nTEXTBOOKS<br />\nBRING YOUR<br />\n<br />\nT<br />\n<br />\nT..<br />\n<br />\nARTORVED RING DAY<br />\nThat's when the ArtCarved representative will be here<br />\nto help you select your custom-made college jewelry.<br />\nIt's also the day you can charge your ArtCarved<br />\ncollege jewelry on Master Charge or BankAmericard.<br />\n<br />\nJHU<br />\nBOOK CENTER<br />\n<br />\ntime:<br />\n<br />\nMAY<br />\n5,6& 9<br />\n<br />\n1977<br />\n<br />\n3 DAYS ONLY<br />\n<br />\nLAST 2 DAYS<br />\n<br />\nTHIS WEEK ONLY<br />\n<br />\n2 DAYS ONLY<br />\n<br />\n\f1. Prologue<br />\nNevertheless if anarchy is to be avoided, the individuals<br />\nwho make up a society mustj<br />\nfrom time to time be<br />\nreminded, at least in symbol, of the underlying order that<br />\nis supposed to guide their social activities. Ritual<br />\nperformances have this function for the participation<br />\ngroup as a whole; they momentarily make explicit what is<br />\nothe ise a iction. —Edmund Le<br />\n<br />\nI'm getting old. The youthful elasticity that permitted.<br />\npositions of sexual derring-do has gone taut, and every<br />\nnow as I write (stretched on a lumpy motel bed in King of<br />\nPressia, Pa., the Willy Loman of bigtime college golf) my<br />\nlumbar feels like lumber and my ulcer burns with<br />\nunrequited desire I can no longer hope to consummate.<br />\nJust moments ago, the sight of a cocktail waitress'<br />\nbobbing boobs did not send my heart a pitter-patter. My<br />\nbusiness associates exchanged what Victorian novelists<br />\ncalled \"knowing glances\" I<br />\nthat left<br />\nmy head with a dull migraine ache. What's that stupid old(<br />\njtike? \"You're only as old as the girls you feel?\" I longh<br />\nfor the solitariness of the motel room and a quick game of<br />\ntelevision roulette before retiring to the land of the<br />\nSandman. Yes, I suppose I'm getting on in years and I<br />\nhave only the memories of happier days to content<br />\nmyself.<br />\n\"You'll remember this night for ever,\" my mother<br />\nwhispered while adjusting my collar and stuffing my pants<br />\npocket with Maalox tablets<br />\nVisions of dread ease into my consciousness. It's the<br />\nnight of my Senior Prom. Happier days? If one consider<br />\nhappiness a relative function, I suppose so. Besides, The<br />\nHoneymooners is over, and now the Silver Savior, Rex<br />\nHumbard, has taken control with his Holiday Inn concept<br />\nof the Great Beyond. Reluctantly I make the decision,<br />\nand now I slip a quarter into the slot on the headboard<br />\nand as the bed starts to vibrate, I remember----<br />\n<br />\nof ritual (as anthropologists, the voyeurs of academia, call<br />\nit) than just sexual silliness. There must be some method<br />\nto this madness of tuxedoes, corsages, etiquette briefings,<br />\nappointments with hairstylists (Adam and Eve's \"We<br />\ncut both ways\" — offered special prom discounts),<br />\nsleepless nights of worry, the careful clipping of toe and<br />\nfingernails<br />\nthe inventory of such acts makes my mind<br />\nshudder with embarrassment. What a foolish young blade<br />\nI was!<br />\nThe scene: A deserted country road somewhere in<br />\ncentral New Jersey. It is an evening in mid-April and five<br />\nhigh school seniors sit inside a 1972 Mustang drinking<br />\nwhiskey and rye and, knowing that Prom Day will be the<br />\nday they die, are getting blown away.<br />\nMyself: Hey, don't knock masturbation. It's sex with<br />\n;omeone you love.<br />\nHarold Nunamachr: What a case of meglomania!<br />\nFred Glaubinger: (Holding fingers to nose) Who di,<br />\nthat?<br />\nGorilla Muldoon: He who smellt it dealt it.<br />\n\"One Night Stan\" Wertheimer: Speaking of which, are<br />\nyou still planning to take Mary Lou Hooper to the prom?<br />\nFred: If she ever crawla out from under her rock-Myself: You want a knuckle sanwich, Glaubinger?<br />\nFred: Yeah, and hold the mayo,crater face.<br />\nHarold: -I tried to cop a feel off Audrey Sedlek<br />\nSaturday night<br />\nGorilla: Audrey Sedlek tried to feel a cop Saturday<br />\nnight?<br />\nFred: Did you know that E.J. Korvettes stands for<br />\nEleven Jewish Korean War Vets?<br />\nMyself: Mary Lou Hooper's not much to look at, but<br />\nshe sure is a whiz at geometry.<br />\nStan: You hear the one about the American<br />\nbusinessman in Tokyo<br />\nI was lying to the guys I hadn't even asked Mary Lou<br />\nyet, let alone even gone out on a date with her. Put a few<br />\njiggers of Jim Beam in me and I'm likely to tell all. So the<br />\nnext morning I woke with a headache and an obligation<br />\nto ask Mary Lou to the prom. It wasn't going to be a<br />\npiece of cake, but at least I could try. And if I failed...<br />\nI'm convinced the Clint Eastwood sunglasses did the<br />\ntrick. I sauntered up to her table in the cafeteria wearing<br />\nmy tightest t-shirt, and without gulping, asked her for a<br />\ndate that Friday night, a scant two weeks before the<br />\nprom. She looked dreamily at me with those marbles I<br />\ncthink were her eyes and the words<br />\ncame out on<br />\nangel's breath, \"I'd love to!\" I'd by to. Christ, I could've<br />\nwet my pants. Luckily I made my escape by squeaking<br />\nout a lie, \"Excuse me, but I have a reservation to use the<br />\nweight room,\" which she accepted with that crinkle of a<br />\ngrin I soon learned to treasure.<br />\nLet me draw a picture of Mary Lou Hooper. Better,<br />\nhcre's her yearbook picture.<br />\n<br />\nby Mike Deak<br />\n<br />\n3. Why do<br />\nHummingbirds<br />\n<br />\nrs,<br />\nWho walks these locker-covered halls? Tradition, as Tevye<br />\nwould shout to the multitude. Tradition in the form of<br />\nthe ghosts of the innumerable illuminaries Somerville<br />\nHigh has given to the world. Here comes the most famous,<br />\nPaul Robeson, a man who needs no introduction and first<br />\nperformed Othello on the auditorium stage; also in show<br />\nbiz, Lee Van Cleef, a distant cousin by a great aunt, the<br />\nprince of spaghetti westerns; and a hearty top of the<br />\nmorning to those handsome boys in Varsity Club jackets,<br />\nCharley Winner, ex-coach of the New York Jets, and Joe<br />\nLis, platoon first baseman for the Seattle Mariners; and<br />\nfinally (the list has to end sometime) there's Gentleman<br />\nRay Bateman, favorite to defeat OTB (\"One Term<br />\nByrne\") in this year's gubernatorial race. With such<br />\nmodels, no wonder we thought the world was our oyster<br />\nand only the sky was the limit.<br />\nWe looked forward to the Senior Prom as eagerly as the<br />\nnatives of Capistrano look to the return of the swallows.<br />\nExactly why I don't know. Why do hummingbirds hum<br />\nVanity of vanities, the old ecclesiastical saying goes, the<br />\nrites of spring, Sioutfir, beauty, and virility. Unfortunately<br />\nI was familiar with none of the above, so I saw the prom<br />\nas a golden fleece of an opportunity to legitimize The Big<br />\nScore, the respectable and socially acceptable deflowering<br />\nof that bubbly tulip I had trained my beady little eyes on<br />\never since she moved here from Ho Ho Kus in seventh<br />\ngrade, the effervescent, ever lubricous Mary Lous Hooper.<br />\nThere must be something more to this native's model<br />\n<br />\nVisions of<br />\nranges and<br />\ne gnoirs<br />\n<br />\nMary Lou's on the left, and the other two mugs happen to<br />\nbe Stan Wertheimer and Isabel Horowitz who were our<br />\ndoubledate for the prom. If the phrase \"bottom of the<br />\nbarrel\" occurs to you, please be kind and remember that<br />\nbeauty is in the eye of the beholder, and, goddamit, we<br />\nwere desperate.<br />\nMix two parts memory and three parts desire and you'll<br />\nknow why Eliot called April the cruellest month. That<br />\nFriday came faster than Linda Lovelace (a little teenage<br />\nhumour, very little in fact) and I was a prime contender in<br />\na Maxwell Smart incompetency contest. I cut myself<br />\nshaving with an electric raxor, wore my underwear inside<br />\n,out, singed my scalp with my hot comb, and so on. I<br />\nconned my brother into lending me his jalopy, a<br />\nzooped-up '69 Cougar with its nose stuck up in the air<br />\nlike a blue-blooded Ivy Leaguer, which prompted Mr.<br />\nHooper to sarcastically chortle, \"When does the<br />\ncountdown begin, space cadet?\"<br />\n\"Wilbur,\" Mrs. Hooper screeched, \"remember your<br />\nmanners. Mike's our guest, you know.\" \"<br />\n\"Just joshin' son,\" h replied with a kind-hearted<br />\npunch on the shoulder that sent me groveling towards the<br />\ngutter.<br />\n\"Now you have Mary Lou back before midnight,\" Mrs.<br />\nHooper waved a matronly finger, \"she needs her beauty<br />\nsleep.\"<br />\n\"She better take an overdose of sleeping pills if that's<br />\ntrue,\" her younger brother Herb Hooper hissed.<br />\n\"How you like one 'cross your lips?\" Mr. Hooper<br />\nthreatened with his. Red Foxx impression.<br />\n\"Take care you two,\" her mother shouted as we drove<br />\naway,\"I know how I was when I was you age.\"<br />\n\"Parents,\" Mary Lou said with that french fry smile.<br />\n\"Yeah, parents,\" I replied, a graduate of the Gary<br />\nCooper School of Witty Conversation, summa cum lousy.<br />\nI suppose all these allusions to movie stars<br />\nunconsciously reveal the role flicks played in my<br />\neducation of social behavior outside the family. I think it<br />\nwas also Edmund Leach who said that myth and ritual<br />\nwere one and the same, or t least in merican culture,<br />\ntry to be. But enough of the theory. I took Mary Lou to<br />\n<br />\ndni<br />\nthe last remaining Jerry lewis Cinema in New JerseY<br />\nI<br />\npet<br />\nits<br />\nin<br />\n\"Frenzy,\"<br />\na<br />\nfilm<br />\nthat<br />\nHitchcock's<br />\nAlfred<br />\nway I th ught would set a romantic mood. And indeeivent<br />\ndid, as with the first shot of a naked corpse floating'\"„01<br />\nThames, her hand jumped into mind and stayed there<br />\nqtas<br />\nrest of the movie.<br />\n\"Wasn't that a good movie,\" I said driving to the at ofn<br />\nYork Inn in Raritan, an infamous local hangout who:<br />\nare not required if you slip the bouncer a buck. ri rchl<br />\nknow,\" she replied in a bashful tone,\"I don't like iv° Ito e.<br />\nti<br />\nthat scare you.\"<br />\n\"But it's only a movie, it's only a strip of caul Lik(<br />\npassing before a light bulb, it's not even human...\" leke ca<br />\n1t1S1<br />\n\"Well, let's not argue about it,\" Mary Lou said, :<br />\n4 an<br />\nhave a goodtime \"'<br />\n\"We'll have a pitcher of Rheingold,\" I told the yva:It1 Und<br />\nari<br />\nin my eighteen year old voice impression (I was,d qartt<br />\n'<br />\nseventeen and a half and only God knows how old<br />\nLou was.)\"You like beer?\"<br />\n\"I don't know,\" she sighed, \"I've never had any. (es,<br />\n4e, 0<br />\nHer words shot a dagger of excitement throu ,A<br />\nwou'\"<br />\nknd<br />\nhead. Oh my God, I thought, I didn't think it<br />\nthis easy. I mean, only in the Penthouse forum do e<br />\nlike this happen. Had I committed some social faux<br />\nwas she merely submitting to her primitive animal u<br />\nto let me take her in one glorious swoop and slie<br />\nmerely helping the situation along? I never knew, bd,<br />\nat that instant, Gorilla Muldoon dropped by with his s<br />\nances Tooty, and together they drank three-quarter<br />\nthe pitcher, and I had the other quarter, and MatY4<br />\njust sat there silently smiling and laughing when reci\"/<br />\nI wiped my mouth on my sleeve and coree<br />\nsuggested to Tooty and Muldoon, \"I think it's tiro (ji<br />\nhave to go.\" And we all got up and walked out t°<br />\nparking lot, said our goodbyes, and departed in oPP<br />\ndirections, Tooty and Muldoon off to North 131<br />\nwh re neither one lived (but where there was this ribi<br />\nlittle spot, you see, off Burnt Mills Road,....) and we<br />\nthrough Raritan to Somerville and home.<br />\n#<br />\n\"Well, we're home,\" I turned off one engine '<br />\n5'<br />\nfiguratively on another, \"did you have a good time?'')<br />\n'<br />\ne<br />\nShe looked at me with that glazed look in her eY,<br />\nwas the best time I've had this year,\" she whispere'to<br />\nthis a cue? I stretched my neck like an ostrich overei<br />\nand quickly like a mosquito, kissed her, and retfr<br />\nback to my corner to wait for her to ring the bell 1<br />\nnext round.<br />\n(itie<br />\n\"That was nice,\" she chirped, \"but it's too elv\"<br />\n79<br />\n<br />\n4<br />\n<br />\n\fth<br />\n<br />\n'It's<br />\n<br />\n•<br />\n<br />\nt° ,itinight,\" and a cold shower of silence dripped between<br />\neicp4;,' I thought of the old joke about the scientist who<br />\noe' vented a romantic toaster to pop the question. And I<br />\n(1,<br />\nere (10h Mike,\" she cooed, 'that would be absolutely<br />\ntastic. Yes, I accept your invitation,\" and landed a kiss<br />\nhe 4at fluttered like a butterfuly on my cheek. And she was<br />\nefe<br />\nt of the car in a jiffy, and up her front steps where the<br />\n'chlight<br />\ngleamed hope and love and all the comforts of<br />\ncoo<br />\nTite• \"See you on Monday,\" she called and disappeared<br />\nthe house without waiting for a reply.<br />\n'Ow Like a zombie I drove across town to home and parked<br />\nCar in the driveway. I was completely numb, as if the<br />\nritiSt had overdose me on Novacaine. I got out of the<br />\n.0 and looked up to the sky and, as my habit still is,<br />\nv\"nd On n and traced the figure of the hunter pointing<br />\n5 arrow at men.s souls. I regained feeling and was<br />\ntantly aware of a bulge in my jeans. Till that time I'd<br />\n4sidered myself a draft doger in the war between the<br />\nkes, but now I was committed to a cause. I had fallen in<br />\ngh eA,or at least I had convinced myself<br />\nof that.<br />\n)<br />\n1it'<br />\nInd hummingbirds hum because they ,don't know<br />\ntli<br />\nords.<br />\n1/1<br />\n<br />\nhe<br />\n<br />\nis d'<br />\nteis<br />\n<br />\n4°0'<br />\nfef<br />\nfoe t i<br />\nto<br />\n<br />\nos<br />\n<br />\night<br />\n<br />\nAs those great pedagogues of pederasty, Hermans<br />\nHermits, have n ted, on such a night as Prom Night<br />\nthere's a kind of hush all over the world and people just<br />\nlike us are falling in love. Falling in love.<br />\nTradition taught us that the Prom -itself was not as<br />\nimportant as what happened after the Prom. The Prom<br />\nwas just the stuffing for this turkey of a ritual. Stan and I<br />\nmade the shrewdest of plans; a quick midnight snack<br />\nafterwards at the refurbished Bridgewater Diner, and a<br />\ndrive East, to either New York, for some more partying,<br />\nor to the Shore, and a litt e rom nce. I pr ferred the<br />\nlatter; a fantasy keeping me awake nights had Mary Lou<br />\nand I cavorting on some Caribbean beach, the two of us<br />\nalone, running hand in hand as the eaves, endless waves,<br />\nlapped our ankles<br />\nWe decided to take Stan's car, a machine that had all<br />\nthe smell and color of a lemon , a 1970 Ambassador<br />\nStan's father only bought because American Motors<br />\nsponsored the Mets games on television. It wasn't the<br />\nbest-looking car; in fact Mr. Hooper remarked, \"What<br />\nhappened? The pickup have a flat tire?\"<br />\n\"Wilbur!\" Mrs. Hooper scrreched again,.'sometimes I<br />\nwonder.\".<br />\n\"Is Mary Lou ready yet?' I squawked, my necl<br />\nsqueezed by a boa constrictor of a necktie. Note of<br />\nexplanation: this was 1974 so standards of dress were<br />\nrelaxed to allow what Amy Vanderbilt calls<br />\n\"semi-formal\" attire.<br />\n\"She's busy getting plastic surgery,\" Herb sneered,<br />\n\"You better hope they don't take the bandages off till<br />\nnext week.\"<br />\n\"How would you like me to part your hair with a<br />\ncrowbar,\" Mr. Hooper shook a first at him.<br />\n\"Why Isabel, you look just like Deanna Durbin,\" lrs.<br />\nHooper praised, \"oh but you kids are too young to<br />\nremember her.\"<br />\n\"Mike, do you have protection?\" Mr. Hooper asked witl<br />\na chiseled grin.<br />\nI nodded my head, thinking of the four fiesta-colored<br />\nTrojans -- \"The Korvette of the Contraception scene\" -stuffed in my pocket along with the Maalox, and realizing<br />\nhe must have meant something else, blurted out,\"Oh yes,<br />\nAllstate. Don't worry sir, your Mary Lou will be in good<br />\nhands.\"<br />\n\"Well, just watch where you put those good hands,\" he<br />\nm cked with a wink of his left eye.<br />\nJust then Mary Lou appeared. I gasped out of surprise.<br />\nShe was actually good-looking as she, wearing a saffron<br />\ndress with a neckline that played footsie with her cleavage<br />\nand her pimples covered by so many layers of make-up I<br />\nwondered if her Avon lady could have retired to Miami<br />\nBeach on this commission, waltzed towards me.<br />\n\"You look absolutely stunning,\" I said. (\"Stunning?\"<br />\nStan whispered, \"What is he blabbering about?\" I'd<br />\nforgotten to tell him I had watched Dan Daily movies for<br />\nthe past month to gain insight into suave, sophisticated<br />\nbehavior.) \"Shall we go,\" I said taking her arm and then<br />\nturning to her parents, \"Ta-ta.\"<br />\n\"Oh Wilbur,\" Mrs. Hooper swooned, \"chivalry isn't<br />\ndead.\"<br />\n\"It's vaudeville that's dead, Hedda,\" he answered,<br />\n\"vaudeville.\"<br />\nAs we drove away, I said to Mary Lou,\"Your mother's<br />\nname isn't really Hedda, Hedda Hooper is it?\"<br />\nShe smiled that shoestring smile, \"Parents.\"<br />\n\"Yeah, parents,\" I replied. Tht evening was off to a<br />\ngreat start.<br />\nMartinsville Inn sits hidden somewhere in the Watchung<br />\nMoutains north of Bound Brook, and Stan, ever the<br />\nclown, put lead in his foot and tok the dangerous hairpin<br />\ncurves at near fifty. \"It's macho,\" he explained to our<br />\ndates.<br />\n\"It's not macho anything,' Isabel laughed like a<br />\nlooney and inched over towards Stan. A feeble smile<br />\ntwitched my lips as Mary Lou slinked towards me. What<br />\nhappened next was a case of bad fate. The moment her<br />\nhand landed on mine in a tight clench of safety, I sneezed,<br />\nand instinctively, brought my :hand up to my mouth with<br />\nher hand coming along for the ride. It was a particularly<br />\nbrothy sneeze and I was at a loss of words. \"I didn 't get<br />\nyour hand wet, did I?\" And she shook her head, and took<br />\nher hand away to adjust her corsage. When she wasn.t<br />\nlooking, I wiped my hand on the car seat, not wishing to<br />\ndig into my pocketful of miracles for a hankie.<br />\nThe theme for the Prom was \"Guys and Dolls,\" but<br />\nnobody could tell it from the sleazy rock band, a bunch<br />\nof local punks called \"The Wild Strawberries,\" who didn't<br />\nknow \"Fugue for Tinhorns\" from \"Stairway to Heaven\"<br />\nThe Decorations Committee had been hit with a case of<br />\nmono and, consequently, there was a notable lack of<br />\ndecorations, so it didn't really seem like a Prom. But our<br />\nhearts did not despair; we were rebellious children,<br />\ncontemptu us of anything reeking of Tradition, th ugh<br />\nat the sale time deeply guided by the precepts of<br />\nTradition. No wonder that 5% of our class (by latest<br />\ncount) had found their way into the Crackerbox Palace.<br />\nWe were treated to the typical Martinsville Inn dinner,<br />\nthe same fare of anti-pasta, manicott, filet mignon half<br />\nbaked potatoes, and vanilla ice cream with \"sprinkles,\"<br />\nmy father's lkowling league banquet had. But the food<br />\nwas washed down by .a special presentof the Faculty Club,<br />\nglasses of slightly foxy Cold Duck that made our tongues<br />\nthe lucid instrume ts of witty execution one ;would<br />\nexpect of the Three Stooges at a debutante ball.<br />\n\"With the amount of Christians around here,\"<br />\nrem rked Murray Rabinowitz, the class valedictorian and<br />\nalso headed for Hopkins,\"they should call this 'Goys and<br />\n<br />\nDills.'\"<br />\n\"Did you know what you are, Murray?' I gal...Tied.<br />\n\"you're a J.A.P., a Jewish-American Poet.\" Mary Lou's<br />\nlaughter shrilled in my ear, \"Goodness woman, are you<br />\ntrying to make me another Norm Crosby?\" which only<br />\nelicited more laughter.<br />\nStan had been nibbling on Isabel's ear for the last half<br />\nhour while Mary Lou and I boogied on the dance floor.<br />\nWe hardly ,got within two feet of each other and our eyes<br />\nconcentrated' roo much on each other's movements to<br />\nhave any meaningful contact. And after we danced, we<br />\ndrank and the hours flew by without our t noticing and<br />\nthe 'band. was playing \"Rikki, Don't I Lose That<br />\n'Number' for the fifth time when Stan and Isabel briefly<br />\ninterrupted their ear-nibbling and suggested we move on.<br />\nIt was quarter to three and neither of us really cared, the<br />\nCold Duck had taken control, and Mary and I were busy<br />\nexchanging life histories. \"Ah but I was born with a cleft<br />\npalate and a harelip. Top that!\"<br />\ni\"My sister died of leukemia,' she replied. It was the<br />\nonly serious moment of the night and somebody turned<br />\noff the lights, a situation 4 j. took advantage of by<br />\nsnuggling .up and giving her a kiss slightly more \"mature\"<br />\nthan the one in the car. The lights came back on, and the<br />\nprom was'oyer, and I felt as if nothing had happened, as if<br />\nthe Prom was just a big fake, a dreadful hallucination. I<br />\ndidn't feel any differently, and I was sober enough to<br />\nrealize all the trauma had gone for naught.<br />\nThe coup d' grace. Once back in the car, Stan slipped<br />\nthe secret weapon out of his pocket, a big fat joint<br />\nwrapped in pink paper. \"How you young ladies like to<br />\nget a case of reefer madness?\" he gurgled.<br />\nThey were too far gone to offer any idealistic resistance<br />\nso the joint, like country doctor, made its rounds.<br />\n\"Stan,\" I shouted. \"You just went through a stop sign.<br />\nYou want us get thrown in the klinker? Don't you know<br />\nwhat stopitneans?\"<br />\n\"Squeal tires on .'ilavement?\" and bellowed with that<br />\ninsidious laughter. I grabbed t .joint my Mary Lou who<br />\nhad been fondling it for . thd past five minutes and<br />\nimmediately burned my firer. The joint fell to the floor,<br />\nand out of anger, my foot fell on the joint, and that was<br />\nthat. We were now headed east on Route 22, an asphalt strip<br />\nof decadent commercialism which lead to the small<br />\n_scatter point graph of lights in the distance of New York<br />\n\"Where are we going?\" Mary Lou<br />\n\"Did you know that Mery Griffin sang What a Lovely<br />\nHunch ot Cocoanuts' when he Was with Freddy Martin in<br />\n1949?\" I replied, my mind on other than the obvious.<br />\n',You're so kooky,\" she sighed, and rested her head on<br />\nmy shoulder.<br />\n.\"Kooky, kooky, lend me your comb,\" I ditted and<br />\ngently stroked her hair. We were almost to Springfield<br />\nwhere the highway splits and. Stan was speeding along,<br />\nIsabel's'hand in his lap.<br />\nI'll reme ber this night for ever,' Mary Lou<br />\npurred, °it's been so much like heaven on Earth .1 could<br />\nalmost cry.\"<br />\nLittle, did she suspect that in just a few moments she<br />\nwould plead with Stan to stop the car in the parking lot<br />\nof the 'famous flagship) so she 'could lurch to a light pole<br />\nand puke all. the food'and drink she'd had for the past<br />\nthree months. , It, was not a 'particularly pretty sight;<br />\nseeitig her dress shudder with every retch made my own<br />\nstomach grumble.<br />\n\"1 think we better bag the trip to the shore,\" I told<br />\nOtan.\"You want some Maalox, Mary Lou?\"<br />\n<br />\n\"Well, Somerville's not French Lick, Indiana,<br />\nwhispered to her. We were sitting in her back yard on<br />\nsome rusty lawn furniture watching the sun rise.<br />\n\"Mike, sometimes I don't understand anything you<br />\nsay,\" she smiled weakly, c`but that's why I like you so<br />\nmuch.\"<br />\n\"Visions of oranges and peignoirs, my dear,\" I replied,<br />\n\" that's what I see in you.\" My eyes lingered to the East<br />\nwhere the sun was now rising through the lowest<br />\n*branches of the catalpa tree, and all th fantasies of<br />\nMary Lou and me on the beach at Lavalette, i* ntertwined<br />\nan the sand, and lett* the first lavender sweeps of<br />\nsunl4ght brush over us. entered my mind. The mammoth<br />\nscale Of my self-delusionment suddenly became obvious<br />\nand a shr ud of sleepiness suddenly came over me.<br />\n\"I really must go,\" I said and bent over to kiss her.<br />\n\"Prase don't\" she pulled away, \"there's still vomit<br />\non my lips.\"<br />\nI remember 'little: of the walk home. Isabel and Stan<br />\nhad driven off to their lovenest and I was left alone to<br />\ncontemplate my fate. What was to come of me?<br />\nI slipped between the sheets and made ready f4r my<br />\nexcursion into the land of the Sandman.,I heard the first<br />\nrumblings of morning; my mother shufftngabout in her<br />\nsmile slippers and putting the bacon to fry; my father<br />\nclearing his sinuses and his urine cascading into the toilet<br />\njust the other side of the hall.<br />\nI had returned to Earth, Amen.<br />\n<br />\n\fpage 10/news-letter/may 3, 1977<br />\n<br />\nFREE<br />\n<br />\nNEWS-LETTER<br />\n<br />\nMa' 7 Hidden Fortress<br />\n!vlat.) 2! Emperor Jones<br />\nMatj,?.8 Lavender Hill. Mob<br />\nJune 4 Stagecoach<br />\nJunell Gansho, The Batli-Pf<br />\nJune 15 Pygmalion<br />\njune 25- Autumn Afiernoon<br />\nJuly 9 Red beard<br />\nJu1y15 FRIDAY H h and Low<br />\nJulyI6 Magni ficen+ Amber3ori5<br />\nJuly E3 The Lady Variiiies<br />\nJu1930 Nor+h bi Nor-ihwe -1Aug 6 Gospel According -to St frinfthew<br />\nAug 13 City L.1010-:<br />\n;<br />\n- / Modern Mites<br />\nAckg E0 Brief Encounter<br />\nAug 27 Threepenny Opera<br />\n<br />\n9:30<br />\nSATURDAY<br />\n<br />\nELECTIONS<br />\nTuEsdAy, MAy 3<br />\n5:30 P.M.<br />\nIN ThE GATEhOUSE<br />\nALL NEWS-LETTER STAFFERS<br />\nMUST ATTEND<br />\n<br />\nCOME ANd<br />\n<br />\nVOTE<br />\n<br />\nbETTER<br />\n<br />\nFOR A<br />\nNEWS-LETTER.<br />\n<br />\nC<br />\n<br />\n\"DON'T BE<br />\nIND\"<br />\n<br />\nAnnouncing the<br />\nColeman Award<br />\nRecipients:<br />\nThe Coleman Awards are presented<br />\nannually to the individuals who submit<br />\nthe best pieces of prose or verse to the<br />\nHopkins literary journal,ELLIPSIS (fors<br />\n-merly Collection of Words).The purpose<br />\nof the awards is to recognize the<br />\nachie'vements of the University's finest<br />\nwriter.\".<br />\n<br />\nPROSE AWARD<br />\n<br />\nFrederick Barthelme<br />\nMoira Crone<br />\n<br />\nACADEMIC INTEGRITY<br />\n<br />\nIS YOUR RESPONSIBILITY<br />\n<br />\nPOETRY AWARD<br />\n<br />\nIf you have any questions or complaints, please contact<br />\nthe Undergraduate Academic Ethics Board At:<br />\n<br />\nScott Wright<br />\n<br />\n-Box 1280,Gilman Hall<br />\n•The Student Council Office<br />\n• The Dean Of Academics<br />\nAML<br />\n<br />\n\fmay 3, 1977/news-letter/page 11<br />\n<br />\nATTENTiON CLASS Of '78<br />\n<br />\nThe Office of the Chaplain<br />\nand<br />\n<br />\nThe Baltimore Hebrew College<br />\n<br />\nFOR ChAiRpERSON(S)<br />\nof ThE SENIOR CLASS FILM<br />\nSERIES will bE FRiday, MAy 6.<br />\nSELECTIONS<br />\n<br />\npresent<br />\n<br />\nViewing time is<br />\napproximately 4/<br />\n1<br />\n2 hours<br />\n<br />\nFOR GRADUATION<br />\nCOMMITTEE will bE MoNdAy,<br />\nMAy.9.<br />\n<br />\nSELECTIONS<br />\n<br />\nProduced and))irected by Marcel Ophuls<br />\nA Hamilton Fish/Max Palcvsky Production A Paramount ntlease<br />\nPIi n 1111.<br />\n..<br />\n•<br />\n<br />\n.•<br />\n<br />\nSunday May 8<br />\n11.00 a.m.<br />\nShriver Hall Auditorium<br />\nJohns Hopkins University<br />\n<br />\nINTERVIEW SigN-Up ShEETS ON STUdENT<br />\n<br />\nCharles & 34th Street<br />\nCOUNCit dOOR - OR - CONTACT<br />\n<br />\nAdmission is FREE<br />\nBET11<br />\n889-0942<br />\nBox 190<br />\nMARy<br />\n<br />\nThere will be a 45 minute intermission for lunch.<br />\nA catered Kosher lunch will be arailable.<br />\nReserrations can he made by calling 338-8187<br />\n<br />\n•<br />\n<br />\nThe Student Council<br />\nSelections Committee<br />\nwill hold selections for<br />\nfour C.U.S. members<br />\nfor 1977-1978<br />\nThe C.U.S. (Committee on<br />\nUndergraduate Studies) is a<br />\npolicy-making committee<br />\nconsisting of five faculty<br />\n,members & four students.<br />\nSign up for interviews 6:30 p.m.<br />\nin the Student Council Office<br />\n<br />\nTues., May 3,1977 If you have<br />\nquestions ,please contact Steve<br />\nLovejoy 523-2461or Patrice<br />\nGallagher 366-4234<br />\n<br />\nfRom ThE diREcToR of NASHVILLE Awl M*A**H<br />\n<br />\nPAUL NEWMAN<br />\n<br />\nProduced and Directed by<br />\n<br />\nROBERT ALTMAN<br />\n<br />\nFRI MAY 6 SHRIVER HALL<br />\n<br />\nSAT MAY 7 MERG.. 111<br />\n<br />\n730 & 10:00<br />\n<br />\nAdmissio. 51.00<br />\n<br />\npRESENTEd<br />\n<br />\nby<br />\n<br />\nThE STUdENT<br />\n<br />\nCOUNCit Film<br />\n<br />\nSERiES<br />\n<br />\n\fpage 12/news-letter/may 3, 1977<br />\n\\ FOR CENTURIES THEY WERE HUNTED<br />\nFOR BOUNTY,FUN AND FOOD...<br />\n<br />\n\"The Sumcias Experience\"<br />\nThe Office of the Chaplain<br />\nand<br />\nHebrew College<br />\nBaltimore<br />\nThe<br />\n<br />\nN-L<br />\n<br />\npresent<br />\n<br />\noutakes<br />\nSpare Time?<br />\nThough spending an average of<br />\nfourteen hours a day at the<br />\nstation, George Lewis still, has<br />\nenough \"spare time\" to teach a<br />\ncourse on motivation and<br />\ngoal-setting at the Maryland<br />\nInstitute of Broadcasting. Lewis<br />\nbelieves that only 4% of the<br />\npeople do all the work, while the<br />\nother 96% merely exist. He<br />\nbelieves this is caused by the<br />\nAmerican educational system<br />\nthat teaches \"what can't be done,<br />\ninstead of what can be done!\"<br />\n\"Listen\", he said, \"there isn't<br />\nanything you can't do in this<br />\nworld if you really want to do<br />\nit.\"<br />\nFuture Plans<br />\nAs production director,<br />\nGeorge Lewis was proud to<br />\nannounce Channel 45's recent<br />\nacquisition of the Warner<br />\nBrothers cartoon package,<br />\nincluding Bugs Bunny, Daffy<br />\nDuck, Foghorn Leghorn, and<br />\nRoadrunner, which will usher in<br />\nthe new academic year next<br />\nSeptember. Also in the coming<br />\nmonths will be the return of \"I<br />\nlove Lucy\" and the Ingmar'<br />\nBergman film festival on Monday<br />\nnight.<br />\nOn April 7, Captain<br />\nChesapeake will appear on the<br />\nungodly stage of a roller derby<br />\n(\"You see,\"he says with a smile,<br />\n\" my appeal is wider than you<br />\nthink.\") merely to attract<br />\ncustomers. To promote this,<br />\nCaptain C. is having a contest<br />\nwith ten pairs of championship<br />\nroller derby skates as prizes. The<br />\naddress is: Roller Skates,<br />\nWBFF-TV, Baltimore, Maryland,<br />\n21211. Please include your name,<br />\nhome address, and, most<br />\nappropriately, your age.<br />\n<br />\n• Viewing time is<br />\napproximately 4% hours<br />\nProduced and Directed by Marcel()Owls<br />\nA .4.11ton Fle17.9.4.PaliNdry Production A Parami.ni<br />\n<br />\n11:00 a.m.<br />\nSunday May 8<br />\nShriver Hall Auditorium<br />\nJohns Hopkins University<br />\n<br />\nEDWARD L. MONTORO Presents a WILLIAM GAOLER Film DAY Of THE ANIMALS Starring CHRISTOPHER GEORGE<br />\nLESLIE NIELSEN •LYNDA DAY GEORGE • RICHARD JAECKEL • MICHAEL ANSARA land RUTH ROMAN as SHIRLEY I<br />\nMusc A10 SCHIFRIN•Written byWILLIAM NORTON& ELEANOR E NORTON. Directed byWILLIAM GIRDLER<br />\nProduced by EDWARD1 MONTORO .0 HIM VENTURES INTERNATIONAL RELEASE<br />\nNew a terrifying paperback trorn BAL t ANT INE BOOKS 01977, EVI, INC.<br />\nilmed in TODD AO 35•COLOR BY DELUXE LP_IttoRT,i7111<br />\n<br />\nCharles & 34th Street<br />\n<br />\nAdmission is FREE<br />\nThere will be a 45 minute intermission for lunch.<br />\nA catered Kosher lunch will be available.<br />\nReservations can be made by calling 338-8187<br />\n<br />\nOPENING MAY 25th<br />\nat a theatre or drive-in near you. ..kikv.a<br />\nLook for this ad in your local newspaper for theatre and time.<br />\n<br />\nMONUMENTAL!<br />\n<br />\nThe<br />\nchallenge.<br />\neach<br />\nYour challenge is to enter numbers in the empty boxes below so that<br />\nvertical column and horizontal row will add up to 100.<br />\n<br />\nlast<br />\nMarch<br />\nclassitieds<br />\nTYPING - Beautiful Work.<br />\nSpecialty: Medical<br />\nTerminology. Call<br />\n-Thursday; 486-8337<br />\nFEMALE ROOMMAT<br />\nWANTED. Quiet townhouse<br />\nnear Hopkins. Call 532-9159<br />\nor 358-3710.<br />\nSPANISH by experienced nativ<br />\nteachers - All levels, all ages.<br />\n366-2056.<br />\nTwo students want to take care of,<br />\nvacationer's home during the<br />\nsummer months Call:366-5286.<br />\n,. Quality<br />\n1<br />\n<br />\nTyping 4674)342. .<br />\n<br />\nI<br />\n<br />\n.4<br />\nAPARTMENT TO SUMMER<br />\nSUBLET. ONE BLOCK FROM<br />\nHOMEWOOD. FEMALE<br />\nPREFERRED. 462-1057.<br />\nProfessorial couple requires fully<br />\nfurnished apartment Of house for<br />\nacademic year 1977-78, September<br />\n1 through June 1. Two bedrooms<br />\nplus study ideal, near Homewood<br />\ncampus. Prefer no more than<br />\n350-400 rent. Call Katherine<br />\nVerdery at 366-5055 or 338-7267.<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\n• The Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nELECTRICAL TRAINEE - Part<br />\ntime 828-8081.<br />\n<br />\nPABST. Since 1844.The quality has always come through.<br />\n<br />\nGRADUATING SENI0RS1<br />\nWANTED!FOR SALES IN SOLAR<br />\nENERGY AND INSULATION<br />\nPRODUCTs. CALL FOR DETAILS301-484-6885. MR. DAVID.<br />\n<br />\nWis Peoria Heights III<br />\nC191/ PABST BREWING COMPANY Milwaukee<br />\n<br />\n61/1 It 6Z OZ • CZ OZ<br />\n<br />\nNewark NJ Los Angeles Calif Pabst Georgia<br />\n<br />\nEt OE • IC SZ 1Z VI 6• CI 8L /Z 1/9I • CI 01<br />\n<br />\nez 1/<br />\n<br />\n;riv grollog oi do! wog SM,11 IPIU0711,44 31011.10.6<br />\n<br />\n\fmay 3, 1977/news-letter/page 13<br />\n<br />\nBILL'S<br />\nUniversity Sandwich<br />\nShoppe and 1 Deli<br />\n<br />\nUNIVERSITY OF PARISSORBONNE<br />\nSUNYJNEW PALTZ PROGRAM<br />\n7th YEAR<br />\n<br />\nUndergraduates in philosophy and<br />\nrelated majors earn 30-32 credits in<br />\nregulsr Sorbonne (Paris IV) courses.<br />\nSUNY-Paris IV agreement insures<br />\nstudents avoid cumbersome<br />\nPre-inscription and attend Paris IV,<br />\nnot provincial universities. Director<br />\nassists with housing, programs,<br />\nstudies. Orientation, language<br />\nreview. Sept. 15-.1.upe 15. Estimated<br />\nrAirnees;tu<br />\n$.<br />\n1 49%<br />\nrof<br />\nP. Charlson, Philosophy<br />\nDept,<br />\nS.U.C. New Paltz, New York 12561.<br />\n(914) 257-2696.<br />\n<br />\nEducated Beer<br />\nTastes Prefer<br />\n<br />\nBEES<br />\nIMPORTED BEER<br />\nimp<br />\n••••1<br />\n••<br />\n<br />\n•<br />\n<br />\n0<br />\n<br />\nAn epicfantasy of peace and magic.<br />\n<br />\nRESTAURANT AND CARRY OUT<br />\nAll Lump Crab Cakes<br />\nGenuine Kosher Corned Beef<br />\nDelicious Roast Beef<br />\n<br />\nUNIVERSITY PARKWAY<br />\nAT ST. PAUL<br />\nBaked Virginia Ham<br />\nLobby, University One Apts. Various<br />\nCold Cuts<br />\nPhone: 467-6262<br />\nCheese(Swiss, Pro vologne, Muenster)<br />\nMon-Fri: 9:30-7:00<br />\nKosher Hot Dogs<br />\niSat:9:30-2:00<br />\nCatering<br />\n,Closed Sundays<br />\nFREE SODA WITH<br />\nTHIS AD AND<br />\n•<br />\nPURCHASE OF $1<br />\n<br />\n:OTH CENTURY.FOX PRESENTS<br />\n<br />\nA RALPH BAKSHI FILM<br />\n<br />\nParty Trays(Special Orders)<br />\nPizza<br />\n<br />\nHome Made Dessert(Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br />\n<br />\nIPGIputEm.<br />\n,......„....,mom<br />\n. ,•. . =MVO<br />\n., . . 42,,;<br />\nft ,111.64.<br />\n<br />\n1<br />\n<br />\nWIZARDS<br />\n<br />\ncol,\"bi I h• 1 \",,' • c 19'7 Tyrent.eth Century Foy<br />\n<br />\nNOW SHOWING<br />\nHARFORD MALL CINEMA<br />\nHorford Moll Shp. Ctr, Bel Al<br />\n838-6688<br />\n<br />\nqtraurArsurArerArArarAndrourAndrArAmarArArAndr•Pur•rarArArArAvarAr<br />\n<br />\nI<br />\n<br />\n/44.1.<br />\n.•<br />\n<br />\nCINEMA HARUNDALE<br />\nHorundole Moll Shp. Or.<br />\nSO. 1-6055<br />\n<br />\nNORTHPOINT PLAZA<br />\n<br />\nIlltwy. Ext. 40 Northpoint Nr. Merritt<br />\n288-9294<br />\n<br />\nAraurAnffArAwarArArAnsurirAriraranimmorati<br />\n<br />\n• *<br />\nS,9•P 84'<br />\nirk<br />\n<br />\nBECK,BEER<br />\n\\141 1M)<br />\n•eiv<br />\n<br />\nBrewed in West<br />\nGermany for<br />\n800 semesters!<br />\n<br />\nEnjoyed in<br />\n140 Countries!<br />\nGraduate to Beck's!<br />\n<br />\nBeer Mug Offer!<br />\nhe.v Acck.,<br />\nliver<br />\n<br />\nMow. 41 %cry special<br />\nlow price where •()L, buy<br />\nlie(k': Beer.<br />\n<br />\nImported Is% Dribeck, L.I., N.V.<br />\nITT \\Id.<br />\nF.P. \\‘'inner<br />\n<br />\nNAT'L MEDI AL BDS.<br />\nFLEX • ECFMG • DAT<br />\n<br />\nMCAT<br />\n<br />\nwith confidence<br />\noirigiriai study materials<br />\nsmall groups • tape center<br />\nsummer & compact courses<br />\nCALL<br />\n(202)<br />\n244-3010<br />\nEDUCATIONAL CENTER<br />\n4201 Connecticut Avenue, N.W<br />\nWasnington, D.C. 20008<br />\n<br />\nMTN<br />\nCOMM&<br />\nABORTION<br />\nSENO.<br />\nHILLCAEST cutaca<br />\n<br />\nL<br />\n<br />\nMOKS<br />\nI ERvicE<br />\nPm)7•4410<br />\n<br />\n.111111111111111 Mao 110101 MIMI MOO asp<br />\n<br />\nkiSINESS<br />\n<br />\nOPPOP1<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nBoston,Mass.02110<br />\n<br />\nPut your expensive eye<br />\nbehind our inexpensive System 35...and WOW<br />\nJust about any of the great photographs you see<br />\ncould. have been taken with Vivitar System 35.<br />\nPlus one good eye. Vivitar System 35-is a most<br />\ninexpensive way to get serious about photography<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1/1000 to 1 second plus \"B\" for time exposure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/Built-in hot shoe/Self tirrier/<br />\nFilm-in-chamber indicator/ASA Range<br />\n5-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br />\n<br />\n©Ponder & Best. Inc , 1977<br />\n<br />\n9,volt alkaline tat!ery. Vivitar Automatic<br />\n135mm f2.8 lens Soper foca! length „<br />\nfor portraits/ Aboui 2'2 tirn'esiajger than<br />\nnormal image Vivitar 2X Tale Converter<br />\nDoubles the effective focal iendth of<br />\nlenses/Converts the 50mm ierts. to 100mm.\"<br />\nthe 135mm lens to 270m,Viviiar Ent-kir°<br />\nCase Carries thr,.: entire :ystem comfortably and securely while hiklng cycling.<br />\nskiing. etc Find the nearest Vivitar dealer ana<br />\nask for a demonstration.<br />\nr<br />\n<br />\nMarketed :n the U S A bi Ponder & Best. Inc<br />\nCorporate Offices 1630 Stewart Street, Santa Monica,<br />\nCA 90406 !n Canada VIvitar Canada Ltd./Ltee<br />\n<br />\nVivitar. System 35<br />\n<br />\n41,4111CdrigilKdrallgetalralr/IIK/FAIKIMIKAKIrillgiVAIIIIPArAdr<br />\n<br />\nidgdgetdrAPIREPUICArdgdrArdlEir/r/ItilKIIIIIIIIIKIIIIIIIIndrIlr<br />\nigdP21,441KIP'<br />\n<br />\n\fpage 14/news-letter/way 3, 1977<br />\n<br />\nBaseballers gain<br />\nNCAA playoff berth<br />\nBy AL DANIELS<br />\nThe 76-77 baseball season was good sometimes and<br />\ngreat most of the time. In tjie early spring, the Blue Jays<br />\nshared their limited facilities with the Orioles, with the<br />\nhighlight being Jim Palmer pitching batting practice — a<br />\ntask he doesn't perform for his own team. The Jays have<br />\ndisplayed prowess at the plate, but despite that have been<br />\ninconsistent in the field. When they play errorless ball<br />\nthey have been worthy of their national ranking and have<br />\nbeen invincible.<br />\nLast Saturday, though, the team's limitations came to<br />\nthe forefront as a giant-killing Swarthmore team helped<br />\nthe Jays ease into a co-championship with the Widener<br />\n'Millionaires' in the MAC Southeastern division.<br />\nThe action really began Friday when the ball team<br />\ntraveled to Franklin & Marshall to meet the champs of the<br />\nWestern division of their bracket of the MAC in what<br />\nshould have been a preview of the playoffs. The clawing<br />\nBlue Jays wok an easy game from a solid opponent<br />\nleading most of the game by three or four runs.<br />\nThe final tally was 6-4 with the batting hero senior Bob<br />\nBabb who stroked a home run out of the Lancaster, Pa.<br />\nstadium on the second pitch of the hame. Also<br />\ncontributing were Rick Law, whose offense of late has<br />\nbeen impressive, and Frank Parreira, who is climbing<br />\ntowards the .400 mark in hitting.<br />\nJason Sussman's strongest pitching of the year baffled<br />\nF&M until he tired after seven and gave way to relievers<br />\nBurns and Parreira who picked up the save. The team's<br />\ndefense was excellept throughout the contest.<br />\nSaturday, the Jays split a doubleheader with the<br />\nSwarthmore Garnet. Hopkins should have handled the<br />\nvisitors with relative ease, especially , after their<br />\ndestruction of athletic powerhouse F&M.<br />\nThe game began as it should have ended. After two of<br />\nthe first three men to face the Garnet hurler walked,<br />\ntimely clean-up hitter Dave Lewing cracked a double<br />\ngiving the home Jays a 2-0 lead.<br />\nBur 'OK pitching' from the visitors' best man, seven<br />\nwhopping err ors by our defense, and a partisan<br />\n<br />\nSwarthmore crowd on Hopkins' own field combiOd to<br />\ngive the visitors an inspired 8-5 first game victory<br />\nOn the mound for JH, Mike Santo pitched valiantly but<br />\nhis sore shoulder prevented him from completing the<br />\ngame. Mike's exit paved the way for a Swarthmore revival<br />\nand 4 run outburst in the 6th of seven innings. Hopkins<br />\ncountered with three in their half of the inning but the<br />\nrally fell short with a man stranded on third base.<br />\nThe Blue Jays did a turnabout in the second game as<br />\nthe ace ot the staff Steffan Burns pitched a no-hitter<br />\nthrough the first out of the last inning. The final score<br />\nwas 5-2 with the bat of Brad Rosborough knocking in the<br />\nwinning runs. Rosborough has consistently gone out and<br />\npummeled the other team each game he has played this<br />\nyear.<br />\nThe final tote for the regular season finds the Jays as<br />\nimpressive as last year's excellent team. Junior co-captain<br />\n<br />\nDave Emala has established himself as one of the finest<br />\nhitters in the country at any level. Senior co-captain Bob<br />\nBabb who has played outstanding defensively also leads<br />\nthe team in numerous offensive departments.<br />\nOutfield leader Dave Lewing and undefeated pitchers<br />\nSteffan Burns and Jason Sussman are the only other<br />\nreturning veterans from last year's team who will be back<br />\nnext year as only two seniors are departing.<br />\nAlso returning will be outstanding forst year men<br />\nFrank Parreira, Mike Santo, Brad Rosborough and at least<br />\nfour other starters. This group unlike the Widener-styee<br />\nrecruits are going to school while they win ballgames.<br />\nThe 15-6 Blue Jays will face off with Widener this<br />\nweekend in a play-off for the right to play Franklin &<br />\nMarshall, with the winner of the F&M game representing<br />\nthe Southern Division of the MAC in the NCAAplayoffs.<br />\n<br />\nCoekey trackers perform consistently well<br />\nDespite a 5-6 Fecord so far this spring, the Blue Jay<br />\ntrack learni has performed consistently well and has<br />\nestablished several new university' records.<br />\nThese new Hopkins standards include Jim Kennedy's<br />\n14:15.6 in the three-mile run and Bob Freamon's 4:19.3<br />\nin the one-mile race. Not only do these times represent<br />\nnew school records, but they are also the top<br />\nperformances this year in the MAC.<br />\nHowever, an overall lack of team depth has been deadly<br />\nfor the JHU thinclads. Success in track competition is<br />\ndifficUlty with'a small squad and the Jays' meet record<br />\nseems to bear this contention out.<br />\nOn April 12, the Blue Jays travelled to Lebanon Valley<br />\nCollege to participate in a three-way meet between<br />\nthemselves, their hosts and Washington College. When the<br />\ndust had finally cleared, Lebanon Valley had amassed<br />\n102.5 points, JHU had garnered 58 points and<br />\n<br />\nWashington had come across with only 20.5 points.<br />\nThe strength of the Hopkins effort was concentrated in<br />\nthe running events. Speedster Matt McLin, a freshman<br />\nfrom Hanover, Pal, showed the way in the sprint events.<br />\nplacing second in both the 110- and 220- yard dashes.<br />\nThe Jays literally ran away from the rest of the field in<br />\nthe distance run events. In the 880, Bob Alworth topped<br />\nthe field, while Tom Kepple and Bob Safier finished<br />\nfourth and fifth respectively. The one-mile run saw a JHU<br />\nsweep of the top three spots, with Freamon, Kennedy and<br />\nTim Whitcombe coming across the finish line in that<br />\norder. The ending of the three-mile also looked lixe a<br />\nmass gathering of Blue Jays, with Kennedy, Freamon and<br />\nWhitcombe finishing one, two, four.<br />\nOn April 16, the team travelled to Haverford for a meet<br />\nthat Head Coach Randy Cockey later called \"the low<br />\npoint of the season.\" The Jays were missing several key<br />\n<br />\nperformers and ended up losing to their hosts, 77-68,<br />\nwhen Haverford captured the final event (the mile relay)<br />\nby less than one second!<br />\nSenior-. Brett Miles and sprinter McLin led the Jay<br />\neffort at Haverford, as each mani captured first place<br />\nhonors in a pair of events. Miles was the top man in both<br />\nthe long jump and the triple jump, while Matt won the<br />\n110.: and 220- yard dashes.<br />\n\"The loss of those men really hurt us,\" Cockey<br />\ncommented.\"The team that was there pulled very hard to<br />\novercome our deficiencies, but we couldn't quite do it.\"<br />\nOn May 19, the team travelled up the road to Towson<br />\nState for a series of dual' meets—one against Towson and<br />\none versus UMBC. Both of these opponents have excellent<br />\ntrack programs, so despite two losses (84-60 to Towson<br />\nand 87-55 to UMBC), Coach Cockey was extremely<br />\npleased with the squad's performance.<br />\n\"It was a fantastic team effort,\" the Coach noted,<br />\n\"especially from the distance men.\"<br />\nHe was referring specifically to Kennedy and Freamon,<br />\nboth of whom excelled in this competition.<br />\nFreamon established his record in this meet, while<br />\nKennedy took the 3-mile event in 14:15.1, a school<br />\nrecord at the time.<br />\nThat record lasted exactly four days, as Jim shattered<br />\nthat mark with his effort at a three-way meet against<br />\nDickinson and Ursinus on April 23. Kannedy took the<br />\n3-mile event in an incredible 15:15.6, tying the Dickinscji<br />\ntrack record and qualifying him for the national<br />\nchampionships later this month.<br />\nKennedy's effort, 'combine& with double victories<br />\nfrom McLin (\"the fastest sprinter at JHU in the last three,<br />\nyears\" according to Cockey) and Freamon enabled the<br />\nJays to ctitim a pair of victories on this day.<br />\nOn April 26, Hopkins hosted a three-way meet that<br />\nincluded Western Maryland and Loyola. Despite a pair of<br />\nwins from Freamon and an impressive effort from the<br />\nrelay teams;, the best that the Jays could do was to finish<br />\nin the middle, ahead of Loyola but trailing W. M.<br />\n<br />\n\fIn the unfortunate 12-11 loss to Cornell earlier this<br />\nseason, the Blue Jay stickmen seemed to lose their<br />\ncomposure after allowing a large lead to shrink away. At<br />\nWest Point on Saturday, the Jays showed that they have<br />\nlearned from their mistake.<br />\nBattling an inspired, 11th ranked Army squad on their<br />\nhome turf, Hopkins was forced to stage a fourth-quarter<br />\nrally to defeat the Cadets, 13-8, thus running the JHU<br />\nseason mark to 7-1 and enabling the Jays to hold onto<br />\ntheir third-place ranking in the coaches' poll.<br />\nThe Jays had opened the second half with a 5-1<br />\nadvantage and seemed set to roll over their adversaries.<br />\nHowever, Army came roaring on in the third quarter,<br />\noutscoring the Jays 5-2 in that session and trailing by only<br />\na single goal as the teams entered the final fifteen minutes<br />\nof play.<br />\nThe Cadet comeback was led by the phenomenal<br />\ngoaltending of Jose Olivero. While his teammates were<br />\npumping five goals into the Blue Jay net, Olivero was a<br />\nveritable fortress on defense. In the third period alone,<br />\nthe junior netminder made twelve saves as JHU<br />\ncould<br />\nconnect on only 2 of 22 shots.<br />\nHopkins scored in the first minutes of the<br />\nfourth<br />\nquarter to take an 8-6 lead, but Army kept comin<br />\ng. The<br />\nhome team tallied twice in succession to forge<br />\nan 8-8<br />\ndeadlock with less than ten minutes remaining<br />\nin the<br />\ncontest.<br />\n<br />\nAt this juncture of the game, Army Coach<br />\nDick Edell<br />\ncalled a time - out, a move that puzzled Jay<br />\nCoach Henry<br />\nCiccarone.<br />\n\"It (calling a time-out) surprised me,\"<br />\nthe JHU mentor<br />\nsaid. \"They had the momentum then—<br />\nI was about to call<br />\na time-out, but he beat me to it.\"<br />\nCiccarone explained that the time-out<br />\nenabled his team<br />\nto regroup. Evidently this regrouping was<br />\nquite successful,<br />\nfor the Jays went back onto the<br />\nfield and totally<br />\ndominated play in the game's final minut<br />\nes, outscoring<br />\nthe Cadets 5-0.<br />\nJoe Garavente broke the tie two minutes<br />\nlater, taking a<br />\nfeed from Mike O'Neill and whipping<br />\nthe ball past<br />\nOlivero. That score was quickly followed<br />\nby goals from<br />\nDave Huntley and Bob Maimone, giving JHU an<br />\n11-8 lead<br />\nwith six minutes to play and sealing the victory.<br />\nAfter the game, Ciccarone revealed that the<br />\ngame,<br />\nstatistically speaking, had gone pretty much as<br />\nhe had<br />\nexpected. \"I figured that if we shot 65 times, we<br />\nwould<br />\nscore 15-18 goals,\" the Coach noted. \"I<br />\nalso was<br />\nconfident that our defense could hold them to under<br />\nten<br />\ngoals.\" Chic attribured his team's lower score (despi<br />\nte 73<br />\nshots) to Oliver's efforts, pointing out that the<br />\nArmy<br />\nnetminder \"made saves that kept us from blowi<br />\nng it<br />\nopen.\"<br />\nO'Neill, Huntley and Rich Hirsch were the leader<br />\ns on<br />\noffense for Hopkins as each player was credited<br />\nwith four<br />\n<br />\npoints. O'Neill had a goal and three assists<br />\nwhile Huntley<br />\ncontinued his year-long shooting spree with<br />\nfour goals.<br />\nThe continued fine effort from Hirsch (the<br />\nsenior<br />\nattackman had five points a week ago) is an<br />\nexcellent sign<br />\nas the team readies for its toughest month of<br />\nthe season.<br />\nThe Long Island native and four-year starter did<br />\nnot play<br />\nwell through the first part of the season and<br />\nhis return to<br />\nform could remove some of the burden<br />\nfrom his<br />\nteammates on attack. •<br />\nIn this next two weeks, the Jays will face the<br />\nnumber<br />\nfour and the number two team in<br />\nthe country,<br />\nrespectively. This Saturday, JHU entertains Navy<br />\nwhile on<br />\nMay 14, Hopkins travels to College Park<br />\nto face the<br />\nUniversity of Maryland.<br />\nThe top eight teams in the country will then<br />\nparticipate<br />\nin the NCAA play-offs to determine<br />\nthe national<br />\nchampion. Round I is scheduled to be<br />\nplayed on<br />\nWednesday May 17, while Round 2 is to be<br />\nheld on<br />\nSaturday May 21. The two survivors will meet on<br />\nMay 28<br />\nat Charlottesville, Virginia for the Division<br />\nI national<br />\nchampionship.<br />\nAlthough the final is played at a pre-determin<br />\ned site,<br />\nthe first two rounds are contested at the home field<br />\nof the<br />\nhigher ranked of the two teams, and therefore Ciccar<br />\none<br />\ncalls both the Navy and Maryland games \"crucial\".<br />\n\"We need to win them both to make our own<br />\ndestiny<br />\nin the play-offs,\" Ciccarone concluded.<br />\n<br />\nBaby Jays rack up fourth straight victory<br />\nWith victories in its last four games, the Blue<br />\nJays<br />\nmen's Junior Varsity Lacrosse teem has moved its<br />\nrecord<br />\nto 5-3, marking the first time the team has been above<br />\nthe<br />\n.500 level all season.<br />\nThe Junior Jays are coached by Bert Mandelbaum<br />\n,a<br />\nPhD student at the Med School. Mandelbaum, a<br />\ngraduate<br />\nof Cortland State in New York, is assisted by a pair<br />\nof<br />\nformer JHU stickmen, Bill McCutcheon and Don<br />\nZimmerman.<br />\nThe Jays opened their season on the wrong foot,'<br />\ndropping their March 22nd contest to Wroexter, 14-9.<br />\nA<br />\ndry spell in the second quarter, during which<br />\nthe<br />\nopposition outscored JHU 4-0, sealed the openi<br />\nng game<br />\nsetback.<br />\nHopkins.trailed by a count of 2-1 after one quarter,<br />\nbut<br />\nthe Wroester second period rush produced a 6-1<br />\nhalftime<br />\nbulge and the Jays could never cut into that margin. P.J.<br />\n<br />\nBoyle led JHU in scoring with two goals and two assists,<br />\nThe Jays decided not to wait until the fourth quarter<br />\nwhile Millard Tydings, Jim Bidne and Marty Wolf each<br />\nto assert their superiority over Essex Community College<br />\nhad three points apiece.<br />\non April 15th. Hopkins scored six times in the opening<br />\nThe Jays recorded their first win of the campaign in<br />\nperiod while shutting out the opposition en route to a<br />\ntheir next outing as they swamped Catonsville<br />\n14-7 win.<br />\nCommunity College, 15-6. Hopkins opened • this game<br />\nThe Jays reached the .500 level on May 19 with a 10-8<br />\nwith a rush, grabbing a 4-1 lead in the opening quarte<br />\nr<br />\nvictory over their counterparts from Towson<br />\nand never looked back.<br />\nState. A<br />\nstrong second quarter saw JHU outscore Towson 4-0<br />\nWolf took scoring honors for this game. The freshman<br />\nand<br />\npaved the way for victory.<br />\nfrom Baltimore fired home a pair of goals and assisted on<br />\nThe Baby Jays ran their current win streak to three<br />\nthree others, thus amassing five points.<br />\nas<br />\nthey rallied to defeat Anne Arundel Community<br />\nLong Island power Suffolk Community Colleg<br />\nCollege<br />\ne<br />\n14-11 on April on the loser's home field. Anne Arunde<br />\nprovided the opposition on April 7th. However,<br />\nl<br />\nthe<br />\nhas<br />\nthe top junior college team in the area, so this<br />\nvisitors from New York proved to be too powerful<br />\nas they<br />\nrepresented an important victory.<br />\ndowned JHU, 12-9.<br />\nGeoi-getown University was the Jays' latest<br />\nvictim.<br />\nHopkins lost its third contest in four outings when Hopki<br />\nns downed the Hoyas 20-8 at Homewood<br />\nFarmingdale Community College nipped the Jays, 7-6.<br />\n<br />\n\fRocks & cocks<br />\nin Ocean City<br />\nBy COLIN CAMERER<br />\n(Special to the News-Letter)<br />\nOcean City, Maryland is Paradise to most of Bawlamer<br />\nOcean City is a common man's temporary heaven..<br />\nFor the uninitiated, Ocean City is a ten-mile stretch of,<br />\nbeach on Maryland's Eastern Shore. Winter population is<br />\na few thousand, but hot summer weekends draw crowds.<br />\nin excess of 200,000. The brutal expansion -contraction<br />\nof city tissues has produced some strange phenomena:<br />\n1) Mayor Harry Kelley. Kelley has only one qualification<br />\nfor being mayor; he has lived in the town for hundreds of<br />\nyears. He has fathered ordinances banning bare chests<br />\n(among both sexes) on the boardwalk, sleeping in vans<br />\nand public drinking. A curious demagogue saddled with:<br />\ngood intentions, Kelley's idol is still the late Richard.<br />\nDaley of Chicago. A moment of silence, please.<br />\n2)A spectacular attraction for young punks. Runaways of<br />\nevery shape, form and carrying every disease flock to the<br />\nresort in search of penny arcade truth or escape from<br />\nparental units(whichever is cheapest).<br />\n3) Greed and contempt. When mixed, these two qualities<br />\nproduce a subtle love-hate obsession among the huge<br />\nmajority of Ocean City's small businessmen. When the<br />\ntourists aren't here, they bitch. When they arrive pockets<br />\ntemporarily lined with gold—they bitch.<br />\n4) An amazing assortment of bars. From Millie's Mermaid<br />\nInn (near Daisy's Golden Anchor)to i;ie Lookout Lounge<br />\nN-L correspondent loses<br />\n(high atop the Fenwick Inn), bars to suit any taste exist in<br />\nOcean City. Insiders say Finnigan's Rainbow, 1 350-seat<br />\nreligiously to AM radio. Legal secretaries in yellow<br />\nnightclub in its second season, will soon acquire a national (Mustang Ghias reading about Red Skelton in People<br />\nreputation after presenting the one and only Robert<br />\nmagazine. And so on.<br />\nPalmer.<br />\nTourists come in huge swells and will continue to do so<br />\n5) A beach which erodes at the rate of 2 feet per year and<br />\nfor many years. Visitors from Ohio and Pennsylvania are<br />\nalready resembles Twiggy in spots. It is one of the<br />\nbecoming more frequent. The condominium boom of<br />\ncleanest on the East Coast. Now if you can only find' several years ago has ceased but modern towers of glass<br />\nroom... _<br />\nand concrete can be easily glimpsed to the north.<br />\nDespite all the small town pettyism, Ocean City is an<br />\nCommerce in Ocean City is active but not feverish.<br />\nimmensely popular place to be in the summer. People Growth in tourism is slow and steady. Prostitution is rare<br />\narrive in droves, sweating out desperate drives (4 hours (\"A hooker told me)), a police captain- confides, \"she<br />\neach way from Baltimore) to have an audience with went out of business because so many/ girls; give it<br />\nBrother Oum and Sister Surf. Big families drinking from away\"). One homicide has been recorded since 1965 and<br />\ncoolers of fake soda pop in station wagons witli wooden that was done out of boredom.<br />\nsides. High-school kids in beat-up Volkswagens listening<br />\nBaltimorons and Washingtonians alike con- to Ocean<br />\n<br />\nshirt to DEAN OF BEER<br />\nCity to sweat away the pains and headaches of work.<br />\nThose with more money go to the mountains or Florida,<br />\nbut the People go to O.C. The Smarter People go to<br />\nuptown O.C. (60th-140th Sts.). where rent is steeper but<br />\ncommercialism is not suffocating.<br />\nThe boardwalk sleaze is obvious. Ragged vendors lean<br />\nout of game booths and recite their well-oiled pitches.<br />\nEmbarassed men shuffle over to break the plates or knock<br />\nover the bottles and win a stuffed animal for a woman<br />\nfriend. Everyone that poinds the boards gets taken and<br />\nthe vast majority know it. The same honest scam is played<br />\non beaches from Ft. Lauderdale to Asbury Park.<br />\nOcean City is worth a token visit. There are good times<br />\nto be had — just turn over the proper rocks.<br />\n<br />\n01-41*-*-410-440-•<br />\n<br />\nSON OF TRIVIA QUIZ<br />\nPART II<br />\nHere's your last chance to match wits with the News-Letter's<br />\nquizmasters. These questions are relatively easy because there's<br />\nno prize to give away. Answers will be found somewhere in this<br />\nissue. Good luck!<br />\nMatch the game show with its host (two points each)<br />\n1. Jan Muarry<br />\n2. Gene Wood<br />\n3. Bobby Van<br />\n4. Art Flemming<br />\n5. Bob Ewbanks<br />\n6. Wink Martindale<br />\n7. Geoff Edwards<br />\n8. Jim Lange<br />\n9. Bill Cullen<br />\n10. John Daley<br />\n<br />\na. Jackpot!<br />\nb. Eye Guess<br />\nc. The Dating Game<br />\nd. The Newlywed Game<br />\ne. What's My Line?<br />\nf. Beat the Clock<br />\ng. The New Beat the Clock<br />\nIi. The Fun Factory<br />\ni. Jeopardy<br />\nj. Gambit<br />\n<br />\nFill in the blanks to these famous themes<br />\n<br />\n1. Who is Ellie Mae's boyfriend?<br />\n2. What did they call their swimming pool?<br />\n3. What was the name of the studio Jed bought?<br />\n4. From what town did the Clampetts come?<br />\n5. What is Jethro's last name? (Hint: it's not Tull)<br />\n(one point each)<br />\n<br />\nWhat show is this from? Who is singing this song?<br />\nis the place to be<br />\nis the life for me<br />\nLand spreading out so ---- and<br />\nKeep<br />\n; give me that<br />\n<br />\n1. Mr. T. and Tina<br />\n2. The New Dick Van Dyke Show<br />\n3. The Paul Sand Show<br />\n4. I Dream of Jeannie<br />\n5. Sgt. Bilko<br />\nFeatured Series --- \"The Beverly Hillbillies\" (four points each)<br />\n<br />\n1. There's a hold-up in the<br />\nbroken out in fights<br />\nThere's a traffic jam in<br />\nThat's backed up to<br />\n<br />\n2.<br />\n<br />\nIn what cities do the following shows take place: (three points each)<br />\n<br />\nSCORE YOURSELF<br />\n70-56 a real whiz, a regular wisenheimer<br />\n55-46 good, still thinks Peggy Cass died of a ham sandwich<br />\n45-31 average, thinks Hugh O'Brien is a good actor<br />\n30.16 below average, watches \"Celebrity Bowling\"<br />\n15-0 airhead, typical Hopkins student<br />\n<br />\n\f", "format": "basic_html", "processed": "Dr. Merman<br />\nfired!!!!<br />\nMuller calls<br />\ntwo friends<br />\n\"Mr. Warmth\"<br />\nAND<br />\nChucky Baby<br />\nAs a result of the Friday News-Letter's published poll,<br />\nwhich revealed student disfavor with Dr. Dierman by a<br />\nthree to one margin, the aged bureaucrat has been<br />\ndismissed. Never people to waste any time, the<br />\nAdministration brought to Baltimore yesterday two<br />\nprospective replacements, Donald Rickles and Chuck<br />\nBarris. The News-Letter was lucky enough to snare both<br />\nof these distinguished celebrities for quick interviews.<br />\nFirst, Mr. Warmth himself, Don Rickles. Ric kles,: All<br />\nright, you hockey puck, let's get on with it. r 'gotta go<br />\ndown to Annapolis andr stick needles into MArvin's head<br />\nand see if I get any reaction.<br />\nN-L$ Well, what do you think of Johns Hopkins?<br />\nRickles: I was here once before. I spent a week here one<br />\nnight. Muller lied to me. He didn't tell me this place is in<br />\nHarpp den. I think Al Capp already turned the job down.<br />\nif! 'wanted this kind of action, I could have auditioned<br />\nfor the travelling company of \"Tobacco Road.\"<br />\nN-L: You don't like this place very much, do you?<br />\nAdams portabie Jokefile for $28.50. Everyone in the<br />\nicklesl They gave me a trial run this morning. 8 pre-med<br />\nbusiness has •one. Joey has not worked clubs in<br />\ncame in. I won't tell you what his nationality W2,but he<br />\ntwenty-five years. He st5nds on the corner of Hollywood<br />\noffered me a television set as a bribe. He asked me when<br />\nand Vine and he peddles the fakoktah book.<br />\nhe could go to med school. I told him to finish the bridge<br />\n-L1 What's that?.<br />\nfirst. I gave him a rice cookie and some raw fish. And he<br />\nRickles: Fakoktah? It's an Indonesian word Jerry Lewis<br />\nwent away.<br />\nuses a lot. And look where he is now. He works only one<br />\nN-L: You sound very hostile.<br />\nday a year -- Labor Day. And the rest 4f the tune he sits<br />\nRicklesl You're Hungarian aren't you Casmir. Where did<br />\nin The Brown Derby going,\"I'm a big star. Ask Dean.\"<br />\nyou steal the tape recorder? No,6 kid. Hungarians are my N-L: In France they •consider Lewis a genius.<br />\nRicklesl Well, insurance , they stomp on kitty litter to<br />\nfavorite people. I t8lked to Brezhnev this morning and the<br />\nIankL, are in your mother's living room right now.<br />\nmake wine. But 6 tell you this lang, 6 took this job at<br />\nN-L: Actually, I'm not a Bohunk (laughs). I'm really a<br />\nHopkins for one reason. zo make enough money to join<br />\nSlovak. Rickles: What? That's better?<br />\nthe rest of my family in Argentina.<br />\nN-L: Did you talk to Steve Muller today?<br />\nN-Lo What's yourr predecessor Dr. Dierman doing nog?<br />\nRickles: A morning with Steve Muller is like watching a<br />\nRickles: He's explaining to the tribunal he was just<br />\ncasket warp.<br />\nfollowing orders.<br />\nN-L: So why did you come all the way from the coast to<br />\nN-L: Who else have you met at Hopkins?<br />\n•see him?<br />\nRickles: I met that meatball, Chris Colombo. He's a good<br />\nRickles: I'm so lonely.<br />\nfriend of my manager, Jo Scandori. They both came<br />\nN-L: Lonely?<br />\nover on the sa e oil slick.<br />\nRicklesl They cancelled my show. I can't hang out with<br />\nN-L Mr.Rickles , I just don't think you're right for this<br />\nthe sailors apymore. My wife's getting scared. She thinks job.<br />\nrni going,. to. bother her again. Last time I did, she said,<br />\n\"Pillows, get your pillows.\"<br />\n'All right but it's going to cost you.\"<br />\nN-L: Hey that's a good one.<br />\nRickles: Where does it say the wimp from Jersey gets a<br />\nRI kles: f you like that one, yo-yo, I can show you<br />\nlaugh? What do you know? After graduation, y u re going<br />\nwhere I get the rest of my material. It's from the Joey<br />\nback to your job in Tiajuana at the bullring going<br />\n\"Pillows, get your pillows!\"<br />\nN-L: What does that line mean?<br />\nRickles: How should I know, goulash breath? It gets laughs<br />\nin Vegas.<br />\nN-L: What is your conception of the job of advising and<br />\ncounseling?<br />\nRicklesl Make sure only my people get into med school.<br />\nIt's as simple as that.<br />\nN-L: Thank you Mr. Rickles.<br />\nRicklesl My pleasure. You've been a beautiful audience.<br />\nOrdinarily I don't accept ,mercy bookings but 1, enjoyed<br />\nit. God love you.<br />\nThe second candidate for the post of Director of<br />\nAdvising and Counseling is the star of The Gong Show,<br />\nthe incredible Mr. Chuck Barris.<br />\nN-L: Chuck, what do you think of Johns Hopkins?<br />\nBarris: Oh! 0!! REALLY like that guy! But, then again, I<br />\nlike bubonic plague.<br />\nN-L: But seriously, Chuck, what changes do you plan to<br />\nmake if you are named to replace Fred Dierman?.<br />\nBarris: There are so many things that have to be done if<br />\nour school is to win a respectable audience share of<br />\napplications and contributions. But the admissions<br />\nprocess is what really determines whether you have a hit<br />\nor a turkey on your hands. Now what I've proposed to El<br /><br />\nPresidente is this. Stevie Baby, I said, we set up a,<br />\nthree-member celebrity admissions panel and each student<br />\nact will be auditioned and ranked from ()lie to ten-unless, after fo 45 seconds, any member of the panel<br />\ndecides that the student has no talent.<br />\nN-L: What happens then?<br />\nBarris: Hah Hah! That's when you get the old gongeroo!<br />\nIf all three panelists hate the candidate, he or she can set<br />\ngang-gonged!<br />\nN-L: Isn't that a bit cruel?<br />\nBarris: Maybe, but that's the way things go on the ol'<br />\nGong Show, and after I take over that's the way it will be<br />\nhere on the ol' Hop Show.<br />\nN-L: How often do you anticipate using the gong?<br />\nBarris: Well, every day on tee wee coast to coast we have<br />\na turkey to talent ratio of 5 to 2. I think the admissions<br />\ngame will be run along similar lines. The ol' gong will be<br />\ngetting a good workout. But that's what our audience<br />\nlikes.<br />\nN-L: Do you plan to televise these proceedings?<br />\nBarris: You bet your bong we do! I'm in business. I call it<br />\nthe \"open admissions\" game. I've taken every function of<br />\nlife and put it on the tube. I created the Dating Game, the<br />\nNewlywed Game, I gave George Carlin the idea for the<br />\nDivorce Game. Why not the Admissions Game? If it click<br />\nwe put the Med School Game on as a mid-season spin-off<br />\nreplacement.<br />\n-L: And all the action starts right here at homewood?<br />\nBarris: Absolutely! From Baltimore, almost live.<br />\nN-L: What band are you going to use to add to the fun? B<br />\nBarris: The Hopkins Band, of course. They're just as bad<br />\nas Mil,ton DeLugg and his Band With A Thug and they<br />\nwork cheaper.<br />\nN-L: What kind of panelists will uou use on the show?<br />\nBarris: Local people with no talent and no brains. Maybe<br />\nVince Bagli, Wally Orlinsky, and Barbara Mikulski to<br />\nstart.<br />\nN-L: There's more to your job than admissions, In fact, in<br />\nthe past, admissions did not even come under your<br />\nposition. You're supposed to be advising and counseling.<br />\nBarris: Well, I did advise one former News-Letter editor<br />\nwho thinks he can write. Bob, I said, there's a bus leaving<br />\nfor Missouri in five minutes. Be under it. Actually, the job<br />\nis what I want it to.be.When you're as big in the business<br />\nas I am, you write you own ticket. Then you take it to<br />\nJudge Hardy to have it fixed. But that's before your time.<br />\nN-L: Thank you, Chuck.<br />\nBarris: Well, this can't be the end. I have so much more to<br />\nsay. Did you know I wrot \"Palisades Park\" for Freddie<br />\nBoom Boom Cannon in 1962? Did you know I wrote<br />\nbestselling nowel, You and Me, Babe...<br />\n(The man with the net leads Mr. Barris away.)to come<br /><br />\npage 2/news-letter/may 3, 1977<br />\nThe final Young Damocrats meeting of the 76-77 academic year<br />\nwill be held on Tuesday, May 3, at<br />\n7:00 pm in Conference Room A.Please try to attend.<br /><br />\nNotes<br />\nfor<br /><br />\nSummer Language Institute offering intensive Greek, Latin,<br />\nFrench, and German — May 31 - July 22. Deadline extended to<br />\nMay 7. Applications available in Classics Dept. 121 Gilman Hall.<br />\nFor information call J. S. Clay, 338-7560 or 235-5871.<br />\nThe Junior Class would like to express its thanks to those who<br />\nworked long, hot hours during the Spring Fair at the class Taco<br />\nBooth. A special thanks to Taco Bueno and Rogers House.<br />\nThis year's final meeting of the Hopkins Christian Fellowship.<br />\nwill be this Thursday May 5 at 7:00 .pm in the Great Hall in<br />\nLevering. Debbie and Otis Stroup will be our special guests, giving<br />\na musical (piano and voice) presentation of the Gospel.<br />\nRefreshments will be served. All are welcome to come and enjoy<br />\nthe music.<br />\nThe Blue Key Society, in conjunction with the Admissions<br />\nOffice, will be offering summer tours for prospective students and.<br />\nother interested persons. If you are planning to be in Baltimore<br />\nfor the summer (or part of it) and would like to give tours of the<br />\nHomewood campus, please contact Cindy Simon at Box 784 or at<br />\n825-0483 and leave your name, box, and phone number. All<br />\nHopkins undergraduates are invited to participate.<br /><br />\n-nico<br /><br />\nThe International Studies Forum will hold a last vital, but<br />\nshort, meeting of the year today at 7 pm in Gilman 42. The only<br />\nbusiness will be elections of next year's officers.<br />\nATTENTION!!! The Junior Class would like to announce that<br />\ntickets for the Dinner Dance on the Chesapeake are on sale at the<br />\n'Union Desk for the low price of $25.00/couple. Free champagne<br />\nfor all.<br /><br />\ngoats<br /><br />\nAttention Sophomores: There will be a meeting in the Dorm<br />\nSocial Lounge on Saturday, May 7 at 11:00 am to discuss next<br />\nyear's activities. Anyone interested in planning movies, a brunch, a<br />\nsemiformal or any new ideas for our junior year is welcome.<br /><br />\nThe JHU Gay Caucus will hold its last meeting of this academic<br />\nyear tomight, Tuesday May 3, at 8:30 pm in Conf. Rm. A.<br />\nMambers should remember the BGA dance, May 14 at the Alcazar<br />\nBallroom. For more information, call 366-0488. After May 15,<br />\nthe phone number for the Caucus will be 243-4435.<br /><br />\nSeniors— Be sur to stay in Baltimore for Commencement Week!<br />\nKeep checking yourGilman mail box for information concerning<br />\nthe week of events. Note reservation deadlines — no dinner-dance<br />\nreservations after May 12. Tickets for the Bull Roast go up to<br />\n$4.00 after May 18. For more information call 366-7188.<br /><br />\n• Doc Hepsburger — You have not claimed your prize yet! What<br />\nhappened? Send word to the Gatehouse by Wednesday,4 May, or<br />\ncome by today at 5:30. Otherwise, the price will be donMed to<br />\nthe Little Sisters of Dundalk Mission.<br /><br />\nThe G. Wilson Shaffer Award will be given May 7 at the Navy<br />\nlax game. Forms are available at the gym office for nominating<br />\nnon-varsity graduating seniors for this covetted scholar-athlete<br />\naward. For details calls 243-2305.<br /><br />\nSigma Nu today announced the results of the Red Cross Blood<br />\nDrive Competition. Blood-letting was led by sponsor Sigma Nu,<br />\nfollowed by the Dry Tep contingent. The mid-April contest was<br />\nbased on the percentage of student organization members who<br />\ndonated blood. In a serious vein, Sigma Nu thanks all participants.<br /><br />\nThe Office of the Chaplain and the Young Democrats will<br />\npresent \"the Testimony\", a film which will convince you to<br />\nBoycott J.P. Stevens Products, on Thursday April 28 at noon in<br />\nthe xreat Hall. We urge everyone to see this film.<br /><br />\nThe Board of Intramural Athletics is seeking new members.<br />\nForms are available at the gym office. Deadline—tomorrow.<br />\nInterviews—Thursday. For details, call Tom at 243-2305.<br /><br />\nThe new Palantir is out! At the Union Desk now. Our best issue<br />\never. Special student price. Buy the first issue at the Hopsfa carrell<br />\nweekdays at noon.<br /><br />\nBig nukes cause big pain for big powers<br />\nBy KATHLEENTROY<br />\nthe problem and not just its frequent recurrances.<br />\nThe problem of nuclear proliferation is erupting again.<br />\nThere are two situations in which the threat of nuclear<br />\nThe spread of nuclear weapons is not a new disease, but<br />\nwar would be averted with almost complete ceit inty; in<br />\nhas been festering since we demonarated the superiority<br />\nthe first instance, if not one country an, earth possessed<br />\nof American nuclear technology in 1945/There have been<br />\nan atomic bomb (unfortunately fear and 'progress' would<br />\nnumerous futile attempts at limiting •the number of'<br />\ncountries that share the distinction of wielding massive<br />\ndestructive power as well as causing atmospheric<br />\ncontamination in the event of war. It is with a noble heart<br />\nthat the United States and other signers of the 1967<br />\nTreaty for the Non-Proliferation of Nuclear Arms, are<br />\nwilling to take full responsibility for deciding this issue for,<br />\nthe rest of the countries of the world. The question at this<br />\ndate is not who shall possess a bomb, but why should the<br />\nU.S., under the provisions of President Carter's new<br />\nproposals to Congress, impose ineffective sanctions on<br />\nother countries that choose to sell nuclear technology?<br />\nThe President's newest proposals would give him the<br />\npower to sanction countries that do not comply with U.S.'<br />\nguidelines on dissemination (by with-holding fuel for<br />\nnuclear reactors). But the fact that West Germany and<br />\nFrance among others do not agree with Carter poses<br />\nseveral problems. These countries argue that the sale of<br />\nnuclear reactors and reprocessing plants is a major<br />\nelement of their present and future export trade<br />\nConsidering this position, .Carter should rpore carefully<br />\nweigh the effectiveness of his approach to the problem of<br />\nnuclear proliferation.<br />\nIt is a fact that many nations desire the knowledge and<br />\nmeans to produce nuclear weapons and it is also true that<br />\nwe cannot prevent these countries from acquiring the<br />\nbomb in the future. One by one, technicians in<br />\nunderdeveloped countries are discovering the secrets of<br />\nthe atom for themselves and with or without our<br />\napproval, me numner ot nuclear powers will continue to<br />\ngrow. Simply stalling the rate at which nations arel<br />\nacquiring the bomb does not solve the problem. The \"Say the secret woid and win anatom boilib.<br />\npossibility of atomic warfare is a recurring nightmare that,<br />\nmust be realistically dealt with; if Jimmy Carter wants to<br />\nsomething you see everyday<br />\nfree us of this spectre, he must attack the roots of<br /><br />\n--)<br /><br />\n,<br /><br />\n(<br /><br />\n.<br /><br />\n‘<br /><br />\n,<br />\n.1.&gt;<br /><br />\nP<br /><br />\n*<br />\n•<br />\nir<br />\n•f 1 v<br />\n//•ff<br /><br />\n4<br /><br />\n74<br /><br />\n1<br /><br />\nq ?,f461<br /><br />\n,<br /><br />\n-4\\114<br /><br />\n,<br />\n•„<br /><br />\nnot allow us to return to this ideal) and secondly, if every<br />\nnation had the bomb. Before the horror of this possibility<br />\nclouds the rational thought process, consider what a<br />\npowerful deterent the universal possession of the bomb<br />\nwould be. Any nation that would dare to employ the<br />\nbomb against any other would be guaranteed total<br />\ndestruction. Actually, the idea is not as ridiculous as it<br />\nfirst appears, the mutual knowledge that both the U.S.<br />\nand the U.S.S.R.. wield weapons powerful enough to<br />\nannihalate tifeir populations, cities, in 1-rort everything of<br />\nvalue, has kept them from ever using them. (Or should<br />\nwe attribute our restraint to our more 'civilized' nature?)<br />\nThere is every reason to believe another nation faced with<br />\nthe consequences of nuclear war would as well be<br />\ndeterred. It is only the case in whic imbalance exists that<br />\na leader would be tempted to use the bomb.<br />\nBut however unlikely the first scenario may be and as<br />\nimminent as is the second, the point is that President<br />\nCarter undoubtedly harbors good intentions in trying to<br />\navert nuclear war by calling for agreement on<br />\nnon-proliferation, but his methods are doomed to failure.<br />\nHis choice of \"the establishment of common international<br />\nsanctions\" will not only fail to prevent the spread of<br />\nnuclear capability, but as he admits, it will 'adversely<br />\naffect certain allies whose cooperation is needed if we re<br />\nto achieve our ultimate obtctive of non-proliferation.\"<br />\nOstensibly, Mr. Carter is wL.1ng to risk the animosity of<br />\nour allies so that he can achieve his goal of short-term<br />\nnon-proliferation.<br />\nThose not possessing the bomb want it and whether<br />\nthey develop it themselves or acquire the technology<br />\nelsewhere does not matter; the result will be the same.<br />\nNon-proliferation does not dissolve the spectre of nuclear<br />\nholocaust, it only defines who will have the honor of<br />\ntaking art in the deadly game. Nobody wants a nuclear<br />\nwar, but sanctioning those countries, often our West<br />\n;propean allies that choose not to abide by our policy of<br />\nton-proliferation, is not only failing to stop the spread<br />\nf- -.nuclear capability, but is also creating avoidable<br />\nresentment and strain in our relations.<br /><br />\n,•'.<br />\n,<br />\ni<br /><br />\nI.<br />\n4,.\\<br /><br />\nny<br /><br />\n(I<br /><br />\nN<br /><br />\n•<br /><br />\n1.....1,0 °,,v.„,r<br />\nth<br /><br />\nmay 3, 1977/news-letter/page 3<br /><br />\nForeign language requirement to return?<br />\nBy'GAYLE COHEN<br />\nAll Bachelor of Arts degree candidates could be<br />\nrequired to study a foreign language through the<br />\nintertnediate,level, according to a proposal,. the Academic<br />\nCouncil will consider tomorrow night—The proposal,<br />\nwhich informed sources predict will almost certainly pass,<br />\nmay be the first step in a series of course requirement<br />\nchanges.<br />\n\"There are clearly a number of things about the<br />\ncurriculum that we are interested in looking into. There<br />\nshould be a coupling of this requirement with a concerted<br />\nlook at the general goals of the education of<br />\nundergraduates,\" Dean of Undergraduate and Graduate<br />\nStudies Sigmund R. Suskind said. Ther proposal was<br />\nsubmitted by the Committee on Underbraduate Studies in<br />\nresponse to faoulty complaints of student illiteracy. CUS<br />\nis a subcommittee of the Academic Council which is<br />\ncomposed of five faculty and four student<br />\nmembers. \"We are constantly getting complaints from<br />\nfaculty members that students cannot write papers and<br />\nthat they c annot sit in a class and communicate their<br />\nideas clearly,\" said CUS member Charles<br />\nHenderson.<br />\nThe University dropped its foreign language<br />\nrequirement in 1968, leaving the establishment of<br />\nlanguage requirements to individual academic<br />\ndepartments. CUS member Alfredo Holt would like to<br />\nsee this arrangement maintained. \"I would prefer to have<br />\nit as it is now, wher the departments themselves set the<br />\nrequirements. I have doubts about the proposal. Certain<br />\ndisciplines do not demand it.\" He cited American political<br />\nsciences as an area that does not require knowledge of a<br /><br />\nforeign language, and mentioned that some students, such<br />\nas history of art majors, need only a specialized<br />\nvocabulary.<br />\nThe department of political economy<br />\nbecame the most recent department to omit compulsory<br />\nlanguage study when it dropped the language requirement<br />\nfor economics majors this year. \"We felt that a foreign<br />\nlanguage was not really required for undergraduate study.<br />\nThe main articles in basic theory are written in English,\"<br />\nDepartment Chairman Peter Newman said. He said he<br />\nwould perfer not to use his department to enforce a<br />\nlanguage requirement, granting the imposition of such a<br />\nrequirement to the University.<br />\nCharles Henderson, who<br />\nvoted in favor of the mandatory language study, said, \"I<br />\ndon't think it's unreasonable that students should be<br />\nconversant in a foreign language.\" He suggested that<br />\nadvisors from individual departments direct students to<br />\nenroll in non-required, but useful, courses.<br />\n\"I was<br />\nunder the general impression that neither the English or<br />\nWriting Seminars department was prepared to undertake a<br />\nlanguage skills development program, but I'd like to see a<br />\nbasic writing course/offered.\" He mentioned that by<br />\nstudying a foreign language, students will learn at least the<br />\nrudiments of grammar.<br />\nNo Guidelines<br />\nAs submitted to the Academic<br />\nCouncil, the CUS proposal lacks clear administrative<br />\nguidelines. It has no provisions for exempting students<br />\nthrough their performance on tests. It also fails to take<br />\ninto account possible growth in the language departments<br />\nand- increased use of language laboratory facilities.<br /><br />\nLimits planned for Hopkins- Peabody co-op<br />\nBy ROBERT RIGGS<br />\nUnder a dozen Johns Hopkins students will be<br />\npermitted to take courses at Peabody in September under<br />\nan \"informal agreement,\" according to Dean of<br />\nUndergraduate and Graduate Studies Sigmund R.<br />\nSuskind. In conjunction with Associate Dean of- the<br />\nPeabody Conservatory Tinka Knopf, Suskind has worked<br />\nout an \"unofficial mechanism\" for allowing Hopkins<br />\nstudents to enroll in undergraduate courses at Peabody,<br />\nand Peabody undergraduates to take courses at<br />\nHopkins. Selection of this small group of students will<br />\ntake place in the near future on a \"strictly individual<br />\nbasis,\" according to Suskind. Private instrumental lessons<br />\nwill not be available, but these students will be able to<br />\ntake music area courses such as Theory and History of<br />\nMusic, if they have enough background to pass a<br />\nplacement test. No additional tuition will be charged,<br />\nSuskind said.<br />\nThe exchange remains a \"non-program.\" Suskind<br />\nemphasized, until a formal academic affiliation can be<br />\nworked out. An administrative affiliation between the the<br /><br />\ntwo institutions will go into effect July 1, 1977. An<br />\nacademic affiliation would have to be be approved by the<br />\nCommittee for Undergraduate Studies and the Academic<br />\nCouncil, and probably will not be finalized until<br />\nSeptember, 1978, according to Suskind., \"There is no<br />\nagreement yet,\" he said, \"this arrangement will just give<br />\nus some idea of how things will work on a larger scale. It<br />\nhas been done and mutually set up between the two deans<br />\nto let the interested students involved get a chance to take<br />\nsome courses at the other school. It is not a formal<br />\nprogram.\" For this reason, Suskind continued, the<br />\nnumber of students involved must be kept small. \"Under<br />\na dozen\" will be selected from Hopkins, on the basis of<br />\n\"interest, relevance to programs, and ability.\" They will<br />\nbe first-rate students, and they will have to have a clear<br />\nreason why they should<br />\ntake courses at Peabody,\"<br />\nSuskind commented. Dean Knopf stated that \"a limited<br />\nnumber\" of Peabody students will be allowed to<br />\nenroll in courses at Hopkins. Thus far, only four of seven<br />\ncandidates have been selected. The criteria for Peabody<br />\nstudents to take courses at Hopkins, according to Knopf,<br />\nare combined scored of at least 1150-1?00 on the<br /><br />\nScholastic Aptitude Test and a \"demonstrated grade<br />\nrecord\" at Peabody. The main course areas in which they<br />\nhave shown interest are the Classics and Russian.<br />\nKnopf predicts the number of Peabody students<br />\npermitted to take courses at Hopkins will rise in future<br />\nyears. \"We want to see how it works out first. As we<br />\ngrow, obviously more exchange possibilities will become<br />\navailable.\" She noted that Peabody students are limited<br />\nby the rigid five-day class scheduling there, which makes<br />\nthe trip to Hopkins very difficult for many students.<br />\nFuture attendance of Hopkins studentsin Peabody<br />\nclasses an academic affiliation will be limited, Knopf<br />\nstated, by placement examinations and available space.<br />\nThere are about 350 undergraduates at Peabody, so any<br />\nmajor influx of Hopkins students could seriously damage<br />\nacademic opportunities for Peabody students. \"I've<br />\nalready had numerous phone calls from Hopkins students<br />\nwho have expressed desire to come her,\" Knopf<br />\ncontinued. \"The faculty has been fascinated by the<br />\npossibility of having Hopkins students come down here. I<br />\nthing it's going to be very positive experience for both<br />\nschools.\"<br />\niglarirArar114/AntrAgirArarAr4,411%.\"4\".<br /><br />\nrayrsymposium set<br />\n\"Television and Society the<br />\nWorld in 21\" (diagonally) is the<br />\ntopic of the eleventh annual<br />\nMilton S. Eisenhower<br />\nSymposium. Serving as chairmen<br />\nof the symposium which will<br />\nextend through October and<br />\nNovember 'are Carole Jaffe, Jill<br />\nLeukhardt and Steve Simms.<br />\n\"Our goal is to make people<br />\naware of the myriad ways that<br />\ntelevision effects them. After all,<br />\nthe average American has spent<br />\nthree years of his life watching<br />\nTV by the time he's eighteen.<br />\nTelevision influences everything<br />\nfrom buying habits to voting<br />\npatterns,\"Jaffe said.<br />\nThe symposium was<br />\nestablished in 1967 as a tribute<br />\nto Dr. Eisenhower for his<br />\ndistinguished service as<br />\nUniversity president. Past topics<br />\nhave included \"Living with<br />\nChange,\" \"The Pen as the Sword<br />\n- the Dynamics of the Written<br /><br />\nI<br /><br />\nMedia\" and \"A Question of<br />\nFreedom.\" Over the first ten<br />\nsymposia such diverse .and<br />\nnotable participants as Dr. Jean<br />\nPiaget, the Honorable Earl<br />\nWarren,- Dr. R. Buckminster<br />\nFuller, Carl Bernstein and Dr.<br />\nNaom Chomsky have spoken.<br />\nEach year symposium<br />\nproposals appear on the ballot<br />\nduring Student Council executive<br />\nelections. Voters are asked to<br />\nindicate three preferences for<br />\ntopics. Unless one topic receives<br />\na mjaority of the votes cast, the<br />\nauthors of the three topics which<br />\ngarner the most votes are<br />\ninterviewed by the Student<br />\nCouncil selections committee,<br />\nthen the committee makes a<br />\nrecommendation to the full<br />\nCouncil. This year, the interview<br />\nprocess was unnecessary as<br />\n\"Television and Society\"<br />\nreceived more than 50% of the<br />\nvotes.<br /><br />\nTHE PEOPLE'S<br />\nPAPER<br /><br />\nThis is the last issue of the News-Letter this year (please, no applause). It's been a pretty dull year<br />\nand sometimes we really had to bust our brains thinking of editorial topics. Today is no exception. So<br />\nhere we present little summaries of the \"major\" issues of the year;<br />\n1. Chesanow--What can be said of this well-rounded, All-American scholar that hasn't been said<br />\nbefore? We only hope he keeps his campaign promise of \"pot for every chicken\" and takes a more<br />\nvisible, active role in student government than his two predecessors.<br />\n2. Calendar change--President Steven Muller and Provost Richard L:ongaker maintained their<br />\n..-ucumber stance though faced with considerable dissent from student objectors. Secruring an<br />\nintersession while avoiding Saturday classes, students won this battle for input in University affairs<br />\ndirectly affecting their lot. We'll have to wait until 1978 to see if the golden unification concept was<br />\nworth the hassle to the men in Garland Hall.<br />\n3. \"Coonskin\"--Censorship of any kind faces a heavy burden of justification. But the question<br />\nCouncil, where a majority spoke<br />\nremains whether the cancellation of a film sponsored by the _Student<br />\n_<br />\nagainst the film, amounts to censorship.<br />\nlacrosse<br />\n4. Swimmers--Let's 'hear it for the swimming team! They did something only Hopkins<br />\nteams lacrosse teams areexpected to do--they won the NCAA Division III National Championship.<br /><br />\neditors-in-chief<br />\nMike Deak,Mike Krug<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editor<br />\nDave DeSmith<br />\nnews editor Gayle Cohen<br /><br />\nvol. lxxxi, no.50<br />\nThis is a Johns Hopkins paper.<br />\nThank you very much. Dante.<br /><br />\nsports editor<br />\nDavid Kraus<br />\nphoto-production manager<br />\nJennifer Bishop<br /><br />\nBy THOMAS DAHLBERG<br />\nMany different sexual statuses have \"come out of thL,<br />\ncloset\" these days. The male homosexuals have come out,<br />\nand the lesbians, and promiscuity is beginning to take on<br />\nthe guise of normality. There is alot of talk about the<br />\nmale homosexuals \"rights\", some talk about lesbian<br />\n\"rights\" and there's still a little talk left (it's rarely found<br />\ndefensively necessary these days) about the \"right\" to<br />\nlet around\" without the repression of traditional<br />\n\"mores.\" Of course these \"rights\", though sometimes<br />\npolitical in the case of male homosexuals and lesbians, are<br />\noften just social \"rights\"—i.e., the word \"right\" is used<br />\nloosely within contexts where what the male homosexual,<br />\nor the lesbian, or the \"sexually active\" are actually<br />\npleading for is a society where they can be what they are<br />\ncomfortably, without a sense of social failure and<br />\noppression. Gays, for example, claim that there are social<br />\nproblems attached to being gay which are extremely<br />\nimportant to them no matter how petty they seem to<br />\nothers. They plead for a destigmatized status which will<br />\nmake normal socializing possible for them. O.K. Fine. It's<br />\nall pouring \"out of the closet\" 'cause we're all nice<br />\nliberals and we done opened the door wide. And now,<br />\ndarnmit, at the end of the flood, come the virgins.<br />\nThat's right, the virgins gotta get out of the closet and<br />\ninto the streets. They have been socially disenfranchised<br />\nand they have to start fighting for their (social) \"rights.\"<br />\nMost of the following holds true for non-virgins who,<br />\nalong with many virgins, do not care for presumptuous<br />\nsocial pressure. I will discuss virgins almost exclusively<br />\nbecause I wish to dispel certain myths that surround them<br />\nin particular. The problem from a gregarious, fun-loving<br />\nvirgin's point of view is that many of the people who,<br />\nscrew are making normal socializing impossible for<br />\nhim/her. There are still plenty of women out there, for<br />\nexample, who would love to go out with alot of different<br />\nmen, have a good time talking to them, and go home to<br />\ntheir own bed sans date. Some of them are the most<br />\nparanoid people alive these days. They're getting glares<br />\nwhen they close the door leaving him on the outside,<br />\nreputation as a real bitch, and sometimes they actually get<br />\ncussed out. They don't know if they can accept an<br />\ninvitation or not anymore because they are all too often<br />\nput under pressures that they may actually consider<br />\nvulgar. They meet someone new and they don't know<br />\nwhat to think. \"Does he want to make it? Will he put the<br />\npressure on? Should I take a chance and go out with<br />\nhim?\" And since she's had too many bad experiences<br />\nalready she says \"no\"—possibly to someone with perfect<br />\nmanners.<br /><br />\nAnd that brings us to the problem from a male virgin's ,<br />\npoint of view. Not only does he resent the assumptions;<br />\nand presumptions of the women who use men just a:.;<br />\nreadily as men use women, he may not be able to mak.€<br />\ncontact with the girls he'd really like to know because<br />\nthey may be operating on the assumption that he's just<br />\nanother horny bore. (They may consider this statistically<br />\nprobable in the light of their experience.) The virgin lives<br />\nin a youth culture that always has him/her guessing and<br />\nsecond-guessing about what his date or acquaintance<br /><br />\nVirgin's rights:<br /><br />\nCome out of the closet<br />\nexpects. The trouble isn't necessarily that virgins feel<br />\ncompelled to do what they don't want to do; if they're<br />\nvirgins today they're probably too strong to be serviously<br />\nbothered by the pressures—they just tell whomever it is<br />\nthat they can bloody well go to hell. The trouble is that a<br />\nvirgin may want to socialize normally with members of<br />\nthe opposite sex (or whomever) who do hit the sack; they<br />\ncan handle the pressure these people may implicitly or<br />\nexplicitly apply, they just don't want to be bothered by<br />\nit.<br /><br />\nOne of the social difficulties attached to being a virgin<br />\nresides in the fact that there are all kinds of myths<br />\nsurrounding virginity (just like there are all kinds of<br />\nmyths surrounding blacks, indians, poles, etc.). These<br />\nmyths stigmatize the virgin. For example, one myth is<br />\nthat virgins are impotent or frigid. Of course some virgins<br />\nmay be impotent or frigid, and this may very well by why<br />\nthey are virgins, but there are plenty whose equipment is<br />\nin perfect operating condition and who are virgins for<br />\nreligious reasons, or moral reasons without theological<br />\ninterpretation, or, Lord knows, for health reasons.<br />\nAnother myth is that virgins are virgins because they are<br />\nundesirable and have been forced into it. Like the myth I<br />\nhave just described, this is nonsense if it is taken as a<br />\ngeneralization. There are plenty of virgins who are<br />\ngorgeous, interesting, and engaging human beings. Still<br />\nanother myth surrounding virginity is that virgins are<br />\nashamed of their bodies and sex. In many, if not most<br />\ncases, nothing could be further from the truth. The<br />\nimplicit position of many virgins as such is that sex is<br />\nvery, very good, and because they believe this they<br />\nprotect it from anything that may do it harm according to<br />\ntheir belief system about it. For example, a virgin may<br />\nbelieve that sex ought to have a certain meaning. He/she<br />\ndoes not engage in sex under certain circumstances simply<br />\nbecause he/she is insisting that sex mean such and such<br />\n(e.g., marital commitment, \"real\" love, etc.). It won't do<br />\nto adopt the ridiculous position that sex is a brute fact<br />\nwithout meaning—so is language outside of the rules and<br />\nconventions that people, as rational creatures, invent for<br />\nit. Sex, like language, may take on meaning, and giving it<br />\na certain meaning may be intuited as morally ideal. There<br />\nmay be many good reasons for insisting on a certain<br />\nmeaning in sex; one of them simply being that the<br />\nindividual who does so insist cannot really enjoy sex<br />\nwithout it.<br />\nThe condition, the attitudes, and the beliefs of the<br />\nvirgin must be respected. If .we believe in behaving<br />\nrespectfully toward other minority groups we should<br />\nbehave respectfully toward virgins. There are two<br />\nconcrete proposals to make: 1) do not operate on<br />\nassumptions about virgins that may be nothing but<br />\nridiculous myths, and 2) do not operate on the<br />\nassumption that the new acquaintance, the friend or<br />\nwhomever, wants to screw just because they clearly like<br />\nand enjoy you, and/or accept a date. \"Keepa you hands<br />\noff\" unles in one way or another, you're asked.<br />\nThomas Dahlberg, a graduate student in Philosophy, did<br />\nnot say whether he was a virgin or not. We can onlY<br />\nspeculate.<br /><br />\nLetters we got lots and lots of letters<br />\nTo the editor:<br />\nOn Tuesday, April 12, a panel of the Undergraduate<br />\nAcademic Ethics Board met to hear charges against a<br />\nstudent who had been accused of cheating on an<br />\nIntroductory Chemistry examination. The student pled<br />\nguilty, and was subsequently failed in the course by<br />\nrecommendation of the hearing panel.<br />\nAs Presiding Official of the hearing, I was responsible<br />\nfor making the above mentioned facts known to the<br />\nHopkins community. The following day, I personally<br />\ndelivered to Eric Garland, editor of the Friday edition of<br />\nthe News-Letter, a summary of the hearing that included<br />\nthose facts. Mr. Garland verbally assured me that this<br />\ninformation, in its original form, would be printed in the<br />\nFriday (April 15) issue of the N-L. It was not. I spoke to<br />\nMr. Garland about the deletion that same day, and he<br />\npromised to have Mike Deak, editor of the 'Tuesday<br />\nedition, include the summary that Tuesday. It was not<br />\ndone. I again contacted Mr. Garland, who graciously<br />\nshifted the blame to Mr. Deak, and 'again promised to<br />\nplace the Ethics Board's five-line insert in the next Friday<br />\nedition (April 22).<br />\nOn Friday, htere appeared a boxed insert on the<br /><br />\nbottom of page three entitled \"Ethics Board.\" What was<br />\nprinted, however, was not the simple statement that I had<br />\nsubmitted, but rather a typically irresponsible<br />\nNews-Letter comedy revue.<br />\nThis ill-founded attempt at satire, it seems, srlved only<br />\nto amuse the editorial staff of Hopkins' answel- to The<br />\nNational Lampoon, the irresponsible Friday News-Letter.<br />\nIt distresses me that the News-Letter feels free to<br />\nhandle the serious issue of academic integrity in such a<br />\nfarcical manner. At a time when academic integrity at<br />\nHopkins may be approaching its nadir, it was certainly<br />\ninappropriate and grossly irresponsible to act as you did.<br />\nClean up your act. ,<br />\nLawrence A. Kessner<br />\nto the Ethics<br />\napologize<br />\nsincerely<br />\nThe Tuesday editors<br />\nBoard for any misunderstanding that might have<br />\noccurred. The reason the statement did not appear in<br />\nTuesday's News-Letter was that there took place a<br />\nbureaucratic mix-up between the two editors that resulted<br />\nin the temporary (if not permanent) loss-of the original<br />\nstatement.<br />\nTo the editor:<br /><br />\nWe read with some dismay the article in the Friday<br />\nNews-Letter concerning the state of cinema in Baltimore.<br />\nAs regards this past spring, the Graduate Club of Johns<br />\nHopkins University presented what we felt to be a<br />\nselection of films, free to all, representative of various<br />\ntechniques, eras and cultures. Since January, three<br />\nKurosawa movies alone have been shown, as well as films<br />\nby Mizoguchi, Ozu, Renoir, Resnais, Eisenstein, Griffith,<br />\nKeaton, Von Stroheim and Clair have been screened.<br />\nFurthermore, the series will continue all summer, and for<br />\na list of future films we refer the reader to an<br />\nadvertisement which appears elsewhere in this edition of<br />\nthe News-Letter.<br />\nIt was unfortunate that Friday's article slighted such a<br />\nseries as this, and we suggest that in the future, before<br />\ngoing to Howard Community College to check out the<br />\nmovies, the staff should check across Charles St. in the<br />\nGrad Club, and in its files of Campus notes(!) for records<br />\nof our paq movies.<br />\nR.L. Powell<br />\nPresident of Graduate Club<br />\nR.A. Kline<br />\nFilm Series Coordinator<br /><br />\no be dangerous. but I knew I could do<br />\noing to crash a White House press<br />\nThere were four actual events that I was to \"cover\"<br />\nthat dreary March day. The first was a pboto session in<br />\nthe Cabinet room where Jimmy Carter formally accepted<br />\nthe papers of the Woodcock delegation. This was the<br />\npanel sent to Hanoi to inquire into the MIA's and the<br />\ndiplomatic opportunities. The delegation consisted of<br />\nLeonard Woodcock, President of the United Auto<br />\nWorkers, Senator Mike Mansfield, former ambassador<br />\nCharles Yost, Mrs. Mary Wright Edelman, and<br />\nCongressman G.V. Montgomery. Everyone (press) lined<br />\nup in front of the Cabinet room door and when the lights<br />\nwere turned on (the signal to inter) we rushed in and<br />\nstarted taking pictures. They only allowed 36 seconds for<br />\nthis session—the time varies for each session.<br />\nAfter this photo session, there was a press conference<br />\nin the press room with Secretary of the Interior, Cecil<br />\nAndrus, and Secretary of the Agriculture, Bob Bergland.<br />\nThey were discussing the Administration's evaluation and<br />\naction dealing with the drought experienced in the West<br />\nand Midwest. It was during this session that I had my first<br />\ncrack at the White House press. They were cocky, biting,<br />\nrude, and very effective. At first I was surprised, but then<br />\nI talked to a few of the \"old pros\". They all echoed the<br />\nsame thing—it's a job, and as a job you must come to<br />\nterms with the way you approach it. It was still a little<br />\nhard for me to swallow, but my day was young.<br />\nAt the conclusion of the drought conferen z the<br />\nPePresident surprised everyone by coming in to introduce<br />\nthe Woodcock delegation. Leonard Woodcock gave a<br />\nshort speech followed by a question session. Apparently<br />\nthere were discrepancies in statements among the panel<br />\nmembers prior to the conference. This was enough to<br />\nopen the gates to a wave of questions, many openly<br />\ncynical.<br />\nI made it through these sessions in one piece, and<br /><br />\nreturned after lunch. There was going to be another photo<br />\nsession in the Oval Office with the President as he was<br />\naccepting official portfolios from some foreign<br />\nambassadors. After we marched into the Roosevelt Room<br />\nacross the hall from the Oval Office, we were informed of<br />\nthe procedure. We would be allowed in for 45 seconds of<br />\npicture taking, then about 3-5 minutes to leave and return<br />\nto the Roosevelt Room. Because of the time limit people<br />\nwere pushing and shoving. I even saw a punch thrown.<br />\nThe five ambassadors were from Austria, Chile, Kenya,<br />\nGuinea, and Swaziland. We<br />\nwere having a difficult time trying to figure out what<br />\ncountry each ambassador was from, and much to my<br />\nsurprise, one of the photographers had word sent in that<br />\nwe would appreciate a little introduction. Well, next time<br />\nwe went in and Jimmy Carter introduces the ambassador<br />\nas his good friend from Kenya. I couldn't believe it. It was<br />\nlights, camera, action, and we even added a little dialogue!<br />\nNot that I'm knocking Carter's sincerity. In fact, you<br />\ncould see the true concern and grief in his face when he<br />\nearlier spoke of the MIA's. It's just that I was naive—not<br />\nthat I didn't know of the PR bullshit, but the depth and<br />\nthe strength of the PR really shook me. There I was<br />\nstanding in front of the President's desk in the Oval Office<br />\nand I felt like saying \"cut, take it from the t p, and<br />\nJimmy, do you think you could put your arm around his<br />\nshoulder this time?\" But my day still had many pages left.<br />\nAfter the photo session in the Oval Office, I went back<br />\nto the Press room, where they were preparing to begin a<br />\npress coliteLeilLe Wait Jouy Foweit. it is at tills press<br />\nconference that I felt that some members of the press<br />\nshowed poor taste and outright obnoxious manners. As an<br />\nexample, one of the 12 returned bodies from Vietnam<br />\nwas actually discovered to be an Oriental. Mondale had<br />\npersonally notified the family of the \"mistake\".(The 12<br /><br />\n_families had been given prior notice that the bodies were<br />\nbeing returned). Jody Powell did not disclose the name of'<br />\nthe family since he felt that their grief need not be<br />\ncompounded by the press' harrassment. It made sense ot<br />\nme, but reporters from all over were demanding the<br />\nfamily's name. One went far enough to threaten Powell<br />\nby saying that he would get 50 volunteers to call 10 of<br />\nthe MIA's families (this would cover all the families), and<br />\nin this way he would find the names of all 12 families. I<br />\noverheard another national reporter bragging among his<br />\ncohorts that he'd have the name that very afternoon. I<br />\ncould stand it no longer, and asked him why he wanted it.<br />\nHe threw a lot of crap about it being newsworthy, and I<br />\n. again asked why. Well, he told me how naive and young<br />\nand stupid I was, and I told him what i thought of his<br />\n\"newsworthy\" reporting. Well, one less invitation to<br />\ngraduation.<br />\nAnother matter which bothered me was the security. It<br />\nseems to me that if I had had a gun, I could easily have<br />\nsent Mr. Carter back amongst his forefathers. Admittedly,<br />\n1 had had a Secret Service clearance, but all the<br />\ninformation was Oven over the phone. I'm not saying I<br />\ncould get away with it, but what about the person willing<br />\nto give his life to bring the spotlight to his cause? But, as<br />\nI've learned, the side order for democracy is exposure.<br />\nAll in all, I had a great time and was both impressed<br />\nand irritated with the press. I can't help but think that a<br />\nlittle respect might go a long way. It's true that the press<br />\nmust analyze its information critically, but must they<br />\nobtain it inconsiderately? Perhaps I've singled out the<br />\nexceptions, and maybe in my nervousness they made a<br />\nstronger impression. Whatever, I've learned there's an<br />\nawful lot that goes on behind the newspapers we read<br />\neach day we wouldn't write home to Mother about.<br />\nBarry Muradian'<br /><br />\nStudent, defend thyself:Get those shoeracks<br />\nBY DAVE DE SMITH<br />\nVisitors to our Johns<br />\nhopkins campus see a group of nice buildings and lawns,<br />\nseemingly secure. The fortresses of Garland and Barton<br />\nHalls defy entry by any criminal;besides, everything at<br />\nHopkins has a lock. It must be remembered, however,<br />\nthat no placein ilaltimore is totally secure, even Hopkins.<br />\nThe riff-raff that all too often make.theirpresence felt in<br />\nthis city are not really kept off campus. Hopkins has not,<br />\nand probably will not,decide to become more isolationist,<br />\nmore protective, unless force to. Since the university<br />\nhas adopted the \"good neighbor\" policy instead of<br />\nerecting thirty-foot\" fences, anyonce erecting 30-foot<br />\nfences, anyone can walk on campus. Even before<br />\nHopkins' annual open house, many non-students were<br />\nknown to be wabdering the quads of Homewood.<br />\nCoupled with open dormitory doors, this oftern leads to<br />\ntrouble. Campus police are as helpful in preventing crime<br />\nas the non-existent fences. Homewood is a well-lit<br />\ncampus; there is usually no problem seeing any criminal<br /><br />\nacts as they progress. The problem lies in the preventative<br />\nmeasures. All students were asked to keep their doors and<br />\nwindows locked when not at home. Most students have<br />\ndone so. All housemasters have been asked to keep front<br />\ndoors locked. Few are even closed before eleven o'clock.<br />\nBasement doors in the dorms<br />\nare seldom locked,<br /><br />\nCrime!<br />\nproviding easy entry and exit.<br />\nThough the campus police are trained and conduct<br />\nregular patrols of the campus, they cannot be everywhere.<br />\nWhen a situation calls for police action, the campus patrol<br />\nmust be called. They are not likely to be already on their<br />\nway.<br />\nAs most of you know, and expected, there was crime at<br /><br />\nthe Spring Fair. The mardi gras atmosphere is one which<br />\nhas encouraged _rowdiness and activity here at Hopkins,<br />\nbut one which is produced at the students' expense. By<br />\nnow you may have had time to to forget about the fair's<br />\ncrime. Or you may have veen informed by now that ,lite<br />\ninjured Hopkins undergrad wasm't hurt? the<br />\nincident stirred a lot of discussion abouttecurity and the<br />\nvalue of the Spring Fair itself. If we must put \"3400 On<br />\nStage.\" we'd better be more prepared. The time to Make<br />\ncertain that security is working is before it has a chance to<br />\n'fail, as it did at the fair. If our university insists on<br />\ncreating potentially dangerous situations on our own<br />\ncampus without providing adequate protection, it is time<br />\nto have a'talk with the universiyt. That we do not have<br />\nlocking gences is okay, as long as we remember how to<br />\nbuild them. Above all, don't despair. Hopkins is as safe as<br />\nyou can get in Baltimore, and if this article has mad e any<br />\nstudents uncomfortable in their dorm room,look in your<br />\ncloset. The two iron bars acting- as a shoerack, when<br />\n,removed, amke excellent defensive weapons.<br /><br />\ne.•<br /><br />\npage 6/news-letter/may 3, 1977<br />\nTo M.P.11<br />\nII rriglicr lath°<br /><br />\nGRADUATE'STUDENT PICNIC<br />\non thr ower quad (ohrIver hall)<br />\nsponsored by<br />\nTHE GRAD CLUB<br /><br />\nss1i2nola Jam)<br />\nopTsAilunop `urnetT<br />\n-crew'am `,1E1 `21.1!Ari UliEj `satov limo 7<br />\nmg/A 'vs JED„<br />\n„znoA<br />\nS11101-1 UOSVEl `1.1.10pEH `s4uAploolET `XLIO-If{ • T<br /><br />\nby Bob Buchanan<br />\nOn'living50<br /><br />\nBetter than the others,<br />\nwho grope with decision<br />\nandfight their useless battle<br /><br />\noiptiosoN •c<br />\ntiorog ro3o3<br />\n=E03<br />\nuoisog •E<br />\nxtuootld •z<br />\no2rom •<br /><br />\nIjust maintain my identity<br />\n(can't swim with those nfinnows)<br />\nas the only true<br />\nsculptor ofour language<br /><br />\nYou all know me<br />\nthe man ofmen here<br />\nStoical presence, syn2bol<br />\nofproper usage<br />\nSpent6 months out West<br />\nwith Jerry, with Jackson<br />\nworking on my style<br />\nwhile swrdlerin'countless dishes<br />\noforange danish<br /><br />\nReturned tofind my nemesis<br />\nrelieved ofhis command<br />\nwith no ability to replace me<br />\nthe slum<br />\nLooldn'nowfor a light daily<br />\nRestaurant reviewer<br />\nwill do mefine<br />\nYou seeIcannot go<br />\nNo,Ican't go on forever<br />\nRollin', albeit stoned<br /><br />\nA Boorish Affair<br />\nBy 1t P. Duvoidien<br />\nMy hopefora world<br />\nfull ofprecise diction,<br />\nunflawed construction,<br /><br />\ng '0I<br />\nEl '6<br />\nD'S<br />\nV L<br />\n1'9<br />\n'S<br />\nI 't7<br />\nH •£<br />\n'Z<br />\n'I<br />\nsiomsuV<br /><br />\nFREE BEER &amp;SANGRIA<br />\nvolleyball,soceer,softball<br />\nSUNDAY NIAY22 lp.m.<br />\nALL GRAD STUDENTS&amp;FAMILIES<br />\nINVITED<br /><br />\nUBS 1977<br /><br />\nCharter Tours<br /><br />\n;C)UCH<br /><br />\n&amp; Balto Departures<br />\naaaaaaaaiaaaaaaaaaaaiaasaaaass<br /><br />\nLondon<br /><br />\n20-july15 Session ll•j<br />\nwoe<br />\nY/8.4<br /><br />\n1.2 &amp; 3 week charters<br />\nMarch—Dec. 30 Weekend<br />\nDepartures. via British<br />\nCaledonian Airways<br /><br />\nSome courses offered are:<br /><br />\nRoots: A Practicum in<br />\nGenealogy.<br />\nDance Therapy,<br />\nIntroduction to<br />\nComputing ,<br />\nPolitics of Women's<br />\nLiberation.<br />\nCollege<br />\nComposition.<br /><br />\nair only<br /><br />\n11111111111111111<br />\nfrom<br /><br />\nBahamasJmualyr--N%-:,3259 9 $299<br />\n17 weekend departures<br />\nAir, Hotel, Tax Piedmont Airlines<br />\nall inclusive<br /><br />\n•1111•1111101111111111111111111111111111151111•11•11•111111111111111111<br />\nAcapulco $315-9 depar- from<br /><br />\nPAexico<br />\nABC &amp; OTC<br /><br />\n15<br /><br />\nFOR FURTHER INFORMATION CALL 825-3300, EXT.410<br />\nGoucher College admits students of any race, color and national or ethnic origin.<br /><br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $410.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 thru<br />\nApril 30 and $430 from May 1 thru June 14.) All you<br />\nhave to do is be under the age of 26.<br />\nThere are no booking restrictions. We give you the same<br />\nservice you'd get from other airlines, without the same high<br />\ncosts. So,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to. We'll give you be best deal<br />\non fares and on our New Horizon Escorted Tours,too.<br /><br />\nM:<br />\n6<br />\na r -Der $345<br />\nepa<br />\nlia<br />\nrlan<br />\ntwlafrom 4<br />\n11141<br />\n71tdillia<br /><br />\nAmerican &amp; United Ahlines<br /><br />\nair only<br /><br />\n11111•111•111111111111111•111111111111111111111111111111111111111111111<br /><br />\nIreland .<br />\nPlease call<br /><br />\nBURCH.<br />\nTRAVEL LTD<br /><br />\nimpeccably grammatical sentences,<br />\nunquestionerl excellence ofusage<br /><br />\n4674900<br /><br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br /><br />\nNo matter to substance<br />\npay no heed to proper understanding<br />\nAre the t's crossed, the words right,<br />\nthe phrasing completely parallel?<br /><br />\nInc worldfull ofuncertainty,<br />\n's and<br />\nfull ofthe Mr. D's,,<br />\nthe J. D. 's<br />\nlet us confine our attention<br />\nto the dramatic and dashing,<br />\nthe wresting gesture or word<br />\nStrivefor conciseness<br />\nand proper phrasing<br />\nAllay this tenuous notion<br />\nofa concernfor substance,<br />\nfor leadership,<br />\nfor great wisdom<br /><br />\nwill they never understand<br />\nthe necessity<br />\nofvacuum-cleaned language<br />\nAllay myfears<br />\nPlease do not reveal<br />\nmy unabashed ignorance<br />\nofthe issues involved<br /><br />\n,:<br /><br />\nTarot, the Psychic<br />\nand the Occult<br />\nFieldwork in<br />\nPsycho.logy<br />\nSociology of Sport<br />\nAging as a Social<br />\nIssue<br />\nPersonality Theory<br />\n'Semester in<br />\nWashington<br /><br />\nCourses are also offered in Biological Sciences, Chemistry,<br />\nPhysics. French. Russian and Spanish.<br /><br />\ntures Feb Dec: Tri Mexico $<br />\nPut4<br />\na grattruie/Pjeetcrt)<br />\nvalrarta $399-July 22-29<br />\nAir. Hotel, Tax American &amp; United Airlines<br />\nall inclusive<br />\nOTC &amp; ITC<br />\n111111•••ail11.111••111111•1111/111•1111•11 MINN 1111••<br />\nfrom<br />\non Waildid Vita<br />\n:<br />\nl '12,9<br /><br />\nHawaii<br /><br />\nWOMEN<br /><br />\nOPEN TO MEN AND<br /><br />\n$<br /><br />\nParadise island<br />\nHoliday Inn<br /><br />\n(Igo<br />\nStp<br /><br />\nOXN\"<br /><br />\nfrom<br /><br />\nABC &amp; TGC<br /><br />\nOTC<br /><br />\n1977 SUMMER<br />\nSESSIONS<br /><br />\nGOUCHER<br />\nCOLLEGE<br /><br />\nSPENDING THE SUMMER<br />\nIN NEW YORK?<br />\nADVANCE YOUR COLLEGE CAREER.<br />\nTAKE SOME COURSES AT HUNTER.<br />\nArt<br />\nBiology<br />\nBlack Studies<br />\nChemistry<br />\nCinema<br />\nClassics<br />\nCommunications<br />\nEc:onomics<br />\nEducation<br /><br />\nEnglish<br />\nForeign Languages<br />\nGeology/Geography<br />\nHealth &amp; Physical<br />\nEducation<br />\nHistory<br />\nHome Economics<br />\nMathematics<br />\nMusic<br /><br />\nName<br />\nAddress<br /><br />\nIcelandic<br />\nCity<br /><br />\nPuerto Rican<br />\nStudies<br />\nPhilosophy<br />\nPhysics and<br />\nAstronomy<br />\nPoitical Science<br />\nPsychology<br />\nSociology<br />\nUrban Affairs<br /><br />\nState .<br /><br />\nZip<br /><br />\nj<br /><br />\nLyares subject to change and govt.approval.<br /><br />\n4111<br /><br />\nLowest Jet fares to turope of any scheduled airline.<br /><br />\nThe distinguished Hunter Faculty teaches during the six week<br />\nSummer Session (both day and evening). Reasonable fees are<br />\nmade possible by the support of the City and State of New'York.<br />\nThe college is conveniently located on the Upper East Side at<br />\n68th Street between Park and Lexington.<br /><br />\n_<br /><br />\nBURCH TRAVEL LTD<br /><br />\nFor further information write or call:<br /><br />\nSCHOOL OF GENERAL STUDIES<br /><br />\n1<br /><br />\nHUNTER COLLEGE<br /><br />\nIt<br /><br />\nOF THE CITY UNIVERSITY OF NEW YORK<br /><br />\n695 PARK AVENUE, NEW YORK, N.Y. 10021<br />\n(212) 570-5646<br /><br />\n—1<br /><br />\n1—lc landic Airlines, Dept.#CN<br />\nPt/ Box 105, West Hempstead, N.Y. 11552<br />\nSee your travel agent. Or call toll free:(800)555-1212.<br />\nPlease send information on Icelandic's low-cost fares and New<br />\nHorizon Escorted Tours of Europe.<br /><br />\n4<br />\n'<br /><br />\n3990 N. Charles St.<br />\n467-3900<br />\nWe enjoy helping the<br /><br />\nHopkins Community with<br />\ntheir travel plans.<br />\n•<br /><br />\nmay 3, 1977/news-letter/page 7<br /><br />\nCOMMENCEMENT WEEK<br />\nWednesday, May 25<br /><br />\nNoon to 5:00 p.m.<br /><br />\nBULL ROAST<br />\nSaturday, May 21<br /><br />\n9:00 p.m. to 1:00 a.m.<br /><br />\nSPEAKEASY — RAMSKELLAR<br />\nMixed drinks<br />\nDancing<br /><br />\nEvergreen House<br />\n4545 North Charles Street<br />\nAll You Can Eat<br />\nLive Tlimd<br /><br />\n$3.00<br />\n$4.00 After May 18<br /><br />\nProper Dress Required<br />\nFree to Seniors and Guests<br /><br />\nThursday, May 26<br />\nMonday, May 23<br /><br />\n9:00 p.m. to ???<br /><br />\n5:00 p.m. to 7:00 p.m.<br /><br />\nCOCKTAIL RECEPTION<br /><br />\nSENIOR BLOW—OUT<br /><br />\nfor<br />\nEimily, Friends<br /><br />\nCome as you are to<br />\n4220 North Charles Street<br />\nDU Fraternity<br /><br />\nGlass Pavilion<br /><br />\nMixed Drinks Provided<br />\nFree to Seniors and Guests<br /><br />\nTuesday, May 24<br /><br />\nB.Y.O. Beer<br />\nExpect Anything!<br /><br />\n8:00 p.m. to 1:00 a.m.<br /><br />\nGRADUATION DINNER DANCE<br />\nHoliday Inn Downtown<br />\nHoward and Lombard Streets<br />\nSemi-formal Attire<br /><br />\nSingles Welcome<br />\n$6.00 per Person<br />\nNo Reservations Taken After May 12.<br /><br />\nFriday, May 27<br /><br />\nAll Day<br />\nTHE GRADUATION<br /><br />\n9:00 — University Commencement Ceremony<br />\nGuest Speaker Dr. William D. McElroy<br />\nChancellor, University of California, San Diego<br />\n2:00-- Undergiaduate Diploma Ceremony<br />\nGuest Speaker -- Dr. Isaac Asimov<br />\nDistinguished Author and Biochemist<br /><br />\nAll events are open to Seniors, their families, and guests.<br /><br />\nSeniors - Check Your Mail Box<br /><br />\nFINAL DAY<br /><br />\nSALE<br />\nMEN's TRADITIONAL<br />\nSILADIUM RING<br /><br />\nONLY $59.95<br />\nRegularly 5 75.00 cusiom<br /><br />\nHU BOOK CENTER<br />\nMY 9th<br />\nTHRU<br />\nMAY 19,th 1977<br /><br />\n,-<br /><br />\n0 ! HERE IS A PARTIAL LIST OF THE MANY TITLES WE WILL BE BUYI G:<br />\n4 i<br />\nA<br />\nI.<br />\n1.11<br />\n0<br />\n0<br />\n1<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\nF.<br />\n1-4<br />\n0<br />\n4<br /><br />\nNi<br /><br />\nLinear Algebra<br /><br />\n3rd Edition<br /><br />\nAllyn &amp; Bacon<br /><br />\n$8.00<br /><br />\nCurtis<br />\nHartt<br /><br />\nArt<br /><br />\n1976 Ed.<br /><br />\nPrentice-Hall<br /><br />\n$5,.00<br /><br />\nPsychology<br /><br />\nHulse<br /><br />\n4th Ed.<br /><br />\nMcGraw-Hill<br /><br />\n-$10.00<br /><br />\nMorrison Organic Chemistry 3rd Ed.<br /><br />\nAllyn &amp; Bacon<br /><br />\nDifferential<br />\nEquations<br />\nCalculus and<br />\nThomas<br />\nAnalytic Geom..<br />\nWilliamson Calculus<br /><br />\nMcGraw-Hill<br /><br />\n$8.00<br /><br />\nAddison-Wd.My<br /><br />\n$9.00,<br /><br />\nPrentice-Hall<br /><br />\n$8.00<br /><br />\nWiley<br /><br />\n$8.00<br /><br />\nSimmons<br /><br />\n1972 Ed.<br /><br />\n3rd Ed.<br /><br />\nplace:<br /><br />\n!I<br />\n.<br />\n0<br />\n0<br /><br />\n$6.50<br /><br />\nZafiTatos<br /><br />\nPhysics<br /><br />\n1976 Ed.<br /><br />\nPRICE ON HUNDREDS OF TITLES.<br />\nTO 507. OF THE ORIGINAL<br />\nTHE BOOK CrNTER WILL PAY or<br />\nCENTER FOR PRICES<br />\nBOOK<br />\nTHE<br />\nTO<br />\nTEXTBOOKS<br />\nBRING YOUR<br /><br />\nT<br /><br />\nT..<br /><br />\nARTORVED RING DAY<br />\nThat's when the ArtCarved representative will be here<br />\nto help you select your custom-made college jewelry.<br />\nIt's also the day you can charge your ArtCarved<br />\ncollege jewelry on Master Charge or BankAmericard.<br /><br />\nJHU<br />\nBOOK CENTER<br /><br />\ntime:<br /><br />\nMAY<br />\n5,6&amp; 9<br /><br />\n1977<br /><br />\n3 DAYS ONLY<br /><br />\nLAST 2 DAYS<br /><br />\nTHIS WEEK ONLY<br /><br />\n2 DAYS ONLY<br /><br />\n1. Prologue<br />\nNevertheless if anarchy is to be avoided, the individuals<br />\nwho make up a society mustj<br />\nfrom time to time be<br />\nreminded, at least in symbol, of the underlying order that<br />\nis supposed to guide their social activities. Ritual<br />\nperformances have this function for the participation<br />\ngroup as a whole; they momentarily make explicit what is<br />\nothe ise a iction. —Edmund Le<br /><br />\nI'm getting old. The youthful elasticity that permitted.<br />\npositions of sexual derring-do has gone taut, and every<br />\nnow as I write (stretched on a lumpy motel bed in King of<br />\nPressia, Pa., the Willy Loman of bigtime college golf) my<br />\nlumbar feels like lumber and my ulcer burns with<br />\nunrequited desire I can no longer hope to consummate.<br />\nJust moments ago, the sight of a cocktail waitress'<br />\nbobbing boobs did not send my heart a pitter-patter. My<br />\nbusiness associates exchanged what Victorian novelists<br />\ncalled \"knowing glances\" I<br />\nthat left<br />\nmy head with a dull migraine ache. What's that stupid old(<br />\njtike? \"You're only as old as the girls you feel?\" I longh<br />\nfor the solitariness of the motel room and a quick game of<br />\ntelevision roulette before retiring to the land of the<br />\nSandman. Yes, I suppose I'm getting on in years and I<br />\nhave only the memories of happier days to content<br />\nmyself.<br />\n\"You'll remember this night for ever,\" my mother<br />\nwhispered while adjusting my collar and stuffing my pants<br />\npocket with Maalox tablets<br />\nVisions of dread ease into my consciousness. It's the<br />\nnight of my Senior Prom. Happier days? If one consider<br />\nhappiness a relative function, I suppose so. Besides, The<br />\nHoneymooners is over, and now the Silver Savior, Rex<br />\nHumbard, has taken control with his Holiday Inn concept<br />\nof the Great Beyond. Reluctantly I make the decision,<br />\nand now I slip a quarter into the slot on the headboard<br />\nand as the bed starts to vibrate, I remember----<br /><br />\nof ritual (as anthropologists, the voyeurs of academia, call<br />\nit) than just sexual silliness. There must be some method<br />\nto this madness of tuxedoes, corsages, etiquette briefings,<br />\nappointments with hairstylists (Adam and Eve's \"We<br />\ncut both ways\" — offered special prom discounts),<br />\nsleepless nights of worry, the careful clipping of toe and<br />\nfingernails<br />\nthe inventory of such acts makes my mind<br />\nshudder with embarrassment. What a foolish young blade<br />\nI was!<br />\nThe scene: A deserted country road somewhere in<br />\ncentral New Jersey. It is an evening in mid-April and five<br />\nhigh school seniors sit inside a 1972 Mustang drinking<br />\nwhiskey and rye and, knowing that Prom Day will be the<br />\nday they die, are getting blown away.<br />\nMyself: Hey, don't knock masturbation. It's sex with<br />\n;omeone you love.<br />\nHarold Nunamachr: What a case of meglomania!<br />\nFred Glaubinger: (Holding fingers to nose) Who di,<br />\nthat?<br />\nGorilla Muldoon: He who smellt it dealt it.<br />\n\"One Night Stan\" Wertheimer: Speaking of which, are<br />\nyou still planning to take Mary Lou Hooper to the prom?<br />\nFred: If she ever crawla out from under her rock-Myself: You want a knuckle sanwich, Glaubinger?<br />\nFred: Yeah, and hold the mayo,crater face.<br />\nHarold: -I tried to cop a feel off Audrey Sedlek<br />\nSaturday night<br />\nGorilla: Audrey Sedlek tried to feel a cop Saturday<br />\nnight?<br />\nFred: Did you know that E.J. Korvettes stands for<br />\nEleven Jewish Korean War Vets?<br />\nMyself: Mary Lou Hooper's not much to look at, but<br />\nshe sure is a whiz at geometry.<br />\nStan: You hear the one about the American<br />\nbusinessman in Tokyo<br />\nI was lying to the guys I hadn't even asked Mary Lou<br />\nyet, let alone even gone out on a date with her. Put a few<br />\njiggers of Jim Beam in me and I'm likely to tell all. So the<br />\nnext morning I woke with a headache and an obligation<br />\nto ask Mary Lou to the prom. It wasn't going to be a<br />\npiece of cake, but at least I could try. And if I failed...<br />\nI'm convinced the Clint Eastwood sunglasses did the<br />\ntrick. I sauntered up to her table in the cafeteria wearing<br />\nmy tightest t-shirt, and without gulping, asked her for a<br />\ndate that Friday night, a scant two weeks before the<br />\nprom. She looked dreamily at me with those marbles I<br />\ncthink were her eyes and the words<br />\ncame out on<br />\nangel's breath, \"I'd love to!\" I'd by to. Christ, I could've<br />\nwet my pants. Luckily I made my escape by squeaking<br />\nout a lie, \"Excuse me, but I have a reservation to use the<br />\nweight room,\" which she accepted with that crinkle of a<br />\ngrin I soon learned to treasure.<br />\nLet me draw a picture of Mary Lou Hooper. Better,<br />\nhcre's her yearbook picture.<br /><br />\nby Mike Deak<br /><br />\n3. Why do<br />\nHummingbirds<br /><br />\nrs,<br />\nWho walks these locker-covered halls? Tradition, as Tevye<br />\nwould shout to the multitude. Tradition in the form of<br />\nthe ghosts of the innumerable illuminaries Somerville<br />\nHigh has given to the world. Here comes the most famous,<br />\nPaul Robeson, a man who needs no introduction and first<br />\nperformed Othello on the auditorium stage; also in show<br />\nbiz, Lee Van Cleef, a distant cousin by a great aunt, the<br />\nprince of spaghetti westerns; and a hearty top of the<br />\nmorning to those handsome boys in Varsity Club jackets,<br />\nCharley Winner, ex-coach of the New York Jets, and Joe<br />\nLis, platoon first baseman for the Seattle Mariners; and<br />\nfinally (the list has to end sometime) there's Gentleman<br />\nRay Bateman, favorite to defeat OTB (\"One Term<br />\nByrne\") in this year's gubernatorial race. With such<br />\nmodels, no wonder we thought the world was our oyster<br />\nand only the sky was the limit.<br />\nWe looked forward to the Senior Prom as eagerly as the<br />\nnatives of Capistrano look to the return of the swallows.<br />\nExactly why I don't know. Why do hummingbirds hum<br />\nVanity of vanities, the old ecclesiastical saying goes, the<br />\nrites of spring, Sioutfir, beauty, and virility. Unfortunately<br />\nI was familiar with none of the above, so I saw the prom<br />\nas a golden fleece of an opportunity to legitimize The Big<br />\nScore, the respectable and socially acceptable deflowering<br />\nof that bubbly tulip I had trained my beady little eyes on<br />\never since she moved here from Ho Ho Kus in seventh<br />\ngrade, the effervescent, ever lubricous Mary Lous Hooper.<br />\nThere must be something more to this native's model<br /><br />\nVisions of<br />\nranges and<br />\ne gnoirs<br /><br />\nMary Lou's on the left, and the other two mugs happen to<br />\nbe Stan Wertheimer and Isabel Horowitz who were our<br />\ndoubledate for the prom. If the phrase \"bottom of the<br />\nbarrel\" occurs to you, please be kind and remember that<br />\nbeauty is in the eye of the beholder, and, goddamit, we<br />\nwere desperate.<br />\nMix two parts memory and three parts desire and you'll<br />\nknow why Eliot called April the cruellest month. That<br />\nFriday came faster than Linda Lovelace (a little teenage<br />\nhumour, very little in fact) and I was a prime contender in<br />\na Maxwell Smart incompetency contest. I cut myself<br />\nshaving with an electric raxor, wore my underwear inside<br />\n,out, singed my scalp with my hot comb, and so on. I<br />\nconned my brother into lending me his jalopy, a<br />\nzooped-up '69 Cougar with its nose stuck up in the air<br />\nlike a blue-blooded Ivy Leaguer, which prompted Mr.<br />\nHooper to sarcastically chortle, \"When does the<br />\ncountdown begin, space cadet?\"<br />\n\"Wilbur,\" Mrs. Hooper screeched, \"remember your<br />\nmanners. Mike's our guest, you know.\" \"<br />\n\"Just joshin' son,\" h replied with a kind-hearted<br />\npunch on the shoulder that sent me groveling towards the<br />\ngutter.<br />\n\"Now you have Mary Lou back before midnight,\" Mrs.<br />\nHooper waved a matronly finger, \"she needs her beauty<br />\nsleep.\"<br />\n\"She better take an overdose of sleeping pills if that's<br />\ntrue,\" her younger brother Herb Hooper hissed.<br />\n\"How you like one 'cross your lips?\" Mr. Hooper<br />\nthreatened with his. Red Foxx impression.<br />\n\"Take care you two,\" her mother shouted as we drove<br />\naway,\"I know how I was when I was you age.\"<br />\n\"Parents,\" Mary Lou said with that french fry smile.<br />\n\"Yeah, parents,\" I replied, a graduate of the Gary<br />\nCooper School of Witty Conversation, summa cum lousy.<br />\nI suppose all these allusions to movie stars<br />\nunconsciously reveal the role flicks played in my<br />\neducation of social behavior outside the family. I think it<br />\nwas also Edmund Leach who said that myth and ritual<br />\nwere one and the same, or t least in merican culture,<br />\ntry to be. But enough of the theory. I took Mary Lou to<br /><br />\ndni<br />\nthe last remaining Jerry lewis Cinema in New JerseY<br />\nI<br />\npet<br />\nits<br />\nin<br />\n\"Frenzy,\"<br />\na<br />\nfilm<br />\nthat<br />\nHitchcock's<br />\nAlfred<br />\nway I th ught would set a romantic mood. And indeeivent<br />\ndid, as with the first shot of a naked corpse floating'\"„01<br />\nThames, her hand jumped into mind and stayed there<br />\nqtas<br />\nrest of the movie.<br />\n\"Wasn't that a good movie,\" I said driving to the at ofn<br />\nYork Inn in Raritan, an infamous local hangout who:<br />\nare not required if you slip the bouncer a buck. ri rchl<br />\nknow,\" she replied in a bashful tone,\"I don't like iv° Ito e.<br />\nti<br />\nthat scare you.\"<br />\n\"But it's only a movie, it's only a strip of caul Lik(<br />\npassing before a light bulb, it's not even human...\" leke ca<br />\n1t1S1<br />\n\"Well, let's not argue about it,\" Mary Lou said, :<br />\n4 an<br />\nhave a goodtime \"'<br />\n\"We'll have a pitcher of Rheingold,\" I told the yva:It1 Und<br />\nari<br />\nin my eighteen year old voice impression (I was,d qartt<br />\n'<br />\nseventeen and a half and only God knows how old<br />\nLou was.)\"You like beer?\"<br />\n\"I don't know,\" she sighed, \"I've never had any. (es,<br />\n4e, 0<br />\nHer words shot a dagger of excitement throu ,A<br />\nwou'\"<br />\nknd<br />\nhead. Oh my God, I thought, I didn't think it<br />\nthis easy. I mean, only in the Penthouse forum do e<br />\nlike this happen. Had I committed some social faux<br />\nwas she merely submitting to her primitive animal u<br />\nto let me take her in one glorious swoop and slie<br />\nmerely helping the situation along? I never knew, bd,<br />\nat that instant, Gorilla Muldoon dropped by with his s<br />\nances Tooty, and together they drank three-quarter<br />\nthe pitcher, and I had the other quarter, and MatY4<br />\njust sat there silently smiling and laughing when reci\"/<br />\nI wiped my mouth on my sleeve and coree<br />\nsuggested to Tooty and Muldoon, \"I think it's tiro (ji<br />\nhave to go.\" And we all got up and walked out t°<br />\nparking lot, said our goodbyes, and departed in oPP<br />\ndirections, Tooty and Muldoon off to North 131<br />\nwh re neither one lived (but where there was this ribi<br />\nlittle spot, you see, off Burnt Mills Road,....) and we<br />\nthrough Raritan to Somerville and home.<br />\n#<br />\n\"Well, we're home,\" I turned off one engine '<br />\n5'<br />\nfiguratively on another, \"did you have a good time?'')<br />\n'<br />\ne<br />\nShe looked at me with that glazed look in her eY,<br />\nwas the best time I've had this year,\" she whispere'to<br />\nthis a cue? I stretched my neck like an ostrich overei<br />\nand quickly like a mosquito, kissed her, and retfr<br />\nback to my corner to wait for her to ring the bell 1<br />\nnext round.<br />\n(itie<br />\n\"That was nice,\" she chirped, \"but it's too elv\"<br />\n79<br /><br />\n4<br /><br />\nth<br /><br />\n'It's<br /><br />\n•<br /><br />\nt° ,itinight,\" and a cold shower of silence dripped between<br />\neicp4;,' I thought of the old joke about the scientist who<br />\noe' vented a romantic toaster to pop the question. And I<br />\n(1,<br />\nere (10h Mike,\" she cooed, 'that would be absolutely<br />\ntastic. Yes, I accept your invitation,\" and landed a kiss<br />\nhe 4at fluttered like a butterfuly on my cheek. And she was<br />\nefe<br />\nt of the car in a jiffy, and up her front steps where the<br />\n'chlight<br />\ngleamed hope and love and all the comforts of<br />\ncoo<br />\nTite• \"See you on Monday,\" she called and disappeared<br />\nthe house without waiting for a reply.<br />\n'Ow Like a zombie I drove across town to home and parked<br />\nCar in the driveway. I was completely numb, as if the<br />\nritiSt had overdose me on Novacaine. I got out of the<br />\n.0 and looked up to the sky and, as my habit still is,<br />\nv\"nd On n and traced the figure of the hunter pointing<br />\n5 arrow at men.s souls. I regained feeling and was<br />\ntantly aware of a bulge in my jeans. Till that time I'd<br />\n4sidered myself a draft doger in the war between the<br />\nkes, but now I was committed to a cause. I had fallen in<br />\ngh eA,or at least I had convinced myself<br />\nof that.<br />\n)<br />\n1it'<br />\nInd hummingbirds hum because they ,don't know<br />\ntli<br />\nords.<br />\n1/1<br /><br />\nhe<br /><br />\nis d'<br />\nteis<br /><br />\n4°0'<br />\nfef<br />\nfoe t i<br />\nto<br /><br />\nos<br /><br />\night<br /><br />\nAs those great pedagogues of pederasty, Hermans<br />\nHermits, have n ted, on such a night as Prom Night<br />\nthere's a kind of hush all over the world and people just<br />\nlike us are falling in love. Falling in love.<br />\nTradition taught us that the Prom -itself was not as<br />\nimportant as what happened after the Prom. The Prom<br />\nwas just the stuffing for this turkey of a ritual. Stan and I<br />\nmade the shrewdest of plans; a quick midnight snack<br />\nafterwards at the refurbished Bridgewater Diner, and a<br />\ndrive East, to either New York, for some more partying,<br />\nor to the Shore, and a litt e rom nce. I pr ferred the<br />\nlatter; a fantasy keeping me awake nights had Mary Lou<br />\nand I cavorting on some Caribbean beach, the two of us<br />\nalone, running hand in hand as the eaves, endless waves,<br />\nlapped our ankles<br />\nWe decided to take Stan's car, a machine that had all<br />\nthe smell and color of a lemon , a 1970 Ambassador<br />\nStan's father only bought because American Motors<br />\nsponsored the Mets games on television. It wasn't the<br />\nbest-looking car; in fact Mr. Hooper remarked, \"What<br />\nhappened? The pickup have a flat tire?\"<br />\n\"Wilbur!\" Mrs. Hooper scrreched again,.'sometimes I<br />\nwonder.\".<br />\n\"Is Mary Lou ready yet?' I squawked, my necl<br />\nsqueezed by a boa constrictor of a necktie. Note of<br />\nexplanation: this was 1974 so standards of dress were<br />\nrelaxed to allow what Amy Vanderbilt calls<br />\n\"semi-formal\" attire.<br />\n\"She's busy getting plastic surgery,\" Herb sneered,<br />\n\"You better hope they don't take the bandages off till<br />\nnext week.\"<br />\n\"How would you like me to part your hair with a<br />\ncrowbar,\" Mr. Hooper shook a first at him.<br />\n\"Why Isabel, you look just like Deanna Durbin,\" lrs.<br />\nHooper praised, \"oh but you kids are too young to<br />\nremember her.\"<br />\n\"Mike, do you have protection?\" Mr. Hooper asked witl<br />\na chiseled grin.<br />\nI nodded my head, thinking of the four fiesta-colored<br />\nTrojans -- \"The Korvette of the Contraception scene\" -stuffed in my pocket along with the Maalox, and realizing<br />\nhe must have meant something else, blurted out,\"Oh yes,<br />\nAllstate. Don't worry sir, your Mary Lou will be in good<br />\nhands.\"<br />\n\"Well, just watch where you put those good hands,\" he<br />\nm cked with a wink of his left eye.<br />\nJust then Mary Lou appeared. I gasped out of surprise.<br />\nShe was actually good-looking as she, wearing a saffron<br />\ndress with a neckline that played footsie with her cleavage<br />\nand her pimples covered by so many layers of make-up I<br />\nwondered if her Avon lady could have retired to Miami<br />\nBeach on this commission, waltzed towards me.<br />\n\"You look absolutely stunning,\" I said. (\"Stunning?\"<br />\nStan whispered, \"What is he blabbering about?\" I'd<br />\nforgotten to tell him I had watched Dan Daily movies for<br />\nthe past month to gain insight into suave, sophisticated<br />\nbehavior.) \"Shall we go,\" I said taking her arm and then<br />\nturning to her parents, \"Ta-ta.\"<br />\n\"Oh Wilbur,\" Mrs. Hooper swooned, \"chivalry isn't<br />\ndead.\"<br />\n\"It's vaudeville that's dead, Hedda,\" he answered,<br />\n\"vaudeville.\"<br />\nAs we drove away, I said to Mary Lou,\"Your mother's<br />\nname isn't really Hedda, Hedda Hooper is it?\"<br />\nShe smiled that shoestring smile, \"Parents.\"<br />\n\"Yeah, parents,\" I replied. Tht evening was off to a<br />\ngreat start.<br />\nMartinsville Inn sits hidden somewhere in the Watchung<br />\nMoutains north of Bound Brook, and Stan, ever the<br />\nclown, put lead in his foot and tok the dangerous hairpin<br />\ncurves at near fifty. \"It's macho,\" he explained to our<br />\ndates.<br />\n\"It's not macho anything,' Isabel laughed like a<br />\nlooney and inched over towards Stan. A feeble smile<br />\ntwitched my lips as Mary Lou slinked towards me. What<br />\nhappened next was a case of bad fate. The moment her<br />\nhand landed on mine in a tight clench of safety, I sneezed,<br />\nand instinctively, brought my :hand up to my mouth with<br />\nher hand coming along for the ride. It was a particularly<br />\nbrothy sneeze and I was at a loss of words. \"I didn 't get<br />\nyour hand wet, did I?\" And she shook her head, and took<br />\nher hand away to adjust her corsage. When she wasn.t<br />\nlooking, I wiped my hand on the car seat, not wishing to<br />\ndig into my pocketful of miracles for a hankie.<br />\nThe theme for the Prom was \"Guys and Dolls,\" but<br />\nnobody could tell it from the sleazy rock band, a bunch<br />\nof local punks called \"The Wild Strawberries,\" who didn't<br />\nknow \"Fugue for Tinhorns\" from \"Stairway to Heaven\"<br />\nThe Decorations Committee had been hit with a case of<br />\nmono and, consequently, there was a notable lack of<br />\ndecorations, so it didn't really seem like a Prom. But our<br />\nhearts did not despair; we were rebellious children,<br />\ncontemptu us of anything reeking of Tradition, th ugh<br />\nat the sale time deeply guided by the precepts of<br />\nTradition. No wonder that 5% of our class (by latest<br />\ncount) had found their way into the Crackerbox Palace.<br />\nWe were treated to the typical Martinsville Inn dinner,<br />\nthe same fare of anti-pasta, manicott, filet mignon half<br />\nbaked potatoes, and vanilla ice cream with \"sprinkles,\"<br />\nmy father's lkowling league banquet had. But the food<br />\nwas washed down by .a special presentof the Faculty Club,<br />\nglasses of slightly foxy Cold Duck that made our tongues<br />\nthe lucid instrume ts of witty execution one ;would<br />\nexpect of the Three Stooges at a debutante ball.<br />\n\"With the amount of Christians around here,\"<br />\nrem rked Murray Rabinowitz, the class valedictorian and<br />\nalso headed for Hopkins,\"they should call this 'Goys and<br /><br />\nDills.'\"<br />\n\"Did you know what you are, Murray?' I gal...Tied.<br />\n\"you're a J.A.P., a Jewish-American Poet.\" Mary Lou's<br />\nlaughter shrilled in my ear, \"Goodness woman, are you<br />\ntrying to make me another Norm Crosby?\" which only<br />\nelicited more laughter.<br />\nStan had been nibbling on Isabel's ear for the last half<br />\nhour while Mary Lou and I boogied on the dance floor.<br />\nWe hardly ,got within two feet of each other and our eyes<br />\nconcentrated' roo much on each other's movements to<br />\nhave any meaningful contact. And after we danced, we<br />\ndrank and the hours flew by without our t noticing and<br />\nthe 'band. was playing \"Rikki, Don't I Lose That<br />\n'Number' for the fifth time when Stan and Isabel briefly<br />\ninterrupted their ear-nibbling and suggested we move on.<br />\nIt was quarter to three and neither of us really cared, the<br />\nCold Duck had taken control, and Mary and I were busy<br />\nexchanging life histories. \"Ah but I was born with a cleft<br />\npalate and a harelip. Top that!\"<br />\ni\"My sister died of leukemia,' she replied. It was the<br />\nonly serious moment of the night and somebody turned<br />\noff the lights, a situation 4 j. took advantage of by<br />\nsnuggling .up and giving her a kiss slightly more \"mature\"<br />\nthan the one in the car. The lights came back on, and the<br />\nprom was'oyer, and I felt as if nothing had happened, as if<br />\nthe Prom was just a big fake, a dreadful hallucination. I<br />\ndidn't feel any differently, and I was sober enough to<br />\nrealize all the trauma had gone for naught.<br />\nThe coup d' grace. Once back in the car, Stan slipped<br />\nthe secret weapon out of his pocket, a big fat joint<br />\nwrapped in pink paper. \"How you young ladies like to<br />\nget a case of reefer madness?\" he gurgled.<br />\nThey were too far gone to offer any idealistic resistance<br />\nso the joint, like country doctor, made its rounds.<br />\n\"Stan,\" I shouted. \"You just went through a stop sign.<br />\nYou want us get thrown in the klinker? Don't you know<br />\nwhat stopitneans?\"<br />\n\"Squeal tires on .'ilavement?\" and bellowed with that<br />\ninsidious laughter. I grabbed t .joint my Mary Lou who<br />\nhad been fondling it for . thd past five minutes and<br />\nimmediately burned my firer. The joint fell to the floor,<br />\nand out of anger, my foot fell on the joint, and that was<br />\nthat. We were now headed east on Route 22, an asphalt strip<br />\nof decadent commercialism which lead to the small<br />\n_scatter point graph of lights in the distance of New York<br />\n\"Where are we going?\" Mary Lou<br />\n\"Did you know that Mery Griffin sang What a Lovely<br />\nHunch ot Cocoanuts' when he Was with Freddy Martin in<br />\n1949?\" I replied, my mind on other than the obvious.<br />\n',You're so kooky,\" she sighed, and rested her head on<br />\nmy shoulder.<br />\n.\"Kooky, kooky, lend me your comb,\" I ditted and<br />\ngently stroked her hair. We were almost to Springfield<br />\nwhere the highway splits and. Stan was speeding along,<br />\nIsabel's'hand in his lap.<br />\nI'll reme ber this night for ever,' Mary Lou<br />\npurred, °it's been so much like heaven on Earth .1 could<br />\nalmost cry.\"<br />\nLittle, did she suspect that in just a few moments she<br />\nwould plead with Stan to stop the car in the parking lot<br />\nof the 'famous flagship) so she 'could lurch to a light pole<br />\nand puke all. the food'and drink she'd had for the past<br />\nthree months. , It, was not a 'particularly pretty sight;<br />\nseeitig her dress shudder with every retch made my own<br />\nstomach grumble.<br />\n\"1 think we better bag the trip to the shore,\" I told<br />\nOtan.\"You want some Maalox, Mary Lou?\"<br /><br />\n\"Well, Somerville's not French Lick, Indiana,<br />\nwhispered to her. We were sitting in her back yard on<br />\nsome rusty lawn furniture watching the sun rise.<br />\n\"Mike, sometimes I don't understand anything you<br />\nsay,\" she smiled weakly, c`but that's why I like you so<br />\nmuch.\"<br />\n\"Visions of oranges and peignoirs, my dear,\" I replied,<br />\n\" that's what I see in you.\" My eyes lingered to the East<br />\nwhere the sun was now rising through the lowest<br />\n*branches of the catalpa tree, and all th fantasies of<br />\nMary Lou and me on the beach at Lavalette, i* ntertwined<br />\nan the sand, and lett* the first lavender sweeps of<br />\nsunl4ght brush over us. entered my mind. The mammoth<br />\nscale Of my self-delusionment suddenly became obvious<br />\nand a shr ud of sleepiness suddenly came over me.<br />\n\"I really must go,\" I said and bent over to kiss her.<br />\n\"Prase don't\" she pulled away, \"there's still vomit<br />\non my lips.\"<br />\nI remember 'little: of the walk home. Isabel and Stan<br />\nhad driven off to their lovenest and I was left alone to<br />\ncontemplate my fate. What was to come of me?<br />\nI slipped between the sheets and made ready f4r my<br />\nexcursion into the land of the Sandman.,I heard the first<br />\nrumblings of morning; my mother shufftngabout in her<br />\nsmile slippers and putting the bacon to fry; my father<br />\nclearing his sinuses and his urine cascading into the toilet<br />\njust the other side of the hall.<br />\nI had returned to Earth, Amen.<br /><br />\npage 10/news-letter/may 3, 1977<br /><br />\nFREE<br /><br />\nNEWS-LETTER<br /><br />\nMa' 7 Hidden Fortress<br />\n!vlat.) 2! Emperor Jones<br />\nMatj,?.8 Lavender Hill. Mob<br />\nJune 4 Stagecoach<br />\nJunell Gansho, The Batli-Pf<br />\nJune 15 Pygmalion<br />\njune 25- Autumn Afiernoon<br />\nJuly 9 Red beard<br />\nJu1y15 FRIDAY H h and Low<br />\nJulyI6 Magni ficen+ Amber3ori5<br />\nJuly E3 The Lady Variiiies<br />\nJu1930 Nor+h bi Nor-ihwe -1Aug 6 Gospel According -to St frinfthew<br />\nAug 13 City L.1010-:<br />\n;<br />\n- / Modern Mites<br />\nAckg E0 Brief Encounter<br />\nAug 27 Threepenny Opera<br /><br />\n9:30<br />\nSATURDAY<br /><br />\nELECTIONS<br />\nTuEsdAy, MAy 3<br />\n5:30 P.M.<br />\nIN ThE GATEhOUSE<br />\nALL NEWS-LETTER STAFFERS<br />\nMUST ATTEND<br /><br />\nCOME ANd<br /><br />\nVOTE<br /><br />\nbETTER<br /><br />\nFOR A<br />\nNEWS-LETTER.<br /><br />\nC<br /><br />\n\"DON'T BE<br />\nIND\"<br /><br />\nAnnouncing the<br />\nColeman Award<br />\nRecipients:<br />\nThe Coleman Awards are presented<br />\nannually to the individuals who submit<br />\nthe best pieces of prose or verse to the<br />\nHopkins literary journal,ELLIPSIS (fors<br />\n-merly Collection of Words).The purpose<br />\nof the awards is to recognize the<br />\nachie'vements of the University's finest<br />\nwriter.\".<br /><br />\nPROSE AWARD<br /><br />\nFrederick Barthelme<br />\nMoira Crone<br /><br />\nACADEMIC INTEGRITY<br /><br />\nIS YOUR RESPONSIBILITY<br /><br />\nPOETRY AWARD<br /><br />\nIf you have any questions or complaints, please contact<br />\nthe Undergraduate Academic Ethics Board At:<br /><br />\nScott Wright<br /><br />\n-Box 1280,Gilman Hall<br />\n•The Student Council Office<br />\n• The Dean Of Academics<br />\nAML<br /><br />\nmay 3, 1977/news-letter/page 11<br /><br />\nATTENTiON CLASS Of '78<br /><br />\nThe Office of the Chaplain<br />\nand<br /><br />\nThe Baltimore Hebrew College<br /><br />\nFOR ChAiRpERSON(S)<br />\nof ThE SENIOR CLASS FILM<br />\nSERIES will bE FRiday, MAy 6.<br />\nSELECTIONS<br /><br />\npresent<br /><br />\nViewing time is<br />\napproximately 4/<br />\n1<br />\n2 hours<br /><br />\nFOR GRADUATION<br />\nCOMMITTEE will bE MoNdAy,<br />\nMAy.9.<br /><br />\nSELECTIONS<br /><br />\nProduced and))irected by Marcel Ophuls<br />\nA Hamilton Fish/Max Palcvsky Production A Paramount ntlease<br />\nPIi n 1111.<br />\n..<br />\n•<br /><br />\n.•<br /><br />\nSunday May 8<br />\n11.00 a.m.<br />\nShriver Hall Auditorium<br />\nJohns Hopkins University<br /><br />\nINTERVIEW SigN-Up ShEETS ON STUdENT<br /><br />\nCharles &amp; 34th Street<br />\nCOUNCit dOOR - OR - CONTACT<br /><br />\nAdmission is FREE<br />\nBET11<br />\n889-0942<br />\nBox 190<br />\nMARy<br /><br />\nThere will be a 45 minute intermission for lunch.<br />\nA catered Kosher lunch will be arailable.<br />\nReserrations can he made by calling 338-8187<br /><br />\n•<br /><br />\nThe Student Council<br />\nSelections Committee<br />\nwill hold selections for<br />\nfour C.U.S. members<br />\nfor 1977-1978<br />\nThe C.U.S. (Committee on<br />\nUndergraduate Studies) is a<br />\npolicy-making committee<br />\nconsisting of five faculty<br />\n,members &amp; four students.<br />\nSign up for interviews 6:30 p.m.<br />\nin the Student Council Office<br /><br />\nTues., May 3,1977 If you have<br />\nquestions ,please contact Steve<br />\nLovejoy 523-2461or Patrice<br />\nGallagher 366-4234<br /><br />\nfRom ThE diREcToR of NASHVILLE Awl M*A**H<br /><br />\nPAUL NEWMAN<br /><br />\nProduced and Directed by<br /><br />\nROBERT ALTMAN<br /><br />\nFRI MAY 6 SHRIVER HALL<br /><br />\nSAT MAY 7 MERG.. 111<br /><br />\n730 &amp; 10:00<br /><br />\nAdmissio. 51.00<br /><br />\npRESENTEd<br /><br />\nby<br /><br />\nThE STUdENT<br /><br />\nCOUNCit Film<br /><br />\nSERiES<br /><br />\npage 12/news-letter/may 3, 1977<br />\n\\ FOR CENTURIES THEY WERE HUNTED<br />\nFOR BOUNTY,FUN AND FOOD...<br /><br />\n\"The Sumcias Experience\"<br />\nThe Office of the Chaplain<br />\nand<br />\nHebrew College<br />\nBaltimore<br />\nThe<br /><br />\nN-L<br /><br />\npresent<br /><br />\noutakes<br />\nSpare Time?<br />\nThough spending an average of<br />\nfourteen hours a day at the<br />\nstation, George Lewis still, has<br />\nenough \"spare time\" to teach a<br />\ncourse on motivation and<br />\ngoal-setting at the Maryland<br />\nInstitute of Broadcasting. Lewis<br />\nbelieves that only 4% of the<br />\npeople do all the work, while the<br />\nother 96% merely exist. He<br />\nbelieves this is caused by the<br />\nAmerican educational system<br />\nthat teaches \"what can't be done,<br />\ninstead of what can be done!\"<br />\n\"Listen\", he said, \"there isn't<br />\nanything you can't do in this<br />\nworld if you really want to do<br />\nit.\"<br />\nFuture Plans<br />\nAs production director,<br />\nGeorge Lewis was proud to<br />\nannounce Channel 45's recent<br />\nacquisition of the Warner<br />\nBrothers cartoon package,<br />\nincluding Bugs Bunny, Daffy<br />\nDuck, Foghorn Leghorn, and<br />\nRoadrunner, which will usher in<br />\nthe new academic year next<br />\nSeptember. Also in the coming<br />\nmonths will be the return of \"I<br />\nlove Lucy\" and the Ingmar'<br />\nBergman film festival on Monday<br />\nnight.<br />\nOn April 7, Captain<br />\nChesapeake will appear on the<br />\nungodly stage of a roller derby<br />\n(\"You see,\"he says with a smile,<br />\n\" my appeal is wider than you<br />\nthink.\") merely to attract<br />\ncustomers. To promote this,<br />\nCaptain C. is having a contest<br />\nwith ten pairs of championship<br />\nroller derby skates as prizes. The<br />\naddress is: Roller Skates,<br />\nWBFF-TV, Baltimore, Maryland,<br />\n21211. Please include your name,<br />\nhome address, and, most<br />\nappropriately, your age.<br /><br />\n• Viewing time is<br />\napproximately 4% hours<br />\nProduced and Directed by Marcel()Owls<br />\nA .4.11ton Fle17.9.4.PaliNdry Production A Parami.ni<br /><br />\n11:00 a.m.<br />\nSunday May 8<br />\nShriver Hall Auditorium<br />\nJohns Hopkins University<br /><br />\nEDWARD L. MONTORO Presents a WILLIAM GAOLER Film DAY Of THE ANIMALS Starring CHRISTOPHER GEORGE<br />\nLESLIE NIELSEN •LYNDA DAY GEORGE • RICHARD JAECKEL • MICHAEL ANSARA land RUTH ROMAN as SHIRLEY I<br />\nMusc A10 SCHIFRIN•Written byWILLIAM NORTON&amp; ELEANOR E NORTON. Directed byWILLIAM GIRDLER<br />\nProduced by EDWARD1 MONTORO .0 HIM VENTURES INTERNATIONAL RELEASE<br />\nNew a terrifying paperback trorn BAL t ANT INE BOOKS 01977, EVI, INC.<br />\nilmed in TODD AO 35•COLOR BY DELUXE LP_IttoRT,i7111<br /><br />\nCharles &amp; 34th Street<br /><br />\nAdmission is FREE<br />\nThere will be a 45 minute intermission for lunch.<br />\nA catered Kosher lunch will be available.<br />\nReservations can be made by calling 338-8187<br /><br />\nOPENING MAY 25th<br />\nat a theatre or drive-in near you. ..kikv.a<br />\nLook for this ad in your local newspaper for theatre and time.<br /><br />\nMONUMENTAL!<br /><br />\nThe<br />\nchallenge.<br />\neach<br />\nYour challenge is to enter numbers in the empty boxes below so that<br />\nvertical column and horizontal row will add up to 100.<br /><br />\nlast<br />\nMarch<br />\nclassitieds<br />\nTYPING - Beautiful Work.<br />\nSpecialty: Medical<br />\nTerminology. Call<br />\n-Thursday; 486-8337<br />\nFEMALE ROOMMAT<br />\nWANTED. Quiet townhouse<br />\nnear Hopkins. Call 532-9159<br />\nor 358-3710.<br />\nSPANISH by experienced nativ<br />\nteachers - All levels, all ages.<br />\n366-2056.<br />\nTwo students want to take care of,<br />\nvacationer's home during the<br />\nsummer months Call:366-5286.<br />\n,. Quality<br />\n1<br /><br />\nTyping 4674)342. .<br /><br />\nI<br /><br />\n.4<br />\nAPARTMENT TO SUMMER<br />\nSUBLET. ONE BLOCK FROM<br />\nHOMEWOOD. FEMALE<br />\nPREFERRED. 462-1057.<br />\nProfessorial couple requires fully<br />\nfurnished apartment Of house for<br />\nacademic year 1977-78, September<br />\n1 through June 1. Two bedrooms<br />\nplus study ideal, near Homewood<br />\ncampus. Prefer no more than<br />\n350-400 rent. Call Katherine<br />\nVerdery at 366-5055 or 338-7267.<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\n• The Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nELECTRICAL TRAINEE - Part<br />\ntime 828-8081.<br /><br />\nPABST. Since 1844.The quality has always come through.<br /><br />\nGRADUATING SENI0RS1<br />\nWANTED!FOR SALES IN SOLAR<br />\nENERGY AND INSULATION<br />\nPRODUCTs. CALL FOR DETAILS301-484-6885. MR. DAVID.<br /><br />\nWis Peoria Heights III<br />\nC191/ PABST BREWING COMPANY Milwaukee<br /><br />\n61/1 It 6Z OZ • CZ OZ<br /><br />\nNewark NJ Los Angeles Calif Pabst Georgia<br /><br />\nEt OE • IC SZ 1Z VI 6• CI 8L /Z 1/9I • CI 01<br /><br />\nez 1/<br /><br />\n;riv grollog oi do! wog SM,11 IPIU0711,44 31011.10.6<br /><br />\nmay 3, 1977/news-letter/page 13<br /><br />\nBILL'S<br />\nUniversity Sandwich<br />\nShoppe and 1 Deli<br /><br />\nUNIVERSITY OF PARISSORBONNE<br />\nSUNYJNEW PALTZ PROGRAM<br />\n7th YEAR<br /><br />\nUndergraduates in philosophy and<br />\nrelated majors earn 30-32 credits in<br />\nregulsr Sorbonne (Paris IV) courses.<br />\nSUNY-Paris IV agreement insures<br />\nstudents avoid cumbersome<br />\nPre-inscription and attend Paris IV,<br />\nnot provincial universities. Director<br />\nassists with housing, programs,<br />\nstudies. Orientation, language<br />\nreview. Sept. 15-.1.upe 15. Estimated<br />\nrAirnees;tu<br />\n$.<br />\n1 49%<br />\nrof<br />\nP. Charlson, Philosophy<br />\nDept,<br />\nS.U.C. New Paltz, New York 12561.<br />\n(914) 257-2696.<br /><br />\nEducated Beer<br />\nTastes Prefer<br /><br />\nBEES<br />\nIMPORTED BEER<br />\nimp<br />\n••••1<br />\n••<br /><br />\n•<br /><br />\n0<br /><br />\nAn epicfantasy of peace and magic.<br /><br />\nRESTAURANT AND CARRY OUT<br />\nAll Lump Crab Cakes<br />\nGenuine Kosher Corned Beef<br />\nDelicious Roast Beef<br /><br />\nUNIVERSITY PARKWAY<br />\nAT ST. PAUL<br />\nBaked Virginia Ham<br />\nLobby, University One Apts. Various<br />\nCold Cuts<br />\nPhone: 467-6262<br />\nCheese(Swiss, Pro vologne, Muenster)<br />\nMon-Fri: 9:30-7:00<br />\nKosher Hot Dogs<br />\niSat:9:30-2:00<br />\nCatering<br />\n,Closed Sundays<br />\nFREE SODA WITH<br />\nTHIS AD AND<br />\n•<br />\nPURCHASE OF $1<br /><br />\n:OTH CENTURY.FOX PRESENTS<br /><br />\nA RALPH BAKSHI FILM<br /><br />\nParty Trays(Special Orders)<br />\nPizza<br /><br />\nHome Made Dessert(Cheese Cake)<br />\nIce Cream<br />\nSelect Grocery Items<br /><br />\nIPGIputEm.<br />\n,......„....,mom<br />\n. ,•. . =MVO<br />\n., . . 42,,;<br />\nft ,111.64.<br /><br />\n1<br /><br />\nWIZARDS<br /><br />\ncol,\"bi I h• 1 \",,' • c 19'7 Tyrent.eth Century Foy<br /><br />\nNOW SHOWING<br />\nHARFORD MALL CINEMA<br />\nHorford Moll Shp. Ctr, Bel Al<br />\n838-6688<br /><br />\nqtraurArsurArerArArarAndrourAndrArAmarArArAndr•Pur•rarArArArAvarAr<br /><br />\nI<br /><br />\n/44.1.<br />\n.•<br /><br />\nCINEMA HARUNDALE<br />\nHorundole Moll Shp. Or.<br />\nSO. 1-6055<br /><br />\nNORTHPOINT PLAZA<br /><br />\nIlltwy. Ext. 40 Northpoint Nr. Merritt<br />\n288-9294<br /><br />\nAraurAnffArAwarArArAnsurirAriraranimmorati<br /><br />\n• *<br />\nS,9•P 84'<br />\nirk<br /><br />\nBECK,BEER<br />\n\\141 1M)<br />\n•eiv<br /><br />\nBrewed in West<br />\nGermany for<br />\n800 semesters!<br /><br />\nEnjoyed in<br />\n140 Countries!<br />\nGraduate to Beck's!<br /><br />\nBeer Mug Offer!<br />\nhe.v Acck.,<br />\nliver<br /><br />\nMow. 41 %cry special<br />\nlow price where •()L, buy<br />\nlie(k': Beer.<br /><br />\nImported Is% Dribeck, L.I., N.V.<br />\nITT \\Id.<br />\nF.P. \\‘'inner<br /><br />\nNAT'L MEDI AL BDS.<br />\nFLEX • ECFMG • DAT<br /><br />\nMCAT<br /><br />\nwith confidence<br />\noirigiriai study materials<br />\nsmall groups • tape center<br />\nsummer &amp; compact courses<br />\nCALL<br />\n(202)<br />\n244-3010<br />\nEDUCATIONAL CENTER<br />\n4201 Connecticut Avenue, N.W<br />\nWasnington, D.C. 20008<br /><br />\nMTN<br />\nCOMM&amp;<br />\nABORTION<br />\nSENO.<br />\nHILLCAEST cutaca<br /><br />\nL<br /><br />\nMOKS<br />\nI ERvicE<br />\nPm)7•4410<br /><br />\n.111111111111111 Mao 110101 MIMI MOO asp<br /><br />\nkiSINESS<br /><br />\nOPPOP1<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\n310 Franklin Street<br />\nBoston,Mass.02110<br /><br />\nPut your expensive eye<br />\nbehind our inexpensive System 35...and WOW<br />\nJust about any of the great photographs you see<br />\ncould. have been taken with Vivitar System 35.<br />\nPlus one good eye. Vivitar System 35-is a most<br />\ninexpensive way to get serious about photography<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1/1000 to 1 second plus \"B\" for time exposure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/Built-in hot shoe/Self tirrier/<br />\nFilm-in-chamber indicator/ASA Range<br />\n5-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br /><br />\n©Ponder &amp; Best. Inc , 1977<br /><br />\n9,volt alkaline tat!ery. Vivitar Automatic<br />\n135mm f2.8 lens Soper foca! length „<br />\nfor portraits/ Aboui 2'2 tirn'esiajger than<br />\nnormal image Vivitar 2X Tale Converter<br />\nDoubles the effective focal iendth of<br />\nlenses/Converts the 50mm ierts. to 100mm.\"<br />\nthe 135mm lens to 270m,Viviiar Ent-kir°<br />\nCase Carries thr,.: entire :ystem comfortably and securely while hiklng cycling.<br />\nskiing. etc Find the nearest Vivitar dealer ana<br />\nask for a demonstration.<br />\nr<br /><br />\nMarketed :n the U S A bi Ponder &amp; Best. Inc<br />\nCorporate Offices 1630 Stewart Street, Santa Monica,<br />\nCA 90406 !n Canada VIvitar Canada Ltd./Ltee<br /><br />\nVivitar. System 35<br /><br />\n41,4111CdrigilKdrallgetalralr/IIK/FAIKIMIKAKIrillgiVAIIIIPArAdr<br /><br />\nidgdgetdrAPIREPUICArdgdrArdlEir/r/ItilKIIIIIIIIIKIIIIIIIIndrIlr<br />\nigdP21,441KIP'<br /><br />\npage 14/news-letter/way 3, 1977<br /><br />\nBaseballers gain<br />\nNCAA playoff berth<br />\nBy AL DANIELS<br />\nThe 76-77 baseball season was good sometimes and<br />\ngreat most of the time. In tjie early spring, the Blue Jays<br />\nshared their limited facilities with the Orioles, with the<br />\nhighlight being Jim Palmer pitching batting practice — a<br />\ntask he doesn't perform for his own team. The Jays have<br />\ndisplayed prowess at the plate, but despite that have been<br />\ninconsistent in the field. When they play errorless ball<br />\nthey have been worthy of their national ranking and have<br />\nbeen invincible.<br />\nLast Saturday, though, the team's limitations came to<br />\nthe forefront as a giant-killing Swarthmore team helped<br />\nthe Jays ease into a co-championship with the Widener<br />\n'Millionaires' in the MAC Southeastern division.<br />\nThe action really began Friday when the ball team<br />\ntraveled to Franklin &amp; Marshall to meet the champs of the<br />\nWestern division of their bracket of the MAC in what<br />\nshould have been a preview of the playoffs. The clawing<br />\nBlue Jays wok an easy game from a solid opponent<br />\nleading most of the game by three or four runs.<br />\nThe final tally was 6-4 with the batting hero senior Bob<br />\nBabb who stroked a home run out of the Lancaster, Pa.<br />\nstadium on the second pitch of the hame. Also<br />\ncontributing were Rick Law, whose offense of late has<br />\nbeen impressive, and Frank Parreira, who is climbing<br />\ntowards the .400 mark in hitting.<br />\nJason Sussman's strongest pitching of the year baffled<br />\nF&amp;M until he tired after seven and gave way to relievers<br />\nBurns and Parreira who picked up the save. The team's<br />\ndefense was excellept throughout the contest.<br />\nSaturday, the Jays split a doubleheader with the<br />\nSwarthmore Garnet. Hopkins should have handled the<br />\nvisitors with relative ease, especially , after their<br />\ndestruction of athletic powerhouse F&amp;M.<br />\nThe game began as it should have ended. After two of<br />\nthe first three men to face the Garnet hurler walked,<br />\ntimely clean-up hitter Dave Lewing cracked a double<br />\ngiving the home Jays a 2-0 lead.<br />\nBur 'OK pitching' from the visitors' best man, seven<br />\nwhopping err ors by our defense, and a partisan<br /><br />\nSwarthmore crowd on Hopkins' own field combiOd to<br />\ngive the visitors an inspired 8-5 first game victory<br />\nOn the mound for JH, Mike Santo pitched valiantly but<br />\nhis sore shoulder prevented him from completing the<br />\ngame. Mike's exit paved the way for a Swarthmore revival<br />\nand 4 run outburst in the 6th of seven innings. Hopkins<br />\ncountered with three in their half of the inning but the<br />\nrally fell short with a man stranded on third base.<br />\nThe Blue Jays did a turnabout in the second game as<br />\nthe ace ot the staff Steffan Burns pitched a no-hitter<br />\nthrough the first out of the last inning. The final score<br />\nwas 5-2 with the bat of Brad Rosborough knocking in the<br />\nwinning runs. Rosborough has consistently gone out and<br />\npummeled the other team each game he has played this<br />\nyear.<br />\nThe final tote for the regular season finds the Jays as<br />\nimpressive as last year's excellent team. Junior co-captain<br /><br />\nDave Emala has established himself as one of the finest<br />\nhitters in the country at any level. Senior co-captain Bob<br />\nBabb who has played outstanding defensively also leads<br />\nthe team in numerous offensive departments.<br />\nOutfield leader Dave Lewing and undefeated pitchers<br />\nSteffan Burns and Jason Sussman are the only other<br />\nreturning veterans from last year's team who will be back<br />\nnext year as only two seniors are departing.<br />\nAlso returning will be outstanding forst year men<br />\nFrank Parreira, Mike Santo, Brad Rosborough and at least<br />\nfour other starters. This group unlike the Widener-styee<br />\nrecruits are going to school while they win ballgames.<br />\nThe 15-6 Blue Jays will face off with Widener this<br />\nweekend in a play-off for the right to play Franklin &amp;<br />\nMarshall, with the winner of the F&amp;M game representing<br />\nthe Southern Division of the MAC in the NCAAplayoffs.<br /><br />\nCoekey trackers perform consistently well<br />\nDespite a 5-6 Fecord so far this spring, the Blue Jay<br />\ntrack learni has performed consistently well and has<br />\nestablished several new university' records.<br />\nThese new Hopkins standards include Jim Kennedy's<br />\n14:15.6 in the three-mile run and Bob Freamon's 4:19.3<br />\nin the one-mile race. Not only do these times represent<br />\nnew school records, but they are also the top<br />\nperformances this year in the MAC.<br />\nHowever, an overall lack of team depth has been deadly<br />\nfor the JHU thinclads. Success in track competition is<br />\ndifficUlty with'a small squad and the Jays' meet record<br />\nseems to bear this contention out.<br />\nOn April 12, the Blue Jays travelled to Lebanon Valley<br />\nCollege to participate in a three-way meet between<br />\nthemselves, their hosts and Washington College. When the<br />\ndust had finally cleared, Lebanon Valley had amassed<br />\n102.5 points, JHU had garnered 58 points and<br /><br />\nWashington had come across with only 20.5 points.<br />\nThe strength of the Hopkins effort was concentrated in<br />\nthe running events. Speedster Matt McLin, a freshman<br />\nfrom Hanover, Pal, showed the way in the sprint events.<br />\nplacing second in both the 110- and 220- yard dashes.<br />\nThe Jays literally ran away from the rest of the field in<br />\nthe distance run events. In the 880, Bob Alworth topped<br />\nthe field, while Tom Kepple and Bob Safier finished<br />\nfourth and fifth respectively. The one-mile run saw a JHU<br />\nsweep of the top three spots, with Freamon, Kennedy and<br />\nTim Whitcombe coming across the finish line in that<br />\norder. The ending of the three-mile also looked lixe a<br />\nmass gathering of Blue Jays, with Kennedy, Freamon and<br />\nWhitcombe finishing one, two, four.<br />\nOn April 16, the team travelled to Haverford for a meet<br />\nthat Head Coach Randy Cockey later called \"the low<br />\npoint of the season.\" The Jays were missing several key<br /><br />\nperformers and ended up losing to their hosts, 77-68,<br />\nwhen Haverford captured the final event (the mile relay)<br />\nby less than one second!<br />\nSenior-. Brett Miles and sprinter McLin led the Jay<br />\neffort at Haverford, as each mani captured first place<br />\nhonors in a pair of events. Miles was the top man in both<br />\nthe long jump and the triple jump, while Matt won the<br />\n110.: and 220- yard dashes.<br />\n\"The loss of those men really hurt us,\" Cockey<br />\ncommented.\"The team that was there pulled very hard to<br />\novercome our deficiencies, but we couldn't quite do it.\"<br />\nOn May 19, the team travelled up the road to Towson<br />\nState for a series of dual' meets—one against Towson and<br />\none versus UMBC. Both of these opponents have excellent<br />\ntrack programs, so despite two losses (84-60 to Towson<br />\nand 87-55 to UMBC), Coach Cockey was extremely<br />\npleased with the squad's performance.<br />\n\"It was a fantastic team effort,\" the Coach noted,<br />\n\"especially from the distance men.\"<br />\nHe was referring specifically to Kennedy and Freamon,<br />\nboth of whom excelled in this competition.<br />\nFreamon established his record in this meet, while<br />\nKennedy took the 3-mile event in 14:15.1, a school<br />\nrecord at the time.<br />\nThat record lasted exactly four days, as Jim shattered<br />\nthat mark with his effort at a three-way meet against<br />\nDickinson and Ursinus on April 23. Kannedy took the<br />\n3-mile event in an incredible 15:15.6, tying the Dickinscji<br />\ntrack record and qualifying him for the national<br />\nchampionships later this month.<br />\nKennedy's effort, 'combine&amp; with double victories<br />\nfrom McLin (\"the fastest sprinter at JHU in the last three,<br />\nyears\" according to Cockey) and Freamon enabled the<br />\nJays to ctitim a pair of victories on this day.<br />\nOn April 26, Hopkins hosted a three-way meet that<br />\nincluded Western Maryland and Loyola. Despite a pair of<br />\nwins from Freamon and an impressive effort from the<br />\nrelay teams;, the best that the Jays could do was to finish<br />\nin the middle, ahead of Loyola but trailing W. M.<br /><br />\nIn the unfortunate 12-11 loss to Cornell earlier this<br />\nseason, the Blue Jay stickmen seemed to lose their<br />\ncomposure after allowing a large lead to shrink away. At<br />\nWest Point on Saturday, the Jays showed that they have<br />\nlearned from their mistake.<br />\nBattling an inspired, 11th ranked Army squad on their<br />\nhome turf, Hopkins was forced to stage a fourth-quarter<br />\nrally to defeat the Cadets, 13-8, thus running the JHU<br />\nseason mark to 7-1 and enabling the Jays to hold onto<br />\ntheir third-place ranking in the coaches' poll.<br />\nThe Jays had opened the second half with a 5-1<br />\nadvantage and seemed set to roll over their adversaries.<br />\nHowever, Army came roaring on in the third quarter,<br />\noutscoring the Jays 5-2 in that session and trailing by only<br />\na single goal as the teams entered the final fifteen minutes<br />\nof play.<br />\nThe Cadet comeback was led by the phenomenal<br />\ngoaltending of Jose Olivero. While his teammates were<br />\npumping five goals into the Blue Jay net, Olivero was a<br />\nveritable fortress on defense. In the third period alone,<br />\nthe junior netminder made twelve saves as JHU<br />\ncould<br />\nconnect on only 2 of 22 shots.<br />\nHopkins scored in the first minutes of the<br />\nfourth<br />\nquarter to take an 8-6 lead, but Army kept comin<br />\ng. The<br />\nhome team tallied twice in succession to forge<br />\nan 8-8<br />\ndeadlock with less than ten minutes remaining<br />\nin the<br />\ncontest.<br /><br />\nAt this juncture of the game, Army Coach<br />\nDick Edell<br />\ncalled a time - out, a move that puzzled Jay<br />\nCoach Henry<br />\nCiccarone.<br />\n\"It (calling a time-out) surprised me,\"<br />\nthe JHU mentor<br />\nsaid. \"They had the momentum then—<br />\nI was about to call<br />\na time-out, but he beat me to it.\"<br />\nCiccarone explained that the time-out<br />\nenabled his team<br />\nto regroup. Evidently this regrouping was<br />\nquite successful,<br />\nfor the Jays went back onto the<br />\nfield and totally<br />\ndominated play in the game's final minut<br />\nes, outscoring<br />\nthe Cadets 5-0.<br />\nJoe Garavente broke the tie two minutes<br />\nlater, taking a<br />\nfeed from Mike O'Neill and whipping<br />\nthe ball past<br />\nOlivero. That score was quickly followed<br />\nby goals from<br />\nDave Huntley and Bob Maimone, giving JHU an<br />\n11-8 lead<br />\nwith six minutes to play and sealing the victory.<br />\nAfter the game, Ciccarone revealed that the<br />\ngame,<br />\nstatistically speaking, had gone pretty much as<br />\nhe had<br />\nexpected. \"I figured that if we shot 65 times, we<br />\nwould<br />\nscore 15-18 goals,\" the Coach noted. \"I<br />\nalso was<br />\nconfident that our defense could hold them to under<br />\nten<br />\ngoals.\" Chic attribured his team's lower score (despi<br />\nte 73<br />\nshots) to Oliver's efforts, pointing out that the<br />\nArmy<br />\nnetminder \"made saves that kept us from blowi<br />\nng it<br />\nopen.\"<br />\nO'Neill, Huntley and Rich Hirsch were the leader<br />\ns on<br />\noffense for Hopkins as each player was credited<br />\nwith four<br /><br />\npoints. O'Neill had a goal and three assists<br />\nwhile Huntley<br />\ncontinued his year-long shooting spree with<br />\nfour goals.<br />\nThe continued fine effort from Hirsch (the<br />\nsenior<br />\nattackman had five points a week ago) is an<br />\nexcellent sign<br />\nas the team readies for its toughest month of<br />\nthe season.<br />\nThe Long Island native and four-year starter did<br />\nnot play<br />\nwell through the first part of the season and<br />\nhis return to<br />\nform could remove some of the burden<br />\nfrom his<br />\nteammates on attack. •<br />\nIn this next two weeks, the Jays will face the<br />\nnumber<br />\nfour and the number two team in<br />\nthe country,<br />\nrespectively. This Saturday, JHU entertains Navy<br />\nwhile on<br />\nMay 14, Hopkins travels to College Park<br />\nto face the<br />\nUniversity of Maryland.<br />\nThe top eight teams in the country will then<br />\nparticipate<br />\nin the NCAA play-offs to determine<br />\nthe national<br />\nchampion. Round I is scheduled to be<br />\nplayed on<br />\nWednesday May 17, while Round 2 is to be<br />\nheld on<br />\nSaturday May 21. The two survivors will meet on<br />\nMay 28<br />\nat Charlottesville, Virginia for the Division<br />\nI national<br />\nchampionship.<br />\nAlthough the final is played at a pre-determin<br />\ned site,<br />\nthe first two rounds are contested at the home field<br />\nof the<br />\nhigher ranked of the two teams, and therefore Ciccar<br />\none<br />\ncalls both the Navy and Maryland games \"crucial\".<br />\n\"We need to win them both to make our own<br />\ndestiny<br />\nin the play-offs,\" Ciccarone concluded.<br /><br />\nBaby Jays rack up fourth straight victory<br />\nWith victories in its last four games, the Blue<br />\nJays<br />\nmen's Junior Varsity Lacrosse teem has moved its<br />\nrecord<br />\nto 5-3, marking the first time the team has been above<br />\nthe<br />\n.500 level all season.<br />\nThe Junior Jays are coached by Bert Mandelbaum<br />\n,a<br />\nPhD student at the Med School. Mandelbaum, a<br />\ngraduate<br />\nof Cortland State in New York, is assisted by a pair<br />\nof<br />\nformer JHU stickmen, Bill McCutcheon and Don<br />\nZimmerman.<br />\nThe Jays opened their season on the wrong foot,'<br />\ndropping their March 22nd contest to Wroexter, 14-9.<br />\nA<br />\ndry spell in the second quarter, during which<br />\nthe<br />\nopposition outscored JHU 4-0, sealed the openi<br />\nng game<br />\nsetback.<br />\nHopkins.trailed by a count of 2-1 after one quarter,<br />\nbut<br />\nthe Wroester second period rush produced a 6-1<br />\nhalftime<br />\nbulge and the Jays could never cut into that margin. P.J.<br /><br />\nBoyle led JHU in scoring with two goals and two assists,<br />\nThe Jays decided not to wait until the fourth quarter<br />\nwhile Millard Tydings, Jim Bidne and Marty Wolf each<br />\nto assert their superiority over Essex Community College<br />\nhad three points apiece.<br />\non April 15th. Hopkins scored six times in the opening<br />\nThe Jays recorded their first win of the campaign in<br />\nperiod while shutting out the opposition en route to a<br />\ntheir next outing as they swamped Catonsville<br />\n14-7 win.<br />\nCommunity College, 15-6. Hopkins opened • this game<br />\nThe Jays reached the .500 level on May 19 with a 10-8<br />\nwith a rush, grabbing a 4-1 lead in the opening quarte<br />\nr<br />\nvictory over their counterparts from Towson<br />\nand never looked back.<br />\nState. A<br />\nstrong second quarter saw JHU outscore Towson 4-0<br />\nWolf took scoring honors for this game. The freshman<br />\nand<br />\npaved the way for victory.<br />\nfrom Baltimore fired home a pair of goals and assisted on<br />\nThe Baby Jays ran their current win streak to three<br />\nthree others, thus amassing five points.<br />\nas<br />\nthey rallied to defeat Anne Arundel Community<br />\nLong Island power Suffolk Community Colleg<br />\nCollege<br />\ne<br />\n14-11 on April on the loser's home field. Anne Arunde<br />\nprovided the opposition on April 7th. However,<br />\nl<br />\nthe<br />\nhas<br />\nthe top junior college team in the area, so this<br />\nvisitors from New York proved to be too powerful<br />\nas they<br />\nrepresented an important victory.<br />\ndowned JHU, 12-9.<br />\nGeoi-getown University was the Jays' latest<br />\nvictim.<br />\nHopkins lost its third contest in four outings when Hopki<br />\nns downed the Hoyas 20-8 at Homewood<br />\nFarmingdale Community College nipped the Jays, 7-6.<br /><br />\nRocks &amp; cocks<br />\nin Ocean City<br />\nBy COLIN CAMERER<br />\n(Special to the News-Letter)<br />\nOcean City, Maryland is Paradise to most of Bawlamer<br />\nOcean City is a common man's temporary heaven..<br />\nFor the uninitiated, Ocean City is a ten-mile stretch of,<br />\nbeach on Maryland's Eastern Shore. Winter population is<br />\na few thousand, but hot summer weekends draw crowds.<br />\nin excess of 200,000. The brutal expansion -contraction<br />\nof city tissues has produced some strange phenomena:<br />\n1) Mayor Harry Kelley. Kelley has only one qualification<br />\nfor being mayor; he has lived in the town for hundreds of<br />\nyears. He has fathered ordinances banning bare chests<br />\n(among both sexes) on the boardwalk, sleeping in vans<br />\nand public drinking. A curious demagogue saddled with:<br />\ngood intentions, Kelley's idol is still the late Richard.<br />\nDaley of Chicago. A moment of silence, please.<br />\n2)A spectacular attraction for young punks. Runaways of<br />\nevery shape, form and carrying every disease flock to the<br />\nresort in search of penny arcade truth or escape from<br />\nparental units(whichever is cheapest).<br />\n3) Greed and contempt. When mixed, these two qualities<br />\nproduce a subtle love-hate obsession among the huge<br />\nmajority of Ocean City's small businessmen. When the<br />\ntourists aren't here, they bitch. When they arrive pockets<br />\ntemporarily lined with gold—they bitch.<br />\n4) An amazing assortment of bars. From Millie's Mermaid<br />\nInn (near Daisy's Golden Anchor)to i;ie Lookout Lounge<br />\nN-L correspondent loses<br />\n(high atop the Fenwick Inn), bars to suit any taste exist in<br />\nOcean City. Insiders say Finnigan's Rainbow, 1 350-seat<br />\nreligiously to AM radio. Legal secretaries in yellow<br />\nnightclub in its second season, will soon acquire a national (Mustang Ghias reading about Red Skelton in People<br />\nreputation after presenting the one and only Robert<br />\nmagazine. And so on.<br />\nPalmer.<br />\nTourists come in huge swells and will continue to do so<br />\n5) A beach which erodes at the rate of 2 feet per year and<br />\nfor many years. Visitors from Ohio and Pennsylvania are<br />\nalready resembles Twiggy in spots. It is one of the<br />\nbecoming more frequent. The condominium boom of<br />\ncleanest on the East Coast. Now if you can only find' several years ago has ceased but modern towers of glass<br />\nroom... _<br />\nand concrete can be easily glimpsed to the north.<br />\nDespite all the small town pettyism, Ocean City is an<br />\nCommerce in Ocean City is active but not feverish.<br />\nimmensely popular place to be in the summer. People Growth in tourism is slow and steady. Prostitution is rare<br />\narrive in droves, sweating out desperate drives (4 hours (\"A hooker told me)), a police captain- confides, \"she<br />\neach way from Baltimore) to have an audience with went out of business because so many/ girls; give it<br />\nBrother Oum and Sister Surf. Big families drinking from away\"). One homicide has been recorded since 1965 and<br />\ncoolers of fake soda pop in station wagons witli wooden that was done out of boredom.<br />\nsides. High-school kids in beat-up Volkswagens listening<br />\nBaltimorons and Washingtonians alike con- to Ocean<br /><br />\nshirt to DEAN OF BEER<br />\nCity to sweat away the pains and headaches of work.<br />\nThose with more money go to the mountains or Florida,<br />\nbut the People go to O.C. The Smarter People go to<br />\nuptown O.C. (60th-140th Sts.). where rent is steeper but<br />\ncommercialism is not suffocating.<br />\nThe boardwalk sleaze is obvious. Ragged vendors lean<br />\nout of game booths and recite their well-oiled pitches.<br />\nEmbarassed men shuffle over to break the plates or knock<br />\nover the bottles and win a stuffed animal for a woman<br />\nfriend. Everyone that poinds the boards gets taken and<br />\nthe vast majority know it. The same honest scam is played<br />\non beaches from Ft. Lauderdale to Asbury Park.<br />\nOcean City is worth a token visit. There are good times<br />\nto be had — just turn over the proper rocks.<br /><br />\n01-41*-*-410-440-•<br /><br />\nSON OF TRIVIA QUIZ<br />\nPART II<br />\nHere's your last chance to match wits with the News-Letter's<br />\nquizmasters. These questions are relatively easy because there's<br />\nno prize to give away. Answers will be found somewhere in this<br />\nissue. Good luck!<br />\nMatch the game show with its host (two points each)<br />\n1. Jan Muarry<br />\n2. Gene Wood<br />\n3. Bobby Van<br />\n4. Art Flemming<br />\n5. Bob Ewbanks<br />\n6. Wink Martindale<br />\n7. Geoff Edwards<br />\n8. Jim Lange<br />\n9. Bill Cullen<br />\n10. John Daley<br /><br />\na. Jackpot!<br />\nb. Eye Guess<br />\nc. The Dating Game<br />\nd. The Newlywed Game<br />\ne. What's My Line?<br />\nf. Beat the Clock<br />\ng. The New Beat the Clock<br />\nIi. The Fun Factory<br />\ni. Jeopardy<br />\nj. Gambit<br /><br />\nFill in the blanks to these famous themes<br /><br />\n1. Who is Ellie Mae's boyfriend?<br />\n2. What did they call their swimming pool?<br />\n3. What was the name of the studio Jed bought?<br />\n4. From what town did the Clampetts come?<br />\n5. What is Jethro's last name? (Hint: it's not Tull)<br />\n(one point each)<br /><br />\nWhat show is this from? Who is singing this song?<br />\nis the place to be<br />\nis the life for me<br />\nLand spreading out so ---- and<br />\nKeep<br />\n; give me that<br /><br />\n1. Mr. T. and Tina<br />\n2. The New Dick Van Dyke Show<br />\n3. The Paul Sand Show<br />\n4. I Dream of Jeannie<br />\n5. Sgt. Bilko<br />\nFeatured Series --- \"The Beverly Hillbillies\" (four points each)<br /><br />\n1. There's a hold-up in the<br />\nbroken out in fights<br />\nThere's a traffic jam in<br />\nThat's backed up to<br /><br />\n2.<br /><br />\nIn what cities do the following shows take place: (three points each)<br /><br />\nSCORE YOURSELF<br />\n70-56 a real whiz, a regular wisenheimer<br />\n55-46 good, still thinks Peggy Cass died of a ham sandwich<br />\n45-31 average, thinks Hugh O'Brien is a good actor<br />\n30.16 below average, watches \"Celebrity Bowling\"<br />\n15-0 airhead, typical Hopkins student<br /><br />"}], "field_media_file": [{"target_id": 41223, "display": null, "description": null, "target_type": "file", "target_uuid": "7aa69524-b3f0-46e9-81a2-d92bc904aaf2", "url": "http://digital.library.jhu.edu/system/files/2022-03/14357-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14357, "target_type": "node", "target_uuid": "f902d901-2e42-4a4a-a016-657125c133c1", "url": "/node/14357"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7562da68-417f-4445-b97b-7144bd79bb30"}]}