{"mid": [{"value": 39270}], "uuid": [{"value": "f648d435-283a-4dfe-9a04-568164fc7434"}], "vid": [{"value": 39270}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:26:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13895-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:26:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:26:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "***<br />\n<br />\nNt111/3<br />\n<br />\nErtter<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, MARCH 4, 1966<br />\n<br />\nVOL. LXX, NO. 18<br />\n<br />\nRush ends;<br />\nfrats bid for<br />\n'69ers (no joke)<br />\n<br />\nREEXAMINED<br />\n<br />\ns•<br />\n<br />\n.<br />\n<br />\ne than does<br />\ndefinitely need a greater working knowledg<br />\nthe person who serves in a public court.\"<br />\nmeasure<br />\nGould does not consider the plan as a<br />\nHonor<br />\nPrimarily to increase the effectiveness of the<br />\ngreater<br />\nbeen<br />\nhave<br />\ns<br />\nviolation<br />\nhonor<br />\nAlthough<br />\nCode.<br />\nis \"not an<br />\nthis year than in the last few years, it<br />\nway of<br />\nalarming increase,\" he feels. \"There is no<br />\ndisregard<br />\ndetermining whether there exists a greater<br />\ninterest<br />\nfor the system or whether there is a greater<br />\ncheaters.\"<br />\nand concern motivating students to turn in<br />\nHonor<br />\nGould believes the latter, pointing out that the<br />\ng its<br />\nCommission has been more open in discussin<br />\nmarked<br />\nno<br />\nobserved<br />\nhas<br />\nhe<br />\nand<br />\nyear<br />\nthis<br />\ns<br />\nfunction<br />\nunderantipathy towards the Honor System among<br />\ngraduates.<br />\nGould's Plan<br />\nthe<br />\nAlthough not as yet completely formulated,<br />\nFirst,<br />\nPlan, in Gould's mind, will perform two tasks.<br />\nthe<br />\nIt will provide a seven man jury picked from<br />\nthe<br />\nundergraduate body and screened individually by<br />\n\"1.500<br />\nHonor Commission. \"Ideally,\" says Gould,<br />\nscreenShould be qualified to serve.\" Nevertheless, the<br />\nof<br />\naccused<br />\nperson<br />\nno<br />\nthat<br />\ninsure<br />\nto<br />\nattempt<br />\ning will<br />\nS violation will be tried by a biased or irresponsible<br />\njuror.<br />\nGould hopes that the initial step will be taken<br />\nnovice<br />\nby May. One alternative would be to place<br />\nJurors on the Appeal Board, where they would perform<br />\nthe relatively mechanical task of ascertaining whether<br />\ntunew evidence had been introduced or an unconsti<br />\ntional act committed. Another would be to pick two<br />\npanel<br />\nRon-Commission members to serve on the trial<br />\nwould<br />\ne<br />\nprocedur<br />\nThis<br />\n.<br />\nmembers<br />\nion<br />\nCommiss<br />\nWith five<br />\nfrom<br />\nbe gradually expanded until all seven were not<br />\nthe Commission.<br />\nPrerequisites<br />\nAt some point, says Gould, an election of the Honor<br />\nas a<br />\nCommission members would be held, with service<br />\nhip.<br />\nJuror a prerequisite for commission members<br />\nthereafter, sophomore members would be elected,<br />\nWhile junior and senior members would retain their<br />\nce<br />\nPositions. In this way, the desired factor of experien<br />\nWould be retained, while students would exert a<br />\ngreater degree of control over its membership. .<br />\nUnder this system, the Honor Commission would<br />\ntake on a mote administrative function.<br />\n<br />\nvlifi<br />\ni er<br />\n<br />\n70TH YEAR<br />\n<br />\nHop prexy<br />\npromises full<br />\ndorm food study<br />\n<br />\nMembers<br />\nto investigate<br />\nhonor changes<br />\nBy MEL SHUSTER<br />\ne of<br />\nA plan to effect major revisions in the structur<br />\ned<br />\nthe Honor Commission is currently being consider<br />\nby its members. Its purpose, according to Barry Gould,<br />\nd, will<br />\nWith whom the Idea originated and develope<br />\nstudent<br />\ngreater<br />\ne<br />\nencourag<br />\nand<br />\npossible<br />\nbe to make<br />\nparticipation in the Commission's functions<br />\nout in<br />\nBroad in scope, the plan would be carried<br />\nyears.<br />\nfive<br />\nas<br />\nperhaps,<br />\nlong,<br />\nas<br />\nperiod<br />\na<br />\nover<br />\nitages<br />\nAt the end of this time, the Honor Commission would<br />\nits<br />\nbe a democratically elected body, with part of<br />\nwhich<br />\njudicial role represented in a jury system in<br />\nany undergraduate with a clean record and deemed<br />\ne<br />\nresponsible by a Commission screening committe<br />\n*could serve.<br />\nTaking an \"evolutionary view,\" Gould sees the plan<br />\na<br />\nas a \"logical extension of the honor system, not<br />\nviolators<br />\nwith<br />\ndealt<br />\ndeans<br />\ny,<br />\nOriginall<br />\nradical change.\"<br />\nOf the Honor Code. After the second World War, this<br />\nrole was filled by the Student Council, until the Honor<br />\nebinmission was established ten years ago.<br />\nStudent Body's Role<br />\nof the<br />\nThe crucial question which arises is that<br />\nwillingreliability of the entire student body and its<br />\nCommisness to become such an integral part of the<br />\nsion structure. Gould believes that \"the students must<br />\nbe made aware through an orientation in depth of the<br />\nwill<br />\nfundamental principles of the Honor System, and<br />\n<br />\n4100-Ei<br />\n<br />\nTomorrow morning the sun will rise on Pledge<br />\ntrying<br />\nSaturday and mark the end of one of the most<br />\nAt<br />\nrush.<br />\ny<br />\nfraternit<br />\n,<br />\nschedule<br />\nHopkins<br />\nthe<br />\nperiods on<br />\nn will<br />\nnine o'clock a multitude of bleary eyed freshme<br />\nHall<br />\nrise, file silently and pensively over to Levering<br />\nies<br />\nwhere they will bid one. two, or three fraternit<br />\ne.<br />\npreferenc<br />\nof<br />\norder<br />\nin<br />\nchoice,<br />\nof their<br />\nAt the same time one unlucky fraternity man from<br />\neach of the thirteen houses involved in rush this year<br />\nwill march to Levering Hall to deliver the bid list for<br />\nhis fraternity. This drama having played itself out,<br />\nas it does each year on Pledge Saturday, rush will be<br />\nover, and it will remain only for the various fraternities to pick up their hopeful charges and envelop<br />\nthem in the protective arms of fraternalism.<br />\nRush this year proceeded much as it has in the<br />\npast, with a handful of minor violations being handed<br />\ndown by the I.F.C., but no major breaches of rush<br />\nregulations taking place. A note of interest was added<br />\nby the crackdown on beer carried out by the Baltimore City Police in conjunction with a massive revamping of the department. This caused the I.F.C. to<br />\nsuspend the serving of beer for rush in an attempt<br />\nto preserve itself and the fraternity system.<br />\nA large percentage of the class of '69 is expected<br />\nto go fraternity. This, coupled with the facts that the<br />\nclass is the largest in Hopkins history, and that Phi<br />\nKappa Psi eliminated itself from rush by violating<br />\nthe terms of its social probation promises growth for<br />\nmost of the houses on campus. The tone, going into<br />\nPledge Saturday, is optimistic, both among the freshmen and the fraternities.<br />\n<br />\n3 Penny Opera<br />\ncomplete sellout<br />\nTheatre Hopkins will present Bertolt Brecht and<br />\n5,<br />\nKurt Weill's, \"The Threepenny Opera,\" on March<br />\nper6, 12, 19, 26, and 27 at 8:30. Tickets for all<br />\nstudents<br />\nformances are now sold-out, but optimistic<br />\nwaiting<br />\ndesiring tickets can put their names on the<br />\nwill<br />\nnces<br />\nPerforma<br />\nOffice.<br />\ns<br />\nRelation<br />\nPublic<br />\nthe<br />\nlist at<br />\nbe held at the Barn.<br />\non,<br />\nEdward J. Golden. who will direct the producti<br />\ncommented, \"The play is perfectly suited to the Barn,<br />\nnas it was originally designed for cabaret entertai<br />\nment.\" Golden went on to say that this is the Baltimore premiere of the twentieth-century classic. Director Golden described the cast as extremely talented.<br />\n\"It isn't very often we get people who can act and<br />\nsing.\" he stated. Thomas Conlin will conduct and<br />\nmusically direct the production.<br />\non,<br />\nRelating some of the difficulties of producti<br />\nthe<br />\nin<br />\nformed<br />\nbeen<br />\nhad<br />\ncast<br />\nthe<br />\nhow<br />\ntold<br />\nGolden<br />\nsummer, but the odd hour rehearsals had kept the<br />\ns<br />\npressure building toward opening night. Costume and<br />\nsettings are from the Twenties, differing from the<br />\noriginal play which had a Victorian setting, but the<br />\nHopkins production will remain true to Brecht's book<br />\nand Weill's music. On the subject of the ticket sell-out,<br />\nGolden remarked that even the dress rehearsals were<br />\nplaying to packed houses.<br />\nCast Of Characters<br />\nFeatured in the production are Ralph Piersanti as<br />\nMack the Knife and Fran Mahr as Pirate Jenny.<br />\nThree Hopkins students; Rick Wessier, Stephen Jarrett and John Green play the members of Mack the<br />\nKnife's gang. A fourth, Bill Oberreit, plays the<br />\nPoliceman.<br />\n<br />\nBy JOE WEINBERG<br />\nDr. Milton S. Eisenhower, president of the UMversity, promised a full investigation of the food served<br />\nIn the dormitory cafeteria in a special meeting at<br />\nHomewood House March 1. Dr. Eisenhower responded<br />\nto a 415 signature petition presented to him at the<br />\nmeeting by three Hopkins freshmen. Plant manager of<br />\nthe University Wesley Taylor, in whose department<br />\nthe food service belongs, will conduct the investigation.<br />\nThe petition, which was organized by freshmen Bob<br />\nGayle, Richard Hammond, Bruce McLeish and Mark<br />\nOlman, asked for an investigation of the \"inferior<br />\nquality of the food,\" because \"the apparent lack of<br />\n.quality constitutes a serious detriment to our health<br />\nand morale.\" Included in the copies of the petition<br />\npresented to the administration were more specific<br />\ncomplaints such as the small size and quality of the<br />\nmeat, the lack of proteins in the diet, the greasiness of<br />\nthe meat, the shortage of garden vegetables and fresh<br />\nfruits, and the cleaning of the silver and glassware.<br />\nDr. Eisenhower expressed a deep concern for the<br />\nsituation in the cafeteria and promised action. Ham-.<br />\nmond, Olman, Gayle, and Taylor will meet next Tues.<br />\nday at 10:00 A.M. to further discuss the situation.<br />\nLaShaw Concerned<br />\nMr. Howard LaShaw, director of the food service,<br />\nalso expressed concern over the students' complaints.<br />\n<br />\nREEXAMINED<br />\nThe director stated that he would personally prepare<br />\nthe menus for the dormitory and that \"I'll be there<br />\nphysically nine-tenths of the day. I will be right there<br />\nfor all meals, observing the cooking.\" Mr. LaShaw<br />\nhoped to be able to talk to students during the meals<br />\nIn order to hear specific complaints. \"I'll very definitely<br />\nbe up there from here on out,\" he repeated. \"We do<br />\nwant suggestions. The door is open every meal and<br />\nplease stop by with any suggestions at all. We will be<br />\nmore than glad to listen to them and put them into<br />\neffect. The fellows live here nine months out of the<br />\nyear and we certainly want to try to keep thent<br />\nhappy.\"<br />\nIn addition to personally supervising the dormitory<br />\ncafeteria, LaShaw is surveying the menu's from the<br />\npast years to see if there really is lack of protein in the<br />\nplanned diet. He also explained that the service only<br />\nbuys top quality meats and other foods.<br />\nGov't Stamped<br />\nAll canned foods bear a certificate of quality and<br />\ncondition from the U.S. Department of Agriculture<br />\nwhich checks that the cans meet the specifications.<br />\nThe service only buys top grade, U.S. Choice- or U.S.<br />\nGood meat The government classifies meat as prime,<br />\nchoice, good, and commercial in order of quality.<br />\nLa Shaw emphasized that he was very interested in<br />\nspecific complaints such as greasy food, and that<br />\nthese would be acted upon promptly. He was puzzled<br />\nover what was different this year than other years<br />\nthat the students should think that the food had become exceptionally bad. \"The cooks are the same<br />\npeople, the procedure the same, the meat quality is<br />\nthe same.\"<br />\nStudent Views<br />\nStudent opinion in the dormitories seemed to agree<br />\nwith the tone of the petition. Toby Simon, a senior,<br />\nstated that \"the extremely bad quality of the dormitory food seems to be part of the general policy of<br />\nletting the dormitory facilities decay and becoming<br />\nless desirable to live in. Since I've been here the food<br />\nhas gotten worse. Especially upsetting to me is the<br />\nunappetizing appearance of the food and the knowledge that the meat in particlar is of such low quality.<br />\nThe DSRC's insistence on going through channelo<br />\n(Continued on Page 31<br />\n<br />\n\fPAGE TWO<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE. MARCH 4, P9'615<br />\n<br />\nP-Ball In Grads Given 'Arms' SC Knocks SDS,<br />\nWhite Gym<br />\n<br />\nThe<br />\nUniversity<br />\nannounced long term future of the UniMonday that it has purchased versity.\"<br />\nthe Cambridge Arms Apartments<br />\nInsures Accommodations<br />\nThe annual DSRC-sponsored<br />\nat Charles and 34th Streets for<br />\nMr. Taylor continued, \"After<br />\nPajama Ball is scheduled for<br />\nconversion to graduate student weighing all considerations, we<br />\nThe Student Council severely<br />\nSaturday, March 12, from 9 P.M.<br />\nfelt that we must take advantage criticized SDS for continuing to<br />\nliving quarters.<br />\nof the opportunity to purchase use the name \"The Johns Hopto 1 A.M, in the Gym. Dress will<br />\nThis announcement was made the Cambridge Arms in order to kins Chapter\" without meeting<br />\nbe casual.<br />\nfurther our efforts to insure that certain requirements. Also, the<br />\nMusic will be provided by The by Wesley A. Taylor, assistant to our graduate<br />\nstudents, both Council hopes to implement the<br />\nthe<br />\npresident<br />\nfor<br />\nbuildings and<br />\nBritish Walkers and The Newmarried and unmarried, have recommendations of one of its<br />\ngrounds.<br />\nsuitable living accommodations committees by compiling and<br />\nports. The British Walkers, contrary to name, is a WashingtonLocated across Charles Street convenient to the University as printing a course guide to supbased rock and roll band that opposite the Homewood campus, they pursue their important plement the brief course descripstudies and research.\"<br />\ntions given in the Catalogue.<br />\nhas appeared at many clubs and the apartment building is the<br />\nThe letter further points out<br />\nThe IPC has arranged for<br />\nsocial functions in the Balti- third<br />\ncommercial<br />\napartment that the University \"recognizes<br />\nfreshmen to submit their bids<br />\nmore - Washington area. The complex purchased by the Uni- that all tenants would not be<br />\nthis Saturday from 9 to 11 a.m.<br />\nNewports is also a local group, versity for student housing. able to vacate the building im- in Levering Hall, accompani<br />\ned<br />\nmediately.<br />\nHowever,<br />\nthe Uni- by a $5 fee. The fraternity houses<br />\nand the two bands will attempt Previous purchases have been<br />\nto furnish continuous entertain- made possible by Federal loans, versity hopes to achieve sub- will submit their lists at 11 a.m.<br />\nstantial student occupancy by and unbiased IFC shadchan<br />\nim<br />\nand an application for funds to<br />\nment through the evening.<br />\nthe fall of 1966.\"<br />\nwill perform the match-making.<br />\nfinance the current project is<br />\nTickets for the dance are<br />\nMr. Taylor went on to say that Freshmen will be notified of the<br />\npending.<br />\navailable at $3.50 per couple and<br />\nshould any of the tensnts so de- final decisions at about 2 p.m.<br />\nmay be obtained in the LeverIn a letter addressed to all sire, his office would be glad to<br />\nA Council committee met with<br />\ning Hall YMCA office and dorm residents of the building, Mr. assist them in their search<br />\nfor students and faculty<br />\nof<br />\ncafeteria and through the fra- Taylor<br />\nsaid,<br />\n\"All<br />\npossible other accommodations.<br />\nGoucher College to discuss posternity and dorm houses. Set-ups thought has been given to our<br />\nHopkins purchased the Brad- sible coordination of curricula<br />\nwill be provided, and table res- obligations to our neighbors ford apartments,<br />\nat 33rd and St. between the two schools. One<br />\nervations can be made, at $2 prior to taking this important Paul<br />\nStreets, in 1947, and the Goucher faculty member had<br />\nper table of 5 couples, in the step, but the fact remains that Greenway<br />\nApartments,<br />\nnow reservations about the desiraStudent Shop or ins301 Royce.<br />\nwe have a responsibility to the called McCoy Hall, late in 1963. bility of<br />\nany such arrangement<br />\n<br />\nGouch Fac Cracked<br />\n<br />\n111••••••••••<br />\n<br />\nbecause he felt that Hopkiti,<br />\ncourses do not meet Gouch.<br />\n41<br />\nstandards.<br />\nSDS Title<br />\nA senior member submitlat<br />\nevidence that SDS was still u/E0<br />\ning the name \"Johns Hopkitti<br />\nChapter,\" although they hay!<br />\nnot yet submitted a. constit<br />\nCouni<br />\n9<br />\ntion for approval<br />\nro<br />\nby the Coune<br />\nAfter heated debate, the<br />\ndetermined to call the SDS lead<br />\ners before the Council to<br />\nplain their actions.<br />\nThe Course Guide Conunittse<br />\nInformed the Council that cour<br />\nguides have proven very suc<br />\nful at other colleges, and<br />\nHopkins such a guide would n ,<br />\nonly help students in makil<br />\ncourse selections, but would gi professors an idea of how ther<br />\ncould improve their teaching<br />\ntechniques.<br />\n<br />\nMed<br />\n<br />\nLecture<br />\n<br />\n\"Medicine in the Soviet<br />\nUnion\" will be the title of the<br />\ninaugural William H. Welch<br />\nlecture to be given by Dr.<br />\nRussell A. Nelson, president<br />\nof the Johns Hopkins Hospital, March 9 in the classroom<br />\nBuilding at 4 p.m.<br />\n<br />\nThe \"in\" thing to do<br />\nis catch Olds 88 Swing Fever.<br />\n<br />\nWhen you can't<br />\nafford to be dull,<br />\nsharpen your wits<br />\nwith NODOZTM<br />\n1<br />\nNoDoz Keep Alert Tablets fight oft<br />\nthe hazy, lazy feelings of mentai<br />\nsluggishness. NODOZ helps restore<br />\nyour natural mental vitality.., helps<br />\nquicken physical reactions. You be.<br />\ncome more naturally alert to people<br />\nand conditions around you. Yet<br />\nNODOZ is as safe as coffee. Anytime<br />\n...when you can't afford to be dull,<br />\nsharpen your wits with NoDoz.<br />\n(<br />\n<br />\nSAFE AS COFFEE<br />\n<br />\nSo<br />\n<br />\nhere. Catch! You're now a candidate<br />\nfor an Olds 88, one of the<br />\nmost formidable machines ever to touch rubber to road! Delta, Dynamic and Jetstar<br />\n88—eleven<br />\nToronado-inspired models in all—ready to rocket you into spring. Each comes<br />\non with standard<br />\nsafety items like windshield washers, back-up lights, more! So buckle up (seat belts are<br />\nstandard, too) and take the cure! At your Oldsmobile Dealer's! LOOK TO OLDS FOR THE NEW!<br />\nAvailable at:<br />\n<br />\n7000NADO • MbNITY-IIMMIT • ULU Is • DYNAMIC II* 1I7II7A2<br />\nOA • CUTLASS• F-AS• MA7A.CAUSSCII*STARYINE • 4.44<br />\n<br />\n,76-1<br />\nY9 OUT FRONT<br />\n...in a RocketAction Carl<br />\n<br />\n1 OLDSMOBILE BY pm<br />\nmom vow 70 00 MINIM Mt ACTION IS.,.<br />\n<br />\nGREENWAY<br />\nPHARMACY<br />\n<br />\nYOSAI LOCAL AUTMOORIO 01011000111 QUALITY HAM 'TODAY*<br />\n<br />\nCHARLES & 34TH STS.<br />\n<br />\n\fPAGE THREE<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nCopland To Speak Mandelbaum Schedules Talks<br />\nOn Modern Music<br />\nAaron Copland. noted Amer- I known works are El Salon Mexican composer and conductor, ico (1936), Billy the Kid (1938),<br />\nwill speak on \"Recent Trends in Rodeo (1942) and The AppalaContemporary Music\" at Hop- chian Spring (1944).<br />\nkins Thursday, March 10 at<br />\nHe is currently vice-president<br />\n4 p.m.<br />\nof the Koussevitsky Foundation,<br />\nHe will be introduced to the a member of the Edward MacShrive/. Hall audience by Dr. Dowell Association, the AmeriPeter Herman Adler, Director of can Academy of Arts and Scithe Baltimore Symphony Or- ences, the Royal Academy of<br />\nchestra. On the preceding night, Music, and the American Society<br />\nMarch 9, Mr. Copland will con- of Composers, Authors and Pubduct the Baltimore Symphony lishers.<br />\nIn their performance at the<br />\nThe public is invited to attend.<br />\nLyric.<br />\nhis<br />\nreceived<br />\n66,<br />\nCopland,<br />\nMr.<br />\nMus. D. from Princeton University in 1956. Since then he<br />\nhas received honorary doctor<br />\ndegrees from Harvard. Temple,<br />\nBrandeis, Wesleyan and Oberlin.<br />\nIn 1944, he was awarded the<br />\nPulitzer Prize for Music; and,<br />\nIn 1945, he received the New<br />\nYork Music Critic's Award. His<br />\nfilm scare for the movie \"The<br />\nHeiress\" won him an Oscar in<br />\n1950.<br />\nAmong Mr. Copland's best<br />\n<br />\nSTUDENTS!<br />\nOf course you can<br />\nget a cash loan!<br />\n•Our new LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br />\n•Monthly repayments will<br />\nbe arranged to suit your<br />\nparticular circumstances.<br />\n<br />\nlowing a talk, each philosopher<br />\nwill hold a seminar with students<br />\nin the graduate course.<br />\nMandelbaum,<br />\nDr.<br />\nMaurice<br />\nchairman of the Philosophy Department, suggested several lectures of special interest to undergraduate students. On March<br />\n10, George L. Kline, an expert<br />\non Russian philosophy, will<br />\nspeak on \"The Existential Rediscovery of Hegel and Marx.\"<br />\nThe fololwing Thursday, James<br />\nM. Edie, a professor at Northwestern University, will discuss<br />\n\"Sartre as Phenomenologist and<br />\nas Existential Psychoanalyst.\"<br />\nThe concluding lecture on April<br />\n28, will be given by Albert Wil-<br />\n<br />\nliam Levi, who has been appointed by President Johnson as<br />\nthe Philosophy Consultant to the<br />\nnew Humanities Commission.<br />\nHis subject is \"Existentialism<br />\nand the Alienation of Man.\"<br />\nA new series of outstanding<br />\nlectures has been scheduled for<br />\nthe fall semester.<br />\n<br />\nBlue Key Society<br />\nAll interested sophomores<br />\nand juniors may pick up applications for membership in<br />\nthe Blue Key Society at the<br />\nadmissions office in the basement of Shriver Hall.<br />\n<br />\n• Pass this difficult<br />\nand challenging 7-part test<br />\nand win a free<br />\nGENIUS button!<br />\n<br />\nFood Study<br />\n(Continued from Page 1)<br />\nand their failure to make an<br />\nemphatic stand for students'<br />\nrights and the obligation of the<br />\nadministration has certainly not<br />\nhelped the matter.\"<br />\nThe threb freshmen student<br />\ncouncil representatives agreed<br />\non the issue. Ken Bonds said<br />\nthat the meals were unbalanced<br />\nand poorly prepared and that<br />\n\"the poor food is just one of the<br />\nmany facets of a university<br />\nundergraduate<br />\nneglects<br />\nthat<br />\nneeds and I think the situation<br />\ncould be handled very quickly if<br />\nthe responsible officials get together and planned out the very<br />\nbest food program the university<br />\ncan afford.\" Mike Michaelson<br />\ncomplained of the lack of protein and the excess of grease. \"In<br />\nview of the considerable price we<br />\nwe pay to eat in the cafeteria, a<br />\nlittle more nourishment and<br />\ntaste could certainly be expected.\" John Pell agreed and<br />\nsaid, \"It's not that It just tastes<br />\nbad, it's a health hazard, it<br />\nreally is.\"<br />\nDoyle Smith, president of the<br />\nDSRC, said, \"We've tried to do<br />\nwhat we can in terms of getting<br />\nthings cleared. We've tried!\"<br />\n<br />\nThe spring semester at Hopkins should be one of great philosophical ferment, for many of<br />\ncontemporary philosophy's great<br />\nminds will present their views<br />\non the theme of \"Phenomenology<br />\nand Existentialism,\" in corjunction with a graduate level course<br />\nof the same title. Although technical in presentation, the lectures are open to all students<br />\nand faculty of the University.<br />\nThe unprecedented series of lectures, which will . be compiled<br />\nand publishea in the future, will<br />\nbe held in Room 3 of the Classroom Building every Thursday<br />\nat 4 p.m. On the Fridays fol-<br />\n<br />\nMI<br />\n<br />\nEa ma<br />\n<br />\nEN mum<br />\n<br />\n111<br />\n111<br />\n<br />\n\"DIFFICULT AND CHALLENGING 7-PART TEST\"<br />\n<br />\nPart 1. Write your<br />\nname and school.<br />\nPart 2. Write your<br />\nstreet address.<br />\n<br />\n.<br />\n<br />\n1<br />\n<br />\nPart 3. Write the<br />\ncity where you live.<br />\n<br />\n2<br />\n<br />\nPart 4. Write the<br />\nstate where you<br />\nlive.<br />\n<br />\n3<br />\n<br />\nPart 5. What year<br />\nare you in at<br />\n<br />\n4<br />\n<br />\ncollege?<br />\n<br />\n5<br />\nPart 6. What field<br />\ndo you plan to be a-1111<br />\nGEnius in after<br />\ngraduating?<br />\n<br />\n6<br />\n<br />\n\"Room for GENIUSES,\" General Electric Company,<br />\nBox 215, Church St. Station, New York, N. Y.10046<br />\n.<br />\n.O<br />\ntP<br />\nPart 7. Now,cu<br />\n7<br />\nout and mail the<br />\n•<br />\ncoupon to General<br />\nElectric' at this<br />\naddress,<br />\n<br />\nIli ion um so se so um NE No IN NI so mu<br />\n<br />\nEa la III<br />\n<br />\nGeneral Electric is passing out GENIUS buttons. What's the point?<br />\none otn4s<br />\n004<br />\nroe<br />\ny,eePog<br />\ntecoong a<br />\n<br />\nII<br />\n<br />\nWe want to spread the word that<br />\nthere's room at General Electric<br />\nfor talented people who want<br />\nto take on big challenges.<br />\nWe like to call these people<br />\nGENIUSES. But what they're<br />\ncalled isn't so important as<br />\nwhere they're headed. And at the<br />\nGeneral Electric Company,<br />\nthere's plenty of room for<br />\nGENIUSES, no matter what<br />\n<br />\ntheir particular field of interest.<br />\nIf you want to be recognized for<br />\nyour talents come to General<br />\nElectric, where the young men<br />\nare important men.<br />\nAnd be among the first on your<br />\nca'mpus to own a genuine<br />\nGENIUS button. It will serve as<br />\na reminder that G.E. .and<br />\nGENIUS... and important<br />\nchallenges... all go together.<br />\n<br />\nXgtestIs ar Most Imporfant Phidvd<br />\n•Stop in or 'phone...We'll<br />\nbe glad to serve you.<br />\n<br />\nRitter,Nance<br />\n313 N. HOWARD ST.<br />\nBALTIMORE<br />\n<br />\nPhone SA 7-7880<br />\nHour,: Mons.. Tuetc. Wed.. 9-5;<br />\nThurs. 11-8; Fria. 9-6<br />\n<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\n\fPAGE FOUR<br />\n<br />\nNEWS -LETTER<br />\n<br />\n1i' Ju1iiui*npkitis News-triter<br />\nEditors-in-Chief<br />\n<br />\nJ. r.kb<br />\n<br />\nDeachanel<br />\n<br />\nJames M. Freedma<br />\nSW111111,18 Managers<br />\n<br />\nWiIlim Schenek<br />\nFeatures Editor<br />\nHenry James Korn<br />\n<br />\nAlum n Endel I<br />\nNews Editor<br />\nMel Shuster<br />\n<br />\nGuilty until proven innocent<br />\nThe decision of the honor conmiission to make the<br />\npossession of master keys to Gilman, and other halls,<br />\nan honor violation over steps the logical jurisdiction<br />\nof the Honor Commission. Aside from the fact that the<br />\ndecision makes the assumption that a person has taken<br />\nunfair advantage of his fellow students prior to any<br />\nfact of violation—the commission has extended its power<br />\nof judgement from within. As an unrepresentative body<br />\nthe Honor Commission has no right to take such an<br />\naction, and while there is evidence that such action<br />\nshould be taken—the matter should have been considered by the student council or sonic other representative<br />\nbody. We support the student council in its protest of<br />\nthe honor commission's decision.<br />\nThe administration, as well, should have known<br />\nto approach the student council and not the honor<br />\ncommission on this matter, but the decision of the<br />\nhonor commission to accept the decision as their duly<br />\nis a violation of their responsibility to the student body.<br />\nWe hope that in the future the honor commission will<br />\nact more wisely—besides their assumption that mere<br />\npossession of a key is an honor violation is tantamount<br />\nto admission that the honor system does not work—even<br />\nwe do not believe that.<br />\n<br />\nGood Works:<br />\nThe Cost of Good Graces<br />\nIn the eyes of the Baltimore public, fraternities<br />\nare as bad as their worst member. 11 is a typically<br />\nmoronic view, but has made the fraternities appear, in<br />\nthe last few weeks, to he harbors of vice.<br />\nSince this view can not be ignored, it should he appeased at every opportunity. Such an opportunity has<br />\narisen, and we recommend very strongly that the fraternities let an image of their \"hest member.\" have a tilt] exposure.<br />\nA group of students and faculty are attempting<br />\nto raise money for a scholarship drive for gifted underprivileged students. The drive has received the support<br />\nof Theatre Hopkins which is giving three benefit performances of \"Boys from Syracuse,\" to mkt to the fund.<br />\nIf the benefit performances are to make any substantial contribution, there must be a massive ticket<br />\nsale; and this is where the fraternities can help.<br />\nThe plan is this: The fraternity will pledge to<br />\npurchase a certain number of tickets, 50 to 100 in<br />\nexcess of what its members will need for themselves.<br />\nFor the night of the performance, the fraternity invites<br />\n50 to 100 less-privileged or deprived children—ehildren<br />\nwho might otherwise never have the chance to see a play<br />\nor even enter legitimately into a college community,<br />\nmuch less a fraternity house—to attend the performance as its guests at its expense.<br />\nBy this plan, which will be administered through<br />\nthe office of special events and Joluni Synodinos, the<br />\nfraternities provide an essential boost to the scholarship<br />\ndrive; they give a young boy a glimpse of what the<br />\ninside of a theatre looks like; the fraternities show Baltimore their better half, by way of the prepared publicity to be done by John Synodinos; and the members<br />\nand their dates can enjoy themselves being mutually<br />\ngracious to an awed group of youngsters; A bargain<br />\nfor such a great deal of beneficence.<br />\nThe Committee of Special Events will administer<br />\nthe details of the program. It will invite the children,<br />\ngive extensive local and national publicity to the participating fraternities and handle the finances.<br />\nThough Fraternities would suffer no harm in trailing good works for good graces at this time, the project<br />\nneed not be as mercenary as all that. The project has a<br />\ntouching straightforwardness about it that is rare in<br />\ncommunity action. It is a realizable reform with almost<br />\nguaranteed success, in the form of a simple kindness.<br />\n<br />\nBad Books<br />\nNearly everyone is discontented with the bookstore.<br />\nThe Hopkins Chapter of Students for a Democratic<br />\nSociety acted favorably on a resolution for communalizing the bookstore. Though the floor expressed concern<br />\nthat the issue was irrelevant to the resolution, or that<br />\nacting on such a trivial matter might enfeeble the local<br />\nchapter, the resolution passed with ease,<br />\nAnd the News-Leiter applauds them on this conBCH SUS. The News-Letter also points out that when the<br />\nmajority of students complain about capitalistic oppression, when the long range planning committee supports their complaint, when even the post office is<br />\nheard to complain about their inefficiency and when<br />\nSDS is illing to compromise the resolution, something is bound to be wrong.<br />\n<br />\n1<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nThe diaotevioace Scene<br />\nKustom Kar Au Go Go<br />\n<br />\nBy HENRY J. KORN<br />\nWIR<br />\nIn most cities of the United<br />\nStates, hints of Spring include<br />\na general expansion of greenery<br />\nand some sunshine. In Baltimore,<br />\nSpring is heralded by the opening of the Custom Automobile<br />\nShow at the Civic Center.<br />\nWe were quick off the line<br />\nSaturday morning, had a low<br />\nE.T. to the sink, starred at our<br />\ncandy-apple eyes, and made a<br />\ntrophy run to the john. Inspired<br />\nby a taste for perverse craftmanship we decided to attend<br />\nthe show and placed a call to<br />\nWITH, inquiring as to whether<br />\nwe were still eligible for the<br />\nGo Go Dance contest as well.<br />\nThe young lady who mans the<br />\nphone at WITH was stunned by<br />\nour inquiry and reffered us to<br />\nan off-duty disc-jockey. \"This is<br />\nthe good-guy gang from the<br />\nNews-Letter, the paper from the<br />\nwierd, wondeful world of HopNews-Letter Discotheque Editor Pat Glista shown In an inkinsland,\" we said hoping to terview with Ted Jaffee of WITH radio. Our man on the<br />\nscene<br />\nmeet him at his own level of blows cool with wrinkly smile.<br />\nconversation. \"This<br />\nis<br />\nBob<br />\nGorden\" he said, may I help littered the floor, we made for judged. We were told that the<br />\nthe dance music blasting from girls were measured on a scale<br />\n.<br />\n. you?\"<br />\nof one hundred points against.<br />\nWe explained our position in the second tier.<br />\nmore lucid terms and Gorden,<br />\nThere we found a few thous- the criteria of dancing ability,<br />\nobviously glad to escape listen- and people looking up at a plat- poise, originality, conduct, looks,<br />\ning to the \"Green Berets\", form that boasted a group called figure and age. While realizing<br />\nchatted amiably and invited us \"Sonny and the Nomads\", six that it is difficult to compete<br />\nto attend as his guests. We im- contestants wearing teased with outright obscenity, we still<br />\nmediately placed a second call pants, and a panel of judges. entertained hope of a victory for<br />\nto a blond sociology major of While the contestants (obviously the American College Girl.<br />\nour acquaintance and asked if ensconced in the \"sell it while<br />\nBut we were betting against<br />\nshe was interested in doing some you have it\" syndrome) writhed H. L.<br />\nMencken, the W. C. Fields<br />\nfield work at the Civic Center about the stage, we made our of<br />\nAmerican letters, who, based<br />\nway through mobs of leather on<br />\nlater in the afternoon.<br />\na lifetime in Baltimore said,<br />\nSome time later, we arrived at. jacketed Tackle users.<br />\n\"nobody ever went broke underthe Lombard Street entrance of<br />\nWe registered our contestant estimating the taste of<br />\nthe<br />\nthe Civic Center., After a turn and inquired as to the standard American<br />\npeople.\" Predictably,<br />\nabout the metal flake hulks that against which she would be we lost.<br />\n<br />\nAb<br />\n<br />\ntirk<br />\n<br />\nOf Mice and Men, and I.B.M.<br />\nBy HENRY M. HOCHERMAN<br />\nPlato might have thought<br />\nabout it, and Asimov surely has,<br />\nbut in any case it started with<br />\nthe traffic light, and it has invaded the very spice of life, the<br />\nvery unmovable mover which<br />\nmakes the world go 'round. It's<br />\ncalled \"Operation Match\" and<br />\nwith its 1984ish overtones It<br />\nadds another layer to the My<br />\nlar world we call home.<br />\n. In a recent Look article, college students who had not already heard, were introduced to<br />\nthe newest of High-Camp inthings computer dating. Not the<br />\ndating of computers (like computer chess) but rather being<br />\nmatch-made by computer. Computer dating, as personified by<br />\nOpertion Match in Cambridge,<br />\nMassachusetts, is just another<br />\nanswer to the insecurities whicn<br />\nbeset us one and all. For a small<br />\nfee (two dollars) one is guaranteed five dates just like he<br />\n(or she. Instant happiness can<br />\nbe achieved with one's Gerard<br />\nGoddess, and transistorized tranquility is the order of the day.<br />\nHello?<br />\n000011001<br />\nthis<br />\nis<br />\n001100001, and I dig you 'cause<br />\nthe ticking thinker says it's so.<br />\nand I don't have the guts to<br />\ntry it on my own!<br />\nThe advantages, it seems, are<br />\nmany and varied, as is attested<br />\nto by the fact that match has<br />\nprocessed some 90,000 applications. It seems to this reporter,<br />\nhowever, that the disadvantages are greater. What of the<br />\njoy of the hunt, the anticipation<br />\nof things to come? What of the<br />\nchallenge which is life itself?<br />\nWhat of spontaneity? What, me<br />\nelectronic hardies, of luv?<br />\nShould such a match succeed,<br />\nwhat does one tell the gentle<br />\noffspring? Mommy and Daddy<br />\n<br />\nwere on the same tape and it's<br />\nlucky they were both A.C. or<br />\nyou'd still be an electron!<br />\nConsidering, however, the various successes of Operation<br />\nMatch, one has cause to think<br />\nthat computerized correlation<br />\nmight be utilized in other matters, some of greater import<br />\nthan the mere procurement of<br />\n<br />\neaVte<br />\n<br />\na date for an evening.<br />\nNations in need of leaders<br />\nmight fill out massive questionaires describing their needs,<br />\nwhile potential leaders filled out<br />\nsimilar questionaires describing<br />\ntheir abilities. Ian Smith might<br />\nbe able to fill in for Nkrumah in<br />\nGhana, while the unemployed<br />\n(Continued on Page 6)<br />\n<br />\nace<br />\n<br />\nwholly on misinformation. There<br />\nNo Joke<br />\nis, indeed, a very definite issue<br />\nTo the editor:<br />\nAlthough I am not a member as to how far the activities of the<br />\nof the Hopkins Graduate Club, Graduate Club should be exf was very disappointed to see tended. This Ls to be expected<br />\nthe way in which the Club's since the Club is a new organicxecutive board was ridiculed in zation whose role has never been<br />\nyour last issue. In especially poor completely defined.<br />\nHowever, I feel that the editaste was the half page cartoon<br />\nthat belittled individual members torial and especially the cartoon<br />\nof the board, mentioning five of of last week only added to the<br />\nconfusion, and thus constituted<br />\nthem by name.<br />\nConsidering what these and a a disservice to those members<br />\nfew other students have man- with valid criticisms as well as<br />\naged to accomplish in a short to the club's executive board.<br />\nperiod of time, it really seems<br />\nFrank Kujawa<br />\na shame that they should be<br />\nGeology Department<br />\nslapped in the face for their<br />\nefforts. To date they have, with<br />\nNo Dope<br />\nthe help of the administration, To the Editors:<br />\nset up a clubroom for graduate<br />\nIt is the opinion of many that<br />\nstudents, arranged for the use of the abuse of drugs is fairly comthis room by graduate groups mon among college students,<br />\nwhen the club is closed, set up especially on the West Coast and<br />\ninterdepartmental<br />\nathletic in the North-East. I am not<br />\nleagues,<br />\nsponsored<br />\ngraduate aware of any significant inciparties and folk-songs, and pub- dence of this behavior among<br />\nlished a directory of graduate Homewood students, which may<br />\nstudents. For all practical pur- reflect the absence of a problem<br />\nposes, none of the above existed here or the reluctance of stua year ago.<br />\ndents to bring this problem to<br />\nMoreover, in talking to sev- my attention.<br />\neral of the board members and<br />\nHowever, that young people<br />\nto two of the prime critics, I everywhere are interested in exfound that many of the objec- perimenting with new experis.<br />\ntions made in last week's News- ences seems obvious, and that<br />\nLetter were based partly or<br />\n(Continued on Page 6)<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nNEWS-LETTER<br />\n<br />\nArt Exhibit Success,But<br />\nNudes Leave Critic Cold<br />\nBy GABE WEISBERG<br />\n<br />\nof a nude, Miss Sonde comes<br />\nclose to stealing the exhibit. This<br />\nwork, done with a subtle range<br />\nof color, demonstrates a freedom<br />\nand spontaneity that is lacking<br />\nin some of her other works, most<br />\nnotable her larger oil painting<br />\nNegro Girl from Project Head<br />\nStart. The latter is an obvious<br />\ninspiration from the works of<br />\nEmile Nolde, who must have contributed to her small Color<br />\nStudy, but falls apart in composition. The young girl simply<br />\nThe easiest way to approach is not part of the entire<br />\nthe show is through the repre- painting.<br />\nsentational works. Gallyne is the<br />\nThe drawings by Betty Borger<br />\nbest example. His studies of emerge as a mixed blessing. Her<br />\nnudes in pencil and conte crayon study of Leaves is confused and<br />\nImpress a viewer with their im- disjointed; among the weakest<br />\nmense understanding of human of the representational pieces.<br />\nanatomy; but leave one quite Her large pencil Nude (possibly<br />\ncold with their response to hu- a self-portrait) is better alman feeling. The drawings fail though the drawing of the legs<br />\nto move a viewer. Thus, one can is weak. The large Cat Study is<br />\nbe impressed by Gallynes mas- the most satisfactory. Here she<br />\ntery of light, his subtle shading has taken a cat and placed the<br />\nof form, his technical versatility animal in a variety of positions.<br />\nbut not by his freedom or spon- This is the most intriguing<br />\ntaneity. The pieces are academic aspect of the drawing as the cat<br />\nstudies, worked out with minute suggests a time sequence in space<br />\nprecision, and if one asks for which revolves around the cennothing more from a work of tral form. As the cat gains moart they are excellent.<br />\nmentum it begins to emerge as<br />\nThe wood cuts by Suzanne a lion, an animal much fiercer<br />\nKolisch Sonde, some of which and stronger than a house variwere exhibited last year, are ety. Perhaps Miss Borger has<br />\nquite good. They show an ad- studied the works of Eugene<br />\nmirable understanding of form, Delacroix who shows a similar<br />\nspace and composition. Still, in sense of freedom and spontaneity<br />\none work, her small Color Study in his wash studies of lions.<br />\nLast week the second annual<br />\nStudent Art Exhibit opened in<br />\nthe Eisenhower Library. The<br />\nshow represents the combined<br />\nefforts of graduate students and<br />\nfaculty members who have joined together to increase the level<br />\nof art consciousness on the Hopkins campus. The exhibit is<br />\nsmaller than its previous predecessor but the quality is generally quite adequate with numerous works representing various<br />\nstyles and approaches.<br />\n<br />\nThe works by Gabe Weisberg,<br />\ndone in oil crayon, are spontaneous, possibly too much so. The<br />\nworks captivate a viewer with<br />\ntheir strong color sequences suggesting moods of feeling are<br />\nquite intense, vibrating and<br />\nhumorous. The most successful<br />\nof the three studies is the smallest, where the colors and forms<br />\nare well balanced. Perhaps all<br />\nthe -works suffer because they<br />\nare too small, they seem to want<br />\nto burst the boundaries of their<br />\nsmall frames. The works could<br />\nhave been more impressive if<br />\nthey appeared as large abstract<br />\noil paintings.<br />\nThe two oil paintings by Sandra Hastings are also lively and<br />\ncolorful. They lack an understanding of abstract structure<br />\nwhich makes them fall apart.<br />\nHer understanding of color is<br />\nquite adequate but her formal<br />\narrangement in space is weak.<br />\nThe large paintings by Dr.<br />\nGeorge Owen represent a variety of styles from imitation Picasso, to amiable art nouveau,<br />\nto irridescent Pissarro. They<br />\nare, taken as a group, lacking<br />\nin originality although they are<br />\nlively and technically quite proficient. Dr. Owen has a good<br />\ngrasp of the oil painting medium<br />\nwhich could be carried further,<br />\nwith more time to devote to his<br />\ncanvases.<br />\n<br />\nPAGE FIVE<br />\nbeen more widely publicized,<br />\nboth on campus and off, and<br />\nthen the level of participation<br />\nwould have been wider. One can<br />\nonly hope that next years show<br />\nwill be stronger, wider and more<br />\ndiversified.<br />\n<br />\nWe need your head in our<br />\nbusiness<br />\n<br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie's<br />\n<br />\nor more this summer*<br />\nwith<br />\n<br />\nGood Humor<br />\nICE CREAM<br />\n* At least half the students working 13 weeks earned<br />\n$1500 or more. And here's what others earned .<br />\neven those working fewer weeks:<br />\n<br />\nlout of 2 $121<br />\nearned or more<br />\na week.<br />\n<br />\nlout of 3 $133<br />\nearned or more a<br />\n<br />\nweek.<br />\n<br />\nAll in all this exhibit is better than last year. It should have<br />\n<br />\nlout of 4 $139<br />\nearned or more a<br />\n<br />\nThe bigger<br />\n)the campus<br />\nthe better for<br />\n<br />\nweek.<br />\n<br />\nYou can earn as much or more this summer ...<br />\nand you need no sales experience. You're carefully trained and work on proven routes where<br />\npeople have been buying Good Humor for years.<br />\nEverything supplied, free<br />\n. there's nothing<br />\nto invest.<br />\n<br />\nHOW TO QUALIFY FOR INTERVIEW<br />\n1. Minimum age 18.<br />\n2. Need a valid driver's license ... and must be<br />\nable to drive a clutch transmission.<br />\n3. Be in good physical condition.<br />\n<br />\nREGISTER NOW<br />\nYou couldn't be more classic wearing Shakespeare. Rand Saddles are authentic<br />\nfrom the very first stitch to the last perforation. Smooth leather in black forest with<br />\nblack saddle. Black cherry with black saddle. Black with black saddle. Or black<br />\ncherry scotch grain leather with smooth black saddle. Rand Shoes $15.00 to<br />\n$25,00.<br />\n<br />\nAsk your Summer Placement Director or Student<br />\nAid Officer to schedule you for our campus visit.<br />\n<br />\nWouldn't you like to be in our shoes? Most of America is. International Shoe Co., St.<br />\nLouis, Mo:<br />\n<br />\nAvailable at these fine stores:<br />\nALANS SHOES<br />\n7905 Harford Rd.<br />\nBaltimore, Md.<br />\n<br />\nBRUCE STORES<br />\n6912 Arlington Rd.<br />\nBethesda, Md.<br />\noloomosalm.ffsmonlialifINIIIMPIfia<br />\n<br />\nAn Equal Opportunity Employer. (M/F)<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nCorrespondence<br />\n(Continued from Page 4)<br />\npatients of all ages have a great<br />\ndeal of misinformation and incomplete information about<br />\ndrugs, their benefits and hazards,<br />\nIs known by physicians. Patients who are crippled by addiction to heroin or other opium<br />\nproducts or to barbituates often<br />\ngive a history of experimentation with more benign drugs<br />\nyears ago. There have been reports, recently, of near disasters<br />\namong students who have experimented with the use of hallucinogenic agents. I have some<br />\nreason to believe that at least a<br />\nfew students here experiment<br />\n<br />\nwith unsupervised drug use in an<br />\nattempt to experience something<br />\nnew or to surmount an academic<br />\nor emotional crisis.<br />\nFor those interested, the Baltimore City Medical Society will<br />\npresent an educational television<br />\nprogram on Pep Pills and Tranquillizers on Sunday, March 6,<br />\nat 2:00 P.M., on channel 2. A<br />\nPhysician and pharmacist will<br />\ndiscuss these two classes of drugs<br />\nand the new Food and Drug Administration regulations governing their use.<br />\nRoy W. Chesnut, Jr., M.D.<br />\nDr. Chesnut is the Director of<br />\nthe Student Health Service.<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nComputers and the Single Girl<br />\nt(<br />\n<br />\n.)<br />\n<br />\n(Continued from Page 4)<br />\nNkrumah became city manager of<br />\nAtlanta, Georgia. Charles DeGaulle might be able to impart<br />\nsome stability to British government, while<br />\nHarold<br />\nWilson<br />\nmight be able to manage one<br />\nof the emergent African Nations. This reporter has little<br />\ndoubt that Lyndon Johnson<br />\ncould adequately govern Andora,<br />\nthat nation having no foreign<br />\npolicy, and the political leader<br />\nof Andora, whoever that may<br />\nbe, could run Central Park. Taken further this process would<br />\nprovide leaders for finance and<br />\nindustry, for education and for<br />\narts. It could create a Utopia<br />\nin our time because everyone<br />\nwould be where he belongs. The<br />\nonly problem: life would be so<br />\ndeadly dull with the rumbling<br />\nreasoner doing all the thinking<br />\nfor humanity that soon the<br />\nbrain would be reduced to the<br />\nsize of a walnut and the brain<br />\ndrain would take on new meaning. In the end the computers<br />\nwill decide which computers do<br />\nwhich jobs, and when the big<br />\nwhig computers (the ones at<br />\nHarvard), hear about cybernetics it's all over baby and those<br />\nof us whose minds are not transistorized can forget it. Wire up<br />\nor wash out. Plug in or perish.<br />\nAs it is now, though, we're<br />\nstill safe, and Operation Match<br />\nwill go the way of all good Hula<br />\nHoops. No corrugated cupid for<br />\nthis generation. Anyway, it'll<br />\nnever match the Goucher Pig<br />\nBook and Pikesville High.<br />\n<br />\nI L<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecorais Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Geeenniount Ave.<br />\nSPAGHETTI ME A LS<br />\nPIZZA PIE A SPECIACTT<br />\n<br />\nCARRY OUT SERVICE<br />\nCALL 889-3831<br />\n<br />\nBETA EDGED;<br />\nCLARK TAKES<br />\nDORM TITLE<br />\n<br />\nDO YOU HAVE<br />\nWHAT IT<br />\nTAKES TO BE<br />\nA LEADER?*<br />\n*If you do, don't settle for less.<br />\nIf you will complete your first two years of college this spring<br />\nand have not had ROTC training, you now have a special<br />\nopportunity to earn an Army officer's commission in the next<br />\ntwo years. You can qualify to fulfill your military obligation as<br />\nan officer while you study for a college degree in a field of<br />\nyour choice.<br />\nThrough a new two-year Army ROTC program you will<br />\nreceive leadership training and experience that will be valuable assets for the rest of your life, in either a military or a<br />\ncivilian career. You will receive an allowance of $40 each<br />\nmonth during your Junior and Senior years. If you desire, you<br />\n<br />\nmay request postponement of your military service while you<br />\ncomplete your studies for a graduate degree.<br />\nMost large business and industrial firms prefer the college<br />\ngraduate who has been trained and commissioned as an<br />\nofficer—who has the ability to organize, motivate and lead<br />\nothers—and who has had experience in accegting responalA<br />\nbilities beyond his years.<br />\nYou owe it to yourself to investigate this ienportant<br />\nportunity.<br />\nFor complete information on the new two-year Army<br />\nprogram see the Professor of Military Science on campuat,<br />\n<br />\nARMY ROTC<br />\n<br />\nRota<br />\n<br />\nBY JED P. LUCHOW<br />\nbasketball<br />\nA three month<br />\ncampaign ended this week wih<br />\nplayoff<br />\nchampionship<br />\ntwo<br />\ngames. Clark house of the frosh<br />\ndorms defeated Royce House of<br />\nthe upperclass dorms (43-33)<br />\nfor the dormitory trophy winie<br />\nBeta was edged (30-25) by Phi<br />\nSig in the fraternity championship.<br />\nTop Scorers—Fraternities<br />\nPhi Sig (9-1) led league A<br />\nfollowed by DU (8-2), Phi Gain<br />\n(7-3), Phi Ep (4-6), KA (2-8),<br />\nand AD (0-10). Bo Walker and<br />\nDon Harsh of DU were the<br />\nleague's top scorers with 110 and<br />\n106 points, respectively. High<br />\nscorers for the other houses<br />\nwere Pete Setnel (Phi Sig) 92,<br />\nBill Grenzer (KM 91, John<br />\nEverton (Phi Ep) 88, Downy<br />\nMcCarty (Phi Gam) 82, and<br />\nGreg Altshuh (AD) 78. Phi Sig<br />\nscored the greatest number of<br />\npoints offensively (455).<br />\nBeta, capturing league B, also<br />\nled with 408 points scorei offensively. The final tally showed<br />\nBeta with a 9-1 record, followed<br />\nby ATO (8-2), Sig Ep (5-5),<br />\nAEPi (4-6), ZBT (3-7), and<br />\nTEP (1-9). Todd Stowell (AEP1)<br />\n127 led the individual top scorers, trailed by Dave Komocki<br />\n(Sig Ep) 106, Tim Guilford<br />\n(Beta) 98, C. Smith (ATO) 96,<br />\nHam Easter (TEP) 87, and Bob<br />\nRosenthal (ZBT) 51.<br />\n(Continued on Page 7)<br />\n<br />\nFree Travel<br />\nThe American Field Service<br />\nforeign exchange program<br />\nneeds men over 21 years to<br />\nchaperone a three-week bus<br />\ntrip throughout the U.S. this<br />\nsummer. All expenses will be<br />\npaid (including transportation to and from the point of<br />\ndeparture). For more information regarding interviews<br />\ncontact Bob Butler, Box 405<br />\nor Greg Altschuh at the<br />\nNews-Letter office.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nNEWS -LETTER<br />\n<br />\nBETA EDGED<br />\n<br />\nClemen Presents<br />\nTurnbull Lecture<br />\nBALTIMORE, Feb. 28—The<br />\nTurnbull Memorial Lectures, being given this year by poets and<br />\nscholars from Germany, Spain,<br />\nEngland, France and the United<br />\nStates, will continue on March<br />\n8th with an address by Wolfgang Clemen, professor of English at the University of Munich.<br />\nDr. Clemen's lecture on \"The<br />\nSpirits in Shelley's Poetry\" will<br />\nbe given at 4 p.m. in the auditorium of the new classroom<br />\nbuilding.<br />\nin Bonn, Professor<br />\nBorn<br />\nClemen was educated at the universities of Heidelberg, Freiburg,<br />\nBonn and Cambridge. Before accepting his present post in 1946,<br />\nhe taught at the University of<br />\nCologne and the University of<br />\nKiel.<br />\nFrom 1948 until 1962. he<br />\nserved as Vice President of the<br />\nGerman Shakespeare Society<br />\nand co-editor of the Shakespeare<br />\nJahrbuch. He is a member of<br />\nthe Bavarian Academy of Sciences, a corresponding Fellow of<br />\nthe British Academy and a member of the Committee for Cultural Affairs in the German<br />\nForeign Office. In 1964 he was<br />\n.elected president of the Modern<br />\nHumanities Research Association.<br />\nProfessor Clemen has published several works in English<br />\n<br />\nHOP HOSTS<br />\nCONCLAVE<br />\nThe Newton H. White Athletic<br />\nCenter will host a meeting of<br />\ncoaches and athletic directors of<br />\nthe Middle Atlantic Conference<br />\nMonday.<br />\nAspects of all sports will be<br />\ndiscussed. In addition clinics will<br />\nbe held, along with meetings<br />\nconcerning rule changes, general<br />\nbusiness and the dispensing of<br />\nsports information.<br />\nDr. Eisenhower wi\" welcome<br />\nthe group at a luncheon at Levering Hall, The H Club will provide guides for tours.<br />\nGym classes will be suspended<br />\nMonday, but the Athletic Center<br />\nwill remain o.,en for free play<br />\nas usual.<br />\nAuthorized Jeweler For<br />\n<br />\nLongines. Wittnauer<br />\nBimlova and<br />\nWyler Watches<br />\n<br />\nROETH'S<br />\nJewelers and Opticians<br />\nEstablished 1910<br />\n<br />\n3120 Greenmount Avenue<br />\nBaltimore 18, Maryland<br />\n<br />\nBElmont 5-9561<br />\nWATCH REPAIRING<br />\n<br />\nAttention<br />\n<br />\nGRADUATE<br />\nSTUDENTS<br />\nSENIORS<br />\nOn Tuesday, March 15, 1966<br />\nDr. Richard Hedrich, Office of<br />\nEducation, Washington, D.C.<br />\nwill visit the campus to discuss professional careers in<br />\nthe U.S. Office of Education<br />\nwith interested Seniors and<br />\nGraduate Students. Arrange<br />\nfor a personal interview by<br />\nPlacement<br />\ncontacting<br />\nthe<br />\nBureau, 100 Whitehead Hall.<br />\nAppointments may be made<br />\nthrough March 11. 1966.<br />\n41<br />\n<br />\n(Continued from Page 6)<br />\n<br />\nincluding The Development of<br />\nShakespeare's Imagery, English<br />\nTragedy<br />\nbefore Shakespeare.<br />\nShakespeare's Soliloquies and<br />\nChaucer's Early Poetry.<br />\nThe Percy Turnbull Memorial<br />\nLectureship was established in<br />\n1889 by Mr. and Mrs. Lawrence<br />\nTurnbull of Baltimore to commemorate the name of their son,<br />\nPercy Graeme Turnbull, who<br />\ndied in 1887. The endowment<br />\nprovides for lectures on poetry<br />\nto be given at the University<br />\nby a scholar who has attained<br />\ndistinction as a writer or critical student of poetry.<br />\n<br />\nTop Scorers—Dormitories<br />\nIn the freshman dorms, the<br />\ncontest was much closer. Clark<br />\nand Baker ended their seasons<br />\nwith identical 7-1 records. In<br />\nthe division play-off game that<br />\nfollowed, Clark edged out Baker<br />\n45-43 for first place. They were<br />\nfollowed by Jennings (6-2),<br />\nLazear (4-4), Griffin (4-4),<br />\nGildersleeve (3-5), Adams (3-5),<br />\nHollander (2-6), and McCoy<br />\n(0-8).<br />\n<br />\nPAGE SEVEN<br />\n<br />\nCalli, Sulli Kudoed<br />\nHopkins cagers Jim Calli and<br />\nMike Sullivan we, nomed to<br />\nSouthern 13:vision 1\\1I1le Atlantic Conference All - Star<br />\nberths, hi7hlightt-,<br />\n;<br />\n- the annual<br />\nbasketball banquet.<br />\na second team pick, was<br />\nthe Jays' leading M.A.C. scorer<br />\nthis year with a 16.8 loop mark<br />\nand was presented with the<br />\nsquad's .M^st Valuable Player<br />\nAward at the Tuesday night affair.<br />\n<br />\nHomewood squad's Most Valuable Substitute.<br />\nOther awards presented at the<br />\nbanquet are as follows: Booster<br />\nClub \"Unsung Hero\" Award,<br />\nTom Gaebe; Outstanding Rebounder, Joe Carlton; and the<br />\nHenry S. Cohen Award, Willy<br />\nSchwenzfeier.<br />\nSenior Doyle Smith a manager on Jay cPcfe<br />\nfor four<br />\nyears, received a<br />\nin recognition of his on\"' -ling service.<br />\nDir^ctor of Ad. sions Robert<br />\nBilgrave. a Hopkins basketball<br />\ncoach of the late 1940's, was<br />\nguest speaker.<br />\n<br />\nIn addltion to his honorable<br />\nBen Lee of Clark easily took mention spot on the league team,<br />\nthe top individual scoring hon- Sullivan was picked as the<br />\nors with 191 points. Top scorers<br />\nfor each<br />\nhouse were<br />\nJeff<br />\nSchwartz (Hollander) 134. Artie<br />\nGuerin (Baker) 130, Harry Nyder (Lazear) 128, Jim Johnsen<br />\n(Adams) 117, Chuck Francis<br />\n3330 GREENMOUNT AVENUE<br />\n(Jennings) 102, Dennis Massey<br />\nDaily 8 A.M. to 6 P.M.<br />\n(Griffin) 100, John Gorczyk<br />\nLater in March, Professor (Gildersleeve)<br />\n91, and Phil Moss<br />\nMon.,<br />\nThurs.. Fri. Till 8 P.M.<br />\nT. B. L. Webster of the Univer(McCoy) 51. Baker led the leasity of London will continue the<br />\n\"WE WASH, DRY & FOLD\"<br />\ngue with 408 points.<br />\nseries. In April, the French poet<br />\nSAME DAY SERVICE<br />\nA<br />\nvery<br />\nstrong Royce team took<br />\nand critic, Michel Dugy, and the<br />\nSpanish poet and scholar, Jorge almost all the honors in the<br />\nGuillen. will also appear under upperciass dorm league. They<br />\nthe auspices of the Turnbull finished with the only 10-0 recin by 9 a.m.... out by 3 p.m.<br />\nLectureship.<br />\nord in this year's tournament.<br />\n<br />\nWAVERLY LAUNDROMAT<br />\n<br />\nSHIRTS—DRY CIYANING<br />\n<br />\nPROGRAMMERS<br />\n•TRWIEWEITEMB•TRWEWEITEM B•TRWSYSTEMEI•TRWEIYEITEM B.<br />\n<br />\nCOME JOIN<br />\nTHE<br />\n<br />\nACTION!<br />\nwith TRW Systems, who participate<br />\nIn 9 out of every 10 U.S. space launches<br />\nand has built and orbited more<br />\nspacecraft than anyone.<br />\nTRW diversification and growth means<br />\nunlimited career opportunities<br />\nexist for BS/MS graduates desirir g<br />\nComputer-Oriented professional positions.<br />\nYou are invited to discuss these<br />\nopportunities in Los Angeles and Houston,<br />\nwith members of TRW Systems' Computing<br />\nCenter when they visit your campus<br />\nMARCH 23rd<br />\n•TIRINSYSTEMBI•TRWEIYATEMS•TRWEIYEATEMB •TRWSYSTEMI3•<br />\nBS/MS degree candidates in Computer Science, Mathematics, Physics, Chemistry, and Engineering are invited<br />\nto Investigate careers at the Computation and Data<br />\nReduction Center (CDRC) of TRW Systems' new ultramodern facilities in Redondo Beach, California (near Los<br />\nAngeles International Airport) and in Houston, Texas.<br />\nGROWTH has been the by-word of TRW Systems since<br />\nIts founding over a decade ago. Having established<br />\nstandards of TECHNICAL EXCELLENCE in aerospace<br />\nand related fields, TRW now has new and important<br />\nopportunities for graduates who are or want to become<br />\ncomputer-oriented specialists.<br />\nAt TRW Systems specialists in scientific programming<br />\nare actively advancing the application of computer technology to underwater defense systems, Gemini and<br />\nApollo mission planning and analysis, advanced ballistic<br />\nmissile studies, advanced space probes, Mars studies<br />\n<br />\nand space communications systems. Our more than 250<br />\n<br />\nprogrammers and scientists are utilizing their backs<br />\ngrounds in mathematics, engineering, physics, chemistry,<br />\nand computer science both to resolve problems of the<br />\naerospace environment and to further advance the capability of computers and the computer sciences.<br />\nVitally involved in the nation's major space programs,<br />\nTRW Systems provides its personnel in scientific and<br />\nbusiness programming with three IBM 7094 systems.<br />\n<br />\nInstallation of an advanced GE 635 system is scheduled<br />\nfor 1966.<br />\n<br />\nPlease make arrangements with your Placement Office for<br />\ninterview appointment. Or, write College Relations, TRW<br />\nSystems, One Space Park, Redondo Beach, California.<br />\nTRW is an equal opportunity employer, male and female.<br />\n<br />\nTRWsysTEMS<br />\n<br />\n\fNEWS<br />\n<br />\nsip<br />\nNEWS -LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nG<br />\nFor M-D Finals<br />\n<br />\nrapplers Gunning<br />\n<br />\nIf it's been a season of alternating ups and downs, the varsity wrestling team is due to end<br />\nthe season on an up this weekend in the Mason-Dixon Championships.<br />\nCoach Dave Blizzard will send<br />\nRick Ellinson, Curt. Conner, Joe<br />\nGriggs, Ken Gurnmerson, and<br />\nJohn Sopka to the tourney. Also<br />\ntravelling are Doug Lippman,<br />\nBill Swartz, Larry Corman, John<br />\nGale, and Bill Hunt.<br />\nDefending champion Old Dominion. with good returnees, is<br />\nfavored to retain its title; but<br />\nBlizzard noted that the Jays'<br />\nHunt, should be seeded numberone in the heavyweight bracket<br />\nwhile Swartz will probably be<br />\nseeded second or third at 167.<br />\nRunners-Up<br />\nIn Mason-Dixon dual meet<br />\neompetition, the grapplers finished second with a 3-1 record.<br />\nAfter upsetting previously unbeaten Towson, they fell out of<br />\nfirst place by losing their final<br />\nmatch to Catholic U., 20-16.<br />\nthat he<br />\nBlizzard claimed<br />\nCouldn't find fault with anyone,<br />\nbut said that there were several<br />\nturning points.<br />\nHe singled out Sopka, noting<br />\nthat the junior pinned a man<br />\nwho had the edge in experience.<br />\nThree days earlier, the matmen had upset the Tigers 2119. Swartz, Corman, and Hunt<br />\nwere Blizzard's big winners. They<br />\nenabled the Jays not only to recover from a 13-19 deficit going<br />\nInto the last four matches but<br />\nto win on Hunt's pin.<br />\nMoves Up<br />\nSwartz, usually at 165, moved<br />\nUp to 177 for the match while<br />\nGUITAR<br />\nFOR SALE<br />\nMartin 0021 N. Y. Guitar<br />\nCall 669-546'1<br />\n<br />\nLETTER<br />\n<br />\n177 pounder Corman wrestled<br />\nat 191.<br />\nRick Ellinson, at 123. started<br />\nthings off right for the grapplers with a win on a decision.<br />\nNext, Curt Conner got pinned<br />\nbut co-captain Griggs won by<br />\nforfeit when his man was injured.<br />\nThen, fighting off his back,<br />\nSopka lost the next match, leavig the score tied 8-8. After three<br />\nmore losses they got back on<br />\ntheir feet as Swartz took his<br />\nbout when his man was injured.<br />\n<br />\nLacrosse Outlook<br />\n<br />\nStickers Lack Tried Attack<br />\nThe News-Letter presents the<br />\nfirst of a series of previews of<br />\nthe '66 varsity lacrosse team.<br />\nToday's article focuses on the<br />\nattack.<br />\nProblem number one for the<br />\nvarsity lacrosse team is that it<br />\nlacks a ready-made offense for<br />\nthe first time in years.<br />\nCoach Bob Scott goes into<br />\nthis week carrying sixteen sophomores, an untried attack. a<br />\nbasically good midfield that lacks<br />\ndepth, a top-notch defense, and<br />\na big question mark in the goal.<br />\nGone from last year's team<br />\n<br />\nTennis Preview<br />\n<br />\nVet Netmen Stronger<br />\n\"We seem to have the horses<br />\nto go all the way,' declared varsity tennis coach Tommy McDermott Tuesday.<br />\nHe pointed to preliminary<br />\nscouting reports and five returning veterans to back up his<br />\nclaim. On the lineup again this<br />\nyear are captain Joe Sorrow,<br />\nMark Ellenbogen, Bob Childers,<br />\nMike Day, and Ken Larson.<br />\nBarry Butler, Roger Evans,<br />\nKen Battenfeld, Tom Clash,<br />\nand George Wood are also bidding for first team berths.<br />\nThe netmen wound up in second-place in the Northern Division of the Mason-Dixon Conference last year with a 5-3<br />\nthe<br />\nof<br />\nrecord. Strongpoint<br />\ndoubles department were Sorrow and Childers, who at least<br />\nonce defeated the duos of vaunted Loyola and Randolph-Macon.<br />\nAccording to McDermott, LarDay<br />\nand<br />\nEllenbogen,<br />\nsen,<br />\nshould give much strength to<br />\nthe middle of the ladder this<br />\nyear.<br />\nMcDermott noted that de-<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br />\n<br />\nfending champion RandolphMacon and Loyola should again<br />\nbe strong contenders, although<br />\nboth have lost, two top men.<br />\nWith a fifteen man turnout,<br />\nMcDermott was quick to name<br />\nhis frosh tennis prospects \"the<br />\nbest in years.\"<br />\nIncluded in the frost' roster<br />\nare Jeff . Sienkiewicz. Marty<br />\nMetz, Mike Marcey, Terry Rich<br />\narcison, Stephen Diamond, Nabby Bronstein, and Dana Lowry.<br />\nAlso out are Greg Lantz, Mike<br />\nYachmetz, Dan Weinberger, Al<br />\nGoldman, Jim Bernstein, Paul<br />\nGiblin, Tim Schell, and Jim<br />\nJacobs.<br />\n<br />\nGOOD THINGS COME<br />\nAND GOOD THINGS GO<br />\n<br />\nthat was second-ranked nationally are the attack trio of Jerry<br />\nPfeifer, Chip Giardina, and<br />\nSkip Darrell. The attack will also<br />\nbe missing Bob Carter and Al<br />\nHuston for a least a month and<br />\nJoe Cowan for the season.<br />\nPlayed Crease<br />\nCowan's problem is a fused<br />\ndisc—a condition aggravated by<br />\nearly-season football practice.<br />\nMeanwhile, both Huston and<br />\nCarter are recovering from knee<br />\noperations. Huston played crease<br />\nattack and midfield for the '65<br />\nvarsity while Carter played the<br />\nsame spots for the froth.<br />\nTwo sopohmores. consequently,<br />\nare expected to carry the load<br />\non attack. Both have size and<br />\nexperience, however. Phil Kneip,<br />\nfrom Severn High School. Is<br />\n8'1\", 185 pounds; and Downy<br />\nMcCarty, an All-MSA ballplayer<br />\nfrom Friends School, is 61\", 165.<br />\nBoth Threats<br />\nTop freshman scorer with<br />\ntwenty-three goals. Kneip has a<br />\ntremendously hard shot. He was<br />\nmost effective on the crease last<br />\nyear but will probably be used<br />\nbehind the goal.<br />\nMcCarty should be Scott's replacement for Pfeifer as a dodging threat. The soph notched<br />\n---------<br />\n<br />\nBALTIMORE'S NEWEST<br />\nHONDA DEALER<br />\nIS NOW OPEN!<br />\n<br />\nBecause the good food at the<br />\nHarry Little Carry-Out Shops<br />\nMake it so!<br />\n<br />\nHARRY LITTLE<br />\nCarry-Out SHOPS<br />\n407 East 32nd Street<br />\n<br />\neight goals and four assists In<br />\n'65 and shoots well both right<br />\nand left-handed.<br />\nAnother possibility at attack<br />\nis Herb Fredeking, who played<br />\nfreshman ball at Cornell but was<br />\nineligible here last year as a<br />\ntransfer student. \"He has more<br />\nexperience behind,\" Scott noted,<br />\n\"but I'm working with him on<br />\nthe crease because there's no one<br />\nelse.\"<br />\nBack Up<br />\nThe attack also features senior<br />\nDavid Hoffman, who has a year<br />\nof varsity and a year of freshman experience but has never<br />\nlettered; Gary Schreiber and<br />\nWayne Esaias, two juniors who<br />\nsaw limited action in the last<br />\ncampaign; and sophomore Rick<br />\nCollins.<br />\nScott pointed out, \"With McCarty and Kneip in the lineup<br />\nwe'll try for a little balance between our feeding game and<br />\ndodging game. We have some<br />\npretty good cutters at midfield<br />\nand should be able to get a lot<br />\nof goals out of them.\"<br />\nThe stickers, who have spent<br />\ntheir first week of practice in..<br />\ndoors, meet the Maryland La-.<br />\nCrOSSO Club in a scrimmage at<br />\n2:00 P.M. tomorrow.<br />\n<br />\nMARYLAND HONDA HOUSE<br />\n<br />\n\"everything from spokes to nuts\"<br />\n4710 Reisterstown Rd., Belle., Md..phone: 367-7447<br />\n•<br />\n------• CHOOSE PROM 20 MODELS<br />\n• LOW DOWN PAYMENT<br />\n• EASY inairm.v PAYMENTS<br />\n• FACTORY TRAINED MECHANICS<br />\n• COMPLETE LINE OF YESPAS, TOO!<br />\n<br />\n111•111 111•<br />\n<br />\nSpecial:<br />\n<br />\nSTUDENTS AND FACULTY<br />\n$35. p.m mow* iacluding utilities. Located facing Druid Hill Park,<br />\n9 blocks from Hopkins campus.<br />\n<br />\nSikorsky<br />\nAircraft<br />\n<br />\nNEWLY FURNISHED APARTMENTS WITH<br />\nNEW LUXURY FURNITURE.<br />\n<br />\nENGINEERING REPRESENTATIVES WILL BE ON CAMPUS<br />\nTO GIVE SENIORS AND GRADUATES COMPLETE DETAILS ON<br />\n<br />\nPhone 523-0276<br />\n<br />\n1 bedroom, for 2 *admits<br />\n2 bedrooms, for 4 students<br />\nWe make arrangements for roommates.<br />\nSpecial short term leases available.<br />\n<br />\nENGINEERING OPPORTUNITIES<br />\nWITH THE PIONEER AND LEADING MANUFACTURER<br />\nat VTOL AIRCRAFT<br />\n<br />\nThe New<br />\nChamber Orchestra<br />\nwith chorus and soloists<br />\n<br />\nSee your College Placement Office now<br />\nfor an appointment.<br />\n<br />\nSunday, March 13 at 8:30 p.m.<br />\nMonday, March 7<br />\n<br />\n%river<br />\n<br />\nHall, Students and Facially $1.00<br />\n<br />\nTickets at Public Relations Office<br />\nSiKORSKY AIRCRAFT. Stratified. Conn. 11 Division of United Aircraft Corp. N An Equal Opportunity Employer(N & F)<br />\n<br />\n\f", "format": "basic_html", "processed": "***<br /><br />\nNt111/3<br /><br />\nErtter<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, MARCH 4, 1966<br /><br />\nVOL. LXX, NO. 18<br /><br />\nRush ends;<br />\nfrats bid for<br />\n'69ers (no joke)<br /><br />\nREEXAMINED<br /><br />\ns•<br /><br />\n.<br /><br />\ne than does<br />\ndefinitely need a greater working knowledg<br />\nthe person who serves in a public court.\"<br />\nmeasure<br />\nGould does not consider the plan as a<br />\nHonor<br />\nPrimarily to increase the effectiveness of the<br />\ngreater<br />\nbeen<br />\nhave<br />\ns<br />\nviolation<br />\nhonor<br />\nAlthough<br />\nCode.<br />\nis \"not an<br />\nthis year than in the last few years, it<br />\nway of<br />\nalarming increase,\" he feels. \"There is no<br />\ndisregard<br />\ndetermining whether there exists a greater<br />\ninterest<br />\nfor the system or whether there is a greater<br />\ncheaters.\"<br />\nand concern motivating students to turn in<br />\nHonor<br />\nGould believes the latter, pointing out that the<br />\ng its<br />\nCommission has been more open in discussin<br />\nmarked<br />\nno<br />\nobserved<br />\nhas<br />\nhe<br />\nand<br />\nyear<br />\nthis<br />\ns<br />\nfunction<br />\nunderantipathy towards the Honor System among<br />\ngraduates.<br />\nGould's Plan<br />\nthe<br />\nAlthough not as yet completely formulated,<br />\nFirst,<br />\nPlan, in Gould's mind, will perform two tasks.<br />\nthe<br />\nIt will provide a seven man jury picked from<br />\nthe<br />\nundergraduate body and screened individually by<br />\n\"1.500<br />\nHonor Commission. \"Ideally,\" says Gould,<br />\nscreenShould be qualified to serve.\" Nevertheless, the<br />\nof<br />\naccused<br />\nperson<br />\nno<br />\nthat<br />\ninsure<br />\nto<br />\nattempt<br />\ning will<br />\nS violation will be tried by a biased or irresponsible<br />\njuror.<br />\nGould hopes that the initial step will be taken<br />\nnovice<br />\nby May. One alternative would be to place<br />\nJurors on the Appeal Board, where they would perform<br />\nthe relatively mechanical task of ascertaining whether<br />\ntunew evidence had been introduced or an unconsti<br />\ntional act committed. Another would be to pick two<br />\npanel<br />\nRon-Commission members to serve on the trial<br />\nwould<br />\ne<br />\nprocedur<br />\nThis<br />\n.<br />\nmembers<br />\nion<br />\nCommiss<br />\nWith five<br />\nfrom<br />\nbe gradually expanded until all seven were not<br />\nthe Commission.<br />\nPrerequisites<br />\nAt some point, says Gould, an election of the Honor<br />\nas a<br />\nCommission members would be held, with service<br />\nhip.<br />\nJuror a prerequisite for commission members<br />\nthereafter, sophomore members would be elected,<br />\nWhile junior and senior members would retain their<br />\nce<br />\nPositions. In this way, the desired factor of experien<br />\nWould be retained, while students would exert a<br />\ngreater degree of control over its membership. .<br />\nUnder this system, the Honor Commission would<br />\ntake on a mote administrative function.<br /><br />\nvlifi<br />\ni er<br /><br />\n70TH YEAR<br /><br />\nHop prexy<br />\npromises full<br />\ndorm food study<br /><br />\nMembers<br />\nto investigate<br />\nhonor changes<br />\nBy MEL SHUSTER<br />\ne of<br />\nA plan to effect major revisions in the structur<br />\ned<br />\nthe Honor Commission is currently being consider<br />\nby its members. Its purpose, according to Barry Gould,<br />\nd, will<br />\nWith whom the Idea originated and develope<br />\nstudent<br />\ngreater<br />\ne<br />\nencourag<br />\nand<br />\npossible<br />\nbe to make<br />\nparticipation in the Commission's functions<br />\nout in<br />\nBroad in scope, the plan would be carried<br />\nyears.<br />\nfive<br />\nas<br />\nperhaps,<br />\nlong,<br />\nas<br />\nperiod<br />\na<br />\nover<br />\nitages<br />\nAt the end of this time, the Honor Commission would<br />\nits<br />\nbe a democratically elected body, with part of<br />\nwhich<br />\njudicial role represented in a jury system in<br />\nany undergraduate with a clean record and deemed<br />\ne<br />\nresponsible by a Commission screening committe<br />\n*could serve.<br />\nTaking an \"evolutionary view,\" Gould sees the plan<br />\na<br />\nas a \"logical extension of the honor system, not<br />\nviolators<br />\nwith<br />\ndealt<br />\ndeans<br />\ny,<br />\nOriginall<br />\nradical change.\"<br />\nOf the Honor Code. After the second World War, this<br />\nrole was filled by the Student Council, until the Honor<br />\nebinmission was established ten years ago.<br />\nStudent Body's Role<br />\nof the<br />\nThe crucial question which arises is that<br />\nwillingreliability of the entire student body and its<br />\nCommisness to become such an integral part of the<br />\nsion structure. Gould believes that \"the students must<br />\nbe made aware through an orientation in depth of the<br />\nwill<br />\nfundamental principles of the Honor System, and<br /><br />\n4100-Ei<br /><br />\nTomorrow morning the sun will rise on Pledge<br />\ntrying<br />\nSaturday and mark the end of one of the most<br />\nAt<br />\nrush.<br />\ny<br />\nfraternit<br />\n,<br />\nschedule<br />\nHopkins<br />\nthe<br />\nperiods on<br />\nn will<br />\nnine o'clock a multitude of bleary eyed freshme<br />\nHall<br />\nrise, file silently and pensively over to Levering<br />\nies<br />\nwhere they will bid one. two, or three fraternit<br />\ne.<br />\npreferenc<br />\nof<br />\norder<br />\nin<br />\nchoice,<br />\nof their<br />\nAt the same time one unlucky fraternity man from<br />\neach of the thirteen houses involved in rush this year<br />\nwill march to Levering Hall to deliver the bid list for<br />\nhis fraternity. This drama having played itself out,<br />\nas it does each year on Pledge Saturday, rush will be<br />\nover, and it will remain only for the various fraternities to pick up their hopeful charges and envelop<br />\nthem in the protective arms of fraternalism.<br />\nRush this year proceeded much as it has in the<br />\npast, with a handful of minor violations being handed<br />\ndown by the I.F.C., but no major breaches of rush<br />\nregulations taking place. A note of interest was added<br />\nby the crackdown on beer carried out by the Baltimore City Police in conjunction with a massive revamping of the department. This caused the I.F.C. to<br />\nsuspend the serving of beer for rush in an attempt<br />\nto preserve itself and the fraternity system.<br />\nA large percentage of the class of '69 is expected<br />\nto go fraternity. This, coupled with the facts that the<br />\nclass is the largest in Hopkins history, and that Phi<br />\nKappa Psi eliminated itself from rush by violating<br />\nthe terms of its social probation promises growth for<br />\nmost of the houses on campus. The tone, going into<br />\nPledge Saturday, is optimistic, both among the freshmen and the fraternities.<br /><br />\n3 Penny Opera<br />\ncomplete sellout<br />\nTheatre Hopkins will present Bertolt Brecht and<br />\n5,<br />\nKurt Weill's, \"The Threepenny Opera,\" on March<br />\nper6, 12, 19, 26, and 27 at 8:30. Tickets for all<br />\nstudents<br />\nformances are now sold-out, but optimistic<br />\nwaiting<br />\ndesiring tickets can put their names on the<br />\nwill<br />\nnces<br />\nPerforma<br />\nOffice.<br />\ns<br />\nRelation<br />\nPublic<br />\nthe<br />\nlist at<br />\nbe held at the Barn.<br />\non,<br />\nEdward J. Golden. who will direct the producti<br />\ncommented, \"The play is perfectly suited to the Barn,<br />\nnas it was originally designed for cabaret entertai<br />\nment.\" Golden went on to say that this is the Baltimore premiere of the twentieth-century classic. Director Golden described the cast as extremely talented.<br />\n\"It isn't very often we get people who can act and<br />\nsing.\" he stated. Thomas Conlin will conduct and<br />\nmusically direct the production.<br />\non,<br />\nRelating some of the difficulties of producti<br />\nthe<br />\nin<br />\nformed<br />\nbeen<br />\nhad<br />\ncast<br />\nthe<br />\nhow<br />\ntold<br />\nGolden<br />\nsummer, but the odd hour rehearsals had kept the<br />\ns<br />\npressure building toward opening night. Costume and<br />\nsettings are from the Twenties, differing from the<br />\noriginal play which had a Victorian setting, but the<br />\nHopkins production will remain true to Brecht's book<br />\nand Weill's music. On the subject of the ticket sell-out,<br />\nGolden remarked that even the dress rehearsals were<br />\nplaying to packed houses.<br />\nCast Of Characters<br />\nFeatured in the production are Ralph Piersanti as<br />\nMack the Knife and Fran Mahr as Pirate Jenny.<br />\nThree Hopkins students; Rick Wessier, Stephen Jarrett and John Green play the members of Mack the<br />\nKnife's gang. A fourth, Bill Oberreit, plays the<br />\nPoliceman.<br /><br />\nBy JOE WEINBERG<br />\nDr. Milton S. Eisenhower, president of the UMversity, promised a full investigation of the food served<br />\nIn the dormitory cafeteria in a special meeting at<br />\nHomewood House March 1. Dr. Eisenhower responded<br />\nto a 415 signature petition presented to him at the<br />\nmeeting by three Hopkins freshmen. Plant manager of<br />\nthe University Wesley Taylor, in whose department<br />\nthe food service belongs, will conduct the investigation.<br />\nThe petition, which was organized by freshmen Bob<br />\nGayle, Richard Hammond, Bruce McLeish and Mark<br />\nOlman, asked for an investigation of the \"inferior<br />\nquality of the food,\" because \"the apparent lack of<br />\n.quality constitutes a serious detriment to our health<br />\nand morale.\" Included in the copies of the petition<br />\npresented to the administration were more specific<br />\ncomplaints such as the small size and quality of the<br />\nmeat, the lack of proteins in the diet, the greasiness of<br />\nthe meat, the shortage of garden vegetables and fresh<br />\nfruits, and the cleaning of the silver and glassware.<br />\nDr. Eisenhower expressed a deep concern for the<br />\nsituation in the cafeteria and promised action. Ham-.<br />\nmond, Olman, Gayle, and Taylor will meet next Tues.<br />\nday at 10:00 A.M. to further discuss the situation.<br />\nLaShaw Concerned<br />\nMr. Howard LaShaw, director of the food service,<br />\nalso expressed concern over the students' complaints.<br /><br />\nREEXAMINED<br />\nThe director stated that he would personally prepare<br />\nthe menus for the dormitory and that \"I'll be there<br />\nphysically nine-tenths of the day. I will be right there<br />\nfor all meals, observing the cooking.\" Mr. LaShaw<br />\nhoped to be able to talk to students during the meals<br />\nIn order to hear specific complaints. \"I'll very definitely<br />\nbe up there from here on out,\" he repeated. \"We do<br />\nwant suggestions. The door is open every meal and<br />\nplease stop by with any suggestions at all. We will be<br />\nmore than glad to listen to them and put them into<br />\neffect. The fellows live here nine months out of the<br />\nyear and we certainly want to try to keep thent<br />\nhappy.\"<br />\nIn addition to personally supervising the dormitory<br />\ncafeteria, LaShaw is surveying the menu's from the<br />\npast years to see if there really is lack of protein in the<br />\nplanned diet. He also explained that the service only<br />\nbuys top quality meats and other foods.<br />\nGov't Stamped<br />\nAll canned foods bear a certificate of quality and<br />\ncondition from the U.S. Department of Agriculture<br />\nwhich checks that the cans meet the specifications.<br />\nThe service only buys top grade, U.S. Choice- or U.S.<br />\nGood meat The government classifies meat as prime,<br />\nchoice, good, and commercial in order of quality.<br />\nLa Shaw emphasized that he was very interested in<br />\nspecific complaints such as greasy food, and that<br />\nthese would be acted upon promptly. He was puzzled<br />\nover what was different this year than other years<br />\nthat the students should think that the food had become exceptionally bad. \"The cooks are the same<br />\npeople, the procedure the same, the meat quality is<br />\nthe same.\"<br />\nStudent Views<br />\nStudent opinion in the dormitories seemed to agree<br />\nwith the tone of the petition. Toby Simon, a senior,<br />\nstated that \"the extremely bad quality of the dormitory food seems to be part of the general policy of<br />\nletting the dormitory facilities decay and becoming<br />\nless desirable to live in. Since I've been here the food<br />\nhas gotten worse. Especially upsetting to me is the<br />\nunappetizing appearance of the food and the knowledge that the meat in particlar is of such low quality.<br />\nThe DSRC's insistence on going through channelo<br />\n(Continued on Page 31<br /><br />\nPAGE TWO<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE. MARCH 4, P9'615<br /><br />\nP-Ball In Grads Given 'Arms' SC Knocks SDS,<br />\nWhite Gym<br /><br />\nThe<br />\nUniversity<br />\nannounced long term future of the UniMonday that it has purchased versity.\"<br />\nthe Cambridge Arms Apartments<br />\nInsures Accommodations<br />\nThe annual DSRC-sponsored<br />\nat Charles and 34th Streets for<br />\nMr. Taylor continued, \"After<br />\nPajama Ball is scheduled for<br />\nconversion to graduate student weighing all considerations, we<br />\nThe Student Council severely<br />\nSaturday, March 12, from 9 P.M.<br />\nfelt that we must take advantage criticized SDS for continuing to<br />\nliving quarters.<br />\nof the opportunity to purchase use the name \"The Johns Hopto 1 A.M, in the Gym. Dress will<br />\nThis announcement was made the Cambridge Arms in order to kins Chapter\" without meeting<br />\nbe casual.<br />\nfurther our efforts to insure that certain requirements. Also, the<br />\nMusic will be provided by The by Wesley A. Taylor, assistant to our graduate<br />\nstudents, both Council hopes to implement the<br />\nthe<br />\npresident<br />\nfor<br />\nbuildings and<br />\nBritish Walkers and The Newmarried and unmarried, have recommendations of one of its<br />\ngrounds.<br />\nsuitable living accommodations committees by compiling and<br />\nports. The British Walkers, contrary to name, is a WashingtonLocated across Charles Street convenient to the University as printing a course guide to supbased rock and roll band that opposite the Homewood campus, they pursue their important plement the brief course descripstudies and research.\"<br />\ntions given in the Catalogue.<br />\nhas appeared at many clubs and the apartment building is the<br />\nThe letter further points out<br />\nThe IPC has arranged for<br />\nsocial functions in the Balti- third<br />\ncommercial<br />\napartment that the University \"recognizes<br />\nfreshmen to submit their bids<br />\nmore - Washington area. The complex purchased by the Uni- that all tenants would not be<br />\nthis Saturday from 9 to 11 a.m.<br />\nNewports is also a local group, versity for student housing. able to vacate the building im- in Levering Hall, accompani<br />\ned<br />\nmediately.<br />\nHowever,<br />\nthe Uni- by a $5 fee. The fraternity houses<br />\nand the two bands will attempt Previous purchases have been<br />\nto furnish continuous entertain- made possible by Federal loans, versity hopes to achieve sub- will submit their lists at 11 a.m.<br />\nstantial student occupancy by and unbiased IFC shadchan<br />\nim<br />\nand an application for funds to<br />\nment through the evening.<br />\nthe fall of 1966.\"<br />\nwill perform the match-making.<br />\nfinance the current project is<br />\nTickets for the dance are<br />\nMr. Taylor went on to say that Freshmen will be notified of the<br />\npending.<br />\navailable at $3.50 per couple and<br />\nshould any of the tensnts so de- final decisions at about 2 p.m.<br />\nmay be obtained in the LeverIn a letter addressed to all sire, his office would be glad to<br />\nA Council committee met with<br />\ning Hall YMCA office and dorm residents of the building, Mr. assist them in their search<br />\nfor students and faculty<br />\nof<br />\ncafeteria and through the fra- Taylor<br />\nsaid,<br />\n\"All<br />\npossible other accommodations.<br />\nGoucher College to discuss posternity and dorm houses. Set-ups thought has been given to our<br />\nHopkins purchased the Brad- sible coordination of curricula<br />\nwill be provided, and table res- obligations to our neighbors ford apartments,<br />\nat 33rd and St. between the two schools. One<br />\nervations can be made, at $2 prior to taking this important Paul<br />\nStreets, in 1947, and the Goucher faculty member had<br />\nper table of 5 couples, in the step, but the fact remains that Greenway<br />\nApartments,<br />\nnow reservations about the desiraStudent Shop or ins301 Royce.<br />\nwe have a responsibility to the called McCoy Hall, late in 1963. bility of<br />\nany such arrangement<br /><br />\nGouch Fac Cracked<br /><br />\n111••••••••••<br /><br />\nbecause he felt that Hopkiti,<br />\ncourses do not meet Gouch.<br />\n41<br />\nstandards.<br />\nSDS Title<br />\nA senior member submitlat<br />\nevidence that SDS was still u/E0<br />\ning the name \"Johns Hopkitti<br />\nChapter,\" although they hay!<br />\nnot yet submitted a. constit<br />\nCouni<br />\n9<br />\ntion for approval<br />\nro<br />\nby the Coune<br />\nAfter heated debate, the<br />\ndetermined to call the SDS lead<br />\ners before the Council to<br />\nplain their actions.<br />\nThe Course Guide Conunittse<br />\nInformed the Council that cour<br />\nguides have proven very suc<br />\nful at other colleges, and<br />\nHopkins such a guide would n ,<br />\nonly help students in makil<br />\ncourse selections, but would gi professors an idea of how ther<br />\ncould improve their teaching<br />\ntechniques.<br /><br />\nMed<br /><br />\nLecture<br /><br />\n\"Medicine in the Soviet<br />\nUnion\" will be the title of the<br />\ninaugural William H. Welch<br />\nlecture to be given by Dr.<br />\nRussell A. Nelson, president<br />\nof the Johns Hopkins Hospital, March 9 in the classroom<br />\nBuilding at 4 p.m.<br /><br />\nThe \"in\" thing to do<br />\nis catch Olds 88 Swing Fever.<br /><br />\nWhen you can't<br />\nafford to be dull,<br />\nsharpen your wits<br />\nwith NODOZTM<br />\n1<br />\nNoDoz Keep Alert Tablets fight oft<br />\nthe hazy, lazy feelings of mentai<br />\nsluggishness. NODOZ helps restore<br />\nyour natural mental vitality.., helps<br />\nquicken physical reactions. You be.<br />\ncome more naturally alert to people<br />\nand conditions around you. Yet<br />\nNODOZ is as safe as coffee. Anytime<br />\n...when you can't afford to be dull,<br />\nsharpen your wits with NoDoz.<br />\n(<br /><br />\nSAFE AS COFFEE<br /><br />\nSo<br /><br />\nhere. Catch! You're now a candidate<br />\nfor an Olds 88, one of the<br />\nmost formidable machines ever to touch rubber to road! Delta, Dynamic and Jetstar<br />\n88—eleven<br />\nToronado-inspired models in all—ready to rocket you into spring. Each comes<br />\non with standard<br />\nsafety items like windshield washers, back-up lights, more! So buckle up (seat belts are<br />\nstandard, too) and take the cure! At your Oldsmobile Dealer's! LOOK TO OLDS FOR THE NEW!<br />\nAvailable at:<br /><br />\n7000NADO • MbNITY-IIMMIT • ULU Is • DYNAMIC II* 1I7II7A2<br />\nOA • CUTLASS• F-AS• MA7A.CAUSSCII*STARYINE • 4.44<br /><br />\n,76-1<br />\nY9 OUT FRONT<br />\n...in a RocketAction Carl<br /><br />\n1 OLDSMOBILE BY pm<br />\nmom vow 70 00 MINIM Mt ACTION IS.,.<br /><br />\nGREENWAY<br />\nPHARMACY<br /><br />\nYOSAI LOCAL AUTMOORIO 01011000111 QUALITY HAM 'TODAY*<br /><br />\nCHARLES &amp; 34TH STS.<br /><br />\nPAGE THREE<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nCopland To Speak Mandelbaum Schedules Talks<br />\nOn Modern Music<br />\nAaron Copland. noted Amer- I known works are El Salon Mexican composer and conductor, ico (1936), Billy the Kid (1938),<br />\nwill speak on \"Recent Trends in Rodeo (1942) and The AppalaContemporary Music\" at Hop- chian Spring (1944).<br />\nkins Thursday, March 10 at<br />\nHe is currently vice-president<br />\n4 p.m.<br />\nof the Koussevitsky Foundation,<br />\nHe will be introduced to the a member of the Edward MacShrive/. Hall audience by Dr. Dowell Association, the AmeriPeter Herman Adler, Director of can Academy of Arts and Scithe Baltimore Symphony Or- ences, the Royal Academy of<br />\nchestra. On the preceding night, Music, and the American Society<br />\nMarch 9, Mr. Copland will con- of Composers, Authors and Pubduct the Baltimore Symphony lishers.<br />\nIn their performance at the<br />\nThe public is invited to attend.<br />\nLyric.<br />\nhis<br />\nreceived<br />\n66,<br />\nCopland,<br />\nMr.<br />\nMus. D. from Princeton University in 1956. Since then he<br />\nhas received honorary doctor<br />\ndegrees from Harvard. Temple,<br />\nBrandeis, Wesleyan and Oberlin.<br />\nIn 1944, he was awarded the<br />\nPulitzer Prize for Music; and,<br />\nIn 1945, he received the New<br />\nYork Music Critic's Award. His<br />\nfilm scare for the movie \"The<br />\nHeiress\" won him an Oscar in<br />\n1950.<br />\nAmong Mr. Copland's best<br /><br />\nSTUDENTS!<br />\nOf course you can<br />\nget a cash loan!<br />\n•Our new LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br />\n•Monthly repayments will<br />\nbe arranged to suit your<br />\nparticular circumstances.<br /><br />\nlowing a talk, each philosopher<br />\nwill hold a seminar with students<br />\nin the graduate course.<br />\nMandelbaum,<br />\nDr.<br />\nMaurice<br />\nchairman of the Philosophy Department, suggested several lectures of special interest to undergraduate students. On March<br />\n10, George L. Kline, an expert<br />\non Russian philosophy, will<br />\nspeak on \"The Existential Rediscovery of Hegel and Marx.\"<br />\nThe fololwing Thursday, James<br />\nM. Edie, a professor at Northwestern University, will discuss<br />\n\"Sartre as Phenomenologist and<br />\nas Existential Psychoanalyst.\"<br />\nThe concluding lecture on April<br />\n28, will be given by Albert Wil-<br /><br />\nliam Levi, who has been appointed by President Johnson as<br />\nthe Philosophy Consultant to the<br />\nnew Humanities Commission.<br />\nHis subject is \"Existentialism<br />\nand the Alienation of Man.\"<br />\nA new series of outstanding<br />\nlectures has been scheduled for<br />\nthe fall semester.<br /><br />\nBlue Key Society<br />\nAll interested sophomores<br />\nand juniors may pick up applications for membership in<br />\nthe Blue Key Society at the<br />\nadmissions office in the basement of Shriver Hall.<br /><br />\n• Pass this difficult<br />\nand challenging 7-part test<br />\nand win a free<br />\nGENIUS button!<br /><br />\nFood Study<br />\n(Continued from Page 1)<br />\nand their failure to make an<br />\nemphatic stand for students'<br />\nrights and the obligation of the<br />\nadministration has certainly not<br />\nhelped the matter.\"<br />\nThe threb freshmen student<br />\ncouncil representatives agreed<br />\non the issue. Ken Bonds said<br />\nthat the meals were unbalanced<br />\nand poorly prepared and that<br />\n\"the poor food is just one of the<br />\nmany facets of a university<br />\nundergraduate<br />\nneglects<br />\nthat<br />\nneeds and I think the situation<br />\ncould be handled very quickly if<br />\nthe responsible officials get together and planned out the very<br />\nbest food program the university<br />\ncan afford.\" Mike Michaelson<br />\ncomplained of the lack of protein and the excess of grease. \"In<br />\nview of the considerable price we<br />\nwe pay to eat in the cafeteria, a<br />\nlittle more nourishment and<br />\ntaste could certainly be expected.\" John Pell agreed and<br />\nsaid, \"It's not that It just tastes<br />\nbad, it's a health hazard, it<br />\nreally is.\"<br />\nDoyle Smith, president of the<br />\nDSRC, said, \"We've tried to do<br />\nwhat we can in terms of getting<br />\nthings cleared. We've tried!\"<br /><br />\nThe spring semester at Hopkins should be one of great philosophical ferment, for many of<br />\ncontemporary philosophy's great<br />\nminds will present their views<br />\non the theme of \"Phenomenology<br />\nand Existentialism,\" in corjunction with a graduate level course<br />\nof the same title. Although technical in presentation, the lectures are open to all students<br />\nand faculty of the University.<br />\nThe unprecedented series of lectures, which will . be compiled<br />\nand publishea in the future, will<br />\nbe held in Room 3 of the Classroom Building every Thursday<br />\nat 4 p.m. On the Fridays fol-<br /><br />\nMI<br /><br />\nEa ma<br /><br />\nEN mum<br /><br />\n111<br />\n111<br /><br />\n\"DIFFICULT AND CHALLENGING 7-PART TEST\"<br /><br />\nPart 1. Write your<br />\nname and school.<br />\nPart 2. Write your<br />\nstreet address.<br /><br />\n.<br /><br />\n1<br /><br />\nPart 3. Write the<br />\ncity where you live.<br /><br />\n2<br /><br />\nPart 4. Write the<br />\nstate where you<br />\nlive.<br /><br />\n3<br /><br />\nPart 5. What year<br />\nare you in at<br /><br />\n4<br /><br />\ncollege?<br /><br />\n5<br />\nPart 6. What field<br />\ndo you plan to be a-1111<br />\nGEnius in after<br />\ngraduating?<br /><br />\n6<br /><br />\n\"Room for GENIUSES,\" General Electric Company,<br />\nBox 215, Church St. Station, New York, N. Y.10046<br />\n.<br />\n.O<br />\ntP<br />\nPart 7. Now,cu<br />\n7<br />\nout and mail the<br />\n•<br />\ncoupon to General<br />\nElectric' at this<br />\naddress,<br /><br />\nIli ion um so se so um NE No IN NI so mu<br /><br />\nEa la III<br /><br />\nGeneral Electric is passing out GENIUS buttons. What's the point?<br />\none otn4s<br />\n004<br />\nroe<br />\ny,eePog<br />\ntecoong a<br /><br />\nII<br /><br />\nWe want to spread the word that<br />\nthere's room at General Electric<br />\nfor talented people who want<br />\nto take on big challenges.<br />\nWe like to call these people<br />\nGENIUSES. But what they're<br />\ncalled isn't so important as<br />\nwhere they're headed. And at the<br />\nGeneral Electric Company,<br />\nthere's plenty of room for<br />\nGENIUSES, no matter what<br /><br />\ntheir particular field of interest.<br />\nIf you want to be recognized for<br />\nyour talents come to General<br />\nElectric, where the young men<br />\nare important men.<br />\nAnd be among the first on your<br />\nca'mpus to own a genuine<br />\nGENIUS button. It will serve as<br />\na reminder that G.E. .and<br />\nGENIUS... and important<br />\nchallenges... all go together.<br /><br />\nXgtestIs ar Most Imporfant Phidvd<br />\n•Stop in or 'phone...We'll<br />\nbe glad to serve you.<br /><br />\nRitter,Nance<br />\n313 N. HOWARD ST.<br />\nBALTIMORE<br /><br />\nPhone SA 7-7880<br />\nHour,: Mons.. Tuetc. Wed.. 9-5;<br />\nThurs. 11-8; Fria. 9-6<br /><br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\nPAGE FOUR<br /><br />\nNEWS -LETTER<br /><br />\n1i' Ju1iiui*npkitis News-triter<br />\nEditors-in-Chief<br /><br />\nJ. r.kb<br /><br />\nDeachanel<br /><br />\nJames M. Freedma<br />\nSW111111,18 Managers<br /><br />\nWiIlim Schenek<br />\nFeatures Editor<br />\nHenry James Korn<br /><br />\nAlum n Endel I<br />\nNews Editor<br />\nMel Shuster<br /><br />\nGuilty until proven innocent<br />\nThe decision of the honor conmiission to make the<br />\npossession of master keys to Gilman, and other halls,<br />\nan honor violation over steps the logical jurisdiction<br />\nof the Honor Commission. Aside from the fact that the<br />\ndecision makes the assumption that a person has taken<br />\nunfair advantage of his fellow students prior to any<br />\nfact of violation—the commission has extended its power<br />\nof judgement from within. As an unrepresentative body<br />\nthe Honor Commission has no right to take such an<br />\naction, and while there is evidence that such action<br />\nshould be taken—the matter should have been considered by the student council or sonic other representative<br />\nbody. We support the student council in its protest of<br />\nthe honor commission's decision.<br />\nThe administration, as well, should have known<br />\nto approach the student council and not the honor<br />\ncommission on this matter, but the decision of the<br />\nhonor commission to accept the decision as their duly<br />\nis a violation of their responsibility to the student body.<br />\nWe hope that in the future the honor commission will<br />\nact more wisely—besides their assumption that mere<br />\npossession of a key is an honor violation is tantamount<br />\nto admission that the honor system does not work—even<br />\nwe do not believe that.<br /><br />\nGood Works:<br />\nThe Cost of Good Graces<br />\nIn the eyes of the Baltimore public, fraternities<br />\nare as bad as their worst member. 11 is a typically<br />\nmoronic view, but has made the fraternities appear, in<br />\nthe last few weeks, to he harbors of vice.<br />\nSince this view can not be ignored, it should he appeased at every opportunity. Such an opportunity has<br />\narisen, and we recommend very strongly that the fraternities let an image of their \"hest member.\" have a tilt] exposure.<br />\nA group of students and faculty are attempting<br />\nto raise money for a scholarship drive for gifted underprivileged students. The drive has received the support<br />\nof Theatre Hopkins which is giving three benefit performances of \"Boys from Syracuse,\" to mkt to the fund.<br />\nIf the benefit performances are to make any substantial contribution, there must be a massive ticket<br />\nsale; and this is where the fraternities can help.<br />\nThe plan is this: The fraternity will pledge to<br />\npurchase a certain number of tickets, 50 to 100 in<br />\nexcess of what its members will need for themselves.<br />\nFor the night of the performance, the fraternity invites<br />\n50 to 100 less-privileged or deprived children—ehildren<br />\nwho might otherwise never have the chance to see a play<br />\nor even enter legitimately into a college community,<br />\nmuch less a fraternity house—to attend the performance as its guests at its expense.<br />\nBy this plan, which will be administered through<br />\nthe office of special events and Joluni Synodinos, the<br />\nfraternities provide an essential boost to the scholarship<br />\ndrive; they give a young boy a glimpse of what the<br />\ninside of a theatre looks like; the fraternities show Baltimore their better half, by way of the prepared publicity to be done by John Synodinos; and the members<br />\nand their dates can enjoy themselves being mutually<br />\ngracious to an awed group of youngsters; A bargain<br />\nfor such a great deal of beneficence.<br />\nThe Committee of Special Events will administer<br />\nthe details of the program. It will invite the children,<br />\ngive extensive local and national publicity to the participating fraternities and handle the finances.<br />\nThough Fraternities would suffer no harm in trailing good works for good graces at this time, the project<br />\nneed not be as mercenary as all that. The project has a<br />\ntouching straightforwardness about it that is rare in<br />\ncommunity action. It is a realizable reform with almost<br />\nguaranteed success, in the form of a simple kindness.<br /><br />\nBad Books<br />\nNearly everyone is discontented with the bookstore.<br />\nThe Hopkins Chapter of Students for a Democratic<br />\nSociety acted favorably on a resolution for communalizing the bookstore. Though the floor expressed concern<br />\nthat the issue was irrelevant to the resolution, or that<br />\nacting on such a trivial matter might enfeeble the local<br />\nchapter, the resolution passed with ease,<br />\nAnd the News-Leiter applauds them on this conBCH SUS. The News-Letter also points out that when the<br />\nmajority of students complain about capitalistic oppression, when the long range planning committee supports their complaint, when even the post office is<br />\nheard to complain about their inefficiency and when<br />\nSDS is illing to compromise the resolution, something is bound to be wrong.<br /><br />\n1<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nThe diaotevioace Scene<br />\nKustom Kar Au Go Go<br /><br />\nBy HENRY J. KORN<br />\nWIR<br />\nIn most cities of the United<br />\nStates, hints of Spring include<br />\na general expansion of greenery<br />\nand some sunshine. In Baltimore,<br />\nSpring is heralded by the opening of the Custom Automobile<br />\nShow at the Civic Center.<br />\nWe were quick off the line<br />\nSaturday morning, had a low<br />\nE.T. to the sink, starred at our<br />\ncandy-apple eyes, and made a<br />\ntrophy run to the john. Inspired<br />\nby a taste for perverse craftmanship we decided to attend<br />\nthe show and placed a call to<br />\nWITH, inquiring as to whether<br />\nwe were still eligible for the<br />\nGo Go Dance contest as well.<br />\nThe young lady who mans the<br />\nphone at WITH was stunned by<br />\nour inquiry and reffered us to<br />\nan off-duty disc-jockey. \"This is<br />\nthe good-guy gang from the<br />\nNews-Letter, the paper from the<br />\nwierd, wondeful world of HopNews-Letter Discotheque Editor Pat Glista shown In an inkinsland,\" we said hoping to terview with Ted Jaffee of WITH radio. Our man on the<br />\nscene<br />\nmeet him at his own level of blows cool with wrinkly smile.<br />\nconversation. \"This<br />\nis<br />\nBob<br />\nGorden\" he said, may I help littered the floor, we made for judged. We were told that the<br />\nthe dance music blasting from girls were measured on a scale<br />\n.<br />\n. you?\"<br />\nof one hundred points against.<br />\nWe explained our position in the second tier.<br />\nmore lucid terms and Gorden,<br />\nThere we found a few thous- the criteria of dancing ability,<br />\nobviously glad to escape listen- and people looking up at a plat- poise, originality, conduct, looks,<br />\ning to the \"Green Berets\", form that boasted a group called figure and age. While realizing<br />\nchatted amiably and invited us \"Sonny and the Nomads\", six that it is difficult to compete<br />\nto attend as his guests. We im- contestants wearing teased with outright obscenity, we still<br />\nmediately placed a second call pants, and a panel of judges. entertained hope of a victory for<br />\nto a blond sociology major of While the contestants (obviously the American College Girl.<br />\nour acquaintance and asked if ensconced in the \"sell it while<br />\nBut we were betting against<br />\nshe was interested in doing some you have it\" syndrome) writhed H. L.<br />\nMencken, the W. C. Fields<br />\nfield work at the Civic Center about the stage, we made our of<br />\nAmerican letters, who, based<br />\nway through mobs of leather on<br />\nlater in the afternoon.<br />\na lifetime in Baltimore said,<br />\nSome time later, we arrived at. jacketed Tackle users.<br />\n\"nobody ever went broke underthe Lombard Street entrance of<br />\nWe registered our contestant estimating the taste of<br />\nthe<br />\nthe Civic Center., After a turn and inquired as to the standard American<br />\npeople.\" Predictably,<br />\nabout the metal flake hulks that against which she would be we lost.<br /><br />\nAb<br /><br />\ntirk<br /><br />\nOf Mice and Men, and I.B.M.<br />\nBy HENRY M. HOCHERMAN<br />\nPlato might have thought<br />\nabout it, and Asimov surely has,<br />\nbut in any case it started with<br />\nthe traffic light, and it has invaded the very spice of life, the<br />\nvery unmovable mover which<br />\nmakes the world go 'round. It's<br />\ncalled \"Operation Match\" and<br />\nwith its 1984ish overtones It<br />\nadds another layer to the My<br />\nlar world we call home.<br />\n. In a recent Look article, college students who had not already heard, were introduced to<br />\nthe newest of High-Camp inthings computer dating. Not the<br />\ndating of computers (like computer chess) but rather being<br />\nmatch-made by computer. Computer dating, as personified by<br />\nOpertion Match in Cambridge,<br />\nMassachusetts, is just another<br />\nanswer to the insecurities whicn<br />\nbeset us one and all. For a small<br />\nfee (two dollars) one is guaranteed five dates just like he<br />\n(or she. Instant happiness can<br />\nbe achieved with one's Gerard<br />\nGoddess, and transistorized tranquility is the order of the day.<br />\nHello?<br />\n000011001<br />\nthis<br />\nis<br />\n001100001, and I dig you 'cause<br />\nthe ticking thinker says it's so.<br />\nand I don't have the guts to<br />\ntry it on my own!<br />\nThe advantages, it seems, are<br />\nmany and varied, as is attested<br />\nto by the fact that match has<br />\nprocessed some 90,000 applications. It seems to this reporter,<br />\nhowever, that the disadvantages are greater. What of the<br />\njoy of the hunt, the anticipation<br />\nof things to come? What of the<br />\nchallenge which is life itself?<br />\nWhat of spontaneity? What, me<br />\nelectronic hardies, of luv?<br />\nShould such a match succeed,<br />\nwhat does one tell the gentle<br />\noffspring? Mommy and Daddy<br /><br />\nwere on the same tape and it's<br />\nlucky they were both A.C. or<br />\nyou'd still be an electron!<br />\nConsidering, however, the various successes of Operation<br />\nMatch, one has cause to think<br />\nthat computerized correlation<br />\nmight be utilized in other matters, some of greater import<br />\nthan the mere procurement of<br /><br />\neaVte<br /><br />\na date for an evening.<br />\nNations in need of leaders<br />\nmight fill out massive questionaires describing their needs,<br />\nwhile potential leaders filled out<br />\nsimilar questionaires describing<br />\ntheir abilities. Ian Smith might<br />\nbe able to fill in for Nkrumah in<br />\nGhana, while the unemployed<br />\n(Continued on Page 6)<br /><br />\nace<br /><br />\nwholly on misinformation. There<br />\nNo Joke<br />\nis, indeed, a very definite issue<br />\nTo the editor:<br />\nAlthough I am not a member as to how far the activities of the<br />\nof the Hopkins Graduate Club, Graduate Club should be exf was very disappointed to see tended. This Ls to be expected<br />\nthe way in which the Club's since the Club is a new organicxecutive board was ridiculed in zation whose role has never been<br />\nyour last issue. In especially poor completely defined.<br />\nHowever, I feel that the editaste was the half page cartoon<br />\nthat belittled individual members torial and especially the cartoon<br />\nof the board, mentioning five of of last week only added to the<br />\nconfusion, and thus constituted<br />\nthem by name.<br />\nConsidering what these and a a disservice to those members<br />\nfew other students have man- with valid criticisms as well as<br />\naged to accomplish in a short to the club's executive board.<br />\nperiod of time, it really seems<br />\nFrank Kujawa<br />\na shame that they should be<br />\nGeology Department<br />\nslapped in the face for their<br />\nefforts. To date they have, with<br />\nNo Dope<br />\nthe help of the administration, To the Editors:<br />\nset up a clubroom for graduate<br />\nIt is the opinion of many that<br />\nstudents, arranged for the use of the abuse of drugs is fairly comthis room by graduate groups mon among college students,<br />\nwhen the club is closed, set up especially on the West Coast and<br />\ninterdepartmental<br />\nathletic in the North-East. I am not<br />\nleagues,<br />\nsponsored<br />\ngraduate aware of any significant inciparties and folk-songs, and pub- dence of this behavior among<br />\nlished a directory of graduate Homewood students, which may<br />\nstudents. For all practical pur- reflect the absence of a problem<br />\nposes, none of the above existed here or the reluctance of stua year ago.<br />\ndents to bring this problem to<br />\nMoreover, in talking to sev- my attention.<br />\neral of the board members and<br />\nHowever, that young people<br />\nto two of the prime critics, I everywhere are interested in exfound that many of the objec- perimenting with new experis.<br />\ntions made in last week's News- ences seems obvious, and that<br />\nLetter were based partly or<br />\n(Continued on Page 6)<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nNEWS-LETTER<br /><br />\nArt Exhibit Success,But<br />\nNudes Leave Critic Cold<br />\nBy GABE WEISBERG<br /><br />\nof a nude, Miss Sonde comes<br />\nclose to stealing the exhibit. This<br />\nwork, done with a subtle range<br />\nof color, demonstrates a freedom<br />\nand spontaneity that is lacking<br />\nin some of her other works, most<br />\nnotable her larger oil painting<br />\nNegro Girl from Project Head<br />\nStart. The latter is an obvious<br />\ninspiration from the works of<br />\nEmile Nolde, who must have contributed to her small Color<br />\nStudy, but falls apart in composition. The young girl simply<br />\nThe easiest way to approach is not part of the entire<br />\nthe show is through the repre- painting.<br />\nsentational works. Gallyne is the<br />\nThe drawings by Betty Borger<br />\nbest example. His studies of emerge as a mixed blessing. Her<br />\nnudes in pencil and conte crayon study of Leaves is confused and<br />\nImpress a viewer with their im- disjointed; among the weakest<br />\nmense understanding of human of the representational pieces.<br />\nanatomy; but leave one quite Her large pencil Nude (possibly<br />\ncold with their response to hu- a self-portrait) is better alman feeling. The drawings fail though the drawing of the legs<br />\nto move a viewer. Thus, one can is weak. The large Cat Study is<br />\nbe impressed by Gallynes mas- the most satisfactory. Here she<br />\ntery of light, his subtle shading has taken a cat and placed the<br />\nof form, his technical versatility animal in a variety of positions.<br />\nbut not by his freedom or spon- This is the most intriguing<br />\ntaneity. The pieces are academic aspect of the drawing as the cat<br />\nstudies, worked out with minute suggests a time sequence in space<br />\nprecision, and if one asks for which revolves around the cennothing more from a work of tral form. As the cat gains moart they are excellent.<br />\nmentum it begins to emerge as<br />\nThe wood cuts by Suzanne a lion, an animal much fiercer<br />\nKolisch Sonde, some of which and stronger than a house variwere exhibited last year, are ety. Perhaps Miss Borger has<br />\nquite good. They show an ad- studied the works of Eugene<br />\nmirable understanding of form, Delacroix who shows a similar<br />\nspace and composition. Still, in sense of freedom and spontaneity<br />\none work, her small Color Study in his wash studies of lions.<br />\nLast week the second annual<br />\nStudent Art Exhibit opened in<br />\nthe Eisenhower Library. The<br />\nshow represents the combined<br />\nefforts of graduate students and<br />\nfaculty members who have joined together to increase the level<br />\nof art consciousness on the Hopkins campus. The exhibit is<br />\nsmaller than its previous predecessor but the quality is generally quite adequate with numerous works representing various<br />\nstyles and approaches.<br /><br />\nThe works by Gabe Weisberg,<br />\ndone in oil crayon, are spontaneous, possibly too much so. The<br />\nworks captivate a viewer with<br />\ntheir strong color sequences suggesting moods of feeling are<br />\nquite intense, vibrating and<br />\nhumorous. The most successful<br />\nof the three studies is the smallest, where the colors and forms<br />\nare well balanced. Perhaps all<br />\nthe -works suffer because they<br />\nare too small, they seem to want<br />\nto burst the boundaries of their<br />\nsmall frames. The works could<br />\nhave been more impressive if<br />\nthey appeared as large abstract<br />\noil paintings.<br />\nThe two oil paintings by Sandra Hastings are also lively and<br />\ncolorful. They lack an understanding of abstract structure<br />\nwhich makes them fall apart.<br />\nHer understanding of color is<br />\nquite adequate but her formal<br />\narrangement in space is weak.<br />\nThe large paintings by Dr.<br />\nGeorge Owen represent a variety of styles from imitation Picasso, to amiable art nouveau,<br />\nto irridescent Pissarro. They<br />\nare, taken as a group, lacking<br />\nin originality although they are<br />\nlively and technically quite proficient. Dr. Owen has a good<br />\ngrasp of the oil painting medium<br />\nwhich could be carried further,<br />\nwith more time to devote to his<br />\ncanvases.<br /><br />\nPAGE FIVE<br />\nbeen more widely publicized,<br />\nboth on campus and off, and<br />\nthen the level of participation<br />\nwould have been wider. One can<br />\nonly hope that next years show<br />\nwill be stronger, wider and more<br />\ndiversified.<br /><br />\nWe need your head in our<br />\nbusiness<br /><br />\nSt. Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross from Eddie's<br /><br />\nor more this summer*<br />\nwith<br /><br />\nGood Humor<br />\nICE CREAM<br />\n* At least half the students working 13 weeks earned<br />\n$1500 or more. And here's what others earned .<br />\neven those working fewer weeks:<br /><br />\nlout of 2 $121<br />\nearned or more<br />\na week.<br /><br />\nlout of 3 $133<br />\nearned or more a<br /><br />\nweek.<br /><br />\nAll in all this exhibit is better than last year. It should have<br /><br />\nlout of 4 $139<br />\nearned or more a<br /><br />\nThe bigger<br />\n)the campus<br />\nthe better for<br /><br />\nweek.<br /><br />\nYou can earn as much or more this summer ...<br />\nand you need no sales experience. You're carefully trained and work on proven routes where<br />\npeople have been buying Good Humor for years.<br />\nEverything supplied, free<br />\n. there's nothing<br />\nto invest.<br /><br />\nHOW TO QUALIFY FOR INTERVIEW<br />\n1. Minimum age 18.<br />\n2. Need a valid driver's license ... and must be<br />\nable to drive a clutch transmission.<br />\n3. Be in good physical condition.<br /><br />\nREGISTER NOW<br />\nYou couldn't be more classic wearing Shakespeare. Rand Saddles are authentic<br />\nfrom the very first stitch to the last perforation. Smooth leather in black forest with<br />\nblack saddle. Black cherry with black saddle. Black with black saddle. Or black<br />\ncherry scotch grain leather with smooth black saddle. Rand Shoes $15.00 to<br />\n$25,00.<br /><br />\nAsk your Summer Placement Director or Student<br />\nAid Officer to schedule you for our campus visit.<br /><br />\nWouldn't you like to be in our shoes? Most of America is. International Shoe Co., St.<br />\nLouis, Mo:<br /><br />\nAvailable at these fine stores:<br />\nALANS SHOES<br />\n7905 Harford Rd.<br />\nBaltimore, Md.<br /><br />\nBRUCE STORES<br />\n6912 Arlington Rd.<br />\nBethesda, Md.<br />\noloomosalm.ffsmonlialifINIIIMPIfia<br /><br />\nAn Equal Opportunity Employer. (M/F)<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SIX<br /><br />\nCorrespondence<br />\n(Continued from Page 4)<br />\npatients of all ages have a great<br />\ndeal of misinformation and incomplete information about<br />\ndrugs, their benefits and hazards,<br />\nIs known by physicians. Patients who are crippled by addiction to heroin or other opium<br />\nproducts or to barbituates often<br />\ngive a history of experimentation with more benign drugs<br />\nyears ago. There have been reports, recently, of near disasters<br />\namong students who have experimented with the use of hallucinogenic agents. I have some<br />\nreason to believe that at least a<br />\nfew students here experiment<br /><br />\nwith unsupervised drug use in an<br />\nattempt to experience something<br />\nnew or to surmount an academic<br />\nor emotional crisis.<br />\nFor those interested, the Baltimore City Medical Society will<br />\npresent an educational television<br />\nprogram on Pep Pills and Tranquillizers on Sunday, March 6,<br />\nat 2:00 P.M., on channel 2. A<br />\nPhysician and pharmacist will<br />\ndiscuss these two classes of drugs<br />\nand the new Food and Drug Administration regulations governing their use.<br />\nRoy W. Chesnut, Jr., M.D.<br />\nDr. Chesnut is the Director of<br />\nthe Student Health Service.<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nComputers and the Single Girl<br />\nt(<br /><br />\n.)<br /><br />\n(Continued from Page 4)<br />\nNkrumah became city manager of<br />\nAtlanta, Georgia. Charles DeGaulle might be able to impart<br />\nsome stability to British government, while<br />\nHarold<br />\nWilson<br />\nmight be able to manage one<br />\nof the emergent African Nations. This reporter has little<br />\ndoubt that Lyndon Johnson<br />\ncould adequately govern Andora,<br />\nthat nation having no foreign<br />\npolicy, and the political leader<br />\nof Andora, whoever that may<br />\nbe, could run Central Park. Taken further this process would<br />\nprovide leaders for finance and<br />\nindustry, for education and for<br />\narts. It could create a Utopia<br />\nin our time because everyone<br />\nwould be where he belongs. The<br />\nonly problem: life would be so<br />\ndeadly dull with the rumbling<br />\nreasoner doing all the thinking<br />\nfor humanity that soon the<br />\nbrain would be reduced to the<br />\nsize of a walnut and the brain<br />\ndrain would take on new meaning. In the end the computers<br />\nwill decide which computers do<br />\nwhich jobs, and when the big<br />\nwhig computers (the ones at<br />\nHarvard), hear about cybernetics it's all over baby and those<br />\nof us whose minds are not transistorized can forget it. Wire up<br />\nor wash out. Plug in or perish.<br />\nAs it is now, though, we're<br />\nstill safe, and Operation Match<br />\nwill go the way of all good Hula<br />\nHoops. No corrugated cupid for<br />\nthis generation. Anyway, it'll<br />\nnever match the Goucher Pig<br />\nBook and Pikesville High.<br /><br />\nI L<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecorais Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Geeenniount Ave.<br />\nSPAGHETTI ME A LS<br />\nPIZZA PIE A SPECIACTT<br /><br />\nCARRY OUT SERVICE<br />\nCALL 889-3831<br /><br />\nBETA EDGED;<br />\nCLARK TAKES<br />\nDORM TITLE<br /><br />\nDO YOU HAVE<br />\nWHAT IT<br />\nTAKES TO BE<br />\nA LEADER?*<br />\n*If you do, don't settle for less.<br />\nIf you will complete your first two years of college this spring<br />\nand have not had ROTC training, you now have a special<br />\nopportunity to earn an Army officer's commission in the next<br />\ntwo years. You can qualify to fulfill your military obligation as<br />\nan officer while you study for a college degree in a field of<br />\nyour choice.<br />\nThrough a new two-year Army ROTC program you will<br />\nreceive leadership training and experience that will be valuable assets for the rest of your life, in either a military or a<br />\ncivilian career. You will receive an allowance of $40 each<br />\nmonth during your Junior and Senior years. If you desire, you<br /><br />\nmay request postponement of your military service while you<br />\ncomplete your studies for a graduate degree.<br />\nMost large business and industrial firms prefer the college<br />\ngraduate who has been trained and commissioned as an<br />\nofficer—who has the ability to organize, motivate and lead<br />\nothers—and who has had experience in accegting responalA<br />\nbilities beyond his years.<br />\nYou owe it to yourself to investigate this ienportant<br />\nportunity.<br />\nFor complete information on the new two-year Army<br />\nprogram see the Professor of Military Science on campuat,<br /><br />\nARMY ROTC<br /><br />\nRota<br /><br />\nBY JED P. LUCHOW<br />\nbasketball<br />\nA three month<br />\ncampaign ended this week wih<br />\nplayoff<br />\nchampionship<br />\ntwo<br />\ngames. Clark house of the frosh<br />\ndorms defeated Royce House of<br />\nthe upperclass dorms (43-33)<br />\nfor the dormitory trophy winie<br />\nBeta was edged (30-25) by Phi<br />\nSig in the fraternity championship.<br />\nTop Scorers—Fraternities<br />\nPhi Sig (9-1) led league A<br />\nfollowed by DU (8-2), Phi Gain<br />\n(7-3), Phi Ep (4-6), KA (2-8),<br />\nand AD (0-10). Bo Walker and<br />\nDon Harsh of DU were the<br />\nleague's top scorers with 110 and<br />\n106 points, respectively. High<br />\nscorers for the other houses<br />\nwere Pete Setnel (Phi Sig) 92,<br />\nBill Grenzer (KM 91, John<br />\nEverton (Phi Ep) 88, Downy<br />\nMcCarty (Phi Gam) 82, and<br />\nGreg Altshuh (AD) 78. Phi Sig<br />\nscored the greatest number of<br />\npoints offensively (455).<br />\nBeta, capturing league B, also<br />\nled with 408 points scorei offensively. The final tally showed<br />\nBeta with a 9-1 record, followed<br />\nby ATO (8-2), Sig Ep (5-5),<br />\nAEPi (4-6), ZBT (3-7), and<br />\nTEP (1-9). Todd Stowell (AEP1)<br />\n127 led the individual top scorers, trailed by Dave Komocki<br />\n(Sig Ep) 106, Tim Guilford<br />\n(Beta) 98, C. Smith (ATO) 96,<br />\nHam Easter (TEP) 87, and Bob<br />\nRosenthal (ZBT) 51.<br />\n(Continued on Page 7)<br /><br />\nFree Travel<br />\nThe American Field Service<br />\nforeign exchange program<br />\nneeds men over 21 years to<br />\nchaperone a three-week bus<br />\ntrip throughout the U.S. this<br />\nsummer. All expenses will be<br />\npaid (including transportation to and from the point of<br />\ndeparture). For more information regarding interviews<br />\ncontact Bob Butler, Box 405<br />\nor Greg Altschuh at the<br />\nNews-Letter office.<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nNEWS -LETTER<br /><br />\nBETA EDGED<br /><br />\nClemen Presents<br />\nTurnbull Lecture<br />\nBALTIMORE, Feb. 28—The<br />\nTurnbull Memorial Lectures, being given this year by poets and<br />\nscholars from Germany, Spain,<br />\nEngland, France and the United<br />\nStates, will continue on March<br />\n8th with an address by Wolfgang Clemen, professor of English at the University of Munich.<br />\nDr. Clemen's lecture on \"The<br />\nSpirits in Shelley's Poetry\" will<br />\nbe given at 4 p.m. in the auditorium of the new classroom<br />\nbuilding.<br />\nin Bonn, Professor<br />\nBorn<br />\nClemen was educated at the universities of Heidelberg, Freiburg,<br />\nBonn and Cambridge. Before accepting his present post in 1946,<br />\nhe taught at the University of<br />\nCologne and the University of<br />\nKiel.<br />\nFrom 1948 until 1962. he<br />\nserved as Vice President of the<br />\nGerman Shakespeare Society<br />\nand co-editor of the Shakespeare<br />\nJahrbuch. He is a member of<br />\nthe Bavarian Academy of Sciences, a corresponding Fellow of<br />\nthe British Academy and a member of the Committee for Cultural Affairs in the German<br />\nForeign Office. In 1964 he was<br />\n.elected president of the Modern<br />\nHumanities Research Association.<br />\nProfessor Clemen has published several works in English<br /><br />\nHOP HOSTS<br />\nCONCLAVE<br />\nThe Newton H. White Athletic<br />\nCenter will host a meeting of<br />\ncoaches and athletic directors of<br />\nthe Middle Atlantic Conference<br />\nMonday.<br />\nAspects of all sports will be<br />\ndiscussed. In addition clinics will<br />\nbe held, along with meetings<br />\nconcerning rule changes, general<br />\nbusiness and the dispensing of<br />\nsports information.<br />\nDr. Eisenhower wi\" welcome<br />\nthe group at a luncheon at Levering Hall, The H Club will provide guides for tours.<br />\nGym classes will be suspended<br />\nMonday, but the Athletic Center<br />\nwill remain o.,en for free play<br />\nas usual.<br />\nAuthorized Jeweler For<br /><br />\nLongines. Wittnauer<br />\nBimlova and<br />\nWyler Watches<br /><br />\nROETH'S<br />\nJewelers and Opticians<br />\nEstablished 1910<br /><br />\n3120 Greenmount Avenue<br />\nBaltimore 18, Maryland<br /><br />\nBElmont 5-9561<br />\nWATCH REPAIRING<br /><br />\nAttention<br /><br />\nGRADUATE<br />\nSTUDENTS<br />\nSENIORS<br />\nOn Tuesday, March 15, 1966<br />\nDr. Richard Hedrich, Office of<br />\nEducation, Washington, D.C.<br />\nwill visit the campus to discuss professional careers in<br />\nthe U.S. Office of Education<br />\nwith interested Seniors and<br />\nGraduate Students. Arrange<br />\nfor a personal interview by<br />\nPlacement<br />\ncontacting<br />\nthe<br />\nBureau, 100 Whitehead Hall.<br />\nAppointments may be made<br />\nthrough March 11. 1966.<br />\n41<br /><br />\n(Continued from Page 6)<br /><br />\nincluding The Development of<br />\nShakespeare's Imagery, English<br />\nTragedy<br />\nbefore Shakespeare.<br />\nShakespeare's Soliloquies and<br />\nChaucer's Early Poetry.<br />\nThe Percy Turnbull Memorial<br />\nLectureship was established in<br />\n1889 by Mr. and Mrs. Lawrence<br />\nTurnbull of Baltimore to commemorate the name of their son,<br />\nPercy Graeme Turnbull, who<br />\ndied in 1887. The endowment<br />\nprovides for lectures on poetry<br />\nto be given at the University<br />\nby a scholar who has attained<br />\ndistinction as a writer or critical student of poetry.<br /><br />\nTop Scorers—Dormitories<br />\nIn the freshman dorms, the<br />\ncontest was much closer. Clark<br />\nand Baker ended their seasons<br />\nwith identical 7-1 records. In<br />\nthe division play-off game that<br />\nfollowed, Clark edged out Baker<br />\n45-43 for first place. They were<br />\nfollowed by Jennings (6-2),<br />\nLazear (4-4), Griffin (4-4),<br />\nGildersleeve (3-5), Adams (3-5),<br />\nHollander (2-6), and McCoy<br />\n(0-8).<br /><br />\nPAGE SEVEN<br /><br />\nCalli, Sulli Kudoed<br />\nHopkins cagers Jim Calli and<br />\nMike Sullivan we, nomed to<br />\nSouthern 13:vision 1\\1I1le Atlantic Conference All - Star<br />\nberths, hi7hlightt-,<br />\n;<br />\n- the annual<br />\nbasketball banquet.<br />\na second team pick, was<br />\nthe Jays' leading M.A.C. scorer<br />\nthis year with a 16.8 loop mark<br />\nand was presented with the<br />\nsquad's .M^st Valuable Player<br />\nAward at the Tuesday night affair.<br /><br />\nHomewood squad's Most Valuable Substitute.<br />\nOther awards presented at the<br />\nbanquet are as follows: Booster<br />\nClub \"Unsung Hero\" Award,<br />\nTom Gaebe; Outstanding Rebounder, Joe Carlton; and the<br />\nHenry S. Cohen Award, Willy<br />\nSchwenzfeier.<br />\nSenior Doyle Smith a manager on Jay cPcfe<br />\nfor four<br />\nyears, received a<br />\nin recognition of his on\"' -ling service.<br />\nDir^ctor of Ad. sions Robert<br />\nBilgrave. a Hopkins basketball<br />\ncoach of the late 1940's, was<br />\nguest speaker.<br /><br />\nIn addltion to his honorable<br />\nBen Lee of Clark easily took mention spot on the league team,<br />\nthe top individual scoring hon- Sullivan was picked as the<br />\nors with 191 points. Top scorers<br />\nfor each<br />\nhouse were<br />\nJeff<br />\nSchwartz (Hollander) 134. Artie<br />\nGuerin (Baker) 130, Harry Nyder (Lazear) 128, Jim Johnsen<br />\n(Adams) 117, Chuck Francis<br />\n3330 GREENMOUNT AVENUE<br />\n(Jennings) 102, Dennis Massey<br />\nDaily 8 A.M. to 6 P.M.<br />\n(Griffin) 100, John Gorczyk<br />\nLater in March, Professor (Gildersleeve)<br />\n91, and Phil Moss<br />\nMon.,<br />\nThurs.. Fri. Till 8 P.M.<br />\nT. B. L. Webster of the Univer(McCoy) 51. Baker led the leasity of London will continue the<br />\n\"WE WASH, DRY &amp; FOLD\"<br />\ngue with 408 points.<br />\nseries. In April, the French poet<br />\nSAME DAY SERVICE<br />\nA<br />\nvery<br />\nstrong Royce team took<br />\nand critic, Michel Dugy, and the<br />\nSpanish poet and scholar, Jorge almost all the honors in the<br />\nGuillen. will also appear under upperciass dorm league. They<br />\nthe auspices of the Turnbull finished with the only 10-0 recin by 9 a.m.... out by 3 p.m.<br />\nLectureship.<br />\nord in this year's tournament.<br /><br />\nWAVERLY LAUNDROMAT<br /><br />\nSHIRTS—DRY CIYANING<br /><br />\nPROGRAMMERS<br />\n•TRWIEWEITEMB•TRWEWEITEM B•TRWSYSTEMEI•TRWEIYEITEM B.<br /><br />\nCOME JOIN<br />\nTHE<br /><br />\nACTION!<br />\nwith TRW Systems, who participate<br />\nIn 9 out of every 10 U.S. space launches<br />\nand has built and orbited more<br />\nspacecraft than anyone.<br />\nTRW diversification and growth means<br />\nunlimited career opportunities<br />\nexist for BS/MS graduates desirir g<br />\nComputer-Oriented professional positions.<br />\nYou are invited to discuss these<br />\nopportunities in Los Angeles and Houston,<br />\nwith members of TRW Systems' Computing<br />\nCenter when they visit your campus<br />\nMARCH 23rd<br />\n•TIRINSYSTEMBI•TRWEIYATEMS•TRWEIYEATEMB •TRWSYSTEMI3•<br />\nBS/MS degree candidates in Computer Science, Mathematics, Physics, Chemistry, and Engineering are invited<br />\nto Investigate careers at the Computation and Data<br />\nReduction Center (CDRC) of TRW Systems' new ultramodern facilities in Redondo Beach, California (near Los<br />\nAngeles International Airport) and in Houston, Texas.<br />\nGROWTH has been the by-word of TRW Systems since<br />\nIts founding over a decade ago. Having established<br />\nstandards of TECHNICAL EXCELLENCE in aerospace<br />\nand related fields, TRW now has new and important<br />\nopportunities for graduates who are or want to become<br />\ncomputer-oriented specialists.<br />\nAt TRW Systems specialists in scientific programming<br />\nare actively advancing the application of computer technology to underwater defense systems, Gemini and<br />\nApollo mission planning and analysis, advanced ballistic<br />\nmissile studies, advanced space probes, Mars studies<br /><br />\nand space communications systems. Our more than 250<br /><br />\nprogrammers and scientists are utilizing their backs<br />\ngrounds in mathematics, engineering, physics, chemistry,<br />\nand computer science both to resolve problems of the<br />\naerospace environment and to further advance the capability of computers and the computer sciences.<br />\nVitally involved in the nation's major space programs,<br />\nTRW Systems provides its personnel in scientific and<br />\nbusiness programming with three IBM 7094 systems.<br /><br />\nInstallation of an advanced GE 635 system is scheduled<br />\nfor 1966.<br /><br />\nPlease make arrangements with your Placement Office for<br />\ninterview appointment. Or, write College Relations, TRW<br />\nSystems, One Space Park, Redondo Beach, California.<br />\nTRW is an equal opportunity employer, male and female.<br /><br />\nTRWsysTEMS<br /><br />\nNEWS<br /><br />\nsip<br />\nNEWS -LETTER<br /><br />\nPAGE EIGHT<br /><br />\nG<br />\nFor M-D Finals<br /><br />\nrapplers Gunning<br /><br />\nIf it's been a season of alternating ups and downs, the varsity wrestling team is due to end<br />\nthe season on an up this weekend in the Mason-Dixon Championships.<br />\nCoach Dave Blizzard will send<br />\nRick Ellinson, Curt. Conner, Joe<br />\nGriggs, Ken Gurnmerson, and<br />\nJohn Sopka to the tourney. Also<br />\ntravelling are Doug Lippman,<br />\nBill Swartz, Larry Corman, John<br />\nGale, and Bill Hunt.<br />\nDefending champion Old Dominion. with good returnees, is<br />\nfavored to retain its title; but<br />\nBlizzard noted that the Jays'<br />\nHunt, should be seeded numberone in the heavyweight bracket<br />\nwhile Swartz will probably be<br />\nseeded second or third at 167.<br />\nRunners-Up<br />\nIn Mason-Dixon dual meet<br />\neompetition, the grapplers finished second with a 3-1 record.<br />\nAfter upsetting previously unbeaten Towson, they fell out of<br />\nfirst place by losing their final<br />\nmatch to Catholic U., 20-16.<br />\nthat he<br />\nBlizzard claimed<br />\nCouldn't find fault with anyone,<br />\nbut said that there were several<br />\nturning points.<br />\nHe singled out Sopka, noting<br />\nthat the junior pinned a man<br />\nwho had the edge in experience.<br />\nThree days earlier, the matmen had upset the Tigers 2119. Swartz, Corman, and Hunt<br />\nwere Blizzard's big winners. They<br />\nenabled the Jays not only to recover from a 13-19 deficit going<br />\nInto the last four matches but<br />\nto win on Hunt's pin.<br />\nMoves Up<br />\nSwartz, usually at 165, moved<br />\nUp to 177 for the match while<br />\nGUITAR<br />\nFOR SALE<br />\nMartin 0021 N. Y. Guitar<br />\nCall 669-546'1<br /><br />\nLETTER<br /><br />\n177 pounder Corman wrestled<br />\nat 191.<br />\nRick Ellinson, at 123. started<br />\nthings off right for the grapplers with a win on a decision.<br />\nNext, Curt Conner got pinned<br />\nbut co-captain Griggs won by<br />\nforfeit when his man was injured.<br />\nThen, fighting off his back,<br />\nSopka lost the next match, leavig the score tied 8-8. After three<br />\nmore losses they got back on<br />\ntheir feet as Swartz took his<br />\nbout when his man was injured.<br /><br />\nLacrosse Outlook<br /><br />\nStickers Lack Tried Attack<br />\nThe News-Letter presents the<br />\nfirst of a series of previews of<br />\nthe '66 varsity lacrosse team.<br />\nToday's article focuses on the<br />\nattack.<br />\nProblem number one for the<br />\nvarsity lacrosse team is that it<br />\nlacks a ready-made offense for<br />\nthe first time in years.<br />\nCoach Bob Scott goes into<br />\nthis week carrying sixteen sophomores, an untried attack. a<br />\nbasically good midfield that lacks<br />\ndepth, a top-notch defense, and<br />\na big question mark in the goal.<br />\nGone from last year's team<br /><br />\nTennis Preview<br /><br />\nVet Netmen Stronger<br />\n\"We seem to have the horses<br />\nto go all the way,' declared varsity tennis coach Tommy McDermott Tuesday.<br />\nHe pointed to preliminary<br />\nscouting reports and five returning veterans to back up his<br />\nclaim. On the lineup again this<br />\nyear are captain Joe Sorrow,<br />\nMark Ellenbogen, Bob Childers,<br />\nMike Day, and Ken Larson.<br />\nBarry Butler, Roger Evans,<br />\nKen Battenfeld, Tom Clash,<br />\nand George Wood are also bidding for first team berths.<br />\nThe netmen wound up in second-place in the Northern Division of the Mason-Dixon Conference last year with a 5-3<br />\nthe<br />\nof<br />\nrecord. Strongpoint<br />\ndoubles department were Sorrow and Childers, who at least<br />\nonce defeated the duos of vaunted Loyola and Randolph-Macon.<br />\nAccording to McDermott, LarDay<br />\nand<br />\nEllenbogen,<br />\nsen,<br />\nshould give much strength to<br />\nthe middle of the ladder this<br />\nyear.<br />\nMcDermott noted that de-<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 4, 1966<br /><br />\nfending champion RandolphMacon and Loyola should again<br />\nbe strong contenders, although<br />\nboth have lost, two top men.<br />\nWith a fifteen man turnout,<br />\nMcDermott was quick to name<br />\nhis frosh tennis prospects \"the<br />\nbest in years.\"<br />\nIncluded in the frost' roster<br />\nare Jeff . Sienkiewicz. Marty<br />\nMetz, Mike Marcey, Terry Rich<br />\narcison, Stephen Diamond, Nabby Bronstein, and Dana Lowry.<br />\nAlso out are Greg Lantz, Mike<br />\nYachmetz, Dan Weinberger, Al<br />\nGoldman, Jim Bernstein, Paul<br />\nGiblin, Tim Schell, and Jim<br />\nJacobs.<br /><br />\nGOOD THINGS COME<br />\nAND GOOD THINGS GO<br /><br />\nthat was second-ranked nationally are the attack trio of Jerry<br />\nPfeifer, Chip Giardina, and<br />\nSkip Darrell. The attack will also<br />\nbe missing Bob Carter and Al<br />\nHuston for a least a month and<br />\nJoe Cowan for the season.<br />\nPlayed Crease<br />\nCowan's problem is a fused<br />\ndisc—a condition aggravated by<br />\nearly-season football practice.<br />\nMeanwhile, both Huston and<br />\nCarter are recovering from knee<br />\noperations. Huston played crease<br />\nattack and midfield for the '65<br />\nvarsity while Carter played the<br />\nsame spots for the froth.<br />\nTwo sopohmores. consequently,<br />\nare expected to carry the load<br />\non attack. Both have size and<br />\nexperience, however. Phil Kneip,<br />\nfrom Severn High School. Is<br />\n8'1\", 185 pounds; and Downy<br />\nMcCarty, an All-MSA ballplayer<br />\nfrom Friends School, is 61\", 165.<br />\nBoth Threats<br />\nTop freshman scorer with<br />\ntwenty-three goals. Kneip has a<br />\ntremendously hard shot. He was<br />\nmost effective on the crease last<br />\nyear but will probably be used<br />\nbehind the goal.<br />\nMcCarty should be Scott's replacement for Pfeifer as a dodging threat. The soph notched<br />\n---------<br /><br />\nBALTIMORE'S NEWEST<br />\nHONDA DEALER<br />\nIS NOW OPEN!<br /><br />\nBecause the good food at the<br />\nHarry Little Carry-Out Shops<br />\nMake it so!<br /><br />\nHARRY LITTLE<br />\nCarry-Out SHOPS<br />\n407 East 32nd Street<br /><br />\neight goals and four assists In<br />\n'65 and shoots well both right<br />\nand left-handed.<br />\nAnother possibility at attack<br />\nis Herb Fredeking, who played<br />\nfreshman ball at Cornell but was<br />\nineligible here last year as a<br />\ntransfer student. \"He has more<br />\nexperience behind,\" Scott noted,<br />\n\"but I'm working with him on<br />\nthe crease because there's no one<br />\nelse.\"<br />\nBack Up<br />\nThe attack also features senior<br />\nDavid Hoffman, who has a year<br />\nof varsity and a year of freshman experience but has never<br />\nlettered; Gary Schreiber and<br />\nWayne Esaias, two juniors who<br />\nsaw limited action in the last<br />\ncampaign; and sophomore Rick<br />\nCollins.<br />\nScott pointed out, \"With McCarty and Kneip in the lineup<br />\nwe'll try for a little balance between our feeding game and<br />\ndodging game. We have some<br />\npretty good cutters at midfield<br />\nand should be able to get a lot<br />\nof goals out of them.\"<br />\nThe stickers, who have spent<br />\ntheir first week of practice in..<br />\ndoors, meet the Maryland La-.<br />\nCrOSSO Club in a scrimmage at<br />\n2:00 P.M. tomorrow.<br /><br />\nMARYLAND HONDA HOUSE<br /><br />\n\"everything from spokes to nuts\"<br />\n4710 Reisterstown Rd., Belle., Md..phone: 367-7447<br />\n•<br />\n------• CHOOSE PROM 20 MODELS<br />\n• LOW DOWN PAYMENT<br />\n• EASY inairm.v PAYMENTS<br />\n• FACTORY TRAINED MECHANICS<br />\n• COMPLETE LINE OF YESPAS, TOO!<br /><br />\n111•111 111•<br /><br />\nSpecial:<br /><br />\nSTUDENTS AND FACULTY<br />\n$35. p.m mow* iacluding utilities. Located facing Druid Hill Park,<br />\n9 blocks from Hopkins campus.<br /><br />\nSikorsky<br />\nAircraft<br /><br />\nNEWLY FURNISHED APARTMENTS WITH<br />\nNEW LUXURY FURNITURE.<br /><br />\nENGINEERING REPRESENTATIVES WILL BE ON CAMPUS<br />\nTO GIVE SENIORS AND GRADUATES COMPLETE DETAILS ON<br /><br />\nPhone 523-0276<br /><br />\n1 bedroom, for 2 *admits<br />\n2 bedrooms, for 4 students<br />\nWe make arrangements for roommates.<br />\nSpecial short term leases available.<br /><br />\nENGINEERING OPPORTUNITIES<br />\nWITH THE PIONEER AND LEADING MANUFACTURER<br />\nat VTOL AIRCRAFT<br /><br />\nThe New<br />\nChamber Orchestra<br />\nwith chorus and soloists<br /><br />\nSee your College Placement Office now<br />\nfor an appointment.<br /><br />\nSunday, March 13 at 8:30 p.m.<br />\nMonday, March 7<br /><br />\n%river<br /><br />\nHall, Students and Facially $1.00<br /><br />\nTickets at Public Relations Office<br />\nSiKORSKY AIRCRAFT. Stratified. Conn. 11 Division of United Aircraft Corp. N An Equal Opportunity Employer(N &amp; F)<br /><br />"}], "field_media_file": [{"target_id": 40162, "display": null, "description": null, "target_type": "file", "target_uuid": "acf776c9-9fd6-43af-9ba6-eaf03b5aea7a", "url": "http://digital.library.jhu.edu/system/files/2022-03/13895-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13895, "target_type": "node", "target_uuid": "f7a787e1-b6e8-499d-a61b-bd99043d3867", "url": "/node/13895"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4ec0f1f7-834c-4c99-9bed-93c79cae725d"}]}