{"mid": [{"value": 38199}], "uuid": [{"value": "45376b54-31e6-42f3-9946-6c7f15954920"}], "vid": [{"value": 38199}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12766-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "kiting Ijiipftirni Nrius-TErttrr<br />\n<br />\nSENIORS!<br />\nPAY JUNE WEEK FEE<br />\nBY FRIDAY<br />\nVOL. XLI. No. 29<br />\n<br />\nDON'T FAIL TO HEAR<br />\nHAYS'\"FRAME-UPS\"<br />\nNEXT THURSDAY<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 9, 1937<br />\n<br />\nA. Garfield Hays Takes Latrobe Platform Bradford Says High Court Dubbed<br />\nR.O.T.C.AnnualBall Super-Legislature<br />\nNoted Legalist<br />\nWill Be In Levering By Prof. Corwin<br />\nTo Give Lecture<br />\nTownsman Orchestra Will Lecturer Applauds Roosevelt<br />\nProvide Music Nite Of<br />\nApril 30<br />\n<br />\n\"Frame-ups\" Subject Of Assembly Address Next<br />\nThursday<br />\n<br />\nCommittee Of Cadet Officers Tells Latrobe Audience That<br />\nExpects Dance To Be Best<br />\nTimes Demand New<br />\nHeld In Years<br />\nJudicial Outlook<br />\n<br />\nSIXTH LECTURE HERE<br />\nSpeaker Prominent As Member Of Civil Liberties<br />\nGroup<br />\n<br />\nCourt Plan In Every<br />\nDetail<br />\n<br />\n\"The annual function of the R.O.T.C.<br />\n•<br />\n<br />\nthe Military Ball, is to be held on<br />\nApril 30 in Levering Hall,\" announces<br />\n<br />\nBefore President<br />\nRoosevelt's<br />\nfireside talks this evening at 10.30,<br />\nDr. Thurman Arnold, professor of<br />\nconstitutional law at Yale University, will discuss the court proposal<br />\nat the Emerson Hotel. Dr. Kent<br />\nRoberts Greenfield, professor of<br />\nhistory here, will introduce the<br />\nspeaker. Senator Logan, of Kentucky, will speak before him. The<br />\nmeeting is open to the public.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n$10,..June_Week<br />\nFee Must Be<br />\nPaid By Mar.31<br />\n<br />\nBerry To Be At Fireside<br />\nFollowing in the footsteps of the<br />\nfirst Fireside Discussion Group,<br />\nwhich met last Thursday at President Bowman's home, another<br />\nmeeting will be held at Levering<br />\nHall at 4.15 this coming Thursday.<br />\nDean Edward Berry of the College<br />\nof Arts and Sciences will speak.<br />\nTwo sheets, one in Levering Hall,<br />\nand the other in the Postoffice, will<br />\nbe posted. Each is limited to ten<br />\nnames of people who will definitely<br />\nattend. In the future, when two<br />\nmeetings a week are planned, sheets<br />\nwill be posted in Levering Hall on<br />\nFriday before the meeting. These<br />\nwill hold notifications of the speakers, the topics, and the time of<br />\nthe meeting.<br />\n<br />\nWill Levy $1 Fine If Payment<br />\nIs Not Made By<br />\nDeadline<br />\nGALA WEEK PLANNED<br />\nJune Week May Be Dropped<br />\nUnless Financial Campaign<br />\nIs Successful<br />\n<br />\nUnless the financial program of the<br />\nJune Week .committee is successful,<br />\nmittee, James Bradford. Together<br />\nthe annual Senior Class festivities<br />\nprominent legal mind, will address<br />\nclimaxing the undergraduate careers<br />\nwith his confreres on the committee<br />\nthe student assembly this Thursday.<br />\nof Hopkins students will be disconhe will attempt to surpass the success<br />\nHis subject will be \"Frame-ups.\"<br />\ntinued this year, James Bradford,<br />\nof previous affairs.<br />\nChairman of the 1937 June Week anMt. Hays, an outstanding New<br />\nOxford<br />\nUniversity Grants Go nounced<br />\nNo sponsor has as yet been apyesterday.<br />\nYork lawyer, is a member of the<br />\npointed, but the Townsman OrchesAnnually To 32 U. S.<br />\n\"It is the plan of the committee,\"<br />\nCivil Liberties group, a body devot- Activities Committee Sched- tra has definitely been engaged. The<br />\nIn an address which, in the eyes of<br />\nsaid Bradford, \"to contact every memStudents<br />\ning itself to discussion and exposure<br />\nber of the Senior Class and have each<br />\nTownsmen are far from unfamiliar many, supplemented President Rooseules<br />\nOther<br />\nSpeakers<br />\nFor<br />\nof such matters as racial feeling,<br />\nThe Trustees of the thirty-two sign a promissory<br />\nvelt's of the previous evening, Prof.<br />\nnote to pay the<br />\nwith<br />\ncampus<br />\nthe<br />\nas<br />\nhave<br />\nthey<br />\nprelynching, and other like subjects.<br />\nLater Appearance<br />\nEdward S. Corwin, of Princeton Uni- Rhodes Scholarships assigned annu- sum of ten dollars ($10.00) by March<br />\nviously made appearances at the<br />\nA member of the Pi Lambda Phi<br />\nversity, last Friday aftern000n assail- ally to the United States released 31. A monetary penalty of one dolBernard Pinck, head of the Dorm Cotillion Board's Saturday<br />\nfraternity, a chapter of which is on<br />\nnight ed the Supreme Court<br />\nas a self-consti- application blanks and information lar will be levied if the payment is<br />\nActivities<br />\nCommittee, announced tothe Hopkins campus, Arthur Garfield<br />\ndances and last year's Military Ball. tuted super-legislature under the form pertaining to the securing of a schol- not made by that date.\"<br />\nHays has proved himself a domin- day that the group is resuming its<br />\nTheir excellent work then made a of a judicial body, uncontrolled by the arship this year to attend the UniMay Be Paid Thursday<br />\nating personality. His speeches are functions of last semester, starting<br />\nlasting<br />\nimpression as is witnessed by Constitution and its own precedents versity of Oxford in 1938. These scholThe fee may be paid immediately<br />\nthe<br />\nball<br />\nrolling<br />\nwith<br />\nan<br />\naddress<br />\nto<br />\ndirect and fearless in denunciation<br />\narships were established under the by seniors upon<br />\nas well.<br />\nbeing contacted by<br />\nbe delivered Wednesday night by Dr. their unanimous choice this year.<br />\nor praise, as the case may be.<br />\nwill of Cecil J. Rhodes, South African members<br />\nof the committee, or may<br />\nBall Annual Affair<br />\nG. Wilson Shaffer head of the athletics<br />\nlie further stated that \"the present<br />\nstatesman, who died in 1902. Outside be remitted<br />\nSacco-Vanzetti A Topic<br />\nto the committee in the<br />\ndepartment at the Hopkins. \"Due to<br />\nThe Military Ball is a regularly court does what it pleases in many of the United<br />\nStates scholarships are Board Room of<br />\nHe has already spoken six times at exams and the recent state<br />\nLevering Hall on<br />\nof turbu- scheduled social event in the Johns eases, is anti-labor and pro-utility, awarded<br />\nthroughout the British Em- Thursday and<br />\nthe Hopkins and has discussed a vari- lence in the dorms,\" said<br />\nFriday at 4.00 p. m.<br />\nPinck, \"the Hopkins Calendar, tendered to the an exponent of laissez-faireism, and pire.<br />\nety of topics. The Sacco-Vanzetti committee deemed it<br />\nBradford appealed to all Seniors<br />\nunwise to pre- student body once a year by the stands against government intervenTo be eligible a candidate must be a for<br />\ncase, in which he had an active part, sent a program of a social<br />\ntheir complete cooperation in the<br />\nnature. R.O.T.C. Department. At this year's tion in social welfare. However male<br />\ncitizen of the United States, be- matter.<br />\nRussia, Naziism, intolerance in the Now we are ready to continue<br />\n\"The existence and proporwith a dance there will be a tariff of about it has never hesitated to reach tween<br />\nthe ages of 19 and 25 on Octo- tions of<br />\nUnited States are some of the sub- full and varied program.\"<br />\nJune Week are wholly deone dollar and fifty cents; refresh- out for more and more powers itself. br, 1938. He<br />\nmust have completed at pendent upon the<br />\njects upon which he has touched in<br />\nprompt payment by<br />\nDr. Shaffer, the first of the speakers ments such as punch, cake, cookies, I favor its complete independence in least his Sophomore<br />\nyear at the time members of the<br />\nthese lectures.<br />\nSenior Class,\" he<br />\npeanuts, are the judicial field alone, but the diffi- of application.<br />\ninvited for this semester will talk on potato chips, and<br />\nadded.<br />\nLast year he spoke on peace, dis- and discuss the new Hopkins Ath- under consideration, but not definitely culty is that the court has set indefinReceives $2,000 A Year<br />\nA tentative June Week program<br />\ncussing certain peace resolutions. He letic plan. Due to the enthusiasm and decided; and the affair will begin at ite limits to its power. Under<br />\npresent<br />\nThe recipient of a Rhodes Scholarhas been drawn up, but emphasis was<br />\nparticipation<br />\nAmerican<br />\nalso spoke on<br />\ngreat pride displayed by the students ten and last until one.<br />\nconditions there is nothing that it ship is given four<br />\nhundred pounds laid on the<br />\nin the Olympic Games at that time. over this plan, it is predicted that<br />\nfact that no plans can be<br />\nThe members of the committee, all cannot do.<br />\nwhich, at the present rate of exchange<br />\ncarried out until some assurance has<br />\nMr. Hays, who received his law de- great interest will be shown tomorseniors,<br />\nare<br />\nBradford, captain\"Supporters of the New Deal (and is equal to abbut two thousand dolbeen obtained that the affair will be<br />\ngree at Columbia University, in 1905, row night at the address. The new<br />\nadjutant in the R.O.T.C. and chairman they naturally are desirous of an ac- lars a year for two years. The scholar<br />\nfinancially possible. Three dances,<br />\nhas had a career which has been plan will probably be discussed more<br />\nof the committee; Herbert Hoffman, tive government) who cannot stom- is allowed to study in any field he<br />\na banquet, and a beach club party<br />\nmarked by strong convictions since fully than it has been in the past, as<br />\nfirst lientenant; Guy Stark, leutenant; ach the president's proposal, now that pleases towards a B.A. or a research<br />\nare included in the temporary prothe day he was jailed in a Pennsyl- Dr. Shaffer will have but a small and Ernest Peiper,<br />\nex-officio member, it has been made, are fuzzyminded. degree. He is awarded a third year<br />\ngram of the June Week activities.<br />\nvania mining camp for his assertion group to deal with.<br />\nlieutenant in status.<br />\nThey do not realize that this is the of study only if he has a plan of<br />\nThere is a possibility that one of the<br />\nof the rights of free speech. Perhaps<br />\nDr. E. Kennerly Marshal of the<br />\nbest and quickest way of furthering study which he plans to follow in<br />\nthree dances will be the annual Interhis greatest fame arose in connection<br />\nHopkins Medical School is the next<br />\nsocial progress by democratic means. this year. The tenure of a scholarship<br />\nPlayshop<br />\nPresent<br />\nTo<br />\nKirkley<br />\nFraternity Ball, sponsored by the<br />\nwith his work as defense attorney in<br />\nspeaker on the committee's list. Dr.<br />\nHow otherwise can Mr. Roosevelt is dependent on the maintenance of<br />\nInter-Fraternity Board. In addition,<br />\nthe Scopes trial in Tennessee.<br />\nMarshal is a member of the commitThe Playshop of Johns Hopkins (as he remarked so aptly last even- the Scholar of a standard of work many athletic contests usually<br />\naugAttendance Voluntary<br />\ntee on admissions, and the pre- University will present, as its March ing) justify his administration, come and conduct which, in the opinion of<br />\nment the gala week of celebration.<br />\nIf past performances are any indi- medico's in the dorm are more than event, a lecture<br />\n1941,<br />\nthe<br />\nif<br />\nhas<br />\nhe<br />\nnot<br />\nTrustees,<br />\nevery<br />\nused<br />\nfair<br />\njustifies<br />\nhis<br />\nscholarship.<br />\nby Mr. Donald KirkA Junior Class representative of<br />\ncation, Mr. Hays' address will follow looking forward to meeting the doctor.<br />\nIn the words of the Committee of<br />\nley, dramatic critic of the Baltimore means within his power to make it<br />\nthe<br />\nJune Week Committee will be anthe lines of an expository address,<br />\nSelection, \"some definite quality of<br />\nFollowing Dr. Marshal will be Dr. Sun. His subject will be \"Maxwell effective?\"<br />\nnounced shortly. This appointment is<br />\nrunning<br />\ncomand<br />\n,examples<br />\nwith<br />\nRobert A. Wood of the physics de- Anderson,\" to be followed the same<br />\nA great many in the audience were distinction, whether in intellect, char- being watched<br />\nby all Juniors with inmentary. He will then draw a con- partment of the Hopkins, and Dr. evening<br />\nby dramatic readings, given unaware of Professor Corwin's po- acter or personality, or in any com- tense interest, because the<br />\nholder of<br />\nclusion and get a remedy, if such Mansfield Clark. Other speakers are by members of<br />\nthe Playshop organi- sition before he spoke, and appeared bination of these, is the most impor- this position automatically<br />\nbecomes<br />\nthere be.<br />\ntant<br />\nrequirement for a Rhodes Scholalso being considered, and informa- zation. The scheduled date is March shocked by his views on the judicial<br />\nchairman of next year's June Week<br />\nThe assembly will be under the tion will be printed in the NEWS- sixteenth.<br />\narship.<br />\nIt<br />\nis<br />\nupon<br />\nthis<br />\nthat<br />\nCommit( Continued on Page 3, Col. 2)<br />\nCommittee. Several more Seniors will<br />\nsponsorship of the Student Council. LETTER as plans become definite.<br />\ntees in each district will insist. Sucalso be added to the committee.<br />\nThe meeting will be held, as usual,<br />\ncess in being elected to office in stuThe Dormitory Activities commitBesides Bradford, Gordon B. DickLatrobe 120 at 11.30, following the<br />\ndent organizations may or may not<br />\ntee is at present making arrangeler,<br />\nDavid Erck, H. W. Gambrill, R.<br />\nnew plan of voluntary attendance. ments<br />\nbe evidence of leadership in the true<br />\nfor its big social event, the<br />\nE. Hopper, Charles Rostov, and John<br />\nattend.<br />\nAll students are invited to<br />\nsense of the word. Mr. Rhodes eviannual dorm spring dance. Whether<br />\nS. Stevens are in charge of the June<br />\ndently regarded leadership as conthe affair is to be held in the commons<br />\nWeek activities. Roy Galloway, John<br />\nsisting in moral courage and interest<br />\nroom or in the lantern-lit out-ofSteeper, Bernie Pinck, and Joseph<br />\nin<br />\none's<br />\nfellow-men<br />\nas much as<br />\ndoors has not yet been announced.<br />\nHoffman, Senior Class officers, are<br />\nCorrespondent Blames Wyman Park \"Pixies\" For Starting in the more agressivequite<br />\nqualities. Physacting as ex-officio members of the<br />\nical vigour is an essential qualificaRaging Inferno; Maury Sheldon<br />\ncommittee.<br />\ntion for a Rhodes Scholarship, but<br />\n\"Library Museum\" Displays History<br />\nBecomes Hero Of Day<br />\nathletic prowess is of less importance<br />\nAnd Development of Modern<br />\nthan the moral qualities developed in<br />\nBy SEYMOUR SACKS<br />\nWarfare<br />\nBut what could we three—mere<br />\nplaying outdoor games. Financial<br />\nKatske Heads Three-Man Body Work- Unbeknownst to the several hundreds mortals—do against Mother Nature<br />\nneed does not constitute a special<br />\ning<br />\nWith<br />\nAndrews<br />\nweapons,<br />\nof<br />\npersons who were intently listen- on a rampage. It dawned on us. We<br />\nrangOn<br />\nA collection of old<br />\nclaim for consideration.\"<br />\nOrganization<br />\ning to Prof. Edward S. Corwin's could call the fireman. Yes, they could<br />\ning from primitive spears to pistols,<br />\nIt is found that a Rhodes Scholar- Beethoven's Eighth Symphony To<br />\ndiscourse on the issue of \"packing handle it. Tearing madly into the<br />\nis on display in the Gilman Memorial<br />\nship<br />\nis vacated by marriage, and<br />\nFeature Second Program Of<br />\nFloyd Katske, chairman of the the Supreme Court\" Friday evening, threatened building, we telephoned<br />\nroom of the main library. The exhibit<br />\nthat neither does one need to possess<br />\nA Series<br />\ngroup<br />\nendeavoring<br />\nform<br />\na<br />\nto<br />\nselfa mass of swirling, leaping flames for a rush order of fire-eaters.<br />\nhas been the result of the clearing out<br />\na knowledge of Greek or to take a<br />\nof shelves in the library, and will be governing board for the dormitory were swiftly creeping through the<br />\nMeanwhile Maury had found a written examination<br />\nto obtain a<br />\nThe second of a series of recorded<br />\nknown as the Library Museum. They announces that he and a committee dry leaves and underbrush toward broom and was beating the hungry<br />\nscholarship.<br />\nprograms, featuring the bright, pleaswere collected, arranged, and placed of three residents are actively en- Levering Hall.<br />\nflames for all he was worth. But to<br />\nant Eighth Symphony of Beethoven<br />\non d(ispilay as an organized unit gaged in formulating a plan. The<br />\nThe hero of the fire—for every fire no avail. They crept nearer.<br />\nFreshman<br />\nPundit<br />\nwill be held in Levering parlor toPoses<br />\ngroup<br />\nis<br />\nworking<br />\nconjunction<br />\nin<br />\nwith<br />\ninterest<br />\nand<br />\nof<br />\nthrough the effort<br />\nhas its hero--was Maury Sheldon. He<br />\nA huge crowd of ten or fifteen<br />\nmorrow at 4 P.M. The concert is unmembers of the library staff and Dr. Donald M. Andrews,dorm proctor, it was who first discovered the flames.<br />\nPostal<br />\nPeeking<br />\nProblem<br />\nwide-eyed studes had gathered by the<br />\nder<br />\nthe sponsorship of the American<br />\nwho<br />\ngreatly<br />\nwas<br />\ninstrumental<br />\nsetin<br />\nGraduate students.<br />\nYour correspondent and Ben Root time seven huskies from the hook<br />\nA freshman, full of the induction Student Union.<br />\ntling the recent dorms strife satiswere racking their respective brains and ladder company 7 roared up in and deduction<br />\nHistorical interest runs high in<br />\nabsorbed from an EngThe Eighth Symphony shows Beefactorily. As yet, no information as<br />\nIn the NEWS-LETTER office for an idea front of Levering.<br />\nthese old firearms and swords. Gathlish writing class conducted for him thoven in a rare good humor. While<br />\nto their actual plan is being released<br />\nto make a front page feature artiered as they have been from sources<br />\n\"Where's the fire?\" one of them by Mr. Teeter of that department, pre- short, it shows a<br />\nby the group.<br />\nspirit of lively<br />\ncle, when suddenly, through the howl asked indifferently as he made his sents the<br />\nthe world over, they show the profollowing choice bit of cheerfulness. The Brandenburg ConBernard Pinck, chairman of the of the March wind came the faint<br />\ngressive development and efficiency<br />\nway through the blinding smoke.<br />\nreasoning.<br />\ncertos of Bach, six in all, will also be<br />\ndormitory activities committee an- cry of \"Fire.\" Then the voice became<br />\nof particular weapons and the story<br />\nDoubts About Incendiaries<br />\n\"I find that if I desire to send a presented. Brahms' Double Concerto<br />\nnounces that the self-governing board stronger, breathless . . .<br />\nof warfare through the ages. Spears<br />\n\"Who started it?\" inquired an- letter to my parents or to a girl completes the three<br />\nBs'. This Double<br />\nand the social committee will probcraftsmanship,<br />\nprimitive<br />\nyet<br />\nof<br />\n\"Get a broom! .. . Fire .. . Broom other. Maury laid it to some little friend, and if I desire that no eyes Concerto is<br />\nrarely heard, and the<br />\nably be incorporated into one group.<br />\nwrought to an almost unbelievable<br />\n. . . Water. . . Fire in woods!\"<br />\nkids who had run away when he but those of my parents or girl friend concert offers an<br />\nopportunity not<br />\nKatske promises that either a<br />\nsymmetry, are displayed with poisPaul Revere 111<br />\nsighted them. Little did he suspect read my message, the post-office in often afforded to music<br />\nlovers.<br />\npermanent<br />\nwill<br />\nplan<br />\nbe<br />\nput<br />\ninto<br />\neffect<br />\noned arrows and darts, such as are<br />\nWe recognized Maury running past that those \"little kids\" were prob- Gilman Hall extorts from me a fee<br />\nAdmission is 15 cents. Tickpts<br />\nshot from blow-guns. Then, by way before the spring vacation, or a tem- at a terrific rate He brought to mind ably none other than some of those of three cents. However, if I care not may be purchased<br />\nthrough A.S.U.<br />\nof contrast, flint and stone arrow- porary plan to be utilized for the the picture of Paul Revere announc- \"pixies\" that Uncle Humphrey has if the postal authorities read my mes- representatives<br />\nor Box 976.<br />\nheads from mounds of man before remainder of this year will be form- ing that the British were coming. We been telling us were having a sit- sage, I may send a postcard, for<br />\nrecorded history are placed by a ulated before that date.<br />\nlooked out.<br />\ndown strike in Wyman Park.<br />\nwhich the same post-office charges<br />\nAccepts Thayer Lectures<br />\ncrossed brace of old duelling pistols.<br />\nAlready the flames were high among<br />\nIn eleven minutes the fire was out but one cent. The only difference beA sword of Damascus steel, and a Fowler Speaks To Chemists the trees, and spreading in a wide —gone completely. It was disappoint- tween a postcard and a letter is that<br />\nSir Henry Dale, Member of the<br />\nmodern slim steel dagger, to mention<br />\ncircle in all directions. To the South ing, to say he least, to see how easily the postcard can be read by the mem- National<br />\nInstitute for Medical ReDr. Robert D. Fowler, instructor were woods; to the west were woods; and quickly the fire was put under of the post-office department and the search<br />\nonly two of the many-edged weapons,<br />\nin London, has accepted the<br />\nare displayed to portray their period in Chemistry, will address the Chem- to the north was Gilman Hall; to the control. Our visions of a roaring in- letter may not. It seems therefore<br />\nappointment to the Thayer Lectureistry Journal Club on the subject east was Levering Hall. That settled ferno enveloping Levering and Gilman that the postal authorities are will- ship<br />\nin history.<br />\nof the Johns Hopkins Medical<br />\nThe exhibit is centrally located in \"Positive Ion Sources\" today at 4:00 It! Levering must be saved! Remem- Halls crumbled under the feet of the ing to pay me two cents for the priviSchool. The lectures will start next<br />\np.m. in Room 221, Remsen Hall.<br />\nGilman Hall.<br />\nber the San -Franscisco fire!<br />\nfiremen.<br />\nlege of reading my mail.\"<br />\nyear.<br />\nArthur Garfield Hays, nationally<br />\n<br />\n—Courtesy News-Post<br />\n<br />\nARTHUR GARFIELD HAYS<br />\n<br />\nShaffer To Address<br />\nDorms On Athletics<br />\n<br />\nChairman of the Military Ball Com-<br />\n<br />\nRhodes Scholarship<br />\nBlanks Now Here<br />\n<br />\nStudes Save Levering Hall<br />\nFrom Veritable 'Forest lire'<br />\n<br />\nOld Weapons Shown<br />\nIn Gilman Library<br />\n<br />\nDorm Government<br />\nGroup Sets Plans<br />\n<br />\nA.S.U. Will Present<br />\nRecord Concert<br />\n<br />\n\fHOME'WOOD, BALTIMORE, MARCH 9, 1937<br />\n<br />\n2<br />\n<br />\nclbt jobns jOophirts<br />\n<br />\nOur Athletic Policy<br />\nBroadcast throughout the country in every major<br />\nnewspaper the news of the Hopkins' latest athletic move<br />\n<br />\n'Letter<br />\nSubsci iption per year<br />\nBy Mail<br />\n<br />\n$2.50<br />\n<br />\nONTEMPORARY<br />\nONIMENT<br />\n<br />\nwas greeted with favorable and sympathetic comment.<br />\nThe decision to eliminate gate receipts was hailed as a Wily I Am For The ROTC<br />\n.1 am for the ROTC. There is nothfinal move to place Hopkins at the top of amateur athletics with a genuine, sincere University program run ing that the college needs so much-not equipment, books, buildings, gradfor all the students.<br />\n<br />\nOn The<br />\nLiterary<br />\nHorizon<br />\nJAMES T. FARRELL and<br />\nJOHN S. SUMNER<br />\n<br />\nOLLEGIATE<br />\nOMMENT<br />\nSpringfield, Mass. - ( ACP) — Assailing educational views of the University of Chicago's Pres. Hutchins as<br />\n\"counsels of despair,\" Dr. Earnest M.<br />\nBest, new president of Springfield<br />\nCollege, in his inaugural address suggested a frank facing of problems as<br />\nthey exist.<br />\n\"President Hutchins of the University of Chicago would purify and simplify education by a retreat into the<br />\nnarrow intellectualism of scientific research and philosophical speculation<br />\nand leave the world to its fate in<br />\n'trades associations',\" said the former<br />\nMcGill University psychology professor.<br />\n\"These proposals are the counsels<br />\nof despair. We have much to learn<br />\nfrom the past but in my opinion we<br />\nmust advance by a frank recognition<br />\nof the centrality of vocational and<br />\nprofessional education in modern life.<br />\n\"The defects of vocational education can be remedied by making sure<br />\nthat the schools build good men and<br />\ngood citizens as well as good specialists,\" concluded Dr. Best.<br />\n<br />\nJudge Henry H. Curran last month<br />\nOf local colleges, the University of Maryland's spokes,dismissed a case against a book<br />\nROTC.<br />\nan<br />\nRemit subscription fees to Treasurer, Student Activities Council, man—President Byrd expressed his skepticism and his<br />\nwhich had aroused an unexpected<br />\nI am for the ROTC because it makes<br />\nRemsen Hall, Postolfice, Johns Hopkins University.<br />\nopinions appeared to display his judgment of the Hopweight of issue in circles of literary<br />\nthe boys look so nice. There's noth- criticism. So long as Mr. Sumner,<br />\nkins through standards of the U. of M. However, PresPostotlice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\ning<br />\nmatter<br />\nlike a uniform to give that snappy the New York vice-crusader, who, it<br />\nclass<br />\nsecond<br />\nEntered as<br />\nident Woodcock of St. John's as reported in the college<br />\n3, 1879.<br />\nin Blaltimure, Md., under the Act of Congress, November<br />\nlook. ROTC makes the boys stand up is said, has read some three-hundred<br />\nnewspaper, Collegian, stated:<br />\nstraight and say, \"Yes, Sir.\" And banned novels in the past years, and<br />\nexamduring<br />\nexcept<br />\nJune,<br />\nto<br />\nOctober<br />\nfrom<br />\nyet still can trust the purity of his<br />\nPublished senn-weekly<br />\n\"I am in favor of the plan as it tends toward<br />\nisn't that swell?<br />\nination and college holiday periods by undergraduates of the Johns<br />\nhad confined his activities<br />\nopinions,<br />\nkeeping inter-collegiate athletics on an amateur<br />\nI am for the ROTC because it<br />\nHopkins University.<br />\nto books which perhaps merited his<br />\nbasis.\" He said that he would be in favor of such<br />\nLeaches the boys what war is like. attentions, and the burlesque houses<br />\na policy for St. John's as gate receipts were<br />\nEDITORIAL STAFF<br />\nIn the ROTC they learn to march in of New York, he had been deplored<br />\nEditor-In-Chtef<br />\nStanley Finkel<br />\nHe<br />\ncollege,<br />\nanyhow.<br />\nthe<br />\nwith<br />\nnegligible<br />\nalmost<br />\nManaging Editors<br />\ncolumns, to do right face, and the and tolerated. But when he chose to<br />\nJames Morrow, David Caplan<br />\n. Sports Editor<br />\ntake issue with the recent success \"A<br />\nBernard 1). Pinck<br />\nwent on to remark that he would want the Board<br />\nmanual of arms. They have dress<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barroll, Jr.<br />\nWorld I Never Made,\" by James T.<br />\na<br />\nsuch<br />\nto<br />\nin<br />\nconcur<br />\nGovernors<br />\nand<br />\nof<br />\nVisitors<br />\nAssistant Sports Editor<br />\nparades and shoot cannons at the<br />\nHarold Zheutlin<br />\nPress, New<br />\nFarrell, (Vanguard<br />\nColumnist<br />\nPaul Berge<br />\npolicy if one were to be adopted.<br />\nfootball games, and thus learn about York.), a storm of protest went up,<br />\nReporters--Max Iskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nably furthered in particular by Mr.<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nHere we see that this head of another institution of war.<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nBernard DeVoto in the \"Saturday<br />\nit<br />\nbecause<br />\nROTC<br />\nthe<br />\nfavor<br />\nalso<br />\nI<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Bur- learning really appreciates the plan; we may see the<br />\nReview.\"<br />\nford, J. C. Handelsman, Mal lioshnack, Arnold Glantz, Joe start of a nw attitude of colleges towards the athletic teaches men to hate war. If we get<br />\nIt is not our purpose to discuss the<br />\nSaMOVItt•<br />\na cavalry unit the boys may be able underlying issue, particularly in light<br />\nproblem.<br />\nBUSINESS STAFF<br />\nto learn how tO play polo, and we of the disagreement of eminent men<br />\nThe paper itself in an article entitled \"Lunatic Fringe\"<br />\nBusiness Manager<br />\nWilliam B. Kempton<br />\nwill have matches with P. M. C. and and women from Church, literary,<br />\nAssistant Business Manager comments:<br />\nNew Haven, Conn. - (ACP)—IndifMelville Locker.<br />\nthe<br />\nManager<br />\nAdvertising<br />\nwith Princeton, and out of this ex- and sociological circles, as to<br />\nWm. C. Erlanger<br />\nference causes Yale University underCirculation Manager<br />\nneed for, and desirability of censor- graduates to shun religious<br />\nGerald Willen<br />\n\"The recent announcement by The Johns<br />\ndiscussion<br />\nperience will develop not only a hate<br />\nOffice Manager<br />\nitoward Linkoff<br />\nship in any and all forms. But in the groups such a the<br />\nUniverity Christian<br />\nHopkins University that beginning next October<br />\nCopy and Filing Manager<br />\nNathaniel Soifer<br />\nof war but of everything military.<br />\na<br />\nassumes<br />\ncase of James Farrell, it<br />\nAssociation, known to tudents as<br />\nit eliminate all admission charges at its sports<br />\nThe ROTC will also be a fine thing dangerous aspect. He is a Chicagoan,<br />\nDwight Hall.<br />\nan<br />\nis<br />\nevent<br />\ncontests<br />\nthe<br />\nof<br />\nimportance<br />\nwhich<br />\nit<br />\nabout<br />\nfor the campus socially. Periodically writing a virile, realistic prose<br />\nREPRESENTED FOR NATIONAL ADVERTISING •Y<br />\nSo said Pres. James Rowland Anwould be hard to overestimate. By it, Johns<br />\nthe unit will elect its military col- the place where he was born and gell at the services in honor of the<br />\n• NationaI Advertising Service, Inc.<br />\nbrought up, and from which he es- 50th<br />\nt.olleee Publishers Representative<br />\nHopkins becomes the first major institution of<br />\nanniversary of organized underonels from among our girls. They<br />\nNEW YORK. N.Y.<br />\nMAD:SON AVE.<br />\ncaped. His earlier trilogy, \"Studs graduate religious<br />\nSAN FRANCISCO<br />\n.<br />\n)•TON<br />\nCoi,..•<br />\nactivities on the<br />\nlearning in the United States to break away<br />\nwhich<br />\nat<br />\nballs<br />\nmilitary<br />\ntheir<br />\nhold<br />\nwill<br />\n.T1 ANC<br />\nSr<br />\n•<br />\nL .0, ;.75<br />\nLonigan,\" is a story woven of the<br />\ncampus.<br />\ncompletely and unequivocally from the profesthey will wear their resplendent uni- lives of the very boys and girls he<br />\nOnly a small group was violently<br />\nsional athletic system.\"<br />\nMember<br />\nr936<br />\n1937<br />\nforms. This will be a good thing be- lived among, and spares the reader opposed to religion. Some students<br />\ntheir<br />\ntawdriness,<br />\ncause it will make the girls hate war nothing of their<br />\nstay away from Dwight Hall, he addContinuing, the Collegian says:<br />\nAssocided Colleesiate Press<br />\nsqualor and poverty, or the sordided, because they feel that their retoo; for women in their deep love of<br />\nDist ributors<br />\nness of their uninspired, defeated<br />\n\"People who are interested in the problem of<br />\ntruth will see through the superfi- lives. \"A World I Never Made,\" takes ligious beliefs are already decided.<br />\nintercollegiate athletics in the United States<br />\nTh greater number are \"wholly indifciality of the dances, and honors, a different group, the Irish in the<br />\nhave been almost unanimous in naming this step<br />\nferent to religion and preoccupied like<br />\nand nice clothes, and realize the hor- South Side slums, and draws an un- their parents with<br />\nother matters.\"<br />\nMember Of The<br />\nas \"ideal.\" Campus sports should be maintained<br />\nrelieved picture of the family as the<br />\nASSOCIATION<br />\nNEWSPAPER<br />\nINTERCOLLEGIATE<br />\nrible truth beneath it all.<br />\nExplaining the necessity -for an<br />\nfor only two reasons: because the students enOf Middle Atlantic States<br />\nchildsix<br />\nwith<br />\nLizzie,<br />\nand<br />\nunit; Jim<br />\norganization like Dwight Hall, Dr.<br />\nAdapted from the New Mexico Lobo<br />\npoy theim and because they are benefleial.<br />\nren and another coming; old Mrs.<br />\nAngell said:<br />\nMarshall's Student<br />\nand<br />\nFranklin<br />\ninspiraand<br />\nFlaherty, with her vigor<br />\nTUESDAY, MARCH 9, 1937<br />\nTo 'operate' teams for the single purpose of col\"On the strictly intellectual and<br />\nWeekly<br />\ntion; Margaret's cheap effort to e.8lecting gate receipts destroys the entire purpose<br />\nplulosophical side of religious expericape with her lover, who becomes<br />\nence there is and always will be a real<br />\nof athletics.\"<br />\ninvolved with the law; and little<br />\njob for such an association. It affords<br />\nDanny, who tells much of the story<br />\nWe agree with this stand and are proud that we are<br />\nopportunity for direct, frank, man-toTo those of us who have attended assemblies which<br />\nthrough his forcible awakening to<br />\nan<br />\nof<br />\npart<br />\nthe<br />\nhas<br />\nstrength<br />\nand<br />\nwhich<br />\ninstitution<br />\ncourage<br />\nman discussion of the fundamental isArthur Garfield Hays has addressed, look backward at<br />\nnumerous aspects of the life about<br />\nsues in Christianity, as well as in<br />\nlectures full of color, fire, wit--and information. We also to carry out the noble ideals of real amateur ahletics.<br />\nDon't try to argue with the fellow him.<br />\nother world religions.<br />\nAnd these people are devout, relook forward to Thursday assembly and another Hays<br />\nwho tells you you that this picture is<br />\n\"No thoughtful man can ever be<br />\nhopeless.<br />\npentant, and altogether<br />\naddress.<br />\nquite sure of the foundations of his<br />\nthe outstanding film of 1936; he's<br />\nThey hate the dirt and darkness of<br />\nfaith-or, indeed, of his lack of faith,<br />\nright.<br />\nThe assembly is still being conducted under a voluntheir lives, and occasionally dream of<br />\nif that represent his condition--withThe second of the fireside discussion group series will<br />\nThe picture, in French with Eng- getting out. But the unit family is<br />\ntary plan. But certainly here is an outstanding speaker<br />\ntake place this Thursday with Dean Berry leading the lish subtitles, takes place in Flanders there in multitudes, and there they out exposure to the shrewd, even if<br />\nwho should draw an overflowing crowd to hear hi; words.<br />\nsometimes naive, criticism of his comdevelopment of the selected topic. It shoold be an ex- at the time of the Domination of Spain are bound, by ignorance, superstition,<br />\nrades and to the merciless give and<br />\nfrelisten<br />\nto<br />\neducation<br />\nIt should be part of every man's<br />\ncellent oprx)rtnity for anyone who wishes to hear varied towards the end of the sixteenth cen- and need for education. Mr. Farrell take of men of his age.\"<br />\npart<br />\nmost<br />\nthe<br />\nfor<br />\nspeak--who<br />\nthe picture<br />\nquently to speakers who do more than just<br />\nopinions on this important question. Much value can be tury. The scene is the Flemish vil- draws<br />\nwith a sure hand. If it ever fails, it<br />\ninspire and stimulate thought. Such a speaker is Mr. derived from the participation in such a discussion; it<br />\nNew York, N. Y. -(ACP)---If collage of Boom, thrown suddenly into is from over-exuberance. There is<br />\nHays. He is one of the few so-called intellectuals who has is a useful laboratory for intelligent thinking and conleges and universities continue to<br />\nturmoil at the news that the dreaded no faltering touch, no sqeamishness.<br />\n\"recruit\" students and don't restore<br />\na practical and enlghtened grasp of those flaunted con- sideration.<br />\nSpanish masters will spend a night His book is hearty and alive; his peo- their high standards for selective adcepts of \"liberty,\" \"freedom of speech,\" etc. He has<br />\nindividuals. There<br />\nstrangely,<br />\nare,<br />\nple<br />\nFor sponsoring and continuing this activity, the Fire- there during one of the routine visits<br />\nmission, they will impair seriously the<br />\nis fire and vigor in abundance, some<br />\ntraveled all over the United States and has participated<br />\nis to be congratulated. We hope of inspection. Dread scenes of pil- ineptness, some extraneous wordage value of academic degrees.<br />\nCommittee<br />\nSessions<br />\nside<br />\nin famous trials involving the abuse of civil liberties. He<br />\nAt leas that is the opinion of Frank<br />\nthat this second trial will be again successful and that lage, rapine, and destruction are en- - -but never can it be said that there<br />\nwas in Germany as one of the lawyers in the Reichstag<br />\nH. Bowles, acting director of admisdissior<br />\nthe<br />\nartificiality<br />\nof<br />\nwife<br />\nthe<br />\nof<br />\nis anything<br />\nfuture sessions be planned with as good a speaker and visaged. At this point,<br />\nsions at Columbia University.<br />\ntire trial.<br />\nMayor takes command of the city, rel- mulation.<br />\nsubject.<br />\nReductions in enrollment and deAnd such a book naturally requires<br />\nHe is a man worth hearing. To those who have never<br />\negating the men to the background,<br />\ndeep creases in income from endowment<br />\nand<br />\nshades,<br />\ncolors--vivid<br />\nstrong<br />\nheard him, we are certain, you will think as we do after<br />\nfunds and other outside sources,<br />\nand issuing orders to the women. Thus<br />\nshadows. It cannot exist on any other<br />\nyou have listened to him.<br />\nis it that when the Spaniards finally basis. It is strong fiction--not for the caused by the depression, drove colLet us fill up Latrobe!<br />\narrive they are agreeably surprised weak-stomached--not for those who leges to seek increased enrollment at<br />\nThe enthusiastic and huge response to the lectures on<br />\neducational standards,.<br />\ntheir eyes and not the expense of<br />\nhuman reproduction should indicate that there is a to find a committee of welcoming would rather shut<br />\nclaimed.<br />\nMr.<br />\nBowles<br />\nis one of the<br />\ndefinite desire for such a course on this campus. That women, a village rejoicing and cele- see at all. The language<br />\nparts of the book,<br />\nmasterful<br />\nmost<br />\nRS<br />\nin<br />\ncollege<br />\nthis<br />\ninstruction<br />\nthis<br />\nfor<br />\nthere is a real need<br />\nbrating, and free drinks, lodging, and<br />\nerrors. One has only to Never Made,\" would have been to<br />\nwell as in all other ( who do not have such courses) is entertainment. (The French title, in spite of<br />\nLast issue we printed our first column about Hopkins<br />\nwith the best yet done outlaw most of the greatest classics<br />\nit<br />\ncompare<br />\nof<br />\napparent from any intelligent and enlightened study<br />\n\"La Kermesse Heroique\"---\"The He- in this difficult department, and even of the realistic school of literature,<br />\nfraternities. Judging from our observance, the feature<br />\nthe problem.<br />\nroic Festival\"- - come from this cele- Hemingway, the master of conversa- and, indeed, to have made of life itself<br />\nwas greeted warmly. It appears that there is a definite<br />\natmos- bration.) In the course of the evening, tion among modern authors, seems to an unfit subject for literary effort.<br />\nbetter<br />\nwhat<br />\nbetter<br />\nconditions,<br />\nwhat<br />\nall<br />\nAfter<br />\nplace in our columns for such news.<br />\nphere, lectures, and approach than what college--and the women receive their foreign guests pale a little.<br />\nPassages evetryone To have upheld the persecution would<br />\nwith open arms, figurative and liter- could find in their own experience have made ridiculous a dignified<br />\nWe should like the cooperation of the Greek letter particularly this one----offers can be found?<br />\nally, and the Mayor plays possum, if they dared look, are frankly set court, and to have placed an annoygroups in submitting material promptly and regularly<br />\nAnother important consideration is the fact that a but fools nobody. The Mayor's wife, endown without any cloying appeal to ing millstone about the neck of<br />\non<br />\nweekly<br />\nappear<br />\nwill<br />\ncolumn<br />\nThe<br />\nti the NEWS-LETTER.<br />\nHopkins organization —extra-curricular and composed tertaining the Spanish Duke, manages<br />\nthe sensational, for there is nothing writers. The decision was wise and<br />\nTuesdays, so that the fraternities should appoint NEWS- of Hopkins students—initiated and sponsored the series. to force the marriage of her daughter<br />\nof that in the writin gor the story. realistic, and contained a pretty obLETTER representatives to write their contributions by But the American Student Union meant it for--and it to a young painter, Jean Brueghel But they are far more elemental and vious suggestion that Mr. Sumner<br />\nby ---the students.<br />\n(pronounced Broigl), thereby foiling real than was considered polite a few confine himself to fields where he<br />\nthe preceding Friday. In other words, send your news was received wholeheartedly<br />\nmay enjoy himself without bothering<br />\ntoday in order to have a representative array in TuesNow that the ever-increasing popularty of the lectures her husband and an unwanted suitor. yars ago.<br />\nanyone.<br />\nnight<br />\nthe<br />\ndancing<br />\nand<br />\nrelieving<br />\nnote,<br />\nfeasting<br />\nAmid<br />\nis<br />\nthere<br />\na<br />\nas<br />\nAnd<br />\nthink<br />\nto<br />\nabout the fuure. Will<br />\nis evident; it is high time<br />\nday's issue.<br />\nAnd so the book is legally washed<br />\nthis educational and interesting series be continued? passes, and the next morning the here infinite compassion, understandplaced upon its pedestal of purand<br />\ntimid<br />\nand<br />\npeaceful<br />\nthe<br />\nleave<br />\nfiery<br />\nSpaniards<br />\nsatire<br />\ndeep,<br />\nanger.<br />\na<br />\nThe<br />\nand<br />\ning,<br />\nability to repeat<br />\nWe cannot be too sure of the<br />\nwas prevented by the<br />\nthis year's success. It has done its duty; it has shown village of Boom, really celebrating fails as a whole because it grows too ity. A travesty<br />\nexemp- warm and real. The tragedy of life wisdom of a judge. But the fact<br />\ntax<br />\nand<br />\ndeliverance<br />\nsafe<br />\nits<br />\nthe way.<br />\ntion.<br />\nfor such as these, and we suspect, remains that other judges have been<br />\nWith the absence of an official magazine on the camWe students, if we are interested in maintaining this<br />\nfor all, occupies the author's thoughts less wise, and books have been banfrom<br />\nThe value of the picture, aside<br />\npus, the Blue Jay being banned since 1934, the NEWS- course, should get behind a move to impress the adminisits lesson on how to avoid paying in- far more than any passing effort to ned for years, publishers sued, and<br />\nLETTER remains the sole periodical and outlet for literary tration with the necessity of incorporating this lecture<br />\nbook-sellers arrested in the sacred<br />\ncome taxes, lies in the remarkable satirize or grow clever.<br />\nseries in the permanent curriculum.<br />\ntalent.<br />\nWhere then, did Mr. Sumner ob- name of morality. It might be sigCostumes,<br />\nstaging and direction.<br />\nscenry, civilian types,‘details of the ject? He found an impressive list of nificant that these same books have<br />\nIn the past two years we have tried to satisfy such<br />\ncelebration, are all done with minute faults. He translated many a pas- frequently lived long enough to prove<br />\ntalent with the printing of literary editions. However,<br />\nfidelity to historical accuracy, and sage into pornography by some their value--long after it could be<br />\nthus far, we have not yet observed any real need nor rewith fine artistry. Technical advisor stretch of a very elastic imagination. scarcely traced to their suspected<br />\nTo Bates College, whose paper thinks it is the first VMS Peter Brueghel, who left a volum: He took issue with words used by Indecency and the appeal of the forquest for such an endeavor. As a matter of fact, the<br />\ncollege paper to conduct a poll on the Suprem Court, nous record of Flemish life of the people to whom they would be sec- bidden fruit. The incident is closed—<br />\nwidespread success of the past attempts has remained<br />\nlet us say that the Hopkins has proven to be a pioneer period in his celebrated paintings, ond nature. He succeeds, in short, in Mr. Sumner will continue, and after<br />\nquestionable in many minds.<br />\nin this direction, too.<br />\ndrawings and engravings. Every reading into a great work of truth him, so long as the law courts uphold<br />\ninare<br />\nwho<br />\nstudents<br />\nmisleading, seductive them, more in his footsteps. But<br />\nmany<br />\nare<br />\nthere<br />\nthat<br />\nfeel<br />\nBut we<br />\nBecause this college is located in Maine, it will be in- member of the supportinug cast was all the gilded,<br />\nclined to literary writing and perhaps gifted with ability. tresting to follow the poll and actual results to see if the endowed with individuality, and so qualities which he persecutes with great books will be written—and<br />\nTo these we procer an invitation to submit material to us. much misused \"As Maine Goes\" myth carries over to helped to make the picture a work of such vigor. True, the passages he read, either then, or in a future<br />\nWe shall be happy to print poems, short stores, articles, college students.<br />\nart, replete with drama, gaiety, refers to are frank, but brutally so, however remote. For the present,<br />\nlaughter, and that indefiniable some- not with the intention of being dirty. their fate hangs on the wisdom and<br />\nand other contributions in our columns. We reiterate that<br />\nWe will watch this straw vote and announce in a later thing that makes a picture a lifelong<br />\nAnd Magistrate Curran disagreed appreciation of the courts throughout<br />\nwe are the only campus outlet for such material; we<br />\nNEWS-LETTER just how the vote came out.<br />\nwith him. To outlaw \"A World I the nation.<br />\nsuccess.<br />\nurge talented students to submit their products.<br />\nuate courses, or professors—we need<br />\n<br />\nCoie6iale Di6est<br />\n<br />\nA Stimulating Speaker<br />\n<br />\n\"CARNIVAL 1N<br />\nI FLANDERS\"<br />\n<br />\nAnd Another Session<br />\n<br />\nLet's Make It Permanent<br />\n<br />\nFrats Should Cooperate<br />\n<br />\nCall For Literary/ Talent<br />\n<br />\nAs Maine Students Go<br />\n<br />\nF. '<br />\nEss<br />\nHo<br />\nGem<br />\n<br />\n'BIO<br />\nLa<br />\n<br />\nAn<br />\nIlforocc<br />\nT, Wil<br />\nat the<br />\nthree r<br />\nlished I<br />\nDr.<br />\ntion of<br />\nPolitic(<br />\nonce, d<br />\nlems i<br />\ntween I<br />\nin the<br />\nGermai<br />\nModem<br />\ng-ress;<br />\nward\"<br />\nPer<br />\n<br />\nThe<br />\nGermai<br />\nimperie<br />\nof pre<br />\ntook mu<br />\nthe ta<br />\nambitic<br />\nvalue o<br />\nlinking<br />\nconditic<br />\nthe Get<br />\nperspec<br />\neible in1<br />\n<br />\nThe<br />\navoidin,<br />\ndramat<br />\nattempt<br />\nproduci<br />\nOf the<br />\ndanger<br />\nWith it<br />\n(went 11<br />\nor the<br />\n<br />\nThe l<br />\nof/Y, a<br />\nrecords<br />\nIs now<br />\nthere ii<br />\nord on<br />\narcheal<br />\nOf phys<br />\nto sixt<br />\n/neasur<br />\nands of<br />\nage, cei<br />\nCalvin<br />\nOf the<br />\nStanfor<br />\neions hi<br />\ninterest<br />\nscent g<br />\nLa lv<br />\nla the<br />\nand cor<br />\nSources<br />\n(here a<br />\nOotated<br />\nbeing tl<br />\nnardier4<br />\nkliderati<br />\nworks<br />\n<br />\nnu.s<br />\nF,<br />\nNext<br />\n<br />\nThe<br />\n(lents v<br />\ntheir la:<br />\nthis Fr<br />\nhall, ac<br />\nby Cha<br />\nGradual<br />\nNorm<br />\n4Iipply I<br />\nWill las<br />\n1.1.00 fc<br />\n<br />\nSporm<br />\nqinand<br />\ntrlcal<br />\n<br />\nkineerir<br />\n<br />\nlIrofess+<br />\nl'hom as<br />\nkriginee<br />\n<br />\nLecture<br />\nhouisto,<br />\n<br />\nQ.orman<br />\nis.-te in<br />\nberg, A<br />\nparker,<br />\nr. Bu<br />\n<br />\nNychol<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 9, 1937<br />\n<br />\n3<br />\n<br />\nF. T.Williamson High Court Dubbed College Survey Shows Post- German Biologist 'Set Sen. Deadline I<br />\nEssay Issued By Super-Legislature Repeal Drinking Increase To Deliver Second<br />\nBy Prof. Corwin Opinions Of 1475 Deans And College Editors Indicates Zoology Talk Today<br />\nHopkins Press Lecturer<br />\nLess Drunkenness, Despite More<br />\nApplauds Roosevelt<br />\nThe Seniors are advised that about<br />\nfour weeks remain for them to complete the reading of the requisite list<br />\n<br />\nCourt Plan In Every<br />\nDetail<br />\n<br />\nGerman - Morrocan Study<br />\nBy History Instructor<br />\nPublished<br />\nTells Latrobe Audience Fri`BIOLOGY'PUT ON SALE day Times Demand New<br />\nJudicial Outlook<br />\nLa Mesnardiere's Poetique<br />\n(Continued from Page 1, Col. 4)<br />\nSubject Of Reese<br />\nlegislation. More undergraduate students than usual were in attendance.<br />\nStudy<br />\nPoint by- point, Professor Corwin<br />\nAn essay entitled Germany and discussed and defended the Roosevelt<br />\nMorocco Before 1905 by Dr. Francis proposal. He hailed as salutary the<br />\nplan to restrict issuance of injuncT. Williamson, Instructor in History<br />\ntions and declarqi well-nigh imat the Hopkins, is included among partial a constitution amendment<br />\nto<br />\nthree new paper-bound volumes pub- regulate the court. Since 1860, he said,<br />\nsave for the income tax one, every<br />\nlished ,by the Johns Hopkins Press.<br />\namendment has been adopted by bayDr. Williamson, under the direconets or agitation over a long period<br />\ntion of the departments of History,<br />\nof years. He pointed to the slow adopPolitical Economy, and Political Scition, of the child labor amendment.<br />\nence, deals in his essay with the probDiscussing the personel of the Sulems in the interrelationships bepreme Court, Dr. Corwin placed himtween two contrasting types of states<br />\nself in favor of younger judges and<br />\nin the pre-war age of imperialism.<br />\nof son-re from the \"academic bar.\"<br />\nGermany is the personification of<br />\nthey being naturally of \"broader ecomodern symbols of expansive pronomic and social philosophy.\" Dr.<br />\ngress; Morocco is the typical \"backCorwin himself has been menward\" state.<br />\ntioned as a possible justice, as has Dr.<br />\nPermits Intelligent Judgment<br />\nJohn Dickinson, a Hopkins graduate<br />\nThe work points out how modern and former assistant attorney general,<br />\nGermans, creating and encouraging to whom he referred with praise<br />\nfor<br />\nImperialist energies as the best means his brief and argument in<br />\nthe<br />\nof preserving their national power, Guffey Coal ease. The<br />\nPrinceton<br />\ntook notice of Morocco, and made it scholar declared that the<br />\nopinions<br />\nthe target for their expansionistic issued in the Income Tax and<br />\nDred<br />\nambitions. By showing the subjective Scott cases show sufficient evidence<br />\nValue of Morocco to Germany, and by that judges should retire at seventy.<br />\nlinking the subjective feeling to actual \"Exceptions, of course, in a case<br />\nlike<br />\nconditions, the essay tries to place Justice Holmes.\"<br />\nthe German-Morocco question in such<br />\nAfter his address Dr. Corwin was<br />\nperspective as will admit of a pos- entertained<br />\nby a dinner given by the<br />\nsible intelligent judgment.<br />\nSocial Science Department at the<br />\nThe author avoids repetition by Hamilton Street Club. A guest<br />\nreavoiding mention and criticism of the ports discussion waxed warm<br />\nas<br />\ndramatic climax in 1905. There is no liberal and conservative members of<br />\nattempt to link the German action, the Hopkins faculty locked<br />\nverbal<br />\nproducing the crisis, with the origins horns across the board. Dr.<br />\nCorwin<br />\nOf the World War, and, thereby, the was the first James<br />\nSchouler lecdanger of passing moral judgment turer of the season. The<br />\nsecohd<br />\nWith its accompanying and subse- speaker will be announced soon.<br />\nquent hiatus of prejudice to one side<br />\nor the other is nullified.<br />\nThe February Issue of Human Biology, a quarterly magazine devoted to<br />\nrecords of research in biological fields,<br />\nis now on sale. In the current issue<br />\nthere is an illustrated, complete record on the relationship between menarcheal age and certain measurements<br />\nOf physique in girls of the ages nine<br />\nto sixteen years. Based on actual<br />\nMeasurements taken on many thousands of girls of junior and high school<br />\nage, certain conclusions are drawn by<br />\nCalvin P. Stone and Roger G. Barker<br />\nOf the Psychological Laboratory of<br />\nStanford University. These conclusions have to do with the attitudes and<br />\ninterests of pubescent and non-pubescent girls.<br />\nLa Mesnarcliere's Poetique (1639)<br />\nis the topic of an exhaustive study<br />\nand comment by Helen Reese Reese.<br />\nSources of the work by La Mesnardiere and his dramatic theories are<br />\nnotated. The work is noteworthy as<br />\nbeing the first of its kind on La Mesnardiere, who has received little consideration and less notice in previous<br />\nWorks of literary criticism.<br />\n<br />\nilussard Booked<br />\nFor Grad Dance<br />\n-- Next To Last<br />\n<br />\nDance Of Season<br />\nTo Be Held<br />\nFriday<br />\n•<br />\nThe Faculty and Graduate Students will hold their March dance,<br />\ntheir, last dance but one of the season,<br />\nthis Friday, March 12, in Levering<br />\n1-taii, according to an announcement<br />\nby Charles Larrick, chairman of the<br />\nOraduate Student Social Committee.<br />\nNorman Bussard's orchestra Will<br />\nstipply the music for the affair, which<br />\nWill last from 9 till 1. Admission is<br />\n;1,00 for couple or stag.<br />\nSponsors for the dance are Dr. Ferdinand Hamburger, Instructor in Eletrical Engineering; Mr. Myrick<br />\nAssociate in Electrical Entineering; Thomas Comber, Associate<br />\nt'rofessor<br />\nCivil Engineering;<br />\nof<br />\nNomas Hubbard, Associate in Civil<br />\nrigineering; Dr. Henry McComas,<br />\nLecturer in Psychology; Dr. Robert B.<br />\nkoulston, Collegiate Professor of<br />\n4rman; Dr. Harold Cherniss, Asso'late in Greek; Dr. Benjamin Rosenberg, Assistant in German; William<br />\nparker, Visiting Lecturer in English;<br />\n6r. Buford Johnson, Professor of<br />\nt'sychology.<br />\n<br />\nHeavy-Liquor Consumption<br />\n<br />\nThere is more drinking of alcoholic<br />\n\"2. Students abhor the drunk, adbeverages, and students are drinking mire the man who can drink like a<br />\nmore hard liquor than light liquor in gentleman.\"<br />\nmost American colleges and univer\"3. A vast majority of college presisities now, than before repeal, acdents see drinking as a problem in<br />\ncording to a survey just completed by<br />\nother institutions, but not in their<br />\nthe Literary Digest.<br />\nown.\"<br />\nQuestionnaires were sent to the<br />\n\"4. The average undergraduate<br />\nleads of 1,475 colleges and also to 1,475<br />\ndoes most of his tippling off the camstudent editors and leaders, the magapus.\"<br />\nzine states, asking an appraisal of<br />\n\"5. Harvard and Yale allow drinktheir campus drinking situation since<br />\ning<br />\nin rooms and fraternity houses.<br />\nRepeal. Replies are reported from 645<br />\npresidents, deans and student leaders who represented 581 American<br />\ncolleges \"of every type of sectarian<br />\nand non-sectarian school in the country.\"<br />\nMore Drinking Since Repeal<br />\nMere drinking since Repeal is reported by 303 of those responding and<br />\n60 others state there is less drinking<br />\nin their colleges. Reports from 205<br />\nstate that students are drinking more<br />\nhard liquor and from 100 that they<br />\nare drinking more light liquors.<br />\nThe Digest announces the results<br />\nof its nine-part survey and concludes<br />\nthat<br />\n<br />\nVictor Jolles, Protozoa Geneicist, Now At Wisconsin<br />\nUniversity<br />\n<br />\n• THE NEW<br />\n<br />\nDENTISTRY<br />\n<br />\n\"1. Drinking is more on the increase<br />\nAs far as the News-Letter could<br />\neverywhere, but there is relatively determine, Johns Hopkins was not inless drunkeness.\"<br />\ncluded in the Literary Digest survey.<br />\n<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nJUNE WEEK FEE<br />\nDEADLINE<br />\n<br />\nMARCH 31ST<br />\n<br />\nDENTAL SCHOOL<br />\n<br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER. D.M.D.. M.D., Dean<br />\nuept. 9, 188 Longwood Ave., Boston, Mass.<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nHelen Jepson tells why<br />\nshe chooses Luckies for her voice<br />\nLOVELY PRIMA DONNA OF<br />\nMETROPOLITAN OPERA SAYS:<br />\n<br />\n\"A season of opera and concert<br />\nmeans my voice and throat must<br />\nbe consistently in perfectcondition.<br />\nTherefore, although most of my<br />\nsmoking is done while I am on<br />\nvacation, it is all important to me<br />\nthat I be careful in choosing my<br />\ncigarette. I smoke Luckies because<br />\nI enjoy their taste and because<br />\nI feel it is wiser for me to choose<br />\na light smoke for my voice.\"<br />\n<br />\nPing-Pong<br />\nAnd Pool Equipment<br />\nPlanned For Game<br />\nROOM<br />\n<br />\nSENIORS!<br />\n<br />\nstill undecided, however, it is planned<br />\nfor the first or second week after the<br />\n<br />\nclose of the Spring Vacation.<br />\nDr. Victor Jolles, formerly of the<br />\nThe students planning to take the<br />\nKaiser Wilhelm Institute, Germany, COmprehensive are<br />\nexpected to acand now professor at the University quire as much as possible from their<br />\nof Wisconsin, is lecturing at the Hop- own reading and by their own methkins under the auspices of the Zoo- ods of study a survey of the historical<br />\ndevelopment of scientific thought, an<br />\nlogy Department. He is tendering a<br />\nunderstanding of scientific method,<br />\nseries of two lectures, one of which the different<br />\nrecognized branches of<br />\nwas delivered yesterday, and the other science and their interrelations, the<br />\nto be delivered today.<br />\nmajor conclusions on which they are<br />\nThe lecture yesterday, delivered in based, and the lines of investigation<br />\nRemsen 221 at 4 p.m. dealt with followed most actively pursued at<br />\n\"Problems of Heredity and Variation present.<br />\nWomen's colleges are most liberal<br />\nof Microorganisms.\" The lecture today<br />\nSeniors are advised to consult their<br />\nbecause so many of their students on<br />\n\"Recent Attempts to Test the advisers or Dr. R. P. Cowles, Chaircome from cosmopolitan drinking Role of Cosmic Radiations in<br />\nthe man of the Natural Science group, in<br />\nProduction of Spontaneous Muta- the event any queries arise concerning<br />\nareas.\"<br />\ntions,\" will be delivered at 4 p.m. in their reading.<br />\nMore Students Drinking<br />\nMaryland 110.<br />\nA copy of the reading list may be<br />\n\"Opinion as to whether or not the<br />\nDr. Jolles has done considerable obtained in Dean Berry's office, Remgeneral increase was deleterious,\" work in the field of protozoan<br />\ngene- sen 114.<br />\ncontinued the Digest, \"depended on tics and the induction of variation in<br />\nthe correspondent's personal opin- protozoa, and also, has worked in<br />\nDrosophilan genetics, in its special<br />\nions. Many students who had never<br />\nrelation to temperature and radiation<br />\ntouched liquor prior to college days, effects.<br />\nJust now -his work is being<br />\nit was disclosed, found social pres- widely discussed through the world<br />\nsure or the new availability of liquor in zoological centers.<br />\nA Phase of Preventive Medicitte<br />\nor the safety of government-bonded •<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nstock an inevitable incentive to drink<br />\nJ. H. FURST CO.<br />\nHARVARD<br />\nUNIVERSITY<br />\nmoderately.\"<br />\nPrinters of<br />\n<br />\nCommittee Ponders<br />\nLeveringi Changes<br />\n<br />\nThe newly organized committee for<br />\nthe improvement of Levering Hall<br />\nmet recently and formulated many<br />\nplans. Various arrangements were<br />\nconsidered with regard to making better use of the available space.<br />\nAt its meeting the group determined that something should be done<br />\nimmediately about the need for a<br />\nroom for the \"Y\" Cabinet. As a result, the room on the left of the<br />\nentrance to the dance floor is being<br />\nprepared for its use.<br />\nThe group is planning to have a<br />\ngame room, with facilities for ping<br />\npong and pool. The Sherwood parlor<br />\nis to be given over entirely to the<br />\ngirls on the campus, both graduate<br />\nstudents and students in the College<br />\nfor Teachers. A room will also be<br />\nretained as a study hall with , a little<br />\ngreater freedom for conversation than<br />\nis possible in the library. The reading<br />\ncorner may be enlarged and the<br />\namount of literature available increased. No small amount of discussion is concerned with the present<br />\narrangement of the soda fountain and<br />\ncafeteria. It is problematical whether<br />\na satisfactory solution can be reached<br />\nwithin a short period of time.<br />\n'<br />\nThe committee will welcome helpful suggestions. Any student wishing<br />\nto be of assistance should communicate with members of the comirnitte<br />\nor with Miss Diggs at the desk in<br />\nLevering Hall.<br />\n<br />\nof books for the Comprehensive<br />\nExamination. The date upon which<br />\nthe examination is to be given is<br />\n<br />\nAn independent survey was made recently<br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMiss Jepson verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies—a light smoke, free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br />\n<br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br />\n<br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937, The Ammican Tobacco Company<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 9, 1937<br />\n<br />\nJay Cagers Bow Jay Handballers Norman Baetjer Places First FreshmenA.B.Whip 21 Aspirani<br />\nTop Pennsylvania In A.A.U. Seventy Yard Dash Mechs To Capture Inaugurate IV<br />\nBefore Johnnies Team<br />\nBy 5-1 Score Equals Time Made By Hopkins Of Virginia In Surprise Interclass Honors<br />\nTrack SeasoII<br />\nTo Close Season Milberg And Pasternak Star<br />\nVictory; Defeats Fine Field At Track And<br />\nSoph Engineers, Goldman A.<br />\nField Meeting Saturday Night<br />\n<br />\nFor Jays In Singles<br />\nAnd Doubles<br />\n<br />\nCrabtowners Score 33 To 23<br />\nVictory To Avenge Earlier<br />\nLoss<br />\nSt. John's And Western<br />\nMaryland To Be Met<br />\nHARD FOUGHT TILT<br />\nFriday and Saturday<br />\nSiegel Brilliant In Last Ap- The Hopkins wallmen scored their<br />\npearance On Hardwood fourth intercollegiate victory by defeating the University of PennsylFloor<br />\nby 5-1.<br />\n<br />\nC., All-Stars Defeated<br />\n<br />\nCoach<br />\n<br />\nHambleton<br />\n<br />\nRecog-<br />\n<br />\ntion leads to high hopes for a sucnizes Need For Track<br />\nIn Playoffs<br />\ncessful track season.<br />\nAnd Field Material<br />\nBaetjer, a Sophomore in the BusiTo<br />\nWith<br />\nWinners<br />\nClash<br />\noutbeen<br />\nhas<br />\nness Economics school<br />\nGRAZIANO IS CAPTAIN<br />\nstanding in athletics at the Hopkins.<br />\nMaryland Intramural<br />\nHis place-kicking on the football<br />\nFirst Meet Against Swani hChampionship Five<br />\nfield and his fine work at end last<br />\nmore At Philadelphia<br />\nseason won for him honorable menPlaying truly championship ball<br />\ntion for all-state honors. The Jay<br />\nOn April 10<br />\nthe Freshmen AB basketball team<br />\nspeedster's performances in the 100<br />\nwon<br />\nthe<br />\ninter-class title when it deTwenty one stalwart track aspiryard and 220 yard dashes in the track<br />\nfeated the Senior Mechanics in the ants inaugurated a series of practice<br />\nvania, Saturday afternoon,<br />\nseason last year gave evidence of<br />\nfinal game.<br />\nsingles<br />\nsessions last week under the direchis track ability which came to light<br />\nThe Johns Hopkins basketball team The victors dropped only one<br />\nBefore entering the all important tion of Coach Waldo Hambleton. The<br />\nmatch to Penn at the Homewood<br />\nnight.<br />\nSaturday<br />\nvictory<br />\nfine<br />\nhis<br />\nwith<br />\nseason<br />\nfinished its 1937 hardwood<br />\ncontest the victors had taken the turnout, though not as large as excourts.<br />\nLast Saturday night's track meet,<br />\n,last Saturday night at Annapolis<br />\nmeasure of all the competition in the pected, included a number of canIn the first singles, Irving Milberg<br />\nwhich was the first indoor track<br />\nwhen it bowed to a slow-moving, fast had little difficulty in turning back<br />\nleague as well as the Soph didates owning impressive highThursday<br />\nmeet held in Baltimore for ten years,<br />\nEngineers who were met in one of school records.<br />\nbreaking, group of St. John's cagers. Anderson of Penn, 15-1, 15-11. In the<br />\nwhen<br />\ntime<br />\nof<br />\nthe<br />\nreminiscent<br />\nwas<br />\nfinals.<br />\nthe play off games.<br />\nplayed<br />\nMr. Hambleton recognizes the need<br />\nAnderson<br />\ngame,<br />\nJohns Hopkins University held its<br />\nThe game, played in a gymna- second<br />\nSuccessful Season Seen<br />\nThe runner up gained the right to for capable men in all branches of<br />\nMilmatch<br />\nfield<br />\nnot<br />\nhe<br />\nand<br />\ncould<br />\ntrack<br />\nsmoothly,but<br />\ninvitation<br />\nannual<br />\nThe showing of the Hopkins ensium packed with Homecoming alumparticipate for the crown by con- field and track. He emphasized deberg's speed and accuracy. Dick Pas- trants in such high class competi- meet at the Armory.<br />\nni, ended with the score at 33-23.<br />\nthe Goldman A.C. and the ficiencies especially in the high jump,<br />\nquering<br />\nthe<br />\nthrough<br />\nsailed<br />\nHopkins,<br />\nternak,<br />\nThis contest served to nullify the de- second singles by defeating Rockmore<br />\nNew Jersey All-Stars in addition to pole vault, and high hurdles. A numthe teams in its own league.<br />\nfeat handed the Johnnies by the Jays 15-9, 15-10. Dick played his usual<br />\nber of veterans have returned for<br />\nThe final contest was closely con- another year of competition, but<br />\nin their tussle at Homewood on Jan- fine game.<br />\ntested and the ultimate result was they are not numerous enough to<br />\nBackman, of Pennsylvania, won the<br />\nuary 16, thus setting a tie-up in honin the nature of an upset since the fill all the vacant positions.<br />\nors between the traditional rivals visitors' only victory, but not until<br />\nloser's line-up, studded with outGraziano Heads Squad<br />\nafter a hard fight put up by Captain<br />\nfor the past series of hoop battles.<br />\nstanding men such as Wiseman,<br />\nLqd by Captain Graziano, star<br />\nNat Finklestein. The match went to Fifty Candidats In Battle For Yearlings End Season With<br />\nBiepler and Gambrill was conceded sprint man and broad-jumper, the<br />\nThe affair started very slowly, with<br />\nthree games, 15-10, 9-15, and 15-10.<br />\nto have an edge. However, the Fresh- following veterans reported for imFive Wins And Two<br />\nJ. H. U. Badminton<br />\nthe home team getting first blood on Milt Alperstein won the last singles<br />\nman team, led by Litowitz, Bitsack, mediate action: J. A. O'Neill, the<br />\nLosses<br />\na foul snot. After that, the score see- by conquering \"Blimp\" Wolinsky afAwards<br />\nand Bernstein, provided too much of Jay's leading hurdler; G. Willen a<br />\nsawed to both sides, being tied up at ter three games, 15-4, 12-15, 15-9.<br />\nan attack for the Engineers.<br />\nfield man specializing in throwing<br />\nThe Johns Hopkins Jay Vee basThe Badminton Tournament under<br />\nfive instances during the first half,<br />\nWin Both Doubles<br />\nTo Meet Maryland<br />\nthe javelin; Tom Ellis, Hopkins conof Reuben Baer keteers bowed to the St. John's jundirection<br />\ncapable<br />\nthe<br />\nAs has been the custom, the inter- tribution to the Olympian arts of<br />\nfinally stopping at 17-13 in favor of<br />\nThe Blue Jays won both doubles.<br />\nswung into action, last week, in order ior varsity by the count of 23-13 last<br />\nclass champs of the University of discus tossing and pushing the shot;<br />\nthe Crabtowners when Ref Enright Pasternak paired up with Milberg to determine the best \"Birdie SwatSaturday evening in a curtain-raiser Maryland will be met by the newly Carl<br />\nnew<br />\nThis<br />\n15-8.<br />\n15-12,<br />\nfirst,<br />\nthe<br />\ntake<br />\nto<br />\nScharpf, a distance runner; John<br />\nIn<br />\nperiod.<br />\ntooted his horn to end that<br />\nter\" of the University. Over fifty en- to the varsity battle of both teams.<br />\ncrowned champions. The contest is Driscol, a middle-distance man of<br />\ncombination clicked smoothly, to the<br />\nvery<br />\nsport<br />\nthusiasts of this popular indoor<br />\nthis part of the fray, play was<br />\nThe calibre of the Black and Blue's scheduled to take place tomorrow some<br />\ndisadvantage of Anderson and Rockworth.<br />\ndeliberate, with no passes going to more. The Pennsylvania team ap- have entered in the ladder tournament, game was so decided a let down as night at College Park. Last year the<br />\nA<br />\nof last year's squad have<br />\nnumber<br />\nshowing the ever-increasing popular- compared with their regular play that<br />\nHopkins team was easily downed by nix as yet turned up, but their names<br />\ncovered receivers, with scoring set- peared to be unfamiliar with the sinity of this game which came to the the defeat may well be justified as<br />\na strong Maryland aggregation but are expected to be among those<br />\nups arranged before the ball was put gle wall court, and were bewildered U. S. from England. The entrants<br />\ndue to an \"off-night.\" When the half Reuben Baer hopes that this year's holding berths on the 1937 track<br />\nArsmashes.<br />\ncorner<br />\nvictors'<br />\nthe<br />\nby<br />\ninto motion. Quick breaks featured<br />\nare arranged in five ladders.<br />\ntime whistle blew the Johnnies were representatives will return victorious. crew. A few are Norman Baetjer,<br />\nnold Glantz combined with Joaquin<br />\nthe opening canto, and provided the<br />\nThe favorites are L. Applefeld, J. in the lead by 12-8, an advantage<br />\nsuperlative short distance dasher; H.<br />\nHernandez, former Cuban four-wall<br />\nslight edge gained by the Orange and champ, to win the second doubles, Neely, N. Finkelstein, M. Kronberg, which they retained throughout the<br />\n.Jarman, hurdler and high-jumper;<br />\nM. Macht. The members of each second half. Occasional spurts of the<br />\nBlack at that time.<br />\nCharley Morley, king of the Blue jay<br />\nand consequently the fifth Black and and<br />\nby means of challenge match- Blue Jay's, although they were too<br />\nladder,<br />\nmiddle distances; George Brown,<br />\nBlue victory, from Wolinsky and<br />\nJohnnles Increase Lead<br />\npositions, short and infrequent to make the conPennsylvanians es, will vie for the top four<br />\na two-miler of proven team value;<br />\nThe<br />\nBackman.<br />\nat<br />\nSt. John's increased their lead<br />\nin order to reach the play-offs. The test a close one, were indicative of<br />\nPaul Castelle,another man who doesn't<br />\npressed the Jays hard in the first two<br />\nthe fine brand of ball they have disthe offset of the last inning on shots games, taking the second, but were ladders are arranged as follows:<br />\nAfter dropping two matches to walk his mile for a camel; and Harold<br />\nnow is the time for all good played throughout the season. High<br />\nby Delisio and Ross. They were never swamped in the decisive third game.<br />\na potential field star.<br />\nMaryland, the Black and Blue Zheutlin,<br />\nWestern<br />\nLadder B<br />\nscoring honors for the visitors were<br />\nLadder A<br />\nIn<br />\nthere follows a list of<br />\naddition<br />\ntied by the visiting team after those The scores of the last match were<br />\nJ. Neely<br />\nshared by Clements and Angual with rifle team of Hopkins registered a hopefuls whose<br />\nL. Applefeld<br />\nnames have not as<br />\ntosses swished through the nets. Lam- 15-13, 14-15, and 15-5.<br />\nvictory<br />\nover<br />\nGettysburg<br />\nUniversity.<br />\nR. Cluster<br />\n6 points, while Bill Day, high scorer<br />\nH. Slinger<br />\nplaced<br />\nin limelight spots:<br />\nbeen<br />\nyet<br />\nsteadscheduled<br />\nlead<br />\nthe<br />\nbeen<br />\nA return match has<br />\nbros and Ross built up<br />\nof the season, lead the Hopkins J. V.'s This contest was a shoulder-to F. Lewis, M. B. Macht, J.<br />\nM. Nachlas<br />\nJ. Karfgin<br />\nHamilton,<br />\nily on fast cutaways toward the bas- at Philadelphia on Saturday afterthis<br />\nmatch,<br />\nand<br />\nshoulder<br />\nvicwith<br />\nH. Brown<br />\nby accounting for 5 points.<br />\nR. Levine<br />\nH. Steingrob, D. Kerstetter, J. Steepket after Captain Delisio had set up noon, March 20. The match will be B. C,ourtwright<br />\non<br />\nwon<br />\nits<br />\ntory,<br />\nHopkins<br />\nSaturday,<br />\nL. Piven<br />\nThis encounter brought to an end<br />\ner, S. Miller, E. Feinblatt, W. Holman,<br />\nthe play on a pass to Rowe, the John- played on fourwall courts, giving an M. Fine<br />\nfifth out of seven matches.<br />\nE. Frey<br />\nsuccessful season for the Hopkins<br />\na<br />\nH. Hopkins, G. Carleton, C. Dresch,<br />\nny center. However, it was not these advantage to the Penn team. The F. Butt<br />\nPhil<br />\na<br />\nGuild<br />\nup<br />\nmarked<br />\nperfect<br />\nD. Tissenbaum<br />\nJunior varsity with 5 wins against 2<br />\nB. Rome, S. Rosner, and J. Billovitz.<br />\nfield goals that provided the margin Hopkins aggregation has seen most L. Peters<br />\nscore from the prone position, shot<br />\nC. Schwartzman<br />\nlosses.<br />\n1937 track schedule:<br />\nof victory for the home team as the of its intercollegiate action on sin- J. Handelsman<br />\n90<br />\nsitting<br />\nand<br />\nfrom<br />\nthe<br />\n74<br />\nposition,<br />\nM. Seal<br />\nV.'S<br />\nJ.<br />\n10<br />\nJOHN'S<br />\nApril<br />\nAway<br />\nSwarthmore<br />\nST.<br />\nSt.<br />\nby<br />\nexpects<br />\naway<br />\ntherefore<br />\ngle wall courts, and<br />\nten two-pointers put<br />\nstanding for the total of 264. ToA. Musick<br />\nD. Peek<br />\nG. F. T.P.<br />\nApril 17<br />\nAway<br />\nHaverford<br />\nJohn's were matched by an equal to be slightly handicapped. Last year, S. Brozeck<br />\nby<br />\ngether<br />\nwith<br />\nthe<br />\nshot<br />\n264<br />\nLindenD. Meigs<br />\n2<br />\n0<br />\n1<br />\nApril 21 ..Western Maryland ....Home<br />\nBoeris, f.<br />\nnumber by the M.allonee-men. Hop- Pennsylvania defeated the Jays on J. Pollack<br />\nmayer, Guild copped high mark for<br />\n2<br />\n0<br />\n1<br />\nApril 23-24 Penn Relays Philadelphia<br />\nClose, f.<br />\nkins managed to put away only three their courts, 5-1, which is the reversed<br />\nthe afternoon.<br />\nLadder D.<br />\nLadder C<br />\n0<br />\n0<br />\nAway<br />\n0<br />\nApril 27<br />\nCatholic U.<br />\nf.<br />\nRenshaw,<br />\ncharity tosses, while their opponents' score of their latest meeting.<br />\nHOPKINS<br />\nM. Kronberg<br />\nN. Finkelstein<br />\n2<br />\n0<br />\n1<br />\n1<br />\nMay<br />\nHome<br />\nCollege<br />\n_Washington<br />\nc.<br />\nWeisheit,<br />\ntimes.<br />\n13<br />\ntrue<br />\nran<br />\nfoul shots<br />\nGuild<br />\n100 90 74- -264<br />\nL. Ransom<br />\nSt. John's Next<br />\nC. Flagle<br />\n0<br />\n3<br />\nMay 8<br />\nHome<br />\nMason-Dixon<br />\nClements, c.<br />\n98 90 76-264<br />\nLindenmayer<br />\nChrist<br />\nC.<br />\nOrchids To Herby<br />\nGorden<br />\nL.<br />\nAnnapolis<br />\nto<br />\nwill<br />\ntravel<br />\nThe team<br />\n0<br />\n0<br />\n0<br />\nChampionship<br />\nLyon, c<br />\n98 93 64-255<br />\nRossberg<br />\nA. Sklar<br />\n6<br />\n0<br />\nHerby Siegel, captain and right for- Friday afternoon to face St. John's. P. Reigner<br />\nMay 14-15 Middle Atlantic<br />\n3<br />\nAngual, g.<br />\nLeber<br />\n96 80 74--250<br />\nLittler<br />\nC.<br />\nWestendorf<br />\nC.<br />\nthe<br />\nfor<br />\ngame<br />\nthe<br />\nbetween<br />\n0<br />\nward, played his final<br />\n0<br />\nIt will be the first match<br />\n0<br />\nMeet .... Gettysburg<br />\nHeenen, g<br />\nStegmaier<br />\n96 86 55-231<br />\nL. Shettles<br />\n5<br />\nBlack and Blue at Annapolis, and will schools this season. The Johnnies S. Prager<br />\n3<br />\n1<br />\nTucker<br />\nA. Welch<br />\nbe the only man lost to the squad. went down before the Jays last year, M. Breyer<br />\nTotal<br />\n1270<br />\nRailing<br />\nW.<br />\nAskins<br />\nS.<br />\nhead<br />\nthe<br />\nMaat<br />\nWestern<br />\nseason<br />\nmorning,<br />\nthe<br />\n23<br />\nSaturday<br />\nfinished<br />\n3<br />\n7-0.<br />\nHerby<br />\n10<br />\nGETTYSBURG<br />\nArosa<br />\nA.<br />\nRosenblatt<br />\nJ.<br />\nof his team in scoring, thus furnish- ryland will come to Homewood to<br />\nHill<br />\n93 85 68-244<br />\nVarsity baseball practice took place<br />\nHOPKINS J. V.'S<br />\nW. Durding<br />\ning more than the usual guiding hand. play off their return match. Earlier E. Thomas<br />\nDoll<br />\n83<br />\n95<br />\n63-241<br />\nT.P.<br />\nlast<br />\nSaturday, at the Gilman Country<br />\nF.<br />\nG.<br />\nPopow<br />\nJ.<br />\nHe went through every game giving in the season, the Terrors were shut I. Scherles<br />\nFricy<br />\n93 81 64-238 School cage under the watchful eye<br />\n2<br />\n0<br />\n1<br />\nf.<br />\nReynolds,<br />\nHarris<br />\nH.<br />\nball,<br />\nheads-up<br />\nout, 5-0, at Westminster.<br />\na fine exhibition of<br />\nMcCormack<br />\n89 79 69-237 of Coach Robert E. Owings. About<br />\n2<br />\n0<br />\n1<br />\nSilberman, f.<br />\nLadder E.<br />\nand will be a very hard man to reSINGLES<br />\nCompton<br />\n94 67 31-192 forty candidates worked out under<br />\n0<br />\n0<br />\n0<br />\nf.<br />\nBeeler,<br />\nM.<br />\nMacht<br />\nof<br />\nyears<br />\nplace. Siegel has played four<br />\nMilberg, Hopkins, defeated AnderThe<br />\n--- perfect weather conditions.<br />\n5<br />\n1<br />\n2<br />\nDay, f<br />\nR. Levy<br />\nvarsity ban, an enviable record for son, 15-1, 15-11.<br />\nTotal<br />\nwere<br />\n1152<br />\nand<br />\npitchers,<br />\n2<br />\n0<br />\nbatters,<br />\n1<br />\ninfielders<br />\nc.<br />\nWetzler,<br />\nGreenberg<br />\nP.<br />\nany courtman, and throughout his caPasternak, Hopkins, defeated Rockdrilled intensively in their respective<br />\n2<br />\n0<br />\n1<br />\nNaylor, g<br />\nL. Tilken<br />\nreer at Hopkins has been a constant more 15-9, 15-10.<br />\narts.<br />\n0<br />\nSeveral freshmen prospects<br />\n0<br />\n0<br />\ng.<br />\nBaum,<br />\nWaxman<br />\nJ.<br />\nscoring threat, a veritable thorn in<br />\nshowed themselves up to a good ad0<br />\n0<br />\nBackman, Pennsylvania, defeated<br />\n0<br />\ng.<br />\nSnodgrass,<br />\nFinkelstein<br />\nN.<br />\nfastThe<br />\nopponent.<br />\nthe side of every<br />\nvantage. The splendid showing of the<br />\n0<br />\n0<br />\nFinkelstein, 15-10, 15-10.<br />\n0<br />\nRoyster, g<br />\nF. Diehl<br />\nest man on the squad, he is a good<br />\nbrightened the hopes for a<br />\nfreshmen<br />\n0<br />\n0<br />\n0<br />\ng.<br />\nWoWillen,<br />\ndefeated<br />\nJ.<br />\nHopkins,<br />\nEnders<br />\nAlperstein,<br />\nunder<br />\noutside,shot, but really excels<br />\ngood year in the diamond wars. Prac—<br />\nM.<br />\n15-9.<br />\n12-16,<br />\n15-4,<br />\nBrilliant<br />\nlinsky,<br />\nhe<br />\nwhich<br />\nin<br />\nshot,<br />\npet<br />\nHis<br />\nbasket.<br />\nthe<br />\ntice will be held on the lower field<br />\n13<br />\n1<br />\n6<br />\nW. Peters<br />\nDOUBLES<br />\ndribbles in from the sidelines toward<br />\ntoday.<br />\nto<br />\nmotion<br />\nHopkins,<br />\nMilberg,<br />\nside-like<br />\nand<br />\na<br />\nwith<br />\nPasternak<br />\nthe basket<br />\nVictory Over Blue Ridge Gives<br />\nthen leap up and deposit the sphere defeated Anderson and Rockmore,<br />\nFrosh Team Four Victories<br />\nmost<br />\nthe<br />\npractically<br />\n15-12, 15-8.<br />\nin the netting, is<br />\nAnd Two Defeats<br />\nHernandez and Glantz, Hopkins, dedifficult to guard against.<br />\n15-13,<br />\nAltho the game marred somewhat feated Wolinsky and Backman,<br />\nThe Freshman basketball team ended their season by defeating a strong<br />\nthe scoring spree of the Homewood 14-15, 15-5.<br />\nChampionSchool<br />\nFor<br />\nDefeats Small In Handball Match<br />\nboys during the past few contests,<br />\nBlue Ridge team.<br />\nDivision A<br />\nHOPKINS<br />\nthis season represented one of the<br />\nship; Wins Gold Medal<br />\nStarting the season off with a vicWon Lost.<br />\n1 0-0 2<br />\nMelvin, f.<br />\nmost successful basketball eras in<br />\ntory over the J. V. the Freshmen, un0<br />\n7<br />\nKappa Alpha<br />\nThe third annual handball tourna- Schol where he was a letterman both der the tutelage of Coach Frank Dot3 2-3 8<br />\nSiegel, f.<br />\nrecent years. Much praise is due<br />\n6<br />\n1<br />\nPi Lambda Phi<br />\nment came to a close last Friday as in swimming and tennis. In 1931, he terweich have defeated Blue Ridge<br />\n2 0-1 4<br />\nCross, c.<br />\nCoaches Mallonee and Twardowicz in<br />\n2<br />\n5<br />\nDelta Upsilon<br />\nMilton Alperstein conquered Philip won the New York State Archery twice and Towson. They have lost<br />\n2 1-2 5<br />\nRasin, g.<br />\ntheir development of the present club.<br />\n3<br />\n4<br />\nTau Alpha Omega<br />\nSmall to win the gold medal by the Tourney and was presented with the two hard fought games to Tome and<br />\n2 0-2 4<br />\nZheutlin, g.<br />\nIt is seldom that these men are nogold medal symbolic of victory by Gilman.<br />\n4<br />\n3<br />\nKappa Alpha<br />\nscores of 21-15, 21-16.<br />\n— — —<br />\nticed by spectators, or is any glory of<br />\n5<br />\n2<br />\nPhi Epsilon Pi<br />\nMilt Alperstein, Sophomore pre- President Roosevelt, then Governor<br />\n10 3-8 23<br />\nTotals<br />\nvictory theirs, but their work was of<br />\nThe members of the team who<br />\n0<br />\n6<br />\nPhi Kappa Psi<br />\nmedical student, reached the final of New York State.<br />\nST. JOHN'S<br />\nsuch a nature that any orchids set<br />\nhave been mainstays are Brayshaw,<br />\nSmall Silver Medalist<br />\n6<br />\n0<br />\nPhi<br />\nSigma<br />\nDelta<br />\nround by defeating Harry Nieren2 1-1 5<br />\nLambros, f.<br />\nforth here would, of necessity, be inMcand<br />\nQuitt, Litowitz, Traymor<br />\nPhil Small, runner-up in the tournaDivision B<br />\nberg, while Small defeated Floyd<br />\n4 3-3 11<br />\nRoss, f.<br />\nsufficient.<br />\nGovern. These men will be posilver<br />\nthe<br />\nof<br />\nwinner<br />\nthe<br />\nis<br />\nment,<br />\nmedals<br />\nreceive<br />\nWon Lost<br />\nwill<br />\nfour<br />\nAll<br />\nKatske.<br />\n1<br />\n5<br />\n3-6<br />\nc.<br />\nRowe,<br />\ntential material for the varsity team<br />\nCarl Rasin and Harold Zheutlin<br />\nmedal. He is not a member of the<br />\n8<br />\n0<br />\nPhi Gamma Delta<br />\nfuture assembly.<br />\n6<br />\na<br />\nat<br />\n0-2<br />\n3<br />\ng.<br />\nDelisio,<br />\nthe<br />\nup<br />\ntake<br />\nand<br />\nto<br />\nball<br />\nhard<br />\nplayed<br />\nnext<br />\nyear<br />\nyear,<br />\nhaving<br />\nnext<br />\nback<br />\nwill be<br />\nof his affilbecause<br />\nteam<br />\nhandball<br />\n2<br />\nwas<br />\n6<br />\nathlete,<br />\nversatile<br />\nOmicron<br />\na<br />\nKappa<br />\nOmicron<br />\nAlperstein,<br />\n6<br />\n6-8<br />\n0<br />\ng<br />\nShawn,<br />\nhaving improved greatly this season.<br />\nburden at the guard posts, and should<br />\n2<br />\n4<br />\nPhi Alpha<br />\nof the handball team last iation with the fencing team. He<br />\nmember<br />\na<br />\nplay<br />\nof<br />\ntype<br />\ntheir<br />\ncontinue<br />\nthese men<br />\nHe is a sophoepee.<br />\nand<br />\nfoil<br />\nfences<br />\n3<br />\nwith<br />\nthe<br />\n3<br />\nplaying<br />\nbeen<br />\nPhi<br />\nDelta<br />\nhas<br />\nand<br />\nyear<br />\n33<br />\n13-18<br />\n10<br />\nTotals<br />\nin 1938, Hopkins will go far. Shorty<br />\nstudent from<br />\npre-medical<br />\n3<br />\n3<br />\nAlpha Epsilon Pi<br />\nvarsity during the present season. more<br />\nScore by halves:<br />\nCross has improved steadily this seagraduated<br />\nhaving<br />\nY.,<br />\nN.<br />\nBrooklyn,<br />\nJunthe<br />\nof<br />\n3<br />\n2<br />\nmember<br />\nAlpha Delta Pi<br />\na<br />\nwas<br />\nalso<br />\nHe<br />\n17 16-33<br />\nSt. John's<br />\nson, adding continually to his scoring<br />\nClasses in tap dancing begin to3<br />\n2<br />\nBeta Theta Pi<br />\nior Varsity basketball team and is from Lincoln High School.<br />\n13 10-23<br />\nHopkins<br />\ntotal, and being a ne man to work the<br />\nmorrow at. me gym unuer WC Luanu<br />\nsophomore<br />\nNierenberg,<br />\nHarry<br />\non<br />\nbase<br />\n2<br />\n4<br />\nthird<br />\nfor<br />\nprospect<br />\nTau Phi Epsilon<br />\nlikely<br />\na<br />\nTraggis<br />\nHopkins,<br />\n—<br />\nNon-scorers<br />\nin<br />\nnotorious<br />\nMelvin,<br />\nNorm<br />\nball with.<br />\nFloyd Katske, senior, are the winners telage of Jack Bamberger. All those<br />\n0<br />\n4<br />\nTau Alpha Phi<br />\nBrown, the Baseball Team.<br />\nthe league for his dangerous overhead Rubinger; St. John's, Owens,<br />\nof the bronze medals. They are both desiring to enter the class are urged<br />\nadto<br />\n0<br />\nshowed<br />\n5<br />\nSigma Phi Epsilon<br />\nHis athletic ability<br />\nSimopouEnnis,<br />\nStrange,<br />\nGolstein,<br />\nfinefforts,<br />\nunderbasket<br />\nshots and<br />\nto notify him immediately.<br />\nvantage in George Washington High members of the handball squad.<br />\nishes his second year of varsity play.<br />\nSurprising a good field, Norman<br />\nBaetjer sprinted to victory in the<br />\n70 yard A.A.U. dash at the track<br />\nand field meet at the Fifth Regiment<br />\nArmory Saturday night in the time of<br />\n7.2 seconds. In placing first, Baetjer<br />\nenabled the Hopkins to tie for the<br />\nfourth place in the A.A.U. division<br />\nin a field of twenty opponents with<br />\na total of five points.<br />\nBaetjer's time of 7.2 seconds<br />\nequalled the time made by Hopkins<br />\nof Virginia who won the Intercollegiate division of the 70 yard dash. Ted<br />\nGraziano, the Hopkins entrant in<br />\nthat division, placed third in his<br />\nheat, and was eliminated in the semi-<br />\n<br />\nI<br />\n<br />\ntI<br />\n<br />\nBirdmen Commence Jay Vee Courtmen<br />\nTournament Play Lose To St. John's<br />\n<br />\nBlue Marksmen<br />\nTop Gettysburg<br />\n<br />\nBASEBALL<br />\n<br />\nFreshman Quintet<br />\nConcludes Successful<br />\nSeason With Victory<br />\n<br />\nAlpersteinVictorInTournament<br />\n<br />\nFinal Frat<br />\nStanding<br />\n<br />\nTAP DANCING<br />\n<br />\ni<br />\nai<br />\nal<br />\n<br />\nIn<br />\ndi<br />\nT1<br />\nth<br />\nbe<br />\nJu<br />\nth<br />\n<br />\nev<br />\nnu<br />\nin<br />\n<br />\nyo,<br />\n<br />\nrel<br />\narr<br />\nof<br />\n<br />\nnui<br />\n<br />\nthE<br />\n<br />\n/<br />\n<br />\nof<br />\nit<br />\n<br />\nwh<br />\n<br />\norn<br />\n<br />\nlev<br />\n<br />\nact<br />\n<br />\nclu.<br />\n<br />\npar<br />\nten<br />\nthe<br />\nat<br />\n<br />\ndoll<br />\nin<br />\nof<br />\n<br />\nTi<br />\n<br />\nInsi<br />\n<br />\nin I<br />\n<br />\ndell,<br />\n<br />\nto t<br />\nthe<br />\nIn<br />\n<br />\np.m.<br />\n<br />\nseri(<br />\ntwo<br />\nHov‘<br />\nSpet<br />\nChu<br />\n<br />\nDi<br />\nfirst<br />\nand<br />\nSt<br />\nBlur<br />\nshee<br />\n<br />\nOffiC4<br />\n<br />\nstud<br />\n<br />\nAll.<br />\n<br />\nT1<br />\npres.<br />\nerini<br />\nsist<br />\nMoz<br />\nthe<br />\nfor f.<br />\n<br />\n\f", "format": "basic_html", "processed": "kiting Ijiipftirni Nrius-TErttrr<br /><br />\nSENIORS!<br />\nPAY JUNE WEEK FEE<br />\nBY FRIDAY<br />\nVOL. XLI. No. 29<br /><br />\nDON'T FAIL TO HEAR<br />\nHAYS'\"FRAME-UPS\"<br />\nNEXT THURSDAY<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 9, 1937<br /><br />\nA. Garfield Hays Takes Latrobe Platform Bradford Says High Court Dubbed<br />\nR.O.T.C.AnnualBall Super-Legislature<br />\nNoted Legalist<br />\nWill Be In Levering By Prof. Corwin<br />\nTo Give Lecture<br />\nTownsman Orchestra Will Lecturer Applauds Roosevelt<br />\nProvide Music Nite Of<br />\nApril 30<br /><br />\n\"Frame-ups\" Subject Of Assembly Address Next<br />\nThursday<br /><br />\nCommittee Of Cadet Officers Tells Latrobe Audience That<br />\nExpects Dance To Be Best<br />\nTimes Demand New<br />\nHeld In Years<br />\nJudicial Outlook<br /><br />\nSIXTH LECTURE HERE<br />\nSpeaker Prominent As Member Of Civil Liberties<br />\nGroup<br /><br />\nCourt Plan In Every<br />\nDetail<br /><br />\n\"The annual function of the R.O.T.C.<br />\n•<br /><br />\nthe Military Ball, is to be held on<br />\nApril 30 in Levering Hall,\" announces<br /><br />\nBefore President<br />\nRoosevelt's<br />\nfireside talks this evening at 10.30,<br />\nDr. Thurman Arnold, professor of<br />\nconstitutional law at Yale University, will discuss the court proposal<br />\nat the Emerson Hotel. Dr. Kent<br />\nRoberts Greenfield, professor of<br />\nhistory here, will introduce the<br />\nspeaker. Senator Logan, of Kentucky, will speak before him. The<br />\nmeeting is open to the public.<br /><br />\nPRICE 5 CENTS<br /><br />\n$10,..June_Week<br />\nFee Must Be<br />\nPaid By Mar.31<br /><br />\nBerry To Be At Fireside<br />\nFollowing in the footsteps of the<br />\nfirst Fireside Discussion Group,<br />\nwhich met last Thursday at President Bowman's home, another<br />\nmeeting will be held at Levering<br />\nHall at 4.15 this coming Thursday.<br />\nDean Edward Berry of the College<br />\nof Arts and Sciences will speak.<br />\nTwo sheets, one in Levering Hall,<br />\nand the other in the Postoffice, will<br />\nbe posted. Each is limited to ten<br />\nnames of people who will definitely<br />\nattend. In the future, when two<br />\nmeetings a week are planned, sheets<br />\nwill be posted in Levering Hall on<br />\nFriday before the meeting. These<br />\nwill hold notifications of the speakers, the topics, and the time of<br />\nthe meeting.<br /><br />\nWill Levy $1 Fine If Payment<br />\nIs Not Made By<br />\nDeadline<br />\nGALA WEEK PLANNED<br />\nJune Week May Be Dropped<br />\nUnless Financial Campaign<br />\nIs Successful<br /><br />\nUnless the financial program of the<br />\nJune Week .committee is successful,<br />\nmittee, James Bradford. Together<br />\nthe annual Senior Class festivities<br />\nprominent legal mind, will address<br />\nclimaxing the undergraduate careers<br />\nwith his confreres on the committee<br />\nthe student assembly this Thursday.<br />\nof Hopkins students will be disconhe will attempt to surpass the success<br />\nHis subject will be \"Frame-ups.\"<br />\ntinued this year, James Bradford,<br />\nof previous affairs.<br />\nChairman of the 1937 June Week anMt. Hays, an outstanding New<br />\nOxford<br />\nUniversity Grants Go nounced<br />\nNo sponsor has as yet been apyesterday.<br />\nYork lawyer, is a member of the<br />\npointed, but the Townsman OrchesAnnually To 32 U. S.<br />\n\"It is the plan of the committee,\"<br />\nCivil Liberties group, a body devot- Activities Committee Sched- tra has definitely been engaged. The<br />\nIn an address which, in the eyes of<br />\nsaid Bradford, \"to contact every memStudents<br />\ning itself to discussion and exposure<br />\nber of the Senior Class and have each<br />\nTownsmen are far from unfamiliar many, supplemented President Rooseules<br />\nOther<br />\nSpeakers<br />\nFor<br />\nof such matters as racial feeling,<br />\nThe Trustees of the thirty-two sign a promissory<br />\nvelt's of the previous evening, Prof.<br />\nnote to pay the<br />\nwith<br />\ncampus<br />\nthe<br />\nas<br />\nhave<br />\nthey<br />\nprelynching, and other like subjects.<br />\nLater Appearance<br />\nEdward S. Corwin, of Princeton Uni- Rhodes Scholarships assigned annu- sum of ten dollars ($10.00) by March<br />\nviously made appearances at the<br />\nA member of the Pi Lambda Phi<br />\nversity, last Friday aftern000n assail- ally to the United States released 31. A monetary penalty of one dolBernard Pinck, head of the Dorm Cotillion Board's Saturday<br />\nfraternity, a chapter of which is on<br />\nnight ed the Supreme Court<br />\nas a self-consti- application blanks and information lar will be levied if the payment is<br />\nActivities<br />\nCommittee, announced tothe Hopkins campus, Arthur Garfield<br />\ndances and last year's Military Ball. tuted super-legislature under the form pertaining to the securing of a schol- not made by that date.\"<br />\nHays has proved himself a domin- day that the group is resuming its<br />\nTheir excellent work then made a of a judicial body, uncontrolled by the arship this year to attend the UniMay Be Paid Thursday<br />\nating personality. His speeches are functions of last semester, starting<br />\nlasting<br />\nimpression as is witnessed by Constitution and its own precedents versity of Oxford in 1938. These scholThe fee may be paid immediately<br />\nthe<br />\nball<br />\nrolling<br />\nwith<br />\nan<br />\naddress<br />\nto<br />\ndirect and fearless in denunciation<br />\narships were established under the by seniors upon<br />\nas well.<br />\nbeing contacted by<br />\nbe delivered Wednesday night by Dr. their unanimous choice this year.<br />\nor praise, as the case may be.<br />\nwill of Cecil J. Rhodes, South African members<br />\nof the committee, or may<br />\nBall Annual Affair<br />\nG. Wilson Shaffer head of the athletics<br />\nlie further stated that \"the present<br />\nstatesman, who died in 1902. Outside be remitted<br />\nSacco-Vanzetti A Topic<br />\nto the committee in the<br />\ndepartment at the Hopkins. \"Due to<br />\nThe Military Ball is a regularly court does what it pleases in many of the United<br />\nStates scholarships are Board Room of<br />\nHe has already spoken six times at exams and the recent state<br />\nLevering Hall on<br />\nof turbu- scheduled social event in the Johns eases, is anti-labor and pro-utility, awarded<br />\nthroughout the British Em- Thursday and<br />\nthe Hopkins and has discussed a vari- lence in the dorms,\" said<br />\nFriday at 4.00 p. m.<br />\nPinck, \"the Hopkins Calendar, tendered to the an exponent of laissez-faireism, and pire.<br />\nety of topics. The Sacco-Vanzetti committee deemed it<br />\nBradford appealed to all Seniors<br />\nunwise to pre- student body once a year by the stands against government intervenTo be eligible a candidate must be a for<br />\ncase, in which he had an active part, sent a program of a social<br />\ntheir complete cooperation in the<br />\nnature. R.O.T.C. Department. At this year's tion in social welfare. However male<br />\ncitizen of the United States, be- matter.<br />\nRussia, Naziism, intolerance in the Now we are ready to continue<br />\n\"The existence and proporwith a dance there will be a tariff of about it has never hesitated to reach tween<br />\nthe ages of 19 and 25 on Octo- tions of<br />\nUnited States are some of the sub- full and varied program.\"<br />\nJune Week are wholly deone dollar and fifty cents; refresh- out for more and more powers itself. br, 1938. He<br />\nmust have completed at pendent upon the<br />\njects upon which he has touched in<br />\nprompt payment by<br />\nDr. Shaffer, the first of the speakers ments such as punch, cake, cookies, I favor its complete independence in least his Sophomore<br />\nyear at the time members of the<br />\nthese lectures.<br />\nSenior Class,\" he<br />\npeanuts, are the judicial field alone, but the diffi- of application.<br />\ninvited for this semester will talk on potato chips, and<br />\nadded.<br />\nLast year he spoke on peace, dis- and discuss the new Hopkins Ath- under consideration, but not definitely culty is that the court has set indefinReceives $2,000 A Year<br />\nA tentative June Week program<br />\ncussing certain peace resolutions. He letic plan. Due to the enthusiasm and decided; and the affair will begin at ite limits to its power. Under<br />\npresent<br />\nThe recipient of a Rhodes Scholarhas been drawn up, but emphasis was<br />\nparticipation<br />\nAmerican<br />\nalso spoke on<br />\ngreat pride displayed by the students ten and last until one.<br />\nconditions there is nothing that it ship is given four<br />\nhundred pounds laid on the<br />\nin the Olympic Games at that time. over this plan, it is predicted that<br />\nfact that no plans can be<br />\nThe members of the committee, all cannot do.<br />\nwhich, at the present rate of exchange<br />\ncarried out until some assurance has<br />\nMr. Hays, who received his law de- great interest will be shown tomorseniors,<br />\nare<br />\nBradford, captain\"Supporters of the New Deal (and is equal to abbut two thousand dolbeen obtained that the affair will be<br />\ngree at Columbia University, in 1905, row night at the address. The new<br />\nadjutant in the R.O.T.C. and chairman they naturally are desirous of an ac- lars a year for two years. The scholar<br />\nfinancially possible. Three dances,<br />\nhas had a career which has been plan will probably be discussed more<br />\nof the committee; Herbert Hoffman, tive government) who cannot stom- is allowed to study in any field he<br />\na banquet, and a beach club party<br />\nmarked by strong convictions since fully than it has been in the past, as<br />\nfirst lientenant; Guy Stark, leutenant; ach the president's proposal, now that pleases towards a B.A. or a research<br />\nare included in the temporary prothe day he was jailed in a Pennsyl- Dr. Shaffer will have but a small and Ernest Peiper,<br />\nex-officio member, it has been made, are fuzzyminded. degree. He is awarded a third year<br />\ngram of the June Week activities.<br />\nvania mining camp for his assertion group to deal with.<br />\nlieutenant in status.<br />\nThey do not realize that this is the of study only if he has a plan of<br />\nThere is a possibility that one of the<br />\nof the rights of free speech. Perhaps<br />\nDr. E. Kennerly Marshal of the<br />\nbest and quickest way of furthering study which he plans to follow in<br />\nthree dances will be the annual Interhis greatest fame arose in connection<br />\nHopkins Medical School is the next<br />\nsocial progress by democratic means. this year. The tenure of a scholarship<br />\nPlayshop<br />\nPresent<br />\nTo<br />\nKirkley<br />\nFraternity Ball, sponsored by the<br />\nwith his work as defense attorney in<br />\nspeaker on the committee's list. Dr.<br />\nHow otherwise can Mr. Roosevelt is dependent on the maintenance of<br />\nInter-Fraternity Board. In addition,<br />\nthe Scopes trial in Tennessee.<br />\nMarshal is a member of the commitThe Playshop of Johns Hopkins (as he remarked so aptly last even- the Scholar of a standard of work many athletic contests usually<br />\naugAttendance Voluntary<br />\ntee on admissions, and the pre- University will present, as its March ing) justify his administration, come and conduct which, in the opinion of<br />\nment the gala week of celebration.<br />\nIf past performances are any indi- medico's in the dorm are more than event, a lecture<br />\n1941,<br />\nthe<br />\nif<br />\nhas<br />\nhe<br />\nnot<br />\nTrustees,<br />\nevery<br />\nused<br />\nfair<br />\njustifies<br />\nhis<br />\nscholarship.<br />\nby Mr. Donald KirkA Junior Class representative of<br />\ncation, Mr. Hays' address will follow looking forward to meeting the doctor.<br />\nIn the words of the Committee of<br />\nley, dramatic critic of the Baltimore means within his power to make it<br />\nthe<br />\nJune Week Committee will be anthe lines of an expository address,<br />\nSelection, \"some definite quality of<br />\nFollowing Dr. Marshal will be Dr. Sun. His subject will be \"Maxwell effective?\"<br />\nnounced shortly. This appointment is<br />\nrunning<br />\ncomand<br />\n,examples<br />\nwith<br />\nRobert A. Wood of the physics de- Anderson,\" to be followed the same<br />\nA great many in the audience were distinction, whether in intellect, char- being watched<br />\nby all Juniors with inmentary. He will then draw a con- partment of the Hopkins, and Dr. evening<br />\nby dramatic readings, given unaware of Professor Corwin's po- acter or personality, or in any com- tense interest, because the<br />\nholder of<br />\nclusion and get a remedy, if such Mansfield Clark. Other speakers are by members of<br />\nthe Playshop organi- sition before he spoke, and appeared bination of these, is the most impor- this position automatically<br />\nbecomes<br />\nthere be.<br />\ntant<br />\nrequirement for a Rhodes Scholalso being considered, and informa- zation. The scheduled date is March shocked by his views on the judicial<br />\nchairman of next year's June Week<br />\nThe assembly will be under the tion will be printed in the NEWS- sixteenth.<br />\narship.<br />\nIt<br />\nis<br />\nupon<br />\nthis<br />\nthat<br />\nCommit( Continued on Page 3, Col. 2)<br />\nCommittee. Several more Seniors will<br />\nsponsorship of the Student Council. LETTER as plans become definite.<br />\ntees in each district will insist. Sucalso be added to the committee.<br />\nThe meeting will be held, as usual,<br />\ncess in being elected to office in stuThe Dormitory Activities commitBesides Bradford, Gordon B. DickLatrobe 120 at 11.30, following the<br />\ndent organizations may or may not<br />\ntee is at present making arrangeler,<br />\nDavid Erck, H. W. Gambrill, R.<br />\nnew plan of voluntary attendance. ments<br />\nbe evidence of leadership in the true<br />\nfor its big social event, the<br />\nE. Hopper, Charles Rostov, and John<br />\nattend.<br />\nAll students are invited to<br />\nsense of the word. Mr. Rhodes eviannual dorm spring dance. Whether<br />\nS. Stevens are in charge of the June<br />\ndently regarded leadership as conthe affair is to be held in the commons<br />\nWeek activities. Roy Galloway, John<br />\nsisting in moral courage and interest<br />\nroom or in the lantern-lit out-ofSteeper, Bernie Pinck, and Joseph<br />\nin<br />\none's<br />\nfellow-men<br />\nas much as<br />\ndoors has not yet been announced.<br />\nHoffman, Senior Class officers, are<br />\nCorrespondent Blames Wyman Park \"Pixies\" For Starting in the more agressivequite<br />\nqualities. Physacting as ex-officio members of the<br />\nical vigour is an essential qualificaRaging Inferno; Maury Sheldon<br />\ncommittee.<br />\ntion for a Rhodes Scholarship, but<br />\n\"Library Museum\" Displays History<br />\nBecomes Hero Of Day<br />\nathletic prowess is of less importance<br />\nAnd Development of Modern<br />\nthan the moral qualities developed in<br />\nBy SEYMOUR SACKS<br />\nWarfare<br />\nBut what could we three—mere<br />\nplaying outdoor games. Financial<br />\nKatske Heads Three-Man Body Work- Unbeknownst to the several hundreds mortals—do against Mother Nature<br />\nneed does not constitute a special<br />\ning<br />\nWith<br />\nAndrews<br />\nweapons,<br />\nof<br />\npersons who were intently listen- on a rampage. It dawned on us. We<br />\nrangOn<br />\nA collection of old<br />\nclaim for consideration.\"<br />\nOrganization<br />\ning to Prof. Edward S. Corwin's could call the fireman. Yes, they could<br />\ning from primitive spears to pistols,<br />\nIt is found that a Rhodes Scholar- Beethoven's Eighth Symphony To<br />\ndiscourse on the issue of \"packing handle it. Tearing madly into the<br />\nis on display in the Gilman Memorial<br />\nship<br />\nis vacated by marriage, and<br />\nFeature Second Program Of<br />\nFloyd Katske, chairman of the the Supreme Court\" Friday evening, threatened building, we telephoned<br />\nroom of the main library. The exhibit<br />\nthat neither does one need to possess<br />\nA Series<br />\ngroup<br />\nendeavoring<br />\nform<br />\na<br />\nto<br />\nselfa mass of swirling, leaping flames for a rush order of fire-eaters.<br />\nhas been the result of the clearing out<br />\na knowledge of Greek or to take a<br />\nof shelves in the library, and will be governing board for the dormitory were swiftly creeping through the<br />\nMeanwhile Maury had found a written examination<br />\nto obtain a<br />\nThe second of a series of recorded<br />\nknown as the Library Museum. They announces that he and a committee dry leaves and underbrush toward broom and was beating the hungry<br />\nscholarship.<br />\nprograms, featuring the bright, pleaswere collected, arranged, and placed of three residents are actively en- Levering Hall.<br />\nflames for all he was worth. But to<br />\nant Eighth Symphony of Beethoven<br />\non d(ispilay as an organized unit gaged in formulating a plan. The<br />\nThe hero of the fire—for every fire no avail. They crept nearer.<br />\nFreshman<br />\nPundit<br />\nwill be held in Levering parlor toPoses<br />\ngroup<br />\nis<br />\nworking<br />\nconjunction<br />\nin<br />\nwith<br />\ninterest<br />\nand<br />\nof<br />\nthrough the effort<br />\nhas its hero--was Maury Sheldon. He<br />\nA huge crowd of ten or fifteen<br />\nmorrow at 4 P.M. The concert is unmembers of the library staff and Dr. Donald M. Andrews,dorm proctor, it was who first discovered the flames.<br />\nPostal<br />\nPeeking<br />\nProblem<br />\nwide-eyed studes had gathered by the<br />\nder<br />\nthe sponsorship of the American<br />\nwho<br />\ngreatly<br />\nwas<br />\ninstrumental<br />\nsetin<br />\nGraduate students.<br />\nYour correspondent and Ben Root time seven huskies from the hook<br />\nA freshman, full of the induction Student Union.<br />\ntling the recent dorms strife satiswere racking their respective brains and ladder company 7 roared up in and deduction<br />\nHistorical interest runs high in<br />\nabsorbed from an EngThe Eighth Symphony shows Beefactorily. As yet, no information as<br />\nIn the NEWS-LETTER office for an idea front of Levering.<br />\nthese old firearms and swords. Gathlish writing class conducted for him thoven in a rare good humor. While<br />\nto their actual plan is being released<br />\nto make a front page feature artiered as they have been from sources<br />\n\"Where's the fire?\" one of them by Mr. Teeter of that department, pre- short, it shows a<br />\nby the group.<br />\nspirit of lively<br />\ncle, when suddenly, through the howl asked indifferently as he made his sents the<br />\nthe world over, they show the profollowing choice bit of cheerfulness. The Brandenburg ConBernard Pinck, chairman of the of the March wind came the faint<br />\ngressive development and efficiency<br />\nway through the blinding smoke.<br />\nreasoning.<br />\ncertos of Bach, six in all, will also be<br />\ndormitory activities committee an- cry of \"Fire.\" Then the voice became<br />\nof particular weapons and the story<br />\nDoubts About Incendiaries<br />\n\"I find that if I desire to send a presented. Brahms' Double Concerto<br />\nnounces that the self-governing board stronger, breathless . . .<br />\nof warfare through the ages. Spears<br />\n\"Who started it?\" inquired an- letter to my parents or to a girl completes the three<br />\nBs'. This Double<br />\nand the social committee will probcraftsmanship,<br />\nprimitive<br />\nyet<br />\nof<br />\n\"Get a broom! .. . Fire .. . Broom other. Maury laid it to some little friend, and if I desire that no eyes Concerto is<br />\nrarely heard, and the<br />\nably be incorporated into one group.<br />\nwrought to an almost unbelievable<br />\n. . . Water. . . Fire in woods!\"<br />\nkids who had run away when he but those of my parents or girl friend concert offers an<br />\nopportunity not<br />\nKatske promises that either a<br />\nsymmetry, are displayed with poisPaul Revere 111<br />\nsighted them. Little did he suspect read my message, the post-office in often afforded to music<br />\nlovers.<br />\npermanent<br />\nwill<br />\nplan<br />\nbe<br />\nput<br />\ninto<br />\neffect<br />\noned arrows and darts, such as are<br />\nWe recognized Maury running past that those \"little kids\" were prob- Gilman Hall extorts from me a fee<br />\nAdmission is 15 cents. Tickpts<br />\nshot from blow-guns. Then, by way before the spring vacation, or a tem- at a terrific rate He brought to mind ably none other than some of those of three cents. However, if I care not may be purchased<br />\nthrough A.S.U.<br />\nof contrast, flint and stone arrow- porary plan to be utilized for the the picture of Paul Revere announc- \"pixies\" that Uncle Humphrey has if the postal authorities read my mes- representatives<br />\nor Box 976.<br />\nheads from mounds of man before remainder of this year will be form- ing that the British were coming. We been telling us were having a sit- sage, I may send a postcard, for<br />\nrecorded history are placed by a ulated before that date.<br />\nlooked out.<br />\ndown strike in Wyman Park.<br />\nwhich the same post-office charges<br />\nAccepts Thayer Lectures<br />\ncrossed brace of old duelling pistols.<br />\nAlready the flames were high among<br />\nIn eleven minutes the fire was out but one cent. The only difference beA sword of Damascus steel, and a Fowler Speaks To Chemists the trees, and spreading in a wide —gone completely. It was disappoint- tween a postcard and a letter is that<br />\nSir Henry Dale, Member of the<br />\nmodern slim steel dagger, to mention<br />\ncircle in all directions. To the South ing, to say he least, to see how easily the postcard can be read by the mem- National<br />\nInstitute for Medical ReDr. Robert D. Fowler, instructor were woods; to the west were woods; and quickly the fire was put under of the post-office department and the search<br />\nonly two of the many-edged weapons,<br />\nin London, has accepted the<br />\nare displayed to portray their period in Chemistry, will address the Chem- to the north was Gilman Hall; to the control. Our visions of a roaring in- letter may not. It seems therefore<br />\nappointment to the Thayer Lectureistry Journal Club on the subject east was Levering Hall. That settled ferno enveloping Levering and Gilman that the postal authorities are will- ship<br />\nin history.<br />\nof the Johns Hopkins Medical<br />\nThe exhibit is centrally located in \"Positive Ion Sources\" today at 4:00 It! Levering must be saved! Remem- Halls crumbled under the feet of the ing to pay me two cents for the priviSchool. The lectures will start next<br />\np.m. in Room 221, Remsen Hall.<br />\nGilman Hall.<br />\nber the San -Franscisco fire!<br />\nfiremen.<br />\nlege of reading my mail.\"<br />\nyear.<br />\nArthur Garfield Hays, nationally<br /><br />\n—Courtesy News-Post<br /><br />\nARTHUR GARFIELD HAYS<br /><br />\nShaffer To Address<br />\nDorms On Athletics<br /><br />\nChairman of the Military Ball Com-<br /><br />\nRhodes Scholarship<br />\nBlanks Now Here<br /><br />\nStudes Save Levering Hall<br />\nFrom Veritable 'Forest lire'<br /><br />\nOld Weapons Shown<br />\nIn Gilman Library<br /><br />\nDorm Government<br />\nGroup Sets Plans<br /><br />\nA.S.U. Will Present<br />\nRecord Concert<br /><br />\nHOME'WOOD, BALTIMORE, MARCH 9, 1937<br /><br />\n2<br /><br />\nclbt jobns jOophirts<br /><br />\nOur Athletic Policy<br />\nBroadcast throughout the country in every major<br />\nnewspaper the news of the Hopkins' latest athletic move<br /><br />\n'Letter<br />\nSubsci iption per year<br />\nBy Mail<br /><br />\n$2.50<br /><br />\nONTEMPORARY<br />\nONIMENT<br /><br />\nwas greeted with favorable and sympathetic comment.<br />\nThe decision to eliminate gate receipts was hailed as a Wily I Am For The ROTC<br />\n.1 am for the ROTC. There is nothfinal move to place Hopkins at the top of amateur athletics with a genuine, sincere University program run ing that the college needs so much-not equipment, books, buildings, gradfor all the students.<br /><br />\nOn The<br />\nLiterary<br />\nHorizon<br />\nJAMES T. FARRELL and<br />\nJOHN S. SUMNER<br /><br />\nOLLEGIATE<br />\nOMMENT<br />\nSpringfield, Mass. - ( ACP) — Assailing educational views of the University of Chicago's Pres. Hutchins as<br />\n\"counsels of despair,\" Dr. Earnest M.<br />\nBest, new president of Springfield<br />\nCollege, in his inaugural address suggested a frank facing of problems as<br />\nthey exist.<br />\n\"President Hutchins of the University of Chicago would purify and simplify education by a retreat into the<br />\nnarrow intellectualism of scientific research and philosophical speculation<br />\nand leave the world to its fate in<br />\n'trades associations',\" said the former<br />\nMcGill University psychology professor.<br />\n\"These proposals are the counsels<br />\nof despair. We have much to learn<br />\nfrom the past but in my opinion we<br />\nmust advance by a frank recognition<br />\nof the centrality of vocational and<br />\nprofessional education in modern life.<br />\n\"The defects of vocational education can be remedied by making sure<br />\nthat the schools build good men and<br />\ngood citizens as well as good specialists,\" concluded Dr. Best.<br /><br />\nJudge Henry H. Curran last month<br />\nOf local colleges, the University of Maryland's spokes,dismissed a case against a book<br />\nROTC.<br />\nan<br />\nRemit subscription fees to Treasurer, Student Activities Council, man—President Byrd expressed his skepticism and his<br />\nwhich had aroused an unexpected<br />\nI am for the ROTC because it makes<br />\nRemsen Hall, Postolfice, Johns Hopkins University.<br />\nopinions appeared to display his judgment of the Hopweight of issue in circles of literary<br />\nthe boys look so nice. There's noth- criticism. So long as Mr. Sumner,<br />\nkins through standards of the U. of M. However, PresPostotlice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\ning<br />\nmatter<br />\nlike a uniform to give that snappy the New York vice-crusader, who, it<br />\nclass<br />\nsecond<br />\nEntered as<br />\nident Woodcock of St. John's as reported in the college<br />\n3, 1879.<br />\nin Blaltimure, Md., under the Act of Congress, November<br />\nlook. ROTC makes the boys stand up is said, has read some three-hundred<br />\nnewspaper, Collegian, stated:<br />\nstraight and say, \"Yes, Sir.\" And banned novels in the past years, and<br />\nexamduring<br />\nexcept<br />\nJune,<br />\nto<br />\nOctober<br />\nfrom<br />\nyet still can trust the purity of his<br />\nPublished senn-weekly<br />\n\"I am in favor of the plan as it tends toward<br />\nisn't that swell?<br />\nination and college holiday periods by undergraduates of the Johns<br />\nhad confined his activities<br />\nopinions,<br />\nkeeping inter-collegiate athletics on an amateur<br />\nI am for the ROTC because it<br />\nHopkins University.<br />\nto books which perhaps merited his<br />\nbasis.\" He said that he would be in favor of such<br />\nLeaches the boys what war is like. attentions, and the burlesque houses<br />\na policy for St. John's as gate receipts were<br />\nEDITORIAL STAFF<br />\nIn the ROTC they learn to march in of New York, he had been deplored<br />\nEditor-In-Chtef<br />\nStanley Finkel<br />\nHe<br />\ncollege,<br />\nanyhow.<br />\nthe<br />\nwith<br />\nnegligible<br />\nalmost<br />\nManaging Editors<br />\ncolumns, to do right face, and the and tolerated. But when he chose to<br />\nJames Morrow, David Caplan<br />\n. Sports Editor<br />\ntake issue with the recent success \"A<br />\nBernard 1). Pinck<br />\nwent on to remark that he would want the Board<br />\nmanual of arms. They have dress<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barroll, Jr.<br />\nWorld I Never Made,\" by James T.<br />\na<br />\nsuch<br />\nto<br />\nin<br />\nconcur<br />\nGovernors<br />\nand<br />\nof<br />\nVisitors<br />\nAssistant Sports Editor<br />\nparades and shoot cannons at the<br />\nHarold Zheutlin<br />\nPress, New<br />\nFarrell, (Vanguard<br />\nColumnist<br />\nPaul Berge<br />\npolicy if one were to be adopted.<br />\nfootball games, and thus learn about York.), a storm of protest went up,<br />\nReporters--Max Iskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nably furthered in particular by Mr.<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nHere we see that this head of another institution of war.<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nBernard DeVoto in the \"Saturday<br />\nit<br />\nbecause<br />\nROTC<br />\nthe<br />\nfavor<br />\nalso<br />\nI<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Bur- learning really appreciates the plan; we may see the<br />\nReview.\"<br />\nford, J. C. Handelsman, Mal lioshnack, Arnold Glantz, Joe start of a nw attitude of colleges towards the athletic teaches men to hate war. If we get<br />\nIt is not our purpose to discuss the<br />\nSaMOVItt•<br />\na cavalry unit the boys may be able underlying issue, particularly in light<br />\nproblem.<br />\nBUSINESS STAFF<br />\nto learn how tO play polo, and we of the disagreement of eminent men<br />\nThe paper itself in an article entitled \"Lunatic Fringe\"<br />\nBusiness Manager<br />\nWilliam B. Kempton<br />\nwill have matches with P. M. C. and and women from Church, literary,<br />\nAssistant Business Manager comments:<br />\nNew Haven, Conn. - (ACP)—IndifMelville Locker.<br />\nthe<br />\nManager<br />\nAdvertising<br />\nwith Princeton, and out of this ex- and sociological circles, as to<br />\nWm. C. Erlanger<br />\nference causes Yale University underCirculation Manager<br />\nneed for, and desirability of censor- graduates to shun religious<br />\nGerald Willen<br />\n\"The recent announcement by The Johns<br />\ndiscussion<br />\nperience will develop not only a hate<br />\nOffice Manager<br />\nitoward Linkoff<br />\nship in any and all forms. But in the groups such a the<br />\nUniverity Christian<br />\nHopkins University that beginning next October<br />\nCopy and Filing Manager<br />\nNathaniel Soifer<br />\nof war but of everything military.<br />\na<br />\nassumes<br />\ncase of James Farrell, it<br />\nAssociation, known to tudents as<br />\nit eliminate all admission charges at its sports<br />\nThe ROTC will also be a fine thing dangerous aspect. He is a Chicagoan,<br />\nDwight Hall.<br />\nan<br />\nis<br />\nevent<br />\ncontests<br />\nthe<br />\nof<br />\nimportance<br />\nwhich<br />\nit<br />\nabout<br />\nfor the campus socially. Periodically writing a virile, realistic prose<br />\nREPRESENTED FOR NATIONAL ADVERTISING •Y<br />\nSo said Pres. James Rowland Anwould be hard to overestimate. By it, Johns<br />\nthe unit will elect its military col- the place where he was born and gell at the services in honor of the<br />\n• NationaI Advertising Service, Inc.<br />\nbrought up, and from which he es- 50th<br />\nt.olleee Publishers Representative<br />\nHopkins becomes the first major institution of<br />\nanniversary of organized underonels from among our girls. They<br />\nNEW YORK. N.Y.<br />\nMAD:SON AVE.<br />\ncaped. His earlier trilogy, \"Studs graduate religious<br />\nSAN FRANCISCO<br />\n.<br />\n)•TON<br />\nCoi,..•<br />\nactivities on the<br />\nlearning in the United States to break away<br />\nwhich<br />\nat<br />\nballs<br />\nmilitary<br />\ntheir<br />\nhold<br />\nwill<br />\n.T1 ANC<br />\nSr<br />\n•<br />\nL .0, ;.75<br />\nLonigan,\" is a story woven of the<br />\ncampus.<br />\ncompletely and unequivocally from the profesthey will wear their resplendent uni- lives of the very boys and girls he<br />\nOnly a small group was violently<br />\nsional athletic system.\"<br />\nMember<br />\nr936<br />\n1937<br />\nforms. This will be a good thing be- lived among, and spares the reader opposed to religion. Some students<br />\ntheir<br />\ntawdriness,<br />\ncause it will make the girls hate war nothing of their<br />\nstay away from Dwight Hall, he addContinuing, the Collegian says:<br />\nAssocided Colleesiate Press<br />\nsqualor and poverty, or the sordided, because they feel that their retoo; for women in their deep love of<br />\nDist ributors<br />\nness of their uninspired, defeated<br />\n\"People who are interested in the problem of<br />\ntruth will see through the superfi- lives. \"A World I Never Made,\" takes ligious beliefs are already decided.<br />\nintercollegiate athletics in the United States<br />\nTh greater number are \"wholly indifciality of the dances, and honors, a different group, the Irish in the<br />\nhave been almost unanimous in naming this step<br />\nferent to religion and preoccupied like<br />\nand nice clothes, and realize the hor- South Side slums, and draws an un- their parents with<br />\nother matters.\"<br />\nMember Of The<br />\nas \"ideal.\" Campus sports should be maintained<br />\nrelieved picture of the family as the<br />\nASSOCIATION<br />\nNEWSPAPER<br />\nINTERCOLLEGIATE<br />\nrible truth beneath it all.<br />\nExplaining the necessity -for an<br />\nfor only two reasons: because the students enOf Middle Atlantic States<br />\nchildsix<br />\nwith<br />\nLizzie,<br />\nand<br />\nunit; Jim<br />\norganization like Dwight Hall, Dr.<br />\nAdapted from the New Mexico Lobo<br />\npoy theim and because they are benefleial.<br />\nren and another coming; old Mrs.<br />\nAngell said:<br />\nMarshall's Student<br />\nand<br />\nFranklin<br />\ninspiraand<br />\nFlaherty, with her vigor<br />\nTUESDAY, MARCH 9, 1937<br />\nTo 'operate' teams for the single purpose of col\"On the strictly intellectual and<br />\nWeekly<br />\ntion; Margaret's cheap effort to e.8lecting gate receipts destroys the entire purpose<br />\nplulosophical side of religious expericape with her lover, who becomes<br />\nence there is and always will be a real<br />\nof athletics.\"<br />\ninvolved with the law; and little<br />\njob for such an association. It affords<br />\nDanny, who tells much of the story<br />\nWe agree with this stand and are proud that we are<br />\nopportunity for direct, frank, man-toTo those of us who have attended assemblies which<br />\nthrough his forcible awakening to<br />\nan<br />\nof<br />\npart<br />\nthe<br />\nhas<br />\nstrength<br />\nand<br />\nwhich<br />\ninstitution<br />\ncourage<br />\nman discussion of the fundamental isArthur Garfield Hays has addressed, look backward at<br />\nnumerous aspects of the life about<br />\nsues in Christianity, as well as in<br />\nlectures full of color, fire, wit--and information. We also to carry out the noble ideals of real amateur ahletics.<br />\nDon't try to argue with the fellow him.<br />\nother world religions.<br />\nAnd these people are devout, relook forward to Thursday assembly and another Hays<br />\nwho tells you you that this picture is<br />\n\"No thoughtful man can ever be<br />\nhopeless.<br />\npentant, and altogether<br />\naddress.<br />\nquite sure of the foundations of his<br />\nthe outstanding film of 1936; he's<br />\nThey hate the dirt and darkness of<br />\nfaith-or, indeed, of his lack of faith,<br />\nright.<br />\nThe assembly is still being conducted under a voluntheir lives, and occasionally dream of<br />\nif that represent his condition--withThe second of the fireside discussion group series will<br />\nThe picture, in French with Eng- getting out. But the unit family is<br />\ntary plan. But certainly here is an outstanding speaker<br />\ntake place this Thursday with Dean Berry leading the lish subtitles, takes place in Flanders there in multitudes, and there they out exposure to the shrewd, even if<br />\nwho should draw an overflowing crowd to hear hi; words.<br />\nsometimes naive, criticism of his comdevelopment of the selected topic. It shoold be an ex- at the time of the Domination of Spain are bound, by ignorance, superstition,<br />\nrades and to the merciless give and<br />\nfrelisten<br />\nto<br />\neducation<br />\nIt should be part of every man's<br />\ncellent oprx)rtnity for anyone who wishes to hear varied towards the end of the sixteenth cen- and need for education. Mr. Farrell take of men of his age.\"<br />\npart<br />\nmost<br />\nthe<br />\nfor<br />\nspeak--who<br />\nthe picture<br />\nquently to speakers who do more than just<br />\nopinions on this important question. Much value can be tury. The scene is the Flemish vil- draws<br />\nwith a sure hand. If it ever fails, it<br />\ninspire and stimulate thought. Such a speaker is Mr. derived from the participation in such a discussion; it<br />\nNew York, N. Y. -(ACP)---If collage of Boom, thrown suddenly into is from over-exuberance. There is<br />\nHays. He is one of the few so-called intellectuals who has is a useful laboratory for intelligent thinking and conleges and universities continue to<br />\nturmoil at the news that the dreaded no faltering touch, no sqeamishness.<br />\n\"recruit\" students and don't restore<br />\na practical and enlghtened grasp of those flaunted con- sideration.<br />\nSpanish masters will spend a night His book is hearty and alive; his peo- their high standards for selective adcepts of \"liberty,\" \"freedom of speech,\" etc. He has<br />\nindividuals. There<br />\nstrangely,<br />\nare,<br />\nple<br />\nFor sponsoring and continuing this activity, the Fire- there during one of the routine visits<br />\nmission, they will impair seriously the<br />\nis fire and vigor in abundance, some<br />\ntraveled all over the United States and has participated<br />\nis to be congratulated. We hope of inspection. Dread scenes of pil- ineptness, some extraneous wordage value of academic degrees.<br />\nCommittee<br />\nSessions<br />\nside<br />\nin famous trials involving the abuse of civil liberties. He<br />\nAt leas that is the opinion of Frank<br />\nthat this second trial will be again successful and that lage, rapine, and destruction are en- - -but never can it be said that there<br />\nwas in Germany as one of the lawyers in the Reichstag<br />\nH. Bowles, acting director of admisdissior<br />\nthe<br />\nartificiality<br />\nof<br />\nwife<br />\nthe<br />\nof<br />\nis anything<br />\nfuture sessions be planned with as good a speaker and visaged. At this point,<br />\nsions at Columbia University.<br />\ntire trial.<br />\nMayor takes command of the city, rel- mulation.<br />\nsubject.<br />\nReductions in enrollment and deAnd such a book naturally requires<br />\nHe is a man worth hearing. To those who have never<br />\negating the men to the background,<br />\ndeep creases in income from endowment<br />\nand<br />\nshades,<br />\ncolors--vivid<br />\nstrong<br />\nheard him, we are certain, you will think as we do after<br />\nfunds and other outside sources,<br />\nand issuing orders to the women. Thus<br />\nshadows. It cannot exist on any other<br />\nyou have listened to him.<br />\nis it that when the Spaniards finally basis. It is strong fiction--not for the caused by the depression, drove colLet us fill up Latrobe!<br />\narrive they are agreeably surprised weak-stomached--not for those who leges to seek increased enrollment at<br />\nThe enthusiastic and huge response to the lectures on<br />\neducational standards,.<br />\ntheir eyes and not the expense of<br />\nhuman reproduction should indicate that there is a to find a committee of welcoming would rather shut<br />\nclaimed.<br />\nMr.<br />\nBowles<br />\nis one of the<br />\ndefinite desire for such a course on this campus. That women, a village rejoicing and cele- see at all. The language<br />\nparts of the book,<br />\nmasterful<br />\nmost<br />\nRS<br />\nin<br />\ncollege<br />\nthis<br />\ninstruction<br />\nthis<br />\nfor<br />\nthere is a real need<br />\nbrating, and free drinks, lodging, and<br />\nerrors. One has only to Never Made,\" would have been to<br />\nwell as in all other ( who do not have such courses) is entertainment. (The French title, in spite of<br />\nLast issue we printed our first column about Hopkins<br />\nwith the best yet done outlaw most of the greatest classics<br />\nit<br />\ncompare<br />\nof<br />\napparent from any intelligent and enlightened study<br />\n\"La Kermesse Heroique\"---\"The He- in this difficult department, and even of the realistic school of literature,<br />\nfraternities. Judging from our observance, the feature<br />\nthe problem.<br />\nroic Festival\"- - come from this cele- Hemingway, the master of conversa- and, indeed, to have made of life itself<br />\nwas greeted warmly. It appears that there is a definite<br />\natmos- bration.) In the course of the evening, tion among modern authors, seems to an unfit subject for literary effort.<br />\nbetter<br />\nwhat<br />\nbetter<br />\nconditions,<br />\nwhat<br />\nall<br />\nAfter<br />\nplace in our columns for such news.<br />\nphere, lectures, and approach than what college--and the women receive their foreign guests pale a little.<br />\nPassages evetryone To have upheld the persecution would<br />\nwith open arms, figurative and liter- could find in their own experience have made ridiculous a dignified<br />\nWe should like the cooperation of the Greek letter particularly this one----offers can be found?<br />\nally, and the Mayor plays possum, if they dared look, are frankly set court, and to have placed an annoygroups in submitting material promptly and regularly<br />\nAnother important consideration is the fact that a but fools nobody. The Mayor's wife, endown without any cloying appeal to ing millstone about the neck of<br />\non<br />\nweekly<br />\nappear<br />\nwill<br />\ncolumn<br />\nThe<br />\nti the NEWS-LETTER.<br />\nHopkins organization —extra-curricular and composed tertaining the Spanish Duke, manages<br />\nthe sensational, for there is nothing writers. The decision was wise and<br />\nTuesdays, so that the fraternities should appoint NEWS- of Hopkins students—initiated and sponsored the series. to force the marriage of her daughter<br />\nof that in the writin gor the story. realistic, and contained a pretty obLETTER representatives to write their contributions by But the American Student Union meant it for--and it to a young painter, Jean Brueghel But they are far more elemental and vious suggestion that Mr. Sumner<br />\nby ---the students.<br />\n(pronounced Broigl), thereby foiling real than was considered polite a few confine himself to fields where he<br />\nthe preceding Friday. In other words, send your news was received wholeheartedly<br />\nmay enjoy himself without bothering<br />\ntoday in order to have a representative array in TuesNow that the ever-increasing popularty of the lectures her husband and an unwanted suitor. yars ago.<br />\nanyone.<br />\nnight<br />\nthe<br />\ndancing<br />\nand<br />\nrelieving<br />\nnote,<br />\nfeasting<br />\nAmid<br />\nis<br />\nthere<br />\na<br />\nas<br />\nAnd<br />\nthink<br />\nto<br />\nabout the fuure. Will<br />\nis evident; it is high time<br />\nday's issue.<br />\nAnd so the book is legally washed<br />\nthis educational and interesting series be continued? passes, and the next morning the here infinite compassion, understandplaced upon its pedestal of purand<br />\ntimid<br />\nand<br />\npeaceful<br />\nthe<br />\nleave<br />\nfiery<br />\nSpaniards<br />\nsatire<br />\ndeep,<br />\nanger.<br />\na<br />\nThe<br />\nand<br />\ning,<br />\nability to repeat<br />\nWe cannot be too sure of the<br />\nwas prevented by the<br />\nthis year's success. It has done its duty; it has shown village of Boom, really celebrating fails as a whole because it grows too ity. A travesty<br />\nexemp- warm and real. The tragedy of life wisdom of a judge. But the fact<br />\ntax<br />\nand<br />\ndeliverance<br />\nsafe<br />\nits<br />\nthe way.<br />\ntion.<br />\nfor such as these, and we suspect, remains that other judges have been<br />\nWith the absence of an official magazine on the camWe students, if we are interested in maintaining this<br />\nfor all, occupies the author's thoughts less wise, and books have been banfrom<br />\nThe value of the picture, aside<br />\npus, the Blue Jay being banned since 1934, the NEWS- course, should get behind a move to impress the adminisits lesson on how to avoid paying in- far more than any passing effort to ned for years, publishers sued, and<br />\nLETTER remains the sole periodical and outlet for literary tration with the necessity of incorporating this lecture<br />\nbook-sellers arrested in the sacred<br />\ncome taxes, lies in the remarkable satirize or grow clever.<br />\nseries in the permanent curriculum.<br />\ntalent.<br />\nWhere then, did Mr. Sumner ob- name of morality. It might be sigCostumes,<br />\nstaging and direction.<br />\nscenry, civilian types,‘details of the ject? He found an impressive list of nificant that these same books have<br />\nIn the past two years we have tried to satisfy such<br />\ncelebration, are all done with minute faults. He translated many a pas- frequently lived long enough to prove<br />\ntalent with the printing of literary editions. However,<br />\nfidelity to historical accuracy, and sage into pornography by some their value--long after it could be<br />\nthus far, we have not yet observed any real need nor rewith fine artistry. Technical advisor stretch of a very elastic imagination. scarcely traced to their suspected<br />\nTo Bates College, whose paper thinks it is the first VMS Peter Brueghel, who left a volum: He took issue with words used by Indecency and the appeal of the forquest for such an endeavor. As a matter of fact, the<br />\ncollege paper to conduct a poll on the Suprem Court, nous record of Flemish life of the people to whom they would be sec- bidden fruit. The incident is closed—<br />\nwidespread success of the past attempts has remained<br />\nlet us say that the Hopkins has proven to be a pioneer period in his celebrated paintings, ond nature. He succeeds, in short, in Mr. Sumner will continue, and after<br />\nquestionable in many minds.<br />\nin this direction, too.<br />\ndrawings and engravings. Every reading into a great work of truth him, so long as the law courts uphold<br />\ninare<br />\nwho<br />\nstudents<br />\nmisleading, seductive them, more in his footsteps. But<br />\nmany<br />\nare<br />\nthere<br />\nthat<br />\nfeel<br />\nBut we<br />\nBecause this college is located in Maine, it will be in- member of the supportinug cast was all the gilded,<br />\nclined to literary writing and perhaps gifted with ability. tresting to follow the poll and actual results to see if the endowed with individuality, and so qualities which he persecutes with great books will be written—and<br />\nTo these we procer an invitation to submit material to us. much misused \"As Maine Goes\" myth carries over to helped to make the picture a work of such vigor. True, the passages he read, either then, or in a future<br />\nWe shall be happy to print poems, short stores, articles, college students.<br />\nart, replete with drama, gaiety, refers to are frank, but brutally so, however remote. For the present,<br />\nlaughter, and that indefiniable some- not with the intention of being dirty. their fate hangs on the wisdom and<br />\nand other contributions in our columns. We reiterate that<br />\nWe will watch this straw vote and announce in a later thing that makes a picture a lifelong<br />\nAnd Magistrate Curran disagreed appreciation of the courts throughout<br />\nwe are the only campus outlet for such material; we<br />\nNEWS-LETTER just how the vote came out.<br />\nwith him. To outlaw \"A World I the nation.<br />\nsuccess.<br />\nurge talented students to submit their products.<br />\nuate courses, or professors—we need<br /><br />\nCoie6iale Di6est<br /><br />\nA Stimulating Speaker<br /><br />\n\"CARNIVAL 1N<br />\nI FLANDERS\"<br /><br />\nAnd Another Session<br /><br />\nLet's Make It Permanent<br /><br />\nFrats Should Cooperate<br /><br />\nCall For Literary/ Talent<br /><br />\nAs Maine Students Go<br /><br />\nF. '<br />\nEss<br />\nHo<br />\nGem<br /><br />\n'BIO<br />\nLa<br /><br />\nAn<br />\nIlforocc<br />\nT, Wil<br />\nat the<br />\nthree r<br />\nlished I<br />\nDr.<br />\ntion of<br />\nPolitic(<br />\nonce, d<br />\nlems i<br />\ntween I<br />\nin the<br />\nGermai<br />\nModem<br />\ng-ress;<br />\nward\"<br />\nPer<br /><br />\nThe<br />\nGermai<br />\nimperie<br />\nof pre<br />\ntook mu<br />\nthe ta<br />\nambitic<br />\nvalue o<br />\nlinking<br />\nconditic<br />\nthe Get<br />\nperspec<br />\neible in1<br /><br />\nThe<br />\navoidin,<br />\ndramat<br />\nattempt<br />\nproduci<br />\nOf the<br />\ndanger<br />\nWith it<br />\n(went 11<br />\nor the<br /><br />\nThe l<br />\nof/Y, a<br />\nrecords<br />\nIs now<br />\nthere ii<br />\nord on<br />\narcheal<br />\nOf phys<br />\nto sixt<br />\n/neasur<br />\nands of<br />\nage, cei<br />\nCalvin<br />\nOf the<br />\nStanfor<br />\neions hi<br />\ninterest<br />\nscent g<br />\nLa lv<br />\nla the<br />\nand cor<br />\nSources<br />\n(here a<br />\nOotated<br />\nbeing tl<br />\nnardier4<br />\nkliderati<br />\nworks<br /><br />\nnu.s<br />\nF,<br />\nNext<br /><br />\nThe<br />\n(lents v<br />\ntheir la:<br />\nthis Fr<br />\nhall, ac<br />\nby Cha<br />\nGradual<br />\nNorm<br />\n4Iipply I<br />\nWill las<br />\n1.1.00 fc<br /><br />\nSporm<br />\nqinand<br />\ntrlcal<br /><br />\nkineerir<br /><br />\nlIrofess+<br />\nl'hom as<br />\nkriginee<br /><br />\nLecture<br />\nhouisto,<br /><br />\nQ.orman<br />\nis.-te in<br />\nberg, A<br />\nparker,<br />\nr. Bu<br /><br />\nNychol<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 9, 1937<br /><br />\n3<br /><br />\nF. T.Williamson High Court Dubbed College Survey Shows Post- German Biologist 'Set Sen. Deadline I<br />\nEssay Issued By Super-Legislature Repeal Drinking Increase To Deliver Second<br />\nBy Prof. Corwin Opinions Of 1475 Deans And College Editors Indicates Zoology Talk Today<br />\nHopkins Press Lecturer<br />\nLess Drunkenness, Despite More<br />\nApplauds Roosevelt<br />\nThe Seniors are advised that about<br />\nfour weeks remain for them to complete the reading of the requisite list<br /><br />\nCourt Plan In Every<br />\nDetail<br /><br />\nGerman - Morrocan Study<br />\nBy History Instructor<br />\nPublished<br />\nTells Latrobe Audience Fri`BIOLOGY'PUT ON SALE day Times Demand New<br />\nJudicial Outlook<br />\nLa Mesnardiere's Poetique<br />\n(Continued from Page 1, Col. 4)<br />\nSubject Of Reese<br />\nlegislation. More undergraduate students than usual were in attendance.<br />\nStudy<br />\nPoint by- point, Professor Corwin<br />\nAn essay entitled Germany and discussed and defended the Roosevelt<br />\nMorocco Before 1905 by Dr. Francis proposal. He hailed as salutary the<br />\nplan to restrict issuance of injuncT. Williamson, Instructor in History<br />\ntions and declarqi well-nigh imat the Hopkins, is included among partial a constitution amendment<br />\nto<br />\nthree new paper-bound volumes pub- regulate the court. Since 1860, he said,<br />\nsave for the income tax one, every<br />\nlished ,by the Johns Hopkins Press.<br />\namendment has been adopted by bayDr. Williamson, under the direconets or agitation over a long period<br />\ntion of the departments of History,<br />\nof years. He pointed to the slow adopPolitical Economy, and Political Scition, of the child labor amendment.<br />\nence, deals in his essay with the probDiscussing the personel of the Sulems in the interrelationships bepreme Court, Dr. Corwin placed himtween two contrasting types of states<br />\nself in favor of younger judges and<br />\nin the pre-war age of imperialism.<br />\nof son-re from the \"academic bar.\"<br />\nGermany is the personification of<br />\nthey being naturally of \"broader ecomodern symbols of expansive pronomic and social philosophy.\" Dr.<br />\ngress; Morocco is the typical \"backCorwin himself has been menward\" state.<br />\ntioned as a possible justice, as has Dr.<br />\nPermits Intelligent Judgment<br />\nJohn Dickinson, a Hopkins graduate<br />\nThe work points out how modern and former assistant attorney general,<br />\nGermans, creating and encouraging to whom he referred with praise<br />\nfor<br />\nImperialist energies as the best means his brief and argument in<br />\nthe<br />\nof preserving their national power, Guffey Coal ease. The<br />\nPrinceton<br />\ntook notice of Morocco, and made it scholar declared that the<br />\nopinions<br />\nthe target for their expansionistic issued in the Income Tax and<br />\nDred<br />\nambitions. By showing the subjective Scott cases show sufficient evidence<br />\nValue of Morocco to Germany, and by that judges should retire at seventy.<br />\nlinking the subjective feeling to actual \"Exceptions, of course, in a case<br />\nlike<br />\nconditions, the essay tries to place Justice Holmes.\"<br />\nthe German-Morocco question in such<br />\nAfter his address Dr. Corwin was<br />\nperspective as will admit of a pos- entertained<br />\nby a dinner given by the<br />\nsible intelligent judgment.<br />\nSocial Science Department at the<br />\nThe author avoids repetition by Hamilton Street Club. A guest<br />\nreavoiding mention and criticism of the ports discussion waxed warm<br />\nas<br />\ndramatic climax in 1905. There is no liberal and conservative members of<br />\nattempt to link the German action, the Hopkins faculty locked<br />\nverbal<br />\nproducing the crisis, with the origins horns across the board. Dr.<br />\nCorwin<br />\nOf the World War, and, thereby, the was the first James<br />\nSchouler lecdanger of passing moral judgment turer of the season. The<br />\nsecohd<br />\nWith its accompanying and subse- speaker will be announced soon.<br />\nquent hiatus of prejudice to one side<br />\nor the other is nullified.<br />\nThe February Issue of Human Biology, a quarterly magazine devoted to<br />\nrecords of research in biological fields,<br />\nis now on sale. In the current issue<br />\nthere is an illustrated, complete record on the relationship between menarcheal age and certain measurements<br />\nOf physique in girls of the ages nine<br />\nto sixteen years. Based on actual<br />\nMeasurements taken on many thousands of girls of junior and high school<br />\nage, certain conclusions are drawn by<br />\nCalvin P. Stone and Roger G. Barker<br />\nOf the Psychological Laboratory of<br />\nStanford University. These conclusions have to do with the attitudes and<br />\ninterests of pubescent and non-pubescent girls.<br />\nLa Mesnarcliere's Poetique (1639)<br />\nis the topic of an exhaustive study<br />\nand comment by Helen Reese Reese.<br />\nSources of the work by La Mesnardiere and his dramatic theories are<br />\nnotated. The work is noteworthy as<br />\nbeing the first of its kind on La Mesnardiere, who has received little consideration and less notice in previous<br />\nWorks of literary criticism.<br /><br />\nilussard Booked<br />\nFor Grad Dance<br />\n-- Next To Last<br /><br />\nDance Of Season<br />\nTo Be Held<br />\nFriday<br />\n•<br />\nThe Faculty and Graduate Students will hold their March dance,<br />\ntheir, last dance but one of the season,<br />\nthis Friday, March 12, in Levering<br />\n1-taii, according to an announcement<br />\nby Charles Larrick, chairman of the<br />\nOraduate Student Social Committee.<br />\nNorman Bussard's orchestra Will<br />\nstipply the music for the affair, which<br />\nWill last from 9 till 1. Admission is<br />\n;1,00 for couple or stag.<br />\nSponsors for the dance are Dr. Ferdinand Hamburger, Instructor in Eletrical Engineering; Mr. Myrick<br />\nAssociate in Electrical Entineering; Thomas Comber, Associate<br />\nt'rofessor<br />\nCivil Engineering;<br />\nof<br />\nNomas Hubbard, Associate in Civil<br />\nrigineering; Dr. Henry McComas,<br />\nLecturer in Psychology; Dr. Robert B.<br />\nkoulston, Collegiate Professor of<br />\n4rman; Dr. Harold Cherniss, Asso'late in Greek; Dr. Benjamin Rosenberg, Assistant in German; William<br />\nparker, Visiting Lecturer in English;<br />\n6r. Buford Johnson, Professor of<br />\nt'sychology.<br /><br />\nHeavy-Liquor Consumption<br /><br />\nThere is more drinking of alcoholic<br />\n\"2. Students abhor the drunk, adbeverages, and students are drinking mire the man who can drink like a<br />\nmore hard liquor than light liquor in gentleman.\"<br />\nmost American colleges and univer\"3. A vast majority of college presisities now, than before repeal, acdents see drinking as a problem in<br />\ncording to a survey just completed by<br />\nother institutions, but not in their<br />\nthe Literary Digest.<br />\nown.\"<br />\nQuestionnaires were sent to the<br />\n\"4. The average undergraduate<br />\nleads of 1,475 colleges and also to 1,475<br />\ndoes most of his tippling off the camstudent editors and leaders, the magapus.\"<br />\nzine states, asking an appraisal of<br />\n\"5. Harvard and Yale allow drinktheir campus drinking situation since<br />\ning<br />\nin rooms and fraternity houses.<br />\nRepeal. Replies are reported from 645<br />\npresidents, deans and student leaders who represented 581 American<br />\ncolleges \"of every type of sectarian<br />\nand non-sectarian school in the country.\"<br />\nMore Drinking Since Repeal<br />\nMere drinking since Repeal is reported by 303 of those responding and<br />\n60 others state there is less drinking<br />\nin their colleges. Reports from 205<br />\nstate that students are drinking more<br />\nhard liquor and from 100 that they<br />\nare drinking more light liquors.<br />\nThe Digest announces the results<br />\nof its nine-part survey and concludes<br />\nthat<br /><br />\nVictor Jolles, Protozoa Geneicist, Now At Wisconsin<br />\nUniversity<br /><br />\n• THE NEW<br /><br />\nDENTISTRY<br /><br />\n\"1. Drinking is more on the increase<br />\nAs far as the News-Letter could<br />\neverywhere, but there is relatively determine, Johns Hopkins was not inless drunkeness.\"<br />\ncluded in the Literary Digest survey.<br /><br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nJUNE WEEK FEE<br />\nDEADLINE<br /><br />\nMARCH 31ST<br /><br />\nDENTAL SCHOOL<br /><br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER. D.M.D.. M.D., Dean<br />\nuept. 9, 188 Longwood Ave., Boston, Mass.<br /><br />\n•<br /><br />\n•<br /><br />\nHelen Jepson tells why<br />\nshe chooses Luckies for her voice<br />\nLOVELY PRIMA DONNA OF<br />\nMETROPOLITAN OPERA SAYS:<br /><br />\n\"A season of opera and concert<br />\nmeans my voice and throat must<br />\nbe consistently in perfectcondition.<br />\nTherefore, although most of my<br />\nsmoking is done while I am on<br />\nvacation, it is all important to me<br />\nthat I be careful in choosing my<br />\ncigarette. I smoke Luckies because<br />\nI enjoy their taste and because<br />\nI feel it is wiser for me to choose<br />\na light smoke for my voice.\"<br /><br />\nPing-Pong<br />\nAnd Pool Equipment<br />\nPlanned For Game<br />\nROOM<br /><br />\nSENIORS!<br /><br />\nstill undecided, however, it is planned<br />\nfor the first or second week after the<br /><br />\nclose of the Spring Vacation.<br />\nDr. Victor Jolles, formerly of the<br />\nThe students planning to take the<br />\nKaiser Wilhelm Institute, Germany, COmprehensive are<br />\nexpected to acand now professor at the University quire as much as possible from their<br />\nof Wisconsin, is lecturing at the Hop- own reading and by their own methkins under the auspices of the Zoo- ods of study a survey of the historical<br />\ndevelopment of scientific thought, an<br />\nlogy Department. He is tendering a<br />\nunderstanding of scientific method,<br />\nseries of two lectures, one of which the different<br />\nrecognized branches of<br />\nwas delivered yesterday, and the other science and their interrelations, the<br />\nto be delivered today.<br />\nmajor conclusions on which they are<br />\nThe lecture yesterday, delivered in based, and the lines of investigation<br />\nRemsen 221 at 4 p.m. dealt with followed most actively pursued at<br />\n\"Problems of Heredity and Variation present.<br />\nWomen's colleges are most liberal<br />\nof Microorganisms.\" The lecture today<br />\nSeniors are advised to consult their<br />\nbecause so many of their students on<br />\n\"Recent Attempts to Test the advisers or Dr. R. P. Cowles, Chaircome from cosmopolitan drinking Role of Cosmic Radiations in<br />\nthe man of the Natural Science group, in<br />\nProduction of Spontaneous Muta- the event any queries arise concerning<br />\nareas.\"<br />\ntions,\" will be delivered at 4 p.m. in their reading.<br />\nMore Students Drinking<br />\nMaryland 110.<br />\nA copy of the reading list may be<br />\n\"Opinion as to whether or not the<br />\nDr. Jolles has done considerable obtained in Dean Berry's office, Remgeneral increase was deleterious,\" work in the field of protozoan<br />\ngene- sen 114.<br />\ncontinued the Digest, \"depended on tics and the induction of variation in<br />\nthe correspondent's personal opin- protozoa, and also, has worked in<br />\nDrosophilan genetics, in its special<br />\nions. Many students who had never<br />\nrelation to temperature and radiation<br />\ntouched liquor prior to college days, effects.<br />\nJust now -his work is being<br />\nit was disclosed, found social pres- widely discussed through the world<br />\nsure or the new availability of liquor in zoological centers.<br />\nA Phase of Preventive Medicitte<br />\nor the safety of government-bonded •<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nstock an inevitable incentive to drink<br />\nJ. H. FURST CO.<br />\nHARVARD<br />\nUNIVERSITY<br />\nmoderately.\"<br />\nPrinters of<br /><br />\nCommittee Ponders<br />\nLeveringi Changes<br /><br />\nThe newly organized committee for<br />\nthe improvement of Levering Hall<br />\nmet recently and formulated many<br />\nplans. Various arrangements were<br />\nconsidered with regard to making better use of the available space.<br />\nAt its meeting the group determined that something should be done<br />\nimmediately about the need for a<br />\nroom for the \"Y\" Cabinet. As a result, the room on the left of the<br />\nentrance to the dance floor is being<br />\nprepared for its use.<br />\nThe group is planning to have a<br />\ngame room, with facilities for ping<br />\npong and pool. The Sherwood parlor<br />\nis to be given over entirely to the<br />\ngirls on the campus, both graduate<br />\nstudents and students in the College<br />\nfor Teachers. A room will also be<br />\nretained as a study hall with , a little<br />\ngreater freedom for conversation than<br />\nis possible in the library. The reading<br />\ncorner may be enlarged and the<br />\namount of literature available increased. No small amount of discussion is concerned with the present<br />\narrangement of the soda fountain and<br />\ncafeteria. It is problematical whether<br />\na satisfactory solution can be reached<br />\nwithin a short period of time.<br />\n'<br />\nThe committee will welcome helpful suggestions. Any student wishing<br />\nto be of assistance should communicate with members of the comirnitte<br />\nor with Miss Diggs at the desk in<br />\nLevering Hall.<br /><br />\nof books for the Comprehensive<br />\nExamination. The date upon which<br />\nthe examination is to be given is<br /><br />\nAn independent survey was made recently<br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMiss Jepson verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies—a light smoke, free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br /><br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br /><br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937, The Ammican Tobacco Company<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 9, 1937<br /><br />\nJay Cagers Bow Jay Handballers Norman Baetjer Places First FreshmenA.B.Whip 21 Aspirani<br />\nTop Pennsylvania In A.A.U. Seventy Yard Dash Mechs To Capture Inaugurate IV<br />\nBefore Johnnies Team<br />\nBy 5-1 Score Equals Time Made By Hopkins Of Virginia In Surprise Interclass Honors<br />\nTrack SeasoII<br />\nTo Close Season Milberg And Pasternak Star<br />\nVictory; Defeats Fine Field At Track And<br />\nSoph Engineers, Goldman A.<br />\nField Meeting Saturday Night<br /><br />\nFor Jays In Singles<br />\nAnd Doubles<br /><br />\nCrabtowners Score 33 To 23<br />\nVictory To Avenge Earlier<br />\nLoss<br />\nSt. John's And Western<br />\nMaryland To Be Met<br />\nHARD FOUGHT TILT<br />\nFriday and Saturday<br />\nSiegel Brilliant In Last Ap- The Hopkins wallmen scored their<br />\npearance On Hardwood fourth intercollegiate victory by defeating the University of PennsylFloor<br />\nby 5-1.<br /><br />\nC., All-Stars Defeated<br /><br />\nCoach<br /><br />\nHambleton<br /><br />\nRecog-<br /><br />\ntion leads to high hopes for a sucnizes Need For Track<br />\nIn Playoffs<br />\ncessful track season.<br />\nAnd Field Material<br />\nBaetjer, a Sophomore in the BusiTo<br />\nWith<br />\nWinners<br />\nClash<br />\noutbeen<br />\nhas<br />\nness Economics school<br />\nGRAZIANO IS CAPTAIN<br />\nstanding in athletics at the Hopkins.<br />\nMaryland Intramural<br />\nHis place-kicking on the football<br />\nFirst Meet Against Swani hChampionship Five<br />\nfield and his fine work at end last<br />\nmore At Philadelphia<br />\nseason won for him honorable menPlaying truly championship ball<br />\ntion for all-state honors. The Jay<br />\nOn April 10<br />\nthe Freshmen AB basketball team<br />\nspeedster's performances in the 100<br />\nwon<br />\nthe<br />\ninter-class title when it deTwenty one stalwart track aspiryard and 220 yard dashes in the track<br />\nfeated the Senior Mechanics in the ants inaugurated a series of practice<br />\nvania, Saturday afternoon,<br />\nseason last year gave evidence of<br />\nfinal game.<br />\nsingles<br />\nsessions last week under the direchis track ability which came to light<br />\nThe Johns Hopkins basketball team The victors dropped only one<br />\nBefore entering the all important tion of Coach Waldo Hambleton. The<br />\nmatch to Penn at the Homewood<br />\nnight.<br />\nSaturday<br />\nvictory<br />\nfine<br />\nhis<br />\nwith<br />\nseason<br />\nfinished its 1937 hardwood<br />\ncontest the victors had taken the turnout, though not as large as excourts.<br />\nLast Saturday night's track meet,<br />\n,last Saturday night at Annapolis<br />\nmeasure of all the competition in the pected, included a number of canIn the first singles, Irving Milberg<br />\nwhich was the first indoor track<br />\nwhen it bowed to a slow-moving, fast had little difficulty in turning back<br />\nleague as well as the Soph didates owning impressive highThursday<br />\nmeet held in Baltimore for ten years,<br />\nEngineers who were met in one of school records.<br />\nbreaking, group of St. John's cagers. Anderson of Penn, 15-1, 15-11. In the<br />\nwhen<br />\ntime<br />\nof<br />\nthe<br />\nreminiscent<br />\nwas<br />\nfinals.<br />\nthe play off games.<br />\nplayed<br />\nMr. Hambleton recognizes the need<br />\nAnderson<br />\ngame,<br />\nJohns Hopkins University held its<br />\nThe game, played in a gymna- second<br />\nSuccessful Season Seen<br />\nThe runner up gained the right to for capable men in all branches of<br />\nMilmatch<br />\nfield<br />\nnot<br />\nhe<br />\nand<br />\ncould<br />\ntrack<br />\nsmoothly,but<br />\ninvitation<br />\nannual<br />\nThe showing of the Hopkins ensium packed with Homecoming alumparticipate for the crown by con- field and track. He emphasized deberg's speed and accuracy. Dick Pas- trants in such high class competi- meet at the Armory.<br />\nni, ended with the score at 33-23.<br />\nthe Goldman A.C. and the ficiencies especially in the high jump,<br />\nquering<br />\nthe<br />\nthrough<br />\nsailed<br />\nHopkins,<br />\nternak,<br />\nThis contest served to nullify the de- second singles by defeating Rockmore<br />\nNew Jersey All-Stars in addition to pole vault, and high hurdles. A numthe teams in its own league.<br />\nfeat handed the Johnnies by the Jays 15-9, 15-10. Dick played his usual<br />\nber of veterans have returned for<br />\nThe final contest was closely con- another year of competition, but<br />\nin their tussle at Homewood on Jan- fine game.<br />\ntested and the ultimate result was they are not numerous enough to<br />\nBackman, of Pennsylvania, won the<br />\nuary 16, thus setting a tie-up in honin the nature of an upset since the fill all the vacant positions.<br />\nors between the traditional rivals visitors' only victory, but not until<br />\nloser's line-up, studded with outGraziano Heads Squad<br />\nafter a hard fight put up by Captain<br />\nfor the past series of hoop battles.<br />\nstanding men such as Wiseman,<br />\nLqd by Captain Graziano, star<br />\nNat Finklestein. The match went to Fifty Candidats In Battle For Yearlings End Season With<br />\nBiepler and Gambrill was conceded sprint man and broad-jumper, the<br />\nThe affair started very slowly, with<br />\nthree games, 15-10, 9-15, and 15-10.<br />\nto have an edge. However, the Fresh- following veterans reported for imFive Wins And Two<br />\nJ. H. U. Badminton<br />\nthe home team getting first blood on Milt Alperstein won the last singles<br />\nman team, led by Litowitz, Bitsack, mediate action: J. A. O'Neill, the<br />\nLosses<br />\na foul snot. After that, the score see- by conquering \"Blimp\" Wolinsky afAwards<br />\nand Bernstein, provided too much of Jay's leading hurdler; G. Willen a<br />\nsawed to both sides, being tied up at ter three games, 15-4, 12-15, 15-9.<br />\nan attack for the Engineers.<br />\nfield man specializing in throwing<br />\nThe Johns Hopkins Jay Vee basThe Badminton Tournament under<br />\nfive instances during the first half,<br />\nWin Both Doubles<br />\nTo Meet Maryland<br />\nthe javelin; Tom Ellis, Hopkins conof Reuben Baer keteers bowed to the St. John's jundirection<br />\ncapable<br />\nthe<br />\nAs has been the custom, the inter- tribution to the Olympian arts of<br />\nfinally stopping at 17-13 in favor of<br />\nThe Blue Jays won both doubles.<br />\nswung into action, last week, in order ior varsity by the count of 23-13 last<br />\nclass champs of the University of discus tossing and pushing the shot;<br />\nthe Crabtowners when Ref Enright Pasternak paired up with Milberg to determine the best \"Birdie SwatSaturday evening in a curtain-raiser Maryland will be met by the newly Carl<br />\nnew<br />\nThis<br />\n15-8.<br />\n15-12,<br />\nfirst,<br />\nthe<br />\ntake<br />\nto<br />\nScharpf, a distance runner; John<br />\nIn<br />\nperiod.<br />\ntooted his horn to end that<br />\nter\" of the University. Over fifty en- to the varsity battle of both teams.<br />\ncrowned champions. The contest is Driscol, a middle-distance man of<br />\ncombination clicked smoothly, to the<br />\nvery<br />\nsport<br />\nthusiasts of this popular indoor<br />\nthis part of the fray, play was<br />\nThe calibre of the Black and Blue's scheduled to take place tomorrow some<br />\ndisadvantage of Anderson and Rockworth.<br />\ndeliberate, with no passes going to more. The Pennsylvania team ap- have entered in the ladder tournament, game was so decided a let down as night at College Park. Last year the<br />\nA<br />\nof last year's squad have<br />\nnumber<br />\nshowing the ever-increasing popular- compared with their regular play that<br />\nHopkins team was easily downed by nix as yet turned up, but their names<br />\ncovered receivers, with scoring set- peared to be unfamiliar with the sinity of this game which came to the the defeat may well be justified as<br />\na strong Maryland aggregation but are expected to be among those<br />\nups arranged before the ball was put gle wall court, and were bewildered U. S. from England. The entrants<br />\ndue to an \"off-night.\" When the half Reuben Baer hopes that this year's holding berths on the 1937 track<br />\nArsmashes.<br />\ncorner<br />\nvictors'<br />\nthe<br />\nby<br />\ninto motion. Quick breaks featured<br />\nare arranged in five ladders.<br />\ntime whistle blew the Johnnies were representatives will return victorious. crew. A few are Norman Baetjer,<br />\nnold Glantz combined with Joaquin<br />\nthe opening canto, and provided the<br />\nThe favorites are L. Applefeld, J. in the lead by 12-8, an advantage<br />\nsuperlative short distance dasher; H.<br />\nHernandez, former Cuban four-wall<br />\nslight edge gained by the Orange and champ, to win the second doubles, Neely, N. Finkelstein, M. Kronberg, which they retained throughout the<br />\n.Jarman, hurdler and high-jumper;<br />\nM. Macht. The members of each second half. Occasional spurts of the<br />\nBlack at that time.<br />\nCharley Morley, king of the Blue jay<br />\nand consequently the fifth Black and and<br />\nby means of challenge match- Blue Jay's, although they were too<br />\nladder,<br />\nmiddle distances; George Brown,<br />\nBlue victory, from Wolinsky and<br />\nJohnnles Increase Lead<br />\npositions, short and infrequent to make the conPennsylvanians es, will vie for the top four<br />\na two-miler of proven team value;<br />\nThe<br />\nBackman.<br />\nat<br />\nSt. John's increased their lead<br />\nin order to reach the play-offs. The test a close one, were indicative of<br />\nPaul Castelle,another man who doesn't<br />\npressed the Jays hard in the first two<br />\nthe fine brand of ball they have disthe offset of the last inning on shots games, taking the second, but were ladders are arranged as follows:<br />\nAfter dropping two matches to walk his mile for a camel; and Harold<br />\nnow is the time for all good played throughout the season. High<br />\nby Delisio and Ross. They were never swamped in the decisive third game.<br />\na potential field star.<br />\nMaryland, the Black and Blue Zheutlin,<br />\nWestern<br />\nLadder B<br />\nscoring honors for the visitors were<br />\nLadder A<br />\nIn<br />\nthere follows a list of<br />\naddition<br />\ntied by the visiting team after those The scores of the last match were<br />\nJ. Neely<br />\nshared by Clements and Angual with rifle team of Hopkins registered a hopefuls whose<br />\nL. Applefeld<br />\nnames have not as<br />\ntosses swished through the nets. Lam- 15-13, 14-15, and 15-5.<br />\nvictory<br />\nover<br />\nGettysburg<br />\nUniversity.<br />\nR. Cluster<br />\n6 points, while Bill Day, high scorer<br />\nH. Slinger<br />\nplaced<br />\nin limelight spots:<br />\nbeen<br />\nyet<br />\nsteadscheduled<br />\nlead<br />\nthe<br />\nbeen<br />\nA return match has<br />\nbros and Ross built up<br />\nof the season, lead the Hopkins J. V.'s This contest was a shoulder-to F. Lewis, M. B. Macht, J.<br />\nM. Nachlas<br />\nJ. Karfgin<br />\nHamilton,<br />\nily on fast cutaways toward the bas- at Philadelphia on Saturday afterthis<br />\nmatch,<br />\nand<br />\nshoulder<br />\nvicwith<br />\nH. Brown<br />\nby accounting for 5 points.<br />\nR. Levine<br />\nH. Steingrob, D. Kerstetter, J. Steepket after Captain Delisio had set up noon, March 20. The match will be B. C,ourtwright<br />\non<br />\nwon<br />\nits<br />\ntory,<br />\nHopkins<br />\nSaturday,<br />\nL. Piven<br />\nThis encounter brought to an end<br />\ner, S. Miller, E. Feinblatt, W. Holman,<br />\nthe play on a pass to Rowe, the John- played on fourwall courts, giving an M. Fine<br />\nfifth out of seven matches.<br />\nE. Frey<br />\nsuccessful season for the Hopkins<br />\na<br />\nH. Hopkins, G. Carleton, C. Dresch,<br />\nny center. However, it was not these advantage to the Penn team. The F. Butt<br />\nPhil<br />\na<br />\nGuild<br />\nup<br />\nmarked<br />\nperfect<br />\nD. Tissenbaum<br />\nJunior varsity with 5 wins against 2<br />\nB. Rome, S. Rosner, and J. Billovitz.<br />\nfield goals that provided the margin Hopkins aggregation has seen most L. Peters<br />\nscore from the prone position, shot<br />\nC. Schwartzman<br />\nlosses.<br />\n1937 track schedule:<br />\nof victory for the home team as the of its intercollegiate action on sin- J. Handelsman<br />\n90<br />\nsitting<br />\nand<br />\nfrom<br />\nthe<br />\n74<br />\nposition,<br />\nM. Seal<br />\nV.'S<br />\nJ.<br />\n10<br />\nJOHN'S<br />\nApril<br />\nAway<br />\nSwarthmore<br />\nST.<br />\nSt.<br />\nby<br />\nexpects<br />\naway<br />\ntherefore<br />\ngle wall courts, and<br />\nten two-pointers put<br />\nstanding for the total of 264. ToA. Musick<br />\nD. Peek<br />\nG. F. T.P.<br />\nApril 17<br />\nAway<br />\nHaverford<br />\nJohn's were matched by an equal to be slightly handicapped. Last year, S. Brozeck<br />\nby<br />\ngether<br />\nwith<br />\nthe<br />\nshot<br />\n264<br />\nLindenD. Meigs<br />\n2<br />\n0<br />\n1<br />\nApril 21 ..Western Maryland ....Home<br />\nBoeris, f.<br />\nnumber by the M.allonee-men. Hop- Pennsylvania defeated the Jays on J. Pollack<br />\nmayer, Guild copped high mark for<br />\n2<br />\n0<br />\n1<br />\nApril 23-24 Penn Relays Philadelphia<br />\nClose, f.<br />\nkins managed to put away only three their courts, 5-1, which is the reversed<br />\nthe afternoon.<br />\nLadder D.<br />\nLadder C<br />\n0<br />\n0<br />\nAway<br />\n0<br />\nApril 27<br />\nCatholic U.<br />\nf.<br />\nRenshaw,<br />\ncharity tosses, while their opponents' score of their latest meeting.<br />\nHOPKINS<br />\nM. Kronberg<br />\nN. Finkelstein<br />\n2<br />\n0<br />\n1<br />\n1<br />\nMay<br />\nHome<br />\nCollege<br />\n_Washington<br />\nc.<br />\nWeisheit,<br />\ntimes.<br />\n13<br />\ntrue<br />\nran<br />\nfoul shots<br />\nGuild<br />\n100 90 74- -264<br />\nL. Ransom<br />\nSt. John's Next<br />\nC. Flagle<br />\n0<br />\n3<br />\nMay 8<br />\nHome<br />\nMason-Dixon<br />\nClements, c.<br />\n98 90 76-264<br />\nLindenmayer<br />\nChrist<br />\nC.<br />\nOrchids To Herby<br />\nGorden<br />\nL.<br />\nAnnapolis<br />\nto<br />\nwill<br />\ntravel<br />\nThe team<br />\n0<br />\n0<br />\n0<br />\nChampionship<br />\nLyon, c<br />\n98 93 64-255<br />\nRossberg<br />\nA. Sklar<br />\n6<br />\n0<br />\nHerby Siegel, captain and right for- Friday afternoon to face St. John's. P. Reigner<br />\nMay 14-15 Middle Atlantic<br />\n3<br />\nAngual, g.<br />\nLeber<br />\n96 80 74--250<br />\nLittler<br />\nC.<br />\nWestendorf<br />\nC.<br />\nthe<br />\nfor<br />\ngame<br />\nthe<br />\nbetween<br />\n0<br />\nward, played his final<br />\n0<br />\nIt will be the first match<br />\n0<br />\nMeet .... Gettysburg<br />\nHeenen, g<br />\nStegmaier<br />\n96 86 55-231<br />\nL. Shettles<br />\n5<br />\nBlack and Blue at Annapolis, and will schools this season. The Johnnies S. Prager<br />\n3<br />\n1<br />\nTucker<br />\nA. Welch<br />\nbe the only man lost to the squad. went down before the Jays last year, M. Breyer<br />\nTotal<br />\n1270<br />\nRailing<br />\nW.<br />\nAskins<br />\nS.<br />\nhead<br />\nthe<br />\nMaat<br />\nWestern<br />\nseason<br />\nmorning,<br />\nthe<br />\n23<br />\nSaturday<br />\nfinished<br />\n3<br />\n7-0.<br />\nHerby<br />\n10<br />\nGETTYSBURG<br />\nArosa<br />\nA.<br />\nRosenblatt<br />\nJ.<br />\nof his team in scoring, thus furnish- ryland will come to Homewood to<br />\nHill<br />\n93 85 68-244<br />\nVarsity baseball practice took place<br />\nHOPKINS J. V.'S<br />\nW. Durding<br />\ning more than the usual guiding hand. play off their return match. Earlier E. Thomas<br />\nDoll<br />\n83<br />\n95<br />\n63-241<br />\nT.P.<br />\nlast<br />\nSaturday, at the Gilman Country<br />\nF.<br />\nG.<br />\nPopow<br />\nJ.<br />\nHe went through every game giving in the season, the Terrors were shut I. Scherles<br />\nFricy<br />\n93 81 64-238 School cage under the watchful eye<br />\n2<br />\n0<br />\n1<br />\nf.<br />\nReynolds,<br />\nHarris<br />\nH.<br />\nball,<br />\nheads-up<br />\nout, 5-0, at Westminster.<br />\na fine exhibition of<br />\nMcCormack<br />\n89 79 69-237 of Coach Robert E. Owings. About<br />\n2<br />\n0<br />\n1<br />\nSilberman, f.<br />\nLadder E.<br />\nand will be a very hard man to reSINGLES<br />\nCompton<br />\n94 67 31-192 forty candidates worked out under<br />\n0<br />\n0<br />\n0<br />\nf.<br />\nBeeler,<br />\nM.<br />\nMacht<br />\nof<br />\nyears<br />\nplace. Siegel has played four<br />\nMilberg, Hopkins, defeated AnderThe<br />\n--- perfect weather conditions.<br />\n5<br />\n1<br />\n2<br />\nDay, f<br />\nR. Levy<br />\nvarsity ban, an enviable record for son, 15-1, 15-11.<br />\nTotal<br />\nwere<br />\n1152<br />\nand<br />\npitchers,<br />\n2<br />\n0<br />\nbatters,<br />\n1<br />\ninfielders<br />\nc.<br />\nWetzler,<br />\nGreenberg<br />\nP.<br />\nany courtman, and throughout his caPasternak, Hopkins, defeated Rockdrilled intensively in their respective<br />\n2<br />\n0<br />\n1<br />\nNaylor, g<br />\nL. Tilken<br />\nreer at Hopkins has been a constant more 15-9, 15-10.<br />\narts.<br />\n0<br />\nSeveral freshmen prospects<br />\n0<br />\n0<br />\ng.<br />\nBaum,<br />\nWaxman<br />\nJ.<br />\nscoring threat, a veritable thorn in<br />\nshowed themselves up to a good ad0<br />\n0<br />\nBackman, Pennsylvania, defeated<br />\n0<br />\ng.<br />\nSnodgrass,<br />\nFinkelstein<br />\nN.<br />\nfastThe<br />\nopponent.<br />\nthe side of every<br />\nvantage. The splendid showing of the<br />\n0<br />\n0<br />\nFinkelstein, 15-10, 15-10.<br />\n0<br />\nRoyster, g<br />\nF. Diehl<br />\nest man on the squad, he is a good<br />\nbrightened the hopes for a<br />\nfreshmen<br />\n0<br />\n0<br />\n0<br />\ng.<br />\nWoWillen,<br />\ndefeated<br />\nJ.<br />\nHopkins,<br />\nEnders<br />\nAlperstein,<br />\nunder<br />\noutside,shot, but really excels<br />\ngood year in the diamond wars. Prac—<br />\nM.<br />\n15-9.<br />\n12-16,<br />\n15-4,<br />\nBrilliant<br />\nlinsky,<br />\nhe<br />\nwhich<br />\nin<br />\nshot,<br />\npet<br />\nHis<br />\nbasket.<br />\nthe<br />\ntice will be held on the lower field<br />\n13<br />\n1<br />\n6<br />\nW. Peters<br />\nDOUBLES<br />\ndribbles in from the sidelines toward<br />\ntoday.<br />\nto<br />\nmotion<br />\nHopkins,<br />\nMilberg,<br />\nside-like<br />\nand<br />\na<br />\nwith<br />\nPasternak<br />\nthe basket<br />\nVictory Over Blue Ridge Gives<br />\nthen leap up and deposit the sphere defeated Anderson and Rockmore,<br />\nFrosh Team Four Victories<br />\nmost<br />\nthe<br />\npractically<br />\n15-12, 15-8.<br />\nin the netting, is<br />\nAnd Two Defeats<br />\nHernandez and Glantz, Hopkins, dedifficult to guard against.<br />\n15-13,<br />\nAltho the game marred somewhat feated Wolinsky and Backman,<br />\nThe Freshman basketball team ended their season by defeating a strong<br />\nthe scoring spree of the Homewood 14-15, 15-5.<br />\nChampionSchool<br />\nFor<br />\nDefeats Small In Handball Match<br />\nboys during the past few contests,<br />\nBlue Ridge team.<br />\nDivision A<br />\nHOPKINS<br />\nthis season represented one of the<br />\nship; Wins Gold Medal<br />\nStarting the season off with a vicWon Lost.<br />\n1 0-0 2<br />\nMelvin, f.<br />\nmost successful basketball eras in<br />\ntory over the J. V. the Freshmen, un0<br />\n7<br />\nKappa Alpha<br />\nThe third annual handball tourna- Schol where he was a letterman both der the tutelage of Coach Frank Dot3 2-3 8<br />\nSiegel, f.<br />\nrecent years. Much praise is due<br />\n6<br />\n1<br />\nPi Lambda Phi<br />\nment came to a close last Friday as in swimming and tennis. In 1931, he terweich have defeated Blue Ridge<br />\n2 0-1 4<br />\nCross, c.<br />\nCoaches Mallonee and Twardowicz in<br />\n2<br />\n5<br />\nDelta Upsilon<br />\nMilton Alperstein conquered Philip won the New York State Archery twice and Towson. They have lost<br />\n2 1-2 5<br />\nRasin, g.<br />\ntheir development of the present club.<br />\n3<br />\n4<br />\nTau Alpha Omega<br />\nSmall to win the gold medal by the Tourney and was presented with the two hard fought games to Tome and<br />\n2 0-2 4<br />\nZheutlin, g.<br />\nIt is seldom that these men are nogold medal symbolic of victory by Gilman.<br />\n4<br />\n3<br />\nKappa Alpha<br />\nscores of 21-15, 21-16.<br />\n— — —<br />\nticed by spectators, or is any glory of<br />\n5<br />\n2<br />\nPhi Epsilon Pi<br />\nMilt Alperstein, Sophomore pre- President Roosevelt, then Governor<br />\n10 3-8 23<br />\nTotals<br />\nvictory theirs, but their work was of<br />\nThe members of the team who<br />\n0<br />\n6<br />\nPhi Kappa Psi<br />\nmedical student, reached the final of New York State.<br />\nST. JOHN'S<br />\nsuch a nature that any orchids set<br />\nhave been mainstays are Brayshaw,<br />\nSmall Silver Medalist<br />\n6<br />\n0<br />\nPhi<br />\nSigma<br />\nDelta<br />\nround by defeating Harry Nieren2 1-1 5<br />\nLambros, f.<br />\nforth here would, of necessity, be inMcand<br />\nQuitt, Litowitz, Traymor<br />\nPhil Small, runner-up in the tournaDivision B<br />\nberg, while Small defeated Floyd<br />\n4 3-3 11<br />\nRoss, f.<br />\nsufficient.<br />\nGovern. These men will be posilver<br />\nthe<br />\nof<br />\nwinner<br />\nthe<br />\nis<br />\nment,<br />\nmedals<br />\nreceive<br />\nWon Lost<br />\nwill<br />\nfour<br />\nAll<br />\nKatske.<br />\n1<br />\n5<br />\n3-6<br />\nc.<br />\nRowe,<br />\ntential material for the varsity team<br />\nCarl Rasin and Harold Zheutlin<br />\nmedal. He is not a member of the<br />\n8<br />\n0<br />\nPhi Gamma Delta<br />\nfuture assembly.<br />\n6<br />\na<br />\nat<br />\n0-2<br />\n3<br />\ng.<br />\nDelisio,<br />\nthe<br />\nup<br />\ntake<br />\nand<br />\nto<br />\nball<br />\nhard<br />\nplayed<br />\nnext<br />\nyear<br />\nyear,<br />\nhaving<br />\nnext<br />\nback<br />\nwill be<br />\nof his affilbecause<br />\nteam<br />\nhandball<br />\n2<br />\nwas<br />\n6<br />\nathlete,<br />\nversatile<br />\nOmicron<br />\na<br />\nKappa<br />\nOmicron<br />\nAlperstein,<br />\n6<br />\n6-8<br />\n0<br />\ng<br />\nShawn,<br />\nhaving improved greatly this season.<br />\nburden at the guard posts, and should<br />\n2<br />\n4<br />\nPhi Alpha<br />\nof the handball team last iation with the fencing team. He<br />\nmember<br />\na<br />\nplay<br />\nof<br />\ntype<br />\ntheir<br />\ncontinue<br />\nthese men<br />\nHe is a sophoepee.<br />\nand<br />\nfoil<br />\nfences<br />\n3<br />\nwith<br />\nthe<br />\n3<br />\nplaying<br />\nbeen<br />\nPhi<br />\nDelta<br />\nhas<br />\nand<br />\nyear<br />\n33<br />\n13-18<br />\n10<br />\nTotals<br />\nin 1938, Hopkins will go far. Shorty<br />\nstudent from<br />\npre-medical<br />\n3<br />\n3<br />\nAlpha Epsilon Pi<br />\nvarsity during the present season. more<br />\nScore by halves:<br />\nCross has improved steadily this seagraduated<br />\nhaving<br />\nY.,<br />\nN.<br />\nBrooklyn,<br />\nJunthe<br />\nof<br />\n3<br />\n2<br />\nmember<br />\nAlpha Delta Pi<br />\na<br />\nwas<br />\nalso<br />\nHe<br />\n17 16-33<br />\nSt. John's<br />\nson, adding continually to his scoring<br />\nClasses in tap dancing begin to3<br />\n2<br />\nBeta Theta Pi<br />\nior Varsity basketball team and is from Lincoln High School.<br />\n13 10-23<br />\nHopkins<br />\ntotal, and being a ne man to work the<br />\nmorrow at. me gym unuer WC Luanu<br />\nsophomore<br />\nNierenberg,<br />\nHarry<br />\non<br />\nbase<br />\n2<br />\n4<br />\nthird<br />\nfor<br />\nprospect<br />\nTau Phi Epsilon<br />\nlikely<br />\na<br />\nTraggis<br />\nHopkins,<br />\n—<br />\nNon-scorers<br />\nin<br />\nnotorious<br />\nMelvin,<br />\nNorm<br />\nball with.<br />\nFloyd Katske, senior, are the winners telage of Jack Bamberger. All those<br />\n0<br />\n4<br />\nTau Alpha Phi<br />\nBrown, the Baseball Team.<br />\nthe league for his dangerous overhead Rubinger; St. John's, Owens,<br />\nof the bronze medals. They are both desiring to enter the class are urged<br />\nadto<br />\n0<br />\nshowed<br />\n5<br />\nSigma Phi Epsilon<br />\nHis athletic ability<br />\nSimopouEnnis,<br />\nStrange,<br />\nGolstein,<br />\nfinefforts,<br />\nunderbasket<br />\nshots and<br />\nto notify him immediately.<br />\nvantage in George Washington High members of the handball squad.<br />\nishes his second year of varsity play.<br />\nSurprising a good field, Norman<br />\nBaetjer sprinted to victory in the<br />\n70 yard A.A.U. dash at the track<br />\nand field meet at the Fifth Regiment<br />\nArmory Saturday night in the time of<br />\n7.2 seconds. In placing first, Baetjer<br />\nenabled the Hopkins to tie for the<br />\nfourth place in the A.A.U. division<br />\nin a field of twenty opponents with<br />\na total of five points.<br />\nBaetjer's time of 7.2 seconds<br />\nequalled the time made by Hopkins<br />\nof Virginia who won the Intercollegiate division of the 70 yard dash. Ted<br />\nGraziano, the Hopkins entrant in<br />\nthat division, placed third in his<br />\nheat, and was eliminated in the semi-<br /><br />\nI<br /><br />\ntI<br /><br />\nBirdmen Commence Jay Vee Courtmen<br />\nTournament Play Lose To St. John's<br /><br />\nBlue Marksmen<br />\nTop Gettysburg<br /><br />\nBASEBALL<br /><br />\nFreshman Quintet<br />\nConcludes Successful<br />\nSeason With Victory<br /><br />\nAlpersteinVictorInTournament<br /><br />\nFinal Frat<br />\nStanding<br /><br />\nTAP DANCING<br /><br />\ni<br />\nai<br />\nal<br /><br />\nIn<br />\ndi<br />\nT1<br />\nth<br />\nbe<br />\nJu<br />\nth<br /><br />\nev<br />\nnu<br />\nin<br /><br />\nyo,<br /><br />\nrel<br />\narr<br />\nof<br /><br />\nnui<br /><br />\nthE<br /><br />\n/<br /><br />\nof<br />\nit<br /><br />\nwh<br /><br />\norn<br /><br />\nlev<br /><br />\nact<br /><br />\nclu.<br /><br />\npar<br />\nten<br />\nthe<br />\nat<br /><br />\ndoll<br />\nin<br />\nof<br /><br />\nTi<br /><br />\nInsi<br /><br />\nin I<br /><br />\ndell,<br /><br />\nto t<br />\nthe<br />\nIn<br /><br />\np.m.<br /><br />\nseri(<br />\ntwo<br />\nHov‘<br />\nSpet<br />\nChu<br /><br />\nDi<br />\nfirst<br />\nand<br />\nSt<br />\nBlur<br />\nshee<br /><br />\nOffiC4<br /><br />\nstud<br /><br />\nAll.<br /><br />\nT1<br />\npres.<br />\nerini<br />\nsist<br />\nMoz<br />\nthe<br />\nfor f.<br /><br />"}], "field_media_file": [{"target_id": 39090, "display": null, "description": null, "target_type": "file", "target_uuid": "dc566dcc-27ce-422b-97c6-fb8920f08907", "url": "http://digital.library.jhu.edu/system/files/2022-03/12766-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12766, "target_type": "node", "target_uuid": "2ecf02a6-c966-4bef-ad65-44b2a937893e", "url": "/node/12766"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0b05ef77-6b2c-4841-b06a-c38df32cb569"}]}