{"mid": [{"value": 35724}], "uuid": [{"value": "22276881-2417-46ec-97df-0bf667d75212"}], "vid": [{"value": 35724}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:12:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12258-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:12:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:12:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "1<br />\n<br />\n.,,,,makinoomoomaeitsPiltrffle40,<br />\n<br />\n(/<br />\n<br />\nITIAINNIMMITIYMMItosI To; nis<br />\n<br />\nCR<br />\n<br />\nHENJOHNS•HOTKINS•UNIVERSITY<br />\nBALTIMORE<br />\n<br />\n\f\fThe News-Letter<br />\nVol. IX.<br />\n<br />\nDecember 23, 1904,<br />\n<br />\nE Christmas time,<br />\nEbe worlb lies beep beneath a covering fair<br />\nOf white, that Engels floating bown the shr<br />\ntap gentiv on its surface, colt, anb bare-festal garment, set with jewels rare<br />\nChat gleam ant) bla3e anb glisten ba33linglv;<br />\n\"E richer robe bib great Queen never wear<br />\nEt feast of Christmas time.<br />\nEt Christmas time,<br />\nEN highest feast the circling seasons bring,<br />\n1X1hen all manhinb rejoice in festal bress,<br />\nCo celebrate the Iiirthbav of their ting,<br />\ntet nature be the one createb thing<br />\nCo lie 'nail) Heaven colb anb comfortless,<br />\nO'er her a tiashino robe the Engels fling,<br />\nChe now of Christmas time.<br />\n<br />\nNo. 5<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nJournalism as a Profession.<br />\nThere are so many kinds of newspaper<br />\nwork and so many classes of publications,<br />\nthat any general discussion of this subject<br />\nis impossible in the limited space allowed.<br />\nLeaving out, however, all kinds and classes<br />\nof papers save those of commanding influence and power for good, the field is one in<br />\nwhich what may be called \"the personal<br />\nequation\" will tell the story of success or<br />\nfailure. And so, if a young man, looking<br />\nabout for a life vocation, should ask me to<br />\nadvise him whether or not to adopt journalism as a profession, I should first want to<br />\nknow that young man better than one father<br />\nin a thousand knows his favorite son. I<br />\nshould want to measure his capacity and<br />\ncharacter and test the metal of his ambition.<br />\nThere is room for usefulness all the way up<br />\nfrom the bottom, but for a man of real ability and ambition the only places in journalism worth having are at the top or very<br />\nnear the top. These he can never attain<br />\nunless endowed by nature with certain peculiar gifts. What Horace said of the poet<br />\nis true of the journalist.<br />\nIt is safe to say that on few other practical questions is the popular idea concerning the requisites for success more vague.<br />\nNine men out of ten, even among the more<br />\nintelligent, are under the impression that<br />\nthe mere ability to write good English is<br />\nthe main, if not the only, qualification required for successful newspaper work. As<br />\na matter of fact, my observation leads me<br />\nto believe that mere ability to write well<br />\nis a minor factor in counting up the qualifications for success in this line of work.<br />\nThe main thing is to know what to write<br />\nabout—in other words, to know what constitutes news, what the public really wants<br />\nto read and be advised about. Some of the<br />\nmost successful men at the top seldom write<br />\na line. They tell the men at .the bottom<br />\nwhat to say.<br />\nAnother factor in journalistic success of<br />\nscarce less importance than to know what<br />\nis news and what to discuss, may be expressed in the single word—character. Love of<br />\n<br />\ntruth for truth's sake is indispensable to<br />\ncommanding influence in this field of human<br />\nendeavor. There are hundreds of men with<br />\nthe gift of knowing how to write and even<br />\nof what to write about, and who at the same<br />\ntime may be real lovers of truth, who can<br />\nnever reach the top. For your truly great<br />\neditor, or manager—or whatever the man<br />\nwho really controls, directs and inspires a<br />\nnewspaper may choose to call himself—will<br />\nbe found to be intensely patriotic and in full<br />\nsympathy with his brother man. Indeed, I<br />\nmake bold to declare that no enduring success was ever made in the upbuilding of<br />\nany newspaper or periodical if its real head<br />\nlacked either patriotism or philanthropy.<br />\nThe motto of all permanently great publications is \"The greatest good to the greatest<br />\nnumber;'' and is lined up to \"without variableness or shadow of turning.\" The public<br />\ndoes not obey the golden rule to the extent<br />\nof doing good for evil. If you prove its<br />\nfriend, it will be yours. If you are indifferent to its welfare, it is deaf, dumb and blind<br />\nto your interests. If you slap it in the face<br />\nit will turn upon you and destroy you.<br />\nAnother desideratum is sense of proportion; a knowledge of relativity. The public is always the final judge of what it<br />\nwants. To know what the public wants to<br />\nread and be advised about is a condition<br />\nprecedent to a knowledge of the relative<br />\nvalue of news and of the relative importance<br />\nof subjects for editorial discussion. Lack<br />\nof this single requisite has kept many a<br />\nbright and capable man in a subordinate<br />\nThe tyro generally<br />\nposition all his life.<br />\ngives the greatest prominence to items and<br />\nsubjects which appeal to him, and it generally happens that these are the things in<br />\nwhcih the public is least concerned. \"The<br />\nproper study of mankind is man\" applies<br />\nto journalism as to other callings. To keep<br />\nin touch with public sentiment it is necessary to study. man collectively.<br />\nThat the requisites for success in journalism are peculiar and generally little comprehended is attested by the fact that so<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nmany men of real capacity try it and fail.<br />\nIt is not perhaps too much to say that there<br />\nis a larger percentage of men who after failing in journalism succeed in other lines than<br />\nof those who redeem early failure in any<br />\nother calling.<br />\nThe successful journalist must not only<br />\nknow the truth, love the truth, know what<br />\nis worth while and what is not, have at heart<br />\nthe public welfare, be imbued with a discerning sense of proportion and relativity,<br />\nbut he must be progressive, or all these<br />\nqualities will count for naught. He who<br />\nsucceeds in any line must be alert and wide<br />\nawake to changing conditions. Every hour<br />\nchanges the relations of people and things<br />\nTies are sundered,<br />\ntoward one another.<br />\nsympathies are transferred, the old are passing and the new are edging in. The newspaper man, more than all others, is required<br />\nto keep in closest touch with ever changing<br />\nconditions, to keep familiar with the kaleidoscopic complexities of modern civilization.<br />\nThe true journalist must be able to discern<br />\nthe signs of the times as they relate to every<br />\nform of human endeavor. He must be the<br />\nseer and the prophet, the interpreter and<br />\nthe orator, the teacher, the preacher. All<br />\nthis, of course, if he aims at the highest<br />\nmeasure of success.<br />\nThere are, however, found in newspaper<br />\noffices all over the land men who esteem it<br />\nto their credit if they have for a number of<br />\nyears filled the same position on the same<br />\npaper, as, for instance, a police reporter or<br />\na \"sporting editor,\" who has become a<br />\nlocal authority in his specialty. Indeed, I<br />\nhave known various successful \"political<br />\neditors\" who did not even attempt to write<br />\ntheir own stories but who were news gatherers of such marvellous energy and success<br />\nthat they were regarded as invaluable members of the staff. But these are subordinate<br />\nmembers of the profession.<br />\nI am considering this question only from<br />\nthe standpoint of a college-bred man who is<br />\nlooking about for a career in life which seems<br />\nto him worthy of a high ambition—an ambition which nothing but the highest achievement will satisfy. To such a young man I<br />\nshould say it is worth while to find out<br />\nwhether you are endowed with the journalistic instinct. This can be done only by<br />\ntrying. Begin at the bottom. \"Get a job\"<br />\nas a reporter. Don't for a moment harbor<br />\n<br />\n3<br />\n<br />\nthe thought that you know a little bit about<br />\nthe work. Do what you are told to do as<br />\nif your life depended on it. If it be in you<br />\nto succeed you will be discovered and invited<br />\nto step up higher. But don't expect premature appreciation, for if you do your certain disappointment will be painful and perhaps discouraging.<br />\nIt goes without saying that the career of<br />\na journalist is extremely attractive to the<br />\nman of capacity, equipment and high resolve.<br />\nFew positions in our national life are more<br />\nto be desired than those which have been<br />\nheld by a Greeley or a Dana or those that<br />\nare now held by such men as Henry Watterson or Richard H. Edmonds—types of men<br />\nwho, though in widely different fields, are<br />\nprofoundly impressing the thought of to-day<br />\nand exerting a powerful influence for good,<br />\nas they see it, on the public mind,<br />\nIn the changing conditions in journalism<br />\nas in every other line of endeavor, it may not<br />\nbe possible for a Greeley, a Dana or a Watterson or an Edmonds to soon appear again<br />\nin the journalistic field, but it is inconceivable that men of keen perceptions, broad<br />\nsympathy and high ideality, if intensely in<br />\nearnest can fail of achieving a certain measure of success, and I really believe there<br />\nnever has been a greater demand for ability<br />\nof the highest order nor a time when faithfulness, patriotism and righteousness were<br />\nmore needed in journalism than at the present time, and I believe the rewards will be<br />\nas great and as satisfying as they ever have<br />\nbeen, even if they may not come in exactly<br />\nthe same way. The young man who chooses<br />\njournalism as his career may therefore have<br />\nno fear that the field of his endeavors or the<br />\nrange of his achievements will be small, if<br />\nhis mind is on his work and his whole heart<br />\nin it. If he have quick apprehension (instinctively and acquired), if he have broad<br />\nsympathies and high ideals, he should be<br />\nable to organize himself into an efficient journalistic force, though he may never quite<br />\nreach the top. With these qualifications he<br />\nwill be able to write in a manner that the<br />\npublic will appreciate and understand; he<br />\nwill be able to treat of the subjects in which<br />\nthey are interested, and will be able to command their confidence and respect; because<br />\nof the loyalty and devotion to humanity<br />\nwhich are his.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nA Bunch of Blue Violets.<br />\nThey sat in the farthest corner of the spacious parlor, out of the glare of the brilliant<br />\nchandelier. In manly tones, he poured forth<br />\nburning words in her ear. She bent her<br />\ngraceful head, and nervously twirled the<br />\nlittle bunch of blue violets he had brought<br />\nher.<br />\nBut at last she stopped him.<br />\n'Harry,\" she said firmly, \"it cannot be.<br />\nYou know how bitterly father opposes it, and<br />\nI must consider his will in the matter. And<br />\nthen, too,\" she added, while her bright eyes<br />\nfilled with tears, \"since mother is gone, there<br />\nis no one to take care of him but me, and<br />\nI cannot desert him now.\"<br />\nOn hearing this, Henry Underwood's heart<br />\nsmote him at the thought that he could wish<br />\nto tear this noble girl away from where duty<br />\ncalled her. He wondered how he could find<br />\nit in him to press her further; though her<br />\ndevotion to her gruff old father, raised his<br />\nadmiration of her, if possible, still higher.<br />\n\"Edith,\" he said, as he finally rose to depart, \"I can wait. May I also hope?\"<br />\nEdith Upton. stood in the broad doorway,<br />\nher tall shapely figure revealed against the<br />\nbackground of the lighted hall. She did not<br />\nanswer his question, for, at that moment, a<br />\nstout old gentleman, leaning heavily on a<br />\ncane, came hobbling up the steps. Henry<br />\ninstantly recognized him as Mr. Upton, and,<br />\nwith a word of greeting, was about to pass<br />\nout. But the old man blocked his way.<br />\n\"Young man, whoever you are,\" he<br />\ngrowled, pretending not to know him,\"your<br />\nvisits here are not welcome.\"<br />\nUnderwood was about to make some<br />\nhaughty reply, but Edith was too quick for<br />\nhim.<br />\n\"Father,\" she said imperatively, catching<br />\nhim by the arm, \"you must not stand here<br />\nin the night air. Come inside.\"<br />\nThe old man was strangely pliant in her<br />\nhands, and soon Underwood saw her pull<br />\nhim inside and shut the door, not, however,<br />\nwithout giving him a parting look, as he<br />\nwent slowly down the steps.<br />\nIt was with a heavy tread that young<br />\nUnderwood walked home that night. His<br />\naffair of the heart had come to a head, and he<br />\n<br />\nhad not won. Yet something told him that,<br />\nwere she free to choose, she would not utterly refuse him. But there was the insuperable obstacle of the purse-proud old man,<br />\nwho could not endure that a young man of<br />\nsuch limited expectations should pay attention to his daughter.<br />\nUnderwood slept but little that night. Ile<br />\nwas dimly conscious of heavy wagons that<br />\nrumbled by at intervals, and of bells ringing; but they made little impression on him,<br />\nfor his thoughts were otherwise occupied.<br />\nHe arose early and started down town to<br />\nhis work. As he went down the steps, he<br />\nnoticed a tangled roll of hose lying in the<br />\ngutter. He now remembered the rumblings<br />\nduring the night.<br />\n\"It has probably dropped from a passing<br />\ntruck,\" he thought, as he opened a basement<br />\nwindow and dropped it in, intending to notify the Fire Department.<br />\nWithout thinking further of it, he made<br />\nhis way down town. Accustomed always to<br />\nwalk, he did not notice that the cars were not<br />\nrunning. As lie began to approach the down<br />\ntown district, he was awakened from his<br />\nreverie by a distant roar, like the sound of<br />\na thousand voices. Looking up, he noticed<br />\nfor the first time a huge volume of smoke<br />\nthat spouted up into the sky as if from a<br />\nvolcano. Quickening his pace, he rapidly<br />\napproached the scene of the fire. As he<br />\nrounded a corner, a terrifying sight met his<br />\neye. Blocks of smoking ruins stretched before him, and the flames were leaping out<br />\ntowards buildings yet unconsumed. A large<br />\ncrowd stood and silently watched the irresistible march of the flames. Soon Underwood found himself in front of a large bank<br />\nbuilding. At first, on account of the changed<br />\nsurroundings, he did not recognize it. But<br />\npresently he was able to make out through<br />\nthe smoke, the inscription over the entrance:<br />\n\"The Upton National Bank.\"<br />\nHis heart gave a great leap. The flames<br />\nwere eating towards it, and, in all human<br />\nprobability, the bulk of old Mr. Upton's pos•<br />\nsessions would go up in smoke, and—he<br />\nhardly dared think it—Edith would be within his reach.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nAt that moment, an old man pushed his<br />\nway rapidly through the crowd, and came<br />\nrunning up to the bank building as fast as<br />\nthe gout would allow. He seemed to be almost besied himself. He ran frantically up<br />\nand down, and shouted hoarsely at everybody and everything.<br />\nA fire engine. was slowly passing.<br />\n\"Stop!\" cried the old man to the firemen.<br />\n\"Turn some water on this building.\"<br />\nThe engine did not stop.<br />\nWe have no hose,\" said one of the lireme\".<br />\nThe old man seemed almost in despair.<br />\nThere stood a plug just across the street,<br />\nbut the lack of a little hose seemed destined<br />\nto ruin him. The old Mtn seemed stunned.<br />\nIle stood still, and, though it was the month<br />\nof February, wiped the perspiration from his<br />\nbrow. Suddenly an -idea came to him.<br />\n\"One thousand dollars!\" he cried, \"to<br />\nanyone who will furnish enough hose to save<br />\nthe bank.\"<br />\n. The crowd seemed motionless, but already<br />\na young man had slipped away unnoticed.<br />\nLI a short time he returned, driving madly<br />\ndown the street in a ricketty wagon. Up<br />\nhe came pell-mell to the bank, sprang out,<br />\nand began to pull hose out of the rear end of<br />\nthe wagon. Willing hands attached it to<br />\nthe plug, and then the young nian and the<br />\nstout old gentleman together took hold of<br />\nthe nozzle, and sent a stream of water high<br />\ninto the air. The water played over the roof<br />\nand sides until the building was thoroughly<br />\ndrenched. Meanwhile, the fire had eaten up<br />\nthe adjoining building, and was now ready<br />\nto devour the bank; but against soaked walls<br />\nand dripping roof it could make no headway.<br />\nIt changed its course, passed on to the rear,<br />\nand left the bank the only building standing in the block.<br />\nWith a sigh of relief the old man let go<br />\nthe nozzle, and turned to his companion. The<br />\nYoung man's hat was gone, his clothes were<br />\ntorn, and his face was grimy with smoke and<br />\nwater splashes. But in spite of that, the old<br />\nThall recognized him for the first time as his<br />\ndaughter's suitoi'.<br />\n\"Sir,\" he said haughtily, \"come with me,<br />\nthat I may discharge the debt I owe you.\"<br />\nSo saying, he turned, unlocked the door<br />\nof the bank, and stepped inside. The interior was intact. He advanced to the office.<br />\n<br />\n5<br />\n<br />\nAs he did so, he looked behind him. To his<br />\nsurprise, the young man had disappeared.<br />\nFor two days after the fire, Underwood<br />\nconfined himself to his room. He felt that,<br />\nfor the present, he could not seen Edith. On<br />\nthe third day, a note was brought up to him.<br />\nIt ran thus:<br />\n\"Sir:<br />\nI would,fain attempt such an impossible<br />\ntask as that of discharging my indebtedness<br />\nto you. If possible, kindly meet me at my<br />\nhome this evening at eight o'clock.<br />\n(Signed) J. T. Upton.\"<br />\n\"A plague upon your money,\" grumbled<br />\nUnderwood, as he read the note.<br />\nBut, in spite of himself, something carried<br />\nhim towards the Upton home that evening,<br />\nand, almost without knowing it, he rang the<br />\nbell promptly at the hour named. The door<br />\nwas immediately opened by the old gentleman himself, who had his hat on and carried<br />\nhis cane in his hand.<br />\n\"Hub,\" growled the old man, in his usual<br />\ngruff manner, appearing not to recognize<br />\nhim.<br />\nUnderwood muttered something about the<br />\n\"wrong house,\" and was about to beat a<br />\nretreat. But the old gentleman's manner<br />\nquickly (hanged.<br />\n\"My dear Underwood,\" he said, in the<br />\nmost cordial tones the young man had ever<br />\nheard him use. \"I am delighted to see you.<br />\nI cannot express my gratitude for your services. It is hardly necessary to say that no<br />\npecuniary reward can possibly liquidate the<br />\nobligation.''<br />\n\"I neither expect nor deserve such a reward,\" replied the young man modestly.<br />\n\"We will have to settle it the best we<br />\nran,\" said the old man abstractedly, and<br />\nthen continued, \"I regret that an engagement will prevent me from conferring further with you at present, but maybe Edith<br />\nwill take my place.\" The old man chuckled<br />\na little to himself. \"P'r'aps that will suit<br />\nyou as well,\" he added, with a twinkle in<br />\nhis eye as he passed on down the steps.<br />\nThen, for the first time, Underwood saw<br />\nEdith standing in the hall, waiting to meet<br />\nhim. She was dressed simply in pure white,<br />\nand on her bosom she wore, still in the freshness of its beauty, the little bunch of blue<br />\nviolets.<br />\nJ. M. M., '06.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nthe ilewsaetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nDECEMBER 28, 1904.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nTHOMAS OWINGS,<br />\nORMOND W. HAMMOND,<br />\nH. FINDLAY FRENCH,<br />\n... THOMAS G. MACHEN,<br />\n<br />\n1905.<br />\n1906.<br />\n1906.<br />\n1906.<br />\n<br />\nW. R. STRAUGHN,<br />\n{ E. LELAND SHACICELP'ORD,<br />\nBusiness Manager,<br />\n0. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br />\n<br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br />\n<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors<br />\nAthletic Editors,<br />\n<br />\nAddress all articles, communications, etc., to THOMAS<br />\nOWINGS, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nG. WOLTERECK, box 677, J. H. U.<br />\n<br />\nED I TORIAL.<br />\nThe first of a series of articles to be written for the Ntw:;-LErrim on \"Journalism as<br />\na Profession\" is contributed this week by<br />\nColonel Thomas P. Grasty. The author is<br />\none of the leaders in the profession, and his<br />\nobservations upon writing for and conducting a newspaper should prove an inspiration<br />\nto those who are considering journalism as<br />\nthe best and most congenial way of winning<br />\na reputation and earning a livelihood. There<br />\nis scarcely a calling in which a man exercises<br />\nthe power and influence that are vouchsafed<br />\nthe editors and owners of the great weekly<br />\nand daily publications of to-day. Journalism, therefore, offers peculiar and unusual<br />\ninducements to the young man who is ambitious, has ideas, is observing and proficient<br />\nin the art of writing good, wholesome English. To such men, and there are many in<br />\nthe University, the series of articles that<br />\nwe purpose publishing, written from the<br />\nstandpoint of practical and successful newspaper men should prove of unusual value.<br />\nColonel Grasty's career is interesting in<br />\nthat, after graduating from Washington and<br />\nLee University, he studied law, and later<br />\nabandoned it, after several years of practice,<br />\nto go to work as a reporter on the \"Courier<br />\nJournal.\" Henry Watterson was then, as<br />\nhe is now, the editor, and under him Col.<br />\n<br />\nGrasty became familiar with the essential<br />\nand fundamental principles of newspaper<br />\nmaking. He rapidly rose from reporter to<br />\nstaff correspondent, which, from the viewpoint of many journalists, is the most desirable position a newspaper man can hold.<br />\nAfter resigning from the \"Courier Journal,\"<br />\nhe edited a number of the best known newspapers in the South and Middle West. Later,<br />\nhowever, he became identified with the<br />\n\"Manufacturers' Record,\" of which he is<br />\nnow vice-president and staff correspondent.<br />\nWith so broad and varied experience Col.<br />\nGrasty's comments on journalism are well<br />\nworthy of the careful consideration of those<br />\nof our students who plan to make journalism<br />\ntheir profession.<br />\nA most interesting exhibit, and one that<br />\nwill well repay an hour or so spent in studying it, is that of the complete set of drawings handed in by the architects who were<br />\nasked to submit drawings for the Homewood<br />\ncompetition. This exhibit is only part of<br />\nlarger exhibition of architectural drawings<br />\nwhich is being shown at the Peabody by the<br />\nBaltimore Architectural Society. 'rhe Homewood drawings are about twenty in number,<br />\nand occupy half of the west wall of the<br />\ngallery in which they are shown. The successful plan of the grounds, by Parker and<br />\nThomas, is hung in the 'centre, and at a<br />\nglance it is evident that, while the other<br />\nplans are good, there is no comparison between them and the one chosen by the Committee. There are a great many points of<br />\nsuperiority evident at once to any one. In<br />\nthe first place, the whole plan is better suited<br />\nto the conformtaion of the grounds. Most<br />\nof the other architects seemed to feel it<br />\nnecessary to arrange their buildings parallel<br />\nor at right angles to Charles Street, and the<br />\nadherence to this plan makes it difficult to<br />\ntake advantage of the character of the<br />\ngrounds. Another point in which the successful plans excel, is the graceful sweep of<br />\nthe main avenues, and the ease of access to<br />\nany part of the campus from the street or<br />\nfrom the various groups of buildings. The<br />\ngymnasium i excellently arranged, facing<br />\nin one direction the \"forest of dormitories,\"<br />\nas President Remsen ingeniously called them,<br />\nand on the other side opening out directly<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n- =1'<br />\n<br />\nupon the athletic field. The rectilinear ;1 rrangement of the buildings to which several<br />\nof the other competitors adhered, makes it<br />\nharder to get about from one building to<br />\nanother, and causes an unbeautiful arrangement of the buildings like city blocks, which<br />\ngives no opportunity for properly showing<br />\noff the separate structures. One point in<br />\nwhich the successful plans are far ahead of<br />\nthe others is in the location and planning<br />\nof the athletic field. On the one hand, it is,<br />\nas has been said, near the gymnasium, and<br />\non the other runs directly along Merryman's<br />\nLane, so that access to it is easy, and opportunity is given for the construction of a<br />\nsplendid monUmental entrance, which will<br />\nprobably be constructed at some future day<br />\nby the alumni of the University, or some of<br />\nits future classes. In so many ways are<br />\nthese plans the best, that it is not difficult<br />\nto see why they were chosen; the only thing<br />\nthat is hard to see is how the committee<br />\ncould have hesitated so long in their endeavor to choose correctly.<br />\nSome weeks ago an article was published<br />\nin one of the Baltimore dailies relative to<br />\nDr. Gilman 's resignation as President of the<br />\nCarnegie Institution. The \"Sun,\" the daily<br />\nthat published the story, at the time intimated that perhaps Dr. Gilman had<br />\nto resign. The following letter from Dr.<br />\nGilman to the Trustees of the Carnegie Institution is proof positive of the falseness<br />\nof the \"Sun's\" broad headline hint—a hint<br />\nbased on untruth and actuated apparently<br />\nby pure malice.<br />\nDecember 13, 1904.<br />\n\"To the Trustees of the Carnegie Institution;<br />\n\"Gentlemen:<br />\nAt your meeting on December 8, 1903,<br />\nI presented to you the following letter:<br />\nWhen I had the honor of being chosen<br />\nthe first President of the Carnegie Institution, I said to the Trustees that from the nature of the case my tenure of office must be<br />\nshort, for, having passed the age of seventy<br />\nyears, I was looking forward to a release<br />\nfrom serious official responsibilities.<br />\nThe<br />\nterm of five years was fixed in the By-laws,<br />\nand three of them will have passed at the<br />\n<br />\nnext annual meeting of the Board. It was<br />\nmy intention at that time to resign the office<br />\nof President, and this early notice is given<br />\nin order that the Trustees may be prepared<br />\nthen to take such action as may seem to<br />\nthem wise.'<br />\n\"In accordance with this intimation, I<br />\nnow resign the office of President of the<br />\nCarnegie Institution, and, as the title of the<br />\nchief executive may perhaps be changed, I<br />\nwill add that I am not a candidate for reappointment under any other designation.<br />\n\"In taking this step, I beg leave to assure<br />\nthe Board of my continued interest in the<br />\ndevelopment of this institution, according to<br />\nthe purposes of the founder; and I express<br />\nto the members of the Board, collectively and<br />\nindividually, my highest respect.<br />\n\"It has been an honor and a privilege to<br />\nbe so closely associated as I have been with<br />\nwith the organization and progress of an institution which bids fair to be a most potent<br />\nfactor in the advancement of science and in<br />\nthe encouragement of scientific men.<br />\nI'am, Gentlemen,<br />\nVery respectfully yours,<br />\nDANIEL C. GILMAN.\"<br />\n<br />\nThe NEws-LETTER proposes soon to open<br />\na new department—a Book Review Column.<br />\nThe editors believe the innovation will be a<br />\npopular one, and that it will meet with the<br />\napproval of all the readers of the paper. In<br />\na little world like that of the Johns Hopkins,<br />\nwhere books form the daily meat and drink<br />\nof all, it is a strange fact that the only student periodical has never seen fit to devote<br />\nsome space to a discussion of new publications. Connected with the University are<br />\nover 900 persons, each buying at least a<br />\nscore of books annually, and reading certainly ten times that number! Apparently there<br />\nis a field for our new column.<br />\n<br />\n\"How can you dress so expensively when<br />\nthe city is under siege on your account?\"<br />\ndemanded the daughter of Priam of Helen of<br />\nTroy fame.<br />\n\"Because I get all my gowns from Paris,\"<br />\ncoldly replied the cause of the trouble.<br />\n—Yale Record.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe Track Team of 1905.<br />\nSystematic training in track work has<br />\nnow begun at the University. Captain Hill,<br />\nof the track team, had his men out for the<br />\nfirst practice about three weeks ago, and<br />\npractice has continued regularly four times<br />\na week since then. As no games will be held<br />\nin the city for at least two months, the track<br />\nmen will not be subjected to any hard training as yet. Only such an amount of work<br />\nwill be given them as will keep them in good<br />\ncondition for beginning hard training in<br />\npreparation for any games that may be announced.<br />\nThere is much good track material in the<br />\nUniversity this year, and the prospects for<br />\na good season are very bright. Besides having most of last year's track squad back,<br />\nthere is some excellent material to be found<br />\namong the students who have just entered<br />\nthe University this fall.<br />\nAs a nucleus of last year's squad around<br />\nwhich we will build up a very fast team this<br />\nyear are: Captain Hill, who has made many<br />\nrecords in the short dashes, the running<br />\nbroad jump, and the hurdles; Glints, who<br />\nmade good on the relay team; Gilbert, Moreland and. Super in the quarter mile; Clarke,<br />\nGoodenow and Zimmerman in the half mile;<br />\nand Morse, Porter and Griffith in the mile<br />\nrun.<br />\nOf the new men who have just entered the<br />\nUniversity, the one who stands out most<br />\nprominently is, perhaps, Betts, in the first<br />\nyear at the Medical School. Betts comes<br />\nfrom Dickinson College.<br />\nWhile there he<br />\n<br />\nran on the relay team two years, and captained it one. Ile has often run against<br />\nHopkins, the last time being last spring in<br />\nPhiladelphia when the Dickinson team ran<br />\na close second to Hopkins. The Hopkins<br />\nauthorities are greatly elated over having<br />\nsuch an able man with them this year, and<br />\nfeel that he will be a great addition to the<br />\nteam. Other new men who have not reached<br />\nsuch a degree of prominence, yet who have<br />\nwon laurels in local meets are Perce, Stewart,<br />\nPadgett, Hunter and Cole. Of this number,<br />\nall are dash men with the exception of Cole,<br />\nwho has attained to sonic prominence in the<br />\n880 yard run.<br />\nWhat will give the most trouble in the<br />\ntrack line is the developing of a strong relay<br />\nteam. Of last year's team, only two remain<br />\n—Hill and Gunts ; and, as Hill wishes to<br />\nrun the short distances only, Glints is practically the only man left. This leaves three<br />\nplaces to be filled, but Captain I ill seems to<br />\nhave no doubt but what they can be satisfactorily supplied from the new students.<br />\nSo far, very little has been definitely determined upon in regard to \"meets.\" Besides the dual meet with Virginia, and the<br />\nAnnual Indoor Meet, held by the University,<br />\nnegotiations are on for holding dual meets.<br />\nwith the Naval Academy and Haverford College, respectively. Thus far, nothing definite has been heard from either institution.<br />\nThe chances are, however, that these meets<br />\nwill be held here, and if such be the case,<br />\nHopkins men will have the chance of witnessing a rare exhibition of track events.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nNOT YET FOUND.<br />\n<br />\nUNIVERSITY NOTES.<br />\n<br />\nThere was the usual response to the call<br />\nfor lacrosse candidates, made by Captain Dill<br />\nseveral weeks ago. The scrubs of last year<br />\nturned out promptly and were closely followed by men who have had some experience<br />\nin the prep. schools, or have had the virtue<br />\nof lacrosse pumped into them by some relative who has been fortunate enough to make<br />\nour team in the past. But here is where the<br />\ngood work stopped, and for some days it<br />\nseemed as if much good material, as has been<br />\nthe case in the past, would lie around idle<br />\nfor a season only to find fault with the older<br />\nmen for allowing them to waste a year before<br />\ntaking up the game.<br />\nI may say that with the aid of the older<br />\nplayers Captain Dill has managed to add<br />\nmost of the \"I-never-had-a-stick-in-my-handbefore\" men to his squad, and they are willing to try.<br />\nThe seven men that we need, to add to<br />\nthe five left from last year, so as to make<br />\nteam for the coming season, have not been<br />\nfound yet. If all the men \"stick to it\" we<br />\nshould come out all right, but at present the<br />\nmaterial is still very raw. The coaches have<br />\nso far only been putting the men through<br />\npreliminary work, but by the first of the year<br />\nthey hope to be able to get an idea of what<br />\nkind of a position each man is suitable for.<br />\nIn the meantime every man trying to learn<br />\nthe game can do no better than to utilize<br />\nall of his spare time in improving his stickwork. The writer has yet to see a good<br />\nlacrosse player who did not work. \"Practice makes perfect.\"<br />\nWm. C. ScHmh,issita.<br />\n<br />\nJohn E. Semmes has written a paper concerning the Law ofSales which is to be used<br />\nby the Junior class of the University of<br />\nMaryland Law School.<br />\n<br />\nIle loved his Dinah dearly,<br />\nAnd he sighed to her one night,<br />\n\"Dinah, could you love me?''<br />\nAnd she whispered, \"Dinah might.\"<br />\nThey were married in the autumn;<br />\nWhen she blows him up at night,<br />\nHe realizes what she meant,<br />\nWhen she whispered, \"Dynamite.\"<br />\n—Exchange.<br />\n<br />\nThe marriage is announced of Miss Helen<br />\nStowe, to Dr. Clement A. Penrose, of the<br />\nmedical staff of the University.<br />\nMr. Blanchard Randall and Mr. Robert<br />\nK. Waring have been elected members of<br />\nthe board of trustees of the Hospital, to fill<br />\nvacancies caused by death. There are still<br />\ntwo vacancies in the board—one caused by<br />\nthe resignation of Mr. James L. McLane, and<br />\nthe other by the death of Mr. Francis White.<br />\nThese places will probably be filled at the<br />\nnext meeting of the board.<br />\nA meeting of the Maryland Tuberculosis<br />\nCommission was held in McCoy Hall on Dec.<br />\n14. Dr. Osier presided at the meeting and<br />\ndelivered a short address. Several other<br />\naddresses were made, and the methods of the<br />\nCommission were reviewed.<br />\nDr. Charles F. Lummis lectured in McCoy<br />\nHall on Tuesday afternoon on \"Primitive<br />\nMusic of the Southwest.\" The lecture was<br />\naccompanied by a phonographic rendering<br />\nof Indian and old Spanish songs. The lecture was held under the auspices of the Baltimore Society of the Archaeological Institute of America.<br />\n<br />\nALUMNI NOTES.<br />\n'03 J. B. Gregg Custis is a scholarship<br />\nman at the New York Law School this year.<br />\n'03 William S. Bird has accepted a position on the \"Review of Reviews\" (New<br />\nYork). Ile will be home during the Christmas holidays.<br />\n'05 John J. Kinnane has applied for a<br />\ndegree at the University of Chicago.<br />\n'97 C. K. Edmunds is Professor of Chemistry in the Christian College at Canton,<br />\nChina.<br />\n'81 Co]. David T. Gray of Washington<br />\nhas been appointed MinT7rommissioner for<br />\nthe Lewis and Clark Exposition. Col. Gray<br />\ngraduated at the University in '81 and afterward took a post-graduate course, and obtained his Ph. D. in 1884,<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\n=_7<br />\n<br />\nCHRISTMAS TRIP OF THE MUSICAL<br />\nCLUBS.<br />\nThe Musical Clubs will not go to the Eastern Shore this Christmas, as they have done<br />\nfor the last two years. The people of the<br />\nEastern Shore town are very good patrons<br />\nof concerts, and the last two trips have been<br />\ngreatly enjoyed by those who were fortunate<br />\nenough to be taken on them: But \"variety<br />\nis the spice of life,\" and this year Manager<br />\nGriswold has decided to take the clubs to<br />\nsome of the small towns of Maryland and<br />\nWest Virginia. The men will. leave Baltimore early in the morning of December 27,<br />\nand will give concerts at Charlestown, Winchester, Hagerstown, and Frederick.<br />\nThe Glee Club is unusually strong this<br />\nyear and several good new songs will be<br />\nsung. Among them will be \"The Frankelyn's Dogge Leped over a Style,\" and a new<br />\nmedley of old Southern airs. Several of the<br />\nsongs of last year will also be on the programme or will be saved for encores. Of<br />\nthese, perhaps \"Jenks's Vegetable Compound\" and \"Jemima's Piano,\" will be most<br />\nenjoyed. The Mandolin Club is also excellent this year, and a good repertoire will be<br />\nready for the trip, including a medley of<br />\nthe latest music, arranged by the leader.<br />\nThe Banjo Club is somewhat weak in numbers, but the men are working hard, and<br />\nmuch improvement has been shown in the<br />\nway the pieces are handled. A medley from<br />\n\"Red Feather,\" arranged by V. Edgeworth<br />\nSmith, '98, will probably be the Club's most<br />\npopular selection.<br />\nA vocal quartette has been formed<br />\nof Houghton, Plaggemeyer, Holmes and<br />\nRuth, which is certainly one of the best that<br />\nhas ever represented the University. It is<br />\nlikely also that there will be a string sextette. Houghton, who added so much to<br />\nthe success of the trips last year, will sing<br />\nseveral solos, one of which will be accompanied by the Mandolin Club. Bristol,<br />\nunfortunately, will not be able to take the<br />\ntrip, and his solos will be greatly missed.<br />\nBut, on the whole, the trip bids to be one of<br />\nthe most successful that the Musical Clubs<br />\nhave ever experienced.<br />\nWinsome—Did you ever hear a tramp jest?<br />\nLonesome—No, but I've heard a bum joke.<br />\n—Punch Bowl.<br />\n<br />\nMINOR LATIN.<br />\nGreat Hannibal was crossing,<br />\nThe Alps all white with snow,<br />\nThe path was growing difficult,<br />\nThe progress was full slow;<br />\n(This tale is told by Livy,<br />\nWho wrote way long ago.)<br />\nSteep, more steep, and steeper,<br />\nThe narrow pathway grew,<br />\nTill finally some towering rocks,<br />\nBurst straightway into view;<br />\n(And here the army halted,<br />\nJust wondering what to do.)<br />\nThe problem was not easy,<br />\nBut someone bright did say,<br />\nPour on the rocks some vinegar,<br />\nAnd they will melt away;<br />\n(And thus th' affair was ended,<br />\nWithout the least delay.)<br />\nAnd now in reading Livy,<br />\nThe best way is to do,<br />\nJust like that old barbarian,<br />\nWhen problems came in view;<br />\n(And read this very surely:<br />\nPerhaps it's meant for you.)<br />\nDon't try to ride on ponies,<br />\nO'er rocky pathways sore,<br />\nFor you will get thrown off and strike<br />\nThat rugged figure 4;<br />\nBut take your books and o'er it,<br />\nJust pore and pore and pore!<br />\n<br />\nTHAT LITTLE HAND.<br />\nLast night I held a little hand<br />\nSo dainty and so neat,<br />\nI thought my heart would surely break<br />\nSo wildly did it beat.<br />\nNo other hand unto my soul<br />\nCan greater solace bring<br />\nThan that one which I held last night—<br />\nFour aces and a king.<br />\n—Notre Dame Scholastic.<br />\n<br />\nA COLLEGE CONJUGATION.<br />\nJug.<br />\n<br />\nJag.<br />\nJugged.—Lampoon.<br />\n<br />\n\fLUNCH<br />\n<br />\nDOLLARS<br />\n(Y *MAS<br />\nBIRDMAN<br />\n4,IN G. INZST<br />\n<br />\nFREE<br />\n<br />\n\\E V<br />\n\\LIC or,<br />\n<br />\n_111101•14.0.....\"<br />\n,<br />\n<br />\n1-7 I,<br />\n<br />\n.17<br />\n<br />\nr-\"<br />\n10 1.<br />\n<br />\n-T1<br />\nti<br />\n<br />\n,k•<br />\n<br />\n- e THE. /44<br />\n<br />\nr-t<br />\n<br />\nA<br />\n<br />\nrER<br />\n<br />\nEDITOrtifkl..ROOMS•<br />\nlAbs..LET CF<br />\n<br />\n•<br />\n<br />\nEr'<br />\n<br />\n(r_<br />\n<br />\n,•<br />\n<br />\nWij<br />\n<br />\nkya-tar--c,\"<br />\n<br />\n(as<br />\nA<br />\n<br />\nRA:3<br />\n<br />\nA<br />\n<br />\no<br />\n<br />\n421<br />\n<br />\nsruo<br />\n<br />\n'<br />\nGORGON S\"<br />\nDur—T & GAR.gsw,-0<br />\nISY CLANSSES1057-07<br />\n—<br />\n<br />\n1PLFREE.<br />\n<br />\nr<br />\n<br />\n,,vre.?;:y oviii<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nCOLLEGE NOTES.<br />\nIt is probable that on the debating team<br />\nwhich will represent Swarthmore College<br />\nthis year against Pennsylvania will be a<br />\nyoung woman.<br />\n<br />\nThe telescope recently purchased in England by Harvard has been received at the<br />\nobservatory. The instrument weighs about<br />\nnineteen tons. The reflecting lens is six<br />\ninches thick, and weighs, with its cell, about<br />\nThe sophomore class at Harvard has shat- a ton. The focal length is 281/2 feet. This<br />\ntered all traditions by electing to the office gives an image upon a scale of six inches for<br />\nof president W. H. Keeling, of Sioux City, a degree. The telescope will be used prinIa., who is working his way through college. cipally for the observation of distant stars.<br />\nPresident Keeling is one of the large force<br />\nof student-waiters at Randall Hall. Class<br />\nWith the College of Pharmacy already acpresidencies at Harvard have hitherto always been filled by prominent society or quired and the donation for a school of jourfraternity men, or at least by men distin- nalism in hand, Columbia is or will soon be<br />\na university in all that the word implies.<br />\nguished in athletics.<br />\nThe corporation proper now includes the<br />\nStatistics of the Yale freshman class show College, the Schools of Applied Science, the<br />\nan average age of 18 years, 9 months and School of Architecture, the Law School, the<br />\n16 days, indicating probably not less than School of Political Science, the School of<br />\n22 years, 10 months at graduation. In 1863 Philosophy, the School of Pure Science and<br />\nthe average graduating age was 22 years, the College of Physicians and Surgeons.<br />\nTeachers' College and Barnard, although<br />\n6 months.<br />\nseparate corporations, are part of the uniThe treatment accorded freshmen at Ox- versity.<br />\nford is diametrically opposite to that accorded them in American institutions.<br />\nOver<br />\nThe official registration figures of the Unithere the upper classmen are expected to<br />\nvacate the best rooms at student boarding- versity of Pennsylvania show that the athouses so that freshmen can move in, and in tendance has increased 13 per cent, over last<br />\nevery way treat them as honored guests. year, and is now the largest the university<br />\nEach senior is expected to give a \"break- has ever known. So far 3,093 students have<br />\nfast\" in honor of the freshmen in his college. registered, an increase of 401.<br />\n<br />\n\f\fNiiiiiikwinkNpersk vow Now Now lesisk'weilk Wasik WOW Nook NOM<br />\n<br />\nLrmivirRT,<br />\nTill- C01_111,1:1<br />\n.<br />\n<br />\n•I<br />\n<br />\ncKillor<br />\n<br />\nI<br />\n<br />\nThere Is nothlrw like or ccival<br />\nIt) a 1...LJAMI1R-1 - Suit for stuic<br />\nor comfort.<br />\n<br />\nFownes Gloves<br />\n<br />\nLLMAALTT<br />\n<br />\nWILL BE WORN LONGER THIS<br />\n<br />\n19 W. SAIM-1-06A STPLET.<br />\n<br />\nSEASON<br />\n<br />\nwink Ntmeilek No\" Welelok `440014k VOW 111101, VOW \\GP% Neap,'weak/<br />\n<br />\nTHAN<br />\n<br />\nOTHERS, THAT<br />\n<br />\nIS, OTHER GLOVES<br />\n<br />\nBOOKBINDING<br />\nWe Bind Tastefully.<br />\n<br />\nBooks, Phamplets, Music, Etc.<br />\nSpecimens Submitted with Pleasure.<br />\n<br />\nRks/ZICK<br />\n609 N. EUTAW ST.,<br />\nTelephone, Mt. Vernon 3022.<br />\n<br />\n81816 BROS Qui'<br />\n13 West<br />\nLexington Si.<br />\n<br />\n0Z<br />\nPI rf12\"<br />\nla<br />\n<br />\nJohn S. Kerr<br />\nW. Pants Rolph<br />\n<br />\nC. & P. Phone<br />\n<br />\nKERR 86 ROLPH<br />\nRepenting Arthur Johnson & Co..<br />\nNew York City.<br />\n<br />\nSpot ting Goode<br />\n<br />\n818V813 aii1 Mecipies National NHL<br />\n<br />\nand<br />\n<br />\nAthlone Supplies<br />\n<br />\nLAw.<br />\nLECTURES<br />\n<br />\nBALTIMORE,. AID.<br />\n<br />\n•<br />\nJAMES CLARK, President.<br />\nPAUL A. SEEGER, Vice-President.<br />\nCHARLES S. MILLEB,Cashier.<br />\nEDWIN P. HAYDEN, Alnet Gash.<br />\n<br />\n304 PARK AVENUE,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nCapital,<br />\n$300,000.00<br />\nSurplus and undivided profits, — $495,000.00<br />\nSafe Deposit Vaults.<br />\nBoxes Rented.<br />\nCareful Attention to the Interests of Depositors.<br />\n.We Invite You to Open an Account with Us.<br />\n<br />\nt.M:<br />\nh ,P<br />\nnd<br />\n44+.*****•.*************40....**40......<br />\nBaltimore University,<br />\n<br />\nAddress J. V. KELLY, Sec.-Treas.<br />\n840 North Charles Street,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nFOR ADVERTISING RATES<br />\nII THIS PAPER,<br />\n<br />\n••••••••••••••••••••••••••••••••••••••<br />\n•<br />\n•<br />\n:<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\nAALANTE)<br />\n—ALUMNI TO INSERT TKEIR BUSINESS AND PROFESSIONAL CARDS<br />\n<br />\nADDRESS<br />\n<br />\nTUE<br />\nNEWS-LETTER,<br />\n<br />\n•<br />\n<br />\nJohns Hopkins University,<br />\n<br />\nIN THEiNEWS-LETTER.<br />\n<br />\n•<br />\n•<br />\n01141•••••••••••••••••••••••••••••••••••<br />\n<br />\nBALTIMORE.<br />\n<br />\n\f", "format": "basic_html", "processed": "1<br /><br />\n.,,,,makinoomoomaeitsPiltrffle40,<br /><br />\n(/<br /><br />\nITIAINNIMMITIYMMItosI To; nis<br /><br />\nCR<br /><br />\nHENJOHNS•HOTKINS•UNIVERSITY<br />\nBALTIMORE<br /><br />\nThe News-Letter<br />\nVol. IX.<br /><br />\nDecember 23, 1904,<br /><br />\nE Christmas time,<br />\nEbe worlb lies beep beneath a covering fair<br />\nOf white, that Engels floating bown the shr<br />\ntap gentiv on its surface, colt, anb bare-festal garment, set with jewels rare<br />\nChat gleam ant) bla3e anb glisten ba33linglv;<br />\n\"E richer robe bib great Queen never wear<br />\nEt feast of Christmas time.<br />\nEt Christmas time,<br />\nEN highest feast the circling seasons bring,<br />\n1X1hen all manhinb rejoice in festal bress,<br />\nCo celebrate the Iiirthbav of their ting,<br />\ntet nature be the one createb thing<br />\nCo lie 'nail) Heaven colb anb comfortless,<br />\nO'er her a tiashino robe the Engels fling,<br />\nChe now of Christmas time.<br /><br />\nNo. 5<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nJournalism as a Profession.<br />\nThere are so many kinds of newspaper<br />\nwork and so many classes of publications,<br />\nthat any general discussion of this subject<br />\nis impossible in the limited space allowed.<br />\nLeaving out, however, all kinds and classes<br />\nof papers save those of commanding influence and power for good, the field is one in<br />\nwhich what may be called \"the personal<br />\nequation\" will tell the story of success or<br />\nfailure. And so, if a young man, looking<br />\nabout for a life vocation, should ask me to<br />\nadvise him whether or not to adopt journalism as a profession, I should first want to<br />\nknow that young man better than one father<br />\nin a thousand knows his favorite son. I<br />\nshould want to measure his capacity and<br />\ncharacter and test the metal of his ambition.<br />\nThere is room for usefulness all the way up<br />\nfrom the bottom, but for a man of real ability and ambition the only places in journalism worth having are at the top or very<br />\nnear the top. These he can never attain<br />\nunless endowed by nature with certain peculiar gifts. What Horace said of the poet<br />\nis true of the journalist.<br />\nIt is safe to say that on few other practical questions is the popular idea concerning the requisites for success more vague.<br />\nNine men out of ten, even among the more<br />\nintelligent, are under the impression that<br />\nthe mere ability to write good English is<br />\nthe main, if not the only, qualification required for successful newspaper work. As<br />\na matter of fact, my observation leads me<br />\nto believe that mere ability to write well<br />\nis a minor factor in counting up the qualifications for success in this line of work.<br />\nThe main thing is to know what to write<br />\nabout—in other words, to know what constitutes news, what the public really wants<br />\nto read and be advised about. Some of the<br />\nmost successful men at the top seldom write<br />\na line. They tell the men at .the bottom<br />\nwhat to say.<br />\nAnother factor in journalistic success of<br />\nscarce less importance than to know what<br />\nis news and what to discuss, may be expressed in the single word—character. Love of<br /><br />\ntruth for truth's sake is indispensable to<br />\ncommanding influence in this field of human<br />\nendeavor. There are hundreds of men with<br />\nthe gift of knowing how to write and even<br />\nof what to write about, and who at the same<br />\ntime may be real lovers of truth, who can<br />\nnever reach the top. For your truly great<br />\neditor, or manager—or whatever the man<br />\nwho really controls, directs and inspires a<br />\nnewspaper may choose to call himself—will<br />\nbe found to be intensely patriotic and in full<br />\nsympathy with his brother man. Indeed, I<br />\nmake bold to declare that no enduring success was ever made in the upbuilding of<br />\nany newspaper or periodical if its real head<br />\nlacked either patriotism or philanthropy.<br />\nThe motto of all permanently great publications is \"The greatest good to the greatest<br />\nnumber;'' and is lined up to \"without variableness or shadow of turning.\" The public<br />\ndoes not obey the golden rule to the extent<br />\nof doing good for evil. If you prove its<br />\nfriend, it will be yours. If you are indifferent to its welfare, it is deaf, dumb and blind<br />\nto your interests. If you slap it in the face<br />\nit will turn upon you and destroy you.<br />\nAnother desideratum is sense of proportion; a knowledge of relativity. The public is always the final judge of what it<br />\nwants. To know what the public wants to<br />\nread and be advised about is a condition<br />\nprecedent to a knowledge of the relative<br />\nvalue of news and of the relative importance<br />\nof subjects for editorial discussion. Lack<br />\nof this single requisite has kept many a<br />\nbright and capable man in a subordinate<br />\nThe tyro generally<br />\nposition all his life.<br />\ngives the greatest prominence to items and<br />\nsubjects which appeal to him, and it generally happens that these are the things in<br />\nwhcih the public is least concerned. \"The<br />\nproper study of mankind is man\" applies<br />\nto journalism as to other callings. To keep<br />\nin touch with public sentiment it is necessary to study. man collectively.<br />\nThat the requisites for success in journalism are peculiar and generally little comprehended is attested by the fact that so<br /><br />\nTHE NEWS-LETTER.<br />\nmany men of real capacity try it and fail.<br />\nIt is not perhaps too much to say that there<br />\nis a larger percentage of men who after failing in journalism succeed in other lines than<br />\nof those who redeem early failure in any<br />\nother calling.<br />\nThe successful journalist must not only<br />\nknow the truth, love the truth, know what<br />\nis worth while and what is not, have at heart<br />\nthe public welfare, be imbued with a discerning sense of proportion and relativity,<br />\nbut he must be progressive, or all these<br />\nqualities will count for naught. He who<br />\nsucceeds in any line must be alert and wide<br />\nawake to changing conditions. Every hour<br />\nchanges the relations of people and things<br />\nTies are sundered,<br />\ntoward one another.<br />\nsympathies are transferred, the old are passing and the new are edging in. The newspaper man, more than all others, is required<br />\nto keep in closest touch with ever changing<br />\nconditions, to keep familiar with the kaleidoscopic complexities of modern civilization.<br />\nThe true journalist must be able to discern<br />\nthe signs of the times as they relate to every<br />\nform of human endeavor. He must be the<br />\nseer and the prophet, the interpreter and<br />\nthe orator, the teacher, the preacher. All<br />\nthis, of course, if he aims at the highest<br />\nmeasure of success.<br />\nThere are, however, found in newspaper<br />\noffices all over the land men who esteem it<br />\nto their credit if they have for a number of<br />\nyears filled the same position on the same<br />\npaper, as, for instance, a police reporter or<br />\na \"sporting editor,\" who has become a<br />\nlocal authority in his specialty. Indeed, I<br />\nhave known various successful \"political<br />\neditors\" who did not even attempt to write<br />\ntheir own stories but who were news gatherers of such marvellous energy and success<br />\nthat they were regarded as invaluable members of the staff. But these are subordinate<br />\nmembers of the profession.<br />\nI am considering this question only from<br />\nthe standpoint of a college-bred man who is<br />\nlooking about for a career in life which seems<br />\nto him worthy of a high ambition—an ambition which nothing but the highest achievement will satisfy. To such a young man I<br />\nshould say it is worth while to find out<br />\nwhether you are endowed with the journalistic instinct. This can be done only by<br />\ntrying. Begin at the bottom. \"Get a job\"<br />\nas a reporter. Don't for a moment harbor<br /><br />\n3<br /><br />\nthe thought that you know a little bit about<br />\nthe work. Do what you are told to do as<br />\nif your life depended on it. If it be in you<br />\nto succeed you will be discovered and invited<br />\nto step up higher. But don't expect premature appreciation, for if you do your certain disappointment will be painful and perhaps discouraging.<br />\nIt goes without saying that the career of<br />\na journalist is extremely attractive to the<br />\nman of capacity, equipment and high resolve.<br />\nFew positions in our national life are more<br />\nto be desired than those which have been<br />\nheld by a Greeley or a Dana or those that<br />\nare now held by such men as Henry Watterson or Richard H. Edmonds—types of men<br />\nwho, though in widely different fields, are<br />\nprofoundly impressing the thought of to-day<br />\nand exerting a powerful influence for good,<br />\nas they see it, on the public mind,<br />\nIn the changing conditions in journalism<br />\nas in every other line of endeavor, it may not<br />\nbe possible for a Greeley, a Dana or a Watterson or an Edmonds to soon appear again<br />\nin the journalistic field, but it is inconceivable that men of keen perceptions, broad<br />\nsympathy and high ideality, if intensely in<br />\nearnest can fail of achieving a certain measure of success, and I really believe there<br />\nnever has been a greater demand for ability<br />\nof the highest order nor a time when faithfulness, patriotism and righteousness were<br />\nmore needed in journalism than at the present time, and I believe the rewards will be<br />\nas great and as satisfying as they ever have<br />\nbeen, even if they may not come in exactly<br />\nthe same way. The young man who chooses<br />\njournalism as his career may therefore have<br />\nno fear that the field of his endeavors or the<br />\nrange of his achievements will be small, if<br />\nhis mind is on his work and his whole heart<br />\nin it. If he have quick apprehension (instinctively and acquired), if he have broad<br />\nsympathies and high ideals, he should be<br />\nable to organize himself into an efficient journalistic force, though he may never quite<br />\nreach the top. With these qualifications he<br />\nwill be able to write in a manner that the<br />\npublic will appreciate and understand; he<br />\nwill be able to treat of the subjects in which<br />\nthey are interested, and will be able to command their confidence and respect; because<br />\nof the loyalty and devotion to humanity<br />\nwhich are his.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nA Bunch of Blue Violets.<br />\nThey sat in the farthest corner of the spacious parlor, out of the glare of the brilliant<br />\nchandelier. In manly tones, he poured forth<br />\nburning words in her ear. She bent her<br />\ngraceful head, and nervously twirled the<br />\nlittle bunch of blue violets he had brought<br />\nher.<br />\nBut at last she stopped him.<br />\n'Harry,\" she said firmly, \"it cannot be.<br />\nYou know how bitterly father opposes it, and<br />\nI must consider his will in the matter. And<br />\nthen, too,\" she added, while her bright eyes<br />\nfilled with tears, \"since mother is gone, there<br />\nis no one to take care of him but me, and<br />\nI cannot desert him now.\"<br />\nOn hearing this, Henry Underwood's heart<br />\nsmote him at the thought that he could wish<br />\nto tear this noble girl away from where duty<br />\ncalled her. He wondered how he could find<br />\nit in him to press her further; though her<br />\ndevotion to her gruff old father, raised his<br />\nadmiration of her, if possible, still higher.<br />\n\"Edith,\" he said, as he finally rose to depart, \"I can wait. May I also hope?\"<br />\nEdith Upton. stood in the broad doorway,<br />\nher tall shapely figure revealed against the<br />\nbackground of the lighted hall. She did not<br />\nanswer his question, for, at that moment, a<br />\nstout old gentleman, leaning heavily on a<br />\ncane, came hobbling up the steps. Henry<br />\ninstantly recognized him as Mr. Upton, and,<br />\nwith a word of greeting, was about to pass<br />\nout. But the old man blocked his way.<br />\n\"Young man, whoever you are,\" he<br />\ngrowled, pretending not to know him,\"your<br />\nvisits here are not welcome.\"<br />\nUnderwood was about to make some<br />\nhaughty reply, but Edith was too quick for<br />\nhim.<br />\n\"Father,\" she said imperatively, catching<br />\nhim by the arm, \"you must not stand here<br />\nin the night air. Come inside.\"<br />\nThe old man was strangely pliant in her<br />\nhands, and soon Underwood saw her pull<br />\nhim inside and shut the door, not, however,<br />\nwithout giving him a parting look, as he<br />\nwent slowly down the steps.<br />\nIt was with a heavy tread that young<br />\nUnderwood walked home that night. His<br />\naffair of the heart had come to a head, and he<br /><br />\nhad not won. Yet something told him that,<br />\nwere she free to choose, she would not utterly refuse him. But there was the insuperable obstacle of the purse-proud old man,<br />\nwho could not endure that a young man of<br />\nsuch limited expectations should pay attention to his daughter.<br />\nUnderwood slept but little that night. Ile<br />\nwas dimly conscious of heavy wagons that<br />\nrumbled by at intervals, and of bells ringing; but they made little impression on him,<br />\nfor his thoughts were otherwise occupied.<br />\nHe arose early and started down town to<br />\nhis work. As he went down the steps, he<br />\nnoticed a tangled roll of hose lying in the<br />\ngutter. He now remembered the rumblings<br />\nduring the night.<br />\n\"It has probably dropped from a passing<br />\ntruck,\" he thought, as he opened a basement<br />\nwindow and dropped it in, intending to notify the Fire Department.<br />\nWithout thinking further of it, he made<br />\nhis way down town. Accustomed always to<br />\nwalk, he did not notice that the cars were not<br />\nrunning. As lie began to approach the down<br />\ntown district, he was awakened from his<br />\nreverie by a distant roar, like the sound of<br />\na thousand voices. Looking up, he noticed<br />\nfor the first time a huge volume of smoke<br />\nthat spouted up into the sky as if from a<br />\nvolcano. Quickening his pace, he rapidly<br />\napproached the scene of the fire. As he<br />\nrounded a corner, a terrifying sight met his<br />\neye. Blocks of smoking ruins stretched before him, and the flames were leaping out<br />\ntowards buildings yet unconsumed. A large<br />\ncrowd stood and silently watched the irresistible march of the flames. Soon Underwood found himself in front of a large bank<br />\nbuilding. At first, on account of the changed<br />\nsurroundings, he did not recognize it. But<br />\npresently he was able to make out through<br />\nthe smoke, the inscription over the entrance:<br />\n\"The Upton National Bank.\"<br />\nHis heart gave a great leap. The flames<br />\nwere eating towards it, and, in all human<br />\nprobability, the bulk of old Mr. Upton's pos•<br />\nsessions would go up in smoke, and—he<br />\nhardly dared think it—Edith would be within his reach.<br /><br />\nTHE NEWS-LETTER.<br />\nAt that moment, an old man pushed his<br />\nway rapidly through the crowd, and came<br />\nrunning up to the bank building as fast as<br />\nthe gout would allow. He seemed to be almost besied himself. He ran frantically up<br />\nand down, and shouted hoarsely at everybody and everything.<br />\nA fire engine. was slowly passing.<br />\n\"Stop!\" cried the old man to the firemen.<br />\n\"Turn some water on this building.\"<br />\nThe engine did not stop.<br />\nWe have no hose,\" said one of the lireme\".<br />\nThe old man seemed almost in despair.<br />\nThere stood a plug just across the street,<br />\nbut the lack of a little hose seemed destined<br />\nto ruin him. The old Mtn seemed stunned.<br />\nIle stood still, and, though it was the month<br />\nof February, wiped the perspiration from his<br />\nbrow. Suddenly an -idea came to him.<br />\n\"One thousand dollars!\" he cried, \"to<br />\nanyone who will furnish enough hose to save<br />\nthe bank.\"<br />\n. The crowd seemed motionless, but already<br />\na young man had slipped away unnoticed.<br />\nLI a short time he returned, driving madly<br />\ndown the street in a ricketty wagon. Up<br />\nhe came pell-mell to the bank, sprang out,<br />\nand began to pull hose out of the rear end of<br />\nthe wagon. Willing hands attached it to<br />\nthe plug, and then the young nian and the<br />\nstout old gentleman together took hold of<br />\nthe nozzle, and sent a stream of water high<br />\ninto the air. The water played over the roof<br />\nand sides until the building was thoroughly<br />\ndrenched. Meanwhile, the fire had eaten up<br />\nthe adjoining building, and was now ready<br />\nto devour the bank; but against soaked walls<br />\nand dripping roof it could make no headway.<br />\nIt changed its course, passed on to the rear,<br />\nand left the bank the only building standing in the block.<br />\nWith a sigh of relief the old man let go<br />\nthe nozzle, and turned to his companion. The<br />\nYoung man's hat was gone, his clothes were<br />\ntorn, and his face was grimy with smoke and<br />\nwater splashes. But in spite of that, the old<br />\nThall recognized him for the first time as his<br />\ndaughter's suitoi'.<br />\n\"Sir,\" he said haughtily, \"come with me,<br />\nthat I may discharge the debt I owe you.\"<br />\nSo saying, he turned, unlocked the door<br />\nof the bank, and stepped inside. The interior was intact. He advanced to the office.<br /><br />\n5<br /><br />\nAs he did so, he looked behind him. To his<br />\nsurprise, the young man had disappeared.<br />\nFor two days after the fire, Underwood<br />\nconfined himself to his room. He felt that,<br />\nfor the present, he could not seen Edith. On<br />\nthe third day, a note was brought up to him.<br />\nIt ran thus:<br />\n\"Sir:<br />\nI would,fain attempt such an impossible<br />\ntask as that of discharging my indebtedness<br />\nto you. If possible, kindly meet me at my<br />\nhome this evening at eight o'clock.<br />\n(Signed) J. T. Upton.\"<br />\n\"A plague upon your money,\" grumbled<br />\nUnderwood, as he read the note.<br />\nBut, in spite of himself, something carried<br />\nhim towards the Upton home that evening,<br />\nand, almost without knowing it, he rang the<br />\nbell promptly at the hour named. The door<br />\nwas immediately opened by the old gentleman himself, who had his hat on and carried<br />\nhis cane in his hand.<br />\n\"Hub,\" growled the old man, in his usual<br />\ngruff manner, appearing not to recognize<br />\nhim.<br />\nUnderwood muttered something about the<br />\n\"wrong house,\" and was about to beat a<br />\nretreat. But the old gentleman's manner<br />\nquickly (hanged.<br />\n\"My dear Underwood,\" he said, in the<br />\nmost cordial tones the young man had ever<br />\nheard him use. \"I am delighted to see you.<br />\nI cannot express my gratitude for your services. It is hardly necessary to say that no<br />\npecuniary reward can possibly liquidate the<br />\nobligation.''<br />\n\"I neither expect nor deserve such a reward,\" replied the young man modestly.<br />\n\"We will have to settle it the best we<br />\nran,\" said the old man abstractedly, and<br />\nthen continued, \"I regret that an engagement will prevent me from conferring further with you at present, but maybe Edith<br />\nwill take my place.\" The old man chuckled<br />\na little to himself. \"P'r'aps that will suit<br />\nyou as well,\" he added, with a twinkle in<br />\nhis eye as he passed on down the steps.<br />\nThen, for the first time, Underwood saw<br />\nEdith standing in the hall, waiting to meet<br />\nhim. She was dressed simply in pure white,<br />\nand on her bosom she wore, still in the freshness of its beauty, the little bunch of blue<br />\nviolets.<br />\nJ. M. M., '06.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nthe ilewsaetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nDECEMBER 28, 1904.<br /><br />\nSubscription $1.50 per year.<br /><br />\n10 Cents a single copy.<br /><br />\nTHOMAS OWINGS,<br />\nORMOND W. HAMMOND,<br />\nH. FINDLAY FRENCH,<br />\n... THOMAS G. MACHEN,<br /><br />\n1905.<br />\n1906.<br />\n1906.<br />\n1906.<br /><br />\nW. R. STRAUGHN,<br />\n{ E. LELAND SHACICELP'ORD,<br />\nBusiness Manager,<br />\n0. WOLTERECK,<br />\nAssistant Business Manager,<br />\nCARLYLE BARTON,<br /><br />\n1905.<br />\n1906.<br />\n1905.<br />\n1906<br /><br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors<br />\nAthletic Editors,<br /><br />\nAddress all articles, communications, etc., to THOMAS<br />\nOWINGS, box 467, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nG. WOLTERECK, box 677, J. H. U.<br /><br />\nED I TORIAL.<br />\nThe first of a series of articles to be written for the Ntw:;-LErrim on \"Journalism as<br />\na Profession\" is contributed this week by<br />\nColonel Thomas P. Grasty. The author is<br />\none of the leaders in the profession, and his<br />\nobservations upon writing for and conducting a newspaper should prove an inspiration<br />\nto those who are considering journalism as<br />\nthe best and most congenial way of winning<br />\na reputation and earning a livelihood. There<br />\nis scarcely a calling in which a man exercises<br />\nthe power and influence that are vouchsafed<br />\nthe editors and owners of the great weekly<br />\nand daily publications of to-day. Journalism, therefore, offers peculiar and unusual<br />\ninducements to the young man who is ambitious, has ideas, is observing and proficient<br />\nin the art of writing good, wholesome English. To such men, and there are many in<br />\nthe University, the series of articles that<br />\nwe purpose publishing, written from the<br />\nstandpoint of practical and successful newspaper men should prove of unusual value.<br />\nColonel Grasty's career is interesting in<br />\nthat, after graduating from Washington and<br />\nLee University, he studied law, and later<br />\nabandoned it, after several years of practice,<br />\nto go to work as a reporter on the \"Courier<br />\nJournal.\" Henry Watterson was then, as<br />\nhe is now, the editor, and under him Col.<br /><br />\nGrasty became familiar with the essential<br />\nand fundamental principles of newspaper<br />\nmaking. He rapidly rose from reporter to<br />\nstaff correspondent, which, from the viewpoint of many journalists, is the most desirable position a newspaper man can hold.<br />\nAfter resigning from the \"Courier Journal,\"<br />\nhe edited a number of the best known newspapers in the South and Middle West. Later,<br />\nhowever, he became identified with the<br />\n\"Manufacturers' Record,\" of which he is<br />\nnow vice-president and staff correspondent.<br />\nWith so broad and varied experience Col.<br />\nGrasty's comments on journalism are well<br />\nworthy of the careful consideration of those<br />\nof our students who plan to make journalism<br />\ntheir profession.<br />\nA most interesting exhibit, and one that<br />\nwill well repay an hour or so spent in studying it, is that of the complete set of drawings handed in by the architects who were<br />\nasked to submit drawings for the Homewood<br />\ncompetition. This exhibit is only part of<br />\nlarger exhibition of architectural drawings<br />\nwhich is being shown at the Peabody by the<br />\nBaltimore Architectural Society. 'rhe Homewood drawings are about twenty in number,<br />\nand occupy half of the west wall of the<br />\ngallery in which they are shown. The successful plan of the grounds, by Parker and<br />\nThomas, is hung in the 'centre, and at a<br />\nglance it is evident that, while the other<br />\nplans are good, there is no comparison between them and the one chosen by the Committee. There are a great many points of<br />\nsuperiority evident at once to any one. In<br />\nthe first place, the whole plan is better suited<br />\nto the conformtaion of the grounds. Most<br />\nof the other architects seemed to feel it<br />\nnecessary to arrange their buildings parallel<br />\nor at right angles to Charles Street, and the<br />\nadherence to this plan makes it difficult to<br />\ntake advantage of the character of the<br />\ngrounds. Another point in which the successful plans excel, is the graceful sweep of<br />\nthe main avenues, and the ease of access to<br />\nany part of the campus from the street or<br />\nfrom the various groups of buildings. The<br />\ngymnasium i excellently arranged, facing<br />\nin one direction the \"forest of dormitories,\"<br />\nas President Remsen ingeniously called them,<br />\nand on the other side opening out directly<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br />\n- =1'<br /><br />\nupon the athletic field. The rectilinear ;1 rrangement of the buildings to which several<br />\nof the other competitors adhered, makes it<br />\nharder to get about from one building to<br />\nanother, and causes an unbeautiful arrangement of the buildings like city blocks, which<br />\ngives no opportunity for properly showing<br />\noff the separate structures. One point in<br />\nwhich the successful plans are far ahead of<br />\nthe others is in the location and planning<br />\nof the athletic field. On the one hand, it is,<br />\nas has been said, near the gymnasium, and<br />\non the other runs directly along Merryman's<br />\nLane, so that access to it is easy, and opportunity is given for the construction of a<br />\nsplendid monUmental entrance, which will<br />\nprobably be constructed at some future day<br />\nby the alumni of the University, or some of<br />\nits future classes. In so many ways are<br />\nthese plans the best, that it is not difficult<br />\nto see why they were chosen; the only thing<br />\nthat is hard to see is how the committee<br />\ncould have hesitated so long in their endeavor to choose correctly.<br />\nSome weeks ago an article was published<br />\nin one of the Baltimore dailies relative to<br />\nDr. Gilman 's resignation as President of the<br />\nCarnegie Institution. The \"Sun,\" the daily<br />\nthat published the story, at the time intimated that perhaps Dr. Gilman had<br />\nto resign. The following letter from Dr.<br />\nGilman to the Trustees of the Carnegie Institution is proof positive of the falseness<br />\nof the \"Sun's\" broad headline hint—a hint<br />\nbased on untruth and actuated apparently<br />\nby pure malice.<br />\nDecember 13, 1904.<br />\n\"To the Trustees of the Carnegie Institution;<br />\n\"Gentlemen:<br />\nAt your meeting on December 8, 1903,<br />\nI presented to you the following letter:<br />\nWhen I had the honor of being chosen<br />\nthe first President of the Carnegie Institution, I said to the Trustees that from the nature of the case my tenure of office must be<br />\nshort, for, having passed the age of seventy<br />\nyears, I was looking forward to a release<br />\nfrom serious official responsibilities.<br />\nThe<br />\nterm of five years was fixed in the By-laws,<br />\nand three of them will have passed at the<br /><br />\nnext annual meeting of the Board. It was<br />\nmy intention at that time to resign the office<br />\nof President, and this early notice is given<br />\nin order that the Trustees may be prepared<br />\nthen to take such action as may seem to<br />\nthem wise.'<br />\n\"In accordance with this intimation, I<br />\nnow resign the office of President of the<br />\nCarnegie Institution, and, as the title of the<br />\nchief executive may perhaps be changed, I<br />\nwill add that I am not a candidate for reappointment under any other designation.<br />\n\"In taking this step, I beg leave to assure<br />\nthe Board of my continued interest in the<br />\ndevelopment of this institution, according to<br />\nthe purposes of the founder; and I express<br />\nto the members of the Board, collectively and<br />\nindividually, my highest respect.<br />\n\"It has been an honor and a privilege to<br />\nbe so closely associated as I have been with<br />\nwith the organization and progress of an institution which bids fair to be a most potent<br />\nfactor in the advancement of science and in<br />\nthe encouragement of scientific men.<br />\nI'am, Gentlemen,<br />\nVery respectfully yours,<br />\nDANIEL C. GILMAN.\"<br /><br />\nThe NEws-LETTER proposes soon to open<br />\na new department—a Book Review Column.<br />\nThe editors believe the innovation will be a<br />\npopular one, and that it will meet with the<br />\napproval of all the readers of the paper. In<br />\na little world like that of the Johns Hopkins,<br />\nwhere books form the daily meat and drink<br />\nof all, it is a strange fact that the only student periodical has never seen fit to devote<br />\nsome space to a discussion of new publications. Connected with the University are<br />\nover 900 persons, each buying at least a<br />\nscore of books annually, and reading certainly ten times that number! Apparently there<br />\nis a field for our new column.<br /><br />\n\"How can you dress so expensively when<br />\nthe city is under siege on your account?\"<br />\ndemanded the daughter of Priam of Helen of<br />\nTroy fame.<br />\n\"Because I get all my gowns from Paris,\"<br />\ncoldly replied the cause of the trouble.<br />\n—Yale Record.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe Track Team of 1905.<br />\nSystematic training in track work has<br />\nnow begun at the University. Captain Hill,<br />\nof the track team, had his men out for the<br />\nfirst practice about three weeks ago, and<br />\npractice has continued regularly four times<br />\na week since then. As no games will be held<br />\nin the city for at least two months, the track<br />\nmen will not be subjected to any hard training as yet. Only such an amount of work<br />\nwill be given them as will keep them in good<br />\ncondition for beginning hard training in<br />\npreparation for any games that may be announced.<br />\nThere is much good track material in the<br />\nUniversity this year, and the prospects for<br />\na good season are very bright. Besides having most of last year's track squad back,<br />\nthere is some excellent material to be found<br />\namong the students who have just entered<br />\nthe University this fall.<br />\nAs a nucleus of last year's squad around<br />\nwhich we will build up a very fast team this<br />\nyear are: Captain Hill, who has made many<br />\nrecords in the short dashes, the running<br />\nbroad jump, and the hurdles; Glints, who<br />\nmade good on the relay team; Gilbert, Moreland and. Super in the quarter mile; Clarke,<br />\nGoodenow and Zimmerman in the half mile;<br />\nand Morse, Porter and Griffith in the mile<br />\nrun.<br />\nOf the new men who have just entered the<br />\nUniversity, the one who stands out most<br />\nprominently is, perhaps, Betts, in the first<br />\nyear at the Medical School. Betts comes<br />\nfrom Dickinson College.<br />\nWhile there he<br /><br />\nran on the relay team two years, and captained it one. Ile has often run against<br />\nHopkins, the last time being last spring in<br />\nPhiladelphia when the Dickinson team ran<br />\na close second to Hopkins. The Hopkins<br />\nauthorities are greatly elated over having<br />\nsuch an able man with them this year, and<br />\nfeel that he will be a great addition to the<br />\nteam. Other new men who have not reached<br />\nsuch a degree of prominence, yet who have<br />\nwon laurels in local meets are Perce, Stewart,<br />\nPadgett, Hunter and Cole. Of this number,<br />\nall are dash men with the exception of Cole,<br />\nwho has attained to sonic prominence in the<br />\n880 yard run.<br />\nWhat will give the most trouble in the<br />\ntrack line is the developing of a strong relay<br />\nteam. Of last year's team, only two remain<br />\n—Hill and Gunts ; and, as Hill wishes to<br />\nrun the short distances only, Glints is practically the only man left. This leaves three<br />\nplaces to be filled, but Captain I ill seems to<br />\nhave no doubt but what they can be satisfactorily supplied from the new students.<br />\nSo far, very little has been definitely determined upon in regard to \"meets.\" Besides the dual meet with Virginia, and the<br />\nAnnual Indoor Meet, held by the University,<br />\nnegotiations are on for holding dual meets.<br />\nwith the Naval Academy and Haverford College, respectively. Thus far, nothing definite has been heard from either institution.<br />\nThe chances are, however, that these meets<br />\nwill be held here, and if such be the case,<br />\nHopkins men will have the chance of witnessing a rare exhibition of track events.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nNOT YET FOUND.<br /><br />\nUNIVERSITY NOTES.<br /><br />\nThere was the usual response to the call<br />\nfor lacrosse candidates, made by Captain Dill<br />\nseveral weeks ago. The scrubs of last year<br />\nturned out promptly and were closely followed by men who have had some experience<br />\nin the prep. schools, or have had the virtue<br />\nof lacrosse pumped into them by some relative who has been fortunate enough to make<br />\nour team in the past. But here is where the<br />\ngood work stopped, and for some days it<br />\nseemed as if much good material, as has been<br />\nthe case in the past, would lie around idle<br />\nfor a season only to find fault with the older<br />\nmen for allowing them to waste a year before<br />\ntaking up the game.<br />\nI may say that with the aid of the older<br />\nplayers Captain Dill has managed to add<br />\nmost of the \"I-never-had-a-stick-in-my-handbefore\" men to his squad, and they are willing to try.<br />\nThe seven men that we need, to add to<br />\nthe five left from last year, so as to make<br />\nteam for the coming season, have not been<br />\nfound yet. If all the men \"stick to it\" we<br />\nshould come out all right, but at present the<br />\nmaterial is still very raw. The coaches have<br />\nso far only been putting the men through<br />\npreliminary work, but by the first of the year<br />\nthey hope to be able to get an idea of what<br />\nkind of a position each man is suitable for.<br />\nIn the meantime every man trying to learn<br />\nthe game can do no better than to utilize<br />\nall of his spare time in improving his stickwork. The writer has yet to see a good<br />\nlacrosse player who did not work. \"Practice makes perfect.\"<br />\nWm. C. ScHmh,issita.<br /><br />\nJohn E. Semmes has written a paper concerning the Law ofSales which is to be used<br />\nby the Junior class of the University of<br />\nMaryland Law School.<br /><br />\nIle loved his Dinah dearly,<br />\nAnd he sighed to her one night,<br />\n\"Dinah, could you love me?''<br />\nAnd she whispered, \"Dinah might.\"<br />\nThey were married in the autumn;<br />\nWhen she blows him up at night,<br />\nHe realizes what she meant,<br />\nWhen she whispered, \"Dynamite.\"<br />\n—Exchange.<br /><br />\nThe marriage is announced of Miss Helen<br />\nStowe, to Dr. Clement A. Penrose, of the<br />\nmedical staff of the University.<br />\nMr. Blanchard Randall and Mr. Robert<br />\nK. Waring have been elected members of<br />\nthe board of trustees of the Hospital, to fill<br />\nvacancies caused by death. There are still<br />\ntwo vacancies in the board—one caused by<br />\nthe resignation of Mr. James L. McLane, and<br />\nthe other by the death of Mr. Francis White.<br />\nThese places will probably be filled at the<br />\nnext meeting of the board.<br />\nA meeting of the Maryland Tuberculosis<br />\nCommission was held in McCoy Hall on Dec.<br />\n14. Dr. Osier presided at the meeting and<br />\ndelivered a short address. Several other<br />\naddresses were made, and the methods of the<br />\nCommission were reviewed.<br />\nDr. Charles F. Lummis lectured in McCoy<br />\nHall on Tuesday afternoon on \"Primitive<br />\nMusic of the Southwest.\" The lecture was<br />\naccompanied by a phonographic rendering<br />\nof Indian and old Spanish songs. The lecture was held under the auspices of the Baltimore Society of the Archaeological Institute of America.<br /><br />\nALUMNI NOTES.<br />\n'03 J. B. Gregg Custis is a scholarship<br />\nman at the New York Law School this year.<br />\n'03 William S. Bird has accepted a position on the \"Review of Reviews\" (New<br />\nYork). Ile will be home during the Christmas holidays.<br />\n'05 John J. Kinnane has applied for a<br />\ndegree at the University of Chicago.<br />\n'97 C. K. Edmunds is Professor of Chemistry in the Christian College at Canton,<br />\nChina.<br />\n'81 Co]. David T. Gray of Washington<br />\nhas been appointed MinT7rommissioner for<br />\nthe Lewis and Clark Exposition. Col. Gray<br />\ngraduated at the University in '81 and afterward took a post-graduate course, and obtained his Ph. D. in 1884,<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br />\n=_7<br /><br />\nCHRISTMAS TRIP OF THE MUSICAL<br />\nCLUBS.<br />\nThe Musical Clubs will not go to the Eastern Shore this Christmas, as they have done<br />\nfor the last two years. The people of the<br />\nEastern Shore town are very good patrons<br />\nof concerts, and the last two trips have been<br />\ngreatly enjoyed by those who were fortunate<br />\nenough to be taken on them: But \"variety<br />\nis the spice of life,\" and this year Manager<br />\nGriswold has decided to take the clubs to<br />\nsome of the small towns of Maryland and<br />\nWest Virginia. The men will. leave Baltimore early in the morning of December 27,<br />\nand will give concerts at Charlestown, Winchester, Hagerstown, and Frederick.<br />\nThe Glee Club is unusually strong this<br />\nyear and several good new songs will be<br />\nsung. Among them will be \"The Frankelyn's Dogge Leped over a Style,\" and a new<br />\nmedley of old Southern airs. Several of the<br />\nsongs of last year will also be on the programme or will be saved for encores. Of<br />\nthese, perhaps \"Jenks's Vegetable Compound\" and \"Jemima's Piano,\" will be most<br />\nenjoyed. The Mandolin Club is also excellent this year, and a good repertoire will be<br />\nready for the trip, including a medley of<br />\nthe latest music, arranged by the leader.<br />\nThe Banjo Club is somewhat weak in numbers, but the men are working hard, and<br />\nmuch improvement has been shown in the<br />\nway the pieces are handled. A medley from<br />\n\"Red Feather,\" arranged by V. Edgeworth<br />\nSmith, '98, will probably be the Club's most<br />\npopular selection.<br />\nA vocal quartette has been formed<br />\nof Houghton, Plaggemeyer, Holmes and<br />\nRuth, which is certainly one of the best that<br />\nhas ever represented the University. It is<br />\nlikely also that there will be a string sextette. Houghton, who added so much to<br />\nthe success of the trips last year, will sing<br />\nseveral solos, one of which will be accompanied by the Mandolin Club. Bristol,<br />\nunfortunately, will not be able to take the<br />\ntrip, and his solos will be greatly missed.<br />\nBut, on the whole, the trip bids to be one of<br />\nthe most successful that the Musical Clubs<br />\nhave ever experienced.<br />\nWinsome—Did you ever hear a tramp jest?<br />\nLonesome—No, but I've heard a bum joke.<br />\n—Punch Bowl.<br /><br />\nMINOR LATIN.<br />\nGreat Hannibal was crossing,<br />\nThe Alps all white with snow,<br />\nThe path was growing difficult,<br />\nThe progress was full slow;<br />\n(This tale is told by Livy,<br />\nWho wrote way long ago.)<br />\nSteep, more steep, and steeper,<br />\nThe narrow pathway grew,<br />\nTill finally some towering rocks,<br />\nBurst straightway into view;<br />\n(And here the army halted,<br />\nJust wondering what to do.)<br />\nThe problem was not easy,<br />\nBut someone bright did say,<br />\nPour on the rocks some vinegar,<br />\nAnd they will melt away;<br />\n(And thus th' affair was ended,<br />\nWithout the least delay.)<br />\nAnd now in reading Livy,<br />\nThe best way is to do,<br />\nJust like that old barbarian,<br />\nWhen problems came in view;<br />\n(And read this very surely:<br />\nPerhaps it's meant for you.)<br />\nDon't try to ride on ponies,<br />\nO'er rocky pathways sore,<br />\nFor you will get thrown off and strike<br />\nThat rugged figure 4;<br />\nBut take your books and o'er it,<br />\nJust pore and pore and pore!<br /><br />\nTHAT LITTLE HAND.<br />\nLast night I held a little hand<br />\nSo dainty and so neat,<br />\nI thought my heart would surely break<br />\nSo wildly did it beat.<br />\nNo other hand unto my soul<br />\nCan greater solace bring<br />\nThan that one which I held last night—<br />\nFour aces and a king.<br />\n—Notre Dame Scholastic.<br /><br />\nA COLLEGE CONJUGATION.<br />\nJug.<br /><br />\nJag.<br />\nJugged.—Lampoon.<br /><br />\nLUNCH<br /><br />\nDOLLARS<br />\n(Y *MAS<br />\nBIRDMAN<br />\n4,IN G. INZST<br /><br />\nFREE<br /><br />\n\\E V<br />\n\\LIC or,<br /><br />\n_111101•14.0.....\"<br />\n,<br /><br />\n1-7 I,<br /><br />\n.17<br /><br />\nr-\"<br />\n10 1.<br /><br />\n-T1<br />\nti<br /><br />\n,k•<br /><br />\n- e THE. /44<br /><br />\nr-t<br /><br />\nA<br /><br />\nrER<br /><br />\nEDITOrtifkl..ROOMS•<br />\nlAbs..LET CF<br /><br />\n•<br /><br />\nEr'<br /><br />\n(r_<br /><br />\n,•<br /><br />\nWij<br /><br />\nkya-tar--c,\"<br /><br />\n(as<br />\nA<br /><br />\nRA:3<br /><br />\nA<br /><br />\no<br /><br />\n421<br /><br />\nsruo<br /><br />\n'<br />\nGORGON S\"<br />\nDur—T &amp; GAR.gsw,-0<br />\nISY CLANSSES1057-07<br />\n—<br /><br />\n1PLFREE.<br /><br />\nr<br /><br />\n,,vre.?;:y oviii<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nCOLLEGE NOTES.<br />\nIt is probable that on the debating team<br />\nwhich will represent Swarthmore College<br />\nthis year against Pennsylvania will be a<br />\nyoung woman.<br /><br />\nThe telescope recently purchased in England by Harvard has been received at the<br />\nobservatory. The instrument weighs about<br />\nnineteen tons. The reflecting lens is six<br />\ninches thick, and weighs, with its cell, about<br />\nThe sophomore class at Harvard has shat- a ton. The focal length is 281/2 feet. This<br />\ntered all traditions by electing to the office gives an image upon a scale of six inches for<br />\nof president W. H. Keeling, of Sioux City, a degree. The telescope will be used prinIa., who is working his way through college. cipally for the observation of distant stars.<br />\nPresident Keeling is one of the large force<br />\nof student-waiters at Randall Hall. Class<br />\nWith the College of Pharmacy already acpresidencies at Harvard have hitherto always been filled by prominent society or quired and the donation for a school of jourfraternity men, or at least by men distin- nalism in hand, Columbia is or will soon be<br />\na university in all that the word implies.<br />\nguished in athletics.<br />\nThe corporation proper now includes the<br />\nStatistics of the Yale freshman class show College, the Schools of Applied Science, the<br />\nan average age of 18 years, 9 months and School of Architecture, the Law School, the<br />\n16 days, indicating probably not less than School of Political Science, the School of<br />\n22 years, 10 months at graduation. In 1863 Philosophy, the School of Pure Science and<br />\nthe average graduating age was 22 years, the College of Physicians and Surgeons.<br />\nTeachers' College and Barnard, although<br />\n6 months.<br />\nseparate corporations, are part of the uniThe treatment accorded freshmen at Ox- versity.<br />\nford is diametrically opposite to that accorded them in American institutions.<br />\nOver<br />\nThe official registration figures of the Unithere the upper classmen are expected to<br />\nvacate the best rooms at student boarding- versity of Pennsylvania show that the athouses so that freshmen can move in, and in tendance has increased 13 per cent, over last<br />\nevery way treat them as honored guests. year, and is now the largest the university<br />\nEach senior is expected to give a \"break- has ever known. So far 3,093 students have<br />\nfast\" in honor of the freshmen in his college. registered, an increase of 401.<br /><br />\nNiiiiiikwinkNpersk vow Now Now lesisk'weilk Wasik WOW Nook NOM<br /><br />\nLrmivirRT,<br />\nTill- C01_111,1:1<br />\n.<br /><br />\n•I<br /><br />\ncKillor<br /><br />\nI<br /><br />\nThere Is nothlrw like or ccival<br />\nIt) a 1...LJAMI1R-1 - Suit for stuic<br />\nor comfort.<br /><br />\nFownes Gloves<br /><br />\nLLMAALTT<br /><br />\nWILL BE WORN LONGER THIS<br /><br />\n19 W. SAIM-1-06A STPLET.<br /><br />\nSEASON<br /><br />\nwink Ntmeilek No\" Welelok `440014k VOW 111101, VOW \\GP% Neap,'weak/<br /><br />\nTHAN<br /><br />\nOTHERS, THAT<br /><br />\nIS, OTHER GLOVES<br /><br />\nBOOKBINDING<br />\nWe Bind Tastefully.<br /><br />\nBooks, Phamplets, Music, Etc.<br />\nSpecimens Submitted with Pleasure.<br /><br />\nRks/ZICK<br />\n609 N. EUTAW ST.,<br />\nTelephone, Mt. Vernon 3022.<br /><br />\n81816 BROS Qui'<br />\n13 West<br />\nLexington Si.<br /><br />\n0Z<br />\nPI rf12\"<br />\nla<br /><br />\nJohn S. Kerr<br />\nW. Pants Rolph<br /><br />\nC. &amp; P. Phone<br /><br />\nKERR 86 ROLPH<br />\nRepenting Arthur Johnson &amp; Co..<br />\nNew York City.<br /><br />\nSpot ting Goode<br /><br />\n818V813 aii1 Mecipies National NHL<br /><br />\nand<br /><br />\nAthlone Supplies<br /><br />\nLAw.<br />\nLECTURES<br /><br />\nBALTIMORE,. AID.<br /><br />\n•<br />\nJAMES CLARK, President.<br />\nPAUL A. SEEGER, Vice-President.<br />\nCHARLES S. MILLEB,Cashier.<br />\nEDWIN P. HAYDEN, Alnet Gash.<br /><br />\n304 PARK AVENUE,<br /><br />\nBALTIMORE, MD.<br /><br />\nCapital,<br />\n$300,000.00<br />\nSurplus and undivided profits, — $495,000.00<br />\nSafe Deposit Vaults.<br />\nBoxes Rented.<br />\nCareful Attention to the Interests of Depositors.<br />\n.We Invite You to Open an Account with Us.<br /><br />\nt.M:<br />\nh ,P<br />\nnd<br />\n44+.*****•.*************40....**40......<br />\nBaltimore University,<br /><br />\nAddress J. V. KELLY, Sec.-Treas.<br />\n840 North Charles Street,<br /><br />\nBaltimore, Md.<br /><br />\nFOR ADVERTISING RATES<br />\nII THIS PAPER,<br /><br />\n••••••••••••••••••••••••••••••••••••••<br />\n•<br />\n•<br />\n:<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\nAALANTE)<br />\n—ALUMNI TO INSERT TKEIR BUSINESS AND PROFESSIONAL CARDS<br /><br />\nADDRESS<br /><br />\nTUE<br />\nNEWS-LETTER,<br /><br />\n•<br /><br />\nJohns Hopkins University,<br /><br />\nIN THEiNEWS-LETTER.<br /><br />\n•<br />\n•<br />\n01141•••••••••••••••••••••••••••••••••••<br /><br />\nBALTIMORE.<br /><br />"}], "field_media_file": [{"target_id": 36283, "display": null, "description": null, "target_type": "file", "target_uuid": "5c6e5fcb-e844-4a00-b26d-e9b09935044d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12258-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12258, "target_type": "node", "target_uuid": "8d531c34-9b8a-478d-be19-d47137e7e11b", "url": "/node/12258"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bcd5f078-7e80-4d32-ae0e-4efd7c0cea66"}]}