{"mid": [{"value": 35656}], "uuid": [{"value": "7bbe2fd9-adf1-4f60-b953-084b70c42509"}], "vid": [{"value": 35656}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12198-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•JANURRY 29, 1902.<br />\n<br />\nVol. VI. No.<br />\n<br />\n)<br />\n111100.14.4<br />\n014.11100•0140*116<br />\n<br />\n1111104.<br />\n<br />\n11101111<br />\n.$111A.10.177.111erli•<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORE, MD.<br />\nI.<br />\n<br />\nTwenty-Sixth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDoan of the Colleue.<br />\n.<br />\n<br />\nIRA REMSEN.<br />\nWM. II. HOWELL.<br />\nEDW. IL GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degree of Ph. D.)<br />\n(10 In Medicine. (Courses for candidates for the degree of M. D.;coursas for physicians.)<br />\nFor Undergraduates:<br />\n(0) As candtdatem for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n•<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysies,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy.<br />\nPhyslidogy<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,!<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br />\n<br />\nDirectors.<br />\nlie Ifernsen.<br />\nJoseph S. Ames.<br />\nWilllain li.<br />\nrh<br />\nWilliam K. Broaks.<br />\nFranklin P. Mall.<br />\nWilliam. IL Howell.<br />\nIL Welch.<br />\nJahn .1. Abel.<br />\nJohn.!. Abel.<br />\nOder.<br />\nIHrectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Btootufield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Ref lit.<br />\nJ. M. Vincent.<br />\n.T. H. Hollander,<br />\nPrank Morley.<br />\nJoseph S'. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,, Editor. Quarterly. 4to. Volume XXIV<br />\n• in iirogreas. $5 per volume.<br />\nH. American Chemical Journal.<br />\nI. REMSEN,Editor. Monthly. 8vo. Volume XXVI<br />\n' in progress. $5 per volume.<br />\nIII. American Journal of Philology.<br />\nII. L. GILDERSLEEVE, Editor. Quarterly. 8yo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory. Bye.<br />\nVolume V complete. $5 per Volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4W.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A msyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXI. Modern Language'Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Do. Volum*<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Ili-monthly. /Ivo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 4to., e5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey,<br />\nWILLIAM B. CLARK, Editor.<br />\nxi% Terrestrial Magnetism and Atmospheric Flee.<br />\ntricky.<br />\nL. A. BAITER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trutttees, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and statint<br />\ntime regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nGroups.<br />\n1.<br />\n(the \"Old College con roe.\")<br />\n2. Classical<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Chemical-Biological.<br />\n(leading up to Medicine.)<br />\n4.<br />\n15. Latin Mathematical.<br />\n6. Historibal-Political.<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nMaria! Publications.<br />\nEditors.<br />\nMathematics(vol. XX IV.)<br />\nPrank Marley.<br />\nChemistry (vol. XXVI).<br />\nIra Itemsen.<br />\nPhilologc(vol. XX II.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XIX.)<br />\nJ. M. Vincent<br />\nModern augueges(vol. 3CVT.)<br />\nA. Marshall NIllott.<br />\nBiology (vol. ;IV.)<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nA say ology (vol. IV.)<br />\nExperimental Mediciue(vol. VT.) W. H. Welch.<br />\n<br />\nProgrammes of the Conrses offered to graduate students in Philosophy and the Arta, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nIn teblition to the eerialmabove named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critienl Edition of the Hebrew Text of the Old<br />\nTestament. Nclited by Prof. Paul Haupt. Prospectee On a ppl'cation.<br />\nRowiand's Photograph of the Normal Solar Spectrual•<br />\n10 plates. $20.00<br />\nDemeription of the Johns IfonkIne Hospital. J. S. Billings, Editor. 1111 pp. 4to. 111 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete tae-simile edition. Edited by J. Rendel Harris. 110 pp. 4W. 10<br />\nplates. WOO<br />\nReproduction in Phototype of Syriac MSS. with Antilegomens Epistles. Edited by 1. II. Hall. $3.00.<br />\nBibliographta llopkinsionsia. Part I. Philology. Par\"<br />\n11-1IL Chemistry, Mineralogy and Geology. Parts<br />\nV-V- V I.Physics, Astronomy and Nlathernatios.<br />\n8 vo. 30 cents per part.<br />\nfull list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remIttanosS<br />\nman be sent to Johns tioukins Press, Baltimore, Md.<br />\n<br />\n\fr,.<br />\n<br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nJANUARY 29, 1902.<br />\n<br />\nNo. 8.<br />\n<br />\nTHE RECEPTION AT THE MEDICAL SCHOOL.<br />\njOPKINS students have always had a just cause of complaint in the lack<br />\nof personal intercourse between teacher and pupil at the University. For<br />\na few hours each week they come in contact with each other in the class<br />\nroom, where the instructor must always remember he is the instructor, and the<br />\npupil must always remember he is talking to his teacher. Man to man they<br />\nnever meet, and even the adviser system, which offers such bright prospects on<br />\nmatriculation day, has descended with most of us to the formality of a signature.<br />\nThe great influence which the faculty members, as men, could exert on the<br />\nstudents is entirely neglected except for a fortunate few. Though home students<br />\nof course do not feel this so much as those from out of town, the state of affairs<br />\nis noticed by all.<br />\nThe faculty has made the first move in relieving this condition by inaugurating a series of informal meetings, at which graduate students, medical students and undergraduates have the opportunity of meeting each other and<br />\nThe announcement of the<br />\nmembers of the faculty—also their wives.<br />\nfirst meeting, which was held Saturday night, produced some little mysterious wonder among the students as to what the \"informal meeting\"<br />\nmeant. Consequently there were not as many undergraduates present as<br />\nmight have been, though quite as many as could be expected for the<br />\nfirst meeting. A very large proportion of the medical students was present, and<br />\nalmost all the faculty. The married members of the faculty generally brought<br />\ntheir wives.<br />\nThus when President Remsen stepped on the platform in the hall of the<br />\nphysiological building, he had to face a large and interesting audience. Outlining the purpose of this meeting, he stated that it was the first of a proposed<br />\nseries to demonstrate the human side of the instructors to the students; to offer<br />\na means of bringing the different classes of students together in personal intercourse, and to promote a closer fellow-feeling all around. That this aim was<br />\nappreciated by most of the audience was testified by the applause which greeted<br />\nDr. Remsen as he stepped off the platform to make way for Professor Bloomfield, who gave a short account of his reproduction of the famous Kashmirian<br />\nAtharva Veda.<br />\nDr. Remsen had made a particular request for informality, and after the<br />\ntalk by Dr. Bloomfield, student and prof. mingled together much more than<br />\nthey had done before. Refreshments were served, after which a chance was<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ngiven to sow the seed of that personal intercourse which President Remsen<br />\nsaid was the object of the meeting. The newness of the affair at Hopkins<br />\nwas somewhat of a drawback to its complete success, but those of the fellows<br />\nwho were lucky enough to meet the \"big men\" of the faculty, their wives, and<br />\nthe co-eds of the medical school, thoroughly enjoyed the evening. The only<br />\ntrouble was that not enough men had that pleasure—a state of affairs probably due to a combination of their own backwardness and too much formality<br />\nin the atmosphere. However, the affair was an excellent beginning of what<br />\nought to be an excellent project, and if the students only attend future meetings with the proper spirit, and the formality is a bit reduced, there is no reason why the results from it can not be all that is desired. These meetings, if<br />\nkept informal, certainly ought to produce a better spirit here.<br />\n<br />\nMUSICAL CLUBS AT FOREST GLEN.<br />\n<br />\nt<br />\n<br />\nHE Musical Clubs gave a concert at the National Park Seminary on Monday night, January 27. The men left on a private car by the Baltimore<br />\nand Ohio at a little after five o'clock, and arrived at Forest Glen, Md.,<br />\nat 7.30. Here a light supper was served, and then the men wandered reluctantly from the beautifully-decorated dining-room to the concert hall. Here<br />\nmore than two hundred of the girls and their friends were assembled, and even<br />\nthe worst music won applause. The Glee and Banjo Clubs vied for first place<br />\nin point of excellence, and their leaders should he congratulated. After a short<br />\nprogramme, refreshments were served, and the men made the best of their opportunities till the manager called time, and the Clubs were once more homeward<br />\nbound. This concert did much to get the Clubs in line for the Baltimore concert of February 14, which is always the crucial test of the year.<br />\n<br />\nTHE BALTIMORE CONCERT.<br />\n<br />\nZHE<br />\n<br />\nJohns Hopkins Musical Clubs will give their most important concert<br />\non the night of February 14, in Lehmann's Hall. This date was judged,<br />\nafter much consideration, to be the best time to give the concert, as it will<br />\nnot conflict with any of the various athletic games that are being arranged for<br />\nFebruary. What the condition of the Clubs will be at that time is a matter of<br />\nspeculation, as there is still some time before the event. Still, if rehearsals are<br />\nkept up and the men work as hard as they have been doing lately, there is little<br />\ndoubt but that the concert will be unusually interesting and successful.<br />\nIt is hoped that more of the student body will be present this year than<br />\nformerly, for heretofore the clubs have received most of their support from those<br />\noutside of the University. This obviously should not be so, for the musical<br />\norganizations are part of the college life, and should receive the same support<br />\nthat is accorded to athletics. Especially should the clubs receive support this<br />\nyear from the whole student body; for, in giving the Athletic Association the<br />\nhundred dollars to help found a training table last year, the clubs left them-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nselves in a bankrupt condition. In order to help the organization to meet the<br />\nheavy expenses that are necessary to maintain it, the faculty, graduate students,<br />\nand under.graduates are urged to attend this concert. If more interest were only<br />\nshown by the University in this annual concert, the clubs could each year<br />\nmaterially aid the various athletic enterprises.<br />\nIn order that each member of the University may have an opportunity to<br />\npurchase a ticket, the faculty and various departments and classes will be so<br />\ndivided amongst those having this matter in charge, that no one this year will<br />\nbe able to say that he was not approached on this subject, and so was not present at the concert. If all the athletes and others would co-operate with the<br />\nmembers of the musical clubs, a successful concert would be assured, and the<br />\nhigh standard of previous years maintained.<br />\n<br />\nANOTHER APPROPRIATION.<br />\nT the last meeting of the \"1901 Hullabaloo\" board, held last week at the<br />\nhome of the editor-in-chief, Mr. John G. Machen, affairs were finally<br />\nsettled. Mr. Harry S. Byrne, the business manager of the book, re<br />\nported a successful sale which netted a surplus of over forty dollars. The board<br />\nwas much pleased with the administration of Mr. Byrne, and voted him a resolution of thanks and congratulations. Mr. Machen and Mr. Byrne were appointed a committee of two to deliver the money to the treasurer of that organization which might make best use of it. The appropriation will probably be<br />\ndevoted to athletics, very likely to increase the bank account of the \"field\"<br />\nfund. On behalf of the student body the NEWS-LETTER begs to thank the<br />\nHullabaloo Board for their generosity.<br />\n<br />\nTWO LIBRARY NOTES.<br />\nCENTURY of thousands is now the official catalogue number of books<br />\nin the Hopkins library. The library assistant made out the card for the<br />\n100,000th book last week, though the number in the collection really<br />\nconsists of some three or four thousand more which have not yet been catalogued. These include the gifts of the late Prof. Herbert B. Adams who left<br />\nto the University his complete library, which is still in a somewhat disordered<br />\nstate. The growth of the library has been fast, and each year has seen added<br />\nto its shelves ancient and modern documents of value and interest. The NEWSLETTER hopes to publish in a near issue the story of this growth as told by one<br />\nof the gentlemen connected with the library staff since the beginning of the<br />\nUniversity.<br />\nAnother note of interest is the purchase of a new and handsome cabinet for<br />\nthe royal works of Frederick the Great given to the University by the present<br />\nEmperor of Germany. The cabinet is a master piece of the wood carver's art,<br />\nand is a worthy case for the books it is to contain. The engravings of the seals<br />\nof the German Empire and of the University attract the attention of all who<br />\nhave seen the cabinet.<br />\n<br />\n4<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\nLECTURES OF A FORTNIGHT.<br />\n<br />\nZ<br />\n<br />\nHE second and third of Dr. Gilman's lectures on the general subject of<br />\nUniversity Education were delivered on January 18th and 25th. Dr.<br />\nGilman's lectures are attracting widespread attention, since, without<br />\ndoubt, he is one of the greatest living authorities on the subject of advanced<br />\neducation.<br />\nSaturday, the 18th, Dr. Gilman spoke upon \"Original Research—Its<br />\nantiquity; Its modernity; Its opportunities, and its methods\" He traced the<br />\nhistory of Original Research from ancient times to the present day, and said<br />\nthat modern science owes a great debt to Lord Bacon, who was one of the first<br />\ngreat scientists of modern times. As regards the last quarter of the 19th<br />\ncentury, Dr. Gilman said that great advances in Original Research had been<br />\nmade in this country. \"And our own Johns Hopkins,\" he continued, \"has<br />\nbeen in the front rank of all this vast work. In the beginning we were not<br />\nhampered as we are now, and our work then received the highest commendation<br />\nat home, and abroad.\" To those contemplating research work, Dr. Gilman<br />\nmade some practical remarks, and said that necessary qualifications were: native<br />\ntalent, good teachers, time, patience, knowledge of things, and imagination.<br />\nOn last Saturday, Dr. Gilman took for his theme: \"Scholarships, Fellowships, Burses, and Prizes.\" Ambition in its good and had sense was first<br />\nspoken of, Dr. Gilman explaining how it depended upon the motive of the<br />\nperson. It was with pleasure, he said, that he had always found academic<br />\ncircles governed by the proper kind of ambition: the desire to be honored for<br />\nspreading knowledge, and benefiting humanity. Fellowships, according to Dr.<br />\nGilman, can be traced to the Younger Pliny, though properly they begin with<br />\nthe dawn of the Universities in the 13th century. Continuing, Dr. Gilman gave<br />\nan account of the establishing of fellowships at Johns Hopkins, which was the<br />\nfirst American college to adopt the system. These scholarships brought to<br />\nHopkins a body of students, of whom any university might be proud. The<br />\nsubject of prizes was next taken up, Dr. Gilman explaining the difference<br />\nbetween them and fellowships. In closing, Dr. Gilman made a number of<br />\nvaluable suggestions regarding the founding of scholarships.<br />\nProfessor Richard G. Moulton, director of the department of English at the<br />\nUniversity of Chicago, is delivering a course of six lectures on the general subject of \"Ancient Tragedies for English Audiences.\" Professor Moulton is a<br />\nfascinating speaker, and the large crowds attending the lectures have the<br />\nGreek tragedies presented to them in an intensely interesting manner.<br />\nUnder the auspices of the Baltimore branch of the Archwological Society<br />\nof America, of which Dr. Kirby F. Smith is secretary, Miss Harriet A. Boyd of<br />\nSmith College delivered an illustrated lecture on the afternoon of the 17th in<br />\nMcCoy Hall. Her subject was \"American Excavations in Crete, 1901.\" Miss<br />\nBoyd gave an account of the work done by the archaeologists in the East, and<br />\nshowed many interesting views of the country, and of the discoveries made there<br />\nduring the past year.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nWHEN THE GAME WAS ENDED.<br />\ng staggered off the field into the arms of his friends with an exhausted,<br />\nthough glorious feeling. This was the greatest day of his life. From<br />\nnow on he was one of the heroes of Hopkins. How short a time ago it<br />\nwas, that he seemed to have no chance for the varsity, though all along he felt<br />\nthat all he. needed was a trial chance, that the other man's reputation of last year<br />\nwas all that stood between him and the coveted place on the team. None of<br />\nthe scrubs worked harder than he, but there did not seem to be any likelihood<br />\nof his getting into a game. How kind fate had been to him! Three days before<br />\nthe big game, the one that would decide the championship, the varsity man had<br />\nwrenched his shoulder, so that the scrub had been given the place. The shouts<br />\nof the multitude told what use he had made of the opportunity. It was his<br />\nclever stroke that had shot the deciding goal, and the University's victory was<br />\ndue to him. When there seemed to be no hope he had snatched victory from<br />\nthe hands of defeat.<br />\nAs cheer after cheer came over the field it was like the sound of heavenly<br />\nmusic. He saw some one coming with a sweater blazing with a golden \"H,\"<br />\nand stretching forth his<br />\n\"Say, Freshman, come out of that trance, and get into this cheer.\"<br />\n<br />\ng<br />\n<br />\nQUI FILE?<br />\n\"Quelle est eette etoile qui file,<br />\nQzti file, file, et disparait?\"<br />\n—thIRANGER.<br />\n<br />\nWho is that whose star is falling?<br />\nWho is that whose prestige wanes?<br />\nWont to hear all men him calling,<br />\nNow in vain his scepter claims.<br />\n'Tis the man we held in power,<br />\nOnce his name to us was all,<br />\nNow his sand has passed the hour,<br />\nGreat was his fame and great his fall.<br />\nFreshmen, who have had no fear,<br />\nJuniors, who have rushed the cane,<br />\nWill you, in the coming year,<br />\nSeniors, hold the palm again?<br />\nBe not haughty, curb your glory,<br />\nDefeat and Pride go hand in hand.<br />\nIn college, 'tis the same old story,<br />\nYou'll find no winner in the band.<br />\n0. M.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tint JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nJANUARY 29, 1902.<br />\nSubscription $1.50 per year.<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nSOL STROUSE, 1902.<br />\n.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nAssistant News Editors,<br />\nHARRY K. TOOTLE.<br />\nJOHN A. SLEMONS, 1902.<br />\nAthletic Editors,<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nArt Editor,<br />\nPEARRE, JR., 1902.<br />\nAUBREY<br />\nBusiness Manager,<br />\n. HARRY BAETJER, 1903.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to SOL STROUSE, box 557, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n.<br />\n<br />\nMISTAKE was made in our Athletic columns last issue, which we desire<br />\nto rectify. In the report of the meeting of the Maryland Intercollegiate<br />\nAssociation it was stated that a \"protest was registered against the Hopkins, on account of their playing graduates on their various athletic teams.\"<br />\nThe writer of the article was misinformed as to the meeting, as absolutely no<br />\nprotest was registered against Hopkins for any account whatever. At the meet<br />\ning held on January 18, a discussion of the condition of the Association and<br />\nits place in Maryland athletics resulted in a unanimous decision to keep up the<br />\nAssociation. We deplore the impression which the article produced on the<br />\nstudent body.<br />\nHOUGH one vacant position on the NEws-LETTER has been filled by the<br />\nelection of a junior to the staff, in a few weeks one or two more vacancies<br />\nwill occur, which in all probability will be filled from the freshman class.<br />\nAlready a cheering amount of work has been done by contestants from the class<br />\nof 1904 on all variations of literary lines. The work on the whole has been<br />\nsatisfactory, and the contestants should not feel discouraged at not seeing their<br />\ncontributions in print, as many things besides literary excellence must be taken<br />\ninto consideration in posting up an issue. Every man who is trying for a position should keep up working, and work heartily. In a discrimination between<br />\ntwo equally good men, it is generally the \"early bird catches the worm.\"<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\nHE Feed and Reunion which is going to be held on Friday of this week<br />\npromises to be one of the best ever held here. As announced in the last<br />\nissue of the NEWS LETTER, the feed is the only general student meeting<br />\nheld during the year, and for that reason it is generally well supported by everybody. The program, which is given on another page of this issue, includes<br />\ntalks by President Remsen and several members of the faculty, so that this will<br />\nbe the first time that Dr. Remsen addresses the students in his new capacity.<br />\nTo the older men we need say nothing about the attractions offered at these affairs, but we do want to impress on the freshmen the urgency of their attending en masse. The committee is also desirous of having present all Alumni<br />\nwho can possibly attend, and the medical student or the grinding grad who can<br />\nspare an evening to the pleasures of life will be doubly welcomed.<br />\n<br />\nt<br />\n<br />\nO<br />\n<br />\nN January 10th, Mr. Frank Moss, who was prosecuting attorney for the<br />\nfamous Lexow Committee, delivered a lecture before the students of Lehigh University on ''Morality and Politics.\" He told of his share in the<br />\ninvestigation of political corruption in New York, and described graphically<br />\nsome of the raids on the \"policy shops\" which used to thrive under police protection. He gave examples from his personal knowledge of open dishonesty<br />\namong city officials, and of the co-operation of respected citizens of New York.<br />\nSuch a talk, delivered by an able man like Mr. Moss, thoroughly conversant with his ground, could not fail to attract and benefit any American student,<br />\nwho looks forward to his personal responsibility in the body politic. If these<br />\nmen of affairs were more often invited to the University, the five o'clock lectures<br />\nwould become vastly more popular with the under-graduates, and would be to<br />\nthem a good training for the part they are to play in the vital affairs of government and citizenship.<br />\n<br />\nURING the last foot ball season the Hullabaloo yell was found to be not<br />\nas serviceable as some shorter yells which were adopted. As a rule<br />\nthese yells were \"benevolently assimilated\" for the occasion from some<br />\nof our intercollegiate friends, and for that reason were only temporary. The<br />\ncontrast between our own Hullabaloo and those shorter war cries was too evident' to need comment, and shows the immense superiority of a hard monosyllabic cry over a long one like the Hullabaloo. The Hullabaloo is a beautiful yell, but its beauty is greater than its practical use, and it ought, therefore,<br />\nbe supplemented by some other shorter and more concise cry. The NEWSLETTER would like to receive from the student body or from Alumni original<br />\nyells, whose use shall be mainly for athletics, and which will \"carry\" across<br />\nthe athletic field with more effect than the Hullabaloo. Monosyllables should<br />\nbe employed in making a new yell.<br />\n<br />\n9<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n1111111111IMMIIN 1101111111111111111111111111111111111M111111111111111111111111111111P11111111111111111i111111<br />\nNifinllelniiumulumitionmoma<br />\n.„<br />\n<br />\n6<br />\nAIMIIIIIIMIVIIIIIIIIIII1111111111111111111011MMIMIDIPAINIIIIIIIVIIIIINIMMIIIIIIIIIMPIIIIMIIMIIINMUNIMMIIIIIMIMINI<br />\n<br />\nITIIIII01:11:0;;;;11;liidla;liiN<br />\n<br />\n111% R. JACOB H. HOLLANDER and Dr. G. E. Barnett, of the department of<br />\nEconomics, will spend Thursday and Friday of this week in New York,<br />\nwhere they expect to attend the meeting of the Jewish Historical Association, of which Dr. Cyrus Adler, formerly of this University and now at the<br />\nthe Smithsonian Institute, is President. Dr. Barnett will read a paper before<br />\nthe Society.<br />\nMr. R. H. Wright, of the Historical Department, is at present acting as<br />\nsubstitute in the place of Professor Ebaugh of the Baltimore City College. The<br />\nlatter has accepted a position as instructor of mathematics in one of the New<br />\nYork schools.<br />\nLast Friday night the Historical and Political Science Association held an<br />\ninformal celebration in the historical library to commemorate the 472nd meeting<br />\nof the organization. The principal paper was read by Prof. Ramage of the<br />\nUniversity of the South. On Friday, February 21 , the Association will hold a<br />\nre-union, to which all the old Hopkins members will be invited. Dr. J. Martin<br />\nVincent has charge of the arrangements. On the 500th anniversary of the<br />\nAssociation, a large celebration is to be held.<br />\nA movement is on foot at the University of Maryland to form a club among<br />\nthe Hopkins men who are studying there. We have a large representation<br />\namong the future lawyers, and the idea seems a good one.<br />\nThe Hopkins Alumni banquet will be held on the night of February 22 at<br />\nthe Music Hall. A large number of out of town Hopkinsonians will be here on<br />\naccount of the celebration at that time, and the occasion promises to eclipse all<br />\nothers held in former years.<br />\nMr. George Cator, who was awarded a university scholarship by the board<br />\nof university studies, has waived the emolument. His action has been approved<br />\nby the board.<br />\nWithin the next few days, a picture of the class of 1901 will grace one of<br />\nthe corridors of McCoy Hall.<br />\nAt a meeting of the Junior Class last week, Mr. Mr. H. K. Tootle was<br />\nelected toastmaster for the annual class banquet which will be held about<br />\nFebruary 11. Tootle made such a decided hit in that capacity last year that<br />\nhis election was unanimous.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n9<br />\n<br />\nMr. Roy Williams was elected captain of the Junior Track Team. Williams<br />\ncomes from Lehigh, where he gained distinction for himself as a runner. He<br />\nhas turned out regularly with the Hopkins Squad this season, and is expected<br />\nto show himself in the coming B. A. C. and J. H. U. games.<br />\nFred C. Blanck was elected anchor-man on the Junior Tug-of-War Team,<br />\nwhich will pull against the Freshmen at the athletic feed on January 31.<br />\nThe Junior Class decided unfavorably upon the question of supporting the<br />\nSeniors in holding a senior promenade; and as not enough men could be gotten<br />\nfrom a single class to fill McCoy Hall, the idea has been abandoned.<br />\nThe Freshman Class has elected Strohbar supervisor of class athletics in<br />\ngeneral, and Branham captain of the class track team.<br />\nThe written challenge sent by the Freshmen to the Juniors regarding the<br />\nrelay race, which came off last Saturday, was a rather officious proceeding for<br />\nsuch verdant youths. It signifies that they are at last beginning to regain<br />\nconfidence in themselves after the troublous times of the past.<br />\nThe Freshmen deserve congratulation for being the first class for several<br />\nyears past which has enforced the law regarding the wearing of class numerals.<br />\nThe Juniors took action in the matter early in the year, but the Freshmen were<br />\nthe first to appear with their numerals on their jerseys.<br />\nThe Juniors have not yet succeeded in persuading the Dean that it will be<br />\nhighly beneficial for them to take a day off and attend a Session of Congress in<br />\na body- Strange to relate, the Dean does not think that the Juniors derive the<br />\nbenefits for which they endure a tiresome journey to distant Washington. Such<br />\na thirst for knowledge should certainly be quenched, by the Dean's consent.<br />\nThe piteous appeals and heart-rending cries which issue from McCoy Hall<br />\nalmost every day do not mean that murder is being done or that the place is<br />\nafire. The unoffending Freshmen are preparing for the oratorical contest.<br />\nHopkins students may be pleased to know that Dr. Nicholas Murray Butler,<br />\nrecently elected president of Columbia University, is a nephew of Mr. Nicholas<br />\nMurray, the Librarian of the Hopkins. Dr. Butler has frequently been to Baltimore to visit Mr. Murray, and has been entertained at the University Club.<br />\nSince the curtains have been placed on the cage windows, it is perfectly<br />\nsafe to bring ladies to the gym. However, some of our fair visitors may object<br />\nto not seeing so much of the Hopkins boys as formerly.<br />\nThe number of Freshmen trying for a place in their oratorical contest has<br />\nbeen narrowed down to five—Licking, Rosenheim, Shapiro, Hutnerichouse and<br />\nFoster. Diligent practice was begun on Monday, under the direction of Dr.<br />\nGuy Carleton Lee. About a week before the event, the number of speakers<br />\nwill be reduced to three, who will contest for the gold medal offered by Dr.<br />\nLee.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nAt the annual meeting and banquet of the Yale Alumni Association<br />\nof Baltimore, held on the night of the 18th, Dr. Bernard C. Steiner was<br />\nchosen president for the coming year, and Dr. Wm. H. Welch was<br />\nappointed a member of the executive committee to serve for three years. Presi<br />\ndent Ira Remsen responded to the toast \"Johns Hopkins.\" Extempore speeches<br />\nwere made by Dr. Steiner and Dr. Welch.<br />\nThe admirers of Dr. Guy Carleton Lee will be gratified to learn that his<br />\nbook, \"Historical Jurisprudence\" is being translated into both the German and<br />\nDutch languages.<br />\n<br />\nY. M. C. A. NOTES.<br />\n(<br />\n1pROF, HAUPT addressed the Graduate Students' Bible Class last Satur-<br />\n<br />\nday morning on \"The Song of Songs.\" His very helpful discussion<br />\nwas much appreciated by those present. Prof. Haupt is soon to publish in The Journal of Bzblzcal Literature, an article giving new renderings, and<br />\nshowing the correct order of \"The Song of Songs.\"<br />\nThe attention of all students interested in Bible study is called to the<br />\nexcellent course now being offered under Prof. Haupt's direction, by Dr. Foote,<br />\nmeeting Thursdays at 5 P. M. Dr. Foote is a very able literary and Biblical<br />\nscholar and Hopkins students should not allow his efforts in their behalf to be<br />\nenjoyed by outsiders alone.<br />\nThe Fourth Student Volunteer Convention will be held in Toronto, Canada,<br />\nFebruary 26—March 2. It promises to he the largest gathering of students<br />\never held, as 2,500 college men are expected to attend. The citizens of Toronto<br />\nare to entertain them all for the week of the conference. These conventions are<br />\ninternational, and are held every four years. Last time Hopkins sent one<br />\ndelegate; this year the association expects to have three representatives. The<br />\nExecutive Council has voted to pay the expenses of one delegate, and a collection is in progress among the members of the Association to defray the expenses<br />\nof another. Contributions may be handed to any officer of the Association.<br />\nThe General Secretary will also attend, as will Mr. C. W. Young, of the Medical School, president of the Baltimore Student Volunteer Band.<br />\n<br />\nVARIOUS NOTES FROM A FRESHMAN'S BOOK.<br />\nJanuary 9.<br />\nJanuary 10. As a general rule, gentlemen, it is best not to put prussic<br />\nacid in your mouth.<br />\nJanuary 11. In writing formal invitations, it is usually the thing to use<br />\npaper of a delicate lilac hue, and, though not absolutely necessary, it is most<br />\nexcellent to have in them in lingering perfume of Roger & Gallait's cologne.<br />\nMusk and tobacco are hardly good form.<br />\n<br />\n\f11<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nJanuary 12. These stones, gentlemen, are not the original diamonds;<br />\nthose are in various other places. Therefore, in playing with them after lecture, it will hardly be profitable to slip them adroitly up your sleeves.<br />\nJanuary 13. Just make a noise. Don't care how you make it. Roar like<br />\nthe bull of Bashan; shriek like a woman at a bargain-counter; howl like those<br />\nin the dungeons of the damned; only make a noise.<br />\nJanuary 16. When people played cards in the olden times, they used one<br />\nsingle little candle; but in these days of modern lighting, when people play<br />\ncards, they have half a dozen acetylene lamps on the table; on the mantelpiece are whole rows of candelabra; around the walls are countless gas jets; in<br />\nthe hand of each man is a lighted bicycle lamp; and, suspended from the ceiling<br />\nare a dozen arc lights.<br />\nJanuary 17. It is perfectly simple how, when the cat falls, it lights on its<br />\nfeet: for, when beginning to fall, it sticks its tail between its teeth and chews it.<br />\nThis naturally causes the tail to fly back to the position of equilibrium, and<br />\nthus a rotary motion being established, the cat is enabled to light on its feet.<br />\nJanuary 18.<br />\nR. 0. '04.<br />\n<br />\nSWEET STOLEN FRUIT.<br />\nHours in the Library! Glad hours we loved!<br />\nChair tilted back into some cozy nook,<br />\nBy thoughts of tasks neglected all unmoved,<br />\nDead to the world, living within a book;<br />\nThe afternoons we left our work undone,<br />\nLeft apparatus safely stowed away,<br />\nLeft note-book closed, abandoned work for fun,<br />\nAnd in the Common Room loafed out the day;<br />\nThe mornings we were looking for a quiz,<br />\nAnd therefore cut the class, and stole away,<br />\nAnd strolled down town and saw Man as He is,<br />\nMan—ignorant of quizzes—work and play;<br />\nYears after we shall think on these and smile,<br />\nCast off our cares, again be boys awhile.<br />\n—P. W. '02.<br />\n<br />\nA story is going the rounds of the medical school which very strongly illustrates Lord Chesterfield's words \"clothes makes the man.\" A certain student in the first year, who is inclined ty corpulency, went down town to purchase a dissecting jacket at a local furZishing store. After trying on all the<br />\nwhite jackets in stock and finding none to suit, the student asked to see a colored jacket with small ornamentations in its design. A size 46 fitted him.<br />\n\"I'll take this,\" he said to the clerk. The clerk looked up astonished, and replied very seriously, \"But, my dear sir, you can't go behind the bar with that<br />\njacket.\"<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nATHLETIC NOTES.<br />\nT was announced last week that our lacrosse team would not play the Cres•<br />\ncent Athletic Club this year. The reason for giving up such a \"fixture\"<br />\nas this game is on account of the lacrosse management being unable to<br />\narrange a date with the Brooklyn team. At present the schedule is:<br />\nApril 5, University of Pennsylvania, at Philadelphia.<br />\nApril 19, Harvard, at Baltimore<br />\nApril 26, Lehigh, at South Bethlehem. Championship game.<br />\nMay 10, Swarthmore, at Baltimore. Championship game.<br />\nManager Slemons attempted to arrange a game with the Crescents for April<br />\n12, but was unable to do so on account of conflicting dates. May 3rd was not<br />\npracticable, as it would be poor policy to put such a team in between the two<br />\nchampionship games. These dates will probably be filled by Columbia, Stevens, or C. C. N. V.<br />\n<br />\n3<br />\n<br />\nAt a meeting of the track and field team held a short time ago, Mr. Murk land was chosen assistant manager. The management of the team is at present<br />\nbusily engaged in arranging to enter men into the Baltimore Athletic Club and<br />\nthe Georgetown games. Preparations are also being made for an indoor meet,<br />\nto he held in the Fifth Regiment Armory, during February.<br />\nA letter has been received by Manager Slemons from the University of<br />\nToronto Lacrosse Club, asking for a game with our team during the last of<br />\nMay. Owing to the nearness of the final examinations, however, the offer for<br />\na game had to be declined.<br />\nThe last few Saturdays have been record-breakers in the point of attendance at lacrosse practice. Over thirty men, or about twenty per cent. of the<br />\nwhole under-graduate body, has been out each Saturday.<br />\nGeorge Knapp, an old '99 man, who won all kinds of laurels for Hopkins,<br />\nwas with us several days last week. His first appearance brought forth a<br />\nhearty \"Gee hee, Gee-ha!\" Pity we haven't a few more Knapps.<br />\nThere was some talk last week of having as one of the features of last Saturday's athletic contest a relay race between the lacrosse and the track teams.<br />\nCaptain Schmeisser, however, was probably fearful of the result, and decided<br />\nnot to push matters. With a liberal handicap the lacrosse men might have<br />\nmade things interesting for the sprinters.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nRESIGNATION OF CAPT. HOFFMAN.<br />\nT a joint meeting of the Track and Field Teams, held last Wednesday<br />\nafternoon, Mr. W. E. Hoffman, 1902, tendered his resignation as captain of the Track Team on account of press of other work. His resignation was accepted with a vote of thanks for his excellent services. Mr. J. T.<br />\nEngland was then unanimously elected as Mr. Hoffman's successor, and his<br />\npast record for executive ability as well as speed on the track will, no doubt,<br />\nenable him to prove a worthy official.<br />\nJust before the adjournment of the meeting Mr. Mackdermott made a short<br />\nspeech, complimenting Mr. Hoffman on his splendid work in behalf of athletics,<br />\nand his unselfish and earnest efforts in making the track team what it has been<br />\nfor the past year. He further stated that the team was in great need of fast men<br />\nthis year, and urged that each man put his best foot foremost to keep up the<br />\nhigh standard which Hopkins has recently attained in this branch of athletics.<br />\nIt is hoped that this request will be generously responded to, and that we<br />\nshall not have the humiliation of seeing one of our star teams fall below the<br />\nnotch this year.<br />\n<br />\n4<br />\n<br />\nNEXT FRIDAY EVENING.<br />\n'/HE annual athletic feed and reunion will be held in the Gymnasium next<br />\nFriday evening, exercises beginning at 8 o'clock sharp.<br />\nThese feeds have always been numbered among the most successful<br />\naffairs which the Hopkins has instituted, and from the vague accounts which<br />\nDame Rumor has recently spread, this year's promises to eclipse anything of<br />\nthe kind ever seen at the University.<br />\nThe committee, of which Mr. J. G. Campbell is chairman, have been particularly strenuous in their efforts to make this event enjoyable to all who may<br />\nattend, and the programme which they have arranged, the details of which are<br />\nas yet unknown, promises to be exciting in every particular. The time-honored<br />\ncustom of awarding the athletic \"H's\" to the members of the winning teams<br />\nwill be observed as usual; and all those who have worked so patiently and earnestly in behalf of the Hopkins Athletics will receive the just reward of their<br />\nefforts. President Remsen and other prominent members of the faculty will be<br />\npresent, and will deliver short addresses apropos to the occasion.<br />\nDuring the intervals several attractive selections will be rendered by members of the musical clubs, and Mr. Harry Wiel, of the Medical School, who is<br />\nknown to be something of a pianist as well as a humorist, will do a piano<br />\nstunt. Whipple, assisted by others, has promised to give a startling exhibition in gymnastics, which is expected to be unique in itself.<br />\nUpon adjournment to the cage, an entirely new departure in the line of<br />\nevents will be observed, as every feature in this part of the programme is<br />\nentirely original. The obstacle race promises to be quite amusing, while a tug<br />\nof war will once more test the strong rivalry existing between Freshman and<br />\n<br />\ni.;<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nJunior classes. A game of football, as it was played at Rugby, occupies a<br />\ncorner on the list of \"Stunts.\" These features are but \"E pluribus paucum\"<br />\nof the series which is to be offered, after which an abundant store of good things<br />\nto eat will be served.<br />\nThese glorious occasions have always been fully attended by the student<br />\nbody, alumni, as well as others, and it is hoped that a still greater number will<br />\nbe present this year. It is particularly advised that all those who think there<br />\nis no college life at Hopkins will come and be astonished. The admission is<br />\nfifty cents.<br />\n<br />\nJOINT INDOOR MEET.<br />\nHE first of a series of indoor games which are to be held under the<br />\nauspices of the General Athletic Association during the present winter<br />\nand the coming spring, was run off last Saturday afternoon in the Cage,<br />\nand proved a \"howling\" success. During the morning the committee in charge<br />\nhad busied themselves, and when the games were called at three o'clock the<br />\nwalls of the cage were gaudily decorated with class and University flags and<br />\nwith the championship banners won by the football, baseball, track and field,<br />\nand lacrosse teams. Across the length of the gallery recently erected at the<br />\nwest end of the cage was a long black and blue streamer which added to the<br />\nspirit of the occasion. From the windows of the gymnasium the wire screens<br />\nhad been removed and a line of chairs put along the whole length. Both the<br />\ngallery and the gymnasium were filled with under-graduate and graduate students, former graduates and the lady friends of the various members of the<br />\nUniversity, everyone cheering their favorites on to victory.<br />\nIn every sense the meet was a success, and much honor is due to Physical<br />\nDirector Mackdermott, who originated the scheme of\"cage meets,\" to Captain<br />\nEngland and Manager Pearre of the track and field team, and Captain Schmeisser<br />\nof the lacrosse team, who ably assisted Mr. Mackdermott. The editors of the<br />\nNEWS-LETTER sincerely hope that the success of the initial meet will be sufficiently encouraging to those who had charge to arrange the next set of games for<br />\na date in the near future.<br />\nThe programme was started with a 35-yard dash across the cage, which,<br />\nowing to the large number of entries, had to be run off in five heats. The<br />\nentries and results for this and the other events follow:<br />\nFirst Heat—Won by Blanck; H. P. Straus, second. The other entries<br />\nwere: Messrs. E. P. Bernheim, Sayler, and Branham.<br />\nSecond Heat—E. Schmeisser, first; Abercrombie, second. Also ran, Bryan,<br />\nBird, Custis and Putts.<br />\nThird Heat—R. C. Hoffman, Jr., first; Williams, second. Also ran, Porter, Rosenheim, LeCron and Emig.<br />\nFourth Heat— Weedon, first; Riggs, second. Also ran, Hopper, Nelson,<br />\nKohn and England.<br />\nFifth Heat—Lindsay won; Riley second. Licking, Numsen, and Brem<br />\nalso ran.<br />\n<br />\n'OC<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nSemifinals—First heat: Abercrombie won; Blanck, second.<br />\nSecond Heat—Weedon, first; Riggs, second.<br />\nFinal—Abercrombie, first, Weedon, second.<br />\nThe interclass relay race was the signal for an outburst of enthusiasm on<br />\nthe parts of the junior and freshmen adherents, and was one of the most interesting events of the day. It was easily won by the upper classmen, but had it<br />\nnot been 'for the unfortunate fall of Kohn, of the freshmen team, which proved<br />\nthe most serious handicap for the lower classmen to overcome, it would have<br />\nbeen a nip-and-tuck race. Those who ran were : Juniors—E. Schmeisser,<br />\nCustis, R. C. Hoffman, Jr., and Williams. Freshmen—Kohn, Emig, Branham and Rosenheim.<br />\nStone got first place in the 16-pound shotput, with Blanck a close second.<br />\nThe other entries were: Messrs. Lawson, Rosenfeld, Whipple, Scholl, Sayler,<br />\nand Yearley. Stone's work in this event was great, and he showed much improvement in form over last year. He should do many things for his alma<br />\nmater this year.<br />\nFour forty yard run—J. T. England, scratch; Hoffman, Numsen, Nelson,<br />\nLindsay, Joseph Smith and Licking. The handicap limit was 20 yards. England won, with Smith second.<br />\nThe lacrosse game was the next event, and was a signal for another outburst of enthusiasm. The team was divided into halves, and the attack was<br />\npitted against the defense. Those who were in the contest were:<br />\nNo. 1—Briscoe, E Schmeisser, Sayler, Abercrombie, E. P. Bernheim, and<br />\nPutts.<br />\nNo. 2—W. C. Schmeisser, H. P. Straus, Custis (Iglehart), Bird, Bryan,<br />\nand B. Bernheim.<br />\nThe game resulted in a score of 7 to 7.<br />\nThe running high jump was won by William S. Weedon, with George B.<br />\nScholl second. Brem also jumped.<br />\nThe games were ended with a half-mile run. There were only three entries,<br />\nand E. Schmeisser easily got first place. Porter got second, with Rosenheim<br />\nthird.<br />\nThe officials were: George W. Knapp, referee; J Morfit Mullen, marshal;<br />\nAubrey Pearre, clerk of the course; W. M. Mackdermott, starter; E. B. Beasley, G. D. Dulaney, R. C. Pagon, and Henry Iddins, judges; J. R. B. Branch,<br />\nscorer; L. M. Tough, assistant scorer, and J. C. Campbell, announcer.<br />\nReferee of lacrosse game, J. Bandel; goal umpires, B. B. Bandel and E. C.<br />\nHatch.<br />\nMany of the contestants who competed in these games will represent the<br />\nHopkins in the B. A. C. indoor meet at the Fifth Regiment Armory next Saturday and for the Georgetown meet in Washington during the last of February.<br />\n<br />\n\"I see my finish,\" gasped the canine, and continued in pursuit of his<br />\ncaudal appendage.—Ex.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS—LETTER.<br />\nMARYLAND INTERCOLLEGIATE LEAGUE.<br />\n<br />\nHE adjourned meeting of the Maryland Intercollegiate Association was<br />\nheld on Saturday, January 18, in the office of the President, Mr. James<br />\nA. Fechtig, Jr.<br />\nThe games committee, composed of Professor Cain, of St. John's, chairman, William E. Hoffman, Jr., of Johns Hopkins, and Mr. Gilligan, of Western Maryland, was authorized to prepare a list of specific events and the order<br />\nof running off the same at the intercollegiate track-field championship games in<br />\nMay. They were also authorized to arrange the baseball dates for the approaching season.<br />\nThe harmony which prevailed between the delegates was particularly noticeable, as a discussion of athletic topics is always liable to produce friction<br />\nand to rend asunder a meeting into contesting factions.<br />\nThe Maryland League is to be congratulated upon the stand it has taken<br />\non the subject of pure athletics. Some five years ago nearly every college team<br />\nhad some trace of professionalism, and even at the present day it has not en<br />\ntirely disappeared from our leading institutions; but the Maryland League has<br />\nshown the way and set the example to other colleges by eliminating from its<br />\nown members every trace of anything but pure college sport. Such an affair as<br />\nrecently happened at Harvard in regard to the standing of Cutts and at Yale in<br />\nregard to Glass, is impossible under the rules of the Maryland League.<br />\n<br />\nt<br />\n<br />\nANOTHER TALK WITH WALTER.<br />\n4 43 HOPE this razor don't pull, sir; I just sharpened it on the face of a<br />\nfreshman, sir, and it ought to be in good condition. He is a nice boy,<br />\nsir; he says that he goes to bed at ten o'clock because he is on the track<br />\nteam, sir. It's strange how a freshman takes to the track team, sir. One gentleman, sir, said that it was Mr. Mackdermott's persuasive powers of speech, sir.<br />\n\"'Everybody must get on your marks,' he shouts.<br />\n\"'Heavens,' says a freshman from the Eastern Shore, sir, 'el my family<br />\ngot on to my marks, I'd have to do some studying.'<br />\n\"After the freshman has been properly instructed by Mr. Mackdermott,<br />\nthe captain, and the manager, sir, then Mr. Mackdermott yells 'Get set.'<br />\n\"At that, sir, don't you know, sir, they all lifts their backs like a cat that<br />\nsees a strange dog. Then, sir, somebody falls over the line, and the rest laugh.<br />\nBut you have to see it, sir, I can't tell you about it.<br />\n\"Yes, there were great games in the cage on S urday, sir. Before the<br />\ngames, the freshmen were covering everything in sight; but as yet they have<br />\nnot covered themselves with glory. What were the games for, sir? Why, to<br />\nshow the world some fast Hopkins boys!<br />\n\"Thank you, sir, that's three you owe me for, sir. Call again, sir.\"<br />\n<br />\n\f17<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nA boil in the pot is worth two on the neck.—Cornell Widow.<br />\nTo have a white elephant on your hands is bad, but to have one on your<br />\nfeet is worse.—Cornell Widow.<br />\nSnakes and fleas are not alike;<br />\nWe need not analyze them far—<br />\nSnakes on their own bellies crawl,<br />\nWhile fleas are not particular.<br />\n<br />\n—Cornet Widow.<br />\n\"There are only two causes of the evil in this world—only two possible<br />\ncauses,'—, says Professor Hume,—\"man is one, and woman is the other.\"—<br />\nToronto Varsity.<br />\nVisitation, conversation,<br />\nContemplation, perturbation;<br />\nPalpitation, resignation,<br />\nOsculation, exultation.<br />\nPublication, preparation,<br />\nCongregation, 'gratulation;<br />\nTransportation, meditation,<br />\nLamentation, condemnation.<br />\n—The Bachelor, Washington University.<br />\n<br />\nAN EXAMINATION IN HISTORY<br />\n<br />\ni.<br />\n<br />\n[Respectfully submitted to the consideration of the proper authorities.]<br />\n1. Give a brief outline of Frankish history. Did Charles Martel personally<br />\nconduct Tours? Was Pippin an apple of discord among the Franks?<br />\n2. Who was Constantine? Constantius? Cornstarch? Tell something about<br />\nGeiseric's brother, Goldbric. Was Rome captured by Paregoric? Who was<br />\nCandlestic?<br />\n3. Compare the careers of Stilieho and Bilighote.<br />\n4. Was Mohammed a Buffalo? Who was Ali? Was he the person known<br />\nafter death as Paradise Ali?<br />\n5. Were any coon songs written in Medinah? Who wrote the Mohammedan hymn, \"Islam, lam, lam\"?<br />\n6. During the persecutions of Diocletian, how long did it take an early<br />\nChristian to become a late one?<br />\n7. In history, which of a Roman's ears is known as the Roman frontier?—<br />\nHarvard Lainfioon.<br />\n<br />\n\fApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\n<br />\nNICD 1=?LJ 1E3<br />\n<br />\nJe<br />\n<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br />\n<br />\n321 W. Baltimore Street.<br />\n<br />\nCHESAPEAKE RUBBER COMPANY,<br />\nE3<br />\n<br />\n.,<br />\nS 8c_ CC)<br />\n675 West Baltimore Street,<br />\n<br />\nWEST BALTIMORE LOAN CO<br />\n<br />\n.Between Arch and Pine Sts. Baltimore, Md.<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\n<br />\nOPEN<br />\n<br />\nFROM<br />\n<br />\nA.<br />\n<br />\nT<br />\n<br />\nM. TO<br />\n<br />\nSATURDAYS<br />\n8 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM<br />\n<br />\nCO.<br />\n<br />\nSMITH, DIXON<br />\nPftli'Lli<br />\n<br />\nPluores<br />\nf<br />\nD<br />\n\"<br />\n<br />\nramin.<br />\n<br />\nBaltimore, Md.<br />\n<br />\n29-31 S. Charles St.<br />\n<br />\nMANUFACTURER<br />\n<br />\nUNTIL 10<br />\n<br />\nP<br />\n<br />\nM<br />\n<br />\nFRAME &<br />\nPURNELL co.<br />\n224 N. HOWARD ST.<br />\n<br />\nor<br />\n<br />\nOreelt 1Letter<br />\nA. H. FETTING, fratertutp<br />\n3-eweltr.<br />\n14<br />\n<br />\nAND<br />\n<br />\n16 ST. PAUL STREET,<br />\n<br />\nBALTIMORE, MD.<br />\nPLEASE CALL AND EXAMINE OUR LINE REfORE<br />\n<br />\nPUN :HARING.<br />\n<br />\nJ. H. ROBINSON.<br />\nMANUFAOTURER<br />\n<br />\nOW<br />\n<br />\n— * FINE• CIGARS.•<br />\nONALMH<br />\n<br />\nFINE<br />\n<br />\nBonbons, Chocolates,<br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br />\n<br />\n1N<br />\n<br />\nTOBAcXx.), orowits AND NIMOKEHS' AICTICIGICE4,<br />\nSTAmioNEHy.<br />\n<br />\n14 EAST BALTIMORE STREET.<br />\n<br />\nBALTIMORE. MD.<br />\n626 N. EUTA W ST.<br />\nBaltimore, Now York & Philadelphia Papers.<br />\nC. & P. Public Telephone, Madison 11155Y.<br />\nDesigning and Cutting by E. Michaelson.<br />\n<br />\nE. MIGIVirELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nALTERING AND REPAIRING<br />\n<br />\n821 rladison Avenue,<br />\nSpecial discount to Students.<br />\n<br />\nBfILTIMORE, MD.<br />\n<br />\nA. D. SMITH & SONS,<br />\nFirnmeriv<br />\nLEVERING tic SMITH.<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ltioies, Misses<br />\nand Children.<br />\nTn the Latest Deetunn.<br />\nMEN'S HATS Dcrliys and Soft Felts.<br />\n<br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br />\n<br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLad lea' and Gentlemen's Dining Worm.<br />\nMeals Served at all Hours.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\n804 UNION TRUST BUILDING,<br />\nN. E. COI'. Charles and Fayette Sts.,<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., D.0.,<br />\nFrost. & Mgr.<br />\n<br />\nholiday<br />\nWedding Silver 6u<br />\nts<br />\nIN ARM VARSITY.<br />\n<br />\nsiiversmitbs.<br />\n.34<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nStudent's Supplies.<br />\n<br />\nJAMES R. Pants.<br />\n<br />\nTHRO. WARNUR.<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nJACOBI & JENKINS.<br />\nSte N. CHARLES ST.<br />\n<br />\nH. MDMAINS, D. O.,<br />\nSoo'y. & Treas.<br />\n<br />\nMARIA BUIE, 9,0.,<br />\nV.-Prost. & Asst. Stio'y.<br />\n<br />\nMadison&HowardSts.<br />\n<br />\nW.A.FRINIER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgrnt for Lincoln & Bennett and<br />\nWalter Bernard's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere Hats.<br />\n<br />\nCUSHING & COMPANY,<br />\n<br />\n34 W. BALTIMORE ST.<br />\nLAU/ ONSIDICAL. CLASSICAL AND MISOSLL•PISOU• SOUS<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman eik Son,<br />\n<br />\nII. R. E1SENBRANDT SONS,<br />\n<br />\nfor<br />\n<br />\n701 to 705<br />\nMADISON AVE.<br />\nof<br />\nsubmitted<br />\nSamples<br />\nfollows:<br />\nReads as<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nquality.<br />\nsuperior<br />\nof<br />\npure,<br />\nPort—absolutely<br />\nOporto<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nMix Ground Spices —no adulteration, all strictly pure.<br />\n<br />\nBookseller's and<br />\nStationers.<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nJORDI1N SMBLER GO.<br />\n<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharlcs I'. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\n<br />\nSurplus and Profits $450,00n.<br />\nCapital. $660.000<br />\nAccounts of Ranks, Corporations, Firms and Individuals<br />\nin accordance with<br />\nextended<br />\nsolicited. Facilities<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE. MD.<br />\n<br />\nSouth and Lombard Sts., Baltimore.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAUE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nDIRECT.<br />\n<br />\n\ftbe Itran3=Smith<br />\npiano CO.<br />\n<br />\nMANDOLIN. GUITAR AND BANJO Jwg JI jS<br />\nTAUGHT OW<br />\n<br />\nC. J. LEVIN•<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Charles St,<br />\n<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nflgenfraz (5iudio<br />\n<br />\nChicitertng, 13rabburp anb lalIebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\n.ag<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nBaltimore<br />\n<br />\nHABERDASHERS,<br />\n<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON BALE THE 1. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203W.BALTIMORE ST. & 2 S. LIBERTY ST.<br />\n<br />\n.4 !pianos. .4 .4<br />\nFactory Prices.<br />\n<br />\nO. & P.'Phone 2322-2.<br />\n<br />\nSMITH'S 8°HaIT'BO011eg\"B<br />\nOLD<br />\nBOOK<br />\nN. HOWARD STREET,<br />\nSTORE.<br />\n•<br />\n3rd door from Madison.<br />\n805<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ;<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE c& CO.,<br />\nBANKERS & BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MI),<br />\n<br />\nThe Chas. Rims Surgical Instrument Company<br />\nBENJ. A. NELSON,01N'L MANAGER<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged . . ..<br />\nWM. V.PIPPEN,<br />\n<br />\n6o5<br />\n<br />\nN. Eutaw Street.<br />\nA. H Rutherfoord.<br />\n<br />\nJ. Wm. Middendorf,<br />\n<br />\nR. Lents.<br />\n<br />\nA.J. Robbins.<br />\n<br />\nJ. WM, MIDDENDORF & CO.<br />\n113ankers & Ifirohers.<br />\n<br />\nPhysioians,' Burgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\nBaltimore, Md.<br />\n30o N. Howard St.,<br />\n<br />\nMembers<br />\nBaltimore Stock E xchatige.<br />\n<br />\nDrovers and Mechanics National Bank,<br />\n<br />\nBOOKS AND STATIONBRY<br />\n<br />\nOF BALTIMORE. MD.<br />\n<br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br />\n<br />\nYOUR EYS<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\nMil North Charles Street.<br />\n<br />\n(Masonic Temple.)<br />\n<br />\nOPTIGI*NS.<br />\nTHE NEWS LETTER<br />\n<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br />\n<br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\n<br />\nr..24:=.. SOS<br />\n<br />\nmt.,<br />\n<br />\nY. M. C. A. BUILDING.<br />\n<br />\nC. & P. and Md.'Phones.<br />\n<br />\ncAll. ON<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nJR'S. It. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TC PA PLS.<br />\n<br />\nFOR Class, Fraternity and College Stationer?,<br />\n7---Banquet Cards, Invitations, Diplomat/.<br />\nPrograms, Visiting Cards, etc. ..... •<br />\n<br />\nOur 60e J. fl. U. Bine and Black Plea Paper—now ready.<br />\nThere Is very little entertainment at home without a Plano<br />\n<br />\nIs from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\n<br />\nSTATION E AS<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\n5TIEFF<br />\nP1ANos<br />\n9 N. Menu St.<br />\nilre The Best.<br />\n<br />\n\f", "format": "basic_html", "processed": "•JANURRY 29, 1902.<br /><br />\nVol. VI. No.<br /><br />\n)<br />\n111100.14.4<br />\n014.11100•0140*116<br /><br />\n1111104.<br /><br />\n11101111<br />\n.$111A.10.177.111erli•<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORE, MD.<br />\nI.<br /><br />\nTwenty-Sixth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDoan of the Colleue.<br />\n.<br /><br />\nIRA REMSEN.<br />\nWM. II. HOWELL.<br />\nEDW. IL GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arta. (Courses for candidates for the degree of Ph. D.)<br />\n(10 In Medicine. (Courses for candidates for the degree of M. D.;coursas for physicians.)<br />\nFor Undergraduates:<br />\n(0) As candtdatem for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n•<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysies,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy.<br />\nPhyslidogy<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,!<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br /><br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br /><br />\nDirectors.<br />\nlie Ifernsen.<br />\nJoseph S. Ames.<br />\nWilllain li.<br />\nrh<br />\nWilliam K. Broaks.<br />\nFranklin P. Mall.<br />\nWilliam. IL Howell.<br />\nIL Welch.<br />\nJahn .1. Abel.<br />\nJohn.!. Abel.<br />\nOder.<br />\nIHrectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Btootufield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Ref lit.<br />\nJ. M. Vincent.<br />\n.T. H. Hollander,<br />\nPrank Morley.<br />\nJoseph S'. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,, Editor. Quarterly. 4to. Volume XXIV<br />\n• in iirogreas. $5 per volume.<br />\nH. American Chemical Journal.<br />\nI. REMSEN,Editor. Monthly. 8vo. Volume XXVI<br />\n' in progress. $5 per volume.<br />\nIII. American Journal of Philology.<br />\nII. L. GILDERSLEEVE, Editor. Quarterly. 8yo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory. Bye.<br />\nVolume V complete. $5 per Volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4W.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur A msyriologie,etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXI. Modern Language'Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Do. Volum*<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Ili-monthly. /Ivo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 4to., e5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey,<br />\nWILLIAM B. CLARK, Editor.<br />\nxi% Terrestrial Magnetism and Atmospheric Flee.<br />\ntricky.<br />\nL. A. BAITER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trutttees, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and statint<br />\ntime regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nGroups.<br />\n1.<br />\n(the \"Old College con roe.\")<br />\n2. Classical<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Chemical-Biological.<br />\n(leading up to Medicine.)<br />\n4.<br />\n15. Latin Mathematical.<br />\n6. Historibal-Political.<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nMaria! Publications.<br />\nEditors.<br />\nMathematics(vol. XX IV.)<br />\nPrank Marley.<br />\nChemistry (vol. XXVI).<br />\nIra Itemsen.<br />\nPhilologc(vol. XX II.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XIX.)<br />\nJ. M. Vincent<br />\nModern augueges(vol. 3CVT.)<br />\nA. Marshall NIllott.<br />\nBiology (vol. ;IV.)<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nA say ology (vol. IV.)<br />\nExperimental Mediciue(vol. VT.) W. H. Welch.<br /><br />\nProgrammes of the Conrses offered to graduate students in Philosophy and the Arta, and in the School of<br />\nMedicine,and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nIn teblition to the eerialmabove named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critienl Edition of the Hebrew Text of the Old<br />\nTestament. Nclited by Prof. Paul Haupt. Prospectee On a ppl'cation.<br />\nRowiand's Photograph of the Normal Solar Spectrual•<br />\n10 plates. $20.00<br />\nDemeription of the Johns IfonkIne Hospital. J. S. Billings, Editor. 1111 pp. 4to. 111 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete tae-simile edition. Edited by J. Rendel Harris. 110 pp. 4W. 10<br />\nplates. WOO<br />\nReproduction in Phototype of Syriac MSS. with Antilegomens Epistles. Edited by 1. II. Hall. $3.00.<br />\nBibliographta llopkinsionsia. Part I. Philology. Par\"<br />\n11-1IL Chemistry, Mineralogy and Geology. Parts<br />\nV-V- V I.Physics, Astronomy and Nlathernatios.<br />\n8 vo. 30 cents per part.<br />\nfull list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remIttanosS<br />\nman be sent to Johns tioukins Press, Baltimore, Md.<br /><br />\nr,.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nJANUARY 29, 1902.<br /><br />\nNo. 8.<br /><br />\nTHE RECEPTION AT THE MEDICAL SCHOOL.<br />\njOPKINS students have always had a just cause of complaint in the lack<br />\nof personal intercourse between teacher and pupil at the University. For<br />\na few hours each week they come in contact with each other in the class<br />\nroom, where the instructor must always remember he is the instructor, and the<br />\npupil must always remember he is talking to his teacher. Man to man they<br />\nnever meet, and even the adviser system, which offers such bright prospects on<br />\nmatriculation day, has descended with most of us to the formality of a signature.<br />\nThe great influence which the faculty members, as men, could exert on the<br />\nstudents is entirely neglected except for a fortunate few. Though home students<br />\nof course do not feel this so much as those from out of town, the state of affairs<br />\nis noticed by all.<br />\nThe faculty has made the first move in relieving this condition by inaugurating a series of informal meetings, at which graduate students, medical students and undergraduates have the opportunity of meeting each other and<br />\nThe announcement of the<br />\nmembers of the faculty—also their wives.<br />\nfirst meeting, which was held Saturday night, produced some little mysterious wonder among the students as to what the \"informal meeting\"<br />\nmeant. Consequently there were not as many undergraduates present as<br />\nmight have been, though quite as many as could be expected for the<br />\nfirst meeting. A very large proportion of the medical students was present, and<br />\nalmost all the faculty. The married members of the faculty generally brought<br />\ntheir wives.<br />\nThus when President Remsen stepped on the platform in the hall of the<br />\nphysiological building, he had to face a large and interesting audience. Outlining the purpose of this meeting, he stated that it was the first of a proposed<br />\nseries to demonstrate the human side of the instructors to the students; to offer<br />\na means of bringing the different classes of students together in personal intercourse, and to promote a closer fellow-feeling all around. That this aim was<br />\nappreciated by most of the audience was testified by the applause which greeted<br />\nDr. Remsen as he stepped off the platform to make way for Professor Bloomfield, who gave a short account of his reproduction of the famous Kashmirian<br />\nAtharva Veda.<br />\nDr. Remsen had made a particular request for informality, and after the<br />\ntalk by Dr. Bloomfield, student and prof. mingled together much more than<br />\nthey had done before. Refreshments were served, after which a chance was<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\ngiven to sow the seed of that personal intercourse which President Remsen<br />\nsaid was the object of the meeting. The newness of the affair at Hopkins<br />\nwas somewhat of a drawback to its complete success, but those of the fellows<br />\nwho were lucky enough to meet the \"big men\" of the faculty, their wives, and<br />\nthe co-eds of the medical school, thoroughly enjoyed the evening. The only<br />\ntrouble was that not enough men had that pleasure—a state of affairs probably due to a combination of their own backwardness and too much formality<br />\nin the atmosphere. However, the affair was an excellent beginning of what<br />\nought to be an excellent project, and if the students only attend future meetings with the proper spirit, and the formality is a bit reduced, there is no reason why the results from it can not be all that is desired. These meetings, if<br />\nkept informal, certainly ought to produce a better spirit here.<br /><br />\nMUSICAL CLUBS AT FOREST GLEN.<br /><br />\nt<br /><br />\nHE Musical Clubs gave a concert at the National Park Seminary on Monday night, January 27. The men left on a private car by the Baltimore<br />\nand Ohio at a little after five o'clock, and arrived at Forest Glen, Md.,<br />\nat 7.30. Here a light supper was served, and then the men wandered reluctantly from the beautifully-decorated dining-room to the concert hall. Here<br />\nmore than two hundred of the girls and their friends were assembled, and even<br />\nthe worst music won applause. The Glee and Banjo Clubs vied for first place<br />\nin point of excellence, and their leaders should he congratulated. After a short<br />\nprogramme, refreshments were served, and the men made the best of their opportunities till the manager called time, and the Clubs were once more homeward<br />\nbound. This concert did much to get the Clubs in line for the Baltimore concert of February 14, which is always the crucial test of the year.<br /><br />\nTHE BALTIMORE CONCERT.<br /><br />\nZHE<br /><br />\nJohns Hopkins Musical Clubs will give their most important concert<br />\non the night of February 14, in Lehmann's Hall. This date was judged,<br />\nafter much consideration, to be the best time to give the concert, as it will<br />\nnot conflict with any of the various athletic games that are being arranged for<br />\nFebruary. What the condition of the Clubs will be at that time is a matter of<br />\nspeculation, as there is still some time before the event. Still, if rehearsals are<br />\nkept up and the men work as hard as they have been doing lately, there is little<br />\ndoubt but that the concert will be unusually interesting and successful.<br />\nIt is hoped that more of the student body will be present this year than<br />\nformerly, for heretofore the clubs have received most of their support from those<br />\noutside of the University. This obviously should not be so, for the musical<br />\norganizations are part of the college life, and should receive the same support<br />\nthat is accorded to athletics. Especially should the clubs receive support this<br />\nyear from the whole student body; for, in giving the Athletic Association the<br />\nhundred dollars to help found a training table last year, the clubs left them-<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nselves in a bankrupt condition. In order to help the organization to meet the<br />\nheavy expenses that are necessary to maintain it, the faculty, graduate students,<br />\nand under.graduates are urged to attend this concert. If more interest were only<br />\nshown by the University in this annual concert, the clubs could each year<br />\nmaterially aid the various athletic enterprises.<br />\nIn order that each member of the University may have an opportunity to<br />\npurchase a ticket, the faculty and various departments and classes will be so<br />\ndivided amongst those having this matter in charge, that no one this year will<br />\nbe able to say that he was not approached on this subject, and so was not present at the concert. If all the athletes and others would co-operate with the<br />\nmembers of the musical clubs, a successful concert would be assured, and the<br />\nhigh standard of previous years maintained.<br /><br />\nANOTHER APPROPRIATION.<br />\nT the last meeting of the \"1901 Hullabaloo\" board, held last week at the<br />\nhome of the editor-in-chief, Mr. John G. Machen, affairs were finally<br />\nsettled. Mr. Harry S. Byrne, the business manager of the book, re<br />\nported a successful sale which netted a surplus of over forty dollars. The board<br />\nwas much pleased with the administration of Mr. Byrne, and voted him a resolution of thanks and congratulations. Mr. Machen and Mr. Byrne were appointed a committee of two to deliver the money to the treasurer of that organization which might make best use of it. The appropriation will probably be<br />\ndevoted to athletics, very likely to increase the bank account of the \"field\"<br />\nfund. On behalf of the student body the NEWS-LETTER begs to thank the<br />\nHullabaloo Board for their generosity.<br /><br />\nTWO LIBRARY NOTES.<br />\nCENTURY of thousands is now the official catalogue number of books<br />\nin the Hopkins library. The library assistant made out the card for the<br />\n100,000th book last week, though the number in the collection really<br />\nconsists of some three or four thousand more which have not yet been catalogued. These include the gifts of the late Prof. Herbert B. Adams who left<br />\nto the University his complete library, which is still in a somewhat disordered<br />\nstate. The growth of the library has been fast, and each year has seen added<br />\nto its shelves ancient and modern documents of value and interest. The NEWSLETTER hopes to publish in a near issue the story of this growth as told by one<br />\nof the gentlemen connected with the library staff since the beginning of the<br />\nUniversity.<br />\nAnother note of interest is the purchase of a new and handsome cabinet for<br />\nthe royal works of Frederick the Great given to the University by the present<br />\nEmperor of Germany. The cabinet is a master piece of the wood carver's art,<br />\nand is a worthy case for the books it is to contain. The engravings of the seals<br />\nof the German Empire and of the University attract the attention of all who<br />\nhave seen the cabinet.<br /><br />\n4<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br />\nLECTURES OF A FORTNIGHT.<br /><br />\nZ<br /><br />\nHE second and third of Dr. Gilman's lectures on the general subject of<br />\nUniversity Education were delivered on January 18th and 25th. Dr.<br />\nGilman's lectures are attracting widespread attention, since, without<br />\ndoubt, he is one of the greatest living authorities on the subject of advanced<br />\neducation.<br />\nSaturday, the 18th, Dr. Gilman spoke upon \"Original Research—Its<br />\nantiquity; Its modernity; Its opportunities, and its methods\" He traced the<br />\nhistory of Original Research from ancient times to the present day, and said<br />\nthat modern science owes a great debt to Lord Bacon, who was one of the first<br />\ngreat scientists of modern times. As regards the last quarter of the 19th<br />\ncentury, Dr. Gilman said that great advances in Original Research had been<br />\nmade in this country. \"And our own Johns Hopkins,\" he continued, \"has<br />\nbeen in the front rank of all this vast work. In the beginning we were not<br />\nhampered as we are now, and our work then received the highest commendation<br />\nat home, and abroad.\" To those contemplating research work, Dr. Gilman<br />\nmade some practical remarks, and said that necessary qualifications were: native<br />\ntalent, good teachers, time, patience, knowledge of things, and imagination.<br />\nOn last Saturday, Dr. Gilman took for his theme: \"Scholarships, Fellowships, Burses, and Prizes.\" Ambition in its good and had sense was first<br />\nspoken of, Dr. Gilman explaining how it depended upon the motive of the<br />\nperson. It was with pleasure, he said, that he had always found academic<br />\ncircles governed by the proper kind of ambition: the desire to be honored for<br />\nspreading knowledge, and benefiting humanity. Fellowships, according to Dr.<br />\nGilman, can be traced to the Younger Pliny, though properly they begin with<br />\nthe dawn of the Universities in the 13th century. Continuing, Dr. Gilman gave<br />\nan account of the establishing of fellowships at Johns Hopkins, which was the<br />\nfirst American college to adopt the system. These scholarships brought to<br />\nHopkins a body of students, of whom any university might be proud. The<br />\nsubject of prizes was next taken up, Dr. Gilman explaining the difference<br />\nbetween them and fellowships. In closing, Dr. Gilman made a number of<br />\nvaluable suggestions regarding the founding of scholarships.<br />\nProfessor Richard G. Moulton, director of the department of English at the<br />\nUniversity of Chicago, is delivering a course of six lectures on the general subject of \"Ancient Tragedies for English Audiences.\" Professor Moulton is a<br />\nfascinating speaker, and the large crowds attending the lectures have the<br />\nGreek tragedies presented to them in an intensely interesting manner.<br />\nUnder the auspices of the Baltimore branch of the Archwological Society<br />\nof America, of which Dr. Kirby F. Smith is secretary, Miss Harriet A. Boyd of<br />\nSmith College delivered an illustrated lecture on the afternoon of the 17th in<br />\nMcCoy Hall. Her subject was \"American Excavations in Crete, 1901.\" Miss<br />\nBoyd gave an account of the work done by the archaeologists in the East, and<br />\nshowed many interesting views of the country, and of the discoveries made there<br />\nduring the past year.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nWHEN THE GAME WAS ENDED.<br />\ng staggered off the field into the arms of his friends with an exhausted,<br />\nthough glorious feeling. This was the greatest day of his life. From<br />\nnow on he was one of the heroes of Hopkins. How short a time ago it<br />\nwas, that he seemed to have no chance for the varsity, though all along he felt<br />\nthat all he. needed was a trial chance, that the other man's reputation of last year<br />\nwas all that stood between him and the coveted place on the team. None of<br />\nthe scrubs worked harder than he, but there did not seem to be any likelihood<br />\nof his getting into a game. How kind fate had been to him! Three days before<br />\nthe big game, the one that would decide the championship, the varsity man had<br />\nwrenched his shoulder, so that the scrub had been given the place. The shouts<br />\nof the multitude told what use he had made of the opportunity. It was his<br />\nclever stroke that had shot the deciding goal, and the University's victory was<br />\ndue to him. When there seemed to be no hope he had snatched victory from<br />\nthe hands of defeat.<br />\nAs cheer after cheer came over the field it was like the sound of heavenly<br />\nmusic. He saw some one coming with a sweater blazing with a golden \"H,\"<br />\nand stretching forth his<br />\n\"Say, Freshman, come out of that trance, and get into this cheer.\"<br /><br />\ng<br /><br />\nQUI FILE?<br />\n\"Quelle est eette etoile qui file,<br />\nQzti file, file, et disparait?\"<br />\n—thIRANGER.<br /><br />\nWho is that whose star is falling?<br />\nWho is that whose prestige wanes?<br />\nWont to hear all men him calling,<br />\nNow in vain his scepter claims.<br />\n'Tis the man we held in power,<br />\nOnce his name to us was all,<br />\nNow his sand has passed the hour,<br />\nGreat was his fame and great his fall.<br />\nFreshmen, who have had no fear,<br />\nJuniors, who have rushed the cane,<br />\nWill you, in the coming year,<br />\nSeniors, hold the palm again?<br />\nBe not haughty, curb your glory,<br />\nDefeat and Pride go hand in hand.<br />\nIn college, 'tis the same old story,<br />\nYou'll find no winner in the band.<br />\n0. M.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tint JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nJANUARY 29, 1902.<br />\nSubscription $1.50 per year.<br /><br />\n10 Cents a single copy.<br /><br />\nSOL STROUSE, 1902.<br />\n.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nAssistant News Editors,<br />\nHARRY K. TOOTLE.<br />\nJOHN A. SLEMONS, 1902.<br />\nAthletic Editors,<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nArt Editor,<br />\nPEARRE, JR., 1902.<br />\nAUBREY<br />\nBusiness Manager,<br />\n. HARRY BAETJER, 1903.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to SOL STROUSE, box 557, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n.<br /><br />\nMISTAKE was made in our Athletic columns last issue, which we desire<br />\nto rectify. In the report of the meeting of the Maryland Intercollegiate<br />\nAssociation it was stated that a \"protest was registered against the Hopkins, on account of their playing graduates on their various athletic teams.\"<br />\nThe writer of the article was misinformed as to the meeting, as absolutely no<br />\nprotest was registered against Hopkins for any account whatever. At the meet<br />\ning held on January 18, a discussion of the condition of the Association and<br />\nits place in Maryland athletics resulted in a unanimous decision to keep up the<br />\nAssociation. We deplore the impression which the article produced on the<br />\nstudent body.<br />\nHOUGH one vacant position on the NEws-LETTER has been filled by the<br />\nelection of a junior to the staff, in a few weeks one or two more vacancies<br />\nwill occur, which in all probability will be filled from the freshman class.<br />\nAlready a cheering amount of work has been done by contestants from the class<br />\nof 1904 on all variations of literary lines. The work on the whole has been<br />\nsatisfactory, and the contestants should not feel discouraged at not seeing their<br />\ncontributions in print, as many things besides literary excellence must be taken<br />\ninto consideration in posting up an issue. Every man who is trying for a position should keep up working, and work heartily. In a discrimination between<br />\ntwo equally good men, it is generally the \"early bird catches the worm.\"<br /><br />\nt<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\nHE Feed and Reunion which is going to be held on Friday of this week<br />\npromises to be one of the best ever held here. As announced in the last<br />\nissue of the NEWS LETTER, the feed is the only general student meeting<br />\nheld during the year, and for that reason it is generally well supported by everybody. The program, which is given on another page of this issue, includes<br />\ntalks by President Remsen and several members of the faculty, so that this will<br />\nbe the first time that Dr. Remsen addresses the students in his new capacity.<br />\nTo the older men we need say nothing about the attractions offered at these affairs, but we do want to impress on the freshmen the urgency of their attending en masse. The committee is also desirous of having present all Alumni<br />\nwho can possibly attend, and the medical student or the grinding grad who can<br />\nspare an evening to the pleasures of life will be doubly welcomed.<br /><br />\nt<br /><br />\nO<br /><br />\nN January 10th, Mr. Frank Moss, who was prosecuting attorney for the<br />\nfamous Lexow Committee, delivered a lecture before the students of Lehigh University on ''Morality and Politics.\" He told of his share in the<br />\ninvestigation of political corruption in New York, and described graphically<br />\nsome of the raids on the \"policy shops\" which used to thrive under police protection. He gave examples from his personal knowledge of open dishonesty<br />\namong city officials, and of the co-operation of respected citizens of New York.<br />\nSuch a talk, delivered by an able man like Mr. Moss, thoroughly conversant with his ground, could not fail to attract and benefit any American student,<br />\nwho looks forward to his personal responsibility in the body politic. If these<br />\nmen of affairs were more often invited to the University, the five o'clock lectures<br />\nwould become vastly more popular with the under-graduates, and would be to<br />\nthem a good training for the part they are to play in the vital affairs of government and citizenship.<br /><br />\nURING the last foot ball season the Hullabaloo yell was found to be not<br />\nas serviceable as some shorter yells which were adopted. As a rule<br />\nthese yells were \"benevolently assimilated\" for the occasion from some<br />\nof our intercollegiate friends, and for that reason were only temporary. The<br />\ncontrast between our own Hullabaloo and those shorter war cries was too evident' to need comment, and shows the immense superiority of a hard monosyllabic cry over a long one like the Hullabaloo. The Hullabaloo is a beautiful yell, but its beauty is greater than its practical use, and it ought, therefore,<br />\nbe supplemented by some other shorter and more concise cry. The NEWSLETTER would like to receive from the student body or from Alumni original<br />\nyells, whose use shall be mainly for athletics, and which will \"carry\" across<br />\nthe athletic field with more effect than the Hullabaloo. Monosyllables should<br />\nbe employed in making a new yell.<br /><br />\n9<br /><br />\nTHE NEWS—LETTER.<br /><br />\n1111111111IMMIIN 1101111111111111111111111111111111111M111111111111111111111111111111P11111111111111111i111111<br />\nNifinllelniiumulumitionmoma<br />\n.„<br /><br />\n6<br />\nAIMIIIIIIMIVIIIIIIIIIII1111111111111111111011MMIMIDIPAINIIIIIIIVIIIIINIMMIIIIIIIIIMPIIIIMIIMIIINMUNIMMIIIIIMIMINI<br /><br />\nITIIIII01:11:0;;;;11;liidla;liiN<br /><br />\n111% R. JACOB H. HOLLANDER and Dr. G. E. Barnett, of the department of<br />\nEconomics, will spend Thursday and Friday of this week in New York,<br />\nwhere they expect to attend the meeting of the Jewish Historical Association, of which Dr. Cyrus Adler, formerly of this University and now at the<br />\nthe Smithsonian Institute, is President. Dr. Barnett will read a paper before<br />\nthe Society.<br />\nMr. R. H. Wright, of the Historical Department, is at present acting as<br />\nsubstitute in the place of Professor Ebaugh of the Baltimore City College. The<br />\nlatter has accepted a position as instructor of mathematics in one of the New<br />\nYork schools.<br />\nLast Friday night the Historical and Political Science Association held an<br />\ninformal celebration in the historical library to commemorate the 472nd meeting<br />\nof the organization. The principal paper was read by Prof. Ramage of the<br />\nUniversity of the South. On Friday, February 21 , the Association will hold a<br />\nre-union, to which all the old Hopkins members will be invited. Dr. J. Martin<br />\nVincent has charge of the arrangements. On the 500th anniversary of the<br />\nAssociation, a large celebration is to be held.<br />\nA movement is on foot at the University of Maryland to form a club among<br />\nthe Hopkins men who are studying there. We have a large representation<br />\namong the future lawyers, and the idea seems a good one.<br />\nThe Hopkins Alumni banquet will be held on the night of February 22 at<br />\nthe Music Hall. A large number of out of town Hopkinsonians will be here on<br />\naccount of the celebration at that time, and the occasion promises to eclipse all<br />\nothers held in former years.<br />\nMr. George Cator, who was awarded a university scholarship by the board<br />\nof university studies, has waived the emolument. His action has been approved<br />\nby the board.<br />\nWithin the next few days, a picture of the class of 1901 will grace one of<br />\nthe corridors of McCoy Hall.<br />\nAt a meeting of the Junior Class last week, Mr. Mr. H. K. Tootle was<br />\nelected toastmaster for the annual class banquet which will be held about<br />\nFebruary 11. Tootle made such a decided hit in that capacity last year that<br />\nhis election was unanimous.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n9<br /><br />\nMr. Roy Williams was elected captain of the Junior Track Team. Williams<br />\ncomes from Lehigh, where he gained distinction for himself as a runner. He<br />\nhas turned out regularly with the Hopkins Squad this season, and is expected<br />\nto show himself in the coming B. A. C. and J. H. U. games.<br />\nFred C. Blanck was elected anchor-man on the Junior Tug-of-War Team,<br />\nwhich will pull against the Freshmen at the athletic feed on January 31.<br />\nThe Junior Class decided unfavorably upon the question of supporting the<br />\nSeniors in holding a senior promenade; and as not enough men could be gotten<br />\nfrom a single class to fill McCoy Hall, the idea has been abandoned.<br />\nThe Freshman Class has elected Strohbar supervisor of class athletics in<br />\ngeneral, and Branham captain of the class track team.<br />\nThe written challenge sent by the Freshmen to the Juniors regarding the<br />\nrelay race, which came off last Saturday, was a rather officious proceeding for<br />\nsuch verdant youths. It signifies that they are at last beginning to regain<br />\nconfidence in themselves after the troublous times of the past.<br />\nThe Freshmen deserve congratulation for being the first class for several<br />\nyears past which has enforced the law regarding the wearing of class numerals.<br />\nThe Juniors took action in the matter early in the year, but the Freshmen were<br />\nthe first to appear with their numerals on their jerseys.<br />\nThe Juniors have not yet succeeded in persuading the Dean that it will be<br />\nhighly beneficial for them to take a day off and attend a Session of Congress in<br />\na body- Strange to relate, the Dean does not think that the Juniors derive the<br />\nbenefits for which they endure a tiresome journey to distant Washington. Such<br />\na thirst for knowledge should certainly be quenched, by the Dean's consent.<br />\nThe piteous appeals and heart-rending cries which issue from McCoy Hall<br />\nalmost every day do not mean that murder is being done or that the place is<br />\nafire. The unoffending Freshmen are preparing for the oratorical contest.<br />\nHopkins students may be pleased to know that Dr. Nicholas Murray Butler,<br />\nrecently elected president of Columbia University, is a nephew of Mr. Nicholas<br />\nMurray, the Librarian of the Hopkins. Dr. Butler has frequently been to Baltimore to visit Mr. Murray, and has been entertained at the University Club.<br />\nSince the curtains have been placed on the cage windows, it is perfectly<br />\nsafe to bring ladies to the gym. However, some of our fair visitors may object<br />\nto not seeing so much of the Hopkins boys as formerly.<br />\nThe number of Freshmen trying for a place in their oratorical contest has<br />\nbeen narrowed down to five—Licking, Rosenheim, Shapiro, Hutnerichouse and<br />\nFoster. Diligent practice was begun on Monday, under the direction of Dr.<br />\nGuy Carleton Lee. About a week before the event, the number of speakers<br />\nwill be reduced to three, who will contest for the gold medal offered by Dr.<br />\nLee.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nAt the annual meeting and banquet of the Yale Alumni Association<br />\nof Baltimore, held on the night of the 18th, Dr. Bernard C. Steiner was<br />\nchosen president for the coming year, and Dr. Wm. H. Welch was<br />\nappointed a member of the executive committee to serve for three years. Presi<br />\ndent Ira Remsen responded to the toast \"Johns Hopkins.\" Extempore speeches<br />\nwere made by Dr. Steiner and Dr. Welch.<br />\nThe admirers of Dr. Guy Carleton Lee will be gratified to learn that his<br />\nbook, \"Historical Jurisprudence\" is being translated into both the German and<br />\nDutch languages.<br /><br />\nY. M. C. A. NOTES.<br />\n(<br />\n1pROF, HAUPT addressed the Graduate Students' Bible Class last Satur-<br /><br />\nday morning on \"The Song of Songs.\" His very helpful discussion<br />\nwas much appreciated by those present. Prof. Haupt is soon to publish in The Journal of Bzblzcal Literature, an article giving new renderings, and<br />\nshowing the correct order of \"The Song of Songs.\"<br />\nThe attention of all students interested in Bible study is called to the<br />\nexcellent course now being offered under Prof. Haupt's direction, by Dr. Foote,<br />\nmeeting Thursdays at 5 P. M. Dr. Foote is a very able literary and Biblical<br />\nscholar and Hopkins students should not allow his efforts in their behalf to be<br />\nenjoyed by outsiders alone.<br />\nThe Fourth Student Volunteer Convention will be held in Toronto, Canada,<br />\nFebruary 26—March 2. It promises to he the largest gathering of students<br />\never held, as 2,500 college men are expected to attend. The citizens of Toronto<br />\nare to entertain them all for the week of the conference. These conventions are<br />\ninternational, and are held every four years. Last time Hopkins sent one<br />\ndelegate; this year the association expects to have three representatives. The<br />\nExecutive Council has voted to pay the expenses of one delegate, and a collection is in progress among the members of the Association to defray the expenses<br />\nof another. Contributions may be handed to any officer of the Association.<br />\nThe General Secretary will also attend, as will Mr. C. W. Young, of the Medical School, president of the Baltimore Student Volunteer Band.<br /><br />\nVARIOUS NOTES FROM A FRESHMAN'S BOOK.<br />\nJanuary 9.<br />\nJanuary 10. As a general rule, gentlemen, it is best not to put prussic<br />\nacid in your mouth.<br />\nJanuary 11. In writing formal invitations, it is usually the thing to use<br />\npaper of a delicate lilac hue, and, though not absolutely necessary, it is most<br />\nexcellent to have in them in lingering perfume of Roger &amp; Gallait's cologne.<br />\nMusk and tobacco are hardly good form.<br /><br />\n11<br /><br />\nTHE NEWS—LETTER.<br /><br />\nJanuary 12. These stones, gentlemen, are not the original diamonds;<br />\nthose are in various other places. Therefore, in playing with them after lecture, it will hardly be profitable to slip them adroitly up your sleeves.<br />\nJanuary 13. Just make a noise. Don't care how you make it. Roar like<br />\nthe bull of Bashan; shriek like a woman at a bargain-counter; howl like those<br />\nin the dungeons of the damned; only make a noise.<br />\nJanuary 16. When people played cards in the olden times, they used one<br />\nsingle little candle; but in these days of modern lighting, when people play<br />\ncards, they have half a dozen acetylene lamps on the table; on the mantelpiece are whole rows of candelabra; around the walls are countless gas jets; in<br />\nthe hand of each man is a lighted bicycle lamp; and, suspended from the ceiling<br />\nare a dozen arc lights.<br />\nJanuary 17. It is perfectly simple how, when the cat falls, it lights on its<br />\nfeet: for, when beginning to fall, it sticks its tail between its teeth and chews it.<br />\nThis naturally causes the tail to fly back to the position of equilibrium, and<br />\nthus a rotary motion being established, the cat is enabled to light on its feet.<br />\nJanuary 18.<br />\nR. 0. '04.<br /><br />\nSWEET STOLEN FRUIT.<br />\nHours in the Library! Glad hours we loved!<br />\nChair tilted back into some cozy nook,<br />\nBy thoughts of tasks neglected all unmoved,<br />\nDead to the world, living within a book;<br />\nThe afternoons we left our work undone,<br />\nLeft apparatus safely stowed away,<br />\nLeft note-book closed, abandoned work for fun,<br />\nAnd in the Common Room loafed out the day;<br />\nThe mornings we were looking for a quiz,<br />\nAnd therefore cut the class, and stole away,<br />\nAnd strolled down town and saw Man as He is,<br />\nMan—ignorant of quizzes—work and play;<br />\nYears after we shall think on these and smile,<br />\nCast off our cares, again be boys awhile.<br />\n—P. W. '02.<br /><br />\nA story is going the rounds of the medical school which very strongly illustrates Lord Chesterfield's words \"clothes makes the man.\" A certain student in the first year, who is inclined ty corpulency, went down town to purchase a dissecting jacket at a local furZishing store. After trying on all the<br />\nwhite jackets in stock and finding none to suit, the student asked to see a colored jacket with small ornamentations in its design. A size 46 fitted him.<br />\n\"I'll take this,\" he said to the clerk. The clerk looked up astonished, and replied very seriously, \"But, my dear sir, you can't go behind the bar with that<br />\njacket.\"<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\nATHLETIC NOTES.<br />\nT was announced last week that our lacrosse team would not play the Cres•<br />\ncent Athletic Club this year. The reason for giving up such a \"fixture\"<br />\nas this game is on account of the lacrosse management being unable to<br />\narrange a date with the Brooklyn team. At present the schedule is:<br />\nApril 5, University of Pennsylvania, at Philadelphia.<br />\nApril 19, Harvard, at Baltimore<br />\nApril 26, Lehigh, at South Bethlehem. Championship game.<br />\nMay 10, Swarthmore, at Baltimore. Championship game.<br />\nManager Slemons attempted to arrange a game with the Crescents for April<br />\n12, but was unable to do so on account of conflicting dates. May 3rd was not<br />\npracticable, as it would be poor policy to put such a team in between the two<br />\nchampionship games. These dates will probably be filled by Columbia, Stevens, or C. C. N. V.<br /><br />\n3<br /><br />\nAt a meeting of the track and field team held a short time ago, Mr. Murk land was chosen assistant manager. The management of the team is at present<br />\nbusily engaged in arranging to enter men into the Baltimore Athletic Club and<br />\nthe Georgetown games. Preparations are also being made for an indoor meet,<br />\nto he held in the Fifth Regiment Armory, during February.<br />\nA letter has been received by Manager Slemons from the University of<br />\nToronto Lacrosse Club, asking for a game with our team during the last of<br />\nMay. Owing to the nearness of the final examinations, however, the offer for<br />\na game had to be declined.<br />\nThe last few Saturdays have been record-breakers in the point of attendance at lacrosse practice. Over thirty men, or about twenty per cent. of the<br />\nwhole under-graduate body, has been out each Saturday.<br />\nGeorge Knapp, an old '99 man, who won all kinds of laurels for Hopkins,<br />\nwas with us several days last week. His first appearance brought forth a<br />\nhearty \"Gee hee, Gee-ha!\" Pity we haven't a few more Knapps.<br />\nThere was some talk last week of having as one of the features of last Saturday's athletic contest a relay race between the lacrosse and the track teams.<br />\nCaptain Schmeisser, however, was probably fearful of the result, and decided<br />\nnot to push matters. With a liberal handicap the lacrosse men might have<br />\nmade things interesting for the sprinters.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nRESIGNATION OF CAPT. HOFFMAN.<br />\nT a joint meeting of the Track and Field Teams, held last Wednesday<br />\nafternoon, Mr. W. E. Hoffman, 1902, tendered his resignation as captain of the Track Team on account of press of other work. His resignation was accepted with a vote of thanks for his excellent services. Mr. J. T.<br />\nEngland was then unanimously elected as Mr. Hoffman's successor, and his<br />\npast record for executive ability as well as speed on the track will, no doubt,<br />\nenable him to prove a worthy official.<br />\nJust before the adjournment of the meeting Mr. Mackdermott made a short<br />\nspeech, complimenting Mr. Hoffman on his splendid work in behalf of athletics,<br />\nand his unselfish and earnest efforts in making the track team what it has been<br />\nfor the past year. He further stated that the team was in great need of fast men<br />\nthis year, and urged that each man put his best foot foremost to keep up the<br />\nhigh standard which Hopkins has recently attained in this branch of athletics.<br />\nIt is hoped that this request will be generously responded to, and that we<br />\nshall not have the humiliation of seeing one of our star teams fall below the<br />\nnotch this year.<br /><br />\n4<br /><br />\nNEXT FRIDAY EVENING.<br />\n'/HE annual athletic feed and reunion will be held in the Gymnasium next<br />\nFriday evening, exercises beginning at 8 o'clock sharp.<br />\nThese feeds have always been numbered among the most successful<br />\naffairs which the Hopkins has instituted, and from the vague accounts which<br />\nDame Rumor has recently spread, this year's promises to eclipse anything of<br />\nthe kind ever seen at the University.<br />\nThe committee, of which Mr. J. G. Campbell is chairman, have been particularly strenuous in their efforts to make this event enjoyable to all who may<br />\nattend, and the programme which they have arranged, the details of which are<br />\nas yet unknown, promises to be exciting in every particular. The time-honored<br />\ncustom of awarding the athletic \"H's\" to the members of the winning teams<br />\nwill be observed as usual; and all those who have worked so patiently and earnestly in behalf of the Hopkins Athletics will receive the just reward of their<br />\nefforts. President Remsen and other prominent members of the faculty will be<br />\npresent, and will deliver short addresses apropos to the occasion.<br />\nDuring the intervals several attractive selections will be rendered by members of the musical clubs, and Mr. Harry Wiel, of the Medical School, who is<br />\nknown to be something of a pianist as well as a humorist, will do a piano<br />\nstunt. Whipple, assisted by others, has promised to give a startling exhibition in gymnastics, which is expected to be unique in itself.<br />\nUpon adjournment to the cage, an entirely new departure in the line of<br />\nevents will be observed, as every feature in this part of the programme is<br />\nentirely original. The obstacle race promises to be quite amusing, while a tug<br />\nof war will once more test the strong rivalry existing between Freshman and<br /><br />\ni.;<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nJunior classes. A game of football, as it was played at Rugby, occupies a<br />\ncorner on the list of \"Stunts.\" These features are but \"E pluribus paucum\"<br />\nof the series which is to be offered, after which an abundant store of good things<br />\nto eat will be served.<br />\nThese glorious occasions have always been fully attended by the student<br />\nbody, alumni, as well as others, and it is hoped that a still greater number will<br />\nbe present this year. It is particularly advised that all those who think there<br />\nis no college life at Hopkins will come and be astonished. The admission is<br />\nfifty cents.<br /><br />\nJOINT INDOOR MEET.<br />\nHE first of a series of indoor games which are to be held under the<br />\nauspices of the General Athletic Association during the present winter<br />\nand the coming spring, was run off last Saturday afternoon in the Cage,<br />\nand proved a \"howling\" success. During the morning the committee in charge<br />\nhad busied themselves, and when the games were called at three o'clock the<br />\nwalls of the cage were gaudily decorated with class and University flags and<br />\nwith the championship banners won by the football, baseball, track and field,<br />\nand lacrosse teams. Across the length of the gallery recently erected at the<br />\nwest end of the cage was a long black and blue streamer which added to the<br />\nspirit of the occasion. From the windows of the gymnasium the wire screens<br />\nhad been removed and a line of chairs put along the whole length. Both the<br />\ngallery and the gymnasium were filled with under-graduate and graduate students, former graduates and the lady friends of the various members of the<br />\nUniversity, everyone cheering their favorites on to victory.<br />\nIn every sense the meet was a success, and much honor is due to Physical<br />\nDirector Mackdermott, who originated the scheme of\"cage meets,\" to Captain<br />\nEngland and Manager Pearre of the track and field team, and Captain Schmeisser<br />\nof the lacrosse team, who ably assisted Mr. Mackdermott. The editors of the<br />\nNEWS-LETTER sincerely hope that the success of the initial meet will be sufficiently encouraging to those who had charge to arrange the next set of games for<br />\na date in the near future.<br />\nThe programme was started with a 35-yard dash across the cage, which,<br />\nowing to the large number of entries, had to be run off in five heats. The<br />\nentries and results for this and the other events follow:<br />\nFirst Heat—Won by Blanck; H. P. Straus, second. The other entries<br />\nwere: Messrs. E. P. Bernheim, Sayler, and Branham.<br />\nSecond Heat—E. Schmeisser, first; Abercrombie, second. Also ran, Bryan,<br />\nBird, Custis and Putts.<br />\nThird Heat—R. C. Hoffman, Jr., first; Williams, second. Also ran, Porter, Rosenheim, LeCron and Emig.<br />\nFourth Heat— Weedon, first; Riggs, second. Also ran, Hopper, Nelson,<br />\nKohn and England.<br />\nFifth Heat—Lindsay won; Riley second. Licking, Numsen, and Brem<br />\nalso ran.<br /><br />\n'OC<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nSemifinals—First heat: Abercrombie won; Blanck, second.<br />\nSecond Heat—Weedon, first; Riggs, second.<br />\nFinal—Abercrombie, first, Weedon, second.<br />\nThe interclass relay race was the signal for an outburst of enthusiasm on<br />\nthe parts of the junior and freshmen adherents, and was one of the most interesting events of the day. It was easily won by the upper classmen, but had it<br />\nnot been 'for the unfortunate fall of Kohn, of the freshmen team, which proved<br />\nthe most serious handicap for the lower classmen to overcome, it would have<br />\nbeen a nip-and-tuck race. Those who ran were : Juniors—E. Schmeisser,<br />\nCustis, R. C. Hoffman, Jr., and Williams. Freshmen—Kohn, Emig, Branham and Rosenheim.<br />\nStone got first place in the 16-pound shotput, with Blanck a close second.<br />\nThe other entries were: Messrs. Lawson, Rosenfeld, Whipple, Scholl, Sayler,<br />\nand Yearley. Stone's work in this event was great, and he showed much improvement in form over last year. He should do many things for his alma<br />\nmater this year.<br />\nFour forty yard run—J. T. England, scratch; Hoffman, Numsen, Nelson,<br />\nLindsay, Joseph Smith and Licking. The handicap limit was 20 yards. England won, with Smith second.<br />\nThe lacrosse game was the next event, and was a signal for another outburst of enthusiasm. The team was divided into halves, and the attack was<br />\npitted against the defense. Those who were in the contest were:<br />\nNo. 1—Briscoe, E Schmeisser, Sayler, Abercrombie, E. P. Bernheim, and<br />\nPutts.<br />\nNo. 2—W. C. Schmeisser, H. P. Straus, Custis (Iglehart), Bird, Bryan,<br />\nand B. Bernheim.<br />\nThe game resulted in a score of 7 to 7.<br />\nThe running high jump was won by William S. Weedon, with George B.<br />\nScholl second. Brem also jumped.<br />\nThe games were ended with a half-mile run. There were only three entries,<br />\nand E. Schmeisser easily got first place. Porter got second, with Rosenheim<br />\nthird.<br />\nThe officials were: George W. Knapp, referee; J Morfit Mullen, marshal;<br />\nAubrey Pearre, clerk of the course; W. M. Mackdermott, starter; E. B. Beasley, G. D. Dulaney, R. C. Pagon, and Henry Iddins, judges; J. R. B. Branch,<br />\nscorer; L. M. Tough, assistant scorer, and J. C. Campbell, announcer.<br />\nReferee of lacrosse game, J. Bandel; goal umpires, B. B. Bandel and E. C.<br />\nHatch.<br />\nMany of the contestants who competed in these games will represent the<br />\nHopkins in the B. A. C. indoor meet at the Fifth Regiment Armory next Saturday and for the Georgetown meet in Washington during the last of February.<br /><br />\n\"I see my finish,\" gasped the canine, and continued in pursuit of his<br />\ncaudal appendage.—Ex.<br /><br />\n16<br /><br />\nTHE NEWS—LETTER.<br />\nMARYLAND INTERCOLLEGIATE LEAGUE.<br /><br />\nHE adjourned meeting of the Maryland Intercollegiate Association was<br />\nheld on Saturday, January 18, in the office of the President, Mr. James<br />\nA. Fechtig, Jr.<br />\nThe games committee, composed of Professor Cain, of St. John's, chairman, William E. Hoffman, Jr., of Johns Hopkins, and Mr. Gilligan, of Western Maryland, was authorized to prepare a list of specific events and the order<br />\nof running off the same at the intercollegiate track-field championship games in<br />\nMay. They were also authorized to arrange the baseball dates for the approaching season.<br />\nThe harmony which prevailed between the delegates was particularly noticeable, as a discussion of athletic topics is always liable to produce friction<br />\nand to rend asunder a meeting into contesting factions.<br />\nThe Maryland League is to be congratulated upon the stand it has taken<br />\non the subject of pure athletics. Some five years ago nearly every college team<br />\nhad some trace of professionalism, and even at the present day it has not en<br />\ntirely disappeared from our leading institutions; but the Maryland League has<br />\nshown the way and set the example to other colleges by eliminating from its<br />\nown members every trace of anything but pure college sport. Such an affair as<br />\nrecently happened at Harvard in regard to the standing of Cutts and at Yale in<br />\nregard to Glass, is impossible under the rules of the Maryland League.<br /><br />\nt<br /><br />\nANOTHER TALK WITH WALTER.<br />\n4 43 HOPE this razor don't pull, sir; I just sharpened it on the face of a<br />\nfreshman, sir, and it ought to be in good condition. He is a nice boy,<br />\nsir; he says that he goes to bed at ten o'clock because he is on the track<br />\nteam, sir. It's strange how a freshman takes to the track team, sir. One gentleman, sir, said that it was Mr. Mackdermott's persuasive powers of speech, sir.<br />\n\"'Everybody must get on your marks,' he shouts.<br />\n\"'Heavens,' says a freshman from the Eastern Shore, sir, 'el my family<br />\ngot on to my marks, I'd have to do some studying.'<br />\n\"After the freshman has been properly instructed by Mr. Mackdermott,<br />\nthe captain, and the manager, sir, then Mr. Mackdermott yells 'Get set.'<br />\n\"At that, sir, don't you know, sir, they all lifts their backs like a cat that<br />\nsees a strange dog. Then, sir, somebody falls over the line, and the rest laugh.<br />\nBut you have to see it, sir, I can't tell you about it.<br />\n\"Yes, there were great games in the cage on S urday, sir. Before the<br />\ngames, the freshmen were covering everything in sight; but as yet they have<br />\nnot covered themselves with glory. What were the games for, sir? Why, to<br />\nshow the world some fast Hopkins boys!<br />\n\"Thank you, sir, that's three you owe me for, sir. Call again, sir.\"<br /><br />\n17<br /><br />\nTHE NEWS—LETTER.<br /><br />\nA boil in the pot is worth two on the neck.—Cornell Widow.<br />\nTo have a white elephant on your hands is bad, but to have one on your<br />\nfeet is worse.—Cornell Widow.<br />\nSnakes and fleas are not alike;<br />\nWe need not analyze them far—<br />\nSnakes on their own bellies crawl,<br />\nWhile fleas are not particular.<br /><br />\n—Cornet Widow.<br />\n\"There are only two causes of the evil in this world—only two possible<br />\ncauses,'—, says Professor Hume,—\"man is one, and woman is the other.\"—<br />\nToronto Varsity.<br />\nVisitation, conversation,<br />\nContemplation, perturbation;<br />\nPalpitation, resignation,<br />\nOsculation, exultation.<br />\nPublication, preparation,<br />\nCongregation, 'gratulation;<br />\nTransportation, meditation,<br />\nLamentation, condemnation.<br />\n—The Bachelor, Washington University.<br /><br />\nAN EXAMINATION IN HISTORY<br /><br />\ni.<br /><br />\n[Respectfully submitted to the consideration of the proper authorities.]<br />\n1. Give a brief outline of Frankish history. Did Charles Martel personally<br />\nconduct Tours? Was Pippin an apple of discord among the Franks?<br />\n2. Who was Constantine? Constantius? Cornstarch? Tell something about<br />\nGeiseric's brother, Goldbric. Was Rome captured by Paregoric? Who was<br />\nCandlestic?<br />\n3. Compare the careers of Stilieho and Bilighote.<br />\n4. Was Mohammed a Buffalo? Who was Ali? Was he the person known<br />\nafter death as Paradise Ali?<br />\n5. Were any coon songs written in Medinah? Who wrote the Mohammedan hymn, \"Islam, lam, lam\"?<br />\n6. During the persecutions of Diocletian, how long did it take an early<br />\nChristian to become a late one?<br />\n7. In history, which of a Roman's ears is known as the Roman frontier?—<br />\nHarvard Lainfioon.<br /><br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br /><br />\nNICD 1=?LJ 1E3<br /><br />\nJe<br /><br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br /><br />\n321 W. Baltimore Street.<br /><br />\nCHESAPEAKE RUBBER COMPANY,<br />\nE3<br /><br />\n.,<br />\nS 8c_ CC)<br />\n675 West Baltimore Street,<br /><br />\nWEST BALTIMORE LOAN CO<br /><br />\n.Between Arch and Pine Sts. Baltimore, Md.<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br /><br />\nOPEN<br /><br />\nFROM<br /><br />\nA.<br /><br />\nT<br /><br />\nM. TO<br /><br />\nSATURDAYS<br />\n8 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM<br /><br />\nCO.<br /><br />\nSMITH, DIXON<br />\nPftli'Lli<br /><br />\nPluores<br />\nf<br />\nD<br />\n\"<br /><br />\nramin.<br /><br />\nBaltimore, Md.<br /><br />\n29-31 S. Charles St.<br /><br />\nMANUFACTURER<br /><br />\nUNTIL 10<br /><br />\nP<br /><br />\nM<br /><br />\nFRAME &amp;<br />\nPURNELL co.<br />\n224 N. HOWARD ST.<br /><br />\nor<br /><br />\nOreelt 1Letter<br />\nA. H. FETTING, fratertutp<br />\n3-eweltr.<br />\n14<br /><br />\nAND<br /><br />\n16 ST. PAUL STREET,<br /><br />\nBALTIMORE, MD.<br />\nPLEASE CALL AND EXAMINE OUR LINE REfORE<br /><br />\nPUN :HARING.<br /><br />\nJ. H. ROBINSON.<br />\nMANUFAOTURER<br /><br />\nOW<br /><br />\n— * FINE• CIGARS.•<br />\nONALMH<br /><br />\nFINE<br /><br />\nBonbons, Chocolates,<br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br /><br />\n1N<br /><br />\nTOBAcXx.), orowits AND NIMOKEHS' AICTICIGICE4,<br />\nSTAmioNEHy.<br /><br />\n14 EAST BALTIMORE STREET.<br /><br />\nBALTIMORE. MD.<br />\n626 N. EUTA W ST.<br />\nBaltimore, Now York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone, Madison 11155Y.<br />\nDesigning and Cutting by E. Michaelson.<br /><br />\nE. MIGIVirELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nALTERING AND REPAIRING<br /><br />\n821 rladison Avenue,<br />\nSpecial discount to Students.<br /><br />\nBfILTIMORE, MD.<br /><br />\nA. D. SMITH &amp; SONS,<br />\nFirnmeriv<br />\nLEVERING tic SMITH.<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ltioies, Misses<br />\nand Children.<br />\nTn the Latest Deetunn.<br />\nMEN'S HATS Dcrliys and Soft Felts.<br /><br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br /><br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLad lea' and Gentlemen's Dining Worm.<br />\nMeals Served at all Hours.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\n804 UNION TRUST BUILDING,<br />\nN. E. COI'. Charles and Fayette Sts.,<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., D.0.,<br />\nFrost. &amp; Mgr.<br /><br />\nholiday<br />\nWedding Silver 6u<br />\nts<br />\nIN ARM VARSITY.<br /><br />\nsiiversmitbs.<br />\n.34<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nStudent's Supplies.<br /><br />\nJAMES R. Pants.<br /><br />\nTHRO. WARNUR.<br /><br />\nESTABLISHED 1879.<br /><br />\nJACOBI &amp; JENKINS.<br />\nSte N. CHARLES ST.<br /><br />\nH. MDMAINS, D. O.,<br />\nSoo'y. &amp; Treas.<br /><br />\nMARIA BUIE, 9,0.,<br />\nV.-Prost. &amp; Asst. Stio'y.<br /><br />\nMadison&amp;HowardSts.<br /><br />\nW.A.FRINIER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgrnt for Lincoln &amp; Bennett and<br />\nWalter Bernard's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere Hats.<br /><br />\nCUSHING &amp; COMPANY,<br /><br />\n34 W. BALTIMORE ST.<br />\nLAU/ ONSIDICAL. CLASSICAL AND MISOSLL•PISOU• SOUS<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman eik Son,<br /><br />\nII. R. E1SENBRANDT SONS,<br /><br />\nfor<br /><br />\n701 to 705<br />\nMADISON AVE.<br />\nof<br />\nsubmitted<br />\nSamples<br />\nfollows:<br />\nReads as<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nquality.<br />\nsuperior<br />\nof<br />\npure,<br />\nPort—absolutely<br />\nOporto<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nMix Ground Spices —no adulteration, all strictly pure.<br /><br />\nBookseller's and<br />\nStationers.<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nJORDI1N SMBLER GO.<br /><br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharlcs I'. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br /><br />\nSurplus and Profits $450,00n.<br />\nCapital. $660.000<br />\nAccounts of Ranks, Corporations, Firms and Individuals<br />\nin accordance with<br />\nextended<br />\nsolicited. Facilities<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE. MD.<br /><br />\nSouth and Lombard Sts., Baltimore.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAUE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nDIRECT.<br /><br />\ntbe Itran3=Smith<br />\npiano CO.<br /><br />\nMANDOLIN. GUITAR AND BANJO Jwg JI jS<br />\nTAUGHT OW<br /><br />\nC. J. LEVIN•<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Charles St,<br /><br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nflgenfraz (5iudio<br /><br />\nChicitertng, 13rabburp anb lalIebster<br /><br />\nSuccessor to Cummins<br /><br />\n.ag<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO<br /><br />\nBaltimore<br /><br />\nHABERDASHERS,<br /><br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON BALE THE 1. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203W.BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br /><br />\n.4 !pianos. .4 .4<br />\nFactory Prices.<br /><br />\nO. &amp; P.'Phone 2322-2.<br /><br />\nSMITH'S 8°HaIT'BO011eg\"B<br />\nOLD<br />\nBOOK<br />\nN. HOWARD STREET,<br />\nSTORE.<br />\n•<br />\n3rd door from Madison.<br />\n805<br /><br />\nBALTIMORE, MD.<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ;<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE c&amp; CO.,<br />\nBANKERS &amp; BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MI),<br /><br />\nThe Chas. Rims Surgical Instrument Company<br />\nBENJ. A. NELSON,01N'L MANAGER<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged . . ..<br />\nWM. V.PIPPEN,<br /><br />\n6o5<br /><br />\nN. Eutaw Street.<br />\nA. H Rutherfoord.<br /><br />\nJ. Wm. Middendorf,<br /><br />\nR. Lents.<br /><br />\nA.J. Robbins.<br /><br />\nJ. WM, MIDDENDORF &amp; CO.<br />\n113ankers &amp; Ifirohers.<br /><br />\nPhysioians,' Burgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\nBaltimore, Md.<br />\n30o N. Howard St.,<br /><br />\nMembers<br />\nBaltimore Stock E xchatige.<br /><br />\nDrovers and Mechanics National Bank,<br /><br />\nBOOKS AND STATIONBRY<br /><br />\nOF BALTIMORE. MD.<br /><br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br /><br />\nYOUR EYS<br /><br />\nSAYRE OPTICAL COMPANY,<br />\nMil North Charles Street.<br /><br />\n(Masonic Temple.)<br /><br />\nOPTIGI*NS.<br />\nTHE NEWS LETTER<br /><br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br /><br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br /><br />\nr..24:=.. SOS<br /><br />\nmt.,<br /><br />\nY. M. C. A. BUILDING.<br /><br />\nC. &amp; P. and Md.'Phones.<br /><br />\ncAll. ON<br /><br />\nBALTIMORE, MD.<br /><br />\nJR'S. It. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC TC PA PLS.<br /><br />\nFOR Class, Fraternity and College Stationer?,<br />\n7---Banquet Cards, Invitations, Diplomat/.<br />\nPrograms, Visiting Cards, etc. ..... •<br /><br />\nOur 60e J. fl. U. Bine and Black Plea Paper—now ready.<br />\nThere Is very little entertainment at home without a Plano<br /><br />\nIs from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br /><br />\nSTATION E AS<br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\n5TIEFF<br />\nP1ANos<br />\n9 N. Menu St.<br />\nilre The Best.<br /><br />"}], "field_media_file": [{"target_id": 36214, "display": null, "description": null, "target_type": "file", "target_uuid": "9cf60c75-6fcb-4e31-8c79-d2e503cdae6e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12198-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12198, "target_type": "node", "target_uuid": "f6b5de07-6fdd-4f6d-98d1-9f1c77a646d8", "url": "/node/12198"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "89d78786-8b77-4608-8b2a-905a59c88d0d"}]}