{"mid": [{"value": 36917}], "uuid": [{"value": "ea468ff2-a623-4c5b-986d-813b2ff228f9"}], "vid": [{"value": 36917}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13093-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:10+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "3<br />\n<br />\nVOL. XXVIII, No. 21<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMR.<br />\nCONRAD<br />\nHOFFMAN ELM TREES PLANTED ON UP- PUBLICITY BOARD ORGANI- BARNSTORMERS HOLD FIRST FOOTBALL BANQUET TO<br />\nBE<br />\nMAKES APPEAL FOR EUPER QUADRANGLE<br />\nZATION AUGMENTED BY<br />\nREHEARSAL ON REVUE<br />\nHELD THURSDAY NIGHT<br />\nROPEAN STUDENT RELIEF University Appropriates Money for the<br />\nAPPOINTMENTS<br />\nForty Men Trying for Cast. Next ReAT DORMITORY<br />\nPlanting of Decorative Shrubbery<br />\nAssembly Speaker Pictures Hardships of<br />\nhearsal Saturday Afternoon<br />\nActivity to Be Increased. Finances Will<br />\nFifteen Men to Receive Letters for ServEuropean Students. Examination<br />\nMany trees and shrubs have been Be Provided by Cotillon Club Dance<br />\nices with 1923 Eleven<br />\n\"Have You Bean to Lima,\" the<br />\nPeriod to Be Lengthened<br />\nActivity on the part of the Pub- musical comedy to be presented<br />\nplanted on the campus very recentFifteen Hopkins men will be<br />\nMr. Conrad Hoffman, who adly that add materially to the beauty licity Board for Johns Hopkins will this year by the Barnstormers, awarded their major letters on<br />\nministered to the wants of Ameriof the University. . The planting be increased at once as the result had its initial rehearsal last Fri- Thursday night when the football<br />\ncan prisoners in Germany during<br />\nday night at the studio in the<br />\nwas done at this time of the year of a meeting last Friday when the<br />\nteam is feasted in the dining room<br />\nBarn.<br />\nThe rehearsal was called<br />\nthe war, asked Johns Hopkins stubecause the trees must be moved work for the year was outlined and mainly<br />\nto familiarize the men of the Alumni Memorial Dormidents at the last assembly to conwhile they are dormant. The com- definite steps taken to make the or- with the revue and to get started tory. Never before has a Hopkins<br />\ntribute to the fund for European<br />\npletion ,of the Dormitory made it ganization more effective. Criti- on the Casting of the players.<br />\nfootball team met at the long table<br />\nStudent Relief.<br />\nPresident Hugh M. Smallwood with such a record of performcism from organizations representpossible<br />\nfor<br />\ntrees<br />\nand<br />\nshrubs<br />\nto<br />\nbe<br />\nMr. Hoffman supported his apand Coach Walter B. Swindell ad- ances to look back upon. The fifpeal with numerous facts and a de- planted in the quadrangle and to the ing campus activities led to the denorth<br />\nand<br />\neast<br />\nof<br />\nit.<br />\ncision to make candidates work with dressed the men. They insisted teen who are to receive the \"H,\"<br />\ntailed description of the conditions<br />\nthat the book and lyrics as writthe<br />\nOn<br />\nupper<br />\nquadrangle,<br />\n20<br />\nelms speed or be dismissed,<br />\nunder which the students of Rusfor the naten were only a start and that any as well as the rest of the squad,<br />\nhave<br />\nbeen<br />\nplanted<br />\nalong<br />\nthe bor- ture of the<br />\nsia and Central Europe are workwork of the Publicity<br />\nsuggestions on the part of the men will be regaled in style to fit the<br />\ning. In Russia, 31,000 students in der of the large grass plot. Inside Board means news must be sent out<br />\nwould not only be appreciated but most brilliant team that has worn<br />\n16 universities must' be given one the Dormitory quadrangle four immediately.<br />\nwould<br />\nbe welcomed. President the Black and Blue for a good<br />\nmeal a day. There are 14,000 more elms have been placed near the corBetter Financial Support<br />\nSmallwood<br />\ngave an outline sketch many years, at least. The banquet<br />\nrefugee students from Russia ners of the building. North and<br />\nThe question of finances was of the characters and the gist oi<br />\nis expected to be a gala event in<br />\nalone in countries where the gov- east of the Dormitory, about thirty somewhat relieved when the Aththe .play. Mr. Swindell augmenternment is comparatively stable. trees are being artistically arranged letic board, through Norman E.<br />\nthe annals of Hopkins team dined Smallwood's description.<br />\nMany more come from- the 'Holy to make the building appear beauti- Keyes, graduate manager, gave asners.<br />\nCast Not Selected<br />\nful from the street. They include<br />\nLand and Central Europe.<br />\nCovers will be laid for about 50<br />\nsurance that money would be forthMr. Swindell particularly emoaks, lindens, sugar maples, red<br />\nStudents Political Exiles<br />\ncoming as soon as the Board shows phasized the fact that no cast has guests, who will include those<br />\nmaples and ash. Along the slope<br />\nThese students in most cases are that extends along Charles Street, by its work that it is worthy of sup- been picked nor will a definite cast Hopkins men who were most report. The matter was also taken up be picked until the night that the sponsible for the success of the<br />\npolitical exiles who dare not return behind the Dormitory, a great<br />\ndeal<br />\nby the Cotillon Club to contribute show is presented at the Lyric. He 1923 eleven. Quite a few alumni<br />\nto their native countries because of of shrubbery has been<br />\nplanted.<br />\nparticipation in some revolt or There is some holly, rhododendrum, the proceeds from a cotillon dance pointed out that ever since he has are expected to be on hand to<br />\nto the Publicity Board. This sup- had anything to do with Hopkins share in the glory which they<br />\nother. In giving them aid, the or- and ilex.<br />\nIt was necessary<br />\nganization for European Student to plant these shrubs as soon as port will mean a great deal in car- productions, this has been the helped to bring to the J. H. U. on<br />\nRelief had many difficulties to possible to prevent the buildings rying on the work, George M. Shri- case. Mr. Swindell asked that two the gridiron. There are several<br />\novercome. European students are being an objectionable sight from ver, Jr., president, declared at the or three student pianists be pres- names on the list of guests of men<br />\nmeeting. Members of the Cotillon ent at the rehearsals to play the who are after-dinner speakers of<br />\nof a class unaccustomed to earning the street.<br />\nno mean ability and who are exa livelihood, and were slow to<br />\nThe cost of improving the Club did not vote an appropriation, scores. Anyone able to do this<br />\npected<br />\nto hold the interest of<br />\nyield the necessity for manual la- grounds is being taken from the but gave evidence of favoring such will remember two things: first,<br />\n6<br />\nbor. A (Treat deal of negotiation general income of the University. action soon after the holiday period. that the scores will be given to those assembled for some time<br />\nwith the Federation of Labor was<br />\nhim a few days in advance of re- after the meal is over.<br />\nGreat Deal of Work<br />\nThese trees and shrubbery conThe most important subject to<br />\nnecessary to secure permission for siderably add to the appearance of<br />\nhersals<br />\nso that he won't have to<br />\nAt the meeting, it was revealed<br />\nthe students to work on an equal a campus, that should already be a that there is an enormous amount sight-read, and, secondly, that this come up after the feast is the election of a captain for next year's<br />\nbasis with other wage earners. The pride to Hopkins men.<br />\nof work to be done, both in athletic work will-cciunt towards memberteam.<br />\nThis part of the program<br />\ncurrency depreciation was a source<br />\npublicity and in publicity as it af- ship in the club and mention in<br />\nhas<br />\nhitherto<br />\nbeen a period of hot<br />\nof suffering for students as well as<br />\nDAILY TRACK PRACTICE BE- fects the undergraduate and aca- the program as much as having a discussions,<br />\nbut<br />\nthere is not exfor other classes. Money earned<br />\ndemic departments of Johns Flop- part in the cast.<br />\nING HELD AT ARMORY<br />\npected<br />\nto<br />\nbe<br />\nmuch<br />\ndebate as to<br />\nduring the summer vacation was<br />\nSome of the members of the<br />\nAnnouncement was made this kins. This necessitates a complete<br />\nthe<br />\nelection<br />\nof<br />\nnext<br />\nyear's capreduced in purchasing power to alContinued on page 4, col. 3<br />\nweek that all men interested in track and authoritative list of publications<br />\ntain.<br />\nOne<br />\nman<br />\non<br />\nthe<br />\nsquad is<br />\nmost nothing soon after the openin the professional and trade world<br />\noutstanding in the race for the<br />\ning of school. Exchange banks practice will report at 4 o'clock whose readers would be<br />\nYULETIDE<br />\nISSUE<br />\nOF<br />\nJAY<br />\ninterested<br />\nevery day, except those in military<br />\nleadership of the team and there is<br />\nTO APPEAR THURSDAY<br />\nwere opened for the students, so<br />\nin<br />\nthe<br />\naffairs<br />\nHopkins.<br />\nat<br />\nTo actactics on Monday, at the Fifth<br />\nthat they could save ifioney withWith the second issue of the little doubt as to his receiving this<br />\nRegiment Armory. Each man is complish this, it was pointed out, a<br />\ngreat honor on Thursday evening.<br />\nout the tremendous losses caused<br />\nasked to bring what equipment he smooth working organization, pre- Black and Blue Jay to appear In accordance' with the policy of<br />\nby depreciation. Co-operative enhas. Excuses will be granted to pared at any time to send out news Thursday, the Christmas number, the News-Letter the name of the<br />\nterprises were begun and mainits readers will be greeted by an<br />\nthose men who take R. 0. T. C. matter to any part of the United<br />\nman mentioned above is withheld.<br />\ntained on a scale unknown in<br />\nunusually<br />\nattractive and fascinatStates,<br />\nis<br />\nneeded.<br />\nThis<br />\npurpose has<br />\nwork on Thursdays.<br />\nAmerica.<br />\ning cover picture drawn by A. M. Four men of this year's team<br />\nFred W. Geib, manager of track, been fostered in the past and the<br />\nhave played their last game under<br />\nGu<br />\nConvention In Trying Sessions<br />\nsays that this year's list of men out next few weeks will show the reHopkins<br />\ncolors and the big dinThe art work is on a higher<br />\nMr. Hoffman attached especial for track exceeds all previous years sults on a larger and more active<br />\nner<br />\nwill<br />\nmark their last official<br />\nstandard. Criticism of the picsignificance to the success of the and the results are quite promising scale, Shriver said.<br />\nconnection<br />\nwith the Black and<br />\nThree new men were taken on the tures and illustrations in the first<br />\nconvention of students from 32 for a victorious season. New men<br />\nBlue<br />\nSquad.<br />\nBonner, Rich,<br />\ncountries at Prague. Racial, na- are asked to come out for practice. staff. They are Henry Turnbull, issue led to a revision in the type Schacht<br />\nand Wolbert have all<br />\nof cuts—getting a more comic attional, and religious prejudices<br />\nThe following men's names are C. R. Martin and James Young.<br />\nplayed<br />\nfor<br />\nfour years, the period<br />\ntitude.<br />\nwere submerged in an effort to 'se- on the list: C. Kaplan, W. J. Biome,<br />\nallowed<br />\nby<br />\nintercollegiate eligibilMaterial<br />\nGiven Credit<br />\ncure unity and world wide good A. E. Hargett, L. B. Ziv, A. L. Bas- MILITARY UNIT PRAISED BY<br />\nity<br />\nrules.<br />\nThese<br />\nmen all played<br />\nMaterial<br />\nin<br />\nthe<br />\nBlack<br />\nBlue<br />\nand<br />\nMARINE CORPS HEAD<br />\nfeeling among college students. sin, H. V. Langelutte, F. M. Merefine<br />\nfootball<br />\nwhile<br />\nrepresenting<br />\nJay<br />\nhas<br />\nbeen<br />\nrecognized<br />\nby \"ColThe convention went through dith, H. E. Rasch, H. P. Wardell, In a recent letter to President<br />\nthe<br />\nHomewood<br />\ninstitution<br />\nand<br />\nlege<br />\nHumor\"<br />\nin its latest issue<br />\nmany trying sessions, but, in the C. 0. Moyer, P. A. Corby, Ed M. Goodnow, Major General John A.<br />\ntheir<br />\nloss<br />\nwill<br />\nbe<br />\nfelt<br />\nwhen<br />\nthe<br />\nwhen it contained fourteen exOpinion of the speaker, was suc- Passano, W. Hambleton, L. Clark, Lejeune, of the U. S. Marine<br />\nBlue<br />\nJays<br />\ntake<br />\nto<br />\nthe<br />\ngridiron<br />\nin<br />\nchanges from the Jay. A letter<br />\ncessful.<br />\nB. Proctor, R. Norwood, R. Dor- Corps, recognized the high stand- from the publication<br />\n1924.<br />\nto Fitz DunPledges to the European Stu- cus, Verne Booth, Maxwell, Skin- ing of the Johns Hopkins Unit of<br />\nBarring the loss of the four men<br />\nning,<br />\neditor<br />\nof<br />\nthe<br />\nJay, complident Relief fund, payable to Ran- ner, Gillece, Gwynn, Di Paula, J. the Reserve Officers Training<br />\nmentioned<br />\nabove, the Black and<br />\nments him oil the quality of artidolph Norwood, treasurer of the Baurenschmidt, Stevens, Wasson, Corps and made an exceptional ofBlue<br />\nsquad<br />\nwill go on the field<br />\ncles and stated that the Hopkins<br />\nY. M. C. A., were made at the as- G. Conning, Oppenheimer, Gaither, fer to men of the unit graduating<br />\nmagazine was considered among next year with practically the<br />\nsembly. The total amount pledged J. C. Brown, A. Hiss, Fischer, Gar- from the university this year.<br />\nsame men who wore Hopkins'<br />\nSO far is 8197.75. Pledges can still is, Gugenheimer, Wyson, J. T. Mar- \"I note with pleasure that Johns the best in the country.<br />\ncolors this year. The prospects<br />\nPrey<br />\nschools<br />\nmade<br />\na<br />\nheavy<br />\ndebe made at the Y. M. C. A. office,<br />\ntin, J. L. Anderson, Ball, L. H. Hopkins has achieved the coveted mand on copies<br />\nfor<br />\nnext year's eleven point to a<br />\nfor<br />\nfirst<br />\nthe<br />\nissue<br />\nand are payable there before Jan- Block, A. H. Williams, B. C. Tay- distinction and has been designatseason<br />\nthat may be as successful<br />\nand<br />\nin<br />\nmany<br />\ncases allotment to<br />\nuary 15.<br />\ned by the War Department as a<br />\nlor, Herbert Hoffman.<br />\ndifferent schools was completely as that just past.<br />\n'Distinguished Military College.'<br />\nDeny Evtended Holiday<br />\nsold the first day. Circulation has<br />\nDean Latane announced the de- DEBATE ON FOREIGN TOPIC In recognition of this I take occa- increased<br />\nHOPKINS GETS BEQUEST<br />\n400 copies and is now<br />\ncision of the Academic Council<br />\nA debate held last Thursday night sion to offer an opportunity to the well into the thousands.<br />\nThe residue of the $983,000 esnot to extend the Christmas holi- in the Civil Engineering Hall by the members of the 1924 graduation<br />\nNo freshmen have been ap- tate left by Mrs. Kate A. Stran,<br />\ndays, as requested by undergradu- Baltimore Chapter of the .Ameri- class of applying for appointment<br />\npointed to the staff since they the widow of Thomas Stran, a lumas second lieutenants in the Marine<br />\nate students. The graduate schools can Institute<br />\nof Banking on the<br />\nhave evinced little or no interest ber dealer, will go to Johns Hopare not in favor of such an exten- subject, \"Resolved, that the Philip- Corps,\" was one of the outstanding in the<br />\npublication work. Dunning kins University, according to inforsion, and in any event it would pines be branted immediate inde- parts of General Lejetine's letter.<br />\nannounces that competition is still mation given out last week when<br />\nbe impossible to change the uni- pendence,\" against the Philadelphia<br />\nNo Mental Examination<br />\nopen to the first year men and an inventory was made. Many<br />\nversity calendar, which has been in Chapter, resulted in the Baltimore<br />\nNo mental examination of an when they show any ability, will large bequests<br />\nwere made by Mrs.<br />\nContinued on page 2 col. 4<br />\nteam winning the negative side.<br />\nbe elected to the staff.<br />\nContinued on page 4 col. 3<br />\nStran.<br />\n<br />\n\fTHE JOHNS HOPKINS NE WS - LETTER, DECEMBER 18, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nMANBusiness communications should be addressed to the BUSINESS<br />\ncommunications<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nUNIVERSITY;<br />\nHOPKINS<br />\nAGER, JOHNS<br />\nshould be sent to the MANAGING EDITOR.<br />\n•<br />\n<br />\nTelephone<br />\nEditor-in-Chief<br />\n'24<br />\n<br />\nJOSEPH LEOPOLD,<br />\n<br />\nManaging Editor<br />\nG. DEAN, JR., '24<br />\n<br />\nWILLIAM<br />\n<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\n<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nCHARLES G. HUTZLER, '24<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nHomewood 100<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nFITZGERALD DUNNiNG, '24<br />\n<br />\nAP- during the period of excitement<br />\nHOFFMAN<br />\nCONRAD<br />\nimmediately preceding the HopPEALS FOR FOREIGN<br />\nkins-Maryland game is regarded<br />\nRELIEF<br />\nwith disfavor by the authorities of<br />\n1<br />\npage<br />\nContinued from<br />\nboth<br />\nuniversities. Students of both<br />\nprint for over six months, without<br />\nwere guilty of marking the<br />\nschools<br />\nconsiderable trouble.<br />\nthe enemy campus, and<br />\non<br />\ndrives<br />\nThe midyear examination period<br />\nthat Hopkins students<br />\nis<br />\nwill be lengthened by a few days, it claimed<br />\nLast Friday's snowfall reminded and an effort will be made to ar- took the initiative. Out of regard<br />\nus of a serious problem confront- range a schedule which will not for our own university, the Dean<br />\nthat such performances be<br />\n1.1g the northern part of the United require any student to take exam- advised<br />\nin the future.<br />\ndiscouraged<br />\nStates. With the automobile fast inations in two regularly scheduled<br />\nnext Thursday,<br />\nassembly<br />\nAt<br />\nthe<br />\ndisplacing the horse, the civilian is courses on the same day. Last President Goodnow will present<br />\nJune many students had to take<br />\nno longer warned, about 4 A. M.,<br />\nfour \"exams\" on the first two days gold footballs to Hopkins players<br />\nby the jingling sleigh bells of the of examination week. With the who were awarded positions on<br />\nmilkman, and later continually re- lightening of the schedule, the the All-Maryland football team<br />\npicked by the \"Sun.\"<br />\nminded, by the \"molten golden Dean expects better work.<br />\nTurnbull, left halfback; Magill,<br />\nnotes\" from the tradesmen's wag- 1-fashioned garden in the further<br />\nleft tackle; Rich, right end, and<br />\nStudent \"Talent\" Disfavored<br />\nons, that the ground is covered<br />\nSuch an exchange of the prod- Wolbert, right guard, won places<br />\nwith snow. As a result we have no<br />\nof artistic talent as was made on the mythical eleven.<br />\nucts<br />\nindoubt, statistics must show an<br />\n<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nA. J. McKAY,'26<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS,'25<br />\n<br />\nMiyb©<br />\nSo<br />\n<br />\ncreasing number of colds contracted by those who dressed minus<br />\nflannels before they realized the<br />\npresence of snow.<br />\n* *<br />\n\"Thurston Given Tablet\"—headline in a Baltimore paper.<br />\nWe wonder why the young lady<br />\nin the basket pierced with swords<br />\ndidn't slip him a tablet long ago.<br />\n<br />\nIn the last issue of the News<br />\nLetter we see that the Dormitory<br />\nHouse Committee \"plans to run<br />\noff a combination smoker and enPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntertainment.\" By this time, doubtless, the impossible has been ac1923<br />\n18,<br />\nDECEMBER<br />\nBALTIMORE, MD.,<br />\ncomplished; oil had been mixed<br />\nwith water.<br />\n* * *<br />\nAN EARLY DEATH<br />\nAn edition of Mr. Cabell's latest<br />\nwas<br />\ncustom<br />\nthe<br />\nwhen<br />\nyear<br />\nlast<br />\nbook,<br />\n\"The High Place,\" limited to<br />\ntradition<br />\nnew<br />\na<br />\nHopkins hailed<br />\nAs2,000<br />\ncopies, is selling for $7.50.<br />\nweekly<br />\neach<br />\ninaugurated of saying the University \"Ode\" before<br />\n\"The<br />\nHigh Price\" would be a<br />\nsembly. This year, the rendering of the song has become a perfuncrealistic title.<br />\nmore<br />\nmuch<br />\ntory and spasmodic rite and is often neglected for weeks at a time.-<br />\n<br />\nNo other shaving<br />\ncream has it<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPerhaps the explanation of the discontinuance of this tradition<br />\nlies in the fact that the \"Ode\" is not suitable for such an occasion.<br />\nAs we have said before in this column, the words and score 'of<br />\n\"Veritas Vas Liberabit\" are not such as to inspire the average undergraduate. The song, however, is the best we have and the weekly<br />\nrendering of it should not be discontinued without a further trial.<br />\n<br />\nRemembering that \"Waterloo<br />\nwas won on the playing fields of<br />\nEton\" and having heard somewhere that the World War was decided on the American gridiron we<br />\nare not a little worried by the nu-tice that \"football, formerly considered by Germans as being too<br />\nrough, has becorne one of the most<br />\nNO FURTHER EXCUSE<br />\npopular games among school boys<br />\nand<br />\ncollege men in that country.\"<br />\ndevoted<br />\ntime<br />\nof<br />\nlength<br />\nthe<br />\nthat<br />\nannouncement<br />\nDean Latane's<br />\nabolition<br />\n* *<br />\nto the examination period has been lengthened, marks the<br />\nis<br />\nstudent<br />\na<br />\nIf<br />\nsystem.<br />\n\"Six Autos Collide in Jam\"—<br />\nof one of the evils attached to the present<br />\nforced to study for two exams in one day, it is often possible that the another headline. Our idea of a<br />\n\"helluva mess.\"<br />\naccumulated facts become conglomerated into an indistinguishable<br />\n* * *<br />\nmass. The brain, like the rest of the human organism, can take<br />\nLee,<br />\nthat sterling genE.<br />\nRobert<br />\nonly so much nourishment at a time, the excess tending to retard its<br />\ntleman, the darling of misfortune,<br />\nfunctioning.<br />\nhas another \"tough break\" against<br />\nWith only one examination a day, however, and a possibility of him. Drinkwater's play of that<br />\none or more days between each, the accompanying mental strain is name packed houses in Richmond<br />\nreduced to a minimum. A failure under the new conditions can only with hostile audiences, was moderately successful in Wahsington and<br />\nbe the result of lack of application or inherent stupidity.<br />\nfailed quickly in New York. A run<br />\nin Boston or Quebec should play<br />\nto friendly crowds.<br />\nTHE 1924 HULLABALOO<br />\n* * *<br />\nTHE NEWS-LETTER, The Black,and Blue Jay and the Hullabaloo<br />\nare Hopkins publications and are advertised as such. This signifies<br />\nthat the respective boards, and through them the Hopkins undergraduate body, can be held responsible for the policy as well as the<br />\ncontents of their paper. With this fact in mind, we feel that the contemplated placing of the advertisements of the 1924 Hullabaloo in<br />\nthe hands of an advertising agency would be a grave error.<br />\nIt has been demonstrated that agencies often have other purposes in view besides the pleasing of the public. While there may<br />\nbe only a possibility that, through an agency, the people of Baltimore<br />\nmay gain a poor opinion of Hopkins and Hopkins activities, this<br />\npossibility is one that should by all means be eliminated.<br />\nOther Hullabaloo Boards have accepted offers of local agencies<br />\nand met with disastrous results. And past performances have shown<br />\nconclusively that the financing of the book without outside help is<br />\nentirely within the range of human possibilities. We feel that the<br />\nHullabaloo Business Board is contemplating a bad precedent.<br />\n<br />\nR. G. S. in the Sunday Sun wonders if the reason for the play's<br />\nfailure isn't this:<br />\n\"Abraham Lincoln was a national hero, and the play built an him<br />\nsucceeded largely because of that<br />\nfact. Lee is a sectional hero and<br />\nthe drama of his life is now playing in a disinterested country.\"<br />\nWithout going into the dangerous tangle of sectional prejudices,<br />\nwe must admit that R. F. S. explains very nicely the current success of \"Queen Victoria\" in New<br />\nYork, to say nothing of the sale<br />\nof the biographies of such national<br />\nheroes as Jefferson Davis, Freiherr<br />\nvon Shoen, Caleb Cushing, Leopold Auer, Michael Pupin, Edward<br />\nBok and Walter Damrosch.<br />\n<br />\nWe want<br />\na slogan<br />\n<br />\n176'<br />\n<br />\nS<br />\n<br />\nS6liky;fy<br />\nCevi<br />\neel<br />\n<br />\ndescribing the hinged<br />\ncap that can't get lost.<br />\nCan you give it to us?<br />\nPerhapsyou shavewith<br />\nWilliams'and knowhow<br />\ngentle and soothing its<br />\nquick-working lather is to<br />\nthe skin. Perhaps you<br />\nhaven't begun to use Williams' yet. Whichever the<br />\ncase, we'll pay real money<br />\nfor your ideas.<br />\n<br />\n$250 in prizes<br />\n<br />\nFor the best sentence often words orless on<br />\nthe value ofthe Williams'Hinged Cap,we offer thefollowingprizes:1st prize$100;2nd prize<br />\n$50;two third prizes,$25each;two4thprizes,$10<br />\neach;six5thprizes,$5 each.Any undergraduate<br />\norgraduatestudentiseligible.Iftwo ormore persons submit identical slogans deemedworthy of<br />\nPrizes,the full amountof the prize willbe awarded to each. Contest closes at midnight March 14,<br />\n1924. Winners will be announced as soon thereafter as possible. Submit any number of slogans<br />\nbut write on one side of paper only,putting name,<br />\naddress, college and class at top ofeach sheet. Address letters to Contest Editor, The J. B.Williams<br />\nCo.,Glastonbury,Conn.<br />\n<br />\nTaking the kick<br />\nout of a beard<br />\n01111111111111111.lb<br />\nVI t i!::'• ..,ifI'ffriii<br />\nk.<br />\n.<br />\n00<br />\n*it ,k,<br />\n11 .., , :„,, •• i1111\",•,..:.;:y<br />\n;1<br />\n...,:•• , . '.,•<br />\n-\\1<br />\n<br />\nAFTER shaving,does your face<br />\nEa.sting—feel raw? Don't blame<br />\nit on your razor. The fault lies<br />\nelsewhere.<br />\nUnless your beard is properly<br />\nmassaged by a supple, pliable<br />\nshaving brush with just the<br />\ncorrect degree of stiffness, the<br />\nkeenest razor blade grows dull<br />\nand pulls.<br />\n3 shaving brush<br />\ncomforts<br />\nYou will.find a Rubberset Brush<br />\nhas 3 important comforts.<br />\nYour beard, however tough,<br />\nsoftens easily,as Rubberset's fine,<br />\nfull bristles whip up a quick, generous lather... one that goes to<br />\nthe roots of each hair, holds it<br />\nfirmly erect, easy to cut.<br />\nRubbing in the lather with your<br />\nfingers becomes unnecessary.<br />\nRubberset bristles are gripped<br />\neverlastingly in hard rubber.<br />\nThey can't come out and mix<br />\nwith the lather.<br />\nEach Rubberset Brush is guaranteed—unconditionally. The<br />\nbristles stay in. It makes good or<br />\nwedo. Getyourstoday atany store<br />\non the campus.Made byRubberset<br />\nCompany, Newark, N.J., U.S. A.<br />\n<br />\ntlie<br />\n<br />\nquorl cica<br />\n<br />\nt a n dard<br />\n<br />\n;<br />\n\"A\"<br />\n<br />\nSHAVING BRUSH<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br />\nit<br />\n‘d<br />\nof<br />\nth<br />\ne<br />\n1(1<br />\n-(l<br />\nIll<br />\n<br />\n)e<br />\ny,<br />\nnt<br />\nrs<br />\nrn<br />\n<br />\nnd<br />\n:es<br />\n<br />\nPROF. MAGOFFIN DEFENDS<br />\nCLASSICS<br />\n\"Latin and Greek Are the Foundation<br />\nof Our Education,\" Former Hopkins Professor Tells N. Y. U. Class<br />\n<br />\n\"The student who has had a<br />\nclassical education is superior to<br />\nthe student who lacks this advantage,\" Prof. Ralph Van Deman<br />\nMagoffin, head of the Department<br />\nof Classics at New York University, told the Heights Freshmen at<br />\nthe Orientation lecture on \"The<br />\nClassics.\"<br />\n\"The Classics are the foundations of our education. The student<br />\nwho has had the proper training in<br />\nLatin and Greek is bound to succeed. For it teaches the student<br />\nto think, to work out things for<br />\nhimself and enables him to do<br />\nthings in a more able and pleasant<br />\nway.\" Professor Magoffin cited numerous examples in which the<br />\nClassics had been of great aid to<br />\nmen after their graduation.<br />\nProfessor Magoffin Also showed<br />\nthat the Classics Were still of vital<br />\nimportance by telling of the action<br />\nFrance has taken recently in regard to them, to the effect that<br />\nevery student in France-must take<br />\na four year course in Latin as well<br />\nas two years of Greek. For the<br />\nFrench government realized that<br />\nthey no longer held the high place<br />\nin education which they had before<br />\nthe great war, and that in order to<br />\nregain it, they must restore Latin<br />\nand Greek.<br />\n\"Education may be divided into<br />\nthree clases, material, sentimental<br />\nand real. The material consists in<br />\ngiving the student just enough<br />\nknowledge for him to be able to<br />\nearn the 'Almighty Dollar.' But no<br />\nnotion of materialism has ever survived. The sentimental consists<br />\nin permitting the student to choose<br />\nwhat subjects appeal to him, and<br />\nto study only these. No young<br />\nman educated in this way will succeed, he is bound to be found wanting, when a crises approaches. A<br />\nreal education in anything ana<br />\neverything which is going to give<br />\nyou the basis of a well balanced education, and the thing necessary to<br />\nsuch an education is-the Classics.<br />\nThat is why France found it necessary to adopt it. For from the<br />\nClassics spring the •Sciences, Philosophy and other subjects.\"<br />\nTopics Include Religion<br />\n<br />\nProfessor Magoffin's address<br />\nwas one of the series of Orientation lectures, which are being given in order to help the freshmen<br />\n\"find themselves\" in University<br />\nlife. Topics which have been created before include religion, the<br />\nlibrary, and the University organization.<br />\nProfessor Magoffin is a noted<br />\nclassicist, who is president of the<br />\nArchaeological Institute of America and who has lectured widely<br />\nin this country and abroad. He is<br />\na well-known writer and formerly<br />\ntaught in Johns Hopkins University.—N. Y. U. News,<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nOUR MEN'S SHOP<br />\n<br />\nJAS. H. DOWNS<br />\n<br />\nSpecializes in<br />\n<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n<br />\nDistinctive Furnishings<br />\n—the kind that is being sought<br />\nby the exacting college man.<br />\n<br />\nTHE DINING ROOM OF<br />\n<br />\nTHE HCPKINS<br />\nat 31st. and St. Paul Streets<br />\n<br />\nHUTZLER 13KfftlEM<br />\n<br />\nServes Regular—<br />\nBreakfast, 7.30 to 10 A. M.....$ .75<br />\nLunch, 12 to 2 P. M.<br />\n.65<br />\nDinner, 6 to 7.30 P. M.. .$1.00 & 1.25<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n.3'W:earner Cdcaveite and gliztaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\nOR A LA CARTE<br />\nMeal Hours Sunday and Holidays<br />\n8 to 10.30 A. M.<br />\n12 to 2 P. M.<br />\n6 to 7.30 P. M.<br />\nLuncheon and Dinner Parties at<br />\nReasonable Rates<br />\n<br />\nPythias—<br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br />\n<br />\nDIXON'S<br />\n<br />\noRADO<br />\n<br />\n7he masterdrawegpencil\"<br />\n17 leads—all dealers<br />\n<br />\n120§1/12111111/1111111/1111/11MMINIBINIMMI.<br />\n<br />\nHOCHSCHILD.KOHN &Co.<br />\n<br />\nA Record StillUnbroken<br />\nAt 5:20 P. M., March 8th, 1920, Westinghouse Turbine Established World's<br />\nRecord for Continuous Running.<br />\n<br />\nWhat Engineering Owes<br />\nto Good Workmanship<br />\nHEN Westinghouse installed a 45,000<br />\nK.W.Turbine in<br />\nthe power house of the Narragansett<br />\nElectric Light Company,Providence,<br />\nR. I., early in December, 1919, there<br />\nwas no thought of more than the<br />\naverage weekly power house run.<br />\nAbnormal weather conditions, however, brought so steady a demand for<br />\npower, that the unit was not shut<br />\ndown until March 8th, 1920, after a<br />\ncontinuous run of 84 days, 11 hours,<br />\nand 36 minutes.<br />\n45,000 K. W. Westinghouse Cross:Compound Turbine Unit at the Station ofthe Narragansett<br />\nElectric Light Company, Providence, It. I.<br />\nThis was especially remarkable in<br />\nthat the unit consists of two turbine<br />\nEqually impressive, oil was pumped through<br />\ngenerator sets, each of which operates indethe self-contained lubricating system to the<br />\npendently of the other, so that the result was<br />\nbearings at the rate of 600 gallons a minute.<br />\nthe mechanical equivalent of operating a<br />\nHad the oiling system failed for only 30 secsingle machine continuously for 169 days.<br />\nonds, the bearings would have been wrecked,<br />\nIf space permitted, many astounding figures<br />\nand other parts of the unit harmed!<br />\ncould be cited—about the K. W. H. generated<br />\nduring this period, the water and coal used,<br />\nThere is interesting history back of the<br />\noperation of Westinghouse Turbine Units of<br />\nthe cooling system, the oiling system, etc.<br />\n3,000 K. W. and higher. Notable records have<br />\nFor example,to keep the generators cool,over<br />\nbeen made in many of the world's great power<br />\n18,000,000,000 cubic feet of air passed through<br />\nplants, performance that is a tribute to remarkthem, which equals 2,000 times the total<br />\nable engineering and good workmanship.<br />\nweight of the generators and their bed plates.<br />\n<br />\nWestinghouse<br />\nACHIEVEMENT<br />\n<br />\nLECTURE<br />\n\"Combustion Engineering\"<br />\nby Dr. A. G. Christie<br />\n109 M. E., 4.15 P. M.<br />\n<br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\n\"There is sand in this bread.\"<br />\nWaiter—\"That's to keep the butter from sliding off.\"—Exchange.<br />\n<br />\nNOTICE<br />\nCandidates for Debating<br />\nTeams<br />\nSophs Today<br />\nFrosh Tomorrow<br />\nG 112, 12.30<br />\n<br />\n3<br />\n<br />\nOPPORTUNITY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br />\n<br />\n4<br />\nSTRATTON<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\n<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on Shirts<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nHOSIERY<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br />\n<br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE \"SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nCOTILLON CLUB HOLDS INFORMAL DANCE AT<br />\nHOMEWOOD<br />\n• The last Hopkins dance before<br />\nthe beginning of the Christmas holiday- festivities was held last Saturday night by the Cotillon Club. The<br />\nscene of the dance was the C. E.<br />\nHall, which still retained many of<br />\nthe decorations of the Sigma Chi<br />\n29 E. BALTIMORE ST.<br />\nBeta initiation dance.<br />\nAgents for JOHN B. STETSON HATS<br />\nThe occasion was rather in the<br />\nand FRATERNITY BANDS<br />\nnature of a trial dance. The Cotillon Club is considering holding<br />\nSaturday night dances frequently,<br />\nif not weekly, throughout the winter, if their popularity warrants<br />\ntheir continuation. The club may<br />\neven make the night dances a partial or complete substitute for the<br />\nusual tea dance. If the attendance<br />\nat both dances should be exceptional, the club is even prepared to<br />\nsponsor regular tea dances as well<br />\nas the night dances.<br />\nThe subscription price of the<br />\nnight dances is expected to be a<br />\nPrinters ot<br />\npopular feature. It is $1.00.<br />\n<br />\nV<br />\n<br />\n•<br />\n<br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\n<br />\nBARNSTORMERS HOLD FIRST<br />\nREHEARSAL<br />\nContinued from page 1<br />\n<br />\nBarnstormers assisted in the reading of the first act to give the<br />\nLoM BARD and SOUTH STREETS group of about 45 a more definite<br />\nidea of the gist of t he action.<br />\nCopies of this act were given to<br />\nFROSH-SOPH DEBATE TO candidates to study before the<br />\nnext rehearsal on Saturday afterTAKE PLACE JANUARY<br />\nnoon at 2 ,o'clock.<br />\nTENTH<br />\n<br />\nCollege Literature<br />\n<br />\nContest to Be Held During the Regular<br />\nAssembly Hour. Candidates<br />\nStart Work Today<br />\n<br />\nSe<br />\n<br />\nSTETSON<br />\n<br />\nHats<br />\nTHE smartness of a Stetson is only<br />\nthe first step—real appreciation of<br />\nStetson quality comes after long wear.<br />\nSTYLED<br />\n<br />\nFOR YOUNG<br />\n<br />\n\"Baltimore's Most Complete Sport<br />\nStore\"<br />\n<br />\nLIBERTY ST.<br />\nAT SARATOGA<br />\n<br />\nRevue Completely Hopkins<br />\n<br />\nMEN<br />\n<br />\nBachrach Rasin Co.<br />\n<br />\n\"Have You Bean to Lima\" is a<br />\nLUNCHEON<br />\nQuality<br />\nthree-act musical comedy, book,<br />\nTEA<br />\nATHLETIC & SPORTING<br />\nFinal arrangements for the freshand lyrics by H. M. Smallwood,<br />\nDINNER<br />\nEQUIPMENT<br />\nman-sophomore debate were made<br />\n21, and music by Ed. Spieker, '16.<br />\nlast Wednesday at a meeting of the<br />\nMaryland Agents for<br />\nThe scene is laid in Peru and the<br />\nWright & Ditson Victor Co.<br />\nDebating Council. The annual clash<br />\nSPECIAL PARTIES<br />\n1 1.30 A. M.<br />\nMEN'S SHOES<br />\naction centers around an Ameriwill be held on January the tenth<br />\nuntil<br />\nCampus Agent, -BUCK- BONNER<br />\ncan archaelogical expedition in 7.30 P. M.<br />\nOf the Better Class<br />\nPLAZA 6987<br />\nat the regular Thursday assembly.<br />\n14 N. HOWARD ST.<br />\nBALTIMORE<br />\nsearch of a tribe of Incas. The<br />\nThe subject of debate is, \"Resolved,<br />\nURNER BROTHERS<br />\nInca chief is a Ha'va'd graduate,<br />\nThat the Student Council should ex1 1 1 E. BALTIMORE STREET<br />\nercise over all matters of conduct which makes the use of the EngBaltimore<br />\nlish language possible. There are<br />\non the part of undergraduates the<br />\na great many comic scenes in the<br />\nsame authority that it now has to<br />\nTailors<br />\nrevue and doubtless a great many<br />\nenforce the Honor System.\" The<br />\nUniforms and Liveries<br />\nEstablished 1873<br />\nmore will be added as the rehearfreshmen will uphold the affirmasals progress.<br />\nA. H. FETTING MAN'FG<br />\n128 W. Fayette St., Near Liberty St.<br />\ntive side of the question.<br />\nJEWELRY CO.<br />\nBaltimore, Md.<br />\nThe<br />\nrendering<br />\nof<br />\nthis<br />\nmusical<br />\nHold Debate in Assembly<br />\nManufacturers<br />\ncomedy<br />\nwill<br />\nmark<br />\na<br />\nnew<br />\nera<br />\nin<br />\nthe<br />\nThe plan to hold the debate at<br />\nGreek Letter Fraternity Jewelry<br />\nhistory of Hopkins productions.<br />\n213 N. LIBERTY ST., Baltimore, Md. the assembly is a new one. In forWritten<br />\nby Hopkins, staged by<br />\nmer years the interclass debates<br />\nHopkins,<br />\nit will be entirely HopgEtgEILT.XNEIEDEITEEEIWIreigl=liglIME4E1111' were held at night and ,were folkins.<br />\nThe<br />\naim of the Barnstormlowed by dances. The attendances<br />\nand individuality is offered here at prices that are not<br />\ners<br />\nis<br />\nto<br />\nmodel themselves on the<br />\nfor the debates were sparse but<br />\nand<br />\ncannot be underquoted by any house at any time.<br />\norder<br />\nof the Triangle Club, Mask<br />\ngrew larger when it came time for<br />\n(1,Besides the reputation of an old-established firm<br />\ndancing. The assembly idea should and Wig, Hasty Pudding and<br />\nother<br />\nis back of each sale with a guarantee.<br />\ncollege<br />\ndramatic<br />\nclubs,<br />\nin<br />\nprove very successful and should<br />\nproducing<br />\nplays<br />\nentirely<br />\nrepresenarouse undergraduate interest in deIN-\\ZCOMM<br />\ntative of Hopkins.<br />\nbating.<br />\n<br />\nURNER'S<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\n,M0111-F<br />\nG1112<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n\"The King of Lubricants\"<br />\n<br />\nTryouts for the sophomore debatteam will be held today (Tuesing<br />\nSHERWOOD BROTHERS, INC.<br />\nday) in Room 112, Gilman Hall, at<br />\nWIEgICIIAggrftlgEtECiENgEggEDREINCEEXE 12.30.<br />\nThe candidates for the<br />\nfreshman team will meet tomorrow<br />\nat the same hour and place. Each<br />\nBoys, the place to get your<br />\nteam will consist of three men who<br />\nmeals—and they are honhave shown the most promise in the<br />\ntryouts. Dr. French will preside<br />\nest-to-goodness meals, well<br />\nthe preliminary meetings and<br />\nover<br />\nreasonably<br />\nand<br />\ns erve d,<br />\nselect<br />\nthe teams.<br />\npriced—is at<br />\nInterest Lacking<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br />\n<br />\nNicholas Brown, Mgr.<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nDebating thus far this year has<br />\nattracted very little interest. For<br />\nthis reason the members of both<br />\nclasses are urged to give .thcir<br />\nwhole-hearted support to so commendable an enterprise. The annual freshman-sophomore debates<br />\nhave always given rise to much enthusiasm and should act this year as<br />\nan incentive for .class spirit.<br />\nThe Debating Council is making<br />\narrangements with the University<br />\nof Richmond for a debate to be<br />\nheld on March 24. The probable<br />\nsubject will be, Resolved, \"That the<br />\nUnited States should enter the<br />\nWorld Court.\"<br />\n<br />\nFURNITURE<br />\nMILITARY UNIT PRAISED BY<br />\nMARINE CORPS HEAD<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\nContinued from page 1<br />\n<br />\napplicant will be required as a<br />\nman's diploma is considered as sufficient proof of his educational<br />\nqualifications. There will be the<br />\nusual physical examination, which<br />\nis customary in all applications to<br />\ngovernment service. Last of the<br />\nrequirements is the recommendation as to the character and ability of the applicant by President<br />\nGoodnow and Major Hoisington,<br />\nProfessor of Military Science.<br />\nTo the members of the Military<br />\nScience Department this letter is<br />\nhigh tribute. The recognition was<br />\nonly made possible by the hard,<br />\nearnest work of the students and<br />\nthe hearty co-operation of the instructors. Every official is high<br />\nly elated and all count on another<br />\nyear of brilliant triumph. All efforts are being extended to merit<br />\nmore such praise and to make<br />\nopenings for further distinction<br />\nalong military lines.<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br />\n<br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home“<br />\nfrom five to seven.<br />\nSunday morning worship at 1 1 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\n\f", "format": "basic_html", "processed": "3<br /><br />\nVOL. XXVIII, No. 21<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nMR.<br />\nCONRAD<br />\nHOFFMAN ELM TREES PLANTED ON UP- PUBLICITY BOARD ORGANI- BARNSTORMERS HOLD FIRST FOOTBALL BANQUET TO<br />\nBE<br />\nMAKES APPEAL FOR EUPER QUADRANGLE<br />\nZATION AUGMENTED BY<br />\nREHEARSAL ON REVUE<br />\nHELD THURSDAY NIGHT<br />\nROPEAN STUDENT RELIEF University Appropriates Money for the<br />\nAPPOINTMENTS<br />\nForty Men Trying for Cast. Next ReAT DORMITORY<br />\nPlanting of Decorative Shrubbery<br />\nAssembly Speaker Pictures Hardships of<br />\nhearsal Saturday Afternoon<br />\nActivity to Be Increased. Finances Will<br />\nFifteen Men to Receive Letters for ServEuropean Students. Examination<br />\nMany trees and shrubs have been Be Provided by Cotillon Club Dance<br />\nices with 1923 Eleven<br />\n\"Have You Bean to Lima,\" the<br />\nPeriod to Be Lengthened<br />\nActivity on the part of the Pub- musical comedy to be presented<br />\nplanted on the campus very recentFifteen Hopkins men will be<br />\nMr. Conrad Hoffman, who adly that add materially to the beauty licity Board for Johns Hopkins will this year by the Barnstormers, awarded their major letters on<br />\nministered to the wants of Ameriof the University. . The planting be increased at once as the result had its initial rehearsal last Fri- Thursday night when the football<br />\ncan prisoners in Germany during<br />\nday night at the studio in the<br />\nwas done at this time of the year of a meeting last Friday when the<br />\nteam is feasted in the dining room<br />\nBarn.<br />\nThe rehearsal was called<br />\nthe war, asked Johns Hopkins stubecause the trees must be moved work for the year was outlined and mainly<br />\nto familiarize the men of the Alumni Memorial Dormidents at the last assembly to conwhile they are dormant. The com- definite steps taken to make the or- with the revue and to get started tory. Never before has a Hopkins<br />\ntribute to the fund for European<br />\npletion ,of the Dormitory made it ganization more effective. Criti- on the Casting of the players.<br />\nfootball team met at the long table<br />\nStudent Relief.<br />\nPresident Hugh M. Smallwood with such a record of performcism from organizations representpossible<br />\nfor<br />\ntrees<br />\nand<br />\nshrubs<br />\nto<br />\nbe<br />\nMr. Hoffman supported his apand Coach Walter B. Swindell ad- ances to look back upon. The fifpeal with numerous facts and a de- planted in the quadrangle and to the ing campus activities led to the denorth<br />\nand<br />\neast<br />\nof<br />\nit.<br />\ncision to make candidates work with dressed the men. They insisted teen who are to receive the \"H,\"<br />\ntailed description of the conditions<br />\nthat the book and lyrics as writthe<br />\nOn<br />\nupper<br />\nquadrangle,<br />\n20<br />\nelms speed or be dismissed,<br />\nunder which the students of Rusfor the naten were only a start and that any as well as the rest of the squad,<br />\nhave<br />\nbeen<br />\nplanted<br />\nalong<br />\nthe bor- ture of the<br />\nsia and Central Europe are workwork of the Publicity<br />\nsuggestions on the part of the men will be regaled in style to fit the<br />\ning. In Russia, 31,000 students in der of the large grass plot. Inside Board means news must be sent out<br />\nwould not only be appreciated but most brilliant team that has worn<br />\n16 universities must' be given one the Dormitory quadrangle four immediately.<br />\nwould<br />\nbe welcomed. President the Black and Blue for a good<br />\nmeal a day. There are 14,000 more elms have been placed near the corBetter Financial Support<br />\nSmallwood<br />\ngave an outline sketch many years, at least. The banquet<br />\nrefugee students from Russia ners of the building. North and<br />\nThe question of finances was of the characters and the gist oi<br />\nis expected to be a gala event in<br />\nalone in countries where the gov- east of the Dormitory, about thirty somewhat relieved when the Aththe .play. Mr. Swindell augmenternment is comparatively stable. trees are being artistically arranged letic board, through Norman E.<br />\nthe annals of Hopkins team dined Smallwood's description.<br />\nMany more come from- the 'Holy to make the building appear beauti- Keyes, graduate manager, gave asners.<br />\nCast Not Selected<br />\nful from the street. They include<br />\nLand and Central Europe.<br />\nCovers will be laid for about 50<br />\nsurance that money would be forthMr. Swindell particularly emoaks, lindens, sugar maples, red<br />\nStudents Political Exiles<br />\ncoming as soon as the Board shows phasized the fact that no cast has guests, who will include those<br />\nmaples and ash. Along the slope<br />\nThese students in most cases are that extends along Charles Street, by its work that it is worthy of sup- been picked nor will a definite cast Hopkins men who were most report. The matter was also taken up be picked until the night that the sponsible for the success of the<br />\npolitical exiles who dare not return behind the Dormitory, a great<br />\ndeal<br />\nby the Cotillon Club to contribute show is presented at the Lyric. He 1923 eleven. Quite a few alumni<br />\nto their native countries because of of shrubbery has been<br />\nplanted.<br />\nparticipation in some revolt or There is some holly, rhododendrum, the proceeds from a cotillon dance pointed out that ever since he has are expected to be on hand to<br />\nto the Publicity Board. This sup- had anything to do with Hopkins share in the glory which they<br />\nother. In giving them aid, the or- and ilex.<br />\nIt was necessary<br />\nganization for European Student to plant these shrubs as soon as port will mean a great deal in car- productions, this has been the helped to bring to the J. H. U. on<br />\nRelief had many difficulties to possible to prevent the buildings rying on the work, George M. Shri- case. Mr. Swindell asked that two the gridiron. There are several<br />\novercome. European students are being an objectionable sight from ver, Jr., president, declared at the or three student pianists be pres- names on the list of guests of men<br />\nmeeting. Members of the Cotillon ent at the rehearsals to play the who are after-dinner speakers of<br />\nof a class unaccustomed to earning the street.<br />\nno mean ability and who are exa livelihood, and were slow to<br />\nThe cost of improving the Club did not vote an appropriation, scores. Anyone able to do this<br />\npected<br />\nto hold the interest of<br />\nyield the necessity for manual la- grounds is being taken from the but gave evidence of favoring such will remember two things: first,<br />\n6<br />\nbor. A (Treat deal of negotiation general income of the University. action soon after the holiday period. that the scores will be given to those assembled for some time<br />\nwith the Federation of Labor was<br />\nhim a few days in advance of re- after the meal is over.<br />\nGreat Deal of Work<br />\nThese trees and shrubbery conThe most important subject to<br />\nnecessary to secure permission for siderably add to the appearance of<br />\nhersals<br />\nso that he won't have to<br />\nAt the meeting, it was revealed<br />\nthe students to work on an equal a campus, that should already be a that there is an enormous amount sight-read, and, secondly, that this come up after the feast is the election of a captain for next year's<br />\nbasis with other wage earners. The pride to Hopkins men.<br />\nof work to be done, both in athletic work will-cciunt towards memberteam.<br />\nThis part of the program<br />\ncurrency depreciation was a source<br />\npublicity and in publicity as it af- ship in the club and mention in<br />\nhas<br />\nhitherto<br />\nbeen a period of hot<br />\nof suffering for students as well as<br />\nDAILY TRACK PRACTICE BE- fects the undergraduate and aca- the program as much as having a discussions,<br />\nbut<br />\nthere is not exfor other classes. Money earned<br />\ndemic departments of Johns Flop- part in the cast.<br />\nING HELD AT ARMORY<br />\npected<br />\nto<br />\nbe<br />\nmuch<br />\ndebate as to<br />\nduring the summer vacation was<br />\nSome of the members of the<br />\nAnnouncement was made this kins. This necessitates a complete<br />\nthe<br />\nelection<br />\nof<br />\nnext<br />\nyear's capreduced in purchasing power to alContinued on page 4, col. 3<br />\nweek that all men interested in track and authoritative list of publications<br />\ntain.<br />\nOne<br />\nman<br />\non<br />\nthe<br />\nsquad is<br />\nmost nothing soon after the openin the professional and trade world<br />\noutstanding in the race for the<br />\ning of school. Exchange banks practice will report at 4 o'clock whose readers would be<br />\nYULETIDE<br />\nISSUE<br />\nOF<br />\nJAY<br />\ninterested<br />\nevery day, except those in military<br />\nleadership of the team and there is<br />\nTO APPEAR THURSDAY<br />\nwere opened for the students, so<br />\nin<br />\nthe<br />\naffairs<br />\nHopkins.<br />\nat<br />\nTo actactics on Monday, at the Fifth<br />\nthat they could save ifioney withWith the second issue of the little doubt as to his receiving this<br />\nRegiment Armory. Each man is complish this, it was pointed out, a<br />\ngreat honor on Thursday evening.<br />\nout the tremendous losses caused<br />\nasked to bring what equipment he smooth working organization, pre- Black and Blue Jay to appear In accordance' with the policy of<br />\nby depreciation. Co-operative enhas. Excuses will be granted to pared at any time to send out news Thursday, the Christmas number, the News-Letter the name of the<br />\nterprises were begun and mainits readers will be greeted by an<br />\nthose men who take R. 0. T. C. matter to any part of the United<br />\nman mentioned above is withheld.<br />\ntained on a scale unknown in<br />\nunusually<br />\nattractive and fascinatStates,<br />\nis<br />\nneeded.<br />\nThis<br />\npurpose has<br />\nwork on Thursdays.<br />\nAmerica.<br />\ning cover picture drawn by A. M. Four men of this year's team<br />\nFred W. Geib, manager of track, been fostered in the past and the<br />\nhave played their last game under<br />\nGu<br />\nConvention In Trying Sessions<br />\nsays that this year's list of men out next few weeks will show the reHopkins<br />\ncolors and the big dinThe art work is on a higher<br />\nMr. Hoffman attached especial for track exceeds all previous years sults on a larger and more active<br />\nner<br />\nwill<br />\nmark their last official<br />\nstandard. Criticism of the picsignificance to the success of the and the results are quite promising scale, Shriver said.<br />\nconnection<br />\nwith the Black and<br />\nThree new men were taken on the tures and illustrations in the first<br />\nconvention of students from 32 for a victorious season. New men<br />\nBlue<br />\nSquad.<br />\nBonner, Rich,<br />\ncountries at Prague. Racial, na- are asked to come out for practice. staff. They are Henry Turnbull, issue led to a revision in the type Schacht<br />\nand Wolbert have all<br />\nof cuts—getting a more comic attional, and religious prejudices<br />\nThe following men's names are C. R. Martin and James Young.<br />\nplayed<br />\nfor<br />\nfour years, the period<br />\ntitude.<br />\nwere submerged in an effort to 'se- on the list: C. Kaplan, W. J. Biome,<br />\nallowed<br />\nby<br />\nintercollegiate eligibilMaterial<br />\nGiven Credit<br />\ncure unity and world wide good A. E. Hargett, L. B. Ziv, A. L. Bas- MILITARY UNIT PRAISED BY<br />\nity<br />\nrules.<br />\nThese<br />\nmen all played<br />\nMaterial<br />\nin<br />\nthe<br />\nBlack<br />\nBlue<br />\nand<br />\nMARINE CORPS HEAD<br />\nfeeling among college students. sin, H. V. Langelutte, F. M. Merefine<br />\nfootball<br />\nwhile<br />\nrepresenting<br />\nJay<br />\nhas<br />\nbeen<br />\nrecognized<br />\nby \"ColThe convention went through dith, H. E. Rasch, H. P. Wardell, In a recent letter to President<br />\nthe<br />\nHomewood<br />\ninstitution<br />\nand<br />\nlege<br />\nHumor\"<br />\nin its latest issue<br />\nmany trying sessions, but, in the C. 0. Moyer, P. A. Corby, Ed M. Goodnow, Major General John A.<br />\ntheir<br />\nloss<br />\nwill<br />\nbe<br />\nfelt<br />\nwhen<br />\nthe<br />\nwhen it contained fourteen exOpinion of the speaker, was suc- Passano, W. Hambleton, L. Clark, Lejeune, of the U. S. Marine<br />\nBlue<br />\nJays<br />\ntake<br />\nto<br />\nthe<br />\ngridiron<br />\nin<br />\nchanges from the Jay. A letter<br />\ncessful.<br />\nB. Proctor, R. Norwood, R. Dor- Corps, recognized the high stand- from the publication<br />\n1924.<br />\nto Fitz DunPledges to the European Stu- cus, Verne Booth, Maxwell, Skin- ing of the Johns Hopkins Unit of<br />\nBarring the loss of the four men<br />\nning,<br />\neditor<br />\nof<br />\nthe<br />\nJay, complident Relief fund, payable to Ran- ner, Gillece, Gwynn, Di Paula, J. the Reserve Officers Training<br />\nmentioned<br />\nabove, the Black and<br />\nments him oil the quality of artidolph Norwood, treasurer of the Baurenschmidt, Stevens, Wasson, Corps and made an exceptional ofBlue<br />\nsquad<br />\nwill go on the field<br />\ncles and stated that the Hopkins<br />\nY. M. C. A., were made at the as- G. Conning, Oppenheimer, Gaither, fer to men of the unit graduating<br />\nmagazine was considered among next year with practically the<br />\nsembly. The total amount pledged J. C. Brown, A. Hiss, Fischer, Gar- from the university this year.<br />\nsame men who wore Hopkins'<br />\nSO far is 8197.75. Pledges can still is, Gugenheimer, Wyson, J. T. Mar- \"I note with pleasure that Johns the best in the country.<br />\ncolors this year. The prospects<br />\nPrey<br />\nschools<br />\nmade<br />\na<br />\nheavy<br />\ndebe made at the Y. M. C. A. office,<br />\ntin, J. L. Anderson, Ball, L. H. Hopkins has achieved the coveted mand on copies<br />\nfor<br />\nnext year's eleven point to a<br />\nfor<br />\nfirst<br />\nthe<br />\nissue<br />\nand are payable there before Jan- Block, A. H. Williams, B. C. Tay- distinction and has been designatseason<br />\nthat may be as successful<br />\nand<br />\nin<br />\nmany<br />\ncases allotment to<br />\nuary 15.<br />\ned by the War Department as a<br />\nlor, Herbert Hoffman.<br />\ndifferent schools was completely as that just past.<br />\n'Distinguished Military College.'<br />\nDeny Evtended Holiday<br />\nsold the first day. Circulation has<br />\nDean Latane announced the de- DEBATE ON FOREIGN TOPIC In recognition of this I take occa- increased<br />\nHOPKINS GETS BEQUEST<br />\n400 copies and is now<br />\ncision of the Academic Council<br />\nA debate held last Thursday night sion to offer an opportunity to the well into the thousands.<br />\nThe residue of the $983,000 esnot to extend the Christmas holi- in the Civil Engineering Hall by the members of the 1924 graduation<br />\nNo freshmen have been ap- tate left by Mrs. Kate A. Stran,<br />\ndays, as requested by undergradu- Baltimore Chapter of the .Ameri- class of applying for appointment<br />\npointed to the staff since they the widow of Thomas Stran, a lumas second lieutenants in the Marine<br />\nate students. The graduate schools can Institute<br />\nof Banking on the<br />\nhave evinced little or no interest ber dealer, will go to Johns Hopare not in favor of such an exten- subject, \"Resolved, that the Philip- Corps,\" was one of the outstanding in the<br />\npublication work. Dunning kins University, according to inforsion, and in any event it would pines be branted immediate inde- parts of General Lejetine's letter.<br />\nannounces that competition is still mation given out last week when<br />\nbe impossible to change the uni- pendence,\" against the Philadelphia<br />\nNo Mental Examination<br />\nopen to the first year men and an inventory was made. Many<br />\nversity calendar, which has been in Chapter, resulted in the Baltimore<br />\nNo mental examination of an when they show any ability, will large bequests<br />\nwere made by Mrs.<br />\nContinued on page 2 col. 4<br />\nteam winning the negative side.<br />\nbe elected to the staff.<br />\nContinued on page 4 col. 3<br />\nStran.<br /><br />\nTHE JOHNS HOPKINS NE WS - LETTER, DECEMBER 18, 1923<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nMANBusiness communications should be addressed to the BUSINESS<br />\ncommunications<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nUNIVERSITY;<br />\nHOPKINS<br />\nAGER, JOHNS<br />\nshould be sent to the MANAGING EDITOR.<br />\n•<br /><br />\nTelephone<br />\nEditor-in-Chief<br />\n'24<br /><br />\nJOSEPH LEOPOLD,<br /><br />\nManaging Editor<br />\nG. DEAN, JR., '24<br /><br />\nWILLIAM<br /><br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br /><br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nCHARLES G. HUTZLER, '24<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br /><br />\nHomewood 100<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nFITZGERALD DUNNiNG, '24<br /><br />\nAP- during the period of excitement<br />\nHOFFMAN<br />\nCONRAD<br />\nimmediately preceding the HopPEALS FOR FOREIGN<br />\nkins-Maryland game is regarded<br />\nRELIEF<br />\nwith disfavor by the authorities of<br />\n1<br />\npage<br />\nContinued from<br />\nboth<br />\nuniversities. Students of both<br />\nprint for over six months, without<br />\nwere guilty of marking the<br />\nschools<br />\nconsiderable trouble.<br />\nthe enemy campus, and<br />\non<br />\ndrives<br />\nThe midyear examination period<br />\nthat Hopkins students<br />\nis<br />\nwill be lengthened by a few days, it claimed<br />\nLast Friday's snowfall reminded and an effort will be made to ar- took the initiative. Out of regard<br />\nus of a serious problem confront- range a schedule which will not for our own university, the Dean<br />\nthat such performances be<br />\n1.1g the northern part of the United require any student to take exam- advised<br />\nin the future.<br />\ndiscouraged<br />\nStates. With the automobile fast inations in two regularly scheduled<br />\nnext Thursday,<br />\nassembly<br />\nAt<br />\nthe<br />\ndisplacing the horse, the civilian is courses on the same day. Last President Goodnow will present<br />\nJune many students had to take<br />\nno longer warned, about 4 A. M.,<br />\nfour \"exams\" on the first two days gold footballs to Hopkins players<br />\nby the jingling sleigh bells of the of examination week. With the who were awarded positions on<br />\nmilkman, and later continually re- lightening of the schedule, the the All-Maryland football team<br />\npicked by the \"Sun.\"<br />\nminded, by the \"molten golden Dean expects better work.<br />\nTurnbull, left halfback; Magill,<br />\nnotes\" from the tradesmen's wag- 1-fashioned garden in the further<br />\nleft tackle; Rich, right end, and<br />\nStudent \"Talent\" Disfavored<br />\nons, that the ground is covered<br />\nSuch an exchange of the prod- Wolbert, right guard, won places<br />\nwith snow. As a result we have no<br />\nof artistic talent as was made on the mythical eleven.<br />\nucts<br />\nindoubt, statistics must show an<br /><br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON, '24<br />\nA. J. McKAY,'26<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS,'25<br /><br />\nMiyb©<br />\nSo<br /><br />\ncreasing number of colds contracted by those who dressed minus<br />\nflannels before they realized the<br />\npresence of snow.<br />\n* *<br />\n\"Thurston Given Tablet\"—headline in a Baltimore paper.<br />\nWe wonder why the young lady<br />\nin the basket pierced with swords<br />\ndidn't slip him a tablet long ago.<br /><br />\nIn the last issue of the News<br />\nLetter we see that the Dormitory<br />\nHouse Committee \"plans to run<br />\noff a combination smoker and enPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ntertainment.\" By this time, doubtless, the impossible has been ac1923<br />\n18,<br />\nDECEMBER<br />\nBALTIMORE, MD.,<br />\ncomplished; oil had been mixed<br />\nwith water.<br />\n* * *<br />\nAN EARLY DEATH<br />\nAn edition of Mr. Cabell's latest<br />\nwas<br />\ncustom<br />\nthe<br />\nwhen<br />\nyear<br />\nlast<br />\nbook,<br />\n\"The High Place,\" limited to<br />\ntradition<br />\nnew<br />\na<br />\nHopkins hailed<br />\nAs2,000<br />\ncopies, is selling for $7.50.<br />\nweekly<br />\neach<br />\ninaugurated of saying the University \"Ode\" before<br />\n\"The<br />\nHigh Price\" would be a<br />\nsembly. This year, the rendering of the song has become a perfuncrealistic title.<br />\nmore<br />\nmuch<br />\ntory and spasmodic rite and is often neglected for weeks at a time.-<br /><br />\nNo other shaving<br />\ncream has it<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPerhaps the explanation of the discontinuance of this tradition<br />\nlies in the fact that the \"Ode\" is not suitable for such an occasion.<br />\nAs we have said before in this column, the words and score 'of<br />\n\"Veritas Vas Liberabit\" are not such as to inspire the average undergraduate. The song, however, is the best we have and the weekly<br />\nrendering of it should not be discontinued without a further trial.<br /><br />\nRemembering that \"Waterloo<br />\nwas won on the playing fields of<br />\nEton\" and having heard somewhere that the World War was decided on the American gridiron we<br />\nare not a little worried by the nu-tice that \"football, formerly considered by Germans as being too<br />\nrough, has becorne one of the most<br />\nNO FURTHER EXCUSE<br />\npopular games among school boys<br />\nand<br />\ncollege men in that country.\"<br />\ndevoted<br />\ntime<br />\nof<br />\nlength<br />\nthe<br />\nthat<br />\nannouncement<br />\nDean Latane's<br />\nabolition<br />\n* *<br />\nto the examination period has been lengthened, marks the<br />\nis<br />\nstudent<br />\na<br />\nIf<br />\nsystem.<br />\n\"Six Autos Collide in Jam\"—<br />\nof one of the evils attached to the present<br />\nforced to study for two exams in one day, it is often possible that the another headline. Our idea of a<br />\n\"helluva mess.\"<br />\naccumulated facts become conglomerated into an indistinguishable<br />\n* * *<br />\nmass. The brain, like the rest of the human organism, can take<br />\nLee,<br />\nthat sterling genE.<br />\nRobert<br />\nonly so much nourishment at a time, the excess tending to retard its<br />\ntleman, the darling of misfortune,<br />\nfunctioning.<br />\nhas another \"tough break\" against<br />\nWith only one examination a day, however, and a possibility of him. Drinkwater's play of that<br />\none or more days between each, the accompanying mental strain is name packed houses in Richmond<br />\nreduced to a minimum. A failure under the new conditions can only with hostile audiences, was moderately successful in Wahsington and<br />\nbe the result of lack of application or inherent stupidity.<br />\nfailed quickly in New York. A run<br />\nin Boston or Quebec should play<br />\nto friendly crowds.<br />\nTHE 1924 HULLABALOO<br />\n* * *<br />\nTHE NEWS-LETTER, The Black,and Blue Jay and the Hullabaloo<br />\nare Hopkins publications and are advertised as such. This signifies<br />\nthat the respective boards, and through them the Hopkins undergraduate body, can be held responsible for the policy as well as the<br />\ncontents of their paper. With this fact in mind, we feel that the contemplated placing of the advertisements of the 1924 Hullabaloo in<br />\nthe hands of an advertising agency would be a grave error.<br />\nIt has been demonstrated that agencies often have other purposes in view besides the pleasing of the public. While there may<br />\nbe only a possibility that, through an agency, the people of Baltimore<br />\nmay gain a poor opinion of Hopkins and Hopkins activities, this<br />\npossibility is one that should by all means be eliminated.<br />\nOther Hullabaloo Boards have accepted offers of local agencies<br />\nand met with disastrous results. And past performances have shown<br />\nconclusively that the financing of the book without outside help is<br />\nentirely within the range of human possibilities. We feel that the<br />\nHullabaloo Business Board is contemplating a bad precedent.<br /><br />\nR. G. S. in the Sunday Sun wonders if the reason for the play's<br />\nfailure isn't this:<br />\n\"Abraham Lincoln was a national hero, and the play built an him<br />\nsucceeded largely because of that<br />\nfact. Lee is a sectional hero and<br />\nthe drama of his life is now playing in a disinterested country.\"<br />\nWithout going into the dangerous tangle of sectional prejudices,<br />\nwe must admit that R. F. S. explains very nicely the current success of \"Queen Victoria\" in New<br />\nYork, to say nothing of the sale<br />\nof the biographies of such national<br />\nheroes as Jefferson Davis, Freiherr<br />\nvon Shoen, Caleb Cushing, Leopold Auer, Michael Pupin, Edward<br />\nBok and Walter Damrosch.<br /><br />\nWe want<br />\na slogan<br /><br />\n176'<br /><br />\nS<br /><br />\nS6liky;fy<br />\nCevi<br />\neel<br /><br />\ndescribing the hinged<br />\ncap that can't get lost.<br />\nCan you give it to us?<br />\nPerhapsyou shavewith<br />\nWilliams'and knowhow<br />\ngentle and soothing its<br />\nquick-working lather is to<br />\nthe skin. Perhaps you<br />\nhaven't begun to use Williams' yet. Whichever the<br />\ncase, we'll pay real money<br />\nfor your ideas.<br /><br />\n$250 in prizes<br /><br />\nFor the best sentence often words orless on<br />\nthe value ofthe Williams'Hinged Cap,we offer thefollowingprizes:1st prize$100;2nd prize<br />\n$50;two third prizes,$25each;two4thprizes,$10<br />\neach;six5thprizes,$5 each.Any undergraduate<br />\norgraduatestudentiseligible.Iftwo ormore persons submit identical slogans deemedworthy of<br />\nPrizes,the full amountof the prize willbe awarded to each. Contest closes at midnight March 14,<br />\n1924. Winners will be announced as soon thereafter as possible. Submit any number of slogans<br />\nbut write on one side of paper only,putting name,<br />\naddress, college and class at top ofeach sheet. Address letters to Contest Editor, The J. B.Williams<br />\nCo.,Glastonbury,Conn.<br /><br />\nTaking the kick<br />\nout of a beard<br />\n01111111111111111.lb<br />\nVI t i!::'• ..,ifI'ffriii<br />\nk.<br />\n.<br />\n00<br />\n*it ,k,<br />\n11 .., , :„,, •• i1111\",•,..:.;:y<br />\n;1<br />\n...,:•• , . '.,•<br />\n-\\1<br /><br />\nAFTER shaving,does your face<br />\nEa.sting—feel raw? Don't blame<br />\nit on your razor. The fault lies<br />\nelsewhere.<br />\nUnless your beard is properly<br />\nmassaged by a supple, pliable<br />\nshaving brush with just the<br />\ncorrect degree of stiffness, the<br />\nkeenest razor blade grows dull<br />\nand pulls.<br />\n3 shaving brush<br />\ncomforts<br />\nYou will.find a Rubberset Brush<br />\nhas 3 important comforts.<br />\nYour beard, however tough,<br />\nsoftens easily,as Rubberset's fine,<br />\nfull bristles whip up a quick, generous lather... one that goes to<br />\nthe roots of each hair, holds it<br />\nfirmly erect, easy to cut.<br />\nRubbing in the lather with your<br />\nfingers becomes unnecessary.<br />\nRubberset bristles are gripped<br />\neverlastingly in hard rubber.<br />\nThey can't come out and mix<br />\nwith the lather.<br />\nEach Rubberset Brush is guaranteed—unconditionally. The<br />\nbristles stay in. It makes good or<br />\nwedo. Getyourstoday atany store<br />\non the campus.Made byRubberset<br />\nCompany, Newark, N.J., U.S. A.<br /><br />\ntlie<br /><br />\nquorl cica<br /><br />\nt a n dard<br /><br />\n;<br />\n\"A\"<br /><br />\nSHAVING BRUSH<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br />\nit<br />\n‘d<br />\nof<br />\nth<br />\ne<br />\n1(1<br />\n-(l<br />\nIll<br /><br />\n)e<br />\ny,<br />\nnt<br />\nrs<br />\nrn<br /><br />\nnd<br />\n:es<br /><br />\nPROF. MAGOFFIN DEFENDS<br />\nCLASSICS<br />\n\"Latin and Greek Are the Foundation<br />\nof Our Education,\" Former Hopkins Professor Tells N. Y. U. Class<br /><br />\n\"The student who has had a<br />\nclassical education is superior to<br />\nthe student who lacks this advantage,\" Prof. Ralph Van Deman<br />\nMagoffin, head of the Department<br />\nof Classics at New York University, told the Heights Freshmen at<br />\nthe Orientation lecture on \"The<br />\nClassics.\"<br />\n\"The Classics are the foundations of our education. The student<br />\nwho has had the proper training in<br />\nLatin and Greek is bound to succeed. For it teaches the student<br />\nto think, to work out things for<br />\nhimself and enables him to do<br />\nthings in a more able and pleasant<br />\nway.\" Professor Magoffin cited numerous examples in which the<br />\nClassics had been of great aid to<br />\nmen after their graduation.<br />\nProfessor Magoffin Also showed<br />\nthat the Classics Were still of vital<br />\nimportance by telling of the action<br />\nFrance has taken recently in regard to them, to the effect that<br />\nevery student in France-must take<br />\na four year course in Latin as well<br />\nas two years of Greek. For the<br />\nFrench government realized that<br />\nthey no longer held the high place<br />\nin education which they had before<br />\nthe great war, and that in order to<br />\nregain it, they must restore Latin<br />\nand Greek.<br />\n\"Education may be divided into<br />\nthree clases, material, sentimental<br />\nand real. The material consists in<br />\ngiving the student just enough<br />\nknowledge for him to be able to<br />\nearn the 'Almighty Dollar.' But no<br />\nnotion of materialism has ever survived. The sentimental consists<br />\nin permitting the student to choose<br />\nwhat subjects appeal to him, and<br />\nto study only these. No young<br />\nman educated in this way will succeed, he is bound to be found wanting, when a crises approaches. A<br />\nreal education in anything ana<br />\neverything which is going to give<br />\nyou the basis of a well balanced education, and the thing necessary to<br />\nsuch an education is-the Classics.<br />\nThat is why France found it necessary to adopt it. For from the<br />\nClassics spring the •Sciences, Philosophy and other subjects.\"<br />\nTopics Include Religion<br /><br />\nProfessor Magoffin's address<br />\nwas one of the series of Orientation lectures, which are being given in order to help the freshmen<br />\n\"find themselves\" in University<br />\nlife. Topics which have been created before include religion, the<br />\nlibrary, and the University organization.<br />\nProfessor Magoffin is a noted<br />\nclassicist, who is president of the<br />\nArchaeological Institute of America and who has lectured widely<br />\nin this country and abroad. He is<br />\na well-known writer and formerly<br />\ntaught in Johns Hopkins University.—N. Y. U. News,<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nOUR MEN'S SHOP<br /><br />\nJAS. H. DOWNS<br /><br />\nSpecializes in<br /><br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br /><br />\nDistinctive Furnishings<br />\n—the kind that is being sought<br />\nby the exacting college man.<br /><br />\nTHE DINING ROOM OF<br /><br />\nTHE HCPKINS<br />\nat 31st. and St. Paul Streets<br /><br />\nHUTZLER 13KfftlEM<br /><br />\nServes Regular—<br />\nBreakfast, 7.30 to 10 A. M.....$ .75<br />\nLunch, 12 to 2 P. M.<br />\n.65<br />\nDinner, 6 to 7.30 P. M.. .$1.00 &amp; 1.25<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\n.3'W:earner Cdcaveite and gliztaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\nOR A LA CARTE<br />\nMeal Hours Sunday and Holidays<br />\n8 to 10.30 A. M.<br />\n12 to 2 P. M.<br />\n6 to 7.30 P. M.<br />\nLuncheon and Dinner Parties at<br />\nReasonable Rates<br /><br />\nPythias—<br />\n\"He meant that I'd never be able<br />\nto do good work with a poor pencil.<br />\nGuess I'll have to get a Dixon's<br />\nEldorado. Old Smity says it's the<br />\nbest drawing pencil made.\"<br /><br />\nDIXON'S<br /><br />\noRADO<br /><br />\n7he masterdrawegpencil\"<br />\n17 leads—all dealers<br /><br />\n120§1/12111111/1111111/1111/11MMINIBINIMMI.<br /><br />\nHOCHSCHILD.KOHN &amp;Co.<br /><br />\nA Record StillUnbroken<br />\nAt 5:20 P. M., March 8th, 1920, Westinghouse Turbine Established World's<br />\nRecord for Continuous Running.<br /><br />\nWhat Engineering Owes<br />\nto Good Workmanship<br />\nHEN Westinghouse installed a 45,000<br />\nK.W.Turbine in<br />\nthe power house of the Narragansett<br />\nElectric Light Company,Providence,<br />\nR. I., early in December, 1919, there<br />\nwas no thought of more than the<br />\naverage weekly power house run.<br />\nAbnormal weather conditions, however, brought so steady a demand for<br />\npower, that the unit was not shut<br />\ndown until March 8th, 1920, after a<br />\ncontinuous run of 84 days, 11 hours,<br />\nand 36 minutes.<br />\n45,000 K. W. Westinghouse Cross:Compound Turbine Unit at the Station ofthe Narragansett<br />\nElectric Light Company, Providence, It. I.<br />\nThis was especially remarkable in<br />\nthat the unit consists of two turbine<br />\nEqually impressive, oil was pumped through<br />\ngenerator sets, each of which operates indethe self-contained lubricating system to the<br />\npendently of the other, so that the result was<br />\nbearings at the rate of 600 gallons a minute.<br />\nthe mechanical equivalent of operating a<br />\nHad the oiling system failed for only 30 secsingle machine continuously for 169 days.<br />\nonds, the bearings would have been wrecked,<br />\nIf space permitted, many astounding figures<br />\nand other parts of the unit harmed!<br />\ncould be cited—about the K. W. H. generated<br />\nduring this period, the water and coal used,<br />\nThere is interesting history back of the<br />\noperation of Westinghouse Turbine Units of<br />\nthe cooling system, the oiling system, etc.<br />\n3,000 K. W. and higher. Notable records have<br />\nFor example,to keep the generators cool,over<br />\nbeen made in many of the world's great power<br />\n18,000,000,000 cubic feet of air passed through<br />\nplants, performance that is a tribute to remarkthem, which equals 2,000 times the total<br />\nable engineering and good workmanship.<br />\nweight of the generators and their bed plates.<br /><br />\nWestinghouse<br />\nACHIEVEMENT<br /><br />\nLECTURE<br />\n\"Combustion Engineering\"<br />\nby Dr. A. G. Christie<br />\n109 M. E., 4.15 P. M.<br /><br />\n\"What did Professor Smith mean<br />\nthis morning when he told you<br />\nthat no man could ever make a<br />\nsilk purse out of a sow's ear?\"<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\n\"There is sand in this bread.\"<br />\nWaiter—\"That's to keep the butter from sliding off.\"—Exchange.<br /><br />\nNOTICE<br />\nCandidates for Debating<br />\nTeams<br />\nSophs Today<br />\nFrosh Tomorrow<br />\nG 112, 12.30<br /><br />\n3<br /><br />\nOPPORTUNITY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 18, 1923<br /><br />\n4<br />\nSTRATTON<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br /><br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 Days on Shirts<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nHOSIERY<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br /><br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE \"SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nCOTILLON CLUB HOLDS INFORMAL DANCE AT<br />\nHOMEWOOD<br />\n• The last Hopkins dance before<br />\nthe beginning of the Christmas holiday- festivities was held last Saturday night by the Cotillon Club. The<br />\nscene of the dance was the C. E.<br />\nHall, which still retained many of<br />\nthe decorations of the Sigma Chi<br />\n29 E. BALTIMORE ST.<br />\nBeta initiation dance.<br />\nAgents for JOHN B. STETSON HATS<br />\nThe occasion was rather in the<br />\nand FRATERNITY BANDS<br />\nnature of a trial dance. The Cotillon Club is considering holding<br />\nSaturday night dances frequently,<br />\nif not weekly, throughout the winter, if their popularity warrants<br />\ntheir continuation. The club may<br />\neven make the night dances a partial or complete substitute for the<br />\nusual tea dance. If the attendance<br />\nat both dances should be exceptional, the club is even prepared to<br />\nsponsor regular tea dances as well<br />\nas the night dances.<br />\nThe subscription price of the<br />\nnight dances is expected to be a<br />\nPrinters ot<br />\npopular feature. It is $1.00.<br /><br />\nV<br /><br />\n•<br /><br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br /><br />\nBARNSTORMERS HOLD FIRST<br />\nREHEARSAL<br />\nContinued from page 1<br /><br />\nBarnstormers assisted in the reading of the first act to give the<br />\nLoM BARD and SOUTH STREETS group of about 45 a more definite<br />\nidea of the gist of t he action.<br />\nCopies of this act were given to<br />\nFROSH-SOPH DEBATE TO candidates to study before the<br />\nnext rehearsal on Saturday afterTAKE PLACE JANUARY<br />\nnoon at 2 ,o'clock.<br />\nTENTH<br /><br />\nCollege Literature<br /><br />\nContest to Be Held During the Regular<br />\nAssembly Hour. Candidates<br />\nStart Work Today<br /><br />\nSe<br /><br />\nSTETSON<br /><br />\nHats<br />\nTHE smartness of a Stetson is only<br />\nthe first step—real appreciation of<br />\nStetson quality comes after long wear.<br />\nSTYLED<br /><br />\nFOR YOUNG<br /><br />\n\"Baltimore's Most Complete Sport<br />\nStore\"<br /><br />\nLIBERTY ST.<br />\nAT SARATOGA<br /><br />\nRevue Completely Hopkins<br /><br />\nMEN<br /><br />\nBachrach Rasin Co.<br /><br />\n\"Have You Bean to Lima\" is a<br />\nLUNCHEON<br />\nQuality<br />\nthree-act musical comedy, book,<br />\nTEA<br />\nATHLETIC &amp; SPORTING<br />\nFinal arrangements for the freshand lyrics by H. M. Smallwood,<br />\nDINNER<br />\nEQUIPMENT<br />\nman-sophomore debate were made<br />\n21, and music by Ed. Spieker, '16.<br />\nlast Wednesday at a meeting of the<br />\nMaryland Agents for<br />\nThe scene is laid in Peru and the<br />\nWright &amp; Ditson Victor Co.<br />\nDebating Council. The annual clash<br />\nSPECIAL PARTIES<br />\n1 1.30 A. M.<br />\nMEN'S SHOES<br />\naction centers around an Ameriwill be held on January the tenth<br />\nuntil<br />\nCampus Agent, -BUCK- BONNER<br />\ncan archaelogical expedition in 7.30 P. M.<br />\nOf the Better Class<br />\nPLAZA 6987<br />\nat the regular Thursday assembly.<br />\n14 N. HOWARD ST.<br />\nBALTIMORE<br />\nsearch of a tribe of Incas. The<br />\nThe subject of debate is, \"Resolved,<br />\nURNER BROTHERS<br />\nInca chief is a Ha'va'd graduate,<br />\nThat the Student Council should ex1 1 1 E. BALTIMORE STREET<br />\nercise over all matters of conduct which makes the use of the EngBaltimore<br />\nlish language possible. There are<br />\non the part of undergraduates the<br />\na great many comic scenes in the<br />\nsame authority that it now has to<br />\nTailors<br />\nrevue and doubtless a great many<br />\nenforce the Honor System.\" The<br />\nUniforms and Liveries<br />\nEstablished 1873<br />\nmore will be added as the rehearfreshmen will uphold the affirmasals progress.<br />\nA. H. FETTING MAN'FG<br />\n128 W. Fayette St., Near Liberty St.<br />\ntive side of the question.<br />\nJEWELRY CO.<br />\nBaltimore, Md.<br />\nThe<br />\nrendering<br />\nof<br />\nthis<br />\nmusical<br />\nHold Debate in Assembly<br />\nManufacturers<br />\ncomedy<br />\nwill<br />\nmark<br />\na<br />\nnew<br />\nera<br />\nin<br />\nthe<br />\nThe plan to hold the debate at<br />\nGreek Letter Fraternity Jewelry<br />\nhistory of Hopkins productions.<br />\n213 N. LIBERTY ST., Baltimore, Md. the assembly is a new one. In forWritten<br />\nby Hopkins, staged by<br />\nmer years the interclass debates<br />\nHopkins,<br />\nit will be entirely HopgEtgEILT.XNEIEDEITEEEIWIreigl=liglIME4E1111' were held at night and ,were folkins.<br />\nThe<br />\naim of the Barnstormlowed by dances. The attendances<br />\nand individuality is offered here at prices that are not<br />\ners<br />\nis<br />\nto<br />\nmodel themselves on the<br />\nfor the debates were sparse but<br />\nand<br />\ncannot be underquoted by any house at any time.<br />\norder<br />\nof the Triangle Club, Mask<br />\ngrew larger when it came time for<br />\n(1,Besides the reputation of an old-established firm<br />\ndancing. The assembly idea should and Wig, Hasty Pudding and<br />\nother<br />\nis back of each sale with a guarantee.<br />\ncollege<br />\ndramatic<br />\nclubs,<br />\nin<br />\nprove very successful and should<br />\nproducing<br />\nplays<br />\nentirely<br />\nrepresenarouse undergraduate interest in deIN-\\ZCOMM<br />\ntative of Hopkins.<br />\nbating.<br /><br />\nURNER'S<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nFURNITURE OF QUALITY<br /><br />\n,M0111-F<br />\nG1112<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\n\"The King of Lubricants\"<br /><br />\nTryouts for the sophomore debatteam will be held today (Tuesing<br />\nSHERWOOD BROTHERS, INC.<br />\nday) in Room 112, Gilman Hall, at<br />\nWIEgICIIAggrftlgEtECiENgEggEDREINCEEXE 12.30.<br />\nThe candidates for the<br />\nfreshman team will meet tomorrow<br />\nat the same hour and place. Each<br />\nBoys, the place to get your<br />\nteam will consist of three men who<br />\nmeals—and they are honhave shown the most promise in the<br />\ntryouts. Dr. French will preside<br />\nest-to-goodness meals, well<br />\nthe preliminary meetings and<br />\nover<br />\nreasonably<br />\nand<br />\ns erve d,<br />\nselect<br />\nthe teams.<br />\npriced—is at<br />\nInterest Lacking<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br /><br />\nNicholas Brown, Mgr.<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nDebating thus far this year has<br />\nattracted very little interest. For<br />\nthis reason the members of both<br />\nclasses are urged to give .thcir<br />\nwhole-hearted support to so commendable an enterprise. The annual freshman-sophomore debates<br />\nhave always given rise to much enthusiasm and should act this year as<br />\nan incentive for .class spirit.<br />\nThe Debating Council is making<br />\narrangements with the University<br />\nof Richmond for a debate to be<br />\nheld on March 24. The probable<br />\nsubject will be, Resolved, \"That the<br />\nUnited States should enter the<br />\nWorld Court.\"<br /><br />\nFURNITURE<br />\nMILITARY UNIT PRAISED BY<br />\nMARINE CORPS HEAD<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />\nContinued from page 1<br /><br />\napplicant will be required as a<br />\nman's diploma is considered as sufficient proof of his educational<br />\nqualifications. There will be the<br />\nusual physical examination, which<br />\nis customary in all applications to<br />\ngovernment service. Last of the<br />\nrequirements is the recommendation as to the character and ability of the applicant by President<br />\nGoodnow and Major Hoisington,<br />\nProfessor of Military Science.<br />\nTo the members of the Military<br />\nScience Department this letter is<br />\nhigh tribute. The recognition was<br />\nonly made possible by the hard,<br />\nearnest work of the students and<br />\nthe hearty co-operation of the instructors. Every official is high<br />\nly elated and all count on another<br />\nyear of brilliant triumph. All efforts are being extended to merit<br />\nmore such praise and to make<br />\nopenings for further distinction<br />\nalong military lines.<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\nAt the<br /><br />\nWashington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe purpose and program of this<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home“<br />\nfrom five to seven.<br />\nSunday morning worship at 1 1 o'clock.<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />"}], "field_media_file": [{"target_id": 37807, "display": null, "description": null, "target_type": "file", "target_uuid": "dbb63286-6a9b-4654-8c45-607a9ec3d54d", "url": "http://digital.library.jhu.edu/system/files/2022-03/13093-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13093, "target_type": "node", "target_uuid": "bcc44314-ad7d-431b-ae7c-d64b89374c35", "url": "/node/13093"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "02546f46-5615-43d3-88cb-b2d6ec7e01c6"}]}