{"mid": [{"value": 39082}], "uuid": [{"value": "feb5cb6e-9879-4a42-ac43-1ecba38db1ba"}], "vid": [{"value": 39082}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:15:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13791-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:15:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:15:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Uhr<br />\nVOL. LXV, No. 23<br />\n<br />\nKrttrr<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, APRIL 28, 1961<br />\n<br />\nPAGE FIVE<br />\n<br />\nThe University<br />\n<br />\nWhere Are We Going?<br />\nA good university must constantly ask itself<br />\n\"Where are we going?\" if it is to have any consistency in its objectives and direction. Every step<br />\nalong the way, the 4uestion must be posed, and every<br />\nstep along the way its leaders must be able to formullate an answer. The answer looks to the past, for that<br />\ncontains experiences which are invaluable to good<br />\njudgment; and it looks at the present, for that contains a fleeting and candid picture of the situation<br />\nas it exists. The News-Letter has turned to people<br />\nwho have the experience to answer the question, and<br />\nwe seriously hope that the answers will guide the<br />\nUniversity in its growth.<br />\nThe Editors<br />\n<br />\nIllrrita Vag :flihrrabit<br />\nyears of 'The Hop-<br />\n<br />\n'Today's Plans Are Modified<br />\nBy Tomorrow's Events' Prexy<br />\nBy MILTON S, EISENHOWER education to the United States,<br />\nfounded a medical school which<br />\nPresident of the University<br />\nwas the first to place the obliAny detailed projection of gation for scientific research on<br />\nthe development of the Uni- a level with the obligation to<br />\nversity over the next 10 or teach; its School of Engineering,<br />\nas early as 1913, presented a cur20 years must be imperfect, riculum which now is described<br />\nfor today's'plan may, often as \"engineering science\"; its<br />\nbe modified by tomorrow's School of Hygiene and Public<br />\nevents. It is possible, however, Health set the pattern for later<br />\nschools here and abroad in the<br />\nto make some sound generali- same<br />\nfield. The School of Medizations, for they can be firmly cine once again broke new<br />\nbased on the Hopkins tradi- ground when it embarked on a<br />\ntion and on the concept of new medical education program<br />\nthe mission of the University marked by flexibility and in—a concept which is shared tensification of training with a<br />\nto a remarkable degree of un- shortening of the time neces-<br />\n<br />\nSide by side, the evolution in four<br />\nkins Man' uniquely parallels the evolution, in 85 years, of<br />\nThe Johns Hopkins University. From the germination of an<br />\ni.dea—a.\"Baltimore experiment\"—when learned men were<br />\n(Continued on Page 7)<br />\ngiven the task of creating a true university, through the animity by the five faculties,<br />\nDR. MILTON S. EISENHOWER<br />\ntrials and tribulations, the growth, transition, and ex- the administration, and the<br />\npansion, the Hopkins has come to be the great center of Trustees.<br />\nan imposing sphere of influence. Similarly did we trans- To speak of \"adherence to tracend from inquisitive freshmen, with the idea of the bene- dition\" is far too often to sughold a static sitfit of knowledge in our minds, through our own trials and gest the desire toactively<br />\nto resist<br />\nuation, or even<br />\nfrontier,<br />\nnew<br />\na<br />\nof<br />\ncitizens<br />\neducated<br />\ntribulations, to become<br />\nchange. At Hopkins this is not<br />\nand to create our own spheres of influence—as 'Hopkins so. Because the University was<br />\nBy DEAN G. IL EVANS<br />\nMen.'<br />\nconceived as an experiment in<br />\nhigher education, and because all<br />\nThought about the development of the Faculty of PMMany concepts of Univerassociated with Johns Hopkins losophy during the next ten years involves examination of<br />\nsity life floated before us,<br />\ntake pride in the fact that its the objectives of that faculty and appraisal of the resources<br />\nPrevious to our first arrival<br />\nhistory shows a record of great<br />\navailable for their attainment.<br />\nat the Homewood. But with<br />\ninfluence in research and educaThe broad objective of the the development of inquiry<br />\na cautious amazement, as<br />\ntion, there is no disposition here<br />\nFaculty of Philosophy needs no among faculty and students. To<br />\nour first days rolled by, did<br />\nto bask in the glory of past<br />\naccomplishments. Members of revision if it is considered to be maintain a high level of inquiry<br />\nwe begin—but only begin—<br />\nthe faculty and others who prethroughout an educational into realize just what effect<br />\nproposals for ,consideration<br />\nsent<br />\nstitution, or throughout a segthis place would have on us.<br />\nare fond of quoting the admoniment of an institution such as<br />\nAfter a few weeks, we were<br />\ntion contained in the inaugural<br />\nthe<br />\narea covered by an arts and<br />\nbe<br />\nto<br />\n'freshmen,'<br />\nlonger<br />\npresino<br />\naddress of the founding<br />\nsciences faculty, is extremely<br />\ndent, Daniel Colt Gilman: \"UniS hunned, set apart, or<br />\ndifficult when the unit becomes<br />\nversities easily fall into ruts.<br />\nmocked; we were just plain<br />\ntoo<br />\nsmall or too large. These<br />\na<br />\nrequires<br />\nAlmost every epoch<br />\nStudents, associating with,<br />\nsize terms are, of course, relative<br />\nstart.\"<br />\nfresh<br />\nand difficult of proper. determihelping, and learning from<br />\nThus experimentation is in itnation. I anticipate some expanall the other students in all<br />\nyears, four years: self a part of the Hopkins trasion in the faculty and the stuthe other classes. It was a side<br />\n. Eighty-five<br />\nthe<br />\namong<br />\nis<br />\nthere<br />\nand<br />\ndition,<br />\nby side.<br />\ndent body in the arts and sciPeriod of eight o'clock<br />\nfaculties an unusual willingness<br />\nences, but I do not believe that<br />\nprofessors,<br />\nto undertake pioneering efforts.<br />\nclasses, fraternity rushing understanding<br />\nour major objective can be fulsince<br />\npioneering<br />\nWe<br />\nschedules.<br />\nof<br />\nrecord<br />\nstudy<br />\nThe<br />\nand<br />\nfights,<br />\nscribbled notes, water<br />\nfilled without holding down our<br />\nfirst days of the university.<br />\nWere little universities, each one of us, suddenly handed a thosefamous<br />\nsize.<br />\nthey<br />\nfor the changes<br />\nThe undergraduate student<br />\nmultimillion dollar endowment and told to us it to best now<br />\nwrought in higher education, is<br />\nbody in the arts and sciences<br />\ndevelop ourselves.<br />\nUniverThe<br />\none:<br />\nimpressive<br />\nan<br />\nAs time matures a university, and allows it to better sity, having brought graduate DR. G. HEBERTON EVANS<br />\n(Continued on Page 9)<br />\nand<br />\naffix its goals, so did time bring us to new horizons,<br />\npush away the darkness around higher education. Whatever our notions of the true meaning of higher education<br />\noriginally were, for most of us time brought a change of<br />\nattitude. While, perhaps, our goals were not yet in sight,<br />\nWe began to feel more secure about being on the right<br />\nroad; we were firmly in the guiding hands of The UniverBy DEAN W. K. MORRILL<br />\nter the play, a dance was held in houses. Assemblies, class-meetsity.<br />\nand<br />\ntogether,<br />\na small hall above the foyer of ings, and athletic contests were<br />\nfit<br />\nto<br />\nbegan<br />\nall<br />\narBefore the last war there the<br />\n\"I have found you an<br />\nLyric or in the fraternity well<br />\nfit together beautifully. The<br />\nattended. Nor was there any<br />\na<br />\nwas<br />\npride<br />\nfeeling<br />\ndistinct<br />\nof<br />\ngument; I am not obliged to<br />\n(Continued on Page 6)<br />\nlack of applicants for staff posi.<br />\non the part of the student body<br />\nfind you an understanding,\"<br />\ntions on the News-Letter or the<br />\nin extra-curricula activities.<br />\nsaid Samuel Johnson. The<br />\nHullabaloo.<br />\nThe Musical Club concerts<br />\nargument had been before<br />\nThen came the war and folwere held at the Maryland<br />\nus, unanswered, while we<br />\nlowing it a decided change in the<br />\nCasualty Auditorium before a<br />\nattitude of the student body tosought the right road to our<br />\nparward extra-curricular activities.<br />\nstudents,<br />\npacked<br />\nhouse<br />\nof,<br />\nto<br />\nbegan<br />\nit<br />\nsoon<br />\nBut<br />\ngoals.<br />\nThere were at least two reasons<br />\nents, and other guests. After<br />\ndawn upon us that we were<br />\nfor this. First the academic prothe concert, .a dance was algram was becoming much more<br />\nfinding an understanding.<br />\nways held in the Casualty balldifficult with the trend toward<br />\nroom.<br />\nRealizations formed in our<br />\ntheory and undergraduate reSome weeks later the Barnsearch and, secondly, the compeminds that we were gaining<br />\nstormers, as was their custom,<br />\ntition for grades was increasing<br />\ninsights, we were becoming<br />\nat<br />\npresented their annual play<br />\nas more students applied<br />\nsince,<br />\nthe Lyric. Once again the plays<br />\nenlightened. It was, so to<br />\nfor admission, the caliber of<br />\nand a large<br />\nwere<br />\nwell-received<br />\nthose admitted improved. Even<br />\nspeak, the beginning of the<br />\ncrowd attended. The fraternities<br />\nthough these changes are necesWords,<br />\ntheir<br />\nbeginning.<br />\nend of the<br />\noccupied the boxes with<br />\n(Continued on Page 9).<br />\nDR. W. KELSO MORRILL<br />\nbanners proudly displayed. Afideas, formulas, reasons — With a cautious amazement.<br />\n<br />\nFaculty's Objectives<br />\nHinge On Class Size<br />\n<br />\n'OldDays'AtHomewood Campus<br />\nReveal Key To Hopkins Spirit<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 28, 1961<br />\n<br />\nNEWS -LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nAw reness Of Med School Role Stresse<br />\nuality,Not uantily<br />\nKeynotes Expansion<br />\nBy THOMAS B. TURNER, M.D. tioner; that the long arm of our<br />\nDean of the Medical Faculty<br />\ninfluence<br />\nwill<br />\nextend<br />\neven<br />\nProphecy is usually less a further beyond the boundaries Of<br />\n(rift<br />\nt, than a form of self-indul- our own country; that we shall<br />\ngence, prompted in this in- be more concerned than formerly<br />\nstance, however, by the Editors with the education of specialists<br />\nof the News-Letter. The Uni- that help the physician in the<br />\nof the science and art<br />\nversity, and particularly. that practice<br />\nof medicine.<br />\nsegment of which I speak, the In the Medical School, teachSchool of Medicine, is people ing and research have always<br />\n—people seeking to under- gone hand in hand. We shall<br />\nbring under more intensive study<br />\nstand other people in health those major afflictions which<br />\nand in disease, their strengths plague mankind everywhere —<br />\nand weaknesses, their hopes cardiovascular diseases, the aland fears; and people have a lergies, congenital and heredi'high degree of unpredicta- tary defects, cancer, and psychic<br />\nabnormalities. Investigation of<br />\nbility.<br />\nthese fields will carry us from<br />\nGreater Awareness<br />\nBut it is likely that we shall molecular biology to clinical<br />\ngo toward a greater awareness medicine and surgery.<br />\nQuality, Not Quantity<br />\nof the vital role of the Medical<br />\nFor these tasks we shall conSchool in contributing to the<br />\nhealth of people everywhere; tinue to seek men and women<br />\nthat we shall be more conscious with brains, character, imaginaof our obligations to help set tion, and industry; and help<br />\nhigher standards at all levels of them maintain an environment<br />\nmedical education, pre-medical, for a scholarly and creative life.<br />\nmedical, post-doctoral, and con- The emphasis will continue to<br />\ntinuing education for the prac- be on quality, not quantity.<br />\n<br />\nVeritas Vos Liberabit<br />\n<br />\nABOVE—One of the great steps in the development of the Johns Hopkins Medical Center is<br />\nthe construction of the Children's Medical Center.<br />\n<br />\n(Continued from Page 5)<br />\n<br />\npicture they formed pointed straight towards our goals,<br />\nand it was all downhill.<br />\nWe came with the answers; now we shall leave<br />\nwith the questions. How ironic it is to find that higher<br />\neducation has not given us what we thought we really<br />\ncame for: all the answers. In reality it has shown us that<br />\nthere are a multitude of unanswered questions facing this<br />\nearth; it has made us aware of these questions, and has<br />\ndeveloped the tools we brought witli us so that we might<br />\ncorrectly answer them. We had the answers all along; it<br />\nwas what they were the answers to that really brought us<br />\nto Hopkins. This was our real challenge, and it shall continue to be so.<br />\nIt is for the future to tell us how we have met this<br />\nchallenge. Some of us will meet it sqaurely, as in research,<br />\nwhile others will serve to broaden it through development;<br />\nsome will choose to carry the challenge to still more people<br />\nby returning to education; still others will not answer the<br />\nchallenge, but only create more questions and hence more<br />\nchallenges. We are all 'Hopkins Men' now, each with a<br />\nsphere of influence, just like our University. Or perhaps<br />\nwe would rather feel that we have enlarged the sphere<br />\nthat surrounds Johns Hopkins.<br />\nIt is 85 years, and ,it is 4 years, all at once; a university and a student. For both it has been a rich and exciting<br />\nexperience; for both it is now \"Where are 'we going?\"<br />\nG.S.<br />\n<br />\nBELOW—An aerial view of the present Johns Hopkins Medical Center to which the Children's<br />\nHospital will be added.<br />\n<br />\n---RESEARCHERS PUSH NEW FRONTIER---<br />\n<br />\nit II •<br />\n<br />\nir,*0•••••••<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 28, 1961<br />\n<br />\nPAGE SEVEN<br />\n<br />\nNEWS -LETTER<br />\n<br />\nIdeas, Plans Of BIA pporiunities, Challenges Exist;<br />\nHit Faulty Support It's Good To Be At MU<br />\naround Hopkins, such as _Druid<br />\nBy ALAN NOGEN<br />\n• Hill Park, are utilized. Pres. of BIA •<br />\nFraternity Athletics<br />\nWithout wishing to sound<br />\nAt present the intramurals at<br />\noverly pessimistic, I must say<br />\nthat I feel the intramural pro- Hopkins are really conducted on<br />\ngram here will become worse be- one level: the fraternity competition. It is unfortunate to state<br />\nfore it becomes better.<br />\nthe BIA could be no more<br />\nthat<br />\nthe<br />\nIt is literally impossible for<br />\nBoard of Intramural Athletics appropriately called the Board of<br />\nto run a diversified program Fraternity Athletics. The only<br />\nWith the lack of _facilities and genuine spirit that has been<br />\nPlaying space available. As any- generated on campus is in the<br />\none playing intramural basket- fraternities.<br />\nIndependent competition is alball this winter could attest, the<br />\nnon-existent with the<br />\nmost<br />\ncompletely<br />\nwas<br />\ngVmanasium<br />\nscheduled up and there was no formation of dormitory leagues.<br />\ntime for any free play. The fault The DSRC attempted to run a<br />\nof the situation is difficult to separate intramural program for<br />\nblame on any one person. Per- Dorm students and found partihaps those most at fault are the cipation difficult to obtain in<br />\nstudents whose lack of participa- most events.<br />\nDichotomy<br />\ntion has allowed the athletic<br />\nThe present situation of a difacilities to be generally ade(Continued on Page 12)<br />\nquate.<br />\nEquipment Exchanged<br />\nIt is unfortunate that any<br />\ngood equipment that has found<br />\nits way into the intramural program, such as used in lacrosse,<br />\nhas been exchanged by student<br />\nParticipants for their personal<br />\nPoorer gear. Generally the equipment used in intramurals is<br />\nvarsity hand-me-downs and not<br />\nadequate.<br />\nAs participation in all facets<br />\nOf intramural activity increases<br />\ndue to an increase in the number<br />\nOf students, there will be a<br />\ngreater scarcity of usable gear.<br />\nI am hopeful that in the not too<br />\ndistant future the athletic department will begin buying<br />\nequipment designed solely for<br />\nthe intramural program. The<br />\nThe only existing locker faciliProblem of field 'space menioned ties on the Homewood campus<br />\npartially which serve all athletic activities<br />\nbe<br />\nPreviously can<br />\nfields and events.<br />\nathletic<br />\nif<br />\nalleviated<br />\n<br />\nBy, MARSHALL TURNER<br />\n<br />\nopportunity and challenge. We al- to assure satisfactory human<br />\nrelationship and human happiness. In spite of the progress of<br />\nculture through the ages, and<br />\nthe phenomenal discoveries of<br />\nscience, the human being has not<br />\nchanged, only his<br />\nbasically<br />\nmeans of expressing his humaness.<br />\nI hope, therefore, as we rise<br />\nBut with all the prospect of to the challenge and the opporsuch an exciting future in edu- tunity of the future, that we do<br />\ncation, I have one concern. The not forget it is the person who<br />\nexplosion of new knowledge and is doing the rising. It is still the<br />\nstudent population makes me human being who makes it. posfear that we can easily lose sight sible to have challenges and to<br />\nof the individual as a human meet them. Let us therefore<br />\nbeing—as a human being having consciously call attention to the<br />\na mind, a body, and a soul, in- fact that student to student, stuseparable and intertwined, so dent to faculty, and faculty to<br />\nthat every activity in which hu- faculty relationships should unmans engage has these three dergird all the pioneering and<br />\naspects to it. The tremendous experimenting we are free to do<br />\ndemand for individual skills, the here at Hopkins. Don't let us<br />\nmass of students to be given take these relationships for<br />\nthese skills, the constantly en- granted, because if we do, sucmass of _ knowledge cessfully meeting the challenges<br />\nlarging<br />\n.needed to be transmitted to each of the future will be a hollow<br />\nsucceeding group of students, and mocking triumph.<br />\nthese all place a terrific burden<br />\n•t<br />\nand pressure on the single indito<br />\nestabtrying<br />\nstudent<br />\nvidual<br />\nlish his identity, to learn his<br />\nstrengths and ,weaknesses, and to<br />\ndiscover his purpose in life. And<br />\nhe must do all these things<br />\namong all his fellow-students<br />\nwho are trying to do the same<br />\nthing, and whom he needs as<br />\nmuch as they need him.<br />\n<br />\nready have the tradition of pioneering; we already are oriented<br />\ntoward experimentation as a<br />\nmajor activity on our campus.<br />\nWe have no sacred cows to worship and idolize other than the<br />\nfreedom to pioneer and experiment.<br />\n<br />\nMARSHALL TURNER<br />\n<br />\nWhat a time to be active hr<br />\nthe world of education! Perhaps never before has education been in such ferment.<br />\nProblems of organization, Content, administration, purpose<br />\nand philosophy of educational<br />\nactivities have never undergone such a critical and penetrating evaluation as now. But<br />\nwhat an opportunity and challenge to be able to help in solving and evaluating these problems! It is really like the excitement before the. big game<br />\n—being keyed up and committed to an all-out effort. It's<br />\none of life's greatest experiences and rewards.<br />\nIt is good to be at Hopkins at<br />\n<br />\nWith so many other goals that<br />\npeople seem to feel are more<br />\nimportant, or worthy, or desirable, human happiness and human relationships tend to be<br />\ndowngraded, or at the least to<br />\nsuch a time. We are in a won- be taken for granted. But mere<br />\nderful position to rise to this physical maturing does not seem \"A Mind, a body, and a soul.\"<br />\n<br />\nPrexy Views Development Of JHU<br />\n(Continued from Page 5)<br />\nsary for a capable student to<br />\nreach the M.D. The faculty of<br />\nthe School of Engineering is currently engaged in a critical review of its entire program in<br />\nrecognition of the need for men<br />\ntrained to higher levels of creative work in engineering science.<br />\nA list of this sort could be extended for many pages, but this<br />\nsurely is unnecessary.<br />\nIt is evident to all who know<br />\nHopkins that the University<br />\nknows where it is going. It has<br />\ncommitted itself to the highest<br />\nattainable standards of quality<br />\nin undergraduate instruction,<br />\ngraduate study and training, and<br />\nfaculty scholarship. In this way,<br />\nit hopes to continue the atmosphere in which scholars,<br />\nscientists and teachers will develop, and will carry with them<br />\ninto other institutions and fields<br />\nOf endeavor the influence of the<br />\nHopkins tradition. That this<br />\nUnique mission is being successfully pursued is shown by the<br />\nfact that more than 4,500 Hopkins graduates hold high research and teaching posts in<br />\nother universities; by the remarkable percentage of Hopkins<br />\ngraduates elected to the National Academy of Sciences; by the<br />\nnumbers of Ph.D. graduates conducting industrial research.<br />\nnow<br />\nhas<br />\nUniversity<br />\nThe<br />\nreached a state of maturity, with<br />\na firm philosophy permeating its<br />\nstructure, which permits it to<br />\nachieve its aims without tendencies to flirt with innovation<br />\nfor the sake of novelty. Its decisions are reached without<br />\nhaste, and the procedures for<br />\nconsidering them prevent the<br />\ndangers of superficial thinking.<br />\nThus, while experimentation is<br />\neagerly undertaken, it is equally<br />\nrecognized that experiment must<br />\nbe followed by consolidation of<br />\nthe values demonstrated by exPeriment: this in turn is followed by re-evaluation and a<br />\nWillingness to change when new<br />\ndirections or new objectives are<br />\nindicated.<br />\n<br />\nWith the much-publicized and<br />\nvery real explosion of knowledge,<br />\nthe demand for intensification<br />\nof research, as well as demands<br />\nfor broader inter-disciplinary<br />\napproaches to both established<br />\nand newly realized problems, is<br />\nincreasing greatly. This imposes<br />\n<br />\nheavy burdens on a university,<br />\nand on other intellectual institutions. Some of these problems<br />\ncan be met more effectively, and<br />\nwith less duplication of effort,<br />\nby the development of closer relationships among these institutions or by actual affiliation.<br />\n<br />\nThus:<br />\n... The Johns Hopkins School<br />\nof Advanced International Studies and the Brookings Institution are preparing to share intellectual resources, without loss<br />\nof identity of either institution,<br />\nto the benefit of both; and by<br />\n<br />\nigut Tomprrssrb---<br />\n<br />\nlocating them in proximity to<br />\neach other in their new buildings it is hoped to establish the<br />\ncore of a growing cultural center<br />\nwhich will have even greater effectiveness and influence in the<br />\nfield of public sudies.<br />\n. . . Similarly, the Carnegie<br />\nInstitution of Washington is<br />\nmoving its Embryological Laboratory, now inadequately housed<br />\nin the Johns Hopkins School of<br />\nMedicine, to the Homewood<br />\nCampus, where its work will continue in close conjunction with<br />\nthe research of the Department<br />\nof Biology and the McCollumPratt Institute, as well as the<br />\nSchool of Medicine.<br />\n. . . The Children's Rehabilitation Institute, working in research and patient care for those<br />\nafflicted with cerebral palsy, is<br />\naffiliating with the School of<br />\nMedicine and Hospital, in an<br />\narrangement which assures high<br />\nstandards of quality.<br />\n. . . The Department of Art,<br />\nin collaboration with Goucher<br />\nCollege, the Walters Art Gallery,<br />\nand the Baltimore Museum of<br />\nArt, has entered into an integrated program in which each<br />\ninstitution makes its own intellectual contribution, to the benefit of all.<br />\nThese developments enhance<br />\nthe programs of each of the related institutions without imposing a drain on 'financial resources, and so they are fostered<br />\nwith enthusiasm.<br />\nOn the medical campus, a<br />\nconcerted effort has been made<br />\nto bring into effect joint departments for the School of<br />\nMedicine and the School of<br />\nHygiene and Public Health, to<br />\neliminate unnecessary duplication of effort, make financial<br />\nsavings, and broaden the concepts of departments. With the<br />\ngrowth of importance of preventive medicine, on the one hand,<br />\nand the essentiality of deeper,<br />\nbetter training in the basic medical sciences on the other, this<br />\n(Continued on Page 8)<br />\n<br />\n\fNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br />\n<br />\n-Homewood's Future-<br />\n<br />\nrojected Growth<br />\nViewed By Prexy<br />\n<br />\nPAGE EIGHT<br />\n<br />\n(Continued from Page 7)<br />\norganizational change has already made a notable initial<br />\nrecord of success.<br />\nIn all its activities, Hopkins<br />\ndoes not carry lightly its obligation to play a role of leadership.<br />\nThe University has been fortunate in having firmly maintained a tradition of freedom<br />\nwhich eminent scholars have<br />\nfound congenial for their academic endeavors and which has<br />\nstimulated their productivity.<br />\nThey must also be compensated<br />\nadequately. Now the competition<br />\nis becoming keener; the large<br />\nstate universities are finding<br />\nfavor in the eyes of taxpayers<br />\nand legislatures and are receiving more generous appropriations. Many of them are alsci<br />\nbuilding graduate programs of<br />\nhigh distinction. The role of the<br />\n<br />\nprivate<br />\nThis aerial photograph of the Homewood campus and surrounding area shows the '73 acre<br />\ntract in Wyman Park on which the University intends to expand its facilities. In the right foreground is N. Charles Street and in the center of the picture is Keyser Quadrangle. In the left foreground is the Baltimore Museum of Art. The tract is located west of the campus and is bordered<br />\non the east by San Martin Drive. It is south of University Parkway and east of Tudor Arms Ave.<br />\n<br />\nuniversity in setting<br />\n<br />\never-higher standards of quality,<br />\nmaking innovations and, through<br />\ntheir independence, establishing<br />\nand protecting sound educational practices is still important.<br />\nBut they must be able to maintain faculties made up of great<br />\nscholars and teachers.<br />\nThe post-doctoral level seems<br />\nto be developing, by the way, as<br />\na new dimension in higher education, and I suspect that Hopkins will again find itself taking<br />\nleadership in its development.<br />\nWith nearly 585 post-doctorals<br />\nin residence now, Hopkins no<br />\ndoubt has the highest percentage<br />\nof any university in the country.<br />\nThe University will never, I<br />\nthink, grow greatly in size. No<br />\nphilosophical objection can be<br />\nheld to quantitative growth, if<br />\nit strengthens the quality of the<br />\nprogram—and in some areas<br />\nEiATPREStNT<br />\nsuch growth leading to greater<br />\n116 By Ii\"'<br />\nstrength will be encouraged.<br />\nnew areas of scholarship<br />\nSome<br />\nFTER VIES<br />\nED<br />\nwill also be entered—such as the<br />\nlarge field of radiological science<br />\nwhich is developing in a promising way now. But the commitment to quality places such deThe above diagram illustrates, by varieties of shading, the proposed development of the Home- mands upon the financial rewood campus if Wyman Park is acquired by the University. Top of the diagram points west; north sources of the University that to<br />\nis to the right side.<br />\nexpand in size requires greater<br />\namounts of funds than can be<br />\nreadily obtained.<br />\nTo maintain its quality standards and permit entry into some<br />\nnew fields of research and training is the purpose of the fundraising program, in which we<br />\nseek $76,000,000 over this tenyear period in addition to expectable levels of income. Among<br />\nthe essential projects to be supported in this program some<br />\nhave been realized, and others<br />\nare yet to be attained.<br />\nA $2,500,000 wing on Rowland<br />\nHall to improVe and expand the<br />\nfacilities for Physics is now in<br />\ninitial construction stages. A contract is soon to be let for the<br />\nOne of the ways the University can effect its<br />\nconstruction of the $11,000,000<br />\ngrowth is by expanding into Wyman Park.<br />\n<br />\nLei<br />\n<br />\nSr<br />\n<br />\n1'1<br />\n<br />\nr<br />\n<br />\nbuilding of the Children's Medical and Surgical Center. A<br />\n$1,000,000 engineering research<br />\nlaboratory building is soon to be<br />\nerected between Latrobe and<br />\nShriver Halls. A new $835,000<br />\nlaboratory wing for biological<br />\nresearch is going up at Mergenthaler. A $1,000,000 Biophysics building is being completed in East Baltimore. The<br />\nmoney is in hand and construction soon to be started on the<br />\nradiological sciences wing at the<br />\nSchool of Hygiene and Public<br />\nHealth.<br />\nAll of these bricks-and-mortar<br />\nprojects—most difficult of all to<br />\nfinance—are being undertaken<br />\nto foster intellectual developments.<br />\nPerhaps most important of<br />\nthem all is the construction of<br />\na new library on the Homewood<br />\nCampus. This project has been<br />\ngiven . highest priority in the<br />\nfund-raising program of the<br />\nUniversity because of its key importance to the University's<br />\nfuture. After all, the library is<br />\nthe intellectual and spiritual<br />\nheart of the University. It is<br />\nthe laboratory of the humanist<br />\nand the social scientist, and<br />\nwithout good library facilities<br />\nthe natural scientist and the engineer are severely hampered.<br />\nWith the erection of a new library to provide these facilities<br />\nneeded by every member of the<br />\nfaculty and every member of the<br />\nstudent body at Hopkins, we<br />\nshall have made a giant stride<br />\nof progress. Unexcelled bibliographical research facilities will<br />\nbe available to those who need<br />\nthem. With pressure relieved on<br />\nthe overcrowded facilities of<br />\nGilman Hall, we shall be able to<br />\nprovide the proper reading room<br />\nand reserve shelf facilities for<br />\nundergraduates and students of<br />\nMcCoy College. Because of its<br />\ncrucial importance, every effort<br />\nis being bent to achieve success<br />\nthe necessary<br />\nobtaining<br />\nin<br />\n$4,500,000 for the new library;<br />\nin this effort we must not fail.<br />\nIf space and time permitted,<br />\nI should want to go further into<br />\ndetail—to describe the new program in the History and Philosophy of the Arts and Sciences;<br />\nthe new programs to be inaugurated in statistics and in computer services; the improvements<br />\nbeing contemplated in engineering studies, and a dozen other<br />\nefforts representative of the<br />\ndynamism of this place and indicative of the directions in<br />\nwhich it is moving.<br />\nSince that is not possible. I<br />\nsubstitute this generalization: By<br />\nvirtue of its commitment to excellence in everything it undertakes, and because of the pioneering spirit which -pervades its<br />\natmosphere, Hopkins will never<br />\ncease to be a leader among universities.<br />\n<br />\nEmbryo Lab: Present And Future—<br />\n<br />\n\fPAGE NINE<br />\n<br />\nNEWS -LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br />\n<br />\nFaculty's Objectives Adams Sees Serious Need For<br />\nt<br />\nmen<br />\nern<br />\nGov<br />\nt<br />\nden<br />\nStu<br />\nzed<br />\ntali<br />\nRevi<br />\nnt<br />\nsta<br />\nCon<br />\nTo Remain<br />\n, (Continued from Page 5)<br />\nshould be increased somewhat if<br />\nqualified students who want to<br />\nconcentrate their work in the<br />\nhumanities and the social sciences can be found. The graduate student body can likewise be<br />\nsomewhat increased in particular departments, and a modest<br />\nnumber of post-doctoral fellows<br />\ncan be taken on by many dePartments. Moreover, faculty<br />\nMembers must be added; in some<br />\nfields the numbers are too small<br />\nto be sufficiently effective, and<br />\nfaculty for certain fields not now<br />\nrepresented on the staff—for example, mathematical statistics—<br />\nMust be added. These additions<br />\nto the faculty and the student<br />\nbody, which can or must be<br />\nMade, should not be allowed,<br />\nhowever, to destroy the great advantages inherent in small size.<br />\n<br />\nWe need funds right now to<br />\ntake care of the critical library<br />\nsituation. During the early portion of the next ten years, we<br />\nmust add floor space for classrooms, laboratories, and offices.<br />\nThe necessary additions to the<br />\nfaculty will need restricted gifts<br />\nor new endowment funds. A general research fund that will provide the faculty and students<br />\nwith equipment not available<br />\n<br />\nIn planning for the future, we<br />\nShould not have to face in the<br />\nnext ten years—as the University had to prior to 1916—a site<br />\nProblem. At the present time we<br />\ncan only hope that the City will<br />\nunderstand the nece4ty for assuring the Homewood campus<br />\nthe space essential for adequate<br />\ndevelopment. I think it reasonable, however, to assume farsighted action on the part of the<br />\nCity and an absence of a site<br />\nProblem,<br />\nFunds to support what any<br />\nUniversity is trying to do are<br />\nalways inadequate. Education<br />\nand research activities are expensive—and they are becoming<br />\nMore expensive as trained personnel grows smaller in relation<br />\nto the country's increasing student body and research tasks.<br />\nBut because so many of our<br />\ngraduates go into teaching and<br />\nresearch and because Hopkins<br />\nthereby makes a great contribution to the nation at large, the<br />\nraising of funds for the University should be relatively easy.<br />\nProspective donors who•have had<br />\nno previous connection with<br />\nHopkins can be shown, I firmly<br />\nbelieve, that any sum given to<br />\nHopkins can have a greater national effect than the same sum<br />\ncan produce at any other educational institution in the country.<br />\n<br />\nBy DAVE ADAMS<br />\nPresident, Student Council<br />\n<br />\nCouncil are more interested in<br />\nprestige and graduate school<br />\nthan in trying to do a good job<br />\nin their positions. The D.S.R.C.<br />\nand S.C. positions are hardly<br />\ncontested during the elections.<br />\nThe student body as a whole is<br />\nseldom concerned about what<br />\ntheir representatives are doing.<br />\n<br />\nbut that the affect will be minimized if student government is<br />\nstructurally sound.<br />\n<br />\nIn the last few years there<br />\nhave been more and more applications for admission received<br />\nand the result has been that<br />\neach successive freshman class<br />\nhas been better prepared and<br />\nTheir Prerogative<br />\nmore able to handle the work<br />\nIf there is only a limited conrequired of them at Johns Hop- cern among the undergraduates<br />\nkins.<br />\nabout student government, all<br />\nOne would imagine that each<br />\nsuccessive class would also be<br />\nmore interested in athletics and<br />\nextra-curricular activities. However, this does not seem to have<br />\nbeen the case because too few of<br />\nthe members of each class have<br />\noutside interests or are able to<br />\nmaintain here the interest in<br />\nsports and activities that they<br />\npossessed in high or prep school.<br />\n<br />\nIncreased Controls<br />\nStudent goverment may have<br />\nto face increasing administrative controls and infringements<br />\nif it is unable to do its job. If<br />\nthe undergraduates cannot govern themselves, they will pay<br />\nthe consequences. They are<br />\nthreatened with this to some<br />\ndegree now in the dormitories.<br />\n<br />\n--L'ETAT CEST M011--<br />\n<br />\nI won't go into the reasons for<br />\nthis. The reasons are discussed<br />\nand argued frequently enough<br />\naround campus, yet still nobody<br />\nseems to know exactly what they<br />\nare. Some say this condition is<br />\nprincipally the result of the admissions policy; others say the<br />\nfault lies with the administration's lack of concern for the<br />\nundergraduates or with the prevailing apathy which, like, a<br />\ncancer, eats away rapidly at the<br />\nhealthy enthusiasm often disDR. G. HEBERTON EVANS<br />\nOrienatation<br />\nduring<br />\nplayed<br />\nthrough grants and contracts is Week.<br />\nsorely needed. Additional scholMain Concert<br />\narship and fellowship money will<br />\nMy main concern here is to<br />\nhelp tremendously in maintain- suggest what the future might<br />\ning an outstanding student hold for student government at<br />\ngroup.<br />\nJohns Hopkins. If the trend outlined above continues—as I exten<br />\nnext<br />\nthe<br />\nThe problems of<br />\npect it will for at least five or<br />\nyears, it seems to me, are: the ten years—then student governdetermination of the \"right\" size ment will be a rather mechanical,<br />\n(and changing \"right\" size) for initiativeless element of extraHopkins and the financial prob- curricular activity.<br />\nlems associated with the attainThere are fewer and fewer<br />\nment of the appropriate growth.<br />\nable men involving themselves<br />\nin student government here.<br />\nMany of the DSRC representaPHOTO CREDITS- tives<br />\nare considered to be rather<br />\nineffective individuals. Many of<br />\nThis special supplement of<br />\nthe members of the Student<br />\nthe News-Letter could not<br />\nthe<br />\nwithout<br />\ndone<br />\nbeen<br />\nhave<br />\nassistance of Dale Ireland and<br />\nStan Klosk who took the pictures used in it.<br />\n<br />\nright—that's their prerogative.<br />\nBut one problem must be and<br />\ninevitably will be considered during the next few years.<br />\nThe mechanism of student<br />\ngovernment must be improved<br />\ngreatly, especially in the area of<br />\nrepresentation and of the handling of non-academic violations<br />\nof the Gentlemen's Code. If<br />\nstudent government is well organized, if it can function<br />\nsmoothly under its constitutions,<br />\nit can maintain itself in spite of<br />\nany lack of ability of those who<br />\nare involved in it. This is not<br />\nto say that lack of ability will<br />\nnot affect student government,<br />\n<br />\nThis is the reason student government must continue to exist<br />\nand must insure its strength to<br />\nsome degree through organization.<br />\nAs I have indicated, my opinion about the future is that<br />\nstudent government will continue functioning and will organize itself, of necessity, more<br />\nadequately. I would hope that<br />\nstrong student governing bodies<br />\nwill evolve which will undertake<br />\nworthwhile projects and improvements for the undergraduates' benefit. But I strongly<br />\ndoubt it. There aren't enough<br />\ninterested students.<br />\n<br />\nNew Library Gets Top Priority<br />\n<br />\n'Good Old' JHU Days<br />\nReveal Key To Spirit<br />\n(Continued from Page 5)<br />\nsary and good, a student that<br />\ndoes -not participate in some<br />\nphase of college life misses a<br />\ngreat deal. Regardless how minor<br />\na part it is, possibly just a loyal<br />\nmember of his class shown<br />\nthrough his interest and support<br />\nat class meetings, it helps to<br />\nteach one leadership, to develop<br />\none's personality, to widen his<br />\ncircle of friends, and to create<br />\na feeling of belonging. We hear<br />\nso much about the lack of \"Hopkins Spirit\".<br />\n<br />\nDR. W. KELSO MORRILL<br />\n<br />\nWhat is this so-called Spirit?<br />\nTo me it means a \"love for\" and<br />\na sense of \"deep loyalty\" to the<br />\nUniversity. I think participation<br />\nin activities as well as doing the<br />\nbest one can in the class room<br />\nthe<br />\nis important in producting<br />\nreal kind of \"Hopkins Spirit\".<br />\n<br />\nLack Of Law Division<br />\nHurts Hopkins Stature<br />\n(Continued from Page 10)<br />\nhas brought superior educational facilities to the area south of<br />\nthe Mason-Dixon Line. Let this<br />\nUniversity become complete. The<br />\nname Hopkins rates mentioning<br />\n<br />\nColumbia,<br />\nwith Harvard, Yale,<br />\nuniversities<br />\nand the other finest<br />\nHopkins<br />\nof America. Let a Johns<br />\nfamthe<br />\nout<br />\nround<br />\nSchool<br />\nLaw<br />\nacasuperior<br />\nof<br />\nous tradition<br />\nn.<br />\ndemics at this institutio<br />\n<br />\n•<br />\n<br />\n\fNEWS -LETTER<br />\n<br />\nPAGE TEN<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br />\n<br />\nRole 0 Fraternity System Presented<br />\n•<br />\n<br />\nBy FRANK DOUGHERTY<br />\nPresident IFC<br />\n<br />\nA fraternity system at any<br />\nUniversity plays a definite role<br />\nin building character and. integrity in the college man.. The<br />\ndeterminations of our fraternity system are not only to<br />\nbroaden the social life of the<br />\nindividual, but to'supplement<br />\nand assist academics and athletics .as well.<br />\n<br />\nThe place may change but the activities will always remain the same. While fraternities seek<br />\nnew housing in the Guilford section, the annual rites of bidding for new pledges and partying continue in their traditional fashion.<br />\n<br />\nLack Of Law School Causes<br />\nDrop In Stature Of University<br />\nBy CHARLES P. LICKSON<br />\nPres. Blue Key Club<br />\nWe who have the good fortune<br />\nto be attending this noble University are aware of the fact<br />\nthat it is among the finest in<br />\nthe world. The graduate departments are probably the most<br />\nfamous. I refer, especially, to<br />\nthe Medical School, the other<br />\nscientific departments, and those<br />\nliberal arts departments whose<br />\nprofessors command the respect<br />\nnecessary to appeal to the top<br />\ngraduates of the world's undergraduate schools.<br />\nThe catalogue of this University boa.sts of many schools, located in this country and abroad.<br />\nBut, to the keen academic eye,<br />\nthere Is one large gap. Johns<br />\nHopkins has no Law School. That<br />\nis not to say law is not studied,<br />\nhere. The ironic thing is that<br />\nwe are fortunate enough to have<br />\non our staff one of the outstand-<br />\n<br />\ning experts on American Constitutional Law and Jurisprudence. We also have very competant young professors whose<br />\nfields are International Law and<br />\nComparative<br />\nLaw.<br />\nHopkins'<br />\nLibrary has a very large collection of books in field of law<br />\nincluding the reports from most<br />\nstates, the entire federal system,<br />\nand many key foreign reports.<br />\nHopkins has begun new departments with far less to work<br />\nwith than this. Ls this not a<br />\nsubstantial nucleus from which<br />\na separate law school could possibly radiate? To those who<br />\nwould ask the question as to<br />\nfunds, a reference ought to be<br />\nmade to the huge number of<br />\nlawyers who are alumni of Hopkins. Many of Baltimore's largest<br />\nlaw firms are inhabited by Hopkins men. If they were approached, as well as the various<br />\nlocal bar associations, the ed-<br />\n<br />\nucational•<br />\nfoundations,<br />\nand<br />\nAlumni and friends of the University, a large sum could be<br />\nraised. Reinforced by the tuition<br />\nto be charged law students, the<br />\nfinances could be arranged.<br />\nThere are many lovely old buildings and houses that would serve<br />\nas ample location for a Law<br />\n<br />\nOne important problem that<br />\nfaces the fraternity system at<br />\nHopkins is the question of fraternity housing. Many of the<br />\nfraternity houses are neither<br />\nadequate nor comfortable enough<br />\nto accommodate the large number of brothers who desire to live<br />\nin the house. Many fraternity<br />\nmen must resort to renting<br />\napartments in the vicinity of the<br />\ncampus or living in the dormitory. As a result, there is a lack<br />\nof unity and strength within the<br />\nfraternity itself, resulting in a<br />\nloosely knit organization. Accommodation for all the brothers<br />\nin the fraternity house would<br />\ncreate a tighter inner cohesion<br />\nwithin the fraternity, promote<br />\ngreater spirit and perhaps reduce<br />\nmuch of the apathy that has<br />\noverspread our campus in recent<br />\nyears.<br />\nIdeal Situation<br />\nThe ideal situation would be<br />\nfor the administration to build<br />\na fraternity row on campus involving a long-term lease with<br />\neach fraternity. The fraternity<br />\nhouses could be constructed to<br />\nmeet the individual needs of the<br />\nfourteen fraternities here at<br />\nHopkins. The administration has<br />\ndiscussed the possibility of building a,dormitory-type fraternity<br />\ndwelling, with two or three separate dining halls, but this is<br />\ntotally unacceptable as it defeats<br />\nthe principal of uniqueness in a<br />\nfraternity and would result in<br />\none huge dormitory club. Since<br />\nI do not foresee any compromise<br />\nresulting between the fraternities<br />\nand the administration in ,the<br />\nnear future, the next alternative<br />\n<br />\nis to look toward Canterbury<br />\nRoad.<br />\nAs a result of the diligent efforts of one of our fraternities,<br />\nthere is a possible opportunity<br />\nthat adequate and comfortable<br />\nhouses will be available in the<br />\nvicinity of Canterbury Road.<br />\nThis move would further accommodate the needs of the fraternity men at Hopkins and<br />\nwould create a more spirited and<br />\nbinding fraternity system.<br />\nIntellectual Block<br />\nThe second problem that the<br />\nfraternities face at the Homewood is a serious intellectual<br />\nblock. The trend at Hopkins in<br />\nthe past four years is to attract<br />\nthe student who excels only in<br />\nachievement. This<br />\nscholastic<br />\ntrend is definitely a good attainment on the part of the administration, but while devoting<br />\nmuch attention to high school<br />\nscholastic achievement and seven<br />\nhundred College Board scores, we<br />\nshould not overlook the versatile<br />\nwell-rounded individual. Let us<br />\nnot sacrifice quality of character<br />\nand achievement in all aspects<br />\nof the student for the complete<br />\nintellectual prig. It would be to<br />\nthe advantage of • our fraternity<br />\nsystem, the entire student body<br />\nand the name Johns Hopkins to<br />\naccept the well-rounded individual rather than the pseudo ivyleague reject.<br />\n<br />\nFRANK DOUGHERTY<br />\n<br />\n-New Dance Step-<br />\n<br />\nSchool. Often, these large structures are not expensive and dealing could go through an alumnus who is in the real estate<br />\nbusiness. The City of Baltimore<br />\ncontains many fine lawyers some<br />\nof whom already teach at McCoy<br />\nCollege. Many of these lawyers<br />\nwould gladly serve as visiting<br />\nlecturers. This area needs a new,<br />\ngood Law School. Greater Baltimore and Washington represent one of the busiest areas of<br />\nlegal work in the country.<br />\nThe Johns Hopkins University<br />\n(Continued on Page 9)<br />\n<br />\nTime Out For Refreshment<br />\n<br />\nCotillion Board Head<br />\nStates Purpose,Plans<br />\nBy PETER TUTEUR<br />\nAs many of our fellow students<br />\nseem to feel, spirit at Hopkins<br />\nis at a low ebb. The fault lies<br />\nperhaps in the lack of awareness of the fact that you get<br />\nout of aomething only that<br />\nwhich you put into it.<br />\nThe purpose 'of the Cotillion<br />\nBoard is to serve the entire<br />\nundergraduate body through the<br />\ninitiation,<br />\ncoordination<br />\nand<br />\nscheduling of social events for<br />\nthe Hopkins community. We are<br />\nnot just a group with a name.<br />\nWe are first and foremost students who are only too well<br />\naware of the problem of creating an ideal social atmosphere<br />\nfor the Homewood campus.<br />\nAs the students who are directly charged with the responsibility for creating this social<br />\natmosphere, we realize what<br />\nmust be done. But as we stated<br />\n<br />\npreviously, the success of any<br />\nundertaking depends ultimately<br />\nupon the student body itself. If,<br />\nhowever, a little spoon feeding<br />\nwill help matters, we'll do that,<br />\ntoo.<br />\nBig Weekend<br />\nThere • is a definite need for•<br />\nan all-school Big Weekend. We<br />\nsee this as a practical answer to<br />\na fall social season which seems<br />\nweak when compared to campus activity during the Spring.<br />\nIt would probably be held on the<br />\nweekend of the last home football game and in close conjunction with the game itself. This<br />\nwould necessarily include such<br />\nevents as a pep rally with bonfires And food; also a victory<br />\ndance' and a „jazz concert, which<br />\nwould terminate the weekend. In<br />\norder to stimulate the idea of<br />\ntaking in all of the individual<br />\n(Continued on Page 11)<br />\n<br />\n\ft TUTEUR ANALYZES CAMPUS SOCIAL LIFE<br />\nHOMEWOOD, BALTIMORE, APRIL 21 1961<br />\n<br />\n(Continued from Page 10)<br />\nevents of the weekend, tickets<br />\nwould be sold in the form of<br />\nreduced price strip tickets, in a<br />\nManner similar to the June Week<br />\nticket sales.<br />\nOf course, events such as this<br />\ncannot be successful unless students attend. It has been noted<br />\nthat in the past such affairs as<br />\nPep rallies were never very successful. It has further been<br />\nsuggested that the reason for<br />\n<br />\nthese failures lies in the sentiment that such activities smack<br />\nof a certain childish or highis<br />\nwhich<br />\nquality<br />\nschoolish<br />\nbeneath the dignity of the socalled sophisticated college student.<br />\nPublicity Aides<br />\nAdequate publicity for all<br />\nsocial affairs has been a chronic<br />\nproblem. Several feasible measures to alleviate this problem<br />\nhave been arrived at. The<br />\n<br />\n(Author of \"I Was a Teen-age Dwarf\",\"The Many<br />\nLoves of Dobie Gillis\", etc.)<br />\n<br />\nPAGE ELEVEN<br />\n<br />\nNEWS -LETTER<br />\n<br />\nNews-Letter will be asked to give administration. In order to re- must be adequate. The Cotillion<br />\n<br />\nearlier and greater coverage new a close student-faculty Board is a group of nine stuwith providing soboth before major social events relationship, it has been sug- dents charged<br />\nfor a number more<br />\nand afterward follow up with gested that the annual Class Day cial activities<br />\nas large. Natupictorial displays. These follow- activities be modified into a than 100 times<br />\nthink for everycannot<br />\nwe<br />\nrally<br />\nclasses<br />\nWith<br />\nday.<br />\naculty<br />\nstudent-f<br />\nthe<br />\ninfect<br />\nhopefully<br />\nups will<br />\nsatisfy the needs of all<br />\napathetic member of our com- suspended, both students and one, nor<br />\n. If we are to serve<br />\nmunity with an enthusiasm to faculty members will be able to concerned<br />\nin the proper<br />\nthe<br />\nstudents<br />\nand<br />\nrelaxation<br />\nof<br />\nday<br />\na<br />\nenjoy<br />\nmissing.<br />\nare<br />\nthey<br />\nget in on what<br />\nathletic activities away from the capacity it is only fitting that<br />\nThe previously unused P. A. campus. An incidental result of the student body keep us insystem in the dormitory cafe- such a gathering. would be the formed as to their desires and<br />\nteria will be employed to pub- opportunity to air and discuss feeling concerning the social<br />\nlicize the calendar of events for campus problems and other calendar.<br />\nthe week. Lack of information issues.<br />\nWe exist as a group for the<br />\nwill no longer be an excuse for<br />\nThe demise of the Goucher- sole purpose of serving the<br />\nmissing events. This might be<br />\ning Committee Hopkins community. We sinextended to the dorm snack bar Hopkins Coordinat<br />\nresponsibility of cerely wish to perform our duand Levering P. A. systems as will leave the<br />\navoiding scheduling conflicts and ties to the fulfillment of your<br />\nwell.<br />\ncoordinating social events with interests. This is best .achieved<br />\nThe much heralded independthose of Goucher College.<br />\nby student support of the proence and freedom of the Hopkins<br />\nwhich are designed with<br />\ngrams<br />\nSocial life is an important<br />\nstudent is nothing more than<br />\nstudent benefit as the only aim.<br />\nutter neglect by faculty and facet of a college education. It<br />\n<br />\nTHE DEAN YOU SAVE MAY BE YOUR OWN<br />\n•<br />\n<br />\nNow in the waning days of the school year when the hardest<br />\nheart grows mellow and the very air is charged with memories,<br />\nlet us pause for a moment and pay tribute to that overworked<br />\nand underappreciated campus figure, your friend and mine, the<br />\ndean of students.<br />\nPoliceman and confessor, shepherd and seer, warden and<br />\noracle, proconsul and pal, the dean of students is by far the<br />\nmost enigmatic of all academicians. How can we understand<br />\nhim? Well sir, perhaps the best way is to take an average day<br />\nin the life of an average dean. Here, for.example, is what happened last Thursday to Dean Killjoy N. Damper of Duluth<br />\nA and M.<br />\nAt 6 a.m. he woke, dressed, lit a Marlboro, and went up on<br />\nthe roof of his house to remove the statue of the Founder which<br />\nhad been placed there during the night by high-spirited undergraduhtes.<br />\nAt 7 a.m. he lit a Marlboro and walked briskly to the campus.<br />\n(The Dean had not been driving his car since it had been placed<br />\non the r6of of the girls dormitory by high-spirited undergraduates.)<br />\n<br />\n-7_CI<br />\n<br />\n61/e vs peed 6:7ete bY hiGh-57V/Viafk,pygiacieg<br />\nand<br />\nAt 7:45 a.m. he arrived on campus, lit a Marlboro,<br />\nbeen<br />\nclimbed the bell tower to remove his secretary who had<br />\nplaced there during the night by high-spirited undergraduates.<br />\nwith<br />\nAt 8 a.m. he reached his office, lit a Marlboro, and met<br />\nYoung<br />\nr.<br />\n-newspape<br />\nstudent<br />\nDerther Sigafoos, editor of the<br />\nthe<br />\nSigafoos had been writing a series of editorials urging<br />\nevoked<br />\nhad<br />\neditorials<br />\nhis<br />\nWhen<br />\nCanada.<br />\nannex<br />\nUnited States to<br />\nAccomno response, he had taken matters into his own hands. gone<br />\npanied by his sports editor and two copy readers, he had<br />\nover the border and conquered Manitoba. With great patience<br />\npersuaded<br />\nand several excellent Marlboro Cigarettes, the Dean<br />\nhowyoung Sigafoos to give Manitoba back. Young Sigafoos,<br />\nWinnipeg.<br />\nkeeping<br />\non<br />\never, insisted<br />\nJ.<br />\nAt 9 a.m. the Dean lit a Marlboro and met with Erwin to<br />\ncame<br />\nwho<br />\nchapter,<br />\nChi<br />\nSigma<br />\nlocal<br />\nthe<br />\nBender, president of<br />\nSigma<br />\nreport that the Deke house had been put on top of the<br />\nates.<br />\nundergradu<br />\ned<br />\nhigh-spirit<br />\nby<br />\nnight<br />\nthe<br />\ndurin<br />\nhouse<br />\nChi<br />\nan<br />\numpire<br />\nto<br />\nwent<br />\nAt 10 a.m. the Dean lit a Marlboro and<br />\nthe<br />\nwhere<br />\nschool<br />\nlaw<br />\nthe<br />\nof<br />\nroof<br />\nthe<br />\non<br />\ngame<br />\nsoftball<br />\nl<br />\nintramura<br />\nnight by<br />\ncampus baseball diamond had been placed during the<br />\nhigh-spirited undergraduates.<br />\npresiAt 12 noon the Dean had a luncheon meeting with the chairdent of the university, the bursar, the registrar, and the<br />\ncampus<br />\nman of the English department at the bottom of the placed<br />\nswimming pool where the faculty dining room had been<br />\nMarlboros<br />\nduring the night by high-spirited undergraduates:<br />\ndampness.<br />\nthe<br />\nto<br />\nowing<br />\nlit<br />\nnot<br />\nbut<br />\nwere passed after lunch,<br />\nand<br />\nAt 2 p.m., back in his office, the Dean lit a Marlboro<br />\nunless<br />\nthat<br />\nsaid<br />\nwho<br />\nwar<br />\nof<br />\nreceived the Canadian minister<br />\nmarch.<br />\nyoung Sigafoos gave back Winnipeg, Canada would<br />\nWinniback<br />\ngive<br />\nto<br />\nagreed<br />\nand<br />\nYoung Sigafoos was summoned<br />\nwar<br />\npeg if he could have Saskatoon. The Canadian minister of<br />\nplaced<br />\nSigafoos<br />\nyoung<br />\nafter<br />\nagreed<br />\nfinally<br />\nbut<br />\nrefused,<br />\nfirst<br />\nat<br />\nhim on the roof of the mining and metallurgy building.<br />\nAt 3 p.m. the Dean lit a Marlboro and met with a delegation<br />\nfrom the student council who came to present him with a.set<br />\nof matched luggage in honor of his fifty years' service as dean<br />\nof students. The Dean promptly packed the luggage with his<br />\nclothing and Marlboros and fled to Utica, New York, where he<br />\nMax Shulman<br />\n©<br />\nis now in the aluminum siding game.<br />\n<br />\n4•••<br />\n<br />\nChoose just<br />\nthe Jet-smooth<br />\nChevy you<br />\nwant in<br />\none stop<br />\nat your<br />\nChevrolet<br />\ndealer's .<br />\nHere's the choice that makes choosing<br />\nthe new car that's right for you easier<br />\nthan ever. Thirty-one models in all—<br />\ndesigned to suit almost any taste, priced<br />\nto suit almost any budget. There's a<br />\nwhole crew of Chevy Corvairs,including<br />\nthrifty sedans and coupes and four<br />\nwonderful new wagons. Budget,wise Biscaynes—lowest priced full-sized<br />\nChevrolets. Beautiful Bel Airs, sumptuous Impalas and America's only true<br />\nsports car—the Corvette.<br />\nDrop by your Chevrolet<br />\ndealer's and do your new<br />\ncar shopping the easy way<br />\n—in one convenient stop.<br />\n<br />\nNew Chevrolet I MeALA SPORT COUPE<br />\nAll five Impala models combine Body<br />\nby Fisher beauty with a new measure of<br />\npracticality. Door openings of this Sport<br />\nCoupe, for instance, are over a halffoot wider this year.<br />\n<br />\nNew Chevrolet IMPALA CONVERTIBLE<br />\n<br />\n• Here's one wide open for fun and a<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\n<br />\nlot of the fun is in Chevy's Jet-smooth<br />\nride. Add Turboglide transmission<br />\n(extra-cost option) to this or any Chevy<br />\nV8 for tops in easy going.<br />\n<br />\ntfr<br />\ndtk.<br />\nIt<br />\n<br />\n•▪ New Chevy Corvair 500<br />\nLAKEWOOD STATION WAGON<br />\nLoads of space inside—and still more<br />\nin the trunk up front. And with all<br />\ntheir wagon-size versatility, these rearengine Lakewoods handle like a charm.<br />\n<br />\n411\"<br />\n<br />\nWIDE CHOICE OF<br />\nOK USED CARS, TOO!<br />\nMore people are buying new<br />\nChevrolets than any other<br />\nmake. So your dealer's got a<br />\nwide choice of OK Used Cars.<br />\n<br />\nNew Chevrolet BEL AIR 4-DOOR SEDAN<br />\n‘ Slimmer and trimmer on the outside; yet<br />\nPriced just above the thriftiest full-sized<br />\nChevrolets, all four Bel Air models bring Inside there's a full measure of Chevrolet's<br />\nyou beauty that likes to make itself useful. roomy comfort.<br />\nChevrolet dealer's!,<br />\nSee the new Chevrolet cars, Chevy Corvairs and the new Corvette<br />\n_ local authorized<br />\n_ at your<br />\n<br />\nTo the dean of students and all you other hard-working<br />\nacademic types, here's the new word in smoking pleasure<br />\nfrom the makers of Marlboro—king-size unfiltered Philip<br />\nMorris Commander. Welcome aboard!<br />\ntiV•<br />\n<br />\nAL_<br />\n<br />\n\f", "format": "basic_html", "processed": "Uhr<br />\nVOL. LXV, No. 23<br /><br />\nKrttrr<br /><br />\nJOHNS HOPKINS UNIVERSITY, APRIL 28, 1961<br /><br />\nPAGE FIVE<br /><br />\nThe University<br /><br />\nWhere Are We Going?<br />\nA good university must constantly ask itself<br />\n\"Where are we going?\" if it is to have any consistency in its objectives and direction. Every step<br />\nalong the way, the 4uestion must be posed, and every<br />\nstep along the way its leaders must be able to formullate an answer. The answer looks to the past, for that<br />\ncontains experiences which are invaluable to good<br />\njudgment; and it looks at the present, for that contains a fleeting and candid picture of the situation<br />\nas it exists. The News-Letter has turned to people<br />\nwho have the experience to answer the question, and<br />\nwe seriously hope that the answers will guide the<br />\nUniversity in its growth.<br />\nThe Editors<br /><br />\nIllrrita Vag :flihrrabit<br />\nyears of 'The Hop-<br /><br />\n'Today's Plans Are Modified<br />\nBy Tomorrow's Events' Prexy<br />\nBy MILTON S, EISENHOWER education to the United States,<br />\nfounded a medical school which<br />\nPresident of the University<br />\nwas the first to place the obliAny detailed projection of gation for scientific research on<br />\nthe development of the Uni- a level with the obligation to<br />\nversity over the next 10 or teach; its School of Engineering,<br />\nas early as 1913, presented a cur20 years must be imperfect, riculum which now is described<br />\nfor today's'plan may, often as \"engineering science\"; its<br />\nbe modified by tomorrow's School of Hygiene and Public<br />\nevents. It is possible, however, Health set the pattern for later<br />\nschools here and abroad in the<br />\nto make some sound generali- same<br />\nfield. The School of Medizations, for they can be firmly cine once again broke new<br />\nbased on the Hopkins tradi- ground when it embarked on a<br />\ntion and on the concept of new medical education program<br />\nthe mission of the University marked by flexibility and in—a concept which is shared tensification of training with a<br />\nto a remarkable degree of un- shortening of the time neces-<br /><br />\nSide by side, the evolution in four<br />\nkins Man' uniquely parallels the evolution, in 85 years, of<br />\nThe Johns Hopkins University. From the germination of an<br />\ni.dea—a.\"Baltimore experiment\"—when learned men were<br />\n(Continued on Page 7)<br />\ngiven the task of creating a true university, through the animity by the five faculties,<br />\nDR. MILTON S. EISENHOWER<br />\ntrials and tribulations, the growth, transition, and ex- the administration, and the<br />\npansion, the Hopkins has come to be the great center of Trustees.<br />\nan imposing sphere of influence. Similarly did we trans- To speak of \"adherence to tracend from inquisitive freshmen, with the idea of the bene- dition\" is far too often to sughold a static sitfit of knowledge in our minds, through our own trials and gest the desire toactively<br />\nto resist<br />\nuation, or even<br />\nfrontier,<br />\nnew<br />\na<br />\nof<br />\ncitizens<br />\neducated<br />\ntribulations, to become<br />\nchange. At Hopkins this is not<br />\nand to create our own spheres of influence—as 'Hopkins so. Because the University was<br />\nBy DEAN G. IL EVANS<br />\nMen.'<br />\nconceived as an experiment in<br />\nhigher education, and because all<br />\nThought about the development of the Faculty of PMMany concepts of Univerassociated with Johns Hopkins losophy during the next ten years involves examination of<br />\nsity life floated before us,<br />\ntake pride in the fact that its the objectives of that faculty and appraisal of the resources<br />\nPrevious to our first arrival<br />\nhistory shows a record of great<br />\navailable for their attainment.<br />\nat the Homewood. But with<br />\ninfluence in research and educaThe broad objective of the the development of inquiry<br />\na cautious amazement, as<br />\ntion, there is no disposition here<br />\nFaculty of Philosophy needs no among faculty and students. To<br />\nour first days rolled by, did<br />\nto bask in the glory of past<br />\naccomplishments. Members of revision if it is considered to be maintain a high level of inquiry<br />\nwe begin—but only begin—<br />\nthe faculty and others who prethroughout an educational into realize just what effect<br />\nproposals for ,consideration<br />\nsent<br />\nstitution, or throughout a segthis place would have on us.<br />\nare fond of quoting the admoniment of an institution such as<br />\nAfter a few weeks, we were<br />\ntion contained in the inaugural<br />\nthe<br />\narea covered by an arts and<br />\nbe<br />\nto<br />\n'freshmen,'<br />\nlonger<br />\npresino<br />\naddress of the founding<br />\nsciences faculty, is extremely<br />\ndent, Daniel Colt Gilman: \"UniS hunned, set apart, or<br />\ndifficult when the unit becomes<br />\nversities easily fall into ruts.<br />\nmocked; we were just plain<br />\ntoo<br />\nsmall or too large. These<br />\na<br />\nrequires<br />\nAlmost every epoch<br />\nStudents, associating with,<br />\nsize terms are, of course, relative<br />\nstart.\"<br />\nfresh<br />\nand difficult of proper. determihelping, and learning from<br />\nThus experimentation is in itnation. I anticipate some expanall the other students in all<br />\nyears, four years: self a part of the Hopkins trasion in the faculty and the stuthe other classes. It was a side<br />\n. Eighty-five<br />\nthe<br />\namong<br />\nis<br />\nthere<br />\nand<br />\ndition,<br />\nby side.<br />\ndent body in the arts and sciPeriod of eight o'clock<br />\nfaculties an unusual willingness<br />\nences, but I do not believe that<br />\nprofessors,<br />\nto undertake pioneering efforts.<br />\nclasses, fraternity rushing understanding<br />\nour major objective can be fulsince<br />\npioneering<br />\nWe<br />\nschedules.<br />\nof<br />\nrecord<br />\nstudy<br />\nThe<br />\nand<br />\nfights,<br />\nscribbled notes, water<br />\nfilled without holding down our<br />\nfirst days of the university.<br />\nWere little universities, each one of us, suddenly handed a thosefamous<br />\nsize.<br />\nthey<br />\nfor the changes<br />\nThe undergraduate student<br />\nmultimillion dollar endowment and told to us it to best now<br />\nwrought in higher education, is<br />\nbody in the arts and sciences<br />\ndevelop ourselves.<br />\nUniverThe<br />\none:<br />\nimpressive<br />\nan<br />\nAs time matures a university, and allows it to better sity, having brought graduate DR. G. HEBERTON EVANS<br />\n(Continued on Page 9)<br />\nand<br />\naffix its goals, so did time bring us to new horizons,<br />\npush away the darkness around higher education. Whatever our notions of the true meaning of higher education<br />\noriginally were, for most of us time brought a change of<br />\nattitude. While, perhaps, our goals were not yet in sight,<br />\nWe began to feel more secure about being on the right<br />\nroad; we were firmly in the guiding hands of The UniverBy DEAN W. K. MORRILL<br />\nter the play, a dance was held in houses. Assemblies, class-meetsity.<br />\nand<br />\ntogether,<br />\na small hall above the foyer of ings, and athletic contests were<br />\nfit<br />\nto<br />\nbegan<br />\nall<br />\narBefore the last war there the<br />\n\"I have found you an<br />\nLyric or in the fraternity well<br />\nfit together beautifully. The<br />\nattended. Nor was there any<br />\na<br />\nwas<br />\npride<br />\nfeeling<br />\ndistinct<br />\nof<br />\ngument; I am not obliged to<br />\n(Continued on Page 6)<br />\nlack of applicants for staff posi.<br />\non the part of the student body<br />\nfind you an understanding,\"<br />\ntions on the News-Letter or the<br />\nin extra-curricula activities.<br />\nsaid Samuel Johnson. The<br />\nHullabaloo.<br />\nThe Musical Club concerts<br />\nargument had been before<br />\nThen came the war and folwere held at the Maryland<br />\nus, unanswered, while we<br />\nlowing it a decided change in the<br />\nCasualty Auditorium before a<br />\nattitude of the student body tosought the right road to our<br />\nparward extra-curricular activities.<br />\nstudents,<br />\npacked<br />\nhouse<br />\nof,<br />\nto<br />\nbegan<br />\nit<br />\nsoon<br />\nBut<br />\ngoals.<br />\nThere were at least two reasons<br />\nents, and other guests. After<br />\ndawn upon us that we were<br />\nfor this. First the academic prothe concert, .a dance was algram was becoming much more<br />\nfinding an understanding.<br />\nways held in the Casualty balldifficult with the trend toward<br />\nroom.<br />\nRealizations formed in our<br />\ntheory and undergraduate reSome weeks later the Barnsearch and, secondly, the compeminds that we were gaining<br />\nstormers, as was their custom,<br />\ntition for grades was increasing<br />\ninsights, we were becoming<br />\nat<br />\npresented their annual play<br />\nas more students applied<br />\nsince,<br />\nthe Lyric. Once again the plays<br />\nenlightened. It was, so to<br />\nfor admission, the caliber of<br />\nand a large<br />\nwere<br />\nwell-received<br />\nthose admitted improved. Even<br />\nspeak, the beginning of the<br />\ncrowd attended. The fraternities<br />\nthough these changes are necesWords,<br />\ntheir<br />\nbeginning.<br />\nend of the<br />\noccupied the boxes with<br />\n(Continued on Page 9).<br />\nDR. W. KELSO MORRILL<br />\nbanners proudly displayed. Afideas, formulas, reasons — With a cautious amazement.<br /><br />\nFaculty's Objectives<br />\nHinge On Class Size<br /><br />\n'OldDays'AtHomewood Campus<br />\nReveal Key To Hopkins Spirit<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br /><br />\nNEWS -LETTER<br /><br />\nPAGE SIX<br /><br />\nAw reness Of Med School Role Stresse<br />\nuality,Not uantily<br />\nKeynotes Expansion<br />\nBy THOMAS B. TURNER, M.D. tioner; that the long arm of our<br />\nDean of the Medical Faculty<br />\ninfluence<br />\nwill<br />\nextend<br />\neven<br />\nProphecy is usually less a further beyond the boundaries Of<br />\n(rift<br />\nt, than a form of self-indul- our own country; that we shall<br />\ngence, prompted in this in- be more concerned than formerly<br />\nstance, however, by the Editors with the education of specialists<br />\nof the News-Letter. The Uni- that help the physician in the<br />\nof the science and art<br />\nversity, and particularly. that practice<br />\nof medicine.<br />\nsegment of which I speak, the In the Medical School, teachSchool of Medicine, is people ing and research have always<br />\n—people seeking to under- gone hand in hand. We shall<br />\nbring under more intensive study<br />\nstand other people in health those major afflictions which<br />\nand in disease, their strengths plague mankind everywhere —<br />\nand weaknesses, their hopes cardiovascular diseases, the aland fears; and people have a lergies, congenital and heredi'high degree of unpredicta- tary defects, cancer, and psychic<br />\nabnormalities. Investigation of<br />\nbility.<br />\nthese fields will carry us from<br />\nGreater Awareness<br />\nBut it is likely that we shall molecular biology to clinical<br />\ngo toward a greater awareness medicine and surgery.<br />\nQuality, Not Quantity<br />\nof the vital role of the Medical<br />\nFor these tasks we shall conSchool in contributing to the<br />\nhealth of people everywhere; tinue to seek men and women<br />\nthat we shall be more conscious with brains, character, imaginaof our obligations to help set tion, and industry; and help<br />\nhigher standards at all levels of them maintain an environment<br />\nmedical education, pre-medical, for a scholarly and creative life.<br />\nmedical, post-doctoral, and con- The emphasis will continue to<br />\ntinuing education for the prac- be on quality, not quantity.<br /><br />\nVeritas Vos Liberabit<br /><br />\nABOVE—One of the great steps in the development of the Johns Hopkins Medical Center is<br />\nthe construction of the Children's Medical Center.<br /><br />\n(Continued from Page 5)<br /><br />\npicture they formed pointed straight towards our goals,<br />\nand it was all downhill.<br />\nWe came with the answers; now we shall leave<br />\nwith the questions. How ironic it is to find that higher<br />\neducation has not given us what we thought we really<br />\ncame for: all the answers. In reality it has shown us that<br />\nthere are a multitude of unanswered questions facing this<br />\nearth; it has made us aware of these questions, and has<br />\ndeveloped the tools we brought witli us so that we might<br />\ncorrectly answer them. We had the answers all along; it<br />\nwas what they were the answers to that really brought us<br />\nto Hopkins. This was our real challenge, and it shall continue to be so.<br />\nIt is for the future to tell us how we have met this<br />\nchallenge. Some of us will meet it sqaurely, as in research,<br />\nwhile others will serve to broaden it through development;<br />\nsome will choose to carry the challenge to still more people<br />\nby returning to education; still others will not answer the<br />\nchallenge, but only create more questions and hence more<br />\nchallenges. We are all 'Hopkins Men' now, each with a<br />\nsphere of influence, just like our University. Or perhaps<br />\nwe would rather feel that we have enlarged the sphere<br />\nthat surrounds Johns Hopkins.<br />\nIt is 85 years, and ,it is 4 years, all at once; a university and a student. For both it has been a rich and exciting<br />\nexperience; for both it is now \"Where are 'we going?\"<br />\nG.S.<br /><br />\nBELOW—An aerial view of the present Johns Hopkins Medical Center to which the Children's<br />\nHospital will be added.<br /><br />\n---RESEARCHERS PUSH NEW FRONTIER---<br /><br />\nit II •<br /><br />\nir,*0•••••••<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br /><br />\nPAGE SEVEN<br /><br />\nNEWS -LETTER<br /><br />\nIdeas, Plans Of BIA pporiunities, Challenges Exist;<br />\nHit Faulty Support It's Good To Be At MU<br />\naround Hopkins, such as _Druid<br />\nBy ALAN NOGEN<br />\n• Hill Park, are utilized. Pres. of BIA •<br />\nFraternity Athletics<br />\nWithout wishing to sound<br />\nAt present the intramurals at<br />\noverly pessimistic, I must say<br />\nthat I feel the intramural pro- Hopkins are really conducted on<br />\ngram here will become worse be- one level: the fraternity competition. It is unfortunate to state<br />\nfore it becomes better.<br />\nthe BIA could be no more<br />\nthat<br />\nthe<br />\nIt is literally impossible for<br />\nBoard of Intramural Athletics appropriately called the Board of<br />\nto run a diversified program Fraternity Athletics. The only<br />\nWith the lack of _facilities and genuine spirit that has been<br />\nPlaying space available. As any- generated on campus is in the<br />\none playing intramural basket- fraternities.<br />\nIndependent competition is alball this winter could attest, the<br />\nnon-existent with the<br />\nmost<br />\ncompletely<br />\nwas<br />\ngVmanasium<br />\nscheduled up and there was no formation of dormitory leagues.<br />\ntime for any free play. The fault The DSRC attempted to run a<br />\nof the situation is difficult to separate intramural program for<br />\nblame on any one person. Per- Dorm students and found partihaps those most at fault are the cipation difficult to obtain in<br />\nstudents whose lack of participa- most events.<br />\nDichotomy<br />\ntion has allowed the athletic<br />\nThe present situation of a difacilities to be generally ade(Continued on Page 12)<br />\nquate.<br />\nEquipment Exchanged<br />\nIt is unfortunate that any<br />\ngood equipment that has found<br />\nits way into the intramural program, such as used in lacrosse,<br />\nhas been exchanged by student<br />\nParticipants for their personal<br />\nPoorer gear. Generally the equipment used in intramurals is<br />\nvarsity hand-me-downs and not<br />\nadequate.<br />\nAs participation in all facets<br />\nOf intramural activity increases<br />\ndue to an increase in the number<br />\nOf students, there will be a<br />\ngreater scarcity of usable gear.<br />\nI am hopeful that in the not too<br />\ndistant future the athletic department will begin buying<br />\nequipment designed solely for<br />\nthe intramural program. The<br />\nThe only existing locker faciliProblem of field 'space menioned ties on the Homewood campus<br />\npartially which serve all athletic activities<br />\nbe<br />\nPreviously can<br />\nfields and events.<br />\nathletic<br />\nif<br />\nalleviated<br /><br />\nBy, MARSHALL TURNER<br /><br />\nopportunity and challenge. We al- to assure satisfactory human<br />\nrelationship and human happiness. In spite of the progress of<br />\nculture through the ages, and<br />\nthe phenomenal discoveries of<br />\nscience, the human being has not<br />\nchanged, only his<br />\nbasically<br />\nmeans of expressing his humaness.<br />\nI hope, therefore, as we rise<br />\nBut with all the prospect of to the challenge and the opporsuch an exciting future in edu- tunity of the future, that we do<br />\ncation, I have one concern. The not forget it is the person who<br />\nexplosion of new knowledge and is doing the rising. It is still the<br />\nstudent population makes me human being who makes it. posfear that we can easily lose sight sible to have challenges and to<br />\nof the individual as a human meet them. Let us therefore<br />\nbeing—as a human being having consciously call attention to the<br />\na mind, a body, and a soul, in- fact that student to student, stuseparable and intertwined, so dent to faculty, and faculty to<br />\nthat every activity in which hu- faculty relationships should unmans engage has these three dergird all the pioneering and<br />\naspects to it. The tremendous experimenting we are free to do<br />\ndemand for individual skills, the here at Hopkins. Don't let us<br />\nmass of students to be given take these relationships for<br />\nthese skills, the constantly en- granted, because if we do, sucmass of _ knowledge cessfully meeting the challenges<br />\nlarging<br />\n.needed to be transmitted to each of the future will be a hollow<br />\nsucceeding group of students, and mocking triumph.<br />\nthese all place a terrific burden<br />\n•t<br />\nand pressure on the single indito<br />\nestabtrying<br />\nstudent<br />\nvidual<br />\nlish his identity, to learn his<br />\nstrengths and ,weaknesses, and to<br />\ndiscover his purpose in life. And<br />\nhe must do all these things<br />\namong all his fellow-students<br />\nwho are trying to do the same<br />\nthing, and whom he needs as<br />\nmuch as they need him.<br /><br />\nready have the tradition of pioneering; we already are oriented<br />\ntoward experimentation as a<br />\nmajor activity on our campus.<br />\nWe have no sacred cows to worship and idolize other than the<br />\nfreedom to pioneer and experiment.<br /><br />\nMARSHALL TURNER<br /><br />\nWhat a time to be active hr<br />\nthe world of education! Perhaps never before has education been in such ferment.<br />\nProblems of organization, Content, administration, purpose<br />\nand philosophy of educational<br />\nactivities have never undergone such a critical and penetrating evaluation as now. But<br />\nwhat an opportunity and challenge to be able to help in solving and evaluating these problems! It is really like the excitement before the. big game<br />\n—being keyed up and committed to an all-out effort. It's<br />\none of life's greatest experiences and rewards.<br />\nIt is good to be at Hopkins at<br /><br />\nWith so many other goals that<br />\npeople seem to feel are more<br />\nimportant, or worthy, or desirable, human happiness and human relationships tend to be<br />\ndowngraded, or at the least to<br />\nsuch a time. We are in a won- be taken for granted. But mere<br />\nderful position to rise to this physical maturing does not seem \"A Mind, a body, and a soul.\"<br /><br />\nPrexy Views Development Of JHU<br />\n(Continued from Page 5)<br />\nsary for a capable student to<br />\nreach the M.D. The faculty of<br />\nthe School of Engineering is currently engaged in a critical review of its entire program in<br />\nrecognition of the need for men<br />\ntrained to higher levels of creative work in engineering science.<br />\nA list of this sort could be extended for many pages, but this<br />\nsurely is unnecessary.<br />\nIt is evident to all who know<br />\nHopkins that the University<br />\nknows where it is going. It has<br />\ncommitted itself to the highest<br />\nattainable standards of quality<br />\nin undergraduate instruction,<br />\ngraduate study and training, and<br />\nfaculty scholarship. In this way,<br />\nit hopes to continue the atmosphere in which scholars,<br />\nscientists and teachers will develop, and will carry with them<br />\ninto other institutions and fields<br />\nOf endeavor the influence of the<br />\nHopkins tradition. That this<br />\nUnique mission is being successfully pursued is shown by the<br />\nfact that more than 4,500 Hopkins graduates hold high research and teaching posts in<br />\nother universities; by the remarkable percentage of Hopkins<br />\ngraduates elected to the National Academy of Sciences; by the<br />\nnumbers of Ph.D. graduates conducting industrial research.<br />\nnow<br />\nhas<br />\nUniversity<br />\nThe<br />\nreached a state of maturity, with<br />\na firm philosophy permeating its<br />\nstructure, which permits it to<br />\nachieve its aims without tendencies to flirt with innovation<br />\nfor the sake of novelty. Its decisions are reached without<br />\nhaste, and the procedures for<br />\nconsidering them prevent the<br />\ndangers of superficial thinking.<br />\nThus, while experimentation is<br />\neagerly undertaken, it is equally<br />\nrecognized that experiment must<br />\nbe followed by consolidation of<br />\nthe values demonstrated by exPeriment: this in turn is followed by re-evaluation and a<br />\nWillingness to change when new<br />\ndirections or new objectives are<br />\nindicated.<br /><br />\nWith the much-publicized and<br />\nvery real explosion of knowledge,<br />\nthe demand for intensification<br />\nof research, as well as demands<br />\nfor broader inter-disciplinary<br />\napproaches to both established<br />\nand newly realized problems, is<br />\nincreasing greatly. This imposes<br /><br />\nheavy burdens on a university,<br />\nand on other intellectual institutions. Some of these problems<br />\ncan be met more effectively, and<br />\nwith less duplication of effort,<br />\nby the development of closer relationships among these institutions or by actual affiliation.<br /><br />\nThus:<br />\n... The Johns Hopkins School<br />\nof Advanced International Studies and the Brookings Institution are preparing to share intellectual resources, without loss<br />\nof identity of either institution,<br />\nto the benefit of both; and by<br /><br />\nigut Tomprrssrb---<br /><br />\nlocating them in proximity to<br />\neach other in their new buildings it is hoped to establish the<br />\ncore of a growing cultural center<br />\nwhich will have even greater effectiveness and influence in the<br />\nfield of public sudies.<br />\n. . . Similarly, the Carnegie<br />\nInstitution of Washington is<br />\nmoving its Embryological Laboratory, now inadequately housed<br />\nin the Johns Hopkins School of<br />\nMedicine, to the Homewood<br />\nCampus, where its work will continue in close conjunction with<br />\nthe research of the Department<br />\nof Biology and the McCollumPratt Institute, as well as the<br />\nSchool of Medicine.<br />\n. . . The Children's Rehabilitation Institute, working in research and patient care for those<br />\nafflicted with cerebral palsy, is<br />\naffiliating with the School of<br />\nMedicine and Hospital, in an<br />\narrangement which assures high<br />\nstandards of quality.<br />\n. . . The Department of Art,<br />\nin collaboration with Goucher<br />\nCollege, the Walters Art Gallery,<br />\nand the Baltimore Museum of<br />\nArt, has entered into an integrated program in which each<br />\ninstitution makes its own intellectual contribution, to the benefit of all.<br />\nThese developments enhance<br />\nthe programs of each of the related institutions without imposing a drain on 'financial resources, and so they are fostered<br />\nwith enthusiasm.<br />\nOn the medical campus, a<br />\nconcerted effort has been made<br />\nto bring into effect joint departments for the School of<br />\nMedicine and the School of<br />\nHygiene and Public Health, to<br />\neliminate unnecessary duplication of effort, make financial<br />\nsavings, and broaden the concepts of departments. With the<br />\ngrowth of importance of preventive medicine, on the one hand,<br />\nand the essentiality of deeper,<br />\nbetter training in the basic medical sciences on the other, this<br />\n(Continued on Page 8)<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br /><br />\n-Homewood's Future-<br /><br />\nrojected Growth<br />\nViewed By Prexy<br /><br />\nPAGE EIGHT<br /><br />\n(Continued from Page 7)<br />\norganizational change has already made a notable initial<br />\nrecord of success.<br />\nIn all its activities, Hopkins<br />\ndoes not carry lightly its obligation to play a role of leadership.<br />\nThe University has been fortunate in having firmly maintained a tradition of freedom<br />\nwhich eminent scholars have<br />\nfound congenial for their academic endeavors and which has<br />\nstimulated their productivity.<br />\nThey must also be compensated<br />\nadequately. Now the competition<br />\nis becoming keener; the large<br />\nstate universities are finding<br />\nfavor in the eyes of taxpayers<br />\nand legislatures and are receiving more generous appropriations. Many of them are alsci<br />\nbuilding graduate programs of<br />\nhigh distinction. The role of the<br /><br />\nprivate<br />\nThis aerial photograph of the Homewood campus and surrounding area shows the '73 acre<br />\ntract in Wyman Park on which the University intends to expand its facilities. In the right foreground is N. Charles Street and in the center of the picture is Keyser Quadrangle. In the left foreground is the Baltimore Museum of Art. The tract is located west of the campus and is bordered<br />\non the east by San Martin Drive. It is south of University Parkway and east of Tudor Arms Ave.<br /><br />\nuniversity in setting<br /><br />\never-higher standards of quality,<br />\nmaking innovations and, through<br />\ntheir independence, establishing<br />\nand protecting sound educational practices is still important.<br />\nBut they must be able to maintain faculties made up of great<br />\nscholars and teachers.<br />\nThe post-doctoral level seems<br />\nto be developing, by the way, as<br />\na new dimension in higher education, and I suspect that Hopkins will again find itself taking<br />\nleadership in its development.<br />\nWith nearly 585 post-doctorals<br />\nin residence now, Hopkins no<br />\ndoubt has the highest percentage<br />\nof any university in the country.<br />\nThe University will never, I<br />\nthink, grow greatly in size. No<br />\nphilosophical objection can be<br />\nheld to quantitative growth, if<br />\nit strengthens the quality of the<br />\nprogram—and in some areas<br />\nEiATPREStNT<br />\nsuch growth leading to greater<br />\n116 By Ii\"'<br />\nstrength will be encouraged.<br />\nnew areas of scholarship<br />\nSome<br />\nFTER VIES<br />\nED<br />\nwill also be entered—such as the<br />\nlarge field of radiological science<br />\nwhich is developing in a promising way now. But the commitment to quality places such deThe above diagram illustrates, by varieties of shading, the proposed development of the Home- mands upon the financial rewood campus if Wyman Park is acquired by the University. Top of the diagram points west; north sources of the University that to<br />\nis to the right side.<br />\nexpand in size requires greater<br />\namounts of funds than can be<br />\nreadily obtained.<br />\nTo maintain its quality standards and permit entry into some<br />\nnew fields of research and training is the purpose of the fundraising program, in which we<br />\nseek $76,000,000 over this tenyear period in addition to expectable levels of income. Among<br />\nthe essential projects to be supported in this program some<br />\nhave been realized, and others<br />\nare yet to be attained.<br />\nA $2,500,000 wing on Rowland<br />\nHall to improVe and expand the<br />\nfacilities for Physics is now in<br />\ninitial construction stages. A contract is soon to be let for the<br />\nOne of the ways the University can effect its<br />\nconstruction of the $11,000,000<br />\ngrowth is by expanding into Wyman Park.<br /><br />\nLei<br /><br />\nSr<br /><br />\n1'1<br /><br />\nr<br /><br />\nbuilding of the Children's Medical and Surgical Center. A<br />\n$1,000,000 engineering research<br />\nlaboratory building is soon to be<br />\nerected between Latrobe and<br />\nShriver Halls. A new $835,000<br />\nlaboratory wing for biological<br />\nresearch is going up at Mergenthaler. A $1,000,000 Biophysics building is being completed in East Baltimore. The<br />\nmoney is in hand and construction soon to be started on the<br />\nradiological sciences wing at the<br />\nSchool of Hygiene and Public<br />\nHealth.<br />\nAll of these bricks-and-mortar<br />\nprojects—most difficult of all to<br />\nfinance—are being undertaken<br />\nto foster intellectual developments.<br />\nPerhaps most important of<br />\nthem all is the construction of<br />\na new library on the Homewood<br />\nCampus. This project has been<br />\ngiven . highest priority in the<br />\nfund-raising program of the<br />\nUniversity because of its key importance to the University's<br />\nfuture. After all, the library is<br />\nthe intellectual and spiritual<br />\nheart of the University. It is<br />\nthe laboratory of the humanist<br />\nand the social scientist, and<br />\nwithout good library facilities<br />\nthe natural scientist and the engineer are severely hampered.<br />\nWith the erection of a new library to provide these facilities<br />\nneeded by every member of the<br />\nfaculty and every member of the<br />\nstudent body at Hopkins, we<br />\nshall have made a giant stride<br />\nof progress. Unexcelled bibliographical research facilities will<br />\nbe available to those who need<br />\nthem. With pressure relieved on<br />\nthe overcrowded facilities of<br />\nGilman Hall, we shall be able to<br />\nprovide the proper reading room<br />\nand reserve shelf facilities for<br />\nundergraduates and students of<br />\nMcCoy College. Because of its<br />\ncrucial importance, every effort<br />\nis being bent to achieve success<br />\nthe necessary<br />\nobtaining<br />\nin<br />\n$4,500,000 for the new library;<br />\nin this effort we must not fail.<br />\nIf space and time permitted,<br />\nI should want to go further into<br />\ndetail—to describe the new program in the History and Philosophy of the Arts and Sciences;<br />\nthe new programs to be inaugurated in statistics and in computer services; the improvements<br />\nbeing contemplated in engineering studies, and a dozen other<br />\nefforts representative of the<br />\ndynamism of this place and indicative of the directions in<br />\nwhich it is moving.<br />\nSince that is not possible. I<br />\nsubstitute this generalization: By<br />\nvirtue of its commitment to excellence in everything it undertakes, and because of the pioneering spirit which -pervades its<br />\natmosphere, Hopkins will never<br />\ncease to be a leader among universities.<br /><br />\nEmbryo Lab: Present And Future—<br /><br />\nPAGE NINE<br /><br />\nNEWS -LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br /><br />\nFaculty's Objectives Adams Sees Serious Need For<br />\nt<br />\nmen<br />\nern<br />\nGov<br />\nt<br />\nden<br />\nStu<br />\nzed<br />\ntali<br />\nRevi<br />\nnt<br />\nsta<br />\nCon<br />\nTo Remain<br />\n, (Continued from Page 5)<br />\nshould be increased somewhat if<br />\nqualified students who want to<br />\nconcentrate their work in the<br />\nhumanities and the social sciences can be found. The graduate student body can likewise be<br />\nsomewhat increased in particular departments, and a modest<br />\nnumber of post-doctoral fellows<br />\ncan be taken on by many dePartments. Moreover, faculty<br />\nMembers must be added; in some<br />\nfields the numbers are too small<br />\nto be sufficiently effective, and<br />\nfaculty for certain fields not now<br />\nrepresented on the staff—for example, mathematical statistics—<br />\nMust be added. These additions<br />\nto the faculty and the student<br />\nbody, which can or must be<br />\nMade, should not be allowed,<br />\nhowever, to destroy the great advantages inherent in small size.<br /><br />\nWe need funds right now to<br />\ntake care of the critical library<br />\nsituation. During the early portion of the next ten years, we<br />\nmust add floor space for classrooms, laboratories, and offices.<br />\nThe necessary additions to the<br />\nfaculty will need restricted gifts<br />\nor new endowment funds. A general research fund that will provide the faculty and students<br />\nwith equipment not available<br /><br />\nIn planning for the future, we<br />\nShould not have to face in the<br />\nnext ten years—as the University had to prior to 1916—a site<br />\nProblem. At the present time we<br />\ncan only hope that the City will<br />\nunderstand the nece4ty for assuring the Homewood campus<br />\nthe space essential for adequate<br />\ndevelopment. I think it reasonable, however, to assume farsighted action on the part of the<br />\nCity and an absence of a site<br />\nProblem,<br />\nFunds to support what any<br />\nUniversity is trying to do are<br />\nalways inadequate. Education<br />\nand research activities are expensive—and they are becoming<br />\nMore expensive as trained personnel grows smaller in relation<br />\nto the country's increasing student body and research tasks.<br />\nBut because so many of our<br />\ngraduates go into teaching and<br />\nresearch and because Hopkins<br />\nthereby makes a great contribution to the nation at large, the<br />\nraising of funds for the University should be relatively easy.<br />\nProspective donors who•have had<br />\nno previous connection with<br />\nHopkins can be shown, I firmly<br />\nbelieve, that any sum given to<br />\nHopkins can have a greater national effect than the same sum<br />\ncan produce at any other educational institution in the country.<br /><br />\nBy DAVE ADAMS<br />\nPresident, Student Council<br /><br />\nCouncil are more interested in<br />\nprestige and graduate school<br />\nthan in trying to do a good job<br />\nin their positions. The D.S.R.C.<br />\nand S.C. positions are hardly<br />\ncontested during the elections.<br />\nThe student body as a whole is<br />\nseldom concerned about what<br />\ntheir representatives are doing.<br /><br />\nbut that the affect will be minimized if student government is<br />\nstructurally sound.<br /><br />\nIn the last few years there<br />\nhave been more and more applications for admission received<br />\nand the result has been that<br />\neach successive freshman class<br />\nhas been better prepared and<br />\nTheir Prerogative<br />\nmore able to handle the work<br />\nIf there is only a limited conrequired of them at Johns Hop- cern among the undergraduates<br />\nkins.<br />\nabout student government, all<br />\nOne would imagine that each<br />\nsuccessive class would also be<br />\nmore interested in athletics and<br />\nextra-curricular activities. However, this does not seem to have<br />\nbeen the case because too few of<br />\nthe members of each class have<br />\noutside interests or are able to<br />\nmaintain here the interest in<br />\nsports and activities that they<br />\npossessed in high or prep school.<br /><br />\nIncreased Controls<br />\nStudent goverment may have<br />\nto face increasing administrative controls and infringements<br />\nif it is unable to do its job. If<br />\nthe undergraduates cannot govern themselves, they will pay<br />\nthe consequences. They are<br />\nthreatened with this to some<br />\ndegree now in the dormitories.<br /><br />\n--L'ETAT CEST M011--<br /><br />\nI won't go into the reasons for<br />\nthis. The reasons are discussed<br />\nand argued frequently enough<br />\naround campus, yet still nobody<br />\nseems to know exactly what they<br />\nare. Some say this condition is<br />\nprincipally the result of the admissions policy; others say the<br />\nfault lies with the administration's lack of concern for the<br />\nundergraduates or with the prevailing apathy which, like, a<br />\ncancer, eats away rapidly at the<br />\nhealthy enthusiasm often disDR. G. HEBERTON EVANS<br />\nOrienatation<br />\nduring<br />\nplayed<br />\nthrough grants and contracts is Week.<br />\nsorely needed. Additional scholMain Concert<br />\narship and fellowship money will<br />\nMy main concern here is to<br />\nhelp tremendously in maintain- suggest what the future might<br />\ning an outstanding student hold for student government at<br />\ngroup.<br />\nJohns Hopkins. If the trend outlined above continues—as I exten<br />\nnext<br />\nthe<br />\nThe problems of<br />\npect it will for at least five or<br />\nyears, it seems to me, are: the ten years—then student governdetermination of the \"right\" size ment will be a rather mechanical,<br />\n(and changing \"right\" size) for initiativeless element of extraHopkins and the financial prob- curricular activity.<br />\nlems associated with the attainThere are fewer and fewer<br />\nment of the appropriate growth.<br />\nable men involving themselves<br />\nin student government here.<br />\nMany of the DSRC representaPHOTO CREDITS- tives<br />\nare considered to be rather<br />\nineffective individuals. Many of<br />\nThis special supplement of<br />\nthe members of the Student<br />\nthe News-Letter could not<br />\nthe<br />\nwithout<br />\ndone<br />\nbeen<br />\nhave<br />\nassistance of Dale Ireland and<br />\nStan Klosk who took the pictures used in it.<br /><br />\nright—that's their prerogative.<br />\nBut one problem must be and<br />\ninevitably will be considered during the next few years.<br />\nThe mechanism of student<br />\ngovernment must be improved<br />\ngreatly, especially in the area of<br />\nrepresentation and of the handling of non-academic violations<br />\nof the Gentlemen's Code. If<br />\nstudent government is well organized, if it can function<br />\nsmoothly under its constitutions,<br />\nit can maintain itself in spite of<br />\nany lack of ability of those who<br />\nare involved in it. This is not<br />\nto say that lack of ability will<br />\nnot affect student government,<br /><br />\nThis is the reason student government must continue to exist<br />\nand must insure its strength to<br />\nsome degree through organization.<br />\nAs I have indicated, my opinion about the future is that<br />\nstudent government will continue functioning and will organize itself, of necessity, more<br />\nadequately. I would hope that<br />\nstrong student governing bodies<br />\nwill evolve which will undertake<br />\nworthwhile projects and improvements for the undergraduates' benefit. But I strongly<br />\ndoubt it. There aren't enough<br />\ninterested students.<br /><br />\nNew Library Gets Top Priority<br /><br />\n'Good Old' JHU Days<br />\nReveal Key To Spirit<br />\n(Continued from Page 5)<br />\nsary and good, a student that<br />\ndoes -not participate in some<br />\nphase of college life misses a<br />\ngreat deal. Regardless how minor<br />\na part it is, possibly just a loyal<br />\nmember of his class shown<br />\nthrough his interest and support<br />\nat class meetings, it helps to<br />\nteach one leadership, to develop<br />\none's personality, to widen his<br />\ncircle of friends, and to create<br />\na feeling of belonging. We hear<br />\nso much about the lack of \"Hopkins Spirit\".<br /><br />\nDR. W. KELSO MORRILL<br /><br />\nWhat is this so-called Spirit?<br />\nTo me it means a \"love for\" and<br />\na sense of \"deep loyalty\" to the<br />\nUniversity. I think participation<br />\nin activities as well as doing the<br />\nbest one can in the class room<br />\nthe<br />\nis important in producting<br />\nreal kind of \"Hopkins Spirit\".<br /><br />\nLack Of Law Division<br />\nHurts Hopkins Stature<br />\n(Continued from Page 10)<br />\nhas brought superior educational facilities to the area south of<br />\nthe Mason-Dixon Line. Let this<br />\nUniversity become complete. The<br />\nname Hopkins rates mentioning<br /><br />\nColumbia,<br />\nwith Harvard, Yale,<br />\nuniversities<br />\nand the other finest<br />\nHopkins<br />\nof America. Let a Johns<br />\nfamthe<br />\nout<br />\nround<br />\nSchool<br />\nLaw<br />\nacasuperior<br />\nof<br />\nous tradition<br />\nn.<br />\ndemics at this institutio<br /><br />\n•<br /><br />\nNEWS -LETTER<br /><br />\nPAGE TEN<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 28, 1961<br /><br />\nRole 0 Fraternity System Presented<br />\n•<br /><br />\nBy FRANK DOUGHERTY<br />\nPresident IFC<br /><br />\nA fraternity system at any<br />\nUniversity plays a definite role<br />\nin building character and. integrity in the college man.. The<br />\ndeterminations of our fraternity system are not only to<br />\nbroaden the social life of the<br />\nindividual, but to'supplement<br />\nand assist academics and athletics .as well.<br /><br />\nThe place may change but the activities will always remain the same. While fraternities seek<br />\nnew housing in the Guilford section, the annual rites of bidding for new pledges and partying continue in their traditional fashion.<br /><br />\nLack Of Law School Causes<br />\nDrop In Stature Of University<br />\nBy CHARLES P. LICKSON<br />\nPres. Blue Key Club<br />\nWe who have the good fortune<br />\nto be attending this noble University are aware of the fact<br />\nthat it is among the finest in<br />\nthe world. The graduate departments are probably the most<br />\nfamous. I refer, especially, to<br />\nthe Medical School, the other<br />\nscientific departments, and those<br />\nliberal arts departments whose<br />\nprofessors command the respect<br />\nnecessary to appeal to the top<br />\ngraduates of the world's undergraduate schools.<br />\nThe catalogue of this University boa.sts of many schools, located in this country and abroad.<br />\nBut, to the keen academic eye,<br />\nthere Is one large gap. Johns<br />\nHopkins has no Law School. That<br />\nis not to say law is not studied,<br />\nhere. The ironic thing is that<br />\nwe are fortunate enough to have<br />\non our staff one of the outstand-<br /><br />\ning experts on American Constitutional Law and Jurisprudence. We also have very competant young professors whose<br />\nfields are International Law and<br />\nComparative<br />\nLaw.<br />\nHopkins'<br />\nLibrary has a very large collection of books in field of law<br />\nincluding the reports from most<br />\nstates, the entire federal system,<br />\nand many key foreign reports.<br />\nHopkins has begun new departments with far less to work<br />\nwith than this. Ls this not a<br />\nsubstantial nucleus from which<br />\na separate law school could possibly radiate? To those who<br />\nwould ask the question as to<br />\nfunds, a reference ought to be<br />\nmade to the huge number of<br />\nlawyers who are alumni of Hopkins. Many of Baltimore's largest<br />\nlaw firms are inhabited by Hopkins men. If they were approached, as well as the various<br />\nlocal bar associations, the ed-<br /><br />\nucational•<br />\nfoundations,<br />\nand<br />\nAlumni and friends of the University, a large sum could be<br />\nraised. Reinforced by the tuition<br />\nto be charged law students, the<br />\nfinances could be arranged.<br />\nThere are many lovely old buildings and houses that would serve<br />\nas ample location for a Law<br /><br />\nOne important problem that<br />\nfaces the fraternity system at<br />\nHopkins is the question of fraternity housing. Many of the<br />\nfraternity houses are neither<br />\nadequate nor comfortable enough<br />\nto accommodate the large number of brothers who desire to live<br />\nin the house. Many fraternity<br />\nmen must resort to renting<br />\napartments in the vicinity of the<br />\ncampus or living in the dormitory. As a result, there is a lack<br />\nof unity and strength within the<br />\nfraternity itself, resulting in a<br />\nloosely knit organization. Accommodation for all the brothers<br />\nin the fraternity house would<br />\ncreate a tighter inner cohesion<br />\nwithin the fraternity, promote<br />\ngreater spirit and perhaps reduce<br />\nmuch of the apathy that has<br />\noverspread our campus in recent<br />\nyears.<br />\nIdeal Situation<br />\nThe ideal situation would be<br />\nfor the administration to build<br />\na fraternity row on campus involving a long-term lease with<br />\neach fraternity. The fraternity<br />\nhouses could be constructed to<br />\nmeet the individual needs of the<br />\nfourteen fraternities here at<br />\nHopkins. The administration has<br />\ndiscussed the possibility of building a,dormitory-type fraternity<br />\ndwelling, with two or three separate dining halls, but this is<br />\ntotally unacceptable as it defeats<br />\nthe principal of uniqueness in a<br />\nfraternity and would result in<br />\none huge dormitory club. Since<br />\nI do not foresee any compromise<br />\nresulting between the fraternities<br />\nand the administration in ,the<br />\nnear future, the next alternative<br /><br />\nis to look toward Canterbury<br />\nRoad.<br />\nAs a result of the diligent efforts of one of our fraternities,<br />\nthere is a possible opportunity<br />\nthat adequate and comfortable<br />\nhouses will be available in the<br />\nvicinity of Canterbury Road.<br />\nThis move would further accommodate the needs of the fraternity men at Hopkins and<br />\nwould create a more spirited and<br />\nbinding fraternity system.<br />\nIntellectual Block<br />\nThe second problem that the<br />\nfraternities face at the Homewood is a serious intellectual<br />\nblock. The trend at Hopkins in<br />\nthe past four years is to attract<br />\nthe student who excels only in<br />\nachievement. This<br />\nscholastic<br />\ntrend is definitely a good attainment on the part of the administration, but while devoting<br />\nmuch attention to high school<br />\nscholastic achievement and seven<br />\nhundred College Board scores, we<br />\nshould not overlook the versatile<br />\nwell-rounded individual. Let us<br />\nnot sacrifice quality of character<br />\nand achievement in all aspects<br />\nof the student for the complete<br />\nintellectual prig. It would be to<br />\nthe advantage of • our fraternity<br />\nsystem, the entire student body<br />\nand the name Johns Hopkins to<br />\naccept the well-rounded individual rather than the pseudo ivyleague reject.<br /><br />\nFRANK DOUGHERTY<br /><br />\n-New Dance Step-<br /><br />\nSchool. Often, these large structures are not expensive and dealing could go through an alumnus who is in the real estate<br />\nbusiness. The City of Baltimore<br />\ncontains many fine lawyers some<br />\nof whom already teach at McCoy<br />\nCollege. Many of these lawyers<br />\nwould gladly serve as visiting<br />\nlecturers. This area needs a new,<br />\ngood Law School. Greater Baltimore and Washington represent one of the busiest areas of<br />\nlegal work in the country.<br />\nThe Johns Hopkins University<br />\n(Continued on Page 9)<br /><br />\nTime Out For Refreshment<br /><br />\nCotillion Board Head<br />\nStates Purpose,Plans<br />\nBy PETER TUTEUR<br />\nAs many of our fellow students<br />\nseem to feel, spirit at Hopkins<br />\nis at a low ebb. The fault lies<br />\nperhaps in the lack of awareness of the fact that you get<br />\nout of aomething only that<br />\nwhich you put into it.<br />\nThe purpose 'of the Cotillion<br />\nBoard is to serve the entire<br />\nundergraduate body through the<br />\ninitiation,<br />\ncoordination<br />\nand<br />\nscheduling of social events for<br />\nthe Hopkins community. We are<br />\nnot just a group with a name.<br />\nWe are first and foremost students who are only too well<br />\naware of the problem of creating an ideal social atmosphere<br />\nfor the Homewood campus.<br />\nAs the students who are directly charged with the responsibility for creating this social<br />\natmosphere, we realize what<br />\nmust be done. But as we stated<br /><br />\npreviously, the success of any<br />\nundertaking depends ultimately<br />\nupon the student body itself. If,<br />\nhowever, a little spoon feeding<br />\nwill help matters, we'll do that,<br />\ntoo.<br />\nBig Weekend<br />\nThere • is a definite need for•<br />\nan all-school Big Weekend. We<br />\nsee this as a practical answer to<br />\na fall social season which seems<br />\nweak when compared to campus activity during the Spring.<br />\nIt would probably be held on the<br />\nweekend of the last home football game and in close conjunction with the game itself. This<br />\nwould necessarily include such<br />\nevents as a pep rally with bonfires And food; also a victory<br />\ndance' and a „jazz concert, which<br />\nwould terminate the weekend. In<br />\norder to stimulate the idea of<br />\ntaking in all of the individual<br />\n(Continued on Page 11)<br /><br />\nt TUTEUR ANALYZES CAMPUS SOCIAL LIFE<br />\nHOMEWOOD, BALTIMORE, APRIL 21 1961<br /><br />\n(Continued from Page 10)<br />\nevents of the weekend, tickets<br />\nwould be sold in the form of<br />\nreduced price strip tickets, in a<br />\nManner similar to the June Week<br />\nticket sales.<br />\nOf course, events such as this<br />\ncannot be successful unless students attend. It has been noted<br />\nthat in the past such affairs as<br />\nPep rallies were never very successful. It has further been<br />\nsuggested that the reason for<br /><br />\nthese failures lies in the sentiment that such activities smack<br />\nof a certain childish or highis<br />\nwhich<br />\nquality<br />\nschoolish<br />\nbeneath the dignity of the socalled sophisticated college student.<br />\nPublicity Aides<br />\nAdequate publicity for all<br />\nsocial affairs has been a chronic<br />\nproblem. Several feasible measures to alleviate this problem<br />\nhave been arrived at. The<br /><br />\n(Author of \"I Was a Teen-age Dwarf\",\"The Many<br />\nLoves of Dobie Gillis\", etc.)<br /><br />\nPAGE ELEVEN<br /><br />\nNEWS -LETTER<br /><br />\nNews-Letter will be asked to give administration. In order to re- must be adequate. The Cotillion<br /><br />\nearlier and greater coverage new a close student-faculty Board is a group of nine stuwith providing soboth before major social events relationship, it has been sug- dents charged<br />\nfor a number more<br />\nand afterward follow up with gested that the annual Class Day cial activities<br />\nas large. Natupictorial displays. These follow- activities be modified into a than 100 times<br />\nthink for everycannot<br />\nwe<br />\nrally<br />\nclasses<br />\nWith<br />\nday.<br />\naculty<br />\nstudent-f<br />\nthe<br />\ninfect<br />\nhopefully<br />\nups will<br />\nsatisfy the needs of all<br />\napathetic member of our com- suspended, both students and one, nor<br />\n. If we are to serve<br />\nmunity with an enthusiasm to faculty members will be able to concerned<br />\nin the proper<br />\nthe<br />\nstudents<br />\nand<br />\nrelaxation<br />\nof<br />\nday<br />\na<br />\nenjoy<br />\nmissing.<br />\nare<br />\nthey<br />\nget in on what<br />\nathletic activities away from the capacity it is only fitting that<br />\nThe previously unused P. A. campus. An incidental result of the student body keep us insystem in the dormitory cafe- such a gathering. would be the formed as to their desires and<br />\nteria will be employed to pub- opportunity to air and discuss feeling concerning the social<br />\nlicize the calendar of events for campus problems and other calendar.<br />\nthe week. Lack of information issues.<br />\nWe exist as a group for the<br />\nwill no longer be an excuse for<br />\nThe demise of the Goucher- sole purpose of serving the<br />\nmissing events. This might be<br />\ning Committee Hopkins community. We sinextended to the dorm snack bar Hopkins Coordinat<br />\nresponsibility of cerely wish to perform our duand Levering P. A. systems as will leave the<br />\navoiding scheduling conflicts and ties to the fulfillment of your<br />\nwell.<br />\ncoordinating social events with interests. This is best .achieved<br />\nThe much heralded independthose of Goucher College.<br />\nby student support of the proence and freedom of the Hopkins<br />\nwhich are designed with<br />\ngrams<br />\nSocial life is an important<br />\nstudent is nothing more than<br />\nstudent benefit as the only aim.<br />\nutter neglect by faculty and facet of a college education. It<br /><br />\nTHE DEAN YOU SAVE MAY BE YOUR OWN<br />\n•<br /><br />\nNow in the waning days of the school year when the hardest<br />\nheart grows mellow and the very air is charged with memories,<br />\nlet us pause for a moment and pay tribute to that overworked<br />\nand underappreciated campus figure, your friend and mine, the<br />\ndean of students.<br />\nPoliceman and confessor, shepherd and seer, warden and<br />\noracle, proconsul and pal, the dean of students is by far the<br />\nmost enigmatic of all academicians. How can we understand<br />\nhim? Well sir, perhaps the best way is to take an average day<br />\nin the life of an average dean. Here, for.example, is what happened last Thursday to Dean Killjoy N. Damper of Duluth<br />\nA and M.<br />\nAt 6 a.m. he woke, dressed, lit a Marlboro, and went up on<br />\nthe roof of his house to remove the statue of the Founder which<br />\nhad been placed there during the night by high-spirited undergraduhtes.<br />\nAt 7 a.m. he lit a Marlboro and walked briskly to the campus.<br />\n(The Dean had not been driving his car since it had been placed<br />\non the r6of of the girls dormitory by high-spirited undergraduates.)<br /><br />\n-7_CI<br /><br />\n61/e vs peed 6:7ete bY hiGh-57V/Viafk,pygiacieg<br />\nand<br />\nAt 7:45 a.m. he arrived on campus, lit a Marlboro,<br />\nbeen<br />\nclimbed the bell tower to remove his secretary who had<br />\nplaced there during the night by high-spirited undergraduates.<br />\nwith<br />\nAt 8 a.m. he reached his office, lit a Marlboro, and met<br />\nYoung<br />\nr.<br />\n-newspape<br />\nstudent<br />\nDerther Sigafoos, editor of the<br />\nthe<br />\nSigafoos had been writing a series of editorials urging<br />\nevoked<br />\nhad<br />\neditorials<br />\nhis<br />\nWhen<br />\nCanada.<br />\nannex<br />\nUnited States to<br />\nAccomno response, he had taken matters into his own hands. gone<br />\npanied by his sports editor and two copy readers, he had<br />\nover the border and conquered Manitoba. With great patience<br />\npersuaded<br />\nand several excellent Marlboro Cigarettes, the Dean<br />\nhowyoung Sigafoos to give Manitoba back. Young Sigafoos,<br />\nWinnipeg.<br />\nkeeping<br />\non<br />\never, insisted<br />\nJ.<br />\nAt 9 a.m. the Dean lit a Marlboro and met with Erwin to<br />\ncame<br />\nwho<br />\nchapter,<br />\nChi<br />\nSigma<br />\nlocal<br />\nthe<br />\nBender, president of<br />\nSigma<br />\nreport that the Deke house had been put on top of the<br />\nates.<br />\nundergradu<br />\ned<br />\nhigh-spirit<br />\nby<br />\nnight<br />\nthe<br />\ndurin<br />\nhouse<br />\nChi<br />\nan<br />\numpire<br />\nto<br />\nwent<br />\nAt 10 a.m. the Dean lit a Marlboro and<br />\nthe<br />\nwhere<br />\nschool<br />\nlaw<br />\nthe<br />\nof<br />\nroof<br />\nthe<br />\non<br />\ngame<br />\nsoftball<br />\nl<br />\nintramura<br />\nnight by<br />\ncampus baseball diamond had been placed during the<br />\nhigh-spirited undergraduates.<br />\npresiAt 12 noon the Dean had a luncheon meeting with the chairdent of the university, the bursar, the registrar, and the<br />\ncampus<br />\nman of the English department at the bottom of the placed<br />\nswimming pool where the faculty dining room had been<br />\nMarlboros<br />\nduring the night by high-spirited undergraduates:<br />\ndampness.<br />\nthe<br />\nto<br />\nowing<br />\nlit<br />\nnot<br />\nbut<br />\nwere passed after lunch,<br />\nand<br />\nAt 2 p.m., back in his office, the Dean lit a Marlboro<br />\nunless<br />\nthat<br />\nsaid<br />\nwho<br />\nwar<br />\nof<br />\nreceived the Canadian minister<br />\nmarch.<br />\nyoung Sigafoos gave back Winnipeg, Canada would<br />\nWinniback<br />\ngive<br />\nto<br />\nagreed<br />\nand<br />\nYoung Sigafoos was summoned<br />\nwar<br />\npeg if he could have Saskatoon. The Canadian minister of<br />\nplaced<br />\nSigafoos<br />\nyoung<br />\nafter<br />\nagreed<br />\nfinally<br />\nbut<br />\nrefused,<br />\nfirst<br />\nat<br />\nhim on the roof of the mining and metallurgy building.<br />\nAt 3 p.m. the Dean lit a Marlboro and met with a delegation<br />\nfrom the student council who came to present him with a.set<br />\nof matched luggage in honor of his fifty years' service as dean<br />\nof students. The Dean promptly packed the luggage with his<br />\nclothing and Marlboros and fled to Utica, New York, where he<br />\nMax Shulman<br />\n©<br />\nis now in the aluminum siding game.<br /><br />\n4•••<br /><br />\nChoose just<br />\nthe Jet-smooth<br />\nChevy you<br />\nwant in<br />\none stop<br />\nat your<br />\nChevrolet<br />\ndealer's .<br />\nHere's the choice that makes choosing<br />\nthe new car that's right for you easier<br />\nthan ever. Thirty-one models in all—<br />\ndesigned to suit almost any taste, priced<br />\nto suit almost any budget. There's a<br />\nwhole crew of Chevy Corvairs,including<br />\nthrifty sedans and coupes and four<br />\nwonderful new wagons. Budget,wise Biscaynes—lowest priced full-sized<br />\nChevrolets. Beautiful Bel Airs, sumptuous Impalas and America's only true<br />\nsports car—the Corvette.<br />\nDrop by your Chevrolet<br />\ndealer's and do your new<br />\ncar shopping the easy way<br />\n—in one convenient stop.<br /><br />\nNew Chevrolet I MeALA SPORT COUPE<br />\nAll five Impala models combine Body<br />\nby Fisher beauty with a new measure of<br />\npracticality. Door openings of this Sport<br />\nCoupe, for instance, are over a halffoot wider this year.<br /><br />\nNew Chevrolet IMPALA CONVERTIBLE<br /><br />\n• Here's one wide open for fun and a<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\n•<br /><br />\nlot of the fun is in Chevy's Jet-smooth<br />\nride. Add Turboglide transmission<br />\n(extra-cost option) to this or any Chevy<br />\nV8 for tops in easy going.<br /><br />\ntfr<br />\ndtk.<br />\nIt<br /><br />\n•▪ New Chevy Corvair 500<br />\nLAKEWOOD STATION WAGON<br />\nLoads of space inside—and still more<br />\nin the trunk up front. And with all<br />\ntheir wagon-size versatility, these rearengine Lakewoods handle like a charm.<br /><br />\n411\"<br /><br />\nWIDE CHOICE OF<br />\nOK USED CARS, TOO!<br />\nMore people are buying new<br />\nChevrolets than any other<br />\nmake. So your dealer's got a<br />\nwide choice of OK Used Cars.<br /><br />\nNew Chevrolet BEL AIR 4-DOOR SEDAN<br />\n‘ Slimmer and trimmer on the outside; yet<br />\nPriced just above the thriftiest full-sized<br />\nChevrolets, all four Bel Air models bring Inside there's a full measure of Chevrolet's<br />\nyou beauty that likes to make itself useful. roomy comfort.<br />\nChevrolet dealer's!,<br />\nSee the new Chevrolet cars, Chevy Corvairs and the new Corvette<br />\n_ local authorized<br />\n_ at your<br /><br />\nTo the dean of students and all you other hard-working<br />\nacademic types, here's the new word in smoking pleasure<br />\nfrom the makers of Marlboro—king-size unfiltered Philip<br />\nMorris Commander. Welcome aboard!<br />\ntiV•<br /><br />\nAL_<br /><br />"}], "field_media_file": [{"target_id": 39973, "display": null, "description": null, "target_type": "file", "target_uuid": "49345511-89cf-4a1c-8c74-a42a40a43c57", "url": "http://digital.library.jhu.edu/system/files/2022-03/13791-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13791, "target_type": "node", "target_uuid": "64178d3b-ac7e-48e4-947e-96a0d9f898bd", "url": "/node/13791"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "cd40be5b-0c07-460d-bd43-0beb195c80f0"}]}