{"mid": [{"value": 38407}], "uuid": [{"value": "75679159-6820-4bf6-8f54-a8fc3d0bdfe7"}], "vid": [{"value": 38407}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:55:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13465-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:55:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:55:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Nut<br />\n•<br />\n<br />\nTHE JOHN* HOPKINS<br />\n<br />\nDRE<br />\nExams Earlier;<br />\nWeek Vacation<br />\n.. box, page<br />\n<br />\n1, col 4<br />\n<br />\nnmis-<br />\n<br />\niional<br />\n<br />\nlying<br />\nunfilled<br />\n<br />\niting.<br />\n<br />\n1 the<br />\n<br />\n7- , by<br />\n<br />\ncol-<br />\n<br />\nstion<br />\n<br />\nad to<br />\niowl- `'\\<br />\nmior<br />\ntheir<br />\nmay<br />\n<br />\n:nigh<br />\n, de-<br />\n<br />\necoand<br />\nPer;s in<br />\ntent<br />\nneed<br />\nI be<br />\n<br />\nin<br />\npay<br />\nTar.<br />\npersalproical,<br />\nconntal<br />\napand<br />\n<br />\nLodges<br />\nSchedule<br />\nBanquet<br />\n<br />\nBuy<br />\nUjIITED tTATES DEFINE<br />\n<br />\nNEWS-LETTE<br />\nHOMEWOOD,<br />\n<br />\nVOL XLVI, No. 2<br />\n<br />\nr the<br />\n<br />\nFOR VICTORY<br />\nBONDS • STAMPS<br />\n<br />\nBALTIMORE, SEPTEMBER 4, 1942<br />\n<br />\nStudent Council Protests<br />\nMeadowbrook Anti-Semitism<br />\nAt the last meeting of the Student<br />\ncouncil, a letter of protest to the<br />\nMeadowbrook Swimming club and<br />\nMr George Morris, its owner, was<br />\naccepted and approved,<br />\n<br />\nPhoto Contest<br />\nFor Hullabaloo<br />\nTo Begin Monday<br />\n<br />\nPrice Five Cents<br />\n<br />\nDraft owering Certain;<br />\nPaint r Sees College<br />\nEnrolltnent Regulated<br />\n<br />\n-Meadowbrook Swimming club opus<br />\nates. It pointed out that the men<br />\nA photography contest, with prizes<br />\nwho are giving their lives and seem- of $5 for the first in each division<br />\nity to fight for what they believe and a Hullabaloo for the second in<br />\nto be the right way of life, as each division, will be sponsored by<br />\nDr Sidney Painter, faculty adviser<br />\nhowever, most students would be<br />\nThe first interfraternity pledge<br />\nThe Student council protested Americans, deserve better than to be the Hullabaloo beginning Monday, on the selective service status of Hopbanquet in the history of the Hopliable to conscription before entering<br />\ndiscriminated<br />\nagainst by such an September 7.<br />\nkins students, commenting upon the as freshmen.<br />\nkins will be held Wednesday at 7 against the Meadowbrook's treatment organization.<br />\nThe purpose of this contest is to statement last Friday from War<br />\nof a United States army officer<br />\npm in the Great hall of Levering, it<br />\nThe spokesman said further that stimulate student interest in the<br />\nObviously, under these circumearli_e_rin_the...yea_.r. The officer had<br />\n,<br />\n13 Jack<br />\nManpower administrator Paul V Me-was anriOnfiCe21'last -1,71<br />\nbeen refused admission to the club' —the Cfilinca— relieved -12cg- issue to iffillabaloo. Etirryone sa've the judges rl-riff; Said on 'A*sday, \"Regardless<br />\ntiCia-Tioriii authority would have<br />\nHartmann, executive chairman of the<br />\nbe<br />\nof<br />\nimportance<br />\nto<br />\nthe<br />\ncitizens<br />\nof<br />\nand staff of the Hullabaloo may of the methods uSed and regardless to be set up -to select those candidates<br />\nbecause of his religion.<br />\naffair.<br />\nBaltimore<br />\nand<br />\nthe<br />\ncountry<br />\nat<br />\nlarge,<br />\nenter.<br />\nCampus<br />\nscenes<br />\nas<br />\nwell<br />\nas<br />\nfit<br />\nfor college.. Physicists, doctors,<br />\nNeither Mr Morris nor the Meadowof.who exercises the authority, imThe banquet is sponsored jointly<br />\nbrook club had apologized for their as well as the students of this Uni- personality shots are acceptable. A portant changes most be expected as engineers, chemists, and men in simiby the Interfraternity board and<br />\nversity.<br />\ncontestant may submit hie own pic- our nation's educational system be- lar vital occupations will be needed;<br />\naction<br />\nto<br />\ndate<br />\nor<br />\nanswered<br />\nthe<br />\npledges,<br />\nfraternity<br />\nLevering hall. All,<br />\nThe council also began workbig ture if he desires, and no maximum<br />\ncomes subject to wartime planning.\" and a supply of such men will have<br />\npledge-masters, and fraternity presi- several condemnations of them appearing in the Sun \"Forum\". There- on plans for elections of class office's has been placed upon the number<br />\nDr Painter went on to say.that a to be trained, even if they do not be'<br />\ndents have been invited.<br />\nand<br />\ncouncil<br />\nrepresentattves<br />\nunder<br />\nthe<br />\nof<br />\npictures<br />\nany<br />\nsingle<br />\nperson<br />\nmay<br />\nfore,<br />\nthe<br />\ncouncil<br />\nundertook<br />\nthe<br />\nlowering of the draft age to include come useful until after the war. The<br />\nletter<br />\nThe cost of the banquet will be 75<br />\nnew speed-up system. Dwald Roth- submit. Editor David Weiss said on the age groups or 18 and 19 is almost troublesome question, said Dr Paintcents per person. The fraternities of protest, it announced on Tuesday.<br />\nman has presented a An to the Wednesday that he hoped that as Inevitable. With this change, he add- er, is: How and by whom should these<br />\nThe council felt that since the<br />\nwill pay 25 cents of this and the inCouncil,<br />\nand they are considering<br />\nmany students as possible would ed, some definite system will be re- students be chosen? Many educators<br />\nHopkins had patronized the Meadowdividual will pay fifty cents.<br />\nbrook many times in the past for Its features. Other plans will also enter the contest, since fifteen pages quired to choose<br />\nstudents who feel themselves capable of deciding<br />\nThe program is as follows:<br />\nbe considered, and the Council hopes of this year's 'Hullabaloo are to be will be permitted to go to college. At upon who shall be enrolled, if CerInvocation: Rev George Packard of dances and parties, and since many<br />\nthrough<br />\nmodification and compromise devoted to snapshots selected from the present time,' Dr Painter said, tain liniitations are made by some<br />\nHopkins students patronize<br />\nthe<br />\nthe Epiphany Episcopal church<br />\nMeadowbrook as individuals, theyl to evolve a satisfactory system of those entered. The judges of the students do not titually become sub- sort of quota system.<br />\nSteak dinner<br />\nelections<br />\nbefotetteIncoming fresh- contest have not yet been selected. ject to the draft until their junior<br />\nhad all the more reason for taking a<br />\nThe army, conjectured Dr Painter,<br />\nToastmaster: Dr Sidney Painter<br />\nman class arrives in October.<br />\nWeiss requests<br />\napplicants to year. If the age limit were lowered, would prefer to have the control of<br />\nstand on the issue at this time.<br />\nWelcome: Lorin Stieff<br />\nAnother part of the council's work give him their names, addresses, the<br />\nThe letter, which will be printed<br />\ncollege manpower in its hands by<br />\nMusical interlude: Harold Kolmer<br />\nin a forthcoming NEWS-LETTER, con-- this last week was a joint meeting number of photographs, and the<br />\nforcing each student to join the enAddress: Dr Wilson Shaffer<br />\ndemned the principal upon which the with the Cotillion board to fix and ap- contest divisions in which they are<br />\nlisted reserve. In' that way, the army<br />\nRemarks: Mr Gardner Mallonee<br />\nprove<br />\ndates<br />\nfor<br />\nforthcoming<br />\ndances<br />\nentered.<br />\ncould induct any man thought to be<br />\nOsmar<br />\nP<br />\n'by<br />\nThe Ode: conducted<br />\nat the University. The schedule of<br />\nRULES<br />\nless useful in college than he would<br />\nSteinwald.<br />\ntentative<br />\ndates<br />\npresented<br />\nby the Co- 1 One entry blank will be required<br />\nbe in the armed service.<br />\nThe committees who have been<br />\ntillion board was approved by the<br />\nfor each division, no matter how<br />\nworking on arrangements for the<br />\nMr McNutt, on the other hand,<br />\nCouncil.<br />\nmany<br />\nphotographs<br />\nthere<br />\nare;<br />\nbut<br />\nwishes to see the control of college<br />\ndance are:<br />\nRecently, the Council held a<br />\none entry blank must accompany<br />\nenrollment<br />\nProgram committee: Abbot Shefplaced under his War<br />\nOn August 24, Blanchard Randall,<br />\norderly-conduct trial in which the<br />\neach division.<br />\nt<br />\nfier, Phi Epsilon Pi; Jim Cantrell,<br />\nsr, Baltimore btleilheas man and trus- Manpower commission. Dr Painter<br />\noffender<br />\nwas<br />\nreprimanded<br />\nfor<br />\n2 The divisions are as follows:<br />\nBeta Theta Pi; Ted Prevost; Delta<br />\ntee of the University, died in his sleep suggested that if the power were<br />\nactions at a YMCA open-air dance.<br />\n(A) Campus scenes with the camlodged here, educators would prob..'<br />\nPhi.<br />\nSt the age of 86,Years.<br />\nA mass meeting of all freshmen will<br />\npus as background and anySpeaker's committee: Lorin Stieff,<br />\nMr Randall waAa prominent figure ably be given quotas, which might<br />\nbe held by the Freshman commission<br />\nthing as a subject.<br />\nAlpha Delta Phi; Jerry Cohn, Phi<br />\nat the Hopkins, tieing a member of be narrowed down to the point of<br />\nof the YMCA immediately after<br />\n(B) Personality shots, teachers as<br />\nspecifying the number of students to<br />\nSigma Delta; Monty Elmendorf, Phi<br />\nthe Board of Troitees from 1902 to<br />\nROTC drill at 5 pm on Monday, Sepwell as students, where the<br />\ncourse.<br />\n1942. In 1930, he was elected vice- be accepted in each<br />\n.<br />\n-28t5rie\"Cot?reZa.<br />\nBob Stier- tember 7, in the Sherwood room of<br />\ncampus is not in the backpresident of the toard, and he kept<br />\nwill be in top-notch condit....<br />\nHowever, this solution might per.vering hall. At this meeting fuground or the subject.<br />\n.<br />\nthis position on,Illness forced him mit a problem which is now attainup their sticks for the Blue Jays defense ny<br />\nthe Commission will<br />\n?The print must be at least 3x4,<br />\nTau Beta Pi, national honorary.,<br />\nIn the forty ing large proportions to continna<br />\nto resign this<br />\nwhen the next regular season rolls ning point was mati<br />\n.<br />\n.,<br />\nfraternity in engine<br />\n,<br />\n,OL ta<br />\nk°S<br />\ncase the Hullabaloo wisher) to trus, ee, Mr Randall attended every that it is those students who are<br />\nWaiure ailtriarnhienrriir— trie—Or- three seniors, two juniors and t<br />\nTancecornnnttee ifirriLaoPiird,<br />\nchange the size of the print.<br />\nganization will be determined by the graduate students at an assembly<br />\nConimempration Day exercise at the financially able, and not necessarily<br />\nDelta Upsilon; Jed Goldberg, Epsilon<br />\nenthusiasm shown at the meeting for in Latrobe 120 on Tuesday, August 4 Contest ends at 4 pm, November<br />\nthose who best fulfill the mental reTau Alpha; Jack Hartman, Kappa<br />\nthe hay ride, wiener roast, and fall 27.<br />\n2, 1942.<br />\nA grain broker and financier, Mr quirements, who are accepted in colAlpha.<br />\nRichard Muller, mechanical engi- 5 Any student or employee of the<br />\nRandall was president of the Balti- leges.. Dr Painter suggested that<br />\n\"The theme of this pledge ban- Goucher mixer suggested by the<br />\nUniversity is eligible, with the<br />\nmore Chamber of Commerce and the government fellowships or. scholarquet,\" Lorin Stieff, president of the executive board. Plans will also be neer, Donald Kerber, electrical, and<br />\nexception of the judges and staff<br />\nInterfraternity board said yesterday, made for the reception into the Com- J B Rosen, electrical, are the seniors,<br />\norganization of grain dealers. An ships for needy but capable students<br />\nmission of the freshman class en- Floyd Culler, chemical engineer, and<br />\nof<br />\nthe<br />\nHullabaloo.<br />\nthe<br />\ngrasp<br />\nmay<br />\nmen<br />\n.<br />\nHopkins<br />\nactive member in the Protestant are not unlikely in the near future.<br />\n\"is 'that<br />\ntering in October. ,<br />\n(Continued on Page 4, Col. 6)<br />\nFrank Shanty are the juniors. The<br />\nEpiscopal church, he was also treashigher meaning of \"fraternity,\" and<br />\nHe went on to discuss the reserve<br />\nClintoh Redgrave, chairman of the two civil engineering graduate stuurer of the Maryland Diocese. corps plans of the army, navy, and<br />\nthat; true \"fraternity\" may flourish<br />\nCommission,<br />\nstated<br />\nin<br />\na<br />\nnotice<br />\neur<br />\nto<br />\nall<br />\ndents tapped are Walter Boyer and<br />\nThrough be never ran for an office, air forces with reference to Mr Mcamong the brotherhoods at this,<br />\nfreshmen, \"The executive board urges<br />\nMarlin Zimmerman was presented<br />\nMr Randall took 'part in Maryland Nutt's statement. Those who are<br />\nuniversity.\"<br />\nFinal examinations for the<br />\nyou to attend this, short meeting so with a copy of Handbook of Physics<br />\npolitics, having attended several Re- in these corps at present can probJune term have been advanced<br />\nthat we May clarify the functions and Chemistry as an award from the<br />\npublican national conventions. He e)* expect to graduate before they<br />\none week; and will be held from<br />\nand objectives of the Commission.\"<br />\nfraternity for being the outstanding<br />\nwas a director of three banks and will be inducted. However, if the<br />\nSeptember 28 to October 2, thus<br />\nThe group's last activity was a freshman engineer last year.<br />\none of the founders of the Baltimore draft age should be lowered, some<br />\npermitting a one-week's vacaswimming party at Lakewood pool on<br />\nRosen is a member of Phi Epsilon<br />\nMuseum of Art. Although he retired limitation will have to be made on<br />\ntion between semester, Dean<br />\nThursday, August 20. Horace Sieg- Pi and associate editor of the Hullafrom business eight or nine years the number of men permitted to enBerry<br />\nannounced<br />\nin<br />\na<br />\nbulletin<br />\nler, program chairman, reported it baloo. Culler is a member of Kappa<br />\nago, he remained on many -boards roll.<br />\n?<br />\nposted this morning.<br />\nsuccessful in spite of a small attend- Alpha, and Zimmerman is a member<br />\nuntil illness forced him to resign<br />\nSince the army can use its men<br />\nance.<br />\nof Beta Theta Pi.<br />\nimmediately, Dr Painter said, it is<br />\nthis<br />\nyear.<br />\nBeta circle of Omicron Delta<br />\nlikely to accept in its reserve corps<br />\nKappa, national honorary activities<br />\n.<br />\nOnly those most vital to the war ef<br />\nsociety, tapped ,four seniors at an<br />\nfort, such as fore-medigineerassembly in Latrobe 120 on Tuesday,<br />\n—<br />\ning, and scientific students.<br />\nAugust 27, at 12.30 pm. Donald<br />\nThe navy and afr corps, on the<br />\nRothman, 'Corbin Gwaltney, Dallas<br />\nother hand, only maintain a pool of<br />\nHoadley, and Mike Callas are the<br />\n\" manpower, so that officers will be<br />\nmen tapped.<br />\navailable when ships and planes now<br />\nRothman is vice president of<br />\nnational Youth director of RWR,<br />\nStudents interested in helping the by any means which will not result in Production are completed. ThereRussian War Relief<br />\nStudent council, feature editor of the<br />\nRussian War Relief is planning to reported on what the young people Junior division of the Russian War in aid to the Axis powers.\"<br />\nfore, the men under the navy and air<br />\n'NEWS-LETTER, and a member of the<br />\nhold a pageant and dance on Septem- of America are doing for Russian Relief should apply for detailed<br />\nThe Department of State has re- corps plans need not be studying for<br />\nwar council, Barnstormers, Hullabainformation<br />\nto<br />\nRWR<br />\nheadquarters,<br />\nber 10 at the Fifth Regiment armory, relief. Officers were' elected and a<br />\nceived reports from its own repre- vital occupations in order to enroll.<br />\nloo, tennis team, debating council,<br />\n411 North Charles street, Vernon sentatives abroad and from the Swiss Dr Painter said that enlistment unit was announced this Week kry Miss board of fifteen volunteers was<br />\nand the senior week committee,<br />\n6851.<br />\nrepresentatives of the International der one of these two plans might be<br />\nGwaltney is editor of the Freshman Lillian Gordon, Iliairman of the formed; working committees were<br />\nRed- Cross committee in 'charge of the means by which certain nonhandbook and News, vice president Junior division of the organization set up. The conference was closed Greek War Relitf<br />\ntechincal students' would be permitted<br />\nby the unanimous acceptance of a<br />\nDr David M Robinson, professor the distribution of supplies sent to<br />\nof the YMCA, and leader of Freshman in Baltimore.<br />\nuntil graduresolution to send greetings of en- of archaeology, has accepted the Greece, Mr Welles said, \"These re- to continue their studies<br />\ncamp.<br />\nHopkins Members of the division<br />\nation.<br />\ncadet major of the include 'Elmer Eisner, Leo 'Diesencl- couragenient and admiration to the position as chairman Of the campus ports, satisfy the Department that'<br />\nHoadley i<br />\ndisROTC, president of Scabbard and ruck, and Mayo Greenberg, physics Russian youth.<br />\ncommittee for Greek War Relief, it the food has been effectively<br />\nThe group's firht project was a was announced by Dr Emile Malakis, tributed through the 'organization of<br />\nBlade, president of Officer's club, instructors; and Abraham Seidenchairman of Senior week, and mem- berg, math instructor. Sponsors will Tag day held .on August 28 and '29 chairmen of the Baltimore drive. Dr the International Red Cross committee and consumed by the Greek<br />\nber of the baseball team.<br />\nbe: Dr Leon Sachs, former instructor as part of the present RATI2 cam- Malakis and Dr Panos Morphopoulos,<br />\npeople themselves. The reports of<br />\nCallas is president of AICE, presi- in political science at the Hopkins; paign for funds. Returns from street both of the Romance Languages dehowever, that<br />\ndent of Tau Beta Pi, and adjutant Carlton Harrison, director of the solicitations made on those days are partment, are serving on the com- these officials indicate,<br />\nalthough these supplies have unThe annual frosh-soph dance will<br />\nmittee.<br />\nin the ROTC.<br />\nBaltimore YMCA; Gustav Bisgyer, expected to total $2000.<br />\nquestionably<br />\nsaved<br />\nmany<br />\npersona be held early in December at the<br />\nMiss Gordon said, \"The eyes of<br />\ndirector of the YMIa; Dean Dorothy<br />\nThe relief organization- plans to<br />\n. in- Southern hotel, it was ahnounced this<br />\ndeath,<br />\nthey<br />\nhave<br />\nbeen<br />\nfrom<br />\nStimson of Goucher College; Rever- the whole world today are turned open a .drive on September 20 to<br />\nMiss Irene Davis, registrar,<br />\nadequate to prevent further deterior- week by Ted DeBois, president,of the<br />\nend Arrowsmith of the Pro-Cathedral; to the Russian front. All know well raise funds for the transporting to<br />\ntold a NEWS LETTER reporter on<br />\nThe Townsmen<br />\nation of the general food supply sophomore -class.<br />\nand Dr Hans Froelteher, headmaster by now, after witnessing more than Greece of breadstuffs given by the<br />\nWednesday that students who<br />\nsituation<br />\nin that country.\"<br />\nhave been signed to furnish the<br />\na year of her stubborn resistance, Canadian government. This money<br />\nof the Park school.<br />\nare called into active service<br />\nnot yet been<br />\nprice<br />\nhas<br />\nmusic.<br />\nThe<br />\nIn *order to enable aid to be give\";<br />\nThe Baltimore youth division of the significance of her role in the will also be used to purchase and<br />\nmay resume their college courto the Greeks, the British and determined,<br />\nworld-wide battle against Axis domi- send medical supplies.<br />\nmeetorganized<br />\nat<br />\na<br />\nwas<br />\nthe<br />\nRWR<br />\nthe<br />\nHopkins<br />\nat<br />\nthe<br />\nend<br />\nof<br />\nses at<br />\nDeBois and Fred Weekes, freshman<br />\nThe Greek War Relief has received American governments have waived<br />\ning called on August 19 at the YMCA. nation. But a nation cannot fight<br />\nthe war. Their credits will be<br />\nthe class president, are acting as exRepresentatives from twenty organ- the Nazi military machine, as Russia a letter from Summer Welles, acting the embargo on breadstuffs; and<br />\ncarried over provided they return<br />\nhave given as- ecutive chairmen of the dance.<br />\nizations attended the meeting which has, without paying its toll; and Secretary of State, assuring them Axis governments<br />\nwithin a reasonable time, after<br />\nfeatured a description of a six-month Russia has not only fought well but, that 'the tragic situation in Greece surances regarding safe-conduct for Assisting them are the freshman and<br />\nthe peace.<br />\nShould a student<br />\nvessels<br />\ninvolvsd<br />\nand<br />\nregarding the sophomore class officers and Student<br />\nconvpy trip to Murmansk by Mr paid dearly. It is therefore the most has been a matter of serious concern<br />\nbe called in the middle of a<br />\nEd Dos-land, a member of the mer- pressing duty of her Allies to<br />\n,see to this Government, which has been conditions for the disposal of the council representatives. DeBois and<br />\nsemester, he will probably be<br />\nWeekes also have appointed a spirit<br />\nchant marine. Dr Vlaimir Razake- not (inly that she continues to fight endeavoring, in association with the imports and the use Of native Greek<br />\ndeferred until the end of the<br />\ncommittee of four sophomores and<br />\nvitch of ColuMbia university address- but also to relieve the burden At British and Greek Governments, to produce by the Greek people.<br />\nsemester, Miss Davis said.<br />\nMr<br />\nWelles<br />\nconcluded<br />\nhis<br />\nletter<br />\nby<br />\ntwo freShmen.<br />\ned the group on the role of Russia her sacrifice as much as humanly arrange for the extension of effective<br />\n(Continued on Page- 4, Col d)<br />\n(Continued on Page 4, Col 6)<br />\nin thil war; and Miss Joy Hume, possible.\"<br />\nrelief to the starving Greek people<br />\n<br />\nBlanchard, Randall,<br />\nHopkins 'trustee,<br />\nDies in Sleep<br />\n<br />\nFh<br />\nres men To Plan<br />\nFuture Activities<br />\nAt Mass Meeting<br />\n<br />\nTau Beta Pi<br />\n<br />\nTaps Seven Atlen<br />\n<br />\nFlash ...<br />\n<br />\nODK Inducts<br />\n<br />\nActivity Leaders<br />\nIn Assembly<br />\n<br />\nRussian and Greek War Reliefs Open Drives For Funds;<br />\nMalakis Appoints Robinson Campus Chairman for Greeks<br />\n<br />\nDeBois Announces<br />\n<br />\nFrosh-Soph Dance<br />\n<br />\n\fTHE JOhNS HOPKINS<br />\n<br />\nNEWS-LETTER<br />\nFounded 1897<br />\n$2.00<br />\nSubseratglon per year<br />\n82.50<br />\nBy Mail<br />\nRemit subscription feet to Treasurer, Student Activities Council,<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second class matter, December 3, 1909, at the .postoffice<br />\nin Baltimore, Md., under the Act of Congress, March 3, 1879.<br />\nPublished weekly front October to June, except during examination<br />\nand college holiday lwriods by undergraduates of the Johns Hopkins<br />\nUniversity.<br />\nBOARD OPCONTROL<br />\nThinald kleniltig<br />\nJames Applegase<br />\na.,......<br />\nLeo Flashman,<br />\nDon Rothman —<br />\nEd Schwartz .......<br />\nAlan Abelman<br />\nEarl Usdin<br />\n<br />\n___,_____<br />\n.<br />\n<br />\nEditor-in•Chief<br />\nNows Editor<br />\n.<br />\nMake-up Editor<br />\nFeature Editor<br />\nSport, Editor<br />\n—Bneinest Manager<br />\nAdvertising Manager<br />\n<br />\nSTAFFEDITORS<br />\n<br />\n•<br />\nCopy Editor<br />\nExchange Editor<br />\n<br />\nAlfred<br />\nCarl Schopfer<br />\n<br />\n_ .....,_ ... _<br />\n, REPORTERS<br />\n-— Maxwell Abelmao, Marvin Adelson, Atom Berman, Russell DinerErnest<br />\nstem, Jerome Cohn, Ted DeBois, ritz Dodson, Milton Glatt, RosenzGohn, Arnold Haiberger, Bill Himberg, Charles Jules, Leonard<br />\nweig, Seymour Rubin, ,Alan Schwartzman, Henry Seidel, Henry Siegel,<br />\nBill Smith, Jack Weinbaum.<br />\nBUSINESS STAFF<br />\nAlan Abelrnan<br />\nEarl Usdin<br />\nBernard Ellinghaus<br />\n<br />\n, 10MEWOOD, tsALTIMORE<br />\n<br />\n-NEWS—LETTER<br />\n<br />\nPAGE T\\A/0<br />\n<br />\nDraken Manager<br />\nAdvertising Manager<br />\nArrmastiog Manager<br />\nMelville Magid*, Iry Woloeb<br />\n<br />\nReprctented for National Advertising by<br />\nNATIONAL Megan.. Smits, Inc.<br />\n420 Madison Avenue; New York City, New York<br />\n<br />\nFRIDAY, SEPTEMBER 4, 1942<br />\nOne would think it a stupid platitude to announce<br />\nShadows<br />\nthat we are at war. Evidently, however, the MeadowAnd Mockeries? brook Swimming club and<br />\nits executive, George R Morris, if they are at all aware of the fact, are not aware<br />\nof some of the most fundamental ideals connected with<br />\nthe prosecution of the war:At would -be ridiculous to<br />\nsupport any delusions that the war is being fought entirely on the basis of a conflict of ideals; but it is also<br />\nerroneous to ignore the existence of idealistic principles<br />\nin the minds of the people.<br />\nThe principle involved is the anti-Semitism which<br />\nwas one of the earliest offenses charged against the<br />\nHitler regime. It is also one of the fundamental principles of the New Order as expressed in Hitler's Mein<br />\nKampf. It is rather frightening to see ,t} attitude given<br />\ninch blatant x ression in this country 'as it has be<br />\ngiven in the recent 'incident at Meadowbrook. The\" act<br />\nthat the Jewish man who was refused admittance was<br />\nan army officer is important only in that it makes the<br />\nparadox more obvious. That a man who is fighting<br />\nagainst the forces of anti-Semitism should meet it in<br />\nhis own country is a readily observed contradiction.<br />\nIt is comme able that the Student council has taken<br />\nenough interest n the affaii to make its opinions known<br />\nto the manage4ut of the offending establishment. The<br />\nincident is sn,fill, but its ramifications are vast and<br />\nthreatening. 1 is gratifying to know that the Council<br />\nis doing what t can to keep the ideals of the war from<br />\nbecoming mer shadows of actuality and mockeries for<br />\nthe annals of future generations.<br />\n<br />\nReaffirmation<br />\n<br />\nThcr last issue of the<br />\nNEWS-LETTER discussell the<br />\nphysical education program<br />\n<br />\nOn the Lodges<br />\n<br />\nof the Hopkins in the new<br />\nAnd Retraction<br />\nlight thrown upon it by Mr<br />\nLoos' death. Our editorial<br />\nmade two points: the crude irrelevance of saying that<br />\nLoos would have been dead in a year anyhow; and the<br />\nright of the students to expect that tests of fitness to<br />\ntake part in the sports program would be reconsidered.<br />\nBoth points seem as valid now as then. The implication that the department had saved Loos much suffering, and indeed had done him a favor, sounds no<br />\nbetter with the passage of time. Moreover, the adequacy<br />\nof physical examinations at the Hopkins still deserves<br />\nto be reexamined.<br />\nHowever, this second point needs clarifying, and the<br />\nNEWS-LETTER is happy to point out two respects in<br />\nwhich the editorial was unfair._<br />\nOn the one hand, it drew from Dr Shaffer's statement the conclusion that he was entirely satisfied with,<br />\nif not complacent over, the physical examinations now<br />\ngiven. We submit that this was a reasonable inference,<br />\nbut we are glad to say that is is a mistaken one. Even<br />\nnow, the physical education department is considering<br />\nchanges meant to improve the University's tests of fit.<br />\nness. Of course, the nature of the changes cannot be<br />\nrevealed; but Dr Shaffer cannot be accused of complacency.<br />\nOn the other hand, the editorial greatly underestimated the costs of a complete clinical examination. They<br />\nmight very well run to from eight to ten times the<br />\nmedical fees now charged at the University.<br />\n<br />\nBy Lorin Stieff<br />\nFor the second time within a year,<br />\nthe lodges are again confronted with<br />\nthe problem—What to do with incoming freshman?<br />\n<br />\nAs usual, the<br />\n<br />\nproposed solutions run from deferred<br />\nrushing to condensed rushing period<br />\nof only a few<br />\ning<br />\n<br />\nevery<br />\n<br />\nweeks, with rush-<br />\n<br />\nnight.<br />\n<br />\nEach<br />\n<br />\nplan<br />\n<br />\npre-<br />\n<br />\nsents an almost perfect solution for<br />\none or possibly two of the many<br />\ndifficulties that are encountered in<br />\nrushing.<br />\n<br />\nUnfortunately,<br />\n<br />\nhowever,<br />\n<br />\nmany of the remaining phases of the<br />\n<br />\nThe Saturday Evening question are either neglected comPost article on inflation, pletely or met ineffectually.<br />\nThe Campus and<br />\nNevertheless, we will not be as unInvisible Greenbacks by<br />\nprepared in October as we were in<br />\nMr Scherman's<br />\nHarry Scherman, has been<br />\nJune, since much has been learned<br />\nGreenbacks<br />\nwidely publicized and often from the rushing<br />\nexperiences of the<br />\nreprinted. The Reader's early summer. Perhaps the most imDigest has digested it, and Mr Scherman's own Book- portant lesson was that it was imof-the-Month club has published it in pamphlet form possible to compete against the 4-6<br />\nc:<br />\nfor issue to its members.<br />\npm gym classes. Then too, the utter<br />\nThe article merits review, however, if only to en- confusion of Levering hall during<br />\nlunch hour was not the best place to<br />\ncourage others to read it who have not been influenced meet freshmen for<br />\nthe first time. In<br />\n,<br />\nto do so by its constant repetition. In very simple terms an attempt to counteract these two<br />\nwhich anyone, particularly any college student, should major objections, night rushing was<br />\nbe able to understand readily, Mr Scherrnan expiainsi introduced in the second and fourth<br />\nweeks<br />\nokra,<br />\n-A4--hsAi\"\"abw<br />\nti:Idiitrt-eraui'argyan-Z:eoterat-iighicondition known as inflation. The \"cure\" which he sug- rushing is the ease and efficiency with<br />\nwhich<br />\ncontact<br />\nmay be established begests is, of course, mainly the extensive purchase of<br />\nwar bonds and savings stamps. Posters, cartoons, tween a rather bewildered group of<br />\n<br />\nWelles,Surpasses'Kane'<br />\nWith Ostrich Era Drama<br />\npicture, an who is the only mercury<br />\nBy Amos TAYLOR<br />\nThe Magnificent Ambersons ought player retained in The Magnificent<br />\nscenery<br />\nto be seen twice, once for the<br />\nAmbersons. The finest acting is proand once for the story. Orson Welles<br />\nvided by Agnes Moorehead as the<br />\nhas written and directed an overcomplicated but, on the whole, skill- half-crazed aunt, whose performance<br />\nful screen adaptation of Booth Tark- is a superb and subtly shaded piece<br />\nington's 1919 Pulitzer prizewinner, of acting, except in several scenes<br />\nLike its predecessor, Citizen Kane, its where she becomes overwrought, a<br />\naction takes place in amazingly de- fault due to the direction. Tim Holt,<br />\ntailed and gloomily lighted sets, and<br />\nas George Amberson Minifer, is a<br />\nthe acting is pitched on the same<br />\ncarbon copy of Welles himself, but<br />\nkey of passionate, brooding melan- without the director's command of<br />\ncholy.<br />\nnuance and timing. Dolores Costello<br />\nThe splendiferous tribe of Amber- is excellent as George's mother, and<br />\nsons (\"Uncle Jack is a Congressman<br />\nAnne Baxter is pretty and dimply a9<br />\n—the Ambersons always like to<br />\nMorgan's daughter. The acting, howhave someone in Congress\") is the ever, is generally on a lower plane<br />\nenormously wealthy family domithan that of Citizen Kane, and has<br />\nnating a small American town of the<br />\nbeen synthesized by Welles into the<br />\n1870's. Their mansion, built during peculiar sort of highly condensed and<br />\nthe ostrich period of American archi- morbid mood which to him is evitecture, is an overflowing museum of dently drama. The result is an overeverything ugly and ridiculous, but intensification of emotion on the<br />\ndeemed elegant when our grand- part of the individual actors that beparents were young. A strong reason comes almost urrbearable, and that<br />\nfor seeing the picture from the- be- brought a number of laughs from the<br />\nginning is simply to get used to the audience in which the reviewer sat.<br />\nastonishing interior of this house beThe Ambersons is superior to Kane<br />\nfore the action of the story becomes in the presentation of its plot, which<br />\ntoo important to allow for distracis straightforward and avoids , the<br />\ntions. For the story becomes intense flashbacks and confusing duplication<br />\nand gripping with the kind of drama<br />\nof episodes in the former picture.<br />\nonly Welles knows how to produce—<br />\nFurthermore Welles has recovered<br />\na circumstance, when all is said and<br />\nfrom his first druriken realization<br />\ndone, for which Hollywood can be<br />\nthat the camera can be made to gaze<br />\nthankful. The attention .of the piceffectively at ceilings and actors'<br />\nture is concentrated largely upon<br />\nfeet; the photography is beautiful<br />\nyoung George Minifer, the spoiled<br />\nand unusually impressive without<br />\nand unstable Amberson heir, whose<br />\nbeing eccentric. As in Kane, the<br />\nraging Oedipus complex prevents his<br />\nmakeup of the aging characters is too<br />\nmother, a widow, from seeing a<br />\nobvious for the intimacy of screen<br />\nformer suitor who is renewing his atcloseups. Certain characters, such as<br />\ntentions. Morgan, the former suitor,<br />\nthe old Colonel Amberson, appear<br />\nis the inventor and manufacturer of<br />\ntoo briefly to make more than a<br />\nan automobile which is changing the<br />\nfleeting impression; this is due to<br />\neconomy of the town and gradually<br />\nIntense condensation of a complex<br />\nruining the Ambersons; in addition<br />\nplot.<br />\nhe is the widower father of the girl<br />\nIn spite of the obvious faults of<br />\nyoung George is in love with. The<br />\nCitizen Kane and The Mr,aniftcient<br />\nsituation is obviously complicated,<br />\nAn bas sons ..Qn.) • '<br />\nand it isn't simplified by the in'<br />\nduction of numerow<br />\ning George's<br />\n5.9<br />\nsittraus-ireviffXI<br />\n<br />\nat<br />\n<br />\non the inventor.<br />\nThe largest role, that of Morgan,<br />\nis *done well by Joseph Cotten, who<br />\nwill be remembered as Kane's dramatic-critic buddy in the former<br />\n<br />\nfreshmen and the fraternity system<br />\nat Hopkins.<br />\nThe disadvantages of night rushThis is in direct opposition to one<br />\nsuch as \"Buy a Stamp and Slap a Jap\" designed to ing are so obvious that they hardly of the major purposes of the rushing<br />\nexcite the country into purchasing these securities. \"Ten- need mention, yet they are often agreement; that is, to equalize the<br />\noverlooked when the subject is unPercenter\" obligatory notes and wage deductions are der discussion. One of the principal rushing opportunities of all the fraternities on the campus.<br />\nbeing promoted—designed to impress the country into problems confronting the committee<br />\nIf only street cars are used, howpurchasing them. Mr Scherman's calm and straight- at present redrafting the rushing ever, it will be very difficult for some<br />\nforward explahations of why these purchases—in great code is the inclusion of night rush- of the fraternities to cover the whole<br />\ning.<br />\nfreshman class in the time allowed,<br />\namounts—are vital and indispensable seems to be the<br />\nBefore a final decision is made, since it is expected that the October<br />\nmost intelligently effective and eloquent propaganda one consequence of this method enrollment will be at<br />\nleast as heavy<br />\nof all. It gives the excuse for the posters and slogans; should be carefully considered: cars as that of June.<br />\nshould<br />\nnot<br />\nbe<br />\nused,<br />\nfor<br />\nit<br />\nis<br />\nan<br />\nunFor those who favor some other<br />\nwithout it the rabble-rousing techniques seem exagWith Thomas E Dewey<br />\njustified waste of both tires and gas. form of rushing, the problem will be<br />\ngerated and insulting.<br />\nFurthermore, if the use of cars were simplified by the elimination in Octoand Dean Alfange as inter.<br />\nMr Scherman's plea for continued and increased sanctioned, the rushing ability of a ber of -the ' 4-6 prri freshman gym<br />\nested spectators, John J<br />\npurchase of war bonds and stamps brings occasion for fraternity would depend to a great classes. This has been accomplished<br />\nBennett has been nominated<br />\nintrospection as to how 'much the Hopkins campus has extent on the number of cars avail- by a plan requiring the lapse :of a<br />\nfor governor of New York<br />\nable.<br />\nday between the two lab lieriods of<br />\n-contributinges records<br />\n,the Treasurer's<br />\n-k.P4,.<br />\n-oriV -subjeet.-account<br />\nof<br />\nour<br />\nresponse.<br />\noffice<br />\ngive<br />\na<br />\nvery<br />\nunsatisfactory<br />\nA preliminary report on the 1942<br />\nident Roosevelt. Precisely what this means, no one is<br />\nagreement was subMitted,<br />\nrushing<br />\nthis<br />\nwar.<br />\nWe<br />\nare<br />\nof<br />\nthe<br />\nage<br />\nwhich<br />\nmust<br />\nfight<br />\nWe<br />\nsure; but the editorial writers are all agreed that it<br />\nto the interfraternity board last<br />\nage which must support itself among postmeans something. Since most of them have entered into are of the<br />\nWednesday. It is as follows:<br />\nwar conditions. We should be of the age which is most<br />\nFirst week<br />\nfretful wedlock with the administration for the course<br />\nthe<br />\nto<br />\naccelerate<br />\neverything<br />\nit<br />\ncan<br />\nKnown or unknown to most stuinterested<br />\nin<br />\ndoing<br />\nMr<br />\nRushing will be carried on two<br />\ncriticize<br />\nto<br />\nchance<br />\nthe<br />\nof<br />\nglad<br />\nof the war, they are<br />\nconditions dents at the Hopkins, many of the nights of the week between the hours<br />\nRoosevelt without suing for divorce. They are saying victory and to prepare for the best possible<br />\nfaculty are,, now engaged in vital of 7:30 pm and 10:30 pm; and on<br />\nafter the peace.<br />\nthat the president neglected the war to play politics,<br />\nwar work in Washington. In a Sunday afternoon from 2 pm to 5<br />\nseries of articles from time to time, pm. The interfraternity ball will be<br />\nand got his fingers properly burnt.<br />\nA week ago the Y held the NEWS-LETTER will present thumb- held on the Saturday night of this<br />\nThey are also saying, in. their chilliest and most<br />\na second under-the-stars nail sketches of a few of these men week. Only fraternity men will be<br />\nscornful tones, that the leader of a democracy at war<br />\nadmitted.<br />\ndance. As with the first, the and their activities.<br />\nshould not engage in politics. This is meant to be a<br />\nAiding the war effort as execu- Second week<br />\nreasonable,<br />\nprice<br />\nwas<br />\nto<br />\nbe<br />\ncoming<br />\nof<br />\nvirtue<br />\nsepreme<br />\nhas<br />\nthe<br />\nit<br />\nformula,<br />\nand<br />\nmoral<br />\nRushing will be carried on for<br />\ntives with the Office of Price Adminand half of this was return- istration are Dr Roy J Bullock, Dr three nights of the week and on Sunglibly to the lips and falling plausibly on the ears.<br />\nafternoon during the hours speciday<br />\nLloyd<br />\nG<br />\nReynolds,<br />\nMr<br />\nReynold<br />\nE<br />\ned<br />\nin<br />\nthe<br />\nform<br />\nof<br />\na<br />\nwartwaddleIt also has, what is less desirable, a high<br />\nfied in the first week. All fraternities<br />\nCarlson, and Dr John A Loftus.<br />\ncontent. First, the formula assumes that `politics' is savings stamp. Since the campus sales of stamps have<br />\nwill<br />\nhold open house on Saturday<br />\nDr Bullock, associate professor in<br />\nwicked, and that politicians have no social function. never been more than a trickle, the Y deserves credit for political economy. and director of ths night between the hours 8:30 pm and<br />\nschool of business economics, is now 1:30 am, during which time-the freshAnd second, it assumes that an American president is bolstering them in this thoroughly painless way.<br />\nBut the other half of the admission charge went to serving as an associate price execu- men will circulate among all the<br />\nfaithless to democracy when he tries to pick a nominee<br />\ntive in the chemicals branch of OPA. houses.<br />\nthe Hopkins War council, and here there are reservations.<br />\nfor senator or governor.<br />\nDr Reynolds, another associate pro- Third week<br />\npolifind.<br />\nIf<br />\nto<br />\nhard<br />\nFormed<br />\nearly<br />\nlast<br />\nspring,<br />\nthe<br />\ncouncil<br />\nhas thus far been fessor in political economy, is now the<br />\nShallower thinking would be<br />\nRushing will be carried on for three<br />\ntics is wicked, the basis of democratic decision is a frank disappointment to its own members and to the regional price executive in the Bal- nights of the week and on Sunday<br />\nafternoon during the hours specified<br />\nthe<br />\nDuring<br />\nof<br />\nOPA.<br />\ntimore<br />\n.oftlee<br />\nwicked, and we had best come to terms with the enemy. Hopkins in general. Nevertheless, until the first of the Y<br />\nmonth, he was on loan to Paul in the first week. All fraternities<br />\ndances, the council lacked funds, and had the right to hist<br />\nThey have got rid of politics.<br />\nV McNutt's War Manpower com- will hold open house on Saturday<br />\nask<br />\nhow<br />\nit<br />\ncould<br />\nfunction<br />\nwithout<br />\nthem.<br />\nnight during the specified hours.<br />\nquicker<br />\nway<br />\nof<br />\ntaken<br />\nthe<br />\neasier,<br />\nhave<br />\nTheir leaders<br />\nmission.<br />\nMr Carlson, an instructor in polit- Fourth week<br />\nruling, the way of force. If we would get free of pouges, '• Now it does have them. And the time has come for<br />\nFinal open house week as usual<br />\nical economy, is now serving with<br />\nthis is the alternative. It is certainly mote-'economical the council itself to answer a question, the question of<br />\nthe 'central office of OPA in Wash- 8:30 am to A am.<br />\nof the president's time and energy, which could be what it proposes to do with these funds and with its own ington.<br />\nNote: At'any time during the first<br />\ngiven outitrely to the direct task of winning the war. energies. If the council will draw up a specific program<br />\nDr Loftus, who was temporarily three weeks, an afternoon open house<br />\nmay<br />\nbe inserted for each fraternity<br />\nBut we should also have yielded on the issue over for the immediate present, it will do away with regrets appointed to take over some of the between the hours 4 pm and 6 pm (on<br />\nwork of Mr Carlson and Dr Reynolds,<br />\nlost.<br />\nwhich the war is being fought. The time to fear for for the time already<br />\nhas resigned from the staff of the a weekday only) if it is agreed upon<br />\nFurther delay cannot be justified if the council wants, University. Like Mr Carlson, he As by the intertraternity board.<br />\ndemocracy is the day a president scorns to play poli(continued -on Page 4, Col 5)<br />\nwith the Washington office of OPA.<br />\nwhat it ought to have, the respect of the campus.<br />\nGentlemen of tle press, relax.<br />\nmovies, radio, and newspapers are deluging the country<br />\n<br />\nwith pictures of the Minute man and catchy phrases<br />\n<br />\nFretful Wedlock,<br />\nShallow Thinking .<br />\n<br />\nThe Hopkins<br />\nIn Washington<br />\n<br />\nThe Refinanced<br />\nWar Council<br />\n<br />\ntics.<br />\n<br />\nboth creative and highly ski ed<br />\nthe art of entertaining, they substitute originality for formula, acting<br />\nfor smirking, and drama for hokum.<br />\n<br />\nHilltop Presents<br />\nPoor Comedy,<br />\nWell Played<br />\nBy ERNEST GOHN<br />\nThis weeks production at the Hilltop theater, Out of the Frying Pan,<br />\nIs a play which might be a great deal<br />\nfunnier than it really is if it had<br />\nmore of that mark of good comedy,<br />\noriginality. The plot is commonplace<br />\n—young people trying to make good<br />\nin New /ork and, after a series of<br />\ntrials, finally succeeding.<br />\nA play cannot be condemned, however, merely because it has an old,<br />\nwell-worn plot as the, basis of its<br />\n'existence. Shakespeare's plots are<br />\ncertainly stupid inough.1 The essence<br />\nof a good comedy is usually to be<br />\nfound in witty lines, or in amusing<br />\nsituations, or even in plain old slapstick; Out of the Frying Pan has all<br />\nthese characteristics, but yet it fails<br />\nto corne up to the standard set by<br />\nthe gieat comedies—mainly because<br />\nIt is such old stuff and because it<br />\nlacks the brilliance and charni of<br />\nthe lines in a good comedy.<br />\nThis is not to say that there is a<br />\nlack of funny lines in the play. There<br />\nare plenty of 'them. These funny<br />\nlines arrive, however, from no particular source in the incident; and<br />\nthey appear, consequently, to be<br />\nmerely stuck in by the author, Francis Swann, because they are funny.<br />\nIn addition, most of these lineo arise<br />\nout of reference to something that is<br />\noff-color. This is no .objection to<br />\nsmutty lines in comedy: it is an objection to smutty lines that are used<br />\nbecause they are smutty and because<br />\nthe author is playing to the knowledge that most people will laugh<br />\nat a dirty line whether it is really<br />\nhumorous or not. The situations in<br />\nthe play, while they provoke laughter,<br />\nare also afflicted with the burden<br />\nof<br />\nbeing old. ,So the bathtub runs over<br />\ninto the apartment below—so what?<br />\nThus the Hillti.,'s production of<br />\nthis play is handicapped before<br />\nit<br />\never gets started. Even Helen<br />\nHayes<br />\nwill fall in a bad play.<br />\nThis semiprofessional company deserves a<br />\nt(Continued on Page 4, C,91 5)<br />\n<br />\n\fN EWS-t E TI E R<br />\n<br />\nHOMEWOOD, BALTIMOR<br />\n<br />\nBlues ,<br />\nOff<br />\nBy<br />\nEDS<br />\n<br />\nParade<br />\n<br />\nPAGE THRPr<br />\n<br />\nv<br />\n<br />\nRecord Squad. Tentative Line-up for Fpotball Track Team<br />\nLacrosse Team Out<br />\nfor _sz)cce% Chosen From Sixty-live Men<br />\nDefeats Navy At First<br />\nTo Contest<br />\nPractic<br />\nIn Final Game<br />\nIn Tourney<br />\n<br />\nGuess Who!!!<br />\n<br />\nThe Johns Hopkins lacrosse team<br />\nclosed its first summer season two<br />\n<br />\n\"KuIler, g'wan in there for Klingenmeier 'n call time out.\"<br />\n<br />\nweeks ago with a 5 to 3 win over the<br />\nUnited States Naval academy. This<br />\n<br />\nJim KuIler trots across the lacrosse<br />\nfield and replaces Russ Klingenmeier.<br />\nSomeone shoots him a pass before he<br />\nhas`7a chance to call time and zing,<br />\nanother goal is scored for Hopkins. An angry, sparkling-eyed little<br />\nman jumps up from the bench: \"—<br />\nhim; I told him to call time out.\"<br />\nThat goal was one of the two which<br />\nbeat Navy 5 to 3.<br />\n• • •<br />\nThat game concluded the Hopkins<br />\nsummer lacrosse season, giving the<br />\nstickmen a .500 average. They defeated Penn State and Navy and lost<br />\nto Maryland twice. Two wins, two<br />\ndefeats—the poorest record registered<br />\nby a Hopkins lacrosse team in many<br />\nyears.<br />\nBut this was not a regular lacrosse<br />\nseastm. Coach Epstein didn't have<br />\nthe time or the material to whip up<br />\na first class ball team. He had to<br />\ncontend with the loss of the entire<br />\ndefense of the spring team and a<br />\ngood many other men besides. In<br />\ntheir stead, he had to groom Jayvee<br />\nmaterial, varsity substitutes, and<br />\nnewcomers.<br />\nDuring this post-season period, the<br />\nemphasis was placed upon exercise<br />\nand body-building for the entire<br />\nsquad rather than simply upon winning games and giving only the stars<br />\na chance to play. This has all been<br />\nin line with the new athletic program,<br />\nand although only half the scheduled<br />\ngames were won, the squad Worked<br />\nout regularly and the majority of<br />\nthe candidates saw action—if not in<br />\ngames, at least in scrimmages. With<br />\ncontinued physical training throughout the course of the year, these men<br />\nwill be in top-notch condition to pick<br />\nup their sticks for the Blue Jays<br />\nwhen the next regular season rolls<br />\n<br />\nErrors Spell Defeat<br />\nTwo unearned runs by Navy in the<br />\nsecond and sixth innings sent the<br />\nHopkins nine down to an undeserved<br />\ndefeat. The Blue Jays bunched a<br />\npair of errors together in each of<br />\nthese innings to account for the two<br />\nNavy tallies.<br />\nKen' McIntosh went the route for<br />\nthe Jays allowing only four hits.<br />\nThe Hopkins team got four hits also,<br />\nbut they were unable to capitalize on<br />\nthem. Two Hopkins scoring threats<br />\nwere thwarted as the Jays filled the<br />\nbases in the fourth with one out, and<br />\nput two on in the ninth with one<br />\nout, but failed to bring a man in on<br />\neither occasion.<br />\nNavy, too, registered four errors,<br />\nbut the margin of victory lies in the<br />\nfact that Hopkins left 13 men on<br />\nthe bases against only four men<br />\nstranded for Navy.<br />\nThis game was scheduled for several weeks ago, but at that time it<br />\nwas rained out after two innings of<br />\npi- , It was the only game scheduled<br />\nfor the Hopkins summer nine.<br />\n<br />\nvictory evened the Blue Jay's wins<br />\npost-season<br />\nand losses for the<br />\nmonths, for they suffered two defeats<br />\nfrom the University of Maryland and<br />\nwon two games, one each from Penn<br />\nState and Navy.<br />\nThe contest at Annapolis was a<br />\nrough and close one, with the game<br />\nremaining undecided until the middle of the last period. Navy scored<br />\nfirst in<br />\n<br />\nthe opening<br />\n<br />\nperiod when<br />\n<br />\nChuck Williams, dodging midfielder,<br />\nshot a goal from directly in front<br />\nof the cage.<br />\nHopkins first goal was scored by<br />\nsubstitute Jim Kuller, who was sent<br />\nin with instructions to call a time<br />\nout. Jim forgot his instructions, however, and scored on a bounce shot<br />\nfrom the left side of the crease.<br />\nIn<br />\n<br />\nsecond<br />\n<br />\nthe<br />\n<br />\nperiod, Hopkins<br />\n<br />\npressed the Blue and Gold defense<br />\nbut missed several scoring opportunities. Meanwhile, Charlie Ochenrider<br />\nscored Navy's second goal. Before<br />\nthe end of the period, however,<br />\nTommy Zink passed Navy's goalie<br />\nto tie the score at two all.<br />\nIn the third period. Navy again<br />\nBut about halfway<br />\n<br />\ntook the lead.<br />\nthrough<br />\n<br />\nthe period, Dave<br />\n<br />\nWallace<br />\n<br />\n,pass on the crease and<br />\ncaught a.<br />\nscored. Still the Black and Blue<br />\nkept hitting the posts of the goal<br />\nwith inaccurate shots and failed to<br />\ntake advantage of scoring plays.<br />\nIn the final period, however, the<br />\n<br />\nA record squad of 58 men appeared<br />\nat the first soccer practice on August<br />\n17, coach Dick Hoover announced<br />\nlast week. The new coach has expressed the hope that the large number of men with eight weeks of preseason practice will permit him to<br />\nplace a strong team on the field this<br />\n<br />\nLeaving thirteen men on base, and<br />\nallowing the opposition two unearned<br />\nruns, the Jay baseball team dropped<br />\n<br />\na 2-0 decision to Navy on August<br />\n22 in a game played on the midshipmen's home field.<br />\nPitching for the Jays was Ken<br />\nfling point was made by Tom Zink<br />\no • ielded only four hits,<br />\n_ _McIn_tosh wh...,<br />\nftre-rrotn<br />\nthe same number that the Blue team<br />\nTed<br />\nMarfrom<br />\npass<br />\nhaving caught a<br />\ngarnered off the combined efforts of<br />\nshall. Then, not content with a one- Burdett and Leahy of Navy.<br />\nThe -boys from Annapolis scored<br />\npoint victory, Henley Guild added<br />\nin the second and once in the<br />\nanother goal to make the final score once<br />\nsixth while Hopkins, with several<br />\n5-3.<br />\ngreat opportunities, was not able to<br />\nThis game was the closest one for<br />\npush across a single tally. In the<br />\nthe Hopkins team this summer, since fourth inning, the Jay team filled the<br />\nbases with but one out, and in the<br />\nthey defeated Penn State 10-6 and<br />\nninth had two on base with only one<br />\nwere smothered by Maryland 8-1 and<br />\nboth times, a rally was<br />\n8-0. Navy, was beaten by Maryland out, but<br />\nby weak hitting and excellent<br />\nhalted<br />\n9-2 and went on a scoring spree<br />\nNavy pitching.<br />\nwhen it defeated the Forest Park<br />\nPerry, Jones, Minden, and SchiffAthletic club 15-4.<br />\nner, struck the only safe blows for<br />\nMr Herman Epstein, who coached<br />\nMcIntosh struck out six<br />\nHopkins.<br />\nlast spring's junior varsity lacrosse<br />\nand walked only one man.<br />\nteam, took over Dr W Kelso Morrill's<br />\nNavy's run in the second frame<br />\nplace for the summer as varsity<br />\ncoach. The regular lineup was: Dan<br />\nGreenbaum, goal; George Riepe, captain, George Thomas, and Stan Murphy, close defense; Tom Zink, Russell Klingenmeier, and Henley Guild,<br />\nmidfield; and Ted Marshall, Dave<br />\nRained out twice in matches with<br />\nWallace, and .Sonny Fahrenholz, close<br />\ninvading Blue team pierced the Navy<br />\ndefense by scoring twice. The win-<br />\n<br />\nTennis Team<br />\nPlans Matches<br />\n<br />\ncame as Gillis reached &rat on an<br />\nerror, raced to third on another and<br />\ntallied on an infield single by Snyder.<br />\nIn the sixth it was the same story,<br />\nas Watson singled, advanced twice<br />\non two Jay errors, and scored on<br />\nMcNamara's hit to left.<br />\nThe box score:<br />\nHOPP:INS<br />\nab r<br />\n<br />\nIt<br />\n<br />\nPerry, 3b<br />\n<br />\n4 0 1<br />\n<br />\nDidusch, ss<br />\n<br />\n5 0 0<br />\n<br />\nHoffman, cf<br />\n<br />\n2 0 0<br />\n<br />\nMcIntosh, p<br />\n<br />\n3 0 0<br />\n<br />\nReid, rf<br />\n<br />\n4 0 0<br />\n<br />\nEdelen, rf.<br />\n<br />\n1 0 0<br />\n<br />\nJones, 2b<br />\n<br />\n1 0<br />\n<br />\n1Marshall<br />\n<br />\n1 0 0<br />\n<br />\nMinden, c<br />\n<br />\n1<br />\n<br />\n4 0<br />\n<br />\n1<br />\n<br />\nBarger, lb<br />\n<br />\n4 0 0<br />\n<br />\nSchiffner, If<br />\n<br />\n5 0 1<br />\n34 0 4<br />\n<br />\nTotals<br />\n<br />\n1Batted for Edelen in 8th.<br />\nNAVY<br />\nab r<br />\n<br />\nh<br />\n<br />\nMills, cf<br />\n<br />\n3 0 0<br />\n<br />\nRepolge, cf<br />\n<br />\n1_0_0<br />\n<br />\nBowler, lb<br />\n<br />\n3 0 1<br />\n<br />\nFrom, lb<br />\n<br />\n1 0 0<br />\n<br />\nthe Naval academy at Annapolis, the<br />\nBlue Jay tennis team will soon meet<br />\n<br />\nWatson, 3b<br />\n<br />\n3 1<br />\n<br />\n1<br />\n<br />\nSpiked Shoe<br />\nResumes<br />\n<br />\nlocal clubs, including Mount Wash-<br />\n<br />\nMcNamara, ss<br />\n<br />\n3 0<br />\n<br />\n1<br />\n<br />\nHinernan, rf<br />\n<br />\n3 0 0<br />\n<br />\ngames with several schools are being<br />\n<br />\nShettino, rf<br />\n<br />\n0 0 0<br />\n<br />\narranged.<br />\n<br />\nGillis, If<br />\nHiggins, If<br />\nZech, 2b<br />\nSnyder, c<br />\nBurdett, p<br />\n2Casey<br />\nLeahy, p<br />\n<br />\nington and Suhurban.<br />\n<br />\nIn addition,<br />\n<br />\nPete Stern as captain. The returning<br />\n<br />\nPresident Lou Stoll, Secretary Jack<br />\n,Siegmund, Henry Siegel, Ed Schwartz<br />\n<br />\nRosenzweig, Ernest<br />\n<br />\nand Carl Schopfer.<br />\nOnly those varsity men who have<br />\nearned their letter in track or cross<br />\n<br />\nRothman.<br />\n<br />\ncountry and who have shown unusual<br />\nare<br />\ninterest in either of these sports<br />\noreligible for membership in the<br />\nganization. •••-... ae„nipr. managers are<br />\nalso eligible for<br />\nDick<br />\nLast year, the fraternity had<br />\nhimself,<br />\nGwynn, a former track star<br />\nGwynn<br />\nas its adviser. Now that Mr<br />\nPresident<br />\nhas left the University,<br />\nclub's<br />\nLou Stoll will supervise the<br />\nactivities.<br />\nin the<br />\nThe Hopkins chapter has,<br />\ntrack<br />\npast, sponsored invitation<br />\nlocal<br />\nmeets on the campus for all<br />\nin. The<br />\nhigh schools to participate<br />\ncontinue this<br />\nfraternity hopes to<br />\npractice in the future.<br />\n<br />\nThe Hopkins netmen include eight<br />\nveterans and two newcomers, with<br />\n<br />\nmen are Stern, topscorer Larry Middlekamp, Russell Bosworth, Leonard<br />\nKaram, David<br />\n<br />\n7<br />\n.<br />\n<br />\n2<br />\n1<br />\n3<br />\n3<br />\n1<br />\n1<br />\n1<br />\n<br />\n1<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n<br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n<br />\nBrown, Hank<br />\n<br />\nWeiss, and<br />\n<br />\nDonald<br />\n<br />\nClint Redgrave and Ed<br />\n<br />\nformerly played on the championship<br />\nCity College team.<br />\n<br />\nOn the second team, the end positions will probably be filled by Bob<br />\nBarger and George Bionic. Tom<br />\nMassey and<br />\n<br />\nAbe Goetz<br />\n<br />\n29 2 4<br />\n<br />\nTotals<br />\n<br />\n2Batted for Burdett in 5th.<br />\n<br />\nwill play<br />\n<br />\ntackle, and Ken Grimm and John<br />\nPrice will occupy the guard berths.<br />\nAl Beers will play center. The backfield will include Mort Disney, Bud<br />\nConnelly, Paul Adkins, and Fred<br />\n<br />\nCompeting besides Siegmund are<br />\nLou Stoll, Henry Siegel, Tom Massey,<br />\nHarvey Weldon, Bob Lloyd, Jake<br />\nBloome, Price, Beers, Goetz and Con- Schlenger, Vince Maggio, and Woernelly are upperclassmen who have ner McKinsey. This group proved<br />\nnever played football at Hopkins be:- th be the chief point scorers in the<br />\nonly dual meet of the season against<br />\nfore. Rsrger, Grimm, Adkins, and<br />\nNavy, and in the intra-squad meets<br />\nMaxey are freshmen; Barger also<br />\nas well.<br />\nplayed first base on the baseball<br />\nIn the Navy meet, these nine were<br />\nteam.<br />\nthe only scorers. However, the Jays<br />\nCoSch Mallonee also announced<br />\nwill undoubtedly find the competition<br />\nthat about 18 men have been turned tougher the; that furnished by the<br />\nover for training to Dutch Slagle, Annapolis Midshipmen, for many loassistant coach. They are practicing cal and national stars are expected to<br />\nnew formations, mainly spreads, that be entered in the games. Besides<br />\nSlagle has originated. Alter they per- Hopkins, Navy, Stonewall, Forest<br />\nfect these new formations, they will Park, and all of the nearby army<br />\ntry them out on the varsity. Slagle camps are planning to enter teams.<br />\nformerly played at Penn State.<br />\nAmong nationally prominent trackA complete list of all candidates<br />\nmen stationed at the camps, the most<br />\nManagers;<br />\nfollows:<br />\nsquad<br />\nfor the<br />\nnotable is Barney Ewell, intercolleMax Abelman, Hank Bobrow, Ralph giate 100, 220, and broadjump chamFellows, Henry Seidel. Players: Paul pion for three years, who is stationed<br />\nAdkins, Warren Alonso, Bill Ander- at Camp Lee.<br />\nson, Stu Averill, Dick Balmert, Karl<br />\nGoing out of their class in order<br />\nBierman, Fran Bilello, Bill Blan- to find competition, the Jays visited<br />\nchard, George Biome, Leo Brozozow- the Naval academy and were vanski, George Chidester, Jerry Cohn, quished by the Middies 90 to 27. The<br />\nBud Connelly, Dave Derrow, Herb Sailors immediately took the lead by<br />\nDozier, Al Dudley, Monty Eimendorf, getting first and second in the shot<br />\nChuck Fuller, Milt Glatt, Jed Gold- put. However, they met strong opposition in all running events but the<br />\nberg, D. Greenbaum, Stanley Greenebaum, Ken Grimm, Myer Hankin, mile, and it is in these events that<br />\nKaufman, the Jays tallied 21 of their points.<br />\nHartmann, Stan<br />\nJack<br />\nGeorge Kennard, Morton M.acks, Ca- Jack Siegmund led the Hopkins scormille Marie, Tom Massey, Ted Mat- ing with eight points; Lou Stoll<br />\ntern, Fred Maxey, John Price, George scored five; Henry Siegel, four; Tom<br />\nReeder, Bob Roush, Jim Russell, War- Massey and Harvey Weldon, three<br />\nren Schaumberg, Walt Scribner, each; and Bob Lloyd, Jake $chlenDan Shientag, Earle .Silber, Milt ger, Vince Maggio, and Woerner McSommers, Bill Spivs, Jack Stewart, Kinsey, one apiece. All of these boys'<br />\nMassey and Disney are the only<br />\non the second squad.<br />\n<br />\nveterans<br />\n<br />\n.rc05,<br />\nCuller, Bob Ftiltnn, Al Beers, Alan<br />\n'Chesney, Ray Pohl, Abe Goetz, Mort<br />\nDisney, Ray Scihulnuti, Woerner McKinsey, Lou Stoll, Bob Barger, Jack<br />\nO'Farrell, Jake Schleng,, Jake Williams, Henry Siegel, and Nell Reid.<br />\n<br />\nClothes for the<br />\nCollege Mon<br />\nVISIT OUR MEN'S SHOP,<br />\n2nd Flock Boicony<br />\nHOCHSCHILD KOHN<br />\n<br />\n&<br />\n<br />\nre<br />\nin the conference competition, according to winning times registered<br />\nin past championship contests.<br />\nOf the entire squad, only Siegmund<br />\nand Stoll will be lost through graduation, but they have been the team's<br />\nleading point scorers.<br />\n<br />\nFreshmen Raise John Angell's Hopes<br />\nFor Successful Cross-Country Season<br />\n\"The<br />\n<br />\noutlook<br />\n<br />\nfor<br />\n<br />\nteam<br />\n<br />\nthe<br />\nis<br />\n<br />\nHopkins<br />\nunusually<br />\n<br />\nbright,\" John Angell, captain of the<br />\nBlue Jay squad, said on Wednesday.<br />\n\"My optimism is due to the appearance of several very promising freshmen at pre-season practice this<br />\npromise, according to Angell.<br />\nDick Hoover, in charge of the team<br />\nin the absence of Frank Wright,<br />\n'this year's coach, said that twelve<br />\ncandidates have already reported for<br />\nthe team. Angell, Phil Dunk, and<br />\nPaul Albright, three of last year's<br />\nfour lettermen, are out as are Warren<br />\nKuhn and Harvey Weldon of the<br />\ntrack team. Donald Hildenbrand,<br />\nalthough a new comer, shows some<br />\npromise according to Angell.<br />\nFrank Wright, Y secretary who<br />\n<br />\nassisted Waldo Harnbleton with the<br />\ncross-country men last year, is now<br />\ntaking full charge of the team. In<br />\nlast season's National Amateur Athletic contest, he placed second in the<br />\nsix-mile cross-country race.<br />\nThe schedule as it now stands<br />\nreads as follows:<br />\nOctober<br />\n24, Haverford college<br />\n31, Loyola college.<br />\n<br />\nSOUTHWEST<br />\n<br />\naway<br />\nhome<br />\n<br />\nNovember<br />\naway<br />\n7, Swarthmore college<br />\n_home<br />\n14, Catholic university<br />\n21, Mason-Dixon conference<br />\n<br />\nKEEP'THE CLOTHES<br />\nYOU HAVE NOW<br />\nAnd.<br />\n<br />\nTHEODORE'S BARBER SHOP<br />\nCORNEA<br />\n<br />\nST. PAUL AND 33. STREETS<br />\nNeat door to Birely's Drug Store<br />\nWE HAVE EXPERT BARBERS ONLY<br />\nNO STUDENT BARBERS<br />\neta a know you and we will<br />\nLit<br />\ngladly give credd<br />\n<br />\nBeat the War<br />\nShortage<br />\nBy the Follovilng<br />\n<br />\nHalle are the newconaere:--,Dr C F<br />\nBonilla is continuing as coach.<br />\nDue to wartime restrictions on rubber, the team is using the new Wilson \"Victory\" tennis balls. The \"Victory\" ball contains only ten per cent<br />\nof the rubber in an ordinary tennis<br />\n- „but, according to Captain<br />\n,„,,,,,%hero of the<br />\nStern and<br />\nsquad, it equals or surpasseS isrossid<br />\nones in every respect.<br />\nLast season, the Blue Jay team<br />\nwon eight out of their eleven matches.<br />\n<br />\nLed by captain Jack Siegmund,.<br />\nnine members of coach Dick Hoover's<br />\nsummer track squad are scheduled<br />\nto compete in the South Atlantic<br />\nTrack and Field tournament Saturday, September 12 at Homewood field.<br />\nThe meet will begin at 12:30 pm and<br />\nproceeds are to go to Army and<br />\nNavy relief.<br />\n<br />\nMaxey.<br />\n<br />\ncross-country<br />\n<br />\nattack.<br />\n<br />\nthe resumption of its regular activities for the coming season. The fraternity's membership consists of<br />\n<br />\nWith the exception Of Lloyd and<br />\nMaggio, all point-scoring was done<br />\nby members of last spring's squad.<br />\nThis proves that the new program<br />\nhas produced neither the quantity<br />\nnor the caliber of talented new men<br />\nthat was expected. Nevertheless, the<br />\nclndertnen certainly would have made<br />\na better showing if they had run<br />\nagainst a testa in their class. Navy<br />\nwas obviouily too strong for them.<br />\n<br />\nBuffalo, home; November 7, Susquehanna, away; November 14,<br />\nSwarthmore, home. Arrangements<br />\nare also being made for games on<br />\nOctober 17 and November 21.<br />\nCoach Mallonee has assembled a<br />\ntentative lineup on the basis of performance in practice thus far this<br />\nseason* but he emphasized the fact<br />\nthat it is much too early to say that<br />\nany position on the squad has been<br />\n<br />\nHopkins Baseball Team<br />\nDefeated by Navy 2-0<br />\n<br />\nAs the clouds of dust rose from<br />\nthe Navy track at Annapolis two<br />\nweeks ago tomorrow, a badly beaten<br />\nHopkins track team walked to the<br />\nshowers. The Sailors scored 97 points<br />\nto 27 for the Blue Jays. The Middies<br />\ntook 11 out of 13 first places, losing<br />\nonly the 440-yard run and the 220yard low hurdles to Lou Stoll and<br />\n<br />\nSchlenger.<br />\n<br />\nAt present there are four contests<br />\non the Blue Jay schedule: October<br />\n24, Haverford, away; October 31,<br />\n<br />\ndefinitely clinched.<br />\nwith the feet and the head.<br />\nWarren Alonso and Ted Mattern<br />\nReturning lettermen this year are<br />\nwill probably play ends on the first<br />\ncaptain Eddie Duggan, Pete Stern. ,<br />\nstring. Tackles will be Jack Stewart<br />\nLarry Claggett, Henry Hegerfeld,<br />\nand Warren Schaumberg. Al Dudley<br />\nMoser.<br />\nJohn Macnab, and Ludwig<br />\nwill play center, flanked by Earle<br />\nyear's<br />\nlast<br />\nof<br />\nfullback<br />\nroving<br />\nMoser,<br />\n,Silber and Dave Derrow at guard<br />\nteam, will leave a gap in the Hopkins positions. The backfield will be comdefense when he graduates in Octoposed of Jed Goldberg, Jim Russell,<br />\nber, especially since Joe Callis, the<br />\nLou Stoll and Ray Pohl. Alonso is<br />\nother first string fullback last year,<br />\ncaptain of the squad.<br />\nhas not returned.<br />\nAlonso, Goldberg, Stoll, and RusOther returning men such as Al<br />\nsell played first string last year.<br />\nBarry, Ed Cocoros, John Feldman,<br />\nand Silber<br />\nand Schaumberg, Mattern,<br />\nJim Rhinehart, Irving Feldman,<br />\nwere also on last year's squad. Dudfill<br />\nWilliam Cloud are available to<br />\nley and Stewart are transfer stuthe vacant positions. New men showLee and<br />\nHoover, dents from Washington and<br />\ning distinct possibilities, said<br />\nThis<br />\nJo- Western Maryland, respectively.<br />\nSeal,<br />\nMorgan<br />\nQuinn,<br />\nFrank<br />\nare<br />\nand<br />\nJack is the first year that Derrow<br />\nseph Feldman, Stanley Steckel,<br />\nPohl have played at Hopkins. Pohl<br />\nNadel.<br />\nLerner, Eli Birer, and Hirsh<br />\n<br />\n\"Spiked Shoe,\" the honorary track<br />\nfraternity at the Hopkins, announces<br />\n<br />\nThe Jays failed to place In the mile,<br />\ns. vaut. or the discus. The<br />\nthe<br />\nthe<br />\nHopkins took font-*Cons.<br />\nhelp of Henry Siegel, Harvey Weldon,<br />\nThe<br />\nMassey.<br />\nTom<br />\nand<br />\nSiegmund,<br />\nsingle points for third place were<br />\npicked up by Siegel, Bob Lloyd, Vince<br />\nMaggio, Woerner McKinsey, and Jake<br />\n<br />\nnow being trained under the direction -of head coach Gardner Mallonee.<br />\n<br />\nfall.<br />\nTo taite care of the large 'squad,<br />\ntwo soccer fields have been provided,<br />\nmaking it possible for four complete<br />\nteams to scrimmage at the same time.<br />\nAnother innovation this year is coach<br />\nThis<br />\nHoover's soccer-volleyball.<br />\ngame is different from volleyball<br />\ntouched<br />\nonly in that the ball is not<br />\nby the hands -arid that a soccer ball in place of a volley ball is used. It is<br />\ndesigned to teach control of the ball<br />\n<br />\nIn the Dust<br />\n<br />\nJack Siegmund.<br />\n<br />\nWith their first game over a month<br />\naway, approximately 65 candidates<br />\nfor the Hopkins football team are<br />\n<br />\nBIRELY'S PHARMACY<br />\nYour Neighborhood Drug Store<br />\nBUY AT BIRELY'S<br />\nS. W. car. St. Paul & 33rd Ste.<br />\nBaltimore, Md.<br />\nWe Deltver<br />\nPhonr University 3545<br />\n<br />\nYour Flowers Were<br />\nPurchased\"<br />\n<br />\nFlowers<br />\n\"You know the<br />\n<br />\nFOR ALL OCCASIONS<br />\n<br />\nki'Elabr<br />\nwe sell!\"<br />\n<br />\nTHE NIP HUB<br />\n\"...01 famous makesn<br />\nBALTIMORE-CHARLES-FAYETTE<br />\n<br />\nSIX SERVICES<br />\n<br />\n\"Point with Pride To Where<br />\n<br />\nI<br />\n<br />\nCleaning—Pressing<br />\nTailoring—Laundry<br />\nShoe Rebuilding<br />\nHat Blocking<br />\nAT<br />\n<br />\nUNIVERSITY VALET<br />\nSERVICE<br />\nIt's Like New- -.When We're Thru<br />\n<br />\n3113 Si. Peel St, Chesapeake 8338<br />\nLiberty 3377<br />\n3624 Laitorty Nis.<br />\nQnly<br />\n<br />\n2<br />\n<br />\nblocks from Hopkins<br />\n<br />\n425 East soft,' Street<br />\nWe Call For end Deliver<br />\n<br />\n\fHullabaloo<br />\nAppoints<br />\nEditors<br />\n<br />\nStarlight Dance Success; lyi Five Hopkins Men Candidates<br />\nAir Corps For Debating<br />\nPlans Outing for September 15 Enter<br />\nAt Maxwell Field<br />\nTalk at Dorm<br />\n<br />\nStoriight Donee<br />\nLast Friday night from 9 to 1, the<br />\nSocial and Recrentonal committee of<br />\nLevering hall, headed by Jack Hartmann, sponsored another , outdoor<br />\nIn order to prevent repetion of the<br />\ndance. The dance was held, said<br />\ntardiness of the Hullabaloo which ocHartmann, as a response to popular<br />\ncurred last year', the ,staff for this<br />\ndemand because of 'the success of<br />\nyear has appointed Daniel Greetibaum<br />\nthe recent Starlight dance.<br />\nas printing editor and Jack WeinFriday night's dance was held in<br />\nbaum as engraving editor.<br />\nfront of Levering hall. This time<br />\nToward this same purpose of pub- decorations included Chinese lanlishing the yearbook on schedule, the<br />\nterns. As before, the price of adstaff is having the bulk of the photo- missions was fifty cents per couple,<br />\nyear.<br />\nOne<br />\nthis<br />\ndone<br />\nearly<br />\ngraphy<br />\nand the couples received a twentyhundred and 'seventeen seniors were five cent defense stamp. Music was<br />\nphotographed last week, and the re- furnished by a transcription system.<br />\nmainder were taken yesterday. In- Refrrshments were served.<br />\ndividual photographs of all fraternity<br />\nCommittees for the dance were.<br />\n-Ctre-itanielline.<br />\nf—rrielf-Vere---takeff<br />\nDr• oratThreordthlftee'.-Brib -Steele:\"<br />\nGroup pictures of the large organiza- Mort Disney, Bob Wilson, Bob Fultions were also taken last week by ton, Bill Bluemle, and Jim Cantrell.<br />\nthe professional photographer in orDance Floor committee: Don Overder to insure clarity and correct ton and Glen Geyer.<br />\ngrouping.<br />\nPublicity committee: Fitz Dodson,<br />\nThe staff plans a new feature for , Paul Adkins, titd Corbin Gwaltney.<br />\nthe book this year: full page pictures<br />\nFinance committee: Ted DeBois,<br />\nof the junior, sophomore, and freshman classes. The pictures will be<br />\ntaken in the fall.<br />\nAccording to David Weiss, editor<br />\nof the Hullabaloo, the subscription<br />\nsales for this year's book have already passed those of last year. The<br />\ncomplete staff for the yearbook will<br />\nbe announced Monday.<br />\nJohn Macnab left Wednesday for<br />\nWashington where he is attending<br />\nthe International Student assembly as<br />\nofficial representative Of the Hopkins.<br />\nThe assembly, to be held at American<br />\nuniversity September 2-5, is sponsored by , the United States ComStudent<br />\nmittee of International<br />\nservice.<br />\n. Speakers . at the conference will<br />\nThe Cotillion board and the Student council met Monday to deter- include: Mrs Franklin D Roosevelt;<br />\npresident Henry A Wallace;<br />\naffairs<br />\nfor<br />\nVice<br />\nmine a schedule of ciOcial<br />\nthe coming term. The tentative Dr Hu Shih. ambassador from China;<br />\nschedule for social activities includes: Dr Louis M Hackner, of the econothe Frosh-Soph dance, Octobes, 10; .mics department of Columbia univerJunior prom, Thanksgiving weekend; sity; and Harold Butler, British<br />\nminister.<br />\nand Senior week, February.<br />\nMiss Liudmilla Pavlichencko, RusMason Myers, acting chairman of<br />\nthe Cotillion board, issued another sian guerrilla fighter, will attend the<br />\ncall for freshman canditates this conference with two companions. In<br />\n<br />\nMacna6 Attending<br />\nStudent Assembly<br />\nIn Washington<br />\n<br />\nCotillion Board,<br />\nCouncil Set<br />\nSocial Schedule -<br />\n<br />\nhad been disappointing, and emphasized the fact that all freshmen who<br />\ndo sufficient work in publicizing the<br />\ndances will be placed on the guest<br />\nlist.<br />\nThe list of freshmen candidates is<br />\nas follows: Len Kerpelman, Charles<br />\nMyers, Jim Balder, John Haacke,<br />\nWill Lair, Jon Crosby, Joseph Shapiro, and Clint Redgrave.<br />\n<br />\nAIEE Hears<br />\nRosen, Burclette<br />\nAt a meeting of the American<br />\nInstitute of Electrical Vngineering<br />\non Tuesday, September 10, Judah<br />\nBen Rosen and Jack Purdette spoke<br />\n'on the topic: Ultra-short Radio<br />\n<br />\ncan press she said, \"The only good<br />\nGerman is a dead one.\" She has<br />\nkilled 308 Germans in her career as<br />\na goerrilla fighter. Miss Pavlichencko<br />\nit 24 years old and was formerly history major at the University of Kiev.<br />\nThe International Student. service<br />\nhas solicited colleges and universities to establish scholarships for<br />\nrefugee students. The Hopkins is one<br />\nof about seventeen Such instituting<br />\nwhich have complied with :their<br />\nappeal.<br />\n<br />\nRoy Frech, and Tom Ray.<br />\nlie\"reshments committee: Stuart<br />\nAverill and Bernard Ellinghaus.<br />\nSecretary: James Keenan.<br />\n<br />\nOn Sale At The<br />\nTreasurer's 0‘t;Remsen Hall<br />\n<br />\nStormers<br />\nStage<br />\nRally<br />\n<br />\nAttacking or defending the topic,<br />\nCapitalism must go in post-war<br />\nAt their first meeting of the new<br />\nAmerica, five candidates for positions<br />\nThe Y cabinet of Levering hall is<br />\non the Hopkins Debating council season last night—it rally designed<br />\nplanning an all-day outing at Metagave five to ten mimite talks in the - particularly for Interested freshmen<br />\nrieake, Maryland, Sunday, September tion cadets.<br />\nCommons room of the dormitory last —the Barnstormers made plans for<br />\n13.<br />\ntwo one-act plays to be presented<br />\n,<br />\nCadet Leroy E Daub, of Baltimore, night.<br />\n,<br />\noutpurpose<br />\nof<br />\nthe<br />\nThe principal<br />\nwas a member of Delta Upsilon fraPlans were also made at last for the USO within the next month.<br />\ning is to discuss the purpose of LeverThe two plays, isb You Are Twentyternity and attended the University night's meeting for a future debate<br />\ning hall in campus life, to check past<br />\nFrancis on the topic Resolved: That the One, by Ludwig Thome, and Why I<br />\naccomplishments, and to plan future from 1939 to 1942. Cadet<br />\nAm<br />\nA Gentleman, by Alexander FosUnited States should unite at the<br />\nactivities. Therk will be, however, E Stultz, of Hagerstown, was enpresent time with the British Corn- ter will be presented in the Audiswimming, a picnic, and other di- rolled in the University for the same<br />\nmohwealth of Nations. It was an- torium of. USO headquarters on<br />\nversions.<br />\ntime and was a member of Kappa nounced that regular weekly meet- Charles street. Ernest Gohn will diAnyone outside the cabinet who<br />\nSerge,<br />\nof<br />\nrect the first and Eli Birer the secSigma. Cadet Paul W B<br />\nings will be resumed shortly after the<br />\nwishes to attend this affair should<br />\nreceived his A B degree beginning of the October term. Sid- ond of these productions.<br />\npatify_ the Y Q,ffice in Leveeing hall. Baltimore,<br />\nney Katz, president of the—Orga-iiizaThe ,Bitristormers are considering<br />\nThe group - will first go to Annapolis in 1934. He was a member of the<br />\ntion, again extended an invitation to several plays in an attempt to<br />\nby train and then across the Chesa- Tudor and Stuart club, . Cadets<br />\nall interested freshmen to come out choose one for their main producpeake bay on the Matapeak ferry.<br />\nThomas R Moss and Ralph N Chris- for the Council.<br />\ntion this fall. As yet, however, none<br />\nYesterday at a meeting of the cabi- tensen, both of Baltimore, left the<br />\nAt the last meeting on Monday, has been decided upon.<br />\nnet, tke future of the War council<br />\nHopkins in 1941.<br />\nAugust<br />\n10,<br />\nPeter<br />\nKerwin<br />\nand<br />\nArnold<br />\nStudents who are interested and<br />\nwas discussed and plans were made<br />\nUpon completion of their pre-flight Harberger, who took the affirmative who did not attend last night's meetfor Freshman camp for the class<br />\ntraining at Maxwell field,'these ca- side in a debate against capitalism, ing are asked to contact Gohn, the<br />\nentering in October.<br />\ndets will enter one of the primary were, defeated by Rowland Brand- president of<br />\nthe<br />\nBarnstormers,<br />\nVespers<br />\n•<br />\nflying schools in the Southeast Army 'web and Hubert Cafritz, their op- through box 324.<br />\nDr W F Albright, professor of<br />\nAir Forces Training center for the ponents on the negative, by a fiveSemitic languages, will be the speakto-four decision of the audience.<br />\nfirst phase of their pilot training.<br />\ner at the vesper service to be held<br />\nin the Lederer room of Levering hall<br />\nat 5 pm, Sunday, September 6. The<br />\nY has invited Hopkins students of<br />\nall faiths to attend these weekly services.<br />\nIn continuance of the policy of the<br />\n, Lieutenant Samuel Stockton Miles,<br />\nsummer vesper program, Dr Albright<br />\nface. Joel Ashley also turns in a USNR son of Dr L Wardlaw<br />\n(Continued from Page 2)<br />\nwill discuss his ersonal attitude toMiles,<br />\ngood<br />\njob<br />\nas<br />\nNorman<br />\nReese.<br />\nLassie<br />\nformer<br />\ncollegiate professor of Engward religion. The purpose of the great deal of credit, however, for<br />\nvespers is to give an intellectual un- extracting from the play all that its Moores, as the dim-wit Dottie Co- lish at the Hopkins, has been killed<br />\nderstanding of religion by inviting meager stream affords. They have burn, turns in an exceptionally con- in action, probably somewhere in<br />\nvincing performance.<br />\nthe Pacific war area.<br />\nvarious faculty members to present<br />\nLieutenant<br />\nplayed it for broad farce, which is<br />\nIt is a pity that such a pretty Miles was a physician<br />\ntheir views on the subject. Dr J C<br />\nand had been<br />\nway that it could girl as Margale Wilson should be asigned by the<br />\nHubbard was the speaker at the last probably the only<br />\nNavy department to<br />\nbe played without the audience leav- such a stupid 'actress. Her' nasal the Marine corps.<br />\nmeeting, August 30,<br />\ning the theater at the end of the first twanghçneates.the stage when she<br />\nHe was last known to be .serving<br />\nact. It is reported that the play, enters, and she does nothing on the in the Pacific area.<br />\nwhen on Broadway, was played to stage to make the audience forget<br />\nDr Miles who retired from the<br />\nattempt to get some sort of whim- it while she, is on. In the scene where Hopkins in May, was a<br />\ncaptain of<br />\n'<br />\n.out of it. It is seldom she is supposed to be recovering infantry in the first World<br />\nsical charm<br />\nwar. He<br />\nthat anyone writing today, except from the effects of a Mickey Finn, was decorated with the<br />\nCongresThe Alumni Records bureau an- Saroyan, succeeds with whimsy—and she drops to her greatest depths. It is sional Medal of Honor, the<br />\nhighest<br />\nnounced that since June five gradu- even Saroyan often fails. Therefore, hard to tell whether she is merely American award for bravery. He<br />\na rose to the director, Richard 0 sick or whether: she is a dope fiend. also bears war decorations<br />\nates of the University have becom<br />\nfrom<br />\nFleischer. for not trying to put some- The rest of the cast' can be dis- other<br />\nT<br />\n14.euter ant eolonels in the<br />\nis obviously missed with the adjeetiee, anstiunm<br />\nta<br />\nr tersth<br />\n;v?!<br />\n.leading his men<br />\nStates Army, and ten have become thing into the play that<br />\nOn the whole, then, this play is through wire entanglements<br />\nto atmajors. They are: Lieut COls Ed-i not there.<br />\namusing enough, and anyone looking tack and take over a<br />\nheavily deThe cast, for the most part, handle<br />\nward D Spalding, William H Skinner;<br />\nfor<br />\nrelief from the cares of the world fended enemy position.<br />\nexbe<br />\ncould<br />\nas<br />\nwell<br />\nas<br />\nK<br />\nroles<br />\nFermidge<br />\nRhodes,<br />\ntheir<br />\nGeorge H<br />\nwill probably be tempted to laugh<br />\nLieutenant Miles was a graduate<br />\nNichols, C Ridgley Howard; Majors pected. Mason Adams, a product of<br />\nat some of the lines of the play; of Princeton university, in the<br />\nclass<br />\nNelson H Rector, Frank J Maguire the Yale Drama school, is -probably<br />\nbut it is, nevertheless, an inferior of 1936, and of the Johns<br />\nwhole<br />\nthe<br />\nin<br />\nactor<br />\nHopkins<br />\njr, John H Greist, Fred W Gelb, the outstanding<br />\ncomedy.<br />\nMedical sehool, in 1940.<br />\nstage,<br />\nthe<br />\non<br />\nease<br />\nat<br />\nis<br />\nCummings,<br />\nHe<br />\nE<br />\nplay.<br />\nJohn F Fiske, Carl<br />\nThe Hilltop's production last week<br />\nAbraham G Cohen, John H Bum- and he is able. to make himself inof Philip Barry's The 'Philadelphia<br />\nstead, Charles M Baer, and Robert conspicuous when he is not engaged<br />\nStory was considerably better in its<br />\nD Moyle, RAMC. Another alumnus, in important action on the stage. He<br />\nproduction. Lyn. Swann,/ as Tracy,<br />\n. Chaplain J R Maguire, has become is greatly aided in the role by a<br />\nnaturally idiotic expression on his was good in her role afteSHrM she<br />\n- a chaplain in the Army Air corps.<br />\ngot over her Katherine Hepburn-complex which pervaded the first act.<br />\n(Continued from Page 1)<br />\nMason Adams, as Delt,• was very<br />\nThe complete dance committee is<br />\ngood even in a part which suited as follows:<br />\nhim much less than his tole in Out<br />\nSophomore officers—Ted DeEiois,<br />\npf the Frying Pan.<br />\npresident; Stu Wilcox, vice-president;<br />\n'Carol Joyce Brennan, a product Arnold<br />\nHarberger, secretary; Jed<br />\nof .the Childf•en's Educationa4 thea- Goldberg,<br />\ntreasuner; Keith Warner,<br />\none year of paid experience in the from the date of application. Ap- ter at the Hopkins, gave a very ensergeant-at-arms; Bill' McLean, Stutertaining portrayal of Tracy's im- dent council<br />\nfield, or 15-semester hours in metal- propriate war. training courses May<br />\nrepresentative.<br />\npish sister, Dinah. Marshall , Mason<br />\nlurgy, or two .war training courses be substituted for college hours in<br />\nFreshmen officers—Fred Weekes,<br />\nlechtrops<br />\n,brartelte<br />\nin metallurgy. Appli,sations<br />\nWillieident; Charles Myers, secretary; John<br />\naccepted from college seniors or<br />\nThere are no age . limits for the<br />\n• Next week the Hilltop is ending Spittel,<br />\nserieant-at-arms; Georgegraduate students who expect to com- examinations, and no written tests its season with the premiere showChidester, Student council representplete the requirements within six are required. Applications will be ing of Francis Swann's new play, ative.<br />\naccepted until needs are filled, but the It's in the Air. We sincerely hope\"<br />\nSpirit committee—Monty Elmenthat the Swann's new attempt at clod, Fitz<br />\nDodson, Don,Overton, Mort<br />\nOn August 29, the commission commission floes not want war<br />\nself-exhibition results in a better play Stussman,<br />\nClint Redgrave, and Will<br />\nissued in revised form its continu- workers to ,apply unless a change of being given, at least an equally good<br />\nLair.<br />\nously open examinations for technical position would result in the utilization production.<br />\nassistants and junior physicists. For , Of higher skills possessed by the<br />\n<br />\nMatapeake Outing<br />\n<br />\nTo<br />\n<br />\nVOL XLV]<br />\n<br />\nNo<br />\n<br />\nlist five former Hopkins students<br />\nwho have recently enlisted as avia-<br />\n<br />\nHilltop Presents Poor<br />\nBut Well Played Comedy<br />\n<br />\nAll<br />\nIn R<br />\n<br />\nThe Interf<br />\nings on Tue<br />\nthis week, r<br />\nment used<br />\ntempt to. n<br />\nand more se<br />\ntime concliti<<br />\nBecause<br />\nBoard has<br />\nvete oars<br />\nmen to- the<br />\nfreshmen; oi<br />\nfacilities mi<br />\nance with ti<br />\nhas been cl€<br />\nternities ma]<br />\nphone to see<br />\nof residence<br />\nby the rushi<br />\nOn camp<br />\nmilled until<br />\nand until 1<br />\ndefinition in<br />\nrnitories are<br />\nthe walk wh<br />\nof the dorm:<br />\nlot to the<br />\nforks at the<br />\ndormitory<br />\nMonday,<br />\nbetween 7.3<br />\nweek and t<br />\nset for rushi<br />\nAppointment<br />\ncan be mad<br />\nof the prece<br />\never they a:<br />\nbe made by<br />\nfreshmen.<br />\nIn the secc<br />\nwill. ban.* Ai<br />\n<br />\nDr Miles's Son<br />\nKilled in Action<br />\nIn Pacific Area<br />\n<br />\nHopkins Alumni<br />\nReceive Promotions<br />\n<br />\nfrom 2 to 6 I<br />\nrefreshments<br />\nSaturday nig<br />\nhold open he<br />\n<br />\nThe third I<br />\nopen houses<br />\nhouse at all<br />\nday night.<br />\nsystem will<br />\nwill take pla<br />\nher 8.<br />\n<br />\nFrosh-Sophs<br />\nTo Give Dance<br />\n<br />\nThe 'United States Civil Service<br />\ncommission has issued a call for<br />\n<br />\nCommission<br />\nThe Civil Service<br />\nemphasized the need for workers<br />\nin the occupations mentioned. Char-<br />\n<br />\nsemester hours' in physics. Seniors<br />\nexpecting to graduate within six<br />\n<br />\nacterizing the situation in regard to<br />\n1these occupations as urgent, it stated<br />\n<br />\nmonths may apply,<br />\n<br />\nIn its dispatch that everp person with<br />\nthe necessary qualifications is needed immediately, and that- each place-<br />\n<br />\nThe examination for technical as_ sisyant includes three optional<br />\nThi'anches: engineering, metallurgy,<br />\nFor the higher grade positions the<br />\nand physics. Salaries range from<br />\ninclude<br />\nnow<br />\nminimum requirements<br />\n$1400 to $1800 per year. For the<br />\ncourse<br />\nfour-year<br />\nthe completion of a<br />\n$1800 gade three years; for the<br />\nwith maior study in metallurgy or<br />\n$1600 grade two years; and for the<br />\nyears<br />\nclosely allied subjects and two<br />\n$1400 grade, one year of college<br />\n.55<br />\nof professional experiende in metalqualify<br />\n\"training ia<br />\nlurgy. 4.dditional experience is reany one oh the options in any<br />\ntee..<br />\nhigher-naeies<br />\nquirrd for the<br />\ngrade, certain requirements as to<br />\n<br />\ntionik<br />\nthe<br />\n<br />\ngrade requirements<br />\nnow are: (1) the completion of a<br />\nfour-year college course in metallurgical- engineering; or (2) completion of a four-year course in an allied subject supplemented by either<br />\njunior<br />\n<br />\nworker.<br />\n<br />\nthe position of junior physicist, paying $2000 per year, the requirements<br />\nconsists of the completion of a,fouryear college course including 18<br />\n<br />\nsional experience.<br />\n<br />\nand<br />\nSAVINGS STAMPS<br />\n<br />\nPress releases from the Public Relations office of Maxwell Field Preflight school, Montgomery, Alabama,<br />\n<br />\nCI(<br />\n<br />\n'<br />\nStorm<br />\n<br />\nCivil Service Commission Issues Requests<br />\nFor Metallurgists, Physicists in War Work<br />\n<br />\nWaves.<br />\nA demonstration using an ultra- metallurgists, physicists, and tech-wave transmitter was_glien In the<br />\nnical assistants, whp are \"urgently<br />\nsenior electrical room,. where the<br />\nneeded\" in civilian war service. Anmeeting was held. Connected to the<br />\ntransmitter wei'l '*grat of ani)ennas nouncements and application forms<br />\nwhich focused thk waves in one di- may be obtained from any first or<br />\nrection.<br />\nsecond class Post Office or from the<br />\nDuring the lecture, a flashlight Civil Service commission, Washingbulb with no connections was lit at<br />\nton, ti C.<br />\nat a distance of several feet from<br />\nThe commission began itEr recruitthe transmitter, using the power sent<br />\ning drive for metallurgists on Auout by the apparatus.<br />\nIn the course of the talk, the gust 25, when it announced two new<br />\nproperties, means of generation, ad- examinations in that field. The one<br />\nvantages and uses of ultra-short<br />\ncovers higher grade positions, which<br />\nwaves were discussed. Records were<br />\npay from $2600 to $5600 per year,<br />\nmade of the proceedings.<br />\nother is fot the junior<br />\nVisitors are invited to the regular while the<br />\nmeetings of the institute, which are grade and carries a salary pf, $2000.<br />\nheld every Tuesday at 1 p m in In both cases the requir'ements have<br />\nMaryitisid hall.<br />\nbeen modified to permit the acceptance of college teaching- as profes-<br />\n<br />\nBUY<br />\nWAR BONDS<br />\n<br />\n10MEWOOD, BALTIMORE<br />\n<br />\n_NEWS LETTER<br />\n<br />\nCAGE FOUR<br />\n<br />\nhours of study in specified subjects<br />\niust be met.<br />\nStudents may apply for the position Of technical assistant in any<br />\ngrade if they expect to finish the required courses within four months<br />\n<br />\nnjent in war industry of another<br />\nworker in one of these fields would<br />\nhave the effect of helping to redu<br />\nan important production bottleneck.<br />\nIr.<br />\nStudents in college inter../..<br />\nif they are<br />\nCivil<br />\nmenabove<br />\nthe<br />\n...ajoring in any of<br />\ntioned fields or are preparing for<br />\nclosely-allied occupations, are requested to consult with the heads of<br />\ntheir departments.<br />\nQuestions which cannot be answered either by the department heads<br />\nor by the announcements Obtainable<br />\nin first and second class post offices<br />\nshould be addressed to the Civil Service Commission, Washington, D. C.<br />\n<br />\nOn the Lodges<br />\n<br />\nGreek Relief<br />\n<br />\n,<br />\n(Continued from Page 1) saying, \"The American Government<br />\nhas been willing to associate itself<br />\nwith the arrangements (of the Greek<br />\nWar Relief4 in the confidence<br />\n(<br />\nfthat<br />\nPLEDGE BANQUET' they are feasible attempts, with adeAnother item of general fraternity<br />\nquate safeguards, to save an heroic<br />\ninterest is the coming pledge banpeople from national annihilation.'<br />\nquet. It will be given on September<br />\nGreek War Relief headquarters<br />\n9th. The Y and the interfraternity<br />\nin Baltimore are located,at 45<br />\nboard :are jointly sponsoring the af,t,94 fStro..4.<br />\nfair. The banquet is to be held foe<br />\nthe pledges, the preselecte or the<br />\n...ms et...ter/Mies, and the pledge<br />\ntrainers. If it is half as good as the<br />\npresent plans indicate, it will be a<br />\n(Continued from Page 1)<br />\ngreat success.<br />\n6 Prizes: First in each division will<br />\nPAAHTIES<br />\nreceive $5.00. Second in each diviTheATO's had their initiation bansidn will receive.a Hullabaloo.<br />\nquet last week-end. Al Wojtkelewicz<br />\nadded his bit to thet deal—a 14-pound 7 All pictures become the property<br />\nof the Hullabaloo, and can be used<br />\nbirthday cake . . . The AD's had<br />\nby,. them. If your picture is not<br />\na little sabotage to contend with last<br />\nused, you may get it at the end of<br />\nSaturday night. Their beer party was<br />\nthe October semester.<br />\non its first legs when somebody discovered that the beer was stale. Some 8 Place snapshots in official entry<br />\nwent home, others went for rum.<br />\nbox in front of Hullabaloo office.<br />\n(Continued from Page 2)•<br />\nA minority report was made at the<br />\nsame, time And is also being given<br />\nserious consideration.<br />\n<br />\nPhoto<br />\n<br />\nContest<br />\n<br />\nte,C<br />\noLs<br />\nots<br />\ne..-‘1<br />\n1 v'<br />\nstormers WI<br />\nauditorium ei<br />\nfollowing Fri<br />\n2<br />\n.<br />\nh%cr<br />\natit.<br />\nthT<br />\n.7<br />\n-<br />\n<br />\nRe,<br />\nClinton<br />\nLaura Lynci<br />\nDavid Phillt<br />\nLaura Lynch<br />\nA Bachelor,<br />\nErnest Go<br />\nstormers, is<br />\nEli Birer, Si<br />\nreeling the<br />\n<br />\n'Sun'<br />\n<br />\nd l<br />\n,Enp<br />\n0<br />\n<br />\nnote<br />\nBowman an<br />\nsuspension o<br />\nbecause of f,<br />\nand the as<br />\nconcerts cat<br />\nas<br />\nrmracnndt.)til<br />\nc<br />\ngo<br />\n<br />\nB,<br />\nFrom<br />\n<br />\npuer<br />\nsC<br />\nuS)<br />\nThe (<br />\ntion, of the<br />\nmeans the<br />\nof a commu<br />\nas far aS<br />\nThere are<br />\n,<br />\neven a gasp<br />\ntra.s, comp<<br />\nteurs; but t<br />\nEdwinuaint<br />\nlate<br />\nsum of Inc<br />\n<br />\n\f", "format": "basic_html", "processed": "Nut<br />\n•<br /><br />\nTHE JOHN* HOPKINS<br /><br />\nDRE<br />\nExams Earlier;<br />\nWeek Vacation<br />\n.. box, page<br /><br />\n1, col 4<br /><br />\nnmis-<br /><br />\niional<br /><br />\nlying<br />\nunfilled<br /><br />\niting.<br /><br />\n1 the<br /><br />\n7- , by<br /><br />\ncol-<br /><br />\nstion<br /><br />\nad to<br />\niowl- `'\\<br />\nmior<br />\ntheir<br />\nmay<br /><br />\n:nigh<br />\n, de-<br /><br />\necoand<br />\nPer;s in<br />\ntent<br />\nneed<br />\nI be<br /><br />\nin<br />\npay<br />\nTar.<br />\npersalproical,<br />\nconntal<br />\napand<br /><br />\nLodges<br />\nSchedule<br />\nBanquet<br /><br />\nBuy<br />\nUjIITED tTATES DEFINE<br /><br />\nNEWS-LETTE<br />\nHOMEWOOD,<br /><br />\nVOL XLVI, No. 2<br /><br />\nr the<br /><br />\nFOR VICTORY<br />\nBONDS • STAMPS<br /><br />\nBALTIMORE, SEPTEMBER 4, 1942<br /><br />\nStudent Council Protests<br />\nMeadowbrook Anti-Semitism<br />\nAt the last meeting of the Student<br />\ncouncil, a letter of protest to the<br />\nMeadowbrook Swimming club and<br />\nMr George Morris, its owner, was<br />\naccepted and approved,<br /><br />\nPhoto Contest<br />\nFor Hullabaloo<br />\nTo Begin Monday<br /><br />\nPrice Five Cents<br /><br />\nDraft owering Certain;<br />\nPaint r Sees College<br />\nEnrolltnent Regulated<br /><br />\n-Meadowbrook Swimming club opus<br />\nates. It pointed out that the men<br />\nA photography contest, with prizes<br />\nwho are giving their lives and seem- of $5 for the first in each division<br />\nity to fight for what they believe and a Hullabaloo for the second in<br />\nto be the right way of life, as each division, will be sponsored by<br />\nDr Sidney Painter, faculty adviser<br />\nhowever, most students would be<br />\nThe first interfraternity pledge<br />\nThe Student council protested Americans, deserve better than to be the Hullabaloo beginning Monday, on the selective service status of Hopbanquet in the history of the Hopliable to conscription before entering<br />\ndiscriminated<br />\nagainst by such an September 7.<br />\nkins students, commenting upon the as freshmen.<br />\nkins will be held Wednesday at 7 against the Meadowbrook's treatment organization.<br />\nThe purpose of this contest is to statement last Friday from War<br />\nof a United States army officer<br />\npm in the Great hall of Levering, it<br />\nThe spokesman said further that stimulate student interest in the<br />\nObviously, under these circumearli_e_rin_the...yea_.r. The officer had<br />\n,<br />\n13 Jack<br />\nManpower administrator Paul V Me-was anriOnfiCe21'last -1,71<br />\nbeen refused admission to the club' —the Cfilinca— relieved -12cg- issue to iffillabaloo. Etirryone sa've the judges rl-riff; Said on 'A*sday, \"Regardless<br />\ntiCia-Tioriii authority would have<br />\nHartmann, executive chairman of the<br />\nbe<br />\nof<br />\nimportance<br />\nto<br />\nthe<br />\ncitizens<br />\nof<br />\nand staff of the Hullabaloo may of the methods uSed and regardless to be set up -to select those candidates<br />\nbecause of his religion.<br />\naffair.<br />\nBaltimore<br />\nand<br />\nthe<br />\ncountry<br />\nat<br />\nlarge,<br />\nenter.<br />\nCampus<br />\nscenes<br />\nas<br />\nwell<br />\nas<br />\nfit<br />\nfor college.. Physicists, doctors,<br />\nNeither Mr Morris nor the Meadowof.who exercises the authority, imThe banquet is sponsored jointly<br />\nbrook club had apologized for their as well as the students of this Uni- personality shots are acceptable. A portant changes most be expected as engineers, chemists, and men in simiby the Interfraternity board and<br />\nversity.<br />\ncontestant may submit hie own pic- our nation's educational system be- lar vital occupations will be needed;<br />\naction<br />\nto<br />\ndate<br />\nor<br />\nanswered<br />\nthe<br />\npledges,<br />\nfraternity<br />\nLevering hall. All,<br />\nThe council also began workbig ture if he desires, and no maximum<br />\ncomes subject to wartime planning.\" and a supply of such men will have<br />\npledge-masters, and fraternity presi- several condemnations of them appearing in the Sun \"Forum\". There- on plans for elections of class office's has been placed upon the number<br />\nDr Painter went on to say.that a to be trained, even if they do not be'<br />\ndents have been invited.<br />\nand<br />\ncouncil<br />\nrepresentattves<br />\nunder<br />\nthe<br />\nof<br />\npictures<br />\nany<br />\nsingle<br />\nperson<br />\nmay<br />\nfore,<br />\nthe<br />\ncouncil<br />\nundertook<br />\nthe<br />\nlowering of the draft age to include come useful until after the war. The<br />\nletter<br />\nThe cost of the banquet will be 75<br />\nnew speed-up system. Dwald Roth- submit. Editor David Weiss said on the age groups or 18 and 19 is almost troublesome question, said Dr Paintcents per person. The fraternities of protest, it announced on Tuesday.<br />\nman has presented a An to the Wednesday that he hoped that as Inevitable. With this change, he add- er, is: How and by whom should these<br />\nThe council felt that since the<br />\nwill pay 25 cents of this and the inCouncil,<br />\nand they are considering<br />\nmany students as possible would ed, some definite system will be re- students be chosen? Many educators<br />\nHopkins had patronized the Meadowdividual will pay fifty cents.<br />\nbrook many times in the past for Its features. Other plans will also enter the contest, since fifteen pages quired to choose<br />\nstudents who feel themselves capable of deciding<br />\nThe program is as follows:<br />\nbe considered, and the Council hopes of this year's 'Hullabaloo are to be will be permitted to go to college. At upon who shall be enrolled, if CerInvocation: Rev George Packard of dances and parties, and since many<br />\nthrough<br />\nmodification and compromise devoted to snapshots selected from the present time,' Dr Painter said, tain liniitations are made by some<br />\nHopkins students patronize<br />\nthe<br />\nthe Epiphany Episcopal church<br />\nMeadowbrook as individuals, theyl to evolve a satisfactory system of those entered. The judges of the students do not titually become sub- sort of quota system.<br />\nSteak dinner<br />\nelections<br />\nbefotetteIncoming fresh- contest have not yet been selected. ject to the draft until their junior<br />\nhad all the more reason for taking a<br />\nThe army, conjectured Dr Painter,<br />\nToastmaster: Dr Sidney Painter<br />\nman class arrives in October.<br />\nWeiss requests<br />\napplicants to year. If the age limit were lowered, would prefer to have the control of<br />\nstand on the issue at this time.<br />\nWelcome: Lorin Stieff<br />\nAnother part of the council's work give him their names, addresses, the<br />\nThe letter, which will be printed<br />\ncollege manpower in its hands by<br />\nMusical interlude: Harold Kolmer<br />\nin a forthcoming NEWS-LETTER, con-- this last week was a joint meeting number of photographs, and the<br />\nforcing each student to join the enAddress: Dr Wilson Shaffer<br />\ndemned the principal upon which the with the Cotillion board to fix and ap- contest divisions in which they are<br />\nlisted reserve. In' that way, the army<br />\nRemarks: Mr Gardner Mallonee<br />\nprove<br />\ndates<br />\nfor<br />\nforthcoming<br />\ndances<br />\nentered.<br />\ncould induct any man thought to be<br />\nOsmar<br />\nP<br />\n'by<br />\nThe Ode: conducted<br />\nat the University. The schedule of<br />\nRULES<br />\nless useful in college than he would<br />\nSteinwald.<br />\ntentative<br />\ndates<br />\npresented<br />\nby the Co- 1 One entry blank will be required<br />\nbe in the armed service.<br />\nThe committees who have been<br />\ntillion board was approved by the<br />\nfor each division, no matter how<br />\nworking on arrangements for the<br />\nMr McNutt, on the other hand,<br />\nCouncil.<br />\nmany<br />\nphotographs<br />\nthere<br />\nare;<br />\nbut<br />\nwishes to see the control of college<br />\ndance are:<br />\nRecently, the Council held a<br />\none entry blank must accompany<br />\nenrollment<br />\nProgram committee: Abbot Shefplaced under his War<br />\nOn August 24, Blanchard Randall,<br />\norderly-conduct trial in which the<br />\neach division.<br />\nt<br />\nfier, Phi Epsilon Pi; Jim Cantrell,<br />\nsr, Baltimore btleilheas man and trus- Manpower commission. Dr Painter<br />\noffender<br />\nwas<br />\nreprimanded<br />\nfor<br />\n2 The divisions are as follows:<br />\nBeta Theta Pi; Ted Prevost; Delta<br />\ntee of the University, died in his sleep suggested that if the power were<br />\nactions at a YMCA open-air dance.<br />\n(A) Campus scenes with the camlodged here, educators would prob..'<br />\nPhi.<br />\nSt the age of 86,Years.<br />\nA mass meeting of all freshmen will<br />\npus as background and anySpeaker's committee: Lorin Stieff,<br />\nMr Randall waAa prominent figure ably be given quotas, which might<br />\nbe held by the Freshman commission<br />\nthing as a subject.<br />\nAlpha Delta Phi; Jerry Cohn, Phi<br />\nat the Hopkins, tieing a member of be narrowed down to the point of<br />\nof the YMCA immediately after<br />\n(B) Personality shots, teachers as<br />\nspecifying the number of students to<br />\nSigma Delta; Monty Elmendorf, Phi<br />\nthe Board of Troitees from 1902 to<br />\nROTC drill at 5 pm on Monday, Sepwell as students, where the<br />\ncourse.<br />\n1942. In 1930, he was elected vice- be accepted in each<br />\n.<br />\n-28t5rie\"Cot?reZa.<br />\nBob Stier- tember 7, in the Sherwood room of<br />\ncampus is not in the backpresident of the toard, and he kept<br />\nwill be in top-notch condit....<br />\nHowever, this solution might per.vering hall. At this meeting fuground or the subject.<br />\n.<br />\nthis position on,Illness forced him mit a problem which is now attainup their sticks for the Blue Jays defense ny<br />\nthe Commission will<br />\n?The print must be at least 3x4,<br />\nTau Beta Pi, national honorary.,<br />\nIn the forty ing large proportions to continna<br />\nto resign this<br />\nwhen the next regular season rolls ning point was mati<br />\n.<br />\n.,<br />\nfraternity in engine<br />\n,<br />\n,OL ta<br />\nk°S<br />\ncase the Hullabaloo wisher) to trus, ee, Mr Randall attended every that it is those students who are<br />\nWaiure ailtriarnhienrriir— trie—Or- three seniors, two juniors and t<br />\nTancecornnnttee ifirriLaoPiird,<br />\nchange the size of the print.<br />\nganization will be determined by the graduate students at an assembly<br />\nConimempration Day exercise at the financially able, and not necessarily<br />\nDelta Upsilon; Jed Goldberg, Epsilon<br />\nenthusiasm shown at the meeting for in Latrobe 120 on Tuesday, August 4 Contest ends at 4 pm, November<br />\nthose who best fulfill the mental reTau Alpha; Jack Hartman, Kappa<br />\nthe hay ride, wiener roast, and fall 27.<br />\n2, 1942.<br />\nA grain broker and financier, Mr quirements, who are accepted in colAlpha.<br />\nRichard Muller, mechanical engi- 5 Any student or employee of the<br />\nRandall was president of the Balti- leges.. Dr Painter suggested that<br />\n\"The theme of this pledge ban- Goucher mixer suggested by the<br />\nUniversity is eligible, with the<br />\nmore Chamber of Commerce and the government fellowships or. scholarquet,\" Lorin Stieff, president of the executive board. Plans will also be neer, Donald Kerber, electrical, and<br />\nexception of the judges and staff<br />\nInterfraternity board said yesterday, made for the reception into the Com- J B Rosen, electrical, are the seniors,<br />\norganization of grain dealers. An ships for needy but capable students<br />\nmission of the freshman class en- Floyd Culler, chemical engineer, and<br />\nof<br />\nthe<br />\nHullabaloo.<br />\nthe<br />\ngrasp<br />\nmay<br />\nmen<br />\n.<br />\nHopkins<br />\nactive member in the Protestant are not unlikely in the near future.<br />\n\"is 'that<br />\ntering in October. ,<br />\n(Continued on Page 4, Col. 6)<br />\nFrank Shanty are the juniors. The<br />\nEpiscopal church, he was also treashigher meaning of \"fraternity,\" and<br />\nHe went on to discuss the reserve<br />\nClintoh Redgrave, chairman of the two civil engineering graduate stuurer of the Maryland Diocese. corps plans of the army, navy, and<br />\nthat; true \"fraternity\" may flourish<br />\nCommission,<br />\nstated<br />\nin<br />\na<br />\nnotice<br />\neur<br />\nto<br />\nall<br />\ndents tapped are Walter Boyer and<br />\nThrough be never ran for an office, air forces with reference to Mr Mcamong the brotherhoods at this,<br />\nfreshmen, \"The executive board urges<br />\nMarlin Zimmerman was presented<br />\nMr Randall took 'part in Maryland Nutt's statement. Those who are<br />\nuniversity.\"<br />\nFinal examinations for the<br />\nyou to attend this, short meeting so with a copy of Handbook of Physics<br />\npolitics, having attended several Re- in these corps at present can probJune term have been advanced<br />\nthat we May clarify the functions and Chemistry as an award from the<br />\npublican national conventions. He e)* expect to graduate before they<br />\none week; and will be held from<br />\nand objectives of the Commission.\"<br />\nfraternity for being the outstanding<br />\nwas a director of three banks and will be inducted. However, if the<br />\nSeptember 28 to October 2, thus<br />\nThe group's last activity was a freshman engineer last year.<br />\none of the founders of the Baltimore draft age should be lowered, some<br />\npermitting a one-week's vacaswimming party at Lakewood pool on<br />\nRosen is a member of Phi Epsilon<br />\nMuseum of Art. Although he retired limitation will have to be made on<br />\ntion between semester, Dean<br />\nThursday, August 20. Horace Sieg- Pi and associate editor of the Hullafrom business eight or nine years the number of men permitted to enBerry<br />\nannounced<br />\nin<br />\na<br />\nbulletin<br />\nler, program chairman, reported it baloo. Culler is a member of Kappa<br />\nago, he remained on many -boards roll.<br />\n?<br />\nposted this morning.<br />\nsuccessful in spite of a small attend- Alpha, and Zimmerman is a member<br />\nuntil illness forced him to resign<br />\nSince the army can use its men<br />\nance.<br />\nof Beta Theta Pi.<br />\nimmediately, Dr Painter said, it is<br />\nthis<br />\nyear.<br />\nBeta circle of Omicron Delta<br />\nlikely to accept in its reserve corps<br />\nKappa, national honorary activities<br />\n.<br />\nOnly those most vital to the war ef<br />\nsociety, tapped ,four seniors at an<br />\nfort, such as fore-medigineerassembly in Latrobe 120 on Tuesday,<br />\n—<br />\ning, and scientific students.<br />\nAugust 27, at 12.30 pm. Donald<br />\nThe navy and afr corps, on the<br />\nRothman, 'Corbin Gwaltney, Dallas<br />\nother hand, only maintain a pool of<br />\nHoadley, and Mike Callas are the<br />\n\" manpower, so that officers will be<br />\nmen tapped.<br />\navailable when ships and planes now<br />\nRothman is vice president of<br />\nnational Youth director of RWR,<br />\nStudents interested in helping the by any means which will not result in Production are completed. ThereRussian War Relief<br />\nStudent council, feature editor of the<br />\nRussian War Relief is planning to reported on what the young people Junior division of the Russian War in aid to the Axis powers.\"<br />\nfore, the men under the navy and air<br />\n'NEWS-LETTER, and a member of the<br />\nhold a pageant and dance on Septem- of America are doing for Russian Relief should apply for detailed<br />\nThe Department of State has re- corps plans need not be studying for<br />\nwar council, Barnstormers, Hullabainformation<br />\nto<br />\nRWR<br />\nheadquarters,<br />\nber 10 at the Fifth Regiment armory, relief. Officers were' elected and a<br />\nceived reports from its own repre- vital occupations in order to enroll.<br />\nloo, tennis team, debating council,<br />\n411 North Charles street, Vernon sentatives abroad and from the Swiss Dr Painter said that enlistment unit was announced this Week kry Miss board of fifteen volunteers was<br />\nand the senior week committee,<br />\n6851.<br />\nrepresentatives of the International der one of these two plans might be<br />\nGwaltney is editor of the Freshman Lillian Gordon, Iliairman of the formed; working committees were<br />\nRed- Cross committee in 'charge of the means by which certain nonhandbook and News, vice president Junior division of the organization set up. The conference was closed Greek War Relitf<br />\ntechincal students' would be permitted<br />\nby the unanimous acceptance of a<br />\nDr David M Robinson, professor the distribution of supplies sent to<br />\nof the YMCA, and leader of Freshman in Baltimore.<br />\nuntil graduresolution to send greetings of en- of archaeology, has accepted the Greece, Mr Welles said, \"These re- to continue their studies<br />\ncamp.<br />\nHopkins Members of the division<br />\nation.<br />\ncadet major of the include 'Elmer Eisner, Leo 'Diesencl- couragenient and admiration to the position as chairman Of the campus ports, satisfy the Department that'<br />\nHoadley i<br />\ndisROTC, president of Scabbard and ruck, and Mayo Greenberg, physics Russian youth.<br />\ncommittee for Greek War Relief, it the food has been effectively<br />\nThe group's firht project was a was announced by Dr Emile Malakis, tributed through the 'organization of<br />\nBlade, president of Officer's club, instructors; and Abraham Seidenchairman of Senior week, and mem- berg, math instructor. Sponsors will Tag day held .on August 28 and '29 chairmen of the Baltimore drive. Dr the International Red Cross committee and consumed by the Greek<br />\nber of the baseball team.<br />\nbe: Dr Leon Sachs, former instructor as part of the present RATI2 cam- Malakis and Dr Panos Morphopoulos,<br />\npeople themselves. The reports of<br />\nCallas is president of AICE, presi- in political science at the Hopkins; paign for funds. Returns from street both of the Romance Languages dehowever, that<br />\ndent of Tau Beta Pi, and adjutant Carlton Harrison, director of the solicitations made on those days are partment, are serving on the com- these officials indicate,<br />\nalthough these supplies have unThe annual frosh-soph dance will<br />\nmittee.<br />\nin the ROTC.<br />\nBaltimore YMCA; Gustav Bisgyer, expected to total $2000.<br />\nquestionably<br />\nsaved<br />\nmany<br />\npersona be held early in December at the<br />\nMiss Gordon said, \"The eyes of<br />\ndirector of the YMIa; Dean Dorothy<br />\nThe relief organization- plans to<br />\n. in- Southern hotel, it was ahnounced this<br />\ndeath,<br />\nthey<br />\nhave<br />\nbeen<br />\nfrom<br />\nStimson of Goucher College; Rever- the whole world today are turned open a .drive on September 20 to<br />\nMiss Irene Davis, registrar,<br />\nadequate to prevent further deterior- week by Ted DeBois, president,of the<br />\nend Arrowsmith of the Pro-Cathedral; to the Russian front. All know well raise funds for the transporting to<br />\ntold a NEWS LETTER reporter on<br />\nThe Townsmen<br />\nation of the general food supply sophomore -class.<br />\nand Dr Hans Froelteher, headmaster by now, after witnessing more than Greece of breadstuffs given by the<br />\nWednesday that students who<br />\nsituation<br />\nin that country.\"<br />\nhave been signed to furnish the<br />\na year of her stubborn resistance, Canadian government. This money<br />\nof the Park school.<br />\nare called into active service<br />\nnot yet been<br />\nprice<br />\nhas<br />\nmusic.<br />\nThe<br />\nIn *order to enable aid to be give\";<br />\nThe Baltimore youth division of the significance of her role in the will also be used to purchase and<br />\nmay resume their college courto the Greeks, the British and determined,<br />\nworld-wide battle against Axis domi- send medical supplies.<br />\nmeetorganized<br />\nat<br />\na<br />\nwas<br />\nthe<br />\nRWR<br />\nthe<br />\nHopkins<br />\nat<br />\nthe<br />\nend<br />\nof<br />\nses at<br />\nDeBois and Fred Weekes, freshman<br />\nThe Greek War Relief has received American governments have waived<br />\ning called on August 19 at the YMCA. nation. But a nation cannot fight<br />\nthe war. Their credits will be<br />\nthe class president, are acting as exRepresentatives from twenty organ- the Nazi military machine, as Russia a letter from Summer Welles, acting the embargo on breadstuffs; and<br />\ncarried over provided they return<br />\nhave given as- ecutive chairmen of the dance.<br />\nizations attended the meeting which has, without paying its toll; and Secretary of State, assuring them Axis governments<br />\nwithin a reasonable time, after<br />\nfeatured a description of a six-month Russia has not only fought well but, that 'the tragic situation in Greece surances regarding safe-conduct for Assisting them are the freshman and<br />\nthe peace.<br />\nShould a student<br />\nvessels<br />\ninvolvsd<br />\nand<br />\nregarding the sophomore class officers and Student<br />\nconvpy trip to Murmansk by Mr paid dearly. It is therefore the most has been a matter of serious concern<br />\nbe called in the middle of a<br />\nEd Dos-land, a member of the mer- pressing duty of her Allies to<br />\n,see to this Government, which has been conditions for the disposal of the council representatives. DeBois and<br />\nsemester, he will probably be<br />\nWeekes also have appointed a spirit<br />\nchant marine. Dr Vlaimir Razake- not (inly that she continues to fight endeavoring, in association with the imports and the use Of native Greek<br />\ndeferred until the end of the<br />\ncommittee of four sophomores and<br />\nvitch of ColuMbia university address- but also to relieve the burden At British and Greek Governments, to produce by the Greek people.<br />\nsemester, Miss Davis said.<br />\nMr<br />\nWelles<br />\nconcluded<br />\nhis<br />\nletter<br />\nby<br />\ntwo freShmen.<br />\ned the group on the role of Russia her sacrifice as much as humanly arrange for the extension of effective<br />\n(Continued on Page- 4, Col d)<br />\n(Continued on Page 4, Col 6)<br />\nin thil war; and Miss Joy Hume, possible.\"<br />\nrelief to the starving Greek people<br /><br />\nBlanchard, Randall,<br />\nHopkins 'trustee,<br />\nDies in Sleep<br /><br />\nFh<br />\nres men To Plan<br />\nFuture Activities<br />\nAt Mass Meeting<br /><br />\nTau Beta Pi<br /><br />\nTaps Seven Atlen<br /><br />\nFlash ...<br /><br />\nODK Inducts<br /><br />\nActivity Leaders<br />\nIn Assembly<br /><br />\nRussian and Greek War Reliefs Open Drives For Funds;<br />\nMalakis Appoints Robinson Campus Chairman for Greeks<br /><br />\nDeBois Announces<br /><br />\nFrosh-Soph Dance<br /><br />\nTHE JOhNS HOPKINS<br /><br />\nNEWS-LETTER<br />\nFounded 1897<br />\n$2.00<br />\nSubseratglon per year<br />\n82.50<br />\nBy Mail<br />\nRemit subscription feet to Treasurer, Student Activities Council,<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second class matter, December 3, 1909, at the .postoffice<br />\nin Baltimore, Md., under the Act of Congress, March 3, 1879.<br />\nPublished weekly front October to June, except during examination<br />\nand college holiday lwriods by undergraduates of the Johns Hopkins<br />\nUniversity.<br />\nBOARD OPCONTROL<br />\nThinald kleniltig<br />\nJames Applegase<br />\na.,......<br />\nLeo Flashman,<br />\nDon Rothman —<br />\nEd Schwartz .......<br />\nAlan Abelman<br />\nEarl Usdin<br /><br />\n___,_____<br />\n.<br /><br />\nEditor-in•Chief<br />\nNows Editor<br />\n.<br />\nMake-up Editor<br />\nFeature Editor<br />\nSport, Editor<br />\n—Bneinest Manager<br />\nAdvertising Manager<br /><br />\nSTAFFEDITORS<br /><br />\n•<br />\nCopy Editor<br />\nExchange Editor<br /><br />\nAlfred<br />\nCarl Schopfer<br /><br />\n_ .....,_ ... _<br />\n, REPORTERS<br />\n-— Maxwell Abelmao, Marvin Adelson, Atom Berman, Russell DinerErnest<br />\nstem, Jerome Cohn, Ted DeBois, ritz Dodson, Milton Glatt, RosenzGohn, Arnold Haiberger, Bill Himberg, Charles Jules, Leonard<br />\nweig, Seymour Rubin, ,Alan Schwartzman, Henry Seidel, Henry Siegel,<br />\nBill Smith, Jack Weinbaum.<br />\nBUSINESS STAFF<br />\nAlan Abelrnan<br />\nEarl Usdin<br />\nBernard Ellinghaus<br /><br />\n, 10MEWOOD, tsALTIMORE<br /><br />\n-NEWS—LETTER<br /><br />\nPAGE T\\A/0<br /><br />\nDraken Manager<br />\nAdvertising Manager<br />\nArrmastiog Manager<br />\nMelville Magid*, Iry Woloeb<br /><br />\nReprctented for National Advertising by<br />\nNATIONAL Megan.. Smits, Inc.<br />\n420 Madison Avenue; New York City, New York<br /><br />\nFRIDAY, SEPTEMBER 4, 1942<br />\nOne would think it a stupid platitude to announce<br />\nShadows<br />\nthat we are at war. Evidently, however, the MeadowAnd Mockeries? brook Swimming club and<br />\nits executive, George R Morris, if they are at all aware of the fact, are not aware<br />\nof some of the most fundamental ideals connected with<br />\nthe prosecution of the war:At would -be ridiculous to<br />\nsupport any delusions that the war is being fought entirely on the basis of a conflict of ideals; but it is also<br />\nerroneous to ignore the existence of idealistic principles<br />\nin the minds of the people.<br />\nThe principle involved is the anti-Semitism which<br />\nwas one of the earliest offenses charged against the<br />\nHitler regime. It is also one of the fundamental principles of the New Order as expressed in Hitler's Mein<br />\nKampf. It is rather frightening to see ,t} attitude given<br />\ninch blatant x ression in this country 'as it has be<br />\ngiven in the recent 'incident at Meadowbrook. The\" act<br />\nthat the Jewish man who was refused admittance was<br />\nan army officer is important only in that it makes the<br />\nparadox more obvious. That a man who is fighting<br />\nagainst the forces of anti-Semitism should meet it in<br />\nhis own country is a readily observed contradiction.<br />\nIt is comme able that the Student council has taken<br />\nenough interest n the affaii to make its opinions known<br />\nto the manage4ut of the offending establishment. The<br />\nincident is sn,fill, but its ramifications are vast and<br />\nthreatening. 1 is gratifying to know that the Council<br />\nis doing what t can to keep the ideals of the war from<br />\nbecoming mer shadows of actuality and mockeries for<br />\nthe annals of future generations.<br /><br />\nReaffirmation<br /><br />\nThcr last issue of the<br />\nNEWS-LETTER discussell the<br />\nphysical education program<br /><br />\nOn the Lodges<br /><br />\nof the Hopkins in the new<br />\nAnd Retraction<br />\nlight thrown upon it by Mr<br />\nLoos' death. Our editorial<br />\nmade two points: the crude irrelevance of saying that<br />\nLoos would have been dead in a year anyhow; and the<br />\nright of the students to expect that tests of fitness to<br />\ntake part in the sports program would be reconsidered.<br />\nBoth points seem as valid now as then. The implication that the department had saved Loos much suffering, and indeed had done him a favor, sounds no<br />\nbetter with the passage of time. Moreover, the adequacy<br />\nof physical examinations at the Hopkins still deserves<br />\nto be reexamined.<br />\nHowever, this second point needs clarifying, and the<br />\nNEWS-LETTER is happy to point out two respects in<br />\nwhich the editorial was unfair._<br />\nOn the one hand, it drew from Dr Shaffer's statement the conclusion that he was entirely satisfied with,<br />\nif not complacent over, the physical examinations now<br />\ngiven. We submit that this was a reasonable inference,<br />\nbut we are glad to say that is is a mistaken one. Even<br />\nnow, the physical education department is considering<br />\nchanges meant to improve the University's tests of fit.<br />\nness. Of course, the nature of the changes cannot be<br />\nrevealed; but Dr Shaffer cannot be accused of complacency.<br />\nOn the other hand, the editorial greatly underestimated the costs of a complete clinical examination. They<br />\nmight very well run to from eight to ten times the<br />\nmedical fees now charged at the University.<br /><br />\nBy Lorin Stieff<br />\nFor the second time within a year,<br />\nthe lodges are again confronted with<br />\nthe problem—What to do with incoming freshman?<br /><br />\nAs usual, the<br /><br />\nproposed solutions run from deferred<br />\nrushing to condensed rushing period<br />\nof only a few<br />\ning<br /><br />\nevery<br /><br />\nweeks, with rush-<br /><br />\nnight.<br /><br />\nEach<br /><br />\nplan<br /><br />\npre-<br /><br />\nsents an almost perfect solution for<br />\none or possibly two of the many<br />\ndifficulties that are encountered in<br />\nrushing.<br /><br />\nUnfortunately,<br /><br />\nhowever,<br /><br />\nmany of the remaining phases of the<br /><br />\nThe Saturday Evening question are either neglected comPost article on inflation, pletely or met ineffectually.<br />\nThe Campus and<br />\nNevertheless, we will not be as unInvisible Greenbacks by<br />\nprepared in October as we were in<br />\nMr Scherman's<br />\nHarry Scherman, has been<br />\nJune, since much has been learned<br />\nGreenbacks<br />\nwidely publicized and often from the rushing<br />\nexperiences of the<br />\nreprinted. The Reader's early summer. Perhaps the most imDigest has digested it, and Mr Scherman's own Book- portant lesson was that it was imof-the-Month club has published it in pamphlet form possible to compete against the 4-6<br />\nc:<br />\nfor issue to its members.<br />\npm gym classes. Then too, the utter<br />\nThe article merits review, however, if only to en- confusion of Levering hall during<br />\nlunch hour was not the best place to<br />\ncourage others to read it who have not been influenced meet freshmen for<br />\nthe first time. In<br />\n,<br />\nto do so by its constant repetition. In very simple terms an attempt to counteract these two<br />\nwhich anyone, particularly any college student, should major objections, night rushing was<br />\nbe able to understand readily, Mr Scherrnan expiainsi introduced in the second and fourth<br />\nweeks<br />\nokra,<br />\n-A4--hsAi\"\"abw<br />\nti:Idiitrt-eraui'argyan-Z:eoterat-iighicondition known as inflation. The \"cure\" which he sug- rushing is the ease and efficiency with<br />\nwhich<br />\ncontact<br />\nmay be established begests is, of course, mainly the extensive purchase of<br />\nwar bonds and savings stamps. Posters, cartoons, tween a rather bewildered group of<br /><br />\nWelles,Surpasses'Kane'<br />\nWith Ostrich Era Drama<br />\npicture, an who is the only mercury<br />\nBy Amos TAYLOR<br />\nThe Magnificent Ambersons ought player retained in The Magnificent<br />\nscenery<br />\nto be seen twice, once for the<br />\nAmbersons. The finest acting is proand once for the story. Orson Welles<br />\nvided by Agnes Moorehead as the<br />\nhas written and directed an overcomplicated but, on the whole, skill- half-crazed aunt, whose performance<br />\nful screen adaptation of Booth Tark- is a superb and subtly shaded piece<br />\nington's 1919 Pulitzer prizewinner, of acting, except in several scenes<br />\nLike its predecessor, Citizen Kane, its where she becomes overwrought, a<br />\naction takes place in amazingly de- fault due to the direction. Tim Holt,<br />\ntailed and gloomily lighted sets, and<br />\nas George Amberson Minifer, is a<br />\nthe acting is pitched on the same<br />\ncarbon copy of Welles himself, but<br />\nkey of passionate, brooding melan- without the director's command of<br />\ncholy.<br />\nnuance and timing. Dolores Costello<br />\nThe splendiferous tribe of Amber- is excellent as George's mother, and<br />\nsons (\"Uncle Jack is a Congressman<br />\nAnne Baxter is pretty and dimply a9<br />\n—the Ambersons always like to<br />\nMorgan's daughter. The acting, howhave someone in Congress\") is the ever, is generally on a lower plane<br />\nenormously wealthy family domithan that of Citizen Kane, and has<br />\nnating a small American town of the<br />\nbeen synthesized by Welles into the<br />\n1870's. Their mansion, built during peculiar sort of highly condensed and<br />\nthe ostrich period of American archi- morbid mood which to him is evitecture, is an overflowing museum of dently drama. The result is an overeverything ugly and ridiculous, but intensification of emotion on the<br />\ndeemed elegant when our grand- part of the individual actors that beparents were young. A strong reason comes almost urrbearable, and that<br />\nfor seeing the picture from the- be- brought a number of laughs from the<br />\nginning is simply to get used to the audience in which the reviewer sat.<br />\nastonishing interior of this house beThe Ambersons is superior to Kane<br />\nfore the action of the story becomes in the presentation of its plot, which<br />\ntoo important to allow for distracis straightforward and avoids , the<br />\ntions. For the story becomes intense flashbacks and confusing duplication<br />\nand gripping with the kind of drama<br />\nof episodes in the former picture.<br />\nonly Welles knows how to produce—<br />\nFurthermore Welles has recovered<br />\na circumstance, when all is said and<br />\nfrom his first druriken realization<br />\ndone, for which Hollywood can be<br />\nthat the camera can be made to gaze<br />\nthankful. The attention .of the piceffectively at ceilings and actors'<br />\nture is concentrated largely upon<br />\nfeet; the photography is beautiful<br />\nyoung George Minifer, the spoiled<br />\nand unusually impressive without<br />\nand unstable Amberson heir, whose<br />\nbeing eccentric. As in Kane, the<br />\nraging Oedipus complex prevents his<br />\nmakeup of the aging characters is too<br />\nmother, a widow, from seeing a<br />\nobvious for the intimacy of screen<br />\nformer suitor who is renewing his atcloseups. Certain characters, such as<br />\ntentions. Morgan, the former suitor,<br />\nthe old Colonel Amberson, appear<br />\nis the inventor and manufacturer of<br />\ntoo briefly to make more than a<br />\nan automobile which is changing the<br />\nfleeting impression; this is due to<br />\neconomy of the town and gradually<br />\nIntense condensation of a complex<br />\nruining the Ambersons; in addition<br />\nplot.<br />\nhe is the widower father of the girl<br />\nIn spite of the obvious faults of<br />\nyoung George is in love with. The<br />\nCitizen Kane and The Mr,aniftcient<br />\nsituation is obviously complicated,<br />\nAn bas sons ..Qn.) • '<br />\nand it isn't simplified by the in'<br />\nduction of numerow<br />\ning George's<br />\n5.9<br />\nsittraus-ireviffXI<br /><br />\nat<br /><br />\non the inventor.<br />\nThe largest role, that of Morgan,<br />\nis *done well by Joseph Cotten, who<br />\nwill be remembered as Kane's dramatic-critic buddy in the former<br /><br />\nfreshmen and the fraternity system<br />\nat Hopkins.<br />\nThe disadvantages of night rushThis is in direct opposition to one<br />\nsuch as \"Buy a Stamp and Slap a Jap\" designed to ing are so obvious that they hardly of the major purposes of the rushing<br />\nexcite the country into purchasing these securities. \"Ten- need mention, yet they are often agreement; that is, to equalize the<br />\noverlooked when the subject is unPercenter\" obligatory notes and wage deductions are der discussion. One of the principal rushing opportunities of all the fraternities on the campus.<br />\nbeing promoted—designed to impress the country into problems confronting the committee<br />\nIf only street cars are used, howpurchasing them. Mr Scherman's calm and straight- at present redrafting the rushing ever, it will be very difficult for some<br />\nforward explahations of why these purchases—in great code is the inclusion of night rush- of the fraternities to cover the whole<br />\ning.<br />\nfreshman class in the time allowed,<br />\namounts—are vital and indispensable seems to be the<br />\nBefore a final decision is made, since it is expected that the October<br />\nmost intelligently effective and eloquent propaganda one consequence of this method enrollment will be at<br />\nleast as heavy<br />\nof all. It gives the excuse for the posters and slogans; should be carefully considered: cars as that of June.<br />\nshould<br />\nnot<br />\nbe<br />\nused,<br />\nfor<br />\nit<br />\nis<br />\nan<br />\nunFor those who favor some other<br />\nwithout it the rabble-rousing techniques seem exagWith Thomas E Dewey<br />\njustified waste of both tires and gas. form of rushing, the problem will be<br />\ngerated and insulting.<br />\nFurthermore, if the use of cars were simplified by the elimination in Octoand Dean Alfange as inter.<br />\nMr Scherman's plea for continued and increased sanctioned, the rushing ability of a ber of -the ' 4-6 prri freshman gym<br />\nested spectators, John J<br />\npurchase of war bonds and stamps brings occasion for fraternity would depend to a great classes. This has been accomplished<br />\nBennett has been nominated<br />\nintrospection as to how 'much the Hopkins campus has extent on the number of cars avail- by a plan requiring the lapse :of a<br />\nfor governor of New York<br />\nable.<br />\nday between the two lab lieriods of<br />\n-contributinges records<br />\n,the Treasurer's<br />\n-k.P4,.<br />\n-oriV -subjeet.-account<br />\nof<br />\nour<br />\nresponse.<br />\noffice<br />\ngive<br />\na<br />\nvery<br />\nunsatisfactory<br />\nA preliminary report on the 1942<br />\nident Roosevelt. Precisely what this means, no one is<br />\nagreement was subMitted,<br />\nrushing<br />\nthis<br />\nwar.<br />\nWe<br />\nare<br />\nof<br />\nthe<br />\nage<br />\nwhich<br />\nmust<br />\nfight<br />\nWe<br />\nsure; but the editorial writers are all agreed that it<br />\nto the interfraternity board last<br />\nage which must support itself among postmeans something. Since most of them have entered into are of the<br />\nWednesday. It is as follows:<br />\nwar conditions. We should be of the age which is most<br />\nFirst week<br />\nfretful wedlock with the administration for the course<br />\nthe<br />\nto<br />\naccelerate<br />\neverything<br />\nit<br />\ncan<br />\nKnown or unknown to most stuinterested<br />\nin<br />\ndoing<br />\nMr<br />\nRushing will be carried on two<br />\ncriticize<br />\nto<br />\nchance<br />\nthe<br />\nof<br />\nglad<br />\nof the war, they are<br />\nconditions dents at the Hopkins, many of the nights of the week between the hours<br />\nRoosevelt without suing for divorce. They are saying victory and to prepare for the best possible<br />\nfaculty are,, now engaged in vital of 7:30 pm and 10:30 pm; and on<br />\nafter the peace.<br />\nthat the president neglected the war to play politics,<br />\nwar work in Washington. In a Sunday afternoon from 2 pm to 5<br />\nseries of articles from time to time, pm. The interfraternity ball will be<br />\nand got his fingers properly burnt.<br />\nA week ago the Y held the NEWS-LETTER will present thumb- held on the Saturday night of this<br />\nThey are also saying, in. their chilliest and most<br />\na second under-the-stars nail sketches of a few of these men week. Only fraternity men will be<br />\nscornful tones, that the leader of a democracy at war<br />\nadmitted.<br />\ndance. As with the first, the and their activities.<br />\nshould not engage in politics. This is meant to be a<br />\nAiding the war effort as execu- Second week<br />\nreasonable,<br />\nprice<br />\nwas<br />\nto<br />\nbe<br />\ncoming<br />\nof<br />\nvirtue<br />\nsepreme<br />\nhas<br />\nthe<br />\nit<br />\nformula,<br />\nand<br />\nmoral<br />\nRushing will be carried on for<br />\ntives with the Office of Price Adminand half of this was return- istration are Dr Roy J Bullock, Dr three nights of the week and on Sunglibly to the lips and falling plausibly on the ears.<br />\nafternoon during the hours speciday<br />\nLloyd<br />\nG<br />\nReynolds,<br />\nMr<br />\nReynold<br />\nE<br />\ned<br />\nin<br />\nthe<br />\nform<br />\nof<br />\na<br />\nwartwaddleIt also has, what is less desirable, a high<br />\nfied in the first week. All fraternities<br />\nCarlson, and Dr John A Loftus.<br />\ncontent. First, the formula assumes that `politics' is savings stamp. Since the campus sales of stamps have<br />\nwill<br />\nhold open house on Saturday<br />\nDr Bullock, associate professor in<br />\nwicked, and that politicians have no social function. never been more than a trickle, the Y deserves credit for political economy. and director of ths night between the hours 8:30 pm and<br />\nschool of business economics, is now 1:30 am, during which time-the freshAnd second, it assumes that an American president is bolstering them in this thoroughly painless way.<br />\nBut the other half of the admission charge went to serving as an associate price execu- men will circulate among all the<br />\nfaithless to democracy when he tries to pick a nominee<br />\ntive in the chemicals branch of OPA. houses.<br />\nthe Hopkins War council, and here there are reservations.<br />\nfor senator or governor.<br />\nDr Reynolds, another associate pro- Third week<br />\npolifind.<br />\nIf<br />\nto<br />\nhard<br />\nFormed<br />\nearly<br />\nlast<br />\nspring,<br />\nthe<br />\ncouncil<br />\nhas thus far been fessor in political economy, is now the<br />\nShallower thinking would be<br />\nRushing will be carried on for three<br />\ntics is wicked, the basis of democratic decision is a frank disappointment to its own members and to the regional price executive in the Bal- nights of the week and on Sunday<br />\nafternoon during the hours specified<br />\nthe<br />\nDuring<br />\nof<br />\nOPA.<br />\ntimore<br />\n.oftlee<br />\nwicked, and we had best come to terms with the enemy. Hopkins in general. Nevertheless, until the first of the Y<br />\nmonth, he was on loan to Paul in the first week. All fraternities<br />\ndances, the council lacked funds, and had the right to hist<br />\nThey have got rid of politics.<br />\nV McNutt's War Manpower com- will hold open house on Saturday<br />\nask<br />\nhow<br />\nit<br />\ncould<br />\nfunction<br />\nwithout<br />\nthem.<br />\nnight during the specified hours.<br />\nquicker<br />\nway<br />\nof<br />\ntaken<br />\nthe<br />\neasier,<br />\nhave<br />\nTheir leaders<br />\nmission.<br />\nMr Carlson, an instructor in polit- Fourth week<br />\nruling, the way of force. If we would get free of pouges, '• Now it does have them. And the time has come for<br />\nFinal open house week as usual<br />\nical economy, is now serving with<br />\nthis is the alternative. It is certainly mote-'economical the council itself to answer a question, the question of<br />\nthe 'central office of OPA in Wash- 8:30 am to A am.<br />\nof the president's time and energy, which could be what it proposes to do with these funds and with its own ington.<br />\nNote: At'any time during the first<br />\ngiven outitrely to the direct task of winning the war. energies. If the council will draw up a specific program<br />\nDr Loftus, who was temporarily three weeks, an afternoon open house<br />\nmay<br />\nbe inserted for each fraternity<br />\nBut we should also have yielded on the issue over for the immediate present, it will do away with regrets appointed to take over some of the between the hours 4 pm and 6 pm (on<br />\nwork of Mr Carlson and Dr Reynolds,<br />\nlost.<br />\nwhich the war is being fought. The time to fear for for the time already<br />\nhas resigned from the staff of the a weekday only) if it is agreed upon<br />\nFurther delay cannot be justified if the council wants, University. Like Mr Carlson, he As by the intertraternity board.<br />\ndemocracy is the day a president scorns to play poli(continued -on Page 4, Col 5)<br />\nwith the Washington office of OPA.<br />\nwhat it ought to have, the respect of the campus.<br />\nGentlemen of tle press, relax.<br />\nmovies, radio, and newspapers are deluging the country<br /><br />\nwith pictures of the Minute man and catchy phrases<br /><br />\nFretful Wedlock,<br />\nShallow Thinking .<br /><br />\nThe Hopkins<br />\nIn Washington<br /><br />\nThe Refinanced<br />\nWar Council<br /><br />\ntics.<br /><br />\nboth creative and highly ski ed<br />\nthe art of entertaining, they substitute originality for formula, acting<br />\nfor smirking, and drama for hokum.<br /><br />\nHilltop Presents<br />\nPoor Comedy,<br />\nWell Played<br />\nBy ERNEST GOHN<br />\nThis weeks production at the Hilltop theater, Out of the Frying Pan,<br />\nIs a play which might be a great deal<br />\nfunnier than it really is if it had<br />\nmore of that mark of good comedy,<br />\noriginality. The plot is commonplace<br />\n—young people trying to make good<br />\nin New /ork and, after a series of<br />\ntrials, finally succeeding.<br />\nA play cannot be condemned, however, merely because it has an old,<br />\nwell-worn plot as the, basis of its<br />\n'existence. Shakespeare's plots are<br />\ncertainly stupid inough.1 The essence<br />\nof a good comedy is usually to be<br />\nfound in witty lines, or in amusing<br />\nsituations, or even in plain old slapstick; Out of the Frying Pan has all<br />\nthese characteristics, but yet it fails<br />\nto corne up to the standard set by<br />\nthe gieat comedies—mainly because<br />\nIt is such old stuff and because it<br />\nlacks the brilliance and charni of<br />\nthe lines in a good comedy.<br />\nThis is not to say that there is a<br />\nlack of funny lines in the play. There<br />\nare plenty of 'them. These funny<br />\nlines arrive, however, from no particular source in the incident; and<br />\nthey appear, consequently, to be<br />\nmerely stuck in by the author, Francis Swann, because they are funny.<br />\nIn addition, most of these lineo arise<br />\nout of reference to something that is<br />\noff-color. This is no .objection to<br />\nsmutty lines in comedy: it is an objection to smutty lines that are used<br />\nbecause they are smutty and because<br />\nthe author is playing to the knowledge that most people will laugh<br />\nat a dirty line whether it is really<br />\nhumorous or not. The situations in<br />\nthe play, while they provoke laughter,<br />\nare also afflicted with the burden<br />\nof<br />\nbeing old. ,So the bathtub runs over<br />\ninto the apartment below—so what?<br />\nThus the Hillti.,'s production of<br />\nthis play is handicapped before<br />\nit<br />\never gets started. Even Helen<br />\nHayes<br />\nwill fall in a bad play.<br />\nThis semiprofessional company deserves a<br />\nt(Continued on Page 4, C,91 5)<br /><br />\nN EWS-t E TI E R<br /><br />\nHOMEWOOD, BALTIMOR<br /><br />\nBlues ,<br />\nOff<br />\nBy<br />\nEDS<br /><br />\nParade<br /><br />\nPAGE THRPr<br /><br />\nv<br /><br />\nRecord Squad. Tentative Line-up for Fpotball Track Team<br />\nLacrosse Team Out<br />\nfor _sz)cce% Chosen From Sixty-live Men<br />\nDefeats Navy At First<br />\nTo Contest<br />\nPractic<br />\nIn Final Game<br />\nIn Tourney<br /><br />\nGuess Who!!!<br /><br />\nThe Johns Hopkins lacrosse team<br />\nclosed its first summer season two<br /><br />\n\"KuIler, g'wan in there for Klingenmeier 'n call time out.\"<br /><br />\nweeks ago with a 5 to 3 win over the<br />\nUnited States Naval academy. This<br /><br />\nJim KuIler trots across the lacrosse<br />\nfield and replaces Russ Klingenmeier.<br />\nSomeone shoots him a pass before he<br />\nhas`7a chance to call time and zing,<br />\nanother goal is scored for Hopkins. An angry, sparkling-eyed little<br />\nman jumps up from the bench: \"—<br />\nhim; I told him to call time out.\"<br />\nThat goal was one of the two which<br />\nbeat Navy 5 to 3.<br />\n• • •<br />\nThat game concluded the Hopkins<br />\nsummer lacrosse season, giving the<br />\nstickmen a .500 average. They defeated Penn State and Navy and lost<br />\nto Maryland twice. Two wins, two<br />\ndefeats—the poorest record registered<br />\nby a Hopkins lacrosse team in many<br />\nyears.<br />\nBut this was not a regular lacrosse<br />\nseastm. Coach Epstein didn't have<br />\nthe time or the material to whip up<br />\na first class ball team. He had to<br />\ncontend with the loss of the entire<br />\ndefense of the spring team and a<br />\ngood many other men besides. In<br />\ntheir stead, he had to groom Jayvee<br />\nmaterial, varsity substitutes, and<br />\nnewcomers.<br />\nDuring this post-season period, the<br />\nemphasis was placed upon exercise<br />\nand body-building for the entire<br />\nsquad rather than simply upon winning games and giving only the stars<br />\na chance to play. This has all been<br />\nin line with the new athletic program,<br />\nand although only half the scheduled<br />\ngames were won, the squad Worked<br />\nout regularly and the majority of<br />\nthe candidates saw action—if not in<br />\ngames, at least in scrimmages. With<br />\ncontinued physical training throughout the course of the year, these men<br />\nwill be in top-notch condition to pick<br />\nup their sticks for the Blue Jays<br />\nwhen the next regular season rolls<br /><br />\nErrors Spell Defeat<br />\nTwo unearned runs by Navy in the<br />\nsecond and sixth innings sent the<br />\nHopkins nine down to an undeserved<br />\ndefeat. The Blue Jays bunched a<br />\npair of errors together in each of<br />\nthese innings to account for the two<br />\nNavy tallies.<br />\nKen' McIntosh went the route for<br />\nthe Jays allowing only four hits.<br />\nThe Hopkins team got four hits also,<br />\nbut they were unable to capitalize on<br />\nthem. Two Hopkins scoring threats<br />\nwere thwarted as the Jays filled the<br />\nbases in the fourth with one out, and<br />\nput two on in the ninth with one<br />\nout, but failed to bring a man in on<br />\neither occasion.<br />\nNavy, too, registered four errors,<br />\nbut the margin of victory lies in the<br />\nfact that Hopkins left 13 men on<br />\nthe bases against only four men<br />\nstranded for Navy.<br />\nThis game was scheduled for several weeks ago, but at that time it<br />\nwas rained out after two innings of<br />\npi- , It was the only game scheduled<br />\nfor the Hopkins summer nine.<br /><br />\nvictory evened the Blue Jay's wins<br />\npost-season<br />\nand losses for the<br />\nmonths, for they suffered two defeats<br />\nfrom the University of Maryland and<br />\nwon two games, one each from Penn<br />\nState and Navy.<br />\nThe contest at Annapolis was a<br />\nrough and close one, with the game<br />\nremaining undecided until the middle of the last period. Navy scored<br />\nfirst in<br /><br />\nthe opening<br /><br />\nperiod when<br /><br />\nChuck Williams, dodging midfielder,<br />\nshot a goal from directly in front<br />\nof the cage.<br />\nHopkins first goal was scored by<br />\nsubstitute Jim Kuller, who was sent<br />\nin with instructions to call a time<br />\nout. Jim forgot his instructions, however, and scored on a bounce shot<br />\nfrom the left side of the crease.<br />\nIn<br /><br />\nsecond<br /><br />\nthe<br /><br />\nperiod, Hopkins<br /><br />\npressed the Blue and Gold defense<br />\nbut missed several scoring opportunities. Meanwhile, Charlie Ochenrider<br />\nscored Navy's second goal. Before<br />\nthe end of the period, however,<br />\nTommy Zink passed Navy's goalie<br />\nto tie the score at two all.<br />\nIn the third period. Navy again<br />\nBut about halfway<br /><br />\ntook the lead.<br />\nthrough<br /><br />\nthe period, Dave<br /><br />\nWallace<br /><br />\n,pass on the crease and<br />\ncaught a.<br />\nscored. Still the Black and Blue<br />\nkept hitting the posts of the goal<br />\nwith inaccurate shots and failed to<br />\ntake advantage of scoring plays.<br />\nIn the final period, however, the<br /><br />\nA record squad of 58 men appeared<br />\nat the first soccer practice on August<br />\n17, coach Dick Hoover announced<br />\nlast week. The new coach has expressed the hope that the large number of men with eight weeks of preseason practice will permit him to<br />\nplace a strong team on the field this<br /><br />\nLeaving thirteen men on base, and<br />\nallowing the opposition two unearned<br />\nruns, the Jay baseball team dropped<br /><br />\na 2-0 decision to Navy on August<br />\n22 in a game played on the midshipmen's home field.<br />\nPitching for the Jays was Ken<br />\nfling point was made by Tom Zink<br />\no • ielded only four hits,<br />\n_ _McIn_tosh wh...,<br />\nftre-rrotn<br />\nthe same number that the Blue team<br />\nTed<br />\nMarfrom<br />\npass<br />\nhaving caught a<br />\ngarnered off the combined efforts of<br />\nshall. Then, not content with a one- Burdett and Leahy of Navy.<br />\nThe -boys from Annapolis scored<br />\npoint victory, Henley Guild added<br />\nin the second and once in the<br />\nanother goal to make the final score once<br />\nsixth while Hopkins, with several<br />\n5-3.<br />\ngreat opportunities, was not able to<br />\nThis game was the closest one for<br />\npush across a single tally. In the<br />\nthe Hopkins team this summer, since fourth inning, the Jay team filled the<br />\nbases with but one out, and in the<br />\nthey defeated Penn State 10-6 and<br />\nninth had two on base with only one<br />\nwere smothered by Maryland 8-1 and<br />\nboth times, a rally was<br />\n8-0. Navy, was beaten by Maryland out, but<br />\nby weak hitting and excellent<br />\nhalted<br />\n9-2 and went on a scoring spree<br />\nNavy pitching.<br />\nwhen it defeated the Forest Park<br />\nPerry, Jones, Minden, and SchiffAthletic club 15-4.<br />\nner, struck the only safe blows for<br />\nMr Herman Epstein, who coached<br />\nMcIntosh struck out six<br />\nHopkins.<br />\nlast spring's junior varsity lacrosse<br />\nand walked only one man.<br />\nteam, took over Dr W Kelso Morrill's<br />\nNavy's run in the second frame<br />\nplace for the summer as varsity<br />\ncoach. The regular lineup was: Dan<br />\nGreenbaum, goal; George Riepe, captain, George Thomas, and Stan Murphy, close defense; Tom Zink, Russell Klingenmeier, and Henley Guild,<br />\nmidfield; and Ted Marshall, Dave<br />\nRained out twice in matches with<br />\nWallace, and .Sonny Fahrenholz, close<br />\ninvading Blue team pierced the Navy<br />\ndefense by scoring twice. The win-<br /><br />\nTennis Team<br />\nPlans Matches<br /><br />\ncame as Gillis reached &amp;rat on an<br />\nerror, raced to third on another and<br />\ntallied on an infield single by Snyder.<br />\nIn the sixth it was the same story,<br />\nas Watson singled, advanced twice<br />\non two Jay errors, and scored on<br />\nMcNamara's hit to left.<br />\nThe box score:<br />\nHOPP:INS<br />\nab r<br /><br />\nIt<br /><br />\nPerry, 3b<br /><br />\n4 0 1<br /><br />\nDidusch, ss<br /><br />\n5 0 0<br /><br />\nHoffman, cf<br /><br />\n2 0 0<br /><br />\nMcIntosh, p<br /><br />\n3 0 0<br /><br />\nReid, rf<br /><br />\n4 0 0<br /><br />\nEdelen, rf.<br /><br />\n1 0 0<br /><br />\nJones, 2b<br /><br />\n1 0<br /><br />\n1Marshall<br /><br />\n1 0 0<br /><br />\nMinden, c<br /><br />\n1<br /><br />\n4 0<br /><br />\n1<br /><br />\nBarger, lb<br /><br />\n4 0 0<br /><br />\nSchiffner, If<br /><br />\n5 0 1<br />\n34 0 4<br /><br />\nTotals<br /><br />\n1Batted for Edelen in 8th.<br />\nNAVY<br />\nab r<br /><br />\nh<br /><br />\nMills, cf<br /><br />\n3 0 0<br /><br />\nRepolge, cf<br /><br />\n1_0_0<br /><br />\nBowler, lb<br /><br />\n3 0 1<br /><br />\nFrom, lb<br /><br />\n1 0 0<br /><br />\nthe Naval academy at Annapolis, the<br />\nBlue Jay tennis team will soon meet<br /><br />\nWatson, 3b<br /><br />\n3 1<br /><br />\n1<br /><br />\nSpiked Shoe<br />\nResumes<br /><br />\nlocal clubs, including Mount Wash-<br /><br />\nMcNamara, ss<br /><br />\n3 0<br /><br />\n1<br /><br />\nHinernan, rf<br /><br />\n3 0 0<br /><br />\ngames with several schools are being<br /><br />\nShettino, rf<br /><br />\n0 0 0<br /><br />\narranged.<br /><br />\nGillis, If<br />\nHiggins, If<br />\nZech, 2b<br />\nSnyder, c<br />\nBurdett, p<br />\n2Casey<br />\nLeahy, p<br /><br />\nington and Suhurban.<br /><br />\nIn addition,<br /><br />\nPete Stern as captain. The returning<br /><br />\nPresident Lou Stoll, Secretary Jack<br />\n,Siegmund, Henry Siegel, Ed Schwartz<br /><br />\nRosenzweig, Ernest<br /><br />\nand Carl Schopfer.<br />\nOnly those varsity men who have<br />\nearned their letter in track or cross<br /><br />\nRothman.<br /><br />\ncountry and who have shown unusual<br />\nare<br />\ninterest in either of these sports<br />\noreligible for membership in the<br />\nganization. •••-... ae„nipr. managers are<br />\nalso eligible for<br />\nDick<br />\nLast year, the fraternity had<br />\nhimself,<br />\nGwynn, a former track star<br />\nGwynn<br />\nas its adviser. Now that Mr<br />\nPresident<br />\nhas left the University,<br />\nclub's<br />\nLou Stoll will supervise the<br />\nactivities.<br />\nin the<br />\nThe Hopkins chapter has,<br />\ntrack<br />\npast, sponsored invitation<br />\nlocal<br />\nmeets on the campus for all<br />\nin. The<br />\nhigh schools to participate<br />\ncontinue this<br />\nfraternity hopes to<br />\npractice in the future.<br /><br />\nThe Hopkins netmen include eight<br />\nveterans and two newcomers, with<br /><br />\nmen are Stern, topscorer Larry Middlekamp, Russell Bosworth, Leonard<br />\nKaram, David<br /><br />\n7<br />\n.<br /><br />\n2<br />\n1<br />\n3<br />\n3<br />\n1<br />\n1<br />\n1<br /><br />\n1<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br /><br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br /><br />\nBrown, Hank<br /><br />\nWeiss, and<br /><br />\nDonald<br /><br />\nClint Redgrave and Ed<br /><br />\nformerly played on the championship<br />\nCity College team.<br /><br />\nOn the second team, the end positions will probably be filled by Bob<br />\nBarger and George Bionic. Tom<br />\nMassey and<br /><br />\nAbe Goetz<br /><br />\n29 2 4<br /><br />\nTotals<br /><br />\n2Batted for Burdett in 5th.<br /><br />\nwill play<br /><br />\ntackle, and Ken Grimm and John<br />\nPrice will occupy the guard berths.<br />\nAl Beers will play center. The backfield will include Mort Disney, Bud<br />\nConnelly, Paul Adkins, and Fred<br /><br />\nCompeting besides Siegmund are<br />\nLou Stoll, Henry Siegel, Tom Massey,<br />\nHarvey Weldon, Bob Lloyd, Jake<br />\nBloome, Price, Beers, Goetz and Con- Schlenger, Vince Maggio, and Woernelly are upperclassmen who have ner McKinsey. This group proved<br />\nnever played football at Hopkins be:- th be the chief point scorers in the<br />\nonly dual meet of the season against<br />\nfore. Rsrger, Grimm, Adkins, and<br />\nNavy, and in the intra-squad meets<br />\nMaxey are freshmen; Barger also<br />\nas well.<br />\nplayed first base on the baseball<br />\nIn the Navy meet, these nine were<br />\nteam.<br />\nthe only scorers. However, the Jays<br />\nCoSch Mallonee also announced<br />\nwill undoubtedly find the competition<br />\nthat about 18 men have been turned tougher the; that furnished by the<br />\nover for training to Dutch Slagle, Annapolis Midshipmen, for many loassistant coach. They are practicing cal and national stars are expected to<br />\nnew formations, mainly spreads, that be entered in the games. Besides<br />\nSlagle has originated. Alter they per- Hopkins, Navy, Stonewall, Forest<br />\nfect these new formations, they will Park, and all of the nearby army<br />\ntry them out on the varsity. Slagle camps are planning to enter teams.<br />\nformerly played at Penn State.<br />\nAmong nationally prominent trackA complete list of all candidates<br />\nmen stationed at the camps, the most<br />\nManagers;<br />\nfollows:<br />\nsquad<br />\nfor the<br />\nnotable is Barney Ewell, intercolleMax Abelman, Hank Bobrow, Ralph giate 100, 220, and broadjump chamFellows, Henry Seidel. Players: Paul pion for three years, who is stationed<br />\nAdkins, Warren Alonso, Bill Ander- at Camp Lee.<br />\nson, Stu Averill, Dick Balmert, Karl<br />\nGoing out of their class in order<br />\nBierman, Fran Bilello, Bill Blan- to find competition, the Jays visited<br />\nchard, George Biome, Leo Brozozow- the Naval academy and were vanski, George Chidester, Jerry Cohn, quished by the Middies 90 to 27. The<br />\nBud Connelly, Dave Derrow, Herb Sailors immediately took the lead by<br />\nDozier, Al Dudley, Monty Eimendorf, getting first and second in the shot<br />\nChuck Fuller, Milt Glatt, Jed Gold- put. However, they met strong opposition in all running events but the<br />\nberg, D. Greenbaum, Stanley Greenebaum, Ken Grimm, Myer Hankin, mile, and it is in these events that<br />\nKaufman, the Jays tallied 21 of their points.<br />\nHartmann, Stan<br />\nJack<br />\nGeorge Kennard, Morton M.acks, Ca- Jack Siegmund led the Hopkins scormille Marie, Tom Massey, Ted Mat- ing with eight points; Lou Stoll<br />\ntern, Fred Maxey, John Price, George scored five; Henry Siegel, four; Tom<br />\nReeder, Bob Roush, Jim Russell, War- Massey and Harvey Weldon, three<br />\nren Schaumberg, Walt Scribner, each; and Bob Lloyd, Jake $chlenDan Shientag, Earle .Silber, Milt ger, Vince Maggio, and Woerner McSommers, Bill Spivs, Jack Stewart, Kinsey, one apiece. All of these boys'<br />\nMassey and Disney are the only<br />\non the second squad.<br /><br />\nveterans<br /><br />\n.rc05,<br />\nCuller, Bob Ftiltnn, Al Beers, Alan<br />\n'Chesney, Ray Pohl, Abe Goetz, Mort<br />\nDisney, Ray Scihulnuti, Woerner McKinsey, Lou Stoll, Bob Barger, Jack<br />\nO'Farrell, Jake Schleng,, Jake Williams, Henry Siegel, and Nell Reid.<br /><br />\nClothes for the<br />\nCollege Mon<br />\nVISIT OUR MEN'S SHOP,<br />\n2nd Flock Boicony<br />\nHOCHSCHILD KOHN<br /><br />\n&amp;<br /><br />\nre<br />\nin the conference competition, according to winning times registered<br />\nin past championship contests.<br />\nOf the entire squad, only Siegmund<br />\nand Stoll will be lost through graduation, but they have been the team's<br />\nleading point scorers.<br /><br />\nFreshmen Raise John Angell's Hopes<br />\nFor Successful Cross-Country Season<br />\n\"The<br /><br />\noutlook<br /><br />\nfor<br /><br />\nteam<br /><br />\nthe<br />\nis<br /><br />\nHopkins<br />\nunusually<br /><br />\nbright,\" John Angell, captain of the<br />\nBlue Jay squad, said on Wednesday.<br />\n\"My optimism is due to the appearance of several very promising freshmen at pre-season practice this<br />\npromise, according to Angell.<br />\nDick Hoover, in charge of the team<br />\nin the absence of Frank Wright,<br />\n'this year's coach, said that twelve<br />\ncandidates have already reported for<br />\nthe team. Angell, Phil Dunk, and<br />\nPaul Albright, three of last year's<br />\nfour lettermen, are out as are Warren<br />\nKuhn and Harvey Weldon of the<br />\ntrack team. Donald Hildenbrand,<br />\nalthough a new comer, shows some<br />\npromise according to Angell.<br />\nFrank Wright, Y secretary who<br /><br />\nassisted Waldo Harnbleton with the<br />\ncross-country men last year, is now<br />\ntaking full charge of the team. In<br />\nlast season's National Amateur Athletic contest, he placed second in the<br />\nsix-mile cross-country race.<br />\nThe schedule as it now stands<br />\nreads as follows:<br />\nOctober<br />\n24, Haverford college<br />\n31, Loyola college.<br /><br />\nSOUTHWEST<br /><br />\naway<br />\nhome<br /><br />\nNovember<br />\naway<br />\n7, Swarthmore college<br />\n_home<br />\n14, Catholic university<br />\n21, Mason-Dixon conference<br /><br />\nKEEP'THE CLOTHES<br />\nYOU HAVE NOW<br />\nAnd.<br /><br />\nTHEODORE'S BARBER SHOP<br />\nCORNEA<br /><br />\nST. PAUL AND 33. STREETS<br />\nNeat door to Birely's Drug Store<br />\nWE HAVE EXPERT BARBERS ONLY<br />\nNO STUDENT BARBERS<br />\neta a know you and we will<br />\nLit<br />\ngladly give credd<br /><br />\nBeat the War<br />\nShortage<br />\nBy the Follovilng<br /><br />\nHalle are the newconaere:--,Dr C F<br />\nBonilla is continuing as coach.<br />\nDue to wartime restrictions on rubber, the team is using the new Wilson \"Victory\" tennis balls. The \"Victory\" ball contains only ten per cent<br />\nof the rubber in an ordinary tennis<br />\n- „but, according to Captain<br />\n,„,,,,,%hero of the<br />\nStern and<br />\nsquad, it equals or surpasseS isrossid<br />\nones in every respect.<br />\nLast season, the Blue Jay team<br />\nwon eight out of their eleven matches.<br /><br />\nLed by captain Jack Siegmund,.<br />\nnine members of coach Dick Hoover's<br />\nsummer track squad are scheduled<br />\nto compete in the South Atlantic<br />\nTrack and Field tournament Saturday, September 12 at Homewood field.<br />\nThe meet will begin at 12:30 pm and<br />\nproceeds are to go to Army and<br />\nNavy relief.<br /><br />\nMaxey.<br /><br />\ncross-country<br /><br />\nattack.<br /><br />\nthe resumption of its regular activities for the coming season. The fraternity's membership consists of<br /><br />\nWith the exception Of Lloyd and<br />\nMaggio, all point-scoring was done<br />\nby members of last spring's squad.<br />\nThis proves that the new program<br />\nhas produced neither the quantity<br />\nnor the caliber of talented new men<br />\nthat was expected. Nevertheless, the<br />\nclndertnen certainly would have made<br />\na better showing if they had run<br />\nagainst a testa in their class. Navy<br />\nwas obviouily too strong for them.<br /><br />\nBuffalo, home; November 7, Susquehanna, away; November 14,<br />\nSwarthmore, home. Arrangements<br />\nare also being made for games on<br />\nOctober 17 and November 21.<br />\nCoach Mallonee has assembled a<br />\ntentative lineup on the basis of performance in practice thus far this<br />\nseason* but he emphasized the fact<br />\nthat it is much too early to say that<br />\nany position on the squad has been<br /><br />\nHopkins Baseball Team<br />\nDefeated by Navy 2-0<br /><br />\nAs the clouds of dust rose from<br />\nthe Navy track at Annapolis two<br />\nweeks ago tomorrow, a badly beaten<br />\nHopkins track team walked to the<br />\nshowers. The Sailors scored 97 points<br />\nto 27 for the Blue Jays. The Middies<br />\ntook 11 out of 13 first places, losing<br />\nonly the 440-yard run and the 220yard low hurdles to Lou Stoll and<br /><br />\nSchlenger.<br /><br />\nAt present there are four contests<br />\non the Blue Jay schedule: October<br />\n24, Haverford, away; October 31,<br /><br />\ndefinitely clinched.<br />\nwith the feet and the head.<br />\nWarren Alonso and Ted Mattern<br />\nReturning lettermen this year are<br />\nwill probably play ends on the first<br />\ncaptain Eddie Duggan, Pete Stern. ,<br />\nstring. Tackles will be Jack Stewart<br />\nLarry Claggett, Henry Hegerfeld,<br />\nand Warren Schaumberg. Al Dudley<br />\nMoser.<br />\nJohn Macnab, and Ludwig<br />\nwill play center, flanked by Earle<br />\nyear's<br />\nlast<br />\nof<br />\nfullback<br />\nroving<br />\nMoser,<br />\n,Silber and Dave Derrow at guard<br />\nteam, will leave a gap in the Hopkins positions. The backfield will be comdefense when he graduates in Octoposed of Jed Goldberg, Jim Russell,<br />\nber, especially since Joe Callis, the<br />\nLou Stoll and Ray Pohl. Alonso is<br />\nother first string fullback last year,<br />\ncaptain of the squad.<br />\nhas not returned.<br />\nAlonso, Goldberg, Stoll, and RusOther returning men such as Al<br />\nsell played first string last year.<br />\nBarry, Ed Cocoros, John Feldman,<br />\nand Silber<br />\nand Schaumberg, Mattern,<br />\nJim Rhinehart, Irving Feldman,<br />\nwere also on last year's squad. Dudfill<br />\nWilliam Cloud are available to<br />\nley and Stewart are transfer stuthe vacant positions. New men showLee and<br />\nHoover, dents from Washington and<br />\ning distinct possibilities, said<br />\nThis<br />\nJo- Western Maryland, respectively.<br />\nSeal,<br />\nMorgan<br />\nQuinn,<br />\nFrank<br />\nare<br />\nand<br />\nJack is the first year that Derrow<br />\nseph Feldman, Stanley Steckel,<br />\nPohl have played at Hopkins. Pohl<br />\nNadel.<br />\nLerner, Eli Birer, and Hirsh<br /><br />\n\"Spiked Shoe,\" the honorary track<br />\nfraternity at the Hopkins, announces<br /><br />\nThe Jays failed to place In the mile,<br />\ns. vaut. or the discus. The<br />\nthe<br />\nthe<br />\nHopkins took font-*Cons.<br />\nhelp of Henry Siegel, Harvey Weldon,<br />\nThe<br />\nMassey.<br />\nTom<br />\nand<br />\nSiegmund,<br />\nsingle points for third place were<br />\npicked up by Siegel, Bob Lloyd, Vince<br />\nMaggio, Woerner McKinsey, and Jake<br /><br />\nnow being trained under the direction -of head coach Gardner Mallonee.<br /><br />\nfall.<br />\nTo taite care of the large 'squad,<br />\ntwo soccer fields have been provided,<br />\nmaking it possible for four complete<br />\nteams to scrimmage at the same time.<br />\nAnother innovation this year is coach<br />\nThis<br />\nHoover's soccer-volleyball.<br />\ngame is different from volleyball<br />\ntouched<br />\nonly in that the ball is not<br />\nby the hands -arid that a soccer ball in place of a volley ball is used. It is<br />\ndesigned to teach control of the ball<br /><br />\nIn the Dust<br /><br />\nJack Siegmund.<br /><br />\nWith their first game over a month<br />\naway, approximately 65 candidates<br />\nfor the Hopkins football team are<br /><br />\nBIRELY'S PHARMACY<br />\nYour Neighborhood Drug Store<br />\nBUY AT BIRELY'S<br />\nS. W. car. St. Paul &amp; 33rd Ste.<br />\nBaltimore, Md.<br />\nWe Deltver<br />\nPhonr University 3545<br /><br />\nYour Flowers Were<br />\nPurchased\"<br /><br />\nFlowers<br />\n\"You know the<br /><br />\nFOR ALL OCCASIONS<br /><br />\nki'Elabr<br />\nwe sell!\"<br /><br />\nTHE NIP HUB<br />\n\"...01 famous makesn<br />\nBALTIMORE-CHARLES-FAYETTE<br /><br />\nSIX SERVICES<br /><br />\n\"Point with Pride To Where<br /><br />\nI<br /><br />\nCleaning—Pressing<br />\nTailoring—Laundry<br />\nShoe Rebuilding<br />\nHat Blocking<br />\nAT<br /><br />\nUNIVERSITY VALET<br />\nSERVICE<br />\nIt's Like New- -.When We're Thru<br /><br />\n3113 Si. Peel St, Chesapeake 8338<br />\nLiberty 3377<br />\n3624 Laitorty Nis.<br />\nQnly<br /><br />\n2<br /><br />\nblocks from Hopkins<br /><br />\n425 East soft,' Street<br />\nWe Call For end Deliver<br /><br />\nHullabaloo<br />\nAppoints<br />\nEditors<br /><br />\nStarlight Dance Success; lyi Five Hopkins Men Candidates<br />\nAir Corps For Debating<br />\nPlans Outing for September 15 Enter<br />\nAt Maxwell Field<br />\nTalk at Dorm<br /><br />\nStoriight Donee<br />\nLast Friday night from 9 to 1, the<br />\nSocial and Recrentonal committee of<br />\nLevering hall, headed by Jack Hartmann, sponsored another , outdoor<br />\nIn order to prevent repetion of the<br />\ndance. The dance was held, said<br />\ntardiness of the Hullabaloo which ocHartmann, as a response to popular<br />\ncurred last year', the ,staff for this<br />\ndemand because of 'the success of<br />\nyear has appointed Daniel Greetibaum<br />\nthe recent Starlight dance.<br />\nas printing editor and Jack WeinFriday night's dance was held in<br />\nbaum as engraving editor.<br />\nfront of Levering hall. This time<br />\nToward this same purpose of pub- decorations included Chinese lanlishing the yearbook on schedule, the<br />\nterns. As before, the price of adstaff is having the bulk of the photo- missions was fifty cents per couple,<br />\nyear.<br />\nOne<br />\nthis<br />\ndone<br />\nearly<br />\ngraphy<br />\nand the couples received a twentyhundred and 'seventeen seniors were five cent defense stamp. Music was<br />\nphotographed last week, and the re- furnished by a transcription system.<br />\nmainder were taken yesterday. In- Refrrshments were served.<br />\ndividual photographs of all fraternity<br />\nCommittees for the dance were.<br />\n-Ctre-itanielline.<br />\nf—rrielf-Vere---takeff<br />\nDr• oratThreordthlftee'.-Brib -Steele:\"<br />\nGroup pictures of the large organiza- Mort Disney, Bob Wilson, Bob Fultions were also taken last week by ton, Bill Bluemle, and Jim Cantrell.<br />\nthe professional photographer in orDance Floor committee: Don Overder to insure clarity and correct ton and Glen Geyer.<br />\ngrouping.<br />\nPublicity committee: Fitz Dodson,<br />\nThe staff plans a new feature for , Paul Adkins, titd Corbin Gwaltney.<br />\nthe book this year: full page pictures<br />\nFinance committee: Ted DeBois,<br />\nof the junior, sophomore, and freshman classes. The pictures will be<br />\ntaken in the fall.<br />\nAccording to David Weiss, editor<br />\nof the Hullabaloo, the subscription<br />\nsales for this year's book have already passed those of last year. The<br />\ncomplete staff for the yearbook will<br />\nbe announced Monday.<br />\nJohn Macnab left Wednesday for<br />\nWashington where he is attending<br />\nthe International Student assembly as<br />\nofficial representative Of the Hopkins.<br />\nThe assembly, to be held at American<br />\nuniversity September 2-5, is sponsored by , the United States ComStudent<br />\nmittee of International<br />\nservice.<br />\n. Speakers . at the conference will<br />\nThe Cotillion board and the Student council met Monday to deter- include: Mrs Franklin D Roosevelt;<br />\npresident Henry A Wallace;<br />\naffairs<br />\nfor<br />\nVice<br />\nmine a schedule of ciOcial<br />\nthe coming term. The tentative Dr Hu Shih. ambassador from China;<br />\nschedule for social activities includes: Dr Louis M Hackner, of the econothe Frosh-Soph dance, Octobes, 10; .mics department of Columbia univerJunior prom, Thanksgiving weekend; sity; and Harold Butler, British<br />\nminister.<br />\nand Senior week, February.<br />\nMiss Liudmilla Pavlichencko, RusMason Myers, acting chairman of<br />\nthe Cotillion board, issued another sian guerrilla fighter, will attend the<br />\ncall for freshman canditates this conference with two companions. In<br /><br />\nMacna6 Attending<br />\nStudent Assembly<br />\nIn Washington<br /><br />\nCotillion Board,<br />\nCouncil Set<br />\nSocial Schedule -<br /><br />\nhad been disappointing, and emphasized the fact that all freshmen who<br />\ndo sufficient work in publicizing the<br />\ndances will be placed on the guest<br />\nlist.<br />\nThe list of freshmen candidates is<br />\nas follows: Len Kerpelman, Charles<br />\nMyers, Jim Balder, John Haacke,<br />\nWill Lair, Jon Crosby, Joseph Shapiro, and Clint Redgrave.<br /><br />\nAIEE Hears<br />\nRosen, Burclette<br />\nAt a meeting of the American<br />\nInstitute of Electrical Vngineering<br />\non Tuesday, September 10, Judah<br />\nBen Rosen and Jack Purdette spoke<br />\n'on the topic: Ultra-short Radio<br /><br />\ncan press she said, \"The only good<br />\nGerman is a dead one.\" She has<br />\nkilled 308 Germans in her career as<br />\na goerrilla fighter. Miss Pavlichencko<br />\nit 24 years old and was formerly history major at the University of Kiev.<br />\nThe International Student. service<br />\nhas solicited colleges and universities to establish scholarships for<br />\nrefugee students. The Hopkins is one<br />\nof about seventeen Such instituting<br />\nwhich have complied with :their<br />\nappeal.<br /><br />\nRoy Frech, and Tom Ray.<br />\nlie\"reshments committee: Stuart<br />\nAverill and Bernard Ellinghaus.<br />\nSecretary: James Keenan.<br /><br />\nOn Sale At The<br />\nTreasurer's 0‘t;Remsen Hall<br /><br />\nStormers<br />\nStage<br />\nRally<br /><br />\nAttacking or defending the topic,<br />\nCapitalism must go in post-war<br />\nAt their first meeting of the new<br />\nAmerica, five candidates for positions<br />\nThe Y cabinet of Levering hall is<br />\non the Hopkins Debating council season last night—it rally designed<br />\nplanning an all-day outing at Metagave five to ten mimite talks in the - particularly for Interested freshmen<br />\nrieake, Maryland, Sunday, September tion cadets.<br />\nCommons room of the dormitory last —the Barnstormers made plans for<br />\n13.<br />\ntwo one-act plays to be presented<br />\n,<br />\nCadet Leroy E Daub, of Baltimore, night.<br />\n,<br />\noutpurpose<br />\nof<br />\nthe<br />\nThe principal<br />\nwas a member of Delta Upsilon fraPlans were also made at last for the USO within the next month.<br />\ning is to discuss the purpose of LeverThe two plays, isb You Are Twentyternity and attended the University night's meeting for a future debate<br />\ning hall in campus life, to check past<br />\nFrancis on the topic Resolved: That the One, by Ludwig Thome, and Why I<br />\naccomplishments, and to plan future from 1939 to 1942. Cadet<br />\nAm<br />\nA Gentleman, by Alexander FosUnited States should unite at the<br />\nactivities. Therk will be, however, E Stultz, of Hagerstown, was enpresent time with the British Corn- ter will be presented in the Audiswimming, a picnic, and other di- rolled in the University for the same<br />\nmohwealth of Nations. It was an- torium of. USO headquarters on<br />\nversions.<br />\ntime and was a member of Kappa nounced that regular weekly meet- Charles street. Ernest Gohn will diAnyone outside the cabinet who<br />\nSerge,<br />\nof<br />\nrect the first and Eli Birer the secSigma. Cadet Paul W B<br />\nings will be resumed shortly after the<br />\nwishes to attend this affair should<br />\nreceived his A B degree beginning of the October term. Sid- ond of these productions.<br />\npatify_ the Y Q,ffice in Leveeing hall. Baltimore,<br />\nney Katz, president of the—Orga-iiizaThe ,Bitristormers are considering<br />\nThe group - will first go to Annapolis in 1934. He was a member of the<br />\ntion, again extended an invitation to several plays in an attempt to<br />\nby train and then across the Chesa- Tudor and Stuart club, . Cadets<br />\nall interested freshmen to come out choose one for their main producpeake bay on the Matapeak ferry.<br />\nThomas R Moss and Ralph N Chris- for the Council.<br />\ntion this fall. As yet, however, none<br />\nYesterday at a meeting of the cabi- tensen, both of Baltimore, left the<br />\nAt the last meeting on Monday, has been decided upon.<br />\nnet, tke future of the War council<br />\nHopkins in 1941.<br />\nAugust<br />\n10,<br />\nPeter<br />\nKerwin<br />\nand<br />\nArnold<br />\nStudents who are interested and<br />\nwas discussed and plans were made<br />\nUpon completion of their pre-flight Harberger, who took the affirmative who did not attend last night's meetfor Freshman camp for the class<br />\ntraining at Maxwell field,'these ca- side in a debate against capitalism, ing are asked to contact Gohn, the<br />\nentering in October.<br />\ndets will enter one of the primary were, defeated by Rowland Brand- president of<br />\nthe<br />\nBarnstormers,<br />\nVespers<br />\n•<br />\nflying schools in the Southeast Army 'web and Hubert Cafritz, their op- through box 324.<br />\nDr W F Albright, professor of<br />\nAir Forces Training center for the ponents on the negative, by a fiveSemitic languages, will be the speakto-four decision of the audience.<br />\nfirst phase of their pilot training.<br />\ner at the vesper service to be held<br />\nin the Lederer room of Levering hall<br />\nat 5 pm, Sunday, September 6. The<br />\nY has invited Hopkins students of<br />\nall faiths to attend these weekly services.<br />\nIn continuance of the policy of the<br />\n, Lieutenant Samuel Stockton Miles,<br />\nsummer vesper program, Dr Albright<br />\nface. Joel Ashley also turns in a USNR son of Dr L Wardlaw<br />\n(Continued from Page 2)<br />\nwill discuss his ersonal attitude toMiles,<br />\ngood<br />\njob<br />\nas<br />\nNorman<br />\nReese.<br />\nLassie<br />\nformer<br />\ncollegiate professor of Engward religion. The purpose of the great deal of credit, however, for<br />\nvespers is to give an intellectual un- extracting from the play all that its Moores, as the dim-wit Dottie Co- lish at the Hopkins, has been killed<br />\nderstanding of religion by inviting meager stream affords. They have burn, turns in an exceptionally con- in action, probably somewhere in<br />\nvincing performance.<br />\nthe Pacific war area.<br />\nvarious faculty members to present<br />\nLieutenant<br />\nplayed it for broad farce, which is<br />\nIt is a pity that such a pretty Miles was a physician<br />\ntheir views on the subject. Dr J C<br />\nand had been<br />\nway that it could girl as Margale Wilson should be asigned by the<br />\nHubbard was the speaker at the last probably the only<br />\nNavy department to<br />\nbe played without the audience leav- such a stupid 'actress. Her' nasal the Marine corps.<br />\nmeeting, August 30,<br />\ning the theater at the end of the first twanghçneates.the stage when she<br />\nHe was last known to be .serving<br />\nact. It is reported that the play, enters, and she does nothing on the in the Pacific area.<br />\nwhen on Broadway, was played to stage to make the audience forget<br />\nDr Miles who retired from the<br />\nattempt to get some sort of whim- it while she, is on. In the scene where Hopkins in May, was a<br />\ncaptain of<br />\n'<br />\n.out of it. It is seldom she is supposed to be recovering infantry in the first World<br />\nsical charm<br />\nwar. He<br />\nthat anyone writing today, except from the effects of a Mickey Finn, was decorated with the<br />\nCongresThe Alumni Records bureau an- Saroyan, succeeds with whimsy—and she drops to her greatest depths. It is sional Medal of Honor, the<br />\nhighest<br />\nnounced that since June five gradu- even Saroyan often fails. Therefore, hard to tell whether she is merely American award for bravery. He<br />\na rose to the director, Richard 0 sick or whether: she is a dope fiend. also bears war decorations<br />\nates of the University have becom<br />\nfrom<br />\nFleischer. for not trying to put some- The rest of the cast' can be dis- other<br />\nT<br />\n14.euter ant eolonels in the<br />\nis obviously missed with the adjeetiee, anstiunm<br />\nta<br />\nr tersth<br />\n;v?!<br />\n.leading his men<br />\nStates Army, and ten have become thing into the play that<br />\nOn the whole, then, this play is through wire entanglements<br />\nto atmajors. They are: Lieut COls Ed-i not there.<br />\namusing enough, and anyone looking tack and take over a<br />\nheavily deThe cast, for the most part, handle<br />\nward D Spalding, William H Skinner;<br />\nfor<br />\nrelief from the cares of the world fended enemy position.<br />\nexbe<br />\ncould<br />\nas<br />\nwell<br />\nas<br />\nK<br />\nroles<br />\nFermidge<br />\nRhodes,<br />\ntheir<br />\nGeorge H<br />\nwill probably be tempted to laugh<br />\nLieutenant Miles was a graduate<br />\nNichols, C Ridgley Howard; Majors pected. Mason Adams, a product of<br />\nat some of the lines of the play; of Princeton university, in the<br />\nclass<br />\nNelson H Rector, Frank J Maguire the Yale Drama school, is -probably<br />\nbut it is, nevertheless, an inferior of 1936, and of the Johns<br />\nwhole<br />\nthe<br />\nin<br />\nactor<br />\nHopkins<br />\njr, John H Greist, Fred W Gelb, the outstanding<br />\ncomedy.<br />\nMedical sehool, in 1940.<br />\nstage,<br />\nthe<br />\non<br />\nease<br />\nat<br />\nis<br />\nCummings,<br />\nHe<br />\nE<br />\nplay.<br />\nJohn F Fiske, Carl<br />\nThe Hilltop's production last week<br />\nAbraham G Cohen, John H Bum- and he is able. to make himself inof Philip Barry's The 'Philadelphia<br />\nstead, Charles M Baer, and Robert conspicuous when he is not engaged<br />\nStory was considerably better in its<br />\nD Moyle, RAMC. Another alumnus, in important action on the stage. He<br />\nproduction. Lyn. Swann,/ as Tracy,<br />\n. Chaplain J R Maguire, has become is greatly aided in the role by a<br />\nnaturally idiotic expression on his was good in her role afteSHrM she<br />\n- a chaplain in the Army Air corps.<br />\ngot over her Katherine Hepburn-complex which pervaded the first act.<br />\n(Continued from Page 1)<br />\nMason Adams, as Delt,• was very<br />\nThe complete dance committee is<br />\ngood even in a part which suited as follows:<br />\nhim much less than his tole in Out<br />\nSophomore officers—Ted DeEiois,<br />\npf the Frying Pan.<br />\npresident; Stu Wilcox, vice-president;<br />\n'Carol Joyce Brennan, a product Arnold<br />\nHarberger, secretary; Jed<br />\nof .the Childf•en's Educationa4 thea- Goldberg,<br />\ntreasuner; Keith Warner,<br />\none year of paid experience in the from the date of application. Ap- ter at the Hopkins, gave a very ensergeant-at-arms; Bill' McLean, Stutertaining portrayal of Tracy's im- dent council<br />\nfield, or 15-semester hours in metal- propriate war. training courses May<br />\nrepresentative.<br />\npish sister, Dinah. Marshall , Mason<br />\nlurgy, or two .war training courses be substituted for college hours in<br />\nFreshmen officers—Fred Weekes,<br />\nlechtrops<br />\n,brartelte<br />\nin metallurgy. Appli,sations<br />\nWillieident; Charles Myers, secretary; John<br />\naccepted from college seniors or<br />\nThere are no age . limits for the<br />\n• Next week the Hilltop is ending Spittel,<br />\nserieant-at-arms; Georgegraduate students who expect to com- examinations, and no written tests its season with the premiere showChidester, Student council representplete the requirements within six are required. Applications will be ing of Francis Swann's new play, ative.<br />\naccepted until needs are filled, but the It's in the Air. We sincerely hope\"<br />\nSpirit committee—Monty Elmenthat the Swann's new attempt at clod, Fitz<br />\nDodson, Don,Overton, Mort<br />\nOn August 29, the commission commission floes not want war<br />\nself-exhibition results in a better play Stussman,<br />\nClint Redgrave, and Will<br />\nissued in revised form its continu- workers to ,apply unless a change of being given, at least an equally good<br />\nLair.<br />\nously open examinations for technical position would result in the utilization production.<br />\nassistants and junior physicists. For , Of higher skills possessed by the<br /><br />\nMatapeake Outing<br /><br />\nTo<br /><br />\nVOL XLV]<br /><br />\nNo<br /><br />\nlist five former Hopkins students<br />\nwho have recently enlisted as avia-<br /><br />\nHilltop Presents Poor<br />\nBut Well Played Comedy<br /><br />\nAll<br />\nIn R<br /><br />\nThe Interf<br />\nings on Tue<br />\nthis week, r<br />\nment used<br />\ntempt to. n<br />\nand more se<br />\ntime concliti&lt;<br />\nBecause<br />\nBoard has<br />\nvete oars<br />\nmen to- the<br />\nfreshmen; oi<br />\nfacilities mi<br />\nance with ti<br />\nhas been cl€<br />\nternities ma]<br />\nphone to see<br />\nof residence<br />\nby the rushi<br />\nOn camp<br />\nmilled until<br />\nand until 1<br />\ndefinition in<br />\nrnitories are<br />\nthe walk wh<br />\nof the dorm:<br />\nlot to the<br />\nforks at the<br />\ndormitory<br />\nMonday,<br />\nbetween 7.3<br />\nweek and t<br />\nset for rushi<br />\nAppointment<br />\ncan be mad<br />\nof the prece<br />\never they a:<br />\nbe made by<br />\nfreshmen.<br />\nIn the secc<br />\nwill. ban.* Ai<br /><br />\nDr Miles's Son<br />\nKilled in Action<br />\nIn Pacific Area<br /><br />\nHopkins Alumni<br />\nReceive Promotions<br /><br />\nfrom 2 to 6 I<br />\nrefreshments<br />\nSaturday nig<br />\nhold open he<br /><br />\nThe third I<br />\nopen houses<br />\nhouse at all<br />\nday night.<br />\nsystem will<br />\nwill take pla<br />\nher 8.<br /><br />\nFrosh-Sophs<br />\nTo Give Dance<br /><br />\nThe 'United States Civil Service<br />\ncommission has issued a call for<br /><br />\nCommission<br />\nThe Civil Service<br />\nemphasized the need for workers<br />\nin the occupations mentioned. Char-<br /><br />\nsemester hours' in physics. Seniors<br />\nexpecting to graduate within six<br /><br />\nacterizing the situation in regard to<br />\n1these occupations as urgent, it stated<br /><br />\nmonths may apply,<br /><br />\nIn its dispatch that everp person with<br />\nthe necessary qualifications is needed immediately, and that- each place-<br /><br />\nThe examination for technical as_ sisyant includes three optional<br />\nThi'anches: engineering, metallurgy,<br />\nFor the higher grade positions the<br />\nand physics. Salaries range from<br />\ninclude<br />\nnow<br />\nminimum requirements<br />\n$1400 to $1800 per year. For the<br />\ncourse<br />\nfour-year<br />\nthe completion of a<br />\n$1800 gade three years; for the<br />\nwith maior study in metallurgy or<br />\n$1600 grade two years; and for the<br />\nyears<br />\nclosely allied subjects and two<br />\n$1400 grade, one year of college<br />\n.55<br />\nof professional experiende in metalqualify<br />\n\"training ia<br />\nlurgy. 4.dditional experience is reany one oh the options in any<br />\ntee..<br />\nhigher-naeies<br />\nquirrd for the<br />\ngrade, certain requirements as to<br /><br />\ntionik<br />\nthe<br /><br />\ngrade requirements<br />\nnow are: (1) the completion of a<br />\nfour-year college course in metallurgical- engineering; or (2) completion of a four-year course in an allied subject supplemented by either<br />\njunior<br /><br />\nworker.<br /><br />\nthe position of junior physicist, paying $2000 per year, the requirements<br />\nconsists of the completion of a,fouryear college course including 18<br /><br />\nsional experience.<br /><br />\nand<br />\nSAVINGS STAMPS<br /><br />\nPress releases from the Public Relations office of Maxwell Field Preflight school, Montgomery, Alabama,<br /><br />\nCI(<br /><br />\n'<br />\nStorm<br /><br />\nCivil Service Commission Issues Requests<br />\nFor Metallurgists, Physicists in War Work<br /><br />\nWaves.<br />\nA demonstration using an ultra- metallurgists, physicists, and tech-wave transmitter was_glien In the<br />\nnical assistants, whp are \"urgently<br />\nsenior electrical room,. where the<br />\nneeded\" in civilian war service. Anmeeting was held. Connected to the<br />\ntransmitter wei'l '*grat of ani)ennas nouncements and application forms<br />\nwhich focused thk waves in one di- may be obtained from any first or<br />\nrection.<br />\nsecond class Post Office or from the<br />\nDuring the lecture, a flashlight Civil Service commission, Washingbulb with no connections was lit at<br />\nton, ti C.<br />\nat a distance of several feet from<br />\nThe commission began itEr recruitthe transmitter, using the power sent<br />\ning drive for metallurgists on Auout by the apparatus.<br />\nIn the course of the talk, the gust 25, when it announced two new<br />\nproperties, means of generation, ad- examinations in that field. The one<br />\nvantages and uses of ultra-short<br />\ncovers higher grade positions, which<br />\nwaves were discussed. Records were<br />\npay from $2600 to $5600 per year,<br />\nmade of the proceedings.<br />\nother is fot the junior<br />\nVisitors are invited to the regular while the<br />\nmeetings of the institute, which are grade and carries a salary pf, $2000.<br />\nheld every Tuesday at 1 p m in In both cases the requir'ements have<br />\nMaryitisid hall.<br />\nbeen modified to permit the acceptance of college teaching- as profes-<br /><br />\nBUY<br />\nWAR BONDS<br /><br />\n10MEWOOD, BALTIMORE<br /><br />\n_NEWS LETTER<br /><br />\nCAGE FOUR<br /><br />\nhours of study in specified subjects<br />\niust be met.<br />\nStudents may apply for the position Of technical assistant in any<br />\ngrade if they expect to finish the required courses within four months<br /><br />\nnjent in war industry of another<br />\nworker in one of these fields would<br />\nhave the effect of helping to redu<br />\nan important production bottleneck.<br />\nIr.<br />\nStudents in college inter../..<br />\nif they are<br />\nCivil<br />\nmenabove<br />\nthe<br />\n...ajoring in any of<br />\ntioned fields or are preparing for<br />\nclosely-allied occupations, are requested to consult with the heads of<br />\ntheir departments.<br />\nQuestions which cannot be answered either by the department heads<br />\nor by the announcements Obtainable<br />\nin first and second class post offices<br />\nshould be addressed to the Civil Service Commission, Washington, D. C.<br /><br />\nOn the Lodges<br /><br />\nGreek Relief<br /><br />\n,<br />\n(Continued from Page 1) saying, \"The American Government<br />\nhas been willing to associate itself<br />\nwith the arrangements (of the Greek<br />\nWar Relief4 in the confidence<br />\n(<br />\nfthat<br />\nPLEDGE BANQUET' they are feasible attempts, with adeAnother item of general fraternity<br />\nquate safeguards, to save an heroic<br />\ninterest is the coming pledge banpeople from national annihilation.'<br />\nquet. It will be given on September<br />\nGreek War Relief headquarters<br />\n9th. The Y and the interfraternity<br />\nin Baltimore are located,at 45<br />\nboard :are jointly sponsoring the af,t,94 fStro..4.<br />\nfair. The banquet is to be held foe<br />\nthe pledges, the preselecte or the<br />\n...ms et...ter/Mies, and the pledge<br />\ntrainers. If it is half as good as the<br />\npresent plans indicate, it will be a<br />\n(Continued from Page 1)<br />\ngreat success.<br />\n6 Prizes: First in each division will<br />\nPAAHTIES<br />\nreceive $5.00. Second in each diviTheATO's had their initiation bansidn will receive.a Hullabaloo.<br />\nquet last week-end. Al Wojtkelewicz<br />\nadded his bit to thet deal—a 14-pound 7 All pictures become the property<br />\nof the Hullabaloo, and can be used<br />\nbirthday cake . . . The AD's had<br />\nby,. them. If your picture is not<br />\na little sabotage to contend with last<br />\nused, you may get it at the end of<br />\nSaturday night. Their beer party was<br />\nthe October semester.<br />\non its first legs when somebody discovered that the beer was stale. Some 8 Place snapshots in official entry<br />\nwent home, others went for rum.<br />\nbox in front of Hullabaloo office.<br />\n(Continued from Page 2)•<br />\nA minority report was made at the<br />\nsame, time And is also being given<br />\nserious consideration.<br /><br />\nPhoto<br /><br />\nContest<br /><br />\nte,C<br />\noLs<br />\nots<br />\ne..-‘1<br />\n1 v'<br />\nstormers WI<br />\nauditorium ei<br />\nfollowing Fri<br />\n2<br />\n.<br />\nh%cr<br />\natit.<br />\nthT<br />\n.7<br />\n-<br /><br />\nRe,<br />\nClinton<br />\nLaura Lynci<br />\nDavid Phillt<br />\nLaura Lynch<br />\nA Bachelor,<br />\nErnest Go<br />\nstormers, is<br />\nEli Birer, Si<br />\nreeling the<br /><br />\n'Sun'<br /><br />\nd l<br />\n,Enp<br />\n0<br /><br />\nnote<br />\nBowman an<br />\nsuspension o<br />\nbecause of f,<br />\nand the as<br />\nconcerts cat<br />\nas<br />\nrmracnndt.)til<br />\nc<br />\ngo<br /><br />\nB,<br />\nFrom<br /><br />\npuer<br />\nsC<br />\nuS)<br />\nThe (<br />\ntion, of the<br />\nmeans the<br />\nof a commu<br />\nas far aS<br />\nThere are<br />\n,<br />\neven a gasp<br />\ntra.s, comp&lt;<br />\nteurs; but t<br />\nEdwinuaint<br />\nlate<br />\nsum of Inc<br /><br />"}], "field_media_file": [{"target_id": 39298, "display": null, "description": null, "target_type": "file", "target_uuid": "0c766356-061a-4978-913e-fe6ffbe108fb", "url": "http://digital.library.jhu.edu/system/files/2022-03/13465-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13465, "target_type": "node", "target_uuid": "52c4c105-65ad-489d-8928-87fab3e40424", "url": "/node/13465"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9539cc10-2e21-41b5-809e-ff31815a5ed0"}]}