{"mid": [{"value": 36883}], "uuid": [{"value": "c1c17894-9326-4bf3-a921-1bfb4d2a9c09"}], "vid": [{"value": 36883}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13076-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "[ass<br />\nneght<br />\nbewill<br />\nam<br />\nam<br />\nfor<br />\nthe<br />\nepayFolors<br />\nber<br />\nLesvs.<br />\nenher<br />\nthe<br />\nild-<br />\n<br />\nncil<br />\ntan,<br />\n<br />\n[ES<br />\n<br />\nto<br />\n<br />\nle<br />\n<br />\nhis<br />\nin<br />\nLe-<br />\n<br />\nsts.<br />\n<br />\nVOL. XXVIII, No. 4<br />\n<br />\nBALTIMORE, MD., OCTOBER 16, 1923<br />\n<br />\nSTUDENT AFFAIRS AGAIN THE MUSICAL CLUB ELECTS UNIVERSITY OF RICHMOND<br />\nTILGHMAN AS MANAGER<br />\nPREDOMINATE AT STUTO SEND DEBATERS TO<br />\nFOR COMING SEASON<br />\nHOPKINS<br />\nDENT ASSEMBLY<br />\nY. M. C. A. Campaign for Members Croker Presents Plans for the Year at Triangular Debate on Schedule. Adams<br />\nOrganization Meeting<br />\nContest in December. Southern<br />\nVigorously Supported by Dr. Swartz.<br />\nOratorical Entrance Undecided<br />\nHealth Service Questionnaire Explained<br />\nThe chief business of the first<br />\n<br />\nThe Debating Council anAt last Thursday's assembly, at meeting of the Johns Hopkins<br />\nthat the University of<br />\nnounces<br />\nwhich the program again consist- Musical Club, held at the Barn<br />\ned almost entirely of announce- last Thursday night, was to elect Richmond will send its debating<br />\nments and explanations in connec- a new manager to fill the place of team to Baltimore this year to<br />\ntion with the various student ac- J. W.Thomas, who recently with- meet the Johns Hopkins debaters.<br />\ntivities, Dr. Charles K. Swartz drew from the University, and to This will be in the nature of a remade a convincing address in sup- discuss the plans and organiza- alwn engagement; since last winter<br />\nport of,the Y. M. C. A. campaign tion for the coming year. After the Hopkins team met the Univervery little debate, • Richard C. sity of Richmond in an interesting<br />\nfor members. The value of ChrisTilghman, one of last season's asdebate at Richmond. The local<br />\ntion character to the college stu- sistant managers,<br />\nwas elected to<br />\ndent was the point emphasized by succeed Thomas by an unanimous debaters are confident that they<br />\ncan even the score with their VirDr. Swartz in his speech. Char- vote.<br />\nPresident Croker spoke of the gina rivals.<br />\nacter, he asserted, was to be put<br />\nbenefits<br />\nderived from membership<br />\nAnother feature of the schedule<br />\nbefore money, friends, health, and<br />\nin the Musical Club. He declared is the annual triangular debate<br />\nthe many other things considered<br />\nit is one of the hardest organiza- with the University of North Cardesirable in this life. Having put<br />\ntions in which to earn a Varsity olina and Washington and Lee<br />\nforth his claims in regard to char- Seal; three years of active -memUniversity. This debate has never<br />\nacter, Dr. Swartz showed that the bership being required in order failed to be one of the most interHowever, esting on the schedule. Each inY. M. C. A. is of value in aSsist- to become eligible.<br />\ning men in their efforts to attain the Musical Club emblem is stitution selects two teams, one of<br />\nawarded to all deserving mem- which upholds the affirmative and<br />\nhigh. Christian character.<br />\nbers, and this is one of the most the other the negative of the subThe speaker paraphrased—the<br />\nvalued of Campus insignia.<br />\nject selected. The debate is so arfour frankly stated purposes- of<br />\nThe question was brought up ranged that one of the teams of<br />\nthe Y. M. C. A. in proof of his as to whether last year's directors, each institution<br />\ndebates at home<br />\ncontention that the organization Mr. Bochau of the Glee Club, while the other is the guest of one<br />\n. is a moving influence for Chris- and Mr. McCauley of the Mando- of the other schools. For example,<br />\ntian life on the campus. The Y. lin Club, should be retained. It if the negative team of Hopkins<br />\nwas the general opinion that the journeys to Washington and Lee,<br />\nM. C. A., said Dr. Swartz, stands<br />\nstandards of both organizations the latter's negative goes to the<br />\nfor pride in religious life, the abilwere higher than ever last season University of North Carolina, and<br />\nity to stand fearlessly for one's re- because of the efficient leadership<br />\nNorth Carolina's negative comes<br />\nligious beliefs. It stands for ser- of these men. High authorities to Hopkins. .<br />\nvice toward one's fellow men. It ;have compared the work of Johns<br />\nBesides these there is of course<br />\nstands for the study of the Bible, Hopkins-- Club favorably with the Junior-Senior debate. This is<br />\na study worth while for intellec- that of Dartmouth last year's in- always bitterly contested, due in<br />\ntercollegiate champions. As the the first place to the natural rivaltual as well as religious purposes.<br />\ntreasury will soon. be in a satis- ry between the two upper classes,<br />\nAs a climax of all its purposes, it<br />\nfactory condition, and as .the ap- and in the second place to the<br />\nstands for the promotion of high<br />\npropriation from the Student Ac- prize given the winning class, the<br />\ncharacter among college men. Dr.<br />\ntivities Council has been materi- Herbert B. Adams Trophy. The<br />\nSwartz, in this connection, made<br />\nally increased, it was unanimous- under classmen will stage a classic<br />\na comparison between the great<br />\nly voted that the officers of the of their own, a Freshman-Sophotree that falls in the storm because Club<br />\nshould be given full power more debate. This will probably<br />\nit is rotten at heart and the man<br />\nto negotiate with Messrs. Bochau be held in either December or Janof considerable intellect and high and<br />\nMacCauley, with view to uary.<br />\nrank who falls under pressure for their<br />\nre-engagement.<br />\na similar reason. The fall oTboth<br />\nAnother debate ..of importance<br />\nThe concert season will be<br />\non<br />\nthe schedule is that with the<br />\ncrash<br />\nneither<br />\nsurprises us; but<br />\nmuch shorter this year than last;<br />\nUniversity<br />\nof Maryland. This will<br />\nwould be amazing if all the facts<br />\nthe first concert being giN en early<br />\nbe<br />\nthe<br />\nheld<br />\nat<br />\nUniversity of Marywere known. Dr. Swartz's enin December, and the final land. The<br />\nCollege Parkers can<br />\ntire speech was characterized by<br />\npractice is expected to put the club<br />\nexpect<br />\nto<br />\nfind<br />\na Hopkins team deconvincing vigor and sincerity, in<br />\nfirst-class shape, so that the<br />\ntermined to get revenge for last<br />\nand did much to boost the cause<br />\nseason will open with a well oryear.<br />\nof the Y. M. C. A.<br />\nganized concert. The culmination<br />\nMr. Shaal, the secretary of the of<br />\nthe season will be the Home- So far it has not been definitely<br />\nY. M. C. A., pointed out that the wood Concert, which promises decided whether Hopkins will<br />\norganization wanted not only to be even better than last<br />\nyear's. have entrants in the Southern<br />\nmembers, but active members. He<br />\nThe first practice for the Man- Oratorical Contest.<br />\nseveral<br />\nways<br />\nwhich<br />\nin<br />\nmentioned<br />\ndolin Club was held yesterday at The outlobk for the team is far<br />\nmembers of the Association work. the Barn, with Mr. MacCauley on from bad. There are quite a few<br />\nThe Y. M. C. A. is a student or- hand as director. The tryouts for men from last year who will<br />\nganization, Mr. Shaal pointed out, the Glee Club Will be held Thurs- again come out. However, much<br />\nand whatever the Johns Hopkins day, 8 P. M., at the Barn. Mr. more material can be used and<br />\nstudents do for the Association Bochau will probably be present there is plenty of room for many<br />\nthey will be doing for themselves. President Croker emphasized the new men. Dr. French will issue a<br />\nTom Jenifer said a few words necessity of every man giving his call for candidates about the first<br />\nin explanation of the \"Good Morn- individual attention and best ef- of November and all who have had<br />\ning\" campaign started by the Sig- fort to the director. Lateness and experience in debating or would<br />\nma Chi Beta Honorary Fraternity. absences from rehearsals will not like to gain some are urged to atThe object of the movement is to be tolerated. The uniform will be tend.<br />\nget the Johns Hopkins students the same as in previous years:<br />\nas well acquainted with one an- dress suits for the Glee Club, tuxNOTICE<br />\nother as possible; and, in order to edos for the Mandolin Club and<br />\nattain this objective, it is only the Black and Blue Jay Six.<br />\nLacrosse organization meeting today in 110 M. E. Old<br />\nThe candidates were listed, the<br />\nnecessary for every one on. the<br />\nmen, new men, and candiCampus to greet every man he number being rather disappointdates for managerial posirecognizes as a Hopkins student, ing to the officers; 11 men signed<br />\ntions are asked to report.<br />\nby name as far as possible. The up for the Glee Club and 21 for<br />\nHowever,<br />\nMovement should prove beneficial the Mandolin Club.<br />\nTrack practice every Tuesto the college and to the individ- several old men were unable to atday and Friday afternoons.<br />\nand<br />\nthis is<br />\nual, for the formation of friend- tend the meeting<br />\nNew material desired.<br />\nContinued on page 2, col. 2<br />\n<br />\nContinued on page 2, col. 3<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS WINS OVER MT.ST. MARY'S<br />\nIN FIRST GAME AT HOMEWOOD FIELD<br />\nMountaineers Unable to Score Against Black and Blue<br />\nGridders in Opening Contest<br />\nShowing themselves to be by far the better team, Hopkins sent<br />\nthe Mt. St. Mary's gridders home last Saturday at the tail end of a<br />\n21-0 score. The Mountaineers were outclassed from the beginning of<br />\nthe game although they threatened the local squad on several occasions in the second half. The Black and Blue displayed but little of<br />\nthe promise shown last week against Princeton due, perhaps, to the<br />\nweakness of the Maryland team.<br />\nHopkins started the scoring<br />\nSOPHS VICTORS IN FIRST soon after the opening whistle<br />\nINTERCLASS BASEBALL<br />\nblew. The ball, having zig-zagged<br />\nGAME<br />\nup and down the field several<br />\nDarkness Halts Conflict After Six In- times,-finally came,into the posnings. Bushey Plays Stellar Role<br />\nession of the Black and Blue warin Field<br />\nriors. A series of speedy end runs<br />\nWednesday,• October . 10, the advanced the ball for two first<br />\nSeniors and Sophomores played downs, placing it on the thirtythe first game in the Interclass yard line. A clever pass from<br />\nBaseball League, the Sophs Taylor to Bonner made it possible for the sturdy J. H. U. capemerging victorious, 11 to 9.<br />\ntain to run it behind the goal line<br />\nThe game started at about 4.30 for the initial<br />\nscore of the game.<br />\nwith the class of '26 at bat. • Was- Turnbull kicked the pigskin beserman, first man up, got a base tween the bars on the try-foron balls. Chesney's hit and a sac- point.<br />\nThe next addition to the score.<br />\nrifice by Bald brought him in for<br />\ncame<br />\nin the second quarter. By<br />\nthe first tally of the game. Mcoutguessing their opponents conKay then hit one through the intinuously the local team kept the<br />\nfield .and Chesney scored.<br />\nball well within the visitor's terriThe Seniors evened the score, tory for most of the period. A<br />\nwhen they came to bat; Tebo sin- dashing attack through the line<br />\ngled, errors advanced him around enabled the Homewood lads to<br />\nthe diamond, and Lamar brought creep up to the four-yard line,<br />\nOates in with a clean hit.<br />\nfrom whence Turnbull carried it<br />\nThe second was livened up by for the second tally.<br />\nHopkins? triple and Bushey's catch<br />\nBonner's speedy end runs were<br />\nof Draper's long fly.<br />\nan outstanding feature of the secIn the third the Sophs added<br />\nond quarter. On numerous octhree more to their score and the<br />\ncasions he dashed past the eneSeniors got one more run.<br />\nmy's first defense for gains which<br />\nThe Seniors staged a rally in<br />\nthe up-State team could not<br />\nthe fourth and made four rims,<br />\ncheck. These gains put Hopkins<br />\nputting them one ahead. Tebo and<br />\nwithin striking distance several<br />\nNewman scored on errors and<br />\ntimes. but it was not until the end<br />\nO'Conno's hit brought in Oates.<br />\nof the half that they were able<br />\nAt the end of the inning it was<br />\nto make good their advantage.<br />\nbeginning to get dark and the rest<br />\nof the game was played in semi- In the second half Mt. St.<br />\nMary's launched an ariel attack<br />\ndarkness. .<br />\nwhich<br />\nworried the home team<br />\nIn the next inning Chesney's<br />\ntwo-bagger and Hopkins' single considerably. The greatest and<br />\ntied the score but the Seniors came most consecutive gain that the<br />\nright back with a .run in their half visitors made were by the forward<br />\npasses which they completed in<br />\nof the inning.<br />\nThe sixth inning was the last, ,the third quarter of the game.<br />\nbecause although a seven-inning 'Ruiz, the diminutive Mexican<br />\ngame had been planned, it was quarterback of the Emmitsburg<br />\nmuch too dark to continue. The eleven, tried time and again to get<br />\nSophs clinched the game :when past the Hopkins defense by this<br />\nDraper was passed and stole sec- means and more than half of his<br />\nond, went to third on • Wasser- attempts were successful. Twice<br />\nman's sacrifice and scored on the forward pass method gave the<br />\nCrook's single. Bald sacrificed, visitors an open . field, the first<br />\nMcKay tripled and then came in clear run being stopped by Bonon a passed ball. In the last half ner in dangerous territory and<br />\nof the inning, Oates scored on the second by Maxwell after<br />\nO'Connor's hit and gave the Campbell had carried the oval<br />\nSeniors their final tally.<br />\nforty yards toward the goal.<br />\nBen Thomas, captain of the VarThe Mt. St. Mary's air route<br />\nsity, acted as umpire and the line- was but little more<br />\nsuccessful<br />\nup was as follows.<br />\nthan Hopkins'. The local gridSeniors—Tebo, 1.f.; Newman, r.<br />\nders fooled their rivals at this<br />\nf.; Oates, C.; O'Connor, 3b.; Jeni- method<br />\nat times when the gains<br />\nfer, s.s. ;. Lamar, 2b.; Bushey, c. f.;<br />\nwere needed the most. Coach Van<br />\nWasson, lb., and Ashton, p.<br />\nOrman's charges also succeeded<br />\nSophs—Wasserman, s.s.; Townin pulling down three passes,<br />\nsend and Crook, 1.f. ; Chesney, 2b.;<br />\nwhich were intended for the other<br />\nBald, lb.; McKay, 3b.; Hopkins<br />\nteam's receivers.<br />\nand Brown, c.f.; Thomsen, r.f.;<br />\nHopkins' final touchdown came<br />\nLogan, c., and Draper, p.<br />\nin the last quarter after Carr had<br />\nScore by innings:<br />\nSeniors.... 2 0 1 4 1 1— 9 intercepted a pass from Ruiz to<br />\n2 1 3 0 1 4-11<br />\nSophs<br />\nContinued on page 3 col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nMould be sent to the MANAGING EDITOR.<br />\n<br />\nHomewood 100<br />\n<br />\nTelephone<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24.<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25.<br />\n<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24.<br />\n<br />\nAdvertising Manager<br />\n<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24.<br />\n<br />\nFITZGERALD DUNNING, '24.<br />\nCirculation Manager<br />\n<br />\nAssociate Editors<br />\n<br />\nJOHN C. LEWIS, JR., '24.<br />\n<br />\nRICHARD C. TILGHMAN,'25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\n<br />\nAssistant Business Managers<br />\n<br />\nJunior Editors<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nLEO C. MUTH, '24.<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nCHARLES G. HUTZLER, '24.<br />\n<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nA. J. McKAY, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nOTHO J. KELLER, III, '25<br />\nJ. JACKSON KIDD, '26<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBaltimore, Md., OCTOBER 16, 1923<br />\n<br />\n1924 JUNE WEEK<br />\n1923 June Week, the report of which is printed in this issue of<br />\nThe News-Letter, was an undisputed success, financially and otherwise. No previous event or series of events has ever given the University as much advertising throughout the city or has brought into<br />\nplay as much college spirit as did the delightful affairs which culminated in the never-to-be-forgotten Senior Ball at the Hotel Betvedere. Our only misgiving is that it will be extremely difficult for<br />\nother June Weeks to equal the one of 1923.<br />\nAs Thomas M. Landy, Chairman of 1923 June Week Committee,<br />\nintimates, there were times last spring when financial success received a faint hope, a vague dream. Hopkins had never seen a June<br />\nWeek before and skeptics and conservatives needed much persuasion<br />\nbefore they decided to co-operate. Indefatigable work by certain<br />\nstudents of the University, however, succeeded in bringing about the<br />\nsuccess, of which all upper classmen are not only cognizant, but arc<br />\nproud.<br />\nThe task of the 1924 Committee should not be as difficult. The<br />\npioneers have gone ahead and laid low the worst enemies—skepticism and doubt---and it should not be difficult to dispose of tickets.<br />\nThere is', however, much to be accomplished if the affairs next June<br />\nare to equal in brilliance and charm the festivities of 1923. It is essential that the Committee begin functioning immediately.<br />\n<br />\n\"GOOD MORNING\"<br />\nAt a recent meeting of the Sigma Chi Beta Society a \"cheery good<br />\nmorning\" was approved as \"the best possible means of promoting<br />\na more friendly attitude among the students at Homewood.\" For<br />\nthe past several years various organizations on the campus have<br />\nmade desultory attempts to install the \"Hello\" system. These attempts however, invariably died from lack of nourishment and it was<br />\nnothing unusual for Hopkins men to pass each other without a sign<br />\nof recognition.<br />\nWith the advent of the Freshman regulation making it compulsory for first-year men to speak to all upper classmen, conditions<br />\nhave begun to improve. The upper classes, recognizing the betterment of spirit that is being obtained, are returning the Freshmen's<br />\ngreetings and are beginning to adopt the habit themselves.<br />\nHopkins is handicapped in many ways because of the fact that it<br />\nis a \"small college.\" It should, therefore, utilize all advantages issuing from this condition. The size of the student body at Homewood makes it possible for every Hopkins man to recognize every<br />\nother Hopkins man. A state of affairs which does not exist at larger<br />\nuniversities.<br />\nWe suggest that the entire student body adopt Sigma Chi Beta's<br />\nrecommendation of a \"cheery good morning.\"<br />\n<br />\nATHLETIC OFFICIALS ENDORSE JENIFER ELECTED CHEER LEADER<br />\nAT A. A. BOARD MEETING<br />\nFROSH FOOTBALL AND VARSITY BASKETBALL<br />\nBesides electing the manager<br />\n<br />\nENGINEERS GET REAL SAMPLE OF CONDITIONS IN<br />\nTHE LIFE HEREAFTER<br />\n<br />\nThe athletic authorities have for the 1923-24 basketball squad,<br />\ndecided to have a separate Fresh- the athletic board discussed many<br />\nman football team, with Tom matters of other business at its<br />\nLandy, last year's football captain, first meeting held at the Barn<br />\nas coach. The team will play last Monday night. The selection<br />\ngames with prep school teams in of a cheer leader, the voting of<br />\ntown and will finish the season letters to last year's swimming<br />\nwith the Soph games after the team and suggested changes in<br />\nVarsity schedule is completed. the constitution of the Athletic<br />\nAt present there are about Association were chief among<br />\ntwenty men working out with these topics.<br />\nThe meeting was not -unaniLandy. A bigger squad would<br />\nmake the team's prospects bright- mously attended by the members<br />\ner. Coach Van Orman may use of the board due, perhaps, to the<br />\nthe squad to learn formations and short space of time allowed for<br />\nplays of the opponents of the its announcement. There were<br />\nVarsity, so they can demonstrate there, however, a quorum so the<br />\nthem, enabling the Varsity to business of the body was not deplan a defense to meet the differ- layed by the small attendance.<br />\nBuck Bonner, president of the<br />\nent styles of play. This work<br />\nis of splendid aid to the Fresh- Athletic Association, appointed a<br />\nman who knows little football, as committee to draw up a new plan<br />\nhe learns different styles of play of election to the Board. The<br />\nand ways of meeting them. Al- committee was instructed to draw<br />\nmost as much experience can be up an amendment to the constiobtained in this way as in partici- tution, by which the officers of<br />\nthe board will be those seniors<br />\npating in games.<br />\nAt the Athletic Council meet- having the highest votes in the<br />\ning on Wednesday, it was official- popular election. This would<br />\nly decided to put on a basketball avoid the elimination of many<br />\nteam. A qualified coach will be good men which has formerly<br />\nhired in a few days and the men been a great fault at Hopkins.<br />\nThe board officially appointed<br />\ncalled out about the middle of<br />\nTorn<br />\nJenifer head cheer leader for<br />\nNovember. The A. A. is putting<br />\nthe<br />\nyear.<br />\nIn his appointment he<br />\non basketball at the request of<br />\nwas<br />\nrecommended<br />\nto issue a call<br />\nthe student body and the authorifor<br />\nassistant<br />\ncheer<br />\nleaders in orties have put it up to the student<br />\nder<br />\nthat<br />\nthere<br />\nmay<br />\nbe<br />\ntrained men<br />\nbody to support the team. The<br />\nto<br />\nfill<br />\nthe<br />\nposition<br />\nin<br />\nfollowing<br />\nFifth Regiment Armory has been<br />\nobtained for practice and games. years. It was also suggested that<br />\nGames will be played every Sat- the head cheer leader hold pracurday night during the months of tices to acquaint the candidates<br />\nJanuary and February. As in with the fundamentals of this imformer years, an informal dance portant office.<br />\nxvill follow all games.<br />\n<br />\nJunior and Senior Engineering Students<br />\nFind Duplicates of \"Devil's Delights\" at Steel Plant<br />\n<br />\nAn excellent sample of the conditions in the life hereafter was afforded a group of junior and senior<br />\nengineering students last Friday<br />\nafternoon at the Sparrows Point<br />\nSteel Plant of the Bethlehem Steel<br />\nCorporation. The group, under<br />\nthe guidance of Prof. Alexander G.<br />\nChristie and Associates William<br />\nB. Kouwenhoven and Frank W.<br />\nKouwenhoven, of the Mechanical<br />\nEngineering Department, was<br />\nconducted through the plant as a<br />\npart of the course in Materials of<br />\nEngineering. In order to obtain<br />\na better view of the various processes, the students had to approach within a few feet of a blast<br />\nfurnace discharging liquid red-hot<br />\niron; stand on a small bridge a few<br />\nfeet above rolls pressing red hot<br />\nrails; and stand an a small observation tower a few feet from a<br />\nladle dumping several hundred<br />\ntons of molten slag. The terrific<br />\nheat, the blinding light and deafening crackle caused by these processes combined to form as realistic a hell as anyone could desire.<br />\nAt one time the effect was heightened by the ghastly glare caused<br />\nby the action of an automatic generator cut-out switch.<br />\nThe inspection party met at<br />\n12 o'clock in Machinery Hall,<br />\nHomewood on Friday and proceeded to the Sparrows Point<br />\nplant on the 12.15 car. The inspection tour covered the coke<br />\novens, the blast furnaces, the open<br />\nhearth furnaces, the rolling mills<br />\nand the powerhouse.<br />\n<br />\nAVERAGE AGE OF FRESHMAN CLASS IS SOMEWHAT<br />\nHIGHER THAN USUAL<br />\nThis year's Freshman class at<br />\nClass last Wednesday at 12:20, the Heights is exceptionally maships is one of the most desirable Robert Middleton was unani- ture—in point of years at least.<br />\nthings about college life.<br />\nmously elected the class's repre- Although it has always been cusGardner, the president of the sentative to the Student Coun- tomary to depict an angel-faced<br />\nCotillion Club, announced that the cil.<br />\nstripling as the typical Freshman,<br />\nClub would hold dances in the C.<br />\nRalph Townsend, president of while the typical Soph was picE. Hall after the Saturday foot- the class, warned the members tured as a more mature individuball games. He announced also to be on the lookout for Fresh- al, the age level of the Class of '27<br />\nthat, according to present plans, men who break the regulations. ,is fully as high as that of their '26<br />\ntwo cotillions would be held be- He declared that many of them rivals, being well over nineteen<br />\nfore Easter, and one during June neglect the regulation requiring years. In point of size the situaWeek.<br />\nthem to speak to every one on the tion pictured in humorous college<br />\nHugh Smallwood, President of campus.<br />\nmagazines is almost exactly rethe Barnstormers' Club, called_ for<br />\nIt was decided that in the fu- versed, the Freshmen having pracactive support for the musical ture Sophomores will hand in the tically a monopoly on the iceman<br />\ncomedy to be given this season in names of erring Freshmen to the or coal heaver type of physique, as<br />\nplace of the usual serious produc- Pep Committee if it is found to be many Sophs learned to their sortion. Work on the production is inconvenient to administer correc- row during the recent tussle<br />\nwell under way, but a great deal tive measures immediately upon around the Fountain of Knowlof work will be necessary to over- the committing of the fault. The edge. It was claimed by the officome the handicap of inexperi- handling of such cases will then cers down at the Military Barence. He called a meeting of men • be entrusted to the discretion of racks that more six-footers enterwho are interested in the work the committee.<br />\ned this year than in any other<br />\nimmediately after the assembly.<br />\nThe class also decided to allow year.<br />\n•Dr. Gough, of the Johns Hop- last year's dues of $2.50 to pre- However, this advanced age and<br />\nkins School of Hygiene and Pub- vail again this year.<br />\nsize of our campus infants is not<br />\nlic Health, made a few remarks in<br />\ndue to any \"better babies camThe University of Virginia ex- paign\" or to the fact that their<br />\nconnection with the Public Health<br />\nService questionnaires that were pects to open its new gymnasium mentality could not cope with the<br />\ndistributed last Thursday. The in time for the coming basketball many problems of high school as<br />\nobject of the questionnaires is to season. It will be called the Me- readily as that of their predecessecure definite and concrete infor- morial Gymnasium, in honor of sors. It is chiefly due to the fact<br />\nmation about common colds to alumni killed in the World Wa. hat only a part of the '27 aggrega—Yellow Jacket. tion entered N. Y. U. directly<br />\nform a basis for scientific investigation of the subject. Those who<br />\nfrom preparatory schools.<br />\nTILGHMAN ELECTED PRESIDENT<br />\nare willing to help in the work<br />\nA very large proportion of the<br />\nMANAGER MUSICAL CLUB<br />\nincoming men have spent anyneed only fill out forms that will<br />\nContinued from page I<br />\nbe sent them every two weeks thought to have been the case where from one to five years out<br />\nduring the academic year. Col- with a number of others. Be- in the cold world after receiving<br />\nlege men are being asked to do cause of the importance of an their high school degree, and are<br />\nthe work because it is thought re- early start such men should reg- consequently much older and largliable information can be secured ister with Sater or Croker and be er than Freshmen of previous<br />\nfrom them. All communications present at the tryouts. It is years. Some have been compellin regard .to the subject will, of hoped that more men will sign up ed to do so by the necessity of<br />\ncourse, be confidential.<br />\nin order that the club will be able earning and saving enough money<br />\nThe assembly closed with a to have a larger field from which to end strikes and labor disputes.<br />\nto select its members.<br />\nshort yell practice.<br />\n—New York University News.<br />\n<br />\nMIDDLETON ELECTED SOPHOMORE<br />\nDELEGATE TO STUDENT<br />\nSTUDENT AFFAIRS AGAIN PREDOMCOUNCIL<br />\nINATE AT STUDENT ASSEMBLY<br />\nAt a meeting of the Sophomore<br />\nContinued from page 1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br />\nFINANCIAL REPORT JUNE WEEK, ORGANIZATION MEETING OF BATTLE FOR VARSITY POSITIONS Carter<br />\nJUNE 18TH, 1923<br />\nBEING WAGED AT HOMEWOOD Taylor<br />\nELECTRICAL CLUB TO BE<br />\n<br />\nRG<br />\nQB<br />\nMaxwell<br />\nRH<br />\nSchacht<br />\nL.T<br />\nBarton<br />\nL.G<br />\nWolbert<br />\nR.E<br />\nRich<br />\nRT<br />\nBonner (cap.).L.H<br />\nTurnbull<br />\nFB<br />\n<br />\nLIABILITIES<br />\n<br />\n3<br />\nMoore<br />\nGrogan<br />\nRuiz<br />\nDanker<br />\nH. Morey<br />\nCampbell<br />\nD Morey<br />\nH Riley<br />\nJ Riley<br />\n<br />\nThe great increase in likely footHELD FRIDAY<br />\nball<br />\nmaterial which has taken<br />\nThe Johns Hopkins Electrical<br />\nTo Hotel Belvedere<br />\nplace<br />\nat Homewood Field lately<br />\n(food, space, punch) $1,987.50 Club will begin its activities for<br />\nhas<br />\nmade<br />\nthe fight for positions on<br />\nthe currerit year at 4.15 P. M. on<br />\nTo Penn. Serenaders (10<br />\nthe<br />\nJ.<br />\nU.<br />\nH.<br />\nfootball team a deadly<br />\n680.00 Friday, October 19, with an organ- one. With<br />\nhours playing)<br />\nample stock of playan<br />\nization meeting in Room 104 of<br />\nTo E. A. Wright Co<br />\ners<br />\nto<br />\nselect<br />\nfrom,<br />\nCoach Van Orthe<br />\nMechanical<br />\nEngineering<br />\n(1,000 leather proBuilding. The speaker of the oc- man has withheld the awarding of<br />\nScore by periods:<br />\n500.00<br />\ngrams)<br />\ncasion will be Mr. J. V. Alfriend, permanent berths on the squad Hopkins<br />\n7 7 0 7-21<br />\nTo Loane Bros. (canvas<br />\nJr., a graduate of the Hopkins until he is certain that he has the Mt. St. Mary's<br />\n0<br />\n0 0 0- 0<br />\nfor dance floor)<br />\n175.00 Electrical Engineering Depart- best man for the job. The line-up<br />\nSubstitutions-Hopkins: MilaTo Bachrach Rasin Co<br />\nment and a former member of the in the Princeton game was merely<br />\nYou'd be surprised at what<br />\n(fireworks)<br />\n138.00 club. He will take as his subject, temporary and several li,anges are nausky for Barton, Berndt for<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\nTo Fishers Orchestra<br />\n\"Student Activities at Westing- expected to take place before the Schact, Carr for Day, Slowik for<br />\ninstance-his clothes are<br />\nCarter;<br />\nend<br />\nMt.<br />\nof<br />\nMary's:<br />\nSt.<br />\nthe<br />\nByrne<br />\n1923<br />\nseason.<br />\nfor<br />\n216.00 house.\"<br />\n(June 11 and 12)<br />\ndreams and his grooming an<br />\nThere are four particularly hard- Johnson, Abby for Harry Riley,<br />\ninspiration.<br />\nThe club is now making a drive<br />\nTo Young's Orchestra<br />\nHe gets that finely turned-out<br />\nfought struggles for Varsity J. Bonner for Abby, Johnson for<br />\nhead from\"Vaseline\"HairTonic.<br />\n115.00 for members. Although it is not<br />\n(June 9 and 11)<br />\nIt smooths and grooms the hair.<br />\na student branch of the American berths now going on within the Byrne, Ramik for H. Morey, MarTo Balfour Co. (favors,<br />\nAt all drug stores and student<br />\ntin<br />\nfor<br />\nranks<br />\nCampbell,<br />\nof<br />\nthe<br />\nBlack<br />\nCampbell<br />\nand Blue squad.<br />\nfor<br />\nbarber shops.<br />\nJune 12)<br />\n525.00 Institute of Electrical Engineers, Berndt's position<br />\nEvery\"Vaseline\"Product is<br />\noore, Gallagher for Grogan,<br />\nat end is a troit requires that all its members<br />\nrecommended everywhere<br />\nTo Burns Co. (1,000<br />\nbecause<br />\nof its absolute puphy<br />\nHarry<br />\nwhich<br />\nRiley<br />\nfor Abby, McMorris<br />\nShacht is seriously<br />\nshall be student members of the<br />\nrity and effectiveness.<br />\n43.50<br />\npaper dance programs)<br />\nthreatening<br />\nfor<br />\nHarry Riley. Touchdownsto take away from<br />\nInstitute, and accordingly the club<br />\nOverhead (see below- for<br />\nobtains all of the advantages ac- him. Magill, for two years regular Turnbull (2), Bonner. Tries for<br />\n985.72 cruing from affiliation with<br />\nitemized account).._<br />\nthe In- tackle, has a strong rival in Car- point-Turnbull (3) (by placestitute without any of its restric- ter, a student at the Medical ment, Bonner holding ball). RefTotal expenditures... .$5,365.72 tions. All juniors and seniors of School. Milanausky and Barton, eree-Farrier, Dartmouth. Umthe Department of -Electrical En- both of whom have been trying pire-Clinton, Yale. Head linesChesebrough fg;Co.<br />\nOVERHEAD<br />\nfor years to make the team, are man-Sigmund, Lafayette. Time<br />\ngineering are invited to join.<br />\n(consolidated)*<br />\nwaging a fierce struggle for the of quarters-15 minutes.<br />\nLanterns (for decorating<br />\nguard position. Cromwell's gradcourts)<br />\n$45.00 From fraternity booth<br />\nuation from. the university left<br />\nfees<br />\nLumber (booths and floor<br />\n225.00 open<br />\nthe job of center, for which<br />\n101.52 From sale of lumber<br />\n51.00<br />\nin gardens)<br />\nCarr and Day are fighting with all<br />\nFor printing tags<br />\n10.00 From sale of extra prothey have.<br />\n136.00<br />\nFor printing tickets,<br />\n2.50 grams and favors<br />\nAnd these are not all of the<br />\nFrom special admissions<br />\nTelegrams, picture and<br />\ndoubtful places in the future line274.00 up.<br />\nstamps<br />\n9.08 at gates<br />\nCoach Van Orman has the<br />\nCrystal ball (as decoratools to work with and he intends<br />\n$5,486.94<br />\ntion)<br />\n5.00 Total assets<br />\nto pick the tool best adapted to<br />\nTotal<br />\nexpenditure<br />\ns<br />\n5,365.72 serve<br />\nSenior prizes (class day)<br />\n37.25<br />\nthe purpose that he wants it<br />\nFlowers (committee •at<br />\nto accomplish.<br />\ndances)<br />\n5.50 Balance in bank (to be<br />\nheld for action of 1923<br />\nHOPKINS WINS OVER ST.<br />\nIncidentals (paint, brush)<br />\n.50<br />\nclass)<br />\n$121.22<br />\nMARY'S<br />\nTo J. H. U. (lights for<br />\n(Signed)<br />\nHoward<br />\nB.<br />\nHensel.<br />\n2.00<br />\n,Continued from page 1<br />\nnight work)<br />\nTreasurer June Week Committee. Campbell<br />\nO one smokes<br />\nFor circus (Muller's act,<br />\nin the shadow of the<br />\nApproved<br />\nby<br />\nDr.<br />\nR.<br />\nV.<br />\nD.<br />\n$7, horses, $9)<br />\ngoal posts.<br />\nMelachrinos<br />\n16.00<br />\nThe Mountaineers<br />\nagg-ofin.<br />\nTo- Maryland Auto Club<br />\nwere unable to stop the succeswithout liking them<br />\n(Signed) Thomas M. Landy. sive<br />\n(watching cars, June 9,<br />\nline plunges which resulted<br />\nChairman June Week Committee. in<br />\n-for their quality<br />\n10 and 11)<br />\n13.00<br />\nthe last J. H. U. tally. HopOur<br />\nbooks<br />\nare<br />\nopen<br />\nfor<br />\nall<br />\nto<br />\nTo Young's Orchestra<br />\ninstantly wins apkins almost scored again a few<br />\nexamination.<br />\n(extra, cabaret, June<br />\nminutes after, but the final whistle<br />\npreciation.<br />\nThe 1923 June Week Committee<br />\n11)<br />\n15.00<br />\nannounced the cessation of hoswishes to take this opportunity to<br />\nTo Black Bros. (decorattilities with the ball within ten<br />\nthank<br />\nthe Hopkins student body yards<br />\ning Belvedere)<br />\n250.00<br />\nof the zero line.<br />\nTo J. H. U. for labor<br />\n100.00 and the other Hopkins friends and<br />\nDoug Turnbull consistantly<br />\nORIGINAL<br />\nboosters who did so much to make<br />\nTo Phillips Brothers<br />\noutkicked the Mt. St. Mary's<br />\n43.68 the first June Week such a suc- punter. His toe more than recov(bunting for booths)<br />\n.82 cess.<br />\nPostage<br />\nering the distance which the vis\"The One Cigarette Sold the World Over\"<br />\n.60 We likewise take this opportun- itor's ariel attack had netted them.<br />\nPencils<br />\nity to thank the faculty for the<br />\nPrinting (invitations,<br />\nTurnbull had little luck with the<br />\nloyal support they accorded our<br />\n$10; programs, S8.75).<br />\n18.75<br />\nfour placement kicks which he<br />\nwild dreams, the realization of<br />\nDecorations (paint, patried. Three times the ball sailed<br />\nwhich<br />\nwe sometimes doubted ourper, etc.)<br />\n7.83<br />\nwide from the goal posts, deprivHammer and nails<br />\n1.75 selves. In brief we shall sing our ing Hopkins of the three points<br />\nswan song (if our vanity may be<br />\nCandles<br />\n.65<br />\nwhich each would have added to<br />\npardoned) by once more quoting<br />\nTo feed soldiers from<br />\nthe score. The fourth attempt at<br />\nourselves, that \"if we have secured<br />\nCamp Meade who came<br />\na field goal was broken up by two<br />\na<br />\nwith machine guns)<br />\n10.80 closer relation between the alum- Emmitsburg players who broke<br />\nni and their alma mater; if we<br />\nFor policemen's services<br />\n30.00<br />\nthrough the Hopkins line before<br />\nhave<br />\nkindled in our undergraduTiPs to Belvedere (head<br />\nBonner could get the ball in place.<br />\nwaiter and floorman)<br />\n10.00 ates a deeper love for their UniBoth teams made several subversity, then we shall feel that our<br />\nNat'l Novelty Co. (heads<br />\nstitutions<br />\nduring the contest, the<br />\nefforts have not been in vain.\"<br />\nfor circus & balloons)<br />\n17.00<br />\nHopkins coach limiting his extra<br />\nTHOMAS M. LANDY, men<br />\n\"or electrician's services.<br />\n10.00<br />\nto four; Mt. St. Mary's makChairman for the 1923 Class.<br />\nFor maid and janitor<br />\nbig ten changes in the line-up.<br />\n8.00<br />\nservice<br />\nCoach Van Orman made these<br />\nFor printing a letter (cirsubstitutions in order to try the<br />\n1.25<br />\ncular)<br />\nLOST<br />\ngame power of the squad.<br />\nR. H. Braxton (labor and<br />\nOne brief case containing<br />\nLine-up:<br />\nPiano, Mon., June 11)<br />\n32.00<br />\none Carnahan's Grammar.<br />\nHopkins (21).<br />\nMt. S. Mary's (0)<br />\nFor chairs on Class Day.<br />\n53.48<br />\nL. Stulman, P. 0. Box 503.<br />\nMagill<br />\nL.E<br />\nJohnson<br />\nTo Gas Co. (lights for<br />\nDay<br />\nDesmond<br />\ncircus)<br />\n1.76<br />\nTo Md. Casualty Co.<br />\n(rental of hall, June 11) 125.00<br />\n<br />\nSOPHISTICATED<br />\n<br />\nVaseline<br />\nHAIR TONIC<br />\n<br />\nN<br />\n<br />\nMELACHRINO<br />\n<br />\n(STETSONOc-P<br />\n<br />\nTotal<br />\n<br />\n$985.72<br />\nASSETS<br />\n<br />\nProm<br />\nFrom<br />\nProm<br />\nFrom<br />\nFrom<br />\nFrom<br />\n<br />\ntag days<br />\n$564.33<br />\ncandy sale at play<br />\n53.36<br />\nsale of tickets<br />\n3,660.00<br />\nbenefit dance<br />\n15.25<br />\nHullabaloo<br />\n58.00<br />\npatronesses<br />\n450.00<br />\n<br />\nThe college man wants \"English\" in his<br />\nclothes. We give it to him.<br />\n<br />\nelaac<br />\n<br />\nY-Agrwri-<br />\n<br />\nBALTIMORE AND HANOVER<br />\n<br />\nBats<br />\nOne big advantage of a Stetson is that<br />\nyou can give it so much wear-and<br />\nit will still keep its shape and style.<br />\nSTYLED FOR. 'YOUNG MEN<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br />\n<br />\n4<br />\n<br />\nPROF. GREGORY ADDRESSES TAU BETA PI HONORARY<br />\nFRATERNITY ASSOCIAINITIAL MEETING OF<br />\nTION TO HOLD MEETC.<br />\nE.<br />\nA.<br />\nS.<br />\n'<br />\nS<br />\nSANFORD<br />\nand individuality is offered here at prices that are not<br />\nING THURSDAY<br />\nProfessor John H. Gregory,<br />\nFOUNTAIN PEN INK<br />\nand cannot be underquoted by any house at any time.<br />\nThe Maryland Alpha Chapter<br />\nhead of the civil engineering de41 Besides the reputation of an old-established firm<br />\nWill Improve the Action<br />\nof the Tau Beta Pi Honorary Enis back of each sale with a guarantee.<br />\nof Any • partment, was the principal speak- gineering Fraternity, situated at<br />\nof<br />\nmeeting<br />\norganization<br />\ner<br />\nat<br />\nthe<br />\nFountain<br />\nJohns Hopkins, will hold an orthe Hopkins Student Chapter of ganization meeting Thursday<br />\nPen<br />\nthe American Society of Civil En- night at 8 o'clock in the Mechani- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\n•<br />\n-,,,,Inilintoui11111111<br />\ngineers, held last Fri(lay, October cal Engineering Building.<br />\nALL<br />\n343 NORTH CHARLES STREET<br />\nCOLORS<br />\n12, at 8 P. M., in the C. E. Build- *This society performs the same<br />\nSat;?°t6S<br />\nfunction in engineering that the<br />\nP<br />\n(),,<br />\ning.<br />\nEA\"I'el!\"4K<br />\nfOINAINPD-C<br />\nALL<br />\nPhi Beta Kappa does among the<br />\nB`c17)§,V.T4°<br />\nSIZES<br />\nUpon the suggestion of Profesarts and sciences. It differs, how•<br />\nsor Gregory, several changes were ever, from the latter society in<br />\n\"The Ink That Made<br />\ninaugurated into the methods of that it requires of its members not<br />\nPossible\"<br />\nThe Fountain Pen<br />\nprocedure of the organization. only excellence in scholarship,<br />\nOne of the most important of but also participation in school acthese was that semi-monthly talks tivities, loyalty to school and fellow students, and evidence of a<br />\nfollowed by general discussion,<br />\nleading personality.<br />\nwould be given by members of<br />\nThe total number of men from<br />\nthe Society.<br />\nany class who are eligible to memOne important suggestion of bership is restricted to one-fourth.<br />\nProfessor Gregory was that the lie man .who stands highest in<br />\njoint executive committees of the the test stated above is invited to<br />\nLimited<br />\nthree engineering societies at Join the society at the beginning<br />\nHopkins meet to discuss the hold- of his junior year. The first oneBARN CAFETERIA ing of three combined- meetings eighth of the class is eligible for<br />\na year, into each of which the en- membership at the end of the.<br />\ntire force of all the chapters would third year. The remaining onebe put. This was not acted upon eighth of the class is eligible durWrite your \"copy\" on a Remington Portable.<br />\nat this meeting, but will, in all ing the fourth year. Men who<br />\nClean,<br />\nlegible copy will catch the editor. Use the<br />\nprobability, be taken up in the have attained distinction as alummachine also for your everyday work and persona)<br />\nnear future.<br />\nni are also eligible.<br />\ncorrespondence. You will be surprised how much<br />\nProfessor Gregory stressed' the<br />\nThe emblem of the society contime and labor it will save.<br />\nfact that members of the Student sists of a gold watch charm, in<br />\nCompact—fits in a case only four inches high.<br />\nChapter were allowed to attend all the form of the bent of a trestle,<br />\nConvenient—you can use it on your lap, if you wish, for it<br />\ncarries its table on its back.<br />\nthe meetings of the parent soci- inscribed with the owner's name,<br />\nComplete—with four-row keyboard,like the big machines,ani<br />\n\"The King of Lubricants\" ety, as they are non-voting mem- chapter and certain secret symother 'big machine\" conveniences.<br />\nbers. He also spoke of the fine bols.<br />\nPrice, complete with case,$60. Easy payment terms if desired<br />\nSHERWOOD BROTHERS, INC.<br />\nopportunity for discussion of curThe Hopkins Chapter was inUNNEICIEREICIECIEEglEICIECIEECINEHEIE rent engineering problems afford- stalled in 1910 through the efforts<br />\ned by the meetings.<br />\nof Professor Alexander G. ChrisCopies of booklets telling of the tie,<br />\nhead of the Department 9f Meaims and activities of the AmerBoys, the place to get your<br />\nchanical Engineering. The offiican Society of Civil Engineers<br />\nmeals—and they are honcers of the chapter who were electwere distributed to the members ed at the end of last year<br />\nare J.<br />\nest-to-goodness meals, well<br />\npresent. This presenting of the Edward<br />\nMount, president; Lawserve do and reasonably<br />\ncurrent literature of the society rason R.<br />\nKent, vice-president; J.<br />\npriced—is at<br />\nto the chapter members will be Tillotson Dixon, treasurer;<br />\nHugh<br />\nmade a feature of the program of Smallwood,<br />\ncorresponding secrethis year.<br />\ntary and Lee Kinsey, recording<br />\nFrederick L. Moehle was apsecretary. William North Crout<br />\npointed chairman of a member- is an<br />\nassociate editor of the naship committee to tell those men<br />\ntional publication of the society,<br />\neligible for membership the ben1817 N. Charles St.<br />\ncalled the \"Bent.\"<br />\nefits of the Society. This com(Half Block below North Ave.)<br />\nmittee will also invite the civil en- MAJOR GAREY TO BE INAUGUgineering freshmen to attend all RATED AT ST. JOHN'S NEXT WEEK<br />\nNicholas Brown, Mgr.<br />\nregular meetings as guests.<br />\nThe inauguration of Dr. Enoch<br />\nAt the Washington Monument<br />\nThe next meeting of the chap- Barton Garey, the new president<br />\nNECKWEAR ter will be held next Friday, Oc- of St. John's College, will be held<br />\nSHIRTS<br />\nOscar Thomas Olson, D.D.<br />\ntober 26, at 4.15 P. M. The speak- at Annapolis on the afternoon of<br />\nMinister<br />\ner will be Mr. Frederick L. October 25. Appropriate cereI()ehle, a civil engineering senior, monies .are being formulated by<br />\n421 N. HOWARD ST.<br />\nHopkins Students Are Invited to<br />\nwho will have as the title of his the Board of Visitors and GoverGLOVES<br />\nHOSIERY<br />\nMake This Their Church Home<br />\npaper \"Some Practical Problems nors and the Alumni of the Colin Present Day Construction.\" lege.<br />\nThe purpose and program of this<br />\nThe talk will be profusely illusThe inaugural will be followed<br />\nChurch will appeal to you. Look in<br />\ntrated by slides.<br />\nby a visit of inspection by repreon the Sunday afternoon -At Home\"<br />\nPrinters of Philological and<br />\nsentatives of the General Educafrom five to seven..<br />\nScientific Works<br />\ntion Board of New York. A genBOGUS<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nSunday morning worship at 1 1 o'clock.<br />\nA man complained because he eral survey of the College will be<br />\nwas unable to \"cash in on a good made with a view to determining<br />\nSunday evening service at 8 o'clock.<br />\nreputation.\" He probably couldn't what financial assistance may be<br />\nMusic by vested chorus—choir of soloists.<br />\nfind any one to indorse it for him. given in addition to the endowment being raised by the alumni.<br />\n—Topeka Capital.<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nI<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nMake Your College Paper<br />\n<br />\nPER<br />\n<br />\nKOn02 0111115<br />\n<br />\nernington<br />\nPortable<br />\n<br />\nThe St. REGIS<br />\n<br />\nJIM<br />\n<br />\nFr<br />\nJu<br />\nse(<br />\nric<br />\nthi<br />\nan<br />\n<br />\nSC(<br />\n<br />\nfie<br />\nin<br />\n<br />\nth<br />\nrn.;<br />\nfr(<br />\non<br />\nha<br />\nIn<br />\nin<br />\n<br />\n\\A)<br />\nin,<br />\nor]<br />\n<br />\nan<br />\n<br />\nto<br />\nge<br />\nin<br />\n1VI<br />\nSi<br />\nSt,<br />\nP;<br />\n10<br />\n<br />\nin<br />\n<br />\nto<br />\n<br />\nRESTAURANT<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nJa<br />\n1);<br />\nrf<br />\n<br />\nV\\i<br />\nne<br />\n<br />\nLeFranc & Ault<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nFROSH PUT OVER SEASON TICKET CAMPAIGN<br />\nThe Freshman Class deserves praise for the way they<br />\nhave handled the football season tickets. Graduate Manager Keyes made the following statements:<br />\n\"The Season Ticket Sale this year is the best ever had<br />\nfor football due to co-operation of the Freshman Class. Last<br />\nyear we employed a publicity man to manage the sale and<br />\nnetted only nine hundred dollars ($900.00). This year our<br />\npresent net profit on the sale is one thousand and fifty-one<br />\ndollars ($1,051.00) and subscriptions are still coming in.<br />\n<br />\nPrinters or<br />\n<br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\nLOMBARD and<br />\n<br />\nSOUTH<br />\n<br />\nSTREETS<br />\n<br />\n\"Johns Hopkins needs backing more than ever this year<br />\nas the city with its Stadium will make a big cut in our receipts.<br />\nThe thing for every Hopkins man to do is to talk Hopkins<br />\nfootball to every man, woman and child he sees.\"<br />\n<br />\nRENT A CAR<br />\nDrive It Yourself!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\ntc<br />\nel<br />\n<br />\n\f", "format": "basic_html", "processed": "[ass<br />\nneght<br />\nbewill<br />\nam<br />\nam<br />\nfor<br />\nthe<br />\nepayFolors<br />\nber<br />\nLesvs.<br />\nenher<br />\nthe<br />\nild-<br /><br />\nncil<br />\ntan,<br /><br />\n[ES<br /><br />\nto<br /><br />\nle<br /><br />\nhis<br />\nin<br />\nLe-<br /><br />\nsts.<br /><br />\nVOL. XXVIII, No. 4<br /><br />\nBALTIMORE, MD., OCTOBER 16, 1923<br /><br />\nSTUDENT AFFAIRS AGAIN THE MUSICAL CLUB ELECTS UNIVERSITY OF RICHMOND<br />\nTILGHMAN AS MANAGER<br />\nPREDOMINATE AT STUTO SEND DEBATERS TO<br />\nFOR COMING SEASON<br />\nHOPKINS<br />\nDENT ASSEMBLY<br />\nY. M. C. A. Campaign for Members Croker Presents Plans for the Year at Triangular Debate on Schedule. Adams<br />\nOrganization Meeting<br />\nContest in December. Southern<br />\nVigorously Supported by Dr. Swartz.<br />\nOratorical Entrance Undecided<br />\nHealth Service Questionnaire Explained<br />\nThe chief business of the first<br /><br />\nThe Debating Council anAt last Thursday's assembly, at meeting of the Johns Hopkins<br />\nthat the University of<br />\nnounces<br />\nwhich the program again consist- Musical Club, held at the Barn<br />\ned almost entirely of announce- last Thursday night, was to elect Richmond will send its debating<br />\nments and explanations in connec- a new manager to fill the place of team to Baltimore this year to<br />\ntion with the various student ac- J. W.Thomas, who recently with- meet the Johns Hopkins debaters.<br />\ntivities, Dr. Charles K. Swartz drew from the University, and to This will be in the nature of a remade a convincing address in sup- discuss the plans and organiza- alwn engagement; since last winter<br />\nport of,the Y. M. C. A. campaign tion for the coming year. After the Hopkins team met the Univervery little debate, • Richard C. sity of Richmond in an interesting<br />\nfor members. The value of ChrisTilghman, one of last season's asdebate at Richmond. The local<br />\ntion character to the college stu- sistant managers,<br />\nwas elected to<br />\ndent was the point emphasized by succeed Thomas by an unanimous debaters are confident that they<br />\ncan even the score with their VirDr. Swartz in his speech. Char- vote.<br />\nPresident Croker spoke of the gina rivals.<br />\nacter, he asserted, was to be put<br />\nbenefits<br />\nderived from membership<br />\nAnother feature of the schedule<br />\nbefore money, friends, health, and<br />\nin the Musical Club. He declared is the annual triangular debate<br />\nthe many other things considered<br />\nit is one of the hardest organiza- with the University of North Cardesirable in this life. Having put<br />\ntions in which to earn a Varsity olina and Washington and Lee<br />\nforth his claims in regard to char- Seal; three years of active -memUniversity. This debate has never<br />\nacter, Dr. Swartz showed that the bership being required in order failed to be one of the most interHowever, esting on the schedule. Each inY. M. C. A. is of value in aSsist- to become eligible.<br />\ning men in their efforts to attain the Musical Club emblem is stitution selects two teams, one of<br />\nawarded to all deserving mem- which upholds the affirmative and<br />\nhigh. Christian character.<br />\nbers, and this is one of the most the other the negative of the subThe speaker paraphrased—the<br />\nvalued of Campus insignia.<br />\nject selected. The debate is so arfour frankly stated purposes- of<br />\nThe question was brought up ranged that one of the teams of<br />\nthe Y. M. C. A. in proof of his as to whether last year's directors, each institution<br />\ndebates at home<br />\ncontention that the organization Mr. Bochau of the Glee Club, while the other is the guest of one<br />\n. is a moving influence for Chris- and Mr. McCauley of the Mando- of the other schools. For example,<br />\ntian life on the campus. The Y. lin Club, should be retained. It if the negative team of Hopkins<br />\nwas the general opinion that the journeys to Washington and Lee,<br />\nM. C. A., said Dr. Swartz, stands<br />\nstandards of both organizations the latter's negative goes to the<br />\nfor pride in religious life, the abilwere higher than ever last season University of North Carolina, and<br />\nity to stand fearlessly for one's re- because of the efficient leadership<br />\nNorth Carolina's negative comes<br />\nligious beliefs. It stands for ser- of these men. High authorities to Hopkins. .<br />\nvice toward one's fellow men. It ;have compared the work of Johns<br />\nBesides these there is of course<br />\nstands for the study of the Bible, Hopkins-- Club favorably with the Junior-Senior debate. This is<br />\na study worth while for intellec- that of Dartmouth last year's in- always bitterly contested, due in<br />\ntercollegiate champions. As the the first place to the natural rivaltual as well as religious purposes.<br />\ntreasury will soon. be in a satis- ry between the two upper classes,<br />\nAs a climax of all its purposes, it<br />\nfactory condition, and as .the ap- and in the second place to the<br />\nstands for the promotion of high<br />\npropriation from the Student Ac- prize given the winning class, the<br />\ncharacter among college men. Dr.<br />\ntivities Council has been materi- Herbert B. Adams Trophy. The<br />\nSwartz, in this connection, made<br />\nally increased, it was unanimous- under classmen will stage a classic<br />\na comparison between the great<br />\nly voted that the officers of the of their own, a Freshman-Sophotree that falls in the storm because Club<br />\nshould be given full power more debate. This will probably<br />\nit is rotten at heart and the man<br />\nto negotiate with Messrs. Bochau be held in either December or Janof considerable intellect and high and<br />\nMacCauley, with view to uary.<br />\nrank who falls under pressure for their<br />\nre-engagement.<br />\na similar reason. The fall oTboth<br />\nAnother debate ..of importance<br />\nThe concert season will be<br />\non<br />\nthe schedule is that with the<br />\ncrash<br />\nneither<br />\nsurprises us; but<br />\nmuch shorter this year than last;<br />\nUniversity<br />\nof Maryland. This will<br />\nwould be amazing if all the facts<br />\nthe first concert being giN en early<br />\nbe<br />\nthe<br />\nheld<br />\nat<br />\nUniversity of Marywere known. Dr. Swartz's enin December, and the final land. The<br />\nCollege Parkers can<br />\ntire speech was characterized by<br />\npractice is expected to put the club<br />\nexpect<br />\nto<br />\nfind<br />\na Hopkins team deconvincing vigor and sincerity, in<br />\nfirst-class shape, so that the<br />\ntermined to get revenge for last<br />\nand did much to boost the cause<br />\nseason will open with a well oryear.<br />\nof the Y. M. C. A.<br />\nganized concert. The culmination<br />\nMr. Shaal, the secretary of the of<br />\nthe season will be the Home- So far it has not been definitely<br />\nY. M. C. A., pointed out that the wood Concert, which promises decided whether Hopkins will<br />\norganization wanted not only to be even better than last<br />\nyear's. have entrants in the Southern<br />\nmembers, but active members. He<br />\nThe first practice for the Man- Oratorical Contest.<br />\nseveral<br />\nways<br />\nwhich<br />\nin<br />\nmentioned<br />\ndolin Club was held yesterday at The outlobk for the team is far<br />\nmembers of the Association work. the Barn, with Mr. MacCauley on from bad. There are quite a few<br />\nThe Y. M. C. A. is a student or- hand as director. The tryouts for men from last year who will<br />\nganization, Mr. Shaal pointed out, the Glee Club Will be held Thurs- again come out. However, much<br />\nand whatever the Johns Hopkins day, 8 P. M., at the Barn. Mr. more material can be used and<br />\nstudents do for the Association Bochau will probably be present there is plenty of room for many<br />\nthey will be doing for themselves. President Croker emphasized the new men. Dr. French will issue a<br />\nTom Jenifer said a few words necessity of every man giving his call for candidates about the first<br />\nin explanation of the \"Good Morn- individual attention and best ef- of November and all who have had<br />\ning\" campaign started by the Sig- fort to the director. Lateness and experience in debating or would<br />\nma Chi Beta Honorary Fraternity. absences from rehearsals will not like to gain some are urged to atThe object of the movement is to be tolerated. The uniform will be tend.<br />\nget the Johns Hopkins students the same as in previous years:<br />\nas well acquainted with one an- dress suits for the Glee Club, tuxNOTICE<br />\nother as possible; and, in order to edos for the Mandolin Club and<br />\nattain this objective, it is only the Black and Blue Jay Six.<br />\nLacrosse organization meeting today in 110 M. E. Old<br />\nThe candidates were listed, the<br />\nnecessary for every one on. the<br />\nmen, new men, and candiCampus to greet every man he number being rather disappointdates for managerial posirecognizes as a Hopkins student, ing to the officers; 11 men signed<br />\ntions are asked to report.<br />\nby name as far as possible. The up for the Glee Club and 21 for<br />\nHowever,<br />\nMovement should prove beneficial the Mandolin Club.<br />\nTrack practice every Tuesto the college and to the individ- several old men were unable to atday and Friday afternoons.<br />\nand<br />\nthis is<br />\nual, for the formation of friend- tend the meeting<br />\nNew material desired.<br />\nContinued on page 2, col. 2<br /><br />\nContinued on page 2, col. 3<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS WINS OVER MT.ST. MARY'S<br />\nIN FIRST GAME AT HOMEWOOD FIELD<br />\nMountaineers Unable to Score Against Black and Blue<br />\nGridders in Opening Contest<br />\nShowing themselves to be by far the better team, Hopkins sent<br />\nthe Mt. St. Mary's gridders home last Saturday at the tail end of a<br />\n21-0 score. The Mountaineers were outclassed from the beginning of<br />\nthe game although they threatened the local squad on several occasions in the second half. The Black and Blue displayed but little of<br />\nthe promise shown last week against Princeton due, perhaps, to the<br />\nweakness of the Maryland team.<br />\nHopkins started the scoring<br />\nSOPHS VICTORS IN FIRST soon after the opening whistle<br />\nINTERCLASS BASEBALL<br />\nblew. The ball, having zig-zagged<br />\nGAME<br />\nup and down the field several<br />\nDarkness Halts Conflict After Six In- times,-finally came,into the posnings. Bushey Plays Stellar Role<br />\nession of the Black and Blue warin Field<br />\nriors. A series of speedy end runs<br />\nWednesday,• October . 10, the advanced the ball for two first<br />\nSeniors and Sophomores played downs, placing it on the thirtythe first game in the Interclass yard line. A clever pass from<br />\nBaseball League, the Sophs Taylor to Bonner made it possible for the sturdy J. H. U. capemerging victorious, 11 to 9.<br />\ntain to run it behind the goal line<br />\nThe game started at about 4.30 for the initial<br />\nscore of the game.<br />\nwith the class of '26 at bat. • Was- Turnbull kicked the pigskin beserman, first man up, got a base tween the bars on the try-foron balls. Chesney's hit and a sac- point.<br />\nThe next addition to the score.<br />\nrifice by Bald brought him in for<br />\ncame<br />\nin the second quarter. By<br />\nthe first tally of the game. Mcoutguessing their opponents conKay then hit one through the intinuously the local team kept the<br />\nfield .and Chesney scored.<br />\nball well within the visitor's terriThe Seniors evened the score, tory for most of the period. A<br />\nwhen they came to bat; Tebo sin- dashing attack through the line<br />\ngled, errors advanced him around enabled the Homewood lads to<br />\nthe diamond, and Lamar brought creep up to the four-yard line,<br />\nOates in with a clean hit.<br />\nfrom whence Turnbull carried it<br />\nThe second was livened up by for the second tally.<br />\nHopkins? triple and Bushey's catch<br />\nBonner's speedy end runs were<br />\nof Draper's long fly.<br />\nan outstanding feature of the secIn the third the Sophs added<br />\nond quarter. On numerous octhree more to their score and the<br />\ncasions he dashed past the eneSeniors got one more run.<br />\nmy's first defense for gains which<br />\nThe Seniors staged a rally in<br />\nthe up-State team could not<br />\nthe fourth and made four rims,<br />\ncheck. These gains put Hopkins<br />\nputting them one ahead. Tebo and<br />\nwithin striking distance several<br />\nNewman scored on errors and<br />\ntimes. but it was not until the end<br />\nO'Conno's hit brought in Oates.<br />\nof the half that they were able<br />\nAt the end of the inning it was<br />\nto make good their advantage.<br />\nbeginning to get dark and the rest<br />\nof the game was played in semi- In the second half Mt. St.<br />\nMary's launched an ariel attack<br />\ndarkness. .<br />\nwhich<br />\nworried the home team<br />\nIn the next inning Chesney's<br />\ntwo-bagger and Hopkins' single considerably. The greatest and<br />\ntied the score but the Seniors came most consecutive gain that the<br />\nright back with a .run in their half visitors made were by the forward<br />\npasses which they completed in<br />\nof the inning.<br />\nThe sixth inning was the last, ,the third quarter of the game.<br />\nbecause although a seven-inning 'Ruiz, the diminutive Mexican<br />\ngame had been planned, it was quarterback of the Emmitsburg<br />\nmuch too dark to continue. The eleven, tried time and again to get<br />\nSophs clinched the game :when past the Hopkins defense by this<br />\nDraper was passed and stole sec- means and more than half of his<br />\nond, went to third on • Wasser- attempts were successful. Twice<br />\nman's sacrifice and scored on the forward pass method gave the<br />\nCrook's single. Bald sacrificed, visitors an open . field, the first<br />\nMcKay tripled and then came in clear run being stopped by Bonon a passed ball. In the last half ner in dangerous territory and<br />\nof the inning, Oates scored on the second by Maxwell after<br />\nO'Connor's hit and gave the Campbell had carried the oval<br />\nSeniors their final tally.<br />\nforty yards toward the goal.<br />\nBen Thomas, captain of the VarThe Mt. St. Mary's air route<br />\nsity, acted as umpire and the line- was but little more<br />\nsuccessful<br />\nup was as follows.<br />\nthan Hopkins'. The local gridSeniors—Tebo, 1.f.; Newman, r.<br />\nders fooled their rivals at this<br />\nf.; Oates, C.; O'Connor, 3b.; Jeni- method<br />\nat times when the gains<br />\nfer, s.s. ;. Lamar, 2b.; Bushey, c. f.;<br />\nwere needed the most. Coach Van<br />\nWasson, lb., and Ashton, p.<br />\nOrman's charges also succeeded<br />\nSophs—Wasserman, s.s.; Townin pulling down three passes,<br />\nsend and Crook, 1.f. ; Chesney, 2b.;<br />\nwhich were intended for the other<br />\nBald, lb.; McKay, 3b.; Hopkins<br />\nteam's receivers.<br />\nand Brown, c.f.; Thomsen, r.f.;<br />\nHopkins' final touchdown came<br />\nLogan, c., and Draper, p.<br />\nin the last quarter after Carr had<br />\nScore by innings:<br />\nSeniors.... 2 0 1 4 1 1— 9 intercepted a pass from Ruiz to<br />\n2 1 3 0 1 4-11<br />\nSophs<br />\nContinued on page 3 col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nMould be sent to the MANAGING EDITOR.<br /><br />\nHomewood 100<br /><br />\nTelephone<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24.<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25.<br /><br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24.<br /><br />\nAdvertising Manager<br /><br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24.<br /><br />\nFITZGERALD DUNNING, '24.<br />\nCirculation Manager<br /><br />\nAssociate Editors<br /><br />\nJOHN C. LEWIS, JR., '24.<br /><br />\nRICHARD C. TILGHMAN,'25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br /><br />\nAssistant Business Managers<br /><br />\nJunior Editors<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nLEO C. MUTH, '24.<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26.<br />\nCHARLES G. HUTZLER, '24.<br /><br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIESKE, '25.<br />\nJOHN T. DIXON,'24.<br />\nA. J. McKAY, '26.<br />\nC. EUGENE TOVELL, '24.<br />\nOTHO J. KELLER, III, '25<br />\nJ. JACKSON KIDD, '26<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBaltimore, Md., OCTOBER 16, 1923<br /><br />\n1924 JUNE WEEK<br />\n1923 June Week, the report of which is printed in this issue of<br />\nThe News-Letter, was an undisputed success, financially and otherwise. No previous event or series of events has ever given the University as much advertising throughout the city or has brought into<br />\nplay as much college spirit as did the delightful affairs which culminated in the never-to-be-forgotten Senior Ball at the Hotel Betvedere. Our only misgiving is that it will be extremely difficult for<br />\nother June Weeks to equal the one of 1923.<br />\nAs Thomas M. Landy, Chairman of 1923 June Week Committee,<br />\nintimates, there were times last spring when financial success received a faint hope, a vague dream. Hopkins had never seen a June<br />\nWeek before and skeptics and conservatives needed much persuasion<br />\nbefore they decided to co-operate. Indefatigable work by certain<br />\nstudents of the University, however, succeeded in bringing about the<br />\nsuccess, of which all upper classmen are not only cognizant, but arc<br />\nproud.<br />\nThe task of the 1924 Committee should not be as difficult. The<br />\npioneers have gone ahead and laid low the worst enemies—skepticism and doubt---and it should not be difficult to dispose of tickets.<br />\nThere is', however, much to be accomplished if the affairs next June<br />\nare to equal in brilliance and charm the festivities of 1923. It is essential that the Committee begin functioning immediately.<br /><br />\n\"GOOD MORNING\"<br />\nAt a recent meeting of the Sigma Chi Beta Society a \"cheery good<br />\nmorning\" was approved as \"the best possible means of promoting<br />\na more friendly attitude among the students at Homewood.\" For<br />\nthe past several years various organizations on the campus have<br />\nmade desultory attempts to install the \"Hello\" system. These attempts however, invariably died from lack of nourishment and it was<br />\nnothing unusual for Hopkins men to pass each other without a sign<br />\nof recognition.<br />\nWith the advent of the Freshman regulation making it compulsory for first-year men to speak to all upper classmen, conditions<br />\nhave begun to improve. The upper classes, recognizing the betterment of spirit that is being obtained, are returning the Freshmen's<br />\ngreetings and are beginning to adopt the habit themselves.<br />\nHopkins is handicapped in many ways because of the fact that it<br />\nis a \"small college.\" It should, therefore, utilize all advantages issuing from this condition. The size of the student body at Homewood makes it possible for every Hopkins man to recognize every<br />\nother Hopkins man. A state of affairs which does not exist at larger<br />\nuniversities.<br />\nWe suggest that the entire student body adopt Sigma Chi Beta's<br />\nrecommendation of a \"cheery good morning.\"<br /><br />\nATHLETIC OFFICIALS ENDORSE JENIFER ELECTED CHEER LEADER<br />\nAT A. A. BOARD MEETING<br />\nFROSH FOOTBALL AND VARSITY BASKETBALL<br />\nBesides electing the manager<br /><br />\nENGINEERS GET REAL SAMPLE OF CONDITIONS IN<br />\nTHE LIFE HEREAFTER<br /><br />\nThe athletic authorities have for the 1923-24 basketball squad,<br />\ndecided to have a separate Fresh- the athletic board discussed many<br />\nman football team, with Tom matters of other business at its<br />\nLandy, last year's football captain, first meeting held at the Barn<br />\nas coach. The team will play last Monday night. The selection<br />\ngames with prep school teams in of a cheer leader, the voting of<br />\ntown and will finish the season letters to last year's swimming<br />\nwith the Soph games after the team and suggested changes in<br />\nVarsity schedule is completed. the constitution of the Athletic<br />\nAt present there are about Association were chief among<br />\ntwenty men working out with these topics.<br />\nThe meeting was not -unaniLandy. A bigger squad would<br />\nmake the team's prospects bright- mously attended by the members<br />\ner. Coach Van Orman may use of the board due, perhaps, to the<br />\nthe squad to learn formations and short space of time allowed for<br />\nplays of the opponents of the its announcement. There were<br />\nVarsity, so they can demonstrate there, however, a quorum so the<br />\nthem, enabling the Varsity to business of the body was not deplan a defense to meet the differ- layed by the small attendance.<br />\nBuck Bonner, president of the<br />\nent styles of play. This work<br />\nis of splendid aid to the Fresh- Athletic Association, appointed a<br />\nman who knows little football, as committee to draw up a new plan<br />\nhe learns different styles of play of election to the Board. The<br />\nand ways of meeting them. Al- committee was instructed to draw<br />\nmost as much experience can be up an amendment to the constiobtained in this way as in partici- tution, by which the officers of<br />\nthe board will be those seniors<br />\npating in games.<br />\nAt the Athletic Council meet- having the highest votes in the<br />\ning on Wednesday, it was official- popular election. This would<br />\nly decided to put on a basketball avoid the elimination of many<br />\nteam. A qualified coach will be good men which has formerly<br />\nhired in a few days and the men been a great fault at Hopkins.<br />\nThe board officially appointed<br />\ncalled out about the middle of<br />\nTorn<br />\nJenifer head cheer leader for<br />\nNovember. The A. A. is putting<br />\nthe<br />\nyear.<br />\nIn his appointment he<br />\non basketball at the request of<br />\nwas<br />\nrecommended<br />\nto issue a call<br />\nthe student body and the authorifor<br />\nassistant<br />\ncheer<br />\nleaders in orties have put it up to the student<br />\nder<br />\nthat<br />\nthere<br />\nmay<br />\nbe<br />\ntrained men<br />\nbody to support the team. The<br />\nto<br />\nfill<br />\nthe<br />\nposition<br />\nin<br />\nfollowing<br />\nFifth Regiment Armory has been<br />\nobtained for practice and games. years. It was also suggested that<br />\nGames will be played every Sat- the head cheer leader hold pracurday night during the months of tices to acquaint the candidates<br />\nJanuary and February. As in with the fundamentals of this imformer years, an informal dance portant office.<br />\nxvill follow all games.<br /><br />\nJunior and Senior Engineering Students<br />\nFind Duplicates of \"Devil's Delights\" at Steel Plant<br /><br />\nAn excellent sample of the conditions in the life hereafter was afforded a group of junior and senior<br />\nengineering students last Friday<br />\nafternoon at the Sparrows Point<br />\nSteel Plant of the Bethlehem Steel<br />\nCorporation. The group, under<br />\nthe guidance of Prof. Alexander G.<br />\nChristie and Associates William<br />\nB. Kouwenhoven and Frank W.<br />\nKouwenhoven, of the Mechanical<br />\nEngineering Department, was<br />\nconducted through the plant as a<br />\npart of the course in Materials of<br />\nEngineering. In order to obtain<br />\na better view of the various processes, the students had to approach within a few feet of a blast<br />\nfurnace discharging liquid red-hot<br />\niron; stand on a small bridge a few<br />\nfeet above rolls pressing red hot<br />\nrails; and stand an a small observation tower a few feet from a<br />\nladle dumping several hundred<br />\ntons of molten slag. The terrific<br />\nheat, the blinding light and deafening crackle caused by these processes combined to form as realistic a hell as anyone could desire.<br />\nAt one time the effect was heightened by the ghastly glare caused<br />\nby the action of an automatic generator cut-out switch.<br />\nThe inspection party met at<br />\n12 o'clock in Machinery Hall,<br />\nHomewood on Friday and proceeded to the Sparrows Point<br />\nplant on the 12.15 car. The inspection tour covered the coke<br />\novens, the blast furnaces, the open<br />\nhearth furnaces, the rolling mills<br />\nand the powerhouse.<br /><br />\nAVERAGE AGE OF FRESHMAN CLASS IS SOMEWHAT<br />\nHIGHER THAN USUAL<br />\nThis year's Freshman class at<br />\nClass last Wednesday at 12:20, the Heights is exceptionally maships is one of the most desirable Robert Middleton was unani- ture—in point of years at least.<br />\nthings about college life.<br />\nmously elected the class's repre- Although it has always been cusGardner, the president of the sentative to the Student Coun- tomary to depict an angel-faced<br />\nCotillion Club, announced that the cil.<br />\nstripling as the typical Freshman,<br />\nClub would hold dances in the C.<br />\nRalph Townsend, president of while the typical Soph was picE. Hall after the Saturday foot- the class, warned the members tured as a more mature individuball games. He announced also to be on the lookout for Fresh- al, the age level of the Class of '27<br />\nthat, according to present plans, men who break the regulations. ,is fully as high as that of their '26<br />\ntwo cotillions would be held be- He declared that many of them rivals, being well over nineteen<br />\nfore Easter, and one during June neglect the regulation requiring years. In point of size the situaWeek.<br />\nthem to speak to every one on the tion pictured in humorous college<br />\nHugh Smallwood, President of campus.<br />\nmagazines is almost exactly rethe Barnstormers' Club, called_ for<br />\nIt was decided that in the fu- versed, the Freshmen having pracactive support for the musical ture Sophomores will hand in the tically a monopoly on the iceman<br />\ncomedy to be given this season in names of erring Freshmen to the or coal heaver type of physique, as<br />\nplace of the usual serious produc- Pep Committee if it is found to be many Sophs learned to their sortion. Work on the production is inconvenient to administer correc- row during the recent tussle<br />\nwell under way, but a great deal tive measures immediately upon around the Fountain of Knowlof work will be necessary to over- the committing of the fault. The edge. It was claimed by the officome the handicap of inexperi- handling of such cases will then cers down at the Military Barence. He called a meeting of men • be entrusted to the discretion of racks that more six-footers enterwho are interested in the work the committee.<br />\ned this year than in any other<br />\nimmediately after the assembly.<br />\nThe class also decided to allow year.<br />\n•Dr. Gough, of the Johns Hop- last year's dues of $2.50 to pre- However, this advanced age and<br />\nkins School of Hygiene and Pub- vail again this year.<br />\nsize of our campus infants is not<br />\nlic Health, made a few remarks in<br />\ndue to any \"better babies camThe University of Virginia ex- paign\" or to the fact that their<br />\nconnection with the Public Health<br />\nService questionnaires that were pects to open its new gymnasium mentality could not cope with the<br />\ndistributed last Thursday. The in time for the coming basketball many problems of high school as<br />\nobject of the questionnaires is to season. It will be called the Me- readily as that of their predecessecure definite and concrete infor- morial Gymnasium, in honor of sors. It is chiefly due to the fact<br />\nmation about common colds to alumni killed in the World Wa. hat only a part of the '27 aggrega—Yellow Jacket. tion entered N. Y. U. directly<br />\nform a basis for scientific investigation of the subject. Those who<br />\nfrom preparatory schools.<br />\nTILGHMAN ELECTED PRESIDENT<br />\nare willing to help in the work<br />\nA very large proportion of the<br />\nMANAGER MUSICAL CLUB<br />\nincoming men have spent anyneed only fill out forms that will<br />\nContinued from page I<br />\nbe sent them every two weeks thought to have been the case where from one to five years out<br />\nduring the academic year. Col- with a number of others. Be- in the cold world after receiving<br />\nlege men are being asked to do cause of the importance of an their high school degree, and are<br />\nthe work because it is thought re- early start such men should reg- consequently much older and largliable information can be secured ister with Sater or Croker and be er than Freshmen of previous<br />\nfrom them. All communications present at the tryouts. It is years. Some have been compellin regard .to the subject will, of hoped that more men will sign up ed to do so by the necessity of<br />\ncourse, be confidential.<br />\nin order that the club will be able earning and saving enough money<br />\nThe assembly closed with a to have a larger field from which to end strikes and labor disputes.<br />\nto select its members.<br />\nshort yell practice.<br />\n—New York University News.<br /><br />\nMIDDLETON ELECTED SOPHOMORE<br />\nDELEGATE TO STUDENT<br />\nSTUDENT AFFAIRS AGAIN PREDOMCOUNCIL<br />\nINATE AT STUDENT ASSEMBLY<br />\nAt a meeting of the Sophomore<br />\nContinued from page 1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br />\nFINANCIAL REPORT JUNE WEEK, ORGANIZATION MEETING OF BATTLE FOR VARSITY POSITIONS Carter<br />\nJUNE 18TH, 1923<br />\nBEING WAGED AT HOMEWOOD Taylor<br />\nELECTRICAL CLUB TO BE<br /><br />\nRG<br />\nQB<br />\nMaxwell<br />\nRH<br />\nSchacht<br />\nL.T<br />\nBarton<br />\nL.G<br />\nWolbert<br />\nR.E<br />\nRich<br />\nRT<br />\nBonner (cap.).L.H<br />\nTurnbull<br />\nFB<br /><br />\nLIABILITIES<br /><br />\n3<br />\nMoore<br />\nGrogan<br />\nRuiz<br />\nDanker<br />\nH. Morey<br />\nCampbell<br />\nD Morey<br />\nH Riley<br />\nJ Riley<br /><br />\nThe great increase in likely footHELD FRIDAY<br />\nball<br />\nmaterial which has taken<br />\nThe Johns Hopkins Electrical<br />\nTo Hotel Belvedere<br />\nplace<br />\nat Homewood Field lately<br />\n(food, space, punch) $1,987.50 Club will begin its activities for<br />\nhas<br />\nmade<br />\nthe fight for positions on<br />\nthe currerit year at 4.15 P. M. on<br />\nTo Penn. Serenaders (10<br />\nthe<br />\nJ.<br />\nU.<br />\nH.<br />\nfootball team a deadly<br />\n680.00 Friday, October 19, with an organ- one. With<br />\nhours playing)<br />\nample stock of playan<br />\nization meeting in Room 104 of<br />\nTo E. A. Wright Co<br />\ners<br />\nto<br />\nselect<br />\nfrom,<br />\nCoach Van Orthe<br />\nMechanical<br />\nEngineering<br />\n(1,000 leather proBuilding. The speaker of the oc- man has withheld the awarding of<br />\nScore by periods:<br />\n500.00<br />\ngrams)<br />\ncasion will be Mr. J. V. Alfriend, permanent berths on the squad Hopkins<br />\n7 7 0 7-21<br />\nTo Loane Bros. (canvas<br />\nJr., a graduate of the Hopkins until he is certain that he has the Mt. St. Mary's<br />\n0<br />\n0 0 0- 0<br />\nfor dance floor)<br />\n175.00 Electrical Engineering Depart- best man for the job. The line-up<br />\nSubstitutions-Hopkins: MilaTo Bachrach Rasin Co<br />\nment and a former member of the in the Princeton game was merely<br />\nYou'd be surprised at what<br />\n(fireworks)<br />\n138.00 club. He will take as his subject, temporary and several li,anges are nausky for Barton, Berndt for<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\nTo Fishers Orchestra<br />\n\"Student Activities at Westing- expected to take place before the Schact, Carr for Day, Slowik for<br />\ninstance-his clothes are<br />\nCarter;<br />\nend<br />\nMt.<br />\nof<br />\nMary's:<br />\nSt.<br />\nthe<br />\nByrne<br />\n1923<br />\nseason.<br />\nfor<br />\n216.00 house.\"<br />\n(June 11 and 12)<br />\ndreams and his grooming an<br />\nThere are four particularly hard- Johnson, Abby for Harry Riley,<br />\ninspiration.<br />\nThe club is now making a drive<br />\nTo Young's Orchestra<br />\nHe gets that finely turned-out<br />\nfought struggles for Varsity J. Bonner for Abby, Johnson for<br />\nhead from\"Vaseline\"HairTonic.<br />\n115.00 for members. Although it is not<br />\n(June 9 and 11)<br />\nIt smooths and grooms the hair.<br />\na student branch of the American berths now going on within the Byrne, Ramik for H. Morey, MarTo Balfour Co. (favors,<br />\nAt all drug stores and student<br />\ntin<br />\nfor<br />\nranks<br />\nCampbell,<br />\nof<br />\nthe<br />\nBlack<br />\nCampbell<br />\nand Blue squad.<br />\nfor<br />\nbarber shops.<br />\nJune 12)<br />\n525.00 Institute of Electrical Engineers, Berndt's position<br />\nEvery\"Vaseline\"Product is<br />\noore, Gallagher for Grogan,<br />\nat end is a troit requires that all its members<br />\nrecommended everywhere<br />\nTo Burns Co. (1,000<br />\nbecause<br />\nof its absolute puphy<br />\nHarry<br />\nwhich<br />\nRiley<br />\nfor Abby, McMorris<br />\nShacht is seriously<br />\nshall be student members of the<br />\nrity and effectiveness.<br />\n43.50<br />\npaper dance programs)<br />\nthreatening<br />\nfor<br />\nHarry Riley. Touchdownsto take away from<br />\nInstitute, and accordingly the club<br />\nOverhead (see below- for<br />\nobtains all of the advantages ac- him. Magill, for two years regular Turnbull (2), Bonner. Tries for<br />\n985.72 cruing from affiliation with<br />\nitemized account).._<br />\nthe In- tackle, has a strong rival in Car- point-Turnbull (3) (by placestitute without any of its restric- ter, a student at the Medical ment, Bonner holding ball). RefTotal expenditures... .$5,365.72 tions. All juniors and seniors of School. Milanausky and Barton, eree-Farrier, Dartmouth. Umthe Department of -Electrical En- both of whom have been trying pire-Clinton, Yale. Head linesChesebrough fg;Co.<br />\nOVERHEAD<br />\nfor years to make the team, are man-Sigmund, Lafayette. Time<br />\ngineering are invited to join.<br />\n(consolidated)*<br />\nwaging a fierce struggle for the of quarters-15 minutes.<br />\nLanterns (for decorating<br />\nguard position. Cromwell's gradcourts)<br />\n$45.00 From fraternity booth<br />\nuation from. the university left<br />\nfees<br />\nLumber (booths and floor<br />\n225.00 open<br />\nthe job of center, for which<br />\n101.52 From sale of lumber<br />\n51.00<br />\nin gardens)<br />\nCarr and Day are fighting with all<br />\nFor printing tags<br />\n10.00 From sale of extra prothey have.<br />\n136.00<br />\nFor printing tickets,<br />\n2.50 grams and favors<br />\nAnd these are not all of the<br />\nFrom special admissions<br />\nTelegrams, picture and<br />\ndoubtful places in the future line274.00 up.<br />\nstamps<br />\n9.08 at gates<br />\nCoach Van Orman has the<br />\nCrystal ball (as decoratools to work with and he intends<br />\n$5,486.94<br />\ntion)<br />\n5.00 Total assets<br />\nto pick the tool best adapted to<br />\nTotal<br />\nexpenditure<br />\ns<br />\n5,365.72 serve<br />\nSenior prizes (class day)<br />\n37.25<br />\nthe purpose that he wants it<br />\nFlowers (committee •at<br />\nto accomplish.<br />\ndances)<br />\n5.50 Balance in bank (to be<br />\nheld for action of 1923<br />\nHOPKINS WINS OVER ST.<br />\nIncidentals (paint, brush)<br />\n.50<br />\nclass)<br />\n$121.22<br />\nMARY'S<br />\nTo J. H. U. (lights for<br />\n(Signed)<br />\nHoward<br />\nB.<br />\nHensel.<br />\n2.00<br />\n,Continued from page 1<br />\nnight work)<br />\nTreasurer June Week Committee. Campbell<br />\nO one smokes<br />\nFor circus (Muller's act,<br />\nin the shadow of the<br />\nApproved<br />\nby<br />\nDr.<br />\nR.<br />\nV.<br />\nD.<br />\n$7, horses, $9)<br />\ngoal posts.<br />\nMelachrinos<br />\n16.00<br />\nThe Mountaineers<br />\nagg-ofin.<br />\nTo- Maryland Auto Club<br />\nwere unable to stop the succeswithout liking them<br />\n(Signed) Thomas M. Landy. sive<br />\n(watching cars, June 9,<br />\nline plunges which resulted<br />\nChairman June Week Committee. in<br />\n-for their quality<br />\n10 and 11)<br />\n13.00<br />\nthe last J. H. U. tally. HopOur<br />\nbooks<br />\nare<br />\nopen<br />\nfor<br />\nall<br />\nto<br />\nTo Young's Orchestra<br />\ninstantly wins apkins almost scored again a few<br />\nexamination.<br />\n(extra, cabaret, June<br />\nminutes after, but the final whistle<br />\npreciation.<br />\nThe 1923 June Week Committee<br />\n11)<br />\n15.00<br />\nannounced the cessation of hoswishes to take this opportunity to<br />\nTo Black Bros. (decorattilities with the ball within ten<br />\nthank<br />\nthe Hopkins student body yards<br />\ning Belvedere)<br />\n250.00<br />\nof the zero line.<br />\nTo J. H. U. for labor<br />\n100.00 and the other Hopkins friends and<br />\nDoug Turnbull consistantly<br />\nORIGINAL<br />\nboosters who did so much to make<br />\nTo Phillips Brothers<br />\noutkicked the Mt. St. Mary's<br />\n43.68 the first June Week such a suc- punter. His toe more than recov(bunting for booths)<br />\n.82 cess.<br />\nPostage<br />\nering the distance which the vis\"The One Cigarette Sold the World Over\"<br />\n.60 We likewise take this opportun- itor's ariel attack had netted them.<br />\nPencils<br />\nity to thank the faculty for the<br />\nPrinting (invitations,<br />\nTurnbull had little luck with the<br />\nloyal support they accorded our<br />\n$10; programs, S8.75).<br />\n18.75<br />\nfour placement kicks which he<br />\nwild dreams, the realization of<br />\nDecorations (paint, patried. Three times the ball sailed<br />\nwhich<br />\nwe sometimes doubted ourper, etc.)<br />\n7.83<br />\nwide from the goal posts, deprivHammer and nails<br />\n1.75 selves. In brief we shall sing our ing Hopkins of the three points<br />\nswan song (if our vanity may be<br />\nCandles<br />\n.65<br />\nwhich each would have added to<br />\npardoned) by once more quoting<br />\nTo feed soldiers from<br />\nthe score. The fourth attempt at<br />\nourselves, that \"if we have secured<br />\nCamp Meade who came<br />\na field goal was broken up by two<br />\na<br />\nwith machine guns)<br />\n10.80 closer relation between the alum- Emmitsburg players who broke<br />\nni and their alma mater; if we<br />\nFor policemen's services<br />\n30.00<br />\nthrough the Hopkins line before<br />\nhave<br />\nkindled in our undergraduTiPs to Belvedere (head<br />\nBonner could get the ball in place.<br />\nwaiter and floorman)<br />\n10.00 ates a deeper love for their UniBoth teams made several subversity, then we shall feel that our<br />\nNat'l Novelty Co. (heads<br />\nstitutions<br />\nduring the contest, the<br />\nefforts have not been in vain.\"<br />\nfor circus &amp; balloons)<br />\n17.00<br />\nHopkins coach limiting his extra<br />\nTHOMAS M. LANDY, men<br />\n\"or electrician's services.<br />\n10.00<br />\nto four; Mt. St. Mary's makChairman for the 1923 Class.<br />\nFor maid and janitor<br />\nbig ten changes in the line-up.<br />\n8.00<br />\nservice<br />\nCoach Van Orman made these<br />\nFor printing a letter (cirsubstitutions in order to try the<br />\n1.25<br />\ncular)<br />\nLOST<br />\ngame power of the squad.<br />\nR. H. Braxton (labor and<br />\nOne brief case containing<br />\nLine-up:<br />\nPiano, Mon., June 11)<br />\n32.00<br />\none Carnahan's Grammar.<br />\nHopkins (21).<br />\nMt. S. Mary's (0)<br />\nFor chairs on Class Day.<br />\n53.48<br />\nL. Stulman, P. 0. Box 503.<br />\nMagill<br />\nL.E<br />\nJohnson<br />\nTo Gas Co. (lights for<br />\nDay<br />\nDesmond<br />\ncircus)<br />\n1.76<br />\nTo Md. Casualty Co.<br />\n(rental of hall, June 11) 125.00<br /><br />\nSOPHISTICATED<br /><br />\nVaseline<br />\nHAIR TONIC<br /><br />\nN<br /><br />\nMELACHRINO<br /><br />\n(STETSONOc-P<br /><br />\nTotal<br /><br />\n$985.72<br />\nASSETS<br /><br />\nProm<br />\nFrom<br />\nProm<br />\nFrom<br />\nFrom<br />\nFrom<br /><br />\ntag days<br />\n$564.33<br />\ncandy sale at play<br />\n53.36<br />\nsale of tickets<br />\n3,660.00<br />\nbenefit dance<br />\n15.25<br />\nHullabaloo<br />\n58.00<br />\npatronesses<br />\n450.00<br /><br />\nThe college man wants \"English\" in his<br />\nclothes. We give it to him.<br /><br />\nelaac<br /><br />\nY-Agrwri-<br /><br />\nBALTIMORE AND HANOVER<br /><br />\nBats<br />\nOne big advantage of a Stetson is that<br />\nyou can give it so much wear-and<br />\nit will still keep its shape and style.<br />\nSTYLED FOR. 'YOUNG MEN<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 16, 1923<br /><br />\n4<br /><br />\nPROF. GREGORY ADDRESSES TAU BETA PI HONORARY<br />\nFRATERNITY ASSOCIAINITIAL MEETING OF<br />\nTION TO HOLD MEETC.<br />\nE.<br />\nA.<br />\nS.<br />\n'<br />\nS<br />\nSANFORD<br />\nand individuality is offered here at prices that are not<br />\nING THURSDAY<br />\nProfessor John H. Gregory,<br />\nFOUNTAIN PEN INK<br />\nand cannot be underquoted by any house at any time.<br />\nThe Maryland Alpha Chapter<br />\nhead of the civil engineering de41 Besides the reputation of an old-established firm<br />\nWill Improve the Action<br />\nof the Tau Beta Pi Honorary Enis back of each sale with a guarantee.<br />\nof Any • partment, was the principal speak- gineering Fraternity, situated at<br />\nof<br />\nmeeting<br />\norganization<br />\ner<br />\nat<br />\nthe<br />\nFountain<br />\nJohns Hopkins, will hold an orthe Hopkins Student Chapter of ganization meeting Thursday<br />\nPen<br />\nthe American Society of Civil En- night at 8 o'clock in the Mechani- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\n•<br />\n-,,,,Inilintoui11111111<br />\ngineers, held last Fri(lay, October cal Engineering Building.<br />\nALL<br />\n343 NORTH CHARLES STREET<br />\nCOLORS<br />\n12, at 8 P. M., in the C. E. Build- *This society performs the same<br />\nSat;?°t6S<br />\nfunction in engineering that the<br />\nP<br />\n(),,<br />\ning.<br />\nEA\"I'el!\"4K<br />\nfOINAINPD-C<br />\nALL<br />\nPhi Beta Kappa does among the<br />\nB`c17)§,V.T4°<br />\nSIZES<br />\nUpon the suggestion of Profesarts and sciences. It differs, how•<br />\nsor Gregory, several changes were ever, from the latter society in<br />\n\"The Ink That Made<br />\ninaugurated into the methods of that it requires of its members not<br />\nPossible\"<br />\nThe Fountain Pen<br />\nprocedure of the organization. only excellence in scholarship,<br />\nOne of the most important of but also participation in school acthese was that semi-monthly talks tivities, loyalty to school and fellow students, and evidence of a<br />\nfollowed by general discussion,<br />\nleading personality.<br />\nwould be given by members of<br />\nThe total number of men from<br />\nthe Society.<br />\nany class who are eligible to memOne important suggestion of bership is restricted to one-fourth.<br />\nProfessor Gregory was that the lie man .who stands highest in<br />\njoint executive committees of the the test stated above is invited to<br />\nLimited<br />\nthree engineering societies at Join the society at the beginning<br />\nHopkins meet to discuss the hold- of his junior year. The first oneBARN CAFETERIA ing of three combined- meetings eighth of the class is eligible for<br />\na year, into each of which the en- membership at the end of the.<br />\ntire force of all the chapters would third year. The remaining onebe put. This was not acted upon eighth of the class is eligible durWrite your \"copy\" on a Remington Portable.<br />\nat this meeting, but will, in all ing the fourth year. Men who<br />\nClean,<br />\nlegible copy will catch the editor. Use the<br />\nprobability, be taken up in the have attained distinction as alummachine also for your everyday work and persona)<br />\nnear future.<br />\nni are also eligible.<br />\ncorrespondence. You will be surprised how much<br />\nProfessor Gregory stressed' the<br />\nThe emblem of the society contime and labor it will save.<br />\nfact that members of the Student sists of a gold watch charm, in<br />\nCompact—fits in a case only four inches high.<br />\nChapter were allowed to attend all the form of the bent of a trestle,<br />\nConvenient—you can use it on your lap, if you wish, for it<br />\ncarries its table on its back.<br />\nthe meetings of the parent soci- inscribed with the owner's name,<br />\nComplete—with four-row keyboard,like the big machines,ani<br />\n\"The King of Lubricants\" ety, as they are non-voting mem- chapter and certain secret symother 'big machine\" conveniences.<br />\nbers. He also spoke of the fine bols.<br />\nPrice, complete with case,$60. Easy payment terms if desired<br />\nSHERWOOD BROTHERS, INC.<br />\nopportunity for discussion of curThe Hopkins Chapter was inUNNEICIEREICIECIEEglEICIECIEECINEHEIE rent engineering problems afford- stalled in 1910 through the efforts<br />\ned by the meetings.<br />\nof Professor Alexander G. ChrisCopies of booklets telling of the tie,<br />\nhead of the Department 9f Meaims and activities of the AmerBoys, the place to get your<br />\nchanical Engineering. The offiican Society of Civil Engineers<br />\nmeals—and they are honcers of the chapter who were electwere distributed to the members ed at the end of last year<br />\nare J.<br />\nest-to-goodness meals, well<br />\npresent. This presenting of the Edward<br />\nMount, president; Lawserve do and reasonably<br />\ncurrent literature of the society rason R.<br />\nKent, vice-president; J.<br />\npriced—is at<br />\nto the chapter members will be Tillotson Dixon, treasurer;<br />\nHugh<br />\nmade a feature of the program of Smallwood,<br />\ncorresponding secrethis year.<br />\ntary and Lee Kinsey, recording<br />\nFrederick L. Moehle was apsecretary. William North Crout<br />\npointed chairman of a member- is an<br />\nassociate editor of the naship committee to tell those men<br />\ntional publication of the society,<br />\neligible for membership the ben1817 N. Charles St.<br />\ncalled the \"Bent.\"<br />\nefits of the Society. This com(Half Block below North Ave.)<br />\nmittee will also invite the civil en- MAJOR GAREY TO BE INAUGUgineering freshmen to attend all RATED AT ST. JOHN'S NEXT WEEK<br />\nNicholas Brown, Mgr.<br />\nregular meetings as guests.<br />\nThe inauguration of Dr. Enoch<br />\nAt the Washington Monument<br />\nThe next meeting of the chap- Barton Garey, the new president<br />\nNECKWEAR ter will be held next Friday, Oc- of St. John's College, will be held<br />\nSHIRTS<br />\nOscar Thomas Olson, D.D.<br />\ntober 26, at 4.15 P. M. The speak- at Annapolis on the afternoon of<br />\nMinister<br />\ner will be Mr. Frederick L. October 25. Appropriate cereI()ehle, a civil engineering senior, monies .are being formulated by<br />\n421 N. HOWARD ST.<br />\nHopkins Students Are Invited to<br />\nwho will have as the title of his the Board of Visitors and GoverGLOVES<br />\nHOSIERY<br />\nMake This Their Church Home<br />\npaper \"Some Practical Problems nors and the Alumni of the Colin Present Day Construction.\" lege.<br />\nThe purpose and program of this<br />\nThe talk will be profusely illusThe inaugural will be followed<br />\nChurch will appeal to you. Look in<br />\ntrated by slides.<br />\nby a visit of inspection by repreon the Sunday afternoon -At Home\"<br />\nPrinters of Philological and<br />\nsentatives of the General Educafrom five to seven..<br />\nScientific Works<br />\ntion Board of New York. A genBOGUS<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nSunday morning worship at 1 1 o'clock.<br />\nA man complained because he eral survey of the College will be<br />\nwas unable to \"cash in on a good made with a view to determining<br />\nSunday evening service at 8 o'clock.<br />\nreputation.\" He probably couldn't what financial assistance may be<br />\nMusic by vested chorus—choir of soloists.<br />\nfind any one to indorse it for him. given in addition to the endowment being raised by the alumni.<br />\n—Topeka Capital.<br />\nALL SEATS FREE<br />\n\"At the heart of the City\"<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nI<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nMake Your College Paper<br /><br />\nPER<br /><br />\nKOn02 0111115<br /><br />\nernington<br />\nPortable<br /><br />\nThe St. REGIS<br /><br />\nJIM<br /><br />\nFr<br />\nJu<br />\nse(<br />\nric<br />\nthi<br />\nan<br /><br />\nSC(<br /><br />\nfie<br />\nin<br /><br />\nth<br />\nrn.;<br />\nfr(<br />\non<br />\nha<br />\nIn<br />\nin<br /><br />\n\\A)<br />\nin,<br />\nor]<br /><br />\nan<br /><br />\nto<br />\nge<br />\nin<br />\n1VI<br />\nSi<br />\nSt,<br />\nP;<br />\n10<br /><br />\nin<br /><br />\nto<br /><br />\nRESTAURANT<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nJa<br />\n1);<br />\nrf<br /><br />\nV\\i<br />\nne<br /><br />\nLeFranc &amp; Ault<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nFROSH PUT OVER SEASON TICKET CAMPAIGN<br />\nThe Freshman Class deserves praise for the way they<br />\nhave handled the football season tickets. Graduate Manager Keyes made the following statements:<br />\n\"The Season Ticket Sale this year is the best ever had<br />\nfor football due to co-operation of the Freshman Class. Last<br />\nyear we employed a publicity man to manage the sale and<br />\nnetted only nine hundred dollars ($900.00). This year our<br />\npresent net profit on the sale is one thousand and fifty-one<br />\ndollars ($1,051.00) and subscriptions are still coming in.<br /><br />\nPrinters or<br /><br />\nThe Johns Hopkins<br />\nNEWS-LETTER<br />\nLOMBARD and<br /><br />\nSOUTH<br /><br />\nSTREETS<br /><br />\n\"Johns Hopkins needs backing more than ever this year<br />\nas the city with its Stadium will make a big cut in our receipts.<br />\nThe thing for every Hopkins man to do is to talk Hopkins<br />\nfootball to every man, woman and child he sees.\"<br /><br />\nRENT A CAR<br />\nDrive It Yourself!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />\ntc<br />\nel<br /><br />"}], "field_media_file": [{"target_id": 37773, "display": null, "description": null, "target_type": "file", "target_uuid": "ab97b915-ce5a-40cd-b6ee-61b361979acc", "url": "http://digital.library.jhu.edu/system/files/2022-03/13076-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13076, "target_type": "node", "target_uuid": "4dcb51ce-3d2b-42fe-aea0-b1fe86817da8", "url": "/node/13076"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "1fa24752-9acd-4e5d-a3f4-04174db99cdf"}]}