{"mid": [{"value": 35677}], "uuid": [{"value": "ed65dafc-0fcf-4beb-a80a-447a52280d8d"}], "vid": [{"value": 35677}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12216-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "\fTHE .02 TRACK AND FIELD SQUAD.<br />\n<br />\n\fCOMMENCEMENT NUMBER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nJUNE 4, 1902.<br />\n<br />\nNo, 17.<br />\n<br />\n'THE BALTIMORE EXPERIMENT\" AND ITS SUCCESS.<br />\n<br />\n5<br />\n<br />\nOR the past twenty-five years, the Johns Hopkins University has held<br />\na position that is unique in the educational history of our country,<br />\nand during this time has come to stand for the most progressive ideals<br />\nin her educational life.\" This recent appreciation from a leading Southern<br />\ncollege but expresses for the South . what President Eliot and President Harper<br />\nso graciously and generously voiced for the North and West at our celebration<br />\non the twenty-second of February. The dominant note in these congratulations<br />\nwas that the Johns Hopkins had not only discovered the true law of creation<br />\nand progress in University work, but had also successfully applied it.<br />\nWhen, in 1876, the doors of a few remantled dwelling-houses were modestly<br />\nopened to the students, less than 100 in number, who came to study science and<br />\nliterature under a few great teachers, some skeptic called the new institution<br />\n\"The Baltimore Experiment.\" This doubter and his phrase have long since<br />\nlost even apparent justification. With the gift of a university site second to<br />\nnone in America, with a re-endowment of one million dollars dependent only<br />\nupon the final subscription of some thousands, now being actively sought, with<br />\na larger student body and teaching staff than ever in her history, with an ex<br />\nceptionally strong and capable administration, and with a quarter century of<br />\nalmost constant growth for record, it may he confidently asserted that an era of<br />\nstill greater expansion and opportunity has opened. And the best days are yet<br />\nto come. Said President Remsen in his inaugural address: \"I believe that a<br />\nnew day has at last dawned, and that the onward march will soon be taken<br />\nup.\" Great institutions, like great cities, are not built in a day. They grow.<br />\nGrowth is their vital essence; cessation of progress is death.<br />\nThe City of Baltimore, the State of Maryland, and the entire South are in<br />\nthe beginnings of a period of great material development, and for permanent<br />\nand best results the intellectual development of their citizens must keep pace<br />\nwith it. In this era, the Johns Hopkins will be such a factor as was the University of Berlin in the reconstruction of Prussia. But national and international as the fame of the University has become, it still m Itains a peculiarly<br />\nclose relation to this locality and its future.<br />\nThough all sections have shared alike the benefits of her pioneer work for<br />\nhigher aims and attainments in American education and scholarship, it is<br />\ndoubtful if anywhere the impulse given to intellectual and material development has been more deservedly appreciated or more zealously cultivated<br />\nthan in the South.<br />\n44<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nThe natural advantage of proximity, and the rapid economic growth of an<br />\nera of peace, which restored her ability to seek again, as formerly, the higher<br />\ninstruction of her youth within her own bounds, led to a quick appreciation in<br />\nthis region of the unusual opportunities offered, for the first time in America,<br />\nby the Johns Hopkins, and to a constantly increasing stream of young men to<br />\nher doors.<br />\nThe State of Maryland, in twenty-five years. has sent to her 2,000 students,<br />\nand together with the rest of the South nearly 60 per cent. of the total enrollment. Thus has been fulfilled Dr. Gilman's promise, in his inaugural address<br />\nin 1876: that the university's influence should be \"first local, then regional, and<br />\nthen national,\" that it should be in truth as the heraldic legion on its shield<br />\nnow proclaims, \"An institution devoted to learning, both literary and scientific,<br />\nin the State founded by Lord Baltimore.\"<br />\nThese were not meaningless phrases. Independent of its environment as<br />\nthe university was with its magnificent endowment, he chose from the South,<br />\nfirst the men who were to represent this dual idea of the university system, Gildersleeve and Sylvester, former professors in the University of Virginia, fitly<br />\nsymbolizing the realization in Maryland of the Jeffersonian ideal of higher in<br />\nstruction conceived for Virginia. From that day fitness, not sectional, religious,<br />\nor political affiliation has remained the criterion of selection. Without sectional discrimination, Newcomb, Elliott, Browne and other Southern men were<br />\ncalled to her faculty, and the present staff of instruction contains no less than<br />\nforty men of Southern origin or connections, about the same number of Northern, and a similar representation from the West and foreign countries. This<br />\nresult, though without design, shows the broad liberality that governs the<br />\nadministration, and the creative work the university is doing for the South as<br />\nwell as for the rest of the country.<br />\nIt was here that the literary genius of Sidney Lanier first found appropriate<br />\nrecognition in appointment to a lectureship and in the much-needed encouragement from Mr. Gilman. We might mention, too, Woodrow Wilson of Princeton, and William P. Trent of Barnard, as typical of her contribution from the<br />\nSouth to the North.<br />\nThe university will not be the first to disregard the bonds of local attachment that are strengthening year by year. As a Maryland foundation; a \"Baltimore experiment;\" with locally invested funds fianciered by Marylanders;<br />\nendowed with buildings, lectureships, fellowships and scholarships by local<br />\nfriends; reclaimed from financial embarrassment, twice by private and twice by<br />\npublic aid in Maryland, re-created by the gift of a new site which Baltimore<br />\nwill not allow to remain vacant for lack of endowment, she has striven, and<br />\nwill strive, never merely to balance the account but to return a hundred-fold<br />\nthe benefits received. That her return to the state and the city, and to the<br />\nSouth alone has made her one of the best paying investments ever secured, no<br />\none familiar with the facts for a moment doubts.<br />\nA few of these contributions will be found suggestive: 1. More than any<br />\nother influence, the Johns Hopkins University has checked the exodus of youth<br />\nto foreign universities—a custom dating from colonial times at the South—by<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\noffering them not only equal facilities, but a training more American and more<br />\nsuited to our Southern needs. In the past year 360 out of a total of 694 students have been enrolled from the South. 2. The poor but deserving young<br />\nmen of this region have been aided financially and with honors more largely<br />\neven than those of other regions. The benefits of 65 annual scholarships out<br />\nof a total of 90 are limited to the South, and her sons compete on equal terms<br />\nfor the other twenty-five and for twenty fellowships. Over 350 Southern men<br />\nhave received such or greater honors here. 3. Southern Colleges and schools<br />\nhave been filled with men trained in the best methods of modern research and<br />\ninstruction, who are an inspiration to their students and instrumental in organizing associations for the advancement of the educational and material interests<br />\nof their respective States. Nearly 200 former students of Johns Hopkins are at<br />\npresent teaching in the South, distributed in every state and among more than<br />\n65 institutions. Two hundred more are engaged in business or professional<br />\nwork in the South. 4. The development of local industries of the highest importance, such as oyster culture in Maryland and Virginia, has been greatly<br />\nstimulated. A marine laboratory is maintained for the study of the life of the<br />\nChesapeake and of Southern waters. A physical analysis of soils has been of<br />\ngreat agricultural value. The geological department has accomplished much<br />\nfor the farmer, promoter, investor and land-owner in determining soil characteristics, water power facilities, transportation conditions, the location of mineral resources and in publishing and distributing its excellent topographical<br />\nmap and reports for Maryland. 5. The Medical School, aside from the inestimable benefits of its great hospital and trained men and women,has undertaken<br />\nresearches with good results upon the fatal diseases prevalent in this and Southern regions, such as fevers. 6. The first serious attempt on a large scale to<br />\ninsure the preservation of the history and literature of the South as written by<br />\nher own people, has been made through the historical department, which has<br />\npublished more than 20 monographs of original research upon Maryland alone,<br />\nand 61 upon Southern history, economics, and politics. It has the best collections and library facilities in this field of any American university, and it supplements these by courses of systematic instruction in Southern history and<br />\neconomics. 7. The bonds between Baltimore and the South, weakened by the<br />\nrise of new commercial towns and ports, have been greatly strengthened through<br />\nthe University's influence; and her twelve periodical publications bear the name<br />\nof Baltimore and Maryland to the whole civilized and educated world. 8.<br />\nImportant principles of the Johns Hopkins system have been copied in many<br />\nof the Southern Universities; the requirements for the doctorate, the expansion<br />\nof advanced or graduate study, the system of advisers, which insures a personal<br />\ndirection for the undergraduate and finally, a reliance upon the vital and essential, youth, vigor, enthusiasm, reality and the present, rather than upon dim<br />\ntradition and authority.<br />\nJAMPS CURTIS BALLAGH.<br />\n(Revised and rewritten by the author from hts article in The Evamidist, March 29, noa—ED.)<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nFublished Fortnightly during the University Year by the, Students of THE JOHNS.<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nJUNE 4, 1902.<br />\nSubscription $i 50 per year.<br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\n<br />\n10 Cents a single copy.<br />\n.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nkssistant Business Manager,<br />\n<br />\n.<br />\n<br />\nROBERT S. LAMER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\n. SOLOMON BLUM, 1908.<br />\nGEORGE A. FOSTER, 1904.<br />\n( REGINALD S OPIE, 1904.<br />\nW.S. BIRD, 1903.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br />\n<br />\nAddress all an ides, comnaunications, etc., to ROBERT S. LANIER, box 374, Johns Hop<br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE,box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nt<br />\n<br />\nHE TWENTY-SIXTH ACADEMIC YEAR of the Johns Hopkins University has<br />\nbeen one of progress in every department. With the accession of President Remsen, a new hand has been at the helm; but it has guided with<br />\nwisdom, moderation and foresight. The high position that the University has<br />\nmaintained in the world of education and research was attested at the celebration of her twenty-fifth birthday, when an unparalleled gathering of scholars<br />\nbrought congratulations and praise from West and East. The many services to<br />\nMaryland and the South rendered by the Hopkins are remarked on in the leading article of this issue. The unconditional gift of the Homewood estate has<br />\ncaused the dream of a splendid home for the University to become a possibility<br />\nof the near future.<br />\nThe financial cloud that for years has hung over us has not yet received its<br />\nsilver lining. The Committee of Seventy, which shouldered the task of raising<br />\nthe last quarter million of the endowment fund, report about $117,000 still unsubscribed. But there are sanguine hopes of an announcement on the Commencement Day, June 10.<br />\nComing to undergraduate life, there is to be seen the results of the same old<br />\n\"Hopkins spirit\" which enables our scanty undergraduate body, with the aid of<br />\na few grads. and medical students, to accomplish wonders.<br />\nAthletics, as reviewed on another page, have met with success. At the<br />\npresent time of writing, a lacrosse game is scheduled for June 11 with the Uni-<br />\n<br />\n\fTHEINEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nversity of Toronto team, intercollegiate champions of Canada and Great Britain. We may fairly consider ourselves champions of the United States; so<br />\nthat the game will be the fiercest, with the gi andest prize for the winner, that<br />\nBaltimore will ever have seen or Hopkins ever played. Let us hope that,in thus<br />\nstepping from a local to a world arena, our mighty men will not get weak in the<br />\nknees from stage-fright.<br />\nThe Musical Clubs have had a prosperous season, and are keeping out of<br />\nfinancial troubles. The Public Debate was more successful than ever before,<br />\nand this year in addition served as a trial for Hopkins, first intercollegiate de<br />\nbate, in which our spell-binders did themselves much credit in their maiden<br />\neffort, although they lost to North Carolina. The student publications have<br />\nbeen carried on with the customary enthusiasm; the senior annual, just published, is in every way worthy of the graduating class. The long-looked-for<br />\nStudent Club has been evolved by the Junior Class. Interclass athletics have<br />\nbeen stimulated by two Junior-Freshman relay races and a tug-of-war, in addition to the usual foot ball game and cane rush. Indeed, there are no lines<br />\nalong which earnest work has not been done, and encouraging results obtained.<br />\n<br />\nTORONTO VERSUS HOPKINS!<br />\nA THROW FOR THE INTERCOLLEGIATE LACROSSE CHAMPIONSHIP OF<br />\nTHE WORLD.<br />\n<br />\nt<br />\n<br />\nHE greatest lacrosse game ever played by Hopkins will take place on June<br />\n11, when the crack Canadian twelve will line up against the Black and<br />\nBlue at American League Park.<br />\n.<br />\nThe intercollegiate champions of Canada have recently returned from a<br />\ntour through England, where they won every contest. That the team from the<br />\nNorth is an all-star aggregation cannot for a moment be doubted, but Hopkins<br />\nhas put up a wonderful game throughout the present season, and, although the<br />\nchances of defeating such an opponent may seem very small, still, all things<br />\nare possible. Every man on our team may be expected to do his duty, and it<br />\nis \"up to\" every student, supporter, and friend of the 'Varsity to give the<br />\ngreatest possible encouragement.<br />\nUndoubtedly, we have the strongest team Hopkins has ever had, and, from<br />\nthe outlook at the present, the strongest which will represent the University for<br />\nsome time to come. Recognizing that we have reached the zenith of our power,<br />\nthe management has very wisely embraced the opportunity to try for the world's<br />\nchampionship. Such a game as the contest promises to be is not likely to be<br />\nseen again in Baltimore for many years.<br />\nThe fact that the contest is an international one, decisive of the world's<br />\nchampionship, makes it likely that President Theodore Roosevelt will accept<br />\nan invitation to attend. The crowd should be a record breaker.<br />\nThe men have been on a training diet for several days, and outdoor practice begins to-day. Every effort will be made to get each player in perfect<br />\nshape, and the prospects are that on June lithe 'Varsity will trot on the field<br />\nin the pink of condition. Let every man help the management by talking up<br />\nthe game in every direction, and by coming himself.<br />\nScrubs, don't forget the 'Varsity needs you. If everybody will lend a<br />\nhand, victory is possible.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS—LETTER.<br />\nTHE CLASS OF '02.<br />\n<br />\nEDWARD B BEASLEY, track team, glee club, class executive committee<br />\n'00—'01, will enter the Johns Hopkins Medical School.<br />\nHENRY BERUWKES, DAVID MACHT, Phi Beta Kappa, and Wm. J. BUTTNER will study medicine at the Hopkins Medical School. Beeuwkes has played<br />\nfoot ball, and Macht was a Hopkins scholar.<br />\nELBRIDGE P. BERNHEIM has played on the 'Varsity lacrosse and foot ball<br />\nteams for two years, and played well. He will not return to the University,<br />\nhaving decided to go into business.<br />\nPHINEAS J. S. CAMERON, class foot ball team, and vice-president SubFreshman class, will return to the University.<br />\nJOHN G. CAMPBELL has taken an active part in everything connected with<br />\nthe University. He has been on the base ball team for three years, captain this<br />\nyear, played foot ball, prominent in the \"House\" and in the \"Senate,\" and<br />\nheld various class offices. As he will enter the Medical School we can expect<br />\nto have him with us occasionally.<br />\nROBERT T. CRANE, Freshman and Junior Class President, will take graduate work at the University.<br />\nALBERT G. DEW, Phi Beta Kappa, and twice a Hopkins scholar, will study<br />\nfor the ministry.<br />\nRoss MILES DIGGS, \"Hullabaloo\" editor, intends studying law at the<br />\nUniversity of Maryland. His experiences on the debating teams will \"help<br />\nsome.\"<br />\nJos. T. ENGLAND, prominent in track, class and debating at the University, will no longer be on hand at the \"meets\" to win points for the University,<br />\nsince he intends to adorn the legal profession.<br />\nHORACE C. GILLEsPIE has played foot-ball since entering the University,<br />\nwas captain of last year championship team, and has taken an active part in<br />\nclass affairs. It is to be regretted, but, according to report, he is going to work.<br />\nFREDERICK L. GUGGICNHEIMER Will join the Hopkins band at the University of Maryland. He has been prominent in debates.<br />\nJOHN P. HAND has taken the classical course. He will study for the<br />\nministry.<br />\nHENRY H. HAZEN, of the \"Hullabaloo\" staff and Freshman Class Executive Committee, will enter the Medical School.<br />\nLouis F. HILDEBRANT will return to the University to take graduate<br />\nwork in Romance Languages.<br />\nREEN C. HILL, editor of the NEwS—LETTER for three years, manager of<br />\nthe musical clubs, class executive committee and treasurer of the Y. M. C. A.,<br />\nwill return to the Hopkins.<br />\n<br />\n\f1<br />\n<br />\nE. P. BERNHEIM•<br />\n<br />\nR. T. CRANE<br />\n<br />\nR. M. DIGGS.<br />\n<br />\nN. C. GILLESPIE.<br />\n<br />\nC. C. HILL.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHis experience as editor in-chief of the NEWS LETTER, and editor of the<br />\nHullabaloo have inspired Wm. B. HILL to take up journalism as a profession.<br />\nWm. E. HOFFMAN, Jr., will enter the Medical School. So he can be<br />\ncounted on next year to help keep the Hopkins track team in the front rank, as<br />\nhe has since his Freshman year.<br />\nWM. KIRK has taken the Historical-Political course, and will develop his<br />\npower of oratory at the University of Maryland.<br />\nWm. H. KOPPELMAN will return to the University for graduate work. He<br />\nhas played on the mandolin club.<br />\nOGLE MARBURY, editor of the \"Hullabaloo,\" and Senior class secretary,<br />\nis undecided as to his future work.<br />\nCHAS. MARKELL, Jr., Phi Beta Kappa, Hopkins scholar for three years,<br />\nand president of the Chess Club, has demonstrated his reasoning and persuasive<br />\nfaculties to such an extent that he also feels forced to join the procession to<br />\nLombard and Greene Streets.<br />\nBARTGIS MCGLONK, director of the Lawrence Memorial Association and<br />\nclass executive committee, has decided to return to the University to take<br />\ngraduate work in biology.<br />\nROBERT E. MOORE has played on the 'Varsity base ball team for three<br />\nyears. He will enter the Hopkins Medical School.<br />\nLEWIS W. BRUNER and MCHARDY MOWER are undecided as to their future<br />\n.<br />\nwork.<br />\nLYMAN C. MURPHY, Banjo and Mandolin Clubs, athletic editor of the<br />\nNEWS-LETTER, will be at the Medical School next year.<br />\nCHAS. A. MYERS, Phi Beta Kappa, editor-in-chief of the \"Hullabaloo,\"<br />\nHopkins scholar for two years and class historian, will take a graduate course<br />\nin Modern Languages.<br />\nMARBURY B. OGLE, Hopkins scholar, 'Varsity base ball team, will return<br />\nto the Hopkins for graduate study in Latin and Greek.<br />\nAUBREY PEARRF„ it., has managed the NEWS-LETTER and track team,<br />\nand has been active in debating circles. He will enter Harvard Law School<br />\nnext fall.<br />\nISAAC R. PELS, of the Hullabaloo staff and Hopkins scholar, will enter<br />\nthe Medical School.<br />\nTHOS. C. PINKERTON will join the Boston colony at Boston Tech.<br />\nBENJ. S. PUTTS, business manager of the \"Hullabaloo,\" has played lacrosse for two years. Next fall he. will \"take up the study of law\" at the University of Maryland.<br />\nCHARLES F. RANFT has shown his artistic ability as art editor of the<br />\n\"Hullabaloo\" and the NEWS LETTER, and his athletic ability on the 'Varsity<br />\nlacrosse team. He will study law.<br />\n<br />\n\fW<br />\n<br />\nC. A. MYERS•<br />\n<br />\nB. HILL.<br />\n<br />\nA. REARM(' JR•<br />\n<br />\nH. B. STONE.<br />\n<br />\nWOLMAN•<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nWALTER F. REYNOLD'S and GIBSON EMERSON SISCO have taken the Mathe<br />\ninatical Physical course. Reruolds will return to the University for graduate<br />\nwork in physics, and Sisco will study engineering.<br />\nWm. C. SCHMEISSER will be remembered by posterity as captain of the<br />\ngreat lacrosse team of 1902. Unfortnnately he is going to study law, so will<br />\nnot be with us next year.<br />\nRALPH C. SHARRETTS, \"Hullabaloo\" and 'Varsity foot ball, will study<br />\nlaw.<br />\nJOHN A. SLEmoNs has managed the lacrosse team. and has been athletic<br />\neditor of the NEWS LETTER. His experience as University editor for the<br />\n\"American\" have been so remunerative that he will go into the newspaper business<br />\nSIDNEY SMITH has played foot ball and lacrosse. He will study law.<br />\nHARVEY BRINTON STONE, Phi Beta Kappa, editor of the \"Hullabaloo,\"<br />\nSenior Class President, track and field team for three years, foot ball team,<br />\nJunior, Senior and Intercollegiate debater, has found time to win two Hopkins<br />\nscholarships. Stone has acquired the reputation of being one of the best speakers ever heard in McCoy Hall. He is going to the Hopkins Medical School.<br />\nELLIOTT STROUSE, prominent in 'Varsity base ball, both as player and as<br />\nmanager, will study law.<br />\nSOLOMON STROUSR, Phi Beta Kappa, editor \"Hullabaloo,\" editor-in-chief<br />\nof the NEWS LETTER, Hopkins scholar, and Senior Class Vice-President, will<br />\nstudy medicine at the Hopkins Medical School.<br />\nSAMUEL WOLMAN, Phi Beta Kappa, twice Hopkins scholar, debater, will<br />\nput his scholastic ability to test at the Medical School.<br />\nPEREGRINE WROTH, Jr., Freshman and Junior Class poet, track team and<br />\ndirector Lawrence Memorial Association, will study medicine.<br />\n<br />\nSENIOR CLASS WEEK.<br />\n<br />\nt<br />\n<br />\nHE class of '02 begins the festivities of Senior Week tomorrow. At the<br />\nnoon hour they will form in line for the usual senior procession. In the<br />\ncourse of a tour around the buildings, speeches are made in all the rooms<br />\nand responded to by the professors. In the evening President Stone will entertain his class-mates at his home in Towson.<br />\nOn Friday morning '02 goes to Homewood. The ceremonies have not been<br />\ndecided upon as yet, but the class expects to plant the class ivy somewhere upon<br />\nthe estate. In the evening Dean Griffin holds a reception for the class at the<br />\nHopkins Club.<br />\nSaturday the class takes an outing at the former home of the Maryland Yacht<br />\nClub. The trip is made by the trolley and then by launch to the grounds,<br />\nwhere the afternoon and evening will be spent. On Sunday, June 8, the baccalaureate sermon will be preached by Rev. Amory Howe Bradford, pastor of<br />\nthe First Congregational Church of Montclair, N. J. Dr. Bradford is an associate editor of the Outlook. The sermon will be delivered at 11 o'clock at the<br />\nAssociate Congregational Church, corner of Maryland Avenue and Preston<br />\nStreet.<br />\nOn Monday the much-heralded senior prom takes place in McCoy Hall<br />\nThis is strictly an invitation affair, to which seniors alone can issue invitations.<br />\nTuesday is Commencement Day. The exercises will be held at 4 o'clock at<br />\nthe Academy of Music. At 8 o'clock the University will hold a reception in<br />\nMcCoy Hall for all the graduates, doctors of philosophy, the medical graduates<br />\nand the members of '02.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nTrack and Field.<br />\nJUNE 7.<br />\n<br />\nWestern Maryland College Games at Westminster.<br />\n<br />\nLacrosse.<br />\nJUNE 11. University of Toronto at American League Park.<br />\n<br />\nFoot-ball (Next Fall.)<br />\nOCTOBER<br />\n<br />\n11,<br />\n18,<br />\n25,<br />\nNOVEMBER 1,<br />\n8,<br />\n\"<br />\n15,<br />\n22,<br />\n27,<br />\n<br />\nRock Hill.<br />\nMaryland Agricultural College.<br />\nDelaware College.<br />\nWestern Maryland College.<br />\nGallandet,<br />\nRichmond College.<br />\n(Thanksgiving Day) University of Maryland.<br />\n<br />\nTHE YEAR IN ATHLETICS.<br />\n141) JOHNS HOPKINS\" may well be proud of the achievements which<br />\nhis teams have gained in the different branches of athletics since last<br />\nSeptember. With our small number of students and the poor facilities for proper training by which we are handicapped, the intercollegiate football championship of Maryland, the championship in track and field work<br />\nagainst all Maryland, and the intercollegiate lacrosse championship of the<br />\nUnited States can by no means be considered a small accomplishment for one<br />\n.scholastic year. It is practically all we could have done.<br />\nOur championship relay team did not bring home another banner from the<br />\nannual relay races at the University of Pennsylvania, but had not W. E. Hoffman fallen by accident, we should most certainly have had one more pennant<br />\nfor the trophy room. Notwithstanding this, the boys ran a great race, and<br />\ncame very near winning out anyhow. The track men more than made up for<br />\nthis defeat, however, by the great work done in the championship games held at<br />\nElectric Park on May 14. Hopkins made a total of 60 points while our'nearest<br />\ncompetitor—the Maryland Athletic Club—gained 36 points.<br />\nAt the beginning of the foot ball season those men who understood the<br />\nsituation best were sincerely sorry for Captain Gillespie. The vacant positions<br />\ntman, Butler, Bruton, Tyler a nd Morse were among those which it was<br />\n<br />\n440<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n. a,, •... .<br />\nV. -,. If,'<br />\ni,,<br />\n.0<br />\n<br />\n,<br />\n•<br />\n'<br />\n<br />\n....,.<br />\nop . • ev.s.<br />\n<br />\n4.<br />\n.•<br />\n<br />\niiWW M‘<br />\np A.<br />\n<br />\n•'4'<br />\n.... T<br />\n•-<br />\n<br />\n•<br />\n<br />\n'..*IT<br />\n'<br />\n<br />\n'' 4<br />\n0<br />\n<br />\n,.•<br />\n<br />\n••„<br />\n<br />\n,.<br />\n'at• •<br />\n4 :.<br />\n<br />\n,.<br />\n<br />\n'<br />\n<br />\n.44<br />\n.<br />\n<br />\n\"<br />\n<br />\n:k .'40,4::;47:\\:1104<br />\n4'<br />\n<br />\nvit<br />\n<br />\n• *1 4i<br />\n<br />\n-<br />\n<br />\nlet\"faioN,<br />\n711roirrel<br />\n7444,<br />\n<br />\nCAPTAIN SCHM EISSE R<br />\n<br />\nLACROSSE•<br />\n<br />\nCAPTAIN ENGLAND<br />\n<br />\n•10<br />\n‘.<br />\noti<br />\n, „virvoin<br />\not<br />\nkfrf wit%<br />\nut<br />\n<br />\nTRACK<br />\n<br />\nfound impossible to fill. Nothing daunted, however, \"Horace\" went to work<br />\nin an endeavor to squeeze every bit of material that could be found in the<br />\nUniversity, and \"Mack\" led the crusade in search of recruits at the Medical<br />\nSchool. The scores at the beginning of the season were discouraging, but<br />\ngradually better material began to appear, and, in the first of our championship<br />\ngames,—that with Western Maryland College,—we won in good style by a<br />\nscore of 12 to 0. Nevertheless, the championship game with St. John's was<br />\ncontemplated with fear and trembling. The Annapolitan crowd did not hesitate to say that they were represented by the strongest team which they had<br />\ndeveloped for years, and Dr Cain,'supervisor of athletics at St. John's, wrote<br />\nto \"Father Bill\" and confidently informed him that a good walloping for Hopkins was inevitable. And from St. John's showing against teams like Swarthmore and Gallaudet, things did look somewhat blue. Our men were not discouraged by the prospect. The appearance of such men as Garwood, Faris,<br />\nYoutz, Weil, Houghton and Whipple from the Medical School greatly improved<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nC.'02 RELAY TEAM.<br />\n<br />\nmatters and the showing made against Haverford encouraged us to hope that<br />\neven St. John's might be beaten.<br />\nThe day of the game dawned with black clouds frowning down on the<br />\nAmerican League Park from every side, and the continuous downpour throughout the afternoon converted the gridiron into one hugs mud-puddle. In the<br />\nfirst half a battle royal was waged and neither side scored; but in the second,<br />\nHopkins' rooters shouted for joy when they saw our men slowly but surely<br />\nworking the ball towards St. John's goal. The oval was carried to the oneyard line, and, on the third down, St. John's center seeing that the game was<br />\nlost unless some sort of strategy were resorted to, interfered with our center<br />\nman. The referee promptly gave us first down, and to the visitors' great discredit, they showed the \"yellow back\" by refusing to play. The only spoitsmanlike action open to them was to finish the game under protest. The game<br />\nwas promptly forfeited to Hopkins, and with it came the intercollegiate chain<br />\npionship of Maryland.<br />\nDuring the winter, very little was heard from either the track or the lacrosse<br />\nteams, but both squads were quietly doing good work in the cage and on April<br />\n5 the seasons opened in a manner very satisfactory to our adherents. The<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nlacrosse team defeated the University of Pennsylvania at Philadelphia by<br />\na<br />\nscore of 6 to 1, and the first track and field games ever held in the \"cage\"<br />\ngave<br />\nus a majority of points.<br />\nFrom that time until May 19, lacrosse held sway, and well it might.<br />\nAlthough Tyler, Bruton, J. Bandel and Hatch were lost, good men turned up<br />\nto take their places, and when Hobart was beaten in the second game by<br />\na<br />\nscore of 12 to 1, the rooters joyously shouted, \"Our boys are out for the championship!\" And they were. Harvard went down on the Saturday following by a score of 11 to 1, and when Swarthmore was played to a standstill, 8-2,<br />\nin the closing game, the \"has beens\" declared the team of 1902 the strongest<br />\never turned out by Hopkins.<br />\nCaptain England capped the climax by clipping 2 1.5 seconds off the State<br />\nrecord, at the News Cup games.<br />\nWith so much to be done in the foregoing branches of sport, it hardly<br />\nseemed possible that sufficient material could be spared for base ball. Notwithstanding, Captain Campbell and his men made a very creditable showing under<br />\nso many discouraging circumstances. We hope they may improve next year.<br />\nFOOT BALL ('VARSITY GAMES.)<br />\n<br />\nJ. H. vs. Rock Hill College, 24-5.<br />\nMd. Agricultural Col., 6-0.<br />\nGallaudet College,<br />\n0-12.<br />\nHaverford College,<br />\n0-5.<br />\nDelaware College,<br />\n27-0.<br />\nWestern Md. College, 12-0.<br />\nSt. John's College, Forfeit<br />\nto H. U.<br />\n14<br />\nUniv. of Maryland,<br />\n5-5.<br />\nClass Game.<br />\n(Juniors vs. Freshmen),<br />\n<br />\n12-0.<br />\n<br />\nLACROSSE.<br />\n<br />\nJ. H. vs. Univer. of Penna.,<br />\n5-1.<br />\n\" \" Hobart College,<br />\n12-1.<br />\n.4<br />\n41<br />\nHarvard University, 11-1.<br />\n41<br />\n11<br />\nLehigh University,<br />\n9-1.<br />\n61<br />\n46<br />\nColumbia University, 17-1.<br />\n11<br />\n\" Swarthmore Univer., 8-2.<br />\nEASE- BALL.<br />\n<br />\nCAPTAIN CAMPBELL- BASEBALL<br />\n<br />\nJ. H. vs. Rock Hill,<br />\n15-10.<br />\n\" Naval Academy,<br />\n8-17.<br />\n64<br />\nGettysburg,<br />\n2-9<br />\n\" Md. Agricultural Col., 2-3.<br />\n\" Georgetown College, 1-23.<br />\n\"„ Western Md. College, 6-1.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nTHE NIFTY NICKEL-PITCHERS.<br />\n<br />\nOf all the occupations<br />\nWhich engross the college man<br />\nOf all the college pastimes,<br />\nNickel-pitching leads the van.<br />\nIt used to be that pennies<br />\nWere regarded a big stake,<br />\nBut it was soon decided<br />\nThat it took too long to break<br />\nA bloomin', bloody Freshman<br />\nIf he had a good sized pile,<br />\nAnd thus at last it happened<br />\nThat the nickel came in style.<br />\nBeware the game so sinful,<br />\nFor it really can't be beat,<br />\nIf any new man tries it<br />\nHe will surely court defeat.<br />\nIt takes a skillful player<br />\nTo manipulate the game<br />\nTo toss up the collection,<br />\nAnd then pocket all the same.<br />\nL'ENVOI.<br />\n0 gamblers out on Ross Street!<br />\nYou have got my little all,<br />\nAnd ne'er again I'll linger<br />\nPitching nickels at the wall.<br />\n<br />\nUNDERGRADUATE NOTES.<br />\nelection of<br />\nOn Monday of last week the Musical Clubs held their annual<br />\nC. Pagon,<br />\nR.<br />\nnt;<br />\npreside<br />\n'02,<br />\nHill,<br />\nC.<br />\nE.<br />\n:<br />\nofficers. The following were chosen<br />\nCarver,<br />\nB.<br />\nW.<br />\nr;<br />\nmanage<br />\nnt<br />\nassista<br />\n1st<br />\n'03, manager; H. H. Hutnrichouse, '04,<br />\nBryan,<br />\nJ.W.<br />\nClub;<br />\nBanjo<br />\nof<br />\nleader<br />\nG.,leader of Glee Club; C. A. Marshall, '03,<br />\norgar•<br />\nthe<br />\nfor<br />\nution<br />\nconstit<br />\na<br />\nof<br />\ntion<br />\n'03, leader of Mandolin Club. The prepara<br />\n,<br />\nCarver<br />\nB.<br />\nW.<br />\nEager,<br />\nH.<br />\nJ.<br />\ntee:<br />\n-ization is in the hands of the following commit<br />\nwill<br />\nons<br />\nprovisi<br />\nother<br />\nAmong<br />\nW. Snowden,'03. This will fill a long-felt want.<br />\nmanager and three<br />\nbe one for the wearing of the letters \"H. M. C.\" by the<br />\nleaders.<br />\nthe bay to<br />\nTo-morrow the class of '04 will have a reunion and trip down<br />\nTolchester, leaving on the 2 o'clock boat.<br />\ned to Dr. W.<br />\nWednesday May 28th, the class in English Literature present<br />\nS,<br />\nH. Brown,\"A. History of English Dramatic Literature\" by W. A. Ward. J.<br />\n.<br />\nreplied<br />\nGrasty made the presentation speech, to which Dr. Brown<br />\n<br />\n\fTHE N EWS- LET TER BOARD OF EDITORS•<br />\n<br />\n\fTHE FOOTBALL SQUAD OF LAST FALL•<br />\n<br />\n\fTHE BASEBALL TEAM<br />\n<br />\n\fMANDOLIN. oU1TA11,AND BANJO<br />\n<br />\nUNIVERSITY CAFE.<br />\n<br />\nTAUGHT eV<br />\n<br />\nC. J. LEVIN•<br />\nwho has made a life study 01' these Instruments. Mandolin Soloist of National reputation. erepares Students<br />\n<br />\nfor tIopkins Musical Clubs.<br />\n<br />\nStudio. 331 N. Charles St.<br />\n<br />\nCHAS. LINDENMEYER. Prop.<br />\n<br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dining. Rooms.<br />\nMeals Served at all Hours.<br />\n<br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\n<br />\nNT0 CID ricDIR<br />\n<br />\nNICD<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br />\n<br />\n321 W. Baltimore Street,<br />\n<br />\nCHESAPEAKE RUBBER COMPANY,<br />\n<br />\n1<br />\n8c (Q.,<br />\nAI,A_ E3.1Et7<br />\n675 West Baltimore Street,<br />\nO.Between Arch and Pine Sta. Baltimore, Md.<br />\n<br />\nWEST BALTIMORE LOAN C<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\n<br />\nOPEN<br />\n<br />\nFROM<br />\n<br />\n7<br />\n<br />\nSATURDAYS<br />\nA. M. TO 6 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br />\n<br />\nSMITH, DIXON Lk CO.<br />\n<br />\nF'fif'Ffi<br />\n29-31 S. Charles St.<br />\n<br />\nF3altimoire, Md.<br />\n<br />\nPiGturcs<br />\nRND<br />\n<br />\nFraming.<br />\n<br />\nUNTIL 10 P<br />\n<br />\nM.<br />\n<br />\nFRANKE &<br />\na PURNELL CO.<br />\n224 N. HOWARD ST.<br />\n<br />\nGreek Letter<br />\nA. [I, MAG I fratermtv<br />\njcwelrr.<br />\nMANUFACITURIN OF<br />\n<br />\n14 AND 16 ST. PAUL. STREET,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nFINE<br />\n<br />\nrural. CALL AND [(AMON( OUR LINe 0[FORIC PUNINAOINO.<br />\n<br />\nJ. H. ROBINSON.<br />\nMANUFACTURER 9W<br />\n<br />\n• FINE• CIGARS.<br />\n<br />\nBonbons, Mutates,<br />\nCONFECTIONS.<br />\nFRESH EVERY.HOUR. SENT BY MAIL OR EXPRESS.<br />\n<br />\nDEALER IN<br />\n<br />\nTOBACCO, clAZIA RR A NO SMOKERS' ARTICLES,<br />\nSPAT1ONKHY,<br />\n<br />\n14 EAST BALTIMORE STREET.<br />\n<br />\n020 N. EUTA W ST.<br />\n<br />\nBALTIMORE, M D.<br />\nBaltimore, New York & Philadelphia Papers.<br />\nC. & P. Public Telephone. Madison 11851.<br />\n<br />\nDegigeing aryl ['tilting by E Michaelson.<br />\n<br />\nl. MIGliftELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nALTERING AND REPAIRING<br />\n<br />\n821 riadison Avenue,<br />\nN E LOP. tlArrIMS'U<br />\n<br />\nSpecial discount to Students.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNgrdilf<br />\n<br />\nLAI.TIAQ111!,MD.<br />\n<br />\n\fGUIrSEFC'S<br />\n<br />\nYOU WILL<br />\n<br />\nUNRIVALLED<br />\n<br />\nlice Cream anb Ices,<br />\n<br />\nThe Itorrie Friendly Ins. Go.<br />\nloo W. Fii•YETTE ST.<br />\n<br />\nN. W. Car. North Ave. and Barclay St.<br />\nC. & P. •PHONC PAAIDi6ON 643-A<br />\nMD. DRUID<br />\n715<br />\n<br />\nBE INTERESTD in reading a<br />\nHome Friendly booklet, which<br />\nwill be mailed you on receipt of<br />\nyour address. * * * * *<br />\n*<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nWM. M. EARECKSON,<br />\n<br />\nC. &<br />\n<br />\nTELEPHONES:<br />\nSt. Paul 2040. Courtland 444.<br />\n<br />\nE. COONAN, Pres.<br />\n<br />\n—DEALER IN ALL KINDS—<br />\n<br />\nEwn. TAYLOR, Manager<br />\n<br />\nMARYLAND ENGRAVING COMPANY<br />\n7<br />\n<br />\nOFFICE AND YARD,<br />\n<br />\n(Incorporated.)<br />\n<br />\nHALF-TONES, ZINK MI-11MS, CCLCR<br />\n<br />\n1433-1435 W. LAFAYETTE AVE.<br />\n<br />\nWORK, SKETCHES, DESIGNS.<br />\n<br />\nLime, Hair, Bricks, Cement, Plaster, Sand and<br />\n<br />\n214-216 WAlEH ST.,<br />\n<br />\nFeed.<br />\nHall For Rent for Parties, Etc ,apply at Office.<br />\n<br />\nBaltimore, Md.<br />\n<br />\n& I. 313611-3/ Si. PAUL.<br />\n<br />\nUSE THE BEST<br />\n<br />\n...fflatoes Vreeto...<br />\nBoth 'Phones.<br />\n<br />\nYOU WILL LIKE_ IT.<br />\n<br />\nJosh Billings<br />\nonce said he had \"read, heard of and seen a great many good things on<br />\nmilk, but the best thing he had ever seen on it, was CREAM,\"<br />\n<br />\nThe Pikesvill6 Dairy Go.<br />\nSupplics the highest quality of Milk and it fills J psh Fillings requirement.<br />\n<br />\nG. W. EVANS, -<br />\n<br />\n- - Pres. and Gen. Mgr<br />\n1511-13-15 ARGV1 F AVE.<br />\n<br />\nJ. H. WAHMANN,<br />\nLuxiNG-roN STREET,<br />\n<br />\n118 W.<br />\n<br />\nBaltimore, Md<br />\nMATERIALS FOR EMBROIDERI NO, KNITT1 NO, CROCHETING AND LACE MAKING.<br />\nFANCY WOOLEN YARN OF<br />\nEVERY DE4CRIPTION.<br />\nA writsTic STAMPING AND DESIGNING.<br />\n<br />\nINSURANCE,<br />\n<br />\nCOLLECTIONS.<br />\n<br />\nIRA E. MOESSINGER,<br />\n<br />\nSTENOGRAPHY, TYPEWRITING, MIMEOGRAPHY.<br />\nint FI('ITI.ARS MAli.P.1).<br />\n408 CONTINENTAL TRUST BUILDING<br />\nMd. Phone, Courtlund 1275,<br />\nBA LT' MOUE, MD<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n' 804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nIs a scientific adjustment of'the human anatomy, by mechanical manipulation, by which We remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature\" can restore the part to its normal condition. We<br />\ntreat all dikeascs, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We vr ill be glad<br />\nto furnish any further information on application.<br />\nW. D. HOW EN, M. D., D. O.,<br />\nProst. & Mgr.<br />\n<br />\nMARIABUIE,D. 0.,<br />\n<br />\nWedding Silver rig\"<br />\nSilversmiths.<br />\n..0<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Rooks,<br />\nMadison &Howard Sts.<br />\nStudent's Supplies.<br />\n<br />\nUMBRELLAS, HATTERS, CANES,<br />\n<br />\n',<br />\n<br />\n3.<br />\n24 WEST BALTIMORE:<br />\nManufacturers of<br />\nHOPKINS<br />\nanti Cassimere Hats.<br />\n<br />\nsilk r<br />\n<br />\ncusifiNG & COMPANY,<br />\n<br />\nStationer's.<br />\nSCHOOL, LAW MEDICAL. CLASSICAL AND MISCALLANCOUS Boons<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nII. R. ElSENBRANDI SONS,<br />\n<br />\nJORDfili UHLER GO.<br />\n<br />\nAPPLY TO<br />\n<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201.20:3 N.CHARLES ST.<br />\n<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nOtto Ii.NVilliams,<br />\nV ice-Pt csideut.<br />\nI. E. Marshall, Asst, Cashier,<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital. $660,000<br />\nSurplus and Profits $450.000.<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nCAPS<br />\n<br />\n[Wolof:dies and<br />\n<br />\n34 W. BALTIMORE ST.<br />\n<br />\nfor<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nETC.<br />\n<br />\nAgent for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n<br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman Zic Son,<br />\nMLILM,<br />\n7°<br />\n.,„<br />\nReads us follows: Samples submitted of<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye WhIskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\n<br />\nJANINS R. IAIME.<br />\n<br />\nF2INT F;R & CC).<br />\n<br />\nNV<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\nHenderson's •Ps<br />\n<br />\nSec'y. h Treas.<br />\n<br />\nTHRO, WARNISR.<br />\n<br />\nESTABLISHED 1079.<br />\n<br />\n.JACC)E31 a JENKINS,<br />\n210 N. CHARLES ST.<br />\n<br />\nH. MeMAINS, n. 0.,<br />\n<br />\nV.-Prest. & Asst. Seey.<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN,<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br />\n<br />\n\fA. D. SMITH & SONS,<br />\nFormerly<br />\nLEVERING & SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children<br />\nIn the Latest Designs.<br />\nMEN'S HATS—Derbys and Soft Mtg.<br />\n<br />\nthe lizrany.Snifth<br />\npiano CO.<br />\n109 and ill North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nilgenithz<br />\n<br />\nCbickertno, 113rat)burti ant) 11111ebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBaltimore<br />\n<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO.<br />\n<br />\nHABERDASHERS.<br />\n<br />\nShirts, NeckwRar,<br />\nUnderwear, Honiery,<br />\n<br />\nEtc.<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\nST. & 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\n<br />\n203W. BALTIMORE<br />\n<br />\nMembei, of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ,<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE de CO.,<br />\nBANKERS ell BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A<br />\n<br />\nNELSON. GEN'L MANAGER<br />\n<br />\nHospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br />\n<br />\nPhysicians,' Burgeons,'<br />\n<br />\nBaltimore, Md.<br />\n<br />\n300 N. Howard St,,<br />\n<br />\nDrovers and<br />\nt<br />\n<br />\nMechanics Habana! Bad,<br />\n<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock,$300,000.<br />\n<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVEP<br />\n<br />\nYOLI1FC EYLS<br />\n<br />\nPANY,<br />\nTemple.)<br />\n<br />\nSAYRE OPTICAL<br />\ntroot.<br />\n<br />\nC. & P.'Phone 232-2.<br />\n<br />\nFactory Prices.<br />\n<br />\nSMITH'S s0H(,r)22Terr&B atoGE<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTORE<br />\n3rd door from Madison.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged . . •<br />\n605 N. Eutaw Street.<br />\n<br />\nWM. V.PIPPEN,<br />\n<br />\nA. ii. Rutherfoord.<br />\nF. Lents.<br />\n<br />\nJ. Wm, Middendorf,<br />\nA. J. Robbins.<br />\n<br />\nJ. WM. MIDDENDORF & CO.<br />\nVanhers & troller°.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br />\n<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n<br />\nt,0<br />\n<br />\n1\\lcsi, 30/4<br />\n<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\n221 North Ch<br />\n<br />\nPianos.<br />\n<br />\nk...usonie<br />\n<br />\nK,XFt.MIN:110 OPTIGIFHNS.<br />\nTHE NEWS LETTER<br />\n<br />\nY. M. C. A. BUILDING,<br />\nBALTIMORE, MD.<br />\nC. 1t P. and Md.'Phones.<br />\n<br />\ncm ON<br />\n<br />\nJft8. It. DOWNS,<br />\n229 N. Charles St.,<br />\n<br />\n----MASONIC TIEM PLC.<br />\nFOR<br />\n7<br />\n<br />\nClass, Fraternity and College StationerY,<br />\nBanquet Cards, Invitations, Diplomas,<br />\nPrograms, Visiting Cards, etc. ......<br />\n<br />\nOur fiflic J. fi. U. Blue and<br />\n<br />\nBlack Play Paper—now ready.<br />\n<br />\nThere fa verii tittle entertainment at home without s Plan°<br />\n<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nTIE FF<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones,<br />\n<br />\nPIANos<br />\n<br />\nfire The Best.<br />\n<br />\n9 N. Lihertu St.<br />\n<br />\n\f\f\f\f.-<br />\n<br />\n--.1=0111<br />\n<br />\n\f\fr4r<br />\n<br />\n• 4+<br />\n<br />\n...,4 ,.<br />\n<br />\n•(.... ,<br />\n<br />\n\"'<br />\n<br />\n• li.<br />\n<br />\n. -L•<br />\n...,,,7„. '..A<br />\n<br />\n.4,<br />\n<br />\n,<br />\n,Nk4,*.,64: ,t<br />\n`1,,\"<br />\n..17-. %<br />\n<br />\n....<br />\n<br />\n•i\" -\"- '<br />\n<br />\n01<br />\n,<br />\n1',.<br />\n1./..'<br />\n'.<br />\n•4e'<br />\n<br />\n.- .<br />\n<br />\n4., S.,,<br />\n<br />\n, •<br />\n<br />\n-<br />\n<br />\n, ,<br />\n<br />\n.\"'<br />\n<br />\n-<br />\n<br />\n4<br />\n<br />\n.' •-•Vv''<br />\n<br />\n1<br />\n<br />\ni<br />\n<br />\nea-<br />\n<br />\n•<br />\n}4.<br />\n.1,<br />\n<br />\n•“hy<br />\n<br />\n''',<br />\n<br />\n•<br />\n<br />\n,., •i<br />\n..P',;,.<br />\n<br />\nra,, , •r... ,;',.<br />\n<br />\n„64<br />\nArj<br />\n<br />\nr• •<br />\n<br />\n' i<br />\ndr. it in..<br />\n-_ i<br />\n4i<br />\n11<br />\n<br />\ns, • 0 N.<br />\n. i,<br />\n''''k'• *<br />\n<br />\n•<br />\n<br />\n,<br />\n<br />\nfr. .-(:,<br />\n<br />\n.4i;,<br />\n<br />\n;,,,,<br />\n<br />\ni<br />\n<br />\n4 ,<br />\n<br />\ni<br />\n<br />\nlc.. .<br />\n<br />\n,,a\"r<br />\n<br />\n1<br />\n<br />\n.•<br />\n<br />\n• • r„<br />\n<br />\n4<br />\n<br />\nr<br />\n<br />\nf<br />\n•<br />\n<br />\n.4t44IA\",<br />\n911<br />\n<br />\n•.\"...-<br />\n<br />\n.,4\"r •<br />\n.4,<br />\n<br />\n4t4.4.<br />\n<br />\n..c, •<br />\n'<br />\n.A\"<br />\n<br />\n„<br />\n4. 411t,<br />\n<br />\n,,<br />\n'<br />\n' 1••<br />\n1$ . ••<br />\n....<br />\n'<br />\ni<br />\n<br />\n'<br />\nr '<br />\n<br />\n.t.,•.. 4.Srl.............' .. ..4 *<br />\n<br />\n14„,„,01111mt •<br />\n<br />\n. Al, ,<br />\n<br />\n1<br />\n<br />\n• 4.4,'<br />\n• 1,.<br />\n-1101P'•<br />\niii,.. •...r..44e, , -4,. - • , .<br />\n•.; 1 '4r4 „K.<br />\n4<br />\ni', 4 • • 4,•••''<br />\n<br />\nS.,-, .•<br />\n<br />\n,,<br />\n. *V*.1 e<br />\n'<br />\n,0 ,All A..<br />\nIP.<br />\n4.0 y • ....:1,. .,, ...„<br />\n<br />\nIll<br />\n<br />\n.,<br />\n<br />\n•<br />\n<br />\n1:\". :.,'( .<br />\n'<br />\n'<br />\n4)4 .1.situo,<br />\n- •:'<br />\n<br />\now\"<br />\n..\" • .1<br />\n• e<br />\n<br />\n't•<br />\n•,...<br />\n'<br />\n!'.`4,\"'.<br />\n. 116 ..,<br />\n<br />\n4<br />\n<br />\n..... 1,,<br />\n<br />\n-.1<br />\n'<br />\n.-'' .<br />\n<br />\nmi., 1,1,...c<br />\n<br />\n•<br />\n<br />\n\\- .• ,.<br />\n44'<br />\n4<br />\nv.'\"Tv: ,,.., P• \".)<br />\n..i .•<br />\n1<br />\n<br />\n47* '<br />\n4.<br />\n'<br />\n-rt., • ,-4...,<br />\n<br />\nr • .,. 4<br />\n,. . .. ,,•.;: :,..‘ ..„,<br />\n•<br />\n, C'.<br />\n<br />\nyl<br />\n<br />\n411..<br />\n<br />\n-t<br />\n.<br />\n..'2.„„..,- ,t0<br />\n<br />\n- .04 ...;•' • y •<br />\n<br />\n.4.'14,<br />\n<br />\n'14<br />\n4 • ,.<br />\n<br />\n4<br />\n.,<br />\nt,<br />\n40i.<br />\n<br />\n...<br />\n<br />\n3<br />\n<br />\n.. ,I'•<br />\n'<br />\n•-<br />\n<br />\n•<br />\n<br />\ni<br />\n10 ,.... ,,.,<br />\n<br />\n...)„. ,<br />\n<br />\n'<br />\n<br />\ni.. ,<br />\n<br />\n'1\" AP<br />\n<br />\n1<br />\n<br />\nI<br />\n<br />\nt<br />\n,,<br />\n,<br />\nr• .<br />\n<br />\n•<br />\n<br />\n,.<br />\nr<br />\n<br />\n.<br />\n•<br />\n<br />\n.. k k<br />\n,<br />\n,k -<br />\n<br />\n.•I<br />\n<br />\nSILP<br />\n<br />\n. ei,,<br />\n<br />\n40'<br />\n.r•<br />\n<br />\n44<br />\n.<br />\n1*<br />\n<br />\n, A,<br />\n<br />\n.<br />\n<br />\nrf. ...1144,' 1'''7i<br />\n<br />\n.?<br />\n.<br />\nS'<br />\n.'<br />\ni<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nil ,<br />\nI..<br />\n4<br />\n.<br />\n1.<br />\n• . ,irt<br />\n14.,eve.<br />\n4,<br />\n<br />\n... •<br />\n<br />\n\"<br />\n1<br />\n;<br />\n<br />\nNEL , t<br />\n;<br />\n`le<br />\n4,, ,•-...!<br />\n.<br />\n<br />\n•.,<br />\n<br />\n, •<br />\n-4 .-,<br />\n<br />\n4a.<br />\n•<br />\nA\"<br />\n<br />\nOh.<br />\n<br />\n1.<br />\n•<br />\n<br />\n•!le.<br />\n•<br />\n,<br />\nOrryPorigt<br />\n,,,,...<br />\ndi<br />\n<br />\n. 4,•11L*7..‘<br />\n'' . •LA)<br />\n• '<br />\nt4<br />\n4<br />\n;,<br />\n<br />\n.c.,<br />\n'<br />\n<br />\n..,., t<br />\n<br />\n741<br />\n......,<br />\n<br />\n.11<br />\n<br />\ne lii,t<br />\n<br />\n\"O•<br />\n<br />\n••• 1<br />\n<br />\n. te';4.c - /. '<br />\n....44 ir-tr''<br />\n-<br />\n<br />\n.1''' : 7 •<br />\n<br />\nr .1<br />\n<br />\n'4 -•<br />\n<br />\nre<br />\n<br />\n'Ned<br />\n<br />\n,-.<br />\n<br />\n,.14. •<br />\n0' • ? -<br />\n<br />\n.<br />\n<br />\n...oh.,4 . . ../<br />\n<br />\n.<br />\n<br />\n'.,` •<br />\n<br />\n••''''''.4'.<br />\n<br />\n. ,•<br />\n<br />\n,6.<br />\n<br />\nit<br />\n<br />\n.1.<br />\n40,... .<br />\n<br />\n1<br />\n14<br />\n<br />\n., ....<br />\n<br />\n;1:<br />\n.(' . '<br />\n,.1<br />\n<br />\n1.•,J<br />\n<br />\n#. at se• -<br />\n<br />\n.h.<br />\nsti, \" •,..<br />\n• '''. 1<br />\n<br />\n) . \"•• ibir<br />\n<br />\n..<br />\n<br />\n4. .....<br />\n<br />\n,<br />\n1<br />\n<br />\n'<br />\n.<br />\n<br />\n..<br />\n<br />\nIt<br />\n<br />\ni t1<br />\n<br />\n1<br />\n<br />\n•<br />\n<br />\n'01' • ,<br />\n<br />\n,<br />\n<br />\n4.'1r<br />\n'<br />\n-I<br />\n<br />\nna.<br />\n<br />\n,<br />\n<br />\nt•<br />\n<br />\n'.*i<br />\n<br />\n'r<br />\n<br />\n.111<br />\n<br />\n44<br />\n.4 . .<br />\n<br />\n•,<br />\n<br />\n:<br />\n4,,..1...iii .<br />\n.1-4,:, I,?<br />\n\":<br />\n.....•,.s<br />\n' i II!. 40'<br />\n.16<br />\n'<br />\n<br />\n,<br />\n<br />\n..•<br />\n' )<br />\n<br />\n't<br />\n'<br />\n\"1\"I<br />\n• )..h, 4<br />\n<br />\nT..-4„54.1<br />\n0. 1<br />\n<br />\n...i. • i;.<br />\n<br />\n- 1.<br />\n'''<br />\n_ '1.:<br />\n,4<br />\n?' /<br />\n1<br />\n4<br />\n1..Aisti ' Il<br />\n\"<br />\nl :<br />\n„op •<br />\n<br />\n,<br />\n<br />\n,<br />\n. .r<br />\n<br />\n.<br />\n.<br />\n<br />\nkg<br />\n'<br />\n<br />\n.,,,i<br />\n<br />\nt'Al01:<br />\n<br />\n• •••<br />\n<br />\n-.14..<br />\n<br />\n• .:'<br />\nIrl N.<br />\n<br />\n,,,,•<br />\n<br />\nr<br />\n<br />\n.<br />\n.r<br />\n<br />\n;.'\"1.<br />\n;<br />\ni<br />\nN<br />\n'<br />\n1<br />\n<br />\n( .k<br />\n./1). . ._<br />\nev,--A:<br />\n<br />\n#\"‹<br />\n)<br />\n11<br />\n.<br />\n<br />\n,<br />\n<br />\n'<br />\n'<br />\nd 4<br />\n<br />\ni<br />\n<br />\nlt<br />\n<br />\n,, .4<br />\n, lili•<br />\n<br />\n,<br />\n0 -4,<br />\n<br />\n•r 1,<br />\n<br />\n4.,,<br />\n<br />\n1<br />\n<br />\nr•<br />\n<br />\n•-1 •<br />\n<br />\n0.<br />\n.0,<br />\n,,4;:kt, '<br />\n<br />\n.1<br />\n<br />\n1<br />\n.•<br />\n<br />\nP.<br />\n•<br />\n<br />\n.<br />\n<br />\n- .,..<br />\n<br />\nI,<br />\nP•44<br />\n.:1t<br />\n.<br />\n<br />\n.0<br />\n<br />\n•<br />\n<br />\n.<br />\n<br />\n, .,<br />\n<br />\n•It<br />\nc<br />\n<br />\n,... , .,<br />\n0.<br />\n.<br />\ni<br />\n,. ,<br />\n<br />\ns.r.<br />\n4 . , 't<br />\n<br />\nlo•<br />\n<br />\nli<br />\n<br />\n.4<br />\n.<br />\n<br />\n4<br />\n<br />\n'.0007‘j<br />\n:'11,0 '<br />\n<br />\n'<br />\nC1\"<br />\n<br />\n),, \"• 1<br />\n,;<br />\n<br />\n7 ....<br />\n<br />\n•<br />\n<br />\nS.,<br />\n<br />\n14.0 ,..<br />\n<br />\n:<br />\n<br />\n4.<br />\n<br />\n.',;•41;),...',.:or $'<br />\n<br />\n......daii.....i.....--4411116111.............:-.......11h......\"---<br />\n<br />\n\f", "format": "basic_html", "processed": "THE .02 TRACK AND FIELD SQUAD.<br /><br />\nCOMMENCEMENT NUMBER.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nJUNE 4, 1902.<br /><br />\nNo, 17.<br /><br />\n'THE BALTIMORE EXPERIMENT\" AND ITS SUCCESS.<br /><br />\n5<br /><br />\nOR the past twenty-five years, the Johns Hopkins University has held<br />\na position that is unique in the educational history of our country,<br />\nand during this time has come to stand for the most progressive ideals<br />\nin her educational life.\" This recent appreciation from a leading Southern<br />\ncollege but expresses for the South . what President Eliot and President Harper<br />\nso graciously and generously voiced for the North and West at our celebration<br />\non the twenty-second of February. The dominant note in these congratulations<br />\nwas that the Johns Hopkins had not only discovered the true law of creation<br />\nand progress in University work, but had also successfully applied it.<br />\nWhen, in 1876, the doors of a few remantled dwelling-houses were modestly<br />\nopened to the students, less than 100 in number, who came to study science and<br />\nliterature under a few great teachers, some skeptic called the new institution<br />\n\"The Baltimore Experiment.\" This doubter and his phrase have long since<br />\nlost even apparent justification. With the gift of a university site second to<br />\nnone in America, with a re-endowment of one million dollars dependent only<br />\nupon the final subscription of some thousands, now being actively sought, with<br />\na larger student body and teaching staff than ever in her history, with an ex<br />\nceptionally strong and capable administration, and with a quarter century of<br />\nalmost constant growth for record, it may he confidently asserted that an era of<br />\nstill greater expansion and opportunity has opened. And the best days are yet<br />\nto come. Said President Remsen in his inaugural address: \"I believe that a<br />\nnew day has at last dawned, and that the onward march will soon be taken<br />\nup.\" Great institutions, like great cities, are not built in a day. They grow.<br />\nGrowth is their vital essence; cessation of progress is death.<br />\nThe City of Baltimore, the State of Maryland, and the entire South are in<br />\nthe beginnings of a period of great material development, and for permanent<br />\nand best results the intellectual development of their citizens must keep pace<br />\nwith it. In this era, the Johns Hopkins will be such a factor as was the University of Berlin in the reconstruction of Prussia. But national and international as the fame of the University has become, it still m Itains a peculiarly<br />\nclose relation to this locality and its future.<br />\nThough all sections have shared alike the benefits of her pioneer work for<br />\nhigher aims and attainments in American education and scholarship, it is<br />\ndoubtful if anywhere the impulse given to intellectual and material development has been more deservedly appreciated or more zealously cultivated<br />\nthan in the South.<br />\n44<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\nThe natural advantage of proximity, and the rapid economic growth of an<br />\nera of peace, which restored her ability to seek again, as formerly, the higher<br />\ninstruction of her youth within her own bounds, led to a quick appreciation in<br />\nthis region of the unusual opportunities offered, for the first time in America,<br />\nby the Johns Hopkins, and to a constantly increasing stream of young men to<br />\nher doors.<br />\nThe State of Maryland, in twenty-five years. has sent to her 2,000 students,<br />\nand together with the rest of the South nearly 60 per cent. of the total enrollment. Thus has been fulfilled Dr. Gilman's promise, in his inaugural address<br />\nin 1876: that the university's influence should be \"first local, then regional, and<br />\nthen national,\" that it should be in truth as the heraldic legion on its shield<br />\nnow proclaims, \"An institution devoted to learning, both literary and scientific,<br />\nin the State founded by Lord Baltimore.\"<br />\nThese were not meaningless phrases. Independent of its environment as<br />\nthe university was with its magnificent endowment, he chose from the South,<br />\nfirst the men who were to represent this dual idea of the university system, Gildersleeve and Sylvester, former professors in the University of Virginia, fitly<br />\nsymbolizing the realization in Maryland of the Jeffersonian ideal of higher in<br />\nstruction conceived for Virginia. From that day fitness, not sectional, religious,<br />\nor political affiliation has remained the criterion of selection. Without sectional discrimination, Newcomb, Elliott, Browne and other Southern men were<br />\ncalled to her faculty, and the present staff of instruction contains no less than<br />\nforty men of Southern origin or connections, about the same number of Northern, and a similar representation from the West and foreign countries. This<br />\nresult, though without design, shows the broad liberality that governs the<br />\nadministration, and the creative work the university is doing for the South as<br />\nwell as for the rest of the country.<br />\nIt was here that the literary genius of Sidney Lanier first found appropriate<br />\nrecognition in appointment to a lectureship and in the much-needed encouragement from Mr. Gilman. We might mention, too, Woodrow Wilson of Princeton, and William P. Trent of Barnard, as typical of her contribution from the<br />\nSouth to the North.<br />\nThe university will not be the first to disregard the bonds of local attachment that are strengthening year by year. As a Maryland foundation; a \"Baltimore experiment;\" with locally invested funds fianciered by Marylanders;<br />\nendowed with buildings, lectureships, fellowships and scholarships by local<br />\nfriends; reclaimed from financial embarrassment, twice by private and twice by<br />\npublic aid in Maryland, re-created by the gift of a new site which Baltimore<br />\nwill not allow to remain vacant for lack of endowment, she has striven, and<br />\nwill strive, never merely to balance the account but to return a hundred-fold<br />\nthe benefits received. That her return to the state and the city, and to the<br />\nSouth alone has made her one of the best paying investments ever secured, no<br />\none familiar with the facts for a moment doubts.<br />\nA few of these contributions will be found suggestive: 1. More than any<br />\nother influence, the Johns Hopkins University has checked the exodus of youth<br />\nto foreign universities—a custom dating from colonial times at the South—by<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\noffering them not only equal facilities, but a training more American and more<br />\nsuited to our Southern needs. In the past year 360 out of a total of 694 students have been enrolled from the South. 2. The poor but deserving young<br />\nmen of this region have been aided financially and with honors more largely<br />\neven than those of other regions. The benefits of 65 annual scholarships out<br />\nof a total of 90 are limited to the South, and her sons compete on equal terms<br />\nfor the other twenty-five and for twenty fellowships. Over 350 Southern men<br />\nhave received such or greater honors here. 3. Southern Colleges and schools<br />\nhave been filled with men trained in the best methods of modern research and<br />\ninstruction, who are an inspiration to their students and instrumental in organizing associations for the advancement of the educational and material interests<br />\nof their respective States. Nearly 200 former students of Johns Hopkins are at<br />\npresent teaching in the South, distributed in every state and among more than<br />\n65 institutions. Two hundred more are engaged in business or professional<br />\nwork in the South. 4. The development of local industries of the highest importance, such as oyster culture in Maryland and Virginia, has been greatly<br />\nstimulated. A marine laboratory is maintained for the study of the life of the<br />\nChesapeake and of Southern waters. A physical analysis of soils has been of<br />\ngreat agricultural value. The geological department has accomplished much<br />\nfor the farmer, promoter, investor and land-owner in determining soil characteristics, water power facilities, transportation conditions, the location of mineral resources and in publishing and distributing its excellent topographical<br />\nmap and reports for Maryland. 5. The Medical School, aside from the inestimable benefits of its great hospital and trained men and women,has undertaken<br />\nresearches with good results upon the fatal diseases prevalent in this and Southern regions, such as fevers. 6. The first serious attempt on a large scale to<br />\ninsure the preservation of the history and literature of the South as written by<br />\nher own people, has been made through the historical department, which has<br />\npublished more than 20 monographs of original research upon Maryland alone,<br />\nand 61 upon Southern history, economics, and politics. It has the best collections and library facilities in this field of any American university, and it supplements these by courses of systematic instruction in Southern history and<br />\neconomics. 7. The bonds between Baltimore and the South, weakened by the<br />\nrise of new commercial towns and ports, have been greatly strengthened through<br />\nthe University's influence; and her twelve periodical publications bear the name<br />\nof Baltimore and Maryland to the whole civilized and educated world. 8.<br />\nImportant principles of the Johns Hopkins system have been copied in many<br />\nof the Southern Universities; the requirements for the doctorate, the expansion<br />\nof advanced or graduate study, the system of advisers, which insures a personal<br />\ndirection for the undergraduate and finally, a reliance upon the vital and essential, youth, vigor, enthusiasm, reality and the present, rather than upon dim<br />\ntradition and authority.<br />\nJAMPS CURTIS BALLAGH.<br />\n(Revised and rewritten by the author from hts article in The Evamidist, March 29, noa—ED.)<br /><br />\n4<br /><br />\nTHE NEWS LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nFublished Fortnightly during the University Year by the, Students of THE JOHNS.<br />\nHOPKINS UNIVERSITY.<br /><br />\nJUNE 4, 1902.<br />\nSubscription $i 50 per year.<br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br /><br />\n10 Cents a single copy.<br />\n.<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nkssistant Business Manager,<br /><br />\n.<br /><br />\nROBERT S. LAMER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\n. SOLOMON BLUM, 1908.<br />\nGEORGE A. FOSTER, 1904.<br />\n( REGINALD S OPIE, 1904.<br />\nW.S. BIRD, 1903.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1908.<br /><br />\nAddress all an ides, comnaunications, etc., to ROBERT S. LANIER, box 374, Johns Hop<br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE,box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nt<br /><br />\nHE TWENTY-SIXTH ACADEMIC YEAR of the Johns Hopkins University has<br />\nbeen one of progress in every department. With the accession of President Remsen, a new hand has been at the helm; but it has guided with<br />\nwisdom, moderation and foresight. The high position that the University has<br />\nmaintained in the world of education and research was attested at the celebration of her twenty-fifth birthday, when an unparalleled gathering of scholars<br />\nbrought congratulations and praise from West and East. The many services to<br />\nMaryland and the South rendered by the Hopkins are remarked on in the leading article of this issue. The unconditional gift of the Homewood estate has<br />\ncaused the dream of a splendid home for the University to become a possibility<br />\nof the near future.<br />\nThe financial cloud that for years has hung over us has not yet received its<br />\nsilver lining. The Committee of Seventy, which shouldered the task of raising<br />\nthe last quarter million of the endowment fund, report about $117,000 still unsubscribed. But there are sanguine hopes of an announcement on the Commencement Day, June 10.<br />\nComing to undergraduate life, there is to be seen the results of the same old<br />\n\"Hopkins spirit\" which enables our scanty undergraduate body, with the aid of<br />\na few grads. and medical students, to accomplish wonders.<br />\nAthletics, as reviewed on another page, have met with success. At the<br />\npresent time of writing, a lacrosse game is scheduled for June 11 with the Uni-<br /><br />\nTHEINEWS—LETTER.<br /><br />\n5<br /><br />\nversity of Toronto team, intercollegiate champions of Canada and Great Britain. We may fairly consider ourselves champions of the United States; so<br />\nthat the game will be the fiercest, with the gi andest prize for the winner, that<br />\nBaltimore will ever have seen or Hopkins ever played. Let us hope that,in thus<br />\nstepping from a local to a world arena, our mighty men will not get weak in the<br />\nknees from stage-fright.<br />\nThe Musical Clubs have had a prosperous season, and are keeping out of<br />\nfinancial troubles. The Public Debate was more successful than ever before,<br />\nand this year in addition served as a trial for Hopkins, first intercollegiate de<br />\nbate, in which our spell-binders did themselves much credit in their maiden<br />\neffort, although they lost to North Carolina. The student publications have<br />\nbeen carried on with the customary enthusiasm; the senior annual, just published, is in every way worthy of the graduating class. The long-looked-for<br />\nStudent Club has been evolved by the Junior Class. Interclass athletics have<br />\nbeen stimulated by two Junior-Freshman relay races and a tug-of-war, in addition to the usual foot ball game and cane rush. Indeed, there are no lines<br />\nalong which earnest work has not been done, and encouraging results obtained.<br /><br />\nTORONTO VERSUS HOPKINS!<br />\nA THROW FOR THE INTERCOLLEGIATE LACROSSE CHAMPIONSHIP OF<br />\nTHE WORLD.<br /><br />\nt<br /><br />\nHE greatest lacrosse game ever played by Hopkins will take place on June<br />\n11, when the crack Canadian twelve will line up against the Black and<br />\nBlue at American League Park.<br />\n.<br />\nThe intercollegiate champions of Canada have recently returned from a<br />\ntour through England, where they won every contest. That the team from the<br />\nNorth is an all-star aggregation cannot for a moment be doubted, but Hopkins<br />\nhas put up a wonderful game throughout the present season, and, although the<br />\nchances of defeating such an opponent may seem very small, still, all things<br />\nare possible. Every man on our team may be expected to do his duty, and it<br />\nis \"up to\" every student, supporter, and friend of the 'Varsity to give the<br />\ngreatest possible encouragement.<br />\nUndoubtedly, we have the strongest team Hopkins has ever had, and, from<br />\nthe outlook at the present, the strongest which will represent the University for<br />\nsome time to come. Recognizing that we have reached the zenith of our power,<br />\nthe management has very wisely embraced the opportunity to try for the world's<br />\nchampionship. Such a game as the contest promises to be is not likely to be<br />\nseen again in Baltimore for many years.<br />\nThe fact that the contest is an international one, decisive of the world's<br />\nchampionship, makes it likely that President Theodore Roosevelt will accept<br />\nan invitation to attend. The crowd should be a record breaker.<br />\nThe men have been on a training diet for several days, and outdoor practice begins to-day. Every effort will be made to get each player in perfect<br />\nshape, and the prospects are that on June lithe 'Varsity will trot on the field<br />\nin the pink of condition. Let every man help the management by talking up<br />\nthe game in every direction, and by coming himself.<br />\nScrubs, don't forget the 'Varsity needs you. If everybody will lend a<br />\nhand, victory is possible.<br /><br />\n6<br /><br />\nTHE NEWS—LETTER.<br />\nTHE CLASS OF '02.<br /><br />\nEDWARD B BEASLEY, track team, glee club, class executive committee<br />\n'00—'01, will enter the Johns Hopkins Medical School.<br />\nHENRY BERUWKES, DAVID MACHT, Phi Beta Kappa, and Wm. J. BUTTNER will study medicine at the Hopkins Medical School. Beeuwkes has played<br />\nfoot ball, and Macht was a Hopkins scholar.<br />\nELBRIDGE P. BERNHEIM has played on the 'Varsity lacrosse and foot ball<br />\nteams for two years, and played well. He will not return to the University,<br />\nhaving decided to go into business.<br />\nPHINEAS J. S. CAMERON, class foot ball team, and vice-president SubFreshman class, will return to the University.<br />\nJOHN G. CAMPBELL has taken an active part in everything connected with<br />\nthe University. He has been on the base ball team for three years, captain this<br />\nyear, played foot ball, prominent in the \"House\" and in the \"Senate,\" and<br />\nheld various class offices. As he will enter the Medical School we can expect<br />\nto have him with us occasionally.<br />\nROBERT T. CRANE, Freshman and Junior Class President, will take graduate work at the University.<br />\nALBERT G. DEW, Phi Beta Kappa, and twice a Hopkins scholar, will study<br />\nfor the ministry.<br />\nRoss MILES DIGGS, \"Hullabaloo\" editor, intends studying law at the<br />\nUniversity of Maryland. His experiences on the debating teams will \"help<br />\nsome.\"<br />\nJos. T. ENGLAND, prominent in track, class and debating at the University, will no longer be on hand at the \"meets\" to win points for the University,<br />\nsince he intends to adorn the legal profession.<br />\nHORACE C. GILLEsPIE has played foot-ball since entering the University,<br />\nwas captain of last year championship team, and has taken an active part in<br />\nclass affairs. It is to be regretted, but, according to report, he is going to work.<br />\nFREDERICK L. GUGGICNHEIMER Will join the Hopkins band at the University of Maryland. He has been prominent in debates.<br />\nJOHN P. HAND has taken the classical course. He will study for the<br />\nministry.<br />\nHENRY H. HAZEN, of the \"Hullabaloo\" staff and Freshman Class Executive Committee, will enter the Medical School.<br />\nLouis F. HILDEBRANT will return to the University to take graduate<br />\nwork in Romance Languages.<br />\nREEN C. HILL, editor of the NEwS—LETTER for three years, manager of<br />\nthe musical clubs, class executive committee and treasurer of the Y. M. C. A.,<br />\nwill return to the Hopkins.<br /><br />\n1<br /><br />\nE. P. BERNHEIM•<br /><br />\nR. T. CRANE<br /><br />\nR. M. DIGGS.<br /><br />\nN. C. GILLESPIE.<br /><br />\nC. C. HILL.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHis experience as editor in-chief of the NEWS LETTER, and editor of the<br />\nHullabaloo have inspired Wm. B. HILL to take up journalism as a profession.<br />\nWm. E. HOFFMAN, Jr., will enter the Medical School. So he can be<br />\ncounted on next year to help keep the Hopkins track team in the front rank, as<br />\nhe has since his Freshman year.<br />\nWM. KIRK has taken the Historical-Political course, and will develop his<br />\npower of oratory at the University of Maryland.<br />\nWm. H. KOPPELMAN will return to the University for graduate work. He<br />\nhas played on the mandolin club.<br />\nOGLE MARBURY, editor of the \"Hullabaloo,\" and Senior class secretary,<br />\nis undecided as to his future work.<br />\nCHAS. MARKELL, Jr., Phi Beta Kappa, Hopkins scholar for three years,<br />\nand president of the Chess Club, has demonstrated his reasoning and persuasive<br />\nfaculties to such an extent that he also feels forced to join the procession to<br />\nLombard and Greene Streets.<br />\nBARTGIS MCGLONK, director of the Lawrence Memorial Association and<br />\nclass executive committee, has decided to return to the University to take<br />\ngraduate work in biology.<br />\nROBERT E. MOORE has played on the 'Varsity base ball team for three<br />\nyears. He will enter the Hopkins Medical School.<br />\nLEWIS W. BRUNER and MCHARDY MOWER are undecided as to their future<br />\n.<br />\nwork.<br />\nLYMAN C. MURPHY, Banjo and Mandolin Clubs, athletic editor of the<br />\nNEWS-LETTER, will be at the Medical School next year.<br />\nCHAS. A. MYERS, Phi Beta Kappa, editor-in-chief of the \"Hullabaloo,\"<br />\nHopkins scholar for two years and class historian, will take a graduate course<br />\nin Modern Languages.<br />\nMARBURY B. OGLE, Hopkins scholar, 'Varsity base ball team, will return<br />\nto the Hopkins for graduate study in Latin and Greek.<br />\nAUBREY PEARRF„ it., has managed the NEWS-LETTER and track team,<br />\nand has been active in debating circles. He will enter Harvard Law School<br />\nnext fall.<br />\nISAAC R. PELS, of the Hullabaloo staff and Hopkins scholar, will enter<br />\nthe Medical School.<br />\nTHOS. C. PINKERTON will join the Boston colony at Boston Tech.<br />\nBENJ. S. PUTTS, business manager of the \"Hullabaloo,\" has played lacrosse for two years. Next fall he. will \"take up the study of law\" at the University of Maryland.<br />\nCHARLES F. RANFT has shown his artistic ability as art editor of the<br />\n\"Hullabaloo\" and the NEWS LETTER, and his athletic ability on the 'Varsity<br />\nlacrosse team. He will study law.<br /><br />\nW<br /><br />\nC. A. MYERS•<br /><br />\nB. HILL.<br /><br />\nA. REARM(' JR•<br /><br />\nH. B. STONE.<br /><br />\nWOLMAN•<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nWALTER F. REYNOLD'S and GIBSON EMERSON SISCO have taken the Mathe<br />\ninatical Physical course. Reruolds will return to the University for graduate<br />\nwork in physics, and Sisco will study engineering.<br />\nWm. C. SCHMEISSER will be remembered by posterity as captain of the<br />\ngreat lacrosse team of 1902. Unfortnnately he is going to study law, so will<br />\nnot be with us next year.<br />\nRALPH C. SHARRETTS, \"Hullabaloo\" and 'Varsity foot ball, will study<br />\nlaw.<br />\nJOHN A. SLEmoNs has managed the lacrosse team. and has been athletic<br />\neditor of the NEWS LETTER. His experience as University editor for the<br />\n\"American\" have been so remunerative that he will go into the newspaper business<br />\nSIDNEY SMITH has played foot ball and lacrosse. He will study law.<br />\nHARVEY BRINTON STONE, Phi Beta Kappa, editor of the \"Hullabaloo,\"<br />\nSenior Class President, track and field team for three years, foot ball team,<br />\nJunior, Senior and Intercollegiate debater, has found time to win two Hopkins<br />\nscholarships. Stone has acquired the reputation of being one of the best speakers ever heard in McCoy Hall. He is going to the Hopkins Medical School.<br />\nELLIOTT STROUSE, prominent in 'Varsity base ball, both as player and as<br />\nmanager, will study law.<br />\nSOLOMON STROUSR, Phi Beta Kappa, editor \"Hullabaloo,\" editor-in-chief<br />\nof the NEWS LETTER, Hopkins scholar, and Senior Class Vice-President, will<br />\nstudy medicine at the Hopkins Medical School.<br />\nSAMUEL WOLMAN, Phi Beta Kappa, twice Hopkins scholar, debater, will<br />\nput his scholastic ability to test at the Medical School.<br />\nPEREGRINE WROTH, Jr., Freshman and Junior Class poet, track team and<br />\ndirector Lawrence Memorial Association, will study medicine.<br /><br />\nSENIOR CLASS WEEK.<br /><br />\nt<br /><br />\nHE class of '02 begins the festivities of Senior Week tomorrow. At the<br />\nnoon hour they will form in line for the usual senior procession. In the<br />\ncourse of a tour around the buildings, speeches are made in all the rooms<br />\nand responded to by the professors. In the evening President Stone will entertain his class-mates at his home in Towson.<br />\nOn Friday morning '02 goes to Homewood. The ceremonies have not been<br />\ndecided upon as yet, but the class expects to plant the class ivy somewhere upon<br />\nthe estate. In the evening Dean Griffin holds a reception for the class at the<br />\nHopkins Club.<br />\nSaturday the class takes an outing at the former home of the Maryland Yacht<br />\nClub. The trip is made by the trolley and then by launch to the grounds,<br />\nwhere the afternoon and evening will be spent. On Sunday, June 8, the baccalaureate sermon will be preached by Rev. Amory Howe Bradford, pastor of<br />\nthe First Congregational Church of Montclair, N. J. Dr. Bradford is an associate editor of the Outlook. The sermon will be delivered at 11 o'clock at the<br />\nAssociate Congregational Church, corner of Maryland Avenue and Preston<br />\nStreet.<br />\nOn Monday the much-heralded senior prom takes place in McCoy Hall<br />\nThis is strictly an invitation affair, to which seniors alone can issue invitations.<br />\nTuesday is Commencement Day. The exercises will be held at 4 o'clock at<br />\nthe Academy of Music. At 8 o'clock the University will hold a reception in<br />\nMcCoy Hall for all the graduates, doctors of philosophy, the medical graduates<br />\nand the members of '02.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nTrack and Field.<br />\nJUNE 7.<br /><br />\nWestern Maryland College Games at Westminster.<br /><br />\nLacrosse.<br />\nJUNE 11. University of Toronto at American League Park.<br /><br />\nFoot-ball (Next Fall.)<br />\nOCTOBER<br /><br />\n11,<br />\n18,<br />\n25,<br />\nNOVEMBER 1,<br />\n8,<br />\n\"<br />\n15,<br />\n22,<br />\n27,<br /><br />\nRock Hill.<br />\nMaryland Agricultural College.<br />\nDelaware College.<br />\nWestern Maryland College.<br />\nGallandet,<br />\nRichmond College.<br />\n(Thanksgiving Day) University of Maryland.<br /><br />\nTHE YEAR IN ATHLETICS.<br />\n141) JOHNS HOPKINS\" may well be proud of the achievements which<br />\nhis teams have gained in the different branches of athletics since last<br />\nSeptember. With our small number of students and the poor facilities for proper training by which we are handicapped, the intercollegiate football championship of Maryland, the championship in track and field work<br />\nagainst all Maryland, and the intercollegiate lacrosse championship of the<br />\nUnited States can by no means be considered a small accomplishment for one<br />\n.scholastic year. It is practically all we could have done.<br />\nOur championship relay team did not bring home another banner from the<br />\nannual relay races at the University of Pennsylvania, but had not W. E. Hoffman fallen by accident, we should most certainly have had one more pennant<br />\nfor the trophy room. Notwithstanding this, the boys ran a great race, and<br />\ncame very near winning out anyhow. The track men more than made up for<br />\nthis defeat, however, by the great work done in the championship games held at<br />\nElectric Park on May 14. Hopkins made a total of 60 points while our'nearest<br />\ncompetitor—the Maryland Athletic Club—gained 36 points.<br />\nAt the beginning of the foot ball season those men who understood the<br />\nsituation best were sincerely sorry for Captain Gillespie. The vacant positions<br />\ntman, Butler, Bruton, Tyler a nd Morse were among those which it was<br /><br />\n440<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\n. a,, •... .<br />\nV. -,. If,'<br />\ni,,<br />\n.0<br /><br />\n,<br />\n•<br />\n'<br /><br />\n....,.<br />\nop . • ev.s.<br /><br />\n4.<br />\n.•<br /><br />\niiWW M‘<br />\np A.<br /><br />\n•'4'<br />\n.... T<br />\n•-<br /><br />\n•<br /><br />\n'..*IT<br />\n'<br /><br />\n'' 4<br />\n0<br /><br />\n,.•<br /><br />\n••„<br /><br />\n,.<br />\n'at• •<br />\n4 :.<br /><br />\n,.<br /><br />\n'<br /><br />\n.44<br />\n.<br /><br />\n\"<br /><br />\n:k .'40,4::;47:\\:1104<br />\n4'<br /><br />\nvit<br /><br />\n• *1 4i<br /><br />\n-<br /><br />\nlet\"faioN,<br />\n711roirrel<br />\n7444,<br /><br />\nCAPTAIN SCHM EISSE R<br /><br />\nLACROSSE•<br /><br />\nCAPTAIN ENGLAND<br /><br />\n•10<br />\n‘.<br />\noti<br />\n, „virvoin<br />\not<br />\nkfrf wit%<br />\nut<br /><br />\nTRACK<br /><br />\nfound impossible to fill. Nothing daunted, however, \"Horace\" went to work<br />\nin an endeavor to squeeze every bit of material that could be found in the<br />\nUniversity, and \"Mack\" led the crusade in search of recruits at the Medical<br />\nSchool. The scores at the beginning of the season were discouraging, but<br />\ngradually better material began to appear, and, in the first of our championship<br />\ngames,—that with Western Maryland College,—we won in good style by a<br />\nscore of 12 to 0. Nevertheless, the championship game with St. John's was<br />\ncontemplated with fear and trembling. The Annapolitan crowd did not hesitate to say that they were represented by the strongest team which they had<br />\ndeveloped for years, and Dr Cain,'supervisor of athletics at St. John's, wrote<br />\nto \"Father Bill\" and confidently informed him that a good walloping for Hopkins was inevitable. And from St. John's showing against teams like Swarthmore and Gallaudet, things did look somewhat blue. Our men were not discouraged by the prospect. The appearance of such men as Garwood, Faris,<br />\nYoutz, Weil, Houghton and Whipple from the Medical School greatly improved<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nC.'02 RELAY TEAM.<br /><br />\nmatters and the showing made against Haverford encouraged us to hope that<br />\neven St. John's might be beaten.<br />\nThe day of the game dawned with black clouds frowning down on the<br />\nAmerican League Park from every side, and the continuous downpour throughout the afternoon converted the gridiron into one hugs mud-puddle. In the<br />\nfirst half a battle royal was waged and neither side scored; but in the second,<br />\nHopkins' rooters shouted for joy when they saw our men slowly but surely<br />\nworking the ball towards St. John's goal. The oval was carried to the oneyard line, and, on the third down, St. John's center seeing that the game was<br />\nlost unless some sort of strategy were resorted to, interfered with our center<br />\nman. The referee promptly gave us first down, and to the visitors' great discredit, they showed the \"yellow back\" by refusing to play. The only spoitsmanlike action open to them was to finish the game under protest. The game<br />\nwas promptly forfeited to Hopkins, and with it came the intercollegiate chain<br />\npionship of Maryland.<br />\nDuring the winter, very little was heard from either the track or the lacrosse<br />\nteams, but both squads were quietly doing good work in the cage and on April<br />\n5 the seasons opened in a manner very satisfactory to our adherents. The<br /><br />\nTHE NEWS-LETTER.<br />\nlacrosse team defeated the University of Pennsylvania at Philadelphia by<br />\na<br />\nscore of 6 to 1, and the first track and field games ever held in the \"cage\"<br />\ngave<br />\nus a majority of points.<br />\nFrom that time until May 19, lacrosse held sway, and well it might.<br />\nAlthough Tyler, Bruton, J. Bandel and Hatch were lost, good men turned up<br />\nto take their places, and when Hobart was beaten in the second game by<br />\na<br />\nscore of 12 to 1, the rooters joyously shouted, \"Our boys are out for the championship!\" And they were. Harvard went down on the Saturday following by a score of 11 to 1, and when Swarthmore was played to a standstill, 8-2,<br />\nin the closing game, the \"has beens\" declared the team of 1902 the strongest<br />\never turned out by Hopkins.<br />\nCaptain England capped the climax by clipping 2 1.5 seconds off the State<br />\nrecord, at the News Cup games.<br />\nWith so much to be done in the foregoing branches of sport, it hardly<br />\nseemed possible that sufficient material could be spared for base ball. Notwithstanding, Captain Campbell and his men made a very creditable showing under<br />\nso many discouraging circumstances. We hope they may improve next year.<br />\nFOOT BALL ('VARSITY GAMES.)<br /><br />\nJ. H. vs. Rock Hill College, 24-5.<br />\nMd. Agricultural Col., 6-0.<br />\nGallaudet College,<br />\n0-12.<br />\nHaverford College,<br />\n0-5.<br />\nDelaware College,<br />\n27-0.<br />\nWestern Md. College, 12-0.<br />\nSt. John's College, Forfeit<br />\nto H. U.<br />\n14<br />\nUniv. of Maryland,<br />\n5-5.<br />\nClass Game.<br />\n(Juniors vs. Freshmen),<br /><br />\n12-0.<br /><br />\nLACROSSE.<br /><br />\nJ. H. vs. Univer. of Penna.,<br />\n5-1.<br />\n\" \" Hobart College,<br />\n12-1.<br />\n.4<br />\n41<br />\nHarvard University, 11-1.<br />\n41<br />\n11<br />\nLehigh University,<br />\n9-1.<br />\n61<br />\n46<br />\nColumbia University, 17-1.<br />\n11<br />\n\" Swarthmore Univer., 8-2.<br />\nEASE- BALL.<br /><br />\nCAPTAIN CAMPBELL- BASEBALL<br /><br />\nJ. H. vs. Rock Hill,<br />\n15-10.<br />\n\" Naval Academy,<br />\n8-17.<br />\n64<br />\nGettysburg,<br />\n2-9<br />\n\" Md. Agricultural Col., 2-3.<br />\n\" Georgetown College, 1-23.<br />\n\"„ Western Md. College, 6-1.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nTHE NIFTY NICKEL-PITCHERS.<br /><br />\nOf all the occupations<br />\nWhich engross the college man<br />\nOf all the college pastimes,<br />\nNickel-pitching leads the van.<br />\nIt used to be that pennies<br />\nWere regarded a big stake,<br />\nBut it was soon decided<br />\nThat it took too long to break<br />\nA bloomin', bloody Freshman<br />\nIf he had a good sized pile,<br />\nAnd thus at last it happened<br />\nThat the nickel came in style.<br />\nBeware the game so sinful,<br />\nFor it really can't be beat,<br />\nIf any new man tries it<br />\nHe will surely court defeat.<br />\nIt takes a skillful player<br />\nTo manipulate the game<br />\nTo toss up the collection,<br />\nAnd then pocket all the same.<br />\nL'ENVOI.<br />\n0 gamblers out on Ross Street!<br />\nYou have got my little all,<br />\nAnd ne'er again I'll linger<br />\nPitching nickels at the wall.<br /><br />\nUNDERGRADUATE NOTES.<br />\nelection of<br />\nOn Monday of last week the Musical Clubs held their annual<br />\nC. Pagon,<br />\nR.<br />\nnt;<br />\npreside<br />\n'02,<br />\nHill,<br />\nC.<br />\nE.<br />\n:<br />\nofficers. The following were chosen<br />\nCarver,<br />\nB.<br />\nW.<br />\nr;<br />\nmanage<br />\nnt<br />\nassista<br />\n1st<br />\n'03, manager; H. H. Hutnrichouse, '04,<br />\nBryan,<br />\nJ.W.<br />\nClub;<br />\nBanjo<br />\nof<br />\nleader<br />\nG.,leader of Glee Club; C. A. Marshall, '03,<br />\norgar•<br />\nthe<br />\nfor<br />\nution<br />\nconstit<br />\na<br />\nof<br />\ntion<br />\n'03, leader of Mandolin Club. The prepara<br />\n,<br />\nCarver<br />\nB.<br />\nW.<br />\nEager,<br />\nH.<br />\nJ.<br />\ntee:<br />\n-ization is in the hands of the following commit<br />\nwill<br />\nons<br />\nprovisi<br />\nother<br />\nAmong<br />\nW. Snowden,'03. This will fill a long-felt want.<br />\nmanager and three<br />\nbe one for the wearing of the letters \"H. M. C.\" by the<br />\nleaders.<br />\nthe bay to<br />\nTo-morrow the class of '04 will have a reunion and trip down<br />\nTolchester, leaving on the 2 o'clock boat.<br />\ned to Dr. W.<br />\nWednesday May 28th, the class in English Literature present<br />\nS,<br />\nH. Brown,\"A. History of English Dramatic Literature\" by W. A. Ward. J.<br />\n.<br />\nreplied<br />\nGrasty made the presentation speech, to which Dr. Brown<br /><br />\nTHE N EWS- LET TER BOARD OF EDITORS•<br /><br />\nTHE FOOTBALL SQUAD OF LAST FALL•<br /><br />\nTHE BASEBALL TEAM<br /><br />\nMANDOLIN. oU1TA11,AND BANJO<br /><br />\nUNIVERSITY CAFE.<br /><br />\nTAUGHT eV<br /><br />\nC. J. LEVIN•<br />\nwho has made a life study 01' these Instruments. Mandolin Soloist of National reputation. erepares Students<br /><br />\nfor tIopkins Musical Clubs.<br /><br />\nStudio. 331 N. Charles St.<br /><br />\nCHAS. LINDENMEYER. Prop.<br /><br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dining. Rooms.<br />\nMeals Served at all Hours.<br /><br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br /><br />\nNT0 CID ricDIR<br /><br />\nNICD<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br /><br />\n321 W. Baltimore Street,<br /><br />\nCHESAPEAKE RUBBER COMPANY,<br /><br />\n1<br />\n8c (Q.,<br />\nAI,A_ E3.1Et7<br />\n675 West Baltimore Street,<br />\nO.Between Arch and Pine Sta. Baltimore, Md.<br /><br />\nWEST BALTIMORE LOAN C<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br /><br />\nOPEN<br /><br />\nFROM<br /><br />\n7<br /><br />\nSATURDAYS<br />\nA. M. TO 6 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br /><br />\nSMITH, DIXON Lk CO.<br /><br />\nF'fif'Ffi<br />\n29-31 S. Charles St.<br /><br />\nF3altimoire, Md.<br /><br />\nPiGturcs<br />\nRND<br /><br />\nFraming.<br /><br />\nUNTIL 10 P<br /><br />\nM.<br /><br />\nFRANKE &amp;<br />\na PURNELL CO.<br />\n224 N. HOWARD ST.<br /><br />\nGreek Letter<br />\nA. [I, MAG I fratermtv<br />\njcwelrr.<br />\nMANUFACITURIN OF<br /><br />\n14 AND 16 ST. PAUL. STREET,<br /><br />\nBALTIMORE, MD.<br /><br />\nFINE<br /><br />\nrural. CALL AND [(AMON( OUR LINe 0[FORIC PUNINAOINO.<br /><br />\nJ. H. ROBINSON.<br />\nMANUFACTURER 9W<br /><br />\n• FINE• CIGARS.<br /><br />\nBonbons, Mutates,<br />\nCONFECTIONS.<br />\nFRESH EVERY.HOUR. SENT BY MAIL OR EXPRESS.<br /><br />\nDEALER IN<br /><br />\nTOBACCO, clAZIA RR A NO SMOKERS' ARTICLES,<br />\nSPAT1ONKHY,<br /><br />\n14 EAST BALTIMORE STREET.<br /><br />\n020 N. EUTA W ST.<br /><br />\nBALTIMORE, M D.<br />\nBaltimore, New York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone. Madison 11851.<br /><br />\nDegigeing aryl ['tilting by E Michaelson.<br /><br />\nl. MIGliftELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nALTERING AND REPAIRING<br /><br />\n821 riadison Avenue,<br />\nN E LOP. tlArrIMS'U<br /><br />\nSpecial discount to Students.<br /><br />\nBALTIMORE, MD.<br /><br />\nNgrdilf<br /><br />\nLAI.TIAQ111!,MD.<br /><br />\nGUIrSEFC'S<br /><br />\nYOU WILL<br /><br />\nUNRIVALLED<br /><br />\nlice Cream anb Ices,<br /><br />\nThe Itorrie Friendly Ins. Go.<br />\nloo W. Fii•YETTE ST.<br /><br />\nN. W. Car. North Ave. and Barclay St.<br />\nC. &amp; P. •PHONC PAAIDi6ON 643-A<br />\nMD. DRUID<br />\n715<br /><br />\nBE INTERESTD in reading a<br />\nHome Friendly booklet, which<br />\nwill be mailed you on receipt of<br />\nyour address. * * * * *<br />\n*<br /><br />\nBALTIMORE, MD.<br /><br />\nWM. M. EARECKSON,<br /><br />\nC. &amp;<br /><br />\nTELEPHONES:<br />\nSt. Paul 2040. Courtland 444.<br /><br />\nE. COONAN, Pres.<br /><br />\n—DEALER IN ALL KINDS—<br /><br />\nEwn. TAYLOR, Manager<br /><br />\nMARYLAND ENGRAVING COMPANY<br />\n7<br /><br />\nOFFICE AND YARD,<br /><br />\n(Incorporated.)<br /><br />\nHALF-TONES, ZINK MI-11MS, CCLCR<br /><br />\n1433-1435 W. LAFAYETTE AVE.<br /><br />\nWORK, SKETCHES, DESIGNS.<br /><br />\nLime, Hair, Bricks, Cement, Plaster, Sand and<br /><br />\n214-216 WAlEH ST.,<br /><br />\nFeed.<br />\nHall For Rent for Parties, Etc ,apply at Office.<br /><br />\nBaltimore, Md.<br /><br />\n&amp; I. 313611-3/ Si. PAUL.<br /><br />\nUSE THE BEST<br /><br />\n...fflatoes Vreeto...<br />\nBoth 'Phones.<br /><br />\nYOU WILL LIKE_ IT.<br /><br />\nJosh Billings<br />\nonce said he had \"read, heard of and seen a great many good things on<br />\nmilk, but the best thing he had ever seen on it, was CREAM,\"<br /><br />\nThe Pikesvill6 Dairy Go.<br />\nSupplics the highest quality of Milk and it fills J psh Fillings requirement.<br /><br />\nG. W. EVANS, -<br /><br />\n- - Pres. and Gen. Mgr<br />\n1511-13-15 ARGV1 F AVE.<br /><br />\nJ. H. WAHMANN,<br />\nLuxiNG-roN STREET,<br /><br />\n118 W.<br /><br />\nBaltimore, Md<br />\nMATERIALS FOR EMBROIDERI NO, KNITT1 NO, CROCHETING AND LACE MAKING.<br />\nFANCY WOOLEN YARN OF<br />\nEVERY DE4CRIPTION.<br />\nA writsTic STAMPING AND DESIGNING.<br /><br />\nINSURANCE,<br /><br />\nCOLLECTIONS.<br /><br />\nIRA E. MOESSINGER,<br /><br />\nSTENOGRAPHY, TYPEWRITING, MIMEOGRAPHY.<br />\nint FI('ITI.ARS MAli.P.1).<br />\n408 CONTINENTAL TRUST BUILDING<br />\nMd. Phone, Courtlund 1275,<br />\nBA LT' MOUE, MD<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n' 804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nIs a scientific adjustment of'the human anatomy, by mechanical manipulation, by which We remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature\" can restore the part to its normal condition. We<br />\ntreat all dikeascs, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We vr ill be glad<br />\nto furnish any further information on application.<br />\nW. D. HOW EN, M. D., D. O.,<br />\nProst. &amp; Mgr.<br /><br />\nMARIABUIE,D. 0.,<br /><br />\nWedding Silver rig\"<br />\nSilversmiths.<br />\n..0<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Rooks,<br />\nMadison &amp;Howard Sts.<br />\nStudent's Supplies.<br /><br />\nUMBRELLAS, HATTERS, CANES,<br /><br />\n',<br /><br />\n3.<br />\n24 WEST BALTIMORE:<br />\nManufacturers of<br />\nHOPKINS<br />\nanti Cassimere Hats.<br /><br />\nsilk r<br /><br />\ncusifiNG &amp; COMPANY,<br /><br />\nStationer's.<br />\nSCHOOL, LAW MEDICAL. CLASSICAL AND MISCALLANCOUS Boons<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nII. R. ElSENBRANDI SONS,<br /><br />\nJORDfili UHLER GO.<br /><br />\nAPPLY TO<br /><br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201.20:3 N.CHARLES ST.<br /><br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nOtto Ii.NVilliams,<br />\nV ice-Pt csideut.<br />\nI. E. Marshall, Asst, Cashier,<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nCapital. $660,000<br />\nSurplus and Profits $450.000.<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nCAPS<br /><br />\n[Wolof:dies and<br /><br />\n34 W. BALTIMORE ST.<br /><br />\nfor<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nETC.<br /><br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br /><br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman Zic Son,<br />\nMLILM,<br />\n7°<br />\n.,„<br />\nReads us follows: Samples submitted of<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye WhIskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br /><br />\nJANINS R. IAIME.<br /><br />\nF2INT F;R &amp; CC).<br /><br />\nNV<br /><br />\nIN GREAT VARIETY.<br /><br />\nHenderson's •Ps<br /><br />\nSec'y. h Treas.<br /><br />\nTHRO, WARNISR.<br /><br />\nESTABLISHED 1079.<br /><br />\n.JACC)E31 a JENKINS,<br />\n210 N. CHARLES ST.<br /><br />\nH. MeMAINS, n. 0.,<br /><br />\nV.-Prest. &amp; Asst. Seey.<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN,<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br /><br />\nA. D. SMITH &amp; SONS,<br />\nFormerly<br />\nLEVERING &amp; SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children<br />\nIn the Latest Designs.<br />\nMEN'S HATS—Derbys and Soft Mtg.<br /><br />\nthe lizrany.Snifth<br />\npiano CO.<br />\n109 and ill North Charles Street.<br />\nSOLE AGENTS<br /><br />\nilgenithz<br /><br />\nCbickertno, 113rat)burti ant) 11111ebster<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBaltimore<br /><br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO.<br /><br />\nHABERDASHERS.<br /><br />\nShirts, NeckwRar,<br />\nUnderwear, Honiery,<br /><br />\nEtc.<br /><br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\nST. &amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br /><br />\n203W. BALTIMORE<br /><br />\nMembei, of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange ,<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE de CO.,<br />\nBANKERS ell BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A<br /><br />\nNELSON. GEN'L MANAGER<br /><br />\nHospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br /><br />\nPhysicians,' Burgeons,'<br /><br />\nBaltimore, Md.<br /><br />\n300 N. Howard St,,<br /><br />\nDrovers and<br />\nt<br /><br />\nMechanics Habana! Bad,<br /><br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock,$300,000.<br /><br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVEP<br /><br />\nYOLI1FC EYLS<br /><br />\nPANY,<br />\nTemple.)<br /><br />\nSAYRE OPTICAL<br />\ntroot.<br /><br />\nC. &amp; P.'Phone 232-2.<br /><br />\nFactory Prices.<br /><br />\nSMITH'S s0H(,r)22Terr&amp;B atoGE<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTORE<br />\n3rd door from Madison.<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged . . •<br />\n605 N. Eutaw Street.<br /><br />\nWM. V.PIPPEN,<br /><br />\nA. ii. Rutherfoord.<br />\nF. Lents.<br /><br />\nJ. Wm, Middendorf,<br />\nA. J. Robbins.<br /><br />\nJ. WM. MIDDENDORF &amp; CO.<br />\nVanhers &amp; troller°.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br /><br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br /><br />\nt,0<br /><br />\n1\\lcsi, 30/4<br /><br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\n221 North Ch<br /><br />\nPianos.<br /><br />\nk...usonie<br /><br />\nK,XFt.MIN:110 OPTIGIFHNS.<br />\nTHE NEWS LETTER<br /><br />\nY. M. C. A. BUILDING,<br />\nBALTIMORE, MD.<br />\nC. 1t P. and Md.'Phones.<br /><br />\ncm ON<br /><br />\nJft8. It. DOWNS,<br />\n229 N. Charles St.,<br /><br />\n----MASONIC TIEM PLC.<br />\nFOR<br />\n7<br /><br />\nClass, Fraternity and College StationerY,<br />\nBanquet Cards, Invitations, Diplomas,<br />\nPrograms, Visiting Cards, etc. ......<br /><br />\nOur fiflic J. fi. U. Blue and<br /><br />\nBlack Play Paper—now ready.<br /><br />\nThere fa verii tittle entertainment at home without s Plan°<br /><br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nTIE FF<br /><br />\nBALTIMORE<br /><br />\nWe carry a lull line of Students' Note Books and Stationery<br />\nBoth 'Phones,<br /><br />\nPIANos<br /><br />\nfire The Best.<br /><br />\n9 N. Lihertu St.<br /><br />\n.-<br /><br />\n--.1=0111<br /><br />\nr4r<br /><br />\n• 4+<br /><br />\n...,4 ,.<br /><br />\n•(.... ,<br /><br />\n\"'<br /><br />\n• li.<br /><br />\n. -L•<br />\n...,,,7„. '..A<br /><br />\n.4,<br /><br />\n,<br />\n,Nk4,*.,64: ,t<br />\n`1,,\"<br />\n..17-. %<br /><br />\n....<br /><br />\n•i\" -\"- '<br /><br />\n01<br />\n,<br />\n1',.<br />\n1./..'<br />\n'.<br />\n•4e'<br /><br />\n.- .<br /><br />\n4., S.,,<br /><br />\n, •<br /><br />\n-<br /><br />\n, ,<br /><br />\n.\"'<br /><br />\n-<br /><br />\n4<br /><br />\n.' •-•Vv''<br /><br />\n1<br /><br />\ni<br /><br />\nea-<br /><br />\n•<br />\n}4.<br />\n.1,<br /><br />\n•“hy<br /><br />\n''',<br /><br />\n•<br /><br />\n,., •i<br />\n..P',;,.<br /><br />\nra,, , •r... ,;',.<br /><br />\n„64<br />\nArj<br /><br />\nr• •<br /><br />\n' i<br />\ndr. it in..<br />\n-_ i<br />\n4i<br />\n11<br /><br />\ns, • 0 N.<br />\n. i,<br />\n''''k'• *<br /><br />\n•<br /><br />\n,<br /><br />\nfr. .-(:,<br /><br />\n.4i;,<br /><br />\n;,,,,<br /><br />\ni<br /><br />\n4 ,<br /><br />\ni<br /><br />\nlc.. .<br /><br />\n,,a\"r<br /><br />\n1<br /><br />\n.•<br /><br />\n• • r„<br /><br />\n4<br /><br />\nr<br /><br />\nf<br />\n•<br /><br />\n.4t44IA\",<br />\n911<br /><br />\n•.\"...-<br /><br />\n.,4\"r •<br />\n.4,<br /><br />\n4t4.4.<br /><br />\n..c, •<br />\n'<br />\n.A\"<br /><br />\n„<br />\n4. 411t,<br /><br />\n,,<br />\n'<br />\n' 1••<br />\n1$ . ••<br />\n....<br />\n'<br />\ni<br /><br />\n'<br />\nr '<br /><br />\n.t.,•.. 4.Srl.............' .. ..4 *<br /><br />\n14„,„,01111mt •<br /><br />\n. Al, ,<br /><br />\n1<br /><br />\n• 4.4,'<br />\n• 1,.<br />\n-1101P'•<br />\niii,.. •...r..44e, , -4,. - • , .<br />\n•.; 1 '4r4 „K.<br />\n4<br />\ni', 4 • • 4,•••''<br /><br />\nS.,-, .•<br /><br />\n,,<br />\n. *V*.1 e<br />\n'<br />\n,0 ,All A..<br />\nIP.<br />\n4.0 y • ....:1,. .,, ...„<br /><br />\nIll<br /><br />\n.,<br /><br />\n•<br /><br />\n1:\". :.,'( .<br />\n'<br />\n'<br />\n4)4 .1.situo,<br />\n- •:'<br /><br />\now\"<br />\n..\" • .1<br />\n• e<br /><br />\n't•<br />\n•,...<br />\n'<br />\n!'.`4,\"'.<br />\n. 116 ..,<br /><br />\n4<br /><br />\n..... 1,,<br /><br />\n-.1<br />\n'<br />\n.-'' .<br /><br />\nmi., 1,1,...c<br /><br />\n•<br /><br />\n\\- .• ,.<br />\n44'<br />\n4<br />\nv.'\"Tv: ,,.., P• \".)<br />\n..i .•<br />\n1<br /><br />\n47* '<br />\n4.<br />\n'<br />\n-rt., • ,-4...,<br /><br />\nr • .,. 4<br />\n,. . .. ,,•.;: :,..‘ ..„,<br />\n•<br />\n, C'.<br /><br />\nyl<br /><br />\n411..<br /><br />\n-t<br />\n.<br />\n..'2.„„..,- ,t0<br /><br />\n- .04 ...;•' • y •<br /><br />\n.4.'14,<br /><br />\n'14<br />\n4 • ,.<br /><br />\n4<br />\n.,<br />\nt,<br />\n40i.<br /><br />\n...<br /><br />\n3<br /><br />\n.. ,I'•<br />\n'<br />\n•-<br /><br />\n•<br /><br />\ni<br />\n10 ,.... ,,.,<br /><br />\n...)„. ,<br /><br />\n'<br /><br />\ni.. ,<br /><br />\n'1\" AP<br /><br />\n1<br /><br />\nI<br /><br />\nt<br />\n,,<br />\n,<br />\nr• .<br /><br />\n•<br /><br />\n,.<br />\nr<br /><br />\n.<br />\n•<br /><br />\n.. k k<br />\n,<br />\n,k -<br /><br />\n.•I<br /><br />\nSILP<br /><br />\n. ei,,<br /><br />\n40'<br />\n.r•<br /><br />\n44<br />\n.<br />\n1*<br /><br />\n, A,<br /><br />\n.<br /><br />\nrf. ...1144,' 1'''7i<br /><br />\n.?<br />\n.<br />\nS'<br />\n.'<br />\ni<br /><br />\n•<br /><br />\n•<br /><br />\nil ,<br />\nI..<br />\n4<br />\n.<br />\n1.<br />\n• . ,irt<br />\n14.,eve.<br />\n4,<br /><br />\n... •<br /><br />\n\"<br />\n1<br />\n;<br /><br />\nNEL , t<br />\n;<br />\n`le<br />\n4,, ,•-...!<br />\n.<br /><br />\n•.,<br /><br />\n, •<br />\n-4 .-,<br /><br />\n4a.<br />\n•<br />\nA\"<br /><br />\nOh.<br /><br />\n1.<br />\n•<br /><br />\n•!le.<br />\n•<br />\n,<br />\nOrryPorigt<br />\n,,,,...<br />\ndi<br /><br />\n. 4,•11L*7..‘<br />\n'' . •LA)<br />\n• '<br />\nt4<br />\n4<br />\n;,<br /><br />\n.c.,<br />\n'<br /><br />\n..,., t<br /><br />\n741<br />\n......,<br /><br />\n.11<br /><br />\ne lii,t<br /><br />\n\"O•<br /><br />\n••• 1<br /><br />\n. te';4.c - /. '<br />\n....44 ir-tr''<br />\n-<br /><br />\n.1''' : 7 •<br /><br />\nr .1<br /><br />\n'4 -•<br /><br />\nre<br /><br />\n'Ned<br /><br />\n,-.<br /><br />\n,.14. •<br />\n0' • ? -<br /><br />\n.<br /><br />\n...oh.,4 . . ../<br /><br />\n.<br /><br />\n'.,` •<br /><br />\n••''''''.4'.<br /><br />\n. ,•<br /><br />\n,6.<br /><br />\nit<br /><br />\n.1.<br />\n40,... .<br /><br />\n1<br />\n14<br /><br />\n., ....<br /><br />\n;1:<br />\n.(' . '<br />\n,.1<br /><br />\n1.•,J<br /><br />\n#. at se• -<br /><br />\n.h.<br />\nsti, \" •,..<br />\n• '''. 1<br /><br />\n) . \"•• ibir<br /><br />\n..<br /><br />\n4. .....<br /><br />\n,<br />\n1<br /><br />\n'<br />\n.<br /><br />\n..<br /><br />\nIt<br /><br />\ni t1<br /><br />\n1<br /><br />\n•<br /><br />\n'01' • ,<br /><br />\n,<br /><br />\n4.'1r<br />\n'<br />\n-I<br /><br />\nna.<br /><br />\n,<br /><br />\nt•<br /><br />\n'.*i<br /><br />\n'r<br /><br />\n.111<br /><br />\n44<br />\n.4 . .<br /><br />\n•,<br /><br />\n:<br />\n4,,..1...iii .<br />\n.1-4,:, I,?<br />\n\":<br />\n.....•,.s<br />\n' i II!. 40'<br />\n.16<br />\n'<br /><br />\n,<br /><br />\n..•<br />\n' )<br /><br />\n't<br />\n'<br />\n\"1\"I<br />\n• )..h, 4<br /><br />\nT..-4„54.1<br />\n0. 1<br /><br />\n...i. • i;.<br /><br />\n- 1.<br />\n'''<br />\n_ '1.:<br />\n,4<br />\n?' /<br />\n1<br />\n4<br />\n1..Aisti ' Il<br />\n\"<br />\nl :<br />\n„op •<br /><br />\n,<br /><br />\n,<br />\n. .r<br /><br />\n.<br />\n.<br /><br />\nkg<br />\n'<br /><br />\n.,,,i<br /><br />\nt'Al01:<br /><br />\n• •••<br /><br />\n-.14..<br /><br />\n• .:'<br />\nIrl N.<br /><br />\n,,,,•<br /><br />\nr<br /><br />\n.<br />\n.r<br /><br />\n;.'\"1.<br />\n;<br />\ni<br />\nN<br />\n'<br />\n1<br /><br />\n( .k<br />\n./1). . ._<br />\nev,--A:<br /><br />\n#\"‹<br />\n)<br />\n11<br />\n.<br /><br />\n,<br /><br />\n'<br />\n'<br />\nd 4<br /><br />\ni<br /><br />\nlt<br /><br />\n,, .4<br />\n, lili•<br /><br />\n,<br />\n0 -4,<br /><br />\n•r 1,<br /><br />\n4.,,<br /><br />\n1<br /><br />\nr•<br /><br />\n•-1 •<br /><br />\n0.<br />\n.0,<br />\n,,4;:kt, '<br /><br />\n.1<br /><br />\n1<br />\n.•<br /><br />\nP.<br />\n•<br /><br />\n.<br /><br />\n- .,..<br /><br />\nI,<br />\nP•44<br />\n.:1t<br />\n.<br /><br />\n.0<br /><br />\n•<br /><br />\n.<br /><br />\n, .,<br /><br />\n•It<br />\nc<br /><br />\n,... , .,<br />\n0.<br />\n.<br />\ni<br />\n,. ,<br /><br />\ns.r.<br />\n4 . , 't<br /><br />\nlo•<br /><br />\nli<br /><br />\n.4<br />\n.<br /><br />\n4<br /><br />\n'.0007‘j<br />\n:'11,0 '<br /><br />\n'<br />\nC1\"<br /><br />\n),, \"• 1<br />\n,;<br /><br />\n7 ....<br /><br />\n•<br /><br />\nS.,<br /><br />\n14.0 ,..<br /><br />\n:<br /><br />\n4.<br /><br />\n.',;•41;),...',.:or $'<br /><br />\n......daii.....i.....--4411116111.............:-.......11h......\"---<br /><br />"}], "field_media_file": [{"target_id": 36235, "display": null, "description": null, "target_type": "file", "target_uuid": "aef84d12-24a3-4c8f-8f3c-f8a54e4576ac", "url": "http://digital.library.jhu.edu/system/files/2022-03/12216-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12216, "target_type": "node", "target_uuid": "aa49b17c-dd3d-4645-a6e4-bfbb684ea1e5", "url": "/node/12216"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b1ca08b9-403e-4270-87cd-881ee7298cc2"}]}