{"mid": [{"value": 38193}], "uuid": [{"value": "ae748375-8f60-4fa1-a421-c2152d00a1cb"}], "vid": [{"value": 38193}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12762-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "A.<br />\nunTiring<br />\nthe<br />\nDWrid<br />\n<br />\ni#tipiting Nriuoirtirr<br />\n<br />\nREAD THE NEWSLETTER'S COURT<br />\nOPINION—Page 2<br />\n<br />\nVOTE IN THE<br />\nNEWS-LETTER<br />\nCOURT ROLL<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 2, 1937<br />\n<br />\nVOL. XLI, NO. 26<br />\n<br />\nPRICE 5 CEN111<br />\n<br />\nHopkins Takes New Step In College Athletics<br />\nF. D. R.'s<br />\nS. A. C. Decrees News Letter Poll Board Of Trustees Decides<br />\nCorwin To Talk To ProbePropose<br />\nd Court Plan<br />\nNew June Week On Court Question That Athletics<br />\nWill Be Made<br />\nOn Roosevelt's<br />\nElectoral System To Be Tomorrow<br />\nindependent of Gate Receipts<br />\nCourt Proposal<br />\nFuture June Week Chairmen Faculty And Students To<br />\nTo Be Approved By<br />\nThree Heads<br />\n<br />\nPrinceton Scholar Is Leading Constitutional Authority In Country<br />\n<br />\nLecture Will Be Given In<br />\nLatrobe Hall On<br />\nFriday<br />\n<br />\nFollowing a conference with Dean<br />\nBerry, the Student Activities Committee announced today that drastic<br />\nchanges will be made in the selection<br />\nof future chairmen of June Week and<br />\nin the dispensation of funds for this<br />\nannual affair.<br />\nHolt Maulsby, chairman of the<br />\nS.A.C., issued the following statement:<br />\n<br />\nA scholar generally recognized as<br />\nthe leading authority on constitutional law in the United States, Edward Samuel Corwin, McMick profesof<br />\n<br />\njurispudence at Princeton<br />\n<br />\nUNEXPLORED<br />\n<br />\nFIELD<br />\n<br />\nHopkins Action Completes<br />\nMovement Stared Several Years Ago<br />\n<br />\nA change in the conduct of its Supreme Court poll to provide for a separate ballot of faculty and student<br />\n<br />\nDuring the regular<br />\nassembly<br />\nperiod on Thudsday at<br />\n11:30, Dr.<br />\nWilson Schaffer and<br />\nanother university official will be<br />\npresent in<br />\nLevering Hall to explain and<br />\nanswer any questions about<br />\nathletics<br />\nunder the new plan. The<br />\nassembly<br />\nis under the auspices<br />\nof the American Student Union.<br />\n<br />\nopinion was announced by the NEWSLETTER yesterday. The poll is to be<br />\nconducted in an effort to determine<br />\nHopkins sentiment on President<br />\nRoosevelt's recent proposal to reform<br />\n<br />\nthe Federal Judiciary.<br />\n\"The Student Activities Committee<br />\nBallots are to be printed in various<br />\nannounces the following change in<br />\nSchouler lecture on Friday .at five<br />\nthe selection of a chairman of June colors and distributed among the<br />\no'clock in the Lecture Room of LaWeek for the year 1937-38. Hereto- departments of the University. The<br />\nAthletics at Hopkins are to be<br />\nan<br />\ntrobe Hall on the subject, \"The Reafore, this position was held by the voter is not<br />\nintegral part of the scholastic<br />\nrequired to sign his name.<br />\npro-,<br />\nson and Reasonableness of the Presiperson selected by the Junior class<br />\ngram, and will be removed<br />\nentirely<br />\nDR. WILSON SCHAFFER<br />\nSharp Division<br />\npresident, and as chairmen handled<br />\nfrom dependence on gate<br />\ndent's Proposal.\" Members of the polreceipts,<br />\nMeanwhile<br />\n,<br />\nas the day of reckoning<br />\nall funds pertaining to this function.<br />\nguarantees, and winning teams,<br />\nitical science department here deacSuccess Of Play Last Week The University found from experience draws near, the division over the issue<br />\ncording to a statement issued by<br />\nclared they could not predict what<br />\nthe<br />\nthat losses occurred every year and grows sharper than<br />\nBoard of Trustees of the Johns<br />\never. While<br />\nProduces Extra<br />\nHopstand he will take on the judicial rethese had to be made good out of<br />\nkins University. Beginning in<br />\nthe Republicans are holding reasonOctober<br />\nfor legislation.<br />\nPerformance<br />\nUniversity funds. In a meeting with<br />\nno admissions will be charged<br />\nto any<br />\nThe current attraction at the Play- Dean Berry, it was decided to turn ably well together, the New Deal<br />\n\"Whatever stand Professor Corwin<br />\ngames, and, after present<br />\ncommitshop has enjoyed a run so successful over to the Student Activities Com- ranks are hopelessly severed. As a<br />\nments are fulfilled, no expense<br />\ntakes on the bill,\" asserted Dr.<br />\nguarthat it has been decided to present it mittee the funds necessary to carry consequenc<br />\nNew<br />\nGroup<br />\nFormed<br />\nTo<br />\nFure,<br />\nanties<br />\nthe<br />\nin<br />\nstrongly<br />\nDemowill be made or accepted.<br />\nJohannes Mattern, associate profes- for one extra<br />\nperformance, Wednes- on this function and that all disburseThe University will finance and<br />\ncratic Hopkins, President Roosevelt<br />\nther Relations Between<br />\nensor of political science, \"it is certain day evening, March 3, at 8.30. The ments would be made through<br />\nthis<br />\ncourage<br />\na complete program of interis<br />\nfacing<br />\na<br />\nsevere<br />\ntest.<br />\ncritics<br />\nhave<br />\nbeen unanimous in their body so that a close check could be<br />\nFaculty And Students<br />\nthat he will make as able a presentacollegiate and intramural sports, sup- -For instance Dr. A. E. Blumberg's<br />\ntion as anyone. Due to his making praise of \"The Father,\" by August maintained and losses prevented. It<br />\nplying coaches and equipment, for<br />\nthe<br />\nA<br />\nnew<br />\nStrindberg, as presented by the Play- was further decided that to insure philosophy<br />\ninstitution, in the form of a<br />\nclass, overwhelmingly<br />\nbenefit entirely of the students.<br />\njudicial review a special field of invesThis<br />\nFireside Discussion Club, will make<br />\nshop under the direction of Dr. N. B. the selection of a competent man for<br />\naction has been taken after<br />\nNew Deal in tint last October, voted<br />\ntigation, he is pecularly qualified to Fagin. Seen<br />\ncareful<br />\nits initial appearance on the campus<br />\nin the play are Hugo the position of chairman of June<br />\nstudy<br />\nby the Department of Physical<br />\nagainst<br />\nthe president's bill in a poll tomorrow night. Under present<br />\nanalyze the question thoroughly and Weisgal, Mary Alvey, Patty Singeplans, Education,<br />\nWeek, the person selected by the Junthe administrative officers<br />\nimpassionately.\"<br />\nvarious Hopkins faculty members<br />\nwald, James Murphy, Louis Adler, ior Class president would have to be last week.<br />\nof the Universities, and the Board<br />\nof<br />\nwill<br />\nmeet<br />\nPatty<br />\nBurgess,<br />\nwith<br />\nand<br />\nsmall<br />\nAlex Batlin. Sets approved by the chairman of June<br />\nMr. Leon Sachs who teaches constudent groups,<br />\nIn a straw vote conducted in OotoTrustees.<br />\neither at the home of the faculty<br />\nstitutional law here, described him as were designed and executed by S. Week, for the present year, the presiber the University showed itself sixty<br />\nRemoving the last trace of possible<br />\nmember or at Levering Hall.<br />\nVannort Chapman, John Levi, and dent of the Cotillion Board,<br />\n\"a genial personality.\"<br />\nand the per cent in<br />\nover<br />\n-emphasis and commercialism<br />\nthe<br />\nNew<br />\nDeal's<br />\nranks. This<br />\nThe purpose of the club which is from<br />\nMore than thirty years ago, Wood- Ralph Nordstrom.<br />\nchairman of the Student Activities<br />\nsports at Hopkins ,and insuring<br />\nroughly<br />\napproxima<br />\ntes<br />\nthe ratio all being organized by Mr. Harnmaker<br />\nDr. Fagin stated that the play was Committee.\"<br />\nrow Wilson, then barely three years<br />\nof that their continuance will not<br />\ndepend<br />\nthe \"Y\", Otts Phillips, and Harold Ja- upon teams<br />\nIn the president's chair at Princeton, the most artistically successful proAccording to many, the adoption of over the nation.<br />\nwhich can win against<br />\ncobs,<br />\nis<br />\nto<br />\nfurther<br />\ncalled in addition to forty-six other duction of the Playshop season, and this plan will mean the end of one of<br />\nrelations<br />\nbetween powerful opponents. The<br />\nWith the exception of the American<br />\npolicy will<br />\nstudents and faculty members and to broaden<br />\nyoungsters, Dr. Corwin, who had just perhaps of many seasons. It has been the juiciest plums in the undergrad Institute of Public Opinion, the<br />\nthe scope of competitive<br />\nNEWS<br />\nreceived his doctorate at the Univer- well-received by the audiences, which political pie. The chairmanship of LETTER is, so far as its managers hold discussions dealing with college sports, and, it is<br />\nhoped, permit Hopsity of Pennsylvania, to a preceptor- have on several nights filled the Play- June Week has always been regarded know, the only agency to conduct a problems, under the leadership of the kins to stand favorably<br />\nagainst other<br />\nship. Ever since then he has been in- shop with enthusiastic applause.<br />\nas the biggest position controlled by poll on the Supreme Court issue so faculty members. Many of the Hop- institutions with a similar<br />\nselection<br />\nkins faculty have expressed full ap- of<br />\nAt the extra performance, the pre- the Junior class president, and the far. Wednesday's ballot<br />\ntimately connected with Princeton<br />\nmaterial \"after enrollment, rather<br />\ncame as a<br />\nproval<br />\nvailing<br />\nprices will be in effect.<br />\nof the idea, and have specified than before.\"<br />\n(Continued on Page 3, Col. 5)<br />\nand has been a full professor since<br />\nresult of the deep interest stirred by<br />\n1918.<br />\nthe proposal all over the University. their desires to cooperate and to make<br />\nNew Move In Athletics<br />\nIn addition to his teaching and reThe NEWS-LETTER polls will open the meetings as informal as possible.<br />\nThe importance of this move will<br />\nsearch works, Dr. Corwin has pubThe first host to this group will be be appreciated by all those<br />\nwith the placing of the ballot box<br />\nwho delished a number of books dealing with<br />\nin the post-office at 9.30 to-morrow President Bowman, who will enter- plore the present semi-profession<br />\nalvarious aspects of the Supreme Court,<br />\nmorning. They will close at 5 p.m. tain the students at tea Wednesday, ism of college athletics, and launches<br />\nincluding The Doctrine of Judicial ReBallots will be found in the post- and will discuss college problems with Hopkins into a field which has<br />\nnot<br />\nview, John Marhall and the Constithe group.<br />\noffice boxes.<br />\nyet been explored. For no other coltution, The Constitution and What it Christopher Morley Thinks Famous Criminologist Used<br />\n—1717.7=1777ralriaiViffes—in- lege or University in the country atMeans Today. One of his more recent<br />\nitiated<br />\nby the Hopkins \"Y,\" the Fire- tempts to maintain a program of inChemist<br />\nry<br />\nLaborato<br />\nPlaysho<br />\nries Here; Search Of Registration<br />\np To Celebrate<br />\nworks, The Twilight of the Supreme<br />\nside Discussion Club is open to every tercollegiate sports as large as that<br />\nLists Proves Fruitless; Grads Start Investigation<br />\nCourt, discusses the situation in which<br />\nBirth Of Russian Poet Hopkins student. All interested stu- of Hopkins, without the assistance<br />\nSupreme Court has left Congress and<br />\ndents are invited to get in touch with of, and indeed, dependence upon, gate<br />\nEditor's Note: The author will make uate study offered here, as well as his<br />\nstate legislatures in regard to their<br />\nThe Playshop of the Johns Hopkins Otts Phillips, Harold Jacobs or Mr. receipts. However, to quote from the<br />\npowers to regulate social problems. an inquiry into the possibility of the familiarity \"with papers in the chem- University will celebrate in April the Hammaker as soon as<br />\nreport, \"a number of colleges have<br />\npossible.<br />\nDr. Corwin points out the tribunal's truth of Mr. Morley's statements that ical journals written by Ira Remsen,\" first centenary of the famous Rusmade significant moves in this direcSherlock Holmes spent several years make it extremely likely that he was sian poet and composer, Alexander<br />\nhaziness.<br />\ntion. Several institutions and at<br />\nDr. Corwin was included on the of his life at the Hopkin. The results \"tempted across the water,\" soon Pushkin. This is in line with the inter- Sex Course Roll Grows<br />\nleast one informal group of colleges<br />\nHonor Roll for 1936 of Nation for of this research will be publihed in after 1876.<br />\nnational celebration being observed<br />\n(Continued on Page 3, Col. 1)<br />\nCalls For Larger Hall<br />\n\"his scholarly knowledge of history future issues of the NEWS-LETTER.<br />\nNo Holmes-lover, no student of this year in many countries. Dr. N. B.<br />\nBy WILLLIAM DIAMOND<br />\nConan Doyle's \"great encyclopedia of Fagin has announced a tentative proand functioning of the judicial power,<br />\nThe attendance at the American<br />\nSherlock Holmes, greatest sleuth in romance,\" will fail to see the signifi- gram, which will probably consist of Student Union<br />\nand especially for his address. The<br />\ncourse on Human ReConstitution as Instrument and Sym- the history of crime detection, stud- cance of Mr. Morley's thesis, that several features. Dr. James Bunyan, production given<br />\nby Dr. Alan F. Guttbol, at the Harvard Tercentenary ied at the Johns Hopkins University Sherlock Holmes was an American. a fellow of the Page School, will be macher, Associate in<br />\nObstetrics at<br />\nduring the first years of its existence. As the author says, \"It would ex- heard in an address on the great poet. the Johns<br />\ncelebration.<br />\nHopkins Medical School, Announces Renovation Of Hopkins<br />\nAt least,. that is what Christopher plain much. The jealousy of Scotland<br />\nArchaeology Museum In First<br />\nThe musical portion of the program is so large that the physics lecture<br />\nMorley, eminent American poet, crit- Yard, the refusal of knighthood, the<br />\nFloor Gilman<br />\nroom,<br />\nRowland<br />\n58,<br />\nhas<br />\nbeen desigA Young Miss Writes On<br />\nic, and essayist, thinks he was doing expert use of Western argot, the off- is now being arranged by Dr. Lu'bouv nated for<br />\nfuture<br />\nlectures.<br />\nDr.<br />\nKeefer,<br />\nof the Teacher's College facDavid M. Robinson, Professor<br />\nMotherhood And Soap between the timle he left the univers- hand behaviour to aristocratic cliThe<br />\nAmerican<br />\nStudent<br />\nUnion of Archaeology, who excavated Olynity in England and his taking rooms ents, the easy camaraderie with ulty. Dr. Keefer took her Ph.D. in<br />\nOne of Hopkins most charming in. Montague Street to open his ca- working people of all sorts, the always German last year at the Johns Hop- wishes to make it clear that the thus in Greece and who plans to rekins University, and is now conduct- course is open to all members of the turn to the scene of the work this<br />\ncoed students recently allowed her reer as consulting criminologist for traveling first class in trains.<br />\ning a course in the History of Music University, regardless of whether summer, will present two out-of-town<br />\nImagination, or possibly her hopes, all Europe.<br />\nOther Clues<br />\nor not they belong to the A. S. U. lectures in the early part of March.<br />\nin the College for Teachers. \"<br />\nto run away with her.<br />\nMr. Morley, in an essay entitled<br />\n\"How significant,\" continues Mr.<br />\nThe<br />\nlectures are held Thursday at<br />\nOn Friday, March 5, he will speak<br />\nShe entered the Ivory Soap contest \"Was Sherlock Holmes an Ameri- Morley, \"is Holme's 'Hum!' when he<br />\n4 p.m.<br />\nat Columbia University on the topic-In the hope of winning ten million can ?\" published in Streamlines, states notes that Irene (A Scandal in Bo- Arthur Garfield Hays<br />\n\"The Ancient Greek House.\" The foldollars to solve the Hopkins financial that Holmes' profound knowledge of hemia) was born in New Jersey. And<br />\nTo Speak Next Week Lecture On \"Old Pompeii\" lowing Tuesday, March 9, he will<br />\nproblems, and in the course of the chemistry was due, in large measure, Watson's careful insertion of U.S.A.<br />\nspeak at the Connecticut College for<br />\ncontest, it was necessary to write a to his knowledge of and intimacy with after every American address, which<br />\nPresented Thursday Women in New London on \"OlynArthur Garfield Hays, well-known<br />\nbrief statement on \"Why I Like Ivory the work of Ira Remsen, brilliant always irritates us, was probably a<br />\n--thus, the Lost Greek City.\"<br />\nSoap.\"<br />\nHopkins chemist and teacher.<br />\ntwit to tease his principle. True, as liberal and labor lawyer, will speak at<br />\nProfessor<br />\nC. C. Mierow, Ph.D. forDr. Robinson wishes to call to the<br />\nthe<br />\nstudent<br />\nassembly<br />\nThursday,<br />\n\"I like Ivory Soap,\" said this intelDid Not Register<br />\nInspector MacDonald once said, (The<br />\nmerly President of Colorado College attention of<br />\nthe students the fact<br />\nligent student, \"because as a mother<br />\nA search of the registration lists Valley of Fear) \"You don't need to March eleventh, Hershner Cross, and<br />\nat present Professor of Biog- that the<br />\nArchaeological Museum in<br />\nof three children and as a housewife I of the University has failed to reveal import an American from outside in president of the Student Council, anraphy at Carleton College, will give the first floor<br />\nGilman has been renofind it . . • • \"<br />\nthe name of the great detective who order to account for American do- nounced late yesterday. Mr. flays is an<br />\nillustrated lecture on \"Riecent vated and that articles<br />\nwell-known<br />\nto Hopkins students, havof genuine<br />\nThat may be all very well, for we solved the problems of The Dancing ings.\" Holmes' American background<br />\nViews of Old Pompeii\" in Latrobe interest can<br />\nbe seen there among<br />\nknow that Hopkins is a liberal insti- Men, The Sussex Vampire, and The would explain, it is pointed out, nu- ing lectured here for several years on<br />\nHall. The lecture is under the aus- other articles.<br />\nlynching, the Bill of Rights, and other<br />\nOn display are numertution and that we have many fern- Three Garridebs. The fact that<br />\n,he did merous other facts in his history.<br />\npices of the Baltimore Society, Arch- ous pieces of<br />\nPertinent<br />\npottery and miniature<br />\nquestions.<br />\nPacked<br />\nhalls<br />\nmists on campus; but the hitch comes not enroll does not, however, preOf Baltimore, Mr. Morley says,<br />\naelogica-1 Institute of America, and sculpture which<br />\nhave been unearthed<br />\nWhen we realize that this delightful clude the possibility of his having \"My own thought is that the opening have always greeted his efforts.<br />\nis to be held on Thursday, March 4, at Olynthus,<br />\nwhere the Johns HopYoung coed signed her name<br />\nstudied at the Hopkins. The unusual of the Johns Hopkins University in<br />\nThere will be no assembly this at 5 o'clock. Students and the<br />\ngen- kins University is conducting the exMiss A. B. Cee.<br />\nand informal opportunities for grad(Continued on Page 3, Col. 1)<br />\nweek.<br />\neral public are invited to attend.<br />\ncavation.<br />\nUniversity, will deliver the James<br />\n<br />\nDrs<br />\n<br />\nUniversity Will Finance Complete Program Of<br />\nSports<br />\n<br />\nHe Will Explain<br />\n<br />\nChange Looks To Selection Hopkins Approves New Deal<br />\nIn Poll Held Last<br />\nOf More Competent<br />\nOctober<br />\nHead<br />\n<br />\nHIS STAND UNKNOWN<br />\n<br />\nsor<br />\n<br />\nHave Seperate<br />\nBallots<br />\n<br />\nPROF. EDWARD S. CORVVIN<br />\n<br />\nPlayshop To Repeat<br />\nThe .Father' Wed.<br />\n<br />\nBowman Entertains<br />\n41(' Discussion Club<br />\n<br />\nSays Sherlock Holmes Studied<br />\nUnder Ira Remsen At Hopkins<br />\n<br />\nDr.Robinson Speaks<br />\nOn Lost Greek City<br />\n<br />\n\fHOMEVVOOD, BALTrMORE, MARCH 2, 1941F<br />\ntam n the past features and accomplishments of our athletic system.<br />\n' From now on the status of athletics as part of our<br />\nuniversity--just like any other department—will be<br />\nfurther solidified. The University will support our athletic program just as it backs other parts of our institution.<br />\nThe past intercollegiate and intramural programs will<br />\nbe kept up but will be given more stabilized foundation. It is pleasant to know that they will be maintained<br />\n$2.00<br />\n,• if<br />\n.il)<br />\n,<br />\nSlit<br />\n$2.50<br />\nwithout concern over gate receipts.<br />\nBy Mail<br />\nOur plan will place the Hopkins first among those<br />\ncolleges who believe in an athletic program defew<br />\nCouncil,<br />\nActivities<br />\nStudent<br />\nTreasurer,<br />\nRemit subscription fees to<br />\nto benefit a large portion of the student body and<br />\nsigned<br />\nUniversity.<br />\nRernsen Hall, Postotfice, Johns Hopkins<br />\ndemand the non-dependence on commercialized features<br />\nto carry out such a plan.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nThe new proposal will tend to further decrease any<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nin Ikaltimore, Md., under the Act of<br />\nlooking to commercial ventures to support our athletics<br />\nwith the elimination of gate receipts. \"Athletics for all\"<br />\nPublished semi-weekly from October to June, except during examnow include an even wider range if the alumni and<br />\ncan<br />\nJohns<br />\nthe<br />\nof<br />\nundergraduates<br />\nination and college holiday periods by<br />\nof the University take advantage of attendance<br />\nfriends<br />\nUniversity.<br />\n<br />\nObe Join 5 Aiopkinf5<br />\n<br />\nCURBING THE EXECUTIVE<br />\n<br />\nKnowledge Is Power<br />\nBy HILDRETII<br />\nToday we present a list of answers<br />\nacquired from exams in literature<br />\nand art. We dedicate this column<br />\nto Dr. Fagin and Dr. Spencer.<br />\n<br />\ntential dictator. We make no apologies for using the word \"dictator\",<br />\nfor we feel we are ysing it sanely.<br />\n\"Our Fathers knew better than we<br />\nthat the specific temptation of gov- 1. King Arthur collected all the<br />\nfine, brave, good-looking young<br />\nernment—any government—even an<br />\nmen of his time and called them<br />\nAmerican government — is to seize<br />\nThe Knuts of the Round Table.<br />\nmore power than is allotted to it. or<br />\nmisues the power it has. They foresaw 2. Shakespeare lived at Windsor<br />\nwith his merry wives.<br />\nthe always possible rise of dazzling<br />\npersonal leadership; they foresaw the 3. He wrote tragedies, comedies,<br />\ndisplacement of law by temporary<br />\nand errors. Most of his plays are<br />\nemotion, the tendency to unwise acterrible tragedies, such as Macbeth, King Lear, and Twelfth<br />\nGranted. But let us examine some tion under stress; and to prevent<br />\nNite in a Bar Room.<br />\nof the epithets the President and his these evils they erected certain barsupporters have used on their oppo- riers. The land was stripped of any 4. Pope wrote principally in heroic cutlets.<br />\nnents. First any one who ventured power superior to the People, who<br />\nHopkins<br />\ninvitations.<br />\nto disagree with them was denounced spoke through the Constitution. The 5. Keats is a poet who wrote on a<br />\nPractically speaking, gate receipts at the Hopkins as a \"chiseler\", upon whom the gov- Presidency was made subordinate to<br />\ngreasy urn.<br />\nEDITORIAL STAFF<br />\nEditor-in-Chief were such that their elimination would make no appreStanlej Finkel<br />\nernment must \"clamp-down\". Then the Constitution. So was the Con- 6. When Adam Bede was an old<br />\nEditors<br />\nManaging<br />\nspeaking,<br />\nCaplan<br />\nfinancially<br />\nSo,<br />\nDavid<br />\nbudget.<br />\nThese<br />\nthe<br />\nMorrow,<br />\nthe<br />\nCourts.<br />\nin<br />\nJames<br />\nciable difference<br />\ncame \"oppressor of the poor,\" \"prince gress. So were<br />\nSports Editor<br />\nman he entered a convent and<br />\nBernar1.1 D. Pinck .<br />\nthe announcement is of little significance. Rather it is an of privilege\", \"malefactor of great three powers of government, with ofEditors<br />\nMangaing<br />\nAssistant<br />\nJr.<br />\nBarroll,<br />\n%Vethered<br />\nRoot,<br />\nBenjannin<br />\nthe father of English<br />\nbecame<br />\nmore<br />\ncan<br />\nbe<br />\nallotments<br />\nAssistant Sports Editor advantage in that budgets and<br />\nwealth,\" and \"economic royalist\". And ficers oath-bound to the Constitution,<br />\nHarold Zheutlin<br />\nLiterature.<br />\nColumnist<br />\nreceipts<br />\ngate<br />\non<br />\nindependependence<br />\nany<br />\nin<br />\ncomplete<br />\nand<br />\nare<br />\nestablished<br />\nascertained<br />\nreadily<br />\nPaul ISerge<br />\nnow comes the best one yet: now Mr.<br />\n7. \"And doth not Brutus bootless<br />\nReporters—Max lskowitz, Nathaniel Finkelstein, Jewett Goldsmith, for revenue in maintaining our athletics is permanently<br />\nRoosevelt's opponents are poor, senile dence of one another, on the supposiRubinger,<br />\nLeonard<br />\nRabin,<br />\nCarl<br />\nAdler,<br />\nJulian<br />\nReizenstein,<br />\nHoward<br />\nknell?\" means Brutus knelt<br />\nof<br />\nall<br />\nthree<br />\nwould<br />\nnever<br />\nthat<br />\ntion<br />\ngone.<br />\ngentlemen who must have younger<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nwithout his boots on.<br />\nis<br />\nreceipts<br />\ngate<br />\nthe<br />\nor<br />\nof<br />\npeople<br />\nelements<br />\nthe<br />\nagainst<br />\nthe<br />\ncombine<br />\nspeaking,<br />\nthem<br />\nBurWilliam<br />\nBroadly<br />\nDiggs,<br />\nCharles<br />\nVictoroff,<br />\nVictor<br />\nthem,<br />\nMurray Keinpton,<br />\n\"helpers\" to guide and assist<br />\nford, J. C. Handelsman, Mal Boshnack, Arnold Glantz.<br />\nalmost the basic evil of emphasis and professionalism or at least reader them harmless. The the law that gave them being. Thus 8. \"The Passing of Arthur\" is a<br />\nbeautiful poem. It reminds me<br />\nin the colleges today. It leads to a vicious circle, which implication is obvious: all who are in far, that foresight has been justified.<br />\nBUSINESS STAFF<br />\na lot of \"Custer's Last Stand.\"<br />\ncases in an atheltic institution rather than the full possession of their mentality Every thrust made against the Consome<br />\nin<br />\nends<br />\nBusiness Manager<br />\nWilliam B. Kerriptun<br />\nLost\"<br />\nAssistant Business Manager an educational one .<br />\nwill invariably agree with the Presi- stitution has been made to get more 9. Milton wrote \"Paradise<br />\nMelville Locker<br />\nand was a Roman Catholic who<br />\nAdvertising Manager<br />\nWe have removed one of the last vestiges of commer- dent; only feeble-minded dotards will authority over the people and to<br />\nWm. C. Erlanger<br />\nCirculation Manager cialized athletics. We have definitely asserted our singraduated at Oxford. He also had<br />\nGerald Willen<br />\nleave the people with less authority<br />\noppose him!<br />\nOffice Manager<br />\nHoward Linkoff<br />\nemphasis on sports<br />\naffairs; but, in every<br />\ngood education.<br />\nown<br />\na<br />\nreasonable<br />\na<br />\ntheir<br />\nover<br />\nmaintaining<br />\nin<br />\ncerity<br />\nCopy and Filing Manager<br />\nMost of those who support the proNathaniel Soifer<br />\nsuch attempt, one of these checks, 10. Poetry is when every line begins<br />\nwith a view to wide participation among the studentss<br />\nadCourt<br />\nposed measure to pack the<br />\nwith a capital letter.<br />\nand oftener two, have operated to prein athletics.<br />\nmit that it has grave flaws: that inRRRRRRRR TED FOR NATIONAL ADVERTISING BY<br />\n11. Lord Macauley suffered from<br />\nvent the seizure of power.\"<br />\ncreasing the number of judges will<br />\ngout and wrote all his poems<br />\nNational Advertising Service, Inc.<br />\n\"The collegiate young man was precisely the one least make the highest tribunal more unThus spoke Mr. W. J. Cameron in<br />\nCollege Publishers Representative<br />\ntrying<br />\nwas<br />\nwho<br />\nin iambic feet.<br />\ncollege,<br />\nthe<br />\nof<br />\npurposes<br />\nthe<br />\nto<br />\n2,<br />\nFeb.<br />\nadapted<br />\non<br />\ntalk<br />\nevening<br />\nSunday<br />\nhis<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nwieldy and inefficient, and that this<br />\n.<br />\nSAN FRANCISCO<br />\nBOSTON<br />\n.<br />\nCHICAGO<br />\nto romanticize a type of life which he did not understand power would be dangerous if pos- 1936. And we add that just as the 12. Mandolines are high officials in<br />\nPORTLANC<br />\nLOS ANLorLEIS<br />\nof<br />\nChina.<br />\nand into which he did not, fit.\" Dean Christiam Gauss<br />\nsessed by a president with any Fascist People spoke through the ConstituPrinceton University gives a skyrocket of approval for tendencies. But they condone the tion, so they can still speak through 13. Contralto is a low sort of music<br />\nthat only ladies sing.<br />\neven<br />\ndeclining \"rah-rahism.\"<br />\nmeasure as necessary in an emergen- constitutional amendment or<br />\n193t)<br />\nMember<br />\n1937<br />\nSyncopation is emphasis on a<br />\n14.<br />\ncy in which \"time is a major consider- through the entire revocation of the<br />\nnote that is not in the piece.<br />\nPeople<br />\nthe<br />\nuntil<br />\nBut<br />\nConstitution.<br />\nation.\"<br />\ndisDistributors<br />\nspeak in such a way, the three de- 15. An interval in music is the<br />\nAnd yet we are told simultaneously<br />\nthe<br />\nto<br />\npiano<br />\none<br />\nfrom<br />\ntance<br />\nbe<br />\nmust<br />\nof<br />\ngovernment<br />\nIn the Strindberg festival last week, the Hopkins that the emergency is over and that partments<br />\nnext.<br />\nrespective<br />\nin<br />\ntheir<br />\nto<br />\nkeep<br />\nmade<br />\nin<br />\nwork<br />\nfine<br />\nits<br />\nof<br />\nPlayshop continued to give evidence<br />\nnormal prosperity is with us--at least<br />\ndome<br />\nplaces. And the immediate present 16. Michael Angelo painted the<br />\ndramatic endeavors on the Hopkins Campus.<br />\nwe are told that before election in no<br />\nof the Sistine Madonna.<br />\nexecuMembri Of The<br />\nthe<br />\ncurbing<br />\nthat<br />\nof<br />\nis<br />\nnecessity<br />\nfew<br />\ntoo<br />\nFor such an excellent presentation there were<br />\nuncertain terms. Then what is the<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\n17. The dome of St. Paul's is supe department.<br />\nOf Middle Atlantic States<br />\nin the audience. Considered \"one of the most powerful hurry? Why all the rush? Granting tive, or administrativ<br />\nported by eight peers, all of<br />\nOne of the functions of the Contragedies of all time,\" the play was staged in an im- for the sake of argument--and only<br />\nare unfortunately cracked.<br />\nwhich<br />\npressive manner. For the materials and space available, for the sake of argument—that all stitution is to protect minority rights<br />\nTUESDAY, MARCH 2, 1937<br />\nlicense is a license you<br />\npoetic<br />\nA<br />\n18.<br />\nthe settings were unusually effective. A difficult and former New Deal plans and aims have while letting the majority rule. Alget from the Post Office to keep<br />\nheavy production, \"The Father\" was presented with a been for the best interests of the though_ the letters sent in to Senators<br />\npoets. You get one also if you<br />\ncast that gave fitting characterizations. With a long country, still all intelligent observers by their constituents are ten to one<br />\nwant to keep a dog. It costs two<br />\nTomorrow, students and faculty of the Hopkins will and involved title role, Hugo Weisgall turned in a know that most of them have been in opposition to the president's proand you call it a dog<br />\ndollars<br />\nparticipate in a poll on a question which dominates pol- splendid performance. His wife, portrayed by Mary seriously marred in their execution posal, we shall grant for the sake of<br />\nlicense.<br />\nreelection<br />\nitical discussion today.<br />\nAlvey, and the nurse by Patty Singewald, should also by too much haste. New Dealers as- argument that the last<br />\nA medieval mystery play is a<br />\nnum- 19.<br />\nsert that the emergency justified this turns give a fair estimate of the<br />\nWe hope that the students will take this matter of share top honors.<br />\nplay in which the person guilty<br />\nThe Playshop has a right to be proud to add this pro- haste. But now, with the emergency bers favoring and opposing said provoting seriously and cooperate with the NEWS-LETTER<br />\nthe final curtain.<br />\nit has over, why not take enough time to do posal. Even granting this, it is a<br />\nto determine student and faculty opinion on. the court re- duction to those of the many distinguished plays<br />\n20. ,Lady Macbeth died of sleeping<br />\nexistence.<br />\nits<br />\nof<br />\nyears<br />\nfifteen<br />\nthe<br />\nin<br />\nproduced<br />\nand<br />\nthings right? The present form of matter of record that the minority<br />\nform issue. It is an important problem, interesting,<br />\nsickness.<br />\nThe Playshop has again proved its right to claim the Supreme Court has served us thus found is the greatest in our his- 21. Catharsis was a Greek actor.<br />\nupon which it is worthwhile to ascertain campus reIt is obvious that the rights of<br />\naction. In the Hopkins classrooms, much interest has your loyal cooperation and support. It is a worthwhile well for many decades; it is impera- tory!<br />\n22. An epitaph is a short sarcastic<br />\nhuge minority—even if it is still<br />\nthis<br />\nwell<br />\nartiactivity.<br />\nlook<br />\nand<br />\nto<br />\nletters<br />\ntime<br />\nMany<br />\nwe<br />\nthat<br />\ntive<br />\ntake<br />\nquestion.<br />\non<br />\nthis<br />\nmanifested<br />\nbeen<br />\npoem.<br />\na minority--should be carefully conbefore we leap to something new.<br />\ncles have come to us; so we decided to conduct this<br />\n23. Tennyson wrote a poem called<br />\ndisregarded<br />\nsidered, and not hurriedly<br />\npoll.<br />\n\"Grave's Energy.\"<br />\nAnd won't the New Deal ever find<br />\nwith the weak excuse that \"time is a<br />\nwith<br />\njustice<br />\nevery<br />\nfirst<br />\nIn<br />\nits<br />\nfor<br />\nits<br />\npromises?<br />\nthat<br />\nto<br />\nThat's all for now—in the next iskeep<br />\ntime<br />\nstates<br />\nIn brief, the proposal<br />\nmajor consideration.\"<br />\nsue we shall deal cautiously with the<br />\nterm it used the emergency to justiten years of service and who does not retire or resign To the Editor of the NEWS-LETTER<br />\nIn an interesting conversation Bible, religion, and myth.<br />\nPresthe<br />\npromits<br />\nbirthday,<br />\nof<br />\nmost<br />\nfy the breaking of<br />\nwithin six months of his seventieth<br />\nDear Sir:<br />\nwhich we had last year with Dr. H.<br />\nThis week in regard to etiquette.<br />\nident is empowered to appoint one additional justice,<br />\nI arni in favor of President Roosevelt's plan to reform ises. But with the emergency over it<br />\nBowen—then an instructor in<br />\nLee<br />\nappointments<br />\nto<br />\nredeem<br />\nbe<br />\ntime<br />\nhigh<br />\nto<br />\nseem<br />\nA club sandwich is eaten with a<br />\nwould<br />\nthe numbers not to exceed fifteen and the<br />\nCourt.<br />\nthe Supreme<br />\nhistory here—we asked him what he fork after the toast and other ingredthe<br />\nto<br />\nadded<br />\nare<br />\npromise<br />\nsuch<br />\nOne<br />\njudges<br />\npromises.<br />\ncampaign<br />\nfifty<br />\naddition,<br />\nof<br />\nIn<br />\nare permanent.<br />\nMy opinion is formed mostly from an examination<br />\nthought of Mussolini; he replied that ients have been broken. In doing this<br />\nlower courts and the department of Justice is empow- the present state of the Supreme Court. Its most glaring was to submit to the nation a constihe thought him a great man. When one uses a knife and fork.<br />\nconstithe<br />\ninvolving<br />\npower<br />\nassigning<br />\ncases<br />\ntutional<br />\namendment<br />\nprivate<br />\nered to intervene in<br />\nfault is that it is totally undemocratic—nine judges, not<br />\nsocial legisla- we expressed surprise at this opinA tuxedo is worn upon informal<br />\ntutionality of laws.<br />\nrepresentative of average Americans, have been ap- to Congress to enact<br />\n(in effect):<br />\nsaid<br />\nhe<br />\nion,<br />\nafter six o'clock. It is apthat<br />\nMr.<br />\nasserts<br />\noccasions<br />\nDiamond<br />\nEven<br />\ntion.<br />\nWhat is actually accomplished by this measure is still pointed for life. For approximately 100 years, the general<br />\nhe propriate to wear at the theatres;<br />\nwith<br />\neverything<br />\ndisagree<br />\n\"I<br />\nrd<br />\nbe<br />\nthe<br />\nstraightforwa<br />\nwould<br />\nthis<br />\nit<br />\nthat<br />\nthink<br />\ndetermined<br />\nto<br />\nbeen<br />\nseem<br />\ntrend of the American government has<br />\na matter of debate. Most people<br />\nthe desired end. says and does, but I think he's a great at most dinners; at informal parties;<br />\nwill \"pack the court,\" meaning the addition of more by the personal political opinions of nine men due to way to accomplish<br />\nit?<br />\nWhy did not Mr. man because he has been able to im- when dining at home; and when dinnot<br />\ndo<br />\nwhy<br />\nThen<br />\njustices.<br />\nunRooseveltian-minded (economically speaking)<br />\ntheir assumed power to declare acts of Congress<br />\nhis<br />\nSupreme Court press Italy and Europe with his ideas, ing in a restaurant. Full dress is worn<br />\nmake<br />\nRoosevelt<br />\nimportance<br />\nthey<br />\nif<br />\nparamount<br />\nbecause<br />\nof<br />\nis<br />\nopinions<br />\npersonal<br />\ninterpretation<br />\n*<br />\nsay<br />\nI<br />\nconstitutional.<br />\nHowever, this<br />\nThe people has made Italy a major power, and at the opera; at an evening wedding;<br />\nelection?<br />\nbefore<br />\nproposal<br />\nwere deeply concerned with the constitutionality of a<br />\nIn deciding one's stand in this matter.<br />\nthe candi- is a force to be reckoned with. But at a ball; or at a formal evening enwhat<br />\nknow<br />\na<br />\nto<br />\nhave<br />\nright<br />\nthemselves.<br />\namong<br />\nmuch<br />\nso<br />\nthe<br />\nlaw they would not disagree<br />\nThe NEWS-LETTER is in agreeance with most of<br />\nMr. being great does not necessarily mean tertainment.<br />\nsurely<br />\nand<br />\nto<br />\ndo,<br />\nintend<br />\ndates<br />\nletters written to it and we state we are in favor of the At present the judges are for the most part incompetent<br />\nbeing a help to the world as a whole.<br />\nhe<br />\nintended.<br />\nwhat<br />\nknew<br />\nAn announcement of an engageRoosevelt<br />\nunand<br />\nare<br />\nold<br />\nthey<br />\nPresident's plan. We think the charges of \"dictatorship\", for such an important position:<br />\nthink Mussolini is a menace to the ment should be made upon the day<br />\nI<br />\nto<br />\nshow<br />\nthis<br />\nfailure<br />\ncall<br />\nwould<br />\nSome<br />\nan<br />\nby<br />\nemployed<br />\nbeen<br />\nthey<br />\nHad<br />\nsufficient<br />\ncautious.<br />\nthat<br />\nnecessarily<br />\nand<br />\n\"unAmericanism,\" etc., are unsound<br />\nfrom that the bride-to-be chooses to wear<br />\nwould his hand just another example of Mr. world. We must be protected<br />\ncheck by public opinion in the election and swaying of important modern business house, most of them<br />\nFarley's) cleverness; great men.\"<br />\n(and<br />\nher engagement ring for the first time<br />\nRoosevelt's<br />\npilot<br />\nto<br />\nthem<br />\nuse<br />\nwhy<br />\nthis;<br />\nThe<br />\nbefore<br />\ntrue.<br />\nlong<br />\nhave been retired<br />\nthe President and Congress would rather be<br />\nPresident<br />\ncomparing<br />\nnot<br />\nare<br />\nWe<br />\npublicly.<br />\nThe<br />\nplain<br />\nit<br />\ndishonesty.<br />\ncall<br />\nothers<br />\non<br />\nbill is a step towards more democracy, towards the reali- the general course for the most important nation<br />\nRoosevelt with Ii Duce, although such<br />\nthe<br />\nfrom<br />\nle<br />\nIf a toast is proposed to a person,<br />\nmandate<br />\n\"unquestionab<br />\nrehas<br />\nCourt<br />\nSupreme<br />\nzation of what a majority of American people actually the earth? Furthermore, the<br />\nbe that person does not drink the toast.<br />\nwould<br />\ncontrast)<br />\n(and<br />\ncomparison<br />\na<br />\nrefers<br />\nMr.<br />\nDiamond<br />\nwhich<br />\nto<br />\nnation\"<br />\npeatedly been ultra-conservative. At a time when the<br />\nwant.<br />\nsubmit that<br />\nIt is customary to open a gift imreform was made on the basis of a proposed interesting. We merely<br />\nWe believe the Supreme Court Justices to be human. country needs a forward looking policy of social<br />\na great man. mediately upon its receipt.<br />\nbe<br />\nmay<br />\nour<br />\nPresident<br />\nWe<br />\ncanamendment.<br />\nconstitutional<br />\ninefficiWe agree with Justice Stone that \"personal economic and has had one put into operation (although<br />\nThomas Jefferson introduced the<br />\nnot believe that the American people But \"we must be protected from<br />\npredilectiions\" often guide their decisions. We think that ently, in many cases), most of it has been ditched bereally want measures enacted which great men.\" If the Supreme Court is use of finger-bowls that he had obbench<br />\nCourt<br />\nSupreme<br />\nthe<br />\non<br />\njudges<br />\nPresident<br />\nbehind<br />\ncause more of the<br />\nthere is a clear majority of the country<br />\nwould give to the executive depart- allowed to continue to give us this served in Europe.<br />\nRoosevelt and that his moves have wide public support. had been appointed by Republican presidents than by<br />\nment practically all of the power now protection, it will likewise continue<br />\nIn serving people at dinner, dishes<br />\nWhile the present bill is by no means a complete and Democratic ones. The one factor that I can indicate in in<br />\npeople's bulwark.\" Vive le are always removed from the right<br />\n\"the<br />\nbe<br />\nto<br />\nthus<br />\njudiciary,<br />\nthe<br />\nthe<br />\nof<br />\npossession<br />\nadequate solution to the entire problem, it is clearly con- favor of the present Supreme Court is that it recently has<br />\nand served from the left.<br />\nmaking the president, in truth, a po- Supreme Court!<br />\nstitutional satisfactory as opposed to past condition. The defended freedom of speech, although it must have<br />\nIn a double ring ceremony a man<br />\nwar.<br />\nlast<br />\nour<br />\nultimately<br />\nduring<br />\nin<br />\nresult<br />\nsoundly<br />\nslept plenty<br />\nmeasure will ,as is actually intended,<br />\na wedding ring on the same<br />\nwears<br />\nNow President Roosevelt has come out with the idea<br />\nthe passage of Rooseveltian legislation—approved by<br />\nfinger as a woman does.<br />\nof retiring all judges past a certain age and increasing<br />\n25,000,000 voters.<br />\nOn the letter box. or door of the<br />\nWhat is your opinion in this question? Vote tomorrow the number of judges to fifteen. There are justifiable<br />\nit is customary to use the<br />\napartment<br />\nto<br />\nenough<br />\nnot<br />\ngetting<br />\nyou're<br />\nthat<br />\nfeel<br />\nSir:<br />\nEditor:<br />\nthe<br />\nto<br />\nthe<br />\nLetter<br />\n\"pack<br />\nto<br />\nin the NEws-LerrER poll and add to finding out what cries of protest concerning his attempts<br />\ncard in the space provided<br />\nhusbands's<br />\nbetween eat, stay at your table, and we will<br />\ndevelopments<br />\nLatest<br />\nCourt\"; he certainly would appoint men who in case of<br />\neveryone thinks.<br />\nname.<br />\nthe<br />\nfor<br />\nDormer<br />\nJ.<br />\nJames<br />\nand<br />\nManager<br />\na vote would declare his measure constitutional. Although Maxie<br />\ncram all you can eat down your<br />\nWhen a man is walking with two<br />\nprevious presidents, mostly Republicans, have also in their bout over at the Alumni throat.\" Taken only for a moment by<br />\nhe should walk on the outside.<br />\nladies<br />\nthe<br />\nthat<br />\nto<br />\nindicate<br />\n\"packed the Court,\" this does not validate Roosevelt's Hall Arena seem<br />\nsurprise, the student body quickly reIn seating guests at dinner it is<br />\nhas<br />\nstudent,<br />\nthe<br />\nunderdog,<br />\nusual<br />\nattempted action.<br />\ncovered, and let go a burst of right customary to separate married coupThe announcement of the new plan of athletics here<br />\nHowever, in spite of this, I believe the President's bill finally won a round. Diligent followthe<br />\nwhich<br />\nin<br />\nactivity<br />\nuniversity<br />\nof<br />\nphase<br />\nanother<br />\nand left cheers that nearly brought les but allow an engaged man to<br />\nmarks<br />\nprobably<br />\nhave<br />\nrevues<br />\nfistic<br />\nour<br />\nof<br />\ners<br />\nrequire<br />\nshould be passed. The urgent needs of the nation<br />\nthe house down. They followed up by take in his fiancee.<br />\nHopkins is a pioneer. As far as we know, we are unique<br />\nimmediate social and industrial legislation which is only noticed in one of the last week's<br />\nan<br />\nsuch<br />\nwith<br />\nlearning<br />\nof<br />\ninstitutions<br />\nIt is regarded as being in better<br />\ncramming themselves on a<br />\nliterally<br />\namong the higher<br />\nditor<br />\nletter-to-the-e<br />\nsizzling<br />\npossible by passing this bill or by completely disposing flashes: a<br />\nit<br />\nthink<br />\n(I<br />\nsalmon<br />\nof<br />\nsupper<br />\ndelicious<br />\nto allow the chair to rest where<br />\nform<br />\nathletic policy—a broad amateur program, with gate<br />\nor the services of those nine august gentlemen. The latter which complained about the quality<br />\nchips! Some it is when one rises from the table.<br />\nand<br />\npotato<br />\nsalmon),<br />\nwas<br />\nreceipts eliminated. While there are some universities<br />\n\"meals.\"<br />\nI believe too drastic and impossible a change to be at- and punch of Dormitory<br />\neven had two glasses of milk in celewho possess certain features of our system, there are<br />\nTissue paper that come with ennow. The new body would be more competent (Not a bit exaggerated in my opintempted<br />\ngate<br />\nabolishing<br />\nof<br />\nWhoopee!<br />\nbration.<br />\ninvitations should not be foldgraved<br />\nnone who have yet reached the point<br />\nto rule on the Supreme Court bench, and would certainly ion). Somehow the word must have<br />\nthe invitations.<br />\nreceipts. It is a new venture, in harmony with the attiwith<br />\nin<br />\ned<br />\nreal<br />\nthe<br />\nthat<br />\nforgotten<br />\nthey<br />\nHaven't<br />\nthey<br />\nfor<br />\nmanagers<br />\nDorm<br />\nthe<br />\nbetter represent the opinions of the mass of Americans. reached<br />\nA buffet breakfast may be served<br />\ntude of the Hopkins towards athletics.<br />\nis in reeard to the aualitv<br />\ncomplaint<br />\nwith<br />\nhuddle<br />\na<br />\ninto<br />\nwent<br />\nimmediately<br />\nto<br />\nnot<br />\nwedge.<br />\noncninff<br />\nan<br />\nbe<br />\nwould<br />\nmeasure<br />\na<br />\nsuch<br />\nAlso<br />\ninca lira,<br />\nthe nhoin nf<br />\nlatest -I—<br />\n11117s<br />\nand not the quantity of food served? at noon, a luncheon at one or two<br />\nmake a \"dictator\" out of the President, but to lessen the their seconds.<br />\ntime in the<br />\nour policy to place athletics on a strict university, amaThey pulled the unexpected last I am inclined to believe that they are o'clock, a supper at any<br />\ndictatorship of the Supreme Court either by not having<br />\nteur level. It is a logical outgrowth of the original plan<br />\nevening.<br />\na<br />\nfor<br />\nDon't<br />\nchange.<br />\nissue<br />\nthe<br />\navoiding<br />\nproca<br />\nCharley Squire,<br />\nnew one (as England very successfully does) or by making it Sunday when<br />\nHistory will be the topic for next<br />\nof the department of physical education when the<br />\ntor, got up into the middle of the ring, you think so?<br />\ndemocratic.<br />\nwas<br />\nShaffer<br />\nDr.<br />\nsports program went into effect and<br />\nweek.<br />\nDormer.<br />\nAnother<br />\nand attempted a kayo punch. \"If you<br />\n—Benson Ross<br />\nplaced in charg.e It will serve to strengthen and main-<br />\n<br />\newz<br />\n<br />\nLetter<br />\n<br />\nRssocicded GNIeesiate Press<br />\na<br />\n<br />\nBy Merton S. Fales, Jr.<br />\nThis article was called forth by Mr.<br />\nDiamond's well written article,\"Curbing the Court,\" which appeared in the<br />\nlast issue of the NEWS-LETTER. We<br />\nshall begin with a quotation from said<br />\narticle:<br />\n\"No man presents a plan for changing<br />\nthe arrangement of the<br />\nSupreme Court without having the<br />\nepithets of 'radical' and 'dictator'<br />\nshouted at him from every corner of<br />\nthe nation.\"<br />\n<br />\nA Splendid Performance<br />\n<br />\nColle6iate Digest<br />\n<br />\nTomorrow's Poll<br />\n<br />\nLetter To The Editor<br />\n<br />\nLETTER TO THE EDITOR<br />\n<br />\nAgain We Lead<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 2, 1937<br />\n<br />\nS. A. C. Decrees Biology Students<br />\nTrustees Ban Letter 'to Parents Concert Acclaimed Success,<br />\nGate Receipts Ends Dorm Strife Program Meets With Approval New June Week To Hear Two Grads<br />\nElectoral System<br />\nDorms To Be Governed By<br />\nAt All Contests Student Board Aim<br />\nOf New Plan<br />\nUniversity Will Finance Complete Program Of<br />\nSports<br />\nUNEXPLORED<br />\n<br />\nFIELD<br />\n<br />\nHopkins Action Completes<br />\nMovement Stared Several Years Ago<br />\n(Continued from Page 1, Col. 6)<br />\nare now considering seriously the<br />\nelimination of gate-receipts as a last<br />\nstep in a return to an athletic program primarily for the benefit of the<br />\nstudents.\"<br />\nThe working of the plan will be<br />\nsimple. The University will issue,<br />\nWithout charge, cards of admission<br />\nto the athletic contests. In distribution, alumni will be given preference.<br />\nIt is planned to'issue season tickets<br />\nto all graduates of the University,<br />\nand to provide free tickets to others<br />\nWho apply to the Director of Athletics. The number of tickets distributed to non-alumni will be limited<br />\nonly by the size of facilities at the<br />\nHomewood Field and Gymnasium.<br />\nMove Continues Policy<br />\nThis move is a continuation of the<br />\npolicy adopted several years ago,<br />\nWhen the few existing athletic scholarships were abolished, athletics<br />\nbrought under the control of the University, and a strong program of intramural sports introduced. At the<br />\nsame time, the scope of intercollegiate activities was extended to cover<br />\nthirteen sports instead of six. There<br />\nmay be a further extension under the<br />\nnew plan.<br />\nThe resu ltls were eminently<br />\nsatisfactory. Eighty-five per cent of<br />\nstudents engaged in some sort of<br />\nathletic activity, instead of a chosen<br />\nhandful, and there was a lessened<br />\ntendency to emphasize the records of<br />\nthe individual team. But it was still<br />\nIncomplete. The final step is the removal of the gate-receipts and guarantees, which at times led to a temptation to schedule games which drew<br />\nlarge crowds with opponents which<br />\nhopelessly outclassed Hopkins, and<br />\nto accept games with larger teams<br />\nfor the sake of the fat guarantee, and<br />\nproviding the other team with a<br />\n\"breather.\" However, this has not<br />\nbeen done, and the temptation itself<br />\nIs now finally removed.<br />\nJust what effect this move will<br />\nhave on the rating of Hopkins teams<br />\nis not known. Under the other plan,<br />\nthe records have been poor on the surface, because Hopkins could play only<br />\nteams of comparable ability, and<br />\nchose its teams entirely from the<br />\nmaterial which naturally turned out.<br />\nHowever, assuming that the purpose<br />\nOf college athletics is to provide<br />\ntraining and physical development for<br />\nthe students, the plan was a success.<br />\nTo quote from the report, \"There is<br />\nreason to believe, however, that with<br />\nadequate training and instruction,<br />\nHopkins teams should be equal to<br />\nthose of other institutions comparable<br />\nin size.\"<br />\n<br />\nMorley Says Sherlock<br />\nHolmes Studied Here<br />\n<br />\n11<br />\nle<br />\n<br />\ne.<br />\nis<br />\n<br />\ner<br />\nre<br />\n<br />\n11 d-<br />\n<br />\nThe letter sent by the treasurer's<br />\noffice to the parents of those men lately troubled by that bureau has been<br />\nreleased for publication in the NEWSLETTER. The letter, published below, is<br />\nthe culmination of a few weeks of<br />\nstrife between dorm residence and<br />\ndorm powers. The trouble had been<br />\nbrought on by the letter of condemnation first sent out, which was recently<br />\npublished by this organ. The \"letter<br />\nof exoneration\" follows:<br />\nDear Mr.<br />\nSince an arrangement has been<br />\nmade for covering the primary cost<br />\nof the damage resulting from the<br />\ndisturbance in — Entry of the<br />\nAlumni Memorial Hall Dormitory<br />\nreferred to in my earlier letter, and<br />\nand since the residents of — Entry<br />\nare cooperating with the University authorities in clearing up the<br />\ndifficulties of the past and in making provision against similar trouble in the future, we are glad to<br />\ninform you that it will not be necessary to impose any penalties on<br />\nresidents of — Entry and that all<br />\ndisciplinary action has been recinded. This means that there will<br />\nbe no charge on the records because<br />\nof the past disturbance.<br />\nYours very truly,<br />\nM. W. SAUERWEIN.<br />\nPlans are now in the state of formation which will result in a selfgoverning board of dorm-students.<br />\nThis board will attempt to either prevent or handle any future disturbances at Alumni Memorial.<br />\n<br />\nAn imposing array of gleaming store for the audience -- Stuart Lestarched shirts,studed with studs,the Compte, Jr., sang three baritone solos,<br />\nJohns Hopkins Musical Club sang to aided by the ever-present Gaebby, Jr.,<br />\nan ample,appreciative audience Friday. and Page Turner Extraordinary, Brian<br />\nAnd from the stage of the Maryland Murphy. Glory Road, Sleepy Hollow<br />\nCasualty Hall music ran the gamut of Tunes and My Lindy Lou were the<br />\nquality, from the powerful Rhapsody applause-provoking selections.<br />\nin F Sharp Minor of Dohnanyi to the<br />\nOld Mexico, that is the hill-billy<br />\nubiquitous I'm an Old Cow Hold. The section of Mexico, was portrayed by<br />\nrepeated calls for encores are proof the Banjo Club, in well-known Spanenough of the engaging versatility of ish and Mexican selection. The Quarthis, the oldest and largest club on tette came on next with three poputhe Hopkins campus.<br />\nlar songs. The gag line—\"there is no<br />\nThe success of he affair was un- parting there\" was followed by a<br />\ndoubtedly due to the inspiring leader- general rounds of hand-slapping, and<br />\nship of Conrad Gebelein and Oz Steeper, Marrow, Jenkins, and EhrSteinwald, the coaches of the various bar romped off the stage.<br />\ndivisions of the Musical Club. But<br />\nTwelve good men and true, the<br />\neven with these two popular leaders Blue Jay Orchestra, then did their<br />\nno measure of success could have been stuff. This as, no doubt, the light,<br />\nachieved without the cooperation of cheery portion of the program. And a<br />\nthe members, one and all.<br />\nbit over-enthusiastically one can say<br />\nThe austere Universoty Ode and<br />\nthe lively I Love Life opened the program. The Banjo Club came on next<br />\nwith the March J. H. U. and<br />\nIt's a Sin to Tell a Lie. The ability<br />\nof Conrad Gebelein, Jr., was definitely<br />\nevidenced in the Dohnanyi Rhapsody<br />\nand in the charming E Minor Valse<br />\nof Chopin. Conrad Jr. had a busy<br />\ntime of it, what with accompanying<br />\nthe Banjo Club, Glee Club, Hawaiian<br />\nTroupe, and Blue Jay Band.<br />\n<br />\nthat Hal Kemp, (of Cotillion fame,<br />\nremember?)' had better look to his<br />\nlaurels.<br />\n<br />\nMalotte's beautiful Lord's Prayer<br />\nand Schumanns' Wanderer's Song,<br />\npreceded the two final Hopkins selections, so well sung by sixty-odd voices<br />\nof the Hopkins Glee Club. We can<br />\nonly describe the singing as beautifulful. And with the familiar melodies of<br />\nthose well known Hopkins songs, the<br />\nconcert came to an end. But not until<br />\nBefore the Glee Club sang again, the charming Misses Barbara Koenig<br />\nthe Hawaiian Troup played several and Josephine Burch, the sponsors,<br />\ntropical numbers aided by the magic were presented with red roses.<br />\nelectric guitar of their leader. The<br />\nThe colorful handsome couples, with<br />\nsalty tang of the sea was in the air much gaiety and good cheer, strolled<br />\nas the High Barbary, Shanandoah, to the ball room to dance to the music<br />\nand Salt Beef were heard.<br />\nof Billy Isaac's Band, and so topped off<br />\nAn unannounced treat was next in a truly successful evening.<br />\n<br />\nMiss Margaret Deringer and Mr.<br />\nWilliam J. Bowen, Graduate Students<br />\n(Continued from Page 1, Col. 3)<br />\nnew restrictions placed upon this se- in the Zoology Department, will adlection should result in an appreciable dress the regular meeting of the Bidecrease in his power.<br />\nology Journal Club this Thursday at<br />\nFor a number of years the Univer- 4.00 in room 8, Gilman.<br />\n<br />\nsitly has been forced to make up<br />\n• Miss Deringer's topic will be \"The<br />\nlosses incurred by the annual funcZones and Strata Theory, A Biological<br />\ntion.<br />\nThese losses have presumably been Classification of Race\", and Mr. Bowdue to high expenses and the fact en will speak on \"Amoeboid Structure<br />\nthat the dances didn't go over. There<br />\nand Movement at High Hydrostatic<br />\nare some unbelievers, however, who<br />\nPressures.\"<br />\nmaintain that the dances most certainly did go over. These hardened<br />\nThe Biology Journal Club is a weeksouls point out that although the ly meeting<br />\nof graduate students and<br />\naffairs always seem to be mobbed by<br />\nProfessors in the Biological Departcustomers, and although the prices<br />\ncharged are pretty steep, nevertheless ments.<br />\nthere always seem to be a loss.<br />\nAny surplus acquired by the June<br />\nWeek committee is supposed to be<br />\nturned over to the University to be<br />\nput in a \"fund.\" The contributions to<br />\nthis fund during the past few years<br />\nhave been nil, but the S.A.C. has high<br />\n2- TROUSER<br />\nhopes that all this will be remedied by<br />\ntheir new plan.<br />\n$35 &<br />\n<br />\nSale Of New Spring<br />\n<br />\nWAKELY<br />\n$40 SUITS<br />\n<br />\n• THE NEW<br />\n<br />\nDENTISTRY<br />\nA Phase of Preventive Medicine<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nHARVARD UNIVERSITY<br />\n<br />\nDENTAL SCHOOL<br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER, D.M.D M.D., Dean<br />\nUept. 9, 188 Longwood Are., Boston, Mass.<br />\n<br />\n29.75<br />\nIn this collection you'll find the<br />\ntalked of glen plaids, stripes,<br />\ntweeds and twists. The new<br />\nsport backs, single and doublebreasted and lounge types.<br />\nWe're honor bound to fit you!<br />\n<br />\nilie a,t141; Hub<br />\n\". . . of Charles Street\"<br />\n<br />\n•<br />\n<br />\nDorothy Kilgallen<br />\nTalks To Reporter<br />\n<br />\nU. S. Senator Reynolds<br />\n<br />\nNews - Letter Correspondent<br />\nLauds Aviatrix's \"Lack<br />\nOf Posing\"<br />\n<br />\nsays:\"Luckies are considerate<br />\nof my throat\"<br />\n<br />\nIt was Saturday night. Just like<br />\nthat. . . and IT happened! . . . It was<br />\na great chance for a story and I missed up on it. But, maybe I figures<br />\nthat if any of you wanted a real<br />\nstory . . . you would have read all<br />\nabout it in the newspapers or seen it<br />\npictured in the news-reels, or even<br />\nin the advertisement section of your<br />\nfavorite periodicals . . . .<br />\nSo . . . I thought it would be fun<br />\nNOT to interview 'this here\" celeb<br />\n. . . jult to see what the Real person<br />\nwas like . . . and I did! Instead of a<br />\nnice flash like \" NEWS-LETTER reporter gets low-down of that famous<br />\ngirl reporter . . . around the world<br />\nin 24 V, days . . . Spunky news hawk<br />\nlands at Newark Airport . . World<br />\naclaims daring DOROTHY KILGALLEN!\" . . . No I guessed you would<br />\nlike to know just what a person such<br />\nas Miss Kilgallein is really like . . .<br />\nSo, here 'tis.<br />\nOf all the people in the public eye<br />\nI should like to \"orchid\" Dorothy<br />\nfor here complete lack of posing and<br />\nnatural behavior when under its glare.<br />\nShe is really swell! Though young and<br />\nattractive she has won where many<br />\nnews-men have failed. She does not<br />\ngloat over her past deeds, but is always on the look-out for new and better stories. Though I was in Miss Kilgallen's constant company for several<br />\nhours, never did •she mention her<br />\nbreathless trip . . . That, kids, is more<br />\nthan most of us could or would do. . .<br />\nThough this young lady drinks<br />\nChampagne Cocktails . . . she's NOT<br />\nthe \"Champagne\" type. A more sincere well mannered and delightful<br />\nperson has not been viewed by these<br />\nhere ol' eyes of mine for many a day<br />\n. . . and probably many a day to<br />\ncome.<br />\nShe looks like a million . . . acts<br />\nlike a million, and IS a million in any<br />\nway you look at it . . . What more<br />\ncould want? . . . All I can say is:<br />\nGood-luck for bigger and better<br />\nthings, Dorothy, and the best of<br />\neverything to ya<br />\n<br />\n(Continued from Page 1, Col. 4)<br />\nBaltimore in 1876, and the extraordinary and informal opportunities<br />\noffered there for graduate study,<br />\ntempted him across the water. He was<br />\ncertainly familiar with papers in the<br />\nchemical journals written by Ira<br />\nRemsen, the brilliant young professor who took charge of the new laboratories in Baltimore. Probably in<br />\nBaltimore he acquired his taste for<br />\noysters (The Sign of the Four) and<br />\non a hot summer day noted the depth<br />\nto which the parsley had sunk into<br />\nthe butter (The Adventure of the Six<br />\nNapoleons). In that devoted group<br />\nBOXING DATES CHANGED<br />\nof young scholars and scientists, and<br />\nin the musical circles of the hospitA statement from Ed Lotz, director<br />\nable city, he must have been su- of the intramural boxing tourney<br />\npremely happy.\"<br />\nbrings to light the fact that the dates<br />\nIt has been rumored that a joint of the tournament have been changed<br />\ncommittee of the Department of Eng- to March 11 and 12.<br />\nlish and the Department of Chemistry<br />\nLotz requested further that all apare engaged in investigating Holmes' plication blanks should be returned<br />\nstudies at the Hopkins. Several doc- by March 5 so as to permit the pairing<br />\ntoral dissertations on \"The Sherlock of opponents. Applicants can receive<br />\nHolmes Haemoglobin Blood Test\" (A boxing instruction every Friday afterStudy in Scarlet), \"The Science of noon at the gym. Entrants are furDeduction\" (The Sign of the Four) ther advised to take advantage of the<br />\nand other related subjects will be opportunity for their own, and only<br />\nforthcoming in the near future.<br />\ntheir own benefit.<br />\n<br />\n\"Two Southern traditions are oratory<br />\n—and good tobacco. Lucky Strike<br />\nshows me how to indulge in both. For<br />\nthis light smoke not only pleases my<br />\ntaste but leaves my throat in condition.<br />\nLast fall in North Carolina—when I<br />\nmade over 100 speeches—I visited the<br />\nLucky Strike factory. I believe I discovered, in the Lucky Strike 'Toasting'<br />\nprocess, the secret of what makes this<br />\ncigarette so considerate of my throat.<br />\nI have been more than ever an advocate of a light smoke since seeing the<br />\nextra care and expense devoted to<br />\nmaking Luckies easy on the throat.\"<br />\n<br />\nHON.ROB'T R.REYNOLDS<br />\nU.S.SENATOR FROM NORTH CAROLINA<br />\n<br />\nIn a recent independent survey, an overwhelming majority of lawyers, doctors, lecturers,<br />\nscientists,etc., who said they smoked cigarettes,expressed their personal preference for a light smoke.<br />\nSenator Reynolds' statement verifies the wisdom of this preference and so do leading artists of<br />\nradio, stage, screen and opera, whose voices are<br />\ntheir fortunes, and who choose Luckies, a light<br />\nsmoke. You, too, can have the throat protection<br />\nof Luckies —a light smoke, free of certain harsh<br />\nirritants removed by the exclusive process \"It's<br />\nToasted\". Luckies are gentle on your throat.<br />\n<br />\n\\\\\\.,<br />\n<br />\n•<br />\n<br />\n\"%.<br />\n<br />\nTHE FINEST TOBACCOS<br />\n\"THE CREAM OF THE CROP\"<br />\n<br />\nA Light Smoke<br />\nties Toasted\"—Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\n<br />\nCopyright 1931. The American Tobacco Company<br />\n<br />\n\fHOMEWOOD. BALTIMORE, MARCH 2, 1937<br />\n<br />\n4<br />\n<br />\nCOURT1VIEN FACE LOYOLA T NIGH,<br />\nNext To Last Game Of Season First Lacrosse Practice<br />\nTeams Qualify<br />\n•<br />\n<br />\nBrings Greyhound Quintet<br />\nTo Homewood This Evening<br />\nTraditional Rivalry Of Two<br />\nInstitutions Brought Into<br />\nSpolight<br />\nJAYS EXPECT VICTORY<br />\nGreen And Gray Five Lost<br />\nEarlier In Season To<br />\nJ.H.U. Team<br />\n<br />\nBLACK<br />\nnd<br />\nBLUE<br />\nQuintet Has Good Year<br />\nTo Gardner Mallonee and Utz<br />\nTwardowicz, head coach and assistant respectively of the Blue Jay basketball team, go the plaudits of the<br />\nstudent body. These men, working<br />\nearnestly, seriously, and steadily have<br />\nmolded one of the finest quintets<br />\nyet to appear on the Homewood<br />\nfloor in recent years. Although the<br />\nJay outfit was not very successful<br />\nin its quest for the Maryland Intercollegiate crown, it experienced fine<br />\nsuccess against many of the other<br />\nformidable foes faced.<br />\nSiegel Ends Fine Career<br />\nHerby Siegel, playing in the last<br />\ntwp games of his collegiate career this<br />\nweek brings to a close four years of<br />\n<br />\nThis evening the Blue Jay five<br />\nwill renew an old rivalry when they<br />\nmeet the Loyola College quintet for<br />\nthe last home contest of the current<br />\nseason. A victory over the Green and<br />\nGray team wll boost the Hopkins<br />\naverage to a 50-50 basis.<br />\nAlthough in last place in the Maryland Collegiate League, Loyola has<br />\nto be considered a worthy opponent.<br />\nTheir most recent accomplishment<br />\nwas a 37-36 defeat at the hands of<br />\nthe Washington College Shoremen.<br />\nPrevious to this encounter, they<br />\nweren't rated a chance to furnish consecutive brilliant court performing.<br />\nworthy opposition.<br />\nSince he first donned the Blue and<br />\nTraditional Rivalry<br />\nGold in his frosh year, Herb has<br />\nThe game tonight is awaited with<br />\nexpectancy by the students of both produced a remarkable record of ofinstitutions, in order ,that once more fensive play.<br />\nthe traditional rivalry between the<br />\nNatators Respond To Call<br />\nJays and Greyhounds may be reEarly in the year a plea was issumed. Feeling runs high and specusued through this column for a large<br />\nlation is rampant, even though both<br />\nteams are near the tail end of the turnout for swimming. To this call<br />\nleague.<br />\nHigh hopes are held for the Black<br />\nand Blue combine to turn back another Loyola threat and to make it<br />\ntwo in a row over the Roland Parkers. In the game held not so long<br />\nago, the local team romped off with<br />\na 53-44 win. It was the first win<br />\nscored over the Loyola team since<br />\n1933.<br />\nThe Green and Gray outfit is composed, for the most part, of a veteran<br />\nfive that can click dangerously at<br />\nany moment. Their forwards, Kemper, Devlin, and Flenay, are fast,<br />\ntricky, and evasive. Kelly, a capable<br />\nveteran, will fill in at the center<br />\nposition and must be considered a<br />\ndangerous foe when battling against<br />\nthe Blue team. Wayson and Carney„<br />\nwithout a doubt, compose the finest<br />\nduo of guards in the league. Carney,<br />\na man of years of expreience is captain of the team. A hard player, he<br />\nfills his position capably from both<br />\ndefensive and offensive angles. In<br />\nhis last encounter with the Hopkins<br />\nfive he proved himself a worthy opponent by amassing 17 points to his<br />\ncredit. At his side will be Wayson,<br />\nanother capable performer. It is<br />\nWayson's cool-headedness. accurate<br />\npassing, and great defensive work<br />\nthat has made him the bulwark of<br />\nthe team. In reserve the Green and<br />\nGray team will have Bremer, Russel, and Stevenson.<br />\nRegular Lineup<br />\nThe Hopkins will probably use the<br />\nsame starting line-up as they have<br />\nemployed all season. Shortly Cross<br />\nwill battle the tap and jump for rebounds, while Captain Herb Siegel<br />\nand Norm Melvin will carry the fight<br />\nto the Greyhounds from their forward berths. Hal Zheutlin and Carl<br />\nRa.sin can be counted on to turn in<br />\ntheir usually sparkling performance<br />\nfrom their guard positions. If necessary, Coach Mallonee has Dimmi<br />\nTraggis, Les Rosenthal, Dick Green,<br />\nLen Rubinger, and Jerry Carleton<br />\nalways ready for action.<br />\nProbable line-ups:<br />\nLoyola<br />\nJohns Hopkins<br />\nKemper<br />\nF.<br />\n'Siegel<br />\nDevlin<br />\nF.<br />\nMelvin<br />\n.. . Kelly<br />\nC.<br />\nCross<br />\nCarney<br />\n0<br />\nRasin<br />\nWayson<br />\nG.<br />\niZheutlin<br />\n<br />\nBaseballers To Face<br />\nTowson St. Teachers<br />\nTo Open'37 Season<br />\nOpening the 1937 season against<br />\nTowson State Teachers, the Blue Jay<br />\nBaseball team will start its third<br />\nintercollegiate<br />\nagainst<br />\ncampaign<br />\ncompetition, under the direction of Bob Owings. The ball club<br />\nwill wind up its schedule against St.<br />\nJohns at Annapolis.<br />\nIndoor practice will be held in the<br />\nGilman School cage. The schedule<br />\n<br />\ncame a group of serious athletes who,<br />\nfollowing the generalship of Coach<br />\nHambleton, have developed into a<br />\nsuperior water team. It cannot be<br />\ndenied that there is latent ability<br />\nprevalent among the undergraduate<br />\nbody. Perhaps all Hopkins athletic<br />\n<br />\nOf. Season This Afternoon<br />\n<br />\nWeather Permitting, Fundamentals To Be Taught To<br />\nNewcomers At Wall; Later Coaches Morrill And<br />\nMallonee To Scrimmage Charges<br />\nJohns Hopkins will open its hid for<br />\nnational supremacy this afternoon in<br />\nthe first official lacrosse practice of<br />\nthe 1937 season. Equipment was issued last Friday to all who were interested in the sport. The turnout this<br />\nyear was one of the largest in Blue<br />\nJay hickory history.<br />\nWeather permitting, men representing last spring's varsity, junior<br />\nvarsity, and freshmen arrays, bolstered by a strong group of prep<br />\nschool material, will venture forth<br />\nto the wall on the upper field to<br />\nstart the ball rolling on fundamentals.<br />\nAfter about two weeks of this elementary work and conditioning, upon<br />\nWhich the success of any team depends,<br />\nCoach Morrill and Mallonee will take<br />\ntheir charges through scrimmage<br />\npaces in an effort to weed out those<br />\nmen who will don helmet and gloves<br />\nagainst the Lavender of CCNY at<br />\nHomewood on April 3. Practice will<br />\nnot be held on Mondays, with actual<br />\n<br />\nTerrors Swamped In Both<br />\nMatches Held Last<br />\nSaturday<br />\n<br />\nWednesdays and Thursdays. Fridays<br />\nwill see the 'crossmen indulge in light<br />\nworkouts in preparation for the coming day's contest.<br />\nJack Not Welcome<br />\nShould Jack Frost continue to send<br />\nhis wintry blasts across the athletic<br />\nfield at Homewood, the stickmen will<br />\nbe forced to take care of their preliminary training in the gymnasium<br />\nin the evenings. This system was initiated last spring for the first time<br />\ndue to the late winter, and worked<br />\nout quite successfully.<br />\nAnother innovation at Hopkins will<br />\nbe the combining of the Freshman<br />\nand Junior Varsity aggregations to<br />\nform a nucleus for a training group<br />\nfor future varsities. This group will<br />\nplay various college Jayvees and prep<br />\nschool first teams under the tutelage<br />\nof Frank Dotterweich, former frosh<br />\nmentor.<br />\n<br />\nQuitt, Katz, Brown Secure Ed Lotz To Direct Matches Friday League Champion<br />\nAccording To IntercolFalls Over Opponents<br />\nNot Decided Due To<br />\nlegiate<br />\nRules<br />\nIn Short Time<br />\nPostponements<br />\n_<br />\nEntrees Number Fourteen To<br />\nEnders, Hopkins Win By Date; Dead-Line Set For<br />\nSonneborn And Castelle Star<br />\nNine Second Advantage<br />\nIn Victory Over<br />\nMarch 6<br />\nOver Opponents<br />\nAll Stars<br />\nAn Intramural Boxing Tourna-<br />\n<br />\nQuitt, Johns Hopkins, in the 139<br />\nlb. class won by a fall over Cronin in<br />\n3 minutes, and Brown, also of Hopkins, in the 169 class got a fall<br />\nover Flemin in 1 minute. Lunaso, of<br />\nWestern Maryland, in the heavyweight class got a fall over Pallach,<br />\nwho put up a game fight.<br />\n<br />\nThe Jay wallmen scored a shutout<br />\nReuben Baer accompanied the team<br />\nagainst Western Maryland Saturday<br />\nat Westminster. The Terrors were to Western Maryland. The match atswamped in all three single matches, tracted a large crowd which comand barely threatened in the doubles. pletely filled the galleries. Most of the<br />\nmatches were extremely interesting.<br />\nIry Milberg, first Hopkins singles<br />\nMembers of both teams showed plenty<br />\nman, defeated Rush 21-9, 21-8. In the<br />\nof fight.<br />\nsecond singles, Dick Pasternak took<br />\nThe summaries:<br />\n21-7, 21-10. Berton,<br />\nClark into camp<br />\nof Maryland, went down before Milt<br />\nAlperstein, 21-6, 21-3. The first doubles match saw the smooth combination of Milberg and Alperstein completely smother McKnight and McWilliams keeping their record of only<br />\none defeat in two years of varsity<br />\naction. Nat Finkelstein and Arnold<br />\nGlantz, opposing Rush and Volkvane,<br />\neasily won their first game, 15-3, and<br />\nplayed along in the second, 15-12.<br />\nThe match that was scheduled for<br />\nlast Friday against St. John's was<br />\npostponed because of illness of several of the Johnny players. The handbailers of the University of Pennsylvania. will meet the Black and Blue<br />\nSeam Saturday at the Homewood<br />\nGym.<br />\nThe final match of the handball<br />\ntournament, between Milton Alperstein and Phil Small, will be played<br />\noff this afternoon. The game was<br />\nnot played last week as planned due<br />\nto a conflict of the schedules of the<br />\nfinalists.<br />\n<br />\nscr:narnaging scheduled for Tuesdays,<br />\n<br />\nINTERCOLLEGIATE<br />\nBasketball—Johns Hopkins vs. Loyola College, Tuesday, at Homewood.<br />\nJohns Hopkins vs. St. Johns College, Saturday, at Annapolis.<br />\nFencing- Johns Hopkins vs. St. Johns<br />\nCollege, Wednesday, at Annapolis.<br />\nJohns Hopkins vs. V.M.I., Friday, at Homewood.<br />\nHandball Johns Hopkins vs. U. of<br />\nPennsylvania, Saturday at<br />\nHomewood. (pending)<br />\nWrestling—Johns Hopkins vs. U. of<br />\nMaryland, Wednesday, at Homewood.<br />\nJ.V. SPORTS<br />\nBasketball—Johns Hopkins vs. Loyola College, Tuesday, at Homewood.<br />\nJohns Hopkins vs. St. Johns, Saturday, at Homewood.<br />\nINTER-FRAT SPORTS<br />\nBasketball—Sigma Phi Ep vs. Phi<br />\nAlpha (4 P.M.)<br />\nOmicron Kappa vs. Tau Alpha<br />\n(5 P.M.)<br />\nDelta Phi vs. Alpha Ep (4 P.M.)<br />\nAlpha Delta vs. Beta Theta- Tuesday at Gym (5 P.M.)<br />\n<br />\nHopkins Jay Vee Intramural Boxing Engineers, Frosh<br />\nGrapplers Trounce Tournament To Be Miechs, Goldman<br />\nWestern Maryland Underway March 11 Teams Victorious<br />\n<br />\nThe Hopkins Jay Vee matmen deaggregations would undergo fine sea- feated the Western Maryland Jay<br />\nsons were all this hidden talent to pre- Vee grapplers 21-10 at Western<br />\nsent itself.<br />\nMaryland. There was an exhibition<br />\nmatch between Dodson of Hopkins<br />\nand Cronin of Western Maryland in<br />\nthe 139 pound class. No decision was<br />\ngiven.<br />\n<br />\nWallmen Trounce<br />\nWestern Maryland<br />\n<br />\nSports<br />\nCalendar<br />\n<br />\nVictoroff and Elliot, 119; Elliot<br />\nwon by a fall in 5:20.<br />\nHamilton and Brown, 129; Hamilton won by time advantage of 4:09.<br />\nQuitt and Cronin, 139; Quitt won by<br />\nfall in 3:00.<br />\nDodson and Fleagle, 139; No decision—exhibition.<br />\nKatz and Buchman, 149; Katz won<br />\nby fall in 3:30.<br />\nEnders and McKnight, 159; Enders<br />\nwon by time advantage of 9 seconds.<br />\nBrown and Flemirk, 169; Brown won<br />\nby fall in one minute.<br />\nPollack and Lunaso, heavyweight;<br />\nUunaso won by fall in 4:50.<br />\n<br />\nHopkins Temple<br />\nMatch Not Played<br />\n<br />\nThe arranged match between the<br />\nJohns Hopkins fencers and the Temple fencers was not played because of<br />\na misunderstanding between the managers of the two teams. Coach Paul<br />\nannounced by Manager Mal Boshnack Kaiss was sadly disappointed not<br />\nis as follows:<br />\nto have the match after having gone<br />\nApril 3--Towson State Teachers* to the trouble of traveling up there<br />\nApril 10--Mt. St. Mary*<br />\nwith 14 men.<br />\nApril 12---Loyola<br />\nZucker, the manager of the Hopkins<br />\nApril 16—Drexel<br />\nteam, claimed he made an agreement<br />\nApril 17- -Swarthmore<br />\nwith Temple to fence at 7 o'clock. The<br />\nApril 21—Western Maryland*<br />\nTemple manager claimed it was for<br />\n2 o'clock. The team arrived in PhilaApril 24—Washington<br />\nApril 28--Dickinson<br />\ndelphia about 5 o'clock when it was<br />\nApril 30—Haverford<br />\ntoo late to play. Nevertheless some of<br />\nthe boys stayed in Philadelphia overMay 4 —St. Johns*<br />\nMay 7 -Drew<br />\nnight, while the Coach and Captain<br />\nMay 8--Union<br />\nPeele took a train home.<br />\nMay 11- -Loyola*<br />\nA match is pending with St. Johns<br />\naway on March 3. There is one arMay 19--St. Johns<br />\n(All games will be played away ranged with Virginia Military Instiexcepting those marked*)<br />\ntute on March 5 at Homewood.<br />\n<br />\nment to begin March 11 has been arranged for all those interested in the<br />\nso called manly sport. Thus far approximately fourteen have entered<br />\ntheir names as competitors, while<br />\nquite a few more are expected to enroll before March 6, the dead-line<br />\ndate for entrees.<br />\nLotz Referee<br />\nAll matches are to be run according to the accepted Intercollegiate<br />\nBoxing rules. Each contest consists<br />\nof three two-minute rounds—the decision not to be a draw. It is up to<br />\nthe referee Ed Lotz--to award the<br />\nvictory to either one of the two contestants.<br />\nWinners Get Awards<br />\nThe winner in each division will be<br />\nthe recipient of a gold charm—the<br />\ncontribution of the Intramural Committee. The fact that none of last<br />\nyear's champions have yet been listed<br />\nas candidates for 1937 honors ought<br />\nto be an added incentive to this<br />\nyear's active leather-slingers.<br />\nCoach Ed Lotz has announced that<br />\nequipment is available for those wishing to indulge in practice sessions.<br />\nThose intending to partcipate are<br />\nto place their names in Box 671 before March 6.<br />\nThe entrees so far:<br />\n115 lb. class—H. M. Diver<br />\n125 lb. class- --A. H. Smith, Bob<br />\nVernon.<br />\n135 lb. class - E. Almquist, B.<br />\nRome<br />\n145 lb. class- R. A. Scott, L. Jacobson<br />\n155 lb. class—M. Tuerk, H. Brayshaw<br />\n165 lb. class — D. Greenberg, M.<br />\nKaufman<br />\n175 lb. class--C. E. Jones, G. H.<br />\nGillilan<br />\nHeavyweight—J. Kilbourne<br />\n<br />\nPhi Gams Clash<br />\nWith Kappa Sigs<br />\nOn Wednesday<br />\nThe final round of the nterfraternity basketball tournament<br />\ntakes place Wednesday night at<br />\n9:39 p.m.(when the Kapp Sigs meet<br />\nthe Phi Gams to vie for the championship and the basketball plaque.<br />\nThe game will be played immediately after the Hopkins-Maryland<br />\nwrestling match. The athletics department urges all fraternity support in the stands.<br />\nLast season the Phi Gams also<br />\nearned the right to enter the plaoffs. The Kappa Sigs are a surprise outfit and were hardly expected to come through.<br />\n<br />\nIn class basketball played Wednesday and Thursday, Goldman A. C.,<br />\nFrosh Engineers A, Senior Mechanics,<br />\nand Freshmen A. B. scored victories.<br />\nThe Goldman courtmen topped the<br />\nSilver/Tops 27-15 to win the title of<br />\nthe Wednesday league.<br />\nWhile the Frosh Engineers were<br />\nconquering the Newcomers in the<br />\nThursday league, the Freshman A. B.<br />\nII won a forfeit victory over the<br />\nWhirlwinds to capture honors in that<br />\ndivision. Due to several games that<br />\nwere postponed, the winner of the<br />\nFriday league is not yet decided. The<br />\nGoldman A. C. and the A. B. II team<br />\nwill meet in one play-off game sometime this week. The victor will meet<br />\nthe winner of the Friday league for<br />\nthe second half interclass title.<br />\nLed by Sonneborn and Castelle the<br />\nGoldman five easily conquered the<br />\nformer New Jersey All Stars, 27-15.<br />\nFrosh Engineers Win<br />\nAfter losing to the A. B. II five, the<br />\nfreshman engineers came back to bop<br />\nthe Newcomers 29-17. The Newcomers got away to an early lead, but the<br />\nengineers rallied to go ahead. Agnew<br />\nand Della scored fifteen of the losers<br />\n17 points. Enders and Snodgrass were<br />\nthe big guns for the winners, each<br />\nbagging five goals. Diskin, Holman,<br />\nand Diggs accounted for the remaining points.<br />\nWith Dickler accounting for 12<br />\npoints and aided by Wiseman and<br />\nGambrill,<br />\n<br />\nthe<br />\n<br />\nSenior<br />\n<br />\nMechanics<br />\n<br />\ndowned the A. B. I courtmen 21-14.<br />\n<br />\nFor Interfrat<br />\nBasketball Title<br />\nPhi Gams And Kappa Sigs<br />\nWin Division<br />\nCrowns<br />\nO.K.O. FIVE SURPASSED<br />\n<br />\nFl<br />\nPi Lams Top D.U.'s To Take<br />\nRunner - Up Position In<br />\nDivision A<br />\nExcept for a few games in Division<br />\n13 scheduled for this afternoon at<br />\n4 o'clock, the fraternity basketball<br />\nseason was brought to a close last<br />\nSaturday. Phi Gamma Delta turned<br />\nback a threatening 0. K. 0. five to<br />\nqualify to play Kappa Sigma, Division A winner, in the title play-off.<br />\nIn another contest Pi Lambda Phi<br />\ntopped Delta Upsilon to capture runner-up position behind Kappa Sigma<br />\nin Division A.<br />\nNaylor Stars<br />\nPushing aside the last obstacle in<br />\ntheir quest for the division crown, Phi<br />\nGam easily conquered 0. K. 0. by a<br />\n30-15 score. Naylor, Ghingher, and<br />\nRoyster rang up goals, and Thaler<br />\none for the conquered five to make<br />\nthe score 6-2 a few minutes after play<br />\nstarted. The rest of the first half,<br />\n0. K. 0. was held scoreless while the<br />\nPhi': Gams added nine more points.<br />\nHolding a 15-2 edge at the half, the<br />\nwinners were content to coast to<br />\ntheir victory. As a result Phi Gam<br />\nbarely out scored their opponents<br />\n15-13 in the closing half. Throughout<br />\nthe entire contest, Naylor played a<br />\ngood defensive and offensive game.<br />\nThis win enabled Ghingher, Naylor<br />\nand company to finish the season undefeated.<br />\nLow Scoring<br />\nAlthough both Pi Lambda and Delta<br />\nUpsilon have been eliminated from<br />\nthe pennant race, these teams staged<br />\nan important battle for second place<br />\nin Division A. Low scoring featured<br />\nthe game, but Pi Lam finally won<br />\n11-10.<br />\nNeither team played their usually<br />\nisteady game, but throughout the<br />\ngame the contest was exciting. At<br />\nno time did either team hold more<br />\nthan a two point margin over the<br />\nother. D. U. led at the half by a 7-6<br />\nscore, but Pi Lam came from behind<br />\nto cop the game in the last fifteen<br />\nminutes of play. Stevens and Bert<br />\nMargolis were high scorers with five<br />\npoints credited to each.<br />\nThe final games are scheduled for<br />\nto-day at 4 o'clock. Sigma Phi Epsilon will meet Phi Alpha, Omicron<br />\nKappa Omicron will meet Tau Alpha<br />\nPhi, Delta Phi will battle Alpha Epsilon Pi, and Alpha Delta Phi will<br />\ntangle with Beta Theta Pi.<br />\n<br />\nWestern hid.<br />\nDefeats Jay<br />\nSharpshooters<br />\nRossberg, Hopkins, And<br />\nArmacost, W. M., Have<br />\nPerfect Prone Scores<br />\n<br />\nThe game was marred by frequent<br />\nThe Hopkins sharpshooters were<br />\nfouling, and a total of 17 personals defeated for the second time in two<br />\nwas called by the referee. The Mech- weeks by Western Maryland College<br />\nanics committed eleven and the Pre- yesterday at the Homewood range.<br />\nThe score for the second encounter<br />\nmeds six.<br />\nwas 1,317 to 1,291, with Armacost, of<br />\nWestern Maryland, and Rossberg, of<br />\nJohns Hopkins, each shooting a perfect score in the prone position.<br />\nIn the engagement, held at Westminster last week, the Terrors won<br />\nby a slim margin with good marksWednesday League<br />\nLost manship shown by both teams.<br />\nWon<br />\nThe summary of yesterday's meet:<br />\nGoldman A. C.<br />\n3<br />\n._..0<br />\nWESTERN MARYLAND<br />\n1<br />\nSenior Mechanics<br />\n2<br />\nMyers<br />\n97 93 82-272<br />\n2<br />\n1<br />\nFreshman A. B. I<br />\nArmacost<br />\n100 91 81--272<br />\nParker<br />\n3<br />\n97 84 87-268<br />\nSilver Tops<br />\n0<br />\n94 86 87-267<br />\nLost Hoffa<br />\nWon<br />\nThursday League<br />\nRausch<br />\n98 85 55-238<br />\n0<br />\nFreshman A. B. II<br />\n3<br />\n1<br />\nFrosh Engineers A.... 2<br />\nTotal<br />\n1,317<br />\n2<br />\n1<br />\nWhirlwinds<br />\nJOHNS HOPKINS<br />\n0<br />\n3<br />\nLindenmayer<br />\nNewcomers<br />\n99 89 87--275<br />\n98 89 80- -267<br />\nWon<br />\nFriday League<br />\nLost Guild<br />\nRossberg<br />\n100 82 77-259<br />\n1<br />\n0<br />\nSoph Engineers<br />\nHesser<br />\n94 87 70-251<br />\n1<br />\nCardiacs<br />\n0<br />\nStagmaier<br />\n98 88 53-239<br />\n1<br />\nJunior Engineers<br />\n0<br />\n1,291<br />\nTotal<br />\n1<br />\nFrosh Engineers B<br />\n0<br />\n<br />\nInterclass<br />\nStandings<br />\n<br />\nvi<br />\n<br />\nCl<br />\n<br />\nthe<br />\ncer<br />\n<br />\nbef<br />\nYo<br />\nto<br />\nsen<br />\n<br />\nHo1<br />\n<br />\n'1<br />\nthe<br />\nun<br />\ngro<br />\n<br />\nJoh<br />\norg<br />\nW.<br />\n<br />\nJan<br />\n<br />\nRot<br />\n<br />\nof t<br />\nsea<br />\nsen<br />\nHa<br />\n<br />\ncert<br />\nwh<br />\n<br />\nmos<br />\n<br />\nfine<br />\n<br />\nmen<br />\n<br />\nwee]<br />\nthe<br />\n<br />\n01<br />\nthis<br />\n<br />\nSchc<br />\n<br />\nRobl<br />\n<br />\nSem<br />\nChu]<br />\n<br />\nAl<br />\ncludi<br />\nTrot.<br />\nJay<br />\nthe<br />\nCity<br />\n<br />\nTI<br />\nOsm<br />\nClub<br />\nby<br />\nilton<br />\n<br />\n3.\"<br />\n<br />\nTI<br />\nanno<br />\nfor<br />\nand<br />\nthroi<br />\n<br />\nBo<br />\nslty<br />\nnear<br />\nLibri<br />\ndate<br />\n<br />\nEs.<br />\n<br />\n'Sti<br />\ners a<br />\nannu<br />\nthe<br />\nAsso<br />\n\"Ho'<br />\nhigh<br />\nProt(<br />\nthe<br />\n<br />\nTh<br />\n$400<br />\nlowei<br />\n18 no<br />\nIru<br />\nt aine<br />\n17<br />\n<br />\nTh.<br />\nGrad<br />\nin Li<br />\n12th.<br />\nclonal<br />\nrtusi(<br />\nra<br />\n<br />\n\f", "format": "basic_html", "processed": "A.<br />\nunTiring<br />\nthe<br />\nDWrid<br /><br />\ni#tipiting Nriuoirtirr<br /><br />\nREAD THE NEWSLETTER'S COURT<br />\nOPINION—Page 2<br /><br />\nVOTE IN THE<br />\nNEWS-LETTER<br />\nCOURT ROLL<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 2, 1937<br /><br />\nVOL. XLI, NO. 26<br /><br />\nPRICE 5 CEN111<br /><br />\nHopkins Takes New Step In College Athletics<br />\nF. D. R.'s<br />\nS. A. C. Decrees News Letter Poll Board Of Trustees Decides<br />\nCorwin To Talk To ProbePropose<br />\nd Court Plan<br />\nNew June Week On Court Question That Athletics<br />\nWill Be Made<br />\nOn Roosevelt's<br />\nElectoral System To Be Tomorrow<br />\nindependent of Gate Receipts<br />\nCourt Proposal<br />\nFuture June Week Chairmen Faculty And Students To<br />\nTo Be Approved By<br />\nThree Heads<br /><br />\nPrinceton Scholar Is Leading Constitutional Authority In Country<br /><br />\nLecture Will Be Given In<br />\nLatrobe Hall On<br />\nFriday<br /><br />\nFollowing a conference with Dean<br />\nBerry, the Student Activities Committee announced today that drastic<br />\nchanges will be made in the selection<br />\nof future chairmen of June Week and<br />\nin the dispensation of funds for this<br />\nannual affair.<br />\nHolt Maulsby, chairman of the<br />\nS.A.C., issued the following statement:<br /><br />\nA scholar generally recognized as<br />\nthe leading authority on constitutional law in the United States, Edward Samuel Corwin, McMick profesof<br /><br />\njurispudence at Princeton<br /><br />\nUNEXPLORED<br /><br />\nFIELD<br /><br />\nHopkins Action Completes<br />\nMovement Stared Several Years Ago<br /><br />\nA change in the conduct of its Supreme Court poll to provide for a separate ballot of faculty and student<br /><br />\nDuring the regular<br />\nassembly<br />\nperiod on Thudsday at<br />\n11:30, Dr.<br />\nWilson Schaffer and<br />\nanother university official will be<br />\npresent in<br />\nLevering Hall to explain and<br />\nanswer any questions about<br />\nathletics<br />\nunder the new plan. The<br />\nassembly<br />\nis under the auspices<br />\nof the American Student Union.<br /><br />\nopinion was announced by the NEWSLETTER yesterday. The poll is to be<br />\nconducted in an effort to determine<br />\nHopkins sentiment on President<br />\nRoosevelt's recent proposal to reform<br /><br />\nthe Federal Judiciary.<br />\n\"The Student Activities Committee<br />\nBallots are to be printed in various<br />\nannounces the following change in<br />\nSchouler lecture on Friday .at five<br />\nthe selection of a chairman of June colors and distributed among the<br />\no'clock in the Lecture Room of LaWeek for the year 1937-38. Hereto- departments of the University. The<br />\nAthletics at Hopkins are to be<br />\nan<br />\ntrobe Hall on the subject, \"The Reafore, this position was held by the voter is not<br />\nintegral part of the scholastic<br />\nrequired to sign his name.<br />\npro-,<br />\nson and Reasonableness of the Presiperson selected by the Junior class<br />\ngram, and will be removed<br />\nentirely<br />\nDR. WILSON SCHAFFER<br />\nSharp Division<br />\npresident, and as chairmen handled<br />\nfrom dependence on gate<br />\ndent's Proposal.\" Members of the polreceipts,<br />\nMeanwhile<br />\n,<br />\nas the day of reckoning<br />\nall funds pertaining to this function.<br />\nguarantees, and winning teams,<br />\nitical science department here deacSuccess Of Play Last Week The University found from experience draws near, the division over the issue<br />\ncording to a statement issued by<br />\nclared they could not predict what<br />\nthe<br />\nthat losses occurred every year and grows sharper than<br />\nBoard of Trustees of the Johns<br />\never. While<br />\nProduces Extra<br />\nHopstand he will take on the judicial rethese had to be made good out of<br />\nkins University. Beginning in<br />\nthe Republicans are holding reasonOctober<br />\nfor legislation.<br />\nPerformance<br />\nUniversity funds. In a meeting with<br />\nno admissions will be charged<br />\nto any<br />\nThe current attraction at the Play- Dean Berry, it was decided to turn ably well together, the New Deal<br />\n\"Whatever stand Professor Corwin<br />\ngames, and, after present<br />\ncommitshop has enjoyed a run so successful over to the Student Activities Com- ranks are hopelessly severed. As a<br />\nments are fulfilled, no expense<br />\ntakes on the bill,\" asserted Dr.<br />\nguarthat it has been decided to present it mittee the funds necessary to carry consequenc<br />\nNew<br />\nGroup<br />\nFormed<br />\nTo<br />\nFure,<br />\nanties<br />\nthe<br />\nin<br />\nstrongly<br />\nDemowill be made or accepted.<br />\nJohannes Mattern, associate profes- for one extra<br />\nperformance, Wednes- on this function and that all disburseThe University will finance and<br />\ncratic Hopkins, President Roosevelt<br />\nther Relations Between<br />\nensor of political science, \"it is certain day evening, March 3, at 8.30. The ments would be made through<br />\nthis<br />\ncourage<br />\na complete program of interis<br />\nfacing<br />\na<br />\nsevere<br />\ntest.<br />\ncritics<br />\nhave<br />\nbeen unanimous in their body so that a close check could be<br />\nFaculty And Students<br />\nthat he will make as able a presentacollegiate and intramural sports, sup- -For instance Dr. A. E. Blumberg's<br />\ntion as anyone. Due to his making praise of \"The Father,\" by August maintained and losses prevented. It<br />\nplying coaches and equipment, for<br />\nthe<br />\nA<br />\nnew<br />\nStrindberg, as presented by the Play- was further decided that to insure philosophy<br />\ninstitution, in the form of a<br />\nclass, overwhelmingly<br />\nbenefit entirely of the students.<br />\njudicial review a special field of invesThis<br />\nFireside Discussion Club, will make<br />\nshop under the direction of Dr. N. B. the selection of a competent man for<br />\naction has been taken after<br />\nNew Deal in tint last October, voted<br />\ntigation, he is pecularly qualified to Fagin. Seen<br />\ncareful<br />\nits initial appearance on the campus<br />\nin the play are Hugo the position of chairman of June<br />\nstudy<br />\nby the Department of Physical<br />\nagainst<br />\nthe president's bill in a poll tomorrow night. Under present<br />\nanalyze the question thoroughly and Weisgal, Mary Alvey, Patty Singeplans, Education,<br />\nWeek, the person selected by the Junthe administrative officers<br />\nimpassionately.\"<br />\nvarious Hopkins faculty members<br />\nwald, James Murphy, Louis Adler, ior Class president would have to be last week.<br />\nof the Universities, and the Board<br />\nof<br />\nwill<br />\nmeet<br />\nPatty<br />\nBurgess,<br />\nwith<br />\nand<br />\nsmall<br />\nAlex Batlin. Sets approved by the chairman of June<br />\nMr. Leon Sachs who teaches constudent groups,<br />\nIn a straw vote conducted in OotoTrustees.<br />\neither at the home of the faculty<br />\nstitutional law here, described him as were designed and executed by S. Week, for the present year, the presiber the University showed itself sixty<br />\nRemoving the last trace of possible<br />\nmember or at Levering Hall.<br />\nVannort Chapman, John Levi, and dent of the Cotillion Board,<br />\n\"a genial personality.\"<br />\nand the per cent in<br />\nover<br />\n-emphasis and commercialism<br />\nthe<br />\nNew<br />\nDeal's<br />\nranks. This<br />\nThe purpose of the club which is from<br />\nMore than thirty years ago, Wood- Ralph Nordstrom.<br />\nchairman of the Student Activities<br />\nsports at Hopkins ,and insuring<br />\nroughly<br />\napproxima<br />\ntes<br />\nthe ratio all being organized by Mr. Harnmaker<br />\nDr. Fagin stated that the play was Committee.\"<br />\nrow Wilson, then barely three years<br />\nof that their continuance will not<br />\ndepend<br />\nthe \"Y\", Otts Phillips, and Harold Ja- upon teams<br />\nIn the president's chair at Princeton, the most artistically successful proAccording to many, the adoption of over the nation.<br />\nwhich can win against<br />\ncobs,<br />\nis<br />\nto<br />\nfurther<br />\ncalled in addition to forty-six other duction of the Playshop season, and this plan will mean the end of one of<br />\nrelations<br />\nbetween powerful opponents. The<br />\nWith the exception of the American<br />\npolicy will<br />\nstudents and faculty members and to broaden<br />\nyoungsters, Dr. Corwin, who had just perhaps of many seasons. It has been the juiciest plums in the undergrad Institute of Public Opinion, the<br />\nthe scope of competitive<br />\nNEWS<br />\nreceived his doctorate at the Univer- well-received by the audiences, which political pie. The chairmanship of LETTER is, so far as its managers hold discussions dealing with college sports, and, it is<br />\nhoped, permit Hopsity of Pennsylvania, to a preceptor- have on several nights filled the Play- June Week has always been regarded know, the only agency to conduct a problems, under the leadership of the kins to stand favorably<br />\nagainst other<br />\nship. Ever since then he has been in- shop with enthusiastic applause.<br />\nas the biggest position controlled by poll on the Supreme Court issue so faculty members. Many of the Hop- institutions with a similar<br />\nselection<br />\nkins faculty have expressed full ap- of<br />\nAt the extra performance, the pre- the Junior class president, and the far. Wednesday's ballot<br />\ntimately connected with Princeton<br />\nmaterial \"after enrollment, rather<br />\ncame as a<br />\nproval<br />\nvailing<br />\nprices will be in effect.<br />\nof the idea, and have specified than before.\"<br />\n(Continued on Page 3, Col. 5)<br />\nand has been a full professor since<br />\nresult of the deep interest stirred by<br />\n1918.<br />\nthe proposal all over the University. their desires to cooperate and to make<br />\nNew Move In Athletics<br />\nIn addition to his teaching and reThe NEWS-LETTER polls will open the meetings as informal as possible.<br />\nThe importance of this move will<br />\nsearch works, Dr. Corwin has pubThe first host to this group will be be appreciated by all those<br />\nwith the placing of the ballot box<br />\nwho delished a number of books dealing with<br />\nin the post-office at 9.30 to-morrow President Bowman, who will enter- plore the present semi-profession<br />\nalvarious aspects of the Supreme Court,<br />\nmorning. They will close at 5 p.m. tain the students at tea Wednesday, ism of college athletics, and launches<br />\nincluding The Doctrine of Judicial ReBallots will be found in the post- and will discuss college problems with Hopkins into a field which has<br />\nnot<br />\nview, John Marhall and the Constithe group.<br />\noffice boxes.<br />\nyet been explored. For no other coltution, The Constitution and What it Christopher Morley Thinks Famous Criminologist Used<br />\n—1717.7=1777ralriaiViffes—in- lege or University in the country atMeans Today. One of his more recent<br />\nitiated<br />\nby the Hopkins \"Y,\" the Fire- tempts to maintain a program of inChemist<br />\nry<br />\nLaborato<br />\nPlaysho<br />\nries Here; Search Of Registration<br />\np To Celebrate<br />\nworks, The Twilight of the Supreme<br />\nside Discussion Club is open to every tercollegiate sports as large as that<br />\nLists Proves Fruitless; Grads Start Investigation<br />\nCourt, discusses the situation in which<br />\nBirth Of Russian Poet Hopkins student. All interested stu- of Hopkins, without the assistance<br />\nSupreme Court has left Congress and<br />\ndents are invited to get in touch with of, and indeed, dependence upon, gate<br />\nEditor's Note: The author will make uate study offered here, as well as his<br />\nstate legislatures in regard to their<br />\nThe Playshop of the Johns Hopkins Otts Phillips, Harold Jacobs or Mr. receipts. However, to quote from the<br />\npowers to regulate social problems. an inquiry into the possibility of the familiarity \"with papers in the chem- University will celebrate in April the Hammaker as soon as<br />\nreport, \"a number of colleges have<br />\npossible.<br />\nDr. Corwin points out the tribunal's truth of Mr. Morley's statements that ical journals written by Ira Remsen,\" first centenary of the famous Rusmade significant moves in this direcSherlock Holmes spent several years make it extremely likely that he was sian poet and composer, Alexander<br />\nhaziness.<br />\ntion. Several institutions and at<br />\nDr. Corwin was included on the of his life at the Hopkin. The results \"tempted across the water,\" soon Pushkin. This is in line with the inter- Sex Course Roll Grows<br />\nleast one informal group of colleges<br />\nHonor Roll for 1936 of Nation for of this research will be publihed in after 1876.<br />\nnational celebration being observed<br />\n(Continued on Page 3, Col. 1)<br />\nCalls For Larger Hall<br />\n\"his scholarly knowledge of history future issues of the NEWS-LETTER.<br />\nNo Holmes-lover, no student of this year in many countries. Dr. N. B.<br />\nBy WILLLIAM DIAMOND<br />\nConan Doyle's \"great encyclopedia of Fagin has announced a tentative proand functioning of the judicial power,<br />\nThe attendance at the American<br />\nSherlock Holmes, greatest sleuth in romance,\" will fail to see the signifi- gram, which will probably consist of Student Union<br />\nand especially for his address. The<br />\ncourse on Human ReConstitution as Instrument and Sym- the history of crime detection, stud- cance of Mr. Morley's thesis, that several features. Dr. James Bunyan, production given<br />\nby Dr. Alan F. Guttbol, at the Harvard Tercentenary ied at the Johns Hopkins University Sherlock Holmes was an American. a fellow of the Page School, will be macher, Associate in<br />\nObstetrics at<br />\nduring the first years of its existence. As the author says, \"It would ex- heard in an address on the great poet. the Johns<br />\ncelebration.<br />\nHopkins Medical School, Announces Renovation Of Hopkins<br />\nAt least,. that is what Christopher plain much. The jealousy of Scotland<br />\nArchaeology Museum In First<br />\nThe musical portion of the program is so large that the physics lecture<br />\nMorley, eminent American poet, crit- Yard, the refusal of knighthood, the<br />\nFloor Gilman<br />\nroom,<br />\nRowland<br />\n58,<br />\nhas<br />\nbeen desigA Young Miss Writes On<br />\nic, and essayist, thinks he was doing expert use of Western argot, the off- is now being arranged by Dr. Lu'bouv nated for<br />\nfuture<br />\nlectures.<br />\nDr.<br />\nKeefer,<br />\nof the Teacher's College facDavid M. Robinson, Professor<br />\nMotherhood And Soap between the timle he left the univers- hand behaviour to aristocratic cliThe<br />\nAmerican<br />\nStudent<br />\nUnion of Archaeology, who excavated Olynity in England and his taking rooms ents, the easy camaraderie with ulty. Dr. Keefer took her Ph.D. in<br />\nOne of Hopkins most charming in. Montague Street to open his ca- working people of all sorts, the always German last year at the Johns Hop- wishes to make it clear that the thus in Greece and who plans to rekins University, and is now conduct- course is open to all members of the turn to the scene of the work this<br />\ncoed students recently allowed her reer as consulting criminologist for traveling first class in trains.<br />\ning a course in the History of Music University, regardless of whether summer, will present two out-of-town<br />\nImagination, or possibly her hopes, all Europe.<br />\nOther Clues<br />\nor not they belong to the A. S. U. lectures in the early part of March.<br />\nin the College for Teachers. \"<br />\nto run away with her.<br />\nMr. Morley, in an essay entitled<br />\n\"How significant,\" continues Mr.<br />\nThe<br />\nlectures are held Thursday at<br />\nOn Friday, March 5, he will speak<br />\nShe entered the Ivory Soap contest \"Was Sherlock Holmes an Ameri- Morley, \"is Holme's 'Hum!' when he<br />\n4 p.m.<br />\nat Columbia University on the topic-In the hope of winning ten million can ?\" published in Streamlines, states notes that Irene (A Scandal in Bo- Arthur Garfield Hays<br />\n\"The Ancient Greek House.\" The foldollars to solve the Hopkins financial that Holmes' profound knowledge of hemia) was born in New Jersey. And<br />\nTo Speak Next Week Lecture On \"Old Pompeii\" lowing Tuesday, March 9, he will<br />\nproblems, and in the course of the chemistry was due, in large measure, Watson's careful insertion of U.S.A.<br />\nspeak at the Connecticut College for<br />\ncontest, it was necessary to write a to his knowledge of and intimacy with after every American address, which<br />\nPresented Thursday Women in New London on \"OlynArthur Garfield Hays, well-known<br />\nbrief statement on \"Why I Like Ivory the work of Ira Remsen, brilliant always irritates us, was probably a<br />\n--thus, the Lost Greek City.\"<br />\nSoap.\"<br />\nHopkins chemist and teacher.<br />\ntwit to tease his principle. True, as liberal and labor lawyer, will speak at<br />\nProfessor<br />\nC. C. Mierow, Ph.D. forDr. Robinson wishes to call to the<br />\nthe<br />\nstudent<br />\nassembly<br />\nThursday,<br />\n\"I like Ivory Soap,\" said this intelDid Not Register<br />\nInspector MacDonald once said, (The<br />\nmerly President of Colorado College attention of<br />\nthe students the fact<br />\nligent student, \"because as a mother<br />\nA search of the registration lists Valley of Fear) \"You don't need to March eleventh, Hershner Cross, and<br />\nat present Professor of Biog- that the<br />\nArchaeological Museum in<br />\nof three children and as a housewife I of the University has failed to reveal import an American from outside in president of the Student Council, anraphy at Carleton College, will give the first floor<br />\nGilman has been renofind it . . • • \"<br />\nthe name of the great detective who order to account for American do- nounced late yesterday. Mr. flays is an<br />\nillustrated lecture on \"Riecent vated and that articles<br />\nwell-known<br />\nto Hopkins students, havof genuine<br />\nThat may be all very well, for we solved the problems of The Dancing ings.\" Holmes' American background<br />\nViews of Old Pompeii\" in Latrobe interest can<br />\nbe seen there among<br />\nknow that Hopkins is a liberal insti- Men, The Sussex Vampire, and The would explain, it is pointed out, nu- ing lectured here for several years on<br />\nHall. The lecture is under the aus- other articles.<br />\nlynching, the Bill of Rights, and other<br />\nOn display are numertution and that we have many fern- Three Garridebs. The fact that<br />\n,he did merous other facts in his history.<br />\npices of the Baltimore Society, Arch- ous pieces of<br />\nPertinent<br />\npottery and miniature<br />\nquestions.<br />\nPacked<br />\nhalls<br />\nmists on campus; but the hitch comes not enroll does not, however, preOf Baltimore, Mr. Morley says,<br />\naelogica-1 Institute of America, and sculpture which<br />\nhave been unearthed<br />\nWhen we realize that this delightful clude the possibility of his having \"My own thought is that the opening have always greeted his efforts.<br />\nis to be held on Thursday, March 4, at Olynthus,<br />\nwhere the Johns HopYoung coed signed her name<br />\nstudied at the Hopkins. The unusual of the Johns Hopkins University in<br />\nThere will be no assembly this at 5 o'clock. Students and the<br />\ngen- kins University is conducting the exMiss A. B. Cee.<br />\nand informal opportunities for grad(Continued on Page 3, Col. 1)<br />\nweek.<br />\neral public are invited to attend.<br />\ncavation.<br />\nUniversity, will deliver the James<br /><br />\nDrs<br /><br />\nUniversity Will Finance Complete Program Of<br />\nSports<br /><br />\nHe Will Explain<br /><br />\nChange Looks To Selection Hopkins Approves New Deal<br />\nIn Poll Held Last<br />\nOf More Competent<br />\nOctober<br />\nHead<br /><br />\nHIS STAND UNKNOWN<br /><br />\nsor<br /><br />\nHave Seperate<br />\nBallots<br /><br />\nPROF. EDWARD S. CORVVIN<br /><br />\nPlayshop To Repeat<br />\nThe .Father' Wed.<br /><br />\nBowman Entertains<br />\n41(' Discussion Club<br /><br />\nSays Sherlock Holmes Studied<br />\nUnder Ira Remsen At Hopkins<br /><br />\nDr.Robinson Speaks<br />\nOn Lost Greek City<br /><br />\nHOMEVVOOD, BALTrMORE, MARCH 2, 1941F<br />\ntam n the past features and accomplishments of our athletic system.<br />\n' From now on the status of athletics as part of our<br />\nuniversity--just like any other department—will be<br />\nfurther solidified. The University will support our athletic program just as it backs other parts of our institution.<br />\nThe past intercollegiate and intramural programs will<br />\nbe kept up but will be given more stabilized foundation. It is pleasant to know that they will be maintained<br />\n$2.00<br />\n,• if<br />\n.il)<br />\n,<br />\nSlit<br />\n$2.50<br />\nwithout concern over gate receipts.<br />\nBy Mail<br />\nOur plan will place the Hopkins first among those<br />\ncolleges who believe in an athletic program defew<br />\nCouncil,<br />\nActivities<br />\nStudent<br />\nTreasurer,<br />\nRemit subscription fees to<br />\nto benefit a large portion of the student body and<br />\nsigned<br />\nUniversity.<br />\nRernsen Hall, Postotfice, Johns Hopkins<br />\ndemand the non-dependence on commercialized features<br />\nto carry out such a plan.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nThe new proposal will tend to further decrease any<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nin Ikaltimore, Md., under the Act of<br />\nlooking to commercial ventures to support our athletics<br />\nwith the elimination of gate receipts. \"Athletics for all\"<br />\nPublished semi-weekly from October to June, except during examnow include an even wider range if the alumni and<br />\ncan<br />\nJohns<br />\nthe<br />\nof<br />\nundergraduates<br />\nination and college holiday periods by<br />\nof the University take advantage of attendance<br />\nfriends<br />\nUniversity.<br /><br />\nObe Join 5 Aiopkinf5<br /><br />\nCURBING THE EXECUTIVE<br /><br />\nKnowledge Is Power<br />\nBy HILDRETII<br />\nToday we present a list of answers<br />\nacquired from exams in literature<br />\nand art. We dedicate this column<br />\nto Dr. Fagin and Dr. Spencer.<br /><br />\ntential dictator. We make no apologies for using the word \"dictator\",<br />\nfor we feel we are ysing it sanely.<br />\n\"Our Fathers knew better than we<br />\nthat the specific temptation of gov- 1. King Arthur collected all the<br />\nfine, brave, good-looking young<br />\nernment—any government—even an<br />\nmen of his time and called them<br />\nAmerican government — is to seize<br />\nThe Knuts of the Round Table.<br />\nmore power than is allotted to it. or<br />\nmisues the power it has. They foresaw 2. Shakespeare lived at Windsor<br />\nwith his merry wives.<br />\nthe always possible rise of dazzling<br />\npersonal leadership; they foresaw the 3. He wrote tragedies, comedies,<br />\ndisplacement of law by temporary<br />\nand errors. Most of his plays are<br />\nemotion, the tendency to unwise acterrible tragedies, such as Macbeth, King Lear, and Twelfth<br />\nGranted. But let us examine some tion under stress; and to prevent<br />\nNite in a Bar Room.<br />\nof the epithets the President and his these evils they erected certain barsupporters have used on their oppo- riers. The land was stripped of any 4. Pope wrote principally in heroic cutlets.<br />\nnents. First any one who ventured power superior to the People, who<br />\nHopkins<br />\ninvitations.<br />\nto disagree with them was denounced spoke through the Constitution. The 5. Keats is a poet who wrote on a<br />\nPractically speaking, gate receipts at the Hopkins as a \"chiseler\", upon whom the gov- Presidency was made subordinate to<br />\ngreasy urn.<br />\nEDITORIAL STAFF<br />\nEditor-in-Chief were such that their elimination would make no appreStanlej Finkel<br />\nernment must \"clamp-down\". Then the Constitution. So was the Con- 6. When Adam Bede was an old<br />\nEditors<br />\nManaging<br />\nspeaking,<br />\nCaplan<br />\nfinancially<br />\nSo,<br />\nDavid<br />\nbudget.<br />\nThese<br />\nthe<br />\nMorrow,<br />\nthe<br />\nCourts.<br />\nin<br />\nJames<br />\nciable difference<br />\ncame \"oppressor of the poor,\" \"prince gress. So were<br />\nSports Editor<br />\nman he entered a convent and<br />\nBernar1.1 D. Pinck .<br />\nthe announcement is of little significance. Rather it is an of privilege\", \"malefactor of great three powers of government, with ofEditors<br />\nMangaing<br />\nAssistant<br />\nJr.<br />\nBarroll,<br />\n%Vethered<br />\nRoot,<br />\nBenjannin<br />\nthe father of English<br />\nbecame<br />\nmore<br />\ncan<br />\nbe<br />\nallotments<br />\nAssistant Sports Editor advantage in that budgets and<br />\nwealth,\" and \"economic royalist\". And ficers oath-bound to the Constitution,<br />\nHarold Zheutlin<br />\nLiterature.<br />\nColumnist<br />\nreceipts<br />\ngate<br />\non<br />\nindependependence<br />\nany<br />\nin<br />\ncomplete<br />\nand<br />\nare<br />\nestablished<br />\nascertained<br />\nreadily<br />\nPaul ISerge<br />\nnow comes the best one yet: now Mr.<br />\n7. \"And doth not Brutus bootless<br />\nReporters—Max lskowitz, Nathaniel Finkelstein, Jewett Goldsmith, for revenue in maintaining our athletics is permanently<br />\nRoosevelt's opponents are poor, senile dence of one another, on the supposiRubinger,<br />\nLeonard<br />\nRabin,<br />\nCarl<br />\nAdler,<br />\nJulian<br />\nReizenstein,<br />\nHoward<br />\nknell?\" means Brutus knelt<br />\nof<br />\nall<br />\nthree<br />\nwould<br />\nnever<br />\nthat<br />\ntion<br />\ngone.<br />\ngentlemen who must have younger<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nwithout his boots on.<br />\nis<br />\nreceipts<br />\ngate<br />\nthe<br />\nor<br />\nof<br />\npeople<br />\nelements<br />\nthe<br />\nagainst<br />\nthe<br />\ncombine<br />\nspeaking,<br />\nthem<br />\nBurWilliam<br />\nBroadly<br />\nDiggs,<br />\nCharles<br />\nVictoroff,<br />\nVictor<br />\nthem,<br />\nMurray Keinpton,<br />\n\"helpers\" to guide and assist<br />\nford, J. C. Handelsman, Mal Boshnack, Arnold Glantz.<br />\nalmost the basic evil of emphasis and professionalism or at least reader them harmless. The the law that gave them being. Thus 8. \"The Passing of Arthur\" is a<br />\nbeautiful poem. It reminds me<br />\nin the colleges today. It leads to a vicious circle, which implication is obvious: all who are in far, that foresight has been justified.<br />\nBUSINESS STAFF<br />\na lot of \"Custer's Last Stand.\"<br />\ncases in an atheltic institution rather than the full possession of their mentality Every thrust made against the Consome<br />\nin<br />\nends<br />\nBusiness Manager<br />\nWilliam B. Kerriptun<br />\nLost\"<br />\nAssistant Business Manager an educational one .<br />\nwill invariably agree with the Presi- stitution has been made to get more 9. Milton wrote \"Paradise<br />\nMelville Locker<br />\nand was a Roman Catholic who<br />\nAdvertising Manager<br />\nWe have removed one of the last vestiges of commer- dent; only feeble-minded dotards will authority over the people and to<br />\nWm. C. Erlanger<br />\nCirculation Manager cialized athletics. We have definitely asserted our singraduated at Oxford. He also had<br />\nGerald Willen<br />\nleave the people with less authority<br />\noppose him!<br />\nOffice Manager<br />\nHoward Linkoff<br />\nemphasis on sports<br />\naffairs; but, in every<br />\ngood education.<br />\nown<br />\na<br />\nreasonable<br />\na<br />\ntheir<br />\nover<br />\nmaintaining<br />\nin<br />\ncerity<br />\nCopy and Filing Manager<br />\nMost of those who support the proNathaniel Soifer<br />\nsuch attempt, one of these checks, 10. Poetry is when every line begins<br />\nwith a view to wide participation among the studentss<br />\nadCourt<br />\nposed measure to pack the<br />\nwith a capital letter.<br />\nand oftener two, have operated to prein athletics.<br />\nmit that it has grave flaws: that inRRRRRRRR TED FOR NATIONAL ADVERTISING BY<br />\n11. Lord Macauley suffered from<br />\nvent the seizure of power.\"<br />\ncreasing the number of judges will<br />\ngout and wrote all his poems<br />\nNational Advertising Service, Inc.<br />\n\"The collegiate young man was precisely the one least make the highest tribunal more unThus spoke Mr. W. J. Cameron in<br />\nCollege Publishers Representative<br />\ntrying<br />\nwas<br />\nwho<br />\nin iambic feet.<br />\ncollege,<br />\nthe<br />\nof<br />\npurposes<br />\nthe<br />\nto<br />\n2,<br />\nFeb.<br />\nadapted<br />\non<br />\ntalk<br />\nevening<br />\nSunday<br />\nhis<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\nwieldy and inefficient, and that this<br />\n.<br />\nSAN FRANCISCO<br />\nBOSTON<br />\n.<br />\nCHICAGO<br />\nto romanticize a type of life which he did not understand power would be dangerous if pos- 1936. And we add that just as the 12. Mandolines are high officials in<br />\nPORTLANC<br />\nLOS ANLorLEIS<br />\nof<br />\nChina.<br />\nand into which he did not, fit.\" Dean Christiam Gauss<br />\nsessed by a president with any Fascist People spoke through the ConstituPrinceton University gives a skyrocket of approval for tendencies. But they condone the tion, so they can still speak through 13. Contralto is a low sort of music<br />\nthat only ladies sing.<br />\neven<br />\ndeclining \"rah-rahism.\"<br />\nmeasure as necessary in an emergen- constitutional amendment or<br />\n193t)<br />\nMember<br />\n1937<br />\nSyncopation is emphasis on a<br />\n14.<br />\ncy in which \"time is a major consider- through the entire revocation of the<br />\nnote that is not in the piece.<br />\nPeople<br />\nthe<br />\nuntil<br />\nBut<br />\nConstitution.<br />\nation.\"<br />\ndisDistributors<br />\nspeak in such a way, the three de- 15. An interval in music is the<br />\nAnd yet we are told simultaneously<br />\nthe<br />\nto<br />\npiano<br />\none<br />\nfrom<br />\ntance<br />\nbe<br />\nmust<br />\nof<br />\ngovernment<br />\nIn the Strindberg festival last week, the Hopkins that the emergency is over and that partments<br />\nnext.<br />\nrespective<br />\nin<br />\ntheir<br />\nto<br />\nkeep<br />\nmade<br />\nin<br />\nwork<br />\nfine<br />\nits<br />\nof<br />\nPlayshop continued to give evidence<br />\nnormal prosperity is with us--at least<br />\ndome<br />\nplaces. And the immediate present 16. Michael Angelo painted the<br />\ndramatic endeavors on the Hopkins Campus.<br />\nwe are told that before election in no<br />\nof the Sistine Madonna.<br />\nexecuMembri Of The<br />\nthe<br />\ncurbing<br />\nthat<br />\nof<br />\nis<br />\nnecessity<br />\nfew<br />\ntoo<br />\nFor such an excellent presentation there were<br />\nuncertain terms. Then what is the<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\n17. The dome of St. Paul's is supe department.<br />\nOf Middle Atlantic States<br />\nin the audience. Considered \"one of the most powerful hurry? Why all the rush? Granting tive, or administrativ<br />\nported by eight peers, all of<br />\nOne of the functions of the Contragedies of all time,\" the play was staged in an im- for the sake of argument--and only<br />\nare unfortunately cracked.<br />\nwhich<br />\npressive manner. For the materials and space available, for the sake of argument—that all stitution is to protect minority rights<br />\nTUESDAY, MARCH 2, 1937<br />\nlicense is a license you<br />\npoetic<br />\nA<br />\n18.<br />\nthe settings were unusually effective. A difficult and former New Deal plans and aims have while letting the majority rule. Alget from the Post Office to keep<br />\nheavy production, \"The Father\" was presented with a been for the best interests of the though_ the letters sent in to Senators<br />\npoets. You get one also if you<br />\ncast that gave fitting characterizations. With a long country, still all intelligent observers by their constituents are ten to one<br />\nwant to keep a dog. It costs two<br />\nTomorrow, students and faculty of the Hopkins will and involved title role, Hugo Weisgall turned in a know that most of them have been in opposition to the president's proand you call it a dog<br />\ndollars<br />\nparticipate in a poll on a question which dominates pol- splendid performance. His wife, portrayed by Mary seriously marred in their execution posal, we shall grant for the sake of<br />\nlicense.<br />\nreelection<br />\nitical discussion today.<br />\nAlvey, and the nurse by Patty Singewald, should also by too much haste. New Dealers as- argument that the last<br />\nA medieval mystery play is a<br />\nnum- 19.<br />\nsert that the emergency justified this turns give a fair estimate of the<br />\nWe hope that the students will take this matter of share top honors.<br />\nplay in which the person guilty<br />\nThe Playshop has a right to be proud to add this pro- haste. But now, with the emergency bers favoring and opposing said provoting seriously and cooperate with the NEWS-LETTER<br />\nthe final curtain.<br />\nit has over, why not take enough time to do posal. Even granting this, it is a<br />\nto determine student and faculty opinion on. the court re- duction to those of the many distinguished plays<br />\n20. ,Lady Macbeth died of sleeping<br />\nexistence.<br />\nits<br />\nof<br />\nyears<br />\nfifteen<br />\nthe<br />\nin<br />\nproduced<br />\nand<br />\nthings right? The present form of matter of record that the minority<br />\nform issue. It is an important problem, interesting,<br />\nsickness.<br />\nThe Playshop has again proved its right to claim the Supreme Court has served us thus found is the greatest in our his- 21. Catharsis was a Greek actor.<br />\nupon which it is worthwhile to ascertain campus reIt is obvious that the rights of<br />\naction. In the Hopkins classrooms, much interest has your loyal cooperation and support. It is a worthwhile well for many decades; it is impera- tory!<br />\n22. An epitaph is a short sarcastic<br />\nhuge minority—even if it is still<br />\nthis<br />\nwell<br />\nartiactivity.<br />\nlook<br />\nand<br />\nto<br />\nletters<br />\ntime<br />\nMany<br />\nwe<br />\nthat<br />\ntive<br />\ntake<br />\nquestion.<br />\non<br />\nthis<br />\nmanifested<br />\nbeen<br />\npoem.<br />\na minority--should be carefully conbefore we leap to something new.<br />\ncles have come to us; so we decided to conduct this<br />\n23. Tennyson wrote a poem called<br />\ndisregarded<br />\nsidered, and not hurriedly<br />\npoll.<br />\n\"Grave's Energy.\"<br />\nAnd won't the New Deal ever find<br />\nwith the weak excuse that \"time is a<br />\nwith<br />\njustice<br />\nevery<br />\nfirst<br />\nIn<br />\nits<br />\nfor<br />\nits<br />\npromises?<br />\nthat<br />\nto<br />\nThat's all for now—in the next iskeep<br />\ntime<br />\nstates<br />\nIn brief, the proposal<br />\nmajor consideration.\"<br />\nsue we shall deal cautiously with the<br />\nterm it used the emergency to justiten years of service and who does not retire or resign To the Editor of the NEWS-LETTER<br />\nIn an interesting conversation Bible, religion, and myth.<br />\nPresthe<br />\npromits<br />\nbirthday,<br />\nof<br />\nmost<br />\nfy the breaking of<br />\nwithin six months of his seventieth<br />\nDear Sir:<br />\nwhich we had last year with Dr. H.<br />\nThis week in regard to etiquette.<br />\nident is empowered to appoint one additional justice,<br />\nI arni in favor of President Roosevelt's plan to reform ises. But with the emergency over it<br />\nBowen—then an instructor in<br />\nLee<br />\nappointments<br />\nto<br />\nredeem<br />\nbe<br />\ntime<br />\nhigh<br />\nto<br />\nseem<br />\nA club sandwich is eaten with a<br />\nwould<br />\nthe numbers not to exceed fifteen and the<br />\nCourt.<br />\nthe Supreme<br />\nhistory here—we asked him what he fork after the toast and other ingredthe<br />\nto<br />\nadded<br />\nare<br />\npromise<br />\nsuch<br />\nOne<br />\njudges<br />\npromises.<br />\ncampaign<br />\nfifty<br />\naddition,<br />\nof<br />\nIn<br />\nare permanent.<br />\nMy opinion is formed mostly from an examination<br />\nthought of Mussolini; he replied that ients have been broken. In doing this<br />\nlower courts and the department of Justice is empow- the present state of the Supreme Court. Its most glaring was to submit to the nation a constihe thought him a great man. When one uses a knife and fork.<br />\nconstithe<br />\ninvolving<br />\npower<br />\nassigning<br />\ncases<br />\ntutional<br />\namendment<br />\nprivate<br />\nered to intervene in<br />\nfault is that it is totally undemocratic—nine judges, not<br />\nsocial legisla- we expressed surprise at this opinA tuxedo is worn upon informal<br />\ntutionality of laws.<br />\nrepresentative of average Americans, have been ap- to Congress to enact<br />\n(in effect):<br />\nsaid<br />\nhe<br />\nion,<br />\nafter six o'clock. It is apthat<br />\nMr.<br />\nasserts<br />\noccasions<br />\nDiamond<br />\nEven<br />\ntion.<br />\nWhat is actually accomplished by this measure is still pointed for life. For approximately 100 years, the general<br />\nhe propriate to wear at the theatres;<br />\nwith<br />\neverything<br />\ndisagree<br />\n\"I<br />\nrd<br />\nbe<br />\nthe<br />\nstraightforwa<br />\nwould<br />\nthis<br />\nit<br />\nthat<br />\nthink<br />\ndetermined<br />\nto<br />\nbeen<br />\nseem<br />\ntrend of the American government has<br />\na matter of debate. Most people<br />\nthe desired end. says and does, but I think he's a great at most dinners; at informal parties;<br />\nwill \"pack the court,\" meaning the addition of more by the personal political opinions of nine men due to way to accomplish<br />\nit?<br />\nWhy did not Mr. man because he has been able to im- when dining at home; and when dinnot<br />\ndo<br />\nwhy<br />\nThen<br />\njustices.<br />\nunRooseveltian-minded (economically speaking)<br />\ntheir assumed power to declare acts of Congress<br />\nhis<br />\nSupreme Court press Italy and Europe with his ideas, ing in a restaurant. Full dress is worn<br />\nmake<br />\nRoosevelt<br />\nimportance<br />\nthey<br />\nif<br />\nparamount<br />\nbecause<br />\nof<br />\nis<br />\nopinions<br />\npersonal<br />\ninterpretation<br />\n*<br />\nsay<br />\nI<br />\nconstitutional.<br />\nHowever, this<br />\nThe people has made Italy a major power, and at the opera; at an evening wedding;<br />\nelection?<br />\nbefore<br />\nproposal<br />\nwere deeply concerned with the constitutionality of a<br />\nIn deciding one's stand in this matter.<br />\nthe candi- is a force to be reckoned with. But at a ball; or at a formal evening enwhat<br />\nknow<br />\na<br />\nto<br />\nhave<br />\nright<br />\nthemselves.<br />\namong<br />\nmuch<br />\nso<br />\nthe<br />\nlaw they would not disagree<br />\nThe NEWS-LETTER is in agreeance with most of<br />\nMr. being great does not necessarily mean tertainment.<br />\nsurely<br />\nand<br />\nto<br />\ndo,<br />\nintend<br />\ndates<br />\nletters written to it and we state we are in favor of the At present the judges are for the most part incompetent<br />\nbeing a help to the world as a whole.<br />\nhe<br />\nintended.<br />\nwhat<br />\nknew<br />\nAn announcement of an engageRoosevelt<br />\nunand<br />\nare<br />\nold<br />\nthey<br />\nPresident's plan. We think the charges of \"dictatorship\", for such an important position:<br />\nthink Mussolini is a menace to the ment should be made upon the day<br />\nI<br />\nto<br />\nshow<br />\nthis<br />\nfailure<br />\ncall<br />\nwould<br />\nSome<br />\nan<br />\nby<br />\nemployed<br />\nbeen<br />\nthey<br />\nHad<br />\nsufficient<br />\ncautious.<br />\nthat<br />\nnecessarily<br />\nand<br />\n\"unAmericanism,\" etc., are unsound<br />\nfrom that the bride-to-be chooses to wear<br />\nwould his hand just another example of Mr. world. We must be protected<br />\ncheck by public opinion in the election and swaying of important modern business house, most of them<br />\nFarley's) cleverness; great men.\"<br />\n(and<br />\nher engagement ring for the first time<br />\nRoosevelt's<br />\npilot<br />\nto<br />\nthem<br />\nuse<br />\nwhy<br />\nthis;<br />\nThe<br />\nbefore<br />\ntrue.<br />\nlong<br />\nhave been retired<br />\nthe President and Congress would rather be<br />\nPresident<br />\ncomparing<br />\nnot<br />\nare<br />\nWe<br />\npublicly.<br />\nThe<br />\nplain<br />\nit<br />\ndishonesty.<br />\ncall<br />\nothers<br />\non<br />\nbill is a step towards more democracy, towards the reali- the general course for the most important nation<br />\nRoosevelt with Ii Duce, although such<br />\nthe<br />\nfrom<br />\nle<br />\nIf a toast is proposed to a person,<br />\nmandate<br />\n\"unquestionab<br />\nrehas<br />\nCourt<br />\nSupreme<br />\nzation of what a majority of American people actually the earth? Furthermore, the<br />\nbe that person does not drink the toast.<br />\nwould<br />\ncontrast)<br />\n(and<br />\ncomparison<br />\na<br />\nrefers<br />\nMr.<br />\nDiamond<br />\nwhich<br />\nto<br />\nnation\"<br />\npeatedly been ultra-conservative. At a time when the<br />\nwant.<br />\nsubmit that<br />\nIt is customary to open a gift imreform was made on the basis of a proposed interesting. We merely<br />\nWe believe the Supreme Court Justices to be human. country needs a forward looking policy of social<br />\na great man. mediately upon its receipt.<br />\nbe<br />\nmay<br />\nour<br />\nPresident<br />\nWe<br />\ncanamendment.<br />\nconstitutional<br />\ninefficiWe agree with Justice Stone that \"personal economic and has had one put into operation (although<br />\nThomas Jefferson introduced the<br />\nnot believe that the American people But \"we must be protected from<br />\npredilectiions\" often guide their decisions. We think that ently, in many cases), most of it has been ditched bereally want measures enacted which great men.\" If the Supreme Court is use of finger-bowls that he had obbench<br />\nCourt<br />\nSupreme<br />\nthe<br />\non<br />\njudges<br />\nPresident<br />\nbehind<br />\ncause more of the<br />\nthere is a clear majority of the country<br />\nwould give to the executive depart- allowed to continue to give us this served in Europe.<br />\nRoosevelt and that his moves have wide public support. had been appointed by Republican presidents than by<br />\nment practically all of the power now protection, it will likewise continue<br />\nIn serving people at dinner, dishes<br />\nWhile the present bill is by no means a complete and Democratic ones. The one factor that I can indicate in in<br />\npeople's bulwark.\" Vive le are always removed from the right<br />\n\"the<br />\nbe<br />\nto<br />\nthus<br />\njudiciary,<br />\nthe<br />\nthe<br />\nof<br />\npossession<br />\nadequate solution to the entire problem, it is clearly con- favor of the present Supreme Court is that it recently has<br />\nand served from the left.<br />\nmaking the president, in truth, a po- Supreme Court!<br />\nstitutional satisfactory as opposed to past condition. The defended freedom of speech, although it must have<br />\nIn a double ring ceremony a man<br />\nwar.<br />\nlast<br />\nour<br />\nultimately<br />\nduring<br />\nin<br />\nresult<br />\nsoundly<br />\nslept plenty<br />\nmeasure will ,as is actually intended,<br />\na wedding ring on the same<br />\nwears<br />\nNow President Roosevelt has come out with the idea<br />\nthe passage of Rooseveltian legislation—approved by<br />\nfinger as a woman does.<br />\nof retiring all judges past a certain age and increasing<br />\n25,000,000 voters.<br />\nOn the letter box. or door of the<br />\nWhat is your opinion in this question? Vote tomorrow the number of judges to fifteen. There are justifiable<br />\nit is customary to use the<br />\napartment<br />\nto<br />\nenough<br />\nnot<br />\ngetting<br />\nyou're<br />\nthat<br />\nfeel<br />\nSir:<br />\nEditor:<br />\nthe<br />\nto<br />\nthe<br />\nLetter<br />\n\"pack<br />\nto<br />\nin the NEws-LerrER poll and add to finding out what cries of protest concerning his attempts<br />\ncard in the space provided<br />\nhusbands's<br />\nbetween eat, stay at your table, and we will<br />\ndevelopments<br />\nLatest<br />\nCourt\"; he certainly would appoint men who in case of<br />\neveryone thinks.<br />\nname.<br />\nthe<br />\nfor<br />\nDormer<br />\nJ.<br />\nJames<br />\nand<br />\nManager<br />\na vote would declare his measure constitutional. Although Maxie<br />\ncram all you can eat down your<br />\nWhen a man is walking with two<br />\nprevious presidents, mostly Republicans, have also in their bout over at the Alumni throat.\" Taken only for a moment by<br />\nhe should walk on the outside.<br />\nladies<br />\nthe<br />\nthat<br />\nto<br />\nindicate<br />\n\"packed the Court,\" this does not validate Roosevelt's Hall Arena seem<br />\nsurprise, the student body quickly reIn seating guests at dinner it is<br />\nhas<br />\nstudent,<br />\nthe<br />\nunderdog,<br />\nusual<br />\nattempted action.<br />\ncovered, and let go a burst of right customary to separate married coupThe announcement of the new plan of athletics here<br />\nHowever, in spite of this, I believe the President's bill finally won a round. Diligent followthe<br />\nwhich<br />\nin<br />\nactivity<br />\nuniversity<br />\nof<br />\nphase<br />\nanother<br />\nand left cheers that nearly brought les but allow an engaged man to<br />\nmarks<br />\nprobably<br />\nhave<br />\nrevues<br />\nfistic<br />\nour<br />\nof<br />\ners<br />\nrequire<br />\nshould be passed. The urgent needs of the nation<br />\nthe house down. They followed up by take in his fiancee.<br />\nHopkins is a pioneer. As far as we know, we are unique<br />\nimmediate social and industrial legislation which is only noticed in one of the last week's<br />\nan<br />\nsuch<br />\nwith<br />\nlearning<br />\nof<br />\ninstitutions<br />\nIt is regarded as being in better<br />\ncramming themselves on a<br />\nliterally<br />\namong the higher<br />\nditor<br />\nletter-to-the-e<br />\nsizzling<br />\npossible by passing this bill or by completely disposing flashes: a<br />\nit<br />\nthink<br />\n(I<br />\nsalmon<br />\nof<br />\nsupper<br />\ndelicious<br />\nto allow the chair to rest where<br />\nform<br />\nathletic policy—a broad amateur program, with gate<br />\nor the services of those nine august gentlemen. The latter which complained about the quality<br />\nchips! Some it is when one rises from the table.<br />\nand<br />\npotato<br />\nsalmon),<br />\nwas<br />\nreceipts eliminated. While there are some universities<br />\n\"meals.\"<br />\nI believe too drastic and impossible a change to be at- and punch of Dormitory<br />\neven had two glasses of milk in celewho possess certain features of our system, there are<br />\nTissue paper that come with ennow. The new body would be more competent (Not a bit exaggerated in my opintempted<br />\ngate<br />\nabolishing<br />\nof<br />\nWhoopee!<br />\nbration.<br />\ninvitations should not be foldgraved<br />\nnone who have yet reached the point<br />\nto rule on the Supreme Court bench, and would certainly ion). Somehow the word must have<br />\nthe invitations.<br />\nreceipts. It is a new venture, in harmony with the attiwith<br />\nin<br />\ned<br />\nreal<br />\nthe<br />\nthat<br />\nforgotten<br />\nthey<br />\nHaven't<br />\nthey<br />\nfor<br />\nmanagers<br />\nDorm<br />\nthe<br />\nbetter represent the opinions of the mass of Americans. reached<br />\nA buffet breakfast may be served<br />\ntude of the Hopkins towards athletics.<br />\nis in reeard to the aualitv<br />\ncomplaint<br />\nwith<br />\nhuddle<br />\na<br />\ninto<br />\nwent<br />\nimmediately<br />\nto<br />\nnot<br />\nwedge.<br />\noncninff<br />\nan<br />\nbe<br />\nwould<br />\nmeasure<br />\na<br />\nsuch<br />\nAlso<br />\ninca lira,<br />\nthe nhoin nf<br />\nlatest -I—<br />\n11117s<br />\nand not the quantity of food served? at noon, a luncheon at one or two<br />\nmake a \"dictator\" out of the President, but to lessen the their seconds.<br />\ntime in the<br />\nour policy to place athletics on a strict university, amaThey pulled the unexpected last I am inclined to believe that they are o'clock, a supper at any<br />\ndictatorship of the Supreme Court either by not having<br />\nteur level. It is a logical outgrowth of the original plan<br />\nevening.<br />\na<br />\nfor<br />\nDon't<br />\nchange.<br />\nissue<br />\nthe<br />\navoiding<br />\nproca<br />\nCharley Squire,<br />\nnew one (as England very successfully does) or by making it Sunday when<br />\nHistory will be the topic for next<br />\nof the department of physical education when the<br />\ntor, got up into the middle of the ring, you think so?<br />\ndemocratic.<br />\nwas<br />\nShaffer<br />\nDr.<br />\nsports program went into effect and<br />\nweek.<br />\nDormer.<br />\nAnother<br />\nand attempted a kayo punch. \"If you<br />\n—Benson Ross<br />\nplaced in charg.e It will serve to strengthen and main-<br /><br />\newz<br /><br />\nLetter<br /><br />\nRssocicded GNIeesiate Press<br />\na<br /><br />\nBy Merton S. Fales, Jr.<br />\nThis article was called forth by Mr.<br />\nDiamond's well written article,\"Curbing the Court,\" which appeared in the<br />\nlast issue of the NEWS-LETTER. We<br />\nshall begin with a quotation from said<br />\narticle:<br />\n\"No man presents a plan for changing<br />\nthe arrangement of the<br />\nSupreme Court without having the<br />\nepithets of 'radical' and 'dictator'<br />\nshouted at him from every corner of<br />\nthe nation.\"<br /><br />\nA Splendid Performance<br /><br />\nColle6iate Digest<br /><br />\nTomorrow's Poll<br /><br />\nLetter To The Editor<br /><br />\nLETTER TO THE EDITOR<br /><br />\nAgain We Lead<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 2, 1937<br /><br />\nS. A. C. Decrees Biology Students<br />\nTrustees Ban Letter 'to Parents Concert Acclaimed Success,<br />\nGate Receipts Ends Dorm Strife Program Meets With Approval New June Week To Hear Two Grads<br />\nElectoral System<br />\nDorms To Be Governed By<br />\nAt All Contests Student Board Aim<br />\nOf New Plan<br />\nUniversity Will Finance Complete Program Of<br />\nSports<br />\nUNEXPLORED<br /><br />\nFIELD<br /><br />\nHopkins Action Completes<br />\nMovement Stared Several Years Ago<br />\n(Continued from Page 1, Col. 6)<br />\nare now considering seriously the<br />\nelimination of gate-receipts as a last<br />\nstep in a return to an athletic program primarily for the benefit of the<br />\nstudents.\"<br />\nThe working of the plan will be<br />\nsimple. The University will issue,<br />\nWithout charge, cards of admission<br />\nto the athletic contests. In distribution, alumni will be given preference.<br />\nIt is planned to'issue season tickets<br />\nto all graduates of the University,<br />\nand to provide free tickets to others<br />\nWho apply to the Director of Athletics. The number of tickets distributed to non-alumni will be limited<br />\nonly by the size of facilities at the<br />\nHomewood Field and Gymnasium.<br />\nMove Continues Policy<br />\nThis move is a continuation of the<br />\npolicy adopted several years ago,<br />\nWhen the few existing athletic scholarships were abolished, athletics<br />\nbrought under the control of the University, and a strong program of intramural sports introduced. At the<br />\nsame time, the scope of intercollegiate activities was extended to cover<br />\nthirteen sports instead of six. There<br />\nmay be a further extension under the<br />\nnew plan.<br />\nThe resu ltls were eminently<br />\nsatisfactory. Eighty-five per cent of<br />\nstudents engaged in some sort of<br />\nathletic activity, instead of a chosen<br />\nhandful, and there was a lessened<br />\ntendency to emphasize the records of<br />\nthe individual team. But it was still<br />\nIncomplete. The final step is the removal of the gate-receipts and guarantees, which at times led to a temptation to schedule games which drew<br />\nlarge crowds with opponents which<br />\nhopelessly outclassed Hopkins, and<br />\nto accept games with larger teams<br />\nfor the sake of the fat guarantee, and<br />\nproviding the other team with a<br />\n\"breather.\" However, this has not<br />\nbeen done, and the temptation itself<br />\nIs now finally removed.<br />\nJust what effect this move will<br />\nhave on the rating of Hopkins teams<br />\nis not known. Under the other plan,<br />\nthe records have been poor on the surface, because Hopkins could play only<br />\nteams of comparable ability, and<br />\nchose its teams entirely from the<br />\nmaterial which naturally turned out.<br />\nHowever, assuming that the purpose<br />\nOf college athletics is to provide<br />\ntraining and physical development for<br />\nthe students, the plan was a success.<br />\nTo quote from the report, \"There is<br />\nreason to believe, however, that with<br />\nadequate training and instruction,<br />\nHopkins teams should be equal to<br />\nthose of other institutions comparable<br />\nin size.\"<br /><br />\nMorley Says Sherlock<br />\nHolmes Studied Here<br /><br />\n11<br />\nle<br /><br />\ne.<br />\nis<br /><br />\ner<br />\nre<br /><br />\n11 d-<br /><br />\nThe letter sent by the treasurer's<br />\noffice to the parents of those men lately troubled by that bureau has been<br />\nreleased for publication in the NEWSLETTER. The letter, published below, is<br />\nthe culmination of a few weeks of<br />\nstrife between dorm residence and<br />\ndorm powers. The trouble had been<br />\nbrought on by the letter of condemnation first sent out, which was recently<br />\npublished by this organ. The \"letter<br />\nof exoneration\" follows:<br />\nDear Mr.<br />\nSince an arrangement has been<br />\nmade for covering the primary cost<br />\nof the damage resulting from the<br />\ndisturbance in — Entry of the<br />\nAlumni Memorial Hall Dormitory<br />\nreferred to in my earlier letter, and<br />\nand since the residents of — Entry<br />\nare cooperating with the University authorities in clearing up the<br />\ndifficulties of the past and in making provision against similar trouble in the future, we are glad to<br />\ninform you that it will not be necessary to impose any penalties on<br />\nresidents of — Entry and that all<br />\ndisciplinary action has been recinded. This means that there will<br />\nbe no charge on the records because<br />\nof the past disturbance.<br />\nYours very truly,<br />\nM. W. SAUERWEIN.<br />\nPlans are now in the state of formation which will result in a selfgoverning board of dorm-students.<br />\nThis board will attempt to either prevent or handle any future disturbances at Alumni Memorial.<br /><br />\nAn imposing array of gleaming store for the audience -- Stuart Lestarched shirts,studed with studs,the Compte, Jr., sang three baritone solos,<br />\nJohns Hopkins Musical Club sang to aided by the ever-present Gaebby, Jr.,<br />\nan ample,appreciative audience Friday. and Page Turner Extraordinary, Brian<br />\nAnd from the stage of the Maryland Murphy. Glory Road, Sleepy Hollow<br />\nCasualty Hall music ran the gamut of Tunes and My Lindy Lou were the<br />\nquality, from the powerful Rhapsody applause-provoking selections.<br />\nin F Sharp Minor of Dohnanyi to the<br />\nOld Mexico, that is the hill-billy<br />\nubiquitous I'm an Old Cow Hold. The section of Mexico, was portrayed by<br />\nrepeated calls for encores are proof the Banjo Club, in well-known Spanenough of the engaging versatility of ish and Mexican selection. The Quarthis, the oldest and largest club on tette came on next with three poputhe Hopkins campus.<br />\nlar songs. The gag line—\"there is no<br />\nThe success of he affair was un- parting there\" was followed by a<br />\ndoubtedly due to the inspiring leader- general rounds of hand-slapping, and<br />\nship of Conrad Gebelein and Oz Steeper, Marrow, Jenkins, and EhrSteinwald, the coaches of the various bar romped off the stage.<br />\ndivisions of the Musical Club. But<br />\nTwelve good men and true, the<br />\neven with these two popular leaders Blue Jay Orchestra, then did their<br />\nno measure of success could have been stuff. This as, no doubt, the light,<br />\nachieved without the cooperation of cheery portion of the program. And a<br />\nthe members, one and all.<br />\nbit over-enthusiastically one can say<br />\nThe austere Universoty Ode and<br />\nthe lively I Love Life opened the program. The Banjo Club came on next<br />\nwith the March J. H. U. and<br />\nIt's a Sin to Tell a Lie. The ability<br />\nof Conrad Gebelein, Jr., was definitely<br />\nevidenced in the Dohnanyi Rhapsody<br />\nand in the charming E Minor Valse<br />\nof Chopin. Conrad Jr. had a busy<br />\ntime of it, what with accompanying<br />\nthe Banjo Club, Glee Club, Hawaiian<br />\nTroupe, and Blue Jay Band.<br /><br />\nthat Hal Kemp, (of Cotillion fame,<br />\nremember?)' had better look to his<br />\nlaurels.<br /><br />\nMalotte's beautiful Lord's Prayer<br />\nand Schumanns' Wanderer's Song,<br />\npreceded the two final Hopkins selections, so well sung by sixty-odd voices<br />\nof the Hopkins Glee Club. We can<br />\nonly describe the singing as beautifulful. And with the familiar melodies of<br />\nthose well known Hopkins songs, the<br />\nconcert came to an end. But not until<br />\nBefore the Glee Club sang again, the charming Misses Barbara Koenig<br />\nthe Hawaiian Troup played several and Josephine Burch, the sponsors,<br />\ntropical numbers aided by the magic were presented with red roses.<br />\nelectric guitar of their leader. The<br />\nThe colorful handsome couples, with<br />\nsalty tang of the sea was in the air much gaiety and good cheer, strolled<br />\nas the High Barbary, Shanandoah, to the ball room to dance to the music<br />\nand Salt Beef were heard.<br />\nof Billy Isaac's Band, and so topped off<br />\nAn unannounced treat was next in a truly successful evening.<br /><br />\nMiss Margaret Deringer and Mr.<br />\nWilliam J. Bowen, Graduate Students<br />\n(Continued from Page 1, Col. 3)<br />\nnew restrictions placed upon this se- in the Zoology Department, will adlection should result in an appreciable dress the regular meeting of the Bidecrease in his power.<br />\nology Journal Club this Thursday at<br />\nFor a number of years the Univer- 4.00 in room 8, Gilman.<br /><br />\nsitly has been forced to make up<br />\n• Miss Deringer's topic will be \"The<br />\nlosses incurred by the annual funcZones and Strata Theory, A Biological<br />\ntion.<br />\nThese losses have presumably been Classification of Race\", and Mr. Bowdue to high expenses and the fact en will speak on \"Amoeboid Structure<br />\nthat the dances didn't go over. There<br />\nand Movement at High Hydrostatic<br />\nare some unbelievers, however, who<br />\nPressures.\"<br />\nmaintain that the dances most certainly did go over. These hardened<br />\nThe Biology Journal Club is a weeksouls point out that although the ly meeting<br />\nof graduate students and<br />\naffairs always seem to be mobbed by<br />\nProfessors in the Biological Departcustomers, and although the prices<br />\ncharged are pretty steep, nevertheless ments.<br />\nthere always seem to be a loss.<br />\nAny surplus acquired by the June<br />\nWeek committee is supposed to be<br />\nturned over to the University to be<br />\nput in a \"fund.\" The contributions to<br />\nthis fund during the past few years<br />\nhave been nil, but the S.A.C. has high<br />\n2- TROUSER<br />\nhopes that all this will be remedied by<br />\ntheir new plan.<br />\n$35 &amp;<br /><br />\nSale Of New Spring<br /><br />\nWAKELY<br />\n$40 SUITS<br /><br />\n• THE NEW<br /><br />\nDENTISTRY<br />\nA Phase of Preventive Medicine<br />\nCollege Men find in it unusual<br />\nopportunities for a career<br />\nHARVARD UNIVERSITY<br /><br />\nDENTAL SCHOOL<br />\nA competent course of preparation for<br />\nthe dental profession. A \"Class A\"<br />\nSchool. Write for catalogue.<br />\nLEROY M. S. MINER, D.M.D M.D., Dean<br />\nUept. 9, 188 Longwood Are., Boston, Mass.<br /><br />\n29.75<br />\nIn this collection you'll find the<br />\ntalked of glen plaids, stripes,<br />\ntweeds and twists. The new<br />\nsport backs, single and doublebreasted and lounge types.<br />\nWe're honor bound to fit you!<br /><br />\nilie a,t141; Hub<br />\n\". . . of Charles Street\"<br /><br />\n•<br /><br />\nDorothy Kilgallen<br />\nTalks To Reporter<br /><br />\nU. S. Senator Reynolds<br /><br />\nNews - Letter Correspondent<br />\nLauds Aviatrix's \"Lack<br />\nOf Posing\"<br /><br />\nsays:\"Luckies are considerate<br />\nof my throat\"<br /><br />\nIt was Saturday night. Just like<br />\nthat. . . and IT happened! . . . It was<br />\na great chance for a story and I missed up on it. But, maybe I figures<br />\nthat if any of you wanted a real<br />\nstory . . . you would have read all<br />\nabout it in the newspapers or seen it<br />\npictured in the news-reels, or even<br />\nin the advertisement section of your<br />\nfavorite periodicals . . . .<br />\nSo . . . I thought it would be fun<br />\nNOT to interview 'this here\" celeb<br />\n. . . jult to see what the Real person<br />\nwas like . . . and I did! Instead of a<br />\nnice flash like \" NEWS-LETTER reporter gets low-down of that famous<br />\ngirl reporter . . . around the world<br />\nin 24 V, days . . . Spunky news hawk<br />\nlands at Newark Airport . . World<br />\naclaims daring DOROTHY KILGALLEN!\" . . . No I guessed you would<br />\nlike to know just what a person such<br />\nas Miss Kilgallein is really like . . .<br />\nSo, here 'tis.<br />\nOf all the people in the public eye<br />\nI should like to \"orchid\" Dorothy<br />\nfor here complete lack of posing and<br />\nnatural behavior when under its glare.<br />\nShe is really swell! Though young and<br />\nattractive she has won where many<br />\nnews-men have failed. She does not<br />\ngloat over her past deeds, but is always on the look-out for new and better stories. Though I was in Miss Kilgallen's constant company for several<br />\nhours, never did •she mention her<br />\nbreathless trip . . . That, kids, is more<br />\nthan most of us could or would do. . .<br />\nThough this young lady drinks<br />\nChampagne Cocktails . . . she's NOT<br />\nthe \"Champagne\" type. A more sincere well mannered and delightful<br />\nperson has not been viewed by these<br />\nhere ol' eyes of mine for many a day<br />\n. . . and probably many a day to<br />\ncome.<br />\nShe looks like a million . . . acts<br />\nlike a million, and IS a million in any<br />\nway you look at it . . . What more<br />\ncould want? . . . All I can say is:<br />\nGood-luck for bigger and better<br />\nthings, Dorothy, and the best of<br />\neverything to ya<br /><br />\n(Continued from Page 1, Col. 4)<br />\nBaltimore in 1876, and the extraordinary and informal opportunities<br />\noffered there for graduate study,<br />\ntempted him across the water. He was<br />\ncertainly familiar with papers in the<br />\nchemical journals written by Ira<br />\nRemsen, the brilliant young professor who took charge of the new laboratories in Baltimore. Probably in<br />\nBaltimore he acquired his taste for<br />\noysters (The Sign of the Four) and<br />\non a hot summer day noted the depth<br />\nto which the parsley had sunk into<br />\nthe butter (The Adventure of the Six<br />\nNapoleons). In that devoted group<br />\nBOXING DATES CHANGED<br />\nof young scholars and scientists, and<br />\nin the musical circles of the hospitA statement from Ed Lotz, director<br />\nable city, he must have been su- of the intramural boxing tourney<br />\npremely happy.\"<br />\nbrings to light the fact that the dates<br />\nIt has been rumored that a joint of the tournament have been changed<br />\ncommittee of the Department of Eng- to March 11 and 12.<br />\nlish and the Department of Chemistry<br />\nLotz requested further that all apare engaged in investigating Holmes' plication blanks should be returned<br />\nstudies at the Hopkins. Several doc- by March 5 so as to permit the pairing<br />\ntoral dissertations on \"The Sherlock of opponents. Applicants can receive<br />\nHolmes Haemoglobin Blood Test\" (A boxing instruction every Friday afterStudy in Scarlet), \"The Science of noon at the gym. Entrants are furDeduction\" (The Sign of the Four) ther advised to take advantage of the<br />\nand other related subjects will be opportunity for their own, and only<br />\nforthcoming in the near future.<br />\ntheir own benefit.<br /><br />\n\"Two Southern traditions are oratory<br />\n—and good tobacco. Lucky Strike<br />\nshows me how to indulge in both. For<br />\nthis light smoke not only pleases my<br />\ntaste but leaves my throat in condition.<br />\nLast fall in North Carolina—when I<br />\nmade over 100 speeches—I visited the<br />\nLucky Strike factory. I believe I discovered, in the Lucky Strike 'Toasting'<br />\nprocess, the secret of what makes this<br />\ncigarette so considerate of my throat.<br />\nI have been more than ever an advocate of a light smoke since seeing the<br />\nextra care and expense devoted to<br />\nmaking Luckies easy on the throat.\"<br /><br />\nHON.ROB'T R.REYNOLDS<br />\nU.S.SENATOR FROM NORTH CAROLINA<br /><br />\nIn a recent independent survey, an overwhelming majority of lawyers, doctors, lecturers,<br />\nscientists,etc., who said they smoked cigarettes,expressed their personal preference for a light smoke.<br />\nSenator Reynolds' statement verifies the wisdom of this preference and so do leading artists of<br />\nradio, stage, screen and opera, whose voices are<br />\ntheir fortunes, and who choose Luckies, a light<br />\nsmoke. You, too, can have the throat protection<br />\nof Luckies —a light smoke, free of certain harsh<br />\nirritants removed by the exclusive process \"It's<br />\nToasted\". Luckies are gentle on your throat.<br /><br />\n\\\\\\.,<br /><br />\n•<br /><br />\n\"%.<br /><br />\nTHE FINEST TOBACCOS<br />\n\"THE CREAM OF THE CROP\"<br /><br />\nA Light Smoke<br />\nties Toasted\"—Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br /><br />\nCopyright 1931. The American Tobacco Company<br /><br />\nHOMEWOOD. BALTIMORE, MARCH 2, 1937<br /><br />\n4<br /><br />\nCOURT1VIEN FACE LOYOLA T NIGH,<br />\nNext To Last Game Of Season First Lacrosse Practice<br />\nTeams Qualify<br />\n•<br /><br />\nBrings Greyhound Quintet<br />\nTo Homewood This Evening<br />\nTraditional Rivalry Of Two<br />\nInstitutions Brought Into<br />\nSpolight<br />\nJAYS EXPECT VICTORY<br />\nGreen And Gray Five Lost<br />\nEarlier In Season To<br />\nJ.H.U. Team<br /><br />\nBLACK<br />\nnd<br />\nBLUE<br />\nQuintet Has Good Year<br />\nTo Gardner Mallonee and Utz<br />\nTwardowicz, head coach and assistant respectively of the Blue Jay basketball team, go the plaudits of the<br />\nstudent body. These men, working<br />\nearnestly, seriously, and steadily have<br />\nmolded one of the finest quintets<br />\nyet to appear on the Homewood<br />\nfloor in recent years. Although the<br />\nJay outfit was not very successful<br />\nin its quest for the Maryland Intercollegiate crown, it experienced fine<br />\nsuccess against many of the other<br />\nformidable foes faced.<br />\nSiegel Ends Fine Career<br />\nHerby Siegel, playing in the last<br />\ntwp games of his collegiate career this<br />\nweek brings to a close four years of<br /><br />\nThis evening the Blue Jay five<br />\nwill renew an old rivalry when they<br />\nmeet the Loyola College quintet for<br />\nthe last home contest of the current<br />\nseason. A victory over the Green and<br />\nGray team wll boost the Hopkins<br />\naverage to a 50-50 basis.<br />\nAlthough in last place in the Maryland Collegiate League, Loyola has<br />\nto be considered a worthy opponent.<br />\nTheir most recent accomplishment<br />\nwas a 37-36 defeat at the hands of<br />\nthe Washington College Shoremen.<br />\nPrevious to this encounter, they<br />\nweren't rated a chance to furnish consecutive brilliant court performing.<br />\nworthy opposition.<br />\nSince he first donned the Blue and<br />\nTraditional Rivalry<br />\nGold in his frosh year, Herb has<br />\nThe game tonight is awaited with<br />\nexpectancy by the students of both produced a remarkable record of ofinstitutions, in order ,that once more fensive play.<br />\nthe traditional rivalry between the<br />\nNatators Respond To Call<br />\nJays and Greyhounds may be reEarly in the year a plea was issumed. Feeling runs high and specusued through this column for a large<br />\nlation is rampant, even though both<br />\nteams are near the tail end of the turnout for swimming. To this call<br />\nleague.<br />\nHigh hopes are held for the Black<br />\nand Blue combine to turn back another Loyola threat and to make it<br />\ntwo in a row over the Roland Parkers. In the game held not so long<br />\nago, the local team romped off with<br />\na 53-44 win. It was the first win<br />\nscored over the Loyola team since<br />\n1933.<br />\nThe Green and Gray outfit is composed, for the most part, of a veteran<br />\nfive that can click dangerously at<br />\nany moment. Their forwards, Kemper, Devlin, and Flenay, are fast,<br />\ntricky, and evasive. Kelly, a capable<br />\nveteran, will fill in at the center<br />\nposition and must be considered a<br />\ndangerous foe when battling against<br />\nthe Blue team. Wayson and Carney„<br />\nwithout a doubt, compose the finest<br />\nduo of guards in the league. Carney,<br />\na man of years of expreience is captain of the team. A hard player, he<br />\nfills his position capably from both<br />\ndefensive and offensive angles. In<br />\nhis last encounter with the Hopkins<br />\nfive he proved himself a worthy opponent by amassing 17 points to his<br />\ncredit. At his side will be Wayson,<br />\nanother capable performer. It is<br />\nWayson's cool-headedness. accurate<br />\npassing, and great defensive work<br />\nthat has made him the bulwark of<br />\nthe team. In reserve the Green and<br />\nGray team will have Bremer, Russel, and Stevenson.<br />\nRegular Lineup<br />\nThe Hopkins will probably use the<br />\nsame starting line-up as they have<br />\nemployed all season. Shortly Cross<br />\nwill battle the tap and jump for rebounds, while Captain Herb Siegel<br />\nand Norm Melvin will carry the fight<br />\nto the Greyhounds from their forward berths. Hal Zheutlin and Carl<br />\nRa.sin can be counted on to turn in<br />\ntheir usually sparkling performance<br />\nfrom their guard positions. If necessary, Coach Mallonee has Dimmi<br />\nTraggis, Les Rosenthal, Dick Green,<br />\nLen Rubinger, and Jerry Carleton<br />\nalways ready for action.<br />\nProbable line-ups:<br />\nLoyola<br />\nJohns Hopkins<br />\nKemper<br />\nF.<br />\n'Siegel<br />\nDevlin<br />\nF.<br />\nMelvin<br />\n.. . Kelly<br />\nC.<br />\nCross<br />\nCarney<br />\n0<br />\nRasin<br />\nWayson<br />\nG.<br />\niZheutlin<br /><br />\nBaseballers To Face<br />\nTowson St. Teachers<br />\nTo Open'37 Season<br />\nOpening the 1937 season against<br />\nTowson State Teachers, the Blue Jay<br />\nBaseball team will start its third<br />\nintercollegiate<br />\nagainst<br />\ncampaign<br />\ncompetition, under the direction of Bob Owings. The ball club<br />\nwill wind up its schedule against St.<br />\nJohns at Annapolis.<br />\nIndoor practice will be held in the<br />\nGilman School cage. The schedule<br /><br />\ncame a group of serious athletes who,<br />\nfollowing the generalship of Coach<br />\nHambleton, have developed into a<br />\nsuperior water team. It cannot be<br />\ndenied that there is latent ability<br />\nprevalent among the undergraduate<br />\nbody. Perhaps all Hopkins athletic<br /><br />\nOf. Season This Afternoon<br /><br />\nWeather Permitting, Fundamentals To Be Taught To<br />\nNewcomers At Wall; Later Coaches Morrill And<br />\nMallonee To Scrimmage Charges<br />\nJohns Hopkins will open its hid for<br />\nnational supremacy this afternoon in<br />\nthe first official lacrosse practice of<br />\nthe 1937 season. Equipment was issued last Friday to all who were interested in the sport. The turnout this<br />\nyear was one of the largest in Blue<br />\nJay hickory history.<br />\nWeather permitting, men representing last spring's varsity, junior<br />\nvarsity, and freshmen arrays, bolstered by a strong group of prep<br />\nschool material, will venture forth<br />\nto the wall on the upper field to<br />\nstart the ball rolling on fundamentals.<br />\nAfter about two weeks of this elementary work and conditioning, upon<br />\nWhich the success of any team depends,<br />\nCoach Morrill and Mallonee will take<br />\ntheir charges through scrimmage<br />\npaces in an effort to weed out those<br />\nmen who will don helmet and gloves<br />\nagainst the Lavender of CCNY at<br />\nHomewood on April 3. Practice will<br />\nnot be held on Mondays, with actual<br /><br />\nTerrors Swamped In Both<br />\nMatches Held Last<br />\nSaturday<br /><br />\nWednesdays and Thursdays. Fridays<br />\nwill see the 'crossmen indulge in light<br />\nworkouts in preparation for the coming day's contest.<br />\nJack Not Welcome<br />\nShould Jack Frost continue to send<br />\nhis wintry blasts across the athletic<br />\nfield at Homewood, the stickmen will<br />\nbe forced to take care of their preliminary training in the gymnasium<br />\nin the evenings. This system was initiated last spring for the first time<br />\ndue to the late winter, and worked<br />\nout quite successfully.<br />\nAnother innovation at Hopkins will<br />\nbe the combining of the Freshman<br />\nand Junior Varsity aggregations to<br />\nform a nucleus for a training group<br />\nfor future varsities. This group will<br />\nplay various college Jayvees and prep<br />\nschool first teams under the tutelage<br />\nof Frank Dotterweich, former frosh<br />\nmentor.<br /><br />\nQuitt, Katz, Brown Secure Ed Lotz To Direct Matches Friday League Champion<br />\nAccording To IntercolFalls Over Opponents<br />\nNot Decided Due To<br />\nlegiate<br />\nRules<br />\nIn Short Time<br />\nPostponements<br />\n_<br />\nEntrees Number Fourteen To<br />\nEnders, Hopkins Win By Date; Dead-Line Set For<br />\nSonneborn And Castelle Star<br />\nNine Second Advantage<br />\nIn Victory Over<br />\nMarch 6<br />\nOver Opponents<br />\nAll Stars<br />\nAn Intramural Boxing Tourna-<br /><br />\nQuitt, Johns Hopkins, in the 139<br />\nlb. class won by a fall over Cronin in<br />\n3 minutes, and Brown, also of Hopkins, in the 169 class got a fall<br />\nover Flemin in 1 minute. Lunaso, of<br />\nWestern Maryland, in the heavyweight class got a fall over Pallach,<br />\nwho put up a game fight.<br /><br />\nThe Jay wallmen scored a shutout<br />\nReuben Baer accompanied the team<br />\nagainst Western Maryland Saturday<br />\nat Westminster. The Terrors were to Western Maryland. The match atswamped in all three single matches, tracted a large crowd which comand barely threatened in the doubles. pletely filled the galleries. Most of the<br />\nmatches were extremely interesting.<br />\nIry Milberg, first Hopkins singles<br />\nMembers of both teams showed plenty<br />\nman, defeated Rush 21-9, 21-8. In the<br />\nof fight.<br />\nsecond singles, Dick Pasternak took<br />\nThe summaries:<br />\n21-7, 21-10. Berton,<br />\nClark into camp<br />\nof Maryland, went down before Milt<br />\nAlperstein, 21-6, 21-3. The first doubles match saw the smooth combination of Milberg and Alperstein completely smother McKnight and McWilliams keeping their record of only<br />\none defeat in two years of varsity<br />\naction. Nat Finkelstein and Arnold<br />\nGlantz, opposing Rush and Volkvane,<br />\neasily won their first game, 15-3, and<br />\nplayed along in the second, 15-12.<br />\nThe match that was scheduled for<br />\nlast Friday against St. John's was<br />\npostponed because of illness of several of the Johnny players. The handbailers of the University of Pennsylvania. will meet the Black and Blue<br />\nSeam Saturday at the Homewood<br />\nGym.<br />\nThe final match of the handball<br />\ntournament, between Milton Alperstein and Phil Small, will be played<br />\noff this afternoon. The game was<br />\nnot played last week as planned due<br />\nto a conflict of the schedules of the<br />\nfinalists.<br /><br />\nscr:narnaging scheduled for Tuesdays,<br /><br />\nINTERCOLLEGIATE<br />\nBasketball—Johns Hopkins vs. Loyola College, Tuesday, at Homewood.<br />\nJohns Hopkins vs. St. Johns College, Saturday, at Annapolis.<br />\nFencing- Johns Hopkins vs. St. Johns<br />\nCollege, Wednesday, at Annapolis.<br />\nJohns Hopkins vs. V.M.I., Friday, at Homewood.<br />\nHandball Johns Hopkins vs. U. of<br />\nPennsylvania, Saturday at<br />\nHomewood. (pending)<br />\nWrestling—Johns Hopkins vs. U. of<br />\nMaryland, Wednesday, at Homewood.<br />\nJ.V. SPORTS<br />\nBasketball—Johns Hopkins vs. Loyola College, Tuesday, at Homewood.<br />\nJohns Hopkins vs. St. Johns, Saturday, at Homewood.<br />\nINTER-FRAT SPORTS<br />\nBasketball—Sigma Phi Ep vs. Phi<br />\nAlpha (4 P.M.)<br />\nOmicron Kappa vs. Tau Alpha<br />\n(5 P.M.)<br />\nDelta Phi vs. Alpha Ep (4 P.M.)<br />\nAlpha Delta vs. Beta Theta- Tuesday at Gym (5 P.M.)<br /><br />\nHopkins Jay Vee Intramural Boxing Engineers, Frosh<br />\nGrapplers Trounce Tournament To Be Miechs, Goldman<br />\nWestern Maryland Underway March 11 Teams Victorious<br /><br />\nThe Hopkins Jay Vee matmen deaggregations would undergo fine sea- feated the Western Maryland Jay<br />\nsons were all this hidden talent to pre- Vee grapplers 21-10 at Western<br />\nsent itself.<br />\nMaryland. There was an exhibition<br />\nmatch between Dodson of Hopkins<br />\nand Cronin of Western Maryland in<br />\nthe 139 pound class. No decision was<br />\ngiven.<br /><br />\nWallmen Trounce<br />\nWestern Maryland<br /><br />\nSports<br />\nCalendar<br /><br />\nVictoroff and Elliot, 119; Elliot<br />\nwon by a fall in 5:20.<br />\nHamilton and Brown, 129; Hamilton won by time advantage of 4:09.<br />\nQuitt and Cronin, 139; Quitt won by<br />\nfall in 3:00.<br />\nDodson and Fleagle, 139; No decision—exhibition.<br />\nKatz and Buchman, 149; Katz won<br />\nby fall in 3:30.<br />\nEnders and McKnight, 159; Enders<br />\nwon by time advantage of 9 seconds.<br />\nBrown and Flemirk, 169; Brown won<br />\nby fall in one minute.<br />\nPollack and Lunaso, heavyweight;<br />\nUunaso won by fall in 4:50.<br /><br />\nHopkins Temple<br />\nMatch Not Played<br /><br />\nThe arranged match between the<br />\nJohns Hopkins fencers and the Temple fencers was not played because of<br />\na misunderstanding between the managers of the two teams. Coach Paul<br />\nannounced by Manager Mal Boshnack Kaiss was sadly disappointed not<br />\nis as follows:<br />\nto have the match after having gone<br />\nApril 3--Towson State Teachers* to the trouble of traveling up there<br />\nApril 10--Mt. St. Mary*<br />\nwith 14 men.<br />\nApril 12---Loyola<br />\nZucker, the manager of the Hopkins<br />\nApril 16—Drexel<br />\nteam, claimed he made an agreement<br />\nApril 17- -Swarthmore<br />\nwith Temple to fence at 7 o'clock. The<br />\nApril 21—Western Maryland*<br />\nTemple manager claimed it was for<br />\n2 o'clock. The team arrived in PhilaApril 24—Washington<br />\nApril 28--Dickinson<br />\ndelphia about 5 o'clock when it was<br />\nApril 30—Haverford<br />\ntoo late to play. Nevertheless some of<br />\nthe boys stayed in Philadelphia overMay 4 —St. Johns*<br />\nMay 7 -Drew<br />\nnight, while the Coach and Captain<br />\nMay 8--Union<br />\nPeele took a train home.<br />\nMay 11- -Loyola*<br />\nA match is pending with St. Johns<br />\naway on March 3. There is one arMay 19--St. Johns<br />\n(All games will be played away ranged with Virginia Military Instiexcepting those marked*)<br />\ntute on March 5 at Homewood.<br /><br />\nment to begin March 11 has been arranged for all those interested in the<br />\nso called manly sport. Thus far approximately fourteen have entered<br />\ntheir names as competitors, while<br />\nquite a few more are expected to enroll before March 6, the dead-line<br />\ndate for entrees.<br />\nLotz Referee<br />\nAll matches are to be run according to the accepted Intercollegiate<br />\nBoxing rules. Each contest consists<br />\nof three two-minute rounds—the decision not to be a draw. It is up to<br />\nthe referee Ed Lotz--to award the<br />\nvictory to either one of the two contestants.<br />\nWinners Get Awards<br />\nThe winner in each division will be<br />\nthe recipient of a gold charm—the<br />\ncontribution of the Intramural Committee. The fact that none of last<br />\nyear's champions have yet been listed<br />\nas candidates for 1937 honors ought<br />\nto be an added incentive to this<br />\nyear's active leather-slingers.<br />\nCoach Ed Lotz has announced that<br />\nequipment is available for those wishing to indulge in practice sessions.<br />\nThose intending to partcipate are<br />\nto place their names in Box 671 before March 6.<br />\nThe entrees so far:<br />\n115 lb. class—H. M. Diver<br />\n125 lb. class- --A. H. Smith, Bob<br />\nVernon.<br />\n135 lb. class - E. Almquist, B.<br />\nRome<br />\n145 lb. class- R. A. Scott, L. Jacobson<br />\n155 lb. class—M. Tuerk, H. Brayshaw<br />\n165 lb. class — D. Greenberg, M.<br />\nKaufman<br />\n175 lb. class--C. E. Jones, G. H.<br />\nGillilan<br />\nHeavyweight—J. Kilbourne<br /><br />\nPhi Gams Clash<br />\nWith Kappa Sigs<br />\nOn Wednesday<br />\nThe final round of the nterfraternity basketball tournament<br />\ntakes place Wednesday night at<br />\n9:39 p.m.(when the Kapp Sigs meet<br />\nthe Phi Gams to vie for the championship and the basketball plaque.<br />\nThe game will be played immediately after the Hopkins-Maryland<br />\nwrestling match. The athletics department urges all fraternity support in the stands.<br />\nLast season the Phi Gams also<br />\nearned the right to enter the plaoffs. The Kappa Sigs are a surprise outfit and were hardly expected to come through.<br /><br />\nIn class basketball played Wednesday and Thursday, Goldman A. C.,<br />\nFrosh Engineers A, Senior Mechanics,<br />\nand Freshmen A. B. scored victories.<br />\nThe Goldman courtmen topped the<br />\nSilver/Tops 27-15 to win the title of<br />\nthe Wednesday league.<br />\nWhile the Frosh Engineers were<br />\nconquering the Newcomers in the<br />\nThursday league, the Freshman A. B.<br />\nII won a forfeit victory over the<br />\nWhirlwinds to capture honors in that<br />\ndivision. Due to several games that<br />\nwere postponed, the winner of the<br />\nFriday league is not yet decided. The<br />\nGoldman A. C. and the A. B. II team<br />\nwill meet in one play-off game sometime this week. The victor will meet<br />\nthe winner of the Friday league for<br />\nthe second half interclass title.<br />\nLed by Sonneborn and Castelle the<br />\nGoldman five easily conquered the<br />\nformer New Jersey All Stars, 27-15.<br />\nFrosh Engineers Win<br />\nAfter losing to the A. B. II five, the<br />\nfreshman engineers came back to bop<br />\nthe Newcomers 29-17. The Newcomers got away to an early lead, but the<br />\nengineers rallied to go ahead. Agnew<br />\nand Della scored fifteen of the losers<br />\n17 points. Enders and Snodgrass were<br />\nthe big guns for the winners, each<br />\nbagging five goals. Diskin, Holman,<br />\nand Diggs accounted for the remaining points.<br />\nWith Dickler accounting for 12<br />\npoints and aided by Wiseman and<br />\nGambrill,<br /><br />\nthe<br /><br />\nSenior<br /><br />\nMechanics<br /><br />\ndowned the A. B. I courtmen 21-14.<br /><br />\nFor Interfrat<br />\nBasketball Title<br />\nPhi Gams And Kappa Sigs<br />\nWin Division<br />\nCrowns<br />\nO.K.O. FIVE SURPASSED<br /><br />\nFl<br />\nPi Lams Top D.U.'s To Take<br />\nRunner - Up Position In<br />\nDivision A<br />\nExcept for a few games in Division<br />\n13 scheduled for this afternoon at<br />\n4 o'clock, the fraternity basketball<br />\nseason was brought to a close last<br />\nSaturday. Phi Gamma Delta turned<br />\nback a threatening 0. K. 0. five to<br />\nqualify to play Kappa Sigma, Division A winner, in the title play-off.<br />\nIn another contest Pi Lambda Phi<br />\ntopped Delta Upsilon to capture runner-up position behind Kappa Sigma<br />\nin Division A.<br />\nNaylor Stars<br />\nPushing aside the last obstacle in<br />\ntheir quest for the division crown, Phi<br />\nGam easily conquered 0. K. 0. by a<br />\n30-15 score. Naylor, Ghingher, and<br />\nRoyster rang up goals, and Thaler<br />\none for the conquered five to make<br />\nthe score 6-2 a few minutes after play<br />\nstarted. The rest of the first half,<br />\n0. K. 0. was held scoreless while the<br />\nPhi': Gams added nine more points.<br />\nHolding a 15-2 edge at the half, the<br />\nwinners were content to coast to<br />\ntheir victory. As a result Phi Gam<br />\nbarely out scored their opponents<br />\n15-13 in the closing half. Throughout<br />\nthe entire contest, Naylor played a<br />\ngood defensive and offensive game.<br />\nThis win enabled Ghingher, Naylor<br />\nand company to finish the season undefeated.<br />\nLow Scoring<br />\nAlthough both Pi Lambda and Delta<br />\nUpsilon have been eliminated from<br />\nthe pennant race, these teams staged<br />\nan important battle for second place<br />\nin Division A. Low scoring featured<br />\nthe game, but Pi Lam finally won<br />\n11-10.<br />\nNeither team played their usually<br />\nisteady game, but throughout the<br />\ngame the contest was exciting. At<br />\nno time did either team hold more<br />\nthan a two point margin over the<br />\nother. D. U. led at the half by a 7-6<br />\nscore, but Pi Lam came from behind<br />\nto cop the game in the last fifteen<br />\nminutes of play. Stevens and Bert<br />\nMargolis were high scorers with five<br />\npoints credited to each.<br />\nThe final games are scheduled for<br />\nto-day at 4 o'clock. Sigma Phi Epsilon will meet Phi Alpha, Omicron<br />\nKappa Omicron will meet Tau Alpha<br />\nPhi, Delta Phi will battle Alpha Epsilon Pi, and Alpha Delta Phi will<br />\ntangle with Beta Theta Pi.<br /><br />\nWestern hid.<br />\nDefeats Jay<br />\nSharpshooters<br />\nRossberg, Hopkins, And<br />\nArmacost, W. M., Have<br />\nPerfect Prone Scores<br /><br />\nThe game was marred by frequent<br />\nThe Hopkins sharpshooters were<br />\nfouling, and a total of 17 personals defeated for the second time in two<br />\nwas called by the referee. The Mech- weeks by Western Maryland College<br />\nanics committed eleven and the Pre- yesterday at the Homewood range.<br />\nThe score for the second encounter<br />\nmeds six.<br />\nwas 1,317 to 1,291, with Armacost, of<br />\nWestern Maryland, and Rossberg, of<br />\nJohns Hopkins, each shooting a perfect score in the prone position.<br />\nIn the engagement, held at Westminster last week, the Terrors won<br />\nby a slim margin with good marksWednesday League<br />\nLost manship shown by both teams.<br />\nWon<br />\nThe summary of yesterday's meet:<br />\nGoldman A. C.<br />\n3<br />\n._..0<br />\nWESTERN MARYLAND<br />\n1<br />\nSenior Mechanics<br />\n2<br />\nMyers<br />\n97 93 82-272<br />\n2<br />\n1<br />\nFreshman A. B. I<br />\nArmacost<br />\n100 91 81--272<br />\nParker<br />\n3<br />\n97 84 87-268<br />\nSilver Tops<br />\n0<br />\n94 86 87-267<br />\nLost Hoffa<br />\nWon<br />\nThursday League<br />\nRausch<br />\n98 85 55-238<br />\n0<br />\nFreshman A. B. II<br />\n3<br />\n1<br />\nFrosh Engineers A.... 2<br />\nTotal<br />\n1,317<br />\n2<br />\n1<br />\nWhirlwinds<br />\nJOHNS HOPKINS<br />\n0<br />\n3<br />\nLindenmayer<br />\nNewcomers<br />\n99 89 87--275<br />\n98 89 80- -267<br />\nWon<br />\nFriday League<br />\nLost Guild<br />\nRossberg<br />\n100 82 77-259<br />\n1<br />\n0<br />\nSoph Engineers<br />\nHesser<br />\n94 87 70-251<br />\n1<br />\nCardiacs<br />\n0<br />\nStagmaier<br />\n98 88 53-239<br />\n1<br />\nJunior Engineers<br />\n0<br />\n1,291<br />\nTotal<br />\n1<br />\nFrosh Engineers B<br />\n0<br /><br />\nInterclass<br />\nStandings<br /><br />\nvi<br /><br />\nCl<br /><br />\nthe<br />\ncer<br /><br />\nbef<br />\nYo<br />\nto<br />\nsen<br /><br />\nHo1<br /><br />\n'1<br />\nthe<br />\nun<br />\ngro<br /><br />\nJoh<br />\norg<br />\nW.<br /><br />\nJan<br /><br />\nRot<br /><br />\nof t<br />\nsea<br />\nsen<br />\nHa<br /><br />\ncert<br />\nwh<br /><br />\nmos<br /><br />\nfine<br /><br />\nmen<br /><br />\nwee]<br />\nthe<br /><br />\n01<br />\nthis<br /><br />\nSchc<br /><br />\nRobl<br /><br />\nSem<br />\nChu]<br /><br />\nAl<br />\ncludi<br />\nTrot.<br />\nJay<br />\nthe<br />\nCity<br /><br />\nTI<br />\nOsm<br />\nClub<br />\nby<br />\nilton<br /><br />\n3.\"<br /><br />\nTI<br />\nanno<br />\nfor<br />\nand<br />\nthroi<br /><br />\nBo<br />\nslty<br />\nnear<br />\nLibri<br />\ndate<br /><br />\nEs.<br /><br />\n'Sti<br />\ners a<br />\nannu<br />\nthe<br />\nAsso<br />\n\"Ho'<br />\nhigh<br />\nProt(<br />\nthe<br /><br />\nTh<br />\n$400<br />\nlowei<br />\n18 no<br />\nIru<br />\nt aine<br />\n17<br /><br />\nTh.<br />\nGrad<br />\nin Li<br />\n12th.<br />\nclonal<br />\nrtusi(<br />\nra<br /><br />"}], "field_media_file": [{"target_id": 39084, "display": null, "description": null, "target_type": "file", "target_uuid": "adb2f286-bd10-4f29-86af-e51af3431f02", "url": "http://digital.library.jhu.edu/system/files/2022-03/12762-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12762, "target_type": "node", "target_uuid": "07861339-0ada-40ea-abaa-66d332ef7261", "url": "/node/12762"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e41bb5f2-7042-49fd-a9ef-ad656b4fa3b8"}]}