{"mid": [{"value": 38257}], "uuid": [{"value": "100fe00c-cbaa-462d-b0d6-d07e4dca493c"}], "vid": [{"value": 38257}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:51:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12824-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:51:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:51:36+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "1<br />\n<br />\n'.,00111-tg iOrtpitins Nrtufetekttrr<br />\n<br />\nTry Out<br />\nHonor System<br />\n<br />\nSee Jays<br />\nBeat Teachers<br />\nTonight<br />\n<br />\nZ 275<br />\nVOL XLIII, No. 19<br />\n<br />\n_ems.<br />\nPRICE 5 CELN7111<br />\n<br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1938<br />\n<br />\nFIVE-FOUR COUNT ON Y. C. L. ASSEMBLY<br />\nBLUE JAY HOOPSTERS HONOR COMMISSION<br />\nCOTILLION BOARD<br />\ng<br />\nMINORITY SUBMITENCOR<br />\nMAJORITY,<br />\nASSIGNS<br />\nSTATE<br />\nFOUR-MAN<br />\num<br />\nWILL BRING CASA<br />\nTEACHERS TONIGHT CONSTITUTION BODY REPORTS; Rims, GRAHAM,<br />\nLOMA ON MARCH 1<br />\nTHE KEMPTONS FILE DISSENT<br />\nJanuary Blue Jay<br />\nDistributed Friday<br />\n<br />\nSecond Cotillion Will Feature<br />\nGlen Gray's Orchestra<br />\nAt Alcazar<br />\nCOST OF TICKETS<br />\nNOT YET DECIDED<br />\nOrchestra Comes From Extended Popular Engagement At New Yorker<br />\nBy vIcroR NTICTOROFF<br />\n<br />\nThe January issue of the Blue<br />\nJay, monthly magazine published.<br />\nby the undergraduates of the Hopkins will be delivered on Friday<br />\nto subscribers. The issue is called<br />\nthe\"Pre-Exam Number\" and plans<br />\nits cover to express that motif.<br />\nIn its experimental stage the<br />\nJay's editors have innovated several<br />\nnew features this issue, and eliminated others whose popularity<br />\nwas not up to par.<br />\nAnnouncements by the Jay's editors concerning interviews to business staff candidates will be made<br />\nas soon as the possibility of a scale<br />\nof commissions is examined.<br />\n<br />\nTowson State Teachers<br />\nSeek Revenge For<br />\nPrevious Defeat<br />\n<br />\nJ. Judge Mehling, Arthur<br />\nMaas, Frank' Butt, And<br />\nJohn Crunkleton Chosen<br />\n<br />\nOdds Favor Hopkins<br />\nTho' Teachers Show<br />\nImprovement<br />\n<br />\nResolutions Decided Upon<br />\nAt Meeting Tonight<br />\nWill Effect Exams<br />\n<br />\nOFFICIAL DECISION LARGELY BASED ON<br />\n'SECRECY' OF COMMUNIST MEMBERSHIP<br />\n<br />\nCommencing work in their conMinority Charges \"Discrimination\"; Council Stand<br />\ntemplated sphere of activity, the<br />\nIndicts Political Character Of Organization<br />\nArts and Science Student Honor<br />\nHopkins<br />\nTowson<br />\nCommission appointed a constituMelvin<br />\nAusterlitS<br />\nF<br />\nTEXT OF MAJORITY AND MINORITY REPORTS ON THE<br />\ntion committee of four men to formWheeler<br />\nTraggis<br />\n•<br />\nYOUNG COMMUNIST LEAGUE ON PAGE 2<br />\nulaie a_ governing body under which<br />\nOn March 5, the Cotillion Board<br />\nMoore<br />\nCox<br />\nC<br />\nThe Student Council split five-to-four on the question of granting<br />\nit<br />\ncould operate, at its second meetwill offer to devotees of stamp and<br />\nBasin (c)<br />\nStottlemeyer<br />\nG<br />\ning last Friday at four p.m. A def- the Young Communist League an assembly,<br />\ntromp the Second Cotillion featuring<br />\nit was learned late Monday. The<br />\nCurland<br />\nMcLain<br />\nG<br />\ninite plan, as regards the Honor exact vote by<br />\nGlen Gray -and his Casa Loma Orwhich the Y. C. L.'s request was rejected became public<br />\nRevenge is sweet! This thought wil Commission's relations with the<br />\nchestra. lhe dance will be held at<br />\nwith<br />\nthe<br />\nissuance of an official majority report and a dissenting opinion<br />\nthe Alcazar with the first notes<br />\nspur on the Towson State Teachers Honor System was also decided upon.<br />\n*signed ,by four of the nine members<br />\nsounded at ten p. m. and curfew at Former Ambassador To Ger- quintet against the Blue. Jays when On the four-man constitution comof the Council.<br />\nmittee was appointed one representthree.<br />\nthey meet on the Teachers' court tomany<br />\nAttack<br />\nWill<br />\nThe<br />\native from each class. Serving on the<br />\nThe date of the dance and other inWilliam Erlanger, '38; Carl Basnight<br />\n,at<br />\nThe<br />\n8:30.<br />\ntall<br />\nBlack<br />\nand<br />\nNazi Regime<br />\ncommittee are J. Judge Mehling, '38,<br />\nformation concerning the choice of<br />\nA reasonable and intelligent analy- in, '38; Vernon Ivins, '38; Edward<br />\nBlue five trounced Towson in the for- Arthur Maass, '39, Frank Butt, '40,<br />\ntile Casa Loma swingsters was ansis of the Y. C. L. assembly probClautice, '38, and Frank Baker, '40,<br />\nnounced by J. Judge Mehling, '33, in<br />\n\"Truth In History\" Will Be mer's opening game 37-30, at Hop- and John Crunkleton, '40. A rough lem brings us to the conclusions that:<br />\nbehalf of the Cotillion Board, over<br />\ncomposed the majority. William B.<br />\nkins. But since this game will take draft of the constitution planned by<br />\n1. The decision itself is \"prejudicial<br />\nSubject<br />\nAt<br />\nCasualty<br />\nthe week-end. Mehling admitted that<br />\nthe committee is to be presented at to the honor of<br />\nthe University\" and Kempton,'38, president‘of the Counplace on their<br />\n. home floor,,the Teachthe choice of orchestra was made<br />\nAudiorium<br />\n• ers are confident of reversing the la/it the Commission's meeting today.<br />\nhence the Student Council has acted -ell, Harlan Graham, '38, Harold<br />\nafter \"great deliberation and discrim• Discussion And Decisions<br />\nagainst the best interests of the Hop- Ricards, '39, and J. Murray Kemp.<br />\nination by the Board.\" He established,<br />\nTomorrow night William E. Dodd score.<br />\nHaving appointed its constitution kilts and against a principle which ton, '39, filed a dissent.<br />\nfurther, the hope that Hopkins dance will speak at the Maryland Casualty<br />\nit<br />\nwas elected to uphold.<br />\nAccording to experienced observ- committee the Commission opened a<br />\nfans would approve of the selection auditorium on \"Truth in History.\"<br />\nMajority Cites Secrecy<br />\n2. The Student Council action in<br />\ners, the Towson lads stand a good discussion of various points to be<br />\nby their presence on the floor March<br />\nLast month Mr. Dodd resigned as<br />\nThe majority opinion, designed to<br />\nemphasized<br />\nby<br />\nthe<br />\nreleasing<br />\nconstitution.<br />\nthe<br />\ndecision<br />\nas it did was<br />\n1. \"Every ticket sold is a vote of ap- Ambassador to Germany stating chance to taste sweet revenge, as the<br />\nanswer charges brought last week by<br />\nBearing in mind its original inten- cowardly and unfair.<br />\nproval for our pick, and a pass to a lack of confidence. Friction between Blue Jays have been playing good<br />\ntion of not becoming \"policemen,\"' In its shaky, evasive letter on page Walter Schlesinger, spokesman for<br />\nglorious evening of swing-time!\"<br />\nMr. Dodd and the Nazi regime had ball spasmodically. Towson has al- the<br />\nCommission proposed several two, the Student Council offers argu- the Young Communist League, cited<br />\nCame From Hotel New Yorker<br />\ndeveloped to the point of mutual ready chalked<br />\nup seven victories, means of securing student coopera- ments Which leave one with a dis- both<br />\nthe secrecy of the organization's<br />\nCasa Loma, hot from an extended protests before last summer. Early<br />\ntion in its drive to strengthen the gusted expression of \"Why in the<br />\nwhich<br />\nincluded<br />\nlast<br />\nweek's<br />\nshellackengagement at the Hotel New in the fall he tendered his withmembership and its political nature<br />\nposition of the Honor System.<br />\nworld<br />\ndon't<br />\nthey<br />\ncome<br />\nright<br />\nout<br />\nand<br />\ning<br />\no4<br />\nGallaudet,<br />\nwhom the Jays just<br />\nYorker, comes featuring \"the fast- drawal; he was relieved last month.<br />\nas grounds for rejecting the request,<br />\nA plan was suggested and passed say that they are denying the Y. C.<br />\nest brass section in the business,\"<br />\nIn his talk tomorrow night at 8:15 barely nbsed out. The Towson team<br />\nfor an assembly.<br />\nsay wiseacres. They cast haloes he is expected to excoriate the total- has been improving right along and apon whereby this end could be ac- L. the right of an,aaak*Sbky because<br />\ncomplished. However, due to the fact any speaker offered byt this organi- \"Thip is,\" said the report, \"no<br />\nat Sonny Dunham, a cornetist \"in itarian state as he has in previous<br />\nnow look at Hopkins as her real State that not until today's<br />\nmeeting will zation will be a Communist?\"<br />\nUse manner of the late, great Bix rspeeches.<br />\ndeviation from principle in refusing<br />\nrival; pointing particularly towards final details be arranged, the ComHowever, to be polite and convenlieiderbecke,\" Grady Watts, trump- I<br />\nHis charges against Hitleir are<br />\nto extend the courtesy and attending<br />\nmision has been unable to release tional we will show that even if these<br />\ntonight's contest.<br />\neter par excellewe, Peewee Hunt, dic- mainly these:<br />\ninformation as to its complete opinions are taken at face value, ex- responsibilty of the assernoly plattator of trombone tempo today, and<br />\n1—intolerance is suffocating GerZone Defense Difficult For Jays<br />\namination Will show their sieve-Ike forni to Mr. Slesinger, who alone<br />\nscheme.<br />\nHal White, polisher of the piano keys. man genius.<br />\nIn the last encounter, the Jays had<br />\nconstituted the admitted membership<br />\nThe Commission has also definitely qualities.<br />\nThese are all soloists in their own<br />\n2—political opponents are being<br />\nserious difficulty in piercing the Tow- decided that<br />\nJust who is to determine what in a<br />\nfirst steps of any sort<br />\nright, and have done no little to put Inhumanly slaughtered.<br />\nof the Young Communist League.\"<br />\nson zone defense. Hopkins displayed of movement will go into effect this legitimate organization? Is it not a<br />\nCasa Loma at the top of the heap of<br />\nHis brief against the totalitarian<br />\nThe majority also announced a<br />\n\"individuality,\" while the Teachers Coming exiinination period. Upon source of pride ,that Hopkins activirecord-breaking puller-inners. The ad- state includes<br />\nan interpretation of<br />\ndefinitely accepting any proposals, ties are run by the students who com- policy \"of maintaining. an educadition of the names, Pat Davis, tender history. Having<br />\nbeen professor of had the better team play. Austerlitz,<br />\nall facts are, to be made known to pose their own rules of election and tinnal, -non-political program in stutenor, and Pete Hutchinrider, clarin- hititory<br />\nat the University of Chicago Stottlemeyer, and Curland slipped by<br />\nrunning? And is not the secret ballot, dent assemblies. If the<br />\nthe Student Body.<br />\netist clarissime, give us a complete from 1908<br />\nCouncil were<br />\nuntil his appointment as the Hopkins defense fairly consistentthe right of silent opinion sacred to<br />\nroster of attendance on the Board of Ambassador<br />\npetitioned by the Young Democrats<br />\nin 1933, and president ly to keep the Teachers always in the<br />\nour<br />\ndemocratic<br />\nprinciples?<br />\nFun Directors.<br />\nof the' American Historical AssociaIt ,would be forced to refuse on<br />\n.The Communist Party is a perfectgame. Towson led at the half.<br />\nGrey Is President<br />\ntion in 1934, he is singularly qualily legal political organization which the same grounds,\"<br />\nGlen Gray himself, elected in Feb- fied to present<br />\nthe case.<br />\nNorm Melvin led the Hopkins atoffers candidates for election. Just<br />\n\"Discrimination,\" Says Minority<br />\nruary, 1937, as president of the Casa<br />\nAdmission to the lecture will be tack in the<br />\nIll with a fever which he appar- as we believe that the Young Demoprevious contest, while<br />\nLoma Orchestra wields a baton that free under the James<br />\nIn its dissent the minority exSchouler<br />\nently contracted in Australia, Dr. cratic Club has the right to demand<br />\nMcLain<br />\nshowed<br />\nbrilliant<br />\nfloorwork.<br />\nhas carried the corporation higher Foundation for -history lectureships,<br />\npressed the opinion that the decision<br />\nIndividually, the Black and Blue George E. Barnett, professor of polit- assembly, so has the Young Commuand higher on the wavy crest of their Mr. Dodd having<br />\nbeen obtained<br />\ndiscriminated against a group of inwere the better basketball players, ical ecci&my, away since November, nist League.<br />\nlightaome rhythm since its in- through the /cooperation<br />\nof the poWe can well understand, with con- dividuals, \"whom we think should<br />\nbut.it is feared that the Teachers Is sailing to Baltimore, where he is<br />\nception, 1929. Aniong records held litical<br />\nscience department. Dr. Isaiah<br />\nhave Aproved rapidly with their busy going ,to undergo treatmept at the ditions as they are on this- campus have been accorded the same priviin their trophy case are: occas- Bowman will<br />\nintroduce the speaker.<br />\nschedule. If the Jays are \"on,\" there Johns Hopkins Hospital. The'specific and elsewhere, why the members of leges as were granted<br />\nional listings at the exclusive The Maryland<br />\nto other<br />\nCasualty Auditorium<br />\nwill be no difficulty, but that is a nature of his illness was not revealed. this organization keep their affiliaRainbow Grill, designated the honor is at 40th/Street<br />\ngroups of individuals gathered in orand Keswick Road.<br />\nby the account in the .Sunday Sun. tion secret.<br />\nquestion yet to be settled.<br />\nof opening the Congress Casino in<br />\nganizations like Omicron Delta KapSunday/ Mr. Dodd spoke at the<br />\nProfessor Barnett was planning to<br />\nBut why the sudden interest in<br />\nChicago, netted biggest gate at Cali Madison ,Avenue Temple, taking<br />\npa, Tau Beta Pi, the American Stu\"Is<br />\nSo, tho' the odds favor the Blue devote his sabbatical year to''-a study membership? Did the<br />\nStudent. Counfornia's Palomar Ballroom, twice There Any Chance for Christianity?\"<br />\ndent Union ,and similar campus<br />\nJays, tonight's contest will be, as ob- of labor legislation in Australia and cil ever bother<br />\nbefore to investigate<br />\nholders of New York Paramount The- for his<br />\ngroups.\"<br />\nsubject. Earlier Wednesday servers claim, a bitterly fought bat- New Zeaja_nd itek wa-!__ not<br />\n15,2.—AVe cannot consider this point<br />\natre's rating as most popular.orches- he is scheduled--to'appear4eiore the<br />\ntle up to the final Whistle.<br />\nback for several months.<br />\nThe minorityport expressed -a<br />\n,as<br />\nanything_but.<br />\nanother straw man<br />\ntra to--come to that Broadway graduate seminar of the departments<br />\nfurther conviction that \"the relative<br />\nsubstituted for. the real issue<br />\nway movie palace, and swinging the of poltical science<br />\nand history.'<br />\nIf the Council objected to'a politi- merits or defeta of an organization<br />\nmassed clientele at the Terrace Room<br />\nSpeaking at ,a testimonial dinner<br />\ncal discussion—an'objection we con- or its platform should not determine<br />\nof the Hotel New Yorker for an \"in- at the Waldorf Astoria Hotel in New<br />\nsider<br />\nunenlightened—why was this whether an Assembly should be<br />\ndefinite run.\"<br />\nYork on December 7, he first begin<br />\nfact. not communicated to the Y. C. granted.\" The way was also left<br />\nHis appearance at the Alcazar his bitter denudation<br />\nof the Nazis.<br />\nopen for an addreiis by any speaker,<br />\nL. instead of the fiat rejection?<br />\nMarch 1 will be his first in. Baltimore He declared them a retrogression in<br />\nwho \"sees fit to criticize . . the<br />\n(Continued on Page 3, Col. 1)<br />\nWe have been able to uncover grey a man's hair immeasurably.<br />\nthis year. After the engagement here, history, and said that they are<br />\na<br />\nY.C.L.\"<br />\nsome rather epoch-making explanaImagine Benson's disconcernment<br />\nhe will go to Florida to play at one pernicious threat to civilization.<br />\ntions<br />\nof<br />\nwhy a trainer's %Lair turns and chagrin when he found his bed<br />\nof<br />\nthe<br />\nhotels. Following<br />\nbig<br />\nThe Y.C.L. issue came to a head<br />\n\"Now he is more absolute than<br />\nthis, the orchestra will include a tour any medieval emperor of Germany,\" grey. Noticing a peculiar ashen sheets went only half Way down the<br />\nlast week when the organization, in<br />\nof the West Coast for the summer Mr. Dodd described Hitler. \"Under glint in Mr. James , Benson's upon bed and stopped. Some sneak had<br />\nan open letter published in the Janmonths.<br />\nuary 21st issue of the \"News-Letter,\"<br />\nhim almost as many personal oppo- his return from the West Point \"pied\" the thing. It is a little farFirst Lieutenant Frank Forney of demanded that the Student Council<br />\nnents were killed in five years as trip, our curiosity was Lnflamed and fetcheci to think that he'might have<br />\nwe<br />\nnow<br />\nproudly<br />\ndisclose<br />\nfindings.<br />\nour<br />\ntaken- on some tattle tale grey in the United States Army \"Engineer show \"justification for denying . . .<br />\n,'harles ll executed in twenty.\"<br />\nMr. -Benson began by acquiring a his hair while investigating the why Corps will come to the HOpkina in a legitimate campus organization the<br />\nlight grey before the train had ever of the situation, but we must Con- the last part of February. Be right to sponsor an assembly\" The<br />\nleft the station. It wasn't age that sider every possibility.<br />\nwill take the place of Captain group also charged \"dilatory\" handThe Junior Prom is fading further<br />\n\"snowed white hairs,\" it was a marProceeding to the final episode, it Parker M. Reeve, who is now sta- ling of its \"simple request,\" which,<br />\nand further into the hazy fiaure<br />\nriage celebration and a hail of badly happened in the dining room. Benson tioned at the U. S. Engineers' Office it claimed, was made more than a<br />\nLatest developments call for a small<br />\nDr. Tracy Sonneborn's discovery aimed rice. A few absent - minded was admiring the crystal clearness at Duluth, Minnesota, in the. dis- month and a half agd.<br />\ndance either in April or June. There , of sex in paramecium has been listed missteps and he was in it. Oh how of a piece of ice in his glass. bursing officer's department. Captain<br />\nwill he no Prom in February, accord, ,1 as one of the outstanding scientific the storm did beat.<br />\nTitters were running around like Reeves had been here since 1934.<br />\nNYA REPORTS ARE DUE<br />\ning to William Erlanger, chairman achievements of 1937, it was anAnd Mystery!—At the hotel at wildfire in a windstorm. Then BenLieutenant Forney graduated from<br />\nof the Student Council.<br />\nnounced in a recent issue of Science, West Point, Benson was called by a son discovered the ice was a glass !he United States Military Academy<br />\nMiss Judge has announced that<br />\nConflict with the second Cotillion official publication of the American sad-- vdida-d- jiff% - Mason, who wanted -iube. The psychological effect on in .1929. After graduation he was<br />\nall N.Y.A. time reports should be<br />\nhas definitely reversed the original Association for the Advancement of him to help revive a badly bruised those golden locks must have been stationed in Panama with the 11th<br />\nhanded in this week. For graduplan of a dance in February.<br />\nColgate boxer in room 210 (we are 'rivastating. Suppose, while he was Engineers. He is at present in the<br />\nScience.<br />\n,ate students, the date' is ThursIf the Inter-Fraternity Board or<br />\nDr. Sonneborn, now Associate in a demon after facts). An inquiry at<br />\ndisbursing officer's department in<br />\ndraining<br />\nthe<br />\ndrop,<br />\nhad'<br />\nlast<br />\ncube<br />\nthe<br />\nJanuary 27; for undergradu(lay,<br />\nthe Senior Class can be persuaded to , Zoology, received his PhD. degree at the desk a few moments later and<br />\nDuluth, where Captain Reeve is staates, Friday, January 28. Reports<br />\nmove their affairs ahead there may ' the Hopkins in 1928, and worked Benson found to his horror that both slid down the. side of the glass and tioned. His appointment has placed<br />\nmust be in the Bureau of Apbe room for the Prom in the<br />\nhere for two years as a National Ir. Mason and his team was a phan- batted him in the nose. The very two Engineer officers in the ROTC<br />\npointments dffice before 5 p.m.<br />\nweek of school.<br />\n•<br />\nResearch Fellow.<br />\ntom. It is mysteries like these that thought of the thing is appalling.<br />\noffice instead of the customary one.<br />\nBy MILT ALPERSTEIN<br />\n<br />\nWILLAIM E. DODD<br />\nTO SPEAK TOMORROW<br />\n<br />\nEDITORIAL<br />\n<br />\na<br />\n<br />\na<br />\n<br />\nBarnett, Ill, On Way<br />\nHere From Australia<br />\n<br />\nWest Point I/ isit Is Hair-Greying<br />\nTrip For Trainer Jimmy Benson<br />\n<br />\nFRANK FORNEY WILL FILL<br />\nVACANCY IN ROTC STAFF<br />\n<br />\nAPRIL JUNE TENTATIVE<br />\nBATES FOR JUNIOR PROM Dr.Sonneborn Called<br />\n<br />\nOutstanding Scientist<br />\n<br />\n\fHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1938<br />\n<br />\nT1its1)115 ji)opktug<br />\niletus<br />\n•<br />\n<br />\nletter<br />\nFounded 1897<br />\n<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\nIn the Philadelphia Record<br />\non Sathrday appeared an<br />\naccount of the costly bravery of the Abraham Lincoln<br />\nBattalion at Teruel, its attempts to save Loyalist<br />\ntroops trapped in fortifications. Their losses were terrific, and even General<br />\nFranco payed tribute to their courage, saying they<br />\nwere the best troops his enemies had.<br />\nThe heroism of these men in the front lines of the<br />\nanti-Fascist forces should not be considered stupid and<br />\nself-sacrificing. On the other hand, it should show ,us<br />\nmore clearly in, what peril a'free government eleeted<br />\nby the people has been placed, when their mainstays<br />\nare \"advanced\" or \"proletarian\" democrats from other<br />\nrepublics. Especially when the ideas of these men when<br />\ntranslated into practice would mean dictatorship. It's<br />\na riddle, but democracy in Spain does not mean clergy,<br />\nand Moors backed by Nazi.'end Fascist auxiliaries.<br />\n<br />\nHeroes<br />\nAt<br />\nTeurel<br />\n<br />\n•<br />\n-. $2.00<br />\n... $2.50<br />\n<br />\nRemit subscription fees to Treasurer. Student Activities Council,<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as sec.d class matter December 3, 1909,<br />\n<br />\nat the postoffice<br />\nin Baltimore Md., under the Act of Congress, Novernber 3, 1879. •<br />\n<br />\nLETTERS TO 1 Communist<br />\nT-HE EDITOR<br />\n<br />\nLeague Is Answered<br />\n<br />\nMajority And Minority Report On Banning Young<br />\nThe Student Council turned the folCommunist League Assembly Speakers<br />\nlowing over to the NEWS LETTER<br />\nfor publication. Editorial comment To the readers of the NEWS-LETTER: campus in regard to the action of<br />\nin Column Two.<br />\nIn a letter written to the Student the Student Council in refusing an<br />\nDear Sir:—<br />\nCouncil, which appeared in the Janu- assembly to the Young Communist<br />\nA small group of . newcomers to ary 21st issue of this paper, Mr. Sles- League;-the Darnell issued a report<br />\nHopkins have been watching with inger, alleged leader of the Johns to the campus in defense of their<br />\ninterest, the attempts of the Council Hopkins Chapter of the Young Com- action. However, this was merely<br />\nto cope with ,the Honor System situ- munist League, asked for a statement the report of the majority in that<br />\n<br />\nation at our School. Due to the spirit explaining the rejection of his ap- vote taken, which by majority rule<br />\nwhich prevails in regard to freshmen, plication for an assembly.<br />\nwas the instrument of the defeat for<br />\nwe felt that any suggestions we could<br />\nMr. Slesinger said that the Student Y.C.L. proposed assembly. Snide the<br />\n•<br />\nEDITORIAL STAFF<br />\noffer would be welcome. Therefore Council owed such an explanation to action<br />\non the part of the Council<br />\nStanley Finkel<br />\nEditor-in•Chid<br />\nWe would Ike ..to present our plan, the League and to every member of was by no means<br />\nJ. Murray Kempton, Wethered Barroll, Jr.<br />\nManaging Editors<br />\n\"Lack of confidence\" is a<br />\nunanimous , the<br />\nBenjamin Root .<br />\nAssociate Editor<br />\nthe<br />\nstudent<br />\n'body,<br />\nhappens,<br />\nAs<br />\nit<br />\ndiplomatic sublety that designed to return the Honor System<br />\nminority of four of this body wishes<br />\nSeymour Sacks<br />\nFeatlife Editor<br />\nhowever,<br />\nCouncil<br />\nStudent<br />\nhas<br />\nbeen<br />\nmeans more than mere in- to the status, we are told, it once<br />\nJ. C. Handelsman, Victor M. Vietoroff<br />\nAssistant Managing Editors<br />\nunable to determine who are the to issue, this statement representaHarold Zheutlin<br />\nSports Editor<br />\ndifference. It contains a had.<br />\nMembers of this League to whom it tive of the feelings ef this minority.<br />\nArnold Giant; Nathaniel 'Finkelstein<br />\nActing Sports Editors<br />\nbarb.<br />\nWhen William Dodd<br />\nCharles Diggs, Milton Alperstein<br />\nAssistant Sports Editors<br />\nYour latest plan calls for the ob- owes an explanation, and hence it<br />\nWe feel that in voting for the<br />\nresigned his ambassadorship<br />\nMal Boshnack,<br />\n_Eschangs• Editor<br />\nfinds<br />\nitself under these circumstances Y.C.L.<br />\ntaining<br />\nof<br />\nthat result through the<br />\nassembly we were acting perto Germany on these<br />\nREPORTERS<br />\nincapable<br />\nrendering<br />\nsuch<br />\nan<br />\nacMel Taymor, '40; Morris N.l'essel, '39; Leoliard Quitt, '40;<br />\ngrounds, lack of confidence represented a very deep activities of a special commission<br />\nsonally and collectively in the best<br />\nDaniel Stone, '39; Zeana Baum, '38; Call Resin, '38;<br />\ncount. To you of the undergraduate<br />\nseated<br />\nrepugnance for the Nazi regime. He had been whose' duty it will be to induce the<br />\nLester Rosenthal, '38; Leonard Rubinger, '38; Thom.<br />\nstudent body (which incidentally does interest of the student body which<br />\nMcElhiney, 41, Seymour Rubin, '40; Kessr4h Maxey. Jr..<br />\nin Germany since 1933 and a breach had slowly widened Student Body to be its own<br />\n'39; Irving Milberg, '39; Herbert Kleinfeld. '41; John<br />\npolice not include the spokesman of the we represent. Our feeling was<br />\npurely<br />\nIligham. '41; Sheldon, '39.,<br />\nbetween himself and the German officials. He refused<br />\nforce. .<br />\nYoung Communist I0eague), who may an .all democratic one of<br />\n'<br />\nBUSINESS STAFF<br />\nto hear Democracies continually denounced at Nazi<br />\nunbiased<br />\nbe<br />\ninterested<br />\nin<br />\nand<br />\nwho<br />\nhave<br />\nevery<br />\nMelville Locker<br />\nThere<br />\nare<br />\nseveral<br />\nfacts<br />\nopinion<br />\nthat<br />\nin view of all facts that were<br />\nwill<br />\nmeetings and so he refused to attend them. Gradually<br />\nhis loathing for the Nazi grew so intense, he came into we believe, make the success:of this right to know the motives and ac- presented at that time and<br />\n.have<br />\ntions Of your elected student govern1937<br />\nopen conflict with them. The German government plan impossible. First, the Student.<br />\nment, the Student Council makes the subsequently been presented up to<br />\nformally protested, and he answered by handing in his<br />\nCouncil and its work is unfortunately,<br />\nnow.<br />\nlowing statement.<br />\nresignation and coming home.<br />\nlooked upon as something entirely<br />\nIt is our feeling that the relative<br />\nFirst, Mr. Slesinger says that the<br />\nWhen we examine Mr. Dodd's past record, nothing<br />\nforeign to the lower classmen. Why<br />\n1,87<br />\nY. C. L. is a legitimate campus or- merits and defects Of the organ4a/Amber<br />\nspeaks more highly for him. The integrity of the forethis should be so, we don't know. ganization.\"May we state at this point lion or its platform should not<br />\ndeign service is certainly recognized, especially the inThese lower classmen just think of that no organization the membership termine whether an assembly should<br />\ntegrity<br />\nof<br />\nthe<br />\nforeign<br />\nservice<br />\nin<br />\nthe,,<br />\nmost<br />\nimportant,<br />\nDieenhutor of<br />\nthe Council as an institution to be and activities of which are held secret be granted or whether an assembly<br />\nembassies in a shrewdly diplomatic Europe. In this<br />\nshould be turned down. In the event<br />\navoided, possibly to be feared and from student body and administracase they picked a professor of American history at<br />\ntion alike can claim to belong in such that an organization or an indiviotherwise to be left unnoticed. SecondANSI,NTRO row N•11014•L<br />\ndual saw fit to criticize Mr. Browder<br />\n••<br />\na<br />\ncategory.<br />\nthe University of Chicago, who had had tremendous<br />\nly, the Student Body will not put up<br />\nor the Y.C.L. we see no reason why<br />\nN ationaI Advertising Service,Inc.<br />\nbackground in practical affairs, during and following'<br />\nSecond, one of the functions of the<br />\nC011af l'ablnhon<br />\na request for an assembly<br />\nwith any form of police force in<br />\nshould<br />\nthe Great War.,<br />\n420 MADISON AVE.<br />\nStudent Council 'is to supervise stu• •<br />\nNEW YORK. N. Y<br />\nnot be granted. We would have comCHI( A4,1 • LOS A•ori Fs - SAN FRANCIS!<br />\nwhich a select group only are mem- dent assemblies. In the<br />\npast, the counThis man stomached as much as he could of the Nazi<br />\npelled<br />\nno<br />\nstydent to hear Mr.<br />\nbers. Thirdly, no nian will report 2il has either provided for the, proTUESDAY, JANUARY 25, 1938<br />\npolicies, until they so disgusted him he revolted.<br />\nBrowder.<br />\ngram itself, or has turned the assemMr. Dodd's talk tomorrow night will be the report another if he knows that such an act<br />\nWe feel that the majority vote<br />\nbly over to some recognized campus<br />\nIt seems strange that the of an enlightened person Who was in a first hand posi- may lead to exputsion.'<br />\ndiscriminates against a group of inorganization that has applied for it.<br />\nBarnstormers should com- tion to observe. Why he blisters the Nazi regime is<br />\ndividuals Whom we think should have<br />\nOur plan, we think, overcomes these The<br />\nome<br />\n4,<br />\nassembly has never been turned<br />\nplain of lack of support surely worth hearing.<br />\ndifficulties. In the first place, it is over to a single individual, graduate been accorded the same privileges as<br />\nfrom the student body after<br />\nwere granted to other groups of<br />\nn<br />\ninpersonal, i. e., its carrying out is put or undergraduate for any purpose<br />\nThose<br />\nwho<br />\nread<br />\nthrough<br />\nviewing the reception that<br />\ndividuals gathered in organizations<br />\nBernstein's letter to the Stu- up to each member of the 'Student whatever. Hence there is no devia- like Omicron Delta<br />\nwas accorded that group'<br />\ntormers<br />\nKappa, Tau Beta<br />\ntion from precedent in refusing to<br />\ndent Council printed on this Body individually. Secondly, the police<br />\nlatest effort. Whether or not<br />\nPi, The American Student Union<br />\nand<br />\nextend the courtesy and attending reit was \"due to luck --as Mr. Swyer puts it—that \"Boy<br />\npage will immediately see force to be _let up is the ideal type—<br />\nsimilar campus groups.<br />\nsponsibility<br />\nof<br />\nthe<br />\nassembly<br />\nplatMeets Girl\" played to a full house is perfectly irrelethe wrong track<br />\ns on in one containing all the students. Third,<br />\nform to Mr. Slesinger, who alone<br />\nvant. The fact remains that it did, and if the 'Stonyiers<br />\nan attempt to refo<br />\nthe teporting a violator will ninety-nine<br />\nHonor System. Alread there I times out of a hundred not lead to constitutes the admitted- membership<br />\nwish to lay this to the generosity of the spirits, instaad<br />\nof the Young Communist League.<br />\nof to their own drawing power, then they certainly have are enough students sworn to uphold the Syst . The I expulson or any other type of penalty. Should the<br />\nStudent Council break<br />\n\"police force\" nature would hardly be altered for the<br />\nI<br />\nhope<br />\nyou<br />\nare<br />\nstill<br />\ninterested<br />\na right to do so.<br />\nthis precedent, it would open itself<br />\nbetter by this active body, which would conflict with the.<br />\nenough<br />\nto<br />\ncarefully<br />\nread<br />\nas<br />\nthe<br />\nplan<br />\nto the request of any person who<br />\nAs to the.\"gOod publicity,\" which, it is claimed, they work of the newly-formed Honor Commission.<br />\nWe are told that we live in .a<br />\nI shall now expound it. We build up might ask for an audience<br />\nin the name democracy. Sometimes<br />\ndid not get, the 'Barnstormers have no one but themwe wonder.<br />\nWe suggest the Council' ignore the letter insofar as an organization in which membership<br />\nof a secret organization comprised of When we look<br />\nin, the direction of<br />\nselves to blame. Although the NEWS-LETTER cooper- its practical parts are concerned. They could if put into involves only the signing and keeping<br />\nuntold numbers of evanescent mem- Jersey City,<br />\nour doubts surge up<br />\nated in every possible way in helfoing the show to suc- effect, nip in the bud any student acceptance of a real up of a pledge. Students are approach- bers.<br />\nanew.<br />\nceed, the same conditions did not hold good off the Honor' System again. The fact--that- this \"executive'ed personally and individually by stuThere- seems to have been nothing<br />\nThird, another precedent that the<br />\nbranch of six\" is not duly elected by the students takes dents. who are already in the organicampus. Professional newspapers do not offer up their<br />\ncouncil does not wish to break, is that in American politics for a long time<br />\naway considerable prestige.<br />\nzation; they are explained the matter<br />\ncolumns on a silver platter. You've got to battle with<br />\n,f maintaining an educational, non- as utterly inexcusable as the Stand<br />\n*However, the Council should take into account the vi hand; and they are.asked to sign the<br />\npolitical program at the student as- that Mayor Hague of Jersey City<br />\n'every editor and columnist in town before he'll print spirit behind the letter. It shows a reawakening of t pledge.<br />\nWhen they do so, they are<br />\nsemblies. If the Council were petition- has'taken . against the. C.I.O. In our<br />\none slug of type .about your show. It's time the'Barn- moral sense that we hope will spread.<br />\nexpected to adhere to the Honor:Sysed by the Young Democrats or by the short lifetime, certainly, we have<br />\ntem, get others to signpledges, and<br />\nstormers learned that publicity does not come .to him<br />\nnever • witnessed such -brutal muzWe have been seri-61161y themsehrlk, report to the executive Young Republicans, even were the '<br />\nwho waits.<br />\nzling of legitimate public opinion, so<br />\n.•<br />\nwondering 6!-late whether branch any violator. The executive petition signed by its,active members<br />\nThe NEWS-LETTER believes, as Mr. Swyer has said,<br />\nflagrant<br />\na violation of the erstwhile<br />\nthe<br />\nCouncil<br />\nwould<br />\nbe forced to rea great force is not going branch consists of'a council of six<br />\nthat a second show depends on whether or not enough<br />\n\"inalienable\" rights connected with<br />\nfuse it on the Same grounds.<br />\nto waste at the Hopkins in men, including a chairman and a<br />\n•<br />\nmoney is available to produce it. If it is net available<br />\nfree assembly and free speech. Selthe form of Pi Delta 'hp- secretary.<br />\nthen taxing the. students is not out of the question. Tile<br />\ndom, too, has the red herring of the<br />\nsilon, honorary journalism<br />\nThe following was sakmitted- by:<br />\nThis council receives the report,<br />\nleast the Barnstormerls could do, would be to present<br />\nCommunist label been used with such<br />\nfraternity. That it offers inWilliam B. Kempton, President<br />\nand sends the violator a personal letsuch a plan to the student body. If it is accepted, then<br />\ndevastating efficacy to support and<br />\nspiration, encouragement, and a goal to strive for to<br />\nHarold Ricards, Junior Rep,<br />\nter telling him he has been reported<br />\nall will be well; if ,not, then their efforts -will not have<br />\njustify this violation.<br />\nall men connected with publications is undeniable, but<br />\nHarlan Graham, Senior Rep.<br />\ncheating by<br />\nmember of his class<br />\nbeen in vain. For it will have shown that the 'Stormers<br />\n. What is behind this hysterical efmore?<br />\nnot<br />\ndo<br />\ncan it<br />\nJ.. Murray Kempton, Junior Rep.<br />\n(name kept secret), explaining to<br />\nhave made a_sincere attempt to fulfill the requirements<br />\nfort to curb • the freedom of fellow- .<br />\nIn view of the fact- that a contr.:),<br />\nProbably in very few fields does one find such a him just what the Honor Systein<br />\n,-)1' a 'campus dramatics organization.<br />\nAmericans? On its face it would<br />\nvariety of interesting persons as one does in that of means, and suggesting to him that for versy of opinion has arisen on the seem to be<br />\nrherely the mouthings of<br />\nA new semester will soon begin. We trust that some<br />\njournalism. The experiences of any journalist .might his own good he desist. When a viothat portion of our citizenry which<br />\nfinancial plan will be forthcoming before it is too late<br />\nwell make an interesting,_ book. And with each having lator realizes he is watched- by un- Student Resents Interruption Of believes that<br />\nthe primary function<br />\nto attempt another show.<br />\nhis own individual style of telling of these experiences, known members of his own class, he<br />\nPhilharmonic Symphony By Father of American democracy is the<br />\npurely<br />\nlistening.becomes an interesting educational, and happy Will \"see the light.\" If, however, afCoughlin.<br />\nnegative<br />\none<br />\nof<br />\nexcluding \"isms\" of<br />\nWe think the relevant experience.<br />\n.<br />\n•<br />\n-,The Student Council<br />\nevery description. It might be merely<br />\nter being reported twice, and having<br />\n_point is tha_tradition<br />\n'Why doesn't PI-Delta EPsilon take it upon itself to been twice (a space of time having Dear Sir:<br />\na political move on the part of Boss<br />\nassociated with the Hopkins<br />\nsecure -some of these famous journalists as assembly taken place between) warned. be still<br />\nWith strange appropriateness last Hague and Stooge Moore.<br />\nof reverence for truth, respeakers? The candidates are infinite, it is needless persists, then the case with all the Sunday, Father Coughlin's address<br />\nBut there is obviously more in it<br />\nsfoe-et. for liberty, and above<br />\nto do so much as name even oee. And the campus as a evidence is turned over to the Student was ushered onto the air waves im- than this. A glance at the composiall, a faith in the free exDelta<br />\nupon<br />\nEpsilon<br />\nPi<br />\nlook<br />\nto<br />\ncome<br />\nwell<br />\ncould<br />\nwhole<br />\nCouncil for suitable action.<br />\nmediately after the announcement tion of the groups supporting the rechange of ideas and opinions.<br />\nof its ,life, were this the case.<br />\nints matter of an assembly for the Y. C. L. is but a as.a part<br />\nUnder this plan,-11 is very likely of the \"Fantastic Symphony\" on the actionary stand of the Mayor disthis<br />\ntap-day<br />\nEpsilon<br />\nDelta<br />\nNew<br />\nPi<br />\nYork Philharmonic program. closes powerful economic forces<br />\nanother<br />\nbe<br />\nwill<br />\nThere<br />\nparticular to the generality of aclidemic freedom. We<br />\nthat only under-classmen will be 'afshould not evade the issue but frankly ask ourselves: year, early in the spring, probably. We 'suggest that fected, but then in the .process 'of What followed was so .unnaturally working behind the political machinAre we afraid of the educational processes to which we Pi Delta Epsilon avail -itself of this opportunity, and about two years they will be seniors. discordant it could be called fantastic, ery involved. The citizens' commitpay so profuse h lip service? De we carry out in practice conduct a public tap-day, while presenting an interest- Then a new Honor System spirit will but the symphony was not there. Yet tees, the veterans' organizations,<br />\nand of course the Rotary and Kiour policy of hearing -all sides before we make a decision'? ing speaker whom students will enjoy hearing.<br />\nbe in effect. Also thuS the Honor I hesitate to enter this with other<br />\nwanis groups, all represent the busiHopkins students are treated traditionally as mature<br />\nSystem Tradition would be personally protests against the interruption.<br />\nThis week the Greek letter<br />\nI hesitate because these ' protests ness interests of the state, whether<br />\ngentlemen. We consider the rejection of a Commueist<br />\n\"driven home\" in the minds of every<br />\nthey admit it or not. And how about<br />\norganizations, after comspeaker an insult at our intelligence ad judgmet. After<br />\nnewcomer and entrance in the Uni- might prevail upon the broadcasting<br />\nhe arch-Republican New York Sun?<br />\npleting one half of their anall, this was to be a voluntary assembly; any one who<br />\nversity would involve adherence to companies to change the time of<br />\ncompetition,<br />\nbasketball<br />\nThe fabric of our democracy is<br />\nnual<br />\nFather Coughlin's talk. This might<br />\nwished could stay away.<br />\nthe Honor System.<br />\ntake a much needed rest<br />\nwell mean a shift to the middle of indeed frail if it can be so flagrantly<br />\nWe think we are old enough to separate the chafe<br />\norganized<br />\nthis<br />\nplan<br />\nunder<br />\nhave<br />\nWe<br />\npfior to the mid-year examthe Metropolitan Opera according to torn with impunity. The great danfrom the wheat. The University must certainly think<br />\nand now number a score of members.<br />\nination period.<br />\nthe display of abominable taste we ger to our \"cherished democratic'<br />\nso or perhaps it would take the copy of.What Is CommuOur biggest obstacle has been the<br />\ninstitutions\" come not from sinister,<br />\nAccording to the director of intramural athletics,<br />\nhave for a precedent.<br />\nnism from our library.<br />\nfact that we are not officially recogalien and \"un-American\" influences,<br />\nThe NEWS-LETTER appreciates Dr. Bowman's state- Reuben Baer, this season's competition has been the<br />\nHere is one of the most Profoundly<br />\nnized. Our Council consists of four<br />\nbut from the very interests, those of<br />\nment of last year that \"My position in this matter is, if keenest and most successful since its inception four<br />\nsophs and two freshmen, of which cultured programs on the radio, a<br />\nyou're going to have an assembly program and invite years ago under his direction. Never before have the two are engineers, one a business program that in away redeems the the capitalist class, which are supporting<br />\nHague in his present caman extremist, right or left, make sure in your announce- fraternities shown the cooperation and enthusiasm as student, and three A. B's, ---radio for much of the trash it broadpaign.<br />\nendirireing the cause Of they- have this 'year: Whereas In--previous years there<br />\nment that the Univerilify<br />\ncasts. It is being usurped by a dimeyou<br />\ntake<br />\nsuggest<br />\nour<br />\norganizaWhen<br />\nWe<br />\ntotal<br />\nweek,<br />\nprivate interests see fit to<br />\nforfeits<br />\nto<br />\nthe<br />\ndate<br />\na<br />\nthis<br />\nthree<br />\naveraged<br />\nan extremist.\"<br />\na-dozen demagogue. Anomalous as it<br />\nThere can be no compromise in a problem like this. year is only three cancellations. There has been a tion, with the same personnel, under may seem, this approaches desecra- take the law•into their own hands,<br />\nthen it is that democratic instituNo kind of 'rationalization or wishful thpiking will greater show of spirit. nd yet this does not mean that your wing, give us official recogni- tion of the Sabbath by a priest.<br />\ntions are truly threatened. And when<br />\ncharge the fundamental issue. Are we or are we not to re- the games have been rougher. According to referee tion, and let us go to work especially<br />\nI feel that WCAO has not only<br />\nclassmen.<br />\nlower<br />\nAfter<br />\neven<br />\na<br />\ngames-are<br />\nyear<br />\ncleaner<br />\nor<br />\nelected<br />\nand<br />\nthe<br />\nthe<br />\nbn<br />\nKaufMan<br />\nmore<br />\n\"public\" officials not, only<br />\nMillard<br />\nceive a liberal education? Are we to be allowed to hear<br />\nshown detestable 'discrimination, but<br />\naid but actively direct this organand see everything; or are there certain questions . . .? scientific than those of past yers. The players seem to so you will begin to see success.<br />\nbetrayed its public trust.<br />\nIt<br />\nhas<br />\nSincerely yours,<br />\ngreater knowledge of th6 game and its<br />\nized bigotry, Fascism is entirely too<br />\nIf we may speak for some students, this'high-handed, have acquired a<br />\nSincerely,<br />\nIsador A. Bernstein<br />\nclose for comfort.<br />\nanti-intellectual move does not represent our attitude. rules, and there is less of the aimless amateurish rush—Kenneth<br />\nJr.<br />\nMaxey,<br />\nP.O.<br />\ncourt.<br />\nBox<br />\n66.<br />\nthe<br />\ndown<br />\npand<br />\ning<br />\n—The Daily Princetonian<br />\nu<br />\nIs this Hopkins or Heidelberg?<br />\nPublished semi-weekly from October to June, except during examine-.<br />\nand college holiday periods by undergraduates of the Johns Hopkins<br />\nUnigersity.<br />\n<br />\nTea<br />\n<br />\nDodd And<br />\nThe Reich,<br />\n<br />\na<br />\n<br />\nMEMBER<br />\n<br />\n1938<br />\n<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nrtssociated Cone6icie Press<br />\n<br />\nCollebiate West<br />\n<br />\nC<br />\nO<br />\nS<br />\n<br />\nThe<br />\nSecret<br />\nSix<br />\n<br />\nTh,<br />\npath<br />\n<br />\nLoyd<br />\n<br />\ngin. '<br />\n<br />\nsaber<br />\n<br />\nfor a<br />\n<br />\nCal<br />\nthrou<br />\n<br />\nrecori<br />\n<br />\nmatcl<br />\nvictor<br />\nin thi<br />\n5-2 a<br />\nconte:<br />\ntheir<br />\nGlein.<br />\n<br />\nDill<br />\nthe<br />\nmost<br />\nLoyol.<br />\n<br />\nHas<br />\nother<br />\npletel;<br />\nthe as<br />\n<br />\nCONTEMPORARY<br />\nuOMMENT<br />\n<br />\niranimirso<br />\n<br />\n•<br />\nWhy<br />\nJournalist<br />\nSpeakers<br />\n<br />\nPage One ,<br />\nEditorial<br />\nContinued<br />\n<br />\nIntramural<br />\nBasketball<br />\n<br />\n7113=1:193M<br />\n<br />\nEfivri<br />\n<br />\nBOI<br />\nBe<br />\n<br />\n\fHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1935<br />\n<br />\n3<br />\n<br />\nS 13OR<br />\n<br />\nSPEAKING OF ...<br />\nWhat Cagers ('annot Do Against A Zone And Of<br />\nPete Reynolds' Humiliation Of Alma Mater<br />\n<br />\nOur Jay quintet scrimmaged the I Pete Reynolds, erstwhile<br />\nall-around<br />\nnewly organized Mt. Washington five athlete at the Hopkins.<br />\nPete \"Red<br />\nat Homewood, last Saturday, and Eye\" was his label in his<br />\nsenior year)<br />\nlucky thing.it was that the affair was up to his old tricks,<br />\ndressed in<br />\nwent by without much notice, for we a blue uniform belonging<br />\nto the Mt..<br />\nhave an idea that Mr. Craig Taylor Washington club instead<br />\nof the Hopwould have taken great pleasure in kins athletic department.<br />\nThe way<br />\nwitnessing the contest. Craig has in which he tore<br />\naround the court,<br />\nbeen trying, for a long time, to pin making life miserable<br />\nfor his alma<br />\nsomething definite on us, though, for mater's varsity reminded<br />\nus of his<br />\nthe most part, his attempts have met former feats in<br />\nHopkins apparel.<br />\nwith little success. But his heart<br />\nPete Is a \"4\" Letter Man<br />\nwould have bee filled with glee if he<br />\nMr. Reynolds holds the distinction<br />\nhad seen the many glaring flaws disof having been a leading dg<br />\n.tire in all<br />\nplayed by our lanky exponents of the<br />\nfour of our major sports. As a footcourt against a team of inexperienced<br />\nball player, he was one of the leadinferiors<br />\ning fullbacks in the State. On the laZone Defense Tricks Jays<br />\ncrosse field, he was the bulwark of<br />\nThe Mounts set<br />\n'<br />\nup a zone (the our defense. The cinder-paths saw<br />\nsame sort of thing \\Towson will show him •run off the hundred yard<br />\nstretch<br />\nus tonight) the plan being to give in ten flat many a time. And<br />\nhe<br />\nour Blue boys a chance to eliminate starred rather brilliantly in a basketsome of the faults they have exhib- ball role which saw his speed and<br />\n<br />\nTeam Victors<br />\nBLUE JAY FOILSMEN SCORE INITIAL PI LAMBDA DEFEATS Rifle<br />\nOver Georgetown U.<br />\nVICTORY OF YEAR AGAINST LOYOLA ALPHA DELIS 22-7;<br />\n<br />\nONLY FRAT GAME<br />\n<br />\nTeam Defeats Greyhounds<br />\ni3y Close Margin Of<br />\n6-5 At Evergreen<br />\nBob Read Outstanding<br />\n<br />\nSmall And Deeples Split<br />\nSmall and Deeples were also entered in the foils matches. Each came<br />\nthrough with one win and one loss.<br />\nBoth had the misfortune of coming<br />\nup against Loyola's leading fencer,<br />\nDill. Dill just managed to eek out a<br />\n<br />\nBlack And Blue Squad<br />\nWins By Supremacy<br />\nIn Foils<br />\n<br />\n5-2 and came on to, close the foils<br />\ncontests and provide Hopkins with<br />\ntheir margin of 'win by defeating<br />\nGlein, 5-0.<br />\n<br />\nDill, Loyola defeated A.grin, 5-4<br />\n(<br />\nEat at CHUNG HING<br />\nAmerican and Chinese Restaurant<br />\nDelicious American and<br />\nChinese Food<br />\nPrices Reasonable—To Suit Your<br />\nPocket Book<br />\n3312 Greenmount Ave. CH. 9092<br />\n<br />\nBILLIARDS<br />\nPing Pong<br />\nManaged by Maryland's<br />\nSeale Champions<br />\nFinest Tables—Reasonable Prices<br />\nGreenmount Ave & 31st St.<br />\n<br />\nfrat teams had an open date. It was<br />\nused however for a practice session<br />\nby some teams in order to prepare<br />\nfor the deciding games after exams.<br />\nIn the Pi Lam-Alpha Delta* fracas,<br />\nit was all Pi Lam from the start.<br />\nLed by eagle eye Marty Breslau,<br />\nthe outcome 'of the game was never<br />\nin doubt. Breslau scored 4 field goals<br />\nand converted twice from the foul<br />\n<br />\nLipnick, Hopkins defeated Ballan, 5-3 losing Alpha Delta.<br />\n<br />\nDill of Loyola was outstanding for Dill; Loyola defeated Small, 5-4<br />\nthe losing . team. He amassed the Deeples, Hopkins defeated,Balland, 5-3<br />\nmost victories and scored four of<br />\nDill, Loyola defeated Agrin, 5-2<br />\nLoyola's five points.<br />\nReed, Hopkins, defeated Glein, 5-0<br />\nHarris of Hopkins was the only<br />\n•<br />\nSaber<br />\nother undefeated foilsman. He completely outclassed his opponent in Harris, Hopkins defeated Dill, 5-1<br />\n<br />\nii<br />\n<br />\nPi 'Lam<br />\n* defeated Alpha Delta Phi<br />\nin a make-up game last Saturday,<br />\n22-7. It was the only- gam, as all<br />\n<br />\nline, a total of 10 points, to capture<br />\nReed, Hopkins defeated Giblis, 5-3<br />\nSmall, Hopkins defeated Ballard,5-2 scoring honors for the afternoon.<br />\nVickers was high point man for the<br />\nDill,\" Loyola defeated Deeples, 5-3<br />\nBlein, Loyola defeated Small, 5-4<br />\n<br />\nthe saber event by a score of 5-1.<br />\n<br />\nTeams Use Period As<br />\nPractice Session<br />\nFor Finals<br />\n<br />\nvictory over Small by the flimsy margin of 5-4.<br />\n<br />\nThe team was honored to have as<br />\nThe ,Jay fencers, following in the referee Generoso Travese, one of the<br />\npath of the basketball team, defeated leading fencing masters of the country, The match was exciting; not beLoyola College by a one point maring decided until the•Jast event, and<br />\ngin. With the score even up in the<br />\nshowed up some promising men who<br />\nsaber duels the Jays came through should profit by the experience of<br />\nfor a five-four margin in the foils.<br />\nthe regular season and give a good<br />\naccount of themselves in the Middle<br />\nReed Leads Jays<br />\nAtlantic Championships:<br />\nCaptain Reed at Hopkins went<br />\nWth the first victory starting the<br />\nthrough the night with an undefeated<br />\nball rolling a prediction of a fair<br />\nrecord. He was entered' in two foils<br />\nseason may be forecailt.<br />\nmatches and scored 2 overwhelming Summaries:<br />\nvictories. He beat Balland of Loyola<br />\nFoils<br />\nin the opening match by a score of<br />\n<br />\nDill Oustanding<br />\n<br />\nSecond Victory Out Of<br />\nThree Starts For<br />\nP. Lams<br />\n<br />\nPatronize Your Advertiser<br />\n<br />\nSecond Win For Pi Lam<br />\nIt was the first win for the Pi<br />\nLam quintet, winner of the Turby-<br />\n<br />\nThe Joh,ns Hopkins rifle team,<br />\nled by C. E. Lindenmeyer, manager and captain, scored a 12491318 victory over Georgetown in a<br />\nshoulder-to-shoulder match at the<br />\nnation's capital. This triumph was<br />\nthe first win of the season for the<br />\nJay sharpshooters.<br />\nBesides Lindenmeyer, M. J.<br />\nHartke, J. T. Griffin, R. G. Brown,<br />\nW. B. Grey, M. J. Weber, J. S.<br />\nBaldwin, R. B. Stegmaier, and A.<br />\nH. Smith.<br />\nThe president Of the Rifle Club<br />\nis R. B. Stegmaier, while W. B.<br />\nGrey is the secretary The club is<br />\nunder the general supervision of<br />\nthe R 0. T. d.; most of the matches being arranged by the Military<br />\nScience departments of various<br />\nschools. The men practice during<br />\nthe week in the shooting gallery<br />\nlocated on the fourth floor of Gilman Hall.<br />\nThe Jays will encounter Georgetown in a return match here at the<br />\nJohns Hopkins gallery. The team<br />\nbecause of its many experienced<br />\nveterans hope to continue their<br />\ngood work, and take the Terrors<br />\nagain. This contest will take place<br />\non March 5.<br />\nThe members of the rifle club<br />\nurge men who are 'interested in<br />\nthis spoit to report to the North<br />\nloft of Gilman Hall for information.<br />\n<br />\nited repeatedly in playing against strength exploited to the fullest of<br />\nsuch a defense. However, defects their ,potentialities. What makes the<br />\nseemed to pile up instead of the fellow's history here all the more<br />\nother way around. Our hoopsters con- remarkable, is the fact that before<br />\ntinually. failed to move the ball, los- his enrollment as a student, he hadn't<br />\ning it tiriie and again as a result of participated in a single sport.<br />\n!inaccuracy and lack of speed a-foot.<br />\nHe's A Mote Team<br />\nWhat topped the performance off<br />\nPet's behavior Saturday bears out<br />\nwas the inability. of our boys to hit his past<br />\nrecord perfectly. If ever<br />\nthe cords when once they got their there was a<br />\nwhole team in himself,<br />\nshots: Of course, it was only a pracPete's it. He Was all over the court,<br />\ntice session, and almost all chose to<br />\nthink of It as such, but still we hope getting in everyone's hair, stealing<br />\nwe don't get a sample of the same the ball so many times that one<br />\nkind when we meet Maryland Teach- could think he had some sort of an ,<br />\ners.<br />\noption on it. Perhaps Jerry Carleton's<br />\n<br />\nSummaries...<br />\n<br />\nville Trophy for the last two years,<br />\nafter being upset two weeks ago by<br />\nKappa Alpha by the score of 9-5.<br />\n<br />\n--- -Meet Mr. Pete Reynolds<br />\nremark fits the situation best. After<br />\nSoon the sap will he running in<br />\nThe afternoon was not without its playing him for a short while, Jerry<br />\ndr* trees and the first twinges of<br />\nThe record for the Pi Lams so far<br />\nSpring will- cause the desertion of brighter side, for it marked the re- gave vent to: \"Boy, he's as fast as a<br />\nshows 2 wins against 1 loss for an<br />\nthe gym. February apProaches, and turn to the Homewood cage, after an ight and strong as an ox!\"<br />\naverage of .666. The luckless Alpha with it comes warming up for la- absence of close to three years, of<br />\n•<br />\nDelts are yet ot win a game having crosse, track, baseball, etc.— all<br />\n•<br />\nafter exams of course. Such balmy<br />\nlost 3 straight.<br />\nOnly Down Town Stage Show<br />\nweather as we, well, you have enKIBLER'S ,<br />\nAs competition for the basketball joyed today really makes the prosNOW<br />\nJewelers and Opticians<br />\ntrophy draws to a close there are pect of life more cheerful . . . Hal<br />\nParker Pens and Pencils<br />\ntwo undefeated teams in each league. Zheutlin is back from the hospital,<br />\n' Jewelry and Watches<br />\nIn league \"A\" there is Phi Gam, last where he has been convalescing for<br />\nTHEY CALL IT LOVE ..<br />\nEyes Examined<br />\nyear's champs and Phi Alpha, dark some time. It's a pity the basketball,<br />\nYOU'LL CALL IT A RIOT!<br />\nteam lacked his services this winter<br />\nLens Repaired<br />\nhorse of the '37'38 season, who are<br />\n. . . Why not a crew at J. H. U.?<br />\n1918's First Laugh Hit!<br />\nundefeated. As it stands now Phi<br />\nWith some of the huskies we have<br />\nGam seems to have the edge, but<br />\nbestuding the campus like so many<br />\n• hey will'have to be at top form to<br />\nGladYs George<br />\n3222 Greenmount Ave.<br />\ncolosi we could make a good showdefeat Phi Alpha's \"fighting gators\"<br />\n•`ing against the -100-book boys from<br />\nFranchot<br />\nTone<br />\nlead .by Capt. Rudo. They will clash<br />\nAnnapolis . . . We predict Jim Bradon Saturday. ,Feb. 19th in a game<br />\n\"LOVE IS A HEADACHE\"<br />\ndack will be a second Fitzsimmons,<br />\nwhich should be a great game.<br />\nhe's upset the wise dope too often.<br />\nON OUR STAGE<br />\n•<br />\nKappa Sigs Head League \"B\"<br />\nAMERICA'S FAMOUS SONG<br />\nIn League \"B\", there are also two plays\"Jay Vee\" pall this year. HowWRITER AND STAR-MAKER!<br />\nundefeated teams, namely, Kappa Sig ever, . the other undefeated team<br />\nand Kappa Alpha. At present it looks Kappa Alpha, who defeated'a strong<br />\nIN PERSON<br />\nST PAUL AT 33RD STREET<br />\nas if Kappa Sig will represent league Pi Lam quintet several weeks ago,<br />\n\"B\" in the play-offs. Led by Pay can be counted on to give Kappa Sig<br />\nBENNY DAVIS<br />\nPrescriptions—School Supplies<br />\nand Brayshaw, Kappa Sig has practi- a hard tussle, and with a few breaks<br />\nAnd His All New<br />\ncally the same teams which went to might even win. Led by Reynolds,<br />\nSandwiches<br />\n\"STARDUST REVUE<br />\nthe finals last year, only to 'lose to Kappa Alpha is always a dangerous<br />\nPhi Gam by a close spore. Every mem- team and one that will be in there<br />\nOF 1938\"<br />\nUnexcelled Fountain Service<br />\nber of the Kappa Sig 1st team also until the end.<br />\n<br />\nHIPPODROME<br />\n<br />\nDin I4 141<br />\n<br />\nS1<br />\n<br />\nPHARMACY<br />\n<br />\nlb•Gtoehtith a 5on<br />\niliy Prinfin6<br />\n<br />\nWit4 •1044 W044<br />\n%Moo.<br />\n<br />\n%•1,44<br />\nNO,ialn<br />\n4sa.a.<br />\nC.<br />\n‘00,44,<br />\n<br />\n4.7<br />\n<br />\nWt$44<br />\nlog 4444 Nfr.<br />\n10/1:<br />\n<br />\nwoo4w$44,•m044 %Op,<br />\n4441.<br />\nvsy<br />\nc malltet No\"..1%%4i.<br />\n7%.(C. 7\"+\"C.<br />\n<br />\nWO.14 W004<br />\n<br />\n%k1014<br />\nAoki<br />\n\"<br />\nN.<br />\n<br />\n%MIA,1.W•<br />\n<br />\n'CC<br />\n<br />\n-<br />\n<br />\nAA:<br />\n+<br />\nW1014<br />\nNit<br />\n<br />\n%VIM,<br />\n<br />\nSpecialistsin Schooland<br />\nCollegelVork•Maiazines•<br />\nAnnualsProgramsDance<br />\nPro6ramsAnnounceme1tts•<br />\nStationery<br />\n<br />\n•tvfo.<br />\n+\"(7,<br />\n<br />\nBy Popular Request<br />\n<br />\nW144<br />\nAte:.<br />\n<br />\n144.1.<br />\nsaktfons....<br />\n<br />\nTHE COTILLION BOARD<br />\n<br />\nWOW.,<br />\nr<br />\nAp.<br />\n<br />\nwww.wwwwwwwi<br />\ntrr—..<br />\nTbe Hark<br />\n<br />\nzWf+<br />\n<br />\n7.3..tras<br />\n<br />\nCtuj<br />\nj..9r-<br />\n<br />\n7‘+t,<br />\n%MOM,<br />\n<br />\nPRESENTS...<br />\n<br />\nmo4e,<br />\n4m.<br />\n+<br />\nw 44<br />\nW1‘44<br />\n<br />\n/1<br />\n.1044<br />\n<br />\n119-121 W. MULBERRY ST.<br />\n<br />\nMet',<br />\n<br />\n••1044<br />\n<br />\nGLEN GRAY<br />\n<br />\n1400,1<br />\n<br />\nins<br />\nCASA LOMA ORCHESTRA<br />\nAND<br />\n<br />\n]<br />\nEl)e Workmanship<br />\nC. Landler, Prop.<br />\nHair Cutting, 40.<br />\nThe Xerras Treatment al<br />\nBOULEVARD BARBER SHOP<br />\nON 33RD STREET<br />\nBetween St. Paul and Calvert Streets<br />\n<br />\nBoulevard Hardware Co.<br />\nHOUSE FURNISHINGS<br />\nELECTRICAL SUPPLIES<br />\n430 E. Thirty Second St.<br />\nUn. 0749<br />\n<br />\n•1$44<br />\n1\\\\44‘<br />\n%fest<br />\n<br />\n•<br />\nYou Get the likest Raw Bar Oysters at<br />\n<br />\nHARRY L. HASSLINGER CO., Inc.<br />\nDINING ROOM AND BAR<br />\nNORTH AVE. & ST. PAUL STREET<br />\n<br />\nsoya:<br />\n<br />\nWOO,<br />\nkW4.re<br />\nrays.<br />\n<br />\nMARCH 1<br />\n<br />\n••1044••1044<br />\n44,1.%Mfr.<br />\n<br />\n%%444<br />\n.44f.<br />\ny<br />\n<br />\n7 CC.7%+t,<br />\n<br />\nW1044<br />\n<br />\nALCAZAR<br />\n<br />\n-<br />\n<br />\n• 44•M0/4 W1044<br />\n.<br />\n104.%•41.<br />\n<br />\n+<br />\n<br />\nW044<br />\n<br />\n+\"<br />\n<br />\n•1044 tee, WOE,<br />\n110‘.4‘‘vo,<br />\n%OW<br />\nAWP itvP-44.)01.•<br />\n<br />\n11044<br />\n7Nt.<br />\nZ•1$44<br />\n<br />\nU94.,;mpg, %%444 Z1t$Se,<br />\n<br />\n\f1.1<br />\n<br />\n4<br />\n<br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25,<br />\n1938<br />\n<br />\nCAMERA SOCIETY J. H. U. MUSICAL CLUB Dormitory Will Spring To Life PRESS PUBLISHES SUMMARY<br />\nAfter Examinations Are Over OF YEARS PUBLICATIONS<br />\nPLAYS TWO WEEK-END<br />\nPRESENTS PICTURE TRIP<br />\nAT HOPKINS<br />\nENGAGEMENTS<br />\nEXPERT AT TALK<br />\n<br />\nArthur Katz, '38, chairman of the elected by the men in<br />\nthe dorms,<br />\nBoas' Primer For Critics, In Several Editions,<br />\nSocial Committee of the Board of one from each of the<br />\nsix entries.<br />\nLeads List; Important Scholarly Works<br />\nFellows at the Dormitory, today an- The Board is competently<br />\nheaded by<br />\nPerform At Hood College nounced a \"Social Renaissance\"<br />\nat Dr. Donald H. Andrews, Senior FelRun Off During Past Year<br />\nMr. Fred Vaughan Of De- Annapolis High School; the dorms would take place follow- low of the Chemistry Department. The Johns Hopkins Press,<br />\nmanaged ing of the Ancient Romans by Liling the -examination period. A dorm Any infractions of the comparatively<br />\nHamilton<br />\nLeads<br />\nfender Co. Delivers Illusby Christian W. Dittus, issued its lian M. Wilson; Excavations at Mrsdance to follow the Blue Jay-St. few rules come primarily under<br />\nthe<br />\ntrated Talk<br />\nThe Johns Hopkins Musical Club John's basketball game is tenatively jurisdiction of the Board of Fellows. twenty-ninth volume of the Johns thus, VIII, The Houses Excavated in<br />\nplanned to initiate the \"Renais- To say \"to conduct oneself<br />\n1931 and 1934, by J. Walter Graham;<br />\nas becom- Hopkins Press Bulletin in December,<br />\ncompleting its most successful weekExcavations at Olynthus, IX, The<br />\nsance.\" The significance of Mr. Katz's ing .a gentleman\" would<br />\nDEMONSTRATES<br />\ncover the 1937. The mimeographed schedule<br />\nend of the current season adjourned<br />\nGhalcidic Mint and The Excavation<br />\nremark lies in the fact that socially, ,rules of behavior in the<br />\nDormitory. for the Press in<br />\nDARK ROOM TRICKS its meetings until the new semester. the dormitory has been more or less<br />\nfour pages, men- Coins, 1928-1934, by Paul Clement;<br />\nHealth Officer Appoints •<br />\ntioned facts of meetings, exhibits, the fourth<br />\nvolume of An Economic<br />\nFriday night's concert played be- dormant to date, save for an apThe Honor System prevails in the<br />\nand<br />\nscollegiate<br />\npress<br />\nactivities in Survey of Ancient Rome, edited by<br />\nClub Will Present Expert On fore a near capacity audience at the pearance of the Music Club featur- matter of breakage. One of the memwhich .it participated during the past Tenney<br />\ning<br />\nFrank; The Floating Debt<br />\nthe magnificent voice of Dick bers oftheBoardwasappointed<br />\nNude Photography,<br />\nAnnapolis High ,School, Annapolis;<br />\nHealth year. In addition, those<br />\nvolumes of the Federal Government, 1919Sharretts and the Blue Jay dance Officer. He investigates<br />\nany sickness which were, run<br />\nMaryland, while on Saturday eveFebruary 11<br />\noff by the Press, as 1936, by Edward Raguet Van<br />\nband under the direction of talented and reports it to Dr. Andrews.<br />\nSant;<br />\nUnder well as those in anticipation<br />\nning the club was the guest of Hood Don Hamilton. The event was<br />\nof print- The Effects of Different Degrees Of<br />\npoorly this plan, no one who needs it, will<br />\ning were listed with a short com- Success<br />\nMr. Fred Vaughan, The De- College<br />\nand Failure Upon Uniformfor Women, at Frederick, attended as was the Turkey Trot,<br />\nhe in bed 'without necessary medical<br />\nmentary about each.<br />\nfender Company's pictorial expert,<br />\nity and Variability of Contagious ReFood Has Improved<br />\nattention. This was inaugurated by<br />\nMaryland.<br />\ntreated the Johns Hopkins UniverBoas' Book Leads<br />\nsponses in Serial Learning by Claude<br />\nHowever, chess and ping pong the Board of Fellows this year.<br />\nThe<br />\nDr. George Boas' A Primer for C. Dove; and<br />\nOn both occasions receptions were<br />\nsity Photographic Society to a most<br />\nThe Interrelationship of<br />\ntournaments met with huge success. Board of Fellows also sponsors<br />\nFel- Critics remains the most<br />\npractical darkroom demonstration planned for the entire club. The A piano<br />\noutstanding Drives in the Male Albino Rat. II.<br />\nwas purchased and will be low's Night one night a month when<br />\nvolume of the year for the Press, Intercorrelatio<br />\n• last Friday night. The lecture, which Blue Jay orchestra,<br />\nns Between 47 Messunder'' the placed in the dining room. The idea the residents of the dorms and memand. has been depleted of its first urea of<br />\nwas held in Remsen 101 was atDrives and of Learning, by<br />\ndirection of Don Hamilton furnished being to have several members of hers of the faculty meet for dinner edition.<br />\nA second printing has been E. E. Anderson.<br />\ntended by thirty members and guests<br />\nthe Music Club lead the dorm men and a discussion in the Commons<br />\nmusic ,for the dances. The quartet<br />\nordered.<br />\nof the Camera Club.<br />\nPress Exhibit Prize Works<br />\nIn a song feat at meal times. Inci- Room.<br />\nfashioned in the manner , of Benny<br />\nImportant books on contemporary<br />\nThe Bulletin mentioned that the<br />\ndentally, it has been said that the<br />\nIllustrates Enlarging Process<br />\nVarious cliques have sprung up,<br />\nsubjects -have been forcast, and are Press held<br />\nGoodman was- outstanding among' food is better this year.<br />\na booth at the New York<br />\nin the Dorms this year. Among them<br />\nMr. Vaughan used the negatives<br />\nexpected soon -for review. These are: Times National<br />\nBook- Fair, in comIn the words of Dr. Donald H. are, Mewshaw's \"Storm Troopers\"<br />\nof Charles Zimmerman and Eugene their presentations.<br />\n, Tench Core: A Study in American mon with<br />\nother university presses,<br />\nAndrews, \"the men in the dorms with G.H.Q. in E entry,<br />\nVVIallman, and proceeded to prove<br />\nRemaining on the schedule are<br />\nthe \"Suicide Economic Development<br />\nby<br />\nHarold<br />\nand placed'on view some of its prize<br />\nthat a passably good print could be performances at Roberts Beach have shown great justice, interest, Fleet\" in F entry experienced in the Hutcheson; The<br />\nAgnihotra, by Paul works there. The exhibit, held<br />\nand cooperation\" in the way of dorm- culinary arts (they<br />\nlast<br />\nmade from average, or below avercooked their own E. Dumont; Christian<br />\nSchool for Women,' Marjorie Web- itory discipline which<br />\nMysticism<br />\nin<br />\nNovember,<br />\nwas sponsored by the<br />\nhas been unus- meals Over the Christmas<br />\nage negtives. Using Ziznmerman's<br />\nholidays), the Elizabethan Age, by Joseph Burns New York<br />\nTimes,<br />\nSchool<br />\nster<br />\nWomen,<br />\nand<br />\nfor<br />\nually<br />\nMadden<br />\nthe<br />\ngood<br />\nHall,<br />\nAmerican<br />\nthis<br />\nyear<br />\nunder<br />\nits<br />\nnew<br />\nand,<br />\na mysterious, but harmless, or- Collins;<br />\nnegative of Gilman Hall, he made<br />\nBotivar ahd the Political book publishers. Actual'bookmanua beautiful enlargement from it. Atlantic City, and New York City at form of government. The governing ganization in D entry known as the Thought of the Spanish<br />\nAmerican facture including type-setting, print• Thgn, while using Eugene Wallman's the Warwick Hotel. The home con- bodyrknown as the Board of Fel- \"Set Men.\" While the Jazz Fiends Revolution, by Victor<br />\nAndres<br />\nBeing,<br />\nfolding,<br />\nbinding,<br />\nlows,<br />\nis<br />\npacking,<br />\nmade<br />\nup of seven men chosen hold forth in A entry, the<br />\nand<br />\nshot of the Canadian Rockies, he cert, climaxing the season's program<br />\nconscien- launde; The Monroe Doctrine, 1867shipping were illustrated with workby the administration, and six men tous freshmen study<br />\ndemonstrated the technique of dodgin B entry.<br />\n1907, by Dexter Perkins; The Cloth- ing machines.<br />\nis scheduled for February 25, at the<br />\nnegatives,<br />\ntransing, making paper<br />\nMaryland 'Casualty auditorium.<br />\nseparation<br />\nparencies, and<br />\ncolor<br />\nAccording to<br />\nprints.<br />\nthe<br />\nconclusions<br />\ndrawn from campus opinion, John<br />\nLecturer Answers Questions<br />\nAccompanying Mr. Vaughan, was<br />\nan exhibition of prize winning prints,<br />\nwhich he very kindly borrowed for<br />\nthe lecture from the Philadelphia<br />\nSalon of 1937.<br />\n<br />\nGhingei, president of the club, Oswald Steinwald, Glee Club director,<br />\nand Conrad Gebelein, director of the<br />\nBanjo Club and Hawaiian Troupe,<br />\n<br />\nascertain that the club's performBecause of the small size of the ances<br />\nUlla' year have been received<br />\ngroup, it was possible for all those<br />\nmost satisfactorily.<br />\npresent to ask questions of interest<br />\nto them personally. Mr. Vaughan<br />\nwas able to add a great deal of information in his answers to queries<br />\nposed.<br />\n<br />\nPLAYSHOP OFFERS IRISH<br />\nDRAMA HERE TONIGHT<br />\n<br />\nThe president of the club, Wallman, '40, said, \"It is the wish of the<br />\nclub, that Mr. Vaughan and many<br />\nexperts of his calibre will again be<br />\nable to be presented in the near<br />\nfuture, and that more members will<br />\navail themselves of the privileges extended by the Society to attend these<br />\ndemonstrations, of value both to beginners and advanced photographers.<br />\n\"Nudes\" Photographer Programmed<br />\n\"On February 11th the Society<br />\nwill have the pleasure of presenting<br />\nMr. Harvey Wobbe, one of the foremost pictorial and nude photographers in the country,\" he further announced. Mr. Wobbe represents the<br />\nAgfa Co., and ,will discuss the general subject Of Pictoral photography.<br />\nIt is expected that many members<br />\nof the Baltimore Camera Club will<br />\nalso be present. Mr. Wobbe has addressed that organization earlier in<br />\nthe year, and they wish to hear him<br />\nagain.<br />\n<br />\nDU PONT GIVES SCHOOL<br />\nFELLOWSHIP OF $750<br />\n<br />\nThis evening the Hopkins Playshop will present \"Riders to the Sea\"<br />\nas a part of its meeting entitled an<br />\n\"Irish Evening.\"<br />\nAt the Playshop tonight it will be<br />\n\"An Irish Evening.\" Professor Irene<br />\n<br />\n• ••<br />\n<br />\n64,<br />\n<br />\nMiller of Goucher College will lecture on the \"Irish Drama.\" Her talk<br />\nwill be followed by a one act play<br />\nby J. M. Synge, \"Riders to the Sea,\"<br />\npresented by members of the club.<br />\nMajor Plal,In February<br />\nDirector N. Bryllion Fagin has<br />\nannounced that the major play of<br />\nthe year will be presented in Feb-ruary, The play selected is \"Dance<br />\nof Death,\" by August Strindberg.<br />\nThe principal parts have been<br />\nassigned anthrehearsals have already<br />\nbeen held. The leads will be played<br />\nby: Ruskell Magill, alumnus; Raymond Hammel, student of the Night<br />\nSchool for Technical Workers, and<br />\nJenny Hoffman, a graduate of the<br />\nHopkins College for Teachers.<br />\n<br />\nThe Playshop is directed by Dr.<br />\nN. Bryllion Fagin, associate in EngA Du Pont Fellowship of $750 a lish and its membership is composed<br />\nyear, has been allocated, to the Johns of undergraduates and alumni.<br />\nHopkins University for, post-graduThe purpose of the Playshop is to<br />\nate research in chemistry.<br />\nact as an experimental drama labThe fellowship does not limit the oratory in which the drama can be<br />\nsubject of research to any particular studied and expression given to the<br />\nfield It sponsors investigation in efforts of the members. It is closely<br />\nmost scientific problems relevant to connected with the course in Play<br />\nchemistry in the hope, that tangible Production given by Dr. Fagin. The<br />\nresults will be realized after a num- group plans to present an<br />\noriginal<br />\nber of years of extensive work. How- play in the spring, but has not yet<br />\never, the recipients of the fellowship made its selection.<br />\nwill be assigned a line of investigation by the University.<br />\nFrom the many schools of higher<br />\nlearning all over, the country, the<br />\nHopkins was chosen one of eighteen<br />\nto receive a Fellowship. The others • Leader of the government lawyers<br />\nare: University of Chicago, Columbia Who won the spectacular anti-trust<br />\nUniversity, Cornell University, Har- case in Madison, Wisconsin, last Satvard University, University of Illi- urday, was John Henry Lewin, '21,<br />\nnois, Massachusetts Institute of who was on the Debating Council and<br />\nTechnology, University of Michigan, a Barnstormer while at the Hopkins.<br />\nUriiversity of Minnesota, University He belonged to Omicron Delta Kappa<br />\nof North Carolina, Ohio State Uni- and Alpha Delta Phi.'<br />\nversity, Pennsylvania State College, The decision of the Federal court was<br />\nUniversity of, Pennsylvania, Prince- characterized by newspapers as the<br />\nton University, Stanford University, most important decision of the courts<br />\nUniversity of Virginia, University of -acnee-1910- when the— courts -forced<br />\na breaking up of the Standard Oil<br />\nWisconsin, and Yale Uiversity.<br />\nChemistry majors and graduate stu- Company. ,<br />\ndents in chemistry may obtain furTo Lewin this great victory comes<br />\nther information concerning the du as a welcome wedding<br />\npresent, as he<br />\nPont Fellowship at the Registrar's is marrying Miss Janet<br />\nGorden KeiOffice.<br />\ndel next month.<br />\n<br />\nThis<br />\n<br />\nshown electric<br />\ndetective<br />\n..•wi<br />\nsensitive below<br />\nth its 20<br />\nfingers \"fee<br />\nls\"<br />\nChesterfield and<br />\nevery<br />\nthe<br />\nentire<br />\nrette is package ithrovvs<br />\nf one out<br />\nciga••.justdefective<br />\none of<br />\n<br />\n•<br />\n<br />\nthe<br />\nChesterfield doe tomany things<br />\ns give<br />\na<br />\nbetter<br />\nyou<br />\ncigarette.<br />\nEverything<br />\n<br />\nthat<br />\nahout is.<br />\nused<br />\nSciento<br />\nknote's<br />\nfields<br />\nmilder and make Chester.<br />\nbetter<br />\n-tasting.<br />\n<br />\nWeekly<br />\nRadio Features<br />\n<br />\nHopkins Grad Wins<br />\nBig Anti-Trust Case<br />\n<br />\nLAWRENCE TIBBETT<br />\nANDRE KOSTELANETZ<br />\nPAUL. WILITEMAN<br />\nDEEMS TAYLOR<br />\nYAVL DOUGLAS<br />\n-<br />\n<br />\nYoafind MORE MASURE<br />\n<br />\nin Chesterfields'<br />\nmilder better taste<br />\n( ops zg lit 193S, !ALA., I,<br />\n<br />\nMI.!, I<br />\n<br />\n',LC° CO.<br />\n<br />\np.<br />\n<br />\n\f", "format": "basic_html", "processed": "1<br /><br />\n'.,00111-tg iOrtpitins Nrtufetekttrr<br /><br />\nTry Out<br />\nHonor System<br /><br />\nSee Jays<br />\nBeat Teachers<br />\nTonight<br /><br />\nZ 275<br />\nVOL XLIII, No. 19<br /><br />\n_ems.<br />\nPRICE 5 CELN7111<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1938<br /><br />\nFIVE-FOUR COUNT ON Y. C. L. ASSEMBLY<br />\nBLUE JAY HOOPSTERS HONOR COMMISSION<br />\nCOTILLION BOARD<br />\ng<br />\nMINORITY SUBMITENCOR<br />\nMAJORITY,<br />\nASSIGNS<br />\nSTATE<br />\nFOUR-MAN<br />\num<br />\nWILL BRING CASA<br />\nTEACHERS TONIGHT CONSTITUTION BODY REPORTS; Rims, GRAHAM,<br />\nLOMA ON MARCH 1<br />\nTHE KEMPTONS FILE DISSENT<br />\nJanuary Blue Jay<br />\nDistributed Friday<br /><br />\nSecond Cotillion Will Feature<br />\nGlen Gray's Orchestra<br />\nAt Alcazar<br />\nCOST OF TICKETS<br />\nNOT YET DECIDED<br />\nOrchestra Comes From Extended Popular Engagement At New Yorker<br />\nBy vIcroR NTICTOROFF<br /><br />\nThe January issue of the Blue<br />\nJay, monthly magazine published.<br />\nby the undergraduates of the Hopkins will be delivered on Friday<br />\nto subscribers. The issue is called<br />\nthe\"Pre-Exam Number\" and plans<br />\nits cover to express that motif.<br />\nIn its experimental stage the<br />\nJay's editors have innovated several<br />\nnew features this issue, and eliminated others whose popularity<br />\nwas not up to par.<br />\nAnnouncements by the Jay's editors concerning interviews to business staff candidates will be made<br />\nas soon as the possibility of a scale<br />\nof commissions is examined.<br /><br />\nTowson State Teachers<br />\nSeek Revenge For<br />\nPrevious Defeat<br /><br />\nJ. Judge Mehling, Arthur<br />\nMaas, Frank' Butt, And<br />\nJohn Crunkleton Chosen<br /><br />\nOdds Favor Hopkins<br />\nTho' Teachers Show<br />\nImprovement<br /><br />\nResolutions Decided Upon<br />\nAt Meeting Tonight<br />\nWill Effect Exams<br /><br />\nOFFICIAL DECISION LARGELY BASED ON<br />\n'SECRECY' OF COMMUNIST MEMBERSHIP<br /><br />\nCommencing work in their conMinority Charges \"Discrimination\"; Council Stand<br />\ntemplated sphere of activity, the<br />\nIndicts Political Character Of Organization<br />\nArts and Science Student Honor<br />\nHopkins<br />\nTowson<br />\nCommission appointed a constituMelvin<br />\nAusterlitS<br />\nF<br />\nTEXT OF MAJORITY AND MINORITY REPORTS ON THE<br />\ntion committee of four men to formWheeler<br />\nTraggis<br />\n•<br />\nYOUNG COMMUNIST LEAGUE ON PAGE 2<br />\nulaie a_ governing body under which<br />\nOn March 5, the Cotillion Board<br />\nMoore<br />\nCox<br />\nC<br />\nThe Student Council split five-to-four on the question of granting<br />\nit<br />\ncould operate, at its second meetwill offer to devotees of stamp and<br />\nBasin (c)<br />\nStottlemeyer<br />\nG<br />\ning last Friday at four p.m. A def- the Young Communist League an assembly,<br />\ntromp the Second Cotillion featuring<br />\nit was learned late Monday. The<br />\nCurland<br />\nMcLain<br />\nG<br />\ninite plan, as regards the Honor exact vote by<br />\nGlen Gray -and his Casa Loma Orwhich the Y. C. L.'s request was rejected became public<br />\nRevenge is sweet! This thought wil Commission's relations with the<br />\nchestra. lhe dance will be held at<br />\nwith<br />\nthe<br />\nissuance of an official majority report and a dissenting opinion<br />\nthe Alcazar with the first notes<br />\nspur on the Towson State Teachers Honor System was also decided upon.<br />\n*signed ,by four of the nine members<br />\nsounded at ten p. m. and curfew at Former Ambassador To Ger- quintet against the Blue. Jays when On the four-man constitution comof the Council.<br />\nmittee was appointed one representthree.<br />\nthey meet on the Teachers' court tomany<br />\nAttack<br />\nWill<br />\nThe<br />\native from each class. Serving on the<br />\nThe date of the dance and other inWilliam Erlanger, '38; Carl Basnight<br />\n,at<br />\nThe<br />\n8:30.<br />\ntall<br />\nBlack<br />\nand<br />\nNazi Regime<br />\ncommittee are J. Judge Mehling, '38,<br />\nformation concerning the choice of<br />\nA reasonable and intelligent analy- in, '38; Vernon Ivins, '38; Edward<br />\nBlue five trounced Towson in the for- Arthur Maass, '39, Frank Butt, '40,<br />\ntile Casa Loma swingsters was ansis of the Y. C. L. assembly probClautice, '38, and Frank Baker, '40,<br />\nnounced by J. Judge Mehling, '33, in<br />\n\"Truth In History\" Will Be mer's opening game 37-30, at Hop- and John Crunkleton, '40. A rough lem brings us to the conclusions that:<br />\nbehalf of the Cotillion Board, over<br />\ncomposed the majority. William B.<br />\nkins. But since this game will take draft of the constitution planned by<br />\n1. The decision itself is \"prejudicial<br />\nSubject<br />\nAt<br />\nCasualty<br />\nthe week-end. Mehling admitted that<br />\nthe committee is to be presented at to the honor of<br />\nthe University\" and Kempton,'38, president‘of the Counplace on their<br />\n. home floor,,the Teachthe choice of orchestra was made<br />\nAudiorium<br />\n• ers are confident of reversing the la/it the Commission's meeting today.<br />\nhence the Student Council has acted -ell, Harlan Graham, '38, Harold<br />\nafter \"great deliberation and discrim• Discussion And Decisions<br />\nagainst the best interests of the Hop- Ricards, '39, and J. Murray Kemp.<br />\nination by the Board.\" He established,<br />\nTomorrow night William E. Dodd score.<br />\nHaving appointed its constitution kilts and against a principle which ton, '39, filed a dissent.<br />\nfurther, the hope that Hopkins dance will speak at the Maryland Casualty<br />\nit<br />\nwas elected to uphold.<br />\nAccording to experienced observ- committee the Commission opened a<br />\nfans would approve of the selection auditorium on \"Truth in History.\"<br />\nMajority Cites Secrecy<br />\n2. The Student Council action in<br />\ners, the Towson lads stand a good discussion of various points to be<br />\nby their presence on the floor March<br />\nLast month Mr. Dodd resigned as<br />\nThe majority opinion, designed to<br />\nemphasized<br />\nby<br />\nthe<br />\nreleasing<br />\nconstitution.<br />\nthe<br />\ndecision<br />\nas it did was<br />\n1. \"Every ticket sold is a vote of ap- Ambassador to Germany stating chance to taste sweet revenge, as the<br />\nanswer charges brought last week by<br />\nBearing in mind its original inten- cowardly and unfair.<br />\nproval for our pick, and a pass to a lack of confidence. Friction between Blue Jays have been playing good<br />\ntion of not becoming \"policemen,\"' In its shaky, evasive letter on page Walter Schlesinger, spokesman for<br />\nglorious evening of swing-time!\"<br />\nMr. Dodd and the Nazi regime had ball spasmodically. Towson has al- the<br />\nCommission proposed several two, the Student Council offers argu- the Young Communist League, cited<br />\nCame From Hotel New Yorker<br />\ndeveloped to the point of mutual ready chalked<br />\nup seven victories, means of securing student coopera- ments Which leave one with a dis- both<br />\nthe secrecy of the organization's<br />\nCasa Loma, hot from an extended protests before last summer. Early<br />\ntion in its drive to strengthen the gusted expression of \"Why in the<br />\nwhich<br />\nincluded<br />\nlast<br />\nweek's<br />\nshellackengagement at the Hotel New in the fall he tendered his withmembership and its political nature<br />\nposition of the Honor System.<br />\nworld<br />\ndon't<br />\nthey<br />\ncome<br />\nright<br />\nout<br />\nand<br />\ning<br />\no4<br />\nGallaudet,<br />\nwhom the Jays just<br />\nYorker, comes featuring \"the fast- drawal; he was relieved last month.<br />\nas grounds for rejecting the request,<br />\nA plan was suggested and passed say that they are denying the Y. C.<br />\nest brass section in the business,\"<br />\nIn his talk tomorrow night at 8:15 barely nbsed out. The Towson team<br />\nfor an assembly.<br />\nsay wiseacres. They cast haloes he is expected to excoriate the total- has been improving right along and apon whereby this end could be ac- L. the right of an,aaak*Sbky because<br />\ncomplished. However, due to the fact any speaker offered byt this organi- \"Thip is,\" said the report, \"no<br />\nat Sonny Dunham, a cornetist \"in itarian state as he has in previous<br />\nnow look at Hopkins as her real State that not until today's<br />\nmeeting will zation will be a Communist?\"<br />\nUse manner of the late, great Bix rspeeches.<br />\ndeviation from principle in refusing<br />\nrival; pointing particularly towards final details be arranged, the ComHowever, to be polite and convenlieiderbecke,\" Grady Watts, trump- I<br />\nHis charges against Hitleir are<br />\nto extend the courtesy and attending<br />\nmision has been unable to release tional we will show that even if these<br />\ntonight's contest.<br />\neter par excellewe, Peewee Hunt, dic- mainly these:<br />\ninformation as to its complete opinions are taken at face value, ex- responsibilty of the assernoly plattator of trombone tempo today, and<br />\n1—intolerance is suffocating GerZone Defense Difficult For Jays<br />\namination Will show their sieve-Ike forni to Mr. Slesinger, who alone<br />\nscheme.<br />\nHal White, polisher of the piano keys. man genius.<br />\nIn the last encounter, the Jays had<br />\nconstituted the admitted membership<br />\nThe Commission has also definitely qualities.<br />\nThese are all soloists in their own<br />\n2—political opponents are being<br />\nserious difficulty in piercing the Tow- decided that<br />\nJust who is to determine what in a<br />\nfirst steps of any sort<br />\nright, and have done no little to put Inhumanly slaughtered.<br />\nof the Young Communist League.\"<br />\nson zone defense. Hopkins displayed of movement will go into effect this legitimate organization? Is it not a<br />\nCasa Loma at the top of the heap of<br />\nHis brief against the totalitarian<br />\nThe majority also announced a<br />\n\"individuality,\" while the Teachers Coming exiinination period. Upon source of pride ,that Hopkins activirecord-breaking puller-inners. The ad- state includes<br />\nan interpretation of<br />\ndefinitely accepting any proposals, ties are run by the students who com- policy \"of maintaining. an educadition of the names, Pat Davis, tender history. Having<br />\nbeen professor of had the better team play. Austerlitz,<br />\nall facts are, to be made known to pose their own rules of election and tinnal, -non-political program in stutenor, and Pete Hutchinrider, clarin- hititory<br />\nat the University of Chicago Stottlemeyer, and Curland slipped by<br />\nrunning? And is not the secret ballot, dent assemblies. If the<br />\nthe Student Body.<br />\netist clarissime, give us a complete from 1908<br />\nCouncil were<br />\nuntil his appointment as the Hopkins defense fairly consistentthe right of silent opinion sacred to<br />\nroster of attendance on the Board of Ambassador<br />\npetitioned by the Young Democrats<br />\nin 1933, and president ly to keep the Teachers always in the<br />\nour<br />\ndemocratic<br />\nprinciples?<br />\nFun Directors.<br />\nof the' American Historical AssociaIt ,would be forced to refuse on<br />\n.The Communist Party is a perfectgame. Towson led at the half.<br />\nGrey Is President<br />\ntion in 1934, he is singularly qualily legal political organization which the same grounds,\"<br />\nGlen Gray himself, elected in Feb- fied to present<br />\nthe case.<br />\nNorm Melvin led the Hopkins atoffers candidates for election. Just<br />\n\"Discrimination,\" Says Minority<br />\nruary, 1937, as president of the Casa<br />\nAdmission to the lecture will be tack in the<br />\nIll with a fever which he appar- as we believe that the Young Demoprevious contest, while<br />\nLoma Orchestra wields a baton that free under the James<br />\nIn its dissent the minority exSchouler<br />\nently contracted in Australia, Dr. cratic Club has the right to demand<br />\nMcLain<br />\nshowed<br />\nbrilliant<br />\nfloorwork.<br />\nhas carried the corporation higher Foundation for -history lectureships,<br />\npressed the opinion that the decision<br />\nIndividually, the Black and Blue George E. Barnett, professor of polit- assembly, so has the Young Commuand higher on the wavy crest of their Mr. Dodd having<br />\nbeen obtained<br />\ndiscriminated against a group of inwere the better basketball players, ical ecci&amp;my, away since November, nist League.<br />\nlightaome rhythm since its in- through the /cooperation<br />\nof the poWe can well understand, with con- dividuals, \"whom we think should<br />\nbut.it is feared that the Teachers Is sailing to Baltimore, where he is<br />\nception, 1929. Aniong records held litical<br />\nscience department. Dr. Isaiah<br />\nhave Aproved rapidly with their busy going ,to undergo treatmept at the ditions as they are on this- campus have been accorded the same priviin their trophy case are: occas- Bowman will<br />\nintroduce the speaker.<br />\nschedule. If the Jays are \"on,\" there Johns Hopkins Hospital. The'specific and elsewhere, why the members of leges as were granted<br />\nional listings at the exclusive The Maryland<br />\nto other<br />\nCasualty Auditorium<br />\nwill be no difficulty, but that is a nature of his illness was not revealed. this organization keep their affiliaRainbow Grill, designated the honor is at 40th/Street<br />\ngroups of individuals gathered in orand Keswick Road.<br />\nby the account in the .Sunday Sun. tion secret.<br />\nquestion yet to be settled.<br />\nof opening the Congress Casino in<br />\nganizations like Omicron Delta KapSunday/ Mr. Dodd spoke at the<br />\nProfessor Barnett was planning to<br />\nBut why the sudden interest in<br />\nChicago, netted biggest gate at Cali Madison ,Avenue Temple, taking<br />\npa, Tau Beta Pi, the American Stu\"Is<br />\nSo, tho' the odds favor the Blue devote his sabbatical year to''-a study membership? Did the<br />\nStudent. Counfornia's Palomar Ballroom, twice There Any Chance for Christianity?\"<br />\ndent Union ,and similar campus<br />\nJays, tonight's contest will be, as ob- of labor legislation in Australia and cil ever bother<br />\nbefore to investigate<br />\nholders of New York Paramount The- for his<br />\ngroups.\"<br />\nsubject. Earlier Wednesday servers claim, a bitterly fought bat- New Zeaja_nd itek wa-!__ not<br />\n15,2.—AVe cannot consider this point<br />\natre's rating as most popular.orches- he is scheduled--to'appear4eiore the<br />\ntle up to the final Whistle.<br />\nback for several months.<br />\nThe minorityport expressed -a<br />\n,as<br />\nanything_but.<br />\nanother straw man<br />\ntra to--come to that Broadway graduate seminar of the departments<br />\nfurther conviction that \"the relative<br />\nsubstituted for. the real issue<br />\nway movie palace, and swinging the of poltical science<br />\nand history.'<br />\nIf the Council objected to'a politi- merits or defeta of an organization<br />\nmassed clientele at the Terrace Room<br />\nSpeaking at ,a testimonial dinner<br />\ncal discussion—an'objection we con- or its platform should not determine<br />\nof the Hotel New Yorker for an \"in- at the Waldorf Astoria Hotel in New<br />\nsider<br />\nunenlightened—why was this whether an Assembly should be<br />\ndefinite run.\"<br />\nYork on December 7, he first begin<br />\nfact. not communicated to the Y. C. granted.\" The way was also left<br />\nHis appearance at the Alcazar his bitter denudation<br />\nof the Nazis.<br />\nopen for an addreiis by any speaker,<br />\nL. instead of the fiat rejection?<br />\nMarch 1 will be his first in. Baltimore He declared them a retrogression in<br />\nwho \"sees fit to criticize . . the<br />\n(Continued on Page 3, Col. 1)<br />\nWe have been able to uncover grey a man's hair immeasurably.<br />\nthis year. After the engagement here, history, and said that they are<br />\na<br />\nY.C.L.\"<br />\nsome rather epoch-making explanaImagine Benson's disconcernment<br />\nhe will go to Florida to play at one pernicious threat to civilization.<br />\ntions<br />\nof<br />\nwhy a trainer's %Lair turns and chagrin when he found his bed<br />\nof<br />\nthe<br />\nhotels. Following<br />\nbig<br />\nThe Y.C.L. issue came to a head<br />\n\"Now he is more absolute than<br />\nthis, the orchestra will include a tour any medieval emperor of Germany,\" grey. Noticing a peculiar ashen sheets went only half Way down the<br />\nlast week when the organization, in<br />\nof the West Coast for the summer Mr. Dodd described Hitler. \"Under glint in Mr. James , Benson's upon bed and stopped. Some sneak had<br />\nan open letter published in the Janmonths.<br />\nuary 21st issue of the \"News-Letter,\"<br />\nhim almost as many personal oppo- his return from the West Point \"pied\" the thing. It is a little farFirst Lieutenant Frank Forney of demanded that the Student Council<br />\nnents were killed in five years as trip, our curiosity was Lnflamed and fetcheci to think that he'might have<br />\nwe<br />\nnow<br />\nproudly<br />\ndisclose<br />\nfindings.<br />\nour<br />\ntaken- on some tattle tale grey in the United States Army \"Engineer show \"justification for denying . . .<br />\n,'harles ll executed in twenty.\"<br />\nMr. -Benson began by acquiring a his hair while investigating the why Corps will come to the HOpkina in a legitimate campus organization the<br />\nlight grey before the train had ever of the situation, but we must Con- the last part of February. Be right to sponsor an assembly\" The<br />\nleft the station. It wasn't age that sider every possibility.<br />\nwill take the place of Captain group also charged \"dilatory\" handThe Junior Prom is fading further<br />\n\"snowed white hairs,\" it was a marProceeding to the final episode, it Parker M. Reeve, who is now sta- ling of its \"simple request,\" which,<br />\nand further into the hazy fiaure<br />\nriage celebration and a hail of badly happened in the dining room. Benson tioned at the U. S. Engineers' Office it claimed, was made more than a<br />\nLatest developments call for a small<br />\nDr. Tracy Sonneborn's discovery aimed rice. A few absent - minded was admiring the crystal clearness at Duluth, Minnesota, in the. dis- month and a half agd.<br />\ndance either in April or June. There , of sex in paramecium has been listed missteps and he was in it. Oh how of a piece of ice in his glass. bursing officer's department. Captain<br />\nwill he no Prom in February, accord, ,1 as one of the outstanding scientific the storm did beat.<br />\nTitters were running around like Reeves had been here since 1934.<br />\nNYA REPORTS ARE DUE<br />\ning to William Erlanger, chairman achievements of 1937, it was anAnd Mystery!—At the hotel at wildfire in a windstorm. Then BenLieutenant Forney graduated from<br />\nof the Student Council.<br />\nnounced in a recent issue of Science, West Point, Benson was called by a son discovered the ice was a glass !he United States Military Academy<br />\nMiss Judge has announced that<br />\nConflict with the second Cotillion official publication of the American sad-- vdida-d- jiff% - Mason, who wanted -iube. The psychological effect on in .1929. After graduation he was<br />\nall N.Y.A. time reports should be<br />\nhas definitely reversed the original Association for the Advancement of him to help revive a badly bruised those golden locks must have been stationed in Panama with the 11th<br />\nhanded in this week. For graduplan of a dance in February.<br />\nColgate boxer in room 210 (we are 'rivastating. Suppose, while he was Engineers. He is at present in the<br />\nScience.<br />\n,ate students, the date' is ThursIf the Inter-Fraternity Board or<br />\nDr. Sonneborn, now Associate in a demon after facts). An inquiry at<br />\ndisbursing officer's department in<br />\ndraining<br />\nthe<br />\ndrop,<br />\nhad'<br />\nlast<br />\ncube<br />\nthe<br />\nJanuary 27; for undergradu(lay,<br />\nthe Senior Class can be persuaded to , Zoology, received his PhD. degree at the desk a few moments later and<br />\nDuluth, where Captain Reeve is staates, Friday, January 28. Reports<br />\nmove their affairs ahead there may ' the Hopkins in 1928, and worked Benson found to his horror that both slid down the. side of the glass and tioned. His appointment has placed<br />\nmust be in the Bureau of Apbe room for the Prom in the<br />\nhere for two years as a National Ir. Mason and his team was a phan- batted him in the nose. The very two Engineer officers in the ROTC<br />\npointments dffice before 5 p.m.<br />\nweek of school.<br />\n•<br />\nResearch Fellow.<br />\ntom. It is mysteries like these that thought of the thing is appalling.<br />\noffice instead of the customary one.<br />\nBy MILT ALPERSTEIN<br /><br />\nWILLAIM E. DODD<br />\nTO SPEAK TOMORROW<br /><br />\nEDITORIAL<br /><br />\na<br /><br />\na<br /><br />\nBarnett, Ill, On Way<br />\nHere From Australia<br /><br />\nWest Point I/ isit Is Hair-Greying<br />\nTrip For Trainer Jimmy Benson<br /><br />\nFRANK FORNEY WILL FILL<br />\nVACANCY IN ROTC STAFF<br /><br />\nAPRIL JUNE TENTATIVE<br />\nBATES FOR JUNIOR PROM Dr.Sonneborn Called<br /><br />\nOutstanding Scientist<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1938<br /><br />\nT1its1)115 ji)opktug<br />\niletus<br />\n•<br /><br />\nletter<br />\nFounded 1897<br /><br />\nSubscription per year<br />\nBy Mail<br /><br />\nIn the Philadelphia Record<br />\non Sathrday appeared an<br />\naccount of the costly bravery of the Abraham Lincoln<br />\nBattalion at Teruel, its attempts to save Loyalist<br />\ntroops trapped in fortifications. Their losses were terrific, and even General<br />\nFranco payed tribute to their courage, saying they<br />\nwere the best troops his enemies had.<br />\nThe heroism of these men in the front lines of the<br />\nanti-Fascist forces should not be considered stupid and<br />\nself-sacrificing. On the other hand, it should show ,us<br />\nmore clearly in, what peril a'free government eleeted<br />\nby the people has been placed, when their mainstays<br />\nare \"advanced\" or \"proletarian\" democrats from other<br />\nrepublics. Especially when the ideas of these men when<br />\ntranslated into practice would mean dictatorship. It's<br />\na riddle, but democracy in Spain does not mean clergy,<br />\nand Moors backed by Nazi.'end Fascist auxiliaries.<br /><br />\nHeroes<br />\nAt<br />\nTeurel<br /><br />\n•<br />\n-. $2.00<br />\n... $2.50<br /><br />\nRemit subscription fees to Treasurer. Student Activities Council,<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as sec.d class matter December 3, 1909,<br /><br />\nat the postoffice<br />\nin Baltimore Md., under the Act of Congress, Novernber 3, 1879. •<br /><br />\nLETTERS TO 1 Communist<br />\nT-HE EDITOR<br /><br />\nLeague Is Answered<br /><br />\nMajority And Minority Report On Banning Young<br />\nThe Student Council turned the folCommunist League Assembly Speakers<br />\nlowing over to the NEWS LETTER<br />\nfor publication. Editorial comment To the readers of the NEWS-LETTER: campus in regard to the action of<br />\nin Column Two.<br />\nIn a letter written to the Student the Student Council in refusing an<br />\nDear Sir:—<br />\nCouncil, which appeared in the Janu- assembly to the Young Communist<br />\nA small group of . newcomers to ary 21st issue of this paper, Mr. Sles- League;-the Darnell issued a report<br />\nHopkins have been watching with inger, alleged leader of the Johns to the campus in defense of their<br />\ninterest, the attempts of the Council Hopkins Chapter of the Young Com- action. However, this was merely<br />\nto cope with ,the Honor System situ- munist League, asked for a statement the report of the majority in that<br /><br />\nation at our School. Due to the spirit explaining the rejection of his ap- vote taken, which by majority rule<br />\nwhich prevails in regard to freshmen, plication for an assembly.<br />\nwas the instrument of the defeat for<br />\nwe felt that any suggestions we could<br />\nMr. Slesinger said that the Student Y.C.L. proposed assembly. Snide the<br />\n•<br />\nEDITORIAL STAFF<br />\noffer would be welcome. Therefore Council owed such an explanation to action<br />\non the part of the Council<br />\nStanley Finkel<br />\nEditor-in•Chid<br />\nWe would Ike ..to present our plan, the League and to every member of was by no means<br />\nJ. Murray Kempton, Wethered Barroll, Jr.<br />\nManaging Editors<br />\n\"Lack of confidence\" is a<br />\nunanimous , the<br />\nBenjamin Root .<br />\nAssociate Editor<br />\nthe<br />\nstudent<br />\n'body,<br />\nhappens,<br />\nAs<br />\nit<br />\ndiplomatic sublety that designed to return the Honor System<br />\nminority of four of this body wishes<br />\nSeymour Sacks<br />\nFeatlife Editor<br />\nhowever,<br />\nCouncil<br />\nStudent<br />\nhas<br />\nbeen<br />\nmeans more than mere in- to the status, we are told, it once<br />\nJ. C. Handelsman, Victor M. Vietoroff<br />\nAssistant Managing Editors<br />\nunable to determine who are the to issue, this statement representaHarold Zheutlin<br />\nSports Editor<br />\ndifference. It contains a had.<br />\nMembers of this League to whom it tive of the feelings ef this minority.<br />\nArnold Giant; Nathaniel 'Finkelstein<br />\nActing Sports Editors<br />\nbarb.<br />\nWhen William Dodd<br />\nCharles Diggs, Milton Alperstein<br />\nAssistant Sports Editors<br />\nYour latest plan calls for the ob- owes an explanation, and hence it<br />\nWe feel that in voting for the<br />\nresigned his ambassadorship<br />\nMal Boshnack,<br />\n_Eschangs• Editor<br />\nfinds<br />\nitself under these circumstances Y.C.L.<br />\ntaining<br />\nof<br />\nthat result through the<br />\nassembly we were acting perto Germany on these<br />\nREPORTERS<br />\nincapable<br />\nrendering<br />\nsuch<br />\nan<br />\nacMel Taymor, '40; Morris N.l'essel, '39; Leoliard Quitt, '40;<br />\ngrounds, lack of confidence represented a very deep activities of a special commission<br />\nsonally and collectively in the best<br />\nDaniel Stone, '39; Zeana Baum, '38; Call Resin, '38;<br />\ncount. To you of the undergraduate<br />\nseated<br />\nrepugnance for the Nazi regime. He had been whose' duty it will be to induce the<br />\nLester Rosenthal, '38; Leonard Rubinger, '38; Thom.<br />\nstudent body (which incidentally does interest of the student body which<br />\nMcElhiney, 41, Seymour Rubin, '40; Kessr4h Maxey. Jr..<br />\nin Germany since 1933 and a breach had slowly widened Student Body to be its own<br />\n'39; Irving Milberg, '39; Herbert Kleinfeld. '41; John<br />\npolice not include the spokesman of the we represent. Our feeling was<br />\npurely<br />\nIligham. '41; Sheldon, '39.,<br />\nbetween himself and the German officials. He refused<br />\nforce. .<br />\nYoung Communist I0eague), who may an .all democratic one of<br />\n'<br />\nBUSINESS STAFF<br />\nto hear Democracies continually denounced at Nazi<br />\nunbiased<br />\nbe<br />\ninterested<br />\nin<br />\nand<br />\nwho<br />\nhave<br />\nevery<br />\nMelville Locker<br />\nThere<br />\nare<br />\nseveral<br />\nfacts<br />\nopinion<br />\nthat<br />\nin view of all facts that were<br />\nwill<br />\nmeetings and so he refused to attend them. Gradually<br />\nhis loathing for the Nazi grew so intense, he came into we believe, make the success:of this right to know the motives and ac- presented at that time and<br />\n.have<br />\ntions Of your elected student govern1937<br />\nopen conflict with them. The German government plan impossible. First, the Student.<br />\nment, the Student Council makes the subsequently been presented up to<br />\nformally protested, and he answered by handing in his<br />\nCouncil and its work is unfortunately,<br />\nnow.<br />\nlowing statement.<br />\nresignation and coming home.<br />\nlooked upon as something entirely<br />\nIt is our feeling that the relative<br />\nFirst, Mr. Slesinger says that the<br />\nWhen we examine Mr. Dodd's past record, nothing<br />\nforeign to the lower classmen. Why<br />\n1,87<br />\nY. C. L. is a legitimate campus or- merits and defects Of the organ4a/Amber<br />\nspeaks more highly for him. The integrity of the forethis should be so, we don't know. ganization.\"May we state at this point lion or its platform should not<br />\ndeign service is certainly recognized, especially the inThese lower classmen just think of that no organization the membership termine whether an assembly should<br />\ntegrity<br />\nof<br />\nthe<br />\nforeign<br />\nservice<br />\nin<br />\nthe,,<br />\nmost<br />\nimportant,<br />\nDieenhutor of<br />\nthe Council as an institution to be and activities of which are held secret be granted or whether an assembly<br />\nembassies in a shrewdly diplomatic Europe. In this<br />\nshould be turned down. In the event<br />\navoided, possibly to be feared and from student body and administracase they picked a professor of American history at<br />\ntion alike can claim to belong in such that an organization or an indiviotherwise to be left unnoticed. SecondANSI,NTRO row N•11014•L<br />\ndual saw fit to criticize Mr. Browder<br />\n••<br />\na<br />\ncategory.<br />\nthe University of Chicago, who had had tremendous<br />\nly, the Student Body will not put up<br />\nor the Y.C.L. we see no reason why<br />\nN ationaI Advertising Service,Inc.<br />\nbackground in practical affairs, during and following'<br />\nSecond, one of the functions of the<br />\nC011af l'ablnhon<br />\na request for an assembly<br />\nwith any form of police force in<br />\nshould<br />\nthe Great War.,<br />\n420 MADISON AVE.<br />\nStudent Council 'is to supervise stu• •<br />\nNEW YORK. N. Y<br />\nnot be granted. We would have comCHI( A4,1 • LOS A•ori Fs - SAN FRANCIS!<br />\nwhich a select group only are mem- dent assemblies. In the<br />\npast, the counThis man stomached as much as he could of the Nazi<br />\npelled<br />\nno<br />\nstydent to hear Mr.<br />\nbers. Thirdly, no nian will report 2il has either provided for the, proTUESDAY, JANUARY 25, 1938<br />\npolicies, until they so disgusted him he revolted.<br />\nBrowder.<br />\ngram itself, or has turned the assemMr. Dodd's talk tomorrow night will be the report another if he knows that such an act<br />\nWe feel that the majority vote<br />\nbly over to some recognized campus<br />\nIt seems strange that the of an enlightened person Who was in a first hand posi- may lead to exputsion.'<br />\ndiscriminates against a group of inorganization that has applied for it.<br />\nBarnstormers should com- tion to observe. Why he blisters the Nazi regime is<br />\ndividuals Whom we think should have<br />\nOur plan, we think, overcomes these The<br />\nome<br />\n4,<br />\nassembly has never been turned<br />\nplain of lack of support surely worth hearing.<br />\ndifficulties. In the first place, it is over to a single individual, graduate been accorded the same privileges as<br />\nfrom the student body after<br />\nwere granted to other groups of<br />\nn<br />\ninpersonal, i. e., its carrying out is put or undergraduate for any purpose<br />\nThose<br />\nwho<br />\nread<br />\nthrough<br />\nviewing the reception that<br />\ndividuals gathered in organizations<br />\nBernstein's letter to the Stu- up to each member of the 'Student whatever. Hence there is no devia- like Omicron Delta<br />\nwas accorded that group'<br />\ntormers<br />\nKappa, Tau Beta<br />\ntion from precedent in refusing to<br />\ndent Council printed on this Body individually. Secondly, the police<br />\nlatest effort. Whether or not<br />\nPi, The American Student Union<br />\nand<br />\nextend the courtesy and attending reit was \"due to luck --as Mr. Swyer puts it—that \"Boy<br />\npage will immediately see force to be _let up is the ideal type—<br />\nsimilar campus groups.<br />\nsponsibility<br />\nof<br />\nthe<br />\nassembly<br />\nplatMeets Girl\" played to a full house is perfectly irrelethe wrong track<br />\ns on in one containing all the students. Third,<br />\nform to Mr. Slesinger, who alone<br />\nvant. The fact remains that it did, and if the 'Stonyiers<br />\nan attempt to refo<br />\nthe teporting a violator will ninety-nine<br />\nHonor System. Alread there I times out of a hundred not lead to constitutes the admitted- membership<br />\nwish to lay this to the generosity of the spirits, instaad<br />\nof the Young Communist League.<br />\nof to their own drawing power, then they certainly have are enough students sworn to uphold the Syst . The I expulson or any other type of penalty. Should the<br />\nStudent Council break<br />\n\"police force\" nature would hardly be altered for the<br />\nI<br />\nhope<br />\nyou<br />\nare<br />\nstill<br />\ninterested<br />\na right to do so.<br />\nthis precedent, it would open itself<br />\nbetter by this active body, which would conflict with the.<br />\nenough<br />\nto<br />\ncarefully<br />\nread<br />\nas<br />\nthe<br />\nplan<br />\nto the request of any person who<br />\nAs to the.\"gOod publicity,\" which, it is claimed, they work of the newly-formed Honor Commission.<br />\nWe are told that we live in .a<br />\nI shall now expound it. We build up might ask for an audience<br />\nin the name democracy. Sometimes<br />\ndid not get, the 'Barnstormers have no one but themwe wonder.<br />\nWe suggest the Council' ignore the letter insofar as an organization in which membership<br />\nof a secret organization comprised of When we look<br />\nin, the direction of<br />\nselves to blame. Although the NEWS-LETTER cooper- its practical parts are concerned. They could if put into involves only the signing and keeping<br />\nuntold numbers of evanescent mem- Jersey City,<br />\nour doubts surge up<br />\nated in every possible way in helfoing the show to suc- effect, nip in the bud any student acceptance of a real up of a pledge. Students are approach- bers.<br />\nanew.<br />\nceed, the same conditions did not hold good off the Honor' System again. The fact--that- this \"executive'ed personally and individually by stuThere- seems to have been nothing<br />\nThird, another precedent that the<br />\nbranch of six\" is not duly elected by the students takes dents. who are already in the organicampus. Professional newspapers do not offer up their<br />\ncouncil does not wish to break, is that in American politics for a long time<br />\naway considerable prestige.<br />\nzation; they are explained the matter<br />\ncolumns on a silver platter. You've got to battle with<br />\n,f maintaining an educational, non- as utterly inexcusable as the Stand<br />\n*However, the Council should take into account the vi hand; and they are.asked to sign the<br />\npolitical program at the student as- that Mayor Hague of Jersey City<br />\n'every editor and columnist in town before he'll print spirit behind the letter. It shows a reawakening of t pledge.<br />\nWhen they do so, they are<br />\nsemblies. If the Council were petition- has'taken . against the. C.I.O. In our<br />\none slug of type .about your show. It's time the'Barn- moral sense that we hope will spread.<br />\nexpected to adhere to the Honor:Sysed by the Young Democrats or by the short lifetime, certainly, we have<br />\ntem, get others to signpledges, and<br />\nstormers learned that publicity does not come .to him<br />\nnever • witnessed such -brutal muzWe have been seri-61161y themsehrlk, report to the executive Young Republicans, even were the '<br />\nwho waits.<br />\nzling of legitimate public opinion, so<br />\n.•<br />\nwondering 6!-late whether branch any violator. The executive petition signed by its,active members<br />\nThe NEWS-LETTER believes, as Mr. Swyer has said,<br />\nflagrant<br />\na violation of the erstwhile<br />\nthe<br />\nCouncil<br />\nwould<br />\nbe forced to rea great force is not going branch consists of'a council of six<br />\nthat a second show depends on whether or not enough<br />\n\"inalienable\" rights connected with<br />\nfuse it on the Same grounds.<br />\nto waste at the Hopkins in men, including a chairman and a<br />\n•<br />\nmoney is available to produce it. If it is net available<br />\nfree assembly and free speech. Selthe form of Pi Delta 'hp- secretary.<br />\nthen taxing the. students is not out of the question. Tile<br />\ndom, too, has the red herring of the<br />\nsilon, honorary journalism<br />\nThe following was sakmitted- by:<br />\nThis council receives the report,<br />\nleast the Barnstormerls could do, would be to present<br />\nCommunist label been used with such<br />\nfraternity. That it offers inWilliam B. Kempton, President<br />\nand sends the violator a personal letsuch a plan to the student body. If it is accepted, then<br />\ndevastating efficacy to support and<br />\nspiration, encouragement, and a goal to strive for to<br />\nHarold Ricards, Junior Rep,<br />\nter telling him he has been reported<br />\nall will be well; if ,not, then their efforts -will not have<br />\njustify this violation.<br />\nall men connected with publications is undeniable, but<br />\nHarlan Graham, Senior Rep.<br />\ncheating by<br />\nmember of his class<br />\nbeen in vain. For it will have shown that the 'Stormers<br />\n. What is behind this hysterical efmore?<br />\nnot<br />\ndo<br />\ncan it<br />\nJ.. Murray Kempton, Junior Rep.<br />\n(name kept secret), explaining to<br />\nhave made a_sincere attempt to fulfill the requirements<br />\nfort to curb • the freedom of fellow- .<br />\nIn view of the fact- that a contr.:),<br />\nProbably in very few fields does one find such a him just what the Honor Systein<br />\n,-)1' a 'campus dramatics organization.<br />\nAmericans? On its face it would<br />\nvariety of interesting persons as one does in that of means, and suggesting to him that for versy of opinion has arisen on the seem to be<br />\nrherely the mouthings of<br />\nA new semester will soon begin. We trust that some<br />\njournalism. The experiences of any journalist .might his own good he desist. When a viothat portion of our citizenry which<br />\nfinancial plan will be forthcoming before it is too late<br />\nwell make an interesting,_ book. And with each having lator realizes he is watched- by un- Student Resents Interruption Of believes that<br />\nthe primary function<br />\nto attempt another show.<br />\nhis own individual style of telling of these experiences, known members of his own class, he<br />\nPhilharmonic Symphony By Father of American democracy is the<br />\npurely<br />\nlistening.becomes an interesting educational, and happy Will \"see the light.\" If, however, afCoughlin.<br />\nnegative<br />\none<br />\nof<br />\nexcluding \"isms\" of<br />\nWe think the relevant experience.<br />\n.<br />\n•<br />\n-,The Student Council<br />\nevery description. It might be merely<br />\nter being reported twice, and having<br />\n_point is tha_tradition<br />\n'Why doesn't PI-Delta EPsilon take it upon itself to been twice (a space of time having Dear Sir:<br />\na political move on the part of Boss<br />\nassociated with the Hopkins<br />\nsecure -some of these famous journalists as assembly taken place between) warned. be still<br />\nWith strange appropriateness last Hague and Stooge Moore.<br />\nof reverence for truth, respeakers? The candidates are infinite, it is needless persists, then the case with all the Sunday, Father Coughlin's address<br />\nBut there is obviously more in it<br />\nsfoe-et. for liberty, and above<br />\nto do so much as name even oee. And the campus as a evidence is turned over to the Student was ushered onto the air waves im- than this. A glance at the composiall, a faith in the free exDelta<br />\nupon<br />\nEpsilon<br />\nPi<br />\nlook<br />\nto<br />\ncome<br />\nwell<br />\ncould<br />\nwhole<br />\nCouncil for suitable action.<br />\nmediately after the announcement tion of the groups supporting the rechange of ideas and opinions.<br />\nof its ,life, were this the case.<br />\nints matter of an assembly for the Y. C. L. is but a as.a part<br />\nUnder this plan,-11 is very likely of the \"Fantastic Symphony\" on the actionary stand of the Mayor disthis<br />\ntap-day<br />\nEpsilon<br />\nDelta<br />\nNew<br />\nPi<br />\nYork Philharmonic program. closes powerful economic forces<br />\nanother<br />\nbe<br />\nwill<br />\nThere<br />\nparticular to the generality of aclidemic freedom. We<br />\nthat only under-classmen will be 'afshould not evade the issue but frankly ask ourselves: year, early in the spring, probably. We 'suggest that fected, but then in the .process 'of What followed was so .unnaturally working behind the political machinAre we afraid of the educational processes to which we Pi Delta Epsilon avail -itself of this opportunity, and about two years they will be seniors. discordant it could be called fantastic, ery involved. The citizens' commitpay so profuse h lip service? De we carry out in practice conduct a public tap-day, while presenting an interest- Then a new Honor System spirit will but the symphony was not there. Yet tees, the veterans' organizations,<br />\nand of course the Rotary and Kiour policy of hearing -all sides before we make a decision'? ing speaker whom students will enjoy hearing.<br />\nbe in effect. Also thuS the Honor I hesitate to enter this with other<br />\nwanis groups, all represent the busiHopkins students are treated traditionally as mature<br />\nSystem Tradition would be personally protests against the interruption.<br />\nThis week the Greek letter<br />\nI hesitate because these ' protests ness interests of the state, whether<br />\ngentlemen. We consider the rejection of a Commueist<br />\n\"driven home\" in the minds of every<br />\nthey admit it or not. And how about<br />\norganizations, after comspeaker an insult at our intelligence ad judgmet. After<br />\nnewcomer and entrance in the Uni- might prevail upon the broadcasting<br />\nhe arch-Republican New York Sun?<br />\npleting one half of their anall, this was to be a voluntary assembly; any one who<br />\nversity would involve adherence to companies to change the time of<br />\ncompetition,<br />\nbasketball<br />\nThe fabric of our democracy is<br />\nnual<br />\nFather Coughlin's talk. This might<br />\nwished could stay away.<br />\nthe Honor System.<br />\ntake a much needed rest<br />\nwell mean a shift to the middle of indeed frail if it can be so flagrantly<br />\nWe think we are old enough to separate the chafe<br />\norganized<br />\nthis<br />\nplan<br />\nunder<br />\nhave<br />\nWe<br />\npfior to the mid-year examthe Metropolitan Opera according to torn with impunity. The great danfrom the wheat. The University must certainly think<br />\nand now number a score of members.<br />\nination period.<br />\nthe display of abominable taste we ger to our \"cherished democratic'<br />\nso or perhaps it would take the copy of.What Is CommuOur biggest obstacle has been the<br />\ninstitutions\" come not from sinister,<br />\nAccording to the director of intramural athletics,<br />\nhave for a precedent.<br />\nnism from our library.<br />\nfact that we are not officially recogalien and \"un-American\" influences,<br />\nThe NEWS-LETTER appreciates Dr. Bowman's state- Reuben Baer, this season's competition has been the<br />\nHere is one of the most Profoundly<br />\nnized. Our Council consists of four<br />\nbut from the very interests, those of<br />\nment of last year that \"My position in this matter is, if keenest and most successful since its inception four<br />\nsophs and two freshmen, of which cultured programs on the radio, a<br />\nyou're going to have an assembly program and invite years ago under his direction. Never before have the two are engineers, one a business program that in away redeems the the capitalist class, which are supporting<br />\nHague in his present caman extremist, right or left, make sure in your announce- fraternities shown the cooperation and enthusiasm as student, and three A. B's, ---radio for much of the trash it broadpaign.<br />\nendirireing the cause Of they- have this 'year: Whereas In--previous years there<br />\nment that the Univerilify<br />\ncasts. It is being usurped by a dimeyou<br />\ntake<br />\nsuggest<br />\nour<br />\norganizaWhen<br />\nWe<br />\ntotal<br />\nweek,<br />\nprivate interests see fit to<br />\nforfeits<br />\nto<br />\nthe<br />\ndate<br />\na<br />\nthis<br />\nthree<br />\naveraged<br />\nan extremist.\"<br />\na-dozen demagogue. Anomalous as it<br />\nThere can be no compromise in a problem like this. year is only three cancellations. There has been a tion, with the same personnel, under may seem, this approaches desecra- take the law•into their own hands,<br />\nthen it is that democratic instituNo kind of 'rationalization or wishful thpiking will greater show of spirit. nd yet this does not mean that your wing, give us official recogni- tion of the Sabbath by a priest.<br />\ntions are truly threatened. And when<br />\ncharge the fundamental issue. Are we or are we not to re- the games have been rougher. According to referee tion, and let us go to work especially<br />\nI feel that WCAO has not only<br />\nclassmen.<br />\nlower<br />\nAfter<br />\neven<br />\na<br />\ngames-are<br />\nyear<br />\ncleaner<br />\nor<br />\nelected<br />\nand<br />\nthe<br />\nthe<br />\nbn<br />\nKaufMan<br />\nmore<br />\n\"public\" officials not, only<br />\nMillard<br />\nceive a liberal education? Are we to be allowed to hear<br />\nshown detestable 'discrimination, but<br />\naid but actively direct this organand see everything; or are there certain questions . . .? scientific than those of past yers. The players seem to so you will begin to see success.<br />\nbetrayed its public trust.<br />\nIt<br />\nhas<br />\nSincerely yours,<br />\ngreater knowledge of th6 game and its<br />\nized bigotry, Fascism is entirely too<br />\nIf we may speak for some students, this'high-handed, have acquired a<br />\nSincerely,<br />\nIsador A. Bernstein<br />\nclose for comfort.<br />\nanti-intellectual move does not represent our attitude. rules, and there is less of the aimless amateurish rush—Kenneth<br />\nJr.<br />\nMaxey,<br />\nP.O.<br />\ncourt.<br />\nBox<br />\n66.<br />\nthe<br />\ndown<br />\npand<br />\ning<br />\n—The Daily Princetonian<br />\nu<br />\nIs this Hopkins or Heidelberg?<br />\nPublished semi-weekly from October to June, except during examine-.<br />\nand college holiday periods by undergraduates of the Johns Hopkins<br />\nUnigersity.<br /><br />\nTea<br /><br />\nDodd And<br />\nThe Reich,<br /><br />\na<br /><br />\nMEMBER<br /><br />\n1938<br /><br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nrtssociated Cone6icie Press<br /><br />\nCollebiate West<br /><br />\nC<br />\nO<br />\nS<br /><br />\nThe<br />\nSecret<br />\nSix<br /><br />\nTh,<br />\npath<br /><br />\nLoyd<br /><br />\ngin. '<br /><br />\nsaber<br /><br />\nfor a<br /><br />\nCal<br />\nthrou<br /><br />\nrecori<br /><br />\nmatcl<br />\nvictor<br />\nin thi<br />\n5-2 a<br />\nconte:<br />\ntheir<br />\nGlein.<br /><br />\nDill<br />\nthe<br />\nmost<br />\nLoyol.<br /><br />\nHas<br />\nother<br />\npletel;<br />\nthe as<br /><br />\nCONTEMPORARY<br />\nuOMMENT<br /><br />\niranimirso<br /><br />\n•<br />\nWhy<br />\nJournalist<br />\nSpeakers<br /><br />\nPage One ,<br />\nEditorial<br />\nContinued<br /><br />\nIntramural<br />\nBasketball<br /><br />\n7113=1:193M<br /><br />\nEfivri<br /><br />\nBOI<br />\nBe<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25, 1935<br /><br />\n3<br /><br />\nS 13OR<br /><br />\nSPEAKING OF ...<br />\nWhat Cagers ('annot Do Against A Zone And Of<br />\nPete Reynolds' Humiliation Of Alma Mater<br /><br />\nOur Jay quintet scrimmaged the I Pete Reynolds, erstwhile<br />\nall-around<br />\nnewly organized Mt. Washington five athlete at the Hopkins.<br />\nPete \"Red<br />\nat Homewood, last Saturday, and Eye\" was his label in his<br />\nsenior year)<br />\nlucky thing.it was that the affair was up to his old tricks,<br />\ndressed in<br />\nwent by without much notice, for we a blue uniform belonging<br />\nto the Mt..<br />\nhave an idea that Mr. Craig Taylor Washington club instead<br />\nof the Hopwould have taken great pleasure in kins athletic department.<br />\nThe way<br />\nwitnessing the contest. Craig has in which he tore<br />\naround the court,<br />\nbeen trying, for a long time, to pin making life miserable<br />\nfor his alma<br />\nsomething definite on us, though, for mater's varsity reminded<br />\nus of his<br />\nthe most part, his attempts have met former feats in<br />\nHopkins apparel.<br />\nwith little success. But his heart<br />\nPete Is a \"4\" Letter Man<br />\nwould have bee filled with glee if he<br />\nMr. Reynolds holds the distinction<br />\nhad seen the many glaring flaws disof having been a leading dg<br />\n.tire in all<br />\nplayed by our lanky exponents of the<br />\nfour of our major sports. As a footcourt against a team of inexperienced<br />\nball player, he was one of the leadinferiors<br />\ning fullbacks in the State. On the laZone Defense Tricks Jays<br />\ncrosse field, he was the bulwark of<br />\nThe Mounts set<br />\n'<br />\nup a zone (the our defense. The cinder-paths saw<br />\nsame sort of thing \\Towson will show him •run off the hundred yard<br />\nstretch<br />\nus tonight) the plan being to give in ten flat many a time. And<br />\nhe<br />\nour Blue boys a chance to eliminate starred rather brilliantly in a basketsome of the faults they have exhib- ball role which saw his speed and<br /><br />\nTeam Victors<br />\nBLUE JAY FOILSMEN SCORE INITIAL PI LAMBDA DEFEATS Rifle<br />\nOver Georgetown U.<br />\nVICTORY OF YEAR AGAINST LOYOLA ALPHA DELIS 22-7;<br /><br />\nONLY FRAT GAME<br /><br />\nTeam Defeats Greyhounds<br />\ni3y Close Margin Of<br />\n6-5 At Evergreen<br />\nBob Read Outstanding<br /><br />\nSmall And Deeples Split<br />\nSmall and Deeples were also entered in the foils matches. Each came<br />\nthrough with one win and one loss.<br />\nBoth had the misfortune of coming<br />\nup against Loyola's leading fencer,<br />\nDill. Dill just managed to eek out a<br /><br />\nBlack And Blue Squad<br />\nWins By Supremacy<br />\nIn Foils<br /><br />\n5-2 and came on to, close the foils<br />\ncontests and provide Hopkins with<br />\ntheir margin of 'win by defeating<br />\nGlein, 5-0.<br /><br />\nDill, Loyola defeated A.grin, 5-4<br />\n(<br />\nEat at CHUNG HING<br />\nAmerican and Chinese Restaurant<br />\nDelicious American and<br />\nChinese Food<br />\nPrices Reasonable—To Suit Your<br />\nPocket Book<br />\n3312 Greenmount Ave. CH. 9092<br /><br />\nBILLIARDS<br />\nPing Pong<br />\nManaged by Maryland's<br />\nSeale Champions<br />\nFinest Tables—Reasonable Prices<br />\nGreenmount Ave &amp; 31st St.<br /><br />\nfrat teams had an open date. It was<br />\nused however for a practice session<br />\nby some teams in order to prepare<br />\nfor the deciding games after exams.<br />\nIn the Pi Lam-Alpha Delta* fracas,<br />\nit was all Pi Lam from the start.<br />\nLed by eagle eye Marty Breslau,<br />\nthe outcome 'of the game was never<br />\nin doubt. Breslau scored 4 field goals<br />\nand converted twice from the foul<br /><br />\nLipnick, Hopkins defeated Ballan, 5-3 losing Alpha Delta.<br /><br />\nDill of Loyola was outstanding for Dill; Loyola defeated Small, 5-4<br />\nthe losing . team. He amassed the Deeples, Hopkins defeated,Balland, 5-3<br />\nmost victories and scored four of<br />\nDill, Loyola defeated Agrin, 5-2<br />\nLoyola's five points.<br />\nReed, Hopkins, defeated Glein, 5-0<br />\nHarris of Hopkins was the only<br />\n•<br />\nSaber<br />\nother undefeated foilsman. He completely outclassed his opponent in Harris, Hopkins defeated Dill, 5-1<br /><br />\nii<br /><br />\nPi 'Lam<br />\n* defeated Alpha Delta Phi<br />\nin a make-up game last Saturday,<br />\n22-7. It was the only- gam, as all<br /><br />\nline, a total of 10 points, to capture<br />\nReed, Hopkins defeated Giblis, 5-3<br />\nSmall, Hopkins defeated Ballard,5-2 scoring honors for the afternoon.<br />\nVickers was high point man for the<br />\nDill,\" Loyola defeated Deeples, 5-3<br />\nBlein, Loyola defeated Small, 5-4<br /><br />\nthe saber event by a score of 5-1.<br /><br />\nTeams Use Period As<br />\nPractice Session<br />\nFor Finals<br /><br />\nvictory over Small by the flimsy margin of 5-4.<br /><br />\nThe team was honored to have as<br />\nThe ,Jay fencers, following in the referee Generoso Travese, one of the<br />\npath of the basketball team, defeated leading fencing masters of the country, The match was exciting; not beLoyola College by a one point maring decided until the•Jast event, and<br />\ngin. With the score even up in the<br />\nshowed up some promising men who<br />\nsaber duels the Jays came through should profit by the experience of<br />\nfor a five-four margin in the foils.<br />\nthe regular season and give a good<br />\naccount of themselves in the Middle<br />\nReed Leads Jays<br />\nAtlantic Championships:<br />\nCaptain Reed at Hopkins went<br />\nWth the first victory starting the<br />\nthrough the night with an undefeated<br />\nball rolling a prediction of a fair<br />\nrecord. He was entered' in two foils<br />\nseason may be forecailt.<br />\nmatches and scored 2 overwhelming Summaries:<br />\nvictories. He beat Balland of Loyola<br />\nFoils<br />\nin the opening match by a score of<br /><br />\nDill Oustanding<br /><br />\nSecond Victory Out Of<br />\nThree Starts For<br />\nP. Lams<br /><br />\nPatronize Your Advertiser<br /><br />\nSecond Win For Pi Lam<br />\nIt was the first win for the Pi<br />\nLam quintet, winner of the Turby-<br /><br />\nThe Joh,ns Hopkins rifle team,<br />\nled by C. E. Lindenmeyer, manager and captain, scored a 12491318 victory over Georgetown in a<br />\nshoulder-to-shoulder match at the<br />\nnation's capital. This triumph was<br />\nthe first win of the season for the<br />\nJay sharpshooters.<br />\nBesides Lindenmeyer, M. J.<br />\nHartke, J. T. Griffin, R. G. Brown,<br />\nW. B. Grey, M. J. Weber, J. S.<br />\nBaldwin, R. B. Stegmaier, and A.<br />\nH. Smith.<br />\nThe president Of the Rifle Club<br />\nis R. B. Stegmaier, while W. B.<br />\nGrey is the secretary The club is<br />\nunder the general supervision of<br />\nthe R 0. T. d.; most of the matches being arranged by the Military<br />\nScience departments of various<br />\nschools. The men practice during<br />\nthe week in the shooting gallery<br />\nlocated on the fourth floor of Gilman Hall.<br />\nThe Jays will encounter Georgetown in a return match here at the<br />\nJohns Hopkins gallery. The team<br />\nbecause of its many experienced<br />\nveterans hope to continue their<br />\ngood work, and take the Terrors<br />\nagain. This contest will take place<br />\non March 5.<br />\nThe members of the rifle club<br />\nurge men who are 'interested in<br />\nthis spoit to report to the North<br />\nloft of Gilman Hall for information.<br /><br />\nited repeatedly in playing against strength exploited to the fullest of<br />\nsuch a defense. However, defects their ,potentialities. What makes the<br />\nseemed to pile up instead of the fellow's history here all the more<br />\nother way around. Our hoopsters con- remarkable, is the fact that before<br />\ntinually. failed to move the ball, los- his enrollment as a student, he hadn't<br />\ning it tiriie and again as a result of participated in a single sport.<br />\n!inaccuracy and lack of speed a-foot.<br />\nHe's A Mote Team<br />\nWhat topped the performance off<br />\nPet's behavior Saturday bears out<br />\nwas the inability. of our boys to hit his past<br />\nrecord perfectly. If ever<br />\nthe cords when once they got their there was a<br />\nwhole team in himself,<br />\nshots: Of course, it was only a pracPete's it. He Was all over the court,<br />\ntice session, and almost all chose to<br />\nthink of It as such, but still we hope getting in everyone's hair, stealing<br />\nwe don't get a sample of the same the ball so many times that one<br />\nkind when we meet Maryland Teach- could think he had some sort of an ,<br />\ners.<br />\noption on it. Perhaps Jerry Carleton's<br /><br />\nSummaries...<br /><br />\nville Trophy for the last two years,<br />\nafter being upset two weeks ago by<br />\nKappa Alpha by the score of 9-5.<br /><br />\n--- -Meet Mr. Pete Reynolds<br />\nremark fits the situation best. After<br />\nSoon the sap will he running in<br />\nThe afternoon was not without its playing him for a short while, Jerry<br />\ndr* trees and the first twinges of<br />\nThe record for the Pi Lams so far<br />\nSpring will- cause the desertion of brighter side, for it marked the re- gave vent to: \"Boy, he's as fast as a<br />\nshows 2 wins against 1 loss for an<br />\nthe gym. February apProaches, and turn to the Homewood cage, after an ight and strong as an ox!\"<br />\naverage of .666. The luckless Alpha with it comes warming up for la- absence of close to three years, of<br />\n•<br />\nDelts are yet ot win a game having crosse, track, baseball, etc.— all<br />\n•<br />\nafter exams of course. Such balmy<br />\nlost 3 straight.<br />\nOnly Down Town Stage Show<br />\nweather as we, well, you have enKIBLER'S ,<br />\nAs competition for the basketball joyed today really makes the prosNOW<br />\nJewelers and Opticians<br />\ntrophy draws to a close there are pect of life more cheerful . . . Hal<br />\nParker Pens and Pencils<br />\ntwo undefeated teams in each league. Zheutlin is back from the hospital,<br />\n' Jewelry and Watches<br />\nIn league \"A\" there is Phi Gam, last where he has been convalescing for<br />\nTHEY CALL IT LOVE ..<br />\nEyes Examined<br />\nyear's champs and Phi Alpha, dark some time. It's a pity the basketball,<br />\nYOU'LL CALL IT A RIOT!<br />\nteam lacked his services this winter<br />\nLens Repaired<br />\nhorse of the '37'38 season, who are<br />\n. . . Why not a crew at J. H. U.?<br />\n1918's First Laugh Hit!<br />\nundefeated. As it stands now Phi<br />\nWith some of the huskies we have<br />\nGam seems to have the edge, but<br />\nbestuding the campus like so many<br />\n• hey will'have to be at top form to<br />\nGladYs George<br />\n3222 Greenmount Ave.<br />\ncolosi we could make a good showdefeat Phi Alpha's \"fighting gators\"<br />\n•`ing against the -100-book boys from<br />\nFranchot<br />\nTone<br />\nlead .by Capt. Rudo. They will clash<br />\nAnnapolis . . . We predict Jim Bradon Saturday. ,Feb. 19th in a game<br />\n\"LOVE IS A HEADACHE\"<br />\ndack will be a second Fitzsimmons,<br />\nwhich should be a great game.<br />\nhe's upset the wise dope too often.<br />\nON OUR STAGE<br />\n•<br />\nKappa Sigs Head League \"B\"<br />\nAMERICA'S FAMOUS SONG<br />\nIn League \"B\", there are also two plays\"Jay Vee\" pall this year. HowWRITER AND STAR-MAKER!<br />\nundefeated teams, namely, Kappa Sig ever, . the other undefeated team<br />\nand Kappa Alpha. At present it looks Kappa Alpha, who defeated'a strong<br />\nIN PERSON<br />\nST PAUL AT 33RD STREET<br />\nas if Kappa Sig will represent league Pi Lam quintet several weeks ago,<br />\n\"B\" in the play-offs. Led by Pay can be counted on to give Kappa Sig<br />\nBENNY DAVIS<br />\nPrescriptions—School Supplies<br />\nand Brayshaw, Kappa Sig has practi- a hard tussle, and with a few breaks<br />\nAnd His All New<br />\ncally the same teams which went to might even win. Led by Reynolds,<br />\nSandwiches<br />\n\"STARDUST REVUE<br />\nthe finals last year, only to 'lose to Kappa Alpha is always a dangerous<br />\nPhi Gam by a close spore. Every mem- team and one that will be in there<br />\nOF 1938\"<br />\nUnexcelled Fountain Service<br />\nber of the Kappa Sig 1st team also until the end.<br /><br />\nHIPPODROME<br /><br />\nDin I4 141<br /><br />\nS1<br /><br />\nPHARMACY<br /><br />\nlb•Gtoehtith a 5on<br />\niliy Prinfin6<br /><br />\nWit4 •1044 W044<br />\n%Moo.<br /><br />\n%•1,44<br />\nNO,ialn<br />\n4sa.a.<br />\nC.<br />\n‘00,44,<br /><br />\n4.7<br /><br />\nWt$44<br />\nlog 4444 Nfr.<br />\n10/1:<br /><br />\nwoo4w$44,•m044 %Op,<br />\n4441.<br />\nvsy<br />\nc malltet No\"..1%%4i.<br />\n7%.(C. 7\"+\"C.<br /><br />\nWO.14 W004<br /><br />\n%k1014<br />\nAoki<br />\n\"<br />\nN.<br /><br />\n%MIA,1.W•<br /><br />\n'CC<br /><br />\n-<br /><br />\nAA:<br />\n+<br />\nW1014<br />\nNit<br /><br />\n%VIM,<br /><br />\nSpecialistsin Schooland<br />\nCollegelVork•Maiazines•<br />\nAnnualsProgramsDance<br />\nPro6ramsAnnounceme1tts•<br />\nStationery<br /><br />\n•tvfo.<br />\n+\"(7,<br /><br />\nBy Popular Request<br /><br />\nW144<br />\nAte:.<br /><br />\n144.1.<br />\nsaktfons....<br /><br />\nTHE COTILLION BOARD<br /><br />\nWOW.,<br />\nr<br />\nAp.<br /><br />\nwww.wwwwwwwi<br />\ntrr—..<br />\nTbe Hark<br /><br />\nzWf+<br /><br />\n7.3..tras<br /><br />\nCtuj<br />\nj..9r-<br /><br />\n7‘+t,<br />\n%MOM,<br /><br />\nPRESENTS...<br /><br />\nmo4e,<br />\n4m.<br />\n+<br />\nw 44<br />\nW1‘44<br /><br />\n/1<br />\n.1044<br /><br />\n119-121 W. MULBERRY ST.<br /><br />\nMet',<br /><br />\n••1044<br /><br />\nGLEN GRAY<br /><br />\n1400,1<br /><br />\nins<br />\nCASA LOMA ORCHESTRA<br />\nAND<br /><br />\n]<br />\nEl)e Workmanship<br />\nC. Landler, Prop.<br />\nHair Cutting, 40.<br />\nThe Xerras Treatment al<br />\nBOULEVARD BARBER SHOP<br />\nON 33RD STREET<br />\nBetween St. Paul and Calvert Streets<br /><br />\nBoulevard Hardware Co.<br />\nHOUSE FURNISHINGS<br />\nELECTRICAL SUPPLIES<br />\n430 E. Thirty Second St.<br />\nUn. 0749<br /><br />\n•1$44<br />\n1\\\\44‘<br />\n%fest<br /><br />\n•<br />\nYou Get the likest Raw Bar Oysters at<br /><br />\nHARRY L. HASSLINGER CO., Inc.<br />\nDINING ROOM AND BAR<br />\nNORTH AVE. &amp; ST. PAUL STREET<br /><br />\nsoya:<br /><br />\nWOO,<br />\nkW4.re<br />\nrays.<br /><br />\nMARCH 1<br /><br />\n••1044••1044<br />\n44,1.%Mfr.<br /><br />\n%%444<br />\n.44f.<br />\ny<br /><br />\n7 CC.7%+t,<br /><br />\nW1044<br /><br />\nALCAZAR<br /><br />\n-<br /><br />\n• 44•M0/4 W1044<br />\n.<br />\n104.%•41.<br /><br />\n+<br /><br />\nW044<br /><br />\n+\"<br /><br />\n•1044 tee, WOE,<br />\n110‘.4‘‘vo,<br />\n%OW<br />\nAWP itvP-44.)01.•<br /><br />\n11044<br />\n7Nt.<br />\nZ•1$44<br /><br />\nU94.,;mpg, %%444 Z1t$Se,<br /><br />\n1.1<br /><br />\n4<br /><br />\nHOMEWOOD, BALTIMORE, TUESDAY, JANUARY 25,<br />\n1938<br /><br />\nCAMERA SOCIETY J. H. U. MUSICAL CLUB Dormitory Will Spring To Life PRESS PUBLISHES SUMMARY<br />\nAfter Examinations Are Over OF YEARS PUBLICATIONS<br />\nPLAYS TWO WEEK-END<br />\nPRESENTS PICTURE TRIP<br />\nAT HOPKINS<br />\nENGAGEMENTS<br />\nEXPERT AT TALK<br /><br />\nArthur Katz, '38, chairman of the elected by the men in<br />\nthe dorms,<br />\nBoas' Primer For Critics, In Several Editions,<br />\nSocial Committee of the Board of one from each of the<br />\nsix entries.<br />\nLeads List; Important Scholarly Works<br />\nFellows at the Dormitory, today an- The Board is competently<br />\nheaded by<br />\nPerform At Hood College nounced a \"Social Renaissance\"<br />\nat Dr. Donald H. Andrews, Senior FelRun Off During Past Year<br />\nMr. Fred Vaughan Of De- Annapolis High School; the dorms would take place follow- low of the Chemistry Department. The Johns Hopkins Press,<br />\nmanaged ing of the Ancient Romans by Liling the -examination period. A dorm Any infractions of the comparatively<br />\nHamilton<br />\nLeads<br />\nfender Co. Delivers Illusby Christian W. Dittus, issued its lian M. Wilson; Excavations at Mrsdance to follow the Blue Jay-St. few rules come primarily under<br />\nthe<br />\ntrated Talk<br />\nThe Johns Hopkins Musical Club John's basketball game is tenatively jurisdiction of the Board of Fellows. twenty-ninth volume of the Johns thus, VIII, The Houses Excavated in<br />\nplanned to initiate the \"Renais- To say \"to conduct oneself<br />\n1931 and 1934, by J. Walter Graham;<br />\nas becom- Hopkins Press Bulletin in December,<br />\ncompleting its most successful weekExcavations at Olynthus, IX, The<br />\nsance.\" The significance of Mr. Katz's ing .a gentleman\" would<br />\nDEMONSTRATES<br />\ncover the 1937. The mimeographed schedule<br />\nend of the current season adjourned<br />\nGhalcidic Mint and The Excavation<br />\nremark lies in the fact that socially, ,rules of behavior in the<br />\nDormitory. for the Press in<br />\nDARK ROOM TRICKS its meetings until the new semester. the dormitory has been more or less<br />\nfour pages, men- Coins, 1928-1934, by Paul Clement;<br />\nHealth Officer Appoints •<br />\ntioned facts of meetings, exhibits, the fourth<br />\nvolume of An Economic<br />\nFriday night's concert played be- dormant to date, save for an apThe Honor System prevails in the<br />\nand<br />\nscollegiate<br />\npress<br />\nactivities in Survey of Ancient Rome, edited by<br />\nClub Will Present Expert On fore a near capacity audience at the pearance of the Music Club featur- matter of breakage. One of the memwhich .it participated during the past Tenney<br />\ning<br />\nFrank; The Floating Debt<br />\nthe magnificent voice of Dick bers oftheBoardwasappointed<br />\nNude Photography,<br />\nAnnapolis High ,School, Annapolis;<br />\nHealth year. In addition, those<br />\nvolumes of the Federal Government, 1919Sharretts and the Blue Jay dance Officer. He investigates<br />\nany sickness which were, run<br />\nMaryland, while on Saturday eveFebruary 11<br />\noff by the Press, as 1936, by Edward Raguet Van<br />\nband under the direction of talented and reports it to Dr. Andrews.<br />\nSant;<br />\nUnder well as those in anticipation<br />\nning the club was the guest of Hood Don Hamilton. The event was<br />\nof print- The Effects of Different Degrees Of<br />\npoorly this plan, no one who needs it, will<br />\ning were listed with a short com- Success<br />\nMr. Fred Vaughan, The De- College<br />\nand Failure Upon Uniformfor Women, at Frederick, attended as was the Turkey Trot,<br />\nhe in bed 'without necessary medical<br />\nmentary about each.<br />\nfender Company's pictorial expert,<br />\nity and Variability of Contagious ReFood Has Improved<br />\nattention. This was inaugurated by<br />\nMaryland.<br />\ntreated the Johns Hopkins UniverBoas' Book Leads<br />\nsponses in Serial Learning by Claude<br />\nHowever, chess and ping pong the Board of Fellows this year.<br />\nThe<br />\nDr. George Boas' A Primer for C. Dove; and<br />\nOn both occasions receptions were<br />\nsity Photographic Society to a most<br />\nThe Interrelationship of<br />\ntournaments met with huge success. Board of Fellows also sponsors<br />\nFel- Critics remains the most<br />\npractical darkroom demonstration planned for the entire club. The A piano<br />\noutstanding Drives in the Male Albino Rat. II.<br />\nwas purchased and will be low's Night one night a month when<br />\nvolume of the year for the Press, Intercorrelatio<br />\n• last Friday night. The lecture, which Blue Jay orchestra,<br />\nns Between 47 Messunder'' the placed in the dining room. The idea the residents of the dorms and memand. has been depleted of its first urea of<br />\nwas held in Remsen 101 was atDrives and of Learning, by<br />\ndirection of Don Hamilton furnished being to have several members of hers of the faculty meet for dinner edition.<br />\nA second printing has been E. E. Anderson.<br />\ntended by thirty members and guests<br />\nthe Music Club lead the dorm men and a discussion in the Commons<br />\nmusic ,for the dances. The quartet<br />\nordered.<br />\nof the Camera Club.<br />\nPress Exhibit Prize Works<br />\nIn a song feat at meal times. Inci- Room.<br />\nfashioned in the manner , of Benny<br />\nImportant books on contemporary<br />\nThe Bulletin mentioned that the<br />\ndentally, it has been said that the<br />\nIllustrates Enlarging Process<br />\nVarious cliques have sprung up,<br />\nsubjects -have been forcast, and are Press held<br />\nGoodman was- outstanding among' food is better this year.<br />\na booth at the New York<br />\nin the Dorms this year. Among them<br />\nMr. Vaughan used the negatives<br />\nexpected soon -for review. These are: Times National<br />\nBook- Fair, in comIn the words of Dr. Donald H. are, Mewshaw's \"Storm Troopers\"<br />\nof Charles Zimmerman and Eugene their presentations.<br />\n, Tench Core: A Study in American mon with<br />\nother university presses,<br />\nAndrews, \"the men in the dorms with G.H.Q. in E entry,<br />\nVVIallman, and proceeded to prove<br />\nRemaining on the schedule are<br />\nthe \"Suicide Economic Development<br />\nby<br />\nHarold<br />\nand placed'on view some of its prize<br />\nthat a passably good print could be performances at Roberts Beach have shown great justice, interest, Fleet\" in F entry experienced in the Hutcheson; The<br />\nAgnihotra, by Paul works there. The exhibit, held<br />\nand cooperation\" in the way of dorm- culinary arts (they<br />\nlast<br />\nmade from average, or below avercooked their own E. Dumont; Christian<br />\nSchool for Women,' Marjorie Web- itory discipline which<br />\nMysticism<br />\nin<br />\nNovember,<br />\nwas sponsored by the<br />\nhas been unus- meals Over the Christmas<br />\nage negtives. Using Ziznmerman's<br />\nholidays), the Elizabethan Age, by Joseph Burns New York<br />\nTimes,<br />\nSchool<br />\nster<br />\nWomen,<br />\nand<br />\nfor<br />\nually<br />\nMadden<br />\nthe<br />\ngood<br />\nHall,<br />\nAmerican<br />\nthis<br />\nyear<br />\nunder<br />\nits<br />\nnew<br />\nand,<br />\na mysterious, but harmless, or- Collins;<br />\nnegative of Gilman Hall, he made<br />\nBotivar ahd the Political book publishers. Actual'bookmanua beautiful enlargement from it. Atlantic City, and New York City at form of government. The governing ganization in D entry known as the Thought of the Spanish<br />\nAmerican facture including type-setting, print• Thgn, while using Eugene Wallman's the Warwick Hotel. The home con- bodyrknown as the Board of Fel- \"Set Men.\" While the Jazz Fiends Revolution, by Victor<br />\nAndres<br />\nBeing,<br />\nfolding,<br />\nbinding,<br />\nlows,<br />\nis<br />\npacking,<br />\nmade<br />\nup of seven men chosen hold forth in A entry, the<br />\nand<br />\nshot of the Canadian Rockies, he cert, climaxing the season's program<br />\nconscien- launde; The Monroe Doctrine, 1867shipping were illustrated with workby the administration, and six men tous freshmen study<br />\ndemonstrated the technique of dodgin B entry.<br />\n1907, by Dexter Perkins; The Cloth- ing machines.<br />\nis scheduled for February 25, at the<br />\nnegatives,<br />\ntransing, making paper<br />\nMaryland 'Casualty auditorium.<br />\nseparation<br />\nparencies, and<br />\ncolor<br />\nAccording to<br />\nprints.<br />\nthe<br />\nconclusions<br />\ndrawn from campus opinion, John<br />\nLecturer Answers Questions<br />\nAccompanying Mr. Vaughan, was<br />\nan exhibition of prize winning prints,<br />\nwhich he very kindly borrowed for<br />\nthe lecture from the Philadelphia<br />\nSalon of 1937.<br /><br />\nGhingei, president of the club, Oswald Steinwald, Glee Club director,<br />\nand Conrad Gebelein, director of the<br />\nBanjo Club and Hawaiian Troupe,<br /><br />\nascertain that the club's performBecause of the small size of the ances<br />\nUlla' year have been received<br />\ngroup, it was possible for all those<br />\nmost satisfactorily.<br />\npresent to ask questions of interest<br />\nto them personally. Mr. Vaughan<br />\nwas able to add a great deal of information in his answers to queries<br />\nposed.<br /><br />\nPLAYSHOP OFFERS IRISH<br />\nDRAMA HERE TONIGHT<br /><br />\nThe president of the club, Wallman, '40, said, \"It is the wish of the<br />\nclub, that Mr. Vaughan and many<br />\nexperts of his calibre will again be<br />\nable to be presented in the near<br />\nfuture, and that more members will<br />\navail themselves of the privileges extended by the Society to attend these<br />\ndemonstrations, of value both to beginners and advanced photographers.<br />\n\"Nudes\" Photographer Programmed<br />\n\"On February 11th the Society<br />\nwill have the pleasure of presenting<br />\nMr. Harvey Wobbe, one of the foremost pictorial and nude photographers in the country,\" he further announced. Mr. Wobbe represents the<br />\nAgfa Co., and ,will discuss the general subject Of Pictoral photography.<br />\nIt is expected that many members<br />\nof the Baltimore Camera Club will<br />\nalso be present. Mr. Wobbe has addressed that organization earlier in<br />\nthe year, and they wish to hear him<br />\nagain.<br /><br />\nDU PONT GIVES SCHOOL<br />\nFELLOWSHIP OF $750<br /><br />\nThis evening the Hopkins Playshop will present \"Riders to the Sea\"<br />\nas a part of its meeting entitled an<br />\n\"Irish Evening.\"<br />\nAt the Playshop tonight it will be<br />\n\"An Irish Evening.\" Professor Irene<br /><br />\n• ••<br /><br />\n64,<br /><br />\nMiller of Goucher College will lecture on the \"Irish Drama.\" Her talk<br />\nwill be followed by a one act play<br />\nby J. M. Synge, \"Riders to the Sea,\"<br />\npresented by members of the club.<br />\nMajor Plal,In February<br />\nDirector N. Bryllion Fagin has<br />\nannounced that the major play of<br />\nthe year will be presented in Feb-ruary, The play selected is \"Dance<br />\nof Death,\" by August Strindberg.<br />\nThe principal parts have been<br />\nassigned anthrehearsals have already<br />\nbeen held. The leads will be played<br />\nby: Ruskell Magill, alumnus; Raymond Hammel, student of the Night<br />\nSchool for Technical Workers, and<br />\nJenny Hoffman, a graduate of the<br />\nHopkins College for Teachers.<br /><br />\nThe Playshop is directed by Dr.<br />\nN. Bryllion Fagin, associate in EngA Du Pont Fellowship of $750 a lish and its membership is composed<br />\nyear, has been allocated, to the Johns of undergraduates and alumni.<br />\nHopkins University for, post-graduThe purpose of the Playshop is to<br />\nate research in chemistry.<br />\nact as an experimental drama labThe fellowship does not limit the oratory in which the drama can be<br />\nsubject of research to any particular studied and expression given to the<br />\nfield It sponsors investigation in efforts of the members. It is closely<br />\nmost scientific problems relevant to connected with the course in Play<br />\nchemistry in the hope, that tangible Production given by Dr. Fagin. The<br />\nresults will be realized after a num- group plans to present an<br />\noriginal<br />\nber of years of extensive work. How- play in the spring, but has not yet<br />\never, the recipients of the fellowship made its selection.<br />\nwill be assigned a line of investigation by the University.<br />\nFrom the many schools of higher<br />\nlearning all over, the country, the<br />\nHopkins was chosen one of eighteen<br />\nto receive a Fellowship. The others • Leader of the government lawyers<br />\nare: University of Chicago, Columbia Who won the spectacular anti-trust<br />\nUniversity, Cornell University, Har- case in Madison, Wisconsin, last Satvard University, University of Illi- urday, was John Henry Lewin, '21,<br />\nnois, Massachusetts Institute of who was on the Debating Council and<br />\nTechnology, University of Michigan, a Barnstormer while at the Hopkins.<br />\nUriiversity of Minnesota, University He belonged to Omicron Delta Kappa<br />\nof North Carolina, Ohio State Uni- and Alpha Delta Phi.'<br />\nversity, Pennsylvania State College, The decision of the Federal court was<br />\nUniversity of, Pennsylvania, Prince- characterized by newspapers as the<br />\nton University, Stanford University, most important decision of the courts<br />\nUniversity of Virginia, University of -acnee-1910- when the— courts -forced<br />\na breaking up of the Standard Oil<br />\nWisconsin, and Yale Uiversity.<br />\nChemistry majors and graduate stu- Company. ,<br />\ndents in chemistry may obtain furTo Lewin this great victory comes<br />\nther information concerning the du as a welcome wedding<br />\npresent, as he<br />\nPont Fellowship at the Registrar's is marrying Miss Janet<br />\nGorden KeiOffice.<br />\ndel next month.<br /><br />\nThis<br /><br />\nshown electric<br />\ndetective<br />\n..•wi<br />\nsensitive below<br />\nth its 20<br />\nfingers \"fee<br />\nls\"<br />\nChesterfield and<br />\nevery<br />\nthe<br />\nentire<br />\nrette is package ithrovvs<br />\nf one out<br />\nciga••.justdefective<br />\none of<br /><br />\n•<br /><br />\nthe<br />\nChesterfield doe tomany things<br />\ns give<br />\na<br />\nbetter<br />\nyou<br />\ncigarette.<br />\nEverything<br /><br />\nthat<br />\nahout is.<br />\nused<br />\nSciento<br />\nknote's<br />\nfields<br />\nmilder and make Chester.<br />\nbetter<br />\n-tasting.<br /><br />\nWeekly<br />\nRadio Features<br /><br />\nHopkins Grad Wins<br />\nBig Anti-Trust Case<br /><br />\nLAWRENCE TIBBETT<br />\nANDRE KOSTELANETZ<br />\nPAUL. WILITEMAN<br />\nDEEMS TAYLOR<br />\nYAVL DOUGLAS<br />\n-<br /><br />\nYoafind MORE MASURE<br /><br />\nin Chesterfields'<br />\nmilder better taste<br />\n( ops zg lit 193S, !ALA., I,<br /><br />\nMI.!, I<br /><br />\n',LC° CO.<br /><br />\np.<br /><br />"}], "field_media_file": [{"target_id": 39148, "display": null, "description": null, "target_type": "file", "target_uuid": "136471d9-afdb-4cce-880f-c7a4ef6dc471", "url": "http://digital.library.jhu.edu/system/files/2022-03/12824-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12824, "target_type": "node", "target_uuid": "db87365d-bdff-4a09-8217-c9e2e6f69d54", "url": "/node/12824"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "408b80b3-5f4d-4c52-8c89-ee229767a810"}]}