{"mid": [{"value": 37103}], "uuid": [{"value": "7313cec7-3818-423c-9149-7939abf64e20"}], "vid": [{"value": 37103}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:59:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13186-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:59:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:59:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXX, No. 17<br />\nNEW LACROSSE SCHEDULE<br />\nSHOWS IMPORTANT<br />\nCHANGES<br />\nNavy, Lehigh, and Mt. Washington Do<br />\nNot Appear. Vacancies Filled By<br />\nSt. John's And Army<br />\n<br />\nRevisions of a very notable character are to be found in the recently released 1926 lacrosse<br />\nschedule. The absence of Lehigh,<br />\nNavy, and Mt. Washington, hitherto considered among the most<br />\nformidable of the old schedule, is<br />\nthe most glaring of all the omissions.<br />\n<br />\nHOMEWOOD,BALTIMORE, MD., DECEMBER 1, 1925.<br />\n<br />\n0. D. K. INITIATION AT<br />\nASSEMBLY THURSDAY<br />\nThe Beta Circle of Omicron Delta Kappa will hold<br />\na public initiation at the Assembly Thursday.<br />\nThe private initiation and<br />\nbanquet will take place that<br />\nevening at the Rennert.<br />\nDr. Charles Leber will be<br />\nthe speaker of the day. Dr.<br />\nLeber, it will be remembered,<br />\nwas the speaker at the initiation last spring. Dr. Leber<br />\nwas a member Of the society<br />\nwhen an undergraduate, and<br />\nwas one the best cheer leaders ever to lead a Hullaballoo.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nJAYS AND RAVENS BATTLE<br />\nTO THIRD TIE IN ANNUAL<br />\nTHANKSGIVING DAY CLASSIC<br />\nCAPTAIN WALKER-TAYLOR LEADS HOPKINS<br />\nDR.GOODNOW BROADCASTS<br />\nTO TOUCHDOWN IN LAST MINUTE CHARGE<br />\nOVER NEW SUPERPOWER WBAL<br />\nStresses Johns Hopkins As Pioneer<br />\nIn Advanced Learning<br />\n<br />\nComing from behind with a the ball was brought to where<br />\nThomas was downed because the<br />\n<br />\npunch and a spirit not previously<br />\nshown this season, and never<br />\nexcelled in any other season, the<br />\nJohns Hopkins football team ran,<br />\nrushed and passed its way into<br />\novercoming terrific odds, and car-<br />\n<br />\nreferee's whistle had blown beforeMallonee had gotten the<br />\n<br />\n\"An important part is played<br />\nFails To Score<br />\nspheroidKk<br />\nby the Johns Hopkins University<br />\nOxford-Cambridge<br />\nthe second<br />\nWith<br />\nthe<br />\nopening<br />\nof<br />\nin making Baltimore a port of opNevertheless, a hard schedule<br />\nquarter Johns Hopkins ushered<br />\nportunity,\" was the keynote<br />\nrying over for another year the in its first opportunity for scoring.<br />\nhas been prepared, in which St.<br />\nstruck by Dr. Goodnow in a<br />\ntie score that had already existed Throngh the work of Taylor, PinJohn's, UniversitY - of Virginia,<br />\nspeech thrown on the ether last<br />\nand Penn State have_been listed<br />\ntwo years between Johns Hopkins dell and Lawrence, the ball was<br />\nMonday night, November 23rd. by<br />\n• to replace those who because of A. T. O.'S FINED BY BOARD<br />\nand University of Maryland.<br />\nmarched to Maryland's 15-yd. line.<br />\nBaltimore's new super-power ravarious conflicts have had to be<br />\nMallonee<br />\nPilots<br />\nJays<br />\nFOR VIOLATION<br />\nHere the \"Old Liners\" held like a<br />\ndio broadcasting station WBAL.<br />\ndropped.<br />\nOxford - Cambridge,<br />\nwas<br />\nthat<br />\nThe Blue Jay team<br />\nstone wall. Leibensperger was<br />\n1)r. Goodnow took the motto<br />\nwhile not exactly a newcomer, Act Of Conant On November 10 Brings<br />\nCaptain<br />\nfield<br />\nby<br />\non<br />\nthe<br />\nlead<br />\nout<br />\nselected to try for a field goal.<br />\nFive Dollar Impost<br />\nmay be called an addition to the<br />\nof the new station, -Baltimore,<br />\nwonderful aggrega- His kick front placement was unnew group of opponents. The<br />\nThe Alpha Tau Omega frater- The Port of Opportunity,\" and Taylor was a<br />\ntion,<br />\nworking<br />\nlike a clock under successful and Maryland regained<br />\nEnglishmen appeared on Home- nity was brough t before the In- developed it so as to show the imlie generalship of Mallonee, who the ball on her twenty-yard line.<br />\nwood field two years back and ter-Fraternity Board on Monday<br />\nportant part played by Johns<br />\nwere defeated by the home team. for violation of the rushing agreedirected the play from the -hudThis was the first scoring threat<br />\nHopkins in that \"it offers to stuNo games have been omitted as ment. They were fined $5.00.<br />\ndle.- Not only in generalship did The Homewood team had been<br />\na result of disagreements. Lehigh<br />\nMcCleary and Conant, two dents who have the eager and ex111 allonee deserve distinction, but playing a clever, aggressive, beauhad practically completed its members of the A. T. 0. frater- ploring type of mind a means for<br />\ns schedule, leaving May 29 open for nity, were seen talking to Ness pursuing fruitful adventures in in stellar, clever play at his end tiful game of football against a<br />\nposition, particularly in his work team that was indisputably a<br />\nJohns Hopkins, before it learned and Todd, two freshmen, during the field of learning.\"<br />\nat the recent convention in New tbe silence period. The conversaof receiving the forwards launched worthy group. But when the try<br />\nAdvanced Work<br />\nYork that this University would tion took place in the basement<br />\nby Taylor, he gained the plaudits for a field goal failed, the onlookThe chief distinction of the<br />\nnot play officially after May 22. of Gilman Hall near the Post Ofof eleven thousand spectators ers sank back in their seats with<br />\n•The Bethlehem authorities made fice and, according to a witness, Johns Hopkins University, Dr.<br />\ngathered at the Baltimore Stadium sighs; many short sighs of regret,<br />\nevery possible effort to work the lasted for two or three minutes. Goodnow pointed out, has been<br />\nBlue_Jay gamia at another date, .-, Ness was brought before the and is its ,advanced_ work in the expecting. a Maryland victory.. But some long drawn sighs of relief.<br />\nthe gods of football made fate<br />\nbut all plans were unavailing.<br />\nboard, and testified that Conant<br />\nMaryland Scores<br />\ntype of study that goes beyond the<br />\nhis<br />\nhim<br />\nif<br />\nseen<br />\nhe<br />\nhad<br />\nasked<br />\nhad<br />\ncoaching<br />\nstaff<br />\nof<br />\nkind,<br />\nand<br />\nthe<br />\nSt. John's<br />\nThe quarter, however, was not to<br />\ncollege years and strikes into new<br />\nJohns Hopkins built up a gridiron be without its scores. It was not<br />\nSt. John's and Virginia may be hat. Their two lockers being befields. Alwhys has this been true.<br />\nconsidered the real newcomers of side each other, Conant thought<br />\neleven that was well-nigh flawless long before Maryland opened its<br />\nthe season. For two or three Ness may have gotten his hat by In 1876, when the new University to wreck the expectations of the<br />\nbag of tricks and let out a proopened, it was necessary for all<br />\nyears St. John's has been without mistake.<br />\nshove<br />\nsupporters<br />\nand<br />\nMaryland<br />\nductive triple pass. Besley reWhen • the subject was put be- Americans who wished to do ada lacrosse team of any note. They<br />\nthe Blue team and ceived the pellet from center,<br />\nspirits<br />\nof<br />\nthe<br />\nit<br />\ndiscussion<br />\nboard<br />\nfor<br />\nfore<br />\nthe<br />\nhave not played Johns Hopkins<br />\nvanced work along almost any<br />\nfor some years. The University was pointed out that, although line to go to Europe to study; by its backers to hitherto unattained transferred it to Tenney who reheights of elation.<br />\nof Virginia put out an unofficial they were not talking fraternities,<br />\nleased it too. Supplee, Supple<br />\nstressing advanced work, Johns<br />\nteam last year and confined its there was a feeling of friendship<br />\nFrom the very outset it was passed to Stevens who ran twenty<br />\nHopkins inaugurated a plan so<br />\nteam to a small number of games. in starting the conversation.<br />\nevident that the Jay and the Raven yards for a touchdown. Stevens<br />\nNess and Todd were pledged by immediately successful that it reL'Hirondelle Club was played<br />\nwere just abotit equally matched then succeeded in the try for<br />\nA. T. 0. fraternity.<br />\nthe<br />\nceived the compliment of widetwice and was victorious each<br />\ntheir annual -dispute. Old grads points.<br />\nin<br />\nwas<br />\nmade<br />\nmotion<br />\nthat<br />\nthe<br />\nA<br />\ntime. The Virginians have more<br />\nspread imitation.<br />\nthe<br />\nA.<br />\nT.<br />\n0.'s<br />\nnot exceed<br />\nand young grads on the sidelines<br />\nexperience this year and some very fine of<br />\nAs a result of an intercepted<br />\nPioneers<br />\nand in the stands harked back<br />\ngood material. They are expected $25. This was amended to read<br />\nP'5s Maryland gave the Jays an$15. This motion was defeated.<br />\nAs another illustration of the<br />\nto put up a nice argument.<br />\nto another day to give the 1925 other seige of worry during the<br />\nIt was finally decided that the pioneer work done by'Johns HopL'Hirondelle is off the Johns<br />\nteam the greatest acclamation it few remaining minutes of the half<br />\nfine be $5.<br />\nContinued on page 3, column 3<br />\nkins, Dr. Goodnow cited the Medwas in their power to give by but the whistle blew while the<br />\nical School which was added to<br />\nlikening the present warriors to teams were lining up on the fivethe University in 1893. Organsome famous group that trod the yard chalk and the teams -adized so as to include the study<br />\nfootball turf of former years. But journed to their respective locker<br />\nand observation of patients, doumost of the onlookers recalled the rooms and consultations.<br />\nA search through Who's Who Buchner, Hollander, and Robinbling the length of instruction as<br />\nIn America reveals the fact that son follow closely, with forty-four<br />\nfamous team of '23 that checked<br />\nClowns Take Field<br />\ncompared with most existing<br />\nthe big black bird in its upward<br />\nnearly one-third of the Hopkins lines each.<br />\nThe intermission was taken up<br />\nAmeriCan medical schools, and<br />\nThe average amount of space deflight and by the skillful use of with songs and yells and the anprofessors have earned a place for<br />\nvoted to a professor in the under- demanding much higher qualifica- Turnbull's toe held the Maryland<br />\nthemselves in that volume. There<br />\ntics of a. number of clowns from<br />\ngraduate school of this Univerity tions of entering students, a modare about one hundred professors,<br />\nof that year to the first tie of the the Maryland stands. The most<br />\nis about twenty-five lines. MOst el was established for most of the<br />\nassociates, and assistants teachoutstanding of these was a takeof the professors have written present high-grade American med- series.<br />\ning in the undergraduate schools;<br />\nTouchdown Recalled<br />\noff on the great \"Grange.\" A<br />\nseveral books or treatises of suffiical schools.<br />\nOf these, thirty, or slightly less<br />\nMany of the watchers later had chap in football togs crowned with<br />\ncient importance to be given space<br />\nthan one-third of the total, are in this brief resume of their lives. \"The latest sign of appreciation cause to lament that the J. H. U. a shock of red,hair, wearing the<br />\nlisted. Twenty-three full profes- The average professor also is a of Johns Hopkins as a pioneer- narrowly, missed. victory on this number \"77\"'and carrying a block<br />\nsors in the School of Arts and Sci- member of four or five<br />\nhonorary ing university is the proposal to Thanksgiving Day as well as on of ice, came out on the field and<br />\nences are mentioned. From this societies.<br />\nestablish here a School of Inter- two' former days by a break that put down his ice long enough to<br />\nOne may see that it is the younger<br />\nThe above includes only those national Relations in memory of<br />\nrun through an opposing team of<br />\nmembers of the faculty who are professors who have direct con- Walter Hines Page, one of the made what appeared to be a bona rather aesthetic clowns for a<br />\nnot included.<br />\ntact with students in the College most distinguished of our early fide touchdown count for nothing. touchdown. The usual Maryland<br />\nDr. Maurice Bloomfield, Pro- of Arts and Sciences, the Engi- Fellows,\" said Dr. Goodnow. It<br />\nJoy was rampant in the Black funeral ceremonies for J. H. U.<br />\nfessor of Sanskrit, has a greater neering School, the College of is hoped that work will begin in and Blue section when Mallonee were also held.<br />\namount of space devoted to his Teachers, and the School of Busi- this school in October, 1926.<br />\nThe funeral march between the<br />\nscooped up Thomas' fumble and<br />\nachievements than any other mem- ness Economics. It does not take \"The method of instruction in<br />\nhalves<br />\nwas sadly out of place as<br />\nran behind the Maryland goal. . A<br />\nber • of the faculty, for fifty-one<br />\ninto account the notable- of the the advanced fields may be liklater developments showed. The<br />\nlines, or about three-quarters of a graduate Schools of Medcine and ened to the setting out of an ex- minute later a dead calm prevailed<br />\n- first few minutes of the third guarin the Johns Hopkins stands when<br />\nPage, are devoted to him. Drs.<br />\nContinued on page 2, column 4<br />\nContinued on page. 3, column 1<br />\nContinued on page 4, column 3<br />\n<br />\nTHIRD OF HOPKINS'PROFESSORS<br />\nEARN PLACE IN WHO'S WHO<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS LETTER, DECEMBER 1, 1925.<br />\n<br />\nYES and NO<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nTelephone.<br />\n<br />\nHomewood 0100<br />\n<br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\n• CHARLES F. REESE, '27<br />\n<br />\nBusiness Manager<br />\nOTII0 J. KELLER III, '26<br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, '26<br />\nCirculation Manager<br />\n<br />\nColumwist<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nROBERT T. SAUERWEIN, '26<br />\n<br />\nAssociate Editors<br />\nA. It's= ENSOR, '26<br />\n<br />\nAssistant Business Managers<br />\n<br />\nJunior Editors<br />\nW. BARNES HALL,.'26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nMORTON HAMBURGER, JR., '28<br />\nBRINTON STONE,'27<br />\nDONALD NILES, '28<br />\nLAWRENCE KATZENSTEIN, '28<br />\nRICHARD R. GRIFFITH, '28<br />\n<br />\nHEYWARD E. BOYCE, JR., '27<br />\nARTHUR SWANSON,'27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, '27<br />\nWILLIAM BORTNER, '27<br />\nIRVING HorrmAN, '28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Aid.<br />\n•<br />\n<br />\nHOMEWOOD,BALTIMORE, MD., DECEMBER 1, 1925.<br />\n<br />\nHOPKINS FOOTBALL<br />\nWell, the team did the trick. Facing tremendous odds.<br />\nwith the betting five to one against them, they went in and<br />\noutplayed, outgamed, and outfought, etc., etc., etc., ( there are<br />\nmany more phrases easily swiped from the rosy-hued columns<br />\nof the city's dailies, but we refrain,)---they outfought old Maryland, and came out with another moral victory (obnoxious<br />\nphrase). There was much surprise at the result of the game.<br />\nbut much more surprise at the smallness of the crowd.<br />\nStarr Mathews, writing in the A i»crican. attributes the size<br />\nof the crowd to the Hopkins' schedule. He says that our habil<br />\nof playing nonentities from other States leads the Baltimore<br />\npublic to ignore our team. He suggests a schedule comprised<br />\nof State teams only, and predicts a large attendance at the<br />\ngames with these institutions. A sort of Maryland Conference, is the gist of his article.<br />\n.<br />\nThe NEWS-LETTER shakes in its shoes when it ventures to<br />\ncontradict Mr. W. R. Hearst's highly paid sporting expert. He<br />\nshould, and probably does, \"know his oats\" when sports are in<br />\nquesiton. Nevertheless, we disagree.<br />\nIt is true that a little more interest might be aroused by<br />\ngames with Western Maryland, Mt. St. Mary's, Washington,<br />\nand perhaps Loyola. It is admitted, however, that the athletic<br />\n•code of some of these institutions is rather lax, and this is the<br />\nfirst objection to such contests. And in the second place, we<br />\ndo not believe that the Baltimore public will patronize Hopkins games, or, for that matter, the games of any other State<br />\ncollege, with any degree of interest, no matter who is the opponent. Baltimoreans are not interested in their own institutions; half of the population think that the Hopkins' teams<br />\nare composed of doctors and medical students; they are ignorant of the existence of any other department of the University.<br />\n,This apathy to home institutions will always keep the crowds<br />\ndown to a small size.<br />\nFor the same reason that Baltimore could not support big<br />\nleague baseball, for the same reaison that_it_does not _support<br />\nany first-class teams in any sport,—for that reason, whatever<br />\nit is, it will not flock to Hopkins' football games, no matter<br />\nhow high a brand of sport is presented.<br />\nThis, in short, is why we differ with the learned Mr.<br />\nMathews. And we believe that it is better to play gentlemen<br />\nfrom out-State colleges than gentlemen from in-State schools<br />\nwith no reputation.<br />\nHowever, to be constructively critical, we would suggest<br />\ngames with teams of the class of Virginia, Washington and<br />\nLee, Swarthmore, and North Carolina. Better to lose to men,<br />\nthan to win from babies and sucklings.<br />\n<br />\nWE POINT WITH PRIDE<br />\nThis week we point with pride to the achievement of the<br />\nBlack and Blue Jay Staff, who put out the November number<br />\nof their publication on the twenty-sixth day of the month.<br />\n—AND-We view with alarm the imranding informals.<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nNEWS<br />\n<br />\nLITERATURE COMPOSED WHILE YOU WAIT<br />\nThe editor wants us to be more literary. More literary<br />\nand less controversial regarding campus affairs.<br />\nThe master has spoken; besides, we believe that he is about<br />\nright. Truly, this column is not suffering from too much literary flavor.<br />\n•<br />\nUnfortunately, however, we don't know just what the<br />\neditor is talking about. There seems to be literature and literature.<br />\nIt is quite likely that thiscolumn is neither one nor the<br />\nother. We, too, have a feeling that Yes and No is not always<br />\ngarbed in immortal phraseology.<br />\nNevertheless, to be literary, one must be literary about<br />\nsomething. And we have rather enjoyed being \"literary\" about<br />\n,collegiate affairs.<br />\nPerhaps the fact that they are easy to write about has led<br />\nus to give too much space to them. There is so much disagreement about the conditions at Hopkins that Yes and No is sure<br />\nto agree perfectly with the feelings and thoughts of someone, and so be literature for that person.<br />\nOf course, there remain other things to be eloquent about.<br />\nIt may be that the editor wants us to be literary about literature.<br />\nThat is not so difficult as it sounds. Granted that we<br />\nmay not know literature when we see it, such is also the case<br />\nwith many of our readers.<br />\nA large part of the art of being considered literary consists in the mere act of writing about writing. The only discretion required is in the choosing of books which the readers<br />\ncannot b'e certain are not \"literature.\"<br />\nAn even more impressive gesture is to print in the column<br />\na few bizarre, insane or empty poems, and to accompany them<br />\nwith serious remarks. In order that we may carry out this<br />\nprogram, Yes and No is hereby thrown open to short contributions of literary pretensions.<br />\nOur preliminary remarks have been over long, we fear.<br />\nWe really must get down to being literary.<br />\nIn the absence of contributions, we are forced to be serious<br />\nabout one of our own poems. It should certainly live up to<br />\nthe above-mentioned specifications: we wrote it in our Freshman year.<br />\nMoreover, we wrote it at a so-called white heat. We had<br />\njust finished reading some poems; we felt immeasurably stirred;<br />\nand we wrote!<br />\nIt is easy to be serious about this immortal verse. Indeed,<br />\nit is little less than sad to ponder over the depths achieved by<br />\nthe Soul of a Freshman when throbbing with the Divine Afflatus. '<br />\nESCAPE<br />\nRushing madly, wildly onward,<br />\nNever pausing to consider,<br />\n• Never stopping to look backward,<br />\nFearing that the slightest falt'ring<br />\nWould cause all my hopes to vanish,<br />\nTo outdistance my ambitions;<br />\nKnowing only that my pleasure,<br />\nAll my joy of living, loving,<br />\nLie in trampling down my doubtings,<br />\nOverwhelming protestations,<br />\nIn confounding all conventions.<br />\n<br />\nHALF<br />\n<br />\nCENTURY<br />\n<br />\nBOOKLET<br />\n<br />\nContinued from page 4, column 1<br />\n<br />\nMedical Education at Johns Hopkins, is especially interesting. The<br />\nplans for changing the curriculum<br />\nare discussed. The many fields,<br />\nas yet unexplored,--are entrmerated:<br />\nThe diseases that are still incurable and the questions and facts<br />\nconcerning them are brought up.<br />\nThe need for new equipment, and<br />\nbuildings is argued. In fact the<br />\nwhole program which the Medical<br />\nSchool and Hospital intend to<br />\nfinance within ten years is given.<br />\nThere is an addendum showing<br />\nthe demand elsewhere for Johns<br />\nHopkins teachers. It is a list of<br />\nfull professors in other medical<br />\nschools that are alumni and former students of the Johns Hopkins Medical School and men who<br />\ndeveloped teaching and research<br />\nability as members of its staff and<br />\nthat of the Johns Hopkins Hospital.<br />\n<br />\nThroughout 'the colleges and<br />\nuniversities of the country student polls are being held in an<br />\neffort to determine the student<br />\nopinion on the World Court question. This question will occupy<br />\nan important part of the program<br />\nof the United States Senate when<br />\nit next convenes, and for this reason, there has been much interest evinced in it. The poll, which<br />\nwas organized by the New Student, is now on in six hundred..<br />\nand fifty colleges and universities. Its object is to band too-ether the students in American<br />\ncolleges in an endeavor to use the<br />\nstrength of the opinions expressed<br />\nto bring about the entry of the<br />\nUnited States into the World<br />\nCourt.<br />\n*<br />\n<br />\n*<br />\n<br />\nThe Haverford News recently<br />\nexpressed the indignation of the<br />\nstudent body against \"rank commercialism\" in football. So many<br />\nHaverford men have suffered injuries at the hands of teams employing paid athletes that they<br />\nalmost fail to recognize football<br />\n<br />\n•<br />\n<br />\nas a \"game\" any longer. Faculty<br />\nresolutions claim that the college<br />\n\"does not pay athletes to attend<br />\nHaverford. However, they do that<br />\nwhich is probably worse in throwing a light team against the crushing physical power of great universities in order to cash in on a<br />\nfew gate receipts.\" The athletic<br />\nauthorities are now facing the possibilities of either buying husky<br />\nathletes to play on Haverford<br />\nteams, or stop stacking her teams<br />\nagainst odds.<br />\n*<br />\n*<br />\nA movement is being made at<br />\nRutgers University to create a<br />\nmemorial to Dr. William V. Leggett. Dr. Leggett was captain of<br />\nRutgers' first team in their first<br />\ngame in 1869 with Princeton.<br />\nThis was the first game ever<br />\nplayed between two colleges.<br />\n<br />\n*<br />\n*<br />\n*<br />\n*<br />\n*<br />\nComment by the student body of<br />\nRutgers after the abolition of the<br />\nhonor system three weeks ago by<br />\nalmost unanimous<br />\nDR.GOODNOW BROADCASTS the students is<br />\nthat<br />\nthe system is<br />\nbelief<br />\nin the<br />\nContinued from page 1, column 3<br />\nRutgers, but<br />\nat<br />\nimpossible<br />\nploring expedition for some un- not<br />\nunbe<br />\npracticable<br />\nknown region such as the heart of that it will not<br />\nprepared<br />\na distant continent,\" stated Dr. til the student body is<br />\nGoodnow. Reducing to concrete- for the obligations it imposes.<br />\nness this last statement, Dr. Careful handling of the question<br />\nGoodnow gave as an example the with iest)ect to incoming- fresh=<br />\nvaluable research work of Dr. Ira men is stressed in opinions offered<br />\nRemsen, the first professor of by various members of the facchemistry at Johns Hopkins, and ulty and undergraduate leaders.<br />\ntold how the men who worked<br />\nIn an interview with one of the<br />\nwith him now teach in scores of professors, he stated that \"some<br />\neducational institutions, and of light may be thrown on the quesothers who hold responsible posi- tion by a recognition of the causes<br />\ntions such as chemical director of of failure of the old system. There<br />\nthe Du Pont Works.<br />\nwas at no time satisfactory ma\"So, when you think of Johns chinery to carry on the workings<br />\nHopkins,\" concluded Dr.. Good- of the system. Another cause for<br />\nnow,\"remember that it is a factor failure was the repeated neglect<br />\nin making Baltimore a port of op- to introduce the incoming freshportunity, that in its laboratories men either to the system or the<br />\nand classrooms there is today the spirit back of it. This neglect was<br />\nsame spirit which in the past sent needless and a prime cause for<br />\nthe caravels of the explorers and failure of the plan.\"<br />\nIt was mentioned that the large<br />\nthe covered wagons of the piocommuting<br />\nelement in the student<br />\nneers in search of new realms for<br />\nbody presented a handicap.<br />\nthe benefit of mankind.\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 1, 1925.<br />\nSOPHOMORES MEET FROSH GLASGOW BOTANIST WILL<br />\nDECEMBER 5<br />\nLECTURE TODAY<br />\nBoth Teams Preparing For Tilt As Dr. Frederick 0. Bower To Deliver<br />\n-Sophomores Get Equipment<br />\nTalks Today And . Thursday<br />\n<br />\nAll signs and omens point toDr. Frederick Orpen Bower, of<br />\n:ward the playing off of the Fresh- the University of Glasgow, will<br />\nman-Sophomore football stilt on lecture at the Civil Engineering<br />\nSaturday, December 5. The soph- Hall today and on Thursday. In<br />\nomores, in view of the fact that his first lecture, Dr. Bower will<br />\nequipment is to be given out, de- discuss \"Engineering Problems in<br />\ntermined at a class meeting on Plants,\" and Thursday his subNovember 24 to carry on football ject will be \"Acquired Characterpractice to the best of their abil- istics in the Evolution of Plants.\"<br />\nity.<br />\nSince 1885, Dr. Bower has been<br />\nPractice is to be held today, Regius Professor of Botany at<br />\ntomorrow and Friday, in prepa- the University. of Glasgow. He<br />\nration for the game, with George was born at Ripon, Yorkshire, and<br />\nParley- probably coaching the after attending the schools of his<br />\nteam. Equipment recently used native town. he studied at Trinby the varsity scrubs will also be ity College and at Cambridge Unidistributed this. afternoon.<br />\nversity. Later, he was lecturer<br />\nThe freshman eleven is priming in botany at the Imperial College<br />\nfor the contest with. games with<br />\nof Science and President of the<br />\nthe Mechanical and Electrical En- Royal<br />\nSociety of Edinburgh.<br />\ngineer teams today and on WedDr. Bower has written a numnesday. The squad is indeed ju- ber of<br />\nbotanical works which<br />\nbilant over the proSpect of play- have gained for him a world-wide<br />\ning the sophmores, especially at<br />\nreputation. Some of his most<br />\nsuch an early date, as it was runoted works are: \"A Course of<br />\nmored that the game might be Practical Instruction in Botany,\"<br />\nput off.<br />\n—Plant Life on Land,\" and -\"The<br />\nBotany of the Living Plant.\"<br />\nDr. Bower is at present a resiHOPKINS AND WHO'S WHO<br />\ndent<br />\nof Glasgow.<br />\nContinued from page 1, column 2<br />\nHygiene. It is interesting to<br />\nnote that more than one-fifth of<br />\nall the professors, associates, and<br />\ninstructors in all the schools of<br />\nthe University are included in<br />\nthe current issue of Who's Who.<br />\nSlightly less than one-third of<br />\nthe Baltimoreans listed in Who's<br />\nWho are Hopkins professors. If<br />\na list of the men -Who are con-<br />\n<br />\nnected with Hopkins as alumni,<br />\ntrustees, or in less direct ways<br />\nwere made, the proportion would<br />\nbe considerably higher.<br />\nThis might be taken as an estimate of how much this University<br />\nmeans to the City of Baltimore<br />\nand the State of Maryland.<br />\n<br />\nSHIRT DISPUTES<br />\nOF BAND SETTLED<br />\nAt a previous meeting of<br />\nthe student'activ,ities council,<br />\nleader Gorsuch, of the band,<br />\ncomplained of a sale of jerseys to the band by the A.<br />\nA. Board. Gorsuch contended the jerseys were too expensive and were of poor material, which soon began to<br />\ntear.<br />\nThe council investigated<br />\nthe complaint and found the<br />\nsale to have been satisfactory<br />\nand the jerseys in good condition when delivered.<br />\nThe Omicron Delta Kappa<br />\nsociety also investigated, and<br />\nreported the sale to have been<br />\nsatisfactory.<br />\n<br />\nBeatty, of Maryland, kicked off to<br />\nPindell, who ran the ball back 20 yards,<br />\nbut fumbled when tackled, Zulick, cf<br />\nMaryland, recovering on Hopkins' 45yard line. Besley made 4 yards at right<br />\ntackle, but failed at center. Linkous<br />\nmade 1 and Tenney punted out on Hopkins' 21-yard line. Taylor kicked back<br />\nto Tenney on his own 40-yard line.<br />\nLinkous made 4 yards at right tackle,<br />\nand Thomas 4 at left tackle. Linkous<br />\nmade it first down, then gained 1 yard<br />\nat center and 5 at right tackle. Thomas<br />\nhit center for 1 and Besley punted to<br />\nTaylor, who ran back eight yards .to his<br />\n33-yard line. Taylor made 1 at right<br />\nguard, then 2 off left tackle before he<br />\npunted to Tenney on his 35-yard line.<br />\nCarey stopped Besley and Linkous made<br />\n1 at center. Besley kicked to Taylor,<br />\nwho ran the ball back 8 yards to his<br />\n45-yard line. Pindell hit right guard<br />\nfor 1 yard. Taylor skirted right end<br />\nfor 7 yards and Pindell made it first<br />\ndown on Maryland's 45-yard line. Clayton smashed center for 4 yards. Left<br />\ntackle yielded 2 to Taylor.<br />\nA pass<br />\ngrounded and Taylor punted over Maryland's goal line. With the ball on the<br />\n20-yard line. Besley made 1 at riglit<br />\ntackle.- Thodias was tackled behind the<br />\nline and fumbled, Mallonee scooping up<br />\nthe ball and running over the goal line,<br />\nbut Referee Hoban ruled he had blown<br />\nhis whistle before the fumble and that<br />\nthe ball was dead. The ball was brought<br />\nback and Maryland took time out. Besley punted to Taylor, who rin out of<br />\nbounds on Maryland's 40-yard line.<br />\nTaylor made 5 off right tackle. Lawrence broke through the righ\" side of<br />\nthe line for 12 yards and first down.<br />\nPindell pushed through center for 5<br />\nYards to Maryland's 20-yard line as thP<br />\nquarter ended.<br />\nScore: Hopkins, 0;<br />\nMaryland, O.<br />\n<br />\nSecond Quarter<br />\nTaylor made 1 around right end, then<br />\nfirst down at left guard.<br />\nLawrence<br />\nMade 2 at center and Taylor 1. Leibensperger's try for placement from the<br />\n20-yard line was low and wide, Maryland getting the ball on the 20-yard<br />\nline. Linkous lost 2 yards, but Besley<br />\nhit center for 8. Besley got off a good<br />\nMint to Hopkins' 38-yard line. Pindell lost a yard, but made 5 on a fake<br />\nkick. Taylor punted to Maryland's 39Yard line. Linkous made 1 at right<br />\nguard. Besley made 2 at right tackle.<br />\nBesley crashed the same spot for 4,<br />\n<br />\n•<br />\n<br />\nthen punted to Taylor, who ran back 4<br />\nto Hopkins' 26-yard line. Taylor failed<br />\nat left tackle, then punted to MaryBesley made a<br />\nland's 45-yard line.<br />\nyard at center. Linkous hit left tackle<br />\nfor a yard. Tenney passed to Adams<br />\nfor a gain of 20 yards and first down.<br />\nBesley gained 3 at right end. Linkous<br />\ncrashed center for 1. On a double pass<br />\nBesley lost 2, then punted out on HopTaylor likewise<br />\nkins' 13-yard line.<br />\npunted, Tenney being downed on Hopkins' 40-yard chalk. On a triple pass<br />\nand forward, beautifully executed, Besley to Tenney to Supplee to Stevens, the<br />\nlatter ran 20 yards for a touchdown,<br />\nnad added the extra point by dropkick.<br />\nScore: Maryland, 7; Hopkins, 0.<br />\nBeatty kicked off over Hopkins' goal<br />\nline, the ball being put on play on the<br />\n20-yard line. Besley intercepted a pass<br />\nfrom Taylor and ran to the 20-yard line.<br />\nBesley made 1 at right tackle. A pass,<br />\nTenney to Stevens, made 8 yards. Linkout made it first down on Hopkins' 10yard line. Mallonee got Tenney for a<br />\n1-yard loss. Maryland fumbled, but recovered for a 1-yard gain. A lateral<br />\npass, Linkous to Stevens, gained 4<br />\naround left end as the half ended, the<br />\nball being on Hopkins' 5-yard line.<br />\nScore: Maryland, 7; Hopkins, 0.<br />\n<br />\nFORTY-SIX NATIONALITIES Y. M. C. A. Drive<br />\nREPRESENTED AT<br />\nClimbs Slowly<br />\n\"Y\" BANQUET<br />\nAccording to Y. M. C. A. DirectStudents Of All Maryland Colleges or E. A. Schaal, the campaign<br />\nEntertained At Turkey<br />\nfor the Hopkins Chest Fund has<br />\nDay Gathering<br />\n<br />\nlagged very perceptibly. Although<br />\nOne hundred and forty-eight three hundred of the six hundred<br />\nstudents of at least forty-six dif- dollars which the Y. M. C. A. has<br />\nferent nationalities were enter- set as its goal was pledged the<br />\ntained by the Intercollegiate De- first day of the drive, only one<br />\npartment of the Y. M. C. A. at a hundred dollars more had been<br />\nbanquet given on Wednesday eve- pledged at a late hour on Wedweek<br />\nning, November 25, at the Central nesday, November 25, a<br />\nlater.<br />\nY. M. C. A. Turkey headed the<br />\nIt is doubtful if the drive picked<br />\nmenu, but the country of that up during the Thanksgiving holimime was one of the few not rep- day. It is probable, according to<br />\nresented by the guests. China had Mr: Schaal, that the goal of six<br />\nthe greatest number of represent- hundred dollars, half of which is<br />\natives, her twenty-three being al- to go to the Student Friendship<br />\nCommission, will not be reached<br />\nmost double that of Russia's<br />\nunless the returns take a decided<br />\ntwelve. Porto Rico, with ten, and jump.<br />\nNEW LACROSSE SCHEDULE<br />\nGermany, Roumania, and Siam,<br />\nContinued from page 1, column 1<br />\neach<br />\nwith six, were next in order<br />\nHopkins list, together with the<br />\nDON'T FORGET!<br />\nMt. Washington Club. Mt. Wash- of number.<br />\n—clothes that are tailored to<br />\nThese students, gathered from<br />\nington is usually listed for June<br />\nyour measure fit you best.<br />\nWeek, but this year there is not the Peabody Institute, Goucher<br />\n—they have the right cut..<br />\n—they make you feel welllikely to be a game during the College, University of Maryland,<br />\ndressed.<br />\nweek of festivity. However, the<br />\nand other nearby institutions, in<br />\nAthletic Office will co-operate with<br />\nthe June Week Committee in put- addition to those from all departting on a contest with Toronto if ments of Johns Hopkins Univerthe committee gains -the. agree- sity and Hospital, sat down to<br />\nment of the home team and cares tables plentifully provided with<br />\ng<br />\nB<br />\nto negotiate for the game.<br />\nt4*<br />\nthe • usual Thanksgiving delights,<br />\n•<br />\nL._<br />\ns<br />\n14fluisinamm5—<br />\n• Lacrosse Schedule<br />\nfrom browned sweet potatoes to<br />\nrrAik.17_,COTL.$<br />\nThe 1926 schedule as follows:<br />\ncranberry sauce.<br />\ncf,ifilvt.ore<br />\nApril 3—St. John's (pending).<br />\nE. A. Schaal was the toastmasApril 10—Oxford-Cambridge.<br />\nSee \"GARB\" MALLONEE & FRAMK MEREDITH at the Barn<br />\nter, and introduced Carlton HarApril 17—Virginia.<br />\nDowntown at 407 N. GAY St.<br />\nApril 24—United States Military rison, who extended to the guests<br />\nAcademy.<br />\nthe greetings of the Y. M. C. A.<br />\nENGLISH OVERCOATS<br />\nMay 1—Swarthmore (away).<br />\nThis was followed by a response<br />\n$30.00 to $75.00<br />\nMay 8—Onandaga Indians.<br />\nfrom G. A. Pacheco, president of<br />\nMay 15—Pennsylvania (away).<br />\nCosmopolitan Club. After<br />\nMay 22—University of Maryland. the<br />\nMc PHERSON'S<br />\nfurther greetings, Lewis C. Moon<br />\n1 1 E. BALTIMORE ST.<br />\ndelivered a message from the<br />\nchurches. Following a piano solo,<br />\n<br />\nPlay By Play of Hopkins-Maryland Game<br />\n--_ First Quarter<br />\n<br />\n3<br />\n<br />\nVernon 2355<br />\n<br />\nTaylor's pass to Lawrence. Besley cut<br />\nright tackle for 12 and first down. Besley lost 5.<br />\n<br />\nmessages, brought by eleven guests<br />\nTHE FLAG, BANNER AND PENNANT SHOP<br />\nSUCCESSORS TO SISCO BROS.<br />\nfrom their respective nations,<br />\nFlags Banners, Pennants, Arm Bands,<br />\nwere heard by those present.<br />\nNovelties. Silk Banners for Schools,<br />\nSocieties and Fraternities.<br />\n<br />\nR. H. TAYLOR<br />\n<br />\nOn a double pass Stevens<br />\n<br />\ngained 1.<br />\n<br />\n302 PARK AVENUE, BALTIMORE.<br />\n<br />\nMaryland was penalized 15<br />\n<br />\nyards. Besley punted to Taylor, -who<br />\nran back 15 yards to Hopkins' 35-yard<br />\nline. Taylor made 4. A double pass<br />\nfailed to gain. Lawrence took Taylor's<br />\n20-yard pass and ran 20 yards more to<br />\nMaryland's 25-yard line.<br />\n<br />\nTaylor failed<br />\n<br />\nat the line, but passed to Lawrence for<br />\nTaylor found a hole at<br />\n<br />\na 5 yard gain.<br />\n<br />\nleft tackle and ran eleven yards to a<br />\nfirst down on Maryland's 10-yard line.<br />\nTaylor made 5 at center. Lawrence \\NW<br />\nstopped by Bafford at center, as the<br />\nScore: Maryland, 7;<br />\nquarter ended.<br />\nHopkins, 0.<br />\n<br />\nFourth Quarter<br />\nStevens intercepted a pass from Tayfor on Maryland's goal line and ran to<br />\n5-yard line.<br />\n<br />\nLinkous made 1, then 4<br />\n<br />\nat the line. Besley punted to Taylor on<br />\nA forward<br />\nMaryland's 45-yard line.<br />\npass grounded, another was intercepted<br />\nbut Maryland had been offside.<br />\n<br />\nTenney<br />\n<br />\nThird Quarter<br />\n<br />\nintercepted a long forward to Mallonee<br />\n<br />\nLeibensperger kicked off to Beatty on<br />\nMaryland's 40-yard line. Stevens made<br />\n3 at left tackle, then 2 at right tackle.'<br />\nHe then made 9 and first down around<br />\nBesley made 6 at right<br />\nright end.<br />\ntackle. On a triple pass Stevens was<br />\nsmothered. On another triple pass SupMaryland<br />\nplee's forward grounded.<br />\npunted, but was penalized and had to<br />\npunt over again after having been set<br />\nback 15 yards. Taylor ran back 10 to<br />\nhis 30-yard line. Pindell crashed center for 2 and left tackle for 5. Taylor<br />\npunted to Maryland's 28-yard line. Carey nailed Linkous for a loss. Linkous<br />\nmade 1 at center Leibensperger blocked<br />\nBesley's punt and Mallonee recovered<br />\nfor Hopkins on Maryland's 12-yard line.<br />\nTaylor hit right tackle for a yard and<br />\nthen passed to Lawrence for 5 more.<br />\nPindell made 1, but Lawrence failed to<br />\nmake first down, and Maryland took<br />\nthe ball on her 3 yard line. Linkous<br />\ngained two yards at center on two<br />\nplunges, and Besley punted to Taylor,<br />\nwho ran back 15 to Maryland's 45-yard<br />\nline. Taylor passed to Lawrence for 7<br />\nyards. Hopkins was penalized 5 yards<br />\nfor being offside. Linkous intercepted<br />\n<br />\nand was downed on his 30-yard line. On<br />\na fake pass Stevens gained 15 yards<br />\nand first down through left tackle. Stevens gained another yard, as did Linkout, on line plays.<br />\n<br />\nBesley punted to<br />\n<br />\nTaylor on his 43-yard line.<br />\n<br />\nHopkins Starts Drive<br />\nLawrence made 2 at center. A. pass,<br />\nTaylor to Mallonee, made 12 and first<br />\ndown. Two more forwards grounded,<br />\nbut another, Taylor to Clayton, made<br />\nTaylor smashed<br />\nanother first down.<br />\nright guard for 2. A pass, Taylor to<br />\nMallonee, made another first down on<br />\nMaryland's 20-yard line. Taylor made<br />\n3 at right guard, but a recovered fumble<br />\nlost 4. A forward, Taylor to Mallonee,<br />\nmade another first down on Maryland's<br />\n10-yard line. Taylor made 4 off left<br />\ntackle, then 2 at right tackle. Lawrence crashed center for 3 yards to<br />\nMaryland's 1-yard line.<br />\nOn a fake<br />\nplunge by Pindell, Taylor crash center<br />\nto a touchdown. Clayton changed his<br />\nmud cleats to a kicking shoe and place<br />\nkicked the extra point. Score: Hopkins, 7; Maryland, 7.<br />\n<br />\nPhone: Homewood 9621<br />\n<br />\nBOULEVARD RESTAURANT J. H. FURST CO.<br />\nFANCY DELICATESSEN<br />\nPrinters of<br />\n<br />\n2022 N. Charles St., Balto., Md. PHILOLOGICAL & SCIENTIFIC<br />\n<br />\nSPECIAL RATES FOR HOPKINS STUDENTS<br />\n<br />\nKodaks<br />\nCameras<br />\nSupplies<br />\n<br />\nDeveloping<br />\nPrinting<br />\nEnlarging<br />\n<br />\nZepp Photo Supply Co.<br />\n<br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore.<br />\nPhone: Calvert 4835<br />\n<br />\nCARL J. DOEDERLEIN<br />\nWATCHES,<br />\nDIAMONDS, JEWELRY<br />\n<br />\n3044 Greenmount Ave.<br />\n<br />\nFINE WATCH, CLOCK & JEWELRY<br />\nREPAIRING A SPECIALTY<br />\nMFRS. OF FRATERNITY GOODS OF<br />\nALL KINDS<br />\n<br />\nLet Us Develop Your Films.<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br />\n<br />\n504 PARK BANK BUILDING<br />\nLexington at Liberty Sts.<br />\n<br />\nBaltimore's Best Store<br />\n<br />\nHOCHSCHILD,KOHN 8,c,Co.<br />\nHoward and Lexington<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW & FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br />\n<br />\n\f4<br />\nHALF CENTURY COMMITTEE<br />\nISSUES BOOKLET ON<br />\nMEDICAL WORK<br />\n<br />\nTHE JOHNS HOPKINS NEWSLETTER, DECEMBER 1, 1925.<br />\nJAYS AND RAVENS BATTLE<br />\nNoted Pianist<br />\nTO THIRD TIE IN<br />\nat Dorms Tonight<br />\nANNUAL GAME<br />\nFrederick Dixon, noted pianist,<br />\n<br />\nBooklet Is Divided Into Four Parts; will give a concert at 8:15 .to- On Third Attempt Hopkins Puts Over<br />\nTouchdown<br />\nInteresting History Of -Medical<br />\nnight in the Commons Room of<br />\nEducation Given<br />\nContinued from page 1, column 5<br />\n<br />\nthe -Memorial Dormitory. The<br />\nThe<br />\nof Inquiry in liedi- concert is under the auspices of<br />\ncal Education is a booklet,, pub- the Musical Club through the<br />\nlished by the Johns Hopkins Half- courtesy of the Mason and HamCentenary Committee, that should lin Studios.<br />\nMr. Dixon, a protege of the<br />\nhe of great interest to every Hopgreat Joseffy, has risen to an emikins student, particularly medical<br />\nnence recently. He will be asand premedical students.<br />\nsisted by Arthur W. Morgan, Jr.,<br />\nThe booklet is divided into ,four violinist, and Irma Schiaffino, sodistinct Parts: first, Medical Ed- prano. There will be no admisucation in America; second, Medi- sion.<br />\ncal Education at Johns Hopkins,<br />\na Description; third, Medical Education at Johns Hopkins,an Evaluation fourth, Future Medical<br />\nEducation at Johns Hopkins. The<br />\nfirst part discusses and attacks<br />\nmedical schools as a whole. Of<br />\nthe seventy class A medical schools<br />\nin this country only fifteen are<br />\n<br />\nSigma Tau Delta<br />\nAwarded Cup<br />\nThe Sigma Tau' Delta fraternity has the highest average made<br />\nfor the scholarship cup awarded<br />\nby the interfraternity board. The<br />\nCup is awarded each term to the<br />\nfraternity having the highest<br />\nmarks.<br />\nFollowing are the competing<br />\nfraternities and standing:<br />\n78.25<br />\nSigma Tau Delta<br />\nDelta Gamma Theta. _76.63<br />\n.76.01<br />\nKappa Alpha<br />\nPhi.<br />\n..75.42<br />\nAlpha Delta<br />\n,<br />\n.75.36<br />\nKappa Sigma<br />\n75.18<br />\nPhi Kappa Psi<br />\n74.67<br />\nAlpha Tau Omega<br />\n73.06<br />\nDelta Phi<br />\n71.02<br />\nBeta Theta Pi<br />\n70.00<br />\nPhi Gamma Delta'<br />\n70.00<br />\nAlpha Kappa Phi<br />\nOmicron Kappa Omi70.00<br />\ncron<br />\n<br />\nter were mighty discomfiting to<br />\nJohns Hopkins, but shortly the<br />\nBlue team braced, and there it<br />\nstarted on its way to make the<br />\nlast half a Johns Hopkins affair.<br />\nThree times hi the last two<br />\nperiods, the University team<br />\nworked its way to a scoring position. Twice it failed.<br />\nThe initial chance of the second<br />\nhalf came when Leibensperger<br />\nblocked Besley's punt and Mallonee captured the ball on Maryland's eleven yard mark. Largely<br />\nthrough Taylor's efforts the pigskin was carried to the four-yard<br />\nline. Here the -Marylanders held<br />\nfor downs.<br />\n<br />\nFURNITURE OF QUALITY<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDRAPERIES<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nSTEIN BROS. & BOYCE<br />\nInvestment Bankers Since 1871<br />\n<br />\n6 S. Calvert Street<br />\nBALTIMORE, MARYLAND<br />\n<br />\nllie<br />\n<br />\nHub<br />\n<br />\nDown Charles, to Baltimore St.<br />\nThe clothing store<br />\nthat knows the difference<br />\nbetween real and imitation College style<br />\n<br />\nInterception Saves Havens<br />\nLater<br />\nin the third quarter'Maryfollowing the highest aims of modfound itself in a jam,<br />\nagain<br />\nland<br />\nern education in medicine. These<br />\nhaving been forced to the five-yard<br />\nfifteen schools are trying to make<br />\nchalk mark by an aerial attack<br />\nmedicine a biological science by<br />\nthat the . Blue Jays were employapplying the method of direct sciing for the first time during the<br />\nence to the study in life. The<br />\ngame. The passes, interspersed<br />\nwith running, had thus far raised<br />\nproper training of 'students and<br />\nhopes of the crowd, when Taythe<br />\nthe faculties that make it possible<br />\nlor launched a pass that .looked<br />\nare enumerated and explained.<br />\nlike it would be ,a touchdown, But<br />\nHistory of Medical Education<br />\nagain the dreams of the Blue Jays<br />\n115-117 E. Baltimore St., Corner Grant<br />\nA very interesting history of<br />\nwere shattered as a Maryland back<br />\nHart Schaffner & Marx Clothes<br />\nintercepted the. toss.<br />\nmedical education at Hopkins is<br />\nBesley punted to stave off imgiven in the second part. When<br />\nmediate danger but the Jays were<br />\nJohns Hopkins made a bequest of<br />\nright back at the scoring zone.<br />\n$7,000,000 for a university and Newcomb Wins<br />\nPasses brought them to the tenRifle Match yard line and runs took them to HOPKINS PRESS PUBLISHES<br />\nhospital, he .directed that they be<br />\nTWO NEW BOOKS<br />\nunited to a medical. school. The<br />\nE. M. Newcomb, hitherto a dark within a foot 'of a score with the<br />\ngrowth of the medical school and horse in , the competition foi: a<br />\nfourth down coming. Here Tay- President Goodnow's Report Included<br />\n.<br />\n\"THE WONDER MOTOR FUEL:<br />\nits relation to the university and. place on the Johns Hopkins Rifle<br />\nIn Recent Releases<br />\nlor took the ball and crashed<br />\nthe hospital are clearly shown. Team, broke through in the third through for the final score of his<br />\nJust fill the car up with<br />\nTwo books and two periodicals<br />\nThe medical school gave birth to intra-mural match, held Nov. 20,<br />\nBETHOLINE and FEEL<br />\nlong football. career.<br />\nhave just been published by The<br />\nthe school of hygiene, in many to capture first place and secure<br />\nthe power at your cornPress. The books<br />\nHopkins<br />\nJohns<br />\nClaiton Ties Score<br />\nways the most important develop- the dazzling collegiate vest offered<br />\nman d.<br />\nare Numbers 35 and 36 in the Inment in medical education during to the winner by the Rifle Club. 'Apprehension and dread filled<br />\nstitute for Government Research<br />\nrecent years. Short biographies His score of 182 for the standing the stands. It seemed that they<br />\nSHERWOOD BROS., INC.<br />\nSeries; while one periodical is the<br />\nof the three successive heads of and kneeling positions topped were so near to defeat and still Annual Report of President Frank<br />\nthe hospital are given. The hospi- Garis's total by six points. Baird, ,S0 close to what some have called<br />\nS. Goodnow, and the other is Voltal, care of the sick, and the fac- Hall, and Muir took third, fourth', a moral triumph, .and at the same<br />\nume XIXII, Number four, of the<br />\nulty, students, alumni, curriculum and fifth places, respectively, with time were so far from the triumph 'American Journal of Mathematand plant of the Medical School scores of 179, 172, and 170. A sought after. The game was deics Series.<br />\nare described.<br />\ncigarette case, a tie, 100 rounds layed while the stands wondered<br />\nThe first of the books in the<br />\nThe third part is given over to a of ammunition, and 60 rounds of why. Clayton had asked for a Government Research Series, by<br />\nlist discussing the Doctors of the ammunition were the prizes won special kicking shoe and he was<br />\nGustavus A. Weber, is entitled<br />\nJohns Hopkins Hospital and Med- by Newcomb's rivals for honors. putting it on. Soon the teams had<br />\n-The Bureau of Standards,\" and<br />\nlined up. The ball was snapped<br />\nical School who have been, by their<br />\nis issued as a Service Monograph<br />\nback and Clayton booted the pig<br />\nwork, experiments and discoveries,<br />\nof the United States. It is opened<br />\nPublicity Board to<br />\nskin fair through the uprights.<br />\nof great service to society and sciHandle Bulletin The Maryland team .appeared to with a•foreword concerning the<br />\nence. Some of the names appearand plans of the monoThe Student Activities Council be'deadened by this turn of even-hs aims<br />\ning in the list are: Drs. Welch,<br />\nThen a complete history<br />\ngraphs.<br />\nprone%<br />\ns••,....<br />\nOsier, Halsted, Kelly, M all, has assigned the care of the bulle- for in the two and one-half min- of the bureau is given, followed<br />\nHowell and Thayer. The work tin boards in the Barn and the utes remaining, they did not reg- by its detailed activities in electhat has been accomplished and is Post Office to the Publicity Board. ister the 'slightest sign of a recoup. tricity, engineering, chemistry,<br />\nThe line-up:<br />\nbeing done by the hOspital and Previously the boards have been<br />\noptics, and anytime other branches<br />\nbe<br />\nwill<br />\nnotices<br />\nnow<br />\nneglected<br />\nbut<br />\nschool is related.<br />\nHopkins,7<br />\nMaryland, 7<br />\nof science. An interesting acThe fourth part, the Future of posted at the beginning of each Mallonee<br />\nL. E..(capt.) Supplee count of the organization and perweek.<br />\nLeibensperger L. T.<br />\nZulick<br />\nContinued on page 2. column 3<br />\nsonnel of the Bureau is then<br />\nWilgis<br />\nRothgeb<br />\n.L. G.<br />\nFinally, there is an appenC.<br />\nBafford given.<br />\nLevy.<br />\nlaws,<br />\nSADIE, GRAND OLD CAN OF COLLEGE<br />\nConant<br />\nR. G.<br />\nBromley dix with an account of<br />\nCary<br />\nR. T.<br />\nAdams finances, and other details of the<br />\nCABDOM, MEETS SUDDEN DEATH Berndt<br />\nR E.<br />\nBeatty Bureau of Standards.<br />\nTenney<br />\nSadie is dead! Hopkins' most straight for the M. E. Building. Taylor (capt.)....Q., B.<br />\n\"The Government Printing OfL. H.<br />\nThomas<br />\nLawrence<br />\nfamous collegiate cab expired at Now Frank did not want to hurt Pindell<br />\nby Lawrence F. SchmeckeR• II.<br />\nBesley fice,\"<br />\nD. dewas<br />\noff<br />\nkey<br />\nbuilding<br />\nbut<br />\nSadie<br />\nthe point of the acetylene torch the<br />\nClayton<br />\nF. B.<br />\nLinkous lier, who received his Ph.<br />\nUniHopkins<br />\nlast Wednesday before an enor- and her brakes refused to func- Score by periods:<br />\ngree at the Johns<br />\nin<br />\nbook<br />\nHopkins....<br />\n0<br />\n0<br />\n0<br />\nfollowing<br />\n7-7<br />\nmous crowd of mourners who tion. There was a great crash and<br />\nversity, is the<br />\nAND it's practical<br />\nMaryland<br />\n0<br />\n7<br />\n0<br />\n0-7<br />\nMonoService<br />\nstood silent with heads bowed and splintering of tin and when the<br />\nthe same series of<br />\nas well as keenSubstitutions: Maryland — Stevens<br />\nuncovered. The end came in this dust had cleared away it was seen<br />\ngraphs. It also starts with ,a forefor Thomas, Troxell for Linkous,<br />\nlooking; the blackthat Sadie had completed the last Whelchel for Tenney. Touchdowns— word on, the aim of the monomanner.<br />\ntipped lacquer-red<br />\nFrank Wolbert, the erstwhile of her 200,000 miles.<br />\nStevens, Taylor. Tries for point— graphs, and then briefly sketches<br />\nIn some ways the wreck was of Stevens (by dropkick), Clayton (by the history, activities, organizaowner, was steering peacefully<br />\nbarrel will be found<br />\ndown the road to the barn when great benefit to the college, for place kick, Taylor holding the ball). tion, and personnel of the printno<br />\nmatter where<br />\nsuddenly two co-eds of great beau- all the Ford owners who have been Referee—George, Hoban, Dartmouth. ing office. There is also an appenUmpire — Fisher, Columbia.<br />\nHead<br />\nyou Park 'er.<br />\nty caught his eye and held it. In driving cans around without linesman — Crowley, Bowdoin.• Field dix which gives all the figures confact they held it so long that when wheels, engines and so forth took judge—Heneage, Dartmouth. Time of cerning finances, laws, bibliography, and other details.<br />\nhe came to Sadie was headed them from what was left of Sadie. periods-L-15 minutes.<br />\n<br />\nHenry's<br />\n<br />\nBETHOLIN<br />\n<br />\nANFOIRD'S<br />\n<br />\nPASTE<br />\nSANFORD'S ca,,,ipt<br />\nIBRARY<br />\n<br />\nVAS.<br />\n<br />\nDries Quick<br />\nSticks Tisiht<br />\nNever Stains<br />\n<br />\nCarte<br />\ndu Jour<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXX, No. 17<br />\nNEW LACROSSE SCHEDULE<br />\nSHOWS IMPORTANT<br />\nCHANGES<br />\nNavy, Lehigh, and Mt. Washington Do<br />\nNot Appear. Vacancies Filled By<br />\nSt. John's And Army<br /><br />\nRevisions of a very notable character are to be found in the recently released 1926 lacrosse<br />\nschedule. The absence of Lehigh,<br />\nNavy, and Mt. Washington, hitherto considered among the most<br />\nformidable of the old schedule, is<br />\nthe most glaring of all the omissions.<br /><br />\nHOMEWOOD,BALTIMORE, MD., DECEMBER 1, 1925.<br /><br />\n0. D. K. INITIATION AT<br />\nASSEMBLY THURSDAY<br />\nThe Beta Circle of Omicron Delta Kappa will hold<br />\na public initiation at the Assembly Thursday.<br />\nThe private initiation and<br />\nbanquet will take place that<br />\nevening at the Rennert.<br />\nDr. Charles Leber will be<br />\nthe speaker of the day. Dr.<br />\nLeber, it will be remembered,<br />\nwas the speaker at the initiation last spring. Dr. Leber<br />\nwas a member Of the society<br />\nwhen an undergraduate, and<br />\nwas one the best cheer leaders ever to lead a Hullaballoo.<br /><br />\nPRICE 5 CENTS<br /><br />\nJAYS AND RAVENS BATTLE<br />\nTO THIRD TIE IN ANNUAL<br />\nTHANKSGIVING DAY CLASSIC<br />\nCAPTAIN WALKER-TAYLOR LEADS HOPKINS<br />\nDR.GOODNOW BROADCASTS<br />\nTO TOUCHDOWN IN LAST MINUTE CHARGE<br />\nOVER NEW SUPERPOWER WBAL<br />\nStresses Johns Hopkins As Pioneer<br />\nIn Advanced Learning<br /><br />\nComing from behind with a the ball was brought to where<br />\nThomas was downed because the<br /><br />\npunch and a spirit not previously<br />\nshown this season, and never<br />\nexcelled in any other season, the<br />\nJohns Hopkins football team ran,<br />\nrushed and passed its way into<br />\novercoming terrific odds, and car-<br /><br />\nreferee's whistle had blown beforeMallonee had gotten the<br /><br />\n\"An important part is played<br />\nFails To Score<br />\nspheroidKk<br />\nby the Johns Hopkins University<br />\nOxford-Cambridge<br />\nthe second<br />\nWith<br />\nthe<br />\nopening<br />\nof<br />\nin making Baltimore a port of opNevertheless, a hard schedule<br />\nquarter Johns Hopkins ushered<br />\nportunity,\" was the keynote<br />\nrying over for another year the in its first opportunity for scoring.<br />\nhas been prepared, in which St.<br />\nstruck by Dr. Goodnow in a<br />\ntie score that had already existed Throngh the work of Taylor, PinJohn's, UniversitY - of Virginia,<br />\nspeech thrown on the ether last<br />\nand Penn State have_been listed<br />\ntwo years between Johns Hopkins dell and Lawrence, the ball was<br />\nMonday night, November 23rd. by<br />\n• to replace those who because of A. T. O.'S FINED BY BOARD<br />\nand University of Maryland.<br />\nmarched to Maryland's 15-yd. line.<br />\nBaltimore's new super-power ravarious conflicts have had to be<br />\nMallonee<br />\nPilots<br />\nJays<br />\nFOR VIOLATION<br />\nHere the \"Old Liners\" held like a<br />\ndio broadcasting station WBAL.<br />\ndropped.<br />\nOxford - Cambridge,<br />\nwas<br />\nthat<br />\nThe Blue Jay team<br />\nstone wall. Leibensperger was<br />\n1)r. Goodnow took the motto<br />\nwhile not exactly a newcomer, Act Of Conant On November 10 Brings<br />\nCaptain<br />\nfield<br />\nby<br />\non<br />\nthe<br />\nlead<br />\nout<br />\nselected to try for a field goal.<br />\nFive Dollar Impost<br />\nmay be called an addition to the<br />\nof the new station, -Baltimore,<br />\nwonderful aggrega- His kick front placement was unnew group of opponents. The<br />\nThe Alpha Tau Omega frater- The Port of Opportunity,\" and Taylor was a<br />\ntion,<br />\nworking<br />\nlike a clock under successful and Maryland regained<br />\nEnglishmen appeared on Home- nity was brough t before the In- developed it so as to show the imlie generalship of Mallonee, who the ball on her twenty-yard line.<br />\nwood field two years back and ter-Fraternity Board on Monday<br />\nportant part played by Johns<br />\nwere defeated by the home team. for violation of the rushing agreedirected the play from the -hudThis was the first scoring threat<br />\nHopkins in that \"it offers to stuNo games have been omitted as ment. They were fined $5.00.<br />\ndle.- Not only in generalship did The Homewood team had been<br />\na result of disagreements. Lehigh<br />\nMcCleary and Conant, two dents who have the eager and ex111 allonee deserve distinction, but playing a clever, aggressive, beauhad practically completed its members of the A. T. 0. frater- ploring type of mind a means for<br />\ns schedule, leaving May 29 open for nity, were seen talking to Ness pursuing fruitful adventures in in stellar, clever play at his end tiful game of football against a<br />\nposition, particularly in his work team that was indisputably a<br />\nJohns Hopkins, before it learned and Todd, two freshmen, during the field of learning.\"<br />\nat the recent convention in New tbe silence period. The conversaof receiving the forwards launched worthy group. But when the try<br />\nAdvanced Work<br />\nYork that this University would tion took place in the basement<br />\nby Taylor, he gained the plaudits for a field goal failed, the onlookThe chief distinction of the<br />\nnot play officially after May 22. of Gilman Hall near the Post Ofof eleven thousand spectators ers sank back in their seats with<br />\n•The Bethlehem authorities made fice and, according to a witness, Johns Hopkins University, Dr.<br />\ngathered at the Baltimore Stadium sighs; many short sighs of regret,<br />\nevery possible effort to work the lasted for two or three minutes. Goodnow pointed out, has been<br />\nBlue_Jay gamia at another date, .-, Ness was brought before the and is its ,advanced_ work in the expecting. a Maryland victory.. But some long drawn sighs of relief.<br />\nthe gods of football made fate<br />\nbut all plans were unavailing.<br />\nboard, and testified that Conant<br />\nMaryland Scores<br />\ntype of study that goes beyond the<br />\nhis<br />\nhim<br />\nif<br />\nseen<br />\nhe<br />\nhad<br />\nasked<br />\nhad<br />\ncoaching<br />\nstaff<br />\nof<br />\nkind,<br />\nand<br />\nthe<br />\nSt. John's<br />\nThe quarter, however, was not to<br />\ncollege years and strikes into new<br />\nJohns Hopkins built up a gridiron be without its scores. It was not<br />\nSt. John's and Virginia may be hat. Their two lockers being befields. Alwhys has this been true.<br />\nconsidered the real newcomers of side each other, Conant thought<br />\neleven that was well-nigh flawless long before Maryland opened its<br />\nthe season. For two or three Ness may have gotten his hat by In 1876, when the new University to wreck the expectations of the<br />\nbag of tricks and let out a proopened, it was necessary for all<br />\nyears St. John's has been without mistake.<br />\nshove<br />\nsupporters<br />\nand<br />\nMaryland<br />\nductive triple pass. Besley reWhen • the subject was put be- Americans who wished to do ada lacrosse team of any note. They<br />\nthe Blue team and ceived the pellet from center,<br />\nspirits<br />\nof<br />\nthe<br />\nit<br />\ndiscussion<br />\nboard<br />\nfor<br />\nfore<br />\nthe<br />\nhave not played Johns Hopkins<br />\nvanced work along almost any<br />\nfor some years. The University was pointed out that, although line to go to Europe to study; by its backers to hitherto unattained transferred it to Tenney who reheights of elation.<br />\nof Virginia put out an unofficial they were not talking fraternities,<br />\nleased it too. Supplee, Supple<br />\nstressing advanced work, Johns<br />\nteam last year and confined its there was a feeling of friendship<br />\nFrom the very outset it was passed to Stevens who ran twenty<br />\nHopkins inaugurated a plan so<br />\nteam to a small number of games. in starting the conversation.<br />\nevident that the Jay and the Raven yards for a touchdown. Stevens<br />\nNess and Todd were pledged by immediately successful that it reL'Hirondelle Club was played<br />\nwere just abotit equally matched then succeeded in the try for<br />\nA. T. 0. fraternity.<br />\nthe<br />\nceived the compliment of widetwice and was victorious each<br />\ntheir annual -dispute. Old grads points.<br />\nin<br />\nwas<br />\nmade<br />\nmotion<br />\nthat<br />\nthe<br />\nA<br />\ntime. The Virginians have more<br />\nspread imitation.<br />\nthe<br />\nA.<br />\nT.<br />\n0.'s<br />\nnot exceed<br />\nand young grads on the sidelines<br />\nexperience this year and some very fine of<br />\nAs a result of an intercepted<br />\nPioneers<br />\nand in the stands harked back<br />\ngood material. They are expected $25. This was amended to read<br />\nP'5s Maryland gave the Jays an$15. This motion was defeated.<br />\nAs another illustration of the<br />\nto put up a nice argument.<br />\nto another day to give the 1925 other seige of worry during the<br />\nIt was finally decided that the pioneer work done by'Johns HopL'Hirondelle is off the Johns<br />\nteam the greatest acclamation it few remaining minutes of the half<br />\nfine be $5.<br />\nContinued on page 3, column 3<br />\nkins, Dr. Goodnow cited the Medwas in their power to give by but the whistle blew while the<br />\nical School which was added to<br />\nlikening the present warriors to teams were lining up on the fivethe University in 1893. Organsome famous group that trod the yard chalk and the teams -adized so as to include the study<br />\nfootball turf of former years. But journed to their respective locker<br />\nand observation of patients, doumost of the onlookers recalled the rooms and consultations.<br />\nA search through Who's Who Buchner, Hollander, and Robinbling the length of instruction as<br />\nIn America reveals the fact that son follow closely, with forty-four<br />\nfamous team of '23 that checked<br />\nClowns Take Field<br />\ncompared with most existing<br />\nthe big black bird in its upward<br />\nnearly one-third of the Hopkins lines each.<br />\nThe intermission was taken up<br />\nAmeriCan medical schools, and<br />\nThe average amount of space deflight and by the skillful use of with songs and yells and the anprofessors have earned a place for<br />\nvoted to a professor in the under- demanding much higher qualifica- Turnbull's toe held the Maryland<br />\nthemselves in that volume. There<br />\ntics of a. number of clowns from<br />\ngraduate school of this Univerity tions of entering students, a modare about one hundred professors,<br />\nof that year to the first tie of the the Maryland stands. The most<br />\nis about twenty-five lines. MOst el was established for most of the<br />\nassociates, and assistants teachoutstanding of these was a takeof the professors have written present high-grade American med- series.<br />\ning in the undergraduate schools;<br />\nTouchdown Recalled<br />\noff on the great \"Grange.\" A<br />\nseveral books or treatises of suffiical schools.<br />\nOf these, thirty, or slightly less<br />\nMany of the watchers later had chap in football togs crowned with<br />\ncient importance to be given space<br />\nthan one-third of the total, are in this brief resume of their lives. \"The latest sign of appreciation cause to lament that the J. H. U. a shock of red,hair, wearing the<br />\nlisted. Twenty-three full profes- The average professor also is a of Johns Hopkins as a pioneer- narrowly, missed. victory on this number \"77\"'and carrying a block<br />\nsors in the School of Arts and Sci- member of four or five<br />\nhonorary ing university is the proposal to Thanksgiving Day as well as on of ice, came out on the field and<br />\nences are mentioned. From this societies.<br />\nestablish here a School of Inter- two' former days by a break that put down his ice long enough to<br />\nOne may see that it is the younger<br />\nThe above includes only those national Relations in memory of<br />\nrun through an opposing team of<br />\nmembers of the faculty who are professors who have direct con- Walter Hines Page, one of the made what appeared to be a bona rather aesthetic clowns for a<br />\nnot included.<br />\ntact with students in the College most distinguished of our early fide touchdown count for nothing. touchdown. The usual Maryland<br />\nDr. Maurice Bloomfield, Pro- of Arts and Sciences, the Engi- Fellows,\" said Dr. Goodnow. It<br />\nJoy was rampant in the Black funeral ceremonies for J. H. U.<br />\nfessor of Sanskrit, has a greater neering School, the College of is hoped that work will begin in and Blue section when Mallonee were also held.<br />\namount of space devoted to his Teachers, and the School of Busi- this school in October, 1926.<br />\nThe funeral march between the<br />\nscooped up Thomas' fumble and<br />\nachievements than any other mem- ness Economics. It does not take \"The method of instruction in<br />\nhalves<br />\nwas sadly out of place as<br />\nran behind the Maryland goal. . A<br />\nber • of the faculty, for fifty-one<br />\ninto account the notable- of the the advanced fields may be liklater developments showed. The<br />\nlines, or about three-quarters of a graduate Schools of Medcine and ened to the setting out of an ex- minute later a dead calm prevailed<br />\n- first few minutes of the third guarin the Johns Hopkins stands when<br />\nPage, are devoted to him. Drs.<br />\nContinued on page 2, column 4<br />\nContinued on page. 3, column 1<br />\nContinued on page 4, column 3<br /><br />\nTHIRD OF HOPKINS'PROFESSORS<br />\nEARN PLACE IN WHO'S WHO<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, DECEMBER 1, 1925.<br /><br />\nYES and NO<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all articles and other communications should be<br />\nsent to the MANAGING EDITOR.<br />\nTelephone.<br /><br />\nHomewood 0100<br /><br />\nEditor-in-Chief<br />\nHENRY R. TURNBULL, '26<br />\nManaging Editor<br />\nJ. HENRY JARRETT, '27<br />\nAssistant Managing Editor<br />\n• CHARLES F. REESE, '27<br /><br />\nBusiness Manager<br />\nOTII0 J. KELLER III, '26<br />\nAdvertising Manager<br />\nJ. JACKSON KIDD, '26<br />\nCirculation Manager<br /><br />\nColumwist<br />\nHAROLD S. GOODWIN, '26<br /><br />\nROBERT T. SAUERWEIN, '26<br /><br />\nAssociate Editors<br />\nA. It's= ENSOR, '26<br /><br />\nAssistant Business Managers<br /><br />\nJunior Editors<br />\nW. BARNES HALL,.'26<br />\nRALPH KIRKLEY, '28<br />\nNORMAN B. GARDINER, JR., '28<br />\nMORTON HAMBURGER, JR., '28<br />\nBRINTON STONE,'27<br />\nDONALD NILES, '28<br />\nLAWRENCE KATZENSTEIN, '28<br />\nRICHARD R. GRIFFITH, '28<br /><br />\nHEYWARD E. BOYCE, JR., '27<br />\nARTHUR SWANSON,'27<br />\nLAWRENCE 0. MCCORMICK, '28<br />\nEUGENE O'DUNNE, '27<br />\nWILLIAM BORTNER, '27<br />\nIRVING HorrmAN, '28<br />\nTHOMAS F. MCNEAL, '27<br />\nR. CLYDE SMITH, '26.<br />\nDONALD C. WEILLER, '28.<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by King Bros., Inc., 208 N. Calvert St., Baltimore, Aid.<br />\n•<br /><br />\nHOMEWOOD,BALTIMORE, MD., DECEMBER 1, 1925.<br /><br />\nHOPKINS FOOTBALL<br />\nWell, the team did the trick. Facing tremendous odds.<br />\nwith the betting five to one against them, they went in and<br />\noutplayed, outgamed, and outfought, etc., etc., etc., ( there are<br />\nmany more phrases easily swiped from the rosy-hued columns<br />\nof the city's dailies, but we refrain,)---they outfought old Maryland, and came out with another moral victory (obnoxious<br />\nphrase). There was much surprise at the result of the game.<br />\nbut much more surprise at the smallness of the crowd.<br />\nStarr Mathews, writing in the A i»crican. attributes the size<br />\nof the crowd to the Hopkins' schedule. He says that our habil<br />\nof playing nonentities from other States leads the Baltimore<br />\npublic to ignore our team. He suggests a schedule comprised<br />\nof State teams only, and predicts a large attendance at the<br />\ngames with these institutions. A sort of Maryland Conference, is the gist of his article.<br />\n.<br />\nThe NEWS-LETTER shakes in its shoes when it ventures to<br />\ncontradict Mr. W. R. Hearst's highly paid sporting expert. He<br />\nshould, and probably does, \"know his oats\" when sports are in<br />\nquesiton. Nevertheless, we disagree.<br />\nIt is true that a little more interest might be aroused by<br />\ngames with Western Maryland, Mt. St. Mary's, Washington,<br />\nand perhaps Loyola. It is admitted, however, that the athletic<br />\n•code of some of these institutions is rather lax, and this is the<br />\nfirst objection to such contests. And in the second place, we<br />\ndo not believe that the Baltimore public will patronize Hopkins games, or, for that matter, the games of any other State<br />\ncollege, with any degree of interest, no matter who is the opponent. Baltimoreans are not interested in their own institutions; half of the population think that the Hopkins' teams<br />\nare composed of doctors and medical students; they are ignorant of the existence of any other department of the University.<br />\n,This apathy to home institutions will always keep the crowds<br />\ndown to a small size.<br />\nFor the same reason that Baltimore could not support big<br />\nleague baseball, for the same reaison that_it_does not _support<br />\nany first-class teams in any sport,—for that reason, whatever<br />\nit is, it will not flock to Hopkins' football games, no matter<br />\nhow high a brand of sport is presented.<br />\nThis, in short, is why we differ with the learned Mr.<br />\nMathews. And we believe that it is better to play gentlemen<br />\nfrom out-State colleges than gentlemen from in-State schools<br />\nwith no reputation.<br />\nHowever, to be constructively critical, we would suggest<br />\ngames with teams of the class of Virginia, Washington and<br />\nLee, Swarthmore, and North Carolina. Better to lose to men,<br />\nthan to win from babies and sucklings.<br /><br />\nWE POINT WITH PRIDE<br />\nThis week we point with pride to the achievement of the<br />\nBlack and Blue Jay Staff, who put out the November number<br />\nof their publication on the twenty-sixth day of the month.<br />\n—AND-We view with alarm the imranding informals.<br /><br />\nINTERCOLLEGIATE<br /><br />\nNEWS<br /><br />\nLITERATURE COMPOSED WHILE YOU WAIT<br />\nThe editor wants us to be more literary. More literary<br />\nand less controversial regarding campus affairs.<br />\nThe master has spoken; besides, we believe that he is about<br />\nright. Truly, this column is not suffering from too much literary flavor.<br />\n•<br />\nUnfortunately, however, we don't know just what the<br />\neditor is talking about. There seems to be literature and literature.<br />\nIt is quite likely that thiscolumn is neither one nor the<br />\nother. We, too, have a feeling that Yes and No is not always<br />\ngarbed in immortal phraseology.<br />\nNevertheless, to be literary, one must be literary about<br />\nsomething. And we have rather enjoyed being \"literary\" about<br />\n,collegiate affairs.<br />\nPerhaps the fact that they are easy to write about has led<br />\nus to give too much space to them. There is so much disagreement about the conditions at Hopkins that Yes and No is sure<br />\nto agree perfectly with the feelings and thoughts of someone, and so be literature for that person.<br />\nOf course, there remain other things to be eloquent about.<br />\nIt may be that the editor wants us to be literary about literature.<br />\nThat is not so difficult as it sounds. Granted that we<br />\nmay not know literature when we see it, such is also the case<br />\nwith many of our readers.<br />\nA large part of the art of being considered literary consists in the mere act of writing about writing. The only discretion required is in the choosing of books which the readers<br />\ncannot b'e certain are not \"literature.\"<br />\nAn even more impressive gesture is to print in the column<br />\na few bizarre, insane or empty poems, and to accompany them<br />\nwith serious remarks. In order that we may carry out this<br />\nprogram, Yes and No is hereby thrown open to short contributions of literary pretensions.<br />\nOur preliminary remarks have been over long, we fear.<br />\nWe really must get down to being literary.<br />\nIn the absence of contributions, we are forced to be serious<br />\nabout one of our own poems. It should certainly live up to<br />\nthe above-mentioned specifications: we wrote it in our Freshman year.<br />\nMoreover, we wrote it at a so-called white heat. We had<br />\njust finished reading some poems; we felt immeasurably stirred;<br />\nand we wrote!<br />\nIt is easy to be serious about this immortal verse. Indeed,<br />\nit is little less than sad to ponder over the depths achieved by<br />\nthe Soul of a Freshman when throbbing with the Divine Afflatus. '<br />\nESCAPE<br />\nRushing madly, wildly onward,<br />\nNever pausing to consider,<br />\n• Never stopping to look backward,<br />\nFearing that the slightest falt'ring<br />\nWould cause all my hopes to vanish,<br />\nTo outdistance my ambitions;<br />\nKnowing only that my pleasure,<br />\nAll my joy of living, loving,<br />\nLie in trampling down my doubtings,<br />\nOverwhelming protestations,<br />\nIn confounding all conventions.<br /><br />\nHALF<br /><br />\nCENTURY<br /><br />\nBOOKLET<br /><br />\nContinued from page 4, column 1<br /><br />\nMedical Education at Johns Hopkins, is especially interesting. The<br />\nplans for changing the curriculum<br />\nare discussed. The many fields,<br />\nas yet unexplored,--are entrmerated:<br />\nThe diseases that are still incurable and the questions and facts<br />\nconcerning them are brought up.<br />\nThe need for new equipment, and<br />\nbuildings is argued. In fact the<br />\nwhole program which the Medical<br />\nSchool and Hospital intend to<br />\nfinance within ten years is given.<br />\nThere is an addendum showing<br />\nthe demand elsewhere for Johns<br />\nHopkins teachers. It is a list of<br />\nfull professors in other medical<br />\nschools that are alumni and former students of the Johns Hopkins Medical School and men who<br />\ndeveloped teaching and research<br />\nability as members of its staff and<br />\nthat of the Johns Hopkins Hospital.<br /><br />\nThroughout 'the colleges and<br />\nuniversities of the country student polls are being held in an<br />\neffort to determine the student<br />\nopinion on the World Court question. This question will occupy<br />\nan important part of the program<br />\nof the United States Senate when<br />\nit next convenes, and for this reason, there has been much interest evinced in it. The poll, which<br />\nwas organized by the New Student, is now on in six hundred..<br />\nand fifty colleges and universities. Its object is to band too-ether the students in American<br />\ncolleges in an endeavor to use the<br />\nstrength of the opinions expressed<br />\nto bring about the entry of the<br />\nUnited States into the World<br />\nCourt.<br />\n*<br /><br />\n*<br /><br />\nThe Haverford News recently<br />\nexpressed the indignation of the<br />\nstudent body against \"rank commercialism\" in football. So many<br />\nHaverford men have suffered injuries at the hands of teams employing paid athletes that they<br />\nalmost fail to recognize football<br /><br />\n•<br /><br />\nas a \"game\" any longer. Faculty<br />\nresolutions claim that the college<br />\n\"does not pay athletes to attend<br />\nHaverford. However, they do that<br />\nwhich is probably worse in throwing a light team against the crushing physical power of great universities in order to cash in on a<br />\nfew gate receipts.\" The athletic<br />\nauthorities are now facing the possibilities of either buying husky<br />\nathletes to play on Haverford<br />\nteams, or stop stacking her teams<br />\nagainst odds.<br />\n*<br />\n*<br />\nA movement is being made at<br />\nRutgers University to create a<br />\nmemorial to Dr. William V. Leggett. Dr. Leggett was captain of<br />\nRutgers' first team in their first<br />\ngame in 1869 with Princeton.<br />\nThis was the first game ever<br />\nplayed between two colleges.<br /><br />\n*<br />\n*<br />\n*<br />\n*<br />\n*<br />\nComment by the student body of<br />\nRutgers after the abolition of the<br />\nhonor system three weeks ago by<br />\nalmost unanimous<br />\nDR.GOODNOW BROADCASTS the students is<br />\nthat<br />\nthe system is<br />\nbelief<br />\nin the<br />\nContinued from page 1, column 3<br />\nRutgers, but<br />\nat<br />\nimpossible<br />\nploring expedition for some un- not<br />\nunbe<br />\npracticable<br />\nknown region such as the heart of that it will not<br />\nprepared<br />\na distant continent,\" stated Dr. til the student body is<br />\nGoodnow. Reducing to concrete- for the obligations it imposes.<br />\nness this last statement, Dr. Careful handling of the question<br />\nGoodnow gave as an example the with iest)ect to incoming- fresh=<br />\nvaluable research work of Dr. Ira men is stressed in opinions offered<br />\nRemsen, the first professor of by various members of the facchemistry at Johns Hopkins, and ulty and undergraduate leaders.<br />\ntold how the men who worked<br />\nIn an interview with one of the<br />\nwith him now teach in scores of professors, he stated that \"some<br />\neducational institutions, and of light may be thrown on the quesothers who hold responsible posi- tion by a recognition of the causes<br />\ntions such as chemical director of of failure of the old system. There<br />\nthe Du Pont Works.<br />\nwas at no time satisfactory ma\"So, when you think of Johns chinery to carry on the workings<br />\nHopkins,\" concluded Dr.. Good- of the system. Another cause for<br />\nnow,\"remember that it is a factor failure was the repeated neglect<br />\nin making Baltimore a port of op- to introduce the incoming freshportunity, that in its laboratories men either to the system or the<br />\nand classrooms there is today the spirit back of it. This neglect was<br />\nsame spirit which in the past sent needless and a prime cause for<br />\nthe caravels of the explorers and failure of the plan.\"<br />\nIt was mentioned that the large<br />\nthe covered wagons of the piocommuting<br />\nelement in the student<br />\nneers in search of new realms for<br />\nbody presented a handicap.<br />\nthe benefit of mankind.\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 1, 1925.<br />\nSOPHOMORES MEET FROSH GLASGOW BOTANIST WILL<br />\nDECEMBER 5<br />\nLECTURE TODAY<br />\nBoth Teams Preparing For Tilt As Dr. Frederick 0. Bower To Deliver<br />\n-Sophomores Get Equipment<br />\nTalks Today And . Thursday<br /><br />\nAll signs and omens point toDr. Frederick Orpen Bower, of<br />\n:ward the playing off of the Fresh- the University of Glasgow, will<br />\nman-Sophomore football stilt on lecture at the Civil Engineering<br />\nSaturday, December 5. The soph- Hall today and on Thursday. In<br />\nomores, in view of the fact that his first lecture, Dr. Bower will<br />\nequipment is to be given out, de- discuss \"Engineering Problems in<br />\ntermined at a class meeting on Plants,\" and Thursday his subNovember 24 to carry on football ject will be \"Acquired Characterpractice to the best of their abil- istics in the Evolution of Plants.\"<br />\nity.<br />\nSince 1885, Dr. Bower has been<br />\nPractice is to be held today, Regius Professor of Botany at<br />\ntomorrow and Friday, in prepa- the University. of Glasgow. He<br />\nration for the game, with George was born at Ripon, Yorkshire, and<br />\nParley- probably coaching the after attending the schools of his<br />\nteam. Equipment recently used native town. he studied at Trinby the varsity scrubs will also be ity College and at Cambridge Unidistributed this. afternoon.<br />\nversity. Later, he was lecturer<br />\nThe freshman eleven is priming in botany at the Imperial College<br />\nfor the contest with. games with<br />\nof Science and President of the<br />\nthe Mechanical and Electrical En- Royal<br />\nSociety of Edinburgh.<br />\ngineer teams today and on WedDr. Bower has written a numnesday. The squad is indeed ju- ber of<br />\nbotanical works which<br />\nbilant over the proSpect of play- have gained for him a world-wide<br />\ning the sophmores, especially at<br />\nreputation. Some of his most<br />\nsuch an early date, as it was runoted works are: \"A Course of<br />\nmored that the game might be Practical Instruction in Botany,\"<br />\nput off.<br />\n—Plant Life on Land,\" and -\"The<br />\nBotany of the Living Plant.\"<br />\nDr. Bower is at present a resiHOPKINS AND WHO'S WHO<br />\ndent<br />\nof Glasgow.<br />\nContinued from page 1, column 2<br />\nHygiene. It is interesting to<br />\nnote that more than one-fifth of<br />\nall the professors, associates, and<br />\ninstructors in all the schools of<br />\nthe University are included in<br />\nthe current issue of Who's Who.<br />\nSlightly less than one-third of<br />\nthe Baltimoreans listed in Who's<br />\nWho are Hopkins professors. If<br />\na list of the men -Who are con-<br /><br />\nnected with Hopkins as alumni,<br />\ntrustees, or in less direct ways<br />\nwere made, the proportion would<br />\nbe considerably higher.<br />\nThis might be taken as an estimate of how much this University<br />\nmeans to the City of Baltimore<br />\nand the State of Maryland.<br /><br />\nSHIRT DISPUTES<br />\nOF BAND SETTLED<br />\nAt a previous meeting of<br />\nthe student'activ,ities council,<br />\nleader Gorsuch, of the band,<br />\ncomplained of a sale of jerseys to the band by the A.<br />\nA. Board. Gorsuch contended the jerseys were too expensive and were of poor material, which soon began to<br />\ntear.<br />\nThe council investigated<br />\nthe complaint and found the<br />\nsale to have been satisfactory<br />\nand the jerseys in good condition when delivered.<br />\nThe Omicron Delta Kappa<br />\nsociety also investigated, and<br />\nreported the sale to have been<br />\nsatisfactory.<br /><br />\nBeatty, of Maryland, kicked off to<br />\nPindell, who ran the ball back 20 yards,<br />\nbut fumbled when tackled, Zulick, cf<br />\nMaryland, recovering on Hopkins' 45yard line. Besley made 4 yards at right<br />\ntackle, but failed at center. Linkous<br />\nmade 1 and Tenney punted out on Hopkins' 21-yard line. Taylor kicked back<br />\nto Tenney on his own 40-yard line.<br />\nLinkous made 4 yards at right tackle,<br />\nand Thomas 4 at left tackle. Linkous<br />\nmade it first down, then gained 1 yard<br />\nat center and 5 at right tackle. Thomas<br />\nhit center for 1 and Besley punted to<br />\nTaylor, who ran back eight yards .to his<br />\n33-yard line. Taylor made 1 at right<br />\nguard, then 2 off left tackle before he<br />\npunted to Tenney on his 35-yard line.<br />\nCarey stopped Besley and Linkous made<br />\n1 at center. Besley kicked to Taylor,<br />\nwho ran the ball back 8 yards to his<br />\n45-yard line. Pindell hit right guard<br />\nfor 1 yard. Taylor skirted right end<br />\nfor 7 yards and Pindell made it first<br />\ndown on Maryland's 45-yard line. Clayton smashed center for 4 yards. Left<br />\ntackle yielded 2 to Taylor.<br />\nA pass<br />\ngrounded and Taylor punted over Maryland's goal line. With the ball on the<br />\n20-yard line. Besley made 1 at riglit<br />\ntackle.- Thodias was tackled behind the<br />\nline and fumbled, Mallonee scooping up<br />\nthe ball and running over the goal line,<br />\nbut Referee Hoban ruled he had blown<br />\nhis whistle before the fumble and that<br />\nthe ball was dead. The ball was brought<br />\nback and Maryland took time out. Besley punted to Taylor, who rin out of<br />\nbounds on Maryland's 40-yard line.<br />\nTaylor made 5 off right tackle. Lawrence broke through the righ\" side of<br />\nthe line for 12 yards and first down.<br />\nPindell pushed through center for 5<br />\nYards to Maryland's 20-yard line as thP<br />\nquarter ended.<br />\nScore: Hopkins, 0;<br />\nMaryland, O.<br /><br />\nSecond Quarter<br />\nTaylor made 1 around right end, then<br />\nfirst down at left guard.<br />\nLawrence<br />\nMade 2 at center and Taylor 1. Leibensperger's try for placement from the<br />\n20-yard line was low and wide, Maryland getting the ball on the 20-yard<br />\nline. Linkous lost 2 yards, but Besley<br />\nhit center for 8. Besley got off a good<br />\nMint to Hopkins' 38-yard line. Pindell lost a yard, but made 5 on a fake<br />\nkick. Taylor punted to Maryland's 39Yard line. Linkous made 1 at right<br />\nguard. Besley made 2 at right tackle.<br />\nBesley crashed the same spot for 4,<br /><br />\n•<br /><br />\nthen punted to Taylor, who ran back 4<br />\nto Hopkins' 26-yard line. Taylor failed<br />\nat left tackle, then punted to MaryBesley made a<br />\nland's 45-yard line.<br />\nyard at center. Linkous hit left tackle<br />\nfor a yard. Tenney passed to Adams<br />\nfor a gain of 20 yards and first down.<br />\nBesley gained 3 at right end. Linkous<br />\ncrashed center for 1. On a double pass<br />\nBesley lost 2, then punted out on HopTaylor likewise<br />\nkins' 13-yard line.<br />\npunted, Tenney being downed on Hopkins' 40-yard chalk. On a triple pass<br />\nand forward, beautifully executed, Besley to Tenney to Supplee to Stevens, the<br />\nlatter ran 20 yards for a touchdown,<br />\nnad added the extra point by dropkick.<br />\nScore: Maryland, 7; Hopkins, 0.<br />\nBeatty kicked off over Hopkins' goal<br />\nline, the ball being put on play on the<br />\n20-yard line. Besley intercepted a pass<br />\nfrom Taylor and ran to the 20-yard line.<br />\nBesley made 1 at right tackle. A pass,<br />\nTenney to Stevens, made 8 yards. Linkout made it first down on Hopkins' 10yard line. Mallonee got Tenney for a<br />\n1-yard loss. Maryland fumbled, but recovered for a 1-yard gain. A lateral<br />\npass, Linkous to Stevens, gained 4<br />\naround left end as the half ended, the<br />\nball being on Hopkins' 5-yard line.<br />\nScore: Maryland, 7; Hopkins, 0.<br /><br />\nFORTY-SIX NATIONALITIES Y. M. C. A. Drive<br />\nREPRESENTED AT<br />\nClimbs Slowly<br />\n\"Y\" BANQUET<br />\nAccording to Y. M. C. A. DirectStudents Of All Maryland Colleges or E. A. Schaal, the campaign<br />\nEntertained At Turkey<br />\nfor the Hopkins Chest Fund has<br />\nDay Gathering<br /><br />\nlagged very perceptibly. Although<br />\nOne hundred and forty-eight three hundred of the six hundred<br />\nstudents of at least forty-six dif- dollars which the Y. M. C. A. has<br />\nferent nationalities were enter- set as its goal was pledged the<br />\ntained by the Intercollegiate De- first day of the drive, only one<br />\npartment of the Y. M. C. A. at a hundred dollars more had been<br />\nbanquet given on Wednesday eve- pledged at a late hour on Wedweek<br />\nning, November 25, at the Central nesday, November 25, a<br />\nlater.<br />\nY. M. C. A. Turkey headed the<br />\nIt is doubtful if the drive picked<br />\nmenu, but the country of that up during the Thanksgiving holimime was one of the few not rep- day. It is probable, according to<br />\nresented by the guests. China had Mr: Schaal, that the goal of six<br />\nthe greatest number of represent- hundred dollars, half of which is<br />\natives, her twenty-three being al- to go to the Student Friendship<br />\nCommission, will not be reached<br />\nmost double that of Russia's<br />\nunless the returns take a decided<br />\ntwelve. Porto Rico, with ten, and jump.<br />\nNEW LACROSSE SCHEDULE<br />\nGermany, Roumania, and Siam,<br />\nContinued from page 1, column 1<br />\neach<br />\nwith six, were next in order<br />\nHopkins list, together with the<br />\nDON'T FORGET!<br />\nMt. Washington Club. Mt. Wash- of number.<br />\n—clothes that are tailored to<br />\nThese students, gathered from<br />\nington is usually listed for June<br />\nyour measure fit you best.<br />\nWeek, but this year there is not the Peabody Institute, Goucher<br />\n—they have the right cut..<br />\n—they make you feel welllikely to be a game during the College, University of Maryland,<br />\ndressed.<br />\nweek of festivity. However, the<br />\nand other nearby institutions, in<br />\nAthletic Office will co-operate with<br />\nthe June Week Committee in put- addition to those from all departting on a contest with Toronto if ments of Johns Hopkins Univerthe committee gains -the. agree- sity and Hospital, sat down to<br />\nment of the home team and cares tables plentifully provided with<br />\ng<br />\nB<br />\nto negotiate for the game.<br />\nt4*<br />\nthe • usual Thanksgiving delights,<br />\n•<br />\nL._<br />\ns<br />\n14fluisinamm5—<br />\n• Lacrosse Schedule<br />\nfrom browned sweet potatoes to<br />\nrrAik.17_,COTL.$<br />\nThe 1926 schedule as follows:<br />\ncranberry sauce.<br />\ncf,ifilvt.ore<br />\nApril 3—St. John's (pending).<br />\nE. A. Schaal was the toastmasApril 10—Oxford-Cambridge.<br />\nSee \"GARB\" MALLONEE &amp; FRAMK MEREDITH at the Barn<br />\nter, and introduced Carlton HarApril 17—Virginia.<br />\nDowntown at 407 N. GAY St.<br />\nApril 24—United States Military rison, who extended to the guests<br />\nAcademy.<br />\nthe greetings of the Y. M. C. A.<br />\nENGLISH OVERCOATS<br />\nMay 1—Swarthmore (away).<br />\nThis was followed by a response<br />\n$30.00 to $75.00<br />\nMay 8—Onandaga Indians.<br />\nfrom G. A. Pacheco, president of<br />\nMay 15—Pennsylvania (away).<br />\nCosmopolitan Club. After<br />\nMay 22—University of Maryland. the<br />\nMc PHERSON'S<br />\nfurther greetings, Lewis C. Moon<br />\n1 1 E. BALTIMORE ST.<br />\ndelivered a message from the<br />\nchurches. Following a piano solo,<br /><br />\nPlay By Play of Hopkins-Maryland Game<br />\n--_ First Quarter<br /><br />\n3<br /><br />\nVernon 2355<br /><br />\nTaylor's pass to Lawrence. Besley cut<br />\nright tackle for 12 and first down. Besley lost 5.<br /><br />\nmessages, brought by eleven guests<br />\nTHE FLAG, BANNER AND PENNANT SHOP<br />\nSUCCESSORS TO SISCO BROS.<br />\nfrom their respective nations,<br />\nFlags Banners, Pennants, Arm Bands,<br />\nwere heard by those present.<br />\nNovelties. Silk Banners for Schools,<br />\nSocieties and Fraternities.<br /><br />\nR. H. TAYLOR<br /><br />\nOn a double pass Stevens<br /><br />\ngained 1.<br /><br />\n302 PARK AVENUE, BALTIMORE.<br /><br />\nMaryland was penalized 15<br /><br />\nyards. Besley punted to Taylor, -who<br />\nran back 15 yards to Hopkins' 35-yard<br />\nline. Taylor made 4. A double pass<br />\nfailed to gain. Lawrence took Taylor's<br />\n20-yard pass and ran 20 yards more to<br />\nMaryland's 25-yard line.<br /><br />\nTaylor failed<br /><br />\nat the line, but passed to Lawrence for<br />\nTaylor found a hole at<br /><br />\na 5 yard gain.<br /><br />\nleft tackle and ran eleven yards to a<br />\nfirst down on Maryland's 10-yard line.<br />\nTaylor made 5 at center. Lawrence \\NW<br />\nstopped by Bafford at center, as the<br />\nScore: Maryland, 7;<br />\nquarter ended.<br />\nHopkins, 0.<br /><br />\nFourth Quarter<br />\nStevens intercepted a pass from Tayfor on Maryland's goal line and ran to<br />\n5-yard line.<br /><br />\nLinkous made 1, then 4<br /><br />\nat the line. Besley punted to Taylor on<br />\nA forward<br />\nMaryland's 45-yard line.<br />\npass grounded, another was intercepted<br />\nbut Maryland had been offside.<br /><br />\nTenney<br /><br />\nThird Quarter<br /><br />\nintercepted a long forward to Mallonee<br /><br />\nLeibensperger kicked off to Beatty on<br />\nMaryland's 40-yard line. Stevens made<br />\n3 at left tackle, then 2 at right tackle.'<br />\nHe then made 9 and first down around<br />\nBesley made 6 at right<br />\nright end.<br />\ntackle. On a triple pass Stevens was<br />\nsmothered. On another triple pass SupMaryland<br />\nplee's forward grounded.<br />\npunted, but was penalized and had to<br />\npunt over again after having been set<br />\nback 15 yards. Taylor ran back 10 to<br />\nhis 30-yard line. Pindell crashed center for 2 and left tackle for 5. Taylor<br />\npunted to Maryland's 28-yard line. Carey nailed Linkous for a loss. Linkous<br />\nmade 1 at center Leibensperger blocked<br />\nBesley's punt and Mallonee recovered<br />\nfor Hopkins on Maryland's 12-yard line.<br />\nTaylor hit right tackle for a yard and<br />\nthen passed to Lawrence for 5 more.<br />\nPindell made 1, but Lawrence failed to<br />\nmake first down, and Maryland took<br />\nthe ball on her 3 yard line. Linkous<br />\ngained two yards at center on two<br />\nplunges, and Besley punted to Taylor,<br />\nwho ran back 15 to Maryland's 45-yard<br />\nline. Taylor passed to Lawrence for 7<br />\nyards. Hopkins was penalized 5 yards<br />\nfor being offside. Linkous intercepted<br /><br />\nand was downed on his 30-yard line. On<br />\na fake pass Stevens gained 15 yards<br />\nand first down through left tackle. Stevens gained another yard, as did Linkout, on line plays.<br /><br />\nBesley punted to<br /><br />\nTaylor on his 43-yard line.<br /><br />\nHopkins Starts Drive<br />\nLawrence made 2 at center. A. pass,<br />\nTaylor to Mallonee, made 12 and first<br />\ndown. Two more forwards grounded,<br />\nbut another, Taylor to Clayton, made<br />\nTaylor smashed<br />\nanother first down.<br />\nright guard for 2. A pass, Taylor to<br />\nMallonee, made another first down on<br />\nMaryland's 20-yard line. Taylor made<br />\n3 at right guard, but a recovered fumble<br />\nlost 4. A forward, Taylor to Mallonee,<br />\nmade another first down on Maryland's<br />\n10-yard line. Taylor made 4 off left<br />\ntackle, then 2 at right tackle. Lawrence crashed center for 3 yards to<br />\nMaryland's 1-yard line.<br />\nOn a fake<br />\nplunge by Pindell, Taylor crash center<br />\nto a touchdown. Clayton changed his<br />\nmud cleats to a kicking shoe and place<br />\nkicked the extra point. Score: Hopkins, 7; Maryland, 7.<br /><br />\nPhone: Homewood 9621<br /><br />\nBOULEVARD RESTAURANT J. H. FURST CO.<br />\nFANCY DELICATESSEN<br />\nPrinters of<br /><br />\n2022 N. Charles St., Balto., Md. PHILOLOGICAL &amp; SCIENTIFIC<br /><br />\nSPECIAL RATES FOR HOPKINS STUDENTS<br /><br />\nKodaks<br />\nCameras<br />\nSupplies<br /><br />\nDeveloping<br />\nPrinting<br />\nEnlarging<br /><br />\nZepp Photo Supply Co.<br /><br />\nPUBLICATIONS<br />\n23 S. Hanover St., Baltimore.<br />\nPhone: Calvert 4835<br /><br />\nCARL J. DOEDERLEIN<br />\nWATCHES,<br />\nDIAMONDS, JEWELRY<br /><br />\n3044 Greenmount Ave.<br /><br />\nFINE WATCH, CLOCK &amp; JEWELRY<br />\nREPAIRING A SPECIALTY<br />\nMFRS. OF FRATERNITY GOODS OF<br />\nALL KINDS<br /><br />\nLet Us Develop Your Films.<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br /><br />\n504 PARK BANK BUILDING<br />\nLexington at Liberty Sts.<br /><br />\nBaltimore's Best Store<br /><br />\nHOCHSCHILD,KOHN 8,c,Co.<br />\nHoward and Lexington<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nN. W. COR. EUTAW &amp; FAYETTE STS.<br />\nWHILE IN COLLEGE HAVE A SAVINGS ACCOUNT.<br />\nWHEN YOU FINISH SCHOOL, GET IN TOUCH WITH A<br />\nGOOD NATIONAL BANK FOR HELP AND ADVICE.<br />\nOUR OFFICERS WILL BE GLAD TO TALK WITH YOU.<br />\nHEYWARD E. BOYCE, President<br /><br />\n4<br />\nHALF CENTURY COMMITTEE<br />\nISSUES BOOKLET ON<br />\nMEDICAL WORK<br /><br />\nTHE JOHNS HOPKINS NEWSLETTER, DECEMBER 1, 1925.<br />\nJAYS AND RAVENS BATTLE<br />\nNoted Pianist<br />\nTO THIRD TIE IN<br />\nat Dorms Tonight<br />\nANNUAL GAME<br />\nFrederick Dixon, noted pianist,<br /><br />\nBooklet Is Divided Into Four Parts; will give a concert at 8:15 .to- On Third Attempt Hopkins Puts Over<br />\nTouchdown<br />\nInteresting History Of -Medical<br />\nnight in the Commons Room of<br />\nEducation Given<br />\nContinued from page 1, column 5<br /><br />\nthe -Memorial Dormitory. The<br />\nThe<br />\nof Inquiry in liedi- concert is under the auspices of<br />\ncal Education is a booklet,, pub- the Musical Club through the<br />\nlished by the Johns Hopkins Half- courtesy of the Mason and HamCentenary Committee, that should lin Studios.<br />\nMr. Dixon, a protege of the<br />\nhe of great interest to every Hopgreat Joseffy, has risen to an emikins student, particularly medical<br />\nnence recently. He will be asand premedical students.<br />\nsisted by Arthur W. Morgan, Jr.,<br />\nThe booklet is divided into ,four violinist, and Irma Schiaffino, sodistinct Parts: first, Medical Ed- prano. There will be no admisucation in America; second, Medi- sion.<br />\ncal Education at Johns Hopkins,<br />\na Description; third, Medical Education at Johns Hopkins,an Evaluation fourth, Future Medical<br />\nEducation at Johns Hopkins. The<br />\nfirst part discusses and attacks<br />\nmedical schools as a whole. Of<br />\nthe seventy class A medical schools<br />\nin this country only fifteen are<br /><br />\nSigma Tau Delta<br />\nAwarded Cup<br />\nThe Sigma Tau' Delta fraternity has the highest average made<br />\nfor the scholarship cup awarded<br />\nby the interfraternity board. The<br />\nCup is awarded each term to the<br />\nfraternity having the highest<br />\nmarks.<br />\nFollowing are the competing<br />\nfraternities and standing:<br />\n78.25<br />\nSigma Tau Delta<br />\nDelta Gamma Theta. _76.63<br />\n.76.01<br />\nKappa Alpha<br />\nPhi.<br />\n..75.42<br />\nAlpha Delta<br />\n,<br />\n.75.36<br />\nKappa Sigma<br />\n75.18<br />\nPhi Kappa Psi<br />\n74.67<br />\nAlpha Tau Omega<br />\n73.06<br />\nDelta Phi<br />\n71.02<br />\nBeta Theta Pi<br />\n70.00<br />\nPhi Gamma Delta'<br />\n70.00<br />\nAlpha Kappa Phi<br />\nOmicron Kappa Omi70.00<br />\ncron<br /><br />\nter were mighty discomfiting to<br />\nJohns Hopkins, but shortly the<br />\nBlue team braced, and there it<br />\nstarted on its way to make the<br />\nlast half a Johns Hopkins affair.<br />\nThree times hi the last two<br />\nperiods, the University team<br />\nworked its way to a scoring position. Twice it failed.<br />\nThe initial chance of the second<br />\nhalf came when Leibensperger<br />\nblocked Besley's punt and Mallonee captured the ball on Maryland's eleven yard mark. Largely<br />\nthrough Taylor's efforts the pigskin was carried to the four-yard<br />\nline. Here the -Marylanders held<br />\nfor downs.<br /><br />\nFURNITURE OF QUALITY<br />\nDeal with a Firm equipped with 57 years' Experience.<br />\nOur Salesmen are Specialists, everyone carefully trained to handle<br />\nyour Problems efficiently.<br />\nYou should get the benefit of our Expert Knowledge and Ability.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDRAPERIES<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nSTEIN BROS. &amp; BOYCE<br />\nInvestment Bankers Since 1871<br /><br />\n6 S. Calvert Street<br />\nBALTIMORE, MARYLAND<br /><br />\nllie<br /><br />\nHub<br /><br />\nDown Charles, to Baltimore St.<br />\nThe clothing store<br />\nthat knows the difference<br />\nbetween real and imitation College style<br /><br />\nInterception Saves Havens<br />\nLater<br />\nin the third quarter'Maryfollowing the highest aims of modfound itself in a jam,<br />\nagain<br />\nland<br />\nern education in medicine. These<br />\nhaving been forced to the five-yard<br />\nfifteen schools are trying to make<br />\nchalk mark by an aerial attack<br />\nmedicine a biological science by<br />\nthat the . Blue Jays were employapplying the method of direct sciing for the first time during the<br />\nence to the study in life. The<br />\ngame. The passes, interspersed<br />\nwith running, had thus far raised<br />\nproper training of 'students and<br />\nhopes of the crowd, when Taythe<br />\nthe faculties that make it possible<br />\nlor launched a pass that .looked<br />\nare enumerated and explained.<br />\nlike it would be ,a touchdown, But<br />\nHistory of Medical Education<br />\nagain the dreams of the Blue Jays<br />\n115-117 E. Baltimore St., Corner Grant<br />\nA very interesting history of<br />\nwere shattered as a Maryland back<br />\nHart Schaffner &amp; Marx Clothes<br />\nintercepted the. toss.<br />\nmedical education at Hopkins is<br />\nBesley punted to stave off imgiven in the second part. When<br />\nmediate danger but the Jays were<br />\nJohns Hopkins made a bequest of<br />\nright back at the scoring zone.<br />\n$7,000,000 for a university and Newcomb Wins<br />\nPasses brought them to the tenRifle Match yard line and runs took them to HOPKINS PRESS PUBLISHES<br />\nhospital, he .directed that they be<br />\nTWO NEW BOOKS<br />\nunited to a medical. school. The<br />\nE. M. Newcomb, hitherto a dark within a foot 'of a score with the<br />\ngrowth of the medical school and horse in , the competition foi: a<br />\nfourth down coming. Here Tay- President Goodnow's Report Included<br />\n.<br />\n\"THE WONDER MOTOR FUEL:<br />\nits relation to the university and. place on the Johns Hopkins Rifle<br />\nIn Recent Releases<br />\nlor took the ball and crashed<br />\nthe hospital are clearly shown. Team, broke through in the third through for the final score of his<br />\nJust fill the car up with<br />\nTwo books and two periodicals<br />\nThe medical school gave birth to intra-mural match, held Nov. 20,<br />\nBETHOLINE and FEEL<br />\nlong football. career.<br />\nhave just been published by The<br />\nthe school of hygiene, in many to capture first place and secure<br />\nthe power at your cornPress. The books<br />\nHopkins<br />\nJohns<br />\nClaiton Ties Score<br />\nways the most important develop- the dazzling collegiate vest offered<br />\nman d.<br />\nare Numbers 35 and 36 in the Inment in medical education during to the winner by the Rifle Club. 'Apprehension and dread filled<br />\nstitute for Government Research<br />\nrecent years. Short biographies His score of 182 for the standing the stands. It seemed that they<br />\nSHERWOOD BROS., INC.<br />\nSeries; while one periodical is the<br />\nof the three successive heads of and kneeling positions topped were so near to defeat and still Annual Report of President Frank<br />\nthe hospital are given. The hospi- Garis's total by six points. Baird, ,S0 close to what some have called<br />\nS. Goodnow, and the other is Voltal, care of the sick, and the fac- Hall, and Muir took third, fourth', a moral triumph, .and at the same<br />\nume XIXII, Number four, of the<br />\nulty, students, alumni, curriculum and fifth places, respectively, with time were so far from the triumph 'American Journal of Mathematand plant of the Medical School scores of 179, 172, and 170. A sought after. The game was deics Series.<br />\nare described.<br />\ncigarette case, a tie, 100 rounds layed while the stands wondered<br />\nThe first of the books in the<br />\nThe third part is given over to a of ammunition, and 60 rounds of why. Clayton had asked for a Government Research Series, by<br />\nlist discussing the Doctors of the ammunition were the prizes won special kicking shoe and he was<br />\nGustavus A. Weber, is entitled<br />\nJohns Hopkins Hospital and Med- by Newcomb's rivals for honors. putting it on. Soon the teams had<br />\n-The Bureau of Standards,\" and<br />\nlined up. The ball was snapped<br />\nical School who have been, by their<br />\nis issued as a Service Monograph<br />\nback and Clayton booted the pig<br />\nwork, experiments and discoveries,<br />\nof the United States. It is opened<br />\nPublicity Board to<br />\nskin fair through the uprights.<br />\nof great service to society and sciHandle Bulletin The Maryland team .appeared to with a•foreword concerning the<br />\nence. Some of the names appearand plans of the monoThe Student Activities Council be'deadened by this turn of even-hs aims<br />\ning in the list are: Drs. Welch,<br />\nThen a complete history<br />\ngraphs.<br />\nprone%<br />\ns••,....<br />\nOsier, Halsted, Kelly, M all, has assigned the care of the bulle- for in the two and one-half min- of the bureau is given, followed<br />\nHowell and Thayer. The work tin boards in the Barn and the utes remaining, they did not reg- by its detailed activities in electhat has been accomplished and is Post Office to the Publicity Board. ister the 'slightest sign of a recoup. tricity, engineering, chemistry,<br />\nThe line-up:<br />\nbeing done by the hOspital and Previously the boards have been<br />\noptics, and anytime other branches<br />\nbe<br />\nwill<br />\nnotices<br />\nnow<br />\nneglected<br />\nbut<br />\nschool is related.<br />\nHopkins,7<br />\nMaryland, 7<br />\nof science. An interesting acThe fourth part, the Future of posted at the beginning of each Mallonee<br />\nL. E..(capt.) Supplee count of the organization and perweek.<br />\nLeibensperger L. T.<br />\nZulick<br />\nContinued on page 2. column 3<br />\nsonnel of the Bureau is then<br />\nWilgis<br />\nRothgeb<br />\n.L. G.<br />\nFinally, there is an appenC.<br />\nBafford given.<br />\nLevy.<br />\nlaws,<br />\nSADIE, GRAND OLD CAN OF COLLEGE<br />\nConant<br />\nR. G.<br />\nBromley dix with an account of<br />\nCary<br />\nR. T.<br />\nAdams finances, and other details of the<br />\nCABDOM, MEETS SUDDEN DEATH Berndt<br />\nR E.<br />\nBeatty Bureau of Standards.<br />\nTenney<br />\nSadie is dead! Hopkins' most straight for the M. E. Building. Taylor (capt.)....Q., B.<br />\n\"The Government Printing OfL. H.<br />\nThomas<br />\nLawrence<br />\nfamous collegiate cab expired at Now Frank did not want to hurt Pindell<br />\nby Lawrence F. SchmeckeR• II.<br />\nBesley fice,\"<br />\nD. dewas<br />\noff<br />\nkey<br />\nbuilding<br />\nbut<br />\nSadie<br />\nthe point of the acetylene torch the<br />\nClayton<br />\nF. B.<br />\nLinkous lier, who received his Ph.<br />\nUniHopkins<br />\nlast Wednesday before an enor- and her brakes refused to func- Score by periods:<br />\ngree at the Johns<br />\nin<br />\nbook<br />\nHopkins....<br />\n0<br />\n0<br />\n0<br />\nfollowing<br />\n7-7<br />\nmous crowd of mourners who tion. There was a great crash and<br />\nversity, is the<br />\nAND it's practical<br />\nMaryland<br />\n0<br />\n7<br />\n0<br />\n0-7<br />\nMonoService<br />\nstood silent with heads bowed and splintering of tin and when the<br />\nthe same series of<br />\nas well as keenSubstitutions: Maryland — Stevens<br />\nuncovered. The end came in this dust had cleared away it was seen<br />\ngraphs. It also starts with ,a forefor Thomas, Troxell for Linkous,<br />\nlooking; the blackthat Sadie had completed the last Whelchel for Tenney. Touchdowns— word on, the aim of the monomanner.<br />\ntipped lacquer-red<br />\nFrank Wolbert, the erstwhile of her 200,000 miles.<br />\nStevens, Taylor. Tries for point— graphs, and then briefly sketches<br />\nIn some ways the wreck was of Stevens (by dropkick), Clayton (by the history, activities, organizaowner, was steering peacefully<br />\nbarrel will be found<br />\ndown the road to the barn when great benefit to the college, for place kick, Taylor holding the ball). tion, and personnel of the printno<br />\nmatter where<br />\nsuddenly two co-eds of great beau- all the Ford owners who have been Referee—George, Hoban, Dartmouth. ing office. There is also an appenUmpire — Fisher, Columbia.<br />\nHead<br />\nyou Park 'er.<br />\nty caught his eye and held it. In driving cans around without linesman — Crowley, Bowdoin.• Field dix which gives all the figures confact they held it so long that when wheels, engines and so forth took judge—Heneage, Dartmouth. Time of cerning finances, laws, bibliography, and other details.<br />\nhe came to Sadie was headed them from what was left of Sadie. periods-L-15 minutes.<br /><br />\nHenry's<br /><br />\nBETHOLIN<br /><br />\nANFOIRD'S<br /><br />\nPASTE<br />\nSANFORD'S ca,,,ipt<br />\nIBRARY<br /><br />\nVAS.<br /><br />\nDries Quick<br />\nSticks Tisiht<br />\nNever Stains<br /><br />\nCarte<br />\ndu Jour<br /><br />"}], "field_media_file": [{"target_id": 37993, "display": null, "description": null, "target_type": "file", "target_uuid": "fe95e876-047b-4bc7-ae73-6799bb484948", "url": "http://digital.library.jhu.edu/system/files/2022-03/13186-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13186, "target_type": "node", "target_uuid": "7acd3731-dad7-484d-b856-c5b83b57d3d0", "url": "/node/13186"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "aa8154e4-0ed5-40d8-84b9-9909450e785b"}]}