{"mid": [{"value": 37905}], "uuid": [{"value": "ecd72161-4716-413b-85dd-2203d8215670"}], "vid": [{"value": 37905}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:42:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12473-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:42:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:42:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "1E<br />\nU<br />\n<br />\nINTERCOLLEGIATE<br />\nf4BETI<br />\n<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\ntons *op<br />\n<br />\nlit ell<br />\n<br />\nStudent's Career Through<br />\nCollege, Topic Of R.<br />\nN. Dempster<br />\n<br />\nSOPHS, FROSH<br />\nTO MEET,DISCUSS<br />\nBANQUET SEASON<br />\n<br />\nMr. Ryland N. Dempster, registrar of the Johns Hopkins University, and Dr. W. W. Cort, of the<br />\nsec<br />\nJohns Hopkins School of Hygiene,<br />\nins 1<br />\nFirst<br />\naddressed the members of the Pa- Lack Of Quorum Ends<br />\niddr<br />\nGain<br />\nTo<br />\nAttempt<br />\nrent-Teacher Association of the<br />\nOpinions<br />\nin j&ddress Plea To President Forest Park High School, Tuesday<br />\nof<br />\nAnd Board Of<br />\nevening in the school auditorium.<br />\nMr. Dempster discussed \"A Stu- CLASS OFFICIALS<br />\nTrustees<br />\ndent's<br />\nCareer Through College\", URGE COOPERATION<br />\nchel<br />\nwhile Dr. Cort continued with the<br />\nIAN RECEIVES<br />\nw<br />\nstudent's<br />\ncareer through \"Profes- Thursday Set As Next Date<br />\n; fr PAPER WEDNESDAY sional School.\"<br />\nFor Discussion Of Important Problems<br />\nlis d<br />\nThe student's high school career<br />\netitions Circulated By N.<br />\n,f t<br />\nwas also discussed by Mr. William<br />\nS. L. And Special<br />\nDue to failure of the majority of<br />\nA. Dehuff, principal of the PolytechCommittee<br />\nnic<br />\nInstitute, at the meeting, at the Sophomore and Freshmen class<br />\nkerties<br />\nwhich Mr. George Reindollar, pres- members to attend the meeting<br />\ny<br />\nPetitions requesting the Board of ident of the Parent-Teacher Assocalled by their class officers yesterne rustees to abolish both the Student ciation, presided.<br />\nday, another meeting is scheduled<br />\nties ctivities and the Athletic fees and<br />\nfor next Thursday, following the<br />\n!ratio .aring the signatures of 175 unassembly.<br />\nhe 'ergraduates were submitted to<br />\nMeade Johnson, president of the<br />\n!xpe' .•n E. W. Berry on Wednesday.<br />\nSophomore class, said, \"We, the<br />\nII<br />\nThe signatures were secured by<br />\nimtg t Corps of student members of the Says British Authors Lack class officers, have a number of<br />\nportant proposals which involve the<br />\nzist ' 'hunittee Against Compulsory<br />\nEnergy, Place O'Neill<br />\ninterest of the individual members<br />\nFirst<br />\nof t ees and of the National Student<br />\nof both classes.<br />\nds. eague who canvassed the campus<br />\nAsserting that American playmay be<br />\nmimeographe blanks during a wrights today are the best and most \"In order that the plans<br />\ntor ithd<br />\nto<br />\naccording<br />\nquickly<br />\nand<br />\nupon<br />\nvsit s.niod of ten days.<br />\nvigorous in the world, Dr. N. Bryl- acted<br />\nlion Fagin, professor of English the opinions and desires of the maTo Reinforce Athletic Agitation<br />\ne<br />\nLiterature, Monday night delivered jority, we solicit your cooperation<br />\nC, Coming at this time, the petitions<br />\na lecture on prominent contempo- in assisting us to carry out your<br />\noint ere intended to reinforce the agi- rary<br />\nAmerican dramatists before wishes.<br />\nFoil 'ti°ns among the student body in the Johns Hopkins Playshop. Dr.<br />\n\"It has always been our policy<br />\navor of more efficient management Fagin declared that modern British<br />\n'f athletic affairs as well as to in- drama does not reveal the energy never to act without the approval<br />\nortn the administration and the Stu- to be found in the work of present- of those whom we represent, but<br />\n'ent Activities Council of collegiate day American writers. Shaw has unless a necessary amount of class<br />\n•5<br />\nlost his sparkle, the speaker said, interest is shown, we shall be forced<br />\n'utiment on the subject of compuland the most powerful English to depend entirely on our own prin(n'Y fees. The Committee consid- dramatist<br />\nat the present time is the ciples.\"<br />\nred it desirable to do this before Irishman.<br />\nThe proposals that must be detiscussions of the subject took place<br />\nEugene O'Neill was held to be<br />\n't the assembly yesterday.<br />\nthe greatest of our dramatists, \"for, cided upon at the earliest opportuThe petition read as follows: despite the fact that he has written nity constitute a program which will<br />\nmany poor plays and despite the build up the class treasuries for the<br />\nWe, the undersigned, students of<br />\nfact that even parts of his best plays senior years by reinstating the old<br />\nhe Johns Hopkins University, re- are weak and<br />\nfaulty he is still su- plan of a combined dance of the<br />\nluest of the Board of Trustees that perior to all of his<br />\ncontemporaries.\"<br />\ntwo classes, which will merit the<br />\nhe ruling compelling every student<br />\nPraises Barry<br />\napproval of all members.<br />\n° Pay a Student Activity fee of<br />\nPhilip Barry was greatly praised<br />\nThe other proposal calls for one<br />\nen dollars and an athletic fee of by Dr. Fagin as outstanding in the<br />\naside for the demondollars be abrogated; first, be- comedy of manners. Hotel Uni- day to be set<br />\nBarry's ven- stration of school spirit in which<br />\n'use the ruling was passed at the verse was described as<br />\nture into \"highbrow drama\"—a ven- everyone will be able to participate.<br />\nequest of the students and student<br />\nture that resulted in a play as good<br />\nIn order to discover whether the<br />\n'entirnent at the present time de- as those of O'Neill.<br />\nclasses<br />\nare wholly in favor of the<br />\nands its rescinding; and, second,<br />\nAnother writer who ranks high<br />\n'eeatise in this time of depression in the field of American drama is above features of the coming banquet season, it is incumbent upon<br />\nanY students find it difficult to pay Sidney Howard. Mr. Howard, the<br />\nlecturer asserted, has displayed a the members themselves to express<br />\nhese unnecessary fees.\"<br />\ntheir views.<br />\n(Continued on Page 2, Col. 6)<br />\nPresentation Delayed<br />\n<br />\nFAGIN CALLS U. S.<br />\nDRAMATISTS BEST<br />\n<br />\nf According to the original plans<br />\nI the committee, the signatures<br />\niere to have been presented directt0 the President and the Board<br />\nTrustees at their scheduled<br />\neetiug on Monday, January 8. Dr.<br />\nAdolescent males on the West<br />\nillness, however, made this<br />\nwhere the price of a hair-cut<br />\nCoast,<br />\n'Possible, it was stated.<br />\nis 65 cents, may be expected to take<br />\non the appearance of a cross be.1, Results of the poll taken by tween the inmates of the House of<br />\nt• 4E NEWS-LETTER On the ques- David and an international conven1°11 of student activity fees are tion of concert pianists, but here at<br />\n4S fOilowS:<br />\nthe Hopkins, on the East Coast,<br />\nPor abolition of the fee<br />\n32 their heads are more likely to rePor modification of the fee 5 semble billiard balls.<br />\nPor retention of the fee<br />\n18<br />\nSuch appears to be the probable<br />\noutcome of the recent tonsorial<br />\ncraze that has struck many of the<br />\nHopkins students, like the great<br />\nhurricane of last August, and left<br />\nthem denuded of their cranial foliTobAy—Complete editorial staff age. It was probably as a result of<br />\nfleeting, NEWS-LETTER.<br />\nthis craze that the glistening dome<br />\nLiberal Club meeting, 1 p. m.,<br />\nof the barber pole in front of John<br />\nLevering.<br />\nshop in the basement of<br />\nLusco's<br />\nbasketball game with Loyola<br />\nat Evergreen tonight.<br />\nLevering Hall was decapitated and<br />\nGraduate Student - Faculty removed, perhaps to be used as a<br />\nbance, Levering, 9 p. m.<br />\nmodel for the \"bald eagle\" tonsure.<br />\nTh<br />\n°1vroRRow — Swimming meet,<br />\nCuba!! Cannon<br />\niliopkins vs. Manhattan ColFor the domes of the newly',_ege, K. of C. Pool.<br />\nsheared<br />\nstudents do glisten. The latWrestling meet, Hopkins vs.<br />\nest member to be admitted to the<br />\nGallaudet.<br />\nCotillion Dance, The Towns- exclusive club is Burt Cannon, the<br />\n'nen playing.<br />\nman whose name will probably go<br />\ndown in Hopkins history as \"Baldy<br />\n<br />\nBurt Cannon, Resembling<br />\nEx-Convict,Joins “Bald Eagle\"<br />\n<br />\nThe Week<br />\n<br />\nN rws.Erttrr I<br />\nANY<br />\n<br />\ni<br />\n<br />\nof Dome\". For, resembling an exconvict rather than an exclusive,<br />\nBurt provided such a sight last Saturday as to completely enthrall the<br />\nhundred-odd students in the dormitory and set them roaring with glee.<br />\nAnd that was only his first-night<br />\naudience.<br />\nAce Of Spades Bad Luck<br />\n<br />\nAs to how this business came<br />\nabout, the answer is that Burt Cannon lost his locks upon the turn of<br />\na card. It was a high-finance gamble, between Burt and John Canning, for the high card, with the<br />\nother man's hair as the prize. Cannon drew the Ace of Spades, and<br />\nrazors were brought into play on<br />\nCannon's head. A cup was placed<br />\non the top of his skull, and all the<br />\nsurrounding hair removed. Then<br />\nthis topknot was shaped to a triangle, and the picture was complete.<br />\nBut Burt disapproved of his resemblance to a Hottentot, and later<br />\nremoved the remaining tuft.<br />\nMany a person has lost his shirt<br />\non a gamble, but Burt Cannon has<br />\nthe distinguished honor of being<br />\nthe only one ever to lose his hair.<br />\n<br />\nGrad Student Frolic Tonight To Feature Routson's Orchestra<br />\n<br />\nGRADUATE STUDENTS<br />\nDANCE TONIGHT 1<br />\nAT LEVERING HALL<br />\n<br />\nPrice, 5 Cents<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, JANUARY 19, 1934<br />\n<br />\n11 01. XXXVIII—No. 25.<br />\n<br />\n15 UNDERGRAOS<br />\nPeSASK FOR TOTAL<br />\nEPEAL OF FEES<br />\n<br />\n4v<br />\n<br />\nDean Calls Activity<br />\nSituation \"Lousy Deal\"<br />\nFor Undergraduate Body<br />\n<br />\nThe second graduate students'<br />\ndance of the season will take place<br />\ntonight in Levering Hall. Walter<br />\nRoutson's orchestra will furnish the<br />\nmusic.<br />\nThe affair will be chaperoned by<br />\nStern Cites $600 Hullabaloo<br />\nDr. and Mrs. M. L. Huggins, Dr.<br />\nFunds Grafted Last<br />\nand Mrs. J. L. Mayer, Dr. and Mrs.<br />\nYear<br />\nJ. C. Hubbard, Dr. and Mrs. F. D.<br />\nMurnaghan,Dr. and Mrs J E.kAhl\"RAKE-OFFS\" ARE<br />\nberg, and Mr. and Mrs. R. N. Expressing dissatisfaction with REVEALED BY PROBE<br />\nDempster. Dean Berry is expected the students' usage of the reserve<br />\nto be present also.<br />\ndesk, Miss Alice Lanier asked for<br />\nArrangements were completed student cooperation. In line with Iddins Quotes Budget Figures In Reply To<br />\nby the committee, which consisted of this request, a set of rules have been<br />\nHeaney's Criticism<br />\nCharles Berry, chairman; Bob composed by Dr. John C. French,<br />\nBarnett, Miss Mary Phillips, Miss librarian, governing the use of reOpenly admitting that the stuWinifred Norem, Wallace Parks, served books.<br />\ndents have been given what he charand Archie Mahon.<br />\nRules Given<br />\nacterized as a \"lousy deal\" on their<br />\nDancing will be from nine till one.<br />\nThe rules are as follows:<br />\nThe admission is one dollar per. I. All books are to be signed for activities cards, and offering in excouple.<br />\nwhenever taken from the reserve. planation the defense that this was,<br />\n2. A book charged for use in the however, the only course open to the<br />\nreading room may be used in that University administration, Dean E.<br />\nroom for two hours, unless in great W. Berry yesterday appeared bedemand. In that case the time-limit fore the weekly assembly to answer<br />\nquestions concerning recently alwill be one hour.<br />\n3. Books may be borrowed for leged misadministration of activities<br />\nWillen, Brecher Go South; home use in accordance with the funds.<br />\nYoung And Bang On<br />\nIn an effort to reply to the numerwishes of the instructor. OrdinarNorthern Trip<br />\nily a book may be taken at 4 p. m. ous criticisms which have been diif not in use at that hour and re- rected by THE NEWS-LETTER, 0.<br />\nAnnouncing the complete debat- turned not later than 9:30<br />\na. m. the D. K., the Blue Jay and other caming schedule for the season, which next day. Certain<br />\nbooks may be bor- pus activities and personalities<br />\nincludes the universities that are to rowed for three days;<br />\ncertain others against the administration of the<br />\nbe met on the two circuits of the for one week. In some College<br />\nfor fees derived through the issuance<br />\nyear, Dr. C. P. Lyons, debating Teachers courses books<br />\nborrowed of the Student Activity cards, the<br />\ncoach, made public the names of for overnight use will be<br />\ndue on the regular underclass assembly was this<br />\nthose who are to take these trips.<br />\nweek converted into an open forum,<br />\nafternoon of the next day.<br />\nThe Debating Council will be<br />\nat<br />\nwhich Dean E. W. Berry, Theo4. It has been found impracticrepresented by Abner Willen, Waldore<br />\nStern, president of the Stuable to reserve books for individter Brecher, and one other man, on<br />\ndent Activities Council; Mr. Henry<br />\n(Continued on Page 3, Col. 6)<br />\nthe southern trip, which will inIddins, business manager of athclude debates with the University of<br />\nletics, and Dr. Ray Van Orman, diVirginia, the University of North Evidence OfSight<br />\nrector of athletics, gave an account<br />\nCarolina, Washington and Lee, and<br />\nFound In New-Born of the confused state of affairs arisothers. The questions that are to<br />\ning from the graft of past years, the<br />\nbe debated are \"Resolved: That the<br />\nDefinite evidence that new-born closing of the Union Trust ComPrinciples of Industrial Control as babies can see was announced after pany (in which the University<br />\nFound in the N. R. A. Should Be a series of tests conducted by Dr. funds were deposited), and the inContinued Beyond the Two-Year W. C. Beasley, instructor in psy- ability to thereby satisfy the dePeriod\", and \"Resolved: That the chology at the Hopkins.<br />\nmands of creditors of the activities.<br />\nPowers of the President Be ExWorking in the nursery of the<br />\nRake-Offs Hit<br />\ntended, As A Settled Policy of the Johns Hopkins Hospital, Dr. BeasAs explained by the Dean, the<br />\nley gave 829 tests to 142 negro in- opening of<br />\nUnited States.\"<br />\nthe year found the UniNorthern Trip<br />\nfants. All the subjects were be- versity activities faced with<br />\na deficit<br />\nThe northern trip will be taken tween the ages of two and one-half of $4,000, that immediately affected<br />\ncare of by Jack Young and Fred- hours and twelve days.<br />\nthe good name of the University and<br />\nerik Bang, with the possible addiTested With Light<br />\nthe activities involved. Those credtion of one more, who is not picked<br />\nA small flash light with the bulb itors who granted a liberal discount<br />\nas yet. They will debate, among shielded by tissue paper, was moved were paid at once, the Dean said;<br />\nother universities, the University of in an arc before the eyes of every those who refused to<br />\nmake any conPennsylvania and Columbia. Prince- infant. In each instance, the cession were paid 60 per cent of the<br />\nton is tentative. Beside the same child's eyes followed the light. amount due. Payment of these<br />\nbills<br />\nquestions as the southern trip, they When the bulb got beyond the range were made out of this year's activiwill debate the question \"Resolved: of the eyes, the baby turned its ties fees. What<br />\nremained was apThat the State Be Made Responsi- head toward the light. The same portioned to the activities. The reble for Medical Aid.\"<br />\nkinds of tests were given with col- cent reopening of the Union Trust<br />\nSouthern Trip—<br />\nored rods substituted for the light, Company has released some of the<br />\nFeb. 24—Univ. of •Richmond<br />\nand the same results were obtained. School's funds which the adminisFeb. 26—Duke University<br />\nA motion picture camera took tration expects to reappropriate next<br />\nFeb. 27—Univ. of North Carolina pictures of the eye-movements of month.<br />\nFeb. 28—Washington and Lee<br />\nthe children. This was done through<br />\nIn reply to insistent demands for<br />\nMar. 1—Univ. of Virginia<br />\na telescope designed especially to<br />\n(Continued on Page 4, Col. 5)<br />\nNorthern Trip:<br />\nmagnify the eyes of the subjects.<br />\nFeb. 21—Univ. of Pennsylvania<br />\nWide Differences Noted<br />\n\"Blue Jay\"Plans New BoyFeb. 22—New York University<br />\nA wide range of visual and racial<br />\ncott Attack; More VioFeb. 26—Columbia University<br />\ndifferences were noticed among the<br />\nlent In Character<br />\nFeb. 27—Fordham University<br />\nbabies. The vision, as well as the<br />\nFeb. 28—Princeton University, tengeneral physical condition of negro<br />\nAccording to reports received<br />\ntative.<br />\ninfants was found to be superior to from a reliable source, THE<br />\nHome Debates:<br />\nthat of white children at birth.<br />\nNEWS-LETTER has learned the<br />\nMar. 9—Washington and Lee<br />\nnext issue of the Blue Jay will<br />\nMar. 13—University of Florida<br />\nTownsmen Again Appear carry a renewed and more vioMar. 23—Univ. of Pennsylvania<br />\nlent attack upon those activities<br />\nAt Cotillion Tomorrow<br />\nApr. 6—Univ. of Vermont<br />\nviolating the agreement incurred<br />\nGoucher, University of Maryland,<br />\nDancing at Levering Hall this<br />\nby the Student Activities Card<br />\nand the University of Pittsburgh Saturday night will be to the<br />\nthan that launched at the time of<br />\nhave as yet not agreed upon the date, strains of the Townsmen Orchesthe last appearance of the ubliit was announced by Richter H. tra. This band has proved to be<br />\ncation.<br />\nWiggall, Business Manager.<br />\nthe most popular group of musiIt is understood the next as-<br />\n<br />\nNew Rules Adopted<br />\nFor Library<br />\nBooks<br />\n<br />\nDEBATERS LINE UP<br />\nROAD ENGAGEMENTS<br />\n<br />\nPresident Recovering<br />\nPresident Ames, who has been<br />\nconfined to bed at the Johns Hopkins Hospital since Monday, January 8th, is expected to return to<br />\nhis home, 2 Charlcote Place, either<br />\ntoday or tomorrow. He will probably return to the University about<br />\nthe middle of next week if his improvement continues.<br />\n<br />\ncians playing for the weekly<br />\ndances.<br />\nAlthough many special events<br />\nhave been planned in connection<br />\nwith the affair, the board announced that there will be no increase in price. Tickets may be<br />\nobtained for eighty cents per<br />\ncouple, if purchased from the<br />\nCotillion Board members before<br />\nSaturday evening.<br />\n<br />\nsault of the University periodical<br />\nwill be directed especially against<br />\nthe Hullabaloo, this action being<br />\ntaken in consequence of a recent<br />\narticle in THE NEWS-LETTER, in<br />\nwhich Theodore S. Stern, the editor of the yearbook, was interpreted by the Blue Jay as having scouted the idea of the effectiveness of the boycott policy<br />\nproposed by that organ.<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., JANUARY 19, 1934<br />\n<br />\n2<br />\n<br />\nUbe Ilevos-Aetter<br />\nFOUND= 1897<br />\n<br />\nSubscription per year _ _____<br />\n____$2.00<br />\n---------------------------------------$250<br />\nBy Mail<br />\nRemit subscription fees to John Myers, treasurer, Student Activities<br />\nCouncil, Gilman Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nin Baltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins University.<br />\nMember of The Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States and of The National College Press Association.<br />\nOffice Phone<br />\nEditor's home phone<br />\n<br />\nUNiversity 7383<br />\nLIberty 1714<br />\n<br />\nBusiness communications should be addressed to the Business Manager, Johns Hopkins University. All articles and communications pertaining to the editorial department should be forwarded to the Editor<br />\nin-Chief, Johns Hopkins University.<br />\nBUSINESS DEPARTMENT<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-chief<br />\nBusiness Manager<br />\nNorman S. Heaney<br />\nManaging Editors<br />\nEdgar S. Blumster'n<br />\nMartin Perlmutter<br />\nMillard Langfeld<br />\nAssistant Managing Editors<br />\nAdvertising Manager<br />\nRichard Feise<br />\nRay Goldberg<br />\nStanley Blumberg<br />\nJunior Editor<br />\nMelvin Goldberg<br />\nCirculation Manager<br />\nAdvisory Editor<br />\nCharles Hastings<br />\nHyman Levin<br />\nExchange and Filing Edtor<br />\nOffice Manager<br />\nIrving Leberfeld<br />\nSports Editor<br />\nBert Gordon<br />\nLeonard Wallenstein<br />\nReporters<br />\nIrvin Blum, Harold Kantrow,<br />\nNeal Potter, Carson Frailey, SidBert Prager, Allen Delevett,<br />\nney Levy, Fred Bang, A. EdelGeorge Paver, David Levy,<br />\nman, Carl Hartman, John Lyman, Alexander Batlin<br />\nLeonard Harris.<br />\n<br />\nFriday, January 19, 1934<br />\n<br />\nThey've Cooked Up An Excuse<br />\nThe explanations anent the athletic department's policy for next year which the pressure of<br />\nstudent protest has elicited from Coach Van Orman have left us with a feeling of dissatisfaction.<br />\nIt's a feeling much akin to that experienced by an<br />\narmy which has besieged a city for months and,<br />\nupon finally breaking through, discovered that the<br />\nenemy has decamped with all the spoil. These<br />\nathletics boys are slippery and elusive; but there's<br />\nsome consolation in the fact that we scared them<br />\ninto showing their real hand.<br />\nThe hand is this: they have to be continually<br />\nridden by the students before they can be depended upon to do their jobs efficiently. One of<br />\nthe members of the Athletic Council, a high University official, said a very significant thing when<br />\nhe recommended to the 0. D. K. committee, which<br />\nrecently protested before the Council that the<br />\ncaptains and managers of the teams were the logical ones to complain when the coach and financial<br />\nmanager neglected to supply enough equipment<br />\nand coaching talent. It seems to show the attitude<br />\nof the authorities — that continual prodding is<br />\nthe only way to secure decent treatment from the<br />\nathletic department.<br />\n<br />\nBut It's Strikingly Flimsy<br />\nBut though the officials have escaped the terrain which we beseiged they have very naively<br />\nleft themselves in open ground and entirely defenseless before some of our more important<br />\ncharges. They spiel off glibly that so many uniforms have been ordered here, so much money<br />\nappropriated there, that necessary economies forced<br />\nthe dropping of Mallonee as assistant coach. But<br />\nwe want to know why the money wasn't spent before? The money was available last year and yet<br />\nit wasn't spent. How do we know that the same<br />\nthing won't happen next year? Is it an indication<br />\nof competence on the part of an athletic administration which has to be dragged by the nose to do<br />\nthe obvious? We believe emphatically that it is<br />\nnot. The squirming of the department under the<br />\ncross-fire which has afflicted it for the past three<br />\nweeks is to us too much of an admission of guilt.<br />\nIts almost frenzied efforts to prove that it is doing what is needful have left us skeptical of its<br />\npower of self-motivation after the pressure is<br />\nremoved. The clam-like nature of its attitude toward every decent question we ask is becoming<br />\nIt is not apparent that there is any need for<br />\neconomies such as were introduced last year,<br />\nnamely, the cutting of Mallonee and of training<br />\ntable. Particularly when nearly $500 of the appropriation was not spent and when we are supporting a coach on a vastly disproportionate salary.<br />\nJust what sort of reasoning, we wonder, does the<br />\nathletic department think we follow? The gaping<br />\nholes in its defense would accomodate the coachand-four of the old adage.<br />\n<br />\nSo It Won't Do<br />\nSo far, gentlemen, you haven't come across<br />\nwith anything that amounts to anything. We'll<br />\nhave to insist on more concrete evidence of good<br />\nintentions. If we don't get it now we may never<br />\nget it, because there's no assurance that there will<br />\nalways be the freedom of criticism which we experience at present nor the coincidence of cit cumstances which makes this a particularly appropriate time to demand an accounting.<br />\n<br />\nSoothing Prospect<br />\nWriting editorials on campus problems, if we<br />\nmay dignify our brawls as such, engenders a sort of<br />\nsour outlook on the goodness of humanity as an applied principle. But we see some redeeming feature;<br />\nat least somebody concurs with our ideas of good<br />\nsense. And who should it be but the freshman?<br />\nMotivated by some hitherto unfelt stimulus the<br />\nfrosh have decided that it's well to lock to the<br />\nfuture, and so have decided that they will bolter<br />\nup their treasury so that when they reach seniorhood (that Valhalla of intellectual embryos—just<br />\nask a senior), the class dues will be within reason.<br />\nIt's a wise move to plan the frosh-soph dance; the<br />\nrewards will come later.<br />\nAdditional evidence of good sense is the effort<br />\nto interject some semblance of coherence and direction to the annual banquet season fighting.<br />\nLast year we suggested an organized flag rush,<br />\n<br />\nbut a pants rush is just as good and probably<br />\nmore interesting. There are some freshmen,<br />\nnames given on request, whose souls would be<br />\nmaterially benefitted by a little workout after the<br />\npants-rush detail is accomplished.<br />\n<br />\nAh9<br />\n<br />\nRats!<br />\n<br />\nWalt Disney's Pied Piper of Hamlin has nothing on Baltimore's local rat survey. However,<br />\nin the modern version of Browning's immortal<br />\ntale, only a small percentage of Baltimore's rats<br />\nare captured; and, as far as the Hopkins is concerned, the countless rodent denizens of the University<br />\ncontinue to gambol on the green in complete<br />\nsecurity.<br />\nAs an example of the small scale upon which<br />\nthe hunting operations by the United States Quarantine Station at Curtis Bay are carried on in<br />\nBaltimore, only 300 rats were caught on a recent<br />\npeak day of the campaign now under way. But<br />\nin the face of this Dr. H. F. White, director of the<br />\nsurvey, has declared that \"The showing thus far<br />\nis very gratifying and demonstrates quite expert<br />\ntrapping by men with no experience.\"<br />\nNevertheless, even though the scope of the survey's operations be increased, the rats of our campus will undoubtedly remain unmolested. With<br />\nthis prospect in view, the suggestion has been<br />\nmade that the National Student League insert a<br />\nplank in their platform demanding a governmental<br />\nboard to execute an \"anti-rat\" movement, perhaps<br />\nsimilar to that now in use in France, where the<br />\nParis police are directing a drive against rats.<br />\nThere the Prefecture maintains a special service<br />\nof \"deratization,\" which has been especially active<br />\nduring the past year, having carried out anti-rat<br />\noffensives in 1,015 places in Paris and the suburbs.<br />\nBut something must indeed be done here, for<br />\nrats abound on the campus. They are especially<br />\nnumerous around Gilman Hall, and a student recently reported seeing one the size of a full-grown<br />\nmuskrat, strolling across the road at the south end<br />\nof the automobile tunnel. And they abound around the<br />\noutside of Alumni Memorial Hall—\"Great rats, small<br />\nrats, lean rats, scrawny rats, brown rats, black rats,<br />\ngray rats, tawny rats, grave old plodders, gay<br />\nyoung friskers, fathers, mothers, uncles, cousins,<br />\ncocking tails and pricking whiskers, and families<br />\nby tens and dozens.\"<br />\n<br />\nCampus Brevities<br />\nUntil activities stop charging prices above the<br />\nS. A. C. fee for their wares, they will have all the<br />\n\"indignant mothers\" writing to THE NEWS-LETTER.<br />\nThe staff has to write something, but don't give<br />\nthem a chance to write stuff like that again.<br />\no—o<br />\na big thrill the other night<br />\nboys<br />\nhad<br />\nDormitory<br />\nwhen a car careened several times across Charles<br />\nStreet then hit a light pole. The hardest thing to find<br />\nwas somebody to take the injured man to the<br />\nhospital. Twenty men, five cars, and no good<br />\nSamaritan.<br />\no—o<br />\nEditor Phil Hamburger has started paying for<br />\nthe Blue Jay in buttons off his suits. THE NEWSLETTER is inclined to hope that the Jay editor<br />\nwon't further impair his sartorial perfection.<br />\n0-0<br />\n<br />\nThe Crimson White tells us of a certain professor at 'Wisconsin State College who recommends the old institution of cramming, because it<br />\nrepresents concentration of the highest order. He<br />\nfurther asserts that modern psychologists believe<br />\nknowledge gained more rapidly will be retained<br />\nlonger.<br />\nBecause the management evidently thinks that<br />\nthe Hopkins man will want to see his own picture<br />\nat any .cost, the Hullabaloo will probably be sold<br />\nfor two dollars extra.<br />\n<br />\nLetters To The Editor<br />\nEditor, THE NEWS-LETTER:<br />\nSir: According to Theodore Stern, president of<br />\nthe S. A. C., and editor of the Hullabaloo, the stu<br />\ndents will not receive a copy of the yearbook unless they make an extra payment. This, despite<br />\nthe fact that the S. A. C. card signed by Stern in<br />\nhis official capacity says that the holder of the<br />\ncard is to get, among other things, a copy of the<br />\nHullabaloo \"without further charge\". That was<br />\nthe legal agreement and is now being flagrantly<br />\nviolated.<br />\nIf it is true, as has been said, that the extra<br />\npayment is necessary because of funds frozen in<br />\nthe Union Trust Company, then why were not plans<br />\nlaid accordingly before the money was collected<br />\nfrom students at the beginning of this year? The<br />\nbank was closed in October; yet the Student Activities Council collected the ten dollars per student<br />\nand Stern signed each card, promising them something which, it is now claimed, cannot be supplied.<br />\nIf our extra-curricular organization leaders did not<br />\nknow how much money would be needed, then<br />\nthey are guilty of gross inefficiency; and if they<br />\nknew that they would be short money and yet<br />\nwent ahead with the selling of the compulsory<br />\nactivities cards, they are guilty of taking'money<br />\nunder false pretenses.<br />\nAnyone who criticises is immediately<br />\nsquelched by being asked for his method of unsnarling the tangle. I doubt whether I can suggest a satisfactory solution, partly because I am<br />\nunacquainted with the complexities of S. A. C.<br />\nfinances.<br />\nThe Activities Council got themselves in the<br />\nmess; let them extricate themselves without crying<br />\nto the school for sympathy and attempting to<br />\ncover over their mistake by an extra levy on the<br />\nstudent body.<br />\nS. R.<br />\n<br />\nU. S. Dramatid(<br />\nPlaced First By DI<br />\nLEADING college newspapers 31 conscientious objectors and receditorially supported ten Ohio State ommended that only 15 of the stuDr. N. B. Fagin<br />\nUniversity undergraduates threat- dents be exempted. In a letter adConscientious Objectors<br />\n<br />\nened with expulsion for conscientiously objecting to compulsory military training, flaying the university's president for his action and<br />\nlauding the students' firm stand.<br />\nAmong the publications which<br />\nbacked the Ohio State objectors<br />\nwere The Daily Illini and the Daily<br />\nWisconsin, both of which declared<br />\nthat \"these men merit the highest<br />\nrespect of every college student in<br />\nAmerica\" and praised them \"for<br />\nstanding pat on their principles\",<br />\neven though faced by strong odds<br />\nagainst them.<br />\n<br />\ndressed to the other 16 students, the<br />\ncommittee declared itself to be \"unable to find that the reasons for your<br />\napplication grew out of conscientious objection.\"<br />\nThe local Scripps-Howard paper,<br />\nin its editorial on the dispute,<br />\npointed out that the real question<br />\nhad to do with \"the basis of the committee's differentiation between the<br />\ntwo groups\" and added that \"one of<br />\nthe rejected students declares he<br />\nchallenges any one to find any real<br />\ndifference between his position and<br />\nthat of two friends whose 'exemption was approved.\"<br />\n<br />\nTHE Daily Wisconsin charged<br />\nPresident Rightmire, of Ohio, with<br />\nimpeding social and intellectual progress.<br />\nSimilarly the Daily Illini ended<br />\nits comment with this statement:<br />\n\"They (the objecting students) have<br />\nthat particular quality that can be<br />\nMen of<br />\ndescribed only as guts.<br />\nOhio, we hail you!\"<br />\n<br />\nOTHER considerations which<br />\narise are also enumerated by the<br />\ncity paper. The first, it points out,<br />\nis \"that any committee member or<br />\nadministrative official who tries to<br />\ninterpret or evaluate another man's<br />\nconscience is undertaking a difficult,<br />\nif not impossible, task.\"<br />\nSecondly, it is remarked, that to<br />\ntreat the stand of these men lightly<br />\nor to assume without thorongh inTHE trouble started when a com- vestigation that they are merely trymittee, appointed by the president ing 'to get out of drill' by a subterof Ohio State, heard the pleas of fuge would be a mistake—especially<br />\nsince one faculty member has characterized them as \"of the highest<br />\ntype of boys on the campus, students who know where they stand<br />\nand why.\"<br />\n<br />\nPolitics At Yale<br />\n(Reprinted from \"The Nation\")<br />\n<br />\nTHE students of Yale University are<br />\nbeing introduced to public affairs by<br />\nway of the picket line and a policeman's<br />\nclub, and at least some of them do not<br />\nat all like what they find. Lawrence<br />\nHill and William Gordon, members of<br />\nthe Yale chapter of the National Student League, were arrested during the<br />\nfirst part of December for standing in<br />\nthe picket line during the Kirschner<br />\nfoundry strike in New Haven.<br />\nImmediately after the arrests the Yale<br />\nDaily News gave the matter wide publicity, and two groups of students were<br />\norganized to protest to the Mayor. The<br />\nfirst group was refused admittance. The<br />\nsecond was permitted to send a delegation of three as spokesmen to His Honor,<br />\nwhereupon they were harangued with a<br />\nblast against communism. A large number of students attempted to be present<br />\nat the trials, but the police cleared the<br />\ncourtroom of everyone not directly connected with the cases.<br />\nIT IS POINTED out by persons interested in the controversy that many<br />\nof the students taking part in the various<br />\nprotests had never demonstrated in anything but a football rally before. The<br />\narrests, moreover, followed not only the<br />\npicketing but articles in the Yale Daily<br />\nNews describing conditions in the Kirschner plant. Dean Clarence Mendel is<br />\nquoted as saying: \"Yale college authorities are entirely out of sympathy with<br />\nthe interference of students in New<br />\nHaven affairs about which they are uninformed . . . The college will not<br />\nencourage the students in any extra-legal<br />\nattempts to determine the right or wrong<br />\nof any local problems.\"<br />\nSOMEBODY should inform the dean<br />\nthat picketing has been declared legal by<br />\nno less a tribunal than the Supreme Court<br />\nof the United States; there was, therefore, nothing extra-legal in the action of<br />\nthe students, unless it is illegal to print<br />\narticles describing conditions in a particular factory. If the articles are unfavorable and untrue, there are still libel<br />\nlaws to which the factory owners may<br />\nhave recourse. If they are true, there is<br />\nevery reason for college students to take<br />\nan interest in them and in strikes generally.<br />\nThere is something most unseemly in<br />\nthe attitude of a college ocer who deliberately opposes, and attempts to persuade the undergraduates in his charge to<br />\noppose, student criticism of local industrial conditions. Yale is doubtless offering courses in sociology and economics.<br />\nWhere is there a better place for a direct application of the theories taught in<br />\nthe classroom than in the town in which<br />\nthe college is situated?<br />\n<br />\nTHE third consideration is<br />\n\"whether any student gets much that<br />\nis worthwhile out of a course that<br />\nhe is forced to take against his will.\"<br />\nThe editorial ends by saying, \"A<br />\nyoung man who risks expulsion in<br />\nsuch a situation seems to us to enjoy a preponderance of evidence on<br />\nthe side of his sincerity.\"<br />\n<br />\nin<br />\n<br />\n(Continued from Page 1, Col. 2<br />\nsuperior ability in the creation<br />\nwomen characters. The best exa Gat<br />\nple of this skill is Mrs. Phelps<br />\nthe Silver Cord, a play which<br />\ntempts to explain the \"mother co<br />\nplex\" in terms of modern psych 2N]<br />\nogy.<br />\nWinning the least praise fr<br />\nDr. Fagin was the well-known Gec<br />\nauthor of Dinner At Eight, Of Th<br />\nI Sing, Let'Em Eat Cake, and of<br />\nwell-known Broadway successes<br />\nGeorge S. Kaufman. Kaufman vs<br />\nrated not as a playwright, but as<br />\n\"play doctor\", as a person \"who<br />\nup other people's plays to suit<br />\ntastes of Broadway theatregoe<br />\nMr. Kaufman's chief work<br />\nbeen done in collaboration<br />\nothers, and Dr. Fagin maintai<br />\nthat \"no truly creative artist<br />\ncollaborate with someone else.<br />\nvery act indicates a certain amo<br />\nof detachment.\"<br />\nCrothers Plays To Public<br />\n<br />\nRachel Crothers was briefly ni<br />\ntioned as a good writer of li<br />\ncomedy who \"caters to the pu<br />\nmind. Miss Crothers' plays al<br />\ntouch upon some vital social pr<br />\nlem, but in her answers to th<br />\nproblems she always compromi.<br />\nher own beliefs in order to m<br />\ntam n the approval of her middle cl<br />\naudience.\"<br />\nThe last playwright discussed<br />\nthe speaker was John Howard L3<br />\nson, \"who is not very popular but<br />\nwell known among the radi<br />\nLawson has discarded the corn'<br />\ntional old love story and in P<br />\ncessional has attempted to capt<br />\nthe tempo and spread out the<br />\npanorama of American life.\"<br />\nFollowing the lecture, a co<br />\nskit, Seesaw, by Diana Rogge,<br />\npresented. The only part in the PI<br />\nwas acted by Mrs. Singewald 2<br />\ndirected by Myra Lehr.—S. LO<br />\n<br />\nYes, but only zirrow can<br />\nshape a collar.<br />\n•A truism of no mean proportion. Arrow,<br />\nmaker of two billion collars, naturally knows<br />\nmore about cutting and styling a<br />\ncollar than anyone else in the<br />\nworld. Only Arrow shirts have<br />\nArrow collars. Try \"Trump\"$195<br />\n<br />\nLook for this Label<br />\n<br />\nSANFORIZED SHRUNK<br />\n<br />\nnew dant if one ma- shrinks<br />\n<br />\nBuy Your Arrow Shirts and Collars from<br />\n<br />\nF. C. FOSSETT & SON<br />\n311 E. BALTIMORE STREET<br />\nJOHN L. WHITNEY<br />\nCAlvert 04.84<br />\n<br />\n\f3<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 19, 1934<br />\n<br />\nisJOHNNIE QUINT<br />\nY1DEFEATS JAYS<br />\n;131' 26-21 SCORE<br />\n<br />\nTau Alpha Phi Clinches I<br />\nFirst Place In Bowl1<br />\ning Tourney<br />\nr<br />\n<br />\nLUE JAYS CLASH LEVIN CONDEMNS<br />\nITH GREYHOUNDS N. S. F. A. POSITION<br />\n°MORROW NIGHT ON CENSORSHIP<br />\n<br />\nDrs. Bergland And Hartman Speak Before Birth<br />\nControl Group<br />\n<br />\nDR. FRENCH GIVES<br />\nLIBRARY RULINGS<br />\n<br />\nDr. John McFarland Bergland, Heavy Fines Set On Overdue Reserved Books;<br />\nacting obstetrician-in-chief of the<br />\nRules Explained<br />\nBody Of Campus Leaders Johns Hopkins Medical School, and<br />\non<br />\nRejected Columbia UniDr. Carl Hartman, of the Johns (Continued from Page 1, Col. 5)<br />\nex Game Is Sixth Consecutive<br />\nMotion<br />\nversity<br />\nHopkins University, and the Car- ual students. First come, first<br />\nLoss For The Black<br />\nlps<br />\nnegie Institution in Washington, served!<br />\nAnd Blue<br />\nch<br />\nTHEM AS<br />\nDESCRIBES<br />\n5. For a home-use book not re7 CO<br />\nwere among the speakers at a closed<br />\nturned<br />\non time a fine is imposed of<br />\nMIND<br />\nRED<br />\nMOSS-COVE<br />\nTCh 2ND PERIOD RALLY<br />\nsession on birth control held Tues- 25 cents for the first hour and 5<br />\nOVERCOMES JAYS<br />\nFaculty Censorship Of Col- day in Washington as a forerunner cents for each hour thereafter.<br />\nfr<br />\nof the hearing Thursday before the Fines cannot be charged to caution<br />\nlege Paper Psychologitr George Margolis Is High<br />\nHouse Judiciary Committee on the money and no further loans can be<br />\nPoint Scorer For The<br />\nically Unsound<br />\nmade while fines remain unpaid.<br />\nPierce birth control bill.<br />\nHopkins Five<br />\not<br />\nThe<br />\nattendant in charge is not auRejection of Columbia Univer!sse<br />\nTuesday's session was the first of<br />\nthorized<br />\nto suspend or alter this regMarking its sixth consecutive<br />\nan<br />\nsity's motion for the favoring of a three-day program featuring naulation.<br />\nHopkins<br />\nthe<br />\nit as. defeat of the season,<br />\na free college press, unhampered by tionally known figures in the birth<br />\n6. Books can be borrowed over<br />\nbasketball team lost to St. John's<br />\nto College Wednesday night 26-21<br />\nfaculty censorship, by the National control movement, organized by the the week-end, unless they be in great<br />\naft at Annapolis.<br />\nStudent Federation at its recent National Committee on Federal demand.<br />\n;oe The game in many respects<br />\n7. No further loan can be made,<br />\nconvention in Washington, was Legislation for Birth Control. The<br />\nwas similar to that played by the<br />\na fine is owed to the desk.<br />\nwhile<br />\ncharacterized today by Hyman Le- conference is the first of its nature<br />\nn Jays against Washington ColInstructor<br />\nDetermines Rules<br />\n15-8<br />\nscore of<br />\natai lege. Leading by a<br />\nvin, president of the Intercollegiate to be called in the National Capital,<br />\nover the Johnnies at half time,<br />\nfor required<br />\nassigned<br />\n\"Books<br />\nst Hopkins was overcome in the<br />\nNewspaper Association of the Mid- and it has more than 500 persons, reading are reserved at the desk<br />\ne. second period by the fast pace of<br />\ndle Atlantic States, as a \"decided in official, educational, welfare, med- under such restrictions as the inano the Annapoltons. The same thing<br />\nstep backward in the march toward ical, and sociological circles for structor concerned thinks proper,\"<br />\noccurred against the \"Shoremen.\"<br />\nButterworth, McClure, McCarsocial and intellectual progress.\"<br />\nsponsors. Among these are: Dr. said Dr. French. \"The rules have<br />\ntee, Donahue and Kilmore<br />\n\"Faculty censorship of the col- Henry Emerson Fosdick, Christo- been designed to protect every stuy 111<br />\nProved a smooth working comdent from thoughtlessness on the<br />\nEIi bination for the Johnnies. Howlege press is not only contrary to pher Morley, Kermit Roosevelt,<br />\npart of the reader.\"<br />\nTeam<br />\nHas Strong<br />\nPti ever it was not until the second<br />\nAmerican ideals of free speech and Samuel Untermeyer, Hendrik WilIn commenting to a NEWS-LETalw Period when Hopkins shifted its<br />\nLoyola has a strong team, having free press but is also psychologically<br />\nTER<br />\nreporter, Miss Lanier said that<br />\nlem<br />\nAmelia<br />\nLoon,<br />\nEarhart<br />\nand<br />\nVan<br />\nini<br />\npr lineup to include at center<br />\nour veterans forming the nucleus and educationally unsound,\" Levin<br />\n1<br />\nheavy fines have been imposed<br />\n\"the<br />\nwho had been<br />\nKelly<br />\nstead<br />\nof<br />\nPutnam.<br />\n) th<br />\nf the club—Lunak, forward and declared today. \"Freedom is as necPivoting for the Jays, that Butin order to emphasize the demand,<br />\n•omi terworth started his scoring<br />\nrather than to increase the library's<br />\nrack shot of the squad; Rehkopf, essary to the college newspaper as it<br />\nmai Spree which sent St. John's into<br />\nBasketball<br />\nOfficials<br />\nfunds.\"<br />\nTaneyhill,<br />\nle Cl the lead. The Johnny center was lays Look To Win At The 'forward; Colvin, guard;<br />\nis to the large metropolitan daily<br />\nMay Have New Signal<br />\nPoorly guarded by the Jays and<br />\nenter. The other guard position is paper. It is this freedom, made posKnights Of Colum>sed Proceeded to score two baskets<br />\ntilled by Carney, a freshman, who sible two hundred years ago when Holding Up Arm With Distinctive Dr. Healy Addresses<br />\nbus Pool<br />\nand two foul shots in quick orCharles Carroll Club<br />\nI La der.<br />\nBand Indicates Team For<br />\ni as excited no little comment among John Peter Zenger won his stirring<br />\nr bu During the first period Hop- Inaugurating its current cam- 1basketball fans in the few appearThrow-In<br />\nbattle against the English throne<br />\n(Continued from Page 4, Col. 3)<br />\nadia<br />\nseemed to have everything mign tomorrow against the ManThis will prob- which tried him for libel, that has<br />\nmade.<br />\nhas<br />\nhe<br />\nances<br />\nsaid<br />\nthat all the later objections to<br />\nguarding<br />\nIts<br />\nWell<br />\ncontrol.<br />\nBasketball officials may soon have<br />\nunder<br />\n:onv<br />\niattan College swimming team, at . ly be the starting team for Loyola.<br />\nWas<br />\nexpected<br />\nas<br />\nbe<br />\ncould<br />\nas<br />\ngood<br />\ncan be found in PorChristianity<br />\nn P<br />\nplaced the newspaper in the fore as a new way to signal which team deteams,<br />\nand<br />\n°f<br />\nany<br />\nleague<br />\nof<br />\nthe<br />\nthe<br />\npool,<br />\nColumbus<br />\n'<br />\nof<br />\nKnights<br />\nhe<br />\nceris<br />\nit<br />\npyry.<br />\nCriticism<br />\nof the Scriptures<br />\nwriting,<br />\nAt the time of<br />\nrapt<br />\na leading institution and as a leader serves possession- of the ball out of<br />\nthe Jays were making good their iopkins natators will be out to re17th century,<br />\nthe<br />\nin<br />\nstarted<br />\nagain<br />\ntain that if Captain Camitta and in the thinking of the American bounds.<br />\n°Pportunities at the foul line, and<br />\nand the history of this criticism is<br />\n)eat their victory of two years ago, George Margolis do not appear on<br />\nWhile on the offense.<br />\npublic.<br />\nSeveral<br />\nthe<br />\ncolleges,<br />\nincluding<br />\nactually the history of philosophy.<br />\nThe play of George Margolis n which the Jays triumphed over<br />\nhe starting line-up of the St. John's<br />\nButts Of Justified Criticism<br />\nNaval Academy, have had officials<br />\nIn condemning the old beliefs that<br />\nWas outstanding for Hopkins,<br />\nhe New Yorkers by one point.<br />\ngame, they will be on the floor when<br />\n\"The National Student Federa- wear a white sleeve on one arm and Christianity had its origins in the<br />\nhe p Particularly when Hopkins had<br />\nThe Hopkins squad has shown up he starting whistle blows Saturday. tion convention, composed largely of<br />\nLid 3 Possession of the ball. In addition<br />\na black sleeve on the other. When other religions, of antiquity, Dr.<br />\nLE the Jay guard made a perfect .specially well in practice, and gives Don Kelly will be at his forward student council heads, in most cases the ball goes out of bounds, instead Healy declared that Christianity actually brought several entirely new<br />\nrecord on foul shots during the n-omise of developing into the position, with Siverd and Reynolds themselves the butt of justified ediof verbally announcing the team en- things: freedom of conscience, war<br />\nfirst half scoring five points in ;trongest aggregation that has ever probably filling the other vacancies. torial criticism, must have been atwill be tended by moss-covered minds titled to possession, the referee against slavery, and the exaltation<br />\nfive attempts.<br />\n-epresented the University in swim- Chancellor, Mann and Siegal<br />\nSwerd and Seigle started the ning. They are meeting a worthy in reserve. - Unless Camitta and which failed to comprehend the sig- would signal by holding up the of the position of women. As far<br />\nMargolis are in the line-up Wednes- nificance and importance of free- sleeve with the color assigned to as the liturgies are concerned, he<br />\ngame for Hopkins at forward<br />\nManhattan, however, and day night against St. John's, their dom of the college press. Their re- that team. The idea is to do away said, they can rather be traced to<br />\nin<br />\noe<br />\ncenter<br />\nat<br />\nPosts, with Don Kelly<br />\nand Margolis and Reynolds play- they will have to extend themselves appearance with the team Saturday fusal to stand by this freedom and with confusion which often occurs the Jewish synagogues than to the<br />\nold Oriental mysteries.<br />\nwill mark the first contest in which to encourage it is a decided step over possession of the ball.<br />\ning the guards. This quintet :0 repeat their 1932 triumph.<br />\nits<br />\nsomarch<br />\ntoward<br />\nby<br />\nthe<br />\nin<br />\nbackward<br />\nrepresented<br />\nfunctioned well till almost the<br />\nbeen<br />\nOpponent<br />\nhas<br />\nHopkins<br />\nMurray Strong<br />\nteam, and the outcome will cial and intellectual progress.\"<br />\ncomplete<br />\nend of the first period when<br />\nby<br />\nled<br />\nis<br />\nteam<br />\nThe Manhattan<br />\nAttacking faculty censorship, Leshow the strength of this year's<br />\nCoach Darley withdrew Seigel<br />\nCaptain Murray, who almost caused<br />\nvin asserted that every college pawho had three fouls against his<br />\ngroup.<br />\nlast<br />\ntheir<br />\nin<br />\ndownfall<br />\nJay's<br />\nBlue<br />\nthe<br />\nGood<br />\nCards<br />\nA.<br />\nA.<br />\nrecord, from the game.<br />\nper should have the inalienable right<br />\ndoubt<br />\nto<br />\nas<br />\nsome<br />\nis<br />\nmeeting.<br />\nThere<br />\nIn order to avoid the confusion to express itself editorially as it<br />\nAt this point Chancellor entered the fray and continued to whether Murray, a sprint man, has that resulted at one of last year's wishes, provided the opinions exCalvert Room Suits and<br />\nPlay during the first ten minutes graduated or not, but should he games with Loyola, this game is pressed remain within the canons of<br />\nTopcoats,<br />\nNow $17.50<br />\nof the second period. Siegal was :ompete against Hopkins, he will Hopkins' home contest, And Athlet- decency, propriety, and truth, and<br />\nagain thrust into the line-up and face the stellar Blue Jay dash men ic Association cards are good. How- should in no case be obliged to beever, the next game with Loyola, on come a mere \"house organ\", bound<br />\nthe beginning five began to get<br />\nof holding their<br />\nFebruary 17, will be their home to shout 'hallelujah' over the evi°n its feet again but it was too who are capable<br />\nopposition.<br />\nall<br />\nalmost<br />\nagainst<br />\nDwn<br />\ngame, and A. A. cards will not ad- dent shortcomings of the institu26-21.<br />\nlate and the game ended,<br />\nmeet,<br />\nManhattan<br />\nthe<br />\nA<br />\nafter<br />\nweek<br />\ntion.\"<br />\nmit the bearer.<br />\nHopkins scored six baskets in<br />\n211 - 213 E. Baltimore Street<br />\nEditors Should Control<br />\nthirty-six attempts while St. the Hopkins natators will encounter<br />\na<br />\nJohn's counted eight in forty- the Williani and Mary team at the Marksmen Gain Fourth<br />\n\"It is the belief of the I. N. A.<br />\n,<br />\nnational<br />\nEpsilon,<br />\nDelta<br />\neight tries.<br />\nPi<br />\nthe<br />\nand<br />\nVictory Of Season<br />\nlatter's pool. The Black and Blue<br />\nhonorary college journalism fraterwithout<br />\ncontest<br />\nthis<br />\nshould take<br />\nPlue Jay Mat Team<br />\nThe University Rifle Club gained nity, that student editors should be<br />\nmuch difficuty, as the Virginians usWrestles Gallaudet ually present a very weak squad. its fourth victory of the season last given full control, with strict acweek when it defeated the Univer- countability as college students and<br />\nHopkins<br />\nLine-Up<br />\nlooking<br />\nBlue Jay wrestlers are<br />\nsity of Princeton team in a postal as American citizens for the exerfnrward to their meet with GallauThe line-up against Manhattan:<br />\nmatch by the score of 1370-1278. cise of that control. That, by far,<br />\n(let Saturday for their first win of<br />\nMatches were also held with Kan- is far superior to faculty censor50 yards—Levi, Bahlke<br />\nne season. The Jays defeated the<br />\nsas University and the Alabama R. ship.\"<br />\n100 yards—White, Levi<br />\nLw ashington team last year. After<br />\n0. T. C., but the results of these<br />\n440 yards—Adler<br />\n'laving remained idle for one week,<br />\nhave not been computed as yet.<br />\n150-yard backstroke — MacGill, This week the varsity squad will<br />\nLie<br />\nSquad will be in fine mettle to<br />\nNoonan<br />\nLake over the fairly strong team of<br />\nengage in mail contests with Univer200-yard breastroke—Capt. Sadt- sity of Pittsburgh, New York Milthe opposition. Outstanding men<br />\n°4 the squad are Captain Phil Hartitary Academy, Valley Forge Miller, Hazlett<br />\n,an, McDaniels, and Bourne, al4.111<br />\nitary Academy, and M. I. T. The<br />\nDive—McConnell<br />\n.̀:t°ugh Stolberg and Mitchell are Relay — Adler, Levi, White, R. 0. T. C. last week lost to the<br />\nleveloping real ability.<br />\n'<br />\nNew York University R. 0. T. C.<br />\nJones, or Bahlke.<br />\nbe:<br />\nWrestling for Hopkins will<br />\nby the score of 1397-1349.<br />\nChick Merson, 118 lbs.; Miller or<br />\nelber, 126 lbs.; Captain Phil HartPhone Belmont 7908<br />\na, 135 lbs.; Stolberg or Waters,<br />\nPrinters of<br />\nPhilological and Scientific<br />\n45 lbs.; McDaniels, 155 lbs.;<br />\n'<br />\nBIRELY'S<br />\nPublications<br />\nBALTIMORE, MD.<br />\nl<br />\n1\\/1itche<br />\nI@ 11<br />\nl, 165 lbs.; Connor, 175 lbs.;<br />\nPHARMACY<br />\nBALTIMORE<br />\nPL.<br />\n12-20<br />\nHOPKINS<br />\n(311rne, heavyweight.<br />\n•The only thing on which<br />\nPrivate Rooms and Banquet Halls<br />\n—<br />\nST. PAUL at 33RD STREET<br />\nand touts have ever<br />\ndeacons<br />\nfor All Occasions<br />\n.• S •<br />\nYour Neighborhood Drug Store<br />\nagreed—because it's jamCuisine and Furnishings<br />\npacked with belly-laughs and<br />\nPeabody Pharmacy<br />\nPRESCRIPTIONS<br />\n-raisers for every man<br />\nbrow<br />\nUnexcelled<br />\nCALVERT and 30TH STS.<br />\nSchool Supplies, Candy, Cigars<br />\nof every type and taste!<br />\n—<br />\nFLORISTS<br />\nDECORATORS<br />\nPhu in Quality — First in<br />\nMembers, F. T. D Asso., Inc.<br />\n1484<br />\nUnexcelled Fountain Service<br />\nService<br />\nAutos Garaged<br />\nRooms,$3.00 up<br />\nd \"0 dehvery4,..........=<br />\nMake Our Store Your Store<br />\n0573<br />\nVEr.<br />\nST.<br />\nN.<br />\n1918<br />\nCHARLES<br />\n.<br />\nmal12t2a<br />\nWinning three games yesterday<br />\nfternoon, the Tau Alpha Phi FraTo Be Scene Of<br />\nmmity clinched the title in the first 3 vergreen<br />\nSkilled<br />\nContest;<br />\nLoyola<br />\nalf of the Interfraternity bowling<br />\nPlay Due<br />\n3urney.<br />\nBeta Theta Pi, and Phi Pi each , . A. CARDS WILL<br />\nion three games yesterday, too,<br />\nBE GOOD AT GATE<br />\nThile Phi Gamma Delta won one<br />\n3 s Strength Test Of The<br />\name.<br />\nComplete Hopkins<br />\nOutstanding in Tau Alpha Phi's<br />\nTeam<br />\nictory were Hammerbacher, Kern,<br />\nlager and Corkran. The final<br />\nBy A. EDELMAN<br />\nlanding in the first half is as folHopkins's fourth league game of<br />\n)ws:<br />\nthe season gets under way tomor4 1 ow night when the Blue Jays meet<br />\n1. Tau Alpha Phi 26 5<br />\n2. Beta Theta Phi25<br />\nthe Loyola Greyhounds at Ever10<br />\n20<br />\n3. Phi Psi<br />\n€ reen.<br />\n4. Phi Gamma<br />\nWith the renewal of football re10<br />\n20<br />\nDelta<br />\n1ations with Loyola, a great deal of<br />\nA second round of the tourney<br />\npirit has been evinced in connecviii start next week and the winner<br />\ntion with future athletic relations<br />\nIf this half will meet the first half<br />\n1between the Jay and Greyhound<br />\nvinner in a post-tourney series for<br />\n(ontingents, and this contest bodes<br />\na, cup which is to be awarded.<br />\n1 ell to be a \"good\" one, and a sellut at the gate.<br />\n<br />\nionaNs NATAToRs(<br />\nwEET MANHATTAN,rum<br />\niERE TOMORROW ,<br />\n<br />\nAll Ready for Service Suits,<br />\nOvercoats and Topcoats<br />\n<br />\nKATZ<br />\nCLOTHES<br />\n<br />\n4<br />\n<br />\n0F F<br />\n<br />\nTHE EMERSON HOTEL<br />\n<br />\nL<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nJ. A. RITTER & SON, INC.<br />\n<br />\n\fNi<br />\n<br />\nHOME WOOD, BALTIMORE, MD., JANUARY 19, 1934<br />\n<br />\n4<br />\n<br />\nSAYS LIVING TODAY Prodigal Son Returns, Unfolds<br />\nMORE FASCINATING Sunny And Not-So-Sunny South<br />\nTHAN IN PAST ERA Dr. Mitchell Describes To Classes Beauty Of Southern<br />\nSherwood Eddy, Noted Author, Addresses Combined Meeting<br />\nAddressing a combined meeting<br />\nof the Y. M. C. A. cabinet and the<br />\nFreshman Commission on Tuesday<br />\nnight, Sherwood Eddy, lecturer and<br />\nauthor, stated that \"Liberty without<br />\njustice and justice without liberty<br />\nare not good enough.\"<br />\nHe believed that while it might<br />\nhave been fascinating to live during the Italian Renaissance, the<br />\nFrench Revolution, the American<br />\nRevolution, or the Russian Revolution, it is far more interesting to be<br />\nalive today when a stupenduous<br />\ntransition is taking place also.<br />\nNew Epoch<br />\n<br />\nThe new epoch which students<br />\nwill help bring about Mr. Eddy expected to embody Greek culture, Roman law and order, Hebrew moral<br />\nand spiritual insight, scientific<br />\nachievement for the production of<br />\na material basis of life for all, and a<br />\nsocial movement for justice and the<br />\nmore universal sharing of privilege.<br />\nFrom this point of view, the<br />\nspeaker commented on both the<br />\nRussian and the American experiments. He expressed a disinclination to live under the Soviets because of its denial of liberty, its<br />\nviolence and compulsion involving<br />\nperpetual revolution and a restriction of emigration, and its dogmatic<br />\natheism. At the same time he admitted that an attempt to abolish unemployment, injustice, and poverty<br />\nwere \"amazingly good things.\"<br />\nUnderdog Helped<br />\n<br />\nWith regard to the NRA and the<br />\nAAA, Mr. Eddy believed that the<br />\nRoosevelt program was out to help<br />\nthe underdog. A large number of<br />\noutspoken senators with whom he<br />\nhad chatted believed the President<br />\nwould eventually be driven to the<br />\nleft, he said.<br />\n<br />\nAlready<br />\nACTIVITIES CALLED N.C.AtCollege<br />\nFootball Practicivoi.<br />\nSCIENCE<br />\n'LOUSY DEAL' DURING Winter football drills have<br />\nready begun at North Carolina State<br />\nHow, by the use of the electric STUDENT ASSEMBLY College. Eighty candidates greetec<br />\n<br />\nCities; Sees New Orleans Capitol As<br />\nA \"Long\" Affair<br />\n<br />\neye, a tune could be played on a<br />\nxylophone by a person some dis- Graft In Hullabaloo In Past<br />\nYears Cited; Meeting<br />\ntance away, was demonstrated reIs Continued<br />\ncently by Dr. Phillips Thomas in an<br />\nAfter an absence of several weeks decorated. Conspicuous among its<br />\naddress before the Middle Atlantic<br />\nDr. Mitchell has returned.<br />\nOn trappings is a placque of Huey, his<br />\n(Continued from Page 1, Col. 6)<br />\nTuesday, in characteristic fashion, \"bulbous nose\" included, and \"a Conference of Building Owners<br />\nfurther information, as to the alhe launched into the new monetary monument to bad taste,\" according and Managers in Baltimore.<br />\nleged<br />\ntheft or mismanagement of acaccomplished<br />\nby<br />\nmeans<br />\nThis<br />\nwas<br />\ndevelopments along the Roosevelt to Dr. Mitchell.<br />\ntivities<br />\nfunds in the past, Theodore<br />\nof<br />\na<br />\ngrid<br />\nglow<br />\ntube<br />\nattached<br />\nto<br />\neach<br />\nfront.<br />\nEverything considered, especially<br />\nStern,<br />\neditor-in-chief<br />\nof the Hulnote<br />\nand<br />\nothers<br />\nattached<br />\nto<br />\ncomAt nine-thirty he enthusiastically the gross neglect of the most neceslabaloo,<br />\nadmitted<br />\nthat<br />\n$600 of the<br />\naccombinations<br />\nfor<br />\nchords<br />\nof<br />\nthe<br />\ngave the boys a picture of New Or- sary functions of the government,<br />\nfunds<br />\nfor<br />\nappropriated<br />\nthat publidarkened,<br />\nleans, Birmingham, Knoxville and which is sadly \"broke\", it seemed panist. With the room<br />\ncation<br />\nlast<br />\nyear<br />\nare<br />\nstill<br />\nunaccounted<br />\nincomprehensible to the economist two flashlights are focused on the<br />\nother places along the route.<br />\nfor.<br />\nDean Berry further added<br />\nThe first, he assured them, did not how so much money can be spent on tubes, the light in one hand playing<br />\nthat<br />\nafter<br />\nmismanagement of funds<br />\ncontain as his friends had always \"tobacco-spitting politicians and so a tune and that in the left hand furtook<br />\nplace<br />\nwith regard to a \"certain<br />\nled him to believe, a comparatively much \"sacrificed for deluxe quar- nishing the accompaniment.<br />\npublication\" an investigation re0-0<br />\nsmall French district but literally ters of legislators.\"<br />\nvealed that certain persons had reFor nearly nine months, Dr.<br />\nmiles and miles of old house, covceived a \"rake-off\" when contracts<br />\nAdolph Meyer, Henry Phipps proered with stucco, discolored by the Dr. Healy Says Church<br />\nwent through for particular adverdampness, and encircled by balcon- In Rome HadSituation fessor of psychiatry at the Johns<br />\ntisers<br />\nand printers.<br />\nies. For, he explained, \"A balHopkins Medical School, has had<br />\nSimilar<br />\nTo<br />\nPresent<br />\nOne<br />\nPetty Graft Admittedunder examination the brain of<br />\ncony is to one of those houses as a<br />\nZangara,<br />\nassassin<br />\nof<br />\nnavel is to a man.\"<br />\nGuiseppe<br />\nA<br />\ngreat<br />\ndeal of criticism also<br />\nAssembling for the first time since<br />\nChicago.<br />\nMayor<br />\nAnton<br />\nCermak,<br />\nof<br />\nThese balconies are supported by their return from the Christmas vagreeted Stern's admission that even<br />\niron rods propped up on the inev- cation, the members of the Carroll<br />\nCross pollination of pears has an today \"petty graft is still going on.<br />\nitable flag stones. Some of the roofs Club heard an address in Levering effect on the shape of the fruit, but<br />\nWhen I sign a requisition for<br />\nare covered with colored Welsh Hall last Sunday by Dr. Patrick this is due to the increase in the<br />\nstamps, I can't be absolutely sure<br />\nslate, brought over as ballast. The Healy, professor of Church History number of seeds produced rather<br />\nthat<br />\nit is going for stamps and for<br />\nmoisture makes for very luxuriant at the Catholic University in Wash- than the effect of pollen on the fruit<br />\nnothing else.\"<br />\nvegetation, especially in the court- ington, entitled \"The Church in the itself.<br />\nyards. In short, New Orleans Roman Empire\".<br />\n0-0<br />\nDespite this, Dean Berry praised<br />\nA \"fog camera\" which harnesses the present Student Activities<br />\nstruck Dr. Mitchell as \"a city of roThe situation of the Church then<br />\nmance.\"<br />\nwas not very different from that the infra-red ray and is designed Council for the best managed counThe only unbelievable thing about of today, Dr. Healy pointed out, to extend the limit of visibility ot<br />\ncil in years.<br />\nit, he thought, was the state capitol. and the first attacks on the Christi- the navigator has been installed for<br />\nThe situation, however, has now<br />\nIt cost $5,000,000. Huey Long is ans resulted, as far as we know, the first time on the S. S. Manhattan,<br />\nof<br />\nthe<br />\nUnited<br />\nbeen<br />\ncorrected, the Dean explained,<br />\nStates<br />\nLines.<br />\nresponsible. Every part of the from economic matters. Later they<br />\nThe camera is the invention of by the present ruling that all paybuilding seemed especially made, were charged with obstinacy, rethe state flower, the state bird, and sistance against the Roman state, Flavel M. Williams, master mariner ments must now be made by check<br />\nthe brass elevator doors. Above all and atheism, in that they did not and former naval officer. The in- instead of the old method of paythere were also lots of trick devices believe in the regular Roman gods. strument records on a specially ment in cash by each activity.<br />\nCelsus And Porphyry<br />\ntreated infra-red ray film strip fogin the governor's office which inCompulsory Fees<br />\ntrigued Dr. Mitchell very much. In the second and third centuries, hidden objects ahead of a ship. It<br />\nObjections to making the activity<br />\nAmong these is a radio which com- continued Dr. Healy, there were two also develops and \"fixes\" the negafees compulsory were greeted with<br />\nmunicates the proceedings of the very important literary opponents tive in thirty seconds.<br />\nby Dr. Berry, who exsympathy<br />\nHouse and the Senate chambers of Christianity, the philosophers<br />\nBy pressing a button, which illubefore<br />\nthe depression set in<br />\nplained<br />\nPorphyry.<br />\nPophpyry,<br />\nhe<br />\nCelsus<br />\nand<br />\nand a miniature replica of voting<br />\nminates the negative, the navigator<br />\nbeing<br />\nprogress<br />\nwas<br />\nmade toward the<br />\nChrist<br />\nwas<br />\na<br />\nmachines in both houses in order said, contended that<br />\nof<br />\nthe<br />\nship<br />\nmay<br />\nsee<br />\nthe<br />\nnegative<br />\nin<br />\nabolition<br />\nof the fees.<br />\nof<br />\nreduction<br />\nthat His Excellency may know just good rabbi, whose deeds had been<br />\nthe<br />\nthe<br />\ncamera<br />\nthirty<br />\nseconds<br />\nafter<br />\nthat ache<br />\nbelieved<br />\nstated<br />\nthat<br />\nHe<br />\nsurrounded with legends, and it is<br />\nhow he is making out.<br />\nnot<br />\nself-supporttaken.<br />\ntivities<br />\nwhich<br />\nwere<br />\npicture has been<br />\n(Continued on Page 3, Col. 6)<br />\nThe Senate chamber is profusely<br />\n<br />\nHeartley (Hunk) Anderson, tli<br />\nnew head coach of the Wolfpack.<br />\nAnderson watched the squad lira<br />\nber up during most of the afternoon,<br />\nbut made clear his intent to intro'<br />\nduce the shift and other importan'<br />\nparts of the Rockne system befon<br />\nthe practice was owl-.<br />\n,Seco<br />\n<br />\ning should be done away with. Tli(<br />\nDean insisted, however, that the stv<br />\ndent activities fees belong to thePOI<br />\nUniversity and not to the student: y<br />\n—\"they belong to us and not t<br />\ndm<br />\nyou\", he said.<br />\nReplying to the criticisms direct'<br />\ned against the Athletic Department<br />\nby Norman Heaney, Mr. Henr)<br />\n001<br />\nIddins, business manager of the rche,<br />\nAthletic Department, quoted figuret0r th<br />\nto show that athletic receipts were\"1 b<br />\ngreatly reduced from those of pre'<br />\n10th.<br />\nvious years. Mr. Iddins also es:<br />\nsialic<br />\nplained the University was carryingscif f(<br />\na large deficit incurred by the athicr th<br />\nletic department and that the Prest'!he or<br />\ndent's office had recently requesteeltetunti<br />\nthe Board of Trustees to wipe ()PI'<br />\nnidwi<br />\nthis \"paper debt\".<br />\nEdward Sadtler, president of the<br />\nIn<br />\nStudent Council, announced that the<br />\nairing of the athletic and activities<br />\nsituations will be continued at next<br />\nweek's assembly.<br />\n<br />\nHEIDELBERG INN<br />\nFIRST CLASS RILSTALTRANT<br />\nDELICATZSSEN<br />\n<br />\n1111d<br />\n<br />\n2436-38 ST. PAUL STREET<br />\n25c Breakfast — 25c Lunch<br />\n50c Dinner<br />\n••...•••4/<br />\n•<br />\n\"'' ••41. .'•<br />\n<br />\n°r st<br />\n<br />\na1<br />\n(<br />\n.]<br />\n'<br />\n<br />\nICE SKATING<br />\niake<br />\n'<br />\nc<br />\nMornings, Saturdays, Holidays,<br />\n10-12:30 — Afternoons, 2:30 to5 -Evenings, 8:30 to 11.<br />\n<br />\nSPORTS<br />\n<br />\nI4'aY n<br />\n<br />\nThE<br />\n<br />\nCENTRE ei„,<br />\n<br />\neaves are used in<br />\nLUCKIES<br />\n<br />\nti<br />\ntootn<br />\n4to a<br />\näble<br />\n<br />\nkserv<br />\n<br />\nkkets<br />\nhese<br />\nrsor<br />\n<br />\nDor<br />\n<br />\nrida)<br />\nhirty<br />\nthe<br />\nLlso bi<br />\n[le N<br />\n<br />\nqz,<br />\n<br />\nRab<br />\ntan<br />\n<br />\nFortheie a/retheMilded<br />\nrOeftedfor<br />\na/nd<br />\n\"vr<br />\ned sindhly<br />\nWe buy only the center leaves for Luckies.<br />\nNot the top leaves for they are under-developed.-Not the bottom leaves for they are<br />\ninferior in quality. Only the center leaves<br />\nfor these are truly mild and fully ripe. And<br />\nthat's the fine tobacco we use —to make<br />\nLuckies so round, so firm, so fully packed<br />\n—free from loose ends that spill out. That's<br />\nwhy Luckies are always mild,always truly<br />\nmild. And remember, \"It's toasted\"—<br />\nfor throat protection—for finer taste.<br />\n<br />\nLucky Strike presents the Metropolitan Opera Company<br />\nSaturday at 2 P. M., Eastern<br />\nStandard Time, over Red and<br />\nBlue Networks of NBC, Lucky<br />\n<br />\nStrike presents the Metropolitan<br />\nOpera Company in the complete<br />\nOpera, \"DON GIOVANNI\".<br />\n<br />\nAlways the Finest Tobacco and only the Center Leaves<br />\nCopyright, 1934, The American Tobacco Compivay.<br />\n<br />\news ;<br />\n<br />\norro<br />\nf<br />\nAt •<br />\n• C.<br />\nazar(<br />\n<br />\nour c<br />\n<br />\nrn,<br />\nrid R<br />\nThe<br />\nrig of<br />\n<br />\net, b<br />\n<br />\nqurn<br />\n<br />\nbserv<br />\n<br />\n\f", "format": "basic_html", "processed": "1E<br />\nU<br /><br />\nINTERCOLLEGIATE<br />\nf4BETI<br /><br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\ntons *op<br /><br />\nlit ell<br /><br />\nStudent's Career Through<br />\nCollege, Topic Of R.<br />\nN. Dempster<br /><br />\nSOPHS, FROSH<br />\nTO MEET,DISCUSS<br />\nBANQUET SEASON<br /><br />\nMr. Ryland N. Dempster, registrar of the Johns Hopkins University, and Dr. W. W. Cort, of the<br />\nsec<br />\nJohns Hopkins School of Hygiene,<br />\nins 1<br />\nFirst<br />\naddressed the members of the Pa- Lack Of Quorum Ends<br />\niddr<br />\nGain<br />\nTo<br />\nAttempt<br />\nrent-Teacher Association of the<br />\nOpinions<br />\nin j&amp;ddress Plea To President Forest Park High School, Tuesday<br />\nof<br />\nAnd Board Of<br />\nevening in the school auditorium.<br />\nMr. Dempster discussed \"A Stu- CLASS OFFICIALS<br />\nTrustees<br />\ndent's<br />\nCareer Through College\", URGE COOPERATION<br />\nchel<br />\nwhile Dr. Cort continued with the<br />\nIAN RECEIVES<br />\nw<br />\nstudent's<br />\ncareer through \"Profes- Thursday Set As Next Date<br />\n; fr PAPER WEDNESDAY sional School.\"<br />\nFor Discussion Of Important Problems<br />\nlis d<br />\nThe student's high school career<br />\netitions Circulated By N.<br />\n,f t<br />\nwas also discussed by Mr. William<br />\nS. L. And Special<br />\nDue to failure of the majority of<br />\nA. Dehuff, principal of the PolytechCommittee<br />\nnic<br />\nInstitute, at the meeting, at the Sophomore and Freshmen class<br />\nkerties<br />\nwhich Mr. George Reindollar, pres- members to attend the meeting<br />\ny<br />\nPetitions requesting the Board of ident of the Parent-Teacher Assocalled by their class officers yesterne rustees to abolish both the Student ciation, presided.<br />\nday, another meeting is scheduled<br />\nties ctivities and the Athletic fees and<br />\nfor next Thursday, following the<br />\n!ratio .aring the signatures of 175 unassembly.<br />\nhe 'ergraduates were submitted to<br />\nMeade Johnson, president of the<br />\n!xpe' .•n E. W. Berry on Wednesday.<br />\nSophomore class, said, \"We, the<br />\nII<br />\nThe signatures were secured by<br />\nimtg t Corps of student members of the Says British Authors Lack class officers, have a number of<br />\nportant proposals which involve the<br />\nzist ' 'hunittee Against Compulsory<br />\nEnergy, Place O'Neill<br />\ninterest of the individual members<br />\nFirst<br />\nof t ees and of the National Student<br />\nof both classes.<br />\nds. eague who canvassed the campus<br />\nAsserting that American playmay be<br />\nmimeographe blanks during a wrights today are the best and most \"In order that the plans<br />\ntor ithd<br />\nto<br />\naccording<br />\nquickly<br />\nand<br />\nupon<br />\nvsit s.niod of ten days.<br />\nvigorous in the world, Dr. N. Bryl- acted<br />\nlion Fagin, professor of English the opinions and desires of the maTo Reinforce Athletic Agitation<br />\ne<br />\nLiterature, Monday night delivered jority, we solicit your cooperation<br />\nC, Coming at this time, the petitions<br />\na lecture on prominent contempo- in assisting us to carry out your<br />\noint ere intended to reinforce the agi- rary<br />\nAmerican dramatists before wishes.<br />\nFoil 'ti°ns among the student body in the Johns Hopkins Playshop. Dr.<br />\n\"It has always been our policy<br />\navor of more efficient management Fagin declared that modern British<br />\n'f athletic affairs as well as to in- drama does not reveal the energy never to act without the approval<br />\nortn the administration and the Stu- to be found in the work of present- of those whom we represent, but<br />\n'ent Activities Council of collegiate day American writers. Shaw has unless a necessary amount of class<br />\n•5<br />\nlost his sparkle, the speaker said, interest is shown, we shall be forced<br />\n'utiment on the subject of compuland the most powerful English to depend entirely on our own prin(n'Y fees. The Committee consid- dramatist<br />\nat the present time is the ciples.\"<br />\nred it desirable to do this before Irishman.<br />\nThe proposals that must be detiscussions of the subject took place<br />\nEugene O'Neill was held to be<br />\n't the assembly yesterday.<br />\nthe greatest of our dramatists, \"for, cided upon at the earliest opportuThe petition read as follows: despite the fact that he has written nity constitute a program which will<br />\nmany poor plays and despite the build up the class treasuries for the<br />\nWe, the undersigned, students of<br />\nfact that even parts of his best plays senior years by reinstating the old<br />\nhe Johns Hopkins University, re- are weak and<br />\nfaulty he is still su- plan of a combined dance of the<br />\nluest of the Board of Trustees that perior to all of his<br />\ncontemporaries.\"<br />\ntwo classes, which will merit the<br />\nhe ruling compelling every student<br />\nPraises Barry<br />\napproval of all members.<br />\n° Pay a Student Activity fee of<br />\nPhilip Barry was greatly praised<br />\nThe other proposal calls for one<br />\nen dollars and an athletic fee of by Dr. Fagin as outstanding in the<br />\naside for the demondollars be abrogated; first, be- comedy of manners. Hotel Uni- day to be set<br />\nBarry's ven- stration of school spirit in which<br />\n'use the ruling was passed at the verse was described as<br />\nture into \"highbrow drama\"—a ven- everyone will be able to participate.<br />\nequest of the students and student<br />\nture that resulted in a play as good<br />\nIn order to discover whether the<br />\n'entirnent at the present time de- as those of O'Neill.<br />\nclasses<br />\nare wholly in favor of the<br />\nands its rescinding; and, second,<br />\nAnother writer who ranks high<br />\n'eeatise in this time of depression in the field of American drama is above features of the coming banquet season, it is incumbent upon<br />\nanY students find it difficult to pay Sidney Howard. Mr. Howard, the<br />\nlecturer asserted, has displayed a the members themselves to express<br />\nhese unnecessary fees.\"<br />\ntheir views.<br />\n(Continued on Page 2, Col. 6)<br />\nPresentation Delayed<br /><br />\nFAGIN CALLS U. S.<br />\nDRAMATISTS BEST<br /><br />\nf According to the original plans<br />\nI the committee, the signatures<br />\niere to have been presented directt0 the President and the Board<br />\nTrustees at their scheduled<br />\neetiug on Monday, January 8. Dr.<br />\nAdolescent males on the West<br />\nillness, however, made this<br />\nwhere the price of a hair-cut<br />\nCoast,<br />\n'Possible, it was stated.<br />\nis 65 cents, may be expected to take<br />\non the appearance of a cross be.1, Results of the poll taken by tween the inmates of the House of<br />\nt• 4E NEWS-LETTER On the ques- David and an international conven1°11 of student activity fees are tion of concert pianists, but here at<br />\n4S fOilowS:<br />\nthe Hopkins, on the East Coast,<br />\nPor abolition of the fee<br />\n32 their heads are more likely to rePor modification of the fee 5 semble billiard balls.<br />\nPor retention of the fee<br />\n18<br />\nSuch appears to be the probable<br />\noutcome of the recent tonsorial<br />\ncraze that has struck many of the<br />\nHopkins students, like the great<br />\nhurricane of last August, and left<br />\nthem denuded of their cranial foliTobAy—Complete editorial staff age. It was probably as a result of<br />\nfleeting, NEWS-LETTER.<br />\nthis craze that the glistening dome<br />\nLiberal Club meeting, 1 p. m.,<br />\nof the barber pole in front of John<br />\nLevering.<br />\nshop in the basement of<br />\nLusco's<br />\nbasketball game with Loyola<br />\nat Evergreen tonight.<br />\nLevering Hall was decapitated and<br />\nGraduate Student - Faculty removed, perhaps to be used as a<br />\nbance, Levering, 9 p. m.<br />\nmodel for the \"bald eagle\" tonsure.<br />\nTh<br />\n°1vroRRow — Swimming meet,<br />\nCuba!! Cannon<br />\niliopkins vs. Manhattan ColFor the domes of the newly',_ege, K. of C. Pool.<br />\nsheared<br />\nstudents do glisten. The latWrestling meet, Hopkins vs.<br />\nest member to be admitted to the<br />\nGallaudet.<br />\nCotillion Dance, The Towns- exclusive club is Burt Cannon, the<br />\n'nen playing.<br />\nman whose name will probably go<br />\ndown in Hopkins history as \"Baldy<br /><br />\nBurt Cannon, Resembling<br />\nEx-Convict,Joins “Bald Eagle\"<br /><br />\nThe Week<br /><br />\nN rws.Erttrr I<br />\nANY<br /><br />\ni<br /><br />\nof Dome\". For, resembling an exconvict rather than an exclusive,<br />\nBurt provided such a sight last Saturday as to completely enthrall the<br />\nhundred-odd students in the dormitory and set them roaring with glee.<br />\nAnd that was only his first-night<br />\naudience.<br />\nAce Of Spades Bad Luck<br /><br />\nAs to how this business came<br />\nabout, the answer is that Burt Cannon lost his locks upon the turn of<br />\na card. It was a high-finance gamble, between Burt and John Canning, for the high card, with the<br />\nother man's hair as the prize. Cannon drew the Ace of Spades, and<br />\nrazors were brought into play on<br />\nCannon's head. A cup was placed<br />\non the top of his skull, and all the<br />\nsurrounding hair removed. Then<br />\nthis topknot was shaped to a triangle, and the picture was complete.<br />\nBut Burt disapproved of his resemblance to a Hottentot, and later<br />\nremoved the remaining tuft.<br />\nMany a person has lost his shirt<br />\non a gamble, but Burt Cannon has<br />\nthe distinguished honor of being<br />\nthe only one ever to lose his hair.<br /><br />\nGrad Student Frolic Tonight To Feature Routson's Orchestra<br /><br />\nGRADUATE STUDENTS<br />\nDANCE TONIGHT 1<br />\nAT LEVERING HALL<br /><br />\nPrice, 5 Cents<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, JANUARY 19, 1934<br /><br />\n11 01. XXXVIII—No. 25.<br /><br />\n15 UNDERGRAOS<br />\nPeSASK FOR TOTAL<br />\nEPEAL OF FEES<br /><br />\n4v<br /><br />\nDean Calls Activity<br />\nSituation \"Lousy Deal\"<br />\nFor Undergraduate Body<br /><br />\nThe second graduate students'<br />\ndance of the season will take place<br />\ntonight in Levering Hall. Walter<br />\nRoutson's orchestra will furnish the<br />\nmusic.<br />\nThe affair will be chaperoned by<br />\nStern Cites $600 Hullabaloo<br />\nDr. and Mrs. M. L. Huggins, Dr.<br />\nFunds Grafted Last<br />\nand Mrs. J. L. Mayer, Dr. and Mrs.<br />\nYear<br />\nJ. C. Hubbard, Dr. and Mrs. F. D.<br />\nMurnaghan,Dr. and Mrs J E.kAhl\"RAKE-OFFS\" ARE<br />\nberg, and Mr. and Mrs. R. N. Expressing dissatisfaction with REVEALED BY PROBE<br />\nDempster. Dean Berry is expected the students' usage of the reserve<br />\nto be present also.<br />\ndesk, Miss Alice Lanier asked for<br />\nArrangements were completed student cooperation. In line with Iddins Quotes Budget Figures In Reply To<br />\nby the committee, which consisted of this request, a set of rules have been<br />\nHeaney's Criticism<br />\nCharles Berry, chairman; Bob composed by Dr. John C. French,<br />\nBarnett, Miss Mary Phillips, Miss librarian, governing the use of reOpenly admitting that the stuWinifred Norem, Wallace Parks, served books.<br />\ndents have been given what he charand Archie Mahon.<br />\nRules Given<br />\nacterized as a \"lousy deal\" on their<br />\nDancing will be from nine till one.<br />\nThe rules are as follows:<br />\nThe admission is one dollar per. I. All books are to be signed for activities cards, and offering in excouple.<br />\nwhenever taken from the reserve. planation the defense that this was,<br />\n2. A book charged for use in the however, the only course open to the<br />\nreading room may be used in that University administration, Dean E.<br />\nroom for two hours, unless in great W. Berry yesterday appeared bedemand. In that case the time-limit fore the weekly assembly to answer<br />\nquestions concerning recently alwill be one hour.<br />\n3. Books may be borrowed for leged misadministration of activities<br />\nWillen, Brecher Go South; home use in accordance with the funds.<br />\nYoung And Bang On<br />\nIn an effort to reply to the numerwishes of the instructor. OrdinarNorthern Trip<br />\nily a book may be taken at 4 p. m. ous criticisms which have been diif not in use at that hour and re- rected by THE NEWS-LETTER, 0.<br />\nAnnouncing the complete debat- turned not later than 9:30<br />\na. m. the D. K., the Blue Jay and other caming schedule for the season, which next day. Certain<br />\nbooks may be bor- pus activities and personalities<br />\nincludes the universities that are to rowed for three days;<br />\ncertain others against the administration of the<br />\nbe met on the two circuits of the for one week. In some College<br />\nfor fees derived through the issuance<br />\nyear, Dr. C. P. Lyons, debating Teachers courses books<br />\nborrowed of the Student Activity cards, the<br />\ncoach, made public the names of for overnight use will be<br />\ndue on the regular underclass assembly was this<br />\nthose who are to take these trips.<br />\nweek converted into an open forum,<br />\nafternoon of the next day.<br />\nThe Debating Council will be<br />\nat<br />\nwhich Dean E. W. Berry, Theo4. It has been found impracticrepresented by Abner Willen, Waldore<br />\nStern, president of the Stuable to reserve books for individter Brecher, and one other man, on<br />\ndent Activities Council; Mr. Henry<br />\n(Continued on Page 3, Col. 6)<br />\nthe southern trip, which will inIddins, business manager of athclude debates with the University of<br />\nletics, and Dr. Ray Van Orman, diVirginia, the University of North Evidence OfSight<br />\nrector of athletics, gave an account<br />\nCarolina, Washington and Lee, and<br />\nFound In New-Born of the confused state of affairs arisothers. The questions that are to<br />\ning from the graft of past years, the<br />\nbe debated are \"Resolved: That the<br />\nDefinite evidence that new-born closing of the Union Trust ComPrinciples of Industrial Control as babies can see was announced after pany (in which the University<br />\nFound in the N. R. A. Should Be a series of tests conducted by Dr. funds were deposited), and the inContinued Beyond the Two-Year W. C. Beasley, instructor in psy- ability to thereby satisfy the dePeriod\", and \"Resolved: That the chology at the Hopkins.<br />\nmands of creditors of the activities.<br />\nPowers of the President Be ExWorking in the nursery of the<br />\nRake-Offs Hit<br />\ntended, As A Settled Policy of the Johns Hopkins Hospital, Dr. BeasAs explained by the Dean, the<br />\nley gave 829 tests to 142 negro in- opening of<br />\nUnited States.\"<br />\nthe year found the UniNorthern Trip<br />\nfants. All the subjects were be- versity activities faced with<br />\na deficit<br />\nThe northern trip will be taken tween the ages of two and one-half of $4,000, that immediately affected<br />\ncare of by Jack Young and Fred- hours and twelve days.<br />\nthe good name of the University and<br />\nerik Bang, with the possible addiTested With Light<br />\nthe activities involved. Those credtion of one more, who is not picked<br />\nA small flash light with the bulb itors who granted a liberal discount<br />\nas yet. They will debate, among shielded by tissue paper, was moved were paid at once, the Dean said;<br />\nother universities, the University of in an arc before the eyes of every those who refused to<br />\nmake any conPennsylvania and Columbia. Prince- infant. In each instance, the cession were paid 60 per cent of the<br />\nton is tentative. Beside the same child's eyes followed the light. amount due. Payment of these<br />\nbills<br />\nquestions as the southern trip, they When the bulb got beyond the range were made out of this year's activiwill debate the question \"Resolved: of the eyes, the baby turned its ties fees. What<br />\nremained was apThat the State Be Made Responsi- head toward the light. The same portioned to the activities. The reble for Medical Aid.\"<br />\nkinds of tests were given with col- cent reopening of the Union Trust<br />\nSouthern Trip—<br />\nored rods substituted for the light, Company has released some of the<br />\nFeb. 24—Univ. of •Richmond<br />\nand the same results were obtained. School's funds which the adminisFeb. 26—Duke University<br />\nA motion picture camera took tration expects to reappropriate next<br />\nFeb. 27—Univ. of North Carolina pictures of the eye-movements of month.<br />\nFeb. 28—Washington and Lee<br />\nthe children. This was done through<br />\nIn reply to insistent demands for<br />\nMar. 1—Univ. of Virginia<br />\na telescope designed especially to<br />\n(Continued on Page 4, Col. 5)<br />\nNorthern Trip:<br />\nmagnify the eyes of the subjects.<br />\nFeb. 21—Univ. of Pennsylvania<br />\nWide Differences Noted<br />\n\"Blue Jay\"Plans New BoyFeb. 22—New York University<br />\nA wide range of visual and racial<br />\ncott Attack; More VioFeb. 26—Columbia University<br />\ndifferences were noticed among the<br />\nlent In Character<br />\nFeb. 27—Fordham University<br />\nbabies. The vision, as well as the<br />\nFeb. 28—Princeton University, tengeneral physical condition of negro<br />\nAccording to reports received<br />\ntative.<br />\ninfants was found to be superior to from a reliable source, THE<br />\nHome Debates:<br />\nthat of white children at birth.<br />\nNEWS-LETTER has learned the<br />\nMar. 9—Washington and Lee<br />\nnext issue of the Blue Jay will<br />\nMar. 13—University of Florida<br />\nTownsmen Again Appear carry a renewed and more vioMar. 23—Univ. of Pennsylvania<br />\nlent attack upon those activities<br />\nAt Cotillion Tomorrow<br />\nApr. 6—Univ. of Vermont<br />\nviolating the agreement incurred<br />\nGoucher, University of Maryland,<br />\nDancing at Levering Hall this<br />\nby the Student Activities Card<br />\nand the University of Pittsburgh Saturday night will be to the<br />\nthan that launched at the time of<br />\nhave as yet not agreed upon the date, strains of the Townsmen Orchesthe last appearance of the ubliit was announced by Richter H. tra. This band has proved to be<br />\ncation.<br />\nWiggall, Business Manager.<br />\nthe most popular group of musiIt is understood the next as-<br /><br />\nNew Rules Adopted<br />\nFor Library<br />\nBooks<br /><br />\nDEBATERS LINE UP<br />\nROAD ENGAGEMENTS<br /><br />\nPresident Recovering<br />\nPresident Ames, who has been<br />\nconfined to bed at the Johns Hopkins Hospital since Monday, January 8th, is expected to return to<br />\nhis home, 2 Charlcote Place, either<br />\ntoday or tomorrow. He will probably return to the University about<br />\nthe middle of next week if his improvement continues.<br /><br />\ncians playing for the weekly<br />\ndances.<br />\nAlthough many special events<br />\nhave been planned in connection<br />\nwith the affair, the board announced that there will be no increase in price. Tickets may be<br />\nobtained for eighty cents per<br />\ncouple, if purchased from the<br />\nCotillion Board members before<br />\nSaturday evening.<br /><br />\nsault of the University periodical<br />\nwill be directed especially against<br />\nthe Hullabaloo, this action being<br />\ntaken in consequence of a recent<br />\narticle in THE NEWS-LETTER, in<br />\nwhich Theodore S. Stern, the editor of the yearbook, was interpreted by the Blue Jay as having scouted the idea of the effectiveness of the boycott policy<br />\nproposed by that organ.<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 19, 1934<br /><br />\n2<br /><br />\nUbe Ilevos-Aetter<br />\nFOUND= 1897<br /><br />\nSubscription per year _ _____<br />\n____$2.00<br />\n---------------------------------------$250<br />\nBy Mail<br />\nRemit subscription fees to John Myers, treasurer, Student Activities<br />\nCouncil, Gilman Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nin Baltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins University.<br />\nMember of The Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States and of The National College Press Association.<br />\nOffice Phone<br />\nEditor's home phone<br /><br />\nUNiversity 7383<br />\nLIberty 1714<br /><br />\nBusiness communications should be addressed to the Business Manager, Johns Hopkins University. All articles and communications pertaining to the editorial department should be forwarded to the Editor<br />\nin-Chief, Johns Hopkins University.<br />\nBUSINESS DEPARTMENT<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-chief<br />\nBusiness Manager<br />\nNorman S. Heaney<br />\nManaging Editors<br />\nEdgar S. Blumster'n<br />\nMartin Perlmutter<br />\nMillard Langfeld<br />\nAssistant Managing Editors<br />\nAdvertising Manager<br />\nRichard Feise<br />\nRay Goldberg<br />\nStanley Blumberg<br />\nJunior Editor<br />\nMelvin Goldberg<br />\nCirculation Manager<br />\nAdvisory Editor<br />\nCharles Hastings<br />\nHyman Levin<br />\nExchange and Filing Edtor<br />\nOffice Manager<br />\nIrving Leberfeld<br />\nSports Editor<br />\nBert Gordon<br />\nLeonard Wallenstein<br />\nReporters<br />\nIrvin Blum, Harold Kantrow,<br />\nNeal Potter, Carson Frailey, SidBert Prager, Allen Delevett,<br />\nney Levy, Fred Bang, A. EdelGeorge Paver, David Levy,<br />\nman, Carl Hartman, John Lyman, Alexander Batlin<br />\nLeonard Harris.<br /><br />\nFriday, January 19, 1934<br /><br />\nThey've Cooked Up An Excuse<br />\nThe explanations anent the athletic department's policy for next year which the pressure of<br />\nstudent protest has elicited from Coach Van Orman have left us with a feeling of dissatisfaction.<br />\nIt's a feeling much akin to that experienced by an<br />\narmy which has besieged a city for months and,<br />\nupon finally breaking through, discovered that the<br />\nenemy has decamped with all the spoil. These<br />\nathletics boys are slippery and elusive; but there's<br />\nsome consolation in the fact that we scared them<br />\ninto showing their real hand.<br />\nThe hand is this: they have to be continually<br />\nridden by the students before they can be depended upon to do their jobs efficiently. One of<br />\nthe members of the Athletic Council, a high University official, said a very significant thing when<br />\nhe recommended to the 0. D. K. committee, which<br />\nrecently protested before the Council that the<br />\ncaptains and managers of the teams were the logical ones to complain when the coach and financial<br />\nmanager neglected to supply enough equipment<br />\nand coaching talent. It seems to show the attitude<br />\nof the authorities — that continual prodding is<br />\nthe only way to secure decent treatment from the<br />\nathletic department.<br /><br />\nBut It's Strikingly Flimsy<br />\nBut though the officials have escaped the terrain which we beseiged they have very naively<br />\nleft themselves in open ground and entirely defenseless before some of our more important<br />\ncharges. They spiel off glibly that so many uniforms have been ordered here, so much money<br />\nappropriated there, that necessary economies forced<br />\nthe dropping of Mallonee as assistant coach. But<br />\nwe want to know why the money wasn't spent before? The money was available last year and yet<br />\nit wasn't spent. How do we know that the same<br />\nthing won't happen next year? Is it an indication<br />\nof competence on the part of an athletic administration which has to be dragged by the nose to do<br />\nthe obvious? We believe emphatically that it is<br />\nnot. The squirming of the department under the<br />\ncross-fire which has afflicted it for the past three<br />\nweeks is to us too much of an admission of guilt.<br />\nIts almost frenzied efforts to prove that it is doing what is needful have left us skeptical of its<br />\npower of self-motivation after the pressure is<br />\nremoved. The clam-like nature of its attitude toward every decent question we ask is becoming<br />\nIt is not apparent that there is any need for<br />\neconomies such as were introduced last year,<br />\nnamely, the cutting of Mallonee and of training<br />\ntable. Particularly when nearly $500 of the appropriation was not spent and when we are supporting a coach on a vastly disproportionate salary.<br />\nJust what sort of reasoning, we wonder, does the<br />\nathletic department think we follow? The gaping<br />\nholes in its defense would accomodate the coachand-four of the old adage.<br /><br />\nSo It Won't Do<br />\nSo far, gentlemen, you haven't come across<br />\nwith anything that amounts to anything. We'll<br />\nhave to insist on more concrete evidence of good<br />\nintentions. If we don't get it now we may never<br />\nget it, because there's no assurance that there will<br />\nalways be the freedom of criticism which we experience at present nor the coincidence of cit cumstances which makes this a particularly appropriate time to demand an accounting.<br /><br />\nSoothing Prospect<br />\nWriting editorials on campus problems, if we<br />\nmay dignify our brawls as such, engenders a sort of<br />\nsour outlook on the goodness of humanity as an applied principle. But we see some redeeming feature;<br />\nat least somebody concurs with our ideas of good<br />\nsense. And who should it be but the freshman?<br />\nMotivated by some hitherto unfelt stimulus the<br />\nfrosh have decided that it's well to lock to the<br />\nfuture, and so have decided that they will bolter<br />\nup their treasury so that when they reach seniorhood (that Valhalla of intellectual embryos—just<br />\nask a senior), the class dues will be within reason.<br />\nIt's a wise move to plan the frosh-soph dance; the<br />\nrewards will come later.<br />\nAdditional evidence of good sense is the effort<br />\nto interject some semblance of coherence and direction to the annual banquet season fighting.<br />\nLast year we suggested an organized flag rush,<br /><br />\nbut a pants rush is just as good and probably<br />\nmore interesting. There are some freshmen,<br />\nnames given on request, whose souls would be<br />\nmaterially benefitted by a little workout after the<br />\npants-rush detail is accomplished.<br /><br />\nAh9<br /><br />\nRats!<br /><br />\nWalt Disney's Pied Piper of Hamlin has nothing on Baltimore's local rat survey. However,<br />\nin the modern version of Browning's immortal<br />\ntale, only a small percentage of Baltimore's rats<br />\nare captured; and, as far as the Hopkins is concerned, the countless rodent denizens of the University<br />\ncontinue to gambol on the green in complete<br />\nsecurity.<br />\nAs an example of the small scale upon which<br />\nthe hunting operations by the United States Quarantine Station at Curtis Bay are carried on in<br />\nBaltimore, only 300 rats were caught on a recent<br />\npeak day of the campaign now under way. But<br />\nin the face of this Dr. H. F. White, director of the<br />\nsurvey, has declared that \"The showing thus far<br />\nis very gratifying and demonstrates quite expert<br />\ntrapping by men with no experience.\"<br />\nNevertheless, even though the scope of the survey's operations be increased, the rats of our campus will undoubtedly remain unmolested. With<br />\nthis prospect in view, the suggestion has been<br />\nmade that the National Student League insert a<br />\nplank in their platform demanding a governmental<br />\nboard to execute an \"anti-rat\" movement, perhaps<br />\nsimilar to that now in use in France, where the<br />\nParis police are directing a drive against rats.<br />\nThere the Prefecture maintains a special service<br />\nof \"deratization,\" which has been especially active<br />\nduring the past year, having carried out anti-rat<br />\noffensives in 1,015 places in Paris and the suburbs.<br />\nBut something must indeed be done here, for<br />\nrats abound on the campus. They are especially<br />\nnumerous around Gilman Hall, and a student recently reported seeing one the size of a full-grown<br />\nmuskrat, strolling across the road at the south end<br />\nof the automobile tunnel. And they abound around the<br />\noutside of Alumni Memorial Hall—\"Great rats, small<br />\nrats, lean rats, scrawny rats, brown rats, black rats,<br />\ngray rats, tawny rats, grave old plodders, gay<br />\nyoung friskers, fathers, mothers, uncles, cousins,<br />\ncocking tails and pricking whiskers, and families<br />\nby tens and dozens.\"<br /><br />\nCampus Brevities<br />\nUntil activities stop charging prices above the<br />\nS. A. C. fee for their wares, they will have all the<br />\n\"indignant mothers\" writing to THE NEWS-LETTER.<br />\nThe staff has to write something, but don't give<br />\nthem a chance to write stuff like that again.<br />\no—o<br />\na big thrill the other night<br />\nboys<br />\nhad<br />\nDormitory<br />\nwhen a car careened several times across Charles<br />\nStreet then hit a light pole. The hardest thing to find<br />\nwas somebody to take the injured man to the<br />\nhospital. Twenty men, five cars, and no good<br />\nSamaritan.<br />\no—o<br />\nEditor Phil Hamburger has started paying for<br />\nthe Blue Jay in buttons off his suits. THE NEWSLETTER is inclined to hope that the Jay editor<br />\nwon't further impair his sartorial perfection.<br />\n0-0<br /><br />\nThe Crimson White tells us of a certain professor at 'Wisconsin State College who recommends the old institution of cramming, because it<br />\nrepresents concentration of the highest order. He<br />\nfurther asserts that modern psychologists believe<br />\nknowledge gained more rapidly will be retained<br />\nlonger.<br />\nBecause the management evidently thinks that<br />\nthe Hopkins man will want to see his own picture<br />\nat any .cost, the Hullabaloo will probably be sold<br />\nfor two dollars extra.<br /><br />\nLetters To The Editor<br />\nEditor, THE NEWS-LETTER:<br />\nSir: According to Theodore Stern, president of<br />\nthe S. A. C., and editor of the Hullabaloo, the stu<br />\ndents will not receive a copy of the yearbook unless they make an extra payment. This, despite<br />\nthe fact that the S. A. C. card signed by Stern in<br />\nhis official capacity says that the holder of the<br />\ncard is to get, among other things, a copy of the<br />\nHullabaloo \"without further charge\". That was<br />\nthe legal agreement and is now being flagrantly<br />\nviolated.<br />\nIf it is true, as has been said, that the extra<br />\npayment is necessary because of funds frozen in<br />\nthe Union Trust Company, then why were not plans<br />\nlaid accordingly before the money was collected<br />\nfrom students at the beginning of this year? The<br />\nbank was closed in October; yet the Student Activities Council collected the ten dollars per student<br />\nand Stern signed each card, promising them something which, it is now claimed, cannot be supplied.<br />\nIf our extra-curricular organization leaders did not<br />\nknow how much money would be needed, then<br />\nthey are guilty of gross inefficiency; and if they<br />\nknew that they would be short money and yet<br />\nwent ahead with the selling of the compulsory<br />\nactivities cards, they are guilty of taking'money<br />\nunder false pretenses.<br />\nAnyone who criticises is immediately<br />\nsquelched by being asked for his method of unsnarling the tangle. I doubt whether I can suggest a satisfactory solution, partly because I am<br />\nunacquainted with the complexities of S. A. C.<br />\nfinances.<br />\nThe Activities Council got themselves in the<br />\nmess; let them extricate themselves without crying<br />\nto the school for sympathy and attempting to<br />\ncover over their mistake by an extra levy on the<br />\nstudent body.<br />\nS. R.<br /><br />\nU. S. Dramatid(<br />\nPlaced First By DI<br />\nLEADING college newspapers 31 conscientious objectors and receditorially supported ten Ohio State ommended that only 15 of the stuDr. N. B. Fagin<br />\nUniversity undergraduates threat- dents be exempted. In a letter adConscientious Objectors<br /><br />\nened with expulsion for conscientiously objecting to compulsory military training, flaying the university's president for his action and<br />\nlauding the students' firm stand.<br />\nAmong the publications which<br />\nbacked the Ohio State objectors<br />\nwere The Daily Illini and the Daily<br />\nWisconsin, both of which declared<br />\nthat \"these men merit the highest<br />\nrespect of every college student in<br />\nAmerica\" and praised them \"for<br />\nstanding pat on their principles\",<br />\neven though faced by strong odds<br />\nagainst them.<br /><br />\ndressed to the other 16 students, the<br />\ncommittee declared itself to be \"unable to find that the reasons for your<br />\napplication grew out of conscientious objection.\"<br />\nThe local Scripps-Howard paper,<br />\nin its editorial on the dispute,<br />\npointed out that the real question<br />\nhad to do with \"the basis of the committee's differentiation between the<br />\ntwo groups\" and added that \"one of<br />\nthe rejected students declares he<br />\nchallenges any one to find any real<br />\ndifference between his position and<br />\nthat of two friends whose 'exemption was approved.\"<br /><br />\nTHE Daily Wisconsin charged<br />\nPresident Rightmire, of Ohio, with<br />\nimpeding social and intellectual progress.<br />\nSimilarly the Daily Illini ended<br />\nits comment with this statement:<br />\n\"They (the objecting students) have<br />\nthat particular quality that can be<br />\nMen of<br />\ndescribed only as guts.<br />\nOhio, we hail you!\"<br /><br />\nOTHER considerations which<br />\narise are also enumerated by the<br />\ncity paper. The first, it points out,<br />\nis \"that any committee member or<br />\nadministrative official who tries to<br />\ninterpret or evaluate another man's<br />\nconscience is undertaking a difficult,<br />\nif not impossible, task.\"<br />\nSecondly, it is remarked, that to<br />\ntreat the stand of these men lightly<br />\nor to assume without thorongh inTHE trouble started when a com- vestigation that they are merely trymittee, appointed by the president ing 'to get out of drill' by a subterof Ohio State, heard the pleas of fuge would be a mistake—especially<br />\nsince one faculty member has characterized them as \"of the highest<br />\ntype of boys on the campus, students who know where they stand<br />\nand why.\"<br /><br />\nPolitics At Yale<br />\n(Reprinted from \"The Nation\")<br /><br />\nTHE students of Yale University are<br />\nbeing introduced to public affairs by<br />\nway of the picket line and a policeman's<br />\nclub, and at least some of them do not<br />\nat all like what they find. Lawrence<br />\nHill and William Gordon, members of<br />\nthe Yale chapter of the National Student League, were arrested during the<br />\nfirst part of December for standing in<br />\nthe picket line during the Kirschner<br />\nfoundry strike in New Haven.<br />\nImmediately after the arrests the Yale<br />\nDaily News gave the matter wide publicity, and two groups of students were<br />\norganized to protest to the Mayor. The<br />\nfirst group was refused admittance. The<br />\nsecond was permitted to send a delegation of three as spokesmen to His Honor,<br />\nwhereupon they were harangued with a<br />\nblast against communism. A large number of students attempted to be present<br />\nat the trials, but the police cleared the<br />\ncourtroom of everyone not directly connected with the cases.<br />\nIT IS POINTED out by persons interested in the controversy that many<br />\nof the students taking part in the various<br />\nprotests had never demonstrated in anything but a football rally before. The<br />\narrests, moreover, followed not only the<br />\npicketing but articles in the Yale Daily<br />\nNews describing conditions in the Kirschner plant. Dean Clarence Mendel is<br />\nquoted as saying: \"Yale college authorities are entirely out of sympathy with<br />\nthe interference of students in New<br />\nHaven affairs about which they are uninformed . . . The college will not<br />\nencourage the students in any extra-legal<br />\nattempts to determine the right or wrong<br />\nof any local problems.\"<br />\nSOMEBODY should inform the dean<br />\nthat picketing has been declared legal by<br />\nno less a tribunal than the Supreme Court<br />\nof the United States; there was, therefore, nothing extra-legal in the action of<br />\nthe students, unless it is illegal to print<br />\narticles describing conditions in a particular factory. If the articles are unfavorable and untrue, there are still libel<br />\nlaws to which the factory owners may<br />\nhave recourse. If they are true, there is<br />\nevery reason for college students to take<br />\nan interest in them and in strikes generally.<br />\nThere is something most unseemly in<br />\nthe attitude of a college ocer who deliberately opposes, and attempts to persuade the undergraduates in his charge to<br />\noppose, student criticism of local industrial conditions. Yale is doubtless offering courses in sociology and economics.<br />\nWhere is there a better place for a direct application of the theories taught in<br />\nthe classroom than in the town in which<br />\nthe college is situated?<br /><br />\nTHE third consideration is<br />\n\"whether any student gets much that<br />\nis worthwhile out of a course that<br />\nhe is forced to take against his will.\"<br />\nThe editorial ends by saying, \"A<br />\nyoung man who risks expulsion in<br />\nsuch a situation seems to us to enjoy a preponderance of evidence on<br />\nthe side of his sincerity.\"<br /><br />\nin<br /><br />\n(Continued from Page 1, Col. 2<br />\nsuperior ability in the creation<br />\nwomen characters. The best exa Gat<br />\nple of this skill is Mrs. Phelps<br />\nthe Silver Cord, a play which<br />\ntempts to explain the \"mother co<br />\nplex\" in terms of modern psych 2N]<br />\nogy.<br />\nWinning the least praise fr<br />\nDr. Fagin was the well-known Gec<br />\nauthor of Dinner At Eight, Of Th<br />\nI Sing, Let'Em Eat Cake, and of<br />\nwell-known Broadway successes<br />\nGeorge S. Kaufman. Kaufman vs<br />\nrated not as a playwright, but as<br />\n\"play doctor\", as a person \"who<br />\nup other people's plays to suit<br />\ntastes of Broadway theatregoe<br />\nMr. Kaufman's chief work<br />\nbeen done in collaboration<br />\nothers, and Dr. Fagin maintai<br />\nthat \"no truly creative artist<br />\ncollaborate with someone else.<br />\nvery act indicates a certain amo<br />\nof detachment.\"<br />\nCrothers Plays To Public<br /><br />\nRachel Crothers was briefly ni<br />\ntioned as a good writer of li<br />\ncomedy who \"caters to the pu<br />\nmind. Miss Crothers' plays al<br />\ntouch upon some vital social pr<br />\nlem, but in her answers to th<br />\nproblems she always compromi.<br />\nher own beliefs in order to m<br />\ntam n the approval of her middle cl<br />\naudience.\"<br />\nThe last playwright discussed<br />\nthe speaker was John Howard L3<br />\nson, \"who is not very popular but<br />\nwell known among the radi<br />\nLawson has discarded the corn'<br />\ntional old love story and in P<br />\ncessional has attempted to capt<br />\nthe tempo and spread out the<br />\npanorama of American life.\"<br />\nFollowing the lecture, a co<br />\nskit, Seesaw, by Diana Rogge,<br />\npresented. The only part in the PI<br />\nwas acted by Mrs. Singewald 2<br />\ndirected by Myra Lehr.—S. LO<br /><br />\nYes, but only zirrow can<br />\nshape a collar.<br />\n•A truism of no mean proportion. Arrow,<br />\nmaker of two billion collars, naturally knows<br />\nmore about cutting and styling a<br />\ncollar than anyone else in the<br />\nworld. Only Arrow shirts have<br />\nArrow collars. Try \"Trump\"$195<br /><br />\nLook for this Label<br /><br />\nSANFORIZED SHRUNK<br /><br />\nnew dant if one ma- shrinks<br /><br />\nBuy Your Arrow Shirts and Collars from<br /><br />\nF. C. FOSSETT &amp; SON<br />\n311 E. BALTIMORE STREET<br />\nJOHN L. WHITNEY<br />\nCAlvert 04.84<br /><br />\n3<br /><br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 19, 1934<br /><br />\nisJOHNNIE QUINT<br />\nY1DEFEATS JAYS<br />\n;131' 26-21 SCORE<br /><br />\nTau Alpha Phi Clinches I<br />\nFirst Place In Bowl1<br />\ning Tourney<br />\nr<br /><br />\nLUE JAYS CLASH LEVIN CONDEMNS<br />\nITH GREYHOUNDS N. S. F. A. POSITION<br />\n°MORROW NIGHT ON CENSORSHIP<br /><br />\nDrs. Bergland And Hartman Speak Before Birth<br />\nControl Group<br /><br />\nDR. FRENCH GIVES<br />\nLIBRARY RULINGS<br /><br />\nDr. John McFarland Bergland, Heavy Fines Set On Overdue Reserved Books;<br />\nacting obstetrician-in-chief of the<br />\nRules Explained<br />\nBody Of Campus Leaders Johns Hopkins Medical School, and<br />\non<br />\nRejected Columbia UniDr. Carl Hartman, of the Johns (Continued from Page 1, Col. 5)<br />\nex Game Is Sixth Consecutive<br />\nMotion<br />\nversity<br />\nHopkins University, and the Car- ual students. First come, first<br />\nLoss For The Black<br />\nlps<br />\nnegie Institution in Washington, served!<br />\nAnd Blue<br />\nch<br />\nTHEM AS<br />\nDESCRIBES<br />\n5. For a home-use book not re7 CO<br />\nwere among the speakers at a closed<br />\nturned<br />\non time a fine is imposed of<br />\nMIND<br />\nRED<br />\nMOSS-COVE<br />\nTCh 2ND PERIOD RALLY<br />\nsession on birth control held Tues- 25 cents for the first hour and 5<br />\nOVERCOMES JAYS<br />\nFaculty Censorship Of Col- day in Washington as a forerunner cents for each hour thereafter.<br />\nfr<br />\nof the hearing Thursday before the Fines cannot be charged to caution<br />\nlege Paper Psychologitr George Margolis Is High<br />\nHouse Judiciary Committee on the money and no further loans can be<br />\nPoint Scorer For The<br />\nically Unsound<br />\nmade while fines remain unpaid.<br />\nPierce birth control bill.<br />\nHopkins Five<br />\not<br />\nThe<br />\nattendant in charge is not auRejection of Columbia Univer!sse<br />\nTuesday's session was the first of<br />\nthorized<br />\nto suspend or alter this regMarking its sixth consecutive<br />\nan<br />\nsity's motion for the favoring of a three-day program featuring naulation.<br />\nHopkins<br />\nthe<br />\nit as. defeat of the season,<br />\na free college press, unhampered by tionally known figures in the birth<br />\n6. Books can be borrowed over<br />\nbasketball team lost to St. John's<br />\nto College Wednesday night 26-21<br />\nfaculty censorship, by the National control movement, organized by the the week-end, unless they be in great<br />\naft at Annapolis.<br />\nStudent Federation at its recent National Committee on Federal demand.<br />\n;oe The game in many respects<br />\n7. No further loan can be made,<br />\nconvention in Washington, was Legislation for Birth Control. The<br />\nwas similar to that played by the<br />\na fine is owed to the desk.<br />\nwhile<br />\ncharacterized today by Hyman Le- conference is the first of its nature<br />\nn Jays against Washington ColInstructor<br />\nDetermines Rules<br />\n15-8<br />\nscore of<br />\natai lege. Leading by a<br />\nvin, president of the Intercollegiate to be called in the National Capital,<br />\nover the Johnnies at half time,<br />\nfor required<br />\nassigned<br />\n\"Books<br />\nst Hopkins was overcome in the<br />\nNewspaper Association of the Mid- and it has more than 500 persons, reading are reserved at the desk<br />\ne. second period by the fast pace of<br />\ndle Atlantic States, as a \"decided in official, educational, welfare, med- under such restrictions as the inano the Annapoltons. The same thing<br />\nstep backward in the march toward ical, and sociological circles for structor concerned thinks proper,\"<br />\noccurred against the \"Shoremen.\"<br />\nButterworth, McClure, McCarsocial and intellectual progress.\"<br />\nsponsors. Among these are: Dr. said Dr. French. \"The rules have<br />\ntee, Donahue and Kilmore<br />\n\"Faculty censorship of the col- Henry Emerson Fosdick, Christo- been designed to protect every stuy 111<br />\nProved a smooth working comdent from thoughtlessness on the<br />\nEIi bination for the Johnnies. Howlege press is not only contrary to pher Morley, Kermit Roosevelt,<br />\npart of the reader.\"<br />\nTeam<br />\nHas Strong<br />\nPti ever it was not until the second<br />\nAmerican ideals of free speech and Samuel Untermeyer, Hendrik WilIn commenting to a NEWS-LETalw Period when Hopkins shifted its<br />\nLoyola has a strong team, having free press but is also psychologically<br />\nTER<br />\nreporter, Miss Lanier said that<br />\nlem<br />\nAmelia<br />\nLoon,<br />\nEarhart<br />\nand<br />\nVan<br />\nini<br />\npr lineup to include at center<br />\nour veterans forming the nucleus and educationally unsound,\" Levin<br />\n1<br />\nheavy fines have been imposed<br />\n\"the<br />\nwho had been<br />\nKelly<br />\nstead<br />\nof<br />\nPutnam.<br />\n) th<br />\nf the club—Lunak, forward and declared today. \"Freedom is as necPivoting for the Jays, that Butin order to emphasize the demand,<br />\n•omi terworth started his scoring<br />\nrather than to increase the library's<br />\nrack shot of the squad; Rehkopf, essary to the college newspaper as it<br />\nmai Spree which sent St. John's into<br />\nBasketball<br />\nOfficials<br />\nfunds.\"<br />\nTaneyhill,<br />\nle Cl the lead. The Johnny center was lays Look To Win At The 'forward; Colvin, guard;<br />\nis to the large metropolitan daily<br />\nMay Have New Signal<br />\nPoorly guarded by the Jays and<br />\nenter. The other guard position is paper. It is this freedom, made posKnights Of Colum&gt;sed Proceeded to score two baskets<br />\ntilled by Carney, a freshman, who sible two hundred years ago when Holding Up Arm With Distinctive Dr. Healy Addresses<br />\nbus Pool<br />\nand two foul shots in quick orCharles Carroll Club<br />\nI La der.<br />\nBand Indicates Team For<br />\ni as excited no little comment among John Peter Zenger won his stirring<br />\nr bu During the first period Hop- Inaugurating its current cam- 1basketball fans in the few appearThrow-In<br />\nbattle against the English throne<br />\n(Continued from Page 4, Col. 3)<br />\nadia<br />\nseemed to have everything mign tomorrow against the ManThis will prob- which tried him for libel, that has<br />\nmade.<br />\nhas<br />\nhe<br />\nances<br />\nsaid<br />\nthat all the later objections to<br />\nguarding<br />\nIts<br />\nWell<br />\ncontrol.<br />\nBasketball officials may soon have<br />\nunder<br />\n:onv<br />\niattan College swimming team, at . ly be the starting team for Loyola.<br />\nWas<br />\nexpected<br />\nas<br />\nbe<br />\ncould<br />\nas<br />\ngood<br />\ncan be found in PorChristianity<br />\nn P<br />\nplaced the newspaper in the fore as a new way to signal which team deteams,<br />\nand<br />\n°f<br />\nany<br />\nleague<br />\nof<br />\nthe<br />\nthe<br />\npool,<br />\nColumbus<br />\n'<br />\nof<br />\nKnights<br />\nhe<br />\nceris<br />\nit<br />\npyry.<br />\nCriticism<br />\nof the Scriptures<br />\nwriting,<br />\nAt the time of<br />\nrapt<br />\na leading institution and as a leader serves possession- of the ball out of<br />\nthe Jays were making good their iopkins natators will be out to re17th century,<br />\nthe<br />\nin<br />\nstarted<br />\nagain<br />\ntain that if Captain Camitta and in the thinking of the American bounds.<br />\n°Pportunities at the foul line, and<br />\nand the history of this criticism is<br />\n)eat their victory of two years ago, George Margolis do not appear on<br />\nWhile on the offense.<br />\npublic.<br />\nSeveral<br />\nthe<br />\ncolleges,<br />\nincluding<br />\nactually the history of philosophy.<br />\nThe play of George Margolis n which the Jays triumphed over<br />\nhe starting line-up of the St. John's<br />\nButts Of Justified Criticism<br />\nNaval Academy, have had officials<br />\nIn condemning the old beliefs that<br />\nWas outstanding for Hopkins,<br />\nhe New Yorkers by one point.<br />\ngame, they will be on the floor when<br />\n\"The National Student Federa- wear a white sleeve on one arm and Christianity had its origins in the<br />\nhe p Particularly when Hopkins had<br />\nThe Hopkins squad has shown up he starting whistle blows Saturday. tion convention, composed largely of<br />\nLid 3 Possession of the ball. In addition<br />\na black sleeve on the other. When other religions, of antiquity, Dr.<br />\nLE the Jay guard made a perfect .specially well in practice, and gives Don Kelly will be at his forward student council heads, in most cases the ball goes out of bounds, instead Healy declared that Christianity actually brought several entirely new<br />\nrecord on foul shots during the n-omise of developing into the position, with Siverd and Reynolds themselves the butt of justified ediof verbally announcing the team en- things: freedom of conscience, war<br />\nfirst half scoring five points in ;trongest aggregation that has ever probably filling the other vacancies. torial criticism, must have been atwill be tended by moss-covered minds titled to possession, the referee against slavery, and the exaltation<br />\nfive attempts.<br />\n-epresented the University in swim- Chancellor, Mann and Siegal<br />\nSwerd and Seigle started the ning. They are meeting a worthy in reserve. - Unless Camitta and which failed to comprehend the sig- would signal by holding up the of the position of women. As far<br />\nMargolis are in the line-up Wednes- nificance and importance of free- sleeve with the color assigned to as the liturgies are concerned, he<br />\ngame for Hopkins at forward<br />\nManhattan, however, and day night against St. John's, their dom of the college press. Their re- that team. The idea is to do away said, they can rather be traced to<br />\nin<br />\noe<br />\ncenter<br />\nat<br />\nPosts, with Don Kelly<br />\nand Margolis and Reynolds play- they will have to extend themselves appearance with the team Saturday fusal to stand by this freedom and with confusion which often occurs the Jewish synagogues than to the<br />\nold Oriental mysteries.<br />\nwill mark the first contest in which to encourage it is a decided step over possession of the ball.<br />\ning the guards. This quintet :0 repeat their 1932 triumph.<br />\nits<br />\nsomarch<br />\ntoward<br />\nby<br />\nthe<br />\nin<br />\nbackward<br />\nrepresented<br />\nfunctioned well till almost the<br />\nbeen<br />\nOpponent<br />\nhas<br />\nHopkins<br />\nMurray Strong<br />\nteam, and the outcome will cial and intellectual progress.\"<br />\ncomplete<br />\nend of the first period when<br />\nby<br />\nled<br />\nis<br />\nteam<br />\nThe Manhattan<br />\nAttacking faculty censorship, Leshow the strength of this year's<br />\nCoach Darley withdrew Seigel<br />\nCaptain Murray, who almost caused<br />\nvin asserted that every college pawho had three fouls against his<br />\ngroup.<br />\nlast<br />\ntheir<br />\nin<br />\ndownfall<br />\nJay's<br />\nBlue<br />\nthe<br />\nGood<br />\nCards<br />\nA.<br />\nA.<br />\nrecord, from the game.<br />\nper should have the inalienable right<br />\ndoubt<br />\nto<br />\nas<br />\nsome<br />\nis<br />\nmeeting.<br />\nThere<br />\nIn order to avoid the confusion to express itself editorially as it<br />\nAt this point Chancellor entered the fray and continued to whether Murray, a sprint man, has that resulted at one of last year's wishes, provided the opinions exCalvert Room Suits and<br />\nPlay during the first ten minutes graduated or not, but should he games with Loyola, this game is pressed remain within the canons of<br />\nTopcoats,<br />\nNow $17.50<br />\nof the second period. Siegal was :ompete against Hopkins, he will Hopkins' home contest, And Athlet- decency, propriety, and truth, and<br />\nagain thrust into the line-up and face the stellar Blue Jay dash men ic Association cards are good. How- should in no case be obliged to beever, the next game with Loyola, on come a mere \"house organ\", bound<br />\nthe beginning five began to get<br />\nof holding their<br />\nFebruary 17, will be their home to shout 'hallelujah' over the evi°n its feet again but it was too who are capable<br />\nopposition.<br />\nall<br />\nalmost<br />\nagainst<br />\nDwn<br />\ngame, and A. A. cards will not ad- dent shortcomings of the institu26-21.<br />\nlate and the game ended,<br />\nmeet,<br />\nManhattan<br />\nthe<br />\nA<br />\nafter<br />\nweek<br />\ntion.\"<br />\nmit the bearer.<br />\nHopkins scored six baskets in<br />\n211 - 213 E. Baltimore Street<br />\nEditors Should Control<br />\nthirty-six attempts while St. the Hopkins natators will encounter<br />\na<br />\nJohn's counted eight in forty- the Williani and Mary team at the Marksmen Gain Fourth<br />\n\"It is the belief of the I. N. A.<br />\n,<br />\nnational<br />\nEpsilon,<br />\nDelta<br />\neight tries.<br />\nPi<br />\nthe<br />\nand<br />\nVictory Of Season<br />\nlatter's pool. The Black and Blue<br />\nhonorary college journalism fraterwithout<br />\ncontest<br />\nthis<br />\nshould take<br />\nPlue Jay Mat Team<br />\nThe University Rifle Club gained nity, that student editors should be<br />\nmuch difficuty, as the Virginians usWrestles Gallaudet ually present a very weak squad. its fourth victory of the season last given full control, with strict acweek when it defeated the Univer- countability as college students and<br />\nHopkins<br />\nLine-Up<br />\nlooking<br />\nBlue Jay wrestlers are<br />\nsity of Princeton team in a postal as American citizens for the exerfnrward to their meet with GallauThe line-up against Manhattan:<br />\nmatch by the score of 1370-1278. cise of that control. That, by far,<br />\n(let Saturday for their first win of<br />\nMatches were also held with Kan- is far superior to faculty censor50 yards—Levi, Bahlke<br />\nne season. The Jays defeated the<br />\nsas University and the Alabama R. ship.\"<br />\n100 yards—White, Levi<br />\nLw ashington team last year. After<br />\n0. T. C., but the results of these<br />\n440 yards—Adler<br />\n'laving remained idle for one week,<br />\nhave not been computed as yet.<br />\n150-yard backstroke — MacGill, This week the varsity squad will<br />\nLie<br />\nSquad will be in fine mettle to<br />\nNoonan<br />\nLake over the fairly strong team of<br />\nengage in mail contests with Univer200-yard breastroke—Capt. Sadt- sity of Pittsburgh, New York Milthe opposition. Outstanding men<br />\n°4 the squad are Captain Phil Hartitary Academy, Valley Forge Miller, Hazlett<br />\n,an, McDaniels, and Bourne, al4.111<br />\nitary Academy, and M. I. T. The<br />\nDive—McConnell<br />\n.̀:t°ugh Stolberg and Mitchell are Relay — Adler, Levi, White, R. 0. T. C. last week lost to the<br />\nleveloping real ability.<br />\n'<br />\nNew York University R. 0. T. C.<br />\nJones, or Bahlke.<br />\nbe:<br />\nWrestling for Hopkins will<br />\nby the score of 1397-1349.<br />\nChick Merson, 118 lbs.; Miller or<br />\nelber, 126 lbs.; Captain Phil HartPhone Belmont 7908<br />\na, 135 lbs.; Stolberg or Waters,<br />\nPrinters of<br />\nPhilological and Scientific<br />\n45 lbs.; McDaniels, 155 lbs.;<br />\n'<br />\nBIRELY'S<br />\nPublications<br />\nBALTIMORE, MD.<br />\nl<br />\n1\\/1itche<br />\nI@ 11<br />\nl, 165 lbs.; Connor, 175 lbs.;<br />\nPHARMACY<br />\nBALTIMORE<br />\nPL.<br />\n12-20<br />\nHOPKINS<br />\n(311rne, heavyweight.<br />\n•The only thing on which<br />\nPrivate Rooms and Banquet Halls<br />\n—<br />\nST. PAUL at 33RD STREET<br />\nand touts have ever<br />\ndeacons<br />\nfor All Occasions<br />\n.• S •<br />\nYour Neighborhood Drug Store<br />\nagreed—because it's jamCuisine and Furnishings<br />\npacked with belly-laughs and<br />\nPeabody Pharmacy<br />\nPRESCRIPTIONS<br />\n-raisers for every man<br />\nbrow<br />\nUnexcelled<br />\nCALVERT and 30TH STS.<br />\nSchool Supplies, Candy, Cigars<br />\nof every type and taste!<br />\n—<br />\nFLORISTS<br />\nDECORATORS<br />\nPhu in Quality — First in<br />\nMembers, F. T. D Asso., Inc.<br />\n1484<br />\nUnexcelled Fountain Service<br />\nService<br />\nAutos Garaged<br />\nRooms,$3.00 up<br />\nd \"0 dehvery4,..........=<br />\nMake Our Store Your Store<br />\n0573<br />\nVEr.<br />\nST.<br />\nN.<br />\n1918<br />\nCHARLES<br />\n.<br />\nmal12t2a<br />\nWinning three games yesterday<br />\nfternoon, the Tau Alpha Phi FraTo Be Scene Of<br />\nmmity clinched the title in the first 3 vergreen<br />\nSkilled<br />\nContest;<br />\nLoyola<br />\nalf of the Interfraternity bowling<br />\nPlay Due<br />\n3urney.<br />\nBeta Theta Pi, and Phi Pi each , . A. CARDS WILL<br />\nion three games yesterday, too,<br />\nBE GOOD AT GATE<br />\nThile Phi Gamma Delta won one<br />\n3 s Strength Test Of The<br />\name.<br />\nComplete Hopkins<br />\nOutstanding in Tau Alpha Phi's<br />\nTeam<br />\nictory were Hammerbacher, Kern,<br />\nlager and Corkran. The final<br />\nBy A. EDELMAN<br />\nlanding in the first half is as folHopkins's fourth league game of<br />\n)ws:<br />\nthe season gets under way tomor4 1 ow night when the Blue Jays meet<br />\n1. Tau Alpha Phi 26 5<br />\n2. Beta Theta Phi25<br />\nthe Loyola Greyhounds at Ever10<br />\n20<br />\n3. Phi Psi<br />\n€ reen.<br />\n4. Phi Gamma<br />\nWith the renewal of football re10<br />\n20<br />\nDelta<br />\n1ations with Loyola, a great deal of<br />\nA second round of the tourney<br />\npirit has been evinced in connecviii start next week and the winner<br />\ntion with future athletic relations<br />\nIf this half will meet the first half<br />\n1between the Jay and Greyhound<br />\nvinner in a post-tourney series for<br />\n(ontingents, and this contest bodes<br />\na, cup which is to be awarded.<br />\n1 ell to be a \"good\" one, and a sellut at the gate.<br /><br />\nionaNs NATAToRs(<br />\nwEET MANHATTAN,rum<br />\niERE TOMORROW ,<br /><br />\nAll Ready for Service Suits,<br />\nOvercoats and Topcoats<br /><br />\nKATZ<br />\nCLOTHES<br /><br />\n4<br /><br />\n0F F<br /><br />\nTHE EMERSON HOTEL<br /><br />\nL<br /><br />\nJ. H. FURST CO.<br /><br />\nJ. A. RITTER &amp; SON, INC.<br /><br />\nNi<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 19, 1934<br /><br />\n4<br /><br />\nSAYS LIVING TODAY Prodigal Son Returns, Unfolds<br />\nMORE FASCINATING Sunny And Not-So-Sunny South<br />\nTHAN IN PAST ERA Dr. Mitchell Describes To Classes Beauty Of Southern<br />\nSherwood Eddy, Noted Author, Addresses Combined Meeting<br />\nAddressing a combined meeting<br />\nof the Y. M. C. A. cabinet and the<br />\nFreshman Commission on Tuesday<br />\nnight, Sherwood Eddy, lecturer and<br />\nauthor, stated that \"Liberty without<br />\njustice and justice without liberty<br />\nare not good enough.\"<br />\nHe believed that while it might<br />\nhave been fascinating to live during the Italian Renaissance, the<br />\nFrench Revolution, the American<br />\nRevolution, or the Russian Revolution, it is far more interesting to be<br />\nalive today when a stupenduous<br />\ntransition is taking place also.<br />\nNew Epoch<br /><br />\nThe new epoch which students<br />\nwill help bring about Mr. Eddy expected to embody Greek culture, Roman law and order, Hebrew moral<br />\nand spiritual insight, scientific<br />\nachievement for the production of<br />\na material basis of life for all, and a<br />\nsocial movement for justice and the<br />\nmore universal sharing of privilege.<br />\nFrom this point of view, the<br />\nspeaker commented on both the<br />\nRussian and the American experiments. He expressed a disinclination to live under the Soviets because of its denial of liberty, its<br />\nviolence and compulsion involving<br />\nperpetual revolution and a restriction of emigration, and its dogmatic<br />\natheism. At the same time he admitted that an attempt to abolish unemployment, injustice, and poverty<br />\nwere \"amazingly good things.\"<br />\nUnderdog Helped<br /><br />\nWith regard to the NRA and the<br />\nAAA, Mr. Eddy believed that the<br />\nRoosevelt program was out to help<br />\nthe underdog. A large number of<br />\noutspoken senators with whom he<br />\nhad chatted believed the President<br />\nwould eventually be driven to the<br />\nleft, he said.<br /><br />\nAlready<br />\nACTIVITIES CALLED N.C.AtCollege<br />\nFootball Practicivoi.<br />\nSCIENCE<br />\n'LOUSY DEAL' DURING Winter football drills have<br />\nready begun at North Carolina State<br />\nHow, by the use of the electric STUDENT ASSEMBLY College. Eighty candidates greetec<br /><br />\nCities; Sees New Orleans Capitol As<br />\nA \"Long\" Affair<br /><br />\neye, a tune could be played on a<br />\nxylophone by a person some dis- Graft In Hullabaloo In Past<br />\nYears Cited; Meeting<br />\ntance away, was demonstrated reIs Continued<br />\ncently by Dr. Phillips Thomas in an<br />\nAfter an absence of several weeks decorated. Conspicuous among its<br />\naddress before the Middle Atlantic<br />\nDr. Mitchell has returned.<br />\nOn trappings is a placque of Huey, his<br />\n(Continued from Page 1, Col. 6)<br />\nTuesday, in characteristic fashion, \"bulbous nose\" included, and \"a Conference of Building Owners<br />\nfurther information, as to the alhe launched into the new monetary monument to bad taste,\" according and Managers in Baltimore.<br />\nleged<br />\ntheft or mismanagement of acaccomplished<br />\nby<br />\nmeans<br />\nThis<br />\nwas<br />\ndevelopments along the Roosevelt to Dr. Mitchell.<br />\ntivities<br />\nfunds in the past, Theodore<br />\nof<br />\na<br />\ngrid<br />\nglow<br />\ntube<br />\nattached<br />\nto<br />\neach<br />\nfront.<br />\nEverything considered, especially<br />\nStern,<br />\neditor-in-chief<br />\nof the Hulnote<br />\nand<br />\nothers<br />\nattached<br />\nto<br />\ncomAt nine-thirty he enthusiastically the gross neglect of the most neceslabaloo,<br />\nadmitted<br />\nthat<br />\n$600 of the<br />\naccombinations<br />\nfor<br />\nchords<br />\nof<br />\nthe<br />\ngave the boys a picture of New Or- sary functions of the government,<br />\nfunds<br />\nfor<br />\nappropriated<br />\nthat publidarkened,<br />\nleans, Birmingham, Knoxville and which is sadly \"broke\", it seemed panist. With the room<br />\ncation<br />\nlast<br />\nyear<br />\nare<br />\nstill<br />\nunaccounted<br />\nincomprehensible to the economist two flashlights are focused on the<br />\nother places along the route.<br />\nfor.<br />\nDean Berry further added<br />\nThe first, he assured them, did not how so much money can be spent on tubes, the light in one hand playing<br />\nthat<br />\nafter<br />\nmismanagement of funds<br />\ncontain as his friends had always \"tobacco-spitting politicians and so a tune and that in the left hand furtook<br />\nplace<br />\nwith regard to a \"certain<br />\nled him to believe, a comparatively much \"sacrificed for deluxe quar- nishing the accompaniment.<br />\npublication\" an investigation re0-0<br />\nsmall French district but literally ters of legislators.\"<br />\nvealed that certain persons had reFor nearly nine months, Dr.<br />\nmiles and miles of old house, covceived a \"rake-off\" when contracts<br />\nAdolph Meyer, Henry Phipps proered with stucco, discolored by the Dr. Healy Says Church<br />\nwent through for particular adverdampness, and encircled by balcon- In Rome HadSituation fessor of psychiatry at the Johns<br />\ntisers<br />\nand printers.<br />\nies. For, he explained, \"A balHopkins Medical School, has had<br />\nSimilar<br />\nTo<br />\nPresent<br />\nOne<br />\nPetty Graft Admittedunder examination the brain of<br />\ncony is to one of those houses as a<br />\nZangara,<br />\nassassin<br />\nof<br />\nnavel is to a man.\"<br />\nGuiseppe<br />\nA<br />\ngreat<br />\ndeal of criticism also<br />\nAssembling for the first time since<br />\nChicago.<br />\nMayor<br />\nAnton<br />\nCermak,<br />\nof<br />\nThese balconies are supported by their return from the Christmas vagreeted Stern's admission that even<br />\niron rods propped up on the inev- cation, the members of the Carroll<br />\nCross pollination of pears has an today \"petty graft is still going on.<br />\nitable flag stones. Some of the roofs Club heard an address in Levering effect on the shape of the fruit, but<br />\nWhen I sign a requisition for<br />\nare covered with colored Welsh Hall last Sunday by Dr. Patrick this is due to the increase in the<br />\nstamps, I can't be absolutely sure<br />\nslate, brought over as ballast. The Healy, professor of Church History number of seeds produced rather<br />\nthat<br />\nit is going for stamps and for<br />\nmoisture makes for very luxuriant at the Catholic University in Wash- than the effect of pollen on the fruit<br />\nnothing else.\"<br />\nvegetation, especially in the court- ington, entitled \"The Church in the itself.<br />\nyards. In short, New Orleans Roman Empire\".<br />\n0-0<br />\nDespite this, Dean Berry praised<br />\nA \"fog camera\" which harnesses the present Student Activities<br />\nstruck Dr. Mitchell as \"a city of roThe situation of the Church then<br />\nmance.\"<br />\nwas not very different from that the infra-red ray and is designed Council for the best managed counThe only unbelievable thing about of today, Dr. Healy pointed out, to extend the limit of visibility ot<br />\ncil in years.<br />\nit, he thought, was the state capitol. and the first attacks on the Christi- the navigator has been installed for<br />\nThe situation, however, has now<br />\nIt cost $5,000,000. Huey Long is ans resulted, as far as we know, the first time on the S. S. Manhattan,<br />\nof<br />\nthe<br />\nUnited<br />\nbeen<br />\ncorrected, the Dean explained,<br />\nStates<br />\nLines.<br />\nresponsible. Every part of the from economic matters. Later they<br />\nThe camera is the invention of by the present ruling that all paybuilding seemed especially made, were charged with obstinacy, rethe state flower, the state bird, and sistance against the Roman state, Flavel M. Williams, master mariner ments must now be made by check<br />\nthe brass elevator doors. Above all and atheism, in that they did not and former naval officer. The in- instead of the old method of paythere were also lots of trick devices believe in the regular Roman gods. strument records on a specially ment in cash by each activity.<br />\nCelsus And Porphyry<br />\ntreated infra-red ray film strip fogin the governor's office which inCompulsory Fees<br />\ntrigued Dr. Mitchell very much. In the second and third centuries, hidden objects ahead of a ship. It<br />\nObjections to making the activity<br />\nAmong these is a radio which com- continued Dr. Healy, there were two also develops and \"fixes\" the negafees compulsory were greeted with<br />\nmunicates the proceedings of the very important literary opponents tive in thirty seconds.<br />\nby Dr. Berry, who exsympathy<br />\nHouse and the Senate chambers of Christianity, the philosophers<br />\nBy pressing a button, which illubefore<br />\nthe depression set in<br />\nplained<br />\nPorphyry.<br />\nPophpyry,<br />\nhe<br />\nCelsus<br />\nand<br />\nand a miniature replica of voting<br />\nminates the negative, the navigator<br />\nbeing<br />\nprogress<br />\nwas<br />\nmade toward the<br />\nChrist<br />\nwas<br />\na<br />\nmachines in both houses in order said, contended that<br />\nof<br />\nthe<br />\nship<br />\nmay<br />\nsee<br />\nthe<br />\nnegative<br />\nin<br />\nabolition<br />\nof the fees.<br />\nof<br />\nreduction<br />\nthat His Excellency may know just good rabbi, whose deeds had been<br />\nthe<br />\nthe<br />\ncamera<br />\nthirty<br />\nseconds<br />\nafter<br />\nthat ache<br />\nbelieved<br />\nstated<br />\nthat<br />\nHe<br />\nsurrounded with legends, and it is<br />\nhow he is making out.<br />\nnot<br />\nself-supporttaken.<br />\ntivities<br />\nwhich<br />\nwere<br />\npicture has been<br />\n(Continued on Page 3, Col. 6)<br />\nThe Senate chamber is profusely<br /><br />\nHeartley (Hunk) Anderson, tli<br />\nnew head coach of the Wolfpack.<br />\nAnderson watched the squad lira<br />\nber up during most of the afternoon,<br />\nbut made clear his intent to intro'<br />\nduce the shift and other importan'<br />\nparts of the Rockne system befon<br />\nthe practice was owl-.<br />\n,Seco<br /><br />\ning should be done away with. Tli(<br />\nDean insisted, however, that the stv<br />\ndent activities fees belong to thePOI<br />\nUniversity and not to the student: y<br />\n—\"they belong to us and not t<br />\ndm<br />\nyou\", he said.<br />\nReplying to the criticisms direct'<br />\ned against the Athletic Department<br />\nby Norman Heaney, Mr. Henr)<br />\n001<br />\nIddins, business manager of the rche,<br />\nAthletic Department, quoted figuret0r th<br />\nto show that athletic receipts were\"1 b<br />\ngreatly reduced from those of pre'<br />\n10th.<br />\nvious years. Mr. Iddins also es:<br />\nsialic<br />\nplained the University was carryingscif f(<br />\na large deficit incurred by the athicr th<br />\nletic department and that the Prest'!he or<br />\ndent's office had recently requesteeltetunti<br />\nthe Board of Trustees to wipe ()PI'<br />\nnidwi<br />\nthis \"paper debt\".<br />\nEdward Sadtler, president of the<br />\nIn<br />\nStudent Council, announced that the<br />\nairing of the athletic and activities<br />\nsituations will be continued at next<br />\nweek's assembly.<br /><br />\nHEIDELBERG INN<br />\nFIRST CLASS RILSTALTRANT<br />\nDELICATZSSEN<br /><br />\n1111d<br /><br />\n2436-38 ST. PAUL STREET<br />\n25c Breakfast — 25c Lunch<br />\n50c Dinner<br />\n••...•••4/<br />\n•<br />\n\"'' ••41. .'•<br /><br />\n°r st<br /><br />\na1<br />\n(<br />\n.]<br />\n'<br /><br />\nICE SKATING<br />\niake<br />\n'<br />\nc<br />\nMornings, Saturdays, Holidays,<br />\n10-12:30 — Afternoons, 2:30 to5 -Evenings, 8:30 to 11.<br /><br />\nSPORTS<br /><br />\nI4'aY n<br /><br />\nThE<br /><br />\nCENTRE ei„,<br /><br />\neaves are used in<br />\nLUCKIES<br /><br />\nti<br />\ntootn<br />\n4to a<br />\näble<br /><br />\nkserv<br /><br />\nkkets<br />\nhese<br />\nrsor<br /><br />\nDor<br /><br />\nrida)<br />\nhirty<br />\nthe<br />\nLlso bi<br />\n[le N<br /><br />\nqz,<br /><br />\nRab<br />\ntan<br /><br />\nFortheie a/retheMilded<br />\nrOeftedfor<br />\na/nd<br />\n\"vr<br />\ned sindhly<br />\nWe buy only the center leaves for Luckies.<br />\nNot the top leaves for they are under-developed.-Not the bottom leaves for they are<br />\ninferior in quality. Only the center leaves<br />\nfor these are truly mild and fully ripe. And<br />\nthat's the fine tobacco we use —to make<br />\nLuckies so round, so firm, so fully packed<br />\n—free from loose ends that spill out. That's<br />\nwhy Luckies are always mild,always truly<br />\nmild. And remember, \"It's toasted\"—<br />\nfor throat protection—for finer taste.<br /><br />\nLucky Strike presents the Metropolitan Opera Company<br />\nSaturday at 2 P. M., Eastern<br />\nStandard Time, over Red and<br />\nBlue Networks of NBC, Lucky<br /><br />\nStrike presents the Metropolitan<br />\nOpera Company in the complete<br />\nOpera, \"DON GIOVANNI\".<br /><br />\nAlways the Finest Tobacco and only the Center Leaves<br />\nCopyright, 1934, The American Tobacco Compivay.<br /><br />\news ;<br /><br />\norro<br />\nf<br />\nAt •<br />\n• C.<br />\nazar(<br /><br />\nour c<br /><br />\nrn,<br />\nrid R<br />\nThe<br />\nrig of<br /><br />\net, b<br /><br />\nqurn<br /><br />\nbserv<br /><br />"}], "field_media_file": [{"target_id": 38796, "display": null, "description": null, "target_type": "file", "target_uuid": "8259502a-d1ed-450e-be75-00d1bdcf82c7", "url": "http://digital.library.jhu.edu/system/files/2022-03/12473-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12473, "target_type": "node", "target_uuid": "e4a145e7-8066-416f-b3fd-3d02f4ebcc73", "url": "/node/12473"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bc9fa621-81ec-46eb-80fc-1524a44fb306"}]}