{"mid": [{"value": 37431}], "uuid": [{"value": "9772dfc1-cc6d-48a5-b85e-cad0d02b72aa"}], "vid": [{"value": 37431}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13350-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MUSICAL CLUB WILL<br />\nGIVE TWO CONCERTS<br />\nto<br />\n<br />\nEaston<br />\nTo Take Trip<br />\nand Salisbury<br />\nTO LEAVE WEDNESDAY<br />\nClub Plans Other Trips<br />\nLater in Season<br />\nThe Musical Club will give two<br />\nconcerts during the Christmas holidays, one at Easton and another at<br />\nSalisbury.<br />\nOn Wednesday, December 26, the<br />\nmembers'of the club (approximately<br />\nseventy, strong) will set out<br />\nfrom the barn by bus for Easton,<br />\nMd., which is.located on the Eastern<br />\nShore. That night they will give a<br />\nConcert -at the Easton High School<br />\nunder the auspices of the Easton<br />\nHigh—School Senior Class. This<br />\nconcert will be followed by a dance<br />\nat the Easton Armory.'<br />\n<br />\nSENIOR CLASS DUES<br />\nPAYABLE JAN. 7-11<br />\nSenior class dues will be collected during the week of January 7, immediately following<br />\nthe Christmas recess. Treasurer Medenbach,will be at the<br />\nHullabaloo office on the second floor of the \"Barn\" on<br />\nthese days between 12:30 and<br />\n1:00 P. M, to receive payments from seniors. Dues are<br />\ntwenty-nine dollars and checks<br />\nshould be made payable to M.<br />\nH. Medenbach.<br />\n<br />\nHOPKINS QUINT .<br />\nDEFEATS INDIANS<br />\n<br />\nFENCE MYSTERY SOLVED'BY<br />\nNEWS-LETTER REPORTER<br />\nThen what seemed to be a true<br />\nAt last the great mystery has been<br />\nsolved. For weeks, the question of solution was offered. The fence had<br />\nwhy the board fence has been erect- been built to keep the engineers<br />\ned around \"the site of the new Lev- from learning more about construcering Hall\" has been the subject of tion than is taught in the echoing<br />\nlong discussions. In fac4212 was,ru- halls of the Mechanical Engineering<br />\nmored on good authority that the Building. Engineers, it was claimed,<br />\nyiolating the honor system by<br />\nmembers of the Debating Council<br />\nhave spent many sleepless nights ldoking out of the windows of classdelving in ponderous tomes to get at rooms and transcribing the knowledge gained thereby to quiz papers.<br />\nthe root of the question.<br />\nThe first solution of the matter But this ingenious theory went the<br />\nwas the obvious one. Everyone im- way of all the others. The engineers<br />\nmediately believed that -Levering were,exonerated.<br />\nHall was to be completed behind the<br />\nNow conies the true solution. It<br />\nprotection of the barrier and then is so simple that it is difficult. The<br />\non April Fool's Day the fence was barricade is to keep trespassers from<br />\nto be torn down and the building stealing any of the machines used in<br />\nstand forth in all its splendor. But the process of construction. This<br />\nwe were soon disillusioned; such drastic step became necessary when<br />\nwas not the case.<br />\nthe foreman discovered one of his<br />\nThen a bright soul gave circula- men ,taking his'girl out for joy, rides<br />\ntion to another solution. The fence on one 'of the tractors.<br />\nhad been built to keep the cold<br />\nOur correspondent, after intenwinds, sweeping down from the<br />\nsive research, has calculated that<br />\nquadrangle, from striking the workthe cost of the fence approximately<br />\ners. A glass roof was to complete<br />\nequals the amount contributed to the<br />\ninclementhe<br />\nfrom<br />\nthe protection<br />\nFund by the undercies of the weather. But this theory, Levering Hall<br />\ngraduates.<br />\nin its turn, was soon exploded.<br />\n<br />\nSWIMMING TEAM TO<br />\nCONTINUE PRACTICE<br />\nThe swimming team will<br />\nhold regular practice during<br />\nthe Christmas holidays. The<br />\nteam will work out every Monday, Wednesday, and Friday<br />\nat 5.00 P.-M., at the Knight<br />\nof Columbus pool at Madison<br />\nand Cathedral Streets. Berause of the comparatively<br />\nslow start in reorganizing the<br />\nsport, it is absolutely necessary<br />\n—iil and team<br />\nthat all mant<br />\ncandidates be present at practice.<br />\n<br />\n'HOPKINS FIVE LOSES<br />\nTO TEMPLE OWLS<br />\n<br />\nDR. GOODNOW REPORTS TO<br />\nBOARD OF TRUSTEES<br />\n<br />\nTemple Snows Hopkins Under<br />\nin Second Half<br />\nLang Stars for Jays; Bonner Chid<br />\nScorer of Gams<br />\n<br />\nHopkins suffered its first defeat<br />\nof the current basketball season<br />\nwhen it lost to Ilmple University<br />\n38-21 in Philadelphia on ,yVednesday. The Jays had made an auspicious start by defeating Lafayette<br />\nand William and Mary on the Friday and Monday immediately preceding. This game marked the<br />\nfourth victory of,-the season for the<br />\nTemple five.<br />\n<br />\nHopkins played without, the service of Cene Debuskey, star center,<br />\nWinning Team la Superior in<br />\nReport Shows New Play Is<br />\nEvery Department<br />\nwhose cool, heady playing and sharp<br />\nProgressing<br />\nDEBUSKEY AGAIN STARS<br />\nSPEAKS OF MED. SCHOOL shooting' ire always prominent factors in the Blue Jay victories.<br />\nSinks Six Goals and One Foul<br />\nPresident Comments on<br />\nStude substituted for Debuskey in<br />\nShot for High Total<br />\nResearch Work<br />\nJourney to Salisbury<br />\n.<br />\nThe report of the'President of the the game against the Templemen.<br />\nOn the same night, after the Continuing the pace'they had set<br />\nUniversity which has just been reHopkins Spurts Early<br />\ndance, the group will 'proceed .to against Lafayette College, the Hopleased shows beyond doubt that the<br />\nHopkins started off with a rush<br />\n• SalisbUry,Irriying there very early kins quint defeated William and<br />\nNew Plan is now well on its way when Johnny Lang, star guard, who<br />\nthe next.day. Accommodations are Mary last Monday night. The score<br />\nto complete realization. Figures in- wat elected captain of this year's<br />\nbeing made so that the men will be of this game, which was the second<br />\ncluded by Dr. Goodnow in his re- tea& after the William and Mary<br />\nable to sleep during All of the day: of the season, was 38 to 22.<br />\nport show a decided decrease in the game, rang up three field goals.<br />\nIn the evening they will give a con- The contest was not `s6 fast as<br />\nnumber of students registered in the With Hopkins in the lead thus early<br />\ncert at the Fellowship Hall of the the Lafayette game and was featurUndergraduate department with a in the game, the Blue Jay continMethodist Church in Salisbury for ed by no especially brilliant, plays. Christmas Issue of<br />\ncorresponding increase in the Fac- gent was viewing the outcome of the<br />\nthe benefit of the Peninsula General the mode of attack being syStemat:c<br />\nJay Appears Today<br />\nulty of Philosophy.<br />\nencounter with somewhat victorHospital Fund. This concert, too,<br />\nConflict in Important Dates<br />\nThe Christmas issue of the Black<br />\nJays took tic<br />\nand methodical.<br />\nious eyes.<br />\nIt<br />\n, will 'be followed by a dance, which<br />\nis<br />\nnote<br />\nto<br />\nthat<br />\ninteresting<br />\nwith<br />\nDiscussed<br />\nand Blur Jay appears on the camwill be held in the ballroom of the long chances but attempted to carry pus today. This issue will be.smaller<br />\nTemple, however, was not long in<br />\nThe Student Activities Council the passage of laws by the last State<br />\nWicomico Hotel. It is also po:ssible the ball under the basket for .a sb it. than the first two of this year, but held their monthly meeting in the Legislature requiring the certificates coming back. Goals by Pearson,<br />\nthat the club Will broadcast a short The system was made More effective will be very compact. The smallness M. E. Hall last Tuesday. The meet- of all entering students in the State Bonner, and Feinberg of the Temprogram from the local radio sta- (lite to the advantage el both weight of the issue is due to the fact that ing was called to.oider by President by their high school principals the ple team put the Philadelphians in<br />\nnumber of new men has fallen off the -lead, and the half ended with<br />\n.tion, which is located at the hotel. and height held bv the Blue team. very little time has intervened be- Wood.<br />\nconsiderably, but a corresponding the home team leading 15-12.<br />\nAfter the ctiolo the club will leave<br />\nJay<br />\nthe<br />\nof<br />\nappearance<br />\nlast<br />\nthe<br />\ntween<br />\nBrown Hammond was elected to<br />\ntrr-get.rthe tip-off<br />\nfor Baltimore, arriving here very<br />\nand thep resent issue. The staff Is the Council representin,g'the Debat- betterment' in the ability of freshTemple Goss on Rampaye<br />\nttr the rebounds from the Isick<br />\n,arly the next morning.<br />\nnow up to date on its previously ing Council; replacing Oarland Her- men is expected by the President. - The second hali marked a scor,<br />\nboard, the lack Of size of the WiJ-- conceived time sChedule.<br />\nTwelve Dropped<br />\nsecond Trip<br />\ning spree for Temple. The Owls<br />\nshey.<br />\nThe new ruling adopted' by the ran up 23 points, at the same time<br />\nThis year is the -seccind time the ham and .Mary Indians proved mire<br />\nThe ten dollar prize for the best<br />\n,<br />\nIt was also moved and carried Academic Council providing that<br />\ntrip to Salisbury and Easton ha; evident.<br />\nholding the Jays to 9 points. Temcontribution appearing in the issue that Hammond be given the varsity<br />\nonly \"those students who had given ple put up a stiff defense that the<br />\nI een taken. I.ast year's visit was<br />\nC.<br />\nAlexander<br />\n,to<br />\nawarded<br />\nbeen<br />\nfor<br />\nhas<br />\nOw<br />\nrather<br />\nloose<br />\nPlztying a<br />\nHullabalon evidence by the character of their<br />\nthe<br />\nwork<br />\non<br />\nhis<br />\nfor<br />\nseal<br />\ntrip<br />\nthe<br />\nan(I<br />\napproval<br />\nmet with'much<br />\nBlue Jays were unable to get<br />\nWoods:' Jr., for an article entitled<br />\nwork that they should be encouraged through. The game was characterwas marked as both a social and a few moments after the elpening \"Several Lies.\" Woods' has been last year.<br />\n'se:.<br />\nsoon<br />\nfive<br />\nHopkins<br />\nto<br />\nyear's<br />\na<br />\nacquire<br />\nthe<br />\nliberal<br />\neducation\"<br />\nwhistle,<br />\nThen followed much discussion<br />\nfinancial success. rn fact, last<br />\nized by shots—Flom the outside.<br />\ncontributing regularly to the Jay<br />\nconcerts at these towns were consid7 tled down to business .and hegan under the signature \"A. C. W.\" on the meagreness of the allotment should be permitted to return at the Horst, long distance shot, sank two<br />\n(TO to have been the most success- their sCoring. The first *goal was Woods and Daniel Colemah Watson. of space in the ba'rn to vaiious ac- end of their second year of resi- goals from the center of floor. Hoptivities. Kolb complained that the dence resulted in the dropping of kins was unable to make its underful the Musical Club had ever given<br />\nhave contributel1 a number of poems<br />\nmade by the, Jay team, and<br />\nMusical Club, Barnstormers, Hulla- only twelve men.<br />\nII until that time.<br />\nthe-basket play effective and had t6<br />\nwere the victors in danger. Tlw to the issue.<br />\nbaloo and Band, had only one mall<br />\nSeventy-five men itt_the College resort to long shots. Temple put<br />\nMore Trips Later<br />\n.<br />\n\"Christstood<br />\ndefinite<br />\nhalf<br />\na<br />\nhas<br />\nThe issue<br />\nat the end of the<br />\noffice with which to carry on their of Arts and Sciences availed them- up an aggressive offense, but the\"<br />\nlater in the season thlusical score<br />\nfavor. In this masy\" touch, especially in the cover sarious managerial affairs. There selves of the opportunity of taking also scored mostly on outside shots,<br />\nto 10. in I<br />\nClub is planning to take several<br />\nDonald<br />\ndesign.. The cover is by<br />\nwere other complaints of the sort courses under the Faculty of Philos- (The prevalence of long shots is acother interesting trips in addition to period Debuskey accounted for<br />\nSharretts and depicts an Old English but it was decided to let things conophy most of whom were students counted for by the shortness of the<br />\nthe many other concerts scheduled eight of the points ho sinking four<br />\nShopping scene. The style of this tinue as were until the new Leverin their third and fourth years of Temple court, which is about onefur local performances. The firstof Ii uble-deckers front tilt:- floor, Thc<br />\ndrawing is different from any which ing Hall opens,<br />\nthird shorter than the Carlin's<br />\nresidence.<br />\nthese will lie the annual lielais.con- Indians fared a little better in the<br />\nIllue• Jay has ever used for a<br />\nthe<br />\ncourt.)<br />\ncert, which always proves to be<br />\nPresident Wood reported that the<br />\nMedical School<br />\nsecond half. when they rolled up cover design.<br />\nCouncil was in receipt of a message<br />\nReferring to the Medical School, The playing of Johnny Lang<br />\nquite successful. After this the<br />\nanother<br />\nThis number is divided among from Omicron Delta Kappa which Dr. Goodnow cOmments on the imtWeive points as • against<br />\nstood out for the Jays. He was<br />\ngroup is going- to take a trip to Port<br />\nnineteen 'count for the Black and jokes„ articles, poems,and advertts-. suggested that the secretary of the portance of the past year in the his- the high point.srorer of the Hopthe<br />\nbefore<br />\nperform<br />\nl!eposit and<br />\nthe same. Oro- Student Activities Council should<br />\napproximately<br />\nin<br />\nmg<br />\n•<br />\n•<br />\ntory of that institution.<br />\nBlue teatii.:<br />\nkins team, registering 8 points.<br />\nTome School boys. Then comes the<br />\nportion as the last two issues. There<br />\ncare of all conflicting notices of<br />\nPlans for the completion of the Horst, scoring 6 points on two field<br />\nWith the exception ,1 several are a number of humorous'poems take<br />\ntrip' into Western Maryland, which<br />\nform<br />\nmeetings. This was put in the<br />\nWilmer Ophthalmological Institute oats And two fouls, .ivas.the next<br />\nmimues 'in the first half when Ber- in the issue and the editors feel that<br />\n• Will include a concert at Hagerstown<br />\nof a motion and was carried. From were, completed and the building is highest point scorer or the Jays.<br />\nPa.sarew<br />\nfor<br />\nsubstituted'<br />\nwas<br />\nnard<br />\nthose who have been complaining of now on the secretary of the Council now in process of construction. Bonner, center of the Temple Uniand possibly one,at Wilson College.<br />\nLang: shifted to forward. Jung the lack of humor in the Jay will be will post all notices of meetings dt<br />\nPlans are now being considered for versity five, was the big star of the<br />\nThe last trip of'the season will be and<br />\nthe post office, while the sectetary a building to house the Department game. He led his team's<br />\nPasarew held down the forward appeased by this Concession.<br />\nattack by<br />\nthe one at. Lutherville, where the and<br />\nof the Athletic Board takes care of of Physiological Chemistry and will<br />\nIt was usually either of<br />\nwinging up 6 double-deckers and 3<br />\nclub will give a concert at the berths.<br />\nnotices.<br />\nathletic<br />\nall<br />\nfit in with the new Hunterian _Lab- fouls for a total of 15 pointi.<br />\nthese two who received the tip-off<br />\nMaryland College for Women.<br />\nBasketball Quint To<br />\nA conflict between the Hopkins- oratory to form a part of the Physifrom Debuskey, and thereby gave<br />\nComplete<br />\nArrangements<br />\nHave New Uniforms naryland basketball game and the ological and Anatomical Laborato- (Hopkins used seven men in the<br />\ndouble task.<br />\nE. Bennett Kolb, president of the the visiting team a<br />\nuniforms have been ordered Musical Club Home Concert was ries when they are rebuilt—in the game. The starting line-up consistNew<br />\n.ball from<br />\nthe<br />\nclub, bas'made a trip to Easton and They had to first get<br />\ned of Passarew, Jung, Stude, Lang<br />\nvarsity basketball team rail discovered. Both of these events course of the next few yea'is.<br />\nthe<br />\nfor<br />\nhad<br />\nthat<br />\ndoing<br />\nafter<br />\nSalisbury recently to complete the the Jays, and<br />\nand Horst. Bernard and Johnson,<br />\non Friday. FebNew Library •<br />\nplace<br />\nholitake<br />\nto<br />\nwere<br />\nthe<br />\nuse<br />\nafter<br />\nfor<br />\nready<br />\nbe<br />\nwill<br />\nball in for a scoring atOne of the most important addi- substitutes, also participated during<br />\narrangements for the club's per- to' work the<br />\ndays. Heretofore the team used ruary 22. The basketball game was<br />\ntions to the school is the completion the game.)<br />\nformance. He reports that the con- tempt.<br />\nof other gnore favored to.be held at Carlin's and the conuniforms<br />\nof the Welsh Medical Library, the<br />\nHorst at<br />\ntracts have been closed and that the The placing of Lang and<br />\nJays Rush for Train<br />\nsp-orts, their only new equipment cert at the Maryland Casualty au- opening of which is expected before<br />\nto provide<br />\nThe Jay basketball squad got in<br />\ndecided<br />\nwas<br />\nit<br />\ndistricts are looking forward to the guard positions proved<br />\nHowever,<br />\nwhite track pants and ditorium.<br />\nof<br />\nconsisting<br />\ncalendar<br />\nthe<br />\nof<br />\nnext<br />\nthe<br />\nbeginning<br />\nhelped.<br />\nvisit from the Hopkins men with for a strong defense which<br />\njerseys originally intended for the that some private agreement be- year. ,, All three brapches of the Philadelphia at 7:00 o'clock. The<br />\ngreatly in holding the Indians. Com- freshman team.<br />\ngreat exWtations.<br />\ntween Kolb and Eldridge should be present Medical Library including game started at 9 o'clock. The var-the close guarding<br />\nthose of the Hospital, School of sity game was preceded by a preThe progtns for the two con- bined, too, with<br />\nquintet will have made on the matter.<br />\nHaverford<br />\nThe<br />\nscoring power of the<br />\nHygiene and Public Health and liminary between the Temple Freshof<br />\nnumber<br />\nthe<br />\ncerts during he holidays will be in affecting the<br />\nlimiting<br />\nview<br />\nto<br />\nfirst<br />\nthe<br />\nfor<br />\nPlans<br />\nthe honor of being<br />\nSchool of Medicine will be housed<br />\nfive, was the<br />\nMary<br />\nand<br />\nat<br />\nWilliam<br />\nFriday<br />\nman team and the Frosh of Mt. St.<br />\nsimilar to that given last<br />\nthe new combination of royal blue varsity seals to be awarded during in the one new building.<br />\nteam'<br />\nlatter<br />\nthe<br />\nof<br />\ninability<br />\n-1141. The varsity game was finJose<br />\n• The Prince of Peace Church. The seeming<br />\nblue side strips oi the year were discussed, but none<br />\nroyal<br />\nand<br />\njerseys<br />\n.Research<br />\nTime after time the<br />\nished at 10:15 and then the Hopfront 01 adopted. However, the heads of<br />\nGlee Club, Banjo 'Club, Hawaiian to hit the net.<br />\nthe<br />\nAcross<br />\npants.<br />\na<br />\nblack<br />\ngives<br />\nDr.<br />\nIn<br />\nGoodnow<br />\naddition,<br />\nworked in for a shot with<br />\nTroupe, and Blue Jay Orchestra ball was<br />\nthe new jersey will be stitched large the activities were requested tn.use long list of research and investiga- kins courtmen had to rush for the<br />\nresult of a miss and the<br />\nusual<br />\nthere<br />\nthe<br />\naddition,<br />\nwill take a part. In<br />\nwhite letters forming the name of caution in nominating men for the tion carried on in all branches of the train, which was slated to leave at<br />\npossession of the Hopkins<br />\nUniversity. Research laboratories 11:00 o'clock. Taxis were chartered<br />\nwill be several solonumbers: Due ball in<br />\naward. The matter had been<br />\nour alma meter.<br />\nat the School of Medicine have pro- and a rush was made for the staof<br />\nmeeting<br />\nto the rain, the crowd at the last team.<br />\nlast<br />\nthe<br />\nat<br />\nup<br />\nThe freshmen will naturally come brought<br />\ngressed steadily thanks to the genhonors for high<br />\ntion. After being misdirected, the<br />\nconcert was disappointing, but it is Debuskey shared<br />\ninto their own with the addition of the Student Activities Council and erosity of various friends of the<br />\nSilverman<br />\nwith<br />\nfinally reached its car and then<br />\nteam<br />\nthe<br />\nwere<br />\nto-day<br />\nsuggested<br />\nsuch<br />\nplans<br />\nhave<br />\nmade<br />\nwho<br />\nthe<br />\nexpected that the halls in Easton individual scoring<br />\nUniversity<br />\njerseys<br />\nthe honor of wearing the<br />\neach rolling up a<br />\nwork possible by their financial aid. had ten minutes to wait.<br />\n. Salisbury will be crowded dur- of the opposition,<br />\na,t1.4<br />\nstring men. result of the last meeting.<br />\nfirst<br />\nby<br />\ngraced<br />\nformerly<br />\nContinued on page 2, Cot 4<br />\ning the concerts.<br />\n<br />\nACTIVITIES COUNCIL HOLDS<br />\nMONTHLY MEETING<br />\n<br />\ni<br />\n<br />\nPrice 5 Cents<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 21, 1928<br />\n<br />\nVol. XXXIII, No. 23<br />\n<br />\n\f21, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER<br />\nHOPKINS DEFEATS W. & M.<br />\nQUINT .<br />\nLNTER COLLEGIATE<br />\nPage 1. Col. 2<br />\nContinued p<br />\n1111MSBMUSMS<br />\nthirteen count. Each also shared in- NEWS<br />\nvidual honors in their flour games.<br />\nForms= MK<br />\nSilverman exercised a clever trick<br />\nIt stms to be the vogue now to<br />\nSUS<br />\ndouSubserirtice.<br />\n_ font agreements between the two_ of feinting a pass and then<br />\nhis<br />\ndeadly TivIA:. ealeges na order to in- bling around to dribble past<br />\nEntered as second-class matter December S. ISM, at the Postaitie<br />\nLight<br />\nBaltumore, Mc._ under io of Congress November S. 11119.<br />\nsUre the wier.3 of the University guard ior a. pot-sbot at the net.<br />\nLa- played a nice game. at guard, but<br />\nPublished tiessi-vreeky frolic October to Jake by the students of Johns onus. Lehigh University and<br />\nwork<br />\nHopkins University.<br />\nfayette College have _formed such orie 'which hardly equaled the<br />\nand Col- of the star forward.<br />\nTaie<br />\ny<br />\nSag,erehr‘...<br />\nBus-rem cossaratscatvcoss stootild be addressed to the Bra-Noss WAXACRR<br />\nlike<br />\nJokes Hcnksis Uarvennty. All arucles slimed be sent to the MaNstaass gate - are trying to come to a<br />\nDe-buskey's biggest threat was his<br />\nMarcia, otter crammaioatious to the Ehnits-mt-Cmair.<br />\nagree:rim:: othm• ccilkge are also characteristic m ner of eluding his<br />\nw•ing.Peñsaps Heck* and guard by a quick e step to take a<br />\ntr.:sweaty 0100<br />\nTelephoto<br />\n: John's could follow suit_<br />\ns successful.<br />\n-11c•-• Husually<br />\nIn the recently. published educashowed - up<br />\nLang<br />\nand<br />\nTasarew<br />\nEDfTOIRIAL DETA1111111INT<br />\ntional ,threctorr,lgs..-itten out by the<br />\nand helped by<br />\ngaine.S.<br />\ntheir<br />\nwell<br />\nin<br />\nBureau of Educan'on, Ccaumbiz<br />\nEdita-asi-Cluief<br />\n:ling. who hit the pet four times.<br />\nGOMM E. Rarrits, Ja..<br />\nUniversity is recognized as the litoffensive.<br />\nwiti- performed well on the<br />\ncountry<br />\nthe<br />\nin<br />\ntahlrersity<br />\nzest<br />\nMamartag<br />\nAsssstoat<br />\nEdits<br />\nNanasia,<br />\nLine-up:<br />\nGinmor Grxr,<br />\n35.410:,rietralicns M the student body<br />\nPUMP W. Nam \"SS<br />\ntf-illiain and Mary<br />\nPle-s of the factilt-_,<br />\nand 1.;30 cue,<br />\nHopkins<br />\n7<br />\n,<br />\nA stoma:, Edit4<br />\nSilverman<br />\nRiess= H Woos. \"211<br />\ncif the coliegei<br />\nF<br />\nThe stnall<br />\nPasarew<br />\nWampum H Demo.. '29<br />\nRoman, S &inc.. '3C<br />\nSauerbrtm<br />\nBuena Vista College_ with<br />\nButler<br />\n•<br />\nSdhsors<br />\ndents and 16 members of the facLight<br />\nW Pu,ott HAL :r31<br />\nulty.. Harvard, dating from 163.<br />\nPaesj t. Sarta... 'SO<br />\nE Foster TwireL'.<br />\nLworard B catty \"Mt<br />\nWinn<br />\nis the &deg Univery:. Vsiatr<br />\nG<br />\n71<br />\nHunt,<br />\nG<br />\nRurard<br />\nH Garland Hershey.<br />\nHarwood F Iturark. Jr :1<br />\nand Mary. 16P3; Yale, Vol. rank<br />\nPS.*e 111- Spew. -At<br />\nGordo. TO<br />\nirring<br />\nGerert H<br />\nsecond arid third among the ea•rlies:<br />\nc<br />\n!warn r,aude, ee<br />\nRobe, F<br />\nestablished colleges..<br />\nBaltimore Hotel Uses<br />\nBUSINESS DEP ART-KENT<br />\nPre-cline= in the<br />\nHopkins Copy For Ad<br />\nis<br />\nItiamnoss M anac<br />\ncollege Students and<br />\nre,;.<br />\nThe Southern<br />\nRust 0 Scatosi,<br />\nthat<br />\nSclioeils<br />\nthe<br />\n(ti<br />\nsiroation.<br />\nthe nu<br />\nto adversotti<br />\nHopkins.<br />\nof<br />\nports<br />\nThe<br />\nare:<br />\nthere<br />\nYaeger<br />\nCieciskstSow<br />\nhave been dekoied.<br />\nA evertising Masager<br />\nL ROBERT IITISS.<br />\nUnfvers-UT of Chicag -,, Nar•th t-z.r.- rise :7.f- cafeteria. The. advertiseGamma X Gtramx. '29<br />\nAdverb:Wit<br />\nSte!<br />\n1.:Lna_ Start College: Ce Tech. ment in questi...-5n discusses the vieGlint Stiol<br />\n• H Elms, 'N<br />\nTheodore A Fleishman ti<br />\nSesianee 1..-niversiry, Culver Nfiliof the freshmen over the sophGas Burke. 11<br />\nRandolph Rothe...Md. '7;<br />\ntGeoretH Robertoor. 7;<br />\nuiry. Acadmny and Unis-i•isit:i<br />\nLeroy Sur.: '51<br />\nclass rush.<br />\nin the<br />\nRare,:<br />\nS.tdrocy<br />\n:arntosat.<br />\nJobr A<br />\n3,1isouri. Rumors are that.<br />\nDavid S Sykes. 72<br />\npride of the freshmen<br />\nF Gana,'70<br />\nthe<br />\nf<br />\nspeaks<br />\nget<br />\ncivic_ Colgate_ Cornet'. and<br />\nin - their vict',ry, and ;,1 the strength<br />\n- are<br />\nFil:A..e,<br />\nStaff Photographer<br />\nWALTER Tt P.,-11E;DT, 31<br />\nf the intirl,ers -f the class. Good<br />\nTht<br />\n•<br />\nresp,nsilile for<br />\nT:7 Lht 77:2.<br />\nthe ttaC:<br />\n•urse. they sa-Produced by The Read-Taylor Gran nary. Lombard and Sorit<br />\nBaltimore.<br />\nth,<br />\n<br />\ntETTER<br />\n<br />\nr<br />\n<br />\nGift Suggestions<br />\nfor last-minute Shoppers<br />\n-- at the store for Men and Boys<br />\n<br />\n$5 to $25<br />\n$2 to $10<br />\n$1.95 to $12.50<br />\n$1 to $6<br />\n$.50 to $7.50<br />\n$1.95 to $12.50<br />\n<br />\nRobes<br />\nShirts.<br />\nMufflers<br />\nNeckwear<br />\nCuff Links<br />\nHalf Hose<br />\n<br />\nIsaac Hamburger<br />\n& Sons<br />\nY. M. B. O. D.<br />\n<br />\nBaltimore at Hanover Sts.<br />\n<br />\nSmart Collegians Are NVearing<br />\nTHE TRENCH COAT. $12.50<br />\nA -lightweight, putty-colored, waterproofed coat that has plenty of<br />\n'7uolles<br />\ndash and swagger. Trimmed with leather bitters<br />\nThe newest thing out<br />\nSecond Floor<br />\n<br />\nSTF,WART CO<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nAfter the Dance<br />\nTHE MERRY YULETIDE<br />\nspirt: again rainriari: the<br />\nthe wyths.-al<br />\nllibreadth of Lmangron Street we. feel duty bound<br />\niind<br />\nWr<br />\nour quavering salutation to the general chorus of iderr7.<br />\nthc<br />\nEven though'the jingling of the tin bells and the<br />\nspun<br />\ngreet verfaors are far fram the liwoccrood campus, the<br />\nis making 4tself manifest in deviot Wars. The Fenfuwirs With re<br />\n77i:<br />\n213.1.Tiabit 1711aTtlElEy. have asstried tent .parerto while away the fleetrig hours &fore tasting this<br />\nthe faculty fired away With the :Lego:hail broads,4-gm:nes.<br />\ntes Dc<br />\nhowever. have us useful<br />\nThe hOlu-lay<br />\nlinqucht Stholars wh-a. &uric the past three months. have turned ir<br />\npubboaum-.: a-ery itt preference to Erie:Isis-themes. ical have a<br />\nto retrieve lost ground Thaw who have visited the<br />\nthe<br />\npalaces instead ci the -lecture halls and thaw who have EitTed<br />\nEvening Pc<sz<br />\npages of the Semi<br />\nbtica,wlaave an equal opportunity to rn•n3rr<br />\nbnum<br />\nthe. I' Meanwhile. zanerencrem: ktils. in the aripicn<br />\n:<br />\nOffice authcrui, arc isnaant<br />\nliverung Smile.: and inampuls-ing the<br />\nmail stoats.<br />\nhowever. will pithahly spend the<br />\nThe masonry of the<br />\nholidays in the conventional college fashion_ There will be the isvii,1<br />\ngulping of the cup that cheers and the triper.ang ci the light fan<br />\nLASTJC. In the meantime- the tad books will gather dug cm the shcIi<br />\nand the Irides= zewm will continue to shrfn.si the epos-ma Whm.<br />\nthe holiday as ovm. the English prafessar wir: lack it. ctnt far his<br />\n:: Show Intle '<br />\nfive rhousanc: wcr.:: :era paper and the siuoctit v.<br />\n31L.....-7\"C and MItor.<br />\n,<br />\nat-chiref itht.RE ShailL<br />\n<br />\nefT. REGIS<br />\n-<br />\n<br />\nLS S OF<br />\n<br />\nand Scientific:<br />\nIF, ST.<br />\n<br />\nCAB<br />\n\\s.'r k<br />\n<br />\nril0MHS &<br />\n<br />\nde tilecticos of<br />\nlitE NEWS LETTER is pleased to moan=<br />\nof juoior<br />\nSidney Walk '.3C and Frank Cone '31 *,*he pookimo<br />\nand the drawn ti Stephen Fi=ccralil 31 go Claimuseas<br />\n<br />\nMEANS OF TRANSPORTATION<br />\n<br />\nEvans<br />\n<br />\nPrinti*<br />\n1<br />\n<br />\nUNITED RAILWAYS & ELECTRIC CO<br />\nOF BALTIMORE<br />\n<br />\nCoinpany<br />\nGuilford Avenue<br />\n<br />\n•Baltimore., Mi<br />\n<br />\nYELLOW<br />\n<br />\nVF7rter It,$)1<br />\n<br />\nCAB<br />\n<br />\n17 sav<br />\nMerry Xmaswith same Gift<br />\n<br />\nSte Al<br />\n<br />\nP.::)eri Frank Skutch<br />\nARTS<br />\nDECORATIONS<br />\n<br />\niireproof<br />\n<br />\nBONAIRANDERBILT Hotel,<br />\n113 at .4u;a.\"/U.<br />\nrS F. Storm.,<br />\n<br />\nat-<br />\n<br />\n- -,i.11.4,.,.<br />\n<br />\nL<br />\n<br />\nTHE MOST ECONOMICAL<br />\n<br />\n4.4ied las°<br />\n1<br />\n/<br />\nEsta.<br />\n<br />\nEdgeworth<br />\n<br />\ncdtfik-tme<br />\n<br />\nCort-,71c,tal<br />\n<br />\nnot,<br />\n<br />\nit ZirraCt- to light that amp trial‘d campus act..ite have<br />\nimportant events for the evening d February<br />\nheel<br />\nOn the night of Waslxingam's Bendiday, the baskethall ream is hooked<br />\nto clash with the Ursiversity d Maryland while the Musical Ciui<br />\nits<br />\niS sale..iu1sha to appear at the Maryland CasualtyVabilhouse in<br />\nNeither date .= be easily shifted without a great<br />\nhaw<br />\ndeal at settusson and inzorivervasze for all =lammed. The basketball has been 4-rey arranged and the Musical Club has posted<br />\nits ronsi payment for the use al the auditorium<br />\nA more carefui and general use of the Unrvm•sity COendat wit<br />\ncorillicx 4<br />\neivninwic all fume possisathy of such confusing<br />\n<br />\nCEVERAL years kez... the Registrars Officeer.iniishezi<br />\nb.\" University Calendar for the use of the college. According to<br />\nthe achcont„ the dates. ei a,.alecit contests. :amens.. 6mila= prammaan.c. dances and other Unmet-x-5- activities were to be ren-rded<br />\nwell to a....--varize. By such a system, it would be possible to avasd<br />\n<br />\nBALTIMORE<br />\n<br />\nRIDE THE STREET CARS<br />\nyET OW<br />\n<br />\nTAITIN &<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nI rianiser to be bier: sera a hos: of<br />\nvery Ent irs,as. mostly\"highbrows<br />\n- modsaacs. shientons, er.. Gerseratr Christmas time they show their<br />\nrensembrante and at- teat wine some<br />\nlittle gift--a boa re caves, frMing<br />\ntourstet cf thing.<br />\ntwine' ,a book<br />\nWeE. jC':risMEolii roaty seerceci<br />\n!ion,=et you.<br />\nto rie..•.re<br />\nno communication<br />\nhes, •<br />\n.7.•ey kw* En widely<br />\n7. rountry, ao it<br />\non me or aryl...T. lmn came SPrettsdateee of<br />\n`- Edgescrti..7. _ ,<br />\nom-y<br />\na<br />\nwas<br />\nTbe sew:<br />\n. walnut, brass-....--innned tom but if I<br />\nknow- whit...To, the comma were<br />\nEdgetencr.h it. a hale prime in it.<br />\nJuet coincidence. pemana. but a<br />\nqueer one. Am no: at habitual<br />\ntanciker of EgicPWOTLE. so they serern't<br />\ncsteingto aty ogees! taste of mine.<br />\nLooks like a Consent:1B of opinion<br />\namong the highiron\"- or quae a<br />\nhatch of 'era—that-Eagrevorth is tiit<br />\n-mar cape,fir a gift.<br />\nstuf, the pt<br />\nSincerely yours.<br />\nF. A. Pim-pan-irk<br />\n<br />\nTStOINQNE<br />\n<br />\n1813-17 North Charles St. ,<br />\n<br />\nH FURST CO.<br />\n<br />\nLat.'s High<br />\n<br />\n-.:l<br />\ns<br />\n<br />\nN CHARLES STREET<br />\n<br />\nBALTIMORE •<br />\n<br />\nALBERT W. RHINE, INC.<br />\n<br />\nrotack<br />\n<br />\nsN IDKAL CHOlt.E<br />\n1:1111 THE CIIHISIM o HOLMAIr<br />\n<br />\nSnos,\"'<br />\nRK,%ist;i,l with vow relatives ana'friends to pass<br />\n• (hrmstniis l'ava(ion lies,. at this famous center<br />\nof sovial on.) sports setivitics in the -Suniv South-.<br />\n1'11,,hotel Ito* 100 delightful 1'510* a ills pri‘ate<br />\never%<br />\nromeniener for its guests. '5 ill glaf.t.E<br />\n/411111iitillg till !till betiviit of the<br />\nultra-s iolet rays, loss<br />\nlc:Witt-of the<br />\nTWO 114•1101,E I<br />\nGOCIF C01. HSI.\"'<br />\n(;t .1, .<br />\n(,, It A SS greens now en hells sireie% ten sod gdos Pee.\"-• A<br />\nmos-se...The Hill COisrse, Mr<br />\nwater svstent oa the<br />\ntier she seperrislen of lbotaltl eontpleht<br />\nlist) Comae sod the 1ale Coarse<br />\nfi‘vs, has now been lensliteneti insnees perfect tad ea all<br />\nto 5.1(5 551515 in.) elptippell with fairwess.<br />\ni. ansi INA'man viir•diial ,<br />\nthr....shoe,‘,....httet.<br />\n7 'Vt..-it s..• %wow..<br />\nI Itt-tonit FslItts•n<br />\n<br />\nA<br />\n<br />\nIS N Calvert St<br />\n<br />\nEngrre<br />\nPAINTS arid VARNISHES<br />\n<br />\nPeabody Book Shop<br />\nClark.<br />\n<br />\n...r.riee trok iello,•.,<br />\n<br />\nlawele<br />\n<br />\nAll NSA<br />\nlinatitastro<br />\nS.. ton<br />\n<br />\nGrade<br />\n<br />\nSmoking Tobacco<br />\n<br />\nrt.jr,<br />\n<br />\n!a<br />\n'<br />\n<br />\n• •<br />\n<br />\nMorzge-<br />\n<br />\nISIBEL OT. II 5.0. (133.140 III :se<br />\nit<br />\n05(4* III<br />\nmoms \"m.o.<br />\n<br />\nThe New Firrywoof<br />\ni si ‘NsliERLAIN-V ANIIERIIII<br />\nI HOTEL<br />\nitrril I, le,11 AI.<br />\n<br />\nI W4 ^h../ C.....14,1, 1 .<br />\n<br />\nnrv 1..4 .111 ,tott .4 irim•Ins law gweloilMlaft bog.<br />\n•<br />\n[<br />\n•' .. O. it 15, 1 rat 144.111<br />\nFItto.........,s Mod rad Saw*.\"<br />\nttlitts41 attn. Asstotsa Ras,11.4. Solon<br />\nColl<br />\niSt 1414=.46.1.........<br />\nPrainsnalbellotttao<br />\nsali bot.. 1 SA ..olt.<br />\nIs<br />\n.11,11111i<br />\n.<br />\nWaft ....nal<br />\nperk nA wg.......,•••41 limmlome<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 21, 192,S<br />\n<br />\nCA Weliable Tip<br />\nConcernin<br />\n.<br />\nYOUNG MEN'S FALL SUITS<br />\nIn the daily race of business and pleasure, a suit from the<br />\n. Hutzler Young Men's Shop will give you a substantial lead<br />\nright at the start.<br />\n<br />\n$29.50 to $59:50<br />\nTHIRD FLOOR, NORTH BUILDING<br />\n<br />\nHUTZLER 13FORIM (0;<br />\nHovrarCSaratoga and Clay Streets<br />\nTelephone CAlvert 1234<br />\n<br />\nCORONA<br />\n<br />\nTYPEWRITERS, ALL MAKES<br />\n<br />\nROYAL<br />\n<br />\nQM. W. LUCY & CO.<br />\n104 WEST PAYETTE STREET<br />\nTelephone CAlvert 5902<br />\n<br />\nOldest and Largest Corona Dealers in State<br />\nUNDEWOOc<br />\n<br />\nHAMMOND<br />\n<br />\nAt Your Service 24 Hours a Day<br />\n<br />\ndrCayfloWer Cab Co.<br />\nINCORPORATED<br />\nI<br />\n<br />\n718 N. Charles Street<br />\n<br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br />\n<br />\nCOMPARE!<br />\nStand at Honiewood Fid1,1<br />\n<br />\nVErnon 4090<br />\n<br />\nHOmewood 8040-8041<br />\nYour clothes will always leave that neat appearance ern* will let us do your<br />\nct,EANING. DYEING. PRESSING AND REPAIRING<br />\nOne Trial Will Convince You<br />\n<br />\nPARISIAN TAILORING CO.<br />\n346. E. 13RD STREET<br />\nUniversity Parkway<br />\n<br />\ncorn,<br />\n<br />\nCA thOuAht of today-The season's styles in neckwear are the key to a man's<br />\ndress . . . they give that touch of personal effectiveness<br />\n-<br />\n<br />\n\"'The Store of Standard Values\"<br />\n<br />\nIvicPHtRSON'S<br />\nEstablished 1862<br />\n<br />\n11 East Baltimore Street<br />\n<br />\nThe MAY Co.<br />\nA Modern, Store—,<br />\nFor Modern,<br />\nYoung Men.,<br />\n<br />\nI<br />\n<br />\nHear Ye! Collegians—going home forth. holidays?<br />\nGet the gang together, put on the dog, and drive a<br />\nnew SAUNDERS SYSTEM car home. Five or more<br />\nover<br />\n/ can drives new SAUNDERS SYSTEM car home your<br />\nholidays for less than railroad fare. There's<br />\nthe<br />\n/<br />\nconveniand<br />\ncomfort<br />\nSAVING—and you get added<br />\nence, and complete independence. Ask us about our<br />\nlow long trip rates and complete estimates.<br />\n<br />\n11 E. North Avenue<br />\nVErnon 2704<br />\n<br />\nYour correspondent has been<br />\nfound guilty, his rollicking friends<br />\nand drunken companions tell him,<br />\nof violating a tradition, to wit, the<br />\ntradition against using names in this<br />\ncolumn. Holding high their hands<br />\nin holy horror they demand to know<br />\nwhat the NEws-LETTER in general<br />\nand this part of it in particular arc<br />\ncoming to. Names, they say, were<br />\nnever used before; let them there'<br />\nfore be never used again.<br />\nIn reply, the writer can only<br />\nshrug lightly two shoulders which<br />\nbear so many • of the world's cares<br />\nand ask with scorn and disgust,<br />\nwhat the hell. If tTaltions are<br />\nagainst the use of names, so much<br />\nthe worse for the traditions.<br />\nThere is in our, system of jurisprudence a very good—iedson for<br />\nfollowing precedents, for letting, as<br />\nwe say in Latin, \"the' decision<br />\nstand.\" Security in personal and<br />\nproperty rights demands such a policy; there is no such demand on the<br />\neditor of this column.<br />\n<br />\n3<br />\n<br />\nAN APPRECIATION<br />\n5, Charles Dickens,<br />\nParis, XVI.<br />\n6 December, 1928.<br />\nTo the Editor if the NEWS-LETTER.<br />\nDear Sir:<br />\nOne of my former students has<br />\nbeen good enough to send me the<br />\ntoo generous review of Never, Go<br />\nBack which appeared in the NewsLETTER of November 13th. I am<br />\nmore than touched by the friendly<br />\ntone of this notice and by the enthusiasm with which you write of<br />\nmy first novel. There is, however,<br />\none point which hurts a bit, if you<br />\ndon't mind my saying so, and that<br />\nis that your reviewer, who apparently knows me, should have made the<br />\nmistake of all the others and identified me with Francis Harper. The<br />\nbook is not an autobiography and<br />\nnone of the characters are portraits<br />\nof the author. Moreover, Oralia<br />\nis no place on earth that I know of<br />\nbut a combination of many places.<br />\nI make these remarks' because now<br />\nas in the past there has been too<br />\nmuch talk about the originals in my<br />\nstories and too little about the stories themselves. There is a certain<br />\nexcuse for this, even in the present<br />\nease, but there are excuses for almost everything. I should be very<br />\ngrateful to you if you would make<br />\nit clear to your readers that my novel is not a roman a clef.<br />\nWith many thanks I am<br />\nFaithfully yours,<br />\n<br />\nGEORGE BOAS.<br />\nOnly one thing moves your correspondent, and that is the wishes of Phone, VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nhis readers. If that great public<br />\nPossible to Ue\"<br />\nwhich he has served so long, so THE RELIABLE WEAVING CO.<br />\nBurns, Tears, Cuts and Mill<br />\nfaithfully, and so well, desires that Moth Holes,<br />\nDamages Made Perfect<br />\nnames be left out of this column not WE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nbecause a silly tradition is against<br />\nBaltimore, Md.<br />\nthem but because names are in themSelves distasteful, names will be left<br />\nout.<br />\nUnless and until a reasonable protest is heard, however, names will<br />\ncontinue on occasion to appear.<br />\nA use, we are delighted to announce. has been found at last for<br />\nthose mysterious green apples which<br />\nsometimes grace the dining hall. Of<br />\nsmall value its the metabolic process,<br />\nthey may nevertheless he used effectively as hand grenades, missiles,<br />\nand billets doux. and this week they<br />\nwere.<br />\nHere it was nearly Christmas,<br />\nand,the boys from the Far North<br />\n(New York and Boston)'Were missing the old snow bottles; the boys<br />\nfrom the Far West (Los Angeles)<br />\nwere still finding fault with the climate but are willing to see some<br />\nsnow; aud the others were ready for<br />\naction.<br />\nAt first- the apples were -just<br />\ntossed about in a mild game of<br />\ncatch. Then the pace grew gradually swifter, the aims rapidly less<br />\naccurate, the casualties quickly more<br />\nnumerous, reprisals initnediately the<br />\norder of the day.<br />\nAnd through all the fierce heat<br />\nof that bloody shambles rose and<br />\nfell .the haunting strains of the<br />\nAlumni Hall anthem, while somewhere a saxophone slowly wailed<br />\nthe opening bars of Auld Lang<br />\nSync.<br />\nThy baa-a-attered halls,<br />\nThy aaaappled walls,<br />\nWe'll chair-ish thee for aye.<br />\nSo send an aaappu11111<br />\nThrough the air<br />\nAnd smaaaack him innnnn<br />\nthe eye.<br />\nTouching.<br />\nA noble sport, you say? Wait,<br />\nbrother, wait; you ain't seen nothin.<br />\nyet.<br />\nWhen a ,blanket of virgin snow<br />\nshall have transformed the Hall<br />\nquadrangle into a broad expanse of<br />\npurity, when an instinct as old as<br />\nthe race shall have brought forth<br />\nto battle the contingents of the several entries, when a spark shall have<br />\ninflamed the gathering and awakened primordial impulses, then shall<br />\nyou see action.<br />\nUntil then, hold your breath.<br />\n<br />\nZUG<br />\n<br />\nBrown. Zug-Grain<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br />\n<br />\nAN<br />\n<br />\n111 E. Baltimore<br />\n<br />\n19 Lexington<br />\n<br />\nWhen 'Better Used Cars Are Sold<br />\nOCeill Will Sell Them<br />\nHopkins Students have a selection<br />\nof practically all standard<br />\nmakes and models<br />\n$100 to $1,000<br />\n<br />\nI<br />\n<br />\nII<br />\n<br />\nTHE NEILL BUICK COMPANY<br />\nt<br />\ni<br />\n<br />\nSales &<br />\nServic50<br />\nWest 26th<br />\nStreet<br />\n<br />\nNew and Used Car Departments<br />\nMount Royal 6' Maryland Avenues<br />\n107 Mount Royal Ave.<br />\n<br />\nYe cPegk,y Stewart Grill<br />\nBREAKFAST<br />\n<br />\n-•<br />\n<br />\nLUNCHEON<br />\n<br />\n•-<br />\n<br />\nDINNER<br />\n<br />\nPrivate Rooms for Special Parties<br />\nDELICIOUS FOOD AT MODERATE PRICES<br />\n<br />\n23 WEST SARATOGA ST.<br />\n<br />\nSe<br />\n<br />\nA pencil put Peary on top<br />\nof the world<br />\nnTHER explorers had great personal<br />\n<br />\nthe next day's progress to the Pole.<br />\ncourage,unlimited energy and vision<br />\nTo face each day's reckoning as if it<br />\nuntrammelled;and failed. But Peary had 1 were the most important of all days is<br />\none thing more.<br />\ncharacteristic of men in the telephone<br />\nHe had the grasp of every detail<br />\nindustry. That viewpoint, expressed in<br />\nthe varied terms of applied science,lab—aS seen in the care which guided<br />\nthe pencil in his frost-cramped hand.<br />\noratory research, financing and manAfter each day's march he calculated<br />\nagement,guides Bell System men in their<br />\na methodical course to make sure of<br />\nrespective fields of public service.<br />\n<br />\nBELL SYSTEM<br />\ntif cosies-wide system of I8,soo,000 inter-eonneeting telephones<br />\n<br />\n\"OUR PIONEERING<br />\n<br />\nWORK HAS JUST BEGUN'<br />\n<br />\n\f1928<br />\nTHE JOHNS HOPEINS FIENS-LETT1ER„ DECIONSER 21,<br />\n<br />\nadorns Discussed<br />\n<br />\na TresAt 0. D. L. Jleetiag<br />\n:_e<br />\na ft=r,,g<br />\nI _tram=<br />\n5:ocaet-i.<br />\n•<br />\n<br />\nDAL MIAMI SAY&<br />\nWS the Ina tame be has .a:*;<br />\nhoots, but be has be<br />\nmice,by the lam of<br />\n<br />\nOUTSTANDING CHEVROLET<br />\nTHE<br />\nHISTORY<br />\nOF CHEVROLET<br />\n.<br />\n<br />\n_-<br />\n<br />\n-<br />\n<br />\n8<br />\n<br />\nSi= 0:2,,,*<br />\nAL7:1-:as<br />\n<br />\nVol.<br />\n<br />\nSOUTHERN HOTEL<br />\n<br />\n-<br />\n<br />\nBAR<br />\nRE<br />\n<br />\nIF NOT<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nN. HESS* SONS<br />\n<br />\nSee It December 29th<br />\nFLOOR<br />\nGN OUR DISPLAY<br />\n<br />\n-<br />\n<br />\ntet-_<br />\n<br />\n_<br />\n-<br />\n<br />\n•,7c.s<br />\n<br />\na i<br />\n<br />\n7.1<br />\n<br />\n-<br />\n<br />\na<br />\n<br />\nMini<br />\n<br />\nPREFERRED DELIVERY<br />\nYOUR ORDER NOW FOR<br />\n<br />\nSales Co.<br />\nJones Chevrolet<br />\nmir. Come+<br />\n<br />\nST1<br />\n<br />\n544,th<br />\n<br />\n-<br />\n<br />\nfaculty an::<br />\n<br />\nDID YOU SEE<br />\n<br />\nGradassie Sorority<br />\nfields Election:.<br />\n-<br />\n<br />\n▪a<br />\na<br />\na<br />\na<br />\na<br />\naa<br />\na<br />\n<br />\nN. HESS' SONS<br />\nE BALTIRCRI S.711.127<br />\n<br />\nST<br />\n3 YAL AVE and McMECHEN<br />\nMT :<br />\nMAdi.,n 5<br />\n<br />\n,<br />\n- -_<br />\n• -- Ln- --t<br />\n_<br />\n• _<br />\n<br />\nmore<br />\n- an am<br />\n<br />\nident<br />\nganiza<br />\nary, tl<br />\nular<br />\n:to syut<br />\nthe pl;-.<br />\n<br />\n•e•<br />\n<br />\na 'Soda<br />\n<br />\n•<br />\n<br />\nT\\ I ei<br />\nClub •<br />\n<br />\n-<br />\n<br />\n\"Taking his<br />\nmeasure..<br />\n<br />\nf<br />\nj<br />\n<br />\nNOSE<br />\n—<br />\n<br />\nBiG<br />\n<br />\n\\<br />\n<br />\nezd<br />\n<br />\nGood<br />\n<br />\n-<br />\n<br />\nAll the<br />\nworld is<br />\n\"Taking<br />\nh i $ messure.- But he'll pass<br />\nwith colors flying! For<br />\nhe had us take his<br />\nmeasure first, for a<br />\nStetson D Suit. And<br />\nreally fine clothes are<br />\nsuch a big asset.<br />\n<br />\nSANDWICH -SHOPS \\<br />\n2.1 E<br />\n<br />\n'...7,11470111E SEREET<br />\n<br />\n_7<br />\n<br />\n-<br />\n<br />\n&LICK J_VD BLUE<br />\nSHOCK LZ 17.577711E OBSERIIR<br />\n<br />\nTHE SILVERNLAN<br />\n<br />\n. •<br />\n<br />\n--<br />\n<br />\nDov<br />\nlast y<br />\ndrawn<br />\nbe los<br />\nstorm(<br />\npion,<br />\nSite in<br />\n<br />\nS9950 $3450<br />\n<br />\npected<br />\n\"Haw<br />\n<br />\nCly(<br />\n<br />\n-<br />\n<br />\nd:R=et--<br />\n<br />\n-<br />\n<br />\n11VM =V!<br />\n<br />\nger, a<br />\n. carpet<br />\nmedial<br />\n. three<br />\ntwo in<br />\nthe ac<br />\nin a g<br />\nhotel 1<br />\n<br />\n,<br />\n<br />\nRE Mut<br />\nCON CiltitS. mtist<br />\n<br />\n_17<br />\n<br />\nL<br />\nt<br />\n<br />\n'-<br />\n<br />\nDANCE and EAT<br />\n<br />\n•:'±lane<br />\n-th of<br />\nas,<br />\n<br />\n(Open 10..34l A. 34 wer..:<br />\nCELVILCIE<br />\n-GUS scants tc, see rot-<br />\n<br />\n$13 N. angles St_<br />\n<br />\nif:x=6y tie<br />\n<br />\n,<br />\n<br />\nCLOTHES ,FOR COLLEGE MEN<br />\nMAOE FOR YOU<br />\n<br />\n-<br />\n<br />\nbeer<br />\nLass.<br />\n<br />\n4 N. Howard St.<br />\n<br />\n•<br />\n<br />\n-<br />\n<br />\nThe<br />\nsideral<br />\nyear tl<br />\nstage,<br />\nBanks<br />\nbuilt t<br />\nthe 1,<br />\nexpect<br />\nprofile<br />\n,scenic<br />\n<br />\n--ver SImp:Te•<br />\n<br />\nSAMUEL KIRK & SON, INC.<br />\n;<br />\n<br />\n421<br />\n<br />\nT.NTERCOLLEGIATE NEV•15<br />\n<br />\nIialtimore, NCI<br />\n<br />\nNorth Charles<br />\n<br />\n-GOLD ,TEWEIRY<br />\nDIAMONDS<br />\nSILVERWARE<br />\n<br />\nthe vs<br />\nas an<br />\ni>ut th<br />\nSi;<br />\ncents<br />\nThis':<br />\n<br />\nt<br />\n<br />\n712.<br />\n<br />\ntremel<br />\nmerou<br />\ncostly<br />\nfact it<br />\ngage<br />\npromi<br />\nthan<br />\n<br />\nTHE WONDER MOTOR FUEL<br />\n<br />\n-<br />\n<br />\nE.(BACON<br />\n<br />\narc the le.vrtable at.ce occEiege ,e11<br />\nIthar w.r—a- sxeec:<br />\n<br />\nAcc<br />\n<br />\niiiittie<br />\nST. PAUL anj 31st STREET<br />\n<br />\n(huts<br />\nconsii.<br />\nward<br />\n<br />\nThe Drug Store<br />\n3E7F. AV!. :V....J.1_1:• 7<br />\n<br />\nI<br />\n<br />\nN.9<br />\n<br />\nE<br />\n<br />\nThurs<br />\ncustot<br />\nThis<br />\n<br />\nWith a ReptadtionEstablIshed<br />\n<br />\nYcars<br />\n<br />\norder.<br />\nlate ol<br />\nbeen<br />\n<br />\nNaturally<br />\n<br />\nHave You. Ever ,<br />\nWalked Home?<br />\ndi;ga.4-1vam have<br />\nman wart<br />\nDm': let<br />\n<br />\nhappm<br />\n<br />\nma:7.<br />\n<br />\nSmut:<br />\nThe Only Place Ar.<br />\n<br />\nTlsere is pride .1.p2tErig your<br />\non a gift from<br />\nshop,'<br />\n<br />\nTHANAN<br />\n<br />\nDINE and DANCE<br />\n<br />\ncriT<br />\n<br />\nBertram S. Berney<br />\n<br />\n0<br />\nL<br />\nD<br />\nE<br />\nN<br />\n<br />\nFor Sweaters, Trench Coats, 54-;...- .sers. Sportm4 Goods,<br />\nOutiina, head<br />\nArmy Uniforms and Sat-plies_ also Aa.a<br />\nlrotar airship and land at the<br />\n<br />\ni'<br />\nH<br />\nE<br />\nA<br />\n<br />\n111E GIANT<br />\nPOWER RIM<br />\n<br />\nESSO<br />\n<br />\n4<br />\n<br />\nA<br />\n<br />\nOUTING SUPPLY CORPORATION<br />\n• Norris Lbe-es Sc-e<br />\n<br />\nIi<br />\n<br />\nS1HCES<br />\n10\"4<br />\n<br />\nBlack<br />\n<br />\nan Scotch Grain<br />\nurr<br />\nNACToRs<br />\n<br />\nSTANDARD\" MOTOR OIL<br />\n<br />\nMusic Excellent<br />\nFood Delicious<br />\nPrice'Reasonable<br />\n<br />\n4<br />\n<br />\nclub t<br />\n<br />\nforated toe. haft the<br />\nshot for the Coitlaiv<br />\n<br />\ngram<br />\n<br />\nMan.<br />\n<br />\nSTANDARD OIL COMPANY OF N. j.<br />\n<br />\n110 N. LIBERTY ST<br />\n(dor to Park Avioue)<br />\n<br />\nEn<br />\n<br />\nThe latest in heavy<br />\nScotch Grain with per-<br />\n<br />\nOpen 1(A. M. to 1.30 A M<br />\n<br />\nThe Meguare of CM Value<br />\n<br />\nTh(<br />\nthe sc<br />\nhall h<br />\ndance<br />\nlarger<br />\nflier,<br />\n• the se<br />\nond II<br />\ntion's<br />\nfor th<br />\nof th<br />\nland<br />\nPythi<br />\nin dc<br />\nand v<br />\nstorm<br />\n<br />\npatro<br />\n<br />\n' Th<br />\n<br />\n\"on<br />\n<br />\n'Ha's<br />\n<br />\nr324 N.C11A1(LISST<br />\n<br />\nNew<br />\n<br />\n\f", "format": "basic_html", "processed": "MUSICAL CLUB WILL<br />\nGIVE TWO CONCERTS<br />\nto<br /><br />\nEaston<br />\nTo Take Trip<br />\nand Salisbury<br />\nTO LEAVE WEDNESDAY<br />\nClub Plans Other Trips<br />\nLater in Season<br />\nThe Musical Club will give two<br />\nconcerts during the Christmas holidays, one at Easton and another at<br />\nSalisbury.<br />\nOn Wednesday, December 26, the<br />\nmembers'of the club (approximately<br />\nseventy, strong) will set out<br />\nfrom the barn by bus for Easton,<br />\nMd., which is.located on the Eastern<br />\nShore. That night they will give a<br />\nConcert -at the Easton High School<br />\nunder the auspices of the Easton<br />\nHigh—School Senior Class. This<br />\nconcert will be followed by a dance<br />\nat the Easton Armory.'<br /><br />\nSENIOR CLASS DUES<br />\nPAYABLE JAN. 7-11<br />\nSenior class dues will be collected during the week of January 7, immediately following<br />\nthe Christmas recess. Treasurer Medenbach,will be at the<br />\nHullabaloo office on the second floor of the \"Barn\" on<br />\nthese days between 12:30 and<br />\n1:00 P. M, to receive payments from seniors. Dues are<br />\ntwenty-nine dollars and checks<br />\nshould be made payable to M.<br />\nH. Medenbach.<br /><br />\nHOPKINS QUINT .<br />\nDEFEATS INDIANS<br /><br />\nFENCE MYSTERY SOLVED'BY<br />\nNEWS-LETTER REPORTER<br />\nThen what seemed to be a true<br />\nAt last the great mystery has been<br />\nsolved. For weeks, the question of solution was offered. The fence had<br />\nwhy the board fence has been erect- been built to keep the engineers<br />\ned around \"the site of the new Lev- from learning more about construcering Hall\" has been the subject of tion than is taught in the echoing<br />\nlong discussions. In fac4212 was,ru- halls of the Mechanical Engineering<br />\nmored on good authority that the Building. Engineers, it was claimed,<br />\nyiolating the honor system by<br />\nmembers of the Debating Council<br />\nhave spent many sleepless nights ldoking out of the windows of classdelving in ponderous tomes to get at rooms and transcribing the knowledge gained thereby to quiz papers.<br />\nthe root of the question.<br />\nThe first solution of the matter But this ingenious theory went the<br />\nwas the obvious one. Everyone im- way of all the others. The engineers<br />\nmediately believed that -Levering were,exonerated.<br />\nHall was to be completed behind the<br />\nNow conies the true solution. It<br />\nprotection of the barrier and then is so simple that it is difficult. The<br />\non April Fool's Day the fence was barricade is to keep trespassers from<br />\nto be torn down and the building stealing any of the machines used in<br />\nstand forth in all its splendor. But the process of construction. This<br />\nwe were soon disillusioned; such drastic step became necessary when<br />\nwas not the case.<br />\nthe foreman discovered one of his<br />\nThen a bright soul gave circula- men ,taking his'girl out for joy, rides<br />\ntion to another solution. The fence on one 'of the tractors.<br />\nhad been built to keep the cold<br />\nOur correspondent, after intenwinds, sweeping down from the<br />\nsive research, has calculated that<br />\nquadrangle, from striking the workthe cost of the fence approximately<br />\ners. A glass roof was to complete<br />\nequals the amount contributed to the<br />\ninclementhe<br />\nfrom<br />\nthe protection<br />\nFund by the undercies of the weather. But this theory, Levering Hall<br />\ngraduates.<br />\nin its turn, was soon exploded.<br /><br />\nSWIMMING TEAM TO<br />\nCONTINUE PRACTICE<br />\nThe swimming team will<br />\nhold regular practice during<br />\nthe Christmas holidays. The<br />\nteam will work out every Monday, Wednesday, and Friday<br />\nat 5.00 P.-M., at the Knight<br />\nof Columbus pool at Madison<br />\nand Cathedral Streets. Berause of the comparatively<br />\nslow start in reorganizing the<br />\nsport, it is absolutely necessary<br />\n—iil and team<br />\nthat all mant<br />\ncandidates be present at practice.<br /><br />\n'HOPKINS FIVE LOSES<br />\nTO TEMPLE OWLS<br /><br />\nDR. GOODNOW REPORTS TO<br />\nBOARD OF TRUSTEES<br /><br />\nTemple Snows Hopkins Under<br />\nin Second Half<br />\nLang Stars for Jays; Bonner Chid<br />\nScorer of Gams<br /><br />\nHopkins suffered its first defeat<br />\nof the current basketball season<br />\nwhen it lost to Ilmple University<br />\n38-21 in Philadelphia on ,yVednesday. The Jays had made an auspicious start by defeating Lafayette<br />\nand William and Mary on the Friday and Monday immediately preceding. This game marked the<br />\nfourth victory of,-the season for the<br />\nTemple five.<br /><br />\nHopkins played without, the service of Cene Debuskey, star center,<br />\nWinning Team la Superior in<br />\nReport Shows New Play Is<br />\nEvery Department<br />\nwhose cool, heady playing and sharp<br />\nProgressing<br />\nDEBUSKEY AGAIN STARS<br />\nSPEAKS OF MED. SCHOOL shooting' ire always prominent factors in the Blue Jay victories.<br />\nSinks Six Goals and One Foul<br />\nPresident Comments on<br />\nStude substituted for Debuskey in<br />\nShot for High Total<br />\nResearch Work<br />\nJourney to Salisbury<br />\n.<br />\nThe report of the'President of the the game against the Templemen.<br />\nOn the same night, after the Continuing the pace'they had set<br />\nUniversity which has just been reHopkins Spurts Early<br />\ndance, the group will 'proceed .to against Lafayette College, the Hopleased shows beyond doubt that the<br />\nHopkins started off with a rush<br />\n• SalisbUry,Irriying there very early kins quint defeated William and<br />\nNew Plan is now well on its way when Johnny Lang, star guard, who<br />\nthe next.day. Accommodations are Mary last Monday night. The score<br />\nto complete realization. Figures in- wat elected captain of this year's<br />\nbeing made so that the men will be of this game, which was the second<br />\ncluded by Dr. Goodnow in his re- tea&amp; after the William and Mary<br />\nable to sleep during All of the day: of the season, was 38 to 22.<br />\nport show a decided decrease in the game, rang up three field goals.<br />\nIn the evening they will give a con- The contest was not `s6 fast as<br />\nnumber of students registered in the With Hopkins in the lead thus early<br />\ncert at the Fellowship Hall of the the Lafayette game and was featurUndergraduate department with a in the game, the Blue Jay continMethodist Church in Salisbury for ed by no especially brilliant, plays. Christmas Issue of<br />\ncorresponding increase in the Fac- gent was viewing the outcome of the<br />\nthe benefit of the Peninsula General the mode of attack being syStemat:c<br />\nJay Appears Today<br />\nulty of Philosophy.<br />\nencounter with somewhat victorHospital Fund. This concert, too,<br />\nConflict in Important Dates<br />\nThe Christmas issue of the Black<br />\nJays took tic<br />\nand methodical.<br />\nious eyes.<br />\nIt<br />\n, will 'be followed by a dance, which<br />\nis<br />\nnote<br />\nto<br />\nthat<br />\ninteresting<br />\nwith<br />\nDiscussed<br />\nand Blur Jay appears on the camwill be held in the ballroom of the long chances but attempted to carry pus today. This issue will be.smaller<br />\nTemple, however, was not long in<br />\nThe Student Activities Council the passage of laws by the last State<br />\nWicomico Hotel. It is also po:ssible the ball under the basket for .a sb it. than the first two of this year, but held their monthly meeting in the Legislature requiring the certificates coming back. Goals by Pearson,<br />\nthat the club Will broadcast a short The system was made More effective will be very compact. The smallness M. E. Hall last Tuesday. The meet- of all entering students in the State Bonner, and Feinberg of the Temprogram from the local radio sta- (lite to the advantage el both weight of the issue is due to the fact that ing was called to.oider by President by their high school principals the ple team put the Philadelphians in<br />\nnumber of new men has fallen off the -lead, and the half ended with<br />\n.tion, which is located at the hotel. and height held bv the Blue team. very little time has intervened be- Wood.<br />\nconsiderably, but a corresponding the home team leading 15-12.<br />\nAfter the ctiolo the club will leave<br />\nJay<br />\nthe<br />\nof<br />\nappearance<br />\nlast<br />\nthe<br />\ntween<br />\nBrown Hammond was elected to<br />\ntrr-get.rthe tip-off<br />\nfor Baltimore, arriving here very<br />\nand thep resent issue. The staff Is the Council representin,g'the Debat- betterment' in the ability of freshTemple Goss on Rampaye<br />\nttr the rebounds from the Isick<br />\n,arly the next morning.<br />\nnow up to date on its previously ing Council; replacing Oarland Her- men is expected by the President. - The second hali marked a scor,<br />\nboard, the lack Of size of the WiJ-- conceived time sChedule.<br />\nTwelve Dropped<br />\nsecond Trip<br />\ning spree for Temple. The Owls<br />\nshey.<br />\nThe new ruling adopted' by the ran up 23 points, at the same time<br />\nThis year is the -seccind time the ham and .Mary Indians proved mire<br />\nThe ten dollar prize for the best<br />\n,<br />\nIt was also moved and carried Academic Council providing that<br />\ntrip to Salisbury and Easton ha; evident.<br />\nholding the Jays to 9 points. Temcontribution appearing in the issue that Hammond be given the varsity<br />\nonly \"those students who had given ple put up a stiff defense that the<br />\nI een taken. I.ast year's visit was<br />\nC.<br />\nAlexander<br />\n,to<br />\nawarded<br />\nbeen<br />\nfor<br />\nhas<br />\nOw<br />\nrather<br />\nloose<br />\nPlztying a<br />\nHullabalon evidence by the character of their<br />\nthe<br />\nwork<br />\non<br />\nhis<br />\nfor<br />\nseal<br />\ntrip<br />\nthe<br />\nan(I<br />\napproval<br />\nmet with'much<br />\nBlue Jays were unable to get<br />\nWoods:' Jr., for an article entitled<br />\nwork that they should be encouraged through. The game was characterwas marked as both a social and a few moments after the elpening \"Several Lies.\" Woods' has been last year.<br />\n'se:.<br />\nsoon<br />\nfive<br />\nHopkins<br />\nto<br />\nyear's<br />\na<br />\nacquire<br />\nthe<br />\nliberal<br />\neducation\"<br />\nwhistle,<br />\nThen followed much discussion<br />\nfinancial success. rn fact, last<br />\nized by shots—Flom the outside.<br />\ncontributing regularly to the Jay<br />\nconcerts at these towns were consid7 tled down to business .and hegan under the signature \"A. C. W.\" on the meagreness of the allotment should be permitted to return at the Horst, long distance shot, sank two<br />\n(TO to have been the most success- their sCoring. The first *goal was Woods and Daniel Colemah Watson. of space in the ba'rn to vaiious ac- end of their second year of resi- goals from the center of floor. Hoptivities. Kolb complained that the dence resulted in the dropping of kins was unable to make its underful the Musical Club had ever given<br />\nhave contributel1 a number of poems<br />\nmade by the, Jay team, and<br />\nMusical Club, Barnstormers, Hulla- only twelve men.<br />\nII until that time.<br />\nthe-basket play effective and had t6<br />\nwere the victors in danger. Tlw to the issue.<br />\nbaloo and Band, had only one mall<br />\nSeventy-five men itt_the College resort to long shots. Temple put<br />\nMore Trips Later<br />\n.<br />\n\"Christstood<br />\ndefinite<br />\nhalf<br />\na<br />\nhas<br />\nThe issue<br />\nat the end of the<br />\noffice with which to carry on their of Arts and Sciences availed them- up an aggressive offense, but the\"<br />\nlater in the season thlusical score<br />\nfavor. In this masy\" touch, especially in the cover sarious managerial affairs. There selves of the opportunity of taking also scored mostly on outside shots,<br />\nto 10. in I<br />\nClub is planning to take several<br />\nDonald<br />\ndesign.. The cover is by<br />\nwere other complaints of the sort courses under the Faculty of Philos- (The prevalence of long shots is acother interesting trips in addition to period Debuskey accounted for<br />\nSharretts and depicts an Old English but it was decided to let things conophy most of whom were students counted for by the shortness of the<br />\nthe many other concerts scheduled eight of the points ho sinking four<br />\nShopping scene. The style of this tinue as were until the new Leverin their third and fourth years of Temple court, which is about onefur local performances. The firstof Ii uble-deckers front tilt:- floor, Thc<br />\ndrawing is different from any which ing Hall opens,<br />\nthird shorter than the Carlin's<br />\nresidence.<br />\nthese will lie the annual lielais.con- Indians fared a little better in the<br />\nIllue• Jay has ever used for a<br />\nthe<br />\ncourt.)<br />\ncert, which always proves to be<br />\nPresident Wood reported that the<br />\nMedical School<br />\nsecond half. when they rolled up cover design.<br />\nCouncil was in receipt of a message<br />\nReferring to the Medical School, The playing of Johnny Lang<br />\nquite successful. After this the<br />\nanother<br />\nThis number is divided among from Omicron Delta Kappa which Dr. Goodnow cOmments on the imtWeive points as • against<br />\nstood out for the Jays. He was<br />\ngroup is going- to take a trip to Port<br />\nnineteen 'count for the Black and jokes„ articles, poems,and advertts-. suggested that the secretary of the portance of the past year in the his- the high point.srorer of the Hopthe<br />\nbefore<br />\nperform<br />\nl!eposit and<br />\nthe same. Oro- Student Activities Council should<br />\napproximately<br />\nin<br />\nmg<br />\n•<br />\n•<br />\ntory of that institution.<br />\nBlue teatii.:<br />\nkins team, registering 8 points.<br />\nTome School boys. Then comes the<br />\nportion as the last two issues. There<br />\ncare of all conflicting notices of<br />\nPlans for the completion of the Horst, scoring 6 points on two field<br />\nWith the exception ,1 several are a number of humorous'poems take<br />\ntrip' into Western Maryland, which<br />\nform<br />\nmeetings. This was put in the<br />\nWilmer Ophthalmological Institute oats And two fouls, .ivas.the next<br />\nmimues 'in the first half when Ber- in the issue and the editors feel that<br />\n• Will include a concert at Hagerstown<br />\nof a motion and was carried. From were, completed and the building is highest point scorer or the Jays.<br />\nPa.sarew<br />\nfor<br />\nsubstituted'<br />\nwas<br />\nnard<br />\nthose who have been complaining of now on the secretary of the Council now in process of construction. Bonner, center of the Temple Uniand possibly one,at Wilson College.<br />\nLang: shifted to forward. Jung the lack of humor in the Jay will be will post all notices of meetings dt<br />\nPlans are now being considered for versity five, was the big star of the<br />\nThe last trip of'the season will be and<br />\nthe post office, while the sectetary a building to house the Department game. He led his team's<br />\nPasarew held down the forward appeased by this Concession.<br />\nattack by<br />\nthe one at. Lutherville, where the and<br />\nof the Athletic Board takes care of of Physiological Chemistry and will<br />\nIt was usually either of<br />\nwinging up 6 double-deckers and 3<br />\nclub will give a concert at the berths.<br />\nnotices.<br />\nathletic<br />\nall<br />\nfit in with the new Hunterian _Lab- fouls for a total of 15 pointi.<br />\nthese two who received the tip-off<br />\nMaryland College for Women.<br />\nBasketball Quint To<br />\nA conflict between the Hopkins- oratory to form a part of the Physifrom Debuskey, and thereby gave<br />\nComplete<br />\nArrangements<br />\nHave New Uniforms naryland basketball game and the ological and Anatomical Laborato- (Hopkins used seven men in the<br />\ndouble task.<br />\nE. Bennett Kolb, president of the the visiting team a<br />\nuniforms have been ordered Musical Club Home Concert was ries when they are rebuilt—in the game. The starting line-up consistNew<br />\n.ball from<br />\nthe<br />\nclub, bas'made a trip to Easton and They had to first get<br />\ned of Passarew, Jung, Stude, Lang<br />\nvarsity basketball team rail discovered. Both of these events course of the next few yea'is.<br />\nthe<br />\nfor<br />\nhad<br />\nthat<br />\ndoing<br />\nafter<br />\nSalisbury recently to complete the the Jays, and<br />\nand Horst. Bernard and Johnson,<br />\non Friday. FebNew Library •<br />\nplace<br />\nholitake<br />\nto<br />\nwere<br />\nthe<br />\nuse<br />\nafter<br />\nfor<br />\nready<br />\nbe<br />\nwill<br />\nball in for a scoring atOne of the most important addi- substitutes, also participated during<br />\narrangements for the club's per- to' work the<br />\ndays. Heretofore the team used ruary 22. The basketball game was<br />\ntions to the school is the completion the game.)<br />\nformance. He reports that the con- tempt.<br />\nof other gnore favored to.be held at Carlin's and the conuniforms<br />\nof the Welsh Medical Library, the<br />\nHorst at<br />\ntracts have been closed and that the The placing of Lang and<br />\nJays Rush for Train<br />\nsp-orts, their only new equipment cert at the Maryland Casualty au- opening of which is expected before<br />\nto provide<br />\nThe Jay basketball squad got in<br />\ndecided<br />\nwas<br />\nit<br />\ndistricts are looking forward to the guard positions proved<br />\nHowever,<br />\nwhite track pants and ditorium.<br />\nof<br />\nconsisting<br />\ncalendar<br />\nthe<br />\nof<br />\nnext<br />\nthe<br />\nbeginning<br />\nhelped.<br />\nvisit from the Hopkins men with for a strong defense which<br />\njerseys originally intended for the that some private agreement be- year. ,, All three brapches of the Philadelphia at 7:00 o'clock. The<br />\ngreatly in holding the Indians. Com- freshman team.<br />\ngreat exWtations.<br />\ntween Kolb and Eldridge should be present Medical Library including game started at 9 o'clock. The var-the close guarding<br />\nthose of the Hospital, School of sity game was preceded by a preThe progtns for the two con- bined, too, with<br />\nquintet will have made on the matter.<br />\nHaverford<br />\nThe<br />\nscoring power of the<br />\nHygiene and Public Health and liminary between the Temple Freshof<br />\nnumber<br />\nthe<br />\ncerts during he holidays will be in affecting the<br />\nlimiting<br />\nview<br />\nto<br />\nfirst<br />\nthe<br />\nfor<br />\nPlans<br />\nthe honor of being<br />\nSchool of Medicine will be housed<br />\nfive, was the<br />\nMary<br />\nand<br />\nat<br />\nWilliam<br />\nFriday<br />\nman team and the Frosh of Mt. St.<br />\nsimilar to that given last<br />\nthe new combination of royal blue varsity seals to be awarded during in the one new building.<br />\nteam'<br />\nlatter<br />\nthe<br />\nof<br />\ninability<br />\n-1141. The varsity game was finJose<br />\n• The Prince of Peace Church. The seeming<br />\nblue side strips oi the year were discussed, but none<br />\nroyal<br />\nand<br />\njerseys<br />\n.Research<br />\nTime after time the<br />\nished at 10:15 and then the Hopfront 01 adopted. However, the heads of<br />\nGlee Club, Banjo 'Club, Hawaiian to hit the net.<br />\nthe<br />\nAcross<br />\npants.<br />\na<br />\nblack<br />\ngives<br />\nDr.<br />\nIn<br />\nGoodnow<br />\naddition,<br />\nworked in for a shot with<br />\nTroupe, and Blue Jay Orchestra ball was<br />\nthe new jersey will be stitched large the activities were requested tn.use long list of research and investiga- kins courtmen had to rush for the<br />\nresult of a miss and the<br />\nusual<br />\nthere<br />\nthe<br />\naddition,<br />\nwill take a part. In<br />\nwhite letters forming the name of caution in nominating men for the tion carried on in all branches of the train, which was slated to leave at<br />\npossession of the Hopkins<br />\nUniversity. Research laboratories 11:00 o'clock. Taxis were chartered<br />\nwill be several solonumbers: Due ball in<br />\naward. The matter had been<br />\nour alma meter.<br />\nat the School of Medicine have pro- and a rush was made for the staof<br />\nmeeting<br />\nto the rain, the crowd at the last team.<br />\nlast<br />\nthe<br />\nat<br />\nup<br />\nThe freshmen will naturally come brought<br />\ngressed steadily thanks to the genhonors for high<br />\ntion. After being misdirected, the<br />\nconcert was disappointing, but it is Debuskey shared<br />\ninto their own with the addition of the Student Activities Council and erosity of various friends of the<br />\nSilverman<br />\nwith<br />\nfinally reached its car and then<br />\nteam<br />\nthe<br />\nwere<br />\nto-day<br />\nsuggested<br />\nsuch<br />\nplans<br />\nhave<br />\nmade<br />\nwho<br />\nthe<br />\nexpected that the halls in Easton individual scoring<br />\nUniversity<br />\njerseys<br />\nthe honor of wearing the<br />\neach rolling up a<br />\nwork possible by their financial aid. had ten minutes to wait.<br />\n. Salisbury will be crowded dur- of the opposition,<br />\na,t1.4<br />\nstring men. result of the last meeting.<br />\nfirst<br />\nby<br />\ngraced<br />\nformerly<br />\nContinued on page 2, Cot 4<br />\ning the concerts.<br /><br />\nACTIVITIES COUNCIL HOLDS<br />\nMONTHLY MEETING<br /><br />\ni<br /><br />\nPrice 5 Cents<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 21, 1928<br /><br />\nVol. XXXIII, No. 23<br /><br />\n21, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER<br />\nHOPKINS DEFEATS W. &amp; M.<br />\nQUINT .<br />\nLNTER COLLEGIATE<br />\nPage 1. Col. 2<br />\nContinued p<br />\n1111MSBMUSMS<br />\nthirteen count. Each also shared in- NEWS<br />\nvidual honors in their flour games.<br />\nForms= MK<br />\nSilverman exercised a clever trick<br />\nIt stms to be the vogue now to<br />\nSUS<br />\ndouSubserirtice.<br />\n_ font agreements between the two_ of feinting a pass and then<br />\nhis<br />\ndeadly TivIA:. ealeges na order to in- bling around to dribble past<br />\nEntered as second-class matter December S. ISM, at the Postaitie<br />\nLight<br />\nBaltumore, Mc._ under io of Congress November S. 11119.<br />\nsUre the wier.3 of the University guard ior a. pot-sbot at the net.<br />\nLa- played a nice game. at guard, but<br />\nPublished tiessi-vreeky frolic October to Jake by the students of Johns onus. Lehigh University and<br />\nwork<br />\nHopkins University.<br />\nfayette College have _formed such orie 'which hardly equaled the<br />\nand Col- of the star forward.<br />\nTaie<br />\ny<br />\nSag,erehr‘...<br />\nBus-rem cossaratscatvcoss stootild be addressed to the Bra-Noss WAXACRR<br />\nlike<br />\nJokes Hcnksis Uarvennty. All arucles slimed be sent to the MaNstaass gate - are trying to come to a<br />\nDe-buskey's biggest threat was his<br />\nMarcia, otter crammaioatious to the Ehnits-mt-Cmair.<br />\nagree:rim:: othm• ccilkge are also characteristic m ner of eluding his<br />\nw•ing.Peñsaps Heck* and guard by a quick e step to take a<br />\ntr.:sweaty 0100<br />\nTelephoto<br />\n: John's could follow suit_<br />\ns successful.<br />\n-11c•-• Husually<br />\nIn the recently. published educashowed - up<br />\nLang<br />\nand<br />\nTasarew<br />\nEDfTOIRIAL DETA1111111INT<br />\ntional ,threctorr,lgs..-itten out by the<br />\nand helped by<br />\ngaine.S.<br />\ntheir<br />\nwell<br />\nin<br />\nBureau of Educan'on, Ccaumbiz<br />\nEdita-asi-Cluief<br />\n:ling. who hit the pet four times.<br />\nGOMM E. Rarrits, Ja..<br />\nUniversity is recognized as the litoffensive.<br />\nwiti- performed well on the<br />\ncountry<br />\nthe<br />\nin<br />\ntahlrersity<br />\nzest<br />\nMamartag<br />\nAsssstoat<br />\nEdits<br />\nNanasia,<br />\nLine-up:<br />\nGinmor Grxr,<br />\n35.410:,rietralicns M the student body<br />\nPUMP W. Nam \"SS<br />\ntf-illiain and Mary<br />\nPle-s of the factilt-_,<br />\nand 1.;30 cue,<br />\nHopkins<br />\n7<br />\n,<br />\nA stoma:, Edit4<br />\nSilverman<br />\nRiess= H Woos. \"211<br />\ncif the coliegei<br />\nF<br />\nThe stnall<br />\nPasarew<br />\nWampum H Demo.. '29<br />\nRoman, S &amp;inc.. '3C<br />\nSauerbrtm<br />\nBuena Vista College_ with<br />\nButler<br />\n•<br />\nSdhsors<br />\ndents and 16 members of the facLight<br />\nW Pu,ott HAL :r31<br />\nulty.. Harvard, dating from 163.<br />\nPaesj t. Sarta... 'SO<br />\nE Foster TwireL'.<br />\nLworard B catty \"Mt<br />\nWinn<br />\nis the &amp;deg Univery:. Vsiatr<br />\nG<br />\n71<br />\nHunt,<br />\nG<br />\nRurard<br />\nH Garland Hershey.<br />\nHarwood F Iturark. Jr :1<br />\nand Mary. 16P3; Yale, Vol. rank<br />\nPS.*e 111- Spew. -At<br />\nGordo. TO<br />\nirring<br />\nGerert H<br />\nsecond arid third among the ea•rlies:<br />\nc<br />\n!warn r,aude, ee<br />\nRobe, F<br />\nestablished colleges..<br />\nBaltimore Hotel Uses<br />\nBUSINESS DEP ART-KENT<br />\nPre-cline= in the<br />\nHopkins Copy For Ad<br />\nis<br />\nItiamnoss M anac<br />\ncollege Students and<br />\nre,;.<br />\nThe Southern<br />\nRust 0 Scatosi,<br />\nthat<br />\nSclioeils<br />\nthe<br />\n(ti<br />\nsiroation.<br />\nthe nu<br />\nto adversotti<br />\nHopkins.<br />\nof<br />\nports<br />\nThe<br />\nare:<br />\nthere<br />\nYaeger<br />\nCieciskstSow<br />\nhave been dekoied.<br />\nA evertising Masager<br />\nL ROBERT IITISS.<br />\nUnfvers-UT of Chicag -,, Nar•th t-z.r.- rise :7.f- cafeteria. The. advertiseGamma X Gtramx. '29<br />\nAdverb:Wit<br />\nSte!<br />\n1.:Lna_ Start College: Ce Tech. ment in questi...-5n discusses the vieGlint Stiol<br />\n• H Elms, 'N<br />\nTheodore A Fleishman ti<br />\nSesianee 1..-niversiry, Culver Nfiliof the freshmen over the sophGas Burke. 11<br />\nRandolph Rothe...Md. '7;<br />\ntGeoretH Robertoor. 7;<br />\nuiry. Acadmny and Unis-i•isit:i<br />\nLeroy Sur.: '51<br />\nclass rush.<br />\nin the<br />\nRare,:<br />\nS.tdrocy<br />\n:arntosat.<br />\nJobr A<br />\n3,1isouri. Rumors are that.<br />\nDavid S Sykes. 72<br />\npride of the freshmen<br />\nF Gana,'70<br />\nthe<br />\nf<br />\nspeaks<br />\nget<br />\ncivic_ Colgate_ Cornet'. and<br />\nin - their vict',ry, and ;,1 the strength<br />\n- are<br />\nFil:A..e,<br />\nStaff Photographer<br />\nWALTER Tt P.,-11E;DT, 31<br />\nf the intirl,ers -f the class. Good<br />\nTht<br />\n•<br />\nresp,nsilile for<br />\nT:7 Lht 77:2.<br />\nthe ttaC:<br />\n•urse. they sa-Produced by The Read-Taylor Gran nary. Lombard and Sorit<br />\nBaltimore.<br />\nth,<br /><br />\ntETTER<br /><br />\nr<br /><br />\nGift Suggestions<br />\nfor last-minute Shoppers<br />\n-- at the store for Men and Boys<br /><br />\n$5 to $25<br />\n$2 to $10<br />\n$1.95 to $12.50<br />\n$1 to $6<br />\n$.50 to $7.50<br />\n$1.95 to $12.50<br /><br />\nRobes<br />\nShirts.<br />\nMufflers<br />\nNeckwear<br />\nCuff Links<br />\nHalf Hose<br /><br />\nIsaac Hamburger<br />\n&amp; Sons<br />\nY. M. B. O. D.<br /><br />\nBaltimore at Hanover Sts.<br /><br />\nSmart Collegians Are NVearing<br />\nTHE TRENCH COAT. $12.50<br />\nA -lightweight, putty-colored, waterproofed coat that has plenty of<br />\n'7uolles<br />\ndash and swagger. Trimmed with leather bitters<br />\nThe newest thing out<br />\nSecond Floor<br /><br />\nSTF,WART CO<br /><br />\nEDITORIAL COMMENT<br /><br />\nAfter the Dance<br />\nTHE MERRY YULETIDE<br />\nspirt: again rainriari: the<br />\nthe wyths.-al<br />\nllibreadth of Lmangron Street we. feel duty bound<br />\niind<br />\nWr<br />\nour quavering salutation to the general chorus of iderr7.<br />\nthc<br />\nEven though'the jingling of the tin bells and the<br />\nspun<br />\ngreet verfaors are far fram the liwoccrood campus, the<br />\nis making 4tself manifest in deviot Wars. The Fenfuwirs With re<br />\n77i:<br />\n213.1.Tiabit 1711aTtlElEy. have asstried tent .parerto while away the fleetrig hours &amp;fore tasting this<br />\nthe faculty fired away With the :Lego:hail broads,4-gm:nes.<br />\ntes Dc<br />\nhowever. have us useful<br />\nThe hOlu-lay<br />\nlinqucht Stholars wh-a. &amp;uric the past three months. have turned ir<br />\npubboaum-.: a-ery itt preference to Erie:Isis-themes. ical have a<br />\nto retrieve lost ground Thaw who have visited the<br />\nthe<br />\npalaces instead ci the -lecture halls and thaw who have EitTed<br />\nEvening Pc\npages of the Semi<br />\nbtica,wlaave an equal opportunity to rn•n3rr<br />\nbnum<br />\nthe. I' Meanwhile. zanerencrem: ktils. in the aripicn<br />\n:<br />\nOffice authcrui, arc isnaant<br />\nliverung Smile.: and inampuls-ing the<br />\nmail stoats.<br />\nhowever. will pithahly spend the<br />\nThe masonry of the<br />\nholidays in the conventional college fashion_ There will be the isvii,1<br />\ngulping of the cup that cheers and the triper.ang ci the light fan<br />\nLASTJC. In the meantime- the tad books will gather dug cm the shcIi<br />\nand the Irides= zewm will continue to shrfn.si the epos-ma Whm.<br />\nthe holiday as ovm. the English prafessar wir: lack it. ctnt far his<br />\n:: Show Intle '<br />\nfive rhousanc: wcr.:: :era paper and the siuoctit v.<br />\n31L.....-7\"C and MItor.<br />\n,<br />\nat-chiref itht.RE ShailL<br /><br />\nefT. REGIS<br />\n-<br /><br />\nLS S OF<br /><br />\nand Scientific:<br />\nIF, ST.<br /><br />\nCAB<br />\n\\s.'r k<br /><br />\nril0MHS &amp;<br /><br />\nde tilecticos of<br />\nlitE NEWS LETTER is pleased to moan=<br />\nof juoior<br />\nSidney Walk '.3C and Frank Cone '31 *,*he pookimo<br />\nand the drawn ti Stephen Fi=ccralil 31 go Claimuseas<br /><br />\nMEANS OF TRANSPORTATION<br /><br />\nEvans<br /><br />\nPrinti*<br />\n1<br /><br />\nUNITED RAILWAYS &amp; ELECTRIC CO<br />\nOF BALTIMORE<br /><br />\nCoinpany<br />\nGuilford Avenue<br /><br />\n•Baltimore., Mi<br /><br />\nYELLOW<br /><br />\nVF7rter It,$)1<br /><br />\nCAB<br /><br />\n17 sav<br />\nMerry Xmaswith same Gift<br /><br />\nSte Al<br /><br />\nP.::)eri Frank Skutch<br />\nARTS<br />\nDECORATIONS<br /><br />\niireproof<br /><br />\nBONAIRANDERBILT Hotel,<br />\n113 at .4u;a.\"/U.<br />\nrS F. Storm.,<br /><br />\nat-<br /><br />\n- -,i.11.4,.,.<br /><br />\nL<br /><br />\nTHE MOST ECONOMICAL<br /><br />\n4.4ied las°<br />\n1<br />\n/<br />\nEsta.<br /><br />\nEdgeworth<br /><br />\ncdtfik-tme<br /><br />\nCort-,71c,tal<br /><br />\nnot,<br /><br />\nit ZirraCt- to light that amp trial‘d campus act..ite have<br />\nimportant events for the evening d February<br />\nheel<br />\nOn the night of Waslxingam's Bendiday, the baskethall ream is hooked<br />\nto clash with the Ursiversity d Maryland while the Musical Ciui<br />\nits<br />\niS sale..iu1sha to appear at the Maryland CasualtyVabilhouse in<br />\nNeither date .= be easily shifted without a great<br />\nhaw<br />\ndeal at settusson and inzorivervasze for all =lammed. The basketball has been 4-rey arranged and the Musical Club has posted<br />\nits ronsi payment for the use al the auditorium<br />\nA more carefui and general use of the Unrvm•sity COendat wit<br />\ncorillicx 4<br />\neivninwic all fume possisathy of such confusing<br /><br />\nCEVERAL years kez... the Registrars Officeer.iniishezi<br />\nb.\" University Calendar for the use of the college. According to<br />\nthe achcont„ the dates. ei a,.alecit contests. :amens.. 6mila= prammaan.c. dances and other Unmet-x-5- activities were to be ren-rded<br />\nwell to a....--varize. By such a system, it would be possible to avasd<br /><br />\nBALTIMORE<br /><br />\nRIDE THE STREET CARS<br />\nyET OW<br /><br />\nTAITIN &amp;<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nI rianiser to be bier: sera a hos: of<br />\nvery Ent irs,as. mostly\"highbrows<br />\n- modsaacs. shientons, er.. Gerseratr Christmas time they show their<br />\nrensembrante and at- teat wine some<br />\nlittle gift--a boa re caves, frMing<br />\ntourstet cf thing.<br />\ntwine' ,a book<br />\nWeE. jC':risMEolii roaty seerceci<br />\n!ion,=et you.<br />\nto rie..•.re<br />\nno communication<br />\nhes, •<br />\n.7.•ey kw* En widely<br />\n7. rountry, ao it<br />\non me or aryl...T. lmn came SPrettsdateee of<br />\n`- Edgescrti..7. _ ,<br />\nom-y<br />\na<br />\nwas<br />\nTbe sew:<br />\n. walnut, brass-....--innned tom but if I<br />\nknow- whit...To, the comma were<br />\nEdgetencr.h it. a hale prime in it.<br />\nJuet coincidence. pemana. but a<br />\nqueer one. Am no: at habitual<br />\ntanciker of EgicPWOTLE. so they serern't<br />\ncsteingto aty ogees! taste of mine.<br />\nLooks like a Consent:1B of opinion<br />\namong the highiron\"- or quae a<br />\nhatch of 'era—that-Eagrevorth is tiit<br />\n-mar cape,fir a gift.<br />\nstuf, the pt<br />\nSincerely yours.<br />\nF. A. Pim-pan-irk<br /><br />\nTStOINQNE<br /><br />\n1813-17 North Charles St. ,<br /><br />\nH FURST CO.<br /><br />\nLat.'s High<br /><br />\n-.:l<br />\ns<br /><br />\nN CHARLES STREET<br /><br />\nBALTIMORE •<br /><br />\nALBERT W. RHINE, INC.<br /><br />\nrotack<br /><br />\nsN IDKAL CHOlt.E<br />\n1:1111 THE CIIHISIM o HOLMAIr<br /><br />\nSnos,\"'<br />\nRK,%ist;i,l with vow relatives ana'friends to pass<br />\n• (hrmstniis l'ava(ion lies,. at this famous center<br />\nof sovial on.) sports setivitics in the -Suniv South-.<br />\n1'11,,hotel Ito* 100 delightful 1'510* a ills pri‘ate<br />\never%<br />\nromeniener for its guests. '5 ill glaf.t.E<br />\n/411111iitillg till !till betiviit of the<br />\nultra-s iolet rays, loss<br />\nlc:Witt-of the<br />\nTWO 114•1101,E I<br />\nGOCIF C01. HSI.\"'<br />\n(;t .1, .<br />\n(,, It A SS greens now en hells sireie% ten sod gdos Pee.\"-• A<br />\nmos-se...The Hill COisrse, Mr<br />\nwater svstent oa the<br />\ntier she seperrislen of lbotaltl eontpleht<br />\nlist) Comae sod the 1ale Coarse<br />\nfi‘vs, has now been lensliteneti insnees perfect tad ea all<br />\nto 5.1(5 551515 in.) elptippell with fairwess.<br />\ni. ansi INA'man viir•diial ,<br />\nthr....shoe,‘,....httet.<br />\n7 'Vt..-it s..• %wow..<br />\nI Itt-tonit FslItts•n<br /><br />\nA<br /><br />\nIS N Calvert St<br /><br />\nEngrre<br />\nPAINTS arid VARNISHES<br /><br />\nPeabody Book Shop<br />\nClark.<br /><br />\n...r.riee trok iello,•.,<br /><br />\nlawele<br /><br />\nAll NSA<br />\nlinatitastro<br />\nS.. ton<br /><br />\nGrade<br /><br />\nSmoking Tobacco<br /><br />\nrt.jr,<br /><br />\n!a<br />\n'<br /><br />\n• •<br /><br />\nMorzge-<br /><br />\nISIBEL OT. II 5.0. (133.140 III :se<br />\nit<br />\n05(4* III<br />\nmoms \"m.o.<br /><br />\nThe New Firrywoof<br />\ni si ‘NsliERLAIN-V ANIIERIIII<br />\nI HOTEL<br />\nitrril I, le,11 AI.<br /><br />\nI W4 ^h../ C.....14,1, 1 .<br /><br />\nnrv 1..4 .111 ,tott .4 irim•Ins law gweloilMlaft bog.<br />\n•<br />\n[<br />\n•' .. O. it 15, 1 rat 144.111<br />\nFItto.........,s Mod rad Saw*.\"<br />\nttlitts41 attn. Asstotsa Ras,11.4. Solon<br />\nColl<br />\niSt 1414=.46.1.........<br />\nPrainsnalbellotttao<br />\nsali bot.. 1 SA ..olt.<br />\nIs<br />\n.11,11111i<br />\n.<br />\nWaft ....nal<br />\nperk nA wg.......,•••41 limmlome<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 21, 192,S<br /><br />\nCA Weliable Tip<br />\nConcernin<br />\n.<br />\nYOUNG MEN'S FALL SUITS<br />\nIn the daily race of business and pleasure, a suit from the<br />\n. Hutzler Young Men's Shop will give you a substantial lead<br />\nright at the start.<br /><br />\n$29.50 to $59:50<br />\nTHIRD FLOOR, NORTH BUILDING<br /><br />\nHUTZLER 13FORIM (0;<br />\nHovrarCSaratoga and Clay Streets<br />\nTelephone CAlvert 1234<br /><br />\nCORONA<br /><br />\nTYPEWRITERS, ALL MAKES<br /><br />\nROYAL<br /><br />\nQM. W. LUCY &amp; CO.<br />\n104 WEST PAYETTE STREET<br />\nTelephone CAlvert 5902<br /><br />\nOldest and Largest Corona Dealers in State<br />\nUNDEWOOc<br /><br />\nHAMMOND<br /><br />\nAt Your Service 24 Hours a Day<br /><br />\ndrCayfloWer Cab Co.<br />\nINCORPORATED<br />\nI<br /><br />\n718 N. Charles Street<br /><br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br /><br />\nCOMPARE!<br />\nStand at Honiewood Fid1,1<br /><br />\nVErnon 4090<br /><br />\nHOmewood 8040-8041<br />\nYour clothes will always leave that neat appearance ern* will let us do your<br />\nct,EANING. DYEING. PRESSING AND REPAIRING<br />\nOne Trial Will Convince You<br /><br />\nPARISIAN TAILORING CO.<br />\n346. E. 13RD STREET<br />\nUniversity Parkway<br /><br />\ncorn,<br /><br />\nCA thOuAht of today-The season's styles in neckwear are the key to a man's<br />\ndress . . . they give that touch of personal effectiveness<br />\n-<br /><br />\n\"'The Store of Standard Values\"<br /><br />\nIvicPHtRSON'S<br />\nEstablished 1862<br /><br />\n11 East Baltimore Street<br /><br />\nThe MAY Co.<br />\nA Modern, Store—,<br />\nFor Modern,<br />\nYoung Men.,<br /><br />\nI<br /><br />\nHear Ye! Collegians—going home forth. holidays?<br />\nGet the gang together, put on the dog, and drive a<br />\nnew SAUNDERS SYSTEM car home. Five or more<br />\nover<br />\n/ can drives new SAUNDERS SYSTEM car home your<br />\nholidays for less than railroad fare. There's<br />\nthe<br />\n/<br />\nconveniand<br />\ncomfort<br />\nSAVING—and you get added<br />\nence, and complete independence. Ask us about our<br />\nlow long trip rates and complete estimates.<br /><br />\n11 E. North Avenue<br />\nVErnon 2704<br /><br />\nYour correspondent has been<br />\nfound guilty, his rollicking friends<br />\nand drunken companions tell him,<br />\nof violating a tradition, to wit, the<br />\ntradition against using names in this<br />\ncolumn. Holding high their hands<br />\nin holy horror they demand to know<br />\nwhat the NEws-LETTER in general<br />\nand this part of it in particular arc<br />\ncoming to. Names, they say, were<br />\nnever used before; let them there'<br />\nfore be never used again.<br />\nIn reply, the writer can only<br />\nshrug lightly two shoulders which<br />\nbear so many • of the world's cares<br />\nand ask with scorn and disgust,<br />\nwhat the hell. If tTaltions are<br />\nagainst the use of names, so much<br />\nthe worse for the traditions.<br />\nThere is in our, system of jurisprudence a very good—iedson for<br />\nfollowing precedents, for letting, as<br />\nwe say in Latin, \"the' decision<br />\nstand.\" Security in personal and<br />\nproperty rights demands such a policy; there is no such demand on the<br />\neditor of this column.<br /><br />\n3<br /><br />\nAN APPRECIATION<br />\n5, Charles Dickens,<br />\nParis, XVI.<br />\n6 December, 1928.<br />\nTo the Editor if the NEWS-LETTER.<br />\nDear Sir:<br />\nOne of my former students has<br />\nbeen good enough to send me the<br />\ntoo generous review of Never, Go<br />\nBack which appeared in the NewsLETTER of November 13th. I am<br />\nmore than touched by the friendly<br />\ntone of this notice and by the enthusiasm with which you write of<br />\nmy first novel. There is, however,<br />\none point which hurts a bit, if you<br />\ndon't mind my saying so, and that<br />\nis that your reviewer, who apparently knows me, should have made the<br />\nmistake of all the others and identified me with Francis Harper. The<br />\nbook is not an autobiography and<br />\nnone of the characters are portraits<br />\nof the author. Moreover, Oralia<br />\nis no place on earth that I know of<br />\nbut a combination of many places.<br />\nI make these remarks' because now<br />\nas in the past there has been too<br />\nmuch talk about the originals in my<br />\nstories and too little about the stories themselves. There is a certain<br />\nexcuse for this, even in the present<br />\nease, but there are excuses for almost everything. I should be very<br />\ngrateful to you if you would make<br />\nit clear to your readers that my novel is not a roman a clef.<br />\nWith many thanks I am<br />\nFaithfully yours,<br /><br />\nGEORGE BOAS.<br />\nOnly one thing moves your correspondent, and that is the wishes of Phone, VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nhis readers. If that great public<br />\nPossible to Ue\"<br />\nwhich he has served so long, so THE RELIABLE WEAVING CO.<br />\nBurns, Tears, Cuts and Mill<br />\nfaithfully, and so well, desires that Moth Holes,<br />\nDamages Made Perfect<br />\nnames be left out of this column not WE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nbecause a silly tradition is against<br />\nBaltimore, Md.<br />\nthem but because names are in themSelves distasteful, names will be left<br />\nout.<br />\nUnless and until a reasonable protest is heard, however, names will<br />\ncontinue on occasion to appear.<br />\nA use, we are delighted to announce. has been found at last for<br />\nthose mysterious green apples which<br />\nsometimes grace the dining hall. Of<br />\nsmall value its the metabolic process,<br />\nthey may nevertheless he used effectively as hand grenades, missiles,<br />\nand billets doux. and this week they<br />\nwere.<br />\nHere it was nearly Christmas,<br />\nand,the boys from the Far North<br />\n(New York and Boston)'Were missing the old snow bottles; the boys<br />\nfrom the Far West (Los Angeles)<br />\nwere still finding fault with the climate but are willing to see some<br />\nsnow; aud the others were ready for<br />\naction.<br />\nAt first- the apples were -just<br />\ntossed about in a mild game of<br />\ncatch. Then the pace grew gradually swifter, the aims rapidly less<br />\naccurate, the casualties quickly more<br />\nnumerous, reprisals initnediately the<br />\norder of the day.<br />\nAnd through all the fierce heat<br />\nof that bloody shambles rose and<br />\nfell .the haunting strains of the<br />\nAlumni Hall anthem, while somewhere a saxophone slowly wailed<br />\nthe opening bars of Auld Lang<br />\nSync.<br />\nThy baa-a-attered halls,<br />\nThy aaaappled walls,<br />\nWe'll chair-ish thee for aye.<br />\nSo send an aaappu11111<br />\nThrough the air<br />\nAnd smaaaack him innnnn<br />\nthe eye.<br />\nTouching.<br />\nA noble sport, you say? Wait,<br />\nbrother, wait; you ain't seen nothin.<br />\nyet.<br />\nWhen a ,blanket of virgin snow<br />\nshall have transformed the Hall<br />\nquadrangle into a broad expanse of<br />\npurity, when an instinct as old as<br />\nthe race shall have brought forth<br />\nto battle the contingents of the several entries, when a spark shall have<br />\ninflamed the gathering and awakened primordial impulses, then shall<br />\nyou see action.<br />\nUntil then, hold your breath.<br /><br />\nZUG<br /><br />\nBrown. Zug-Grain<br />\nA sturdy new shoe for young men with a<br />\ngenerous measure of style . . . and priced to<br />\nfit a Scotchman's purse.<br /><br />\nAN<br /><br />\n111 E. Baltimore<br /><br />\n19 Lexington<br /><br />\nWhen 'Better Used Cars Are Sold<br />\nOCeill Will Sell Them<br />\nHopkins Students have a selection<br />\nof practically all standard<br />\nmakes and models<br />\n$100 to $1,000<br /><br />\nI<br /><br />\nII<br /><br />\nTHE NEILL BUICK COMPANY<br />\nt<br />\ni<br /><br />\nSales &amp;<br />\nServic50<br />\nWest 26th<br />\nStreet<br /><br />\nNew and Used Car Departments<br />\nMount Royal 6' Maryland Avenues<br />\n107 Mount Royal Ave.<br /><br />\nYe cPegk,y Stewart Grill<br />\nBREAKFAST<br /><br />\n-•<br /><br />\nLUNCHEON<br /><br />\n•-<br /><br />\nDINNER<br /><br />\nPrivate Rooms for Special Parties<br />\nDELICIOUS FOOD AT MODERATE PRICES<br /><br />\n23 WEST SARATOGA ST.<br /><br />\nSe<br /><br />\nA pencil put Peary on top<br />\nof the world<br />\nnTHER explorers had great personal<br /><br />\nthe next day's progress to the Pole.<br />\ncourage,unlimited energy and vision<br />\nTo face each day's reckoning as if it<br />\nuntrammelled;and failed. But Peary had 1 were the most important of all days is<br />\none thing more.<br />\ncharacteristic of men in the telephone<br />\nHe had the grasp of every detail<br />\nindustry. That viewpoint, expressed in<br />\nthe varied terms of applied science,lab—aS seen in the care which guided<br />\nthe pencil in his frost-cramped hand.<br />\noratory research, financing and manAfter each day's march he calculated<br />\nagement,guides Bell System men in their<br />\na methodical course to make sure of<br />\nrespective fields of public service.<br /><br />\nBELL SYSTEM<br />\ntif cosies-wide system of I8,soo,000 inter-eonneeting telephones<br /><br />\n\"OUR PIONEERING<br /><br />\nWORK HAS JUST BEGUN'<br /><br />\n1928<br />\nTHE JOHNS HOPEINS FIENS-LETT1ER„ DECIONSER 21,<br /><br />\nadorns Discussed<br /><br />\na TresAt 0. D. L. Jleetiag<br />\n:_e<br />\na ft=r,,g<br />\nI _tram=<br />\n5:ocaet-i.<br />\n•<br /><br />\nDAL MIAMI SAY&amp;<br />\nWS the Ina tame be has .a:*;<br />\nhoots, but be has be<br />\nmice,by the lam of<br /><br />\nOUTSTANDING CHEVROLET<br />\nTHE<br />\nHISTORY<br />\nOF CHEVROLET<br />\n.<br /><br />\n_-<br /><br />\n-<br /><br />\n8<br /><br />\nSi= 0:2,,,*<br />\nAL7:1-:as<br /><br />\nVol.<br /><br />\nSOUTHERN HOTEL<br /><br />\n-<br /><br />\nBAR<br />\nRE<br /><br />\nIF NOT<br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\nN. HESS* SONS<br /><br />\nSee It December 29th<br />\nFLOOR<br />\nGN OUR DISPLAY<br /><br />\n-<br /><br />\ntet-_<br /><br />\n_<br />\n-<br /><br />\n•,7c.s<br /><br />\na i<br /><br />\n7.1<br /><br />\n-<br /><br />\na<br /><br />\nMini<br /><br />\nPREFERRED DELIVERY<br />\nYOUR ORDER NOW FOR<br /><br />\nSales Co.<br />\nJones Chevrolet<br />\nmir. Come+<br /><br />\nST1<br /><br />\n544,th<br /><br />\n-<br /><br />\nfaculty an::<br /><br />\nDID YOU SEE<br /><br />\nGradassie Sorority<br />\nfields Election:.<br />\n-<br /><br />\n▪a<br />\na<br />\na<br />\na<br />\na<br />\naa<br />\na<br /><br />\nN. HESS' SONS<br />\nE BALTIRCRI S.711.127<br /><br />\nST<br />\n3 YAL AVE and McMECHEN<br />\nMT :<br />\nMAdi.,n 5<br /><br />\n,<br />\n- -_<br />\n• -- Ln- --t<br />\n_<br />\n• _<br /><br />\nmore<br />\n- an am<br /><br />\nident<br />\nganiza<br />\nary, tl<br />\nular<br />\n:to syut<br />\nthe pl;-.<br /><br />\n•e•<br /><br />\na 'Soda<br /><br />\n•<br /><br />\nT\\ I ei<br />\nClub •<br /><br />\n-<br /><br />\n\"Taking his<br />\nmeasure..<br /><br />\nf<br />\nj<br /><br />\nNOSE<br />\n—<br /><br />\nBiG<br /><br />\n\\<br /><br />\nezd<br /><br />\nGood<br /><br />\n-<br /><br />\nAll the<br />\nworld is<br />\n\"Taking<br />\nh i $ messure.- But he'll pass<br />\nwith colors flying! For<br />\nhe had us take his<br />\nmeasure first, for a<br />\nStetson D Suit. And<br />\nreally fine clothes are<br />\nsuch a big asset.<br /><br />\nSANDWICH -SHOPS \\<br />\n2.1 E<br /><br />\n'...7,11470111E SEREET<br /><br />\n_7<br /><br />\n-<br /><br />\n&amp;LICK J_VD BLUE<br />\nSHOCK LZ 17.577711E OBSERIIR<br /><br />\nTHE SILVERNLAN<br /><br />\n. •<br /><br />\n--<br /><br />\nDov<br />\nlast y<br />\ndrawn<br />\nbe los<br />\nstorm(<br />\npion,<br />\nSite in<br /><br />\nS9950 $3450<br /><br />\npected<br />\n\"Haw<br /><br />\nCly(<br /><br />\n-<br /><br />\nd:R=et--<br /><br />\n-<br /><br />\n11VM =V!<br /><br />\nger, a<br />\n. carpet<br />\nmedial<br />\n. three<br />\ntwo in<br />\nthe ac<br />\nin a g<br />\nhotel 1<br /><br />\n,<br /><br />\nRE Mut<br />\nCON CiltitS. mtist<br /><br />\n_17<br /><br />\nL<br />\nt<br /><br />\n'-<br /><br />\nDANCE and EAT<br /><br />\n•:'±lane<br />\n-th of<br />\nas,<br /><br />\n(Open 10..34l A. 34 wer..:<br />\nCELVILCIE<br />\n-GUS scants tc, see rot-<br /><br />\n$13 N. angles St_<br /><br />\nif:x=6y tie<br /><br />\n,<br /><br />\nCLOTHES ,FOR COLLEGE MEN<br />\nMAOE FOR YOU<br /><br />\n-<br /><br />\nbeer<br />\nLass.<br /><br />\n4 N. Howard St.<br /><br />\n•<br /><br />\n-<br /><br />\nThe<br />\nsideral<br />\nyear tl<br />\nstage,<br />\nBanks<br />\nbuilt t<br />\nthe 1,<br />\nexpect<br />\nprofile<br />\n,scenic<br /><br />\n--ver SImp:Te•<br /><br />\nSAMUEL KIRK &amp; SON, INC.<br />\n;<br /><br />\n421<br /><br />\nT.NTERCOLLEGIATE NEV•15<br /><br />\nIialtimore, NCI<br /><br />\nNorth Charles<br /><br />\n-GOLD ,TEWEIRY<br />\nDIAMONDS<br />\nSILVERWARE<br /><br />\nthe vs<br />\nas an<br />\ni&gt;ut th<br />\nSi;<br />\ncents<br />\nThis':<br /><br />\nt<br /><br />\n712.<br /><br />\ntremel<br />\nmerou<br />\ncostly<br />\nfact it<br />\ngage<br />\npromi<br />\nthan<br /><br />\nTHE WONDER MOTOR FUEL<br /><br />\n-<br /><br />\nE.(BACON<br /><br />\narc the le.vrtable at.ce occEiege ,e11<br />\nIthar w.r—a- sxeec:<br /><br />\nAcc<br /><br />\niiiittie<br />\nST. PAUL anj 31st STREET<br /><br />\n(huts<br />\nconsii.<br />\nward<br /><br />\nThe Drug Store<br />\n3E7F. AV!. :V....J.1_1:• 7<br /><br />\nI<br /><br />\nN.9<br /><br />\nE<br /><br />\nThurs<br />\ncustot<br />\nThis<br /><br />\nWith a ReptadtionEstablIshed<br /><br />\nYcars<br /><br />\norder.<br />\nlate ol<br />\nbeen<br /><br />\nNaturally<br /><br />\nHave You. Ever ,<br />\nWalked Home?<br />\ndi;ga.4-1vam have<br />\nman wart<br />\nDm': let<br /><br />\nhappm<br /><br />\nma:7.<br /><br />\nSmut:<br />\nThe Only Place Ar.<br /><br />\nTlsere is pride .1.p2tErig your<br />\non a gift from<br />\nshop,'<br /><br />\nTHANAN<br /><br />\nDINE and DANCE<br /><br />\ncriT<br /><br />\nBertram S. Berney<br /><br />\n0<br />\nL<br />\nD<br />\nE<br />\nN<br /><br />\nFor Sweaters, Trench Coats, 54-;...- .sers. Sportm4 Goods,<br />\nOutiina, head<br />\nArmy Uniforms and Sat-plies_ also Aa.a<br />\nlrotar airship and land at the<br /><br />\ni'<br />\nH<br />\nE<br />\nA<br /><br />\n111E GIANT<br />\nPOWER RIM<br /><br />\nESSO<br /><br />\n4<br /><br />\nA<br /><br />\nOUTING SUPPLY CORPORATION<br />\n• Norris Lbe-es Sc-e<br /><br />\nIi<br /><br />\nS1HCES<br />\n10\"4<br /><br />\nBlack<br /><br />\nan Scotch Grain<br />\nurr<br />\nNACToRs<br /><br />\nSTANDARD\" MOTOR OIL<br /><br />\nMusic Excellent<br />\nFood Delicious<br />\nPrice'Reasonable<br /><br />\n4<br /><br />\nclub t<br /><br />\nforated toe. haft the<br />\nshot for the Coitlaiv<br /><br />\ngram<br /><br />\nMan.<br /><br />\nSTANDARD OIL COMPANY OF N. j.<br /><br />\n110 N. LIBERTY ST<br />\n(dor to Park Avioue)<br /><br />\nEn<br /><br />\nThe latest in heavy<br />\nScotch Grain with per-<br /><br />\nOpen 1(A. M. to 1.30 A M<br /><br />\nThe Meguare of CM Value<br /><br />\nTh(<br />\nthe sc<br />\nhall h<br />\ndance<br />\nlarger<br />\nflier,<br />\n• the se<br />\nond II<br />\ntion's<br />\nfor th<br />\nof th<br />\nland<br />\nPythi<br />\nin dc<br />\nand v<br />\nstorm<br /><br />\npatro<br /><br />\n' Th<br /><br />\n\"on<br /><br />\n'Ha's<br /><br />\nr324 N.C11A1(LISST<br /><br />\nNew<br /><br />"}], "field_media_file": [{"target_id": 38322, "display": null, "description": null, "target_type": "file", "target_uuid": "ffef70f3-9d2d-4ffe-93e2-ec197e1187a6", "url": "http://digital.library.jhu.edu/system/files/2022-03/13350-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13350, "target_type": "node", "target_uuid": "7a2a9967-4ae0-47c1-bffd-a0737e9b47a1", "url": "/node/13350"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9a790efa-6b67-4523-8f23-602e1f5f3992"}]}