{"mid": [{"value": 36651}], "uuid": [{"value": "05878e26-1b29-41a5-b3cb-7ce2c1de89c1"}], "vid": [{"value": 36651}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12960-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:07+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 6<br />\n<br />\nBALTIMORE, MD., OCTOBER 21, 1921<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBAND TO AFFILIATE WITH CROSS-COUNTRY SCHEDULE BLACK AND BLUE GRIDDERS<br />\nLACROSSE PROSPECTS<br />\n70,000 EUROPEAN STUDENTS<br />\nNEAR COMPLETION<br />\nFINE<br />\nR. O. T. C.<br />\nTO CLASH ON FOREIGN<br />\nRECEIVED AID IN<br />\n1920-1921<br />\nSOIL<br />\nMusicians to Be Outfitted by the<br />\nNumber of Promising Candidates<br />\nMany Experienced Men Among Fresh.<br />\nWork of World's Student Christian<br />\nFederation Extended Over 11 Countries. $480,000 Contributed by<br />\nAmerican Students. -<br />\n<br />\n‘.<br />\n<br />\nICES<br />\n<br />\nvery<br />\n<br />\nlast<br />\nyes!---<br />\n<br />\nct<br />\n<br />\nts<br />\n<br />\nLS<br />\n<br />\nir<br />\n<br />\nFairly Large Squad Already Out and<br />\nMore Expected After Football.<br />\n<br />\nGovernment.<br />\n<br />\nWorking Out Under Le Cato.<br />\n<br />\nVirginia<br />\n<br />\nHas<br />\n<br />\nStrong<br />\n<br />\nAggregation.<br />\n<br />\nNeither Team Has Been Defeated.<br />\nThe Cross-Country squad has<br />\nAt the regular band rehearsal in<br />\nForty-five candidates for the la- the Barn on Monday afternoon, been greatly handicapped this<br />\nProbable line-up for tomorrow's<br />\ncrosse team reported last Monday Major Garey addressed the organi- year by a late start and lack of exgame<br />\n:<br />\nDur'ng 1920-21, through the for the initial practice. Seven were zation and presented for its ap- perienced material, but the team<br />\nagency of the World's Student members of last year's varsity proval a most attractive proposition is now beginning to shape up. Al- VIRGINIA.<br />\nJ. H. U.<br />\nL E<br />\nMiddleton<br />\nChristian Federation, the students squad, and many of the new men which, should it materialize, is sure though Coach Le Cato has about Davis<br />\nL T<br />\nWesterman<br />\nof twenty-six countries extended have had experience on prep school to have a far-reaching effect upon 23 men out every afternoon, many Shackelford<br />\nHall<br />\nL G<br />\nMagill<br />\nrelief to their fellow-students of teams. Many more candidates are the future development of the Hop- of them are very inexperienced Hankins<br />\nC<br />\nTotterdale<br />\neleven less fortunate countries. expected to come out this week, and kins Band. The plan has as its aim and several old ones are barred Fenwick<br />\nR G<br />\nLandy<br />\nThese operations touched 70,000 it is believed that several additional the betterment of the R. 0. T. C. by the black list. With only a lit- Clark<br />\nR T<br />\nKnecht<br />\nR E<br />\nEuropean students in 120 uni- members of last year's team, some unit, as well as the development of tle over a week remaining before Michie<br />\nRich<br />\nWitt<br />\nQ<br />\nB<br />\nSpinneyBDarley<br />\nversities, with an enrollment of of whom are now playing football, the band into a fine, solid organiza- the first meet several places on the<br />\nBurge<br />\nL H<br />\n250,000 students. Approximately will report later.<br />\nteam still remain to be filled.<br />\ntion-100 per cent. Hopkins.<br />\nOppleman ...R.H .B<br />\nWillis<br />\n$480,000 was contributed by the<br />\nWith this experienced and promAs outlined by Major Garey, the<br />\nF B<br />\nCalkins<br />\nThe men who at present are Harris<br />\nstudents of America, other ising material at hand, great things idea embodies a 50-50 proposition showing<br />\nup best and seem to be in<br />\nThe Black and Blue will play its<br />\namounts by those of the remain- may be expected of the team this by which the band is to enroll in<br />\nline for the team are: Captain first game on foreign soil this seaing 25 countries. Due to the great season. Practically the same de- the R. 0. T. C. unit and function<br />\nSomerville, who last year finished son when it meets University of<br />\ndepreciation in value of European fense as last year is available.<br />\nas part of that organization; and in a close third to Booth and Craw- Virginia, at Charlottesville, tomorcurrencies, this sum was enorVeterans who reported Monday return is to receive uniforms and ford in the Middle Atlantic cham- row. As<br />\nneither team has been demously increased by the exchange are as follows: Routson, McDan- instruments from the Government.<br />\npionship mile run; Ridgely Ed- feated this season, the battle should<br />\nrates and its power made propor- iel, Bachman, Huey, Burnham, It will devote one R. 0. T. C. drill<br />\nwards, who holds the Hopkins prove a good one. Virginia has<br />\ntionately greater.<br />\nGriffiss, Zoller (captain), and period to rehearsing, and men not record for the half mile won in defeated<br />\nGeorge Washington UniIn many respects Europe was \"Dinty\" Moore, who was disabled desiring credit for their work in the<br />\nthe Middle Atlantic champion- versity, 28-0; Richmond College,<br />\nand still is in a terrible plight. In- early last- season by a dislocated unit will not be required to give<br />\nships last spring; Milligan, of 14-0, and Virginia Military Acadnumerable instances are recorded knee.<br />\nany further time to military duty. last year's cross country team; emy, 14-7.<br />\nIn these three wins<br />\nShowing the lack of sufficient<br />\nOthers who came out were Rush, On the other hand, those men al- Frank, another veteran, and Fen- straight<br />\nfootball<br />\nwas employed,<br />\nfood, fuel, clothing and other bare Wilson, Johnston, Buhrer, Cannon, ready enrolled in the military deton, a freshman. Cannon and Hols- very little open play being tried.<br />\nnecessities of life, as can be seen Bassin, Powell, G. B. Shriver, Pas- partment will merely be excused apple,<br />\nof last year's team, are also The team will outweigh Hopkins,<br />\nfrom the barest perusal of the sano, Jolson, Schucts, Taylor, from one drill every week<br />\nto attend doing good work. Verne Booth, both on the line and in the backdaily papers.<br />\nO'Connor, Donaldson, Martin, rehearsals. Participation of the, the crack former Delaware Col- field.<br />\nThe older students will recall Hess, M. Miller, Whitely, Hill, band in the military<br />\nceremonies lege distance man, will be ineligiBurge, at half-back, has proved<br />\nthe part which Hopkins played in Hooper, Hopkins, B. R. Smith, which<br />\nare held from time to time in ble for track until after the FebVirginia's star on the offensive thus<br />\nraising the necessary funds last Rudel, Ghent, Brewer, Wienefeld, the fall and spring will<br />\nconstitute' ruary exams. He falls under the<br />\nfar, having advanced the ball for a<br />\nYear and will be willing to re- Devors, Moehle, O'Donnell, Chor, a very<br />\nimportant function. The new ruling made last year which<br />\nmuch greater yardage than any<br />\nspond to the call again. They will Rogers, Speed, Harrison, Parkard, Major expressed the belief that<br />\nmen requires men from other colleges<br />\nremember that the students of the Lockwood, Trout and Bevan.<br />\nplaying in the band who for some to successfully pass the mid-year other carrier. Clark, at right tackle,<br />\ncountry were singled out in this<br />\nPositions are open for Freshman reason should care to remain out of examinations before participating is declared the star of the defense.<br />\nWork because no other org-aniza- managers, according to Assistant the R.<br />\nHis work at breaking up the op0. T. C. could, in some way, in athletics.<br />\nposing interference has been mastion, with the exception of the ex- Manager Collins. The position re- be fitted up with<br />\na uniform and take<br />\nManag-er Fortney has encoun- terful. In their three games, the<br />\ncellent services performed by the quires no athletic ability. Any part in the<br />\nceremonies.<br />\ntered much difficulty in trying to Virginians have resorted to a wholeFriends, had entered this partic- freshman desiring to qualify for<br />\nWhile answering questions at the<br />\narrange a schedule. Many colleges sale substitution of players in an<br />\nular field. It was and is a distinc- the honor is urged to report at once. close<br />\nof his 'talk, Major Carey was<br />\nare not having cross-country endeavor to keep fresh men in the<br />\ntively student work, undertaken<br />\nSticks will be issued to all can- asked to lay particular stress upon<br />\nteams this year and several that lineup. They can well afford to do<br />\nChristian<br />\nby the World's Student<br />\ndidates and, later on, complete the fact that the band under the<br />\nhad signed up for meets have lat- this; they have a reserve strength<br />\nFederation, of which the Y. M. C. equipment will be furnished.<br />\nnew regime would not lose its idener cancelled. However the tenta- almost equal to that of the first<br />\nA. is a branch.<br />\ntity as a college activity, but would<br />\ntive schedule is as follows:<br />\nIt is hard for us to realize in<br />\nteam. In their Richmond game,<br />\ncontinue playing at the games and<br />\nAmerica the tremendously impor- MANY OUT FOR BLACK AND BLUE being<br />\nwhich they won by but two touch28—J.<br />\nOct.<br />\nU.<br />\nH.<br />\nCrossvs.<br />\nregarded as the college band.<br />\ntant place occupied by students in<br />\ndowns,<br />\nJAY<br />\nthey substituted<br />\nCountry<br />\nClub<br />\nHopkins.<br />\nat<br />\nIt is merely going to give extra<br />\nmany other countries and their<br />\ntwelv,payrs.<br />\nA call for candidates for the Edi- service in return for Government<br />\nNov. 12—Middle States Champresent and future influence on torial Board of the Black and Blii(<br />\nHopkins has a two-fold reason in<br />\nsupport.<br />\npionship at Lafayette.<br />\nthe destinies of these nations. The Jay was issued on Tuesday and ww<br />\ndesiring<br />\nThe band voted unanimously to<br />\nto win: to keep up a perNov. 19—South Atlantic open<br />\nstudents of Europe wield an influ- answered with alacrity by a larg(<br />\nfect record for the season and to<br />\nsolidly support the new venture in amateur championships.<br />\nence with their governments such group of Freshmen.<br />\nDoubtless the hope of thereby furthering the<br />\nThanksgiving—South Atlantic revenge themselves for Virginia's<br />\nas has never been enjoyed by the urgent notice apropos<br />\nof Rub interests of their organization. DurIntercollegiate Championships at victory last year. The game will be<br />\nthose in America.<br />\nI, Freshmen Regulations, had mudl ing the discussion it was brought<br />\nthe stiffest to date for the visiting<br />\nHopkins.<br />\nIn view of this, it is obvious to do with the hearty response.<br />\nteam, as the boys from Charlottesout by Emil Smith that with the<br />\nthat the feeling of gratitude toAlthough this is not an ex- ville are expected<br />\nThe would-be jokesmiths an burden of buying instruments<br />\nto offer sterner<br />\nward the students of America will cartoonists<br />\ntremely<br />\nattractive schedule Man- opposition, even,<br />\nwere addressed by Law shifted to Uncle Sam's shoulders,<br />\nthan<br />\ndid Dickinbe a powerful instrument in pro- rence<br />\nB. Fenneman and Georg, the band could utilize its funds to ager Fortney is now trying to ar- son. However, Hopkins may land<br />\nmoting a better understanding be- Hardy, editor-in-chief and art edi<br />\nprocure college uniforms in time, range dual meets with other col- up there at just the psychological<br />\ntween nations. To a large extent,<br />\ntor, respectively. They describe( perhaps, to dazzle St. John's when leges and several other contests m ment, for the V. M. I. game, last<br />\nthe students of today will be the<br />\nthe policy of the magazine and to1( it comes to Baltimore for its an- may be added.<br />\nweek, was the big game of the year<br />\nnational leaders twenty and thir- of the plans for the coming year<br />\nThere is a wonderful chance of for both of the Virginia teams, and<br />\nnual contest.<br />\nty years from now, and as such<br />\nat the same time effering sugges<br />\nmaking the team open to any man our hosts' victory may cause us to<br />\nWill play an important part in intions for humorous articles an SOPHOMORES ADJUST ELECTION who has ability for long distance find them drunk with glory, overDIFFICULTIES<br />\nternational affairs. Whether they<br />\ndrawings.<br />\nrunning and Coach Le Cato is confident and a bit loose.<br />\nAt a re-election of the officers<br />\nfought with the Entente or the<br />\nSix numbers of the Jay will b(<br />\nvery anxious to have more men<br />\nIf, tomorrow, the Black and Blue<br />\nof the Sophomore Class held on<br />\nAllies, most of them were drafted forthcoming<br />\nthis year, as agains<br />\nout<br />\nfor the team. Cross country shows<br />\nWith little knowledge of what it<br />\nas great an improvement as<br />\nTuesday<br />\nin<br />\nthe<br />\nM.<br />\nE.<br />\nHall, Henry<br />\nfive last year. The first of thesc<br />\nwork is an ideal sport for fresh- it has<br />\neach<br />\nWas all about, have suffered as few the<br />\nCollard<br />\nsucceeding Saturday thus<br />\nwas<br />\nagain<br />\nselected as the men to<br />\n\"Greenhorn's\" number, pre<br />\nchoose as an activity, for far, the<br />\npresident.<br />\nbattle<br />\nThe<br />\nshould prove far from<br />\nAmericans have and are now<br />\nelections of Grace, no<br />\nby members of the staff dur<br />\nprevious experience is neces- a<br />\nstruggling against fearful odds to pared<br />\none-sided<br />\nvice<br />\npresident;<br />\naffair.<br />\nDummy, secreing the summer, has already gone t(<br />\nsary.<br />\ntary; G. M. Shriver, treasurer,<br />\nlead their countries in retracing<br />\nThe<br />\nDickinson contest was one<br />\npress and will appear very shortly<br />\nthe recent path. A contribution to<br />\nand Meyer and Barton, sergeantof the greatest seen on Homewood<br />\nThe coming issue, the first in whicl<br />\nVICTROLA FOR BARN<br />\nthe fund offers a splendid opporat-arms, were also sustained by<br />\nField for many a day. Close<br />\nthe eager contestants will be givet<br />\ntunity to show the spirit of the<br />\nthe class.<br />\nnumber<br />\nvictrola<br />\nand<br />\nA<br />\nof<br />\na<br />\nredthroughout, the game was at times<br />\nopportunity to prove their met<br />\nSportsman in helping the fellow au<br />\nA disagreement, which threat- ords will be placed in the Y. M. C. spectacular and<br />\nat all times excitappear about November 15<br />\ntie,<br />\nwill<br />\nwho is down, and ultimately betened temporarily to disrupt the A. reading room, on the second ing. With the<br />\n\"Changing<br />\nexception<br />\nthe<br />\nof a short<br />\nand<br />\ndepict<br />\nwill<br />\ntering the<br />\nunity of the Sophomore Class, floor of the Barn, next week, it was period in the third<br />\ncondition of the world<br />\nquarter,<br />\nthe home<br />\nTimes.\"<br />\nancl America.<br />\narose from the fact that it had announced yesterday.<br />\nteam showed its superiority connot been stipulated in the first<br />\nAs considerable expense has been stantly. The Red and White, as<br />\nCOTILLON<br />\nBOARD TO ARRANGE<br />\nelection whether the officers necessary for repairs to the machine promised, opened<br />\nup an unusual<br />\nTHE ONLY WAY<br />\nAFTER-GAME DANCES<br />\nshould be elected by a majority or and purchase of the records, it is aerial attack, which<br />\nproved only 50<br />\nThe future of the dances, which<br />\nLady Visitor—And what brought a plurality. When the election was requested that students using the per cent.<br />\nefficient. The five or six<br />\nit has<br />\nrun upon the plurality basis a victrola will take good care of it. which they<br />\nbeen noised about the Uni- you here, my good man?<br />\nmanipulated, however,<br />\nversity were to be given by the InConvict 534—Well, madam, my protest arose and it was decided<br />\nA number of current humorous, were real thrillers, one of them, a<br />\nter-Fraternity<br />\nBoard after all the father said when I was a boy that to hold a re-election, voting upon literary and informative magazines heave of 20 yards, being<br />\ncaught by<br />\nremaining<br />\nfootball games, seems he hoped I would marry beaiity and the leading candidate and the run- will be furnished for use in the Goeltz as he lay flat on the<br />\nground.<br />\nbrains and I wanted to please him. ner up.<br />\nContinued on page 4, col. 2<br />\nreading room.<br />\nContinued on page 2,<br />\ncol. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 21, 1921<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\nrun<br />\nthe present time, it is known as the<br />\nBLACK AND BLUE GRIDDERS TO with<br />\na sixty-five-yard<br />\nCLASH ON FOREIGN SOIL<br />\ntwinkled in turn, but for the most Wesley Club. Its fundamental obContinued from page 1, col. 5<br />\npart played with their mates as a ject is to promote Christian spirit.<br />\nMany prominent speakers are exto address the club throughpected<br />\nfumbtraits,<br />\nold<br />\nHopkins' two<br />\nyear.<br />\nthe<br />\nout<br />\nfourth<br />\nthe<br />\nbling and weakening in<br />\nabtheir<br />\nperiod, were noticeable by<br />\nsance. All in all the team showed<br />\nThe Episcopal Church of<br />\na vast improvement.<br />\nSt. Michael's and All Angels<br />\n<br />\nsingle machine.<br />\n$2.50 Hopkins attempt at this sort of play<br />\n<br />\nSubscription<br />\n<br />\nalso proved but 50 per cent, effi-<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at cient, but the one pass that worked<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\ncounted for six points and the game,<br />\n<br />\nPublished semi-weekly from October to June by the students of Johns<br />\n!.11c1 brought yells of joy from the<br />\nHopkins University.<br />\ncrowd that saw the leather<br />\nexcited<br />\nBusiness communications should be addressed to the BUSINESS MANother<br />\nand<br />\ncommunications<br />\narticles<br />\nthe arms of the expectant<br />\nall<br />\nin<br />\nnestle<br />\nUNIVERSITY;<br />\nHOPKINS<br />\nJOHNS<br />\nAGER,<br />\nshould be sent to the MANAGING EDITOR.<br />\n\"Happy.\"<br />\nHomewood 100<br />\nHopkins played more like a maTelephone<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\n<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nActing Managing Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI FRANK, JR., '22.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nchine than was believed possible.<br />\nThose stars, Magill, who blocked<br />\nthe kick; \"Happy,\" who picked up<br />\nthe ball and ran to within eleven<br />\nyards of goal, and who later scored<br />\nfrom a pass; and Willis, who<br />\nbrought the stands to their feet<br />\n<br />\nST. PAUL and TWENTIETH STS.<br />\nPREACHERS' CLUB TO<br />\nREORGANIZE<br />\n<br />\nThe Preachers' Club will meet<br />\nMonday, October 31, at the home<br />\nof H. M. P. Davidson. Many<br />\nchanges are to be proposed at this<br />\nmeeting. A new name for the organization is to be selected. At<br />\n<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 1 1 o'clock<br />\n\"The Poor Man's Market\"<br />\nEvening Service, 8 o'clock<br />\nMass Meeting at New Lyceum Theatre<br />\nSpecial Invitation to Hopkins Students<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., OCTOBER 21, 1921<br />\nA DEPLORABLE FACT<br />\nThe fact, as revealed in a letter to the Mail-bag this week, that<br />\ngroup of Hopkins men was forced to admit its<br />\nrepresentative<br />\na<br />\nMater\" song when called upon for same in<br />\n\"Alma<br />\nour<br />\nignorance of<br />\nthe presence of a number of other college men, is indeed deplorable.<br />\nThe \"Alma Mater\" song is generally the dearest possession of a college man. It is, as a rule, this song which leaves the most lasting<br />\nimpression on a graduate. When a number of old college chums get<br />\ntogether in after life it is not the \"rah, rah\" for them, but the spirited<br />\n\"Alma Mater\" which recalls the pleasant memories of the past.<br />\nIt should not be considered a duty to learn \"Veritas Vos Liberabit.\" It should be the desire of every man, from Freshman to<br />\nSenior, to learn this song as a matter of pride in his university. This<br />\nsong is printed on page three of the Handbook and thus should be<br />\neasily accessible to every one. It might also be well to practice it<br />\nat one of the assemblies.<br />\n<br />\nOUR BOTANICAL GARDENS<br />\nIt may be well to call to the attention of the new students and,<br />\nperhaps, even the older students, the opportunities, apparently wholly<br />\nneglected, that lie in the availability of the Johns Hopkins Botanical<br />\nGardens for pleasant and profitable personal research.<br />\nEven at this late season there, are curious plants, beautiful or<br />\nfantastical flowers, quaint specimens of shrubbery and strange water<br />\nplants in bloom, study of which will amply repay the student with<br />\nan idle half hour at his disposal. There are, for instance, cactus<br />\nplants, crimson dahlias, a weird lavender blossom from North China,<br />\nand plants with long, fuzzy white flower-spikes, with an unpronounceable name.<br />\nMany men seem to believe the gardens open only to students<br />\nof botany and allied sciences. Such, however, is not the case. The<br />\nwalks are free to all. A fellow's sweetheart, one of these pleasant<br />\nautumn afternoons, might not be averse to a stroll through the gardens.<br />\nOf course, it should not be necessary to call attention to the rule<br />\nthat visitors shall not handle or injure in any way any of the growing<br />\nthings.<br />\n<br />\nere's why<br />\n<br />\nCAMELS are<br />\n<br />\nthe quality ci arette<br />\nECAUSE we put the utmost quality into<br />\nthis one brand. Camels are as good as it's<br />\npossible for skill, money and lifelong knowledge<br />\nof fine tobaccos to make a cigarette.<br />\nNothing is too good for Camels. And bear<br />\nthis in mind! Everything is done to make<br />\nCamels the best cigarette it's possible to buy.<br />\nNothing is done simply for show.<br />\nTake the Camel package for instance. It's the<br />\nmost perfect packing science can devise to protect cigarettes and keep them fresh. Heavy<br />\npaper—secure foil wrapping—revenue stamp<br />\nto seal the fold and make the package air-tight.<br />\nBut there's nothing flashy about it. You'll find<br />\nno extra wrappers. No frills or furbelows.<br />\n<br />\nHELLO!<br />\n\"The most cheerful, the most friendly word in the English language is 'hello'. It has brightened life for countless numbers. When<br />\nspoken at the right time it has been the turning point towards happiness and prosperity. It has promoted many lifelong friendships<br />\nand brought its own rewards. It is the magic symbol that turns<br />\ngroups of men into one great brotherhood.<br />\nRealizing the great power of this word, the Student Council, last<br />\nyear, inaugurated a 'Hello' movement in which every Stevens man<br />\nwas asked to yell a hearty 'Hello!' to all the fellow Stevens men he<br />\nmet. It was hoped that such a movement would bring about a closer<br />\nunion of the Student Body, develop friendships, and promote a more<br />\nloyal, more active, and persistent college spirit. Needless to say, the<br />\nmovement was very successful. Last winter and spring, the results<br />\nwere evident in the way Stevens men greeted each other and in the<br />\nmore hospitable spirit that prevailed throughout the campus.\"<br />\nThus comments the \"Stute\" in an editorial.<br />\nA proposition was before the Hopkins Student Council last fall<br />\nto pass a Freshman regulation to the effect that \"Freshmen should<br />\nspeak to all Hopkins men on University grounds.\" This failed to<br />\ngo through as the Council thought that there was an opportunity for<br />\nunreasonable Sophomores to treat the Freshmen unjustly.<br />\nThere cannot be this objection, however, in making the movement voluntarily. The \"Stute\" commends it highly. Why shouldn't<br />\nit work at Hopkins? Start it going today and give every Hopkins<br />\nman you see a hearty \"Hello !\"<br />\n<br />\nSuch things do not improve the smoke any<br />\nmore than premiums or coupons. And remember<br />\n—you must pay their extra cost or get lowered<br />\nquality.<br />\nIf you want the smoothest, mellowest, mildest<br />\ncigarette you can imagine—and one entirely free<br />\nfrom cigaretty aftertaste,<br />\nIt's Camels for you.<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, Winston-Salem, N. C.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 21, 1921<br />\nthe<br />\nobrit.<br />\nexgh-<br />\n<br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br />\nBaltimore's Best Store<br />\n<br />\nHOCHSCHILD,KOHN 8C,Co.<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nor<br />\n<br />\nFidelity & Deposit Company<br />\nOF MARYLAND<br />\n1890<br />\n<br />\n1920<br />\n<br />\nitre<br />\n<br />\nents<br />\n<br />\nFIDELITY BONDS & BURGLARY INSURANCE<br />\nContract, Judicial—BONDS—Public Official, Depository<br />\nCHARLES ST. at LEXINGTON<br />\n<br />\nBaltimore, Md.<br />\n<br />\nEstablished 1863<br />\n<br />\nWhen you want the<br />\nreal thing in Sport<br />\nEquipment you think<br />\ninstinctively of<br />\n\"SPALDING\"<br />\n<br />\nHENRY SEIM & CO.<br />\nManufacturers, Importers & Dealers<br />\n<br />\nGLASS<br />\nPAINTS, OILS and VARNISHES<br />\nof Every Description<br />\n<br />\nAutomobile Glass a Specialty<br />\nA. G. SPALDING & BROS.<br />\n110 EAST BALTIMORE ST.<br />\n<br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br />\n<br />\nBaltimore, Md.<br />\n<br />\nHOWARD & FAYETTE STS.<br />\n<br />\nLunches, Cigars<br />\nCigarettes<br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br />\n<br />\nCollege and Fraternity Stationery<br />\nEanquet and Dance Cards, Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\n<br />\nNECKWEAR<br />\n<br />\nSHIRTS<br />\n<br />\n$8.00, made<br />\nAT<br />\nleather,<br />\ngrain<br />\nof<br />\nin tan or black,<br />\nwith square toe and<br />\nheavy perforations,<br />\nthis is an oxford<br />\nany college man<br />\ncan be proud of.<br />\nIn high shoe the<br />\nsame style is $8.50.<br />\n<br />\nLefranc & Ault<br />\n<br />\n11<br />\n<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nROSIERY<br />\n<br />\nCharles Street, 210 North<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nP_ress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nElkridge Farms Dairy<br />\nNeglige<br />\n$3.25 and $4.25<br />\n$5.25 and $6.25<br />\nSTRICTLY FRESH MILK<br />\nIniPorted Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\nProduced, Pasteurized and Bottled<br />\nShirts<br />\nin Howard County<br />\nAlso a Full Line of Men's<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\nHi—That's a nasty spill Jim just<br />\nIrate Passenger—Why don't you<br />\nPut your foot where it belongs?<br />\nhad.<br />\nLo—Zat so?<br />\nTough Guy — If I did you<br />\nHi—Yep, about a pint.—Tiger.<br />\nwouldn't sit down for a week.—<br />\nJester.<br />\nThe Infant Terrible—If I wasn't<br />\nFrat—We have a new dish washhere the young man would kiss you.<br />\ner at the house.<br />\nSister (horrified)—Yon impertiFrater--How so?<br />\nFrat—I've noticed the difference nent boy! Go away this instant.—<br />\nIn the finger prints.—Froth.<br />\nTar Baby.<br />\n<br />\n3<br />\n<br />\nA DEPLORABLE FACT<br />\n<br />\nTo the Editor of the NEWS-LETTER.<br />\nDEAR SIR: It is probable that if<br />\nall Hopkins students were requested<br />\nto sing their \"alma mater,\" ninety<br />\nper cent. would be forced to acknowledge that they did not know<br />\nit.<br />\nThis summer at Plattsburg, the<br />\nrepresentatives of the various colleges present stood up, doffed hats,<br />\nand amid an impressive silence, began their \"alma maters.\" College<br />\nafter college responded. Finally,<br />\nsomeone called upon Hopkins. The<br />\nHopkins delegation was forced to<br />\nadmit that they did not know theirs.<br />\nNo one said much, but in the attitude of the other college men we<br />\ncould feel the question: \"What<br />\nkind of a place is that, anyway?\"<br />\nIt is not as if Hopkins did not<br />\nhave an \"alma mater.\" She has,<br />\nand a beautiful one at that. This<br />\nhas, however, for some unascertained reason, fallen into discard. If<br />\nthe present one does not meet with<br />\napproval, why do not some of our<br />\nmusical geniuses compose another<br />\none? But by all means let the entire University learn some \"alma<br />\nmater\" at once and spare any further embarrassment to Hopkins<br />\nmen in that respect.<br />\nVery sincerely yours,<br />\nPLATTSBURG.<br />\n<br />\nClothes if Cusiort QuaLiiy.<br />\nIsLCharlesS reet__<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\n<br />\nLafayette Bank<br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE,President<br />\n<br />\nEDWIN W. ADAMS,Vice-Pres. & Cashier<br />\n<br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS-4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\nNovember 22, 1920<br />\nApril 28, 1921<br />\n$428,399.57<br />\nDecember 29, 1920<br />\n$112,418.77 May 18, 1921<br />\n549,051.33<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n657,092.61<br />\nTOTAL ASSETS AUGUST 31, 1921<br />\n$1,013,167.87<br />\n<br />\nMaryland Glass Corporation<br />\nBaltimore<br />\n<br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br />\nBlue and Light Green Glass Bottles.<br />\n<br />\nThe James R. Armiger Co.<br />\nJewelers and Silversmiths<br />\nBaltimore, Maryland<br />\n<br />\n310 N. Charles St.<br />\n<br />\nFRESHMEN SHOULD SAVE THEIR<br />\nPENNIES AND WEAR<br />\nCOTTON SOCKS<br />\n<br />\nEditor of the NEWS-LETTER.<br />\nDEAR SIR: There seems to be<br />\nconsiderable trouble about the<br />\nFreshmen wearing silk hose. The<br />\nrules in the Hand Book do not mention anything about this point. However, the Sophomores are trying to<br />\nadd this rule. A pretty lively argument started between the Freshmen<br />\nand Sophs on Friday, when several<br />\nSophs attempted to make a Freshman remove his silk socks. Now,<br />\nif it is the intention that the use of<br />\nsilk hosiery should be forbidden,<br />\nwouldn't it not be well to give a<br />\ndefinite ruling on the subject so<br />\nthat there may be no misunderstanding?<br />\nFRESII'MAN.<br />\nFRESHMEN IMPRESSIONS OF<br />\nCOLLEGE<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br />\n<br />\nIf an Accident Occurs<br />\nAnd Medicines and'Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br />\n<br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br />\n<br />\nFive freshmen, chosen at random, were asked this question •<br />\nWhat were your impressions of<br />\nSt. Paul 7855-7856<br />\nyour first day in college?<br />\nHere are the answers:<br />\nHomes Sold on Easy Terms<br />\nSUMMERS: I liked the broad, flat<br />\npaddles better than the short, sharp<br />\nones—they didn't make such a lasting impression.<br />\nANONYMOUS: I got the impression that the sophomores were too<br />\nROBERT SEFF<br />\nfresh—that the freshmen have the<br />\nReal Estate—Investments<br />\nweight, numbers and spirit to mop<br />\nup the campus with them when the<br />\nrushes come.<br />\nK. MILLER: Every man I met<br />\nhere seemed to be a MAN.<br />\nSOLD BY ALL GROCERS 231 Courtland Street Baltimore, Md.<br />\nPARKS: It seemed to me that<br />\neverybody knew everybody else, except myself, who knew nobody.<br />\nEstablished 1873<br />\nLIBERTY<br />\nPARSONS: I sensed a certain inA.<br />\nH.<br />\nFetting<br />\nMan'fg<br />\nJewelry<br />\nCo.<br />\ntangible spirit in the atmosphere of<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nthe college which cannot be defiRates to Hopkins Men<br />\nSpecial<br />\nGreek Letter Fraternity Jewelry<br />\nnitely interpreted, and which canHomewood 5205-W<br />\n213 N. LIBERTY ST., Baltimore, Md. 211 E. 25th St.<br />\nnot be grasped in one day.<br />\n<br />\nHE-NO<br />\nTEA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 21, 1921<br />\n<br />\n4<br />\n<br />\nUSHERS HANDLE CROWD<br />\nEFFICIENTLY<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n<br />\nATHLETIC GOSSIP<br />\n<br />\nBuck Glass Company<br />\n<br />\nLast Saturday was a big day<br />\nThe usher system conceived by for Hopkins men. With the vicGil Engel went into effect at last tory over Dickinson and MarySaturday's game and was univer- land's defeat at the hands of St.<br />\nsally declared to be a huge suc- Johns, all that was necessary for<br />\ncess. All persons holding reserved \"a perfect day\" was a Navy deseat tickets were met at the gate feat by Princeton.<br />\nby the head usher, Joe Zoller, and<br />\nThe coming game with St.<br />\ndirected to their respective sec- John's promises to be the big aftions, where they were seated by fair of the gridiron season for Balthe other ushers.<br />\ntimore. Both Hopkins and the AnEvery effort was made to care napolitans have shown class thus<br />\nfor the visitors' comfort and to far. The lads from the capitol have<br />\nimpress upon them the fact that bowled over two state title conthey were guests of the Universi- tenders in Maryland State and<br />\nty. The men on the committee Western Maryland, while the<br />\nwere careful to omit no courtesy Black and Blue has beaten Mt. St.<br />\nand in every way to show the true Mary's. Unless Western Maryspirit of hospitality of their \"Al- land trims us next Saturday or<br />\nma Mater in Dixie Land.\"<br />\nMt. St. Mary's defeats St. John's<br />\nThe members of the committee neither of which is likely the game<br />\nlole Assorted Chocolates<br />\nwho are all upper-classmen, wore at Homewood on November 11<br />\nJ. H. U. armbands as distinguish- will be for the state championship<br />\nAND<br />\ning insignia. It is expected, how- and will draw the usual ThanksLady Helen Chocolate Cherries in Cordial<br />\never, that in the future the ushers giving Day crowd.<br />\nwill adopt black sweaters or some<br />\nState meets Virginia Poly toother apparel as their official garb. morrow and should come out on<br />\nAt present it is planned to or- the long end of the score. State<br />\nganize an Ushers' Club and thus is a fallen idol, however, and is<br />\nAre standards in their respective class of delicious confections<br />\nperpetuate the system at Hopkins. likely to remain one for many<br />\nat popular prices.<br />\nA head usher or club president days to come. Not even a victory<br />\nwill be elected annually from the over Yale, the weakest member<br />\nmen on the reception committee. of the Big Three, would serve to<br />\nIn this way college interest will put her back on her pedestal. Yea,<br />\nbe directed toward it and the club verily, we repeat, \"You cannot<br />\nAsk Your Dealer for Them<br />\nwill grow into a recognized cam- fool all of the people all of the<br />\npus activity.<br />\ntime.\"<br />\nThose who officiated at HomeComparative scores are probwood Field on Saturday are Nor- ably bunk, but they're wonderful<br />\nwood, Russell, Collins, Hamburg, to think about, i.e., J. H. U. is one<br />\nBaltimore, Md.<br />\nWills, Hill, Stellman, Joesting, touchdown better than Dickinson.<br />\nGent, Kuder, Robinson, Shriver, Dickinson is four touchdowns<br />\nCallard, White, Leopold, Howard, weaker than Lafayette; Lafayette<br />\nHomer, Devoie, Matthews, Ken- is one better than Pitt. Pitt is one<br />\nCall Calvert 1718<br />\nNorman James, President<br />\nnedy and Jennifer.<br />\nFOR KEEN CUTTER HARDWARE<br />\nbetter than West Virginia. Which Geo. B. Hunting, Vice-President<br />\nWalter B. Wessels, Secretary-Treas.<br />\nLUCAS<br />\naccording to the Q. E. D. method, F. A. Ascherfeld, General Manager<br />\nLOST AND FOUND<br />\nMarine, Industrial, House<br />\nPAINTS<br />\nMore than one thousand ar- puts J. H. U. but one back of West<br />\nticles, ranging from fraternity Virginia. Next week we will enBUILDING LUMBER<br />\npins to trousers were recovered deavor to advance by the same<br />\nOffice and Yardsharmless<br />\nmethod<br />\nover<br />\nNavy.<br />\nlast year through the Lost and<br />\n<br />\nManufacturers of<br />\n<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br />\n<br />\nGLASS BOTTLES<br />\n<br />\nBaltimore<br />\n<br />\nv le)<br />\nLelAbeiCatterie<br />\n1-1.5, OSCAR GA...-. -If<br />\nOWNERS<br />\nE•C°44<br />\n7'itil<br />\n)<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\n!Lk<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nChocolate Products Company<br />\n<br />\nThe James Lumber Co.<br />\n<br />\nFound Bureau, established by the<br />\nProf. (after long-winded proof)<br />\nUniversity Y. M. C. A.<br />\n—And<br />\nnow we find that x equals o.<br />\nAny student losing or finding<br />\nSleepy<br />\nStude—Hell, all that work<br />\nanything of value in the building<br />\nfor<br />\nnothing<br />\n?—Siren.<br />\nor on the campus is asked to report his find to the Y. M. C. A.<br />\noffice in the Barn.<br />\nAmong the articles turned in<br />\nsince the opening of school are<br />\na bunch of keys and a ladies' blue<br />\nivory hairbrush.<br />\nJ. P. Stump,'23, is in charge of<br />\nthe bureau.<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nfpr<br />\nUNIVERSITY MEN<br />\nFor Sport Wear<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nModerate Prices<br />\n<br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br />\n<br />\nHe—What color is your body?<br />\nShe—Mine is pink.<br />\nHe—Mine is dark brown, I have<br />\njust had wire wheels put on it too.<br />\n—Voo Doo.<br />\n<br />\nsomewhat in doubt, at present. The<br />\nInter-Fraternity Board decided at<br />\nits meeting yesterday that it was<br />\nnot within its province to give<br />\ndances of this sort, but did not drop<br />\nthe idea entirely, agreeing to recommend to the Cotillon Board that<br />\nthey arrange to provide for the entertainments.<br />\nThe Cotillon Board has not as yet<br />\nacted on the suggestion of the<br />\nInter-Fraternity Board, but it is<br />\nalmost certain that they will undertake to give the dances. The plans,<br />\nhowever, are in a somewhat formative state and the final arrangements are still hanging fire.<br />\n<br />\nJudge—You have been found<br />\nguilty of petty larceny. What do \"Why did you put on your hat?\"<br />\nyou want, ten days or ten dollars? she asked.<br />\nGuilty Party — I'll take the<br />\nHe whistled softly, \"Chili Bean.\"<br />\nmoney.—Flamingo.<br />\n—Lampoon.<br />\n<br />\nBONDS<br />\n<br />\nENVELOPES<br />\n<br />\nLEDGERS<br />\n<br />\nLexington Paint &<br />\n<br />\nHardware Co.<br />\n<br />\n921 ALICEANNA ST., cor. Exeter<br />\nBaltimore, Md.<br />\n<br />\n609 W. LEXINGTON ST.<br />\n<br />\nChas. L. Cunningham & Co.<br />\n(Licensees)<br />\n<br />\nStewart Taxi Service Co.<br />\n<br />\n20-30 GARRISON LANE<br />\nNear Baltimore St.<br />\nMETAL WEATHER STRIPS<br />\nfor<br />\nWINDOWS and DOORS<br />\nPhones—C. & P., Long Distance<br />\n<br />\nCall<br />\n<br />\nMt. Vernon 11<br />\n<br />\nTaxi Cabs and Touring Cars<br />\n<br />\nKALLOTHENEION<br />\nAn Unusual Beauty Shop<br />\n<br />\nOur Exclusive Tailored Sport<br />\nBlouses a Specialty<br />\n<br />\nCOTILLION BOARD TO ARRANGE<br />\nAFTER-GAME DANCES<br />\nContinued from page I,col. I<br />\n<br />\nSHOES<br />\n<br />\nMaryland<br />\n<br />\nMade to Your Measurement<br />\n517 N. CHARLES ST.<br />\nBaltimore, Maryland<br />\n<br />\nUse MORGAN'S CARBOLATED<br />\nBABY POWDER for Chafing<br />\n<br />\nand Itching for Adults and<br />\nChildren.<br />\n<br />\nAccountancy<br />\nCOMPLIMENTS<br />\n<br />\nHoward W.Jackson<br />\n<br />\nSelection<br />\nWhen you choose from<br />\nour assortments of haberdashery or clothing,—you<br />\nchoose from a selection<br />\nthat has passed the highest<br />\nstandard of quality and<br />\ntaste before it is presented<br />\nfor your inspection.<br />\nAnd the prices are moderate!<br />\n<br />\nDemocratic Candidate<br />\nRegister of Wills<br />\n<br />\nDoes the C. P. A. degree, a career as a public accountant or tax<br />\nspecialist, an executive position<br />\nas Controller, Treasurer, Auditor<br />\nor Office Manager appeal to you?<br />\nPace courses, standardized and<br />\naccredited, available in evening<br />\nclasses, have for years afforded<br />\npreparation for professional Accountancy practice and for executive positions in business.<br />\n<br />\nBaltimore<br />\nPace institute<br />\nFALL CLASSES NOW FORMING<br />\nCall or Write for Bulletin<br />\nSt. Paul 1469<br />\n201-208 EQUITABLE BLDG.<br />\n<br />\nJ. Seth Hopkins-Mansfield Co.<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br />\n<br />\nTH E<br />\n<br />\nW. H. Moore, Jr., Paper Co.<br />\n205 W.CAMDEN STREET<br />\n<br />\nU1L1TY{mop<br />\n<br />\nCollar Hug Clothes<br />\ngait/more and Ne_ryStreets<br />\n<br />\nINIIII•111111•••••111 I<br />\n••••1111•101W•1111<br />\n<br />\nART GOODS<br />\nChina and Table Glassware<br />\n<br />\nCutlery, Kitchen Utensils<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 6<br /><br />\nBALTIMORE, MD., OCTOBER 21, 1921<br /><br />\nPRICE 5 CENTS<br /><br />\nBAND TO AFFILIATE WITH CROSS-COUNTRY SCHEDULE BLACK AND BLUE GRIDDERS<br />\nLACROSSE PROSPECTS<br />\n70,000 EUROPEAN STUDENTS<br />\nNEAR COMPLETION<br />\nFINE<br />\nR. O. T. C.<br />\nTO CLASH ON FOREIGN<br />\nRECEIVED AID IN<br />\n1920-1921<br />\nSOIL<br />\nMusicians to Be Outfitted by the<br />\nNumber of Promising Candidates<br />\nMany Experienced Men Among Fresh.<br />\nWork of World's Student Christian<br />\nFederation Extended Over 11 Countries. $480,000 Contributed by<br />\nAmerican Students. -<br /><br />\n‘.<br /><br />\nICES<br /><br />\nvery<br /><br />\nlast<br />\nyes!---<br /><br />\nct<br /><br />\nts<br /><br />\nLS<br /><br />\nir<br /><br />\nFairly Large Squad Already Out and<br />\nMore Expected After Football.<br /><br />\nGovernment.<br /><br />\nWorking Out Under Le Cato.<br /><br />\nVirginia<br /><br />\nHas<br /><br />\nStrong<br /><br />\nAggregation.<br /><br />\nNeither Team Has Been Defeated.<br />\nThe Cross-Country squad has<br />\nAt the regular band rehearsal in<br />\nForty-five candidates for the la- the Barn on Monday afternoon, been greatly handicapped this<br />\nProbable line-up for tomorrow's<br />\ncrosse team reported last Monday Major Garey addressed the organi- year by a late start and lack of exgame<br />\n:<br />\nDur'ng 1920-21, through the for the initial practice. Seven were zation and presented for its ap- perienced material, but the team<br />\nagency of the World's Student members of last year's varsity proval a most attractive proposition is now beginning to shape up. Al- VIRGINIA.<br />\nJ. H. U.<br />\nL E<br />\nMiddleton<br />\nChristian Federation, the students squad, and many of the new men which, should it materialize, is sure though Coach Le Cato has about Davis<br />\nL T<br />\nWesterman<br />\nof twenty-six countries extended have had experience on prep school to have a far-reaching effect upon 23 men out every afternoon, many Shackelford<br />\nHall<br />\nL G<br />\nMagill<br />\nrelief to their fellow-students of teams. Many more candidates are the future development of the Hop- of them are very inexperienced Hankins<br />\nC<br />\nTotterdale<br />\neleven less fortunate countries. expected to come out this week, and kins Band. The plan has as its aim and several old ones are barred Fenwick<br />\nR G<br />\nLandy<br />\nThese operations touched 70,000 it is believed that several additional the betterment of the R. 0. T. C. by the black list. With only a lit- Clark<br />\nR T<br />\nKnecht<br />\nR E<br />\nEuropean students in 120 uni- members of last year's team, some unit, as well as the development of tle over a week remaining before Michie<br />\nRich<br />\nWitt<br />\nQ<br />\nB<br />\nSpinneyBDarley<br />\nversities, with an enrollment of of whom are now playing football, the band into a fine, solid organiza- the first meet several places on the<br />\nBurge<br />\nL H<br />\n250,000 students. Approximately will report later.<br />\nteam still remain to be filled.<br />\ntion-100 per cent. Hopkins.<br />\nOppleman ...R.H .B<br />\nWillis<br />\n$480,000 was contributed by the<br />\nWith this experienced and promAs outlined by Major Garey, the<br />\nF B<br />\nCalkins<br />\nThe men who at present are Harris<br />\nstudents of America, other ising material at hand, great things idea embodies a 50-50 proposition showing<br />\nup best and seem to be in<br />\nThe Black and Blue will play its<br />\namounts by those of the remain- may be expected of the team this by which the band is to enroll in<br />\nline for the team are: Captain first game on foreign soil this seaing 25 countries. Due to the great season. Practically the same de- the R. 0. T. C. unit and function<br />\nSomerville, who last year finished son when it meets University of<br />\ndepreciation in value of European fense as last year is available.<br />\nas part of that organization; and in a close third to Booth and Craw- Virginia, at Charlottesville, tomorcurrencies, this sum was enorVeterans who reported Monday return is to receive uniforms and ford in the Middle Atlantic cham- row. As<br />\nneither team has been demously increased by the exchange are as follows: Routson, McDan- instruments from the Government.<br />\npionship mile run; Ridgely Ed- feated this season, the battle should<br />\nrates and its power made propor- iel, Bachman, Huey, Burnham, It will devote one R. 0. T. C. drill<br />\nwards, who holds the Hopkins prove a good one. Virginia has<br />\ntionately greater.<br />\nGriffiss, Zoller (captain), and period to rehearsing, and men not record for the half mile won in defeated<br />\nGeorge Washington UniIn many respects Europe was \"Dinty\" Moore, who was disabled desiring credit for their work in the<br />\nthe Middle Atlantic champion- versity, 28-0; Richmond College,<br />\nand still is in a terrible plight. In- early last- season by a dislocated unit will not be required to give<br />\nships last spring; Milligan, of 14-0, and Virginia Military Acadnumerable instances are recorded knee.<br />\nany further time to military duty. last year's cross country team; emy, 14-7.<br />\nIn these three wins<br />\nShowing the lack of sufficient<br />\nOthers who came out were Rush, On the other hand, those men al- Frank, another veteran, and Fen- straight<br />\nfootball<br />\nwas employed,<br />\nfood, fuel, clothing and other bare Wilson, Johnston, Buhrer, Cannon, ready enrolled in the military deton, a freshman. Cannon and Hols- very little open play being tried.<br />\nnecessities of life, as can be seen Bassin, Powell, G. B. Shriver, Pas- partment will merely be excused apple,<br />\nof last year's team, are also The team will outweigh Hopkins,<br />\nfrom the barest perusal of the sano, Jolson, Schucts, Taylor, from one drill every week<br />\nto attend doing good work. Verne Booth, both on the line and in the backdaily papers.<br />\nO'Connor, Donaldson, Martin, rehearsals. Participation of the, the crack former Delaware Col- field.<br />\nThe older students will recall Hess, M. Miller, Whitely, Hill, band in the military<br />\nceremonies lege distance man, will be ineligiBurge, at half-back, has proved<br />\nthe part which Hopkins played in Hooper, Hopkins, B. R. Smith, which<br />\nare held from time to time in ble for track until after the FebVirginia's star on the offensive thus<br />\nraising the necessary funds last Rudel, Ghent, Brewer, Wienefeld, the fall and spring will<br />\nconstitute' ruary exams. He falls under the<br />\nfar, having advanced the ball for a<br />\nYear and will be willing to re- Devors, Moehle, O'Donnell, Chor, a very<br />\nimportant function. The new ruling made last year which<br />\nmuch greater yardage than any<br />\nspond to the call again. They will Rogers, Speed, Harrison, Parkard, Major expressed the belief that<br />\nmen requires men from other colleges<br />\nremember that the students of the Lockwood, Trout and Bevan.<br />\nplaying in the band who for some to successfully pass the mid-year other carrier. Clark, at right tackle,<br />\ncountry were singled out in this<br />\nPositions are open for Freshman reason should care to remain out of examinations before participating is declared the star of the defense.<br />\nWork because no other org-aniza- managers, according to Assistant the R.<br />\nHis work at breaking up the op0. T. C. could, in some way, in athletics.<br />\nposing interference has been mastion, with the exception of the ex- Manager Collins. The position re- be fitted up with<br />\na uniform and take<br />\nManag-er Fortney has encoun- terful. In their three games, the<br />\ncellent services performed by the quires no athletic ability. Any part in the<br />\nceremonies.<br />\ntered much difficulty in trying to Virginians have resorted to a wholeFriends, had entered this partic- freshman desiring to qualify for<br />\nWhile answering questions at the<br />\narrange a schedule. Many colleges sale substitution of players in an<br />\nular field. It was and is a distinc- the honor is urged to report at once. close<br />\nof his 'talk, Major Carey was<br />\nare not having cross-country endeavor to keep fresh men in the<br />\ntively student work, undertaken<br />\nSticks will be issued to all can- asked to lay particular stress upon<br />\nteams this year and several that lineup. They can well afford to do<br />\nChristian<br />\nby the World's Student<br />\ndidates and, later on, complete the fact that the band under the<br />\nhad signed up for meets have lat- this; they have a reserve strength<br />\nFederation, of which the Y. M. C. equipment will be furnished.<br />\nnew regime would not lose its idener cancelled. However the tenta- almost equal to that of the first<br />\nA. is a branch.<br />\ntity as a college activity, but would<br />\ntive schedule is as follows:<br />\nIt is hard for us to realize in<br />\nteam. In their Richmond game,<br />\ncontinue playing at the games and<br />\nAmerica the tremendously impor- MANY OUT FOR BLACK AND BLUE being<br />\nwhich they won by but two touch28—J.<br />\nOct.<br />\nU.<br />\nH.<br />\nCrossvs.<br />\nregarded as the college band.<br />\ntant place occupied by students in<br />\ndowns,<br />\nJAY<br />\nthey substituted<br />\nCountry<br />\nClub<br />\nHopkins.<br />\nat<br />\nIt is merely going to give extra<br />\nmany other countries and their<br />\ntwelv,payrs.<br />\nA call for candidates for the Edi- service in return for Government<br />\nNov. 12—Middle States Champresent and future influence on torial Board of the Black and Blii(<br />\nHopkins has a two-fold reason in<br />\nsupport.<br />\npionship at Lafayette.<br />\nthe destinies of these nations. The Jay was issued on Tuesday and ww<br />\ndesiring<br />\nThe band voted unanimously to<br />\nto win: to keep up a perNov. 19—South Atlantic open<br />\nstudents of Europe wield an influ- answered with alacrity by a larg(<br />\nfect record for the season and to<br />\nsolidly support the new venture in amateur championships.<br />\nence with their governments such group of Freshmen.<br />\nDoubtless the hope of thereby furthering the<br />\nThanksgiving—South Atlantic revenge themselves for Virginia's<br />\nas has never been enjoyed by the urgent notice apropos<br />\nof Rub interests of their organization. DurIntercollegiate Championships at victory last year. The game will be<br />\nthose in America.<br />\nI, Freshmen Regulations, had mudl ing the discussion it was brought<br />\nthe stiffest to date for the visiting<br />\nHopkins.<br />\nIn view of this, it is obvious to do with the hearty response.<br />\nteam, as the boys from Charlottesout by Emil Smith that with the<br />\nthat the feeling of gratitude toAlthough this is not an ex- ville are expected<br />\nThe would-be jokesmiths an burden of buying instruments<br />\nto offer sterner<br />\nward the students of America will cartoonists<br />\ntremely<br />\nattractive schedule Man- opposition, even,<br />\nwere addressed by Law shifted to Uncle Sam's shoulders,<br />\nthan<br />\ndid Dickinbe a powerful instrument in pro- rence<br />\nB. Fenneman and Georg, the band could utilize its funds to ager Fortney is now trying to ar- son. However, Hopkins may land<br />\nmoting a better understanding be- Hardy, editor-in-chief and art edi<br />\nprocure college uniforms in time, range dual meets with other col- up there at just the psychological<br />\ntween nations. To a large extent,<br />\ntor, respectively. They describe( perhaps, to dazzle St. John's when leges and several other contests m ment, for the V. M. I. game, last<br />\nthe students of today will be the<br />\nthe policy of the magazine and to1( it comes to Baltimore for its an- may be added.<br />\nweek, was the big game of the year<br />\nnational leaders twenty and thir- of the plans for the coming year<br />\nThere is a wonderful chance of for both of the Virginia teams, and<br />\nnual contest.<br />\nty years from now, and as such<br />\nat the same time effering sugges<br />\nmaking the team open to any man our hosts' victory may cause us to<br />\nWill play an important part in intions for humorous articles an SOPHOMORES ADJUST ELECTION who has ability for long distance find them drunk with glory, overDIFFICULTIES<br />\nternational affairs. Whether they<br />\ndrawings.<br />\nrunning and Coach Le Cato is confident and a bit loose.<br />\nAt a re-election of the officers<br />\nfought with the Entente or the<br />\nSix numbers of the Jay will b(<br />\nvery anxious to have more men<br />\nIf, tomorrow, the Black and Blue<br />\nof the Sophomore Class held on<br />\nAllies, most of them were drafted forthcoming<br />\nthis year, as agains<br />\nout<br />\nfor the team. Cross country shows<br />\nWith little knowledge of what it<br />\nas great an improvement as<br />\nTuesday<br />\nin<br />\nthe<br />\nM.<br />\nE.<br />\nHall, Henry<br />\nfive last year. The first of thesc<br />\nwork is an ideal sport for fresh- it has<br />\neach<br />\nWas all about, have suffered as few the<br />\nCollard<br />\nsucceeding Saturday thus<br />\nwas<br />\nagain<br />\nselected as the men to<br />\n\"Greenhorn's\" number, pre<br />\nchoose as an activity, for far, the<br />\npresident.<br />\nbattle<br />\nThe<br />\nshould prove far from<br />\nAmericans have and are now<br />\nelections of Grace, no<br />\nby members of the staff dur<br />\nprevious experience is neces- a<br />\nstruggling against fearful odds to pared<br />\none-sided<br />\nvice<br />\npresident;<br />\naffair.<br />\nDummy, secreing the summer, has already gone t(<br />\nsary.<br />\ntary; G. M. Shriver, treasurer,<br />\nlead their countries in retracing<br />\nThe<br />\nDickinson contest was one<br />\npress and will appear very shortly<br />\nthe recent path. A contribution to<br />\nand Meyer and Barton, sergeantof the greatest seen on Homewood<br />\nThe coming issue, the first in whicl<br />\nVICTROLA FOR BARN<br />\nthe fund offers a splendid opporat-arms, were also sustained by<br />\nField for many a day. Close<br />\nthe eager contestants will be givet<br />\ntunity to show the spirit of the<br />\nthe class.<br />\nnumber<br />\nvictrola<br />\nand<br />\nA<br />\nof<br />\na<br />\nredthroughout, the game was at times<br />\nopportunity to prove their met<br />\nSportsman in helping the fellow au<br />\nA disagreement, which threat- ords will be placed in the Y. M. C. spectacular and<br />\nat all times excitappear about November 15<br />\ntie,<br />\nwill<br />\nwho is down, and ultimately betened temporarily to disrupt the A. reading room, on the second ing. With the<br />\n\"Changing<br />\nexception<br />\nthe<br />\nof a short<br />\nand<br />\ndepict<br />\nwill<br />\ntering the<br />\nunity of the Sophomore Class, floor of the Barn, next week, it was period in the third<br />\ncondition of the world<br />\nquarter,<br />\nthe home<br />\nTimes.\"<br />\nancl America.<br />\narose from the fact that it had announced yesterday.<br />\nteam showed its superiority connot been stipulated in the first<br />\nAs considerable expense has been stantly. The Red and White, as<br />\nCOTILLON<br />\nBOARD TO ARRANGE<br />\nelection whether the officers necessary for repairs to the machine promised, opened<br />\nup an unusual<br />\nTHE ONLY WAY<br />\nAFTER-GAME DANCES<br />\nshould be elected by a majority or and purchase of the records, it is aerial attack, which<br />\nproved only 50<br />\nThe future of the dances, which<br />\nLady Visitor—And what brought a plurality. When the election was requested that students using the per cent.<br />\nefficient. The five or six<br />\nit has<br />\nrun upon the plurality basis a victrola will take good care of it. which they<br />\nbeen noised about the Uni- you here, my good man?<br />\nmanipulated, however,<br />\nversity were to be given by the InConvict 534—Well, madam, my protest arose and it was decided<br />\nA number of current humorous, were real thrillers, one of them, a<br />\nter-Fraternity<br />\nBoard after all the father said when I was a boy that to hold a re-election, voting upon literary and informative magazines heave of 20 yards, being<br />\ncaught by<br />\nremaining<br />\nfootball games, seems he hoped I would marry beaiity and the leading candidate and the run- will be furnished for use in the Goeltz as he lay flat on the<br />\nground.<br />\nbrains and I wanted to please him. ner up.<br />\nContinued on page 4, col. 2<br />\nreading room.<br />\nContinued on page 2,<br />\ncol. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 21, 1921<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\nrun<br />\nthe present time, it is known as the<br />\nBLACK AND BLUE GRIDDERS TO with<br />\na sixty-five-yard<br />\nCLASH ON FOREIGN SOIL<br />\ntwinkled in turn, but for the most Wesley Club. Its fundamental obContinued from page 1, col. 5<br />\npart played with their mates as a ject is to promote Christian spirit.<br />\nMany prominent speakers are exto address the club throughpected<br />\nfumbtraits,<br />\nold<br />\nHopkins' two<br />\nyear.<br />\nthe<br />\nout<br />\nfourth<br />\nthe<br />\nbling and weakening in<br />\nabtheir<br />\nperiod, were noticeable by<br />\nsance. All in all the team showed<br />\nThe Episcopal Church of<br />\na vast improvement.<br />\nSt. Michael's and All Angels<br /><br />\nsingle machine.<br />\n$2.50 Hopkins attempt at this sort of play<br /><br />\nSubscription<br /><br />\nalso proved but 50 per cent, effi-<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at cient, but the one pass that worked<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\ncounted for six points and the game,<br /><br />\nPublished semi-weekly from October to June by the students of Johns<br />\n!.11c1 brought yells of joy from the<br />\nHopkins University.<br />\ncrowd that saw the leather<br />\nexcited<br />\nBusiness communications should be addressed to the BUSINESS MANother<br />\nand<br />\ncommunications<br />\narticles<br />\nthe arms of the expectant<br />\nall<br />\nin<br />\nnestle<br />\nUNIVERSITY;<br />\nHOPKINS<br />\nJOHNS<br />\nAGER,<br />\nshould be sent to the MANAGING EDITOR.<br />\n\"Happy.\"<br />\nHomewood 100<br />\nHopkins played more like a maTelephone<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br /><br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\nActing Managing Editor:<br />\nWILLIAM H. MOORE, JR., '23<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nAssociate Editors:<br />\nEDWARD G. HUEY, '22.<br />\nELI FRANK, JR., '22.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nCRAIG E. TAYLOR, '24.<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nchine than was believed possible.<br />\nThose stars, Magill, who blocked<br />\nthe kick; \"Happy,\" who picked up<br />\nthe ball and ran to within eleven<br />\nyards of goal, and who later scored<br />\nfrom a pass; and Willis, who<br />\nbrought the stands to their feet<br /><br />\nST. PAUL and TWENTIETH STS.<br />\nPREACHERS' CLUB TO<br />\nREORGANIZE<br /><br />\nThe Preachers' Club will meet<br />\nMonday, October 31, at the home<br />\nof H. M. P. Davidson. Many<br />\nchanges are to be proposed at this<br />\nmeeting. A new name for the organization is to be selected. At<br /><br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 1 1 o'clock<br />\n\"The Poor Man's Market\"<br />\nEvening Service, 8 o'clock<br />\nMass Meeting at New Lyceum Theatre<br />\nSpecial Invitation to Hopkins Students<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., OCTOBER 21, 1921<br />\nA DEPLORABLE FACT<br />\nThe fact, as revealed in a letter to the Mail-bag this week, that<br />\ngroup of Hopkins men was forced to admit its<br />\nrepresentative<br />\na<br />\nMater\" song when called upon for same in<br />\n\"Alma<br />\nour<br />\nignorance of<br />\nthe presence of a number of other college men, is indeed deplorable.<br />\nThe \"Alma Mater\" song is generally the dearest possession of a college man. It is, as a rule, this song which leaves the most lasting<br />\nimpression on a graduate. When a number of old college chums get<br />\ntogether in after life it is not the \"rah, rah\" for them, but the spirited<br />\n\"Alma Mater\" which recalls the pleasant memories of the past.<br />\nIt should not be considered a duty to learn \"Veritas Vos Liberabit.\" It should be the desire of every man, from Freshman to<br />\nSenior, to learn this song as a matter of pride in his university. This<br />\nsong is printed on page three of the Handbook and thus should be<br />\neasily accessible to every one. It might also be well to practice it<br />\nat one of the assemblies.<br /><br />\nOUR BOTANICAL GARDENS<br />\nIt may be well to call to the attention of the new students and,<br />\nperhaps, even the older students, the opportunities, apparently wholly<br />\nneglected, that lie in the availability of the Johns Hopkins Botanical<br />\nGardens for pleasant and profitable personal research.<br />\nEven at this late season there, are curious plants, beautiful or<br />\nfantastical flowers, quaint specimens of shrubbery and strange water<br />\nplants in bloom, study of which will amply repay the student with<br />\nan idle half hour at his disposal. There are, for instance, cactus<br />\nplants, crimson dahlias, a weird lavender blossom from North China,<br />\nand plants with long, fuzzy white flower-spikes, with an unpronounceable name.<br />\nMany men seem to believe the gardens open only to students<br />\nof botany and allied sciences. Such, however, is not the case. The<br />\nwalks are free to all. A fellow's sweetheart, one of these pleasant<br />\nautumn afternoons, might not be averse to a stroll through the gardens.<br />\nOf course, it should not be necessary to call attention to the rule<br />\nthat visitors shall not handle or injure in any way any of the growing<br />\nthings.<br /><br />\nere's why<br /><br />\nCAMELS are<br /><br />\nthe quality ci arette<br />\nECAUSE we put the utmost quality into<br />\nthis one brand. Camels are as good as it's<br />\npossible for skill, money and lifelong knowledge<br />\nof fine tobaccos to make a cigarette.<br />\nNothing is too good for Camels. And bear<br />\nthis in mind! Everything is done to make<br />\nCamels the best cigarette it's possible to buy.<br />\nNothing is done simply for show.<br />\nTake the Camel package for instance. It's the<br />\nmost perfect packing science can devise to protect cigarettes and keep them fresh. Heavy<br />\npaper—secure foil wrapping—revenue stamp<br />\nto seal the fold and make the package air-tight.<br />\nBut there's nothing flashy about it. You'll find<br />\nno extra wrappers. No frills or furbelows.<br /><br />\nHELLO!<br />\n\"The most cheerful, the most friendly word in the English language is 'hello'. It has brightened life for countless numbers. When<br />\nspoken at the right time it has been the turning point towards happiness and prosperity. It has promoted many lifelong friendships<br />\nand brought its own rewards. It is the magic symbol that turns<br />\ngroups of men into one great brotherhood.<br />\nRealizing the great power of this word, the Student Council, last<br />\nyear, inaugurated a 'Hello' movement in which every Stevens man<br />\nwas asked to yell a hearty 'Hello!' to all the fellow Stevens men he<br />\nmet. It was hoped that such a movement would bring about a closer<br />\nunion of the Student Body, develop friendships, and promote a more<br />\nloyal, more active, and persistent college spirit. Needless to say, the<br />\nmovement was very successful. Last winter and spring, the results<br />\nwere evident in the way Stevens men greeted each other and in the<br />\nmore hospitable spirit that prevailed throughout the campus.\"<br />\nThus comments the \"Stute\" in an editorial.<br />\nA proposition was before the Hopkins Student Council last fall<br />\nto pass a Freshman regulation to the effect that \"Freshmen should<br />\nspeak to all Hopkins men on University grounds.\" This failed to<br />\ngo through as the Council thought that there was an opportunity for<br />\nunreasonable Sophomores to treat the Freshmen unjustly.<br />\nThere cannot be this objection, however, in making the movement voluntarily. The \"Stute\" commends it highly. Why shouldn't<br />\nit work at Hopkins? Start it going today and give every Hopkins<br />\nman you see a hearty \"Hello !\"<br /><br />\nSuch things do not improve the smoke any<br />\nmore than premiums or coupons. And remember<br />\n—you must pay their extra cost or get lowered<br />\nquality.<br />\nIf you want the smoothest, mellowest, mildest<br />\ncigarette you can imagine—and one entirely free<br />\nfrom cigaretty aftertaste,<br />\nIt's Camels for you.<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, Winston-Salem, N. C.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 21, 1921<br />\nthe<br />\nobrit.<br />\nexgh-<br /><br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\nStyles for every taste.<br />\nBaltimore's Best Store<br /><br />\nHOCHSCHILD,KOHN 8C,Co.<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\nAll letters intended for publication<br />\nmust be concise.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby \"The News-Letter, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nor<br /><br />\nFidelity &amp; Deposit Company<br />\nOF MARYLAND<br />\n1890<br /><br />\n1920<br /><br />\nitre<br /><br />\nents<br /><br />\nFIDELITY BONDS &amp; BURGLARY INSURANCE<br />\nContract, Judicial—BONDS—Public Official, Depository<br />\nCHARLES ST. at LEXINGTON<br /><br />\nBaltimore, Md.<br /><br />\nEstablished 1863<br /><br />\nWhen you want the<br />\nreal thing in Sport<br />\nEquipment you think<br />\ninstinctively of<br />\n\"SPALDING\"<br /><br />\nHENRY SEIM &amp; CO.<br />\nManufacturers, Importers &amp; Dealers<br /><br />\nGLASS<br />\nPAINTS, OILS and VARNISHES<br />\nof Every Description<br /><br />\nAutomobile Glass a Specialty<br />\nA. G. SPALDING &amp; BROS.<br />\n110 EAST BALTIMORE ST.<br /><br />\nDomestic and Ecclesiastic Leaded<br />\nStained Glass<br /><br />\nBaltimore, Md.<br /><br />\nHOWARD &amp; FAYETTE STS.<br /><br />\nLunches, Cigars<br />\nCigarettes<br />\nCandy, Soda and<br />\nPipes and Fountain Pens<br />\nAt the Barn<br />\nE. E. Adams<br /><br />\nCollege and Fraternity Stationery<br />\nEanquet and Dance Cards, Invitations<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br /><br />\nNECKWEAR<br /><br />\nSHIRTS<br /><br />\n$8.00, made<br />\nAT<br />\nleather,<br />\ngrain<br />\nof<br />\nin tan or black,<br />\nwith square toe and<br />\nheavy perforations,<br />\nthis is an oxford<br />\nany college man<br />\ncan be proud of.<br />\nIn high shoe the<br />\nsame style is $8.50.<br /><br />\nLefranc &amp; Ault<br /><br />\n11<br /><br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nROSIERY<br /><br />\nCharles Street, 210 North<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nP_ress Shirts<br />\n$3.00, $3.50 and $4.00<br />\nElkridge Farms Dairy<br />\nNeglige<br />\n$3.25 and $4.25<br />\n$5.25 and $6.25<br />\nSTRICTLY FRESH MILK<br />\nIniPorted Madras<br />\nTerms Cash, Less 10% 30 Days on<br />\nProduced, Pasteurized and Bottled<br />\nShirts<br />\nin Howard County<br />\nAlso a Full Line of Men's<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br />\nHi—That's a nasty spill Jim just<br />\nIrate Passenger—Why don't you<br />\nPut your foot where it belongs?<br />\nhad.<br />\nLo—Zat so?<br />\nTough Guy — If I did you<br />\nHi—Yep, about a pint.—Tiger.<br />\nwouldn't sit down for a week.—<br />\nJester.<br />\nThe Infant Terrible—If I wasn't<br />\nFrat—We have a new dish washhere the young man would kiss you.<br />\ner at the house.<br />\nSister (horrified)—Yon impertiFrater--How so?<br />\nFrat—I've noticed the difference nent boy! Go away this instant.—<br />\nIn the finger prints.—Froth.<br />\nTar Baby.<br /><br />\n3<br /><br />\nA DEPLORABLE FACT<br /><br />\nTo the Editor of the NEWS-LETTER.<br />\nDEAR SIR: It is probable that if<br />\nall Hopkins students were requested<br />\nto sing their \"alma mater,\" ninety<br />\nper cent. would be forced to acknowledge that they did not know<br />\nit.<br />\nThis summer at Plattsburg, the<br />\nrepresentatives of the various colleges present stood up, doffed hats,<br />\nand amid an impressive silence, began their \"alma maters.\" College<br />\nafter college responded. Finally,<br />\nsomeone called upon Hopkins. The<br />\nHopkins delegation was forced to<br />\nadmit that they did not know theirs.<br />\nNo one said much, but in the attitude of the other college men we<br />\ncould feel the question: \"What<br />\nkind of a place is that, anyway?\"<br />\nIt is not as if Hopkins did not<br />\nhave an \"alma mater.\" She has,<br />\nand a beautiful one at that. This<br />\nhas, however, for some unascertained reason, fallen into discard. If<br />\nthe present one does not meet with<br />\napproval, why do not some of our<br />\nmusical geniuses compose another<br />\none? But by all means let the entire University learn some \"alma<br />\nmater\" at once and spare any further embarrassment to Hopkins<br />\nmen in that respect.<br />\nVery sincerely yours,<br />\nPLATTSBURG.<br /><br />\nClothes if Cusiort QuaLiiy.<br />\nIsLCharlesS reet__<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br /><br />\nLafayette Bank<br />\nN. E. COR. CALVERT AND LEXINGTON STREETS<br />\nJ. SHORB NEALE,President<br /><br />\nEDWIN W. ADAMS,Vice-Pres. &amp; Cashier<br /><br />\nCOMMERCIAL ACCOUNTS—Liberal Terms<br />\nSAVINGS ACCOUNTS-4% payable semi-annually<br />\nDepository for State of Maryland and City of Baltimore<br />\nDEPO SITS<br />\nNovember 22, 1920<br />\nApril 28, 1921<br />\n$428,399.57<br />\nDecember 29, 1920<br />\n$112,418.77 May 18, 1921<br />\n549,051.33<br />\nFebruary 21, 1921<br />\n248,234.01 June 30, 1921<br />\n657,092.61<br />\nTOTAL ASSETS AUGUST 31, 1921<br />\n$1,013,167.87<br /><br />\nMaryland Glass Corporation<br />\nBaltimore<br /><br />\nManufacturers<br />\nManufacturers of Automatic Machine-made<br />\nBlue and Light Green Glass Bottles.<br /><br />\nThe James R. Armiger Co.<br />\nJewelers and Silversmiths<br />\nBaltimore, Maryland<br /><br />\n310 N. Charles St.<br /><br />\nFRESHMEN SHOULD SAVE THEIR<br />\nPENNIES AND WEAR<br />\nCOTTON SOCKS<br /><br />\nEditor of the NEWS-LETTER.<br />\nDEAR SIR: There seems to be<br />\nconsiderable trouble about the<br />\nFreshmen wearing silk hose. The<br />\nrules in the Hand Book do not mention anything about this point. However, the Sophomores are trying to<br />\nadd this rule. A pretty lively argument started between the Freshmen<br />\nand Sophs on Friday, when several<br />\nSophs attempted to make a Freshman remove his silk socks. Now,<br />\nif it is the intention that the use of<br />\nsilk hosiery should be forbidden,<br />\nwouldn't it not be well to give a<br />\ndefinite ruling on the subject so<br />\nthat there may be no misunderstanding?<br />\nFRESII'MAN.<br />\nFRESHMEN IMPRESSIONS OF<br />\nCOLLEGE<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br /><br />\nIf an Accident Occurs<br />\nAnd Medicines and'Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br /><br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Ave.<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br /><br />\nFive freshmen, chosen at random, were asked this question •<br />\nWhat were your impressions of<br />\nSt. Paul 7855-7856<br />\nyour first day in college?<br />\nHere are the answers:<br />\nHomes Sold on Easy Terms<br />\nSUMMERS: I liked the broad, flat<br />\npaddles better than the short, sharp<br />\nones—they didn't make such a lasting impression.<br />\nANONYMOUS: I got the impression that the sophomores were too<br />\nROBERT SEFF<br />\nfresh—that the freshmen have the<br />\nReal Estate—Investments<br />\nweight, numbers and spirit to mop<br />\nup the campus with them when the<br />\nrushes come.<br />\nK. MILLER: Every man I met<br />\nhere seemed to be a MAN.<br />\nSOLD BY ALL GROCERS 231 Courtland Street Baltimore, Md.<br />\nPARKS: It seemed to me that<br />\neverybody knew everybody else, except myself, who knew nobody.<br />\nEstablished 1873<br />\nLIBERTY<br />\nPARSONS: I sensed a certain inA.<br />\nH.<br />\nFetting<br />\nMan'fg<br />\nJewelry<br />\nCo.<br />\ntangible spirit in the atmosphere of<br />\nExpert Cleaners and Dyers<br />\nManufacturers<br />\nthe college which cannot be defiRates to Hopkins Men<br />\nSpecial<br />\nGreek Letter Fraternity Jewelry<br />\nnitely interpreted, and which canHomewood 5205-W<br />\n213 N. LIBERTY ST., Baltimore, Md. 211 E. 25th St.<br />\nnot be grasped in one day.<br /><br />\nHE-NO<br />\nTEA<br /><br />\nTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 21, 1921<br /><br />\n4<br /><br />\nUSHERS HANDLE CROWD<br />\nEFFICIENTLY<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br /><br />\nATHLETIC GOSSIP<br /><br />\nBuck Glass Company<br /><br />\nLast Saturday was a big day<br />\nThe usher system conceived by for Hopkins men. With the vicGil Engel went into effect at last tory over Dickinson and MarySaturday's game and was univer- land's defeat at the hands of St.<br />\nsally declared to be a huge suc- Johns, all that was necessary for<br />\ncess. All persons holding reserved \"a perfect day\" was a Navy deseat tickets were met at the gate feat by Princeton.<br />\nby the head usher, Joe Zoller, and<br />\nThe coming game with St.<br />\ndirected to their respective sec- John's promises to be the big aftions, where they were seated by fair of the gridiron season for Balthe other ushers.<br />\ntimore. Both Hopkins and the AnEvery effort was made to care napolitans have shown class thus<br />\nfor the visitors' comfort and to far. The lads from the capitol have<br />\nimpress upon them the fact that bowled over two state title conthey were guests of the Universi- tenders in Maryland State and<br />\nty. The men on the committee Western Maryland, while the<br />\nwere careful to omit no courtesy Black and Blue has beaten Mt. St.<br />\nand in every way to show the true Mary's. Unless Western Maryspirit of hospitality of their \"Al- land trims us next Saturday or<br />\nma Mater in Dixie Land.\"<br />\nMt. St. Mary's defeats St. John's<br />\nThe members of the committee neither of which is likely the game<br />\nlole Assorted Chocolates<br />\nwho are all upper-classmen, wore at Homewood on November 11<br />\nJ. H. U. armbands as distinguish- will be for the state championship<br />\nAND<br />\ning insignia. It is expected, how- and will draw the usual ThanksLady Helen Chocolate Cherries in Cordial<br />\never, that in the future the ushers giving Day crowd.<br />\nwill adopt black sweaters or some<br />\nState meets Virginia Poly toother apparel as their official garb. morrow and should come out on<br />\nAt present it is planned to or- the long end of the score. State<br />\nganize an Ushers' Club and thus is a fallen idol, however, and is<br />\nAre standards in their respective class of delicious confections<br />\nperpetuate the system at Hopkins. likely to remain one for many<br />\nat popular prices.<br />\nA head usher or club president days to come. Not even a victory<br />\nwill be elected annually from the over Yale, the weakest member<br />\nmen on the reception committee. of the Big Three, would serve to<br />\nIn this way college interest will put her back on her pedestal. Yea,<br />\nbe directed toward it and the club verily, we repeat, \"You cannot<br />\nAsk Your Dealer for Them<br />\nwill grow into a recognized cam- fool all of the people all of the<br />\npus activity.<br />\ntime.\"<br />\nThose who officiated at HomeComparative scores are probwood Field on Saturday are Nor- ably bunk, but they're wonderful<br />\nwood, Russell, Collins, Hamburg, to think about, i.e., J. H. U. is one<br />\nBaltimore, Md.<br />\nWills, Hill, Stellman, Joesting, touchdown better than Dickinson.<br />\nGent, Kuder, Robinson, Shriver, Dickinson is four touchdowns<br />\nCallard, White, Leopold, Howard, weaker than Lafayette; Lafayette<br />\nHomer, Devoie, Matthews, Ken- is one better than Pitt. Pitt is one<br />\nCall Calvert 1718<br />\nNorman James, President<br />\nnedy and Jennifer.<br />\nFOR KEEN CUTTER HARDWARE<br />\nbetter than West Virginia. Which Geo. B. Hunting, Vice-President<br />\nWalter B. Wessels, Secretary-Treas.<br />\nLUCAS<br />\naccording to the Q. E. D. method, F. A. Ascherfeld, General Manager<br />\nLOST AND FOUND<br />\nMarine, Industrial, House<br />\nPAINTS<br />\nMore than one thousand ar- puts J. H. U. but one back of West<br />\nticles, ranging from fraternity Virginia. Next week we will enBUILDING LUMBER<br />\npins to trousers were recovered deavor to advance by the same<br />\nOffice and Yardsharmless<br />\nmethod<br />\nover<br />\nNavy.<br />\nlast year through the Lost and<br /><br />\nManufacturers of<br /><br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br /><br />\nGLASS BOTTLES<br /><br />\nBaltimore<br /><br />\nv le)<br />\nLelAbeiCatterie<br />\n1-1.5, OSCAR GA...-. -If<br />\nOWNERS<br />\nE•C°44<br />\n7'itil<br />\n)<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\n!Lk<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nChocolate Products Company<br /><br />\nThe James Lumber Co.<br /><br />\nFound Bureau, established by the<br />\nProf. (after long-winded proof)<br />\nUniversity Y. M. C. A.<br />\n—And<br />\nnow we find that x equals o.<br />\nAny student losing or finding<br />\nSleepy<br />\nStude—Hell, all that work<br />\nanything of value in the building<br />\nfor<br />\nnothing<br />\n?—Siren.<br />\nor on the campus is asked to report his find to the Y. M. C. A.<br />\noffice in the Barn.<br />\nAmong the articles turned in<br />\nsince the opening of school are<br />\na bunch of keys and a ladies' blue<br />\nivory hairbrush.<br />\nJ. P. Stump,'23, is in charge of<br />\nthe bureau.<br />\nLOMBARD and SOUTH STREETS<br /><br />\nfpr<br />\nUNIVERSITY MEN<br />\nFor Sport Wear<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nModerate Prices<br /><br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br /><br />\nHe—What color is your body?<br />\nShe—Mine is pink.<br />\nHe—Mine is dark brown, I have<br />\njust had wire wheels put on it too.<br />\n—Voo Doo.<br /><br />\nsomewhat in doubt, at present. The<br />\nInter-Fraternity Board decided at<br />\nits meeting yesterday that it was<br />\nnot within its province to give<br />\ndances of this sort, but did not drop<br />\nthe idea entirely, agreeing to recommend to the Cotillon Board that<br />\nthey arrange to provide for the entertainments.<br />\nThe Cotillon Board has not as yet<br />\nacted on the suggestion of the<br />\nInter-Fraternity Board, but it is<br />\nalmost certain that they will undertake to give the dances. The plans,<br />\nhowever, are in a somewhat formative state and the final arrangements are still hanging fire.<br /><br />\nJudge—You have been found<br />\nguilty of petty larceny. What do \"Why did you put on your hat?\"<br />\nyou want, ten days or ten dollars? she asked.<br />\nGuilty Party — I'll take the<br />\nHe whistled softly, \"Chili Bean.\"<br />\nmoney.—Flamingo.<br />\n—Lampoon.<br /><br />\nBONDS<br /><br />\nENVELOPES<br /><br />\nLEDGERS<br /><br />\nLexington Paint &amp;<br /><br />\nHardware Co.<br /><br />\n921 ALICEANNA ST., cor. Exeter<br />\nBaltimore, Md.<br /><br />\n609 W. LEXINGTON ST.<br /><br />\nChas. L. Cunningham &amp; Co.<br />\n(Licensees)<br /><br />\nStewart Taxi Service Co.<br /><br />\n20-30 GARRISON LANE<br />\nNear Baltimore St.<br />\nMETAL WEATHER STRIPS<br />\nfor<br />\nWINDOWS and DOORS<br />\nPhones—C. &amp; P., Long Distance<br /><br />\nCall<br /><br />\nMt. Vernon 11<br /><br />\nTaxi Cabs and Touring Cars<br /><br />\nKALLOTHENEION<br />\nAn Unusual Beauty Shop<br /><br />\nOur Exclusive Tailored Sport<br />\nBlouses a Specialty<br /><br />\nCOTILLION BOARD TO ARRANGE<br />\nAFTER-GAME DANCES<br />\nContinued from page I,col. I<br /><br />\nSHOES<br /><br />\nMaryland<br /><br />\nMade to Your Measurement<br />\n517 N. CHARLES ST.<br />\nBaltimore, Maryland<br /><br />\nUse MORGAN'S CARBOLATED<br />\nBABY POWDER for Chafing<br /><br />\nand Itching for Adults and<br />\nChildren.<br /><br />\nAccountancy<br />\nCOMPLIMENTS<br /><br />\nHoward W.Jackson<br /><br />\nSelection<br />\nWhen you choose from<br />\nour assortments of haberdashery or clothing,—you<br />\nchoose from a selection<br />\nthat has passed the highest<br />\nstandard of quality and<br />\ntaste before it is presented<br />\nfor your inspection.<br />\nAnd the prices are moderate!<br /><br />\nDemocratic Candidate<br />\nRegister of Wills<br /><br />\nDoes the C. P. A. degree, a career as a public accountant or tax<br />\nspecialist, an executive position<br />\nas Controller, Treasurer, Auditor<br />\nor Office Manager appeal to you?<br />\nPace courses, standardized and<br />\naccredited, available in evening<br />\nclasses, have for years afforded<br />\npreparation for professional Accountancy practice and for executive positions in business.<br /><br />\nBaltimore<br />\nPace institute<br />\nFALL CLASSES NOW FORMING<br />\nCall or Write for Bulletin<br />\nSt. Paul 1469<br />\n201-208 EQUITABLE BLDG.<br /><br />\nJ. Seth Hopkins-Mansfield Co.<br />\n4-6 WEST FAYETTE ST., BALTIMORE<br /><br />\nTH E<br /><br />\nW. H. Moore, Jr., Paper Co.<br />\n205 W.CAMDEN STREET<br /><br />\nU1L1TY{mop<br /><br />\nCollar Hug Clothes<br />\ngait/more and Ne_ryStreets<br /><br />\nINIIII•111111•••••111 I<br />\n••••1111•101W•1111<br /><br />\nART GOODS<br />\nChina and Table Glassware<br /><br />\nCutlery, Kitchen Utensils<br /><br />"}], "field_media_file": [{"target_id": 37541, "display": null, "description": null, "target_type": "file", "target_uuid": "d6448984-8595-4b8d-90d6-dbd48ab4b9ed", "url": "http://digital.library.jhu.edu/system/files/2022-03/12960-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12960, "target_type": "node", "target_uuid": "7ac44acb-359b-4934-8805-943ba4ed9bf1", "url": "/node/12960"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "79a158be-34c6-482c-91fd-02d6990433b9"}]}