{"mid": [{"value": 36697}], "uuid": [{"value": "1d7cc6d6-fc3a-4b47-96c2-578df1c45af0"}], "vid": [{"value": 36697}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12983-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 29<br />\nHOPKINS-LEHIGH MEET<br />\nTOMORROW NIGHT<br />\n<br />\nBALTIMORE, MD., FEBRUARY 8, 1922<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nDRAMATIC CLUB TO GIVE SPRING SPORTS TICKET SALE MIDWINTER EXAMS COME TO ENTRIES TO FIFTH REGIMENT<br />\nMEET POURING IN<br />\nAN END<br />\nTO START SOON<br />\n\"IF I WERE KING\"<br />\n<br />\nKeen Competition Expected. Informal Miss Walter Suffers Nervous Break- Forty Team Captains Chosen to Direct Students Advised to Boost Undergrad- Many Interesting Relays to Be Staged.<br />\nStrong Contenders from All<br />\nuate Activ:ties. Success Gained<br />\nCampaign. Publicity Bureau Endown. W. B. Swindell, Jr., to Coach<br />\nDancing to Be Held After<br />\nAtlantic States.<br />\nOnly by Sticking.<br />\ndorsed by A. A. Board.<br />\nProduction. Large Cast Necessary.<br />\nMeet.<br />\n<br />\nWith many entries for the big<br />\nAt a called meeting on Monday<br />\nThe spring season ticket camAfter weighty deliberations and<br />\nEverything is in readiness for<br />\nFifth<br />\nSeekers<br />\nRegiment Armory meet pourof<br />\nEarnest<br />\nSociety<br />\nthe<br />\nof<br />\nthe big meet with Lehigh tomor- many last-minute changes, the Dra- paign will take place the second<br />\nfor a Silver Lining, the following ing into the athletic office with<br />\nrow night at the Baltimore Athlet- matic Club has finally decided tc and third weeks in March. At<br />\nic Club's pool. Last year, in a very present \"If I Were King,\" a dram meeting of the Athletic Board fina Aservations were made by the every mail, Graduate Manager<br />\nKistler believes that Hopkins is<br />\nclosely contested and spectacular by Justin McCarthy, in which C. E touches were put upon the complet( Philosopher of the Barn:<br />\nand<br />\nbefore<br />\ndue<br />\nto pull off the greatest indoor<br />\n'The exams are over<br />\nmeet at Bethlehem, the Black and Sothern starred on the profession and admirable plan of campaigi<br />\nBlue was victorious by the close al stage for many years. The play published in the NEWS-LETTEI this month is past all the spring track meet ever witnessed by Balcount of 37 to 34. The outcome of which is laid in the period of Loui some weeks ago. The main fea athletic and non-athletic activities timore followers of the track and<br />\nthe meet hinged on the final event, XI, King of France, presents th( tures of this plan, it will be re- will be well under way. Now is field game. One point which has<br />\nthe 50-yard back stroke, in which story of Francois Villon, the \"poet membered, called for the divisior the time for every Hopkins man been emphasized by the organizers<br />\n\"Bill\" Reins brought victory to jailbird,\" and contains a cast o, of the entire student body into twc who has not done so before, to of the meet is that every college or<br />\nHopkins by crossing the line two 120 characters. The play is on( groups, fraternity and non-frater ask himself the question, 'What club which sends in entries must<br />\nthat is seldom attempted on th( nity, from which teams will b. am I going to do to help HopkIns see that their contestants actually<br />\nfeet ahead of his rival.<br />\nmade up. These teams will canvas: in undergraduate activities?' Un- cempete, or the cash guarantee<br />\nThe competition should be just amateur stage.<br />\ndoubtedly he will answer this not agreed to by the Games Committee<br />\nIt has been announced that tlic aiumni and the public generally.<br />\nas close this year, as both schools<br />\nMiss<br />\nWalters<br />\nunof<br />\nhave<br />\nservices<br />\nin<br />\nwords, but in action,—by com- will be refused. Formerly, the proThe Athletic Board, in approv<br />\nhave practically the same teams,<br />\nfortunately been lost to the club.<br />\ning- the plan, expressed its deep ap petition for a place on some ath- gram has always contained a large<br />\nwith Hopkins probably, having a<br />\nas far as the coaching of this year's<br />\nslight edge. Regad, of Lehigh, and production is concerned. This is preciation of the unusually fin( letic team or one of the non-athlet- number of more or less famous<br />\n,c activities. But going out for his performers who failed to show up<br />\n\"Dewey\" Hambleton, of J. H. U., due to a nervous breakdown, which work done by Mr. Kistler in pre<br />\nchosen activity is not all he will when their events were called. On<br />\nshould have a merry time in the she recently experienced. The cluL paring for the drive, which wil do; he will stick at his work, give<br />\nplunge, as both of them hold their has been fortunate to obtain Wal- mean so much to the success o. much of his time to it and finally account of this policy, many patter 13. Swindell, Jr., to direct \"If failure of every one of the sprint<br />\nhe will come out successfully after rons of the games have been bitschool records, and can always be<br />\n[ Were King.\" Mr. Swindell is a<br />\nhaving helped himself immeasur- terly disappointed when they have<br />\ndepended upon to make well over Hopkins graduate and was a cheer- sport schedules.<br />\nfailed to see the stellar attractions<br />\nForty captains of non-fraternit) ably as well as his college.<br />\nsixty feet.<br />\nleader of exceptional ability durrule,<br />\nreCouncil<br />\nStudent<br />\n\"The<br />\nin action. This year the commitIt is hoped that Captain Paul ing his undergraduate days. He is teams have been chosen by \"Andy.<br />\ngo<br />\nout<br />\nfor<br />\nFreshmen<br />\nto<br />\nall<br />\nquiring<br />\nKnecht and \"Bill\" Totterdale. The:<br />\ntee has arranged matters so that<br />\nBuhrer and \"Bob\" Hall will have now, perhaps, the leading amateur<br />\nsome activity, has done much to<br />\nwill<br />\nbe<br />\nwhom<br />\nthe<br />\nmen<br />\non<br />\nthe<br />\ndirer.<br />\nery athlete who has been widely<br />\nsatisfied the blacklist requirements, actor on the Baltimore stage and responsibility for the success of th( make new men turn out for camhas<br />\ntaken<br />\npart<br />\nin<br />\npractically<br />\nevery<br />\nadvertised<br />\nmust run, or else lose<br />\npus activities, but there is very<br />\nand if such be the case the team<br />\nproduction of note that has been drive will rest.<br />\nhis expense guarantee. It is bewill be enormously strengthened by<br />\nAn Honor Roll of men who d( little it can do to make them<br />\npresented in local circles in recent<br />\nfound<br />\nit<br />\nFreshmen<br />\nhave<br />\nstick.<br />\nlieved<br />\nthat this action will insure<br />\ntheir work satisfactorily in th(<br />\ntheir presence.<br />\nyears.<br />\nfor<br />\nout<br />\ngo<br />\ncomparatively<br />\neasy<br />\nto<br />\nthe<br />\nspectators<br />\nagainst disappointFor a<br />\nThe meet, however, will not be<br />\nThe principal and difficult role drive will be published.<br />\nrepribe<br />\nfor<br />\na<br />\nweek,<br />\nactivity<br />\nan<br />\nment.<br />\nthe only attraction of the night. of Francois Villon is assigned to man's name not to be on this roll<br />\nafter a month's inactivity, Up to the present time most of<br />\nBetween events the spectators will Pierce Brawner. The leading fe- will be a disgrace to him, as weh manded<br />\nweek and then loaf the teams have been composed of<br />\nanother<br />\nwork<br />\nbe entertained with music and male part of Hugette du Hamel is as to the university.<br />\nanother month. The reason most relay teams, but it is believed that<br />\nvarious stunts, which will be put to be taken by \"Joe\" Moran. Eli<br />\nEqually important was the -acwork is a larger list of individual entries<br />\non. After the meet, as everyone Frank, Jr., as Louis XI, and Gil- tion of the board in definitely de- men try to dodge this<br />\ndoubtless because they fail to see than ever before will also be reknows, an informal dance will be son Engel, as Thibaut D'Aussigay, ciding to establish- a Publicity Buany<br />\nchance of their own success ceived. Many of the strongest colheld in the B. A. C. gymnasium. are other leading characters in the reau. The work of W. H. Moore,<br />\nmaking<br />\na team, an editorial leges in the East are sending their<br />\nni<br />\n1he undergraduate orchestra will production.<br />\nJr., who was picked to head the<br />\nSome even doubt crack relay teams to Baltimore in<br />\ncast.<br />\nboard<br />\nor<br />\na<br />\nfurnish the music, which is guaranbureau, was endorsed when the<br />\nThe cast is as follows:<br />\nthe university special matches with their own parability<br />\nto<br />\nhelp<br />\ntheir<br />\nteed to make the feet of even the Francois Villon<br />\nBrawner constitution and outline of organi- in any way. But success, in un- ticular rivals. The most important<br />\nmost fastidious wiggl.e with spon- Hugette du Hamel<br />\nMoran zation he had drawn up was ap- dergraduate competition, as in the relays which have been definitely<br />\ntaneous exuberance.<br />\nLouis XI<br />\nFrank proved. This charter establishes a business world, is not a thing that arranged so far are: University<br />\nThe tickets for the meet and Thibaut D'Aussigny<br />\nEngel self-perpetuating board of five is thrust on a man; it is achieved of Pittsburgh versus Lafayette, in<br />\n(lance will be $1.50 per couple, and Tristam L'Hermite<br />\nHess members, and suitable assistants, only by patient and hard work a medley relay; U. S. Naval Acad$1 single admission. It is essen- Olivier Le Dain<br />\nMoore in addition to the Editor-in-Chief and above all, consistent sticking emy versus Penn. State, in a medtial that every loyal Hopkins man Noel Le Jolys<br />\nWest and the Director of Athletics.<br />\nat the task. This latter, the Stu- ley ; Princeton versus Mass, Iinstiattend this meet as the entire sea- Rene de Montigny ....Smallwood<br />\nIt was brought to the attention<br />\ndent Council cannot force a man tute of Technology, in a mile reson depends upon the success or<br />\nGuy Tobarie<br />\nKirkley of the Board that many men hav- to do; it is left for the individual lay; Carnegie Tech versus Johns<br />\nfailure of this one night.<br />\nColin de Cayeulx .....Buckheister ing no right to wear the \"H\" are himself.<br />\nHopkins, in a medley; Gallaudet<br />\nShould a sufficient amount be re- Jeban Le Loup<br />\nRich having the coveted letter put on<br />\nendeav- versus Johns Hopkins Reserves, in<br />\nthe<br />\ncrown<br />\nwill<br />\n\"Success<br />\nalized, Hopkins will be able to hold, Casin Cholet<br />\n. Jacobsen their pipes. The Board is making ors of any man who sticks to his a mile; Lehigh University versus<br />\nduring Easter week, the Eastern Ribin Turgis<br />\nSherwood an investigation of these reports aims and ideals and certainly now Lafayette, in a mile; Georgetown<br />\nIntercollegiate Swimming Associa- Petit Jean<br />\nHoffmeister and warns every man considering is the time, especially for Fresh- versus Fordham, in a mile; and U.<br />\ntion Individual Championships. Du Lau<br />\nEvans having an \"H\" put on his pipe that men, to learn this lesson. In col- S. Naval Academy Plebes versus<br />\nThis meet would bring here Giebel, Poncet de Riviere<br />\nStevens only men who have won their let- lege life and in the friendly com- University of Pennsylvania Freshof Rutgers, who is the national inDe Nautailett<br />\nMeddinger ter in a major sport have a right petition that goes with it, a man men, in a mile relay. In addition<br />\ntercollegiate 220-yard champion; Toison D'Or<br />\nCroker to wear the insignia in this way, as meets a miniature business world, to these special matches, there will<br />\nCrownover, of Swarthmore, who Montjoye<br />\nYoung well as on a sweater.<br />\none from which he may draw be four South Atlantic Association<br />\nProved such a star this year against Astrologer<br />\nSachs<br />\nmany lessons that will be of great relay events, the mile, two mile,<br />\nHopkins, and Regad, of Lehigh, Katherine de Vauselles<br />\nGardner value to him in after life. The medley,<br />\nWhite Blanche<br />\nand special one mile Freshwho, the authorities say, is expeced Mother<br />\nMount various activities are so diversi- man relay.<br />\nVillon<br />\nRoberts Guillemette<br />\nHopkins, Georgetown<br />\nto break the Association record for<br />\nSlatkin fied in character that very rare, and<br />\nCaptain of Watch<br />\nKeene Isabeau<br />\nUniversity<br />\nof Virginia will be<br />\nthe plunge, besides a large number<br />\nReaney and it might well be added, very<br />\nDenise<br />\nJehauneton le Belle Heaumiere,<br />\nthe<br />\nstrongest<br />\ncontenders<br />\nfor these<br />\nc I other stars.<br />\nHopkins<br />\nJenifer Queen<br />\nContinued on Page 2, Col. 4<br />\ntitles.<br />\nBecause of the uncertainties proThe R. 0. T. C. will stage an induced by the blacklist, it is imposter<br />\n-company event, in which either<br />\nsible to give a definite lineup for<br />\nfour<br />\nor six teams will run. An<br />\ntomorrow's meet. Manager Rowinterfraternity<br />\nrelay has been wideland, however, has announced that<br />\n;y discussed and will probably apSWIMMING MEET<br />\nthe fo:lowing men will probably<br />\npear on the final program. An inWith Lehigh tomorrow night at B. A. C. Pool.<br />\nstart for Hopkins:<br />\ntersting schoolboy battle will be a<br />\nRelay—Coady, Buhrer, RowATTENTION!<br />\nmile relay between City College<br />\nSOPHS,<br />\nland, Morrell or Johnston.<br />\nHall.<br />\nGilman<br />\nBarn<br />\nand<br />\nand<br />\nin<br />\nBaltimore Polytechnic InstiRoll<br />\nSophomores<br />\nSign<br />\nClass<br />\n50-yard Dash—Buhrer, Rowland.<br />\ntute.<br />\nIt will be the first time that<br />\n100-yard Dash—Buhrer, Lord or<br />\nDAY BIBLE CLASSES<br />\nNOON<br />\nthese<br />\nteams<br />\nhave met in two years<br />\nMorrell.<br />\nWill be continued on Wednesday, February 15, 1922, 109 M. E. Bldg., 12.25 to 12.50 P. M.<br />\nand<br />\nthe<br />\nensuing<br />\nrace is sure to be<br />\nFancy Dive—Coady.<br />\na<br />\nreal<br />\nstruggle.<br />\nWashington<br />\nTech.,<br />\nBack-stroke — Hall, Hambleton<br />\nCALL FOR CANDIDATES<br />\nEpiscopal<br />\nHigh<br />\nand<br />\nBaltimore<br />\nOr Morrell.<br />\nCity<br />\nNew competition for Business Board or Black and Blue Jay starts Monday. Candidates,<br />\n' College will meet in a triple relay<br />\nBreast-stroke — Rowland, Dunnew and old,will meet above News-Letter Office at 12.20.<br />\nfor the first time.<br />\nContinued on page 2, col. 5<br />\n220-yard Dash—Coady, Hall.<br />\n<br />\nNOTICES<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1922<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nCRAIG E. TAYLOR, '24.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\n<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., FEBRUARY 8, 1922<br />\n<br />\nFrom A Faint Blue<br />\nGlow To Modern<br />\nMiracles<br />\nDISON saw it first—a mere shadow of bluelight streaking across the terminals inside an imperfect electric<br />\nlamp. This \"leak\" of electric current, an obstacle to<br />\nlamp perfection, was soon banished by removing more air<br />\nfrom the bulbs.<br />\nBut the ghostly light, and its mysterious disappearance<br />\nin a high vacuum, remained unexplained for years.<br />\nThen J. J. Thomson established the electron theory on<br />\nthe transmission of electricity in a partial vacuum—and<br />\nthe blue light was understood. In a very high vacuum,<br />\nhowever, the light and apparently the currents that<br />\ncaused it disappeared.<br />\nOne day, however, a scientist in the Research Laboratories of the General Electric Company proved that a,<br />\ncurrent could be made to pass through the highest possible vacuum, and could be varied according to fixed laws.<br />\nBut the phantom light had vanished.<br />\nHere was a new and definite phenomenon—a basis for<br />\nfurther research.<br />\nImmediately, scientists began a series of developments<br />\nwith far reaching practical results. A new type of X-ray<br />\ntube, known as the Coolidge tube, soon gave a great impetus to the art of surgery. The Kenotron and Pliotron,<br />\nfollowed in quick succession by the Dynatron and Mag..<br />\nnetron, made possible long distance radio telephony and<br />\nrevolutionized radio telegraphy. And the usefulness of<br />\nthe \"tron\" family has only begun.<br />\nThe troublesome little blue glow was banished nearly<br />\nforty years ago. But for scientific research, it would have<br />\nbeen forgotten. Yet there is hardly a man, woman or<br />\nchild in the country today whose life has not been benefited, directly or indirectly, by the results of the scientific<br />\ninvestigations that followed.<br />\nThus it is that persistent organized research gives man<br />\nnew tools, makes available forces that otherwise might<br />\nremain unknown for centuries.<br />\n<br />\nGeneral Office<br />\n<br />\nThe NEWS-LETTER wishes to<br />\napologize to its readers for the appearance of this issue. The urgent<br />\nnecessity of examination work has<br />\nptevented the staff of editors from<br />\nbringing to bear their literary efforts in the production of the current number. Perhaps the vast acof<br />\nadvertisements,<br />\ncumulation<br />\ncaused by the dropping of one issue, will force themselves upon the<br />\nreader's weary eye with sufficient<br />\nforce to enable our advertising patrons to feel the effects of the reaction. It is possible that our readers will peruse all the copy in this<br />\n<br />\nissue, because there is so little of ENTRIES FOR FIFTH REGIMENT<br />\nMEET POURING IN<br />\nit So, may we not beg your inContinued from page 1, Col. 5<br />\ndulgence for today's NEWS-LETThe 1,000-yard Varsity Club<br />\nless<br />\nor<br />\nmore<br />\nbeen<br />\nWe<br />\nhave<br />\nTER?<br />\nSpecial and the 600-yard Interictimized by circumstances, and scholastic Special will bring to<br />\nthat's not all.<br />\nscratch the leading college and high<br />\nschool middle distance runners of<br />\nEast. Various nearby athletic<br />\nAN<br />\nthe<br />\nTO<br />\nCOME<br />\nMIDWINTER EXAMS<br />\nEND<br />\nclubs can be depended upon to furContinued from page 1,col. 4<br />\nnfsh thrills for local fans. Due to<br />\nmuch to be pitied, is the man who the long list of events, the first<br />\ncannot find in some one of them a race will be started promptly at<br />\nwill<br />\nuse for his talents. But the ques- 7 P. M., and the floor space<br />\nbe cleared some minutes before that<br />\ntion is,—Will he serve his apprentime. A great many ushers from<br />\nticeship faithfully; will he stick among the undergraduate body will<br />\nat his task long enough to be suc- be necessary to handle the large<br />\ncrowd which will fill the Armory.<br />\ncessful?\"<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\n<br />\ne<br />\n<br />\nAN APOLOGY<br />\n<br />\nIt took<br />\nYEARSandYEARS<br />\n<br />\nto develop<br />\nCAME<br />\nC) ALIT<br />\n<br />\nWe worked on Camels for years before we<br />\nput them on the market. Years of testing—<br />\nblending—experimenting with the world's<br />\nchoicest tobaccos.<br />\nAnd now,EVERY DAY,all our skill, manufacturing experience and lifelong knowledge<br />\nof fine tobaccos are concentrated on making<br />\nCamel the best cigarette that can be produced.<br />\nThere's nothing else like Camel QUALITY.<br />\nAnd there's nothing else like Camels wonderful smoothness,fine tobacco flavor and freedom<br />\nfrom cigaretty aftertaste.<br />\nThat's why Camel popularity is growing<br />\nfaster than ever.<br />\nA better cigarette cannot be made.<br />\n•We put the UTMOST QUALITY into<br />\nTHIS ONE BRAND.<br />\n<br />\n0<br />\n<br />\ny<br />\n<br />\nSchenectady, N. Y.<br />\n95-473K<br />\n<br />\nTURKISH &DOMESTIC<br />\nBLEND<br />\nCIGARETTES<br />\n<br />\nR. J. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1922<br />\nTHIS DESERVES ATTENTION<br />\n<br />\nEditor-in-Chief,<br />\nJohn Hopkins NEWS-LETTER.<br />\n<br />\nTeachers!<br />\n<br />\nDear Sir: What possible impression of a Y. M. C. A. reading<br />\nroom could one receive upon going<br />\ninto the room provided for that<br />\npurpose at the \"Barn\"? The Y.<br />\nM. C. A. has been working hard<br />\nto carry on its program at Hopkins, but it most certainly lacks the<br />\nco-operation of the students, for<br />\nwhose benefit the \"Y\" is striving.<br />\n<br />\nor rent a Corona<br />\nBUYtypewriter<br />\non easy<br />\nCarry it to<br />\n<br />\npayments.<br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or teleplaone for a demonstration at your home.<br />\nM. W. LUCY & CO.<br />\n118 W. Fayette St.<br />\nWeighs C4lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br />\n<br />\nConditions in the reading room<br />\nat the \"Barn\" are absolutely de$RA with<br />\nplorable. The fellows eat their<br />\ncaso<br />\nlunches in there and litter the place<br />\nvi ith refuse of all sorts, paper, bits<br />\nof lunches, milk bottles, cigarette<br />\nstumps, ashes from pipes, etc. In<br />\nThe Personal Wining Madune<br />\nfact, the cond:tions are growing so<br />\nbad that one must take care to select a clean chair or bench to sit<br />\non. The furnishings, moreover,<br />\nMt. Vernon 4999<br />\narc being abused. Magazine holders are fast disappearing or are being so mutilated as to render them<br />\nuseless. No care seems to be taken<br />\nof the victrola records and many<br />\nCommercial Photography<br />\nhave been broken or scratched<br />\nthrough sheer carelessness.<br />\nCircuit Photography<br />\nViews<br />\nFlash Lights<br />\nSurely, these conditions do not<br />\nEnlargements exist because of any intentional<br />\nGroups<br />\nKODAK FINISHING<br />\nprejudice or meanness of any one,<br />\n325 N. Howard St.<br />\nbut simply because of carelessness<br />\nand thoughtlessness. \"Hopkins\"<br />\nmen would be rendering themselves<br />\nElkridge Farms Dairy<br />\ngreat credit if they would co-operate with the spirit of the Y. M. C.<br />\nSTRICTLY FRESH MILK<br />\nA. and make out of the reading<br />\nProduced, Pasteurized and Bottled<br />\nroom just what it should be.<br />\nin Howard County<br />\nHere's hoping to see some<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br />\n<br />\nCoRONA<br />\n<br />\nW.L. Mann<br />\n<br />\nmarked improvement soon. Why<br />\nnot begin the new year in the right<br />\nway?<br />\nINTERESTED STUDENT.<br />\nCANE CLUB HOLDS DANCE<br />\n<br />\nThe Cane Club held a big informal party last Monday night<br />\nat the Red Lantern Inn. This was<br />\nthe first party since the new men<br />\nwere taken into the club and it<br />\nwas intended mainly as a get-together affair, one that would<br />\nbring about closer friendship between the new and the older<br />\nmembers of the club. Dinner was<br />\nserved to the club members and<br />\ntheir partners in one of the private dining rooms and after this<br />\ndancing was enjoyed until a late<br />\nhour.<br />\n<br />\n_<br />\n<br />\n_<br />\n<br />\n•MIN‘<br />\n<br />\nClothes of Custom<br />\n14<br />\n<br />\naliiy.<br />\nN.CharlesS reet.<br />\n<br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\nWELL, OF COURSE<br />\n<br />\nBACK HOME AGAIN<br />\n<br />\nSweet Young Thing (to cavalry<br />\nsergeant)—Is it true that when you<br />\nare learning to ride it gives you a<br />\nheadache?<br />\nSarge—Oh, no, miss. Quite the<br />\nopposite.—McGill Daily.<br />\n<br />\nAlice—Have you written to that<br />\nwonderful man you became engaged to at the seaside?<br />\nVirginia—I've intended to all<br />\nalong, but I can't think of his name.<br />\n—The American Legion Weekly.<br />\n<br />\nThe Colege Drug Store<br />\n<br />\nORTMAN'S<br />\n<br />\nST. PAUL & 24th STS.<br />\n<br />\n\"Queen Quality\" Home Made<br />\n<br />\nC. D. Wolfe, Prop.<br />\n<br />\nChocolates<br />\n<br />\nDELICIOUS SODAS & SUNDAES<br />\nMade With<br />\nJersey Special Ice Cream<br />\n\"The Velvet Finish\"<br />\n<br />\nVISIT OUR ICE CREAM PARLORS<br />\n<br />\nYOU MUST BEHAVE<br />\n<br />\n\"O-0-o-oh! Stop, Billy; that<br />\nisn't nice.\"<br />\n\"My name isn't Billy,\"—Virginia<br />\nReel.<br />\n<br />\nYoung Men's Clothing<br />\nand Furnishings<br />\n<br />\nKODAKS<br />\n<br />\nCAMERAS<br />\n<br />\nSUPPLIES<br />\n<br />\nAre made a special feature of<br />\nWhitman's Chocolates and Bon Bons<br />\nhere.<br />\nGive us a call and let us become<br />\nbetter acquainted for mutual<br />\nbenefit.<br />\n<br />\n518 N. CHARLES ST.<br />\n<br />\nR. G.by & Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nDRUG STORE for J. H. U. BOYS<br />\n<br />\nCharles and 22nd Sts.<br />\n<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\nDelicious Sodas and Sundaes<br />\n<br />\nTEWARTia<br />\n(Dow..,WUA1..,.MtC,.rp4C..jfrw TL<br />\n<br />\nThe Best of Candies<br />\n<br />\nHoward at Lexington<br />\n<br />\nPrompt & Efficient Service<br />\n<br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\n<br />\nzigerimination4—d<br />\n<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\ndiscriminate more<br />\ncarefully than the college<br />\n. To his natui:al equipman?<br />\nment are added the resources<br />\nof culture and the association with great minds of all<br />\nages. Such discrimination<br />\nleads naturally to the choice<br />\nof Melachrino,the One Cigarette Sold the World Over.<br />\nWho can<br />\n<br />\n•<br />\n<br />\nURNER'S<br />\n<br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br />\n<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nlioly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 11 o'clock<br />\n<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\n<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br />\n<br />\nBALTIMORE<br />\n••••.•<br />\n<br />\nIf an Accident Occurs<br />\n<br />\nI<br />\ntti e;erj.<br />\n<br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br />\n<br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Aye,<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br />\n<br />\nOur \"prep\" room on<br />\n<br />\nthe<br />\n<br />\nthird floor specializes in<br />\n<br />\n*wt.,<br />\nOP4c,(2.,<br />\n<br />\ns<br />\n<br />\n\"<br />\n<br />\n-•<br />\n<br />\nRemernb2r that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino—it's right<br />\n<br />\nclothes for young men.<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\nelachrino<br />\n<br />\nThe One Cigarette Sold the World Over\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET rER, FEBRUARY 8, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nOPPORTUNITIES OFFERED HOPKINS STUDENTS IN EUROPE<br />\n<br />\nThe American University Union,<br />\nwith which Johns Hopkins Univer-<br />\n<br />\nThe annual bulletin of the Union<br />\nhas just been issued and may be<br />\nobtained on application to the Secretary, Professor J. W. Cunliffe,<br />\n<br />\nsity is connected as a subscribing<br />\n<br />\nJournalism Building, Columbia<br />\nstuinstitution,<br />\ncordially<br />\ninvites<br />\nImporters and Dealers in Fine Books<br />\nUniversity, New York City. The<br />\ndents and graduates of the Univer301 N. CHARLES ST.<br />\nreports show that there were 1,153<br />\nBaltimore, Md.<br />\nsity, visiting Europe, to make use<br />\nregistrations during the year at the<br />\nof the facilities offered at the<br />\nLondon office, and over 500 at the<br />\nUnion offices at 50 Russell Square,<br />\nParis headquarters.<br />\nLondon, W. C., and 1 rue de Fleurus, Paris. Lists of lodgings and<br />\npensions are kept and various social opportunities are offered. Access may also be obtained to unis<br />\nCT.° beXatterie<br />\ntj4M ES I1.&I1.&OSCAR G•L-- \\IN(<br />\nversities and other institutions of<br />\nLIBERTY ST. at SARATOGA<br />\nOWNERS<br />\nlearning, and candidates for de(Opposite Hotel Rennert)<br />\n°<br />\n6(.14 141P'<br />\n111)<br />\n2'4<br />\n'<br />\ngrees will find their way made eas29 Baltimore St., East<br />\nLUNCHEON—:—DINNER<br />\nOne Door West of Lig:lt St.<br />\nier by consulting, at Paris, Profes11:30 until 7:30<br />\nSOLE AGENTS FOR BALTIMORE<br />\nDo you know how best to provide<br />\nORDERS RECEIVED FOR<br />\nsor<br />\nPaul<br />\nVan<br />\nDyke,<br />\nDirector<br />\nof<br />\nFor College Fraternity Bands<br />\nBANQUETS SMOKERS<br />\nan income for your old age?<br />\nDANCES<br />\n(Greek Letter Societies)<br />\nCOGGINS'<br />\nthe Continental Division, and at<br />\nConsult with<br />\nBy Arrangement<br />\nTransfer and Baggage Express<br />\nLondon,<br />\nDr.<br />\nGeorge<br />\nE.<br />\nMacLean,<br />\nThe Chas. Willms Surgical<br />\nW. W. WALKER<br />\nTelephone St. Paul 6987<br />\nAUTOMOBILE SERVICE<br />\nInstrument Co.<br />\nDirector of the British Division.<br />\nPHONE, HOMEWOOD 2645-W<br />\n909 Calvert Bldg. St.Paul 2581<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nGOOD CLOTHES<br />\nNOTHING ELSE<br />\nOnly four words<br />\nhut they tell our whole story.<br />\n<br />\n800 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nBenjamin G.Lamme<br />\nthe Chicago World's Fair, in<br />\nVISITORS<br />\nsaw the first extensive use of alternatat<br />\n<br />\n1893,<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\n<br />\nN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br />\n<br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\nSHOES<br />\nfr<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price:.<br />\n<br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br />\n<br />\ning current ever undertaken, when Westinghouse<br />\nlighted the entire grounds with this type of current. This achievement marked the beginning of<br />\nthecommercialdevelopmentof alternating current<br />\nfor power purposes, and brought the induction<br />\nmotor into a prominence which it has never since<br />\nrelinquished. Great and rapid have been the developments since that day, but the most impressive aspect of this progress is not to be found in<br />\nthe spectacular evidences that are visible to<br />\neveryone, but rather, in the vision and fundamental soundness and determination that have<br />\nbeen quietly at work blazing and clearingthe trails<br />\nwhich the electrical art has followed.<br />\nThere is, for instance, the synchronous converter. This machine is the most efficient and<br />\neconomical means for changing alternating to<br />\ndirect current, which the operation of most<br />\nstreet railway systems and many other processes<br />\nrequire. Without it, the development of alternating current to its present universal usefulness<br />\nwould have been tremendously retarded.<br />\nThe synchronous converter, in its present perfection, is but one of the great contributions to<br />\nelectrical progress that have been made by Benjamin G. Lamme, Chief Engineer of the Westinghouse Electric & Manufacturing Company. Mr.<br />\nLamme, in 1891 when he was Chief Designer,<br />\nconceived and developed the converter, which,<br />\nfirst used commercially in connection with the<br />\n<br />\ngreat Niagara power plan, has since come to be<br />\nindispensible to large producers of power.<br />\nWhen a man has played so vital a part in electrical progress that his knowledge and vision<br />\nhave contributed to practically every forward<br />\nengineering step, it is perhaps misleading to attempt to identify him particularly with any one<br />\ndevelopment. His work on the induction motor,<br />\nthe turbo generator, the single-phase railway<br />\nmotor, and the synchronous converter is but<br />\ntypical of the constructive ability which Mr.<br />\nLamme has brought to bear on practically every<br />\nphase of electrical development.<br />\nA man of foresight, visioning the alternatives<br />\nin a problem as well as its hoped-for results. A<br />\nman whose mind combines great power of analysis with the gift of imagination. A prolifictechnical<br />\nwriter, whose style is unequalled in clearness and<br />\nsimplicity of expression. Few engineers so<br />\nthoroughly predetermine the results they actually achieve. Few men capitalize their experiences<br />\nso completely. And few indeed have at once his<br />\nthorough technical equipment, his commercial<br />\nunderstanding, and his broad human interests.<br />\nAn institution which has builded its success<br />\nlargely on engineering achievement pays Benjamin G. Lamme affectionate loyalty and respect.<br />\nThe young engineer on his first job, as well as the<br />\nmost seasoned co-worker, finds in him understanding, sympathy, wise counsel, and a conscienee; to all of which his associates, in preparing this article, are proud to bear witness.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 29<br />\nHOPKINS-LEHIGH MEET<br />\nTOMORROW NIGHT<br /><br />\nBALTIMORE, MD., FEBRUARY 8, 1922<br /><br />\nPRICE 5 CENTS<br /><br />\nDRAMATIC CLUB TO GIVE SPRING SPORTS TICKET SALE MIDWINTER EXAMS COME TO ENTRIES TO FIFTH REGIMENT<br />\nMEET POURING IN<br />\nAN END<br />\nTO START SOON<br />\n\"IF I WERE KING\"<br /><br />\nKeen Competition Expected. Informal Miss Walter Suffers Nervous Break- Forty Team Captains Chosen to Direct Students Advised to Boost Undergrad- Many Interesting Relays to Be Staged.<br />\nStrong Contenders from All<br />\nuate Activ:ties. Success Gained<br />\nCampaign. Publicity Bureau Endown. W. B. Swindell, Jr., to Coach<br />\nDancing to Be Held After<br />\nAtlantic States.<br />\nOnly by Sticking.<br />\ndorsed by A. A. Board.<br />\nProduction. Large Cast Necessary.<br />\nMeet.<br /><br />\nWith many entries for the big<br />\nAt a called meeting on Monday<br />\nThe spring season ticket camAfter weighty deliberations and<br />\nEverything is in readiness for<br />\nFifth<br />\nSeekers<br />\nRegiment Armory meet pourof<br />\nEarnest<br />\nSociety<br />\nthe<br />\nof<br />\nthe big meet with Lehigh tomor- many last-minute changes, the Dra- paign will take place the second<br />\nfor a Silver Lining, the following ing into the athletic office with<br />\nrow night at the Baltimore Athlet- matic Club has finally decided tc and third weeks in March. At<br />\nic Club's pool. Last year, in a very present \"If I Were King,\" a dram meeting of the Athletic Board fina Aservations were made by the every mail, Graduate Manager<br />\nKistler believes that Hopkins is<br />\nclosely contested and spectacular by Justin McCarthy, in which C. E touches were put upon the complet( Philosopher of the Barn:<br />\nand<br />\nbefore<br />\ndue<br />\nto pull off the greatest indoor<br />\n'The exams are over<br />\nmeet at Bethlehem, the Black and Sothern starred on the profession and admirable plan of campaigi<br />\nBlue was victorious by the close al stage for many years. The play published in the NEWS-LETTEI this month is past all the spring track meet ever witnessed by Balcount of 37 to 34. The outcome of which is laid in the period of Loui some weeks ago. The main fea athletic and non-athletic activities timore followers of the track and<br />\nthe meet hinged on the final event, XI, King of France, presents th( tures of this plan, it will be re- will be well under way. Now is field game. One point which has<br />\nthe 50-yard back stroke, in which story of Francois Villon, the \"poet membered, called for the divisior the time for every Hopkins man been emphasized by the organizers<br />\n\"Bill\" Reins brought victory to jailbird,\" and contains a cast o, of the entire student body into twc who has not done so before, to of the meet is that every college or<br />\nHopkins by crossing the line two 120 characters. The play is on( groups, fraternity and non-frater ask himself the question, 'What club which sends in entries must<br />\nthat is seldom attempted on th( nity, from which teams will b. am I going to do to help HopkIns see that their contestants actually<br />\nfeet ahead of his rival.<br />\nmade up. These teams will canvas: in undergraduate activities?' Un- cempete, or the cash guarantee<br />\nThe competition should be just amateur stage.<br />\ndoubtedly he will answer this not agreed to by the Games Committee<br />\nIt has been announced that tlic aiumni and the public generally.<br />\nas close this year, as both schools<br />\nMiss<br />\nWalters<br />\nunof<br />\nhave<br />\nservices<br />\nin<br />\nwords, but in action,—by com- will be refused. Formerly, the proThe Athletic Board, in approv<br />\nhave practically the same teams,<br />\nfortunately been lost to the club.<br />\ning- the plan, expressed its deep ap petition for a place on some ath- gram has always contained a large<br />\nwith Hopkins probably, having a<br />\nas far as the coaching of this year's<br />\nslight edge. Regad, of Lehigh, and production is concerned. This is preciation of the unusually fin( letic team or one of the non-athlet- number of more or less famous<br />\n,c activities. But going out for his performers who failed to show up<br />\n\"Dewey\" Hambleton, of J. H. U., due to a nervous breakdown, which work done by Mr. Kistler in pre<br />\nchosen activity is not all he will when their events were called. On<br />\nshould have a merry time in the she recently experienced. The cluL paring for the drive, which wil do; he will stick at his work, give<br />\nplunge, as both of them hold their has been fortunate to obtain Wal- mean so much to the success o. much of his time to it and finally account of this policy, many patter 13. Swindell, Jr., to direct \"If failure of every one of the sprint<br />\nhe will come out successfully after rons of the games have been bitschool records, and can always be<br />\n[ Were King.\" Mr. Swindell is a<br />\nhaving helped himself immeasur- terly disappointed when they have<br />\ndepended upon to make well over Hopkins graduate and was a cheer- sport schedules.<br />\nfailed to see the stellar attractions<br />\nForty captains of non-fraternit) ably as well as his college.<br />\nsixty feet.<br />\nleader of exceptional ability durrule,<br />\nreCouncil<br />\nStudent<br />\n\"The<br />\nin action. This year the commitIt is hoped that Captain Paul ing his undergraduate days. He is teams have been chosen by \"Andy.<br />\ngo<br />\nout<br />\nfor<br />\nFreshmen<br />\nto<br />\nall<br />\nquiring<br />\nKnecht and \"Bill\" Totterdale. The:<br />\ntee has arranged matters so that<br />\nBuhrer and \"Bob\" Hall will have now, perhaps, the leading amateur<br />\nsome activity, has done much to<br />\nwill<br />\nbe<br />\nwhom<br />\nthe<br />\nmen<br />\non<br />\nthe<br />\ndirer.<br />\nery athlete who has been widely<br />\nsatisfied the blacklist requirements, actor on the Baltimore stage and responsibility for the success of th( make new men turn out for camhas<br />\ntaken<br />\npart<br />\nin<br />\npractically<br />\nevery<br />\nadvertised<br />\nmust run, or else lose<br />\npus activities, but there is very<br />\nand if such be the case the team<br />\nproduction of note that has been drive will rest.<br />\nhis expense guarantee. It is bewill be enormously strengthened by<br />\nAn Honor Roll of men who d( little it can do to make them<br />\npresented in local circles in recent<br />\nfound<br />\nit<br />\nFreshmen<br />\nhave<br />\nstick.<br />\nlieved<br />\nthat this action will insure<br />\ntheir work satisfactorily in th(<br />\ntheir presence.<br />\nyears.<br />\nfor<br />\nout<br />\ngo<br />\ncomparatively<br />\neasy<br />\nto<br />\nthe<br />\nspectators<br />\nagainst disappointFor a<br />\nThe meet, however, will not be<br />\nThe principal and difficult role drive will be published.<br />\nrepribe<br />\nfor<br />\na<br />\nweek,<br />\nactivity<br />\nan<br />\nment.<br />\nthe only attraction of the night. of Francois Villon is assigned to man's name not to be on this roll<br />\nafter a month's inactivity, Up to the present time most of<br />\nBetween events the spectators will Pierce Brawner. The leading fe- will be a disgrace to him, as weh manded<br />\nweek and then loaf the teams have been composed of<br />\nanother<br />\nwork<br />\nbe entertained with music and male part of Hugette du Hamel is as to the university.<br />\nanother month. The reason most relay teams, but it is believed that<br />\nvarious stunts, which will be put to be taken by \"Joe\" Moran. Eli<br />\nEqually important was the -acwork is a larger list of individual entries<br />\non. After the meet, as everyone Frank, Jr., as Louis XI, and Gil- tion of the board in definitely de- men try to dodge this<br />\ndoubtless because they fail to see than ever before will also be reknows, an informal dance will be son Engel, as Thibaut D'Aussigay, ciding to establish- a Publicity Buany<br />\nchance of their own success ceived. Many of the strongest colheld in the B. A. C. gymnasium. are other leading characters in the reau. The work of W. H. Moore,<br />\nmaking<br />\na team, an editorial leges in the East are sending their<br />\nni<br />\n1he undergraduate orchestra will production.<br />\nJr., who was picked to head the<br />\nSome even doubt crack relay teams to Baltimore in<br />\ncast.<br />\nboard<br />\nor<br />\na<br />\nfurnish the music, which is guaranbureau, was endorsed when the<br />\nThe cast is as follows:<br />\nthe university special matches with their own parability<br />\nto<br />\nhelp<br />\ntheir<br />\nteed to make the feet of even the Francois Villon<br />\nBrawner constitution and outline of organi- in any way. But success, in un- ticular rivals. The most important<br />\nmost fastidious wiggl.e with spon- Hugette du Hamel<br />\nMoran zation he had drawn up was ap- dergraduate competition, as in the relays which have been definitely<br />\ntaneous exuberance.<br />\nLouis XI<br />\nFrank proved. This charter establishes a business world, is not a thing that arranged so far are: University<br />\nThe tickets for the meet and Thibaut D'Aussigny<br />\nEngel self-perpetuating board of five is thrust on a man; it is achieved of Pittsburgh versus Lafayette, in<br />\n(lance will be $1.50 per couple, and Tristam L'Hermite<br />\nHess members, and suitable assistants, only by patient and hard work a medley relay; U. S. Naval Acad$1 single admission. It is essen- Olivier Le Dain<br />\nMoore in addition to the Editor-in-Chief and above all, consistent sticking emy versus Penn. State, in a medtial that every loyal Hopkins man Noel Le Jolys<br />\nWest and the Director of Athletics.<br />\nat the task. This latter, the Stu- ley ; Princeton versus Mass, Iinstiattend this meet as the entire sea- Rene de Montigny ....Smallwood<br />\nIt was brought to the attention<br />\ndent Council cannot force a man tute of Technology, in a mile reson depends upon the success or<br />\nGuy Tobarie<br />\nKirkley of the Board that many men hav- to do; it is left for the individual lay; Carnegie Tech versus Johns<br />\nfailure of this one night.<br />\nColin de Cayeulx .....Buckheister ing no right to wear the \"H\" are himself.<br />\nHopkins, in a medley; Gallaudet<br />\nShould a sufficient amount be re- Jeban Le Loup<br />\nRich having the coveted letter put on<br />\nendeav- versus Johns Hopkins Reserves, in<br />\nthe<br />\ncrown<br />\nwill<br />\n\"Success<br />\nalized, Hopkins will be able to hold, Casin Cholet<br />\n. Jacobsen their pipes. The Board is making ors of any man who sticks to his a mile; Lehigh University versus<br />\nduring Easter week, the Eastern Ribin Turgis<br />\nSherwood an investigation of these reports aims and ideals and certainly now Lafayette, in a mile; Georgetown<br />\nIntercollegiate Swimming Associa- Petit Jean<br />\nHoffmeister and warns every man considering is the time, especially for Fresh- versus Fordham, in a mile; and U.<br />\ntion Individual Championships. Du Lau<br />\nEvans having an \"H\" put on his pipe that men, to learn this lesson. In col- S. Naval Academy Plebes versus<br />\nThis meet would bring here Giebel, Poncet de Riviere<br />\nStevens only men who have won their let- lege life and in the friendly com- University of Pennsylvania Freshof Rutgers, who is the national inDe Nautailett<br />\nMeddinger ter in a major sport have a right petition that goes with it, a man men, in a mile relay. In addition<br />\ntercollegiate 220-yard champion; Toison D'Or<br />\nCroker to wear the insignia in this way, as meets a miniature business world, to these special matches, there will<br />\nCrownover, of Swarthmore, who Montjoye<br />\nYoung well as on a sweater.<br />\none from which he may draw be four South Atlantic Association<br />\nProved such a star this year against Astrologer<br />\nSachs<br />\nmany lessons that will be of great relay events, the mile, two mile,<br />\nHopkins, and Regad, of Lehigh, Katherine de Vauselles<br />\nGardner value to him in after life. The medley,<br />\nWhite Blanche<br />\nand special one mile Freshwho, the authorities say, is expeced Mother<br />\nMount various activities are so diversi- man relay.<br />\nVillon<br />\nRoberts Guillemette<br />\nHopkins, Georgetown<br />\nto break the Association record for<br />\nSlatkin fied in character that very rare, and<br />\nCaptain of Watch<br />\nKeene Isabeau<br />\nUniversity<br />\nof Virginia will be<br />\nthe plunge, besides a large number<br />\nReaney and it might well be added, very<br />\nDenise<br />\nJehauneton le Belle Heaumiere,<br />\nthe<br />\nstrongest<br />\ncontenders<br />\nfor these<br />\nc I other stars.<br />\nHopkins<br />\nJenifer Queen<br />\nContinued on Page 2, Col. 4<br />\ntitles.<br />\nBecause of the uncertainties proThe R. 0. T. C. will stage an induced by the blacklist, it is imposter<br />\n-company event, in which either<br />\nsible to give a definite lineup for<br />\nfour<br />\nor six teams will run. An<br />\ntomorrow's meet. Manager Rowinterfraternity<br />\nrelay has been wideland, however, has announced that<br />\n;y discussed and will probably apSWIMMING MEET<br />\nthe fo:lowing men will probably<br />\npear on the final program. An inWith Lehigh tomorrow night at B. A. C. Pool.<br />\nstart for Hopkins:<br />\ntersting schoolboy battle will be a<br />\nRelay—Coady, Buhrer, RowATTENTION!<br />\nmile relay between City College<br />\nSOPHS,<br />\nland, Morrell or Johnston.<br />\nHall.<br />\nGilman<br />\nBarn<br />\nand<br />\nand<br />\nin<br />\nBaltimore Polytechnic InstiRoll<br />\nSophomores<br />\nSign<br />\nClass<br />\n50-yard Dash—Buhrer, Rowland.<br />\ntute.<br />\nIt will be the first time that<br />\n100-yard Dash—Buhrer, Lord or<br />\nDAY BIBLE CLASSES<br />\nNOON<br />\nthese<br />\nteams<br />\nhave met in two years<br />\nMorrell.<br />\nWill be continued on Wednesday, February 15, 1922, 109 M. E. Bldg., 12.25 to 12.50 P. M.<br />\nand<br />\nthe<br />\nensuing<br />\nrace is sure to be<br />\nFancy Dive—Coady.<br />\na<br />\nreal<br />\nstruggle.<br />\nWashington<br />\nTech.,<br />\nBack-stroke — Hall, Hambleton<br />\nCALL FOR CANDIDATES<br />\nEpiscopal<br />\nHigh<br />\nand<br />\nBaltimore<br />\nOr Morrell.<br />\nCity<br />\nNew competition for Business Board or Black and Blue Jay starts Monday. Candidates,<br />\n' College will meet in a triple relay<br />\nBreast-stroke — Rowland, Dunnew and old,will meet above News-Letter Office at 12.20.<br />\nfor the first time.<br />\nContinued on page 2, col. 5<br />\n220-yard Dash—Coady, Hall.<br /><br />\nNOTICES<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1922<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897.<br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22,<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssistant Managing Editor:<br />\nJ. HUDSON HUFFARD, '23<br />\nAssociate Editors:<br />\nELI FRANK, JR., '22.<br />\nCHARLES C. MARBURY,'22.<br />\nJunior Editors:<br />\nCRAIG E. TAYLOR, '24.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br /><br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., FEBRUARY 8, 1922<br /><br />\nFrom A Faint Blue<br />\nGlow To Modern<br />\nMiracles<br />\nDISON saw it first—a mere shadow of bluelight streaking across the terminals inside an imperfect electric<br />\nlamp. This \"leak\" of electric current, an obstacle to<br />\nlamp perfection, was soon banished by removing more air<br />\nfrom the bulbs.<br />\nBut the ghostly light, and its mysterious disappearance<br />\nin a high vacuum, remained unexplained for years.<br />\nThen J. J. Thomson established the electron theory on<br />\nthe transmission of electricity in a partial vacuum—and<br />\nthe blue light was understood. In a very high vacuum,<br />\nhowever, the light and apparently the currents that<br />\ncaused it disappeared.<br />\nOne day, however, a scientist in the Research Laboratories of the General Electric Company proved that a,<br />\ncurrent could be made to pass through the highest possible vacuum, and could be varied according to fixed laws.<br />\nBut the phantom light had vanished.<br />\nHere was a new and definite phenomenon—a basis for<br />\nfurther research.<br />\nImmediately, scientists began a series of developments<br />\nwith far reaching practical results. A new type of X-ray<br />\ntube, known as the Coolidge tube, soon gave a great impetus to the art of surgery. The Kenotron and Pliotron,<br />\nfollowed in quick succession by the Dynatron and Mag..<br />\nnetron, made possible long distance radio telephony and<br />\nrevolutionized radio telegraphy. And the usefulness of<br />\nthe \"tron\" family has only begun.<br />\nThe troublesome little blue glow was banished nearly<br />\nforty years ago. But for scientific research, it would have<br />\nbeen forgotten. Yet there is hardly a man, woman or<br />\nchild in the country today whose life has not been benefited, directly or indirectly, by the results of the scientific<br />\ninvestigations that followed.<br />\nThus it is that persistent organized research gives man<br />\nnew tools, makes available forces that otherwise might<br />\nremain unknown for centuries.<br /><br />\nGeneral Office<br /><br />\nThe NEWS-LETTER wishes to<br />\napologize to its readers for the appearance of this issue. The urgent<br />\nnecessity of examination work has<br />\nptevented the staff of editors from<br />\nbringing to bear their literary efforts in the production of the current number. Perhaps the vast acof<br />\nadvertisements,<br />\ncumulation<br />\ncaused by the dropping of one issue, will force themselves upon the<br />\nreader's weary eye with sufficient<br />\nforce to enable our advertising patrons to feel the effects of the reaction. It is possible that our readers will peruse all the copy in this<br /><br />\nissue, because there is so little of ENTRIES FOR FIFTH REGIMENT<br />\nMEET POURING IN<br />\nit So, may we not beg your inContinued from page 1, Col. 5<br />\ndulgence for today's NEWS-LETThe 1,000-yard Varsity Club<br />\nless<br />\nor<br />\nmore<br />\nbeen<br />\nWe<br />\nhave<br />\nTER?<br />\nSpecial and the 600-yard Interictimized by circumstances, and scholastic Special will bring to<br />\nthat's not all.<br />\nscratch the leading college and high<br />\nschool middle distance runners of<br />\nEast. Various nearby athletic<br />\nAN<br />\nthe<br />\nTO<br />\nCOME<br />\nMIDWINTER EXAMS<br />\nEND<br />\nclubs can be depended upon to furContinued from page 1,col. 4<br />\nnfsh thrills for local fans. Due to<br />\nmuch to be pitied, is the man who the long list of events, the first<br />\ncannot find in some one of them a race will be started promptly at<br />\nwill<br />\nuse for his talents. But the ques- 7 P. M., and the floor space<br />\nbe cleared some minutes before that<br />\ntion is,—Will he serve his apprentime. A great many ushers from<br />\nticeship faithfully; will he stick among the undergraduate body will<br />\nat his task long enough to be suc- be necessary to handle the large<br />\ncrowd which will fill the Armory.<br />\ncessful?\"<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br /><br />\ne<br /><br />\nAN APOLOGY<br /><br />\nIt took<br />\nYEARSandYEARS<br /><br />\nto develop<br />\nCAME<br />\nC) ALIT<br /><br />\nWe worked on Camels for years before we<br />\nput them on the market. Years of testing—<br />\nblending—experimenting with the world's<br />\nchoicest tobaccos.<br />\nAnd now,EVERY DAY,all our skill, manufacturing experience and lifelong knowledge<br />\nof fine tobaccos are concentrated on making<br />\nCamel the best cigarette that can be produced.<br />\nThere's nothing else like Camel QUALITY.<br />\nAnd there's nothing else like Camels wonderful smoothness,fine tobacco flavor and freedom<br />\nfrom cigaretty aftertaste.<br />\nThat's why Camel popularity is growing<br />\nfaster than ever.<br />\nA better cigarette cannot be made.<br />\n•We put the UTMOST QUALITY into<br />\nTHIS ONE BRAND.<br /><br />\n0<br /><br />\ny<br /><br />\nSchenectady, N. Y.<br />\n95-473K<br /><br />\nTURKISH &amp;DOMESTIC<br />\nBLEND<br />\nCIGARETTES<br /><br />\nR. J. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1922<br />\nTHIS DESERVES ATTENTION<br /><br />\nEditor-in-Chief,<br />\nJohn Hopkins NEWS-LETTER.<br /><br />\nTeachers!<br /><br />\nDear Sir: What possible impression of a Y. M. C. A. reading<br />\nroom could one receive upon going<br />\ninto the room provided for that<br />\npurpose at the \"Barn\"? The Y.<br />\nM. C. A. has been working hard<br />\nto carry on its program at Hopkins, but it most certainly lacks the<br />\nco-operation of the students, for<br />\nwhose benefit the \"Y\" is striving.<br /><br />\nor rent a Corona<br />\nBUYtypewriter<br />\non easy<br />\nCarry it to<br /><br />\npayments.<br />\nschool every day in its<br />\nneat case. Make extra<br />\nmoney writing articles or<br />\ndoing typing for others!<br />\nCalltoday at the nearest<br />\nCorona store—or teleplaone for a demonstration at your home.<br />\nM. W. LUCY &amp; CO.<br />\n118 W. Fayette St.<br />\nWeighs C4lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br /><br />\nConditions in the reading room<br />\nat the \"Barn\" are absolutely de$RA with<br />\nplorable. The fellows eat their<br />\ncaso<br />\nlunches in there and litter the place<br />\nvi ith refuse of all sorts, paper, bits<br />\nof lunches, milk bottles, cigarette<br />\nstumps, ashes from pipes, etc. In<br />\nThe Personal Wining Madune<br />\nfact, the cond:tions are growing so<br />\nbad that one must take care to select a clean chair or bench to sit<br />\non. The furnishings, moreover,<br />\nMt. Vernon 4999<br />\narc being abused. Magazine holders are fast disappearing or are being so mutilated as to render them<br />\nuseless. No care seems to be taken<br />\nof the victrola records and many<br />\nCommercial Photography<br />\nhave been broken or scratched<br />\nthrough sheer carelessness.<br />\nCircuit Photography<br />\nViews<br />\nFlash Lights<br />\nSurely, these conditions do not<br />\nEnlargements exist because of any intentional<br />\nGroups<br />\nKODAK FINISHING<br />\nprejudice or meanness of any one,<br />\n325 N. Howard St.<br />\nbut simply because of carelessness<br />\nand thoughtlessness. \"Hopkins\"<br />\nmen would be rendering themselves<br />\nElkridge Farms Dairy<br />\ngreat credit if they would co-operate with the spirit of the Y. M. C.<br />\nSTRICTLY FRESH MILK<br />\nA. and make out of the reading<br />\nProduced, Pasteurized and Bottled<br />\nroom just what it should be.<br />\nin Howard County<br />\nHere's hoping to see some<br />\nEllicott City 231 -R<br />\nCLARK BROS.<br /><br />\nCoRONA<br /><br />\nW.L. Mann<br /><br />\nmarked improvement soon. Why<br />\nnot begin the new year in the right<br />\nway?<br />\nINTERESTED STUDENT.<br />\nCANE CLUB HOLDS DANCE<br /><br />\nThe Cane Club held a big informal party last Monday night<br />\nat the Red Lantern Inn. This was<br />\nthe first party since the new men<br />\nwere taken into the club and it<br />\nwas intended mainly as a get-together affair, one that would<br />\nbring about closer friendship between the new and the older<br />\nmembers of the club. Dinner was<br />\nserved to the club members and<br />\ntheir partners in one of the private dining rooms and after this<br />\ndancing was enjoyed until a late<br />\nhour.<br /><br />\n_<br /><br />\n_<br /><br />\n•MIN‘<br /><br />\nClothes of Custom<br />\n14<br /><br />\naliiy.<br />\nN.CharlesS reet.<br /><br />\nEnglish Clothes Tailored in America<br />\nFOR SPORT, DRESS, SOCIETY<br />\nHABERDASHERY<br />\nWELL, OF COURSE<br /><br />\nBACK HOME AGAIN<br /><br />\nSweet Young Thing (to cavalry<br />\nsergeant)—Is it true that when you<br />\nare learning to ride it gives you a<br />\nheadache?<br />\nSarge—Oh, no, miss. Quite the<br />\nopposite.—McGill Daily.<br /><br />\nAlice—Have you written to that<br />\nwonderful man you became engaged to at the seaside?<br />\nVirginia—I've intended to all<br />\nalong, but I can't think of his name.<br />\n—The American Legion Weekly.<br /><br />\nThe Colege Drug Store<br /><br />\nORTMAN'S<br /><br />\nST. PAUL &amp; 24th STS.<br /><br />\n\"Queen Quality\" Home Made<br /><br />\nC. D. Wolfe, Prop.<br /><br />\nChocolates<br /><br />\nDELICIOUS SODAS &amp; SUNDAES<br />\nMade With<br />\nJersey Special Ice Cream<br />\n\"The Velvet Finish\"<br /><br />\nVISIT OUR ICE CREAM PARLORS<br /><br />\nYOU MUST BEHAVE<br /><br />\n\"O-0-o-oh! Stop, Billy; that<br />\nisn't nice.\"<br />\n\"My name isn't Billy,\"—Virginia<br />\nReel.<br /><br />\nYoung Men's Clothing<br />\nand Furnishings<br /><br />\nKODAKS<br /><br />\nCAMERAS<br /><br />\nSUPPLIES<br /><br />\nAre made a special feature of<br />\nWhitman's Chocolates and Bon Bons<br />\nhere.<br />\nGive us a call and let us become<br />\nbetter acquainted for mutual<br />\nbenefit.<br /><br />\n518 N. CHARLES ST.<br /><br />\nR. G.by &amp; Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br /><br />\nChelsea Pharmacy<br /><br />\nDRUG STORE for J. H. U. BOYS<br /><br />\nCharles and 22nd Sts.<br /><br />\nPHONE, HOMEWOOD 2121<br /><br />\nDelicious Sodas and Sundaes<br /><br />\nTEWARTia<br />\n(Dow..,WUA1..,.MtC,.rp4C..jfrw TL<br /><br />\nThe Best of Candies<br /><br />\nHoward at Lexington<br /><br />\nPrompt &amp; Efficient Service<br /><br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br /><br />\nzigerimination4—d<br /><br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\ndiscriminate more<br />\ncarefully than the college<br />\n. To his natui:al equipman?<br />\nment are added the resources<br />\nof culture and the association with great minds of all<br />\nages. Such discrimination<br />\nleads naturally to the choice<br />\nof Melachrino,the One Cigarette Sold the World Over.<br />\nWho can<br /><br />\n•<br /><br />\nURNER'S<br /><br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nST. PAUL and TWENTIETH STS.<br /><br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nlioly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\nMorning Service, 11 o'clock<br /><br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br /><br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Students<br /><br />\nBALTIMORE<br />\n••••.•<br /><br />\nIf an Accident Occurs<br /><br />\nI<br />\ntti e;erj.<br /><br />\nAnd Medicines and Dressings are required or other Real<br />\nPharmaceutical Service is Needed<br />\nTHINK OF<br /><br />\nHynson, Westcott and Dunning<br />\nTWO STORES:<br />\nEutaw Place and North Aye,<br />\nCharles and Franklin Sts.<br />\nMadison 405<br />\nMt. Vernon 890<br /><br />\nOur \"prep\" room on<br /><br />\nthe<br /><br />\nthird floor specializes in<br /><br />\n*wt.,<br />\nOP4c,(2.,<br /><br />\ns<br /><br />\n\"<br /><br />\n-•<br /><br />\nRemernb2r that Melachrino is a master<br />\nblend of the finest Turkish Tobaccos<br />\nas originated by Miltiades Melachrino.<br />\nEgyptian cigarettes are simply those<br />\nthat originated in Egypt. But the tobacco is what you want to know about<br />\n—and if it's Melachrino—it's right<br /><br />\nclothes for young men.<br /><br />\nBaltimore. Charles and Fayette<br /><br />\nelachrino<br /><br />\nThe One Cigarette Sold the World Over\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LET rER, FEBRUARY 8, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nOPPORTUNITIES OFFERED HOPKINS STUDENTS IN EUROPE<br /><br />\nThe American University Union,<br />\nwith which Johns Hopkins Univer-<br /><br />\nThe annual bulletin of the Union<br />\nhas just been issued and may be<br />\nobtained on application to the Secretary, Professor J. W. Cunliffe,<br /><br />\nsity is connected as a subscribing<br /><br />\nJournalism Building, Columbia<br />\nstuinstitution,<br />\ncordially<br />\ninvites<br />\nImporters and Dealers in Fine Books<br />\nUniversity, New York City. The<br />\ndents and graduates of the Univer301 N. CHARLES ST.<br />\nreports show that there were 1,153<br />\nBaltimore, Md.<br />\nsity, visiting Europe, to make use<br />\nregistrations during the year at the<br />\nof the facilities offered at the<br />\nLondon office, and over 500 at the<br />\nUnion offices at 50 Russell Square,<br />\nParis headquarters.<br />\nLondon, W. C., and 1 rue de Fleurus, Paris. Lists of lodgings and<br />\npensions are kept and various social opportunities are offered. Access may also be obtained to unis<br />\nCT.° beXatterie<br />\ntj4M ES I1.&amp;I1.&amp;OSCAR G•L-- \\IN(<br />\nversities and other institutions of<br />\nLIBERTY ST. at SARATOGA<br />\nOWNERS<br />\nlearning, and candidates for de(Opposite Hotel Rennert)<br />\n°<br />\n6(.14 141P'<br />\n111)<br />\n2'4<br />\n'<br />\ngrees will find their way made eas29 Baltimore St., East<br />\nLUNCHEON—:—DINNER<br />\nOne Door West of Lig:lt St.<br />\nier by consulting, at Paris, Profes11:30 until 7:30<br />\nSOLE AGENTS FOR BALTIMORE<br />\nDo you know how best to provide<br />\nORDERS RECEIVED FOR<br />\nsor<br />\nPaul<br />\nVan<br />\nDyke,<br />\nDirector<br />\nof<br />\nFor College Fraternity Bands<br />\nBANQUETS SMOKERS<br />\nan income for your old age?<br />\nDANCES<br />\n(Greek Letter Societies)<br />\nCOGGINS'<br />\nthe Continental Division, and at<br />\nConsult with<br />\nBy Arrangement<br />\nTransfer and Baggage Express<br />\nLondon,<br />\nDr.<br />\nGeorge<br />\nE.<br />\nMacLean,<br />\nThe Chas. Willms Surgical<br />\nW. W. WALKER<br />\nTelephone St. Paul 6987<br />\nAUTOMOBILE SERVICE<br />\nInstrument Co.<br />\nDirector of the British Division.<br />\nPHONE, HOMEWOOD 2645-W<br />\n909 Calvert Bldg. St.Paul 2581<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\nGOOD CLOTHES<br />\nNOTHING ELSE<br />\nOnly four words<br />\nhut they tell our whole story.<br /><br />\n800 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nBenjamin G.Lamme<br />\nthe Chicago World's Fair, in<br />\nVISITORS<br />\nsaw the first extensive use of alternatat<br /><br />\n1893,<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br /><br />\nN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br /><br />\nLEMMERT<br />\nMADE TO ORDER<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n19 and 21 EAST FAYETTE ST.<br /><br />\nSHOES<br />\nfr<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price:.<br /><br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br /><br />\ning current ever undertaken, when Westinghouse<br />\nlighted the entire grounds with this type of current. This achievement marked the beginning of<br />\nthecommercialdevelopmentof alternating current<br />\nfor power purposes, and brought the induction<br />\nmotor into a prominence which it has never since<br />\nrelinquished. Great and rapid have been the developments since that day, but the most impressive aspect of this progress is not to be found in<br />\nthe spectacular evidences that are visible to<br />\neveryone, but rather, in the vision and fundamental soundness and determination that have<br />\nbeen quietly at work blazing and clearingthe trails<br />\nwhich the electrical art has followed.<br />\nThere is, for instance, the synchronous converter. This machine is the most efficient and<br />\neconomical means for changing alternating to<br />\ndirect current, which the operation of most<br />\nstreet railway systems and many other processes<br />\nrequire. Without it, the development of alternating current to its present universal usefulness<br />\nwould have been tremendously retarded.<br />\nThe synchronous converter, in its present perfection, is but one of the great contributions to<br />\nelectrical progress that have been made by Benjamin G. Lamme, Chief Engineer of the Westinghouse Electric &amp; Manufacturing Company. Mr.<br />\nLamme, in 1891 when he was Chief Designer,<br />\nconceived and developed the converter, which,<br />\nfirst used commercially in connection with the<br /><br />\ngreat Niagara power plan, has since come to be<br />\nindispensible to large producers of power.<br />\nWhen a man has played so vital a part in electrical progress that his knowledge and vision<br />\nhave contributed to practically every forward<br />\nengineering step, it is perhaps misleading to attempt to identify him particularly with any one<br />\ndevelopment. His work on the induction motor,<br />\nthe turbo generator, the single-phase railway<br />\nmotor, and the synchronous converter is but<br />\ntypical of the constructive ability which Mr.<br />\nLamme has brought to bear on practically every<br />\nphase of electrical development.<br />\nA man of foresight, visioning the alternatives<br />\nin a problem as well as its hoped-for results. A<br />\nman whose mind combines great power of analysis with the gift of imagination. A prolifictechnical<br />\nwriter, whose style is unequalled in clearness and<br />\nsimplicity of expression. Few engineers so<br />\nthoroughly predetermine the results they actually achieve. Few men capitalize their experiences<br />\nso completely. And few indeed have at once his<br />\nthorough technical equipment, his commercial<br />\nunderstanding, and his broad human interests.<br />\nAn institution which has builded its success<br />\nlargely on engineering achievement pays Benjamin G. Lamme affectionate loyalty and respect.<br />\nThe young engineer on his first job, as well as the<br />\nmost seasoned co-worker, finds in him understanding, sympathy, wise counsel, and a conscienee; to all of which his associates, in preparing this article, are proud to bear witness.<br /><br />"}], "field_media_file": [{"target_id": 37587, "display": null, "description": null, "target_type": "file", "target_uuid": "95ec1653-a60f-4f96-902d-33f2767fcdd7", "url": "http://digital.library.jhu.edu/system/files/2022-03/12983-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12983, "target_type": "node", "target_uuid": "3a899249-15c1-4816-bacd-60bd42bb978f", "url": "/node/12983"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7c334349-9302-4a2d-a466-fe38619b31f9"}]}