{"mid": [{"value": 36769}], "uuid": [{"value": "e60a31cc-ed19-4237-a4c8-1e1e4fc0fb93"}], "vid": [{"value": 36769}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13020-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:20+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No 6<br />\n<br />\nBALTIMORE, MD., OCTOBER 20, 1922<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nTA NKMEN TO HAVE FIVE HOMEWOOD COMPANY RE- JOHNS HOPKINS BAND ORVARSITY TO TACKLE HAVPHYSICAL EDUCATION<br />\nVETERANS AS NUCLEUS<br />\nLINQUISHES ATHLETIC<br />\nGANIZING FOR BANNER<br />\nERFORD GRIDDERS ON<br />\nCOURSE REVISED FOR<br />\nFOR TEAM<br />\nCONTROL TO FACULTY<br />\nYEAR<br />\nPRESENT YEAR<br />\nFOREIGN SOIL<br />\nMany Promising Candidates Ap- Dr. Goodnow Announces Two Membership Open to All. Trip to P. T. to Present Pleasing Innova- Maroon and Black Have Pracpear in Freshman Class. ManYear Control a Failure. ComHaverford for Saturday's<br />\ntically New Team. Hopkins<br />\ntions, According to Anager Buhrer Releases Tenmittee Appointed to HanGame Planned.<br />\nLineup Unchanged<br />\nnourcement of Director<br />\ntative Schedule<br />\nale Quvsiikiiii<br />\nAt a meeting held on Monday,<br />\nPhysical training, formerly the<br />\nWith the wealth of materials on<br />\nThe.<br />\nHomewood<br />\nCompany, October 9, the Johns Hopkins Uni- bane of all Freshmen and SophoJohns Hopkins<br />\nHaverford<br />\nMiddleton ...L.E...... Rhodes<br />\nhand the prospects for the 1922- which for the past two years has versity Band organized for the mores, has been completely revised<br />\nMagill<br />\nL T<br />\nStrong<br />\n1923 J. H. U. swimming team are had complete control of the finan- coming year. By the present ar- this year into two new and attracSlowik .....L.G.... Reinhardt<br />\nCromwell ....C... Strawbridge<br />\nbright. With five members of last cial end of all Johns Hopkins .ath- rangements, all that is necessary tive courses, Physical Education I<br />\nWalbert ....R.G.... ..Jones<br />\nyear's aggregation eligible, as well letics, has been dissolved and the for membership is a desire to play and II. According to the announceLandy....R.<br />\n.. F.. Montgomery<br />\nSchact<br />\nBonner.<br />\nR.E.... Lamberti<br />\nas an abundant supply of good University has resumed control of a band instrument. For all students, ment of the Director of Physical<br />\n.Q B<br />\nWilbur<br />\nswimmers in the freshman class, it all athletic activities. This an- but in particular for the Freshmen, Education, Dr. Ronald T. AberTurnbull ... .R.H. .. . Bacon<br />\nTaylor<br />\n.L H<br />\nBillo<br />\nseems as if Captain Coady is well nouncement was made last Tues- who will have the benefit of four crombie, the army calisthenics have<br />\nRich<br />\nF B<br />\nBrown<br />\non his way toward building up a day by President Frank J. Good- years' participation, the band pre- been almost entirely replaced by<br />\nSubstitutes: Johns Hopkins—<br />\nchampionship squad. An excellent now, who said that the. aims of the sents one of the best opportunities group games. Indoor baseball, basWilson, Gilliece, Trimble, R. Middleton.<br />\nschedule has been tentatively ar- Homewood Company had fallen Oil the campus..<br />\nketball and volley ball are the parranged by Manager Buhrer.<br />\nshort of realization, and that the<br />\nDuring the year the band will ticular games chosen.<br />\nAmong the old men is Captain members of the company them- meet twice a week. Monday afterFresh from last Saturday's deThis physical training work is<br />\nPearce Coady, holder of the Hop- selves had instituted the movement noon, at four o'clock, in the Barn, required of all first and second- cisive victory over the George<br />\nkins record for the 220-yard swim. for its dissolution. In financing will be the regular time and place year students, with the exception of Washington eleven, the Black and<br />\nCoady is a flashy man in the water, Hopkins athletics on a much larger for one meeting; the bulletin boards those taking R. 0. T. C. and those Blue warriors invade foreign terhis speed in the dashes and distance scale during the past . two years will give definite information in re- who have had the equivalent work ritory tomorrow to tackle the Hayswims and on the relay team, mak- than ever before in the history of gard to the other, which will be at some other college. Although no erford team.<br />\ning him one of the main-stays of t)ie rniv.<br />\n,-T,ity, the held,in<br />\nzdits aie giv-rt iv( the course, it - The: 1\\riai'oon. ,01(1 Black ha% e but<br />\nthe rilack and Blue team.<br />\nCompany is believed to have in- The band will play at athletic con- is a requirement for graduation a small contingent of last year's<br />\nPaul Buhrer, manager- of the curred considerable liabilities which tests, R. 0. T. C. ceremonies, and and must be absolved before any team back. Out of the eleven men<br />\n1922-1923 team; is another expert led to its downfall.<br />\nwho composed the team which the<br />\nother functions that may require its degree will be awarded.<br />\nmerman. Buhrer was a member<br />\nUnder the new agreement, the services. In this connection, plans<br />\nThose students, however, who Black and Blue defeated by a 28-3<br />\nof the quartet which established University officials and faculty will are being made to take sixteen men desire to go out for some athletic score last October, only three will<br />\nthe Hopkins record for the 200- resume the control which they had to the game with Haverford on Sat- activity will be excused from the line up on Saturday. Jones, at<br />\nyard relay. Another record holder prior to the formation of the Home- urday. This project, ambitious as nhysical training work. They must guard, and Brown, at fullback, will<br />\nwho will be available this winter is wood Company and the Varsity it is for this early date, is typical report regularly for every practice start in their old position, while<br />\nWaldo Hambleton, holder of the Club. A temporary committee has of the work the band intends to do and as soon as the season is over Strawbridge, who was stationed at<br />\nJr. H. U. title for the plunge. Ham- already been appointed by Dr. this year.<br />\nthey must return to Physical Edu- end last year, has been switched to<br />\nbleton's distance of 65 feet 6 inches Goodnow to decide upon the .fuIf a student lacking experience cation. Norman C. Keyes, gradu- the center position. Brown is the<br />\nwas made at New Brunswick, N. ture of Hopkins athletics. On this with band instruments wishes to ate manager of athletics, will have mainstay of the team this year. He<br />\nJ., two years ago, in a meet with committee are W. Graham Boyce, join he may do so. The R. 0. T. charge of these men. His task will scored the only two touchdowns his<br />\nRutgers. Chris Johnston, who Dr: Ronald T. Abercrombie, C. will furnish the instrument, the be to check up the rolls of the as- team has made this year, and was<br />\nhelped establish the Hopkins record Blanchard Randall, Jr., George A. student can obtain an instructor, sistant managers of the various responsible for the extra point affor the 160-yard relay three years Stewart, Robertson Griswold and and, after learning the elements, he sports.<br />\nter both. Wilbur, who played part<br />\nof<br />\nthe game at halfback and was a<br />\nago, is now a student at the Med- Dr. Goodnow. This committee met may become a member. All that<br />\nBecause of the lack of proper<br />\nconsistent<br />\nical Srhool rid lip .;s<br />\nground gainer, will call<br />\nlast Tuedayat the Ur.i.iv.?,rsity and i'ih1. he ast•-,<br />\n:d of him i,ili be to :10 spacc indoor,the physical training<br />\neffort to rejoin the squad this year. steps were taken to keep Hopkins his best in company with the other work will be done out-of-doors. the signals. Billo, another of last<br />\nMorrell and Dunning, two mem- athletics on a solid basis.<br />\nmembers. Mr. F. E. Campbell. During the inclement weather, the season's scrubs, will be seen at one<br />\nbers of last year's team, will report<br />\nBoth the Homewood Company leader of the band, is planning an class will assemble indoors and will of the halfback positions.<br />\nto Captain Coady when practice and the Varsity Club were formed organization of forty pieces, and receive lectures on hygiene from<br />\nIt is practically impossible to atstarts. Both men have had only in the spring of 1920 by a large requests the support of the students Dr. Abercrombie. The games will tempt to predict the outcome by a<br />\none year's experience, but showed group of Hopkins alumni, most of in the enterprise.<br />\nbe under the supervision of mem- comparison of scores. Haverford<br />\nmuch promise last season.<br />\nwhom were .former letter men. The<br />\nMembership in the band is ac- bers of the Reserve Officers' Train- has yet to win a game this year,<br />\nWelsh,<br />\nSauerwein,<br />\nStevens, purpose of the organizations was companied by numerous benefits. ing Corps staff. Captains Shriver holding Stevens to a 0-0 tie and losHoward and Rob Middteton are to boost Hopkins athletics in the There is the opportunity of learn- and Cummins, cadet officers in this ing to Trinity College, 21-14, in<br />\namong the freshmen who are ex- college world and to control the ing to play at the least possible ex- department, have been making ef- their only two starts. In both<br />\npected to try for positions on the finances of all teams. The Home- pense. Members of the band en- forts to persuade those taking games, however, the Maroon and<br />\nswimming team. Welsh and Sauer- wood Company secured first-class gaged in R. 0. T. C. work or phys- Physical Education to change to Black backfield men demonstrated<br />\ntheir ability as broken field runners.<br />\nwein are well known in Baltimore coaches, arranged real athletic ical training are excused from drill the R. 0. T. C.<br />\nIt is the first time in several years<br />\nas unusually fast men. Middleton schedules and raised the caliber of or training once a week. Morecame to Hopkins from St. Luke's all the teams.<br />\nover, membership in a recognized TWENTY-ONE 'RELIGIONS that the Haverford gridders had<br />\nSchool, where he was a star swimjust what effect this change of campus activity, accompanied by REPRESENTED AT J. H. U. met defeat at the hands of Trinity,<br />\nmer. Ridgely Howard is holder of management will have on Hopkins the chance to work for the college,<br />\nThe students of the Johns Hop- and the latter's victory was a disthe South Atlantic InterAcholastic athletics is not yet known. It was is certainly desirable.<br />\nkins University represent many tinct surprise.<br />\nIt is probable that the same Black<br />\nrecord for the plunge. Several the Homewood Company which SeAccording to Mr. Campbell, pros- types of religious beliefs, in all<br />\nother freshmen and upper-classmen -tired Ray Van Orman as athletic pective members should signify there are twenty-one various sects. and Blue lineup will be seen as that<br />\nare likely to join Captain Coady's director and head football coach, their intention to join as soon as<br />\nThe Methodists head the list with which started against George Washsquad as soon as the season starts. and the faculty cannot make any possible. Either see the leader per- a total of one hundred and forty- ington, with the exception, of<br />\nThe tentative schedule released change without inflicting a tre- sonally, or drop a note in his post- six students, or Over twenty-three course, of Ed Milinausky, who sufby Manager Buhrer is as follows: mendous blow upon the athletic office box, No. 230. State whether per cent. of the total attendance. fered a broken shoulder and collarJanuary .3—Navy, at Annapolis. prestige of the .University.<br />\nor not you have had experience, The Episcopalians are next in or- bone in Saturday's conflict. Slowik<br />\nJanuary 19—Swarthmore, at home.<br />\nwhat instrument you play or would der, with one hundred and twenty- is slated to start in at guard, with<br />\nFebruary 10 — Columbia, away FIRST OF TURNBULL LEC- like to play, your name, and the nine, or seventeen per cent., and Councill held in reserve.<br />\nTURES ON POETRY WELL<br />\nnumber of your post-office box.<br />\n(pending).<br />\nthird are the Hebrews, with ninety- • The showing of the backfield last<br />\nATTENDED<br />\nFebruary 16 — Lehigh, away<br />\nsix, or fifteen per cent, of the whole Saturday was a complete surprise.<br />\n\"Poetry is the breath and finest<br />\nDELTA GAMMA THETA<br />\n(pending).<br />\nIt is pleasing to note that there Taylor, Turnbull and Bonner, after<br />\nOn account of an error on the are not quite seven per cent, of the the first quarter, made gains at will.<br />\nFebruary 17 — Syracuse, away spirit of all science. Nothing will<br />\never silence the appeal of poetry.\" Part of the .editor of the Y. M. C.<br />\n(pending).<br />\nstudent body who do not consider Taylor, playing his second game of<br />\nSuch<br />\nwere the sentiments expressed A. Handbook, the Delta Gamma themselves joined<br />\nMarch 3—Rutgers, at home.<br />\nto some Church collegiate football, showed promise<br />\nlast Monday afternoon by Dr. Theta Fraternity, Chapter House, of<br />\nMarch 10—E. C. S. A., away.<br />\nof becoming an excellent carrier_<br />\nGod. .<br />\nMarch 17-1. C. A. A. A. A., James W. Bright, graduate profes- 2721 Oak Street, was not listed<br />\nThe following are the different The 150-pound halfback was selsor of English, at the \"annual feast with the other recognized frater- denominations<br />\naway.<br />\nin the University: dom stopped short of a ten-yard<br />\nof high thought,\" the twenty-fourth nities.<br />\nMethodist, 146; Episcopal, 109 gain when he carried the ball<br />\ncourse of Percy Turnbull Memorial<br />\nNOTICE<br />\nHebrews, 96; Lutheran, 61; Pres- around the end or off-tackle. TurnLectures- on Poetry. This course<br />\nR. 0. T. C. NOTICE<br />\nAll students should go to<br />\nbyterian, 50; Roman Catholic, 39; bull could always be relied on for<br />\nwas established in 1889 by Mr. and<br />\nthe Registrar's Office and fill<br />\nOlive drab shirts are now on Baptist, 27; Reformed, 15; Congre- two or three yards through the line.<br />\nout their schedule cards at<br />\nMrs. Lawrence Turnbull for the hand and can be purchased in the gational,<br />\n8; United Brethren, 7; Rich, who was moved to fullonce. This information is abpurpose of commemorating .the loft of Gilman Hall for $4.00, the Friends,<br />\n5; United Evangelical, 3; back at the last moment, backed up<br />\nsolutely required by the office,<br />\nname of their son, Percy Graeme wholesale price. All men without<br />\nChristian, 3; Greek Orthodox, 3; the line and led interference in a<br />\nand a fine of $5 will be imTurnbull. In accordance with the them are urged to get these shirts Reformed<br />\nEpiscopal, 2; Plymouth noteworthy manner.<br />\nposed upon those failing to<br />\nterms of the gift, a course of lec- at once. The shoes are expected<br />\nBrethren, 2; Universalist, 2; TheThe forward passing of the<br />\ntake such action by 4 P. M. tures is<br />\ndelivered annually by some shortly, and notice of their arrival osophist, 1; Disciples,<br />\n1; Christian Black and Blue team showed deon next Tuesday, October 24.<br />\none who has gained distinction as will be posted on the R. 0. T. C. Science,<br />\n1; Unitarian, 5; no pref- cided improvement. It seemed as<br />\nBy Order of the Dean.<br />\nContinued on page 2, col. 4<br />\n•<br />\nBulletin Board near the post office. erence, 43.<br />\nContinued on page 2, col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922<br />\n<br />\nCROMWELL ELECTED SENIOR<br />\nDR. FOSTER,SCIENTIFIC THEOLOGIAN, TO ANSWER<br />\nPRESIDENT<br />\nSTUDENTS' QUESTIONS<br />\nThe Senior Class held their elecFOUNDED 1897.<br />\nRev. Allyn K. Foster, of Grantion of class officers on Monday,<br />\nville, Ohio, well known throughout<br />\nOctober 16, one week following the<br />\n$2.00<br />\nThe same jinx that deprived the<br />\nSubscription<br />\nthe country as editor, author,<br />\nnominations. M. Jenkins Cromwell<br />\nBlack and Blue of the services of<br />\nBaptist preacher and stuteacher,<br />\nwas elected president of the class.<br />\nat<br />\nPostoffice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\nmatter<br />\nEntered as second-class<br />\nWerner and Willis permanently,<br />\ndent secretary of the Board of EdThe officers of the Class of 1923<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nand Wilson and Coady temporarBaptist<br />\nthe<br />\nNorthern<br />\nof<br />\nucation<br />\nare:<br />\nily, slipped past the gatekeeper last<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nConvention, has been secured by<br />\nPresident—M. Jenkins CromHopkins University.<br />\nSaturday and, before the game was<br />\nthe Hopkins \"Y\" to make a twowell.<br />\nMANwell, under way, had laid hands on<br />\nBusiness communications should be addressed to the BUSINESS<br />\nVice-President—Walter H. Somand other comhunications day visit to the University on MonAGER, JOHN HOPKINs UNIVERSITY; all articles<br />\nEd Milinausky, left guard. Ed,<br />\nday and Tuesday, October 23<br />\nerville.<br />\nshould be sent to the MANAGING EDITOR.<br />\nwith both collar and shoulder bones<br />\nSecretary—Glover P. Fallon.<br />\nHomewood 100 and 24.<br />\nbroken, is probably out for the rest<br />\nTelephone<br />\nIn his present capacity, Dr. FosTreasurer—George V. B. Shriof the season.<br />\nter has had the rare experience of<br />\nver.<br />\naddressing<br />\nManager:<br />\n300,000<br />\napproximately<br />\nBusiness<br />\nSergeant-at-Arms—Charles C. G.<br />\nEditor-in-Chief:<br />\nyears.<br />\nthe<br />\nduring<br />\npast<br />\ntwo<br />\nWILLIAM H. MOORE, JR., '23.<br />\nstudents<br />\nSaturday<br />\nlast<br />\nEvans,<br />\nobservers<br />\nClose<br />\n'23.<br />\nGLOVER P. FALLON,<br />\nHe has visited educational insti- would have noticed that of the six<br />\nManaging Editor:<br />\ntutions ill 34 states. He is more touchdown made by the Black and<br />\nJ. HUDSON HUFFARD, '23.<br />\nAdvertising Manager:<br />\ngenerally popular with students all Blue,, two were made by Middle- LECTURES TO ELECTRICAL<br />\nAssistant Managing Editor:<br />\n'23.<br />\nCLUB<br />\nDONALD K. VANNEMAN,<br />\nthrough the country than any oth- ton, No. 7, and three by Rich, No.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nThe<br />\nprogram of the last meeting<br />\ner one speaker.<br />\n11. Come on, NATURAL!<br />\nAssociate Editors:<br />\nof<br />\nthe<br />\nElectrical Club proved to be<br />\nDr. Foster was born in BaltiRIGNAL W. BALDWIN, JR., '23.<br />\nall<br />\ninteresting<br />\none. After reports<br />\nfrom<br />\nB.<br />\nA.<br />\nhis<br />\nManagers:<br />\nmore and received<br />\nAssistant Business<br />\nIt seems that Maryland is soon from the various standing commitJunior Editors:<br />\n'23.<br />\nHEARN,<br />\nfrom<br />\nC.<br />\nA.<br />\nhis<br />\nBERNARD<br />\nM.<br />\nJohns Hopkins,<br />\nRANDOLPH NORWOOD, '24.<br />\nto have some exciting inter-state tees, Mr. White deliveted a lecture<br />\nFITZGERALD DUNNING, '24.<br />\nT. REESE MARSH, '24.<br />\ndegree<br />\nhis<br />\ntheological<br />\nand<br />\nYale,<br />\n'25.<br />\nHOWARD,<br />\nPHILIP W.<br />\nbattles. Washington College, St.<br />\nR. C. TILGHMAN, '25.<br />\nfrom the Southern Baptist Theo- John's and Western Maryland of unusually high caliber. His subMILES D. MARRIAN, '25.<br />\nWILLIAM G. DEAN, '24.<br />\n'25.<br />\nG. DONALD GIESKE,<br />\nJOHN W. PARSONS, '25.<br />\nlogical Seminaty, Louisville, Ky. have teams 100 per cent, stronger ject was \"The Electric Automobile<br />\nJ. D. SLAUGHTER, '23.<br />\nBENJAMIN T. ROME, '25.<br />\nStarter.\" In delivering this lecture<br />\nFew men have enjoyed as broad than last year's aggregation.<br />\nMr. White displayed heretofore<br />\nand interesting experiences as he.<br />\nhidden<br />\ntalent .in combined humor,<br />\nDr. Yostter's miniSterial offices<br />\nwit<br />\nand<br />\nknowledge. He has set a<br />\na<br />\ngame<br />\nthe<br />\nWith<br />\nPennsylvania<br />\nhave ranged from chaplain of WorAssociation.<br />\nMember of Southern Intercollegiate Newspaper<br />\nhigh<br />\nfor those who will<br />\nstandard<br />\nof<br />\nof<br />\nhistory, the University<br />\ncester County jail to preacher in matter<br />\nto<br />\nin the future.<br />\nspeak<br />\nthe<br />\nclub<br />\nreste Halle, Coblenz, Germany, Maryland has only V. P. I., Yale,<br />\nThis<br />\nwas<br />\nmeeting<br />\nattended by the<br />\nBaltimore, Md. during a part of its occupation by and Princeton confronting them.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts.,<br />\nIn<br />\nJunior<br />\nElectrical<br />\nEngineers.<br />\nthe U. S. Army. For two years Save eleven men for the Hopkins<br />\nhaving<br />\nthis<br />\nlecture<br />\nthey<br />\nbeen<br />\nhave<br />\nhe did Y. M. C. A. service in the game, Curly Byrd. There's going<br />\nintroduced to a subject which is at<br />\n1922<br />\n20,<br />\nWorld War, remaining in France to he a big crowd on hand.<br />\nOCTOBER<br />\nBALTIMORE, MD.,<br />\npresent a big problem before engiand Germany for 18 months. AfThis is but a forerunner to<br />\nneers.<br />\nter returning to America he was<br />\nPessimists point to Virginia's<br />\nthe<br />\nmany<br />\nsubjects that will be disappointed to his present position as 5-0 record at Princeton.. Don't<br />\nSPORTSMANSHIP<br />\na<br />\nin<br />\ncussed<br />\nlater meeting-.<br />\nstudent secretary of the Board of forget that the boys from Old<br />\nnearer<br />\nstep<br />\na<br />\nand<br />\nbody<br />\nstudent<br />\nthe<br />\nby<br />\nmade<br />\nAn excellent move was<br />\nEducation.<br />\nDominion only beat George Washof the oldto perfect sportsmanship was reached with the abolishment<br />\nDr. Foster's special field of ington 34-0, which is far from a<br />\nSTUDENT COUNCIL<br />\npenalty study has been in what has been superhuman- feat. Don't forget,<br />\ntime practice of cheering the football referee for inflicting a<br />\nAt a recent meeting of the Councalled Scientific Religion. He talks too, that Coach Van Orman has<br />\ncil, J. W. Huey was elected secreupon an opponent. As we look back upon the old days, when the prac- usually upon subjects that are akin<br />\npractically a new combination, and<br />\nhundred<br />\nseveral<br />\nof<br />\nsight<br />\nthe<br />\nthat<br />\nadmit<br />\nmust<br />\nwe<br />\ntice was in vogue,<br />\nto the controversy between science that __it is running smoother every tary-treasurer.<br />\nThere afe two more vacancies to<br />\nrooters cheering themselves hoarse at an opposing team's misfortune and religion. His whole point of day. It's going to be a hard batis<br />\nhe<br />\nyet<br />\nand<br />\nconstructive,<br />\nis<br />\nview<br />\nbe<br />\nfilled before the Council is comthe<br />\nBlack<br />\nbut<br />\nweek,<br />\ntle tomorrow a<br />\nwas not an awe-inspiring sight. It seems really no more commendable<br />\nprepared to meet scientists on their and Blue is very much in the run- plete. These places will be filled<br />\nthan applauding an injury of a visiting player.<br />\nown ground.<br />\nning.<br />\nin the near future, when two deleis<br />\nHe<br />\nunsportsmanlike.<br />\nThe \"Y\" is planning to have Dr.<br />\nbe<br />\nto<br />\nintend<br />\nThe average rooter does not<br />\ngates, one from the Senior and one<br />\nFoster lead open forum discussion<br />\nThe outcome of two of tomor- from the Freshmen Classes, will be<br />\nusually so enwrapped in the progress of his team that he inconsiderately groups on Monday at 1 P. M. and<br />\nrow's games is being awaited with<br />\nside.<br />\nelected.<br />\nat 4 P. M., in Rooms 109 or 110<br />\n,expresses his approval at every \"break\" in the favor of his<br />\neagerness by football fans from<br />\nposPlans were formed for the<br />\nif<br />\nand,<br />\nethics,<br />\nBuilding,<br />\nrooters'<br />\nE.<br />\nthe<br />\nM.<br />\nof<br />\non<br />\nwork<br />\na<br />\nThere has probably never been written<br />\ncoast to coast. The Center Col\"Frosh-Soph\"<br />\nTueson<br />\nfootball game and<br />\none<br />\nanother<br />\nhave<br />\nto<br />\nsible,<br />\na good<br />\nlege eleven, eager for a repetition for the \"Rush\"<br />\ntherefore, no definite rules can be laid down. It is generally<br />\nwhich will follow<br />\nday at a time to be announced<br />\nof last year's result, invades Cam- the game.<br />\nviewfellow's<br />\nother<br />\nthe<br />\nfrom<br />\nproposition<br />\nthe<br />\n7.30<br />\nat<br />\nat<br />\nlook<br />\nevening,<br />\nonday<br />\nI<br />\nOn<br />\nto<br />\nlater.<br />\nplan, however,<br />\nbridge for its third annual contest<br />\nThere will be another meeting of<br />\na<br />\nSome institutions obtain reputations for poor sportsmanship, o'clock, Dr. Foster will address<br />\npoint.<br />\nwith Harvard. The Kentuckians the Student Council Sunday night,<br />\nMark's<br />\n-view. group of students at St.<br />\nwere nosed out in 1920, but took a at 7:15. The place will be anothers for good. It is all a matter of the other fellow's point-of<br />\nLutheran Church, St. Paul and<br />\nfall<br />\nOut of the Crimson last year. nounced later.<br />\nPalmer<br />\nFor instance, the Hopkins rooter at the Princeton game, at<br />\nTwentieth Streets. The meetings<br />\nMidshipmen from the Naval<br />\nThe<br />\nUniStadium, on September 30, brought back a most favorable opinion of are open to all members of the<br />\nAcademy engage the fast-moving<br />\nversity and will prove of particular<br />\n• DEBATING COUNCIL<br />\nGeorgia. Tech .eleven tomorrow, at<br />\nPrinceton sportsmanship.<br />\n_<br />\ninterest to those men whose reAnnapolis. Navy has been mowSo far this year, the Debating<br />\nOne of the most useless and really discourteous habits of cheering ligious convictions have been<br />\nall opposition for several Council has not become active. A<br />\ning<br />\ndown<br />\nconferbodies is that of objecting to a referee's decision. There is never one shaken by science. Private<br />\nfrom the Tor- meeting of its members is expectFoster years, but trouble<br />\nDr.<br />\nwith<br />\nhad<br />\nbe<br />\ncan<br />\nences<br />\npresunder<br />\ndecision<br />\nhis<br />\nnadoes is predicted. If wishes ed at an early date, for already<br />\ncase in a thousand where an arbiter will change<br />\nby leaving your name at the \"Y\"<br />\ndo it, Georgia<br />\ncould<br />\novertures have been received for<br />\nthe<br />\neggs<br />\nand<br />\nvork<br />\nN<br />\n.<br />\nhis<br />\nsure of fan threats. It does frequently unsteady<br />\noffice.<br />\ndebates with the following colleges:<br />\nDr. Foster's unusually broad<br />\nplayers to dissatisfaction.<br />\nCollege, Los Angeles,<br />\nOccidental<br />\nrange of experience, his rare and<br />\nTURNBULL LECTURES<br />\nCal.: University of Maryland, UniIt is to be hoped that the Black and Blue cheering section will gain genial personality, and his deep<br />\nContinued from page 1<br />\nversity of Richmond.<br />\nfor itself only criticism of the praiseworthy variety, and will occupy a earnestness ill spirituality cause<br />\na writer or critical student of<br />\nThe contest of the Southern Orahim to be one of the most sought poetry.<br />\nhigh position on the pedestal of good sportsmanship.<br />\ntorical Association for the year<br />\nafter speakers for students. Dr.<br />\nThe speaker this year is Emile 1922-23 will be held at Hopkins in<br />\nFoster, being a Hopkins man himD. es. L., Professor of the early spring. This was won<br />\nLegouis,<br />\nself, will without a doubt prove to<br />\nEnglish Literature at the Univer- last year by Albert S. Langluttig,<br />\nbe interesting to and interested in<br />\nsity of Paris. His subject, which who is now president of the assoMORE BUTTONS<br />\nthe fellows on the campus today.<br />\nserved as an introduction for the ciation. The present secretary is<br />\ngeneral<br />\nRussian<br />\nthe<br />\ntoward<br />\nnotch<br />\nanother<br />\nmove<br />\nwill<br />\nfreshman<br />\nother five lectures of the course, Dr. John C. French, of our faculty.<br />\nTACKLE<br />\nThe<br />\nBLACK AND BLUE TO<br />\nHAVERFORD<br />\nform<br />\nthe<br />\nThe Council plans to enter the<br />\nin<br />\nwas \"The Life and Career of Spenclass when he adds decoration No. — to his collection,<br />\n(Continued from page 1)<br />\naddress,<br />\nhis<br />\nbeginning<br />\nBefore<br />\nannual triangular debate between<br />\nhonor must be worn if the ends and backs were always ser.\"<br />\nof a student activities button. This medal of<br />\nemphasized the fact Hopkins, the University of North<br />\nLegouis<br />\nM.<br />\non the University in the exact spot to receive the ball. that the privilege of speaking here Carolina, and<br />\nalong with his \"F\" button at all times that he is<br />\nWashington and Lee<br />\nIt is expected that a large numof tokens University. These debates are usthousands<br />\nthe<br />\nSoph<br />\nthe<br />\nof<br />\nfrom<br />\none<br />\nis<br />\nprotection<br />\nfor<br />\nrequired<br />\nis<br />\nothers,<br />\nall<br />\ngrounds. It, above<br />\nber of students will journey to<br />\nof friendship shown by America to ually held in the early spring, when<br />\nHaverford to witness tomorrow's<br />\ndisciplinarians.<br />\nFrance.<br />\nsome topic of current interest is'debuttons to battle. A few have already made<br />\n- The head of each- recognized activity will distribute the<br />\na<br />\nshort<br />\nwith<br />\ndescripbated. Each college enters an afBeginning<br />\narrangements to go up with the<br />\nunand<br />\nkept<br />\nand a negative team, and<br />\nbe<br />\nwill<br />\nfirmative<br />\nroll<br />\naccurate<br />\nphysical<br />\ncharacteristics<br />\nthe<br />\nof<br />\ntion<br />\nAn<br />\nthe workers for his own staff.<br />\nteam, while many more are likely<br />\ncustom<br />\nhas been to have the<br />\nthe<br />\nLegouis<br />\nProfessor<br />\nSpenser,<br />\nprotective to motor up. It is expected that of<br />\nexcuSed delinquencies should call for. the forfeiture . of the<br />\nteams<br />\ncompete<br />\non neutral ground—<br />\ndiscussion<br />\na<br />\nthe Band will take the trip in suf- went on with lengthy<br />\none<br />\nand<br />\ncollege<br />\nentertaining teams<br />\nbadge.<br />\nficient numbers to participate in the of his mental characteristics,<br />\nactivfrom<br />\nthe<br />\nthe<br />\nhis<br />\nindividual<br />\nby<br />\ntwo<br />\nother<br />\nof<br />\nmembers of the<br />\nconcluded with the story<br />\nUnless the- scheme is efficiently supported<br />\ncheering section.<br />\ntriangle.<br />\nlife.<br />\nities the purpose of the Student Council will be entirely defeated.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nGridiron Gossip<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922.<br />\nRECEPTION FOR OUT-OFTOWN MEN BIG SUCCESS<br />\nHopkins men from foreign<br />\n'countries and from all parts of the<br />\nUnited States became acquainted<br />\nwith the pastors and some of the<br />\nmembers of the churches in the vicinity of the University last Friday night, at an interdenominational meeting held at the Friends<br />\nMeeting House by the Hopkins<br />\nY. M. C. A. and the Neighborhood<br />\nChurches. The reception was held<br />\nto bring the out-of-town student in<br />\ntouch with the nearest church of his<br />\nown denomination.<br />\nThe University men, led by John<br />\nSherwood, started the meeting by<br />\nsinging some Hopkins songs. The<br />\nRev. Dr. Harris made the opening<br />\nprayer. Mr. Morriss, general secretary of the \"Y\", who acted as master of ceremonies, explained the<br />\npurpose of the reception. He said<br />\nhe would like the students to know<br />\nthat the Friends Meeting House.<br />\nwith its library, is always open to<br />\nHopkins men.<br />\nThe ministers representing the<br />\nvarious denominations gave short<br />\nin the \"that-reminds-Me\"<br />\ntalks<br />\nvein, while Mr: Morriss held the<br />\nstopwatch. One and all urged the<br />\nstudents to join a church and participate in the church life of whatever denomination they preferred.<br />\nThe speakers were: The Rev. Dr.<br />\nNeilly, of the Waverly Presbyterian Church Rev. Dr. Morgan, of<br />\nthe First Methodist Episcppal ;<br />\nRev. Dr. Harris, of the Wilson Memorial M. E. South; Rev. Dr. Warner, of St. John's Methodist Prot estant ; Rev. Arrowsmith, of the<br />\nPro-Cathedral; Rev. Dr. Clare, of<br />\nSt. Mark's Lutheran; the Rev. Dr.<br />\nDixon, wlihas just retnrucd.irom<br />\nChina to take charge of the University Baptist Church, and Mr.<br />\nLouis Moon. secretary of the<br />\nFriends Meeting House.<br />\n• Dr. French, chairman of the Student Advisory Committee, pointed<br />\nout that American colleges supervise their students' mental training,<br />\nbut not their moral, andlie thanked<br />\nthose responsible for the meeting<br />\nfor taking an interest in the latter.<br />\nHe told the students that participation in community life, as well as<br />\nstudies, was an important part of<br />\ntheir education.<br />\nAt the close of the speeches refreshments were served, and the<br />\nstudents had a chance to meet the<br />\nchurch people who were present.<br />\n<br />\nFIRST ISSUE OF BLACK AND<br />\nBLUE JAY TO APPEAR SOON<br />\nThe first issue of the Black and<br />\nBlue Jay went to press Monday,<br />\nand will be distributed about October 27. It is the \"Renaissance<br />\nNumber,\" devoted to the \"Revival<br />\nof Learning\" (the return to college). Black and Blue Jay men are<br />\nnow working on the \"Fraternity<br />\nNumber,\" and are on the trail of<br />\nlaughs and low snickers concerning<br />\nthe \"Frats\" and college life in general. Competition is developing<br />\namong the candidates for the staff,<br />\nand they will have to work hard.<br />\nThe Black and Blue Jay wants<br />\nsubscribers outside of the University. Subscription cards will be<br />\nplaced in the P. 0. boxes along<br />\nwith the first issue of the magazine. Students are asked to get<br />\nsubscriptions from their numerous<br />\nfriends.<br />\n<br />\nDR. GILDEFtSLEEVE IS NINETY-ONE ON MONDAY<br />\nDr. Gildersleeve, the noted<br />\nscholar and teacher, who retired<br />\nfrom the active duties of his professorship at thp Johns Hopkins<br />\nUniversity not many years ago,<br />\nwill celebrate his ninety-fir-st birthday this coming Monday, October<br />\n23. Fast nearing the one hundred<br />\n-nark, this well-known figure in national and international circles is<br />\nstill active and healthy.<br />\nUnfortunately, the doctor's eyes<br />\nhave given him trouble, so that he<br />\nis forced to rely, in part, upon his<br />\nfriends and his memory for his associations with the classics which<br />\nhe loves so well. However, he is<br />\nkeeping steadily abreast of the<br />\ntimes and always a learned Greek<br />\nscholar, he now revels in the old<br />\nGreek classics, whose texts he reviews time and again in his sheer<br />\n'ove for and appreciation of their<br />\n)utstanding beauty.<br />\nThe anniversary of Dr. Gildersleeve's birth will be passed in the<br />\npresence of only a few of his<br />\nclosest friends.<br />\n<br />\nY. M. C. A. NOTICES<br />\nThe Y. M. C. A. has gone to<br />\nconsiderable expense in the purchase of a number of magazine<br />\ncovers, hoping to render current<br />\nmagazines more durable and convenient for the benefit of the students. This purpose, however, is<br />\nbeing defeated by the fact that they<br />\nare sometimes removed from the<br />\nroom in which they have been<br />\nplaced. Hereafter please leave them<br />\nwhere you find them.<br />\nThe Y. M. C. A. wishes to remind the student body that it is<br />\nrunning a Lost and Found Bureau,<br />\nand that the Association is anxious<br />\nto be of service in this respect. This<br />\ncan only be accomplished, however,<br />\nby the co-operation of the students.<br />\nPlease don't forget about it.<br />\n<br />\nFACULTY NOTES<br />\nDr. John Holladay Latane, Dean<br />\nof the College Faculty, is leaving<br />\nthis week for South America,<br />\nwhere he will visit the Brazilian<br />\nCentennial Exposition held at Rio<br />\nde Janeiro, Brazil. In his absence<br />\nDr. Joseph Elliott Gilpin, Collegiate<br />\nProfessor of Chemistry, will act as<br />\ndean and will have the same conference hours, from 11:30 to 4:30,<br />\nat the office Of the Dean, Gilman<br />\nHall.<br />\n<br />\nSafe Deposit & Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\n00<br />\n<br />\nHOCHSCHILD,KOHN 8cCo.<br />\nFAs<br />\n?he apex<br />\ninfasluonable<br />\nneckwear<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\n<br />\nThe popularity of<br />\nFa3hionknit t i es<br />\nhas caused a mushroom growth of<br />\ncheaper imitations<br />\nto spring up.<br />\nBut when you<br />\ncompare the neckwear it's easy to<br />\nsee why the others<br />\nare cheaper.<br />\nWe feature none<br />\nbut the genuine<br />\nFashionknit, and<br />\nhave an unparralelled assortment.<br />\nJJ iA.<br />\n<br />\nTHE<br />\n<br />\nOf the Better Class<br />\n<br />\nThe tARN<br />\nCAFETERIA<br />\nHot Dinners, Sandwiches,<br />\nCandies, Sodas, Cigarettes,<br />\n<br />\nURNER<br />\n<br />\nBROTHERS<br />\n<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nTobacco, etc.<br />\nAT THE BARN<br />\n<br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman & Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br />\n<br />\nG<br />\n<br />\n)4074-<br />\n<br />\naac<br />\n<br />\nr.<br />\n<br />\n(Y. M. B. 0. D.)<br />\n<br />\nUALITY SHOP<br />\n<br />\nBaltimore & Hanover<br />\n<br />\nCollar Hug Clothes<br />\n<br />\nBaltimore and NeryStreets<br />\n<br />\nA. JACOBS & SONS<br />\nTAILORS<br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br />\n<br />\nTyped Papers<br />\nAlways Score<br />\nwith the\"Prof\"<br />\n<br />\nEMMANUEL CHURCH<br />\nCathedral and Read Streets<br />\nRev. Hugh Birckhead, D.D., Rector<br />\nThis Church holds out a cordial welcome to all of the students of<br />\nJohns Hopkins University<br />\nYou are especially invited to the morning service at I I o'clock.<br />\n•<br />\nSubject: \"The Obstacles to Faith.\"<br />\nAnd to the evening service at 8 o'clock.<br />\nSubject: \"The Social Principles of Jesus.\"<br />\nEVERY FULLY DEVELOPED MAN IS RELIGIOUS<br />\n<br />\nMount Vernon Place<br />\nMethodist Episcopal Church<br />\nAt the Washington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\n,,<br />\nThe Sunday afternoon \"At Home<br />\nin the \"Blue and Grey Room\" from<br />\nfive to seven, followed by the young<br />\npeople's service will appeal to you.<br />\nYou are invited.<br />\n<br />\nThey save his time and that's important.<br />\nThey save your time, and that's important<br />\ntoo.<br />\n<br />\nRemington<br />\nPortable<br />\nmakes all writing swift and easy.<br />\nIt is the most complete ofall portable typewriters—has the STANDARD KEYBOARD<br />\nand all the familiar features of the<br />\nbig machines. And it is so cornpact that it fits in a case only four<br />\ninches high. Price, complete with<br />\ncase, $60.<br />\n<br />\nRemington Typewriter Co.<br />\n25 W. Fayette Street<br />\n<br />\nSunday morning worship at I I o'clock—<br />\nSunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nALL SEATS FREE<br />\n<br />\nBaltimore, Md.<br />\nParagon Ribbons for Remington Portable Typewriters<br />\n50c each —$5 a a0Zen<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922.<br />\n<br />\nJOHNS HOPKINS ORCHESTRA<br />\nLEADER TO CONDUCT<br />\n(THE BOOK MART)<br />\nGLEE CLUB<br />\nMr.<br />\nBochau<br />\nObtained to Direct<br />\nComplete Stock of<br />\nBranch of Musical Club. AtMedical Books and College<br />\nRequisites<br />\ntractive Schedule Being<br />\nArranged<br />\nImporters and Dealers in Fine Books<br />\nMr. Charles Bochau has been se301 N. CHARLES ST.<br />\ncured as conductor for the Glee<br />\nBaltimore, Md.<br />\nClub. Mr. Bochau has led the Johns<br />\nHopkins Orchestra for several<br />\nt-et<br />\nyears. He is a musician of high<br />\nstanding in Baltimore, whose ex,<br />\nperience in choral work makes him<br />\nke<br />\nA. *I<br />\nvery desirable for this position.<br />\nMr. Bochau lined up the candiCtbeXatterie) dates for the Glee Club last night<br />\n\"34M Es Flea OSCAR G.1-01\"<br />\nat the first rehearsal, giving them<br />\nowNERs<br />\nidea of the work to be accoman<br />\n'IDE•r4Of\"<br />\n7')?<br />\n29 Baltimore St., East<br />\nplished and demonstrating the<br />\nOne Door West of Light St.<br />\nof accomplishing it.<br />\nmeans<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\nA concert in the Auditorium of<br />\n(Greek Letter Societies)<br />\nthe Maryland Casualty Clubhouse<br />\non the twenty-first of February<br />\nwill form part of a very attractive<br />\nPrinters of Philological and<br />\nschedule being arranged by the MuScientific Works<br />\nsical Clubs. This concert, the most<br />\nimportant of the season, will be fol23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nlowed by a dance in the ballroom<br />\nof the clubhouse. Such a concert<br />\nORDERS RECEIVED FOR<br />\nwas planned last season, but was<br />\nnot held, due to complications arisCOGGINS'<br />\ning in the acceptation of Student<br />\nTransfer and Baggage Express<br />\nActivities cards at any concert not<br />\nAUTOMOBILE SERVICE<br />\nat Homewood. This year the<br />\ngiven<br />\nPHONE, HOMEWOOD 2645-W<br />\nactivities cards will admit bearers<br />\nThe Flag, Banner & Pennant Shop to this concert. General admission<br />\n(Successors to Sisco Brothers)<br />\nwill be 1.50. The Blue Jay Jazz<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools, Band, which constitutes part of the<br />\nSocieties and Fraternities<br />\nMusical Club, will furnish music<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nthe dance.<br />\nfor<br />\nR. H. Taylor<br />\nVernon 2355<br />\nSeveral out-of-town concerts<br />\nhave been partially arranged. A<br />\nconcert in Richmond is being con1 W. University Parkway<br />\nsidered and its definite date is<br />\nOpposite J. H. U. Athletic Field<br />\nawaiting an agreement of guarantee. This concert will make a pleasBOYS<br />\nU.<br />\nH.<br />\nJ.<br />\nfor<br />\nDRUG STORE<br />\ntrip for the members of the<br />\nant<br />\nPHONE, HOMEWOOD 2121<br />\nclub and will strengthen the position of the University in Virginia.<br />\nBuy an (H) Pipe made special<br />\nA concert in Norfolk is awaiting a<br />\nfor the Boys<br />\ndecision similar to that in Richmond. Plans are also under way<br />\nfor concerts in several other nearby cities and towns.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nEverybody<br />\n<br />\nSuits and O'Coats $30 Upward<br />\n<br />\nCo<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\n4<br />\n<br />\n0<br />\n9<br />\n0<br />\n<br />\n/16. Alb<br />\nNe<br />\n-Nor<br />\n<br />\n.41.<br />\nNI NI<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nTO<br />\n<br />\nJ<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nHaverford<br />\n<br />\nORTMAN<br />\n<br />\nFine Clothes<br />\nA suit by Lemmert gives the final<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more<br />\nfestive occasions.<br />\n<br />\nLEM M ERT<br />\n19<br />\n<br />\nDress Clothes<br />\nSport Togs<br />\n<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\nHESS<br />\n<br />\nQuality<br />\n<br />\n8 EAST BALTIMORE STREET<br />\n<br />\nOver one hundred years<br />\nof designing and creating<br />\nSilverware assures the purchaser of Kirk pieces in<br />\nsilver absolute certainty of<br />\nsuperiority.<br />\n<br />\nSLACKERS<br />\nThese are the Frosh who have SHIRTS<br />\nnothing to do on Saturday after-<br />\n<br />\nSamuelKirk c<br />\nand Son Co.<br />\n<br />\nto come out to the football games<br />\n<br />\nThese are men who<br />\n<br />\nhaven't even enough spirit to come<br />\n41<br />\n<br />\nout and root for a team that sacri-<br />\n<br />\n41<br />\n<br />\nfices all their evenings and after-<br />\n<br />\nEstablished in 1817<br />\n<br />\n4<br />\n41<br />\n<br />\nnoons to put Johns Hopkins on<br />\ntop.<br />\n<br />\nGet after them, Freshmen!<br />\n<br />\nGet them, Sophomores!!,.. ..<br />\nClaude, W. T. Kaufholz, F. A.<br />\nKnox, W. F.<br />\nChesney, M.<br />\nMiedel, C. H..<br />\nDice, F. R.<br />\nDeckert, W. A. Poxas, Jose<br />\n<br />\nPrinters of the<br />\n:Johns Hopkins News-Letter<br />\n<br />\nOTIS SKINNER<br />\nIN<br />\n<br />\n\"Mister Antonio\"<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nmen and upper-classmen, take note<br />\nof them.<br />\n<br />\nCollege Literature<br />\n<br />\nNECKWEAR<br />\n<br />\nLefrane & Ault<br />\n<br />\nplayed by their own college. Fresh- HOSIERY<br />\n<br />\nBaltimore, Md.<br />\nOldest Silversmiths in America<br />\n<br />\nA. H.Fetting Man'fg Jewelry Co.<br />\n<br />\nHOPKINS MEN—Wear Hess Shoes and keep your<br />\nmind from your feet<br />\n<br />\nAft.<br />\n<br />\n4<br />\n<br />\n9<br />\n41<br />\n4.1<br />\n41<br />\n<br />\nEstablished 1873<br />\n<br />\nAsk Tom Landy at the Hopkins<br />\nShop to tell you just what this<br />\nmeans.<br />\n<br />\n0<br />\n<br />\n41<br />\n41<br />\n4/<br />\n4/<br />\n<br />\n\"Queen Quality\" Home-made<br />\nChocolates<br />\nIce Cream<br />\nIces<br />\nLuncheonette<br />\n227 N. Howard 518 N. Charles<br />\nDancing Every Afternoon at<br />\nCharles St.<br />\n<br />\nat<br />\n<br />\nFayette Street, East<br />\n<br />\nBusiness Suits<br />\nOvercoats<br />\n<br />\nTomorrow<br />\n<br />\nA.,<br />\n<br />\nnoon and yet haven't enough spirit<br />\n41<br />\n4<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nR.G.by & Company<br />\n<br />\nNV NI<br />\n<br />\nOf course, you don't have to go<br />\nto College to know that Katz<br />\nClothes are good clothes.<br />\nBut we're mighty glad to have<br />\nhighbrow opinion coincide with<br />\nours in this matter. Ask Landy.<br />\n<br />\nby Booth Tarkington<br />\n<br />\nWeek of<br />\nOctober 23<br />\n<br />\nFORD'S,<br />\n<br />\nRoxas, Jose<br />\nDost, W. A.<br />\nMorriarty, E. E.<br />\nDuval, J. P.<br />\nNedselney, A.<br />\nEwald, W. G.<br />\nHardisty, N. M. Purvis, M. R.<br />\nSchmidt, H. 0.<br />\nHarrison, M.<br />\nHirschmann, J. Snyder, M. H.<br />\n(Hunter, Thos. Jr.Schonebaum, H.<br />\nIsaac, F. R., Jr. Shaffer, G. S.<br />\nShapiro, H.<br />\nKirk, J. E.<br />\nSidamon, E. S. C..<br />\nKirk, D. J.<br />\nWalsh, Fred<br />\nKu, Te Ming<br />\n<br />\nNOTES ON STYLE<br />\nFrom delegates at. the National<br />\nClothiers' Convention, being held<br />\nnow in Chicago, comes the news<br />\nthat trousers with a corset effect<br />\nwill be the latest style in men's<br />\nclothes in the course of the next<br />\nfew months. As a proof of this<br />\nprediction, models were exhibited<br />\nwhich are said to be capable of<br />\nplacing man on an equal basis with<br />\nwoman in this respect. A flexible<br />\nbelt secured to each side of the<br />\ntrousers is designed to fit closely<br />\nover the abdomen. When drawn<br />\nin and fastened, the arrangement<br />\ngives a decided corset-like appearance. Talk about the campus<br />\ns6ems to indicate that there will<br />\nbe a heavy sale of the new style<br />\ntrousers to the \"he-flappers\" who<br />\nare now prone to wear colored hat<br />\nbands on soft felt hats.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No 6<br /><br />\nBALTIMORE, MD., OCTOBER 20, 1922<br /><br />\nPRICE 5 CENTS<br /><br />\nTA NKMEN TO HAVE FIVE HOMEWOOD COMPANY RE- JOHNS HOPKINS BAND ORVARSITY TO TACKLE HAVPHYSICAL EDUCATION<br />\nVETERANS AS NUCLEUS<br />\nLINQUISHES ATHLETIC<br />\nGANIZING FOR BANNER<br />\nERFORD GRIDDERS ON<br />\nCOURSE REVISED FOR<br />\nFOR TEAM<br />\nCONTROL TO FACULTY<br />\nYEAR<br />\nPRESENT YEAR<br />\nFOREIGN SOIL<br />\nMany Promising Candidates Ap- Dr. Goodnow Announces Two Membership Open to All. Trip to P. T. to Present Pleasing Innova- Maroon and Black Have Pracpear in Freshman Class. ManYear Control a Failure. ComHaverford for Saturday's<br />\ntically New Team. Hopkins<br />\ntions, According to Anager Buhrer Releases Tenmittee Appointed to HanGame Planned.<br />\nLineup Unchanged<br />\nnourcement of Director<br />\ntative Schedule<br />\nale Quvsiikiiii<br />\nAt a meeting held on Monday,<br />\nPhysical training, formerly the<br />\nWith the wealth of materials on<br />\nThe.<br />\nHomewood<br />\nCompany, October 9, the Johns Hopkins Uni- bane of all Freshmen and SophoJohns Hopkins<br />\nHaverford<br />\nMiddleton ...L.E...... Rhodes<br />\nhand the prospects for the 1922- which for the past two years has versity Band organized for the mores, has been completely revised<br />\nMagill<br />\nL T<br />\nStrong<br />\n1923 J. H. U. swimming team are had complete control of the finan- coming year. By the present ar- this year into two new and attracSlowik .....L.G.... Reinhardt<br />\nCromwell ....C... Strawbridge<br />\nbright. With five members of last cial end of all Johns Hopkins .ath- rangements, all that is necessary tive courses, Physical Education I<br />\nWalbert ....R.G.... ..Jones<br />\nyear's aggregation eligible, as well letics, has been dissolved and the for membership is a desire to play and II. According to the announceLandy....R.<br />\n.. F.. Montgomery<br />\nSchact<br />\nBonner.<br />\nR.E.... Lamberti<br />\nas an abundant supply of good University has resumed control of a band instrument. For all students, ment of the Director of Physical<br />\n.Q B<br />\nWilbur<br />\nswimmers in the freshman class, it all athletic activities. This an- but in particular for the Freshmen, Education, Dr. Ronald T. AberTurnbull ... .R.H. .. . Bacon<br />\nTaylor<br />\n.L H<br />\nBillo<br />\nseems as if Captain Coady is well nouncement was made last Tues- who will have the benefit of four crombie, the army calisthenics have<br />\nRich<br />\nF B<br />\nBrown<br />\non his way toward building up a day by President Frank J. Good- years' participation, the band pre- been almost entirely replaced by<br />\nSubstitutes: Johns Hopkins—<br />\nchampionship squad. An excellent now, who said that the. aims of the sents one of the best opportunities group games. Indoor baseball, basWilson, Gilliece, Trimble, R. Middleton.<br />\nschedule has been tentatively ar- Homewood Company had fallen Oil the campus..<br />\nketball and volley ball are the parranged by Manager Buhrer.<br />\nshort of realization, and that the<br />\nDuring the year the band will ticular games chosen.<br />\nAmong the old men is Captain members of the company them- meet twice a week. Monday afterFresh from last Saturday's deThis physical training work is<br />\nPearce Coady, holder of the Hop- selves had instituted the movement noon, at four o'clock, in the Barn, required of all first and second- cisive victory over the George<br />\nkins record for the 220-yard swim. for its dissolution. In financing will be the regular time and place year students, with the exception of Washington eleven, the Black and<br />\nCoady is a flashy man in the water, Hopkins athletics on a much larger for one meeting; the bulletin boards those taking R. 0. T. C. and those Blue warriors invade foreign terhis speed in the dashes and distance scale during the past . two years will give definite information in re- who have had the equivalent work ritory tomorrow to tackle the Hayswims and on the relay team, mak- than ever before in the history of gard to the other, which will be at some other college. Although no erford team.<br />\ning him one of the main-stays of t)ie rniv.<br />\n,-T,ity, the held,in<br />\nzdits aie giv-rt iv( the course, it - The: 1\\riai'oon. ,01(1 Black ha% e but<br />\nthe rilack and Blue team.<br />\nCompany is believed to have in- The band will play at athletic con- is a requirement for graduation a small contingent of last year's<br />\nPaul Buhrer, manager- of the curred considerable liabilities which tests, R. 0. T. C. ceremonies, and and must be absolved before any team back. Out of the eleven men<br />\n1922-1923 team; is another expert led to its downfall.<br />\nwho composed the team which the<br />\nother functions that may require its degree will be awarded.<br />\nmerman. Buhrer was a member<br />\nUnder the new agreement, the services. In this connection, plans<br />\nThose students, however, who Black and Blue defeated by a 28-3<br />\nof the quartet which established University officials and faculty will are being made to take sixteen men desire to go out for some athletic score last October, only three will<br />\nthe Hopkins record for the 200- resume the control which they had to the game with Haverford on Sat- activity will be excused from the line up on Saturday. Jones, at<br />\nyard relay. Another record holder prior to the formation of the Home- urday. This project, ambitious as nhysical training work. They must guard, and Brown, at fullback, will<br />\nwho will be available this winter is wood Company and the Varsity it is for this early date, is typical report regularly for every practice start in their old position, while<br />\nWaldo Hambleton, holder of the Club. A temporary committee has of the work the band intends to do and as soon as the season is over Strawbridge, who was stationed at<br />\nJr. H. U. title for the plunge. Ham- already been appointed by Dr. this year.<br />\nthey must return to Physical Edu- end last year, has been switched to<br />\nbleton's distance of 65 feet 6 inches Goodnow to decide upon the .fuIf a student lacking experience cation. Norman C. Keyes, gradu- the center position. Brown is the<br />\nwas made at New Brunswick, N. ture of Hopkins athletics. On this with band instruments wishes to ate manager of athletics, will have mainstay of the team this year. He<br />\nJ., two years ago, in a meet with committee are W. Graham Boyce, join he may do so. The R. 0. T. charge of these men. His task will scored the only two touchdowns his<br />\nRutgers. Chris Johnston, who Dr: Ronald T. Abercrombie, C. will furnish the instrument, the be to check up the rolls of the as- team has made this year, and was<br />\nhelped establish the Hopkins record Blanchard Randall, Jr., George A. student can obtain an instructor, sistant managers of the various responsible for the extra point affor the 160-yard relay three years Stewart, Robertson Griswold and and, after learning the elements, he sports.<br />\nter both. Wilbur, who played part<br />\nof<br />\nthe game at halfback and was a<br />\nago, is now a student at the Med- Dr. Goodnow. This committee met may become a member. All that<br />\nBecause of the lack of proper<br />\nconsistent<br />\nical Srhool rid lip .;s<br />\nground gainer, will call<br />\nlast Tuedayat the Ur.i.iv.?,rsity and i'ih1. he ast•-,<br />\n:d of him i,ili be to :10 spacc indoor,the physical training<br />\neffort to rejoin the squad this year. steps were taken to keep Hopkins his best in company with the other work will be done out-of-doors. the signals. Billo, another of last<br />\nMorrell and Dunning, two mem- athletics on a solid basis.<br />\nmembers. Mr. F. E. Campbell. During the inclement weather, the season's scrubs, will be seen at one<br />\nbers of last year's team, will report<br />\nBoth the Homewood Company leader of the band, is planning an class will assemble indoors and will of the halfback positions.<br />\nto Captain Coady when practice and the Varsity Club were formed organization of forty pieces, and receive lectures on hygiene from<br />\nIt is practically impossible to atstarts. Both men have had only in the spring of 1920 by a large requests the support of the students Dr. Abercrombie. The games will tempt to predict the outcome by a<br />\none year's experience, but showed group of Hopkins alumni, most of in the enterprise.<br />\nbe under the supervision of mem- comparison of scores. Haverford<br />\nmuch promise last season.<br />\nwhom were .former letter men. The<br />\nMembership in the band is ac- bers of the Reserve Officers' Train- has yet to win a game this year,<br />\nWelsh,<br />\nSauerwein,<br />\nStevens, purpose of the organizations was companied by numerous benefits. ing Corps staff. Captains Shriver holding Stevens to a 0-0 tie and losHoward and Rob Middteton are to boost Hopkins athletics in the There is the opportunity of learn- and Cummins, cadet officers in this ing to Trinity College, 21-14, in<br />\namong the freshmen who are ex- college world and to control the ing to play at the least possible ex- department, have been making ef- their only two starts. In both<br />\npected to try for positions on the finances of all teams. The Home- pense. Members of the band en- forts to persuade those taking games, however, the Maroon and<br />\nswimming team. Welsh and Sauer- wood Company secured first-class gaged in R. 0. T. C. work or phys- Physical Education to change to Black backfield men demonstrated<br />\ntheir ability as broken field runners.<br />\nwein are well known in Baltimore coaches, arranged real athletic ical training are excused from drill the R. 0. T. C.<br />\nIt is the first time in several years<br />\nas unusually fast men. Middleton schedules and raised the caliber of or training once a week. Morecame to Hopkins from St. Luke's all the teams.<br />\nover, membership in a recognized TWENTY-ONE 'RELIGIONS that the Haverford gridders had<br />\nSchool, where he was a star swimjust what effect this change of campus activity, accompanied by REPRESENTED AT J. H. U. met defeat at the hands of Trinity,<br />\nmer. Ridgely Howard is holder of management will have on Hopkins the chance to work for the college,<br />\nThe students of the Johns Hop- and the latter's victory was a disthe South Atlantic InterAcholastic athletics is not yet known. It was is certainly desirable.<br />\nkins University represent many tinct surprise.<br />\nIt is probable that the same Black<br />\nrecord for the plunge. Several the Homewood Company which SeAccording to Mr. Campbell, pros- types of religious beliefs, in all<br />\nother freshmen and upper-classmen -tired Ray Van Orman as athletic pective members should signify there are twenty-one various sects. and Blue lineup will be seen as that<br />\nare likely to join Captain Coady's director and head football coach, their intention to join as soon as<br />\nThe Methodists head the list with which started against George Washsquad as soon as the season starts. and the faculty cannot make any possible. Either see the leader per- a total of one hundred and forty- ington, with the exception, of<br />\nThe tentative schedule released change without inflicting a tre- sonally, or drop a note in his post- six students, or Over twenty-three course, of Ed Milinausky, who sufby Manager Buhrer is as follows: mendous blow upon the athletic office box, No. 230. State whether per cent. of the total attendance. fered a broken shoulder and collarJanuary .3—Navy, at Annapolis. prestige of the .University.<br />\nor not you have had experience, The Episcopalians are next in or- bone in Saturday's conflict. Slowik<br />\nJanuary 19—Swarthmore, at home.<br />\nwhat instrument you play or would der, with one hundred and twenty- is slated to start in at guard, with<br />\nFebruary 10 — Columbia, away FIRST OF TURNBULL LEC- like to play, your name, and the nine, or seventeen per cent., and Councill held in reserve.<br />\nTURES ON POETRY WELL<br />\nnumber of your post-office box.<br />\n(pending).<br />\nthird are the Hebrews, with ninety- • The showing of the backfield last<br />\nATTENDED<br />\nFebruary 16 — Lehigh, away<br />\nsix, or fifteen per cent, of the whole Saturday was a complete surprise.<br />\n\"Poetry is the breath and finest<br />\nDELTA GAMMA THETA<br />\n(pending).<br />\nIt is pleasing to note that there Taylor, Turnbull and Bonner, after<br />\nOn account of an error on the are not quite seven per cent, of the the first quarter, made gains at will.<br />\nFebruary 17 — Syracuse, away spirit of all science. Nothing will<br />\never silence the appeal of poetry.\" Part of the .editor of the Y. M. C.<br />\n(pending).<br />\nstudent body who do not consider Taylor, playing his second game of<br />\nSuch<br />\nwere the sentiments expressed A. Handbook, the Delta Gamma themselves joined<br />\nMarch 3—Rutgers, at home.<br />\nto some Church collegiate football, showed promise<br />\nlast Monday afternoon by Dr. Theta Fraternity, Chapter House, of<br />\nMarch 10—E. C. S. A., away.<br />\nof becoming an excellent carrier_<br />\nGod. .<br />\nMarch 17-1. C. A. A. A. A., James W. Bright, graduate profes- 2721 Oak Street, was not listed<br />\nThe following are the different The 150-pound halfback was selsor of English, at the \"annual feast with the other recognized frater- denominations<br />\naway.<br />\nin the University: dom stopped short of a ten-yard<br />\nof high thought,\" the twenty-fourth nities.<br />\nMethodist, 146; Episcopal, 109 gain when he carried the ball<br />\ncourse of Percy Turnbull Memorial<br />\nNOTICE<br />\nHebrews, 96; Lutheran, 61; Pres- around the end or off-tackle. TurnLectures- on Poetry. This course<br />\nR. 0. T. C. NOTICE<br />\nAll students should go to<br />\nbyterian, 50; Roman Catholic, 39; bull could always be relied on for<br />\nwas established in 1889 by Mr. and<br />\nthe Registrar's Office and fill<br />\nOlive drab shirts are now on Baptist, 27; Reformed, 15; Congre- two or three yards through the line.<br />\nout their schedule cards at<br />\nMrs. Lawrence Turnbull for the hand and can be purchased in the gational,<br />\n8; United Brethren, 7; Rich, who was moved to fullonce. This information is abpurpose of commemorating .the loft of Gilman Hall for $4.00, the Friends,<br />\n5; United Evangelical, 3; back at the last moment, backed up<br />\nsolutely required by the office,<br />\nname of their son, Percy Graeme wholesale price. All men without<br />\nChristian, 3; Greek Orthodox, 3; the line and led interference in a<br />\nand a fine of $5 will be imTurnbull. In accordance with the them are urged to get these shirts Reformed<br />\nEpiscopal, 2; Plymouth noteworthy manner.<br />\nposed upon those failing to<br />\nterms of the gift, a course of lec- at once. The shoes are expected<br />\nBrethren, 2; Universalist, 2; TheThe forward passing of the<br />\ntake such action by 4 P. M. tures is<br />\ndelivered annually by some shortly, and notice of their arrival osophist, 1; Disciples,<br />\n1; Christian Black and Blue team showed deon next Tuesday, October 24.<br />\none who has gained distinction as will be posted on the R. 0. T. C. Science,<br />\n1; Unitarian, 5; no pref- cided improvement. It seemed as<br />\nBy Order of the Dean.<br />\nContinued on page 2, col. 4<br />\n•<br />\nBulletin Board near the post office. erence, 43.<br />\nContinued on page 2, col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922<br /><br />\nCROMWELL ELECTED SENIOR<br />\nDR. FOSTER,SCIENTIFIC THEOLOGIAN, TO ANSWER<br />\nPRESIDENT<br />\nSTUDENTS' QUESTIONS<br />\nThe Senior Class held their elecFOUNDED 1897.<br />\nRev. Allyn K. Foster, of Grantion of class officers on Monday,<br />\nville, Ohio, well known throughout<br />\nOctober 16, one week following the<br />\n$2.00<br />\nThe same jinx that deprived the<br />\nSubscription<br />\nthe country as editor, author,<br />\nnominations. M. Jenkins Cromwell<br />\nBlack and Blue of the services of<br />\nBaptist preacher and stuteacher,<br />\nwas elected president of the class.<br />\nat<br />\nPostoffice<br />\nthe<br />\nat<br />\n1909,<br />\n3,<br />\nDecember<br />\nmatter<br />\nEntered as second-class<br />\nWerner and Willis permanently,<br />\ndent secretary of the Board of EdThe officers of the Class of 1923<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nand Wilson and Coady temporarBaptist<br />\nthe<br />\nNorthern<br />\nof<br />\nucation<br />\nare:<br />\nily, slipped past the gatekeeper last<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nConvention, has been secured by<br />\nPresident—M. Jenkins CromHopkins University.<br />\nSaturday and, before the game was<br />\nthe Hopkins \"Y\" to make a twowell.<br />\nMANwell, under way, had laid hands on<br />\nBusiness communications should be addressed to the BUSINESS<br />\nVice-President—Walter H. Somand other comhunications day visit to the University on MonAGER, JOHN HOPKINs UNIVERSITY; all articles<br />\nEd Milinausky, left guard. Ed,<br />\nday and Tuesday, October 23<br />\nerville.<br />\nshould be sent to the MANAGING EDITOR.<br />\nwith both collar and shoulder bones<br />\nSecretary—Glover P. Fallon.<br />\nHomewood 100 and 24.<br />\nbroken, is probably out for the rest<br />\nTelephone<br />\nIn his present capacity, Dr. FosTreasurer—George V. B. Shriof the season.<br />\nter has had the rare experience of<br />\nver.<br />\naddressing<br />\nManager:<br />\n300,000<br />\napproximately<br />\nBusiness<br />\nSergeant-at-Arms—Charles C. G.<br />\nEditor-in-Chief:<br />\nyears.<br />\nthe<br />\nduring<br />\npast<br />\ntwo<br />\nWILLIAM H. MOORE, JR., '23.<br />\nstudents<br />\nSaturday<br />\nlast<br />\nEvans,<br />\nobservers<br />\nClose<br />\n'23.<br />\nGLOVER P. FALLON,<br />\nHe has visited educational insti- would have noticed that of the six<br />\nManaging Editor:<br />\ntutions ill 34 states. He is more touchdown made by the Black and<br />\nJ. HUDSON HUFFARD, '23.<br />\nAdvertising Manager:<br />\ngenerally popular with students all Blue,, two were made by Middle- LECTURES TO ELECTRICAL<br />\nAssistant Managing Editor:<br />\n'23.<br />\nCLUB<br />\nDONALD K. VANNEMAN,<br />\nthrough the country than any oth- ton, No. 7, and three by Rich, No.<br />\nJOSEPH S. LEOPOLD, '24.<br />\nThe<br />\nprogram of the last meeting<br />\ner one speaker.<br />\n11. Come on, NATURAL!<br />\nAssociate Editors:<br />\nof<br />\nthe<br />\nElectrical Club proved to be<br />\nDr. Foster was born in BaltiRIGNAL W. BALDWIN, JR., '23.<br />\nall<br />\ninteresting<br />\none. After reports<br />\nfrom<br />\nB.<br />\nA.<br />\nhis<br />\nManagers:<br />\nmore and received<br />\nAssistant Business<br />\nIt seems that Maryland is soon from the various standing commitJunior Editors:<br />\n'23.<br />\nHEARN,<br />\nfrom<br />\nC.<br />\nA.<br />\nhis<br />\nBERNARD<br />\nM.<br />\nJohns Hopkins,<br />\nRANDOLPH NORWOOD, '24.<br />\nto have some exciting inter-state tees, Mr. White deliveted a lecture<br />\nFITZGERALD DUNNING, '24.<br />\nT. REESE MARSH, '24.<br />\ndegree<br />\nhis<br />\ntheological<br />\nand<br />\nYale,<br />\n'25.<br />\nHOWARD,<br />\nPHILIP W.<br />\nbattles. Washington College, St.<br />\nR. C. TILGHMAN, '25.<br />\nfrom the Southern Baptist Theo- John's and Western Maryland of unusually high caliber. His subMILES D. MARRIAN, '25.<br />\nWILLIAM G. DEAN, '24.<br />\n'25.<br />\nG. DONALD GIESKE,<br />\nJOHN W. PARSONS, '25.<br />\nlogical Seminaty, Louisville, Ky. have teams 100 per cent, stronger ject was \"The Electric Automobile<br />\nJ. D. SLAUGHTER, '23.<br />\nBENJAMIN T. ROME, '25.<br />\nStarter.\" In delivering this lecture<br />\nFew men have enjoyed as broad than last year's aggregation.<br />\nMr. White displayed heretofore<br />\nand interesting experiences as he.<br />\nhidden<br />\ntalent .in combined humor,<br />\nDr. Yostter's miniSterial offices<br />\nwit<br />\nand<br />\nknowledge. He has set a<br />\na<br />\ngame<br />\nthe<br />\nWith<br />\nPennsylvania<br />\nhave ranged from chaplain of WorAssociation.<br />\nMember of Southern Intercollegiate Newspaper<br />\nhigh<br />\nfor those who will<br />\nstandard<br />\nof<br />\nof<br />\nhistory, the University<br />\ncester County jail to preacher in matter<br />\nto<br />\nin the future.<br />\nspeak<br />\nthe<br />\nclub<br />\nreste Halle, Coblenz, Germany, Maryland has only V. P. I., Yale,<br />\nThis<br />\nwas<br />\nmeeting<br />\nattended by the<br />\nBaltimore, Md. during a part of its occupation by and Princeton confronting them.<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts.,<br />\nIn<br />\nJunior<br />\nElectrical<br />\nEngineers.<br />\nthe U. S. Army. For two years Save eleven men for the Hopkins<br />\nhaving<br />\nthis<br />\nlecture<br />\nthey<br />\nbeen<br />\nhave<br />\nhe did Y. M. C. A. service in the game, Curly Byrd. There's going<br />\nintroduced to a subject which is at<br />\n1922<br />\n20,<br />\nWorld War, remaining in France to he a big crowd on hand.<br />\nOCTOBER<br />\nBALTIMORE, MD.,<br />\npresent a big problem before engiand Germany for 18 months. AfThis is but a forerunner to<br />\nneers.<br />\nter returning to America he was<br />\nPessimists point to Virginia's<br />\nthe<br />\nmany<br />\nsubjects that will be disappointed to his present position as 5-0 record at Princeton.. Don't<br />\nSPORTSMANSHIP<br />\na<br />\nin<br />\ncussed<br />\nlater meeting-.<br />\nstudent secretary of the Board of forget that the boys from Old<br />\nnearer<br />\nstep<br />\na<br />\nand<br />\nbody<br />\nstudent<br />\nthe<br />\nby<br />\nmade<br />\nAn excellent move was<br />\nEducation.<br />\nDominion only beat George Washof the oldto perfect sportsmanship was reached with the abolishment<br />\nDr. Foster's special field of ington 34-0, which is far from a<br />\nSTUDENT COUNCIL<br />\npenalty study has been in what has been superhuman- feat. Don't forget,<br />\ntime practice of cheering the football referee for inflicting a<br />\nAt a recent meeting of the Councalled Scientific Religion. He talks too, that Coach Van Orman has<br />\ncil, J. W. Huey was elected secreupon an opponent. As we look back upon the old days, when the prac- usually upon subjects that are akin<br />\npractically a new combination, and<br />\nhundred<br />\nseveral<br />\nof<br />\nsight<br />\nthe<br />\nthat<br />\nadmit<br />\nmust<br />\nwe<br />\ntice was in vogue,<br />\nto the controversy between science that __it is running smoother every tary-treasurer.<br />\nThere afe two more vacancies to<br />\nrooters cheering themselves hoarse at an opposing team's misfortune and religion. His whole point of day. It's going to be a hard batis<br />\nhe<br />\nyet<br />\nand<br />\nconstructive,<br />\nis<br />\nview<br />\nbe<br />\nfilled before the Council is comthe<br />\nBlack<br />\nbut<br />\nweek,<br />\ntle tomorrow a<br />\nwas not an awe-inspiring sight. It seems really no more commendable<br />\nprepared to meet scientists on their and Blue is very much in the run- plete. These places will be filled<br />\nthan applauding an injury of a visiting player.<br />\nown ground.<br />\nning.<br />\nin the near future, when two deleis<br />\nHe<br />\nunsportsmanlike.<br />\nThe \"Y\" is planning to have Dr.<br />\nbe<br />\nto<br />\nintend<br />\nThe average rooter does not<br />\ngates, one from the Senior and one<br />\nFoster lead open forum discussion<br />\nThe outcome of two of tomor- from the Freshmen Classes, will be<br />\nusually so enwrapped in the progress of his team that he inconsiderately groups on Monday at 1 P. M. and<br />\nrow's games is being awaited with<br />\nside.<br />\nelected.<br />\nat 4 P. M., in Rooms 109 or 110<br />\n,expresses his approval at every \"break\" in the favor of his<br />\neagerness by football fans from<br />\nposPlans were formed for the<br />\nif<br />\nand,<br />\nethics,<br />\nBuilding,<br />\nrooters'<br />\nE.<br />\nthe<br />\nM.<br />\nof<br />\non<br />\nwork<br />\na<br />\nThere has probably never been written<br />\ncoast to coast. The Center Col\"Frosh-Soph\"<br />\nTueson<br />\nfootball game and<br />\none<br />\nanother<br />\nhave<br />\nto<br />\nsible,<br />\na good<br />\nlege eleven, eager for a repetition for the \"Rush\"<br />\ntherefore, no definite rules can be laid down. It is generally<br />\nwhich will follow<br />\nday at a time to be announced<br />\nof last year's result, invades Cam- the game.<br />\nviewfellow's<br />\nother<br />\nthe<br />\nfrom<br />\nproposition<br />\nthe<br />\n7.30<br />\nat<br />\nat<br />\nlook<br />\nevening,<br />\nonday<br />\nI<br />\nOn<br />\nto<br />\nlater.<br />\nplan, however,<br />\nbridge for its third annual contest<br />\nThere will be another meeting of<br />\na<br />\nSome institutions obtain reputations for poor sportsmanship, o'clock, Dr. Foster will address<br />\npoint.<br />\nwith Harvard. The Kentuckians the Student Council Sunday night,<br />\nMark's<br />\n-view. group of students at St.<br />\nwere nosed out in 1920, but took a at 7:15. The place will be anothers for good. It is all a matter of the other fellow's point-of<br />\nLutheran Church, St. Paul and<br />\nfall<br />\nOut of the Crimson last year. nounced later.<br />\nPalmer<br />\nFor instance, the Hopkins rooter at the Princeton game, at<br />\nTwentieth Streets. The meetings<br />\nMidshipmen from the Naval<br />\nThe<br />\nUniStadium, on September 30, brought back a most favorable opinion of are open to all members of the<br />\nAcademy engage the fast-moving<br />\nversity and will prove of particular<br />\n• DEBATING COUNCIL<br />\nGeorgia. Tech .eleven tomorrow, at<br />\nPrinceton sportsmanship.<br />\n_<br />\ninterest to those men whose reAnnapolis. Navy has been mowSo far this year, the Debating<br />\nOne of the most useless and really discourteous habits of cheering ligious convictions have been<br />\nall opposition for several Council has not become active. A<br />\ning<br />\ndown<br />\nconferbodies is that of objecting to a referee's decision. There is never one shaken by science. Private<br />\nfrom the Tor- meeting of its members is expectFoster years, but trouble<br />\nDr.<br />\nwith<br />\nhad<br />\nbe<br />\ncan<br />\nences<br />\npresunder<br />\ndecision<br />\nhis<br />\nnadoes is predicted. If wishes ed at an early date, for already<br />\ncase in a thousand where an arbiter will change<br />\nby leaving your name at the \"Y\"<br />\ndo it, Georgia<br />\ncould<br />\novertures have been received for<br />\nthe<br />\neggs<br />\nand<br />\nvork<br />\nN<br />\n.<br />\nhis<br />\nsure of fan threats. It does frequently unsteady<br />\noffice.<br />\ndebates with the following colleges:<br />\nDr. Foster's unusually broad<br />\nplayers to dissatisfaction.<br />\nCollege, Los Angeles,<br />\nOccidental<br />\nrange of experience, his rare and<br />\nTURNBULL LECTURES<br />\nCal.: University of Maryland, UniIt is to be hoped that the Black and Blue cheering section will gain genial personality, and his deep<br />\nContinued from page 1<br />\nversity of Richmond.<br />\nfor itself only criticism of the praiseworthy variety, and will occupy a earnestness ill spirituality cause<br />\na writer or critical student of<br />\nThe contest of the Southern Orahim to be one of the most sought poetry.<br />\nhigh position on the pedestal of good sportsmanship.<br />\ntorical Association for the year<br />\nafter speakers for students. Dr.<br />\nThe speaker this year is Emile 1922-23 will be held at Hopkins in<br />\nFoster, being a Hopkins man himD. es. L., Professor of the early spring. This was won<br />\nLegouis,<br />\nself, will without a doubt prove to<br />\nEnglish Literature at the Univer- last year by Albert S. Langluttig,<br />\nbe interesting to and interested in<br />\nsity of Paris. His subject, which who is now president of the assoMORE BUTTONS<br />\nthe fellows on the campus today.<br />\nserved as an introduction for the ciation. The present secretary is<br />\ngeneral<br />\nRussian<br />\nthe<br />\ntoward<br />\nnotch<br />\nanother<br />\nmove<br />\nwill<br />\nfreshman<br />\nother five lectures of the course, Dr. John C. French, of our faculty.<br />\nTACKLE<br />\nThe<br />\nBLACK AND BLUE TO<br />\nHAVERFORD<br />\nform<br />\nthe<br />\nThe Council plans to enter the<br />\nin<br />\nwas \"The Life and Career of Spenclass when he adds decoration No. — to his collection,<br />\n(Continued from page 1)<br />\naddress,<br />\nhis<br />\nbeginning<br />\nBefore<br />\nannual triangular debate between<br />\nhonor must be worn if the ends and backs were always ser.\"<br />\nof a student activities button. This medal of<br />\nemphasized the fact Hopkins, the University of North<br />\nLegouis<br />\nM.<br />\non the University in the exact spot to receive the ball. that the privilege of speaking here Carolina, and<br />\nalong with his \"F\" button at all times that he is<br />\nWashington and Lee<br />\nIt is expected that a large numof tokens University. These debates are usthousands<br />\nthe<br />\nSoph<br />\nthe<br />\nof<br />\nfrom<br />\none<br />\nis<br />\nprotection<br />\nfor<br />\nrequired<br />\nis<br />\nothers,<br />\nall<br />\ngrounds. It, above<br />\nber of students will journey to<br />\nof friendship shown by America to ually held in the early spring, when<br />\nHaverford to witness tomorrow's<br />\ndisciplinarians.<br />\nFrance.<br />\nsome topic of current interest is'debuttons to battle. A few have already made<br />\n- The head of each- recognized activity will distribute the<br />\na<br />\nshort<br />\nwith<br />\ndescripbated. Each college enters an afBeginning<br />\narrangements to go up with the<br />\nunand<br />\nkept<br />\nand a negative team, and<br />\nbe<br />\nwill<br />\nfirmative<br />\nroll<br />\naccurate<br />\nphysical<br />\ncharacteristics<br />\nthe<br />\nof<br />\ntion<br />\nAn<br />\nthe workers for his own staff.<br />\nteam, while many more are likely<br />\ncustom<br />\nhas been to have the<br />\nthe<br />\nLegouis<br />\nProfessor<br />\nSpenser,<br />\nprotective to motor up. It is expected that of<br />\nexcuSed delinquencies should call for. the forfeiture . of the<br />\nteams<br />\ncompete<br />\non neutral ground—<br />\ndiscussion<br />\na<br />\nthe Band will take the trip in suf- went on with lengthy<br />\none<br />\nand<br />\ncollege<br />\nentertaining teams<br />\nbadge.<br />\nficient numbers to participate in the of his mental characteristics,<br />\nactivfrom<br />\nthe<br />\nthe<br />\nhis<br />\nindividual<br />\nby<br />\ntwo<br />\nother<br />\nof<br />\nmembers of the<br />\nconcluded with the story<br />\nUnless the- scheme is efficiently supported<br />\ncheering section.<br />\ntriangle.<br />\nlife.<br />\nities the purpose of the Student Council will be entirely defeated.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nGridiron Gossip<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922.<br />\nRECEPTION FOR OUT-OFTOWN MEN BIG SUCCESS<br />\nHopkins men from foreign<br />\n'countries and from all parts of the<br />\nUnited States became acquainted<br />\nwith the pastors and some of the<br />\nmembers of the churches in the vicinity of the University last Friday night, at an interdenominational meeting held at the Friends<br />\nMeeting House by the Hopkins<br />\nY. M. C. A. and the Neighborhood<br />\nChurches. The reception was held<br />\nto bring the out-of-town student in<br />\ntouch with the nearest church of his<br />\nown denomination.<br />\nThe University men, led by John<br />\nSherwood, started the meeting by<br />\nsinging some Hopkins songs. The<br />\nRev. Dr. Harris made the opening<br />\nprayer. Mr. Morriss, general secretary of the \"Y\", who acted as master of ceremonies, explained the<br />\npurpose of the reception. He said<br />\nhe would like the students to know<br />\nthat the Friends Meeting House.<br />\nwith its library, is always open to<br />\nHopkins men.<br />\nThe ministers representing the<br />\nvarious denominations gave short<br />\nin the \"that-reminds-Me\"<br />\ntalks<br />\nvein, while Mr: Morriss held the<br />\nstopwatch. One and all urged the<br />\nstudents to join a church and participate in the church life of whatever denomination they preferred.<br />\nThe speakers were: The Rev. Dr.<br />\nNeilly, of the Waverly Presbyterian Church Rev. Dr. Morgan, of<br />\nthe First Methodist Episcppal ;<br />\nRev. Dr. Harris, of the Wilson Memorial M. E. South; Rev. Dr. Warner, of St. John's Methodist Prot estant ; Rev. Arrowsmith, of the<br />\nPro-Cathedral; Rev. Dr. Clare, of<br />\nSt. Mark's Lutheran; the Rev. Dr.<br />\nDixon, wlihas just retnrucd.irom<br />\nChina to take charge of the University Baptist Church, and Mr.<br />\nLouis Moon. secretary of the<br />\nFriends Meeting House.<br />\n• Dr. French, chairman of the Student Advisory Committee, pointed<br />\nout that American colleges supervise their students' mental training,<br />\nbut not their moral, andlie thanked<br />\nthose responsible for the meeting<br />\nfor taking an interest in the latter.<br />\nHe told the students that participation in community life, as well as<br />\nstudies, was an important part of<br />\ntheir education.<br />\nAt the close of the speeches refreshments were served, and the<br />\nstudents had a chance to meet the<br />\nchurch people who were present.<br /><br />\nFIRST ISSUE OF BLACK AND<br />\nBLUE JAY TO APPEAR SOON<br />\nThe first issue of the Black and<br />\nBlue Jay went to press Monday,<br />\nand will be distributed about October 27. It is the \"Renaissance<br />\nNumber,\" devoted to the \"Revival<br />\nof Learning\" (the return to college). Black and Blue Jay men are<br />\nnow working on the \"Fraternity<br />\nNumber,\" and are on the trail of<br />\nlaughs and low snickers concerning<br />\nthe \"Frats\" and college life in general. Competition is developing<br />\namong the candidates for the staff,<br />\nand they will have to work hard.<br />\nThe Black and Blue Jay wants<br />\nsubscribers outside of the University. Subscription cards will be<br />\nplaced in the P. 0. boxes along<br />\nwith the first issue of the magazine. Students are asked to get<br />\nsubscriptions from their numerous<br />\nfriends.<br /><br />\nDR. GILDEFtSLEEVE IS NINETY-ONE ON MONDAY<br />\nDr. Gildersleeve, the noted<br />\nscholar and teacher, who retired<br />\nfrom the active duties of his professorship at thp Johns Hopkins<br />\nUniversity not many years ago,<br />\nwill celebrate his ninety-fir-st birthday this coming Monday, October<br />\n23. Fast nearing the one hundred<br />\n-nark, this well-known figure in national and international circles is<br />\nstill active and healthy.<br />\nUnfortunately, the doctor's eyes<br />\nhave given him trouble, so that he<br />\nis forced to rely, in part, upon his<br />\nfriends and his memory for his associations with the classics which<br />\nhe loves so well. However, he is<br />\nkeeping steadily abreast of the<br />\ntimes and always a learned Greek<br />\nscholar, he now revels in the old<br />\nGreek classics, whose texts he reviews time and again in his sheer<br />\n'ove for and appreciation of their<br />\n)utstanding beauty.<br />\nThe anniversary of Dr. Gildersleeve's birth will be passed in the<br />\npresence of only a few of his<br />\nclosest friends.<br /><br />\nY. M. C. A. NOTICES<br />\nThe Y. M. C. A. has gone to<br />\nconsiderable expense in the purchase of a number of magazine<br />\ncovers, hoping to render current<br />\nmagazines more durable and convenient for the benefit of the students. This purpose, however, is<br />\nbeing defeated by the fact that they<br />\nare sometimes removed from the<br />\nroom in which they have been<br />\nplaced. Hereafter please leave them<br />\nwhere you find them.<br />\nThe Y. M. C. A. wishes to remind the student body that it is<br />\nrunning a Lost and Found Bureau,<br />\nand that the Association is anxious<br />\nto be of service in this respect. This<br />\ncan only be accomplished, however,<br />\nby the co-operation of the students.<br />\nPlease don't forget about it.<br /><br />\nFACULTY NOTES<br />\nDr. John Holladay Latane, Dean<br />\nof the College Faculty, is leaving<br />\nthis week for South America,<br />\nwhere he will visit the Brazilian<br />\nCentennial Exposition held at Rio<br />\nde Janeiro, Brazil. In his absence<br />\nDr. Joseph Elliott Gilpin, Collegiate<br />\nProfessor of Chemistry, will act as<br />\ndean and will have the same conference hours, from 11:30 to 4:30,<br />\nat the office Of the Dean, Gilman<br />\nHall.<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nof Baltimore<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\nJohn J. Nelligan, President<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\n00<br /><br />\nHOCHSCHILD,KOHN 8cCo.<br />\nFAs<br />\n?he apex<br />\ninfasluonable<br />\nneckwear<br /><br />\nURNER'S<br />\nMEN'S SHOES<br /><br />\nThe popularity of<br />\nFa3hionknit t i es<br />\nhas caused a mushroom growth of<br />\ncheaper imitations<br />\nto spring up.<br />\nBut when you<br />\ncompare the neckwear it's easy to<br />\nsee why the others<br />\nare cheaper.<br />\nWe feature none<br />\nbut the genuine<br />\nFashionknit, and<br />\nhave an unparralelled assortment.<br />\nJJ iA.<br /><br />\nTHE<br /><br />\nOf the Better Class<br /><br />\nThe tARN<br />\nCAFETERIA<br />\nHot Dinners, Sandwiches,<br />\nCandies, Sodas, Cigarettes,<br /><br />\nURNER<br /><br />\nBROTHERS<br /><br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nTobacco, etc.<br />\nAT THE BARN<br /><br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman &amp; Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br /><br />\nG<br /><br />\n)4074-<br /><br />\naac<br /><br />\nr.<br /><br />\n(Y. M. B. 0. D.)<br /><br />\nUALITY SHOP<br /><br />\nBaltimore &amp; Hanover<br /><br />\nCollar Hug Clothes<br /><br />\nBaltimore and NeryStreets<br /><br />\nA. JACOBS &amp; SONS<br />\nTAILORS<br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br /><br />\nTyped Papers<br />\nAlways Score<br />\nwith the\"Prof\"<br /><br />\nEMMANUEL CHURCH<br />\nCathedral and Read Streets<br />\nRev. Hugh Birckhead, D.D., Rector<br />\nThis Church holds out a cordial welcome to all of the students of<br />\nJohns Hopkins University<br />\nYou are especially invited to the morning service at I I o'clock.<br />\n•<br />\nSubject: \"The Obstacles to Faith.\"<br />\nAnd to the evening service at 8 o'clock.<br />\nSubject: \"The Social Principles of Jesus.\"<br />\nEVERY FULLY DEVELOPED MAN IS RELIGIOUS<br /><br />\nMount Vernon Place<br />\nMethodist Episcopal Church<br />\nAt the Washington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\n,,<br />\nThe Sunday afternoon \"At Home<br />\nin the \"Blue and Grey Room\" from<br />\nfive to seven, followed by the young<br />\npeople's service will appeal to you.<br />\nYou are invited.<br /><br />\nThey save his time and that's important.<br />\nThey save your time, and that's important<br />\ntoo.<br /><br />\nRemington<br />\nPortable<br />\nmakes all writing swift and easy.<br />\nIt is the most complete ofall portable typewriters—has the STANDARD KEYBOARD<br />\nand all the familiar features of the<br />\nbig machines. And it is so cornpact that it fits in a case only four<br />\ninches high. Price, complete with<br />\ncase, $60.<br /><br />\nRemington Typewriter Co.<br />\n25 W. Fayette Street<br /><br />\nSunday morning worship at I I o'clock—<br />\nSunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nALL SEATS FREE<br /><br />\nBaltimore, Md.<br />\nParagon Ribbons for Remington Portable Typewriters<br />\n50c each —$5 a a0Zen<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 20, 1922.<br /><br />\nJOHNS HOPKINS ORCHESTRA<br />\nLEADER TO CONDUCT<br />\n(THE BOOK MART)<br />\nGLEE CLUB<br />\nMr.<br />\nBochau<br />\nObtained to Direct<br />\nComplete Stock of<br />\nBranch of Musical Club. AtMedical Books and College<br />\nRequisites<br />\ntractive Schedule Being<br />\nArranged<br />\nImporters and Dealers in Fine Books<br />\nMr. Charles Bochau has been se301 N. CHARLES ST.<br />\ncured as conductor for the Glee<br />\nBaltimore, Md.<br />\nClub. Mr. Bochau has led the Johns<br />\nHopkins Orchestra for several<br />\nt-et<br />\nyears. He is a musician of high<br />\nstanding in Baltimore, whose ex,<br />\nperience in choral work makes him<br />\nke<br />\nA. *I<br />\nvery desirable for this position.<br />\nMr. Bochau lined up the candiCtbeXatterie) dates for the Glee Club last night<br />\n\"34M Es Flea OSCAR G.1-01\"<br />\nat the first rehearsal, giving them<br />\nowNERs<br />\nidea of the work to be accoman<br />\n'IDE•r4Of\"<br />\n7')?<br />\n29 Baltimore St., East<br />\nplished and demonstrating the<br />\nOne Door West of Light St.<br />\nof accomplishing it.<br />\nmeans<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\nA concert in the Auditorium of<br />\n(Greek Letter Societies)<br />\nthe Maryland Casualty Clubhouse<br />\non the twenty-first of February<br />\nwill form part of a very attractive<br />\nPrinters of Philological and<br />\nschedule being arranged by the MuScientific Works<br />\nsical Clubs. This concert, the most<br />\nimportant of the season, will be fol23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\nlowed by a dance in the ballroom<br />\nof the clubhouse. Such a concert<br />\nORDERS RECEIVED FOR<br />\nwas planned last season, but was<br />\nnot held, due to complications arisCOGGINS'<br />\ning in the acceptation of Student<br />\nTransfer and Baggage Express<br />\nActivities cards at any concert not<br />\nAUTOMOBILE SERVICE<br />\nat Homewood. This year the<br />\ngiven<br />\nPHONE, HOMEWOOD 2645-W<br />\nactivities cards will admit bearers<br />\nThe Flag, Banner &amp; Pennant Shop to this concert. General admission<br />\n(Successors to Sisco Brothers)<br />\nwill be 1.50. The Blue Jay Jazz<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools, Band, which constitutes part of the<br />\nSocieties and Fraternities<br />\nMusical Club, will furnish music<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nthe dance.<br />\nfor<br />\nR. H. Taylor<br />\nVernon 2355<br />\nSeveral out-of-town concerts<br />\nhave been partially arranged. A<br />\nconcert in Richmond is being con1 W. University Parkway<br />\nsidered and its definite date is<br />\nOpposite J. H. U. Athletic Field<br />\nawaiting an agreement of guarantee. This concert will make a pleasBOYS<br />\nU.<br />\nH.<br />\nJ.<br />\nfor<br />\nDRUG STORE<br />\ntrip for the members of the<br />\nant<br />\nPHONE, HOMEWOOD 2121<br />\nclub and will strengthen the position of the University in Virginia.<br />\nBuy an (H) Pipe made special<br />\nA concert in Norfolk is awaiting a<br />\nfor the Boys<br />\ndecision similar to that in Richmond. Plans are also under way<br />\nfor concerts in several other nearby cities and towns.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nEverybody<br /><br />\nSuits and O'Coats $30 Upward<br /><br />\nCo<br />\n211-213 E. BALTIMORE ST.<br /><br />\nFURNITURE OF QUALITY<br /><br />\n4<br /><br />\n0<br />\n9<br />\n0<br /><br />\n/16. Alb<br />\nNe<br />\n-Nor<br /><br />\n.41.<br />\nNI NI<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nTO<br /><br />\nJ<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nHaverford<br /><br />\nORTMAN<br /><br />\nFine Clothes<br />\nA suit by Lemmert gives the final<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable<br />\ncloths cut in authentic fashion—<br />\nwhether for every-day wear or more<br />\nfestive occasions.<br /><br />\nLEM M ERT<br />\n19<br /><br />\nDress Clothes<br />\nSport Togs<br /><br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />\nHESS<br /><br />\nQuality<br /><br />\n8 EAST BALTIMORE STREET<br /><br />\nOver one hundred years<br />\nof designing and creating<br />\nSilverware assures the purchaser of Kirk pieces in<br />\nsilver absolute certainty of<br />\nsuperiority.<br /><br />\nSLACKERS<br />\nThese are the Frosh who have SHIRTS<br />\nnothing to do on Saturday after-<br /><br />\nSamuelKirk c<br />\nand Son Co.<br /><br />\nto come out to the football games<br /><br />\nThese are men who<br /><br />\nhaven't even enough spirit to come<br />\n41<br /><br />\nout and root for a team that sacri-<br /><br />\n41<br /><br />\nfices all their evenings and after-<br /><br />\nEstablished in 1817<br /><br />\n4<br />\n41<br /><br />\nnoons to put Johns Hopkins on<br />\ntop.<br /><br />\nGet after them, Freshmen!<br /><br />\nGet them, Sophomores!!,.. ..<br />\nClaude, W. T. Kaufholz, F. A.<br />\nKnox, W. F.<br />\nChesney, M.<br />\nMiedel, C. H..<br />\nDice, F. R.<br />\nDeckert, W. A. Poxas, Jose<br /><br />\nPrinters of the<br />\n:Johns Hopkins News-Letter<br /><br />\nOTIS SKINNER<br />\nIN<br /><br />\n\"Mister Antonio\"<br />\nLOMBARD and SOUTH STREETS<br /><br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nmen and upper-classmen, take note<br />\nof them.<br /><br />\nCollege Literature<br /><br />\nNECKWEAR<br /><br />\nLefrane &amp; Ault<br /><br />\nplayed by their own college. Fresh- HOSIERY<br /><br />\nBaltimore, Md.<br />\nOldest Silversmiths in America<br /><br />\nA. H.Fetting Man'fg Jewelry Co.<br /><br />\nHOPKINS MEN—Wear Hess Shoes and keep your<br />\nmind from your feet<br /><br />\nAft.<br /><br />\n4<br /><br />\n9<br />\n41<br />\n4.1<br />\n41<br /><br />\nEstablished 1873<br /><br />\nAsk Tom Landy at the Hopkins<br />\nShop to tell you just what this<br />\nmeans.<br /><br />\n0<br /><br />\n41<br />\n41<br />\n4/<br />\n4/<br /><br />\n\"Queen Quality\" Home-made<br />\nChocolates<br />\nIce Cream<br />\nIces<br />\nLuncheonette<br />\n227 N. Howard 518 N. Charles<br />\nDancing Every Afternoon at<br />\nCharles St.<br /><br />\nat<br /><br />\nFayette Street, East<br /><br />\nBusiness Suits<br />\nOvercoats<br /><br />\nTomorrow<br /><br />\nA.,<br /><br />\nnoon and yet haven't enough spirit<br />\n41<br />\n4<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nR.G.by &amp; Company<br /><br />\nNV NI<br /><br />\nOf course, you don't have to go<br />\nto College to know that Katz<br />\nClothes are good clothes.<br />\nBut we're mighty glad to have<br />\nhighbrow opinion coincide with<br />\nours in this matter. Ask Landy.<br /><br />\nby Booth Tarkington<br /><br />\nWeek of<br />\nOctober 23<br /><br />\nFORD'S,<br /><br />\nRoxas, Jose<br />\nDost, W. A.<br />\nMorriarty, E. E.<br />\nDuval, J. P.<br />\nNedselney, A.<br />\nEwald, W. G.<br />\nHardisty, N. M. Purvis, M. R.<br />\nSchmidt, H. 0.<br />\nHarrison, M.<br />\nHirschmann, J. Snyder, M. H.<br />\n(Hunter, Thos. Jr.Schonebaum, H.<br />\nIsaac, F. R., Jr. Shaffer, G. S.<br />\nShapiro, H.<br />\nKirk, J. E.<br />\nSidamon, E. S. C..<br />\nKirk, D. J.<br />\nWalsh, Fred<br />\nKu, Te Ming<br /><br />\nNOTES ON STYLE<br />\nFrom delegates at. the National<br />\nClothiers' Convention, being held<br />\nnow in Chicago, comes the news<br />\nthat trousers with a corset effect<br />\nwill be the latest style in men's<br />\nclothes in the course of the next<br />\nfew months. As a proof of this<br />\nprediction, models were exhibited<br />\nwhich are said to be capable of<br />\nplacing man on an equal basis with<br />\nwoman in this respect. A flexible<br />\nbelt secured to each side of the<br />\ntrousers is designed to fit closely<br />\nover the abdomen. When drawn<br />\nin and fastened, the arrangement<br />\ngives a decided corset-like appearance. Talk about the campus<br />\ns6ems to indicate that there will<br />\nbe a heavy sale of the new style<br />\ntrousers to the \"he-flappers\" who<br />\nare now prone to wear colored hat<br />\nbands on soft felt hats.<br /><br />"}], "field_media_file": [{"target_id": 37659, "display": null, "description": null, "target_type": "file", "target_uuid": "bd72b5d6-3eea-4176-9eb2-05fffa4ac4b2", "url": "http://digital.library.jhu.edu/system/files/2022-03/13020-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13020, "target_type": "node", "target_uuid": "b52e93e6-a2a4-423b-ae92-f0de087609d1", "url": "/node/13020"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3006a5ee-4e1a-4822-a43d-4fc755033ba6"}]}