{"mid": [{"value": 51087}], "uuid": [{"value": "c920c34f-f891-4baa-adca-b05bb001d609"}], "vid": [{"value": 51087}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T17:05:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15658-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T17:05:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T17:05:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "T TN<br />\n<br />\nez<br />\n<br />\nTR<br />\n<br />\nR<br />\n<br />\n. e<br />\n<br />\no AR<br />\n<br />\n— T e s e N<br />\n<br />\nGENERAL DESCRIPTION.<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nState, being in length about 32 miles, with an aver-<br />\n<br />\nage width of only 7 miles. Itisa peninsula, bounded<br />\nby the Bay on the east, the Patuxent River on the<br />\nwest, and on the north by Anne Arundel County.<br />\nThe surface is undulating, and drains from a central<br />\nelevation towards the bay and river, into which nu-<br />\nmerous little creeks empty.<br />\n<br />\nThe soil is a soft fine mould, except on the Patux-<br />\nent, where it is more clayey, and is well adapted to<br />\nthe growth of corn, tobacco, and wheat, though the<br />\ngreat staple is tobacco. The climate is generally<br />\nwarm and mild. The waters of the Chesapeake and<br />\nPatuxent abound in the finest fish and oysters; im-<br />\nmense quantities of the latter are annually carried to<br />\nBaltimore and the Northern markets; the trade em-<br />\nploying large numbers of men. Tripoli, which is<br />\nused as a polishing material, is found in many local-<br />\nities, the deposit on the Patuxent being very large.<br />\nMarl exists also, affording a good fertilizer in many<br />\nlocalities. Oak, Chestnut, Pine, and Locust are the<br />\nnatural timber growths, and mostly line the navi-<br />\ngable waters.<br />\n<br />\nCAROLINE COUNTY is of small area, and is<br />\nbounded on the east by the State of Delaware, north-<br />\nwest and west by Queen Anne’s and Talbot, and<br />\nsouth’by Dorchester counties.<br />\n<br />\nThe main branch of the Choptank River runs<br />\nthrough the county, and is navigated by steamboats<br />\nto Denton. This, with other crecks, afford excellent<br />\nfacilities for sending produce to market, and in re-<br />\nturn, obtaining lime, ashes, and manures; scarcely<br />\nany land lying more than five miles from navigable<br />\nwater.<br />\n<br />\nSome of its soils are sandy, some are low meadow-<br />\nlands of rich black earth, but the largest proportion<br />\nis a loam with a clay subsoil. The last will produce<br />\ngrains, grasses, vegetables, cotton, and tobacco, which<br />\nlatter two are raised in small quantities very success-<br />\nfully for domestic use. The sandy soil is very pro-<br />\nductive in sweet potatoes, and every variety of vege-<br />\ntables and fruits. Peaches are very largely cultivated<br />\nand sent to the city markets.<br />\n<br />\nThe general character of the county is level, but<br />\nsufficiently undulating to afford drainage, and the<br />\nroads are mostly level and hard, and give very fine<br />\ntravelling facilities. Some excellent fisheries of shad<br />\nand herring are in the county, and very large quan-<br />\ntities of oysters are marketed. Crabs, wild ducks,<br />\nand other game are also abundant.<br />\n<br />\nThe county-seat is at Denton, a quiet town pleas-<br />\nantly situated at the head of steamboat navigation<br />\non the Choptank River. Two other considerable<br />\ntowns are Greensborough and Hillsborough, both<br />\nnear the Maryland and Delaware Railroad, which<br />\ncrosses the upper part of the county.<br />\n<br />\nCARROLL COUNTY is bounded on the north<br />\nby Pennsylvania, on the south by Howard County,<br />\non the east by Baltimore County, and on the west by<br />\nFrederick County. The surface is mostly undulat-<br />\n<br />\ning, watered by fine streams, tributaries of the Pa-<br />\n<br />\ntapsco and Monocacy rivers, which flow from innu-<br />\nmerable springs of the purest water. Kxcellent<br />\nwater-power is afforded by these streams, which is<br />\nimproved by cotton and woollen factories, merchant<br />\nand paper-mills, and numerous saw and grist-mills.<br />\nThere are also a considerable number of tanneries,<br />\ninduced, no doubt, by the abundance of fine oak<br />\ntimber, which comprises the body of the natural<br />\ngrowth of wood. Parr’s Ridge passes through this<br />\ncounty, and is the first elevated ridge approaching<br />\nthe Alleghanies. From this ridge the Catoctin<br />\nMountains are plainly visible.<br />\n<br />\nThe soils are limestone, “ Red-lands,” and slaty<br />\n<br />\nsoil, all mostly very fertile or easily improved, ren-<br />\n<br />\ndering it one of the finest agricultural counties of<br />\nMaryland. It has but a small proportion of very<br />\npoor or unimproved land.<br />\n<br />\n‘Wheat, rye, corn, and oats are largely produced,<br />\nwith some potatoes and buckwheat, and latterly con-<br />\n<br />\ns N A i N il TS<br />\n<br />\n <br />\n<br />\nsiderable sorghum. Tobacco is still raised to some<br />\nextent in the lower part of the county, but is yearly<br />\n<br />\nless cultivated. The grazing is fine, and it ranks as .<br />\n<br />\na fine dairy county, producing a large share of the<br />\nbutter crop of the State. The Pipe Creek, Sam’s<br />\nCreek, and Wakefield valleys are unexcelled for fer-<br />\ntility and fine farming.<br />\n<br />\nThe county possesses fine building material, a good<br />\nspecies of granite, and other stone. Marble has been<br />\nquarried near Sam’s Creek. Large quantities of lime-<br />\nstone are quarried in the western, central, and north-<br />\nern part of the county, and large beds of iron ore<br />\nare worked in the vicinity of Westminster and else-<br />\nwhere. A number of copper mines have been<br />\nopened, and several are now working, in a line ex-<br />\ntending from the Springfield mine near Sykesville,<br />\nto the Maryland Company’s mine near Finksburg.<br />\n<br />\nThe soapstone quarry near Marriottsville has been<br />\nand is still extensively worked, and furnishes the<br />\npurest quality of soapstone known. At the manu-<br />\nfactory in Baltimore, it is sawed and worked into all<br />\nimaginable shapes for a great variety of purposes.<br />\nThe number of uses to which it is applied have of<br />\nlate been considerably multiplied. Even the refuse<br />\nstone and dust are valuable in many ways.<br />\n<br />\nThe county has a fair share of good roads, and has<br />\ncommunication with Baltimore by means of an ex-<br />\ncellent turnpike, one branch of which runs to West-<br />\nminster, and the other to Manchester. The Balti-<br />\nmore and Ohio Railroad traverses its southern boun-<br />\ndary, and the Western Maryland passes through<br />\nthe centre of the county from the Baltimore to<br />\nthe Frederick County line, passing through West-<br />\nminster.<br />\n<br />\nThe county-seat is Westminster, which has very<br />\nconsiderably increased in business and general wel-<br />\nfare since the completion of the Western Maryland<br />\nRailroad.<br />\n<br />\nNew Windsor, Manchester, Uniontown, and Ta-<br />\nneytown are likewise considerable towns. The first<br />\nmentioned is a fine and handsome town, and is<br />\na delightful summer resort, having several mineral<br />\nsprings.<br />\n<br />\nCECIL COUNTY, organized in 1674, and named<br />\nin honor of Cecil, Cecilius Lord Baltimore, is the<br />\nmost northern of the Eastern Shore counties, forms<br />\nthe north-east corner of the State, being bounded on<br />\nthe north by Pennsylvania, on the east by Delaware,<br />\n(the celebrated Mason and Dixon’s line separating<br />\nthe three States,) on the south by Sassafras River,<br />\nand west by Chesapeake Bay and Susquehanna<br />\nRiver.<br />\n<br />\nThis county is one of the most thriving and enter-<br />\nprising in the State. The character of the land is<br />\nmixed, the part above the Bay being mostly rolling<br />\nand quite hilly, like the Western Shore; and below<br />\nElkton, quite level and similar to the adjoining East-<br />\nern Shore counties. The soil also comprises every<br />\nvariety, a considerable portion centrally situated,<br />\ncalled ¢ The Barrens,” being pure sand and gravel<br />\n(though even this section has of late much improved),<br />\nwhilst other parts have heavier clayey soil, mixed<br />\nrocky, and the lower part an excellent light clay loam.<br />\nThe county is well populated, and the farming and<br />\nimprovements generally are in advance of the aver-<br />\nage throughout the State.<br />\n<br />\n‘Wheat, oats, and corn are the staple farm produec-<br />\ntions; very large crops of hay are raised and sent to<br />\nBaltimore and elsewhere in bales. In the southern<br />\npart, known as Sassafras Neck, are many large<br />\n<br />\n‘peach farms. This crop is very large and profitable<br />\n<br />\nhere.<br />\n<br />\nCecil County possesses inexhaustible quarries of<br />\nexcellent granite at Port Deposit, on the Susque-<br />\nhanna River. Soapstone also exists on the same<br />\nriver, and in the northern part near to Pennsylvania<br />\nare large beds of iron-ore and chrome, comprising a<br />\ngood proportion of the most valuable chrome mines<br />\nin the world. Near North East River are extensive<br />\ndeposits of clay suitable for making fire-bricks, and,<br />\n<br />\n <br />\n<br />\nlatterly, discoveries are reported of kaolin or porce-<br />\nlain clay of a fine quality.<br />\n<br />\nThe county is well watered and possesses some of<br />\nthe best water-powers, which are in most cases well<br />\nimproved with large furnaces, forges, rolling-mills,<br />\npaper, grist, and saw-mills.<br />\n<br />\n“ Gilpin’s Falls,” on Great North East Creek, is a<br />\nwild and romantic place, and is also a great water-<br />\npower, which is at present not used. The creek falls<br />\nabout a hundred feet in but a few hundred feet of<br />\ndistance. Cecil has also the largest number of shad<br />\nand herring fisheries of any county in the State, ex-<br />\ntending from the mouth of the Susquehanna River<br />\naround the bay and river shores into the Sassafras<br />\nRiver. These shores also afford abundance of wild<br />\nfowl in the season.<br />\n<br />\nThe county enjoys excellent facilities for transpor-<br />\ntation. The Philadelphia, Wilmington, and Balti-<br />\nmore Railroad traverses the centre, and also the<br />\nChesapeake and Delaware Canal, and the Philadel-<br />\nphia Central Railroad crosses the north-western cor-<br />\nner of the county. The bay and rivers have lines of<br />\nsteamboats running daily.<br />\n<br />\nThe county-seat is Elkton, on the Philadelphia,<br />\nWilmington, and Baltimore Railroad, a very thriving<br />\ntown of about 1,800 inhabitants. The town of Port<br />\nDeposit, on the Susquehanna River, about 4} miles<br />\nabove its mouth, is the principal business town, and<br />\ntransacts a very heavy trade in lumber and logs, which<br />\nare rafted down the river from the upper country of<br />\nPennsylvania, and also a large trade in grain and<br />\nproduce. This town has a steamboat running to<br />\nHavre de Grace, and also a daily line to Baltimore<br />\nand Philadelphia. The third town in size, Chesa-<br />\npeake City, is situated at the western end of the<br />\nChesapeake and Delaware Canal. Other thriving<br />\nvillages are North East, Brick Meeting-House, Rising<br />\nSun, Cecilton, and Warwick.<br />\n<br />\nCHARLES COUNTY, first settled in 1640, occu-<br />\npies the south-western part of the State, and is<br />\nbounded on the west and south by the Potomac<br />\nRiver, which makes here a very large curve in its<br />\ncourse. Prince George’s County bounds it on the<br />\nnorth, and St. Mary’s County on the south-east.<br />\n<br />\nThe county has an outlet at Benedict, on the Pa-<br />\ntuxent River, having a front thereon of three to four<br />\nmiles. The surface of the county, like that of St.<br />\nMary’s County, somewhat resembles the Kastern<br />\n<br />\nShore, being generally low and sandy, though suf--<br />\n<br />\nficiently rolling to be well drained by the numerous<br />\nbranches flowing into the bordering rivers.<br />\n<br />\nThe soil of Charles County has been much ex-<br />\nhausted by neglectful culture, but endeavors are now<br />\nbeing used to restore and improve it. Onthe banks<br />\nof Port Tobacco Creek and other points, green sand<br />\nshell-marl is found in large quantities, affording an<br />\nabundant fertilizer. A large proportion of these de-<br />\nposits are situated so as to be worked very cheaply.<br />\nThe county is entirely devoted to agriculture, the<br />\ncrops being mostly tobacco, corn, and wheat. The<br />\nformer is the staple production. Fruits do well<br />\nin this section. Fish and oysters abound on these<br />\nshores.<br />\n<br />\nPort Tobacco, the county-seat, is a small town<br />\nnear the head of the creek of the same name.<br />\nThere are no villages of any importance in the<br />\ncounty.<br />\n<br />\nDORCHESTER COUNTY, organized in 1669, is<br />\non the eastern shore, and extends from the Chesa-<br />\npeake Bay to the Delaware State line, and is bounded<br />\non the south-east by the Nanticoke River, separating<br />\nit from Somerset County, and on the north by Chop-<br />\ntank River, between it and Talbot County, and by<br />\nCaroline County. This county, in size, is above<br />\nthe medium, having an area of about 770 square<br />\n<br />\nmiles.<br />\n<br />\nThe country is generally level, though the upper<br />\npart of the county is sufficiently undulating to create<br />\nsome water-powers — which are improved by grist<br />\n<br />\n3 S<br />\no<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "T TN<br /><br />\nez<br /><br />\nTR<br /><br />\nR<br /><br />\n. e<br /><br />\no AR<br /><br />\n— T e s e N<br /><br />\nGENERAL DESCRIPTION.<br /><br /><br /><br /><br /><br />\nState, being in length about 32 miles, with an aver-<br /><br />\nage width of only 7 miles. Itisa peninsula, bounded<br />\nby the Bay on the east, the Patuxent River on the<br />\nwest, and on the north by Anne Arundel County.<br />\nThe surface is undulating, and drains from a central<br />\nelevation towards the bay and river, into which nu-<br />\nmerous little creeks empty.<br /><br />\nThe soil is a soft fine mould, except on the Patux-<br />\nent, where it is more clayey, and is well adapted to<br />\nthe growth of corn, tobacco, and wheat, though the<br />\ngreat staple is tobacco. The climate is generally<br />\nwarm and mild. The waters of the Chesapeake and<br />\nPatuxent abound in the finest fish and oysters; im-<br />\nmense quantities of the latter are annually carried to<br />\nBaltimore and the Northern markets; the trade em-<br />\nploying large numbers of men. Tripoli, which is<br />\nused as a polishing material, is found in many local-<br />\nities, the deposit on the Patuxent being very large.<br />\nMarl exists also, affording a good fertilizer in many<br />\nlocalities. Oak, Chestnut, Pine, and Locust are the<br />\nnatural timber growths, and mostly line the navi-<br />\ngable waters.<br /><br />\nCAROLINE COUNTY is of small area, and is<br />\nbounded on the east by the State of Delaware, north-<br />\nwest and west by Queen Anne’s and Talbot, and<br />\nsouth’by Dorchester counties.<br /><br />\nThe main branch of the Choptank River runs<br />\nthrough the county, and is navigated by steamboats<br />\nto Denton. This, with other crecks, afford excellent<br />\nfacilities for sending produce to market, and in re-<br />\nturn, obtaining lime, ashes, and manures; scarcely<br />\nany land lying more than five miles from navigable<br />\nwater.<br /><br />\nSome of its soils are sandy, some are low meadow-<br />\nlands of rich black earth, but the largest proportion<br />\nis a loam with a clay subsoil. The last will produce<br />\ngrains, grasses, vegetables, cotton, and tobacco, which<br />\nlatter two are raised in small quantities very success-<br />\nfully for domestic use. The sandy soil is very pro-<br />\nductive in sweet potatoes, and every variety of vege-<br />\ntables and fruits. Peaches are very largely cultivated<br />\nand sent to the city markets.<br /><br />\nThe general character of the county is level, but<br />\nsufficiently undulating to afford drainage, and the<br />\nroads are mostly level and hard, and give very fine<br />\ntravelling facilities. Some excellent fisheries of shad<br />\nand herring are in the county, and very large quan-<br />\ntities of oysters are marketed. Crabs, wild ducks,<br />\nand other game are also abundant.<br /><br />\nThe county-seat is at Denton, a quiet town pleas-<br />\nantly situated at the head of steamboat navigation<br />\non the Choptank River. Two other considerable<br />\ntowns are Greensborough and Hillsborough, both<br />\nnear the Maryland and Delaware Railroad, which<br />\ncrosses the upper part of the county.<br /><br />\nCARROLL COUNTY is bounded on the north<br />\nby Pennsylvania, on the south by Howard County,<br />\non the east by Baltimore County, and on the west by<br />\nFrederick County. The surface is mostly undulat-<br /><br />\ning, watered by fine streams, tributaries of the Pa-<br /><br />\ntapsco and Monocacy rivers, which flow from innu-<br />\nmerable springs of the purest water. Kxcellent<br />\nwater-power is afforded by these streams, which is<br />\nimproved by cotton and woollen factories, merchant<br />\nand paper-mills, and numerous saw and grist-mills.<br />\nThere are also a considerable number of tanneries,<br />\ninduced, no doubt, by the abundance of fine oak<br />\ntimber, which comprises the body of the natural<br />\ngrowth of wood. Parr’s Ridge passes through this<br />\ncounty, and is the first elevated ridge approaching<br />\nthe Alleghanies. From this ridge the Catoctin<br />\nMountains are plainly visible.<br /><br />\nThe soils are limestone, “ Red-lands,” and slaty<br /><br />\nsoil, all mostly very fertile or easily improved, ren-<br /><br />\ndering it one of the finest agricultural counties of<br />\nMaryland. It has but a small proportion of very<br />\npoor or unimproved land.<br /><br />\n‘Wheat, rye, corn, and oats are largely produced,<br />\nwith some potatoes and buckwheat, and latterly con-<br /><br />\ns N A i N il TS<br /><br /><br /><br />\nsiderable sorghum. Tobacco is still raised to some<br />\nextent in the lower part of the county, but is yearly<br /><br />\nless cultivated. The grazing is fine, and it ranks as .<br /><br />\na fine dairy county, producing a large share of the<br />\nbutter crop of the State. The Pipe Creek, Sam’s<br />\nCreek, and Wakefield valleys are unexcelled for fer-<br />\ntility and fine farming.<br /><br />\nThe county possesses fine building material, a good<br />\nspecies of granite, and other stone. Marble has been<br />\nquarried near Sam’s Creek. Large quantities of lime-<br />\nstone are quarried in the western, central, and north-<br />\nern part of the county, and large beds of iron ore<br />\nare worked in the vicinity of Westminster and else-<br />\nwhere. A number of copper mines have been<br />\nopened, and several are now working, in a line ex-<br />\ntending from the Springfield mine near Sykesville,<br />\nto the Maryland Company’s mine near Finksburg.<br /><br />\nThe soapstone quarry near Marriottsville has been<br />\nand is still extensively worked, and furnishes the<br />\npurest quality of soapstone known. At the manu-<br />\nfactory in Baltimore, it is sawed and worked into all<br />\nimaginable shapes for a great variety of purposes.<br />\nThe number of uses to which it is applied have of<br />\nlate been considerably multiplied. Even the refuse<br />\nstone and dust are valuable in many ways.<br /><br />\nThe county has a fair share of good roads, and has<br />\ncommunication with Baltimore by means of an ex-<br />\ncellent turnpike, one branch of which runs to West-<br />\nminster, and the other to Manchester. The Balti-<br />\nmore and Ohio Railroad traverses its southern boun-<br />\ndary, and the Western Maryland passes through<br />\nthe centre of the county from the Baltimore to<br />\nthe Frederick County line, passing through West-<br />\nminster.<br /><br />\nThe county-seat is Westminster, which has very<br />\nconsiderably increased in business and general wel-<br />\nfare since the completion of the Western Maryland<br />\nRailroad.<br /><br />\nNew Windsor, Manchester, Uniontown, and Ta-<br />\nneytown are likewise considerable towns. The first<br />\nmentioned is a fine and handsome town, and is<br />\na delightful summer resort, having several mineral<br />\nsprings.<br /><br />\nCECIL COUNTY, organized in 1674, and named<br />\nin honor of Cecil, Cecilius Lord Baltimore, is the<br />\nmost northern of the Eastern Shore counties, forms<br />\nthe north-east corner of the State, being bounded on<br />\nthe north by Pennsylvania, on the east by Delaware,<br />\n(the celebrated Mason and Dixon’s line separating<br />\nthe three States,) on the south by Sassafras River,<br />\nand west by Chesapeake Bay and Susquehanna<br />\nRiver.<br /><br />\nThis county is one of the most thriving and enter-<br />\nprising in the State. The character of the land is<br />\nmixed, the part above the Bay being mostly rolling<br />\nand quite hilly, like the Western Shore; and below<br />\nElkton, quite level and similar to the adjoining East-<br />\nern Shore counties. The soil also comprises every<br />\nvariety, a considerable portion centrally situated,<br />\ncalled ¢ The Barrens,” being pure sand and gravel<br />\n(though even this section has of late much improved),<br />\nwhilst other parts have heavier clayey soil, mixed<br />\nrocky, and the lower part an excellent light clay loam.<br />\nThe county is well populated, and the farming and<br />\nimprovements generally are in advance of the aver-<br />\nage throughout the State.<br /><br />\n‘Wheat, oats, and corn are the staple farm produec-<br />\ntions; very large crops of hay are raised and sent to<br />\nBaltimore and elsewhere in bales. In the southern<br />\npart, known as Sassafras Neck, are many large<br /><br />\n‘peach farms. This crop is very large and profitable<br /><br />\nhere.<br /><br />\nCecil County possesses inexhaustible quarries of<br />\nexcellent granite at Port Deposit, on the Susque-<br />\nhanna River. Soapstone also exists on the same<br />\nriver, and in the northern part near to Pennsylvania<br />\nare large beds of iron-ore and chrome, comprising a<br />\ngood proportion of the most valuable chrome mines<br />\nin the world. Near North East River are extensive<br />\ndeposits of clay suitable for making fire-bricks, and,<br /><br /><br /><br />\nlatterly, discoveries are reported of kaolin or porce-<br />\nlain clay of a fine quality.<br /><br />\nThe county is well watered and possesses some of<br />\nthe best water-powers, which are in most cases well<br />\nimproved with large furnaces, forges, rolling-mills,<br />\npaper, grist, and saw-mills.<br /><br />\n“ Gilpin’s Falls,” on Great North East Creek, is a<br />\nwild and romantic place, and is also a great water-<br />\npower, which is at present not used. The creek falls<br />\nabout a hundred feet in but a few hundred feet of<br />\ndistance. Cecil has also the largest number of shad<br />\nand herring fisheries of any county in the State, ex-<br />\ntending from the mouth of the Susquehanna River<br />\naround the bay and river shores into the Sassafras<br />\nRiver. These shores also afford abundance of wild<br />\nfowl in the season.<br /><br />\nThe county enjoys excellent facilities for transpor-<br />\ntation. The Philadelphia, Wilmington, and Balti-<br />\nmore Railroad traverses the centre, and also the<br />\nChesapeake and Delaware Canal, and the Philadel-<br />\nphia Central Railroad crosses the north-western cor-<br />\nner of the county. The bay and rivers have lines of<br />\nsteamboats running daily.<br /><br />\nThe county-seat is Elkton, on the Philadelphia,<br />\nWilmington, and Baltimore Railroad, a very thriving<br />\ntown of about 1,800 inhabitants. The town of Port<br />\nDeposit, on the Susquehanna River, about 4} miles<br />\nabove its mouth, is the principal business town, and<br />\ntransacts a very heavy trade in lumber and logs, which<br />\nare rafted down the river from the upper country of<br />\nPennsylvania, and also a large trade in grain and<br />\nproduce. This town has a steamboat running to<br />\nHavre de Grace, and also a daily line to Baltimore<br />\nand Philadelphia. The third town in size, Chesa-<br />\npeake City, is situated at the western end of the<br />\nChesapeake and Delaware Canal. Other thriving<br />\nvillages are North East, Brick Meeting-House, Rising<br />\nSun, Cecilton, and Warwick.<br /><br />\nCHARLES COUNTY, first settled in 1640, occu-<br />\npies the south-western part of the State, and is<br />\nbounded on the west and south by the Potomac<br />\nRiver, which makes here a very large curve in its<br />\ncourse. Prince George’s County bounds it on the<br />\nnorth, and St. Mary’s County on the south-east.<br /><br />\nThe county has an outlet at Benedict, on the Pa-<br />\ntuxent River, having a front thereon of three to four<br />\nmiles. The surface of the county, like that of St.<br />\nMary’s County, somewhat resembles the Kastern<br /><br />\nShore, being generally low and sandy, though suf--<br /><br />\nficiently rolling to be well drained by the numerous<br />\nbranches flowing into the bordering rivers.<br /><br />\nThe soil of Charles County has been much ex-<br />\nhausted by neglectful culture, but endeavors are now<br />\nbeing used to restore and improve it. Onthe banks<br />\nof Port Tobacco Creek and other points, green sand<br />\nshell-marl is found in large quantities, affording an<br />\nabundant fertilizer. A large proportion of these de-<br />\nposits are situated so as to be worked very cheaply.<br />\nThe county is entirely devoted to agriculture, the<br />\ncrops being mostly tobacco, corn, and wheat. The<br />\nformer is the staple production. Fruits do well<br />\nin this section. Fish and oysters abound on these<br />\nshores.<br /><br />\nPort Tobacco, the county-seat, is a small town<br />\nnear the head of the creek of the same name.<br />\nThere are no villages of any importance in the<br />\ncounty.<br /><br />\nDORCHESTER COUNTY, organized in 1669, is<br />\non the eastern shore, and extends from the Chesa-<br />\npeake Bay to the Delaware State line, and is bounded<br />\non the south-east by the Nanticoke River, separating<br />\nit from Somerset County, and on the north by Chop-<br />\ntank River, between it and Talbot County, and by<br />\nCaroline County. This county, in size, is above<br />\nthe medium, having an area of about 770 square<br /><br />\nmiles.<br /><br />\nThe country is generally level, though the upper<br />\npart of the county is sufficiently undulating to create<br />\nsome water-powers — which are improved by grist<br /><br />\n3 S<br />\no<br /><br /><br /><br /><br /><br /><br />"}], "field_media_file": [{"target_id": 52010, "display": null, "description": null, "target_type": "file", "target_uuid": "9acf03bb-c0df-482b-8181-de05c2db2b4e", "url": "http://digital.library.jhu.edu/system/files/2022-03/15658-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15658, "target_type": "node", "target_uuid": "eff3a74d-5eb9-49ec-8ec1-6ba822590743", "url": "/node/15658"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "13fd68d6-d76e-41b9-aba1-b631d133e0a9"}]}