{"mid": [{"value": 36675}], "uuid": [{"value": "0ab79805-e336-4f49-a3c3-50adcdfcf074"}], "vid": [{"value": 36675}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12972-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "INTER-CLASS RUSH AND<br />\nFOOTBALL GAME TOMORROW<br />\nClass of '24 and '25 to mix it up and have it out. Traditional conflict promises to hold unusual interest.<br />\nLINEUP FOR TOMORROW'S GAME<br />\nSOPHOMORES<br />\nMeyer or Ross<br />\nRaleigh<br />\nSmallwood<br />\nShriver, G. M<br />\nHomer<br />\nHutzler<br />\nDunning<br />\nMarchetti<br />\nMcDaniel dr Ashton<br />\nDorsey or Limbach<br />\nShriver or Ellicott<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., DECEMBER 9, 1921<br />\n<br />\nVOL. XXVI. No. 18<br />\n<br />\nL E<br />\nL T<br />\nL G<br />\nC<br />\nR G<br />\nR T<br />\nR E<br />\nQ.B<br />\nR H B<br />\nL H B<br />\nF B<br />\n<br />\nFRESHMEN AND SOPHS TO<br />\n• CLASH TOMORROW<br />\n<br />\nFRESHMEN<br />\nSteck<br />\nBergin or Spurrier<br />\nFargo<br />\nSummers<br />\nBates<br />\n.<br />\nYoung<br />\n••<br />\n. Gump<br />\nBalsam<br />\nJones<br />\nMerlees<br />\nFarbman<br />\n<br />\nTWO PLANS FOR NEW STADIUM CONSIDERED<br />\n<br />\nMany More Features Introduced in In- $200,000 Necessary for Erection. Hopkins to Undertake Proposition<br />\nterclass Contest. Dance to Follow<br />\nAlone.<br />\nRush:<br />\nGame and<br />\n<br />\nTwo plans for financing the stadium which is planned to circle<br />\nHomewood field were proposed at<br />\nMonday's meeting of representatives of the University club and<br />\nthe Homewood Company. The<br />\nfirst provided for the sale of 20,000<br />\ntwo year season tickets for the<br />\nathletic contests to be held at<br />\nHomewood, to the public at $15<br />\nIt was decided by a joint com- apiece. This would net $300,000,<br />\nmittee of the classes to allow none 50 per cent. more than the reof the Varsity men who have par- quired $200,000 necessary for the<br />\nticipated in games this year to take erection of a stadium. The balance<br />\nPart in the inter-class contest, with would be used to sustain athletics<br />\na view to discovering new mateand finance the whole proposition<br />\nrial for next year's squad. This until the two years covered by the<br />\nwill bar a• number of good men tickets would be past. The other<br />\nfrom both teams; Coady, Bonner, plan, which was the one finally<br />\nBarton, Brumble and Harwood, of adopted, provided for the sale of<br />\nthe Sophomores, and Westerman, stock to the amount needed to give<br />\nMcGill, Spinney, Willis, Darley, interest at 6 per cent.<br />\nCouncill, Turnbull and Osborne. of<br />\nA possibility of enlisting the aid<br />\nthe Freshmen, being forced to view of the city in the Homewood prothe game from the sidelines. This ject instead of a separate stadium<br />\nwill not cause the contest to de- at Mount Royal or elsewhere was<br />\nvelop into a poor exhibition of also thought to exist until Dr. C.<br />\nfootball, as there are other good W. Bridgman stated that the<br />\nmen worthy of upholding the hon- Homewood undertaking would be<br />\nor of their respective classes.<br />\ncarried out by Hopkins alone. Dr.<br />\nThe Freshmen will begin the 'Bridgman, Blanchard Randall,<br />\ngame with the same lineup they Dr. Van Orman and Dr. Thomas<br />\nhave had throughout the year, with Brown represented the Varsity<br />\nthe addition of Young, of the Var- Club, while W. Stuart Symingsity squad, at tackle. The Soph- ton and other members of the exomore team is composed mostly of ecutive committee were the repmembers of last year's Fresh team, resentatives of the Homewood<br />\nand the majority of these men have Company.<br />\nA concrete stadium with a cahad furthd experience on the Varof 30,000 persons will be<br />\npacity<br />\nsity squad this year. It would be<br />\nand such games as that<br />\nerected<br />\ndifficult to attempt a comparison<br />\nand possibly the<br />\nVirginia<br />\nwith<br />\nbetween the two teams. The firstevery other<br />\ngame<br />\nArmy-Navy<br />\nYear 'men showed to a disadvanwith ample<br />\nprovided<br />\nyear<br />\nwill be<br />\ntage in their only game of the seacrowds<br />\nthe<br />\nson when they were defeated by facilities for handling<br />\natundoubtedly<br />\nSevern School to the tune of 27-0. which they will<br />\nSince then, however, steady prac- tract.<br />\ntices have contributed much toJUNIORS ELECT HONORARY<br />\nPRESIDENT<br />\nwards polishing off the rough spots<br />\nAt a meeting of the Junior Class<br />\nand marked improvement has been<br />\nShown.<br />\nlast Tuesday, Dr. Swartz was elected honorary president to succeed<br />\nThe' Sophomore team is, as yet,<br />\nDr. Hulbert, who left the Univeran unknown quantity. It's line will<br />\nsity last year to take the position<br />\nProbably outweigh the Freshmen of professor of physics at the Unidefense ten pounds to the man, versity of Iowa. The choice of Dr.<br />\nand the team, on the whole, seems<br />\nSwartz was a very popular one,<br />\nto be more 'experienced. Lack of<br />\nsince he has hosts of friends<br />\nteamwork and inability to play tothroughout the class and the Uni;ether, however, may upset the versity.<br />\n'l°Pe and cause the Freshies to<br />\nAt the same meeting the possisPring a surprise upon the confident<br />\nbility of giving a Junior Prom was<br />\noPhs.<br />\nPresident Middleton<br />\ndiscussed.<br />\ncommittee to invesa<br />\nappoint<br />\nwill<br />\nmeetBoth classes, at recent class<br />\nand report later<br />\nmatter<br />\nthe<br />\ntigate<br />\nings, have discussed plans for the<br />\nclass.<br />\nthe<br />\nto<br />\nContinued on page 3, col. 5<br />\nChafing at the leash, the Sophomore and Freshmen- football<br />\nteams are eagerly awaiting the referee's whistle for tomorrow's game<br />\nat Homewood Field. The rivalry<br />\nbetween the two classes is intense<br />\nand this has done much towards<br />\n•Preading interest among upperclassmen and outsiders.<br />\n<br />\nDORMITORY COMMITTEE<br />\nTAKES CARD CENSUS<br />\n<br />\nFOOTBALL \"H\" AWARDED<br />\nTO THIRIEEN MEN<br />\n<br />\n0. D. K.INITIATES EIGHT<br />\nNEW MEN<br />\n<br />\nEfforts Made to Determine Number of Brawner Re-elected Manager of Football Selection Based on Character and UnBasketball Dropped from 1921-22<br />\nFuture Occupants.<br />\ndisputed Leadership.<br />\nAthletic Schedule.<br />\n<br />\nIn order to complete the estimate of the amount of money<br />\nwhich would be received for lodging in the proposed Alumni Memorial Dormitory, a card has been<br />\nsent to each student of the University, requesting him to state<br />\nthe price of the room he would<br />\nwish to occupy. 'With the return<br />\nof these cards W. Graham Boyce,<br />\ntreasurer of the University, will<br />\nbe able to determine to what extent the proposed dormitory will<br />\nbenefit the students. Also he will<br />\nhave some idea as to what would<br />\nbe a fair price for the rooms, it being natural to suppose that most<br />\nof the students answering his card<br />\nwill name a room at something<br />\nnear the price they are now paying.<br />\nBefore the work can be started<br />\nit has been found necessary to estimate as near as possible the<br />\namount which would be available<br />\neach year to help pay off the original cost of the building. With the<br />\nfund furnished by the Alumni Association and the amount returned<br />\non the cards it will be easy to form<br />\na plan of payment for the buildFor several years the feeling has<br />\nbeen expressed at Hopkins that<br />\nlack of school spirit was caused by<br />\nNot that<br />\nlack of dormitories.<br />\nschool spirit has been lacking to<br />\nany great extent however, but it is<br />\nthought by everyone interested in<br />\nthe welfare of the University that<br />\nthe building of sufficient \"dorms\"<br />\nto house all the students would<br />\ngreatly increase the feeling that<br />\ncollege life means more than the<br />\nmere attaining of a degree.<br />\nSo far very few traditions have<br />\nbeen handed down to the lower<br />\nclassmen. Traditions of rooms occupied by famous athletes and<br />\nbrilliant students are entirely unknown due to the fact that, although many of the students have<br />\nattained a wide reputation for divers university activities, none of<br />\nthem ever actually lived on or<br />\nwere a part of the campus.<br />\nThe Alumni Memorial will be<br />\nthe first dormitory completed and<br />\nmay be ready for occupancy at the<br />\nbeginning of the next scholastic<br />\nyear. The cost will be approximately half a million dollars and<br />\nto aid the treasurer in his report<br />\nto the trustees of the amount he<br />\nwill be able to devote to this causd<br />\neach year, all the students will<br />\nhave to do is to sign the card and<br />\nreturn it immediately. It is hoped<br />\nthat as many students as possible<br />\nwill attend to this so that the<br />\nwork on the new \"dorm\" may be<br />\nstarted at once.<br />\n<br />\nNOTICE!<br />\nThere will be a meeting of<br />\nthe Student Council Monday<br />\nevening at eight o'clock, at<br />\nthe Beta Theta Pi House.<br />\n<br />\nTrack Organization meeting Monday at 4.15 in C. E.<br />\nHall.<br />\n<br />\nEight men were taken into the<br />\nAt the last meeting of the Ath- Omicron Delta Kappa National<br />\nletic Association Board held Wed- Honorary Fraternity at the public<br />\nnesday night the final award of initiation held at yesterday's stuletters was made to men on the dent assembly. The men to receive<br />\nfootball squad during the past sea- this honor were Gilson C. Engel,<br />\nson. The Varsity \"H\" will be Richard M. Wood, R. Dorsey<br />\ngiven to Totterdale, Landy, Watkins, Edward 0. Huey, WilKnecht, Middleton and Calkins, liam G. Totterdale, E. H. Salter,<br />\nall of whom have been previous- Samuel A. Middleton and Oliver<br />\nly honored with the coveted ath- D. Collins.<br />\nletic emblem. Sweaters are to be .The principal factor in the segiven to those who have won lection of men for membership in<br />\ntheir letters for the first time, and the Omicron Delta Kappa society<br />\nthis list includes Markell, Darley, is character, but undisputed leadBonner, Westerman, Magill and ership in at least one of the folRich. H. Pierce Browner, as man- lowing branches of campus activiager, will also receive a sweater, ties is required: Scholarship, athand Willis, Spinney, Coady and letics, social leadership, including<br />\nBarton will get\"H. A. A.\".<br />\nconspicuous service to the instiTo Carl Wilson, of the Medical tution ; literary ability, societies<br />\nSchool, who played such a bril- and publications.<br />\niant game whenever he was called<br />\nElection to the society is, thereupon to take over the generalship fore, recognition of the leadership,<br />\nof the team, will be awarded Var- proficiency and activity of the<br />\nsity \"H\" on special merit. Too candidates in one or more activimuch cannot be said in praise of ties and endorsement of his charthe spirit Wilson has shown dur- acter and personality.<br />\ning the past season when he conWhile membership in 0. D. K.<br />\nscientiously attended practices in is probably the highest honor<br />\nspite of the fact that Coach Van which can be obtained by a stuOrman did not often find it nec- dent, the society is, by picking out<br />\nessary to call upon him for his the leaders in the various activiservices, and example of his work ties on the campus and bringing<br />\nshould be an inspiration not only them together in a small group, to<br />\nto Medical School students but to provide greater co-operation and<br />\nHopkins undergraduates as well. more complete understanding beAnother man to get an \"H\" on tween the activities.<br />\ngrounds of special merit is Jake<br />\nIt is the exchange of.ideas, conMiller, who served as manager structive criticism and the presenduring part of the season -of 1920. tation of new schemes and plans<br />\nAll of the sweaters will be given for the betterment of conditions<br />\nout as soon as possible.<br />\nat the University that the society<br />\nIn view of the fact that Hop- primarily exists. Membership is<br />\nkins turned out a team which won not therefore the culmination of<br />\na clear title to the state football work in any one activity, but<br />\nchampionship, gold footballs will rather a door to new and greater<br />\nbe given those men who partici- field of endeavor. For this reason<br />\npated in the St. John's game and it is necessary that a well balanced<br />\na letter of thanks to Barney circle be secured and that no one<br />\nO'Rourke will be sent in apprecia- type of leader predominate.<br />\ntion of his great services in coachThe selection of the new men<br />\ning the line and in making it a fulfill this requirement excellentsuccessful cog in the mechanism ly. The eligibility of the men takof the whole machine. H. Pierce en in is unquestionable, and with<br />\nBrowner. '23, was re-elected as that addition to the ranks of the<br />\nmanager of the football team for elder members the circle possesses<br />\nthe season of 1922. The choice is unusual strength and versatility.<br />\nconsidered a logical one as the effiGilson Engel is president of the<br />\nciency of Manager Browner's Senior class, president of the Drawork on behalf of the team is rec- matic Club, president of the Interognized by everyone.<br />\nfraternity Board and head cheer<br />\nJ. C. Thompson reported that leader. He has shown his abilit-the Homewood Varsity Club Fi- as a leader throughout the year, in<br />\nnance Committee was of the opin- instilling a fine spirit of support<br />\nion that it would be impracticable and co-operation in the student<br />\nto put a basketball team on the body for alroccasions 'upon which<br />\nfloor this season. Dr. Evelith P. he has been called to take a leadBridgman recommended that both ing hand.<br />\nRichard Wood is president of<br />\nbasketball and tennis be dropped<br />\ntemporarily from the activities of the Student Council, a position<br />\nthe University owing to lack of conceded by all to be the most<br />\nproper facilities for practice, etc. honored of the campus. He was<br />\nAs finally decided, there will be a last year vice-president of the Juswimming team and a tennis team nior class and has won his major<br />\nto represent Hopkins in the minor \"H\" in track. Last year he was<br />\nsports this year. A resolution was delegate to the Student Council<br />\nalso drawn up and sent in to the and a Junior editor on the NewsStudent Council for approval, re- Letter.<br />\nThese two men represent merequiring compulsory attendance on<br />\nthe part of Freshmen at all games ly the leadership of our college<br />\nof the spring athletic season. It is life.<br />\nR. Dorsey Watkins is editor-inthought in this way to solve the<br />\nproblem of adequate support for chief of the Hullabaloo, secretary<br />\nthe track, lacrosse and baseball of the class and president of the<br />\nteams, which support has never Debating Council. . In his first<br />\nbefore been forthcoming to a three years he held the following<br />\nmarked extent at Hopkins. It is offices: Secretary-treasurer DeContinued on page 4, col. 1<br />\n<br />\nContinued on page 4, col. 4<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1921<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nA CHANCE TO MAKE MONEY IN<br />\nBLACK AND BLUE JAY AD<br />\n<br />\nFor the benefit of the poetically<br />\ninclined among Hopkins students<br />\n$2.50<br />\nSubscription<br />\nthe Black and Blue Jay's current<br />\nat<br />\nPostoffice<br />\nat<br />\nthe<br />\n1909,<br />\ncarries an advertisement<br />\nDecember<br />\n3,<br />\nissue<br />\nmatter<br />\nsecond-class<br />\nas<br />\nEntered<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nfrom the Durham-Duplex Razor<br />\nPublished semi-weekly from October to June by the students of Johns Company which the members of<br />\nHopkins University.<br />\nall classes would do well to conBusiness communications should be addressed to the BUSINESS MAN- sider. Far be it from our reporAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\n, torial mind to insinuate that the<br />\nshould be sent to the MANAGING EDITOR.<br />\n,<br />\nrave and reverend Senior as he<br />\nHomewood 100<br />\nTelephone<br />\ndigests his lunch at the Barn is in<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nneed of a shave, but it is certain<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nthat the lesser lights among us—<br />\nManaging Editor:<br />\nthe Freshmen and the SophoCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nmores—might ponder over it to<br />\nFALLON,<br />\n'23.<br />\nGLOVER<br />\nP.<br />\nEditors:<br />\nAssociate<br />\nEDWARD G. HUEY, '22.<br />\nadvantage.<br />\nAdvertising Manager:<br />\nELI FRANK, JR., '22.<br />\nThe ad is nothing less than an<br />\nDONALD K. VANNEMAN, '23.<br />\nJunior Editors:<br />\non the part of the company<br />\noffer<br />\nCHARLES C. MARBURY, '22.<br />\nAssistant Business Managers:<br />\nJ. BRENTNALL POWELL, '23.<br />\na prize of One Hundred<br />\nto<br />\ndonate<br />\nBERNARD C. HEARN, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\ncash to the student<br />\nDollars<br />\nin<br />\nJOHN C. LEWIS;'23.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEOPOLD, '24.<br />\nFITZGERALD DUNNING, 924.<br />\nwho has turned in the best limRIGNAL W. BALDWIN, JR., '23<br />\nerick mentioning the Durham-Duplex Razor by the end of the colMember of Southern Intercollegiate Newspaper Association:<br />\nlege year. In addition, prizes of<br />\nfifty, twenty-five, fifteen and ten<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ndollars are offered and to everyone who sends in a limerick a free<br />\nBALTIMORE, MD., DECEMBER 9, 1921<br />\nDurham-Duplex \"demonstrator\"<br />\nwill be given. The artistically inTHE 0. D. K. ELECTION<br />\nclined may illustrate a limerick<br />\nand the best of these illustrations<br />\nWe wish to take this opportunity to congratulate the new mem- will be rewarded with an additionbers of Omicron Delta Kappa upon their election into that society, al prize of twenty-five dollars.<br />\nA limerick, though redolent of<br />\nand at the same time to compliment the circle upon its selection.<br />\nSinn Fein and rnossbag whiskey,<br />\nMembership in 0. D. K. is the greatest honor which can be obhas nothing to do with Ireland.<br />\ntained by an undergraduate. Selection of its members is based upon The Durham-Duplex Company<br />\ncharacter and personality as well as upon marked proficiency in one thinks it is a form of poetry and<br />\nor more of the five phases of campus activity from which the candi- in justification of this stand, subdates are drawn. The round gold key-the symbol of membership—in- mits an example on one of the advertising pages of the Black and<br />\ndicates that the owner is an undisputed leader in the college from<br />\nBlue Jay. which he comes. It should be given, therefore, only to those who in<br />\nThe fact remains that five lines<br />\nthe opinion of their fellow students, are worthy of the honor and of verse, modeled on the specimen<br />\nwe believe that there can be no question concerning the eligibility given by the Durham-Duplex<br />\nof the eight men taken in yesterday, nor do we feel, can anyone com- Company, based on a suitable subject and not trifling with the digplain with justice of having been overlooked.<br />\nnity or foibles of University professors, will bring the incipient<br />\nauthor at least a good razor and<br />\nperhaps a cash prize. In the latTHE PROPOSED STADIUM<br />\nter case the fortunate youth is inIt is with its hearty endorsement that the News-Letter learns vited to come to the News-Letter<br />\nthat the original plan for a stadium at Homewood is to be carried out office to talk business.\"Who runs<br />\nin the near future and it is a source of gratification that instead of may read\". Let all the faithful dig<br />\nup the last issue of the Jay and try<br />\nbeing hindered in any way by the project, plans for our field have, if<br />\ntheir calloused palms at verseanything, been advanced by the city's action. The need of a bowl or making.<br />\nhorseshoe, as it really will be, has been long felt at Hopkins, and now<br />\nthat Baltimore realizes what an advertisement and real attraction<br />\nCHRISTIAN SERVICE CLUB<br />\nACTIVITIES<br />\nsuch a development would be, the financing should be made considFOUNDED 1897.<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nAN INTERESTING LETTER FROM<br />\nOUR FORMER Y. M. C. A.<br />\nSECRETARY<br />\n<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br />\n<br />\nThe Methodist Mission,<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of Ft letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nFoochow, China,<br />\n<br />\nOctober 15, 1921.<br />\nHopkins<br />\nJohns<br />\nUniversity.<br />\nDear Friends: At last we have<br />\narrived at our destination in a city<br />\nthat simply can't be described. The<br />\nrecent postal census of China, so I<br />\nam told, gave Foochow a population of 1,400,000 the largest city of<br />\nChina. Yet in such a city only two<br />\nTo the Editor of the Johns Hopkins<br />\nbuildings have running water, the<br />\nNews-Letter.<br />\nY. M. C. A. and a private residence.<br />\nOne of the most unfortunte oc- VVith the exception of one new<br />\ncurrences at the Army-Marine modern street, about 30 feet wide,<br />\ngame Saturday was the fact that practically every street in the whole<br />\nHopkins men were not admitted to city is about six feet wide, lined<br />\nHomewood field upon presentation right and left with shops of all conof their A. A. L. tickets. The foot- ceivable kinds. At night heavy<br />\nball authorities at the University boards are nailed up across the<br />\ncertainly should have seen to it front of the store and humans,<br />\nthat Hopkins men would be admit- dogs, cats, pigs,.chickens, all go to<br />\nted to the game; but, to the con- bed in what during the day and<br />\ntrary it seems that the authorities half the night was a first-class shop.<br />\ntook special care to keep out the You ask how does traffic pass?<br />\nHopkins men, unless, of course, Well, it doesn't as at home, foi<br />\nthey paid admission. Why should there are no horses and carriages<br />\nsuch conditions exist at the Uni- or autos here except four or five<br />\nversity? Even members of our Fords as jitney buses on the new<br />\nown football team were standing street, and fve or six horses to keep<br />\nat the rear entrance to the field and the Fords moving. All travel is<br />\nrefused admittance; that same done in either rickshaw or sedan<br />\nbunch of fellows that brought chair. Still worse, among the comHopkins the State football cham- mon people, who comprise about<br />\npionship. Only when Coach Van 95 per cent., the handkerchief is<br />\nOrman heard that these men were unknown; as also the semblance of<br />\noutside the gates and unable to get any toilet facilities; very few<br />\nin, did he (the coach) see to it that clothes are worn, practically none<br />\nthese men got in. The rest of the of the coolies, men or women, wear<br />\nHopkins students were on the out- any shoes or stockings. The disside looking in. Why should such ease seen everywhere almost makes<br />\na condition exist? Expressions one sick; you cannot help from seeheard on the outside of the fence ing children's faces and heads full<br />\nwill, no doubt, make themselves of running sores, which in turn<br />\nheard on the campus. And still furnish excellent feeding ground<br />\nthe athletic authorities wonder for flies and mosquitoes which carwhy teams are not properly sup- ry the contagion to the others. It<br />\nported. These minor details go a makes one wish that it was poslong way and the students who sible to find a gold mine somewere on the outside Saturday will where to help just a little bit to renot forget very soon.<br />\nlieve such suffering. Then, too,<br />\nrealizing that ony five out of every<br />\nPersonally, I want to say a few<br />\n100 men are able to read or write<br />\nwords. I am a member of the band.<br />\ntheir own name, and that the averI came out to Homewood Field<br />\nage for women is less than one in<br />\nevery Saturday, played my head off<br />\nevery 1,000, with the subsequent<br />\nand went home happy. The band<br />\npreying upon this ignorance and<br />\nsaved the athletic authorities sevsuperstition by the unscrupulous<br />\neral hundred dollars during the<br />\n(usually the native priests), we feel<br />\nerably easier.<br />\nThe members of the Christian football season. I will admit we that our life will amount to someService Club. formerly the Preach- were slightly reimbursed for play- thing worth while if we can even<br />\nThat Homewood is the logical place for a field is beyond quesers' Club, held a meeting on Mon- ing by having two' complimentary in a small way help to make contion. None of the sites, in the first place, that have been entertained day, December 5th. W. R. Barn- tickets given us. But just because<br />\nditions better in this land of 400,as possibilities by the city are extensive enough to include more than hart, a member of the club, spoke we were not playing at the Army000,000 people, comprising one- .<br />\none gridiron and certainly no track. With regard to transportation to.the club about the life of Martin Marine game Saturday we could fourth of the population of the<br />\nfacilities, too, these sites have been woefully lacking. The draining Luther. A general discussion, led not get in.<br />\nwhole world.<br />\nCromwell,<br />\nfollowed<br />\nthe<br />\nadby<br />\nC.<br />\nwatchdogs<br />\nof<br />\nthe<br />\nstumbling<br />\nblock,<br />\nand<br />\nWhen the spring sport season<br />\nSincerely,<br />\nof such a field has proved a<br />\ndress. It was announced that the rolls around we will hear the same<br />\nPEARCE HAYES.<br />\nthe treasury declare that financing by the city of such a project is<br />\nRev. Canon McComb would be the story; come out and play at the<br />\nutterly out of the question. So Homewood, which naturally solves<br />\nRiderwood, Md.<br />\nrincipal speaker at the next meet- games. Certainly, we'll play; as<br />\nall these problems except that of finance, is the one place for a field. ing to be held at the home of Mr.<br />\nNovember<br />\n14, 1921.<br />\nlong as there is a Hopkins team on<br />\nCan we sell that stock?<br />\nSylvester, 2309 Edgemont Avenue, the field we'll be only too glad to Editor Johns Hopkins NewsLetter, Baltimore, Md.<br />\non December 19.<br />\nbe of some slight assistance to the<br />\nSir:<br />\nof<br />\nDr.<br />\ninvitation<br />\nActing on the<br />\nUniversity, but I hope that the auThere is a condition prevalent<br />\nEaston, of Homewood Chapel, the thorities will remember that such<br />\nclub took charge of the service at occurrences as Saturday's, harms about the University that should<br />\nALUMNI, WILL YOU SUBSCRIBE?<br />\nthat chapel on last Sunday after- the University in the end. Re- be given some attention by the<br />\nAlthough the News-Letter has gone to considerable expense noon. Paul Stevens, president of member the students back the students and should be settled<br />\nand trouble in an attempt to interest Hopkins Alumni in the steady the club, spoke; Roberts sang and teams and they should not be kept once and for always.<br />\nAre Freshman regulations to be<br />\nConning read the Scripture. The out of, their own field.<br />\ngrowth of undergraduate life at the University, the number of subclub will also conduct the service<br />\nenforced and if so, what penalty<br />\nscriptions reaching the office has been very disappointing. Faithful- this Sunday at 4:15. All Hopkins<br />\nJ. A. NAVIASKY, 22.<br />\nshould there be for violating<br />\nthe<br />\npaper<br />\nha.)<br />\nopening<br />\nof<br />\nthis<br />\nsemester,<br />\nsince<br />\nthe<br />\nly, twice a week<br />\nthem?<br />\nmen are invited to attend.<br />\nbeen mailed to a chosen list of former J. H. U. graduates in the exSince paddling has been frowned<br />\nPREPARATIONS FOR THE NEXT ter right here at hand there should upon by the<br />\nAlma<br />\ntheir<br />\nDean, Sophomores<br />\npectation that they would have enough real interest in<br />\n\"JAY\" BEING MADE<br />\nbe any number of contributions<br />\nall<br />\nlost<br />\nhave<br />\ninterest in the upholdMater to want a subscription to the periodical which endeavors to<br />\nAt a meeting of the editorial handed in. The Jay can't run with- ing of Hopkins traditions and<br />\npublish all news of interest to Hopkins men.<br />\ncandidates for the Black and Blue out contributions. Come through with the exception of one instance<br />\nNaturally, the paper cannot be published without considerable Jay, held last week, plans were with some good hard work and of a well applied leather belt, no<br />\nexpense, and it is entirely through subscriptions and advertisements given out for the next number.<br />\nput the next number across big. enforcement has been observed<br />\nThis<br />\ncalled<br />\nthe<br />\nwill<br />\nbe<br />\nnumber<br />\npublication<br />\nare<br />\ndefrayed.<br />\nBills<br />\nare<br />\ntherefore being<br />\nthat the costs of<br />\nAll contributions must be in be- recently around the Barn.<br />\n\"Wise Guy\" number. It will be<br />\nSome Sophomores claim that ill<br />\nmailed out with this issue and it is earnestly hoped that the Alumni<br />\naimed at the cake eaters and the fore the Christmas holidays. The order to put across their views it<br />\nwill subscribe or at least mail in notice to discontinue their sub- grinds.<br />\nmagazine will be out just after the is sufficient to incite a<br />\nriot. This<br />\nscription.<br />\nWith this wealth of subject mat- holidays.<br />\nContinued on page 3, col. 2<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1921<br />\nNEW COURSE OF FOREIGN<br />\nLECTURES<br />\n<br />\nThe University has arranged for<br />\na number of lectures to be given<br />\nby foreigners concerning politics,<br />\nLIBERTY ST. at SARATOGA<br />\nletters and science. This has been<br />\n(Opposite Hotel Rennert)<br />\ndone to present to the students and<br />\nothers,foreign thought and results<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\nof scientific research. Through an<br />\nDANCES arrangement between a group of<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\nseven American universities and<br />\na number of French universiTelephone St. Paul 6987<br />\nties, professors of engineering<br />\nand applied science will be exDo you know how best to provide changed by the two countries. Prof.<br />\nan income for your old age?<br />\nJacques Cavalier, rector of the UniConsult with<br />\nversity of Toulouse, will be the<br />\nW. W. WALKER<br />\nfirst to visit the school, under the<br />\n909 Calvert Bldg. St.Paul 2581 arrangement and will deliver lectures on metallurgical chemistry<br />\nuntil January 15.<br />\nLIBERTY<br />\nDr. Ernest Cohan, professor of<br />\nExpert Cleaners and Dyers<br />\nchemistry in the University of<br />\nSpecial Rates to Hopkins Men Utrecht, Holland, lectured on<br />\n''Scientific Work in Holland\" last<br />\nHoinewood 5205-W<br />\n211 E.25th St.<br />\nFriday at 4:30 P. M., in the Civil<br />\nEngineering Building.<br />\n<br />\nDATES SET FOR JUNIOR-SENIOR<br />\nDEBATE TRYOUTS<br />\n<br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br />\n<br />\nThe tryouts for members of the<br />\nteams to take part in the JuniorStyles for every taste.<br />\nSenior Debate will be held on December 13 and 14. The Junior tryBaltimore's Best Store<br />\nouts will take place on the thirteenth, with the Senior tryouts on<br />\nthe following day, and Dr. John<br />\n8c,<br />\nC. French will pick the two teams.<br />\nIt is very necessary that any man<br />\nwho hopes to be a member of the<br />\nteam which will represent Hopkins<br />\nin the intercollegiate triangular deProtestant Episcopal Church<br />\nbates later in the year come out<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nfor the class teams. The performRoland Park<br />\nance of the members of the class<br />\nteams will be used by Dr. French<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nin picking the team to represent the<br />\nSUNDAY SERVICES<br />\nuniversity later in the year.<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\nThe subject for the Junior-Senior<br />\n8 P. M.—Choral Evening Prayer<br />\ndebate will be the same as the one<br />\nto be used in the intercollegiate debate: Resolved, That the United SOPHOMORES NOMINATE HULLABALOO REPRESENTATIVES<br />\nStates Government Should Own<br />\nAt a class meeting of the Sophand Control the Coal Resources of<br />\nthe Country. After the debate the omores held Tuesday, December<br />\nCOntinued from page 2<br />\nusual informal dance, which has 6, in the M. E. Building, nominamay be so, but it is a condition done much to make<br />\nLunches, Cigars<br />\ndebates more tions for the positions of class edithat should not exist. Has the Stu- popular, will be held.<br />\norial and business representatives<br />\nCigarettes<br />\ndent Council no influence on the<br />\non the Hullabaloo Board were<br />\nFreshman who refuses to obey the<br />\nCandy, Soda and<br />\nmade. According to the new conregulations they prescribe?<br />\nBAD MANNERS AT PUBLIC LEC- stitution of<br />\nthe class, all nominaPipes and Fountain Pens<br />\nTURES<br />\nThe regulations should not only<br />\ntions must be made at one meetT $8.00, made<br />\nbe kept up by the Sophomores, but To the Editor-in-Chief of<br />\nAt the Barn<br />\ning and they may then be voted<br />\nof grain leather,<br />\nby all upperclassmen who are inTHE NEWS-LETTER.<br />\non one week later, provided that<br />\nE. E. Adams terested<br />\nin<br />\ntan or black,<br />\nin seeing the incoming<br />\nDear Sir: Almost every week the nominations have in the<br />\nclass learn its paces.<br />\nwith square toe and<br />\nsome one of more or less note and meantime been published in the<br />\nHowever, should conditions ex- distinction lectures to the students News-Letter. The nominations,<br />\nheavy perforations,<br />\nist as they now are I, for one, am and the public at Johns Hopkins. which will be voted on at the<br />\nthis<br />\nis an oxford<br />\nnext<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations heartily in favor of withdrawing At these lectures or addresses it meeting of the class, are as folany college man<br />\nall restrictions on the Freshman seems to be becoming a habit with lows:<br />\nJAS. H. DOWNS<br />\ncan be proud of.<br />\nclass. If it's worth doing, it's a great many people to either arAssociate Editor — Randolph<br />\nENGRAVER PRINTER STATIONER<br />\nIn high shoe the<br />\nworth doing well, so let us see rive late or depart early. Whether Norwood, Joseph S. Leopold,<br />\nJ.<br />\n229 N. CHARLES ST.<br />\nsome action by all upperclassmen the speaker has begun or has not Edward Mount.<br />\nsame style is $8.50.<br />\neither to put up or shut up.<br />\nyet ended his speech seems to matBusiness Staff Representative—<br />\n•<br />\nNECKWEAR<br />\nR. C. H. ter not at all. ,At the last address William G. Dean, William HowSHIRTS<br />\n—that of one of the foremost jour- ard, Thomas Jenifer, James K.<br />\nEstablished 1873<br />\nnalists of Europe—there appeared Harwood.<br />\nA.H.Fetting Man'fg Jewelry Co. to be an almost continual disturb- Tentative secret plans for the<br />\n421 N. HOWARD ST.<br />\nCharles Street, 210 North<br />\nManufacturers<br />\nance<br />\nGLOVES<br />\nbecause<br />\n(<br />\nof<br />\npeople<br />\ngoing<br />\nin<br />\nor Frosh-Soph scrap were also<br />\nHOSIERY<br />\nGreek Letter Fraternity Jewelry<br />\ngoing out.<br />\nbrought up and discussed, but<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nNo doubt these people had per- lothing definite was decided upon.<br />\nSTRATTON SHIRT MAKER<br />\nfectly logical excuses, but the fact<br />\nThe Episcopal Church of<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nElkridge Farms Dairy<br />\nremains that it is awfully distractSt.<br />\nMichael and All Angels<br />\n$3.25 and $4.25<br />\nNegligee<br />\nSTRICTLY FRESH MILK<br />\ning for the speaker and everybody<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nST. PAUL and TWENTIETH STS.<br />\nTerms Cash, Less 10% 30 Days on<br />\nProdue d, Pasteurized and Bottled else. Aside from that, however, MUSICAL CLUBS SCORE HIT ON<br />\nShirts<br />\nin Howard County<br />\nROAD<br />\nWyatt<br />\nBrown, D.D., Litt.D., Rector<br />\nit is rude in the extreme, and it<br />\nAlso a Full Line of Men's<br />\nEllicott City 231-R<br />\nCLARK BROS.<br />\nHoly<br />\nFurnishings<br />\nCommunion<br />\nat 7.30<br />\nThe Musical Clubs gave their<br />\ngives a tone to those addresses not<br />\nYoung<br />\nMen's<br />\nBible<br />\nClass, 9.30<br />\nfirst concert of the present season<br />\naltogether desirable.<br />\nWhy can't the doors be closed at Evergreen on Tuesday evening. Morning Service, 11 o'clock<br />\nThe Sacred Ministry<br />\nwhen the speaker begins and. no Selections by the Glee Club includone admitted after, say, a few min- ed the \"University Ode,\" \"Come, Evening Service, 8 o'clock<br />\nCriterion of Faith<br />\nutes of grace? If there are some Seniors Wise and Learned,\" \"The<br />\nand individuality is offered here at prices that are not<br />\nwho must leave before the address Crossbow,\" from \"Robin Hood\"; Special Invitation to Hopkins Students.<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis over, why can't they sit near the the operetta by DeKoven ; and<br />\nFRESH-SOPH GAME<br />\ndoors so that they may withdraw \"Gypsy Love Song.\" The quaris back of each sale with a guarantee.<br />\nContinued from page 1<br />\nwith as little noise and as little in tette sang the \"Cornfield Melody,\"<br />\na collection of old songs arranged annual rush and it is said that many<br />\nevidence as possible?<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nG. COCHRAN DOUR. by Ed Spieker, '16, whose rendi- novel ways of obtaining and re343 NORTH CHARLES STREET<br />\ntion, aided and abetted by Doug. taining the coveted banner have<br />\nCoulter, last year, of \"Johnny been devised. As usual the rush<br />\nNovember 7, 1921. Smoker,\" will be remembered by will be divided into two ten-minute<br />\nEditors of the News-Letter,<br />\nall who were present at the con- periods, the first to take place between the halves of the game and<br />\ncert.<br />\nDear Sir:<br />\nthe second after the game. In the<br />\nHats off to Captain Long, of the<br />\nsecond half the flag will be susMilitary Department of the Unipended from a pole about nine feet<br />\nDIAMONDS<br />\nversity for the interest he is creJEWELRY<br />\nSILVERWARE<br />\nFRESH-SOPH DEBATE DATE<br />\nabove<br />\nating<br />\nin<br />\nthe ground and it will be the<br />\nth,e<br />\nPhysical<br />\nTraining<br />\nLA TAUSCA PEARLS<br />\nCHANGED<br />\ntask of the Sophs to gain possesClass. Surely, everyone around<br />\nSOLD ON VERY CLOSE MARGIN OWING TO OUR LOW EXPENSES<br />\nThe date of the annual Fresh- sion of it.<br />\nthe campus is tired of hearing the<br />\nThe cheering sections of both<br />\ngrumblings of the P. T. fellows. man-Sophomore debate has • been<br />\n12 CLAY STREET<br />\nWith the games that are Staged changed back again to Friday classes are being organized. At a<br />\n(3 Doors from Charles Street)<br />\nwith the medicine balls, the evening, December 16. This was Sophomore Class meeting last<br />\nplanned cross-country race, and the original date set for the con- Tuesday, \"Tom\" Jenifer was apSee Our Latest Designs in Bureau Silver<br />\nthe boxing instructions, no one test, but it was found that the fam- pointed cheer leader and instructed<br />\ncan find fault with Physical Train- ilies of several of the debaters to appoint an assistant. The Freshing. Moreover, the work is varied could not attend then, so that it ies also expect to have a cheering<br />\nso that no one grows tired of one was shifted to Saturday, the 16th. section. Several novel stunts were<br />\nthing, such as a routine of set Then it was found that the Jazz suggested.<br />\nLEDGERS drills.<br />\nENVELOPES<br />\nBONDS<br />\nBand was giving a concert that<br />\nAll of the local prep schools have<br />\nIt is interesting to note also the evening, which made it necessary been invited to attend and plans for<br />\nrespect and• feeling of good-fel- to revert to the original date. The the dance to be held in the C. E.<br />\nlowship which the student body speaking will begin promptly at 8 Hall after the rush are progressing<br />\nmanifests toward all members of o'clock and will be followed by a favorably. The afternoon will<br />\nthe Military Department and the dance afterwards. No one will be mark several innovations in interinterest that the Military Depart- admitted to the dance who does not class events and will probably be<br />\nment, on the other hand, displays first attend the debate. The music long remembered by the Univer205 W.CAMDEN STREET<br />\nin the students.<br />\nT. M. will be furnished by the Jazz Band. sity.<br />\n<br />\nHOCESCHILD.KOHN<br />\n<br />\nCO.<br />\n<br />\nST. DAVID'S..<br />\n<br />\nA<br />\n<br />\ntesta<br />\n<br />\nLefranc & Ault<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nJENKINS<br />\n<br />\nJ 'NUNS<br />\n<br />\nThe W. H Moore, Jr. Paper Co.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET TER, DECEMBER 9. 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n•<br />\n<br />\n(THE BOOK MART)<br />\n<br />\nSENIORS TO DANCE AWAY<br />\nEXAMINATION BLUES<br />\nAnnual Prom to Follow Mid-Years.<br />\n<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nThe Senior Prom will be a midyear function this year. At a class<br />\nmeeting held in the C. E. Hall,<br />\nImporters and Dealers in Fine Books Wednesday, the Senior class voted<br />\n301 N. CHARLES ST.<br />\nto make the annual affair the big<br />\nBaltimore, Md.<br />\nevent of the mid-winter season instead of one of the many occurrences of an overcrowded commencement week.<br />\n\"Bill\" Totterdale has been appointed chairman of the committee in charge and he promises to<br />\nput it across in big league style.<br />\nClb<br />\nterie)<br />\nOther members of the committee<br />\nm e%at<br />\nG<br />\nMarkel', Hall, Lilien and OwOSCAR<br />\nare<br />\nH.&<br />\n--s<br />\nOWN ERS<br />\nings..<br />\negg TI1P°‘<br />\n•<br />\nThe report of the committee apj'Itibe<br />\n29 Baltimore St., East<br />\npointed to secure a more attractive<br />\nOne Door West of Light St.<br />\ndiploma was against any change in<br />\nSOLE AGENTS FOR BALTIMORE<br />\nthe certificate now granted. The<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nclass voted to drop the matter.<br />\nSeniors were urged to pay their<br />\nThe Chas. Willms Surgical<br />\ndues and get their portraits taken<br />\nInstrument Co.<br />\nMd.<br />\nBaltimore,<br />\npromptly for the Hullabaloo.<br />\nso N. HOWARD ST.,<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\n13441140 I<br />\n<br />\nTHE OLD BACK DOOR<br />\n(From the Poetic Member)<br />\n<br />\nTo be sung to the tune of \"Thc<br />\nVolstead Act.\"<br />\n<br />\nWILLIAMS MEMORIAL LECTURES<br />\n<br />\nMrs. George Huntington Williams, of Baltimore, has given to<br />\nthe University a fund to be kriown<br />\nas the \"George Huntington Williams Memorial Fund,\" to perpetuate the Memory of Dr. Williams,<br />\n:ate Professor of Geology in this<br />\nUniversity. The lectures given on<br />\nthis foundation were at first devoted to the science of geology. It<br />\nis provided now, however, that onehalf of the income of the fund is<br />\nto be used in securing lecturers of<br />\ndistinguished attainments on topics<br />\nof widespread contemporary interest. This fall a course of public<br />\nlectures is being given by foreign<br />\npublicists attending the Arms Conference, on \"Problems of International Adjustment.\" The first of<br />\nthis series was held on Monday,<br />\nNovember 28, at which Philippe<br />\nMillet, editor of Le Petit Parisien,<br />\noutlined the problems confronting<br />\nFrance and offered possible solutions.<br />\nThe schedule for the remaining<br />\nlectures is as follows:<br />\nJapan: Baron Naibu Kanda,<br />\nmember of the Japanese House of<br />\nPeers, Monday, December 12.<br />\nChina: Admiral Tsai Ting-Kan,<br />\nThursday,.December 15.<br />\nGreat Britain: Alfred E. Zimmern, professor of international<br />\npolitics at the University College<br />\nof Wales, Monday, December 19.<br />\n<br />\nThe most striking institution<br />\nIn our college constitution,<br />\nWhich permits no substitution,<br />\nIs the Old Back Door.<br />\nDoc Horn (in chemistry)—<br />\nStaff and students all must use it, Boettner, what does A stand for?<br />\nEven though they would not choose<br />\nBoettner—Just a minute, I've<br />\nit;<br />\ngot it on the end of my tongue.<br />\nHowsoe'er they may abuse it:<br />\nDoc Horn—Well, spit it out;<br />\nUse the Old Back Door.<br />\nit's Arsenic.—Lampoon.<br />\nPlainly, 'twas the cold intention<br />\nOf the architect's invention,<br />\nTo uphold the stern convention<br />\nOf the Old Back Door.<br />\nFor, the power house, he put it,<br />\nRight where through the gate we<br />\nfoot it,<br />\nSo that no one can refute it:<br />\n'Tis the Old Back Door.<br />\nGilman Hall is most imposing,<br />\nGeorgian plan and style exposing;<br />\nPeaceful all its doors reposing,<br />\nBut the Old Back Door.<br />\nWe admire its front door placement,<br />\nFlanked by pillar and by casement;<br />\nBut we enter through the basement,<br />\nThrough. the Old Back Door.<br />\n<br />\n0. D. K. INITIATES EIGHT<br />\nNEW MEN<br />\nContinued from page 1<br />\n<br />\nbating Council, chairman Varsity<br />\nDebating team; vice-president of<br />\nthe Literary Club and secretary<br />\nof the Oratorical Society.<br />\nEdward G. Huey is business<br />\nmanager of the Hullabaloo, manager of baseball, associate editor<br />\nof the News-Letter. He has also<br />\nheld the following positions:<br />\nClass business manager Hullabaloo and class editor of the Hullabaloo.<br />\n<br />\nHis selection was based upon<br />\nhis high scholastic standing.<br />\n<br />\nTEN YEARS AGO AT HOPKINS<br />\nDECEMBER 11, 1911<br />\n<br />\nThese two men have shown superiority in leadership and in ath- Hopkins basketball team defeats<br />\nFriends School, 18-17.<br />\nletic ability.<br />\nOliver Collins was president of<br />\nhis class last year and vice-president the year before. He is a<br />\nmember of the Student Council,<br />\nassistant manager of lacrosse and<br />\n<br />\nAt meeting of A. A. Board the<br />\nmanager of the 1911 football team<br />\nannounces that ,the team cleared<br />\n$650 which established a new record for a Hopkins team.<br />\n<br />\nMHOUSANDS of smokers have proved it and now give the verdict<br />\nto you<br />\nall the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\nNone has the delicious<br />\nFLAVOR ofthe finestTurkish—<br />\nNone gives the ENJOYMENT ofthe finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br />\n<br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br />\n<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nWYMAN<br />\n<br />\nE. H. Slater is major of the R.<br />\nO. T. C., a member of Tau Beta<br />\nPi Honorary Fraternity, president<br />\n'of the A. S. C. E. and a member of<br />\nScabbard and Blade.<br />\n<br />\nThese men have gained honors<br />\nFive Hopkins men are selected<br />\nthrough their proficiency in nonon<br />\nall-Maryland eleven. Rhode,<br />\nathletic activities.<br />\nleft guard; Silbensbemer, center;<br />\nWilliam Totterdale, captain of<br />\nMorton, right end; Gillet and<br />\nour 1921 football team, twice the<br />\nBridgman. halfbacks are given<br />\nchoice for \"all-Maryland\" center,<br />\nhighest honor in Maryland colis vice-president of the class and<br />\nlegiate football..<br />\npresident of Sigma Chi Beta HonThe Homewood Committee,<br />\norary Fraternity.<br />\nwhich is to have charge of the<br />\nSamuel Middleton is president<br />\nbuilding<br />\noperations of Hopkins'<br />\nof the junior Class, was vicenew site at Homewood is selected<br />\npresident last year, is secretary of<br />\nand consists of 13 men chosen<br />\nthe A. A. Board and has won his<br />\nfrom the trustees, faculty and<br />\nmajor \"H\" in football.<br />\n<br />\nCollege Literature<br />\nIf you drive up in your auto,<br />\nYou will park it where you gotto,<br />\nAnd then enter from the grotto,<br />\nSHOES<br />\nThrough the Old Back Door.<br />\nIf you walk the distance weary,<br />\nfor<br />\nStill you'll use the same door<br />\nUNIVERSITY MEN<br />\ndreary;<br />\nFor Sport Wear True, 'tis in the front, but, dearie,<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nIt's the Old Back Door.<br />\nModerate Prices<br />\nStately Halls of Engineering<br />\nTurn away their front doors,<br />\nsneering;<br />\n19 W. LEXINGTON ST.<br />\nAnd we enter, bold or fearing.<br />\nThrough the Old Back Door.<br />\nFOOTBALL \"H\" AWARDED<br />\nOn the fronts their names are bitTO THIRTEEN MEN<br />\nten,<br />\nContinued from page 1<br />\nour eyes are never smitten<br />\nBut<br />\ndeemed a great pity to let the<br />\nBy the names: For they're 11(4<br />\nsplendid spirit which has animated<br />\nwritten<br />\nthe entire University this fall and<br />\nthe Old Back Door.<br />\nO'er<br />\nwhich has contributed so notably<br />\nto a successful football season, die<br />\nWhen new buildings are erected,<br />\nout or become dormant duriner the<br />\nAs our program has projected.<br />\nwinter months. The lacrosse, track<br />\nWill their entrants be subjected<br />\nand baseball teams have all arTo the Old Back Door?<br />\nranged for attractive schedules<br />\nYes! NN'e know that through the<br />\nand the A. A. Board points out<br />\nages<br />\nthe fact that the backing of the<br />\nseek Johns Hopkins<br />\nshall<br />\nMen<br />\nwhole student body will be resages<br />\nquired to support their efforts to<br />\nWith their microscopes and pages,<br />\ncarry the Hopkins colors to vicThrough the Old Back Door!<br />\ntory over the hardest kind of opI. N. COGNITO.<br />\nposition.<br />\n<br />\nadvertising manager of the Black<br />\nand Blue Jay.<br />\nHis leadership has made him<br />\neligible for election to the society.<br />\n<br />\nMURAD—<br />\n<br />\nS. ANAIRGYR0S.<br />\n<br />\nTry<br />\n<br />\nMURAD<br />\n<br />\ntoday and<br />\n\"Judge for<br />\nYourself—f\"<br />\n<br />\nTSZPIT-t-inglitaXnarrairaZgailila<br />\n.25:MlitiriveZ-02142:101-16=4:411:..W.z.u.:4-sis.,==uxsu<br />\n•<br />\n<br />\n20c<br />\n<br />\nund&NA.Gurt, 1:4.1<br />\n<br />\n__<br />\n<br />\n_<br />\n<br />\n\f", "format": "basic_html", "processed": "INTER-CLASS RUSH AND<br />\nFOOTBALL GAME TOMORROW<br />\nClass of '24 and '25 to mix it up and have it out. Traditional conflict promises to hold unusual interest.<br />\nLINEUP FOR TOMORROW'S GAME<br />\nSOPHOMORES<br />\nMeyer or Ross<br />\nRaleigh<br />\nSmallwood<br />\nShriver, G. M<br />\nHomer<br />\nHutzler<br />\nDunning<br />\nMarchetti<br />\nMcDaniel dr Ashton<br />\nDorsey or Limbach<br />\nShriver or Ellicott<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., DECEMBER 9, 1921<br /><br />\nVOL. XXVI. No. 18<br /><br />\nL E<br />\nL T<br />\nL G<br />\nC<br />\nR G<br />\nR T<br />\nR E<br />\nQ.B<br />\nR H B<br />\nL H B<br />\nF B<br /><br />\nFRESHMEN AND SOPHS TO<br />\n• CLASH TOMORROW<br /><br />\nFRESHMEN<br />\nSteck<br />\nBergin or Spurrier<br />\nFargo<br />\nSummers<br />\nBates<br />\n.<br />\nYoung<br />\n••<br />\n. Gump<br />\nBalsam<br />\nJones<br />\nMerlees<br />\nFarbman<br /><br />\nTWO PLANS FOR NEW STADIUM CONSIDERED<br /><br />\nMany More Features Introduced in In- $200,000 Necessary for Erection. Hopkins to Undertake Proposition<br />\nterclass Contest. Dance to Follow<br />\nAlone.<br />\nRush:<br />\nGame and<br /><br />\nTwo plans for financing the stadium which is planned to circle<br />\nHomewood field were proposed at<br />\nMonday's meeting of representatives of the University club and<br />\nthe Homewood Company. The<br />\nfirst provided for the sale of 20,000<br />\ntwo year season tickets for the<br />\nathletic contests to be held at<br />\nHomewood, to the public at $15<br />\nIt was decided by a joint com- apiece. This would net $300,000,<br />\nmittee of the classes to allow none 50 per cent. more than the reof the Varsity men who have par- quired $200,000 necessary for the<br />\nticipated in games this year to take erection of a stadium. The balance<br />\nPart in the inter-class contest, with would be used to sustain athletics<br />\na view to discovering new mateand finance the whole proposition<br />\nrial for next year's squad. This until the two years covered by the<br />\nwill bar a• number of good men tickets would be past. The other<br />\nfrom both teams; Coady, Bonner, plan, which was the one finally<br />\nBarton, Brumble and Harwood, of adopted, provided for the sale of<br />\nthe Sophomores, and Westerman, stock to the amount needed to give<br />\nMcGill, Spinney, Willis, Darley, interest at 6 per cent.<br />\nCouncill, Turnbull and Osborne. of<br />\nA possibility of enlisting the aid<br />\nthe Freshmen, being forced to view of the city in the Homewood prothe game from the sidelines. This ject instead of a separate stadium<br />\nwill not cause the contest to de- at Mount Royal or elsewhere was<br />\nvelop into a poor exhibition of also thought to exist until Dr. C.<br />\nfootball, as there are other good W. Bridgman stated that the<br />\nmen worthy of upholding the hon- Homewood undertaking would be<br />\nor of their respective classes.<br />\ncarried out by Hopkins alone. Dr.<br />\nThe Freshmen will begin the 'Bridgman, Blanchard Randall,<br />\ngame with the same lineup they Dr. Van Orman and Dr. Thomas<br />\nhave had throughout the year, with Brown represented the Varsity<br />\nthe addition of Young, of the Var- Club, while W. Stuart Symingsity squad, at tackle. The Soph- ton and other members of the exomore team is composed mostly of ecutive committee were the repmembers of last year's Fresh team, resentatives of the Homewood<br />\nand the majority of these men have Company.<br />\nA concrete stadium with a cahad furthd experience on the Varof 30,000 persons will be<br />\npacity<br />\nsity squad this year. It would be<br />\nand such games as that<br />\nerected<br />\ndifficult to attempt a comparison<br />\nand possibly the<br />\nVirginia<br />\nwith<br />\nbetween the two teams. The firstevery other<br />\ngame<br />\nArmy-Navy<br />\nYear 'men showed to a disadvanwith ample<br />\nprovided<br />\nyear<br />\nwill be<br />\ntage in their only game of the seacrowds<br />\nthe<br />\nson when they were defeated by facilities for handling<br />\natundoubtedly<br />\nSevern School to the tune of 27-0. which they will<br />\nSince then, however, steady prac- tract.<br />\ntices have contributed much toJUNIORS ELECT HONORARY<br />\nPRESIDENT<br />\nwards polishing off the rough spots<br />\nAt a meeting of the Junior Class<br />\nand marked improvement has been<br />\nShown.<br />\nlast Tuesday, Dr. Swartz was elected honorary president to succeed<br />\nThe' Sophomore team is, as yet,<br />\nDr. Hulbert, who left the Univeran unknown quantity. It's line will<br />\nsity last year to take the position<br />\nProbably outweigh the Freshmen of professor of physics at the Unidefense ten pounds to the man, versity of Iowa. The choice of Dr.<br />\nand the team, on the whole, seems<br />\nSwartz was a very popular one,<br />\nto be more 'experienced. Lack of<br />\nsince he has hosts of friends<br />\nteamwork and inability to play tothroughout the class and the Uni;ether, however, may upset the versity.<br />\n'l°Pe and cause the Freshies to<br />\nAt the same meeting the possisPring a surprise upon the confident<br />\nbility of giving a Junior Prom was<br />\noPhs.<br />\nPresident Middleton<br />\ndiscussed.<br />\ncommittee to invesa<br />\nappoint<br />\nwill<br />\nmeetBoth classes, at recent class<br />\nand report later<br />\nmatter<br />\nthe<br />\ntigate<br />\nings, have discussed plans for the<br />\nclass.<br />\nthe<br />\nto<br />\nContinued on page 3, col. 5<br />\nChafing at the leash, the Sophomore and Freshmen- football<br />\nteams are eagerly awaiting the referee's whistle for tomorrow's game<br />\nat Homewood Field. The rivalry<br />\nbetween the two classes is intense<br />\nand this has done much towards<br />\n•Preading interest among upperclassmen and outsiders.<br /><br />\nDORMITORY COMMITTEE<br />\nTAKES CARD CENSUS<br /><br />\nFOOTBALL \"H\" AWARDED<br />\nTO THIRIEEN MEN<br /><br />\n0. D. K.INITIATES EIGHT<br />\nNEW MEN<br /><br />\nEfforts Made to Determine Number of Brawner Re-elected Manager of Football Selection Based on Character and UnBasketball Dropped from 1921-22<br />\nFuture Occupants.<br />\ndisputed Leadership.<br />\nAthletic Schedule.<br /><br />\nIn order to complete the estimate of the amount of money<br />\nwhich would be received for lodging in the proposed Alumni Memorial Dormitory, a card has been<br />\nsent to each student of the University, requesting him to state<br />\nthe price of the room he would<br />\nwish to occupy. 'With the return<br />\nof these cards W. Graham Boyce,<br />\ntreasurer of the University, will<br />\nbe able to determine to what extent the proposed dormitory will<br />\nbenefit the students. Also he will<br />\nhave some idea as to what would<br />\nbe a fair price for the rooms, it being natural to suppose that most<br />\nof the students answering his card<br />\nwill name a room at something<br />\nnear the price they are now paying.<br />\nBefore the work can be started<br />\nit has been found necessary to estimate as near as possible the<br />\namount which would be available<br />\neach year to help pay off the original cost of the building. With the<br />\nfund furnished by the Alumni Association and the amount returned<br />\non the cards it will be easy to form<br />\na plan of payment for the buildFor several years the feeling has<br />\nbeen expressed at Hopkins that<br />\nlack of school spirit was caused by<br />\nNot that<br />\nlack of dormitories.<br />\nschool spirit has been lacking to<br />\nany great extent however, but it is<br />\nthought by everyone interested in<br />\nthe welfare of the University that<br />\nthe building of sufficient \"dorms\"<br />\nto house all the students would<br />\ngreatly increase the feeling that<br />\ncollege life means more than the<br />\nmere attaining of a degree.<br />\nSo far very few traditions have<br />\nbeen handed down to the lower<br />\nclassmen. Traditions of rooms occupied by famous athletes and<br />\nbrilliant students are entirely unknown due to the fact that, although many of the students have<br />\nattained a wide reputation for divers university activities, none of<br />\nthem ever actually lived on or<br />\nwere a part of the campus.<br />\nThe Alumni Memorial will be<br />\nthe first dormitory completed and<br />\nmay be ready for occupancy at the<br />\nbeginning of the next scholastic<br />\nyear. The cost will be approximately half a million dollars and<br />\nto aid the treasurer in his report<br />\nto the trustees of the amount he<br />\nwill be able to devote to this causd<br />\neach year, all the students will<br />\nhave to do is to sign the card and<br />\nreturn it immediately. It is hoped<br />\nthat as many students as possible<br />\nwill attend to this so that the<br />\nwork on the new \"dorm\" may be<br />\nstarted at once.<br /><br />\nNOTICE!<br />\nThere will be a meeting of<br />\nthe Student Council Monday<br />\nevening at eight o'clock, at<br />\nthe Beta Theta Pi House.<br /><br />\nTrack Organization meeting Monday at 4.15 in C. E.<br />\nHall.<br /><br />\nEight men were taken into the<br />\nAt the last meeting of the Ath- Omicron Delta Kappa National<br />\nletic Association Board held Wed- Honorary Fraternity at the public<br />\nnesday night the final award of initiation held at yesterday's stuletters was made to men on the dent assembly. The men to receive<br />\nfootball squad during the past sea- this honor were Gilson C. Engel,<br />\nson. The Varsity \"H\" will be Richard M. Wood, R. Dorsey<br />\ngiven to Totterdale, Landy, Watkins, Edward 0. Huey, WilKnecht, Middleton and Calkins, liam G. Totterdale, E. H. Salter,<br />\nall of whom have been previous- Samuel A. Middleton and Oliver<br />\nly honored with the coveted ath- D. Collins.<br />\nletic emblem. Sweaters are to be .The principal factor in the segiven to those who have won lection of men for membership in<br />\ntheir letters for the first time, and the Omicron Delta Kappa society<br />\nthis list includes Markell, Darley, is character, but undisputed leadBonner, Westerman, Magill and ership in at least one of the folRich. H. Pierce Browner, as man- lowing branches of campus activiager, will also receive a sweater, ties is required: Scholarship, athand Willis, Spinney, Coady and letics, social leadership, including<br />\nBarton will get\"H. A. A.\".<br />\nconspicuous service to the instiTo Carl Wilson, of the Medical tution ; literary ability, societies<br />\nSchool, who played such a bril- and publications.<br />\niant game whenever he was called<br />\nElection to the society is, thereupon to take over the generalship fore, recognition of the leadership,<br />\nof the team, will be awarded Var- proficiency and activity of the<br />\nsity \"H\" on special merit. Too candidates in one or more activimuch cannot be said in praise of ties and endorsement of his charthe spirit Wilson has shown dur- acter and personality.<br />\ning the past season when he conWhile membership in 0. D. K.<br />\nscientiously attended practices in is probably the highest honor<br />\nspite of the fact that Coach Van which can be obtained by a stuOrman did not often find it nec- dent, the society is, by picking out<br />\nessary to call upon him for his the leaders in the various activiservices, and example of his work ties on the campus and bringing<br />\nshould be an inspiration not only them together in a small group, to<br />\nto Medical School students but to provide greater co-operation and<br />\nHopkins undergraduates as well. more complete understanding beAnother man to get an \"H\" on tween the activities.<br />\ngrounds of special merit is Jake<br />\nIt is the exchange of.ideas, conMiller, who served as manager structive criticism and the presenduring part of the season -of 1920. tation of new schemes and plans<br />\nAll of the sweaters will be given for the betterment of conditions<br />\nout as soon as possible.<br />\nat the University that the society<br />\nIn view of the fact that Hop- primarily exists. Membership is<br />\nkins turned out a team which won not therefore the culmination of<br />\na clear title to the state football work in any one activity, but<br />\nchampionship, gold footballs will rather a door to new and greater<br />\nbe given those men who partici- field of endeavor. For this reason<br />\npated in the St. John's game and it is necessary that a well balanced<br />\na letter of thanks to Barney circle be secured and that no one<br />\nO'Rourke will be sent in apprecia- type of leader predominate.<br />\ntion of his great services in coachThe selection of the new men<br />\ning the line and in making it a fulfill this requirement excellentsuccessful cog in the mechanism ly. The eligibility of the men takof the whole machine. H. Pierce en in is unquestionable, and with<br />\nBrowner. '23, was re-elected as that addition to the ranks of the<br />\nmanager of the football team for elder members the circle possesses<br />\nthe season of 1922. The choice is unusual strength and versatility.<br />\nconsidered a logical one as the effiGilson Engel is president of the<br />\nciency of Manager Browner's Senior class, president of the Drawork on behalf of the team is rec- matic Club, president of the Interognized by everyone.<br />\nfraternity Board and head cheer<br />\nJ. C. Thompson reported that leader. He has shown his abilit-the Homewood Varsity Club Fi- as a leader throughout the year, in<br />\nnance Committee was of the opin- instilling a fine spirit of support<br />\nion that it would be impracticable and co-operation in the student<br />\nto put a basketball team on the body for alroccasions 'upon which<br />\nfloor this season. Dr. Evelith P. he has been called to take a leadBridgman recommended that both ing hand.<br />\nRichard Wood is president of<br />\nbasketball and tennis be dropped<br />\ntemporarily from the activities of the Student Council, a position<br />\nthe University owing to lack of conceded by all to be the most<br />\nproper facilities for practice, etc. honored of the campus. He was<br />\nAs finally decided, there will be a last year vice-president of the Juswimming team and a tennis team nior class and has won his major<br />\nto represent Hopkins in the minor \"H\" in track. Last year he was<br />\nsports this year. A resolution was delegate to the Student Council<br />\nalso drawn up and sent in to the and a Junior editor on the NewsStudent Council for approval, re- Letter.<br />\nThese two men represent merequiring compulsory attendance on<br />\nthe part of Freshmen at all games ly the leadership of our college<br />\nof the spring athletic season. It is life.<br />\nR. Dorsey Watkins is editor-inthought in this way to solve the<br />\nproblem of adequate support for chief of the Hullabaloo, secretary<br />\nthe track, lacrosse and baseball of the class and president of the<br />\nteams, which support has never Debating Council. . In his first<br />\nbefore been forthcoming to a three years he held the following<br />\nmarked extent at Hopkins. It is offices: Secretary-treasurer DeContinued on page 4, col. 1<br /><br />\nContinued on page 4, col. 4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1921<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nA CHANCE TO MAKE MONEY IN<br />\nBLACK AND BLUE JAY AD<br /><br />\nFor the benefit of the poetically<br />\ninclined among Hopkins students<br />\n$2.50<br />\nSubscription<br />\nthe Black and Blue Jay's current<br />\nat<br />\nPostoffice<br />\nat<br />\nthe<br />\n1909,<br />\ncarries an advertisement<br />\nDecember<br />\n3,<br />\nissue<br />\nmatter<br />\nsecond-class<br />\nas<br />\nEntered<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nfrom the Durham-Duplex Razor<br />\nPublished semi-weekly from October to June by the students of Johns Company which the members of<br />\nHopkins University.<br />\nall classes would do well to conBusiness communications should be addressed to the BUSINESS MAN- sider. Far be it from our reporAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\n, torial mind to insinuate that the<br />\nshould be sent to the MANAGING EDITOR.<br />\n,<br />\nrave and reverend Senior as he<br />\nHomewood 100<br />\nTelephone<br />\ndigests his lunch at the Barn is in<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nneed of a shave, but it is certain<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nthat the lesser lights among us—<br />\nManaging Editor:<br />\nthe Freshmen and the SophoCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nmores—might ponder over it to<br />\nFALLON,<br />\n'23.<br />\nGLOVER<br />\nP.<br />\nEditors:<br />\nAssociate<br />\nEDWARD G. HUEY, '22.<br />\nadvantage.<br />\nAdvertising Manager:<br />\nELI FRANK, JR., '22.<br />\nThe ad is nothing less than an<br />\nDONALD K. VANNEMAN, '23.<br />\nJunior Editors:<br />\non the part of the company<br />\noffer<br />\nCHARLES C. MARBURY, '22.<br />\nAssistant Business Managers:<br />\nJ. BRENTNALL POWELL, '23.<br />\na prize of One Hundred<br />\nto<br />\ndonate<br />\nBERNARD C. HEARN, '23.<br />\nCRAIG E. TAYLOR, '24.<br />\ncash to the student<br />\nDollars<br />\nin<br />\nJOHN C. LEWIS;'23.<br />\nJ. HUDSON HUFFARD,'23<br />\nJOSEPH S. LEOPOLD, '24.<br />\nFITZGERALD DUNNING, 924.<br />\nwho has turned in the best limRIGNAL W. BALDWIN, JR., '23<br />\nerick mentioning the Durham-Duplex Razor by the end of the colMember of Southern Intercollegiate Newspaper Association:<br />\nlege year. In addition, prizes of<br />\nfifty, twenty-five, fifteen and ten<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ndollars are offered and to everyone who sends in a limerick a free<br />\nBALTIMORE, MD., DECEMBER 9, 1921<br />\nDurham-Duplex \"demonstrator\"<br />\nwill be given. The artistically inTHE 0. D. K. ELECTION<br />\nclined may illustrate a limerick<br />\nand the best of these illustrations<br />\nWe wish to take this opportunity to congratulate the new mem- will be rewarded with an additionbers of Omicron Delta Kappa upon their election into that society, al prize of twenty-five dollars.<br />\nA limerick, though redolent of<br />\nand at the same time to compliment the circle upon its selection.<br />\nSinn Fein and rnossbag whiskey,<br />\nMembership in 0. D. K. is the greatest honor which can be obhas nothing to do with Ireland.<br />\ntained by an undergraduate. Selection of its members is based upon The Durham-Duplex Company<br />\ncharacter and personality as well as upon marked proficiency in one thinks it is a form of poetry and<br />\nor more of the five phases of campus activity from which the candi- in justification of this stand, subdates are drawn. The round gold key-the symbol of membership—in- mits an example on one of the advertising pages of the Black and<br />\ndicates that the owner is an undisputed leader in the college from<br />\nBlue Jay. which he comes. It should be given, therefore, only to those who in<br />\nThe fact remains that five lines<br />\nthe opinion of their fellow students, are worthy of the honor and of verse, modeled on the specimen<br />\nwe believe that there can be no question concerning the eligibility given by the Durham-Duplex<br />\nof the eight men taken in yesterday, nor do we feel, can anyone com- Company, based on a suitable subject and not trifling with the digplain with justice of having been overlooked.<br />\nnity or foibles of University professors, will bring the incipient<br />\nauthor at least a good razor and<br />\nperhaps a cash prize. In the latTHE PROPOSED STADIUM<br />\nter case the fortunate youth is inIt is with its hearty endorsement that the News-Letter learns vited to come to the News-Letter<br />\nthat the original plan for a stadium at Homewood is to be carried out office to talk business.\"Who runs<br />\nin the near future and it is a source of gratification that instead of may read\". Let all the faithful dig<br />\nup the last issue of the Jay and try<br />\nbeing hindered in any way by the project, plans for our field have, if<br />\ntheir calloused palms at verseanything, been advanced by the city's action. The need of a bowl or making.<br />\nhorseshoe, as it really will be, has been long felt at Hopkins, and now<br />\nthat Baltimore realizes what an advertisement and real attraction<br />\nCHRISTIAN SERVICE CLUB<br />\nACTIVITIES<br />\nsuch a development would be, the financing should be made considFOUNDED 1897.<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nAN INTERESTING LETTER FROM<br />\nOUR FORMER Y. M. C. A.<br />\nSECRETARY<br /><br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, But Shoulder the Responsibility.<br /><br />\nThe Methodist Mission,<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of Ft letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nFoochow, China,<br /><br />\nOctober 15, 1921.<br />\nHopkins<br />\nJohns<br />\nUniversity.<br />\nDear Friends: At last we have<br />\narrived at our destination in a city<br />\nthat simply can't be described. The<br />\nrecent postal census of China, so I<br />\nam told, gave Foochow a population of 1,400,000 the largest city of<br />\nChina. Yet in such a city only two<br />\nTo the Editor of the Johns Hopkins<br />\nbuildings have running water, the<br />\nNews-Letter.<br />\nY. M. C. A. and a private residence.<br />\nOne of the most unfortunte oc- VVith the exception of one new<br />\ncurrences at the Army-Marine modern street, about 30 feet wide,<br />\ngame Saturday was the fact that practically every street in the whole<br />\nHopkins men were not admitted to city is about six feet wide, lined<br />\nHomewood field upon presentation right and left with shops of all conof their A. A. L. tickets. The foot- ceivable kinds. At night heavy<br />\nball authorities at the University boards are nailed up across the<br />\ncertainly should have seen to it front of the store and humans,<br />\nthat Hopkins men would be admit- dogs, cats, pigs,.chickens, all go to<br />\nted to the game; but, to the con- bed in what during the day and<br />\ntrary it seems that the authorities half the night was a first-class shop.<br />\ntook special care to keep out the You ask how does traffic pass?<br />\nHopkins men, unless, of course, Well, it doesn't as at home, foi<br />\nthey paid admission. Why should there are no horses and carriages<br />\nsuch conditions exist at the Uni- or autos here except four or five<br />\nversity? Even members of our Fords as jitney buses on the new<br />\nown football team were standing street, and fve or six horses to keep<br />\nat the rear entrance to the field and the Fords moving. All travel is<br />\nrefused admittance; that same done in either rickshaw or sedan<br />\nbunch of fellows that brought chair. Still worse, among the comHopkins the State football cham- mon people, who comprise about<br />\npionship. Only when Coach Van 95 per cent., the handkerchief is<br />\nOrman heard that these men were unknown; as also the semblance of<br />\noutside the gates and unable to get any toilet facilities; very few<br />\nin, did he (the coach) see to it that clothes are worn, practically none<br />\nthese men got in. The rest of the of the coolies, men or women, wear<br />\nHopkins students were on the out- any shoes or stockings. The disside looking in. Why should such ease seen everywhere almost makes<br />\na condition exist? Expressions one sick; you cannot help from seeheard on the outside of the fence ing children's faces and heads full<br />\nwill, no doubt, make themselves of running sores, which in turn<br />\nheard on the campus. And still furnish excellent feeding ground<br />\nthe athletic authorities wonder for flies and mosquitoes which carwhy teams are not properly sup- ry the contagion to the others. It<br />\nported. These minor details go a makes one wish that it was poslong way and the students who sible to find a gold mine somewere on the outside Saturday will where to help just a little bit to renot forget very soon.<br />\nlieve such suffering. Then, too,<br />\nrealizing that ony five out of every<br />\nPersonally, I want to say a few<br />\n100 men are able to read or write<br />\nwords. I am a member of the band.<br />\ntheir own name, and that the averI came out to Homewood Field<br />\nage for women is less than one in<br />\nevery Saturday, played my head off<br />\nevery 1,000, with the subsequent<br />\nand went home happy. The band<br />\npreying upon this ignorance and<br />\nsaved the athletic authorities sevsuperstition by the unscrupulous<br />\neral hundred dollars during the<br />\n(usually the native priests), we feel<br />\nerably easier.<br />\nThe members of the Christian football season. I will admit we that our life will amount to someService Club. formerly the Preach- were slightly reimbursed for play- thing worth while if we can even<br />\nThat Homewood is the logical place for a field is beyond quesers' Club, held a meeting on Mon- ing by having two' complimentary in a small way help to make contion. None of the sites, in the first place, that have been entertained day, December 5th. W. R. Barn- tickets given us. But just because<br />\nditions better in this land of 400,as possibilities by the city are extensive enough to include more than hart, a member of the club, spoke we were not playing at the Army000,000 people, comprising one- .<br />\none gridiron and certainly no track. With regard to transportation to.the club about the life of Martin Marine game Saturday we could fourth of the population of the<br />\nfacilities, too, these sites have been woefully lacking. The draining Luther. A general discussion, led not get in.<br />\nwhole world.<br />\nCromwell,<br />\nfollowed<br />\nthe<br />\nadby<br />\nC.<br />\nwatchdogs<br />\nof<br />\nthe<br />\nstumbling<br />\nblock,<br />\nand<br />\nWhen the spring sport season<br />\nSincerely,<br />\nof such a field has proved a<br />\ndress. It was announced that the rolls around we will hear the same<br />\nPEARCE HAYES.<br />\nthe treasury declare that financing by the city of such a project is<br />\nRev. Canon McComb would be the story; come out and play at the<br />\nutterly out of the question. So Homewood, which naturally solves<br />\nRiderwood, Md.<br />\nrincipal speaker at the next meet- games. Certainly, we'll play; as<br />\nall these problems except that of finance, is the one place for a field. ing to be held at the home of Mr.<br />\nNovember<br />\n14, 1921.<br />\nlong as there is a Hopkins team on<br />\nCan we sell that stock?<br />\nSylvester, 2309 Edgemont Avenue, the field we'll be only too glad to Editor Johns Hopkins NewsLetter, Baltimore, Md.<br />\non December 19.<br />\nbe of some slight assistance to the<br />\nSir:<br />\nof<br />\nDr.<br />\ninvitation<br />\nActing on the<br />\nUniversity, but I hope that the auThere is a condition prevalent<br />\nEaston, of Homewood Chapel, the thorities will remember that such<br />\nclub took charge of the service at occurrences as Saturday's, harms about the University that should<br />\nALUMNI, WILL YOU SUBSCRIBE?<br />\nthat chapel on last Sunday after- the University in the end. Re- be given some attention by the<br />\nAlthough the News-Letter has gone to considerable expense noon. Paul Stevens, president of member the students back the students and should be settled<br />\nand trouble in an attempt to interest Hopkins Alumni in the steady the club, spoke; Roberts sang and teams and they should not be kept once and for always.<br />\nAre Freshman regulations to be<br />\nConning read the Scripture. The out of, their own field.<br />\ngrowth of undergraduate life at the University, the number of subclub will also conduct the service<br />\nenforced and if so, what penalty<br />\nscriptions reaching the office has been very disappointing. Faithful- this Sunday at 4:15. All Hopkins<br />\nJ. A. NAVIASKY, 22.<br />\nshould there be for violating<br />\nthe<br />\npaper<br />\nha.)<br />\nopening<br />\nof<br />\nthis<br />\nsemester,<br />\nsince<br />\nthe<br />\nly, twice a week<br />\nthem?<br />\nmen are invited to attend.<br />\nbeen mailed to a chosen list of former J. H. U. graduates in the exSince paddling has been frowned<br />\nPREPARATIONS FOR THE NEXT ter right here at hand there should upon by the<br />\nAlma<br />\ntheir<br />\nDean, Sophomores<br />\npectation that they would have enough real interest in<br />\n\"JAY\" BEING MADE<br />\nbe any number of contributions<br />\nall<br />\nlost<br />\nhave<br />\ninterest in the upholdMater to want a subscription to the periodical which endeavors to<br />\nAt a meeting of the editorial handed in. The Jay can't run with- ing of Hopkins traditions and<br />\npublish all news of interest to Hopkins men.<br />\ncandidates for the Black and Blue out contributions. Come through with the exception of one instance<br />\nNaturally, the paper cannot be published without considerable Jay, held last week, plans were with some good hard work and of a well applied leather belt, no<br />\nexpense, and it is entirely through subscriptions and advertisements given out for the next number.<br />\nput the next number across big. enforcement has been observed<br />\nThis<br />\ncalled<br />\nthe<br />\nwill<br />\nbe<br />\nnumber<br />\npublication<br />\nare<br />\ndefrayed.<br />\nBills<br />\nare<br />\ntherefore being<br />\nthat the costs of<br />\nAll contributions must be in be- recently around the Barn.<br />\n\"Wise Guy\" number. It will be<br />\nSome Sophomores claim that ill<br />\nmailed out with this issue and it is earnestly hoped that the Alumni<br />\naimed at the cake eaters and the fore the Christmas holidays. The order to put across their views it<br />\nwill subscribe or at least mail in notice to discontinue their sub- grinds.<br />\nmagazine will be out just after the is sufficient to incite a<br />\nriot. This<br />\nscription.<br />\nWith this wealth of subject mat- holidays.<br />\nContinued on page 3, col. 2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1921<br />\nNEW COURSE OF FOREIGN<br />\nLECTURES<br /><br />\nThe University has arranged for<br />\na number of lectures to be given<br />\nby foreigners concerning politics,<br />\nLIBERTY ST. at SARATOGA<br />\nletters and science. This has been<br />\n(Opposite Hotel Rennert)<br />\ndone to present to the students and<br />\nothers,foreign thought and results<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\nof scientific research. Through an<br />\nDANCES arrangement between a group of<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\nseven American universities and<br />\na number of French universiTelephone St. Paul 6987<br />\nties, professors of engineering<br />\nand applied science will be exDo you know how best to provide changed by the two countries. Prof.<br />\nan income for your old age?<br />\nJacques Cavalier, rector of the UniConsult with<br />\nversity of Toulouse, will be the<br />\nW. W. WALKER<br />\nfirst to visit the school, under the<br />\n909 Calvert Bldg. St.Paul 2581 arrangement and will deliver lectures on metallurgical chemistry<br />\nuntil January 15.<br />\nLIBERTY<br />\nDr. Ernest Cohan, professor of<br />\nExpert Cleaners and Dyers<br />\nchemistry in the University of<br />\nSpecial Rates to Hopkins Men Utrecht, Holland, lectured on<br />\n''Scientific Work in Holland\" last<br />\nHoinewood 5205-W<br />\n211 E.25th St.<br />\nFriday at 4:30 P. M., in the Civil<br />\nEngineering Building.<br /><br />\nDATES SET FOR JUNIOR-SENIOR<br />\nDEBATE TRYOUTS<br /><br />\nWe are establishing a new standard in<br />\nYoung Men's Suits at $29.50<br /><br />\nThe tryouts for members of the<br />\nteams to take part in the JuniorStyles for every taste.<br />\nSenior Debate will be held on December 13 and 14. The Junior tryBaltimore's Best Store<br />\nouts will take place on the thirteenth, with the Senior tryouts on<br />\nthe following day, and Dr. John<br />\n8c,<br />\nC. French will pick the two teams.<br />\nIt is very necessary that any man<br />\nwho hopes to be a member of the<br />\nteam which will represent Hopkins<br />\nin the intercollegiate triangular deProtestant Episcopal Church<br />\nbates later in the year come out<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nfor the class teams. The performRoland Park<br />\nance of the members of the class<br />\nteams will be used by Dr. French<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nin picking the team to represent the<br />\nSUNDAY SERVICES<br />\nuniversity later in the year.<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\nThe subject for the Junior-Senior<br />\n8 P. M.—Choral Evening Prayer<br />\ndebate will be the same as the one<br />\nto be used in the intercollegiate debate: Resolved, That the United SOPHOMORES NOMINATE HULLABALOO REPRESENTATIVES<br />\nStates Government Should Own<br />\nAt a class meeting of the Sophand Control the Coal Resources of<br />\nthe Country. After the debate the omores held Tuesday, December<br />\nCOntinued from page 2<br />\nusual informal dance, which has 6, in the M. E. Building, nominamay be so, but it is a condition done much to make<br />\nLunches, Cigars<br />\ndebates more tions for the positions of class edithat should not exist. Has the Stu- popular, will be held.<br />\norial and business representatives<br />\nCigarettes<br />\ndent Council no influence on the<br />\non the Hullabaloo Board were<br />\nFreshman who refuses to obey the<br />\nCandy, Soda and<br />\nmade. According to the new conregulations they prescribe?<br />\nBAD MANNERS AT PUBLIC LEC- stitution of<br />\nthe class, all nominaPipes and Fountain Pens<br />\nTURES<br />\nThe regulations should not only<br />\ntions must be made at one meetT $8.00, made<br />\nbe kept up by the Sophomores, but To the Editor-in-Chief of<br />\nAt the Barn<br />\ning and they may then be voted<br />\nof grain leather,<br />\nby all upperclassmen who are inTHE NEWS-LETTER.<br />\non one week later, provided that<br />\nE. E. Adams terested<br />\nin<br />\ntan or black,<br />\nin seeing the incoming<br />\nDear Sir: Almost every week the nominations have in the<br />\nclass learn its paces.<br />\nwith square toe and<br />\nsome one of more or less note and meantime been published in the<br />\nHowever, should conditions ex- distinction lectures to the students News-Letter. The nominations,<br />\nheavy perforations,<br />\nist as they now are I, for one, am and the public at Johns Hopkins. which will be voted on at the<br />\nthis<br />\nis an oxford<br />\nnext<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations heartily in favor of withdrawing At these lectures or addresses it meeting of the class, are as folany college man<br />\nall restrictions on the Freshman seems to be becoming a habit with lows:<br />\nJAS. H. DOWNS<br />\ncan be proud of.<br />\nclass. If it's worth doing, it's a great many people to either arAssociate Editor — Randolph<br />\nENGRAVER PRINTER STATIONER<br />\nIn high shoe the<br />\nworth doing well, so let us see rive late or depart early. Whether Norwood, Joseph S. Leopold,<br />\nJ.<br />\n229 N. CHARLES ST.<br />\nsome action by all upperclassmen the speaker has begun or has not Edward Mount.<br />\nsame style is $8.50.<br />\neither to put up or shut up.<br />\nyet ended his speech seems to matBusiness Staff Representative—<br />\n•<br />\nNECKWEAR<br />\nR. C. H. ter not at all. ,At the last address William G. Dean, William HowSHIRTS<br />\n—that of one of the foremost jour- ard, Thomas Jenifer, James K.<br />\nEstablished 1873<br />\nnalists of Europe—there appeared Harwood.<br />\nA.H.Fetting Man'fg Jewelry Co. to be an almost continual disturb- Tentative secret plans for the<br />\n421 N. HOWARD ST.<br />\nCharles Street, 210 North<br />\nManufacturers<br />\nance<br />\nGLOVES<br />\nbecause<br />\n(<br />\nof<br />\npeople<br />\ngoing<br />\nin<br />\nor Frosh-Soph scrap were also<br />\nHOSIERY<br />\nGreek Letter Fraternity Jewelry<br />\ngoing out.<br />\nbrought up and discussed, but<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nNo doubt these people had per- lothing definite was decided upon.<br />\nSTRATTON SHIRT MAKER<br />\nfectly logical excuses, but the fact<br />\nThe Episcopal Church of<br />\n226 N. Liberty St.<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\nElkridge Farms Dairy<br />\nremains that it is awfully distractSt.<br />\nMichael and All Angels<br />\n$3.25 and $4.25<br />\nNegligee<br />\nSTRICTLY FRESH MILK<br />\ning for the speaker and everybody<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nST. PAUL and TWENTIETH STS.<br />\nTerms Cash, Less 10% 30 Days on<br />\nProdue d, Pasteurized and Bottled else. Aside from that, however, MUSICAL CLUBS SCORE HIT ON<br />\nShirts<br />\nin Howard County<br />\nROAD<br />\nWyatt<br />\nBrown, D.D., Litt.D., Rector<br />\nit is rude in the extreme, and it<br />\nAlso a Full Line of Men's<br />\nEllicott City 231-R<br />\nCLARK BROS.<br />\nHoly<br />\nFurnishings<br />\nCommunion<br />\nat 7.30<br />\nThe Musical Clubs gave their<br />\ngives a tone to those addresses not<br />\nYoung<br />\nMen's<br />\nBible<br />\nClass, 9.30<br />\nfirst concert of the present season<br />\naltogether desirable.<br />\nWhy can't the doors be closed at Evergreen on Tuesday evening. Morning Service, 11 o'clock<br />\nThe Sacred Ministry<br />\nwhen the speaker begins and. no Selections by the Glee Club includone admitted after, say, a few min- ed the \"University Ode,\" \"Come, Evening Service, 8 o'clock<br />\nCriterion of Faith<br />\nutes of grace? If there are some Seniors Wise and Learned,\" \"The<br />\nand individuality is offered here at prices that are not<br />\nwho must leave before the address Crossbow,\" from \"Robin Hood\"; Special Invitation to Hopkins Students.<br />\nand cannot be underquoted by any house at any time.<br />\nBesides the reputation of an old-established firm<br />\nis over, why can't they sit near the the operetta by DeKoven ; and<br />\nFRESH-SOPH GAME<br />\ndoors so that they may withdraw \"Gypsy Love Song.\" The quaris back of each sale with a guarantee.<br />\nContinued from page 1<br />\nwith as little noise and as little in tette sang the \"Cornfield Melody,\"<br />\na collection of old songs arranged annual rush and it is said that many<br />\nevidence as possible?<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nG. COCHRAN DOUR. by Ed Spieker, '16, whose rendi- novel ways of obtaining and re343 NORTH CHARLES STREET<br />\ntion, aided and abetted by Doug. taining the coveted banner have<br />\nCoulter, last year, of \"Johnny been devised. As usual the rush<br />\nNovember 7, 1921. Smoker,\" will be remembered by will be divided into two ten-minute<br />\nEditors of the News-Letter,<br />\nall who were present at the con- periods, the first to take place between the halves of the game and<br />\ncert.<br />\nDear Sir:<br />\nthe second after the game. In the<br />\nHats off to Captain Long, of the<br />\nsecond half the flag will be susMilitary Department of the Unipended from a pole about nine feet<br />\nDIAMONDS<br />\nversity for the interest he is creJEWELRY<br />\nSILVERWARE<br />\nFRESH-SOPH DEBATE DATE<br />\nabove<br />\nating<br />\nin<br />\nthe ground and it will be the<br />\nth,e<br />\nPhysical<br />\nTraining<br />\nLA TAUSCA PEARLS<br />\nCHANGED<br />\ntask of the Sophs to gain possesClass. Surely, everyone around<br />\nSOLD ON VERY CLOSE MARGIN OWING TO OUR LOW EXPENSES<br />\nThe date of the annual Fresh- sion of it.<br />\nthe campus is tired of hearing the<br />\nThe cheering sections of both<br />\ngrumblings of the P. T. fellows. man-Sophomore debate has • been<br />\n12 CLAY STREET<br />\nWith the games that are Staged changed back again to Friday classes are being organized. At a<br />\n(3 Doors from Charles Street)<br />\nwith the medicine balls, the evening, December 16. This was Sophomore Class meeting last<br />\nplanned cross-country race, and the original date set for the con- Tuesday, \"Tom\" Jenifer was apSee Our Latest Designs in Bureau Silver<br />\nthe boxing instructions, no one test, but it was found that the fam- pointed cheer leader and instructed<br />\ncan find fault with Physical Train- ilies of several of the debaters to appoint an assistant. The Freshing. Moreover, the work is varied could not attend then, so that it ies also expect to have a cheering<br />\nso that no one grows tired of one was shifted to Saturday, the 16th. section. Several novel stunts were<br />\nthing, such as a routine of set Then it was found that the Jazz suggested.<br />\nLEDGERS drills.<br />\nENVELOPES<br />\nBONDS<br />\nBand was giving a concert that<br />\nAll of the local prep schools have<br />\nIt is interesting to note also the evening, which made it necessary been invited to attend and plans for<br />\nrespect and• feeling of good-fel- to revert to the original date. The the dance to be held in the C. E.<br />\nlowship which the student body speaking will begin promptly at 8 Hall after the rush are progressing<br />\nmanifests toward all members of o'clock and will be followed by a favorably. The afternoon will<br />\nthe Military Department and the dance afterwards. No one will be mark several innovations in interinterest that the Military Depart- admitted to the dance who does not class events and will probably be<br />\nment, on the other hand, displays first attend the debate. The music long remembered by the Univer205 W.CAMDEN STREET<br />\nin the students.<br />\nT. M. will be furnished by the Jazz Band. sity.<br /><br />\nHOCESCHILD.KOHN<br /><br />\nCO.<br /><br />\nST. DAVID'S..<br /><br />\nA<br /><br />\ntesta<br /><br />\nLefranc &amp; Ault<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nJENKINS<br /><br />\nJ 'NUNS<br /><br />\nThe W. H Moore, Jr. Paper Co.<br /><br />\nTHE JOHNS HOPKINS NEWS-LET TER, DECEMBER 9. 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n•<br /><br />\n(THE BOOK MART)<br /><br />\nSENIORS TO DANCE AWAY<br />\nEXAMINATION BLUES<br />\nAnnual Prom to Follow Mid-Years.<br /><br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nThe Senior Prom will be a midyear function this year. At a class<br />\nmeeting held in the C. E. Hall,<br />\nImporters and Dealers in Fine Books Wednesday, the Senior class voted<br />\n301 N. CHARLES ST.<br />\nto make the annual affair the big<br />\nBaltimore, Md.<br />\nevent of the mid-winter season instead of one of the many occurrences of an overcrowded commencement week.<br />\n\"Bill\" Totterdale has been appointed chairman of the committee in charge and he promises to<br />\nput it across in big league style.<br />\nClb<br />\nterie)<br />\nOther members of the committee<br />\nm e%at<br />\nG<br />\nMarkel', Hall, Lilien and OwOSCAR<br />\nare<br />\nH.&amp;<br />\n--s<br />\nOWN ERS<br />\nings..<br />\negg TI1P°‘<br />\n•<br />\nThe report of the committee apj'Itibe<br />\n29 Baltimore St., East<br />\npointed to secure a more attractive<br />\nOne Door West of Light St.<br />\ndiploma was against any change in<br />\nSOLE AGENTS FOR BALTIMORE<br />\nthe certificate now granted. The<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nclass voted to drop the matter.<br />\nSeniors were urged to pay their<br />\nThe Chas. Willms Surgical<br />\ndues and get their portraits taken<br />\nInstrument Co.<br />\nMd.<br />\nBaltimore,<br />\npromptly for the Hullabaloo.<br />\nso N. HOWARD ST.,<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\n13441140 I<br /><br />\nTHE OLD BACK DOOR<br />\n(From the Poetic Member)<br /><br />\nTo be sung to the tune of \"Thc<br />\nVolstead Act.\"<br /><br />\nWILLIAMS MEMORIAL LECTURES<br /><br />\nMrs. George Huntington Williams, of Baltimore, has given to<br />\nthe University a fund to be kriown<br />\nas the \"George Huntington Williams Memorial Fund,\" to perpetuate the Memory of Dr. Williams,<br />\n:ate Professor of Geology in this<br />\nUniversity. The lectures given on<br />\nthis foundation were at first devoted to the science of geology. It<br />\nis provided now, however, that onehalf of the income of the fund is<br />\nto be used in securing lecturers of<br />\ndistinguished attainments on topics<br />\nof widespread contemporary interest. This fall a course of public<br />\nlectures is being given by foreign<br />\npublicists attending the Arms Conference, on \"Problems of International Adjustment.\" The first of<br />\nthis series was held on Monday,<br />\nNovember 28, at which Philippe<br />\nMillet, editor of Le Petit Parisien,<br />\noutlined the problems confronting<br />\nFrance and offered possible solutions.<br />\nThe schedule for the remaining<br />\nlectures is as follows:<br />\nJapan: Baron Naibu Kanda,<br />\nmember of the Japanese House of<br />\nPeers, Monday, December 12.<br />\nChina: Admiral Tsai Ting-Kan,<br />\nThursday,.December 15.<br />\nGreat Britain: Alfred E. Zimmern, professor of international<br />\npolitics at the University College<br />\nof Wales, Monday, December 19.<br /><br />\nThe most striking institution<br />\nIn our college constitution,<br />\nWhich permits no substitution,<br />\nIs the Old Back Door.<br />\nDoc Horn (in chemistry)—<br />\nStaff and students all must use it, Boettner, what does A stand for?<br />\nEven though they would not choose<br />\nBoettner—Just a minute, I've<br />\nit;<br />\ngot it on the end of my tongue.<br />\nHowsoe'er they may abuse it:<br />\nDoc Horn—Well, spit it out;<br />\nUse the Old Back Door.<br />\nit's Arsenic.—Lampoon.<br />\nPlainly, 'twas the cold intention<br />\nOf the architect's invention,<br />\nTo uphold the stern convention<br />\nOf the Old Back Door.<br />\nFor, the power house, he put it,<br />\nRight where through the gate we<br />\nfoot it,<br />\nSo that no one can refute it:<br />\n'Tis the Old Back Door.<br />\nGilman Hall is most imposing,<br />\nGeorgian plan and style exposing;<br />\nPeaceful all its doors reposing,<br />\nBut the Old Back Door.<br />\nWe admire its front door placement,<br />\nFlanked by pillar and by casement;<br />\nBut we enter through the basement,<br />\nThrough. the Old Back Door.<br /><br />\n0. D. K. INITIATES EIGHT<br />\nNEW MEN<br />\nContinued from page 1<br /><br />\nbating Council, chairman Varsity<br />\nDebating team; vice-president of<br />\nthe Literary Club and secretary<br />\nof the Oratorical Society.<br />\nEdward G. Huey is business<br />\nmanager of the Hullabaloo, manager of baseball, associate editor<br />\nof the News-Letter. He has also<br />\nheld the following positions:<br />\nClass business manager Hullabaloo and class editor of the Hullabaloo.<br /><br />\nHis selection was based upon<br />\nhis high scholastic standing.<br /><br />\nTEN YEARS AGO AT HOPKINS<br />\nDECEMBER 11, 1911<br /><br />\nThese two men have shown superiority in leadership and in ath- Hopkins basketball team defeats<br />\nFriends School, 18-17.<br />\nletic ability.<br />\nOliver Collins was president of<br />\nhis class last year and vice-president the year before. He is a<br />\nmember of the Student Council,<br />\nassistant manager of lacrosse and<br /><br />\nAt meeting of A. A. Board the<br />\nmanager of the 1911 football team<br />\nannounces that ,the team cleared<br />\n$650 which established a new record for a Hopkins team.<br /><br />\nMHOUSANDS of smokers have proved it and now give the verdict<br />\nto you<br />\nall the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\nNone has the delicious<br />\nFLAVOR ofthe finestTurkish—<br />\nNone gives the ENJOYMENT ofthe finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br /><br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n—you have but to smoke<br /><br />\nLOMBARD and SOUTH STREETS<br /><br />\nWYMAN<br /><br />\nE. H. Slater is major of the R.<br />\nO. T. C., a member of Tau Beta<br />\nPi Honorary Fraternity, president<br />\n'of the A. S. C. E. and a member of<br />\nScabbard and Blade.<br /><br />\nThese men have gained honors<br />\nFive Hopkins men are selected<br />\nthrough their proficiency in nonon<br />\nall-Maryland eleven. Rhode,<br />\nathletic activities.<br />\nleft guard; Silbensbemer, center;<br />\nWilliam Totterdale, captain of<br />\nMorton, right end; Gillet and<br />\nour 1921 football team, twice the<br />\nBridgman. halfbacks are given<br />\nchoice for \"all-Maryland\" center,<br />\nhighest honor in Maryland colis vice-president of the class and<br />\nlegiate football..<br />\npresident of Sigma Chi Beta HonThe Homewood Committee,<br />\norary Fraternity.<br />\nwhich is to have charge of the<br />\nSamuel Middleton is president<br />\nbuilding<br />\noperations of Hopkins'<br />\nof the junior Class, was vicenew site at Homewood is selected<br />\npresident last year, is secretary of<br />\nand consists of 13 men chosen<br />\nthe A. A. Board and has won his<br />\nfrom the trustees, faculty and<br />\nmajor \"H\" in football.<br /><br />\nCollege Literature<br />\nIf you drive up in your auto,<br />\nYou will park it where you gotto,<br />\nAnd then enter from the grotto,<br />\nSHOES<br />\nThrough the Old Back Door.<br />\nIf you walk the distance weary,<br />\nfor<br />\nStill you'll use the same door<br />\nUNIVERSITY MEN<br />\ndreary;<br />\nFor Sport Wear True, 'tis in the front, but, dearie,<br />\nFor Dress<br />\nSmart Styles—Best Leathers<br />\nIt's the Old Back Door.<br />\nModerate Prices<br />\nStately Halls of Engineering<br />\nTurn away their front doors,<br />\nsneering;<br />\n19 W. LEXINGTON ST.<br />\nAnd we enter, bold or fearing.<br />\nThrough the Old Back Door.<br />\nFOOTBALL \"H\" AWARDED<br />\nOn the fronts their names are bitTO THIRTEEN MEN<br />\nten,<br />\nContinued from page 1<br />\nour eyes are never smitten<br />\nBut<br />\ndeemed a great pity to let the<br />\nBy the names: For they're 11(4<br />\nsplendid spirit which has animated<br />\nwritten<br />\nthe entire University this fall and<br />\nthe Old Back Door.<br />\nO'er<br />\nwhich has contributed so notably<br />\nto a successful football season, die<br />\nWhen new buildings are erected,<br />\nout or become dormant duriner the<br />\nAs our program has projected.<br />\nwinter months. The lacrosse, track<br />\nWill their entrants be subjected<br />\nand baseball teams have all arTo the Old Back Door?<br />\nranged for attractive schedules<br />\nYes! NN'e know that through the<br />\nand the A. A. Board points out<br />\nages<br />\nthe fact that the backing of the<br />\nseek Johns Hopkins<br />\nshall<br />\nMen<br />\nwhole student body will be resages<br />\nquired to support their efforts to<br />\nWith their microscopes and pages,<br />\ncarry the Hopkins colors to vicThrough the Old Back Door!<br />\ntory over the hardest kind of opI. N. COGNITO.<br />\nposition.<br /><br />\nadvertising manager of the Black<br />\nand Blue Jay.<br />\nHis leadership has made him<br />\neligible for election to the society.<br /><br />\nMURAD—<br /><br />\nS. ANAIRGYR0S.<br /><br />\nTry<br /><br />\nMURAD<br /><br />\ntoday and<br />\n\"Judge for<br />\nYourself—f\"<br /><br />\nTSZPIT-t-inglitaXnarrairaZgailila<br />\n.25:MlitiriveZ-02142:101-16=4:411:..W.z.u.:4-sis.,==uxsu<br />\n•<br /><br />\n20c<br /><br />\nund&amp;NA.Gurt, 1:4.1<br /><br />\n__<br /><br />\n_<br /><br />"}], "field_media_file": [{"target_id": 37565, "display": null, "description": null, "target_type": "file", "target_uuid": "3696b671-fc1b-49bf-955f-e462437ff033", "url": "http://digital.library.jhu.edu/system/files/2022-03/12972-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12972, "target_type": "node", "target_uuid": "e6961633-b3d5-44af-b729-a1b9d11fd750", "url": "/node/12972"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e1d0a453-a7d9-46a8-9962-e0eb7c3cfa31"}]}