{"mid": [{"value": 37887}], "uuid": [{"value": "ee29cf3e-64b2-4ac3-a3be-7bdc00c25b3d"}], "vid": [{"value": 37887}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:42:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12455-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:42:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:42:23+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MEMBER OF THE<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION -1<br />\nOf Middle Atlantic States<br />\n<br />\n:Et<br />\nFRS Vol. xxxVIII—No.<br />\n<br />\n0<br />\n- .14r<br />\n<br />\nedr tms 1Sopkins Nratsrttrr<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, NOVEMBER 24, 1933<br />\n<br />\n16.<br />\n<br />\n)rsfsouLiNcs MADE<br />\n,mptvAs<br />\ndnes, S. AI L SEES<br />\nBuoGET DEFICIT<br />\n<br />\nDr. Herman Oliphant Is<br />\nAppointed To Treasury<br />\nPost<br />\n<br />\n!.r 2;<br />\nwoiti<br />\n<br />\nAPproval Of S. A. C. President Needed For All<br />\n3oar<br />\nContracts<br />\nStu'<br />\n•ooru krANy<br />\nACTIVITIES<br />\nHa<br />\n' SUBMIT PETITIONS<br />\nstaff<br />\n<br />\nHas Written Songs Of<br />\nCraft And Other<br />\nVolumes<br />\n<br />\n—Courtesy Sun papers<br />\nDR. HERMAN OLIPHANT<br />\n<br />\nFORMER HOPKINS<br />\nPROFESSOR HONORED<br />\n<br />\nAt Levering Hall<br />\n<br />\nEmphasizing the fact that sociological and economic interests play<br />\na much more important part in separating groups today than does rereligion, Dr. Ivan E. McDoygle,<br />\nhead of the Department of Social<br />\nSciences at Goucher College, addressed a discussion group in Levering Hall last Wednesday.<br />\nDr. McDoygle, talking on group<br />\nsolidarity, pointed out that many<br />\nconflicts have arisen in the last century or two because people are coming in closer contact with each other,<br />\nand the old geographical separations<br />\n(Continued on Page 4, Col. 5)<br />\n<br />\nCHARLIE DAVIS<br />\nTO BE FEATURED<br />\nAT COTILLION<br />\nMae Armstrong, Popular<br />\nDeb, To Lead Grand<br />\nMarch<br />\n<br />\nThe Second Performance Of The<br />\nRUBY WRIGHT WILL<br />\nAPPEAR AS SOLOIST<br />\n<br />\nProduction Depends On<br />\nSeat Demand<br />\n<br />\n\"Newspapermen are crazy\", said<br />\nHenry Edward Warner of the Baltimore Sun before the freshmansophomore assembly yesterday. \"If<br />\nthe aeroplane that took the photographers to the scene of the Settle<br />\nballoon landing had been declared<br />\nbroken, unfit for use, and a deathtrap, the men would have gone<br />\nahead anyway.\" Thus he characterized the genuine reporter in action.<br />\n<br />\nThe approval of the president of<br />\niletic the S. A. C. will be necessary for<br />\nall advertising contracts. Henceforth budgets for all activities must<br />\nma<br />\nuz presented to the president of the Dr. Herman Oliphant Is<br />\nman<br />\nS. A. C. before that activity apNamed Special Council<br />\nTo U. S. Treasury<br />\nrobe Pears.<br />\n)arc', Further rules stress the payment<br />\nAppointment of Dr. Herman<br />\nLsso- of all<br />\nbills must be by check, and Oliphant, formerly profeAor of<br />\n:45,<br />\nthat all cash must be placed in the law in the Johns Hopkins Institute<br />\nLa'<br />\nhands of the treasurer of the S. A. of Law and recently general counsel of the Farm Credit Adminis120, C. immediately upon receipt.<br />\ntration, as \"general counsel to the<br />\nrobe<br />\nNew Members Considered<br />\nSecretary of the Treasury\" has<br />\nRecently many activities have ap- 'been announced by Acting Secret-01)e Plied for membership to the Coun- tary Henry Morg-anthau, Jr., of<br />\ners, Q.,<br />\nsubmitted. the United States Treasury DentrY 4, petitions having been<br />\npartment.<br />\nu<br />\nand, utstanding is the Interfraternity<br />\nLong recognized as one of the<br />\nart'. 130ard. In accordance with the new<br />\nforemost legal authorities of<br />\n120 rules, unless there can be some defiAmerica, Dr. Oliphant was one of<br />\n20. nite gain made by both the Council<br />\nthe four organizers of the Hopand Board, so that both will be benkins Law Institute. He had held<br />\n'1 efited by the Board's entering the the professorship of law here<br />\nsince 1928.<br />\ns C°Iincil, the Board will not be adVaried Career<br />\nillitted. This pertains to all other<br />\nBefore joining the Hopkins<br />\n°111:is and groups who desire memfaculty, he was professor of law at<br />\nb<br />\nership.<br />\nColumbia University for seven<br />\nConcerning these rules, Ted years, having gone there from the<br />\nStern, president of the S. A. C., an- University of Chicago, where he<br />\nflounced, \"If we can terminate the held a similar post from 1915 unYear without any deficit and our til 1921.<br />\nFor a time, Dr. Oliphant has<br />\ndebts are paid, the compulsory fee<br />\nbeen visiting professor at Leland<br />\nWill be abolished and an optional<br />\nStanford University and univer'1311e will be in force next year.\"<br />\nsity lecturer at the University of<br />\nTexas, director of the Institute of<br />\nLaw in New York and associate<br />\nAnnual Dinner Will<br />\ndirector of research of the New<br />\nBe Held Wednesday York<br />\nCommission on the Admin°reign Students To Be Addressed istration of Justice.<br />\nA former president of the AssoBy Price And Tsiang At<br />\nciation of American Law Schools,<br />\nMid-Week Meeting<br />\nhe was one of the group which<br />\nand edited the Ameriorganized<br />\nThe Eleventh Annual Internacan Bar Association Journal. Duriti°flal Thanksgiving Dinner, given<br />\ning the World War he was assistthe Friendly Relations Commitant director of the War Trade<br />\ntee of the Johns Hopkins \"Y\", will Board and later was connected<br />\nbe held Wednesday evening, Oc- with the Emergency Fleet Cortc,ber<br />\n29 at 6:30 p. m., at Lever- poration.<br />\ning Rail.<br />\nThe gathering will, in the course Discussion Group<br />\nHears Dr. McDoygle<br />\nflf the evening, hear the greeting<br />\nfr°111 C. W. Price, president of the<br />\nC°stnopolitan Club, and I. M. Tsi41g, president of the Chinese Club.<br />\nbr. Paul M. Wheeler will make the<br />\nbadolress. Music will be furnished<br />\nY Mrs. Margaret Rabold and Miss<br />\nClara Ascherfeld.<br />\n1\\11iosts and hostesses—Rev. and Mrs. H.<br />\npe. Arrowsmith, Dr. and Mrs. Ernst<br />\nDr. and Mrs. E. B. Mathews, Mr.<br />\nMrs. W. R. McClayton, Mr. and<br />\nkorL<br />\ns. A. E. 0. Munsell, Mr. and Mrs.<br />\nrt Wagner, Rev. and Mrs. F. C.<br />\nl eYnOlds, Dr. and Mrs. E. A. Schaal,<br />\nancl' and Mrs. T. Guthrie Speers, Dr,<br />\nMrs. - 0. Spencer, Mr. and Mrs.<br />\nw MiltonJ.Wagner,<br />\nJr., Mr. and Mrs.<br />\nSo_ 8. Cassell, Mr. and Mrs. Wm. C<br />\nutneiser.<br />\n<br />\nPopular Orchestra Leader<br />\nTo Play At Cotillion<br />\nDance<br />\n<br />\nIS WELL-KNOWN<br />\nDUMMY TICKETS<br />\nCORRESPONDENT<br />\nALREADY ON SALE<br />\n<br />\nCompulsory Fee To Be Abol•<br />\n'shed If Deficit Is<br />\nRemoved<br />\n<br />\nIn accordance with a new set of<br />\nrobe t<br />\nrnergency regulations necessitated<br />\nDub.,<br />\n.<br />\n:rica uy the recent cut in appropriations,<br />\n:act° all contracts in which the activity<br />\nConcerned is in debt must be ap120. proved by the Student Activities<br />\n.hatt Council. Without the sanction<br />\n3:30, of<br />\nthese contracts by the Council,<br />\n120,<br />\nContracts will not be valid.<br />\nitarY<br />\n<br />\nPrice, 5 Cents<br />\n<br />\nSpeaks Under Auspices Of Characters Of Chicago Mayor<br />\nPi Delta Epsilon<br />\nAnd Gangster Shift<br />\nFraternity<br />\nTheir Roles<br />\n<br />\nthose<br />\n<br />\n,rro<br />\nLa'<br />\nloard<br />\n<br />\nASSEMBLY HEARS \"FRONT PAGE\" CAST<br />\nHENRY E. WARNER NOW COMPLETE AS<br />\nNOTED JOURNALIST ROLE IS CHANGED<br />\n<br />\nANNUAL THANKSGIVING<br />\nDINNER — FRIENDLY<br />\nRELATIONS COMMITTEE<br />\nLevering Hall, Nov. 29. 6:30.<br />\n<br />\nPrice On Tickets Bought<br />\nMaking complete the cast for the<br />\nAt Door Are Raised<br />\nBarnstormer production \"The Front<br />\nPage\", Gerald Branower was<br />\nAnnouncing that the prices on<br />\nchanged from his former role of<br />\ntickets will in all probability be inLooie, to that of the Mayor of Chicreased if they are secured at the<br />\ncago, while Jack Levine was chosen<br />\ndoor the night of the dance, members of the Cotillion Board advise<br />\nto take the part of Looie, it was anCHARLIE DANIS<br />\nthat<br />\ntickets should be purchased imnounced by Howard Caplan and<br />\nCourtesy, The Blue Jay<br />\nmediately. They can be secured<br />\nWilliam Banks, the coaches of the<br />\nfrom any member of the board or<br />\nJournalists Are Born<br />\nproduction. The other roles, which<br />\nin Levering Hall. Prices including<br />\nThe majority of college students include Squire, Criblet, and Watkins<br />\ntax are $2.75 per couple, and $2.20<br />\nstudying journalism will never see<br />\nas the leading masculine characters,<br />\nstag.<br />\nany newspaper service, Warner beand<br />\nForsythe<br />\nKatherine<br />\nMisses<br />\nand<br />\nNewest of the Columbia radio<br />\ngan. The true reporter has the<br />\nspirit in his blood, and no education Jeannette Sauters as the feminine Drs. Chinard And Hollander favorites, Charlie Davis will<br />\nat the higher institutions of learn- stars, will within all probability reTo Address Friends<br />\nbring his versatile dance band to<br />\ning will serve to ncrease his ardor. main as announced in Tuesday's isOf Library<br />\nBaltimore to play at the ThanksWarner ponted to his own life as sue of the NEWS-LETTER.<br />\ngiving Cotillion, the board anRecent additions to the Univeran illustration of this.<br />\nSale Of Dummy Tickets Begun<br />\nsity Library will be the subjects nounced.<br />\nIn his first year of college, he<br />\nThe drive for the sale of dummy of Drs. Gilbert Chinard,<br />\nRuby Wright Featured<br />\nwas expelled, he said, and during<br />\nprofessor<br />\nalready<br />\ntickets<br />\nbegun,<br />\nhas<br />\nand<br />\nthe<br />\nof French and comparative literaRuby Wright will be the featured<br />\nthe next two years of his life, be<br />\nput out his own little sheet, called tickets may be procured from any ture, and Jacob H. Hollander, soloist appearing with Charlie<br />\nthe University Sun—editing, man- member or candidate of the Hutzler professor of political Davis' Orchestra. This band has<br />\naging, reporting, and performing business staff of the Barnstormers. l'economy, when they speak at a played at the Hollywood Restauall functions. In this paper, he<br />\n'tea and exhibit of economic rant in New York, and comes to<br />\nThe drive has been started this<br />\ncrusaded against an illegal race track<br />\n'classics to be given here for the Baltimore directly from the Netherand an illegal road-house, and suc- early in the season with the hope Friends of the Library on Decem- land Plaza Hotel in Cincinnati.<br />\nceeded in both ventures. At that that, if sufficient returns are real- ber 7th.<br />\nKnown to variety and motion<br />\ntime, he claimed, he was eleven years ized some time before the date of<br />\nWhen the 172 members of the picture houses throughout the naold.<br />\nthe performance, it will be possible Friends of the Library assemble tion as the maestro with the milMr. Warner made several re- to present the show twice at the for this meeting, which will be lion dollar smile, Davis turned all<br />\nheld in Gilman Hall at 4:00 his vitality and experience into<br />\nmarks about the influence of the Maryland<br />\nCasualty, instead of once<br />\npress on public opinion. He ado'clock in the afternoon, Thurs- developing a dance band for one<br />\nas is the present plan.<br />\nvanced the idea that the newspapers<br />\nday, December 7th, Dr. Chinard of Broadway's most critical night<br />\nBest Seats For Dummy Tickets<br />\nhad little effect on the election of<br />\nwill speak on the rare \"Ephemer- clubs, the famed Hollywood ResThese<br />\ndummy tickets, which are ides\" of Du Pont de Nemours, taurant, where his music won<br />\nMr. Hoover in 1928 and of Mr.<br />\nRoosevelt in 1932. However, there priced at 25c and $1, will entitle while Professor Hollander will great favor with the smart New<br />\nis great power in the editorial col- the holder to the best tickets in the discuss the special treasures of York crowd as well as with the<br />\numns, he asserted, and if handled house, when those tickets go on sale the Hutzler collection.<br />\nout-of-town visitors who were atwithout the proper precaution, they Thanksgiving night. The student<br />\nDr. Chinard To Speak<br />\ntracted to the Hollywood by his<br />\nwill prove dangerous.<br />\nIn his talk on the \"Ephemer- excellent and well-balanced air<br />\nwho possesses a S.A. card will be<br />\nDuring the course of his talk, Mr. able to procure a special non-trans- ides\", Dr. Chinard will give an programs over the Columbia BroadWarner read several bits of light ferable ticket for 25c upon the pre- account of the history and value casting System network.<br />\nverse from his volume, Songs of entation of his card. He will have of this French political series of<br />\nWith such well-known artists<br />\nthe Craft, to illuminate the journal- to procure this ticket himself, and old periodicals and will relate the as Frankie Parish,<br />\nthe boyish<br />\nistic life.<br />\nwill not be able to procure more manner in whch the work was ac- tenor; Cuffy Morrison, the bariMr. Warner was introduced by than one special ticket, although he quired last August in France.<br />\ntone with a trick in his voice for<br />\nHyman Levin, well-known figure in may have several S. A. cards. Fra- Purchased for the University with<br />\nevery octavo he sings and Harry<br />\ncampus journalism and president of ternities will not be able to send one funds contributed by the Friends<br />\nDizzy, the hottest trumpeter this<br />\nthe Pi Delta Epsilon, under whose man to buy all the tickets, although of the Library, this historical ac'side of the Atlantic—the band afauspices the assembly was held.<br />\nsections may be reserved.<br />\ncount will be of appropriate inter- fords an excellent variety program.<br />\nest to them, it was announced.<br />\nAdd to this Charlie Davis' Notre<br />\nThe \"Ephemerides\", originally Dame trained voice and his ability<br />\nin the possession of an old private on the piano as well as the trumpet,<br />\nfamily in France, whence it came and the reason for the sudden<br />\ninto the hands of a French book- popularity of this accomplished<br />\nseller and thence to Dr. Chinard, musical unit is apparent.<br />\nShelley A Metaphysical Poet, Spenser Just A Name To is a rare collection<br />\nof copies of<br />\nThe grand march, held at midErudite Gents; Homewood Litterati Misplace<br />\nthe French parallel of the English night, will be led by Miss Mae<br />\nThe Renaissance<br />\n\"Spectator\" papers and was the Armstrong, guest of honor and a<br />\nSometimes people want to know was rather discouraging, because printed organ of the Physiocrat debutante of the present season, and<br />\nsomething about English litera- even we knew that that gentleman party in France during the latter Mr. Harrison K. Russell, president<br />\nture. Sometimes they come down flourished about 150 years after half of the 18th century. As the of the Cotillion Board.<br />\nto the NEWS-LETTER office and ask the period of poets in which we Physiocrats' periodical, it is an<br />\nNo Dance Tomorrow<br />\nembarrassing questions about it, were interested. We gave up our excessively valuable file of jourOwing to the fact that a free tea<br />\ntoo. So rather than allow our- oracle and looked around further. nals, the only other collection in dance will be given tomorrow afterthe country being at Yale.<br />\nselves to remain in a state of igThey were pretty easy to find:<br />\nProfessor Hollander's topic will noon in Levering Hall, there will be<br />\nnorance, we compiled some of In a few minutes we were plying<br />\nno dance tomorrow night.<br />\nthese questions, decided what the another with the query, \"In what be the Hutzler collection, which The Board has also announced that<br />\nanswers were, and set out to ver- period did Dryden live?\" \"Eight- at present consists of approxi- fraternities and other groups may<br />\nmately 4000 books and tracts<br />\nify our solutions.<br />\neenth century\", he snapped, just dealing with economic thought obtain table reservations when they<br />\nOf course it wasn't very hard like that. We figured that this<br />\nand history of the past. Started purchase their tickets.<br />\nto think of a source of informa- was a close enough guess relative<br />\nas a collection 30 years ago, it \"Blue Jay\" Board<br />\ntion: the most prominent one at to a Stuart poet, who died in 1700.<br />\nwas made possible by the contrithe moment happened to be the We ventured further: \"What did<br />\nPicks New Members<br />\nbution of funds by Mr. David<br />\ngroup of newly-elected Tudor Spenser write?\" He gulped, and<br />\nEdgar Kemler, Kenneth ZierHutzler, Mr. Abram G. Hutzler,<br />\nand Stuart Clubmen. Surely, if began muttering that he had to<br />\nler,<br />\nS. Daniel Eigenbroder and<br />\nothers;<br />\nsomewhat later, it was<br />\nand<br />\nanyone would know the answers, get his lunch, and remained nonEdward<br />\nJ. Kirschbaum were<br />\nendowed by the two Hutzlers, this<br />\nthese young savants would.<br />\ncomittal. Mental pictures of first endowment having made possible elected to the editorial staff of<br />\nGhost of Shelley Maligned<br />\neditions of Spenser lining the the constant addition of new the Blue Jay at a recent meeting<br />\nSo we cornered one of the dis- walls of the Clubroom flashed be- works to the collection, which is of the Board of Control. James<br />\ntinguished group. \"Name us a fore us, and we sighed. But yet housed as a single unit in the Bealmer was appointed to the<br />\ncouple of metaphysical poets,\" we undaunted we continued, \"Name Seminary of Political Economy in photographic staff.<br />\nsuggested. \"Well,. \"he looked the first Stuart ruler.\" He was Gilman Hall.<br />\nAdditional elections to the art<br />\nstartled. \"There was Shelley, for floored; he swallowed a lump in<br />\nThe main fields represented in and photographic staffs will be<br />\none . . .\" and he balked. That<br />\n(Continued on Page 2, Col. 6)<br />\n(Continued on Page 3, Col. 3)<br />\nmade during the year.<br />\n<br />\nWILL SPEAK AT<br />\nLIBRARY EXHIBIT<br />\n<br />\nTudor And Stuart Initiates<br />\nFloored By English Queries<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br />\n<br />\n'he IlewsolLetter<br />\nFOUNDED 1897<br />\n<br />\nSubscription per year<br />\n$2.00<br />\nBy Mail<br />\nRemit subscription fees to John Myers, treasurer, Student Activities<br />\nCouncil, Gilman Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nin Baltimore, Md., under the Act of Congress, November 3, 1879.<br />\n'<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins University.<br />\nMember of The Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States and of The National College Press Association.<br />\nOffice Phone<br />\nEditor's home phone<br />\n<br />\n7383<br />\n__liberty 1714<br />\n<br />\nBusiness communications should be addressed to the Business Manager, Johns Hopkins University. All articles and communications pertaining to the editorial department should be forwarded to the Editorin-Chief, Johns Hopkins University.<br />\nEDITORIAL DEPARTMENT<br />\n<br />\nBUSINESS DEPARTMENT<br />\nEditor-in-chief<br />\nBusiness Manager<br />\nNorman S. Heaney<br />\nManaging Editors<br />\nEdgar S. Blumstein<br />\nMartin Perlmutter<br />\nAdvertising Manager<br />\nMillard Langfeld<br />\nAssistant Managing Editor<br />\nRay Goldberg<br />\nRichard Feise<br />\nCirculation Manager<br />\nStanley Blumberg<br />\nJunior Editors<br />\nCharles Hastings<br />\nMelvin Goldberg<br />\nAdvisory Editor<br />\nOffice Manager<br />\nHyman Levin<br />\nBert Gordon<br />\nSports Editor<br />\nLeonard Wallenstein<br />\nIrvin Blum, Harold Kantrow,<br />\nReporters<br />\nBert Prager, Allen Delevett,<br />\nIrving Lottman, Carson Frailey,<br />\nGeorge Paver, David Levy,<br />\nSylvan D. Solarz, Fred Bang,<br />\nA. Edelman, Carl Hartman,<br />\nLeonard Harris.<br />\n<br />\nit is in the case of our 14-7 loss to Lehigh. But the<br />\nPenn State and U. of M. encounters are in a far<br />\ndifferent category.<br />\nOur sports-columnist summarized the situation<br />\nvery neatly last Tuesday in discussing the relative<br />\nsources of material for the teams. Hopkins depending upon the local talent, and the other schools importing players. But the reason for keeping these<br />\nsuperior teams on our schedule may be more than a<br />\nmere matter of tradition. We have burdensome presentiments that the financial aspect charms the minds<br />\nin the athletic office.<br />\nTrue enough, no team can survive without adequate financial backing—at least of some sort. But<br />\ndoes that necessitate the subjecting of our light-weight<br />\nand insufficiently-trained players to all sorts of physical beatings by stronger teams? After nearly every<br />\ngame which has .been in any degree hotly contested<br />\nthe players have come out very much battered up,<br />\nmore so than usual or necessary. The responsibility<br />\nfor winning the game rests upon two or three star<br />\nplayers whom the coach dare not remove from play,<br />\nand they are in constant danger of grave physical injury. Don Kelly may not play any basketball this<br />\nyear because of his wrenched back; Pete Reynolds is<br />\ndefinitely out of further athletic activity; Bill McClean is in none too good a state.<br />\nSome of this injury is due to the poor equipment<br />\nused. The pants and helmets are notoriously deficient in padding and have not been replaced for a<br />\nlong time. A little of the profits made on these \"big<br />\ngames\" might be invested to good advantage in protecting the life and limb of the team. But that is not<br />\nthe salient fault; the trouble is that these heavier<br />\n, teams should appear on our schedule at all. Athletics<br />\nafter all are meant for enjoyment and constructiveness in health for the participants, and not to turn out<br />\nwinning machines. According to the present arrangements the team does not prepare for the next game;<br />\nit merely tries to recover from the last one in time<br />\nfor its next punishment. It's a sort of a glorified<br />\ngladiatorial circus.<br />\nIf we can ever separate the athletic department<br />\nfrom the emphasis which it places upon the financial<br />\nend of the work we will have achieved the most notable advance which has been made in sports at the<br />\nHopkins in years. The primary consideration, we<br />\ninsist, is not the gate but the assurance that when<br />\nthe game is over there will be eleven men who are<br />\nfairly sound. in body and not the victims of some<br />\ncomplicated injuries which may cripple them for life.<br />\nIt's not worth the price.<br />\n<br />\nJ. H. U. Man Invents Totalisator<br />\nFor Automatic Horse Betting<br />\n<br />\nAt The<br />\nPlayshop<br />\n<br />\nHenry Straus, Hopkins Graduate And Former Instructor, Two more 'performances of Oef4<br />\nFinds His Electrical Device A Great Success<br />\n\"Blind Man's Buff\", \"Fatti Mas<br />\nschi Parole Femine\", and of<br />\nAt Pimlico Track<br />\nOne more Johns Hopkins man<br />\nhas attracted widespread praise in<br />\nthe world and has climbed the ladder of success. This man is Mr.<br />\nHenry Lobe Straus, and his most<br />\nnotable achievement is his invention<br />\nof the totalisator, an electrically controlled, automatic, betting device<br />\nwhich recently made its Eastern debut in America at the Pimlico racetrack.<br />\nMr. Straus, a native of Baltimore,<br />\nreceived his Bachelor of Science degree in the School of Engineering<br />\nhere in 1917, after having graduated from Baltimore City College.<br />\nIn the scholastic year 1919-20 he<br />\nalso was an instructor in mechanical<br />\nengineering at the Hopkins, and he<br />\nis now a successful consulting engineer here in Baltimore.<br />\n<br />\nutilized. The universal approval it<br />\nreceived there led to its introduction<br />\nto America, and it got its first<br />\nchance at Arlington Park, Chicago,<br />\nlast summer. Its success there was<br />\ninstantaneous, and it just recently<br />\nwas installed at Pimlico. That it<br />\nmet with the highest approval there<br />\nof all concerned is shown by the<br />\nfact that Mr. Straus has received a<br />\ncontract to install his invention at<br />\nthe Tanforan track in California,<br />\nand the machine is now in use at<br />\nHialeah Park in Florida. The universal success of the device is assured, and Mr. Straus is soon to<br />\nleave for the West Coast with his<br />\ncrew of mechanics to install it at<br />\nother tracks.<br />\n<br />\n\"Rosemund on the Tracks\" will be<br />\ngiven at the Johns Hopkins Play 111e(<br />\nshop in the Homewood Theatre<br />\nFriday and Saturday evenings a<br />\n8.30 P. M.<br />\nI.4011<br />\n\"Blind Man's Buff\" is a medieval<br />\nFrench comedy and the old story Of<br />\nthe girl who prefers to marry a poor<br />\ncount rather than yield to her father's demand that she wed his choice<br />\nA happy ending, however, finds the<br />\ndaughter married to the poor count<br />\nand her father's choice, the cook<br />\nwedded to the daughter's maid.<br />\nCast Of Play<br />\n<br />\nThe cast of the play is as follow!:<br />\nWalter Brecker ; father, Hugo<br />\nWeisgall; daughter, Evelyn Macht'<br />\nFriday, November 24, 1933<br />\ncount, T. N. Magill; maid, Mary<br />\nAlbey.<br />\nMachine Works Rapidly<br />\nA Welcome Breather<br />\nIn \"Fatti Maschi, Parole Ferry<br />\nThe actual operations of the toWe read in the last issue of THE NEWS-LETTER<br />\nme\", Yolanda (Evelyn Kairis),<br />\ntalisator are unusually complex, but,<br />\nthat next Spring the first conference of world chemHobby Is Sports<br />\nbeautiful daughter of Count Rene'<br />\nin effect, the machine acts as the<br />\nists since the War will be held in Paris. The passion<br />\nAlthough engineering in his pro- race track's mechanical bookkeeper, to (Arthur Gutman) is still withfor conclave is no respecter of persons, apparently,<br />\nfession, his hobbies are outdoor flashing the official odds and total out an acceptable suitor. Then the<br />\nand we are doomed to another lengthy report of<br />\nsports and horses, and he has de- amounts of money bet on the races hero appears in the person of 3<br />\nprocedures.<br />\nvoted many years to the pursuit of in electric lights. Betting in the brave, dashing, impetuous page<br />\nThere's a bright side to the affair, however; one<br />\nthem. He is a member of the \"tote\" is considerably different from (John De Hoff). The page engages<br />\nwhich should cause us young fellows no little satisfacMaryland Jockey Club, and breeds betting in the old-style mutuel de- in a game of chess, the prize of<br />\ntion. That is the consideration that, while the learned<br />\nthoroughbred horses, on a modest partment. The speculator calls for which is Yolanda's hand in mar'<br />\ngentlemen are in conference, they are not experimentscale, at his Cherry Hill Farm near his ticket by number, instead of by riage. He is a poor player, but hav'<br />\ning, and it may be that thus we shall be spared a<br />\nReisterstown. Because of his fond- name. When the ticket seller presses ing already won Yolanda's love, he<br />\nfew death-dealing gases. We have feared for a long<br />\nness for horses, he was naturally a button, a freshly printed receipt succeeds in winning the game also,<br />\ntime that there would be no end to their efforts to<br />\nEvoking the most applause and<br />\ninterested in the \"Sport of Kings\" pops out of the machine in front of<br />\noutdo one another in developing instruments of human<br />\nappreciation,<br />\nhowever, was the far'<br />\nand often went to the races. And him. As each bet is made, it regisdestruction. But a short respite from their labors<br />\ncial<br />\ncomedy,<br />\n\"Rosemund on the<br />\nit was after some years of attending ters in the machinery, and by this<br />\nmay give them a little time to observe the war spirit<br />\nTracks\",<br />\nby<br />\nDr.<br />\nAlbert K. Wein'<br />\nthe races on the Maryland tracks the odds are posted. The enormous<br />\nso rife about them and cause them to divert their<br />\nberg.<br />\nand noticing the inaccuracies of the operations of which the machine is<br />\nattention to a saner field of endeavor.<br />\napproximate-odds boards, that Mr. •capable are shown by the fact that<br />\nRudolf, played by Charles Rip'<br />\nAs a matter of fact we'd far rather they'd stop<br />\nStraus conceived the idea of the it worked smoothly and quickly on in, is the melodramatic villain who<br />\ndiscovering the infernal stuff. The prospect of war<br />\ntotalisator.<br />\nis far too appalling as it is, without the added indeterthe opening day at Pimlico, although is determined to have his way with'<br />\nminate factor of what's going to kill you. We're not<br />\nMr. Straus took his embryonic over 10,000 persons were present a virtuous girl (Kitty Forsythe) or<br />\nparticularly cheered up by the suggestion that these<br />\nplan to one of the high authorities and the betting went past the $280,- tie her to the railroad tracks. At the<br />\nin<br />\ngases are instantaneous and sure; that's a desolating<br />\nMaryland horse racing, and was 000 mark. And the machine wasn't last minute the brave hero (Lerol<br />\nthought at best.<br />\nWe believe that Willard Harell, the Georgia encouraged to develop it; but it was worked at anything near its maxi- Suger) rushes in to save Rosamond<br />\nfrom her doom. The comedy ends<br />\nNo; it would be far better if the chemists could gigolo, was entirely psychic when he lent Miss M—. in England that his idea was first mum speed.<br />\nhave one big perpetual conference. Let them keep Hopkins student, his bedroom key instead of the key<br />\nwith the heroine informing the<br />\non talking about colloidal precipitates, bases and salts, to his laboratory.<br />\nlain that he may see her again after<br />\nand what not. Those phenomena, at least, don't sound<br />\n0-0<br />\nshe is safely in the bonds of holY<br />\nso fatal, and we'll need a good deal of bolstering up<br />\nThe contents of the liquor served by the Phi<br />\nmatrimony.<br />\nof our spirits if we're to be mobilized to protect Psi's to the freshmen at their open house was eviAt the University of Washington,<br />\nSpectacular<br />\nentrance:<br />\nFlying<br />\nto<br />\n—S. L.<br />\nour homes. And besides, if their uninterrupted labors dently a mixture of Mason Morfit's old tennis shoes,<br />\nsince the War have been pursued diligently the drainage from O'Dunne's car, and some of Tommy co-eds have a special section for the Davis and Elkins game in a paschances are that they've already discovered enough Dukehart's packs of cards. Before long the Cane \"bachelor girls\" at football games senger plane, the New River Colgases to kill us off in a minimum of time; that ac- Club will do anything to get a formula as tasty as this season—just so the men can lege's football captain leaped from<br />\ncomplishment in itself earns them a holiday.<br />\n•this.<br />\ntell who's who.<br />\nthe plane when over the field and<br />\n0-0<br />\n* *<br />\nparachuted down to position just<br />\nThe D. U.'s don't know it, but Lou Lynn, the<br />\nin<br />\ntime for the game.<br />\nA<br />\nfew<br />\nwise<br />\nwords<br />\nfrom<br />\nThe<br />\nCash vs. Physical Injuries<br />\nsmoothest orchestra leader at the High-Hat Club is<br />\nEditor, THE NEWS-LETTER,<br />\n* * *<br />\nSpectator:<br />\n\"I<br />\nbegin<br />\nto<br />\ndoubt<br />\nthe<br />\nWith only one game left to play on the current a D. U. from Miami.<br />\nJohns<br />\n.Hopkins University.<br />\nvalue of wasting time in college.\"—<br />\no—o<br />\nA \"no shave\" club was organized<br />\nfootball schedule and that comparatively unimporSir:<br />\nSpeaking of orchestras, the I. N. A. dance pro- John Jacob Astor III.<br />\ntant as far as our present purposes are concerned,<br />\nat Indiana University. Members<br />\nI wish to express my opinion of<br />\nwe can look back upon the season with the benefits duced a good little orchestra—the Ramblers. Pres* * *<br />\nhave pledged not to remove their<br />\nof hindsight in our favor. Our attention is attracted ident Levin was covered with glory and somebody's<br />\nthose<br />\ngallant gentlemen of the cobeards<br />\n.until<br />\nthe<br />\nfootball team wins.<br />\nThe College Eye informs us that<br />\nchiefly to the three overwhelming defeats which the dress after the ball was over.<br />\ntillion<br />\nboard who so daringly place<br />\n*<br />\n*<br />\n*<br />\nrumors are circulating to the effect<br />\n0-0<br />\nteam underwent, namely, at the hands of Swarthmore,<br />\nautos,<br />\nOne of the professors at the Uni- advertisements on Students'<br />\nPenn State, and U. of M.<br />\nA political upheaval was seen in the offing as that a \"We Ain't Been to the<br />\nIt<br />\nmight<br />\nthat<br />\ninterest<br />\nthem<br />\nto<br />\nknow<br />\nIt is not a disgruntled feeling which singles out Vice-President Pietsch of the Freshman Class placed World's Fair but We Have Heard versity of Nebraska states that love,<br />\nI<br />\nam<br />\nnot<br />\nrunning<br />\nmy<br />\nauto<br />\nas<br />\nall<br />\na<br />\nthumb<br />\ntack<br />\nin<br />\nthe<br />\nchair<br />\nin<br />\nwhich<br />\nBoss<br />\nJohn S. All About It\" club will be formed dumbness and faculty intelligence<br />\nthe defeats instead of the victories for our attention.<br />\nRather it is the nature of the teams which admin- Wright was subsequently to sit. Pietsch has drawn the for the convenience and protection are the reasons for freshmen flunk- advertising agency and it might also<br />\nistered the drubbings. Losses by A three- and four- first blood but we expect that Boss Wright will soon of the small minority that stayed ing<br />\ninterest them to know that those<br />\nout of courses.<br />\ntouchdown margin signify something more than a get things in hand.<br />\nyellow stickers are anything but 3<br />\nat home last summer.<br />\n* * *<br />\no—o<br />\nmere adverse turn in our luck. It is absolute proof<br />\nthing<br />\nof beauty. It seems strange<br />\n* * *<br />\nWooden head puddin' head Schwartz made a<br />\nthat we are outclassed. In the case of Swarthmore,<br />\nDesiring employment, some men<br />\nthat<br />\nthese<br />\nyellow stickers are not<br />\nperhaps, the situation is only temporary. It may be _buck and a half by swimming around the duck pond<br />\nL. L. Davison, physicist at St. at Harvard are enrolled in a social<br />\nplastered<br />\non<br />\nwindshields while the<br />\nthat next year we'll beat them just as badly, and so this week.<br />\nMary's University in San Antonio, register whose business it is to furowners are present, so that they mal<br />\nTexas, has discovered that falling nish male escorts to \"deb\" parties.<br />\n'express their opinions of those gal'<br />\nhair is caused by drinking water They hold, business before pleaslant gentlemen also.<br />\nbefore going to bed. Cheer up! ure, first, last, and always.<br />\nA VICTIM.<br />\n* * *<br />\nThere'll soon be a good substitute.<br />\nBy Millard Langfeld, Jr.<br />\n* * *<br />\nThe University of Dayton goes<br />\nSIX WEEKS OF GRACE<br />\ntangle resulting from which is now before the<br />\nNorth Carolina State claims that one better than an All-American<br />\nTHE PRESIDENTIAL honeymoon is rapidly country.<br />\nsome of their freshman football football team. On the squad are<br />\nAnd so Mr. Roosevelt faces six short weeks of<br />\ndrawing to a close. Slightly less than six weeks are<br />\nyet to pass before the quiet of capitol hill will be rent freedom. And after that the deluge. The test will players have the hardest names in Swedish, Polish, Scotch, Irish,<br />\n(Continued from Page 1, Col. 5)<br />\nby the clamor of solonic philistines bent on adminis- be if, in those racing hours yet remaining, he can the United States to pronounce. Lithuanian, Australian, Hebrew,<br />\nthe collection are English eco'<br />\nsomehow manage to cinch the major projects of his Some of these are Sarin, Ryneska, French, German, Dutch, Slavic and<br />\ntrtive prey. And there are rich pickings to be had.<br />\nnomic history since the time 01<br />\nIt is now close to seven months that the Roose- program conclusively as to snatch them from the Matys, Chiemiego, Spitalnich, Jak- Hawaiian representatives.<br />\nthe great English economist,<br />\n* * *<br />\nvelt regime has reigned untrammeled and unham- peril soon to gather down the Avenue. It's an in- wich, Gershowitz, Schoolsburg,<br />\nAdam Smith. Most of the iterns<br />\npered in the city of the Dome. And those seven teresting prospect.<br />\nWe learn, through the Brown in the Hutzler collection are rar'<br />\nIstvaan, Kubesa and Reinesch. Pity<br />\nmonths have witnessed a wielding of power and trend<br />\nWHAT PRICE FREEDOM<br />\nand White, of a Los Angeles pawn ities, it being particularly rich ill<br />\nthe radio announcer!<br />\nof policy unique in executive annals. Gone are nu*<br />\n*<br />\n*<br />\nAMIDST all the clamor which marked the relegashop which boasts of 15 fraternity tracts on the controversies over<br />\nmerous old restrictions on the White House hand, tion of the Noble Experiment to the dead past, no<br />\nthe Factory Acts, Poor LaW,<br />\nThe S. S. California, anchoring pins.<br />\ngone are consecrated customs and governmental voices were raised louder than those who acclaimed<br />\nChartism, and the India Corn'<br />\n* * *<br />\n\"rules\". And gone are countless other time worn repeal as the end of racket rule, the death knell of just off shore for the occasion, was<br />\npally. In recent years important<br />\nA bit of humor from the Sou'<br />\nthe scene of the Junior Prom at<br />\nusages, so dear to the congressional heart.<br />\npamphlets on earlier periods have<br />\nthe bootlegger and the \"speak\", the mass return of a<br />\nwester: \"She was only an opti- been added, some of these belong'<br />\nSanta Clara University.<br />\nInstead, Lady Nira rules a kingdom of rebel- people to liberty under law.<br />\n* * *<br />\ncian's daughter-2glasses and she ing to the 16th century.<br />\nlious change. And the gentlemen of the Senate and<br />\nAnd yet it is to be wondered. Not a paper comes<br />\nthe House are slow to respond to change. Many off the press which does not proclaim new taxes, new<br />\nLehigh has acquired a freshman made a spectacle of herself.\"<br />\nThe collection contains a begin'<br />\nmeasures of the past few months have been put into regulation, new restrictions to the liquor trade. Na- who gets a great kick out of swim* * *<br />\nfling made in the econornlc<br />\neffect through presidential weight alone. Disappro- tional, state, city and county bodies vie with one an- ming<br />\nThe Miami Student claims that thought of France and German'',<br />\nin the pool wearing a waterbation has been general along the legislative front. other in concocting a labyrinth of rule which a hardy<br />\nAmerica<br />\nproof wristwatch—and does he girls going through college call- and, to some extent, in<br />\nBut there was nought to do.<br />\nlegal mind must tread in uncertainty and dread.<br />\nThere is also a section which ell'<br />\nget a laugh when everyone yells ing fraternity emblems \"frat\" pins<br />\nTo further complicate the scene, many acts have<br />\nSuch administrative machinery is expensive.<br />\nbraces the translations of the<br />\nthus far fallen far short of success. Especially is this Again, new taxes and still higher retail costs. And to him that he has forgotten to are a trifle{ less desirable than fluential English economic clas5'<br />\ntake off his watch.<br />\nthose who say \"fouhternity\" pins. ics into other languages.<br />\ntrue of the gold-purchase-dollar-cheapening plan, the then?<br />\n<br />\nCampus Brevities<br />\n<br />\nIntercollegiate News<br />\n<br />\nLetters To<br />\nThe Editor<br />\n<br />\nFlashes<br />\n<br />\nTo Discuss New<br />\nLibrary Collectiart<br />\n<br />\n\fHOMEWOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br />\n<br />\nin JAY BOOTERS<br />\nIN SECOND GAME<br />\n<br />\nRifle Club Match Gouchers Students<br />\nTo Be Held On Plan Health<br />\nDecember 4<br />\nImprovement<br />\n<br />\nInterclass Wrestling Tournament Will Be Held<br />\nIn Near Future<br />\n<br />\nbefeat Calvert Hall At An interclass wrestling tournaMas•<br />\nment will be sponsored in the near<br />\nPatterson Park Last<br />\nof<br />\nfuture<br />\nby the Hopkins Wrestling Prizes Will Be Awarded Talks On Subject Will<br />\nMonday<br />\nill be<br />\nteam. All students interested in enIn All Classes For<br />\nAlso Feature \"Health<br />\nPlay<br />\nHigh<br />\nthe<br />\ntering<br />\ntourney<br />\nScores<br />\nWeek\"<br />\nare<br />\ninvited to<br />\nMcGILL SCORES ON<br />\n!atret<br />\nattend wrestling practice where they<br />\nPASS FROM LANG<br />\nWith a view of improving the<br />\nThe undergraduate rifle match<br />\nt,-s at<br />\ncan get more definite information.<br />\n<br />\nCoach Miller has issued a special sponsored by the Hopkins Rifle health of the student body, Goucher<br />\nlieval<br />\ncall for more candidates for the Club will get under way on Mon- College students have been given<br />\nKeeps Jay Record<br />\nTy of<br />\nwrestling team in the 118, 126 and day, December 4. The match will cards on which to chart their habits.<br />\nClean<br />\npoor<br />\n135-pound classes. The present be open to all undergraduates ex- The plan was evolved in connection<br />\nfatlY<br />\ncepting members of the rifle team with \"Health Week.\" Starting<br />\nThe newly organized Hopkins squad is weak in these weights<br />\nand will be fired in the prone posiManagers Planning Home Meets<br />\nlast Monday, the week is scheduled<br />\ns the soccer team won its second victory<br />\nThe managers are planning sev- tion only.<br />\nof<br />\nthe<br />\nHall<br />\nCalvert<br />\ndefeating<br />\nseason,<br />\nto end today.<br />\npunt,<br />\neral home meets as a special feaEach entrant will be allowed<br />\ncook, 1-0 at Patterson Park last Monday. ture of this year's schedule.<br />\nThe plan was sponsored by the<br />\ntwenty shots, ten for a practice tarbeadlocked at the half, the Jay forNo wrestling matches have been get, and ten to be fired on a target faculty committee on mental and<br />\nward line, led by Captain Lang, con- held at Hopkins in the past. Prac- signed by the entrant. Prizes will physical health, of which Dr. Jessie<br />\nowS: tinually kept the ball deep in Cal- tice is held daily in the barn at 4.15. be awarded for highest scores in L. King, professor of physiology, is<br />\nseveral classes such as: new club chairman, and by the department<br />\n-lug° vert Hall territory until McGill<br />\nof<br />\nacht;<br />\nmembers, and men who have never physical training, directed<br />\nby Miss<br />\nfinally tallied on a pass from Lang.<br />\n'fired on a rifle range before.<br />\nviarY<br />\nEline von Borries.<br />\nAbout thirty candidates have been<br />\nExpense<br />\nNo<br />\nRobert Fechner, director of the<br />\nThe time spent in all activities<br />\nFenY Practicing daily in front of Levering<br />\nThe target may be fired on any during the day, the amount of sleep<br />\nemergency conservation work, aniris), Rall under the direction of Captain<br />\nnounced that 40,000,000 to 50,000,- afternoon of the week begining De- and the regularity of their meals are<br />\nenat- Lang. Most of the players have had<br />\n000 saplings would be planted on cember 4 and the range will be open included on the cards. The windwith' Previous experience, either on local<br />\ngullied and washed lands by Civilian from 1 to 4.30 each afternoon. Each up is to consist of a fashion show,<br />\n1 the<br />\ndubs or high schools. It is hoped Conservation Corps workers in the entrant should place on a slip of girls having the best postures being<br />\nof 3<br />\nthat games will be able to be ar- near future to aid in the control of paper his name, P. 0. box, and the selected as models.<br />\nPage<br />\nafternoons on which he could fire.<br />\nHealth Talks Featured<br />\nranged with nearby colleges, as well erosion in the Central and Southern<br />\nThis should be dropped in P. 0. During the<br />\nas several of the local high schools. States.<br />\nweek a series of health<br />\nC of<br />\nBox 1078, before Saturday, Decem- talks was presented to<br />\nThe<br />\ntrees<br />\nare<br />\nto<br />\nbe<br />\nplanted<br />\nas<br />\nthe students.<br />\nmar' The line-up:<br />\nber 2.<br />\npart<br />\nof<br />\nthe<br />\ngeneral<br />\nprogram<br />\nto<br />\nstop<br />\nAmong<br />\nthe<br />\nand their<br />\nspeakers<br />\nhay'<br />\nCALVERT HALL<br />\nHOPKINS<br />\nParticipation in this match in- subjects were:<br />\nhuge annual losses to farm owners<br />\nFreeburger<br />\na, he RartMari<br />\ndue to the washing away of the rich volves no expense to the entrant.<br />\nalso, ReYnolds<br />\nDr. Grace Baker on \"Mental<br />\nRF<br />\nLutz<br />\ntop soil during and after rains. The range is in the North Loft of<br />\nHealth\".<br />\nand Merson<br />\nL.F.<br />\nStevens<br />\nLosses from erosion run into hun- Gilman Hall.<br />\nfar ternheim<br />\nTribbill<br />\nDr. Llewellys Barker on \"The<br />\nL.H<br />\ndreds of millions of dollars annuThe Rifle Club has a record memthe Moravec<br />\nKnoerlein<br />\nDaily Round of Living\".<br />\nCH<br />\nally.<br />\nbership this year and will carry on<br />\nTeiw Powell__<br />\nMacklin<br />\nH<br />\nDr. Gertrude Rand on \"Lights<br />\na very active and interesting season.<br />\n0-0<br />\nMitchell<br />\nCasey<br />\nO.R<br />\nLighting\".<br />\nand<br />\nNine Georgia newspapers recent- Club membership includes the use<br />\nI.R.<br />\nErnst<br />\nRip' !in<br />\nMiss Ethel Maslansky on \"Some<br />\nly issued the regular editions on of the rifles and the range as well<br />\nwho McGill<br />\nMcDermott<br />\n_C F<br />\nAspects<br />\nof Nutrition\".<br />\ntargets<br />\nof<br />\nsupply<br />\nas<br />\na<br />\nand<br />\nbullets.<br />\nwit!, Lang<br />\nLangley newsprint secretly made from<br />\nIL<br />\nThe<br />\ndues<br />\nare<br />\nyear<br />\n$2<br />\nfor<br />\nper<br />\nnew<br />\nDr.<br />\nHuntington<br />\nWilliams on<br />\n)of Co rchran ________0.L<br />\nMorreck Southern pine trees as a demonstramembers<br />\n$1<br />\nfor<br />\nand<br />\nold<br />\nmembers.<br />\n\"The<br />\nCommon<br />\nCold\".<br />\ntion of closing the last link in Amert the<br />\nican<br />\ncommercial independence.<br />\n,eroY<br />\nAs<br />\nscentists see it, the link is the<br />\nlona<br />\nmanufacture from home resources<br />\nends<br />\nof newsprint and all the high-grade<br />\nviltntnerbacher And Billingslea, white paper. Newsprint now is an<br />\ntfter<br />\nannual business of about $140,000,High Scorers; Matches Held<br />\nholY<br />\nShutting our eyes we made a<br />\n000,<br />\nand two thirds of it is im- (Continued from Page 1, Col. 3)<br />\nEvery Wednesday<br />\nhis throat and grabbed desperate- last frantic effort to enlist the<br />\nported.<br />\nWith the loss of only one game<br />\nThe secret manufacture was un- ly at the arm of a passing student benefits of their higher knowl°lit of fifteen, Tau Alpha Phi is dertaken to answer the final thing and asked him. But the latter edge. \"What great political strugleading the recently organized which newspaper experts had as- worthy was a chem student and<br />\ngle occurred under the Stuarts?\"<br />\nIntra-fraternity Bowling League serted could not be done. They<br />\nonly shook his head blankly.<br />\nsaid<br />\nThe<br />\nanswer gave us food for<br />\nBritains Royal Line Scrambled<br />\nhe loop, composed of eight fra- American chemists could not make<br />\nSadly we turned from the scene thought. \"The Renaissance\", was<br />\nternities and organized five from Southern pine forests sulfite<br />\nof<br />\nhis discomfiture. This wasn't the solemn revelation. This called<br />\nWeeks ago, the teams playing its and pulp which could run at comwhat<br />\nwe needed at all. Yet we to our minds the gay and colorful<br />\ninatches every Wednesday at 4 mercial speed through a real paper°'clock. Cups will be awarded to making machine—not at the 750 or sought more members of the scenes during the time when<br />\n1 of the league winner and to the in- more feet per minute of paper pro- group. \"Were there actresses in<br />\nLeonardo and Michelangelo freco- dividual high scores.<br />\nduced from Northern spruce trees. Shakespeare's time?\" Yes, one asdace<br />\nsured us, and we fell to wonder- quented the court of Charles II,<br />\nThe best score for one game so<br />\nitos. far is<br />\ning how all the little boys in the and when Luther spoke every aft146, made by Hammerbach- Spiked Shoe Group<br />\nthat<br />\ncompanies had made their ernoon in Hyde Park.<br />\nWill Hold Meet Here stock<br />\n; ao el. and Billingslea, the...latter also<br />\nliving<br />\nin the Elizabethan Age.<br />\nholding the high three-game total<br />\nClever people, these Tudor-andalso<br />\nWhen<br />\npressed our demand as<br />\nwe<br />\nThe Johns Hopkins chapter of the<br />\n369. Tau Alpha Phi, the<br />\nStuarts. They write new history<br />\nlose l<br />\neague leaders, is in possession of National Collegiate Society of to the name of the first Stuart and exhibit astounding intellecIt 3<br />\nSpiked Shoe is holding its second ruler, one erudite Clubber abso- tual fearlessness in attacking our<br />\nLnge all the high team scores.<br />\nThe standing of the team after annual Scholastic cross-country meet lutely declined to be relevant, but old literary traditions.<br />\nnot<br />\ninstead proposed Elizabeth, and<br />\nat Homewood on Saturday.<br />\nthe W ednesday's play<br />\nA TIP FOR'STUDENTS<br />\nL.<br />\nW.<br />\nBoth the Nott Terrace and Mount spoke of her close relationships<br />\nrug<br />\nStudents who are able to review com'ran Alpha Phi<br />\n1 Pleasant high schools, which have with the Hanoverians. We imag- plete notes are much better prepared for<br />\n14<br />\nWith ABC Shorthand,<br />\nPhi Gamma Delta<br />\n2 been leading scholastic cross-country ined that he was one of that group examinations.<br />\n13<br />\nwhich is quickly learned in 12 easy lesteta. Theta Pi<br />\nE.<br />\n11<br />\n4 teams in the East, have expressed which advocates reform in all sons, you can take lecture and reading<br />\nnotes verbatim. Complete course now<br />\nPhi Kappa Psi<br />\n11<br />\n4 their intention to enter. All of the things.<br />\nsells for $1.00 at<br />\nJOHNS HOPKINS PRESS<br />\nbelta Upsilon<br />\n9 local scholastic teams, including<br />\n6<br />\n4 11 City, Poly, and Forest Park have<br />\nkappa Alpha<br />\nant-Pa<br />\nPhone Belmont 7908<br />\n14 entered. Last year's winning team,<br />\n1<br />\nSigma<br />\nPrinters of<br />\nAlpha<br />\nPhilological<br />\nand<br />\nScientific<br />\n5)<br />\n0 15 Bryant High School of New York,<br />\nTau Omega<br />\nPublications<br />\n!co'<br />\nwill not compete this year.<br />\nHOPKINS<br />\nPL. BALTIMORE<br />\n12-20<br />\nOf<br />\nBASKETBALL<br />\nThere will be a team trophy,<br />\nlist,<br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br />\nAt the basketball organization awarded to the school winning the<br />\nCHARLIE<br />\nDER<br />\n7ar ll'eeting held yesterday, it was de- meet; gold, silver and bronze medPRESCRIPTIONS<br />\nFIRST CLASS LAUNDRY<br />\nis'<br />\nthat practice would start the als for the first three men to finish,<br />\nSchool Supplies, Candy, Cigars<br />\n3224 GREENMOUNT AVE.<br />\nvet Ivionday following Thanksgiving. and bronze medals to all the men<br />\nBUTTONS SEWED ON, STOCKINGS<br />\nUnexcelled Fountain Service<br />\nMENDED, AND ALL NEEDED REPAIRS<br />\n3,1xif<br />\nMake Our Store Your Store<br />\n41 an effort to round into condi- on the winning team.<br />\nAt No Extra Charge<br />\nti<br />\nall of last year's regulars, with<br />\nwit the exception<br />\nof Kelly, have been<br />\nave Practicing for the past few weeks.<br />\nGoing Home for<br />\n'the<br />\nteam has played several local FLORISTS - - DECORATORS<br />\nTHANKSGIVING<br />\nIittus, winning all of the games with Members, F. T. D Asso., Inc.<br />\n(SPECIAL RATES)<br />\n1918 N. CHARLES ST. VEr. 0573<br />\nle difficulty.<br />\n1%.<br />\n1730<br />\nVErnon<br />\nN. Charles St.<br />\nCor. Lafayette<br />\nST.PAUL and 31st STREETS<br />\n2 70 4<br />\nIt.tAlr.FAST, 35c<br />\nLUNCH, 40C<br />\nAve.<br />\nDINNERS, 75c<br />\nLotie Tally In Second Half<br />\n<br />\nI<br />\n<br />\nSCIENCE<br />\n<br />\n;ages<br />\n<br />\nTAU APHA PHI LEADS<br />\n<br />\nWe Fail To Verify Answer As<br />\nTudor And Stuart Men Balk<br />\n<br />\nIN BOWLING TOURNEY<br />\n<br />\nrit<br />\n<br />\nNEED ANY MORE<br />\nBE SAID—<br />\nWe quote from the Baltimore Evening Sun:<br />\n<br />\nDon Kelly, injured quarterback, showed a real spirit. Before<br />\nthe game and during the first<br />\nhalf he sat in his street clothes<br />\non the Jay bench. His back was<br />\nsore and has been for some time.<br />\nHe wasn't fit to play football. But<br />\nwhen the teams went to the<br />\ndressing rooms at the half, Kelly<br />\nalso went in. He donned a uniform and asked his coach if he<br />\nmight play. \"I feel fine,\" he said,<br />\nand who could dispute his word.<br />\nSo Don went in the game, but<br />\nhis advent didn't help the situation.<br />\n<br />\nCULTURE OF CHINESE<br />\nIS MENACED<br />\nFather Brennan Enumerates Possible Guardians Before The<br />\nCarroll Club<br />\n<br />\n(Continued from Page 4, Col. 1)<br />\ntous activities of the external civilizations of both the Orient and the<br />\nOccident, and the revolutionary disunion within China, have combined<br />\nto occupy the attention of the country's foremost minds, to the resulting detriment of Oriental culture.<br />\nHowever, he continued,there is one<br />\ngreat hope for the, solution to the<br />\nproblem, and that is the fact the culture may be preserved in the same<br />\nmanner as it was in ancient Rome.<br />\nCandidates Report<br />\nIn spite of the political and social<br />\nFor Swimming Team disturbances which rack the China<br />\nof today, the Chinese Church may<br />\nApproximately thirty-five eandi- become the guardian of China's culdates reported to an organization tural progress, keeping it alive for<br />\nmeeting of the swimming team held the benefit of later generations in<br />\nrecently. Many of the veterans the same way as Roman culture was<br />\nwere absent and the group was com- preserved by the Church after the<br />\nprised largely of newcomers.<br />\nfall of the Roman Empire at the<br />\nActing Manager Levi gave a hands of the barbarian hordes.<br />\nshort talk concerning plans for the<br />\nFather Brennan also spoke on<br />\ncoming season, pointing out that an<br />\nthe Chinese language and the way<br />\ninteresting and extensive schedule<br />\nin which it reveals the workings of<br />\nis being arranged. A trip will be<br />\nthe Chinese mind. As an example<br />\ntaken to Virginia to encounter the<br />\n•of this, he cited the fact that the<br />\nWilliam and Mary squad, and in<br />\nwritten word in Chinese for our exaddition some swimmers will be<br />\npression of \"Peace be with you\" is<br />\nsent to the Eastern Intercollegiates.<br />\n\"One woman in a room,\" indicatThe freshman team will also have ing that, in a Chinese household,<br />\na larger schedule than in the past, as where one man has many wives,<br />\nmeets are being arranged with many peace is only to be had when each<br />\nof the local high schools. These en- woman is in a separate room.<br />\ngagements will be held as prelimiOther matters which occupied the<br />\nnaries to the varsity contests, thus<br />\nattention of the meeting, at which<br />\nproviding a double program for the<br />\nPresident De Lileo presided, conspectators.<br />\nsisted of the reading and correcting<br />\nLast year the Blue Jay natators<br />\nof the club's constitution and the<br />\nwere victorious in all but one of<br />\ndiscussion of a dance to be held<br />\ntheir contests. With a large maDecember 8th, in Levering Hall. It<br />\njority of the veterans returning for<br />\nwas also decided to have parliamencompetition, the team should have a<br />\ntary law for the Club, which devery successful season.<br />\ncision necessitated the election of a<br />\nSergeant-at-Arms. Those nOminated for the position are Hausche,<br />\nSholtes and O'Brien. Dr. Herzfeld,<br />\nThere is room for new men on Professor of Physics, was unanithe production staff of the Playshop. mously elected honorary chairman.<br />\nAll those interested in any phase of<br />\nThe members of the Charles Carproduction such as lighting, scenic roll Club will convene again some<br />\ndesigning and painting, see Dr. Fa- time early next month, the exact<br />\ngin or Kirshbaum.<br />\ndate not yet determined.<br />\n<br />\nNOTICE<br />\n<br />\nTuxedos gitust Grow<br />\nold<br />\nMoth balls won't keep them in style. Don't<br />\ntry it.<br />\nGet a new Katz Tuxedo. Dinner<br />\njacket and trousers, $27.50 to $45. Vest, $6 and $8.<br />\nFormal dress coat and trousers, $40.<br />\n<br />\nKATZ TUXEDOS<br />\n211 - 213 E Baltimore Street<br />\nWE DO OUR PARE<br />\n<br />\nTHE EMERSON HOTEL<br />\n<br />\n[ J. H. FURST CO.<br />\n<br />\nBIRELY'S<br />\nPHARMACY<br />\n<br />\n...11.110•111.11.11.<br />\n<br />\nRh.«<br />\n<br />\nJ. A. RITTER & SON, INC.<br />\n<br />\nThe HOPKINS DINING ROOM<br />\nWEEKLY RATES<br />\n<br />\n%TO<br />\n<br />\nMEALS, $8.00<br />\n<br />\nTHREE MEALS, $10.00<br />\n<br />\nBALTIMORE, MD.<br />\nPrivate Rooms and Banquet Halls<br />\nfor All Occasions<br />\nCuisine and Furnishings<br />\nUnexcelled<br />\nRooms, $3.00 up<br />\n<br />\nDINNERS, $5.00<br />\ni<br />\ndp<br />\n<br />\nAutos Garaged<br />\n<br />\n\f4<br />\n<br />\nNE<br />\n<br />\nHOME WOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br />\n<br />\nFATHER BRENNAN Johnnies Reckon Without Law INTERFRAT BOARD DISCUSSION GROUP<br />\nADDRESSES JOHN As Spirit Flows Over Onto Sign WILL JOIN S. A. C. HEARS DR. MCDOYCLE<br />\nAfter a special meeting yes- (Continued from Page 1, Col. 2)<br />\nCARROLL CLUB An institution of culture and all were fined $11.45 in the North- terday,<br />\nthe Interfraternity board of groups of thought have fallen<br />\n<br />\na proving ground for future world ern Police Station.<br />\nDiscusses The Problems Of leaders—so may run a definition of<br />\nChina At Levering<br />\nSt. John's College. But the embryo St. John's Spirit<br />\nHall<br />\ngeneralissimos of the new Utopia<br />\nTo Go<br />\nseemed to have gotten it in the neck.<br />\nIS NOW AT CRISIS,<br />\n<br />\nDECLARES DIVINE<br />\n<br />\nTouch Library Note<br />\n<br />\nFive of the disciples of St. John's<br />\n<br />\nClub Revises Constitution<br />\nrecently received an inspiration for<br />\nAnd Plans Dance<br />\nliterary expression. Thus they pubDecember 8<br />\nThe most important problem of<br />\nChina today is the preservation of<br />\nits historic culture, said Father Edward Brennan in an address to the<br />\nmembers of the Charles Carroll<br />\nClub at a meeting in Levering Hall,<br />\nSunday.<br />\nIn his address, Father Brennan asserted that China, whose cultural<br />\nantiquity rivals that of the Occidental civilizations, is now at a crisis<br />\nin her historical development, as the<br />\ngreat Chinese culture is strongly<br />\nthreatened by the attitude of the<br />\nyoung people of the nation.<br />\nRevolutions Detriment To Culture<br />\n<br />\nHe also told how, although in the<br />\npast, men of importance in affairs of<br />\nthe world and State have been prominent in the Chinese cultural life,<br />\nconditions are now altered. For,<br />\nsaid Father Brennan, the momen(Continued on Page 3, Col. 6)<br />\n<br />\nlished to the world their inmost<br />\nfeelings by inscribing a sign board<br />\nwith the poignant phrase, \"Beat<br />\nHopkins\".<br />\nThe weight of these words is, of<br />\ncourse, beyond question. But the<br />\nflat feet of the law are proverbially<br />\nunsympathetic to the muse. Result:<br />\n<br />\nDISCUSSES NEGRO<br />\nRELIGION IN U. S.<br />\n<br />\n•••••••••••••••••••••••••••••••••••••••<br />\n<br />\nof<br />\n<br />\n/01.<br />\nRECENT BOOKS<br />\nt By<br />\n<br />\nMembers of the Faculti<br />\nOn Sale At The<br />\n<br />\ndown. It was possible in former<br />\ndays, because of the utter isolation<br />\nof small geographical groups, to<br />\nhave uniformity of religion in one<br />\nof these communities, because they<br />\nwere affected by virtually the same<br />\nsociological and economic factors;<br />\nhowever, this is not possible nor desirable today, because of the great<br />\nvariety of influences, he said.<br />\n<br />\nannounced that the second series<br />\nUNIVERSITY<br />\nof open houses will be held at<br />\nthe appointed time.<br />\nBOOKSTORE SI<br />\nAt the regular meeting last<br />\nOn Air Monday<br />\n+Honest John Adams<br />\na vote was taken on this<br />\nquestion and six delegates were<br />\nBy GILBERT CHINARD<br />\nAmong the students to be interin favor of holding the second<br />\nviewed by Hyman Levin on the<br />\n:Life In The Making<br />\n2.7<br />\nopen houses, while six opposed<br />\nf<br />\nr..<br />\nWCBM \"Campus Comments\" pro- it. Two groups, the Alpha Tau<br />\nBy A. F. GUTTMACHER<br />\ngram tomorrow night at 8 p. m. Omega's and the Sigma Tau<br />\n!The Universe and Life<br />\n1.50<br />\nwill be Edwin P. Davis, of St. Delta's did not cast their votes<br />\nBy<br />\nH.<br />\nS.<br />\nJENNINGS<br />\nWHY GO DOWNTOWN<br />\nJohn's, who will answer the ques- until yesterday. The special<br />\nDR.<br />\nTO SHOP?<br />\nmeeing<br />\nwas<br />\nheld<br />\nto<br />\nallow<br />\nthem<br />\ntion, \"Is College spirit pure 'ho:The Federal Reserve Board______. 2.25 ill<br />\nJust stop over on Greenmount<br />\nto make their decisions and to<br />\nAvenue—A short walk from<br />\nkum', and are campus activities of<br />\nBy W. 0. WEYFORTH<br />\nlet the other fraternities reconthe Campus—and see the<br />\ntiOp<br />\nvalue ?\"<br />\ni<br />\nnewest<br />\nand<br />\nsmartest<br />\nin<br />\nsider their opinions.<br />\nShirts, Ties, Socks and Hats<br />\nDon Kelly, of Hopkins, and MarA two-thid majority is regaret Fox, of Goucher, will also dis- quired to defeat a rule; and as<br />\nJack Cummings<br />\nFIRST CLASS RESTAURANT and<br />\nthis did not materialize Thurscuss the question.<br />\nCo<br />\n3318 GREENMOUNT AVE.<br />\nDELICATESSEN<br />\nday, the open house will be car!2436-38 ST. PAUL STREETrig<br />\nPhone: UNiversity 4430<br />\ni<br />\n25c Breakfast — 25c Lunch<br />\nnion<br />\nas well as of Goucher and of Hop- ried on as formerly planned. The<br />\nOpen Evenings, 7 to 9<br />\n50c Dinner<br />\nfinal vote stood six to five in<br />\n2<br />\nT••••••••-•••••••••••••••••••••••••••••••••••••.-•-•-•••••••••••••••-•..... nd<br />\nkins. A feature of the meeting was<br />\nfavor of the open houses.<br />\n\"by D<br />\nthe group singing of Negro spiritThe board also decided that<br />\nsecon<br />\nNEW and REBUILT TYPEWRITERS<br />\nthey<br />\nshould<br />\ntry<br />\nto<br />\nplace<br />\nman<br />\na<br />\nDr<br />\nuals, directed by Miss Banks, direc/ALL MAKES, SOLD LIKE RENTING, PAY MONTHLY<br />\nA Machine For Every Purse and Purpose<br />\non the Student Activity Council.<br />\nOf hc<br />\ntor of music at the college, who exFROM $19.75 TO $126.00<br />\nDetails were left in the hands of<br />\nhe<br />\nplained the meaning and origin of the president, William Corkran.<br />\nAll Repairs, Supplies — Rent Any Make — Special Rates Oncc<br />\nBe Sure To Try a MONARCH NOISELESS<br />\neach song.<br />\nBefore Purchasing Any Portable<br />\n<br />\n''-<br />\n<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br />\n•<br />\n<br />\nHEIDELBERG INN<br />\n<br />\n............................................................<br />\n<br />\n\"The Religious History of the<br />\nNegro Race in America\" was the<br />\ntopic of an address made by Dean<br />\nJohn W. Haywood, of Morgan College, at the regular meeting of the<br />\nPeabody Pharmacy '<br />\nInterracial Commission on Tuesday<br />\nThe next meeting of the group<br />\nt<br />\nCALVERT and 30TH STS.<br />\nnight, November 21. The session will take place in Levering Hall on<br />\nt First in Quality — First in<br />\nwas held at Morgan and was at- December 5th, at which time a genService<br />\ntended by students of that college eral discussion will be held.<br />\nI No delivery too small Bel. 53181<br />\n<br />\n1<br />\n<br />\nI<br />\n<br />\nTypewriter.<br />\n<br />\nAMERICAN WRITING MACHINE CO.<br />\nPARK AVENUE<br />\nPLaza 2060<br />\n(Serving and Saving Typewriter Users for 52 Years)<br />\n<br />\n18<br />\n<br />\n•••••••••••••••••••••••••••••••01...................1110<br />\n<br />\nTi<br />\nSO ROUND,SO FIR1VI, SO ULLY PAC<br />\nD KEarJ<br />\n<br />\nC<br />\n<br />\nIron<br />\nLati<br />\ntrist<br />\nfirm]<br />\nthe .<br />\ntory<br />\nof I<br />\n<br />\nthe<br />\neve]<br />\nInat<br />\nelm<br />\n<br />\ntrib<br />\nJay<br />\nrev<br />\nsto,<br />\nRo,<br />\nn<br />\nter<br />\n<br />\nto<br />\nbe<br />\na.ld<br />\ntor<br />\n1(.(<br />\nhi;<br />\n<br />\nre<br />\nin<br />\n1‹.<br />\n<br />\naeuckiackawea4<br />\n<br />\nCc<br />\n01<br />\n<br />\nit<br />\n<br />\nIt's easy to see why so many women prefer<br />\nLucky Strike. Luckies are fully packed with<br />\nlong strands of choice tobaccos, round and<br />\nfirm to the very tips. That means Luckies<br />\nalways draw easily, always burn smoothly.<br />\nIt also means no annoying loose ends to<br />\ncling to lips or mess up the nice things<br />\nin a woman's purse. And every day<br />\nmore and more women are showing their<br />\nappreciation by saying \"Luckies please\".<br />\n<br />\nti<br />\n<br />\nti<br />\na<br />\n<br />\nALWAYS thefinest taaccos<br />\nALWAYS thefinest worknansh0<br />\nALWAYSLadiesikase<br />\n<br />\n44<br />\n<br />\n_<br />\n<br />\nit's toasted<br />\nFOR THROAT PROTECTION—FOR BETTER TASTE<br />\n<br />\n\f", "format": "basic_html", "processed": "MEMBER OF THE<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION -1<br />\nOf Middle Atlantic States<br /><br />\n:Et<br />\nFRS Vol. xxxVIII—No.<br /><br />\n0<br />\n- .14r<br /><br />\nedr tms 1Sopkins Nratsrttrr<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, NOVEMBER 24, 1933<br /><br />\n16.<br /><br />\n)rsfsouLiNcs MADE<br />\n,mptvAs<br />\ndnes, S. AI L SEES<br />\nBuoGET DEFICIT<br /><br />\nDr. Herman Oliphant Is<br />\nAppointed To Treasury<br />\nPost<br /><br />\n!.r 2;<br />\nwoiti<br /><br />\nAPproval Of S. A. C. President Needed For All<br />\n3oar<br />\nContracts<br />\nStu'<br />\n•ooru krANy<br />\nACTIVITIES<br />\nHa<br />\n' SUBMIT PETITIONS<br />\nstaff<br /><br />\nHas Written Songs Of<br />\nCraft And Other<br />\nVolumes<br /><br />\n—Courtesy Sun papers<br />\nDR. HERMAN OLIPHANT<br /><br />\nFORMER HOPKINS<br />\nPROFESSOR HONORED<br /><br />\nAt Levering Hall<br /><br />\nEmphasizing the fact that sociological and economic interests play<br />\na much more important part in separating groups today than does rereligion, Dr. Ivan E. McDoygle,<br />\nhead of the Department of Social<br />\nSciences at Goucher College, addressed a discussion group in Levering Hall last Wednesday.<br />\nDr. McDoygle, talking on group<br />\nsolidarity, pointed out that many<br />\nconflicts have arisen in the last century or two because people are coming in closer contact with each other,<br />\nand the old geographical separations<br />\n(Continued on Page 4, Col. 5)<br /><br />\nCHARLIE DAVIS<br />\nTO BE FEATURED<br />\nAT COTILLION<br />\nMae Armstrong, Popular<br />\nDeb, To Lead Grand<br />\nMarch<br /><br />\nThe Second Performance Of The<br />\nRUBY WRIGHT WILL<br />\nAPPEAR AS SOLOIST<br /><br />\nProduction Depends On<br />\nSeat Demand<br /><br />\n\"Newspapermen are crazy\", said<br />\nHenry Edward Warner of the Baltimore Sun before the freshmansophomore assembly yesterday. \"If<br />\nthe aeroplane that took the photographers to the scene of the Settle<br />\nballoon landing had been declared<br />\nbroken, unfit for use, and a deathtrap, the men would have gone<br />\nahead anyway.\" Thus he characterized the genuine reporter in action.<br /><br />\nThe approval of the president of<br />\niletic the S. A. C. will be necessary for<br />\nall advertising contracts. Henceforth budgets for all activities must<br />\nma<br />\nuz presented to the president of the Dr. Herman Oliphant Is<br />\nman<br />\nS. A. C. before that activity apNamed Special Council<br />\nTo U. S. Treasury<br />\nrobe Pears.<br />\n)arc', Further rules stress the payment<br />\nAppointment of Dr. Herman<br />\nLsso- of all<br />\nbills must be by check, and Oliphant, formerly profeAor of<br />\n:45,<br />\nthat all cash must be placed in the law in the Johns Hopkins Institute<br />\nLa'<br />\nhands of the treasurer of the S. A. of Law and recently general counsel of the Farm Credit Adminis120, C. immediately upon receipt.<br />\ntration, as \"general counsel to the<br />\nrobe<br />\nNew Members Considered<br />\nSecretary of the Treasury\" has<br />\nRecently many activities have ap- 'been announced by Acting Secret-01)e Plied for membership to the Coun- tary Henry Morg-anthau, Jr., of<br />\ners, Q.,<br />\nsubmitted. the United States Treasury DentrY 4, petitions having been<br />\npartment.<br />\nu<br />\nand, utstanding is the Interfraternity<br />\nLong recognized as one of the<br />\nart'. 130ard. In accordance with the new<br />\nforemost legal authorities of<br />\n120 rules, unless there can be some defiAmerica, Dr. Oliphant was one of<br />\n20. nite gain made by both the Council<br />\nthe four organizers of the Hopand Board, so that both will be benkins Law Institute. He had held<br />\n'1 efited by the Board's entering the the professorship of law here<br />\nsince 1928.<br />\ns C°Iincil, the Board will not be adVaried Career<br />\nillitted. This pertains to all other<br />\nBefore joining the Hopkins<br />\n°111:is and groups who desire memfaculty, he was professor of law at<br />\nb<br />\nership.<br />\nColumbia University for seven<br />\nConcerning these rules, Ted years, having gone there from the<br />\nStern, president of the S. A. C., an- University of Chicago, where he<br />\nflounced, \"If we can terminate the held a similar post from 1915 unYear without any deficit and our til 1921.<br />\nFor a time, Dr. Oliphant has<br />\ndebts are paid, the compulsory fee<br />\nbeen visiting professor at Leland<br />\nWill be abolished and an optional<br />\nStanford University and univer'1311e will be in force next year.\"<br />\nsity lecturer at the University of<br />\nTexas, director of the Institute of<br />\nLaw in New York and associate<br />\nAnnual Dinner Will<br />\ndirector of research of the New<br />\nBe Held Wednesday York<br />\nCommission on the Admin°reign Students To Be Addressed istration of Justice.<br />\nA former president of the AssoBy Price And Tsiang At<br />\nciation of American Law Schools,<br />\nMid-Week Meeting<br />\nhe was one of the group which<br />\nand edited the Ameriorganized<br />\nThe Eleventh Annual Internacan Bar Association Journal. Duriti°flal Thanksgiving Dinner, given<br />\ning the World War he was assistthe Friendly Relations Commitant director of the War Trade<br />\ntee of the Johns Hopkins \"Y\", will Board and later was connected<br />\nbe held Wednesday evening, Oc- with the Emergency Fleet Cortc,ber<br />\n29 at 6:30 p. m., at Lever- poration.<br />\ning Rail.<br />\nThe gathering will, in the course Discussion Group<br />\nHears Dr. McDoygle<br />\nflf the evening, hear the greeting<br />\nfr°111 C. W. Price, president of the<br />\nC°stnopolitan Club, and I. M. Tsi41g, president of the Chinese Club.<br />\nbr. Paul M. Wheeler will make the<br />\nbadolress. Music will be furnished<br />\nY Mrs. Margaret Rabold and Miss<br />\nClara Ascherfeld.<br />\n1\\11iosts and hostesses—Rev. and Mrs. H.<br />\npe. Arrowsmith, Dr. and Mrs. Ernst<br />\nDr. and Mrs. E. B. Mathews, Mr.<br />\nMrs. W. R. McClayton, Mr. and<br />\nkorL<br />\ns. A. E. 0. Munsell, Mr. and Mrs.<br />\nrt Wagner, Rev. and Mrs. F. C.<br />\nl eYnOlds, Dr. and Mrs. E. A. Schaal,<br />\nancl' and Mrs. T. Guthrie Speers, Dr,<br />\nMrs. - 0. Spencer, Mr. and Mrs.<br />\nw MiltonJ.Wagner,<br />\nJr., Mr. and Mrs.<br />\nSo_ 8. Cassell, Mr. and Mrs. Wm. C<br />\nutneiser.<br /><br />\nPopular Orchestra Leader<br />\nTo Play At Cotillion<br />\nDance<br /><br />\nIS WELL-KNOWN<br />\nDUMMY TICKETS<br />\nCORRESPONDENT<br />\nALREADY ON SALE<br /><br />\nCompulsory Fee To Be Abol•<br />\n'shed If Deficit Is<br />\nRemoved<br /><br />\nIn accordance with a new set of<br />\nrobe t<br />\nrnergency regulations necessitated<br />\nDub.,<br />\n.<br />\n:rica uy the recent cut in appropriations,<br />\n:act° all contracts in which the activity<br />\nConcerned is in debt must be ap120. proved by the Student Activities<br />\n.hatt Council. Without the sanction<br />\n3:30, of<br />\nthese contracts by the Council,<br />\n120,<br />\nContracts will not be valid.<br />\nitarY<br /><br />\nPrice, 5 Cents<br /><br />\nSpeaks Under Auspices Of Characters Of Chicago Mayor<br />\nPi Delta Epsilon<br />\nAnd Gangster Shift<br />\nFraternity<br />\nTheir Roles<br /><br />\nthose<br /><br />\n,rro<br />\nLa'<br />\nloard<br /><br />\nASSEMBLY HEARS \"FRONT PAGE\" CAST<br />\nHENRY E. WARNER NOW COMPLETE AS<br />\nNOTED JOURNALIST ROLE IS CHANGED<br /><br />\nANNUAL THANKSGIVING<br />\nDINNER — FRIENDLY<br />\nRELATIONS COMMITTEE<br />\nLevering Hall, Nov. 29. 6:30.<br /><br />\nPrice On Tickets Bought<br />\nMaking complete the cast for the<br />\nAt Door Are Raised<br />\nBarnstormer production \"The Front<br />\nPage\", Gerald Branower was<br />\nAnnouncing that the prices on<br />\nchanged from his former role of<br />\ntickets will in all probability be inLooie, to that of the Mayor of Chicreased if they are secured at the<br />\ncago, while Jack Levine was chosen<br />\ndoor the night of the dance, members of the Cotillion Board advise<br />\nto take the part of Looie, it was anCHARLIE DANIS<br />\nthat<br />\ntickets should be purchased imnounced by Howard Caplan and<br />\nCourtesy, The Blue Jay<br />\nmediately. They can be secured<br />\nWilliam Banks, the coaches of the<br />\nfrom any member of the board or<br />\nJournalists Are Born<br />\nproduction. The other roles, which<br />\nin Levering Hall. Prices including<br />\nThe majority of college students include Squire, Criblet, and Watkins<br />\ntax are $2.75 per couple, and $2.20<br />\nstudying journalism will never see<br />\nas the leading masculine characters,<br />\nstag.<br />\nany newspaper service, Warner beand<br />\nForsythe<br />\nKatherine<br />\nMisses<br />\nand<br />\nNewest of the Columbia radio<br />\ngan. The true reporter has the<br />\nspirit in his blood, and no education Jeannette Sauters as the feminine Drs. Chinard And Hollander favorites, Charlie Davis will<br />\nat the higher institutions of learn- stars, will within all probability reTo Address Friends<br />\nbring his versatile dance band to<br />\ning will serve to ncrease his ardor. main as announced in Tuesday's isOf Library<br />\nBaltimore to play at the ThanksWarner ponted to his own life as sue of the NEWS-LETTER.<br />\ngiving Cotillion, the board anRecent additions to the Univeran illustration of this.<br />\nSale Of Dummy Tickets Begun<br />\nsity Library will be the subjects nounced.<br />\nIn his first year of college, he<br />\nThe drive for the sale of dummy of Drs. Gilbert Chinard,<br />\nRuby Wright Featured<br />\nwas expelled, he said, and during<br />\nprofessor<br />\nalready<br />\ntickets<br />\nbegun,<br />\nhas<br />\nand<br />\nthe<br />\nof French and comparative literaRuby Wright will be the featured<br />\nthe next two years of his life, be<br />\nput out his own little sheet, called tickets may be procured from any ture, and Jacob H. Hollander, soloist appearing with Charlie<br />\nthe University Sun—editing, man- member or candidate of the Hutzler professor of political Davis' Orchestra. This band has<br />\naging, reporting, and performing business staff of the Barnstormers. l'economy, when they speak at a played at the Hollywood Restauall functions. In this paper, he<br />\n'tea and exhibit of economic rant in New York, and comes to<br />\nThe drive has been started this<br />\ncrusaded against an illegal race track<br />\n'classics to be given here for the Baltimore directly from the Netherand an illegal road-house, and suc- early in the season with the hope Friends of the Library on Decem- land Plaza Hotel in Cincinnati.<br />\nceeded in both ventures. At that that, if sufficient returns are real- ber 7th.<br />\nKnown to variety and motion<br />\ntime, he claimed, he was eleven years ized some time before the date of<br />\nWhen the 172 members of the picture houses throughout the naold.<br />\nthe performance, it will be possible Friends of the Library assemble tion as the maestro with the milMr. Warner made several re- to present the show twice at the for this meeting, which will be lion dollar smile, Davis turned all<br />\nheld in Gilman Hall at 4:00 his vitality and experience into<br />\nmarks about the influence of the Maryland<br />\nCasualty, instead of once<br />\npress on public opinion. He ado'clock in the afternoon, Thurs- developing a dance band for one<br />\nas is the present plan.<br />\nvanced the idea that the newspapers<br />\nday, December 7th, Dr. Chinard of Broadway's most critical night<br />\nBest Seats For Dummy Tickets<br />\nhad little effect on the election of<br />\nwill speak on the rare \"Ephemer- clubs, the famed Hollywood ResThese<br />\ndummy tickets, which are ides\" of Du Pont de Nemours, taurant, where his music won<br />\nMr. Hoover in 1928 and of Mr.<br />\nRoosevelt in 1932. However, there priced at 25c and $1, will entitle while Professor Hollander will great favor with the smart New<br />\nis great power in the editorial col- the holder to the best tickets in the discuss the special treasures of York crowd as well as with the<br />\numns, he asserted, and if handled house, when those tickets go on sale the Hutzler collection.<br />\nout-of-town visitors who were atwithout the proper precaution, they Thanksgiving night. The student<br />\nDr. Chinard To Speak<br />\ntracted to the Hollywood by his<br />\nwill prove dangerous.<br />\nIn his talk on the \"Ephemer- excellent and well-balanced air<br />\nwho possesses a S.A. card will be<br />\nDuring the course of his talk, Mr. able to procure a special non-trans- ides\", Dr. Chinard will give an programs over the Columbia BroadWarner read several bits of light ferable ticket for 25c upon the pre- account of the history and value casting System network.<br />\nverse from his volume, Songs of entation of his card. He will have of this French political series of<br />\nWith such well-known artists<br />\nthe Craft, to illuminate the journal- to procure this ticket himself, and old periodicals and will relate the as Frankie Parish,<br />\nthe boyish<br />\nistic life.<br />\nwill not be able to procure more manner in whch the work was ac- tenor; Cuffy Morrison, the bariMr. Warner was introduced by than one special ticket, although he quired last August in France.<br />\ntone with a trick in his voice for<br />\nHyman Levin, well-known figure in may have several S. A. cards. Fra- Purchased for the University with<br />\nevery octavo he sings and Harry<br />\ncampus journalism and president of ternities will not be able to send one funds contributed by the Friends<br />\nDizzy, the hottest trumpeter this<br />\nthe Pi Delta Epsilon, under whose man to buy all the tickets, although of the Library, this historical ac'side of the Atlantic—the band afauspices the assembly was held.<br />\nsections may be reserved.<br />\ncount will be of appropriate inter- fords an excellent variety program.<br />\nest to them, it was announced.<br />\nAdd to this Charlie Davis' Notre<br />\nThe \"Ephemerides\", originally Dame trained voice and his ability<br />\nin the possession of an old private on the piano as well as the trumpet,<br />\nfamily in France, whence it came and the reason for the sudden<br />\ninto the hands of a French book- popularity of this accomplished<br />\nseller and thence to Dr. Chinard, musical unit is apparent.<br />\nShelley A Metaphysical Poet, Spenser Just A Name To is a rare collection<br />\nof copies of<br />\nThe grand march, held at midErudite Gents; Homewood Litterati Misplace<br />\nthe French parallel of the English night, will be led by Miss Mae<br />\nThe Renaissance<br />\n\"Spectator\" papers and was the Armstrong, guest of honor and a<br />\nSometimes people want to know was rather discouraging, because printed organ of the Physiocrat debutante of the present season, and<br />\nsomething about English litera- even we knew that that gentleman party in France during the latter Mr. Harrison K. Russell, president<br />\nture. Sometimes they come down flourished about 150 years after half of the 18th century. As the of the Cotillion Board.<br />\nto the NEWS-LETTER office and ask the period of poets in which we Physiocrats' periodical, it is an<br />\nNo Dance Tomorrow<br />\nembarrassing questions about it, were interested. We gave up our excessively valuable file of jourOwing to the fact that a free tea<br />\ntoo. So rather than allow our- oracle and looked around further. nals, the only other collection in dance will be given tomorrow afterthe country being at Yale.<br />\nselves to remain in a state of igThey were pretty easy to find:<br />\nProfessor Hollander's topic will noon in Levering Hall, there will be<br />\nnorance, we compiled some of In a few minutes we were plying<br />\nno dance tomorrow night.<br />\nthese questions, decided what the another with the query, \"In what be the Hutzler collection, which The Board has also announced that<br />\nanswers were, and set out to ver- period did Dryden live?\" \"Eight- at present consists of approxi- fraternities and other groups may<br />\nmately 4000 books and tracts<br />\nify our solutions.<br />\neenth century\", he snapped, just dealing with economic thought obtain table reservations when they<br />\nOf course it wasn't very hard like that. We figured that this<br />\nand history of the past. Started purchase their tickets.<br />\nto think of a source of informa- was a close enough guess relative<br />\nas a collection 30 years ago, it \"Blue Jay\" Board<br />\ntion: the most prominent one at to a Stuart poet, who died in 1700.<br />\nwas made possible by the contrithe moment happened to be the We ventured further: \"What did<br />\nPicks New Members<br />\nbution of funds by Mr. David<br />\ngroup of newly-elected Tudor Spenser write?\" He gulped, and<br />\nEdgar Kemler, Kenneth ZierHutzler, Mr. Abram G. Hutzler,<br />\nand Stuart Clubmen. Surely, if began muttering that he had to<br />\nler,<br />\nS. Daniel Eigenbroder and<br />\nothers;<br />\nsomewhat later, it was<br />\nand<br />\nanyone would know the answers, get his lunch, and remained nonEdward<br />\nJ. Kirschbaum were<br />\nendowed by the two Hutzlers, this<br />\nthese young savants would.<br />\ncomittal. Mental pictures of first endowment having made possible elected to the editorial staff of<br />\nGhost of Shelley Maligned<br />\neditions of Spenser lining the the constant addition of new the Blue Jay at a recent meeting<br />\nSo we cornered one of the dis- walls of the Clubroom flashed be- works to the collection, which is of the Board of Control. James<br />\ntinguished group. \"Name us a fore us, and we sighed. But yet housed as a single unit in the Bealmer was appointed to the<br />\ncouple of metaphysical poets,\" we undaunted we continued, \"Name Seminary of Political Economy in photographic staff.<br />\nsuggested. \"Well,. \"he looked the first Stuart ruler.\" He was Gilman Hall.<br />\nAdditional elections to the art<br />\nstartled. \"There was Shelley, for floored; he swallowed a lump in<br />\nThe main fields represented in and photographic staffs will be<br />\none . . .\" and he balked. That<br />\n(Continued on Page 2, Col. 6)<br />\n(Continued on Page 3, Col. 3)<br />\nmade during the year.<br /><br />\nWILL SPEAK AT<br />\nLIBRARY EXHIBIT<br /><br />\nTudor And Stuart Initiates<br />\nFloored By English Queries<br /><br />\n2<br /><br />\nHOME WOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br /><br />\n'he IlewsolLetter<br />\nFOUNDED 1897<br /><br />\nSubscription per year<br />\n$2.00<br />\nBy Mail<br />\nRemit subscription fees to John Myers, treasurer, Student Activities<br />\nCouncil, Gilman Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice<br />\nin Baltimore, Md., under the Act of Congress, November 3, 1879.<br />\n'<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns Hopkins University.<br />\nMember of The Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States and of The National College Press Association.<br />\nOffice Phone<br />\nEditor's home phone<br /><br />\n7383<br />\n__liberty 1714<br /><br />\nBusiness communications should be addressed to the Business Manager, Johns Hopkins University. All articles and communications pertaining to the editorial department should be forwarded to the Editorin-Chief, Johns Hopkins University.<br />\nEDITORIAL DEPARTMENT<br /><br />\nBUSINESS DEPARTMENT<br />\nEditor-in-chief<br />\nBusiness Manager<br />\nNorman S. Heaney<br />\nManaging Editors<br />\nEdgar S. Blumstein<br />\nMartin Perlmutter<br />\nAdvertising Manager<br />\nMillard Langfeld<br />\nAssistant Managing Editor<br />\nRay Goldberg<br />\nRichard Feise<br />\nCirculation Manager<br />\nStanley Blumberg<br />\nJunior Editors<br />\nCharles Hastings<br />\nMelvin Goldberg<br />\nAdvisory Editor<br />\nOffice Manager<br />\nHyman Levin<br />\nBert Gordon<br />\nSports Editor<br />\nLeonard Wallenstein<br />\nIrvin Blum, Harold Kantrow,<br />\nReporters<br />\nBert Prager, Allen Delevett,<br />\nIrving Lottman, Carson Frailey,<br />\nGeorge Paver, David Levy,<br />\nSylvan D. Solarz, Fred Bang,<br />\nA. Edelman, Carl Hartman,<br />\nLeonard Harris.<br /><br />\nit is in the case of our 14-7 loss to Lehigh. But the<br />\nPenn State and U. of M. encounters are in a far<br />\ndifferent category.<br />\nOur sports-columnist summarized the situation<br />\nvery neatly last Tuesday in discussing the relative<br />\nsources of material for the teams. Hopkins depending upon the local talent, and the other schools importing players. But the reason for keeping these<br />\nsuperior teams on our schedule may be more than a<br />\nmere matter of tradition. We have burdensome presentiments that the financial aspect charms the minds<br />\nin the athletic office.<br />\nTrue enough, no team can survive without adequate financial backing—at least of some sort. But<br />\ndoes that necessitate the subjecting of our light-weight<br />\nand insufficiently-trained players to all sorts of physical beatings by stronger teams? After nearly every<br />\ngame which has .been in any degree hotly contested<br />\nthe players have come out very much battered up,<br />\nmore so than usual or necessary. The responsibility<br />\nfor winning the game rests upon two or three star<br />\nplayers whom the coach dare not remove from play,<br />\nand they are in constant danger of grave physical injury. Don Kelly may not play any basketball this<br />\nyear because of his wrenched back; Pete Reynolds is<br />\ndefinitely out of further athletic activity; Bill McClean is in none too good a state.<br />\nSome of this injury is due to the poor equipment<br />\nused. The pants and helmets are notoriously deficient in padding and have not been replaced for a<br />\nlong time. A little of the profits made on these \"big<br />\ngames\" might be invested to good advantage in protecting the life and limb of the team. But that is not<br />\nthe salient fault; the trouble is that these heavier<br />\n, teams should appear on our schedule at all. Athletics<br />\nafter all are meant for enjoyment and constructiveness in health for the participants, and not to turn out<br />\nwinning machines. According to the present arrangements the team does not prepare for the next game;<br />\nit merely tries to recover from the last one in time<br />\nfor its next punishment. It's a sort of a glorified<br />\ngladiatorial circus.<br />\nIf we can ever separate the athletic department<br />\nfrom the emphasis which it places upon the financial<br />\nend of the work we will have achieved the most notable advance which has been made in sports at the<br />\nHopkins in years. The primary consideration, we<br />\ninsist, is not the gate but the assurance that when<br />\nthe game is over there will be eleven men who are<br />\nfairly sound. in body and not the victims of some<br />\ncomplicated injuries which may cripple them for life.<br />\nIt's not worth the price.<br /><br />\nJ. H. U. Man Invents Totalisator<br />\nFor Automatic Horse Betting<br /><br />\nAt The<br />\nPlayshop<br /><br />\nHenry Straus, Hopkins Graduate And Former Instructor, Two more 'performances of Oef4<br />\nFinds His Electrical Device A Great Success<br />\n\"Blind Man's Buff\", \"Fatti Mas<br />\nschi Parole Femine\", and of<br />\nAt Pimlico Track<br />\nOne more Johns Hopkins man<br />\nhas attracted widespread praise in<br />\nthe world and has climbed the ladder of success. This man is Mr.<br />\nHenry Lobe Straus, and his most<br />\nnotable achievement is his invention<br />\nof the totalisator, an electrically controlled, automatic, betting device<br />\nwhich recently made its Eastern debut in America at the Pimlico racetrack.<br />\nMr. Straus, a native of Baltimore,<br />\nreceived his Bachelor of Science degree in the School of Engineering<br />\nhere in 1917, after having graduated from Baltimore City College.<br />\nIn the scholastic year 1919-20 he<br />\nalso was an instructor in mechanical<br />\nengineering at the Hopkins, and he<br />\nis now a successful consulting engineer here in Baltimore.<br /><br />\nutilized. The universal approval it<br />\nreceived there led to its introduction<br />\nto America, and it got its first<br />\nchance at Arlington Park, Chicago,<br />\nlast summer. Its success there was<br />\ninstantaneous, and it just recently<br />\nwas installed at Pimlico. That it<br />\nmet with the highest approval there<br />\nof all concerned is shown by the<br />\nfact that Mr. Straus has received a<br />\ncontract to install his invention at<br />\nthe Tanforan track in California,<br />\nand the machine is now in use at<br />\nHialeah Park in Florida. The universal success of the device is assured, and Mr. Straus is soon to<br />\nleave for the West Coast with his<br />\ncrew of mechanics to install it at<br />\nother tracks.<br /><br />\n\"Rosemund on the Tracks\" will be<br />\ngiven at the Johns Hopkins Play 111e(<br />\nshop in the Homewood Theatre<br />\nFriday and Saturday evenings a<br />\n8.30 P. M.<br />\nI.4011<br />\n\"Blind Man's Buff\" is a medieval<br />\nFrench comedy and the old story Of<br />\nthe girl who prefers to marry a poor<br />\ncount rather than yield to her father's demand that she wed his choice<br />\nA happy ending, however, finds the<br />\ndaughter married to the poor count<br />\nand her father's choice, the cook<br />\nwedded to the daughter's maid.<br />\nCast Of Play<br /><br />\nThe cast of the play is as follow!:<br />\nWalter Brecker ; father, Hugo<br />\nWeisgall; daughter, Evelyn Macht'<br />\nFriday, November 24, 1933<br />\ncount, T. N. Magill; maid, Mary<br />\nAlbey.<br />\nMachine Works Rapidly<br />\nA Welcome Breather<br />\nIn \"Fatti Maschi, Parole Ferry<br />\nThe actual operations of the toWe read in the last issue of THE NEWS-LETTER<br />\nme\", Yolanda (Evelyn Kairis),<br />\ntalisator are unusually complex, but,<br />\nthat next Spring the first conference of world chemHobby Is Sports<br />\nbeautiful daughter of Count Rene'<br />\nin effect, the machine acts as the<br />\nists since the War will be held in Paris. The passion<br />\nAlthough engineering in his pro- race track's mechanical bookkeeper, to (Arthur Gutman) is still withfor conclave is no respecter of persons, apparently,<br />\nfession, his hobbies are outdoor flashing the official odds and total out an acceptable suitor. Then the<br />\nand we are doomed to another lengthy report of<br />\nsports and horses, and he has de- amounts of money bet on the races hero appears in the person of 3<br />\nprocedures.<br />\nvoted many years to the pursuit of in electric lights. Betting in the brave, dashing, impetuous page<br />\nThere's a bright side to the affair, however; one<br />\nthem. He is a member of the \"tote\" is considerably different from (John De Hoff). The page engages<br />\nwhich should cause us young fellows no little satisfacMaryland Jockey Club, and breeds betting in the old-style mutuel de- in a game of chess, the prize of<br />\ntion. That is the consideration that, while the learned<br />\nthoroughbred horses, on a modest partment. The speculator calls for which is Yolanda's hand in mar'<br />\ngentlemen are in conference, they are not experimentscale, at his Cherry Hill Farm near his ticket by number, instead of by riage. He is a poor player, but hav'<br />\ning, and it may be that thus we shall be spared a<br />\nReisterstown. Because of his fond- name. When the ticket seller presses ing already won Yolanda's love, he<br />\nfew death-dealing gases. We have feared for a long<br />\nness for horses, he was naturally a button, a freshly printed receipt succeeds in winning the game also,<br />\ntime that there would be no end to their efforts to<br />\nEvoking the most applause and<br />\ninterested in the \"Sport of Kings\" pops out of the machine in front of<br />\noutdo one another in developing instruments of human<br />\nappreciation,<br />\nhowever, was the far'<br />\nand often went to the races. And him. As each bet is made, it regisdestruction. But a short respite from their labors<br />\ncial<br />\ncomedy,<br />\n\"Rosemund on the<br />\nit was after some years of attending ters in the machinery, and by this<br />\nmay give them a little time to observe the war spirit<br />\nTracks\",<br />\nby<br />\nDr.<br />\nAlbert K. Wein'<br />\nthe races on the Maryland tracks the odds are posted. The enormous<br />\nso rife about them and cause them to divert their<br />\nberg.<br />\nand noticing the inaccuracies of the operations of which the machine is<br />\nattention to a saner field of endeavor.<br />\napproximate-odds boards, that Mr. •capable are shown by the fact that<br />\nRudolf, played by Charles Rip'<br />\nAs a matter of fact we'd far rather they'd stop<br />\nStraus conceived the idea of the it worked smoothly and quickly on in, is the melodramatic villain who<br />\ndiscovering the infernal stuff. The prospect of war<br />\ntotalisator.<br />\nis far too appalling as it is, without the added indeterthe opening day at Pimlico, although is determined to have his way with'<br />\nminate factor of what's going to kill you. We're not<br />\nMr. Straus took his embryonic over 10,000 persons were present a virtuous girl (Kitty Forsythe) or<br />\nparticularly cheered up by the suggestion that these<br />\nplan to one of the high authorities and the betting went past the $280,- tie her to the railroad tracks. At the<br />\nin<br />\ngases are instantaneous and sure; that's a desolating<br />\nMaryland horse racing, and was 000 mark. And the machine wasn't last minute the brave hero (Lerol<br />\nthought at best.<br />\nWe believe that Willard Harell, the Georgia encouraged to develop it; but it was worked at anything near its maxi- Suger) rushes in to save Rosamond<br />\nfrom her doom. The comedy ends<br />\nNo; it would be far better if the chemists could gigolo, was entirely psychic when he lent Miss M—. in England that his idea was first mum speed.<br />\nhave one big perpetual conference. Let them keep Hopkins student, his bedroom key instead of the key<br />\nwith the heroine informing the<br />\non talking about colloidal precipitates, bases and salts, to his laboratory.<br />\nlain that he may see her again after<br />\nand what not. Those phenomena, at least, don't sound<br />\n0-0<br />\nshe is safely in the bonds of holY<br />\nso fatal, and we'll need a good deal of bolstering up<br />\nThe contents of the liquor served by the Phi<br />\nmatrimony.<br />\nof our spirits if we're to be mobilized to protect Psi's to the freshmen at their open house was eviAt the University of Washington,<br />\nSpectacular<br />\nentrance:<br />\nFlying<br />\nto<br />\n—S. L.<br />\nour homes. And besides, if their uninterrupted labors dently a mixture of Mason Morfit's old tennis shoes,<br />\nsince the War have been pursued diligently the drainage from O'Dunne's car, and some of Tommy co-eds have a special section for the Davis and Elkins game in a paschances are that they've already discovered enough Dukehart's packs of cards. Before long the Cane \"bachelor girls\" at football games senger plane, the New River Colgases to kill us off in a minimum of time; that ac- Club will do anything to get a formula as tasty as this season—just so the men can lege's football captain leaped from<br />\ncomplishment in itself earns them a holiday.<br />\n•this.<br />\ntell who's who.<br />\nthe plane when over the field and<br />\n0-0<br />\n* *<br />\nparachuted down to position just<br />\nThe D. U.'s don't know it, but Lou Lynn, the<br />\nin<br />\ntime for the game.<br />\nA<br />\nfew<br />\nwise<br />\nwords<br />\nfrom<br />\nThe<br />\nCash vs. Physical Injuries<br />\nsmoothest orchestra leader at the High-Hat Club is<br />\nEditor, THE NEWS-LETTER,<br />\n* * *<br />\nSpectator:<br />\n\"I<br />\nbegin<br />\nto<br />\ndoubt<br />\nthe<br />\nWith only one game left to play on the current a D. U. from Miami.<br />\nJohns<br />\n.Hopkins University.<br />\nvalue of wasting time in college.\"—<br />\no—o<br />\nA \"no shave\" club was organized<br />\nfootball schedule and that comparatively unimporSir:<br />\nSpeaking of orchestras, the I. N. A. dance pro- John Jacob Astor III.<br />\ntant as far as our present purposes are concerned,<br />\nat Indiana University. Members<br />\nI wish to express my opinion of<br />\nwe can look back upon the season with the benefits duced a good little orchestra—the Ramblers. Pres* * *<br />\nhave pledged not to remove their<br />\nof hindsight in our favor. Our attention is attracted ident Levin was covered with glory and somebody's<br />\nthose<br />\ngallant gentlemen of the cobeards<br />\n.until<br />\nthe<br />\nfootball team wins.<br />\nThe College Eye informs us that<br />\nchiefly to the three overwhelming defeats which the dress after the ball was over.<br />\ntillion<br />\nboard who so daringly place<br />\n*<br />\n*<br />\n*<br />\nrumors are circulating to the effect<br />\n0-0<br />\nteam underwent, namely, at the hands of Swarthmore,<br />\nautos,<br />\nOne of the professors at the Uni- advertisements on Students'<br />\nPenn State, and U. of M.<br />\nA political upheaval was seen in the offing as that a \"We Ain't Been to the<br />\nIt<br />\nmight<br />\nthat<br />\ninterest<br />\nthem<br />\nto<br />\nknow<br />\nIt is not a disgruntled feeling which singles out Vice-President Pietsch of the Freshman Class placed World's Fair but We Have Heard versity of Nebraska states that love,<br />\nI<br />\nam<br />\nnot<br />\nrunning<br />\nmy<br />\nauto<br />\nas<br />\nall<br />\na<br />\nthumb<br />\ntack<br />\nin<br />\nthe<br />\nchair<br />\nin<br />\nwhich<br />\nBoss<br />\nJohn S. All About It\" club will be formed dumbness and faculty intelligence<br />\nthe defeats instead of the victories for our attention.<br />\nRather it is the nature of the teams which admin- Wright was subsequently to sit. Pietsch has drawn the for the convenience and protection are the reasons for freshmen flunk- advertising agency and it might also<br />\nistered the drubbings. Losses by A three- and four- first blood but we expect that Boss Wright will soon of the small minority that stayed ing<br />\ninterest them to know that those<br />\nout of courses.<br />\ntouchdown margin signify something more than a get things in hand.<br />\nyellow stickers are anything but 3<br />\nat home last summer.<br />\n* * *<br />\no—o<br />\nmere adverse turn in our luck. It is absolute proof<br />\nthing<br />\nof beauty. It seems strange<br />\n* * *<br />\nWooden head puddin' head Schwartz made a<br />\nthat we are outclassed. In the case of Swarthmore,<br />\nDesiring employment, some men<br />\nthat<br />\nthese<br />\nyellow stickers are not<br />\nperhaps, the situation is only temporary. It may be _buck and a half by swimming around the duck pond<br />\nL. L. Davison, physicist at St. at Harvard are enrolled in a social<br />\nplastered<br />\non<br />\nwindshields while the<br />\nthat next year we'll beat them just as badly, and so this week.<br />\nMary's University in San Antonio, register whose business it is to furowners are present, so that they mal<br />\nTexas, has discovered that falling nish male escorts to \"deb\" parties.<br />\n'express their opinions of those gal'<br />\nhair is caused by drinking water They hold, business before pleaslant gentlemen also.<br />\nbefore going to bed. Cheer up! ure, first, last, and always.<br />\nA VICTIM.<br />\n* * *<br />\nThere'll soon be a good substitute.<br />\nBy Millard Langfeld, Jr.<br />\n* * *<br />\nThe University of Dayton goes<br />\nSIX WEEKS OF GRACE<br />\ntangle resulting from which is now before the<br />\nNorth Carolina State claims that one better than an All-American<br />\nTHE PRESIDENTIAL honeymoon is rapidly country.<br />\nsome of their freshman football football team. On the squad are<br />\nAnd so Mr. Roosevelt faces six short weeks of<br />\ndrawing to a close. Slightly less than six weeks are<br />\nyet to pass before the quiet of capitol hill will be rent freedom. And after that the deluge. The test will players have the hardest names in Swedish, Polish, Scotch, Irish,<br />\n(Continued from Page 1, Col. 5)<br />\nby the clamor of solonic philistines bent on adminis- be if, in those racing hours yet remaining, he can the United States to pronounce. Lithuanian, Australian, Hebrew,<br />\nthe collection are English eco'<br />\nsomehow manage to cinch the major projects of his Some of these are Sarin, Ryneska, French, German, Dutch, Slavic and<br />\ntrtive prey. And there are rich pickings to be had.<br />\nnomic history since the time 01<br />\nIt is now close to seven months that the Roose- program conclusively as to snatch them from the Matys, Chiemiego, Spitalnich, Jak- Hawaiian representatives.<br />\nthe great English economist,<br />\n* * *<br />\nvelt regime has reigned untrammeled and unham- peril soon to gather down the Avenue. It's an in- wich, Gershowitz, Schoolsburg,<br />\nAdam Smith. Most of the iterns<br />\npered in the city of the Dome. And those seven teresting prospect.<br />\nWe learn, through the Brown in the Hutzler collection are rar'<br />\nIstvaan, Kubesa and Reinesch. Pity<br />\nmonths have witnessed a wielding of power and trend<br />\nWHAT PRICE FREEDOM<br />\nand White, of a Los Angeles pawn ities, it being particularly rich ill<br />\nthe radio announcer!<br />\nof policy unique in executive annals. Gone are nu*<br />\n*<br />\n*<br />\nAMIDST all the clamor which marked the relegashop which boasts of 15 fraternity tracts on the controversies over<br />\nmerous old restrictions on the White House hand, tion of the Noble Experiment to the dead past, no<br />\nthe Factory Acts, Poor LaW,<br />\nThe S. S. California, anchoring pins.<br />\ngone are consecrated customs and governmental voices were raised louder than those who acclaimed<br />\nChartism, and the India Corn'<br />\n* * *<br />\n\"rules\". And gone are countless other time worn repeal as the end of racket rule, the death knell of just off shore for the occasion, was<br />\npally. In recent years important<br />\nA bit of humor from the Sou'<br />\nthe scene of the Junior Prom at<br />\nusages, so dear to the congressional heart.<br />\npamphlets on earlier periods have<br />\nthe bootlegger and the \"speak\", the mass return of a<br />\nwester: \"She was only an opti- been added, some of these belong'<br />\nSanta Clara University.<br />\nInstead, Lady Nira rules a kingdom of rebel- people to liberty under law.<br />\n* * *<br />\ncian's daughter-2glasses and she ing to the 16th century.<br />\nlious change. And the gentlemen of the Senate and<br />\nAnd yet it is to be wondered. Not a paper comes<br />\nthe House are slow to respond to change. Many off the press which does not proclaim new taxes, new<br />\nLehigh has acquired a freshman made a spectacle of herself.\"<br />\nThe collection contains a begin'<br />\nmeasures of the past few months have been put into regulation, new restrictions to the liquor trade. Na- who gets a great kick out of swim* * *<br />\nfling made in the econornlc<br />\neffect through presidential weight alone. Disappro- tional, state, city and county bodies vie with one an- ming<br />\nThe Miami Student claims that thought of France and German'',<br />\nin the pool wearing a waterbation has been general along the legislative front. other in concocting a labyrinth of rule which a hardy<br />\nAmerica<br />\nproof wristwatch—and does he girls going through college call- and, to some extent, in<br />\nBut there was nought to do.<br />\nlegal mind must tread in uncertainty and dread.<br />\nThere is also a section which ell'<br />\nget a laugh when everyone yells ing fraternity emblems \"frat\" pins<br />\nTo further complicate the scene, many acts have<br />\nSuch administrative machinery is expensive.<br />\nbraces the translations of the<br />\nthus far fallen far short of success. Especially is this Again, new taxes and still higher retail costs. And to him that he has forgotten to are a trifle{ less desirable than fluential English economic clas5'<br />\ntake off his watch.<br />\nthose who say \"fouhternity\" pins. ics into other languages.<br />\ntrue of the gold-purchase-dollar-cheapening plan, the then?<br /><br />\nCampus Brevities<br /><br />\nIntercollegiate News<br /><br />\nLetters To<br />\nThe Editor<br /><br />\nFlashes<br /><br />\nTo Discuss New<br />\nLibrary Collectiart<br /><br />\nHOMEWOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br /><br />\nin JAY BOOTERS<br />\nIN SECOND GAME<br /><br />\nRifle Club Match Gouchers Students<br />\nTo Be Held On Plan Health<br />\nDecember 4<br />\nImprovement<br /><br />\nInterclass Wrestling Tournament Will Be Held<br />\nIn Near Future<br /><br />\nbefeat Calvert Hall At An interclass wrestling tournaMas•<br />\nment will be sponsored in the near<br />\nPatterson Park Last<br />\nof<br />\nfuture<br />\nby the Hopkins Wrestling Prizes Will Be Awarded Talks On Subject Will<br />\nMonday<br />\nill be<br />\nteam. All students interested in enIn All Classes For<br />\nAlso Feature \"Health<br />\nPlay<br />\nHigh<br />\nthe<br />\ntering<br />\ntourney<br />\nScores<br />\nWeek\"<br />\nare<br />\ninvited to<br />\nMcGILL SCORES ON<br />\n!atret<br />\nattend wrestling practice where they<br />\nPASS FROM LANG<br />\nWith a view of improving the<br />\nThe undergraduate rifle match<br />\nt,-s at<br />\ncan get more definite information.<br /><br />\nCoach Miller has issued a special sponsored by the Hopkins Rifle health of the student body, Goucher<br />\nlieval<br />\ncall for more candidates for the Club will get under way on Mon- College students have been given<br />\nKeeps Jay Record<br />\nTy of<br />\nwrestling team in the 118, 126 and day, December 4. The match will cards on which to chart their habits.<br />\nClean<br />\npoor<br />\n135-pound classes. The present be open to all undergraduates ex- The plan was evolved in connection<br />\nfatlY<br />\ncepting members of the rifle team with \"Health Week.\" Starting<br />\nThe newly organized Hopkins squad is weak in these weights<br />\nand will be fired in the prone posiManagers Planning Home Meets<br />\nlast Monday, the week is scheduled<br />\ns the soccer team won its second victory<br />\nThe managers are planning sev- tion only.<br />\nof<br />\nthe<br />\nHall<br />\nCalvert<br />\ndefeating<br />\nseason,<br />\nto end today.<br />\npunt,<br />\neral home meets as a special feaEach entrant will be allowed<br />\ncook, 1-0 at Patterson Park last Monday. ture of this year's schedule.<br />\nThe plan was sponsored by the<br />\ntwenty shots, ten for a practice tarbeadlocked at the half, the Jay forNo wrestling matches have been get, and ten to be fired on a target faculty committee on mental and<br />\nward line, led by Captain Lang, con- held at Hopkins in the past. Prac- signed by the entrant. Prizes will physical health, of which Dr. Jessie<br />\nowS: tinually kept the ball deep in Cal- tice is held daily in the barn at 4.15. be awarded for highest scores in L. King, professor of physiology, is<br />\nseveral classes such as: new club chairman, and by the department<br />\n-lug° vert Hall territory until McGill<br />\nof<br />\nacht;<br />\nmembers, and men who have never physical training, directed<br />\nby Miss<br />\nfinally tallied on a pass from Lang.<br />\n'fired on a rifle range before.<br />\nviarY<br />\nEline von Borries.<br />\nAbout thirty candidates have been<br />\nExpense<br />\nNo<br />\nRobert Fechner, director of the<br />\nThe time spent in all activities<br />\nFenY Practicing daily in front of Levering<br />\nThe target may be fired on any during the day, the amount of sleep<br />\nemergency conservation work, aniris), Rall under the direction of Captain<br />\nnounced that 40,000,000 to 50,000,- afternoon of the week begining De- and the regularity of their meals are<br />\nenat- Lang. Most of the players have had<br />\n000 saplings would be planted on cember 4 and the range will be open included on the cards. The windwith' Previous experience, either on local<br />\ngullied and washed lands by Civilian from 1 to 4.30 each afternoon. Each up is to consist of a fashion show,<br />\n1 the<br />\ndubs or high schools. It is hoped Conservation Corps workers in the entrant should place on a slip of girls having the best postures being<br />\nof 3<br />\nthat games will be able to be ar- near future to aid in the control of paper his name, P. 0. box, and the selected as models.<br />\nPage<br />\nafternoons on which he could fire.<br />\nHealth Talks Featured<br />\nranged with nearby colleges, as well erosion in the Central and Southern<br />\nThis should be dropped in P. 0. During the<br />\nas several of the local high schools. States.<br />\nweek a series of health<br />\nC of<br />\nBox 1078, before Saturday, Decem- talks was presented to<br />\nThe<br />\ntrees<br />\nare<br />\nto<br />\nbe<br />\nplanted<br />\nas<br />\nthe students.<br />\nmar' The line-up:<br />\nber 2.<br />\npart<br />\nof<br />\nthe<br />\ngeneral<br />\nprogram<br />\nto<br />\nstop<br />\nAmong<br />\nthe<br />\nand their<br />\nspeakers<br />\nhay'<br />\nCALVERT HALL<br />\nHOPKINS<br />\nParticipation in this match in- subjects were:<br />\nhuge annual losses to farm owners<br />\nFreeburger<br />\na, he RartMari<br />\ndue to the washing away of the rich volves no expense to the entrant.<br />\nalso, ReYnolds<br />\nDr. Grace Baker on \"Mental<br />\nRF<br />\nLutz<br />\ntop soil during and after rains. The range is in the North Loft of<br />\nHealth\".<br />\nand Merson<br />\nL.F.<br />\nStevens<br />\nLosses from erosion run into hun- Gilman Hall.<br />\nfar ternheim<br />\nTribbill<br />\nDr. Llewellys Barker on \"The<br />\nL.H<br />\ndreds of millions of dollars annuThe Rifle Club has a record memthe Moravec<br />\nKnoerlein<br />\nDaily Round of Living\".<br />\nCH<br />\nally.<br />\nbership this year and will carry on<br />\nTeiw Powell__<br />\nMacklin<br />\nH<br />\nDr. Gertrude Rand on \"Lights<br />\na very active and interesting season.<br />\n0-0<br />\nMitchell<br />\nCasey<br />\nO.R<br />\nLighting\".<br />\nand<br />\nNine Georgia newspapers recent- Club membership includes the use<br />\nI.R.<br />\nErnst<br />\nRip' !in<br />\nMiss Ethel Maslansky on \"Some<br />\nly issued the regular editions on of the rifles and the range as well<br />\nwho McGill<br />\nMcDermott<br />\n_C F<br />\nAspects<br />\nof Nutrition\".<br />\ntargets<br />\nof<br />\nsupply<br />\nas<br />\na<br />\nand<br />\nbullets.<br />\nwit!, Lang<br />\nLangley newsprint secretly made from<br />\nIL<br />\nThe<br />\ndues<br />\nare<br />\nyear<br />\n$2<br />\nfor<br />\nper<br />\nnew<br />\nDr.<br />\nHuntington<br />\nWilliams on<br />\n)of Co rchran ________0.L<br />\nMorreck Southern pine trees as a demonstramembers<br />\n$1<br />\nfor<br />\nand<br />\nold<br />\nmembers.<br />\n\"The<br />\nCommon<br />\nCold\".<br />\ntion of closing the last link in Amert the<br />\nican<br />\ncommercial independence.<br />\n,eroY<br />\nAs<br />\nscentists see it, the link is the<br />\nlona<br />\nmanufacture from home resources<br />\nends<br />\nof newsprint and all the high-grade<br />\nviltntnerbacher And Billingslea, white paper. Newsprint now is an<br />\ntfter<br />\nannual business of about $140,000,High Scorers; Matches Held<br />\nholY<br />\nShutting our eyes we made a<br />\n000,<br />\nand two thirds of it is im- (Continued from Page 1, Col. 3)<br />\nEvery Wednesday<br />\nhis throat and grabbed desperate- last frantic effort to enlist the<br />\nported.<br />\nWith the loss of only one game<br />\nThe secret manufacture was un- ly at the arm of a passing student benefits of their higher knowl°lit of fifteen, Tau Alpha Phi is dertaken to answer the final thing and asked him. But the latter edge. \"What great political strugleading the recently organized which newspaper experts had as- worthy was a chem student and<br />\ngle occurred under the Stuarts?\"<br />\nIntra-fraternity Bowling League serted could not be done. They<br />\nonly shook his head blankly.<br />\nsaid<br />\nThe<br />\nanswer gave us food for<br />\nBritains Royal Line Scrambled<br />\nhe loop, composed of eight fra- American chemists could not make<br />\nSadly we turned from the scene thought. \"The Renaissance\", was<br />\nternities and organized five from Southern pine forests sulfite<br />\nof<br />\nhis discomfiture. This wasn't the solemn revelation. This called<br />\nWeeks ago, the teams playing its and pulp which could run at comwhat<br />\nwe needed at all. Yet we to our minds the gay and colorful<br />\ninatches every Wednesday at 4 mercial speed through a real paper°'clock. Cups will be awarded to making machine—not at the 750 or sought more members of the scenes during the time when<br />\n1 of the league winner and to the in- more feet per minute of paper pro- group. \"Were there actresses in<br />\nLeonardo and Michelangelo freco- dividual high scores.<br />\nduced from Northern spruce trees. Shakespeare's time?\" Yes, one asdace<br />\nsured us, and we fell to wonder- quented the court of Charles II,<br />\nThe best score for one game so<br />\nitos. far is<br />\ning how all the little boys in the and when Luther spoke every aft146, made by Hammerbach- Spiked Shoe Group<br />\nthat<br />\ncompanies had made their ernoon in Hyde Park.<br />\nWill Hold Meet Here stock<br />\n; ao el. and Billingslea, the...latter also<br />\nliving<br />\nin the Elizabethan Age.<br />\nholding the high three-game total<br />\nClever people, these Tudor-andalso<br />\nWhen<br />\npressed our demand as<br />\nwe<br />\nThe Johns Hopkins chapter of the<br />\n369. Tau Alpha Phi, the<br />\nStuarts. They write new history<br />\nlose l<br />\neague leaders, is in possession of National Collegiate Society of to the name of the first Stuart and exhibit astounding intellecIt 3<br />\nSpiked Shoe is holding its second ruler, one erudite Clubber abso- tual fearlessness in attacking our<br />\nLnge all the high team scores.<br />\nThe standing of the team after annual Scholastic cross-country meet lutely declined to be relevant, but old literary traditions.<br />\nnot<br />\ninstead proposed Elizabeth, and<br />\nat Homewood on Saturday.<br />\nthe W ednesday's play<br />\nA TIP FOR'STUDENTS<br />\nL.<br />\nW.<br />\nBoth the Nott Terrace and Mount spoke of her close relationships<br />\nrug<br />\nStudents who are able to review com'ran Alpha Phi<br />\n1 Pleasant high schools, which have with the Hanoverians. We imag- plete notes are much better prepared for<br />\n14<br />\nWith ABC Shorthand,<br />\nPhi Gamma Delta<br />\n2 been leading scholastic cross-country ined that he was one of that group examinations.<br />\n13<br />\nwhich is quickly learned in 12 easy lesteta. Theta Pi<br />\nE.<br />\n11<br />\n4 teams in the East, have expressed which advocates reform in all sons, you can take lecture and reading<br />\nnotes verbatim. Complete course now<br />\nPhi Kappa Psi<br />\n11<br />\n4 their intention to enter. All of the things.<br />\nsells for $1.00 at<br />\nJOHNS HOPKINS PRESS<br />\nbelta Upsilon<br />\n9 local scholastic teams, including<br />\n6<br />\n4 11 City, Poly, and Forest Park have<br />\nkappa Alpha<br />\nant-Pa<br />\nPhone Belmont 7908<br />\n14 entered. Last year's winning team,<br />\n1<br />\nSigma<br />\nPrinters of<br />\nAlpha<br />\nPhilological<br />\nand<br />\nScientific<br />\n5)<br />\n0 15 Bryant High School of New York,<br />\nTau Omega<br />\nPublications<br />\n!co'<br />\nwill not compete this year.<br />\nHOPKINS<br />\nPL. BALTIMORE<br />\n12-20<br />\nOf<br />\nBASKETBALL<br />\nThere will be a team trophy,<br />\nlist,<br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br />\nAt the basketball organization awarded to the school winning the<br />\nCHARLIE<br />\nDER<br />\n7ar ll'eeting held yesterday, it was de- meet; gold, silver and bronze medPRESCRIPTIONS<br />\nFIRST CLASS LAUNDRY<br />\nis'<br />\nthat practice would start the als for the first three men to finish,<br />\nSchool Supplies, Candy, Cigars<br />\n3224 GREENMOUNT AVE.<br />\nvet Ivionday following Thanksgiving. and bronze medals to all the men<br />\nBUTTONS SEWED ON, STOCKINGS<br />\nUnexcelled Fountain Service<br />\nMENDED, AND ALL NEEDED REPAIRS<br />\n3,1xif<br />\nMake Our Store Your Store<br />\n41 an effort to round into condi- on the winning team.<br />\nAt No Extra Charge<br />\nti<br />\nall of last year's regulars, with<br />\nwit the exception<br />\nof Kelly, have been<br />\nave Practicing for the past few weeks.<br />\nGoing Home for<br />\n'the<br />\nteam has played several local FLORISTS - - DECORATORS<br />\nTHANKSGIVING<br />\nIittus, winning all of the games with Members, F. T. D Asso., Inc.<br />\n(SPECIAL RATES)<br />\n1918 N. CHARLES ST. VEr. 0573<br />\nle difficulty.<br />\n1%.<br />\n1730<br />\nVErnon<br />\nN. Charles St.<br />\nCor. Lafayette<br />\nST.PAUL and 31st STREETS<br />\n2 70 4<br />\nIt.tAlr.FAST, 35c<br />\nLUNCH, 40C<br />\nAve.<br />\nDINNERS, 75c<br />\nLotie Tally In Second Half<br /><br />\nI<br /><br />\nSCIENCE<br /><br />\n;ages<br /><br />\nTAU APHA PHI LEADS<br /><br />\nWe Fail To Verify Answer As<br />\nTudor And Stuart Men Balk<br /><br />\nIN BOWLING TOURNEY<br /><br />\nrit<br /><br />\nNEED ANY MORE<br />\nBE SAID—<br />\nWe quote from the Baltimore Evening Sun:<br /><br />\nDon Kelly, injured quarterback, showed a real spirit. Before<br />\nthe game and during the first<br />\nhalf he sat in his street clothes<br />\non the Jay bench. His back was<br />\nsore and has been for some time.<br />\nHe wasn't fit to play football. But<br />\nwhen the teams went to the<br />\ndressing rooms at the half, Kelly<br />\nalso went in. He donned a uniform and asked his coach if he<br />\nmight play. \"I feel fine,\" he said,<br />\nand who could dispute his word.<br />\nSo Don went in the game, but<br />\nhis advent didn't help the situation.<br /><br />\nCULTURE OF CHINESE<br />\nIS MENACED<br />\nFather Brennan Enumerates Possible Guardians Before The<br />\nCarroll Club<br /><br />\n(Continued from Page 4, Col. 1)<br />\ntous activities of the external civilizations of both the Orient and the<br />\nOccident, and the revolutionary disunion within China, have combined<br />\nto occupy the attention of the country's foremost minds, to the resulting detriment of Oriental culture.<br />\nHowever, he continued,there is one<br />\ngreat hope for the, solution to the<br />\nproblem, and that is the fact the culture may be preserved in the same<br />\nmanner as it was in ancient Rome.<br />\nCandidates Report<br />\nIn spite of the political and social<br />\nFor Swimming Team disturbances which rack the China<br />\nof today, the Chinese Church may<br />\nApproximately thirty-five eandi- become the guardian of China's culdates reported to an organization tural progress, keeping it alive for<br />\nmeeting of the swimming team held the benefit of later generations in<br />\nrecently. Many of the veterans the same way as Roman culture was<br />\nwere absent and the group was com- preserved by the Church after the<br />\nprised largely of newcomers.<br />\nfall of the Roman Empire at the<br />\nActing Manager Levi gave a hands of the barbarian hordes.<br />\nshort talk concerning plans for the<br />\nFather Brennan also spoke on<br />\ncoming season, pointing out that an<br />\nthe Chinese language and the way<br />\ninteresting and extensive schedule<br />\nin which it reveals the workings of<br />\nis being arranged. A trip will be<br />\nthe Chinese mind. As an example<br />\ntaken to Virginia to encounter the<br />\n•of this, he cited the fact that the<br />\nWilliam and Mary squad, and in<br />\nwritten word in Chinese for our exaddition some swimmers will be<br />\npression of \"Peace be with you\" is<br />\nsent to the Eastern Intercollegiates.<br />\n\"One woman in a room,\" indicatThe freshman team will also have ing that, in a Chinese household,<br />\na larger schedule than in the past, as where one man has many wives,<br />\nmeets are being arranged with many peace is only to be had when each<br />\nof the local high schools. These en- woman is in a separate room.<br />\ngagements will be held as prelimiOther matters which occupied the<br />\nnaries to the varsity contests, thus<br />\nattention of the meeting, at which<br />\nproviding a double program for the<br />\nPresident De Lileo presided, conspectators.<br />\nsisted of the reading and correcting<br />\nLast year the Blue Jay natators<br />\nof the club's constitution and the<br />\nwere victorious in all but one of<br />\ndiscussion of a dance to be held<br />\ntheir contests. With a large maDecember 8th, in Levering Hall. It<br />\njority of the veterans returning for<br />\nwas also decided to have parliamencompetition, the team should have a<br />\ntary law for the Club, which devery successful season.<br />\ncision necessitated the election of a<br />\nSergeant-at-Arms. Those nOminated for the position are Hausche,<br />\nSholtes and O'Brien. Dr. Herzfeld,<br />\nThere is room for new men on Professor of Physics, was unanithe production staff of the Playshop. mously elected honorary chairman.<br />\nAll those interested in any phase of<br />\nThe members of the Charles Carproduction such as lighting, scenic roll Club will convene again some<br />\ndesigning and painting, see Dr. Fa- time early next month, the exact<br />\ngin or Kirshbaum.<br />\ndate not yet determined.<br /><br />\nNOTICE<br /><br />\nTuxedos gitust Grow<br />\nold<br />\nMoth balls won't keep them in style. Don't<br />\ntry it.<br />\nGet a new Katz Tuxedo. Dinner<br />\njacket and trousers, $27.50 to $45. Vest, $6 and $8.<br />\nFormal dress coat and trousers, $40.<br /><br />\nKATZ TUXEDOS<br />\n211 - 213 E Baltimore Street<br />\nWE DO OUR PARE<br /><br />\nTHE EMERSON HOTEL<br /><br />\n[ J. H. FURST CO.<br /><br />\nBIRELY'S<br />\nPHARMACY<br /><br />\n...11.110•111.11.11.<br /><br />\nRh.«<br /><br />\nJ. A. RITTER &amp; SON, INC.<br /><br />\nThe HOPKINS DINING ROOM<br />\nWEEKLY RATES<br /><br />\n%TO<br /><br />\nMEALS, $8.00<br /><br />\nTHREE MEALS, $10.00<br /><br />\nBALTIMORE, MD.<br />\nPrivate Rooms and Banquet Halls<br />\nfor All Occasions<br />\nCuisine and Furnishings<br />\nUnexcelled<br />\nRooms, $3.00 up<br /><br />\nDINNERS, $5.00<br />\ni<br />\ndp<br /><br />\nAutos Garaged<br /><br />\n4<br /><br />\nNE<br /><br />\nHOME WOOD,BALTIMORE, MD., NOVEMBER 24, 1933<br /><br />\nFATHER BRENNAN Johnnies Reckon Without Law INTERFRAT BOARD DISCUSSION GROUP<br />\nADDRESSES JOHN As Spirit Flows Over Onto Sign WILL JOIN S. A. C. HEARS DR. MCDOYCLE<br />\nAfter a special meeting yes- (Continued from Page 1, Col. 2)<br />\nCARROLL CLUB An institution of culture and all were fined $11.45 in the North- terday,<br />\nthe Interfraternity board of groups of thought have fallen<br /><br />\na proving ground for future world ern Police Station.<br />\nDiscusses The Problems Of leaders—so may run a definition of<br />\nChina At Levering<br />\nSt. John's College. But the embryo St. John's Spirit<br />\nHall<br />\ngeneralissimos of the new Utopia<br />\nTo Go<br />\nseemed to have gotten it in the neck.<br />\nIS NOW AT CRISIS,<br /><br />\nDECLARES DIVINE<br /><br />\nTouch Library Note<br /><br />\nFive of the disciples of St. John's<br /><br />\nClub Revises Constitution<br />\nrecently received an inspiration for<br />\nAnd Plans Dance<br />\nliterary expression. Thus they pubDecember 8<br />\nThe most important problem of<br />\nChina today is the preservation of<br />\nits historic culture, said Father Edward Brennan in an address to the<br />\nmembers of the Charles Carroll<br />\nClub at a meeting in Levering Hall,<br />\nSunday.<br />\nIn his address, Father Brennan asserted that China, whose cultural<br />\nantiquity rivals that of the Occidental civilizations, is now at a crisis<br />\nin her historical development, as the<br />\ngreat Chinese culture is strongly<br />\nthreatened by the attitude of the<br />\nyoung people of the nation.<br />\nRevolutions Detriment To Culture<br /><br />\nHe also told how, although in the<br />\npast, men of importance in affairs of<br />\nthe world and State have been prominent in the Chinese cultural life,<br />\nconditions are now altered. For,<br />\nsaid Father Brennan, the momen(Continued on Page 3, Col. 6)<br /><br />\nlished to the world their inmost<br />\nfeelings by inscribing a sign board<br />\nwith the poignant phrase, \"Beat<br />\nHopkins\".<br />\nThe weight of these words is, of<br />\ncourse, beyond question. But the<br />\nflat feet of the law are proverbially<br />\nunsympathetic to the muse. Result:<br /><br />\nDISCUSSES NEGRO<br />\nRELIGION IN U. S.<br /><br />\n•••••••••••••••••••••••••••••••••••••••<br /><br />\nof<br /><br />\n/01.<br />\nRECENT BOOKS<br />\nt By<br /><br />\nMembers of the Faculti<br />\nOn Sale At The<br /><br />\ndown. It was possible in former<br />\ndays, because of the utter isolation<br />\nof small geographical groups, to<br />\nhave uniformity of religion in one<br />\nof these communities, because they<br />\nwere affected by virtually the same<br />\nsociological and economic factors;<br />\nhowever, this is not possible nor desirable today, because of the great<br />\nvariety of influences, he said.<br /><br />\nannounced that the second series<br />\nUNIVERSITY<br />\nof open houses will be held at<br />\nthe appointed time.<br />\nBOOKSTORE SI<br />\nAt the regular meeting last<br />\nOn Air Monday<br />\n+Honest John Adams<br />\na vote was taken on this<br />\nquestion and six delegates were<br />\nBy GILBERT CHINARD<br />\nAmong the students to be interin favor of holding the second<br />\nviewed by Hyman Levin on the<br />\n:Life In The Making<br />\n2.7<br />\nopen houses, while six opposed<br />\nf<br />\nr..<br />\nWCBM \"Campus Comments\" pro- it. Two groups, the Alpha Tau<br />\nBy A. F. GUTTMACHER<br />\ngram tomorrow night at 8 p. m. Omega's and the Sigma Tau<br />\n!The Universe and Life<br />\n1.50<br />\nwill be Edwin P. Davis, of St. Delta's did not cast their votes<br />\nBy<br />\nH.<br />\nS.<br />\nJENNINGS<br />\nWHY GO DOWNTOWN<br />\nJohn's, who will answer the ques- until yesterday. The special<br />\nDR.<br />\nTO SHOP?<br />\nmeeing<br />\nwas<br />\nheld<br />\nto<br />\nallow<br />\nthem<br />\ntion, \"Is College spirit pure 'ho:The Federal Reserve Board______. 2.25 ill<br />\nJust stop over on Greenmount<br />\nto make their decisions and to<br />\nAvenue—A short walk from<br />\nkum', and are campus activities of<br />\nBy W. 0. WEYFORTH<br />\nlet the other fraternities reconthe Campus—and see the<br />\ntiOp<br />\nvalue ?\"<br />\ni<br />\nnewest<br />\nand<br />\nsmartest<br />\nin<br />\nsider their opinions.<br />\nShirts, Ties, Socks and Hats<br />\nDon Kelly, of Hopkins, and MarA two-thid majority is regaret Fox, of Goucher, will also dis- quired to defeat a rule; and as<br />\nJack Cummings<br />\nFIRST CLASS RESTAURANT and<br />\nthis did not materialize Thurscuss the question.<br />\nCo<br />\n3318 GREENMOUNT AVE.<br />\nDELICATESSEN<br />\nday, the open house will be car!2436-38 ST. PAUL STREETrig<br />\nPhone: UNiversity 4430<br />\ni<br />\n25c Breakfast — 25c Lunch<br />\nnion<br />\nas well as of Goucher and of Hop- ried on as formerly planned. The<br />\nOpen Evenings, 7 to 9<br />\n50c Dinner<br />\nfinal vote stood six to five in<br />\n2<br />\nT••••••••-•••••••••••••••••••••••••••••••••••••.-•-•-•••••••••••••••-•..... nd<br />\nkins. A feature of the meeting was<br />\nfavor of the open houses.<br />\n\"by D<br />\nthe group singing of Negro spiritThe board also decided that<br />\nsecon<br />\nNEW and REBUILT TYPEWRITERS<br />\nthey<br />\nshould<br />\ntry<br />\nto<br />\nplace<br />\nman<br />\na<br />\nDr<br />\nuals, directed by Miss Banks, direc/ALL MAKES, SOLD LIKE RENTING, PAY MONTHLY<br />\nA Machine For Every Purse and Purpose<br />\non the Student Activity Council.<br />\nOf hc<br />\ntor of music at the college, who exFROM $19.75 TO $126.00<br />\nDetails were left in the hands of<br />\nhe<br />\nplained the meaning and origin of the president, William Corkran.<br />\nAll Repairs, Supplies — Rent Any Make — Special Rates Oncc<br />\nBe Sure To Try a MONARCH NOISELESS<br />\neach song.<br />\nBefore Purchasing Any Portable<br /><br />\n''-<br /><br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br />\n•<br /><br />\nHEIDELBERG INN<br /><br />\n............................................................<br /><br />\n\"The Religious History of the<br />\nNegro Race in America\" was the<br />\ntopic of an address made by Dean<br />\nJohn W. Haywood, of Morgan College, at the regular meeting of the<br />\nPeabody Pharmacy '<br />\nInterracial Commission on Tuesday<br />\nThe next meeting of the group<br />\nt<br />\nCALVERT and 30TH STS.<br />\nnight, November 21. The session will take place in Levering Hall on<br />\nt First in Quality — First in<br />\nwas held at Morgan and was at- December 5th, at which time a genService<br />\ntended by students of that college eral discussion will be held.<br />\nI No delivery too small Bel. 53181<br /><br />\n1<br /><br />\nI<br /><br />\nTypewriter.<br /><br />\nAMERICAN WRITING MACHINE CO.<br />\nPARK AVENUE<br />\nPLaza 2060<br />\n(Serving and Saving Typewriter Users for 52 Years)<br /><br />\n18<br /><br />\n•••••••••••••••••••••••••••••••01...................1110<br /><br />\nTi<br />\nSO ROUND,SO FIR1VI, SO ULLY PAC<br />\nD KEarJ<br /><br />\nC<br /><br />\nIron<br />\nLati<br />\ntrist<br />\nfirm]<br />\nthe .<br />\ntory<br />\nof I<br /><br />\nthe<br />\neve]<br />\nInat<br />\nelm<br /><br />\ntrib<br />\nJay<br />\nrev<br />\nsto,<br />\nRo,<br />\nn<br />\nter<br /><br />\nto<br />\nbe<br />\na.ld<br />\ntor<br />\n1(.(<br />\nhi;<br /><br />\nre<br />\nin<br />\n1‹.<br /><br />\naeuckiackawea4<br /><br />\nCc<br />\n01<br /><br />\nit<br /><br />\nIt's easy to see why so many women prefer<br />\nLucky Strike. Luckies are fully packed with<br />\nlong strands of choice tobaccos, round and<br />\nfirm to the very tips. That means Luckies<br />\nalways draw easily, always burn smoothly.<br />\nIt also means no annoying loose ends to<br />\ncling to lips or mess up the nice things<br />\nin a woman's purse. And every day<br />\nmore and more women are showing their<br />\nappreciation by saying \"Luckies please\".<br /><br />\nti<br /><br />\nti<br />\na<br /><br />\nALWAYS thefinest taaccos<br />\nALWAYS thefinest worknansh0<br />\nALWAYSLadiesikase<br /><br />\n44<br /><br />\n_<br /><br />\nit's toasted<br />\nFOR THROAT PROTECTION—FOR BETTER TASTE<br /><br />"}], "field_media_file": [{"target_id": 38778, "display": null, "description": null, "target_type": "file", "target_uuid": "c6b9ea4c-7d19-4903-9d61-0aad9cccc97a", "url": "http://digital.library.jhu.edu/system/files/2022-03/12455-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12455, "target_type": "node", "target_uuid": "527d8939-7310-4190-80ef-5d56552799b2", "url": "/node/12455"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b7745bc3-57d5-4dd1-bd57-964220884213"}]}