{"mid": [{"value": 38213}], "uuid": [{"value": "ce96c918-1a75-4032-9777-9d69fa3c6edf"}], "vid": [{"value": 38213}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12780-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:38+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Zlintpu topkitv Nnuadirttrr<br />\n<br />\nJAY STICKMEN<br />\nROUT PENN, 14-2<br />\nPage 3<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 20, 1937<br />\n<br />\nVOL. XLI, No. 35<br />\na<br />\nBob<br />\nrethin<br />\nby<br />\n<br />\n11•11110<br />\n<br />\nMEAN TO US?<br />\nSEE EDITORIAL ON PAGE 2<br />\n<br />\n4<br />\n<br />\nme-<br />\n<br />\n:ore<br />\n<br />\nWHAT DOES<br />\n\"Next Thursday's Strike\"<br />\n<br />\nCourt Plan to<br />\nDraw Lippmann<br />\nFire Tomorrow<br />\nJournalist To Discuss Rise<br />\nOf Personal Government<br />\nIn America<br />\nTALKS TOMORROW EVE<br />\n<br />\n1<br />\n<br />\nHullabaloo Offers Ten<br />\nDollar Prize In Contest<br />\n<br />\nThe Hullabaloo, the University annual, is offering a prize of $10 to be<br />\nawarded to the student suggesting<br />\ntne best name of the new back room<br />\nof the Log Cabin Inn, local tavern.<br />\nAn enthusiastic response greeted<br />\nthe initial appearance of the posters<br />\nadvertising the contest. The numerous suggestions for the names have<br />\nflooded the judges. It is expected that<br />\nmany more will be mailed in.<br />\nThe Log Cabin is located at 3107<br />\nSt. Paul Street, and is reputedly one<br />\nof the favorite hang-outs of Hopkins<br />\nfraternity men. Waitresses there are<br />\nproverbially \"cute, friendly, but<br />\nstand-offish.\"<br />\nEntrants are urged by the sponsors to confine their suggestions to<br />\nnames of a less-particular nature<br />\nthan \"D. U. Annex,\" \"Phi Alpha Annex,\" \"Kappa Sig Annex,\" and so<br />\nforth.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nArthur H. ComptonIngineer Institute Estimated Four Hundred<br />\nNobel Prize Winner Holds Convention<br />\nWill Take Part hi Strike;<br />\nTalks Here Tuesday April 19 at Hopkins<br />\nChicago Physicist Coming President Bowman And Dr.<br />\nWhitehead Are Among<br />\nNext Week To Supper<br />\nSpeakers At Meeting<br />\nClub<br />\n\"We Must Shape Our New Lehigh Student Wins Prize<br />\nWorld\" Topic Of<br />\nFor Paper On \"Electrical<br />\nTalk<br />\nTime Standards\"<br />\n<br />\nCouncil Warns Offenders<br />\n<br />\n_==...<br />\n<br />\nStudent Council<br />\nAnd<br />\nThe Strike<br />\n<br />\nMitchell, Lane, Blumberg<br />\nSlated To Speak With<br />\nChurch Leaders<br />\nGROUP<br />\nMajority<br />\n<br />\nISSUES<br />\n<br />\nCALL<br />\n<br />\nVotes To Condemn<br />\nOn Thursday at 11 a. m., a strike<br />\nagainst<br />\nwar<br />\nwill<br />\nbe<br />\nWar<br />\nheld<br />\nas<br />\nJohns<br />\nBudget,<br />\nUphold<br />\nStudent Branch of the American InHopkins participates in the nationOxford<br />\nstitute of Electrical Engineers was<br />\nOath<br />\nwide Peace Day Program. The Stuheld yesterday at The Johns Hopkins dent Council is represented on the<br />\nBy WlETHERED BARROLL, JR.<br />\nWith approximately 400 students<br />\nUniversity. The convention was a Strike Committee and is lending its<br />\nLocal foes of President Roosevelt's<br />\nreputedly ready to suspend clasess at<br />\nplan to enlarge the Supreme Court<br />\nHe will speak before the University meeting of the Baltimore division of support to this organization.<br />\n11 a. m. this Thursday, the Hopkins is<br />\nshould have a field day tomorrow,<br />\nThe Council agrees on many of today facing the fourth edition<br />\nLecturer at the Wilson Memorial th A. I. E. E. and various member<br />\nof<br />\nwhen Mr. Walter Lippmann comes<br />\nChurch at 8.15 p.m. on '\"Why Try? and visiting branches. The program the points brought forth by tde Com- is student strike against war. Obto the Peabody Institute at 8.30 P.M.<br />\nPersonal Freedom and Responsibility consisted of a series of addresses, mittee and looks unfavorably on some servers anticipated the calmest demto lecture on The Rise of Personal<br />\nof the others. Regardless of personal onstration in strike history.<br />\nfrom the Standpoint of Science.\"<br />\ndiscussions, luncheons and dinners.<br />\nGovernment in the United States,<br />\nviewpoints, we are supporting this<br />\nThe younger of the two Comptons<br />\nAlready five speakers are definiteThe address of welcome was pre- strike as a cause worthy of the most<br />\nunder the auspices of the James<br />\nis known for his researches on X-rays<br />\nly slated to address the gathering<br />\nSchouler lectureship. In his column<br />\nand cosmic rays. Since he received sented in the morning by Dr. J. B. careful attention of every student, no from the Gilman Hall Porch. Three<br />\nin the New York Herald-Tribune, the<br />\nhis B.S. degree from the College of Whitehead, Dean of the School of matter what his particular senti- representatives of the University's<br />\nlecturer has time and again declared<br />\nWooster, Ohio, his home town, he Engineering. Dr. Whitehead is the ments may be.<br />\nprofessional corks, Dr._ Broadus Mithis opposition to enlarging the high Dr. Van Kleeck Boosts Co- studied at various universities here only past president of the A. I. E. E.<br />\nLast year ,the demonstration was chell, associate professor of Political<br />\ntribunal; and the subject of his talk<br />\nand abroad—Ohio State, Yale, Wash- now living. After the address stu- conducted in a peaceful, orderly Economy; Dr. Frederic C. Lane, asoperatives Before Med<br />\nseems to indicate that he will attack<br />\nington, California and Cambridge, dent papers were read and discussed fashion—a notable contrast to sev- sociate professor of History; and<br />\nStudents<br />\nthe \"rise of personal government\" On<br />\nand at one time served as research by the group. The papers read eral years preceding when the rowdy- Dr. Albert E. Blumberg, instructor<br />\nin<br />\nthese grounds, as well as others.<br />\n\"Our present medical system is physicist for the Westinghouse Lamp were: \"A Laboratory Polyphase ism of certain students resulted in Philosophy, are at present listed on<br />\nOutdone Early<br />\nnot able to provide the care for the Company. From 1920 until 1923 he Power Rectifier,\" \"Electrical• Time publicity for the University of a most the program.<br />\nEver since his undergraduate days population that medical science makes was Professor of Physics and head of Stndards,\" and \"An Algebraic Equa- undesirable nature.<br />\nOther speakers include the Rev.<br />\nWhen the strike<br />\nat Harvard, where he founded the possible. The responsibility for this the department at Washington Uni- tion Solver.\" The morning's pro- was held last May, the Student Asbury<br />\nSmith, regarded as \"an outSocialist Club, Mr. Lippmann has lack of adequate medical care is di- versity, and since then has been Pro- gram was concluded with a descrip- Council determined to<br />\ndeal stringent- standing liberal churchman,\" and<br />\nbeen in the forefront of those actively rectly upon the industrialized society, fessor of Physics at the University tion of the events for the coming ly with any<br />\nattempts to cause a riot Pat Whelan, leader of the local<br />\nInterested in political and social which cannot keep its standards of of Chicago.<br />\nafternoon and the announcement of or disorder of any type.<br />\nbranch of the International Seaman's<br />\nproblems. His abilities and liberal living parallel to its scientific proDr. Compton discovered total re- the prize winning paper. The honors<br />\nThe same position is being emphat- Union. Whelan plans to discuss the<br />\noutlook soon brought him to •the at- gress,\" said Dr. Mary Van Kleeck, flection and polarization in X-rays, went to T. R. Brown of Lehigh Unipending \"industrial<br />\nically assumed this year.<br />\nmobilization\"<br />\ntention of the late Lincoln Steffens, of the Russell Sage Foundation, be- but he is best known for his discovery versity.<br />\n'ARTICLE VI, Section 4 of the bill.<br />\neditor of Everybody's Magazine and fore four hundred assembled Medical of the \"Compton effect,\" the fall in<br />\nThe convention met for the last Constitution of the Student Council:<br />\nThe Hopkins Student Council yesleading muck-raker of the trust-bust- students at the annual banquet of frequency of the X-rays when scat- time for dinner at the Merchants<br />\n\"The Student Council shall be em- terday issued its annual warning that<br />\ning days of Theodore Roosevelt.<br />\nthe Association of Medical Students tered by collision, which indicates Club, 206 East Redwood St. The powered to promote good order<br />\nin breakers of the peace during the<br />\nAfter serving an apprenticeship un- at Levering Hall, Saturday<br />\nnight. that the rays are corpuscular and not dinner was a joint meeting of The undergraduate affairs and shall exer- strike would be summarily punished.<br />\nder the appreciative reformer, which<br />\nJohns Hopkins Branch and the Bal- cise primary jurisdiction<br />\nMiss Van Kleeck's address was en- a form of wave motion.<br />\nin ques- The Council also expressed symincluded practical investigations of titled<br />\nIn applying this theory to cosmic timore Section of the A. I. E. E. in tion in questions<br />\n\"Economic Aspects of Social<br />\nof<br />\nconduct<br />\non the pathy with \"many of the strike's<br />\ncorruption in American politics, the<br />\nSecurity,\" and was part of a forum rays, he has made many expeditions honor of President A. M. Mac- part of any undergraduate or group aims.\"<br />\nyoung scholar produced in 1912, two on \"nedicine and Social<br />\nPresident MacCutcheon of undergraduates<br />\nSecurity,\" over the world to study the geograph- Cutcheon.<br />\nWith the strike three days away,<br />\nwhich shall be<br />\nyears after leaving Cambridge, a Others speakers were Dr.<br />\nJames ical distribution of cosmic rays and addressed the guests with a talk on deemed unbecoming a gentleman or the committee yesterday issued<br />\nan<br />\nbook-length study entitled, A Preface Warbasse, Surgeon, President of<br />\nthe especially the effect of the earth's \"The Selection and Training of Elec- prejudicial to the honor of the Uni- official statement of purpose and<br />\npolPolitics.<br />\nto<br />\nThe meeting versity.\"<br />\nCo-operative League of America, magnetic field upon their intensity. trical Engineers.\"<br />\nicy. The announcement, approved by<br />\nInstant recognition and applause who spoke on \"Cooperative<br />\nMedicine In 1927, as a result of his work on broke up at 9:00 p.m.<br />\nmajority vote, purported to represent<br />\nOn<br />\nthese<br />\ngrounds,<br />\nthe<br />\nStudent<br />\nwere his. At the present time he is in Denmark,\"<br />\nThe officers of The Johns Hopkins Council requires<br />\nand Dr. G. Canby Rob- high frequency radiation, Dr. Compthe collective opinions of the 13 orthe<br />\ngentlemanly<br />\nconengaged in composing a sequel to inson, of the<br />\nJohns Hopkins Medical ton received the Rumford Medal from Student Branch are: Henry B. Peck, duct of every student at this demon- ganizations represented on<br />\nthe comelaborate this work, The Good So- School,<br />\nwhose topic was \"The Rela- the American Academy of Arts and chairman; Walter 0. Peale, vice- stration and shall treat as a Council mittee. Members of the group<br />\ncalled<br />\nciety, wherein he declares his inten- tion of Government<br />\nto Medical Ser- Sciences and was awarded the Nobel president; Guy F. Stark, secretary; offense any violations of this code.<br />\nit a \"minimum program in the fight<br />\ntion of \"attempting to show the rea- vice.\"<br />\nprize for physics by the Swedish Gordon B. Dickler, treasurer, and<br />\nfor peace.\"<br />\nTHE STUDENT COUNCIL<br />\nsons for the decline of Century<br />\nDr. J. H. Lampe, counselor.<br />\nDr. Van Kleeck's premise is that Academy of Sciences.<br />\nThe committe platform, issued in<br />\nLiberalism.\" However, seven arti(Editor's Note: This statement by<br />\nthere is no reason why the medical<br />\nthe form of a call to the strike, conrecently<br />\ncles of his,<br />\npublished in the service of the country<br />\nthe Council may be taken as demonshould not be<br />\ntained six main planks. First among<br />\nAtlanta Monthly and intended for based on a salaried<br />\nstration of its readiness to act swiftly<br />\nplan, as are all<br />\nits demands was the elimination of<br />\nIncorporation in the book, are merely<br />\nto punish any violation of order durother professions. She believes that<br />\ncompulsory military training in the<br />\nattacks on theories of collectivist<br />\ning<br />\nthe<br />\nstrike.<br />\nSome years ago emthe present system of doctor's fees<br />\nAmerican universities.<br />\nsociety.<br />\nbattled R.O.T.C. members precipitais a hangover of an economic system<br />\nNext to draw fire was the nation's<br />\nFounder of New Republic<br />\nted a riot by turning a hose upon a<br />\nwhich has long ceased to exist in<br />\nbillion-do<br />\nllar budget, condemned \"as<br />\nDuring the decade following his almost<br />\nfaculty speaker.)<br />\nall other professions. The Explosives, Cut - Glass, And<br />\nMan<br />\nEating<br />\na dangerous extension of militarism.\"<br />\nAcids<br />\nAre<br />\nthe<br />\nattracted<br />\nstudy at Harvard he<br />\ncomplete cooperation of doctors and<br />\nUnder this heading it was urged that<br />\nMaltreated Toys Of The Youth<br />\nenthusiasm of most liberal and leftist group is the<br />\nonly way in which it is<br />\nthe<br />\nadministration define the phrase<br />\npartisans. He was one of the found- possible to<br />\nOf J. H. U.<br />\nbring a decent medical<br />\n\"cdequate national defense.\"<br />\ners of the New Republic and drew system within<br />\nthis planned society,<br />\nThe third plank called for defense<br />\na spirited poem of praise from John according to Miss Van<br />\nBy A Staff Writer<br />\nsweepers in the chem labs. GlassKleeck.<br />\nof civil liberties, \"the suppression of<br />\nReed, pre-war radical and fellow\"The professional workers are com. . .. he took more KC1O3 the quan- ware, particularly tubing, is handled Friends of Music Hope To Establish which is the first step<br />\ntowards Fasclassmate.<br />\ning up against the real problems of tity increases, then poured on H2504, like steel bars, showing haw characMusic Fund With<br />\ncism,<br />\nand<br />\nthe<br />\ndefeat<br />\nin<br />\nCongress of<br />\nDespite all this, his relations with tne<br />\nworkers. The problems facing the they picked him up in pieces.<br />\nteristically unheeding of \"silly and<br />\nContest<br />\nthe pending industrial mobilization<br />\nhis associates on the New Republic<br />\n\"Don't look now, son, but aren't outmoded\" rules and regulations the<br />\nsit-down strikers are similar to those<br />\nplan, which proposes universal conbecame strained, and he severed confacing the doctors of the country. It those your fingers dropping on the average freshman is. Blithely, the<br />\nThe Friends of Music Society will scription in times of war.<br />\nnections. He reacted against a form<br />\nIs all wrapped up in our present econ- floor?\" There is an expression in 1936-7 edition takes hold of his bent hold its concert in Levering Hall, the<br />\nOxford Pledge Supported<br />\n(Continued on Page 4, Col. 6)<br />\nomic system, in which the surplus its essence of a situation that has ex- tubing and uses the palm of his hand evening of April 28, at 8.30. The<br />\nThe Oxford Oath, whose upholder<br />\nmoney of society is not given back isted for quite some time in the chem- as a hammer to bang it into a rubber program will consist entirely of pledges himself to<br />\ntake part in no<br />\nistry laboratories in Remson.<br />\nto society,\" she said.<br />\ncork!<br />\nMozart.<br />\nwar of any sort, won the support of<br />\nThe \"suicide fleet,\" the \"Ride of<br />\nThen, a few seconds after he's been<br />\n\"We must recognize a progression<br />\nThis concert is to raise funds for a majority of the committee, \"as a<br />\nof medical treatment towards a more th Four Hundred,\" and the Human at this activity, the natural laws of the purchase of music for the society, factor for unity among<br />\nall groups<br />\nfunctionable service to society. It is Torpedoes have their idealism exem- cause and effect take notice of his and to start a fund to purchase a vic- which strive for peace.\"<br />\nCopies By William Blake Are Noted not merely a matter of fact collect- plified in the attitude of the present efforts, and some poor lab-instructor trola and records. Admission is to<br />\n(Continued on Page 4, Col. 1)<br />\nFor Unusual Intering—as exemplified by the recent col- Freshman Class. In but a few in- is thrilled by this same freshman who be fifty cents, with tickets obtainable<br />\npretation<br />\nlection of statements by doctors re- stances in history is such utter dis- rushes up to him chortling, \"Surprise! at the reference desk of the Library,<br />\nThe Johns Hopkins Library re- cently published in book form--but regard for life and limb recorded as Look what I've got!\" and shoves a Main Reading Room, in Gilman Hall. Graduate Chemists<br />\nceived the facsimiles of the drawings we must deal with the reactionary in the period of time extending from miniature fountain of beautiful, gush- A number of the faculty have already<br />\nWill Hear Donnayi<br />\nby William Blake illustrating The forces in this country which are September, 1936, to the present date. ing crimson into his face!<br />\ngranted their support.<br />\nNow the simple crucifixion of one's<br />\nBook of Job. The illustrations re- against the human forces necessary To the best of our knowledge, chemThe program will consist of Mozart<br />\nThe graduate chemistry students<br />\nistry is a subject in which credit is hand is scorned as being amateurish Concertos,/ Trios, and Quartets. A plan to hold their last tea and lecture<br />\nproduced by the Pierpont Morgan for existence,\" she concluded.<br />\nThis conference was the fourth not especially given for knowing the and bungling in the good work of partial list includes the Trio in E flat of the current season at 3.30 P. M.<br />\nLibrary were donated by Mary C.<br />\nGoodwillie at the suggestion of Dr. to be held since the organization of best way of incapacitating one's bunging up oneself in chem lab! Com- major, for clarinet, viola, and piano; tomorrow in room 221 of Remsen<br />\nKirk, who lectured on Blake to the the Association of Medical Students friends and desk-mates taking the petition for honors, like those of war the Sonata in D major for two pianos, Hall.<br />\nThe speaker will be Dr. J. D.<br />\nas \"An organization set up to con- course with you. It has been necessary vets, has sprung up. When the boys and the Quartet G major \"Eine Kleine H. Donnay of the Geology DepartFriends of the Library.<br />\nThe illustrations of the Bible story cern itself with the economic, ethical, to make a formal announcement to this discovered what fun it was to blow Nachtmusik.\" The performers are to ment, whose topic will be \"A New<br />\nare Blake's own interpretations. and humanistic aspects of medicine.\" extent, because our freshmen seem apart test tubes with hydrogen, they be selected from the members of the Relationship Between External Forces<br />\nto be in an awful daze about their used it with even greater effect on Society, and other invited artists.<br />\nMr. Wicksteed says that Blake's enand Internal Structure of Crystals.\"<br />\ntheir fellows. Even now it is conchemistry course.<br />\ngravings are dry and hard, but that<br />\nBowman<br />\nAppointed<br />\nStudents were warned about such sidered a sure laugh to ask a labthey are original and forceful in<br />\nCorrection<br />\ncharacter and exceedingly vivid in<br />\nTo Annapolis Board obvious precautions as using bunsen mate to light a bunsen flame for you Ping-Pong Tournament<br />\nburners to singe whiskers off in lieu near which a generator is dyspeptiimagery.<br />\nOn Levering Program<br />\nThe NEWS-LETTER regrets that<br />\nDr. Isaiah Bowman, President of of shaving, pouring hot, melted glass cally belching forth hydrogen!<br />\nIn the preface of the book, it is<br />\ndue to the article concerning the<br />\nOf course the eventual wind-up (or<br />\nThe first activity sponsored by the<br />\nstated that since Blake's God is Di- The Johns Hopkins University, has on their hands to \"give them that<br />\nR. 0. T. C. Military Ball, apvine Humanity, which he identifies recently been appointed to the Naval school-girl complexion,\" and employ- blow-up) of all this is going to be Levering Hall Game Committee is<br />\npearing in the issue of Friday,<br />\nsometimes as the Poetic Genius . . . Academy \"Board of Visitors,\" whose ing sulphuric and other acids and al- simply that the boys will claim that to bea collegiate ping-pong tournaApril 16, 1937, many readers have<br />\nto him Job's spiritual sin is one of duties consist of inspecting the An- kalies as an eye-wash. They were they have acquired a course in prac- ment. Playing will begin next Monreceived the erroneous impression<br />\n\"materialism and complacency.\" It napolis School and then making any also told that if hydrogen gas were tical chemistry, and at the same time day, and all entrants must sign up<br />\nthat admission to the dance is by<br />\nIs here that Blake diverges from the suggestions to Congress for neces- to be mixed with air, and a match have learned to save their money. at Levering Hall before Saturday<br />\ninvitation only. The Military Ball<br />\nsary<br />\nHow?<br />\nimprovements<br />\nignited<br />\nthe<br />\nBecause<br />\nvicinity,<br />\nin<br />\nthey<br />\nwhich<br />\nan<br />\nonly<br />\nexplosion<br />\nneed<br />\nto buy noon. Prizes will be awarded.<br />\northodox interpretation of The Book<br />\nmay occur<br />\nis not a closed affair, tickets being<br />\nof Job and, says Dr. French, it is this to them. Dr. Bowman has been se- would result. In spite of all warn- one glove, one sox, one shoe, this<br />\nThe ping-pong equipment and the<br />\non sale and offered to all at Levernew interpretation that rounds out lected in regard to the academic ings, entreaties, and threats, roasted making wearing apparel last twice prizes have been donated by Dr. G.<br />\ning Hall at $1.25 per copy.<br />\nJob's features and coarsens his ex- point of view and will visit Annapolis meat, chopped meat, and grilled meat as long and take but half-fares home. Wilson Schaffer, Director of Aththree days, from April 26 to 28.<br />\nhas been the favorite food of the You see, there's only half of them letics at the Hopkins.<br />\npression.<br />\nPeabody To Be Scene Of<br />\nLecture, Speaker Is<br />\nLiberal<br />\n<br />\nDr. Arthur H. Compton, noted<br />\nphysicist and Nobel Prize winner,<br />\nwill address the University Supper<br />\nClub next Tuesday, April 27, at 6.00<br />\np.m. on the topic, \"We Must Shape<br />\nOur New World.\"<br />\n<br />\nThe thirteenth convention of the<br />\n<br />\nCites Inadequacy<br />\nOf Medical System<br />\n<br />\nFrosh Fiends Fie Upon Loss Of<br />\nLift, Limb; Chem Lab Their Play<br />\n<br />\nSociety Will PresPnt<br />\nProgram of Mozart<br />\n<br />\nFamousPictures Are<br />\nDonated To Library<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 20, 1937<br />\n<br />\n2<br />\n<br />\nObt jobntopttn<br />\n<br />\nrest and the spending of large sums on armaments re-<br />\n<br />\nLETTER TO<br />\nTHE EDITOR<br />\n<br />\nsuited in the organization of this first strike against<br />\nwar. Twenty-five thousand students participated, although the strike had been neither well organized nor<br />\n<br />\nletter<br />\n<br />\ngeku5<br />\n<br />\nwell publicized.<br />\n<br />\nUniversity administrations throughout<br />\n<br />\nThe A. S. U. and Peace<br />\nTo the Editor of the NEWS-LETTER:<br />\nthough there were several noticeable exceptions. Un- Dear Sir:<br />\ndergraduate rowdyism, however, was evident only in a<br />\nIn preparation for the Strike<br />\n<br />\nthe country went on record as opposed to the strike, al$2.00<br />\n$2.50<br />\n<br />\nSubscription per year__<br />\nBy Mail -----<br />\n<br />\nfew schools, one of these being The Hopkins.<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRentsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nin Illaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br />\n<br />\nAgainst War, the American Student<br />\nIn the following year the need for a strong protest Union takes this opportunity to preagainst war was even more evident. A nation-wide sent its views on the strike and its<br />\nresponse followed an appeal for wide student support objectives.<br />\nof the strike, 175,000 students took part in an orderly,<br />\nQuoting from the program of the<br />\nserious, and intelligent demonstration, marred only in A. S. U: \"The present heightened ina few places by small rowdy groups. When over 500,000<br />\nternational tension should make us<br />\nstudents protested last year, it was proved beyond a<br />\ndoubt that the movement was not merely a student more alert to the peril of American<br />\nfancy, but a serious protest and one to be reckoned with. conflict with Japan or other imperAt The Hopkins the student strike had the same type<br />\nof growth. Last year a large portion of the student<br />\nbody participated in an orderly strike, in which many<br />\nshades of thought were represented. This year the outlook is brighter than ever. Fourteen campus organizations are sponsoring the student protest, thus showing<br />\nclearly that student interest in the strike is not based<br />\nin any one group, but on popular support from all students.<br />\n<br />\nEDITORIAL STAFF<br />\nEditor•in-C f<br />\nStanley Finkel<br />\nManaging Editors<br />\nJ. Murray Kempton, Benjamin Root<br />\nAssociate Editor<br />\nWethered Barroll, Jr<br />\nSports Editor<br />\nHarold Zheutlin<br />\nAssistant Managing Editors<br />\nJ. C. Handelsman, Victor M. Victoroil<br />\n— _Columnist<br />\nPaul Berge<br />\nReporters--Julian Adler, Milton Alperstein, Zeana Baum, William<br />\nBurford, Mal Boshnack, Charles Diggs, Nathaniel Finkelstein,<br />\nArnold Glantz, Jewett Goldsmith, Max Iskowitz, Arthur Katz,<br />\nThis situation is typical of that in the nation at large.<br />\nMartin Krieger, Irving Milberg, Leonard Quitt, Carl Rasin,<br />\nHoward Reizenstein, Lester Rosenthal, Leonard Rubinger, Supported in 1934 by but one organization, the strike<br />\nSeymour Sacks, Joseph Samovitz, William Snyder, Morris<br />\nWessel.<br />\nWilliam B. tempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br />\n<br />\ntoday is sponsored by peace organizations of all kinds.<br />\nWhereas at one time it was charged that the strike was<br />\nBUSINESS STAFF<br />\nonly a medium for the so-called \"radicals,\" today these<br />\nBusiness Manager<br />\n—_— Assistant Business Manager groups are distinctly in the minority, both nationally<br />\nAdvertising Manager and on the campuses.<br />\nCirculation Manager<br />\nThe student strike is supposed to be a rehearsal for<br />\nOffice Manager<br />\nCopy and Filing Manager a future day which we all hope will never come. When<br />\n<br />\nMember<br />\n<br />\n1936<br />\n<br />\n1937<br />\n<br />\nRssocialed ColleeSithe Press<br />\nDist riburors ol<br />\nGDile5iale Dieest<br />\nCCCCCCSPITED FOR NATIONAL ADVERTISING BY<br />\n<br />\nNationai Advertising Service, Inc.<br />\nColleze Publishers Represestatfre<br />\nNEW YORK. N.Y.<br />\n4k0 MADISON AVE.<br />\nCHic,o0 - BOSTON - SAN FRANCISCO<br />\nLOS ANGELES<br />\n<br />\n-<br />\n<br />\nFORTLANE<br />\n<br />\nSE<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nAtlantic States<br />\nMiddle<br />\nOf<br />\n<br />\nTUESDAY, APRIL 20, • 1937.<br />\n<br />\nThursday's Student Strike<br />\nThis Thursday, at eleven o'clock, students of the<br />\nJohns Hopkins University will join thousands of likeminded students throughout the world in an attempt to<br />\nshow to the public how we feel about war.<br />\nA broad program, supported by campus organizations<br />\nof a varied character and opinion, is planned. This program is merely a rallying point for the entire student<br />\nbody, who are given an opportunity to join in a concerted move to tell the world that we hate war. We will<br />\nbury our differences while uniting our voices in a concerted condemnation of this meance to civilization and<br />\n<br />\nOn The Literary Horizon<br />\nSpring Note<br />\nThe onset of spring — theme of<br />\ncountless poets and authors through<br />\nthe ages—is again being commemorated. Amid the avalanches of publisher's blurbs—reviews, advance notices and reprints—there comes the<br />\nhomely<br />\ntouch—the<br />\ndown-to-earth<br />\nspirit of Rural America—the Sears<br />\nRoebuck Catalogue. In the \"Spring<br />\nBooks\" number of the Saturday Review of Literature, there appears an<br />\nunexpected review, ably written by<br />\nLowell Thompson of the HoughtonMifflin Company, entitled: Eden in<br />\nEasy Payments.<br />\n<br />\nialist nations over economic stakes<br />\nin the Orient and South America—<br />\nstakes which are of benefit, as in the<br />\ncase of all wars fought by imperialist<br />\nnations, not to the American people,<br />\nbut a handful of powerful American financial and industrial groups.<br />\nThe present boldness of Fascist Italy<br />\nand the belligerence of other Fascist<br />\nnations merely reveal that international conditions in these countries<br />\nare most acute<br />\nIn these bitter<br />\nclashes the American financial barons<br />\nare directly involved . The approach<br />\nof another European war hastens the<br />\nday when these interests will again<br />\ndictate American entrance — unless<br />\nthey are fought relentlessly now.<br />\n<br />\nAnd indeed, it is very probaole that<br />\nof all the books mentioned, this one<br />\nwill be read and pored over by more<br />\npeople than any other—despite the<br />\noptimistic ads of the publishers. For<br />\nhere is the American Bible—outside<br />\nthe urban communities—here is the<br />\ncuriously-solid Eden of America.<br />\nHere we have the guide-book to a<br />\nnew region of life which finds its<br />\nneeds, luxuries, and pleasures within<br />\nthese hallowed pages. \"The Sears<br />\nRoebuck Catalogue: Spring and Summer 1937,\" (Chicago, the Sears Roebuck Co., 1937), is as sure a harbinger<br />\nof spring as the shoots of grass—the<br />\nfreshness of recent rain — or the<br />\nfledgling best-sellers-of-the-future.<br />\n<br />\nthose who govern the destinies of nations perceive that<br />\n\"The A. S. U. uncompromisingly<br />\nyouth, the backbone of former militarism, is turning opposes the war preparations of our<br />\naway from them, they will be hesitant in starting wars. own government. It undertakes to<br />\nMoreover, the methods of 1914 cannot work again. organize the collective resistance of<br />\nThe student peace movements of that day were handi- students now against the steps which<br />\ncapped by a fundamental weakness, ignorance. The lead to war and in the event of war<br />\ntrue facts about the causes of war had not been pre- to the war itself. . . . The war which<br />\nsented clearly to the world. An appealing excuse could we shall be called on to wage must<br />\nbe, and was found for the entrance into the World War. be aggressive in character and purToday we realize some of the basic causes of war, and pose, and the interests we shall be<br />\nwe have seen historically that wars are futile, as far asked to defend will be those of the<br />\nas obtaining what the majority of the people want is few, not of the many. These circumconcerned. We know the evils of war and should try stances demand independent organito prevent it. The best way of showing our animosity zation, and action against war by the<br />\nis by supporting the strike. It is the duty of every Hop- anti-war forces of the world, prekins student to be in front of Gilman Thursday at 11:00 eminent among which is the organo'clock.<br />\nized labor movement.<br />\n<br />\nThe Strike And The Future<br />\n<br />\n\"The anti-war strike is a declaration of our determination to prevent<br />\nour government from going to war.<br />\nIt is, moreover, a dress rehearsal of<br />\nthe action we will take the moment<br />\nour government seems likely to declare war.<br />\n<br />\nWe don't suppose it is too much to say that Mars is<br />\nnot the most popular among our gods these days. Except for the tiny minority of deep thinkers who see in<br />\nIt some cure for our economic woes, we have trouble<br />\nfihding anyone with anything good to say for the resort<br />\nto arms. The vast majority want no part of the next<br />\n\"The A. S. U. accepts without<br />\nwar. And the Institute of Public Opinion, in a survey reservation the Oxford Pledge 'to relast week, discovered that 70 per cent of those it ques- fuse to support any war which the<br />\ntioned thought the last one was a mistake.<br />\nUnited<br />\nStates<br />\ngovernment<br />\nmay<br />\nYet, on every hand, we hear that war is \"imminent.\" undertake.'\"<br />\n<br />\nMr. Roosevelt's New Deal, thumpingly endorsed at the<br />\npolls last November, is preparing to pay out $1,180,000<br />\nthis year for what it considers \"adequate\" national<br />\ndefense. Here is a budget item second only to that for<br />\nrelief. Its elimination would go far towards balancing<br />\nthe New Deal's books. What is more, the administration has presented little or no valid argument for such<br />\nexpenditure. It hasn't even told us anything about the<br />\nparticular threat against which our shores must be<br />\nprotected. To all intents and purposes, we are buying<br />\nour pig in a poke. Now, even the most violent of the<br />\ncritics of Mr. Roosevelt's spending have lifted no outcry<br />\nover what at first blush appears the most ridiculous<br />\nwaste of all . Thus, we can only surmise that our people<br />\nworthwhile gesture.<br />\nWe think it effective in focusing attention upon our consider it a necessary one.<br />\nconcern with the problem of War. We students must<br />\nThat's a pretty tragic situation. The vast majority<br />\ncreate a profound impression of our attitude upon public of us hating the thought of a war to come, and pre-<br />\n<br />\nsecurity.<br />\nBut of what value is this strike, called an \"empty<br />\ngesture.\" \"a strike against weather\"? To the critics,<br />\ncynics, and condemners of this strike we say:<br />\nWe students want to assemble together in a widespread expression against war, knowing that we are<br />\njoined by thousands of our comrades on every campus.<br />\nWe are encouraged by the feeling of solidarity. We want<br />\nto demonstrate to the world that we think about such<br />\nserious problems as war.<br />\nAnd we consider the massing of students, after<br />\nwalking out of classes to hear thinking student and<br />\nfaculty speakers discuss war from varied angles, a<br />\n<br />\nopinion.<br />\n<br />\npared to spend a billion dollars to fight it.<br />\n<br />\nWe find this strike fits in with our desire of arousing<br />\nand organizing student opinion against war.<br />\nWe do not look upon the manifestation as an isolated,<br />\n\"flash-In-the-pan\" outlet of our feelings. We want to<br />\nbe constantly discussing, studying and doing things<br />\nabout War.<br />\nThis strike is just one of the way in which we can<br />\ntell the world that we students are realistic thinkers.<br />\nWe have examined some of the past wars; we say<br />\nthat the 13,000,000 men killed died in vain. But not in<br />\nvain if they have taught us to profit by their experience<br />\nand learn of war's real nature.<br />\nWe no longer will be fooled by emotional slogans, by<br />\nbeating drums, by jingoistic hysteria. We will not be<br />\ndrugged by the propaganda of hatre.<br />\n<br />\nBy the mere fact of this outlay the New Deal has<br />\nshown itself defeated in the fight to keep the peace.<br />\nMr. Roosevelt, the most popular President in years, is<br />\nsupposedly expressing the national will by the maintenance of a war budget in times of peace.<br />\nWhich puts the whole matter right back in the laps<br />\nof the people themselves. Our only hope of staying<br />\nout of war lies there. No government can carry on any<br />\nwar in the face of the will of the vast majority of its<br />\ncitizens. If we can make that opposition felt, the world<br />\nmay yet be saved.<br />\n<br />\nTherein lies the importance of the coming student<br />\nstrike against war. It is a dramatic declaration against<br />\nthe forces which are edging us towards the abyss.<br />\nBut dramatic expressions are not enough. The fight<br />\nfor<br />\npeace cannot be won with one stroke. We cannot<br />\nBut we want to strip war of all its pretenses and<br />\ncease to push it, at home and abroad, on the rostrum<br />\nfind what is behind the imperialism, nationalism and<br />\nand at the polls.<br />\nmilitarism that lead to the nations' frenzied armament<br />\nMost of all, we must remember that, when all is said<br />\nAllies<br />\nloan<br />\nhuge<br />\nraces. We seek to learn about the<br />\nbefore the war, about the profits of the armament- and done, we are the ones who make the wars. To<br />\nmakers, about the organized propaganda of the press. assign the last war to the Morgans and the Duponts is<br />\nAre you ready to succumb to the damnable lies, to a simple business. But, the people who burned the<br />\nthe sham flag-waving, to the prostituted voices of the pacifist in effigy in 1917 were fundamentally decent<br />\npulpit and academician, to the money-controlled press and ordinary folk, who had been horrified at the thought<br />\nof war six months before. We have no reason to believe<br />\nand radio?<br />\nthat it won't happen to them again.<br />\nNeither are we.<br />\n<br />\nThus, the success of the strike, in the long run, must<br />\ndepend on the amount of impetus it provides the fight<br />\nfor peace. In a single hour out of classes we cannot<br />\nThe history of the annual Student Strike Against hope to win that fight. But, through it, we can launch<br />\nWar since the first strike three years ago, shows a the drive which may save us from catastrophe.—J. M. K.<br />\nmovement continually increasing in strength and one<br />\nwhich may prove to be very beneficial to the world at<br />\nlarge. From small, but auspicious beginnings, the<br />\nWe are happy to announce the election of Wedgy Barstrikes have gained more and more footholds in American Universities, and it is expected now that more than roll to the position of associate editor; Hal Zheutlin,<br />\na million students will assemble Thursday on the differ- sports editor; Vic Victoriff and Jack Handelsman, assistent campuses to serve notice upon the warmakers that ant editors; and Leonard Quitt and Bill Snyder as memthey refuse to be fooled again, that they recognize the bers of the staff.<br />\n<br />\nA Little History<br />\n<br />\nMerited Honors<br />\n<br />\nThe tremendous growth in power<br />\nof the Strike Against War since its<br />\ninception is well demonstrated in the<br />\nincrease from 25,000 students participating in 1934, and the 500,000 in<br />\n1936: This year a million are expected to answer the Strike Call. The<br />\nexperiences of the past three years<br />\nhave reduced opposition to the Strike<br />\nto a tiny reactionary whine. But it<br />\nis well to briefly state the meaning<br />\nof the Strike. It has come to mean<br />\nabstention from normal routine activities as a method of impressing the<br />\ndeep student anti-war sentiment, and<br />\ndemands upon our government in a<br />\ntone far more serious and determined<br />\nthan any single petition or meeting<br />\ncould provide. It is also an essential<br />\npart of our strategy for disrupting<br />\nmobilization plans should they be imposed upon the universities. To the<br />\nextent that administrators are preparing to accept those mobilization<br />\nplans, the strike is directed \"against\"<br />\nthem. To the extent that they are<br />\nprepared to carry on in behalf of<br />\npeace, their support should be extended to the strike. Once that is<br />\ngiven, any confusion about the purpose of the strike will be removed,<br />\n( Continued on Page 4, Col. 3)<br />\n<br />\nSPRING THOUGHT<br />\nThe trouble with the human race—<br />\nI find that it's a fact—<br />\nIs that they slump while sitting,<br />\nAnd get a rounded back.<br />\nWhen they see someone sitting<br />\nStraight as when made by God,<br />\nThey say with much derision,<br />\n\"His spine acts like a rod.\"<br />\nYou never can constrain them<br />\nTo stick out their manly chests;<br />\nThey sit around and slouch all day,<br />\nAnd put wrinkles in their vests.<br />\nBut they will learn some day too late,<br />\nWhen their clothes hang like a sack,<br />\nAnd, beneath their rounded shoulders,<br />\nTheir chest comes out in back!<br />\n<br />\n(This weighty bit of philosophy<br />\nwas found in the office trash-basket,<br />\nThese fellows were active in their service to the NEWS- following the exit of a young man<br />\nfutility and hypocrisy of the last war.<br />\nThe first student strike was held in April, 1934, at a LETTER and well merit these promitions.<br />\nwith a dreamy look. We thought it<br />\nCongratulations!<br />\ntime when the situation looked black. Economic unwas love.)<br />\n<br />\nern Front, and so on through to the<br />\nend of the impressive story. The<br />\nbook is ably reviewed by George<br />\nStevens. Its author has chosen to<br />\nremain anonymous.<br />\nA Master Grows Hysterical<br />\nIt is always a painful task to read<br />\na book by a favorite author, and<br />\nrealize that it just doesn't measure<br />\nup to his better works. Such is the<br />\nsaddening experience<br />\nwith<br />\nVery<br />\nHeaven, by<br />\nRichard<br />\nAldington,<br />\n(Doubleday Doran Co., Garden City,<br />\nNew York, $2.50). Mr. Aldington<br />\nwas a poet—of distinction, but little<br />\nweight, until the time of the war.<br />\nBut from that fire he emerged, not<br />\nbroken, but saddened—not bitter, but<br />\ncynical—maintaining his deep sympathy, and inherent romanticism,<br />\nwhich mark him among the leading<br />\nEnglish authors of the decade past.<br />\nTwo brilliant books—a term used advisedly, \"All Men Are Enemies,\" and<br />\nDeath of a Hero, were published<br />\nand received enthusiastically. His<br />\nwork is cutting, but seldom cruel—<br />\nhe despises the smug ignorance of<br />\nhis own society—as was said of Jonathan Swift by a contemporary—\"He<br />\nloves Tom, Dick and Harry, but<br />\ndespises the human race.\" And this<br />\nis perhaps true.<br />\n<br />\nThe Saturday Review has found<br />\na book long ago worthy of its austere columns, and brings to a place<br />\nof deserved dignity that unfailing<br />\nbarometer, that gaily-colored reflection of rural paradise—the mail-order<br />\ncatalogue.<br />\nA Centennial<br />\nThe \"changing American Scene\"<br />\nhas a bad habit of changing so very<br />\nrapidly that the celebration of any<br />\ncentenary is an event of more than<br />\npassing interest. Such is the 100th<br />\nanniversary of the publishing house<br />\nof Little Brown & Company, 34 Beacon Street, Boston. With this spring,<br />\nthe firm joins ranks with only three<br />\nother houses which have lived the<br />\nhundreth year.<br />\nA small handbook<br />\nhas been privately printed by the company—One Hundred Years of Publishing, (Boston, Little Brown &<br />\nCo., 1937)—and comes to the general<br />\npublic through a review in the special supplement of The Saturday<br />\nReview, commemorating this birthday, and sent with its March 27 issue.<br />\nThe story is traced from the association of Charles C. Little, and James<br />\nBrown, recruited, in accord with the<br />\ncustom of the nineteenth century,<br />\nfrom the ranks of booksellers, and<br />\ntheir early struggles to the memorable occasion when keen editorial<br />\njudgment published \"Quo Vadis,\" and<br />\nswept the country to new heights of<br />\nsale figures. And the same year<br />\ncame the Boston Cooking - School<br />\nCook Book of Fannie Farmer—<br />\nwhich has sold to date 1,736,000<br />\ncopies—keeping, as the reviewer puts<br />\nit, \"a good jump ahead of Gone With<br />\nthe Wind.\"<br />\nFrom then on, the story grows<br />\nmore familiar—A. S. M. Hutchinson<br />\nand his If Winter Comes, the publication of the Atlantic Press Books,<br />\nof which the best-known is the Nordhoff - Hall star — Mutiny on the<br />\nBounty — All Quiet on the West-<br />\n<br />\nBut \"Very Heaven\" is too much<br />\nabout our economic and social problems of today, and too little about the<br />\nefforts of men to maintain clean and<br />\nglowing that spark of the Infinite<br />\nwithin themselves, in spite of their<br />\nmisfortunes. Romantic -- yes, but<br />\nwith a less ambitious and therefore<br />\nnearly hackneyed romanticism. The<br />\nstyle is the cold, cutting Aldington<br />\nat his best—matured a little since<br />\nDeath of a Hero, but full of vigor<br />\nand barely-checked invective against<br />\nstupidity, crassness and blindness.<br />\nThe story is simple, as are all of<br />\nMr. Aldington's, and universal. Chris<br />\nHeylin, forced to leave his books due<br />\nto family reverses, refuses to give up<br />\nhis academic outlook, despite the efforts of his mother to force his marriage to a woman of considerable<br />\nwealth, the sacrifice of his sister,<br />\nand his father's death. The attendant<br />\ncharacters are perhaps a little too<br />\ncarefully drawn; they have too much<br />\nof a place as symbols to become<br />\npeople. Chris is a little too much<br />\ninclined to become a vehicle for the<br />\nauthor's discussion of sterile society,<br />\nand its outmoded conventions and<br />\nfalsities.<br />\nIn short, after reading this able<br />\ndiscussion, there is not the feeling of<br />\nsaddened exaltation which accompanies his other greater works. He<br />\nis lost in Very Heaven, in the<br />\nrealms of sociology.<br />\nHowever, let it be made perfectly<br />\nclear that Aldington never commits<br />\nthe unpardonable error of proposing<br />\na thesis in his novels. The problems<br />\nhe treats are not solved at the end.<br />\nHe does not theorize. His is the individualistic outlook, which can see<br />\nthe evils, and indicate a better existence, but does not presume to show<br />\na path for the transition. His is the<br />\nprose of a poet saddened, but still<br />\nvigorous. His treatment is, as always, completely frank, unsensational, and fearless.<br />\nW. B.<br />\n<br />\nGREEK LETTER NOTES<br />\nPHI GAMMA DELTA<br />\nIn the recent elections of the Hopkins Chapter of Phi Gamma Delta,<br />\nJohnny Royster was elected president; Boyd Frey, treasurer; Allen<br />\nHill and Jack Hunter, secretaries;<br />\nand Flub Price, historian. Don Naylor, Charley Dunning, and Pete Swindell are the retiring officers.<br />\n• • *<br />\n<br />\ntion time, the Phi Alpha continued<br />\ntheir social program by holding a<br />\ntea dance last Sunday afternoon. Real<br />\ntea was served and Brother Rostov<br />\npoured at 4.30. House parties are<br />\nscheduled for following Saturdays<br />\nand another formal is due early in<br />\nMay. It seems as if the boys are<br />\ndancing their troubles away.<br />\n•<br />\n<br />\nTAO is throwing a big barn dance<br />\nHenry Kramer was recently elected<br />\nmstaer frater of the local Shirley on May 1.<br />\n• * •<br />\nTemple Club. Congratulations, Henny.<br />\nALPHA DELTA PRE<br />\n*<br />\n*<br />\n*<br />\nThe Alpha Delta are going hard<br />\nBETA THETA PI<br />\nfor the<br />\nseason's<br />\npoint-to-points.<br />\nAlpha Chi of Ian is pleased to<br />\nJohnny Fenwick came in second in<br />\nannounce the pledging of Louis Garthe Junior steeplechase two weks ago.<br />\nben of Islop, Long Island, and Al<br />\nHugh O'Donovan came in fourth and<br />\nSmith of Chateau Avenue, Baltimore.<br />\nPage Edmunds took a hard fall to<br />\nBeta's baseball team, featuring<br />\nthe good earth. Wedge Barroll was<br />\nhome runs by Wagner and Coady<br />\non the side lines nursing his famous<br />\nand whiz-ball pitching by Brer Hemtoe-nail.<br />\nming, has won its first two games.<br />\n• * •<br />\nNo doubt Wagner gets his hefty<br />\nPHI SIGMA DELTA<br />\nswing from his work on the golf<br />\nOne hundred and fifty couples atteam.<br />\ntended the annual Phi Sig formal<br />\n* * •<br />\nSaturday night. For a change, all<br />\nDave Caplan celebrated his 21st<br />\nthe \"wolfing\" was done by the dorm<br />\nbirthday Saturday night with a chamboys. Stan Finkel came down from<br />\npagne party at the Pi Lam House.<br />\nthe INA convention, right off the<br />\nAnn Spear, his date, accepted all the<br />\ntrain, carrying his bag for a date.<br />\ncongratulations.<br />\nSi Treib and Milt Tuerk were the<br />\n*<br />\n*<br />\n*<br />\nrecipients of several bills incurred by<br />\nPHI ALPHA<br />\ntheir dates at a local apartment.<br />\nFollowing up their successful week- house. It pays to use local products,<br />\nend of Spring Dances before vaca- boys.<br />\n<br />\n;<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 20, 1937<br />\n<br />\nLacrosse Squad<br />\nRouts the UofP;<br />\nFinal Score 14-2<br />\nBlue Team Has Easy Time<br />\nWith Visiting Red and<br />\nBlue Aggregation<br />\nPENN<br />\n<br />\nSCORES<br />\n<br />\nFIRST<br />\n<br />\nScore Tied 1-1 At End Of<br />\nFirst Quarter Of<br />\nTilt<br />\nOnce again the powerful but slow<br />\nstarting Blue Jay lacrosse team<br />\npurred along smoothly in the second<br />\nand third quarters to crush a game,<br />\nbut highly outclassed squad from the<br />\nUniversity of Pennsylvania in the<br />\nfirst attraction of the doubleheader<br />\nstaged at Homewood on Saturday<br />\nafternoon.<br />\n<br />\nThe final score of the<br />\n<br />\nHopkins tilt was 14-2.<br />\nPenn drew the first blood of the<br />\ngame when Al Nye, star end of the<br />\nred and blue football team, dogged<br />\nhis man and rushed in unguarded to<br />\nslip the ball past Kahl. This score<br />\nwas soon nullified, however, when<br />\nNorm Melvin dented the netting after<br />\nreceiving a pass from Hammer Hines.<br />\nThis evened the count and the score<br />\nremained this way until the end of<br />\nthe first quarter.<br />\nAttack Function<br />\nWith the beginning of the second<br />\nquarter the Hopkins attack began to<br />\nfunction smoothly, and with Johnny<br />\nEnders, freshman wing attack, leading the advance by scoring two goals<br />\non beautiful cuts, the Penn goalie,<br />\nMaksik, who played a bang-up game,<br />\ndespite the score, found too many<br />\nshots coming his way to stop them<br />\nall. The result was that the Morrillcoached outfit held a 6 to 1 advantage<br />\nat the half-way mark.<br />\nThe Hopkins ten continued the onslaught after the intermission and<br />\nhurled a barrage of shots, many of<br />\nwhich found the mark at the enemy<br />\ncords. While the attack was thus<br />\nperforming nobly, the blue defense<br />\nwas also doing a fine job, allowing<br />\nfew shots to be taken at the goal,<br />\nand clearing the ball excellently. All<br />\nIn all, only thirteen attempts were<br />\nmade by the Pennsylvania team,<br />\neleven of these being stopped by the<br />\ncombined efforts of Kahl and Passano, each goalie allowing one ball to<br />\nget by him.<br />\nKempton Spectacular<br />\nThe goal scorers were led by Enders, Dukehart and Kempton, each<br />\nobtaining three counters apiece.<br />\nKempton made the most spectacular<br />\nshot of the day when he let the ball<br />\nfly over his shoulder while his back<br />\nwas turned toward the goal.<br />\n<br />\nTuesday, April 20—<br />\nNightriders versus Nine J's.<br />\nSenior Mechanics versus Library<br />\nWednesday, April 21—<br />\nCardiacs versus Tigers.<br />\nN. J. All-Stars versus Literati.<br />\nThursday, April 22—<br />\nSee Ease versus Whirlwinds,<br />\n4.15.<br />\nSee Ease versus Senior Elecs.,<br />\n5.00.<br />\nJunior Elecs versus Junior Gas.<br />\nFriday, April 23—<br />\nSenior Gas Civils versus Blue<br />\nBears.<br />\nCement Mixers versus Tech<br />\nHawks.<br />\n<br />\nHaverford Wins Track Meet<br />\nOver Blue And Black, 109-17<br />\nAt Haverford, last Saturday a<br />\nShotput—Won by Holzer, Haverwell-balanced Haverford track and ford; second, Debausset, Haveford;<br />\nfield team, paced by two stellar in- third, Carleton, Johns Hopkins. Disdividual performers, swamped a hard tance-43 feet<br />\nstriving Blue Jay aggregation.<br />\n<br />\nTuesday, April 20—<br />\nAlpha Epsilon Pi versus Beta<br />\nTheta Pi.<br />\nPhi Sigma Delta versus Phi<br />\nKappa Psi.<br />\nWednesday, April 21—<br />\nAlpha Chi Rho versus Delta Phi.<br />\nPi Lambda Phi versus Delta<br />\nUpsilon.<br />\nThursday, April 22—<br />\nSigma Phi Epsilon versus Phi<br />\nEpsilon Pi.<br />\nKappa Sigma versus Tau Alpha<br />\nOmega.<br />\nFriday, April 23—<br />\nTau Alpha Phi versus Kappa<br />\nAlpha.<br />\n<br />\nJay Batmen Lose<br />\nTwo On Road Trip<br />\n<br />\n440-Yard<br />\n<br />\nJOHNS HOPKINS<br />\nG. S.<br />\n9<br />\nDukehart, ih<br />\n3<br />\n5<br />\n3<br />\nKempton, ih<br />\n1 11<br />\nMelvin, oh<br />\n3<br />\n0<br />\nBernheim, oh<br />\n9<br />\n0<br />\nKaufman, fa<br />\n1<br />\nSiegel, fa<br />\n1<br />\n4<br />\nBeeler, fa<br />\n1<br />\n6<br />\n3<br />\nEnders, sa<br />\n3<br />\n2<br />\nHimes, c<br />\n5<br />\n0<br />\nYearley, ad<br />\n2<br />\n0<br />\nBuck, od<br />\nNaylor, p<br />\n1<br />\n0<br />\n14<br />\n<br />\nPENNSYLVANIA<br />\nG.<br />\n0<br />\nPerlstein, ih<br />\n0<br />\nNeedle, 1k<br />\nVorheis, oh<br />\n0<br />\nNye, fa<br />\n1<br />\n0<br />\nPanzer, ea<br />\n1<br />\nDolman. sa<br />\nKessler, c<br />\n0<br />\nGordon, ed<br />\nu<br />\n<br />\n59<br />\n<br />\ninches.<br />\n<br />\n3/4<br />\n<br />\nDash—Won<br />\n<br />\nby Hunt,<br />\nvictorious cindermen captured first Haverford; second, Langford, Johns<br />\nplace in all but one of the fourteen Hopkins; third, Carey, Haverford.<br />\n<br />\nevents to decisively manifest their Time-52.2.<br />\nsuperiority in every branch of competition.<br />\n<br />\nThe<br />\n<br />\nfinal<br />\n<br />\nscore<br />\n<br />\nTwo-Mile Run—Won by Driscoll,<br />\nwas Johns Hopkins; second, Morris, Hay-<br />\n<br />\n109-17.<br />\n<br />\nerford; third,<br />\nTime-10.15.7.<br />\n<br />\nHolzer Outstanding<br />\n<br />\nCarey,<br />\n<br />\nHaverford.<br />\n<br />\n220-Yard Low Hurdles—Won by S.<br />\nEvans,<br />\nHaverford; second, John<br />\nChuck Holzer and Debausset contributed to the subjection of the in- O'Neill, Johns Hopkins; third, Mosevading Blue squadron. Holzer tal- ley, Haverford. Time--25.6.<br />\n220-Yard Dash—Won by Hunt,<br />\nlied 16 points for the afternoon;<br />\nwhile Debausset followed close be- Haverford; second, Morian, Haverford; third, Gebelein, Johns Hopkins.<br />\nhind as the major point-getter.<br />\nTime—.23.<br />\nThe lone Hopkins performer to win<br />\nMainly<br />\n<br />\nFRATERNTY SICHEDULE<br />\n<br />\nThe<br />\n<br />\nthe<br />\n<br />\nefforts<br />\n<br />\nof<br />\n<br />\nCaptain<br />\n<br />\na first place was Driscoll, who<br />\nclicked off an excellent two mile<br />\nrace. His time was by far the best<br />\nhe has flashed this season. At the<br />\nfinish he was far ahead of MHorris<br />\nof Haverford who for the early part<br />\nof the race clung tenaciously to Driscoll's heels.<br />\n<br />\nHigh Jump—Won by Debausset,<br />\nHaverford, second; Poorman, Haverford;<br />\nthird,<br />\nLester,<br />\nHaverford.<br />\nHeight-5 feet 10 inches.<br />\nJavelin—Won by Myer, Haverford;<br />\nsecond, Graziano, Johns Hopkins;<br />\nthird, Holzer, Haverford. Distance157 feet 514 inches.<br />\n<br />\nIn the sprints, the absence of Baet880-Yard Run—Won by Rodman,<br />\nger was severely felt. The Jay dash Haverford; second, Evans, Haverstar caught cold and was unable to ford; third, Wesson, Haverford.<br />\nmake the trip with the team.<br />\nTime2.7.8.<br />\nThe summary:<br />\nPole Vault—Won by Lester, Haver120-Yard High Hurdles—Won by ford; second, Debausset, Haverford;<br />\nS. Evans; second, Fisher, Haverford; third, Kelley, Haverford. Heightthird, Steiger, Haverford. Time- 11 feet 6 inches.<br />\n16.3.<br />\nDiscus ThrowWon by Holzer, Hav-<br />\n<br />\n100-Yard Dash—Won by Holzer, erford; second.<br />\nMyer, Haverford;<br />\nHaverford; second, Morlan, Haver- third, Poorman, Haverford.<br />\nDisDrop Decisions To Drexel ford; third, Wingerd, Haverford. tance115 feet.<br />\nAnd Swarthmore Nines; Time-10.2.<br />\nBroad JumpWon by Wingerd, HavOne-Mile Run—Won by W. Evans; erford; second, J. Lewis, Haverford;<br />\n7-3 And 13-4<br />\nsecond, Shihadeh, Haverford; third, third, Graziano, Johns Hopkins. Distance 20 feet 10/<br />\n1<br />\n2 inches.<br />\nIt was a successful week-end for Lurting, Haverford. Time-4.46.8.<br />\nthe Blue Jay batsmen, for their trip<br />\nup in the vicinity of Philadelphia<br />\n<br />\nManOW<br />\n<br />\nPRAT STANDINGS<br />\nDIVISION A<br />\nAlpha Epsilon Pi<br />\nAlpha Chi Rho<br />\nBeta Theta Chi<br />\nPi Lambda Phi<br />\nPhi Kappa Psi<br />\nPhi Sigma Delta<br />\nDelta Upsilon<br />\nDelta Phi<br />\nDIVISION B<br />\nSigma Phi Epsilon<br />\nTau Alpha Omega<br />\nPhi Alpha<br />\nPhi Epsilon Pi<br />\nKappa Alpha<br />\nKappa Alpha<br />\nKappa Sigma<br />\n<br />\nWon Lost<br />\n2<br />\n1<br />\n2<br />\n1<br />\n2 1<br />\n2<br />\n1<br />\n1<br />\n1<br />\n1<br />\n2<br />\n1<br />\n2<br />\n0<br />\n2<br />\nWon Lost<br />\n2 0'<br />\n1<br />\n0<br />\n1<br />\n1<br />\n1<br />\n1<br />\n0<br />\n1<br />\n0<br />\n1<br />\n0<br />\n2<br />\n<br />\nINTERCLASS SOFTBALL<br />\nTUESDAY LEAGUE<br />\nWon Lost<br />\nSenior Mechanics<br />\n3 0<br />\nTigers<br />\n2<br />\n1<br />\nNight Riders<br />\n1<br />\n2<br />\nTech Hawks<br />\n0 3<br />\nTHURSDAY LEAGUE<br />\nWon Lost<br />\nSee-Ease<br />\n3 0<br />\nJr. Mech-Elecs<br />\n1<br />\n1<br />\nWhirlwinds<br />\n1<br />\n1<br />\nLiterati<br />\n0 3<br />\nFRIDAY LEAGUE<br />\nWon Lost<br />\nN. J. All-Stars<br />\n2<br />\n0<br />\nCement Mixers<br />\n1<br />\n1<br />\nBlue Bears<br />\n1<br />\n1<br />\nNewcomers<br />\n2<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nMOPZ<br />\nIGTOen<br />\nFt<br />\n<br />\nLeaders Score<br />\nSoftball Wins<br />\nAtHalfwayMark<br />\nAll-Stars, Senior Mechanics<br />\nCardinals,See Ease Lead<br />\nLeague<br />\nAt the half way mark in the inter<br />\nclass softball league the Senior Mech<br />\nanics, Cardiacs, See-Ease, and New<br />\nJersey All-Stars are leading in the<br />\nTuesday, Wednesday, Thursday, and<br />\nFriday leagues, respectively.<br />\nIn games played last week, the<br />\nleader in each division continued un<br />\ndefeated. The N. J. All-Stars downed<br />\nthe Cement Mixers while the See<br />\nEase walloped the Whirlwinds 11-3<br />\nThe Senior Mechanics also copped<br />\ntheir game by a 16-9 decision over<br />\nthe Library team, substituting for<br />\nthe Tech Hawks.<br />\nBlue Bears Win<br />\nUsing two complete teams, the<br />\nBlue Bears, outslugged the Newcom<br />\ners to cop a 20-9 verdict. With<br />\nSchultz and Deck limiting the New<br />\ncorners to four runs in the first three<br />\ninnings, the Bears scored 14 mark<br />\ners. Not satisfied, the Bears added six<br />\nmore tallies in the sixth stanza. One<br />\nrun in the fourth, one in the fifth,<br />\ntwo in the sixth, and one in the sev<br />\nenth increased the Newcomers' total<br />\nto nine.<br />\nThe See-Ease had little trouble in<br />\ntopping the Whirlwinds 11-3 in a<br />\ngame played Thursday. Although the<br />\nlosers held a 2-0 lead at the begin.<br />\nfling of the third inning, the See-Ease<br />\non hits by Spragins, Vanasek, War.<br />\nminski, Hamn and Allen drove in five<br />\nruns to go ahead 5-2. In the fifth<br />\nthe See-Ease added five more tallies<br />\nand then coasted to a easy victory.<br />\n<br />\nPtairrWAZOW,<br />\n<br />\nproduced two defeats. They dropped<br />\na 7-3 decision to Drexel College on<br />\nFriday and then fell before the onslaught of the Swarthmore College<br />\n<br />\nSTRIKE AGAINST<br />\nWAR<br />\n<br />\nbatsmen to the tune of 13-4.<br />\nThe game with Drexel was a hardfought contest throughout, with victory finally falling to the team committing the least errors.<br />\nTwo-baggers by Marty Harthe and<br />\nMilt Alperstein and a single by Len<br />\nRubinger, ace Hopkins flinger, in the<br />\nsecond inning paved the way for the<br />\nJohns Hopkins three runs.<br />\nOff to a good start behind the<br />\npitching of Dick Dimpfli, the Swarthmore College nine defeated the Blue<br />\nJay baseball team 13 to 4. Dimpfli<br />\n<br />\nAPRIL 22, 1937<br />\n<br />\nstruck out nine men and allowed only<br />\none hit in six innings.<br />\nJohnny Carper started<br />\n<br />\non<br />\n<br />\nthe<br />\n<br />\n5<br />\n<br />\nmound for the Hopkins team, but<br />\ngave way to Len Rubinger in the<br />\n<br />\n11.00 A. M.<br />\n<br />\nsixth frame. Iry Millberg hurled the<br />\n<br />\nThe line-up:<br />\n<br />\nTotals<br />\n<br />\nINTERCLASS SCHEDULE<br />\n<br />\nlast two innings and did nobly in a<br />\nA. game that was already lost.<br />\n1<br />\nA Hopkins rally in the seventh<br />\n0 netted all four runs.<br />\n2<br />\n2<br />\nDREXEL<br />\n1<br />\nAb. R. H. 0. A.<br />\n0 Graf, c<br />\n4 2 2 11 0<br />\n0 Wolf, 2b<br />\n4 0 1 5 1<br />\n2 Rhile, lb<br />\n5 0 0 4 0<br />\n1 Fox, cf<br />\n2 2 1 4 0<br />\n1 Ehm'ng, 3b<br />\n4 1 1 1 1<br />\n0 Lignelli, rf<br />\n3 1 1 1 0<br />\n0 Dilarso, ss<br />\n2 0 O 0 2<br />\n4 0 O 0 0<br />\nRaynes, If<br />\n10 Zimmers, p<br />\n3 1 1 0 0<br />\n<br />\n31 7 7 27 7<br />\nJOHNS HOPICINS<br />\nAb. R. H. 0. A.<br />\n4 0 0 3 0<br />\nRomanofsky, If<br />\nMilan, 3b<br />\n4 0 1 0 0<br />\nStevens, c<br />\n4 0 0 8 1<br />\nHarthe, ss<br />\n3 1 2 0 I<br />\nClisham, lb<br />\n3 0 0 9 0<br />\nCarper, cf<br />\n0 0 0 1 0<br />\n4 1 1 1 2<br />\nAlp'tein, 2b<br />\n3 1 0 0 0<br />\nBra'haw, rf<br />\nTotals<br />\n4 0 2 2 4<br />\n2 13<br />\n1 Rubinger, p<br />\nSwindell<br />\n..FD<br />\nGisburn 1Smith<br />\n1 0 0 0 0<br />\nGhinger .<br />\nC.P<br />\nRighter<br />\nP<br />\nLove<br />\nHalstead<br />\n34 3 6 24 8<br />\nTotals<br />\nKahl<br />\nMaksik<br />\n1Batted for Brayshaw in ninth.<br />\n0 3 1 0 1 1 0 1 x-7<br />\nDrexel<br />\n0 3 0 0 0 0 0 0 0-3<br />\nJ. Hopkins<br />\nErrors—Wolf, Milan, Hartke, Clisham. Two base hits—Ehmling, AlPlaying their first game of the perstein, Graf. Three base hit—Fox.<br />\nseason, the tennis team dropped a Stolen bases—Graf, Fox, Brayshaw,<br />\nDouble<br />\nSacrifice—Wolf.<br />\nmatch against Duke University. In Hartke.<br />\nthis game played last Friday at Hop- play—Clisham, unassisted. Base on<br />\nkins, the Blue and Black looked good balls—Off Zimmers, 3; Rubinger, 4.<br />\nin defeat. Duke has an exceptional Struck out by Zimmers, 10; Rubingood team this year, and Coach Jean ger 7.<br />\nHit by pitcher—Rubinger<br />\nBalk—RubinHofmeister expects Hopkins to im- (Dilarso, Zimmers).<br />\nprove as the season advances.<br />\nger. Umpire—Voorhees.<br />\n<br />\n51<br />\n<br />\nSTEPS OF<br />\nGILMAN HALL<br />\n131<br />\nA1<br />\n<br />\nTotals<br />\n<br />\nS.<br />\n1<br />\n1<br />\n1<br />\n5<br />\n1<br />\n1<br />\n1<br />\n2<br />\n<br />\n[Duke Beats ,111<br />\n<br />\nA.<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br />\n<br />\nSponsored By<br />\nPr<br />\n<br />\nSTUDENT COUNCIL<br />\n<br />\nPHI ALPHA<br />\n<br />\nOMICRON DELTA KAPPA<br />\n<br />\nPHI SIGMA DELTA<br />\n<br />\nDEBATING COUNCIL<br />\n<br />\nPHI EPSILON PI<br />\n<br />\nAMERICAN STUDENT UNION<br />\n<br />\nYOUNG COMMUNIST LEAGUE<br />\n<br />\nSTUDENT ACTIVITIES COMM.<br />\n<br />\nBARNSTORMER CLUB<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nTHE HULLABALOO<br />\n<br />\n/4\\<br />\nbiT<br />\ni<br />\nRM O<br />\nr<br />\nj<br />\nlt<br />\ne C<br />\ng2<br />\nbgli<br />\n4<br />\n19 tt.<br />\n<br />\n•<br />\n<br />\n•<br />\n•<br />\nbt<br />\n,<br />\n<br />\n\\ •<br />\n<br />\n•<br />\n<br />\nadl• ge402021912M.\"<br />\n• •itic.<br />\n<br />\nA\\<br />\n<br />\n•<br />\n•<br />\nAbi•<br />\n<br />\n•<br />\n<br />\n./\\<br />\nSettc• •<br />\n<br />\n\fHOM.EWOOD, BALTIMORE, APRIL 20, 1937<br />\n<br />\nFour Hundred Will Dormer Bares All<br />\nLeave Classes For For Homewood's<br />\nThursday's Strike<br />\nBenefit<br />\nThree Members Of Faculty<br />\nSlated To Address<br />\nMeeting<br />\n<br />\nResidents of the exclusive Homewood district of North Charles Street<br />\nwere startled out of their Bourgeois<br />\napathy early last Friday evening by<br />\n<br />\nPeace Demonstration To<br />\nHear Five Speakers From<br />\nGilman Porch<br />\n<br />\nthe sudden appearance of a phantom<br />\napparition which was speedily making its way up the middle of the<br />\nstreet.<br />\n<br />\nOnlookers<br />\n<br />\nfelt<br />\n<br />\nthemselves<br />\n<br />\nthrown back a thousand years into<br />\n<br />\n(Continued from Page 1, Col. 6)<br />\nthe days of the ancients as they<br />\nIn its fourth plank, the committee<br />\nwatched the white figure which retendered its endorsement to the pol- sembled a young Greek god. But by<br />\nicy of \"cooperation among the peace- the aid of the headlights that were<br />\nloving forces of the world,\" and de- thrown upon the figure and by quesmanded suspension of economic re- tioning the spectators it was found<br />\nthat the \"apparition\" was merely a<br />\nlations with any nation adjudged the<br />\nHopkins boy \"out on a bet.\" The<br />\naggressor in case of war.<br />\noffer of two dollars had been enough<br />\nThe call closed with an appeal to to entice him to shed his clothes and<br />\nstudents to recognize that the trend take a run a la nude in the Baltiof events in the last decade had re- more night air.<br />\nWhen the phantom reached its<br />\nsulted in a final struggle between<br />\ndestination at the corner of Charles<br />\nTherein,<br />\nFascism and Democracy.<br />\nStreet and University Parkway a<br />\nit was claimed, the issue lay.<br />\nwaiting bathrobe was thrown over<br />\nWhole Committee Approves<br />\nhis shoulders. Then he surrendered<br />\nThe call was signed by all 13 mem- himself to the press. Almost his first<br />\nwords were, \"Where's my money?\"<br />\nbers of the committee. OrganizaAfter his demands were satisfied he<br />\ntions represented are: the Student<br />\ncomplacently started back to the<br />\nCouncil, the Debating Council, the Dorms. Upon further questioning he<br />\nAmerican Student Union, the Student replied that he had a very good time<br />\nActivities Committee, Omicron Delta except that the sound of a police<br />\nKappa, Phi Sigma Delta, Phi Alpha, whistle blown by a practical joker<br />\nPhi Epsilon Pi, the NEWS-LETTER, nearly scared him out of his wits.<br />\nthe Hullabaloo, the Young ComThe feat (bare feet!) had just<br />\nmunist League, the Barnstormer about stopped traffic on Charles<br />\nClub, and the Y. M. C. A.<br />\nStreet, and it had brought almost<br />\nSpeakers from the committee are the entire residency of Alumni Memoalso expected to appear at Goucher rial Hall out to the street and winand Morgan Colleges, where similar dows. Who's the guy that said Hopdemonstrations are planned.<br />\nkins men have no sporting blood!<br />\n<br />\n:-: LETTERS TO THE EDITOR :-:<br />\nStrike take a positive clear-cut posi(Continued from Page 2, Col. 3)<br />\nas demonstrated in the two-score col- tion with respect to the events in<br />\nleges where such cooperation was Spain.<br />\noffered in 1936.<br />\nFascism today is the main threat<br />\nThe Strike, as a single gesture, to world peace. The ,Spanish People<br />\ndoes not insure permanent peace and are fighting for democracy against<br />\neliminate those motives to conflict. fascism. A defeat for Fascist Italy<br />\nIt is, however, the most potent instru- and Germany is a victory for peace.<br />\nment that students and workers can Victory for Fascism is a defeat for<br />\nemploy to postpone, prevent and in- peace. There can be only one choice.<br />\nfluence a specific war situation. The American support of the Spanish govStrike's immediate end is to curtail ernment is an aid to peace and<br />\nwar preparations, defeat the fascist- democracy.<br />\nminded \"Mobilization Day\" Plans,<br />\ncombat compulsory military training<br />\nThe American Student Union<br />\nand false mentality measures which<br />\nKind Words For Dr. Gutmacher.<br />\nhasten war.<br />\nTo the Editor of the NEWS-LETTER:<br />\nThe Oxford Pledge receives the sup- Dear Sir:<br />\nport of conservatives, liberals, and<br />\nEver since the inception of Dr.<br />\nradicals.<br />\nWhen the conservative Guttmacher's course, my faith has<br />\navows non-support, he does so with been revived in the ability of my inthe conviction that capitalism can tellectual associates hereabouts to<br />\nrid itself of warfare. He expresses constrain their ebullience of charhis confidence in the system under acteristics, perverted, and childish<br />\nwhich he lives, but warns that his humor in the face of the mention of<br />\nconfidence will turn to opposition if sex problems.<br />\nunfulfilled. The radical feeling that<br />\nBy virtue of the admirable teachwar is an essential ingredient of er's psychology that Dr. Guttmacher<br />\ncapitalism, accepts the power of the employed in the delivery of his lecpledge as at least a postponing factor, tures, the subject was discussed in all<br />\nmeanwhile preparing to resist an ac- its detail with absolutely no pretentual outbreak. The two views are en- tive at beating around the bush or<br />\ntirely compatible. Which shall pre- evasion, and purely as an academic<br />\nvail is to be determined by proof of topic, which, in the last analysis, it<br />\npresent experience. Meanwhile, we really is I must admit that when on<br />\nagree on first steps of resistance. first attending lecures I waited with<br />\nWe do not regard it as sanctimonious a sort of horrible anticipation for the<br />\nphrase-mongering, nor do we believe outbreak of the tittering when some<br />\nthat its endorsement alone will stop particularly revealing detail of sex<br />\nwar. It merely says, \"Imperialist activity was under consideration.<br />\nwar is not our war!\"<br />\nHappily, I was spared this, for the<br />\nWith all this if our Strike is to<br />\nhave any appreciable meaning it must<br />\nadopt a realistic attitude toward the<br />\nproblem of war and peace—because<br />\nof the nearness of war at the present.<br />\nAn abstract meaningless approach to<br />\nthe question today is false and suicidal.<br />\nReality demands that the<br />\n<br />\naudience behaved in a most creditable<br />\nfashion, deserving equally their reputations for being intelligent men and<br />\nwomen, and duly appreciative for the<br />\nefforts being made by the usually<br />\nundervalued A.S.U. in bringing Dr.<br />\nGuttmacher of the Hopkins<br />\nAVT<br />\n<br />\nFrosh-Sophs Walter Lippmann<br />\nSlated to Attack<br />\nSwing And<br />\nPacking of Court<br />\nBury Axe<br />\nSurrendering their tomahawks in<br />\nfavor of the beat swing of Bubby<br />\nJohnson and his Orchestra, frosh and<br />\nsophs declared a halt to militant<br />\nactivity last Friday at ten, when the<br />\nirresistible urge to trip the light fantastic forced them to succumb. The<br />\noccasion, of course, was the Freshman-Sophomore Class Dance with<br />\nthe scene of the festivities at the<br />\nMaryland Casualty Clubrooms.<br />\nTermed \"one of the smoothest<br />\ndances of the year\" frosh and sophs<br />\nwere equalled in number, if not surpassed, by upperclassmen, all hilariously enjoying themselves. Harry<br />\nM. Hopkins, chairman of the joint<br />\ncommittee, skimmed about with the<br />\nlovely Miss Elizabeth Facer, sponsor<br />\nof the dance, on one arm, while on his<br />\nface was the benignly smug smile<br />\nbrought on by the realization that the<br />\ndance was a social success in every<br />\nway.<br />\nWith couples trickling in and out<br />\nall evening, and just enough stags to<br />\nmake things a bit more interesting,<br />\nthe affair really went off with a finesse<br />\nthat was amazing to all. Brightly colored frocks, combining with the informal, and in some cases, sports, outfits of the men blended to give a<br />\nmerry<br />\nkaleidoscopic effect. And<br />\nthrough it all—the inevitable Bubby's<br />\nrhythm.<br />\nSo delightfully had the time passed<br />\nthat moans escaped the dancers' lips<br />\nwhen the band showed signs of packing up. So old feuds were forgotten,<br />\nand Hell Week passed into limbo. And<br />\nthe Freshman - Sophomore Dance<br />\nwhere truly \"a good time was had<br />\nby all\" moved into the category of<br />\n\"institution\" at the Hopkins.<br />\n<br />\nJournalist To Discuss Rise<br />\nOf Personal Government<br />\nIn America<br />\nPeabody To Be Scene Of<br />\nLecture; Speaker Is<br />\nLiberal<br />\n(Continued from Page 1, Col. 1)<br />\nof liberal philosophy that placed too<br />\nmuch emphasis on collective action.<br />\nSince he has sought to find a middle<br />\nground between Laissez-faire and a<br />\nplanned economy. Therefore present-day \"pinkish liberals\" and others<br />\nfurther to the left regard him as a<br />\ntraitor to the cause.<br />\nIn 1921 he became an editor of the<br />\nNew York World and served it till<br />\nits death in 1931. He has continued<br />\nhis journalistic career as a feature<br />\nwriter for the New York HeraldTribune, but has not purely endorsed<br />\nits editorial<br />\npolicies.<br />\nAlthough<br />\nagainst Roosevelt, he could not stomach Landon last autumn.<br />\nCalled \"a man with a flashlight<br />\nmind\" by Beverly Smith and generally<br />\nregarded as a pundit and critical authority on governmental policy, Mr.<br />\nLippmann has written many books.<br />\ndealing with political theory, such as<br />\nPublic Opinion, and The Phantom<br />\nPublic. He contributes to the Atlantic, Harper's, and other periodicals.<br />\nMany suspect Mr. Lippmann was<br />\ninvited here to balance the argument<br />\non the Supreme Court proposal. Professor Edward S. Corwin, of Princeton, when here several weeks ago,<br />\ndevoted his entire address to defending the court plan. He also spoke<br />\nunder the Schouler lectureships.<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nOw!<br />\n.•.says Al Schacht<br />\n... the Clown Prince of<br />\nBaseball whoops it up for<br />\nthe grand opening of the<br />\n1937 baseball season.<br />\n<br />\n'tome on\" the<br />\nbleachers roar..:'Swat em out!\"<br />\nAs the big leaguers swing into action<br />\nwatch those Chesterfield packages pop<br />\nout of the pockets.<br />\n<br />\nleague<br />\nfor big<br />\n6<br />\npleasure...<br />\n<br />\nThere's big league pleasurefor you...<br />\neverything you want in a cigarette.<br />\nA homer if there ever was one... all<br />\nthe way'round the circuit for mildness<br />\nand better taste ... with an aroma and<br />\nflavor that connects every time.<br />\n<br />\n.opyright 1937, LIGGin & MYERS TOBACi.o CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "Zlintpu topkitv Nnuadirttrr<br /><br />\nJAY STICKMEN<br />\nROUT PENN, 14-2<br />\nPage 3<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 20, 1937<br /><br />\nVOL. XLI, No. 35<br />\na<br />\nBob<br />\nrethin<br />\nby<br /><br />\n11•11110<br /><br />\nMEAN TO US?<br />\nSEE EDITORIAL ON PAGE 2<br /><br />\n4<br /><br />\nme-<br /><br />\n:ore<br /><br />\nWHAT DOES<br />\n\"Next Thursday's Strike\"<br /><br />\nCourt Plan to<br />\nDraw Lippmann<br />\nFire Tomorrow<br />\nJournalist To Discuss Rise<br />\nOf Personal Government<br />\nIn America<br />\nTALKS TOMORROW EVE<br /><br />\n1<br /><br />\nHullabaloo Offers Ten<br />\nDollar Prize In Contest<br /><br />\nThe Hullabaloo, the University annual, is offering a prize of $10 to be<br />\nawarded to the student suggesting<br />\ntne best name of the new back room<br />\nof the Log Cabin Inn, local tavern.<br />\nAn enthusiastic response greeted<br />\nthe initial appearance of the posters<br />\nadvertising the contest. The numerous suggestions for the names have<br />\nflooded the judges. It is expected that<br />\nmany more will be mailed in.<br />\nThe Log Cabin is located at 3107<br />\nSt. Paul Street, and is reputedly one<br />\nof the favorite hang-outs of Hopkins<br />\nfraternity men. Waitresses there are<br />\nproverbially \"cute, friendly, but<br />\nstand-offish.\"<br />\nEntrants are urged by the sponsors to confine their suggestions to<br />\nnames of a less-particular nature<br />\nthan \"D. U. Annex,\" \"Phi Alpha Annex,\" \"Kappa Sig Annex,\" and so<br />\nforth.<br /><br />\nPRICE 5 CENTS<br /><br />\nArthur H. ComptonIngineer Institute Estimated Four Hundred<br />\nNobel Prize Winner Holds Convention<br />\nWill Take Part hi Strike;<br />\nTalks Here Tuesday April 19 at Hopkins<br />\nChicago Physicist Coming President Bowman And Dr.<br />\nWhitehead Are Among<br />\nNext Week To Supper<br />\nSpeakers At Meeting<br />\nClub<br />\n\"We Must Shape Our New Lehigh Student Wins Prize<br />\nWorld\" Topic Of<br />\nFor Paper On \"Electrical<br />\nTalk<br />\nTime Standards\"<br /><br />\nCouncil Warns Offenders<br /><br />\n_==...<br /><br />\nStudent Council<br />\nAnd<br />\nThe Strike<br /><br />\nMitchell, Lane, Blumberg<br />\nSlated To Speak With<br />\nChurch Leaders<br />\nGROUP<br />\nMajority<br /><br />\nISSUES<br /><br />\nCALL<br /><br />\nVotes To Condemn<br />\nOn Thursday at 11 a. m., a strike<br />\nagainst<br />\nwar<br />\nwill<br />\nbe<br />\nWar<br />\nheld<br />\nas<br />\nJohns<br />\nBudget,<br />\nUphold<br />\nStudent Branch of the American InHopkins participates in the nationOxford<br />\nstitute of Electrical Engineers was<br />\nOath<br />\nwide Peace Day Program. The Stuheld yesterday at The Johns Hopkins dent Council is represented on the<br />\nBy WlETHERED BARROLL, JR.<br />\nWith approximately 400 students<br />\nUniversity. The convention was a Strike Committee and is lending its<br />\nLocal foes of President Roosevelt's<br />\nreputedly ready to suspend clasess at<br />\nplan to enlarge the Supreme Court<br />\nHe will speak before the University meeting of the Baltimore division of support to this organization.<br />\n11 a. m. this Thursday, the Hopkins is<br />\nshould have a field day tomorrow,<br />\nThe Council agrees on many of today facing the fourth edition<br />\nLecturer at the Wilson Memorial th A. I. E. E. and various member<br />\nof<br />\nwhen Mr. Walter Lippmann comes<br />\nChurch at 8.15 p.m. on '\"Why Try? and visiting branches. The program the points brought forth by tde Com- is student strike against war. Obto the Peabody Institute at 8.30 P.M.<br />\nPersonal Freedom and Responsibility consisted of a series of addresses, mittee and looks unfavorably on some servers anticipated the calmest demto lecture on The Rise of Personal<br />\nof the others. Regardless of personal onstration in strike history.<br />\nfrom the Standpoint of Science.\"<br />\ndiscussions, luncheons and dinners.<br />\nGovernment in the United States,<br />\nviewpoints, we are supporting this<br />\nThe younger of the two Comptons<br />\nAlready five speakers are definiteThe address of welcome was pre- strike as a cause worthy of the most<br />\nunder the auspices of the James<br />\nis known for his researches on X-rays<br />\nly slated to address the gathering<br />\nSchouler lectureship. In his column<br />\nand cosmic rays. Since he received sented in the morning by Dr. J. B. careful attention of every student, no from the Gilman Hall Porch. Three<br />\nin the New York Herald-Tribune, the<br />\nhis B.S. degree from the College of Whitehead, Dean of the School of matter what his particular senti- representatives of the University's<br />\nlecturer has time and again declared<br />\nWooster, Ohio, his home town, he Engineering. Dr. Whitehead is the ments may be.<br />\nprofessional corks, Dr._ Broadus Mithis opposition to enlarging the high Dr. Van Kleeck Boosts Co- studied at various universities here only past president of the A. I. E. E.<br />\nLast year ,the demonstration was chell, associate professor of Political<br />\ntribunal; and the subject of his talk<br />\nand abroad—Ohio State, Yale, Wash- now living. After the address stu- conducted in a peaceful, orderly Economy; Dr. Frederic C. Lane, asoperatives Before Med<br />\nseems to indicate that he will attack<br />\nington, California and Cambridge, dent papers were read and discussed fashion—a notable contrast to sev- sociate professor of History; and<br />\nStudents<br />\nthe \"rise of personal government\" On<br />\nand at one time served as research by the group. The papers read eral years preceding when the rowdy- Dr. Albert E. Blumberg, instructor<br />\nin<br />\nthese grounds, as well as others.<br />\n\"Our present medical system is physicist for the Westinghouse Lamp were: \"A Laboratory Polyphase ism of certain students resulted in Philosophy, are at present listed on<br />\nOutdone Early<br />\nnot able to provide the care for the Company. From 1920 until 1923 he Power Rectifier,\" \"Electrical• Time publicity for the University of a most the program.<br />\nEver since his undergraduate days population that medical science makes was Professor of Physics and head of Stndards,\" and \"An Algebraic Equa- undesirable nature.<br />\nOther speakers include the Rev.<br />\nWhen the strike<br />\nat Harvard, where he founded the possible. The responsibility for this the department at Washington Uni- tion Solver.\" The morning's pro- was held last May, the Student Asbury<br />\nSmith, regarded as \"an outSocialist Club, Mr. Lippmann has lack of adequate medical care is di- versity, and since then has been Pro- gram was concluded with a descrip- Council determined to<br />\ndeal stringent- standing liberal churchman,\" and<br />\nbeen in the forefront of those actively rectly upon the industrialized society, fessor of Physics at the University tion of the events for the coming ly with any<br />\nattempts to cause a riot Pat Whelan, leader of the local<br />\nInterested in political and social which cannot keep its standards of of Chicago.<br />\nafternoon and the announcement of or disorder of any type.<br />\nbranch of the International Seaman's<br />\nproblems. His abilities and liberal living parallel to its scientific proDr. Compton discovered total re- the prize winning paper. The honors<br />\nThe same position is being emphat- Union. Whelan plans to discuss the<br />\noutlook soon brought him to •the at- gress,\" said Dr. Mary Van Kleeck, flection and polarization in X-rays, went to T. R. Brown of Lehigh Unipending \"industrial<br />\nically assumed this year.<br />\nmobilization\"<br />\ntention of the late Lincoln Steffens, of the Russell Sage Foundation, be- but he is best known for his discovery versity.<br />\n'ARTICLE VI, Section 4 of the bill.<br />\neditor of Everybody's Magazine and fore four hundred assembled Medical of the \"Compton effect,\" the fall in<br />\nThe convention met for the last Constitution of the Student Council:<br />\nThe Hopkins Student Council yesleading muck-raker of the trust-bust- students at the annual banquet of frequency of the X-rays when scat- time for dinner at the Merchants<br />\n\"The Student Council shall be em- terday issued its annual warning that<br />\ning days of Theodore Roosevelt.<br />\nthe Association of Medical Students tered by collision, which indicates Club, 206 East Redwood St. The powered to promote good order<br />\nin breakers of the peace during the<br />\nAfter serving an apprenticeship un- at Levering Hall, Saturday<br />\nnight. that the rays are corpuscular and not dinner was a joint meeting of The undergraduate affairs and shall exer- strike would be summarily punished.<br />\nder the appreciative reformer, which<br />\nJohns Hopkins Branch and the Bal- cise primary jurisdiction<br />\nMiss Van Kleeck's address was en- a form of wave motion.<br />\nin ques- The Council also expressed symincluded practical investigations of titled<br />\nIn applying this theory to cosmic timore Section of the A. I. E. E. in tion in questions<br />\n\"Economic Aspects of Social<br />\nof<br />\nconduct<br />\non the pathy with \"many of the strike's<br />\ncorruption in American politics, the<br />\nSecurity,\" and was part of a forum rays, he has made many expeditions honor of President A. M. Mac- part of any undergraduate or group aims.\"<br />\nyoung scholar produced in 1912, two on \"nedicine and Social<br />\nPresident MacCutcheon of undergraduates<br />\nSecurity,\" over the world to study the geograph- Cutcheon.<br />\nWith the strike three days away,<br />\nwhich shall be<br />\nyears after leaving Cambridge, a Others speakers were Dr.<br />\nJames ical distribution of cosmic rays and addressed the guests with a talk on deemed unbecoming a gentleman or the committee yesterday issued<br />\nan<br />\nbook-length study entitled, A Preface Warbasse, Surgeon, President of<br />\nthe especially the effect of the earth's \"The Selection and Training of Elec- prejudicial to the honor of the Uni- official statement of purpose and<br />\npolPolitics.<br />\nto<br />\nThe meeting versity.\"<br />\nCo-operative League of America, magnetic field upon their intensity. trical Engineers.\"<br />\nicy. The announcement, approved by<br />\nInstant recognition and applause who spoke on \"Cooperative<br />\nMedicine In 1927, as a result of his work on broke up at 9:00 p.m.<br />\nmajority vote, purported to represent<br />\nOn<br />\nthese<br />\ngrounds,<br />\nthe<br />\nStudent<br />\nwere his. At the present time he is in Denmark,\"<br />\nThe officers of The Johns Hopkins Council requires<br />\nand Dr. G. Canby Rob- high frequency radiation, Dr. Compthe collective opinions of the 13 orthe<br />\ngentlemanly<br />\nconengaged in composing a sequel to inson, of the<br />\nJohns Hopkins Medical ton received the Rumford Medal from Student Branch are: Henry B. Peck, duct of every student at this demon- ganizations represented on<br />\nthe comelaborate this work, The Good So- School,<br />\nwhose topic was \"The Rela- the American Academy of Arts and chairman; Walter 0. Peale, vice- stration and shall treat as a Council mittee. Members of the group<br />\ncalled<br />\nciety, wherein he declares his inten- tion of Government<br />\nto Medical Ser- Sciences and was awarded the Nobel president; Guy F. Stark, secretary; offense any violations of this code.<br />\nit a \"minimum program in the fight<br />\ntion of \"attempting to show the rea- vice.\"<br />\nprize for physics by the Swedish Gordon B. Dickler, treasurer, and<br />\nfor peace.\"<br />\nTHE STUDENT COUNCIL<br />\nsons for the decline of Century<br />\nDr. J. H. Lampe, counselor.<br />\nDr. Van Kleeck's premise is that Academy of Sciences.<br />\nThe committe platform, issued in<br />\nLiberalism.\" However, seven arti(Editor's Note: This statement by<br />\nthere is no reason why the medical<br />\nthe form of a call to the strike, conrecently<br />\ncles of his,<br />\npublished in the service of the country<br />\nthe Council may be taken as demonshould not be<br />\ntained six main planks. First among<br />\nAtlanta Monthly and intended for based on a salaried<br />\nstration of its readiness to act swiftly<br />\nplan, as are all<br />\nits demands was the elimination of<br />\nIncorporation in the book, are merely<br />\nto punish any violation of order durother professions. She believes that<br />\ncompulsory military training in the<br />\nattacks on theories of collectivist<br />\ning<br />\nthe<br />\nstrike.<br />\nSome years ago emthe present system of doctor's fees<br />\nAmerican universities.<br />\nsociety.<br />\nbattled R.O.T.C. members precipitais a hangover of an economic system<br />\nNext to draw fire was the nation's<br />\nFounder of New Republic<br />\nted a riot by turning a hose upon a<br />\nwhich has long ceased to exist in<br />\nbillion-do<br />\nllar budget, condemned \"as<br />\nDuring the decade following his almost<br />\nfaculty speaker.)<br />\nall other professions. The Explosives, Cut - Glass, And<br />\nMan<br />\nEating<br />\na dangerous extension of militarism.\"<br />\nAcids<br />\nAre<br />\nthe<br />\nattracted<br />\nstudy at Harvard he<br />\ncomplete cooperation of doctors and<br />\nUnder this heading it was urged that<br />\nMaltreated Toys Of The Youth<br />\nenthusiasm of most liberal and leftist group is the<br />\nonly way in which it is<br />\nthe<br />\nadministration define the phrase<br />\npartisans. He was one of the found- possible to<br />\nOf J. H. U.<br />\nbring a decent medical<br />\n\"cdequate national defense.\"<br />\ners of the New Republic and drew system within<br />\nthis planned society,<br />\nThe third plank called for defense<br />\na spirited poem of praise from John according to Miss Van<br />\nBy A Staff Writer<br />\nsweepers in the chem labs. GlassKleeck.<br />\nof civil liberties, \"the suppression of<br />\nReed, pre-war radical and fellow\"The professional workers are com. . .. he took more KC1O3 the quan- ware, particularly tubing, is handled Friends of Music Hope To Establish which is the first step<br />\ntowards Fasclassmate.<br />\ning up against the real problems of tity increases, then poured on H2504, like steel bars, showing haw characMusic Fund With<br />\ncism,<br />\nand<br />\nthe<br />\ndefeat<br />\nin<br />\nCongress of<br />\nDespite all this, his relations with tne<br />\nworkers. The problems facing the they picked him up in pieces.<br />\nteristically unheeding of \"silly and<br />\nContest<br />\nthe pending industrial mobilization<br />\nhis associates on the New Republic<br />\n\"Don't look now, son, but aren't outmoded\" rules and regulations the<br />\nsit-down strikers are similar to those<br />\nplan, which proposes universal conbecame strained, and he severed confacing the doctors of the country. It those your fingers dropping on the average freshman is. Blithely, the<br />\nThe Friends of Music Society will scription in times of war.<br />\nnections. He reacted against a form<br />\nIs all wrapped up in our present econ- floor?\" There is an expression in 1936-7 edition takes hold of his bent hold its concert in Levering Hall, the<br />\nOxford Pledge Supported<br />\n(Continued on Page 4, Col. 6)<br />\nomic system, in which the surplus its essence of a situation that has ex- tubing and uses the palm of his hand evening of April 28, at 8.30. The<br />\nThe Oxford Oath, whose upholder<br />\nmoney of society is not given back isted for quite some time in the chem- as a hammer to bang it into a rubber program will consist entirely of pledges himself to<br />\ntake part in no<br />\nistry laboratories in Remson.<br />\nto society,\" she said.<br />\ncork!<br />\nMozart.<br />\nwar of any sort, won the support of<br />\nThe \"suicide fleet,\" the \"Ride of<br />\nThen, a few seconds after he's been<br />\n\"We must recognize a progression<br />\nThis concert is to raise funds for a majority of the committee, \"as a<br />\nof medical treatment towards a more th Four Hundred,\" and the Human at this activity, the natural laws of the purchase of music for the society, factor for unity among<br />\nall groups<br />\nfunctionable service to society. It is Torpedoes have their idealism exem- cause and effect take notice of his and to start a fund to purchase a vic- which strive for peace.\"<br />\nCopies By William Blake Are Noted not merely a matter of fact collect- plified in the attitude of the present efforts, and some poor lab-instructor trola and records. Admission is to<br />\n(Continued on Page 4, Col. 1)<br />\nFor Unusual Intering—as exemplified by the recent col- Freshman Class. In but a few in- is thrilled by this same freshman who be fifty cents, with tickets obtainable<br />\npretation<br />\nlection of statements by doctors re- stances in history is such utter dis- rushes up to him chortling, \"Surprise! at the reference desk of the Library,<br />\nThe Johns Hopkins Library re- cently published in book form--but regard for life and limb recorded as Look what I've got!\" and shoves a Main Reading Room, in Gilman Hall. Graduate Chemists<br />\nceived the facsimiles of the drawings we must deal with the reactionary in the period of time extending from miniature fountain of beautiful, gush- A number of the faculty have already<br />\nWill Hear Donnayi<br />\nby William Blake illustrating The forces in this country which are September, 1936, to the present date. ing crimson into his face!<br />\ngranted their support.<br />\nNow the simple crucifixion of one's<br />\nBook of Job. The illustrations re- against the human forces necessary To the best of our knowledge, chemThe program will consist of Mozart<br />\nThe graduate chemistry students<br />\nistry is a subject in which credit is hand is scorned as being amateurish Concertos,/ Trios, and Quartets. A plan to hold their last tea and lecture<br />\nproduced by the Pierpont Morgan for existence,\" she concluded.<br />\nThis conference was the fourth not especially given for knowing the and bungling in the good work of partial list includes the Trio in E flat of the current season at 3.30 P. M.<br />\nLibrary were donated by Mary C.<br />\nGoodwillie at the suggestion of Dr. to be held since the organization of best way of incapacitating one's bunging up oneself in chem lab! Com- major, for clarinet, viola, and piano; tomorrow in room 221 of Remsen<br />\nKirk, who lectured on Blake to the the Association of Medical Students friends and desk-mates taking the petition for honors, like those of war the Sonata in D major for two pianos, Hall.<br />\nThe speaker will be Dr. J. D.<br />\nas \"An organization set up to con- course with you. It has been necessary vets, has sprung up. When the boys and the Quartet G major \"Eine Kleine H. Donnay of the Geology DepartFriends of the Library.<br />\nThe illustrations of the Bible story cern itself with the economic, ethical, to make a formal announcement to this discovered what fun it was to blow Nachtmusik.\" The performers are to ment, whose topic will be \"A New<br />\nare Blake's own interpretations. and humanistic aspects of medicine.\" extent, because our freshmen seem apart test tubes with hydrogen, they be selected from the members of the Relationship Between External Forces<br />\nto be in an awful daze about their used it with even greater effect on Society, and other invited artists.<br />\nMr. Wicksteed says that Blake's enand Internal Structure of Crystals.\"<br />\ntheir fellows. Even now it is conchemistry course.<br />\ngravings are dry and hard, but that<br />\nBowman<br />\nAppointed<br />\nStudents were warned about such sidered a sure laugh to ask a labthey are original and forceful in<br />\nCorrection<br />\ncharacter and exceedingly vivid in<br />\nTo Annapolis Board obvious precautions as using bunsen mate to light a bunsen flame for you Ping-Pong Tournament<br />\nburners to singe whiskers off in lieu near which a generator is dyspeptiimagery.<br />\nOn Levering Program<br />\nThe NEWS-LETTER regrets that<br />\nDr. Isaiah Bowman, President of of shaving, pouring hot, melted glass cally belching forth hydrogen!<br />\nIn the preface of the book, it is<br />\ndue to the article concerning the<br />\nOf course the eventual wind-up (or<br />\nThe first activity sponsored by the<br />\nstated that since Blake's God is Di- The Johns Hopkins University, has on their hands to \"give them that<br />\nR. 0. T. C. Military Ball, apvine Humanity, which he identifies recently been appointed to the Naval school-girl complexion,\" and employ- blow-up) of all this is going to be Levering Hall Game Committee is<br />\npearing in the issue of Friday,<br />\nsometimes as the Poetic Genius . . . Academy \"Board of Visitors,\" whose ing sulphuric and other acids and al- simply that the boys will claim that to bea collegiate ping-pong tournaApril 16, 1937, many readers have<br />\nto him Job's spiritual sin is one of duties consist of inspecting the An- kalies as an eye-wash. They were they have acquired a course in prac- ment. Playing will begin next Monreceived the erroneous impression<br />\n\"materialism and complacency.\" It napolis School and then making any also told that if hydrogen gas were tical chemistry, and at the same time day, and all entrants must sign up<br />\nthat admission to the dance is by<br />\nIs here that Blake diverges from the suggestions to Congress for neces- to be mixed with air, and a match have learned to save their money. at Levering Hall before Saturday<br />\ninvitation only. The Military Ball<br />\nsary<br />\nHow?<br />\nimprovements<br />\nignited<br />\nthe<br />\nBecause<br />\nvicinity,<br />\nin<br />\nthey<br />\nwhich<br />\nan<br />\nonly<br />\nexplosion<br />\nneed<br />\nto buy noon. Prizes will be awarded.<br />\northodox interpretation of The Book<br />\nmay occur<br />\nis not a closed affair, tickets being<br />\nof Job and, says Dr. French, it is this to them. Dr. Bowman has been se- would result. In spite of all warn- one glove, one sox, one shoe, this<br />\nThe ping-pong equipment and the<br />\non sale and offered to all at Levernew interpretation that rounds out lected in regard to the academic ings, entreaties, and threats, roasted making wearing apparel last twice prizes have been donated by Dr. G.<br />\ning Hall at $1.25 per copy.<br />\nJob's features and coarsens his ex- point of view and will visit Annapolis meat, chopped meat, and grilled meat as long and take but half-fares home. Wilson Schaffer, Director of Aththree days, from April 26 to 28.<br />\nhas been the favorite food of the You see, there's only half of them letics at the Hopkins.<br />\npression.<br />\nPeabody To Be Scene Of<br />\nLecture, Speaker Is<br />\nLiberal<br /><br />\nDr. Arthur H. Compton, noted<br />\nphysicist and Nobel Prize winner,<br />\nwill address the University Supper<br />\nClub next Tuesday, April 27, at 6.00<br />\np.m. on the topic, \"We Must Shape<br />\nOur New World.\"<br /><br />\nThe thirteenth convention of the<br /><br />\nCites Inadequacy<br />\nOf Medical System<br /><br />\nFrosh Fiends Fie Upon Loss Of<br />\nLift, Limb; Chem Lab Their Play<br /><br />\nSociety Will PresPnt<br />\nProgram of Mozart<br /><br />\nFamousPictures Are<br />\nDonated To Library<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 20, 1937<br /><br />\n2<br /><br />\nObt jobntopttn<br /><br />\nrest and the spending of large sums on armaments re-<br /><br />\nLETTER TO<br />\nTHE EDITOR<br /><br />\nsuited in the organization of this first strike against<br />\nwar. Twenty-five thousand students participated, although the strike had been neither well organized nor<br /><br />\nletter<br /><br />\ngeku5<br /><br />\nwell publicized.<br /><br />\nUniversity administrations throughout<br /><br />\nThe A. S. U. and Peace<br />\nTo the Editor of the NEWS-LETTER:<br />\nthough there were several noticeable exceptions. Un- Dear Sir:<br />\ndergraduate rowdyism, however, was evident only in a<br />\nIn preparation for the Strike<br /><br />\nthe country went on record as opposed to the strike, al$2.00<br />\n$2.50<br /><br />\nSubscription per year__<br />\nBy Mail -----<br /><br />\nfew schools, one of these being The Hopkins.<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRentsen Hall, Postoffice, Johns Hopkins University.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nin Illaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by undergraduates of the Johns<br />\nHopkins University.<br /><br />\nAgainst War, the American Student<br />\nIn the following year the need for a strong protest Union takes this opportunity to preagainst war was even more evident. A nation-wide sent its views on the strike and its<br />\nresponse followed an appeal for wide student support objectives.<br />\nof the strike, 175,000 students took part in an orderly,<br />\nQuoting from the program of the<br />\nserious, and intelligent demonstration, marred only in A. S. U: \"The present heightened ina few places by small rowdy groups. When over 500,000<br />\nternational tension should make us<br />\nstudents protested last year, it was proved beyond a<br />\ndoubt that the movement was not merely a student more alert to the peril of American<br />\nfancy, but a serious protest and one to be reckoned with. conflict with Japan or other imperAt The Hopkins the student strike had the same type<br />\nof growth. Last year a large portion of the student<br />\nbody participated in an orderly strike, in which many<br />\nshades of thought were represented. This year the outlook is brighter than ever. Fourteen campus organizations are sponsoring the student protest, thus showing<br />\nclearly that student interest in the strike is not based<br />\nin any one group, but on popular support from all students.<br /><br />\nEDITORIAL STAFF<br />\nEditor•in-C f<br />\nStanley Finkel<br />\nManaging Editors<br />\nJ. Murray Kempton, Benjamin Root<br />\nAssociate Editor<br />\nWethered Barroll, Jr<br />\nSports Editor<br />\nHarold Zheutlin<br />\nAssistant Managing Editors<br />\nJ. C. Handelsman, Victor M. Victoroil<br />\n— _Columnist<br />\nPaul Berge<br />\nReporters--Julian Adler, Milton Alperstein, Zeana Baum, William<br />\nBurford, Mal Boshnack, Charles Diggs, Nathaniel Finkelstein,<br />\nArnold Glantz, Jewett Goldsmith, Max Iskowitz, Arthur Katz,<br />\nThis situation is typical of that in the nation at large.<br />\nMartin Krieger, Irving Milberg, Leonard Quitt, Carl Rasin,<br />\nHoward Reizenstein, Lester Rosenthal, Leonard Rubinger, Supported in 1934 by but one organization, the strike<br />\nSeymour Sacks, Joseph Samovitz, William Snyder, Morris<br />\nWessel.<br />\nWilliam B. tempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Willen<br />\nHoward Linkoff<br />\nNathaniel Soifer<br /><br />\ntoday is sponsored by peace organizations of all kinds.<br />\nWhereas at one time it was charged that the strike was<br />\nBUSINESS STAFF<br />\nonly a medium for the so-called \"radicals,\" today these<br />\nBusiness Manager<br />\n—_— Assistant Business Manager groups are distinctly in the minority, both nationally<br />\nAdvertising Manager and on the campuses.<br />\nCirculation Manager<br />\nThe student strike is supposed to be a rehearsal for<br />\nOffice Manager<br />\nCopy and Filing Manager a future day which we all hope will never come. When<br /><br />\nMember<br /><br />\n1936<br /><br />\n1937<br /><br />\nRssocialed ColleeSithe Press<br />\nDist riburors ol<br />\nGDile5iale Dieest<br />\nCCCCCCSPITED FOR NATIONAL ADVERTISING BY<br /><br />\nNationai Advertising Service, Inc.<br />\nColleze Publishers Represestatfre<br />\nNEW YORK. N.Y.<br />\n4k0 MADISON AVE.<br />\nCHic,o0 - BOSTON - SAN FRANCISCO<br />\nLOS ANGELES<br /><br />\n-<br /><br />\nFORTLANE<br /><br />\nSE<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nAtlantic States<br />\nMiddle<br />\nOf<br /><br />\nTUESDAY, APRIL 20, • 1937.<br /><br />\nThursday's Student Strike<br />\nThis Thursday, at eleven o'clock, students of the<br />\nJohns Hopkins University will join thousands of likeminded students throughout the world in an attempt to<br />\nshow to the public how we feel about war.<br />\nA broad program, supported by campus organizations<br />\nof a varied character and opinion, is planned. This program is merely a rallying point for the entire student<br />\nbody, who are given an opportunity to join in a concerted move to tell the world that we hate war. We will<br />\nbury our differences while uniting our voices in a concerted condemnation of this meance to civilization and<br /><br />\nOn The Literary Horizon<br />\nSpring Note<br />\nThe onset of spring — theme of<br />\ncountless poets and authors through<br />\nthe ages—is again being commemorated. Amid the avalanches of publisher's blurbs—reviews, advance notices and reprints—there comes the<br />\nhomely<br />\ntouch—the<br />\ndown-to-earth<br />\nspirit of Rural America—the Sears<br />\nRoebuck Catalogue. In the \"Spring<br />\nBooks\" number of the Saturday Review of Literature, there appears an<br />\nunexpected review, ably written by<br />\nLowell Thompson of the HoughtonMifflin Company, entitled: Eden in<br />\nEasy Payments.<br /><br />\nialist nations over economic stakes<br />\nin the Orient and South America—<br />\nstakes which are of benefit, as in the<br />\ncase of all wars fought by imperialist<br />\nnations, not to the American people,<br />\nbut a handful of powerful American financial and industrial groups.<br />\nThe present boldness of Fascist Italy<br />\nand the belligerence of other Fascist<br />\nnations merely reveal that international conditions in these countries<br />\nare most acute<br />\nIn these bitter<br />\nclashes the American financial barons<br />\nare directly involved . The approach<br />\nof another European war hastens the<br />\nday when these interests will again<br />\ndictate American entrance — unless<br />\nthey are fought relentlessly now.<br /><br />\nAnd indeed, it is very probaole that<br />\nof all the books mentioned, this one<br />\nwill be read and pored over by more<br />\npeople than any other—despite the<br />\noptimistic ads of the publishers. For<br />\nhere is the American Bible—outside<br />\nthe urban communities—here is the<br />\ncuriously-solid Eden of America.<br />\nHere we have the guide-book to a<br />\nnew region of life which finds its<br />\nneeds, luxuries, and pleasures within<br />\nthese hallowed pages. \"The Sears<br />\nRoebuck Catalogue: Spring and Summer 1937,\" (Chicago, the Sears Roebuck Co., 1937), is as sure a harbinger<br />\nof spring as the shoots of grass—the<br />\nfreshness of recent rain — or the<br />\nfledgling best-sellers-of-the-future.<br /><br />\nthose who govern the destinies of nations perceive that<br />\n\"The A. S. U. uncompromisingly<br />\nyouth, the backbone of former militarism, is turning opposes the war preparations of our<br />\naway from them, they will be hesitant in starting wars. own government. It undertakes to<br />\nMoreover, the methods of 1914 cannot work again. organize the collective resistance of<br />\nThe student peace movements of that day were handi- students now against the steps which<br />\ncapped by a fundamental weakness, ignorance. The lead to war and in the event of war<br />\ntrue facts about the causes of war had not been pre- to the war itself. . . . The war which<br />\nsented clearly to the world. An appealing excuse could we shall be called on to wage must<br />\nbe, and was found for the entrance into the World War. be aggressive in character and purToday we realize some of the basic causes of war, and pose, and the interests we shall be<br />\nwe have seen historically that wars are futile, as far asked to defend will be those of the<br />\nas obtaining what the majority of the people want is few, not of the many. These circumconcerned. We know the evils of war and should try stances demand independent organito prevent it. The best way of showing our animosity zation, and action against war by the<br />\nis by supporting the strike. It is the duty of every Hop- anti-war forces of the world, prekins student to be in front of Gilman Thursday at 11:00 eminent among which is the organo'clock.<br />\nized labor movement.<br /><br />\nThe Strike And The Future<br /><br />\n\"The anti-war strike is a declaration of our determination to prevent<br />\nour government from going to war.<br />\nIt is, moreover, a dress rehearsal of<br />\nthe action we will take the moment<br />\nour government seems likely to declare war.<br /><br />\nWe don't suppose it is too much to say that Mars is<br />\nnot the most popular among our gods these days. Except for the tiny minority of deep thinkers who see in<br />\nIt some cure for our economic woes, we have trouble<br />\nfihding anyone with anything good to say for the resort<br />\nto arms. The vast majority want no part of the next<br />\n\"The A. S. U. accepts without<br />\nwar. And the Institute of Public Opinion, in a survey reservation the Oxford Pledge 'to relast week, discovered that 70 per cent of those it ques- fuse to support any war which the<br />\ntioned thought the last one was a mistake.<br />\nUnited<br />\nStates<br />\ngovernment<br />\nmay<br />\nYet, on every hand, we hear that war is \"imminent.\" undertake.'\"<br /><br />\nMr. Roosevelt's New Deal, thumpingly endorsed at the<br />\npolls last November, is preparing to pay out $1,180,000<br />\nthis year for what it considers \"adequate\" national<br />\ndefense. Here is a budget item second only to that for<br />\nrelief. Its elimination would go far towards balancing<br />\nthe New Deal's books. What is more, the administration has presented little or no valid argument for such<br />\nexpenditure. It hasn't even told us anything about the<br />\nparticular threat against which our shores must be<br />\nprotected. To all intents and purposes, we are buying<br />\nour pig in a poke. Now, even the most violent of the<br />\ncritics of Mr. Roosevelt's spending have lifted no outcry<br />\nover what at first blush appears the most ridiculous<br />\nwaste of all . Thus, we can only surmise that our people<br />\nworthwhile gesture.<br />\nWe think it effective in focusing attention upon our consider it a necessary one.<br />\nconcern with the problem of War. We students must<br />\nThat's a pretty tragic situation. The vast majority<br />\ncreate a profound impression of our attitude upon public of us hating the thought of a war to come, and pre-<br /><br />\nsecurity.<br />\nBut of what value is this strike, called an \"empty<br />\ngesture.\" \"a strike against weather\"? To the critics,<br />\ncynics, and condemners of this strike we say:<br />\nWe students want to assemble together in a widespread expression against war, knowing that we are<br />\njoined by thousands of our comrades on every campus.<br />\nWe are encouraged by the feeling of solidarity. We want<br />\nto demonstrate to the world that we think about such<br />\nserious problems as war.<br />\nAnd we consider the massing of students, after<br />\nwalking out of classes to hear thinking student and<br />\nfaculty speakers discuss war from varied angles, a<br /><br />\nopinion.<br /><br />\npared to spend a billion dollars to fight it.<br /><br />\nWe find this strike fits in with our desire of arousing<br />\nand organizing student opinion against war.<br />\nWe do not look upon the manifestation as an isolated,<br />\n\"flash-In-the-pan\" outlet of our feelings. We want to<br />\nbe constantly discussing, studying and doing things<br />\nabout War.<br />\nThis strike is just one of the way in which we can<br />\ntell the world that we students are realistic thinkers.<br />\nWe have examined some of the past wars; we say<br />\nthat the 13,000,000 men killed died in vain. But not in<br />\nvain if they have taught us to profit by their experience<br />\nand learn of war's real nature.<br />\nWe no longer will be fooled by emotional slogans, by<br />\nbeating drums, by jingoistic hysteria. We will not be<br />\ndrugged by the propaganda of hatre.<br /><br />\nBy the mere fact of this outlay the New Deal has<br />\nshown itself defeated in the fight to keep the peace.<br />\nMr. Roosevelt, the most popular President in years, is<br />\nsupposedly expressing the national will by the maintenance of a war budget in times of peace.<br />\nWhich puts the whole matter right back in the laps<br />\nof the people themselves. Our only hope of staying<br />\nout of war lies there. No government can carry on any<br />\nwar in the face of the will of the vast majority of its<br />\ncitizens. If we can make that opposition felt, the world<br />\nmay yet be saved.<br /><br />\nTherein lies the importance of the coming student<br />\nstrike against war. It is a dramatic declaration against<br />\nthe forces which are edging us towards the abyss.<br />\nBut dramatic expressions are not enough. The fight<br />\nfor<br />\npeace cannot be won with one stroke. We cannot<br />\nBut we want to strip war of all its pretenses and<br />\ncease to push it, at home and abroad, on the rostrum<br />\nfind what is behind the imperialism, nationalism and<br />\nand at the polls.<br />\nmilitarism that lead to the nations' frenzied armament<br />\nMost of all, we must remember that, when all is said<br />\nAllies<br />\nloan<br />\nhuge<br />\nraces. We seek to learn about the<br />\nbefore the war, about the profits of the armament- and done, we are the ones who make the wars. To<br />\nmakers, about the organized propaganda of the press. assign the last war to the Morgans and the Duponts is<br />\nAre you ready to succumb to the damnable lies, to a simple business. But, the people who burned the<br />\nthe sham flag-waving, to the prostituted voices of the pacifist in effigy in 1917 were fundamentally decent<br />\npulpit and academician, to the money-controlled press and ordinary folk, who had been horrified at the thought<br />\nof war six months before. We have no reason to believe<br />\nand radio?<br />\nthat it won't happen to them again.<br />\nNeither are we.<br /><br />\nThus, the success of the strike, in the long run, must<br />\ndepend on the amount of impetus it provides the fight<br />\nfor peace. In a single hour out of classes we cannot<br />\nThe history of the annual Student Strike Against hope to win that fight. But, through it, we can launch<br />\nWar since the first strike three years ago, shows a the drive which may save us from catastrophe.—J. M. K.<br />\nmovement continually increasing in strength and one<br />\nwhich may prove to be very beneficial to the world at<br />\nlarge. From small, but auspicious beginnings, the<br />\nWe are happy to announce the election of Wedgy Barstrikes have gained more and more footholds in American Universities, and it is expected now that more than roll to the position of associate editor; Hal Zheutlin,<br />\na million students will assemble Thursday on the differ- sports editor; Vic Victoriff and Jack Handelsman, assistent campuses to serve notice upon the warmakers that ant editors; and Leonard Quitt and Bill Snyder as memthey refuse to be fooled again, that they recognize the bers of the staff.<br /><br />\nA Little History<br /><br />\nMerited Honors<br /><br />\nThe tremendous growth in power<br />\nof the Strike Against War since its<br />\ninception is well demonstrated in the<br />\nincrease from 25,000 students participating in 1934, and the 500,000 in<br />\n1936: This year a million are expected to answer the Strike Call. The<br />\nexperiences of the past three years<br />\nhave reduced opposition to the Strike<br />\nto a tiny reactionary whine. But it<br />\nis well to briefly state the meaning<br />\nof the Strike. It has come to mean<br />\nabstention from normal routine activities as a method of impressing the<br />\ndeep student anti-war sentiment, and<br />\ndemands upon our government in a<br />\ntone far more serious and determined<br />\nthan any single petition or meeting<br />\ncould provide. It is also an essential<br />\npart of our strategy for disrupting<br />\nmobilization plans should they be imposed upon the universities. To the<br />\nextent that administrators are preparing to accept those mobilization<br />\nplans, the strike is directed \"against\"<br />\nthem. To the extent that they are<br />\nprepared to carry on in behalf of<br />\npeace, their support should be extended to the strike. Once that is<br />\ngiven, any confusion about the purpose of the strike will be removed,<br />\n( Continued on Page 4, Col. 3)<br /><br />\nSPRING THOUGHT<br />\nThe trouble with the human race—<br />\nI find that it's a fact—<br />\nIs that they slump while sitting,<br />\nAnd get a rounded back.<br />\nWhen they see someone sitting<br />\nStraight as when made by God,<br />\nThey say with much derision,<br />\n\"His spine acts like a rod.\"<br />\nYou never can constrain them<br />\nTo stick out their manly chests;<br />\nThey sit around and slouch all day,<br />\nAnd put wrinkles in their vests.<br />\nBut they will learn some day too late,<br />\nWhen their clothes hang like a sack,<br />\nAnd, beneath their rounded shoulders,<br />\nTheir chest comes out in back!<br /><br />\n(This weighty bit of philosophy<br />\nwas found in the office trash-basket,<br />\nThese fellows were active in their service to the NEWS- following the exit of a young man<br />\nfutility and hypocrisy of the last war.<br />\nThe first student strike was held in April, 1934, at a LETTER and well merit these promitions.<br />\nwith a dreamy look. We thought it<br />\nCongratulations!<br />\ntime when the situation looked black. Economic unwas love.)<br /><br />\nern Front, and so on through to the<br />\nend of the impressive story. The<br />\nbook is ably reviewed by George<br />\nStevens. Its author has chosen to<br />\nremain anonymous.<br />\nA Master Grows Hysterical<br />\nIt is always a painful task to read<br />\na book by a favorite author, and<br />\nrealize that it just doesn't measure<br />\nup to his better works. Such is the<br />\nsaddening experience<br />\nwith<br />\nVery<br />\nHeaven, by<br />\nRichard<br />\nAldington,<br />\n(Doubleday Doran Co., Garden City,<br />\nNew York, $2.50). Mr. Aldington<br />\nwas a poet—of distinction, but little<br />\nweight, until the time of the war.<br />\nBut from that fire he emerged, not<br />\nbroken, but saddened—not bitter, but<br />\ncynical—maintaining his deep sympathy, and inherent romanticism,<br />\nwhich mark him among the leading<br />\nEnglish authors of the decade past.<br />\nTwo brilliant books—a term used advisedly, \"All Men Are Enemies,\" and<br />\nDeath of a Hero, were published<br />\nand received enthusiastically. His<br />\nwork is cutting, but seldom cruel—<br />\nhe despises the smug ignorance of<br />\nhis own society—as was said of Jonathan Swift by a contemporary—\"He<br />\nloves Tom, Dick and Harry, but<br />\ndespises the human race.\" And this<br />\nis perhaps true.<br /><br />\nThe Saturday Review has found<br />\na book long ago worthy of its austere columns, and brings to a place<br />\nof deserved dignity that unfailing<br />\nbarometer, that gaily-colored reflection of rural paradise—the mail-order<br />\ncatalogue.<br />\nA Centennial<br />\nThe \"changing American Scene\"<br />\nhas a bad habit of changing so very<br />\nrapidly that the celebration of any<br />\ncentenary is an event of more than<br />\npassing interest. Such is the 100th<br />\nanniversary of the publishing house<br />\nof Little Brown &amp; Company, 34 Beacon Street, Boston. With this spring,<br />\nthe firm joins ranks with only three<br />\nother houses which have lived the<br />\nhundreth year.<br />\nA small handbook<br />\nhas been privately printed by the company—One Hundred Years of Publishing, (Boston, Little Brown &amp;<br />\nCo., 1937)—and comes to the general<br />\npublic through a review in the special supplement of The Saturday<br />\nReview, commemorating this birthday, and sent with its March 27 issue.<br />\nThe story is traced from the association of Charles C. Little, and James<br />\nBrown, recruited, in accord with the<br />\ncustom of the nineteenth century,<br />\nfrom the ranks of booksellers, and<br />\ntheir early struggles to the memorable occasion when keen editorial<br />\njudgment published \"Quo Vadis,\" and<br />\nswept the country to new heights of<br />\nsale figures. And the same year<br />\ncame the Boston Cooking - School<br />\nCook Book of Fannie Farmer—<br />\nwhich has sold to date 1,736,000<br />\ncopies—keeping, as the reviewer puts<br />\nit, \"a good jump ahead of Gone With<br />\nthe Wind.\"<br />\nFrom then on, the story grows<br />\nmore familiar—A. S. M. Hutchinson<br />\nand his If Winter Comes, the publication of the Atlantic Press Books,<br />\nof which the best-known is the Nordhoff - Hall star — Mutiny on the<br />\nBounty — All Quiet on the West-<br /><br />\nBut \"Very Heaven\" is too much<br />\nabout our economic and social problems of today, and too little about the<br />\nefforts of men to maintain clean and<br />\nglowing that spark of the Infinite<br />\nwithin themselves, in spite of their<br />\nmisfortunes. Romantic -- yes, but<br />\nwith a less ambitious and therefore<br />\nnearly hackneyed romanticism. The<br />\nstyle is the cold, cutting Aldington<br />\nat his best—matured a little since<br />\nDeath of a Hero, but full of vigor<br />\nand barely-checked invective against<br />\nstupidity, crassness and blindness.<br />\nThe story is simple, as are all of<br />\nMr. Aldington's, and universal. Chris<br />\nHeylin, forced to leave his books due<br />\nto family reverses, refuses to give up<br />\nhis academic outlook, despite the efforts of his mother to force his marriage to a woman of considerable<br />\nwealth, the sacrifice of his sister,<br />\nand his father's death. The attendant<br />\ncharacters are perhaps a little too<br />\ncarefully drawn; they have too much<br />\nof a place as symbols to become<br />\npeople. Chris is a little too much<br />\ninclined to become a vehicle for the<br />\nauthor's discussion of sterile society,<br />\nand its outmoded conventions and<br />\nfalsities.<br />\nIn short, after reading this able<br />\ndiscussion, there is not the feeling of<br />\nsaddened exaltation which accompanies his other greater works. He<br />\nis lost in Very Heaven, in the<br />\nrealms of sociology.<br />\nHowever, let it be made perfectly<br />\nclear that Aldington never commits<br />\nthe unpardonable error of proposing<br />\na thesis in his novels. The problems<br />\nhe treats are not solved at the end.<br />\nHe does not theorize. His is the individualistic outlook, which can see<br />\nthe evils, and indicate a better existence, but does not presume to show<br />\na path for the transition. His is the<br />\nprose of a poet saddened, but still<br />\nvigorous. His treatment is, as always, completely frank, unsensational, and fearless.<br />\nW. B.<br /><br />\nGREEK LETTER NOTES<br />\nPHI GAMMA DELTA<br />\nIn the recent elections of the Hopkins Chapter of Phi Gamma Delta,<br />\nJohnny Royster was elected president; Boyd Frey, treasurer; Allen<br />\nHill and Jack Hunter, secretaries;<br />\nand Flub Price, historian. Don Naylor, Charley Dunning, and Pete Swindell are the retiring officers.<br />\n• • *<br /><br />\ntion time, the Phi Alpha continued<br />\ntheir social program by holding a<br />\ntea dance last Sunday afternoon. Real<br />\ntea was served and Brother Rostov<br />\npoured at 4.30. House parties are<br />\nscheduled for following Saturdays<br />\nand another formal is due early in<br />\nMay. It seems as if the boys are<br />\ndancing their troubles away.<br />\n•<br /><br />\nTAO is throwing a big barn dance<br />\nHenry Kramer was recently elected<br />\nmstaer frater of the local Shirley on May 1.<br />\n• * •<br />\nTemple Club. Congratulations, Henny.<br />\nALPHA DELTA PRE<br />\n*<br />\n*<br />\n*<br />\nThe Alpha Delta are going hard<br />\nBETA THETA PI<br />\nfor the<br />\nseason's<br />\npoint-to-points.<br />\nAlpha Chi of Ian is pleased to<br />\nJohnny Fenwick came in second in<br />\nannounce the pledging of Louis Garthe Junior steeplechase two weks ago.<br />\nben of Islop, Long Island, and Al<br />\nHugh O'Donovan came in fourth and<br />\nSmith of Chateau Avenue, Baltimore.<br />\nPage Edmunds took a hard fall to<br />\nBeta's baseball team, featuring<br />\nthe good earth. Wedge Barroll was<br />\nhome runs by Wagner and Coady<br />\non the side lines nursing his famous<br />\nand whiz-ball pitching by Brer Hemtoe-nail.<br />\nming, has won its first two games.<br />\n• * •<br />\nNo doubt Wagner gets his hefty<br />\nPHI SIGMA DELTA<br />\nswing from his work on the golf<br />\nOne hundred and fifty couples atteam.<br />\ntended the annual Phi Sig formal<br />\n* * •<br />\nSaturday night. For a change, all<br />\nDave Caplan celebrated his 21st<br />\nthe \"wolfing\" was done by the dorm<br />\nbirthday Saturday night with a chamboys. Stan Finkel came down from<br />\npagne party at the Pi Lam House.<br />\nthe INA convention, right off the<br />\nAnn Spear, his date, accepted all the<br />\ntrain, carrying his bag for a date.<br />\ncongratulations.<br />\nSi Treib and Milt Tuerk were the<br />\n*<br />\n*<br />\n*<br />\nrecipients of several bills incurred by<br />\nPHI ALPHA<br />\ntheir dates at a local apartment.<br />\nFollowing up their successful week- house. It pays to use local products,<br />\nend of Spring Dances before vaca- boys.<br /><br />\n;<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 20, 1937<br /><br />\nLacrosse Squad<br />\nRouts the UofP;<br />\nFinal Score 14-2<br />\nBlue Team Has Easy Time<br />\nWith Visiting Red and<br />\nBlue Aggregation<br />\nPENN<br /><br />\nSCORES<br /><br />\nFIRST<br /><br />\nScore Tied 1-1 At End Of<br />\nFirst Quarter Of<br />\nTilt<br />\nOnce again the powerful but slow<br />\nstarting Blue Jay lacrosse team<br />\npurred along smoothly in the second<br />\nand third quarters to crush a game,<br />\nbut highly outclassed squad from the<br />\nUniversity of Pennsylvania in the<br />\nfirst attraction of the doubleheader<br />\nstaged at Homewood on Saturday<br />\nafternoon.<br /><br />\nThe final score of the<br /><br />\nHopkins tilt was 14-2.<br />\nPenn drew the first blood of the<br />\ngame when Al Nye, star end of the<br />\nred and blue football team, dogged<br />\nhis man and rushed in unguarded to<br />\nslip the ball past Kahl. This score<br />\nwas soon nullified, however, when<br />\nNorm Melvin dented the netting after<br />\nreceiving a pass from Hammer Hines.<br />\nThis evened the count and the score<br />\nremained this way until the end of<br />\nthe first quarter.<br />\nAttack Function<br />\nWith the beginning of the second<br />\nquarter the Hopkins attack began to<br />\nfunction smoothly, and with Johnny<br />\nEnders, freshman wing attack, leading the advance by scoring two goals<br />\non beautiful cuts, the Penn goalie,<br />\nMaksik, who played a bang-up game,<br />\ndespite the score, found too many<br />\nshots coming his way to stop them<br />\nall. The result was that the Morrillcoached outfit held a 6 to 1 advantage<br />\nat the half-way mark.<br />\nThe Hopkins ten continued the onslaught after the intermission and<br />\nhurled a barrage of shots, many of<br />\nwhich found the mark at the enemy<br />\ncords. While the attack was thus<br />\nperforming nobly, the blue defense<br />\nwas also doing a fine job, allowing<br />\nfew shots to be taken at the goal,<br />\nand clearing the ball excellently. All<br />\nIn all, only thirteen attempts were<br />\nmade by the Pennsylvania team,<br />\neleven of these being stopped by the<br />\ncombined efforts of Kahl and Passano, each goalie allowing one ball to<br />\nget by him.<br />\nKempton Spectacular<br />\nThe goal scorers were led by Enders, Dukehart and Kempton, each<br />\nobtaining three counters apiece.<br />\nKempton made the most spectacular<br />\nshot of the day when he let the ball<br />\nfly over his shoulder while his back<br />\nwas turned toward the goal.<br /><br />\nTuesday, April 20—<br />\nNightriders versus Nine J's.<br />\nSenior Mechanics versus Library<br />\nWednesday, April 21—<br />\nCardiacs versus Tigers.<br />\nN. J. All-Stars versus Literati.<br />\nThursday, April 22—<br />\nSee Ease versus Whirlwinds,<br />\n4.15.<br />\nSee Ease versus Senior Elecs.,<br />\n5.00.<br />\nJunior Elecs versus Junior Gas.<br />\nFriday, April 23—<br />\nSenior Gas Civils versus Blue<br />\nBears.<br />\nCement Mixers versus Tech<br />\nHawks.<br /><br />\nHaverford Wins Track Meet<br />\nOver Blue And Black, 109-17<br />\nAt Haverford, last Saturday a<br />\nShotput—Won by Holzer, Haverwell-balanced Haverford track and ford; second, Debausset, Haveford;<br />\nfield team, paced by two stellar in- third, Carleton, Johns Hopkins. Disdividual performers, swamped a hard tance-43 feet<br />\nstriving Blue Jay aggregation.<br /><br />\nTuesday, April 20—<br />\nAlpha Epsilon Pi versus Beta<br />\nTheta Pi.<br />\nPhi Sigma Delta versus Phi<br />\nKappa Psi.<br />\nWednesday, April 21—<br />\nAlpha Chi Rho versus Delta Phi.<br />\nPi Lambda Phi versus Delta<br />\nUpsilon.<br />\nThursday, April 22—<br />\nSigma Phi Epsilon versus Phi<br />\nEpsilon Pi.<br />\nKappa Sigma versus Tau Alpha<br />\nOmega.<br />\nFriday, April 23—<br />\nTau Alpha Phi versus Kappa<br />\nAlpha.<br /><br />\nJay Batmen Lose<br />\nTwo On Road Trip<br /><br />\n440-Yard<br /><br />\nJOHNS HOPKINS<br />\nG. S.<br />\n9<br />\nDukehart, ih<br />\n3<br />\n5<br />\n3<br />\nKempton, ih<br />\n1 11<br />\nMelvin, oh<br />\n3<br />\n0<br />\nBernheim, oh<br />\n9<br />\n0<br />\nKaufman, fa<br />\n1<br />\nSiegel, fa<br />\n1<br />\n4<br />\nBeeler, fa<br />\n1<br />\n6<br />\n3<br />\nEnders, sa<br />\n3<br />\n2<br />\nHimes, c<br />\n5<br />\n0<br />\nYearley, ad<br />\n2<br />\n0<br />\nBuck, od<br />\nNaylor, p<br />\n1<br />\n0<br />\n14<br /><br />\nPENNSYLVANIA<br />\nG.<br />\n0<br />\nPerlstein, ih<br />\n0<br />\nNeedle, 1k<br />\nVorheis, oh<br />\n0<br />\nNye, fa<br />\n1<br />\n0<br />\nPanzer, ea<br />\n1<br />\nDolman. sa<br />\nKessler, c<br />\n0<br />\nGordon, ed<br />\nu<br /><br />\n59<br /><br />\ninches.<br /><br />\n3/4<br /><br />\nDash—Won<br /><br />\nby Hunt,<br />\nvictorious cindermen captured first Haverford; second, Langford, Johns<br />\nplace in all but one of the fourteen Hopkins; third, Carey, Haverford.<br /><br />\nevents to decisively manifest their Time-52.2.<br />\nsuperiority in every branch of competition.<br /><br />\nThe<br /><br />\nfinal<br /><br />\nscore<br /><br />\nTwo-Mile Run—Won by Driscoll,<br />\nwas Johns Hopkins; second, Morris, Hay-<br /><br />\n109-17.<br /><br />\nerford; third,<br />\nTime-10.15.7.<br /><br />\nHolzer Outstanding<br /><br />\nCarey,<br /><br />\nHaverford.<br /><br />\n220-Yard Low Hurdles—Won by S.<br />\nEvans,<br />\nHaverford; second, John<br />\nChuck Holzer and Debausset contributed to the subjection of the in- O'Neill, Johns Hopkins; third, Mosevading Blue squadron. Holzer tal- ley, Haverford. Time--25.6.<br />\n220-Yard Dash—Won by Hunt,<br />\nlied 16 points for the afternoon;<br />\nwhile Debausset followed close be- Haverford; second, Morian, Haverford; third, Gebelein, Johns Hopkins.<br />\nhind as the major point-getter.<br />\nTime—.23.<br />\nThe lone Hopkins performer to win<br />\nMainly<br /><br />\nFRATERNTY SICHEDULE<br /><br />\nThe<br /><br />\nthe<br /><br />\nefforts<br /><br />\nof<br /><br />\nCaptain<br /><br />\na first place was Driscoll, who<br />\nclicked off an excellent two mile<br />\nrace. His time was by far the best<br />\nhe has flashed this season. At the<br />\nfinish he was far ahead of MHorris<br />\nof Haverford who for the early part<br />\nof the race clung tenaciously to Driscoll's heels.<br /><br />\nHigh Jump—Won by Debausset,<br />\nHaverford, second; Poorman, Haverford;<br />\nthird,<br />\nLester,<br />\nHaverford.<br />\nHeight-5 feet 10 inches.<br />\nJavelin—Won by Myer, Haverford;<br />\nsecond, Graziano, Johns Hopkins;<br />\nthird, Holzer, Haverford. Distance157 feet 514 inches.<br /><br />\nIn the sprints, the absence of Baet880-Yard Run—Won by Rodman,<br />\nger was severely felt. The Jay dash Haverford; second, Evans, Haverstar caught cold and was unable to ford; third, Wesson, Haverford.<br />\nmake the trip with the team.<br />\nTime2.7.8.<br />\nThe summary:<br />\nPole Vault—Won by Lester, Haver120-Yard High Hurdles—Won by ford; second, Debausset, Haverford;<br />\nS. Evans; second, Fisher, Haverford; third, Kelley, Haverford. Heightthird, Steiger, Haverford. Time- 11 feet 6 inches.<br />\n16.3.<br />\nDiscus ThrowWon by Holzer, Hav-<br /><br />\n100-Yard Dash—Won by Holzer, erford; second.<br />\nMyer, Haverford;<br />\nHaverford; second, Morlan, Haver- third, Poorman, Haverford.<br />\nDisDrop Decisions To Drexel ford; third, Wingerd, Haverford. tance115 feet.<br />\nAnd Swarthmore Nines; Time-10.2.<br />\nBroad JumpWon by Wingerd, HavOne-Mile Run—Won by W. Evans; erford; second, J. Lewis, Haverford;<br />\n7-3 And 13-4<br />\nsecond, Shihadeh, Haverford; third, third, Graziano, Johns Hopkins. Distance 20 feet 10/<br />\n1<br />\n2 inches.<br />\nIt was a successful week-end for Lurting, Haverford. Time-4.46.8.<br />\nthe Blue Jay batsmen, for their trip<br />\nup in the vicinity of Philadelphia<br /><br />\nManOW<br /><br />\nPRAT STANDINGS<br />\nDIVISION A<br />\nAlpha Epsilon Pi<br />\nAlpha Chi Rho<br />\nBeta Theta Chi<br />\nPi Lambda Phi<br />\nPhi Kappa Psi<br />\nPhi Sigma Delta<br />\nDelta Upsilon<br />\nDelta Phi<br />\nDIVISION B<br />\nSigma Phi Epsilon<br />\nTau Alpha Omega<br />\nPhi Alpha<br />\nPhi Epsilon Pi<br />\nKappa Alpha<br />\nKappa Alpha<br />\nKappa Sigma<br /><br />\nWon Lost<br />\n2<br />\n1<br />\n2<br />\n1<br />\n2 1<br />\n2<br />\n1<br />\n1<br />\n1<br />\n1<br />\n2<br />\n1<br />\n2<br />\n0<br />\n2<br />\nWon Lost<br />\n2 0'<br />\n1<br />\n0<br />\n1<br />\n1<br />\n1<br />\n1<br />\n0<br />\n1<br />\n0<br />\n1<br />\n0<br />\n2<br /><br />\nINTERCLASS SOFTBALL<br />\nTUESDAY LEAGUE<br />\nWon Lost<br />\nSenior Mechanics<br />\n3 0<br />\nTigers<br />\n2<br />\n1<br />\nNight Riders<br />\n1<br />\n2<br />\nTech Hawks<br />\n0 3<br />\nTHURSDAY LEAGUE<br />\nWon Lost<br />\nSee-Ease<br />\n3 0<br />\nJr. Mech-Elecs<br />\n1<br />\n1<br />\nWhirlwinds<br />\n1<br />\n1<br />\nLiterati<br />\n0 3<br />\nFRIDAY LEAGUE<br />\nWon Lost<br />\nN. J. All-Stars<br />\n2<br />\n0<br />\nCement Mixers<br />\n1<br />\n1<br />\nBlue Bears<br />\n1<br />\n1<br />\nNewcomers<br />\n2<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nMOPZ<br />\nIGTOen<br />\nFt<br /><br />\nLeaders Score<br />\nSoftball Wins<br />\nAtHalfwayMark<br />\nAll-Stars, Senior Mechanics<br />\nCardinals,See Ease Lead<br />\nLeague<br />\nAt the half way mark in the inter<br />\nclass softball league the Senior Mech<br />\nanics, Cardiacs, See-Ease, and New<br />\nJersey All-Stars are leading in the<br />\nTuesday, Wednesday, Thursday, and<br />\nFriday leagues, respectively.<br />\nIn games played last week, the<br />\nleader in each division continued un<br />\ndefeated. The N. J. All-Stars downed<br />\nthe Cement Mixers while the See<br />\nEase walloped the Whirlwinds 11-3<br />\nThe Senior Mechanics also copped<br />\ntheir game by a 16-9 decision over<br />\nthe Library team, substituting for<br />\nthe Tech Hawks.<br />\nBlue Bears Win<br />\nUsing two complete teams, the<br />\nBlue Bears, outslugged the Newcom<br />\ners to cop a 20-9 verdict. With<br />\nSchultz and Deck limiting the New<br />\ncorners to four runs in the first three<br />\ninnings, the Bears scored 14 mark<br />\ners. Not satisfied, the Bears added six<br />\nmore tallies in the sixth stanza. One<br />\nrun in the fourth, one in the fifth,<br />\ntwo in the sixth, and one in the sev<br />\nenth increased the Newcomers' total<br />\nto nine.<br />\nThe See-Ease had little trouble in<br />\ntopping the Whirlwinds 11-3 in a<br />\ngame played Thursday. Although the<br />\nlosers held a 2-0 lead at the begin.<br />\nfling of the third inning, the See-Ease<br />\non hits by Spragins, Vanasek, War.<br />\nminski, Hamn and Allen drove in five<br />\nruns to go ahead 5-2. In the fifth<br />\nthe See-Ease added five more tallies<br />\nand then coasted to a easy victory.<br /><br />\nPtairrWAZOW,<br /><br />\nproduced two defeats. They dropped<br />\na 7-3 decision to Drexel College on<br />\nFriday and then fell before the onslaught of the Swarthmore College<br /><br />\nSTRIKE AGAINST<br />\nWAR<br /><br />\nbatsmen to the tune of 13-4.<br />\nThe game with Drexel was a hardfought contest throughout, with victory finally falling to the team committing the least errors.<br />\nTwo-baggers by Marty Harthe and<br />\nMilt Alperstein and a single by Len<br />\nRubinger, ace Hopkins flinger, in the<br />\nsecond inning paved the way for the<br />\nJohns Hopkins three runs.<br />\nOff to a good start behind the<br />\npitching of Dick Dimpfli, the Swarthmore College nine defeated the Blue<br />\nJay baseball team 13 to 4. Dimpfli<br /><br />\nAPRIL 22, 1937<br /><br />\nstruck out nine men and allowed only<br />\none hit in six innings.<br />\nJohnny Carper started<br /><br />\non<br /><br />\nthe<br /><br />\n5<br /><br />\nmound for the Hopkins team, but<br />\ngave way to Len Rubinger in the<br /><br />\n11.00 A. M.<br /><br />\nsixth frame. Iry Millberg hurled the<br /><br />\nThe line-up:<br /><br />\nTotals<br /><br />\nINTERCLASS SCHEDULE<br /><br />\nlast two innings and did nobly in a<br />\nA. game that was already lost.<br />\n1<br />\nA Hopkins rally in the seventh<br />\n0 netted all four runs.<br />\n2<br />\n2<br />\nDREXEL<br />\n1<br />\nAb. R. H. 0. A.<br />\n0 Graf, c<br />\n4 2 2 11 0<br />\n0 Wolf, 2b<br />\n4 0 1 5 1<br />\n2 Rhile, lb<br />\n5 0 0 4 0<br />\n1 Fox, cf<br />\n2 2 1 4 0<br />\n1 Ehm'ng, 3b<br />\n4 1 1 1 1<br />\n0 Lignelli, rf<br />\n3 1 1 1 0<br />\n0 Dilarso, ss<br />\n2 0 O 0 2<br />\n4 0 O 0 0<br />\nRaynes, If<br />\n10 Zimmers, p<br />\n3 1 1 0 0<br /><br />\n31 7 7 27 7<br />\nJOHNS HOPICINS<br />\nAb. R. H. 0. A.<br />\n4 0 0 3 0<br />\nRomanofsky, If<br />\nMilan, 3b<br />\n4 0 1 0 0<br />\nStevens, c<br />\n4 0 0 8 1<br />\nHarthe, ss<br />\n3 1 2 0 I<br />\nClisham, lb<br />\n3 0 0 9 0<br />\nCarper, cf<br />\n0 0 0 1 0<br />\n4 1 1 1 2<br />\nAlp'tein, 2b<br />\n3 1 0 0 0<br />\nBra'haw, rf<br />\nTotals<br />\n4 0 2 2 4<br />\n2 13<br />\n1 Rubinger, p<br />\nSwindell<br />\n..FD<br />\nGisburn 1Smith<br />\n1 0 0 0 0<br />\nGhinger .<br />\nC.P<br />\nRighter<br />\nP<br />\nLove<br />\nHalstead<br />\n34 3 6 24 8<br />\nTotals<br />\nKahl<br />\nMaksik<br />\n1Batted for Brayshaw in ninth.<br />\n0 3 1 0 1 1 0 1 x-7<br />\nDrexel<br />\n0 3 0 0 0 0 0 0 0-3<br />\nJ. Hopkins<br />\nErrors—Wolf, Milan, Hartke, Clisham. Two base hits—Ehmling, AlPlaying their first game of the perstein, Graf. Three base hit—Fox.<br />\nseason, the tennis team dropped a Stolen bases—Graf, Fox, Brayshaw,<br />\nDouble<br />\nSacrifice—Wolf.<br />\nmatch against Duke University. In Hartke.<br />\nthis game played last Friday at Hop- play—Clisham, unassisted. Base on<br />\nkins, the Blue and Black looked good balls—Off Zimmers, 3; Rubinger, 4.<br />\nin defeat. Duke has an exceptional Struck out by Zimmers, 10; Rubingood team this year, and Coach Jean ger 7.<br />\nHit by pitcher—Rubinger<br />\nBalk—RubinHofmeister expects Hopkins to im- (Dilarso, Zimmers).<br />\nprove as the season advances.<br />\nger. Umpire—Voorhees.<br /><br />\n51<br /><br />\nSTEPS OF<br />\nGILMAN HALL<br />\n131<br />\nA1<br /><br />\nTotals<br /><br />\nS.<br />\n1<br />\n1<br />\n1<br />\n5<br />\n1<br />\n1<br />\n1<br />\n2<br /><br />\n[Duke Beats ,111<br /><br />\nA.<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br /><br />\nSponsored By<br />\nPr<br /><br />\nSTUDENT COUNCIL<br /><br />\nPHI ALPHA<br /><br />\nOMICRON DELTA KAPPA<br /><br />\nPHI SIGMA DELTA<br /><br />\nDEBATING COUNCIL<br /><br />\nPHI EPSILON PI<br /><br />\nAMERICAN STUDENT UNION<br /><br />\nYOUNG COMMUNIST LEAGUE<br /><br />\nSTUDENT ACTIVITIES COMM.<br /><br />\nBARNSTORMER CLUB<br /><br />\n1<br /><br />\n1<br /><br />\n1<br /><br />\nTHE NEWS-LETTER<br /><br />\nTHE HULLABALOO<br /><br />\n/4\\<br />\nbiT<br />\ni<br />\nRM O<br />\nr<br />\nj<br />\nlt<br />\ne C<br />\ng2<br />\nbgli<br />\n4<br />\n19 tt.<br /><br />\n•<br /><br />\n•<br />\n•<br />\nbt<br />\n,<br /><br />\n\\ •<br /><br />\n•<br /><br />\nadl• ge402021912M.\"<br />\n• •itic.<br /><br />\nA\\<br /><br />\n•<br />\n•<br />\nAbi•<br /><br />\n•<br /><br />\n./\\<br />\nSettc• •<br /><br />\nHOM.EWOOD, BALTIMORE, APRIL 20, 1937<br /><br />\nFour Hundred Will Dormer Bares All<br />\nLeave Classes For For Homewood's<br />\nThursday's Strike<br />\nBenefit<br />\nThree Members Of Faculty<br />\nSlated To Address<br />\nMeeting<br /><br />\nResidents of the exclusive Homewood district of North Charles Street<br />\nwere startled out of their Bourgeois<br />\napathy early last Friday evening by<br /><br />\nPeace Demonstration To<br />\nHear Five Speakers From<br />\nGilman Porch<br /><br />\nthe sudden appearance of a phantom<br />\napparition which was speedily making its way up the middle of the<br />\nstreet.<br /><br />\nOnlookers<br /><br />\nfelt<br /><br />\nthemselves<br /><br />\nthrown back a thousand years into<br /><br />\n(Continued from Page 1, Col. 6)<br />\nthe days of the ancients as they<br />\nIn its fourth plank, the committee<br />\nwatched the white figure which retendered its endorsement to the pol- sembled a young Greek god. But by<br />\nicy of \"cooperation among the peace- the aid of the headlights that were<br />\nloving forces of the world,\" and de- thrown upon the figure and by quesmanded suspension of economic re- tioning the spectators it was found<br />\nthat the \"apparition\" was merely a<br />\nlations with any nation adjudged the<br />\nHopkins boy \"out on a bet.\" The<br />\naggressor in case of war.<br />\noffer of two dollars had been enough<br />\nThe call closed with an appeal to to entice him to shed his clothes and<br />\nstudents to recognize that the trend take a run a la nude in the Baltiof events in the last decade had re- more night air.<br />\nWhen the phantom reached its<br />\nsulted in a final struggle between<br />\ndestination at the corner of Charles<br />\nTherein,<br />\nFascism and Democracy.<br />\nStreet and University Parkway a<br />\nit was claimed, the issue lay.<br />\nwaiting bathrobe was thrown over<br />\nWhole Committee Approves<br />\nhis shoulders. Then he surrendered<br />\nThe call was signed by all 13 mem- himself to the press. Almost his first<br />\nwords were, \"Where's my money?\"<br />\nbers of the committee. OrganizaAfter his demands were satisfied he<br />\ntions represented are: the Student<br />\ncomplacently started back to the<br />\nCouncil, the Debating Council, the Dorms. Upon further questioning he<br />\nAmerican Student Union, the Student replied that he had a very good time<br />\nActivities Committee, Omicron Delta except that the sound of a police<br />\nKappa, Phi Sigma Delta, Phi Alpha, whistle blown by a practical joker<br />\nPhi Epsilon Pi, the NEWS-LETTER, nearly scared him out of his wits.<br />\nthe Hullabaloo, the Young ComThe feat (bare feet!) had just<br />\nmunist League, the Barnstormer about stopped traffic on Charles<br />\nClub, and the Y. M. C. A.<br />\nStreet, and it had brought almost<br />\nSpeakers from the committee are the entire residency of Alumni Memoalso expected to appear at Goucher rial Hall out to the street and winand Morgan Colleges, where similar dows. Who's the guy that said Hopdemonstrations are planned.<br />\nkins men have no sporting blood!<br /><br />\n:-: LETTERS TO THE EDITOR :-:<br />\nStrike take a positive clear-cut posi(Continued from Page 2, Col. 3)<br />\nas demonstrated in the two-score col- tion with respect to the events in<br />\nleges where such cooperation was Spain.<br />\noffered in 1936.<br />\nFascism today is the main threat<br />\nThe Strike, as a single gesture, to world peace. The ,Spanish People<br />\ndoes not insure permanent peace and are fighting for democracy against<br />\neliminate those motives to conflict. fascism. A defeat for Fascist Italy<br />\nIt is, however, the most potent instru- and Germany is a victory for peace.<br />\nment that students and workers can Victory for Fascism is a defeat for<br />\nemploy to postpone, prevent and in- peace. There can be only one choice.<br />\nfluence a specific war situation. The American support of the Spanish govStrike's immediate end is to curtail ernment is an aid to peace and<br />\nwar preparations, defeat the fascist- democracy.<br />\nminded \"Mobilization Day\" Plans,<br />\ncombat compulsory military training<br />\nThe American Student Union<br />\nand false mentality measures which<br />\nKind Words For Dr. Gutmacher.<br />\nhasten war.<br />\nTo the Editor of the NEWS-LETTER:<br />\nThe Oxford Pledge receives the sup- Dear Sir:<br />\nport of conservatives, liberals, and<br />\nEver since the inception of Dr.<br />\nradicals.<br />\nWhen the conservative Guttmacher's course, my faith has<br />\navows non-support, he does so with been revived in the ability of my inthe conviction that capitalism can tellectual associates hereabouts to<br />\nrid itself of warfare. He expresses constrain their ebullience of charhis confidence in the system under acteristics, perverted, and childish<br />\nwhich he lives, but warns that his humor in the face of the mention of<br />\nconfidence will turn to opposition if sex problems.<br />\nunfulfilled. The radical feeling that<br />\nBy virtue of the admirable teachwar is an essential ingredient of er's psychology that Dr. Guttmacher<br />\ncapitalism, accepts the power of the employed in the delivery of his lecpledge as at least a postponing factor, tures, the subject was discussed in all<br />\nmeanwhile preparing to resist an ac- its detail with absolutely no pretentual outbreak. The two views are en- tive at beating around the bush or<br />\ntirely compatible. Which shall pre- evasion, and purely as an academic<br />\nvail is to be determined by proof of topic, which, in the last analysis, it<br />\npresent experience. Meanwhile, we really is I must admit that when on<br />\nagree on first steps of resistance. first attending lecures I waited with<br />\nWe do not regard it as sanctimonious a sort of horrible anticipation for the<br />\nphrase-mongering, nor do we believe outbreak of the tittering when some<br />\nthat its endorsement alone will stop particularly revealing detail of sex<br />\nwar. It merely says, \"Imperialist activity was under consideration.<br />\nwar is not our war!\"<br />\nHappily, I was spared this, for the<br />\nWith all this if our Strike is to<br />\nhave any appreciable meaning it must<br />\nadopt a realistic attitude toward the<br />\nproblem of war and peace—because<br />\nof the nearness of war at the present.<br />\nAn abstract meaningless approach to<br />\nthe question today is false and suicidal.<br />\nReality demands that the<br /><br />\naudience behaved in a most creditable<br />\nfashion, deserving equally their reputations for being intelligent men and<br />\nwomen, and duly appreciative for the<br />\nefforts being made by the usually<br />\nundervalued A.S.U. in bringing Dr.<br />\nGuttmacher of the Hopkins<br />\nAVT<br /><br />\nFrosh-Sophs Walter Lippmann<br />\nSlated to Attack<br />\nSwing And<br />\nPacking of Court<br />\nBury Axe<br />\nSurrendering their tomahawks in<br />\nfavor of the beat swing of Bubby<br />\nJohnson and his Orchestra, frosh and<br />\nsophs declared a halt to militant<br />\nactivity last Friday at ten, when the<br />\nirresistible urge to trip the light fantastic forced them to succumb. The<br />\noccasion, of course, was the Freshman-Sophomore Class Dance with<br />\nthe scene of the festivities at the<br />\nMaryland Casualty Clubrooms.<br />\nTermed \"one of the smoothest<br />\ndances of the year\" frosh and sophs<br />\nwere equalled in number, if not surpassed, by upperclassmen, all hilariously enjoying themselves. Harry<br />\nM. Hopkins, chairman of the joint<br />\ncommittee, skimmed about with the<br />\nlovely Miss Elizabeth Facer, sponsor<br />\nof the dance, on one arm, while on his<br />\nface was the benignly smug smile<br />\nbrought on by the realization that the<br />\ndance was a social success in every<br />\nway.<br />\nWith couples trickling in and out<br />\nall evening, and just enough stags to<br />\nmake things a bit more interesting,<br />\nthe affair really went off with a finesse<br />\nthat was amazing to all. Brightly colored frocks, combining with the informal, and in some cases, sports, outfits of the men blended to give a<br />\nmerry<br />\nkaleidoscopic effect. And<br />\nthrough it all—the inevitable Bubby's<br />\nrhythm.<br />\nSo delightfully had the time passed<br />\nthat moans escaped the dancers' lips<br />\nwhen the band showed signs of packing up. So old feuds were forgotten,<br />\nand Hell Week passed into limbo. And<br />\nthe Freshman - Sophomore Dance<br />\nwhere truly \"a good time was had<br />\nby all\" moved into the category of<br />\n\"institution\" at the Hopkins.<br /><br />\nJournalist To Discuss Rise<br />\nOf Personal Government<br />\nIn America<br />\nPeabody To Be Scene Of<br />\nLecture; Speaker Is<br />\nLiberal<br />\n(Continued from Page 1, Col. 1)<br />\nof liberal philosophy that placed too<br />\nmuch emphasis on collective action.<br />\nSince he has sought to find a middle<br />\nground between Laissez-faire and a<br />\nplanned economy. Therefore present-day \"pinkish liberals\" and others<br />\nfurther to the left regard him as a<br />\ntraitor to the cause.<br />\nIn 1921 he became an editor of the<br />\nNew York World and served it till<br />\nits death in 1931. He has continued<br />\nhis journalistic career as a feature<br />\nwriter for the New York HeraldTribune, but has not purely endorsed<br />\nits editorial<br />\npolicies.<br />\nAlthough<br />\nagainst Roosevelt, he could not stomach Landon last autumn.<br />\nCalled \"a man with a flashlight<br />\nmind\" by Beverly Smith and generally<br />\nregarded as a pundit and critical authority on governmental policy, Mr.<br />\nLippmann has written many books.<br />\ndealing with political theory, such as<br />\nPublic Opinion, and The Phantom<br />\nPublic. He contributes to the Atlantic, Harper's, and other periodicals.<br />\nMany suspect Mr. Lippmann was<br />\ninvited here to balance the argument<br />\non the Supreme Court proposal. Professor Edward S. Corwin, of Princeton, when here several weeks ago,<br />\ndevoted his entire address to defending the court plan. He also spoke<br />\nunder the Schouler lectureships.<br /><br />\n•<br /><br />\n•<br /><br />\nOw!<br />\n.•.says Al Schacht<br />\n... the Clown Prince of<br />\nBaseball whoops it up for<br />\nthe grand opening of the<br />\n1937 baseball season.<br /><br />\n'tome on\" the<br />\nbleachers roar..:'Swat em out!\"<br />\nAs the big leaguers swing into action<br />\nwatch those Chesterfield packages pop<br />\nout of the pockets.<br /><br />\nleague<br />\nfor big<br />\n6<br />\npleasure...<br /><br />\nThere's big league pleasurefor you...<br />\neverything you want in a cigarette.<br />\nA homer if there ever was one... all<br />\nthe way'round the circuit for mildness<br />\nand better taste ... with an aroma and<br />\nflavor that connects every time.<br /><br />\n.opyright 1937, LIGGin &amp; MYERS TOBACi.o CO.<br /><br />"}], "field_media_file": [{"target_id": 39104, "display": null, "description": null, "target_type": "file", "target_uuid": "168fcf83-4807-48fb-9fde-8c8fa7bd8c24", "url": "http://digital.library.jhu.edu/system/files/2022-03/12780-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12780, "target_type": "node", "target_uuid": "a9cf15c4-0cd7-4d1e-baa6-299d41cf8c3e", "url": "/node/12780"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2ff77a3c-00ba-4d91-acdf-76f017d661a8"}]}