{"mid": [{"value": 35783}], "uuid": [{"value": "c893dea0-59ba-4bd6-b2fc-c6d9c2fb902e"}], "vid": [{"value": 35783}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:13:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12310-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:13:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:13:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "auguream.<br />\nTHE•JOHRS•HOFKINSIMVERSITY<br />\nBALTIMORE<br />\n<br />\n\f\f\fTHE NEWS=LETTER<br />\nVOL. XI.<br />\n<br />\nNOVEMBER 23, 1906.<br />\n<br />\nSubscriptions, $1.50 per year.<br />\n<br />\nPublished Fortnightly.<br />\n<br />\nNo. 3<br />\nio Cents per copy<br />\n<br />\nBOARD OF EDITORS.<br />\n<br />\nStanley Meade Reynolds, 1907, Editor-in-Chief.<br />\nArthur Leonard Bloomfield, igo7, Ass't Editor-in-Chief.<br />\nCarl Lewis Bernhardt, 19o8, News Editor.<br />\nLawrence Melville Riddle, 1908,<br />\nHarry K. Hardcastle, 1908,<br />\nF. B. Pedrick, 1909,<br />\n<br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, 1908, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nAss't News Editors.<br />\n<br />\nAddress all articles, communications, etc., to Stanley M. Reynolds, Box 517 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Hermann J. Hughes, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br />\n<br />\nEDITORIAL.<br />\nHE reception which the Student Contribution Fund has met with among the<br />\nundergraduate body encourages us to believe that before the year is over,<br />\n*c** A**<br />\na promising nucleus will have been established about which an everincreasing Fund will grow. Although the column has been open in but<br />\n,<br />\n11<br />\none issue of the paper, the sum of $15 has already been realized, and,<br />\nwhile the contributions have not yet become general in character, it is<br />\n* 4expected<br />\nthat before the next issue of the NEWS-LETTE,R the amount<br />\n*<br />\n********* •<br />\nwill have at least doubled the present sum on hand. We do not wish it<br />\nto be supposed, that, because the three contributions thus far made<br />\namount to $5 each, we would not gladly and thankfully accept much<br />\nsmaller amounts, for, indeed, the original purpose of the idea was for the Fund to draw on<br />\nthe loose change, which the students might have from time to time in their pockets, and which<br />\ncould not be otherwise put to any economic use. It may be interesting to mention here that<br />\nthe New York Evening Post printed Saturday, November 10, a detailed outline of the purpose<br />\nof the Student Contribution Fund, calling attention to the fact that we hope, by means of the<br />\nFund, to erect or purchase some suitable memorial for one of the new buildings at Homewood,<br />\nwhich memorial will probably be a corner-stone for one of the buildings. To raise the required<br />\namount of money, it will doubtless be necessary to carry on the Fund for several years, or<br />\nuntil the present Freshman Class will have attained graduating honors.<br />\n<br />\nUROPE had her Martin Luther; America has had her Carrie Nation; and<br />\nnow from out the low-roofed recesses of the gymnasium locker room<br />\nconies an ever-swelling cry for a leader to head in a reform against certain<br />\nabuses there existing. Moved by the justice of the cry, the NEWS-LETTER,<br />\ngirding its loins with the apron of determination, and bearing aloft the<br />\nstaff of righteousness, has responded to the call, and taken up the cause<br />\nof the lovers of sanitation. Our slogan is \"Excelsior,\" and our motto<br />\n,41[441<br />\nis<br />\n\"New brushes and combs for the locker room.\" There's not to<br />\nE3<br />\nE3<br />\nreason<br />\nwhy, but someone has blundered. Can the responsible \"o<br />\n. ne give<br />\nst<br />\nsufficient cause and reason for the fact that one of the hair brushes is<br />\nwithout a handle? If so, let him show reason why the devasting germs of baldness have been<br />\nallowed to pluck all but a few of the bristles from the other brush, until, alas! it is late, too<br />\nlate, for even Hermicide. Let him justify the fact that for some time our sturdy athletes<br />\nhave been obliged to affect their coiffures by means of combs (?), whose toothless gums give<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\na mocking lie to usefulness. BUT THAT IS NOT ALL! If, indeed, we must use bristleless brushes and toothless gum, why can't they be kept at least clean, and not in the repulsive<br />\ncondition now characteristic of them? We do not know who is the one responsible for the<br />\ntonsorial equipment of the locker room, but whoever he is, let him hear otxr appeal. And,<br />\nfurther, let him have a few inches of the dust, now stratified on the benches in the gallery of<br />\nthe cage, removed to the geological laboratory in order that seating space might be given those<br />\nstudents who would like to watch the team practices from the gallery.<br />\n<br />\nOW that the year is well started, it is possible to• see some of the results<br />\nof the four years' course—at least as far as it affects the number of men<br />\nin the University. We are somewhat sorry to note that, despite the fact<br />\nthat two classes were supposed to enter this fall, there are only about<br />\n60 new men, and of the strictly four-year men, only about 30.<br />\nProbably if the men entering in the future will be limited strictly to the<br />\nfour-years' course, the size of the undergraduate body may eventually<br />\nincrease to about 200 from the present 160. But, if, as may be seen<br />\nfrom the catalogue, various loopholes are to be left open by which all those,<br />\nwho are more disposed to study than anything else, may squeeze themselves through in three years, the number of undergraduates will probably not increase. The<br />\nsmall size of the Undergraduate Department has always, we believe, been disadvantageous to<br />\nthe University. A strong mind dwells only in a healthy body; our Post-graduate Department<br />\nneeds a large body of collegiates to support it and furnish it material.<br />\nVERY day draws nearer to the time when the classes will have their banquets. The Freshman Banquet is looked forward to by all, both concerned and otherwise. Every year the Freshman Banquet stirs tip the<br />\nFreshmen into nervous excitement for at least two weeks ahead of the<br />\ndate, and the Juniors spend much of their not very valuable time in<br />\nspying and scouting. This was the case last year. The theory is of<br />\ncourse that the Freshmen have no right to a banquet, any more than a<br />\nfive-year old has to high-balls and cigarettes. We do not care to bring<br />\nup this weighty question; but the point is that the Freshman Banquet,<br />\nas now held, seriously interrupts the work of the University. Of<br />\ncourse, it is easy enough to suggest that either the Freshmen shall not give their banquet until<br />\narriving at the age of discretion or else the Juniors shall not interfere. It requires no experiment to see that neither of these expedients would work successfully.<br />\nPerhaps a compromise can be effected. Let the two classes come to terms, the Juniors<br />\non their part promising not to interfere with the Freshmen within four blocks of the University;<br />\nthe Freshmen on their part promising not to cut their classes, and also to publish the true date<br />\nof the banquet. Each sides concedes a vital advantage to the other side, which would tend to<br />\nsimplify matters and help the work of the University.<br />\nTO?<br />\nNot as summer seas are her eyes of blue,<br />\nNor her cheeks as the blush of the morn,<br />\nHer lips are not kissed with morning dew,<br />\nLow lieing on lowland and lawn;<br />\nNot as Araby wind is her fragrant breath,<br />\nNor strands of gold is her hair—<br />\nAnd yet my lady, my fond heart saith,<br />\nIs, of women, passing fair.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nA FEW SPELLING-REFORM FALLACIES.<br />\nThe spelling reform advocated by the Simplified Spelling Board has evoked, instead of<br />\nthe chilling indifference which such efforts so<br />\noften meet, an encouraging amount of opposition. The real ground of most opposition to<br />\nthe simpler forms is merely that they are<br />\nunfamiliar; yet few are thoughtful enough to<br />\nrecognize this or frank enough to admit it.<br />\nSome of the popular objections to them are<br />\nbased upon curiously false notions.<br />\nWhat may be called the Roosevelt fallacy is<br />\none of the most interesting of these notions.<br />\nIn the late midsummer, when journalists<br />\nlanguisht for something to make a sensation<br />\nout of, President Roosevelt directed the Public<br />\nPrinter to adopt the three hundred simpler<br />\nforms selected by the Board. The effect of<br />\nthis order was magical. Correspondents made<br />\ncopy of it by the yard; patriots who do not<br />\nread a government report once in ten years<br />\nprotested bitterly at the desecration of those<br />\ndocuments by revolutionary English; and an<br />\nEnglish journal remarked contemptuously that<br />\nthe reformed spelling might be good enough<br />\nfor a nation of yesterday, but would never do<br />\nfor a people blest with a tradition of a thousand years. The result was that, in the minds<br />\nof many persons, the responsibility of the<br />\nwhole reform was laid on the broad shoulders<br />\nof the President, and the Simplified Spelling<br />\nbecame the \"Roosevelt Spelling.\" Consegently there are those who do not like the<br />\nsimpler forms because they do not approve of<br />\nMr. Roosevelt, and are hardly to be persuaded<br />\nthat he is not at the bottom of the whole thing.<br />\nYet it is hard to see, apart from political<br />\nprejudice, why the government printing house<br />\nshould necessarily be the least up-to-date.<br />\nIndeed, since the official reports are all practical in purpose and quite out of the realm of<br />\npure literature, they are especially fitted for<br />\ntempting usage with desirable simplifications.<br />\nCertainly, nobody's esthetic sense can be<br />\nseriously offended by Mru in an agricultural<br />\nreport.<br />\nThe authorityfallacy is almost the converse<br />\nof the Roosevelt fallacy. \"What right has a<br />\nself-constituted board to dictate how I shall<br />\nspell?\" says an objector. \"We should have<br />\na cabinet officer to supervise language,\"<br />\n<br />\nurges another, \"or a representative convention called by the government to propose<br />\nreforms.\" Now, of course, the Simplified<br />\nSpelling Board makes no assumption of authority, tho the changes which it proposes are<br />\nbased upon the soundest scholarship. In the<br />\nrepublic of intellect there are no dictators;<br />\nanybody has a right to make a motion and to<br />\nget it carried if he can.<br />\nThe etymologicalfallacy is a great favorite<br />\nwith everybody except the etymologist. It is<br />\ndoubly fallacious, because the simplified<br />\nspellings do not, as a rule, obscure the history<br />\nof the words, and if they did, no great harm<br />\nwould result. Popular off-hand etymologizing<br />\nis less reliable than popular diagnosis of diseases. The untrained reader who wants to<br />\nknow the history of a word should consult all<br />\nthe good dictionaries within reach, and should<br />\nremember that even they are not infallible.<br />\nHe will know what a debt is long before he<br />\nlearns that the word is related to the Latin<br />\ndebitum. When he knows that, it will be a<br />\nshort step to the knowledge that the useless<br />\n\"b\" was rudely forced into the word as a<br />\nsign of its origin, a sign wholly false to its<br />\nhistory. The fact that doul, delite, sovran,<br />\nrime, agast and iland are etymological, and<br />\nthat the current spellings are the results of deliberate interference with their development,<br />\nmay serve as a starting point for wholesome<br />\ndistrust of the historical value of our present<br />\nspelling. If we spelled alms so as to show its<br />\norigin, the form should be eleemosyne. Some<br />\nday we shall muster up enough courage to<br />\nspell it ams.<br />\nThe language-of-Shakespearefallacy, tho one<br />\nof the lest reasonable, is perhappes the moast<br />\nseductive; for it gives toe the dres in whiche<br />\nthe gret monuments of Englishe lytterature<br />\nappere to-daie the reverense dewe to those<br />\nmonumentes themselves. The spelling of todaye, however, ys not the spellynge of Shakespear. Shaxpere's spelling,iffe moare lawlesse,<br />\nwas often simpler and more usefull than ours,<br />\nfor the pedants hadde not yet got holde of yt.<br />\nIff the grete poete coud have compar'd the<br />\nmoderne.version of his works with a version<br />\nsimplifide acording too the suggestions of the<br />\nBoard, hee would probably finde more familyar<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nformes in the lattyr. Shaxsper spelt as he<br />\nplesed,—al the spellings in this paragraff ar<br />\nShaksperean—and sertenly hee would bee the<br />\nlaste to denie too us som fredom from fetters<br />\nthat he would have spurned.<br />\nThe written language belongs peculiarly to<br />\neducated men. To free it from historic<br />\nblunders and save it, so far as may be, from<br />\n<br />\n5<br />\n<br />\nthe mishaps of chance should be a welcome<br />\ntask. Deliverance from superstitious awe of<br />\nthe dictionary and from blind worship of the<br />\nspelling book must come, if at all, from the<br />\ncollege-bred man. The Hopkins student who<br />\nis indifferent to the reform, or thoughtlessly<br />\nhostile, is in a false position.<br />\nS. J.<br />\n<br />\nRONDEAU A LA DOBSON.<br />\n<br />\nWhen roses bloom, and<br />\nviolets blue<br />\nLift up their loveliness to<br />\nyou,<br />\nA n d wondering, s e e in<br />\n'bashed surprise<br />\nThe myriad violets of thine<br />\neyes;<br />\nWhen of the butter-cups,<br />\nbut two<br />\n(Both moistened still with<br />\nmorning dew)<br />\nHave budded—think how<br />\nsummer flies,<br />\nWhen roses bloom.<br />\n<br />\nWhen twilight falls, and stars are new,<br />\nAh think ! how bitterly we'll rue<br />\nThese days of youth. E'er summer dies,<br />\nWaste not the time with useless sighs;<br />\nSuch happy moments come to few,<br />\nWhen roses bloom!<br />\n—S. C. C.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nPLEA FOR UNDERGRADUATE FOOTBALL.<br />\n\"'The time has come,' the walrus said,<br />\n'To talk of many thing,<br />\nOf shoes, and ships, and sealing-wax,<br />\nOf cabbages and king.'\"<br />\nThe time has indeed come, to have an undergraduate football team at John Hopkins.<br />\nThe team, this year, has not been very successful, owing to several causes. In the first<br />\nplace, the game, as changed by the new rules,<br />\nmakes it imperative that a team have out-door<br />\npractice. The new trick plays absolutely<br />\nneed out-door practice to insure their success,<br />\nand out-door practice is an impossibility under<br />\nthe present system. If we had an undergraduate team, we could get out-door practice<br />\non Wednesday afternoons, at least, and even<br />\none afternoon would work wonderful results<br />\nin a team. As we rely upon the men from<br />\nthe Medical School to form the backbone of<br />\nthe team, we can not get any out-door practice<br />\nat all. Instead, we have to be content with<br />\npractices in the cage from 6 p. in. to 7 p. m.<br />\nThat means that the team must have supper<br />\nevery Monday, Wednesday and Friday night,<br />\nand this supper item is one of the largest<br />\nexpenses that the management has to put up<br />\nwith. With an undergraduate team, practices<br />\nwould start promptly at 5, and would stop at<br />\n6. The men would have ample time to get<br />\nhome for supper, and thus relieve the management of a heavy load.<br />\nAgain, an undergraduate team could be<br />\ngotten which would train hard. That was<br />\none of the faults of this year's team, for there<br />\nwas little or no training done. The men from<br />\nthe Medical School can not be blamed, for not<br />\ntraining; it is too much for us to expect it of<br />\nthem, but an undergraduate team could be<br />\nmade to train and to train hard. We get out<br />\nlacrosse and track teams that are willing to<br />\n<br />\nTHAT FATAL SMILE.<br />\nThere once lived a fellow named Dewey,<br />\nWho lived in the City St. Lewey,<br />\nWhen asked why he fed<br />\nOn oatmeal, he said:<br />\n\"Because I like things that are gewey.\"<br />\n<br />\ntrain, and there is no reason at all why we<br />\nshould not get out a football team which<br />\nwould be willing to train.<br />\nDissenters will say that the advantages<br />\nderived from out-door practice and training<br />\nwill not, by any means, measure up to the<br />\nadvantages of having men from the Medical<br />\nSchool who have played before and who know<br />\nthe game. As a matter of fact, owing to the<br />\nchanged style of play of football, the experienced men are not much better off than the<br />\nnew men, for they are compelled to unlearn<br />\nmany things before they can adapt themselves<br />\nto the new conditions.<br />\nThere is plenty of good football material<br />\namong the classes, which needs just a little<br />\ncoaching to turn into 'Varsity material.<br />\nDoubtless, the team would not be a worldbeater the first year or so, but as soon as an<br />\nefficient scrub is developed, we might look for<br />\nwinning teams. Under the present system<br />\nthere is practically no scrub at all, because<br />\nthe undergraduates will not come out at 6.30<br />\nand be kept out until 7.30, getting cold<br />\nsuppers at home. It stands to reason that<br />\nthe undergraduates will not come out and<br />\nscrub against a team in which they are not<br />\ninterested. But with an undergraduate team,<br />\nit is safe to predict that every practice will<br />\nsee a scrub team out, just as there is always a<br />\nscrub team for lacrosse and plenty of \"alsorans\" for track.<br />\nThere are, of course, reasons why we should<br />\nnot attempt a team next year based upon the<br />\nundergraduate students, but to the writer it<br />\nseems that the reasons in favor of a collegiate<br />\nteam outweigh the others. So let us see<br />\neveryone turn out to make a good representative team next year.<br />\n<br />\nALAN M. CHESNEY.<br />\nHORRYBILE H<br />\nA fellow, who lived in Mobile,<br />\nContinued to ride an old wile,<br />\nTill it broke with a crash,<br />\nWhen he muttered \"Blank, dash!<br />\nThat really did hurt a good dile.\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nTHE GRAY-HAIRED SERENADE.<br />\n<br />\nSTUDENT CONTRIBUTION FUND.<br />\n<br />\nE'er Adam ate the apple, and so, by sinning<br />\nfell—<br />\nHe told a tale in Eden, which I'll proceed to<br />\ntell:<br />\nHe sat alone and sang alone, and of his Eve<br />\nsang he;<br />\nThe words—tho' in translation—are often sung<br />\nby me.<br />\n<br />\n(Contributions should be sent to Mr. Hermann J. Hughes, Business Manager, Johns<br />\nHopkins NEWS-LETTER, Box 224, John Hopkins University.)<br />\n<br />\nMark Antony loved Cleo—and sitting by the<br />\nNile,<br />\nRepeated pretty little things, which won for<br />\nhim a smile.<br />\nThen sat alone and sang alone—of Cleopat—<br />\nsang he;<br />\nThe words—of course, they're `Englished\"—<br />\n<br />\nare often sung by me.<br />\nThe years rolled by and Rosamund was<br />\nHenry II.'s love,<br />\nWho called her many silly things—for instance, \"pretty dove.\"<br />\nThen, sitting down, he sang alone—of Rosamund sang he;<br />\nThe words—\"done into modern prose\"—are<br />\noften sung by me.<br />\nAnd finally, young Romeo Miss Capulet did<br />\nwoo,<br />\nAnd sang such songs to her, as I have mentioned here to you.<br />\nHe went 'way back, and sitting down, of<br />\nJuliet sang he;<br />\nThe words—\"accurately rendered from the<br />\noriginal Italian, with introduction, notes<br />\nand appendix\"—<br />\nare<br />\noften<br />\nsung<br />\nby<br />\nme !<br />\n<br />\n-S. C. CHEW, jR.<br />\n<br />\nNEWS-LETTER<br />\nArthur R. Padgett, '07<br />\nS. M. R., '07<br />\n<br />\n$5.00<br />\n5.00<br />\n5.00<br />\n<br />\n$15.00<br />\nBALLADE OF LOST SOULS.<br />\nThey shiver and shake in chattering cold<br />\nOf the grewsome Valley of Death,<br />\nThe charnel dew drops thick, but slow,<br />\nAnd they moan and groan as they draw their<br />\nbreath.<br />\nOne said: \"I kissed her a nine month back,<br />\nAnd she kissed me, too, full well.<br />\nBut that kiss is branded deep in my brow,<br />\n0 would that I were in hell!\"<br />\n\"And now she visits me by night—<br />\nHer face is pale and thin,<br />\nBehind her leer the Furies Three—<br />\nHow monstrous is their grin!\"<br />\n\"I would to God my memory<br />\nCould die as did my clay,<br />\nBut I think, I think, I think of the past.<br />\nFrom now till Judgment day.\"<br />\nA cold grey moon dropped down behind<br />\nThe tombs of those poor lost souls,<br />\nAnd the dead men turned among<br />\nThe worms and rats and moles.<br />\n<br />\nTHE RHYMSTER'S COMPLAINT.<br />\nI've rhymed in reason—and out,<br />\nI've written in season—and out,<br />\nI've written to boys, I've written to girls,<br />\nI've sung of \"brown eyes,\" and \"curliest<br />\n<br />\ncurls,\"<br />\nI've called her \"a jewel,\" apearl among<br />\npearls,\"—<br />\nIs there nothing to warble about?<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nCLASS FOOTBALL.<br />\nBoth class teams have started work in earnest, and either the Junior or Freshman<br />\neleven may be seen almost any day in the<br />\ncage, going through signal practice. So far,<br />\nthe Freshmen seem to have had the larger<br />\nsquad out, but the Juniors have not been<br />\nexactly napping. In fact, Captain Abel, of<br />\nthe Junior team is wearing a worried look<br />\nnow all the time, and is earnestly requesting<br />\nhis men to come out. He has been taking<br />\na hand at quarter, and will probably play<br />\nthere. This will necessitate some changes in<br />\n1908's back-field. Just who will play in the<br />\nback-field, is, of course, very uncertain, and<br />\nwill not be definitely decided until the day of<br />\nthe class game. The Junior class is rather<br />\nhandicapped for lack of good line material,<br />\nsince there are few men in that class who<br />\nhave played on the line before.<br />\nSo far 1908 has played one game—that<br />\nagainst City College, which was lost by the<br />\nscore of 17-0. In this game the Junior backs<br />\ncarried the ball fairly well, but the whole<br />\nwas wofully lacking when it came to defensive<br />\nwork. Several interesting arguments occurred<br />\nin the game, which resulted in Silkman of<br />\nB. C. C., and Breyer and Wegefarth of the<br />\nJuniors being sent to the side-lines. Abel<br />\nmade a very brilliant run of fifty yards, almost<br />\nmaking a touch-down.<br />\nThe Freshmen have certainly not been<br />\nhandicapped for lack of men, for they seem<br />\nto have had a large squad out. They have<br />\nplayed two games, the first one with Marston's, and the second with Dunham's. The<br />\nfirst game only lasted one half and was played<br />\non a field covered with mud. The Freshmen<br />\nwon by a score of 11-5. The game with Dunham's resulted in a defeat for 1909 by the<br />\nscore of 5-0. In this game the Freshmen did<br />\nmuch better than in the previous one, and<br />\ncame very near winning. Taking it all in all,<br />\nthe class game this year should be very close<br />\nand very interesting and the result is likely to<br />\nbe in doubt until the referee's whistle blows<br />\nfor the last time.<br />\n<br />\nHOPKINS, 10-B. M. C., 0.<br />\nThe team has won at last, and the victory<br />\nwas well earned. Some around the University<br />\nwere very doubtful about the outcome of the<br />\n<br />\ngame, and, as a result, a number of them<br />\nstayed away, saying that they did not care to<br />\ngo out and see the team lose. As a matter of<br />\nfact, their predictions fell flat, for the team<br />\nwon in a hard-played game by the score of 10<br />\nto 0. And Baltimore Medical College was by<br />\nno means an easy team. They outweighed our<br />\nfellows to some extent, and they had several<br />\ngood individual players, notably Wiggin, who<br />\nplayed right-half.<br />\nThe field was a little slippery, so that some<br />\nof the plays were not run off as fast as they<br />\nmight have been, but on the whole, the play<br />\nwas good. The first half was anybody's game,<br />\nwith the ball in Hopkins' territory. Here it<br />\nwas that B. M. C. played best, making several<br />\ngood end runs, and once or twice threatened<br />\nto kick a goal from field, but were blocked by<br />\nthe Hopkins' linemen breaking through. Unfortunately for B. M. C., their kicking staff<br />\nwas poor—for the punts were bad and the<br />\nattempted drop-kicks failed.<br />\nAs usual, J. H. U. played better ball in the<br />\nsecond half, and by straight line bucking<br />\nfinally pushed Webb over for the first touchdown. The ground was gained principally by<br />\noff-tackle plays, varied occasionally by short<br />\nend runs. The second touchdown came near<br />\nthe close of the game, and was the result of a<br />\npretty run by Stewart. The play was right<br />\noff tackle, but Stewart managed to get clear,<br />\nand, dodging the quarter-back, planted the<br />\nball between the posts.<br />\nThe defensive work of the team was much<br />\nbetter, on the whole, than that displayed in<br />\nthe Haverford game, but the team must not<br />\nget swelled heads, or become over confident<br />\nabout the St. John's game. St. John's will<br />\nput up their strongest game against Hopkins,<br />\nand they may be depended upon to play for<br />\nblood. They will give all they have, and J.<br />\nH. U. must be prepared to do the same.<br />\nAll three backs carried the ball well on Saturday, and could be depended upon to gain.<br />\nHart was so unfortunate as to sustain a bad<br />\ncut over his eye, but we hope that this will not<br />\ninterfere with his playing next Saturday.<br />\nRidgely got in some very effective tackling at<br />\nright end, as did Michael at left tackle. Captain Preble got in the game in the second half,<br />\nand inspired confidence by his presence.<br />\nOnly two more games remain to be played—<br />\nSt. John's at Annapolis, and University of<br />\nMaryland at Oriole Park on Thanksgiving<br />\nafternoon. Rooters! Brace up! Why shouldn't<br />\nevery rooter supply himself with a small megaphone such as the Navy uses? Then we<br />\nwould have some rooting worth while.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nHAVERFORD, 23-HOPKINS, 0.<br />\nThere is little to say about the game between Haverford and our fellows, and what<br />\nthere is to say, has little pleasure for all Hopkins men. The team went up to Haverford<br />\nwith high hopes of winning, after the way<br />\nthey played against Swarthmore, but the way<br />\nHaverford played was a revelation, and the<br />\noutcome of the game was a bitter disappointment to rooters and players alike.<br />\nThe loss of the game can be attributed to<br />\nlack of training more than anything else.<br />\nHaverford started off with a rush, making<br />\nseveral long end runs at the start, and completely winded the Hopkins team right away.<br />\nIt was the old story of a fast, well-trained<br />\neleven against a heavy, but very poorly-trained<br />\nteam, and, as a result, there could be but one<br />\nending.<br />\nThe conditions were ideal for football—a<br />\nleaden sky, cold air, and a hard field, just<br />\nwhat was needed to put snap and vim into a<br />\nteam, but Haverford seemed to get all the<br />\nsnap and vim. In a very short time after the<br />\nkick-off, they had scored their first touchdown, mainly by end runs. Shortly after they<br />\nscored their second touchdown. Here it was<br />\nthat Hopkins seemed to take a brace, for<br />\nHaverford was held on our twenty-yard line<br />\nand was forced to try for a goal from placement, which barely crossed the bar. This<br />\nmade the score 15-0, after which the first half<br />\nwas ended.<br />\nIn the second half, Hopkins took a slight<br />\nbrace, but by that time, it was too late, for<br />\nher men were completely fagged out, and<br />\nwere unable to advance the ball. Only long<br />\npunts by Michael kept the warriors in red and<br />\nblack from getting closer to the Baltimore<br />\nboys' goal. As it was, Haverford made a<br />\nthird touchdown, and also a safety, running<br />\nthe score up to 23-0.<br />\nThe whole team was far below its standard,<br />\nand played worse than in any game so far this<br />\nseason, Not only were the men out of condition, but they seemed to lack spirit. A<br />\ndecided brace must be taken, if St. John's<br />\nis to be beaten. The Hopkins team does not,<br />\nas yet, know what it is to cross the goal line<br />\nof her opponents, and must play a much<br />\nbetter game if they want to win from the<br />\nAnnapolis team.<br />\n<br />\n9<br />\n<br />\nHOMEWOOD HO!<br />\nHomewood is a word that is now on every<br />\none's tongue. There are some few who take<br />\nit seriously, but the majority of the students<br />\nand even of the faculty take it as a huge joke.<br />\nNow here is just where the trouble lies. If<br />\neveryone, both professors and students, would<br />\nbe anxious and would strive earnestly to get<br />\nto Homewood, it could be done very quickly.<br />\nWhen you ask anyone if he is anxious to get<br />\nto Homewood he says yes immediately; but<br />\nwhen you ask him to contribute even a little,<br />\nhe laughs at you, and says that it is impossible to raise enough money for the University<br />\nto move. Nothing is impossible. Where<br />\nthere is a will, there is a way. A million<br />\ndollar endowment fund was raised; why can<br />\nnot another million dollars be raised for the<br />\npurpose of moving to Homewood? If every<br />\nstudent would contribute to the Student Fund<br />\nas much as each one could afford, we should<br />\nhave a fair start; and a thing once begun is<br />\nhalf done. The president should appeal to<br />\nthe alumni of this city, and I am sure he<br />\nwould receive liberal contributions. Then<br />\nthere are the Johns Hopkins Alumni Associations of other cities, which could easily raise<br />\nseveral thousand dollars. The trouble is that<br />\nthe University is asleep and expects to wake<br />\nup some day to find that all the buildings<br />\nhave been erected at Homewood. The days<br />\nof fairy stories are over; and if you want anything now-a-days, it is necessary to work<br />\nhard for it. Why do not the wives of the professors take enough interest in the University<br />\nto get up some entertainments or fairs for the<br />\nbuilding fund? Churches make thousands of<br />\ndollars in this way, and so could the University. Again these ideas are hooted at; but<br />\nthey would do good, for when people see that<br />\nthe University is helping itself, they would<br />\ngladly give assistance. We can not expect<br />\nto get enongh money immediately or even in<br />\none year, but it would not take more than two<br />\nyears. If such action had been taken when<br />\nwe first received the property, we should now<br />\nbe near to occupying that most beautiful tract.<br />\nVery few people realize what a grand site<br />\nHomewood is. We may venture to say that<br />\nwhen the Universty becomes settled at Homewood—and we trust that it shall be within a<br />\nfew years—it will be one of the most beautitiful colleges in the country. The place is<br />\nideal for a university.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nSTUDENT PUBLICATIONS.<br />\n<br />\nALUMNI NOTES.<br />\n<br />\nIf we look over the college papers of our<br />\n'06. Ormond Willson Hammond, Editorcountry and of England and Canada, we in-Chief of the NEWS-LETTER a portion of<br />\nnotice that they fall into two classes—those last year, is studying law at the University of<br />\nwhich aim at entertaining and those which aim Maryland, and is also in the office of the<br />\nto set before the student models of prose and American Bonding Company.<br />\nverse, and now and then a good moral talk.<br />\n'06 (Ph.D.). William L. Kennon is assoThe former are apt to contain almost anyprofessor of chemistry at Williams Colciate<br />\nthing, the latter, articles based, or supposed<br />\nMass.<br />\nlege,<br />\nto be based, on classical models. In America<br />\nthe journals fall under both heads, while in<br />\n'06 (Med.). Edwin H. Schorer is at the<br />\nEngland and Canada they belong, so far as Rockefeller Institute, New York City.<br />\nwe can judge from our exchanges, to the<br />\n'06. Carlyle Barton is studying law at the<br />\nlatter class. Now which of these two methods<br />\nof Maryland, and also teaching at<br />\nUniversity<br />\nsucceeds in producing a creditable and interSchool.<br />\nPaul's<br />\nSt.<br />\nesting paper? This depends as much upon<br />\nthe reader as upon the writer. The paper<br />\n'05 (Med.). F. Peyton Rouse is in the<br />\nwill be creditable if the end is attained and faculty of medicine at the University of Michinteresting; if it is what the reader wants.<br />\nigan.<br />\nTo consider the English journals first, we<br />\n'04. George Foster is studying law at the<br />\nfind that, because of the spirit of conservatism<br />\nof Pennsylvania.<br />\nUniversity<br />\nrunning through the universities and the<br />\ntendency to stick to the beaten track of the<br />\n'03 (Ph.D.). John Hildt is in the faculty<br />\nstudy of the classics, the student body is better of Smith College, Mass.<br />\nable to produce articles of a sober and logical<br />\n'02. Ogle Marbury is practicing law in this<br />\nnature, and better prepared to enjoy such<br />\nin the firm of Dallam & Marbury.<br />\ncity<br />\nefforts on the part of its fellows. Hence<br />\nEnglish and Canadian journals are generally<br />\ncreditable and often interesting.<br />\nIn America, however, the youth is full of<br />\nUNIVERSITY NOTES.<br />\nthe modern spirit, and, at least in the underthe<br />\nreached<br />\nyet<br />\nnot<br />\nhas<br />\ngraduate department,<br />\n\"Walter\" states with emphasis born of conperiod where he has acquired a profound<br />\nviction, that 'times is gettin' like ole times,<br />\nreverence for everything that savours of dusty<br />\nsir, because, sir, the young gentlemen, sir,<br />\nbooks or worn-out proverbs. As a conare coming around my barber shop more,<br />\nsequence a large number of American college<br />\nsir; yes sir.\"<br />\npapers, which try to soar too high for their<br />\nyoung wings, fall flat to the ground. while<br />\nthe few which keep within the limit of their<br />\nIt is reported on good authority, that, deabilities succeed.<br />\nspite rumors to the contrary, \"Bill\" Stewart<br />\nis still tyranizing over the Freshmen in the<br />\nMinor Chemistry lab. It is also well worth<br />\nHugh Asbury Hackett, '05, died November believing that the grand Lady of the Stock<br />\n17 at Alleghaney, Pa. While at the University Room is hazing some, too.<br />\nMr. Hackett attained much honor for his work<br />\nin science. He was a member of the Board of<br />\nA modernized recipe for Aqua Regia has<br />\nEditors of the \"1905 Hullabaloo.\" His untimely death has been much lamented by his been thoughtlessly placed in the hands of the<br />\nformer classmates and student friends. Sym- Freshmen taking chemistry. It reads as follows: \"Three fingers of hydrochloric acid and<br />\npathy is extended his relatives.<br />\none of nitric acid.\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nCHRISTIAN ASSOCIATION NOTES.<br />\nThe first of the series of special monthly<br />\nmeetings, held November 13, was well attended<br />\nby graduates and undergraduates. Mr. Davis<br />\nmade a strong plea for manly effort and endurance in the \"race of our lives.\" Messrs.<br />\nAdkins and H. N. Holmes sang.<br />\nThe second of this series of meetings will be<br />\nheld December 11. Mr. Bates, a worker in<br />\nthe tenement district of the West Side, New<br />\nYork, will tell about the conditions there,<br />\nshowing the characteristics of the foreign element which nearly elected Hearst in the<br />\nrecent gubernatorial contest.<br />\n<br />\nA sociable for the Association members is<br />\nbeing planned for an evening in the near<br />\nfuture. There will be a short program, followed by an informal good time, with Hopkins<br />\nsongs and yells.<br />\n<br />\nBOARDING HOUSE EUCLID.<br />\nA.<br />\n-DEFINITIONS.<br />\n<br />\nI. All boarding houses are the same boarding house.<br />\n2. Boarders in the same boarding house<br />\nand on the same flat are equal to one another.<br />\n3. A single room is that which hath no<br />\nparts and no magnitude.<br />\n4. The landlady is a parallelogram, i. e.,<br />\nan oblong angular figure that cannot be described but is equal to anything.<br />\n5. A wrangle is the disinclination to each<br />\nother of two boarders that meet together but<br />\nare not on the same floor.<br />\n<br />\n11<br />\n<br />\nEXCHANGES.<br />\nWHY THE BEAR WENT OVER THE<br />\nMOUNTAIN.<br />\nA big brown cub in his mountain lair<br />\nCrawled out of the rocks in search of air;<br />\nHe fled, for a great, wide grin,<br />\nOver a big, broad chin,<br />\nInformed him that Teddy was there.<br />\n—The Red and White.<br />\n<br />\nA MATHEMATICAL WOOING.<br />\nHe ldered at her soulful eyes<br />\nAnd at her dreamy atti2de,<br />\nAnd wi3peated, heart-born sighs<br />\nB4 the shrine of Her he sued.<br />\n\"15 said anything to you<br />\nThat love6 seems, I do not care;<br />\nIt71y indeed—indeed, 'tis true!—<br />\nTo contempl8 your face so fair.<br />\nI pray you, then, to be b9,<br />\nAs 10der as you there is none—<br />\nSay, then, sweet maid, will you be mine?<br />\nIn other words, we will be 1.\"<br />\nShe said she thought they 0 2 8,<br />\nBut he cried: \"No, for Cupid's s%t<br />\nHas pierced me. I'll atl0u8<br />\nUnless you bring the healing draft.\"<br />\nShe blushed and shyly gave consent<br />\nAnd while they marvelled each to each,<br />\nShe said: \"I knew just what you meant,<br />\nI love your figur8tive speech.\"—Ex.<br />\n<br />\nProfessor of Latin (to student translating)—<br />\nDon't you think you had better turn over the<br />\npage? You've rendered five lines of the next<br />\npage already.—Punch Bowl.<br />\n<br />\n6. All other rooms being taken, a single<br />\nroom is said to be a double room.<br />\nB.<br />\n-POSTULATES AND PROPOSITIONS.<br />\n<br />\n1. A pie may be produced any number of<br />\ntimes.<br />\n2. The landlady may be reduced to her<br />\nlowest terms by a series of propositions.<br />\n—Exchange.<br />\n<br />\nHe—Your face is a photograph on my<br />\nheart.<br />\nShe—Let's go in the dark and develop<br />\nit.—Ex.<br />\n<br />\nWhat's the naval definition of a kiss? A<br />\npleasure smack.—Ex.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n12<br />\n<br />\nTAKE NOTICE II<br />\n<br />\nTRACK.<br />\n<br />\nAll students interested in baseball, and<br />\ndesirous of seeing one to represent Hopkins<br />\nnext spring, will please meet in the Trophy<br />\nRoom, Wednesday, November 28. This move<br />\nwas decided on by the Board of Governors of<br />\nthe Athletic Association at its last meeting, as<br />\nit wished to learn the sentiment of the student<br />\nbody regarding the advisability of having a<br />\nteam, and what material there was in sight.<br />\nTURN OUT! HOPKINS SHOULD HAVE<br />\nA TEAM!<br />\n<br />\nThe track team has gotten together, especially two of the distance men, and there<br />\nare bright prospects for a fine squad. Many<br />\nnew candidates are working for places on the<br />\nteam and under the careful guidance of Mr.<br />\nWest, our new trainer, they should make very<br />\npromising runners. Mr. West, by the way<br />\nwill no doubt make good for he seems to understand his business especially in inoculating<br />\nthe men with the spirit of the work.<br />\n<br />\nR. Q. TAYLOR & CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br />\n<br />\nNORTH<br />\n<br />\nConklin's<br />\nSelf<br />\n4<br />\nFillin-g Pen<br />\n<br />\nCHARLES STREET<br />\n<br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink, a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br />\n<br />\nDo You Enjoy 600D Cigarettes?<br />\nIf so, let us make you a Sample<br />\n.1<br />\n.<br />\n41<br />\n<br />\net- II `• •.,itigVA,ti rl.1,, 'I<br />\n1,`0:<br />\n,{1111,<br />\n01147<br />\n[<br />\n<br />\nD<br />\n<br />\n4mullk<br />\n<br />\nr<br />\n<br />\nta<br />\nrr<br />\n<<br />\n...,<br />\n411141Philig:Garhal N.Iii wittntlia.....,...tha.mcwa.thallimardliaall<br />\n0 HE<br />\n<br />\nA<br />\n<br />\nJ. MANKOW1TZ, 1101 E. Baltimore Street<br />\nG. FRANK WARD<br />\n<br />\nCHAS. T. RVAN<br />\n<br />\nRYAN & WARD<br />\nDesigners and Makers of<br />\n<br />\nMen's Clothes<br />\n<br />\nAll the hest dealers everywhere—<br />\nStationers, Druggists, Jewelers—<br />\nhandle the Conklin Pen or can supply you if you insist upon having It.<br />\nCosts no more than other fountain<br />\npens of best grade. 100 styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fountain pen repaired promptly.<br />\n<br />\n1111111111-<br />\n<br />\nTHE CONICLIN PEN CO.„<br />\n<br />\n16 NORTH LIBERTY STREET<br />\n<br />\n.Tolede,Oblo.<br />\n614418-618 J•Itersos<br />\n111Pes Conklin Self-1111Ing<br />\n<br />\n/A7<br />\n/<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nUnder Brewers' Exchange<br />\n<br />\nBaltimore Steam Packet Company<br />\n(OLD<br />\n<br />\nBAY<br />\n<br />\nLINE)<br />\n<br />\nVOR<br />\n<br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br />\n<br />\nTICKET OFFICES<br />\n<br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br />\n<br />\n109 North Charles Street<br />\n506 Light Street<br />\n<br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday,6.30 p. in. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br />\n<br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br />\n<br />\nE. BROWN,<br />\nGeneral Passenger Agent<br />\n<br />\n\f\fLEMMERT<br />\nTailor<br />\nDo you want to be well dressed<br />\n<br />\nGLOWS MAY BE RIG! rr<br />\n<br />\nTry<br />\n<br />\nAND NM' BE FOWNES<br />\n<br />\nLEMMERT on his College Clothes<br />\nNot high in price, but way up in<br />\n<br />\n••<br />\n<br />\nBUT THEY CANT BE<br />\n<br />\nstyle.<br />\n<br />\n10 E. FAYETTE STREET<br />\n<br />\nFOWNES<br />\nAND NOT BE RIGHT<br />\n<br />\n4.4.44+44:4-:\"I'+':•+÷+÷^:*•:÷4+i•+•I'4++.1.++++++441<br />\n<br />\nWE MAKE tin c iivr TO ORDER IN<br />\ntpledU Jilin I THE CITY .<br />\n<br />\nMcPHERSONS<br />\nII EAST BALTIMORE: STREET<br />\nS<br />\nFLAGs<br />\n<br />\n14,4 C<br />\n<br />\n13<br />\n<br />\nS<br />\n<br />\nTIANNE,10.;<br />\n<br />\n,„,It<br />\n<br />\nDC;ES<br />\n<br />\nBALTIMORE, M.D.<br />\n<br />\n13 WEST 1.EXINOTON STREET,<br />\n<br />\nF. C. FOSS= & SON<br />\nfren'o furnicibinp<br />\n311<br />\n<br />\nEAST BALTIMORE ST.<br />\nBaltimore, Md.<br />\n<br />\nTHE YOUNG MEN'S STORE<br />\n<br />\nSTRAUS 13ROS.<br />\nTAILORS<br />\nFURNISHERS<br />\n<br />\n70<br />\nAili<br />\n<br />\nHATTERS<br />\nCLOTHIERS<br />\n<br />\nW.Baltimore St.<br />\n<br />\n20<br />\n<br />\nARE YOU WATCHING<br />\nTHIS SPACE?<br />\n<br />\nAdjoining New R. A4 0. Building<br />\n<br />\nVISITORS ARE ALWAYS WELCOME<br />\n<br />\nWhen, making your purchases, loudly remember our advertisers<br />\n<br />\n\f", "format": "basic_html", "processed": "auguream.<br />\nTHE•JOHRS•HOFKINSIMVERSITY<br />\nBALTIMORE<br /><br />\nTHE NEWS=LETTER<br />\nVOL. XI.<br /><br />\nNOVEMBER 23, 1906.<br /><br />\nSubscriptions, $1.50 per year.<br /><br />\nPublished Fortnightly.<br /><br />\nNo. 3<br />\nio Cents per copy<br /><br />\nBOARD OF EDITORS.<br /><br />\nStanley Meade Reynolds, 1907, Editor-in-Chief.<br />\nArthur Leonard Bloomfield, igo7, Ass't Editor-in-Chief.<br />\nCarl Lewis Bernhardt, 19o8, News Editor.<br />\nLawrence Melville Riddle, 1908,<br />\nHarry K. Hardcastle, 1908,<br />\nF. B. Pedrick, 1909,<br /><br />\nLeGrand Winfield Perce, 1907, Athletic Editor.<br />\nAlan Chesney, 1908, Asst't Athletic Editor.<br />\nHermann J. Hughes, 1908, Business Manager.<br />\nAss't News Editors.<br /><br />\nAddress all articles, communications, etc., to Stanley M. Reynolds, Box 517 Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business communications should be sent to Hermann J. Hughes, Box 224, Johns<br />\nHopkins University, Baltimore, Md.<br /><br />\nEDITORIAL.<br />\nHE reception which the Student Contribution Fund has met with among the<br />\nundergraduate body encourages us to believe that before the year is over,<br />\n*c** A**<br />\na promising nucleus will have been established about which an everincreasing Fund will grow. Although the column has been open in but<br />\n,<br />\n11<br />\none issue of the paper, the sum of $15 has already been realized, and,<br />\nwhile the contributions have not yet become general in character, it is<br />\n* 4expected<br />\nthat before the next issue of the NEWS-LETTE,R the amount<br />\n*<br />\n********* •<br />\nwill have at least doubled the present sum on hand. We do not wish it<br />\nto be supposed, that, because the three contributions thus far made<br />\namount to $5 each, we would not gladly and thankfully accept much<br />\nsmaller amounts, for, indeed, the original purpose of the idea was for the Fund to draw on<br />\nthe loose change, which the students might have from time to time in their pockets, and which<br />\ncould not be otherwise put to any economic use. It may be interesting to mention here that<br />\nthe New York Evening Post printed Saturday, November 10, a detailed outline of the purpose<br />\nof the Student Contribution Fund, calling attention to the fact that we hope, by means of the<br />\nFund, to erect or purchase some suitable memorial for one of the new buildings at Homewood,<br />\nwhich memorial will probably be a corner-stone for one of the buildings. To raise the required<br />\namount of money, it will doubtless be necessary to carry on the Fund for several years, or<br />\nuntil the present Freshman Class will have attained graduating honors.<br /><br />\nUROPE had her Martin Luther; America has had her Carrie Nation; and<br />\nnow from out the low-roofed recesses of the gymnasium locker room<br />\nconies an ever-swelling cry for a leader to head in a reform against certain<br />\nabuses there existing. Moved by the justice of the cry, the NEWS-LETTER,<br />\ngirding its loins with the apron of determination, and bearing aloft the<br />\nstaff of righteousness, has responded to the call, and taken up the cause<br />\nof the lovers of sanitation. Our slogan is \"Excelsior,\" and our motto<br />\n,41[441<br />\nis<br />\n\"New brushes and combs for the locker room.\" There's not to<br />\nE3<br />\nE3<br />\nreason<br />\nwhy, but someone has blundered. Can the responsible \"o<br />\n. ne give<br />\nst<br />\nsufficient cause and reason for the fact that one of the hair brushes is<br />\nwithout a handle? If so, let him show reason why the devasting germs of baldness have been<br />\nallowed to pluck all but a few of the bristles from the other brush, until, alas! it is late, too<br />\nlate, for even Hermicide. Let him justify the fact that for some time our sturdy athletes<br />\nhave been obliged to affect their coiffures by means of combs (?), whose toothless gums give<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\na mocking lie to usefulness. BUT THAT IS NOT ALL! If, indeed, we must use bristleless brushes and toothless gum, why can't they be kept at least clean, and not in the repulsive<br />\ncondition now characteristic of them? We do not know who is the one responsible for the<br />\ntonsorial equipment of the locker room, but whoever he is, let him hear otxr appeal. And,<br />\nfurther, let him have a few inches of the dust, now stratified on the benches in the gallery of<br />\nthe cage, removed to the geological laboratory in order that seating space might be given those<br />\nstudents who would like to watch the team practices from the gallery.<br /><br />\nOW that the year is well started, it is possible to• see some of the results<br />\nof the four years' course—at least as far as it affects the number of men<br />\nin the University. We are somewhat sorry to note that, despite the fact<br />\nthat two classes were supposed to enter this fall, there are only about<br />\n60 new men, and of the strictly four-year men, only about 30.<br />\nProbably if the men entering in the future will be limited strictly to the<br />\nfour-years' course, the size of the undergraduate body may eventually<br />\nincrease to about 200 from the present 160. But, if, as may be seen<br />\nfrom the catalogue, various loopholes are to be left open by which all those,<br />\nwho are more disposed to study than anything else, may squeeze themselves through in three years, the number of undergraduates will probably not increase. The<br />\nsmall size of the Undergraduate Department has always, we believe, been disadvantageous to<br />\nthe University. A strong mind dwells only in a healthy body; our Post-graduate Department<br />\nneeds a large body of collegiates to support it and furnish it material.<br />\nVERY day draws nearer to the time when the classes will have their banquets. The Freshman Banquet is looked forward to by all, both concerned and otherwise. Every year the Freshman Banquet stirs tip the<br />\nFreshmen into nervous excitement for at least two weeks ahead of the<br />\ndate, and the Juniors spend much of their not very valuable time in<br />\nspying and scouting. This was the case last year. The theory is of<br />\ncourse that the Freshmen have no right to a banquet, any more than a<br />\nfive-year old has to high-balls and cigarettes. We do not care to bring<br />\nup this weighty question; but the point is that the Freshman Banquet,<br />\nas now held, seriously interrupts the work of the University. Of<br />\ncourse, it is easy enough to suggest that either the Freshmen shall not give their banquet until<br />\narriving at the age of discretion or else the Juniors shall not interfere. It requires no experiment to see that neither of these expedients would work successfully.<br />\nPerhaps a compromise can be effected. Let the two classes come to terms, the Juniors<br />\non their part promising not to interfere with the Freshmen within four blocks of the University;<br />\nthe Freshmen on their part promising not to cut their classes, and also to publish the true date<br />\nof the banquet. Each sides concedes a vital advantage to the other side, which would tend to<br />\nsimplify matters and help the work of the University.<br />\nTO?<br />\nNot as summer seas are her eyes of blue,<br />\nNor her cheeks as the blush of the morn,<br />\nHer lips are not kissed with morning dew,<br />\nLow lieing on lowland and lawn;<br />\nNot as Araby wind is her fragrant breath,<br />\nNor strands of gold is her hair—<br />\nAnd yet my lady, my fond heart saith,<br />\nIs, of women, passing fair.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nA FEW SPELLING-REFORM FALLACIES.<br />\nThe spelling reform advocated by the Simplified Spelling Board has evoked, instead of<br />\nthe chilling indifference which such efforts so<br />\noften meet, an encouraging amount of opposition. The real ground of most opposition to<br />\nthe simpler forms is merely that they are<br />\nunfamiliar; yet few are thoughtful enough to<br />\nrecognize this or frank enough to admit it.<br />\nSome of the popular objections to them are<br />\nbased upon curiously false notions.<br />\nWhat may be called the Roosevelt fallacy is<br />\none of the most interesting of these notions.<br />\nIn the late midsummer, when journalists<br />\nlanguisht for something to make a sensation<br />\nout of, President Roosevelt directed the Public<br />\nPrinter to adopt the three hundred simpler<br />\nforms selected by the Board. The effect of<br />\nthis order was magical. Correspondents made<br />\ncopy of it by the yard; patriots who do not<br />\nread a government report once in ten years<br />\nprotested bitterly at the desecration of those<br />\ndocuments by revolutionary English; and an<br />\nEnglish journal remarked contemptuously that<br />\nthe reformed spelling might be good enough<br />\nfor a nation of yesterday, but would never do<br />\nfor a people blest with a tradition of a thousand years. The result was that, in the minds<br />\nof many persons, the responsibility of the<br />\nwhole reform was laid on the broad shoulders<br />\nof the President, and the Simplified Spelling<br />\nbecame the \"Roosevelt Spelling.\" Consegently there are those who do not like the<br />\nsimpler forms because they do not approve of<br />\nMr. Roosevelt, and are hardly to be persuaded<br />\nthat he is not at the bottom of the whole thing.<br />\nYet it is hard to see, apart from political<br />\nprejudice, why the government printing house<br />\nshould necessarily be the least up-to-date.<br />\nIndeed, since the official reports are all practical in purpose and quite out of the realm of<br />\npure literature, they are especially fitted for<br />\ntempting usage with desirable simplifications.<br />\nCertainly, nobody's esthetic sense can be<br />\nseriously offended by Mru in an agricultural<br />\nreport.<br />\nThe authorityfallacy is almost the converse<br />\nof the Roosevelt fallacy. \"What right has a<br />\nself-constituted board to dictate how I shall<br />\nspell?\" says an objector. \"We should have<br />\na cabinet officer to supervise language,\"<br /><br />\nurges another, \"or a representative convention called by the government to propose<br />\nreforms.\" Now, of course, the Simplified<br />\nSpelling Board makes no assumption of authority, tho the changes which it proposes are<br />\nbased upon the soundest scholarship. In the<br />\nrepublic of intellect there are no dictators;<br />\nanybody has a right to make a motion and to<br />\nget it carried if he can.<br />\nThe etymologicalfallacy is a great favorite<br />\nwith everybody except the etymologist. It is<br />\ndoubly fallacious, because the simplified<br />\nspellings do not, as a rule, obscure the history<br />\nof the words, and if they did, no great harm<br />\nwould result. Popular off-hand etymologizing<br />\nis less reliable than popular diagnosis of diseases. The untrained reader who wants to<br />\nknow the history of a word should consult all<br />\nthe good dictionaries within reach, and should<br />\nremember that even they are not infallible.<br />\nHe will know what a debt is long before he<br />\nlearns that the word is related to the Latin<br />\ndebitum. When he knows that, it will be a<br />\nshort step to the knowledge that the useless<br />\n\"b\" was rudely forced into the word as a<br />\nsign of its origin, a sign wholly false to its<br />\nhistory. The fact that doul, delite, sovran,<br />\nrime, agast and iland are etymological, and<br />\nthat the current spellings are the results of deliberate interference with their development,<br />\nmay serve as a starting point for wholesome<br />\ndistrust of the historical value of our present<br />\nspelling. If we spelled alms so as to show its<br />\norigin, the form should be eleemosyne. Some<br />\nday we shall muster up enough courage to<br />\nspell it ams.<br />\nThe language-of-Shakespearefallacy, tho one<br />\nof the lest reasonable, is perhappes the moast<br />\nseductive; for it gives toe the dres in whiche<br />\nthe gret monuments of Englishe lytterature<br />\nappere to-daie the reverense dewe to those<br />\nmonumentes themselves. The spelling of todaye, however, ys not the spellynge of Shakespear. Shaxpere's spelling,iffe moare lawlesse,<br />\nwas often simpler and more usefull than ours,<br />\nfor the pedants hadde not yet got holde of yt.<br />\nIff the grete poete coud have compar'd the<br />\nmoderne.version of his works with a version<br />\nsimplifide acording too the suggestions of the<br />\nBoard, hee would probably finde more familyar<br /><br />\nTHE NEWS-LETTER.<br /><br />\nformes in the lattyr. Shaxsper spelt as he<br />\nplesed,—al the spellings in this paragraff ar<br />\nShaksperean—and sertenly hee would bee the<br />\nlaste to denie too us som fredom from fetters<br />\nthat he would have spurned.<br />\nThe written language belongs peculiarly to<br />\neducated men. To free it from historic<br />\nblunders and save it, so far as may be, from<br /><br />\n5<br /><br />\nthe mishaps of chance should be a welcome<br />\ntask. Deliverance from superstitious awe of<br />\nthe dictionary and from blind worship of the<br />\nspelling book must come, if at all, from the<br />\ncollege-bred man. The Hopkins student who<br />\nis indifferent to the reform, or thoughtlessly<br />\nhostile, is in a false position.<br />\nS. J.<br /><br />\nRONDEAU A LA DOBSON.<br /><br />\nWhen roses bloom, and<br />\nviolets blue<br />\nLift up their loveliness to<br />\nyou,<br />\nA n d wondering, s e e in<br />\n'bashed surprise<br />\nThe myriad violets of thine<br />\neyes;<br />\nWhen of the butter-cups,<br />\nbut two<br />\n(Both moistened still with<br />\nmorning dew)<br />\nHave budded—think how<br />\nsummer flies,<br />\nWhen roses bloom.<br /><br />\nWhen twilight falls, and stars are new,<br />\nAh think ! how bitterly we'll rue<br />\nThese days of youth. E'er summer dies,<br />\nWaste not the time with useless sighs;<br />\nSuch happy moments come to few,<br />\nWhen roses bloom!<br />\n—S. C. C.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\nPLEA FOR UNDERGRADUATE FOOTBALL.<br />\n\"'The time has come,' the walrus said,<br />\n'To talk of many thing,<br />\nOf shoes, and ships, and sealing-wax,<br />\nOf cabbages and king.'\"<br />\nThe time has indeed come, to have an undergraduate football team at John Hopkins.<br />\nThe team, this year, has not been very successful, owing to several causes. In the first<br />\nplace, the game, as changed by the new rules,<br />\nmakes it imperative that a team have out-door<br />\npractice. The new trick plays absolutely<br />\nneed out-door practice to insure their success,<br />\nand out-door practice is an impossibility under<br />\nthe present system. If we had an undergraduate team, we could get out-door practice<br />\non Wednesday afternoons, at least, and even<br />\none afternoon would work wonderful results<br />\nin a team. As we rely upon the men from<br />\nthe Medical School to form the backbone of<br />\nthe team, we can not get any out-door practice<br />\nat all. Instead, we have to be content with<br />\npractices in the cage from 6 p. in. to 7 p. m.<br />\nThat means that the team must have supper<br />\nevery Monday, Wednesday and Friday night,<br />\nand this supper item is one of the largest<br />\nexpenses that the management has to put up<br />\nwith. With an undergraduate team, practices<br />\nwould start promptly at 5, and would stop at<br />\n6. The men would have ample time to get<br />\nhome for supper, and thus relieve the management of a heavy load.<br />\nAgain, an undergraduate team could be<br />\ngotten which would train hard. That was<br />\none of the faults of this year's team, for there<br />\nwas little or no training done. The men from<br />\nthe Medical School can not be blamed, for not<br />\ntraining; it is too much for us to expect it of<br />\nthem, but an undergraduate team could be<br />\nmade to train and to train hard. We get out<br />\nlacrosse and track teams that are willing to<br /><br />\nTHAT FATAL SMILE.<br />\nThere once lived a fellow named Dewey,<br />\nWho lived in the City St. Lewey,<br />\nWhen asked why he fed<br />\nOn oatmeal, he said:<br />\n\"Because I like things that are gewey.\"<br /><br />\ntrain, and there is no reason at all why we<br />\nshould not get out a football team which<br />\nwould be willing to train.<br />\nDissenters will say that the advantages<br />\nderived from out-door practice and training<br />\nwill not, by any means, measure up to the<br />\nadvantages of having men from the Medical<br />\nSchool who have played before and who know<br />\nthe game. As a matter of fact, owing to the<br />\nchanged style of play of football, the experienced men are not much better off than the<br />\nnew men, for they are compelled to unlearn<br />\nmany things before they can adapt themselves<br />\nto the new conditions.<br />\nThere is plenty of good football material<br />\namong the classes, which needs just a little<br />\ncoaching to turn into 'Varsity material.<br />\nDoubtless, the team would not be a worldbeater the first year or so, but as soon as an<br />\nefficient scrub is developed, we might look for<br />\nwinning teams. Under the present system<br />\nthere is practically no scrub at all, because<br />\nthe undergraduates will not come out at 6.30<br />\nand be kept out until 7.30, getting cold<br />\nsuppers at home. It stands to reason that<br />\nthe undergraduates will not come out and<br />\nscrub against a team in which they are not<br />\ninterested. But with an undergraduate team,<br />\nit is safe to predict that every practice will<br />\nsee a scrub team out, just as there is always a<br />\nscrub team for lacrosse and plenty of \"alsorans\" for track.<br />\nThere are, of course, reasons why we should<br />\nnot attempt a team next year based upon the<br />\nundergraduate students, but to the writer it<br />\nseems that the reasons in favor of a collegiate<br />\nteam outweigh the others. So let us see<br />\neveryone turn out to make a good representative team next year.<br /><br />\nALAN M. CHESNEY.<br />\nHORRYBILE H<br />\nA fellow, who lived in Mobile,<br />\nContinued to ride an old wile,<br />\nTill it broke with a crash,<br />\nWhen he muttered \"Blank, dash!<br />\nThat really did hurt a good dile.\"<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nTHE GRAY-HAIRED SERENADE.<br /><br />\nSTUDENT CONTRIBUTION FUND.<br /><br />\nE'er Adam ate the apple, and so, by sinning<br />\nfell—<br />\nHe told a tale in Eden, which I'll proceed to<br />\ntell:<br />\nHe sat alone and sang alone, and of his Eve<br />\nsang he;<br />\nThe words—tho' in translation—are often sung<br />\nby me.<br /><br />\n(Contributions should be sent to Mr. Hermann J. Hughes, Business Manager, Johns<br />\nHopkins NEWS-LETTER, Box 224, John Hopkins University.)<br /><br />\nMark Antony loved Cleo—and sitting by the<br />\nNile,<br />\nRepeated pretty little things, which won for<br />\nhim a smile.<br />\nThen sat alone and sang alone—of Cleopat—<br />\nsang he;<br />\nThe words—of course, they're `Englished\"—<br /><br />\nare often sung by me.<br />\nThe years rolled by and Rosamund was<br />\nHenry II.'s love,<br />\nWho called her many silly things—for instance, \"pretty dove.\"<br />\nThen, sitting down, he sang alone—of Rosamund sang he;<br />\nThe words—\"done into modern prose\"—are<br />\noften sung by me.<br />\nAnd finally, young Romeo Miss Capulet did<br />\nwoo,<br />\nAnd sang such songs to her, as I have mentioned here to you.<br />\nHe went 'way back, and sitting down, of<br />\nJuliet sang he;<br />\nThe words—\"accurately rendered from the<br />\noriginal Italian, with introduction, notes<br />\nand appendix\"—<br />\nare<br />\noften<br />\nsung<br />\nby<br />\nme !<br /><br />\n-S. C. CHEW, jR.<br /><br />\nNEWS-LETTER<br />\nArthur R. Padgett, '07<br />\nS. M. R., '07<br /><br />\n$5.00<br />\n5.00<br />\n5.00<br /><br />\n$15.00<br />\nBALLADE OF LOST SOULS.<br />\nThey shiver and shake in chattering cold<br />\nOf the grewsome Valley of Death,<br />\nThe charnel dew drops thick, but slow,<br />\nAnd they moan and groan as they draw their<br />\nbreath.<br />\nOne said: \"I kissed her a nine month back,<br />\nAnd she kissed me, too, full well.<br />\nBut that kiss is branded deep in my brow,<br />\n0 would that I were in hell!\"<br />\n\"And now she visits me by night—<br />\nHer face is pale and thin,<br />\nBehind her leer the Furies Three—<br />\nHow monstrous is their grin!\"<br />\n\"I would to God my memory<br />\nCould die as did my clay,<br />\nBut I think, I think, I think of the past.<br />\nFrom now till Judgment day.\"<br />\nA cold grey moon dropped down behind<br />\nThe tombs of those poor lost souls,<br />\nAnd the dead men turned among<br />\nThe worms and rats and moles.<br /><br />\nTHE RHYMSTER'S COMPLAINT.<br />\nI've rhymed in reason—and out,<br />\nI've written in season—and out,<br />\nI've written to boys, I've written to girls,<br />\nI've sung of \"brown eyes,\" and \"curliest<br /><br />\ncurls,\"<br />\nI've called her \"a jewel,\" apearl among<br />\npearls,\"—<br />\nIs there nothing to warble about?<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nCLASS FOOTBALL.<br />\nBoth class teams have started work in earnest, and either the Junior or Freshman<br />\neleven may be seen almost any day in the<br />\ncage, going through signal practice. So far,<br />\nthe Freshmen seem to have had the larger<br />\nsquad out, but the Juniors have not been<br />\nexactly napping. In fact, Captain Abel, of<br />\nthe Junior team is wearing a worried look<br />\nnow all the time, and is earnestly requesting<br />\nhis men to come out. He has been taking<br />\na hand at quarter, and will probably play<br />\nthere. This will necessitate some changes in<br />\n1908's back-field. Just who will play in the<br />\nback-field, is, of course, very uncertain, and<br />\nwill not be definitely decided until the day of<br />\nthe class game. The Junior class is rather<br />\nhandicapped for lack of good line material,<br />\nsince there are few men in that class who<br />\nhave played on the line before.<br />\nSo far 1908 has played one game—that<br />\nagainst City College, which was lost by the<br />\nscore of 17-0. In this game the Junior backs<br />\ncarried the ball fairly well, but the whole<br />\nwas wofully lacking when it came to defensive<br />\nwork. Several interesting arguments occurred<br />\nin the game, which resulted in Silkman of<br />\nB. C. C., and Breyer and Wegefarth of the<br />\nJuniors being sent to the side-lines. Abel<br />\nmade a very brilliant run of fifty yards, almost<br />\nmaking a touch-down.<br />\nThe Freshmen have certainly not been<br />\nhandicapped for lack of men, for they seem<br />\nto have had a large squad out. They have<br />\nplayed two games, the first one with Marston's, and the second with Dunham's. The<br />\nfirst game only lasted one half and was played<br />\non a field covered with mud. The Freshmen<br />\nwon by a score of 11-5. The game with Dunham's resulted in a defeat for 1909 by the<br />\nscore of 5-0. In this game the Freshmen did<br />\nmuch better than in the previous one, and<br />\ncame very near winning. Taking it all in all,<br />\nthe class game this year should be very close<br />\nand very interesting and the result is likely to<br />\nbe in doubt until the referee's whistle blows<br />\nfor the last time.<br /><br />\nHOPKINS, 10-B. M. C., 0.<br />\nThe team has won at last, and the victory<br />\nwas well earned. Some around the University<br />\nwere very doubtful about the outcome of the<br /><br />\ngame, and, as a result, a number of them<br />\nstayed away, saying that they did not care to<br />\ngo out and see the team lose. As a matter of<br />\nfact, their predictions fell flat, for the team<br />\nwon in a hard-played game by the score of 10<br />\nto 0. And Baltimore Medical College was by<br />\nno means an easy team. They outweighed our<br />\nfellows to some extent, and they had several<br />\ngood individual players, notably Wiggin, who<br />\nplayed right-half.<br />\nThe field was a little slippery, so that some<br />\nof the plays were not run off as fast as they<br />\nmight have been, but on the whole, the play<br />\nwas good. The first half was anybody's game,<br />\nwith the ball in Hopkins' territory. Here it<br />\nwas that B. M. C. played best, making several<br />\ngood end runs, and once or twice threatened<br />\nto kick a goal from field, but were blocked by<br />\nthe Hopkins' linemen breaking through. Unfortunately for B. M. C., their kicking staff<br />\nwas poor—for the punts were bad and the<br />\nattempted drop-kicks failed.<br />\nAs usual, J. H. U. played better ball in the<br />\nsecond half, and by straight line bucking<br />\nfinally pushed Webb over for the first touchdown. The ground was gained principally by<br />\noff-tackle plays, varied occasionally by short<br />\nend runs. The second touchdown came near<br />\nthe close of the game, and was the result of a<br />\npretty run by Stewart. The play was right<br />\noff tackle, but Stewart managed to get clear,<br />\nand, dodging the quarter-back, planted the<br />\nball between the posts.<br />\nThe defensive work of the team was much<br />\nbetter, on the whole, than that displayed in<br />\nthe Haverford game, but the team must not<br />\nget swelled heads, or become over confident<br />\nabout the St. John's game. St. John's will<br />\nput up their strongest game against Hopkins,<br />\nand they may be depended upon to play for<br />\nblood. They will give all they have, and J.<br />\nH. U. must be prepared to do the same.<br />\nAll three backs carried the ball well on Saturday, and could be depended upon to gain.<br />\nHart was so unfortunate as to sustain a bad<br />\ncut over his eye, but we hope that this will not<br />\ninterfere with his playing next Saturday.<br />\nRidgely got in some very effective tackling at<br />\nright end, as did Michael at left tackle. Captain Preble got in the game in the second half,<br />\nand inspired confidence by his presence.<br />\nOnly two more games remain to be played—<br />\nSt. John's at Annapolis, and University of<br />\nMaryland at Oriole Park on Thanksgiving<br />\nafternoon. Rooters! Brace up! Why shouldn't<br />\nevery rooter supply himself with a small megaphone such as the Navy uses? Then we<br />\nwould have some rooting worth while.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHAVERFORD, 23-HOPKINS, 0.<br />\nThere is little to say about the game between Haverford and our fellows, and what<br />\nthere is to say, has little pleasure for all Hopkins men. The team went up to Haverford<br />\nwith high hopes of winning, after the way<br />\nthey played against Swarthmore, but the way<br />\nHaverford played was a revelation, and the<br />\noutcome of the game was a bitter disappointment to rooters and players alike.<br />\nThe loss of the game can be attributed to<br />\nlack of training more than anything else.<br />\nHaverford started off with a rush, making<br />\nseveral long end runs at the start, and completely winded the Hopkins team right away.<br />\nIt was the old story of a fast, well-trained<br />\neleven against a heavy, but very poorly-trained<br />\nteam, and, as a result, there could be but one<br />\nending.<br />\nThe conditions were ideal for football—a<br />\nleaden sky, cold air, and a hard field, just<br />\nwhat was needed to put snap and vim into a<br />\nteam, but Haverford seemed to get all the<br />\nsnap and vim. In a very short time after the<br />\nkick-off, they had scored their first touchdown, mainly by end runs. Shortly after they<br />\nscored their second touchdown. Here it was<br />\nthat Hopkins seemed to take a brace, for<br />\nHaverford was held on our twenty-yard line<br />\nand was forced to try for a goal from placement, which barely crossed the bar. This<br />\nmade the score 15-0, after which the first half<br />\nwas ended.<br />\nIn the second half, Hopkins took a slight<br />\nbrace, but by that time, it was too late, for<br />\nher men were completely fagged out, and<br />\nwere unable to advance the ball. Only long<br />\npunts by Michael kept the warriors in red and<br />\nblack from getting closer to the Baltimore<br />\nboys' goal. As it was, Haverford made a<br />\nthird touchdown, and also a safety, running<br />\nthe score up to 23-0.<br />\nThe whole team was far below its standard,<br />\nand played worse than in any game so far this<br />\nseason, Not only were the men out of condition, but they seemed to lack spirit. A<br />\ndecided brace must be taken, if St. John's<br />\nis to be beaten. The Hopkins team does not,<br />\nas yet, know what it is to cross the goal line<br />\nof her opponents, and must play a much<br />\nbetter game if they want to win from the<br />\nAnnapolis team.<br /><br />\n9<br /><br />\nHOMEWOOD HO!<br />\nHomewood is a word that is now on every<br />\none's tongue. There are some few who take<br />\nit seriously, but the majority of the students<br />\nand even of the faculty take it as a huge joke.<br />\nNow here is just where the trouble lies. If<br />\neveryone, both professors and students, would<br />\nbe anxious and would strive earnestly to get<br />\nto Homewood, it could be done very quickly.<br />\nWhen you ask anyone if he is anxious to get<br />\nto Homewood he says yes immediately; but<br />\nwhen you ask him to contribute even a little,<br />\nhe laughs at you, and says that it is impossible to raise enough money for the University<br />\nto move. Nothing is impossible. Where<br />\nthere is a will, there is a way. A million<br />\ndollar endowment fund was raised; why can<br />\nnot another million dollars be raised for the<br />\npurpose of moving to Homewood? If every<br />\nstudent would contribute to the Student Fund<br />\nas much as each one could afford, we should<br />\nhave a fair start; and a thing once begun is<br />\nhalf done. The president should appeal to<br />\nthe alumni of this city, and I am sure he<br />\nwould receive liberal contributions. Then<br />\nthere are the Johns Hopkins Alumni Associations of other cities, which could easily raise<br />\nseveral thousand dollars. The trouble is that<br />\nthe University is asleep and expects to wake<br />\nup some day to find that all the buildings<br />\nhave been erected at Homewood. The days<br />\nof fairy stories are over; and if you want anything now-a-days, it is necessary to work<br />\nhard for it. Why do not the wives of the professors take enough interest in the University<br />\nto get up some entertainments or fairs for the<br />\nbuilding fund? Churches make thousands of<br />\ndollars in this way, and so could the University. Again these ideas are hooted at; but<br />\nthey would do good, for when people see that<br />\nthe University is helping itself, they would<br />\ngladly give assistance. We can not expect<br />\nto get enongh money immediately or even in<br />\none year, but it would not take more than two<br />\nyears. If such action had been taken when<br />\nwe first received the property, we should now<br />\nbe near to occupying that most beautiful tract.<br />\nVery few people realize what a grand site<br />\nHomewood is. We may venture to say that<br />\nwhen the Universty becomes settled at Homewood—and we trust that it shall be within a<br />\nfew years—it will be one of the most beautitiful colleges in the country. The place is<br />\nideal for a university.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nSTUDENT PUBLICATIONS.<br /><br />\nALUMNI NOTES.<br /><br />\nIf we look over the college papers of our<br />\n'06. Ormond Willson Hammond, Editorcountry and of England and Canada, we in-Chief of the NEWS-LETTER a portion of<br />\nnotice that they fall into two classes—those last year, is studying law at the University of<br />\nwhich aim at entertaining and those which aim Maryland, and is also in the office of the<br />\nto set before the student models of prose and American Bonding Company.<br />\nverse, and now and then a good moral talk.<br />\n'06 (Ph.D.). William L. Kennon is assoThe former are apt to contain almost anyprofessor of chemistry at Williams Colciate<br />\nthing, the latter, articles based, or supposed<br />\nMass.<br />\nlege,<br />\nto be based, on classical models. In America<br />\nthe journals fall under both heads, while in<br />\n'06 (Med.). Edwin H. Schorer is at the<br />\nEngland and Canada they belong, so far as Rockefeller Institute, New York City.<br />\nwe can judge from our exchanges, to the<br />\n'06. Carlyle Barton is studying law at the<br />\nlatter class. Now which of these two methods<br />\nof Maryland, and also teaching at<br />\nUniversity<br />\nsucceeds in producing a creditable and interSchool.<br />\nPaul's<br />\nSt.<br />\nesting paper? This depends as much upon<br />\nthe reader as upon the writer. The paper<br />\n'05 (Med.). F. Peyton Rouse is in the<br />\nwill be creditable if the end is attained and faculty of medicine at the University of Michinteresting; if it is what the reader wants.<br />\nigan.<br />\nTo consider the English journals first, we<br />\n'04. George Foster is studying law at the<br />\nfind that, because of the spirit of conservatism<br />\nof Pennsylvania.<br />\nUniversity<br />\nrunning through the universities and the<br />\ntendency to stick to the beaten track of the<br />\n'03 (Ph.D.). John Hildt is in the faculty<br />\nstudy of the classics, the student body is better of Smith College, Mass.<br />\nable to produce articles of a sober and logical<br />\n'02. Ogle Marbury is practicing law in this<br />\nnature, and better prepared to enjoy such<br />\nin the firm of Dallam &amp; Marbury.<br />\ncity<br />\nefforts on the part of its fellows. Hence<br />\nEnglish and Canadian journals are generally<br />\ncreditable and often interesting.<br />\nIn America, however, the youth is full of<br />\nUNIVERSITY NOTES.<br />\nthe modern spirit, and, at least in the underthe<br />\nreached<br />\nyet<br />\nnot<br />\nhas<br />\ngraduate department,<br />\n\"Walter\" states with emphasis born of conperiod where he has acquired a profound<br />\nviction, that 'times is gettin' like ole times,<br />\nreverence for everything that savours of dusty<br />\nsir, because, sir, the young gentlemen, sir,<br />\nbooks or worn-out proverbs. As a conare coming around my barber shop more,<br />\nsequence a large number of American college<br />\nsir; yes sir.\"<br />\npapers, which try to soar too high for their<br />\nyoung wings, fall flat to the ground. while<br />\nthe few which keep within the limit of their<br />\nIt is reported on good authority, that, deabilities succeed.<br />\nspite rumors to the contrary, \"Bill\" Stewart<br />\nis still tyranizing over the Freshmen in the<br />\nMinor Chemistry lab. It is also well worth<br />\nHugh Asbury Hackett, '05, died November believing that the grand Lady of the Stock<br />\n17 at Alleghaney, Pa. While at the University Room is hazing some, too.<br />\nMr. Hackett attained much honor for his work<br />\nin science. He was a member of the Board of<br />\nA modernized recipe for Aqua Regia has<br />\nEditors of the \"1905 Hullabaloo.\" His untimely death has been much lamented by his been thoughtlessly placed in the hands of the<br />\nformer classmates and student friends. Sym- Freshmen taking chemistry. It reads as follows: \"Three fingers of hydrochloric acid and<br />\npathy is extended his relatives.<br />\none of nitric acid.\"<br /><br />\nTHE NEWS-LETTER.<br /><br />\nCHRISTIAN ASSOCIATION NOTES.<br />\nThe first of the series of special monthly<br />\nmeetings, held November 13, was well attended<br />\nby graduates and undergraduates. Mr. Davis<br />\nmade a strong plea for manly effort and endurance in the \"race of our lives.\" Messrs.<br />\nAdkins and H. N. Holmes sang.<br />\nThe second of this series of meetings will be<br />\nheld December 11. Mr. Bates, a worker in<br />\nthe tenement district of the West Side, New<br />\nYork, will tell about the conditions there,<br />\nshowing the characteristics of the foreign element which nearly elected Hearst in the<br />\nrecent gubernatorial contest.<br /><br />\nA sociable for the Association members is<br />\nbeing planned for an evening in the near<br />\nfuture. There will be a short program, followed by an informal good time, with Hopkins<br />\nsongs and yells.<br /><br />\nBOARDING HOUSE EUCLID.<br />\nA.<br />\n-DEFINITIONS.<br /><br />\nI. All boarding houses are the same boarding house.<br />\n2. Boarders in the same boarding house<br />\nand on the same flat are equal to one another.<br />\n3. A single room is that which hath no<br />\nparts and no magnitude.<br />\n4. The landlady is a parallelogram, i. e.,<br />\nan oblong angular figure that cannot be described but is equal to anything.<br />\n5. A wrangle is the disinclination to each<br />\nother of two boarders that meet together but<br />\nare not on the same floor.<br /><br />\n11<br /><br />\nEXCHANGES.<br />\nWHY THE BEAR WENT OVER THE<br />\nMOUNTAIN.<br />\nA big brown cub in his mountain lair<br />\nCrawled out of the rocks in search of air;<br />\nHe fled, for a great, wide grin,<br />\nOver a big, broad chin,<br />\nInformed him that Teddy was there.<br />\n—The Red and White.<br /><br />\nA MATHEMATICAL WOOING.<br />\nHe ldered at her soulful eyes<br />\nAnd at her dreamy atti2de,<br />\nAnd wi3peated, heart-born sighs<br />\nB4 the shrine of Her he sued.<br />\n\"15 said anything to you<br />\nThat love6 seems, I do not care;<br />\nIt71y indeed—indeed, 'tis true!—<br />\nTo contempl8 your face so fair.<br />\nI pray you, then, to be b9,<br />\nAs 10der as you there is none—<br />\nSay, then, sweet maid, will you be mine?<br />\nIn other words, we will be 1.\"<br />\nShe said she thought they 0 2 8,<br />\nBut he cried: \"No, for Cupid's s%t<br />\nHas pierced me. I'll atl0u8<br />\nUnless you bring the healing draft.\"<br />\nShe blushed and shyly gave consent<br />\nAnd while they marvelled each to each,<br />\nShe said: \"I knew just what you meant,<br />\nI love your figur8tive speech.\"—Ex.<br /><br />\nProfessor of Latin (to student translating)—<br />\nDon't you think you had better turn over the<br />\npage? You've rendered five lines of the next<br />\npage already.—Punch Bowl.<br /><br />\n6. All other rooms being taken, a single<br />\nroom is said to be a double room.<br />\nB.<br />\n-POSTULATES AND PROPOSITIONS.<br /><br />\n1. A pie may be produced any number of<br />\ntimes.<br />\n2. The landlady may be reduced to her<br />\nlowest terms by a series of propositions.<br />\n—Exchange.<br /><br />\nHe—Your face is a photograph on my<br />\nheart.<br />\nShe—Let's go in the dark and develop<br />\nit.—Ex.<br /><br />\nWhat's the naval definition of a kiss? A<br />\npleasure smack.—Ex.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n12<br /><br />\nTAKE NOTICE II<br /><br />\nTRACK.<br /><br />\nAll students interested in baseball, and<br />\ndesirous of seeing one to represent Hopkins<br />\nnext spring, will please meet in the Trophy<br />\nRoom, Wednesday, November 28. This move<br />\nwas decided on by the Board of Governors of<br />\nthe Athletic Association at its last meeting, as<br />\nit wished to learn the sentiment of the student<br />\nbody regarding the advisability of having a<br />\nteam, and what material there was in sight.<br />\nTURN OUT! HOPKINS SHOULD HAVE<br />\nA TEAM!<br /><br />\nThe track team has gotten together, especially two of the distance men, and there<br />\nare bright prospects for a fine squad. Many<br />\nnew candidates are working for places on the<br />\nteam and under the careful guidance of Mr.<br />\nWest, our new trainer, they should make very<br />\npromising runners. Mr. West, by the way<br />\nwill no doubt make good for he seems to understand his business especially in inoculating<br />\nthe men with the spirit of the work.<br /><br />\nR. Q. TAYLOR &amp; CO.<br />\nHats, Umbrellas, Canes, Hand Satchels<br />\nMark Cross Co.'s London Gloves<br />\n11<br /><br />\nNORTH<br /><br />\nConklin's<br />\nSelf<br />\n4<br />\nFillin-g Pen<br /><br />\nCHARLES STREET<br /><br />\nFor busy people.<br />\nNo bother.<br />\nFills itself.<br />\nCleans itself.<br />\nNo dropper.<br />\nNothing to take apart.<br />\nNothing to spill.<br />\nA dip in ink, a touch<br />\nof thumb to nickel<br />\ncrescent and the<br />\npen is full, ready<br />\nto write.<br /><br />\nDo You Enjoy 600D Cigarettes?<br />\nIf so, let us make you a Sample<br />\n.1<br />\n.<br />\n41<br /><br />\net- II `• •.,itigVA,ti rl.1,, 'I<br />\n1,`0:<br />\n,{1111,<br />\n01147<br />\n[<br /><br />\nD<br /><br />\n4mullk<br /><br />\nr<br /><br />\nta<br />\nrr<br />\n&lt;<br />\n...,<br />\n411141Philig:Garhal N.Iii wittntlia.....,...tha.mcwa.thallimardliaall<br />\n0 HE<br /><br />\nA<br /><br />\nJ. MANKOW1TZ, 1101 E. Baltimore Street<br />\nG. FRANK WARD<br /><br />\nCHAS. T. RVAN<br /><br />\nRYAN &amp; WARD<br />\nDesigners and Makers of<br /><br />\nMen's Clothes<br /><br />\nAll the hest dealers everywhere—<br />\nStationers, Druggists, Jewelers—<br />\nhandle the Conklin Pen or can supply you if you insist upon having It.<br />\nCosts no more than other fountain<br />\npens of best grade. 100 styles and<br />\nsizes to select from shown in our<br />\ncatalog, furnished free upon request. Any make or style of fountain pen repaired promptly.<br /><br />\n1111111111-<br /><br />\nTHE CONICLIN PEN CO.„<br /><br />\n16 NORTH LIBERTY STREET<br /><br />\n.Tolede,Oblo.<br />\n614418-618 J•Itersos<br />\n111Pes Conklin Self-1111Ing<br /><br />\n/A7<br />\n/<br /><br />\nBALTIMORE, MD.<br /><br />\nUnder Brewers' Exchange<br /><br />\nBaltimore Steam Packet Company<br />\n(OLD<br /><br />\nBAY<br /><br />\nLINE)<br /><br />\nVOR<br /><br />\nOld Point Comfort, \"Fortress Monroe,\"<br />\nNorfolk and Portsmouth<br />\nCONNECTIONS FOR ALL POINTS SOUTH<br /><br />\nTICKET OFFICES<br /><br />\n107 East Baltimore Street<br />\nBaltimore and Calvert Street<br />\n(Continental Trust Bldg.)<br /><br />\n109 North Charles Street<br />\n506 Light Street<br /><br />\nSteamers Virginia, \"New\" Alabama and Georgia leave Light Street Piers, foot of Barre, daily except<br />\nSunday,6.30 p. in. These steamers pass in full view \"Jamestown Exposition Grounds.\"<br /><br />\nJ. R. SHERWOOD,<br />\nVice-President and General Manager<br /><br />\nE. BROWN,<br />\nGeneral Passenger Agent<br /><br />\nLEMMERT<br />\nTailor<br />\nDo you want to be well dressed<br /><br />\nGLOWS MAY BE RIG! rr<br /><br />\nTry<br /><br />\nAND NM' BE FOWNES<br /><br />\nLEMMERT on his College Clothes<br />\nNot high in price, but way up in<br /><br />\n••<br /><br />\nBUT THEY CANT BE<br /><br />\nstyle.<br /><br />\n10 E. FAYETTE STREET<br /><br />\nFOWNES<br />\nAND NOT BE RIGHT<br /><br />\n4.4.44+44:4-:\"I'+':•+÷+÷^:*•:÷4+i•+•I'4++.1.++++++441<br /><br />\nWE MAKE tin c iivr TO ORDER IN<br />\ntpledU Jilin I THE CITY .<br /><br />\nMcPHERSONS<br />\nII EAST BALTIMORE: STREET<br />\nS<br />\nFLAGs<br /><br />\n14,4 C<br /><br />\n13<br /><br />\nS<br /><br />\nTIANNE,10.;<br /><br />\n,„,It<br /><br />\nDC;ES<br /><br />\nBALTIMORE, M.D.<br /><br />\n13 WEST 1.EXINOTON STREET,<br /><br />\nF. C. FOSS= &amp; SON<br />\nfren'o furnicibinp<br />\n311<br /><br />\nEAST BALTIMORE ST.<br />\nBaltimore, Md.<br /><br />\nTHE YOUNG MEN'S STORE<br /><br />\nSTRAUS 13ROS.<br />\nTAILORS<br />\nFURNISHERS<br /><br />\n70<br />\nAili<br /><br />\nHATTERS<br />\nCLOTHIERS<br /><br />\nW.Baltimore St.<br /><br />\n20<br /><br />\nARE YOU WATCHING<br />\nTHIS SPACE?<br /><br />\nAdjoining New R. A4 0. Building<br /><br />\nVISITORS ARE ALWAYS WELCOME<br /><br />\nWhen, making your purchases, loudly remember our advertisers<br /><br />"}], "field_media_file": [{"target_id": 36342, "display": null, "description": null, "target_type": "file", "target_uuid": "d353f15a-a6f1-4d52-b78d-469dc5b7ce99", "url": "http://digital.library.jhu.edu/system/files/2022-03/12310-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12310, "target_type": "node", "target_uuid": "b6a39646-93ce-46b7-8c11-dee574225df4", "url": "/node/12310"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "1c0bb591-696c-4a8f-bc72-38138027e0fe"}]}