{"mid": [{"value": 35651}], "uuid": [{"value": "93430774-acd2-40b1-b473-3fc78baf2721"}], "vid": [{"value": 35651}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12194-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:35+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "rIstnias NUrnber.<br />\nVol. VI. No. 6<br />\n<br />\nMY COLLEGE DAIS, by Jas. K. Hackett.<br />\n0<br />\n<br />\nDecember 18, 1901.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns1oR1n Press.<br />\n<br />\nBALTIMORE, MD.<br />\nT.<br />\n<br />\nTwenty Sixth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\n.<br />\n.<br />\n.<br />\nPresident,<br />\nDean of the Medical Scho,,i,<br />\nDean of the College.<br />\n.<br />\n.<br />\n<br />\nIRA REMSEN.<br />\nwm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidat a for tho degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;cours a for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of 13. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n100,00) volumes.<br />\n1:35,1010 volunws.<br />\n200.0110 \\<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological (7hemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\n(Ireek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nHorns ace,<br />\n<br />\nDirectors.<br />\nIra Bentsen.<br />\nJosenli S. Ames.<br />\nWilljam H. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn. J. Abel.<br />\nJohn J. Abel.<br />\nHilliatn Oster.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nII istory,7<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAmerican Journal of Mathematies.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $1 per volume.<br />\nIL American Cltemleal Journal.<br />\nI. It EMSEN, Editor. Monthly. 8vo. Volume XXVI<br />\nin progress. $1 per 01U111l..<br />\nHI. American Journal of Philology. •<br />\nIi. L. GiLDERgLEE'V P., Editor. Quarterly. two.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studio* from the 11101,.gical Laboratory. livo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historleal and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining' reports of seientine and literary work<br />\nIn progress in Beltimore. 4th. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital llulletin. Monthly. 4th.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4th. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Reitrage zur Assyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXL Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4th. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. 131-monthly. 8vo. :Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4th., t5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM Il. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. 'Volume VI in progress. $1110 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Tresteem, reviewing the operations of the University<br />\n(luring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nGroups.<br />\n1. Claasical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\nGoading up to Engineering.)<br />\n3. (7heminal-Itiological.<br />\n(leading up to Medicine.)<br />\n4. Geoloeical-Biological.<br />\n5, Latin Mathematical.<br />\n6. Iliatorical-Political.<br />\n(leading up to Law.)<br />\n7. ModertiLanguages.<br />\nSerial Publications.<br />\nEditors.<br />\nFrank Morley.<br />\nMathematics(vol. X XIV.)<br />\nIra Bemsen.<br />\nChemistry (vol. XXVI).<br />\nBasil L. Gildersleeve.<br />\n'Philmogc (vol. XXII.)<br />\nJ. M. Vincent<br />\n11liatory vol. XIX.)<br />\nA. Marshall<br />\nTrt,ndern .anguagos(vol. XVI.)<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAss% riology (vol. IV.)<br />\niN.:xperimental Medicine (vol. VI.) W. H. Welch.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on applioation.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.001<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 410. 1.0 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Dated by J. Itendel Harris. 110 pp. 410. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac, MRS. with Antilegomena Epistles. Edited by 1. H. Hall. $3.00.<br />\nBibliographia Flopkinsiensis. Part I. Philology. Parts<br />\n11-111. Chemistry, Mineralogy and Geology. Parts<br />\nV-V- V 1.Physics, Astronomy and Mathematics.<br />\n8 vo. 80 cents per part.<br />\nS full Ilst of publications will be sent on application.<br />\n<br />\nProgrammes of the Courses offered to graduate ((tridents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nCommunications In respect to exchanges and remittanceS<br />\nmeg be sent to Johns Hopkins Press, Baltimore. Md.<br />\n<br />\n\fChristmas Iltimber.<br />\n<br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nDECEMBER 18, 1901.<br />\n<br />\nNo. 6.<br />\n<br />\nMY COLLEGE DAYS,<br />\nFTER several years participation in lacrosse, baseball, football, and<br />\ncollege athletics in general, I can say without the slightest hesitation<br />\nthat I consider lacrosse the most fascinating game played, both from<br />\nthe standpoint of the player, and from that of the spectator. The Indians, who<br />\nwere the originators of this game, displayed unwonted sagacity in inventing a<br />\nform of exercise which tends to develop all the qualities of the perfect athlete,—<br />\nmuscular prowess, speed, agility, dexterity, and together with these physical at<br />\ntributes, quick mental perception as well. The charm for the individual player<br />\nis far in excess of that afforded by either baseball or football, because of the continual excitement and uncertainty under which the player labors in never knowing where the next play is going to be. There is far more scientific individual<br />\nplay in lacrosse than in any other usual collegiate game, and it eliminates to a<br />\ngreat extent the ULTRA dangerous element of football. Perhaps I am a trifle<br />\nprejudiced in its favor, but I repeat that I consider it the very best form of exercise. All this is the player's side of it; but from the spectator's point of view<br />\nI consider it the most interesting because of the open work which permits a<br />\nclose observance of the game in all its details.<br />\nThough the game is being developed at more American colleges every year,<br />\nthe one reason why it has not yet superseded baseball is because it is not an<br />\nAmerican sport. It is a Canadian game, and baseball is a native American<br />\ngame. Therefore the American colleges, like Hopkins, C. C. N. Y., Stevens,<br />\nLehigh, etc., which have always kept the lacrosse standard on a high level, will<br />\nfind it hard to induce the other colleges to adopt it at the expense of football.<br />\nStill, it has grown, and will, I think, continue to grow in popularity.<br />\nDuring my entire career at the City College of New York, I engaged in all<br />\nathletic 'sports,—baseball, football, and lacrosse; and in my graduating year<br />\nWas captain of the lacrosse team, succeeding Jack Curry, who, I believe, once<br />\ncoached Hopkins. Our team that year won the championship, and many of<br />\nOur League games were veritable \"hair-raisers.\" In our game with Lehigh we<br />\nwere defeated, and previous to that game the New York Athletic Club had<br />\nbeaten Lehigh, so, going by comparative scores, we seemed predestined to defeat<br />\nwhen our turn came to play N. Y. A. C. I remember the game perfectly as one<br />\nof the fastest and best contested I ever played, and only by the hardest kind of<br />\nwork did we succeed in scoring, thus defeating our rivals by the score of one to<br />\nnothing. It was flattering for me to note that on the All American lacrosse<br />\nteam of 1891-92, were four of my men.<br />\n44<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nSeveral times I have played against Stevens, and I must say I found them<br />\nrather rough in their style of play. My position on the lacrosse team was first<br />\ndefense.<br />\nI have met several men who have contributed largely to the success of lacrosse in Baltimore. Mr. Maddren, who, I have heard, \"made\" lacrosse at<br />\nHopkins, I met during his connection with the Crescents, and I became acquainted with the five Penniman boys in 1895, when, as a delegate to a convention at the Hopkins, I visited Baltimore for the first time.<br />\nVictor Mapes, who wrote my version of \"Don Caesar's Return\" was a Columbia man of great athletic standing, holding the American Intercollegiate<br />\nhurdle and broad jump records, His broad jump record of 22 feet 6 inches, was<br />\nonly recently broken. In 1891 Mapes was president of the American Intercollegiate Athletic Association, and I was treasurer; so it seems quite a coincidence<br />\nthat he and I should be associated now in our life work as we were in college<br />\ndays.<br />\nAfter graduating from the City College of New York I entered the New<br />\nYork School of Law. The same year I captained the Law School football team,<br />\nplaying, at different times, end and half back Incidentally I may state that, as<br />\nfar as I am aware, I was the first man to wear a rubber nose-guard on the football field. It was in a game with Fordham, where I was lined up against a<br />\nbig fellow, that I donned it for the first time. I found it extremely satisfactory,<br />\ninasmuch as I was spared the pain of a broken nose, though I must confess that<br />\nnose-guard felt awkward at first, and the astonishment created among both players and spectators was really amusing. It was in the same year, 1892, in a<br />\ngame against Rutgers that I sustained a severe injury which confined me to the<br />\nhospital for two months, and it was during this period that I finally determined<br />\nupon the stage as my life career.<br />\nCollege dramatics always proved of much interest to me, and I always entered into them with great spirit. We had a strong number of men at the C.<br />\nC. N. *Y., who showed histrionic ability, and our efforts were generally successful. Not only did we have plenty of sport getting up plays, but the real<br />\nadvantage as training for the stage was remarkable. The benefits derived from<br />\na college dramatic society are well worth any trouble necessary in organization.<br />\nBesides the college dramatic society to which I belonged, I was also a member<br />\nof nearly every amateur club in New York for five years.<br />\nIn addition to the academic training afforded by my college career, I consider the time spent there as valuable in laying a broad foundation for my life<br />\nwork, and I look back upon my college days as pleasant and well spent.''<br />\n<br />\nJAMES K. HACKETT.<br />\nTHE PERSECUTION OF MAN.<br />\n—<br />\n<br />\nt<br />\n<br />\nHE powers of Smith College have shown a remarkable amount of acuteness<br />\nand ability to understand human nature in the means they have adopted<br />\nto abate, the male nuisance at the college.<br />\nThere had existed a mutual admiration society between the good looking<br />\nyoung ladies at Smith and the good looking young men at Amherst, which re-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nsuited in the almost eternal presence of Amherst men inside the walls of the<br />\nyoung ladies' seminary, not to mention innumerable little walks, and cozy little<br />\ntheatre parties of two. Every Saturday and Sunday the halls of the Smith<br />\nhomes were \"converted into reception rooms for Amherst fellows,\" so that the<br />\nwork for Monday—and other days—was neglected, in the pursuit of social<br />\npleasures. Of course the education of young women should be on more serious<br />\nlines than these, so the faculty thought stringent laws were necessary. A set<br />\nof rules were consequently drawn up, which are destined to put an end to all<br />\nthese frivolities. All walks, talks, and those cozy little theatre parties of two<br />\nwill have to be abandoned, unless the girl is engaged to the fellow. The penalty<br />\ncertainly is severe, but as students of human nature, we very much fear that the<br />\nparties concerned will not consider it in this light. It is extremely difficult for<br />\ncertain people to realize the value of careful oversight by one's elders and<br />\nbetters.<br />\nLater notice from Massachusetts Twenty engagements of Smith girls to<br />\nAmherst men were announced this week.<br />\n<br />\nSCHOLARS AS ATHLETES.<br />\nHE prominence of athletics as a fundamental feature in college life has<br />\ngrown ste dily the last few years. Probably the most patent reason for<br />\nthis advancement, and the liberal acknowledgement of athletics by college<br />\nauthorities, is the interest taken in sports by the scholastically inclined as well<br />\nas by the so called \"athletes.\" Each year the records show a large number of<br />\nmen carrying off academic honors, and winning athletic glory at the same time.<br />\nHere at Hopkins a glance will suffice to support this statement; some of the<br />\nbest men on the football, track, and lacrosse teams are honor men, and leaders of<br />\ntheir respective classes. At Columbia, last year, the report of the dean showed<br />\nthat twenty prominent athletes were among those receiving high academic<br />\nhonors, and at all the other colleges statistics point the same way. The reason<br />\nfor this is apparent, and is powerfully stated in the famous definition of education given by Thomas Huxley.<br />\n\"That man, I think, has had a liberal education, who has been so trained<br />\nin his youth that his body is the ready servant of his will and does with ease<br />\nand pleasure all the work that, as a mechanism, it is capable of; whose intellect<br />\nis a clear, cold, logic engine, with all its parts of equal strength, and in smooth<br />\nworking order; ready, like a steam engine, to be turned to any kind of work,<br />\nand spin the gossamers as well as forge the anchors of the mind; whose mind<br />\nis stoied with a knowledge of the great and fundamental truths of nature and<br />\nof the laws of her operations; one, who no stunted ascetic, is full of life and<br />\nfire, but whose passions are trained to come to heel by a vigorous will, the<br />\nservant of a tender conscience; who has learned to love all beauty, whether of<br />\nnature or of art, to hate all vileness, and to respect others as himself.\"<br />\n<br />\ne<br />\n<br />\n\f007--<br />\n<br />\nTHE NEWS—LETTER.<br />\nWITH THE AID OF GEORGE ADE AND APOLOGIES TO<br />\nTHE AFORESAID.<br />\nNCE there was a Time when this University had not Yet been moved to<br />\nHomewood, because the last Thirty-Nine cents of an Endowment was<br />\nHard to Raise from the people of Baltimore. During this Period there<br />\nexisted In Two Classes of the University a Feeling that each one was Better<br />\nthan the Other, and it was often demonstrated that Such was the Case.<br />\nThe facts were that One of these Classes had been Hauled over the Rough<br />\nRoad of Book learning for a Year, while the other was a Young Infant, and had<br />\njust entered the Race for Knowing Things. For this reason the Former imagined<br />\nthat they were Hellers ad Libitum of the Neighborhood, and that the Other Class<br />\nshould do Fealty to Them; consequently, a spirit of Hostility Existed until Something had to be Decided. There being a Precedent that Such Feelings should be<br />\nsettled by a Football game, and in Case Some were alive after this was Over, a<br />\nCane rush should be instituted whereby the Rest might be killed without anyone<br />\nbeing Arrested for Manslaughter. These Classes decided that it was Up to Them<br />\nto do This.<br />\nWhen the Seventh Day of December, being the appointed time for the Killme quick, had arrived, the Junior Aggregate feeling that They were too much of a<br />\nSecond-to-None to be Hauled on the Baltimore Consolidated, procured the money<br />\nsomehow to Hire a Bus, or, maybe it is not Paid for yet; we don't know. It is<br />\nsaid, that the Freshmen were actuated by an Impulse to do the Same, but That<br />\nwas All. Anyhow, they all got There.<br />\nBefore any definite Steps of Procedure were taken, Both teams let their<br />\nPhisiognomies be Photographed, so that Mother might see how Brave her Boy<br />\nlooked before he was Served up to her on a Stretcher. After this they Backed<br />\nup opposite each other, and got Ready to do Biz. The Junior team felt from the<br />\nBeginning that they were to be Leading Lady during the whole Matinee, and went<br />\nat it in a King Midas sort of Way that suggested that Every time they Landed,<br />\nTouchdowns could be Seen.<br />\nBut there was One among the Other Team who had Some Nerve with him and<br />\nwas Willing to Work. The Rest of the Team felt that He would give them a<br />\nhappy Issue out of All their afflictions if he Could, and Helped him with all their<br />\nHeart. There were, on the Other hand,some ancient Aniniases among the Junior<br />\nTeam, who could identify Themselves as Handlers of the Pigskin as it Should be<br />\nHandled, and inteuded to Go Way up behind the Goal posts with the Ball and Sit<br />\ndown, when they Felt like it.<br />\nAlas, for these Gridiron Terrors! One Ham Jr. had rubbed some kind of<br />\nSalve into the oval,till it was Greasy as a Yard of Free Lunch,and had a Tendency<br />\nto play Hide and Seek with itself. The Juniors were frequently \"It.\"<br />\nDuring the first Half both Teams avoided the Goal Posts with such Precision<br />\nthat when time was Up there were no Touchdowns pinned to the Jackets of Either.<br />\nBut in the second Semi, the Juniors saw that their Reputation was at Stake, and<br />\nbegan to Pass the Pigskin up the Line at a frequent Rate, till two Touchdowns<br />\nand almost a Third was the Result of their Rushes. When the Agony was Over,<br />\n<br />\nO<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nthe Junior Ensemble could count Twelve Points for themselves, and the Freshites gave Evidence of That tired Feeling, and seemed to be Satisfied.<br />\nIn the Meantime, one of the Ancient order of Cop, with a Paunch that<br />\nHelped-to make Milwaukee-famous, had a Bad Dream, and began to do some<br />\nDuty on a Junior who had done Nothing, and said to him, Come with Me.<br />\nWhen this Ward-heeler reached the Station with his Victim, amid Shouts of<br />\nderision, which didn't seem to Phrase him, He was Told that he Bore about the<br />\nsame relation to the Force as the Appendix does to the Human Anatomy, and it<br />\nwas True. The Prisoner had now Become a Hero, and had Sympathy served up<br />\nto him in large Hunks. Maidens in the Grandstand Heaved heavy Sighs, Rolled<br />\ntheir Eyes Heavenward, and Said, Poor Mr. Bryan; isn't Thatjust Awful!<br />\nBut the Cane rush couldn't be Stopped on his Account, and the two Classes<br />\nfaced each other Desperately, with a Sigh of Regret that Such indeed was the Case.<br />\nWhen the whistle Blew, the Carnage began, and Many a Spectator's Soul<br />\nwithin him Burned to see the Exploits of those so Young. They Connected with<br />\na Crash, and many a Wretch at the Bottom of the Heap was heard to Curse unseen, and waste his Profanity on the Desert Air. Some who were so Unfortunate<br />\nas to Ring in a Little Late, leaped around on top of the Heap and Dished out<br />\nCourageous Words to their mates Below.<br />\nWhen enough Time was given for Those Underneath to be planted in Soil<br />\nand to Realize what a H— on Earth was, the whistle Blew again, to Show that<br />\nit was All over and the Ambulance Corps was in Order.<br />\nLater, it was Found that Eleven hands gripped the cane. Nine of these were<br />\nTraced to Grease Spots in the Ground,which were Analyzed and found to Contain<br />\nthe Essential Elements of Juniority. The other two were Followed to a wisp of<br />\nHair in the Soil, and found by a Reductio ad Absurdum to have Originally grown<br />\non the Pate of the Dickey bird. Now that It was Over, everybody seemed to be<br />\nHappy again, and, with the Exception of two or three Stray ears, and a Sprinkling of Teeth—which were Identified and Claimed—nobody was Hurt, and all<br />\nwere glad that Some one had Won. Happy youth who could Say that he was<br />\nthree layers Deep under the Cane, and would have had a Hand on it if —. But<br />\nthe details are Many.<br />\nThe Victors again Mounted their Haul-me-Home and Travelled down the<br />\nStreet, giving Everybody the Glad Glance, while the Vanquished were Happy to<br />\nHear themselves Praised by Female admirers, and the Dickey bird could have<br />\nHad Several feminine Hearts to Do as he Pleased with if Some overheard Snags<br />\nof Conversation were Correct.<br />\nOn the Whole no one was Sorry that he had been There. It was Suggested<br />\nthat the Absence of a Coin grabber at the gate would Account for the numerousness of Wistful Watchers present, but Anyone who brought Friends with him<br />\nwould say This was a Lie, if you accused him of It.<br />\nMoral. Freshmen—Eat Mellen's Food and grow Strong.<br />\nJuniors—Bluff them now for it is your last Chance.<br />\nSeniors—Ignore both.<br />\nL. C. M. '02.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\n--Published Fortnightly during the University Year by the Students of THE JOIINS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nDECEMBER 18, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\n<br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902•<br />\n•<br />\nROBERT S. LANIER, 1903•<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nAUBREY PEARRE, JR., 1902•<br />\n. HARRY BAETJER, 1903.<br />\n<br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n•<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PE ARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nT HAS become almost a daily occurrence to read of the vast sums of money<br />\ngiven away in this country for the purpose of endowing colleges. Only<br />\nlast week we were astonished to read of an offer, made by Andrew Carnegie, of ten million dollars for the purpose of founding a National University,<br />\nand the very same paper informed us that the total value of gifts made by Mrs.<br />\nStanford, to Leland Stanford University, amounted to twenty-five millions.<br />\nWhile we congratulate the latter University upon its good fortune, we cannot<br />\nbut feel somewhat grieved over the apparent indifference manifested by Baltimoreans toward the Johns Hopkins University. Nearly a year ago two public<br />\nspirited gentlemen of this city presented our University with a valuable tract of<br />\nland, to be used as a site for new buildings, upon the condition that an endowment fund of one million dollars be raised. As yet this money has not been<br />\nforthcoming in spite of all the efforts made by the President and Trustees of the<br />\nUniversity, to appeal to the generosity, public spirit, and patriotism of Marylanders, and especially Baltimoreans. These citizens seem utterly blind to the<br />\nfact that by aiding the University they will be advancing their own interests,<br />\nand furthering the cause of humanity and civilization. The Johns Hopkins<br />\nUniversity is to-day a source of untold wealth and honor to this city and this<br />\nstate, and yet take away the support of a few of our loyal and most devoted<br />\nsupporters—a handful of men who have given their time, talents, and money to<br />\nthe furtherance of higher education at our University—and we might as well be<br />\non the other side of the ocean for all the interest taken in us, and encouragement and aid given us by the rest of Baltimore. Truly a \"prophet is not with-<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\nout honor save in his own country,\" and the Johns Hopkins University, esteemed and respected by Europe, and most of America, is treated with indifference, and coldly refused support by Maryland.<br />\n<br />\nHE NEWS-LETTER calls special attention to the leading article in this issue,<br />\n<br />\nZ<br />\n<br />\nby the, famous American actor, Mr. James K. Hackett. During Mr.<br />\nHackett's recent visit to Baltimore, as \"Don Caesar de Bazan,\" he very<br />\nkindly consented to furnish us with a leading article relative to his college days,<br />\nand more particularly to his athletic career, while at the C. C. N. Y. This<br />\narticle, by one who has been an all-round athlete, and who has excelled in lacrosse<br />\nand football, cannot fail to interest the student body. Mr. Hackett, with his<br />\nsuperb physique, manly bearing, and frank cordiality, is one of the finest types<br />\nof the American college man; a representative of that class of college men who,<br />\nof late years, have brought themselves to the very top of the ladder in every<br />\ncalling. Moreover Mr. Hackett possesses in abundance that most admirable<br />\nquality, college spirit, for, notwithstanding the fact that he has been out of college, and deeply engrossed in his dramatic work for nearly ten years, his college days are not forgotten, and to-day he discusses with vivacity and interest<br />\nthe lacrosse and foot ball battles he fought and won ten years ago. So we take<br />\npleasure in presenting our readers with an article by him who to-day stands in<br />\nthe foremost rank of the world's actors, and who is perhaps almost as well<br />\nknown by the name of Rudolph Rassendyl as by his own name, James K.<br />\nHackett.<br />\nT LAST forensic interest at Hopkins has manifested itself to the point of<br />\nintercollegiate debates. The question has been agitated a number of<br />\ntimes but never before has it taken definite shape. Now it is highly<br />\nprobable that next spring will witness, besides our annual Junior-Senior<br />\ndebate, a debate with some university of recognized standing, perhaps the<br />\nUniversity of South Carolina. There is every reason in the world why Hopkins should indulge in these debating contests, just as all other colleges do;<br />\nbut at the same time it is equally important that the adversary we choose<br />\nshould be a first-class college or university—a foe, in every sense, worthy of<br />\nour steel. Our failure in the past to arouse sufficient interest among the student<br />\nbody to enable us to participate in intercollegiate debates, has been the cause of<br />\nsome wonder and comment among other colleges. This year our undergraduate<br />\ndepartment has evinced a desire to inaugurate the plan. It is an excellent idea,<br />\nand should receive the hearty support of both faculty and students. Hopkins<br />\ncertainly produces debating talent qualified to meet that of any other university. Already we have received a number of proposals to debate for colleges<br />\nand universities, north and south, and it only remains for us to use discrimination in choosing an antagonist.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n8<br />\n<br />\nHE NEWS-LETTICR submits to its readers the following letter, and asks for<br />\nan expression of opinion upon the subject. The writer appears to be<br />\njustified in his objection to \"piling up,\" and though we have not considered the matter deeply, we think his suggestion good.<br />\n<br />\nt<br />\n<br />\nTo THE NEWS-LETTER.<br />\n<br />\nMR. EDITOR:<br />\nCan you suggest through the columns of your paper a substitute for our annual canerush; something by means of which future Junior and Freshman classes may be enabled<br />\nto work off their exuberant spirits. Last year, and year before last, I participated in the<br />\nrush, and this year, being a Senior, I looked on. From both observation and experience<br />\n(for both years I happened to be near the bottom of the pile) I am of the opinion that,<br />\nowing to the number of students which participate in it, the annual cane-rush is too dangerous a sport to be continued. Two years ago the president of our class had two ribs<br />\nbroken in the rush, this year the president of the Freshman class was picked up unconscious, and such injuries will frequently result when some seventy or eighty men are piled<br />\nup on one another in a writhing, struggling mass. It is absolutely necessary to have some<br />\ngeneral melee in which all members of both classes may participate, but why not substitute<br />\nsomething which will not necessitate nearly a hundred men piling upon one another, for<br />\nthose at the bottom must suffer. I would suggest ;a flag-fight which would be just as spirited, last a little longer, contain all the elements of a class \"scrap,\" and still avoid the<br />\npiling-up of an organized cane rush. What is the opinion of the student body?<br />\nA SENIOR.<br />\n<br />\nITHIN the next few weeks there will be at least one vacancy, and perhaps two or three, upon the staff of editors, and these vacancies will be<br />\nfilled from the Junior and Freshman classes. We strongly urge that<br />\nthose men desiring a place upon the paper, begin handing in specimens of their<br />\nwork at once. These should be in the form of accounts of concerts or games,<br />\noriginal matter, or any items of university news which may interest the student<br />\nbody. The Freshman class in particular we urge to exert themselves along<br />\nthis line.<br />\n<br />\nV<br />\n<br />\nTO AN OLD PHOTOGRAPH.<br />\n'Tis through a mist of years I gaze at thee,<br />\nSweet vision of the days that are no more,<br />\nWhile mem'ries fond and fancies odd and free<br />\nBreathe softly from the old times' golden shore.<br />\nI seem to hear thy voice so sweet and true,<br />\nTo feel the tender pressure of thy hands,<br />\nAnd see the lovelight in those -eyes of blue<br />\nThat speak of azure skies in far-off lands.<br />\nOhl heart of hearts, would that thou now were here<br />\nTo cast thy spell of love o'er ev'ry fear,<br />\nTo guide my soul from earth's dark, dreary way,<br />\nFrom sorrow's night to hope's bright dawning day.<br />\nR. F. C., '02.<br />\n<br />\n\f9<br />\n<br />\nTHE NEWS—LETTER'<br />\nW111111111111111u1111111111111111111111111111111111111111111111111111M1111111111M111111111111111111111,1111%11111111111111111111111111111111111111111111111110111111tgalll<br />\n2 •;•<br />\n<br />\n.•:.<br />\n<br />\na<br />\n<br />\n1:1<br />\nsr,••<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n14111i111111111111111111111111011111111111V111111111111111111111111111V1111111111111111111111111111111111111111111111111111fIN11111110111111111111111111111111111111111111!M1';;IiEIGgA<br />\n<br />\nR.<br />\n<br />\nElgin R. L. Gould, Ph. D. of the University in 1886, has been placed on<br />\nthe slate for City Chamberlain of New York under the Low administration. Dr. Gould has done fine work for Low in his two campaigns; in<br />\nthe recent one he was treasurer of the Committee on Finance, and collected over<br />\n$160,000 for the campaign fund. Dr. Gould is independent in politics.<br />\nDr. George B. Shattuck, of the geological department, is president of the<br />\nnewly organized Field Foray Club, the purpose of which is the study of the<br />\nnatural and geological history of Maryland and adjoining regions. The 341<br />\nmembers of the club are mostly public school teachers taking the University extension lectures at the Hopkins.<br />\nFriday night, December 20, Dr. W. H. Tolman, director of the New York<br />\nMuseum of Social Economy, will deliver a lecture in McCoy Hall on \"Social<br />\nand Industrial Betterment,\" under the auspices of the Woman's Club of Roland<br />\nPark.<br />\nDr. Remsen has been invited to make the leading address at the laying of<br />\nthe corner stones of the two new buildings now being erected at Caylor University, Waco, Texas.<br />\nIra Remsen, '97, Dr. Remsen's elder son, has made a hit in Paris by a portrait of the Marquis Ito, of Japan, who was recently published in the \"Monde<br />\nillusive.\" The Marquis considered the likeness so excellent that he wrote a<br />\nJapanese poem to accompany it,besides signing the portrait in English, Chinese,<br />\nand Japanese characters. Mr. Remsen has lately returned to Paris, to resume<br />\nhis art work there, from a year's service in the U. S. A. in the Philippines.<br />\nDr. J. H. Hollander was in Boston on the .2th and 13th, for the purpose of<br />\naddressing the National Civil Service Reform League on the subject of \"Insular<br />\nCivil Service.\" He was much missed by his undergraduate class in Economics.<br />\nDr. D. C. Gilman has been re-elected President of the Civil Service Reform<br />\nLeague in New York.<br />\nAt the annual banquet of the New England Alumni Association, held in<br />\nBoston last Saturday night, there were present from the University President<br />\nRemsen, Ex-President Gilman, and Dr. J. H. Hollander.<br />\nElliott Strouse, '02, has left the University and has gone to Indiana, to<br />\nrecuperate from an attack of sickness.<br />\nEben C. Hill, '02, is recovering from a severe attack of pleurisy and typhoid<br />\nfever. He is at present free from the fever, but is left very weak by it, and will<br />\nnot be out for a month.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nMUSICAL CLUBS.<br />\n<br />\nDN December 13 the annual concert of the Musical Clubs, at Hannah Moore<br />\nAcademy, took place. The only appearances preceding this had been at<br />\nthe Hospital, November 30, and at St. Mary's Parish, Roland Park, on<br />\nDecember 6th, so that the occasion was, as always, very enjoyable. The feature of the evening was the soloists and the duet: T. K. Gillman, of the Medical School, bass solos; S. T. Mason, '02. humorous bass solos; W. B. Carver,<br />\nG., tenor solos; and a vaudeville duet by C. S. Hodges, '98, and S. T. Mason,<br />\nwhich was the hit of the evening, successfully \"rough-housing\" the audience.<br />\nAll the clubs showed up well, especially the Banjo club; and with some hard<br />\nwork, the performance on the Christmas trip ought to be creditable.<br />\nAfter the concert a sumptuous feed was demolished, and then the reception<br />\nbegan. Although said one hour, it seemed scarcely ten minutes before the sad<br />\nnews came that the car was waiting.<br />\n<br />\nO<br />\n<br />\nFor the Christmas trip, the Clubs have adopted the following schedule:<br />\nCharlestown, Thursday, December 26; Winchester, Va., Friday; Hagerstown,<br />\nSaturday. The start will be made at 7.20 A. M. Thursday, on a special car of<br />\nthe B. & 0. R. R. Returning, the Clubs will leave Hagerstown by the Western Maryland R. R., at 4 P. M., Sunday, December 29. The Charlestonians<br />\nhave already arranged to give the Clubs a dance after their concert, and entertainment is expected at the other places named,<br />\nThe line-up on the trip will probably be as follows:<br />\nGLEB CLUB: First tenors, Eyster, Carver, Humrichouse, and Cowles; sec_<br />\ntenors,<br />\nNelson, Stubbs, Wright, Stall, Beasley; first basses, Eager (leader),<br />\nond<br />\nFord, Thomas, Myers, Snowden, Bryan; second basses, Gillman, Nelson, Marshall, Dochez (leader).<br />\nMANDOLIN CLUB: Mandolins, Snowden (leader), Cross, England, Bryan,<br />\nDochez, Marshall, James; violins, Nelson, Lanier; guitars, Smith, Carver,<br />\nMartin, and Hazlehurst; traps, Mason.<br />\nBANJO CLUB: Banjorines, Marshall (leader), Smith, Lanier, Hendry.<br />\nMason, Snowden, Briscoe; banjos, Bryan and Baetjer; bass banjo, Eager;<br />\nguitars, James, Mason, Converse, Hazlehurst; violin, Nelson.<br />\nDuring the illness of Manager E. C. Hill, '02, the acting manager is R. C.<br />\nPagon, '03.<br />\nTHE DEBATING TEAMS.<br />\nHE annual inter-class debate for which the seniors and juniors are beginning to prepare, promises to be of unusual interest. Both bodies contain<br />\ndebaters of no little ability, and, whatever the question, the arguments<br />\nshould be exceptionally good. Those men who have entered their names as<br />\ncandidates for the senior and junior teams are:<br />\nSeniors—Harvey B. Stone, Charles Ma/ken, John G. Campbell, Ross M.<br />\nDiggs, J. R. Pels, B. Swayne Putts, Guggenheimer, Murphy, McGlone, Wolman, Kirk, Strouse and Myers.<br />\n<br />\nZ<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nJuniors—Harry K. Tootle, Sol Blum, Harry W. Plaggemeyer, W. Sellman<br />\nBird, Hoffman, Stubenrauch, Custis, Winternitz, Glocker, Strayer, Combs,<br />\nSparrow, Addison, Adler, Dochez and Meeks.<br />\nThe general topic of the debate will be \"Trusts,\" and at each meeting of<br />\nthe Senate and of the House of Representatives, some phase of the question will<br />\nhe discussed. In this manner the subject will be presented from every possible<br />\npoint of view, and the arguments in the final debate certainly should not be<br />\nlacking either in quantity or in quality. The freshmen are busily preparing for<br />\ntheir oratorical contest. Those men who are trying for positions are Austrian,<br />\nBranham, Buckler, Cator, Dickey, Emig, Kinnane, Louis, Opie, Rosenheim,<br />\nWallis, Humrichhouse, Branch, Gutman, Cohen, Geiger, Lloyd, McGlone,<br />\nStrobar.<br />\n<br />\nAMONG THE COLLEGES.<br />\nALE cleared $70,000 on her foot ball season.<br />\n<br />\nP<br />\n<br />\nMr. Richard Sheldon whose work on Yale's track team, of which he was<br />\ncaptain, has given him fame all over this country, has been compelled, through<br />\nsickness, to retire from college.<br />\nIn addition to general dramatic productions, both Yale and Harvard have<br />\ntwo or three plays a year in French and German by students in these departments.<br />\nThe Yale Musical Clubs this year number about 65 men. The clubs have<br />\nso far had a successful season, both from the musical and financial points of<br />\nview.<br />\nA new and excellent regulation at I,eland Stanford University limits the<br />\nnumber of women students to 500.<br />\nOf 11,000 living graduates of Yale, 9000 were present at the recent Bi-centennial, representing classes from 1850 to 1901. This is the same spirit which<br />\nprompted about fifty Hopkins men to brave the rain and wind in order to witness a championship foot ball game!<br />\nThe New York Tribune gives the following selection for an All-American<br />\nfootball team: Center, Holt, of Yale; guards, Warner, of Cornell, and Barnard,<br />\nof Harvard; tackles, Cutts, of Harvard, and Bunker, of West Point; ends,<br />\nHenry, of Princeton, and Davis, of Princeton; quarter-back, Daly of West<br />\nPoint; half-backs, Weekes, of Columbia, and Kernan, of Harvard; full back,<br />\nGraydon, of Harvard. This gives Harvard four men, Yale one, Princeton two,<br />\nWest Point two, Cornell one, and Columbia one.<br />\n<br />\nSCENE: Grammar school. Dialogue between teacher and Johnnie.<br />\nTEACHER—\"What is the future of he drinks.\"<br />\nJOHNNIE---\"He is drunk.\"—Ex.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHONORS FOR HOPKINS ATHLETES.<br />\nHE Johns Hopkins Athletic Association has awarded the honorary athletic<br />\n\"H\" to the following men, all of whom participated in championship<br />\nfootball games: Messrs. Gillespie, captain; P. Hill, Garwood, Yearley,<br />\nCampbell, Bacon, Houghton, Bernheim, Sayler, Faris, Blanck, and Sharretts.<br />\nThe honorary \"H. A. A.,\" which is given to those who have materially aided<br />\nthe team, but have not participated in championship games, were given to<br />\nMessrs. H. B. Stone, H. P. Straus, Plaggemeyer, Whipple and Youtz.<br />\n<br />\nt<br />\n<br />\nLACROSSE OUTLOOK.<br />\nOW that the football season is over, the men -left from last year's team<br />\nand the \"young hopefuls,\" who are to become members of this year's<br />\nlacrosse team, are coming out for practice in stick work and running.<br />\nThe formation of the three cornered league with Hopkins, Lehigh, and Swarthmore as its members urges the men on all the more, and the outlook is rather<br />\ncheerful.<br />\nAmong the old men who remain are Abercrombie, our star center; Captain<br />\nSchmeisser who can be relied upon to do his best at point; H. P. Straus whose<br />\nexperience were the most valuable in assisting the new men to learn how to<br />\nplay the game; Bertram Bernheim will again have opportunity to show how he<br />\nP. Bernheim and Abercrombie can perfect their<br />\nand Putts can shout goals;<br />\nmidfield play; Ernest Schmeisser will show marked development, and together<br />\nwith Tough will give their opponents a lively tussle—these men are the two<br />\nyoungest members of the team, but the showing made by them last year was<br />\nmost creditable and would have done justice to old men.<br />\nAmong the men who have had some experience and who are trying hard<br />\nfrom the team, are: Frank Iglehart, J. G. Custis. J. W. Bryan, Horace Gillespie, Fred. Blanck, W. S. Bird and H. B. Stone.<br />\nDuring the Christmas holidays, light work will be indulged in. After the<br />\nmen are again settled down to work, regular practice, four times a week, will<br />\nbegin, and when spring time comes daily out of door practice will be held.<br />\n<br />\nT.<br />\n<br />\nE.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nMR. DOOLEY VISITS THE BAZAR.<br />\n<br />\n41:0HERE<br />\n<br />\nWith apologies to F. P. Dunne.<br />\n<br />\nhave ye bin th' last week?,\" asked Mr. Hennessy, through a<br />\na cloud of foam.<br />\n\"I wint to our naytional capitol,\" answered Mr. Dooley, ''to confer about th: liquor-licence law with my frind Roosenfelt who, f'r all his German Jew name, is a good American. I had a gr-rand time comin' home, Hinnissy.\" Mr. Dooley indulged in several moments of inward reminesence.<br />\n\"What was that?,\" asked Mr. Hennessy finally and with impatience.<br />\n\"It was at th' Confederit Bazaar in Baltimore, th' town where th' Irish<br />\nelemint stharted th' civil war-r be hur-rling bricks an' roohn' mayterials upon<br />\nth' cursed invader fr'm th' Nor-rth.''<br />\n\"Baltimore!,\" exclaimed Mr. Hennessy, \"an' how did ye git there?'<br />\n\"I fell off th' rear car 'o th' exhileratin' B. & 0. express,\" explained Mr.<br />\nDooley apologetically, \"an was picked up be a switchman.\"<br />\n\"Where am I at?,\" I shrieked, afther wakin' up.<br />\n\"Baltimore,\" he says. Gracious heavins, thinks I, an' Noo York on'y a<br />\n<br />\n4<br />\n<br />\nhundred an' ninety miles away.<br />\n\"Whin does th' nixt thrain leave?,\" I demanded iv him.<br />\n\"In six hours,\" he says. \"Two thrains daily.\" Well, there I was, whin<br />\nI bethought me iv me couzin, Bridgit Callahan,—a descindint iv wan iv th'<br />\nsivin hundher Kings iv Ireland, but forced be penury an want to take in<br />\nwaashin'. So I wint to pay me rayspicts an' met her on th' dure-sthop, outwar-rd bound.\"<br />\n\"Why, cousin Dooley,\" she says, \"you're jist in time. I'm goin to th'<br />\nConfederit Bazaar.\"<br />\n\"Th' whaat?,\" I asks.<br />\n\"'Tis a fair,\" she says, ''f'r erectin a monimint to a noble, but a lost<br />\ncause,\" she says, \"I suppose ye have some money with ye.\"<br />\n\"It's a losin' game, thin?,\" says I.<br />\n\"'Tis charity,\" she says.<br />\n\"I'll go,\" says I, with faith an' hope, but me pocket book sank.<br />\nAn we wint. 'Twas a gr-rand sight. The noble hall was lined with<br />\nthirteen booths, stands, bars, or what ye will. 'Tis an unlucky number, I<br />\nthought, as I felt me loose change shrink instinctively fr'm me graasp. A<br />\nluvely creature come thrippin' up to me, an says:<br />\n\"Don't ye waant to buy some cigareets?\"<br />\n\"I have no vices,\" I replys with some dignity.<br />\n\"Too bad,\" she fhips back, oglin' me with wan eye. Hinnissy, I sighed.<br />\n\"Go hack home, pretty wan,\" says I, takin' a pack. I gave thim to a small<br />\nboy nixt me an' told him to make himsilf sick all to wanct, an' th' sooner th'<br />\nbetther, f'r th' glory iv young America.\"<br />\n\"Ye were encouragin' vice,\" remarked Mr. Hennessy severely.<br />\n'Not so, Hinnissy, I beleeve with Maxim in increasin' th' velocity iv th'<br />\nprojayctil. Mr. Hennessy looked unconvinced, but Mr. Dooley continued.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n\"We begun to wandher around through a crowd that thick I cud feel me<br />\nclothes wearin' out. On a tandim formation, an eldherly gint iv my build an'<br />\nmesilf gained tin yards through a stout lady with a pink cockatoo on her bunnet, an' reached th' nearest booth, filled to th' top, I' ye mind, with th' elegant<br />\nknick-knacks an' ge-gaws iv a wumman's life.<br />\n\"Bridgit,\" says I to me couzin who had taken advantage iv th' interferance, \"how do ye like this shoe-bag. 'Tis ividintly th' creavtion iv dilicit<br />\nfingers an' irresistibly artistic tastes.\"<br />\n\"'Tis not f'r th' likes iv me,\" says Bridgit, discouraged be th' high ar-rt<br />\nin th' pur-rple vilets upon a green background.\" I am that tired whin night<br />\ncomes I lave me shoes on th' flure.\"<br />\n\"Well, thin,\" says I, \"let me get you this box f'r containing th' superfluities iv' th' toilet table.\"<br />\n\"I have none,\" says Bridgit, gettin' rattled with th' noise an' th' elegance.<br />\n\"We must find somethin equally useful, but iv a different nature,\" says I,<br />\nspakin' thick to impress th' uncompromisin' lady who kipt an unwaverin' eye<br />\nupon our ivry motion, \"how wud those handkerchers do?\"<br />\n\"Them's doilies,\" murmured th' lady in a tone which intimated that no<br />\ngintleman wud refer to sich a thing. Sarves ye r-right, Dooley, thinks I to<br />\nmesilf, for foolin' with dhry goods an notions. I had begun to feel oppressed<br />\nan to perspire visibly whin me eye lit on wan iv th' fifty sivin varieties, tucked<br />\naway between a woolen baby-jacket an' a piller cushin. I've seed th' advertisemint in th' throlloy cars; it has often inspired me with an appitite f'r me<br />\nhomely meal, but niver befure did I wilcome it with sich delight. I looked at<br />\nBridgit, she nodded, an' I bought th' thing, an' put it in me pockit where it<br />\nafterwards broke. The nixt booth had a sign which says \"Rayfreshmints,\"<br />\nan' we stepped up.<br />\n\"Is this the fr-ree lunch counter?,\" I asks, very rayspictful, iv th' nearest<br />\nbooth-tender.<br />\n\"I dunno what ye mane,\" she says, \"but we have ice cream, cake, an'<br />\nliminade.\"<br />\n\"Have ye any beer an' Sweitzer sandwiches?,\" says I.<br />\n\"Wud ye like to take a chance on a keg?,\" she says.<br />\n\"If its a small keg,\" I says modistly, \"a man can but do his best.\" With<br />\nthat I took a few chances an' left. I niver got it. We had no more than gotten<br />\nawaay, whin a gur rl heavily disguised as a gypsey ask me if I wanted me forchune told. That rayminds me, thinks I to mesilf, removin' me dimind shirtstud an' fondlin me waatch-charm. I had not been on th' Midway f'r nowthin,<br />\nHinnissy,—I had not.<br />\n\"Madame,\" I says, \"wait till I'm lavin' an' twil not take ye so long.\"<br />\nI seed wan poore man standin on a box. He hilt in th' r-right hand wan<br />\nof thim pound-caakes which mither used to make—ye know thim, they weigh<br />\na ton wanst inside—in th' lift hand he flourished a box iv caygars which had<br />\ntur-rned green fr'm shaame.\"<br />\n\"Come up, come up,\" he says, \"an' take a chanct. I've niver tasted it,<br />\nbut I know it's good,\" he says, on'y five cints f'r a risk on both,an' a gr- reat<br />\nrisk f'r th' money.\" Ye old hypocrite, thinks I, with yor wife lookin' at ye<br />\ntoo, Thin I thought iv you, Hinnissy; an' I calls out to him: \"Can ye raffle<br />\nthe caygars separit?\" Ye shud ha' seed his wife's face. I was that mor-rtified,<br />\nI left.<br />\nI heard some man raisin' hell at th' uppher ind iv th' hall, so I gr-ripped<br />\nBridgit be th' hand an' led th' way. There was a large silver bowl exposed to<br />\nview with a chain an' padlock around it, an' a man was yellin' like maad that<br />\nhe on'y had tin chanctes lift at fifty cints par.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\n\"I niver gamble,\" says I nonchalaantly to Bridgit.<br />\n\"Aint it a beauty,\" she says. I lost me head, thin. Hinnissy, an' did a<br />\nfoolish thing. I r-rushed up to th' man, lavin' B5idgit with a frind iv hers,<br />\nan' I flung him a five spot an' took th' tickets. Every wan crowded up, an' he<br />\ntur-rned th' wheel.<br />\n\"Fower hundher an' nine,\" he calls out.<br />\n\"I have it,\" srys I, an I had. He looked a me a minit, thin he looked at<br />\nth' wheel.<br />\n\"There's some mistake; th' wheel slipped,\" he says, \"it must be done<br />\nover, but in ordher to be more than fair,\" he says, \"I must insist that ye kape<br />\nyer chances on th' nixt tur-rn.,\" he says. I was jist decidin' where to soak<br />\nhim, whin th' band sthruck up a lively tune, somethin' between an Irish jig an<br />\n\"God saave th' Queen.\" Ivry wan clapped, an a man at me elbow says ''It's<br />\nDixie. Hooroo!,\" he says.<br />\n\"What did ye saay its name was?,\" I asks in me innocence.\"<br />\n\"Hinnis5y, I've been bur rt before, an ye know I'm a br-rave man, as men<br />\ngo, but whin I hit th' pavimint this time, I didn't want to go back. There<br />\nmust have been a hundher iv thim. A guardian iv th' public weal propped me<br />\ntip agin a laamp post an', says he, shakin' his head: \"Ye shud not have done<br />\nit, ye shud not have done it,\" he says, \"This is the sunny south,\" he says,<br />\n\"faamed f'r its hospitality,\" he says.<br />\n\"Thin let me git in th' sooty shade iv Chicago,\" says I, feelin' f'r me time<br />\ntable an' me life-insurance policy.<br />\n\"Ye need somethin' to stiffen ye up a bit fur rst,\" says he, ladin' me to a<br />\nI wint in. I cud not see th' barkeep, but I<br />\nsaloon fominst th'<br />\nfelt f'r him.<br />\n\"Ar-re ye a sunny southerner?,\" I whispers whin I got him.<br />\n\"Do I look like it,\" he says, \"me name is McCarty.\"<br />\n\"Say no more,\" says I, \"but git th' box an we'll shaake f'r th' dhrink.\"<br />\nMr. Dooley fell to towelling the bar. After some silence, Mr. Hennessy remarked:<br />\n\"I thought ye said ye had a gr-rand time at th' bazaar?\"<br />\n\"I did,\" said Mr. Dooley, \"across th' street.\"<br />\n<br />\nSANTA CLAUS HEARS FROM A FRESHMAN.<br />\nEVERAL days ago the NEWS-LETTER was fortunate enough to get hold<br />\nof one of the letters which the freshmen are now sending to Santa Claus.<br />\nWe feel sure that its contents will interest most of our readers.<br />\n<br />\np<br />\n<br />\nDEAR SANTA CLAUS:<br />\nI have almost reached the age when boys stop writing you a list of their<br />\nwants, but there are several things I want particular bad this Christmas, and<br />\nI'm going to write to you once more. Since this time last year I've been through<br />\nsome fearful trials and hardships. I worked hard all the spring and managed<br />\nto pass enough examinations to get in the Johns Hopkins University. I<br />\nthought it was grand. You know it makes you feel fine to go to Hopkins.<br />\n(There are a crowd of fellows there, though, who haven't the first rudiments of<br />\ncommon politeness, and instead of welcoming me in a hospitable manner, they<br />\ntreated me like a little yellow dog.)<br />\nI went down there to study, and didn't propose to stand for any roughhouse, but they made me take off my hat,—sometimes my shoes, pushed me<br />\nhead first out of the elevator, forced me to buy chocolate at the slot ma-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n16<br />\n<br />\nchine, and insisted upon making me do the hoola-hoola dance on the trophyroom table. Now you know that wasn't fair. It wasn't wright.<br />\nUpon entering the university, I considered myself a man, and felt that I<br />\nought to shave; so I bought a mug and put it in the barber shop. The nasty,<br />\nmean things took it, and a few days afterward, made me stand on the lockers<br />\nunder the gymnasium, lather one of my fellow classmen out of my own mug,<br />\nand shave him with the butt end of a golf stick. Then he shaved me the same<br />\nway. I was so angry I most cried. But what could I do with the horrid<br />\ncreatures jeering at me and telling me not to whimper?<br />\nThese are only a few of the mean tricks, hut I think they are enough to<br />\nmake you pity me and put what I want in my stocking.<br />\nI am awful anxious to wear a black and blue jersey, hut haven't dared to<br />\ndo it yet; for I saw the juniors jerk one off a fellow's back so fast that I thought<br />\nhis arms would come too. After Christmas, though, I think they will let us<br />\nwear them, so please bring me one. I wear boy's size, No. 22.<br />\nI really think I am big enough to begin smoking, but hardly know whether<br />\nit would be healthy for me or not. You might bring me a pipe and I'll wait a<br />\nfew weeks before using it. I also want a cow bell for Christmas. Next year I<br />\nam going to ask you to bring me a cane. Please bring me these, Santa Claus.<br />\nI haven't had a very good time since September.<br />\nA FRESHMAN.<br />\nThe unfortunate freshman who wrote the above can hardly be blamed for<br />\nsaying that the treatment received at the hands of the juniors was not \"wright.\"<br />\nHe has evidently been one of the marks.<br />\nWe are glad to know that he is \"awful anxious\" to wear a black and blue<br />\njersey, and hope he will not be molested after Christmas for so doing.<br />\nLet him take hope in the thought that better times are coming.<br />\nY. M. C. A. NOTES.<br />\n<br />\nZ<br />\n<br />\nHE monthly meeting of the Executive Council was held Wednesday,<br />\nDecember 11, at 5 P. M.<br />\n<br />\nThe report of the Bible Study committee for November showed an average<br />\nweekly attendance of 30 for the Bible classes.<br />\nThe membership report showed a total membership of 231.<br />\nMr. Robert E. Speer, of New York, will speak on Sunday, January 19, at<br />\n4.30 P. M.<br />\nLevering Hall Chapel was filled to its utmost on Tuesday, December 3,<br />\nwhen those present heard an inspiring address by Rev. S. Bates Cadman, D,D.,<br />\nof Brooklyn, on \"Faith.\"<br />\nThe men of the University owe it to themselves to come out to hear the<br />\nprominent speakers whom from time to time address the Association.<br />\nTHEATRICAL GUIDE.<br />\nNASMUCH as the present week has been set apart by the University<br />\nauthorities for examinations, it is. necessary that the students should<br />\nindulge in some form of mental relaxation in the evenings. With this end<br />\nin view, the NEWS-LETTER publishes the following theatrical guide for the<br />\ncurrent week:<br />\nFord's—Mrs. Carter in \"Dew-Berry.\" Mrs. Carter's sweet, domestic play,<br />\n\"Zaza,\" is fresh in the memory of University students.<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n17<br />\n<br />\nAcademy—The King's Carnivora—First class \"Bridge\" show.<br />\nHolliday St.—Select tragedy for the aesthetic. Material for the Dean's<br />\nEssay.<br />\nAuditorium—White Rats Company. This cozy, home-like resort proves<br />\nparticularly attractive to Hopkins students. The sweet pastoral plays point<br />\ntheir own moral, and leave good impression upon the mind of verdant youth<br />\n(particularly Freshmen).<br />\nN. B. As we do no free advertising in our columns, we cannot give information regarding the Palm Garden. For further information send stamped<br />\nand self addressed envelope to any of the editors.<br />\nCentral—This \"home of the muses\" receives so much patronage from all<br />\nstudents who possess a love for the artistic side of nature, that comment is<br />\nunnecessary. It fills a position in Baltimore parallel to the Corcoran Gallery in<br />\nWashington. We append a few rules of the house:<br />\n1. You are requested to patronize our polite attendants. 2. You are requested to report to the bouncer any inattention on the part of the ushers. The<br />\nbouncer will see that you are promptly attended to. 3. Don't throw our glassware on the floor after you have finished examining its interior. It costs<br />\nmoney. 4. Leave your valuables at the ticket office before entering. The<br />\nhouse needs the money. 5. Refrain from making remarks about the actors or<br />\nactresses while the show is going on. Don't interrupt the soubrette while she<br />\nsings.<br />\n<br />\nCzar of Russia now has four daughters.\"<br />\nt<br />\n44HE<br />\n\"Oh, the dear little Czardines.\"—Ex.<br />\n\"PROFESSOR, do you expel students often?\"<br />\n\"No, only once.\"—Ex.<br />\nSome Glaring \"Jokes\" from The Harvard Lamfioon.<br />\n\"And what have your bills come to thus far?\"<br />\n\"Chiefly to ashes, father.\"<br />\nMRS. RUSHER (mother of J Rusher, '01)—Yes, Mrs. Jones, I feel perfectly at ease about Jack's college life, since I find the influence of the students<br />\non each other is so good. Why, Jack tells me that he and the rest of his class,<br />\nby a little well-directed personal effort, have already succeeded in persuading<br />\nthe freshmen to give up smoking pipes.<br />\n<br />\n\fApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\nNTCD1<br />\n<br />\nLJ<br />\n<br />\n13I.<br />\n<br />\nNICD 0 0FR•<br />\n<br />\n.<br />\n<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br />\n<br />\nCHESAPEAKE RUBBER COMPANY,<br />\n<br />\n321 W. Baltimore Street,<br />\n<br />\nE3E;t7i 6c C.=0<br />\n675 West Baltimore Street,<br />\n<br />\nNEST BALTIMORE LOAN C<br />\n<br />\nU.Between Arch and Pine Sts. Baltimore, Md.<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nOPEN FROM 7 A. M. TO S P. M.<br />\nSATURDAYS UNTIL 10 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br />\n<br />\na co.<br />\n<br />\nSMITH, DIXON<br />\n<br />\no P/AfTell<br />\n29-31 S. Charles St.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nri6t1113CS FRANKE &<br />\n<br />\nR<br />\nNELLCO<br />\n6)<br />\n1<br />\n2<br />\n,<br />\n)<br />\n,<br />\nU<br />\nN<br />\nFrail°.<br />\nHOWARD ST.<br />\n<br />\nGreeh ILetter<br />\nA. H. FETTINGI fratenutp<br />\njeweirp.<br />\nMANUFACTURER Of<br />\n<br />\n14<br />\n<br />\nAND<br />\n<br />\n16 ST. PAUL STREET,<br />\n<br />\nBALTIMORE, MD.<br />\nC CALL AND EXAMINE OUR LINE IBEFOPIE<br />\n<br />\nPUNONA•INO,<br />\n<br />\nJ. H. ROBINSON.<br />\nMA NUfACTUNUM<br />\n<br />\nFINE<br />\n<br />\nBonbons, Chocolates,<br />\n<br />\nOf<br />\n<br />\nCONFECTIONS.<br />\n<br />\n• FINE• CIGARS,.<br />\nDEMEAN<br />\n<br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br />\n<br />\nIN<br />\n<br />\nTOBACCO, CIGARS. AND SMOKERS' ARTICLES,<br />\nSTATIONERY.<br />\n026 N. EUTAW ST.<br />\nBALTIMORE,MD.<br />\n<br />\n14 EAST BALTIMORE STREET.<br />\n<br />\nBaltimore, New York & Philadelphia Papers.<br />\nC. & P. Public Telephone, Madison 11/315Y.<br />\nDesigning and Cutting by E. Michaelson.<br />\n<br />\nE. MIGI-MELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nALTERING AND REPAIRING.<br />\n<br />\n821 rladison Avenue,<br />\n<br />\nSpecial discount to Students.<br />\n<br />\nBflLTIMORE, MD.<br />\n<br />\nA. D. SMITH & SONS,<br />\nFoirnerly<br />\nLEVERING & SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children.<br />\nIn the Latest Destuns.<br />\nMEN'S HATS—Derbys and Soft Felts.<br />\n<br />\n;IP<br />\n67:2Z(W/i›.1•\"..'s'\"?,•!,••<br />\n<br />\nBALI L'Ir<br />\n!.(:01-1, L. MC CL a ie.rwrn .51.6.<br />\nN'<br />\n^‘,, mirr,,ourvrtAmr, 7,)<br />\n<br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br />\n<br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n606 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dining Rooms.<br />\nMeals Served at All Hours.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n'Phone, C. St P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\n804 UNION TRUST BUILDING,<br />\n<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\nOSTEOPATHY<br />\nIs a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARIA 111J1E, D 0,,<br />\nV.-Prost. & Asst. Soe'y.<br />\n<br />\nW.D. BOWEN, M. D., D.0.,<br />\nProst. & Mgr.<br />\nESTABLISHED 1879.<br />\n<br />\nWedding Silver rig\"<br />\nIN QPIEAT VARIETY.<br />\n<br />\n\"?,13:rC:AVET,K2T7s.Silversmiths.<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books.<br />\nStudent's SuP1314es•<br />\n<br />\nMadisonStHowardSts.<br />\n<br />\nSeely. & Truss.<br />\nJAmas R. rAINE.<br />\n<br />\nTHKO. WAHNI4.12.<br />\n<br />\n8c. CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for incoln & Bennett and<br />\nWalter Barnaro's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nrs o<br />\nanufasc<br />\nMturef<br />\nSilk and Ca simere Hats. *Ir HOPKINS CAPS<br />\n<br />\nC<br />\n<br />\nlienderson's<br />\n<br />\nH. MoMAINS,D.0.,<br />\n<br />\nelle1'8 and<br />\nUSHING & COMPANY' S13toatoiits<br />\nonees.<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law 1111.1,113•L CLASSICAL AND MISCILLLANICOUS BOOKS<br />\nKeeps constantly on hand the Text Rooks used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman & Sorlp<br />\n<br />\nII. R. E1SENBRANDT SONS,<br />\n<br />\nSTRBLEftGO. hi'Lls:1702vE.<br />\nJORDAN<br />\nReads as follows: Samples submitted of<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nfor<br />\n<br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\npure, of superior quality.<br />\nNherry-...-110 coloring or adulterants, absolutely pure wine.<br />\nItYe Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\n_ Clder Vinegar—Llama!<br />\ncider vinegar, strictly pure and<br />\nrOng.<br />\nNix Ground 'picas--no adulteration, all strictly pure.<br />\n()pont)Port—absolutely<br />\n<br />\nOR ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\n201-203 N.CHARLES ST.<br />\n<br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450,000.<br />\nCapital, $650,000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSACIE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER,<br />\nNAPLES. GENOA, eTc.<br />\nBALTIMORE'. TO BREMEN<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO<br />\n<br />\nJO JO Ja<br />\n<br />\nTAUGHT WI<br />\n<br />\nC. J. LEVIN•<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. (Thanes St.<br />\n<br />\nthe 1itran3Zniftb<br />\npiano CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nilgenirt?z cibludio<br />\n<br />\nCbichering, Erabburp anb IlIttebster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nBaltimore<br />\n<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON SALE THE I. H. U. PENNANTS,<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nand all other College Pennants<br />\n<br />\n203 W. BALTIMORE ST.& 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange,<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE dr CO.,<br />\nBANKERS & BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MI).<br />\n<br />\nThe Chas. YilIlms Surgical Instrument Company<br />\nBENJ. A. NELSON, OEN'L MANAGER<br />\n<br />\n!pianos.<br />\n<br />\n.0 4$<br />\n<br />\n0.& P.'Phone 2322-2.<br />\n<br />\nFactory Prices.<br />\n<br />\n.<br />\n\"<br />\nSMITH'S ElC311 2T TaB UV<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\n•<br />\nSTORE.<br />\n3rd door from Madison.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged ....<br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\n6os N. Eutaw Street.<br />\nA. H Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nJ. WM, MIDDENDORF & CO.<br />\nZanfters & 16rohers.<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\nBaltimore, Md.<br />\nsoo N. Howard St.,<br />\n<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nDrovers and Mechanics National Bank,<br />\n<br />\nBOOKS AND STATIONBRY<br />\n<br />\nOF BALTIMORE. MD.<br />\n<br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br />\n<br />\nYOUR EY.S<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n111 North Charles Street. (Masonic Temple.)<br />\n<br />\nKXRAINING OPTIGIPMS.<br />\nTHE NEWS LETTER<br />\nIs from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPR INTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a tu'l line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br />\n<br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\n063 /%1c-1,1r- t<br />\nrecs. 3<br />\n<br />\n•<br />\n<br />\nC.7.1-x eft x-1ez.a.<br />\n<br />\nY. M. C. A. BUILDING.<br />\nBALTIMORE, MD.<br />\nC. & P. and Md.'Phones.<br />\n<br />\nCAll ON<br />\n<br />\nJFtS. it. DOWNS,<br />\n<br />\n229 N. Charles 8t.,<br />\n''''MASPONIO TE IA PLC•<br />\nFOR. Class, Fraternity and College StationerY,<br />\nBanquet Cards, invitations, Dip ornae.<br />\nPrograms, Visiting Cards, etc. ......<br />\n<br />\nOur 60e .1. K. U. Blue and Flack Flag Paper—now readu.<br />\nThere is very little entertainment at home without a Plans<br />\n<br />\ncTIEFF<br />\nzPlAhlos<br />\n<br />\nfire The Best.<br />\n<br />\n9 N. Libertu St.<br />\n<br />\n\f", "format": "basic_html", "processed": "rIstnias NUrnber.<br />\nVol. VI. No. 6<br /><br />\nMY COLLEGE DAIS, by Jas. K. Hackett.<br />\n0<br /><br />\nDecember 18, 1901.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns1oR1n Press.<br /><br />\nBALTIMORE, MD.<br />\nT.<br /><br />\nTwenty Sixth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\n.<br />\n.<br />\n.<br />\nPresident,<br />\nDean of the Medical Scho,,i,<br />\nDean of the College.<br />\n.<br />\n.<br /><br />\nIRA REMSEN.<br />\nwm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidat a for tho degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;cours a for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of 13. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n100,00) volumes.<br />\n1:35,1010 volunws.<br />\n200.0110 \\<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological (7hemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\n(Ireek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic.<br />\nGerman,<br />\nHorns ace,<br /><br />\nDirectors.<br />\nIra Bentsen.<br />\nJosenli S. Ames.<br />\nWilljam H. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn. J. Abel.<br />\nJohn J. Abel.<br />\nHilliatn Oster.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nII istory,7<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAmerican Journal of Mathematies.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $1 per volume.<br />\nIL American Cltemleal Journal.<br />\nI. It EMSEN, Editor. Monthly. 8vo. Volume XXVI<br />\nin progress. $1 per 01U111l..<br />\nHI. American Journal of Philology. •<br />\nIi. L. GiLDERgLEE'V P., Editor. Quarterly. two.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studio* from the 11101,.gical Laboratory. livo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historleal and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining' reports of seientine and literary work<br />\nIn progress in Beltimore. 4th. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital llulletin. Monthly. 4th.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4th. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Reitrage zur Assyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXL Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4th. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. 131-monthly. 8vo. :Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4th., t5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM Il. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. 'Volume VI in progress. $1110 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Tresteem, reviewing the operations of the University<br />\n(luring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nGroups.<br />\n1. Claasical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\nGoading up to Engineering.)<br />\n3. (7heminal-Itiological.<br />\n(leading up to Medicine.)<br />\n4. Geoloeical-Biological.<br />\n5, Latin Mathematical.<br />\n6. Iliatorical-Political.<br />\n(leading up to Law.)<br />\n7. ModertiLanguages.<br />\nSerial Publications.<br />\nEditors.<br />\nFrank Morley.<br />\nMathematics(vol. X XIV.)<br />\nIra Bemsen.<br />\nChemistry (vol. XXVI).<br />\nBasil L. Gildersleeve.<br />\n'Philmogc (vol. XXII.)<br />\nJ. M. Vincent<br />\n11liatory vol. XIX.)<br />\nA. Marshall<br />\nTrt,ndern .anguagos(vol. XVI.)<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAss% riology (vol. IV.)<br />\niN.:xperimental Medicine (vol. VI.) W. H. Welch.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on applioation.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.001<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 410. 1.0 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fee-simile edition. Dated by J. Itendel Harris. 110 pp. 410. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac, MRS. with Antilegomena Epistles. Edited by 1. H. Hall. $3.00.<br />\nBibliographia Flopkinsiensis. Part I. Philology. Parts<br />\n11-111. Chemistry, Mineralogy and Geology. Parts<br />\nV-V- V 1.Physics, Astronomy and Mathematics.<br />\n8 vo. 80 cents per part.<br />\nS full Ilst of publications will be sent on application.<br /><br />\nProgrammes of the Courses offered to graduate ((tridents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nCommunications In respect to exchanges and remittanceS<br />\nmeg be sent to Johns Hopkins Press, Baltimore. Md.<br /><br />\nChristmas Iltimber.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nDECEMBER 18, 1901.<br /><br />\nNo. 6.<br /><br />\nMY COLLEGE DAYS,<br />\nFTER several years participation in lacrosse, baseball, football, and<br />\ncollege athletics in general, I can say without the slightest hesitation<br />\nthat I consider lacrosse the most fascinating game played, both from<br />\nthe standpoint of the player, and from that of the spectator. The Indians, who<br />\nwere the originators of this game, displayed unwonted sagacity in inventing a<br />\nform of exercise which tends to develop all the qualities of the perfect athlete,—<br />\nmuscular prowess, speed, agility, dexterity, and together with these physical at<br />\ntributes, quick mental perception as well. The charm for the individual player<br />\nis far in excess of that afforded by either baseball or football, because of the continual excitement and uncertainty under which the player labors in never knowing where the next play is going to be. There is far more scientific individual<br />\nplay in lacrosse than in any other usual collegiate game, and it eliminates to a<br />\ngreat extent the ULTRA dangerous element of football. Perhaps I am a trifle<br />\nprejudiced in its favor, but I repeat that I consider it the very best form of exercise. All this is the player's side of it; but from the spectator's point of view<br />\nI consider it the most interesting because of the open work which permits a<br />\nclose observance of the game in all its details.<br />\nThough the game is being developed at more American colleges every year,<br />\nthe one reason why it has not yet superseded baseball is because it is not an<br />\nAmerican sport. It is a Canadian game, and baseball is a native American<br />\ngame. Therefore the American colleges, like Hopkins, C. C. N. Y., Stevens,<br />\nLehigh, etc., which have always kept the lacrosse standard on a high level, will<br />\nfind it hard to induce the other colleges to adopt it at the expense of football.<br />\nStill, it has grown, and will, I think, continue to grow in popularity.<br />\nDuring my entire career at the City College of New York, I engaged in all<br />\nathletic 'sports,—baseball, football, and lacrosse; and in my graduating year<br />\nWas captain of the lacrosse team, succeeding Jack Curry, who, I believe, once<br />\ncoached Hopkins. Our team that year won the championship, and many of<br />\nOur League games were veritable \"hair-raisers.\" In our game with Lehigh we<br />\nwere defeated, and previous to that game the New York Athletic Club had<br />\nbeaten Lehigh, so, going by comparative scores, we seemed predestined to defeat<br />\nwhen our turn came to play N. Y. A. C. I remember the game perfectly as one<br />\nof the fastest and best contested I ever played, and only by the hardest kind of<br />\nwork did we succeed in scoring, thus defeating our rivals by the score of one to<br />\nnothing. It was flattering for me to note that on the All American lacrosse<br />\nteam of 1891-92, were four of my men.<br />\n44<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\nSeveral times I have played against Stevens, and I must say I found them<br />\nrather rough in their style of play. My position on the lacrosse team was first<br />\ndefense.<br />\nI have met several men who have contributed largely to the success of lacrosse in Baltimore. Mr. Maddren, who, I have heard, \"made\" lacrosse at<br />\nHopkins, I met during his connection with the Crescents, and I became acquainted with the five Penniman boys in 1895, when, as a delegate to a convention at the Hopkins, I visited Baltimore for the first time.<br />\nVictor Mapes, who wrote my version of \"Don Caesar's Return\" was a Columbia man of great athletic standing, holding the American Intercollegiate<br />\nhurdle and broad jump records, His broad jump record of 22 feet 6 inches, was<br />\nonly recently broken. In 1891 Mapes was president of the American Intercollegiate Athletic Association, and I was treasurer; so it seems quite a coincidence<br />\nthat he and I should be associated now in our life work as we were in college<br />\ndays.<br />\nAfter graduating from the City College of New York I entered the New<br />\nYork School of Law. The same year I captained the Law School football team,<br />\nplaying, at different times, end and half back Incidentally I may state that, as<br />\nfar as I am aware, I was the first man to wear a rubber nose-guard on the football field. It was in a game with Fordham, where I was lined up against a<br />\nbig fellow, that I donned it for the first time. I found it extremely satisfactory,<br />\ninasmuch as I was spared the pain of a broken nose, though I must confess that<br />\nnose-guard felt awkward at first, and the astonishment created among both players and spectators was really amusing. It was in the same year, 1892, in a<br />\ngame against Rutgers that I sustained a severe injury which confined me to the<br />\nhospital for two months, and it was during this period that I finally determined<br />\nupon the stage as my life career.<br />\nCollege dramatics always proved of much interest to me, and I always entered into them with great spirit. We had a strong number of men at the C.<br />\nC. N. *Y., who showed histrionic ability, and our efforts were generally successful. Not only did we have plenty of sport getting up plays, but the real<br />\nadvantage as training for the stage was remarkable. The benefits derived from<br />\na college dramatic society are well worth any trouble necessary in organization.<br />\nBesides the college dramatic society to which I belonged, I was also a member<br />\nof nearly every amateur club in New York for five years.<br />\nIn addition to the academic training afforded by my college career, I consider the time spent there as valuable in laying a broad foundation for my life<br />\nwork, and I look back upon my college days as pleasant and well spent.''<br /><br />\nJAMES K. HACKETT.<br />\nTHE PERSECUTION OF MAN.<br />\n—<br /><br />\nt<br /><br />\nHE powers of Smith College have shown a remarkable amount of acuteness<br />\nand ability to understand human nature in the means they have adopted<br />\nto abate, the male nuisance at the college.<br />\nThere had existed a mutual admiration society between the good looking<br />\nyoung ladies at Smith and the good looking young men at Amherst, which re-<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nsuited in the almost eternal presence of Amherst men inside the walls of the<br />\nyoung ladies' seminary, not to mention innumerable little walks, and cozy little<br />\ntheatre parties of two. Every Saturday and Sunday the halls of the Smith<br />\nhomes were \"converted into reception rooms for Amherst fellows,\" so that the<br />\nwork for Monday—and other days—was neglected, in the pursuit of social<br />\npleasures. Of course the education of young women should be on more serious<br />\nlines than these, so the faculty thought stringent laws were necessary. A set<br />\nof rules were consequently drawn up, which are destined to put an end to all<br />\nthese frivolities. All walks, talks, and those cozy little theatre parties of two<br />\nwill have to be abandoned, unless the girl is engaged to the fellow. The penalty<br />\ncertainly is severe, but as students of human nature, we very much fear that the<br />\nparties concerned will not consider it in this light. It is extremely difficult for<br />\ncertain people to realize the value of careful oversight by one's elders and<br />\nbetters.<br />\nLater notice from Massachusetts Twenty engagements of Smith girls to<br />\nAmherst men were announced this week.<br /><br />\nSCHOLARS AS ATHLETES.<br />\nHE prominence of athletics as a fundamental feature in college life has<br />\ngrown ste dily the last few years. Probably the most patent reason for<br />\nthis advancement, and the liberal acknowledgement of athletics by college<br />\nauthorities, is the interest taken in sports by the scholastically inclined as well<br />\nas by the so called \"athletes.\" Each year the records show a large number of<br />\nmen carrying off academic honors, and winning athletic glory at the same time.<br />\nHere at Hopkins a glance will suffice to support this statement; some of the<br />\nbest men on the football, track, and lacrosse teams are honor men, and leaders of<br />\ntheir respective classes. At Columbia, last year, the report of the dean showed<br />\nthat twenty prominent athletes were among those receiving high academic<br />\nhonors, and at all the other colleges statistics point the same way. The reason<br />\nfor this is apparent, and is powerfully stated in the famous definition of education given by Thomas Huxley.<br />\n\"That man, I think, has had a liberal education, who has been so trained<br />\nin his youth that his body is the ready servant of his will and does with ease<br />\nand pleasure all the work that, as a mechanism, it is capable of; whose intellect<br />\nis a clear, cold, logic engine, with all its parts of equal strength, and in smooth<br />\nworking order; ready, like a steam engine, to be turned to any kind of work,<br />\nand spin the gossamers as well as forge the anchors of the mind; whose mind<br />\nis stoied with a knowledge of the great and fundamental truths of nature and<br />\nof the laws of her operations; one, who no stunted ascetic, is full of life and<br />\nfire, but whose passions are trained to come to heel by a vigorous will, the<br />\nservant of a tender conscience; who has learned to love all beauty, whether of<br />\nnature or of art, to hate all vileness, and to respect others as himself.\"<br /><br />\ne<br /><br />\n007--<br /><br />\nTHE NEWS—LETTER.<br />\nWITH THE AID OF GEORGE ADE AND APOLOGIES TO<br />\nTHE AFORESAID.<br />\nNCE there was a Time when this University had not Yet been moved to<br />\nHomewood, because the last Thirty-Nine cents of an Endowment was<br />\nHard to Raise from the people of Baltimore. During this Period there<br />\nexisted In Two Classes of the University a Feeling that each one was Better<br />\nthan the Other, and it was often demonstrated that Such was the Case.<br />\nThe facts were that One of these Classes had been Hauled over the Rough<br />\nRoad of Book learning for a Year, while the other was a Young Infant, and had<br />\njust entered the Race for Knowing Things. For this reason the Former imagined<br />\nthat they were Hellers ad Libitum of the Neighborhood, and that the Other Class<br />\nshould do Fealty to Them; consequently, a spirit of Hostility Existed until Something had to be Decided. There being a Precedent that Such Feelings should be<br />\nsettled by a Football game, and in Case Some were alive after this was Over, a<br />\nCane rush should be instituted whereby the Rest might be killed without anyone<br />\nbeing Arrested for Manslaughter. These Classes decided that it was Up to Them<br />\nto do This.<br />\nWhen the Seventh Day of December, being the appointed time for the Killme quick, had arrived, the Junior Aggregate feeling that They were too much of a<br />\nSecond-to-None to be Hauled on the Baltimore Consolidated, procured the money<br />\nsomehow to Hire a Bus, or, maybe it is not Paid for yet; we don't know. It is<br />\nsaid, that the Freshmen were actuated by an Impulse to do the Same, but That<br />\nwas All. Anyhow, they all got There.<br />\nBefore any definite Steps of Procedure were taken, Both teams let their<br />\nPhisiognomies be Photographed, so that Mother might see how Brave her Boy<br />\nlooked before he was Served up to her on a Stretcher. After this they Backed<br />\nup opposite each other, and got Ready to do Biz. The Junior team felt from the<br />\nBeginning that they were to be Leading Lady during the whole Matinee, and went<br />\nat it in a King Midas sort of Way that suggested that Every time they Landed,<br />\nTouchdowns could be Seen.<br />\nBut there was One among the Other Team who had Some Nerve with him and<br />\nwas Willing to Work. The Rest of the Team felt that He would give them a<br />\nhappy Issue out of All their afflictions if he Could, and Helped him with all their<br />\nHeart. There were, on the Other hand,some ancient Aniniases among the Junior<br />\nTeam, who could identify Themselves as Handlers of the Pigskin as it Should be<br />\nHandled, and inteuded to Go Way up behind the Goal posts with the Ball and Sit<br />\ndown, when they Felt like it.<br />\nAlas, for these Gridiron Terrors! One Ham Jr. had rubbed some kind of<br />\nSalve into the oval,till it was Greasy as a Yard of Free Lunch,and had a Tendency<br />\nto play Hide and Seek with itself. The Juniors were frequently \"It.\"<br />\nDuring the first Half both Teams avoided the Goal Posts with such Precision<br />\nthat when time was Up there were no Touchdowns pinned to the Jackets of Either.<br />\nBut in the second Semi, the Juniors saw that their Reputation was at Stake, and<br />\nbegan to Pass the Pigskin up the Line at a frequent Rate, till two Touchdowns<br />\nand almost a Third was the Result of their Rushes. When the Agony was Over,<br /><br />\nO<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nthe Junior Ensemble could count Twelve Points for themselves, and the Freshites gave Evidence of That tired Feeling, and seemed to be Satisfied.<br />\nIn the Meantime, one of the Ancient order of Cop, with a Paunch that<br />\nHelped-to make Milwaukee-famous, had a Bad Dream, and began to do some<br />\nDuty on a Junior who had done Nothing, and said to him, Come with Me.<br />\nWhen this Ward-heeler reached the Station with his Victim, amid Shouts of<br />\nderision, which didn't seem to Phrase him, He was Told that he Bore about the<br />\nsame relation to the Force as the Appendix does to the Human Anatomy, and it<br />\nwas True. The Prisoner had now Become a Hero, and had Sympathy served up<br />\nto him in large Hunks. Maidens in the Grandstand Heaved heavy Sighs, Rolled<br />\ntheir Eyes Heavenward, and Said, Poor Mr. Bryan; isn't Thatjust Awful!<br />\nBut the Cane rush couldn't be Stopped on his Account, and the two Classes<br />\nfaced each other Desperately, with a Sigh of Regret that Such indeed was the Case.<br />\nWhen the whistle Blew, the Carnage began, and Many a Spectator's Soul<br />\nwithin him Burned to see the Exploits of those so Young. They Connected with<br />\na Crash, and many a Wretch at the Bottom of the Heap was heard to Curse unseen, and waste his Profanity on the Desert Air. Some who were so Unfortunate<br />\nas to Ring in a Little Late, leaped around on top of the Heap and Dished out<br />\nCourageous Words to their mates Below.<br />\nWhen enough Time was given for Those Underneath to be planted in Soil<br />\nand to Realize what a H— on Earth was, the whistle Blew again, to Show that<br />\nit was All over and the Ambulance Corps was in Order.<br />\nLater, it was Found that Eleven hands gripped the cane. Nine of these were<br />\nTraced to Grease Spots in the Ground,which were Analyzed and found to Contain<br />\nthe Essential Elements of Juniority. The other two were Followed to a wisp of<br />\nHair in the Soil, and found by a Reductio ad Absurdum to have Originally grown<br />\non the Pate of the Dickey bird. Now that It was Over, everybody seemed to be<br />\nHappy again, and, with the Exception of two or three Stray ears, and a Sprinkling of Teeth—which were Identified and Claimed—nobody was Hurt, and all<br />\nwere glad that Some one had Won. Happy youth who could Say that he was<br />\nthree layers Deep under the Cane, and would have had a Hand on it if —. But<br />\nthe details are Many.<br />\nThe Victors again Mounted their Haul-me-Home and Travelled down the<br />\nStreet, giving Everybody the Glad Glance, while the Vanquished were Happy to<br />\nHear themselves Praised by Female admirers, and the Dickey bird could have<br />\nHad Several feminine Hearts to Do as he Pleased with if Some overheard Snags<br />\nof Conversation were Correct.<br />\nOn the Whole no one was Sorry that he had been There. It was Suggested<br />\nthat the Absence of a Coin grabber at the gate would Account for the numerousness of Wistful Watchers present, but Anyone who brought Friends with him<br />\nwould say This was a Lie, if you accused him of It.<br />\nMoral. Freshmen—Eat Mellen's Food and grow Strong.<br />\nJuniors—Bluff them now for it is your last Chance.<br />\nSeniors—Ignore both.<br />\nL. C. M. '02.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\n--Published Fortnightly during the University Year by the Students of THE JOIINS<br />\nHOPKINS UNIVERSITY.<br /><br />\nDECEMBER 18, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br /><br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902•<br />\n•<br />\nROBERT S. LANIER, 1903•<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANFT, 1902.<br />\nAUBREY PEARRE, JR., 1902•<br />\n. HARRY BAETJER, 1903.<br /><br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n•<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PE ARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nT HAS become almost a daily occurrence to read of the vast sums of money<br />\ngiven away in this country for the purpose of endowing colleges. Only<br />\nlast week we were astonished to read of an offer, made by Andrew Carnegie, of ten million dollars for the purpose of founding a National University,<br />\nand the very same paper informed us that the total value of gifts made by Mrs.<br />\nStanford, to Leland Stanford University, amounted to twenty-five millions.<br />\nWhile we congratulate the latter University upon its good fortune, we cannot<br />\nbut feel somewhat grieved over the apparent indifference manifested by Baltimoreans toward the Johns Hopkins University. Nearly a year ago two public<br />\nspirited gentlemen of this city presented our University with a valuable tract of<br />\nland, to be used as a site for new buildings, upon the condition that an endowment fund of one million dollars be raised. As yet this money has not been<br />\nforthcoming in spite of all the efforts made by the President and Trustees of the<br />\nUniversity, to appeal to the generosity, public spirit, and patriotism of Marylanders, and especially Baltimoreans. These citizens seem utterly blind to the<br />\nfact that by aiding the University they will be advancing their own interests,<br />\nand furthering the cause of humanity and civilization. The Johns Hopkins<br />\nUniversity is to-day a source of untold wealth and honor to this city and this<br />\nstate, and yet take away the support of a few of our loyal and most devoted<br />\nsupporters—a handful of men who have given their time, talents, and money to<br />\nthe furtherance of higher education at our University—and we might as well be<br />\non the other side of the ocean for all the interest taken in us, and encouragement and aid given us by the rest of Baltimore. Truly a \"prophet is not with-<br /><br />\n3<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\nout honor save in his own country,\" and the Johns Hopkins University, esteemed and respected by Europe, and most of America, is treated with indifference, and coldly refused support by Maryland.<br /><br />\nHE NEWS-LETTER calls special attention to the leading article in this issue,<br /><br />\nZ<br /><br />\nby the, famous American actor, Mr. James K. Hackett. During Mr.<br />\nHackett's recent visit to Baltimore, as \"Don Caesar de Bazan,\" he very<br />\nkindly consented to furnish us with a leading article relative to his college days,<br />\nand more particularly to his athletic career, while at the C. C. N. Y. This<br />\narticle, by one who has been an all-round athlete, and who has excelled in lacrosse<br />\nand football, cannot fail to interest the student body. Mr. Hackett, with his<br />\nsuperb physique, manly bearing, and frank cordiality, is one of the finest types<br />\nof the American college man; a representative of that class of college men who,<br />\nof late years, have brought themselves to the very top of the ladder in every<br />\ncalling. Moreover Mr. Hackett possesses in abundance that most admirable<br />\nquality, college spirit, for, notwithstanding the fact that he has been out of college, and deeply engrossed in his dramatic work for nearly ten years, his college days are not forgotten, and to-day he discusses with vivacity and interest<br />\nthe lacrosse and foot ball battles he fought and won ten years ago. So we take<br />\npleasure in presenting our readers with an article by him who to-day stands in<br />\nthe foremost rank of the world's actors, and who is perhaps almost as well<br />\nknown by the name of Rudolph Rassendyl as by his own name, James K.<br />\nHackett.<br />\nT LAST forensic interest at Hopkins has manifested itself to the point of<br />\nintercollegiate debates. The question has been agitated a number of<br />\ntimes but never before has it taken definite shape. Now it is highly<br />\nprobable that next spring will witness, besides our annual Junior-Senior<br />\ndebate, a debate with some university of recognized standing, perhaps the<br />\nUniversity of South Carolina. There is every reason in the world why Hopkins should indulge in these debating contests, just as all other colleges do;<br />\nbut at the same time it is equally important that the adversary we choose<br />\nshould be a first-class college or university—a foe, in every sense, worthy of<br />\nour steel. Our failure in the past to arouse sufficient interest among the student<br />\nbody to enable us to participate in intercollegiate debates, has been the cause of<br />\nsome wonder and comment among other colleges. This year our undergraduate<br />\ndepartment has evinced a desire to inaugurate the plan. It is an excellent idea,<br />\nand should receive the hearty support of both faculty and students. Hopkins<br />\ncertainly produces debating talent qualified to meet that of any other university. Already we have received a number of proposals to debate for colleges<br />\nand universities, north and south, and it only remains for us to use discrimination in choosing an antagonist.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br /><br />\nHE NEWS-LETTICR submits to its readers the following letter, and asks for<br />\nan expression of opinion upon the subject. The writer appears to be<br />\njustified in his objection to \"piling up,\" and though we have not considered the matter deeply, we think his suggestion good.<br /><br />\nt<br /><br />\nTo THE NEWS-LETTER.<br /><br />\nMR. EDITOR:<br />\nCan you suggest through the columns of your paper a substitute for our annual canerush; something by means of which future Junior and Freshman classes may be enabled<br />\nto work off their exuberant spirits. Last year, and year before last, I participated in the<br />\nrush, and this year, being a Senior, I looked on. From both observation and experience<br />\n(for both years I happened to be near the bottom of the pile) I am of the opinion that,<br />\nowing to the number of students which participate in it, the annual cane-rush is too dangerous a sport to be continued. Two years ago the president of our class had two ribs<br />\nbroken in the rush, this year the president of the Freshman class was picked up unconscious, and such injuries will frequently result when some seventy or eighty men are piled<br />\nup on one another in a writhing, struggling mass. It is absolutely necessary to have some<br />\ngeneral melee in which all members of both classes may participate, but why not substitute<br />\nsomething which will not necessitate nearly a hundred men piling upon one another, for<br />\nthose at the bottom must suffer. I would suggest ;a flag-fight which would be just as spirited, last a little longer, contain all the elements of a class \"scrap,\" and still avoid the<br />\npiling-up of an organized cane rush. What is the opinion of the student body?<br />\nA SENIOR.<br /><br />\nITHIN the next few weeks there will be at least one vacancy, and perhaps two or three, upon the staff of editors, and these vacancies will be<br />\nfilled from the Junior and Freshman classes. We strongly urge that<br />\nthose men desiring a place upon the paper, begin handing in specimens of their<br />\nwork at once. These should be in the form of accounts of concerts or games,<br />\noriginal matter, or any items of university news which may interest the student<br />\nbody. The Freshman class in particular we urge to exert themselves along<br />\nthis line.<br /><br />\nV<br /><br />\nTO AN OLD PHOTOGRAPH.<br />\n'Tis through a mist of years I gaze at thee,<br />\nSweet vision of the days that are no more,<br />\nWhile mem'ries fond and fancies odd and free<br />\nBreathe softly from the old times' golden shore.<br />\nI seem to hear thy voice so sweet and true,<br />\nTo feel the tender pressure of thy hands,<br />\nAnd see the lovelight in those -eyes of blue<br />\nThat speak of azure skies in far-off lands.<br />\nOhl heart of hearts, would that thou now were here<br />\nTo cast thy spell of love o'er ev'ry fear,<br />\nTo guide my soul from earth's dark, dreary way,<br />\nFrom sorrow's night to hope's bright dawning day.<br />\nR. F. C., '02.<br /><br />\n9<br /><br />\nTHE NEWS—LETTER'<br />\nW111111111111111u1111111111111111111111111111111111111111111111111111M1111111111M111111111111111111111,1111%11111111111111111111111111111111111111111111111110111111tgalll<br />\n2 •;•<br /><br />\n.•:.<br /><br />\na<br /><br />\n1:1<br />\nsr,••<br /><br />\n•<br /><br />\n•<br /><br />\n14111i111111111111111111111111011111111111V111111111111111111111111111V1111111111111111111111111111111111111111111111111111fIN11111110111111111111111111111111111111111111!M1';;IiEIGgA<br /><br />\nR.<br /><br />\nElgin R. L. Gould, Ph. D. of the University in 1886, has been placed on<br />\nthe slate for City Chamberlain of New York under the Low administration. Dr. Gould has done fine work for Low in his two campaigns; in<br />\nthe recent one he was treasurer of the Committee on Finance, and collected over<br />\n$160,000 for the campaign fund. Dr. Gould is independent in politics.<br />\nDr. George B. Shattuck, of the geological department, is president of the<br />\nnewly organized Field Foray Club, the purpose of which is the study of the<br />\nnatural and geological history of Maryland and adjoining regions. The 341<br />\nmembers of the club are mostly public school teachers taking the University extension lectures at the Hopkins.<br />\nFriday night, December 20, Dr. W. H. Tolman, director of the New York<br />\nMuseum of Social Economy, will deliver a lecture in McCoy Hall on \"Social<br />\nand Industrial Betterment,\" under the auspices of the Woman's Club of Roland<br />\nPark.<br />\nDr. Remsen has been invited to make the leading address at the laying of<br />\nthe corner stones of the two new buildings now being erected at Caylor University, Waco, Texas.<br />\nIra Remsen, '97, Dr. Remsen's elder son, has made a hit in Paris by a portrait of the Marquis Ito, of Japan, who was recently published in the \"Monde<br />\nillusive.\" The Marquis considered the likeness so excellent that he wrote a<br />\nJapanese poem to accompany it,besides signing the portrait in English, Chinese,<br />\nand Japanese characters. Mr. Remsen has lately returned to Paris, to resume<br />\nhis art work there, from a year's service in the U. S. A. in the Philippines.<br />\nDr. J. H. Hollander was in Boston on the .2th and 13th, for the purpose of<br />\naddressing the National Civil Service Reform League on the subject of \"Insular<br />\nCivil Service.\" He was much missed by his undergraduate class in Economics.<br />\nDr. D. C. Gilman has been re-elected President of the Civil Service Reform<br />\nLeague in New York.<br />\nAt the annual banquet of the New England Alumni Association, held in<br />\nBoston last Saturday night, there were present from the University President<br />\nRemsen, Ex-President Gilman, and Dr. J. H. Hollander.<br />\nElliott Strouse, '02, has left the University and has gone to Indiana, to<br />\nrecuperate from an attack of sickness.<br />\nEben C. Hill, '02, is recovering from a severe attack of pleurisy and typhoid<br />\nfever. He is at present free from the fever, but is left very weak by it, and will<br />\nnot be out for a month.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nMUSICAL CLUBS.<br /><br />\nDN December 13 the annual concert of the Musical Clubs, at Hannah Moore<br />\nAcademy, took place. The only appearances preceding this had been at<br />\nthe Hospital, November 30, and at St. Mary's Parish, Roland Park, on<br />\nDecember 6th, so that the occasion was, as always, very enjoyable. The feature of the evening was the soloists and the duet: T. K. Gillman, of the Medical School, bass solos; S. T. Mason, '02. humorous bass solos; W. B. Carver,<br />\nG., tenor solos; and a vaudeville duet by C. S. Hodges, '98, and S. T. Mason,<br />\nwhich was the hit of the evening, successfully \"rough-housing\" the audience.<br />\nAll the clubs showed up well, especially the Banjo club; and with some hard<br />\nwork, the performance on the Christmas trip ought to be creditable.<br />\nAfter the concert a sumptuous feed was demolished, and then the reception<br />\nbegan. Although said one hour, it seemed scarcely ten minutes before the sad<br />\nnews came that the car was waiting.<br /><br />\nO<br /><br />\nFor the Christmas trip, the Clubs have adopted the following schedule:<br />\nCharlestown, Thursday, December 26; Winchester, Va., Friday; Hagerstown,<br />\nSaturday. The start will be made at 7.20 A. M. Thursday, on a special car of<br />\nthe B. &amp; 0. R. R. Returning, the Clubs will leave Hagerstown by the Western Maryland R. R., at 4 P. M., Sunday, December 29. The Charlestonians<br />\nhave already arranged to give the Clubs a dance after their concert, and entertainment is expected at the other places named,<br />\nThe line-up on the trip will probably be as follows:<br />\nGLEB CLUB: First tenors, Eyster, Carver, Humrichouse, and Cowles; sec_<br />\ntenors,<br />\nNelson, Stubbs, Wright, Stall, Beasley; first basses, Eager (leader),<br />\nond<br />\nFord, Thomas, Myers, Snowden, Bryan; second basses, Gillman, Nelson, Marshall, Dochez (leader).<br />\nMANDOLIN CLUB: Mandolins, Snowden (leader), Cross, England, Bryan,<br />\nDochez, Marshall, James; violins, Nelson, Lanier; guitars, Smith, Carver,<br />\nMartin, and Hazlehurst; traps, Mason.<br />\nBANJO CLUB: Banjorines, Marshall (leader), Smith, Lanier, Hendry.<br />\nMason, Snowden, Briscoe; banjos, Bryan and Baetjer; bass banjo, Eager;<br />\nguitars, James, Mason, Converse, Hazlehurst; violin, Nelson.<br />\nDuring the illness of Manager E. C. Hill, '02, the acting manager is R. C.<br />\nPagon, '03.<br />\nTHE DEBATING TEAMS.<br />\nHE annual inter-class debate for which the seniors and juniors are beginning to prepare, promises to be of unusual interest. Both bodies contain<br />\ndebaters of no little ability, and, whatever the question, the arguments<br />\nshould be exceptionally good. Those men who have entered their names as<br />\ncandidates for the senior and junior teams are:<br />\nSeniors—Harvey B. Stone, Charles Ma/ken, John G. Campbell, Ross M.<br />\nDiggs, J. R. Pels, B. Swayne Putts, Guggenheimer, Murphy, McGlone, Wolman, Kirk, Strouse and Myers.<br /><br />\nZ<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nJuniors—Harry K. Tootle, Sol Blum, Harry W. Plaggemeyer, W. Sellman<br />\nBird, Hoffman, Stubenrauch, Custis, Winternitz, Glocker, Strayer, Combs,<br />\nSparrow, Addison, Adler, Dochez and Meeks.<br />\nThe general topic of the debate will be \"Trusts,\" and at each meeting of<br />\nthe Senate and of the House of Representatives, some phase of the question will<br />\nhe discussed. In this manner the subject will be presented from every possible<br />\npoint of view, and the arguments in the final debate certainly should not be<br />\nlacking either in quantity or in quality. The freshmen are busily preparing for<br />\ntheir oratorical contest. Those men who are trying for positions are Austrian,<br />\nBranham, Buckler, Cator, Dickey, Emig, Kinnane, Louis, Opie, Rosenheim,<br />\nWallis, Humrichhouse, Branch, Gutman, Cohen, Geiger, Lloyd, McGlone,<br />\nStrobar.<br /><br />\nAMONG THE COLLEGES.<br />\nALE cleared $70,000 on her foot ball season.<br /><br />\nP<br /><br />\nMr. Richard Sheldon whose work on Yale's track team, of which he was<br />\ncaptain, has given him fame all over this country, has been compelled, through<br />\nsickness, to retire from college.<br />\nIn addition to general dramatic productions, both Yale and Harvard have<br />\ntwo or three plays a year in French and German by students in these departments.<br />\nThe Yale Musical Clubs this year number about 65 men. The clubs have<br />\nso far had a successful season, both from the musical and financial points of<br />\nview.<br />\nA new and excellent regulation at I,eland Stanford University limits the<br />\nnumber of women students to 500.<br />\nOf 11,000 living graduates of Yale, 9000 were present at the recent Bi-centennial, representing classes from 1850 to 1901. This is the same spirit which<br />\nprompted about fifty Hopkins men to brave the rain and wind in order to witness a championship foot ball game!<br />\nThe New York Tribune gives the following selection for an All-American<br />\nfootball team: Center, Holt, of Yale; guards, Warner, of Cornell, and Barnard,<br />\nof Harvard; tackles, Cutts, of Harvard, and Bunker, of West Point; ends,<br />\nHenry, of Princeton, and Davis, of Princeton; quarter-back, Daly of West<br />\nPoint; half-backs, Weekes, of Columbia, and Kernan, of Harvard; full back,<br />\nGraydon, of Harvard. This gives Harvard four men, Yale one, Princeton two,<br />\nWest Point two, Cornell one, and Columbia one.<br /><br />\nSCENE: Grammar school. Dialogue between teacher and Johnnie.<br />\nTEACHER—\"What is the future of he drinks.\"<br />\nJOHNNIE---\"He is drunk.\"—Ex.<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHONORS FOR HOPKINS ATHLETES.<br />\nHE Johns Hopkins Athletic Association has awarded the honorary athletic<br />\n\"H\" to the following men, all of whom participated in championship<br />\nfootball games: Messrs. Gillespie, captain; P. Hill, Garwood, Yearley,<br />\nCampbell, Bacon, Houghton, Bernheim, Sayler, Faris, Blanck, and Sharretts.<br />\nThe honorary \"H. A. A.,\" which is given to those who have materially aided<br />\nthe team, but have not participated in championship games, were given to<br />\nMessrs. H. B. Stone, H. P. Straus, Plaggemeyer, Whipple and Youtz.<br /><br />\nt<br /><br />\nLACROSSE OUTLOOK.<br />\nOW that the football season is over, the men -left from last year's team<br />\nand the \"young hopefuls,\" who are to become members of this year's<br />\nlacrosse team, are coming out for practice in stick work and running.<br />\nThe formation of the three cornered league with Hopkins, Lehigh, and Swarthmore as its members urges the men on all the more, and the outlook is rather<br />\ncheerful.<br />\nAmong the old men who remain are Abercrombie, our star center; Captain<br />\nSchmeisser who can be relied upon to do his best at point; H. P. Straus whose<br />\nexperience were the most valuable in assisting the new men to learn how to<br />\nplay the game; Bertram Bernheim will again have opportunity to show how he<br />\nP. Bernheim and Abercrombie can perfect their<br />\nand Putts can shout goals;<br />\nmidfield play; Ernest Schmeisser will show marked development, and together<br />\nwith Tough will give their opponents a lively tussle—these men are the two<br />\nyoungest members of the team, but the showing made by them last year was<br />\nmost creditable and would have done justice to old men.<br />\nAmong the men who have had some experience and who are trying hard<br />\nfrom the team, are: Frank Iglehart, J. G. Custis. J. W. Bryan, Horace Gillespie, Fred. Blanck, W. S. Bird and H. B. Stone.<br />\nDuring the Christmas holidays, light work will be indulged in. After the<br />\nmen are again settled down to work, regular practice, four times a week, will<br />\nbegin, and when spring time comes daily out of door practice will be held.<br /><br />\nT.<br /><br />\nE.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nMR. DOOLEY VISITS THE BAZAR.<br /><br />\n41:0HERE<br /><br />\nWith apologies to F. P. Dunne.<br /><br />\nhave ye bin th' last week?,\" asked Mr. Hennessy, through a<br />\na cloud of foam.<br />\n\"I wint to our naytional capitol,\" answered Mr. Dooley, ''to confer about th: liquor-licence law with my frind Roosenfelt who, f'r all his German Jew name, is a good American. I had a gr-rand time comin' home, Hinnissy.\" Mr. Dooley indulged in several moments of inward reminesence.<br />\n\"What was that?,\" asked Mr. Hennessy finally and with impatience.<br />\n\"It was at th' Confederit Bazaar in Baltimore, th' town where th' Irish<br />\nelemint stharted th' civil war-r be hur-rling bricks an' roohn' mayterials upon<br />\nth' cursed invader fr'm th' Nor-rth.''<br />\n\"Baltimore!,\" exclaimed Mr. Hennessy, \"an' how did ye git there?'<br />\n\"I fell off th' rear car 'o th' exhileratin' B. &amp; 0. express,\" explained Mr.<br />\nDooley apologetically, \"an was picked up be a switchman.\"<br />\n\"Where am I at?,\" I shrieked, afther wakin' up.<br />\n\"Baltimore,\" he says. Gracious heavins, thinks I, an' Noo York on'y a<br /><br />\n4<br /><br />\nhundred an' ninety miles away.<br />\n\"Whin does th' nixt thrain leave?,\" I demanded iv him.<br />\n\"In six hours,\" he says. \"Two thrains daily.\" Well, there I was, whin<br />\nI bethought me iv me couzin, Bridgit Callahan,—a descindint iv wan iv th'<br />\nsivin hundher Kings iv Ireland, but forced be penury an want to take in<br />\nwaashin'. So I wint to pay me rayspicts an' met her on th' dure-sthop, outwar-rd bound.\"<br />\n\"Why, cousin Dooley,\" she says, \"you're jist in time. I'm goin to th'<br />\nConfederit Bazaar.\"<br />\n\"Th' whaat?,\" I asks.<br />\n\"'Tis a fair,\" she says, ''f'r erectin a monimint to a noble, but a lost<br />\ncause,\" she says, \"I suppose ye have some money with ye.\"<br />\n\"It's a losin' game, thin?,\" says I.<br />\n\"'Tis charity,\" she says.<br />\n\"I'll go,\" says I, with faith an' hope, but me pocket book sank.<br />\nAn we wint. 'Twas a gr-rand sight. The noble hall was lined with<br />\nthirteen booths, stands, bars, or what ye will. 'Tis an unlucky number, I<br />\nthought, as I felt me loose change shrink instinctively fr'm me graasp. A<br />\nluvely creature come thrippin' up to me, an says:<br />\n\"Don't ye waant to buy some cigareets?\"<br />\n\"I have no vices,\" I replys with some dignity.<br />\n\"Too bad,\" she fhips back, oglin' me with wan eye. Hinnissy, I sighed.<br />\n\"Go hack home, pretty wan,\" says I, takin' a pack. I gave thim to a small<br />\nboy nixt me an' told him to make himsilf sick all to wanct, an' th' sooner th'<br />\nbetther, f'r th' glory iv young America.\"<br />\n\"Ye were encouragin' vice,\" remarked Mr. Hennessy severely.<br />\n'Not so, Hinnissy, I beleeve with Maxim in increasin' th' velocity iv th'<br />\nprojayctil. Mr. Hennessy looked unconvinced, but Mr. Dooley continued.<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\n\"We begun to wandher around through a crowd that thick I cud feel me<br />\nclothes wearin' out. On a tandim formation, an eldherly gint iv my build an'<br />\nmesilf gained tin yards through a stout lady with a pink cockatoo on her bunnet, an' reached th' nearest booth, filled to th' top, I' ye mind, with th' elegant<br />\nknick-knacks an' ge-gaws iv a wumman's life.<br />\n\"Bridgit,\" says I to me couzin who had taken advantage iv th' interferance, \"how do ye like this shoe-bag. 'Tis ividintly th' creavtion iv dilicit<br />\nfingers an' irresistibly artistic tastes.\"<br />\n\"'Tis not f'r th' likes iv me,\" says Bridgit, discouraged be th' high ar-rt<br />\nin th' pur-rple vilets upon a green background.\" I am that tired whin night<br />\ncomes I lave me shoes on th' flure.\"<br />\n\"Well, thin,\" says I, \"let me get you this box f'r containing th' superfluities iv' th' toilet table.\"<br />\n\"I have none,\" says Bridgit, gettin' rattled with th' noise an' th' elegance.<br />\n\"We must find somethin equally useful, but iv a different nature,\" says I,<br />\nspakin' thick to impress th' uncompromisin' lady who kipt an unwaverin' eye<br />\nupon our ivry motion, \"how wud those handkerchers do?\"<br />\n\"Them's doilies,\" murmured th' lady in a tone which intimated that no<br />\ngintleman wud refer to sich a thing. Sarves ye r-right, Dooley, thinks I to<br />\nmesilf, for foolin' with dhry goods an notions. I had begun to feel oppressed<br />\nan to perspire visibly whin me eye lit on wan iv th' fifty sivin varieties, tucked<br />\naway between a woolen baby-jacket an' a piller cushin. I've seed th' advertisemint in th' throlloy cars; it has often inspired me with an appitite f'r me<br />\nhomely meal, but niver befure did I wilcome it with sich delight. I looked at<br />\nBridgit, she nodded, an' I bought th' thing, an' put it in me pockit where it<br />\nafterwards broke. The nixt booth had a sign which says \"Rayfreshmints,\"<br />\nan' we stepped up.<br />\n\"Is this the fr-ree lunch counter?,\" I asks, very rayspictful, iv th' nearest<br />\nbooth-tender.<br />\n\"I dunno what ye mane,\" she says, \"but we have ice cream, cake, an'<br />\nliminade.\"<br />\n\"Have ye any beer an' Sweitzer sandwiches?,\" says I.<br />\n\"Wud ye like to take a chance on a keg?,\" she says.<br />\n\"If its a small keg,\" I says modistly, \"a man can but do his best.\" With<br />\nthat I took a few chances an' left. I niver got it. We had no more than gotten<br />\nawaay, whin a gur rl heavily disguised as a gypsey ask me if I wanted me forchune told. That rayminds me, thinks I to mesilf, removin' me dimind shirtstud an' fondlin me waatch-charm. I had not been on th' Midway f'r nowthin,<br />\nHinnissy,—I had not.<br />\n\"Madame,\" I says, \"wait till I'm lavin' an' twil not take ye so long.\"<br />\nI seed wan poore man standin on a box. He hilt in th' r-right hand wan<br />\nof thim pound-caakes which mither used to make—ye know thim, they weigh<br />\na ton wanst inside—in th' lift hand he flourished a box iv caygars which had<br />\ntur-rned green fr'm shaame.\"<br />\n\"Come up, come up,\" he says, \"an' take a chanct. I've niver tasted it,<br />\nbut I know it's good,\" he says, on'y five cints f'r a risk on both,an' a gr- reat<br />\nrisk f'r th' money.\" Ye old hypocrite, thinks I, with yor wife lookin' at ye<br />\ntoo, Thin I thought iv you, Hinnissy; an' I calls out to him: \"Can ye raffle<br />\nthe caygars separit?\" Ye shud ha' seed his wife's face. I was that mor-rtified,<br />\nI left.<br />\nI heard some man raisin' hell at th' uppher ind iv th' hall, so I gr-ripped<br />\nBridgit be th' hand an' led th' way. There was a large silver bowl exposed to<br />\nview with a chain an' padlock around it, an' a man was yellin' like maad that<br />\nhe on'y had tin chanctes lift at fifty cints par.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\n\"I niver gamble,\" says I nonchalaantly to Bridgit.<br />\n\"Aint it a beauty,\" she says. I lost me head, thin. Hinnissy, an' did a<br />\nfoolish thing. I r-rushed up to th' man, lavin' B5idgit with a frind iv hers,<br />\nan' I flung him a five spot an' took th' tickets. Every wan crowded up, an' he<br />\ntur-rned th' wheel.<br />\n\"Fower hundher an' nine,\" he calls out.<br />\n\"I have it,\" srys I, an I had. He looked a me a minit, thin he looked at<br />\nth' wheel.<br />\n\"There's some mistake; th' wheel slipped,\" he says, \"it must be done<br />\nover, but in ordher to be more than fair,\" he says, \"I must insist that ye kape<br />\nyer chances on th' nixt tur-rn.,\" he says. I was jist decidin' where to soak<br />\nhim, whin th' band sthruck up a lively tune, somethin' between an Irish jig an<br />\n\"God saave th' Queen.\" Ivry wan clapped, an a man at me elbow says ''It's<br />\nDixie. Hooroo!,\" he says.<br />\n\"What did ye saay its name was?,\" I asks in me innocence.\"<br />\n\"Hinnis5y, I've been bur rt before, an ye know I'm a br-rave man, as men<br />\ngo, but whin I hit th' pavimint this time, I didn't want to go back. There<br />\nmust have been a hundher iv thim. A guardian iv th' public weal propped me<br />\ntip agin a laamp post an', says he, shakin' his head: \"Ye shud not have done<br />\nit, ye shud not have done it,\" he says, \"This is the sunny south,\" he says,<br />\n\"faamed f'r its hospitality,\" he says.<br />\n\"Thin let me git in th' sooty shade iv Chicago,\" says I, feelin' f'r me time<br />\ntable an' me life-insurance policy.<br />\n\"Ye need somethin' to stiffen ye up a bit fur rst,\" says he, ladin' me to a<br />\nI wint in. I cud not see th' barkeep, but I<br />\nsaloon fominst th'<br />\nfelt f'r him.<br />\n\"Ar-re ye a sunny southerner?,\" I whispers whin I got him.<br />\n\"Do I look like it,\" he says, \"me name is McCarty.\"<br />\n\"Say no more,\" says I, \"but git th' box an we'll shaake f'r th' dhrink.\"<br />\nMr. Dooley fell to towelling the bar. After some silence, Mr. Hennessy remarked:<br />\n\"I thought ye said ye had a gr-rand time at th' bazaar?\"<br />\n\"I did,\" said Mr. Dooley, \"across th' street.\"<br /><br />\nSANTA CLAUS HEARS FROM A FRESHMAN.<br />\nEVERAL days ago the NEWS-LETTER was fortunate enough to get hold<br />\nof one of the letters which the freshmen are now sending to Santa Claus.<br />\nWe feel sure that its contents will interest most of our readers.<br /><br />\np<br /><br />\nDEAR SANTA CLAUS:<br />\nI have almost reached the age when boys stop writing you a list of their<br />\nwants, but there are several things I want particular bad this Christmas, and<br />\nI'm going to write to you once more. Since this time last year I've been through<br />\nsome fearful trials and hardships. I worked hard all the spring and managed<br />\nto pass enough examinations to get in the Johns Hopkins University. I<br />\nthought it was grand. You know it makes you feel fine to go to Hopkins.<br />\n(There are a crowd of fellows there, though, who haven't the first rudiments of<br />\ncommon politeness, and instead of welcoming me in a hospitable manner, they<br />\ntreated me like a little yellow dog.)<br />\nI went down there to study, and didn't propose to stand for any roughhouse, but they made me take off my hat,—sometimes my shoes, pushed me<br />\nhead first out of the elevator, forced me to buy chocolate at the slot ma-<br /><br />\nTHE NEWS-LETTER.<br /><br />\n16<br /><br />\nchine, and insisted upon making me do the hoola-hoola dance on the trophyroom table. Now you know that wasn't fair. It wasn't wright.<br />\nUpon entering the university, I considered myself a man, and felt that I<br />\nought to shave; so I bought a mug and put it in the barber shop. The nasty,<br />\nmean things took it, and a few days afterward, made me stand on the lockers<br />\nunder the gymnasium, lather one of my fellow classmen out of my own mug,<br />\nand shave him with the butt end of a golf stick. Then he shaved me the same<br />\nway. I was so angry I most cried. But what could I do with the horrid<br />\ncreatures jeering at me and telling me not to whimper?<br />\nThese are only a few of the mean tricks, hut I think they are enough to<br />\nmake you pity me and put what I want in my stocking.<br />\nI am awful anxious to wear a black and blue jersey, hut haven't dared to<br />\ndo it yet; for I saw the juniors jerk one off a fellow's back so fast that I thought<br />\nhis arms would come too. After Christmas, though, I think they will let us<br />\nwear them, so please bring me one. I wear boy's size, No. 22.<br />\nI really think I am big enough to begin smoking, but hardly know whether<br />\nit would be healthy for me or not. You might bring me a pipe and I'll wait a<br />\nfew weeks before using it. I also want a cow bell for Christmas. Next year I<br />\nam going to ask you to bring me a cane. Please bring me these, Santa Claus.<br />\nI haven't had a very good time since September.<br />\nA FRESHMAN.<br />\nThe unfortunate freshman who wrote the above can hardly be blamed for<br />\nsaying that the treatment received at the hands of the juniors was not \"wright.\"<br />\nHe has evidently been one of the marks.<br />\nWe are glad to know that he is \"awful anxious\" to wear a black and blue<br />\njersey, and hope he will not be molested after Christmas for so doing.<br />\nLet him take hope in the thought that better times are coming.<br />\nY. M. C. A. NOTES.<br /><br />\nZ<br /><br />\nHE monthly meeting of the Executive Council was held Wednesday,<br />\nDecember 11, at 5 P. M.<br /><br />\nThe report of the Bible Study committee for November showed an average<br />\nweekly attendance of 30 for the Bible classes.<br />\nThe membership report showed a total membership of 231.<br />\nMr. Robert E. Speer, of New York, will speak on Sunday, January 19, at<br />\n4.30 P. M.<br />\nLevering Hall Chapel was filled to its utmost on Tuesday, December 3,<br />\nwhen those present heard an inspiring address by Rev. S. Bates Cadman, D,D.,<br />\nof Brooklyn, on \"Faith.\"<br />\nThe men of the University owe it to themselves to come out to hear the<br />\nprominent speakers whom from time to time address the Association.<br />\nTHEATRICAL GUIDE.<br />\nNASMUCH as the present week has been set apart by the University<br />\nauthorities for examinations, it is. necessary that the students should<br />\nindulge in some form of mental relaxation in the evenings. With this end<br />\nin view, the NEWS-LETTER publishes the following theatrical guide for the<br />\ncurrent week:<br />\nFord's—Mrs. Carter in \"Dew-Berry.\" Mrs. Carter's sweet, domestic play,<br />\n\"Zaza,\" is fresh in the memory of University students.<br /><br />\n3<br /><br />\nTHE NEWS-LETTER.<br /><br />\n17<br /><br />\nAcademy—The King's Carnivora—First class \"Bridge\" show.<br />\nHolliday St.—Select tragedy for the aesthetic. Material for the Dean's<br />\nEssay.<br />\nAuditorium—White Rats Company. This cozy, home-like resort proves<br />\nparticularly attractive to Hopkins students. The sweet pastoral plays point<br />\ntheir own moral, and leave good impression upon the mind of verdant youth<br />\n(particularly Freshmen).<br />\nN. B. As we do no free advertising in our columns, we cannot give information regarding the Palm Garden. For further information send stamped<br />\nand self addressed envelope to any of the editors.<br />\nCentral—This \"home of the muses\" receives so much patronage from all<br />\nstudents who possess a love for the artistic side of nature, that comment is<br />\nunnecessary. It fills a position in Baltimore parallel to the Corcoran Gallery in<br />\nWashington. We append a few rules of the house:<br />\n1. You are requested to patronize our polite attendants. 2. You are requested to report to the bouncer any inattention on the part of the ushers. The<br />\nbouncer will see that you are promptly attended to. 3. Don't throw our glassware on the floor after you have finished examining its interior. It costs<br />\nmoney. 4. Leave your valuables at the ticket office before entering. The<br />\nhouse needs the money. 5. Refrain from making remarks about the actors or<br />\nactresses while the show is going on. Don't interrupt the soubrette while she<br />\nsings.<br /><br />\nCzar of Russia now has four daughters.\"<br />\nt<br />\n44HE<br />\n\"Oh, the dear little Czardines.\"—Ex.<br />\n\"PROFESSOR, do you expel students often?\"<br />\n\"No, only once.\"—Ex.<br />\nSome Glaring \"Jokes\" from The Harvard Lamfioon.<br />\n\"And what have your bills come to thus far?\"<br />\n\"Chiefly to ashes, father.\"<br />\nMRS. RUSHER (mother of J Rusher, '01)—Yes, Mrs. Jones, I feel perfectly at ease about Jack's college life, since I find the influence of the students<br />\non each other is so good. Why, Jack tells me that he and the rest of his class,<br />\nby a little well-directed personal effort, have already succeeded in persuading<br />\nthe freshmen to give up smoking pipes.<br /><br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\nNTCD1<br /><br />\nLJ<br /><br />\n13I.<br /><br />\nNICD 0 0FR•<br /><br />\n.<br /><br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br /><br />\nCHESAPEAKE RUBBER COMPANY,<br /><br />\n321 W. Baltimore Street,<br /><br />\nE3E;t7i 6c C.=0<br />\n675 West Baltimore Street,<br /><br />\nNEST BALTIMORE LOAN C<br /><br />\nU.Between Arch and Pine Sts. Baltimore, Md.<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nOPEN FROM 7 A. M. TO S P. M.<br />\nSATURDAYS UNTIL 10 P. M.<br />\nSIDE ENTRANCE WITH PRIVATE WAITING ROOM.<br /><br />\na co.<br /><br />\nSMITH, DIXON<br /><br />\no P/AfTell<br />\n29-31 S. Charles St.<br /><br />\nBaltimore, Md.<br /><br />\nri6t1113CS FRANKE &amp;<br /><br />\nR<br />\nNELLCO<br />\n6)<br />\n1<br />\n2<br />\n,<br />\n)<br />\n,<br />\nU<br />\nN<br />\nFrail°.<br />\nHOWARD ST.<br /><br />\nGreeh ILetter<br />\nA. H. FETTINGI fratenutp<br />\njeweirp.<br />\nMANUFACTURER Of<br /><br />\n14<br /><br />\nAND<br /><br />\n16 ST. PAUL STREET,<br /><br />\nBALTIMORE, MD.<br />\nC CALL AND EXAMINE OUR LINE IBEFOPIE<br /><br />\nPUNONA•INO,<br /><br />\nJ. H. ROBINSON.<br />\nMA NUfACTUNUM<br /><br />\nFINE<br /><br />\nBonbons, Chocolates,<br /><br />\nOf<br /><br />\nCONFECTIONS.<br /><br />\n• FINE• CIGARS,.<br />\nDEMEAN<br /><br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br /><br />\nIN<br /><br />\nTOBACCO, CIGARS. AND SMOKERS' ARTICLES,<br />\nSTATIONERY.<br />\n026 N. EUTAW ST.<br />\nBALTIMORE,MD.<br /><br />\n14 EAST BALTIMORE STREET.<br /><br />\nBaltimore, New York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone, Madison 11/315Y.<br />\nDesigning and Cutting by E. Michaelson.<br /><br />\nE. MIGI-MELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nALTERING AND REPAIRING.<br /><br />\n821 rladison Avenue,<br /><br />\nSpecial discount to Students.<br /><br />\nBflLTIMORE, MD.<br /><br />\nA. D. SMITH &amp; SONS,<br />\nFoirnerly<br />\nLEVERING &amp; SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children.<br />\nIn the Latest Destuns.<br />\nMEN'S HATS—Derbys and Soft Felts.<br /><br />\n;IP<br />\n67:2Z(W/i›.1•\"..'s'\"?,•!,••<br /><br />\nBALI L'Ir<br />\n!.(:01-1, L. MC CL a ie.rwrn .51.6.<br />\nN'<br />\n^‘,, mirr,,ourvrtAmr, 7,)<br /><br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br /><br />\nCHOICE WINES, LIQUORS AND CIGARS,<br />\nRAW BOX NOW OPEN.<br />\n606 NORTH EUTAW STREET.<br />\nLadies' and Gentlemen's Dining Rooms.<br />\nMeals Served at All Hours.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n'Phone, C. St P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\n804 UNION TRUST BUILDING,<br /><br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\nOSTEOPATHY<br />\nIs a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nMARIA 111J1E, D 0,,<br />\nV.-Prost. &amp; Asst. Soe'y.<br /><br />\nW.D. BOWEN, M. D., D.0.,<br />\nProst. &amp; Mgr.<br />\nESTABLISHED 1879.<br /><br />\nWedding Silver rig\"<br />\nIN QPIEAT VARIETY.<br /><br />\n\"?,13:rC:AVET,K2T7s.Silversmiths.<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books.<br />\nStudent's SuP1314es•<br /><br />\nMadisonStHowardSts.<br /><br />\nSeely. &amp; Truss.<br />\nJAmas R. rAINE.<br /><br />\nTHKO. WAHNI4.12.<br /><br />\n8c. CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for incoln &amp; Bennett and<br />\nWalter Barnaro's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nrs o<br />\nanufasc<br />\nMturef<br />\nSilk and Ca simere Hats. *Ir HOPKINS CAPS<br /><br />\nC<br /><br />\nlienderson's<br /><br />\nH. MoMAINS,D.0.,<br /><br />\nelle1'8 and<br />\nUSHING &amp; COMPANY' S13toatoiits<br />\nonees.<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law 1111.1,113•L CLASSICAL AND MISCILLLANICOUS BOOKS<br />\nKeeps constantly on hand the Text Rooks used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman &amp; Sorlp<br /><br />\nII. R. E1SENBRANDT SONS,<br /><br />\nSTRBLEftGO. hi'Lls:1702vE.<br />\nJORDAN<br />\nReads as follows: Samples submitted of<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nfor<br /><br />\nFrench Brandy—no adulterants, no coloring,fine quality.<br />\npure, of superior quality.<br />\nNherry-...-110 coloring or adulterants, absolutely pure wine.<br />\nItYe Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\n_ Clder Vinegar—Llama!<br />\ncider vinegar, strictly pure and<br />\nrOng.<br />\nNix Ground 'picas--no adulteration, all strictly pure.<br />\n()pont)Port—absolutely<br /><br />\nOR ADVERTISING SPACE IN THIS PAPER<br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\n201-203 N.CHARLES ST.<br /><br />\nBALTIMORE, MD.<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450,000.<br />\nCapital, $650,000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSACIE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER,<br />\nNAPLES. GENOA, eTc.<br />\nBALTIMORE'. TO BREMEN<br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO<br /><br />\nJO JO Ja<br /><br />\nTAUGHT WI<br /><br />\nC. J. LEVIN•<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. (Thanes St.<br /><br />\nthe 1itran3Zniftb<br />\npiano CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nilgenirt?z cibludio<br /><br />\nCbichering, Erabburp anb IlIttebster<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nBaltimore<br /><br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\nON SALE THE I. H. U. PENNANTS,<br /><br />\nTHE BLAKE CO<br /><br />\nand all other College Pennants<br /><br />\n203 W. BALTIMORE ST.&amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange,<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE dr CO.,<br />\nBANKERS &amp; BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MI).<br /><br />\nThe Chas. YilIlms Surgical Instrument Company<br />\nBENJ. A. NELSON, OEN'L MANAGER<br /><br />\n!pianos.<br /><br />\n.0 4$<br /><br />\n0.&amp; P.'Phone 2322-2.<br /><br />\nFactory Prices.<br /><br />\n.<br />\n\"<br />\nSMITH'S ElC311 2T TaB UV<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\n•<br />\nSTORE.<br />\n3rd door from Madison.<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged ....<br />\nWM. V.PIPPEN,<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\n6os N. Eutaw Street.<br />\nA. H Rutherfoord.<br />\nF. Lentz.<br /><br />\nJ. WM, MIDDENDORF &amp; CO.<br />\nZanfters &amp; 16rohers.<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\nBaltimore, Md.<br />\nsoo N. Howard St.,<br /><br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nDrovers and Mechanics National Bank,<br /><br />\nBOOKS AND STATIONBRY<br /><br />\nOF BALTIMORE. MD.<br /><br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br /><br />\nYOUR EY.S<br /><br />\nSAYRE OPTICAL COMPANY,<br />\n111 North Charles Street. (Masonic Temple.)<br /><br />\nKXRAINING OPTIGIPMS.<br />\nTHE NEWS LETTER<br />\nIs from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPR INTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a tu'l line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br /><br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\n063 /%1c-1,1r- t<br />\nrecs. 3<br /><br />\n•<br /><br />\nC.7.1-x eft x-1ez.a.<br /><br />\nY. M. C. A. BUILDING.<br />\nBALTIMORE, MD.<br />\nC. &amp; P. and Md.'Phones.<br /><br />\nCAll ON<br /><br />\nJFtS. it. DOWNS,<br /><br />\n229 N. Charles 8t.,<br />\n''''MASPONIO TE IA PLC•<br />\nFOR. Class, Fraternity and College StationerY,<br />\nBanquet Cards, invitations, Dip ornae.<br />\nPrograms, Visiting Cards, etc. ......<br /><br />\nOur 60e .1. K. U. Blue and Flack Flag Paper—now readu.<br />\nThere is very little entertainment at home without a Plans<br /><br />\ncTIEFF<br />\nzPlAhlos<br /><br />\nfire The Best.<br /><br />\n9 N. Libertu St.<br /><br />"}], "field_media_file": [{"target_id": 36209, "display": null, "description": null, "target_type": "file", "target_uuid": "c9ea4f66-6df8-402b-a9e6-a5a33edcdbf0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12194-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12194, "target_type": "node", "target_uuid": "89a26db0-b309-415e-818f-d757618701af", "url": "/node/12194"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "65e10afa-a850-4c25-82bc-99cbd8004232"}]}