{"mid": [{"value": 37551}], "uuid": [{"value": "67c761ff-7021-49da-a094-f926fbdf8f87"}], "vid": [{"value": 37551}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:34:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12119-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:34:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:34:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "ERASMIAN SOCIETY<br />\nHEARSDR.GOLDSTEIN<br />\nSinai Specialist Discusses<br />\nGroup and Individual Practice of Medicine<br />\nHARMONY NOW PREVAILS<br />\nAttendance by Women Permitted For First Time<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br />\n<br />\nVol. XXXIV, No. 30<br />\n<br />\nTO TAKE PICTURES<br />\nFOR HULLABALOO<br />\nThe official photographer<br />\nfor the 1930 Hullabaloo is expected to be on the campus<br />\nwithin the next two weeks; so<br />\nall Seniors who wish their<br />\nphotographs to appear in the<br />\nyear book, and have not as yet<br />\nhad them taken, will please<br />\ndrop a note into George Gettemuller's P. 0. Box No. 350.<br />\nThis applies to those who are<br />\ndissastified with their present<br />\nphotographs as well as those<br />\na c t iv ities and fraternities<br />\nwhose pictures have not as yet<br />\nbeen taken.<br />\n<br />\nHOPKINS ADOPTS MOONLIGHT DANCES<br />\nDUE TO ENERGETIC GATE-CRASHER<br />\nWhen the regular Saturday night<br />\ndances were held in the C. E. Flail<br />\nthere was no difficulty whatever in<br />\ncrashing the gate. One could quite<br />\nreadily go from the M. E. to C. E.<br />\nbuilding through the tunnel and<br />\ncome out and up to the hall without<br />\ntrouble.<br />\n<br />\nJUNIOR BANQUET<br />\nTO BE FORMAL<br />\nIt has been decided by the<br />\nJuni o r Banquet Committee<br />\nthat the class of 1931 will hold<br />\na formal banquet this year.<br />\nNo decision has been reached<br />\nas to the date, location or entertainment. It is planned to<br />\nhold the banquet at some hotel<br />\nin Baltimore. Belmont Towbin, chairman of the committee, would like to be informed<br />\nof any objections to the above<br />\nplan, and is open to all suggestions.<br />\nInvitations to the banquet<br />\nwill be sent to the President<br />\nof the University, the Dean<br />\nof the College of Arts and<br />\nSciences, and other officials.<br />\nLast year the class of 1931<br />\nheld a traditional informal<br />\ntype of banquet and the committee desires that the affair<br />\nbe of an entirely different<br />\nnature this spring.<br />\n<br />\nsway to and fro in the moonlight<br />\nilluminating. Our enterprising gate<br />\ncrasher has meanwhile returned via<br />\nthe tunnel to the now unguarded<br />\ndoor and to the dance.<br />\nIn the great hall another waltz<br />\nhas been encored. Strangely enough<br />\nthere appeared to be but little disHowever, the old order changeth pleasure at the loss of the glaring<br />\nand when the dances were moved lights. The only exception were the<br />\nover to Levering Hall the matter Cotillion Club members who seemed<br />\nwas not so easy due to the fact that to feel that it was their duty to<br />\ntickets were collected at the door of remedy the situation. However, it<br />\nthe hall and. not the door of the seems that the powers that be had<br />\nbuilding. Hence one of our Hop- locked all doors leading down stairs<br />\nkins Seniors arriving slightly be- and the said powers having departfore 11 o'clock last Saturday, at ed the c. c. m.'s were somewhat up<br />\nfirst did not see a way of indulg- against it.<br />\nIn the course of an hour the<br />\ning in the terpsichorean art without<br />\nwaltz's<br />\nbecame still more dreamier,<br />\nrelinquishing the customary enthe<br />\nc.<br />\nc.<br />\nm.'s more hot under the<br />\ntrance fee.<br />\ncollar, and the moon brighter. At<br />\nAfter due processes of cerebra- 12, the usual closing time, more enion the dastardly scheme was cores encouraged the orchestra to<br />\nevolved. Over to the familiar M. continue. Various fair damsels from<br />\nE. building, down the familiar Goucher, mindful of the midnight<br />\nstairs, through the familiar tun- deadline when they should be back<br />\nnels, up the stairs to the main in the dorms dashed hither and<br />\nswitchboard behind the kitchen. thither while escorts dashed just as<br />\nWhat? All doors locked and the madly, seeking partners with cigkeys gone? Too bad! Yet all is not arette lighter and match.<br />\nlost. The switchboard is there. In a<br />\nShortly later, complaint having Sectional Contest to be Held at<br />\nmoment all the switches are pulled. finally reached the power house,<br />\nWashington, D. C.<br />\na<br />\nUpstairs feminine shrieks sound.<br />\nman was dispatched through the<br />\nThere is a temporary pause in tunnel and the lights again<br />\nassumed<br />\nWINNER GOES TO N. Y.<br />\nthe dance, the first waltz of the eve- their pristine glory.<br />\nning. Then once more the figures<br />\nH. F. M., Jr. Musical Club Concert Tonight<br />\nAt Zion Church<br />\n<br />\nJAY FIVE MEETS<br />\nARMY TOMORROW<br />\nHopkins Basketers Leave For<br />\nWest Point Today<br />\nDEBUSKEY TAKING TRIP<br />\nHopkins Will Have Full<br />\nStrength in Game With<br />\nCadets<br />\n<br />\nDevelopment of group and state<br />\nThe Johns Hopkins basketball<br />\npractice of medicine, at the expense<br />\nof individual practice, was deteam will conclude a week of activscribed by Dr. Albert E. Goldstein,<br />\nity when it meets the strong Army<br />\nkidney specialist at the Sinai Hosquintet at West Point tomorrow<br />\npital here and one of the best surafternoon. The Jay squad leaves<br />\ngeons in his field in this section, ,...,,ornevenpaiw<br />\nA 4V0Ve.<br />\n4111441001.4ellidellifill0<br />\nfor West Point today and will<br />\nin a lecture given Tuesday night<br />\nthe night as the guests of the<br />\nauspices<br />\nspend<br />\nthe<br />\nunder<br />\nin Levering Hall<br />\nadThe<br />\nSociety.<br />\ncadets. The team will compete with<br />\nof the Erasmian<br />\ndress replaced the regular meeting<br />\nArmy tomorrow afternoon at 2:30<br />\nof the club and was the first occaand return at night.<br />\nMiss Roberta White Addresses<br />\nsion upon which women have been<br />\nthe Gathering<br />\nDebuskey Taking Trip<br />\ninvited to attend.<br />\nGene Debuskey, Jay luminary<br />\nIndividual practice, the speaker<br />\nINTERESTING<br />\nTALK<br />\nand<br />\ncenter man, will take the trip<br />\nindependent<br />\nsaid, included the<br />\npractigeneral<br />\nalong with the rest of the team.<br />\nwork of both the<br />\ntioner and the specialist. Harmony \"Youth in a Primitive Society\"<br />\nThis is Debuskey's first trip of the<br />\nnow prevails between these two in<br />\nIs Subject of Talk<br />\nseason, as his studies at the Medical<br />\nthe discharge of their _respective<br />\nSchool have not permitted him to<br />\nfunctions, and both have legitimate \"Youth in a Primitive Society\"<br />\nmake any of the other trips with<br />\nfields to occupy in the profession. was the topic discussed by Roberta<br />\nthe group thus far. However, the<br />\nAims of Group Practice<br />\nWhite in Liberal Club meeting, Friteam<br />\nwill have its full strength in<br />\nGroup practice, Dr. Goldstein day, February 7. The talk was<br />\nthe lineup tomorrow afternoon and<br />\ntold his audience, is practice con- based on a book by Margaret Mead<br />\nare all set to give Army a good<br />\nducted by a number of specialists entitled, \"Coming<br />\nof Age in<br />\nwho seek to coordinate their knowlbattle.<br />\nSamoa, a Psychological Study of Plans Completefor<br />\nLast Callfor Senior<br />\nedge and experience. The physiTeam in Top Form<br />\nInterfraternity Ball<br />\nClass Dues Feb. 21 On the 25th of this month the<br />\ncians constituting such a group Primitive Youth for Western CiviliIt has been definitely decided to<br />\nThe Blue Jays should be in top<br />\nA final date has been set by R. Johns Hopkins<br />\npool their expenses and their in- zation.\" Miss White stated that in<br />\nGlee Club will<br />\nhold<br />\nthe<br />\nInter<br />\nMarch<br />\nfraternity<br />\nBall<br />\nL.<br />\nform,<br />\nas both Baltimore University<br />\nMcAll, senior class treasurer, journey to Washington to compete<br />\ncome, and by cooperative use of the United States adolescence has<br />\n7<br />\nat<br />\nthe<br />\nMaryland<br />\nCasualty<br />\nHall.<br />\nfor the payment of 1929 class with George Washington and and St. John's College were met<br />\nphysical equipment can so reduce come to be thought of as a time<br />\nBob Tula, in person, and a ten-piece dues. By Friday, February 21, he<br />\nsaving<br />\neffect<br />\na<br />\nto<br />\noverhead<br />\nas<br />\ntheir<br />\nCatholic University of that city. during the week. The team diswhen conflicts are inevitable. orchestra will furnish the music.<br />\nmust be in receipt of the full sum This competitive concert will be<br />\nfor their patients.<br />\nplayed good form in the game with<br />\nSchools and juvenile courts give This will be a closed dance. All of twenty-nine dollars from<br />\neach<br />\nheld<br />\nat<br />\nthe<br />\nNew<br />\nWillard<br />\nHotel.<br />\nBaltimore U. during the second<br />\nAs early as 1787 Dr. E. A. ample support to this view.<br />\nstray Greeks, however, may obtain member of graduating class. This<br />\nThe<br />\nrespective<br />\nmerits<br />\nof<br />\neach<br />\nof<br />\nhalf, after getting away to a weak<br />\nHolyake said that the joint efforts<br />\ntickets from either Herbert Rice or date is definite and failure of the<br />\nthe<br />\nthree<br />\nglee<br />\nthis<br />\nclubs<br />\nof<br />\nsection,<br />\nin the opening period, and<br />\nLack<br />\nof<br />\nFeeling<br />\nstart<br />\nof many men toward a certain<br />\nJohn Yellot for $1.00. Fraternity class to comply with the requirewhich<br />\nmeet<br />\nin<br />\nWashington,<br />\nwill<br />\nbe<br />\nmanaged to defeat the Maroons, 24objective might accomplish in a<br />\nIn order to test the truth of this alumni will be charged $2.00. Only ments by that time will mean the comparatively judged, and<br />\nthe group 20. Hopkins should be a good bit<br />\nfew years what could be imassumption, Margaret Mead spent those holding tickets will be ad- breaking of the Hullabaloo contract picked as the best of the three will<br />\nmore experienced due to the week's<br />\npracticable to a few men working<br />\nmitted, and these will be distributed and added expense.<br />\nbe given a trip to New York City activity, for, aside from the two imfor ages. Group practice is suc- sveral months studying the devel- through the various chapters of the<br />\nThe present fee has been placed to compete with 14 other colleges portant games played, George Darcessful in the South and West, the opment of adolescent girls in the fraternities on the board.<br />\nat twenty-nine dollars despite the from various sections of the coun- ley has been holding regular pracspeaker declared, but only partially Samoan Islands. Her conclusion is<br />\nfact that last year's dues were the try.<br />\ntice during which his proteges were<br />\nso in New England, while in Bal- that in this simple culture adolessame and the 1928 Hullabaloo<br />\ntaught several new plays in preparatimore there is no example of this cence is not a time of mental and<br />\nWinner to go to New York<br />\nPaul Spear Elected<br />\nnetted<br />\na<br />\nlarge<br />\nloss<br />\nwith<br />\ninsufficient<br />\ntion of tomorrow's conflict.<br />\npractice.<br />\nDebating President funds to meet it.<br />\nThis competitive glee club affair<br />\nemotional crisis. She asks, \"What<br />\nTherefore<br />\nit<br />\nis<br />\nAdvantages of System<br />\nPassarew Hurt<br />\nAt a meeting of the Debating imperative<br />\nwill take place at Carnegie Hall in<br />\naccounts for the lack of storm and<br />\nthat all seniors coCaptain Passarew, who suffered<br />\nNew York City. The chances for<br />\nThe principles essential to suc- stress in Samoa and its presence Council held last Monday, Paul W. operate with the<br />\nclass representathe Homewood group in Washing- an injury to his arm during the<br />\nSpear was elected president of the tives to the<br />\ncess in an undertaking of this<br />\nfullest<br />\nextent so that<br />\nin America?\" In answering this<br />\nCouncil. Dal Ghent, elecfed as all<br />\nton are exceedingly bright. Osmar Baltimore University game, is renature the doctor outlined as folprecautions might be taken for<br />\nSteinwald has been working hard ported to have recovered, and will<br />\nlows: Loyalty, unity of purpose, question two factors were stated as president last year, recently left the the reduction of<br />\nexpenses to the<br />\nfirst<br />\nof<br />\nsignificance.<br />\nIn<br />\nthe<br />\nbeing<br />\nwith the club since examinations in all probability be in the game toUniversity.<br />\nAt<br />\nthe<br />\nsame<br />\nmeeting<br />\nharmonious<br />\nliberal understanding,<br />\nminimum.<br />\nhave<br />\nbeen over. A group of twenty- morrow afternoon. Passarew, whose<br />\nwillinggeneral<br />\ncasualness<br />\nof<br />\nplace<br />\nis<br />\nthe<br />\nMr.<br />\nPaul<br />\nWheeler<br />\nofficially<br />\nwas<br />\nrelations, cooperative spirit,<br />\nTo<br />\nlessen<br />\nthe<br />\nsudden<br />\ndrain<br />\non<br />\neight<br />\nmen, consisting of the best presence in the Maroon conflict was<br />\nness to work for their avowed pro- Samoan society. Lack of deep feel- appointed coach of debating. Mr.<br />\nthe<br />\nstudents'<br />\nfinance<br />\naccounts,<br />\nR.<br />\nsingers in each of the sections of the undeniably of extreme importance,<br />\nfession, and the obtaining of men ing is a convention. No one cares Wheeler has been acting in this<br />\nof recognized position in their much for any one person. No one capacity during the past year, and L. McAll has arranged a partial Glee Club namely first and second returned in the second half of that<br />\nhis services have been very valuable payment plan which the students tenors and first and second basses game in spite of the accident which<br />\nsphere. Its advantages were sumhis convitions. The secfor<br />\nsuffers<br />\nmay take advantage of if they so has been chosen to represent the occurred during the first period. He<br />\nto the team.<br />\nmarized as including better service<br />\neliminates<br />\nconflict<br />\nfact<br />\nwhich<br />\nond<br />\nPlans were discussed for promot- desire. However it is paid, never- club in Washington. Coach Stein- was high point scorer in this tilt.<br />\nfor the public at less cost, incentive to thorough examination of the is the small number of choices pos- ing interest in debating. The sug- theless, the full account must be wald has assigned nearly all of the<br />\nArmy Strong<br />\npatient, strict limitation to the field sible to youth. There is only one gestion to create an office of busi- completed by next Friday. If any remaining time until the date of the<br />\nIt is not to be denied that the<br />\nof one's own specialty, familiarity religion and one standard of moral- ness manager whose function would individual fails to meet the sum by competition to rehearsals, as a speArmy<br />\nis quite correct in boasting<br />\nwith the best and most modern ity, in contrast with our country be to arrange debates and handle that date it will necessitate the cial song for the contest must be of a<br />\nstrong<br />\nquintet, for their's is a<br />\nequipment, freedom from business which boasts dozens of sects and the finances was put forward. No omitting of his picture and write- learned. This song is a particularly<br />\npowerful<br />\nteam,<br />\nand one to be<br />\nup from the Hullabaloo.<br />\ndifficult one.<br />\ndetails, saving in time through dozens of standards, all clamouring definite action was taken.<br />\nreckoned with with much sagacity<br />\nR. L. Hall wishes to make a perThe team to represent Hopkins<br />\ngreater regularity of hours, pos- for support.<br />\nSpecial Group<br />\nin intercollegiate basketball circles.<br />\nsibility of vacations without loss of<br />\nagainst Colgate on February 20 sonal appeal to all members of the<br />\nThe picked group of twenty- This holds true especially in games<br />\nEnvironment<br />\nincomes to the doctors, payment of<br />\nwas partially selected. Paul Spear senior class for its sincere enthueight men will represent the club in played on their home court, for it<br />\nexpenses on research trips, pension \"The Samoan method of life pro- and Leo Alpert will definitely siasm and cooperation, not only for<br />\nWashington, and if victorious in is there that the team reaches its<br />\nfund, and group insurance for the duces no neuroses,\" Miss White speak. The third man will probably the benefit of the class itself but<br />\nNew York, however, this does not maximum efficiency and many powphysicians' families, whereby a stated. \"The early environment be either Robert Kyle or John for the individuals as well.<br />\nmean<br />\nthat the remaining members erful teams have reached their doom<br />\nThe treasurer will be in the lobby<br />\nwidow receives the money raised of the Samoan child favors nervous Wheeler. The subject of this<br />\nof<br />\nthe<br />\nclub are to be dropped, for on the West Point floor.<br />\nby the sale of her deceased hus- stability. Father and mother fixa- debate will be: Resolved, that the of Levering Hall every lunch hour<br />\nthey will participate in the remainArmy should be playing good<br />\nband's place in a group clinic.<br />\ntions are eliminated since each nations of the world adopt a plan from twelve-thirty to one o'clock, ing concerts as well as the Home basketball, too, at this point of the<br />\nDisadvantages<br />\nchild is cared for by several of its of complete disarmament excepting until the aforementioned date for Concert.<br />\nseason. Early in the week the<br />\nsuch forces as are needed for police the receiving of payments.<br />\nThe disadvantages of this system adult relatives and hardly distinCadet five swamped Amherst, 42Home Concert February 21<br />\npurposes.<br />\nwere said to be that it is too guishes its parents from its aunts<br />\n25. However, the Jays will be out<br />\nThe Home Concert will be held in full strength to make it hot for<br />\nmechanical, that it commercializes and uncles. Children are free to<br />\nGraduates<br />\nto<br />\nHold<br />\nwhenever<br />\nthey<br />\nresidence<br />\nchange<br />\nclannishness<br />\ndevelops<br />\non<br />\nFebruary 21 at the Maryland the West Pointers tomorrow aftermedicine,<br />\nNotice<br />\nTea<br />\nDance<br />\nThursday<br />\nany<br />\nof<br />\nhome<br />\nto<br />\nthe<br />\nmoving<br />\nwish,<br />\nclinic,<br />\ngiven<br />\nCasualty Auditorium. Tickets are noon, although the latter will be<br />\namong members of a<br />\nA mid-year call for candidates to<br />\nThe Graduates' Club of the now on sale in the lobby of Leverand destroys the family physician. relative.\"<br />\nheavy favorites. The line-up will<br />\nthe editorial and business staffs of Johns Hopkins University will hold ing Hall between 12 and 1 o'clock,<br />\nThe attitude • toward birth, and<br />\nState medicine, Dr. Goldstein<br />\nprobably be as follows:<br />\nanother of its periodical tea-dances and also at the postoffice.<br />\nasserted, came under political con- sex were also mentioned as prevent- the NEWS-LETTER is being issued.<br />\non Thursday, February the 20th.<br />\nArmy<br />\nHopkins<br />\ntrol and tended to develop medi- ing maladjustment. Children are al- There is an excellent opportunity<br />\nConcert Tonight<br />\nThe affair is to take place at<br />\nKreuger<br />\nR.<br />\nF.<br />\nSiegel<br />\nocrity in the profession. Under lowed to witness births, deaths, and for election open to all candidates.<br />\nLevering Hall between the hours<br />\nStrother<br />\nF.<br />\nL.<br />\nThere<br />\nwill<br />\nbe a concert of the<br />\nStude<br />\nthis plan doctors are assigned to sex acts. They are protected from All those interested will meet in the<br />\nof 4.30 P. M. to 6.30 P. M. All Combined Music Clubs tonight in Blanning<br />\nC.<br />\nDebuskey<br />\ndistricts which they serve without the emotional shock which such ex- NEWS-LETTER office in Levering<br />\ngraduate students and the faculty the Zion Church, located at City Steelier<br />\nR.G.<br />\nPassarew<br />\ncharge and for which they receive periences would give our children<br />\nare<br />\nattend.<br />\ninvited<br />\nto<br />\nHall<br />\nat<br />\n12.30.<br />\nHall<br />\nPlaza,<br />\nAbel<br />\nat<br />\n8.15<br />\np.<br />\nm.<br />\nL.G.<br />\nWhite.<br />\n(Continued<br />\non<br />\npage<br />\n3, col. 1)<br />\n(Continued on page 4, col. 3)<br />\n<br />\nLIBERAL CLUB HOLDS<br />\nWEEKLY MEETING<br />\n<br />\nGLEE CLUB ENTERS<br />\nNATIONAL TOURNEY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br />\n<br />\n2<br />\n<br />\nPresident Comfort of Haverford College has indeed proven a<br />\ncomfort for the yearlings of his institution. Terming the annual cakeFOUNDED 1897<br />\nWe notice by the \\Vesleyan Ad- walk that the frosh are obliged to<br />\na disgrace to the college<br />\nSubscription<br />\n$2.00 vance of Kansas Wesleyan College undergo<br />\nit for \"making a<br />\nand<br />\ncondemning<br />\nthat the Kappa Delta Alpha FraterEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\npig-pen out of Roberts Hall,\" Presnity house was robbed. The theives<br />\nMd., under the Act of Congress November 3, 1879.<br />\nident Comfort has declared that the<br />\ntook about $75. Well, some frater- cake-walk will have to go the way<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nnity houses appear to contain of all flesh, the Kiwi; and (acUniversity.<br />\nmoney but we do not think that cording to the California Daily<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, around Baltimore robbin fraterni- Bruin) the absent-minded college<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-4N•CHIEF.<br />\nties would prove particularly fruit- professor. The place of the preand<br />\nscribed form of hazing is to be<br />\nful. It might also be noticed that<br />\ntaken by a formal dramatic presenUniversity 0100<br />\nTelephone<br />\n$40 of the money stolen was taken tation or musical comedy presented<br />\nfrom a guest. That sounds a little by the unfledged yearlings.<br />\nEDITORIAL DEPARTMENT<br />\nmore reasonable.<br />\n***<br />\nEditor-in-Chief<br />\nfor<br />\n*<br />\n*<br />\n*<br />\nThe Villanovan, official torch of<br />\nGEORGE GUMP,'30<br />\nBilly Arthur has started out to the Villanova College, makes an<br />\nManaging Editor<br />\nprove that size has nothing what- amazing theological find:<br />\nROBERT S. BAIRD, '30<br />\never to do with intellectual powers. \"It certainly is funny that the<br />\nAssistant and Managing Editor<br />\nchapel always has more of a student<br />\nBilly is just 36 inches tall and is a<br />\nGEORGE DOWELL, '31<br />\ncongregation during the time of<br />\nstudent at North Carolina Univer- exams than at any other time of the<br />\nAssociate Editors<br />\ncity. So far it is said that he is prov- year.\"<br />\n18 and 20 E. Baltimore Street<br />\nPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\n* * *<br />\ning his point very capably.<br />\nJunior Editors<br />\nDr. P. S. Barto of the Carnegie<br />\n***<br />\nPURNELL HALL,'30<br />\n'30<br />\nSMITH,<br />\nL.<br />\nSTEWART<br />\nof Technology, according<br />\nInstitute<br />\npast<br />\nthe<br />\nin<br />\nUniversity<br />\nAt Duke<br />\nHARWOOD F. MuLumx,JR.,'30 ROWLAND MuD. Nx.ss, '32<br />\nof that college, is<br />\nto<br />\nthe<br />\nTartan<br />\n'32<br />\nHARRIS,<br />\nM.<br />\nNATHAN<br />\nFRANS CONE, 31<br />\ntwo years $12,000,000 have been<br />\nSYLVAN LEBOW, '32<br />\nGEORGE TRATTNER,'30<br />\nfor the purpose of<br />\nOhio<br />\ntouring<br />\nDONALD PRocroR, '33<br />\nspent on a building program. It is<br />\nHAROLD YUDKIN, '32<br />\ninterviewing principals of the Ohio<br />\nHERBERT FRIEDBERG, '33<br />\nFULTAN GRUVER, '32<br />\nstated that this program is the larg- high schools. Barto's chief concern<br />\nRICHARD HUNT,'31<br />\nTHE TAILORED SHOE<br />\nest ever projected by any univer- is the regulation of studies in the<br />\nBUSINESS DEPARTMENT<br />\nMoccasin Comfort-100 per cent Flexible Sole<br />\nsity. The library at Duke has a lower schools to conform to the<br />\nChoice Styles in Finest Leathers<br />\nBusiness Manager<br />\n1,000,000-volume capacity. Well requisites for entrance to Carnegie.<br />\nGus BURK, '31<br />\nPopular Prices<br />\nHopkins may be going a bit slower He hopes, through the cooperation<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nbut we may get there yet. Our only of principals, to inculcate into the<br />\nSold by BLAKE, Hopkins Man<br />\nLYLE GULLEY, '30<br />\nSADLER ROBERTSON, '31<br />\nfear is that the undergraduate high school curriculum subjects<br />\nCall Vernon 1650 any evening after 5 P. M.<br />\nOffice Manager<br />\nschool may be driven out while the which are vital for matriculation<br />\nand to eliminate others of lesser imAim); BLum,'30<br />\nbuildings are growing up.<br />\nportance. If this project proves<br />\n* * *<br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br />\nHenry V. Saunders, '32<br />\nSIDNEY RAFKL, '31<br />\nit will tend to better the<br />\nsuccessful,<br />\nTheodore Fleishman, '31<br />\nAccording to the B. P. I. Signal,<br />\nNTURY CAB CO.<br />\nDavid S. Sykes, '32<br />\ncase of lower classmen who seem<br />\n1718 N. CHARLES STREET<br />\nGEORGE W. LAMONT, '32<br />\ngirls' tennis team is being orto be distressed at this time with<br />\nVERNON 7002<br />\nanized at that school. The girls<br />\nWe are promoting the cab business from an expensive luxury<br />\nup<br />\nof<br />\nrequired<br />\nthe<br />\nmaking<br />\nburden<br />\nteam and<br />\nto an economical necessity<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. lave fully organized the<br />\ncourses.<br />\nvice-president,<br />\n1 lected a president,<br />\n* * *<br />\necretary, and treasurer. There ap.<br />\nThe<br />\n,<br />\nplan that Carnegie is at1 ears to be something missing here,<br />\nto inaugurate is one that<br />\ntempting<br />\ns we were of the opinion that an<br />\nwas<br />\nin Maryland and other<br />\nadopted<br />\nthletic team usually had a capsome<br />\nyears ago. It has,<br />\nStates<br />\nquite<br />\nain and manager. However, we<br />\nof<br />\ncourse,<br />\nproven<br />\nquite successful.<br />\nuppose after the social organizaif<br />\nHowever,<br />\nat Carnegie<br />\nprincipals<br />\ntion the tennis side of it will come<br />\nTHE BARNSTORMERS' PLAY<br />\nand<br />\nobstinate<br />\nare<br />\nas<br />\neccentric<br />\nas<br />\nIater.<br />\nthey are in Baltimore, Dr. Barto<br />\nHE Barnstormers are to be congratulated on their choice of their<br />\n* * *<br />\nannual play. \"If I were King,\" by Justin Huntly McCarthy, should<br />\nIn a lecture to a class of men and has quite a task ahead of him. The<br />\nproduction.<br />\namateur<br />\nhigh-class<br />\nfor<br />\nvehicle<br />\nideal<br />\nan<br />\nprove<br />\n-, omen, Dr. Landrith, at Ward wisest thing to do is to make a<br />\n] elmont College, said • that she moral issue out of it.<br />\nIt is an essential of successful amateur plays that they should be<br />\n1 -ould advise girls to smoke pipes<br />\nlight. Melodramatic acting tends to become ridiculous in the hands of<br />\nany<br />\nby<br />\nhandled<br />\nwhen<br />\nsting<br />\ntheir<br />\n..cThe said that if they were trying to<br />\nlose<br />\namateurs and tense situations<br />\nparticularly,<br />\nBarnstormers,<br />\nThe<br />\nI e masculine they might just as<br />\nbut the most experienced of dramatists.<br />\nplay<br />\nmen<br />\nthat<br />\nreason<br />\nthe<br />\nN ell go the limit. As it is now men<br />\nshould not attempt very serious drama for<br />\nthe<br />\nto<br />\nitself<br />\nI ave to carry cigarettes to please<br />\nthe female parts, a situation that does not readily lend<br />\nhave<br />\ntheir girls. It looks like now we'll<br />\nintense type of play. However, the Barnstormers in previous years<br />\nI ave to carry pipes, pipe tobacco,<br />\nplaced too much weight on the other side of the balance; their plays<br />\na nd all the accessories. If girls must<br />\n'have been much too light. \"The Dictator\" and \"The Champion,\" for<br />\nt e masculine why don't they wear<br />\nexample, were hardly more than farces.<br />\nf ockets to carry some of their<br />\nAn interesting point in regard to dramatics is that tragedy and farce<br />\nthings in.<br />\nare the two most difficult types of play to produce. The Barnstormer<br />\nIn the Minnesota Daily the stateplays in the past few years have bordered so closely upon farce that<br />\n'Were<br />\nI<br />\n\"If<br />\nis found that kissing a cow<br />\nlent<br />\n;<br />\nIn<br />\nunobservable.<br />\nalmost<br />\ntimes<br />\nat<br />\nthe distinction was<br />\nfarce,<br />\non<br />\nthan kissing a co-ed. It<br />\nborder<br />\nnot<br />\nsafer<br />\nwill<br />\n•<br />\nthat<br />\ni<br />\nplay<br />\na<br />\nKing,\" the 'Stormers have chosen<br />\nbest<br />\nthe<br />\nis<br />\nthere are practically no<br />\nplay<br />\nthat<br />\na<br />\nSuch<br />\nays<br />\ns<br />\nyet will not require intensely emotional acting.<br />\nthe lips of a cow in<br />\non<br />\nI acteria<br />\nmedium for college dramatists.<br />\nComparison to the reddened lips<br />\naf some co-eds. However, it is the<br />\nVARSITY SEALS<br />\n6eneral opinion • that it should be<br />\nreferable to be attacked by a<br />\nthe end of this month, the Student Activities Council, actZ.<br />\nea th. 1,..,Ac es; 41. crorirsste nr4;xritirrsc<br />\n...,-Inf.'<br />\nacteria than a cow.<br />\nwill award Varsity Seals to deserving seniors.<br />\n***<br />\nWe believe that the Seals have been distributed too freely in the<br />\nProfessor Maurice Fitzgibbons<br />\npast. Every honor that may be won by college men is prized in direct<br />\nare<br />\nthat<br />\nSeals<br />\nmore<br />\nThe<br />\nit.<br />\nattaining<br />\nLafayette College thrilled a recof<br />\nof<br />\ndifficulty<br />\nproportion to the<br />\ngiven, the less they are regarded. The number of Varsity Seals awarded<br />\nord audience at the Little Theatre<br />\nshould vary slightly from year to year, inasmuch as there are more<br />\nin Easton, Pa., last week by giving<br />\ndeserving men in some classes than in others. But the number of Seals<br />\na spectacular demonstration of<br />\nshould not vary directly with the number of seniors on staffs of activihypnotism, mesmerism, and postties. In other words, mere membership on a staff should not entitle a<br />\nhypnotic suggestion. His assistants<br />\nman to wear the Varsity Seal.<br />\nwere students of the college. The<br />\nextrain<br />\nmerit<br />\nrecognizing<br />\nof<br />\npurpose<br />\nThe Seal is awarded for the<br />\nprofessor caused the limbs of some<br />\ncurricular activities. It differs from 0. D. K. merely because the latter<br />\ndemands distinction in several branches, the former in only one. Just<br />\nof his patients to become as stiff<br />\nas 0. D. K. does not confer membership upon a man because he has<br />\nas iron and made the blood to leave<br />\nmerely been connected with three or four activities during his college<br />\nthe arms of another. In addition,<br />\nlife, so the Student Activities Council should not bestow the Varsity<br />\nhe alternately made one subject imSeal on any man purely because his name has appeared on some staff<br />\nto pain, made him perspire,<br />\nmune<br />\nlist for three years.<br />\nIU ST because your friends arose a little<br />\nand then to start to freeze. Some<br />\nearlier in the morning there's no reason<br />\nThe heads of activities should not recommend any man for a Varsity<br />\nwhy you shouldn't get there at the same time.<br />\nstudents were hypnotized so as to<br />\nSeal unless he has worked diligently and well for three years. If this<br />\nStop at the AMOCO-GAS Pump..then watch<br />\nis done, the regard for the Seal will be tremendously increased. Many<br />\nimagine themselves girls and to act<br />\nthat car of yours turn into a fleeting ghost of<br />\nmen at Hopkins try out for an activity in their freshman year, do just<br />\naccordingly. As an example of postthe highway -- alive, alert,'a-tingle, to get goenough work to be elected to the staff and then dawdle through the<br />\nhypnotic suggestion, a subject was<br />\ning and keep going! You'll eat away that<br />\nnext two years with just enough effort to keep from being dismissed<br />\nmade to act as if he were suffering<br />\nhead-start so swiftly, so smoothly, so surely<br />\nfrom the staff. Then when they become seniors they are gravely<br />\nthat it will end in a head finish--with your<br />\nThis<br />\ninsanity.<br />\nof<br />\na<br />\nmild<br />\nfrom<br />\ncase<br />\nservice.\"<br />\nof<br />\n\"in<br />\nrecognition<br />\nCouncil<br />\nfrom<br />\nthe<br />\nVarsity<br />\nSeal<br />\na<br />\nbranded<br />\ncar aheacl! Put it up to AMOCO-GAS--today,<br />\nIt is much the same situation as would be evident were the A. A.<br />\nexhibition of applied psychology<br />\ntomorrow, every day in the year.<br />\nBoard to award the major \"H\" to every senior who attended two or<br />\nwas pronounced by its spectators to<br />\n95i AMERICAN OIL COMPANY<br />\nthree football practices each year for three years. The \"H\" would<br />\nbe even more interesting than a<br />\nAffiliated with the Pan American Petroleum 6 Transport Co<br />\nthen mean as 1ittle-2s. the Varsity Seal is going to mean if the Student<br />\nGeneral Offices. Baltimore, Md.<br />\nby<br />\ngiven<br />\ndemonstration<br />\nProsimilar<br />\nawarding<br />\na<br />\ncall<br />\ndoes<br />\nhalt<br />\nnot<br />\non<br />\nindiscriminate<br />\nCouncil<br />\nthe<br />\nActivities<br />\nyear.<br />\nfessor Fitzgibbons last<br />\nof Seals.<br />\n<br />\nTHE MIESHOPKINS NEWSLETTER<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nWarner & Company<br />\n•<br />\nHats<br />\nClothing<br />\n<br />\nFurnishings<br />\n<br />\nGentlemen<br />\n•<br />\n<br />\nJust Reached Hopkins!<br />\n<br />\nEDITORIALS<br />\n<br />\n;<br />\n;<br />\ni<br />\n5<br />\n<br />\nAfter the Dance<br />\n<br />\nS1F.<br />\n<br />\nT<br />\n<br />\nII?I[CIIS<br />\n<br />\n8 5-17 North Charles Street<br />\n<br />\nive uead startmand<br />\nisvit a<br />\nOCO-Gas<br />\ngill it<br />\n<br />\nr ifl10<br />\n<br />\nBEFORE<br />\n•41 e\".<br />\n<br />\nI,41<br />\n<br />\nt<br />\n<br />\n.I,,ff<br />\n<br />\n.-,rt,er%<br />\n<br />\n\f7<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br />\nTo Editor of THE NEWS-LETTER.<br />\nCOTILLION CLUB<br />\nANNOUNCES DANCE<br />\nThe Cotillion Board wishes<br />\nto announce that it will hold<br />\na dance in Levering Hall tomorrow night from 9 'til 12.<br />\nThe price of admission will<br />\nbe $1.00 stag or couple. The<br />\nmusic will be furnished by the<br />\nusual orchestra and, as at past<br />\nSaturday night dances, a door<br />\nprize will be given.<br />\nThese dances have been<br />\nrather will attended this year<br />\nand the Board in charge of<br />\nthe dances, hopes that the students will continue to put in<br />\ntheir appearance and make the<br />\naffairs a success.<br />\n<br />\n- THE MAIL BAG<br />\nThe NEWS-LETTER wishes to<br />\nstate that the opinions manifested<br />\nin this column are those of the<br />\nstudent body and not of this publication. All letters must be signed,<br />\nhut the signatures will not be published unless so desired.<br />\n<br />\nLIBERAL CLUB<br />\n(Continued from page 1, col. 2)<br />\n<br />\nby the attitude of the adults, who<br />\naccept these facts of life as naturally as we accept eating and drinking.<br />\n\"In Samoa there is no secrecy or<br />\nignorance, no guilty knowledge or<br />\nhalf-truths. Enough of such experiences enter a child's life to give<br />\nhim the proper perspective. Complete knowledge puts sex at its true<br />\nvalue.<br />\n\"We cannot change the conditions of our society which make<br />\nfor conflict,\" Miss• White concluded, \"but we can train our children for the choices which confront them. They must be taught<br />\nnot what to think, but how to<br />\nthink.\"<br />\n<br />\nLord<br />\nBaltimore<br />\nHotel<br />\nwith its beautiful<br />\n<br />\nCalvert<br />\nBall Room<br />\nand many other private<br />\nrooms offers<br />\nSPECIAL INDUCEMENTS<br />\nto<br />\n<br />\nCOLLEGE AFFAIRS<br />\n<br />\nDear Sir:<br />\nWhat's the cause of \"F.G.S.'s\"<br />\ndyspeptic tirade against graduate<br />\nstudents? Did one of his instructors<br />\nfail to credit him with a passing<br />\nmark or did he just want to break<br />\ninto print? Poor boy, he might as<br />\nwell try to stop Niagara Falls by<br />\nwhistling at it. \"Ben\" in his poorest days was more vitrolic. I humbly suggest that F.G.S. look into<br />\nthe NEWS-LETTER files Of last year<br />\nand learn what destructive criticism<br />\ncan really achieve.<br />\nWith sympathetic encouragement.<br />\nGrotius.<br />\n<br />\nTo Editor Of THE NEWS-LETTER:<br />\nIn a contemporary issue of THE<br />\nNEWS-LETTER, my resignation from<br />\nthe position of secretary to the Debating Council, will be noticed. This<br />\nresignation calls for an explanation.<br />\nIn the first place, I bear no animosity to the new president of the<br />\ncouncil, Paul Spear.<br />\nThe Johns Hopkins Debating<br />\nCouncil is a rotten affair, it is putri- First Half of Bowling<br />\nTournament Completed<br />\ntied both within, and without. It is<br />\nTwo<br />\nmatches were completed in<br />\nin name, representative of oratoriStudent Bowling<br />\nGraduate<br />\nthe<br />\ncal interests in this University; but<br />\nlast<br />\nTuesday<br />\nafternoon. In<br />\nLeague<br />\nit merely serves as a means for certhe<br />\nfirst<br />\ndivision<br />\nthe<br />\nclassical team<br />\ntain individuals to obtain easy<br />\ndefeated<br />\nthe<br />\nFaculty<br />\nrepresentaawards from the Adams fund, and<br />\ntives with the encouragement of<br />\ndebating trips.<br />\ntheir<br />\nusual contingent of fair rootto<br />\nsupposed<br />\nteams<br />\nare<br />\nDebating<br />\nThe<br />\nEnglish Department team<br />\ners.<br />\nUniverof<br />\nthe<br />\ncream<br />\nrepresent the<br />\nfailed<br />\nto<br />\nappear for the match<br />\nfew<br />\nsity, yet they are picked from a<br />\nthe Political Econscheduled<br />\nwith<br />\nbenumbed individuals who imagine<br />\nfour.<br />\nomy<br />\nthemselves orators. Members of the<br />\nThe Political Scientists retained<br />\nUniversity proper who have been<br />\ntheir<br />\nlead in the second division,<br />\nwilling to show forensic interest<br />\nwinning<br />\ntwo straight games from<br />\nhave had their efforts stifled and<br />\nconsequently no longer come to try- the Geologists for their third victory. Half the schedule has been<br />\nouts.<br />\ncompleted. Each team meets each<br />\nyear<br />\nwas<br />\nthis<br />\nThe Adams contest<br />\nother team in its division twice;<br />\ndeliberately<br />\nslept<br />\na farce, one judge<br />\nthe<br />\nwinners of the divisional conthrough the debate, and the ballot<br />\ntests<br />\nmeet in a final match for the<br />\nbox was then stuffed by overeager<br />\nchampionship.<br />\njuniors. The team for the Colgate<br />\ndebate, was picked by Mr. Wheeler,<br />\nwithout the least regard for the<br />\nA. S. C. E. and A. S. M.E.<br />\nstudent body.<br />\nHold Joint Meeting<br />\nthings:<br />\nGive<br />\nthese<br />\ndo<br />\nnot<br />\nWhy<br />\nLast<br />\nnight<br />\nthe American Society<br />\ncomplithe<br />\nSeniors<br />\nfour or five<br />\nCivil<br />\nEngineers<br />\nand the Ameriof<br />\ncouncil<br />\nas<br />\nthe<br />\nmentary graft from<br />\ncan<br />\nSociety<br />\nof<br />\nMechanical<br />\nEngiorthe<br />\nturn<br />\ngifts each year, and<br />\nneers<br />\nheld<br />\na<br />\njoint<br />\nmeeting<br />\nat<br />\n8.15<br />\nganization over to Mr. Wheeler to<br />\np.<br />\nm.<br />\nin<br />\nthe<br />\nEngineers<br />\nClub,<br />\n6<br />\npractise<br />\nbe used for the benefit and<br />\nWest<br />\nFayette<br />\nstreet.<br />\nMr.<br />\nLessiter<br />\nf his debating classes. Perhaps<br />\nsome more of these individuals will E. Millburn, the vice-president and<br />\nbe able to violate every rule of ora- chief engineer of the Glen L. Martory under the pretense of fighting tin Company was the speaker. He<br />\nfor their Alma Mater. And, then, is considered quite an authority on<br />\ntoo, don't forget that the Debating his subject which was \"Today in<br />\nCouncil is the softest activity on the Aviaton.\" This timely talk was not<br />\ncampus, to receive both financial only instructive but very interesting. Refreshments were served at<br />\nand personal gain from.<br />\nthe close of the lecture. The meetSincerely,<br />\ning<br />\nwas presided over by F. A. AllHarold B. Yudkin.<br />\nner,<br />\nthe chairman of the American<br />\nFeb. 10, 1930.<br />\nSociety of Mechanical Engineers.<br />\n<br />\nCONVERTIBLE<br />\n<br />\nCONVERTIBLE<br />\n<br />\nFOR DESK<br />\n<br />\nTAKE OFF THE CAP<br />\nPUT ON THE PEN TAPER<br />\n<br />\nFOR POCKET<br />\n<br />\nTAKE OFF THE TAPER<br />\nPUT ON THE POCKET CAP<br />\n<br />\n1<br />\n<br />\nLIKE TWO PENS<br />\nfor the Price of One<br />\na Pocket Penfor Classroom Notes, and a Desk Penfor Your Room<br />\n—Guaranteed for Life!<br />\nIf you buy a Parker Pocket Duofold you now can<br />\nhave a Desk Set without buying a second pen. Or if<br />\nyou buy a Parker Duofold Desk Set you also now<br />\nreceive a Duofold Pocket Pen guaranteed for life.<br />\nEither way,you save the price of a second pen —$5,<br />\n$7 or $10,according to the model.<br />\nBy adding a tapered end,you convert your Duofold<br />\nPocket Pen to a Desk Pen in 10 seconds. By removing the taper and putting on the Pocket Cap<br />\nyou restore it to a Pocket Duofold on leaving office<br />\nor home.<br />\nThus every owner of a Parker<br />\nPocketPen owns halfaDesk Set.<br />\nGetting a Desk Base completes<br />\nit. We now include pen taper<br />\nfree with that.<br />\nStreamlinedshape,sets low in pockgt<br />\n—greaterink capacity than average,<br />\nsizeforsise—Non-breakable Barrels<br />\nof Jewel-like, Colorful Permanite.<br />\nSuper-smooth, hand-ground points.<br />\n<br />\nPencils to match,$3.25 to $5<br />\n<br />\nAnd to every buyer of a Parker Desk Set,we now<br />\ngive a Pocket Cap with Clip. Thus his Desk Pen is<br />\nalso a Pocket Pen—like2Pensfor the price ofone Set.<br />\nBe sure to ask forthePocket Cap with yourDeskSet.<br />\nParker's new streamlined Duofold Pens(and Pencils to match) set lower in the pocket than others<br />\nbecause the clip starts atthe top—not halfway down<br />\nthe cap. This smart,balanced shape feels\"at home\"<br />\nin the hand—and writes with our famous 47th<br />\nimprovement — Pressureless Touch.<br />\nGo see this revolutionary<br />\nConvertible Duofold at any nearby pen counter.<br />\n<br />\nar er<br />\n<br />\nTHE PARKER PEN CO.,Janesville,Wis.<br />\nOffices and Subsidiaries: New York.<br />\nChicago, Atlanta, Buffalo, Dallas, San<br />\nFrancisco; Toronto, Can.; London, Eng.<br />\n<br />\nDuofold<br />\n<br />\nConvertible<br />\nfor Pocket .for Desk<br />\n<br />\n$5 $7 $10<br />\n<br />\nPEN GUARANTEED FOR LIFE<br />\n<br />\nz‘ti<br />\n<br />\ntv.;<br />\n•eti<br />\n.q1.5.4••147441A<br />\n<br />\n•'<br />\n\",<br />\n<br />\n04-• -,<br />\n-.4<br />\n\"\":•••Z4<br />\n<br />\nS<br />\n<br />\n,<br />\n•<br />\n<br />\n4fi<br />\n414<br />\n0,N.<br />\n<br />\n,Fe<br />\n<br />\n.3dEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n<br />\nJ. A. RITTER & SON<br />\nFlorist's and Decorators<br />\n1918<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNORTH CHARLES ST., Near 20TH<br />\nPhone: VErnon 0673<br />\n<br />\nA Few Remarks<br />\nthat others have made about<br />\n<br />\nArt In Baltimore:<br />\nMONUMENTS AND MEMORIALS<br />\n<br />\nCharles Carroll Club<br />\nHolds Meeting<br />\nLast Sunday at 2.30 the Charles<br />\nCarroll Club held a meeting in 104<br />\nPhysics Building. This meeting<br />\nwas supposed to have been held<br />\nFebruary 2 but was postponed, because of examinations, to the aforementioned date.<br />\nDom Adrian Weld-Blundell, 0.<br />\nS. B., Chaplain, gave an interesting<br />\ntalk on \"The Origin of the Bible.\"<br />\nThis was one of a series of talks<br />\nto be delivered every Sunday to the<br />\nCarroll Club, everyone is invited to<br />\nattenld it.<br />\n<br />\nby WILLIAM SENER RUSK<br />\nProfessor of the History of Art, Wells College<br />\nA guidebook to nearly 200 of Baltimore's monuments, describing and giving the<br />\nhistory of each. New Bi-Centennial Revised Edition, illustrated, $1.50.<br />\n\". .. MONUMENTS and MEMORIALS should do much to open the eyes of<br />\nthe people of Baltimore to the value of the sculpture constantly before them and<br />\nto a greater realization of the position which this city has held, both in appreciation<br />\nand in production in the field of sculpture, ever since the days of William Rinehart.\"—Baltimore Bulletin of Education.<br />\n\"I find the text complete and accurate. Such a volume fills a need long existing<br />\nin Baltimore. It should help reveal Baltimore's art to Baltimoreans.\"—Professor<br />\nDavid M. Robinson, Vickers Professor of Classical Archaeology, Johns HoPkins<br />\nUniversity.<br />\n'<br />\n<br />\nVA<br />\n<br />\nTHE NORMAN, REMINGTON CO.<br />\nUPTOWN<br />\n<br />\nDOWNTOWN<br />\n<br />\n1118 N. Charles St.<br />\n<br />\n347 N. Charles St.<br />\n<br />\nGEOLOGY SOCCER CLUB<br />\nISSUES CHALLENGE<br />\nA challenge has been issued by the Soccer Club of<br />\nthe Geology department to<br />\nother teams composed of<br />\ngraduate students and faculty<br />\nmembers. The Geology department's team is captained<br />\nby Dr. J. T. Singewald, Jr.,<br />\nand is managed by Brinton<br />\nStone. Any department wishing to accept the challenge<br />\nshould communicate with<br />\nStone. Teams may be composed of less than the twelve<br />\nrequired for a full team, but<br />\nonly graduate students and<br />\nfaculty members may participate.<br />\n<br />\n... and that holds for careers, too!<br />\n00K where you are going. It's<br />\na method that gets the hockey<br />\nplayer through —and a business man<br />\non the way to success. The fellow<br />\nwho scores consistently is the one who<br />\npicks his course.<br />\nYet many a man comes out of<br />\ncollege, eager to make a name<br />\nfor himself in business, who has<br />\n<br />\nSINCE<br />\n<br />\n1382<br />\n<br />\nfailed to look where he is going —<br />\nwho has no definite goal in sight.<br />\nWhile you're still in college, study<br />\nyourself above all else—analyze your<br />\ninterests and capabilities. Get all the<br />\nhelp and advice you can from<br />\nsl your faculty adviser. Pick the<br />\nkind of work you'll like best.<br />\nAnd after graduation — go to it!<br />\n<br />\nMANUFACTURERS<br />\n<br />\nFOR<br />\n<br />\nTHE<br />\n<br />\nBELL<br />\n<br />\nSYSTEM<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br />\n<br />\nBARNSTORMERS DECIDE TO USE GIRLS FOR<br />\nFEMININE ROLES AFTER PRESENT SEASON<br />\nThe recent Barnstormer productions were no doubt likely to produce a bit of skepticism as to the<br />\nfuture employment of male interpretation of female roles. Moreover this skepticism was no doubt<br />\nlegally conceived, for it seems that<br />\nthe Barnstormers are actually about<br />\nt amputate that leg of their dramatic anatomy in the use of girls in the<br />\nfemale parts of their forthcoming<br />\nproduction, \"If I were King.\"<br />\nWhether or not the surgical dicctions emanated from exterior or<br />\ninterior sources, is not our pleasure<br />\nto discuss at this time. But the fact<br />\nmains that it is a gesture so<br />\nsagacious that it is quite alien to<br />\nthe usual practices of the various<br />\ndepartments of Hopkins' student<br />\nactivities. It represents a willingness<br />\nto entertain beneficial innovation no<br />\nmatter how radical it may be. Drastis renovations could well be made<br />\nin most any student activity on the<br />\ncampus from the mild instance of<br />\nthe Debating Club to the flagrant<br />\none of the Blue Jay. Yet as far as<br />\nmay be seen the general attitude is<br />\none that has maintained a noxious<br />\nindifference to defects most. gross<br />\nin their conspicuity. Hence, the<br />\nBlue Jay, the Y. M. C. A., the football team, the swimming team,<br />\nthe Debating Club and others, perhaps, are involved in a turmoil too<br />\nmuch like clean-cut comedy to be<br />\nable to guard against a future<br />\nabolishment of all activities that<br />\nmust surely come at the present<br />\npace.<br />\nThe dramatic institution that the<br />\n<br />\nBarnstormer's propose to displace<br />\nis one of not recent antiquation.<br />\nWhen the American Coquette decided to lay aside her bustle and go<br />\nin for college and emancipation, the<br />\ncollege female impersonator began<br />\nto be regarded not only as counterfeit, but as immoral. College boys<br />\nseemed to prefer the promising<br />\nbulge of the coed to the unconvincing pads of the impersonator. Kissing a rough beard on play night,<br />\ncollege heroes discovered, was nothing like necking an affable coed<br />\nduring rehearsals. And so the custom that has persisted at Hopkins<br />\nand several colleges has been placed<br />\namong the moth balls by the dramatic cliques of. Most others.<br />\nTentatively, the Barnstormers<br />\npropose to recruit actresses from the<br />\nCollege for Teachers. This, however, is a singularly dubious task<br />\nthey have set for themselves. As<br />\nyet, we have failed to encounter a<br />\ncoed from the Teachers' College<br />\nwho didn't look just like a coed from<br />\nthe Teachers' College. Hopkins obviously has not been endowed with<br />\nbeautiful girls nor is there any evidence that it has or will give birth<br />\nto passable actresses.<br />\nOne can always appreciate a<br />\nhandsome girl who is a good<br />\nactress. One can even appreciate a<br />\nhandsome girl who isn't a good actress. Girls, however, who have<br />\nneither of these qualities should not<br />\nbecome actresses unless they can<br />\nalso become the mistress of the local dramatic critic.<br />\nH.L.F.<br />\n<br />\nDECORATIONS<br />\n<br />\nDr. Kugler to Address<br />\nLiberal Club<br />\n<br />\nCALL MADE FOR<br />\nBALLET DANCERS<br />\nThe Barnstormers are sending out a call for 16 men to<br />\ntake part in a ballet dance in<br />\nthe 1930 production. The play<br />\nto be given this year is McCarthy's \"If I Were King.\"<br />\n\"Pops\" Swindell, the Barnstormers coach, wishes to<br />\nstage a ballet dance at one<br />\npart of the play. There will be<br />\neight women and eight men.<br />\nTo take one of the women's<br />\npart it is not necessary to be<br />\neffeminate looking. The steps<br />\nof the dance will be simple<br />\nand not difficult to learn.<br />\nAnyone interested in getting one of these parts, will<br />\nplease report tomorrow afternoon, Saturday at 2.30 o'clock<br />\nat the Barn.<br />\n<br />\nThis afternoon at 1 p. m. Dr. H.<br />\nKugler will address a meeting of<br />\nthe Liberal Club in Room C. second<br />\nfloor, Levering Hall. Dr. Kugler, is<br />\na well-known German student, and<br />\nat the present time is studying here<br />\nat Homewood. Dr. Kugler has already received his Ph.D. in both<br />\nEconomics and Chemistry. The<br />\nspeaker who is well acquainted with<br />\nthe political situation in Germany<br />\ntoday, has chosen as his topic \"German Political Leaders of Today.\"<br />\n<br />\nRIVE IT YOURSELF<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br />\n<br />\nCoupes<br />\n•\" \"\"<br />\nRoadsters<br />\nSedans<br />\n<br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles Street<br />\nPLaza 6000<br />\n2402 Pennsylvania Ave.<br />\nVernon 4049<br />\nLafayette 2000<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nThere will also be a public lecture on \"Russia\" by Oswald Garrison Dillard on February 19 at 5 p.<br />\nm. in the C. E. Hall. Mr. Dillard,<br />\neditor of the \"Nation,\" has just returned from a trip to Russia.<br />\n<br />\nNEW<br />\n<br />\nFORD<br />\n<br />\nUSED<br />\n<br />\nAutomobiles<br />\nGOLDSTEIN LECTURE<br />\n<br />\nPhone HOmewood 7908<br />\n<br />\n(Continued from page 1, col. 1)<br />\n<br />\nBirely's Pharmacy<br />\n<br />\na stated salary, too low to attract<br />\ntalented men into the service.<br />\nThe address was followed by a<br />\ngeneral discussion, which centered<br />\nlargely about the advisability of<br />\nstate subsidy of medicine, some<br />\ntaking issue with the speaker on<br />\nhis position in regard to it.<br />\n<br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br />\n<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br />\n<br />\nVernon<br />\n<br />\nMake Our Store Your Store<br />\n<br />\n4300<br />\n<br />\nWHAT<br />\nYOUNGER COLLEGE<br />\nMEN<br />\nARE DOING<br />\nWITH<br />\nWESTINGHOUSE<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nOur Business is to Improve<br />\nYour Appearance<br />\n<br />\nM. D. ROSS<br />\nGenerator Design<br />\nUniversity Toronto. '22<br />\n<br />\nWERGLEY'S<br />\nCharles St., North<br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br />\n2438<br />\n<br />\nThis Ad might fool you, but<br />\nthere is no deception about<br />\nthe inexpensive service of the<br />\n<br />\nMaster Cleaners & Tailors<br />\nSuits cleaned and pressed $1.00<br />\nPressing, 35c<br />\nHats cleaned and blocked, 75c<br />\n3204 Greenmount Avenue<br />\nPhone: Homewood 8453<br />\n<br />\nRIDE IN<br />\n<br />\nYELLOW<br />\nCABS<br />\n<br />\nR. A. ALLEN<br />\nHeadquarters Sales<br />\nAlabama Polytechnic Institute. '24<br />\n<br />\nSTAND AT HOMEWOOD<br />\nFIELD<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\ntkot,nnes*.,<br />\n<br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br />\n<br />\n*<br />\n<br />\n•')P<br />\n<br />\n.<br />\n<br />\n....<br />\n<br />\n•<br />\n<br />\n(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br />\n<br />\nPHONE:<br />\n<br />\nVernon 1212<br />\n<br />\nSTETSON CLOTHES<br />\nfor<br />\n<br />\nCollege cMen<br />\n<br />\nNationally<br />\n<br />\nJustly<br />\n<br />\nKnown<br />\n<br />\nFamous<br />\n<br />\nMADE FOR YOU<br />\n<br />\nFOUR NORTH HOWARD STREET<br />\n<br />\nA shakedown test, a rescue,<br />\nand a hundred thrills<br />\nSCORE of carefree Coast Guard<br />\nsailors, and with them a Westing..<br />\nhouseman from the Boston Office,<br />\nheaded in a \"bum boat\" for the cutter<br />\nChelan peacefully at anchor in the<br />\nharbor of Hamilton, Bermuda Islands.<br />\nIt had been an exciting shakedown<br />\ntest-cruise. The Westinghouse turbine<br />\ngenerator, motor and condensers had<br />\nfunctioned perfectly, the sea had yielded up its bag of tricks, the Bermudas<br />\nhad fascinated every soul. And soon<br />\nthey would be bound for home.<br />\nBut fate held new experiences in store.<br />\nFive hundred miles off the Azores, the<br />\nNewport,New York State training ship,<br />\nhad lost her propeller. The Chelan was<br />\ncalled to the rescue. And with her, of<br />\ncourse, went the Westinghouse man.<br />\n<br />\nW.SCHAELCHLIN<br />\nPropulsion Control Engineer<br />\nState College, '19<br />\nZuerich, Switzerland<br />\n<br />\nA<br />\n<br />\nH. R. GOSS<br />\nMotor Design<br />\nUniversity Minnesota.'20<br />\n<br />\nC. M. WILLIAMS<br />\nAuxiliary Switching Design<br />\nUniversity Illinois. '21<br />\n<br />\nThe Chelan, like four other Coast Guard Cutters recently<br />\ncompleted, is equipped with Westinghouse<br />\nturbine electric drive.<br />\n<br />\nThree days at top speed on tropical<br />\nwaters, the excitement of rescuing a<br />\nhelpless crew, twelve days at a lazy<br />\ntowing speed, men overboard and a rescue at sea—thrills like those come to<br />\nmany Westinghouse men in line with<br />\ntheir work at electrifying the world.<br />\nFor Westinghouse, in a commanding<br />\nposition in electrical development,enters<br />\nevery field of industry where electricity<br />\nis or may be employed. And Westinghouse men get a taste of every brand<br />\nof human activity.<br />\n<br />\nWestinghouse<br />\n<br />\na<br />\no<br />\n3<br />\nti<br />\n<br />\nti<br />\nIt<br />\n<br />\n\f", "format": "basic_html", "processed": "ERASMIAN SOCIETY<br />\nHEARSDR.GOLDSTEIN<br />\nSinai Specialist Discusses<br />\nGroup and Individual Practice of Medicine<br />\nHARMONY NOW PREVAILS<br />\nAttendance by Women Permitted For First Time<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br /><br />\nVol. XXXIV, No. 30<br /><br />\nTO TAKE PICTURES<br />\nFOR HULLABALOO<br />\nThe official photographer<br />\nfor the 1930 Hullabaloo is expected to be on the campus<br />\nwithin the next two weeks; so<br />\nall Seniors who wish their<br />\nphotographs to appear in the<br />\nyear book, and have not as yet<br />\nhad them taken, will please<br />\ndrop a note into George Gettemuller's P. 0. Box No. 350.<br />\nThis applies to those who are<br />\ndissastified with their present<br />\nphotographs as well as those<br />\na c t iv ities and fraternities<br />\nwhose pictures have not as yet<br />\nbeen taken.<br /><br />\nHOPKINS ADOPTS MOONLIGHT DANCES<br />\nDUE TO ENERGETIC GATE-CRASHER<br />\nWhen the regular Saturday night<br />\ndances were held in the C. E. Flail<br />\nthere was no difficulty whatever in<br />\ncrashing the gate. One could quite<br />\nreadily go from the M. E. to C. E.<br />\nbuilding through the tunnel and<br />\ncome out and up to the hall without<br />\ntrouble.<br /><br />\nJUNIOR BANQUET<br />\nTO BE FORMAL<br />\nIt has been decided by the<br />\nJuni o r Banquet Committee<br />\nthat the class of 1931 will hold<br />\na formal banquet this year.<br />\nNo decision has been reached<br />\nas to the date, location or entertainment. It is planned to<br />\nhold the banquet at some hotel<br />\nin Baltimore. Belmont Towbin, chairman of the committee, would like to be informed<br />\nof any objections to the above<br />\nplan, and is open to all suggestions.<br />\nInvitations to the banquet<br />\nwill be sent to the President<br />\nof the University, the Dean<br />\nof the College of Arts and<br />\nSciences, and other officials.<br />\nLast year the class of 1931<br />\nheld a traditional informal<br />\ntype of banquet and the committee desires that the affair<br />\nbe of an entirely different<br />\nnature this spring.<br /><br />\nsway to and fro in the moonlight<br />\nilluminating. Our enterprising gate<br />\ncrasher has meanwhile returned via<br />\nthe tunnel to the now unguarded<br />\ndoor and to the dance.<br />\nIn the great hall another waltz<br />\nhas been encored. Strangely enough<br />\nthere appeared to be but little disHowever, the old order changeth pleasure at the loss of the glaring<br />\nand when the dances were moved lights. The only exception were the<br />\nover to Levering Hall the matter Cotillion Club members who seemed<br />\nwas not so easy due to the fact that to feel that it was their duty to<br />\ntickets were collected at the door of remedy the situation. However, it<br />\nthe hall and. not the door of the seems that the powers that be had<br />\nbuilding. Hence one of our Hop- locked all doors leading down stairs<br />\nkins Seniors arriving slightly be- and the said powers having departfore 11 o'clock last Saturday, at ed the c. c. m.'s were somewhat up<br />\nfirst did not see a way of indulg- against it.<br />\nIn the course of an hour the<br />\ning in the terpsichorean art without<br />\nwaltz's<br />\nbecame still more dreamier,<br />\nrelinquishing the customary enthe<br />\nc.<br />\nc.<br />\nm.'s more hot under the<br />\ntrance fee.<br />\ncollar, and the moon brighter. At<br />\nAfter due processes of cerebra- 12, the usual closing time, more enion the dastardly scheme was cores encouraged the orchestra to<br />\nevolved. Over to the familiar M. continue. Various fair damsels from<br />\nE. building, down the familiar Goucher, mindful of the midnight<br />\nstairs, through the familiar tun- deadline when they should be back<br />\nnels, up the stairs to the main in the dorms dashed hither and<br />\nswitchboard behind the kitchen. thither while escorts dashed just as<br />\nWhat? All doors locked and the madly, seeking partners with cigkeys gone? Too bad! Yet all is not arette lighter and match.<br />\nlost. The switchboard is there. In a<br />\nShortly later, complaint having Sectional Contest to be Held at<br />\nmoment all the switches are pulled. finally reached the power house,<br />\nWashington, D. C.<br />\na<br />\nUpstairs feminine shrieks sound.<br />\nman was dispatched through the<br />\nThere is a temporary pause in tunnel and the lights again<br />\nassumed<br />\nWINNER GOES TO N. Y.<br />\nthe dance, the first waltz of the eve- their pristine glory.<br />\nning. Then once more the figures<br />\nH. F. M., Jr. Musical Club Concert Tonight<br />\nAt Zion Church<br /><br />\nJAY FIVE MEETS<br />\nARMY TOMORROW<br />\nHopkins Basketers Leave For<br />\nWest Point Today<br />\nDEBUSKEY TAKING TRIP<br />\nHopkins Will Have Full<br />\nStrength in Game With<br />\nCadets<br /><br />\nDevelopment of group and state<br />\nThe Johns Hopkins basketball<br />\npractice of medicine, at the expense<br />\nof individual practice, was deteam will conclude a week of activscribed by Dr. Albert E. Goldstein,<br />\nity when it meets the strong Army<br />\nkidney specialist at the Sinai Hosquintet at West Point tomorrow<br />\npital here and one of the best surafternoon. The Jay squad leaves<br />\ngeons in his field in this section, ,...,,ornevenpaiw<br />\nA 4V0Ve.<br />\n4111441001.4ellidellifill0<br />\nfor West Point today and will<br />\nin a lecture given Tuesday night<br />\nthe night as the guests of the<br />\nauspices<br />\nspend<br />\nthe<br />\nunder<br />\nin Levering Hall<br />\nadThe<br />\nSociety.<br />\ncadets. The team will compete with<br />\nof the Erasmian<br />\ndress replaced the regular meeting<br />\nArmy tomorrow afternoon at 2:30<br />\nof the club and was the first occaand return at night.<br />\nMiss Roberta White Addresses<br />\nsion upon which women have been<br />\nthe Gathering<br />\nDebuskey Taking Trip<br />\ninvited to attend.<br />\nGene Debuskey, Jay luminary<br />\nIndividual practice, the speaker<br />\nINTERESTING<br />\nTALK<br />\nand<br />\ncenter man, will take the trip<br />\nindependent<br />\nsaid, included the<br />\npractigeneral<br />\nalong with the rest of the team.<br />\nwork of both the<br />\ntioner and the specialist. Harmony \"Youth in a Primitive Society\"<br />\nThis is Debuskey's first trip of the<br />\nnow prevails between these two in<br />\nIs Subject of Talk<br />\nseason, as his studies at the Medical<br />\nthe discharge of their _respective<br />\nSchool have not permitted him to<br />\nfunctions, and both have legitimate \"Youth in a Primitive Society\"<br />\nmake any of the other trips with<br />\nfields to occupy in the profession. was the topic discussed by Roberta<br />\nthe group thus far. However, the<br />\nAims of Group Practice<br />\nWhite in Liberal Club meeting, Friteam<br />\nwill have its full strength in<br />\nGroup practice, Dr. Goldstein day, February 7. The talk was<br />\nthe lineup tomorrow afternoon and<br />\ntold his audience, is practice con- based on a book by Margaret Mead<br />\nare all set to give Army a good<br />\nducted by a number of specialists entitled, \"Coming<br />\nof Age in<br />\nwho seek to coordinate their knowlbattle.<br />\nSamoa, a Psychological Study of Plans Completefor<br />\nLast Callfor Senior<br />\nedge and experience. The physiTeam in Top Form<br />\nInterfraternity Ball<br />\nClass Dues Feb. 21 On the 25th of this month the<br />\ncians constituting such a group Primitive Youth for Western CiviliIt has been definitely decided to<br />\nThe Blue Jays should be in top<br />\nA final date has been set by R. Johns Hopkins<br />\npool their expenses and their in- zation.\" Miss White stated that in<br />\nGlee Club will<br />\nhold<br />\nthe<br />\nInter<br />\nMarch<br />\nfraternity<br />\nBall<br />\nL.<br />\nform,<br />\nas both Baltimore University<br />\nMcAll, senior class treasurer, journey to Washington to compete<br />\ncome, and by cooperative use of the United States adolescence has<br />\n7<br />\nat<br />\nthe<br />\nMaryland<br />\nCasualty<br />\nHall.<br />\nfor the payment of 1929 class with George Washington and and St. John's College were met<br />\nphysical equipment can so reduce come to be thought of as a time<br />\nBob Tula, in person, and a ten-piece dues. By Friday, February 21, he<br />\nsaving<br />\neffect<br />\na<br />\nto<br />\noverhead<br />\nas<br />\ntheir<br />\nCatholic University of that city. during the week. The team diswhen conflicts are inevitable. orchestra will furnish the music.<br />\nmust be in receipt of the full sum This competitive concert will be<br />\nfor their patients.<br />\nplayed good form in the game with<br />\nSchools and juvenile courts give This will be a closed dance. All of twenty-nine dollars from<br />\neach<br />\nheld<br />\nat<br />\nthe<br />\nNew<br />\nWillard<br />\nHotel.<br />\nBaltimore U. during the second<br />\nAs early as 1787 Dr. E. A. ample support to this view.<br />\nstray Greeks, however, may obtain member of graduating class. This<br />\nThe<br />\nrespective<br />\nmerits<br />\nof<br />\neach<br />\nof<br />\nhalf, after getting away to a weak<br />\nHolyake said that the joint efforts<br />\ntickets from either Herbert Rice or date is definite and failure of the<br />\nthe<br />\nthree<br />\nglee<br />\nthis<br />\nclubs<br />\nof<br />\nsection,<br />\nin the opening period, and<br />\nLack<br />\nof<br />\nFeeling<br />\nstart<br />\nof many men toward a certain<br />\nJohn Yellot for $1.00. Fraternity class to comply with the requirewhich<br />\nmeet<br />\nin<br />\nWashington,<br />\nwill<br />\nbe<br />\nmanaged to defeat the Maroons, 24objective might accomplish in a<br />\nIn order to test the truth of this alumni will be charged $2.00. Only ments by that time will mean the comparatively judged, and<br />\nthe group 20. Hopkins should be a good bit<br />\nfew years what could be imassumption, Margaret Mead spent those holding tickets will be ad- breaking of the Hullabaloo contract picked as the best of the three will<br />\nmore experienced due to the week's<br />\npracticable to a few men working<br />\nmitted, and these will be distributed and added expense.<br />\nbe given a trip to New York City activity, for, aside from the two imfor ages. Group practice is suc- sveral months studying the devel- through the various chapters of the<br />\nThe present fee has been placed to compete with 14 other colleges portant games played, George Darcessful in the South and West, the opment of adolescent girls in the fraternities on the board.<br />\nat twenty-nine dollars despite the from various sections of the coun- ley has been holding regular pracspeaker declared, but only partially Samoan Islands. Her conclusion is<br />\nfact that last year's dues were the try.<br />\ntice during which his proteges were<br />\nso in New England, while in Bal- that in this simple culture adolessame and the 1928 Hullabaloo<br />\ntaught several new plays in preparatimore there is no example of this cence is not a time of mental and<br />\nWinner to go to New York<br />\nPaul Spear Elected<br />\nnetted<br />\na<br />\nlarge<br />\nloss<br />\nwith<br />\ninsufficient<br />\ntion of tomorrow's conflict.<br />\npractice.<br />\nDebating President funds to meet it.<br />\nThis competitive glee club affair<br />\nemotional crisis. She asks, \"What<br />\nTherefore<br />\nit<br />\nis<br />\nAdvantages of System<br />\nPassarew Hurt<br />\nAt a meeting of the Debating imperative<br />\nwill take place at Carnegie Hall in<br />\naccounts for the lack of storm and<br />\nthat all seniors coCaptain Passarew, who suffered<br />\nNew York City. The chances for<br />\nThe principles essential to suc- stress in Samoa and its presence Council held last Monday, Paul W. operate with the<br />\nclass representathe Homewood group in Washing- an injury to his arm during the<br />\nSpear was elected president of the tives to the<br />\ncess in an undertaking of this<br />\nfullest<br />\nextent so that<br />\nin America?\" In answering this<br />\nCouncil. Dal Ghent, elecfed as all<br />\nton are exceedingly bright. Osmar Baltimore University game, is renature the doctor outlined as folprecautions might be taken for<br />\nSteinwald has been working hard ported to have recovered, and will<br />\nlows: Loyalty, unity of purpose, question two factors were stated as president last year, recently left the the reduction of<br />\nexpenses to the<br />\nfirst<br />\nof<br />\nsignificance.<br />\nIn<br />\nthe<br />\nbeing<br />\nwith the club since examinations in all probability be in the game toUniversity.<br />\nAt<br />\nthe<br />\nsame<br />\nmeeting<br />\nharmonious<br />\nliberal understanding,<br />\nminimum.<br />\nhave<br />\nbeen over. A group of twenty- morrow afternoon. Passarew, whose<br />\nwillinggeneral<br />\ncasualness<br />\nof<br />\nplace<br />\nis<br />\nthe<br />\nMr.<br />\nPaul<br />\nWheeler<br />\nofficially<br />\nwas<br />\nrelations, cooperative spirit,<br />\nTo<br />\nlessen<br />\nthe<br />\nsudden<br />\ndrain<br />\non<br />\neight<br />\nmen, consisting of the best presence in the Maroon conflict was<br />\nness to work for their avowed pro- Samoan society. Lack of deep feel- appointed coach of debating. Mr.<br />\nthe<br />\nstudents'<br />\nfinance<br />\naccounts,<br />\nR.<br />\nsingers in each of the sections of the undeniably of extreme importance,<br />\nfession, and the obtaining of men ing is a convention. No one cares Wheeler has been acting in this<br />\nof recognized position in their much for any one person. No one capacity during the past year, and L. McAll has arranged a partial Glee Club namely first and second returned in the second half of that<br />\nhis services have been very valuable payment plan which the students tenors and first and second basses game in spite of the accident which<br />\nsphere. Its advantages were sumhis convitions. The secfor<br />\nsuffers<br />\nmay take advantage of if they so has been chosen to represent the occurred during the first period. He<br />\nto the team.<br />\nmarized as including better service<br />\neliminates<br />\nconflict<br />\nfact<br />\nwhich<br />\nond<br />\nPlans were discussed for promot- desire. However it is paid, never- club in Washington. Coach Stein- was high point scorer in this tilt.<br />\nfor the public at less cost, incentive to thorough examination of the is the small number of choices pos- ing interest in debating. The sug- theless, the full account must be wald has assigned nearly all of the<br />\nArmy Strong<br />\npatient, strict limitation to the field sible to youth. There is only one gestion to create an office of busi- completed by next Friday. If any remaining time until the date of the<br />\nIt is not to be denied that the<br />\nof one's own specialty, familiarity religion and one standard of moral- ness manager whose function would individual fails to meet the sum by competition to rehearsals, as a speArmy<br />\nis quite correct in boasting<br />\nwith the best and most modern ity, in contrast with our country be to arrange debates and handle that date it will necessitate the cial song for the contest must be of a<br />\nstrong<br />\nquintet, for their's is a<br />\nequipment, freedom from business which boasts dozens of sects and the finances was put forward. No omitting of his picture and write- learned. This song is a particularly<br />\npowerful<br />\nteam,<br />\nand one to be<br />\nup from the Hullabaloo.<br />\ndifficult one.<br />\ndetails, saving in time through dozens of standards, all clamouring definite action was taken.<br />\nreckoned with with much sagacity<br />\nR. L. Hall wishes to make a perThe team to represent Hopkins<br />\ngreater regularity of hours, pos- for support.<br />\nSpecial Group<br />\nin intercollegiate basketball circles.<br />\nsibility of vacations without loss of<br />\nagainst Colgate on February 20 sonal appeal to all members of the<br />\nThe picked group of twenty- This holds true especially in games<br />\nEnvironment<br />\nincomes to the doctors, payment of<br />\nwas partially selected. Paul Spear senior class for its sincere enthueight men will represent the club in played on their home court, for it<br />\nexpenses on research trips, pension \"The Samoan method of life pro- and Leo Alpert will definitely siasm and cooperation, not only for<br />\nWashington, and if victorious in is there that the team reaches its<br />\nfund, and group insurance for the duces no neuroses,\" Miss White speak. The third man will probably the benefit of the class itself but<br />\nNew York, however, this does not maximum efficiency and many powphysicians' families, whereby a stated. \"The early environment be either Robert Kyle or John for the individuals as well.<br />\nmean<br />\nthat the remaining members erful teams have reached their doom<br />\nThe treasurer will be in the lobby<br />\nwidow receives the money raised of the Samoan child favors nervous Wheeler. The subject of this<br />\nof<br />\nthe<br />\nclub are to be dropped, for on the West Point floor.<br />\nby the sale of her deceased hus- stability. Father and mother fixa- debate will be: Resolved, that the of Levering Hall every lunch hour<br />\nthey will participate in the remainArmy should be playing good<br />\nband's place in a group clinic.<br />\ntions are eliminated since each nations of the world adopt a plan from twelve-thirty to one o'clock, ing concerts as well as the Home basketball, too, at this point of the<br />\nDisadvantages<br />\nchild is cared for by several of its of complete disarmament excepting until the aforementioned date for Concert.<br />\nseason. Early in the week the<br />\nsuch forces as are needed for police the receiving of payments.<br />\nThe disadvantages of this system adult relatives and hardly distinCadet five swamped Amherst, 42Home Concert February 21<br />\npurposes.<br />\nwere said to be that it is too guishes its parents from its aunts<br />\n25. However, the Jays will be out<br />\nThe Home Concert will be held in full strength to make it hot for<br />\nmechanical, that it commercializes and uncles. Children are free to<br />\nGraduates<br />\nto<br />\nHold<br />\nwhenever<br />\nthey<br />\nresidence<br />\nchange<br />\nclannishness<br />\ndevelops<br />\non<br />\nFebruary 21 at the Maryland the West Pointers tomorrow aftermedicine,<br />\nNotice<br />\nTea<br />\nDance<br />\nThursday<br />\nany<br />\nof<br />\nhome<br />\nto<br />\nthe<br />\nmoving<br />\nwish,<br />\nclinic,<br />\ngiven<br />\nCasualty Auditorium. Tickets are noon, although the latter will be<br />\namong members of a<br />\nA mid-year call for candidates to<br />\nThe Graduates' Club of the now on sale in the lobby of Leverand destroys the family physician. relative.\"<br />\nheavy favorites. The line-up will<br />\nthe editorial and business staffs of Johns Hopkins University will hold ing Hall between 12 and 1 o'clock,<br />\nThe attitude • toward birth, and<br />\nState medicine, Dr. Goldstein<br />\nprobably be as follows:<br />\nanother of its periodical tea-dances and also at the postoffice.<br />\nasserted, came under political con- sex were also mentioned as prevent- the NEWS-LETTER is being issued.<br />\non Thursday, February the 20th.<br />\nArmy<br />\nHopkins<br />\ntrol and tended to develop medi- ing maladjustment. Children are al- There is an excellent opportunity<br />\nConcert Tonight<br />\nThe affair is to take place at<br />\nKreuger<br />\nR.<br />\nF.<br />\nSiegel<br />\nocrity in the profession. Under lowed to witness births, deaths, and for election open to all candidates.<br />\nLevering Hall between the hours<br />\nStrother<br />\nF.<br />\nL.<br />\nThere<br />\nwill<br />\nbe a concert of the<br />\nStude<br />\nthis plan doctors are assigned to sex acts. They are protected from All those interested will meet in the<br />\nof 4.30 P. M. to 6.30 P. M. All Combined Music Clubs tonight in Blanning<br />\nC.<br />\nDebuskey<br />\ndistricts which they serve without the emotional shock which such ex- NEWS-LETTER office in Levering<br />\ngraduate students and the faculty the Zion Church, located at City Steelier<br />\nR.G.<br />\nPassarew<br />\ncharge and for which they receive periences would give our children<br />\nare<br />\nattend.<br />\ninvited<br />\nto<br />\nHall<br />\nat<br />\n12.30.<br />\nHall<br />\nPlaza,<br />\nAbel<br />\nat<br />\n8.15<br />\np.<br />\nm.<br />\nL.G.<br />\nWhite.<br />\n(Continued<br />\non<br />\npage<br />\n3, col. 1)<br />\n(Continued on page 4, col. 3)<br /><br />\nLIBERAL CLUB HOLDS<br />\nWEEKLY MEETING<br /><br />\nGLEE CLUB ENTERS<br />\nNATIONAL TOURNEY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br /><br />\n2<br /><br />\nPresident Comfort of Haverford College has indeed proven a<br />\ncomfort for the yearlings of his institution. Terming the annual cakeFOUNDED 1897<br />\nWe notice by the \\Vesleyan Ad- walk that the frosh are obliged to<br />\na disgrace to the college<br />\nSubscription<br />\n$2.00 vance of Kansas Wesleyan College undergo<br />\nit for \"making a<br />\nand<br />\ncondemning<br />\nthat the Kappa Delta Alpha FraterEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore,<br />\npig-pen out of Roberts Hall,\" Presnity house was robbed. The theives<br />\nMd., under the Act of Congress November 3, 1879.<br />\nident Comfort has declared that the<br />\ntook about $75. Well, some frater- cake-walk will have to go the way<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nnity houses appear to contain of all flesh, the Kiwi; and (acUniversity.<br />\nmoney but we do not think that cording to the California Daily<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, around Baltimore robbin fraterni- Bruin) the absent-minded college<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-4N•CHIEF.<br />\nties would prove particularly fruit- professor. The place of the preand<br />\nscribed form of hazing is to be<br />\nful. It might also be noticed that<br />\ntaken by a formal dramatic presenUniversity 0100<br />\nTelephone<br />\n$40 of the money stolen was taken tation or musical comedy presented<br />\nfrom a guest. That sounds a little by the unfledged yearlings.<br />\nEDITORIAL DEPARTMENT<br />\nmore reasonable.<br />\n***<br />\nEditor-in-Chief<br />\nfor<br />\n*<br />\n*<br />\n*<br />\nThe Villanovan, official torch of<br />\nGEORGE GUMP,'30<br />\nBilly Arthur has started out to the Villanova College, makes an<br />\nManaging Editor<br />\nprove that size has nothing what- amazing theological find:<br />\nROBERT S. BAIRD, '30<br />\never to do with intellectual powers. \"It certainly is funny that the<br />\nAssistant and Managing Editor<br />\nchapel always has more of a student<br />\nBilly is just 36 inches tall and is a<br />\nGEORGE DOWELL, '31<br />\ncongregation during the time of<br />\nstudent at North Carolina Univer- exams than at any other time of the<br />\nAssociate Editors<br />\ncity. So far it is said that he is prov- year.\"<br />\n18 and 20 E. Baltimore Street<br />\nPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\n* * *<br />\ning his point very capably.<br />\nJunior Editors<br />\nDr. P. S. Barto of the Carnegie<br />\n***<br />\nPURNELL HALL,'30<br />\n'30<br />\nSMITH,<br />\nL.<br />\nSTEWART<br />\nof Technology, according<br />\nInstitute<br />\npast<br />\nthe<br />\nin<br />\nUniversity<br />\nAt Duke<br />\nHARWOOD F. MuLumx,JR.,'30 ROWLAND MuD. Nx.ss, '32<br />\nof that college, is<br />\nto<br />\nthe<br />\nTartan<br />\n'32<br />\nHARRIS,<br />\nM.<br />\nNATHAN<br />\nFRANS CONE, 31<br />\ntwo years $12,000,000 have been<br />\nSYLVAN LEBOW, '32<br />\nGEORGE TRATTNER,'30<br />\nfor the purpose of<br />\nOhio<br />\ntouring<br />\nDONALD PRocroR, '33<br />\nspent on a building program. It is<br />\nHAROLD YUDKIN, '32<br />\ninterviewing principals of the Ohio<br />\nHERBERT FRIEDBERG, '33<br />\nFULTAN GRUVER, '32<br />\nstated that this program is the larg- high schools. Barto's chief concern<br />\nRICHARD HUNT,'31<br />\nTHE TAILORED SHOE<br />\nest ever projected by any univer- is the regulation of studies in the<br />\nBUSINESS DEPARTMENT<br />\nMoccasin Comfort-100 per cent Flexible Sole<br />\nsity. The library at Duke has a lower schools to conform to the<br />\nChoice Styles in Finest Leathers<br />\nBusiness Manager<br />\n1,000,000-volume capacity. Well requisites for entrance to Carnegie.<br />\nGus BURK, '31<br />\nPopular Prices<br />\nHopkins may be going a bit slower He hopes, through the cooperation<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nbut we may get there yet. Our only of principals, to inculcate into the<br />\nSold by BLAKE, Hopkins Man<br />\nLYLE GULLEY, '30<br />\nSADLER ROBERTSON, '31<br />\nfear is that the undergraduate high school curriculum subjects<br />\nCall Vernon 1650 any evening after 5 P. M.<br />\nOffice Manager<br />\nschool may be driven out while the which are vital for matriculation<br />\nand to eliminate others of lesser imAim); BLum,'30<br />\nbuildings are growing up.<br />\nportance. If this project proves<br />\n* * *<br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br />\nHenry V. Saunders, '32<br />\nSIDNEY RAFKL, '31<br />\nit will tend to better the<br />\nsuccessful,<br />\nTheodore Fleishman, '31<br />\nAccording to the B. P. I. Signal,<br />\nNTURY CAB CO.<br />\nDavid S. Sykes, '32<br />\ncase of lower classmen who seem<br />\n1718 N. CHARLES STREET<br />\nGEORGE W. LAMONT, '32<br />\ngirls' tennis team is being orto be distressed at this time with<br />\nVERNON 7002<br />\nanized at that school. The girls<br />\nWe are promoting the cab business from an expensive luxury<br />\nup<br />\nof<br />\nrequired<br />\nthe<br />\nmaking<br />\nburden<br />\nteam and<br />\nto an economical necessity<br />\nProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. lave fully organized the<br />\ncourses.<br />\nvice-president,<br />\n1 lected a president,<br />\n* * *<br />\necretary, and treasurer. There ap.<br />\nThe<br />\n,<br />\nplan that Carnegie is at1 ears to be something missing here,<br />\nto inaugurate is one that<br />\ntempting<br />\ns we were of the opinion that an<br />\nwas<br />\nin Maryland and other<br />\nadopted<br />\nthletic team usually had a capsome<br />\nyears ago. It has,<br />\nStates<br />\nquite<br />\nain and manager. However, we<br />\nof<br />\ncourse,<br />\nproven<br />\nquite successful.<br />\nuppose after the social organizaif<br />\nHowever,<br />\nat Carnegie<br />\nprincipals<br />\ntion the tennis side of it will come<br />\nTHE BARNSTORMERS' PLAY<br />\nand<br />\nobstinate<br />\nare<br />\nas<br />\neccentric<br />\nas<br />\nIater.<br />\nthey are in Baltimore, Dr. Barto<br />\nHE Barnstormers are to be congratulated on their choice of their<br />\n* * *<br />\nannual play. \"If I were King,\" by Justin Huntly McCarthy, should<br />\nIn a lecture to a class of men and has quite a task ahead of him. The<br />\nproduction.<br />\namateur<br />\nhigh-class<br />\nfor<br />\nvehicle<br />\nideal<br />\nan<br />\nprove<br />\n-, omen, Dr. Landrith, at Ward wisest thing to do is to make a<br />\n] elmont College, said • that she moral issue out of it.<br />\nIt is an essential of successful amateur plays that they should be<br />\n1 -ould advise girls to smoke pipes<br />\nlight. Melodramatic acting tends to become ridiculous in the hands of<br />\nany<br />\nby<br />\nhandled<br />\nwhen<br />\nsting<br />\ntheir<br />\n..cThe said that if they were trying to<br />\nlose<br />\namateurs and tense situations<br />\nparticularly,<br />\nBarnstormers,<br />\nThe<br />\nI e masculine they might just as<br />\nbut the most experienced of dramatists.<br />\nplay<br />\nmen<br />\nthat<br />\nreason<br />\nthe<br />\nN ell go the limit. As it is now men<br />\nshould not attempt very serious drama for<br />\nthe<br />\nto<br />\nitself<br />\nI ave to carry cigarettes to please<br />\nthe female parts, a situation that does not readily lend<br />\nhave<br />\ntheir girls. It looks like now we'll<br />\nintense type of play. However, the Barnstormers in previous years<br />\nI ave to carry pipes, pipe tobacco,<br />\nplaced too much weight on the other side of the balance; their plays<br />\na nd all the accessories. If girls must<br />\n'have been much too light. \"The Dictator\" and \"The Champion,\" for<br />\nt e masculine why don't they wear<br />\nexample, were hardly more than farces.<br />\nf ockets to carry some of their<br />\nAn interesting point in regard to dramatics is that tragedy and farce<br />\nthings in.<br />\nare the two most difficult types of play to produce. The Barnstormer<br />\nIn the Minnesota Daily the stateplays in the past few years have bordered so closely upon farce that<br />\n'Were<br />\nI<br />\n\"If<br />\nis found that kissing a cow<br />\nlent<br />\n;<br />\nIn<br />\nunobservable.<br />\nalmost<br />\ntimes<br />\nat<br />\nthe distinction was<br />\nfarce,<br />\non<br />\nthan kissing a co-ed. It<br />\nborder<br />\nnot<br />\nsafer<br />\nwill<br />\n•<br />\nthat<br />\ni<br />\nplay<br />\na<br />\nKing,\" the 'Stormers have chosen<br />\nbest<br />\nthe<br />\nis<br />\nthere are practically no<br />\nplay<br />\nthat<br />\na<br />\nSuch<br />\nays<br />\ns<br />\nyet will not require intensely emotional acting.<br />\nthe lips of a cow in<br />\non<br />\nI acteria<br />\nmedium for college dramatists.<br />\nComparison to the reddened lips<br />\naf some co-eds. However, it is the<br />\nVARSITY SEALS<br />\n6eneral opinion • that it should be<br />\nreferable to be attacked by a<br />\nthe end of this month, the Student Activities Council, actZ.<br />\nea th. 1,..,Ac es; 41. crorirsste nr4;xritirrsc<br />\n...,-Inf.'<br />\nacteria than a cow.<br />\nwill award Varsity Seals to deserving seniors.<br />\n***<br />\nWe believe that the Seals have been distributed too freely in the<br />\nProfessor Maurice Fitzgibbons<br />\npast. Every honor that may be won by college men is prized in direct<br />\nare<br />\nthat<br />\nSeals<br />\nmore<br />\nThe<br />\nit.<br />\nattaining<br />\nLafayette College thrilled a recof<br />\nof<br />\ndifficulty<br />\nproportion to the<br />\ngiven, the less they are regarded. The number of Varsity Seals awarded<br />\nord audience at the Little Theatre<br />\nshould vary slightly from year to year, inasmuch as there are more<br />\nin Easton, Pa., last week by giving<br />\ndeserving men in some classes than in others. But the number of Seals<br />\na spectacular demonstration of<br />\nshould not vary directly with the number of seniors on staffs of activihypnotism, mesmerism, and postties. In other words, mere membership on a staff should not entitle a<br />\nhypnotic suggestion. His assistants<br />\nman to wear the Varsity Seal.<br />\nwere students of the college. The<br />\nextrain<br />\nmerit<br />\nrecognizing<br />\nof<br />\npurpose<br />\nThe Seal is awarded for the<br />\nprofessor caused the limbs of some<br />\ncurricular activities. It differs from 0. D. K. merely because the latter<br />\ndemands distinction in several branches, the former in only one. Just<br />\nof his patients to become as stiff<br />\nas 0. D. K. does not confer membership upon a man because he has<br />\nas iron and made the blood to leave<br />\nmerely been connected with three or four activities during his college<br />\nthe arms of another. In addition,<br />\nlife, so the Student Activities Council should not bestow the Varsity<br />\nhe alternately made one subject imSeal on any man purely because his name has appeared on some staff<br />\nto pain, made him perspire,<br />\nmune<br />\nlist for three years.<br />\nIU ST because your friends arose a little<br />\nand then to start to freeze. Some<br />\nearlier in the morning there's no reason<br />\nThe heads of activities should not recommend any man for a Varsity<br />\nwhy you shouldn't get there at the same time.<br />\nstudents were hypnotized so as to<br />\nSeal unless he has worked diligently and well for three years. If this<br />\nStop at the AMOCO-GAS Pump..then watch<br />\nis done, the regard for the Seal will be tremendously increased. Many<br />\nimagine themselves girls and to act<br />\nthat car of yours turn into a fleeting ghost of<br />\nmen at Hopkins try out for an activity in their freshman year, do just<br />\naccordingly. As an example of postthe highway -- alive, alert,'a-tingle, to get goenough work to be elected to the staff and then dawdle through the<br />\nhypnotic suggestion, a subject was<br />\ning and keep going! You'll eat away that<br />\nnext two years with just enough effort to keep from being dismissed<br />\nmade to act as if he were suffering<br />\nhead-start so swiftly, so smoothly, so surely<br />\nfrom the staff. Then when they become seniors they are gravely<br />\nthat it will end in a head finish--with your<br />\nThis<br />\ninsanity.<br />\nof<br />\na<br />\nmild<br />\nfrom<br />\ncase<br />\nservice.\"<br />\nof<br />\n\"in<br />\nrecognition<br />\nCouncil<br />\nfrom<br />\nthe<br />\nVarsity<br />\nSeal<br />\na<br />\nbranded<br />\ncar aheacl! Put it up to AMOCO-GAS--today,<br />\nIt is much the same situation as would be evident were the A. A.<br />\nexhibition of applied psychology<br />\ntomorrow, every day in the year.<br />\nBoard to award the major \"H\" to every senior who attended two or<br />\nwas pronounced by its spectators to<br />\n95i AMERICAN OIL COMPANY<br />\nthree football practices each year for three years. The \"H\" would<br />\nbe even more interesting than a<br />\nAffiliated with the Pan American Petroleum 6 Transport Co<br />\nthen mean as 1ittle-2s. the Varsity Seal is going to mean if the Student<br />\nGeneral Offices. Baltimore, Md.<br />\nby<br />\ngiven<br />\ndemonstration<br />\nProsimilar<br />\nawarding<br />\na<br />\ncall<br />\ndoes<br />\nhalt<br />\nnot<br />\non<br />\nindiscriminate<br />\nCouncil<br />\nthe<br />\nActivities<br />\nyear.<br />\nfessor Fitzgibbons last<br />\nof Seals.<br /><br />\nTHE MIESHOPKINS NEWSLETTER<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nWarner &amp; Company<br />\n•<br />\nHats<br />\nClothing<br /><br />\nFurnishings<br /><br />\nGentlemen<br />\n•<br /><br />\nJust Reached Hopkins!<br /><br />\nEDITORIALS<br /><br />\n;<br />\n;<br />\ni<br />\n5<br /><br />\nAfter the Dance<br /><br />\nS1F.<br /><br />\nT<br /><br />\nII?I[CIIS<br /><br />\n8 5-17 North Charles Street<br /><br />\nive uead startmand<br />\nisvit a<br />\nOCO-Gas<br />\ngill it<br /><br />\nr ifl10<br /><br />\nBEFORE<br />\n•41 e\".<br /><br />\nI,41<br /><br />\nt<br /><br />\n.I,,ff<br /><br />\n.-,rt,er%<br /><br />\n7<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br />\nTo Editor of THE NEWS-LETTER.<br />\nCOTILLION CLUB<br />\nANNOUNCES DANCE<br />\nThe Cotillion Board wishes<br />\nto announce that it will hold<br />\na dance in Levering Hall tomorrow night from 9 'til 12.<br />\nThe price of admission will<br />\nbe $1.00 stag or couple. The<br />\nmusic will be furnished by the<br />\nusual orchestra and, as at past<br />\nSaturday night dances, a door<br />\nprize will be given.<br />\nThese dances have been<br />\nrather will attended this year<br />\nand the Board in charge of<br />\nthe dances, hopes that the students will continue to put in<br />\ntheir appearance and make the<br />\naffairs a success.<br /><br />\n- THE MAIL BAG<br />\nThe NEWS-LETTER wishes to<br />\nstate that the opinions manifested<br />\nin this column are those of the<br />\nstudent body and not of this publication. All letters must be signed,<br />\nhut the signatures will not be published unless so desired.<br /><br />\nLIBERAL CLUB<br />\n(Continued from page 1, col. 2)<br /><br />\nby the attitude of the adults, who<br />\naccept these facts of life as naturally as we accept eating and drinking.<br />\n\"In Samoa there is no secrecy or<br />\nignorance, no guilty knowledge or<br />\nhalf-truths. Enough of such experiences enter a child's life to give<br />\nhim the proper perspective. Complete knowledge puts sex at its true<br />\nvalue.<br />\n\"We cannot change the conditions of our society which make<br />\nfor conflict,\" Miss• White concluded, \"but we can train our children for the choices which confront them. They must be taught<br />\nnot what to think, but how to<br />\nthink.\"<br /><br />\nLord<br />\nBaltimore<br />\nHotel<br />\nwith its beautiful<br /><br />\nCalvert<br />\nBall Room<br />\nand many other private<br />\nrooms offers<br />\nSPECIAL INDUCEMENTS<br />\nto<br /><br />\nCOLLEGE AFFAIRS<br /><br />\nDear Sir:<br />\nWhat's the cause of \"F.G.S.'s\"<br />\ndyspeptic tirade against graduate<br />\nstudents? Did one of his instructors<br />\nfail to credit him with a passing<br />\nmark or did he just want to break<br />\ninto print? Poor boy, he might as<br />\nwell try to stop Niagara Falls by<br />\nwhistling at it. \"Ben\" in his poorest days was more vitrolic. I humbly suggest that F.G.S. look into<br />\nthe NEWS-LETTER files Of last year<br />\nand learn what destructive criticism<br />\ncan really achieve.<br />\nWith sympathetic encouragement.<br />\nGrotius.<br /><br />\nTo Editor Of THE NEWS-LETTER:<br />\nIn a contemporary issue of THE<br />\nNEWS-LETTER, my resignation from<br />\nthe position of secretary to the Debating Council, will be noticed. This<br />\nresignation calls for an explanation.<br />\nIn the first place, I bear no animosity to the new president of the<br />\ncouncil, Paul Spear.<br />\nThe Johns Hopkins Debating<br />\nCouncil is a rotten affair, it is putri- First Half of Bowling<br />\nTournament Completed<br />\ntied both within, and without. It is<br />\nTwo<br />\nmatches were completed in<br />\nin name, representative of oratoriStudent Bowling<br />\nGraduate<br />\nthe<br />\ncal interests in this University; but<br />\nlast<br />\nTuesday<br />\nafternoon. In<br />\nLeague<br />\nit merely serves as a means for certhe<br />\nfirst<br />\ndivision<br />\nthe<br />\nclassical team<br />\ntain individuals to obtain easy<br />\ndefeated<br />\nthe<br />\nFaculty<br />\nrepresentaawards from the Adams fund, and<br />\ntives with the encouragement of<br />\ndebating trips.<br />\ntheir<br />\nusual contingent of fair rootto<br />\nsupposed<br />\nteams<br />\nare<br />\nDebating<br />\nThe<br />\nEnglish Department team<br />\ners.<br />\nUniverof<br />\nthe<br />\ncream<br />\nrepresent the<br />\nfailed<br />\nto<br />\nappear for the match<br />\nfew<br />\nsity, yet they are picked from a<br />\nthe Political Econscheduled<br />\nwith<br />\nbenumbed individuals who imagine<br />\nfour.<br />\nomy<br />\nthemselves orators. Members of the<br />\nThe Political Scientists retained<br />\nUniversity proper who have been<br />\ntheir<br />\nlead in the second division,<br />\nwilling to show forensic interest<br />\nwinning<br />\ntwo straight games from<br />\nhave had their efforts stifled and<br />\nconsequently no longer come to try- the Geologists for their third victory. Half the schedule has been<br />\nouts.<br />\ncompleted. Each team meets each<br />\nyear<br />\nwas<br />\nthis<br />\nThe Adams contest<br />\nother team in its division twice;<br />\ndeliberately<br />\nslept<br />\na farce, one judge<br />\nthe<br />\nwinners of the divisional conthrough the debate, and the ballot<br />\ntests<br />\nmeet in a final match for the<br />\nbox was then stuffed by overeager<br />\nchampionship.<br />\njuniors. The team for the Colgate<br />\ndebate, was picked by Mr. Wheeler,<br />\nwithout the least regard for the<br />\nA. S. C. E. and A. S. M.E.<br />\nstudent body.<br />\nHold Joint Meeting<br />\nthings:<br />\nGive<br />\nthese<br />\ndo<br />\nnot<br />\nWhy<br />\nLast<br />\nnight<br />\nthe American Society<br />\ncomplithe<br />\nSeniors<br />\nfour or five<br />\nCivil<br />\nEngineers<br />\nand the Ameriof<br />\ncouncil<br />\nas<br />\nthe<br />\nmentary graft from<br />\ncan<br />\nSociety<br />\nof<br />\nMechanical<br />\nEngiorthe<br />\nturn<br />\ngifts each year, and<br />\nneers<br />\nheld<br />\na<br />\njoint<br />\nmeeting<br />\nat<br />\n8.15<br />\nganization over to Mr. Wheeler to<br />\np.<br />\nm.<br />\nin<br />\nthe<br />\nEngineers<br />\nClub,<br />\n6<br />\npractise<br />\nbe used for the benefit and<br />\nWest<br />\nFayette<br />\nstreet.<br />\nMr.<br />\nLessiter<br />\nf his debating classes. Perhaps<br />\nsome more of these individuals will E. Millburn, the vice-president and<br />\nbe able to violate every rule of ora- chief engineer of the Glen L. Martory under the pretense of fighting tin Company was the speaker. He<br />\nfor their Alma Mater. And, then, is considered quite an authority on<br />\ntoo, don't forget that the Debating his subject which was \"Today in<br />\nCouncil is the softest activity on the Aviaton.\" This timely talk was not<br />\ncampus, to receive both financial only instructive but very interesting. Refreshments were served at<br />\nand personal gain from.<br />\nthe close of the lecture. The meetSincerely,<br />\ning<br />\nwas presided over by F. A. AllHarold B. Yudkin.<br />\nner,<br />\nthe chairman of the American<br />\nFeb. 10, 1930.<br />\nSociety of Mechanical Engineers.<br /><br />\nCONVERTIBLE<br /><br />\nCONVERTIBLE<br /><br />\nFOR DESK<br /><br />\nTAKE OFF THE CAP<br />\nPUT ON THE PEN TAPER<br /><br />\nFOR POCKET<br /><br />\nTAKE OFF THE TAPER<br />\nPUT ON THE POCKET CAP<br /><br />\n1<br /><br />\nLIKE TWO PENS<br />\nfor the Price of One<br />\na Pocket Penfor Classroom Notes, and a Desk Penfor Your Room<br />\n—Guaranteed for Life!<br />\nIf you buy a Parker Pocket Duofold you now can<br />\nhave a Desk Set without buying a second pen. Or if<br />\nyou buy a Parker Duofold Desk Set you also now<br />\nreceive a Duofold Pocket Pen guaranteed for life.<br />\nEither way,you save the price of a second pen —$5,<br />\n$7 or $10,according to the model.<br />\nBy adding a tapered end,you convert your Duofold<br />\nPocket Pen to a Desk Pen in 10 seconds. By removing the taper and putting on the Pocket Cap<br />\nyou restore it to a Pocket Duofold on leaving office<br />\nor home.<br />\nThus every owner of a Parker<br />\nPocketPen owns halfaDesk Set.<br />\nGetting a Desk Base completes<br />\nit. We now include pen taper<br />\nfree with that.<br />\nStreamlinedshape,sets low in pockgt<br />\n—greaterink capacity than average,<br />\nsizeforsise—Non-breakable Barrels<br />\nof Jewel-like, Colorful Permanite.<br />\nSuper-smooth, hand-ground points.<br /><br />\nPencils to match,$3.25 to $5<br /><br />\nAnd to every buyer of a Parker Desk Set,we now<br />\ngive a Pocket Cap with Clip. Thus his Desk Pen is<br />\nalso a Pocket Pen—like2Pensfor the price ofone Set.<br />\nBe sure to ask forthePocket Cap with yourDeskSet.<br />\nParker's new streamlined Duofold Pens(and Pencils to match) set lower in the pocket than others<br />\nbecause the clip starts atthe top—not halfway down<br />\nthe cap. This smart,balanced shape feels\"at home\"<br />\nin the hand—and writes with our famous 47th<br />\nimprovement — Pressureless Touch.<br />\nGo see this revolutionary<br />\nConvertible Duofold at any nearby pen counter.<br /><br />\nar er<br /><br />\nTHE PARKER PEN CO.,Janesville,Wis.<br />\nOffices and Subsidiaries: New York.<br />\nChicago, Atlanta, Buffalo, Dallas, San<br />\nFrancisco; Toronto, Can.; London, Eng.<br /><br />\nDuofold<br /><br />\nConvertible<br />\nfor Pocket .for Desk<br /><br />\n$5 $7 $10<br /><br />\nPEN GUARANTEED FOR LIFE<br /><br />\nz‘ti<br /><br />\ntv.;<br />\n•eti<br />\n.q1.5.4••147441A<br /><br />\n•'<br />\n\",<br /><br />\n04-• -,<br />\n-.4<br />\n\"\":•••Z4<br /><br />\nS<br /><br />\n,<br />\n•<br /><br />\n4fi<br />\n414<br />\n0,N.<br /><br />\n,Fe<br /><br />\n.3dEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br /><br />\nJ. A. RITTER &amp; SON<br />\nFlorist's and Decorators<br />\n1918<br /><br />\nBALTIMORE, MD.<br /><br />\nNORTH CHARLES ST., Near 20TH<br />\nPhone: VErnon 0673<br /><br />\nA Few Remarks<br />\nthat others have made about<br /><br />\nArt In Baltimore:<br />\nMONUMENTS AND MEMORIALS<br /><br />\nCharles Carroll Club<br />\nHolds Meeting<br />\nLast Sunday at 2.30 the Charles<br />\nCarroll Club held a meeting in 104<br />\nPhysics Building. This meeting<br />\nwas supposed to have been held<br />\nFebruary 2 but was postponed, because of examinations, to the aforementioned date.<br />\nDom Adrian Weld-Blundell, 0.<br />\nS. B., Chaplain, gave an interesting<br />\ntalk on \"The Origin of the Bible.\"<br />\nThis was one of a series of talks<br />\nto be delivered every Sunday to the<br />\nCarroll Club, everyone is invited to<br />\nattenld it.<br /><br />\nby WILLIAM SENER RUSK<br />\nProfessor of the History of Art, Wells College<br />\nA guidebook to nearly 200 of Baltimore's monuments, describing and giving the<br />\nhistory of each. New Bi-Centennial Revised Edition, illustrated, $1.50.<br />\n\". .. MONUMENTS and MEMORIALS should do much to open the eyes of<br />\nthe people of Baltimore to the value of the sculpture constantly before them and<br />\nto a greater realization of the position which this city has held, both in appreciation<br />\nand in production in the field of sculpture, ever since the days of William Rinehart.\"—Baltimore Bulletin of Education.<br />\n\"I find the text complete and accurate. Such a volume fills a need long existing<br />\nin Baltimore. It should help reveal Baltimore's art to Baltimoreans.\"—Professor<br />\nDavid M. Robinson, Vickers Professor of Classical Archaeology, Johns HoPkins<br />\nUniversity.<br />\n'<br /><br />\nVA<br /><br />\nTHE NORMAN, REMINGTON CO.<br />\nUPTOWN<br /><br />\nDOWNTOWN<br /><br />\n1118 N. Charles St.<br /><br />\n347 N. Charles St.<br /><br />\nGEOLOGY SOCCER CLUB<br />\nISSUES CHALLENGE<br />\nA challenge has been issued by the Soccer Club of<br />\nthe Geology department to<br />\nother teams composed of<br />\ngraduate students and faculty<br />\nmembers. The Geology department's team is captained<br />\nby Dr. J. T. Singewald, Jr.,<br />\nand is managed by Brinton<br />\nStone. Any department wishing to accept the challenge<br />\nshould communicate with<br />\nStone. Teams may be composed of less than the twelve<br />\nrequired for a full team, but<br />\nonly graduate students and<br />\nfaculty members may participate.<br /><br />\n... and that holds for careers, too!<br />\n00K where you are going. It's<br />\na method that gets the hockey<br />\nplayer through —and a business man<br />\non the way to success. The fellow<br />\nwho scores consistently is the one who<br />\npicks his course.<br />\nYet many a man comes out of<br />\ncollege, eager to make a name<br />\nfor himself in business, who has<br /><br />\nSINCE<br /><br />\n1382<br /><br />\nfailed to look where he is going —<br />\nwho has no definite goal in sight.<br />\nWhile you're still in college, study<br />\nyourself above all else—analyze your<br />\ninterests and capabilities. Get all the<br />\nhelp and advice you can from<br />\nsl your faculty adviser. Pick the<br />\nkind of work you'll like best.<br />\nAnd after graduation — go to it!<br /><br />\nMANUFACTURERS<br /><br />\nFOR<br /><br />\nTHE<br /><br />\nBELL<br /><br />\nSYSTEM<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 14, 1930<br /><br />\nBARNSTORMERS DECIDE TO USE GIRLS FOR<br />\nFEMININE ROLES AFTER PRESENT SEASON<br />\nThe recent Barnstormer productions were no doubt likely to produce a bit of skepticism as to the<br />\nfuture employment of male interpretation of female roles. Moreover this skepticism was no doubt<br />\nlegally conceived, for it seems that<br />\nthe Barnstormers are actually about<br />\nt amputate that leg of their dramatic anatomy in the use of girls in the<br />\nfemale parts of their forthcoming<br />\nproduction, \"If I were King.\"<br />\nWhether or not the surgical dicctions emanated from exterior or<br />\ninterior sources, is not our pleasure<br />\nto discuss at this time. But the fact<br />\nmains that it is a gesture so<br />\nsagacious that it is quite alien to<br />\nthe usual practices of the various<br />\ndepartments of Hopkins' student<br />\nactivities. It represents a willingness<br />\nto entertain beneficial innovation no<br />\nmatter how radical it may be. Drastis renovations could well be made<br />\nin most any student activity on the<br />\ncampus from the mild instance of<br />\nthe Debating Club to the flagrant<br />\none of the Blue Jay. Yet as far as<br />\nmay be seen the general attitude is<br />\none that has maintained a noxious<br />\nindifference to defects most. gross<br />\nin their conspicuity. Hence, the<br />\nBlue Jay, the Y. M. C. A., the football team, the swimming team,<br />\nthe Debating Club and others, perhaps, are involved in a turmoil too<br />\nmuch like clean-cut comedy to be<br />\nable to guard against a future<br />\nabolishment of all activities that<br />\nmust surely come at the present<br />\npace.<br />\nThe dramatic institution that the<br /><br />\nBarnstormer's propose to displace<br />\nis one of not recent antiquation.<br />\nWhen the American Coquette decided to lay aside her bustle and go<br />\nin for college and emancipation, the<br />\ncollege female impersonator began<br />\nto be regarded not only as counterfeit, but as immoral. College boys<br />\nseemed to prefer the promising<br />\nbulge of the coed to the unconvincing pads of the impersonator. Kissing a rough beard on play night,<br />\ncollege heroes discovered, was nothing like necking an affable coed<br />\nduring rehearsals. And so the custom that has persisted at Hopkins<br />\nand several colleges has been placed<br />\namong the moth balls by the dramatic cliques of. Most others.<br />\nTentatively, the Barnstormers<br />\npropose to recruit actresses from the<br />\nCollege for Teachers. This, however, is a singularly dubious task<br />\nthey have set for themselves. As<br />\nyet, we have failed to encounter a<br />\ncoed from the Teachers' College<br />\nwho didn't look just like a coed from<br />\nthe Teachers' College. Hopkins obviously has not been endowed with<br />\nbeautiful girls nor is there any evidence that it has or will give birth<br />\nto passable actresses.<br />\nOne can always appreciate a<br />\nhandsome girl who is a good<br />\nactress. One can even appreciate a<br />\nhandsome girl who isn't a good actress. Girls, however, who have<br />\nneither of these qualities should not<br />\nbecome actresses unless they can<br />\nalso become the mistress of the local dramatic critic.<br />\nH.L.F.<br /><br />\nDECORATIONS<br /><br />\nDr. Kugler to Address<br />\nLiberal Club<br /><br />\nCALL MADE FOR<br />\nBALLET DANCERS<br />\nThe Barnstormers are sending out a call for 16 men to<br />\ntake part in a ballet dance in<br />\nthe 1930 production. The play<br />\nto be given this year is McCarthy's \"If I Were King.\"<br />\n\"Pops\" Swindell, the Barnstormers coach, wishes to<br />\nstage a ballet dance at one<br />\npart of the play. There will be<br />\neight women and eight men.<br />\nTo take one of the women's<br />\npart it is not necessary to be<br />\neffeminate looking. The steps<br />\nof the dance will be simple<br />\nand not difficult to learn.<br />\nAnyone interested in getting one of these parts, will<br />\nplease report tomorrow afternoon, Saturday at 2.30 o'clock<br />\nat the Barn.<br /><br />\nThis afternoon at 1 p. m. Dr. H.<br />\nKugler will address a meeting of<br />\nthe Liberal Club in Room C. second<br />\nfloor, Levering Hall. Dr. Kugler, is<br />\na well-known German student, and<br />\nat the present time is studying here<br />\nat Homewood. Dr. Kugler has already received his Ph.D. in both<br />\nEconomics and Chemistry. The<br />\nspeaker who is well acquainted with<br />\nthe political situation in Germany<br />\ntoday, has chosen as his topic \"German Political Leaders of Today.\"<br /><br />\nRIVE IT YOURSELF<br /><br />\nNo Deposit Required of Hopkins Students<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br /><br />\nCoupes<br />\n•\" \"\"<br />\nRoadsters<br />\nSedans<br /><br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles Street<br />\nPLaza 6000<br />\n2402 Pennsylvania Ave.<br />\nVernon 4049<br />\nLafayette 2000<br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nThere will also be a public lecture on \"Russia\" by Oswald Garrison Dillard on February 19 at 5 p.<br />\nm. in the C. E. Hall. Mr. Dillard,<br />\neditor of the \"Nation,\" has just returned from a trip to Russia.<br /><br />\nNEW<br /><br />\nFORD<br /><br />\nUSED<br /><br />\nAutomobiles<br />\nGOLDSTEIN LECTURE<br /><br />\nPhone HOmewood 7908<br /><br />\n(Continued from page 1, col. 1)<br /><br />\nBirely's Pharmacy<br /><br />\na stated salary, too low to attract<br />\ntalented men into the service.<br />\nThe address was followed by a<br />\ngeneral discussion, which centered<br />\nlargely about the advisability of<br />\nstate subsidy of medicine, some<br />\ntaking issue with the speaker on<br />\nhis position in regard to it.<br /><br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br /><br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20 E. North Avenue<br /><br />\nVernon<br /><br />\nMake Our Store Your Store<br /><br />\n4300<br /><br />\nWHAT<br />\nYOUNGER COLLEGE<br />\nMEN<br />\nARE DOING<br />\nWITH<br />\nWESTINGHOUSE<br /><br />\nINTERIOR WOOD WORK<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nOur Business is to Improve<br />\nYour Appearance<br /><br />\nM. D. ROSS<br />\nGenerator Design<br />\nUniversity Toronto. '22<br /><br />\nWERGLEY'S<br />\nCharles St., North<br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br />\n2438<br /><br />\nThis Ad might fool you, but<br />\nthere is no deception about<br />\nthe inexpensive service of the<br /><br />\nMaster Cleaners &amp; Tailors<br />\nSuits cleaned and pressed $1.00<br />\nPressing, 35c<br />\nHats cleaned and blocked, 75c<br />\n3204 Greenmount Avenue<br />\nPhone: Homewood 8453<br /><br />\nRIDE IN<br /><br />\nYELLOW<br />\nCABS<br /><br />\nR. A. ALLEN<br />\nHeadquarters Sales<br />\nAlabama Polytechnic Institute. '24<br /><br />\nSTAND AT HOMEWOOD<br />\nFIELD<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING CO.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\ntkot,nnes*.,<br /><br />\nNO CHARGE FOR<br />\nEXTRA PASSENGERS<br /><br />\n*<br /><br />\n•')P<br /><br />\n.<br /><br />\n....<br /><br />\n•<br /><br />\n(2-3-4 or 5 MAY RIDE FOR<br />\nTHE PRICE OF ONE)<br /><br />\nPHONE:<br /><br />\nVernon 1212<br /><br />\nSTETSON CLOTHES<br />\nfor<br /><br />\nCollege cMen<br /><br />\nNationally<br /><br />\nJustly<br /><br />\nKnown<br /><br />\nFamous<br /><br />\nMADE FOR YOU<br /><br />\nFOUR NORTH HOWARD STREET<br /><br />\nA shakedown test, a rescue,<br />\nand a hundred thrills<br />\nSCORE of carefree Coast Guard<br />\nsailors, and with them a Westing..<br />\nhouseman from the Boston Office,<br />\nheaded in a \"bum boat\" for the cutter<br />\nChelan peacefully at anchor in the<br />\nharbor of Hamilton, Bermuda Islands.<br />\nIt had been an exciting shakedown<br />\ntest-cruise. The Westinghouse turbine<br />\ngenerator, motor and condensers had<br />\nfunctioned perfectly, the sea had yielded up its bag of tricks, the Bermudas<br />\nhad fascinated every soul. And soon<br />\nthey would be bound for home.<br />\nBut fate held new experiences in store.<br />\nFive hundred miles off the Azores, the<br />\nNewport,New York State training ship,<br />\nhad lost her propeller. The Chelan was<br />\ncalled to the rescue. And with her, of<br />\ncourse, went the Westinghouse man.<br /><br />\nW.SCHAELCHLIN<br />\nPropulsion Control Engineer<br />\nState College, '19<br />\nZuerich, Switzerland<br /><br />\nA<br /><br />\nH. R. GOSS<br />\nMotor Design<br />\nUniversity Minnesota.'20<br /><br />\nC. M. WILLIAMS<br />\nAuxiliary Switching Design<br />\nUniversity Illinois. '21<br /><br />\nThe Chelan, like four other Coast Guard Cutters recently<br />\ncompleted, is equipped with Westinghouse<br />\nturbine electric drive.<br /><br />\nThree days at top speed on tropical<br />\nwaters, the excitement of rescuing a<br />\nhelpless crew, twelve days at a lazy<br />\ntowing speed, men overboard and a rescue at sea—thrills like those come to<br />\nmany Westinghouse men in line with<br />\ntheir work at electrifying the world.<br />\nFor Westinghouse, in a commanding<br />\nposition in electrical development,enters<br />\nevery field of industry where electricity<br />\nis or may be employed. And Westinghouse men get a taste of every brand<br />\nof human activity.<br /><br />\nWestinghouse<br /><br />\na<br />\no<br />\n3<br />\nti<br /><br />\nti<br />\nIt<br /><br />"}], "field_media_file": [{"target_id": 38442, "display": null, "description": null, "target_type": "file", "target_uuid": "8805b65a-0ab2-4cc1-9629-d00f2f5b4c4c", "url": "http://digital.library.jhu.edu/system/files/2022-03/12119-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12119, "target_type": "node", "target_uuid": "3c84161e-0a69-46b8-853e-23558b6f419e", "url": "/node/12119"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "26835cf7-6ba7-455c-b44f-e3ca07db0fd4"}]}