{"mid": [{"value": 51013}], "uuid": [{"value": "af0e8090-19c5-4ec6-b721-fa4463a4ab38"}], "vid": [{"value": 51013}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T14:41:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15607-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T14:41:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T14:41:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "G3&vY<br />\nB3GYS<br />\n<br />\n/1982<br />\n<br />\n <br />\n<br />\nWhen the Regional Planning Council was established in 1963 by the State Legislature, it was charged with<br />\npreparing a General Development Plan for the Baltimore Region. The purpose of this plan is best stated by the Act<br />\nwhich established the Council: ”An opportunity must be provided for the several units of government within the area<br />\nto work together with the State and private agencies toward the solution of their problems. In order to deal with these<br />\nmatters on a rational and sound basis, they must be considered within the framework of a general development plan<br />\nfor the area.” (Article 78D, Section 1.) Additionally, the Act establishes the general contents of the plan, as follows:<br />\n”The plan shall be based upon comprehensive surveys and studies of land use, transportation, public utilities,<br />\ngovernmental facilities and services, and natural resources. It shall take into account social and economic factors,<br />\nconditions, and trends that are relevant to the probable future development of the area.” (Article 78D, Section 12, (a).)<br />\n<br />\nAll three prior General Development Plans have followed this general outline while varying in thrust and de-<br />\ntail to meet the major issues of regional importance at the time of their preparation. The 1982 General Development<br />\nPlan is no exception and addresses the problems of implementing necessary programs in a time of reduced fiscal<br />\nresources, declining growth and a sluggish economy. The how and what to implement is the single most important<br />\nissue facing the state, region, and local governments at this time. Establishment of priorities, both in terms of<br />\nprograms and facilities, is critical and must be matched by the means to secure the funds to pay for them. High<br />\ninterest rates are making it more difficult for the state and local governments to raise funds for capital projects and<br />\nhave also affected business expansion and formation with depressing effects on tax revenues. Additionally,<br />\ndecreasing federal financial assistance is placing increased burdens on state and local resources.<br />\n<br />\nUnfortunately, while revenue sources are decreasing or becoming more expensive to obtain, demands for<br />\ngovernment expenditures are as high, or higher, than ever. In the era of rapid suburban growth following the Second<br />\nWorld War, enormous expenditures for new public facilities of all kinds were required to keep pace with needs, while<br />\nfunds for maintenance of existing facilities were reduced. The facilities built during the fifties and sixties are in need<br />\nof repair and, in some cases, enlargement, while the other facilities on which maintenance had been deferred are in<br />\ngreat need of repair and, in many cases, replacement. Additionally, many older communities need revitalization and<br />\nnew facilities.<br />\n<br />\nIn addressing these and other problems, many of which are not related to the physical facilities of the region but<br />\nto the social and economic needs of the residents, the Regional Planning Council has concentrated on seven major<br />\nareas of concern, i.e., Transportation, Economic Development, Housing, Land Use, Energy, Environment, and<br />\nHuman Services. Each area of concern defines the most critical problems, examines program and project priorities,<br />\nand suggests a number of ways by which the necessary funding can be obtained. Following this analysis, a series of<br />\ngoals are established with accompanying policies and strategies to achieve these goals. In many respects, the point of<br />\nview of this GDP is shorter than the usual 20 year range of previous plans as it is more involved with the short range (5<br />\n-10 years) view associated with plan and program implementation. However, many of the goals are long range in<br />\nnature and will require a considerable length of time before they can be achieved. On May 27, 1982, Governor Hughes<br />\nissued an Executive Order containing 72 major policies which will be used by state agencies as they make decisions<br />\naffecting development in Maryland. The goals and policies of the General Development Plan are consistent with and<br />\nserve to reaffirm and support the policies of the Executive Order.<br />\n<br />\nIn the following discussion, each of the areas of concern will be summarized with particular reference to the<br />\nissues and goals. These summaries are necessarily very brief and contain only the most critical issues, goals, and<br />\nfindings. The reader interested in the policies and strategies developed to reach the recommended goals is referred to<br />\nthe pertinent volumes which accompany this summary or to the volume of goals and policies which contains all of<br />\n<br />\nthe policies and strategies recommended by the Regional Planning Council.<br />\n<br />\nJ. Hugh Nichols<br />\nChairman, Regional Planning Council<br />\n<br />\n <br />\n<br />\nPOLICY AREAS: SPECIAL AREAS:<br />\n<br />\n <br />\n<br />\nExisting Urban Development w-—==| State Critical Areas<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n5 1770777 .<br />\nSuburban Service Area ;2/22;22 Water Resource Protection Areas<br />\n/. /<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nRural Service Area Air Quality Management Area<br />\n<br />\n- Open Space and Recreation o Airport Noise District<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nAgricultural Preservation Districts Historic Preservation District<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nWater Quality Growth Caution Areas<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nMilitary Establishments<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nTRANSPORTATION FACILITIES:<br />\n<br />\nMajor Projects in Current Programs:<br />\n<br />\nProgrammed for Construction<br />\n<br />\n—‘—— Highways eeeeeeeee Transit<br />\n<br />\nProgrammed for Project Planning == w== e == Highways e--e--e--e--e Transit<br />\n<br />\n(Map shows only new interstate and other highway and transit projects in new location; refer to<br />\nTransportation chapter for complete listing of GDP projects).<br />\n<br />\nNOTE: Boundaries of Westminster and Hampstead- 0 5 10 N<br />\n<br />\nManchester Suburban Service Areas may e —— SN<br />\nchange pending completion of studies by the 'nrc.<br />\nCarroll County Department of Planning. SCALE IN MILES iy<br />\n<br />\nR.P.C. 10/82<br />\n<br />\n  <br />\n   <br />\n<br />\nParole<br />\n<br />\n      <br />\n<br />\nHerring<br />\n<br />\n <br />\n <br />\n<br />\nBay<br />\n<br />\n‘(& LIBRARY<br />\n<br />\nNOV 18 1988<br />\n#p correcro®<br />\n<br />\n  <br />\n  <br />\n<br />\n  <br />\n <br />\n<br />\n <br />\n<br />\nHavre de Grace<br />\n<br />\n     <br />\n   <br />\n <br />\n<br />\n  <br />\n<br />\n2, 7 74<br />\n<br />\nThe Regional Growth Management Policy Map serves toillustrate a number of<br />\nthe goals and policies of the 1982 General Development Plan. Major policy areas,<br />\nshown in color, are:<br />\n<br />\ns<br />\n2.<br />\n<br />\n3.<br />\n<br />\n6.<br />\n<br />\nExisting Development - existing urban areas regardless of land use type. &<br />\nSuburban Service Area - planned future urban growth areas with<br />\nnecessary public facilities.<br />\n<br />\nOpen Space and Recreation - public parks, natural areas, and other<br />\npermanent open space.<br />\n<br />\nRural Service Area - intended for exclusion of urban growth and reserved<br />\nfor agriculture, forestry, and related activities.<br />\n<br />\nAgricultural Preservation Districts - areas within the Rural Servicé Area<br />\nwhere local governments are acquiring easements to preserve<br />\nagricultural land. '<br />\n<br />\nMilitary Establishments<br />\n<br />\nSuperimposed, in black, upon these major areas are a number of special areas.<br />\nWhile seemingly unrelated, all of these special areas have an impact on the type or<br />\nform of development which can be accommodated. These special areas are:<br />\n<br />\nil<br />\n2.<br />\n<br />\nState Critical Areas - designated by the Department of State Planning.<br />\nWater Resources Protection Areas - development should be carefully<br />\ncontrolled to protect quality of surface water reservoirs or ground water<br />\nresources.<br />\n<br />\nAirport Noise District - restrictions required on development due to<br />\naircraft noise.<br />\n<br />\nAir Quality Management Area - non-attainment area for particulate (dust)<br />\nstandards with restrictions on industrial development.<br />\n<br />\nHistoric Preservation Districts - historic and/or architecturally<br />\nsignificant areas.<br />\n<br />\nWater Quality Growth Caution Areas - portions of the Suburban Service<br />\nArea requiring particular care to prevent pollution of surface or ground<br />\nwater resources.<br />\n<br />\nA number of existing or planned transportation facilities are also shown:<br />\n<br />\n1<br />\n<br />\nHighway and Transit Facilities - new interstate and other highway and<br />\ntransit projects on new locations which are programmed for construction<br />\nor project planning; does not include widening, resurfacing, or similar<br />\n<br />\nimprovements.<br />\n<br />\n <br />\n<br />\nIn contrast to prior General Development Plans which<br />\ncontained major land use analyses and recommendations, the<br />\n1982 Plan restricts itself to an examination of the degree to which<br />\nlocal and regional plans are being implemented. Since 1977, all<br />\nof the jurisdictions in the region have revised or adopted plans<br />\ncontaining the concepts of centralized development and growth<br />\nmanagement which were the major precepts of the 1977 General<br />\nDevelopment Plan. As a result, the major land use goals were<br />\nconsidered to be valid and are included in the 1982 Plan. The<br />\nbasic development goal is as follows:<br />\n<br />\nTHE REGION’S RESOURCES SHOULD BE<br />\nMANAGED TO PROMOTE AND ACHIEVE A MORE<br />\nCENTRALIZED DEVELOPMENT PATTERN.<br />\nSIMULTANEOUSLY, PUBLIC ACTIONS SHOULD<br />\nBE DESIGNED TO ENHANCE, MAINTAIN, AND<br />\nREVITALIZE EXISTING COMMUNITIES. PUBLIC<br />\nPOLICIES SHOULD ENCOURAGE THE GROWTH<br />\nOF METROCENTER AND OTHER TOWN AND<br />\nCOMMUNITY CENTERS. THE RURAL SERVICE<br />\nAREA SHOULD BE PRESERVED FOR FARMING<br />\nAND FORESTRY, PUBLIC WATERSHED<br />\nPROTECTION AND MAJOR PUBLIC PARKLAND,<br />\nAND NEW WELL-PLANNED DEVELOPMENT<br />\nSHOULD UTILIZE LAND RESOURCES WITHIN<br />\nEXISTING COMMUNITIES AND IN CAREFULLY<br />\nSTAGED NEW GROWTH AREAS IN SEQUENCE<br />\nWITH THE ORDERLY PROVISION OF PUBLIC<br />\nSERVICES AND FACILITIES. BALTIMORE CITY<br />\nSHOULD RECEIVE A GREATER SHARE OF THE<br />\nREGION’S GROWTH.<br />\n<br />\nWith general agreement as to development form and<br />\nlocation, the critical element is the degree to which this<br />\ndevelopment pattern is being achieved, with particular reference<br />\nto the provision and scheduling of public facilities. The ability<br />\nto acquire the necessary capital resources to provide these<br />\nfacilities is also a key issue addressed by the 1982 General<br />\nDevelopment Plan. These issues were addressed by examining<br />\nthe means by which the local governments in the region are<br />\nconsidering or are using innovative techniques to provide<br />\ncapital resources including greater cooperation with the private<br />\nsector, and by examining the degree to which the plans and<br />\nprograms for sewerage and transportation facilities serve to meet<br />\nthe development goals of the local jurisdictions.<br />\n<br />\nA wide range of development policies exists in the region<br />\ntogether with measures designed to implement them. In<br />\nimplementing these policies local governments have become<br />\ndependent, to varying degrees, on infusion of federal and state<br />\nfinancing required to subsidize urban renewal and support the<br />\nconstruction, reconstruction, and maintenance of public facility<br />\nsystems. The withdrawal, or substantial reduction of federal aid,<br />\nthreatens severe cutbacks in development policy<br />\nimplementation. This analysis represents an initial attempt to<br />\ndefine how the various jurisdictions intend or are coping with<br />\n<br />\nthese realities. The following observations have resulted from<br />\nthis preliminary investigation:<br />\n<br />\nB ILarger amounts of private capital may become<br />\navailable to help undertake all phases of land<br />\ndevelopment, including basic infrastructure, than in<br />\nthe past. Developers with access to large sources of<br />\ninvestment funds, coupled with a vested interest in<br />\nthe region, can open varied new routes to community<br />\ndevelopment. This has occurred in the past and is<br />\ncurrently the best potential source of private<br />\nassistance.<br />\n<br />\nB Public support and participation in development<br />\nventures, through traditional as well as innovative<br />\nactivities, will continue as a basic requirement.<br />\nCoordinated planning and programming within and<br />\namong public facility systems are requisites to the<br />\nstaging and financing of growth.<br />\n<br />\nB Opportunities for coventuré between local<br />\ngovernments and representatives of the private sector<br />\nshould be solicited. Negotiation of individual and<br />\njoint responsibilities are critical to all phases of such<br />\nundertakings, including the creation of mechanisms<br />\nto handle features such as multi-source funding and<br />\ncost-sharing arrangements.<br />\n<br />\nB Measures for recovery of capital investments<br />\nequitably, without devastation of the market, are<br />\nessential. Return to some forms of long term, below<br />\nmarketing financing, with recovery spread over a<br />\nbroad revenue base, seems preferable to short term<br />\nloading of capital costs solely on new homebuyers.<br />\n<br />\nB Careful use of innovative capital financing<br />\ntechniques, such as sale-leaseback, can relieve public<br />\nfinancial problems in some cases, releasing<br />\ntraditional governmental powers to assume fiscal<br />\nobligations elsewhere.<br />\n<br />\nBaltimore City occupies a unique position in the<br />\nmetropolitan area and its problems are those normally<br />\nassociated with renewal and revitalization. Great strides have<br />\nbeen made in meeting many of these needs using combinations<br />\nof federal, state, local, and private funds as well as varied<br />\ninstitutional arrangements. These efforts are exemplified by<br />\nCharles Center, the Inner Harbor and Harborplace, and the<br />\nConvention Center. A great deal remains to be done throughout<br />\nthe city and particularly with the vast system of sewer and water<br />\nlines, roads, and bridges. As an example of the magnitude of this<br />\nproblem, some $600 million will be required for wastewater<br />\nsystem maintenance and replacement alone without considering<br />\nany other portions of the infrastructure. The city intends to use a<br />\nnumber of ”creative capital funding” measures to meet these<br />\nneeds including ”sale-leaseback” in which the city will sell a<br />\nparticular facility to a private investor then lease it back. The<br />\ninvestor is able to benefit from tax write-offs, credits, and<br />\ndepreciation allowances. No matter how creative, however, most<br />\nprograms will still be dependent upon state and federal<br />\nassistance as well as the traditional fiscal operations.<br />\n<br />\nAnother section of the land use analysis “Coordination of<br />\nSewerage and Transportation Investments for Regional<br />\nDevelopment” investigates the degree to which major public<br />\ninvestments in sewerage and transportation facilities serve to<br />\nsupport and enhance regional and local development policies.<br />\nThis work is intended to identify those planned growth areas in<br />\nthe region which will need new or enlarged facilities in order to<br />\nmeet local development goals.<br />\n<br />\nThe analysis used Regional Planning Districts (RPD) as<br />\nthe means of identifying growth areas, although in many cases<br />\nonly a portion of those rather large areas would contain planned<br />\nurban growth. A total of 38 RPDs (out of a total of 94 RPDs in<br />\nthe region) were selected for analysis. Together they account for<br />\n89.7% and 76.1% of the projected 1980-1990 population and<br />\n<br />\nemployment growth respectively. Existing development<br />\nactivity, 1978-1980, was then examined using Baltimore Gas and<br />\nElectric Company connection data and Regional Planning<br />\nCouncil employment data. The final step was to analyze the<br />\nadequacy of both the sewer and transportation systems to<br />\nsupport the demands of the projected growth.<br />\n<br />\nThis analysis was done on a very general level and<br />\nincluded planned and programmed facilities and their<br />\napproximate times of completion, in order to arrive at general<br />\nlevels of adequacy to meet growth needs. It must be remembered<br />\nthat this provides only a guide to facility needs and will be most<br />\nuseful in future studies to determine project priorities.<br />\n<br />\nFindings of this study indicate that only five of the thirty-<br />\neight RPDs selected for analysis have severe sewerage and/or<br />\ntransportation system deficiencies. These areas are not evenly<br />\nspread throughout the region but are concentrated in Anne<br />\nArundel and Carroll counties, and while they account for only<br />\n15.5% of the region’s projected population growth they are<br />\nplanned to contain 32% of Anne Arundel County and 46% of<br />\nCarroll County’s growth.<br />\n<br />\nThe bulk of the RPDs examined (26) show problems from<br />\neither sewerage system or transportation facility inadequacy and<br />\nare fairly evenly distributed throughout the region. Due to the<br />\nfact that these areas account for 60.6% and 76% of the region’s<br />\nprojected population and employment growth respectively, it is<br />\nimportant to carefully program the facilities necessary to correct<br />\nsystem deficiencies.<br />\n<br />\nResults of this study indicate that there are a number of<br />\ncritical facility problems which must be addressed if the region<br />\nand its local governments are to realize their development<br />\nobjectives. Additionally, it will not be possible to eliminate all of<br />\nthese deficiencies in the next few years due to funding and other<br />\nconstraints. While this analysis, which is only a first look at<br />\nthese problems on a regional level, is by no means definitive it<br />\nshould prove to be a valuable tool in assisting the state, regional,<br />\nand local governments in better defining their facility<br />\nconstruction priorities in the future.<br />\n<br />\n <br />\n<br />\nSince the preparation of the 1977 General Development<br />\nPlan, there have been some very significant changes in<br />\nconditions underlying Baltimore’s future economic prospects.<br />\nSome have been positive:<br />\n<br />\nB The transformation of Baltimore’s Inner Harbor<br />\nfrom an wurban eyesore to an internationally<br />\nrecognized revitalization site.<br />\n<br />\n®  The opening of the Convention Center, Harborplace,<br />\nand the National Aquarium generated new<br />\nemployment and further diversified the local<br />\neconomy.<br />\n<br />\nB Major construction projects, such as the Baltimore<br />\nMetro and Ft. McHenry Tunnel, will enhance the<br />\nmovement of people and goods throughout the<br />\nregion.<br />\n<br />\nB Worldwide energy demand has enhanced Baltimore’s<br />\n<br />\nposition as one of the leading United States coal ports<br />\nwith a multi-million dollar infusion of capital into<br />\nthe Port.<br />\n<br />\nSome have been negative:<br />\n<br />\nm The long term trend away from the production of<br />\ngoods is accelerating with continued dislocation of<br />\nworkers from economic sectors long basic to this<br />\narea’s economy.<br />\n<br />\nB Government service employment, which once served<br />\nto cushion declines in industry, has been declining<br />\nsince the late 1970s.<br />\n<br />\nB The consequences of new economic policies in<br />\nWashington, featuring tight monetary policy and<br />\nshifting of responsibility from federal to state local<br />\ngovernments are still uncertain.<br />\n<br />\n® Unemployment has continued to increase<br />\nparticularly among blacks.<br />\n<br />\nAs a result of these and other changes, the 1982 General<br />\n<br />\nDevelopment Plan has focussed on a few important issues which<br />\ncan be effectively addressed by state and local decision makers.<br />\n<br />\nIssue: Capturing a Share of Growth Industries<br />\n<br />\nAs an indication of the changes which have been<br />\noccurring in the Baltimore economy, the following table shows<br />\nthe changes in employment, as percentages of total regional<br />\nemployment, in the major economic sectors which have<br />\noccurred since 1960 and projected to the year 2000.<br />\n<br />\nTABLE 1<br />\nSHARES OF TOTAL EMPLOYMENT<br />\nBY MAJOR SECTORS,<br />\nBALTIMORE SMSA, 1960 - 2000<br />\n<br />\n1960 1980 2000<br />\n<br />\nInfrastructure! 15.4 12.5 12<br />\nManufacturing 27.9 15.3 13<br />\nTrade 20.7 21.3 21<br />\nServices 18.8 28.5 35<br />\nGovernment B2 2243 19<br />\nTotal 100.0 100.0 100<br />\n<br />\n!Agriculture, mining, construction, transportation, communications, and<br />\npublic utilities.<br />\nSOURCE: Regional Planning Council estimates and projections.<br />\n<br />\nThe table clearly shows the continuing decline of<br />\nemployment in the Manufacturing sector and the rather<br />\ndramatic increase in the Service sector. An important point to<br />\nbear in mind is that there are a number of bright spots in the<br />\nManufacturing sector such as electronics and<br />\ntelecommunications which are among the so-called “high tech”<br />\nindustries. It is recommended that every effort be made to attract<br />\nthese growth industries to the region by emphasizing the<br />\nadvantages of the Baltimore area in terms of its existing<br />\ninstitutions such as The Johns Hopkins Applied Physics<br />\nLaboratory, the Space Telescope Institute now under<br />\ndevelopment, the major medical institutions, and the proximity<br />\nof other federal research institutions.<br />\n<br />\nWhile the wholesale/retail activities, represented by the<br />\nTrade sector are a fairly stable component of the regional<br />\neconomy, its status can be improved by increasing activity in the<br />\nPort of Baltimore and additional gains associated with the<br />\ntourism/convention activity centered in the Inner Harbor.<br />\n<br />\nIt is.in the Service sector of the economy where major<br />\ninvestments in Baltimore MetroCenter may make it more<br />\n\f", "format": "basic_html", "processed": "G3&amp;vY<br />\nB3GYS<br /><br />\n/1982<br /><br /><br /><br />\nWhen the Regional Planning Council was established in 1963 by the State Legislature, it was charged with<br />\npreparing a General Development Plan for the Baltimore Region. The purpose of this plan is best stated by the Act<br />\nwhich established the Council: ”An opportunity must be provided for the several units of government within the area<br />\nto work together with the State and private agencies toward the solution of their problems. In order to deal with these<br />\nmatters on a rational and sound basis, they must be considered within the framework of a general development plan<br />\nfor the area.” (Article 78D, Section 1.) Additionally, the Act establishes the general contents of the plan, as follows:<br />\n”The plan shall be based upon comprehensive surveys and studies of land use, transportation, public utilities,<br />\ngovernmental facilities and services, and natural resources. It shall take into account social and economic factors,<br />\nconditions, and trends that are relevant to the probable future development of the area.” (Article 78D, Section 12, (a).)<br /><br />\nAll three prior General Development Plans have followed this general outline while varying in thrust and de-<br />\ntail to meet the major issues of regional importance at the time of their preparation. The 1982 General Development<br />\nPlan is no exception and addresses the problems of implementing necessary programs in a time of reduced fiscal<br />\nresources, declining growth and a sluggish economy. The how and what to implement is the single most important<br />\nissue facing the state, region, and local governments at this time. Establishment of priorities, both in terms of<br />\nprograms and facilities, is critical and must be matched by the means to secure the funds to pay for them. High<br />\ninterest rates are making it more difficult for the state and local governments to raise funds for capital projects and<br />\nhave also affected business expansion and formation with depressing effects on tax revenues. Additionally,<br />\ndecreasing federal financial assistance is placing increased burdens on state and local resources.<br /><br />\nUnfortunately, while revenue sources are decreasing or becoming more expensive to obtain, demands for<br />\ngovernment expenditures are as high, or higher, than ever. In the era of rapid suburban growth following the Second<br />\nWorld War, enormous expenditures for new public facilities of all kinds were required to keep pace with needs, while<br />\nfunds for maintenance of existing facilities were reduced. The facilities built during the fifties and sixties are in need<br />\nof repair and, in some cases, enlargement, while the other facilities on which maintenance had been deferred are in<br />\ngreat need of repair and, in many cases, replacement. Additionally, many older communities need revitalization and<br />\nnew facilities.<br /><br />\nIn addressing these and other problems, many of which are not related to the physical facilities of the region but<br />\nto the social and economic needs of the residents, the Regional Planning Council has concentrated on seven major<br />\nareas of concern, i.e., Transportation, Economic Development, Housing, Land Use, Energy, Environment, and<br />\nHuman Services. Each area of concern defines the most critical problems, examines program and project priorities,<br />\nand suggests a number of ways by which the necessary funding can be obtained. Following this analysis, a series of<br />\ngoals are established with accompanying policies and strategies to achieve these goals. In many respects, the point of<br />\nview of this GDP is shorter than the usual 20 year range of previous plans as it is more involved with the short range (5<br />\n-10 years) view associated with plan and program implementation. However, many of the goals are long range in<br />\nnature and will require a considerable length of time before they can be achieved. On May 27, 1982, Governor Hughes<br />\nissued an Executive Order containing 72 major policies which will be used by state agencies as they make decisions<br />\naffecting development in Maryland. The goals and policies of the General Development Plan are consistent with and<br />\nserve to reaffirm and support the policies of the Executive Order.<br /><br />\nIn the following discussion, each of the areas of concern will be summarized with particular reference to the<br />\nissues and goals. These summaries are necessarily very brief and contain only the most critical issues, goals, and<br />\nfindings. The reader interested in the policies and strategies developed to reach the recommended goals is referred to<br />\nthe pertinent volumes which accompany this summary or to the volume of goals and policies which contains all of<br /><br />\nthe policies and strategies recommended by the Regional Planning Council.<br /><br />\nJ. Hugh Nichols<br />\nChairman, Regional Planning Council<br /><br /><br /><br />\nPOLICY AREAS: SPECIAL AREAS:<br /><br /><br /><br />\nExisting Urban Development w-—==| State Critical Areas<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n5 1770777 .<br />\nSuburban Service Area ;2/22;22 Water Resource Protection Areas<br />\n/. /<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nRural Service Area Air Quality Management Area<br /><br />\n- Open Space and Recreation o Airport Noise District<br /><br /><br /><br /><br /><br />\nAgricultural Preservation Districts Historic Preservation District<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nWater Quality Growth Caution Areas<br /><br /><br /><br /><br /><br />\nMilitary Establishments<br /><br /><br /><br /><br /><br /><br /><br />\nTRANSPORTATION FACILITIES:<br /><br />\nMajor Projects in Current Programs:<br /><br />\nProgrammed for Construction<br /><br />\n—‘—— Highways eeeeeeeee Transit<br /><br />\nProgrammed for Project Planning == w== e == Highways e--e--e--e--e Transit<br /><br />\n(Map shows only new interstate and other highway and transit projects in new location; refer to<br />\nTransportation chapter for complete listing of GDP projects).<br /><br />\nNOTE: Boundaries of Westminster and Hampstead- 0 5 10 N<br /><br />\nManchester Suburban Service Areas may e —— SN<br />\nchange pending completion of studies by the 'nrc.<br />\nCarroll County Department of Planning. SCALE IN MILES iy<br /><br />\nR.P.C. 10/82<br /><br /><br /><br /><br />\nParole<br /><br /><br /><br />\nHerring<br /><br /><br /><br /><br />\nBay<br /><br />\n‘(&amp; LIBRARY<br /><br />\nNOV 18 1988<br />\n#p correcro®<br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nHavre de Grace<br /><br /><br /><br /><br /><br /><br /><br />\n2, 7 74<br /><br />\nThe Regional Growth Management Policy Map serves toillustrate a number of<br />\nthe goals and policies of the 1982 General Development Plan. Major policy areas,<br />\nshown in color, are:<br /><br />\ns<br />\n2.<br /><br />\n3.<br /><br />\n6.<br /><br />\nExisting Development - existing urban areas regardless of land use type. &amp;<br />\nSuburban Service Area - planned future urban growth areas with<br />\nnecessary public facilities.<br /><br />\nOpen Space and Recreation - public parks, natural areas, and other<br />\npermanent open space.<br /><br />\nRural Service Area - intended for exclusion of urban growth and reserved<br />\nfor agriculture, forestry, and related activities.<br /><br />\nAgricultural Preservation Districts - areas within the Rural Servicé Area<br />\nwhere local governments are acquiring easements to preserve<br />\nagricultural land. '<br /><br />\nMilitary Establishments<br /><br />\nSuperimposed, in black, upon these major areas are a number of special areas.<br />\nWhile seemingly unrelated, all of these special areas have an impact on the type or<br />\nform of development which can be accommodated. These special areas are:<br /><br />\nil<br />\n2.<br /><br />\nState Critical Areas - designated by the Department of State Planning.<br />\nWater Resources Protection Areas - development should be carefully<br />\ncontrolled to protect quality of surface water reservoirs or ground water<br />\nresources.<br /><br />\nAirport Noise District - restrictions required on development due to<br />\naircraft noise.<br /><br />\nAir Quality Management Area - non-attainment area for particulate (dust)<br />\nstandards with restrictions on industrial development.<br /><br />\nHistoric Preservation Districts - historic and/or architecturally<br />\nsignificant areas.<br /><br />\nWater Quality Growth Caution Areas - portions of the Suburban Service<br />\nArea requiring particular care to prevent pollution of surface or ground<br />\nwater resources.<br /><br />\nA number of existing or planned transportation facilities are also shown:<br /><br />\n1<br /><br />\nHighway and Transit Facilities - new interstate and other highway and<br />\ntransit projects on new locations which are programmed for construction<br />\nor project planning; does not include widening, resurfacing, or similar<br /><br />\nimprovements.<br /><br /><br /><br />\nIn contrast to prior General Development Plans which<br />\ncontained major land use analyses and recommendations, the<br />\n1982 Plan restricts itself to an examination of the degree to which<br />\nlocal and regional plans are being implemented. Since 1977, all<br />\nof the jurisdictions in the region have revised or adopted plans<br />\ncontaining the concepts of centralized development and growth<br />\nmanagement which were the major precepts of the 1977 General<br />\nDevelopment Plan. As a result, the major land use goals were<br />\nconsidered to be valid and are included in the 1982 Plan. The<br />\nbasic development goal is as follows:<br /><br />\nTHE REGION’S RESOURCES SHOULD BE<br />\nMANAGED TO PROMOTE AND ACHIEVE A MORE<br />\nCENTRALIZED DEVELOPMENT PATTERN.<br />\nSIMULTANEOUSLY, PUBLIC ACTIONS SHOULD<br />\nBE DESIGNED TO ENHANCE, MAINTAIN, AND<br />\nREVITALIZE EXISTING COMMUNITIES. PUBLIC<br />\nPOLICIES SHOULD ENCOURAGE THE GROWTH<br />\nOF METROCENTER AND OTHER TOWN AND<br />\nCOMMUNITY CENTERS. THE RURAL SERVICE<br />\nAREA SHOULD BE PRESERVED FOR FARMING<br />\nAND FORESTRY, PUBLIC WATERSHED<br />\nPROTECTION AND MAJOR PUBLIC PARKLAND,<br />\nAND NEW WELL-PLANNED DEVELOPMENT<br />\nSHOULD UTILIZE LAND RESOURCES WITHIN<br />\nEXISTING COMMUNITIES AND IN CAREFULLY<br />\nSTAGED NEW GROWTH AREAS IN SEQUENCE<br />\nWITH THE ORDERLY PROVISION OF PUBLIC<br />\nSERVICES AND FACILITIES. BALTIMORE CITY<br />\nSHOULD RECEIVE A GREATER SHARE OF THE<br />\nREGION’S GROWTH.<br /><br />\nWith general agreement as to development form and<br />\nlocation, the critical element is the degree to which this<br />\ndevelopment pattern is being achieved, with particular reference<br />\nto the provision and scheduling of public facilities. The ability<br />\nto acquire the necessary capital resources to provide these<br />\nfacilities is also a key issue addressed by the 1982 General<br />\nDevelopment Plan. These issues were addressed by examining<br />\nthe means by which the local governments in the region are<br />\nconsidering or are using innovative techniques to provide<br />\ncapital resources including greater cooperation with the private<br />\nsector, and by examining the degree to which the plans and<br />\nprograms for sewerage and transportation facilities serve to meet<br />\nthe development goals of the local jurisdictions.<br /><br />\nA wide range of development policies exists in the region<br />\ntogether with measures designed to implement them. In<br />\nimplementing these policies local governments have become<br />\ndependent, to varying degrees, on infusion of federal and state<br />\nfinancing required to subsidize urban renewal and support the<br />\nconstruction, reconstruction, and maintenance of public facility<br />\nsystems. The withdrawal, or substantial reduction of federal aid,<br />\nthreatens severe cutbacks in development policy<br />\nimplementation. This analysis represents an initial attempt to<br />\ndefine how the various jurisdictions intend or are coping with<br /><br />\nthese realities. The following observations have resulted from<br />\nthis preliminary investigation:<br /><br />\nB ILarger amounts of private capital may become<br />\navailable to help undertake all phases of land<br />\ndevelopment, including basic infrastructure, than in<br />\nthe past. Developers with access to large sources of<br />\ninvestment funds, coupled with a vested interest in<br />\nthe region, can open varied new routes to community<br />\ndevelopment. This has occurred in the past and is<br />\ncurrently the best potential source of private<br />\nassistance.<br /><br />\nB Public support and participation in development<br />\nventures, through traditional as well as innovative<br />\nactivities, will continue as a basic requirement.<br />\nCoordinated planning and programming within and<br />\namong public facility systems are requisites to the<br />\nstaging and financing of growth.<br /><br />\nB Opportunities for coventuré between local<br />\ngovernments and representatives of the private sector<br />\nshould be solicited. Negotiation of individual and<br />\njoint responsibilities are critical to all phases of such<br />\nundertakings, including the creation of mechanisms<br />\nto handle features such as multi-source funding and<br />\ncost-sharing arrangements.<br /><br />\nB Measures for recovery of capital investments<br />\nequitably, without devastation of the market, are<br />\nessential. Return to some forms of long term, below<br />\nmarketing financing, with recovery spread over a<br />\nbroad revenue base, seems preferable to short term<br />\nloading of capital costs solely on new homebuyers.<br /><br />\nB Careful use of innovative capital financing<br />\ntechniques, such as sale-leaseback, can relieve public<br />\nfinancial problems in some cases, releasing<br />\ntraditional governmental powers to assume fiscal<br />\nobligations elsewhere.<br /><br />\nBaltimore City occupies a unique position in the<br />\nmetropolitan area and its problems are those normally<br />\nassociated with renewal and revitalization. Great strides have<br />\nbeen made in meeting many of these needs using combinations<br />\nof federal, state, local, and private funds as well as varied<br />\ninstitutional arrangements. These efforts are exemplified by<br />\nCharles Center, the Inner Harbor and Harborplace, and the<br />\nConvention Center. A great deal remains to be done throughout<br />\nthe city and particularly with the vast system of sewer and water<br />\nlines, roads, and bridges. As an example of the magnitude of this<br />\nproblem, some $600 million will be required for wastewater<br />\nsystem maintenance and replacement alone without considering<br />\nany other portions of the infrastructure. The city intends to use a<br />\nnumber of ”creative capital funding” measures to meet these<br />\nneeds including ”sale-leaseback” in which the city will sell a<br />\nparticular facility to a private investor then lease it back. The<br />\ninvestor is able to benefit from tax write-offs, credits, and<br />\ndepreciation allowances. No matter how creative, however, most<br />\nprograms will still be dependent upon state and federal<br />\nassistance as well as the traditional fiscal operations.<br /><br />\nAnother section of the land use analysis “Coordination of<br />\nSewerage and Transportation Investments for Regional<br />\nDevelopment” investigates the degree to which major public<br />\ninvestments in sewerage and transportation facilities serve to<br />\nsupport and enhance regional and local development policies.<br />\nThis work is intended to identify those planned growth areas in<br />\nthe region which will need new or enlarged facilities in order to<br />\nmeet local development goals.<br /><br />\nThe analysis used Regional Planning Districts (RPD) as<br />\nthe means of identifying growth areas, although in many cases<br />\nonly a portion of those rather large areas would contain planned<br />\nurban growth. A total of 38 RPDs (out of a total of 94 RPDs in<br />\nthe region) were selected for analysis. Together they account for<br />\n89.7% and 76.1% of the projected 1980-1990 population and<br /><br />\nemployment growth respectively. Existing development<br />\nactivity, 1978-1980, was then examined using Baltimore Gas and<br />\nElectric Company connection data and Regional Planning<br />\nCouncil employment data. The final step was to analyze the<br />\nadequacy of both the sewer and transportation systems to<br />\nsupport the demands of the projected growth.<br /><br />\nThis analysis was done on a very general level and<br />\nincluded planned and programmed facilities and their<br />\napproximate times of completion, in order to arrive at general<br />\nlevels of adequacy to meet growth needs. It must be remembered<br />\nthat this provides only a guide to facility needs and will be most<br />\nuseful in future studies to determine project priorities.<br /><br />\nFindings of this study indicate that only five of the thirty-<br />\neight RPDs selected for analysis have severe sewerage and/or<br />\ntransportation system deficiencies. These areas are not evenly<br />\nspread throughout the region but are concentrated in Anne<br />\nArundel and Carroll counties, and while they account for only<br />\n15.5% of the region’s projected population growth they are<br />\nplanned to contain 32% of Anne Arundel County and 46% of<br />\nCarroll County’s growth.<br /><br />\nThe bulk of the RPDs examined (26) show problems from<br />\neither sewerage system or transportation facility inadequacy and<br />\nare fairly evenly distributed throughout the region. Due to the<br />\nfact that these areas account for 60.6% and 76% of the region’s<br />\nprojected population and employment growth respectively, it is<br />\nimportant to carefully program the facilities necessary to correct<br />\nsystem deficiencies.<br /><br />\nResults of this study indicate that there are a number of<br />\ncritical facility problems which must be addressed if the region<br />\nand its local governments are to realize their development<br />\nobjectives. Additionally, it will not be possible to eliminate all of<br />\nthese deficiencies in the next few years due to funding and other<br />\nconstraints. While this analysis, which is only a first look at<br />\nthese problems on a regional level, is by no means definitive it<br />\nshould prove to be a valuable tool in assisting the state, regional,<br />\nand local governments in better defining their facility<br />\nconstruction priorities in the future.<br /><br /><br /><br />\nSince the preparation of the 1977 General Development<br />\nPlan, there have been some very significant changes in<br />\nconditions underlying Baltimore’s future economic prospects.<br />\nSome have been positive:<br /><br />\nB The transformation of Baltimore’s Inner Harbor<br />\nfrom an wurban eyesore to an internationally<br />\nrecognized revitalization site.<br /><br />\n®  The opening of the Convention Center, Harborplace,<br />\nand the National Aquarium generated new<br />\nemployment and further diversified the local<br />\neconomy.<br /><br />\nB Major construction projects, such as the Baltimore<br />\nMetro and Ft. McHenry Tunnel, will enhance the<br />\nmovement of people and goods throughout the<br />\nregion.<br /><br />\nB Worldwide energy demand has enhanced Baltimore’s<br /><br />\nposition as one of the leading United States coal ports<br />\nwith a multi-million dollar infusion of capital into<br />\nthe Port.<br /><br />\nSome have been negative:<br /><br />\nm The long term trend away from the production of<br />\ngoods is accelerating with continued dislocation of<br />\nworkers from economic sectors long basic to this<br />\narea’s economy.<br /><br />\nB Government service employment, which once served<br />\nto cushion declines in industry, has been declining<br />\nsince the late 1970s.<br /><br />\nB The consequences of new economic policies in<br />\nWashington, featuring tight monetary policy and<br />\nshifting of responsibility from federal to state local<br />\ngovernments are still uncertain.<br /><br />\n® Unemployment has continued to increase<br />\nparticularly among blacks.<br /><br />\nAs a result of these and other changes, the 1982 General<br /><br />\nDevelopment Plan has focussed on a few important issues which<br />\ncan be effectively addressed by state and local decision makers.<br /><br />\nIssue: Capturing a Share of Growth Industries<br /><br />\nAs an indication of the changes which have been<br />\noccurring in the Baltimore economy, the following table shows<br />\nthe changes in employment, as percentages of total regional<br />\nemployment, in the major economic sectors which have<br />\noccurred since 1960 and projected to the year 2000.<br /><br />\nTABLE 1<br />\nSHARES OF TOTAL EMPLOYMENT<br />\nBY MAJOR SECTORS,<br />\nBALTIMORE SMSA, 1960 - 2000<br /><br />\n1960 1980 2000<br /><br />\nInfrastructure! 15.4 12.5 12<br />\nManufacturing 27.9 15.3 13<br />\nTrade 20.7 21.3 21<br />\nServices 18.8 28.5 35<br />\nGovernment B2 2243 19<br />\nTotal 100.0 100.0 100<br /><br />\n!Agriculture, mining, construction, transportation, communications, and<br />\npublic utilities.<br />\nSOURCE: Regional Planning Council estimates and projections.<br /><br />\nThe table clearly shows the continuing decline of<br />\nemployment in the Manufacturing sector and the rather<br />\ndramatic increase in the Service sector. An important point to<br />\nbear in mind is that there are a number of bright spots in the<br />\nManufacturing sector such as electronics and<br />\ntelecommunications which are among the so-called “high tech”<br />\nindustries. It is recommended that every effort be made to attract<br />\nthese growth industries to the region by emphasizing the<br />\nadvantages of the Baltimore area in terms of its existing<br />\ninstitutions such as The Johns Hopkins Applied Physics<br />\nLaboratory, the Space Telescope Institute now under<br />\ndevelopment, the major medical institutions, and the proximity<br />\nof other federal research institutions.<br /><br />\nWhile the wholesale/retail activities, represented by the<br />\nTrade sector are a fairly stable component of the regional<br />\neconomy, its status can be improved by increasing activity in the<br />\nPort of Baltimore and additional gains associated with the<br />\ntourism/convention activity centered in the Inner Harbor.<br /><br />\nIt is.in the Service sector of the economy where major<br />\ninvestments in Baltimore MetroCenter may make it more<br />"}], "field_media_file": [{"target_id": 51936, "display": null, "description": null, "target_type": "file", "target_uuid": "8fa7c5ae-c40a-4802-b51b-fa5c5b512a7a", "url": "http://digital.library.jhu.edu/system/files/2022-03/15607-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15607, "target_type": "node", "target_uuid": "e2c98bc0-f550-43ce-8847-735ff938c8be", "url": "/node/15607"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "28473f4f-e3ec-453c-a473-6f173dbc293e"}]}