{"mid": [{"value": 36921}], "uuid": [{"value": "97cd2909-e5f4-4024-b497-4915184309d2"}], "vid": [{"value": 36921}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13096-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 23<br />\n<br />\nTHE JOHNS IIOPKINS NEWS-LETTER, JANUARY 4, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nDR. JAMES J. COALE SPEAKS DR. BURDAN TO ADDRESS DR. VAN ORMAN AND DR. NINE HOPKINS DELEGATES NEW<br />\nLACROSSE OFFICIAL<br />\nAT Y. M. C. A. FELLOWTUDOR-STUART CLUB<br />\nABERCROMBIE ATTEND<br />\nATTEND STUDENT VOLUNCREATED AT LEAGUE<br />\nSHIP DINNER<br />\nON JANUARY 11<br />\nATLANTA MEETING<br />\nTEER MEETING<br />\nMEETING<br />\nMakes Plea for Definite Standards in Six Seniors Elected to Membership. N. C. A. A. Criticizes U. S. Olympic Seven Thousand Students Present. Col- Two<br />\nMen Instead of One to Take<br />\nChristianity. Next Dinner JanClub Rooms Are Nearing<br />\nBody<br />\nor Discrimination Discussed<br />\nCharge. Maryland and Penn State<br />\nuary 15<br />\nCompletion<br />\nDr. Ronald T. Abercrombie, of<br />\nAdmitted<br />\nDelegates from the Johns Hop-<br />\n<br />\nOn Friday, January 11, at 5 P. Johns Hopkins University, headed kins<br />\nA: the last Y. M. C. A. FellowUniversity who have been at- \"Judge of Play\" is the name<br />\nship Dinner, held Tuesday, De- M., Professor Burdan, of Yale the committee which drew up a tending<br />\nthe Student Volunteer (riven to the new lacrosse official<br />\ncember 18, Dr. James J. Coale, University, will address a meeting resolution stating that the A. A.<br />\nMovement at Indianapolis re- recently created at the annual<br />\nExecutive Secretary of the Pres- of the Tudor and Stuart Club to U. has not \"announced a definite<br />\nturned Wednesday morning from meeting of the United States Inbyterian Board of Baltimore, be held in the auditorium of the list of coaches, trainers and manathe quadrennial meeting attended tercollegiate Lacrosse League.<br />\nspoke in favor of the adoption of Civil Engineering Building. This gers,\" and also has not furnished<br />\nby 7,000 students, representing As it is the duty of this new offidefinite standards in our Christian meeting, which will be open to \"a well-planned program of col- about<br />\n1,000 colleges and universi- cial to assist the referee in maklife. About 40 Hopkins students. the public, is expected to draw a lege participation in track and<br />\nties in America, and numerous ing decisions, it is believed that<br />\nmany of whom had heard Dr. large attendance, not only from field events in Olympic tryouts,\"<br />\nforeign institutions. Those repre- the action of the league will make<br />\nCoale speak before, listened with Hopkins students but from out- and calling this \"serious situasenting Hopkins included T. lacrosse a cleaner and better<br />\nsiders as well.<br />\ngreat interest to his address.<br />\ntion\" to the attention of the Amer- Reese Marsh, E. Paul Sylvester, game. The use of the \"Judge of<br />\n\"We hold ourselves Christians, Upon conclusion of the address ican Olympic Association. This<br />\nWalter Sullivan, Phillip Pease, A. Play\" is left to each college, but it<br />\nand must try to live as such,\" be- the members of the club will with- was one of the most important<br />\nM. Cleveland and Miss Maude is very probable that the employgan Dr. Coale. Abstractness is draw to the Johns Hopkins Club, acts of the National Collegiate<br />\nKemp, the latter a graduate stu- ment of the newly instated official<br />\neasy to fall into. It has been said where a banquet will be served. Athletic Association 'meeting, held<br />\ndent. The delegation was headed will be universal.. Judge of Play<br />\nrepeatedly that the doctrive of<br />\nSix Seniors Elected<br />\nat Atlanta on December 26, 27 and by E. A. Schaal, collegiate secre- will introduce substitutes and<br />\nChrist is the only basis on which<br />\ntake charge of men put out of the<br />\nAt a recent meeting of the 28. Dr. Ray Van Orman, director tary.<br />\nthe world can exist: Therefore, Board of Governors of the club six of athletics at Hopkins, also atgame for a period of time as a penGroup discussions of the major<br />\nthe world looks to Christianity in Seniors were elected to member- tended this conference.<br />\nalty.<br />\nproblems<br />\nof Chirstian thought in<br />\nits present need..<br />\nThe meeting at which this deship. The new members from the<br />\nThe resolution drawn up by the<br />\ns First of all, Christianity must be 1924 class are: I. Willis Russell, committee was adopted by the as- the world today were featured in cision was made was an important<br />\nthe program. The 7,000 delegates one.<br />\nthought of as something we can William G. Dean, Jr., J. Edward sociation. The resolution concludIt was held at the Hotel<br />\nare divided into 50 groups, which<br />\nrecognize. This has been known Mount, J. Milton McDaniel, Ben- ed: \"Resolved, That the serious<br />\nPennsylvania, New York, on Satmet each day of the convention. urday,<br />\nfrom Jesus himself, who said, \"By jamin P. Thomas, and T. Reese situation be made known to the<br />\nDecember 15, and was diDr.<br />\nSherwood Eddy of New York, vided into<br />\ntheir fruits shall Ye know them.\" Marsh. According to a consti- American Olympic Association<br />\ntwo sessions; a mornWe want some genuine mark of tutional ruling of the club the quo- and to the public, that the Presi- considered the outstanding stu- ing session when schedules were<br />\ndistinction about us. The great ta from any one class cannot ex- dent of the American Olympic As- dent leader in the world, was one arranged, and an afternoon session when changes in rules and in<br />\ntrouble about the idea of Chris- ceed eight in number. Accord- sociation be asked to take cogni- of the principal speakers.<br />\nAmong the subjects already dis- the constitution were discussed.<br />\ntianity is the lack of definiteness. ingly the 1924 quota is completed, zance of the present situation, and<br />\nThe whole thing must be reduced the other two members being institute the necessary reforms in cussed was the question whether The only change in the constituto a few essential facts; standard- Randolph Norwood, who is sec- order that the participation of the any discrimination should be tion was that of admission to<br />\nization is needed. Standardized retary-treasurer of the club, and United States may be really na- made in colleges or in society membership in the league. New<br />\nagainst negroes, Chinese or Japa- members can now be admitted by,<br />\nmeasures exist in the business John H. Croker. Several mem- tional in character.\"<br />\nnese; whether compulsory mili- a two-thirds vote instead of unancivilizaall<br />\ntendency<br />\nof<br />\nof<br />\nbers<br />\nthe<br />\nWorld; the<br />\n1925 class will be electOlher parts of the resolution<br />\ntion is toward standards of meas- ed at a meeting of the Board of criticized the American Olympic tary training should be continued imous vote which' was formerly<br />\nurement. Why cannot the idea be Governors to be held some time Committee for turning over the in colleges and universities, and the rule.<br />\n18 Organizations Represented<br />\nduring the spring months.<br />\ncarried ovef to Christianity?<br />\nOlympic tryouts to the A. A. U., whether Amcirca has any obligation<br />\nto<br />\naid<br />\nEighteen<br />\nin<br />\nsettlement<br />\nthe<br />\nof<br />\norganizations were<br />\nThe clubroom, which is located which it was declared had resulted<br />\nFavors League of Nations<br />\nrepresented in the gathering<br />\nDr. Coale spoke decisively in<br />\nin \"lack of a definite program,\" European problems.<br />\nContinued on page 3 col. 2<br />\nThere were 24 students from mong- them Johns Hopkins whose<br />\ndiscussing the criteria by which a<br />\nand the ensuing \"serious situaBaltimore colleges and universi- delegates were \"Father Bill\"<br />\nChristian nation is to be judged. MUSICAL CLUB TO GIVE AN- tion.\"<br />\nSchmeisser, Captain Turnbull and<br />\nNUAL BELAIR CONCERT<br />\n\"A Christian nation,\" he said, \"is<br />\nWhen told of the stand taken by ties who attended.<br />\nManager Perkins. The other<br />\na nation that has the spirit of<br />\nNEXT FRIDAY<br />\nthe National Collegiate A. A. crititeams<br />\nrepresented at the conferJesus so completely in its soul that<br />\nThe Musical Club will give its cizing arrangements made for col- MEETING OF HONORARY<br />\nence<br />\nwere<br />\nHobart, Syracuse, Yale,<br />\nit has no regard for its national annual Belair concert on Friday, lege participation in Olympic tryFRATERNITY TO BE HELD<br />\nHarvard<br />\nand<br />\nCornell of the northsufTHIS MONTH<br />\nsafety when the welfare . of a<br />\nJanuary 11, 1924, at the Belair Ar- outs, officials of the American<br />\nern<br />\ndivision;<br />\nSwarthmore Unifering people is concerned. I don't mory. The Hopkins Glee Club is Athletic Union issued the followThe Johns Hopkins chapter of<br />\nversity,<br />\nLehigh,<br />\nand Stevens of<br />\ncare who knows that I believe in one of the best trained male chor- ing statement:<br />\nthe Pi Delta Epsilon Honorary<br />\nthe southern division, and Navy,<br />\na league of nations, the League of uses in the East, being trained by<br />\n-Opportunity for the college as- Journalistic Fraternity will hold a<br />\nPrinceton, Rutgers, Mt. WashNations, or anything which we Mr. Charles Bocheau, the best sociations holding membership in meeting during the early part of<br />\nington<br />\nClub, Crescent Club, and<br />\ncan join to help the world out ot known chorus leader of Baltimore. the American Olympic Associa- this month. This society, which<br />\nWilliams.<br />\nWilliams College is<br />\nits present mess.\"<br />\nThe singers are chosen by com- tion to conduct preliminary Olym- was brought to Hopkins during<br />\nstarting<br />\nlacrosse<br />\nthis year.<br />\nA Chinese student .once objected petition from the students of the pic tryouts already has been grant- the early part of'last year, was esThe University of Maryland<br />\nto our industrial system as a prod- University, and consequently are ed by the Olympic Committee. tablished for the purpose of raiswas admitted to membership in<br />\nuct of our \"Christianity.\" Stand- the pick of Hopkins vocal talent. \"At its meeting. October 25, ing the standards of college jourthe southern division of the<br />\nards are necessary here, just as<br />\nThe Glee Club at Hopkins has and upon the recommendation of nalism and to honor those men United States<br />\nIntercollegiate Lathey are necessary in home life. It been prominent since the early President William C. Prout of the who have attained distinction in<br />\ncrosse League. Maryland's entry<br />\nis with problems such as these days of the University. The Club A. A. U., plans were approved this type of work. Membership is<br />\ninto the league will greatly inthat Christianity should concern of 1886 was probably the most fa- whereby the Intercollegiate A. A., based upon merit alone and is recrease interest in the Hopkinsitself. We who call ourselves mous of all the Clubs. In that the Western Conference, the Pa- stricted to those who have served<br />\nMaryland lacrosse tilts. The<br />\nChristians must make Chirstianity year Woodrow Wilson was first cific Coast Conference, and the faithfully upon one of the college<br />\nmembership of the northern diviattractive and effective for oth‘Js. tenor in the quartet, and Newton National Collegiate A. A. itself are publications for at least two years. sion<br />\nwas augmented by Penn.<br />\n\"There must be something sacred D. Baker sang in the chorus. This to consider4their anaual track 'and<br />\nThe emblem of the society con•<br />\nState.<br />\nabout our own characters that we was the first club to sing the now'fietel meets as preliminary Olym- sists of a trapezoidal shaped gold<br />\nHopkins Graduate President<br />\nwill not compromise,\" said the famous University Ode.<br />\npic tryouts, and send the winners watch charm with the three Greek<br />\nA Johns Hopkins graduate, D.<br />\nSpeaker. We must hold high<br />\nThe Banjo Club is of more re- of each of the events to the final letters, Pi Delta Epsilon, upon it D. Lawton, was elected president<br />\nideals of sexual purity; we must cent organization, but is already Olympic tryouts, which are to be in black enamel.<br />\nof the league. C. P. Collins, of<br />\nmake a decision of the question of well known for its excellent per- conducted at the Harvard StadiFamous Men Enrolled<br />\nCornell, was chosen for vice-presidrinking; and we must adopt the formances. An outgrowth of the um, June 13 and 14.\"<br />\nThe society includes upon its dent, B. C. Barber, Harvard, was<br />\nstandard of honesty.<br />\nBanjo Club is the Black and Blue<br />\nmembership roll the names of re-elected<br />\nsecretary - treasurer;<br />\n\"We have in Jesus a faultless Jay Six, purveyors of toe tickling<br />\nJUNE WEEK DATES<br />\nsome of the country's outstanding and Albert B. Baker, Swarthluodel,\" concluded Dr. Coale. \"We dance music, who officiate after<br />\nANNOUNCED<br />\npersonages in the journalistic field. more, elected to membership of<br />\nCheck our lives by His. Let us try the formal concert has ended. The 1924 June Week will start Irving Cobb and the late Presithe Executive Board; W.H. Fries,<br />\nfor the sake of our world, develop- Some of the best jazz artists of Saturday, June 7, and will con- dent<br />\nHarding are representative Cornell, was re-appointed head<br />\ning civilization, and institutions to Baltimore compose this Hopkins tinue until Thursday, June 12.<br />\nof the type of men belonging to referee.<br />\nadopt standards in Christianity. sextet, and it is a featured part of The committee has two new the organization.<br />\nAt the meeting it was anJust as the business and intellectual all concerts of the Hopkins Mu- features planned which will not<br />\nThe Hopkins chapter was in- nounced that the medals won last<br />\nWorlds have done.\"<br />\nbe \"uncorked\" until a later date. stalled last year by a delegation year by Hopkins and Cornell<br />\nsical Clubs.<br />\nIt<br />\nis expected that these innova- from the George Washington Uni- would be awarded during the winDinners Open to All<br />\nThose who attended the contions<br />\nwill arouse great enthusi- versity. There are at the present ter. A change in rules was made<br />\ndiscussion,<br />\nit was cert last year will remember the<br />\nAfter a short<br />\nasm.<br />\ndecided that the faculty and for- act of \"Dal\" Kirwan, blackface<br />\ntime ten members of the society at allowing a penalty to be declined<br />\neign students would he invited to comedian. His successor has had<br />\ncollege. The officers of the chap- and goal counted when the penalNOTICE<br />\nfuture Fellowshop Dinners. Al- the benefit of his advice, and the<br />\nter are Fitzgerald Dunning, presi- ty occurs on the same play that<br />\nBarnstormers' Meeting at<br />\nthough foreign students have act of the new f'coon\" is one of the<br />\ndent; Joseph Leopold, vice-presi- the goal is made. The head refBeta<br />\nTheta Pi House tonight<br />\nnever been excluded, they will be outstanding points of this year's<br />\ndent; Reese Marsh, secretary; and eree was authorized to make out<br />\nat 7.30.<br />\nperformance.<br />\nEarl Donaldson, treasurer.<br />\nContinued on page 4, col. 4<br />\nContinued on Page 2, col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, JANUARY 4, 1924<br />\n<br />\n2<br />\n<br />\nBOWERY BALL TO TAKE HOPKINS CHRISTMAS VACA- is given a full month off. At Dartmouth, Penn. State, and Cornell,<br />\nTION ONE OF SHORTEST<br />\nPLACE OF JUNIOR PROM<br />\nstudents come from all over<br />\nwhose<br />\nvacation,<br />\nChristmas<br />\nHopkins'<br />\nJunior Class Plans Roughneck -Party<br />\nthe recess is three<br />\ncountry,<br />\nthe<br />\nis<br />\ndays,<br />\nAffair.<br />\nten<br />\napproximately<br />\nFormal<br />\nlasting<br />\nInstead of Usual<br />\nthus allowing stulong,<br />\nArranged<br />\nweeks<br />\nAlso<br />\nSmoker<br />\nany<br />\nto<br />\noffered<br />\nshortest<br />\nFOUNDED 1897<br />\none of the<br />\ntime to make the<br />\nsufficient<br />\ndents<br />\nroughneck<br />\nRutgers<br />\ncountry.<br />\na<br />\nin<br />\ncollege in the<br />\nA \"bowery ball\"<br />\nhome.<br />\njourney<br />\nlong<br />\ninstituother<br />\nare<br />\nand C. C. N. Y.<br />\n$2.00 dancing joint with a fake police<br />\nSubscription<br />\nhaving less than a fortnight. At most universities, fourteen<br />\ntions<br />\nevethe<br />\nraid towards the end of<br />\nIn the larger colleges where the days is the length of the vacation.<br />\nbeing planned by the<br />\nis<br />\nning<br />\nat<br />\nPostoffice<br />\nstudent body is composed mainly Columbia, Princeton, and the U.<br />\nEntered as second-class matter December 3, 1909, at the<br />\nJunior Prom Committee to replace of out of town men, who live on of P. have the two week recess.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthe usual formal prom of preced- the campus, the Christmas holi- It is pointed out by Hopkins<br />\ncon- day is a good deal longer than at authorities, however, that the<br />\nPublished semi-weekly from October to June by the students of Johns ing years. The committee,<br />\nHopkins University.<br />\nsisting of Gump, Urner, and those colleges where the majority Baltimore institution is one of the<br />\nWales, thought this innovation of men commute from home. At last to open in the fall, and among<br />\nRensellaer Polytechnic Insti- the first to complete final examiBusiness communications should be addressed to the BUSINESS MAN- would prove popular, and after re- the<br />\ncommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nceivirig a promise of hearty sup- tute, for instance, the Senior class nations.<br />\nshould be sent to the MANAGING EDITOR.<br />\nport at a recent class meeting,<br />\nhave gone ahead with their plans,<br />\nHomewood 100 which are now rapidly nearing<br />\nTelephone<br />\nnearing completion. The affair<br />\nwill be held in the Civil EngineerBusiness Manager<br />\nEditor-in-Chief<br />\ning Hall on the evening of FebruPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\nary 22. The stunts and decoraManaging Editor<br />\nAdvertising Manager<br />\ntions for this affair are promised<br />\nWILLIAM G. DEAN, JR., '24<br />\nFITZGERALD DUNNING, '24<br />\nto be the talk of the school for<br />\nAssistant Managing Editor<br />\nA TRUE friend is a staunch<br />\nsome time. •<br />\nCirculation Manager<br />\n4-2- one—always reliable. Men<br />\nf.:1' I l r'if<br />\nT. REESE MARSH, '24<br />\n01.1,11k..<br />\nJOHN C. LEWIS, JR., '24<br />\nThe date of the Junior Smoker<br />\n•<br />\nwho bought their Rubberset<br />\n0,01<br />\niftia<br />\nI:1<br />\nAssociate Editors<br />\nShaving Brushes way back in<br />\nI<br />\nhas also been announced. It will<br />\nAssistant Business Managers<br />\nigr<br />\n1888, when we first started, still<br />\nRICHARD C. TILGHMAN, '25<br />\nbe held January 12, the second<br />\nD. MILES MARRIAN,'25<br />\nr<br />\nfind them the same reliable friends<br />\nJOHN W. PARSONS, '25<br />\neach morning.<br />\nG. DONALD GIESKE,'25<br />\nBENJAMIN T. ROME-,'25<br />\nSaturday after the Christmas vaT. DIXON, '24<br />\nJOHN<br />\nHotel.<br />\nHoward<br />\nNew<br />\nthe<br />\nat<br />\nRubbersets are always ready<br />\ncation,<br />\nJunior Editors<br />\nA. J. McICAY, '26<br />\nto whip up a big, speedy lather<br />\nARTHUR L. NELSON, '26<br />\nDanny Klein, chairman of the<br />\nthat works down to the very<br />\nC. EUGENE TOVELL,'24<br />\nERNEST A. STRATHMAN, '26<br />\nprovide<br />\nto<br />\npromises<br />\nroots of the hair—holding each<br />\ncommittee,<br />\n'26<br />\nIII,<br />\nJ.<br />\nKETLER,<br />\nOTHO<br />\nALGER G. Hiss, '26<br />\nerect, easy to cut.<br />\nbeer,\"<br />\nPhiladelphia<br />\nEDWARD 0. MICHEL, '26<br />\n\"good old<br />\nJ. JACKSON KIDD, '26<br />\nCHARLES G. HUTZLER, '24<br />\nT. STRAN SUMMERS, '25<br />\nalong with a light buffet luncheon.<br />\nJAMES YOUNG, '25<br />\nGripped in rubber—<br />\n'27<br />\nJR.,<br />\nE.<br />\nBOYCE,<br />\nHEYWARD<br />\nThe entertainment for the evening<br />\nHENRY R. TURNBULL, '26<br />\nguaranteed<br />\nSTANLEY R. LEVY, '27<br />\nHAROLD S. GOODWIN, '26<br />\nNvill consist of Kelly's Orchestra,<br />\nThere is reason for Rubberset's<br />\nFargo's \"catarrh,\" and Magill's<br />\nremarkable service. Every Rubberset bristle is gripped everlasthumor. Despite the large number<br />\nMember Southern Intercollegiate Newspaper Association<br />\ningly in hard rubber—it can't<br />\nof attractive features promised for<br />\ncome out, get mixed with the<br />\nlather—hinder shaving.<br />\nthe affair, the price has been kept<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ndown to $1.25.<br />\nJust for added certainty, Rub-<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nNever flunks<br />\n—this lifetime friend<br />\n<br />\nNEW LACROSSE OFFICIAL<br />\n*<br />\nContinued from page 1<br />\n<br />\nBALTIMORE, MD., JANUARY 4, 1924<br />\n<br />\na list of twenty-five officials to be<br />\npublished in the Lacrosse Guide<br />\nfor the use of the colleges. The<br />\n\"-- AND A HAPPY NEW YEAR\"<br />\nmaximum pay of officials was inCompletion of the first unit of the Memorial Dormitory, the be- creased from ten to twenty-five<br />\nginning of construction upon the new Chemical Laboratory, and dollars.<br />\nmarked progress in athletic and non-athletic activities was Johns<br />\nWESTERN UNION HUMOR<br />\nHopkins University's share of the favor bestowed by our departed<br />\nIt has been reported that a cerfriend—Nineteen Hundred and Twenty-three, A. D.<br />\ntain young married man of this<br />\nPerhaps the most important event upon the 1923 calendar was<br />\nthe occupation of the Dormitories. This marked the introduction<br />\nof college life and a new brand of college spirit. Important, toc,<br />\nto the welfare of the University, already greatly overcrowded, was<br />\nthe announcement of a new Chemical Laboratory Building which<br />\nwill provide a home for wandering chemists, hitherto greatly handicapped in their work.<br />\n<br />\nberset Brushes are guaranteed—<br />\nunconditionally. The bristles<br />\nstay in. Each brush makes good<br />\n—or we do. Get this prime essential to a clean, cool shave ...<br />\ntoday ... at any store on the<br />\ncampus. Made by Rubberset<br />\nCompany,Newark, N.J., U. S. A.<br />\n<br />\nALBRIGHT<br />\n<br />\nuniversity burst into a telegraph office in the wildest excitement recently and wired his wife's relations<br />\nas follows: \"Twins today; more tomorrow !\"—Exchange.<br />\n<br />\nAthletics at Johns Hopkins during 1923 made rapid strides. The<br />\ntrack Steam, with two stars of the first magnitude, attracted national<br />\nattention and startled the country's sport fans by scoring twelve<br />\npoints, a hitherto unprecedented count for a small college, at the I. C.<br />\nA. A. A. A. meet in Philadelphia. The lacrosse team, by capturing<br />\nthe Southern Intercollegiate Lacrosse Title, brought renown to Hopkins.<br />\nThe 1923 football team, however, with no championship to its<br />\ncredit, was the pride of the University. With mediocre material,<br />\nCoach Van. Orman entered the season greatly handicapped. The<br />\nteam held Princeton 16-7 and lost to Cornell by a large score. Although all other games were w,on, the Black and Blue entered the<br />\nMaryland contest without being conceded a chance. How Maryland only succeeded in tying the score in the dying moments of the<br />\ngame is a matter of history. Suffice to say, Hopkins gained more<br />\nfriends on Thanksgiving Day, 1923, than ever before in its history.<br />\nNon-athletic activities, too, contributed to the general trend of<br />\nimprovements and progress. Noteworthy events in this line included<br />\nthe introduction of an elaborate and successful June Week, the enlargement of the activities of the Dramatic Club as \"Barnstormers\"<br />\nand marked extension in the work of the hitherto dormant Publicity<br />\nBoard.<br />\n1924 lies before us as a blank pad of pure white paper. The<br />\nprogress of 1923 was not so extensive as to prevent further advancement. More buildings, especially a gymnasium, are needed. Athletic and non-athletic activities may be brought closer to the standards in vogue at large colleges. And it is the undergraduate body<br />\nthat must guide the pen along these blank sheets.<br />\n<br />\nWhat a difference<br />\njust a few cents make!\"<br />\n<br />\nFATIMA<br />\n<br />\n\f1.<br />\n5.<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY, 4 1924<br />\nEACH STUDENT COSTS YALE HOPKINS R. 0. T. C. MAY<br />\nLITERARY FRATERNITY<br />\nLOSE STAFF OFFICER<br />\nTHREE TIMES HIS FEES<br />\nJUST<br />\nHELD<br />\nMEETING<br />\nHopkins Unit of the R. 0.<br />\nThe<br />\nBEFORE HOLIDAYS •<br />\nYale University spends for each<br />\nT. C. may lose one of its best<br />\nThe Purple Gown Chapter of student an average of three times known staff officers, Captain Dathe national literary society, the his fees. According to figures vis, who is expecting to leave for<br />\nSigma Upsilon, held a meeting on based on the .University treas- Panama in the near future. CapDecember 21, the last Friday be- urer's report for the academic tain Davis arrived at Hopkins last<br />\nin<br />\nfore the Christmas holidays. Dr. year 1922-1923, the university spring and has been engaged<br />\nthe<br />\nFreshmen.<br />\nof<br />\nHall, of Ruxton, a teacher at made an average expenditure of the instruction<br />\nSmith College, was the principal $835 for the year 1922-1923, as He is probably one of the best<br />\ncompared with an average pay- known staff officers since he is not<br />\nspeaker.<br />\nwith all<br />\nThe members discussed some ment of $267 made by each stu- only in intimate contact<br />\nbeen<br />\nalso<br />\nhas<br />\nthe. Freshmen, but<br />\nof the different forms of poetry dent.<br />\nnearly<br />\nor<br />\nall<br />\nIn the university budget for the in direct command of<br />\nwhich they are attempting to<br />\nIt is<br />\nhelpful<br />\nvery<br />\nyear, only 26.6 per cent of the to- all of the drills this season.<br />\nwrite and received<br />\nDavis<br />\ncriticism from Dr. Carol Wight. tal income was derived from tui- expected that, if Captain<br />\nwill take<br />\nIt was also announced at the tion and fees for that purpose. Of leaves, Major Hoisington<br />\nFresh,<br />\nthe<br />\nof<br />\ninstruction<br />\nthe<br />\nover<br />\nInstiPeabody<br />\nthe total expenditure 39.4 per cent<br />\nmeeting that the<br />\nmen.<br />\nnumerous<br />\nover<br />\nwas made for instruction. The<br />\ntute had turned<br />\nclippings to help the society in its other expenditures were in the folCollege and Fraternity Stationery<br />\npreparation of the biographies of lowing proportions:<br />\nBanquet and Dance Cards, Invitations<br />\nFor property, 19.6; annuities<br />\nMaryland literary men.<br />\nJAS. H. DOWNS<br />\nNo new members were elected and adjustments, 10.8; administo the society at the last meeting. tration, 7.8; laboratories, 7.2; im- ENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nThe emblem of -the society con- provements, 4.4; scholarships, 4.4;<br />\ngreen<br />\nlibraries, 3.9; and printing, 2.5.<br />\nsists of a gold pin, bearing a<br />\nTHE DINING ROOM OF<br />\nscarab encircled by the two words, The University income was derived from the several sources,<br />\nTHE HOPKINS<br />\nPurple Gown.<br />\nat 31st. and St. Paul Streets<br />\nThe officers of -the- society .are 52.5 being from investments; 26.6,<br />\nRandolph ---N-or wood,- - president; tuition and fees; 7.3, dormitory<br />\nServes Regular—<br />\n7.30 to 10 A. M<br />\n$ .75<br />\nMilton McDaniels, vice-president; rent; 7.2, alumni fund; 3.9, gifts, Breakfast,<br />\n.65<br />\n12 to 2 P. M<br />\nLunch,<br />\nWillis Russell, secretary; Ben and 2.5, miscellaneous.<br />\nDinner, 6 to 7.30 P. M...$1.00 & 1.25<br />\nThe expenditures and the payThomas, treasurer, -and Reese<br />\nOR A LA CARTE<br />\nper student in the freshman<br />\nments<br />\n'curator.<br />\nMeal Hours Sunday and Holidays<br />\nMarsh,<br />\n12 to 2 P. M.<br />\nM.<br />\nyear were more closely related 8 to 10.30 A.<br />\n6 to 7.30 P. M.<br />\nBRASS BUTTONS APPEAR ON than .in any other section of the<br />\nLuncheon and Dinner Parties at<br />\nuniversity. Yale College (the acaARMY UNIFORM<br />\nReasonable Rates<br />\nThe appearance of uniforms has demic department), whose stu<br />\nbeen increased a hundred per cent dents paid about half the amount<br />\nby the brilliant buttons of gleam- expended for them, was second to<br />\ning brass such as those which have the freshman year in the relation<br />\nbeen worn for many years by Brit- of its expenditures and payments<br />\nish army men, officers of the Hop- per student, the expenditure being<br />\nkins military believe. The old dull less than $835 per student, but<br />\nbuttons were replaced recently on greater than that of the freshman<br />\nthe coats of enlisted men and offi- year.—Exchange.<br />\ncers with shiny buttons. Orders<br />\nfoLtheshange.eame from the miliDARTMOUTH STUDENT<br />\ntary department at Washington,<br />\nCOUNCIL FROWNS ON<br />\nand now every soldier in the counINTOXICANTS<br />\ntry is wearing the newly preThe 1924 Palaeopitus, Dartscribed brass fasteners and collar mouth's senior student governand cap ornaments. This change ing council, has gone on record as<br />\nwill not affect the R. 0. T. C. men being opposed to the drinking of<br />\nwho drill on the quadrangle.<br />\nintoxicating liquors by underFurther, the order specifies that graduates, and suggests that the<br />\nthe Corps of Engineers shall wear administration reconsider its decitheir insignia on areir buttons in sion to abolish the Junior Prom,<br />\nbas-relief instead of the custom- offering to accept responsibilty of<br />\nary eagle. After high army offi- seeing that house parties are propcers had noticed the neat appear- erly conducted.<br />\nance of those in the British army, In a declaration of policy the<br />\ndecision was made to discard the Palaeopitus stated: \"Since it is<br />\ndrab buttons.<br />\napparent that the drinking of inThis order, given out October toxicating liquors cannot but sul16, was carried out in the Third ly the good name of the college,<br />\nCorps Area, which includes the Palaeopitus sets itself down as<br />\nJohns Hopkins military instructors vigorously opposed to such drinkand the change has been noticeable. ing in Hanover and wherever the<br />\nname of Dartmouth is concerned.<br />\nPRESIDENT GOODNOW PRE- \"This does not mean that PaSENTS GOLD FOOTBALLS<br />\nlaeopitus shall constitute itself a<br />\nTO ALL-MARYLAND MEN<br />\npolice force to parade Hanover<br />\nthe<br />\nbefore<br />\nassembly<br />\nstreets in search of violators. It<br />\nAt the last<br />\nGoodPresident<br />\ndoes mean, however, that any perrecess,<br />\nChristmas<br />\nto<br />\nfootballs<br />\ngold<br />\nnow presented<br />\nsistent violation on the part of any<br />\nwon<br />\nwho<br />\nplayers<br />\nindividual or fraternity will bring<br />\nthose Hopkins<br />\nTeam<br />\n-Maryland<br />\nimmediate measures to protect<br />\nplaces on the All<br />\nthe reputation of the college.\"—<br />\npicked .by the \"Sun\".<br />\nBefore the presentation, Dr. Exchange.<br />\nGoodnow said a few words in<br />\nPublished in<br />\nTUDOR-STUART<br />\nthe interest ofElecPraise of the whole team, whose<br />\nContinued from page 1<br />\ntrical Development by<br />\nsuccess he attributed to highly deHall,<br />\nGilman<br />\non<br />\nof<br />\nthe<br />\nfloor<br />\nthird<br />\nan<br />\nprofessed<br />\nInstitution that will<br />\nHe<br />\nteamwork.<br />\nveloped<br />\nexthe<br />\nhas<br />\nwith<br />\nbe<br />\nbeen<br />\nhelped by whatcompleted<br />\nathletHopkins<br />\nin<br />\ninterest<br />\ngreat<br />\never helps the<br />\nics, and declared himself especial- ception of the furniture, it having<br />\nIndustry.<br />\nly well pleased that the Universi- been impossible thus far to obty had been represented by such a tain any which was entirely suitable. Upon completion of the<br />\ncapable football team.<br />\nroom the club's collection will be<br />\nand<br />\nRich,<br />\nTurnbull, Magill,<br />\nWolbert, were awarded gold foot- moved into the bookcases which<br />\nballs, but Magill and Rich were line the oak-paneled walls.<br />\nabsent at the presentation.<br />\nHe—\"Aw, come out for a ride<br />\nMike—\"Have they taken your tonight, I'm harmless.\"<br />\nPerfect Lady—\"Say, who wants<br />\ntemperature yet?\"<br />\nPat—\"No, Oi haven't missed any- to go out for a ride with a guy that<br />\nthing but me watch.\"—Exchange. is harmless ?\"—Exchange.<br />\n<br />\nOUR MEN'S SHOP<br />\nSpecializes in<br />\n<br />\nDistinctive Furnishings<br />\n—the kind that is being sought<br />\nby the exacting college man.<br />\n<br />\nHUTZLER NOTHEIZ<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD.KOHN $cCo.<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n25reornerayeile and glutaw<br />\n<br />\nSts.<br />\n<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\n.7(<br />\n<br />\n1.4<br />\n<br />\n—are you sure<br />\nyou deserve .<br />\n•<br />\n<br />\n\"Give me a log with Mark Hopkins at one end<br />\nof it and' myself at the other,\" said, in effect,<br />\nPresident Garfield, \"and I would not want a<br />\nbetter college.\"<br />\nBut if Mark Hopkins was an inspired teacher,it<br />\nisjust as true thatJames A.Garfield was an inspiring student.<br />\nSometimes Garfield's praise of his professor is<br />\nquoted in disparagement of present day faculties<br />\n—the assumption being that we as listeners are<br />\nsympathetic, all that we ought to be—and that<br />\nit is the teacher who has lost his vision.<br />\nIs this often the case?<br />\nIt is the recollection of one graduate at least<br />\nthat he did not give his professors a chance. Cold to<br />\ntheir enthusiasms, he was prone to regard those<br />\nmen more in the light of animated text-books<br />\nthan as human beings able and eager to expound<br />\ntheir art or to go beyond it into the realm of his<br />\nown personal problems.<br />\nThis is a man to man proposition. Each has to go<br />\nhalfway. Remember,there are two endsto thelog.<br />\n<br />\ntern Electric Co<br />\n<br />\nan<br />\n<br />\nWherever people look to electricity for the<br />\ncomforts and conveniences oflife today, the<br />\nWestern Electric Company offers a service as<br />\nbroad as the functions of electricity itself.<br />\nNumber 33 of a series<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 4, 1924<br />\n<br />\n4<br />\n<br />\nmedal was presented to Douglas<br />\nSHIRT MAKER<br />\nTurnbull, Jr., for all-around foot226 N. Liberty St.<br />\nball ability. It was announced<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\nHopkins blankets would be<br />\nthat<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nFifteen Letters Awarded at Annual Banquet. Turnbull Given awarded to the H men as a reward<br />\nTerms.Cash, Less 10% 30 Days on Shirts<br />\nfor' their successes.<br />\nEvening Sun Medal<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br />\n<br />\nThomas P. Magill Chosen to<br />\nLead 1924 Football Team<br />\n<br />\nSTRATTON<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nmore likely to be present if they<br />\nOWNERS<br />\nare especially asked to come.<br />\nVtIC<br />\n'<br />\negilt r4P<br />\n?•1?d11)E* •<br />\n29 E. BALTIMORE ST.<br />\nThe next Fellowship Dinner<br />\nwill be held at the Friends Meet- Agents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\ning-House on Tuesday, January<br />\n15, at 6 P. M. Ex-Governor Cornwell, of West Virginia, now head<br />\nof the legal department of the 3. \"Baltimore's Most Complete Sport<br />\nStore\"<br />\n& 0. Railroad, will speak.<br />\nThe meeting ended with the<br />\nsinging of \"Blest Be the Tie That<br />\nQuality<br />\nBinds.\"<br />\nATHLETIC & SPORTING<br />\nEQUIPMENT<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nHOSIERY<br />\n<br />\nXatterie)<br />\nCelbe<br />\n'Am ES H.& OSCAR G•10111f<br />\n<br />\nDR. COALE SPEAKS<br />\nContinued from page 1<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nBachrach Rasin Co.<br />\n<br />\nLimited<br />\n<br />\nEllGRAVERS<br />\n<br />\nPRMTERS<br />\n<br />\nBMDERS<br />\n<br />\nMaryland Agents for<br />\nWright & Ditson Victor Co.<br />\nCampus Agent, \"BUCK\" BONNER<br />\n<br />\nBARN CAFETERIA<br />\nCollele<br />\n<br />\nLiterature<br />\n<br />\n14 N. HOWARD ST.<br />\n<br />\nBALTIMORE<br />\n<br />\n\"exftezte'ezede\"<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nif<br />\n<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nURNER'S<br />\n<br />\n— Printers of —<br />\n<br />\nSOPHISTICATED<br />\n<br />\n(The Johns Hopkins<br />\nNEWS-LETTER<br />\n<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\n<br />\nLOM13ARD and SOUTH STREETS<br />\n<br />\nMEN'S SHOES<br />\n...J.A.,00\"SRRI,<br />\n•<br />\nA<br />\n<br />\nOf the Better Class<br />\n<br />\n—Courtesy Baltimore American.<br />\n<br />\nLIBERTY ST.<br />\n<br />\nURNER BROTHERS<br />\n<br />\nAT SARATOGA<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br />\n<br />\nThomas P. Magill, '25, was Schacht, Taylor, Maxwell and<br />\nLUNCHEON<br />\nelected captain of the 1924 foot- Cook. The aHa was awarded to<br />\nTEA<br />\nball team at the annual football Gilliece Levy. S. Carr, Milanouand<br />\nG.<br />\nM.<br />\nShriven<br />\nsky,<br />\nYoung<br />\nEstablished 1873<br />\nDINNER<br />\nbanquet held Thursday, December<br />\nBonner, as captain of the 1923<br />\nA. H. FE-I-TING MAN'FG<br />\n20, at the Alumni Memorial Dor- eleven, thanked the alumni and the<br />\nJEWELRY CO.<br />\nSPECIAL PARTIES<br />\nmitory. The guests included the student body for the whole-heart- 11.30 A. M.<br />\nChesebrough Mfg.Co.<br />\nManufacturers<br />\nuntil<br />\n(consolidated)<br />\nJewelry<br />\nFraternity<br />\nLetter<br />\nGreek<br />\nfootball squad, alumni interested ed spirit with which they support7.30 P. M<br />\nPLAZA 6987<br />\n213 N. LIBERTY ST., Baltimore, Md. in football, prep school seniors and ed the team.<br />\ncoaches, and newspaper represen- Dr. Eveleth Bridgman gave an<br />\negggigf,r1-E-Q-15tiggr„,_..7ggimagr-r-ifu-a-470<br />\ntatives. Sixty men attended.<br />\ninteresting talk during which he<br />\nThe election of Magill to the<br />\nemphasized the need for co-operacaptaincy was no surprise. The<br />\nstar left tackle of three seasons tion between the Baltimore newsand individuality is offered here at prices that are not<br />\nwas chosen unanimously by his papers and the Hopkins Atheltic<br />\nand cannot be underquoted by any house at any time.<br />\nmates. Magill has brought honors Association. He showed how the<br />\n(I, Besides the reputation of an old-established firm<br />\nto the team and credit to the uni- backing of the newspapers was reis back of each sale with a guarantee.<br />\n\"The King of Lubricants\" versity during his football career sponsible for the large attendance<br />\nat Johns Hopkins.. Magill's unanat the Princeton-Navy fiasco and<br />\nSHERWOOD BROTHERS, INC.<br />\nimous .election is a deserving tribthe Army-Fleet farce. Fred Tur- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nIgNENgEOMERNILIt'AEENNEENECDITANEI ute to the esteem in which his<br />\n343 NORTH CHARLES STREET<br />\nteammates and the whole under- byville, sports editor of The Evening Sun, replied to Dr. Bridgman<br />\ngraduate body hold him.<br />\nBoys, the place to get your<br />\nthat after the Thanksgiving Day<br />\nDr. Brown Speaks<br />\nmeals—and they are honAfter the meal, Dr. Thomas game, the newspaper were conest-to-goodness meals, well<br />\nBrown, toastmaster, began the vinced that Hopkins was worthy<br />\nspeech-making by thanking the of support and that Hopkins could<br />\ns erve d, and reasonably<br />\nteam and the coaches on behalf of expect it in the future. Mr. Turbypriced—is at<br />\nthe Varsity Club and the alumni ville expressed his personal views<br />\nAt the Washington Monument<br />\nfor their excellent record during when he declared Hopkins had the<br />\nthe past season. He then called best football team in the state ot<br />\nOscar Thomas Olson, D.D.<br />\non Buck Bonner as president of Maryland during 1923.<br />\nMinister<br />\nthe A. A. Board to present the 14<br />\nOthers speakers included Dr.<br />\nto the members of the team. The Van Orman, Colonel Hinckley,<br />\nHopkins Students Are Invited to<br />\n1817 N. Charles St.<br />\nfollowing men received their H: Horace Burroughs, Dr. Harvey<br />\nMake This Their Church Home<br />\nCaptain Bonner, Manager Leo- Stone, Bill Schmeisser, Pop God(Half Block below North Ave.)<br />\npold, Rich, Wolbert, Carter, Slo- dard, Douglas Turnbull, Sr., and<br />\nThe purpose and program of th's<br />\nIvik,<br />\nDay,<br />\nMagill,<br />\nEvening<br />\nSun<br />\nBarton,<br />\nTom<br />\nMagill.<br />\nThe<br />\nBerndt,<br />\nChurch will appeal to you. Look in<br />\nNicholas Brown, Mgr.<br />\n<br />\nVaseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nif4-icoTron 311<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nMount Vernon Place ethodist<br />\nEpiscopal Church<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nSunday morning worship at 11 o'clock.<br />\n<br />\nTailors<br />\n<br />\nSunday evening service at 8 o'clock.<br />\n<br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br />\n<br />\nMusic by vested chorus—choir of soloists,.<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 23<br /><br />\nTHE JOHNS IIOPKINS NEWS-LETTER, JANUARY 4, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nDR. JAMES J. COALE SPEAKS DR. BURDAN TO ADDRESS DR. VAN ORMAN AND DR. NINE HOPKINS DELEGATES NEW<br />\nLACROSSE OFFICIAL<br />\nAT Y. M. C. A. FELLOWTUDOR-STUART CLUB<br />\nABERCROMBIE ATTEND<br />\nATTEND STUDENT VOLUNCREATED AT LEAGUE<br />\nSHIP DINNER<br />\nON JANUARY 11<br />\nATLANTA MEETING<br />\nTEER MEETING<br />\nMEETING<br />\nMakes Plea for Definite Standards in Six Seniors Elected to Membership. N. C. A. A. Criticizes U. S. Olympic Seven Thousand Students Present. Col- Two<br />\nMen Instead of One to Take<br />\nChristianity. Next Dinner JanClub Rooms Are Nearing<br />\nBody<br />\nor Discrimination Discussed<br />\nCharge. Maryland and Penn State<br />\nuary 15<br />\nCompletion<br />\nDr. Ronald T. Abercrombie, of<br />\nAdmitted<br />\nDelegates from the Johns Hop-<br /><br />\nOn Friday, January 11, at 5 P. Johns Hopkins University, headed kins<br />\nA: the last Y. M. C. A. FellowUniversity who have been at- \"Judge of Play\" is the name<br />\nship Dinner, held Tuesday, De- M., Professor Burdan, of Yale the committee which drew up a tending<br />\nthe Student Volunteer (riven to the new lacrosse official<br />\ncember 18, Dr. James J. Coale, University, will address a meeting resolution stating that the A. A.<br />\nMovement at Indianapolis re- recently created at the annual<br />\nExecutive Secretary of the Pres- of the Tudor and Stuart Club to U. has not \"announced a definite<br />\nturned Wednesday morning from meeting of the United States Inbyterian Board of Baltimore, be held in the auditorium of the list of coaches, trainers and manathe quadrennial meeting attended tercollegiate Lacrosse League.<br />\nspoke in favor of the adoption of Civil Engineering Building. This gers,\" and also has not furnished<br />\nby 7,000 students, representing As it is the duty of this new offidefinite standards in our Christian meeting, which will be open to \"a well-planned program of col- about<br />\n1,000 colleges and universi- cial to assist the referee in maklife. About 40 Hopkins students. the public, is expected to draw a lege participation in track and<br />\nties in America, and numerous ing decisions, it is believed that<br />\nmany of whom had heard Dr. large attendance, not only from field events in Olympic tryouts,\"<br />\nforeign institutions. Those repre- the action of the league will make<br />\nCoale speak before, listened with Hopkins students but from out- and calling this \"serious situasenting Hopkins included T. lacrosse a cleaner and better<br />\nsiders as well.<br />\ngreat interest to his address.<br />\ntion\" to the attention of the Amer- Reese Marsh, E. Paul Sylvester, game. The use of the \"Judge of<br />\n\"We hold ourselves Christians, Upon conclusion of the address ican Olympic Association. This<br />\nWalter Sullivan, Phillip Pease, A. Play\" is left to each college, but it<br />\nand must try to live as such,\" be- the members of the club will with- was one of the most important<br />\nM. Cleveland and Miss Maude is very probable that the employgan Dr. Coale. Abstractness is draw to the Johns Hopkins Club, acts of the National Collegiate<br />\nKemp, the latter a graduate stu- ment of the newly instated official<br />\neasy to fall into. It has been said where a banquet will be served. Athletic Association 'meeting, held<br />\ndent. The delegation was headed will be universal.. Judge of Play<br />\nrepeatedly that the doctrive of<br />\nSix Seniors Elected<br />\nat Atlanta on December 26, 27 and by E. A. Schaal, collegiate secre- will introduce substitutes and<br />\nChrist is the only basis on which<br />\ntake charge of men put out of the<br />\nAt a recent meeting of the 28. Dr. Ray Van Orman, director tary.<br />\nthe world can exist: Therefore, Board of Governors of the club six of athletics at Hopkins, also atgame for a period of time as a penGroup discussions of the major<br />\nthe world looks to Christianity in Seniors were elected to member- tended this conference.<br />\nalty.<br />\nproblems<br />\nof Chirstian thought in<br />\nits present need..<br />\nThe meeting at which this deship. The new members from the<br />\nThe resolution drawn up by the<br />\ns First of all, Christianity must be 1924 class are: I. Willis Russell, committee was adopted by the as- the world today were featured in cision was made was an important<br />\nthe program. The 7,000 delegates one.<br />\nthought of as something we can William G. Dean, Jr., J. Edward sociation. The resolution concludIt was held at the Hotel<br />\nare divided into 50 groups, which<br />\nrecognize. This has been known Mount, J. Milton McDaniel, Ben- ed: \"Resolved, That the serious<br />\nPennsylvania, New York, on Satmet each day of the convention. urday,<br />\nfrom Jesus himself, who said, \"By jamin P. Thomas, and T. Reese situation be made known to the<br />\nDecember 15, and was diDr.<br />\nSherwood Eddy of New York, vided into<br />\ntheir fruits shall Ye know them.\" Marsh. According to a consti- American Olympic Association<br />\ntwo sessions; a mornWe want some genuine mark of tutional ruling of the club the quo- and to the public, that the Presi- considered the outstanding stu- ing session when schedules were<br />\ndistinction about us. The great ta from any one class cannot ex- dent of the American Olympic As- dent leader in the world, was one arranged, and an afternoon session when changes in rules and in<br />\ntrouble about the idea of Chris- ceed eight in number. Accord- sociation be asked to take cogni- of the principal speakers.<br />\nAmong the subjects already dis- the constitution were discussed.<br />\ntianity is the lack of definiteness. ingly the 1924 quota is completed, zance of the present situation, and<br />\nThe whole thing must be reduced the other two members being institute the necessary reforms in cussed was the question whether The only change in the constituto a few essential facts; standard- Randolph Norwood, who is sec- order that the participation of the any discrimination should be tion was that of admission to<br />\nization is needed. Standardized retary-treasurer of the club, and United States may be really na- made in colleges or in society membership in the league. New<br />\nagainst negroes, Chinese or Japa- members can now be admitted by,<br />\nmeasures exist in the business John H. Croker. Several mem- tional in character.\"<br />\nnese; whether compulsory mili- a two-thirds vote instead of unancivilizaall<br />\ntendency<br />\nof<br />\nof<br />\nbers<br />\nthe<br />\nWorld; the<br />\n1925 class will be electOlher parts of the resolution<br />\ntion is toward standards of meas- ed at a meeting of the Board of criticized the American Olympic tary training should be continued imous vote which' was formerly<br />\nurement. Why cannot the idea be Governors to be held some time Committee for turning over the in colleges and universities, and the rule.<br />\n18 Organizations Represented<br />\nduring the spring months.<br />\ncarried ovef to Christianity?<br />\nOlympic tryouts to the A. A. U., whether Amcirca has any obligation<br />\nto<br />\naid<br />\nEighteen<br />\nin<br />\nsettlement<br />\nthe<br />\nof<br />\norganizations were<br />\nThe clubroom, which is located which it was declared had resulted<br />\nFavors League of Nations<br />\nrepresented in the gathering<br />\nDr. Coale spoke decisively in<br />\nin \"lack of a definite program,\" European problems.<br />\nContinued on page 3 col. 2<br />\nThere were 24 students from mong- them Johns Hopkins whose<br />\ndiscussing the criteria by which a<br />\nand the ensuing \"serious situaBaltimore colleges and universi- delegates were \"Father Bill\"<br />\nChristian nation is to be judged. MUSICAL CLUB TO GIVE AN- tion.\"<br />\nSchmeisser, Captain Turnbull and<br />\nNUAL BELAIR CONCERT<br />\n\"A Christian nation,\" he said, \"is<br />\nWhen told of the stand taken by ties who attended.<br />\nManager Perkins. The other<br />\na nation that has the spirit of<br />\nNEXT FRIDAY<br />\nthe National Collegiate A. A. crititeams<br />\nrepresented at the conferJesus so completely in its soul that<br />\nThe Musical Club will give its cizing arrangements made for col- MEETING OF HONORARY<br />\nence<br />\nwere<br />\nHobart, Syracuse, Yale,<br />\nit has no regard for its national annual Belair concert on Friday, lege participation in Olympic tryFRATERNITY TO BE HELD<br />\nHarvard<br />\nand<br />\nCornell of the northsufTHIS MONTH<br />\nsafety when the welfare . of a<br />\nJanuary 11, 1924, at the Belair Ar- outs, officials of the American<br />\nern<br />\ndivision;<br />\nSwarthmore Unifering people is concerned. I don't mory. The Hopkins Glee Club is Athletic Union issued the followThe Johns Hopkins chapter of<br />\nversity,<br />\nLehigh,<br />\nand Stevens of<br />\ncare who knows that I believe in one of the best trained male chor- ing statement:<br />\nthe Pi Delta Epsilon Honorary<br />\nthe southern division, and Navy,<br />\na league of nations, the League of uses in the East, being trained by<br />\n-Opportunity for the college as- Journalistic Fraternity will hold a<br />\nPrinceton, Rutgers, Mt. WashNations, or anything which we Mr. Charles Bocheau, the best sociations holding membership in meeting during the early part of<br />\nington<br />\nClub, Crescent Club, and<br />\ncan join to help the world out ot known chorus leader of Baltimore. the American Olympic Associa- this month. This society, which<br />\nWilliams.<br />\nWilliams College is<br />\nits present mess.\"<br />\nThe singers are chosen by com- tion to conduct preliminary Olym- was brought to Hopkins during<br />\nstarting<br />\nlacrosse<br />\nthis year.<br />\nA Chinese student .once objected petition from the students of the pic tryouts already has been grant- the early part of'last year, was esThe University of Maryland<br />\nto our industrial system as a prod- University, and consequently are ed by the Olympic Committee. tablished for the purpose of raiswas admitted to membership in<br />\nuct of our \"Christianity.\" Stand- the pick of Hopkins vocal talent. \"At its meeting. October 25, ing the standards of college jourthe southern division of the<br />\nards are necessary here, just as<br />\nThe Glee Club at Hopkins has and upon the recommendation of nalism and to honor those men United States<br />\nIntercollegiate Lathey are necessary in home life. It been prominent since the early President William C. Prout of the who have attained distinction in<br />\ncrosse League. Maryland's entry<br />\nis with problems such as these days of the University. The Club A. A. U., plans were approved this type of work. Membership is<br />\ninto the league will greatly inthat Christianity should concern of 1886 was probably the most fa- whereby the Intercollegiate A. A., based upon merit alone and is recrease interest in the Hopkinsitself. We who call ourselves mous of all the Clubs. In that the Western Conference, the Pa- stricted to those who have served<br />\nMaryland lacrosse tilts. The<br />\nChristians must make Chirstianity year Woodrow Wilson was first cific Coast Conference, and the faithfully upon one of the college<br />\nmembership of the northern diviattractive and effective for oth‘Js. tenor in the quartet, and Newton National Collegiate A. A. itself are publications for at least two years. sion<br />\nwas augmented by Penn.<br />\n\"There must be something sacred D. Baker sang in the chorus. This to consider4their anaual track 'and<br />\nThe emblem of the society con•<br />\nState.<br />\nabout our own characters that we was the first club to sing the now'fietel meets as preliminary Olym- sists of a trapezoidal shaped gold<br />\nHopkins Graduate President<br />\nwill not compromise,\" said the famous University Ode.<br />\npic tryouts, and send the winners watch charm with the three Greek<br />\nA Johns Hopkins graduate, D.<br />\nSpeaker. We must hold high<br />\nThe Banjo Club is of more re- of each of the events to the final letters, Pi Delta Epsilon, upon it D. Lawton, was elected president<br />\nideals of sexual purity; we must cent organization, but is already Olympic tryouts, which are to be in black enamel.<br />\nof the league. C. P. Collins, of<br />\nmake a decision of the question of well known for its excellent per- conducted at the Harvard StadiFamous Men Enrolled<br />\nCornell, was chosen for vice-presidrinking; and we must adopt the formances. An outgrowth of the um, June 13 and 14.\"<br />\nThe society includes upon its dent, B. C. Barber, Harvard, was<br />\nstandard of honesty.<br />\nBanjo Club is the Black and Blue<br />\nmembership roll the names of re-elected<br />\nsecretary - treasurer;<br />\n\"We have in Jesus a faultless Jay Six, purveyors of toe tickling<br />\nJUNE WEEK DATES<br />\nsome of the country's outstanding and Albert B. Baker, Swarthluodel,\" concluded Dr. Coale. \"We dance music, who officiate after<br />\nANNOUNCED<br />\npersonages in the journalistic field. more, elected to membership of<br />\nCheck our lives by His. Let us try the formal concert has ended. The 1924 June Week will start Irving Cobb and the late Presithe Executive Board; W.H. Fries,<br />\nfor the sake of our world, develop- Some of the best jazz artists of Saturday, June 7, and will con- dent<br />\nHarding are representative Cornell, was re-appointed head<br />\ning civilization, and institutions to Baltimore compose this Hopkins tinue until Thursday, June 12.<br />\nof the type of men belonging to referee.<br />\nadopt standards in Christianity. sextet, and it is a featured part of The committee has two new the organization.<br />\nAt the meeting it was anJust as the business and intellectual all concerts of the Hopkins Mu- features planned which will not<br />\nThe Hopkins chapter was in- nounced that the medals won last<br />\nWorlds have done.\"<br />\nbe \"uncorked\" until a later date. stalled last year by a delegation year by Hopkins and Cornell<br />\nsical Clubs.<br />\nIt<br />\nis expected that these innova- from the George Washington Uni- would be awarded during the winDinners Open to All<br />\nThose who attended the contions<br />\nwill arouse great enthusi- versity. There are at the present ter. A change in rules was made<br />\ndiscussion,<br />\nit was cert last year will remember the<br />\nAfter a short<br />\nasm.<br />\ndecided that the faculty and for- act of \"Dal\" Kirwan, blackface<br />\ntime ten members of the society at allowing a penalty to be declined<br />\neign students would he invited to comedian. His successor has had<br />\ncollege. The officers of the chap- and goal counted when the penalNOTICE<br />\nfuture Fellowshop Dinners. Al- the benefit of his advice, and the<br />\nter are Fitzgerald Dunning, presi- ty occurs on the same play that<br />\nBarnstormers' Meeting at<br />\nthough foreign students have act of the new f'coon\" is one of the<br />\ndent; Joseph Leopold, vice-presi- the goal is made. The head refBeta<br />\nTheta Pi House tonight<br />\nnever been excluded, they will be outstanding points of this year's<br />\ndent; Reese Marsh, secretary; and eree was authorized to make out<br />\nat 7.30.<br />\nperformance.<br />\nEarl Donaldson, treasurer.<br />\nContinued on page 4, col. 4<br />\nContinued on Page 2, col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, JANUARY 4, 1924<br /><br />\n2<br /><br />\nBOWERY BALL TO TAKE HOPKINS CHRISTMAS VACA- is given a full month off. At Dartmouth, Penn. State, and Cornell,<br />\nTION ONE OF SHORTEST<br />\nPLACE OF JUNIOR PROM<br />\nstudents come from all over<br />\nwhose<br />\nvacation,<br />\nChristmas<br />\nHopkins'<br />\nJunior Class Plans Roughneck -Party<br />\nthe recess is three<br />\ncountry,<br />\nthe<br />\nis<br />\ndays,<br />\nAffair.<br />\nten<br />\napproximately<br />\nFormal<br />\nlasting<br />\nInstead of Usual<br />\nthus allowing stulong,<br />\nArranged<br />\nweeks<br />\nAlso<br />\nSmoker<br />\nany<br />\nto<br />\noffered<br />\nshortest<br />\nFOUNDED 1897<br />\none of the<br />\ntime to make the<br />\nsufficient<br />\ndents<br />\nroughneck<br />\nRutgers<br />\ncountry.<br />\na<br />\nin<br />\ncollege in the<br />\nA \"bowery ball\"<br />\nhome.<br />\njourney<br />\nlong<br />\ninstituother<br />\nare<br />\nand C. C. N. Y.<br />\n$2.00 dancing joint with a fake police<br />\nSubscription<br />\nhaving less than a fortnight. At most universities, fourteen<br />\ntions<br />\nevethe<br />\nraid towards the end of<br />\nIn the larger colleges where the days is the length of the vacation.<br />\nbeing planned by the<br />\nis<br />\nning<br />\nat<br />\nPostoffice<br />\nstudent body is composed mainly Columbia, Princeton, and the U.<br />\nEntered as second-class matter December 3, 1909, at the<br />\nJunior Prom Committee to replace of out of town men, who live on of P. have the two week recess.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthe usual formal prom of preced- the campus, the Christmas holi- It is pointed out by Hopkins<br />\ncon- day is a good deal longer than at authorities, however, that the<br />\nPublished semi-weekly from October to June by the students of Johns ing years. The committee,<br />\nHopkins University.<br />\nsisting of Gump, Urner, and those colleges where the majority Baltimore institution is one of the<br />\nWales, thought this innovation of men commute from home. At last to open in the fall, and among<br />\nRensellaer Polytechnic Insti- the first to complete final examiBusiness communications should be addressed to the BUSINESS MAN- would prove popular, and after re- the<br />\ncommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nceivirig a promise of hearty sup- tute, for instance, the Senior class nations.<br />\nshould be sent to the MANAGING EDITOR.<br />\nport at a recent class meeting,<br />\nhave gone ahead with their plans,<br />\nHomewood 100 which are now rapidly nearing<br />\nTelephone<br />\nnearing completion. The affair<br />\nwill be held in the Civil EngineerBusiness Manager<br />\nEditor-in-Chief<br />\ning Hall on the evening of FebruPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\nary 22. The stunts and decoraManaging Editor<br />\nAdvertising Manager<br />\ntions for this affair are promised<br />\nWILLIAM G. DEAN, JR., '24<br />\nFITZGERALD DUNNING, '24<br />\nto be the talk of the school for<br />\nAssistant Managing Editor<br />\nA TRUE friend is a staunch<br />\nsome time. •<br />\nCirculation Manager<br />\n4-2- one—always reliable. Men<br />\nf.:1' I l r'if<br />\nT. REESE MARSH, '24<br />\n01.1,11k..<br />\nJOHN C. LEWIS, JR., '24<br />\nThe date of the Junior Smoker<br />\n•<br />\nwho bought their Rubberset<br />\n0,01<br />\niftia<br />\nI:1<br />\nAssociate Editors<br />\nShaving Brushes way back in<br />\nI<br />\nhas also been announced. It will<br />\nAssistant Business Managers<br />\nigr<br />\n1888, when we first started, still<br />\nRICHARD C. TILGHMAN, '25<br />\nbe held January 12, the second<br />\nD. MILES MARRIAN,'25<br />\nr<br />\nfind them the same reliable friends<br />\nJOHN W. PARSONS, '25<br />\neach morning.<br />\nG. DONALD GIESKE,'25<br />\nBENJAMIN T. ROME-,'25<br />\nSaturday after the Christmas vaT. DIXON, '24<br />\nJOHN<br />\nHotel.<br />\nHoward<br />\nNew<br />\nthe<br />\nat<br />\nRubbersets are always ready<br />\ncation,<br />\nJunior Editors<br />\nA. J. McICAY, '26<br />\nto whip up a big, speedy lather<br />\nARTHUR L. NELSON, '26<br />\nDanny Klein, chairman of the<br />\nthat works down to the very<br />\nC. EUGENE TOVELL,'24<br />\nERNEST A. STRATHMAN, '26<br />\nprovide<br />\nto<br />\npromises<br />\nroots of the hair—holding each<br />\ncommittee,<br />\n'26<br />\nIII,<br />\nJ.<br />\nKETLER,<br />\nOTHO<br />\nALGER G. Hiss, '26<br />\nerect, easy to cut.<br />\nbeer,\"<br />\nPhiladelphia<br />\nEDWARD 0. MICHEL, '26<br />\n\"good old<br />\nJ. JACKSON KIDD, '26<br />\nCHARLES G. HUTZLER, '24<br />\nT. STRAN SUMMERS, '25<br />\nalong with a light buffet luncheon.<br />\nJAMES YOUNG, '25<br />\nGripped in rubber—<br />\n'27<br />\nJR.,<br />\nE.<br />\nBOYCE,<br />\nHEYWARD<br />\nThe entertainment for the evening<br />\nHENRY R. TURNBULL, '26<br />\nguaranteed<br />\nSTANLEY R. LEVY, '27<br />\nHAROLD S. GOODWIN, '26<br />\nNvill consist of Kelly's Orchestra,<br />\nThere is reason for Rubberset's<br />\nFargo's \"catarrh,\" and Magill's<br />\nremarkable service. Every Rubberset bristle is gripped everlasthumor. Despite the large number<br />\nMember Southern Intercollegiate Newspaper Association<br />\ningly in hard rubber—it can't<br />\nof attractive features promised for<br />\ncome out, get mixed with the<br />\nlather—hinder shaving.<br />\nthe affair, the price has been kept<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ndown to $1.25.<br />\nJust for added certainty, Rub-<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nNever flunks<br />\n—this lifetime friend<br /><br />\nNEW LACROSSE OFFICIAL<br />\n*<br />\nContinued from page 1<br /><br />\nBALTIMORE, MD., JANUARY 4, 1924<br /><br />\na list of twenty-five officials to be<br />\npublished in the Lacrosse Guide<br />\nfor the use of the colleges. The<br />\n\"-- AND A HAPPY NEW YEAR\"<br />\nmaximum pay of officials was inCompletion of the first unit of the Memorial Dormitory, the be- creased from ten to twenty-five<br />\nginning of construction upon the new Chemical Laboratory, and dollars.<br />\nmarked progress in athletic and non-athletic activities was Johns<br />\nWESTERN UNION HUMOR<br />\nHopkins University's share of the favor bestowed by our departed<br />\nIt has been reported that a cerfriend—Nineteen Hundred and Twenty-three, A. D.<br />\ntain young married man of this<br />\nPerhaps the most important event upon the 1923 calendar was<br />\nthe occupation of the Dormitories. This marked the introduction<br />\nof college life and a new brand of college spirit. Important, toc,<br />\nto the welfare of the University, already greatly overcrowded, was<br />\nthe announcement of a new Chemical Laboratory Building which<br />\nwill provide a home for wandering chemists, hitherto greatly handicapped in their work.<br /><br />\nberset Brushes are guaranteed—<br />\nunconditionally. The bristles<br />\nstay in. Each brush makes good<br />\n—or we do. Get this prime essential to a clean, cool shave ...<br />\ntoday ... at any store on the<br />\ncampus. Made by Rubberset<br />\nCompany,Newark, N.J., U. S. A.<br /><br />\nALBRIGHT<br /><br />\nuniversity burst into a telegraph office in the wildest excitement recently and wired his wife's relations<br />\nas follows: \"Twins today; more tomorrow !\"—Exchange.<br /><br />\nAthletics at Johns Hopkins during 1923 made rapid strides. The<br />\ntrack Steam, with two stars of the first magnitude, attracted national<br />\nattention and startled the country's sport fans by scoring twelve<br />\npoints, a hitherto unprecedented count for a small college, at the I. C.<br />\nA. A. A. A. meet in Philadelphia. The lacrosse team, by capturing<br />\nthe Southern Intercollegiate Lacrosse Title, brought renown to Hopkins.<br />\nThe 1923 football team, however, with no championship to its<br />\ncredit, was the pride of the University. With mediocre material,<br />\nCoach Van. Orman entered the season greatly handicapped. The<br />\nteam held Princeton 16-7 and lost to Cornell by a large score. Although all other games were w,on, the Black and Blue entered the<br />\nMaryland contest without being conceded a chance. How Maryland only succeeded in tying the score in the dying moments of the<br />\ngame is a matter of history. Suffice to say, Hopkins gained more<br />\nfriends on Thanksgiving Day, 1923, than ever before in its history.<br />\nNon-athletic activities, too, contributed to the general trend of<br />\nimprovements and progress. Noteworthy events in this line included<br />\nthe introduction of an elaborate and successful June Week, the enlargement of the activities of the Dramatic Club as \"Barnstormers\"<br />\nand marked extension in the work of the hitherto dormant Publicity<br />\nBoard.<br />\n1924 lies before us as a blank pad of pure white paper. The<br />\nprogress of 1923 was not so extensive as to prevent further advancement. More buildings, especially a gymnasium, are needed. Athletic and non-athletic activities may be brought closer to the standards in vogue at large colleges. And it is the undergraduate body<br />\nthat must guide the pen along these blank sheets.<br /><br />\nWhat a difference<br />\njust a few cents make!\"<br /><br />\nFATIMA<br /><br />\n1.<br />\n5.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY, 4 1924<br />\nEACH STUDENT COSTS YALE HOPKINS R. 0. T. C. MAY<br />\nLITERARY FRATERNITY<br />\nLOSE STAFF OFFICER<br />\nTHREE TIMES HIS FEES<br />\nJUST<br />\nHELD<br />\nMEETING<br />\nHopkins Unit of the R. 0.<br />\nThe<br />\nBEFORE HOLIDAYS •<br />\nYale University spends for each<br />\nT. C. may lose one of its best<br />\nThe Purple Gown Chapter of student an average of three times known staff officers, Captain Dathe national literary society, the his fees. According to figures vis, who is expecting to leave for<br />\nSigma Upsilon, held a meeting on based on the .University treas- Panama in the near future. CapDecember 21, the last Friday be- urer's report for the academic tain Davis arrived at Hopkins last<br />\nin<br />\nfore the Christmas holidays. Dr. year 1922-1923, the university spring and has been engaged<br />\nthe<br />\nFreshmen.<br />\nof<br />\nHall, of Ruxton, a teacher at made an average expenditure of the instruction<br />\nSmith College, was the principal $835 for the year 1922-1923, as He is probably one of the best<br />\ncompared with an average pay- known staff officers since he is not<br />\nspeaker.<br />\nwith all<br />\nThe members discussed some ment of $267 made by each stu- only in intimate contact<br />\nbeen<br />\nalso<br />\nhas<br />\nthe. Freshmen, but<br />\nof the different forms of poetry dent.<br />\nnearly<br />\nor<br />\nall<br />\nIn the university budget for the in direct command of<br />\nwhich they are attempting to<br />\nIt is<br />\nhelpful<br />\nvery<br />\nyear, only 26.6 per cent of the to- all of the drills this season.<br />\nwrite and received<br />\nDavis<br />\ncriticism from Dr. Carol Wight. tal income was derived from tui- expected that, if Captain<br />\nwill take<br />\nIt was also announced at the tion and fees for that purpose. Of leaves, Major Hoisington<br />\nFresh,<br />\nthe<br />\nof<br />\ninstruction<br />\nthe<br />\nover<br />\nInstiPeabody<br />\nthe total expenditure 39.4 per cent<br />\nmeeting that the<br />\nmen.<br />\nnumerous<br />\nover<br />\nwas made for instruction. The<br />\ntute had turned<br />\nclippings to help the society in its other expenditures were in the folCollege and Fraternity Stationery<br />\npreparation of the biographies of lowing proportions:<br />\nBanquet and Dance Cards, Invitations<br />\nFor property, 19.6; annuities<br />\nMaryland literary men.<br />\nJAS. H. DOWNS<br />\nNo new members were elected and adjustments, 10.8; administo the society at the last meeting. tration, 7.8; laboratories, 7.2; im- ENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nThe emblem of -the society con- provements, 4.4; scholarships, 4.4;<br />\ngreen<br />\nlibraries, 3.9; and printing, 2.5.<br />\nsists of a gold pin, bearing a<br />\nTHE DINING ROOM OF<br />\nscarab encircled by the two words, The University income was derived from the several sources,<br />\nTHE HOPKINS<br />\nPurple Gown.<br />\nat 31st. and St. Paul Streets<br />\nThe officers of -the- society .are 52.5 being from investments; 26.6,<br />\nRandolph ---N-or wood,- - president; tuition and fees; 7.3, dormitory<br />\nServes Regular—<br />\n7.30 to 10 A. M<br />\n$ .75<br />\nMilton McDaniels, vice-president; rent; 7.2, alumni fund; 3.9, gifts, Breakfast,<br />\n.65<br />\n12 to 2 P. M<br />\nLunch,<br />\nWillis Russell, secretary; Ben and 2.5, miscellaneous.<br />\nDinner, 6 to 7.30 P. M...$1.00 &amp; 1.25<br />\nThe expenditures and the payThomas, treasurer, -and Reese<br />\nOR A LA CARTE<br />\nper student in the freshman<br />\nments<br />\n'curator.<br />\nMeal Hours Sunday and Holidays<br />\nMarsh,<br />\n12 to 2 P. M.<br />\nM.<br />\nyear were more closely related 8 to 10.30 A.<br />\n6 to 7.30 P. M.<br />\nBRASS BUTTONS APPEAR ON than .in any other section of the<br />\nLuncheon and Dinner Parties at<br />\nuniversity. Yale College (the acaARMY UNIFORM<br />\nReasonable Rates<br />\nThe appearance of uniforms has demic department), whose stu<br />\nbeen increased a hundred per cent dents paid about half the amount<br />\nby the brilliant buttons of gleam- expended for them, was second to<br />\ning brass such as those which have the freshman year in the relation<br />\nbeen worn for many years by Brit- of its expenditures and payments<br />\nish army men, officers of the Hop- per student, the expenditure being<br />\nkins military believe. The old dull less than $835 per student, but<br />\nbuttons were replaced recently on greater than that of the freshman<br />\nthe coats of enlisted men and offi- year.—Exchange.<br />\ncers with shiny buttons. Orders<br />\nfoLtheshange.eame from the miliDARTMOUTH STUDENT<br />\ntary department at Washington,<br />\nCOUNCIL FROWNS ON<br />\nand now every soldier in the counINTOXICANTS<br />\ntry is wearing the newly preThe 1924 Palaeopitus, Dartscribed brass fasteners and collar mouth's senior student governand cap ornaments. This change ing council, has gone on record as<br />\nwill not affect the R. 0. T. C. men being opposed to the drinking of<br />\nwho drill on the quadrangle.<br />\nintoxicating liquors by underFurther, the order specifies that graduates, and suggests that the<br />\nthe Corps of Engineers shall wear administration reconsider its decitheir insignia on areir buttons in sion to abolish the Junior Prom,<br />\nbas-relief instead of the custom- offering to accept responsibilty of<br />\nary eagle. After high army offi- seeing that house parties are propcers had noticed the neat appear- erly conducted.<br />\nance of those in the British army, In a declaration of policy the<br />\ndecision was made to discard the Palaeopitus stated: \"Since it is<br />\ndrab buttons.<br />\napparent that the drinking of inThis order, given out October toxicating liquors cannot but sul16, was carried out in the Third ly the good name of the college,<br />\nCorps Area, which includes the Palaeopitus sets itself down as<br />\nJohns Hopkins military instructors vigorously opposed to such drinkand the change has been noticeable. ing in Hanover and wherever the<br />\nname of Dartmouth is concerned.<br />\nPRESIDENT GOODNOW PRE- \"This does not mean that PaSENTS GOLD FOOTBALLS<br />\nlaeopitus shall constitute itself a<br />\nTO ALL-MARYLAND MEN<br />\npolice force to parade Hanover<br />\nthe<br />\nbefore<br />\nassembly<br />\nstreets in search of violators. It<br />\nAt the last<br />\nGoodPresident<br />\ndoes mean, however, that any perrecess,<br />\nChristmas<br />\nto<br />\nfootballs<br />\ngold<br />\nnow presented<br />\nsistent violation on the part of any<br />\nwon<br />\nwho<br />\nplayers<br />\nindividual or fraternity will bring<br />\nthose Hopkins<br />\nTeam<br />\n-Maryland<br />\nimmediate measures to protect<br />\nplaces on the All<br />\nthe reputation of the college.\"—<br />\npicked .by the \"Sun\".<br />\nBefore the presentation, Dr. Exchange.<br />\nGoodnow said a few words in<br />\nPublished in<br />\nTUDOR-STUART<br />\nthe interest ofElecPraise of the whole team, whose<br />\nContinued from page 1<br />\ntrical Development by<br />\nsuccess he attributed to highly deHall,<br />\nGilman<br />\non<br />\nof<br />\nthe<br />\nfloor<br />\nthird<br />\nan<br />\nprofessed<br />\nInstitution that will<br />\nHe<br />\nteamwork.<br />\nveloped<br />\nexthe<br />\nhas<br />\nwith<br />\nbe<br />\nbeen<br />\nhelped by whatcompleted<br />\nathletHopkins<br />\nin<br />\ninterest<br />\ngreat<br />\never helps the<br />\nics, and declared himself especial- ception of the furniture, it having<br />\nIndustry.<br />\nly well pleased that the Universi- been impossible thus far to obty had been represented by such a tain any which was entirely suitable. Upon completion of the<br />\ncapable football team.<br />\nroom the club's collection will be<br />\nand<br />\nRich,<br />\nTurnbull, Magill,<br />\nWolbert, were awarded gold foot- moved into the bookcases which<br />\nballs, but Magill and Rich were line the oak-paneled walls.<br />\nabsent at the presentation.<br />\nHe—\"Aw, come out for a ride<br />\nMike—\"Have they taken your tonight, I'm harmless.\"<br />\nPerfect Lady—\"Say, who wants<br />\ntemperature yet?\"<br />\nPat—\"No, Oi haven't missed any- to go out for a ride with a guy that<br />\nthing but me watch.\"—Exchange. is harmless ?\"—Exchange.<br /><br />\nOUR MEN'S SHOP<br />\nSpecializes in<br /><br />\nDistinctive Furnishings<br />\n—the kind that is being sought<br />\nby the exacting college man.<br /><br />\nHUTZLER NOTHEIZ<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD.KOHN $cCo.<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\n25reornerayeile and glutaw<br /><br />\nSts.<br /><br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\n.7(<br /><br />\n1.4<br /><br />\n—are you sure<br />\nyou deserve .<br />\n•<br /><br />\n\"Give me a log with Mark Hopkins at one end<br />\nof it and' myself at the other,\" said, in effect,<br />\nPresident Garfield, \"and I would not want a<br />\nbetter college.\"<br />\nBut if Mark Hopkins was an inspired teacher,it<br />\nisjust as true thatJames A.Garfield was an inspiring student.<br />\nSometimes Garfield's praise of his professor is<br />\nquoted in disparagement of present day faculties<br />\n—the assumption being that we as listeners are<br />\nsympathetic, all that we ought to be—and that<br />\nit is the teacher who has lost his vision.<br />\nIs this often the case?<br />\nIt is the recollection of one graduate at least<br />\nthat he did not give his professors a chance. Cold to<br />\ntheir enthusiasms, he was prone to regard those<br />\nmen more in the light of animated text-books<br />\nthan as human beings able and eager to expound<br />\ntheir art or to go beyond it into the realm of his<br />\nown personal problems.<br />\nThis is a man to man proposition. Each has to go<br />\nhalfway. Remember,there are two endsto thelog.<br /><br />\ntern Electric Co<br /><br />\nan<br /><br />\nWherever people look to electricity for the<br />\ncomforts and conveniences oflife today, the<br />\nWestern Electric Company offers a service as<br />\nbroad as the functions of electricity itself.<br />\nNumber 33 of a series<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 4, 1924<br /><br />\n4<br /><br />\nmedal was presented to Douglas<br />\nSHIRT MAKER<br />\nTurnbull, Jr., for all-around foot226 N. Liberty St.<br />\nball ability. It was announced<br />\n$3.00, $3.50 and $4.00<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\nHopkins blankets would be<br />\nthat<br />\n$5.25 and $6.25<br />\nImported Madras<br />\nFifteen Letters Awarded at Annual Banquet. Turnbull Given awarded to the H men as a reward<br />\nTerms.Cash, Less 10% 30 Days on Shirts<br />\nfor' their successes.<br />\nEvening Sun Medal<br />\nAlso a Full Line of Men's<br />\nFurnishings.<br /><br />\nThomas P. Magill Chosen to<br />\nLead 1924 Football Team<br /><br />\nSTRATTON<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nmore likely to be present if they<br />\nOWNERS<br />\nare especially asked to come.<br />\nVtIC<br />\n'<br />\negilt r4P<br />\n?•1?d11)E* •<br />\n29 E. BALTIMORE ST.<br />\nThe next Fellowship Dinner<br />\nwill be held at the Friends Meet- Agents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\ning-House on Tuesday, January<br />\n15, at 6 P. M. Ex-Governor Cornwell, of West Virginia, now head<br />\nof the legal department of the 3. \"Baltimore's Most Complete Sport<br />\nStore\"<br />\n&amp; 0. Railroad, will speak.<br />\nThe meeting ended with the<br />\nsinging of \"Blest Be the Tie That<br />\nQuality<br />\nBinds.\"<br />\nATHLETIC &amp; SPORTING<br />\nEQUIPMENT<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nHOSIERY<br /><br />\nXatterie)<br />\nCelbe<br />\n'Am ES H.&amp; OSCAR G•10111f<br /><br />\nDR. COALE SPEAKS<br />\nContinued from page 1<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nBachrach Rasin Co.<br /><br />\nLimited<br /><br />\nEllGRAVERS<br /><br />\nPRMTERS<br /><br />\nBMDERS<br /><br />\nMaryland Agents for<br />\nWright &amp; Ditson Victor Co.<br />\nCampus Agent, \"BUCK\" BONNER<br /><br />\nBARN CAFETERIA<br />\nCollele<br /><br />\nLiterature<br /><br />\n14 N. HOWARD ST.<br /><br />\nBALTIMORE<br /><br />\n\"exftezte'ezede\"<br /><br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nif<br /><br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nURNER'S<br /><br />\n— Printers of —<br /><br />\nSOPHISTICATED<br /><br />\n(The Johns Hopkins<br />\nNEWS-LETTER<br /><br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br /><br />\nLOM13ARD and SOUTH STREETS<br /><br />\nMEN'S SHOES<br />\n...J.A.,00\"SRRI,<br />\n•<br />\nA<br /><br />\nOf the Better Class<br /><br />\n—Courtesy Baltimore American.<br /><br />\nLIBERTY ST.<br /><br />\nURNER BROTHERS<br /><br />\nAT SARATOGA<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br /><br />\nThomas P. Magill, '25, was Schacht, Taylor, Maxwell and<br />\nLUNCHEON<br />\nelected captain of the 1924 foot- Cook. The aHa was awarded to<br />\nTEA<br />\nball team at the annual football Gilliece Levy. S. Carr, Milanouand<br />\nG.<br />\nM.<br />\nShriven<br />\nsky,<br />\nYoung<br />\nEstablished 1873<br />\nDINNER<br />\nbanquet held Thursday, December<br />\nBonner, as captain of the 1923<br />\nA. H. FE-I-TING MAN'FG<br />\n20, at the Alumni Memorial Dor- eleven, thanked the alumni and the<br />\nJEWELRY CO.<br />\nSPECIAL PARTIES<br />\nmitory. The guests included the student body for the whole-heart- 11.30 A. M.<br />\nChesebrough Mfg.Co.<br />\nManufacturers<br />\nuntil<br />\n(consolidated)<br />\nJewelry<br />\nFraternity<br />\nLetter<br />\nGreek<br />\nfootball squad, alumni interested ed spirit with which they support7.30 P. M<br />\nPLAZA 6987<br />\n213 N. LIBERTY ST., Baltimore, Md. in football, prep school seniors and ed the team.<br />\ncoaches, and newspaper represen- Dr. Eveleth Bridgman gave an<br />\negggigf,r1-E-Q-15tiggr„,_..7ggimagr-r-ifu-a-470<br />\ntatives. Sixty men attended.<br />\ninteresting talk during which he<br />\nThe election of Magill to the<br />\nemphasized the need for co-operacaptaincy was no surprise. The<br />\nstar left tackle of three seasons tion between the Baltimore newsand individuality is offered here at prices that are not<br />\nwas chosen unanimously by his papers and the Hopkins Atheltic<br />\nand cannot be underquoted by any house at any time.<br />\nmates. Magill has brought honors Association. He showed how the<br />\n(I, Besides the reputation of an old-established firm<br />\nto the team and credit to the uni- backing of the newspapers was reis back of each sale with a guarantee.<br />\n\"The King of Lubricants\" versity during his football career sponsible for the large attendance<br />\nat Johns Hopkins.. Magill's unanat the Princeton-Navy fiasco and<br />\nSHERWOOD BROTHERS, INC.<br />\nimous .election is a deserving tribthe Army-Fleet farce. Fred Tur- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nIgNENgEOMERNILIt'AEENNEENECDITANEI ute to the esteem in which his<br />\n343 NORTH CHARLES STREET<br />\nteammates and the whole under- byville, sports editor of The Evening Sun, replied to Dr. Bridgman<br />\ngraduate body hold him.<br />\nBoys, the place to get your<br />\nthat after the Thanksgiving Day<br />\nDr. Brown Speaks<br />\nmeals—and they are honAfter the meal, Dr. Thomas game, the newspaper were conest-to-goodness meals, well<br />\nBrown, toastmaster, began the vinced that Hopkins was worthy<br />\nspeech-making by thanking the of support and that Hopkins could<br />\ns erve d, and reasonably<br />\nteam and the coaches on behalf of expect it in the future. Mr. Turbypriced—is at<br />\nthe Varsity Club and the alumni ville expressed his personal views<br />\nAt the Washington Monument<br />\nfor their excellent record during when he declared Hopkins had the<br />\nthe past season. He then called best football team in the state ot<br />\nOscar Thomas Olson, D.D.<br />\non Buck Bonner as president of Maryland during 1923.<br />\nMinister<br />\nthe A. A. Board to present the 14<br />\nOthers speakers included Dr.<br />\nto the members of the team. The Van Orman, Colonel Hinckley,<br />\nHopkins Students Are Invited to<br />\n1817 N. Charles St.<br />\nfollowing men received their H: Horace Burroughs, Dr. Harvey<br />\nMake This Their Church Home<br />\nCaptain Bonner, Manager Leo- Stone, Bill Schmeisser, Pop God(Half Block below North Ave.)<br />\npold, Rich, Wolbert, Carter, Slo- dard, Douglas Turnbull, Sr., and<br />\nThe purpose and program of th's<br />\nIvik,<br />\nDay,<br />\nMagill,<br />\nEvening<br />\nSun<br />\nBarton,<br />\nTom<br />\nMagill.<br />\nThe<br />\nBerndt,<br />\nChurch will appeal to you. Look in<br />\nNicholas Brown, Mgr.<br /><br />\nVaseline<br /><br />\nHAIR TONIC<br /><br />\nFURNITURE OF QUALITY<br /><br />\nif4-icoTron 311<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nMount Vernon Place ethodist<br />\nEpiscopal Church<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nSunday morning worship at 11 o'clock.<br /><br />\nTailors<br /><br />\nSunday evening service at 8 o'clock.<br /><br />\nUniforms and Liveries<br />\n128 W. Fayette St., Near Liberty St.<br />\nBaltimore, Md.<br /><br />\nMusic by vested chorus—choir of soloists,.<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />"}], "field_media_file": [{"target_id": 37811, "display": null, "description": null, "target_type": "file", "target_uuid": "c56cbb6c-aa10-4736-9488-8da7ce95f1af", "url": "http://digital.library.jhu.edu/system/files/2022-03/13096-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13096, "target_type": "node", "target_uuid": "be88ec3d-ed14-42f5-853f-5eb3568a2c25", "url": "/node/13096"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "90a61a43-9b6f-4f2b-a133-5026fc8303d1"}]}