{"mid": [{"value": 37505}], "uuid": [{"value": "bfe0257d-709a-400e-be64-e1c4e8f13b90"}], "vid": [{"value": 37505}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:33:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13365-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:33:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:33:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "'STORMER PLAY IS<br />\nTERMED SUCCESS<br />\n<br />\nPrice 5 Cents<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 19, 1929<br />\n<br />\nVol. XXXIII, No. 39<br />\n<br />\nJ.H.U. WOMANS CLUB<br />\nTO GIVE CARD PARTY<br />\nThe J. H. U. Woman's Club<br />\nwill give its first card party at<br />\nthe I,ord Baltimore Hotel on<br />\nthis Friday, 1C1arch 22nd, at<br />\n8:30 o'clock. Prizes and refreshments will be given and,<br />\nthe cost of admission will be<br />\n75 cents.<br />\nThis party is the- first attempt by the Woman's Club to<br />\nsponsor any such event and it<br />\nis being held for the purpose<br />\nof acquainting the members of<br />\nthe facultfras -well as for the<br />\nsocial intercourse between the<br />\nstudents'and members of the<br />\nfaculty. Tickets may be ob- tained by dropping a note in ,<br />\nP. 0. Box 741, or from any<br />\nmember of the Woman's Club.<br />\n<br />\nGHOST OF FORMER EDITOR ROAMS<br />\nEARTH IN CURRENT \"Y\" NE<br />\n<br />\nPIPP-<br />\n<br />\nELIVERED PHOTOS<br />\nARE TO BE SOLD<br />\nUnless all Hullabaloo group<br />\npictures that have been ordered<br />\nare obtained from S. Carson<br />\nWasson before the end of this<br />\nweek, they will be-offered for<br />\npublic sale.<br />\nEveryone who has ordered<br />\nthese pictures is requested to<br />\nmake definite arrangements<br />\nabout them through Wasson,<br />\nP. 0. Box 1045.<br />\n<br />\nMUSICAL CLUB GIVES<br />\nCOMBINED CONCERT<br />\n<br />\n'cal value<br />\nMake way! The \"Khaki Men- value and of little<br />\nght.\" Be that as<br />\nace\" is slowly but surely overshad- even in a<br />\nGeorge Washington U. Girls' Glee<br />\nwas it not Milton that said<br />\nowing the fair greens of our niEach Member of Cast Interprets<br />\nClub Sings With Jays<br />\nPart Well<br />\na fair education was one that fitted<br />\nversity's calnpus, and for that<br />\n•<br />\nter campuses of other universities, a man to do justly all the duties of<br />\nCONCERT WELL RECEIVED<br />\nDEETS AND HORN GOOD<br />\nschools, colleges, or *hat not—so office, in peace or 'war? And our<br />\nstates an editorial in the Hopkins R. 0. T. C. unit is supposed to take<br />\nDual Plan of Concerts Termed<br />\nLatter Particularly Draws<br />\ncare of the \"war side of life.\" Also,<br />\nComplete Success<br />\n\"Y News.\"<br />\nApplause<br />\nQuoting from the \"Y News,\" the R. 0. T. C. Manual states that<br />\nIn conjunction with the George<br />\nwhich in turn has obtained the fol- \"The methods employed are deAlthough the curtain in the last<br />\nWashington Girls' Glee Club the<br />\nlowing data from pamphlets of the signed to fit them physically, mentalact dropped on the table and the<br />\nJohns Hopkins Musical Club renCommittee on Militarism in Edit- ly and modally, for purposes of<br />\nRoyal Guard did not fall as gracedered a very delightful and successpeace as well as war.\" And+,<br />\n86<br />\nin<br />\nthat<br />\nshow<br />\n\"Statistics<br />\ncation:<br />\nthey<br />\nl<br />\nmight<br />\nhave,<br />\nas<br />\nanthe<br />\nfully<br />\nnior Banquet to<br />\nful concert at the Raleigh Hotel in<br />\nthat the R.<br />\ndeny<br />\ncan<br />\nuniand<br />\nschools,<br />\ntechnical<br />\ncolleges,<br />\nnual production of the Barnstorm11<br />\nWashington last Saturday night.<br />\nApril'<br />\ntilicr' Students—<br />\nHeld<br />\naccomplishing<br />\nMilStates,<br />\nBe<br />\nin<br />\nUnited<br />\nversities<br />\nthe<br />\ners was a big success. Dwight Horn<br />\nitary Training is compulsory for at knock-kneedy/gUnIcen chests, flatt a meeting held last Friday of This marks the second attempt at<br />\nand Jack Deets both scored well in<br />\nleast two years. In 44, it is elective. footed (s1te files are reference), the Junior Banquet Committee, anything of the kind this year, the<br />\nthe leading roles. Horn as the PrinHigh schools in 53 cities, 7 junior sign their names to the R. 0. T. C. Au il eleventh was set as the best first having been with Haverford<br />\ncess Irma of Borrovina, was parcolleges, -and 38 military . schools unit—and:behold, they graduate as d e for the affair. Due to the last week. The experiments have<br />\nticularly well receivedifthis excellent<br />\nhave junior R. 0. T. q. units. Par- fine young reserve army officers!<br />\nrly Easier vacation, the banquet been so successful that, withOut<br />\ngestures and graceful motions<br />\ntial government subsidization is The \"-Y News\" states that \"If th could not be held before the spring doubt, the duet plan will in the fubringing frequent bursts of applause<br />\nfound in SO institutions, including R. 0. T. C. were of value, the T<br />\nrecess and still leave the necessary ture form a large part of the club's<br />\nfrom the audiences. However, it<br />\nrad- week for the freshman and sopho- engagements.<br />\nthe high schools of 15 cities. That versity'would not fail to off<br />\nwould be difficult to pick any indiPlaying before a rather large and<br />\nBut, of more banquets.<br />\nmeans a total Of 278 American An- nate courses in the fie<br />\ns,viduaI .star as the entire cast pera<br />\nappreciative audience, the combined<br />\nof West Point 'what 'benefit • w. a a graduate<br />\nstitutions—exclusive<br />\nhel<br />\nsophomores<br />\nthe<br />\nyear<br />\nLast<br />\nformed admirably.<br />\nand the Naval Academy and schools 'course be? . est Point takes care their Banquet at the Southern schools presented a chain of attracSpectators Attracted to See<br />\nThursday night the curtain rose<br />\ntions no single links of which weakDaily Workouts<br />\nwhere training is given indepen it- of<br />\nHotel, and each member , was<br />\nat 8.45 with Hawthorne on the stage<br />\nened the Whole. The Hopkins Mu\"innocent<br />\nthat<br />\nseems<br />\nit<br />\nBut<br />\nof<br />\nly<br />\nWar<br />\nthe<br />\nDepartment.\"<br />\nfor<br />\nCoach<br />\nhalf<br />\nwind<br />\na<br />\nand<br />\nand<br />\nmud<br />\nrain,<br />\nAmid<br />\ncharged two dollars<br />\nand Rodney Blake, played by Bill<br />\nWhich all means, that if one takes youths\" (pertaining to Johns Hop-this meal alone. All additional ex- sical Club as the guest of the George<br />\nBanks, president of the club, emerg- Van Orman and \"Father<br />\nWashington University, was the<br />\nare<br />\nparents<br />\ntheir<br />\nand<br />\nstudents)<br />\nkins<br />\nto<br />\ntime<br />\ntrouble<br />\nthrough<br />\ngo<br />\nthe<br />\nand<br />\namples of,music, entertainment and<br />\ning over the wall of the garden eat- Schmeisser have been whipping<br />\nthe catalogue of the College of Arts told of its value in physical and dis- decoratibtis were paid for by the featured part of the program and,<br />\ning an apple. After a short dia- their material imo shape.<br />\nand Sciences of the Johns Hopkins ciplinary purposes—and that the<br />\nas the at- as such, presented the major porlogue telling how Hawthorne broke<br />\nBad weather has not daunted the University, one would see how the training is not to make soldiers. Um class treasury. However,<br />\ntion of the evening's entertainment.<br />\ntendance was small, it was thought_<br />\nthe Bank at Monte Carlo, it is spirit of the lacrosse candidates alR. 0. T. C. has gained sway in the who is theione that can view'the advisable to lower the price per per- However, although making only two<br />\nthat<br />\nhero<br />\nout<br />\nour<br />\nis kept in though it has hindered the perfectbrought<br />\nprecincts of the departments of R. O. T. C. companies' machinery son, by having the banquet at a appearances, the Girls' Glee Club<br />\nBorrovina because of a certain un- ing of the field play of the team.<br />\nstudy. Five pages in this catalogue dignifiedly all over the Hopkins smaller hotel, and a less elaborate formed one of the high lights of the<br />\nknown lady. Hawthorne finally Every afternoon, either amid the<br />\nare devoted to the \"bfillyhoo\" of the Quadrangle and say to himself, dinner. Tentatively, the banquet evening. They were very well<br />\nmanages to get rid of Blake by con- cold rain or in the sticky mud, the<br />\ntrained and the sweet and pure<br />\n,<br />\nR. 0. T. C. Militarir Training of- \"These are not soldiers!\"<br />\nwill be held at the New Howard<br />\nvincing him he should send a tele- men have been playing on the lower<br />\nAfter all, \"force is the- ultimate Hotel, and each member of the quality of their combined voices<br />\nfers 17 e it points, a<br />\nthe \"Y<br />\ngram to Senator Ballard and his field getting the team work which<br />\nNew makes so bold, the state'<br />\nwer,\" And did,there not once live class will be charged two dollars. produced such a beautiful effect, in,daughter telling them to come to is so essential to the smooth worktensified by the contrast with our<br />\ntha the training \"is of no cultural a Ilenry Turnbull?<br />\n*<br />\nThe committee , is' planning to own manly voites, that it drew<br />\nthis little kingdom, as the excellent ing of a championship team.<br />\ngood ,orchestra - and elab- even the plaudits of the Hopkins<br />\na<br />\nhave<br />\n(?) springs will surely cure the<br />\n. The first string .attack have been<br />\nising Matedal<br />\nHomewood Playshop<br />\norate acts of entertainment, and to Glee Club. Miss Harriet Nash, also<br />\nSenator's rheumatism.<br />\nPlaying against the first string deFou<br />\nt Practice<br />\nRenews Activities overcome the comparative shadow of G. W. U., performed excellently<br />\nHeroine Arrives<br />\nfense, or the tentative first string<br />\nThe Homewood Playshop an- cast over the Junior banquet by the at the piano and fully deserved the<br />\nThirty-five candida<br />\nare tryin<br />\nThe heroine then arrives and a men. On the first string attack<br />\nvery amusing scene takes place have been playing: Love, at in out for places on this year's track nounces the presentation of a re- excitement of those of the two pre- thunderous applause which she was<br />\nwhen King Augustus III, better home; Lyons, out home; Eagan, team. After two weeks of practice vival of the first American comedy, vious years. Tickets will be placed accorded.<br />\nknown as Howard Caplan, arrives first attack Sauerwein, second at- Coach Hambleton can now. realize \"The Contiact,\" by Royal Tyler. on \"sale for members of the Junior The Hopkins Musical Club supunder an excellent diskuise consik- tack; Hersperger, third attack; what material he has with which to This play vks Written in 1787, and class the day school reopens after plied. its usual splendid program. A<br />\nmarked the first appearance of the the holiday.<br />\nfew of the numbers which were preing of whiskers, many brass but- Campbell, center. On the first dework.<br />\nstage Yankee in .the character of<br />\ntons, and sword almost dragging fense hae been: Hall, at point;<br />\nThe banquet will begin at seven sented at the home concert were<br />\nhim to the floor. With Hawthorne Keating, at cover point ; Kegan, The sprints •have drawn many Jonathan. \"The Contrast\" is a com- o'clock on the date named above. omitted because of lack of time. The<br />\nlistening in, the fact that the finan- first defense; Nickels, second de- candidates as usual. Lockard is the edy of social manners interlarding Thursday has been thought the ideal selections by the quartet composed<br />\nces of the kingdom are in .a disas- fense; Houston, third defense; only H man in 'these events who a complicated plot, humorous char- day, as it allows the committee four of: Sharetts, first tenor; Besore<br />\ntrous state is brought to the fore, Browntey, goal. Alternating for ran last year, and Ness the only acterization, and dialogue typical of school days to sell tickets, and does second tenor; McDorman, first<br />\nand as a consequence the Princess these men have been: Tobin and aHa holder. Among the newcomers the time in which it was written. not interfere with week-end activ- bass; and Gordon, second bass, were<br />\nvery well received by the audience,<br />\nmust Marry. Prince Vladimir Hal- Keyes, in defense, and Knell) and<br />\nities.<br />\nMorrison of -Forest Park looks The play is being given on the<br />\nas was the Banjo Club, who howberstadt. The Prince (Milton Rob- John Lyons, in attack.<br />\nto<br />\ntrying<br />\n12,<br />\nApril<br />\n11,<br />\nof<br />\n15.<br />\n10,<br />\nand<br />\nevenings<br />\nnot<br />\nis<br />\ncommittee<br />\nThe<br />\n,howing<br />\npromising. A creditable<br />\never, have come to take such things<br />\ninson, 6 ft. 3) and the equerry to<br />\nSpectators Come<br />\nThe Playshop has been very fortu- make money, or even break even on as a matter of course. The Glee<br />\nshould be made by this group.<br />\nPrince (Roswell Jones, 5 ft. flat),<br />\nthat<br />\nthought<br />\nwas<br />\nIt<br />\nbanquet.<br />\nthe<br />\ndefense<br />\nstring<br />\nsecond<br />\nthe services of N.<br />\nClub Hawaiian Troupe, and Barienter with much gusto. The act On the<br />\nKelly, and many nate in securing<br />\nthe class treasury should bear a<br />\nbeen showing Captain Schiebel,<br />\nBryllion Fagin, who is coaching the<br />\ntone Solo all came in for their<br />\ncloses as Hawthorne is brought to Ness and Cone have<br />\nwill<br />\nmen<br />\ndistance<br />\nexperienced<br />\nother<br />\nthat<br />\nso<br />\nexpense,<br />\nthe<br />\nof<br />\npart<br />\ngood<br />\nthe attack •.Dukehart<br />\nrealize that the Princess must do up well. Oil<br />\nMr. Fagin is very well known the members of the class could get share of the applause.<br />\nplay.<br />\nmile.<br />\ntwo<br />\nand<br />\nmile<br />\nand the two Sharretts have been take care of the<br />\nher duty to her country.<br />\nin literary circles as a playwright, some direct return on their dues. Immediately following the condoing well. Frisch has been play- In the high ijump there is Caldwell<br />\ncert a dance was held in the main<br />\nFree-for-All<br />\ning a nice game. Ferrarini has been who was high school champion of critic, poet, author, and lecturer. He A large turnout is desired for, it is ballroom. The sixty-odd girls in<br />\nThe second act opens with a rehoped, the best Junior banquet in<br />\nJohns<br />\nthe<br />\nat<br />\nEnglish<br />\nof<br />\ninstructor<br />\nis<br />\nlooking very good at goal.<br />\nthe Glee Club again came in de\\Vest Virginia. In the pole vault<br />\nporter from the Borrovinian ScimiHopkins University and head of the recent years.<br />\nmand when tbg_ban of conventional<br />\ntar. playeatrby William McDcpelt, Cokch,Van Orman's plan of play- there is Quirk who has been with<br />\npromcertain<br />\ncustom,<br />\nAs is the<br />\ncutting in was lifted.<br />\nand the proprietOr of the Casino, ing the first string attack against the team several years. Neu, an- English Department at the UniverEditor<br />\ninent seniors, namely: The<br />\nthe<br />\nThe program of the concert, was<br />\nportrayed by Herring, in the midst the first string .defense has had<br />\nother veteran, will be in the broad sity of Baltimore.<br />\nManager of the Hul- as follows:<br />\nof a discussion in Which the former effect of attracting many spectators jump. In the discus and shot put, The retention of Mr. Fagin's ser- and Business<br />\nlabaloo, and others, will be invited J. H. U. GLEE CLUB<br />\non Unidiscloses to the latter the identity of who daily park their cars<br />\nplay Dorman, a freshman from Friends, vices is very timely, since the Play- to speak. As yet a toastmaster has University Ode ,<br />\nHawthorne. The proprietor imme- versity Parkway to watch the<br />\nshop group has suffered a suspen- not been chosen.<br />\nDeep,River ....Old Negro Melody<br />\ndiately proceeds to make out a new and see what sort of team is in pros- has shown much promise. On the<br />\nbill for the hero, as the latter comes pect at the traditional home of la- whole the events mentioned above sion of activities during the year The committee in charge consists Old Man Noah ''Bartholomew<br />\non the scene, prepared to leave. crosse. They seem to be repaid. should provide the coaching staff following Dr. Uhler's departure of Bob McAll, chairman; Cordish, BANJO CLUB<br />\nWashington Post Mardi....Sousa<br />\nfrom the University. The players Nickel, F,heidt, and Follmer.<br />\nHowever he learns of the revolution<br />\nThe freshman team, which is be- with but little worry.<br />\nG. W. U. GLEE CLUB<br />\nand decides to stay. Upon being ing organized has some right good<br />\nin<br />\nactive<br />\nvery<br />\nbeen<br />\nThe weak spots of the team are in have formerly<br />\nGodttrd<br />\nLullaby from Jocelyn<br />\ncaught spying On Prince Vladimir players who are too light and inex\"and the javelin the production of meritorious dra- A. 7'. and 'T. Interviews<br />\nGrieg<br />\nElfin Dance<br />\nand the other conspirators, he is perienced to work out with the reg- the middle distances<br />\nimporan<br />\nfilled<br />\nand<br />\nofferings,<br />\nmatic<br />\nMassenet<br />\nElegy<br />\nbrought before that gentleman. A ulars. Eagan, of City College; throw. Here the lack of experienced<br />\nPositions<br />\nfor<br />\nSeniors<br />\nStrickland<br />\nMah Lindy Lou<br />\ntant place in the participant's culfree-for-all fight results and the act Sykes, of Forest Park High; Levy, material is apparent..<br />\nRepresentatives of the American<br />\nBARITONE SOLO<br />\nends with thg Royal Guard chasing of Friends; Tippett, of Marstons, Yellot, who with Wheeler, rep- tural development.<br />\nTelephone and Telegraph Company<br />\nMR. LOUIS LLEWELYN<br />\nHawthorne and Blake out the win- and one or two others look good resented the half-mile run last year, The cast consists of Roberta Mal- have just finished a session lasting<br />\nHuhn<br />\nInvictus<br />\ndow.<br />\ninterweek,<br />\nlast<br />\nof<br />\npart<br />\nbetter<br />\nthe<br />\nfor next year's team.<br />\nVannott<br />\nS.<br />\nSnyder,<br />\nHoward<br />\nis the only veteran back for this de- timbre,<br />\nAccompanist<br />\nKingdom Saved<br />\nUniversity<br />\nthe<br />\nof<br />\nseniors<br />\nviewing<br />\nweather<br />\nbad<br />\nworkouts in the<br />\nM. SAMUEL SNYDER<br />\npartment this year. The hurdles Chapman, Robert Warfield,'Harry<br />\nHawthorne proceeds to save the The<br />\nin regard to positions upon their<br />\nby the fact that on April<br />\nPE<br />\nare to be well taken care Bilcovitch, Alton R. Hodgkins, and graduation. After a careful sifting HAWAIIAN<br />\nyear<br />\nkingdom in the third act when he are caused<br />\nthis<br />\ngape.<br />\nplay their first<br />\nHerbert<br />\nGypsy Love Song<br />\npays off the army and convinces the 6, the Jays<br />\nof, Hershey and Scheidt, who ran Richard C. Breed. William Banks process certain men were extended<br />\nKohola March<br />\ntakcitizens they should start business The complete schedule is:<br />\nare<br />\nChapman<br />\nVannort<br />\nS.<br />\nand<br />\nfor<br />\nreporting<br />\noffers.<br />\nthe hurdles last year,<br />\narranged by C. Gebelein<br />\nexpansion by utilizing the great Olympic A. C. at home, April 6.<br />\ning care of the scenery for the play, One thing of particiPar interest<br />\nthis season.<br />\nPIANO SOLO MISS HARRIET NASH<br />\nsprings and making a health resort U. of Pennsylvania at home.<br />\nis handh g the to Hopkins men was the fact that<br />\nScott<br />\nDance Legre<br />\nDue to the rainy weather practice while Miss Legum<br />\n.<br />\nof' the kingdom. The fourth act April 13.<br />\nproperties.<br />\nthe representatives, impressed by, Dance Rituelle de Feu<br />\n'Cyril<br />\n20.<br />\nthe<br />\ninfield,<br />\nApril<br />\nthe<br />\nto<br />\nconfined<br />\nPoint,<br />\nbeen<br />\nhas<br />\ntakes place a year later when all the<br />\nWest<br />\nat<br />\nArmy<br />\nManuel de Palla<br />\nplanp have been realized and the • Randolph-Macon at home, April cinder path not having been rolled. Tickets may be secured.from Dr. the high undergraduate standard of<br />\nthe various schools, offered more QUARTET<br />\nplay ends happily with Blake en- 27.<br />\nThe pits also need to be repaired. French, from members of the cast, positions than they did to any other<br />\nSelectiOng....arranged by Fishburn<br />\nWed to the Senator's daughter, the Swarthmore at home, May 4.<br />\nThis must be done very soon since or at office of the College for Teach- college. This is particularly gratiDear Old Johnny Hopkins<br />\nkingdom changed to a republic, and<br />\nRutgers at tiome, May 11.<br />\nwill<br />\nadmission<br />\nof<br />\nprice<br />\nThe<br />\ners.<br />\nfying news at a time when the unthe first track meet of the season is<br />\narranged by Steinwald<br />\nthe princess and Hawthorne in the<br />\nSt. John's at Stadium, Itiay•18. on April 6 with University of Dela- be $1.00 for the performance of the dergraduate situation is coming un- BANJO CLUB<br />\nfinal clutch.<br />\nMay<br />\nStadium,<br />\nat<br />\nMaryland<br />\nof<br />\nU.<br />\nder so much fire.<br />\nContinued on Page 4, C01. 4<br />\nplay and the lecture.<br />\nware at Newark.<br />\nCaplan, Gordon, Farinholdt, Roth- 25.<br />\nr<br />\nContinued on Page 2, Col.'1<br />\n<br />\nLACROSSE PRACTICE GOES<br />\nON DESPITE MUDDY FIELD<br />\n<br />\n\f•3 140nage Y‘TV*3-1.ErrEit. NIARCH 19. 1929<br />\nTHE 101-E<br />\n<br />\n2<br />\n<br />\n1111X1113HOME MS:Lima<br />\n<br />\n,<br />\ntt.<br />\n<br />\n_<br />\n<br />\nIL _1_<br />\n<br />\nifacianturnar rif<br />\n<br />\n1.16:2010 Li4V:<br />\n<br />\n.\"<br />\n--s<br />\n<br />\nIldwesigibm<br />\n• ter_<br />\n<br />\n1.1.en-i&m<br />\n<br />\nAs*<br />\n<br />\n1Mmorente.zj<br />\n<br />\nBilltirees. Mt_ smaer so7<br />\n<br />\n-_.te<br />\n<br />\n-'<br />\n<br />\n-<br />\n<br />\n\"ft,<br />\n<br />\n'V :It,7_7 1.7- --•.e<br />\n<br />\nTILL7 I<br />\n<br />\nseim-wmm.7 Lova<br />\n<br />\n:7<br />\n<br />\n•<br />\nserv:,<br />\n7:7,cari tSt. s.sorvl a:- : 'nigher<br />\n-raining h:77<br />\n-_f the<br />\n-u.se hisknowedge t.,ther<br />\n'At =a live a fier lift. .;<br />\n<br />\nIn. 7,7t7<br />\nilk/fhalia rst-ser-inty<br />\n<br />\nltinessw Weer eseseauthimminto<br />\n<br />\nMineriarg<br />\nPLEA? W _ Nix&<br />\n<br />\n:flak<br />\n<br />\n• *tr-<br />\n<br />\ntt.<br />\n<br />\nragtt:it t4.1<br />\ntar :I:zit-ma-24 -Ear<br />\n<br />\n911r101111AL DISPILETISIENT.<br />\nEditorr<br />\ncam=<br />\nA fro-4.4.:<br />\n<br />\ntttrt-r.....C.11=11.<br />\n<br />\nt :_<br />\n<br />\niS:_ VC4..<br />\n<br />\n:ops<br />\n<br />\n_<br />\n<br />\n.<br />\n<br />\nhuman a- •<br />\nexerc:the<br />\nits<br />\n<br />\n,74.l<br />\n<br />\nTt<br />\n<br />\n—_e<br />\n<br />\n17'7<br />\n<br />\nL±'37-t<br />\n<br />\nti7<br />\n<br />\n-<br />\n<br />\n-<br />\n<br />\nif<br />\n<br />\nt4t.<br />\n-- s • •<br />\n<br />\nLwow E. Itans.<br />\n<br />\n.:71--77..1 •<br />\n<br />\nf<br />\n<br />\nf<br />\n<br />\ndear,- of you-.<br />\n<br />\nAn'<br />\n<br />\n44<br />\n<br />\n1/0<br />\n<br />\nExtra Hich Grade<br />\n<br />\nSmoking Toha,<br />\n_..co<br />\nsaa.a.m.ii.R.O.sumatana<br />\n<br />\n1 az... 17,..<br />\n<br />\n,tp.itzrafI<br />\n<br />\nFor the days are keg. of<br />\nAn' tae ngrts arelor_ger sta,<br />\nAn'sometimes,'always smolrir.')<br />\nI pine up qtis old T'—<br />\nAn' try to .rste WM* pee.-.7.<br />\nTo tea you fi ray kree...<br />\nAs poetry it aih't men good,<br />\nan.— nay days shove—<br />\nIt's jest the best I ear., an'so<br />\n'foul: find ree. whim. I'm through,<br />\ndmit a-tUttin', stoserir.' Edgeworth,<br />\n<br />\n\"\" •<br />\n<br />\n,<br />\n4+<br />\nL<br />\n•n,<br />\nLeamet A.<br />\nPug IF<br />\nCow.<br />\nilizioes.<br />\niliellist<br />\nmaw Won't<br />\nMINXG.<br />\nYr N',Als<br />\n<br />\njam<br />\npecerriber<br />\neaburg.2,N192<br />\nj7\"<br />\n=oaf Edgeworth<br />\nAn' a-tLir-cin', 7:ear of<br />\nAn' a modle's humin' br*tly,<br />\nAn'. it says yoga- iove n true.<br />\n<br />\nEdffeworth<br />\n<br />\nA ca7,,,s,<br />\n<br />\nWZALAX LDiwnin.<br />\n<br />\nSmoker U\"<br />\nAwaiting<br />\nLoved One<br />\n<br />\nt t<br />\n<br />\n+.cr<br />\n<br />\ncommasucaz-.A.4,<br />\n<br />\n•<br />\neay ccernnercialtzed arid<br />\nant a<br />\nspecialized .as graditate,<br />\nin a 77 7_ 1 7. -f tt•<br />\n<br />\ni•77,17.e.<br />\n<br />\nLtIZ<br />\n<br />\nirs<br />\n<br />\nrirlIrlINWIlr11.41911911rowl<br />\n<br />\nCollege and Culture<br />\n5.17-1:711=-11<br />\n<br />\nDirseartzt.<br />\nNitta= It R.L..^<br />\n.747 onacag<br />\n<br />\nE<br />\n<br />\n- -72<br />\n<br />\nINL.St4s.E.W DEP<br />\nler<br />\n<br />\nmop,; 1.:socri7 11.41m-e.<br />\n<br />\niforoe,<br />\nGoma M. Guam: \"<br />\n(*or Shof<br />\n,<br />\nroute:Is.<br />\nL_<br />\n1101.0.10t<br />\nIsmissim.<br />\n.A.Aus<br />\nZak 7. Guiber. -at<br />\n<br />\nA a...7,777.ml<br />\n<br />\nBOSTONIAN<br />\n<br />\nrri<br />\n'3•112,<br />\n<br />\n-<br />\n<br />\nSHOES<br />\n<br />\nft:terser<br />\nPrIrmi. 71:<br />\n<br />\nnoisy V. awswerx<br />\n<br />\nwill be<br />\n<br />\nPrembeesi by ?be Lead-ray.47..<br />\n<br />\n1(<br />\n<br />\nDispla)ed<br />\n<br />\n'STORMER PLAY<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\naL<br />\n<br />\nTHE BARN<br />\n<br />\nan;<br />\n<br />\nWednesda, March 20<br />\n<br />\nHe z<br />\nHs ',tat<br />\n\"\"‘;<br />\n<br />\n11A. M. to 2 P. M.<br />\n<br />\n• ence.<br />\n<br />\n.WL\\DELL<br />\nPOPS f.4.<br />\n<br />\n7<br />\n<br />\naz-s<br />\n-<br />\n<br />\nt..\",7,4^7.1 et -.Int:.<br />\n<br />\nI=Len<br />\nt72 ts7110=3 Tin%<br />\n<br />\n•<br />\n,<br />\nthe re<br />\nr-axe-77<br />\n*se =_CZte<br />\na Uezvr?osiesses<br />\ndeft the ji-itr.4<br />\nne..atrCt<br />\nAlesi Marin nee= 're ;Frond<br />\n1C:t.<br />\n<br />\ntr.le<br />\n<br />\n7_<br />\n<br />\nla=<br />\n:t -7 -<br />\n<br />\nElienr.a.Ut=e4<br />\n7 7;<br />\n.<br />\nJ,7;<br />\n,1<br />\n2<br />\n!5/7.,C7<br />\nre..3Cri be= .<br />\n<br />\n'tntyins<br />\n`.mth's<br />\nfenthcoa;<br />\n<br />\n.7--<br />\n<br />\n1...7<br />\n••••<br />\n<br />\n7.14.5r tf<br />\n<br />\n-<br />\n<br />\n•<br />\ntok .ndic<br />\n.<br />\na<br />\n'nom<br />\nma cep, m•zit ginctFe„<br />\nact.=<br />\n<br />\n0==Fr<br />\n<br />\n7<br />\n<br />\nAwiraareinew most be<br />\nbestioathe' dx. Of<br />\nne= frit ,•77 star,. To rale<br />\ntX<br />\nI<br />\n<br />\n_<br />\nN<br />\n<br />\nPcç<br />\nan&sermes hoe X7-7:<br />\nTram.la..<br />\nset before thm„, ran the- ,Liriread hand<br />\n'teen<br />\nsutew,<br />\n.fil..7.weri<br />\n<br />\nRe<br />\nmad<br />\n:And (Sit-to aid*<br />\n-<br />\n<br />\nE ST A ITkLiS94EDEN GUS<br />\nNR S I TY<br />\nSTYLES,--q1a0Rtia.„<br />\nr5UTHFUL<br />\nCHARTS SCIIELTF.A.DIS<br />\nGUISHED<br />\nSERVICE 1-A Tili --3/1*43% STATES.<br />\n<br />\n,<br />\n3<br />\n<br />\nNgt.• EVERY MAN<br />\nHE veM E.7711. Rhys_<br />\n. I;..-r-.=:_nerir. Bri zere.Ltaii<br />\nMOST: :ftterr.r...:::.;<br />\n<br />\nT<br />\n<br />\n01.1Se<br />\n<br />\n-<br />\n<br />\nMr flys<br />\nquaircar,x of razinentos wrizers.„ fatuous ut •.:rporriry<br />\nveterans as George Bernard<br />\nhying<br />\nand art. Hebei thawed wait sloth<br />\nthe deal Thomas<br />\nShaw,Ii G. Wens and Amid Bennett, zni<br />\nRcéruLord<br />\nHardy, Sir E&c.rid G71915e, Waz W1titt1=71., '59k7thbt.,Une,<br />\nlie<br />\nbighorns).70x74:- Oirrad and 1.1=xe's intro: M.Venturi_ ci<br />\n*Coma=<br />\na<br />\nat<br />\nBrown:mg,<br />\nal cid ernot4lnto rementher Rohm<br />\nMxss:i-.4 at one<br />\nSnelky's Cosa and young enough to have<br />\nD'Arintunan's Nave M FL:me. He has sat I: - se sae ce Vir_ B.<br />\n.<br />\nd knot in and b'e<br />\nYeats in the Abbey Theatre, Dublin, and<br />\nRirys<br />\nwith Rodin in his Paris studaa These „mown have cyan<br />\na rith badtpotisml of sL7-vies and.' stirring<br />\nStalorIn his talk on Thuireday. -George Bernard %saw versus<br />\nspews,- .the Wiring leznae, 7-reamed skilful* painted<br />\nfa=s_,<br />\n, ci<br />\ninto the thars:-e<br />\nand gave intilaate<br />\ntcreri....<br />\n=satirist_ He tad of Seara's sm000veiscaccal pub at the<br />\nthe 'heels of ,the<br />\n.01 Thomas Hardy; Shaw, the ra.4,--21 ---eadinir on<br />\nway<br />\nes<br />\nwended<br />\ntionege<br />\nalosersatroe Rudvard raphag, as the firseral<br />\nSlaw,•&sgoi.sed<br />\ndwough the son:rre sisadows of W---ommmer Mary;<br />\neaas<br />\nas-Prospero, at the book-seller's shop a: Stratford-on-Ason In<br />\nlie ft.111.*7.<br />\nof *these nutoresteig .imems, Mr_ RLT, ae.thed<br />\nthe faithfulness and accuracy of a &owe&<br />\nof Sear:nig a ihrLarm:<br />\nThose who had aloe with the<br />\n-Awon.<br />\nis:n:4,427.5m of th, fax George Barnard and the Bard of<br />\nare:Amu and<br />\nWere pleasantly - 45sed to bear a saws of anmasiang<br />\n,<br />\nHMV'<br />\newer<br />\naz...ICUs:sof the<br />\n.T.:<br />\na fast band az,77:,<br />\n<br />\nSO,<br />\n44<br />\n<br />\n,<br />\nSCir 14<br />\n.4,S<br />\n04<br />\n<br />\nEIW SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n; sweet<br />\n<br />\n=.a.at<br />\n<br />\n-0<br />\n<br />\n.2.t.tL•<br />\n<br />\n:7s<br />\n,am- wh:<br />\n::: f. 7<br />\nOnce in ; _I '.rhy*.....s. .-.zazat -_:: 7.7.- __-. --a: -__a_ge• How aS<br />\nf Fre.l.,t.e H----..-- ', - -, 1.:...ed the ean<br />\nspec:etre w\"-±..::: awl:. tan : 174 in-<br />\n<br />\ns<br />\n_<br />\n<br />\ng7ta:<br />\na.-7.<br />\n.Sr<br />\n<br />\n7<br />\n<br />\n•<br />\n<br />\nUAILTIMCCE<br />\n<br />\nr'rierr,<br />\ntt.t.<br />\n<br />\n11)<br />\no<br />\nflharter<br />\nCU<br />\n<br />\n7<br />\n<br />\n7. - •<br />\nAnc,citer goy.:1. show. We re -......7 - .<br />\nthe<br />\nDoug Fairbanks, the original<br />\niivailahle in a Hawasccar, could have beer_ pvc.- itastie of fields.<br />\nerg, he ir-xild have stood on his or- borders dot<br />\non the mere:y<br />\ntheia chair and rt.n.re.-1 lris un- techr.a<br />\nby<br />\n*Mk<br />\nschool.,<br />\nqualed apptrova/..<br />\nturn oat phike•<br />\nciphers as ccr—'77=all'y =.,,•-!evelope<br />\nG E. B. ja.<br />\nll<br />\n<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\n1liellub<br />\nNa.<br />\n<br />\n41••<br />\n<br />\nado-1 ra,, sate<br />\nbow316.•.<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 19, 1929<br />\n<br />\nmoo.<br />\n<br />\nWHY NOT<br />\n<br />\nThe Communion of Great Minds<br />\nBy M. J. SCHMULOVITZ<br />\n<br />\nArthur Hobson Quinn to<br />\nLecture Here April 5<br />\n<br />\nArthur Hobson Quinn, from the<br />\nIn the NEWS-LETTER of February tor of the Blade... who urged him University of Pennsylvania, will de12 there appeared an article Dreiser to attempt a ncrbel. .. . One day in<br />\nliver a lecture on Friday evening,<br />\nby \"Ben.\" As you know, I had September, 1899, Dreiser took a<br />\nin the<br />\nscolded \"Ben\" for some of his sheet of yellow paper and wrote a April 5, -1929, at 8 o'Clock,<br />\neMANNIE GBERG childish<br />\nreasoning in a previous let- title at random. That title was \"Sis- assembly roam of the C. E. Hall.<br />\n\"The Old Boy Himself\"<br />\nter, but this study of Dreiser re- ter Carrie,\" and zvith no more defi- The topic of Professor Quinn's lecdeemed him. \"Ben\" went up in my nite plan than the mere name offered ture will be \"The Beginnings of<br />\nNORTH fi MARYLAND AVES.<br />\nestimation considerably, for .1 dis- the book began. . . . [In] England American Drama.\"<br />\ncovered that he was a veritable \"Sister Carrie\" is regarded (accordIt is due to the efforts of Mr.<br />\nRich fabrics and pleasing patterns in Spring<br />\ngenius. The discovery was quite ing to Harper's), as \"the best story,<br />\nFagin,<br />\nwho has charge of the<br />\ncome<br />\nout<br />\nyet<br />\nhas<br />\nthat<br />\nwhole,<br />\nthe<br />\nSuits and Topcoats that faithfully reflect<br />\nBOOKS<br />\nsimple. I recalled having read an on<br />\nof America.\" A curiou.c series of Homewood Playshop proditction of<br />\nthe latest decrees of fashion<br />\nessay on Dreiser by MenCken in his<br />\nBought—Sold—Exchanged<br />\nthe current year, that 'Professor<br />\nepisodes .. . Jennie Gerhardt,<br />\nPrefaces,<br />\nand<br />\nupon<br />\ncomparing<br />\nSTORE<br />\nBOOK<br />\nPIPPEN'S<br />\n1911 .. . A Traveller at Forty ... Quinn will be brought here. Cost<br />\nREADY-To-WEAR<br />\n\"Ben's\" work with it, I found that 1913 ... The Financier, 1914 .. .<br />\n605 N. EUTAW STREET<br />\nof admission will be 50 cents.<br />\n\"Ben\" not only had the same ideas, The Titan . 1914 . The Genius<br />\ntheme, manner of devlopment, etc., ... 1915 .. A Hbosier Holiday.. ..<br />\nshort sto- people are both evil and well intenas Mencken but even used the same 1916 .. a dozen or more<br />\ndg8:WRNM<br />\nrks....<br />\ntioned.\"<br />\nwords.<br />\nCOMPLETE<br />\nAnd then comes \"Ben's\"1 fourth<br />\nAnd yet people say that the genius<br />\nCan the reader realize the full sigparagraph, a monument to the unity of Hopkins is in the Medical School,<br />\nnificance<br />\nof<br />\nsuch<br />\na<br />\nfact! Here we<br />\nkt.<br />\nof great intellects:<br />\nand not at Homewood!<br />\n•<br />\nhave a mere college student who,<br />\nDreiser's income from Sister CarI can see that some people will<br />\nFive East Lexington Street<br />\nin writing about the life and works<br />\nrather negligihle, and so deny the wisdom and geniusl<br />\n'of<br />\nwas<br />\nrie<br />\nof greiser, thinks in exactly the<br />\nin 1905 he took a position on the Mencken, but even for them this<br />\nllE<br />\nCre<br />\nsame channels and even 'the same<br />\nstaff of Street & Smith, the famous document must remain an epoch<br />\nwords as a man of ififty years who<br />\nMOMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n\"Dime Ii-over'producers. . . . His making research into the philosophy<br />\nhas spent most of his life in the<br />\nJ. A. RITTER & SON<br />\nword nov- and psychology of the metaphysical<br />\n60,000<br />\nreduce<br />\nto<br />\nwas<br />\njob<br />\nCo.<br />\nstudy of literature! Think' how i12<br />\nFlorists and Decorators<br />\neli to a length of 30,000 words.. .. communion and harmony of grea_t<br />\nlumina.ting and delightful a revelaBALTIMORE, MD.<br />\n1918 N. CHARLES ST., Near 20TH.<br />\nHis method in brief was this: The minds.<br />\nPhone, VErnon.0573<br />\ntion it would be to Mr. Mencken<br />\nCALVERT<br />\nnovel was cut exactly in half by<br />\n18CO• 1801<br />\nto meet his exact prototype; maybe<br />\nHome—HO. 20914<br />\nCAI. 1380<br />\n1802.1803<br />\nmeans of a pair of scissors; a new Phone,<br />\n1804 - 1805<br />\nFRANCES T. BRANNON<br />\nhe<br />\nwouldn't<br />\nquickly<br />\napologize<br />\nfor<br />\nP5X<br />\nending was written for the first half Successor to HARBAUGH El BANNON<br />\nthe bitter scorn and mockery he has<br />\n......<br />\nST., Cor. Charles<br />\nand a new beginning for the second! 2 E. LEXINGTON<br />\n(Room 28)<br />\npoured fordi upon college sophisti•SERVICE.<br />\nTo the Johns Hopkins students we extend a cor... Subsequently, he was associated<br />\nStenographic Dictation, Copying,<br />\ncates.<br />\ndial invitation to come' in and see our beautiful<br />\nMultigraphing, Mimeographing<br />\nwith the Broadway Magazine, The Baltimore<br />\nMaryland<br />\nBut I shall no longer detain from<br />\nhand-wrought Jewelry, our importtions of ancient<br />\nProducers of \"The News-Letter\"<br />\nDelineator, and the Bohemian Magand modern gifts. Prices very mode ate.<br />\nmy reader (who must certainly<br />\nCO.<br />\nMYERS<br />\nE.<br />\nCHARLES<br />\nTHE<br />\ndeto<br />\ndecided<br />\nhe<br />\nfinally<br />\nuntil<br />\nazine,<br />\nnow be teeming with anxiety) these<br />\nIncorporated<br />\nTEACHERS WANTED<br />\nvote his entire time to writing.<br />\nManufacturer of<br />\nMen and women who- are plannitig<br />\nof<br />\nexamples<br />\nharmony<br />\nof<br />\nremarkable<br />\nto teach In secondary schools or<br />\nGRUBBER STAMPS<br />\nCompare with Mencken: In 1905,<br />\ncolleges should 'write or call. We<br />\nthe sold.<br />\n109 W. SARATOGA ST.<br />\nhave placed many Hopkins graduThe Service Shop<br />\nuncertainties of this<br />\nates.<br />\n\"Ben's\" first sentence: ... Theo- tiring of the<br />\n319 W. Redwood St<br />\nTHE BALTIMORE TEACHERS'<br />\na post.on the staff<br />\nAGENCY<br />\naccepted<br />\nhe<br />\nlife,<br />\ndore 1 Dreiser remains perhaps the<br />\n402-3 Tltle Annex Bldg.<br />\n'Stout & Smith the millionaire<br />\nmost enigmitical man of- American of<br />\npublishers of ... dime novels. . . .<br />\nLetters.<br />\nOne of his jobs, for example, was to<br />\nMencken's first sentence: . . .<br />\nj...i.f.ALKSzBiDikt<br />\nreduce a whole series of dime-novDreiser stands up s phenomenon .<br />\n13f<br />\nels, leach 60,000 words in length, to<br />\ndisconcertingly hard to explain.<br />\nEstablished 1832<br />\n\"Ben's\" second sentence: He has 30,000 words apiece. He accomPHILADELPHIA<br />\nbeen misunderstood continually. .<br />\nplished this by cutting each into<br />\nOfficial'Makers of the Standard<br />\nMencken's second sentence: . . . halves, and writing a new ending for<br />\nhow has he held out against ... dis- the firstlialf and a new beginning<br />\nheartening misunderstanding...<br />\nfor the second, with new titles Tor<br />\n\"Ben's\" third sentence: Dreiser, both . .. in 1906 he became managhowever, continues to plod along.. .<br />\ning editor of the Broadway MagaMencken's fifth sentence: He still<br />\nzine . . . chief editor of The Delinplods along.<br />\neator . . . and the Bohemian MagaJohns Hopkins Ring- ,<br />\nTo a student of psychOlOgS, it will<br />\nzine. . . . Its publicatir [Jennie<br />\nPrices Upon Request<br />\nbe very interesting to notice how<br />\n... during tht same year<br />\nOrders accepted at the<br />\nMencken in his Chapter 2, and Ben Gerhardt]<br />\nPost Office in the College<br />\nhis final emancipation from<br />\nin his paragraph 2, heartily agree worked<br />\ndesk.<br />\nupon Dreiser's detailed, lumbering the editorial<br />\nstyle. Here 'is one example:\"Ben\": The last paragraph in \"Ben's\" arHe is obsessed with the desire to ticle is still more wonderful and as\"tell it all\" ... Mencken : . Drci- tonishing than the others. Such hoser [has] an unshakable determina- mogeniety of spirit as this almost<br />\ntion to tell it all. Ben doesn't say verbatim paragraph shows, can be<br />\nexplained only by the esoteric and<br />\nfrom whom he got \"tell it all.\"<br />\noccult sqiences. These are \"Ben's\"<br />\nAnd for the gem of telepathic gewords:<br />\nnius one has but to compare \"Ben's\"<br />\nDreiser's work is extremely unMencken's<br />\nthird paragraph with<br />\nfourth chapter. Here is \"Ben's\": even, and there is an infinite distance between his best and his<br />\nSister Carrie is perhaps the best<br />\nworst. It is almost impossible to<br />\nexample of Dreiser en Pantoufles.<br />\nhow a man capable of Jenexpldin<br />\nstarted<br />\nIt was his first book and was<br />\nnie Gerhardt could produce anyonly because of the pleadings of a<br />\nthing as dull and stodgy as The<br />\nfriend, Arthur Henry, who waS. Vat Tommy is furious—<br />\nBlade. Genius. . ..<br />\nThe<br />\nof<br />\neditor<br />\ntime<br />\nthat<br />\nadmits it -- and all<br />\nAnd Mencken's: The work of<br />\nplies a man's high qualities in useful<br />\nDreiser, we are told, picked up a<br />\n'cause he didn't know<br />\nwrote the title, Dreiser. is extremely uneven, and<br />\nand<br />\nnels.<br />\npaper<br />\nchan<br />\nof<br />\npiece<br />\nBraeburns<br />\nabout<br />\nIt opens to all men a field as wide<br />\n\"Sister Carrie,\" at random. With the distance separatin4 his best from<br />\nwhen he bought a<br />\nis almost infinite. It is<br />\nas all human endeavor.<br />\nno more definite plan than this his his worst<br />\nspring suit.. He'll<br />\ndifficult to believe that the novelist<br />\nBecause<br />\nway.<br />\nits<br />\nOne may qualify himself along<br />\non<br />\nwas<br />\nnovel<br />\nfirst<br />\nhave to buy one now<br />\n... Jennie Gerhardt . ..<br />\npurely engineering lines. Another may<br />\nof this it is all the more interesting who wrote<br />\n•<br />\njust for his peace of<br />\nis the same who achieved . . . the<br />\ncontribute his powers of commercial<br />\nto note that Sister Carrie is remind.<br />\nstodginess of<br />\nreasoning. Another his ability to anaE lost that particular race. And<br />\ngarded in England as \"the best general stupidity and<br />\nso, honest effo5t and tense con- lyze management problems.<br />\nstory, on the whole, that has yet The Genius.<br />\nSURING<br />\nThese three totally different qualifiAnd now, dear reader, ponder<br />\nIIIMACIPULNS<br />\ncentration got him nothing. But in<br />\nqn.me out of America.\" After this<br />\nwith two trousers<br />\ncations just begin to define the<br />\nindustry this fine spikit would<br />\ncaale Jennie Gerhardt, The Finan- upon this fact of superhuman acpossibilities in one industry<br />\nnot be thrown away.<br />\ncier, A Traveler at Forty, The Ti- cord: Mencken and \"Ben\" both<br />\n$35<br />\nthe telephone making<br />\nalone—<br />\nby<br />\nstudies<br />\nHolipenetrating<br />\nHoosier<br />\nfairer<br />\nis<br />\ntheir<br />\nindustry<br />\nclose<br />\nrespect<br />\nthat<br />\nA.<br />\nIn<br />\nGenius,<br />\ntan, The<br />\n8 111<br />\nindustry.<br />\nand kinder than college. It ap8-IS<br />\nday, a small quantity of little-known quoting Dreiser's 'sentence: \"For<br />\nmyself,\" says Dreiser, \"I do tlat<br />\nwork, and An American Tragedy.<br />\nClothiers ass,! Haberdashers<br />\ntruth is, what beauty is,<br />\nMencken: It (Sister Carrie) is, know what<br />\nTHEI-IFVUEVEco.<br />\nwhat hope is. I do not<br />\nis,<br />\nlove<br />\nwhat<br />\nbook.<br />\nfirst<br />\namazing<br />\ntruly<br />\nindeed, a<br />\nbelieve anyone absolutely, and I do<br />\n. . . It was an old friend from To57 E. Baltimore St.<br />\n'INCE 1882 MANUFACTURERS FOR THE BELL SYSTEM<br />\nnot doubt anyone absolutely. I think<br />\nledo, Arthur Henry ... the city ediPut your- numerals on one of<br />\nthose Collegiate, black sweaters<br />\nfrom<br />\n<br />\nSpring Apparelfor University Men<br />\n<br />\n$45<br />\n<br />\nA<br />\n<br />\n4;<br />\n7<br />\n<br />\n0<br />\n<br />\nlos. *01055 &<br />\n<br />\non<br />\n<br />\nV<br />\n<br />\nREAD.<br />\nTAYLOR<br />\n<br />\n°An Invitation<br />\n<br />\nCARL SCHON, INC.<br />\n<br />\n1LEY.B<br />\n<br />\n1<br />\n<br />\nMeet Tommy<br />\n<br />\ne lost;<br />\n<br />\nbut..<br />\n<br />\nH<br />\n<br />\nWestern Electric<br />\n<br />\n\fTHE Jcieei* Haruki<br />\n<br />\n4<br />\n<br />\nMAIM IS. MS<br />\n<br />\nNE-4VS.<br />\n<br />\n=<br />\n<br />\n1<br />\n<br />\n- - Nic-To'z - -<br />\n<br />\nThe 0. D. K. of<br />\nMotor Fuels<br />\n_-12.(oco-GAs<br />\n<br />\nYou do k,et Better Kodak Pictures<br />\nfrom<br />\n<br />\nbERP PHOTO SERM)<br />\n<br />\n_<br />\n<br />\n.F.•<br />\n<br />\nTre:<br />\n<br />\nEST. 1900<br />\nG.REEN.V.1.<br />\n•<br />\n<br />\n_<br />\nv-i:<br />\n::;i:<br />\n<br />\n- -<br />\n<br />\n1. Lill<br />\n<br />\ni1<br />\n<br />\n_<br />\n<br />\n111111<br />\nIII<br />\n<br />\nAmsma<br />\n47'<br />\nmr 1,0• 7 mg :<br />\n<br />\nH. FETTING<br />\nANCFA.Ci L.:PING JEWELRY CC<br />\n<br />\n:44;<br />\n,<br />\nrtz' 4441411<br />\n<br />\n-<br />\n<br />\nimirkfrvify- .\"'app!r (lab<br />\n<br />\nT.eiL<br />\n<br />\nMAW<br />\n<br />\n1-<br />\n<br />\nGreek<br />\n4zir<br />\n<br />\nL zencatrizr:<br />\n:Lee 'we:4r<br />\n<br />\nanz. -.71- 7<br />\n<br />\n.71 71<br />\n<br />\n••••= at=<br />\nie▪ r<br />\n<br />\n:?-eut<br />\n<br />\n7-4d VI441.-1<br />\n<br />\nNORTH CHARLES STRYST<br />\n<br />\n-7J<br />\n<br />\n'77<br />\n<br />\nT.(r.zr<br />\n<br />\n- i.<br />\n- rm.& a<br />\n7*-rasteric:- zit riiw --fr-t7 2,'<br />\n• pat verzseL:\"<br />\n,-imonneenj 7.1,11.<br />\nV\".1<br />\nvr<br />\n-T-PM/14 44CtiI .?1,11147 -rev<br />\n=wiz 7_:ig<br />\n:mime<br />\n'<br />\n-`3<br />\n7-16, cfzir<br />\n•<br />\nV - v.<br />\nLea.<br />\naDr<br />\n<br />\nv•<br />\n<br />\n,orireteit \"noln<br />\nPIANO a-<br />\n<br />\n•<br />\n<br />\nvrek-x-<br />\n<br />\n;Ai,'<br />\n<br />\nziltaiflozz;e1'<br />\n<br />\nCab Co.<br />\n<br />\n•G<br />\n<br />\nINC<br />\nN. Cas5tree.:<br />\n<br />\nfi<br />\n<br />\nF-MILE<br />\n:A FIRST<br />\n10c each additional Half-Mile<br />\n-..Lr fraction thereof<br />\n<br />\n\"Lit'<br />\n• -- •<br />\n<br />\ne 71,41 appi,es for it<br />\n<br />\n:le<br />\n<br />\n=.<br />\nq)iiir=c)<br />\n<br />\nI.<br />\nt‘<br />\n<br />\n4<br />\n<br />\nCOMPASS!<br />\n-<br />\n<br />\nT-77-4=<br />\n<br />\nVf. Ptat<br />\n<br />\nf<br />\n<br />\nAt Yaw Service 24 Hours a Day<br />\n<br />\nti<br />\n<br />\n_<br />\n'-<br />\n<br />\nTOW<br />\n<br />\n-V<br />\n<br />\nNOrlOW'ra.r.<br />\n<br />\nPLMOiEr-7.1_<br />\nScreed Sztg:clies,<br />\n<br />\nLianceirat<br />\nMal<br />\n<br />\n-<br />\n<br />\n- -<br />\n<br />\nt1<br />\nsc<br />\nol<br />\nat<br />\nItt<br />\n<br />\n'<br />\n<br />\n•<br />\n<br />\n_<br />\n<br />\n_<br />\n<br />\n_<br />\n<br />\n•e<br />\n<br />\n(ROBIN.'<br />\n<br />\n-<br />\n<br />\na1=13.=pry<br />\nF7<br />\n<br />\n;otr<br />\n<br />\nCVO<br />\n<br />\n-7- :7<br />\n7-, ••<br />\n<br />\n15%<br />\n<br />\nIS AaCAL CU<br />\n<br />\nCRT<br />\n<br />\n-<br />\n<br />\n1-7<br />\n<br />\n•<br />\nS_<br />\n<br />\n•<br />\n<br />\nd St.<br />\n<br />\n1 \\H<br />\n<br />\n•<br />\n<br />\nn<br />\n<br />\nPOSTA F-1E-<br />\n<br />\nES.50<br />\n<br />\nY(<br />\nIt<br />\nti-<br />\n<br />\n;<br />\n<br />\n•\"5::<br />\n<br />\n•<br />\n<br />\nV.<br />\nat<br />\nta<br />\nhi<br />\nal<br />\nat<br />\n<br />\n-•<br />\n<br />\nst<br />\n-<br />\n<br />\nITQ<br />\n<br />\nP1<br />\n<br />\nSi<br />\nCC<br />\ntC<br />\n,in<br />\n<br />\n-• -<br />\n<br />\n-<br />\n<br />\nCC.<br />\n<br />\nFIDF-T ri. Y AND<br />\n34.<br />\n142,<br />\n<br />\nA<br />\n<br />\noli<br />\n<br />\nzsti<br />\n<br />\n2...lraf.0RE. BRANCH<br />\nMOGI\".<br />\n<br />\nIN iishioned<br />\nB 111<br />\ncwords,.<br />\ncdhive.or<br />\n.,v<br />\n<br />\n_<br />\n<br />\n_<br />\n<br />\nf.<br />\n<br />\nOFFICE<br />\n<br />\n1t.nm, M.asjFacr_e.<br />\n1<br />\n<br />\n▪<br />\n<br />\nITIV V<br />\n<br />\n7v-:<br />\n<br />\nr_-<br />\n<br />\n-±tl•<br />\n<br />\n-<br />\n<br />\n-101-D; C. KNff? & :SONS<br />\n<br />\n▪<br />\n<br />\n;Atd di125<br />\n51171 -.4 '..V.t4..:ArifSikt<br />\n<br />\nc nett= r..k\"<br />\n,<br />\n'<br />\nCcit .47-=-<br />\n<br />\nTI<br />\n40:<br />\n<br />\nP'42oltz<br />\n<br />\nN•rir Ze-2rati; Sidory.<br />\nLacetros._<br />\n.w.4.1<br />\n<br />\nit.A••!.<br />\n<br />\nattietiie5<br />\n<br />\n=2-2tack a alp- The<br />\n1.= 2IZS<br />\n<br />\nSic.. Loewe<br />\n.1.4 Caor.:ei<br />\n<br />\nUAUTY SHOP<br />\n<br />\n11<br />\n<br />\nFmrs<br />\n<br />\n12.szt.:1<br />\n<br />\nFURNITURE<br />\n<br />\n+.4..t<br />\nrho Soroogor<br />\nCloacKwooki<br />\nmow<br />\n<br />\n.<br />\n<br />\n$t)it and<br />\nAnd .rtk:rtiLiebesi<br />\nNunri•lkush Cipj,lave die<br />\nankk---t1. umeightte mos% seet<br />\nAlvong a the hitt<br />\n<br />\n1 r_a<br />\n•<br />\n<br />\n-<br />\n<br />\n5ryt-, 77.<br />\n<br />\n;<br />\n<br />\nJ;<br />\n<br />\n* A<br />\n<br />\nnI<br />\n<br />\n14<br />\n2<br />\n<br />\nin<br />\nth<br />\nSr<br />\nht<br />\n<br />\n\f", "format": "basic_html", "processed": "'STORMER PLAY IS<br />\nTERMED SUCCESS<br /><br />\nPrice 5 Cents<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 19, 1929<br /><br />\nVol. XXXIII, No. 39<br /><br />\nJ.H.U. WOMANS CLUB<br />\nTO GIVE CARD PARTY<br />\nThe J. H. U. Woman's Club<br />\nwill give its first card party at<br />\nthe I,ord Baltimore Hotel on<br />\nthis Friday, 1C1arch 22nd, at<br />\n8:30 o'clock. Prizes and refreshments will be given and,<br />\nthe cost of admission will be<br />\n75 cents.<br />\nThis party is the- first attempt by the Woman's Club to<br />\nsponsor any such event and it<br />\nis being held for the purpose<br />\nof acquainting the members of<br />\nthe facultfras -well as for the<br />\nsocial intercourse between the<br />\nstudents'and members of the<br />\nfaculty. Tickets may be ob- tained by dropping a note in ,<br />\nP. 0. Box 741, or from any<br />\nmember of the Woman's Club.<br /><br />\nGHOST OF FORMER EDITOR ROAMS<br />\nEARTH IN CURRENT \"Y\" NE<br /><br />\nPIPP-<br /><br />\nELIVERED PHOTOS<br />\nARE TO BE SOLD<br />\nUnless all Hullabaloo group<br />\npictures that have been ordered<br />\nare obtained from S. Carson<br />\nWasson before the end of this<br />\nweek, they will be-offered for<br />\npublic sale.<br />\nEveryone who has ordered<br />\nthese pictures is requested to<br />\nmake definite arrangements<br />\nabout them through Wasson,<br />\nP. 0. Box 1045.<br /><br />\nMUSICAL CLUB GIVES<br />\nCOMBINED CONCERT<br /><br />\n'cal value<br />\nMake way! The \"Khaki Men- value and of little<br />\nght.\" Be that as<br />\nace\" is slowly but surely overshad- even in a<br />\nGeorge Washington U. Girls' Glee<br />\nwas it not Milton that said<br />\nowing the fair greens of our niEach Member of Cast Interprets<br />\nClub Sings With Jays<br />\nPart Well<br />\na fair education was one that fitted<br />\nversity's calnpus, and for that<br />\n•<br />\nter campuses of other universities, a man to do justly all the duties of<br />\nCONCERT WELL RECEIVED<br />\nDEETS AND HORN GOOD<br />\nschools, colleges, or *hat not—so office, in peace or 'war? And our<br />\nstates an editorial in the Hopkins R. 0. T. C. unit is supposed to take<br />\nDual Plan of Concerts Termed<br />\nLatter Particularly Draws<br />\ncare of the \"war side of life.\" Also,<br />\nComplete Success<br />\n\"Y News.\"<br />\nApplause<br />\nQuoting from the \"Y News,\" the R. 0. T. C. Manual states that<br />\nIn conjunction with the George<br />\nwhich in turn has obtained the fol- \"The methods employed are deAlthough the curtain in the last<br />\nWashington Girls' Glee Club the<br />\nlowing data from pamphlets of the signed to fit them physically, mentalact dropped on the table and the<br />\nJohns Hopkins Musical Club renCommittee on Militarism in Edit- ly and modally, for purposes of<br />\nRoyal Guard did not fall as gracedered a very delightful and successpeace as well as war.\" And+,<br />\n86<br />\nin<br />\nthat<br />\nshow<br />\n\"Statistics<br />\ncation:<br />\nthey<br />\nl<br />\nmight<br />\nhave,<br />\nas<br />\nanthe<br />\nfully<br />\nnior Banquet to<br />\nful concert at the Raleigh Hotel in<br />\nthat the R.<br />\ndeny<br />\ncan<br />\nuniand<br />\nschools,<br />\ntechnical<br />\ncolleges,<br />\nnual production of the Barnstorm11<br />\nWashington last Saturday night.<br />\nApril'<br />\ntilicr' Students—<br />\nHeld<br />\naccomplishing<br />\nMilStates,<br />\nBe<br />\nin<br />\nUnited<br />\nversities<br />\nthe<br />\ners was a big success. Dwight Horn<br />\nitary Training is compulsory for at knock-kneedy/gUnIcen chests, flatt a meeting held last Friday of This marks the second attempt at<br />\nand Jack Deets both scored well in<br />\nleast two years. In 44, it is elective. footed (s1te files are reference), the Junior Banquet Committee, anything of the kind this year, the<br />\nthe leading roles. Horn as the PrinHigh schools in 53 cities, 7 junior sign their names to the R. 0. T. C. Au il eleventh was set as the best first having been with Haverford<br />\ncess Irma of Borrovina, was parcolleges, -and 38 military . schools unit—and:behold, they graduate as d e for the affair. Due to the last week. The experiments have<br />\nticularly well receivedifthis excellent<br />\nhave junior R. 0. T. q. units. Par- fine young reserve army officers!<br />\nrly Easier vacation, the banquet been so successful that, withOut<br />\ngestures and graceful motions<br />\ntial government subsidization is The \"-Y News\" states that \"If th could not be held before the spring doubt, the duet plan will in the fubringing frequent bursts of applause<br />\nfound in SO institutions, including R. 0. T. C. were of value, the T<br />\nrecess and still leave the necessary ture form a large part of the club's<br />\nfrom the audiences. However, it<br />\nrad- week for the freshman and sopho- engagements.<br />\nthe high schools of 15 cities. That versity'would not fail to off<br />\nwould be difficult to pick any indiPlaying before a rather large and<br />\nBut, of more banquets.<br />\nmeans a total Of 278 American An- nate courses in the fie<br />\ns,viduaI .star as the entire cast pera<br />\nappreciative audience, the combined<br />\nof West Point 'what 'benefit • w. a a graduate<br />\nstitutions—exclusive<br />\nhel<br />\nsophomores<br />\nthe<br />\nyear<br />\nLast<br />\nformed admirably.<br />\nand the Naval Academy and schools 'course be? . est Point takes care their Banquet at the Southern schools presented a chain of attracSpectators Attracted to See<br />\nThursday night the curtain rose<br />\ntions no single links of which weakDaily Workouts<br />\nwhere training is given indepen it- of<br />\nHotel, and each member , was<br />\nat 8.45 with Hawthorne on the stage<br />\nened the Whole. The Hopkins Mu\"innocent<br />\nthat<br />\nseems<br />\nit<br />\nBut<br />\nof<br />\nly<br />\nWar<br />\nthe<br />\nDepartment.\"<br />\nfor<br />\nCoach<br />\nhalf<br />\nwind<br />\na<br />\nand<br />\nand<br />\nmud<br />\nrain,<br />\nAmid<br />\ncharged two dollars<br />\nand Rodney Blake, played by Bill<br />\nWhich all means, that if one takes youths\" (pertaining to Johns Hop-this meal alone. All additional ex- sical Club as the guest of the George<br />\nBanks, president of the club, emerg- Van Orman and \"Father<br />\nWashington University, was the<br />\nare<br />\nparents<br />\ntheir<br />\nand<br />\nstudents)<br />\nkins<br />\nto<br />\ntime<br />\ntrouble<br />\nthrough<br />\ngo<br />\nthe<br />\nand<br />\namples of,music, entertainment and<br />\ning over the wall of the garden eat- Schmeisser have been whipping<br />\nthe catalogue of the College of Arts told of its value in physical and dis- decoratibtis were paid for by the featured part of the program and,<br />\ning an apple. After a short dia- their material imo shape.<br />\nand Sciences of the Johns Hopkins ciplinary purposes—and that the<br />\nas the at- as such, presented the major porlogue telling how Hawthorne broke<br />\nBad weather has not daunted the University, one would see how the training is not to make soldiers. Um class treasury. However,<br />\ntion of the evening's entertainment.<br />\ntendance was small, it was thought_<br />\nthe Bank at Monte Carlo, it is spirit of the lacrosse candidates alR. 0. T. C. has gained sway in the who is theione that can view'the advisable to lower the price per per- However, although making only two<br />\nthat<br />\nhero<br />\nout<br />\nour<br />\nis kept in though it has hindered the perfectbrought<br />\nprecincts of the departments of R. O. T. C. companies' machinery son, by having the banquet at a appearances, the Girls' Glee Club<br />\nBorrovina because of a certain un- ing of the field play of the team.<br />\nstudy. Five pages in this catalogue dignifiedly all over the Hopkins smaller hotel, and a less elaborate formed one of the high lights of the<br />\nknown lady. Hawthorne finally Every afternoon, either amid the<br />\nare devoted to the \"bfillyhoo\" of the Quadrangle and say to himself, dinner. Tentatively, the banquet evening. They were very well<br />\nmanages to get rid of Blake by con- cold rain or in the sticky mud, the<br />\ntrained and the sweet and pure<br />\n,<br />\nR. 0. T. C. Militarir Training of- \"These are not soldiers!\"<br />\nwill be held at the New Howard<br />\nvincing him he should send a tele- men have been playing on the lower<br />\nAfter all, \"force is the- ultimate Hotel, and each member of the quality of their combined voices<br />\nfers 17 e it points, a<br />\nthe \"Y<br />\ngram to Senator Ballard and his field getting the team work which<br />\nNew makes so bold, the state'<br />\nwer,\" And did,there not once live class will be charged two dollars. produced such a beautiful effect, in,daughter telling them to come to is so essential to the smooth worktensified by the contrast with our<br />\ntha the training \"is of no cultural a Ilenry Turnbull?<br />\n*<br />\nThe committee , is' planning to own manly voites, that it drew<br />\nthis little kingdom, as the excellent ing of a championship team.<br />\ngood ,orchestra - and elab- even the plaudits of the Hopkins<br />\na<br />\nhave<br />\n(?) springs will surely cure the<br />\n. The first string .attack have been<br />\nising Matedal<br />\nHomewood Playshop<br />\norate acts of entertainment, and to Glee Club. Miss Harriet Nash, also<br />\nSenator's rheumatism.<br />\nPlaying against the first string deFou<br />\nt Practice<br />\nRenews Activities overcome the comparative shadow of G. W. U., performed excellently<br />\nHeroine Arrives<br />\nfense, or the tentative first string<br />\nThe Homewood Playshop an- cast over the Junior banquet by the at the piano and fully deserved the<br />\nThirty-five candida<br />\nare tryin<br />\nThe heroine then arrives and a men. On the first string attack<br />\nvery amusing scene takes place have been playing: Love, at in out for places on this year's track nounces the presentation of a re- excitement of those of the two pre- thunderous applause which she was<br />\nwhen King Augustus III, better home; Lyons, out home; Eagan, team. After two weeks of practice vival of the first American comedy, vious years. Tickets will be placed accorded.<br />\nknown as Howard Caplan, arrives first attack Sauerwein, second at- Coach Hambleton can now. realize \"The Contiact,\" by Royal Tyler. on \"sale for members of the Junior The Hopkins Musical Club supunder an excellent diskuise consik- tack; Hersperger, third attack; what material he has with which to This play vks Written in 1787, and class the day school reopens after plied. its usual splendid program. A<br />\nmarked the first appearance of the the holiday.<br />\nfew of the numbers which were preing of whiskers, many brass but- Campbell, center. On the first dework.<br />\nstage Yankee in .the character of<br />\ntons, and sword almost dragging fense hae been: Hall, at point;<br />\nThe banquet will begin at seven sented at the home concert were<br />\nhim to the floor. With Hawthorne Keating, at cover point ; Kegan, The sprints •have drawn many Jonathan. \"The Contrast\" is a com- o'clock on the date named above. omitted because of lack of time. The<br />\nlistening in, the fact that the finan- first defense; Nickels, second de- candidates as usual. Lockard is the edy of social manners interlarding Thursday has been thought the ideal selections by the quartet composed<br />\nces of the kingdom are in .a disas- fense; Houston, third defense; only H man in 'these events who a complicated plot, humorous char- day, as it allows the committee four of: Sharetts, first tenor; Besore<br />\ntrous state is brought to the fore, Browntey, goal. Alternating for ran last year, and Ness the only acterization, and dialogue typical of school days to sell tickets, and does second tenor; McDorman, first<br />\nand as a consequence the Princess these men have been: Tobin and aHa holder. Among the newcomers the time in which it was written. not interfere with week-end activ- bass; and Gordon, second bass, were<br />\nvery well received by the audience,<br />\nmust Marry. Prince Vladimir Hal- Keyes, in defense, and Knell) and<br />\nities.<br />\nMorrison of -Forest Park looks The play is being given on the<br />\nas was the Banjo Club, who howberstadt. The Prince (Milton Rob- John Lyons, in attack.<br />\nto<br />\ntrying<br />\n12,<br />\nApril<br />\n11,<br />\nof<br />\n15.<br />\n10,<br />\nand<br />\nevenings<br />\nnot<br />\nis<br />\ncommittee<br />\nThe<br />\n,howing<br />\npromising. A creditable<br />\never, have come to take such things<br />\ninson, 6 ft. 3) and the equerry to<br />\nSpectators Come<br />\nThe Playshop has been very fortu- make money, or even break even on as a matter of course. The Glee<br />\nshould be made by this group.<br />\nPrince (Roswell Jones, 5 ft. flat),<br />\nthat<br />\nthought<br />\nwas<br />\nIt<br />\nbanquet.<br />\nthe<br />\ndefense<br />\nstring<br />\nsecond<br />\nthe services of N.<br />\nClub Hawaiian Troupe, and Barienter with much gusto. The act On the<br />\nKelly, and many nate in securing<br />\nthe class treasury should bear a<br />\nbeen showing Captain Schiebel,<br />\nBryllion Fagin, who is coaching the<br />\ntone Solo all came in for their<br />\ncloses as Hawthorne is brought to Ness and Cone have<br />\nwill<br />\nmen<br />\ndistance<br />\nexperienced<br />\nother<br />\nthat<br />\nso<br />\nexpense,<br />\nthe<br />\nof<br />\npart<br />\ngood<br />\nthe attack •.Dukehart<br />\nrealize that the Princess must do up well. Oil<br />\nMr. Fagin is very well known the members of the class could get share of the applause.<br />\nplay.<br />\nmile.<br />\ntwo<br />\nand<br />\nmile<br />\nand the two Sharretts have been take care of the<br />\nher duty to her country.<br />\nin literary circles as a playwright, some direct return on their dues. Immediately following the condoing well. Frisch has been play- In the high ijump there is Caldwell<br />\ncert a dance was held in the main<br />\nFree-for-All<br />\ning a nice game. Ferrarini has been who was high school champion of critic, poet, author, and lecturer. He A large turnout is desired for, it is ballroom. The sixty-odd girls in<br />\nThe second act opens with a rehoped, the best Junior banquet in<br />\nJohns<br />\nthe<br />\nat<br />\nEnglish<br />\nof<br />\ninstructor<br />\nis<br />\nlooking very good at goal.<br />\nthe Glee Club again came in de\\Vest Virginia. In the pole vault<br />\nporter from the Borrovinian ScimiHopkins University and head of the recent years.<br />\nmand when tbg_ban of conventional<br />\ntar. playeatrby William McDcpelt, Cokch,Van Orman's plan of play- there is Quirk who has been with<br />\npromcertain<br />\ncustom,<br />\nAs is the<br />\ncutting in was lifted.<br />\nand the proprietOr of the Casino, ing the first string attack against the team several years. Neu, an- English Department at the UniverEditor<br />\ninent seniors, namely: The<br />\nthe<br />\nThe program of the concert, was<br />\nportrayed by Herring, in the midst the first string .defense has had<br />\nother veteran, will be in the broad sity of Baltimore.<br />\nManager of the Hul- as follows:<br />\nof a discussion in Which the former effect of attracting many spectators jump. In the discus and shot put, The retention of Mr. Fagin's ser- and Business<br />\nlabaloo, and others, will be invited J. H. U. GLEE CLUB<br />\non Unidiscloses to the latter the identity of who daily park their cars<br />\nplay Dorman, a freshman from Friends, vices is very timely, since the Play- to speak. As yet a toastmaster has University Ode ,<br />\nHawthorne. The proprietor imme- versity Parkway to watch the<br />\nshop group has suffered a suspen- not been chosen.<br />\nDeep,River ....Old Negro Melody<br />\ndiately proceeds to make out a new and see what sort of team is in pros- has shown much promise. On the<br />\nbill for the hero, as the latter comes pect at the traditional home of la- whole the events mentioned above sion of activities during the year The committee in charge consists Old Man Noah ''Bartholomew<br />\non the scene, prepared to leave. crosse. They seem to be repaid. should provide the coaching staff following Dr. Uhler's departure of Bob McAll, chairman; Cordish, BANJO CLUB<br />\nWashington Post Mardi....Sousa<br />\nfrom the University. The players Nickel, F,heidt, and Follmer.<br />\nHowever he learns of the revolution<br />\nThe freshman team, which is be- with but little worry.<br />\nG. W. U. GLEE CLUB<br />\nand decides to stay. Upon being ing organized has some right good<br />\nin<br />\nactive<br />\nvery<br />\nbeen<br />\nThe weak spots of the team are in have formerly<br />\nGodttrd<br />\nLullaby from Jocelyn<br />\ncaught spying On Prince Vladimir players who are too light and inex\"and the javelin the production of meritorious dra- A. 7'. and 'T. Interviews<br />\nGrieg<br />\nElfin Dance<br />\nand the other conspirators, he is perienced to work out with the reg- the middle distances<br />\nimporan<br />\nfilled<br />\nand<br />\nofferings,<br />\nmatic<br />\nMassenet<br />\nElegy<br />\nbrought before that gentleman. A ulars. Eagan, of City College; throw. Here the lack of experienced<br />\nPositions<br />\nfor<br />\nSeniors<br />\nStrickland<br />\nMah Lindy Lou<br />\ntant place in the participant's culfree-for-all fight results and the act Sykes, of Forest Park High; Levy, material is apparent..<br />\nRepresentatives of the American<br />\nBARITONE SOLO<br />\nends with thg Royal Guard chasing of Friends; Tippett, of Marstons, Yellot, who with Wheeler, rep- tural development.<br />\nTelephone and Telegraph Company<br />\nMR. LOUIS LLEWELYN<br />\nHawthorne and Blake out the win- and one or two others look good resented the half-mile run last year, The cast consists of Roberta Mal- have just finished a session lasting<br />\nHuhn<br />\nInvictus<br />\ndow.<br />\ninterweek,<br />\nlast<br />\nof<br />\npart<br />\nbetter<br />\nthe<br />\nfor next year's team.<br />\nVannott<br />\nS.<br />\nSnyder,<br />\nHoward<br />\nis the only veteran back for this de- timbre,<br />\nAccompanist<br />\nKingdom Saved<br />\nUniversity<br />\nthe<br />\nof<br />\nseniors<br />\nviewing<br />\nweather<br />\nbad<br />\nworkouts in the<br />\nM. SAMUEL SNYDER<br />\npartment this year. The hurdles Chapman, Robert Warfield,'Harry<br />\nHawthorne proceeds to save the The<br />\nin regard to positions upon their<br />\nby the fact that on April<br />\nPE<br />\nare to be well taken care Bilcovitch, Alton R. Hodgkins, and graduation. After a careful sifting HAWAIIAN<br />\nyear<br />\nkingdom in the third act when he are caused<br />\nthis<br />\ngape.<br />\nplay their first<br />\nHerbert<br />\nGypsy Love Song<br />\npays off the army and convinces the 6, the Jays<br />\nof, Hershey and Scheidt, who ran Richard C. Breed. William Banks process certain men were extended<br />\nKohola March<br />\ntakcitizens they should start business The complete schedule is:<br />\nare<br />\nChapman<br />\nVannort<br />\nS.<br />\nand<br />\nfor<br />\nreporting<br />\noffers.<br />\nthe hurdles last year,<br />\narranged by C. Gebelein<br />\nexpansion by utilizing the great Olympic A. C. at home, April 6.<br />\ning care of the scenery for the play, One thing of particiPar interest<br />\nthis season.<br />\nPIANO SOLO MISS HARRIET NASH<br />\nsprings and making a health resort U. of Pennsylvania at home.<br />\nis handh g the to Hopkins men was the fact that<br />\nScott<br />\nDance Legre<br />\nDue to the rainy weather practice while Miss Legum<br />\n.<br />\nof' the kingdom. The fourth act April 13.<br />\nproperties.<br />\nthe representatives, impressed by, Dance Rituelle de Feu<br />\n'Cyril<br />\n20.<br />\nthe<br />\ninfield,<br />\nApril<br />\nthe<br />\nto<br />\nconfined<br />\nPoint,<br />\nbeen<br />\nhas<br />\ntakes place a year later when all the<br />\nWest<br />\nat<br />\nArmy<br />\nManuel de Palla<br />\nplanp have been realized and the • Randolph-Macon at home, April cinder path not having been rolled. Tickets may be secured.from Dr. the high undergraduate standard of<br />\nthe various schools, offered more QUARTET<br />\nplay ends happily with Blake en- 27.<br />\nThe pits also need to be repaired. French, from members of the cast, positions than they did to any other<br />\nSelectiOng....arranged by Fishburn<br />\nWed to the Senator's daughter, the Swarthmore at home, May 4.<br />\nThis must be done very soon since or at office of the College for Teach- college. This is particularly gratiDear Old Johnny Hopkins<br />\nkingdom changed to a republic, and<br />\nRutgers at tiome, May 11.<br />\nwill<br />\nadmission<br />\nof<br />\nprice<br />\nThe<br />\ners.<br />\nfying news at a time when the unthe first track meet of the season is<br />\narranged by Steinwald<br />\nthe princess and Hawthorne in the<br />\nSt. John's at Stadium, Itiay•18. on April 6 with University of Dela- be $1.00 for the performance of the dergraduate situation is coming un- BANJO CLUB<br />\nfinal clutch.<br />\nMay<br />\nStadium,<br />\nat<br />\nMaryland<br />\nof<br />\nU.<br />\nder so much fire.<br />\nContinued on Page 4, C01. 4<br />\nplay and the lecture.<br />\nware at Newark.<br />\nCaplan, Gordon, Farinholdt, Roth- 25.<br />\nr<br />\nContinued on Page 2, Col.'1<br /><br />\nLACROSSE PRACTICE GOES<br />\nON DESPITE MUDDY FIELD<br /><br />\n•3 140nage Y‘TV*3-1.ErrEit. NIARCH 19. 1929<br />\nTHE 101-E<br /><br />\n2<br /><br />\n1111X1113HOME MS:Lima<br /><br />\n,<br />\ntt.<br /><br />\n_<br /><br />\nIL _1_<br /><br />\nifacianturnar rif<br /><br />\n1.16:2010 Li4V:<br /><br />\n.\"<br />\n--s<br /><br />\nIldwesigibm<br />\n• ter_<br /><br />\n1.1.en-i&amp;m<br /><br />\nAs*<br /><br />\n1Mmorente.zj<br /><br />\nBilltirees. Mt_ smaer so7<br /><br />\n-_.te<br /><br />\n-'<br /><br />\n-<br /><br />\n\"ft,<br /><br />\n'V :It,7_7 1.7- --•.e<br /><br />\nTILL7 I<br /><br />\nseim-wmm.7 Lova<br /><br />\n:7<br /><br />\n•<br />\nserv:,<br />\n7:7,cari tSt. s.sorvl a:- : 'nigher<br />\n-raining h:77<br />\n-_f the<br />\n-u.se hisknowedge t.,ther<br />\n'At =a live a fier lift. .;<br /><br />\nIn. 7,7t7<br />\nilk/fhalia rst-ser-inty<br /><br />\nltinessw Weer eseseauthimminto<br /><br />\nMineriarg<br />\nPLEA? W _ Nix&amp;<br /><br />\n:flak<br /><br />\n• *tr-<br /><br />\ntt.<br /><br />\nragtt:it t4.1<br />\ntar :I:zit-ma-24 -Ear<br /><br />\n911r101111AL DISPILETISIENT.<br />\nEditorr<br />\ncam=<br />\nA fro-4.4.:<br /><br />\ntttrt-r.....C.11=11.<br /><br />\nt :_<br /><br />\niS:_ VC4..<br /><br />\n:ops<br /><br />\n_<br /><br />\n.<br /><br />\nhuman a- •<br />\nexerc:the<br />\nits<br /><br />\n,74.l<br /><br />\nTt<br /><br />\n—_e<br /><br />\n17'7<br /><br />\nL±'37-t<br /><br />\nti7<br /><br />\n-<br /><br />\n-<br /><br />\nif<br /><br />\nt4t.<br />\n-- s • •<br /><br />\nLwow E. Itans.<br /><br />\n.:71--77..1 •<br /><br />\nf<br /><br />\nf<br /><br />\ndear,- of you-.<br /><br />\nAn'<br /><br />\n44<br /><br />\n1/0<br /><br />\nExtra Hich Grade<br /><br />\nSmoking Toha,<br />\n_..co<br />\nsaa.a.m.ii.R.O.sumatana<br /><br />\n1 az... 17,..<br /><br />\n,tp.itzrafI<br /><br />\nFor the days are keg. of<br />\nAn' tae ngrts arelor_ger sta,<br />\nAn'sometimes,'always smolrir.')<br />\nI pine up qtis old T'—<br />\nAn' try to .rste WM* pee.-.7.<br />\nTo tea you fi ray kree...<br />\nAs poetry it aih't men good,<br />\nan.— nay days shove—<br />\nIt's jest the best I ear., an'so<br />\n'foul: find ree. whim. I'm through,<br />\ndmit a-tUttin', stoserir.' Edgeworth,<br /><br />\n\"\" •<br /><br />\n,<br />\n4+<br />\nL<br />\n•n,<br />\nLeamet A.<br />\nPug IF<br />\nCow.<br />\nilizioes.<br />\niliellist<br />\nmaw Won't<br />\nMINXG.<br />\nYr N',Als<br /><br />\njam<br />\npecerriber<br />\neaburg.2,N192<br />\nj7\"<br />\n=oaf Edgeworth<br />\nAn' a-tLir-cin', 7:ear of<br />\nAn' a modle's humin' br*tly,<br />\nAn'. it says yoga- iove n true.<br /><br />\nEdffeworth<br /><br />\nA ca7,,,s,<br /><br />\nWZALAX LDiwnin.<br /><br />\nSmoker U\"<br />\nAwaiting<br />\nLoved One<br /><br />\nt t<br /><br />\n+.cr<br /><br />\ncommasucaz-.A.4,<br /><br />\n•<br />\neay ccernnercialtzed arid<br />\nant a<br />\nspecialized .as graditate,<br />\nin a 77 7_ 1 7. -f tt•<br /><br />\ni•77,17.e.<br /><br />\nLtIZ<br /><br />\nirs<br /><br />\nrirlIrlINWIlr11.41911911rowl<br /><br />\nCollege and Culture<br />\n5.17-1:711=-11<br /><br />\nDirseartzt.<br />\nNitta= It R.L..^<br />\n.747 onacag<br /><br />\nE<br /><br />\n- -72<br /><br />\nINL.St4s.E.W DEP<br />\nler<br /><br />\nmop,; 1.:socri7 11.41m-e.<br /><br />\niforoe,<br />\nGoma M. Guam: \"<br />\n(*or Shof<br />\n,<br />\nroute:Is.<br />\nL_<br />\n1101.0.10t<br />\nIsmissim.<br />\n.A.Aus<br />\nZak 7. Guiber. -at<br /><br />\nA a...7,777.ml<br /><br />\nBOSTONIAN<br /><br />\nrri<br />\n'3•112,<br /><br />\n-<br /><br />\nSHOES<br /><br />\nft:terser<br />\nPrIrmi. 71:<br /><br />\nnoisy V. awswerx<br /><br />\nwill be<br /><br />\nPrembeesi by ?be Lead-ray.47..<br /><br />\n1(<br /><br />\nDispla)ed<br /><br />\n'STORMER PLAY<br /><br />\nEDITORIAL COMMENT<br /><br />\naL<br /><br />\nTHE BARN<br /><br />\nan;<br /><br />\nWednesda, March 20<br /><br />\nHe z<br />\nHs ',tat<br />\n\"\"‘;<br /><br />\n11A. M. to 2 P. M.<br /><br />\n• ence.<br /><br />\n.WL\\DELL<br />\nPOPS f.4.<br /><br />\n7<br /><br />\naz-s<br />\n-<br /><br />\nt..\",7,4^7.1 et -.Int:.<br /><br />\nI=Len<br />\nt72 ts7110=3 Tin%<br /><br />\n•<br />\n,<br />\nthe re<br />\nr-axe-77<br />\n*se =_CZte<br />\na Uezvr?osiesses<br />\ndeft the ji-itr.4<br />\nne..atrCt<br />\nAlesi Marin nee= 're ;Frond<br />\n1C:t.<br /><br />\ntr.le<br /><br />\n7_<br /><br />\nla=<br />\n:t -7 -<br /><br />\nElienr.a.Ut=e4<br />\n7 7;<br />\n.<br />\nJ,7;<br />\n,1<br />\n2<br />\n!5/7.,C7<br />\nre..3Cri be= .<br /><br />\n'tntyins<br />\n`.mth's<br />\nfenthcoa;<br /><br />\n.7--<br /><br />\n1...7<br />\n••••<br /><br />\n7.14.5r tf<br /><br />\n-<br /><br />\n•<br />\ntok .ndic<br />\n.<br />\na<br />\n'nom<br />\nma cep, m•zit ginctFe„<br />\nact.=<br /><br />\n0==Fr<br /><br />\n7<br /><br />\nAwiraareinew most be<br />\nbestioathe' dx. Of<br />\nne= frit ,•77 star,. To rale<br />\ntX<br />\nI<br /><br />\n_<br />\nN<br /><br />\nPcç<br />\nan&amp;sermes hoe X7-7:<br />\nTram.la..<br />\nset before thm„, ran the- ,Liriread hand<br />\n'teen<br />\nsutew,<br />\n.fil..7.weri<br /><br />\nRe<br />\nmad<br />\n:And (Sit-to aid*<br />\n-<br /><br />\nE ST A ITkLiS94EDEN GUS<br />\nNR S I TY<br />\nSTYLES,--q1a0Rtia.„<br />\nr5UTHFUL<br />\nCHARTS SCIIELTF.A.DIS<br />\nGUISHED<br />\nSERVICE 1-A Tili --3/1*43% STATES.<br /><br />\n,<br />\n3<br /><br />\nNgt.• EVERY MAN<br />\nHE veM E.7711. Rhys_<br />\n. I;..-r-.=:_nerir. Bri zere.Ltaii<br />\nMOST: :ftterr.r...:::.;<br /><br />\nT<br /><br />\n01.1Se<br /><br />\n-<br /><br />\nMr flys<br />\nquaircar,x of razinentos wrizers.„ fatuous ut •.:rporriry<br />\nveterans as George Bernard<br />\nhying<br />\nand art. Hebei thawed wait sloth<br />\nthe deal Thomas<br />\nShaw,Ii G. Wens and Amid Bennett, zni<br />\nRcéruLord<br />\nHardy, Sir E&amp;c.rid G71915e, Waz W1titt1=71., '59k7thbt.,Une,<br />\nlie<br />\nbighorns).70x74:- Oirrad and 1.1=xe's intro: M.Venturi_ ci<br />\n*Coma=<br />\na<br />\nat<br />\nBrown:mg,<br />\nal cid ernot4lnto rementher Rohm<br />\nMxss:i-.4 at one<br />\nSnelky's Cosa and young enough to have<br />\nD'Arintunan's Nave M FL:me. He has sat I: - se sae ce Vir_ B.<br />\n.<br />\nd knot in and b'e<br />\nYeats in the Abbey Theatre, Dublin, and<br />\nRirys<br />\nwith Rodin in his Paris studaa These „mown have cyan<br />\na rith badtpotisml of sL7-vies and.' stirring<br />\nStalorIn his talk on Thuireday. -George Bernard %saw versus<br />\nspews,- .the Wiring leznae, 7-reamed skilful* painted<br />\nfa=s_,<br />\n, ci<br />\ninto the thars:-e<br />\nand gave intilaate<br />\ntcreri....<br />\n=satirist_ He tad of Seara's sm000veiscaccal pub at the<br />\nthe 'heels of ,the<br />\n.01 Thomas Hardy; Shaw, the ra.4,--21 ---eadinir on<br />\nway<br />\nes<br />\nwended<br />\ntionege<br />\nalosersatroe Rudvard raphag, as the firseral<br />\nSlaw,•&amp;sgoi.sed<br />\ndwough the son:rre sisadows of W---ommmer Mary;<br />\neaas<br />\nas-Prospero, at the book-seller's shop a: Stratford-on-Ason In<br />\nlie ft.111.*7.<br />\nof *these nutoresteig .imems, Mr_ RLT, ae.thed<br />\nthe faithfulness and accuracy of a &amp;owe&amp;<br />\nof Sear:nig a ihrLarm:<br />\nThose who had aloe with the<br />\n-Awon.<br />\nis:n:4,427.5m of th, fax George Barnard and the Bard of<br />\nare:Amu and<br />\nWere pleasantly - 45sed to bear a saws of anmasiang<br />\n,<br />\nHMV'<br />\newer<br />\naz...ICUs:sof the<br />\n.T.:<br />\na fast band az,77:,<br /><br />\nSO,<br />\n44<br /><br />\n,<br />\nSCir 14<br />\n.4,S<br />\n04<br /><br />\nEIW SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n; sweet<br /><br />\n=.a.at<br /><br />\n-0<br /><br />\n.2.t.tL•<br /><br />\n:7s<br />\n,am- wh:<br />\n::: f. 7<br />\nOnce in ; _I '.rhy*.....s. .-.zazat -_:: 7.7.- __-. --a: -__a_ge• How aS<br />\nf Fre.l.,t.e H----..-- ', - -, 1.:...ed the ean<br />\nspec:etre w\"-±..::: awl:. tan : 174 in-<br /><br />\ns<br />\n_<br /><br />\ng7ta:<br />\na.-7.<br />\n.Sr<br /><br />\n7<br /><br />\n•<br /><br />\nUAILTIMCCE<br /><br />\nr'rierr,<br />\ntt.t.<br /><br />\n11)<br />\no<br />\nflharter<br />\nCU<br /><br />\n7<br /><br />\n7. - •<br />\nAnc,citer goy.:1. show. We re -......7 - .<br />\nthe<br />\nDoug Fairbanks, the original<br />\niivailahle in a Hawasccar, could have beer_ pvc.- itastie of fields.<br />\nerg, he ir-xild have stood on his or- borders dot<br />\non the mere:y<br />\ntheia chair and rt.n.re.-1 lris un- techr.a<br />\nby<br />\n*Mk<br />\nschool.,<br />\nqualed apptrova/..<br />\nturn oat phike•<br />\nciphers as ccr—'77=all'y =.,,•-!evelope<br />\nG E. B. ja.<br />\nll<br /><br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\n1liellub<br />\nNa.<br /><br />\n41••<br /><br />\nado-1 ra,, sate<br />\nbow316.•.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 19, 1929<br /><br />\nmoo.<br /><br />\nWHY NOT<br /><br />\nThe Communion of Great Minds<br />\nBy M. J. SCHMULOVITZ<br /><br />\nArthur Hobson Quinn to<br />\nLecture Here April 5<br /><br />\nArthur Hobson Quinn, from the<br />\nIn the NEWS-LETTER of February tor of the Blade... who urged him University of Pennsylvania, will de12 there appeared an article Dreiser to attempt a ncrbel. .. . One day in<br />\nliver a lecture on Friday evening,<br />\nby \"Ben.\" As you know, I had September, 1899, Dreiser took a<br />\nin the<br />\nscolded \"Ben\" for some of his sheet of yellow paper and wrote a April 5, -1929, at 8 o'Clock,<br />\neMANNIE GBERG childish<br />\nreasoning in a previous let- title at random. That title was \"Sis- assembly roam of the C. E. Hall.<br />\n\"The Old Boy Himself\"<br />\nter, but this study of Dreiser re- ter Carrie,\" and zvith no more defi- The topic of Professor Quinn's lecdeemed him. \"Ben\" went up in my nite plan than the mere name offered ture will be \"The Beginnings of<br />\nNORTH fi MARYLAND AVES.<br />\nestimation considerably, for .1 dis- the book began. . . . [In] England American Drama.\"<br />\ncovered that he was a veritable \"Sister Carrie\" is regarded (accordIt is due to the efforts of Mr.<br />\nRich fabrics and pleasing patterns in Spring<br />\ngenius. The discovery was quite ing to Harper's), as \"the best story,<br />\nFagin,<br />\nwho has charge of the<br />\ncome<br />\nout<br />\nyet<br />\nhas<br />\nthat<br />\nwhole,<br />\nthe<br />\nSuits and Topcoats that faithfully reflect<br />\nBOOKS<br />\nsimple. I recalled having read an on<br />\nof America.\" A curiou.c series of Homewood Playshop proditction of<br />\nthe latest decrees of fashion<br />\nessay on Dreiser by MenCken in his<br />\nBought—Sold—Exchanged<br />\nthe current year, that 'Professor<br />\nepisodes .. . Jennie Gerhardt,<br />\nPrefaces,<br />\nand<br />\nupon<br />\ncomparing<br />\nSTORE<br />\nBOOK<br />\nPIPPEN'S<br />\n1911 .. . A Traveller at Forty ... Quinn will be brought here. Cost<br />\nREADY-To-WEAR<br />\n\"Ben's\" work with it, I found that 1913 ... The Financier, 1914 .. .<br />\n605 N. EUTAW STREET<br />\nof admission will be 50 cents.<br />\n\"Ben\" not only had the same ideas, The Titan . 1914 . The Genius<br />\ntheme, manner of devlopment, etc., ... 1915 .. A Hbosier Holiday.. ..<br />\nshort sto- people are both evil and well intenas Mencken but even used the same 1916 .. a dozen or more<br />\ndg8:WRNM<br />\nrks....<br />\ntioned.\"<br />\nwords.<br />\nCOMPLETE<br />\nAnd then comes \"Ben's\"1 fourth<br />\nAnd yet people say that the genius<br />\nCan the reader realize the full sigparagraph, a monument to the unity of Hopkins is in the Medical School,<br />\nnificance<br />\nof<br />\nsuch<br />\na<br />\nfact! Here we<br />\nkt.<br />\nof great intellects:<br />\nand not at Homewood!<br />\n•<br />\nhave a mere college student who,<br />\nDreiser's income from Sister CarI can see that some people will<br />\nFive East Lexington Street<br />\nin writing about the life and works<br />\nrather negligihle, and so deny the wisdom and geniusl<br />\n'of<br />\nwas<br />\nrie<br />\nof greiser, thinks in exactly the<br />\nin 1905 he took a position on the Mencken, but even for them this<br />\nllE<br />\nCre<br />\nsame channels and even 'the same<br />\nstaff of Street &amp; Smith, the famous document must remain an epoch<br />\nwords as a man of ififty years who<br />\nMOMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n\"Dime Ii-over'producers. . . . His making research into the philosophy<br />\nhas spent most of his life in the<br />\nJ. A. RITTER &amp; SON<br />\nword nov- and psychology of the metaphysical<br />\n60,000<br />\nreduce<br />\nto<br />\nwas<br />\njob<br />\nCo.<br />\nstudy of literature! Think' how i12<br />\nFlorists and Decorators<br />\neli to a length of 30,000 words.. .. communion and harmony of grea_t<br />\nlumina.ting and delightful a revelaBALTIMORE, MD.<br />\n1918 N. CHARLES ST., Near 20TH.<br />\nHis method in brief was this: The minds.<br />\nPhone, VErnon.0573<br />\ntion it would be to Mr. Mencken<br />\nCALVERT<br />\nnovel was cut exactly in half by<br />\n18CO• 1801<br />\nto meet his exact prototype; maybe<br />\nHome—HO. 20914<br />\nCAI. 1380<br />\n1802.1803<br />\nmeans of a pair of scissors; a new Phone,<br />\n1804 - 1805<br />\nFRANCES T. BRANNON<br />\nhe<br />\nwouldn't<br />\nquickly<br />\napologize<br />\nfor<br />\nP5X<br />\nending was written for the first half Successor to HARBAUGH El BANNON<br />\nthe bitter scorn and mockery he has<br />\n......<br />\nST., Cor. Charles<br />\nand a new beginning for the second! 2 E. LEXINGTON<br />\n(Room 28)<br />\npoured fordi upon college sophisti•SERVICE.<br />\nTo the Johns Hopkins students we extend a cor... Subsequently, he was associated<br />\nStenographic Dictation, Copying,<br />\ncates.<br />\ndial invitation to come' in and see our beautiful<br />\nMultigraphing, Mimeographing<br />\nwith the Broadway Magazine, The Baltimore<br />\nMaryland<br />\nBut I shall no longer detain from<br />\nhand-wrought Jewelry, our importtions of ancient<br />\nProducers of \"The News-Letter\"<br />\nDelineator, and the Bohemian Magand modern gifts. Prices very mode ate.<br />\nmy reader (who must certainly<br />\nCO.<br />\nMYERS<br />\nE.<br />\nCHARLES<br />\nTHE<br />\ndeto<br />\ndecided<br />\nhe<br />\nfinally<br />\nuntil<br />\nazine,<br />\nnow be teeming with anxiety) these<br />\nIncorporated<br />\nTEACHERS WANTED<br />\nvote his entire time to writing.<br />\nManufacturer of<br />\nMen and women who- are plannitig<br />\nof<br />\nexamples<br />\nharmony<br />\nof<br />\nremarkable<br />\nto teach In secondary schools or<br />\nGRUBBER STAMPS<br />\nCompare with Mencken: In 1905,<br />\ncolleges should 'write or call. We<br />\nthe sold.<br />\n109 W. SARATOGA ST.<br />\nhave placed many Hopkins graduThe Service Shop<br />\nuncertainties of this<br />\nates.<br />\n\"Ben's\" first sentence: ... Theo- tiring of the<br />\n319 W. Redwood St<br />\nTHE BALTIMORE TEACHERS'<br />\na post.on the staff<br />\nAGENCY<br />\naccepted<br />\nhe<br />\nlife,<br />\ndore 1 Dreiser remains perhaps the<br />\n402-3 Tltle Annex Bldg.<br />\n'Stout &amp; Smith the millionaire<br />\nmost enigmitical man of- American of<br />\npublishers of ... dime novels. . . .<br />\nLetters.<br />\nOne of his jobs, for example, was to<br />\nMencken's first sentence: . . .<br />\nj...i.f.ALKSzBiDikt<br />\nreduce a whole series of dime-novDreiser stands up s phenomenon .<br />\n13f<br />\nels, leach 60,000 words in length, to<br />\ndisconcertingly hard to explain.<br />\nEstablished 1832<br />\n\"Ben's\" second sentence: He has 30,000 words apiece. He accomPHILADELPHIA<br />\nbeen misunderstood continually. .<br />\nplished this by cutting each into<br />\nOfficial'Makers of the Standard<br />\nMencken's second sentence: . . . halves, and writing a new ending for<br />\nhow has he held out against ... dis- the firstlialf and a new beginning<br />\nheartening misunderstanding...<br />\nfor the second, with new titles Tor<br />\n\"Ben's\" third sentence: Dreiser, both . .. in 1906 he became managhowever, continues to plod along.. .<br />\ning editor of the Broadway MagaMencken's fifth sentence: He still<br />\nzine . . . chief editor of The Delinplods along.<br />\neator . . . and the Bohemian MagaJohns Hopkins Ring- ,<br />\nTo a student of psychOlOgS, it will<br />\nzine. . . . Its publicatir [Jennie<br />\nPrices Upon Request<br />\nbe very interesting to notice how<br />\n... during tht same year<br />\nOrders accepted at the<br />\nMencken in his Chapter 2, and Ben Gerhardt]<br />\nPost Office in the College<br />\nhis final emancipation from<br />\nin his paragraph 2, heartily agree worked<br />\ndesk.<br />\nupon Dreiser's detailed, lumbering the editorial<br />\nstyle. Here 'is one example:\"Ben\": The last paragraph in \"Ben's\" arHe is obsessed with the desire to ticle is still more wonderful and as\"tell it all\" ... Mencken : . Drci- tonishing than the others. Such hoser [has] an unshakable determina- mogeniety of spirit as this almost<br />\ntion to tell it all. Ben doesn't say verbatim paragraph shows, can be<br />\nexplained only by the esoteric and<br />\nfrom whom he got \"tell it all.\"<br />\noccult sqiences. These are \"Ben's\"<br />\nAnd for the gem of telepathic gewords:<br />\nnius one has but to compare \"Ben's\"<br />\nDreiser's work is extremely unMencken's<br />\nthird paragraph with<br />\nfourth chapter. Here is \"Ben's\": even, and there is an infinite distance between his best and his<br />\nSister Carrie is perhaps the best<br />\nworst. It is almost impossible to<br />\nexample of Dreiser en Pantoufles.<br />\nhow a man capable of Jenexpldin<br />\nstarted<br />\nIt was his first book and was<br />\nnie Gerhardt could produce anyonly because of the pleadings of a<br />\nthing as dull and stodgy as The<br />\nfriend, Arthur Henry, who waS. Vat Tommy is furious—<br />\nBlade. Genius. . ..<br />\nThe<br />\nof<br />\neditor<br />\ntime<br />\nthat<br />\nadmits it -- and all<br />\nAnd Mencken's: The work of<br />\nplies a man's high qualities in useful<br />\nDreiser, we are told, picked up a<br />\n'cause he didn't know<br />\nwrote the title, Dreiser. is extremely uneven, and<br />\nand<br />\nnels.<br />\npaper<br />\nchan<br />\nof<br />\npiece<br />\nBraeburns<br />\nabout<br />\nIt opens to all men a field as wide<br />\n\"Sister Carrie,\" at random. With the distance separatin4 his best from<br />\nwhen he bought a<br />\nis almost infinite. It is<br />\nas all human endeavor.<br />\nno more definite plan than this his his worst<br />\nspring suit.. He'll<br />\ndifficult to believe that the novelist<br />\nBecause<br />\nway.<br />\nits<br />\nOne may qualify himself along<br />\non<br />\nwas<br />\nnovel<br />\nfirst<br />\nhave to buy one now<br />\n... Jennie Gerhardt . ..<br />\npurely engineering lines. Another may<br />\nof this it is all the more interesting who wrote<br />\n•<br />\njust for his peace of<br />\nis the same who achieved . . . the<br />\ncontribute his powers of commercial<br />\nto note that Sister Carrie is remind.<br />\nstodginess of<br />\nreasoning. Another his ability to anaE lost that particular race. And<br />\ngarded in England as \"the best general stupidity and<br />\nso, honest effo5t and tense con- lyze management problems.<br />\nstory, on the whole, that has yet The Genius.<br />\nSURING<br />\nThese three totally different qualifiAnd now, dear reader, ponder<br />\nIIIMACIPULNS<br />\ncentration got him nothing. But in<br />\nqn.me out of America.\" After this<br />\nwith two trousers<br />\ncations just begin to define the<br />\nindustry this fine spikit would<br />\ncaale Jennie Gerhardt, The Finan- upon this fact of superhuman acpossibilities in one industry<br />\nnot be thrown away.<br />\ncier, A Traveler at Forty, The Ti- cord: Mencken and \"Ben\" both<br />\n$35<br />\nthe telephone making<br />\nalone—<br />\nby<br />\nstudies<br />\nHolipenetrating<br />\nHoosier<br />\nfairer<br />\nis<br />\ntheir<br />\nindustry<br />\nclose<br />\nrespect<br />\nthat<br />\nA.<br />\nIn<br />\nGenius,<br />\ntan, The<br />\n8 111<br />\nindustry.<br />\nand kinder than college. It ap8-IS<br />\nday, a small quantity of little-known quoting Dreiser's 'sentence: \"For<br />\nmyself,\" says Dreiser, \"I do tlat<br />\nwork, and An American Tragedy.<br />\nClothiers ass,! Haberdashers<br />\ntruth is, what beauty is,<br />\nMencken: It (Sister Carrie) is, know what<br />\nTHEI-IFVUEVEco.<br />\nwhat hope is. I do not<br />\nis,<br />\nlove<br />\nwhat<br />\nbook.<br />\nfirst<br />\namazing<br />\ntruly<br />\nindeed, a<br />\nbelieve anyone absolutely, and I do<br />\n. . . It was an old friend from To57 E. Baltimore St.<br />\n'INCE 1882 MANUFACTURERS FOR THE BELL SYSTEM<br />\nnot doubt anyone absolutely. I think<br />\nledo, Arthur Henry ... the city ediPut your- numerals on one of<br />\nthose Collegiate, black sweaters<br />\nfrom<br /><br />\nSpring Apparelfor University Men<br /><br />\n$45<br /><br />\nA<br /><br />\n4;<br />\n7<br /><br />\n0<br /><br />\nlos. *01055 &amp;<br /><br />\non<br /><br />\nV<br /><br />\nREAD.<br />\nTAYLOR<br /><br />\n°An Invitation<br /><br />\nCARL SCHON, INC.<br /><br />\n1LEY.B<br /><br />\n1<br /><br />\nMeet Tommy<br /><br />\ne lost;<br /><br />\nbut..<br /><br />\nH<br /><br />\nWestern Electric<br /><br />\nTHE Jcieei* Haruki<br /><br />\n4<br /><br />\nMAIM IS. MS<br /><br />\nNE-4VS.<br /><br />\n=<br /><br />\n1<br /><br />\n- - Nic-To'z - -<br /><br />\nThe 0. D. K. of<br />\nMotor Fuels<br />\n_-12.(oco-GAs<br /><br />\nYou do k,et Better Kodak Pictures<br />\nfrom<br /><br />\nbERP PHOTO SERM)<br /><br />\n_<br /><br />\n.F.•<br /><br />\nTre:<br /><br />\nEST. 1900<br />\nG.REEN.V.1.<br />\n•<br /><br />\n_<br />\nv-i:<br />\n::;i:<br /><br />\n- -<br /><br />\n1. Lill<br /><br />\ni1<br /><br />\n_<br /><br />\n111111<br />\nIII<br /><br />\nAmsma<br />\n47'<br />\nmr 1,0• 7 mg :<br /><br />\nH. FETTING<br />\nANCFA.Ci L.:PING JEWELRY CC<br /><br />\n:44;<br />\n,<br />\nrtz' 4441411<br /><br />\n-<br /><br />\nimirkfrvify- .\"'app!r (lab<br /><br />\nT.eiL<br /><br />\nMAW<br /><br />\n1-<br /><br />\nGreek<br />\n4zir<br /><br />\nL zencatrizr:<br />\n:Lee 'we:4r<br /><br />\nanz. -.71- 7<br /><br />\n.71 71<br /><br />\n••••= at=<br />\nie▪ r<br /><br />\n:?-eut<br /><br />\n7-4d VI441.-1<br /><br />\nNORTH CHARLES STRYST<br /><br />\n-7J<br /><br />\n'77<br /><br />\nT.(r.zr<br /><br />\n- i.<br />\n- rm.&amp; a<br />\n7*-rasteric:- zit riiw --fr-t7 2,'<br />\n• pat verzseL:\"<br />\n,-imonneenj 7.1,11.<br />\nV\".1<br />\nvr<br />\n-T-PM/14 44CtiI .?1,11147 -rev<br />\n=wiz 7_:ig<br />\n:mime<br />\n'<br />\n-`3<br />\n7-16, cfzir<br />\n•<br />\nV - v.<br />\nLea.<br />\naDr<br /><br />\nv•<br /><br />\n,orireteit \"noln<br />\nPIANO a-<br /><br />\n•<br /><br />\nvrek-x-<br /><br />\n;Ai,'<br /><br />\nziltaiflozz;e1'<br /><br />\nCab Co.<br /><br />\n•G<br /><br />\nINC<br />\nN. Cas5tree.:<br /><br />\nfi<br /><br />\nF-MILE<br />\n:A FIRST<br />\n10c each additional Half-Mile<br />\n-..Lr fraction thereof<br /><br />\n\"Lit'<br />\n• -- •<br /><br />\ne 71,41 appi,es for it<br /><br />\n:le<br /><br />\n=.<br />\nq)iiir=c)<br /><br />\nI.<br />\nt‘<br /><br />\n4<br /><br />\nCOMPASS!<br />\n-<br /><br />\nT-77-4=<br /><br />\nVf. Ptat<br /><br />\nf<br /><br />\nAt Yaw Service 24 Hours a Day<br /><br />\nti<br /><br />\n_<br />\n'-<br /><br />\nTOW<br /><br />\n-V<br /><br />\nNOrlOW'ra.r.<br /><br />\nPLMOiEr-7.1_<br />\nScreed Sztg:clies,<br /><br />\nLianceirat<br />\nMal<br /><br />\n-<br /><br />\n- -<br /><br />\nt1<br />\nsc<br />\nol<br />\nat<br />\nItt<br /><br />\n'<br /><br />\n•<br /><br />\n_<br /><br />\n_<br /><br />\n_<br /><br />\n•e<br /><br />\n(ROBIN.'<br /><br />\n-<br /><br />\na1=13.=pry<br />\nF7<br /><br />\n;otr<br /><br />\nCVO<br /><br />\n-7- :7<br />\n7-, ••<br /><br />\n15%<br /><br />\nIS AaCAL CU<br /><br />\nCRT<br /><br />\n-<br /><br />\n1-7<br /><br />\n•<br />\nS_<br /><br />\n•<br /><br />\nd St.<br /><br />\n1 \\H<br /><br />\n•<br /><br />\nn<br /><br />\nPOSTA F-1E-<br /><br />\nES.50<br /><br />\nY(<br />\nIt<br />\nti-<br /><br />\n;<br /><br />\n•\"5::<br /><br />\n•<br /><br />\nV.<br />\nat<br />\nta<br />\nhi<br />\nal<br />\nat<br /><br />\n-•<br /><br />\nst<br />\n-<br /><br />\nITQ<br /><br />\nP1<br /><br />\nSi<br />\nCC<br />\ntC<br />\n,in<br /><br />\n-• -<br /><br />\n-<br /><br />\nCC.<br /><br />\nFIDF-T ri. Y AND<br />\n34.<br />\n142,<br /><br />\nA<br /><br />\noli<br /><br />\nzsti<br /><br />\n2...lraf.0RE. BRANCH<br />\nMOGI\".<br /><br />\nIN iishioned<br />\nB 111<br />\ncwords,.<br />\ncdhive.or<br />\n.,v<br /><br />\n_<br /><br />\n_<br /><br />\nf.<br /><br />\nOFFICE<br /><br />\n1t.nm, M.asjFacr_e.<br />\n1<br /><br />\n▪<br /><br />\nITIV V<br /><br />\n7v-:<br /><br />\nr_-<br /><br />\n-±tl•<br /><br />\n-<br /><br />\n-101-D; C. KNff? &amp; :SONS<br /><br />\n▪<br /><br />\n;Atd di125<br />\n51171 -.4 '..V.t4..:ArifSikt<br /><br />\nc nett= r..k\"<br />\n,<br />\n'<br />\nCcit .47-=-<br /><br />\nTI<br />\n40:<br /><br />\nP'42oltz<br /><br />\nN•rir Ze-2rati; Sidory.<br />\nLacetros._<br />\n.w.4.1<br /><br />\nit.A••!.<br /><br />\nattietiie5<br /><br />\n=2-2tack a alp- The<br />\n1.= 2IZS<br /><br />\nSic.. Loewe<br />\n.1.4 Caor.:ei<br /><br />\nUAUTY SHOP<br /><br />\n11<br /><br />\nFmrs<br /><br />\n12.szt.:1<br /><br />\nFURNITURE<br /><br />\n+.4..t<br />\nrho Soroogor<br />\nCloacKwooki<br />\nmow<br /><br />\n.<br /><br />\n$t)it and<br />\nAnd .rtk:rtiLiebesi<br />\nNunri•lkush Cipj,lave die<br />\nankk---t1. umeightte mos% seet<br />\nAlvong a the hitt<br /><br />\n1 r_a<br />\n•<br /><br />\n-<br /><br />\n5ryt-, 77.<br /><br />\n;<br /><br />\nJ;<br /><br />\n* A<br /><br />\nnI<br /><br />\n14<br />\n2<br /><br />\nin<br />\nth<br />\nSr<br />\nht<br /><br />"}], "field_media_file": [{"target_id": 38396, "display": null, "description": null, "target_type": "file", "target_uuid": "a5407cd1-eb45-4e88-ba80-a41f79dc7037", "url": "http://digital.library.jhu.edu/system/files/2022-03/13365-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13365, "target_type": "node", "target_uuid": "5efb6118-ca4e-4157-8210-dc2052824121", "url": "/node/13365"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3ba531ed-080d-4f38-ade5-db1ba57e7d8a"}]}