{"mid": [{"value": 51432}], "uuid": [{"value": "a6cded97-5add-49af-9874-e9e439b3c949"}], "vid": [{"value": 51432}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-20T03:00:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16186-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-20T03:00:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-20T03:00:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "39 22730\"N<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nbl e i bt Sk RN b - _ , T —————<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nTable Rock and Davis Quadrangles, Geologic Map<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n39 200\"N<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n39 1730\"N<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n79 300\"W 79 2730\"W 79 250\"W 79 2230\"W<br />\n| e - - | - - 2<br />\ne -3 DESCRIPTION OF MAP UNITS<br />\nN<br />\ng -<br />\n= Alluvium Sand, silt, and gravel. Pale-gray to dark-gray, tan, Purslane Sandstone Sandstone. Red-brown to purple.<br />\nweathering orange to red-brown. N<br />\n§ . The Purslane Sandstone is represented in the map area by several<br />\n” Alluvium encompasses poorly sorted, sandy to gravelly tens of feet of fine- to medium-grained, hard quartzitic sandstone<br />\n5 unconsolidated sediments, generally with angular to subrounded and quartz-pebble conglomerate. The rock in the lower part of<br />\ng cobbles and boulders of locally derived rock. Although the formation is typically thin-bedded and flaggy in 1- to 2-inch<br />\n= dominantly quartzose, alluvial sand commonly contains beds, shows conspicuous low-angle cross-bedding, and upon<br />\n8« abundant rock fragments. weathering yields a characteristic talus of thin slabs. Although<br />\nthe Purslane may be as much as 250 feet thick, it probably<br />\nAlluvium underlies the channels and adjacent valley floors of all averages about 100 feet in thickness. It carries no determinate<br />\nof the major streams and many of the minor streams in the map fauna or flora, and is non-marine in origin.<br />\narea, but especially along the Potomac River.<br />\no Along most of the outcrop belt, the most conspicuous evidence<br />\nWS of its presence is a rubble or talus of reddish-purple sandstone<br />\nConemaugh Group Interbedded, greenish-gray and medium- . slabs distributed over the crests and back sides of knobs along<br />\ne gray shale, gray micaceous sandstone and siltstone; coal beds, 2 Backbone Mountain.<br />\nand locally reddish claystones with two thin fossiliferous shales g<br />\ng in the lower half of the group. @<br />\n-8 @ Rockwell Formation Sandstone, siltstone, shale, and minor<br />\nAlthough the Conemaugh Group in western Maryland is made = Mbr conglomerate. Greenish-gray, pale-green or gray, reddish-brown<br />\ng_ up of two formations, it is not differentiated herein. Only the to brownish-red.<br />\n5 lower half of the formation, which roughly coincides with the<br />\nGlenshaw Formation, is present in the Davis Quadrangle. A The Rockwell Formation comprises interbedded sandstone,<br />\ncouple of locally mined coal beds, like the Wellersburg [we] and siltstone, and shale. Most of the sandstones are soft, micaceous,<br />\nAmes [a] are present near the middle of the group, but only two commonly lignitic, lenticular and cross-bedded, and thin- to<br />\ncoal beds are consistently minable in the Davis Quadrangle. thick-bedded. The interbedded fine-grained rocks range from<br />\nThe lower coal is equivalent to the Lower Bakerstown [Ib] of evenly laminated to massive and hackly. Rockwell shales are<br />\nPennsylvania. The upper coal, the Barton [b], is termed the carbonaceous and pyritic in places. Some beds display burrows<br />\nElklick coal in adjacent West Virginia. Important sandstone or burrow-mottling, as well as Skolithus tubes.<br />\nintervals include the Mahoning above the Upper Freeport coal<br />\nat the base of the group, the Saltsburg Sandstone above the Several named members have been recognized within the<br />\nBakerstown coal bed, the Morgantown Sandstone above the Rockwell, especially in nearby areas of West Virginia and<br />\nBarton coal. The Conemaugh Group is 800 to 900 feet thick. Pennsylvania, but none of these has seen widespread use in<br />\nMaryland. The Oswayo Member is a latest Devonian marine<br />\ntongue and makes up the basal 40 to 50 feet of the formation. It<br />\ns Allegheny Formation Interbedded, medium- to dark-gray shale consists of pale PR grone, flaggy sandstone. Abm.xt 30 feet<br />\n: Pa and siltstone; tan to light-gray sandstone; and coal with a above this sandsto_ne is a thin bed of polymictic diamictite. The<br />\n- claystone interval near the base. Oswayo Member is succeeded by up to 180 feet of mostly gray-<br />\nZ green sandstone and reddish-brown to red, interbedded, mostly<br />\n§ Of the important coal beds within the Allegheny Formation only nonmarine siltstone and nonmarine shale. Overlying this non-<br />\n- a the Lower Kittanning [Ik] and Upper Freeport [uf] arc mapped marine interval is a dark-gray siltstone known as the Riddlesburg<br />\n= = here. The base of the formation is marked by the Lower Mount Shale. This manpe.sh.ale.ls correlative to the Sunbury Shale of<br />\n§ Savage claystone, which is present near the base of the Ohio, a basal Mississippian unit.<br />\nS formation. = An important marker sandstone unit is the i<br />\ng Westernport Sandstone near the middle of the formation. The In the_ Table Rock quadrangle, the .Rockwell Formation forms<br />\nP top of the formation is placed at the top of the Upper Freeport low hills at the base of Dans Mountain.<br />\ncoal bed, and the base of the formation is placed at the top of the )<br />\nunderlying Homewood Sandstone of the Pottsville Group. In the study area the top of the Rockwell is placed at the base of<br />\nthe lowest, deep red-brown to purple, flaggy cross-bedded<br />\nThe Allegheny Formation is estimated to be 200 to 225 feet quartzitic sandstone. The unit ranges in thickness from 250 to<br />\nthick. about 400 feet, and represents Late Devonian to Early<br />\nMississippian deposition. Fossils are rare in the Rockwell in this<br />\narea, with the exception of plant fragments and trace fossils.<br />\nPottsville Group Predominately light-gray sandstone at the<br />\n$ top, grading downward into tan cross-bedded sandstone : ; : :<br />\nz and conglomerate with subordinate amounts dark-gray shale, Hampshire Formation Sandstone, siltstone, and shale. Grayish-<br />\nsiltstone and coal. | Dh red to dusky-red; some grayish-green or mottled green and<br />\nred beds.<br />\nThe basal formation, the Sharon Sandstone unconformably . : : ] :<br />\noverlies red shale and claystone and green-gray sandstones of the The Hampshire Formation consists of .mterbedded micaceous,<br />\nMauch Chunk Formation, and consists of a very light gray fine- to medium—gmined sandstone and s1ltstone. or coarse hac!dy<br />\nconglomeratic sandstone. The Sharon Sandstone is overlain by shale. Hampshire sandstones range from thin to very thick<br />\nthe Conoquenessing Sandstone which is typically thin-bedded, bedded (to 5 feet), are commonly cross-bedded and show<br />\nmicaceous, and tan in color. Overlying the Conoquenessing is lenticular l_aedding. Some beds contain shale—f:hip conglomer.ate.<br />\nan interval of dark-gray shale and coal tentatively correlated with The associated siltstones are generally massive ar}d grade into<br />\nthe Upper Mercer of Ohio and Western Pennsylvania. The shale or mudrock. Scattered reduced beds bear indeterminate<br />\nuppermost formation of the Pottsville Group is the Homewood plant fragments.<br />\nSandstone. The Homewood consists of medium- to thick- : s<br />\nbedded, very light gray, coarse-grained sandstone to granular or The upper contact with the Rpckwell Formauqn is usually placed<br />\npebbly conglomerate. No minable coals are present in the at the base of the first yellowish-gray or greenish-gray sandstone.<br />\nmapped area in the Pottsville Group. Hampshire strata are normally poorly exposed along Backbone<br />\nMountains. This is because no major streams or highways cross<br />\n5 Total thickness for the group is 180 to 200 feet. this unit in the quadrangle and as such outcrops are relatively<br />\n§ scarce.<br />\nz Mauch Chunk Formation Shale, siltstone, and sandstone. Shale Typically, the unit is 1,800-2,000 feet thick across the study area<br />\ng e and siltstone red or pale-green; sandstone pale-gray to olive-drab. |<br />\nThe Mauch Chunk is predominantly red shale and siltstone with GREENLAND GAP GROUP<br />\ninterbedded flaggy micaceous sandstone. In the map area, the<br />\nz 11;11:13 :(sm eﬁssx}:: v:ou hacklyeds&e_,onm:ti' thlr:(l:a:::w;o gli_tst?n? * 1(1):, . Foreknobs Formation Siltstone, sandstone, conglomerate, and<br />\n) i ell-expos ower eet 0 . B L g<br />\n= Mauch Chunk along the old Western Maryland Railway tracks et gmy_’ PR —<br />\n2 west of Comgeville n the Comberind quadingle is 85 The Foreknobs is a consistently coarser unit than the underlying<br />\npercent shale and siltstone, only 25 percent of which is non-red. Scherr, consisting of siltstones punctuated by massive sandstone<br />\nThe predominance of soft fine-grained rocks in this unit renders packages, interbedded with subordinate but significant amounts<br />\nit one of the least visible units in the ‘map area. Sandstones are of conglomerate and pebbly sandstone. Moreover, scattered<br />\nfairly well spaced through the formation; most are c:,ross—befided through the section are many brownish-gray to grayish-red<br />\nor less commonly parallel-bedded, and fine- to medium-grained. \"redbeds.\" These superficially resemble the red strata of the<br />\nSeparating 1gd1v1dual §andstone beds are intervals of red-brown, o overlying Hampshire Formation but differ in having more<br />\nmudstone, with pervasive root casts. .g brownish than red tones.<br />\ng O<br />\n& The top of the Mauch Chunk is generally placed at the base. of COZJ Four named members of the Foreknobs have been recognized in<br />\n. the massive Sharon Sandstone Member of the overlying the map area. The basal Mallow Member is 700 to 900 feet of<br />\nS Pottsville Formation. The Mauch Chunk strata are _ chiefly olive-gray massive sandstone and siltstone, in places with<br />\n. predominantly if not wholly non-marine in the map area. Fossils conglomeratic strata at the base. The Mallow is wholly marine<br />\nother than plant fragments are absent. in origin and is a shallowing upward sequence. Overlying the<br />\n: ‘ . . . Mallow is the Briery Gap Sandstone, comprised of thick beds<br />\nThe thickness of the Mauch Chunk is approximately 500 feet. of cross-bedded yellowish-gray sandstone and pebbly sandstone,<br />\naccumulated as barrier bar deposits. The succeeding Blizzard<br />\n: Member is 300 to 500 feet of interbedded olive-gray sandstone<br />\nGreenbrier Formation Limestone, sandy to crystalline, and siltstone, with minor amounts of shale and conglomerate, all<br />\nMg calcareous sandstone; siltstone and shale. Limestones pale- of shallow marine origin. The Pound Sandstone, which<br />\ngray, pale-red, and greenish-gray; terrigenous lithologies pale- overlies the Blizzard, essentially repeats the Briery Gap<br />\nred to bright-red. lithology. This sandstone forms a series of low hills at the axis<br />\nof the Deer Park Anticline.<br />\nThe Greenbrier in the map area is comprised of four members:<br />\n- from oldest to youngest, the basal Loyalhanna Limestone, the It is essentially a shallowing up sequence, which is basinal<br />\n-g Deer Valley Limestone, the Savage Dam Member, and the marine in the lower portion, grading to shoreline deposits at the<br />\nB uppermost Wymps Gap Limestone. The Loyalhanna is a top. The first bright-red, non-marine beds of the Hampshire<br />\n@ conspicuously cross-stratified, pale-red sandy limestone. mark the top of the unit. ~<br />\n@ The pervasive red and gray laminations are enhanced on<br />\n2 = weathered surfaces, and render the Loyalhanna instantly The Foreknobs draws its name from outcrop in a series of<br />\n§ recognizable inthe map area.  Some cross-bedded units prominent knobs lying below the larger knobs of the Purslane<br />\nare as thick as 15 feet. The Loyalhanna is unfossiliferous. Formation along the Allegheny Front of West Virginia. The<br />\nabundant shales in this formation make up the broad valley at the<br />\nOver the northern part of the map area, the sandy limestone of center of the Deer Park Anticline. In most places, the S<br />\nthe Loyalhanna is sharply overlain by the Deer Valley Limestone. Foreknobs-Hampshire contact passes through or just below this s24<br />\nThe Deer Valley is a single thick bed of gray to reddish, fine- series of knobs. Outcrops of the Foreknobs are generally quite M3<br />\ngrained, massive, crystalline limestone with a silky luster and a limited in this area. As much as 1,800 feet of strata can be Table Rock<br />\nhackly irregular fracture. Fossils are rare and inconspicuous. It assigned to the unit in the map area. st 2<br />\n\f", "format": "basic_html", "processed": "39 22730\"N<br /><br /><br /><br /><br /><br />\nbl e i bt Sk RN b - _ , T —————<br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nTable Rock and Davis Quadrangles, Geologic Map<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n39 200\"N<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n39 1730\"N<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n79 300\"W 79 2730\"W 79 250\"W 79 2230\"W<br />\n| e - - | - - 2<br />\ne -3 DESCRIPTION OF MAP UNITS<br />\nN<br />\ng -<br />\n= Alluvium Sand, silt, and gravel. Pale-gray to dark-gray, tan, Purslane Sandstone Sandstone. Red-brown to purple.<br />\nweathering orange to red-brown. N<br />\n§ . The Purslane Sandstone is represented in the map area by several<br />\n” Alluvium encompasses poorly sorted, sandy to gravelly tens of feet of fine- to medium-grained, hard quartzitic sandstone<br />\n5 unconsolidated sediments, generally with angular to subrounded and quartz-pebble conglomerate. The rock in the lower part of<br />\ng cobbles and boulders of locally derived rock. Although the formation is typically thin-bedded and flaggy in 1- to 2-inch<br />\n= dominantly quartzose, alluvial sand commonly contains beds, shows conspicuous low-angle cross-bedding, and upon<br />\n8« abundant rock fragments. weathering yields a characteristic talus of thin slabs. Although<br />\nthe Purslane may be as much as 250 feet thick, it probably<br />\nAlluvium underlies the channels and adjacent valley floors of all averages about 100 feet in thickness. It carries no determinate<br />\nof the major streams and many of the minor streams in the map fauna or flora, and is non-marine in origin.<br />\narea, but especially along the Potomac River.<br />\no Along most of the outcrop belt, the most conspicuous evidence<br />\nWS of its presence is a rubble or talus of reddish-purple sandstone<br />\nConemaugh Group Interbedded, greenish-gray and medium- . slabs distributed over the crests and back sides of knobs along<br />\ne gray shale, gray micaceous sandstone and siltstone; coal beds, 2 Backbone Mountain.<br />\nand locally reddish claystones with two thin fossiliferous shales g<br />\ng in the lower half of the group. @<br />\n-8 @ Rockwell Formation Sandstone, siltstone, shale, and minor<br />\nAlthough the Conemaugh Group in western Maryland is made = Mbr conglomerate. Greenish-gray, pale-green or gray, reddish-brown<br />\ng_ up of two formations, it is not differentiated herein. Only the to brownish-red.<br />\n5 lower half of the formation, which roughly coincides with the<br />\nGlenshaw Formation, is present in the Davis Quadrangle. A The Rockwell Formation comprises interbedded sandstone,<br />\ncouple of locally mined coal beds, like the Wellersburg [we] and siltstone, and shale. Most of the sandstones are soft, micaceous,<br />\nAmes [a] are present near the middle of the group, but only two commonly lignitic, lenticular and cross-bedded, and thin- to<br />\ncoal beds are consistently minable in the Davis Quadrangle. thick-bedded. The interbedded fine-grained rocks range from<br />\nThe lower coal is equivalent to the Lower Bakerstown [Ib] of evenly laminated to massive and hackly. Rockwell shales are<br />\nPennsylvania. The upper coal, the Barton [b], is termed the carbonaceous and pyritic in places. Some beds display burrows<br />\nElklick coal in adjacent West Virginia. Important sandstone or burrow-mottling, as well as Skolithus tubes.<br />\nintervals include the Mahoning above the Upper Freeport coal<br />\nat the base of the group, the Saltsburg Sandstone above the Several named members have been recognized within the<br />\nBakerstown coal bed, the Morgantown Sandstone above the Rockwell, especially in nearby areas of West Virginia and<br />\nBarton coal. The Conemaugh Group is 800 to 900 feet thick. Pennsylvania, but none of these has seen widespread use in<br />\nMaryland. The Oswayo Member is a latest Devonian marine<br />\ntongue and makes up the basal 40 to 50 feet of the formation. It<br />\ns Allegheny Formation Interbedded, medium- to dark-gray shale consists of pale PR grone, flaggy sandstone. Abm.xt 30 feet<br />\n: Pa and siltstone; tan to light-gray sandstone; and coal with a above this sandsto_ne is a thin bed of polymictic diamictite. The<br />\n- claystone interval near the base. Oswayo Member is succeeded by up to 180 feet of mostly gray-<br />\nZ green sandstone and reddish-brown to red, interbedded, mostly<br />\n§ Of the important coal beds within the Allegheny Formation only nonmarine siltstone and nonmarine shale. Overlying this non-<br />\n- a the Lower Kittanning [Ik] and Upper Freeport [uf] arc mapped marine interval is a dark-gray siltstone known as the Riddlesburg<br />\n= = here. The base of the formation is marked by the Lower Mount Shale. This manpe.sh.ale.ls correlative to the Sunbury Shale of<br />\n§ Savage claystone, which is present near the base of the Ohio, a basal Mississippian unit.<br />\nS formation. = An important marker sandstone unit is the i<br />\ng Westernport Sandstone near the middle of the formation. The In the_ Table Rock quadrangle, the .Rockwell Formation forms<br />\nP top of the formation is placed at the top of the Upper Freeport low hills at the base of Dans Mountain.<br />\ncoal bed, and the base of the formation is placed at the top of the )<br />\nunderlying Homewood Sandstone of the Pottsville Group. In the study area the top of the Rockwell is placed at the base of<br />\nthe lowest, deep red-brown to purple, flaggy cross-bedded<br />\nThe Allegheny Formation is estimated to be 200 to 225 feet quartzitic sandstone. The unit ranges in thickness from 250 to<br />\nthick. about 400 feet, and represents Late Devonian to Early<br />\nMississippian deposition. Fossils are rare in the Rockwell in this<br />\narea, with the exception of plant fragments and trace fossils.<br />\nPottsville Group Predominately light-gray sandstone at the<br />\n$ top, grading downward into tan cross-bedded sandstone : ; : :<br />\nz and conglomerate with subordinate amounts dark-gray shale, Hampshire Formation Sandstone, siltstone, and shale. Grayish-<br />\nsiltstone and coal. | Dh red to dusky-red; some grayish-green or mottled green and<br />\nred beds.<br />\nThe basal formation, the Sharon Sandstone unconformably . : : ] :<br />\noverlies red shale and claystone and green-gray sandstones of the The Hampshire Formation consists of .mterbedded micaceous,<br />\nMauch Chunk Formation, and consists of a very light gray fine- to medium—gmined sandstone and s1ltstone. or coarse hac!dy<br />\nconglomeratic sandstone. The Sharon Sandstone is overlain by shale. Hampshire sandstones range from thin to very thick<br />\nthe Conoquenessing Sandstone which is typically thin-bedded, bedded (to 5 feet), are commonly cross-bedded and show<br />\nmicaceous, and tan in color. Overlying the Conoquenessing is lenticular l_aedding. Some beds contain shale—f:hip conglomer.ate.<br />\nan interval of dark-gray shale and coal tentatively correlated with The associated siltstones are generally massive ar}d grade into<br />\nthe Upper Mercer of Ohio and Western Pennsylvania. The shale or mudrock. Scattered reduced beds bear indeterminate<br />\nuppermost formation of the Pottsville Group is the Homewood plant fragments.<br />\nSandstone. The Homewood consists of medium- to thick- : s<br />\nbedded, very light gray, coarse-grained sandstone to granular or The upper contact with the Rpckwell Formauqn is usually placed<br />\npebbly conglomerate. No minable coals are present in the at the base of the first yellowish-gray or greenish-gray sandstone.<br />\nmapped area in the Pottsville Group. Hampshire strata are normally poorly exposed along Backbone<br />\nMountains. This is because no major streams or highways cross<br />\n5 Total thickness for the group is 180 to 200 feet. this unit in the quadrangle and as such outcrops are relatively<br />\n§ scarce.<br />\nz Mauch Chunk Formation Shale, siltstone, and sandstone. Shale Typically, the unit is 1,800-2,000 feet thick across the study area<br />\ng e and siltstone red or pale-green; sandstone pale-gray to olive-drab. |<br />\nThe Mauch Chunk is predominantly red shale and siltstone with GREENLAND GAP GROUP<br />\ninterbedded flaggy micaceous sandstone. In the map area, the<br />\nz 11;11:13 :(sm eﬁssx}:: v:ou hacklyeds&amp;e_,onm:ti' thlr:(l:a:::w;o gli_tst?n? * 1(1):, . Foreknobs Formation Siltstone, sandstone, conglomerate, and<br />\n) i ell-expos ower eet 0 . B L g<br />\n= Mauch Chunk along the old Western Maryland Railway tracks et gmy_’ PR —<br />\n2 west of Comgeville n the Comberind quadingle is 85 The Foreknobs is a consistently coarser unit than the underlying<br />\npercent shale and siltstone, only 25 percent of which is non-red. Scherr, consisting of siltstones punctuated by massive sandstone<br />\nThe predominance of soft fine-grained rocks in this unit renders packages, interbedded with subordinate but significant amounts<br />\nit one of the least visible units in the ‘map area. Sandstones are of conglomerate and pebbly sandstone. Moreover, scattered<br />\nfairly well spaced through the formation; most are c:,ross—befided through the section are many brownish-gray to grayish-red<br />\nor less commonly parallel-bedded, and fine- to medium-grained. \"redbeds.\" These superficially resemble the red strata of the<br />\nSeparating 1gd1v1dual §andstone beds are intervals of red-brown, o overlying Hampshire Formation but differ in having more<br />\nmudstone, with pervasive root casts. .g brownish than red tones.<br />\ng O<br />\n&amp; The top of the Mauch Chunk is generally placed at the base. of COZJ Four named members of the Foreknobs have been recognized in<br />\n. the massive Sharon Sandstone Member of the overlying the map area. The basal Mallow Member is 700 to 900 feet of<br />\nS Pottsville Formation. The Mauch Chunk strata are _ chiefly olive-gray massive sandstone and siltstone, in places with<br />\n. predominantly if not wholly non-marine in the map area. Fossils conglomeratic strata at the base. The Mallow is wholly marine<br />\nother than plant fragments are absent. in origin and is a shallowing upward sequence. Overlying the<br />\n: ‘ . . . Mallow is the Briery Gap Sandstone, comprised of thick beds<br />\nThe thickness of the Mauch Chunk is approximately 500 feet. of cross-bedded yellowish-gray sandstone and pebbly sandstone,<br />\naccumulated as barrier bar deposits. The succeeding Blizzard<br />\n: Member is 300 to 500 feet of interbedded olive-gray sandstone<br />\nGreenbrier Formation Limestone, sandy to crystalline, and siltstone, with minor amounts of shale and conglomerate, all<br />\nMg calcareous sandstone; siltstone and shale. Limestones pale- of shallow marine origin. The Pound Sandstone, which<br />\ngray, pale-red, and greenish-gray; terrigenous lithologies pale- overlies the Blizzard, essentially repeats the Briery Gap<br />\nred to bright-red. lithology. This sandstone forms a series of low hills at the axis<br />\nof the Deer Park Anticline.<br />\nThe Greenbrier in the map area is comprised of four members:<br />\n- from oldest to youngest, the basal Loyalhanna Limestone, the It is essentially a shallowing up sequence, which is basinal<br />\n-g Deer Valley Limestone, the Savage Dam Member, and the marine in the lower portion, grading to shoreline deposits at the<br />\nB uppermost Wymps Gap Limestone. The Loyalhanna is a top. The first bright-red, non-marine beds of the Hampshire<br />\n@ conspicuously cross-stratified, pale-red sandy limestone. mark the top of the unit. ~<br />\n@ The pervasive red and gray laminations are enhanced on<br />\n2 = weathered surfaces, and render the Loyalhanna instantly The Foreknobs draws its name from outcrop in a series of<br />\n§ recognizable inthe map area.  Some cross-bedded units prominent knobs lying below the larger knobs of the Purslane<br />\nare as thick as 15 feet. The Loyalhanna is unfossiliferous. Formation along the Allegheny Front of West Virginia. The<br />\nabundant shales in this formation make up the broad valley at the<br />\nOver the northern part of the map area, the sandy limestone of center of the Deer Park Anticline. In most places, the S<br />\nthe Loyalhanna is sharply overlain by the Deer Valley Limestone. Foreknobs-Hampshire contact passes through or just below this s24<br />\nThe Deer Valley is a single thick bed of gray to reddish, fine- series of knobs. Outcrops of the Foreknobs are generally quite M3<br />\ngrained, massive, crystalline limestone with a silky luster and a limited in this area. As much as 1,800 feet of strata can be Table Rock<br />\nhackly irregular fracture. Fossils are rare and inconspicuous. It assigned to the unit in the map area. st 2<br />"}], "field_media_file": [{"target_id": 52355, "display": null, "description": null, "target_type": "file", "target_uuid": "f2a5e105-896a-4140-b176-089d883b7c8a", "url": "http://digital.library.jhu.edu/system/files/2022-03/16186-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16186, "target_type": "node", "target_uuid": "51776898-b2d2-47e1-ac2c-872da182d665", "url": "/node/16186"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "39569b3b-568d-485c-ba41-4c27fc18d476"}]}