{"mid": [{"value": 36783}], "uuid": [{"value": "9619ff89-20b6-4861-8fa9-22d4a2cdc450"}], "vid": [{"value": 36783}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13027-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 13<br />\n<br />\nBALTIMORE, MD., NOVEMBER 15, 1922<br />\n<br />\nBRING ON<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMARYLAND<br />\n<br />\nCONSULAR SERVICE OF- COMMITTEE OF FOOTBALL SHOEMAKER ADDRESSES ASFERED AS CAREER FOR<br />\nCOACHES ADOPTS SPORTSSEMBLY ON IDEAL OF<br />\nHOPKINS MEN<br />\nMANSHIP CODE<br />\n--CHRISTIAN LIVING<br />\nDepartment of State Calls Atten- Grid Mentors Give Ideas of Sport Life of Service and Altruism ExEthics. Fair Play Recommended<br />\ntion to Unusual Governtolled. Vatmeman Announces<br />\nOpportunitie<br />\nmental<br />\ns<br />\nas Fundamental<br />\nPlans for Celebrations<br />\nPHILADELPHIANS FAIL TO SHOW ANY SIGNS OF OPPOSIThe Department of State, by a<br />\nEmbodying all principles of fair<br />\nAt last Thursday's assembly,<br />\nTION. EVERY HOPKINS SUB IN GAME<br />\nletter to President Goodnow, calls play, good sportsmanship and Rev. Samuel Shoemaker, a graduIn a contest which can hardly be said to have furnished satisattention to the advantages of the coaching ethics,<br />\na list of sugges- ate of Princeton, delivered an in- factory practice for the Black and Blue gridders, the Drexel Institute<br />\nConsular Service as life work for<br />\ntions adopted by the Sportsman- spiring address on the subject of eleven was buried under an avalanche of scoring at Homewood last<br />\nHopkins men.<br />\nChristian living. Taking an ac- Saturday. When<br />\nDoug Turnbull rolled across the line for the last<br />\nship Committee of the Association<br />\nquaintance of many years as an ex- touchdown the score stood<br />\n.The Consular Service is no lon58-0 and the count might easily have<br />\nger a matter of political plums. By of Football Coaches of America has ample, Rev. Shoemaker brought been doubled had the Hopkins<br />\nfirst string men stayed in the lineup<br />\nan Act of Congress in 1906, the been made public.<br />\nout several vital points in connec- for any length of time.<br />\nAfter the first touchdown had been scored<br />\nConsular Service of the United<br />\nThe elimination of underhand tion with his subject, especially as two minutes after the kickoff, Van Orman<br />\nstarted in his subs and<br />\nStates was reorganized and Execu- spying, the provision of comforts applied to college students.<br />\nbefore the end of the second quarter every available scrub was in<br />\ntive Orders of 1906 and 1919 pro- and conveniences to visiting teams, The man who was considered as the game. Rich, Walbert and Maxwell<br />\nwere the only men kept on the<br />\nvide that appointments to career and cessation of cheering and mak- typical of a class, was a former bench, all three of them nursing bad<br />\nlegs. Captain Tom Landy and<br />\npositions in the service shall be ing of noises while the opposing Princeton prominence, but had Doug Turnbull were the only regulars<br />\nwho remained in the lineup<br />\nmade after examination.<br />\ngeneral is calling signals, are never possessed a wide circle of throughout the rout.<br />\nThe consular officers' work is among the suggestions adopted by friends. After graduatiaL, he enin every department of the<br />\nclosely watched, although he may the committee, of which Major tered his father's business in a city MUSICAL CLUB PREPARING game the Philadelphians were enbe far away from the United Charles D. Daly, of West Point, of the Middle West. Ten years<br />\nINTERESTING SCHEDULE<br />\ntirely outclassed. The Hopkins<br />\nStates. He is given every oppor- is chairman, and which includes later, although financially success- Orchestra and Mandolin Club backfield simply ran wild and few<br />\ntunity to show what he can do, as such well-known names as Heis- ful, he was unhappy and dissatisLose Services of Leader. First plays netted under six yards, while<br />\nwell as credit for all he accom- man, of Penn; Fisher, of Harvard: fied. His marriage was not satisseveral runs of 40 and 50 yards<br />\nConcert at Franklin High<br />\nplishes. All promotions in the ser- \"Tad\" Jones, of Yale; \"Andy\" factory; he lived only for himself,<br />\nThe Mandolin Club and the Or- were pulled off. Taylor and Coady<br />\nvice are determined entirely on Smith, of California, and Stagg, of and, in violation of a promise to his<br />\nsliced off tackle for terrific gains<br />\nfather, he was addicted to drink- chestra are temporarily without a in the<br />\nChicago.<br />\nmerit.<br />\ninitial quarter, while Turnleader on account of the departUnder the paragraph entitled ing. He asserted that he was \"not from the University<br />\nIt is desired to call particular atbull<br />\nbucked<br />\nthrough great gaps<br />\nof Jules L. Sitention to the system now in force \"Fair Play,\" the committee says: interested in religion.\"<br />\nin<br />\nthe<br />\nopposing<br />\nline time and<br />\nThe trouble with this man and monowitz, cellist, who has ven- again.<br />\nby the Department, of training lan- \"Fair play is fundamental to all<br />\nMaurice<br />\nSkinner, who gentured into matrimony. Simonowitz<br />\nguage students at Government ex- sport.\" Their suggestions include many others, Rev. Shoemaker said, was an exceptionally skillful<br />\neraled the team after Buck Bonmupense for service in the diplomatic provision for a fair playing field, is that their idealism is submerged. sicians and his loss is felt keenly. ner was knocked out in the secand consular branches of the for- the setting of the laws of the game, They give \"intellectual questions\" The leadership of the Mandolin ond quarter, chose his plays with<br />\neign service in China and Japan. selection of competent and mutual- as reasons for their lack of religion. Club will be given either to<br />\nM. E. precision and in addition skirted<br />\nAbout fifteen years ago the Gov- ly agreeable officials, and the usage The real reason generally is that Sater or to Kinnamon. These two the opposing ends at will.<br />\nernment provided for the establish- of \"genuine students eligible under they do not have the courage to un- men will each be given a chance<br />\nIf the opposing defense was<br />\nto<br />\nment of an interpreter corps •in amateur rules and the other rules dergo the mental and physical dis- conduct the Mandolin Club during weak their<br />\noffense was nil.<br />\nChina, Japan and Turkey, in order of eligibility governing the • insti- comfort that acceptance of a per- rehearsals. The club will then Throughout<br />\nthe<br />\ngame they gained<br />\nsonal<br />\nreligion<br />\nwould involve. A<br />\nthat it might have available for its tution.\"<br />\nchoose by vote the lead for the 12 yards and lost more than twice<br />\nlack<br />\nof a guiding purpose in life<br />\nown service men trained in the<br />\nThe committee continues: \"Good<br />\nyear.<br />\nthat much when they held the<br />\nis<br />\noften<br />\nthe cause of unhappiness;<br />\nknowledge of the languages, insti- sportsmanship involves fair play,<br />\nball. Their kicks scarcely went<br />\nIt<br />\nhas<br />\nnot<br />\nyet<br />\nbeen<br />\ndefinitely<br />\ndetutions and conditions of these but extends beyond it into the finer a man deserves all the happiness he cided whether<br />\nmore<br />\nthan 25 yards and their<br />\nthe<br />\nMandolin<br />\nClub<br />\ncountries. An effort'has been made expressions of gentlemanliness and can hold.<br />\nkickoffs<br />\nand<br />\nOrchestra<br />\nwere awfully weak. Nearwill<br />\nbe<br />\ncombined<br />\nor<br />\nWhen the Westerner, finally givto obtain for this branch of the chivalry.\" In addition to suggesly<br />\nevery<br />\nHopkins linesman had a<br />\nconducted<br />\nwill<br />\nbe<br />\nas<br />\nseparate<br />\norservice young men, preferably uni- tions mentioned above, it proposes ing in, asked how this happiness ganizations.<br />\nchance<br />\nat<br />\nrunning back a kickoff,<br />\nAt<br />\npresent<br />\nforthe<br />\nversity graduates, who desire to \"applauding an outstandingly bril- could be obtained, Rev. Shoemaker mer<br />\none<br />\nwhich<br />\nof<br />\nmethod<br />\nrolled to the center<br />\nis<br />\nbeing<br />\ntested.<br />\nspecialize in work pertaining to the liant play or demonstration of per- gave him certain advice applicable<br />\nand<br />\nseveral<br />\nothers<br />\nto the guards.<br />\nto the man's particular situation. A special feature of the Musical<br />\nOrient.<br />\nsonal pluck or act of fine sportsTubby<br />\nCouncill<br />\nran<br />\none back 10<br />\nClub<br />\nconcerts<br />\nthis<br />\nyear<br />\nwill<br />\nbe<br />\na<br />\nRev.<br />\nShoemaker<br />\nsaid<br />\nthat<br />\nit is esThe consular officers are appoint- manship on the part of an opsential for a man to get his share saxaphone sextet. M. C. Sater has yards, carrying two would-be<br />\ned to classes instead of to posts as ponent,\" \"treating the visiting team<br />\nof fun out of life. He recommend- charge of this and those who wish, tackles with him.<br />\nformerly, the class determining the and supporters as guests and not<br />\ned a Christian life as one of the to try out for'it are requested to<br />\nThe Black and Blue received<br />\nsalary. They may be assigned or enemies,\" and \"going out of one's<br />\nprincipal sources of the needed report to him.<br />\nthe initial kickoff and tore off first<br />\ndetailed to such posts as the Presi- way to congratulate the coach and<br />\n\"kick.\" Many college gradudtes<br />\ndowns<br />\nIn<br />\nanticipation<br />\nin rapid succession until<br />\nof<br />\nlarge<br />\na<br />\nGlee<br />\ndent may deem advisable, in order captain of the winning team.\"<br />\ncommence their careers with an ab- Club this year, John Sherwood has Turnbull plunged across the line.<br />\nto best meet the needs of the serConcerning coaching ethics, the<br />\nsolute disregard of altruism. Of ordered enough music of each selec- From then on the Hopkins backs<br />\nvice.<br />\ncommittee says: \"Coaching ethics<br />\nthe many opportunities for a life tion for seventy-five voices. Re- were kept busy running the ball<br />\nThe compensation of consular of- concern the ideals and practices of of service,<br />\nsuch as the ministry and hearsals of the Glee Club are held down the field. One more touchficers is low compared with those coaches as expressed in their atti- teaching,<br />\ncollege students accept every Thursday night under the di- down was scored in this quarter,<br />\npaid outside the service. The low- tude toward the school, the team, few.<br />\nBefore leaving college is the rection of Professor Bochau. Try- when Schact recovered a fumble<br />\nest paid position is that of the stu- the rules, and the spirit of the<br />\ntime when ideals should be devel- outs for the .Varsity Quartette were and ran 25 yards to the line. In<br />\ndent interpreter, who receives fif- game. The value and honor of<br />\noped. \"The trouble,\" declared Rev. held last Thursday night.<br />\nthe second quarter Turnbull carteen hundred dollars per annum, football are greatly affected by the<br />\nShoemaker, \"is likely to be sin. The<br />\nThe Musical Club is preparing ried the ball over twice in about<br />\nwhile the highest paid is the Con- ethics, of the coach.\"<br />\nstatement is harsh, and as cutting for its first concert of the year, to four minutes, once with a 17-yard<br />\nContinued on Page 4, col. 4.<br />\nsul-General, who receives twelve<br />\nas a razor's edge, but it is, never- be held at Franklin High School plunge through center.<br />\nthousand dollars per annum. In<br />\ntheless, largely true.\" The speaker on Saturday, December 2. BeToward the end of the half<br />\nPlace of large salaries, the service<br />\nrecommended the four standards cause of nearness of this date, Pearce Coady<br />\nFRESHMEN!<br />\npulled off the most<br />\noffers as compensation to those in<br />\nof Christ—absolute honesty, abso- Manager Vanneman has deemed sensational run<br />\nBRING YOUR BOXES FOR<br />\nof the day when<br />\nit endless opportunities for indilute purity, absolute unselfishness, it advisable to hold two extra re- he dashed,<br />\nFRIDAY'S BONFIRE.<br />\nSHOW<br />\nsidestepped and<br />\nvidual initiative and responsibility,<br />\nMARYLAND WHAT'S IN STORE<br />\nand a love toward people person- hearsals, as follows: A rehearsal squirmed down the<br />\nfield for 55<br />\nand also the advantages of educaFOR THEM.<br />\nally—as the principles upon which of the Glee Club on Tuesday, No- yards. The 150pound halfback<br />\ntion, travel and highest social conour lives should be based.<br />\nvember 21, in the Barn; and a re- started around<br />\nleft end, passing<br />\nCANDIDATES WANTED<br />\nnections in foreign countries.<br />\nA Christian life has its romantic hearsal of the whole Musical his interference after<br />\ncovering<br />\nFOR<br />\nBUSINESS<br />\nSTAFF<br />\nOF<br />\nAs regards examination for enas well as its hard aspects. The Club on Tuesday, November 28, about 15 yards and<br />\nwhen<br />\nit<br />\nlooked<br />\nHULLABAL<br />\nOO<br />\ntrance to the service,- they are for<br />\nthrill of helping others spiritually in the C. E. Hall. The latter will as if he was to<br />\nbe<br />\nforced<br />\nout of<br />\nMEETING<br />\nOF CANDIPosition of consul, vice-consul de<br />\nand materially, and the power to be the final rehearsal before the bounds by three<br />\nopposing<br />\nDATES<br />\nbacks<br />\nIN HULLABALOO<br />\ncarriese, consular-assistant, and<br />\nbe of such help and color to the ex- concert. The extra rehearsals do he completely<br />\nreversed<br />\nthe<br />\nOFFICE WEDNESDAY<br />\nfield,<br />\nstudent interpreter. Only citizens<br />\nistence. In any case, the whole not, of course, affect the regular sidestepping and<br />\nstiff-arming five<br />\n12.20<br />\nof the United States are designated<br />\nmatter resolves itself into a single rehearsals on Thursday nights. tackles, he<br />\ncrossed the gridiron<br />\nfor the examinations; and only unquestion,<br />\nwhich we must answer<br />\nThe official dress of the mem- and dashed down the north sideMEETING OF ALL CANDImarried men between the ages of<br />\none way or the other. That ques- bers of the Glee Club will be the line until he<br />\nDATES FOR DRAMATIC CLUB<br />\nwas brought down on<br />\nnineteen and twenty-six are examPARTS IN STUDIO ON TOP<br />\ntion, said Rev. Shoemaker, is sim- full dress suit. The forty or more the four-yard<br />\nline. Skinner then<br />\nined for appointment as student inFLOOR OF BARN TODAY AT<br />\nply, \"What are we going to do with men who go up to Reisterstown skirted left<br />\nend<br />\nfor the fifth touch4.00<br />\nP.<br />\nM.<br />\nterpreters.<br />\nthe claims of God upon our lives ?\" will be required to wear this uni- down<br />\nand Coady kicked goal.<br />\nContinued on Page 4, col. 3<br />\n<br />\nBLACK AND BLUE SUBSTITUTES<br />\nOVERWHELM DREXEL<br />\nINSTITUTE ELEVEN, 58-0<br />\n<br />\nContinued on page 3, col. 1<br />\n<br />\nContinued on Page 4, col. 3<br />\n<br />\nContinued on page 3, cat. 2<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922<br />\n<br />\nR. 0. T. C. TO PARADE BE- FRATERNITIES TO ORGAN- SCHEDULE TO BE ARRANGED<br />\nFOR NEXT YEAR'S FRESHFORE ARMY-MARINE<br />\nIZE BASKETBALL TEAM<br />\nMAN FOOTBALL TEAM<br />\nGAME<br />\nAt the regular weekly meeting<br />\nFOUNDED 1897.<br />\nA motion to appoint an assistThe Johns Hopkins Reserve Ofof the Interfraternity Board held ant manager of football at the end<br />\nbeen<br />\nhas<br />\nCorps<br />\nTraining<br />\n$2.00 ficers'<br />\nSubscription<br />\nlast Monday it was proposed to of the present season to arrange a<br />\ninvited by the authorities who<br />\nan Interfraternity Bas- schedule .for next year's FreshEntered as second-class matter December 3, 1909, at the Postoffice at have charge to participate in the organize<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nman team was passed at a recent<br />\nLeague.<br />\nketball<br />\nArmythe<br />\nlarge parade before<br />\nStadium<br />\nThere are, it seems, a great meeting of the A. A. Board.<br />\nPublished semi-weekly from October to June by the students of Johns Marine game at Venable<br />\nIn the past there has been a<br />\nUniversity.<br />\nOn<br />\nHopkins<br />\non Saturday, December 2.<br />\nmany men in the various fraternideal of difficulty and dissat()Teat<br />\nbehalf of the students in the R. ties who are potential stars and<br />\nBusiness communications should be addressed to the BUSINESS MANbecause of having an orisfaction<br />\ncommunications<br />\nother<br />\nand<br />\n0. T. C., Major Garey has acceptAGER, JOHN HOPKINS UNIVERSITY; all articles<br />\nhave other athletic ganized team with only one or two<br />\nnot<br />\ndo<br />\nwho<br />\nshould be sent to the MANAGING EDITOR.<br />\ned the invitation which also in100<br />\nreserved seats for all those activities to occupy their time games. This difficulty will be<br />\ncludes<br />\nHomewood<br />\nTelephone<br />\ntaking part in the parade. A simi- during the winter months. These eliminated under the new plan.<br />\nThe question of our withdrawlar invitation has been extended men will be given an opportunity<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nto all the colleges in West Vir- to display and develop their skill al from the South Atlantic Track<br />\nGLOVER P. FALLON, '23.<br />\nginia, Pennsylvania and Mary- in the gentle art of basketball if Association was brought before<br />\nManaging Editor:<br />\nthe board. At the present time<br />\nland who have military units. Al- the present plans develop.<br />\nJ. HUDSON HUFFARD, '23.<br />\nAdvertising Manager:<br />\nJohns Hopkins is the only college<br />\nthere will be about<br />\nVANNEMAN,'23.<br />\ntogether,<br />\nK.<br />\nDONALD<br />\nThe only difficulty at present<br />\nAssistant Managing Editor:<br />\nbelonging to both the South Atexis<br />\nit<br />\nline<br />\nand<br />\nin<br />\ntroops<br />\n12,000<br />\n'24.<br />\nJOSEPH S. LEOPOLD,<br />\nis to secure a suitable cage in<br />\nCirculation Manager:<br />\npected that the Hopkins men will which to stage the contests. A lantic and Middle Atlantic AssoAssociate Editors:<br />\nPHILIP W. HOWARD, '25.<br />\nmake a good showing. The line of committee was appointed consist- ciation. It is felt that memberRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nManagers:<br />\nparade will be from Washington ing of Magill, Buhrer and Miller ship in both is too expensive and<br />\nAssistant Business<br />\n'23.<br />\nHEARN,<br />\nC.<br />\nBERNARD<br />\nMonument, north on Charles to try and find some such place too hard on the track team, and<br />\nJunior Editors:<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nstreet to Thirty-third, and east which will be available. The In- these reasons • necessitate the<br />\nD. MILES MARRIAN, '25.<br />\nT. REESE MARSH, '24.<br />\n'25.<br />\nwithdrawal. A committee was apGIESKE,<br />\nDONALD<br />\non Thirty-third street to the StaG.<br />\nRICHARD C. TILGHMAN, '25.<br />\nterfraternity Board will award an<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN W. PARSONS, '25.<br />\ndium. At Hotel Belvedere the pa- appropriate trophy to the frater- pointed to investigate the matter.<br />\nJOHN C. LEWIS, JR., '23<br />\nBENJAMIN T. ROME, '25.<br />\nThe inefficiency of football offirade will be reviewed by General nity whose team has the highest<br />\nat the last few games was<br />\ncials<br />\nPershing, Secretary of the Navy standing at the end of the season.<br />\nIt was suggested that<br />\ndiscussed.<br />\nand Secretary of War.<br />\nThe fraternities are now busily<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nJohns Hopkins make arrangeThe drill last Thursday was engaged in compiling their schoments with St. John's and Marycarried on on Charles street and lastic averages for the second semMd.<br />\nland to procure officials that are<br />\nBaltimore,<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts.,<br />\nthe upper quadrangle under the ester of last year. The scholarship<br />\nboth accurate and reliable for the<br />\nsupervision of Major Garey and cup, which is awarded each semgames between these three<br />\nCaptains Paul, McMurray and ester to the fraternity having the<br />\nBALTIMORE, MD., NOVEMBER 15, 1922<br />\nschools.<br />\nAtwater. The drill was meant pri- highest average, will be presented<br />\nmarily to prepare for the review within the next two weeks.<br />\ngiven before President Goodnow<br />\nTRADITIONS<br />\nFACULTY NOTES<br />\nyesterday at 4.15 P. M., but also<br />\nthe<br />\nreserve<br />\nto<br />\nplan<br />\nthe<br />\nIn<br />\nthe<br />\nof<br />\nabsence of Professor<br />\nCouncil<br />\nThe adoption by the Student<br />\nZIONIST SOCIETY<br />\nprepared the unit for the parade<br />\na<br />\nto<br />\nbirth<br />\ngives<br />\nonly<br />\nSeniors<br />\nof<br />\nLovejoy, who is lecturing in the<br />\nGilman Memorial Room for the use<br />\nHOLDS MEETING<br />\nbe a highly next month.<br />\nbrand-new Johns Hopkins tradition. It should prove to<br />\nof California, the first<br />\nUniversity<br />\nAt the weekly meeting of the<br />\nmemorial should be<br />\nvalued one, for the quiet dignity of this beautiful<br />\nZionist Society, Friday, Novem- quarter of the academic year,<br />\nmuch added to through its exclusiveness.<br />\nPUBLICITY<br />\nBOARD<br />\nPETIber 3, 1922, Mr. I. B. Terlitzky Professor William P. Montague,<br />\ntraditions.\"<br />\nWe frequently hear of an institution as being \"rich in<br />\nTIONS<br />\nTO<br />\na brief lecture on \"The of Columbia Univer'sity, is meetADMISSION<br />\nSTUdelivered<br />\nsmall, have<br />\nAll of the old universities of the countries, large and<br />\nDENT<br />\nZionism.\" Mr. Terof<br />\nACTIVITIES<br />\nHistory<br />\nappear odd<br />\ning the advanced students in phitheir own treasured set of traditions. Some of them often<br />\nof the sois<br />\nlitzky<br />\nvice-president<br />\nCOUNCIL<br />\nbehave<br />\nlosophy, as visiting professor of<br />\nto the mere outsider, but to the son of the institution they<br />\nA meeting of the Student Activ7 ciety and has always taken an ac- philosophy. He spends Thursday<br />\ncome sacred.<br />\nities Council was held last Wednes- tive part in its work at the Uni- of each week in Baltimore.<br />\nFor instance, the custom at a number of the privately established day<br />\nin the Black and Blue Jay's versity.<br />\ninstiThe courses in engineering and<br />\ncolleges of tipping the hat upon passing the monument to the<br />\nMr. Terlitzky explained that,<br />\nat 12:20 P. M., at which<br />\nOffice,<br />\nwithin<br />\nstudent<br />\ndrawing, lately in<br />\nmechanical<br />\nthe<br />\nto<br />\nbut<br />\nvisitor,<br />\na<br />\nto<br />\nodd<br />\nseems<br />\ntution's benefactor<br />\nthe petition of the Publicity Board although the Zionist movement is charge of Dr. Whiteman, have<br />\ntradition.<br />\nthe habit is a treasured<br />\nfor admission to the Council was yet in its infancy, there have been been assigned to Mr. V. L.<br />\nWe have recently published a list of Hopkins traditions, old and<br />\nconsidered. This petition had been at all times through the Middle Doughtie and Mr. J. A. G. Pennew. We hope that in the years to come the list may be augmented<br />\nwill de- presented to the Council some time Ages various attempts made to re- nington.<br />\nby the addition of other worthy customs. Upon their value<br />\nspirit, for ago, but was referred to a commit- turn to Palestine, and that the<br />\npend, to a large extent, the intensity of our institutional<br />\ntee, composed of members of the movement was given a new imProfessor of History—\"What do<br />\nafter all, traditions are fundamentally necessary for spirit.<br />\nre- Council, for investigation. The petus at the time of the French you know of the age of Elizabeth?\"<br />\nIt will, probably, take several years for our latest tradition to<br />\ncer- Council decided to leave the peti- Revolution. The speaker also<br />\nceive its full measure of appreciation, but when it does, it should<br />\nJones (dreamily)—\"She'll be<br />\ntried<br />\nRoom. tion in the hands of the committee mentioned those men who<br />\ntainly do much to add to the dignity of the Gilman Memorial<br />\npracproblem,<br />\nJewish<br />\nnext week.\"<br />\nthe<br />\nnineteen<br />\nsolve<br />\nto<br />\nuntil the next meeting, when it will<br />\nThe inquisitive underclassman of the future may gaze in awe-struck be voted on.<br />\ntheoretically. It is inand<br />\ntically<br />\nwonder from side-entrance, upon 'a scene which might have been<br />\nIt was also decided to withdraw teresting to note that Theodore<br />\ncheapened by its use for restroom purposes.<br />\nthe funds of the Council from the Hertzel, in his \"Jews State,\" had<br />\nOne more rung toward \"rich in traditions.\"<br />\nMercantile Trust and Deposit Co. a full national plan for governand place them in the care of the ment, limiting the working day to<br />\n6 hours and a plan for financing<br />\nUnion Trust Company.<br />\nA few varsity seals were voted the work of this government. The<br />\nAN OLD STORY<br />\nat the meeting Wednesday. All the Zionist activities have drawn the<br />\nThere was a story that used to be told several years ago conrest of the varsity seals to be attention of all the prominent<br />\ncerning a certain well-known \"math\" professor. It ran something awarded this fall will be voted at Jews in the world and has culmilike this:<br />\nthe next meeting of the Council, nated in the present movement.<br />\nStretch the<br />\nwalk<br />\ngroup)<br />\nI<br />\nMath.<br />\nFreshman,<br />\nwhich will be held Wednesday, Mr. Terlitzky also called the atThe prof. had had his class (a<br />\nwith an<br />\nAllowance<br />\ntention of the members to the<br />\nout from the classroom because he was five minutes late. The next November 22, 1922.<br />\nfact that the University Library<br />\ntlay when he demanded an explanation, a trembling Freshie vencontains quite a number of books<br />\nkured,\"We waited five minutes, sir.\"<br />\non Zionism and urged the memLUTHERAN STUDENTS<br />\n\"Five minutes!\" fumed the prof., \"don't you know the rule, sir?<br />\nbers, whenever possible, to read 11\"142°L4a<br />\nBANQUET<br />\nfifteen<br />\nprofessor,<br />\nassociate<br />\nMass production makes<br />\nan<br />\nthem.<br />\nfor<br />\nten<br />\nFive minutes for an instructor,<br />\nA banquet was held last Friday<br />\nfirst cost moderate.<br />\nthe<br />\nfor a professor, one-half hour for the Dean, and all day for me.\"<br />\nin honor of the Lutheran students<br />\nThe<br />\nsimple mechanism<br />\nThat's the old story and it's pretty close to the rule, although the at Goucher College, Johns Hopkins<br />\nNOTICE<br />\nnever gets out of order<br />\n\"hand-shaker\" usually gives his lecturer an extra five minutes of University and the University of<br />\nThere is a gold ring at the \"Lost and each double length<br />\nMaryland. There were more than<br />\ngrace.<br />\nand Found Bureau\" in the \"Y\"-ol- lead offers the same<br />\none hundred students present.<br />\nSome of the new men who do not know the custom have failed<br />\nfice, with the initials \"C. H. S.\" writing service as a 7 in.<br />\nSt.<br />\nof<br />\nTwo<br />\nmembers<br />\nprominent<br />\nwood pencil—atonly1c.<br />\nto wait, while others have waited for a longer period than necessary.<br />\nnumerals '20.\" If any one<br />\nMark's Lutheran Church, where and<br />\nEvery man should wait for at least five minutes.<br />\nthe banquet was held, addressed the has lost a ring answering to this The FEATHERAccording to the rules of good sportsmanship, the student should students. The principal speaker of description please come to the of- WEIGHT— shown<br />\nhere—of lightweight<br />\nallow his prof. the same liberality that is given him. If the prof. is the evening was Rev. Dr. Harsy, fice and identify it.<br />\n50c. Rolled<br />\naluminum<br />\n\"hard-boiled\" on the punctuality question, then the stude needs have of Philadelphia, the Lutheran sec$1.00.<br />\nSilver<br />\nretary for universities and other<br />\nno conscience.<br />\nGeorge—Which car shall I call See this and other modschools, who told the students of<br />\nsome of his experiences. Social for you in tomorrow, the sport or els at your stationery or<br />\ncooperative store.<br />\nfeatures occupied the rest of the the coupe?<br />\nalI<br />\nis<br />\ncar.<br />\nit<br />\nthat<br />\nsimilar<br />\nsport<br />\nand<br />\nlikely<br />\nGertrude—The<br />\nevening,<br />\nIngersoll RedipoInt Co.,Inc.<br />\nWm.H.Ingersoll, ?res.<br />\nDtie,to Armistice Day this issue of The News-Letter is appear- gatherings such as this will fol- ways get cold so much quicker in<br />\n461 Fourth Ave.,New York City<br />\nTuesday.<br />\nthat.—Brown Jug.<br />\nlow.<br />\nIIIMMMMIMNMMMMMEIMMMMMK<br />\ning on Wednesday instead of<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nIngersoll<br />\n<br />\nPencil<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922.<br />\nSHOEMAKER ADDRESSES<br />\nASSEMBLY<br />\nContinued from page 1<br />\n<br />\nBLACK AND BLUE OVERWHELM DREXEL<br />\n<br />\nStevens, President of the Y. M.<br />\nC. A., announced that Rev. Shoemaker, Rev. Bookman, of New<br />\nYork, and Mr. Hamilton, a graduate of Oxford, would discuss the<br />\nsubject of religion immediately after the assembly in Room 110, Mechanical Engineering Building. All<br />\nstudents were invited to attend.<br />\nSherwood announced that a<br />\nFreshman \"Pep\" Committee, to<br />\ntake over the work that the Sophomore \"Pep\" Committee and the<br />\nStudent Council have been doing,<br />\nwould be formed. The Student<br />\nCouncil has decided to close the<br />\nGilman Hall Memorial Room to all<br />\nundergraduates except Seniors.<br />\nSherwood called for an active, energetic school spirit, both on and<br />\noff the campus. He directed the<br />\nstudents' attention to Hopkins'<br />\ngreatest tradition, the Honor System, and recommended that it be<br />\nsupported in all things, both great<br />\nand small. The Cotillon Club is<br />\ngiving the receipts from its dances<br />\nafter games to the Cross Country<br />\nteam. There is a prospect of the<br />\nteam's disbanding if financial sup<br />\nport is not secured. For this reason, the dances should be especially<br />\nwell attended by the students.<br />\nVanneman called for volunteers<br />\nfor various stunts that are to be<br />\nperformed in the St. John's game<br />\nparade. He.asked that plenty of<br />\nwood be brought for the bonfire<br />\nnext Friday night, the eve of the<br />\nMaryland State game. The Freshmen are required to bring at least<br />\ntwo boxes or their equivalent before five o'clock Friday afternoon.<br />\nThe Freshmen were urged to assemble in the upper quadrangle<br />\npromptly at half past one before<br />\nthe games. Yell practice will bo<br />\nheld at the barn daily this week for<br />\nall classes, and the Freshman yell<br />\npractice on Tuesday afternoon<br />\nwill be suspended.<br />\nHay—\"He is sure a farsighted<br />\nman.\"<br />\nDees—\"How so?\"<br />\nHay—\"He had a fire extinguisher put in his coffin.\"—The<br />\nBee.<br />\n<br />\nContinued from page 1<br />\n<br />\nSkinner scored the first touchdown in the second half when he<br />\ndashed around left end for 30<br />\nyards after a short kick by Drexel. Coady again kicked goal. The<br />\nlast part of the game was a repetition of the first half except that<br />\nit was the subs instead of the regulars doing the work of piling up<br />\npoints. Skinner, Middleton and<br />\nBalsam continued to carry the ball<br />\nfor big gains and crossed the line<br />\nthree more times before the final<br />\nwhistle sounded.<br />\nScore:<br />\n<br />\nRomantic Young Flapper—\"Oh<br />\nisn't the moon just splendid this<br />\nevening?\"<br />\nPractical Young Man—\"That<br />\nisn't the moon. That's the clock<br />\non the bank downtown.\" (And<br />\nthey shoot men like Nathan Hale)<br />\nHe--Please give me one more.<br />\nShe—No, you have had one.<br />\nHe—But just one more no one<br />\nwill see, and it means so much.<br />\nShe—\"Really, I am giving no<br />\nseconds today,' said Mrs. Withers<br />\nas she left the dining room.—<br />\nYellow Jacket.<br />\n<br />\nPrinters of the<br />\nDrexel (0)<br />\nHopkins (57)<br />\nJones<br />\nL E<br />\nMiddleton<br />\nJohns Hopkins News-Letter<br />\nBuckman<br />\nL T<br />\nMagill<br />\nSchelley<br />\nL G<br />\nSlowik<br />\nWilson<br />\nC<br />\nCromwell<br />\nlirftettocetede'<br />\nElm<br />\nR G<br />\nCouncill<br />\nRepp<br />\nR T<br />\nLandy (c)<br />\n. Casner<br />\nSchact .. ...R.E<br />\nWeinberger<br />\nQ B<br />\nBonner<br />\nSchuman<br />\nL H<br />\nTaylor<br />\nCoyne<br />\nR H<br />\nCoady<br />\nLayer<br />\nF B<br />\nTurnbull<br />\nScore by Periods<br />\n12 19 13 13-57<br />\nHopkins<br />\n0 0 0 0— 0<br />\nDrexel<br />\nSubstitutions—Murphy for Magill,<br />\nGilliece for Middleton, R. Middleton for<br />\nTaylor, Skinner for Bonner, Trimble for<br />\nCromwell, Young for Slowik, Balsam<br />\nfor Coady, Shriver for Councill, Gump<br />\nfor Schact, Adams for Russell, Corson<br />\nfor Wilson, Behan for Adams. Touchdowns— Turnbull (3), Skinner (3),<br />\nCollege Literature<br />\nBalsam, Schact, Middleton. Tries for<br />\npoint—Turnbull, 2, by drop kick; Coa- LOMBARD and SOUTH STREETS<br />\ndy, 2, by drop kick. Referee—O'Brien.<br />\nUmpire—Thomas. Head linesman—<br />\nSigman. Time of quarters-12 min.<br />\nSHOES<br />\nfor<br />\nSATURDAY'S SCORES<br />\n<br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\nc1<br />\n4 COMPANY<br />\n.50<br />\nWARNER /<br />\nHATTERS<br />\n/1T up<br />\n222 W. BALTIMORE ST.<br />\n<br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman & Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br />\n<br />\nG<br />\n<br />\ntlarx<br />\n<br />\n)4.0174(Y. M. B. 0. D.)<br />\nBaltimore & Hanover<br />\n<br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER NORM G<br />\n<br />\nUNIVERSITY MEN<br />\n<br />\nHopkins, 57; Drexel, 0.<br />\nYale, 45; Maryland, 3.<br />\nDickinson, 16; St. John's, 2.<br />\nGeo. Washington, 14; Catholic<br />\nUniversity, 0.<br />\nVirginia, 6; Georgia, 6.<br />\nPrinceton, 10; Harvard, 3.<br />\nArmy, 0; Notre Dame, 0.<br />\nF. & M., 19; Swarthmore, 0.<br />\nCenter, 27; Wash. & Lee, 6.<br />\n<br />\nFor Dress<br />\n<br />\nFor Sport Wear<br />\n<br />\nSmart Styles—Best Leathers<br />\nModerate PricK.-<br />\n<br />\nWYMAN<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\n1$ W. LEXINGTON ST.<br />\n<br />\nBANK WITH<br />\n<br />\nSecurity Storage & Trust Co.<br />\n<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\n<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\n<br />\nINSTRUCTION<br />\n<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\n<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master or<br />\nArts; Doctor of Philsophy.<br />\n<br />\nAS YOU WISH<br />\nHENRY S. KING, President<br />\n<br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br />\n<br />\nFATIMA,<br />\nCIGARETTES<br />\n<br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nSCHOOL OF BUSINESS ECONOMICS.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\n<br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br />\n<br />\nfor TWENTY<br />\nAt this price where<br />\nis the man who can't<br />\nbe discriminating?<br />\n<br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br />\n<br />\nLet Fatima smokers<br />\ntell you<br />\n<br />\nALUMNI MEMORIAL DORMITORY.<br />\nLIGGETT & M YER S TOBtCat) Co.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922.<br />\n<br />\nTHE BOOK MART<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\nENGINEERS SCHEDULE<br />\nBASKETBALL GAME<br />\nA basketball game has been<br />\nPRESCRIPTION DRUGGISTS<br />\n.‘tzuttrarb punk ea. A Column in Which the Correspondents<br />\n• Zilt4Ieiica15<br />\nscheduled between the C. E. and<br />\nAre Allowed Latitude, But ShoulTWO STORES:<br />\nHoliday Books<br />\nder the Responsibility.<br />\nE. E. Juniors for Tuesday, No- Charles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nBeautiful Illustrated Gift Editions,<br />\nAll letters intended for publication vember 14, on the Physical TrainVernon<br />\n0890<br />\nMadison 0405<br />\nmust be concise, written in ink on<br />\nBiography, Travel, Fiction.<br />\nregular letter size paper, on one side ing Court at 4 P. M. The probable<br />\nChildren's Books<br />\nonly.<br />\nOWENS & HECKLINGER<br />\nNo attention will be paid to anony- lineup is as follows:<br />\nFountain Pens and Silver Pencils,<br />\nmous letters, but names signed as an<br />\nE.<br />\nE.<br />\nC.<br />\nE.<br />\nTAILORS<br />\nnot<br />\nevidence<br />\nof<br />\nwill<br />\nfaith<br />\nbe<br />\ngood<br />\nMedical Books of All Publishers<br />\nprinted if request is made that they be<br />\nTebo<br />\nCochran<br />\n,<br />\nomitted.<br />\nMAKERS OF COLLEGE CLOTHES<br />\nat<br />\nThe publication of a letter is not to Stouch<br />\nF<br />\nWysong<br />\n301 N. Charles St.<br />\nbe taken as an indorsement of its views<br />\n18 ST. PAUL ST.<br />\nBALTIMORE, MD.<br />\nby the \"News-Letter,\" which invites the Siegrist<br />\nMartin<br />\nC<br />\nfreest discussion of matters of general<br />\nInterest.<br />\nThomas<br />\nMoehle<br />\nG<br />\nBlack<br />\nG<br />\nDorsey<br />\nYou Have Proceeded from the<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nSublime to the Ridiculous,<br />\nCHRISTIAN SERVICE CLUB<br />\nClass Rings, Pins, Fraternity Pins,<br />\nThe Greetings of a Fine Store<br />\nWilen<br />\nMr.<br />\nIt was incorrectly stated in the<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes To the Editor of The News-Letter NEWS-LETTER of November 7, that<br />\n\"Makers of the Varsity Seals\"<br />\nTo the Students of a Fine University<br />\nSir:<br />\nW. R. Barnhardt was elected presA flood of sophistry from three ident in place of the retiring presSTRATTON SHIRT MAKER<br />\ndifferent<br />\nsources greets me in yes- ident, Custer Cromwell. It should<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 terday's News-Letter. Being in a have stated ,that<br />\nMr. Barnhardt was<br />\nHOCHSCHILDROHN 8C CO.<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25 charitable mood, I shall conde- elected vice-president in place of<br />\nTerms Cash, Less 10% 30 Days on scend to dispose of these printed Mr. Cromwell, the<br />\nretiring viceShirts<br />\nheresies,—first, seriatm, and then president.<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nen masse.<br />\nThe president is Mr. H. M. P.<br />\nM. Everett C. Myers succeeds in Davidson, who succeeds Mr. Paul<br />\nproving that the printer of this B. Stevens. The other officers are:<br />\nFine Clothes<br />\nand individuality is offered here at prices that are not<br />\nMr. William C. Roberts, secreA suit by Lemmert gives the final paper possesses both italic type<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nsatisfaction<br />\nyou and large capitals in great profu- tary.<br />\ntouch to the lasting<br />\nderive from thoroly dependable<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nMr. Gordon Conning, treasurer.<br />\ncloths cut in authentic fashion— sion and does not grudge their<br />\neach sale with a guarantee.<br />\nback<br />\nis<br />\nof<br />\nwhether for every-day wear or more use. Signor J. L. H., in his first<br />\nfestive occasions.<br />\nRIFLE<br />\nTEAM<br />\nSECURES<br />\nTWO<br />\nsentence, uses with commendable<br />\nMORE MATCHES<br />\neffect the superlative degree of an<br />\nLEMMERT<br />\nat<br />\nManager Parks, of the Rifle FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nadjective. Herr C. P. Heinlein, Team has<br />\n19 Fayette Street, East<br />\nbeen able to secure two<br />\nNORTH<br />\nCHARLES<br />\n343<br />\nSTREET<br />\nwhen an infant (I refer, of course, more<br />\nmatches: one with GeorgeBusiness Suits<br />\nDress Clothes to his corporeal<br />\nestate—his cogi- town University on<br />\nMarch 16,<br />\nOvercoats<br />\nSport Togs<br />\ntative faculties, obviously, are still and<br />\none with Boston Tech on<br />\nEvery Automobile Will Be<br />\nin embryo), received from his March 23.<br />\nThese matches will be<br />\nA Much Better Car If<br />\nSHIRTS<br />\nNECKWEAR parents the saintly name of carried on as in previous years,<br />\n\"Christian.\" To think that such each team<br />\nshooting at its own<br />\nP, , - Fro<br />\na priceless heritage was lavished range, and<br />\nthe scores being transupon a renegade!<br />\n421 N. HOWARD ST.<br />\nL<br />\nmitted by telegraph to the rival<br />\n\\<br />\nHow unbounded must be the teams.<br />\nHOSIERY<br />\nGLOVES<br />\negotism of these ungodly creaIs The Motor Fuel Used<br />\ntures, to presume to question the ODDS AND ENDS OF NEWS<br />\nManufactured & Guaranteed by<br />\nEstablished 1873<br />\ndicta of one who is guided by the<br />\nMr. Roland C. Sharretts, '22,<br />\nSHERWOOD BROTHERS, Inc.<br />\nA.H.Fetting Man'fg Jewelry Co. Omni-scient! Can it not pierce captain of last year's baseball team,<br />\nPHONE, VERNON 1212<br />\ntheir sodden intellects that their is at present engaged in teaching<br />\nManufacturers<br />\ndialectics shall- be -futile until English at Baltimore City College.<br />\nGreek Letter Fraternity Jewelry<br />\nthey<br />\nshall have approached me in<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nBefore football practice every<br />\nmatchless sanctity and intense<br />\nday, a game of association football<br />\nvirtue?<br />\nMEN'S SHOES<br />\nI see now that the branding ()Des on at Homewood Field. This<br />\nOf the Better Class<br />\nlaw is sadly inadequate ,and urge game, which should be well atthat a much less innocuous meth- tended, but never is, is played by<br />\nis not merely a trade name<br />\nod of castigation be invented. We Mr. Barney O'Rourke, Mr. Norfor a service, but is also the<br />\nmight invoke the aid of some holy man Keyes, Dr. Ray Van Orman,<br />\ndesignation of a certain type<br />\nURNER BROTHERS<br />\nand noble society, like the Ku and Dr. Ronald Abercrombie. A<br />\nof cab.<br />\nXatter<br />\ni<br />\nl )<br />\nBALTIMORE<br />\nSTREET<br />\nIII E.<br />\nKlux Klan. A layer of tar and large attendance would be appreavIS 1-1.& OSCAR<br />\nBALTIMORE<br />\nfeathers, expertly superimposed ciated. Admission is free.<br />\nOWNERS<br />\nupon the epidermis, would doubt00<br />\n7'1411)<br />\n14/4%/t1c<br />\nPERSIAN SCHOLARSHIPS<br />\nless stimulate their cerebration.<br />\n29 Baltimore St_., East<br />\nThe Board of Trustees has esOne Door West of Light St.<br />\nYours for a resumption of the<br />\ntablished three scholarships yield- 0<br />\nBOLE AGENTS FOR BALTIMORE glorious Inquisition,<br />\nFor College Fraternity Bands<br />\n4<br />\nFrank Wilen. ing free tuition for the benefit of 9<br />\n(Greek Letter Societies)<br />\ngraduate<br />\nor<br />\nundergraduate<br />\nstu- 41<br />\nb<br />\n41<br />\ndents from Persia.<br />\nOver one hundred years<br />\nSOCIAL SCIENCE CLUB<br />\n4<br />\ndesigning and creating<br />\nof<br />\nThe next meeting of the Social<br />\n41<br />\nMUSICAL CLUB PREPARING<br />\nSilverware assures the purPrinters of Philological and<br />\nScience Club will be held on Frichaser of Kirk pieces in<br />\nSCHEDULE<br />\nScientific Works<br />\nday, November 17. President Eissilver absolute certainty of<br />\nContinued from page 1<br />\nenberg is trying to procure either form.<br />\n23 S. HANOVER ST.<br />\nsuperiority.<br />\nhas made it possible for us<br />\nThis requirement will also<br />\nDr. Willoughby or Dr. Thach to hold good<br />\nBaltimore, Md.<br />\nto offer you the most modfor the second concert<br />\naddress the club on the \"British on December<br />\nern Taxicab service in the<br />\n9, at McDonogh<br />\nPolitical Situation.\"<br />\nSchool.<br />\ncountry at the following low<br />\nSARATOGA AT<br />\nThe attendance at the last meetOn Thursday night Mr. Borates:<br />\nLIBERTY STS. ing was very discouraging, both to<br />\n0<br />\nchau held initial try-outs for the<br />\nMr. Eisenberg and to the speaker. quartet. Several<br />\nLUNCHEON<br />\ngood voices 4<br />\n0<br />\nIt<br />\nis very difficult for any speaker showed up, and if<br />\nTEA<br />\npossible the 41<br />\nBaltimore, Md.<br />\nto talk to a lot of empty seats. The quartet will participate<br />\n30c FIRST 1-3 MILE<br />\nin the 4<br />\nDINNER<br />\n4<br />\nmeetings are open to all and are for concert at Franklin<br />\nAmerica<br />\nSilversmiths<br />\nin<br />\nOldest<br />\nHigh School.<br />\nSPECIAL PARTIES<br />\n41<br />\n10c Each Additional 1-3<br />\nthe purpose of developing social, It is expected that their efforts 41<br />\n11.30 A. M.<br />\n41<br />\nEstablished in 1817<br />\neconomic and political thinking. It will be confined to songs<br />\nMile or Fraction Thereof<br />\nwith the 41<br />\nuntil<br />\nhoped that a large attendance lighter themes.<br />\nis<br />\n7.30 P. M.<br />\nPLAZA 6987<br />\n20c for Each Additional<br />\n,,•••• • •<br />\nwill be at the meeting on Friday.<br />\nCONSULAR SERVICE<br />\nPassenger<br />\nCOMMITTEE OF FOOTBALL<br />\nDEGREES CONFERRED<br />\nOPPORTUNITIES<br />\nOver One for the Entire<br />\nCOACHES MEET<br />\nThe degree of Master of Arts<br />\nContinued from page 1.<br />\nContinued from page 1<br />\nThe next consular examination<br />\nhas been conferred upon Miss<br />\nMt. Vernon 4999<br />\nTrip<br />\nCoaches are asked to refuse \"to<br />\nShown on the Taximeter<br />\nTravis Bader, of Virginia, a grad- will be held in Washington, Januate of Goucher College. Miss Ba- uary 15, 1922. Information in re- teach methods of technique and of<br />\nUnder EXTRAS<br />\nder's principal subject was Eng- gard to consular work is now on play contrary to the letter and spirit<br />\nlish, and she submitted an essay file at the Bureau of Appointments of the rules,\" to encourage the<br />\nCommercial Photography<br />\nplayers to respect and accept withentitled \"Barclay's 'Ship of Fools' Office.<br />\nCircuit Photography<br />\nwrangling the authority and deout<br />\nMain Office and Garage<br />\nFlash Lights<br />\nViews in Its Relation to the German<br />\n'22—That<br />\nofficials,\"<br />\nthe<br />\ncisions<br />\nof<br />\na<br />\npicture<br />\nto<br />\nfrown<br />\nof<br />\nyour<br />\ngirl?<br />\nGroups<br />\nEnlargements Original.\"<br />\n1123-1125-1127-1129<br />\n'23—Yes; what do you think of upon \"the win-at-any-price methCATHEDRAL<br />\nKODAK FINISHING<br />\nSTREET<br />\n\"I live by the church,\" replied it?<br />\nods,\" and \"to work in harmony<br />\n325 N. Howard St.<br />\nthe deacon as he pocketed the col- '22—Pretty nice frame, isn't it? with the academic purposes of the<br />\n—Lord Jeff.<br />\ninstitution.\"<br />\nlection.—Yale Record.<br />\n<br />\nHynson, Westcott and Dunning<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nFURNITURE OF QUALITY<br />\nti<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nYELLOW<br />\nCAB CO.<br />\n<br />\nLefranc & Ault<br />\n<br />\nURNER'S<br />\n<br />\nThe Yellow Cab<br />\n<br />\n.016,<br />\n<br />\n......<br />\n<br />\n•or<br />\n<br />\nQuality<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nOf Our<br />\n<br />\nEquipment<br />\n<br />\nSamuelKirk<br />\nand Son Co.<br />\n<br />\nW.L. Mann<br />\n<br />\nStandardization<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 13<br /><br />\nBALTIMORE, MD., NOVEMBER 15, 1922<br /><br />\nBRING ON<br /><br />\nPRICE 5 CENTS<br /><br />\nMARYLAND<br /><br />\nCONSULAR SERVICE OF- COMMITTEE OF FOOTBALL SHOEMAKER ADDRESSES ASFERED AS CAREER FOR<br />\nCOACHES ADOPTS SPORTSSEMBLY ON IDEAL OF<br />\nHOPKINS MEN<br />\nMANSHIP CODE<br />\n--CHRISTIAN LIVING<br />\nDepartment of State Calls Atten- Grid Mentors Give Ideas of Sport Life of Service and Altruism ExEthics. Fair Play Recommended<br />\ntion to Unusual Governtolled. Vatmeman Announces<br />\nOpportunitie<br />\nmental<br />\ns<br />\nas Fundamental<br />\nPlans for Celebrations<br />\nPHILADELPHIANS FAIL TO SHOW ANY SIGNS OF OPPOSIThe Department of State, by a<br />\nEmbodying all principles of fair<br />\nAt last Thursday's assembly,<br />\nTION. EVERY HOPKINS SUB IN GAME<br />\nletter to President Goodnow, calls play, good sportsmanship and Rev. Samuel Shoemaker, a graduIn a contest which can hardly be said to have furnished satisattention to the advantages of the coaching ethics,<br />\na list of sugges- ate of Princeton, delivered an in- factory practice for the Black and Blue gridders, the Drexel Institute<br />\nConsular Service as life work for<br />\ntions adopted by the Sportsman- spiring address on the subject of eleven was buried under an avalanche of scoring at Homewood last<br />\nHopkins men.<br />\nChristian living. Taking an ac- Saturday. When<br />\nDoug Turnbull rolled across the line for the last<br />\nship Committee of the Association<br />\nquaintance of many years as an ex- touchdown the score stood<br />\n.The Consular Service is no lon58-0 and the count might easily have<br />\nger a matter of political plums. By of Football Coaches of America has ample, Rev. Shoemaker brought been doubled had the Hopkins<br />\nfirst string men stayed in the lineup<br />\nan Act of Congress in 1906, the been made public.<br />\nout several vital points in connec- for any length of time.<br />\nAfter the first touchdown had been scored<br />\nConsular Service of the United<br />\nThe elimination of underhand tion with his subject, especially as two minutes after the kickoff, Van Orman<br />\nstarted in his subs and<br />\nStates was reorganized and Execu- spying, the provision of comforts applied to college students.<br />\nbefore the end of the second quarter every available scrub was in<br />\ntive Orders of 1906 and 1919 pro- and conveniences to visiting teams, The man who was considered as the game. Rich, Walbert and Maxwell<br />\nwere the only men kept on the<br />\nvide that appointments to career and cessation of cheering and mak- typical of a class, was a former bench, all three of them nursing bad<br />\nlegs. Captain Tom Landy and<br />\npositions in the service shall be ing of noises while the opposing Princeton prominence, but had Doug Turnbull were the only regulars<br />\nwho remained in the lineup<br />\nmade after examination.<br />\ngeneral is calling signals, are never possessed a wide circle of throughout the rout.<br />\nThe consular officers' work is among the suggestions adopted by friends. After graduatiaL, he enin every department of the<br />\nclosely watched, although he may the committee, of which Major tered his father's business in a city MUSICAL CLUB PREPARING game the Philadelphians were enbe far away from the United Charles D. Daly, of West Point, of the Middle West. Ten years<br />\nINTERESTING SCHEDULE<br />\ntirely outclassed. The Hopkins<br />\nStates. He is given every oppor- is chairman, and which includes later, although financially success- Orchestra and Mandolin Club backfield simply ran wild and few<br />\ntunity to show what he can do, as such well-known names as Heis- ful, he was unhappy and dissatisLose Services of Leader. First plays netted under six yards, while<br />\nwell as credit for all he accom- man, of Penn; Fisher, of Harvard: fied. His marriage was not satisseveral runs of 40 and 50 yards<br />\nConcert at Franklin High<br />\nplishes. All promotions in the ser- \"Tad\" Jones, of Yale; \"Andy\" factory; he lived only for himself,<br />\nThe Mandolin Club and the Or- were pulled off. Taylor and Coady<br />\nvice are determined entirely on Smith, of California, and Stagg, of and, in violation of a promise to his<br />\nsliced off tackle for terrific gains<br />\nfather, he was addicted to drink- chestra are temporarily without a in the<br />\nChicago.<br />\nmerit.<br />\ninitial quarter, while Turnleader on account of the departUnder the paragraph entitled ing. He asserted that he was \"not from the University<br />\nIt is desired to call particular atbull<br />\nbucked<br />\nthrough great gaps<br />\nof Jules L. Sitention to the system now in force \"Fair Play,\" the committee says: interested in religion.\"<br />\nin<br />\nthe<br />\nopposing<br />\nline time and<br />\nThe trouble with this man and monowitz, cellist, who has ven- again.<br />\nby the Department, of training lan- \"Fair play is fundamental to all<br />\nMaurice<br />\nSkinner, who gentured into matrimony. Simonowitz<br />\nguage students at Government ex- sport.\" Their suggestions include many others, Rev. Shoemaker said, was an exceptionally skillful<br />\neraled the team after Buck Bonmupense for service in the diplomatic provision for a fair playing field, is that their idealism is submerged. sicians and his loss is felt keenly. ner was knocked out in the secand consular branches of the for- the setting of the laws of the game, They give \"intellectual questions\" The leadership of the Mandolin ond quarter, chose his plays with<br />\neign service in China and Japan. selection of competent and mutual- as reasons for their lack of religion. Club will be given either to<br />\nM. E. precision and in addition skirted<br />\nAbout fifteen years ago the Gov- ly agreeable officials, and the usage The real reason generally is that Sater or to Kinnamon. These two the opposing ends at will.<br />\nernment provided for the establish- of \"genuine students eligible under they do not have the courage to un- men will each be given a chance<br />\nIf the opposing defense was<br />\nto<br />\nment of an interpreter corps •in amateur rules and the other rules dergo the mental and physical dis- conduct the Mandolin Club during weak their<br />\noffense was nil.<br />\nChina, Japan and Turkey, in order of eligibility governing the • insti- comfort that acceptance of a per- rehearsals. The club will then Throughout<br />\nthe<br />\ngame they gained<br />\nsonal<br />\nreligion<br />\nwould involve. A<br />\nthat it might have available for its tution.\"<br />\nchoose by vote the lead for the 12 yards and lost more than twice<br />\nlack<br />\nof a guiding purpose in life<br />\nown service men trained in the<br />\nThe committee continues: \"Good<br />\nyear.<br />\nthat much when they held the<br />\nis<br />\noften<br />\nthe cause of unhappiness;<br />\nknowledge of the languages, insti- sportsmanship involves fair play,<br />\nball. Their kicks scarcely went<br />\nIt<br />\nhas<br />\nnot<br />\nyet<br />\nbeen<br />\ndefinitely<br />\ndetutions and conditions of these but extends beyond it into the finer a man deserves all the happiness he cided whether<br />\nmore<br />\nthan 25 yards and their<br />\nthe<br />\nMandolin<br />\nClub<br />\ncountries. An effort'has been made expressions of gentlemanliness and can hold.<br />\nkickoffs<br />\nand<br />\nOrchestra<br />\nwere awfully weak. Nearwill<br />\nbe<br />\ncombined<br />\nor<br />\nWhen the Westerner, finally givto obtain for this branch of the chivalry.\" In addition to suggesly<br />\nevery<br />\nHopkins linesman had a<br />\nconducted<br />\nwill<br />\nbe<br />\nas<br />\nseparate<br />\norservice young men, preferably uni- tions mentioned above, it proposes ing in, asked how this happiness ganizations.<br />\nchance<br />\nat<br />\nrunning back a kickoff,<br />\nAt<br />\npresent<br />\nforthe<br />\nversity graduates, who desire to \"applauding an outstandingly bril- could be obtained, Rev. Shoemaker mer<br />\none<br />\nwhich<br />\nof<br />\nmethod<br />\nrolled to the center<br />\nis<br />\nbeing<br />\ntested.<br />\nspecialize in work pertaining to the liant play or demonstration of per- gave him certain advice applicable<br />\nand<br />\nseveral<br />\nothers<br />\nto the guards.<br />\nto the man's particular situation. A special feature of the Musical<br />\nOrient.<br />\nsonal pluck or act of fine sportsTubby<br />\nCouncill<br />\nran<br />\none back 10<br />\nClub<br />\nconcerts<br />\nthis<br />\nyear<br />\nwill<br />\nbe<br />\na<br />\nRev.<br />\nShoemaker<br />\nsaid<br />\nthat<br />\nit is esThe consular officers are appoint- manship on the part of an opsential for a man to get his share saxaphone sextet. M. C. Sater has yards, carrying two would-be<br />\ned to classes instead of to posts as ponent,\" \"treating the visiting team<br />\nof fun out of life. He recommend- charge of this and those who wish, tackles with him.<br />\nformerly, the class determining the and supporters as guests and not<br />\ned a Christian life as one of the to try out for'it are requested to<br />\nThe Black and Blue received<br />\nsalary. They may be assigned or enemies,\" and \"going out of one's<br />\nprincipal sources of the needed report to him.<br />\nthe initial kickoff and tore off first<br />\ndetailed to such posts as the Presi- way to congratulate the coach and<br />\n\"kick.\" Many college gradudtes<br />\ndowns<br />\nIn<br />\nanticipation<br />\nin rapid succession until<br />\nof<br />\nlarge<br />\na<br />\nGlee<br />\ndent may deem advisable, in order captain of the winning team.\"<br />\ncommence their careers with an ab- Club this year, John Sherwood has Turnbull plunged across the line.<br />\nto best meet the needs of the serConcerning coaching ethics, the<br />\nsolute disregard of altruism. Of ordered enough music of each selec- From then on the Hopkins backs<br />\nvice.<br />\ncommittee says: \"Coaching ethics<br />\nthe many opportunities for a life tion for seventy-five voices. Re- were kept busy running the ball<br />\nThe compensation of consular of- concern the ideals and practices of of service,<br />\nsuch as the ministry and hearsals of the Glee Club are held down the field. One more touchficers is low compared with those coaches as expressed in their atti- teaching,<br />\ncollege students accept every Thursday night under the di- down was scored in this quarter,<br />\npaid outside the service. The low- tude toward the school, the team, few.<br />\nBefore leaving college is the rection of Professor Bochau. Try- when Schact recovered a fumble<br />\nest paid position is that of the stu- the rules, and the spirit of the<br />\ntime when ideals should be devel- outs for the .Varsity Quartette were and ran 25 yards to the line. In<br />\ndent interpreter, who receives fif- game. The value and honor of<br />\noped. \"The trouble,\" declared Rev. held last Thursday night.<br />\nthe second quarter Turnbull carteen hundred dollars per annum, football are greatly affected by the<br />\nShoemaker, \"is likely to be sin. The<br />\nThe Musical Club is preparing ried the ball over twice in about<br />\nwhile the highest paid is the Con- ethics, of the coach.\"<br />\nstatement is harsh, and as cutting for its first concert of the year, to four minutes, once with a 17-yard<br />\nContinued on Page 4, col. 4.<br />\nsul-General, who receives twelve<br />\nas a razor's edge, but it is, never- be held at Franklin High School plunge through center.<br />\nthousand dollars per annum. In<br />\ntheless, largely true.\" The speaker on Saturday, December 2. BeToward the end of the half<br />\nPlace of large salaries, the service<br />\nrecommended the four standards cause of nearness of this date, Pearce Coady<br />\nFRESHMEN!<br />\npulled off the most<br />\noffers as compensation to those in<br />\nof Christ—absolute honesty, abso- Manager Vanneman has deemed sensational run<br />\nBRING YOUR BOXES FOR<br />\nof the day when<br />\nit endless opportunities for indilute purity, absolute unselfishness, it advisable to hold two extra re- he dashed,<br />\nFRIDAY'S BONFIRE.<br />\nSHOW<br />\nsidestepped and<br />\nvidual initiative and responsibility,<br />\nMARYLAND WHAT'S IN STORE<br />\nand a love toward people person- hearsals, as follows: A rehearsal squirmed down the<br />\nfield for 55<br />\nand also the advantages of educaFOR THEM.<br />\nally—as the principles upon which of the Glee Club on Tuesday, No- yards. The 150pound halfback<br />\ntion, travel and highest social conour lives should be based.<br />\nvember 21, in the Barn; and a re- started around<br />\nleft end, passing<br />\nCANDIDATES WANTED<br />\nnections in foreign countries.<br />\nA Christian life has its romantic hearsal of the whole Musical his interference after<br />\ncovering<br />\nFOR<br />\nBUSINESS<br />\nSTAFF<br />\nOF<br />\nAs regards examination for enas well as its hard aspects. The Club on Tuesday, November 28, about 15 yards and<br />\nwhen<br />\nit<br />\nlooked<br />\nHULLABAL<br />\nOO<br />\ntrance to the service,- they are for<br />\nthrill of helping others spiritually in the C. E. Hall. The latter will as if he was to<br />\nbe<br />\nforced<br />\nout of<br />\nMEETING<br />\nOF CANDIPosition of consul, vice-consul de<br />\nand materially, and the power to be the final rehearsal before the bounds by three<br />\nopposing<br />\nDATES<br />\nbacks<br />\nIN HULLABALOO<br />\ncarriese, consular-assistant, and<br />\nbe of such help and color to the ex- concert. The extra rehearsals do he completely<br />\nreversed<br />\nthe<br />\nOFFICE WEDNESDAY<br />\nfield,<br />\nstudent interpreter. Only citizens<br />\nistence. In any case, the whole not, of course, affect the regular sidestepping and<br />\nstiff-arming five<br />\n12.20<br />\nof the United States are designated<br />\nmatter resolves itself into a single rehearsals on Thursday nights. tackles, he<br />\ncrossed the gridiron<br />\nfor the examinations; and only unquestion,<br />\nwhich we must answer<br />\nThe official dress of the mem- and dashed down the north sideMEETING OF ALL CANDImarried men between the ages of<br />\none way or the other. That ques- bers of the Glee Club will be the line until he<br />\nDATES FOR DRAMATIC CLUB<br />\nwas brought down on<br />\nnineteen and twenty-six are examPARTS IN STUDIO ON TOP<br />\ntion, said Rev. Shoemaker, is sim- full dress suit. The forty or more the four-yard<br />\nline. Skinner then<br />\nined for appointment as student inFLOOR OF BARN TODAY AT<br />\nply, \"What are we going to do with men who go up to Reisterstown skirted left<br />\nend<br />\nfor the fifth touch4.00<br />\nP.<br />\nM.<br />\nterpreters.<br />\nthe claims of God upon our lives ?\" will be required to wear this uni- down<br />\nand Coady kicked goal.<br />\nContinued on Page 4, col. 3<br /><br />\nBLACK AND BLUE SUBSTITUTES<br />\nOVERWHELM DREXEL<br />\nINSTITUTE ELEVEN, 58-0<br /><br />\nContinued on page 3, col. 1<br /><br />\nContinued on Page 4, col. 3<br /><br />\nContinued on page 3, cat. 2<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922<br /><br />\nR. 0. T. C. TO PARADE BE- FRATERNITIES TO ORGAN- SCHEDULE TO BE ARRANGED<br />\nFOR NEXT YEAR'S FRESHFORE ARMY-MARINE<br />\nIZE BASKETBALL TEAM<br />\nMAN FOOTBALL TEAM<br />\nGAME<br />\nAt the regular weekly meeting<br />\nFOUNDED 1897.<br />\nA motion to appoint an assistThe Johns Hopkins Reserve Ofof the Interfraternity Board held ant manager of football at the end<br />\nbeen<br />\nhas<br />\nCorps<br />\nTraining<br />\n$2.00 ficers'<br />\nSubscription<br />\nlast Monday it was proposed to of the present season to arrange a<br />\ninvited by the authorities who<br />\nan Interfraternity Bas- schedule .for next year's FreshEntered as second-class matter December 3, 1909, at the Postoffice at have charge to participate in the organize<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nman team was passed at a recent<br />\nLeague.<br />\nketball<br />\nArmythe<br />\nlarge parade before<br />\nStadium<br />\nThere are, it seems, a great meeting of the A. A. Board.<br />\nPublished semi-weekly from October to June by the students of Johns Marine game at Venable<br />\nIn the past there has been a<br />\nUniversity.<br />\nOn<br />\nHopkins<br />\non Saturday, December 2.<br />\nmany men in the various fraternideal of difficulty and dissat()Teat<br />\nbehalf of the students in the R. ties who are potential stars and<br />\nBusiness communications should be addressed to the BUSINESS MANbecause of having an orisfaction<br />\ncommunications<br />\nother<br />\nand<br />\n0. T. C., Major Garey has acceptAGER, JOHN HOPKINS UNIVERSITY; all articles<br />\nhave other athletic ganized team with only one or two<br />\nnot<br />\ndo<br />\nwho<br />\nshould be sent to the MANAGING EDITOR.<br />\ned the invitation which also in100<br />\nreserved seats for all those activities to occupy their time games. This difficulty will be<br />\ncludes<br />\nHomewood<br />\nTelephone<br />\ntaking part in the parade. A simi- during the winter months. These eliminated under the new plan.<br />\nThe question of our withdrawlar invitation has been extended men will be given an opportunity<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23.<br />\nto all the colleges in West Vir- to display and develop their skill al from the South Atlantic Track<br />\nGLOVER P. FALLON, '23.<br />\nginia, Pennsylvania and Mary- in the gentle art of basketball if Association was brought before<br />\nManaging Editor:<br />\nthe board. At the present time<br />\nland who have military units. Al- the present plans develop.<br />\nJ. HUDSON HUFFARD, '23.<br />\nAdvertising Manager:<br />\nJohns Hopkins is the only college<br />\nthere will be about<br />\nVANNEMAN,'23.<br />\ntogether,<br />\nK.<br />\nDONALD<br />\nThe only difficulty at present<br />\nAssistant Managing Editor:<br />\nbelonging to both the South Atexis<br />\nit<br />\nline<br />\nand<br />\nin<br />\ntroops<br />\n12,000<br />\n'24.<br />\nJOSEPH S. LEOPOLD,<br />\nis to secure a suitable cage in<br />\nCirculation Manager:<br />\npected that the Hopkins men will which to stage the contests. A lantic and Middle Atlantic AssoAssociate Editors:<br />\nPHILIP W. HOWARD, '25.<br />\nmake a good showing. The line of committee was appointed consist- ciation. It is felt that memberRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nManagers:<br />\nparade will be from Washington ing of Magill, Buhrer and Miller ship in both is too expensive and<br />\nAssistant Business<br />\n'23.<br />\nHEARN,<br />\nC.<br />\nBERNARD<br />\nMonument, north on Charles to try and find some such place too hard on the track team, and<br />\nJunior Editors:<br />\nFITZGERALD DUNNING, '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nstreet to Thirty-third, and east which will be available. The In- these reasons • necessitate the<br />\nD. MILES MARRIAN, '25.<br />\nT. REESE MARSH, '24.<br />\n'25.<br />\nwithdrawal. A committee was apGIESKE,<br />\nDONALD<br />\non Thirty-third street to the StaG.<br />\nRICHARD C. TILGHMAN, '25.<br />\nterfraternity Board will award an<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN W. PARSONS, '25.<br />\ndium. At Hotel Belvedere the pa- appropriate trophy to the frater- pointed to investigate the matter.<br />\nJOHN C. LEWIS, JR., '23<br />\nBENJAMIN T. ROME, '25.<br />\nThe inefficiency of football offirade will be reviewed by General nity whose team has the highest<br />\nat the last few games was<br />\ncials<br />\nPershing, Secretary of the Navy standing at the end of the season.<br />\nIt was suggested that<br />\ndiscussed.<br />\nand Secretary of War.<br />\nThe fraternities are now busily<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nJohns Hopkins make arrangeThe drill last Thursday was engaged in compiling their schoments with St. John's and Marycarried on on Charles street and lastic averages for the second semMd.<br />\nland to procure officials that are<br />\nBaltimore,<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts.,<br />\nthe upper quadrangle under the ester of last year. The scholarship<br />\nboth accurate and reliable for the<br />\nsupervision of Major Garey and cup, which is awarded each semgames between these three<br />\nCaptains Paul, McMurray and ester to the fraternity having the<br />\nBALTIMORE, MD., NOVEMBER 15, 1922<br />\nschools.<br />\nAtwater. The drill was meant pri- highest average, will be presented<br />\nmarily to prepare for the review within the next two weeks.<br />\ngiven before President Goodnow<br />\nTRADITIONS<br />\nFACULTY NOTES<br />\nyesterday at 4.15 P. M., but also<br />\nthe<br />\nreserve<br />\nto<br />\nplan<br />\nthe<br />\nIn<br />\nthe<br />\nof<br />\nabsence of Professor<br />\nCouncil<br />\nThe adoption by the Student<br />\nZIONIST SOCIETY<br />\nprepared the unit for the parade<br />\na<br />\nto<br />\nbirth<br />\ngives<br />\nonly<br />\nSeniors<br />\nof<br />\nLovejoy, who is lecturing in the<br />\nGilman Memorial Room for the use<br />\nHOLDS MEETING<br />\nbe a highly next month.<br />\nbrand-new Johns Hopkins tradition. It should prove to<br />\nof California, the first<br />\nUniversity<br />\nAt the weekly meeting of the<br />\nmemorial should be<br />\nvalued one, for the quiet dignity of this beautiful<br />\nZionist Society, Friday, Novem- quarter of the academic year,<br />\nmuch added to through its exclusiveness.<br />\nPUBLICITY<br />\nBOARD<br />\nPETIber 3, 1922, Mr. I. B. Terlitzky Professor William P. Montague,<br />\ntraditions.\"<br />\nWe frequently hear of an institution as being \"rich in<br />\nTIONS<br />\nTO<br />\na brief lecture on \"The of Columbia Univer'sity, is meetADMISSION<br />\nSTUdelivered<br />\nsmall, have<br />\nAll of the old universities of the countries, large and<br />\nDENT<br />\nZionism.\" Mr. Terof<br />\nACTIVITIES<br />\nHistory<br />\nappear odd<br />\ning the advanced students in phitheir own treasured set of traditions. Some of them often<br />\nof the sois<br />\nlitzky<br />\nvice-president<br />\nCOUNCIL<br />\nbehave<br />\nlosophy, as visiting professor of<br />\nto the mere outsider, but to the son of the institution they<br />\nA meeting of the Student Activ7 ciety and has always taken an ac- philosophy. He spends Thursday<br />\ncome sacred.<br />\nities Council was held last Wednes- tive part in its work at the Uni- of each week in Baltimore.<br />\nFor instance, the custom at a number of the privately established day<br />\nin the Black and Blue Jay's versity.<br />\ninstiThe courses in engineering and<br />\ncolleges of tipping the hat upon passing the monument to the<br />\nMr. Terlitzky explained that,<br />\nat 12:20 P. M., at which<br />\nOffice,<br />\nwithin<br />\nstudent<br />\ndrawing, lately in<br />\nmechanical<br />\nthe<br />\nto<br />\nbut<br />\nvisitor,<br />\na<br />\nto<br />\nodd<br />\nseems<br />\ntution's benefactor<br />\nthe petition of the Publicity Board although the Zionist movement is charge of Dr. Whiteman, have<br />\ntradition.<br />\nthe habit is a treasured<br />\nfor admission to the Council was yet in its infancy, there have been been assigned to Mr. V. L.<br />\nWe have recently published a list of Hopkins traditions, old and<br />\nconsidered. This petition had been at all times through the Middle Doughtie and Mr. J. A. G. Pennew. We hope that in the years to come the list may be augmented<br />\nwill de- presented to the Council some time Ages various attempts made to re- nington.<br />\nby the addition of other worthy customs. Upon their value<br />\nspirit, for ago, but was referred to a commit- turn to Palestine, and that the<br />\npend, to a large extent, the intensity of our institutional<br />\ntee, composed of members of the movement was given a new imProfessor of History—\"What do<br />\nafter all, traditions are fundamentally necessary for spirit.<br />\nre- Council, for investigation. The petus at the time of the French you know of the age of Elizabeth?\"<br />\nIt will, probably, take several years for our latest tradition to<br />\ncer- Council decided to leave the peti- Revolution. The speaker also<br />\nceive its full measure of appreciation, but when it does, it should<br />\nJones (dreamily)—\"She'll be<br />\ntried<br />\nRoom. tion in the hands of the committee mentioned those men who<br />\ntainly do much to add to the dignity of the Gilman Memorial<br />\npracproblem,<br />\nJewish<br />\nnext week.\"<br />\nthe<br />\nnineteen<br />\nsolve<br />\nto<br />\nuntil the next meeting, when it will<br />\nThe inquisitive underclassman of the future may gaze in awe-struck be voted on.<br />\ntheoretically. It is inand<br />\ntically<br />\nwonder from side-entrance, upon 'a scene which might have been<br />\nIt was also decided to withdraw teresting to note that Theodore<br />\ncheapened by its use for restroom purposes.<br />\nthe funds of the Council from the Hertzel, in his \"Jews State,\" had<br />\nOne more rung toward \"rich in traditions.\"<br />\nMercantile Trust and Deposit Co. a full national plan for governand place them in the care of the ment, limiting the working day to<br />\n6 hours and a plan for financing<br />\nUnion Trust Company.<br />\nA few varsity seals were voted the work of this government. The<br />\nAN OLD STORY<br />\nat the meeting Wednesday. All the Zionist activities have drawn the<br />\nThere was a story that used to be told several years ago conrest of the varsity seals to be attention of all the prominent<br />\ncerning a certain well-known \"math\" professor. It ran something awarded this fall will be voted at Jews in the world and has culmilike this:<br />\nthe next meeting of the Council, nated in the present movement.<br />\nStretch the<br />\nwalk<br />\ngroup)<br />\nI<br />\nMath.<br />\nFreshman,<br />\nwhich will be held Wednesday, Mr. Terlitzky also called the atThe prof. had had his class (a<br />\nwith an<br />\nAllowance<br />\ntention of the members to the<br />\nout from the classroom because he was five minutes late. The next November 22, 1922.<br />\nfact that the University Library<br />\ntlay when he demanded an explanation, a trembling Freshie vencontains quite a number of books<br />\nkured,\"We waited five minutes, sir.\"<br />\non Zionism and urged the memLUTHERAN STUDENTS<br />\n\"Five minutes!\" fumed the prof., \"don't you know the rule, sir?<br />\nbers, whenever possible, to read 11\"142°L4a<br />\nBANQUET<br />\nfifteen<br />\nprofessor,<br />\nassociate<br />\nMass production makes<br />\nan<br />\nthem.<br />\nfor<br />\nten<br />\nFive minutes for an instructor,<br />\nA banquet was held last Friday<br />\nfirst cost moderate.<br />\nthe<br />\nfor a professor, one-half hour for the Dean, and all day for me.\"<br />\nin honor of the Lutheran students<br />\nThe<br />\nsimple mechanism<br />\nThat's the old story and it's pretty close to the rule, although the at Goucher College, Johns Hopkins<br />\nNOTICE<br />\nnever gets out of order<br />\n\"hand-shaker\" usually gives his lecturer an extra five minutes of University and the University of<br />\nThere is a gold ring at the \"Lost and each double length<br />\nMaryland. There were more than<br />\ngrace.<br />\nand Found Bureau\" in the \"Y\"-ol- lead offers the same<br />\none hundred students present.<br />\nSome of the new men who do not know the custom have failed<br />\nfice, with the initials \"C. H. S.\" writing service as a 7 in.<br />\nSt.<br />\nof<br />\nTwo<br />\nmembers<br />\nprominent<br />\nwood pencil—atonly1c.<br />\nto wait, while others have waited for a longer period than necessary.<br />\nnumerals '20.\" If any one<br />\nMark's Lutheran Church, where and<br />\nEvery man should wait for at least five minutes.<br />\nthe banquet was held, addressed the has lost a ring answering to this The FEATHERAccording to the rules of good sportsmanship, the student should students. The principal speaker of description please come to the of- WEIGHT— shown<br />\nhere—of lightweight<br />\nallow his prof. the same liberality that is given him. If the prof. is the evening was Rev. Dr. Harsy, fice and identify it.<br />\n50c. Rolled<br />\naluminum<br />\n\"hard-boiled\" on the punctuality question, then the stude needs have of Philadelphia, the Lutheran sec$1.00.<br />\nSilver<br />\nretary for universities and other<br />\nno conscience.<br />\nGeorge—Which car shall I call See this and other modschools, who told the students of<br />\nsome of his experiences. Social for you in tomorrow, the sport or els at your stationery or<br />\ncooperative store.<br />\nfeatures occupied the rest of the the coupe?<br />\nalI<br />\nis<br />\ncar.<br />\nit<br />\nthat<br />\nsimilar<br />\nsport<br />\nand<br />\nlikely<br />\nGertrude—The<br />\nevening,<br />\nIngersoll RedipoInt Co.,Inc.<br />\nWm.H.Ingersoll, ?res.<br />\nDtie,to Armistice Day this issue of The News-Letter is appear- gatherings such as this will fol- ways get cold so much quicker in<br />\n461 Fourth Ave.,New York City<br />\nTuesday.<br />\nthat.—Brown Jug.<br />\nlow.<br />\nIIIMMMMIMNMMMMMEIMMMMMK<br />\ning on Wednesday instead of<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nIngersoll<br /><br />\nPencil<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922.<br />\nSHOEMAKER ADDRESSES<br />\nASSEMBLY<br />\nContinued from page 1<br /><br />\nBLACK AND BLUE OVERWHELM DREXEL<br /><br />\nStevens, President of the Y. M.<br />\nC. A., announced that Rev. Shoemaker, Rev. Bookman, of New<br />\nYork, and Mr. Hamilton, a graduate of Oxford, would discuss the<br />\nsubject of religion immediately after the assembly in Room 110, Mechanical Engineering Building. All<br />\nstudents were invited to attend.<br />\nSherwood announced that a<br />\nFreshman \"Pep\" Committee, to<br />\ntake over the work that the Sophomore \"Pep\" Committee and the<br />\nStudent Council have been doing,<br />\nwould be formed. The Student<br />\nCouncil has decided to close the<br />\nGilman Hall Memorial Room to all<br />\nundergraduates except Seniors.<br />\nSherwood called for an active, energetic school spirit, both on and<br />\noff the campus. He directed the<br />\nstudents' attention to Hopkins'<br />\ngreatest tradition, the Honor System, and recommended that it be<br />\nsupported in all things, both great<br />\nand small. The Cotillon Club is<br />\ngiving the receipts from its dances<br />\nafter games to the Cross Country<br />\nteam. There is a prospect of the<br />\nteam's disbanding if financial sup<br />\nport is not secured. For this reason, the dances should be especially<br />\nwell attended by the students.<br />\nVanneman called for volunteers<br />\nfor various stunts that are to be<br />\nperformed in the St. John's game<br />\nparade. He.asked that plenty of<br />\nwood be brought for the bonfire<br />\nnext Friday night, the eve of the<br />\nMaryland State game. The Freshmen are required to bring at least<br />\ntwo boxes or their equivalent before five o'clock Friday afternoon.<br />\nThe Freshmen were urged to assemble in the upper quadrangle<br />\npromptly at half past one before<br />\nthe games. Yell practice will bo<br />\nheld at the barn daily this week for<br />\nall classes, and the Freshman yell<br />\npractice on Tuesday afternoon<br />\nwill be suspended.<br />\nHay—\"He is sure a farsighted<br />\nman.\"<br />\nDees—\"How so?\"<br />\nHay—\"He had a fire extinguisher put in his coffin.\"—The<br />\nBee.<br /><br />\nContinued from page 1<br /><br />\nSkinner scored the first touchdown in the second half when he<br />\ndashed around left end for 30<br />\nyards after a short kick by Drexel. Coady again kicked goal. The<br />\nlast part of the game was a repetition of the first half except that<br />\nit was the subs instead of the regulars doing the work of piling up<br />\npoints. Skinner, Middleton and<br />\nBalsam continued to carry the ball<br />\nfor big gains and crossed the line<br />\nthree more times before the final<br />\nwhistle sounded.<br />\nScore:<br /><br />\nRomantic Young Flapper—\"Oh<br />\nisn't the moon just splendid this<br />\nevening?\"<br />\nPractical Young Man—\"That<br />\nisn't the moon. That's the clock<br />\non the bank downtown.\" (And<br />\nthey shoot men like Nathan Hale)<br />\nHe--Please give me one more.<br />\nShe—No, you have had one.<br />\nHe—But just one more no one<br />\nwill see, and it means so much.<br />\nShe—\"Really, I am giving no<br />\nseconds today,' said Mrs. Withers<br />\nas she left the dining room.—<br />\nYellow Jacket.<br /><br />\nPrinters of the<br />\nDrexel (0)<br />\nHopkins (57)<br />\nJones<br />\nL E<br />\nMiddleton<br />\nJohns Hopkins News-Letter<br />\nBuckman<br />\nL T<br />\nMagill<br />\nSchelley<br />\nL G<br />\nSlowik<br />\nWilson<br />\nC<br />\nCromwell<br />\nlirftettocetede'<br />\nElm<br />\nR G<br />\nCouncill<br />\nRepp<br />\nR T<br />\nLandy (c)<br />\n. Casner<br />\nSchact .. ...R.E<br />\nWeinberger<br />\nQ B<br />\nBonner<br />\nSchuman<br />\nL H<br />\nTaylor<br />\nCoyne<br />\nR H<br />\nCoady<br />\nLayer<br />\nF B<br />\nTurnbull<br />\nScore by Periods<br />\n12 19 13 13-57<br />\nHopkins<br />\n0 0 0 0— 0<br />\nDrexel<br />\nSubstitutions—Murphy for Magill,<br />\nGilliece for Middleton, R. Middleton for<br />\nTaylor, Skinner for Bonner, Trimble for<br />\nCromwell, Young for Slowik, Balsam<br />\nfor Coady, Shriver for Councill, Gump<br />\nfor Schact, Adams for Russell, Corson<br />\nfor Wilson, Behan for Adams. Touchdowns— Turnbull (3), Skinner (3),<br />\nCollege Literature<br />\nBalsam, Schact, Middleton. Tries for<br />\npoint—Turnbull, 2, by drop kick; Coa- LOMBARD and SOUTH STREETS<br />\ndy, 2, by drop kick. Referee—O'Brien.<br />\nUmpire—Thomas. Head linesman—<br />\nSigman. Time of quarters-12 min.<br />\nSHOES<br />\nfor<br />\nSATURDAY'S SCORES<br /><br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\nc1<br />\n4 COMPANY<br />\n.50<br />\nWARNER /<br />\nHATTERS<br />\n/1T up<br />\n222 W. BALTIMORE ST.<br /><br />\nONE is the -Rah Rah- hat and the Bulldog shoe.<br />\nCollege style today smacks of the same sober,<br />\nsensible style of the business world.<br />\nStein-Bloch and Goodman &amp; Suss Clothes, tailored<br />\nin Rochester, exemplify that idea so well.<br />\nExclusively at—<br /><br />\nG<br /><br />\ntlarx<br /><br />\n)4.0174(Y. M. B. 0. D.)<br />\nBaltimore &amp; Hanover<br /><br />\nCorrect Furnishings for<br />\nthe College Man<br />\nHUTZLER NORM G<br /><br />\nUNIVERSITY MEN<br /><br />\nHopkins, 57; Drexel, 0.<br />\nYale, 45; Maryland, 3.<br />\nDickinson, 16; St. John's, 2.<br />\nGeo. Washington, 14; Catholic<br />\nUniversity, 0.<br />\nVirginia, 6; Georgia, 6.<br />\nPrinceton, 10; Harvard, 3.<br />\nArmy, 0; Notre Dame, 0.<br />\nF. &amp; M., 19; Swarthmore, 0.<br />\nCenter, 27; Wash. &amp; Lee, 6.<br /><br />\nFor Dress<br /><br />\nFor Sport Wear<br /><br />\nSmart Styles—Best Leathers<br />\nModerate PricK.-<br /><br />\nWYMAN<br /><br />\nThe Johns Hopkins University<br /><br />\n1$ W. LEXINGTON ST.<br /><br />\nBANK WITH<br /><br />\nSecurity Storage &amp; Trust Co.<br /><br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br /><br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br /><br />\nINSTRUCTION<br /><br />\nSAVINGS OR CHECKING ACCOUNTS<br /><br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master or<br />\nArts; Doctor of Philsophy.<br /><br />\nAS YOU WISH<br />\nHENRY S. KING, President<br /><br />\nMEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nCOLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nDEPARTMENT OF ENGINEERING. Degrees: Doctor of Engineering; Master of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nChemistry.<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Public Health; Doctor of Science and Bachelor of Science in Hygiene; Certificate in Public Health.<br /><br />\nFATIMA,<br />\nCIGARETTES<br /><br />\nCOLLEGE COURSES FOR TEACHERS. Degree of Bachelor of Science.<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nSCHOOL OF BUSINESS ECONOMICS.<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br /><br />\nJOHN HOPKINS PRESS PUBLICATIONS.<br />\nBUILDINGS<br />\nGILMAN HALL—general library, class rooms, biology, administration.<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nCIVIL ENGINEERING—housing also Geology.<br /><br />\nfor TWENTY<br />\nAt this price where<br />\nis the man who can't<br />\nbe discriminating?<br /><br />\nPOWER HOUSE.<br />\nBOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br />\nCHEMICAL LABORATORY—for graduate work.<br />\nPHYSIOLOGICAL BUILDING.<br />\nANATOMICAL LABORATORY.<br />\nHUNTERIAN LABORATORIES.<br />\nPATHOLOGICAL LABORATORY.<br />\nSCHOOL OF HYGIENE.<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nSTUDENT ACTIVITIES BUILDING.<br /><br />\nLet Fatima smokers<br />\ntell you<br /><br />\nALUMNI MEMORIAL DORMITORY.<br />\nLIGGETT &amp; M YER S TOBtCat) Co.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 15, 1922.<br /><br />\nTHE BOOK MART<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nENGINEERS SCHEDULE<br />\nBASKETBALL GAME<br />\nA basketball game has been<br />\nPRESCRIPTION DRUGGISTS<br />\n.‘tzuttrarb punk ea. A Column in Which the Correspondents<br />\n• Zilt4Ieiica15<br />\nscheduled between the C. E. and<br />\nAre Allowed Latitude, But ShoulTWO STORES:<br />\nHoliday Books<br />\nder the Responsibility.<br />\nE. E. Juniors for Tuesday, No- Charles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nBeautiful Illustrated Gift Editions,<br />\nAll letters intended for publication vember 14, on the Physical TrainVernon<br />\n0890<br />\nMadison 0405<br />\nmust be concise, written in ink on<br />\nBiography, Travel, Fiction.<br />\nregular letter size paper, on one side ing Court at 4 P. M. The probable<br />\nChildren's Books<br />\nonly.<br />\nOWENS &amp; HECKLINGER<br />\nNo attention will be paid to anony- lineup is as follows:<br />\nFountain Pens and Silver Pencils,<br />\nmous letters, but names signed as an<br />\nE.<br />\nE.<br />\nC.<br />\nE.<br />\nTAILORS<br />\nnot<br />\nevidence<br />\nof<br />\nwill<br />\nfaith<br />\nbe<br />\ngood<br />\nMedical Books of All Publishers<br />\nprinted if request is made that they be<br />\nTebo<br />\nCochran<br />\n,<br />\nomitted.<br />\nMAKERS OF COLLEGE CLOTHES<br />\nat<br />\nThe publication of a letter is not to Stouch<br />\nF<br />\nWysong<br />\n301 N. Charles St.<br />\nbe taken as an indorsement of its views<br />\n18 ST. PAUL ST.<br />\nBALTIMORE, MD.<br />\nby the \"News-Letter,\" which invites the Siegrist<br />\nMartin<br />\nC<br />\nfreest discussion of matters of general<br />\nInterest.<br />\nThomas<br />\nMoehle<br />\nG<br />\nBlack<br />\nG<br />\nDorsey<br />\nYou Have Proceeded from the<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nSublime to the Ridiculous,<br />\nCHRISTIAN SERVICE CLUB<br />\nClass Rings, Pins, Fraternity Pins,<br />\nThe Greetings of a Fine Store<br />\nWilen<br />\nMr.<br />\nIt was incorrectly stated in the<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes To the Editor of The News-Letter NEWS-LETTER of November 7, that<br />\n\"Makers of the Varsity Seals\"<br />\nTo the Students of a Fine University<br />\nSir:<br />\nW. R. Barnhardt was elected presA flood of sophistry from three ident in place of the retiring presSTRATTON SHIRT MAKER<br />\ndifferent<br />\nsources greets me in yes- ident, Custer Cromwell. It should<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 terday's News-Letter. Being in a have stated ,that<br />\nMr. Barnhardt was<br />\nHOCHSCHILDROHN 8C CO.<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25 charitable mood, I shall conde- elected vice-president in place of<br />\nTerms Cash, Less 10% 30 Days on scend to dispose of these printed Mr. Cromwell, the<br />\nretiring viceShirts<br />\nheresies,—first, seriatm, and then president.<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\nen masse.<br />\nThe president is Mr. H. M. P.<br />\nM. Everett C. Myers succeeds in Davidson, who succeeds Mr. Paul<br />\nproving that the printer of this B. Stevens. The other officers are:<br />\nFine Clothes<br />\nand individuality is offered here at prices that are not<br />\nMr. William C. Roberts, secreA suit by Lemmert gives the final paper possesses both italic type<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nsatisfaction<br />\nyou and large capitals in great profu- tary.<br />\ntouch to the lasting<br />\nderive from thoroly dependable<br />\nBesides<br />\nthe reputation of an old-established firm<br />\nMr. Gordon Conning, treasurer.<br />\ncloths cut in authentic fashion— sion and does not grudge their<br />\neach sale with a guarantee.<br />\nback<br />\nis<br />\nof<br />\nwhether for every-day wear or more use. Signor J. L. H., in his first<br />\nfestive occasions.<br />\nRIFLE<br />\nTEAM<br />\nSECURES<br />\nTWO<br />\nsentence, uses with commendable<br />\nMORE MATCHES<br />\neffect the superlative degree of an<br />\nLEMMERT<br />\nat<br />\nManager Parks, of the Rifle FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nadjective. Herr C. P. Heinlein, Team has<br />\n19 Fayette Street, East<br />\nbeen able to secure two<br />\nNORTH<br />\nCHARLES<br />\n343<br />\nSTREET<br />\nwhen an infant (I refer, of course, more<br />\nmatches: one with GeorgeBusiness Suits<br />\nDress Clothes to his corporeal<br />\nestate—his cogi- town University on<br />\nMarch 16,<br />\nOvercoats<br />\nSport Togs<br />\ntative faculties, obviously, are still and<br />\none with Boston Tech on<br />\nEvery Automobile Will Be<br />\nin embryo), received from his March 23.<br />\nThese matches will be<br />\nA Much Better Car If<br />\nSHIRTS<br />\nNECKWEAR parents the saintly name of carried on as in previous years,<br />\n\"Christian.\" To think that such each team<br />\nshooting at its own<br />\nP, , - Fro<br />\na priceless heritage was lavished range, and<br />\nthe scores being transupon a renegade!<br />\n421 N. HOWARD ST.<br />\nL<br />\nmitted by telegraph to the rival<br />\n\\<br />\nHow unbounded must be the teams.<br />\nHOSIERY<br />\nGLOVES<br />\negotism of these ungodly creaIs The Motor Fuel Used<br />\ntures, to presume to question the ODDS AND ENDS OF NEWS<br />\nManufactured &amp; Guaranteed by<br />\nEstablished 1873<br />\ndicta of one who is guided by the<br />\nMr. Roland C. Sharretts, '22,<br />\nSHERWOOD BROTHERS, Inc.<br />\nA.H.Fetting Man'fg Jewelry Co. Omni-scient! Can it not pierce captain of last year's baseball team,<br />\nPHONE, VERNON 1212<br />\ntheir sodden intellects that their is at present engaged in teaching<br />\nManufacturers<br />\ndialectics shall- be -futile until English at Baltimore City College.<br />\nGreek Letter Fraternity Jewelry<br />\nthey<br />\nshall have approached me in<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nBefore football practice every<br />\nmatchless sanctity and intense<br />\nday, a game of association football<br />\nvirtue?<br />\nMEN'S SHOES<br />\nI see now that the branding ()Des on at Homewood Field. This<br />\nOf the Better Class<br />\nlaw is sadly inadequate ,and urge game, which should be well atthat a much less innocuous meth- tended, but never is, is played by<br />\nis not merely a trade name<br />\nod of castigation be invented. We Mr. Barney O'Rourke, Mr. Norfor a service, but is also the<br />\nmight invoke the aid of some holy man Keyes, Dr. Ray Van Orman,<br />\ndesignation of a certain type<br />\nURNER BROTHERS<br />\nand noble society, like the Ku and Dr. Ronald Abercrombie. A<br />\nof cab.<br />\nXatter<br />\ni<br />\nl )<br />\nBALTIMORE<br />\nSTREET<br />\nIII E.<br />\nKlux Klan. A layer of tar and large attendance would be appreavIS 1-1.&amp; OSCAR<br />\nBALTIMORE<br />\nfeathers, expertly superimposed ciated. Admission is free.<br />\nOWNERS<br />\nupon the epidermis, would doubt00<br />\n7'1411)<br />\n14/4%/t1c<br />\nPERSIAN SCHOLARSHIPS<br />\nless stimulate their cerebration.<br />\n29 Baltimore St_., East<br />\nThe Board of Trustees has esOne Door West of Light St.<br />\nYours for a resumption of the<br />\ntablished three scholarships yield- 0<br />\nBOLE AGENTS FOR BALTIMORE glorious Inquisition,<br />\nFor College Fraternity Bands<br />\n4<br />\nFrank Wilen. ing free tuition for the benefit of 9<br />\n(Greek Letter Societies)<br />\ngraduate<br />\nor<br />\nundergraduate<br />\nstu- 41<br />\nb<br />\n41<br />\ndents from Persia.<br />\nOver one hundred years<br />\nSOCIAL SCIENCE CLUB<br />\n4<br />\ndesigning and creating<br />\nof<br />\nThe next meeting of the Social<br />\n41<br />\nMUSICAL CLUB PREPARING<br />\nSilverware assures the purPrinters of Philological and<br />\nScience Club will be held on Frichaser of Kirk pieces in<br />\nSCHEDULE<br />\nScientific Works<br />\nday, November 17. President Eissilver absolute certainty of<br />\nContinued from page 1<br />\nenberg is trying to procure either form.<br />\n23 S. HANOVER ST.<br />\nsuperiority.<br />\nhas made it possible for us<br />\nThis requirement will also<br />\nDr. Willoughby or Dr. Thach to hold good<br />\nBaltimore, Md.<br />\nto offer you the most modfor the second concert<br />\naddress the club on the \"British on December<br />\nern Taxicab service in the<br />\n9, at McDonogh<br />\nPolitical Situation.\"<br />\nSchool.<br />\ncountry at the following low<br />\nSARATOGA AT<br />\nThe attendance at the last meetOn Thursday night Mr. Borates:<br />\nLIBERTY STS. ing was very discouraging, both to<br />\n0<br />\nchau held initial try-outs for the<br />\nMr. Eisenberg and to the speaker. quartet. Several<br />\nLUNCHEON<br />\ngood voices 4<br />\n0<br />\nIt<br />\nis very difficult for any speaker showed up, and if<br />\nTEA<br />\npossible the 41<br />\nBaltimore, Md.<br />\nto talk to a lot of empty seats. The quartet will participate<br />\n30c FIRST 1-3 MILE<br />\nin the 4<br />\nDINNER<br />\n4<br />\nmeetings are open to all and are for concert at Franklin<br />\nAmerica<br />\nSilversmiths<br />\nin<br />\nOldest<br />\nHigh School.<br />\nSPECIAL PARTIES<br />\n41<br />\n10c Each Additional 1-3<br />\nthe purpose of developing social, It is expected that their efforts 41<br />\n11.30 A. M.<br />\n41<br />\nEstablished in 1817<br />\neconomic and political thinking. It will be confined to songs<br />\nMile or Fraction Thereof<br />\nwith the 41<br />\nuntil<br />\nhoped that a large attendance lighter themes.<br />\nis<br />\n7.30 P. M.<br />\nPLAZA 6987<br />\n20c for Each Additional<br />\n,,•••• • •<br />\nwill be at the meeting on Friday.<br />\nCONSULAR SERVICE<br />\nPassenger<br />\nCOMMITTEE OF FOOTBALL<br />\nDEGREES CONFERRED<br />\nOPPORTUNITIES<br />\nOver One for the Entire<br />\nCOACHES MEET<br />\nThe degree of Master of Arts<br />\nContinued from page 1.<br />\nContinued from page 1<br />\nThe next consular examination<br />\nhas been conferred upon Miss<br />\nMt. Vernon 4999<br />\nTrip<br />\nCoaches are asked to refuse \"to<br />\nShown on the Taximeter<br />\nTravis Bader, of Virginia, a grad- will be held in Washington, Januate of Goucher College. Miss Ba- uary 15, 1922. Information in re- teach methods of technique and of<br />\nUnder EXTRAS<br />\nder's principal subject was Eng- gard to consular work is now on play contrary to the letter and spirit<br />\nlish, and she submitted an essay file at the Bureau of Appointments of the rules,\" to encourage the<br />\nCommercial Photography<br />\nplayers to respect and accept withentitled \"Barclay's 'Ship of Fools' Office.<br />\nCircuit Photography<br />\nwrangling the authority and deout<br />\nMain Office and Garage<br />\nFlash Lights<br />\nViews in Its Relation to the German<br />\n'22—That<br />\nofficials,\"<br />\nthe<br />\ncisions<br />\nof<br />\na<br />\npicture<br />\nto<br />\nfrown<br />\nof<br />\nyour<br />\ngirl?<br />\nGroups<br />\nEnlargements Original.\"<br />\n1123-1125-1127-1129<br />\n'23—Yes; what do you think of upon \"the win-at-any-price methCATHEDRAL<br />\nKODAK FINISHING<br />\nSTREET<br />\n\"I live by the church,\" replied it?<br />\nods,\" and \"to work in harmony<br />\n325 N. Howard St.<br />\nthe deacon as he pocketed the col- '22—Pretty nice frame, isn't it? with the academic purposes of the<br />\n—Lord Jeff.<br />\ninstitution.\"<br />\nlection.—Yale Record.<br /><br />\nHynson, Westcott and Dunning<br /><br />\nJ. F. Apple Co.<br /><br />\nFURNITURE OF QUALITY<br />\nti<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nYELLOW<br />\nCAB CO.<br /><br />\nLefranc &amp; Ault<br /><br />\nURNER'S<br /><br />\nThe Yellow Cab<br /><br />\n.016,<br /><br />\n......<br /><br />\n•or<br /><br />\nQuality<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nOf Our<br /><br />\nEquipment<br /><br />\nSamuelKirk<br />\nand Son Co.<br /><br />\nW.L. Mann<br /><br />\nStandardization<br /><br />"}], "field_media_file": [{"target_id": 37673, "display": null, "description": null, "target_type": "file", "target_uuid": "f12d14ef-430c-46dd-ac6d-24acb3601462", "url": "http://digital.library.jhu.edu/system/files/2022-03/13027-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13027, "target_type": "node", "target_uuid": "2017ccab-7a11-41f3-bad5-be011ea6df01", "url": "/node/13027"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3c6f4484-0659-4f9d-b868-b6be8bb9ed91"}]}