{"mid": [{"value": 36903}], "uuid": [{"value": "99569f48-f72f-4957-9512-8b72db35e487"}], "vid": [{"value": 36903}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13086-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 14<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br />\n<br />\nUNDERGRADS PRESENT A SIGMA CHI BETA TO HOLD HOPKINS DELEGATES TO ATTEND Y. M. C .A. CONDANCE IN C. E. HALL<br />\nCLOCK TO FORMER REGVENTION<br />\nASSEMBLY<br />\nISTRAR AT<br />\nFunction to Improve Social Relations to<br />\nDr. Mills Speaks on \"Week of Prayer.\"<br />\nNorwood Announces Plans for<br />\nJune Week Funds<br />\n<br />\nBe Restricted to 75 Couples<br />\n<br />\nNine Representatives to Go to Indianapolis<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nCORNELL MAKES LARGE SCORE<br />\nAGAINST HOPKINS AT ITHACA<br />\n<br />\nIn furtherance of its policy in<br />\nThe Hopkins Y. AI. C. A. has<br />\nbettering social relations about the<br />\nselected<br />\nfrom the student body<br />\nUndergraduates of Johns Hop- campus,<br />\nSigma Chi Beta is holding several delegates to attend the Red Eleven Scores 52 Points Ni hile J. H. U. Eleven Is<br />\nkins last Thursday at assembly its initiation dance in public rather<br />\nUnable to Approach Goal<br />\npresented a clock to Mr. Thomas than in private, as has been the cus- Ninth International Convention of<br />\nthe<br />\nStudent<br />\nVolunteer<br />\nMovement,<br />\nR. Ball as a token of their affec- tom in previous years. Freshmen<br />\nHopkins received its worst gridtion and of their appreciation of and non-fraternity men will have which will be held at the Codle FROSH-SOPH GRID BATTLE<br />\niron defeat in several years last<br />\nMAY SHAKE NEOPHYTE<br />\nhis long and faithful service. Ran- full opportunity to get a better idea Tabernacle, in Indianapolis, from<br />\nDecember<br />\n28<br />\nto<br />\nJanuary<br />\n1,<br />\n1924.<br />\nSaturday<br />\nwhen the \"Big Red<br />\ndolph Norwood, president of the of representative social life than has<br />\nSHACKLES<br />\nThe<br />\nmen<br />\nwho<br />\nwill<br />\nrepresent<br />\nHop.<br />\nStudent Council, made a brief ever before been offered in any<br />\n20 Men Report for Initial Practice Eleven\" of Cornell University<br />\nkins at this convention will be T.<br />\npresentation speech, in which he Hopkins social<br />\nHaving beaten the Sophomores piled up a score of 52 points<br />\nfunction in years. R. Marsh, E. P. Sylvester, Walter<br />\nmentioned those characteristics of<br />\nat baseball, the freshmen are look- against the Black and Blue warElaborate preparations are being<br />\nthe former registrar which en- made by Sigma Chi Beta for the Sullivan, Philip Pease, A. M.<br />\ning forward to the day that their riors. The vanquished team put<br />\ndeared him to Hopkins students. Harvest Ball, Saturday, November Cleveland, Miss Maude Kemp and<br />\nfootball team battles with that of up a stiff fight throughout the<br />\ntwo others to be selected.<br />\nIn the fall of 1876, the Johns 24, at 8:30 P. M., the public dance<br />\nThese conventions are held once the second year men. A victory contest but Cornell proved far too<br />\nHopkins University held its first at which the initiation<br />\nof the newly in a student generatiozi and the<br />\nBall<br />\nfor them means the abandonment strong for them from start to finMr.<br />\n1878,<br />\nclasses; in January,<br />\npledged men to the society will last was in Des Moines, Iowa, in<br />\nperish. The local players accomcame to Johns Fropkins, first<br />\ntake place. C. E. Hall, the scene 1920, with 6,890 delegates repre- of those shackles which distinplished<br />\none feat in the game which<br />\nforming the duties of a registrar of the festivities, will<br />\ndon the senting 949 institutions. The pur- guish them from their higher asno other team has succeeded in<br />\nwithout actually bearing the title. multi-colored<br />\nsociates. The Sophomores themmantle of autumn<br />\ndoing this fall; they held Cornell<br />\nA few years later he was officially for the occasion. Pumpkins, scar- pose of these conventions is to<br />\nselves having realized this have scoreless<br />\nduring one quarter, the<br />\nmade registrar; and he held his let leaves and shocks of corn realize the critical needs and possibilities of the situation in the started practice in earnest in or- third. This is<br />\nposition until_the beginning of the will abound while it<br />\nregarded as an act<br />\nis rumored world today, to consider the reder to prolong their joyous privi- of note by the Hopkins coaches as<br />\npresent academic year.<br />\na harvest moon will smile be- sponsibilities of the Christian stulege of tantalizing the \"green\" the New Yorkers have always<br />\n\"Why Mr. Ball, resigned is, in nignly down upon the<br />\ndancers for dents of Canada and the United<br />\nmanaged to add to their score in<br />\nplain English, his own business,\" one veiled moonlight dance.<br />\nCider, States in the light of this situa- ones.<br />\ncertainly<br />\n\"but<br />\nevery<br />\nNorwood,<br />\nperiod against the other<br />\nsaid<br />\nIn their game against Gilman<br />\nsweeter by far than the nectar of tion, to consider Christ and His<br />\nof<br />\nquestion<br />\nany<br />\nnever<br />\nelevens<br />\nthere was<br />\nwhich they have met.<br />\nthe gods, will fill the brimming bowl way of life as the hope of the the \"frosh\" loked pretty good, and<br />\nthe efficiency of his office, nor of to overflowing and will<br />\nHopkins Plays Defensive Game<br />\nadd hugely world, and to present the foreign when they put up a good fight<br />\nCornell's heavy line was imhis own unusual fitness for the po- to the zest of the<br />\ndancers. The or- missionary enterprise in the light with Poly, all<br />\nthat their followers pregnable to the J. H. U. backsition. Mr. Ball has made himself chestra will<br />\npresent a novel effect of its achievments as an indispencould prophesy was a sure defeat field. During the first part of the<br />\npersonally acquainted with every in the way<br />\nof unusual costume. sable means of bringing the power<br />\ngame, Taylor, at quarterback,<br />\nman who graduated from Johns Members of<br />\nthe Dance Committee of Christ to bear upon the world's of the Sophs. But in their last<br />\nHopkins; in the wonderful.'card insist, however,<br />\ngame, the yearlings didn't play called for plays to test the defenthat the hayseed ef- needs.<br />\nsive powers of the Ithaca squad,<br />\nindex' which he carries in his mind fect ends with<br />\nthe rural attire and<br />\nThe convention will be opened What could be termed anything failing each time to<br />\nhe has a place for every Johns will in no way<br />\ngain appreciaimpair the quality of with four addresses dealing with like football. They were light,<br />\nbly. After proving that his team<br />\nHopkins student.\" Norwood said music<br />\nto be played.<br />\nthe four great themes which are played ragged, and pulled a num- was unable to do<br />\na a few words more about Mr. It is planned<br />\nany serious damto have five program being<br />\ndiscussed<br />\nin<br />\ncolleges ber of -bonehead\" plays. They age to his opponents through the<br />\nBall's friendliness, and then pre- dances<br />\none of which will be the throughout the country this fall,<br />\nshowed that they couldn't play line, Taylor called for a kick<br />\nsented the clock.<br />\ninitiation dance. In this dance the \"Modern Industrialism,\" \"Racial<br />\nacceptance,<br />\nagainst heavier men. On top of whenever Hopkins got the ball.<br />\nspeech<br />\nof<br />\nIn a short<br />\nmembers will line up on one side Relations and Christian Brotherthat a few of their men have been The Hopkins team was forced to<br />\nability<br />\nMr. Ball said he feared his<br />\nwhile the pledges line up directly hood,\" \"Present Day Social and<br />\ndeclared<br />\nhad<br />\nfaces<br />\nineligible to play as play a defensive game by. the suto remember names and<br />\nopposite. The pledges will then be Intellectual Unrest\" and \"InternaFreshmen.<br />\nNeuberger, former perior defensive strength of Coach<br />\nbeen somewhat over-rated, since<br />\npresented with red carnations, the tional Problems and the Christian<br />\nFriends School star, and Schloss- Dobie's great machine.<br />\nthe rapid growth of the university<br />\nflower of the society, which stands Way of Life.\" The speakers will<br />\nberg, a heavy linesman, have been<br />\nThe ball was in the possession<br />\nafter its removal to Homewood for valor. After this<br />\nceremony the be men and women who are recdeclared by the Student Council of the Cornell team most of the<br />\nhad made it increasingly difficult dancing will become general.<br />\nThe ognized as authorities of the highas social Sophomores, and thus in- time and Hopkins was forced to<br />\nto be intimately acquainted with Dance Committee<br />\nhas<br />\nfound<br />\nit nec- est order in their respective fields,<br />\neligible to play for either side. fight in its own territory for the<br />\nall the students. Mr. Ball ex- essary to<br />\nlimit the number of tick- and will include the ablest stuTheir loss will be keenly felt by greater part of the game. The batpressed his sincere appreciation of ets to be<br />\nplaced on sale to seventy- dents of the industrial, internaCoach Landy, and is a good stroke tering ram attack of Pfann and<br />\nthis evidence of the undergradu- five.<br />\nThese tickets may be obtained tional and social movements of the<br />\nfor the Sophs. Yet in Grinsfelder, Ramsey gave the Baltimoreans<br />\nates' good will.<br />\nfrom members of the Society for day, at home and abroad. The<br />\nCone, Brian, Stone, Steinwald, good practice in stopping swiftly<br />\nThe presentation was attended the sum<br />\nof -two dollars. Early ap- needs and conditions peculiar to<br />\nLaDean<br />\nGoodnow,<br />\nBrown and Franck, the first-year moving players; practice of a seriby President<br />\nContinued<br />\non<br />\ntheir<br />\nown<br />\nPage<br />\n3,<br />\ncol.<br />\npeople<br />\nI<br />\nwill<br />\nbe<br />\ntreated<br />\nBuchner,<br />\nDr.<br />\nmen have excellent material, and ous kind which cost Hopkins a<br />\ntane, Dr. French,<br />\nby nationals and leaders of the the Sophs have to be wary of great loss in yards. By hard<br />\nRev...11. C. Dixon and Rev. Victor<br />\ndrivOMEGA BETA PI PRE-MED. Christian movement will suggest them.<br />\nG. Mills, pastor of Grace Methoing at all points of the line, the<br />\nFRATERNITY AT HOPKINS the meaning of the \"Way of<br />\nRegular practice has started for red-sweatered eleven plowed clown<br />\ndist Episcopal Church, who adA new organization will join the Christ\" in the present day world. the Sophomores, as they must the field repeatedly,<br />\ndressed the assembly on \"A Week<br />\nthrusting<br />\nranks of the honorary fraternities<br />\nhave<br />\na<br />\nmonth<br />\nof<br />\nof Prayer for Young Men.\"<br />\norganization<br />\nbeaside<br />\n-the<br />\nplucky<br />\nwearers<br />\nof the<br />\non the Hopkins campus when the 0. D. K. TO HAVE INITIATION fore they will be allowed to play Black and Blue. Coach Van OrDr. Mills Addresses Assembly<br />\nThursday's assembly will be<br />\ntheir opponents on December 15. man's charges finally caught on to<br />\nDr. Mills declared that his sub- Hopkins chapter receives its char- marked by the public initiation<br />\nof<br />\nCoach \"Happy\" Middleton has as- the lightning-like plays of the<br />\nject, at first glance, seemed futile ter from Omega Beta Pi, a national Omicron<br />\nDelta Kappa Honorary<br />\nsumed charge of the tutelage job, home team, holding them on<br />\nand queer. Young men in college pre-med. fraternity.<br />\nFraternity. Following custom the<br />\nOmega Beta Pi was founded at<br />\nand with his experience ought to downs twice within 15 yards of<br />\nare at an age when the feeling of<br />\nnames of the new men will not be<br />\nbuild up a team strong enough to the goal.<br />\nindependence is at its height; and the University of Nebraska. Its made public<br />\nuntil they are anpurpose<br />\nhere<br />\nis<br />\ntogether<br />\nto<br />\nbring<br />\nseems<br />\nglance<br />\nbeaf<br />\nCornell Field Muddy<br />\nthe frosh. In the backfield<br />\nfirst<br />\nprayer, which at<br />\nnounced at assembly. The laurel<br />\nthe<br />\nbest<br />\ntypes<br />\nJunof<br />\npre-medical<br />\nAt<br />\nnot<br />\nthe<br />\nstart of the game Hopweakness,<br />\nis<br />\nhe<br />\nan admission of<br />\nhas plenty of material. Baldleaf will be pinned on the new men<br />\niors<br />\nand<br />\nSeniors,<br />\nin<br />\nthem<br />\nand<br />\nto<br />\nget<br />\nkins<br />\nfeeling.<br />\ntried<br />\nto gain around the ends<br />\nwin, Chesney, Sauerwein, McKay,<br />\ncompatible with this<br />\nand then a prominent alumnus will<br />\ntouch<br />\nwith<br />\nthe<br />\nSchool<br />\nMedical<br />\nbebut<br />\nthe deep mud on the field<br />\nCrook, Draper, and \"Bob\" MiddleMoreover, this age marks the beaddress the assembly and the new<br />\nton look good, and with proper served to slow down the speed of<br />\nginning of thought, of piercing ex- fore they actually enter it. The members.<br />\ntraining ought to come through the backs. The greater weight of<br />\namination of childhood customs members must stand well in the<br />\nIn the evening there will be a<br />\ngloriously. On the line there is the Northerners gave them an adthat were previously taken as mat- pre-medical subjects. Before a formal<br />\nbanquet and a private initiaters of course. Young men are man may join he must be approved<br />\nKaufholz, Webster and Welsh out vantage on the slippery field, of<br />\ntion at the Southern Hotel, which<br />\napt to regard prayer as a part of by the heads of the departments of<br />\nfor tackle; Armiger, Wolf and which they made good use. The<br />\nwill be attended by the entire unKaplan out for guards; Sanderson great quantities of mud interfered<br />\nchurch service, but not as a thing Physics, Chemistry and Biology. dergraduate membership,<br />\nthe noviThe Hopkins chapter is an outto be considered in their daily<br />\noccuping center, and Homer, seriously with the kicking of both<br />\nContinued on page 4. col. 5<br />\nc-rowth of the local fraternity Psi<br />\nlives.<br />\nTownsend, Thomsen, Love teams, causing the punters to fail<br />\nN'Iu,<br />\nwhich<br />\nyear.<br />\nwas<br />\norganized<br />\nlast<br />\nGod<br />\nto<br />\nBrown and Ball to pick from for to kick as far as they are able on<br />\n\"If prayer is an aproach<br />\nNOTICE<br />\nThe<br />\nsixteen<br />\nhave<br />\nmembers<br />\ncharter<br />\nClaus,\"<br />\nends. The men seem to have a dry field.<br />\nas to a magnified Santa<br />\nFellowship Dinner<br />\nsaid Dr. Mills, \"and if it is used as been approved by Professoi-s Bliss,<br />\nHopkins held the stronger team<br />\ntaken the affair seriously, as they<br />\nof the Hopkins Y. M. C. A.<br />\na last cringing resort, then it is a Carteledge and Cowles. On Nointend playing a few games to to one touchdown in the opening<br />\nwill be held this evening<br />\nget the experience. If they play period of the game, but the rapidthing of weakness, unworthy of vember 29 they will be initiated at<br />\nat the<br />\nGilman and Poly second teams, it ity with which Cornell's plays<br />\nmen. Prayer is not of this nature, the Hopkins Club by a committee<br />\nFriends Meeting House<br />\nhowever; it has a real signifi- consisting of a man from the Uniwill be easier to compare them were executed baffled the local<br />\n3107 N. Charles St.<br />\nversity of Chicago, one from the<br />\ncance.\"<br />\nwith the frosh, who have tri- boys in the second quarter and at<br />\nP.<br />\nM.<br />\n6.00<br />\nover Gilman, only to lose the end of the first half the score<br />\numphed<br />\nThe speaker referred the audi- Harvard Medical School, and one<br />\nEverybody Out!<br />\nSchool.<br />\nMedical<br />\nHopkins<br />\nthe<br />\nfrom<br />\nPoly.<br />\n2<br />\nto<br />\ncol.<br />\nContinued on page 3 col. 1<br />\nContinued on page 3,<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br />\n<br />\nyouth, golf, and the effect of womTo the Editor of the Johns<br />\nan in choosing man's clothes are<br />\n• Hopkins NEWS-LETTER:<br />\nfive of these reasons. We can cheerWhat is the matter with the Pub<br />\n\"Up and down the Avenue they fully assimilate that much punishFOUNDED 1897<br />\nlicity Board?<br />\nment; but, when she drags in Ed: swing, clothed in soft tweeds and<br />\nEvery Sunday I get a copy of -al,<br />\nward, Prince of Wales, as dictator<br />\n$2.00 New York Times and scan the sport woolens, shirts shaming the rainSubscription<br />\nof<br />\nthe world of men's fashions, and<br />\n-.11eet for some news about the Hop- bow, ties agleam in the sun. They<br />\nshe blames the \"appeal—conwhom<br />\nkins football games. Only once are the new Dappers and the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nscious<br />\nor<br />\nunconscious—of the clothhave I seen anything about my Alma Smarts.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\ning advertisement,\" we squirm.<br />\nlater and that was the day after \"The old dandies had lace at their<br />\nEvery time the Prince dents his<br />\nPublished semi-weekly from October to June by the students of Johns the Western Maryland game. No sleeves' ends and red heels clicking<br />\nhat<br />\nin a different manner, says Miss<br />\nHopkins University.<br />\nmention was made of the Haver- on their shoes. They made an art<br />\nRead, the world of men eagerly folford, Albright or the St. John's of dress, and their art was their<br />\nBusiness communications should be addressed to the BUSINESS MAN- games at all—not even in the scores life. They needed no further ex- lows suit. Yes, \"if you want to<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nknow why our men are taking to<br />\ncolumn, where are listed the results cuse for being, no business or proshould be sent to the MANAGING EDITOR.<br />\ntweeds and plus fours you must folof practically every game of note fession to interfere with ,their sarlow the advice of the unforgettable<br />\nthe entire country.<br />\nin<br />\ntorial devotions. Even in their heyHomewood 100<br />\nTelephone<br />\nKiki and ask the Prince of Wales.\"<br />\nIt seems to me that the Publicity day they were comparatively few.<br />\n* * *<br />\nBoard should see to it that Hopkins They flourished only among the<br />\nWe have decided never to take<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ngets newspaper recognition abroad very idle and the very rich. Society<br />\nJOSEPH LEOPOLD, '24<br />\nup<br />\nsteeple-chasing, and hereby solPHILIP W. HOWARD, '25<br />\nas well as at home. Certainly some obviously couldn't afford to support<br />\nemnly<br />\nswear never to join an InEditor<br />\nManaging<br />\none is to blame and the negligence too many of them. They were a<br />\nAdvertising Manager<br />\ndian<br />\ntribe,<br />\nwear farmer's clothes,<br />\nWILLIAM G. DEAN, JR., '24<br />\nshould be remedied at once.<br />\npretty decoration, a sort of sacriFITZGERALD DUNNING, '24<br />\nnor<br />\nshoot<br />\ntigers<br />\nin India.<br />\ndo not know whether Hopkins fice to Narcissus and Apollo and<br />\nAssistant Managing Editor<br />\nAs<br />\nfor<br />\nthe<br />\nclothing<br />\nManager<br />\nad—we start<br />\nCirculation<br />\nis better advertised in other cities the other symbolic figures of male<br />\nT. REESE MARSH, '24<br />\na<br />\npetition<br />\nto<br />\nremove<br />\nthe<br />\nArrow ColJOHN C. LEWIS, JR., '24<br />\nor not, but if this condition is uni- beauty and vanity. . . .<br />\nAssociate Editors<br />\nversal it is no wonder that people \"The new dandyism is demo- lar plate from Tge Black and Blue<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25<br />\noutside of Maryland know Hopkins cratic. The affluent merchant and Jay.<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nWe will be independent.<br />\nBENJAMIN T. ROME,'25<br />\nonly as a medical school.<br />\nthe grocer's clerk, the school teacher<br />\nG. DONALD GIESKE,'25<br />\nEditor,<br />\npub'hope<br />\nI<br />\na<br />\nMr.<br />\nas<br />\nyou,<br />\nand the professional athlete, all are<br />\nJOHN T. DIXON,'24<br />\nJunior Editors<br />\nlicity man, will lend your efforts to part of it. . . .<br />\nA. J. McKAY,'26<br />\nW. EDWARD THOMSEN, JR., '26<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE TOVELL,'24<br />\ncorrect this deficiency.<br />\n\"This democratic dandyism is<br />\nERNEST A. STRATHMAN, '26<br />\nJ. KETLER, III, '26<br />\nOTHO<br />\nSincerely, ,<br />\nevinced in many subtle ways. Men<br />\nALGER G. Hiss, '26<br />\nJ. JACKSON KIDD, '26<br />\nEDWARD 0. MICHEL, '26<br />\nAN ALUMNUS.<br />\nare waking to a consciousness of<br />\nT. STRAN SUMMERS, '25<br />\nCHARLES G. HUTZLER, '24<br />\nNovember 13, 1923.<br />\ndecorative possibilities in their<br />\nclothes.<br />\nThey are spending more<br />\nMember Southern Intercollegiate Newspaper Association<br />\nHULLABALOO CONTRACTS of their income to make themselves<br />\npresentable. Their ingrained fear<br />\nSIGNED<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncolor is disappearing—as ties and<br />\nof<br />\nContracts for printing, binding,<br />\n1923<br />\n20,<br />\nsuits<br />\nand handkerchiefs will testify.<br />\nBALTIMORE, MD., NOVEMBER<br />\nengraving and photographs of the<br />\nHullabaloo have been signed. They want clothes for every occaand binding will be han- sion, knickers for sports wear, coats<br />\nPrinting<br />\nBETA<br />\nA SUGGESTION TO SIGMA CHI<br />\nby<br />\ndled<br />\nthe Read-Taylor Com- for the opera unlike their coats for<br />\nSaturThe Hopkins football squad was welcomed to Cornell last<br />\nThe<br />\npany.<br />\nBureau of Engraving the office. There is a new affinity<br />\nday by a delegation of young men, each of whom wore on his breast<br />\nOU bet he is! He's making a trebetween men's clothes and women's<br />\nmendous hit! She has just told<br />\na small red key. This delegation attached itself to the squad and, of Minneapolis has been awarded<br />\nhim that he has hair like Rudy<br />\n—observed in such articles as Deauis<br />\nThis<br />\nthe<br />\ncompany<br />\nengraving.<br />\nthe<br />\nbetween<br />\ngame,<br />\nthe<br />\nBut he doesn't know<br />\nBefore<br />\nValentino's.<br />\nhosts.<br />\nas<br />\nacted<br />\nday,<br />\nthroughout the<br />\nwhether to pretend that it came that<br />\nville scarfs and coonskin coats and<br />\nannual<br />\ncollege<br />\nthe<br />\nin<br />\nknown<br />\nwell<br />\nconwere<br />\ndelegation<br />\nhe did it with his<br />\nway<br />\nthat<br />\nconfess<br />\nor<br />\nthis<br />\nof<br />\nmembers<br />\ngame,<br />\nthe<br />\nhalves and after<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\ngiddy sweaters for sport.\"<br />\nmany<br />\nfor<br />\nhaving<br />\nwork<br />\ndone<br />\nworld,<br />\nSaturday<br />\nservice.<br />\nmanly beauty to<br />\nhis<br />\nof<br />\nlot<br />\na<br />\nowes<br />\nHe<br />\ninvaluable<br />\nof<br />\nbe<br />\nto<br />\nproved<br />\nstantly on hand and<br />\n* * *<br />\nthat bottle. \"Vaseline\" Hair Tonic<br />\nyear<br />\ncountry's<br />\nlargest<br />\nthe<br />\nof<br />\nkeys\".<br />\nthe hair and<br />\nof<br />\ngrowth<br />\n\"red<br />\nthe<br />\npromotes<br />\nthe<br />\nand<br />\ndance<br />\na<br />\nto<br />\ninvited<br />\nnight the entire squad was<br />\nkeeps the scalp in the healthiest conThe modern trend of male perwill<br />\nStudio<br />\nAtelier<br />\nThe<br />\nbooks.<br />\nof<br />\nand student<br />\nstores<br />\ndrug<br />\nwelfare<br />\nall<br />\nAt<br />\ndition.<br />\nthe<br />\nfor<br />\ncaring<br />\nand<br />\npartners<br />\nwere in evidence, providing<br />\nbarber shops.<br />\ndecoration<br />\nbrought<br />\nsonal<br />\nfrom<br />\nthis<br />\nphotographs.<br />\nthe<br />\nof<br />\ncare<br />\ntake<br />\nuntil<br />\nleave<br />\nnot<br />\ndid<br />\nteam<br />\nthe<br />\ntheir guests. And, despite the fact that<br />\nCRESEBROUGH MFG. CO.<br />\nAll individual photographs must the pen of Ellery Rand, a former<br />\n(Consolidated)<br />\nnearly midnight, several members of the delegation were at the staNew York<br />\nStreet<br />\nState<br />\nis<br />\nit<br />\nBaltimorean,<br />\nsaid.<br />\nMiss<br />\nRand<br />\nSlips<br />\nbe<br />\nduring<br />\nNovember.<br />\ntaken<br />\ntion in case there should be anything to be done.<br />\n—for rumor has it that this recordThe impression that the Hopkins football team received of Cor- may be obtained from William<br />\nof masculine fashions is a Miss—<br />\ner<br />\npictures<br />\nAs<br />\nas<br />\ngroup<br />\nDean.<br />\nmany<br />\nnell was a most favorable one and it was wholly imparted by the<br />\ngives<br />\nseven reasons in a recent artmonth.<br />\nthis<br />\ntaken<br />\nbe<br />\nwill<br />\npossible<br />\ncourtesy and attention bestowed by these members of the \"Red Key<br />\nicle<br />\nin<br />\nthe New York Times why<br />\ntaking<br />\nfor<br />\n.dates<br />\nof<br />\nschedule<br />\nA<br />\nSociety,\" an organization which has as its sole purpose the care and<br />\nmere<br />\nhas become color blind.<br />\nman<br />\nprepared.<br />\nbeing<br />\nis<br />\ngroup<br />\npictures<br />\nentertainment of visiting teams. Every Hopkins man who was on<br />\nEvery\"Vaseline\" Product is recommended everyimportation from<br />\nWar<br />\nreaction,<br />\nbe<br />\npostwill<br />\nwhere because ofitsabsoluteburityandeffectiveness.<br />\nthe trip will always carry in his mind the remembrance of \"Red Key\" Fraternity pictures<br />\nabroad by travelers, fearlessness of<br />\nseason.<br />\nrushing<br />\nafter<br />\nponed<br />\nuntil<br />\nhospitality.<br />\nSigma Chi Beta has, as yet, found no definite practical purpose<br />\n•<br />\nto justify its existence. It is an ideal organization for carrying out<br />\nthis<br />\nthat<br />\nsuggest<br />\nwe<br />\nsuch a program as does \"Red Key.\" May<br />\nHopkins body inquire further into the workings of the Cornell society.<br />\nWe feel that invaluable service can be rendered Hopkins in this<br />\nmanner.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nM{iyb© So<br />\n<br />\n_C<br />\n<br />\nTHRILLED?<br />\n<br />\nY<br />\n<br />\nVaseline.<br />\n<br />\nHAIR TONIC<br />\n<br />\nSILVER LINING<br />\nFighting gamely from whistle to whistle, the Hopkins football<br />\nteam found it impossible to stop the smashing line plunges and offtackle plays of the powerful Cornell eleven last Saturday. Despite<br />\nthe seemingly overwhelming score, however, there were several<br />\nbright spots in the game. Newspaper men, accustomed to seeing<br />\nthe \"Big Red team\" pile up the score on visiting elevens, were<br />\nunanimous in their praise of the spirit and gameness of the light<br />\nBaltimoreans. That Hopkins was battling every inch is illustrated<br />\nby the fact that the third quarter of Saturday's game was the first<br />\nperiod in which the Ithacans have not crossed the goal line of an<br />\nopponent during the present season. Cornell undoubtedly possesses<br />\nan eleven which ranks among the best three in the country and<br />\nthe final result of the game is not disappointing to the Hopkins<br />\ncoaches.<br />\nAnd, despite the gloomy predictions of local newspaper scribes,<br />\nCornell did not succeed in crippling the entire Hopkins squad. On<br />\nthe contrary, no one is suffering from more than the usual bruises<br />\nwhich are always prevalent after a hard-fought battle. Perhaps the<br />\ndefeat by the Ithacans will prove a blessing in disguise. It undoubtedly establistied an \"esprit de corps\" which has been more or<br />\nless lacking during the present season. And it gave the backs excellent defensive practice which they have .not had since the Princeton<br />\ngame.<br />\nCoach Van Orman is not at all pessimistic over the outcome of<br />\nlast Saturday's game. It is true that he is not saying much. We<br />\nfeel, however, that this is an omen of \"something brewing.\" There<br />\nare but ten days before the Maryland game and there is much that<br />\ncan happen in this time.<br />\nLast week we said: \"It can be done.\" We repeat it!<br />\n<br />\n1-3<br />\n<br />\nIi<br />\n<br />\nSi<br />\n<br />\nti<br />\n<br />\nVVhat a difference<br />\njust a few cents make !\"<br />\n<br />\nFATIMA<br />\n<br />\nA<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br />\n_CORNELL MAKES LARGE SCORE UNDERGRADS PRESENT A CLOCK<br />\nTO FORMER REGISTRAR AT<br />\nAGAINST HOPKINS AT ITHICA<br />\nASSEMBLY<br />\nContinued from page 1<br />\nContinued from page 1<br />\n<br />\nstood 26-0. Pfann, at quarterback, and Affeld, at center, were<br />\nlargely responsible for the smoothness and ease of the machine-like<br />\nbursts with which the New York<br />\nbacks crashed through Hopkins'<br />\nline. Affeld displayed marvelous<br />\nprecision in the fl oating passes<br />\nwhich distinguished his snappingback.<br />\n<br />\n3<br />\n<br />\nshall smoke within the buildings<br />\nROBBIN'S STYLE BUILT HATS<br />\nor on the grounds of the UniverFOR YOUNG MEN<br />\nsity.\" This matter will be brought<br />\nto the attention of the Student<br />\n122 W. BALTIMORE ST.<br />\nCouncil.<br />\nUppermost in the minds of the<br />\nFreshmen now is the Soph footGERHARD & REED CO.<br />\nball game and class rush. It will<br />\nTAILORS<br />\nbe held December 8 or 15, depending whether the i.;,..arsity plays on<br />\n110 N. EUTAW STREET<br />\nthe 8th or not. A Zreshmen mass2nd Floor<br />\nmeeting has. been planned for the<br />\nnight before the game, the islogan<br />\nto be \"Beat the Sophs.\"<br />\nLIBERTY ST.<br />\nFreshmen are also considering<br />\nAT SARATOGA<br />\nthe election of an honorary member to help in class activities.<br />\nLUNCHEON<br />\n<br />\nence to the \"Meaning of Prayer,\"<br />\nby Harry Emerson Fosdick, and<br />\nespecinally to the chapter \"Prayer<br />\nas Dominant Desire.\" He quotea<br />\nMrs. Browning, \"Every wish with<br />\nGod is a prayer,\" to emphasize his<br />\npoint—that prayer has its foundation in worth while desires. Darwin and Edison, he said in their<br />\nintense desire to arrive at the truth<br />\nThird Period Scoreless<br />\nin their respective fields, were<br />\nCaptain Bunner and his team- praying.<br />\nDominant desire is not<br />\nmates staged a great rally during all, but a very 'large part, of<br />\nthe third quarter, keeping the Cor- prayer; a prayer must be lived as<br />\nnell eleven at arm's length until well as spoken. Dominant desire<br />\nFROSH-SOPH FOOTBALL<br />\nthe whistle blew. The work of the may lead to prayers of a wrong<br />\nCONTEST DEC. 8<br />\nteam through this period was very sort, as in the cases of the ProdiThe<br />\nFreshman<br />\npleasing to the J. H. U. coaches, gal Son and Bonaparte. In other<br />\n-Sophomore foot- 11.30 A. M.<br />\nuntil<br />\nbut in order to prevent any possi- words, the dominant desire must ball contest is scheduled for Decem7.30 P. M.<br />\nble injury to the regular players, be an honorable one.<br />\nber 8. In preparation for the tilt,<br />\nthey substituted practically a new<br />\nHorace Bushnell, a religious both<br />\nteams are practicing daily, as<br />\nteam for the varsity during the en- leader in New England, at one<br />\na result of which there is a marked<br />\nsuing quarter. These substitu- time in his life questioned all reimprovement<br />\nin both of them.<br />\ntions were made just .after a fresh ligious beliefs, questioned even<br />\nCoach \"Tom\" Landy is rapidly<br />\nstring of Cornell players had start- the existence of God. There reed the drive which resulted in the mained for him only the distinc- developing his proteges into proslarger score, making four touch- tion between right .and wrong; pects for the varsity for the years<br />\ndowns in ten minutes_ Cornell and his doininant desire to do the to come. Some of the men have<br />\nhad the ball •within ten. yards of right led him to, prayer, and ulti- already displayed excellent qualithe goal at the end of the game mately to restored faith.<br />\nties in the few games in which<br />\nand would have scored another \"Do you see, then,\" asked Dr. they have played. Among them<br />\ntouchdown had not the timekeeper Mills, \"the reasonableness of a are Stone (Capt.), Steinwald,<br />\nannounced the end of the game. week of prayer? Have in your Grinsfelder, Cone, Brian, Franck,<br />\nSo short ,vas the time left to make minds for but a moment a domi- Schlossberg, Gough, Broening, Nicthis last touchdown that the Cor- nant desire, and you have the be- olls, Blumberg and Brown.<br />\nnell quarterback, instead of wast- ginning of true prayer. And in<br />\ning time by calling signals, took your prayer consider not yourself<br />\ntime out announced the play to his alone, but your fellow students,<br />\nteam, and executed it without young manhood, and all mankind.\"<br />\nany signals.<br />\nBoost June Week •<br />\nLine-up:<br />\nRandolph Norwood announced<br />\nCornell (52)<br />\nHopkins (0)<br />\nthe plans for the collection of June<br />\nBuckley ......L.E....... . Berndt Week funds. Last<br />\nyear tags were<br />\nKearney<br />\nLT<br />\nMagill sold at a minimum price of<br />\n25<br />\n13erean ......L.G........ Barton cents. This arrangement<br />\nwas not<br />\nAffeld<br />\nCarr satisfactory, as no direct return<br />\nMorris<br />\nR.G.Wolbert was received for the money<br />\nspent.<br />\nSavage<br />\nR.T......... Carter This year, stamp books<br />\nwill be<br />\nRaymond<br />\nR.E.......... Rich distributed, and \"June Week<br />\nPfann<br />\n.Q.B......... Taylor Stamps\" will be sold at 25 cents<br />\nPatterson ...L.H.B..... Turnbull each. These stamps will be reRamsey .....R.H.B....... Bonner deemable at face value in purchasCassidy ......F.B<br />\n— 'Maxwell ing a June Week ticket later in<br />\n<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\n<br />\nTEA<br />\nDINNER<br />\nSPECIAL PARTIES<br />\n<br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nPLAZA 6987<br />\n<br />\nHub<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\n.<br />\n<br />\nthe year. However, everyone must<br />\nSCORE BY PERIODS<br />\nCornell .......6 20 0 26-52 buy one stamp at certain intervals.<br />\nHopkins ......0 0 0 0—U Norwood said that every effort<br />\nTouchdowns—Cornell: Ramsey would be made to equal and bet(2), Pfann (3), Whetstone (3). ter the success of the first June<br />\nPoints after touchdowns—Pfann Week; and that the support of all<br />\nthe undergraduates would be nec(3), Whetstone (1).<br />\nessary<br />\nfor the undertaking.<br />\nSubstitutes—Cornell: HenderOn<br />\nSaturday,<br />\nNovember 24, at<br />\nson for Buckley, Rooney for<br />\nPfann, Whetstone for • Cassidy, 8.30, Sigma Chi Beta, an honBrigden for Raymond, Friend for orary fraternity, will give a dance<br />\nRamsey, Sullivan for Kearney, in the C. E. Hall. The dance will<br />\nTilton for Paterson, Hill for Sav- be limited to 75 couples. Anyone<br />\nage, Wallenmore for Morris, wishing to attend must secure his<br />\nTrousdell for Bereau, Reed for Af- ticket from a member of the sofeld. Johns Hopkins: Slowik for ciety at once.<br />\nCandidates for the BarnstormCarter, Cook for Max-well, Levy<br />\nfor Carr, Gilliece for Berndt, Mila- ers' production, \"Have You Bean<br />\nnausky for Wolbert, Carter for to Lima?\" are asked to report to<br />\nSlowik, Almy for Bonner, Duckett the Barn on Wednesday for tryfor Barton, Jacksnn for Taylor, outs.<br />\nBecause of conflicts in the use<br />\nYoung for Magill.<br />\nof<br />\nthe three large rooms—C. E.<br />\nTime of periods-10 an 0<br />\n. 12<br />\nHall, M. E. 110 and M. E. 109—<br />\nminutes each.<br />\nfor meeting, written permission to<br />\nSIGMA CHI BETA TO HAD DANCE use one of these rooms must be<br />\nIN C. E. HALL<br />\nsecured from Norwood, president<br />\nContinued from page 1<br />\nof the Student Council. In this<br />\nPlication is necessary due to heavy way unnecessary inconvenience<br />\nwill be avoided.<br />\ndemand.<br />\nThe following men will be initiated into the fraternity: John W. FRESHMAN CLASS MEETING<br />\nParsons, John S.' V. B. Shriver, Freshmen have been having<br />\nR. Carmichael Tilghman, Malcolm trouble in arranging their social<br />\nGilpin, William N. Krout, Donald activities. The Student Council<br />\nR. Reese, W. Carville Gardner, Ed- disapproved of a Freshman (lance,<br />\nward Watson, Fitzgerald Dunning, and suggested a smoker. At<br />\na<br />\nJohn Cochran, Gordon Post, R. class meeting last Wednesday it<br />\nPage O'Connor, Douglas Turnbull, was brought to the attention of<br />\nWilliam Harrison, Miles Marrian, the class that, according to FreshA. K. Mitchell.<br />\nman Bible, Rule 4:\"No Freshman<br />\n<br />\nMost popular<br />\ncollege sport<br />\n<br />\nPublished in<br />\nthe interest of Electrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br />\n<br />\n$30 up<br />\n$35 up<br />\n<br />\n\"As I look back on my college days,\" said the<br />\nold grad, \"it strikes me there were more men playing blind man's buff than all other games combined.<br />\nI understand this is still the case.<br />\n\"Get me straight. It was no child's play. What<br />\nwe were groping around for was pretty serious<br />\nbusiness—nothing less than a career.<br />\n\"Too many men are in the dark as to what they<br />\nwill do after graduation. Either they neglect to<br />\nspecialize in anything, or hastily select a major which<br />\nthey afterwards regret.<br />\n\"I know I would be considerably ahead in<br />\nbusiness if back at college I had sat down for a few<br />\nhours'earnest thought to find out just what work I<br />\nliked best—and then gone in for it heart and soul.<br />\n\"Pick the thing that appeals to you, and don't<br />\nlet them tell you that particular line is overcrowded.<br />\nTalk this over with graduates you know. Talk it<br />\nover with your professors. Talk it over with the<br />\nindustrial representatives next Spring. Most of all,<br />\ntalk it over with yourself.<br />\n\"The main thing is to get on the right track and<br />\nto keep going. There's no fun in being 'It' in the<br />\ngame oflife, with every change in fate ready to push<br />\nyou offan uncertain course.\"<br />\n<br />\nstern Ream Company<br />\nWherever People look to electricity for the<br />\ncomforts and conveniences of life today, the<br />\nWestern Electric Company offers a service as<br />\nbroad as the functions of electricity itself.<br />\nNumber 32 of a series<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br />\n<br />\n4<br />\n<br />\n, November 21. 0.D. K. TO HAVE INITIATION<br />\nINTERFRATERNITY CONFER- ENGINEERING UPPERCLASS- low pn Wednesday<br />\nContinued from page 3<br />\nHis last lecture of the week will<br />\nMr-N HEAR ADDRESS ON<br />\nENCE TO ORGANIZE<br />\nof the faculty memCOPPER REFINING<br />\nbe given Friday, November 23,, tiates, several<br />\nNEW NATIONAL<br />\nHopkins Students Guests of Engineers' and will cover \"Reality and Fic- bers and many of the alumni.<br />\nClub at Interesting Lecture<br />\nA full-fledged national college<br />\nThe senior classes of the last two<br />\n20 junior and senior en- tions in the Life of Social Groups.\"<br />\nAbout<br />\ncoast<br />\nfraternity, stretching from<br />\nhave unanimously voted memyears<br />\nThe final lecture of the series<br />\nat Johns Hopto coast, will be formed at the an- gineering students<br />\nin Omicron Delta Kappa<br />\nbership<br />\nmonthly will be delivered the following<br />\nnual Interfraternity Conference to kins attended the regular<br />\nSociety as the greatest<br />\nHonorary<br />\nsection week, Monday, November 26. Its<br />\nbe held at the Hotel Pennsylvania meeting of the Baltimore<br />\nman can receive<br />\nHopkins<br />\na<br />\nhonor<br />\nof Elec- title will be \"Public Service.\" The<br />\nNovember 30 and December 1. of the American Institute<br />\nthe men who<br />\nthat<br />\nsurety<br />\na<br />\nso it is<br />\nlast Friday entire course will be given in. the<br />\nThis will be the first time that a trical Engineers, held<br />\nof the laurel<br />\nrecipients<br />\nthe<br />\nwill be<br />\nthe Engi- Civil Engineering lecture room.<br />\nnational society will have been night, Novemb:tr 16, at<br />\nbe heartily<br />\nwill<br />\nEach lecture will start at 5 o'clock leaf next Thursday<br />\nneers Club.<br />\ngrown.<br />\nfull<br />\nbeing<br />\ninto<br />\nbrought<br />\ncongratulated by the entire student<br />\nSanford's<br />\nof on the evening of their respective<br />\nare<br />\nmembers<br />\nwho<br />\nmen,<br />\nTheje<br />\nfranew<br />\nthe<br />\nof<br />\nformation<br />\n111<br />\nThe<br />\nPEN<br />\nfNNTAIN<br />\nbody.<br />\ndays.<br />\nEASY- FLOWING<br />\na lengthy investi- the Materials of Engineering<br />\nfollows<br />\nternity<br />\nSANFORD MFG CO<br />\nmeeting,<br />\n\"The<br />\ngation by_the Interfraternyty Con- class, attended this<br />\nthe offiference which led it to the opinion through the courtesy of<br />\nINK<br />\nsection, to<br />\nthat far too few college men are. cers of the Baltimore<br />\nPOSSIBLE\"<br />\nPen<br />\nFountain<br />\nJr., generThat Made the<br />\nand individuality is offered here at prices that are not<br />\ngiven the opportunity of fraternity hear Mr. E. W. Rouse,<br />\nCopand cannot be underquoted by any house at any time.<br />\nfellowship. Invitations were sent al manager of the Baltimore<br />\nand Rolling Com(,Besides the reputation of an old-established firm<br />\nto most of the local fraternities in per Smelting<br />\n\"The<br />\non<br />\naddress<br />\nan<br />\ndeliver<br />\npany,<br />\nis back of each sale with a guarantee.<br />\nthe United States to be present at<br />\nCopper.\"<br />\nof<br />\nRefining<br />\nElectrolytic<br />\na meeting held in conjunction with<br />\nMr. Rouse graphically presentJOHN C. KNIPP & SONS<br />\nthe annual Interfraternity Confervarious<br />\nence for the purpose of forming at ed to the members the<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nore<br />\ncopper<br />\nraw<br />\nthe<br />\nwhich<br />\nstages<br />\nfraternity.<br />\nnational<br />\nnew<br />\none<br />\nleast<br />\n343 NORTH CHARLES STREET<br />\nMore than fifty locals have al- goes through, until it finally is macopper<br />\nready signified their intention of chined into the varied<br />\nLimited<br />\nbeing present for that purpose. In products turned out by the Baltiaddition 32 interfraternity councils more Copper Company.<br />\nThe following day, Saturday.<br />\nERIA<br />\nCAFET<br />\nBARN<br />\nare sending undergraduate dele23, the class visited the<br />\nNovember<br />\nas<br />\ngates, some coming from as far<br />\nBaltimore Copper<br />\nthe<br />\nof<br />\nplant<br />\nCalifornia. A score of educators,<br />\nto see at first<br />\nCanton,<br />\nat<br />\nCompany<br />\n• Ei.IE3g g • IElE,<br />\n:gait it= FBOE3 • I • Dal<br />\namong them several college presidescribed by<br />\noperations<br />\nthe<br />\nhand<br />\ndents, will be present to join in<br />\nbefore.<br />\nnight<br />\nthe<br />\nM.<br />\nr<br />\nRouse<br />\nthe discussions of college and fraby Drs.<br />\nheaded<br />\nparty,<br />\nThe<br />\nternity problems with the Conferof the<br />\nen,<br />\nKouwenhov<br />\nand<br />\nence delegates, which will number Christie<br />\nengimechanical<br />\nof<br />\ndepartment<br />\nclose to 250.<br />\nat 2<br />\nworks<br />\nthe<br />\nat<br />\narrived<br />\nneering,<br />\nJr.‘;1107012- , 01111,5<br />\nconducted<br />\nthen<br />\nTHE<br />\nwere<br />\no'clock and<br />\nNEED FOR MORE MEN IN<br />\nCLUBS<br />\nMUSICAL<br />\nthrough the plant by officials of<br />\ns\"<br />\nLubricant<br />\nof<br />\n\"The King<br />\nBoth Mr. dcCau1ey and Mr. the company.<br />\nSHERWOOD BROTHERS, INC.<br />\nBochau are encouraged by the<br />\nWilliam and Mary College has<br />\nspirit and work of their clubs. AlREINNEIgEtEEIENEINCIECIENNKNNITIOCCID<br />\nrecently purchased about 260<br />\nthough the Mandolin Club has thiracres of land for a new and modty-two candidates and the Glee Club<br />\nern athletic field. It will have<br />\nsixty-five, there is a need for guitwo football gridirons, two baseBoys, the place to get your<br />\ntars and first tenors. Freshmen who<br />\nball diamonds, and a quarter-mile<br />\nmeals—and they are honhave not affiliated themselves with<br />\ntrack with a 220-yard straightthe club and find themselves musitest-to-goodness meals, well<br />\nway.—The Flat Hat.<br />\nally inclined are asked to join.<br />\nserve d, and reasonably<br />\nMr. McCauley is carrying on the<br />\nTHE JAMES SCHOULER<br />\npriced—is at<br />\nsame program at Hopkins as he is<br />\nLECTURESHIP<br />\nSir Paul Vinogradoff, Corpus<br />\nat Goucher. Goucher produces a<br />\nclassical type, including \"The Professor of Jurisprudence in the<br />\nIn buying a Stetson you need only be conEnchantment Waltz,\" \"Lom du University of Oxford, will arrive<br />\na<br />\ngive<br />\nBal,\" \"College Medleys,\" and one next week at Hopkins to<br />\ncerned with the style—the quality is guaranRESTAURANT<br />\nRelations<br />\nexception, -On the Back Porch.\" lecture course on \"The<br />\nteed by the name “Stetson\".<br />\n1817 N. Charles St.<br />\nSuggestions have been made to hold of Political Science and JurispruSTYLED FOR YOUNG MEN;<br />\na joint concert with Goucher's mu- dence.\" The course will consist<br />\n(Half Block below North Ave.)<br />\nof four lectures, the first to be desicians.<br />\ndevoting<br />\nbeen<br />\nhas<br />\nlivered Monday, November 19. It<br />\nClub<br />\nGlee<br />\nThe<br />\nNicholas Brown, Mgr.<br />\nits time thus far to the ,\"Ode,\" will cover the subject, \"The So-Hunter's Farewell,\" and \"John cial Background of Juridicial DocAnderson.\" The importance of the trines.\" The second lecture of the<br />\n\"Ode' has been emphasized and spe- course, dealing with \"Moral and<br />\ncial attention has been given to it. Juridicial Responsibility\" will folPrinters of Philological and<br />\nAt the Washington Monument<br />\nScientific Works<br />\nOscar Thomas Olson, D.D.<br />\n23 S. HANOVER ST.<br />\nMd.<br />\nBaltimore,<br />\nMinister<br />\n<br />\nRef 1 With<br />\nORD'S<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nMOB<br />\n<br />\nSTETSON<br />\n<br />\nBats<br />\n<br />\nThe St. REGIS<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\ni<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nHOSIERY<br />\n<br />\nelfreisigaffa▪i<br />\niimmoollWO▪ OF<br />\n<br />\n11.94.411-sji<br />\n444<br />\n'<br />\n<br />\nir<br />\n<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\n<br />\nar<br />\nillarit<br />\nnsgawr<br />\nmourammai<br />\n<br />\nmowdormot fe<br />\nrg grt,<br />\n0or4,<br />\ndiA.<br />\n<br />\nThe purpose and program of th:s<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br />\n<br />\n4<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Si:k Ba,ners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nNLY those<br />\n<br />\nO<br />\ncan judge the quality<br />\n<br />\nSunday even<br />\n<br />\nsmoked Melachrinos<br />\n\"At the heart of the City\"<br />\n<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PFR MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nURNER BROTHERS<br />\nII I E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRENT A CAR<br />\n<br />\nORIGINAL<br />\n<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nservice at 8 o'clock.<br />\n<br />\nMusic by vesteo chorus—choir of soloists.<br />\n<br />\nof the finest Turkish<br />\ntobacco.<br />\n<br />\nMELACH NO<br />\n<br />\ning worship at 11 o'clock.<br />\n<br />\nSunday m<br />\n<br />\nwho have<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n-<br />\n<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 14<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br /><br />\nUNDERGRADS PRESENT A SIGMA CHI BETA TO HOLD HOPKINS DELEGATES TO ATTEND Y. M. C .A. CONDANCE IN C. E. HALL<br />\nCLOCK TO FORMER REGVENTION<br />\nASSEMBLY<br />\nISTRAR AT<br />\nFunction to Improve Social Relations to<br />\nDr. Mills Speaks on \"Week of Prayer.\"<br />\nNorwood Announces Plans for<br />\nJune Week Funds<br /><br />\nBe Restricted to 75 Couples<br /><br />\nNine Representatives to Go to Indianapolis<br /><br />\nPRICE 5 CENTS<br /><br />\nCORNELL MAKES LARGE SCORE<br />\nAGAINST HOPKINS AT ITHACA<br /><br />\nIn furtherance of its policy in<br />\nThe Hopkins Y. AI. C. A. has<br />\nbettering social relations about the<br />\nselected<br />\nfrom the student body<br />\nUndergraduates of Johns Hop- campus,<br />\nSigma Chi Beta is holding several delegates to attend the Red Eleven Scores 52 Points Ni hile J. H. U. Eleven Is<br />\nkins last Thursday at assembly its initiation dance in public rather<br />\nUnable to Approach Goal<br />\npresented a clock to Mr. Thomas than in private, as has been the cus- Ninth International Convention of<br />\nthe<br />\nStudent<br />\nVolunteer<br />\nMovement,<br />\nR. Ball as a token of their affec- tom in previous years. Freshmen<br />\nHopkins received its worst gridtion and of their appreciation of and non-fraternity men will have which will be held at the Codle FROSH-SOPH GRID BATTLE<br />\niron defeat in several years last<br />\nMAY SHAKE NEOPHYTE<br />\nhis long and faithful service. Ran- full opportunity to get a better idea Tabernacle, in Indianapolis, from<br />\nDecember<br />\n28<br />\nto<br />\nJanuary<br />\n1,<br />\n1924.<br />\nSaturday<br />\nwhen the \"Big Red<br />\ndolph Norwood, president of the of representative social life than has<br />\nSHACKLES<br />\nThe<br />\nmen<br />\nwho<br />\nwill<br />\nrepresent<br />\nHop.<br />\nStudent Council, made a brief ever before been offered in any<br />\n20 Men Report for Initial Practice Eleven\" of Cornell University<br />\nkins at this convention will be T.<br />\npresentation speech, in which he Hopkins social<br />\nHaving beaten the Sophomores piled up a score of 52 points<br />\nfunction in years. R. Marsh, E. P. Sylvester, Walter<br />\nmentioned those characteristics of<br />\nat baseball, the freshmen are look- against the Black and Blue warElaborate preparations are being<br />\nthe former registrar which en- made by Sigma Chi Beta for the Sullivan, Philip Pease, A. M.<br />\ning forward to the day that their riors. The vanquished team put<br />\ndeared him to Hopkins students. Harvest Ball, Saturday, November Cleveland, Miss Maude Kemp and<br />\nfootball team battles with that of up a stiff fight throughout the<br />\ntwo others to be selected.<br />\nIn the fall of 1876, the Johns 24, at 8:30 P. M., the public dance<br />\nThese conventions are held once the second year men. A victory contest but Cornell proved far too<br />\nHopkins University held its first at which the initiation<br />\nof the newly in a student generatiozi and the<br />\nBall<br />\nfor them means the abandonment strong for them from start to finMr.<br />\n1878,<br />\nclasses; in January,<br />\npledged men to the society will last was in Des Moines, Iowa, in<br />\nperish. The local players accomcame to Johns Fropkins, first<br />\ntake place. C. E. Hall, the scene 1920, with 6,890 delegates repre- of those shackles which distinplished<br />\none feat in the game which<br />\nforming the duties of a registrar of the festivities, will<br />\ndon the senting 949 institutions. The pur- guish them from their higher asno other team has succeeded in<br />\nwithout actually bearing the title. multi-colored<br />\nsociates. The Sophomores themmantle of autumn<br />\ndoing this fall; they held Cornell<br />\nA few years later he was officially for the occasion. Pumpkins, scar- pose of these conventions is to<br />\nselves having realized this have scoreless<br />\nduring one quarter, the<br />\nmade registrar; and he held his let leaves and shocks of corn realize the critical needs and possibilities of the situation in the started practice in earnest in or- third. This is<br />\nposition until_the beginning of the will abound while it<br />\nregarded as an act<br />\nis rumored world today, to consider the reder to prolong their joyous privi- of note by the Hopkins coaches as<br />\npresent academic year.<br />\na harvest moon will smile be- sponsibilities of the Christian stulege of tantalizing the \"green\" the New Yorkers have always<br />\n\"Why Mr. Ball, resigned is, in nignly down upon the<br />\ndancers for dents of Canada and the United<br />\nmanaged to add to their score in<br />\nplain English, his own business,\" one veiled moonlight dance.<br />\nCider, States in the light of this situa- ones.<br />\ncertainly<br />\n\"but<br />\nevery<br />\nNorwood,<br />\nperiod against the other<br />\nsaid<br />\nIn their game against Gilman<br />\nsweeter by far than the nectar of tion, to consider Christ and His<br />\nof<br />\nquestion<br />\nany<br />\nnever<br />\nelevens<br />\nthere was<br />\nwhich they have met.<br />\nthe gods, will fill the brimming bowl way of life as the hope of the the \"frosh\" loked pretty good, and<br />\nthe efficiency of his office, nor of to overflowing and will<br />\nHopkins Plays Defensive Game<br />\nadd hugely world, and to present the foreign when they put up a good fight<br />\nCornell's heavy line was imhis own unusual fitness for the po- to the zest of the<br />\ndancers. The or- missionary enterprise in the light with Poly, all<br />\nthat their followers pregnable to the J. H. U. backsition. Mr. Ball has made himself chestra will<br />\npresent a novel effect of its achievments as an indispencould prophesy was a sure defeat field. During the first part of the<br />\npersonally acquainted with every in the way<br />\nof unusual costume. sable means of bringing the power<br />\ngame, Taylor, at quarterback,<br />\nman who graduated from Johns Members of<br />\nthe Dance Committee of Christ to bear upon the world's of the Sophs. But in their last<br />\nHopkins; in the wonderful.'card insist, however,<br />\ngame, the yearlings didn't play called for plays to test the defenthat the hayseed ef- needs.<br />\nsive powers of the Ithaca squad,<br />\nindex' which he carries in his mind fect ends with<br />\nthe rural attire and<br />\nThe convention will be opened What could be termed anything failing each time to<br />\nhe has a place for every Johns will in no way<br />\ngain appreciaimpair the quality of with four addresses dealing with like football. They were light,<br />\nbly. After proving that his team<br />\nHopkins student.\" Norwood said music<br />\nto be played.<br />\nthe four great themes which are played ragged, and pulled a num- was unable to do<br />\na a few words more about Mr. It is planned<br />\nany serious damto have five program being<br />\ndiscussed<br />\nin<br />\ncolleges ber of -bonehead\" plays. They age to his opponents through the<br />\nBall's friendliness, and then pre- dances<br />\none of which will be the throughout the country this fall,<br />\nshowed that they couldn't play line, Taylor called for a kick<br />\nsented the clock.<br />\ninitiation dance. In this dance the \"Modern Industrialism,\" \"Racial<br />\nacceptance,<br />\nagainst heavier men. On top of whenever Hopkins got the ball.<br />\nspeech<br />\nof<br />\nIn a short<br />\nmembers will line up on one side Relations and Christian Brotherthat a few of their men have been The Hopkins team was forced to<br />\nability<br />\nMr. Ball said he feared his<br />\nwhile the pledges line up directly hood,\" \"Present Day Social and<br />\ndeclared<br />\nhad<br />\nfaces<br />\nineligible to play as play a defensive game by. the suto remember names and<br />\nopposite. The pledges will then be Intellectual Unrest\" and \"InternaFreshmen.<br />\nNeuberger, former perior defensive strength of Coach<br />\nbeen somewhat over-rated, since<br />\npresented with red carnations, the tional Problems and the Christian<br />\nFriends School star, and Schloss- Dobie's great machine.<br />\nthe rapid growth of the university<br />\nflower of the society, which stands Way of Life.\" The speakers will<br />\nberg, a heavy linesman, have been<br />\nThe ball was in the possession<br />\nafter its removal to Homewood for valor. After this<br />\nceremony the be men and women who are recdeclared by the Student Council of the Cornell team most of the<br />\nhad made it increasingly difficult dancing will become general.<br />\nThe ognized as authorities of the highas social Sophomores, and thus in- time and Hopkins was forced to<br />\nto be intimately acquainted with Dance Committee<br />\nhas<br />\nfound<br />\nit nec- est order in their respective fields,<br />\neligible to play for either side. fight in its own territory for the<br />\nall the students. Mr. Ball ex- essary to<br />\nlimit the number of tick- and will include the ablest stuTheir loss will be keenly felt by greater part of the game. The batpressed his sincere appreciation of ets to be<br />\nplaced on sale to seventy- dents of the industrial, internaCoach Landy, and is a good stroke tering ram attack of Pfann and<br />\nthis evidence of the undergradu- five.<br />\nThese tickets may be obtained tional and social movements of the<br />\nfor the Sophs. Yet in Grinsfelder, Ramsey gave the Baltimoreans<br />\nates' good will.<br />\nfrom members of the Society for day, at home and abroad. The<br />\nCone, Brian, Stone, Steinwald, good practice in stopping swiftly<br />\nThe presentation was attended the sum<br />\nof -two dollars. Early ap- needs and conditions peculiar to<br />\nLaDean<br />\nGoodnow,<br />\nBrown and Franck, the first-year moving players; practice of a seriby President<br />\nContinued<br />\non<br />\ntheir<br />\nown<br />\nPage<br />\n3,<br />\ncol.<br />\npeople<br />\nI<br />\nwill<br />\nbe<br />\ntreated<br />\nBuchner,<br />\nDr.<br />\nmen have excellent material, and ous kind which cost Hopkins a<br />\ntane, Dr. French,<br />\nby nationals and leaders of the the Sophs have to be wary of great loss in yards. By hard<br />\nRev...11. C. Dixon and Rev. Victor<br />\ndrivOMEGA BETA PI PRE-MED. Christian movement will suggest them.<br />\nG. Mills, pastor of Grace Methoing at all points of the line, the<br />\nFRATERNITY AT HOPKINS the meaning of the \"Way of<br />\nRegular practice has started for red-sweatered eleven plowed clown<br />\ndist Episcopal Church, who adA new organization will join the Christ\" in the present day world. the Sophomores, as they must the field repeatedly,<br />\ndressed the assembly on \"A Week<br />\nthrusting<br />\nranks of the honorary fraternities<br />\nhave<br />\na<br />\nmonth<br />\nof<br />\nof Prayer for Young Men.\"<br />\norganization<br />\nbeaside<br />\n-the<br />\nplucky<br />\nwearers<br />\nof the<br />\non the Hopkins campus when the 0. D. K. TO HAVE INITIATION fore they will be allowed to play Black and Blue. Coach Van OrDr. Mills Addresses Assembly<br />\nThursday's assembly will be<br />\ntheir opponents on December 15. man's charges finally caught on to<br />\nDr. Mills declared that his sub- Hopkins chapter receives its char- marked by the public initiation<br />\nof<br />\nCoach \"Happy\" Middleton has as- the lightning-like plays of the<br />\nject, at first glance, seemed futile ter from Omega Beta Pi, a national Omicron<br />\nDelta Kappa Honorary<br />\nsumed charge of the tutelage job, home team, holding them on<br />\nand queer. Young men in college pre-med. fraternity.<br />\nFraternity. Following custom the<br />\nOmega Beta Pi was founded at<br />\nand with his experience ought to downs twice within 15 yards of<br />\nare at an age when the feeling of<br />\nnames of the new men will not be<br />\nbuild up a team strong enough to the goal.<br />\nindependence is at its height; and the University of Nebraska. Its made public<br />\nuntil they are anpurpose<br />\nhere<br />\nis<br />\ntogether<br />\nto<br />\nbring<br />\nseems<br />\nglance<br />\nbeaf<br />\nCornell Field Muddy<br />\nthe frosh. In the backfield<br />\nfirst<br />\nprayer, which at<br />\nnounced at assembly. The laurel<br />\nthe<br />\nbest<br />\ntypes<br />\nJunof<br />\npre-medical<br />\nAt<br />\nnot<br />\nthe<br />\nstart of the game Hopweakness,<br />\nis<br />\nhe<br />\nan admission of<br />\nhas plenty of material. Baldleaf will be pinned on the new men<br />\niors<br />\nand<br />\nSeniors,<br />\nin<br />\nthem<br />\nand<br />\nto<br />\nget<br />\nkins<br />\nfeeling.<br />\ntried<br />\nto gain around the ends<br />\nwin, Chesney, Sauerwein, McKay,<br />\ncompatible with this<br />\nand then a prominent alumnus will<br />\ntouch<br />\nwith<br />\nthe<br />\nSchool<br />\nMedical<br />\nbebut<br />\nthe deep mud on the field<br />\nCrook, Draper, and \"Bob\" MiddleMoreover, this age marks the beaddress the assembly and the new<br />\nton look good, and with proper served to slow down the speed of<br />\nginning of thought, of piercing ex- fore they actually enter it. The members.<br />\ntraining ought to come through the backs. The greater weight of<br />\namination of childhood customs members must stand well in the<br />\nIn the evening there will be a<br />\ngloriously. On the line there is the Northerners gave them an adthat were previously taken as mat- pre-medical subjects. Before a formal<br />\nbanquet and a private initiaters of course. Young men are man may join he must be approved<br />\nKaufholz, Webster and Welsh out vantage on the slippery field, of<br />\ntion at the Southern Hotel, which<br />\napt to regard prayer as a part of by the heads of the departments of<br />\nfor tackle; Armiger, Wolf and which they made good use. The<br />\nwill be attended by the entire unKaplan out for guards; Sanderson great quantities of mud interfered<br />\nchurch service, but not as a thing Physics, Chemistry and Biology. dergraduate membership,<br />\nthe noviThe Hopkins chapter is an outto be considered in their daily<br />\noccuping center, and Homer, seriously with the kicking of both<br />\nContinued on page 4. col. 5<br />\nc-rowth of the local fraternity Psi<br />\nlives.<br />\nTownsend, Thomsen, Love teams, causing the punters to fail<br />\nN'Iu,<br />\nwhich<br />\nyear.<br />\nwas<br />\norganized<br />\nlast<br />\nGod<br />\nto<br />\nBrown and Ball to pick from for to kick as far as they are able on<br />\n\"If prayer is an aproach<br />\nNOTICE<br />\nThe<br />\nsixteen<br />\nhave<br />\nmembers<br />\ncharter<br />\nClaus,\"<br />\nends. The men seem to have a dry field.<br />\nas to a magnified Santa<br />\nFellowship Dinner<br />\nsaid Dr. Mills, \"and if it is used as been approved by Professoi-s Bliss,<br />\nHopkins held the stronger team<br />\ntaken the affair seriously, as they<br />\nof the Hopkins Y. M. C. A.<br />\na last cringing resort, then it is a Carteledge and Cowles. On Nointend playing a few games to to one touchdown in the opening<br />\nwill be held this evening<br />\nget the experience. If they play period of the game, but the rapidthing of weakness, unworthy of vember 29 they will be initiated at<br />\nat the<br />\nGilman and Poly second teams, it ity with which Cornell's plays<br />\nmen. Prayer is not of this nature, the Hopkins Club by a committee<br />\nFriends Meeting House<br />\nhowever; it has a real signifi- consisting of a man from the Uniwill be easier to compare them were executed baffled the local<br />\n3107 N. Charles St.<br />\nversity of Chicago, one from the<br />\ncance.\"<br />\nwith the frosh, who have tri- boys in the second quarter and at<br />\nP.<br />\nM.<br />\n6.00<br />\nover Gilman, only to lose the end of the first half the score<br />\numphed<br />\nThe speaker referred the audi- Harvard Medical School, and one<br />\nEverybody Out!<br />\nSchool.<br />\nMedical<br />\nHopkins<br />\nthe<br />\nfrom<br />\nPoly.<br />\n2<br />\nto<br />\ncol.<br />\nContinued on page 3 col. 1<br />\nContinued on page 3,<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br /><br />\nyouth, golf, and the effect of womTo the Editor of the Johns<br />\nan in choosing man's clothes are<br />\n• Hopkins NEWS-LETTER:<br />\nfive of these reasons. We can cheerWhat is the matter with the Pub<br />\n\"Up and down the Avenue they fully assimilate that much punishFOUNDED 1897<br />\nlicity Board?<br />\nment; but, when she drags in Ed: swing, clothed in soft tweeds and<br />\nEvery Sunday I get a copy of -al,<br />\nward, Prince of Wales, as dictator<br />\n$2.00 New York Times and scan the sport woolens, shirts shaming the rainSubscription<br />\nof<br />\nthe world of men's fashions, and<br />\n-.11eet for some news about the Hop- bow, ties agleam in the sun. They<br />\nshe blames the \"appeal—conwhom<br />\nkins football games. Only once are the new Dappers and the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nscious<br />\nor<br />\nunconscious—of the clothhave I seen anything about my Alma Smarts.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\ning advertisement,\" we squirm.<br />\nlater and that was the day after \"The old dandies had lace at their<br />\nEvery time the Prince dents his<br />\nPublished semi-weekly from October to June by the students of Johns the Western Maryland game. No sleeves' ends and red heels clicking<br />\nhat<br />\nin a different manner, says Miss<br />\nHopkins University.<br />\nmention was made of the Haver- on their shoes. They made an art<br />\nRead, the world of men eagerly folford, Albright or the St. John's of dress, and their art was their<br />\nBusiness communications should be addressed to the BUSINESS MAN- games at all—not even in the scores life. They needed no further ex- lows suit. Yes, \"if you want to<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nknow why our men are taking to<br />\ncolumn, where are listed the results cuse for being, no business or proshould be sent to the MANAGING EDITOR.<br />\ntweeds and plus fours you must folof practically every game of note fession to interfere with ,their sarlow the advice of the unforgettable<br />\nthe entire country.<br />\nin<br />\ntorial devotions. Even in their heyHomewood 100<br />\nTelephone<br />\nKiki and ask the Prince of Wales.\"<br />\nIt seems to me that the Publicity day they were comparatively few.<br />\n* * *<br />\nBoard should see to it that Hopkins They flourished only among the<br />\nWe have decided never to take<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ngets newspaper recognition abroad very idle and the very rich. Society<br />\nJOSEPH LEOPOLD, '24<br />\nup<br />\nsteeple-chasing, and hereby solPHILIP W. HOWARD, '25<br />\nas well as at home. Certainly some obviously couldn't afford to support<br />\nemnly<br />\nswear never to join an InEditor<br />\nManaging<br />\none is to blame and the negligence too many of them. They were a<br />\nAdvertising Manager<br />\ndian<br />\ntribe,<br />\nwear farmer's clothes,<br />\nWILLIAM G. DEAN, JR., '24<br />\nshould be remedied at once.<br />\npretty decoration, a sort of sacriFITZGERALD DUNNING, '24<br />\nnor<br />\nshoot<br />\ntigers<br />\nin India.<br />\ndo not know whether Hopkins fice to Narcissus and Apollo and<br />\nAssistant Managing Editor<br />\nAs<br />\nfor<br />\nthe<br />\nclothing<br />\nManager<br />\nad—we start<br />\nCirculation<br />\nis better advertised in other cities the other symbolic figures of male<br />\nT. REESE MARSH, '24<br />\na<br />\npetition<br />\nto<br />\nremove<br />\nthe<br />\nArrow ColJOHN C. LEWIS, JR., '24<br />\nor not, but if this condition is uni- beauty and vanity. . . .<br />\nAssociate Editors<br />\nversal it is no wonder that people \"The new dandyism is demo- lar plate from Tge Black and Blue<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25<br />\noutside of Maryland know Hopkins cratic. The affluent merchant and Jay.<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nWe will be independent.<br />\nBENJAMIN T. ROME,'25<br />\nonly as a medical school.<br />\nthe grocer's clerk, the school teacher<br />\nG. DONALD GIESKE,'25<br />\nEditor,<br />\npub'hope<br />\nI<br />\na<br />\nMr.<br />\nas<br />\nyou,<br />\nand the professional athlete, all are<br />\nJOHN T. DIXON,'24<br />\nJunior Editors<br />\nlicity man, will lend your efforts to part of it. . . .<br />\nA. J. McKAY,'26<br />\nW. EDWARD THOMSEN, JR., '26<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE TOVELL,'24<br />\ncorrect this deficiency.<br />\n\"This democratic dandyism is<br />\nERNEST A. STRATHMAN, '26<br />\nJ. KETLER, III, '26<br />\nOTHO<br />\nSincerely, ,<br />\nevinced in many subtle ways. Men<br />\nALGER G. Hiss, '26<br />\nJ. JACKSON KIDD, '26<br />\nEDWARD 0. MICHEL, '26<br />\nAN ALUMNUS.<br />\nare waking to a consciousness of<br />\nT. STRAN SUMMERS, '25<br />\nCHARLES G. HUTZLER, '24<br />\nNovember 13, 1923.<br />\ndecorative possibilities in their<br />\nclothes.<br />\nThey are spending more<br />\nMember Southern Intercollegiate Newspaper Association<br />\nHULLABALOO CONTRACTS of their income to make themselves<br />\npresentable. Their ingrained fear<br />\nSIGNED<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncolor is disappearing—as ties and<br />\nof<br />\nContracts for printing, binding,<br />\n1923<br />\n20,<br />\nsuits<br />\nand handkerchiefs will testify.<br />\nBALTIMORE, MD., NOVEMBER<br />\nengraving and photographs of the<br />\nHullabaloo have been signed. They want clothes for every occaand binding will be han- sion, knickers for sports wear, coats<br />\nPrinting<br />\nBETA<br />\nA SUGGESTION TO SIGMA CHI<br />\nby<br />\ndled<br />\nthe Read-Taylor Com- for the opera unlike their coats for<br />\nSaturThe Hopkins football squad was welcomed to Cornell last<br />\nThe<br />\npany.<br />\nBureau of Engraving the office. There is a new affinity<br />\nday by a delegation of young men, each of whom wore on his breast<br />\nOU bet he is! He's making a trebetween men's clothes and women's<br />\nmendous hit! She has just told<br />\na small red key. This delegation attached itself to the squad and, of Minneapolis has been awarded<br />\nhim that he has hair like Rudy<br />\n—observed in such articles as Deauis<br />\nThis<br />\nthe<br />\ncompany<br />\nengraving.<br />\nthe<br />\nbetween<br />\ngame,<br />\nthe<br />\nBut he doesn't know<br />\nBefore<br />\nValentino's.<br />\nhosts.<br />\nas<br />\nacted<br />\nday,<br />\nthroughout the<br />\nwhether to pretend that it came that<br />\nville scarfs and coonskin coats and<br />\nannual<br />\ncollege<br />\nthe<br />\nin<br />\nknown<br />\nwell<br />\nconwere<br />\ndelegation<br />\nhe did it with his<br />\nway<br />\nthat<br />\nconfess<br />\nor<br />\nthis<br />\nof<br />\nmembers<br />\ngame,<br />\nthe<br />\nhalves and after<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\ngiddy sweaters for sport.\"<br />\nmany<br />\nfor<br />\nhaving<br />\nwork<br />\ndone<br />\nworld,<br />\nSaturday<br />\nservice.<br />\nmanly beauty to<br />\nhis<br />\nof<br />\nlot<br />\na<br />\nowes<br />\nHe<br />\ninvaluable<br />\nof<br />\nbe<br />\nto<br />\nproved<br />\nstantly on hand and<br />\n* * *<br />\nthat bottle. \"Vaseline\" Hair Tonic<br />\nyear<br />\ncountry's<br />\nlargest<br />\nthe<br />\nof<br />\nkeys\".<br />\nthe hair and<br />\nof<br />\ngrowth<br />\n\"red<br />\nthe<br />\npromotes<br />\nthe<br />\nand<br />\ndance<br />\na<br />\nto<br />\ninvited<br />\nnight the entire squad was<br />\nkeeps the scalp in the healthiest conThe modern trend of male perwill<br />\nStudio<br />\nAtelier<br />\nThe<br />\nbooks.<br />\nof<br />\nand student<br />\nstores<br />\ndrug<br />\nwelfare<br />\nall<br />\nAt<br />\ndition.<br />\nthe<br />\nfor<br />\ncaring<br />\nand<br />\npartners<br />\nwere in evidence, providing<br />\nbarber shops.<br />\ndecoration<br />\nbrought<br />\nsonal<br />\nfrom<br />\nthis<br />\nphotographs.<br />\nthe<br />\nof<br />\ncare<br />\ntake<br />\nuntil<br />\nleave<br />\nnot<br />\ndid<br />\nteam<br />\nthe<br />\ntheir guests. And, despite the fact that<br />\nCRESEBROUGH MFG. CO.<br />\nAll individual photographs must the pen of Ellery Rand, a former<br />\n(Consolidated)<br />\nnearly midnight, several members of the delegation were at the staNew York<br />\nStreet<br />\nState<br />\nis<br />\nit<br />\nBaltimorean,<br />\nsaid.<br />\nMiss<br />\nRand<br />\nSlips<br />\nbe<br />\nduring<br />\nNovember.<br />\ntaken<br />\ntion in case there should be anything to be done.<br />\n—for rumor has it that this recordThe impression that the Hopkins football team received of Cor- may be obtained from William<br />\nof masculine fashions is a Miss—<br />\ner<br />\npictures<br />\nAs<br />\nas<br />\ngroup<br />\nDean.<br />\nmany<br />\nnell was a most favorable one and it was wholly imparted by the<br />\ngives<br />\nseven reasons in a recent artmonth.<br />\nthis<br />\ntaken<br />\nbe<br />\nwill<br />\npossible<br />\ncourtesy and attention bestowed by these members of the \"Red Key<br />\nicle<br />\nin<br />\nthe New York Times why<br />\ntaking<br />\nfor<br />\n.dates<br />\nof<br />\nschedule<br />\nA<br />\nSociety,\" an organization which has as its sole purpose the care and<br />\nmere<br />\nhas become color blind.<br />\nman<br />\nprepared.<br />\nbeing<br />\nis<br />\ngroup<br />\npictures<br />\nentertainment of visiting teams. Every Hopkins man who was on<br />\nEvery\"Vaseline\" Product is recommended everyimportation from<br />\nWar<br />\nreaction,<br />\nbe<br />\npostwill<br />\nwhere because ofitsabsoluteburityandeffectiveness.<br />\nthe trip will always carry in his mind the remembrance of \"Red Key\" Fraternity pictures<br />\nabroad by travelers, fearlessness of<br />\nseason.<br />\nrushing<br />\nafter<br />\nponed<br />\nuntil<br />\nhospitality.<br />\nSigma Chi Beta has, as yet, found no definite practical purpose<br />\n•<br />\nto justify its existence. It is an ideal organization for carrying out<br />\nthis<br />\nthat<br />\nsuggest<br />\nwe<br />\nsuch a program as does \"Red Key.\" May<br />\nHopkins body inquire further into the workings of the Cornell society.<br />\nWe feel that invaluable service can be rendered Hopkins in this<br />\nmanner.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nM{iyb© So<br /><br />\n_C<br /><br />\nTHRILLED?<br /><br />\nY<br /><br />\nVaseline.<br /><br />\nHAIR TONIC<br /><br />\nSILVER LINING<br />\nFighting gamely from whistle to whistle, the Hopkins football<br />\nteam found it impossible to stop the smashing line plunges and offtackle plays of the powerful Cornell eleven last Saturday. Despite<br />\nthe seemingly overwhelming score, however, there were several<br />\nbright spots in the game. Newspaper men, accustomed to seeing<br />\nthe \"Big Red team\" pile up the score on visiting elevens, were<br />\nunanimous in their praise of the spirit and gameness of the light<br />\nBaltimoreans. That Hopkins was battling every inch is illustrated<br />\nby the fact that the third quarter of Saturday's game was the first<br />\nperiod in which the Ithacans have not crossed the goal line of an<br />\nopponent during the present season. Cornell undoubtedly possesses<br />\nan eleven which ranks among the best three in the country and<br />\nthe final result of the game is not disappointing to the Hopkins<br />\ncoaches.<br />\nAnd, despite the gloomy predictions of local newspaper scribes,<br />\nCornell did not succeed in crippling the entire Hopkins squad. On<br />\nthe contrary, no one is suffering from more than the usual bruises<br />\nwhich are always prevalent after a hard-fought battle. Perhaps the<br />\ndefeat by the Ithacans will prove a blessing in disguise. It undoubtedly establistied an \"esprit de corps\" which has been more or<br />\nless lacking during the present season. And it gave the backs excellent defensive practice which they have .not had since the Princeton<br />\ngame.<br />\nCoach Van Orman is not at all pessimistic over the outcome of<br />\nlast Saturday's game. It is true that he is not saying much. We<br />\nfeel, however, that this is an omen of \"something brewing.\" There<br />\nare but ten days before the Maryland game and there is much that<br />\ncan happen in this time.<br />\nLast week we said: \"It can be done.\" We repeat it!<br /><br />\n1-3<br /><br />\nIi<br /><br />\nSi<br /><br />\nti<br /><br />\nVVhat a difference<br />\njust a few cents make !\"<br /><br />\nFATIMA<br /><br />\nA<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br />\n_CORNELL MAKES LARGE SCORE UNDERGRADS PRESENT A CLOCK<br />\nTO FORMER REGISTRAR AT<br />\nAGAINST HOPKINS AT ITHICA<br />\nASSEMBLY<br />\nContinued from page 1<br />\nContinued from page 1<br /><br />\nstood 26-0. Pfann, at quarterback, and Affeld, at center, were<br />\nlargely responsible for the smoothness and ease of the machine-like<br />\nbursts with which the New York<br />\nbacks crashed through Hopkins'<br />\nline. Affeld displayed marvelous<br />\nprecision in the fl oating passes<br />\nwhich distinguished his snappingback.<br /><br />\n3<br /><br />\nshall smoke within the buildings<br />\nROBBIN'S STYLE BUILT HATS<br />\nor on the grounds of the UniverFOR YOUNG MEN<br />\nsity.\" This matter will be brought<br />\nto the attention of the Student<br />\n122 W. BALTIMORE ST.<br />\nCouncil.<br />\nUppermost in the minds of the<br />\nFreshmen now is the Soph footGERHARD &amp; REED CO.<br />\nball game and class rush. It will<br />\nTAILORS<br />\nbe held December 8 or 15, depending whether the i.;,..arsity plays on<br />\n110 N. EUTAW STREET<br />\nthe 8th or not. A Zreshmen mass2nd Floor<br />\nmeeting has. been planned for the<br />\nnight before the game, the islogan<br />\nto be \"Beat the Sophs.\"<br />\nLIBERTY ST.<br />\nFreshmen are also considering<br />\nAT SARATOGA<br />\nthe election of an honorary member to help in class activities.<br />\nLUNCHEON<br /><br />\nence to the \"Meaning of Prayer,\"<br />\nby Harry Emerson Fosdick, and<br />\nespecinally to the chapter \"Prayer<br />\nas Dominant Desire.\" He quotea<br />\nMrs. Browning, \"Every wish with<br />\nGod is a prayer,\" to emphasize his<br />\npoint—that prayer has its foundation in worth while desires. Darwin and Edison, he said in their<br />\nintense desire to arrive at the truth<br />\nThird Period Scoreless<br />\nin their respective fields, were<br />\nCaptain Bunner and his team- praying.<br />\nDominant desire is not<br />\nmates staged a great rally during all, but a very 'large part, of<br />\nthe third quarter, keeping the Cor- prayer; a prayer must be lived as<br />\nnell eleven at arm's length until well as spoken. Dominant desire<br />\nFROSH-SOPH FOOTBALL<br />\nthe whistle blew. The work of the may lead to prayers of a wrong<br />\nCONTEST DEC. 8<br />\nteam through this period was very sort, as in the cases of the ProdiThe<br />\nFreshman<br />\npleasing to the J. H. U. coaches, gal Son and Bonaparte. In other<br />\n-Sophomore foot- 11.30 A. M.<br />\nuntil<br />\nbut in order to prevent any possi- words, the dominant desire must ball contest is scheduled for Decem7.30 P. M.<br />\nble injury to the regular players, be an honorable one.<br />\nber 8. In preparation for the tilt,<br />\nthey substituted practically a new<br />\nHorace Bushnell, a religious both<br />\nteams are practicing daily, as<br />\nteam for the varsity during the en- leader in New England, at one<br />\na result of which there is a marked<br />\nsuing quarter. These substitu- time in his life questioned all reimprovement<br />\nin both of them.<br />\ntions were made just .after a fresh ligious beliefs, questioned even<br />\nCoach \"Tom\" Landy is rapidly<br />\nstring of Cornell players had start- the existence of God. There reed the drive which resulted in the mained for him only the distinc- developing his proteges into proslarger score, making four touch- tion between right .and wrong; pects for the varsity for the years<br />\ndowns in ten minutes_ Cornell and his doininant desire to do the to come. Some of the men have<br />\nhad the ball •within ten. yards of right led him to, prayer, and ulti- already displayed excellent qualithe goal at the end of the game mately to restored faith.<br />\nties in the few games in which<br />\nand would have scored another \"Do you see, then,\" asked Dr. they have played. Among them<br />\ntouchdown had not the timekeeper Mills, \"the reasonableness of a are Stone (Capt.), Steinwald,<br />\nannounced the end of the game. week of prayer? Have in your Grinsfelder, Cone, Brian, Franck,<br />\nSo short ,vas the time left to make minds for but a moment a domi- Schlossberg, Gough, Broening, Nicthis last touchdown that the Cor- nant desire, and you have the be- olls, Blumberg and Brown.<br />\nnell quarterback, instead of wast- ginning of true prayer. And in<br />\ning time by calling signals, took your prayer consider not yourself<br />\ntime out announced the play to his alone, but your fellow students,<br />\nteam, and executed it without young manhood, and all mankind.\"<br />\nany signals.<br />\nBoost June Week •<br />\nLine-up:<br />\nRandolph Norwood announced<br />\nCornell (52)<br />\nHopkins (0)<br />\nthe plans for the collection of June<br />\nBuckley ......L.E....... . Berndt Week funds. Last<br />\nyear tags were<br />\nKearney<br />\nLT<br />\nMagill sold at a minimum price of<br />\n25<br />\n13erean ......L.G........ Barton cents. This arrangement<br />\nwas not<br />\nAffeld<br />\nCarr satisfactory, as no direct return<br />\nMorris<br />\nR.G.Wolbert was received for the money<br />\nspent.<br />\nSavage<br />\nR.T......... Carter This year, stamp books<br />\nwill be<br />\nRaymond<br />\nR.E.......... Rich distributed, and \"June Week<br />\nPfann<br />\n.Q.B......... Taylor Stamps\" will be sold at 25 cents<br />\nPatterson ...L.H.B..... Turnbull each. These stamps will be reRamsey .....R.H.B....... Bonner deemable at face value in purchasCassidy ......F.B<br />\n— 'Maxwell ing a June Week ticket later in<br /><br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br /><br />\nTEA<br />\nDINNER<br />\nSPECIAL PARTIES<br /><br />\nReady-to-wear Suits<br />\nReady-to-wear O'Coats<br /><br />\n211-213 E. Baltimore St.<br /><br />\nPLAZA 6987<br /><br />\nHub<br />\nBaltimore's Great<br />\nMen's Store<br /><br />\n.<br /><br />\nthe year. However, everyone must<br />\nSCORE BY PERIODS<br />\nCornell .......6 20 0 26-52 buy one stamp at certain intervals.<br />\nHopkins ......0 0 0 0—U Norwood said that every effort<br />\nTouchdowns—Cornell: Ramsey would be made to equal and bet(2), Pfann (3), Whetstone (3). ter the success of the first June<br />\nPoints after touchdowns—Pfann Week; and that the support of all<br />\nthe undergraduates would be nec(3), Whetstone (1).<br />\nessary<br />\nfor the undertaking.<br />\nSubstitutes—Cornell: HenderOn<br />\nSaturday,<br />\nNovember 24, at<br />\nson for Buckley, Rooney for<br />\nPfann, Whetstone for • Cassidy, 8.30, Sigma Chi Beta, an honBrigden for Raymond, Friend for orary fraternity, will give a dance<br />\nRamsey, Sullivan for Kearney, in the C. E. Hall. The dance will<br />\nTilton for Paterson, Hill for Sav- be limited to 75 couples. Anyone<br />\nage, Wallenmore for Morris, wishing to attend must secure his<br />\nTrousdell for Bereau, Reed for Af- ticket from a member of the sofeld. Johns Hopkins: Slowik for ciety at once.<br />\nCandidates for the BarnstormCarter, Cook for Max-well, Levy<br />\nfor Carr, Gilliece for Berndt, Mila- ers' production, \"Have You Bean<br />\nnausky for Wolbert, Carter for to Lima?\" are asked to report to<br />\nSlowik, Almy for Bonner, Duckett the Barn on Wednesday for tryfor Barton, Jacksnn for Taylor, outs.<br />\nBecause of conflicts in the use<br />\nYoung for Magill.<br />\nof<br />\nthe three large rooms—C. E.<br />\nTime of periods-10 an 0<br />\n. 12<br />\nHall, M. E. 110 and M. E. 109—<br />\nminutes each.<br />\nfor meeting, written permission to<br />\nSIGMA CHI BETA TO HAD DANCE use one of these rooms must be<br />\nIN C. E. HALL<br />\nsecured from Norwood, president<br />\nContinued from page 1<br />\nof the Student Council. In this<br />\nPlication is necessary due to heavy way unnecessary inconvenience<br />\nwill be avoided.<br />\ndemand.<br />\nThe following men will be initiated into the fraternity: John W. FRESHMAN CLASS MEETING<br />\nParsons, John S.' V. B. Shriver, Freshmen have been having<br />\nR. Carmichael Tilghman, Malcolm trouble in arranging their social<br />\nGilpin, William N. Krout, Donald activities. The Student Council<br />\nR. Reese, W. Carville Gardner, Ed- disapproved of a Freshman (lance,<br />\nward Watson, Fitzgerald Dunning, and suggested a smoker. At<br />\na<br />\nJohn Cochran, Gordon Post, R. class meeting last Wednesday it<br />\nPage O'Connor, Douglas Turnbull, was brought to the attention of<br />\nWilliam Harrison, Miles Marrian, the class that, according to FreshA. K. Mitchell.<br />\nman Bible, Rule 4:\"No Freshman<br /><br />\nMost popular<br />\ncollege sport<br /><br />\nPublished in<br />\nthe interest of Electrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br /><br />\n$30 up<br />\n$35 up<br /><br />\n\"As I look back on my college days,\" said the<br />\nold grad, \"it strikes me there were more men playing blind man's buff than all other games combined.<br />\nI understand this is still the case.<br />\n\"Get me straight. It was no child's play. What<br />\nwe were groping around for was pretty serious<br />\nbusiness—nothing less than a career.<br />\n\"Too many men are in the dark as to what they<br />\nwill do after graduation. Either they neglect to<br />\nspecialize in anything, or hastily select a major which<br />\nthey afterwards regret.<br />\n\"I know I would be considerably ahead in<br />\nbusiness if back at college I had sat down for a few<br />\nhours'earnest thought to find out just what work I<br />\nliked best—and then gone in for it heart and soul.<br />\n\"Pick the thing that appeals to you, and don't<br />\nlet them tell you that particular line is overcrowded.<br />\nTalk this over with graduates you know. Talk it<br />\nover with your professors. Talk it over with the<br />\nindustrial representatives next Spring. Most of all,<br />\ntalk it over with yourself.<br />\n\"The main thing is to get on the right track and<br />\nto keep going. There's no fun in being 'It' in the<br />\ngame oflife, with every change in fate ready to push<br />\nyou offan uncertain course.\"<br /><br />\nstern Ream Company<br />\nWherever People look to electricity for the<br />\ncomforts and conveniences of life today, the<br />\nWestern Electric Company offers a service as<br />\nbroad as the functions of electricity itself.<br />\nNumber 32 of a series<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1923<br /><br />\n4<br /><br />\n, November 21. 0.D. K. TO HAVE INITIATION<br />\nINTERFRATERNITY CONFER- ENGINEERING UPPERCLASS- low pn Wednesday<br />\nContinued from page 3<br />\nHis last lecture of the week will<br />\nMr-N HEAR ADDRESS ON<br />\nENCE TO ORGANIZE<br />\nof the faculty memCOPPER REFINING<br />\nbe given Friday, November 23,, tiates, several<br />\nNEW NATIONAL<br />\nHopkins Students Guests of Engineers' and will cover \"Reality and Fic- bers and many of the alumni.<br />\nClub at Interesting Lecture<br />\nA full-fledged national college<br />\nThe senior classes of the last two<br />\n20 junior and senior en- tions in the Life of Social Groups.\"<br />\nAbout<br />\ncoast<br />\nfraternity, stretching from<br />\nhave unanimously voted memyears<br />\nThe final lecture of the series<br />\nat Johns Hopto coast, will be formed at the an- gineering students<br />\nin Omicron Delta Kappa<br />\nbership<br />\nmonthly will be delivered the following<br />\nnual Interfraternity Conference to kins attended the regular<br />\nSociety as the greatest<br />\nHonorary<br />\nsection week, Monday, November 26. Its<br />\nbe held at the Hotel Pennsylvania meeting of the Baltimore<br />\nman can receive<br />\nHopkins<br />\na<br />\nhonor<br />\nof Elec- title will be \"Public Service.\" The<br />\nNovember 30 and December 1. of the American Institute<br />\nthe men who<br />\nthat<br />\nsurety<br />\na<br />\nso it is<br />\nlast Friday entire course will be given in. the<br />\nThis will be the first time that a trical Engineers, held<br />\nof the laurel<br />\nrecipients<br />\nthe<br />\nwill be<br />\nthe Engi- Civil Engineering lecture room.<br />\nnational society will have been night, Novemb:tr 16, at<br />\nbe heartily<br />\nwill<br />\nEach lecture will start at 5 o'clock leaf next Thursday<br />\nneers Club.<br />\ngrown.<br />\nfull<br />\nbeing<br />\ninto<br />\nbrought<br />\ncongratulated by the entire student<br />\nSanford's<br />\nof on the evening of their respective<br />\nare<br />\nmembers<br />\nwho<br />\nmen,<br />\nTheje<br />\nfranew<br />\nthe<br />\nof<br />\nformation<br />\n111<br />\nThe<br />\nPEN<br />\nfNNTAIN<br />\nbody.<br />\ndays.<br />\nEASY- FLOWING<br />\na lengthy investi- the Materials of Engineering<br />\nfollows<br />\nternity<br />\nSANFORD MFG CO<br />\nmeeting,<br />\n\"The<br />\ngation by_the Interfraternyty Con- class, attended this<br />\nthe offiference which led it to the opinion through the courtesy of<br />\nINK<br />\nsection, to<br />\nthat far too few college men are. cers of the Baltimore<br />\nPOSSIBLE\"<br />\nPen<br />\nFountain<br />\nJr., generThat Made the<br />\nand individuality is offered here at prices that are not<br />\ngiven the opportunity of fraternity hear Mr. E. W. Rouse,<br />\nCopand cannot be underquoted by any house at any time.<br />\nfellowship. Invitations were sent al manager of the Baltimore<br />\nand Rolling Com(,Besides the reputation of an old-established firm<br />\nto most of the local fraternities in per Smelting<br />\n\"The<br />\non<br />\naddress<br />\nan<br />\ndeliver<br />\npany,<br />\nis back of each sale with a guarantee.<br />\nthe United States to be present at<br />\nCopper.\"<br />\nof<br />\nRefining<br />\nElectrolytic<br />\na meeting held in conjunction with<br />\nMr. Rouse graphically presentJOHN C. KNIPP &amp; SONS<br />\nthe annual Interfraternity Confervarious<br />\nence for the purpose of forming at ed to the members the<br />\nDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nore<br />\ncopper<br />\nraw<br />\nthe<br />\nwhich<br />\nstages<br />\nfraternity.<br />\nnational<br />\nnew<br />\none<br />\nleast<br />\n343 NORTH CHARLES STREET<br />\nMore than fifty locals have al- goes through, until it finally is macopper<br />\nready signified their intention of chined into the varied<br />\nLimited<br />\nbeing present for that purpose. In products turned out by the Baltiaddition 32 interfraternity councils more Copper Company.<br />\nThe following day, Saturday.<br />\nERIA<br />\nCAFET<br />\nBARN<br />\nare sending undergraduate dele23, the class visited the<br />\nNovember<br />\nas<br />\ngates, some coming from as far<br />\nBaltimore Copper<br />\nthe<br />\nof<br />\nplant<br />\nCalifornia. A score of educators,<br />\nto see at first<br />\nCanton,<br />\nat<br />\nCompany<br />\n• Ei.IE3g g • IElE,<br />\n:gait it= FBOE3 • I • Dal<br />\namong them several college presidescribed by<br />\noperations<br />\nthe<br />\nhand<br />\ndents, will be present to join in<br />\nbefore.<br />\nnight<br />\nthe<br />\nM.<br />\nr<br />\nRouse<br />\nthe discussions of college and fraby Drs.<br />\nheaded<br />\nparty,<br />\nThe<br />\nternity problems with the Conferof the<br />\nen,<br />\nKouwenhov<br />\nand<br />\nence delegates, which will number Christie<br />\nengimechanical<br />\nof<br />\ndepartment<br />\nclose to 250.<br />\nat 2<br />\nworks<br />\nthe<br />\nat<br />\narrived<br />\nneering,<br />\nJr.‘;1107012- , 01111,5<br />\nconducted<br />\nthen<br />\nTHE<br />\nwere<br />\no'clock and<br />\nNEED FOR MORE MEN IN<br />\nCLUBS<br />\nMUSICAL<br />\nthrough the plant by officials of<br />\ns\"<br />\nLubricant<br />\nof<br />\n\"The King<br />\nBoth Mr. dcCau1ey and Mr. the company.<br />\nSHERWOOD BROTHERS, INC.<br />\nBochau are encouraged by the<br />\nWilliam and Mary College has<br />\nspirit and work of their clubs. AlREINNEIgEtEEIENEINCIECIENNKNNITIOCCID<br />\nrecently purchased about 260<br />\nthough the Mandolin Club has thiracres of land for a new and modty-two candidates and the Glee Club<br />\nern athletic field. It will have<br />\nsixty-five, there is a need for guitwo football gridirons, two baseBoys, the place to get your<br />\ntars and first tenors. Freshmen who<br />\nball diamonds, and a quarter-mile<br />\nmeals—and they are honhave not affiliated themselves with<br />\ntrack with a 220-yard straightthe club and find themselves musitest-to-goodness meals, well<br />\nway.—The Flat Hat.<br />\nally inclined are asked to join.<br />\nserve d, and reasonably<br />\nMr. McCauley is carrying on the<br />\nTHE JAMES SCHOULER<br />\npriced—is at<br />\nsame program at Hopkins as he is<br />\nLECTURESHIP<br />\nSir Paul Vinogradoff, Corpus<br />\nat Goucher. Goucher produces a<br />\nclassical type, including \"The Professor of Jurisprudence in the<br />\nIn buying a Stetson you need only be conEnchantment Waltz,\" \"Lom du University of Oxford, will arrive<br />\na<br />\ngive<br />\nBal,\" \"College Medleys,\" and one next week at Hopkins to<br />\ncerned with the style—the quality is guaranRESTAURANT<br />\nRelations<br />\nexception, -On the Back Porch.\" lecture course on \"The<br />\nteed by the name “Stetson\".<br />\n1817 N. Charles St.<br />\nSuggestions have been made to hold of Political Science and JurispruSTYLED FOR YOUNG MEN;<br />\na joint concert with Goucher's mu- dence.\" The course will consist<br />\n(Half Block below North Ave.)<br />\nof four lectures, the first to be desicians.<br />\ndevoting<br />\nbeen<br />\nhas<br />\nlivered Monday, November 19. It<br />\nClub<br />\nGlee<br />\nThe<br />\nNicholas Brown, Mgr.<br />\nits time thus far to the ,\"Ode,\" will cover the subject, \"The So-Hunter's Farewell,\" and \"John cial Background of Juridicial DocAnderson.\" The importance of the trines.\" The second lecture of the<br />\n\"Ode' has been emphasized and spe- course, dealing with \"Moral and<br />\ncial attention has been given to it. Juridicial Responsibility\" will folPrinters of Philological and<br />\nAt the Washington Monument<br />\nScientific Works<br />\nOscar Thomas Olson, D.D.<br />\n23 S. HANOVER ST.<br />\nMd.<br />\nBaltimore,<br />\nMinister<br /><br />\nRef 1 With<br />\nORD'S<br /><br />\nFURNITURE OF QUALITY<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nMOB<br /><br />\nSTETSON<br /><br />\nBats<br /><br />\nThe St. REGIS<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\ni<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nHOSIERY<br /><br />\nelfreisigaffa▪i<br />\niimmoollWO▪ OF<br /><br />\n11.94.411-sji<br />\n444<br />\n'<br /><br />\nir<br /><br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br /><br />\nar<br />\nillarit<br />\nnsgawr<br />\nmourammai<br /><br />\nmowdormot fe<br />\nrg grt,<br />\n0or4,<br />\ndiA.<br /><br />\nThe purpose and program of th:s<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nfrom five to seven.<br /><br />\n4<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Si:k Ba,ners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nNLY those<br /><br />\nO<br />\ncan judge the quality<br /><br />\nSunday even<br /><br />\nsmoked Melachrinos<br />\n\"At the heart of the City\"<br /><br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PFR MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nURNER BROTHERS<br />\nII I E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nALL SEATS FREE<br /><br />\nRENT A CAR<br /><br />\nORIGINAL<br /><br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nservice at 8 o'clock.<br /><br />\nMusic by vesteo chorus—choir of soloists.<br /><br />\nof the finest Turkish<br />\ntobacco.<br /><br />\nMELACH NO<br /><br />\ning worship at 11 o'clock.<br /><br />\nSunday m<br /><br />\nwho have<br /><br />\nDRIVE IT YOURSELF CO.<br />\n-<br /><br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />"}], "field_media_file": [{"target_id": 37793, "display": null, "description": null, "target_type": "file", "target_uuid": "69d86c68-f0ba-46a3-804b-905be9163aca", "url": "http://digital.library.jhu.edu/system/files/2022-03/13086-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13086, "target_type": "node", "target_uuid": "d090d1c4-1feb-4a24-a0de-fffccf76ad1a", "url": "/node/13086"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e9becba4-dadc-438a-ba13-cfab2ee7a731"}]}