{"mid": [{"value": 35697}], "uuid": [{"value": "1f5efa06-08fe-4792-a439-24c4b1bbf5ba"}], "vid": [{"value": 35697}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12234-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol, VII, No.<br />\n<br />\n9<br />\n<br />\nFebruary 19, 1903<br />\n<br />\nTHE<br />\n<br />\nNEWS LETTER<br />\neVb<br />\n<br />\n'W.<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns Hopkins Prob.<br />\n<br />\nThe Johns Bookins Universitu<br />\nBALTIMORE, MARYLAND.<br />\nI.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br />\nPresident: IRA ItEMSEN. Dean of the Medical Faculty:<br />\nW ILL(AK H. How ism,. Dean of the Co/lee Faculty:<br />\nBowsaw H. GRIFFIN.<br />\n<br />\nEntertain Chemical aournal.<br />\nI. RENSEN, Editor Monthly, 8vo. 'Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. limerican aournal of !Philology.<br />\nII. L. 01 1,DE1tSLEE V E, Editor. Quarterly. eve.<br />\nVolume X Xli 1 in progress. $3 per volume.<br />\n1.<br />\n<br />\n.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for midi(bites for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n. (d) As special students.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory,<br />\nEconomies.<br />\nMathematics.<br />\nPhysics.<br />\n<br />\nfive.<br />\n<br />\nStubies in lbistoriOI ant, POlitkal Selene. ;<br />\nMonthly. livo. Shries 'X X 1 in Progress. $11 pe<br />\nvolume.<br />\n3ohtis Thophins 'University Circulare.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII la<br />\nprogress. $1 per year.<br />\n<br />\nIX.<br />\n<br />\nContribujions to Essyrioloor ant, Comparative<br />\nzur A my rioloi,00, etc.)<br />\nSemitic p<br />\n!bliototir,<br />\n<br />\nX.<br />\n<br />\nMemoirs from the /Biological /Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nVol. IV complete.<br />\n<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nLaboratories.<br />\n<br />\nStubies from the ifliolocilcril /Laboratory.<br />\n,<br />\nVolume V complete. $5 per volume.;<br />\n<br />\n11)11. 3ohns booking /hospital Velletin. 1i/tenthly. 4te.<br />\nVolume XIV in progress $1 per year.<br />\n0111. 3obno 1hopkins lhospital /Reports. 4to. Volume X1<br />\nIn p rogress. $5 per volume.<br />\n<br />\nLibraries.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nTolima<br />\n<br />\nII.<br />\n<br />\nL<br />\n<br />\nInstruction.<br />\n<br />\nEmerican 3ournaI of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $6 per tolume.<br />\n<br />\nDirectors.<br />\nIra Emmen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Sm 1th.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. 4Thissical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading u ri to medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\nIS. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journat of Philology (vol XXIII).<br />\nStudies an Historical arid Political Science(vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from rho Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars (vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nXI.<br />\n<br />\nMobern /Language Votes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1 50 per volume.<br />\nX111. 3Ournat of /Experimental Mebicine.<br />\nW. 11. WELCH, Editor. Ili-monthly. 8vo. Volume<br />\nV1 in progress. $5 per volume.<br />\nX1111. Emerican 3ournal of Insanity.<br />\nII EN RY M. H U RI), Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\n1Reporte of Marelanb Ocological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nf11/.<br />\n<br />\nterrestrial Magnetism ant) Iltmospberic Elec.<br />\nWelty. L. A. BAITER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br />\n<br />\nrvi.<br />\n<br />\nannual /Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the pest academic year.<br />\nttnnual Valli/ter.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. 1'11111 !Irrupt- Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Haspital. J. S. Billings, Editor. 116 pp. 4to. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fae-simile edition. Edited by .1. kende] Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomona Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia HopkIneiensie. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geo ogy. Parts<br />\n1 V-V-V1. Physies.Astronorny and Mathematics%<br />\nvo. 30 cents per part.<br />\nII tell list of publications will be sent on application.<br />\n<br />\nCommunications in respect to exehanges and remittanees<br />\nmail be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n101<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nFEBRUARY 19, 1903.<br />\n<br />\nNo. 9.<br />\n<br />\nCOLLEGE MEN IN BUSINESS.<br />\n<br />\ncw<br />\n<br />\nHILE it may seem presumptious for younger men to offer opinions about<br />\na subject so much discussed by our elders, the suggestion prompts itself that the college graduate who has been in business only a few years<br />\nwill be more respected as a judge, when it is remembered that he is closer to the<br />\ntwo conditions of life, and is more susceptible.<br />\nAs a brief prelude, a few words about the length of an ideal college course<br />\nseem applicable. The many advocates of college training for men tell that this<br />\nincipient period of life is most in need of scientific care, for it is the chrystalizing stage,—a time when the hardening cast must be taken from the mould. Entering into business means undertaking a life pursuit, and a decision cannot be<br />\nsummarily dismissed. While it is true that most men commencing business<br />\nare not permitted by circumstances to choose their exact branch, it must be admitted that a man who knows his own propensities, can by dint of determination fulfill his ambition at a later time. So that without venturing an opinion<br />\nas to the exact number of years to be spent in college, it is safe to say that the<br />\ncast must be formed, and tempered to the atmosphere before being exposed to<br />\nthe elements.<br />\n.<br />\nAside from the general polish and completeness that a college course gives<br />\nto all, the most refreshing observance that one makes of college men in business<br />\nIS the seriousness with which they view their life occupation. In the classes<br />\nof undergraduate years, in the self imposed work on college periodicals and in<br />\nathletics, it has been discovered that system and responsibility are essential to<br />\nall successes, and the ones who attain proficiency, or even mediocrity in any of<br />\nthe college associations necessarily absorb most of the serious and solid elements of life.<br />\nThe time taken up, and the exaggerated value that bachelors of art are apt<br />\nto set upon themselves, are the chief arguments advanced against a college degree for business men. In most cases, however, the time lost means only a<br />\ntemporary delay, and the first objection seems very easily overcome. Of course,<br />\nthere are many positions from which promotion can only be had in routine<br />\norder. In answer to this, it must be said that college men are brain-workers<br />\nand not machines, and that wherever there is a chance to excel and to be<br />\nrecognized, the college man will receive and accept business principles as such.<br />\nHe knows that discrimination must be exercised in all cases, and that no rule<br />\nLS to be blindly followed. The barrier that is most insurmountable to those<br />\nnot benefited by the training of college work is an apparent inability to consider the pay received and services rendered in any other than an invariable<br />\n<br />\n1111111.—__<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nratio. The latter must not be in excess until the former is increased, but the<br />\nsalary is not increased while the value of the work remains the same, and an<br />\ninflexibility results. This might serve as an illustration of the absurdity of<br />\nknowing no more mathematics than the rule of three.<br />\nThere is a remarkable resemblance between the results obtained by the<br />\nmethods of science and of business. The scientist commences with very simple<br />\nexperiments and forms laws from the similarity of phenomena observed; these<br />\nlaws are generalized and made into truths of wide application. The scientist is<br />\nnot satisfied with the laws and truths verified by the experimental method; the<br />\nrealm of experience must be transcended and sweeping theories of universal<br />\ncause and effect are given to the public. Likewise the business man starting<br />\nout in a very unpretentious way, at first engages in the grocery trade, or becomes a clerk in a banking house. After he has learned the axioms and first<br />\nproblems of commerce and finance, he applies broader laws, and forms combinations of enterprises which formerly were conducted under various specific<br />\nprinciples. When it seems that he has reached a height of surpassing emi<br />\nDeuce, there is no ambition unfulfilled but the Titanic undertaking of a worldempire founded on commercial theories.<br />\nAt the very first, the college man recognizes the scientific value of inductive reasoning. He sees that there are far reaching theories in business,<br />\nand he understands that their correct application can be attained only by the<br />\ninductive method. There is something ahead to make the first essays more<br />\nthan mere mechanical effort, which should be classed with day labor. His conscientious labors are what might be called scientific endeavors to possess the<br />\nright of trying one's own view upon those interesting theories. The remuneration is, as it were, incidental,—a sort of testimonial of his success with the<br />\nearly experiments, by which the doctrines of final cause can only be reached.<br />\nBy thus mastering the work, and always striking higher, that rule of three<br />\nwhich was so stubborn to the one un versed in higher mathematics, is fitted in<br />\nwith the other laws. Advancement comes with a rush. In a short while, the<br />\ncollege man has caught up with the non college man who started years ago.<br />\nIn fact he is far ahead, for by virtue of his assimulation of the principles of his<br />\nwork and with a broadened mind, he is more capable of filling higher positions.<br />\nTo express it by an apt comparison, he has gained more momentum than the<br />\nother man who has reached the same point.<br />\nWhile it is no doubt very true that the college graduate is most prone to<br />\nplace an unreal value upon himself, there is much that can be said in defense.<br />\nIf this over-estimation is inherent, then it is not the college-course that has<br />\ncreated the evil, but a defect of the individuality of the man. On the other<br />\nhand, if the trouble is merely incidental to the distinction of a degree, the temporary aberration will wear away with the novelty of possessing an inscribed<br />\nsheepskin. At any rate, when the newly-created bachelor begins to be held<br />\nagainst the hard grindstone of the world, the rough points will soon be ground<br />\noff, and as this excessive self-appreciation is the most prominent, it will receive<br />\nthe earliest attention.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nAfter all, it is the real inner qualities of the man that tell. Without unusual mishaps, these will come out in spite of anything else. Every athlete<br />\nknows that pluck and endurance win in all cases except under extraordinary<br />\ncircumstances. Even if we yield a point here in saying that intrinsic merit<br />\nmust succeed, it can he urged that the college man has a trained sense of intel<br />\nlectual enjoyment. No concessions are necessary, however, as the athlete is<br />\nfully aware that conscientious preparation is absolutely essential; when this is<br />\ncompleted there is a brief rest before entering in the long struggle of the crucial<br />\ncontest.<br />\nCollege life has been termed \"a miniature world.\" This comparison more<br />\nthan anything else will illustrate the great profit that the business man gets<br />\nfrom college. If, as we believe, a consideration of the time phase of the question is of no weight, it is manifest to all that the man who has had experience<br />\nwith his fellow men on equal terms, who has applied business principles in the<br />\nmany elements composing a student's life, and who has formed a true idea of<br />\nthe qualities essential to every success, undoubtedly has a sure foundation for<br />\nJ. M. MULLEN,'99.<br />\na Proper beginning.<br />\nCOMMEMORATION DAY PROGRAMME.<br />\n<br />\nt<br />\n<br />\nHE 26th anniversary celebration will be held in McCoy Hall, on next<br />\nMonday, February 23rd. The exercises, which will begin at 11 o'clock,<br />\nwill consist of addresses, conferring of the degree of Doctor of Philosophy<br />\nupon several candidates, and announcements of recent donations to the University. Edwin A. Alderman, L. L. D., President of Tulane University, will<br />\ndeliver the principal address. His subject has not yet been announced.<br />\nThe Alumni Association will hold its annual gathering at the Carrollton<br />\nHotel the same night. A short business meeting will first be held, at which<br />\nthe,following gentlemen, who have been nominated by the Executive Committee<br />\nof the Association, will be elected to hold office for the coming year.<br />\nFor President—Frederick Morris Warren, Ph. D.,'87, of New.Haven, Conn,<br />\nFor Secretary—Mr. Alfred Jenkins Shriver, A. B.,'91.<br />\nFor Treasurer--Mr. Reuben Carll Foster, A, B., '95.<br />\nFor Members of the Executive Committee to serve for two years—Messrs.<br />\nWilliam Thompson Sedgwick, Ph. D., '81, of Boston; Joseph Sweetman Ames,<br />\nPh D., '90; Henry Winslow Williams, A. B., '83; Charles Carroll Marden, Ph.<br />\nD„ '94, and Harvey Brinton Stone, A. B., 1902.<br />\nAt the banquet following the meeting, Prof. William T. Sedgwick, of Boston, president of the Association, will be toast-master. Among those who are<br />\nexpected to be present and will speak are: President Ira Remsen, President<br />\nDaniel C. Gilman of the Carnegie Institution, President Alderman of Tulane<br />\nUniversity, Dr Albert Shaw of New York, editor of the Review of Reviews;<br />\nProf. Henry Donaldson, dean of the Graduate School of the University of Chicago, and Mr. Theodore Marburg.<br />\nThe members of the committee which has charge of the arrangements for<br />\nthe dinner are: Dr. Henry Barton Jacobs, Dr. Henry McE. Knower and Mr.<br />\nCharles Edward Brooks.<br />\n<br />\n\f-4<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nHOME CONCERT OF THE MUSICAL CLUBS.<br />\n<br />\ne<br />\n<br />\nHR management of the University Glee, Banjo and Mandolin Clubs has<br />\nselected Friday, February 27, as the date for the Baltimore concert, and<br />\nit is hoped that the student body and the friends of the University will<br />\nturn out in full force to show their appreciation of this prominent manifestation<br />\nof college spirit. In doing so, they should remember that this is the concert on<br />\nwhich the financial success of the clubs for the year is largely dependent, and<br />\nthat a prosperous year means money for the athletic teams. Last year the<br />\nsupport given the clubs was commendable, and there, is no reason why the same<br />\ninterest should not be shown this season.<br />\nTo take another point of view,—nobody need be afraid of not getting the<br />\nworth of his money, for the program offered by the clubs this. Year is unusually<br />\nattractive. The men on all three of the clubs have worked faithfully since October; and, inspired by their smaller triumphs, will, no doubt, do their utmost<br />\nto make every one feel proud of the University's musical clubs on this occasion,<br />\nThe Glee Club this year has had more material to choose from than in<br />\nformer years, and the result is apparent. Many of the medical men have come<br />\nover, and most of them have trained their voices by experience on clubs of<br />\nother colleges. The leader, W. B. Carver, of the graduate department, has two<br />\nexcellent medleys, besides the usual Hopkins songs and other glees.<br />\nThe quartet this year has been selected with much care, and is composed of<br />\nMessrs. Coffin, Hall, Ford and Gilman. Mr. Gilman will sing solos. His<br />\nvoice is better this year than ever, and his selections are admirable.<br />\nThe Banjo Club is especially strong. \"Charley\" Marshall is leading<br />\nagain, and he has managed to correct the few defects of last year's club. One<br />\nof the hits this year is the \"Coon Quartet.\" In addition there is a popular<br />\nmedley, and three rattling marches.<br />\nEdgeworth Smith is working hard in graduate history and politics, but it<br />\nis hoped that he will be prevailed upon to give a banjo solo.<br />\nThe Mandolin Club, under the leadership of J. Wallace Bryan, '03, presents a large and varied collection of pieces,—a waltz by the author of<br />\n\"Amoureuse,\" hits from \"The Prince of Pilsen,\" \"Mr. Pickwick,\" a march by<br />\nVictor Herbert, and Sousa's latest,—played recently before His Majesty of<br />\nEngland,--`'Imperial Edward.\"<br />\nOne of the most attractive numbers will be the \"Song of the Toreador,\"<br />\nfrom Francis Wilson's opera, by the combined Glee and Mandolin Clubs.<br />\nThose who were at the concert of 1901 remember what a fine effect was produced by these two clubs when they accompanied the soloist in the \"Princess<br />\nChic\" song. Then, too, a funny \"stunt\" man is promised, so that all tastes<br />\nwill be suited. The only thing that is needed to make the concert an entire<br />\nsuccess is a fine audience.<br />\nLast year nearly the whole Woman's College attended, and these girls are<br />\nexpected this year. Surely, with this extra inducement, every one from the<br />\nHopkins will be on hand! .<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nFEBRUARY 19, 1903.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n.<br />\n<br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1908.<br />\n. GEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nW. S. BIRD, 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br />\n<br />\nAddressall articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopking University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY EAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\nINIIIM1111111.111<br />\n,<br />\n<br />\nt<br />\n<br />\nHE Honor System has now been discussed by all three classes, and a definite conclusion reached. Under present conditions perhaps the best way<br />\nout of the difficulty has been chosen. There was no protest against the<br />\nnecessity of action being taken. All the classes were united in agreeing that the<br />\nlittle irregularities incident to examinations should he done away with by the<br />\nforce of public opinion. In the future he will have to be a brazen man indeed<br />\nwho will fly in the face of the emphatic convictions of the undergraduate body.<br />\nSoon after the opening of the first term next year, and in all future years no<br />\ndoubt, men from the upper classes will explain to the new men what the sentiments of the undergraduates are on this subject, and after this exposition of<br />\nHopkins ideals there can scarce be any fear of a transgression of the spirit or<br />\nthe letter of the law.<br />\n<br />\nN many respects the games held at the Armory last Saturday were eminently<br />\nunsatisfactory. As usual there seemed to be a desire on the part of those<br />\ninterested to give Hopkins the worst of everything wherever there was the<br />\nslightest chance Yet it can hardly be said that much partiality was shown in<br />\ngiving us the worst of it, as some others of the contestants did not get the best<br />\nof treatment at the hands of the officials. The opinion was expressed generally that never had there been a worse set of handicaps. It is customary in a<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER,<br />\n•<br />\n<br />\n7<br />\n<br />\nhandicap.race for the scratch man to have some slight chance of making a bid<br />\nfor a place; but in these games the scratch man was beaten before the gun was<br />\nfired. Unless some gentleman made a false statement on his entry blank we<br />\nare at a loss to understand why a man with a record of 2.11 4-5 in the half mile<br />\nwas put on scratch with a man who has a record of 2.01. Such handicapping<br />\nas this deserves to be investigated.<br />\nOne of the rankest decisions handed out was the one disqualifying Freeze<br />\nIn the quarter. He ran a pretty race and finished second. But one of the inspectors disqualified him for interfering with another man. The facts in the<br />\ncase were that the other man stepped on Freeze's heel and was entirely to<br />\nblame. But the inspector, who was by no means a disinterested person, disqualified Freeze. After it was over he admitted that he had done wrong, and<br />\nexcused himself by saying to one of our men, \"You know that I did not know<br />\nthat it was a Hopkins man, or I should never have done it.\" If he was honest<br />\nwe cannot see why he should endeavor to disqualify anyone unfairly.<br />\nThis same inspector, holding the position he does, as a trainer at one of the<br />\npreparatory. schools, he should never have been permitted to act as an official,<br />\nwas seen to coach his men as they passed his turn; he was also miserably blind<br />\nwhen Randall was fouled by a Pennsylvania man. If he believes that these<br />\nmethods are conclusive to clean and sportsmanlike athletics the NEWS-LETTH:R<br />\nbegs to differ with him. A man who has played such an important part in college athletics should be above such petty devices which smack more of the professional sport, who will win at any cost, than of amateur athletics.<br />\nIn the dash some interesting things were brought to light. In the afternoon when a man fell over his marks he was put back a foot, if he was put<br />\nback at all. Later this was excused by the starter declaring that he was ignorant of the rules. A man so ignorant should not be allowed to officiate. He<br />\nalso let the men jump the gun; however, this is something which even the best<br />\nstarters are not able to guard against all the time. Yet for this reason two good<br />\nHopkins sprinters lost the opportunity of getting in the finals.<br />\nHandicap games are never satisfactory, and these were less so than any<br />\nheld in Baltimore fot a long time. The public is not anxious to pay its money<br />\nso see a lot of third and fourth rate runners gallop around the track while the<br />\ngood men are so hopelessly handicapped that they are never in the race. The<br />\nshowing Hopkins made was as good as could be expected under the circumstances. All we can do is to' pull ourselves together and hope for better luck<br />\nnext time.<br />\nThis protest against the methods which characterized the games is made<br />\nnot only on behalf of Hopkins, but on behalf of all the men who were victims<br />\nof unfortunate circumstances.<br />\nof so many good chess players at the University should not go<br />\nunnoticed. In the past the chess clubs were always centers of interest,<br />\nand it seems strange that this year has not found the men once more engrossed in the royal game. Not only could an interesting tournament be played<br />\namong the men of the University, but games with other colleges could be ar-<br />\n<br />\n; presence<br />\nZHI<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nranged. Hopkins has too long maintained a position of \"splendid isolation.\"<br />\nOne of the most gratifying signs of a new era is the proposed southern tour of<br />\nthe Track and Field Team during the Easter holidays. We should endea,ror to<br />\nestablish friendly relations with other Universities as soon as possible in every .<br />\nbranch of friendly rivalry. Not only may we hope for an inter- collegiate chess<br />\ntournament, hut some day our golf club, our gun club, and our hockey club<br />\nmay he able to compete with their fair share of success with other representa<br />\ntive teams. It is not too late to organize a chess club this year, and anything<br />\ndone now will be so much gained toward giving the game a foothold next<br />\nseason.<br />\n<br />\nR. W. M. MACKDERMOTT, official<br />\n<br />\ncoach, and Mr. R. C. Hoffman,<br />\nJr., captain of the Track and Field Team, are quietly making arrangements for a southern trip during the Easter vacation For some time<br />\nthey have been considering this step, and they hope to end the negotiations<br />\nwithin a few days. Nothing definite can be given to the public at this time,<br />\nbut the NEWS LETTER has been assured that if the trip is made it will be in a<br />\nstyle befitting the University. Nor is it known how many will he • taken, but<br />\nwe may be sure that not less than twenty men will compose the team. Notwithstanding certain weak spots the team is particularly strong this season,<br />\nand may be depended upon to make a good showing in any dual meet. It is<br />\nidle to prophesy what events we may win and what ones we may lose but even<br />\nif we lose a majority of the points the fact that we made the trip will be to our<br />\ncredit. We are seriously handicapped by the lack of an athletic field. It is a<br />\ngreat test of a man's devotion to require him to go to Electric Park to train. It<br />\ntakes time which a number of men, especially those from the Medical School,<br />\ndo not feel that they can spare. If some place nearer the University could be<br />\nfound, no doubt the personnel of the team would be strengthened by the addition of a number of men who, under the present conditions, cannot find the<br />\ntime to devote to the work.<br />\n<br />\nTI<br />\n<br />\nTHE CARNEGIE INSTITUTE GRANTS.<br />\nN February 9, Dr. Remsen announced that the Trustees of the Carnegie<br />\nInstitution have made the following grants to members of the University:<br />\n1. To Professor H N. Morse, the sum of fifteen hundred dollars to enable<br />\nhim to engage a Research Assistant in his work on Osmotic Pressure. The<br />\nAssistant is Dr. J. C. W. Frazer.<br />\n2. To Professor R. W. Wood, one thousand dollars for a Research Assistant in connection with his researches in the domain of Physics. His Assistant<br />\nis Mr. T. S. Elston.<br />\n3. To Professor J. J. Abel, one thousand dollars to aid him in his<br />\nresearches in Physiological Chemistry. He needs very costly material, which<br />\nhe has hitherto been obliged to make; this grant obviates the expenditure of<br />\nconsiderable time in making these substances required.<br />\n<br />\nO<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\n4. To'Professor H. C. Jones, one thousand dollars for a Research Assist<br />\nant to carry on investigations in the field of Physical Cnemistry. His Assistant,<br />\nbeginning next September, will be Mr. F. H. Getman.<br />\n5. To Dr. J. B. Whitehead, twelve hundred dollars, enabling him to<br />\ncontinue his researches begun two years ago on the vIagnetic Effect of Electric<br />\nDisplacement. The work involves the making of apparatus for which the<br />\nservices of a mechanic are required.<br />\nThese appropriations are among the first which have been made by the<br />\nCarnegie Institute since its founding.<br />\n<br />\nALUMNI.<br />\nDr. George L. P. Radcliffe, Ph. D., of the University in 1900, is now con<br />\nnected with the law department of the University of Maryland.<br />\nDr. George B. Halsted, who has been associated with the Mathematical<br />\ndepartment of the University of Texas for the past 18 years, has been chosen<br />\nprofessor of mathematics of St. John's College, Annapolis. Professor Hall<br />\nreceived his Ph. D. from the University in 1879.<br />\n900<br />\nMr. A. Van R. Schermerhorn was admitted to the Baltimore bar last<br />\nweek.<br />\n901<br />\nWe are in receipt of an interesting letter from our former editor-in chief,<br />\nNorman Boyer, who writes of pleasant experiences in Duranjo, Mexico. \"This<br />\neasy, leisurely life,\" says he, '`is delightful,—such a rest from the terrific rush<br />\nof the North.\" We regret to note that Norman seems to have outgrown the<br />\ngood influence of the Y. M. C. A. and morning prayers. \"I've been tak'ng in<br />\nthe bull fights, too, on Sunday afternoon,\" he continues. 'Church in the<br />\nmorning till 11.30, open air concert till about 1, bull fight at 4, and another<br />\nconcert and promenade at night make Sunday a lively time.\"<br />\nBoyer promises the NEWS-LETTER one or two articles, so we may expect<br />\nto hear more of his degenerate progress before long.<br />\n<br />\nWALTER'S WARNING TO \"FUSSERS.\"<br />\n\"Well, I declare, sah! exclaimed Walter, as he brushed my hair preparatory to standing off and saying he was \"certainly proud of that job,\" \"you've<br />\ngot a lot of gray hairs in your head, sah.\"<br />\n\"Yes, I know; that's the effect of numerous troubles, Walter.\"<br />\n\"My gracious, salt! You don't know what trouble is, sah; you just ought<br />\nto get married once, sah!\"<br />\nUnless the entire NEWS-LETTER board is given a free shave, a copy of the<br />\nB.<br />\npresent issue will be sent to Walter's wife.<br />\n<br />\n\fTO<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nUNIVERSITY NOTES.<br />\n<br />\nR. BAILEY<br />\n<br />\np<br />\n-<br />\n<br />\nWILLIS, of the United States Geological Survey, delivered<br />\nan illustrated lecture on \"Scenes and Incidents of a Geologists Career\"<br />\nin McCoy Hall, on February 9.<br />\n<br />\nAt the banquet of the Princeton Alumni Association of Maryland, held in<br />\nMusic Hall on the night of February 6, Dean Griffin and Dr. Herbert E. Green<br />\nresponded to the toasts, \"Johns Hopkins University,\" and \"Harvard University.\"<br />\nDr. George D. Brown, fellow by courtesy in English, has been appointed<br />\ndirector of the department of English in the college of the City of New York.<br />\nLast year Dr Brown was associate professor of English at the University of<br />\nVermont.<br />\n\"Principles of Inorganic Chemistry\" is the title of the new book by Dr.<br />\nHarry C. Jones. It will he recalled that last spring Dr. Jones published \"The<br />\nElements of Physical Chemistry\" the first systematic and comprehensive text<br />\nbook of physical chemistry written in English. Dr. Jones' latest book, which<br />\nis intended for advanced students, is a comprehensive study of the subject.<br />\nDoubleday, Page & Co , of New York, have recently published \"Shakspere, and his Forerunners\" by Sidney Lanier. The work, wh:ch is beautifully<br />\nbound, and illustrated with many rare engravings, is in two volumes, and consist of the two sets of Shakspere lectures delivered by Mr. Lanier during the<br />\nwinter of 1879-80, the one at the University, the other at the Peabody Institute.<br />\nDr. Jacob H. Hollander was in New York City last week atending the annual meeting of the American Jewish Historical Society.<br />\nAt the annual meeting of the Board of Trustees of the Hospital held on the<br />\nafternoon of February 9, Judge Henry D. Harlan was elected president of the<br />\nboard, vice Mr. Win. T. Dixon, who resigned on account of press of other<br />\nduties. The board adopted resolutions expressing the regret of the trustees at<br />\nthe resignation of Mr. Dixon, and their gratitude for the time and labor given<br />\nby him to the affairs of the institution.<br />\nProfessor A. I,. Frothingham, of Princeton University, will deliver an<br />\nillustrated lecture upon \"Roman Triumphal Arches, especially The Arch at<br />\nBeneventum\" in McCoy Hall, on Tuesday evening, February 24. Dr. Frothingham's lecture will be delivered under the auspices of the Baltimore Society<br />\nof the Archaeological Institute of America.<br />\nThe lectures on Maryland Colonial History, given through the generosity of<br />\nthe Baltimore chapter, Colonial Dames of America, will be delivered by Presi<br />\ndent Lyon G. Tyler, LL. D., of William and Mary College, on three successive<br />\ndays, beginning February 25. Dr. Tyler, who is a son of John Tyler, tenth<br />\npresident of the United States, will lecture on \"Relations of Maryland and Virginia.\"<br />\n<br />\nval<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\n(American of February 13th).<br />\n<br />\nATHLETES TO INVADE SOUTH.<br />\nNOVEL TRIP FOR HOPKINS TRACK AND FIELD MEN.<br />\nA Team of at Least Twenty to Travel to Virginia, North Carolina and Tennessee<br />\nin a Series of Contests with Universities of Those Sections.—Great Interest<br />\nCenters in Plans .1 hat Are to Add Glory to the Regime of Physical Director<br />\nMackdertnott.<br />\n<br />\nROF. WILLIAM<br />\n<br />\nM. MACKDERMOTT, director of physical training<br />\nat the Johns Hopkins University, is planning the greatest college athletic invasion that has ever occurred in the East or South, and an enterprise rivaled only by the recent Eastern trip of the athletes of the University of<br />\nCalifornia. If the plans of Mackdermott should develop, as now seems certain,<br />\na band of from 20 to 25 of the best Hopkins athletes will make a spring invasion of the Southern universities, matching muscle and skill in a series of track<br />\nand field events. Much correspondence has already occurred on the subject<br />\nand the enterprise is receiving the enthusiastic support of all the students and<br />\nthe hearty co operation of such faculty leaders as Professors Remsen and<br />\nRenouff.<br />\nIt-is thus likely that Mackdermott will end his connection with the Hopkins University next ,September in a blaze of glory, The present interest in<br />\naffairs athletic at the University is the culmination of many years' hard and<br />\nIntelligent work by Mackdermott. There are now 40 men in training in the<br />\ncage who are entered for the events at the Fifth Regiment Armory to-morrow<br />\nnight.<br />\nThe universities thus far communicated with are: University of Virginia,<br />\nCharlotteville, Va.; Virginia Military Academy, Lexington, Va.; University of<br />\nNorth Carolina, Chapel Hill, N. C.; University of the South, Suwanee, Tenn.;<br />\nVanderbilt University, Nashville, Tenn.<br />\n<br />\nqp<br />\n<br />\nTHEY ALL HAVE FIELDS.<br />\n<br />\nAll of these institutions have athletic fields, and the University of Virginia<br />\nis just completing a quarter-mile track at a cost of $10,000 The advent of the<br />\nHopkins athletes at track and field events will create a tremendous sensation<br />\namong the students and friends of these institutions, and the Hopkins men will<br />\nbe received by having a field day at each university.<br />\nThe greatest care will be made in the selection of the men to represent<br />\nHopkins. The games of the Baltimore Athletic Club at the Fifth Regiment<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nArmory to-morrow night and the Hopkins and Georgetown games will prove<br />\ntryouts for the Hopkins men who want to make the Southern trip.<br />\nIf the Hopkins invasion should materialize, as now seems assured, the<br />\nSouthern athletes will train as they have never trained before, and the contests<br />\nwill be well worth going many miles to witness.<br />\nAmong the Hopkins men who now seem especially likely to make the<br />\ntrip are:<br />\nCapt. R. C. Hoffman, Jr., J. T. England, W. E. Hoffman, Jr., F. C.<br />\nBlanck, H. F. Helmholz, F. J. Sladen. J. M. Nelson, R. Jackson, F. H. Redewill, E. L Pessagno, H. V. Morse, W. L. Le Cron, G. B. Lawson, F. M.<br />\nBond, C. L. Stone, F. G. Porter, L. Knight, J. A. Freeze, H. B. Stone, B. A.<br />\nMattingly, F. R. V. Williams, L. S. Taylor, J. M. Super, T. G. Campbell, J.<br />\nW. Emig, T. Strohbar and H. K. Tootle.<br />\nThe information contained in the foregoing article should gladden the<br />\nhearts of all sincere Hopkins men past and present.<br />\nIt has been well known among our athletic leaders, for several years, that<br />\nProf. Mackderrnott cherished the hope of meeting our southern brothers upon<br />\ntrack and field, but until now the project has invariably fallen through.<br />\nOwing to the lack of concentration in track sports, in the larger southern<br />\nuniversities—notably the nearest one to Hopkins (University of Virginia),—we<br />\nhave heretofore been unable to schedule a dual meet. This year the University<br />\nof Virginia proposes to make a bold bid for the southern track and field championship. In this laudable ambition she will be vastly assisted by the completion of a new quarter-mile track and every modern appliance for training athletes.<br />\nVirginia is now arranging a dual meet with North Carolina, and it is safe<br />\nto wager that the fur will fly in any contest between these institutions.<br />\nSince the publication of above article, we are pleased to be able to state<br />\nthat Virginia has consented to our proposition for a meet, the exact date and<br />\nfinances remain to be decided upon.<br />\nAs soon as definite replies have been received from several more of those<br />\nmentioned, complete arrangements will be worked out in detail and announced.<br />\nThe proposed trip of Hopkins athletes should form a great stimulus in this<br />\nline of college athletics throughout the entire South; besides Hopkins will be<br />\nbenefited in many ways by sending her representatives abroad into new pastures<br />\nand fields, heretofore unexplored by her men of brawn.<br />\nRest assured, our teams will do their part and, win or lose, with honor to<br />\nHopkins and themselves.<br />\nHOPKINS IN THE B. A. C. GAMES,<br />\nN the Baltimore Athletic Club handicap games held at the Fifth Regiment<br />\nArmory last Saturday evening, Hopkins for the first time this season had<br />\nan opportunity to measure her athletic strength with that of other colleges<br />\nand clubs, and well may she feel proud of her performance on that occasion.<br />\n<br />\n3<br />\n<br />\n\f13<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nMuch interest and friendly rivalry had been aroused a week or two previous<br />\nby the interclass games in the cage, but these served merely as a training<br />\nschool for a more important series of events, of which the Armory games mark<br />\nthe beginning. Despite the fact that the number of entries this year was un<br />\nusually large, Hopkins succeeded in gaining a place in every event entered,<br />\nthat is, in all events except in the wrestling, and in the relay races where unfortunately she was unable to secure a worthy rival.<br />\nOwing to the lengthy list of contestants, it was found necessary to run off<br />\nheats of the 40. 440 and 880 yard races in the afternoon, in order to facilitate<br />\n'natters for the evening. From the brief summary given below, a little more<br />\ndefinite idea of the results of the events in which Hopkins competed, may be<br />\ngotten. It must not be lost sight of, however,that these events were handicap<br />\nHandicap<br />\nFIRST<br />\n40 yard dash,<br />\nH. F. HELMHOLTZ, 8 ft.<br />\n440 \"<br />\nU of P., 20 yds.<br />\nB. L. S., 50 yds.<br />\n880 \" run,<br />\n16 lb. shot put,<br />\nM. A. C., 5 ft.<br />\nRunning High Jump, Cen. Y. M. C. A.,6 in.<br />\n\"<br />\nBroad \" H.F. HELMHOLTZ, 3 ft.<br />\n<br />\nSECOND Handicap<br />\nB. C. C., 7 ft.<br />\nJ. A. FREEZE,25 yds.<br />\nCeti Y M C.A., 60 yds.<br />\nG. B. LAWSON, 5 ft.<br />\nG B LAWSON, 6 in.<br />\nW.B Y. M. C. A., 4 ft.<br />\n<br />\nTHIRD Handicap<br />\nB. A. 0., 5 ft.<br />\nB L. S., 20 yds.<br />\nH.V.MoRsE,anyds.<br />\nB. A. C., 24 ft.<br />\nB A C., 6<br />\n<br />\nFrom a glance at the above, it is readily seen that Hopkins made by far<br />\nthe best showing of any team entered, despite the fact that Freeze was disqualified and second place in the 440 yard dash given to a B L. S. man. Helmholtz, our new man of great promise from the University of Wisconsin, carried<br />\noff most of the individual honors by winning first place not only in the running<br />\nbroad jump, but also in the 40 yard dash where about twenty heats had to be<br />\nrun before a winner could be picked. Lawson, another medical man who has<br />\noften before contributed his athletic talents, helped to carry out the good work,<br />\nso ably begun by Helmholtz, and succeeded in capturing second place both in<br />\nthe 16 lb. shot put and in the running high jump It is a fact worthy of note<br />\nthat Morse, a freshman, was the only undergraduate to make a place—third in<br />\nthe half mile.<br />\nThe next event of special importance in the track and field world will be<br />\nthe Georgetown games of March 7th. May the good work, so nobly begun, be<br />\ncontinued with great success on that occasion.<br />\nLACROSSE DOINGS.<br />\nESPITE the efforts of the athletic editors, nothing new or startling has<br />\nbeen unearthed in regard to lacrosse since our last issue. Practice is<br />\nbeing held in the cage four times a week, as usual, and although the<br />\nfreshmen are still conspicuous for their absence, those men who have a chance<br />\nto make the 'Varsity are doing as well as can be expected. This time next<br />\nmonth the candidates will be practicing in the open and April 4 will soon slip<br />\naround to find us crossing sticks with the University of Pennsylvania .at the<br />\nAmerican League Park. Between now and then a great deal of hard, steady<br />\nwork must be done if we hope to land another championship banner. Several<br />\nrumors have floated down from Swarthmore to the effect that the Quakers are<br />\n<br />\n(R<br />\n<br />\n11<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nturning out a strong team and make every effort to avenge the defeat of last<br />\nseason. Whatever truth there may be in the reports, the fact remains that<br />\nSwarthmore invariably turns out a strong team, trained to the hour. Under<br />\nany conditions we shall have to hustle to down our greatest rival, not to say<br />\nanything of the necessity of walloping the newcomer, Stevens Institute. Its<br />\nclearly up to the faithful few; so get busy, boys, we need the money!<br />\nRegarding the schedule, Manager Addison has practically arranged everything except the game with the English team, and right here he seems to have<br />\nencountered numerous difficulties. When it was first reported that the OxfordCambridge twelve would reach here about Jnne 16, the Harvard management<br />\nvery kindly offered to arrange a game for Hopkins on June 25. Every student<br />\nknows that this is entirely out of the question and the game had been about<br />\ngiven up when it was learned that the Englishmen expect to reach here a week<br />\nsooner. It was also learned, incidentally, that the University of Pennsylvania<br />\nhas a game with the visitors somewhere around June 13. When and how<br />\nPennsylvania managed to accomplish this is not clearly understood, but it may<br />\nbe said with reasonable accuracy that Harvard will naturally favor the members<br />\nof the inter-University League in arranging a series of games between the<br />\nEnglish twelve and the college teams of the United States. When our con<br />\nspicuous position in lacrosse is considered, it seems reasonable that Hopkins<br />\nshould be numbered among the teams which are to measure strength, skill and<br />\nendurance with the foreigners. By defeating the members of the inter-University League, the foreigners will certainly not be justified in saying that<br />\nthey defeated the strongest college teams of the United States, Manger Addison has written direct to the English management and it is to be hoped that we<br />\nmay have a chance as well as Harvard and Pennsylvania.<br />\nBASE BALL FOR 1903.<br />\nN answer to the various inquiries that have been made from time to time, the<br />\nstatement may now be accepted as authoritative that Hopkins will have a<br />\nbase ball team in the field this season Present prospects are very encouraging. Ever since the unfavorable action of the Athletic Board in this direction<br />\nsome weeks ago, the question of a team \"to be or not to be,\" has been more or<br />\nless discussed, but only in a vague, 'indefinite sort of way, except by those<br />\nespecially interested in the team's success. These, remembering the hard, but<br />\nfutile fight for recognition last year, were in no way discouraged,—although<br />\ndisappointed,—by the unfavorable verdict of the Board this year, have been,<br />\nwith characteristic perseverance and \"stick-at-it-ness,\" quietly at work formulating plans for the organization of a successful, self supporting team.<br />\nThe spirit shown by the members of recent base ball teams is worthy of the<br />\nhighest commendation, and cannot but help elevate athletics in general at our<br />\ninstitution No man participates from any sense of duty, as is sometimes<br />\nunfortunately, but undeniably, the case in other branches of athletics; but each<br />\nis actuated purely and solely by his love for the game. Since no athletic honors—the \"reward of personal ability\"—are offered in this line as an incentive<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nto stir up, Or bring out men, with whom ambition for honor has more weight<br />\nthan interest, playing cannot be attributed to selfish or unworthy motives.<br />\nAlthough no formal call for candidates will be made before the last part of<br />\nthe month, when active practice will be resumed, some few of the old \"standbys\" and a recruit or two have been \"fussing\" about in the Cage on Saturdays<br />\nall during the winter. Captain Whipple feels well pleased with the outlook;<br />\nand to the men themselves, the very presence of Whipple in command is of itself<br />\nno inconsiderable source of encouragement. To compensate in a measure for<br />\nthe loss of the valuable services of certain of last year's players, notably Campbell and McKnight, old players will probably fill their places.<br />\nA glance at the schedule is sufficient evidence that the work of the<br />\nteam this season is a difficult one; in fact, it may seem that ambition is running<br />\naway with good judgment, but while even the most sanguine can scarcely look<br />\nfor success against such veterans at the game as Georgetown or the Maryland<br />\nAthletic Club, yet the general opinion prevails that there is more honor to be<br />\nderived from a creditable showing against such teams than from a victory over<br />\na team that should be easily defeated. Besides these two mentioned, no one is<br />\nexpecting a \"walkover\" with Gettysburg, Mount St. Mary's or with Columbian<br />\nUniversity, all of whom are fully our \"size.\" In addition to the above schedule, a short Easter trip has been arranged, which, however, had to be canceled<br />\nowing to the inability of several players to leave town during the holidays.<br />\nThis trip was to have been as follows:<br />\nApril 13th—Gallaudet College, at Washington.<br />\nApril 14th—Fredericksburg College, at Fredericksburg.<br />\nApril 15th—Randolph Macon College, at Ashland.<br />\nIn conclusion, attention may be called to the fact that the management,<br />\nfully realizing the uncertainty of depending upon home patronage, has purposely arranged all but two games to be played out of town. Under the circumstances, therefore, it does not seem too much to expect that all who can<br />\npossibly do so, will lend the encouragement of their presence at these two<br />\ngames when we meet our ancient rivals, Maryland Agricultural College and<br />\nWestern Maryland College, upon native soil. The work of trying to establish<br />\na strong, representative base ball team on a firm footing, is a deserving one,<br />\nand to merit the hearty support and good will of the entire student body.<br />\n<br />\nSCHFDITLE.<br />\nMarch 21st—Rock Hill College.<br />\nMarch 28th—Columbian University,(?) at Washington.<br />\nApril 4th—Washington College, at Chestertown.<br />\nApril 11th—Maryland Athletic Club, at Maryland Oval.<br />\nApril 25th—Open.<br />\nMay 2nd—Western Maryland College, at Baltimore.<br />\nMay 8th—Gettysburg College, at Gettysburg.<br />\nMay 9th—Mt. St. Mary's College, at Emmittsburg.<br />\nMay 13th—Georgetown University, at Georgetown.<br />\nMay 16th—Maryland,Agricu1tural College, at Baltimore.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nOZZY'S ORIGINAL ODDITIES.<br />\nV. CONSIDERATE CAROLINE.<br />\nCaroline gave her ma tartar emetic<br />\nBecause she complained of having a headache;<br />\nThen remarked, when the parent began to turn green,<br />\n\"Ma's the changeablest person I ever have seen.\"<br />\nVI. MA MM'S LETTER.<br />\nOrlando, one day, fell into the fire,<br />\nAnd as the flames mounted higher and higher<br />\nMamma took no heed of the poor little soul,<br />\nBut wrote to the News, \"Substitutions for Coal.\"<br />\n<br />\nAfew from the \"Widow.\"<br />\n\"I hear that Phi Beta Kappa is to get out a magazine.\"<br />\n\"What are they going to name it?\"<br />\n'The Smart Set,' I guess.\"<br />\nA society swell named McCall<br />\nWho went to a fancy dress ball,<br />\nAnd thought just for fun<br />\nHe'd go dressed as a bun,<br />\nWas devoured by a dog in the hall.<br />\n<br />\nA Miss is as good as a mile,—for really it's only a difference in the number of laps anyway.<br />\n, \"Yes,\" murmured the summer boarder, as he turned over for the sixteenth<br />\ntime, ''this is certainly a husky mattress.\"<br />\nUneasy lies the tooth that wears a crown.<br />\nOn the Nile.<br />\nThe monkey lost his hold and fell into the crocodile's waiting jaws. Even<br />\nthen his wits did not desert him. \"I just dropped in for dinner,\" he said, with<br />\nan engaging smile.— Yale Record.<br />\nAn Arcadian Allocation.<br />\n\"We ought to have a ball game with the Shepherds,\" proposed Silinus.<br />\n\"It would be a Satyr nine proposition for them,\" protested Pan, for he<br />\nknew he had a Pipe if he played.<br />\n<br />\n\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAXSON 0 WATTS,<br />\n4,31)rtici ZIOCCO.cs<br />\n'Baltimore and Eutaw Streets.<br />\n<br />\nHoccuard and Franklin Streets.<br />\n<br />\n1Drucis gancp Ooobis. Verfumerr, Collet Batcles, Cloaro, Sobs Iltlater.<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nFL S. WRIGHT & Co.,<br />\n704 MADISON AVE.<br />\n<br />\nC. & P.'Phone<br />\n<br />\nx350-Y.4-1,<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's arid Ungineers' Supplies<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nRALFIMOkL.IL).<br />\n<br />\nAgent for Eouffel 4. Esser Co., of New York.<br />\n<br />\nt-4 PC<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nStudents' Supplies.<br />\n<br />\nMadison E.? Howard Sts.<br />\n<br />\nbieorporated 157/4.<br />\n<br />\n\"eVs Stfona as the Steonskest.\"<br />\n<br />\nME FIDELITY MUTUFVL LIFE INSURPMGE GO.,<br />\nAN EXCELLENT<br />\n<br />\nOF Pft•I LR•DEL,Pf+IFV.<br />\nl'l'ORTUNITY is offered Students and Teachers to write Insurance for TIM<br />\nFIDELITY, either during vacation or permanently.<br />\n<br />\nNor Agenry In Maryland or West Virginia,<br />\n<br />\nAddress,<br />\nC. (\"KARAM, Manager<br />\n806.8 Merchants Hank Bldg., Baltimore,Sid,<br />\n<br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br />\n<br />\nigelafimp<br />\n,\"eareer<br />\nPUBLISHERS.<br />\n<br />\n\fSTIEFF PIANOS<br />\n<br />\n0001101 $300,000. 11101118 ia ffildIVIded Pf011 s $400 000<br />\n<br />\nMADE OP 'run BEST MATERIA UR MONEY<br />\n.ANII EXPERIENCE<br />\n<br />\nN<br />\n<br />\nDrovers & Mutinies Nat'l Bank,<br />\n<br />\nHITY.<br />\n<br />\nOF BALTIMORE.<br />\n<br />\nwasuseoostel 9 N. 14113EliTY sT.<br />\n<br />\nand<br />\nGUSHING &GOV:11NY'83:,a(tselir<br />\none s<br />\n34 W. fitILTIMORE 8TIMET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns I lopkins University and the Woman's<br />\nCollege of Baltimore.<br />\n91!<br />\n#<br />\n#<br />\nSTATIONBRY—Por School. ramllu, Mine and Bank.<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nHosiery, etc.<br />\n<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale The J. H. U. Pennants, and all other College<br />\n•<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA H. FETT1NG,<br />\nMANUFACTURER<br />\n<br />\nJan. Clark, Prod<br />\nChas. S. Miller, Cashier.<br />\n<br />\nI,. Strouse, rier-Prest.<br />\nEdw. P. Hayden. Arls't Cashier.<br />\n<br />\nGeneral Banking Bushiest, TresSacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom<br />\np r year and upward.<br />\n<br />\nRecounts Solicited.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON,<br />\nFOR<br />\n<br />\nJOHDfiN<br />\nSTRBLE11 GO.<br />\nReads as follows:<br />\n<br />\nt<br />\no<br />\no,4705<br />\nAVE.<br />\nSamples NubmItted of<br />\nFrench Iltritinly—no adulterants. no coloring. fine quality.<br />\nOporto Port absolutely pure, 01 superior quaiiiy.<br />\nSherry—no coloring or adulterant,, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar-- natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\n<br />\nOF<br />\n<br />\nSuccessor to Cummins.<br />\n<br />\nOren letter fraternitp 3ewelrv,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPew eati ant) lExaminc our Zinc 35cforc Purchasing.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\n'BALTIMORE.<br />\nSpecial 'Discount to Students.<br />\nkt. a g). tcIrphonc<br />\n<br />\n445-u.<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. Or sr<br />\n<br />\nJENNINGS & HORSEY.<br />\nMEncHANT TAILORS,<br />\n<br />\n21 W. FAYETTE STREET.<br />\n<br />\n4.1.1 40- 160<br />\ntti) RUZICKA<br />\nt.6<br />\nBookbinder,<br />\n<br />\nBOOKS!! I<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\n<br />\n'1141[0. WARNER.<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\n<br />\nPIPPEN'S 1300K STORE,<br />\nNear the University.<br />\n<br />\n605 N. EIJTRAN ST.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 41P- Hop<br />\n$'<br />\n<br />\nkin<br />\n<br />\nCaps<br />\n<br />\nNORTH GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\n<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBUTIMORE TO BREMEN DIREGT.<br />\nFor particulars applg to<br />\n<br />\nft. SGHUNifiGHER & GO., General Rants.<br />\nISAAC H. DIXON, PREar.<br />\n.JAS. MEIKLE,<br />\nJAS. R. RICHARDS, TREAS.<br />\n<br />\nTHE<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES,<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol, VII, No.<br /><br />\n9<br /><br />\nFebruary 19, 1903<br /><br />\nTHE<br /><br />\nNEWS LETTER<br />\neVb<br /><br />\n'W.<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns Hopkins Prob.<br /><br />\nThe Johns Bookins Universitu<br />\nBALTIMORE, MARYLAND.<br />\nI.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br />\nPresident: IRA ItEMSEN. Dean of the Medical Faculty:<br />\nW ILL(AK H. How ism,. Dean of the Co/lee Faculty:<br />\nBowsaw H. GRIFFIN.<br /><br />\nEntertain Chemical aournal.<br />\nI. RENSEN, Editor Monthly, 8vo. 'Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. limerican aournal of !Philology.<br />\nII. L. 01 1,DE1tSLEE V E, Editor. Quarterly. eve.<br />\nVolume X Xli 1 in progress. $3 per volume.<br />\n1.<br /><br />\n.<br /><br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for midi(bites for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of B. A.<br />\n. (d) As special students.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory,<br />\nEconomies.<br />\nMathematics.<br />\nPhysics.<br /><br />\nfive.<br /><br />\nStubies in lbistoriOI ant, POlitkal Selene. ;<br />\nMonthly. livo. Shries 'X X 1 in Progress. $11 pe<br />\nvolume.<br />\n3ohtis Thophins 'University Circulare.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII la<br />\nprogress. $1 per year.<br /><br />\nIX.<br /><br />\nContribujions to Essyrioloor ant, Comparative<br />\nzur A my rioloi,00, etc.)<br />\nSemitic p<br />\n!bliototir,<br /><br />\nX.<br /><br />\nMemoirs from the /Biological /Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nVol. IV complete.<br /><br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nLaboratories.<br /><br />\nStubies from the ifliolocilcril /Laboratory.<br />\n,<br />\nVolume V complete. $5 per volume.;<br /><br />\n11)11. 3ohns booking /hospital Velletin. 1i/tenthly. 4te.<br />\nVolume XIV in progress $1 per year.<br />\n0111. 3obno 1hopkins lhospital /Reports. 4to. Volume X1<br />\nIn p rogress. $5 per volume.<br /><br />\nLibraries.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nTolima<br /><br />\nII.<br /><br />\nL<br /><br />\nInstruction.<br /><br />\nEmerican 3ournaI of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $6 per tolume.<br /><br />\nDirectors.<br />\nIra Emmen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Sm 1th.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. 4Thissical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading u ri to medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\nIS. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journat of Philology (vol XXIII).<br />\nStudies an Historical arid Political Science(vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from rho Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars (vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nXI.<br /><br />\nMobern /Language Votes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1 50 per volume.<br />\nX111. 3Ournat of /Experimental Mebicine.<br />\nW. 11. WELCH, Editor. Ili-monthly. 8vo. Volume<br />\nV1 in progress. $5 per volume.<br />\nX1111. Emerican 3ournal of Insanity.<br />\nII EN RY M. H U RI), Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\n1Reporte of Marelanb Ocological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nf11/.<br /><br />\nterrestrial Magnetism ant) Iltmospberic Elec.<br />\nWelty. L. A. BAITER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br /><br />\nrvi.<br /><br />\nannual /Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the pest academic year.<br />\nttnnual Valli/ter.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. 1'11111 !Irrupt- Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Haspital. J. S. Billings, Editor. 116 pp. 4to. 58 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fae-simile edition. Edited by .1. kende] Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomona Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia HopkIneiensie. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geo ogy. Parts<br />\n1 V-V-V1. Physies.Astronorny and Mathematics%<br />\nvo. 30 cents per part.<br />\nII tell list of publications will be sent on application.<br /><br />\nCommunications in respect to exehanges and remittanees<br />\nmail be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\n101<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nFEBRUARY 19, 1903.<br /><br />\nNo. 9.<br /><br />\nCOLLEGE MEN IN BUSINESS.<br /><br />\ncw<br /><br />\nHILE it may seem presumptious for younger men to offer opinions about<br />\na subject so much discussed by our elders, the suggestion prompts itself that the college graduate who has been in business only a few years<br />\nwill be more respected as a judge, when it is remembered that he is closer to the<br />\ntwo conditions of life, and is more susceptible.<br />\nAs a brief prelude, a few words about the length of an ideal college course<br />\nseem applicable. The many advocates of college training for men tell that this<br />\nincipient period of life is most in need of scientific care, for it is the chrystalizing stage,—a time when the hardening cast must be taken from the mould. Entering into business means undertaking a life pursuit, and a decision cannot be<br />\nsummarily dismissed. While it is true that most men commencing business<br />\nare not permitted by circumstances to choose their exact branch, it must be admitted that a man who knows his own propensities, can by dint of determination fulfill his ambition at a later time. So that without venturing an opinion<br />\nas to the exact number of years to be spent in college, it is safe to say that the<br />\ncast must be formed, and tempered to the atmosphere before being exposed to<br />\nthe elements.<br />\n.<br />\nAside from the general polish and completeness that a college course gives<br />\nto all, the most refreshing observance that one makes of college men in business<br />\nIS the seriousness with which they view their life occupation. In the classes<br />\nof undergraduate years, in the self imposed work on college periodicals and in<br />\nathletics, it has been discovered that system and responsibility are essential to<br />\nall successes, and the ones who attain proficiency, or even mediocrity in any of<br />\nthe college associations necessarily absorb most of the serious and solid elements of life.<br />\nThe time taken up, and the exaggerated value that bachelors of art are apt<br />\nto set upon themselves, are the chief arguments advanced against a college degree for business men. In most cases, however, the time lost means only a<br />\ntemporary delay, and the first objection seems very easily overcome. Of course,<br />\nthere are many positions from which promotion can only be had in routine<br />\norder. In answer to this, it must be said that college men are brain-workers<br />\nand not machines, and that wherever there is a chance to excel and to be<br />\nrecognized, the college man will receive and accept business principles as such.<br />\nHe knows that discrimination must be exercised in all cases, and that no rule<br />\nLS to be blindly followed. The barrier that is most insurmountable to those<br />\nnot benefited by the training of college work is an apparent inability to consider the pay received and services rendered in any other than an invariable<br /><br />\n1111111.—__<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\nratio. The latter must not be in excess until the former is increased, but the<br />\nsalary is not increased while the value of the work remains the same, and an<br />\ninflexibility results. This might serve as an illustration of the absurdity of<br />\nknowing no more mathematics than the rule of three.<br />\nThere is a remarkable resemblance between the results obtained by the<br />\nmethods of science and of business. The scientist commences with very simple<br />\nexperiments and forms laws from the similarity of phenomena observed; these<br />\nlaws are generalized and made into truths of wide application. The scientist is<br />\nnot satisfied with the laws and truths verified by the experimental method; the<br />\nrealm of experience must be transcended and sweeping theories of universal<br />\ncause and effect are given to the public. Likewise the business man starting<br />\nout in a very unpretentious way, at first engages in the grocery trade, or becomes a clerk in a banking house. After he has learned the axioms and first<br />\nproblems of commerce and finance, he applies broader laws, and forms combinations of enterprises which formerly were conducted under various specific<br />\nprinciples. When it seems that he has reached a height of surpassing emi<br />\nDeuce, there is no ambition unfulfilled but the Titanic undertaking of a worldempire founded on commercial theories.<br />\nAt the very first, the college man recognizes the scientific value of inductive reasoning. He sees that there are far reaching theories in business,<br />\nand he understands that their correct application can be attained only by the<br />\ninductive method. There is something ahead to make the first essays more<br />\nthan mere mechanical effort, which should be classed with day labor. His conscientious labors are what might be called scientific endeavors to possess the<br />\nright of trying one's own view upon those interesting theories. The remuneration is, as it were, incidental,—a sort of testimonial of his success with the<br />\nearly experiments, by which the doctrines of final cause can only be reached.<br />\nBy thus mastering the work, and always striking higher, that rule of three<br />\nwhich was so stubborn to the one un versed in higher mathematics, is fitted in<br />\nwith the other laws. Advancement comes with a rush. In a short while, the<br />\ncollege man has caught up with the non college man who started years ago.<br />\nIn fact he is far ahead, for by virtue of his assimulation of the principles of his<br />\nwork and with a broadened mind, he is more capable of filling higher positions.<br />\nTo express it by an apt comparison, he has gained more momentum than the<br />\nother man who has reached the same point.<br />\nWhile it is no doubt very true that the college graduate is most prone to<br />\nplace an unreal value upon himself, there is much that can be said in defense.<br />\nIf this over-estimation is inherent, then it is not the college-course that has<br />\ncreated the evil, but a defect of the individuality of the man. On the other<br />\nhand, if the trouble is merely incidental to the distinction of a degree, the temporary aberration will wear away with the novelty of possessing an inscribed<br />\nsheepskin. At any rate, when the newly-created bachelor begins to be held<br />\nagainst the hard grindstone of the world, the rough points will soon be ground<br />\noff, and as this excessive self-appreciation is the most prominent, it will receive<br />\nthe earliest attention.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nAfter all, it is the real inner qualities of the man that tell. Without unusual mishaps, these will come out in spite of anything else. Every athlete<br />\nknows that pluck and endurance win in all cases except under extraordinary<br />\ncircumstances. Even if we yield a point here in saying that intrinsic merit<br />\nmust succeed, it can he urged that the college man has a trained sense of intel<br />\nlectual enjoyment. No concessions are necessary, however, as the athlete is<br />\nfully aware that conscientious preparation is absolutely essential; when this is<br />\ncompleted there is a brief rest before entering in the long struggle of the crucial<br />\ncontest.<br />\nCollege life has been termed \"a miniature world.\" This comparison more<br />\nthan anything else will illustrate the great profit that the business man gets<br />\nfrom college. If, as we believe, a consideration of the time phase of the question is of no weight, it is manifest to all that the man who has had experience<br />\nwith his fellow men on equal terms, who has applied business principles in the<br />\nmany elements composing a student's life, and who has formed a true idea of<br />\nthe qualities essential to every success, undoubtedly has a sure foundation for<br />\nJ. M. MULLEN,'99.<br />\na Proper beginning.<br />\nCOMMEMORATION DAY PROGRAMME.<br /><br />\nt<br /><br />\nHE 26th anniversary celebration will be held in McCoy Hall, on next<br />\nMonday, February 23rd. The exercises, which will begin at 11 o'clock,<br />\nwill consist of addresses, conferring of the degree of Doctor of Philosophy<br />\nupon several candidates, and announcements of recent donations to the University. Edwin A. Alderman, L. L. D., President of Tulane University, will<br />\ndeliver the principal address. His subject has not yet been announced.<br />\nThe Alumni Association will hold its annual gathering at the Carrollton<br />\nHotel the same night. A short business meeting will first be held, at which<br />\nthe,following gentlemen, who have been nominated by the Executive Committee<br />\nof the Association, will be elected to hold office for the coming year.<br />\nFor President—Frederick Morris Warren, Ph. D.,'87, of New.Haven, Conn,<br />\nFor Secretary—Mr. Alfred Jenkins Shriver, A. B.,'91.<br />\nFor Treasurer--Mr. Reuben Carll Foster, A, B., '95.<br />\nFor Members of the Executive Committee to serve for two years—Messrs.<br />\nWilliam Thompson Sedgwick, Ph. D., '81, of Boston; Joseph Sweetman Ames,<br />\nPh D., '90; Henry Winslow Williams, A. B., '83; Charles Carroll Marden, Ph.<br />\nD„ '94, and Harvey Brinton Stone, A. B., 1902.<br />\nAt the banquet following the meeting, Prof. William T. Sedgwick, of Boston, president of the Association, will be toast-master. Among those who are<br />\nexpected to be present and will speak are: President Ira Remsen, President<br />\nDaniel C. Gilman of the Carnegie Institution, President Alderman of Tulane<br />\nUniversity, Dr Albert Shaw of New York, editor of the Review of Reviews;<br />\nProf. Henry Donaldson, dean of the Graduate School of the University of Chicago, and Mr. Theodore Marburg.<br />\nThe members of the committee which has charge of the arrangements for<br />\nthe dinner are: Dr. Henry Barton Jacobs, Dr. Henry McE. Knower and Mr.<br />\nCharles Edward Brooks.<br /><br />\n-4<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nHOME CONCERT OF THE MUSICAL CLUBS.<br /><br />\ne<br /><br />\nHR management of the University Glee, Banjo and Mandolin Clubs has<br />\nselected Friday, February 27, as the date for the Baltimore concert, and<br />\nit is hoped that the student body and the friends of the University will<br />\nturn out in full force to show their appreciation of this prominent manifestation<br />\nof college spirit. In doing so, they should remember that this is the concert on<br />\nwhich the financial success of the clubs for the year is largely dependent, and<br />\nthat a prosperous year means money for the athletic teams. Last year the<br />\nsupport given the clubs was commendable, and there, is no reason why the same<br />\ninterest should not be shown this season.<br />\nTo take another point of view,—nobody need be afraid of not getting the<br />\nworth of his money, for the program offered by the clubs this. Year is unusually<br />\nattractive. The men on all three of the clubs have worked faithfully since October; and, inspired by their smaller triumphs, will, no doubt, do their utmost<br />\nto make every one feel proud of the University's musical clubs on this occasion,<br />\nThe Glee Club this year has had more material to choose from than in<br />\nformer years, and the result is apparent. Many of the medical men have come<br />\nover, and most of them have trained their voices by experience on clubs of<br />\nother colleges. The leader, W. B. Carver, of the graduate department, has two<br />\nexcellent medleys, besides the usual Hopkins songs and other glees.<br />\nThe quartet this year has been selected with much care, and is composed of<br />\nMessrs. Coffin, Hall, Ford and Gilman. Mr. Gilman will sing solos. His<br />\nvoice is better this year than ever, and his selections are admirable.<br />\nThe Banjo Club is especially strong. \"Charley\" Marshall is leading<br />\nagain, and he has managed to correct the few defects of last year's club. One<br />\nof the hits this year is the \"Coon Quartet.\" In addition there is a popular<br />\nmedley, and three rattling marches.<br />\nEdgeworth Smith is working hard in graduate history and politics, but it<br />\nis hoped that he will be prevailed upon to give a banjo solo.<br />\nThe Mandolin Club, under the leadership of J. Wallace Bryan, '03, presents a large and varied collection of pieces,—a waltz by the author of<br />\n\"Amoureuse,\" hits from \"The Prince of Pilsen,\" \"Mr. Pickwick,\" a march by<br />\nVictor Herbert, and Sousa's latest,—played recently before His Majesty of<br />\nEngland,--`'Imperial Edward.\"<br />\nOne of the most attractive numbers will be the \"Song of the Toreador,\"<br />\nfrom Francis Wilson's opera, by the combined Glee and Mandolin Clubs.<br />\nThose who were at the concert of 1901 remember what a fine effect was produced by these two clubs when they accompanied the soloist in the \"Princess<br />\nChic\" song. Then, too, a funny \"stunt\" man is promised, so that all tastes<br />\nwill be suited. The only thing that is needed to make the concert an entire<br />\nsuccess is a fine audience.<br />\nLast year nearly the whole Woman's College attended, and these girls are<br />\nexpected this year. Surely, with this extra inducement, every one from the<br />\nHopkins will be on hand! .<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nFEBRUARY 19, 1903.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n.<br /><br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1908.<br />\n. GEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nW. S. BIRD, 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br /><br />\nAddressall articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopking University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY EAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\nINIIIM1111111.111<br />\n,<br /><br />\nt<br /><br />\nHE Honor System has now been discussed by all three classes, and a definite conclusion reached. Under present conditions perhaps the best way<br />\nout of the difficulty has been chosen. There was no protest against the<br />\nnecessity of action being taken. All the classes were united in agreeing that the<br />\nlittle irregularities incident to examinations should he done away with by the<br />\nforce of public opinion. In the future he will have to be a brazen man indeed<br />\nwho will fly in the face of the emphatic convictions of the undergraduate body.<br />\nSoon after the opening of the first term next year, and in all future years no<br />\ndoubt, men from the upper classes will explain to the new men what the sentiments of the undergraduates are on this subject, and after this exposition of<br />\nHopkins ideals there can scarce be any fear of a transgression of the spirit or<br />\nthe letter of the law.<br /><br />\nN many respects the games held at the Armory last Saturday were eminently<br />\nunsatisfactory. As usual there seemed to be a desire on the part of those<br />\ninterested to give Hopkins the worst of everything wherever there was the<br />\nslightest chance Yet it can hardly be said that much partiality was shown in<br />\ngiving us the worst of it, as some others of the contestants did not get the best<br />\nof treatment at the hands of the officials. The opinion was expressed generally that never had there been a worse set of handicaps. It is customary in a<br /><br />\n3<br /><br />\nTHE NEWS—LETTER,<br />\n•<br /><br />\n7<br /><br />\nhandicap.race for the scratch man to have some slight chance of making a bid<br />\nfor a place; but in these games the scratch man was beaten before the gun was<br />\nfired. Unless some gentleman made a false statement on his entry blank we<br />\nare at a loss to understand why a man with a record of 2.11 4-5 in the half mile<br />\nwas put on scratch with a man who has a record of 2.01. Such handicapping<br />\nas this deserves to be investigated.<br />\nOne of the rankest decisions handed out was the one disqualifying Freeze<br />\nIn the quarter. He ran a pretty race and finished second. But one of the inspectors disqualified him for interfering with another man. The facts in the<br />\ncase were that the other man stepped on Freeze's heel and was entirely to<br />\nblame. But the inspector, who was by no means a disinterested person, disqualified Freeze. After it was over he admitted that he had done wrong, and<br />\nexcused himself by saying to one of our men, \"You know that I did not know<br />\nthat it was a Hopkins man, or I should never have done it.\" If he was honest<br />\nwe cannot see why he should endeavor to disqualify anyone unfairly.<br />\nThis same inspector, holding the position he does, as a trainer at one of the<br />\npreparatory. schools, he should never have been permitted to act as an official,<br />\nwas seen to coach his men as they passed his turn; he was also miserably blind<br />\nwhen Randall was fouled by a Pennsylvania man. If he believes that these<br />\nmethods are conclusive to clean and sportsmanlike athletics the NEWS-LETTH:R<br />\nbegs to differ with him. A man who has played such an important part in college athletics should be above such petty devices which smack more of the professional sport, who will win at any cost, than of amateur athletics.<br />\nIn the dash some interesting things were brought to light. In the afternoon when a man fell over his marks he was put back a foot, if he was put<br />\nback at all. Later this was excused by the starter declaring that he was ignorant of the rules. A man so ignorant should not be allowed to officiate. He<br />\nalso let the men jump the gun; however, this is something which even the best<br />\nstarters are not able to guard against all the time. Yet for this reason two good<br />\nHopkins sprinters lost the opportunity of getting in the finals.<br />\nHandicap games are never satisfactory, and these were less so than any<br />\nheld in Baltimore fot a long time. The public is not anxious to pay its money<br />\nso see a lot of third and fourth rate runners gallop around the track while the<br />\ngood men are so hopelessly handicapped that they are never in the race. The<br />\nshowing Hopkins made was as good as could be expected under the circumstances. All we can do is to' pull ourselves together and hope for better luck<br />\nnext time.<br />\nThis protest against the methods which characterized the games is made<br />\nnot only on behalf of Hopkins, but on behalf of all the men who were victims<br />\nof unfortunate circumstances.<br />\nof so many good chess players at the University should not go<br />\nunnoticed. In the past the chess clubs were always centers of interest,<br />\nand it seems strange that this year has not found the men once more engrossed in the royal game. Not only could an interesting tournament be played<br />\namong the men of the University, but games with other colleges could be ar-<br /><br />\n; presence<br />\nZHI<br /><br />\n8<br /><br />\nTHE NEWS—LETTER.<br /><br />\nranged. Hopkins has too long maintained a position of \"splendid isolation.\"<br />\nOne of the most gratifying signs of a new era is the proposed southern tour of<br />\nthe Track and Field Team during the Easter holidays. We should endea,ror to<br />\nestablish friendly relations with other Universities as soon as possible in every .<br />\nbranch of friendly rivalry. Not only may we hope for an inter- collegiate chess<br />\ntournament, hut some day our golf club, our gun club, and our hockey club<br />\nmay he able to compete with their fair share of success with other representa<br />\ntive teams. It is not too late to organize a chess club this year, and anything<br />\ndone now will be so much gained toward giving the game a foothold next<br />\nseason.<br /><br />\nR. W. M. MACKDERMOTT, official<br /><br />\ncoach, and Mr. R. C. Hoffman,<br />\nJr., captain of the Track and Field Team, are quietly making arrangements for a southern trip during the Easter vacation For some time<br />\nthey have been considering this step, and they hope to end the negotiations<br />\nwithin a few days. Nothing definite can be given to the public at this time,<br />\nbut the NEWS LETTER has been assured that if the trip is made it will be in a<br />\nstyle befitting the University. Nor is it known how many will he • taken, but<br />\nwe may be sure that not less than twenty men will compose the team. Notwithstanding certain weak spots the team is particularly strong this season,<br />\nand may be depended upon to make a good showing in any dual meet. It is<br />\nidle to prophesy what events we may win and what ones we may lose but even<br />\nif we lose a majority of the points the fact that we made the trip will be to our<br />\ncredit. We are seriously handicapped by the lack of an athletic field. It is a<br />\ngreat test of a man's devotion to require him to go to Electric Park to train. It<br />\ntakes time which a number of men, especially those from the Medical School,<br />\ndo not feel that they can spare. If some place nearer the University could be<br />\nfound, no doubt the personnel of the team would be strengthened by the addition of a number of men who, under the present conditions, cannot find the<br />\ntime to devote to the work.<br /><br />\nTI<br /><br />\nTHE CARNEGIE INSTITUTE GRANTS.<br />\nN February 9, Dr. Remsen announced that the Trustees of the Carnegie<br />\nInstitution have made the following grants to members of the University:<br />\n1. To Professor H N. Morse, the sum of fifteen hundred dollars to enable<br />\nhim to engage a Research Assistant in his work on Osmotic Pressure. The<br />\nAssistant is Dr. J. C. W. Frazer.<br />\n2. To Professor R. W. Wood, one thousand dollars for a Research Assistant in connection with his researches in the domain of Physics. His Assistant<br />\nis Mr. T. S. Elston.<br />\n3. To Professor J. J. Abel, one thousand dollars to aid him in his<br />\nresearches in Physiological Chemistry. He needs very costly material, which<br />\nhe has hitherto been obliged to make; this grant obviates the expenditure of<br />\nconsiderable time in making these substances required.<br /><br />\nO<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\n4. To'Professor H. C. Jones, one thousand dollars for a Research Assist<br />\nant to carry on investigations in the field of Physical Cnemistry. His Assistant,<br />\nbeginning next September, will be Mr. F. H. Getman.<br />\n5. To Dr. J. B. Whitehead, twelve hundred dollars, enabling him to<br />\ncontinue his researches begun two years ago on the vIagnetic Effect of Electric<br />\nDisplacement. The work involves the making of apparatus for which the<br />\nservices of a mechanic are required.<br />\nThese appropriations are among the first which have been made by the<br />\nCarnegie Institute since its founding.<br /><br />\nALUMNI.<br />\nDr. George L. P. Radcliffe, Ph. D., of the University in 1900, is now con<br />\nnected with the law department of the University of Maryland.<br />\nDr. George B. Halsted, who has been associated with the Mathematical<br />\ndepartment of the University of Texas for the past 18 years, has been chosen<br />\nprofessor of mathematics of St. John's College, Annapolis. Professor Hall<br />\nreceived his Ph. D. from the University in 1879.<br />\n900<br />\nMr. A. Van R. Schermerhorn was admitted to the Baltimore bar last<br />\nweek.<br />\n901<br />\nWe are in receipt of an interesting letter from our former editor-in chief,<br />\nNorman Boyer, who writes of pleasant experiences in Duranjo, Mexico. \"This<br />\neasy, leisurely life,\" says he, '`is delightful,—such a rest from the terrific rush<br />\nof the North.\" We regret to note that Norman seems to have outgrown the<br />\ngood influence of the Y. M. C. A. and morning prayers. \"I've been tak'ng in<br />\nthe bull fights, too, on Sunday afternoon,\" he continues. 'Church in the<br />\nmorning till 11.30, open air concert till about 1, bull fight at 4, and another<br />\nconcert and promenade at night make Sunday a lively time.\"<br />\nBoyer promises the NEWS-LETTER one or two articles, so we may expect<br />\nto hear more of his degenerate progress before long.<br /><br />\nWALTER'S WARNING TO \"FUSSERS.\"<br />\n\"Well, I declare, sah! exclaimed Walter, as he brushed my hair preparatory to standing off and saying he was \"certainly proud of that job,\" \"you've<br />\ngot a lot of gray hairs in your head, sah.\"<br />\n\"Yes, I know; that's the effect of numerous troubles, Walter.\"<br />\n\"My gracious, salt! You don't know what trouble is, sah; you just ought<br />\nto get married once, sah!\"<br />\nUnless the entire NEWS-LETTER board is given a free shave, a copy of the<br />\nB.<br />\npresent issue will be sent to Walter's wife.<br /><br />\nTO<br /><br />\nTHE NEWS-LETTER<br /><br />\nUNIVERSITY NOTES.<br /><br />\nR. BAILEY<br /><br />\np<br />\n-<br /><br />\nWILLIS, of the United States Geological Survey, delivered<br />\nan illustrated lecture on \"Scenes and Incidents of a Geologists Career\"<br />\nin McCoy Hall, on February 9.<br /><br />\nAt the banquet of the Princeton Alumni Association of Maryland, held in<br />\nMusic Hall on the night of February 6, Dean Griffin and Dr. Herbert E. Green<br />\nresponded to the toasts, \"Johns Hopkins University,\" and \"Harvard University.\"<br />\nDr. George D. Brown, fellow by courtesy in English, has been appointed<br />\ndirector of the department of English in the college of the City of New York.<br />\nLast year Dr Brown was associate professor of English at the University of<br />\nVermont.<br />\n\"Principles of Inorganic Chemistry\" is the title of the new book by Dr.<br />\nHarry C. Jones. It will he recalled that last spring Dr. Jones published \"The<br />\nElements of Physical Chemistry\" the first systematic and comprehensive text<br />\nbook of physical chemistry written in English. Dr. Jones' latest book, which<br />\nis intended for advanced students, is a comprehensive study of the subject.<br />\nDoubleday, Page &amp; Co , of New York, have recently published \"Shakspere, and his Forerunners\" by Sidney Lanier. The work, wh:ch is beautifully<br />\nbound, and illustrated with many rare engravings, is in two volumes, and consist of the two sets of Shakspere lectures delivered by Mr. Lanier during the<br />\nwinter of 1879-80, the one at the University, the other at the Peabody Institute.<br />\nDr. Jacob H. Hollander was in New York City last week atending the annual meeting of the American Jewish Historical Society.<br />\nAt the annual meeting of the Board of Trustees of the Hospital held on the<br />\nafternoon of February 9, Judge Henry D. Harlan was elected president of the<br />\nboard, vice Mr. Win. T. Dixon, who resigned on account of press of other<br />\nduties. The board adopted resolutions expressing the regret of the trustees at<br />\nthe resignation of Mr. Dixon, and their gratitude for the time and labor given<br />\nby him to the affairs of the institution.<br />\nProfessor A. I,. Frothingham, of Princeton University, will deliver an<br />\nillustrated lecture upon \"Roman Triumphal Arches, especially The Arch at<br />\nBeneventum\" in McCoy Hall, on Tuesday evening, February 24. Dr. Frothingham's lecture will be delivered under the auspices of the Baltimore Society<br />\nof the Archaeological Institute of America.<br />\nThe lectures on Maryland Colonial History, given through the generosity of<br />\nthe Baltimore chapter, Colonial Dames of America, will be delivered by Presi<br />\ndent Lyon G. Tyler, LL. D., of William and Mary College, on three successive<br />\ndays, beginning February 25. Dr. Tyler, who is a son of John Tyler, tenth<br />\npresident of the United States, will lecture on \"Relations of Maryland and Virginia.\"<br /><br />\nval<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\n(American of February 13th).<br /><br />\nATHLETES TO INVADE SOUTH.<br />\nNOVEL TRIP FOR HOPKINS TRACK AND FIELD MEN.<br />\nA Team of at Least Twenty to Travel to Virginia, North Carolina and Tennessee<br />\nin a Series of Contests with Universities of Those Sections.—Great Interest<br />\nCenters in Plans .1 hat Are to Add Glory to the Regime of Physical Director<br />\nMackdertnott.<br /><br />\nROF. WILLIAM<br /><br />\nM. MACKDERMOTT, director of physical training<br />\nat the Johns Hopkins University, is planning the greatest college athletic invasion that has ever occurred in the East or South, and an enterprise rivaled only by the recent Eastern trip of the athletes of the University of<br />\nCalifornia. If the plans of Mackdermott should develop, as now seems certain,<br />\na band of from 20 to 25 of the best Hopkins athletes will make a spring invasion of the Southern universities, matching muscle and skill in a series of track<br />\nand field events. Much correspondence has already occurred on the subject<br />\nand the enterprise is receiving the enthusiastic support of all the students and<br />\nthe hearty co operation of such faculty leaders as Professors Remsen and<br />\nRenouff.<br />\nIt-is thus likely that Mackdermott will end his connection with the Hopkins University next ,September in a blaze of glory, The present interest in<br />\naffairs athletic at the University is the culmination of many years' hard and<br />\nIntelligent work by Mackdermott. There are now 40 men in training in the<br />\ncage who are entered for the events at the Fifth Regiment Armory to-morrow<br />\nnight.<br />\nThe universities thus far communicated with are: University of Virginia,<br />\nCharlotteville, Va.; Virginia Military Academy, Lexington, Va.; University of<br />\nNorth Carolina, Chapel Hill, N. C.; University of the South, Suwanee, Tenn.;<br />\nVanderbilt University, Nashville, Tenn.<br /><br />\nqp<br /><br />\nTHEY ALL HAVE FIELDS.<br /><br />\nAll of these institutions have athletic fields, and the University of Virginia<br />\nis just completing a quarter-mile track at a cost of $10,000 The advent of the<br />\nHopkins athletes at track and field events will create a tremendous sensation<br />\namong the students and friends of these institutions, and the Hopkins men will<br />\nbe received by having a field day at each university.<br />\nThe greatest care will be made in the selection of the men to represent<br />\nHopkins. The games of the Baltimore Athletic Club at the Fifth Regiment<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nArmory to-morrow night and the Hopkins and Georgetown games will prove<br />\ntryouts for the Hopkins men who want to make the Southern trip.<br />\nIf the Hopkins invasion should materialize, as now seems assured, the<br />\nSouthern athletes will train as they have never trained before, and the contests<br />\nwill be well worth going many miles to witness.<br />\nAmong the Hopkins men who now seem especially likely to make the<br />\ntrip are:<br />\nCapt. R. C. Hoffman, Jr., J. T. England, W. E. Hoffman, Jr., F. C.<br />\nBlanck, H. F. Helmholz, F. J. Sladen. J. M. Nelson, R. Jackson, F. H. Redewill, E. L Pessagno, H. V. Morse, W. L. Le Cron, G. B. Lawson, F. M.<br />\nBond, C. L. Stone, F. G. Porter, L. Knight, J. A. Freeze, H. B. Stone, B. A.<br />\nMattingly, F. R. V. Williams, L. S. Taylor, J. M. Super, T. G. Campbell, J.<br />\nW. Emig, T. Strohbar and H. K. Tootle.<br />\nThe information contained in the foregoing article should gladden the<br />\nhearts of all sincere Hopkins men past and present.<br />\nIt has been well known among our athletic leaders, for several years, that<br />\nProf. Mackderrnott cherished the hope of meeting our southern brothers upon<br />\ntrack and field, but until now the project has invariably fallen through.<br />\nOwing to the lack of concentration in track sports, in the larger southern<br />\nuniversities—notably the nearest one to Hopkins (University of Virginia),—we<br />\nhave heretofore been unable to schedule a dual meet. This year the University<br />\nof Virginia proposes to make a bold bid for the southern track and field championship. In this laudable ambition she will be vastly assisted by the completion of a new quarter-mile track and every modern appliance for training athletes.<br />\nVirginia is now arranging a dual meet with North Carolina, and it is safe<br />\nto wager that the fur will fly in any contest between these institutions.<br />\nSince the publication of above article, we are pleased to be able to state<br />\nthat Virginia has consented to our proposition for a meet, the exact date and<br />\nfinances remain to be decided upon.<br />\nAs soon as definite replies have been received from several more of those<br />\nmentioned, complete arrangements will be worked out in detail and announced.<br />\nThe proposed trip of Hopkins athletes should form a great stimulus in this<br />\nline of college athletics throughout the entire South; besides Hopkins will be<br />\nbenefited in many ways by sending her representatives abroad into new pastures<br />\nand fields, heretofore unexplored by her men of brawn.<br />\nRest assured, our teams will do their part and, win or lose, with honor to<br />\nHopkins and themselves.<br />\nHOPKINS IN THE B. A. C. GAMES,<br />\nN the Baltimore Athletic Club handicap games held at the Fifth Regiment<br />\nArmory last Saturday evening, Hopkins for the first time this season had<br />\nan opportunity to measure her athletic strength with that of other colleges<br />\nand clubs, and well may she feel proud of her performance on that occasion.<br /><br />\n3<br /><br />\n13<br /><br />\nTHE NEWS—LETTER.<br /><br />\nMuch interest and friendly rivalry had been aroused a week or two previous<br />\nby the interclass games in the cage, but these served merely as a training<br />\nschool for a more important series of events, of which the Armory games mark<br />\nthe beginning. Despite the fact that the number of entries this year was un<br />\nusually large, Hopkins succeeded in gaining a place in every event entered,<br />\nthat is, in all events except in the wrestling, and in the relay races where unfortunately she was unable to secure a worthy rival.<br />\nOwing to the lengthy list of contestants, it was found necessary to run off<br />\nheats of the 40. 440 and 880 yard races in the afternoon, in order to facilitate<br />\n'natters for the evening. From the brief summary given below, a little more<br />\ndefinite idea of the results of the events in which Hopkins competed, may be<br />\ngotten. It must not be lost sight of, however,that these events were handicap<br />\nHandicap<br />\nFIRST<br />\n40 yard dash,<br />\nH. F. HELMHOLTZ, 8 ft.<br />\n440 \"<br />\nU of P., 20 yds.<br />\nB. L. S., 50 yds.<br />\n880 \" run,<br />\n16 lb. shot put,<br />\nM. A. C., 5 ft.<br />\nRunning High Jump, Cen. Y. M. C. A.,6 in.<br />\n\"<br />\nBroad \" H.F. HELMHOLTZ, 3 ft.<br /><br />\nSECOND Handicap<br />\nB. C. C., 7 ft.<br />\nJ. A. FREEZE,25 yds.<br />\nCeti Y M C.A., 60 yds.<br />\nG. B. LAWSON, 5 ft.<br />\nG B LAWSON, 6 in.<br />\nW.B Y. M. C. A., 4 ft.<br /><br />\nTHIRD Handicap<br />\nB. A. 0., 5 ft.<br />\nB L. S., 20 yds.<br />\nH.V.MoRsE,anyds.<br />\nB. A. C., 24 ft.<br />\nB A C., 6<br /><br />\nFrom a glance at the above, it is readily seen that Hopkins made by far<br />\nthe best showing of any team entered, despite the fact that Freeze was disqualified and second place in the 440 yard dash given to a B L. S. man. Helmholtz, our new man of great promise from the University of Wisconsin, carried<br />\noff most of the individual honors by winning first place not only in the running<br />\nbroad jump, but also in the 40 yard dash where about twenty heats had to be<br />\nrun before a winner could be picked. Lawson, another medical man who has<br />\noften before contributed his athletic talents, helped to carry out the good work,<br />\nso ably begun by Helmholtz, and succeeded in capturing second place both in<br />\nthe 16 lb. shot put and in the running high jump It is a fact worthy of note<br />\nthat Morse, a freshman, was the only undergraduate to make a place—third in<br />\nthe half mile.<br />\nThe next event of special importance in the track and field world will be<br />\nthe Georgetown games of March 7th. May the good work, so nobly begun, be<br />\ncontinued with great success on that occasion.<br />\nLACROSSE DOINGS.<br />\nESPITE the efforts of the athletic editors, nothing new or startling has<br />\nbeen unearthed in regard to lacrosse since our last issue. Practice is<br />\nbeing held in the cage four times a week, as usual, and although the<br />\nfreshmen are still conspicuous for their absence, those men who have a chance<br />\nto make the 'Varsity are doing as well as can be expected. This time next<br />\nmonth the candidates will be practicing in the open and April 4 will soon slip<br />\naround to find us crossing sticks with the University of Pennsylvania .at the<br />\nAmerican League Park. Between now and then a great deal of hard, steady<br />\nwork must be done if we hope to land another championship banner. Several<br />\nrumors have floated down from Swarthmore to the effect that the Quakers are<br /><br />\n(R<br /><br />\n11<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nturning out a strong team and make every effort to avenge the defeat of last<br />\nseason. Whatever truth there may be in the reports, the fact remains that<br />\nSwarthmore invariably turns out a strong team, trained to the hour. Under<br />\nany conditions we shall have to hustle to down our greatest rival, not to say<br />\nanything of the necessity of walloping the newcomer, Stevens Institute. Its<br />\nclearly up to the faithful few; so get busy, boys, we need the money!<br />\nRegarding the schedule, Manager Addison has practically arranged everything except the game with the English team, and right here he seems to have<br />\nencountered numerous difficulties. When it was first reported that the OxfordCambridge twelve would reach here about Jnne 16, the Harvard management<br />\nvery kindly offered to arrange a game for Hopkins on June 25. Every student<br />\nknows that this is entirely out of the question and the game had been about<br />\ngiven up when it was learned that the Englishmen expect to reach here a week<br />\nsooner. It was also learned, incidentally, that the University of Pennsylvania<br />\nhas a game with the visitors somewhere around June 13. When and how<br />\nPennsylvania managed to accomplish this is not clearly understood, but it may<br />\nbe said with reasonable accuracy that Harvard will naturally favor the members<br />\nof the inter-University League in arranging a series of games between the<br />\nEnglish twelve and the college teams of the United States. When our con<br />\nspicuous position in lacrosse is considered, it seems reasonable that Hopkins<br />\nshould be numbered among the teams which are to measure strength, skill and<br />\nendurance with the foreigners. By defeating the members of the inter-University League, the foreigners will certainly not be justified in saying that<br />\nthey defeated the strongest college teams of the United States, Manger Addison has written direct to the English management and it is to be hoped that we<br />\nmay have a chance as well as Harvard and Pennsylvania.<br />\nBASE BALL FOR 1903.<br />\nN answer to the various inquiries that have been made from time to time, the<br />\nstatement may now be accepted as authoritative that Hopkins will have a<br />\nbase ball team in the field this season Present prospects are very encouraging. Ever since the unfavorable action of the Athletic Board in this direction<br />\nsome weeks ago, the question of a team \"to be or not to be,\" has been more or<br />\nless discussed, but only in a vague, 'indefinite sort of way, except by those<br />\nespecially interested in the team's success. These, remembering the hard, but<br />\nfutile fight for recognition last year, were in no way discouraged,—although<br />\ndisappointed,—by the unfavorable verdict of the Board this year, have been,<br />\nwith characteristic perseverance and \"stick-at-it-ness,\" quietly at work formulating plans for the organization of a successful, self supporting team.<br />\nThe spirit shown by the members of recent base ball teams is worthy of the<br />\nhighest commendation, and cannot but help elevate athletics in general at our<br />\ninstitution No man participates from any sense of duty, as is sometimes<br />\nunfortunately, but undeniably, the case in other branches of athletics; but each<br />\nis actuated purely and solely by his love for the game. Since no athletic honors—the \"reward of personal ability\"—are offered in this line as an incentive<br /><br />\n3<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nto stir up, Or bring out men, with whom ambition for honor has more weight<br />\nthan interest, playing cannot be attributed to selfish or unworthy motives.<br />\nAlthough no formal call for candidates will be made before the last part of<br />\nthe month, when active practice will be resumed, some few of the old \"standbys\" and a recruit or two have been \"fussing\" about in the Cage on Saturdays<br />\nall during the winter. Captain Whipple feels well pleased with the outlook;<br />\nand to the men themselves, the very presence of Whipple in command is of itself<br />\nno inconsiderable source of encouragement. To compensate in a measure for<br />\nthe loss of the valuable services of certain of last year's players, notably Campbell and McKnight, old players will probably fill their places.<br />\nA glance at the schedule is sufficient evidence that the work of the<br />\nteam this season is a difficult one; in fact, it may seem that ambition is running<br />\naway with good judgment, but while even the most sanguine can scarcely look<br />\nfor success against such veterans at the game as Georgetown or the Maryland<br />\nAthletic Club, yet the general opinion prevails that there is more honor to be<br />\nderived from a creditable showing against such teams than from a victory over<br />\na team that should be easily defeated. Besides these two mentioned, no one is<br />\nexpecting a \"walkover\" with Gettysburg, Mount St. Mary's or with Columbian<br />\nUniversity, all of whom are fully our \"size.\" In addition to the above schedule, a short Easter trip has been arranged, which, however, had to be canceled<br />\nowing to the inability of several players to leave town during the holidays.<br />\nThis trip was to have been as follows:<br />\nApril 13th—Gallaudet College, at Washington.<br />\nApril 14th—Fredericksburg College, at Fredericksburg.<br />\nApril 15th—Randolph Macon College, at Ashland.<br />\nIn conclusion, attention may be called to the fact that the management,<br />\nfully realizing the uncertainty of depending upon home patronage, has purposely arranged all but two games to be played out of town. Under the circumstances, therefore, it does not seem too much to expect that all who can<br />\npossibly do so, will lend the encouragement of their presence at these two<br />\ngames when we meet our ancient rivals, Maryland Agricultural College and<br />\nWestern Maryland College, upon native soil. The work of trying to establish<br />\na strong, representative base ball team on a firm footing, is a deserving one,<br />\nand to merit the hearty support and good will of the entire student body.<br /><br />\nSCHFDITLE.<br />\nMarch 21st—Rock Hill College.<br />\nMarch 28th—Columbian University,(?) at Washington.<br />\nApril 4th—Washington College, at Chestertown.<br />\nApril 11th—Maryland Athletic Club, at Maryland Oval.<br />\nApril 25th—Open.<br />\nMay 2nd—Western Maryland College, at Baltimore.<br />\nMay 8th—Gettysburg College, at Gettysburg.<br />\nMay 9th—Mt. St. Mary's College, at Emmittsburg.<br />\nMay 13th—Georgetown University, at Georgetown.<br />\nMay 16th—Maryland,Agricu1tural College, at Baltimore.<br /><br />\n16<br /><br />\nTHE NEWS—LETTER.<br /><br />\nOZZY'S ORIGINAL ODDITIES.<br />\nV. CONSIDERATE CAROLINE.<br />\nCaroline gave her ma tartar emetic<br />\nBecause she complained of having a headache;<br />\nThen remarked, when the parent began to turn green,<br />\n\"Ma's the changeablest person I ever have seen.\"<br />\nVI. MA MM'S LETTER.<br />\nOrlando, one day, fell into the fire,<br />\nAnd as the flames mounted higher and higher<br />\nMamma took no heed of the poor little soul,<br />\nBut wrote to the News, \"Substitutions for Coal.\"<br /><br />\nAfew from the \"Widow.\"<br />\n\"I hear that Phi Beta Kappa is to get out a magazine.\"<br />\n\"What are they going to name it?\"<br />\n'The Smart Set,' I guess.\"<br />\nA society swell named McCall<br />\nWho went to a fancy dress ball,<br />\nAnd thought just for fun<br />\nHe'd go dressed as a bun,<br />\nWas devoured by a dog in the hall.<br /><br />\nA Miss is as good as a mile,—for really it's only a difference in the number of laps anyway.<br />\n, \"Yes,\" murmured the summer boarder, as he turned over for the sixteenth<br />\ntime, ''this is certainly a husky mattress.\"<br />\nUneasy lies the tooth that wears a crown.<br />\nOn the Nile.<br />\nThe monkey lost his hold and fell into the crocodile's waiting jaws. Even<br />\nthen his wits did not desert him. \"I just dropped in for dinner,\" he said, with<br />\nan engaging smile.— Yale Record.<br />\nAn Arcadian Allocation.<br />\n\"We ought to have a ball game with the Shepherds,\" proposed Silinus.<br />\n\"It would be a Satyr nine proposition for them,\" protested Pan, for he<br />\nknew he had a Pipe if he played.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAXSON 0 WATTS,<br />\n4,31)rtici ZIOCCO.cs<br />\n'Baltimore and Eutaw Streets.<br /><br />\nHoccuard and Franklin Streets.<br /><br />\n1Drucis gancp Ooobis. Verfumerr, Collet Batcles, Cloaro, Sobs Iltlater.<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nFL S. WRIGHT &amp; Co.,<br />\n704 MADISON AVE.<br /><br />\nC. &amp; P.'Phone<br /><br />\nx350-Y.4-1,<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's arid Ungineers' Supplies<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br /><br />\nRALFIMOkL.IL).<br /><br />\nAgent for Eouffel 4. Esser Co., of New York.<br /><br />\nt-4 PC<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nStudents' Supplies.<br /><br />\nMadison E.? Howard Sts.<br /><br />\nbieorporated 157/4.<br /><br />\n\"eVs Stfona as the Steonskest.\"<br /><br />\nME FIDELITY MUTUFVL LIFE INSURPMGE GO.,<br />\nAN EXCELLENT<br /><br />\nOF Pft•I LR•DEL,Pf+IFV.<br />\nl'l'ORTUNITY is offered Students and Teachers to write Insurance for TIM<br />\nFIDELITY, either during vacation or permanently.<br /><br />\nNor Agenry In Maryland or West Virginia,<br /><br />\nAddress,<br />\nC. (\"KARAM, Manager<br />\n806.8 Merchants Hank Bldg., Baltimore,Sid,<br /><br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br /><br />\nigelafimp<br />\n,\"eareer<br />\nPUBLISHERS.<br /><br />\nSTIEFF PIANOS<br /><br />\n0001101 $300,000. 11101118 ia ffildIVIded Pf011 s $400 000<br /><br />\nMADE OP 'run BEST MATERIA UR MONEY<br />\n.ANII EXPERIENCE<br /><br />\nN<br /><br />\nDrovers &amp; Mutinies Nat'l Bank,<br /><br />\nHITY.<br /><br />\nOF BALTIMORE.<br /><br />\nwasuseoostel 9 N. 14113EliTY sT.<br /><br />\nand<br />\nGUSHING &amp;GOV:11NY'83:,a(tselir<br />\none s<br />\n34 W. fitILTIMORE 8TIMET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns I lopkins University and the Woman's<br />\nCollege of Baltimore.<br />\n91!<br />\n#<br />\n#<br />\nSTATIONBRY—Por School. ramllu, Mine and Bank.<br /><br />\nTHOS.BLAKE CO<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nHosiery, etc.<br /><br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Bale The J. H. U. Pennants, and all other College<br />\n•<br />\nPennants.<br /><br />\n219 EAST BALTIMORE ST.<br />\nA H. FETT1NG,<br />\nMANUFACTURER<br /><br />\nJan. Clark, Prod<br />\nChas. S. Miller, Cashier.<br /><br />\nI,. Strouse, rier-Prest.<br />\nEdw. P. Hayden. Arls't Cashier.<br /><br />\nGeneral Banking Bushiest, TresSacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom<br />\np r year and upward.<br /><br />\nRecounts Solicited.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON,<br />\nFOR<br /><br />\nJOHDfiN<br />\nSTRBLE11 GO.<br />\nReads as follows:<br /><br />\nt<br />\no<br />\no,4705<br />\nAVE.<br />\nSamples NubmItted of<br />\nFrench Iltritinly—no adulterants. no coloring. fine quality.<br />\nOporto Port absolutely pure, 01 superior quaiiiy.<br />\nSherry—no coloring or adulterant,, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar-- natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br /><br />\nOF<br /><br />\nSuccessor to Cummins.<br /><br />\nOren letter fraternitp 3ewelrv,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nPew eati ant) lExaminc our Zinc 35cforc Purchasing.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\n'BALTIMORE.<br />\nSpecial 'Discount to Students.<br />\nkt. a g). tcIrphonc<br /><br />\n445-u.<br /><br />\nLibraries arranged and put in<br />\norder without removal. Or sr<br /><br />\nJENNINGS &amp; HORSEY.<br />\nMEncHANT TAILORS,<br /><br />\n21 W. FAYETTE STREET.<br /><br />\n4.1.1 40- 160<br />\ntti) RUZICKA<br />\nt.6<br />\nBookbinder,<br /><br />\nBOOKS!! I<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br /><br />\n'1141[0. WARNER.<br /><br />\nJAMES R. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br /><br />\nPIPPEN'S 1300K STORE,<br />\nNear the University.<br /><br />\n605 N. EIJTRAN ST.<br />\nBaltimore's Largest Old Book Store.<br /><br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 41P- Hop<br />\n$'<br /><br />\nkin<br /><br />\nCaps<br /><br />\nNORTH GERMAN LLOYD S. S. GO.<br />\nCABIN PASSAGE AT LOW RATES.<br /><br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBUTIMORE TO BREMEN DIREGT.<br />\nFor particulars applg to<br /><br />\nft. SGHUNifiGHER &amp; GO., General Rants.<br />\nISAAC H. DIXON, PREar.<br />\n.JAS. MEIKLE,<br />\nJAS. R. RICHARDS, TREAS.<br /><br />\nTHE<br /><br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES,<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36255, "display": null, "description": null, "target_type": "file", "target_uuid": "feff1829-b7cc-47c5-b3e3-9a70ec33ffc2", "url": "http://digital.library.jhu.edu/system/files/2022-03/12234-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12234, "target_type": "node", "target_uuid": "ba714559-85cb-4f77-9062-5f5829c4e77e", "url": "/node/12234"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "24d690a9-9d27-4e53-be96-9ffa762e8577"}]}