{"mid": [{"value": 38207}], "uuid": [{"value": "25645b23-d223-4162-b8b1-a3c87c93ce13"}], "vid": [{"value": 38207}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12770-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "PI LAMS LEAD<br />\nINTRAMURAL RACE<br />\n—Page 4, Column 3<br />\n<br />\nJii1nziqopitittg<br />\n<br />\nVOL. XLI, No. 32<br />\n<br />\nNrtuoirttrr<br />\n<br />\nHOMEWOOD, BALTIMORE, MARCH 19, 1937<br />\n<br />\nEDITORIAL<br />\n\"The Coming Strike\"<br />\nPage 2<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nAnti-WarGroup SigeristCalisSpain's 0.K.0. Becomes Chapter Of Frank Crist Will Three Classes<br />\nWar 'Rebellion' In Alpha Chi Rho National Irat Represent Juniors<br />\nrows As Five Talk<br />\nBefore A.S.U. Thirty-Nine Former Omicron Kappa Omicron Members On June Committee Announce Plans<br />\nNew Bodies Join Medical School Professor<br />\nInitiated By Distinguished Group; Bowman<br />\nCrist Automatically Will Be To Hold Dances<br />\nIs Guest Of Honor<br />\n<br />\n(led<br />\nSt.<br />\nat<br />\nlay,<br />\n<br />\nnd'eat<br />\nthe<br />\nnen<br />\n.U.,<br />\nLice<br />\nirynia.<br />\n<br />\ninst<br />\n.ted<br />\none<br />\nbig<br />\ndethe<br />\nthis<br />\n5ely<br />\n<br />\nded<br />\nin<br />\nints<br />\n<br />\nIilt<br />\nrule<br />\nnce<br />\nime<br />\nthe<br />\nged<br />\ntrly<br />\n<br />\nStudent Council, Hullabaloo Sees World Fascist Drive<br />\nOn Democracy<br />\nODK, YCL And Phi Ep<br />\nAdded To List<br />\nExpresses Astonishment Over<br />\nSOUND OUT SOLONS Resistance Of \"Untrained\"<br />\nLoyalists<br />\nCommittee Hopes To Secure<br />\nA large crowd, which filled the LevPeace-Loving Congressman ering<br />\nHall parlor, heard Dr. Henry<br />\nFor Strike<br />\nE. Sigerist, Professor of History of<br />\n<br />\nChairman Of Next Year's<br />\nCommittee<br />\n<br />\nFreshman-Sophomore Dance<br />\nOn Sunday. March 14, with Insti- ton, Harrisburg and Wilmington were<br />\nTo Feature Johnson<br />\ntution ceremonies in Levering Hall, also entertained.<br />\nAt the dinner, Rev. James Hender- Seniors Favor Benny Goodthe Omicron Kappa Omicron fraterOn April 16th<br />\nson, Head Master of the Cathedral<br />\nman,Glen Gray, And Hal<br />\nnity, for eighteen years a local social<br />\nSchool of Washington and an Alpha<br />\nfraternity, joined the ranks of na- Chi Rho man of Trinity, presided as<br />\nKemp Orchestras<br />\nWOODEN APPOINTED<br />\ntional fraternities by becoming a toastmaster. Guest of Honor was<br />\nFrank Crist, '38: has been appointchapter of the Alpha Chi Rho broth- President Isaiah Bowman, who aded Junior Class Representative on Plan Small Prom Held In<br />\nerhood. Following a smoker at the dressed the visiting and newly instithe 1937 June Week Committee, it<br />\nOmicron Kappa Omicron house, at tuted Alpha Chi Rho men briefly.<br />\nConjunction With<br />\nwas announced yesterday. He will<br />\n2902 Guilford Avenue on Saturday Other speakers included L. W.<br />\nJune Week<br />\nautomatically become chairman of<br />\nMedicine at the Johns Hopkins Medi- night, ceremonies began at 9.00<br />\nSchaefer, Edward C. Bailly, and W. next year's Senior celebration.<br />\nBy \"G00-G0o\" KEmPToN<br />\ncal School, speaking yesterday under o'clock Sunday morning, and lasted<br />\nSix new campus organizations have<br />\nTickets for the joint FreshmanM. Walden of the National group, and<br />\nCrist, who is a member of the Phi<br />\nthe auspices of the American Student until 4:30 Sunday afternoon, with an<br />\nsignified their intention of taking a<br />\nChas. C. Dorsey, Dan E. Klein and Kappa Psi Fraternity, was recently Sophomore Class Dance went on sale<br />\nUnnion, in a sweeping defense of the hour's recess for a buffet luncheon at<br />\nWit Wednesday, as another class, the<br />\npart in the annual Hopkins Student<br />\nJ. E. Bauernschmidt of the newly in- elected business manager of<br />\nthe<br />\ngovernment cause in Spain.<br />\nthe Chapter House. Following the stituted group.<br />\nStrike against War, it was announced<br />\nBarnstormers and was at one time, juniors, began preparations for one<br />\nIn his lecture, \"Spain-1937,\" Dr. Institution ceremonies, the day was<br />\nof its own. The lower classes began<br />\nafter the second meeting of the<br />\nThe Alpha Chi Rho Fraternity was secretary of his class. Crist's<br />\napin a flurry of posters and annouceStrike Committee yesterday. The lat- Sigerist who is associated with the climaxed by a dinner also held in founded in 1895 at Trinity College, pointment complete the<br />\npersonnel<br />\nof<br />\nHartford. Conn. Its membership the June Week Committee,<br />\nest additions to the list of partici- North American Committee for the Lovering Hall.<br />\nwhich is ments; the juniors, mildly, by anDemocracy,<br />\nSpanish<br />\nof<br />\nAid<br />\ndeclared<br />\nThirty-nine former Omicron Kappa consists of twenty active Chapters, headed by James Bradford.<br />\npants swelled the Committee's total<br />\nnouncing the appointment of a dance<br />\nto nine, as the NEWS-LETTER, the \"The present conflict in Spain is not Omicron members were initiated, located mostly in the East, made up<br />\n\"The response to our financial cam- committee.<br />\nYMCA, and the American Student a Civil War but an open rebellion. On fourteen of which were active chap- of a membership of 5100 men. The paign has been very gratifying,<br />\nJohnson Booked<br />\nbut<br />\none side there is the people of Spain, ter members, the remainder being Omicron Kappa Omicron Fraternity,<br />\nUnion had already joined.<br />\nour goal is far from being attained,\"<br />\nBubby Johnson and his orchestra<br />\nwhile<br />\nthere<br />\nother<br />\nthe<br />\nis<br />\non<br />\nthe<br />\nmiliOKO Alumni. Louis W. Schaefer, founded on the Hopkins campus in said Bradford. \"Many<br />\nCouncil Head Present<br />\nof the Seniors are to be the feature attraction at the<br />\nPresent at yesterday's meeting tary clique supported by foreign pow- National President of the Fraternity 1919, was composed of members of have not handed in their<br />\npromissary Freshman-Sophomore dance in the<br />\nmen.<br />\nforeign<br />\nThis<br />\nwith<br />\ners<br />\nis<br />\nbut<br />\na of Alpha Chi Rho, presided at the the Hopkins only. Students of the<br />\nwere: Moses B. Macht, of the Denotes yet, and a definite June Week Maryland Casualty<br />\nClubrooms, next<br />\nbating Council; Gerald Branower, of part of the world offensive of Fascism Institution ceremonies and was as- Hopkins and members of Omicron program cannot be<br />\narranged until a April 16th. The price has been<br />\nset<br />\nsisted by Sydney Pinney, National Kappa Omicron who were instituted greater<br />\nPhi Epsilon Pi; Stanley M. Finkel, of versus Democracy.\"<br />\nnumber of fees have been at $1.25. Harry M. Hopkins<br />\nand<br />\nDr.<br />\nSigerist traced the decline of Vice President Wilbur M. Walden, into the national fraternity are Ferd- paid.\"<br />\nthe NEWS-LETTER; Hershner Cross,<br />\nTheodore Reese head the Sophomore<br />\nPresident of the Student Council; Spain's economic situation until at National Secretary Ormand Milton, inand Hahn, George Frederick, Ralph<br />\nThe plan of the committee is to levy Committee, and Jefferson<br />\nHamilton,<br />\nHenry Kramer of the Hullabaloo; the present time it is a semi-feudal National Treasurer Rex Thompson, Goudy, George Thaler, John Sullivan, a monetary penalty<br />\nof one dollar to the Freshman.<br />\nWalter Schlesinger, of the Hopkins society with the landed aristocracy National Councillor; Professor Carl- Lawrence Hanawalt, Victor Ghent, the original cost of<br />\na June Week<br />\nDonald Wooden, a member of the<br />\nBranch of the Young Communist's as the ruling class. When the re- ton Huntley Hayes, Past National Henry Leber. Boyd Wylie, Arthur ticket if the fele<br />\nis not paid by March Cotillion Board,<br />\nwill head the ComLeague; and Theodore Graziano, of bellion broke out, Spain was in the President; J. Edward Fagen, and a Rossberg, Roy Hartman, J. Masopust, 31st. After April<br />\n15th an additional mittee in charge<br />\nof this year's Junior<br />\nmidst of a revolutionary cycle which large group of resident and out-of- William Jenkins and J. Edward<br />\nOmicron Delta Kappa.<br />\nfine will be added. Payments can be Prom,<br />\nEdward Clautice, junior presPlans for expanding the Commit- began in 1931 with the abdication of town Alpha Chi Rho members. Over Bauernschmidt.<br />\nmade to committeemen, who may be ident,<br />\nannounced Wednesday. Other<br />\ntee's scope filled a major share of the Alphonso. At that time the Spanish the week end, the Omicron Kappa<br />\nOfficers of the newly instituted found in the main lobby<br />\nof Levering members- of the<br />\ncommittee include<br />\nmeeting time. It was decided to is- aristocracy, it was claimed, sacrificed Omicron men were hosts to guests chapter were immediately elected Hall on March<br />\n29, 30 and 31 from Arthur Savage,<br />\nIrvin Lefstein, Frank<br />\nsue a second appeal for representa- their monarch for more privileges. from Trinity College, Dickinson, Uni- and J. E. Bauernschmidt, Thaler, 12:00 to 1:00<br />\np.m. and 4:00 to 5:00 Ohristoffell,<br />\nGeorge Weigand, Seytives of other campus organizations Gradually, the people fell into more versity of Pennsylvania, Lehigh, Rut- Hahn, Wylie, Sullivan, Hanawalt, p.m.<br />\nmour Roma.novsky, and William<br />\nto attend a meeting set for Monday' dire straits with the aristocracy gers and Lafayette. Alpha Chi Rho Goudy, and Leber were elected to re\"It is imperative that payment be<br />\nKempton.<br />\nopenly defying the government's min- Alumni Clubs of Baltimore, Washing- sponsible positions.<br />\nApril 29th.<br />\nmade by March 31st,\" Bradford dewage<br />\nimum<br />\nlaws<br />\nmeasures<br />\nand<br />\nuntil<br />\nSmall Dance Planned<br />\nCongressmen Hoped For<br />\nclared. \"Our option on the Main Ball<br />\npeople<br />\norganized<br />\nthe<br />\ninto<br />\nPoputhe<br />\nAt<br />\npresent,<br />\nEfforts to contact Congressional<br />\nsaid Clautice, the junRoom of the Alcazar will expire if<br />\nleaders to head the list of speakers lar Front Party.<br />\nwe do not take some action by April iors are booked for a small dance to<br />\nbe held in conjunction with June<br />\nThe war itself is conducted by this<br />\nat the strike began immediately af1st.\"<br />\nter the meeting. Those tentatively in- People Front Party which, like the<br />\nThe Annapolis Roads Club is being Week. The great names, which have<br />\nvited are Rep. Maury A. Maverick, party in France, is a combination of<br />\ncontacted to provide the scene for the adorned the bandstand at previous<br />\nTexas liberal; Rep. Ernest Bernard, many. Thus, Spain cannot give clear<br />\nannual beach party that has been Junior Proms, will not be called on<br />\nthe Minnesota Farmer-Laborite, who concise decisions because of its multi- Marburg Contribution Forms Seek 2 Scientists For Pro- part of the Spring activities in for- this year.<br />\ncast the lone vote against the present partied government.<br />\nmer years. Because of complaints<br />\n\"This is to be a junior dance, run<br />\nLatest Addition To<br />\njected Trip Into Arizona from<br />\nembargo on shipments of arms to<br />\nmen who said that \"fees were by juniors,\" said Clautice.\" The<br />\nIn describing the conditions in the<br />\nHopkins Group<br />\nSpain; Congressman Sam McRey- war, Dr. Sigerist stressed the fact<br />\nAnd Utah<br />\nslapped on them from all sides\" ad committee is doing its best at this<br />\nnolds of Texas, co-author of the ad- that in the beginning of the rebellion<br />\nlast year's beach party, an attempt is time to secure a good band at a<br />\nTwo men from Johns Hopkins Uni- being made to absorb the 'Usual locker small price.\"<br />\nministration Neutrality Bill now be- the Loyalists had practically no<br />\nThe new Johns Hopkins Club will<br />\nfore the House; Rep. David L. Lewis, trained men whatsoever.<br />\n\"It is be opened Thursday evening, April versity may be selected as members fee into the price of the June Week<br />\nSophomores serving on the -jo<br />\n-trit<br />\nWestern Maryland Democrat; Sen. astounding,\" he said, \"that Madrid 1st, at a reception and housewarm- of<br />\nthe scientific expedition now being ticket.<br />\ncommittee are: Frank Parker, WilGerald P. Nye, North Dakota muni- has resisted the Rebel army so long, ing, given by the Club to members<br />\nBradford refused to commit himself liam<br />\nLamble, William<br />\norganized for the exploration of the<br />\nMehling,<br />\ntions prober; and Maryland's two for when the Italian and German of the University Alumni. The Clubin naming the orchestras which would Charles Graw, Nelson<br />\nLloyd, Robert<br />\nMillard<br />\nTydings<br />\nSenators,<br />\nand troops advanced against her, she house has been completed through northern Navajo country in Arizona probably be contracted by the comAnderson, Charles McShane, and<br />\nGeorge W. Radcliffe.<br />\ndidn't even have sufficient guns for the aid of Mr. Theodore Marburg and Utah this summer. The men may mittee. Bands in the past have set a John Kilbourne. The<br />\nfreshmen inand Miss Amelia Marburg, as a be students or instructors and must high standard in entertainment. clude John<br />\nall her men.\"<br />\nChurch Speaker Planned<br />\nHall, Hal Jaffee, Ernest<br />\nmemorial<br />\nWilliam<br />\nMarburg,<br />\nA.<br />\nBenny<br />\nto<br />\nThe program is also to include a<br />\nGoodman and Jimmy Lunce- Keiney, Joe Zavertnick,<br />\nbe interested in engineering, archaeDr. Sigerist also revealed the fact<br />\nJohn Herford were engaged for last year's bert, and Edwin<br />\nspeaker from the YMCA, one from that Italy was in touch with Franco and Charles L. Marburg. The buildi- ology,<br />\ngeology, or in the biological<br />\nLowthian.<br />\nJune Week. Ray Noble and Hal<br />\nthe Student Union, and a representa- before the actual rebellion broke out ng forms the latest addition to the<br />\nIn announcing the opening of<br />\nsciences—or in the management of a<br />\nKemp, in 1935. The sentiment of ticket sales<br />\ntive of Baltimore Church Groups. and that the crash of an Italian bomb- group of buildings at Homewood.<br />\nHopkins, as general<br />\nscientific expedition, it was learned the Seniors, this year, seems to favor<br />\nPlans are going forward to secure an er in France before the war points<br />\nThe Johns Hopkins Club, comchairman of the committee, called<br />\nunofficial representative of the Uni- to the immense aid received by the posed of faculty, administrative of- this week through an announcement Benny Goodman, Glen Gray Will Os- for cooperation<br />\nbetween the two<br />\nversity R.O.T.C. The strike is to be rebels before the war. The attitude ficers of both the University and the by Dr. Charles Del Norte Winning, borne and Hal Kemp.<br />\nclasses for a successful dance.<br />\nheld outdoors.<br />\nof the neutral countries is especially Hospital, graduate students, and field director of the Rainbow Bridge\"This is one time,\" he said, \"when<br />\nNationally the strike is sponsored harmful to the Loyalists for it Alumni, will take over the operafreshmen and sophomores bury the<br />\nMounment Valley Expedition.<br />\nby the United Student Peace Commit- amounts to a boycott against Spain. tion and care of the new club-house,<br />\nhatchet. Let's all do our best to make<br />\nThe expedition is to explore, map,<br />\ntee. This makes the fourth year that<br />\nit a happy funeral.\"<br />\nIn the summer of last year France and its use will be restricted to<br />\nthe demonstration has been held at the<br />\nand study an area of some 3,000<br />\nhad an opportunity to aid the Loyal- members and their guests. New<br />\nHopkins. Its career began stormily<br />\nists and nip the revolt in the bud but members to the club may be elected square miles in a remote region that Kirkley, \"Sun\" Critic, Evaluates<br />\nWhen embattled R.O.T.C. members<br />\nPoet At Playshop<br />\nwas warned by England that if Ger- through a board of control, after Is probably farther from a railroad<br />\nturned a hose on a faculty speaker.<br />\nDiscussion<br />\nmany attacked her she would not be receiving endorsements of two mem- than any other point in the United<br />\nIn 1935 it was coupled with a proaided by Great Britain. \"England,\" bers. It is planned to keep the Club States. Penetrating<br />\nas far as posDisregarding the weather conditest against the pending Teachers'<br />\nsaid Sigerist, \"is officially for the open for eleven months each year, durtions<br />\nlast Tuesday night, a good-sized Dr. Krantz Addresses American<br />\nfield<br />\nOath Bill. Last year's strike was<br />\nmotor,<br />\nsible<br />\nparty<br />\nby<br />\nthe<br />\nwill<br />\nrebels, for the English Cabinet wishes ing which period meals will be servChemical Society On Past<br />\ncrowd turned out to hear Donald<br />\nconsidered the most peaceful and orequipment<br />\nby<br />\npack<br />\nthen<br />\ntrain<br />\nmove<br />\nnominal<br />\nat<br />\ned<br />\nprices,<br />\nwith<br />\nspecial<br />\nto protect English investments and<br />\nKirkley,<br />\nwell-known<br />\nderly in history.<br />\ntheatrical<br />\nDevelopments<br />\ncritic<br />\nwhen the war is over, loan money to arrangements available for parties up winding canyons out into Rainbow<br />\nof the Sun paper in this city, discuss<br />\nhead<br />\nthe<br />\nPlateau.<br />\nbanquets.<br />\nof<br />\nNear<br />\nthe<br />\nor<br />\nDogoFranco.\"<br />\nDr. J. C. Krantz Jr., professor of<br />\nthe career of the popular playwright,<br />\nThe clubhouse itself, located in a szhi Biko, base camp will be estabMaxwell Anderson.<br />\npharmacology at the School of Medifrom<br />\nthis<br />\nlished,<br />\npoint<br />\nand<br />\nscouting<br />\nsecluded corner of the campus, behind<br />\nShakespearean Authority<br />\nMr. Kirkley spoke on the various cine, University of Maryland will<br />\nthe botanical gardens, is of Georgian parties and scientific workers will<br />\nplays<br />\nwritten by this author, includ- speak at a meeting of the Maryland<br />\nTo Address Literary Club architecture, and harmonizes com- push on afoot.<br />\ning his present work now showing in section of the American Chemical<br />\npletely with the rest of the HofnePanted Gynecologist Will Speak On<br />\nNew York, entitled \"High Tor.\" Society tonight at 8:15 in room 101<br />\nMr. Henry M. Paul, Philadelphia wood group. Considered ideally arReligion At Meeting To Be<br />\nThroughout his lecture his personal Remsen Hall on the subject of \"ChemShakespearean<br />\nauthority<br />\naddress<br />\nwill<br />\nranged for its purpose, it is said to be<br />\nHeld In Levering<br />\nopinion was expressed in regard to istry in Medicine.\"<br />\nthe Tudor and Stuart Club on \"The one of the finest such club buildings<br />\nAnderson's plays. Kirkley stated<br />\nThe talk will deal with anesthesia,<br />\nPictures<br />\nEarliest<br />\nof<br />\nthe Plays of in the country. There are spacious<br />\nDr. Howard A. Kelly, one of the<br />\nthat Maxwell Anderson is not as analgesia, antiseptics, sympathetic<br />\nShakespeare,<br />\nHow<br />\nor<br />\nTudor<br />\nPlays<br />\ndining rooms, lounges, game rooms<br />\nfounders of the Hopkins Medical<br />\nWith last year's victorious schedule great a poet as hd is a playwright. stimulation, insulin, and the<br />\noutlook<br />\nSchool, and world famous gynecolo- were Adapted to the Stage of the and reading rooms. There are re- in mind, the golf team is not only aimconcluded his talk by declaring that for future development.<br />\ntonight<br />\n8:15<br />\nat<br />\nStuarts,\"<br />\nin<br />\nthe<br />\nClub<br />\nfreshment rooms, locker rooms and ing to repeat last year's results, but<br />\ngist, will lead the discussion this<br />\nDr. Krantz, born in 1899 in Balti\"High Tor,\" now running on Broadshowers. One wing is to be reserved do better. Last year the team won<br />\nafternoon at the Fireside sessions at Rooms.<br />\nway, is the best play Anderson has more, was graduated from the Unibeen<br />\nMembers<br />\nasked<br />\nhave<br />\nto<br />\narrive<br />\nfor the use of women members.<br />\nLevering Hall at 4:15 p.m.<br />\nsix out of ten against much stiffer ever written.<br />\nversity of Maryland School of PharThe subject to be discussed is: on time inasmuch as the talk will be<br />\nDues for the club are fixed at $10 competition than they experienced<br />\nmacy in 1919. He took his Ph. D.<br />\nSkits Presented<br />\nillustrated.<br />\n\"How My Religion has Helped Me<br />\nper year for a resident membership, during their first year when they<br />\nFollowing the<br />\nKirkley lecture degree from the same school in 1928.<br />\nto Fulfill My Desires.\" The group is<br />\nand it is planned to suspend the ini- turned in an undefeated record.<br />\nfour skits were presented by students He was associate professor of pharlimited to 20 students and those ex- Sigerist Speaks Tonight tion fee for all applications received<br />\nThe prospects of this year's team of the University. The first entitled macy from 1921-1926 and<br />\nprofessor<br />\nPecting to attend must sign up at<br />\nbefore May 31, 1937. The Johns Hop- looks very promising with all of the \"Elizabeth, The Queen,\" by Maxwell from 1926-1927. He<br />\nleft the Unionce. Lists are posted in Levering<br />\nDr. Henry E. Sigerist, Professor of kins Club has been in existence fiQr boys back, together with the new- Anderson, was given<br />\nby Elizabeth versity of Maryland in 1927 to direct<br />\n'tall and at the post office.<br />\nthe History of Medicine at Johns Hop- several years, and, with the acquisi- comers, Ted Schad, Johnny Soule Roberts and Ted<br />\nGeorge. Helen Polia- the Pharmaceutical Research at<br />\nAt the Fireside meeting last Tues- kins University, will be the guest tion of larger facilities, wishes to and Allan Pinkerton. The team's koff and<br />\nMartin Rude did a scene from Sharpe and Dohnie. He left this post<br />\nday afternoon Dr. Albert Blumberg speaker tonight before a meeting of make its membership available to a schedule for this year includes nine<br />\n\"Saturday's Children.\" Patty Singe- in 1930 to become chief chemist of<br />\nled a discussion on \"The Place of the University of Maryland Medical larger number of eligible Alumni and matches, four at home and five away. wald<br />\nand Russell Magill, presented the Maryland State Health DepartReligion in Modern Society.\" The Forum. His address, \"Medical His- faculty members. Applications for<br />\nThe team will again have as its a scene from \"Winterset.\" Dolly Ash- ment. In 1932, he left that<br />\npost to<br />\ndiscussion was said to be very lively, tory in the Making,\" will be delivered membership should be mailed to Dr. home course this year the Rodgers<br />\nley closed the evening's entertainment take the position he now holds.<br />\nand the group did not adjourn until in the Gordon Wilson Memorial Hall W. B. Kouwenhoven, Secretary of the Forge Golf and Country Club at Towwith a sketch from \"The Wingless<br />\nRefreshments will be served after<br />\nafter 6:30 p.m.<br />\nof the University Hospital at 8:15.<br />\nClub.<br />\nson.<br />\nVictory.<br />\nthe meeting.<br />\n<br />\nNew University Club Navajo Explorers<br />\nTo Open On April 1 May Pick,J.H.U.Men<br />\n<br />\nRanks 'High Tor'As<br />\nBest Anderson Work<br />\n<br />\nMedicinal Chemistry<br />\nSubject Of Address<br />\n<br />\nDr. Kelly Addresses<br />\nFireside Chat Today<br />\n<br />\nLinksmen Hopeful<br />\nOf Banner Season<br />\n<br />\nt<br />\n<br />\n\\1<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 19, 1937<br />\n<br />\n2<br />\n<br />\nbe<br />\n<br />\n3obn5 ji)ophinti<br />\n<br />\nA New Angle<br />\n<br />\nA minor angle on the matter of gate receipts is<br />\nanother worry which the Hopkins athletic office will<br />\nnever have to contend with. This is the question of a<br />\nFederal tax on admissions to athletic contests.<br />\nWe are in receipt of a dispatch from the Associated<br />\nCollegiate Press stating:<br />\n\"The Bureau of Internal Revenue has requested the<br />\nDepartment of Justice to enter suits against the Uni$2.00<br />\nSubscription per year<br />\n$2.50<br />\nBy Mail<br />\nversity of Georgia, the University of Iowa, the University of Michigan, the University of Minnesota, and<br />\nthe Georgia School of Technology.<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\n\"Several suits have already been instituted and the<br />\nRemsen Hall, Postotlice, Johns Hopkins University.<br />\nfirst round in one case was won down in Atlanta last<br />\nDecember when a Federal judge ruled with the<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\ncolleges.\"<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nThus the government, among other factors, is cutmoney collected at games. We will be<br />\nPublished semi-weekly from October to June, except during exam- ting into the<br />\nination and college holiday periods by undergraduates of the Johns spared any contention or concern over what is conHopkins University.<br />\nsidered a real symbol and definite part of commercialism in collegiate sports.<br />\nMaybe we did not make such a bad move after all.<br />\nEDITORIAL STAFF<br />\n<br />\netuz<br />\n<br />\nLetter<br />\n<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nManaging Editors<br />\nJames Morrow, David Caplan<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barron, Jr<br />\nAssistant Sports Editor<br />\nHarold Zheutlim<br />\nColumnist<br />\nPaul Berge<br />\nReporters—Max Islcowitz, Nathaniel Finkelstein, Jewett gGoldsmith,<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz, Scymore Sacks, Irving Millberg, Milton Alperstein,<br />\nZenas Baum.<br />\nBUSINESS STAFF<br />\nBusiness<br />\nAssistant Business<br />\nAdvertising<br />\nCirculation<br />\nOffice<br />\nCopy and Filing<br />\n<br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Witten<br />\nHoward Linkoff<br />\nNathaniel Soifer<br />\n<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\n<br />\nRSP*I$ENTCO FOR NATIONAL ADVSRTISING ST<br />\n<br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br />\n<br />\n420 MADISON AVE.<br />\nc ic • 00<br />\n<br />\ntg36<br />\n<br />\n.<br />\n<br />\nRG5T01•1<br />\n<br />\n. SAN FRANCISCO<br />\nANC<br />\nSEATTLE<br />\n•<br />\n<br />\nMember<br />\n<br />\n1937<br />\n<br />\nRssociated Collegiale Press<br />\nDistributors of<br />\n<br />\nColeesiale Difseit<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nFRIDAY, MARCH 19, 1937<br />\n<br />\nThe Coming Strike<br />\nWhile plans are being drawn up for this year's<br />\nstrike against war, it is essential that all campus organizations meet, discuss their possible participation, and<br />\nchoose a delegate for the next meeting on the Monday<br />\nwhen we return to school at 12.20 in Levering Hall<br />\nBoard Room.<br />\nWe, supporting this strike, wish to make the basis<br />\nof this demonstration as broad as possible and to enlist<br />\nthe backing of every group affiliated with the Hopkins.<br />\nThis will be a strike that is general, and we hope effective, manifestation of student sentiment against war.<br />\n<br />\n\"Teaching is not a one-club game. The teacher who<br />\nuses only a single technique is no further along than<br />\niv the golfer who plays the entire course with a single<br />\nclub.\" Prof. Guy M. Wilson of Boston University's<br />\nof education recommends diversity of technique minus<br />\nthe clubs.<br />\n<br />\nNew York Alumni Spirit<br />\nThe Musical Club's trip to New York uncovered an<br />\nelement which many Hopkins students have thought<br />\ndormant, that of an alumnus school spirit. Sponsored<br />\nby the Hopkins club of New York City, the concert was<br />\na huge success due to the efforts of that organization,<br />\nand the audience, largely of Hopkins graduates, was<br />\nthe most genial and enthusiastic that the club encountered in its entire season. The alumni organization arranged to put the musical group up at the<br />\nWarwick Hotel, the scene of the concert.<br />\nThe whole affair showed a living spirit in the Hopkins on the part of those residents of New York who<br />\nhave left Hopkins halls and who retain memories of<br />\nthe days spent here, and wanted to show it in a way<br />\nthat would touch personally the undergraduates of<br />\ntoday.<br />\nSo congenial was the relationship struck up between<br />\nthe alumni and undergraduates, and so successful was<br />\nthe concert itself, that assurance was given the affair<br />\nwould be repeated in years to come.<br />\n<br />\nAn Important Struggle<br />\nDr. Sigerist's talk on Spain brought to light some<br />\nphases of the situation that most of us are inclined to<br />\nomit in judging the situation.<br />\nIn the first place to clearly appreciate the recent<br />\nevents one must study the history of Spain for centuries<br />\nback and the series of development w'hich led to the<br />\npeculiar position of Spain today. This background was<br />\nsketched admirably by the speaker.<br />\nAnother piece of information little realized are the<br />\nremarkable cultural advances made by the government<br />\nIn spite of the bloody conflict within such proximity.<br />\nThe special batallion appointed by the government is<br />\nendeavoring to save works of art and protect nonfighting men of learning and art. Exhibits and new<br />\ntheaters are being formed. Over twenty-five thousand<br />\nstudents are now being trained for the teaching profession in the normal schools demonstrating the clear<br />\nfaith and confidence the people of Spain possess in the<br />\ndemocratic<br />\nfuture success of their duly-elected<br />\n<br />\nWith this in mind, we feel certain that the wide<br />\nbackbone of the strike is broad enough to include all<br />\nshades of opinion on this matter. We want a large,<br />\nall-inclusive crowd of students backing the demon- government.<br />\nstration; it must be necessarily so to insure a successWe students should be concerned with what is going<br />\nful and convincing mass protest against war.<br />\non in Spain. Students just like ourselves are fighting<br />\nWhile war rages in bloody Spain, while the memory to make their homes a decent place to live in—to crush<br />\nof the Ethiopian and Chinese aggressions are fresh in a rebellion of what a foreign correspondent called a<br />\nour minds, while the horrors of the World War and the few days ago \"professional killers.\"<br />\nsobering, shocking truths of what we were actually<br />\nIt is appropriate at this time when America is makfighting for are known to us, we must not stand idle ing up her mind on her position to learn from the<br />\nin apparently peaceful times. We must realize that experience of other countries. Spain is now fighting in<br />\nostriching ourselves with \"neutrality\" legislation gives the same battle which the peoples of Germany and<br />\nus an all-too-false sense of security.<br />\nItaly lost—to have the forces of Fascism turn back<br />\nIt is up to us to<br />\nWhat is apparent to us is that to combat the twin the clock of civilization and progress.<br />\nof war and<br />\nmenaces<br />\nthe<br />\ncombat<br />\nand<br />\nlesson<br />\nour<br />\nlearn<br />\nWar<br />\nand<br />\nFascism<br />\nof<br />\nevils<br />\n(or should we say single)<br />\nprovent a conflict before it arises.<br />\nunited action is necessary.<br />\nThis strike against war is a means of deminstrating to the world just how the most potential cannon<br />\nfodder feels about ending our lives in some unmarked<br />\ngrave, about living physically and mentally shellshocked or gassed. We may differ as to the solution to<br />\nthe problem of war; but that we all oppose this devastating and damnable threat to civilization, we all<br />\nagree.<br />\nAnd that is why we should all support this strike.<br />\n\"The college, as a producer of adults, should shift<br />\nemphasis from future values to the significance of<br />\npresent experiences. The terrible discount on present<br />\nvalues is akin to the evils of hoarding. Life in college<br />\nis as real as life anywhere.\" Pres. Henry M. Wriston of<br />\nBrown University asks student to \"Wake Up And<br />\nLive\" in the present.<br />\n<br />\nA Matter Of Honor<br />\nOur attention has been called to the unauthorized<br />\nwearing of Hopkins athletic letters by a few students<br />\non the campus.<br />\nThese students should recognize and respect the<br />\nInsignia of the University and realize that only those<br />\nwho have earned and who were awarded these honors<br />\nshould b entitled to wear them. It is not only violating<br />\nthe letter of Athletic Association (a student organization) but the spirit and honor of the Hopkins Athletic<br />\nsystem.<br />\nThis matter is also part and parcel of the honor system, guarded by the Student Council. Any student who<br />\nwears an athletic award he did not earn is cheating<br />\nand lowering the dignity of those entitled to these<br />\nhonors.<br />\nWe feel certain that the few men we have in mind<br />\ndo not comprehend the true significance of their actions;<br />\nwe hope that they reflect on this matter and act<br />\naccordingly.<br />\n<br />\nUNIVERSITY<br />\nSo you're going on a snow train<br />\n<br />\nQUARTER NOTES<br />\nMusic's muse came to Baltimore of a series of two will fature Wagner's Lohengrin on Monday, March<br />\n<br />\n(You're going whether you want to this week. She offers a varied proor not, I racked my brains for an hour gram with four highlights. The first<br />\nfor this.) The first thing you do is took place Tuesday at the Lyric Theato get a large comfortable revolver. ter. At that time the one and only<br />\nNow, when you have collected your<br />\nPaul Whiteman lead the National<br />\nskiis, poles, wax, knapsack, boots, ski<br />\nSymphony Orchestra in a program of<br />\ntips and your camera the night before<br />\nDeems<br />\nmodern American music.<br />\nand put them in a pile in the middle<br />\nTaylor, a composer himself, was the<br />\nof the room, you can go to bed. Not<br />\noral program annotators. Among the<br />\nfor long of course, because skiing<br />\nfeatured artists were Casper Reardon,<br />\nequipment has a nasty habit of stealthe harpist, The King's Men Quaring away in the night and not coming<br />\ntette and Roy Bargy, the pianist.<br />\nback. So, every three-quarters of an<br />\nTwo weeks later, on Tuesday,<br />\nhour, you creep out of bed and sud30th, the great Roritz RosenMarch<br />\ndenly flash on the light to see whether<br />\nthal will be the soloist with the Namay<br />\nyou<br />\nluck,<br />\nyou're<br />\nif<br />\nthere,<br />\nall<br />\nit's<br />\ntional Symphony. He is the last of<br />\nsee the knapsack about halfway to<br />\nthe<br />\nPrinces of the Piano. The grand<br />\nthe door, and if you miss it, God<br />\nschool of Liszt and von Bulow finds<br />\nknows it won't be there in the mornits last counterpart in the aged but<br />\ning.<br />\nunbent figure of this eversensational<br />\nA little (and that's putting it mild- virtuoso. Here is a musical event of<br />\nly) bleary-eyed you roll out of bed the first magnitude.<br />\nwith a dull thud and swear at the<br />\nThe Metropolitan Opera Company<br />\nFinn who invented skiis. The sun<br />\nwill come to the Lyric on two evedon't<br />\nbrother,<br />\nand<br />\nworry<br />\nisn't up yet,<br />\nnings and will offer programs which<br />\nit won't be for a couple of hours.<br />\nshould not be missed They are events<br />\n'That old boy knows when to stay in<br />\nwherever they are given The first<br />\nbed. Your breakfast, which consisted<br />\nof a large porringer of steaming oatscraped. You will receive not one<br />\nmeal (and when I say steaming I<br />\nbut many severe cracks on the side<br />\nmean it) has left your esophagus a<br />\nof the head with an exuberant skier's<br />\nstreak of red lightening, but when<br />\nskis, and it will develop that the peryou start your Christinias you'll forson who did it was at the other end<br />\nget that.<br />\nof the other end of the car at the<br />\nIf by the time you get to the train time. While you are busy ducking flyyou haven't gotten into several fights ing wads of ski wax, which is being<br />\nwith people you have unfortunately thrown about for comparison (being<br />\npoked in the eye with the tips of your hale and hearty, a skier never stoops<br />\npoles, you will not only be very lucky, to handing things, he throws them<br />\nbut in a worse humor than ever from and hard too) the little man at your<br />\ncringing before the lowest swine in side is plucking at your sleeve to<br />\nthe country. However, at the train, make you pay attention to the story<br />\nthe scene changes. The crowd, ex- of what he did for a head-cold down<br />\ncept for a few of the more poisonous in Java.<br />\ntypes that take mental notes on just<br />\nThe continual din and that damned<br />\nhow well you can ski, are made up<br />\nlittle man plucking at your sleeve<br />\nof a cheerful lot. You must expect<br />\nleave you only one solution. The<br />\nto be pounded on that sore you have<br />\nColt. If you are lucky, you can shoot<br />\nfrom tripping over the skiis in getyour way to a door and the jump for<br />\nting out of the taxi, by at least five<br />\nit. Any little town along the road<br />\nor six very hearty persons who loudly<br />\nwill have a good bed and a quart or<br />\nproclaim that you are about to spend<br />\nso, and that you'll admit is better<br />\nthe most enjoyable and healthy Sunthan any man's skiing.<br />\nday you have ever spent in your life<br />\n(they can spot a newcomer at two<br />\nhundred yards).<br />\n<br />\n29th<br />\n<br />\nThe Teutonic great such<br />\n<br />\nsing the music-drama of the White<br />\nKnight<br />\n<br />\nWhile on Wednesday, March<br />\n<br />\n30th, both Cavalleria Rusticans and<br />\nPagliacci will be sung. Martinelli,<br />\nJagel, Cordon, Pinza and Ponselle will<br />\nbe among the cast As these two<br />\nnights will be the only ones in which<br />\nBaltimoreans will have a chance to<br />\nsee and hear the wonderful Met creations, a super-capacity crowd is ex<br />\npected And so the Muse of Music<br />\ncomes to Baltimore<br />\nAuditur will keep you posted as to<br />\nthe coming musical events in town,<br />\nfor he believes that Hopkins has a<br />\nlarge number of quarter note lovers.<br />\nAuditur.<br />\n<br />\n66 BAFFLES INSIDE<br />\nFILTER -COOL SMOKE<br />\nIn<br />\n<br />\nRE III<br />\nWALNUT<br />\nIMRE<br />\nSUL MRS<br />\n<br />\n20d ite<br />\n*Wesley<br />\nfretict<br />\nFINEST<br />\nBRIAR.<br />\nMONEY<br />\nCAN BUY<br />\n<br />\n8<br />\nBWBF.<br />\n<br />\nGT VALUE<br />\n<br />\nALSO CIGARETTE AN<br />\n<br />\nSONITNINO WONIIUVL<br />\n0011 ON INSIDE<br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\ncooling mesh screen<br />\ninteriorkeeesjuiees<br />\nand flakes in Filter<br />\nand out of mouth.<br />\nPrevents tongue<br />\nbite,raw mouth.<br />\nwet heel, bad<br />\nodor, frequent<br />\nexpectoration.<br />\nbreaking<br />\nin.Improves<br />\nthe taste and<br />\naronisofm<br />\ntobacco.<br />\n<br />\nNA<br />\n<br />\nBSIJI<br />\n<br />\nBAFFLES BREAK • UP<br />\nSMOKE STREAM - FILTER REALLY FILTERS<br />\n<br />\nYou are on the train, comfortably<br />\nsnuggled down in a brush-like plush<br />\nseat when you realize that the ski<br />\ntips were left home. Much shaking<br />\nof heads follows this discovery and<br />\ninstead of getting the rest of last<br />\nnight's sleep, you are told how to prevent your skis from breaking.<br />\nThere is only one way to get rid<br />\nof the people who are hanging on your<br />\nneck and telling you what to do when<br />\nyou get up in the ski fields. You<br />\nmerely get up and walk down the<br />\naisle, turn left and stay there until<br />\nyou feel reasonably sure that they<br />\nhave gone back to their seats. (But<br />\ndon't feel too sure about that. There,<br />\nis nothing a dyed-in-the-wool skier<br />\nlikes to do more than to talk.)<br />\n<br />\nWhen you come back, the Washington crowd has come aboard, and<br />\nsince there are a great many skiers<br />\nfrom the diplomatic circles, the train<br />\nhas taken on a cosmopolitan air.<br />\nFrench, German and Scandinavian is<br />\nbeing screamed about your head.<br />\nDon't mind that, a large piece of ski<br />\nwax in either ear will partially shut<br />\nWe are happy to announce the addition of Seymore out some of the noise, and you can<br />\nSacks, Irving Millberg, and Milton Alperstein to the get back to sleep beside that quiet litNEWS-LETTER staff. We extend to them our heartiest tle. man who is reading up on his<br />\ncongratulations.<br />\nskiing.<br />\n<br />\ncONTEMPORARY<br />\nk-40MMENT<br />\nNothing is certain in philosophy, says Will Durant,<br />\ntherefore philosophers do not go to war.<br />\nA hot and furious tongue battle has been going on in<br />\nrecent weeks among such famed educators as John<br />\nDewey, Robert M. Hutchins, and that frequent visitor<br />\nin Alfred, Dixon Ryan Fox.<br />\nDewey calls Hutchins half-educated. Hutchins says<br />\nDewey can't read. Fox disparages the university which<br />\nHutchins heads. Late Monday Hutchins was still<br />\nmarshalling his forces for a counter-attack.<br />\nNow each of these men, since he influences a system<br />\nof education, is an educator; and since an eductional<br />\nsystem presupposes a philosophy, each may be assumed<br />\nto be a philosopher.<br />\nYet the vituperative word-war which we have noted<br />\nwould appear to be contrary to philosophical practice;<br />\nand the college student, who has an incomplete understanding of such matters, is hard pressed to find an<br />\nexplanation.<br />\nHe can scarcely be blamed for wondering if some of<br />\nthese educational philosophers have not permitted objctivity to be obscured by a much less praiseworthy<br />\ndesire for supremacy.<br />\nIf this be the case, then what has become of the<br />\nopen-mindedness which is supposed to keep philosophers<br />\nfrom one another's throats?<br />\nAnd if eminent educators are moved by selfish ambition to wrangle like undergraduates, whom are we to<br />\nregard as models?<br />\n—Alfred University Fiat Lux<br />\n<br />\nIf you get to sleep about as fast<br />\nas I do, you will be just about to take<br />\nthat first long exhilirating breath of<br />\nslumber when a hideous din breaks<br />\nout. The train has become a screaming, roaring monster.<br />\nThere are<br />\nscreams of laughter from the party<br />\nahead as the swains take advantage<br />\nof the momentary darkness. The<br />\ntrain has dodged into a tunnel. And<br />\nit isn't a short one either, it's the<br />\nlongest tunnel in this section, and<br />\nthat is just about long enough for the<br />\nsmoke to creep in and precipitate an<br />\nInch or so of soot on your new, white<br />\nwoolen parka.<br />\nYou realize that there really isn't<br />\nany place to get sleep on this train,<br />\nso you let the little man beside you<br />\ntalk. And if you don't think little<br />\nmen haven't a long family history,<br />\nand had twenty or so operations, just<br />\nstart the one beside you talking.<br />\nThe destination is about three hours<br />\naway so, before you know it, the car<br />\nis turned into bedlam again by dragging down the skiis to be waxed and<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nas<br />\n<br />\nFlagstad, Melchoir, List, et al will<br />\n<br />\nHEN Hollywood wants to film a scene requiring hundreds of \"extras,\" it makes a<br />\ntelephone call—and gets them.<br />\nThis is made possible by a central casting<br />\nbureau, whose amazingly fast service is based<br />\non systematic use of the telephone. This organization has a telephone switchboard where as many<br />\nas 30,000 calls a day are handled in bringing<br />\nactors and producers together.<br />\nAnother example of the value of telephone<br />\nservice to business and social America. It is the<br />\nconstant aim of Bell System men and women to<br />\nmake it ever more useKeep in closer touch with.<br />\nful—constantly better.<br />\n<br />\nW<br />\n<br />\nhome—by telephone.<br />\nRates to most points are<br />\nlowest after 7 P. M. and<br />\nall day Sunday.<br />\n<br />\nl)<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 19, 1937<br />\n<br />\n'ag-<br />\n<br />\n,rch<br />\nas<br />\nwill<br />\n<br />\nLieper Attacks Jay Debaters Tolle<br />\nFascism Before With MidwestTeams<br />\nSupper Club<br />\n<br />\niite<br />\n<br />\n.rch<br />\n<br />\nand<br />\nelli,<br />\nwill<br />\ntwo<br />\nLich<br />\nto<br />\n-eaex<br />\nisic<br />\n<br />\n; to<br />\nwn,<br />\ns a<br />\ners.<br />\nr.<br />\n<br />\nClaims No Place Exists For<br />\nReligion Under<br />\nDictatorship<br />\nFEARS RISE IN U. S.<br />\nRoosevelt's \"Well - Meant\"<br />\nMethods Cited As<br />\nOpening Wedge<br />\n\"The ideal of Fascism is the worship of a new idolatory—a worshiping of the thing created, not the one<br />\nwho creates. The Fascist dictator is<br />\na Caesar and a Messiah all rolled into<br />\none.\" Thus spoke Henry Smith Lieper at the Supper Club, Tuesday night<br />\nwhile addressing the members on<br />\n\"Fascism and Its Tendencies.\"<br />\nAccording to Dr. Lieper, who is<br />\nexecutive secretary to the Universal<br />\nChristian Council, the Fascist governments entirely repudiate the ideal of<br />\neverlasting peace, and teach instead<br />\nthe love and glory of war.<br />\n<br />\nvt<br />\n<br />\nWhy should<br />\n<br />\nwe<br />\n<br />\nbother<br />\n<br />\nwith<br />\n<br />\n• •<br />\n• •<br />\n<br />\na stood and wondered. Jimmy was will-<br />\n<br />\ncomet? It has nothing to do with the ing, however.<br />\nArthur Maass, Hammond Brown<br />\n\"On what?\" he asked.<br />\nand James Sfekas will represent the New Deal!\" A non-WPA dig by Harry<br />\nphysics<br />\nat<br />\nMountcastle,<br />\n\"Make a statement about Brown,\"<br />\nprofessor<br />\nof<br />\non<br />\nits<br />\nannual<br />\nspring<br />\nDebating Council<br />\ntrip next week.<br />\nsuggested the freshmen.<br />\nWestern Reserve University.<br />\nThe following is the schedule of de\"Oh, you can say anything you<br />\nbates:<br />\nWhen a buxom blonde at the Medi- want about Brown,\" smiled James J.<br />\nMonday—Carnegie Tech.<br />\ncal College of Virginia swing-hipped and departed.<br />\nTuesday—University of Akron.<br />\nInto the X-ray department, she imWednesday—University of Chicago. pressed the attendant as \"sort of Mae<br />\nCanton, N. Y. — (ACP) — Plump<br />\n<br />\nFriday—University of Cincinnatti. Westish.\" A second later he was alA tentative engagement has also most convinced.<br />\nbooked with the University of In\"Please sit down here,\" he said,<br />\ndiana on Thursday.<br />\npushing a chair toward her. \"Have<br />\nThe question to be debated is: Reyou ever been X-rayed before?\"<br />\nsolved, That Congress should be em\"No, handsome,\" she answered, fixpowered to regulate minimum wages<br />\nand maximum hours for industry. ing her hair prettily, \"but I've been<br />\nThe Hopkins will uphold the affirma- ultra-violated.\"<br />\ntive side against Carnegie Tech and<br />\nThey wanted to interview New<br />\nChicago and the negative side against<br />\nYork city's ex-mayor, Jimmy Walker<br />\nAkron and Cincinnati.<br />\ndid two Brown University freshWhy not<br />\nmen. So they posed as reporters and<br />\nstopped Walker and his wife, the<br />\nformer Betty Compson, as they were<br />\nleaving the hotel:<br />\nEtta/2MA<br />\n\"Are you Jimmy Walker?\"<br />\n<br />\nthis Summer?<br />\n<br />\nThe noted explorer has planned an exciting trip that You can Join at the end of<br />\nyour college term. Members of this 87 day<br />\n<br />\nNORTHLAND<br />\nEXPEDITION<br />\nwill tour Denmark, Norway. Sweden and<br />\nFinland; they will go to Iceland for 12<br />\ndays and then into the interior of Lapland<br />\nwhere they will live for 2 weeks in the<br />\ncamps of native Lapps. The expedition will<br />\nalso go into the new Runic Estonia and<br />\nLatvia. The culture of northern people,<br />\nwill be studied at their most interesting<br />\nsources, combining educational values<br />\nwith real adventure. Membership limited.<br />\nWrite for special booklet CD - I.<br />\n<br />\nNo Place For Religion<br />\nAs far as religion is concerned, Mr.<br />\nLieper stated that religion, other than<br />\nthat of nationalism, has no place in a<br />\nFascist government. He cited Germany as an example, where you are<br />\neither a German, Jew or Christian.<br />\n<br />\ngals at St. Lawrence University are<br />\n\"daily - dozening\" in old - fashioned<br />\nstyle to make the red-hand on the<br />\nscale tell less weighty truths.<br />\nKnee-bends and arm exercises are<br />\njust a few of the \"pound-dissolvers\"<br />\nincluded in this new course instituted<br />\nby<br />\n<br />\nMiss<br />\n<br />\nJean<br />\n<br />\nBell, head<br />\n<br />\nof<br />\n<br />\nthe<br />\n<br />\nwomen's physical education depart-<br />\n<br />\nYou can't wear your sheepskin!<br />\n<br />\nment.<br />\n\"The course,\" explains Miss Bell,<br />\n\"is designed to do away with foolish<br />\ndieting practices and provide a sane<br />\nmeans of reducing.\"<br />\nCambridge, Mass. — (ACP) — To<br />\n<br />\nhelp the alumnus to expand on the<br />\n\"Yes!\"<br />\nknowledge that earned him a degree,<br />\n\"We're from the Brown Daily HerHarvard University is preparing a<br />\nald,\" spouted the duo. \"We'd like an<br />\n\"hobby study\" plan.<br />\ninterview.\"<br />\nSo stated Dr. James B. Conant,<br />\n\"Okay,\" the ex-mayor answered.<br />\npresident of Harvard University in<br />\n\"Make a statement,\" the rookie re- his annual report to the board of<br />\nporters suggested, while the Walkers overseers.<br />\n<br />\nVILHJALMUR<br />\nSTEFANSSON<br />\n<br />\n\"Fascism is a changd form of the<br />\nState for the purpose of keeping order. It substitutes order for equality; work for fraternity, and sacri<br />\nflee and duty for liberty,\" he said.<br />\n<br />\n40.•••••••••<br />\n<br />\nYou seniors who are still on the drawing account<br />\nmight better begin now to stock up with several<br />\ndozen Arrows before you step out into the cold, cold<br />\nworld. Later on you'll thank us for the tip—and have<br />\nshirts aplenty, for Arrow shirts are made to stand<br />\nthe gaff. Be sure to see your Arrow dealer today.<br />\nTWO<br />\n<br />\nDOLLARS AND<br />\n<br />\nMitoga--tailored to fit<br />\n<br />\nMORE<br />\n<br />\nSanforized Shrunk<br />\n<br />\n41•••••••41,40.4111111<br />\n<br />\nWe Carry A Full Line Of<br />\nArrow Shirts And Collars<br />\n<br />\nMc Pherson'$<br />\n11 East Baltimore Street<br />\n<br />\nSEMINAR ON<br />\n<br />\nTurning to the American scene, the<br />\nspeaker discussed tendencies of Fascism in America. He felt that a great<br />\nRoosevelt's<br />\nPresident<br />\nof<br />\nmany<br />\nmethods open the way for Fascism.<br />\nHe expressed the opinion that Mr.<br />\nRoosevelt has no desire to attain such<br />\na goal, but that the precedents which<br />\nhe sets may be taken over in the future for other purposes, by other people in control of the nation.<br />\nAmong the factors in modern society, that Mr. Lieper feels are possibly leading to Fascism, are the concentration of power in the Federal<br />\nexecutive head, the growth of organizations such as the Khaki Shirts, the<br />\nTeachers Oath Movement and opposition to such movements as consumers' cooperatives on share crop region.<br />\nNext speaker at the Supper Club is<br />\nto be Dr. Arthur Holley Compton,<br />\nNobel Prize winner and University of<br />\nChicago physicist. The speaker is a<br />\nbrother of Karl Compton, who addressed last February's Commemoration Day exercise.<br />\n<br />\nIntercollegi ales<br />\n<br />\n3<br />\n<br />\nECONOMIC LIFE<br />\nIN EUROPE<br />\n<br />\nLeslie Howard<br />\n<br />\nProf. Broodos Mifcboll<br />\nof Johns Hopkins University will conduct<br />\na 49-day study tour of politico econoraie<br />\nconditions in England, Deomark, Swede.,<br />\nFinland, Soviet Union, Austria, Switzerland and France. The program Includes<br />\ndiscussions by outstanding leader, In economic thought In each of the countries<br />\nvielted. Sailing from New York July 34th,<br />\nreturning September 11th. Writs far modal booklet CD-2.<br />\nOther interesting tours andlable.<br />\nComplete rentce for individual<br />\ntravel—Europe, Mexico. U.S.S.R.<br />\n<br />\nEDUTRAVEL, Inc.<br />\nAn Inalltut• bps Educational Travel<br />\n$5 FIFTH AVENUE, NEW YORK. N. Y.<br />\nTelephones: GRaznercy 7-3184-3203<br />\n<br />\n717<br />\n<br />\n.4<br />\n<br />\n1PP<br />\n<br />\nsays Luckies are \"tops\" with<br />\nhis throat<br />\n<br />\n1?<br />\n<br />\n.21 Z,<br />\n<br />\n\"Years ago,as an ambitious young<br />\nactor,I was impressed how well my<br />\nthroat liked Luckies and how well<br />\nthey suited my idea of a perfect<br />\ncigarette. That impression still<br />\nstands.In myrecenttourof'Hamlet',<br />\nwith its many performances each<br />\nweek and the attendant tax on my<br />\nthroat,I have been convinced anew<br />\nthat this light smoke is both delightful to my taste and the 'top' cigarette for an actor's throat.\"<br />\n<br />\nLUSC/O'S<br />\nLocated at the North End Basement of<br />\nLevering Hall, for the convenience of the<br />\nstudent body and faculty.<br />\nHOURS-9 to 5 P.M.<br />\n<br />\nCAMPUS BARBER SHOP<br />\n<br />\nJoin The Pilgramage To<br />\nPlymouths<br />\nTHREE J. H. U. MEN LED THE PROCESSION<br />\nLAST WEEK<br />\n<br />\nAn independent survey was made recently<br />\namong professional men and women —lawyers,<br />\ndoctors,lecturers,scientists,etc.Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\nMr. Howard verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies —a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br />\n<br />\nHave You Seen<br />\nHOLT MAULSBY'S GRAY<br />\nBILLY ERLANGER'S BLACK<br />\nFRANK CRIST'S GREEN<br />\nCONVERTIBLE COUPES?<br />\n<br />\nThey Started The Pilgrimage To The<br />\n<br />\nAUTO CLINIC<br />\nCHRYSLER AND PLYMOUTH DEALERS<br />\n<br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\n<br />\n— AT —<br />\n309-19 Fallsway<br />\n<br />\nTHE FINEST TOBACCOS.\"THE CREAM OF THE CROP\"<br />\n<br />\n3414-18 Reisterstown Road<br />\n<br />\nJoin The Pilgrimage Now!<br />\n<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1037. The Amelia!) Tobacco Company<br />\nI<br />\nI<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MARCH 19, 1937<br />\n<br />\n4<br />\n<br />\nStickmen Drill Company C Takes Pi Lambda PhiFraternity Leads<br />\nFor Initial Tilt R.O.T.C.RifleMatch In Race For Turbyville Trophy<br />\nN.y• EdgpelaOcuetTCoomcpany 13; TAhird<br />\nWith C.0omp<br />\n-1<br />\n.<br />\n<br />\nTouch Tug of BasketFootball War<br />\nball<br />\n<br />\nGalloway Higl-y<br />\ni<br />\nMorrill Practices Jay Squad<br />\nFor Season Opener<br />\nApril 3<br />\nMANY VETERANS BACK<br />\nTeam To Hold Workouts<br />\nAll Through Spring<br />\nHoliday<br />\n<br />\nIn the annual rifle match held last<br />\nweek between the R. 0. T. C. companies, Company C edged out Company<br />\nB for top honors. Led by R. Brown,<br />\nCompany C shot 1,222 compared to<br />\n1,153 of Company B. Third place<br />\nhonors went to A Company over Company D by a one point advantage,<br />\n1,066 to 1,065.<br />\nAlthough his team failed to win.<br />\nC. Lindenmayer copped high score by<br />\nshooting 98 from the prone position,<br />\n96 kneeling and 78 standing for a<br />\ntotal of 272. Brown shot 99-85-80<br />\nfor 264 to place second in individual<br />\nachievement. H. H. Leber followed<br />\nwith a total of 248. Galloway placed<br />\neighth in total score, but his 86 in<br />\nthe kneeling position was high for the<br />\nmatch.<br />\n<br />\nUnfortunate<br />\nweather conditions<br />\nhave been a thorn in the side of Coach<br />\nKelso Morrill. For more than a week<br />\nthe lower field has been unsuitable<br />\nfor use and the band of lacrosse huskies has been compelled to train indoors.<br />\nWith the opening encounter of the<br />\nseason scheduled for April 3, the Jays<br />\nwill have to work under full pressure<br />\nCompany C—<br />\nin order to be well-conditioned. Dur99<br />\nG. Brown<br />\ning the Spring holiday there will be R.<br />\nJ. S. Baldwin<br />\n97<br />\nno lay-off for the stickmen. They<br />\n97<br />\nJ. Weber<br />\nwill indulge in afternoon practice ses- M.<br />\nA. H. Smith<br />\n94<br />\nsions including active scrimmage<br />\n95<br />\nM. J. Hartke<br />\nevery day. Coach Morrill expects his<br />\nTotal<br />\ncrew to be ready for C. C. N. Y. when<br />\nthey invade Homewood to start this Company —<br />\nyear's quest for lacrosse supremacy. C. E. Lindennaayer.. 98<br />\n98<br />\nMost outstanding of the newcomers J. R. Galloway<br />\nto report is Pasoan°, an all-scholastic S. H. Linthicum<br />\n89<br />\n90<br />\ngoalie. He should prove himself an J. H. Charles<br />\nable reserve for last year's stellar W. B. Gray<br />\n95<br />\ngoal keeper, George Kahl.<br />\nTotal<br />\nA long list of last season's perform- Company A—<br />\ners have been earnestly practicing<br />\nE. Mihalyk<br />\n92<br />\nand have shown a return to their old F. J. Taylor<br />\n93<br />\nform. Particularly Hammer Himes, J. F. Griffin<br />\n96<br />\nJackson Kaufman, Billy Kempton,<br />\n94<br />\nW. C. Schmied<br />\nTommy Dukehart, Johnny Ghinger,<br />\n76<br />\nC. E. Kerstetter<br />\nHerb Siegal, Johnny Beeler, Don Naylor and Captain Pete Swindell ap- • Total<br />\nCompany D—<br />\npear ready.<br />\n91<br />\nUp to date attention has been con- H. H. Leber<br />\ncentrated on stick-handling and pass- R. B. Stegamaier..._ 94<br />\n93<br />\ning. With the advent of daily out- S. R. Kramer<br />\n87<br />\ndoor scrimmages, more time will be D. C. Spencer<br />\n79<br />\ndevoted to teamwork and play for- F. L. Diehl<br />\nmations.<br />\n<br />\nTotal<br />\n<br />\n85<br />\n75<br />\n78<br />\n81<br />\n79<br />\n<br />\nPi Lambda Phi<br />\nDelta Upsilon<br />\nKappa Sigma<br />\nOmicron Kappa Omicron<br />\nAlpha Epsilon Pi<br />\nAlpha Delta Phi<br />\nTau Alpha Omega<br />\nPhi Epsilon Pi<br />\nPhi Alpha<br />\nPhi Gamma Delta<br />\nDelta Phi<br />\nSigma Phi Epsilon<br />\nPhi Kappa Psi<br />\nBeta Theta Pi<br />\nPhi Sigma Delta<br />\nTau Alpha Phi<br />\n<br />\n120<br />\n105<br />\n60<br />\n95<br />\n40<br />\n75<br />\n55<br />\n55<br />\n20<br />\n00<br />\n60<br />\n95<br />\n85<br />\n40<br />\n45<br />\n60<br />\n<br />\nCopping the touch football league,<br />\nplacing third in basketball, winning<br />\nvolley ball, and being a strong con•<br />\ntender in tug of war were the factors<br />\nwhich place Pi Lambda Phi with a<br />\ntotal of 345 points in the number one<br />\nposition for the Turbyville trophy.<br />\n<br />\n96<br />\n86<br />\n67<br />\n76<br />\n67<br />\n<br />\n80--264<br />\nDelta Upsilon, thirty-five points be71-243<br />\nhind is in the runner-up position. Be66-241<br />\nRides winning the tug of war, the<br />\n64-239<br />\nD. U. fraters placed second in foot61-235<br />\nball, fourth in basketball, and third<br />\n1222 In volley ball to amass 310 points,<br />\nNext in line is Kappa Sigma, victors<br />\n78-272 of court warfare. Omicron Kappa<br />\n54-238 Omicron a strong contender in all<br />\n62-218 sports ranks next with 245.<br />\n48-214<br />\nOnly softball is left on the frater49-211 nity schedule, and a victory by either<br />\n<br />\n81<br />\n71<br />\n73<br />\n44<br />\n55<br />\n<br />\n1153 Pi Lam or D. U. in the spring sport<br />\nwill give them this award.<br />\n73-246<br />\n63-227<br />\n37-206<br />\n67-205<br />\n51-182<br />\n<br />\nKIBLER'S<br />\n<br />\n1066<br />\n83<br />\n80<br />\n60<br />\n72<br />\n66<br />\n<br />\n74-248<br />\n52- -226<br />\n51-204<br />\n45--204<br />\n38-183<br />\n<br />\nJewelers and Opticians<br />\nPEN and PENCIL SETS<br />\n<br />\n3222 Greenmount Avenue<br />\n<br />\n10<br />\n25<br />\n10<br />\n00<br />\n10<br />\n00<br />\n10<br />\n10<br />\n00<br />\n00<br />\n10<br />\n00<br />\n00<br />\n00<br />\n00<br />\n00<br />\n<br />\n95<br />\n85<br />\n110<br />\n75<br />\n75<br />\n65<br />\n65<br />\n45<br />\n75<br />\n120<br />\n55<br />\n35<br />\n35<br />\n20<br />\n05<br />\n05<br />\n<br />\nVolleyball<br />\n<br />\nV<br />\n<br />\nTotal<br />\n<br />\n345<br />\n310<br />\n255<br />\n245<br />\n235<br />\n220<br />\n215.<br />\n195<br />\n190<br />\n190<br />\n185<br />\n175<br />\n145<br />\n85<br />\n70<br />\n65<br />\n<br />\n120<br />\n95<br />\n75<br />\n75<br />\n110<br />\n80<br />\n85<br />\n85<br />\n95<br />\n70<br />\n60<br />\n45<br />\n25<br />\n25<br />\n20<br />\n00<br />\n<br />\nIT'S SPRING<br />\nAGAIN<br />\nAnd high time for that<br />\nWHEN YOU BUY A015<br />\nROUND-TRIP TICKET<br />\nOn•-Way Cost of<br />\n<br />\nNEW<br />\nSCHLOSS<br />\nSUIT<br />\n<br />\nor<br />\n<br />\nFaro<br />\n<br />\nNew York<br />\n<br />\n$ 3.10<br />\n<br />\n$2.50<br />\n<br />\n11.95<br />\n<br />\n9.55<br />\n<br />\n.65<br />\n<br />\n.55<br />\n<br />\nCleveland<br />\n<br />\n7.25<br />\n<br />\n6.80<br />\n<br />\nBoston<br />\n<br />\n5.25<br />\n<br />\n4.20<br />\n<br />\nRichmond<br />\n<br />\n2,90<br />\n<br />\n2.35<br />\n<br />\nChicago<br />\n<br />\nTOPCOAT<br />\n<br />\nStop in for a try-on!<br />\n<br />\n$35 to $70<br />\n<br />\nReturn Trip<br />\n<br />\nWashington<br />\n<br />\nPittsburg<br />\n<br />\n5.25<br />\n<br />\n4.20<br />\n<br />\nPhiladelphia<br />\n<br />\n1.60<br />\n<br />\n1.30<br />\n<br />\nBE KIND and gentle to your pocketbook this vacation—buy a roundtrip Greyhound ticket? Save money going home—fares are lowest in history.<br />\nAnd save still more coming back —<br />\nthere's an extra 20% reduction on the<br />\nreturn portion of your ticket.<br />\nCampus Agent<br />\nM. L. KRIEGER<br />\nE.<br />\n<br />\n22 Dormitory<br />\n<br />\nPhone Chem 4912<br />\n<br />\nDistinguished Ready-to-wear<br />\n<br />\nJos. Schloss<br />\n& Son<br />\n<br />\n5 East Lexington St.<br />\n(nowhere elae)<br />\n<br />\nGREYHOUND BUS TERM.<br />\n<br />\nliv<br />\n<br />\nkn<br />\n<br />\nBuffalo<br />\n<br />\n6.50<br />\n<br />\n5.20<br />\n<br />\n217-221 W. Baltimore St.<br />\n<br />\nCincinnati<br />\n<br />\n8.55<br />\n<br />\n6.85<br />\n<br />\nPhone: Plaza 0520<br />\n<br />\nPr<br />\nJo<br />\nth<br />\n<br />\nGREY0cOUND<br />\n<br />\nfe<br />\nkit<br />\nga<br />\n<br />\n1065<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\nlas<br />\ntio<br />\nr.<br />\nHo<br />\ncot<br />\neat<br />\nthc<br />\nme<br />\n<br />\n\"it<br />\nthe<br />\nthe<br />\ndot<br />\nPr(<br />\n<br />\nprC<br />\n<br />\nly.<br />\narc<br />\ndin<br />\n<br />\nspa<br />\nto<br />\nshe<br />\nsag<br />\nan(<br />\n<br />\n.full measure ofeverything<br />\nyou want in a cigarette.<br />\nAt every stage. .. from tobacco<br />\nfarm to shipping room ... Chesterfield's job is to give you the refreshing mildness and delightful flavor<br />\nthat makes smoking a great pleasure.<br />\nExperienced buyers see that Chesterfield tobaccos are MILD and<br />\nRIPE... careful manufacturers<br />\nsee that they are blended to the<br />\nexact Chesterfieldformula.<br />\nAnd they see that the cigarettes are<br />\nmade right... round, firm, just right<br />\nto smoke.<br />\n...for the full measure of the<br />\ngood things you want in a cigarette<br />\nTon/a:CO CO.<br />\n<br />\nWC<br />\n<br />\n_I_<br />\nyou to enjoy ioteritetw.<br />\ninvitek_f<br />\n<br />\nIn ,<br />\nthe<br />\ncep<br />\ntha<br />\nlud<br />\ntior<br />\nthe<br />\ndis<br />\n<br />\nto<br />\nho<br />\nfro:<br />\ntior<br />\nto<br />\nVal<br />\n<br />\n0<br />\nday<br />\nlea<br />\n<br />\nwlx<br />\nam<br />\nbac<br />\nwiI<br />\nHoi<br />\nto<br />\nous<br />\ntle<br />\n<br />\nreti<br />\nnev<br />\nhe<br />\nany<br />\nnal.<br />\nthie<br />\ntint<br />\nof<br />\nthik<br />\nprir<br />\n<br />\n\f", "format": "basic_html", "processed": "PI LAMS LEAD<br />\nINTRAMURAL RACE<br />\n—Page 4, Column 3<br /><br />\nJii1nziqopitittg<br /><br />\nVOL. XLI, No. 32<br /><br />\nNrtuoirttrr<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 19, 1937<br /><br />\nEDITORIAL<br />\n\"The Coming Strike\"<br />\nPage 2<br /><br />\nPRICE 5 CENTS<br /><br />\nAnti-WarGroup SigeristCalisSpain's 0.K.0. Becomes Chapter Of Frank Crist Will Three Classes<br />\nWar 'Rebellion' In Alpha Chi Rho National Irat Represent Juniors<br />\nrows As Five Talk<br />\nBefore A.S.U. Thirty-Nine Former Omicron Kappa Omicron Members On June Committee Announce Plans<br />\nNew Bodies Join Medical School Professor<br />\nInitiated By Distinguished Group; Bowman<br />\nCrist Automatically Will Be To Hold Dances<br />\nIs Guest Of Honor<br /><br />\n(led<br />\nSt.<br />\nat<br />\nlay,<br /><br />\nnd'eat<br />\nthe<br />\nnen<br />\n.U.,<br />\nLice<br />\nirynia.<br /><br />\ninst<br />\n.ted<br />\none<br />\nbig<br />\ndethe<br />\nthis<br />\n5ely<br /><br />\nded<br />\nin<br />\nints<br /><br />\nIilt<br />\nrule<br />\nnce<br />\nime<br />\nthe<br />\nged<br />\ntrly<br /><br />\nStudent Council, Hullabaloo Sees World Fascist Drive<br />\nOn Democracy<br />\nODK, YCL And Phi Ep<br />\nAdded To List<br />\nExpresses Astonishment Over<br />\nSOUND OUT SOLONS Resistance Of \"Untrained\"<br />\nLoyalists<br />\nCommittee Hopes To Secure<br />\nA large crowd, which filled the LevPeace-Loving Congressman ering<br />\nHall parlor, heard Dr. Henry<br />\nFor Strike<br />\nE. Sigerist, Professor of History of<br /><br />\nChairman Of Next Year's<br />\nCommittee<br /><br />\nFreshman-Sophomore Dance<br />\nOn Sunday. March 14, with Insti- ton, Harrisburg and Wilmington were<br />\nTo Feature Johnson<br />\ntution ceremonies in Levering Hall, also entertained.<br />\nAt the dinner, Rev. James Hender- Seniors Favor Benny Goodthe Omicron Kappa Omicron fraterOn April 16th<br />\nson, Head Master of the Cathedral<br />\nman,Glen Gray, And Hal<br />\nnity, for eighteen years a local social<br />\nSchool of Washington and an Alpha<br />\nfraternity, joined the ranks of na- Chi Rho man of Trinity, presided as<br />\nKemp Orchestras<br />\nWOODEN APPOINTED<br />\ntional fraternities by becoming a toastmaster. Guest of Honor was<br />\nFrank Crist, '38: has been appointchapter of the Alpha Chi Rho broth- President Isaiah Bowman, who aded Junior Class Representative on Plan Small Prom Held In<br />\nerhood. Following a smoker at the dressed the visiting and newly instithe 1937 June Week Committee, it<br />\nOmicron Kappa Omicron house, at tuted Alpha Chi Rho men briefly.<br />\nConjunction With<br />\nwas announced yesterday. He will<br />\n2902 Guilford Avenue on Saturday Other speakers included L. W.<br />\nJune Week<br />\nautomatically become chairman of<br />\nMedicine at the Johns Hopkins Medi- night, ceremonies began at 9.00<br />\nSchaefer, Edward C. Bailly, and W. next year's Senior celebration.<br />\nBy \"G00-G0o\" KEmPToN<br />\ncal School, speaking yesterday under o'clock Sunday morning, and lasted<br />\nSix new campus organizations have<br />\nTickets for the joint FreshmanM. Walden of the National group, and<br />\nCrist, who is a member of the Phi<br />\nthe auspices of the American Student until 4:30 Sunday afternoon, with an<br />\nsignified their intention of taking a<br />\nChas. C. Dorsey, Dan E. Klein and Kappa Psi Fraternity, was recently Sophomore Class Dance went on sale<br />\nUnnion, in a sweeping defense of the hour's recess for a buffet luncheon at<br />\nWit Wednesday, as another class, the<br />\npart in the annual Hopkins Student<br />\nJ. E. Bauernschmidt of the newly in- elected business manager of<br />\nthe<br />\ngovernment cause in Spain.<br />\nthe Chapter House. Following the stituted group.<br />\nStrike against War, it was announced<br />\nBarnstormers and was at one time, juniors, began preparations for one<br />\nIn his lecture, \"Spain-1937,\" Dr. Institution ceremonies, the day was<br />\nof its own. The lower classes began<br />\nafter the second meeting of the<br />\nThe Alpha Chi Rho Fraternity was secretary of his class. Crist's<br />\napin a flurry of posters and annouceStrike Committee yesterday. The lat- Sigerist who is associated with the climaxed by a dinner also held in founded in 1895 at Trinity College, pointment complete the<br />\npersonnel<br />\nof<br />\nHartford. Conn. Its membership the June Week Committee,<br />\nest additions to the list of partici- North American Committee for the Lovering Hall.<br />\nwhich is ments; the juniors, mildly, by anDemocracy,<br />\nSpanish<br />\nof<br />\nAid<br />\ndeclared<br />\nThirty-nine former Omicron Kappa consists of twenty active Chapters, headed by James Bradford.<br />\npants swelled the Committee's total<br />\nnouncing the appointment of a dance<br />\nto nine, as the NEWS-LETTER, the \"The present conflict in Spain is not Omicron members were initiated, located mostly in the East, made up<br />\n\"The response to our financial cam- committee.<br />\nYMCA, and the American Student a Civil War but an open rebellion. On fourteen of which were active chap- of a membership of 5100 men. The paign has been very gratifying,<br />\nJohnson Booked<br />\nbut<br />\none side there is the people of Spain, ter members, the remainder being Omicron Kappa Omicron Fraternity,<br />\nUnion had already joined.<br />\nour goal is far from being attained,\"<br />\nBubby Johnson and his orchestra<br />\nwhile<br />\nthere<br />\nother<br />\nthe<br />\nis<br />\non<br />\nthe<br />\nmiliOKO Alumni. Louis W. Schaefer, founded on the Hopkins campus in said Bradford. \"Many<br />\nCouncil Head Present<br />\nof the Seniors are to be the feature attraction at the<br />\nPresent at yesterday's meeting tary clique supported by foreign pow- National President of the Fraternity 1919, was composed of members of have not handed in their<br />\npromissary Freshman-Sophomore dance in the<br />\nmen.<br />\nforeign<br />\nThis<br />\nwith<br />\ners<br />\nis<br />\nbut<br />\na of Alpha Chi Rho, presided at the the Hopkins only. Students of the<br />\nwere: Moses B. Macht, of the Denotes yet, and a definite June Week Maryland Casualty<br />\nClubrooms, next<br />\nbating Council; Gerald Branower, of part of the world offensive of Fascism Institution ceremonies and was as- Hopkins and members of Omicron program cannot be<br />\narranged until a April 16th. The price has been<br />\nset<br />\nsisted by Sydney Pinney, National Kappa Omicron who were instituted greater<br />\nPhi Epsilon Pi; Stanley M. Finkel, of versus Democracy.\"<br />\nnumber of fees have been at $1.25. Harry M. Hopkins<br />\nand<br />\nDr.<br />\nSigerist traced the decline of Vice President Wilbur M. Walden, into the national fraternity are Ferd- paid.\"<br />\nthe NEWS-LETTER; Hershner Cross,<br />\nTheodore Reese head the Sophomore<br />\nPresident of the Student Council; Spain's economic situation until at National Secretary Ormand Milton, inand Hahn, George Frederick, Ralph<br />\nThe plan of the committee is to levy Committee, and Jefferson<br />\nHamilton,<br />\nHenry Kramer of the Hullabaloo; the present time it is a semi-feudal National Treasurer Rex Thompson, Goudy, George Thaler, John Sullivan, a monetary penalty<br />\nof one dollar to the Freshman.<br />\nWalter Schlesinger, of the Hopkins society with the landed aristocracy National Councillor; Professor Carl- Lawrence Hanawalt, Victor Ghent, the original cost of<br />\na June Week<br />\nDonald Wooden, a member of the<br />\nBranch of the Young Communist's as the ruling class. When the re- ton Huntley Hayes, Past National Henry Leber. Boyd Wylie, Arthur ticket if the fele<br />\nis not paid by March Cotillion Board,<br />\nwill head the ComLeague; and Theodore Graziano, of bellion broke out, Spain was in the President; J. Edward Fagen, and a Rossberg, Roy Hartman, J. Masopust, 31st. After April<br />\n15th an additional mittee in charge<br />\nof this year's Junior<br />\nmidst of a revolutionary cycle which large group of resident and out-of- William Jenkins and J. Edward<br />\nOmicron Delta Kappa.<br />\nfine will be added. Payments can be Prom,<br />\nEdward Clautice, junior presPlans for expanding the Commit- began in 1931 with the abdication of town Alpha Chi Rho members. Over Bauernschmidt.<br />\nmade to committeemen, who may be ident,<br />\nannounced Wednesday. Other<br />\ntee's scope filled a major share of the Alphonso. At that time the Spanish the week end, the Omicron Kappa<br />\nOfficers of the newly instituted found in the main lobby<br />\nof Levering members- of the<br />\ncommittee include<br />\nmeeting time. It was decided to is- aristocracy, it was claimed, sacrificed Omicron men were hosts to guests chapter were immediately elected Hall on March<br />\n29, 30 and 31 from Arthur Savage,<br />\nIrvin Lefstein, Frank<br />\nsue a second appeal for representa- their monarch for more privileges. from Trinity College, Dickinson, Uni- and J. E. Bauernschmidt, Thaler, 12:00 to 1:00<br />\np.m. and 4:00 to 5:00 Ohristoffell,<br />\nGeorge Weigand, Seytives of other campus organizations Gradually, the people fell into more versity of Pennsylvania, Lehigh, Rut- Hahn, Wylie, Sullivan, Hanawalt, p.m.<br />\nmour Roma.novsky, and William<br />\nto attend a meeting set for Monday' dire straits with the aristocracy gers and Lafayette. Alpha Chi Rho Goudy, and Leber were elected to re\"It is imperative that payment be<br />\nKempton.<br />\nopenly defying the government's min- Alumni Clubs of Baltimore, Washing- sponsible positions.<br />\nApril 29th.<br />\nmade by March 31st,\" Bradford dewage<br />\nimum<br />\nlaws<br />\nmeasures<br />\nand<br />\nuntil<br />\nSmall Dance Planned<br />\nCongressmen Hoped For<br />\nclared. \"Our option on the Main Ball<br />\npeople<br />\norganized<br />\nthe<br />\ninto<br />\nPoputhe<br />\nAt<br />\npresent,<br />\nEfforts to contact Congressional<br />\nsaid Clautice, the junRoom of the Alcazar will expire if<br />\nleaders to head the list of speakers lar Front Party.<br />\nwe do not take some action by April iors are booked for a small dance to<br />\nbe held in conjunction with June<br />\nThe war itself is conducted by this<br />\nat the strike began immediately af1st.\"<br />\nter the meeting. Those tentatively in- People Front Party which, like the<br />\nThe Annapolis Roads Club is being Week. The great names, which have<br />\nvited are Rep. Maury A. Maverick, party in France, is a combination of<br />\ncontacted to provide the scene for the adorned the bandstand at previous<br />\nTexas liberal; Rep. Ernest Bernard, many. Thus, Spain cannot give clear<br />\nannual beach party that has been Junior Proms, will not be called on<br />\nthe Minnesota Farmer-Laborite, who concise decisions because of its multi- Marburg Contribution Forms Seek 2 Scientists For Pro- part of the Spring activities in for- this year.<br />\ncast the lone vote against the present partied government.<br />\nmer years. Because of complaints<br />\n\"This is to be a junior dance, run<br />\nLatest Addition To<br />\njected Trip Into Arizona from<br />\nembargo on shipments of arms to<br />\nmen who said that \"fees were by juniors,\" said Clautice.\" The<br />\nIn describing the conditions in the<br />\nHopkins Group<br />\nSpain; Congressman Sam McRey- war, Dr. Sigerist stressed the fact<br />\nAnd Utah<br />\nslapped on them from all sides\" ad committee is doing its best at this<br />\nnolds of Texas, co-author of the ad- that in the beginning of the rebellion<br />\nlast year's beach party, an attempt is time to secure a good band at a<br />\nTwo men from Johns Hopkins Uni- being made to absorb the 'Usual locker small price.\"<br />\nministration Neutrality Bill now be- the Loyalists had practically no<br />\nThe new Johns Hopkins Club will<br />\nfore the House; Rep. David L. Lewis, trained men whatsoever.<br />\n\"It is be opened Thursday evening, April versity may be selected as members fee into the price of the June Week<br />\nSophomores serving on the -jo<br />\n-trit<br />\nWestern Maryland Democrat; Sen. astounding,\" he said, \"that Madrid 1st, at a reception and housewarm- of<br />\nthe scientific expedition now being ticket.<br />\ncommittee are: Frank Parker, WilGerald P. Nye, North Dakota muni- has resisted the Rebel army so long, ing, given by the Club to members<br />\nBradford refused to commit himself liam<br />\nLamble, William<br />\norganized for the exploration of the<br />\nMehling,<br />\ntions prober; and Maryland's two for when the Italian and German of the University Alumni. The Clubin naming the orchestras which would Charles Graw, Nelson<br />\nLloyd, Robert<br />\nMillard<br />\nTydings<br />\nSenators,<br />\nand troops advanced against her, she house has been completed through northern Navajo country in Arizona probably be contracted by the comAnderson, Charles McShane, and<br />\nGeorge W. Radcliffe.<br />\ndidn't even have sufficient guns for the aid of Mr. Theodore Marburg and Utah this summer. The men may mittee. Bands in the past have set a John Kilbourne. The<br />\nfreshmen inand Miss Amelia Marburg, as a be students or instructors and must high standard in entertainment. clude John<br />\nall her men.\"<br />\nChurch Speaker Planned<br />\nHall, Hal Jaffee, Ernest<br />\nmemorial<br />\nWilliam<br />\nMarburg,<br />\nA.<br />\nBenny<br />\nto<br />\nThe program is also to include a<br />\nGoodman and Jimmy Lunce- Keiney, Joe Zavertnick,<br />\nbe interested in engineering, archaeDr. Sigerist also revealed the fact<br />\nJohn Herford were engaged for last year's bert, and Edwin<br />\nspeaker from the YMCA, one from that Italy was in touch with Franco and Charles L. Marburg. The buildi- ology,<br />\ngeology, or in the biological<br />\nLowthian.<br />\nJune Week. Ray Noble and Hal<br />\nthe Student Union, and a representa- before the actual rebellion broke out ng forms the latest addition to the<br />\nIn announcing the opening of<br />\nsciences—or in the management of a<br />\nKemp, in 1935. The sentiment of ticket sales<br />\ntive of Baltimore Church Groups. and that the crash of an Italian bomb- group of buildings at Homewood.<br />\nHopkins, as general<br />\nscientific expedition, it was learned the Seniors, this year, seems to favor<br />\nPlans are going forward to secure an er in France before the war points<br />\nThe Johns Hopkins Club, comchairman of the committee, called<br />\nunofficial representative of the Uni- to the immense aid received by the posed of faculty, administrative of- this week through an announcement Benny Goodman, Glen Gray Will Os- for cooperation<br />\nbetween the two<br />\nversity R.O.T.C. The strike is to be rebels before the war. The attitude ficers of both the University and the by Dr. Charles Del Norte Winning, borne and Hal Kemp.<br />\nclasses for a successful dance.<br />\nheld outdoors.<br />\nof the neutral countries is especially Hospital, graduate students, and field director of the Rainbow Bridge\"This is one time,\" he said, \"when<br />\nNationally the strike is sponsored harmful to the Loyalists for it Alumni, will take over the operafreshmen and sophomores bury the<br />\nMounment Valley Expedition.<br />\nby the United Student Peace Commit- amounts to a boycott against Spain. tion and care of the new club-house,<br />\nhatchet. Let's all do our best to make<br />\nThe expedition is to explore, map,<br />\ntee. This makes the fourth year that<br />\nit a happy funeral.\"<br />\nIn the summer of last year France and its use will be restricted to<br />\nthe demonstration has been held at the<br />\nand study an area of some 3,000<br />\nhad an opportunity to aid the Loyal- members and their guests. New<br />\nHopkins. Its career began stormily<br />\nists and nip the revolt in the bud but members to the club may be elected square miles in a remote region that Kirkley, \"Sun\" Critic, Evaluates<br />\nWhen embattled R.O.T.C. members<br />\nPoet At Playshop<br />\nwas warned by England that if Ger- through a board of control, after Is probably farther from a railroad<br />\nturned a hose on a faculty speaker.<br />\nDiscussion<br />\nmany attacked her she would not be receiving endorsements of two mem- than any other point in the United<br />\nIn 1935 it was coupled with a proaided by Great Britain. \"England,\" bers. It is planned to keep the Club States. Penetrating<br />\nas far as posDisregarding the weather conditest against the pending Teachers'<br />\nsaid Sigerist, \"is officially for the open for eleven months each year, durtions<br />\nlast Tuesday night, a good-sized Dr. Krantz Addresses American<br />\nfield<br />\nOath Bill. Last year's strike was<br />\nmotor,<br />\nsible<br />\nparty<br />\nby<br />\nthe<br />\nwill<br />\nrebels, for the English Cabinet wishes ing which period meals will be servChemical Society On Past<br />\ncrowd turned out to hear Donald<br />\nconsidered the most peaceful and orequipment<br />\nby<br />\npack<br />\nthen<br />\ntrain<br />\nmove<br />\nnominal<br />\nat<br />\ned<br />\nprices,<br />\nwith<br />\nspecial<br />\nto protect English investments and<br />\nKirkley,<br />\nwell-known<br />\nderly in history.<br />\ntheatrical<br />\nDevelopments<br />\ncritic<br />\nwhen the war is over, loan money to arrangements available for parties up winding canyons out into Rainbow<br />\nof the Sun paper in this city, discuss<br />\nhead<br />\nthe<br />\nPlateau.<br />\nbanquets.<br />\nof<br />\nNear<br />\nthe<br />\nor<br />\nDogoFranco.\"<br />\nDr. J. C. Krantz Jr., professor of<br />\nthe career of the popular playwright,<br />\nThe clubhouse itself, located in a szhi Biko, base camp will be estabMaxwell Anderson.<br />\npharmacology at the School of Medifrom<br />\nthis<br />\nlished,<br />\npoint<br />\nand<br />\nscouting<br />\nsecluded corner of the campus, behind<br />\nShakespearean Authority<br />\nMr. Kirkley spoke on the various cine, University of Maryland will<br />\nthe botanical gardens, is of Georgian parties and scientific workers will<br />\nplays<br />\nwritten by this author, includ- speak at a meeting of the Maryland<br />\nTo Address Literary Club architecture, and harmonizes com- push on afoot.<br />\ning his present work now showing in section of the American Chemical<br />\npletely with the rest of the HofnePanted Gynecologist Will Speak On<br />\nNew York, entitled \"High Tor.\" Society tonight at 8:15 in room 101<br />\nMr. Henry M. Paul, Philadelphia wood group. Considered ideally arReligion At Meeting To Be<br />\nThroughout his lecture his personal Remsen Hall on the subject of \"ChemShakespearean<br />\nauthority<br />\naddress<br />\nwill<br />\nranged for its purpose, it is said to be<br />\nHeld In Levering<br />\nopinion was expressed in regard to istry in Medicine.\"<br />\nthe Tudor and Stuart Club on \"The one of the finest such club buildings<br />\nAnderson's plays. Kirkley stated<br />\nThe talk will deal with anesthesia,<br />\nPictures<br />\nEarliest<br />\nof<br />\nthe Plays of in the country. There are spacious<br />\nDr. Howard A. Kelly, one of the<br />\nthat Maxwell Anderson is not as analgesia, antiseptics, sympathetic<br />\nShakespeare,<br />\nHow<br />\nor<br />\nTudor<br />\nPlays<br />\ndining rooms, lounges, game rooms<br />\nfounders of the Hopkins Medical<br />\nWith last year's victorious schedule great a poet as hd is a playwright. stimulation, insulin, and the<br />\noutlook<br />\nSchool, and world famous gynecolo- were Adapted to the Stage of the and reading rooms. There are re- in mind, the golf team is not only aimconcluded his talk by declaring that for future development.<br />\ntonight<br />\n8:15<br />\nat<br />\nStuarts,\"<br />\nin<br />\nthe<br />\nClub<br />\nfreshment rooms, locker rooms and ing to repeat last year's results, but<br />\ngist, will lead the discussion this<br />\nDr. Krantz, born in 1899 in Balti\"High Tor,\" now running on Broadshowers. One wing is to be reserved do better. Last year the team won<br />\nafternoon at the Fireside sessions at Rooms.<br />\nway, is the best play Anderson has more, was graduated from the Unibeen<br />\nMembers<br />\nasked<br />\nhave<br />\nto<br />\narrive<br />\nfor the use of women members.<br />\nLevering Hall at 4:15 p.m.<br />\nsix out of ten against much stiffer ever written.<br />\nversity of Maryland School of PharThe subject to be discussed is: on time inasmuch as the talk will be<br />\nDues for the club are fixed at $10 competition than they experienced<br />\nmacy in 1919. He took his Ph. D.<br />\nSkits Presented<br />\nillustrated.<br />\n\"How My Religion has Helped Me<br />\nper year for a resident membership, during their first year when they<br />\nFollowing the<br />\nKirkley lecture degree from the same school in 1928.<br />\nto Fulfill My Desires.\" The group is<br />\nand it is planned to suspend the ini- turned in an undefeated record.<br />\nfour skits were presented by students He was associate professor of pharlimited to 20 students and those ex- Sigerist Speaks Tonight tion fee for all applications received<br />\nThe prospects of this year's team of the University. The first entitled macy from 1921-1926 and<br />\nprofessor<br />\nPecting to attend must sign up at<br />\nbefore May 31, 1937. The Johns Hop- looks very promising with all of the \"Elizabeth, The Queen,\" by Maxwell from 1926-1927. He<br />\nleft the Unionce. Lists are posted in Levering<br />\nDr. Henry E. Sigerist, Professor of kins Club has been in existence fiQr boys back, together with the new- Anderson, was given<br />\nby Elizabeth versity of Maryland in 1927 to direct<br />\n'tall and at the post office.<br />\nthe History of Medicine at Johns Hop- several years, and, with the acquisi- comers, Ted Schad, Johnny Soule Roberts and Ted<br />\nGeorge. Helen Polia- the Pharmaceutical Research at<br />\nAt the Fireside meeting last Tues- kins University, will be the guest tion of larger facilities, wishes to and Allan Pinkerton. The team's koff and<br />\nMartin Rude did a scene from Sharpe and Dohnie. He left this post<br />\nday afternoon Dr. Albert Blumberg speaker tonight before a meeting of make its membership available to a schedule for this year includes nine<br />\n\"Saturday's Children.\" Patty Singe- in 1930 to become chief chemist of<br />\nled a discussion on \"The Place of the University of Maryland Medical larger number of eligible Alumni and matches, four at home and five away. wald<br />\nand Russell Magill, presented the Maryland State Health DepartReligion in Modern Society.\" The Forum. His address, \"Medical His- faculty members. Applications for<br />\nThe team will again have as its a scene from \"Winterset.\" Dolly Ash- ment. In 1932, he left that<br />\npost to<br />\ndiscussion was said to be very lively, tory in the Making,\" will be delivered membership should be mailed to Dr. home course this year the Rodgers<br />\nley closed the evening's entertainment take the position he now holds.<br />\nand the group did not adjourn until in the Gordon Wilson Memorial Hall W. B. Kouwenhoven, Secretary of the Forge Golf and Country Club at Towwith a sketch from \"The Wingless<br />\nRefreshments will be served after<br />\nafter 6:30 p.m.<br />\nof the University Hospital at 8:15.<br />\nClub.<br />\nson.<br />\nVictory.<br />\nthe meeting.<br /><br />\nNew University Club Navajo Explorers<br />\nTo Open On April 1 May Pick,J.H.U.Men<br /><br />\nRanks 'High Tor'As<br />\nBest Anderson Work<br /><br />\nMedicinal Chemistry<br />\nSubject Of Address<br /><br />\nDr. Kelly Addresses<br />\nFireside Chat Today<br /><br />\nLinksmen Hopeful<br />\nOf Banner Season<br /><br />\nt<br /><br />\n\\1<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 19, 1937<br /><br />\n2<br /><br />\nbe<br /><br />\n3obn5 ji)ophinti<br /><br />\nA New Angle<br /><br />\nA minor angle on the matter of gate receipts is<br />\nanother worry which the Hopkins athletic office will<br />\nnever have to contend with. This is the question of a<br />\nFederal tax on admissions to athletic contests.<br />\nWe are in receipt of a dispatch from the Associated<br />\nCollegiate Press stating:<br />\n\"The Bureau of Internal Revenue has requested the<br />\nDepartment of Justice to enter suits against the Uni$2.00<br />\nSubscription per year<br />\n$2.50<br />\nBy Mail<br />\nversity of Georgia, the University of Iowa, the University of Michigan, the University of Minnesota, and<br />\nthe Georgia School of Technology.<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\n\"Several suits have already been instituted and the<br />\nRemsen Hall, Postotlice, Johns Hopkins University.<br />\nfirst round in one case was won down in Atlanta last<br />\nDecember when a Federal judge ruled with the<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\ncolleges.\"<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nThus the government, among other factors, is cutmoney collected at games. We will be<br />\nPublished semi-weekly from October to June, except during exam- ting into the<br />\nination and college holiday periods by undergraduates of the Johns spared any contention or concern over what is conHopkins University.<br />\nsidered a real symbol and definite part of commercialism in collegiate sports.<br />\nMaybe we did not make such a bad move after all.<br />\nEDITORIAL STAFF<br /><br />\netuz<br /><br />\nLetter<br /><br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nManaging Editors<br />\nJames Morrow, David Caplan<br />\nSports Editor<br />\nBernard D. Pinck<br />\nAssistant Mangaing Editors<br />\nBenjamin Root, Wethered Barron, Jr<br />\nAssistant Sports Editor<br />\nHarold Zheutlim<br />\nColumnist<br />\nPaul Berge<br />\nReporters—Max Islcowitz, Nathaniel Finkelstein, Jewett gGoldsmith,<br />\nHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger,<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal,<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William Burford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nSamovitz, Scymore Sacks, Irving Millberg, Milton Alperstein,<br />\nZenas Baum.<br />\nBUSINESS STAFF<br />\nBusiness<br />\nAssistant Business<br />\nAdvertising<br />\nCirculation<br />\nOffice<br />\nCopy and Filing<br /><br />\nWilliam B. Kempton<br />\nMelville Locker<br />\nWm. C. Erlanger<br />\nGerald Witten<br />\nHoward Linkoff<br />\nNathaniel Soifer<br /><br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br />\nManager<br /><br />\nRSP*I$ENTCO FOR NATIONAL ADVSRTISING ST<br /><br />\nNational Advertising Service, Inc.<br />\nCollege Publishers Representative<br />\nNEW YORK. N.Y.<br /><br />\n420 MADISON AVE.<br />\nc ic • 00<br /><br />\ntg36<br /><br />\n.<br /><br />\nRG5T01•1<br /><br />\n. SAN FRANCISCO<br />\nANC<br />\nSEATTLE<br />\n•<br /><br />\nMember<br /><br />\n1937<br /><br />\nRssociated Collegiale Press<br />\nDistributors of<br /><br />\nColeesiale Difseit<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nFRIDAY, MARCH 19, 1937<br /><br />\nThe Coming Strike<br />\nWhile plans are being drawn up for this year's<br />\nstrike against war, it is essential that all campus organizations meet, discuss their possible participation, and<br />\nchoose a delegate for the next meeting on the Monday<br />\nwhen we return to school at 12.20 in Levering Hall<br />\nBoard Room.<br />\nWe, supporting this strike, wish to make the basis<br />\nof this demonstration as broad as possible and to enlist<br />\nthe backing of every group affiliated with the Hopkins.<br />\nThis will be a strike that is general, and we hope effective, manifestation of student sentiment against war.<br /><br />\n\"Teaching is not a one-club game. The teacher who<br />\nuses only a single technique is no further along than<br />\niv the golfer who plays the entire course with a single<br />\nclub.\" Prof. Guy M. Wilson of Boston University's<br />\nof education recommends diversity of technique minus<br />\nthe clubs.<br /><br />\nNew York Alumni Spirit<br />\nThe Musical Club's trip to New York uncovered an<br />\nelement which many Hopkins students have thought<br />\ndormant, that of an alumnus school spirit. Sponsored<br />\nby the Hopkins club of New York City, the concert was<br />\na huge success due to the efforts of that organization,<br />\nand the audience, largely of Hopkins graduates, was<br />\nthe most genial and enthusiastic that the club encountered in its entire season. The alumni organization arranged to put the musical group up at the<br />\nWarwick Hotel, the scene of the concert.<br />\nThe whole affair showed a living spirit in the Hopkins on the part of those residents of New York who<br />\nhave left Hopkins halls and who retain memories of<br />\nthe days spent here, and wanted to show it in a way<br />\nthat would touch personally the undergraduates of<br />\ntoday.<br />\nSo congenial was the relationship struck up between<br />\nthe alumni and undergraduates, and so successful was<br />\nthe concert itself, that assurance was given the affair<br />\nwould be repeated in years to come.<br /><br />\nAn Important Struggle<br />\nDr. Sigerist's talk on Spain brought to light some<br />\nphases of the situation that most of us are inclined to<br />\nomit in judging the situation.<br />\nIn the first place to clearly appreciate the recent<br />\nevents one must study the history of Spain for centuries<br />\nback and the series of development w'hich led to the<br />\npeculiar position of Spain today. This background was<br />\nsketched admirably by the speaker.<br />\nAnother piece of information little realized are the<br />\nremarkable cultural advances made by the government<br />\nIn spite of the bloody conflict within such proximity.<br />\nThe special batallion appointed by the government is<br />\nendeavoring to save works of art and protect nonfighting men of learning and art. Exhibits and new<br />\ntheaters are being formed. Over twenty-five thousand<br />\nstudents are now being trained for the teaching profession in the normal schools demonstrating the clear<br />\nfaith and confidence the people of Spain possess in the<br />\ndemocratic<br />\nfuture success of their duly-elected<br /><br />\nWith this in mind, we feel certain that the wide<br />\nbackbone of the strike is broad enough to include all<br />\nshades of opinion on this matter. We want a large,<br />\nall-inclusive crowd of students backing the demon- government.<br />\nstration; it must be necessarily so to insure a successWe students should be concerned with what is going<br />\nful and convincing mass protest against war.<br />\non in Spain. Students just like ourselves are fighting<br />\nWhile war rages in bloody Spain, while the memory to make their homes a decent place to live in—to crush<br />\nof the Ethiopian and Chinese aggressions are fresh in a rebellion of what a foreign correspondent called a<br />\nour minds, while the horrors of the World War and the few days ago \"professional killers.\"<br />\nsobering, shocking truths of what we were actually<br />\nIt is appropriate at this time when America is makfighting for are known to us, we must not stand idle ing up her mind on her position to learn from the<br />\nin apparently peaceful times. We must realize that experience of other countries. Spain is now fighting in<br />\nostriching ourselves with \"neutrality\" legislation gives the same battle which the peoples of Germany and<br />\nus an all-too-false sense of security.<br />\nItaly lost—to have the forces of Fascism turn back<br />\nIt is up to us to<br />\nWhat is apparent to us is that to combat the twin the clock of civilization and progress.<br />\nof war and<br />\nmenaces<br />\nthe<br />\ncombat<br />\nand<br />\nlesson<br />\nour<br />\nlearn<br />\nWar<br />\nand<br />\nFascism<br />\nof<br />\nevils<br />\n(or should we say single)<br />\nprovent a conflict before it arises.<br />\nunited action is necessary.<br />\nThis strike against war is a means of deminstrating to the world just how the most potential cannon<br />\nfodder feels about ending our lives in some unmarked<br />\ngrave, about living physically and mentally shellshocked or gassed. We may differ as to the solution to<br />\nthe problem of war; but that we all oppose this devastating and damnable threat to civilization, we all<br />\nagree.<br />\nAnd that is why we should all support this strike.<br />\n\"The college, as a producer of adults, should shift<br />\nemphasis from future values to the significance of<br />\npresent experiences. The terrible discount on present<br />\nvalues is akin to the evils of hoarding. Life in college<br />\nis as real as life anywhere.\" Pres. Henry M. Wriston of<br />\nBrown University asks student to \"Wake Up And<br />\nLive\" in the present.<br /><br />\nA Matter Of Honor<br />\nOur attention has been called to the unauthorized<br />\nwearing of Hopkins athletic letters by a few students<br />\non the campus.<br />\nThese students should recognize and respect the<br />\nInsignia of the University and realize that only those<br />\nwho have earned and who were awarded these honors<br />\nshould b entitled to wear them. It is not only violating<br />\nthe letter of Athletic Association (a student organization) but the spirit and honor of the Hopkins Athletic<br />\nsystem.<br />\nThis matter is also part and parcel of the honor system, guarded by the Student Council. Any student who<br />\nwears an athletic award he did not earn is cheating<br />\nand lowering the dignity of those entitled to these<br />\nhonors.<br />\nWe feel certain that the few men we have in mind<br />\ndo not comprehend the true significance of their actions;<br />\nwe hope that they reflect on this matter and act<br />\naccordingly.<br /><br />\nUNIVERSITY<br />\nSo you're going on a snow train<br /><br />\nQUARTER NOTES<br />\nMusic's muse came to Baltimore of a series of two will fature Wagner's Lohengrin on Monday, March<br /><br />\n(You're going whether you want to this week. She offers a varied proor not, I racked my brains for an hour gram with four highlights. The first<br />\nfor this.) The first thing you do is took place Tuesday at the Lyric Theato get a large comfortable revolver. ter. At that time the one and only<br />\nNow, when you have collected your<br />\nPaul Whiteman lead the National<br />\nskiis, poles, wax, knapsack, boots, ski<br />\nSymphony Orchestra in a program of<br />\ntips and your camera the night before<br />\nDeems<br />\nmodern American music.<br />\nand put them in a pile in the middle<br />\nTaylor, a composer himself, was the<br />\nof the room, you can go to bed. Not<br />\noral program annotators. Among the<br />\nfor long of course, because skiing<br />\nfeatured artists were Casper Reardon,<br />\nequipment has a nasty habit of stealthe harpist, The King's Men Quaring away in the night and not coming<br />\ntette and Roy Bargy, the pianist.<br />\nback. So, every three-quarters of an<br />\nTwo weeks later, on Tuesday,<br />\nhour, you creep out of bed and sud30th, the great Roritz RosenMarch<br />\ndenly flash on the light to see whether<br />\nthal will be the soloist with the Namay<br />\nyou<br />\nluck,<br />\nyou're<br />\nif<br />\nthere,<br />\nall<br />\nit's<br />\ntional Symphony. He is the last of<br />\nsee the knapsack about halfway to<br />\nthe<br />\nPrinces of the Piano. The grand<br />\nthe door, and if you miss it, God<br />\nschool of Liszt and von Bulow finds<br />\nknows it won't be there in the mornits last counterpart in the aged but<br />\ning.<br />\nunbent figure of this eversensational<br />\nA little (and that's putting it mild- virtuoso. Here is a musical event of<br />\nly) bleary-eyed you roll out of bed the first magnitude.<br />\nwith a dull thud and swear at the<br />\nThe Metropolitan Opera Company<br />\nFinn who invented skiis. The sun<br />\nwill come to the Lyric on two evedon't<br />\nbrother,<br />\nand<br />\nworry<br />\nisn't up yet,<br />\nnings and will offer programs which<br />\nit won't be for a couple of hours.<br />\nshould not be missed They are events<br />\n'That old boy knows when to stay in<br />\nwherever they are given The first<br />\nbed. Your breakfast, which consisted<br />\nof a large porringer of steaming oatscraped. You will receive not one<br />\nmeal (and when I say steaming I<br />\nbut many severe cracks on the side<br />\nmean it) has left your esophagus a<br />\nof the head with an exuberant skier's<br />\nstreak of red lightening, but when<br />\nskis, and it will develop that the peryou start your Christinias you'll forson who did it was at the other end<br />\nget that.<br />\nof the other end of the car at the<br />\nIf by the time you get to the train time. While you are busy ducking flyyou haven't gotten into several fights ing wads of ski wax, which is being<br />\nwith people you have unfortunately thrown about for comparison (being<br />\npoked in the eye with the tips of your hale and hearty, a skier never stoops<br />\npoles, you will not only be very lucky, to handing things, he throws them<br />\nbut in a worse humor than ever from and hard too) the little man at your<br />\ncringing before the lowest swine in side is plucking at your sleeve to<br />\nthe country. However, at the train, make you pay attention to the story<br />\nthe scene changes. The crowd, ex- of what he did for a head-cold down<br />\ncept for a few of the more poisonous in Java.<br />\ntypes that take mental notes on just<br />\nThe continual din and that damned<br />\nhow well you can ski, are made up<br />\nlittle man plucking at your sleeve<br />\nof a cheerful lot. You must expect<br />\nleave you only one solution. The<br />\nto be pounded on that sore you have<br />\nColt. If you are lucky, you can shoot<br />\nfrom tripping over the skiis in getyour way to a door and the jump for<br />\nting out of the taxi, by at least five<br />\nit. Any little town along the road<br />\nor six very hearty persons who loudly<br />\nwill have a good bed and a quart or<br />\nproclaim that you are about to spend<br />\nso, and that you'll admit is better<br />\nthe most enjoyable and healthy Sunthan any man's skiing.<br />\nday you have ever spent in your life<br />\n(they can spot a newcomer at two<br />\nhundred yards).<br /><br />\n29th<br /><br />\nThe Teutonic great such<br /><br />\nsing the music-drama of the White<br />\nKnight<br /><br />\nWhile on Wednesday, March<br /><br />\n30th, both Cavalleria Rusticans and<br />\nPagliacci will be sung. Martinelli,<br />\nJagel, Cordon, Pinza and Ponselle will<br />\nbe among the cast As these two<br />\nnights will be the only ones in which<br />\nBaltimoreans will have a chance to<br />\nsee and hear the wonderful Met creations, a super-capacity crowd is ex<br />\npected And so the Muse of Music<br />\ncomes to Baltimore<br />\nAuditur will keep you posted as to<br />\nthe coming musical events in town,<br />\nfor he believes that Hopkins has a<br />\nlarge number of quarter note lovers.<br />\nAuditur.<br /><br />\n66 BAFFLES INSIDE<br />\nFILTER -COOL SMOKE<br />\nIn<br /><br />\nRE III<br />\nWALNUT<br />\nIMRE<br />\nSUL MRS<br /><br />\n20d ite<br />\n*Wesley<br />\nfretict<br />\nFINEST<br />\nBRIAR.<br />\nMONEY<br />\nCAN BUY<br /><br />\n8<br />\nBWBF.<br /><br />\nGT VALUE<br /><br />\nALSO CIGARETTE AN<br /><br />\nSONITNINO WONIIUVL<br />\n0011 ON INSIDE<br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\ncooling mesh screen<br />\ninteriorkeeesjuiees<br />\nand flakes in Filter<br />\nand out of mouth.<br />\nPrevents tongue<br />\nbite,raw mouth.<br />\nwet heel, bad<br />\nodor, frequent<br />\nexpectoration.<br />\nbreaking<br />\nin.Improves<br />\nthe taste and<br />\naronisofm<br />\ntobacco.<br /><br />\nNA<br /><br />\nBSIJI<br /><br />\nBAFFLES BREAK • UP<br />\nSMOKE STREAM - FILTER REALLY FILTERS<br /><br />\nYou are on the train, comfortably<br />\nsnuggled down in a brush-like plush<br />\nseat when you realize that the ski<br />\ntips were left home. Much shaking<br />\nof heads follows this discovery and<br />\ninstead of getting the rest of last<br />\nnight's sleep, you are told how to prevent your skis from breaking.<br />\nThere is only one way to get rid<br />\nof the people who are hanging on your<br />\nneck and telling you what to do when<br />\nyou get up in the ski fields. You<br />\nmerely get up and walk down the<br />\naisle, turn left and stay there until<br />\nyou feel reasonably sure that they<br />\nhave gone back to their seats. (But<br />\ndon't feel too sure about that. There,<br />\nis nothing a dyed-in-the-wool skier<br />\nlikes to do more than to talk.)<br /><br />\nWhen you come back, the Washington crowd has come aboard, and<br />\nsince there are a great many skiers<br />\nfrom the diplomatic circles, the train<br />\nhas taken on a cosmopolitan air.<br />\nFrench, German and Scandinavian is<br />\nbeing screamed about your head.<br />\nDon't mind that, a large piece of ski<br />\nwax in either ear will partially shut<br />\nWe are happy to announce the addition of Seymore out some of the noise, and you can<br />\nSacks, Irving Millberg, and Milton Alperstein to the get back to sleep beside that quiet litNEWS-LETTER staff. We extend to them our heartiest tle. man who is reading up on his<br />\ncongratulations.<br />\nskiing.<br /><br />\ncONTEMPORARY<br />\nk-40MMENT<br />\nNothing is certain in philosophy, says Will Durant,<br />\ntherefore philosophers do not go to war.<br />\nA hot and furious tongue battle has been going on in<br />\nrecent weeks among such famed educators as John<br />\nDewey, Robert M. Hutchins, and that frequent visitor<br />\nin Alfred, Dixon Ryan Fox.<br />\nDewey calls Hutchins half-educated. Hutchins says<br />\nDewey can't read. Fox disparages the university which<br />\nHutchins heads. Late Monday Hutchins was still<br />\nmarshalling his forces for a counter-attack.<br />\nNow each of these men, since he influences a system<br />\nof education, is an educator; and since an eductional<br />\nsystem presupposes a philosophy, each may be assumed<br />\nto be a philosopher.<br />\nYet the vituperative word-war which we have noted<br />\nwould appear to be contrary to philosophical practice;<br />\nand the college student, who has an incomplete understanding of such matters, is hard pressed to find an<br />\nexplanation.<br />\nHe can scarcely be blamed for wondering if some of<br />\nthese educational philosophers have not permitted objctivity to be obscured by a much less praiseworthy<br />\ndesire for supremacy.<br />\nIf this be the case, then what has become of the<br />\nopen-mindedness which is supposed to keep philosophers<br />\nfrom one another's throats?<br />\nAnd if eminent educators are moved by selfish ambition to wrangle like undergraduates, whom are we to<br />\nregard as models?<br />\n—Alfred University Fiat Lux<br /><br />\nIf you get to sleep about as fast<br />\nas I do, you will be just about to take<br />\nthat first long exhilirating breath of<br />\nslumber when a hideous din breaks<br />\nout. The train has become a screaming, roaring monster.<br />\nThere are<br />\nscreams of laughter from the party<br />\nahead as the swains take advantage<br />\nof the momentary darkness. The<br />\ntrain has dodged into a tunnel. And<br />\nit isn't a short one either, it's the<br />\nlongest tunnel in this section, and<br />\nthat is just about long enough for the<br />\nsmoke to creep in and precipitate an<br />\nInch or so of soot on your new, white<br />\nwoolen parka.<br />\nYou realize that there really isn't<br />\nany place to get sleep on this train,<br />\nso you let the little man beside you<br />\ntalk. And if you don't think little<br />\nmen haven't a long family history,<br />\nand had twenty or so operations, just<br />\nstart the one beside you talking.<br />\nThe destination is about three hours<br />\naway so, before you know it, the car<br />\nis turned into bedlam again by dragging down the skiis to be waxed and<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nas<br /><br />\nFlagstad, Melchoir, List, et al will<br /><br />\nHEN Hollywood wants to film a scene requiring hundreds of \"extras,\" it makes a<br />\ntelephone call—and gets them.<br />\nThis is made possible by a central casting<br />\nbureau, whose amazingly fast service is based<br />\non systematic use of the telephone. This organization has a telephone switchboard where as many<br />\nas 30,000 calls a day are handled in bringing<br />\nactors and producers together.<br />\nAnother example of the value of telephone<br />\nservice to business and social America. It is the<br />\nconstant aim of Bell System men and women to<br />\nmake it ever more useKeep in closer touch with.<br />\nful—constantly better.<br /><br />\nW<br /><br />\nhome—by telephone.<br />\nRates to most points are<br />\nlowest after 7 P. M. and<br />\nall day Sunday.<br /><br />\nl)<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 19, 1937<br /><br />\n'ag-<br /><br />\n,rch<br />\nas<br />\nwill<br /><br />\nLieper Attacks Jay Debaters Tolle<br />\nFascism Before With MidwestTeams<br />\nSupper Club<br /><br />\niite<br /><br />\n.rch<br /><br />\nand<br />\nelli,<br />\nwill<br />\ntwo<br />\nLich<br />\nto<br />\n-eaex<br />\nisic<br /><br />\n; to<br />\nwn,<br />\ns a<br />\ners.<br />\nr.<br /><br />\nClaims No Place Exists For<br />\nReligion Under<br />\nDictatorship<br />\nFEARS RISE IN U. S.<br />\nRoosevelt's \"Well - Meant\"<br />\nMethods Cited As<br />\nOpening Wedge<br />\n\"The ideal of Fascism is the worship of a new idolatory—a worshiping of the thing created, not the one<br />\nwho creates. The Fascist dictator is<br />\na Caesar and a Messiah all rolled into<br />\none.\" Thus spoke Henry Smith Lieper at the Supper Club, Tuesday night<br />\nwhile addressing the members on<br />\n\"Fascism and Its Tendencies.\"<br />\nAccording to Dr. Lieper, who is<br />\nexecutive secretary to the Universal<br />\nChristian Council, the Fascist governments entirely repudiate the ideal of<br />\neverlasting peace, and teach instead<br />\nthe love and glory of war.<br /><br />\nvt<br /><br />\nWhy should<br /><br />\nwe<br /><br />\nbother<br /><br />\nwith<br /><br />\n• •<br />\n• •<br /><br />\na stood and wondered. Jimmy was will-<br /><br />\ncomet? It has nothing to do with the ing, however.<br />\nArthur Maass, Hammond Brown<br />\n\"On what?\" he asked.<br />\nand James Sfekas will represent the New Deal!\" A non-WPA dig by Harry<br />\nphysics<br />\nat<br />\nMountcastle,<br />\n\"Make a statement about Brown,\"<br />\nprofessor<br />\nof<br />\non<br />\nits<br />\nannual<br />\nspring<br />\nDebating Council<br />\ntrip next week.<br />\nsuggested the freshmen.<br />\nWestern Reserve University.<br />\nThe following is the schedule of de\"Oh, you can say anything you<br />\nbates:<br />\nWhen a buxom blonde at the Medi- want about Brown,\" smiled James J.<br />\nMonday—Carnegie Tech.<br />\ncal College of Virginia swing-hipped and departed.<br />\nTuesday—University of Akron.<br />\nInto the X-ray department, she imWednesday—University of Chicago. pressed the attendant as \"sort of Mae<br />\nCanton, N. Y. — (ACP) — Plump<br /><br />\nFriday—University of Cincinnatti. Westish.\" A second later he was alA tentative engagement has also most convinced.<br />\nbooked with the University of In\"Please sit down here,\" he said,<br />\ndiana on Thursday.<br />\npushing a chair toward her. \"Have<br />\nThe question to be debated is: Reyou ever been X-rayed before?\"<br />\nsolved, That Congress should be em\"No, handsome,\" she answered, fixpowered to regulate minimum wages<br />\nand maximum hours for industry. ing her hair prettily, \"but I've been<br />\nThe Hopkins will uphold the affirma- ultra-violated.\"<br />\ntive side against Carnegie Tech and<br />\nThey wanted to interview New<br />\nChicago and the negative side against<br />\nYork city's ex-mayor, Jimmy Walker<br />\nAkron and Cincinnati.<br />\ndid two Brown University freshWhy not<br />\nmen. So they posed as reporters and<br />\nstopped Walker and his wife, the<br />\nformer Betty Compson, as they were<br />\nleaving the hotel:<br />\nEtta/2MA<br />\n\"Are you Jimmy Walker?\"<br /><br />\nthis Summer?<br /><br />\nThe noted explorer has planned an exciting trip that You can Join at the end of<br />\nyour college term. Members of this 87 day<br /><br />\nNORTHLAND<br />\nEXPEDITION<br />\nwill tour Denmark, Norway. Sweden and<br />\nFinland; they will go to Iceland for 12<br />\ndays and then into the interior of Lapland<br />\nwhere they will live for 2 weeks in the<br />\ncamps of native Lapps. The expedition will<br />\nalso go into the new Runic Estonia and<br />\nLatvia. The culture of northern people,<br />\nwill be studied at their most interesting<br />\nsources, combining educational values<br />\nwith real adventure. Membership limited.<br />\nWrite for special booklet CD - I.<br /><br />\nNo Place For Religion<br />\nAs far as religion is concerned, Mr.<br />\nLieper stated that religion, other than<br />\nthat of nationalism, has no place in a<br />\nFascist government. He cited Germany as an example, where you are<br />\neither a German, Jew or Christian.<br /><br />\ngals at St. Lawrence University are<br />\n\"daily - dozening\" in old - fashioned<br />\nstyle to make the red-hand on the<br />\nscale tell less weighty truths.<br />\nKnee-bends and arm exercises are<br />\njust a few of the \"pound-dissolvers\"<br />\nincluded in this new course instituted<br />\nby<br /><br />\nMiss<br /><br />\nJean<br /><br />\nBell, head<br /><br />\nof<br /><br />\nthe<br /><br />\nwomen's physical education depart-<br /><br />\nYou can't wear your sheepskin!<br /><br />\nment.<br />\n\"The course,\" explains Miss Bell,<br />\n\"is designed to do away with foolish<br />\ndieting practices and provide a sane<br />\nmeans of reducing.\"<br />\nCambridge, Mass. — (ACP) — To<br /><br />\nhelp the alumnus to expand on the<br />\n\"Yes!\"<br />\nknowledge that earned him a degree,<br />\n\"We're from the Brown Daily HerHarvard University is preparing a<br />\nald,\" spouted the duo. \"We'd like an<br />\n\"hobby study\" plan.<br />\ninterview.\"<br />\nSo stated Dr. James B. Conant,<br />\n\"Okay,\" the ex-mayor answered.<br />\npresident of Harvard University in<br />\n\"Make a statement,\" the rookie re- his annual report to the board of<br />\nporters suggested, while the Walkers overseers.<br /><br />\nVILHJALMUR<br />\nSTEFANSSON<br /><br />\n\"Fascism is a changd form of the<br />\nState for the purpose of keeping order. It substitutes order for equality; work for fraternity, and sacri<br />\nflee and duty for liberty,\" he said.<br /><br />\n40.•••••••••<br /><br />\nYou seniors who are still on the drawing account<br />\nmight better begin now to stock up with several<br />\ndozen Arrows before you step out into the cold, cold<br />\nworld. Later on you'll thank us for the tip—and have<br />\nshirts aplenty, for Arrow shirts are made to stand<br />\nthe gaff. Be sure to see your Arrow dealer today.<br />\nTWO<br /><br />\nDOLLARS AND<br /><br />\nMitoga--tailored to fit<br /><br />\nMORE<br /><br />\nSanforized Shrunk<br /><br />\n41•••••••41,40.4111111<br /><br />\nWe Carry A Full Line Of<br />\nArrow Shirts And Collars<br /><br />\nMc Pherson'$<br />\n11 East Baltimore Street<br /><br />\nSEMINAR ON<br /><br />\nTurning to the American scene, the<br />\nspeaker discussed tendencies of Fascism in America. He felt that a great<br />\nRoosevelt's<br />\nPresident<br />\nof<br />\nmany<br />\nmethods open the way for Fascism.<br />\nHe expressed the opinion that Mr.<br />\nRoosevelt has no desire to attain such<br />\na goal, but that the precedents which<br />\nhe sets may be taken over in the future for other purposes, by other people in control of the nation.<br />\nAmong the factors in modern society, that Mr. Lieper feels are possibly leading to Fascism, are the concentration of power in the Federal<br />\nexecutive head, the growth of organizations such as the Khaki Shirts, the<br />\nTeachers Oath Movement and opposition to such movements as consumers' cooperatives on share crop region.<br />\nNext speaker at the Supper Club is<br />\nto be Dr. Arthur Holley Compton,<br />\nNobel Prize winner and University of<br />\nChicago physicist. The speaker is a<br />\nbrother of Karl Compton, who addressed last February's Commemoration Day exercise.<br /><br />\nIntercollegi ales<br /><br />\n3<br /><br />\nECONOMIC LIFE<br />\nIN EUROPE<br /><br />\nLeslie Howard<br /><br />\nProf. Broodos Mifcboll<br />\nof Johns Hopkins University will conduct<br />\na 49-day study tour of politico econoraie<br />\nconditions in England, Deomark, Swede.,<br />\nFinland, Soviet Union, Austria, Switzerland and France. The program Includes<br />\ndiscussions by outstanding leader, In economic thought In each of the countries<br />\nvielted. Sailing from New York July 34th,<br />\nreturning September 11th. Writs far modal booklet CD-2.<br />\nOther interesting tours andlable.<br />\nComplete rentce for individual<br />\ntravel—Europe, Mexico. U.S.S.R.<br /><br />\nEDUTRAVEL, Inc.<br />\nAn Inalltut• bps Educational Travel<br />\n$5 FIFTH AVENUE, NEW YORK. N. Y.<br />\nTelephones: GRaznercy 7-3184-3203<br /><br />\n717<br /><br />\n.4<br /><br />\n1PP<br /><br />\nsays Luckies are \"tops\" with<br />\nhis throat<br /><br />\n1?<br /><br />\n.21 Z,<br /><br />\n\"Years ago,as an ambitious young<br />\nactor,I was impressed how well my<br />\nthroat liked Luckies and how well<br />\nthey suited my idea of a perfect<br />\ncigarette. That impression still<br />\nstands.In myrecenttourof'Hamlet',<br />\nwith its many performances each<br />\nweek and the attendant tax on my<br />\nthroat,I have been convinced anew<br />\nthat this light smoke is both delightful to my taste and the 'top' cigarette for an actor's throat.\"<br /><br />\nLUSC/O'S<br />\nLocated at the North End Basement of<br />\nLevering Hall, for the convenience of the<br />\nstudent body and faculty.<br />\nHOURS-9 to 5 P.M.<br /><br />\nCAMPUS BARBER SHOP<br /><br />\nJoin The Pilgramage To<br />\nPlymouths<br />\nTHREE J. H. U. MEN LED THE PROCESSION<br />\nLAST WEEK<br /><br />\nAn independent survey was made recently<br />\namong professional men and women —lawyers,<br />\ndoctors,lecturers,scientists,etc.Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\nMr. Howard verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies —a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br /><br />\nHave You Seen<br />\nHOLT MAULSBY'S GRAY<br />\nBILLY ERLANGER'S BLACK<br />\nFRANK CRIST'S GREEN<br />\nCONVERTIBLE COUPES?<br /><br />\nThey Started The Pilgrimage To The<br /><br />\nAUTO CLINIC<br />\nCHRYSLER AND PLYMOUTH DEALERS<br /><br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br /><br />\n— AT —<br />\n309-19 Fallsway<br /><br />\nTHE FINEST TOBACCOS.\"THE CREAM OF THE CROP\"<br /><br />\n3414-18 Reisterstown Road<br /><br />\nJoin The Pilgrimage Now!<br /><br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1037. The Amelia!) Tobacco Company<br />\nI<br />\nI<br /><br />\nHOMEWOOD, BALTIMORE, MARCH 19, 1937<br /><br />\n4<br /><br />\nStickmen Drill Company C Takes Pi Lambda PhiFraternity Leads<br />\nFor Initial Tilt R.O.T.C.RifleMatch In Race For Turbyville Trophy<br />\nN.y• EdgpelaOcuetTCoomcpany 13; TAhird<br />\nWith C.0omp<br />\n-1<br />\n.<br /><br />\nTouch Tug of BasketFootball War<br />\nball<br /><br />\nGalloway Higl-y<br />\ni<br />\nMorrill Practices Jay Squad<br />\nFor Season Opener<br />\nApril 3<br />\nMANY VETERANS BACK<br />\nTeam To Hold Workouts<br />\nAll Through Spring<br />\nHoliday<br /><br />\nIn the annual rifle match held last<br />\nweek between the R. 0. T. C. companies, Company C edged out Company<br />\nB for top honors. Led by R. Brown,<br />\nCompany C shot 1,222 compared to<br />\n1,153 of Company B. Third place<br />\nhonors went to A Company over Company D by a one point advantage,<br />\n1,066 to 1,065.<br />\nAlthough his team failed to win.<br />\nC. Lindenmayer copped high score by<br />\nshooting 98 from the prone position,<br />\n96 kneeling and 78 standing for a<br />\ntotal of 272. Brown shot 99-85-80<br />\nfor 264 to place second in individual<br />\nachievement. H. H. Leber followed<br />\nwith a total of 248. Galloway placed<br />\neighth in total score, but his 86 in<br />\nthe kneeling position was high for the<br />\nmatch.<br /><br />\nUnfortunate<br />\nweather conditions<br />\nhave been a thorn in the side of Coach<br />\nKelso Morrill. For more than a week<br />\nthe lower field has been unsuitable<br />\nfor use and the band of lacrosse huskies has been compelled to train indoors.<br />\nWith the opening encounter of the<br />\nseason scheduled for April 3, the Jays<br />\nwill have to work under full pressure<br />\nCompany C—<br />\nin order to be well-conditioned. Dur99<br />\nG. Brown<br />\ning the Spring holiday there will be R.<br />\nJ. S. Baldwin<br />\n97<br />\nno lay-off for the stickmen. They<br />\n97<br />\nJ. Weber<br />\nwill indulge in afternoon practice ses- M.<br />\nA. H. Smith<br />\n94<br />\nsions including active scrimmage<br />\n95<br />\nM. J. Hartke<br />\nevery day. Coach Morrill expects his<br />\nTotal<br />\ncrew to be ready for C. C. N. Y. when<br />\nthey invade Homewood to start this Company —<br />\nyear's quest for lacrosse supremacy. C. E. Lindennaayer.. 98<br />\n98<br />\nMost outstanding of the newcomers J. R. Galloway<br />\nto report is Pasoan°, an all-scholastic S. H. Linthicum<br />\n89<br />\n90<br />\ngoalie. He should prove himself an J. H. Charles<br />\nable reserve for last year's stellar W. B. Gray<br />\n95<br />\ngoal keeper, George Kahl.<br />\nTotal<br />\nA long list of last season's perform- Company A—<br />\ners have been earnestly practicing<br />\nE. Mihalyk<br />\n92<br />\nand have shown a return to their old F. J. Taylor<br />\n93<br />\nform. Particularly Hammer Himes, J. F. Griffin<br />\n96<br />\nJackson Kaufman, Billy Kempton,<br />\n94<br />\nW. C. Schmied<br />\nTommy Dukehart, Johnny Ghinger,<br />\n76<br />\nC. E. Kerstetter<br />\nHerb Siegal, Johnny Beeler, Don Naylor and Captain Pete Swindell ap- • Total<br />\nCompany D—<br />\npear ready.<br />\n91<br />\nUp to date attention has been con- H. H. Leber<br />\ncentrated on stick-handling and pass- R. B. Stegamaier..._ 94<br />\n93<br />\ning. With the advent of daily out- S. R. Kramer<br />\n87<br />\ndoor scrimmages, more time will be D. C. Spencer<br />\n79<br />\ndevoted to teamwork and play for- F. L. Diehl<br />\nmations.<br /><br />\nTotal<br /><br />\n85<br />\n75<br />\n78<br />\n81<br />\n79<br /><br />\nPi Lambda Phi<br />\nDelta Upsilon<br />\nKappa Sigma<br />\nOmicron Kappa Omicron<br />\nAlpha Epsilon Pi<br />\nAlpha Delta Phi<br />\nTau Alpha Omega<br />\nPhi Epsilon Pi<br />\nPhi Alpha<br />\nPhi Gamma Delta<br />\nDelta Phi<br />\nSigma Phi Epsilon<br />\nPhi Kappa Psi<br />\nBeta Theta Pi<br />\nPhi Sigma Delta<br />\nTau Alpha Phi<br /><br />\n120<br />\n105<br />\n60<br />\n95<br />\n40<br />\n75<br />\n55<br />\n55<br />\n20<br />\n00<br />\n60<br />\n95<br />\n85<br />\n40<br />\n45<br />\n60<br /><br />\nCopping the touch football league,<br />\nplacing third in basketball, winning<br />\nvolley ball, and being a strong con•<br />\ntender in tug of war were the factors<br />\nwhich place Pi Lambda Phi with a<br />\ntotal of 345 points in the number one<br />\nposition for the Turbyville trophy.<br /><br />\n96<br />\n86<br />\n67<br />\n76<br />\n67<br /><br />\n80--264<br />\nDelta Upsilon, thirty-five points be71-243<br />\nhind is in the runner-up position. Be66-241<br />\nRides winning the tug of war, the<br />\n64-239<br />\nD. U. fraters placed second in foot61-235<br />\nball, fourth in basketball, and third<br />\n1222 In volley ball to amass 310 points,<br />\nNext in line is Kappa Sigma, victors<br />\n78-272 of court warfare. Omicron Kappa<br />\n54-238 Omicron a strong contender in all<br />\n62-218 sports ranks next with 245.<br />\n48-214<br />\nOnly softball is left on the frater49-211 nity schedule, and a victory by either<br /><br />\n81<br />\n71<br />\n73<br />\n44<br />\n55<br /><br />\n1153 Pi Lam or D. U. in the spring sport<br />\nwill give them this award.<br />\n73-246<br />\n63-227<br />\n37-206<br />\n67-205<br />\n51-182<br /><br />\nKIBLER'S<br /><br />\n1066<br />\n83<br />\n80<br />\n60<br />\n72<br />\n66<br /><br />\n74-248<br />\n52- -226<br />\n51-204<br />\n45--204<br />\n38-183<br /><br />\nJewelers and Opticians<br />\nPEN and PENCIL SETS<br /><br />\n3222 Greenmount Avenue<br /><br />\n10<br />\n25<br />\n10<br />\n00<br />\n10<br />\n00<br />\n10<br />\n10<br />\n00<br />\n00<br />\n10<br />\n00<br />\n00<br />\n00<br />\n00<br />\n00<br /><br />\n95<br />\n85<br />\n110<br />\n75<br />\n75<br />\n65<br />\n65<br />\n45<br />\n75<br />\n120<br />\n55<br />\n35<br />\n35<br />\n20<br />\n05<br />\n05<br /><br />\nVolleyball<br /><br />\nV<br /><br />\nTotal<br /><br />\n345<br />\n310<br />\n255<br />\n245<br />\n235<br />\n220<br />\n215.<br />\n195<br />\n190<br />\n190<br />\n185<br />\n175<br />\n145<br />\n85<br />\n70<br />\n65<br /><br />\n120<br />\n95<br />\n75<br />\n75<br />\n110<br />\n80<br />\n85<br />\n85<br />\n95<br />\n70<br />\n60<br />\n45<br />\n25<br />\n25<br />\n20<br />\n00<br /><br />\nIT'S SPRING<br />\nAGAIN<br />\nAnd high time for that<br />\nWHEN YOU BUY A015<br />\nROUND-TRIP TICKET<br />\nOn•-Way Cost of<br /><br />\nNEW<br />\nSCHLOSS<br />\nSUIT<br /><br />\nor<br /><br />\nFaro<br /><br />\nNew York<br /><br />\n$ 3.10<br /><br />\n$2.50<br /><br />\n11.95<br /><br />\n9.55<br /><br />\n.65<br /><br />\n.55<br /><br />\nCleveland<br /><br />\n7.25<br /><br />\n6.80<br /><br />\nBoston<br /><br />\n5.25<br /><br />\n4.20<br /><br />\nRichmond<br /><br />\n2,90<br /><br />\n2.35<br /><br />\nChicago<br /><br />\nTOPCOAT<br /><br />\nStop in for a try-on!<br /><br />\n$35 to $70<br /><br />\nReturn Trip<br /><br />\nWashington<br /><br />\nPittsburg<br /><br />\n5.25<br /><br />\n4.20<br /><br />\nPhiladelphia<br /><br />\n1.60<br /><br />\n1.30<br /><br />\nBE KIND and gentle to your pocketbook this vacation—buy a roundtrip Greyhound ticket? Save money going home—fares are lowest in history.<br />\nAnd save still more coming back —<br />\nthere's an extra 20% reduction on the<br />\nreturn portion of your ticket.<br />\nCampus Agent<br />\nM. L. KRIEGER<br />\nE.<br /><br />\n22 Dormitory<br /><br />\nPhone Chem 4912<br /><br />\nDistinguished Ready-to-wear<br /><br />\nJos. Schloss<br />\n&amp; Son<br /><br />\n5 East Lexington St.<br />\n(nowhere elae)<br /><br />\nGREYHOUND BUS TERM.<br /><br />\nliv<br /><br />\nkn<br /><br />\nBuffalo<br /><br />\n6.50<br /><br />\n5.20<br /><br />\n217-221 W. Baltimore St.<br /><br />\nCincinnati<br /><br />\n8.55<br /><br />\n6.85<br /><br />\nPhone: Plaza 0520<br /><br />\nPr<br />\nJo<br />\nth<br /><br />\nGREY0cOUND<br /><br />\nfe<br />\nkit<br />\nga<br /><br />\n1065<br /><br />\n•<br /><br />\n•<br /><br />\nlas<br />\ntio<br />\nr.<br />\nHo<br />\ncot<br />\neat<br />\nthc<br />\nme<br /><br />\n\"it<br />\nthe<br />\nthe<br />\ndot<br />\nPr(<br /><br />\nprC<br /><br />\nly.<br />\narc<br />\ndin<br /><br />\nspa<br />\nto<br />\nshe<br />\nsag<br />\nan(<br /><br />\n.full measure ofeverything<br />\nyou want in a cigarette.<br />\nAt every stage. .. from tobacco<br />\nfarm to shipping room ... Chesterfield's job is to give you the refreshing mildness and delightful flavor<br />\nthat makes smoking a great pleasure.<br />\nExperienced buyers see that Chesterfield tobaccos are MILD and<br />\nRIPE... careful manufacturers<br />\nsee that they are blended to the<br />\nexact Chesterfieldformula.<br />\nAnd they see that the cigarettes are<br />\nmade right... round, firm, just right<br />\nto smoke.<br />\n...for the full measure of the<br />\ngood things you want in a cigarette<br />\nTon/a:CO CO.<br /><br />\nWC<br /><br />\n_I_<br />\nyou to enjoy ioteritetw.<br />\ninvitek_f<br /><br />\nIn ,<br />\nthe<br />\ncep<br />\ntha<br />\nlud<br />\ntior<br />\nthe<br />\ndis<br /><br />\nto<br />\nho<br />\nfro:<br />\ntior<br />\nto<br />\nVal<br /><br />\n0<br />\nday<br />\nlea<br /><br />\nwlx<br />\nam<br />\nbac<br />\nwiI<br />\nHoi<br />\nto<br />\nous<br />\ntle<br /><br />\nreti<br />\nnev<br />\nhe<br />\nany<br />\nnal.<br />\nthie<br />\ntint<br />\nof<br />\nthik<br />\nprir<br /><br />"}], "field_media_file": [{"target_id": 39098, "display": null, "description": null, "target_type": "file", "target_uuid": "02b716e9-9b13-45b5-8e03-128e7ec1c827", "url": "http://digital.library.jhu.edu/system/files/2022-03/12770-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12770, "target_type": "node", "target_uuid": "b2fdc5be-5652-4f7d-8f00-8bb1eb63a558", "url": "/node/12770"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fc37a4ca-9aef-4807-946c-f3504bd92c26"}]}