{"mid": [{"value": 36941}], "uuid": [{"value": "8cf5ee90-06f3-4e38-86da-a856f18d0794"}], "vid": [{"value": 36941}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13105-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ";<br />\n<br />\nVOL. XXVIII, No 33<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 15, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMUSICAL CLUB PUTS TICK- HOUSE WARMING TO RE- BOWERY BALL PROMISES HOME OF TUDOR-STUART HOPKINS - FIFTH REGIMENT<br />\nPLACE ANNUAL ALUMNI<br />\nSUCCESS. MANY ALUMNI<br />\nETS ON SALE FOR ANNUCLUB NEARING COMMEET DRAWING BIG<br />\nBANQUET<br />\nAL HOME CONCERT<br />\nTO BE PRESENT<br />\nPLETION<br />\nENTRIES<br />\nConcert on Feb. 21 at Md. Casualty Reorganization of Present Alumni As- Committee Considering Raising the Furniture Patterned After Tudor-Stu- Medley Race to Be Interesting Event.<br />\nsociation Planned. New Officers<br />\nTicket Limit from 75 to 85<br />\nClub House Expected to Excell<br />\nart Period. Club's Room a Gift<br />\nTrophies Announced by SevLikely to Be Announced<br />\nLast Year's. Formal Dance Follows<br />\nof Mrs. Robert Brewster<br />\neral Organizations<br />\nThe Bowery Ball is going to be<br />\n<br />\nTo take the place of the Annual good. Not to exaggerate, it will be<br />\nPreparations for the big annual<br />\nLocated on the third floor in the<br />\nAlumni Banquet, which is held on better than that. No social affair southeast corner of Gilman<br />\nHall indoor games and athletic meet at<br />\nthe evening of Commemoration at Hopkins in the mind and memthere is a room which is rapidly the Fifth Regiment Armory are goDay, February 22, there will be a ory of the oldest grad or the younging ahead with plenty of enthusigood old-time House Warming est freshman has ever had its full assuming an appearance of dignity asm. Entry blanks were mailed<br />\nheld at the Memorial Dormitory. limit of tickets sold over a week and beauty. In strange contrast out some time ago to several hunSince the days of Volstead these in advance of the date of the af- to the long corridors echoing with dred schools and colleges and the<br />\nfamous banquets of the Johns fair. This is the true status of the voices and the trampling of feet, returns are coming in at a rapid<br />\nHopkins Alumni have been grow- situation confronting the Bowery this favored room, though at pres- rate.<br />\ning less interesting each succes- Ball Committee at present. Chair- ent strewn with the rubbish of<br />\nSome of the best known teams<br />\nlasive year and fewer alumni have man Gump and his assistants,<br />\nConcert Begins Festivities<br />\nin<br />\neastern intercollegiate circles<br />\nUr- bor, already possesses a sort of<br />\nThe Musical Club Concert been attending.<br />\nner, Willison and Wales, are com- sedate peace. -With<br />\nare<br />\nexpected and many have notiits great oak<br />\nstarts what may be called \"the<br />\nThe officers of the Alumni As- pelled to turn down men who want<br />\npanelled walls, its brown cur- fied the athletic office that teams<br />\nmid-winter frolic.\" The concert sociation have sought a remedy to attend the Ball. The committee<br />\ntains, draping three windows gen- and individuals will be entered.<br />\nwill be held on Thursday night, for this gradual falling off of at- is seriously considering raising<br />\nthe erous with their light, this future<br />\nRobertson to Referee<br />\nthe Commemoration Day exer- tendance and have substituted the ticket limit from 75 to<br />\n85, although home of the Tudor-Stuart Club is<br />\nThe latest announcement of ito<br />\ncises on Friday, the Alumni House Warming.<br />\nInvitations this is inadvisable, due to lack of<br />\nalready pervaded with an atrnoc..- - portance is the acceptance of LawHousewarming on Friday, the have been sent out to 2,407 grad- floor space<br />\nin the hall.<br />\nphere suggestive of learned asso- son Robertson, coach of track at<br />\n\"Bowery Ball\" of the Junior class uates, asking them to attend the<br />\nVery unique favors have been ciations.<br />\nthe University of Pennsylvania and<br />\non Friday evening, and the An- meeting and maintain their old in- procured for<br />\nthe affair. After<br />\nThe furnishings' of the room are coach of the American Olympic<br />\nnual Hopkins-Fifth Regiment In- terest in the University. The en- some<br />\nconsiderable discussion the in harmony with the Tudor-Stu- team to be referee of the meet.<br />\ndoor Games on Saturday. A plan tire Alumni have been invited, choice<br />\nwas made and it is expected art period; Extending along the Mayor Howard Jackson of Baltifor further mid-year social activity while formerly those present were that<br />\nthe favors will arouse a great entire eastern side of the room more will be honorary referee,<br />\nit<br />\nto be held over a week-end was only the members of the Alumni<br />\ndeal of admiration and approval.<br />\nis a sill under which are two ra- was announced.<br />\nformulated by the Junior Class Association. Plans will probably<br />\nChairman Gump has desired to diators cleverly hidden by artistic<br />\nIncluded in the events is the<br />\nbut was abandoned at the sugges- be announced regarding the new<br />\nhave it clear that all persons at- latticework. The furniture which medley relay between<br />\nHopkins,<br />\ntion of the Student Council so as organization of the Alumni Assotending the Ball must come attired has recently arrived is of walnut, University of Pennsylvania,<br />\nNavy,<br />\nnot to interfere in any way with ciation.<br />\nin the spirit of the occasion. Ques- and consists of eight -Windsor University of<br />\nPittsburg,<br />\nBoston<br />\nJune -Week activity.<br />\nContrary to the custom of for- tion<br />\nhas arisen as to what the girls chairs, four cushioned chairs, two College and Georgetown UniverAttractive Program Planned<br />\nmer years, long speeches will not<br />\nmay wear. The committee suggests round tables, one long table, the sity. The Georgetown<br />\nteam has<br />\nMany \"collegiate\" numbers be in order. There will be short<br />\nthat plaid or calico dresses, blue legs of which are fantastically dec- two good quartets,<br />\nand<br />\nit is exwill adorn the program. The addresses by President Goodnow,<br />\nsweaters, tams, noisy hosiery and orated, and several table lamps pected that they will bring<br />\ntheir<br />\nnumbers of the Glee Club will be Dr. Weed, the new Dean of the<br />\nany kind of shoes will be in order. with dark green shades. The best team and<br />\nthe team used at<br />\nclassical while the Banjo Club Medical School, and Mr. George<br />\nMen will come in knickers, sweat- western or inner wall of the room the Millrose games<br />\nin New York<br />\nwill play a combination of favor- Knapp, retiring President of the<br />\ners, shoes, vests, derbies, caps and is taken up by huge book cases on January 30 when<br />\nHopkins lost<br />\nite and popular selections. The present Alumni Association. The<br />\nchecked socks. The least sugges- extending from floor to ceiling. A to them and to Boston<br />\nBlue Jay Six can be relied upon new officers for the year of 1924College.<br />\ntion of formal dress will be suffi- beautiful fireplace of Italian mar- The first team is<br />\nmade up of Dowto furnish an excellent number. 1925, who have been elected by<br />\ncient to give the official bouncers ble is located in the southwest ding in the 220, Ascher<br />\nSolo numbers will also be given a mail, will be announced at this<br />\ndoing the<br />\ncorner. The room, though but a<br />\nexercise.<br />\n440 dash, Marsters in the 880 and<br />\nplace on the program—a piano meeting. Musical numbers will<br />\nrough sample of what it will be,<br />\nSullivan the mile man.<br />\nsolo, violin, banjo, xylophone and be rendered by the Johns HopFRESHMAN<br />\nSMOKER<br />\nTO has already attained a certain<br />\nsaxophone solos. The Quartette kins Musical Club. The food for<br />\nNavy expects to have entries in<br />\nTAKE PLACE TONIGHT<br />\nquality of beauty.<br />\nevery<br />\nis expected to have several pieces the House \"Warming will be supevent in the Hopkins games.<br />\nAT SOUTHERN<br />\nThis delightful room has been<br />\nready for presentation.<br />\nplied by the kitchens of the Dor- First Attempt of Freshmen to Hold<br />\nPenn State Sends Stars<br />\nmade possible through the genLast year's concert attracted mitory.<br />\nSocial Function<br />\nPennsylvania<br />\nState<br />\nCollege's<br />\nAll of those members of the erous donation of Mrs. Robert<br />\nThe two primary purposes of<br />\nmuch attention in musical circles<br />\ncrack two-mile relay team, holder<br />\nBrewster<br />\nof<br />\nNew<br />\nYork<br />\nCity,<br />\none<br />\nof Baltimore because of its excel- the House Warming will be to Class of '27 who survived their iniof the original honorary members of the world record for that dislence. This year's concert is ex- put on a drive for new members tial examinations will have ample<br />\ntance, has been invited. This track<br />\nof the Tudor-Stuart Club.<br />\npected to be even better. The for the Association and to give opportunity for celebration when<br />\nbunch is made up of Helfrich, namost prominent people of Balti- the Alumni an opportunity to in- the class smoker is held this eventional<br />\nhalf-mile champion; Enck,<br />\nmore have been requested to be spect the Memorial Dormitory ing. The Southern Hotel is to be SCHOOL OF HYGIENE HEARS<br />\nnational<br />\ncollegiate champion in the<br />\nPUBLIC HEALTH TALK<br />\npatronesses and the majority of which they officially presented to the scene of the festivities.<br />\nmile;<br />\nCarter<br />\nand Egerton, both<br />\nThe smoker will be the first at- Dr. Hastings, of Toronto, Lectures on<br />\nthose asked have accepted. Many the University last June.<br />\nspeedy<br />\ntrackmen.<br />\nNavy's twothe Economic Aspect of<br />\ntempt of the Freshmen to sponsor<br />\ncritics pronounced last year's conmile quartet includes Newhall,<br />\nPublic Health<br />\ncert on a par with Dartmouth's DORMITORY DENIZENS WILL harmony among the members of<br />\nOne of the foremost authorities Tammany, Shephard and Carpenthe class through the medium of a<br />\nConcert, given in Baltimore last<br />\nHOLD ELECTIONS<br />\nter. Carpenter captured the 600December: Dartmouth's club last Mass-meeting Monday Night, February social activity, and the committee on public health in Canada was<br />\nyard<br />\nnovice race last year.<br />\nhas spared no effort to make the heard at Johns Hopkins when Dr.<br />\nyear won the Intercollegiate Mu18. Novelty Acts and Musical<br />\nPrep<br />\nschools and high schools<br />\nNumbers on Program<br />\naffair a memorable event. A pro- Charles J. Hastings, of the Departsical Title.<br />\nhave<br />\nmade big demands on the enment of Public Health, Toronto,<br />\nDance An Added Feature<br />\nThe men of the Alumni Memor- gram that ranges from musical rentry<br />\nblank<br />\nsupply. Fork Union and<br />\nOntario,<br />\nspoke<br />\nat<br />\nSchool<br />\nthe<br />\nof<br />\nFollowing the Concert a dance ial Dormitory will hold the first dition of varied sorts to speeches<br />\nLawrenceville<br />\nare two prominent<br />\nHygiene<br />\nPublic<br />\nand<br />\nHealth<br />\nMonwill be held in the Ballroom. The mass-meeting of the year on Mon- by eloquent members of the class<br />\npreps.<br />\nAn<br />\nattempt<br />\nis being made<br />\nday,<br />\nFebruary<br />\n11.<br />\nThe<br />\naddress<br />\ndance is an added _ feature of at- day night, February 18, immediate- promises to give the participants a<br />\nto<br />\nput<br />\nthese<br />\ntwo<br />\nschools<br />\nin a relay<br />\nwas<br />\none<br />\nseries<br />\nof<br />\na<br />\na<br />\nlectureship<br />\nin<br />\ntraction and is comparable to a ly after dinner. The purpose of real treat.<br />\ntogether.<br />\nFifteen<br />\ncolleges<br />\nhave enestablished<br />\nCount<br />\nDe<br />\nby<br />\nLamar<br />\nin<br />\ncotillon. It is customary for the the meeting is to gather all the men<br />\nTom Landy, coach of the Freshtered<br />\nin<br />\nrelay<br />\nraces<br />\nbut<br />\nhave<br />\nnot<br />\nthe<br />\ninterests<br />\nhygiene,<br />\nof<br />\nwhich are<br />\nClub to give a dance after their together for the February elections man football team, and the entire<br />\nbeen<br />\nmatched.<br />\ngiven throughout each scholastic<br />\nconcerts<br />\nto the House Committee. Further Freshman team will be guests of<br />\nAdditional color has been given<br />\nyear at Hopkins.<br />\nAn elaborate system of adver- interest will be added to the meet- honor. Class numerals<br />\nwill be prethe<br />\nmeet by inviting the best disDr. Hastings spoke on a subject<br />\ntising the concert has been put ing by several novelty<br />\nacts and sented to the football men by Prestance<br />\nmen in the country to cominto effect. Four hundred of the musical numbers.<br />\nident Niner. Schwinn, chairman of of general, as well as technical, inpete<br />\nwith<br />\nBooth in the 5,000 meter<br />\nterest—\"The Economic Aspect of<br />\nstandard black and blue posters<br />\nAccording to the constitution the Committee on Arrangements,<br />\nevent. A sprint race has been arPublic<br />\nof the Club advertising \"a real colHealth.\"<br />\nHe<br />\ndeclared<br />\nthat<br />\ndrawn up for the government of will preside as toastmaster.<br />\nthe field of public health was one ranged for all girl athletes of A. A.<br />\nlege party\" have been placed<br />\nThe program will be concluded<br />\nthe Dormitory by the House Comaround the city, while in many<br />\nwhich would, by its extension, pro- U. standing. Invitations have been<br />\nmittee, the elections for the mem- with a fitting memorial in commemprominent places pictures of the<br />\nvide a definite economic saving to extended to all Y. M. H. A. athbers of the governing body, the oration of those late members of<br />\nClub have been posted. Articles<br />\nthe country, as well as adding letes to compete in a relay between<br />\nthe class who are no longer on the<br />\nare appearing in the daily papers House Committee, are held twice<br />\nphysical betterment of the race as representative teams from New<br />\nrolls of the University.<br />\nas a result of the work of the Pub- a year. Men are elected to the<br />\na whole. The conservation of hu- York, Philadelphia, Washington,<br />\ncommittee for a term of one year<br />\nlicity Board.<br />\nman life, he declared, was of the Norfolk and Newport News.<br />\nfrom the time they are chosen.<br />\nTickets at Albaugh's<br />\nNOTICES<br />\nutmost importance, probably higher<br />\nMany Schools Represented<br />\nThe committee, which consists<br />\nNon-athletic cards may be reMeeting entire staff of<br />\nthan any other single factor in ecoIncluded in the schools which<br />\nNews-Letter, today, 12.20.<br />\ndeemed any noon at the Barn for of seven men, is made up as folnomics, and one in which further have written for information and<br />\na ticket which in turn is ex- lows: three men are elected in Ocresearch by economists might well blanks and who, it is thought, will<br />\nNon-athletic tickets may<br />\nchanged at Albaugh's for a re- tober within ten days after the first<br />\nbe given.<br />\nbe here, are: West Virginia, Labe redeemed for Musical<br />\nserved seat. Extra tickets may be day of classes; three men are electDr. Hastings presented some in- fayette, New York University,<br />\nClub concert ticket at the<br />\neither purchased at the Barn or ed in February, ten days after the<br />\nBarn at noon.<br />\nteresting and authoritative data on Massachusetts Tech, Alfred Unidirect at Albaugh's Ticket Office.<br />\nContinued on page 4, col. 3<br />\nContinued on page 4, col. 3.<br />\nTickets have been placed on<br />\nsale for the Annual Home Concert<br />\nof the Musical Club, which will be<br />\npresented at the Maryland Casualty Club House on the evening<br />\nof February 21. Last year the tradition of holding the home concert on the evening preceding the<br />\nCommemoration Day was started<br />\nand is continued again this year.<br />\n<br />\nContinued on page 2, col. 4<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 15, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\nMid-Winter<br />\nSPORTING<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nB UNK<br />\n<br />\nHopkins swimmers succeeded<br />\nin breaking two Black and Blue<br />\nrecords and tying one when they<br />\nBusiness communications should be addressed to the BUSINESS MANCatholic University last<br />\ntrimmed<br />\ncommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nSaturday night to the tune of 56<br />\nshould be sent to the MANAGING EDITOR.<br />\nto 15. The 160 yard relay team<br />\ncomposed of Bahlke, Captain<br />\n100<br />\nHomewood<br />\nTelephone<br />\nDunning, Lord, and Welsh clipped 1 1-5 seconds off the former<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nrecord when they covered the disPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\ntance in 1 :21 3-5. Bahlke swam<br />\nManaging Editor<br />\nAdvertising Manager<br />\nthe<br />\n220 in 2:41 1-5, 1-5 of a secWILLIAM G. DEAN, JR., '24<br />\nA. J. MoKAY,'26<br />\nond faster than the former record<br />\nAssistant Managing Editor<br />\nheld by Peirce Coady. Bob Welsh<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nswam<br />\nthe 40 in 19 3-5 seconds,<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\nequaling<br />\nthe former record held<br />\nRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\n\"Davy\"<br />\nRowland.<br />\nby<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nBENJAMIN T. ROME, '25<br />\n*<br />\n* .<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nyard dash will be added to the Relay Carnival this year. Eric Liddell of Edinburgh University,<br />\nScotland, British 100 and 220 yard<br />\nchampion, will compete at the<br />\nPenn Relays. Liddell has run<br />\nthese events in 9 7-10 and 21 3-5<br />\nseconds respectively. Clarke and<br />\nLiddell ought to stage a great duel<br />\nin these events at the Relays.<br />\nHOPKINS-FIFTH REGIMENT MEET<br />\nDRAWING BIG ENTRIES<br />\nContinued from page 1<br />\n<br />\nCOLLEGIATE BOARD REINSTATES TEN MEN<br />\nOut of the twenty-eignt students that failed at the Johns Hopkins University ten have been reinstated. In the academic college eight men were fortunate<br />\nenough to be taken back, whereas<br />\nonly two engineers were permitted to re-enter. By reason of the<br />\nreinstatements the total number<br />\nof flunks has dropped to eighteen,<br />\nten from the academic and eight<br />\nfrom the engineering schools. It<br />\nis estimated that those who com1<br />\n2% of<br />\npletely failed comprise 2/<br />\nbody.<br />\nthe student<br />\n<br />\nversity, William and Mary, Richmond College, who is sending<br />\nTharpe, a half-miler, and Princeton.<br />\nFive teams are listed in the mile<br />\nrelay. Lafayette, Maryland, New<br />\nYork University, Navy and Richmond each having runners awaiting the pistol. Lafayette has two<br />\nstars in Mallich and McDonald, the<br />\nlatter titleholder in the Middle<br />\nStates quarter-mile. The Middies<br />\nwill have Hammond, Tobleman,<br />\nFoss and Shephard in this event.<br />\nTrophies will be awarded by sevJOHN T. DIXON, '24<br />\nCornell has taken the lead in<br />\nJunior Editors<br />\norganizations, including fratereral<br />\nC. EUGENE TOVELL,'24<br />\nARTHUR L. NELSON, '26<br />\nthe Intercollegiate Basketball<br />\nnities on the Hopkins campus.<br />\nOTHO J. KET.T.F,R, III, '26<br />\nERNEST A. STRATHMAN, '26<br />\nLeague by defeating PennsylALGER G. HISS, '26<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nThe alumni of the University of<br />\nEDWARD 0. MICHEL, '26<br />\nvania 17-14 in a hard fought game<br />\nT. STRAN SUMMERS, '25<br />\nYou'd be surprised at what<br />\nhave announced that<br />\nPennsylvania<br />\nJAMES YOUNG, '25<br />\nat Ithaca last Saturday night.<br />\nHEYWARD E. BOYCE, JR., '27<br />\nhe knows! He didn't learn<br />\nHENRY R. TURNBULL, '26<br />\nthree-legged<br />\ncup<br />\nwill<br />\ngive<br />\na<br />\nthey<br />\nit all in a book, either. For<br />\nThe \"Big Red Team\" has now<br />\nHAROLD S. GOODWIN, '26<br />\ninstance—his clothes are<br />\nwon three games and lost one. Co- to the Baltimore prep school scordreams and his grooming an<br />\ninspiration.<br />\nlumbia is in second place with ing the most points.<br />\nMember Southern Intercollegiate Newspaper Association<br />\nHe gets that finely turned-out<br />\nSpaulding sporting goods store<br />\ntwo victories and one defeat.<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nwill award a trophy in the 5,000<br />\n* * *<br />\nAt all drug stores and student<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nbarber shops.<br />\nLermond of Boston College, meter handicap.<br />\nEvery!`Vaseline\" product is<br />\nwho will compete in the 5,000 me- Phi Epsilon Pi fraternity will<br />\nrecommended everywhere<br />\nbecause of its absolute puinterscholastic<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 15, 1924<br />\nin<br />\nthe<br />\naward<br />\na<br />\ncup<br />\nter event at the Johns Hopkinsrity and effectiveness.<br />\none<br />\nmile<br />\nrelay.<br />\nFifth Regiment games, won the<br />\nCornell Alumni will award a<br />\nthree-mile run at the recent Millrose games in New York in the point trophy to prep schools in<br />\nALUMNI HOUSE-WARMING<br />\nfast time of 15 minutes, 2-5 of a Maryland. Baltimore City College<br />\nThe Dormitory house-warming on February 22 should stimulate second, defeating Freddie Wachs- already has two legs on this cup.<br />\nThe Civitan Club has announced<br />\nthe alumni into activity as nothing else could. A man who graduates ninth of the Glencoe A. C., naChesebrough Mfg.Co.<br />\nit will give a cup in the Collegiate<br />\ntional<br />\njunior<br />\nchamcross-country<br />\n(consolidated)<br />\nUnifrom Hopkins will never quite forget his student days. If the<br />\npion by 40 yards. Lermond, medley relay.<br />\nversity is mentioned, however, he will say, between puffs of a cigar: therefore, looms up as a formid\"Yes, it was a good old place. I'll have to go out some time and able opponent for our own Verne<br />\nlook it over.\" And he will resume his dictation to his stenographer Booth. The result of this race may<br />\nand will promptly relegate thoughts of his undergraduate life and have a direct bearing on the selections for the American Olymof Johns Hopkins to the deep recesses of his subconscious mind.<br />\npic team.<br />\n* * *<br />\nBut surrounded by scenes of undergraduate activity and viewing<br />\nFrom the Yale News<br />\nclassmates and comrades of college pranks close at hand, the alumnus, Hopkins dopesters on track<br />\nstaid old business man though he may be, will not be able to dismiss have picked what they consider<br />\nTHE NINETY-FOUR<br />\nleading<br />\nsuch thoughts so lightly. He will feel a little pang; he will uncover to be this country's ten<br />\nSomeone,<br />\nprobably an insurance<br />\nsprinters in the following order:<br />\nold memories; he will experience a certain sympathy for the student<br />\nrecently as saying<br />\nagent,<br />\nwas<br />\nquoted<br />\nLoren Murchison, Newark A. C.;<br />\nthat from the mass of one hundred<br />\nof today. Such a meeting cannot help but bring many graduates Charles Paddock, Los Angeles A.<br />\ncollege graduates one individual only<br />\ncloser to the university and closer to the undergraduate body.<br />\nC.; Alfred Leconey, Meadowbrook<br />\nrose to the Polo and butler class, perilously near the top of the financial ladClub;<br />\nHopLouis<br />\nClarke,<br />\nJohns<br />\nA more favorable opportunity for acquainting the alumni with<br />\nder. Five others became comfortably<br />\nFred<br />\nkins;<br />\nLovejoy,<br />\nNew<br />\nYork<br />\nthe fact that Hopkins is in dire need of a gymnasium and student<br />\noff and found themselves after twenty<br />\nactivities building could not be found. As we said recently our only A. C.; Eric Wilson, Iowa; Chesyears at the small yacht and chauffeur<br />\nter Bowman, Syracuse; Fred Tystage. The other ninety-four presumhope for obtaining such equipment lies in alumni support.<br />\nkle, Purdue; \"Boots\" Lever, Inably congregate in the great section of<br />\nIt takes but one man to start the ball rolling.<br />\nthe American people who drive their<br />\nsurance Company of North Amerown Buicks to the golf club. In other<br />\nica, and Francis Hussey, Stuyvewords, dreaming about being a rich<br />\nsant H. S., N. Y. In making out<br />\nman is one thing, and making the grade<br />\nWEALTH AND HONOR<br />\nthis list, the dopesters have taken<br />\nis something else again.\"<br />\nYet the ninety-four presumably work<br />\nWriting is distasteful to the average undergraduate; the very into consideration past performjust<br />\nas hard as the sumptuous six. Their<br />\nword possesses an unpleasant connotation. This, perhaps, is merely ances in both the 100 and 220<br />\nbusiness is the axis on which a small<br />\na result of compulsory, periodical themes which one faces through yard dashes. Woodring, IMillrose<br />\nand uninteresting world revolves. They<br />\nhave become devotees of the dollar<br />\nyears of grammar school, high school and college. \"Nothing is A. C., is omitted as he is primarily<br />\nand when that fickle deity deserts, have<br />\npleasant joined with a must.\" And writing, not very difficult in a quarter miler and has given up<br />\nnowhere else to turn. Jammed in a<br />\nitself, becomes extremely laborious and arduous under the influence running the 100. Whitman of<br />\ndull,<br />\nstraight rut of business they can<br />\nMichigan is a good performer in<br />\nof the imperative.<br />\nnever leave the road and jump the fence<br />\nthe century but has little ability<br />\ninto finer fields of life. This, then, is<br />\nIf a college man were told that he could not think coherently, in the 220. Hill, Pennsylvania, is<br />\nthe portion of ninety-four men out of<br />\nit is certain that he would resent the allegation. Yet writing is merely a promising sprinter who unevery hundred now on the campus.<br />\nthe process of transferring one's thoughts from the mind to paper. doubtedly will be heard from in<br />\nThe answer to the problem lies in<br />\nthe proper choice of a career.<br />\nThe difficulty of composition lies in the fact that thoughts are lacking. future meets.<br />\n* * *<br />\nIf one has ideas the task of expressing these should not prove<br />\nexhausting.<br />\nAmerica's best Olympic bet in<br />\nBetween now and Commencement<br />\nthe<br />\n1500<br />\nmetres<br />\nappears<br />\nto<br />\nbe<br />\nAn opportunity has been offered Hopkins undergraduates to write<br />\nwe shall have something to offer on<br />\nwithout feeling the pressure of the inevitable and malignant \"must.\" Lloyd Hahn, Boston A. A., who<br />\nthe subject of \"Careers.\" Watch for<br />\nDr. Hollander, a member of the Faculty, is again offering a substan- recently gave Joie Ray a bad<br />\nbeating<br />\nin<br />\na<br />\nmile<br />\nrun,<br />\nthe<br />\n2-3<br />\nof<br />\nthe space with the Famous Signature.<br />\ntial cash prize and a medal for the best contribution to the NEWSwithin 2-5 of a second of<br />\ncoming<br />\nLETTER by an undergraduate. We fear that many will be prevented<br />\nthe world's record for that disfrom entering the competition by the usual feeling, \"I can't write.\"<br />\ntance. This was the second time<br />\nAnd to these we reply:\"You can think; you can write.\"<br />\nthis season that Hahn has led Ray<br />\nTItJ,VA L<br />\nThe financial reward to be gained by the winner of the Hollander to the tape.<br />\nINSURANCE COMPANY<br />\nLIFE<br />\n* * *<br />\nPrize is not negligible. The honor attached is considerable. We<br />\nOF BOSTON. MASSACHUSETTS<br />\nwould suggest that those who can, as well as those who think they<br />\nThe athletic management at<br />\nPenn has announced that the 220<br />\ncan't, enter the contest.<br />\n<br />\nCI<br />\n<br />\nSOPHISTICATED<br />\n<br />\naseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nChoice of a Career<br />\n<br />\n1.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 15, 1924<br />\nCOLLEGE ATHLETICS SUP- PRESIDENT OF UNIVERSITY JUNIOR-SENIOR DEBATE TO<br />\nOF MICHIGAN CONDEMNS<br />\nPORTED BY FOOTBALL<br />\nBE HELD TONIGHT IN<br />\n\"COLLEGE BABBITS\"<br />\nRECEIPTS<br />\nC. E. HALL<br />\n\"What has the college become?<br />\nThe only paying sport at the<br />\nAt 8 o'clock this evening in the<br />\nIt has become a thing of rushing<br />\nPenn State University is football,<br />\nrabbles, jazz orchestras, pep meet- Civil Engineering Hall, the teams<br />\nwhich during the last year netted ings, frolics, hops and schedules of the Junior and Senior classes<br />\n$150,000. In addition to this fitted to make the second show at will debate the subject, \"Resolved,<br />\namount, $21,000, the university's the movies. The rushing rabble that the United States should enshare in the Pasadena game with is inevitably driven away from Ler the World Court.\" The Senior<br />\nSouthern California on January 1, the spirit of higher learning and representatives — William Gross,<br />\nour object is lost. In every home<br />\nhas been contributed to the aththe powerful man of business is Frederick Moehle and John Croletic association building 'fund the hero of the<br />\nker—will uphold the affirmative;<br />\nday.<br />\nwith a $100,000 pledge made by \"What we have done is snuffed the Junior team—Sydney Cone,<br />\nthe alumni. New land for a uni- out our inner life. Democracy is Jerome Shapiro, Elmer Mylander,<br />\nYouth has and Gordon 'Post, alternate—will<br />\nversity golf course cost $11,000, partly responsible.<br />\ngot<br />\nthe<br />\nimpression<br />\nit might go<br />\nwhile the intra-mural construction<br />\ntake the negative.<br />\nwith the crowd. It must be popprogram called for an additional<br />\nular.<br />\nIt has become terribly<br />\nThe judges for the debate have<br />\n$6,000. Besides the $100,000 alumafraid of being different. It has not been announced. According<br />\nni fund, which will be used prinbeen tremendously externalized to custom,<br />\none member of the<br />\ncipally in the erection of a new and<br />\nobjectified. . . . Students<br />\nfaculty,<br />\none alumnus, and one<br />\ngymnasium, $10,000 has been re- must<br />\nhave a sense of integrity and<br />\nceived for equipment in this the<br />\ncourage of their convictions. prominent citizen, will be on the<br />\nbuilding for the women students.<br />\n. . . When in American civ- committee.<br />\n—Exchange. ilization it comes to pass that the<br />\nThere will be no charge for adfamily which raises a poet, a sci- mission.<br />\nentist, or a teacher will be as<br />\nWESTINGHOUSE COMPANY proud as if he were a financial<br />\nDROPPING A \"LINE\"<br />\nHAS EXCELLENT LABgenius, then you can put religion<br />\nORATORY FOR TESTS<br />\nas a vital factor in American col- Jackie, Jo, Jane, and Jess,<br />\nIn visiting the High Voltage Lab- leges.\"<br />\nMargie, Martha, Mae;<br />\nThis is part of the speech of —Ought to find my mailbox full<br />\noratory of the Westinghouse Company, the delegates saw one of the President Marion S. Burton of<br />\nAlmost ev'ryday!<br />\nfinest laboratories of its kind in the the University of Michigan at the<br />\nworld. The laboratory contains tenth annual meeting of the As- Lois, Lucy, 'Lis'beth, Lou,<br />\ntwo mammoth transformers, one sociation of American Colleges<br />\nBillie, Beth, and Bea,<br />\nhaving a rating of 1,000,000 volts, held two weeks ago in Manhattan Add their scented letters<br />\n1,000 kv-a. Other million-volt sets as quoted in \"Time\" under the<br />\nAnd await returns from me.<br />\nuse two or more transformers to heading \"College Babbits.\"<br />\nproduce this supervoltage. There<br />\nOf interest to faculty members Elsie, Ethel, Eve, and Ede,<br />\nis also a half-million volt trans- is another paragraph in the same<br />\nAileen,. Agnes, Al,<br />\nformer in the laboratory, which is article.<br />\nTake their turns at writing,'<br />\nused for making smaller tests. The \"Dr. C. A. Richmond, president<br />\nAnd likewise Sue and Sal.<br />\ncontrol equipment is an outstand- of Union College, endeared himing development in the electrical in- self to all college instructors by Don't you think I'm popular?<br />\ndustry. The complete transformer speaking against the raising of<br />\nWhat a line I shoot!—<br />\nequipment with switches, motors their salaries. He said that teach- No, I'm just the postman<br />\nand generators is directly under the ers should have a missionary spirOn a co-ed college route!<br />\nhand of a single operator stationed it and to insure this they must be<br />\n—Lord Jeff.<br />\nat the laboratory. The remote con- paid less than they are worth.\"<br />\ntrol is used throughout to eliminate<br />\nany possibility of accident through<br />\nREPORT OF STUDENTS ACTIVITIES COUNCIL<br />\nhandling these high voltages. A<br />\nFebruary 12, 1924<br />\nsystem of horns warns everyone<br />\nBalance<br />\nwhen to expect the tes-t, and in this Student Activities Council<br />\nCash<br />\nreceived<br />\n$627.14<br />\nway, also, danger of accidents is<br />\nCash disbursed<br />\n372.40<br />\nminimized.<br />\n$254.74<br />\nNews-Letter<br />\nPRUlTERS<br />\nEUGRAUERS<br />\nBIRDERS<br />\nCash received<br />\n$1,262.24<br />\nCash disbursed<br />\n1,257.65<br />\n4.59<br />\nBlack and Blue Jay<br />\nCollele Literature<br />\nCash received<br />\n$1,386.45<br />\nCash disbursed<br />\n974.07<br />\n412.38<br />\nHullabaloo<br />\nCash received<br />\n$1,410.92<br />\nCash disbursed<br />\n137.82<br />\n1,273.10<br />\nDaily Bulletin<br />\nCash received<br />\n$99.90<br />\nCash disbursed<br />\n11.00<br />\n88.90<br />\nBarnstormers<br />\nCash received<br />\n$1,068.47<br />\nCash disbursed<br />\n267.69<br />\n800.78<br />\nDebating Council<br />\nCash received<br />\n$342.52<br />\nCash disbursed<br />\n14.75<br />\nPrinters of<br />\n327.77<br />\ncrhe Johns Hopkins<br />\nMusical Club<br />\nCash received<br />\n$548.47<br />\nNEIDS.-LETTER<br />\nCash disbursed<br />\n372.20<br />\n176.27<br />\nY. M. C. A.<br />\nLOMBARD and SOUTH STREETS<br />\nCash received<br />\n$970.64<br />\nCash disbursed<br />\n737.63<br />\n233.01<br />\nCollege and Fraternity Stationery<br />\nBand<br />\nBanquet and Dance Cards, Invitations<br />\nCash received<br />\n$238.28<br />\nJAS. H. DOWNS<br />\nCash disbursed<br />\n203.07<br />\nENGRAVER PRINTER STATIONER<br />\n35.21<br />\n229 N. CHARLES ST.<br />\n<br />\n—<br />\n<br />\n$3,606.75<br />\n<br />\n3<br />\n<br />\nri<br />\n<br />\nThe man who buys a Stetson because of its style later discovers<br />\nthe long wearing qualities which<br />\nmake Stetson the choice of well<br />\ndressed men—everywhere.<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\n\"A cap as good as the cream\"<br />\nHigh praise for Williams Shaving Cream is contained in<br />\nthis suggested slogan for the Hinge-Cap. Yet truly, the<br />\ncombination offaster beard-softening,elimination ofrazor<br />\nfriction through lubrication of the skin, and the extraordinary care of the skin which Williams gives,has never<br />\nbeen equalled by any other shaving cream. And Williams<br />\nis a pure product, absolutely without coloring matter!<br />\nBegin on a tube—compare it in every way.<br />\n<br />\n$250 in. Prizes<br />\nFor the best sentence of ten words or less on the value of the<br />\nWilliams Hinge-Cap, we offer the following prizes: 1st prize<br />\n$100; 2nd prize $50; two 3rd prizes, $25 each; two 4th prizes,<br />\n$10 each; six 5th prizes, $5 each. Any undergraduate or<br />\ngraduate student is eligible. If two or more persons submit<br />\nidentical slogans deemed worthy of prizes, the full amount of<br />\nthe prize will be awarded to each. Contest closes at midnight<br />\nMarch 14, 1924. Winners will be announced as soon thereafter as possible. Submit any number of slogans but write<br />\non one side of paper only, putting name, address, college and<br />\nclass at top of each sheet. Address letters to Contest Editor,<br />\nThe J. B. Williams Co., Glastonbury, Conn.<br />\n<br />\nThis is the new Hinge-Cap<br />\n<br />\nWilliams<br />\nShaving Cream<br />\n<br />\nDe<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\nThe Greetings ofa Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD.KOHN 8c Co.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 15, 1924<br />\n<br />\n4<br />\n<br />\nALWAYS USE A<br />\ntigating committee shall be acLIBERTY ST.<br />\ncepted or rejected by a majority<br />\nYELLOW CAB<br />\nAT SARATOGA<br />\nvote of the board, the accused fraOR PHONE<br />\nternity having no vote, and upon<br />\nLUNCHEON<br />\nVERNON 1212<br />\nthe decision of the board a trial<br />\nTEA<br />\nHAIL THEM ANYWHERE<br />\nshall be instituted.<br />\nDINNER<br />\nSec. 3. The trial shall be held<br />\nArt. II. Sec. 1. The membernot sooner than one week after<br />\nship of the Interfraternity Board<br />\nSPECIAL PARTIES<br />\nA. JACOBS & SONS<br />\n11.30 A. M.<br />\nthe report of the investigating<br />\nshall consist of one Junior and<br />\nuntil<br />\nTailors<br />\ncommittee.<br />\nPLAZA 6987<br />\n7.30 P. M<br />\none Senior delegate from each<br />\nUniforms and Liveries<br />\nWe want a live wire salesman<br />\nof<br />\nmembers<br />\nsenior<br />\nThe<br />\n4.<br />\nSec.<br />\nfraternity upon the board, or in<br />\n128 W. FAYETTE ST.<br />\nthe board shall sit as a court dur- to represent us on the campus.<br />\nOne who wishes to make some<br />\nBaltimore, Md. the future to be admitted to the<br />\nNear Liberty St.<br />\ning the trial, and the chairman easy money putting in a few<br />\nBoard.<br />\nof the Student Affairs Commit- hours of spare time—interviewing<br />\nSec. 2. Petitioning locals must<br />\ntee, or someone appointed by him, -profs- and students—to sell<br />\npass through a period of probation<br />\nshall act as presiding officer, Ford Cars. To the right man we<br />\nof three years, during which time<br />\nwithout a vote. The investigat- have a regular position when colthey shall obey the regulations<br />\nCall immediately at<br />\ning committee shall prosecute the lege closes.<br />\n325 Park Avenue. Ask for Mr.<br />\nand rules of the board, and shall<br />\ncharges.<br />\nLong or Mr. Watson.<br />\n11.& OSCAR G•1-5•<br />\nbe represented thereon without<br />\nboth<br />\non<br />\nevidence<br />\nAfter<br />\n5.<br />\nSec.<br />\nOWNERS<br />\nthe power to vote, before they<br />\nand ar‘k<br />\nrilf1/4/t<br />\n'itiz.z*\"1•<br />\ncan be admitted to active mem- sides has been presented<br />\nshall<br />\nbe<br />\nvote<br />\na<br />\nclosed,<br />\nguments<br />\nE. BALTIMORE ST.<br />\n29<br />\nBoard.<br />\nthe<br />\non<br />\nbership<br />\nLimited<br />\ntaken. If two votes are cast for<br />\nAgents for JOHN B. STETSON HATS<br />\n325 PARK AVENUE<br />\nSec. 3. National fraternities in<br />\nand FRATERNITY BANDS<br />\nacquittal the charges shall be disshall<br />\nbe<br />\nadmitted<br />\nstanding<br />\n(-rood<br />\nA<br />\nCAFETERI<br />\nBARN<br />\nmissed. The accused fraternity<br />\nto full standing as soon as a bona<br />\nshall have no vote.<br />\n,fide chapter has been established<br />\nSec. 6. When a fraternity, after<br />\nand have passed through one rushORDERS RECEIVED FOR<br />\nbeen<br />\ning season, observing the rules of the prescribed trial, has<br />\nimbe<br />\nshall<br />\nfound guilty, a fine<br />\nCOGGINS'<br />\nthe Interfraternity Board.<br />\nexceed<br />\nposed by the judges, not to<br />\nTransfer & Baggage Express<br />\nArt. III. The officers shall con$100.00. The fine shall be deductsist of a president and a secretaryAUTOMOBILE SERVICE<br />\ned from the bond deposited by<br />\nPHONE, HOMEWOOD 6886<br />\ntreasurer, and shall be elected at<br />\n13 SOUTH ST.<br />\nthe guilty fraternity.<br />\nthe last meeting of the Board in<br />\nVIII. All questions of inArt.<br />\nThe Flag, Banner & Pennant Shop each college year. Each delegate terpretation of the constitution,<br />\nshall have one vote in an election<br />\n(Successors to Sisco Brothers)<br />\nJohn J. Nelligan, President<br />\nOrganized 1864<br />\nby-laws and Rushing Agreement<br />\nFlags, Banners, Pennants, Arm Bands, of officers.<br />\nSchools,<br />\nfor<br />\nBanners<br />\nEmblems, Silk<br />\nshall be made by a two-thirds vote<br />\nSocieties and Fraternities<br />\nArt. IV. The purpose of the of the fraternities upon the board.<br />\n302 PARK AVE., BALTIMORE, MD. Board shall be to regulate and<br />\nR. H. Taylor<br />\nVernon 2355<br />\nBy-Laws<br />\ncontrol interfraternity relations at<br />\nbe no prep-school<br />\nshall<br />\nI. There<br />\nthe University, and in so far as<br />\npossible to promote better feeling rushing.<br />\nII. Regular meetings shall be<br />\nbetween the fraternities.<br />\nArt. V. Sec. 1. In all matters held once each week, upon a speexcept election of officers, each cified date. Absence from a meetchapter shall have but one vote. ing shall incur a fine of $1 upon<br />\nMEN'S SHOES<br />\nCorner c\"Jayelle and Aztaw Sts.<br />\nthe absent fraternity.<br />\nSec. 2. A two-thirds vote of the<br />\nOf the Better Class<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nfraternities at any regular meeting<br />\nDORMITORY DENIZENS WILL HOLD<br />\nmoany<br />\npass<br />\nto<br />\nsufficient<br />\nshall<br />\nbe<br />\nURNER BROTHERS<br />\nELECTION<br />\ntion or provision except a Rushing<br />\nContinued from page 1<br />\n111 E. BALTIMORE STREET<br />\nAgreement or amendments to the<br />\nBaltimore<br />\npublication of the results of the<br />\nconstitution and by-laws.<br />\nexaminations; and one<br />\nmid-year<br />\nSec. 3. The Rushing Agreeby the manager of<br />\nchosen<br />\nman<br />\nis<br />\nEstablished 1873<br />\nment and constitutional amendto represent the<br />\nDormitory<br />\nthe<br />\nments shall be referred to the<br />\nA. H. FETTING MAN'FG<br />\npermanently.<br />\nusually<br />\nmanagement,<br />\nJEWELRY CO.<br />\nchapters and an affirmative vote<br />\nis guarcommittee<br />\nstable<br />\nvery<br />\nManufacturers<br />\nand individuality is offered here at prices that are not<br />\nfrom all, save one, shall be neces- A<br />\nGreek Letter Fraternity Jewelry<br />\nelection,<br />\nof<br />\nmethod<br />\nthis<br />\nby<br />\nanteed<br />\nand cannot be underquoted by any house at any time.<br />\nsary for acceptance.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nare<br />\nwho<br />\nmen,<br />\nthree<br />\nprovides<br />\nwhich<br />\nSec. 4. In case of failure to<br />\n11.. Besides the reputation of an old-established firm<br />\nthe work and duties<br />\n.14,44 4014 R4 114 1141101414 114 114,11:4,11.4,114.114.1R1.1411.14:1141114,11.4'11.4$141I0I4' agree upon a Rushing Agreement well versed in<br />\nis back of each sale with a guarantee.<br />\nfor<br />\nfor the coming year, the agree- of the committee, as a nucleus<br />\nman<br />\nment adopted for the preceding the new body. For example, a<br />\nthe<br />\nuntil<br />\nserves<br />\nin<br />\nFebruary<br />\nchosen<br />\nyear shall remain in force.<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nman<br />\na<br />\nwhile<br />\nFebruary,<br />\nfollowing<br />\nArt. VI. A bond of $100.00<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nwill<br />\nOctober<br />\nlast<br />\nwas<br />\nelected<br />\nwho<br />\nshall be deposited by each fraternity and each probationary mem- end his term next October. A full<br />\nOTO<br />\nber on the Board, and fines for committee will be at hand, there\"The King of Lubricants\" breaches of the Rushing Agree- fore, every October to start off the<br />\nment shall be deducted from this new men in the Dormitory in good<br />\nshape.<br />\nsum.<br />\nSHERWOOD BROTHERS, INC.<br />\nIf any money is deducted from<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nNgmuggg:g=1,1,,NgmTflriNINMCiEl=0 this bond, a sufficient sum shall SCHOOL OF HYGIENE HEARS PUBPROGRAM FOR STUDENTS<br />\nLIC HEALTH TALK<br />\nat once be deposited by the fraContinued from page 1<br />\nBIBLE CLASS, 10 A. M.<br />\nternity fined to make the total of<br />\nAn Interesting Discussion of<br />\nthis phase of public health, collectBoys, the place to get your<br />\nthe bond again $100.00.<br />\nVital Topics Under<br />\nhis work in Canada. The<br />\nduring<br />\ned<br />\nfor<br />\nof<br />\ntrial<br />\nform<br />\nVII.<br />\nThe<br />\nArt.<br />\nmeals—and they are honDR.<br />\nA. KELLY, Leader<br />\nHOWARD<br />\nbeen<br />\nhas<br />\nfraternities accused of breach of extent to which this work<br />\nest-to-goodness meals, well<br />\nother<br />\nthe Rushing Agreement shall be carried on in Toronto, and in<br />\nYOUNG PEOPLES AT-HOME<br />\nserve d, and reasonably<br />\nCanadian cities, compared with simas follows:<br />\n5-7 P. M.<br />\nat<br />\npriced—is<br />\nSec. 1. When a fraternity is ac- ilar work in America, was strikTEA SERVED AT 6 O'CLOCK<br />\ncused of breaking the agreement, ingly given. The health official said<br />\nvispurpose,<br />\nof<br />\ndetermination<br />\nthat<br />\nthe President of the Board shall<br />\nEPWOR1 H LEAGUE<br />\nappoint a committee to investi- ion and the ability to enlist munici7-8 P. M.<br />\ngate the charges. This commit- pal support to carry out his knowlthe<br />\nfor<br />\nrequisites<br />\nprime<br />\nare<br />\nedge<br />\ntee shall make a complete survey<br />\nSPECIAL STUDENTS AT-HOME<br />\nof the evidence, and at the next municipal health officer. Decreased<br />\n1817 N. Charles St.<br />\ninparticularly<br />\nFEBRUARY 17<br />\nmeeting shall recommend to the rates of mortality,<br />\n(Half Block below North Ave.)<br />\nBoard either the prosecution or fant mortality, were shown to be<br />\nCOME DOWN AND<br />\nthe result of increased expenditure<br />\ndismissal of the charges.<br />\nGET ACQUAINTED<br />\nNicholas Brown, Mgr.<br />\nAt the Washington Monument<br />\nSec. 2. The report of the inves- for public health work in Toronto.<br />\n<br />\nINTERFRATERNITY BOARD<br />\n<br />\nSHIRT MAKER<br />\nCONSTITUTION<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\n(Reprinted by Request)<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nArt. I. The name of the organiTerms Cash, Less 10% 30 days on Shirts<br />\nzation shall be \"The Johns HopAlso a Full Line of Men's<br />\nFurnishings<br />\nkins Interfraternity Board.\"<br />\n<br />\nSTRATTON<br />\n<br />\nV<br />\n<br />\nSALESMAN:<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nLU'eXatteriv<br />\n‘LANits<br />\n<br />\nC. A. GOODWIN<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nURNER'S<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nila<br />\n<br />\n- OHM<br />\n12<br />\n<br />\nMount VernonPlaceM.E.Church<br />\n<br />\nThe Si. REGIS<br />\nRESTAURANT<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\n<br />\n,<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nVERY IMPORTANT!<br />\n<br />\nBE A NEWSPAPER CORRESPONDENT<br />\n<br />\nRehearsal of Barnstormers' Club tonight at 7.30 P. M.<br />\nat the Barn.<br />\nAll members of the Club and candidates for the Cast<br />\nand Art and Property Staffs are requested to be present.<br />\n<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nexperience tinnecessary; no canvassing; send for particulars.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nBuffalo, N. Y.<br />\n<br />\nJi<br />\n<br />\n\f", "format": "basic_html", "processed": ";<br /><br />\nVOL. XXVIII, No 33<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 15, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nMUSICAL CLUB PUTS TICK- HOUSE WARMING TO RE- BOWERY BALL PROMISES HOME OF TUDOR-STUART HOPKINS - FIFTH REGIMENT<br />\nPLACE ANNUAL ALUMNI<br />\nSUCCESS. MANY ALUMNI<br />\nETS ON SALE FOR ANNUCLUB NEARING COMMEET DRAWING BIG<br />\nBANQUET<br />\nAL HOME CONCERT<br />\nTO BE PRESENT<br />\nPLETION<br />\nENTRIES<br />\nConcert on Feb. 21 at Md. Casualty Reorganization of Present Alumni As- Committee Considering Raising the Furniture Patterned After Tudor-Stu- Medley Race to Be Interesting Event.<br />\nsociation Planned. New Officers<br />\nTicket Limit from 75 to 85<br />\nClub House Expected to Excell<br />\nart Period. Club's Room a Gift<br />\nTrophies Announced by SevLikely to Be Announced<br />\nLast Year's. Formal Dance Follows<br />\nof Mrs. Robert Brewster<br />\neral Organizations<br />\nThe Bowery Ball is going to be<br /><br />\nTo take the place of the Annual good. Not to exaggerate, it will be<br />\nPreparations for the big annual<br />\nLocated on the third floor in the<br />\nAlumni Banquet, which is held on better than that. No social affair southeast corner of Gilman<br />\nHall indoor games and athletic meet at<br />\nthe evening of Commemoration at Hopkins in the mind and memthere is a room which is rapidly the Fifth Regiment Armory are goDay, February 22, there will be a ory of the oldest grad or the younging ahead with plenty of enthusigood old-time House Warming est freshman has ever had its full assuming an appearance of dignity asm. Entry blanks were mailed<br />\nheld at the Memorial Dormitory. limit of tickets sold over a week and beauty. In strange contrast out some time ago to several hunSince the days of Volstead these in advance of the date of the af- to the long corridors echoing with dred schools and colleges and the<br />\nfamous banquets of the Johns fair. This is the true status of the voices and the trampling of feet, returns are coming in at a rapid<br />\nHopkins Alumni have been grow- situation confronting the Bowery this favored room, though at pres- rate.<br />\ning less interesting each succes- Ball Committee at present. Chair- ent strewn with the rubbish of<br />\nSome of the best known teams<br />\nlasive year and fewer alumni have man Gump and his assistants,<br />\nConcert Begins Festivities<br />\nin<br />\neastern intercollegiate circles<br />\nUr- bor, already possesses a sort of<br />\nThe Musical Club Concert been attending.<br />\nner, Willison and Wales, are com- sedate peace. -With<br />\nare<br />\nexpected and many have notiits great oak<br />\nstarts what may be called \"the<br />\nThe officers of the Alumni As- pelled to turn down men who want<br />\npanelled walls, its brown cur- fied the athletic office that teams<br />\nmid-winter frolic.\" The concert sociation have sought a remedy to attend the Ball. The committee<br />\ntains, draping three windows gen- and individuals will be entered.<br />\nwill be held on Thursday night, for this gradual falling off of at- is seriously considering raising<br />\nthe erous with their light, this future<br />\nRobertson to Referee<br />\nthe Commemoration Day exer- tendance and have substituted the ticket limit from 75 to<br />\n85, although home of the Tudor-Stuart Club is<br />\nThe latest announcement of ito<br />\ncises on Friday, the Alumni House Warming.<br />\nInvitations this is inadvisable, due to lack of<br />\nalready pervaded with an atrnoc..- - portance is the acceptance of LawHousewarming on Friday, the have been sent out to 2,407 grad- floor space<br />\nin the hall.<br />\nphere suggestive of learned asso- son Robertson, coach of track at<br />\n\"Bowery Ball\" of the Junior class uates, asking them to attend the<br />\nVery unique favors have been ciations.<br />\nthe University of Pennsylvania and<br />\non Friday evening, and the An- meeting and maintain their old in- procured for<br />\nthe affair. After<br />\nThe furnishings' of the room are coach of the American Olympic<br />\nnual Hopkins-Fifth Regiment In- terest in the University. The en- some<br />\nconsiderable discussion the in harmony with the Tudor-Stu- team to be referee of the meet.<br />\ndoor Games on Saturday. A plan tire Alumni have been invited, choice<br />\nwas made and it is expected art period; Extending along the Mayor Howard Jackson of Baltifor further mid-year social activity while formerly those present were that<br />\nthe favors will arouse a great entire eastern side of the room more will be honorary referee,<br />\nit<br />\nto be held over a week-end was only the members of the Alumni<br />\ndeal of admiration and approval.<br />\nis a sill under which are two ra- was announced.<br />\nformulated by the Junior Class Association. Plans will probably<br />\nChairman Gump has desired to diators cleverly hidden by artistic<br />\nIncluded in the events is the<br />\nbut was abandoned at the sugges- be announced regarding the new<br />\nhave it clear that all persons at- latticework. The furniture which medley relay between<br />\nHopkins,<br />\ntion of the Student Council so as organization of the Alumni Assotending the Ball must come attired has recently arrived is of walnut, University of Pennsylvania,<br />\nNavy,<br />\nnot to interfere in any way with ciation.<br />\nin the spirit of the occasion. Ques- and consists of eight -Windsor University of<br />\nPittsburg,<br />\nBoston<br />\nJune -Week activity.<br />\nContrary to the custom of for- tion<br />\nhas arisen as to what the girls chairs, four cushioned chairs, two College and Georgetown UniverAttractive Program Planned<br />\nmer years, long speeches will not<br />\nmay wear. The committee suggests round tables, one long table, the sity. The Georgetown<br />\nteam has<br />\nMany \"collegiate\" numbers be in order. There will be short<br />\nthat plaid or calico dresses, blue legs of which are fantastically dec- two good quartets,<br />\nand<br />\nit is exwill adorn the program. The addresses by President Goodnow,<br />\nsweaters, tams, noisy hosiery and orated, and several table lamps pected that they will bring<br />\ntheir<br />\nnumbers of the Glee Club will be Dr. Weed, the new Dean of the<br />\nany kind of shoes will be in order. with dark green shades. The best team and<br />\nthe team used at<br />\nclassical while the Banjo Club Medical School, and Mr. George<br />\nMen will come in knickers, sweat- western or inner wall of the room the Millrose games<br />\nin New York<br />\nwill play a combination of favor- Knapp, retiring President of the<br />\ners, shoes, vests, derbies, caps and is taken up by huge book cases on January 30 when<br />\nHopkins lost<br />\nite and popular selections. The present Alumni Association. The<br />\nchecked socks. The least sugges- extending from floor to ceiling. A to them and to Boston<br />\nBlue Jay Six can be relied upon new officers for the year of 1924College.<br />\ntion of formal dress will be suffi- beautiful fireplace of Italian mar- The first team is<br />\nmade up of Dowto furnish an excellent number. 1925, who have been elected by<br />\ncient to give the official bouncers ble is located in the southwest ding in the 220, Ascher<br />\nSolo numbers will also be given a mail, will be announced at this<br />\ndoing the<br />\ncorner. The room, though but a<br />\nexercise.<br />\n440 dash, Marsters in the 880 and<br />\nplace on the program—a piano meeting. Musical numbers will<br />\nrough sample of what it will be,<br />\nSullivan the mile man.<br />\nsolo, violin, banjo, xylophone and be rendered by the Johns HopFRESHMAN<br />\nSMOKER<br />\nTO has already attained a certain<br />\nsaxophone solos. The Quartette kins Musical Club. The food for<br />\nNavy expects to have entries in<br />\nTAKE PLACE TONIGHT<br />\nquality of beauty.<br />\nevery<br />\nis expected to have several pieces the House \"Warming will be supevent in the Hopkins games.<br />\nAT SOUTHERN<br />\nThis delightful room has been<br />\nready for presentation.<br />\nplied by the kitchens of the Dor- First Attempt of Freshmen to Hold<br />\nPenn State Sends Stars<br />\nmade possible through the genLast year's concert attracted mitory.<br />\nSocial Function<br />\nPennsylvania<br />\nState<br />\nCollege's<br />\nAll of those members of the erous donation of Mrs. Robert<br />\nThe two primary purposes of<br />\nmuch attention in musical circles<br />\ncrack two-mile relay team, holder<br />\nBrewster<br />\nof<br />\nNew<br />\nYork<br />\nCity,<br />\none<br />\nof Baltimore because of its excel- the House Warming will be to Class of '27 who survived their iniof the original honorary members of the world record for that dislence. This year's concert is ex- put on a drive for new members tial examinations will have ample<br />\ntance, has been invited. This track<br />\nof the Tudor-Stuart Club.<br />\npected to be even better. The for the Association and to give opportunity for celebration when<br />\nbunch is made up of Helfrich, namost prominent people of Balti- the Alumni an opportunity to in- the class smoker is held this eventional<br />\nhalf-mile champion; Enck,<br />\nmore have been requested to be spect the Memorial Dormitory ing. The Southern Hotel is to be SCHOOL OF HYGIENE HEARS<br />\nnational<br />\ncollegiate champion in the<br />\nPUBLIC HEALTH TALK<br />\npatronesses and the majority of which they officially presented to the scene of the festivities.<br />\nmile;<br />\nCarter<br />\nand Egerton, both<br />\nThe smoker will be the first at- Dr. Hastings, of Toronto, Lectures on<br />\nthose asked have accepted. Many the University last June.<br />\nspeedy<br />\ntrackmen.<br />\nNavy's twothe Economic Aspect of<br />\ntempt of the Freshmen to sponsor<br />\ncritics pronounced last year's conmile quartet includes Newhall,<br />\nPublic Health<br />\ncert on a par with Dartmouth's DORMITORY DENIZENS WILL harmony among the members of<br />\nOne of the foremost authorities Tammany, Shephard and Carpenthe class through the medium of a<br />\nConcert, given in Baltimore last<br />\nHOLD ELECTIONS<br />\nter. Carpenter captured the 600December: Dartmouth's club last Mass-meeting Monday Night, February social activity, and the committee on public health in Canada was<br />\nyard<br />\nnovice race last year.<br />\nhas spared no effort to make the heard at Johns Hopkins when Dr.<br />\nyear won the Intercollegiate Mu18. Novelty Acts and Musical<br />\nPrep<br />\nschools and high schools<br />\nNumbers on Program<br />\naffair a memorable event. A pro- Charles J. Hastings, of the Departsical Title.<br />\nhave<br />\nmade big demands on the enment of Public Health, Toronto,<br />\nDance An Added Feature<br />\nThe men of the Alumni Memor- gram that ranges from musical rentry<br />\nblank<br />\nsupply. Fork Union and<br />\nOntario,<br />\nspoke<br />\nat<br />\nSchool<br />\nthe<br />\nof<br />\nFollowing the Concert a dance ial Dormitory will hold the first dition of varied sorts to speeches<br />\nLawrenceville<br />\nare two prominent<br />\nHygiene<br />\nPublic<br />\nand<br />\nHealth<br />\nMonwill be held in the Ballroom. The mass-meeting of the year on Mon- by eloquent members of the class<br />\npreps.<br />\nAn<br />\nattempt<br />\nis being made<br />\nday,<br />\nFebruary<br />\n11.<br />\nThe<br />\naddress<br />\ndance is an added _ feature of at- day night, February 18, immediate- promises to give the participants a<br />\nto<br />\nput<br />\nthese<br />\ntwo<br />\nschools<br />\nin a relay<br />\nwas<br />\none<br />\nseries<br />\nof<br />\na<br />\na<br />\nlectureship<br />\nin<br />\ntraction and is comparable to a ly after dinner. The purpose of real treat.<br />\ntogether.<br />\nFifteen<br />\ncolleges<br />\nhave enestablished<br />\nCount<br />\nDe<br />\nby<br />\nLamar<br />\nin<br />\ncotillon. It is customary for the the meeting is to gather all the men<br />\nTom Landy, coach of the Freshtered<br />\nin<br />\nrelay<br />\nraces<br />\nbut<br />\nhave<br />\nnot<br />\nthe<br />\ninterests<br />\nhygiene,<br />\nof<br />\nwhich are<br />\nClub to give a dance after their together for the February elections man football team, and the entire<br />\nbeen<br />\nmatched.<br />\ngiven throughout each scholastic<br />\nconcerts<br />\nto the House Committee. Further Freshman team will be guests of<br />\nAdditional color has been given<br />\nyear at Hopkins.<br />\nAn elaborate system of adver- interest will be added to the meet- honor. Class numerals<br />\nwill be prethe<br />\nmeet by inviting the best disDr. Hastings spoke on a subject<br />\ntising the concert has been put ing by several novelty<br />\nacts and sented to the football men by Prestance<br />\nmen in the country to cominto effect. Four hundred of the musical numbers.<br />\nident Niner. Schwinn, chairman of of general, as well as technical, inpete<br />\nwith<br />\nBooth in the 5,000 meter<br />\nterest—\"The Economic Aspect of<br />\nstandard black and blue posters<br />\nAccording to the constitution the Committee on Arrangements,<br />\nevent. A sprint race has been arPublic<br />\nof the Club advertising \"a real colHealth.\"<br />\nHe<br />\ndeclared<br />\nthat<br />\ndrawn up for the government of will preside as toastmaster.<br />\nthe field of public health was one ranged for all girl athletes of A. A.<br />\nlege party\" have been placed<br />\nThe program will be concluded<br />\nthe Dormitory by the House Comaround the city, while in many<br />\nwhich would, by its extension, pro- U. standing. Invitations have been<br />\nmittee, the elections for the mem- with a fitting memorial in commemprominent places pictures of the<br />\nvide a definite economic saving to extended to all Y. M. H. A. athbers of the governing body, the oration of those late members of<br />\nClub have been posted. Articles<br />\nthe country, as well as adding letes to compete in a relay between<br />\nthe class who are no longer on the<br />\nare appearing in the daily papers House Committee, are held twice<br />\nphysical betterment of the race as representative teams from New<br />\nrolls of the University.<br />\nas a result of the work of the Pub- a year. Men are elected to the<br />\na whole. The conservation of hu- York, Philadelphia, Washington,<br />\ncommittee for a term of one year<br />\nlicity Board.<br />\nman life, he declared, was of the Norfolk and Newport News.<br />\nfrom the time they are chosen.<br />\nTickets at Albaugh's<br />\nNOTICES<br />\nutmost importance, probably higher<br />\nMany Schools Represented<br />\nThe committee, which consists<br />\nNon-athletic cards may be reMeeting entire staff of<br />\nthan any other single factor in ecoIncluded in the schools which<br />\nNews-Letter, today, 12.20.<br />\ndeemed any noon at the Barn for of seven men, is made up as folnomics, and one in which further have written for information and<br />\na ticket which in turn is ex- lows: three men are elected in Ocresearch by economists might well blanks and who, it is thought, will<br />\nNon-athletic tickets may<br />\nchanged at Albaugh's for a re- tober within ten days after the first<br />\nbe given.<br />\nbe here, are: West Virginia, Labe redeemed for Musical<br />\nserved seat. Extra tickets may be day of classes; three men are electDr. Hastings presented some in- fayette, New York University,<br />\nClub concert ticket at the<br />\neither purchased at the Barn or ed in February, ten days after the<br />\nBarn at noon.<br />\nteresting and authoritative data on Massachusetts Tech, Alfred Unidirect at Albaugh's Ticket Office.<br />\nContinued on page 4, col. 3<br />\nContinued on page 4, col. 3.<br />\nTickets have been placed on<br />\nsale for the Annual Home Concert<br />\nof the Musical Club, which will be<br />\npresented at the Maryland Casualty Club House on the evening<br />\nof February 21. Last year the tradition of holding the home concert on the evening preceding the<br />\nCommemoration Day was started<br />\nand is continued again this year.<br /><br />\nContinued on page 2, col. 4<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 15, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\nMid-Winter<br />\nSPORTING<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nB UNK<br /><br />\nHopkins swimmers succeeded<br />\nin breaking two Black and Blue<br />\nrecords and tying one when they<br />\nBusiness communications should be addressed to the BUSINESS MANCatholic University last<br />\ntrimmed<br />\ncommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nSaturday night to the tune of 56<br />\nshould be sent to the MANAGING EDITOR.<br />\nto 15. The 160 yard relay team<br />\ncomposed of Bahlke, Captain<br />\n100<br />\nHomewood<br />\nTelephone<br />\nDunning, Lord, and Welsh clipped 1 1-5 seconds off the former<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nrecord when they covered the disPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\ntance in 1 :21 3-5. Bahlke swam<br />\nManaging Editor<br />\nAdvertising Manager<br />\nthe<br />\n220 in 2:41 1-5, 1-5 of a secWILLIAM G. DEAN, JR., '24<br />\nA. J. MoKAY,'26<br />\nond faster than the former record<br />\nAssistant Managing Editor<br />\nheld by Peirce Coady. Bob Welsh<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nswam<br />\nthe 40 in 19 3-5 seconds,<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\nequaling<br />\nthe former record held<br />\nRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\n\"Davy\"<br />\nRowland.<br />\nby<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nBENJAMIN T. ROME, '25<br />\n*<br />\n* .<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nyard dash will be added to the Relay Carnival this year. Eric Liddell of Edinburgh University,<br />\nScotland, British 100 and 220 yard<br />\nchampion, will compete at the<br />\nPenn Relays. Liddell has run<br />\nthese events in 9 7-10 and 21 3-5<br />\nseconds respectively. Clarke and<br />\nLiddell ought to stage a great duel<br />\nin these events at the Relays.<br />\nHOPKINS-FIFTH REGIMENT MEET<br />\nDRAWING BIG ENTRIES<br />\nContinued from page 1<br /><br />\nCOLLEGIATE BOARD REINSTATES TEN MEN<br />\nOut of the twenty-eignt students that failed at the Johns Hopkins University ten have been reinstated. In the academic college eight men were fortunate<br />\nenough to be taken back, whereas<br />\nonly two engineers were permitted to re-enter. By reason of the<br />\nreinstatements the total number<br />\nof flunks has dropped to eighteen,<br />\nten from the academic and eight<br />\nfrom the engineering schools. It<br />\nis estimated that those who com1<br />\n2% of<br />\npletely failed comprise 2/<br />\nbody.<br />\nthe student<br /><br />\nversity, William and Mary, Richmond College, who is sending<br />\nTharpe, a half-miler, and Princeton.<br />\nFive teams are listed in the mile<br />\nrelay. Lafayette, Maryland, New<br />\nYork University, Navy and Richmond each having runners awaiting the pistol. Lafayette has two<br />\nstars in Mallich and McDonald, the<br />\nlatter titleholder in the Middle<br />\nStates quarter-mile. The Middies<br />\nwill have Hammond, Tobleman,<br />\nFoss and Shephard in this event.<br />\nTrophies will be awarded by sevJOHN T. DIXON, '24<br />\nCornell has taken the lead in<br />\nJunior Editors<br />\norganizations, including fratereral<br />\nC. EUGENE TOVELL,'24<br />\nARTHUR L. NELSON, '26<br />\nthe Intercollegiate Basketball<br />\nnities on the Hopkins campus.<br />\nOTHO J. KET.T.F,R, III, '26<br />\nERNEST A. STRATHMAN, '26<br />\nLeague by defeating PennsylALGER G. HISS, '26<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nThe alumni of the University of<br />\nEDWARD 0. MICHEL, '26<br />\nvania 17-14 in a hard fought game<br />\nT. STRAN SUMMERS, '25<br />\nYou'd be surprised at what<br />\nhave announced that<br />\nPennsylvania<br />\nJAMES YOUNG, '25<br />\nat Ithaca last Saturday night.<br />\nHEYWARD E. BOYCE, JR., '27<br />\nhe knows! He didn't learn<br />\nHENRY R. TURNBULL, '26<br />\nthree-legged<br />\ncup<br />\nwill<br />\ngive<br />\na<br />\nthey<br />\nit all in a book, either. For<br />\nThe \"Big Red Team\" has now<br />\nHAROLD S. GOODWIN, '26<br />\ninstance—his clothes are<br />\nwon three games and lost one. Co- to the Baltimore prep school scordreams and his grooming an<br />\ninspiration.<br />\nlumbia is in second place with ing the most points.<br />\nMember Southern Intercollegiate Newspaper Association<br />\nHe gets that finely turned-out<br />\nSpaulding sporting goods store<br />\ntwo victories and one defeat.<br />\nhead from \"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nwill award a trophy in the 5,000<br />\n* * *<br />\nAt all drug stores and student<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nbarber shops.<br />\nLermond of Boston College, meter handicap.<br />\nEvery!`Vaseline\" product is<br />\nwho will compete in the 5,000 me- Phi Epsilon Pi fraternity will<br />\nrecommended everywhere<br />\nbecause of its absolute puinterscholastic<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 15, 1924<br />\nin<br />\nthe<br />\naward<br />\na<br />\ncup<br />\nter event at the Johns Hopkinsrity and effectiveness.<br />\none<br />\nmile<br />\nrelay.<br />\nFifth Regiment games, won the<br />\nCornell Alumni will award a<br />\nthree-mile run at the recent Millrose games in New York in the point trophy to prep schools in<br />\nALUMNI HOUSE-WARMING<br />\nfast time of 15 minutes, 2-5 of a Maryland. Baltimore City College<br />\nThe Dormitory house-warming on February 22 should stimulate second, defeating Freddie Wachs- already has two legs on this cup.<br />\nThe Civitan Club has announced<br />\nthe alumni into activity as nothing else could. A man who graduates ninth of the Glencoe A. C., naChesebrough Mfg.Co.<br />\nit will give a cup in the Collegiate<br />\ntional<br />\njunior<br />\nchamcross-country<br />\n(consolidated)<br />\nUnifrom Hopkins will never quite forget his student days. If the<br />\npion by 40 yards. Lermond, medley relay.<br />\nversity is mentioned, however, he will say, between puffs of a cigar: therefore, looms up as a formid\"Yes, it was a good old place. I'll have to go out some time and able opponent for our own Verne<br />\nlook it over.\" And he will resume his dictation to his stenographer Booth. The result of this race may<br />\nand will promptly relegate thoughts of his undergraduate life and have a direct bearing on the selections for the American Olymof Johns Hopkins to the deep recesses of his subconscious mind.<br />\npic team.<br />\n* * *<br />\nBut surrounded by scenes of undergraduate activity and viewing<br />\nFrom the Yale News<br />\nclassmates and comrades of college pranks close at hand, the alumnus, Hopkins dopesters on track<br />\nstaid old business man though he may be, will not be able to dismiss have picked what they consider<br />\nTHE NINETY-FOUR<br />\nleading<br />\nsuch thoughts so lightly. He will feel a little pang; he will uncover to be this country's ten<br />\nSomeone,<br />\nprobably an insurance<br />\nsprinters in the following order:<br />\nold memories; he will experience a certain sympathy for the student<br />\nrecently as saying<br />\nagent,<br />\nwas<br />\nquoted<br />\nLoren Murchison, Newark A. C.;<br />\nthat from the mass of one hundred<br />\nof today. Such a meeting cannot help but bring many graduates Charles Paddock, Los Angeles A.<br />\ncollege graduates one individual only<br />\ncloser to the university and closer to the undergraduate body.<br />\nC.; Alfred Leconey, Meadowbrook<br />\nrose to the Polo and butler class, perilously near the top of the financial ladClub;<br />\nHopLouis<br />\nClarke,<br />\nJohns<br />\nA more favorable opportunity for acquainting the alumni with<br />\nder. Five others became comfortably<br />\nFred<br />\nkins;<br />\nLovejoy,<br />\nNew<br />\nYork<br />\nthe fact that Hopkins is in dire need of a gymnasium and student<br />\noff and found themselves after twenty<br />\nactivities building could not be found. As we said recently our only A. C.; Eric Wilson, Iowa; Chesyears at the small yacht and chauffeur<br />\nter Bowman, Syracuse; Fred Tystage. The other ninety-four presumhope for obtaining such equipment lies in alumni support.<br />\nkle, Purdue; \"Boots\" Lever, Inably congregate in the great section of<br />\nIt takes but one man to start the ball rolling.<br />\nthe American people who drive their<br />\nsurance Company of North Amerown Buicks to the golf club. In other<br />\nica, and Francis Hussey, Stuyvewords, dreaming about being a rich<br />\nsant H. S., N. Y. In making out<br />\nman is one thing, and making the grade<br />\nWEALTH AND HONOR<br />\nthis list, the dopesters have taken<br />\nis something else again.\"<br />\nYet the ninety-four presumably work<br />\nWriting is distasteful to the average undergraduate; the very into consideration past performjust<br />\nas hard as the sumptuous six. Their<br />\nword possesses an unpleasant connotation. This, perhaps, is merely ances in both the 100 and 220<br />\nbusiness is the axis on which a small<br />\na result of compulsory, periodical themes which one faces through yard dashes. Woodring, IMillrose<br />\nand uninteresting world revolves. They<br />\nhave become devotees of the dollar<br />\nyears of grammar school, high school and college. \"Nothing is A. C., is omitted as he is primarily<br />\nand when that fickle deity deserts, have<br />\npleasant joined with a must.\" And writing, not very difficult in a quarter miler and has given up<br />\nnowhere else to turn. Jammed in a<br />\nitself, becomes extremely laborious and arduous under the influence running the 100. Whitman of<br />\ndull,<br />\nstraight rut of business they can<br />\nMichigan is a good performer in<br />\nof the imperative.<br />\nnever leave the road and jump the fence<br />\nthe century but has little ability<br />\ninto finer fields of life. This, then, is<br />\nIf a college man were told that he could not think coherently, in the 220. Hill, Pennsylvania, is<br />\nthe portion of ninety-four men out of<br />\nit is certain that he would resent the allegation. Yet writing is merely a promising sprinter who unevery hundred now on the campus.<br />\nthe process of transferring one's thoughts from the mind to paper. doubtedly will be heard from in<br />\nThe answer to the problem lies in<br />\nthe proper choice of a career.<br />\nThe difficulty of composition lies in the fact that thoughts are lacking. future meets.<br />\n* * *<br />\nIf one has ideas the task of expressing these should not prove<br />\nexhausting.<br />\nAmerica's best Olympic bet in<br />\nBetween now and Commencement<br />\nthe<br />\n1500<br />\nmetres<br />\nappears<br />\nto<br />\nbe<br />\nAn opportunity has been offered Hopkins undergraduates to write<br />\nwe shall have something to offer on<br />\nwithout feeling the pressure of the inevitable and malignant \"must.\" Lloyd Hahn, Boston A. A., who<br />\nthe subject of \"Careers.\" Watch for<br />\nDr. Hollander, a member of the Faculty, is again offering a substan- recently gave Joie Ray a bad<br />\nbeating<br />\nin<br />\na<br />\nmile<br />\nrun,<br />\nthe<br />\n2-3<br />\nof<br />\nthe space with the Famous Signature.<br />\ntial cash prize and a medal for the best contribution to the NEWSwithin 2-5 of a second of<br />\ncoming<br />\nLETTER by an undergraduate. We fear that many will be prevented<br />\nthe world's record for that disfrom entering the competition by the usual feeling, \"I can't write.\"<br />\ntance. This was the second time<br />\nAnd to these we reply:\"You can think; you can write.\"<br />\nthis season that Hahn has led Ray<br />\nTItJ,VA L<br />\nThe financial reward to be gained by the winner of the Hollander to the tape.<br />\nINSURANCE COMPANY<br />\nLIFE<br />\n* * *<br />\nPrize is not negligible. The honor attached is considerable. We<br />\nOF BOSTON. MASSACHUSETTS<br />\nwould suggest that those who can, as well as those who think they<br />\nThe athletic management at<br />\nPenn has announced that the 220<br />\ncan't, enter the contest.<br /><br />\nCI<br /><br />\nSOPHISTICATED<br /><br />\naseline<br /><br />\nHAIR TONIC<br /><br />\nChoice of a Career<br /><br />\n1.<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 15, 1924<br />\nCOLLEGE ATHLETICS SUP- PRESIDENT OF UNIVERSITY JUNIOR-SENIOR DEBATE TO<br />\nOF MICHIGAN CONDEMNS<br />\nPORTED BY FOOTBALL<br />\nBE HELD TONIGHT IN<br />\n\"COLLEGE BABBITS\"<br />\nRECEIPTS<br />\nC. E. HALL<br />\n\"What has the college become?<br />\nThe only paying sport at the<br />\nAt 8 o'clock this evening in the<br />\nIt has become a thing of rushing<br />\nPenn State University is football,<br />\nrabbles, jazz orchestras, pep meet- Civil Engineering Hall, the teams<br />\nwhich during the last year netted ings, frolics, hops and schedules of the Junior and Senior classes<br />\n$150,000. In addition to this fitted to make the second show at will debate the subject, \"Resolved,<br />\namount, $21,000, the university's the movies. The rushing rabble that the United States should enshare in the Pasadena game with is inevitably driven away from Ler the World Court.\" The Senior<br />\nSouthern California on January 1, the spirit of higher learning and representatives — William Gross,<br />\nour object is lost. In every home<br />\nhas been contributed to the aththe powerful man of business is Frederick Moehle and John Croletic association building 'fund the hero of the<br />\nker—will uphold the affirmative;<br />\nday.<br />\nwith a $100,000 pledge made by \"What we have done is snuffed the Junior team—Sydney Cone,<br />\nthe alumni. New land for a uni- out our inner life. Democracy is Jerome Shapiro, Elmer Mylander,<br />\nYouth has and Gordon 'Post, alternate—will<br />\nversity golf course cost $11,000, partly responsible.<br />\ngot<br />\nthe<br />\nimpression<br />\nit might go<br />\nwhile the intra-mural construction<br />\ntake the negative.<br />\nwith the crowd. It must be popprogram called for an additional<br />\nular.<br />\nIt has become terribly<br />\nThe judges for the debate have<br />\n$6,000. Besides the $100,000 alumafraid of being different. It has not been announced. According<br />\nni fund, which will be used prinbeen tremendously externalized to custom,<br />\none member of the<br />\ncipally in the erection of a new and<br />\nobjectified. . . . Students<br />\nfaculty,<br />\none alumnus, and one<br />\ngymnasium, $10,000 has been re- must<br />\nhave a sense of integrity and<br />\nceived for equipment in this the<br />\ncourage of their convictions. prominent citizen, will be on the<br />\nbuilding for the women students.<br />\n. . . When in American civ- committee.<br />\n—Exchange. ilization it comes to pass that the<br />\nThere will be no charge for adfamily which raises a poet, a sci- mission.<br />\nentist, or a teacher will be as<br />\nWESTINGHOUSE COMPANY proud as if he were a financial<br />\nDROPPING A \"LINE\"<br />\nHAS EXCELLENT LABgenius, then you can put religion<br />\nORATORY FOR TESTS<br />\nas a vital factor in American col- Jackie, Jo, Jane, and Jess,<br />\nIn visiting the High Voltage Lab- leges.\"<br />\nMargie, Martha, Mae;<br />\nThis is part of the speech of —Ought to find my mailbox full<br />\noratory of the Westinghouse Company, the delegates saw one of the President Marion S. Burton of<br />\nAlmost ev'ryday!<br />\nfinest laboratories of its kind in the the University of Michigan at the<br />\nworld. The laboratory contains tenth annual meeting of the As- Lois, Lucy, 'Lis'beth, Lou,<br />\ntwo mammoth transformers, one sociation of American Colleges<br />\nBillie, Beth, and Bea,<br />\nhaving a rating of 1,000,000 volts, held two weeks ago in Manhattan Add their scented letters<br />\n1,000 kv-a. Other million-volt sets as quoted in \"Time\" under the<br />\nAnd await returns from me.<br />\nuse two or more transformers to heading \"College Babbits.\"<br />\nproduce this supervoltage. There<br />\nOf interest to faculty members Elsie, Ethel, Eve, and Ede,<br />\nis also a half-million volt trans- is another paragraph in the same<br />\nAileen,. Agnes, Al,<br />\nformer in the laboratory, which is article.<br />\nTake their turns at writing,'<br />\nused for making smaller tests. The \"Dr. C. A. Richmond, president<br />\nAnd likewise Sue and Sal.<br />\ncontrol equipment is an outstand- of Union College, endeared himing development in the electrical in- self to all college instructors by Don't you think I'm popular?<br />\ndustry. The complete transformer speaking against the raising of<br />\nWhat a line I shoot!—<br />\nequipment with switches, motors their salaries. He said that teach- No, I'm just the postman<br />\nand generators is directly under the ers should have a missionary spirOn a co-ed college route!<br />\nhand of a single operator stationed it and to insure this they must be<br />\n—Lord Jeff.<br />\nat the laboratory. The remote con- paid less than they are worth.\"<br />\ntrol is used throughout to eliminate<br />\nany possibility of accident through<br />\nREPORT OF STUDENTS ACTIVITIES COUNCIL<br />\nhandling these high voltages. A<br />\nFebruary 12, 1924<br />\nsystem of horns warns everyone<br />\nBalance<br />\nwhen to expect the tes-t, and in this Student Activities Council<br />\nCash<br />\nreceived<br />\n$627.14<br />\nway, also, danger of accidents is<br />\nCash disbursed<br />\n372.40<br />\nminimized.<br />\n$254.74<br />\nNews-Letter<br />\nPRUlTERS<br />\nEUGRAUERS<br />\nBIRDERS<br />\nCash received<br />\n$1,262.24<br />\nCash disbursed<br />\n1,257.65<br />\n4.59<br />\nBlack and Blue Jay<br />\nCollele Literature<br />\nCash received<br />\n$1,386.45<br />\nCash disbursed<br />\n974.07<br />\n412.38<br />\nHullabaloo<br />\nCash received<br />\n$1,410.92<br />\nCash disbursed<br />\n137.82<br />\n1,273.10<br />\nDaily Bulletin<br />\nCash received<br />\n$99.90<br />\nCash disbursed<br />\n11.00<br />\n88.90<br />\nBarnstormers<br />\nCash received<br />\n$1,068.47<br />\nCash disbursed<br />\n267.69<br />\n800.78<br />\nDebating Council<br />\nCash received<br />\n$342.52<br />\nCash disbursed<br />\n14.75<br />\nPrinters of<br />\n327.77<br />\ncrhe Johns Hopkins<br />\nMusical Club<br />\nCash received<br />\n$548.47<br />\nNEIDS.-LETTER<br />\nCash disbursed<br />\n372.20<br />\n176.27<br />\nY. M. C. A.<br />\nLOMBARD and SOUTH STREETS<br />\nCash received<br />\n$970.64<br />\nCash disbursed<br />\n737.63<br />\n233.01<br />\nCollege and Fraternity Stationery<br />\nBand<br />\nBanquet and Dance Cards, Invitations<br />\nCash received<br />\n$238.28<br />\nJAS. H. DOWNS<br />\nCash disbursed<br />\n203.07<br />\nENGRAVER PRINTER STATIONER<br />\n35.21<br />\n229 N. CHARLES ST.<br /><br />\n—<br /><br />\n$3,606.75<br /><br />\n3<br /><br />\nri<br /><br />\nThe man who buys a Stetson because of its style later discovers<br />\nthe long wearing qualities which<br />\nmake Stetson the choice of well<br />\ndressed men—everywhere.<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\n\"A cap as good as the cream\"<br />\nHigh praise for Williams Shaving Cream is contained in<br />\nthis suggested slogan for the Hinge-Cap. Yet truly, the<br />\ncombination offaster beard-softening,elimination ofrazor<br />\nfriction through lubrication of the skin, and the extraordinary care of the skin which Williams gives,has never<br />\nbeen equalled by any other shaving cream. And Williams<br />\nis a pure product, absolutely without coloring matter!<br />\nBegin on a tube—compare it in every way.<br /><br />\n$250 in. Prizes<br />\nFor the best sentence of ten words or less on the value of the<br />\nWilliams Hinge-Cap, we offer the following prizes: 1st prize<br />\n$100; 2nd prize $50; two 3rd prizes, $25 each; two 4th prizes,<br />\n$10 each; six 5th prizes, $5 each. Any undergraduate or<br />\ngraduate student is eligible. If two or more persons submit<br />\nidentical slogans deemed worthy of prizes, the full amount of<br />\nthe prize will be awarded to each. Contest closes at midnight<br />\nMarch 14, 1924. Winners will be announced as soon thereafter as possible. Submit any number of slogans but write<br />\non one side of paper only, putting name, address, college and<br />\nclass at top of each sheet. Address letters to Contest Editor,<br />\nThe J. B. Williams Co., Glastonbury, Conn.<br /><br />\nThis is the new Hinge-Cap<br /><br />\nWilliams<br />\nShaving Cream<br /><br />\nDe<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\nThe Greetings ofa Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD.KOHN 8c Co.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 15, 1924<br /><br />\n4<br /><br />\nALWAYS USE A<br />\ntigating committee shall be acLIBERTY ST.<br />\ncepted or rejected by a majority<br />\nYELLOW CAB<br />\nAT SARATOGA<br />\nvote of the board, the accused fraOR PHONE<br />\nternity having no vote, and upon<br />\nLUNCHEON<br />\nVERNON 1212<br />\nthe decision of the board a trial<br />\nTEA<br />\nHAIL THEM ANYWHERE<br />\nshall be instituted.<br />\nDINNER<br />\nSec. 3. The trial shall be held<br />\nArt. II. Sec. 1. The membernot sooner than one week after<br />\nship of the Interfraternity Board<br />\nSPECIAL PARTIES<br />\nA. JACOBS &amp; SONS<br />\n11.30 A. M.<br />\nthe report of the investigating<br />\nshall consist of one Junior and<br />\nuntil<br />\nTailors<br />\ncommittee.<br />\nPLAZA 6987<br />\n7.30 P. M<br />\none Senior delegate from each<br />\nUniforms and Liveries<br />\nWe want a live wire salesman<br />\nof<br />\nmembers<br />\nsenior<br />\nThe<br />\n4.<br />\nSec.<br />\nfraternity upon the board, or in<br />\n128 W. FAYETTE ST.<br />\nthe board shall sit as a court dur- to represent us on the campus.<br />\nOne who wishes to make some<br />\nBaltimore, Md. the future to be admitted to the<br />\nNear Liberty St.<br />\ning the trial, and the chairman easy money putting in a few<br />\nBoard.<br />\nof the Student Affairs Commit- hours of spare time—interviewing<br />\nSec. 2. Petitioning locals must<br />\ntee, or someone appointed by him, -profs- and students—to sell<br />\npass through a period of probation<br />\nshall act as presiding officer, Ford Cars. To the right man we<br />\nof three years, during which time<br />\nwithout a vote. The investigat- have a regular position when colthey shall obey the regulations<br />\nCall immediately at<br />\ning committee shall prosecute the lege closes.<br />\n325 Park Avenue. Ask for Mr.<br />\nand rules of the board, and shall<br />\ncharges.<br />\nLong or Mr. Watson.<br />\n11.&amp; OSCAR G•1-5•<br />\nbe represented thereon without<br />\nboth<br />\non<br />\nevidence<br />\nAfter<br />\n5.<br />\nSec.<br />\nOWNERS<br />\nthe power to vote, before they<br />\nand ar‘k<br />\nrilf1/4/t<br />\n'itiz.z*\"1•<br />\ncan be admitted to active mem- sides has been presented<br />\nshall<br />\nbe<br />\nvote<br />\na<br />\nclosed,<br />\nguments<br />\nE. BALTIMORE ST.<br />\n29<br />\nBoard.<br />\nthe<br />\non<br />\nbership<br />\nLimited<br />\ntaken. If two votes are cast for<br />\nAgents for JOHN B. STETSON HATS<br />\n325 PARK AVENUE<br />\nSec. 3. National fraternities in<br />\nand FRATERNITY BANDS<br />\nacquittal the charges shall be disshall<br />\nbe<br />\nadmitted<br />\nstanding<br />\n(-rood<br />\nA<br />\nCAFETERI<br />\nBARN<br />\nmissed. The accused fraternity<br />\nto full standing as soon as a bona<br />\nshall have no vote.<br />\n,fide chapter has been established<br />\nSec. 6. When a fraternity, after<br />\nand have passed through one rushORDERS RECEIVED FOR<br />\nbeen<br />\ning season, observing the rules of the prescribed trial, has<br />\nimbe<br />\nshall<br />\nfound guilty, a fine<br />\nCOGGINS'<br />\nthe Interfraternity Board.<br />\nexceed<br />\nposed by the judges, not to<br />\nTransfer &amp; Baggage Express<br />\nArt. III. The officers shall con$100.00. The fine shall be deductsist of a president and a secretaryAUTOMOBILE SERVICE<br />\ned from the bond deposited by<br />\nPHONE, HOMEWOOD 6886<br />\ntreasurer, and shall be elected at<br />\n13 SOUTH ST.<br />\nthe guilty fraternity.<br />\nthe last meeting of the Board in<br />\nVIII. All questions of inArt.<br />\nThe Flag, Banner &amp; Pennant Shop each college year. Each delegate terpretation of the constitution,<br />\nshall have one vote in an election<br />\n(Successors to Sisco Brothers)<br />\nJohn J. Nelligan, President<br />\nOrganized 1864<br />\nby-laws and Rushing Agreement<br />\nFlags, Banners, Pennants, Arm Bands, of officers.<br />\nSchools,<br />\nfor<br />\nBanners<br />\nEmblems, Silk<br />\nshall be made by a two-thirds vote<br />\nSocieties and Fraternities<br />\nArt. IV. The purpose of the of the fraternities upon the board.<br />\n302 PARK AVE., BALTIMORE, MD. Board shall be to regulate and<br />\nR. H. Taylor<br />\nVernon 2355<br />\nBy-Laws<br />\ncontrol interfraternity relations at<br />\nbe no prep-school<br />\nshall<br />\nI. There<br />\nthe University, and in so far as<br />\npossible to promote better feeling rushing.<br />\nII. Regular meetings shall be<br />\nbetween the fraternities.<br />\nArt. V. Sec. 1. In all matters held once each week, upon a speexcept election of officers, each cified date. Absence from a meetchapter shall have but one vote. ing shall incur a fine of $1 upon<br />\nMEN'S SHOES<br />\nCorner c\"Jayelle and Aztaw Sts.<br />\nthe absent fraternity.<br />\nSec. 2. A two-thirds vote of the<br />\nOf the Better Class<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nfraternities at any regular meeting<br />\nDORMITORY DENIZENS WILL HOLD<br />\nmoany<br />\npass<br />\nto<br />\nsufficient<br />\nshall<br />\nbe<br />\nURNER BROTHERS<br />\nELECTION<br />\ntion or provision except a Rushing<br />\nContinued from page 1<br />\n111 E. BALTIMORE STREET<br />\nAgreement or amendments to the<br />\nBaltimore<br />\npublication of the results of the<br />\nconstitution and by-laws.<br />\nexaminations; and one<br />\nmid-year<br />\nSec. 3. The Rushing Agreeby the manager of<br />\nchosen<br />\nman<br />\nis<br />\nEstablished 1873<br />\nment and constitutional amendto represent the<br />\nDormitory<br />\nthe<br />\nments shall be referred to the<br />\nA. H. FETTING MAN'FG<br />\npermanently.<br />\nusually<br />\nmanagement,<br />\nJEWELRY CO.<br />\nchapters and an affirmative vote<br />\nis guarcommittee<br />\nstable<br />\nvery<br />\nManufacturers<br />\nand individuality is offered here at prices that are not<br />\nfrom all, save one, shall be neces- A<br />\nGreek Letter Fraternity Jewelry<br />\nelection,<br />\nof<br />\nmethod<br />\nthis<br />\nby<br />\nanteed<br />\nand cannot be underquoted by any house at any time.<br />\nsary for acceptance.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nare<br />\nwho<br />\nmen,<br />\nthree<br />\nprovides<br />\nwhich<br />\nSec. 4. In case of failure to<br />\n11.. Besides the reputation of an old-established firm<br />\nthe work and duties<br />\n.14,44 4014 R4 114 1141101414 114 114,11:4,11.4,114.114.1R1.1411.14:1141114,11.4'11.4$141I0I4' agree upon a Rushing Agreement well versed in<br />\nis back of each sale with a guarantee.<br />\nfor<br />\nfor the coming year, the agree- of the committee, as a nucleus<br />\nman<br />\nment adopted for the preceding the new body. For example, a<br />\nthe<br />\nuntil<br />\nserves<br />\nin<br />\nFebruary<br />\nchosen<br />\nyear shall remain in force.<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nman<br />\na<br />\nwhile<br />\nFebruary,<br />\nfollowing<br />\nArt. VI. A bond of $100.00<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nwill<br />\nOctober<br />\nlast<br />\nwas<br />\nelected<br />\nwho<br />\nshall be deposited by each fraternity and each probationary mem- end his term next October. A full<br />\nOTO<br />\nber on the Board, and fines for committee will be at hand, there\"The King of Lubricants\" breaches of the Rushing Agree- fore, every October to start off the<br />\nment shall be deducted from this new men in the Dormitory in good<br />\nshape.<br />\nsum.<br />\nSHERWOOD BROTHERS, INC.<br />\nIf any money is deducted from<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nNgmuggg:g=1,1,,NgmTflriNINMCiEl=0 this bond, a sufficient sum shall SCHOOL OF HYGIENE HEARS PUBPROGRAM FOR STUDENTS<br />\nLIC HEALTH TALK<br />\nat once be deposited by the fraContinued from page 1<br />\nBIBLE CLASS, 10 A. M.<br />\nternity fined to make the total of<br />\nAn Interesting Discussion of<br />\nthis phase of public health, collectBoys, the place to get your<br />\nthe bond again $100.00.<br />\nVital Topics Under<br />\nhis work in Canada. The<br />\nduring<br />\ned<br />\nfor<br />\nof<br />\ntrial<br />\nform<br />\nVII.<br />\nThe<br />\nArt.<br />\nmeals—and they are honDR.<br />\nA. KELLY, Leader<br />\nHOWARD<br />\nbeen<br />\nhas<br />\nfraternities accused of breach of extent to which this work<br />\nest-to-goodness meals, well<br />\nother<br />\nthe Rushing Agreement shall be carried on in Toronto, and in<br />\nYOUNG PEOPLES AT-HOME<br />\nserve d, and reasonably<br />\nCanadian cities, compared with simas follows:<br />\n5-7 P. M.<br />\nat<br />\npriced—is<br />\nSec. 1. When a fraternity is ac- ilar work in America, was strikTEA SERVED AT 6 O'CLOCK<br />\ncused of breaking the agreement, ingly given. The health official said<br />\nvispurpose,<br />\nof<br />\ndetermination<br />\nthat<br />\nthe President of the Board shall<br />\nEPWOR1 H LEAGUE<br />\nappoint a committee to investi- ion and the ability to enlist munici7-8 P. M.<br />\ngate the charges. This commit- pal support to carry out his knowlthe<br />\nfor<br />\nrequisites<br />\nprime<br />\nare<br />\nedge<br />\ntee shall make a complete survey<br />\nSPECIAL STUDENTS AT-HOME<br />\nof the evidence, and at the next municipal health officer. Decreased<br />\n1817 N. Charles St.<br />\ninparticularly<br />\nFEBRUARY 17<br />\nmeeting shall recommend to the rates of mortality,<br />\n(Half Block below North Ave.)<br />\nBoard either the prosecution or fant mortality, were shown to be<br />\nCOME DOWN AND<br />\nthe result of increased expenditure<br />\ndismissal of the charges.<br />\nGET ACQUAINTED<br />\nNicholas Brown, Mgr.<br />\nAt the Washington Monument<br />\nSec. 2. The report of the inves- for public health work in Toronto.<br /><br />\nINTERFRATERNITY BOARD<br /><br />\nSHIRT MAKER<br />\nCONSTITUTION<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\n(Reprinted by Request)<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nArt. I. The name of the organiTerms Cash, Less 10% 30 days on Shirts<br />\nzation shall be \"The Johns HopAlso a Full Line of Men's<br />\nFurnishings<br />\nkins Interfraternity Board.\"<br /><br />\nSTRATTON<br /><br />\nV<br /><br />\nSALESMAN:<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nLU'eXatteriv<br />\n‘LANits<br /><br />\nC. A. GOODWIN<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nURNER'S<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nila<br /><br />\n- OHM<br />\n12<br /><br />\nMount VernonPlaceM.E.Church<br /><br />\nThe Si. REGIS<br />\nRESTAURANT<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br /><br />\n,<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nVERY IMPORTANT!<br /><br />\nBE A NEWSPAPER CORRESPONDENT<br /><br />\nRehearsal of Barnstormers' Club tonight at 7.30 P. M.<br />\nat the Barn.<br />\nAll members of the Club and candidates for the Cast<br />\nand Art and Property Staffs are requested to be present.<br /><br />\nwith the Heacock Plan and earn a good income while learning;<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nexperience tinnecessary; no canvassing; send for particulars.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nBuffalo, N. Y.<br /><br />\nJi<br /><br />"}], "field_media_file": [{"target_id": 37831, "display": null, "description": null, "target_type": "file", "target_uuid": "a6448452-4a49-42f2-a92d-7600489bde33", "url": "http://digital.library.jhu.edu/system/files/2022-03/13105-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13105, "target_type": "node", "target_uuid": "70e5965f-a794-4135-b5b2-85d464ffdc9e", "url": "/node/13105"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7b01e59a-6c75-4e72-94fa-68fcd2aa9904"}]}